{"id":"10826041_Informatics_for_Unveiling_Hidden_Genome_Signatures","abstract":"With the increasing amount of available genome sequences, novel tools are needed for comprehensive analysis of species-specific sequence characteristics for a wide variety of genomes. We used an unsupervised neural network algorithm, a self-organizing map (SOM), to analyze di-, tri-, and tetranucleotide frequencies in a wide variety of prokaryotic and eukaryotic genomes. The SOM, which can cluster complex data efficiently, was shown to be an excellent tool for analyzing global characteristics of genome sequences and for revealing key combinations of oligonucleotides representing individual genomes. From analysis of 1- and 10-kb genomic sequences derived from 65 bacteria (a total of 170 Mb) and from 6 eukaryotes (460 Mb), clear species-specific separations of major portions of the sequences were obtained with the di-, tri-, and tetranucleotide SOMs. The unsupervised algorithm could recognize, in most 10-kb sequences, the species-specific characteristics (key combinations of oligonucleotide frequencies) that are signature features of each genome. We were able to classify DNA sequences within one and between many species into subgroups that corresponded generally to biological categories. Because the classification power is very high, the SOM is an efficient and fundamental bioinformatic strategy for extracting a wide range of genomic information from a vast amount of sequences.\n[Supplemental material is available online at www.genome.org .]","authors":["Takashi Abe","Shigehiko Kanaya","Makoto Kinouchi","Yuta Ichiba"],"meta":["May 2003Genome Research 13(4):693-702","DOI:10.1101/gr.634603","SourcePubMed"],"references":["316826786_Gene_Classification_Method_Based_on_Batch-Learning_SOM","315330894_Codon_usage_and_tRNA_content_in_unicellular_and_multicellular_organisms","270819378_The_self-organizing_map","247393977_Requirement_of_CHROMO-METHYLASE3_for_maintenance_of_CpXpG_methylation","238823616_correction_The_DNA_sequence_of_human_chromosome_22","238754474_Isolation_ofcDNAsEncoding_theDrosophila_GAGA_Transcription_Factor","226370746_Kohonen_T_Self-Organized_Formation_of_Topologically_Correct_Feature_Maps_Biological_Cybernetics_431_59-69","225858262_Identification_of_the_Gene-Richest_Bands_in_Human_Prometaphase_Chromosomes","222550319_Analysis_of_codon_usage_diversity_of_bacterial_genes_with_a_self-organizing_map_SOM_Characterization_of_horizontally_transferred_genes_with_emphasis_on_the_E_coli_O157_genome","221669764_Self-organised_formation_of_topologically_correct_feature_map"]}