{"id":"11210672_Cross-Cultural_Evidence_of_Cognitive_Adaptations_for_Social_Exchange_among_the_Shiwiar_of_Ecuadorian_Amazonia","abstract":"On the basis of evolutionary game theory, it was hypothesized that humans have an evolved cognitive specialization for reasoning about social exchange, including a subroutine for detecting cheaters. This hypothesis led to a specific prediction: Although humans are known to be poor at detecting potential violations of conditional rules in general, they should nevertheless detect them easily when the rule involves social exchange and looking for violations corresponds to looking for cheaters. This prediction was subsequently confirmed by numerous tests. Evolutionary analyses further predict that: (i) in humans, complex adaptations will be distributed in a species-typical fashion; and (ii) aspects of cognitive organization relevant to performing the evolved function of an adaptation should be more buffered against environmental and cultural variation than function-irrelevant aspects. Here we report experiments testing whether social exchange reasoning exhibits these properties of adaptations. Existing tests of conditional reasoning were adapted for nonliterate experimental subjects and were administered to Shiwiar hunter-horticulturalists of the Ecuadorian Amazon. As predicted, Shiwiar subjects were as highly proficient at cheater detection as subjects from developed nations. Indeed, the frequency of cheater-relevant choices among Shiwiar hunter-horticulturalists was indistinguishable from that of Harvard undergraduates. Also as predicted, cultural variation was confined to those aspects of reasoning that are irrelevant to social exchange algorithms functioning as an evolutionarily stable strategy. Finally, Shiwiar subjects displayed the same low performance on descriptive conditionals as subjects from developed nations. Taken together, these findings support the hypotheses that social exchange algorithms are species-typical and that their evolutionarily stable strategy (ESS)-relevant subroutines are developmentally buffered against cultural variation.","authors":["Lawrence Sugiyama","John Tooby","Leda Cosmides"],"meta":["September 2002Proceedings of the National Academy of Sciences 99(17):11537-42","DOI:10.1073/pnas.122352999","SourcePubMed"],"references":["271677914_Education_and_Cognitive_Development_The_Evidence_from_Experimental_Research","233822793_Evolutionary_Psychology_and_the_Generation_of_Culture_Part_II","272762277_Basic_Color_Terms_Their_Universality_and_Evolution","258998237_The_Latest_on_the_Best_Essays_on_Evolution_and_Optimality","247870561_The_Evolution_of_Cooperation_Basic_Books","247868646_The_Essentials_of_Behavioural_Research","247662230_The_Structures_of_Social_Life","242587282_The_Psychology_of_Reasoning_Structure_in_Context","237913217_Food_sharing_and_reciprocal_obligations_in_chimpanzees","233821147_The_Organization_of_Learning"]}