{"id":"11301525_Use_of_a_peripheral_perfusion_index_derived_from_the_pulse_oximetry_signal_as_a_noninvasive_indicator_of_perfusion","abstract":"Peripheral perfusion in critically ill patients frequently is assessed by use of clinical signs. Recently, the pulse oximetry signal has been suggested to reflect changes in peripheral perfusion. A peripheral perfusion index based on analysis of the pulse oximetry signal has been implemented in monitoring systems as an index of peripheral perfusion. No data on the variation of this index in the normal population are available, and clinical application of this variable in critically ill patients has not been reported. We therefore studied the variation of the peripheral perfusion index in healthy adults and related it to the central-to-toe temperature difference and capillary refill time in critically ill patients after changes in clinical signs of peripheral perfusion.\nProspective study.\nUniversity-affiliated teaching hospital.\nOne hundred eight healthy adult volunteers and 37 adult critically ill patients.\nNone.\nCapillary refill time, peripheral perfusion index, and arterial oxygen saturation were measured in healthy adults (group 1). Capillary refill time, peripheral perfusion index, arterial oxygen saturation, central-to-toe temperature difference, and hemodynamic variables were measured in critically ill patients (group 2) during different peripheral perfusion profiles. Poor peripheral perfusion was defined as a capillary refill time >2 secs and central-to-toe temperature difference > or = 7 degrees C. Peripheral perfusion index and arterial oxygen saturation were measured by using the Philips Medical Systems Viridia/56S monitor. In group 1, measurements were made before and after a meal. In group 2, two measurements were made, with the second measurement taken when the peripheral perfusion profile had changed. A total of 216 measurements were carried out in group 1. The distribution of the peripheral perfusion index was skewed and values ranged from 0.3 to 10.0, median 1.4 (inner quartile range, 0.7-3.0). Seventy-four measurements were carried out in group 2. A significant correlation between the peripheral perfusion index and the core-to-toe temperature difference was found (R2=.52; p <.001). A cutoff peripheral perfusion index value of 1.4 (calculated by constructing a receiver operating characteristic curve) best reflected the presence of poor peripheral perfusion in critically ill patients. Changes in peripheral perfusion index and changes in core-to-toe temperature difference correlated significantly (R =.52, p <.001).\nThe peripheral perfusion index distribution in the normal population is highly skewed. Changes in the peripheral perfusion index reflect changes in the core-to-toe temperature difference. Therefore, peripheral perfusion index measurements can be used to monitor peripheral perfusion in critically ill patients.","authors":["Alexandre Pinto Lima","Peter Beelen","Jan Bakker"],"meta":["June 2002Critical Care Medicine 30(6):1210-3","DOI:10.1097/00003246-200206000-00006","SourcePubMed"],"references":["19813746_Toe_temperature_versus_transcutaneous_oxygen_tension_monitoring_during_acute_circulatory_failure","12520535_Reflex_control_of_the_cutaneous_circulation_during_passive_body_core_heating_in_humans","276993912_Central_peripheral_temperature_gradient","245797926_Routine_Monitoring_of_Critically_I11_Patients","236310680_Treatment_of_Circulatory_Shock_With_DopamineStudies_on_Survival","224489859_Measurement_and_control_of_absolute_nitrogen_atom_density_in_an_electron-beam-excited_plasma_using_vacuum_ultraviolet_absorption_spectroscopy","22693168_Treatment_of_circulatory_shock_with_dopamine_Studies_on_survival","21980446_Observations_on_peripheral_and_central_temperatures_with_particular_reference_to_the_occurrence_of_vasoconstriction","20909680_Relationship_between_clinical_evaluation_of_peripheral_perfusion_and_global_hemodynamics_in_adults_after_cardiac_surgery","20627806_Observations_on_a_new_non-invasive_monitor_of_skin_blood_flow","20499306_A_Revision_of_the_Trauma_Score","19481296_Use_of_pulse_oximetry_as_a_noninvasive_indicator_of_intravascular_volume_status","17402913_Temperature_of_the_Great_Toe_as_an_Indication_of_the_Severity_of_Shock","16444548_A_review_of_the_skin_and_muscle_hemodynamics_during_hemorrhagic_hypotension_and_shock","15762918_Central_peripheral_temperature_gradient_Its_value_and_limitations_in_the_management_of_critically_ill_surgical_patients","14866144_History_and_recent_developments_in_pulse_oximetry","13359944_Pulse_oximetry_Principles_and_limitations","12972427_Capillary_refill_and_core-peripheral_temperature_gap_as_indicators_of_haemodynamic_status_in_paediatric_intensive_care_patients","12753222_New_techniques_for_clinical_assessment_of_the_peripheral_microcirculation"]}