{"id":"11854370_Redefining_medical_students'_disease_to_reduce_morbidity","abstract":"To gain a clearer conceptual understanding of medical students' disease and its impact on students, by separating the process of thinking that one may have a particular illness under study from the emotional distress that may accompany these thoughts.\nIn a questionnaire survey, the responses of 92 first-year and 85 third-year medical students were compared with those of 82 law students, with regard to medical students' disease perception, medical students' disease distress, hypochondriacal beliefs, concerns about health, the value placed on health, and recent visits to doctors in the past 12 months.\nThe University of Auckland, New Zealand.\nBoth groups of medical students scored higher on medical students' disease perception than law students. First-year students scored higher on medical students' disease distress and hypochondriacal concerns than both law and third-year medical students. While medical students place a higher value on health, there were no differences with regard to health visits in the past year.\nThe results support the separation of medical students' disease into perceptual and emotional components. This conceptualization of medical students' disease as a normal process rather than a form of hypochondriasis may be used to brief medical students when they enter medical school, in order to reduce the distress associated with the condition. Medical students' disease can also be used as a personally relevant example in teaching about how patients make sense of symptoms.","authors":["Rona Moss-Morris","Keith J Petrie"],"meta":["September 2001Medical Education 35(8):724-8","DOI:10.1046/j.1365-2923.2001.00958.x","SourcePubMed"],"references":["20573295_Illness_representations_and_matching_labels_with_symptoms","277706837_Hypochondriacal_Fears_and_Beliefs_in_Medical_and_Law_Students","19197969_Hypochondriacal_fears_and_beliefs_in_medical_and_law_students","18784588_Medical_Students'_Disease_Hypochondriasis_in_Medical_Education","13738498_Environmentally_friendly_health_care_begins_in_Madagascar","13640555_Health_anxiety_in_medical_students","9378663_Nosophobia_and_Hypochondriases_in_Medical_Students"]}