{"id":"12170550_The_Community_Partnerships_Experience_A_Report_of_Institutional_Transition_at_East_Tennessee_State_University","abstract":"The Community Partnerships Program, sponsored by the W. K. Kellogg Foundation, served as a catalyst for significant changes within East Tennessee State University (specifically its schools of medicine, nursing, and public and allied health) and the rural communities involved. The authors describe the development and implementation of the program and its effects on the students, faculty, communities, and the three participating schools over the period 1992-1999. They also review the changes the program fostered in health professions education and the resulting institutional changes at their university. The primary motivation for change at East Tennessee State University was the desire to develop primary care providers who could more effectively function in an interdisciplinary and interprofessional health care system and who would be sensitive to community needs in rural and underserved areas. The planning process, curricular transformation, implementation of inquiry-based learning, community collaboration, and interdisciplinary education involving students from the three health professions schools are described, including challenges and difficulties (e.g., student attrition; retention of volunteer community-based clinical preceptors; initial faculty resistance; a climate of competition rather than cooperation). Outcomes are described, including students' enrollment and attrition in the program over time, performances on the U.S. Medical Licensing Examination, program graduates' career choices, and the types and locations of their practices. The program's students performed as well on professional licensing examinations as did their peers enrolled in traditional programs. Program graduates have been much more likely to select primary care careers and to practice in rural locations than have their non-program peers. The development strategies and experience gained could give useful insights to other universities contemplating a community-based component for health professionals within their existing curricula.","authors":["Bruce Goodrow","Kenneth E. Olive","Bruce Behringer","Mary Jane Kelley"],"meta":["March 2001Academic medicine: journal of the Association of American Medical Colleges 76(2):134-41","DOI:10.1097/00001888-200102000-00009","SourcePubMed"],"references":["277417078_The_New_Mexico_experiment","20436021_The_New_Mexico_experiment_Educational_innovation_and_institutional_change","12713006_Bland_CJ_Starnaman_SM_Hembroff_L_Perlstadt_H_Henry_RC_Richards_RW_Leadership_behaviors_for_successful_university-community_collaborations_to_change_curricula","275282425_The_Road_Rally_An_Application_of_Inquiry_Based_Learning","271956336_No_Fear_Curricular_Change","245968808_Training_an_appropriate_mix_of_physicians_to_meet_the_nations_needs","232180981_Educating_the_public_health_work_force_for_the_21st_century","18722021_The_'McMaster_Philosophy'_An_Approach_to_Medical_Education","15373677_Health_care_reform_and_medical_education","14768537_Training_an_appropriate_mix_of_physicians_to_meet_the_nation's_needs","14271362_Scavenger_Hunt_A_Community-Based_Learning_Experience","13822096_A_Community_Crossword_Puzzle_An_interdisciplinary_approach_to_community-based_learning","13490081_Multidisciplinary_education_outcomes_of_the_WK_Kellogg_Community_Partnerships_and_Health_Professions_Education_Initiative","12442482_No_Fear_Curricular_Change_Monitoring_Curricular_Change_in_the_W_K_Kellogg_Foundation's_National_Initiative_on_Community_Partnerships_and_Health_Professions_Education","12442477_Curricular_Change_in_Medical_Schools_How_to_Succeed","11075826_A_Model_Rural_Health_Orientation_Course_Using_Interdisciplinary_Community_Oriented_Inquiry_Based_Strategies"]}