{"id":"12430442_Direct_identification_of_pure_Penicillium_species_using_image_analysis","abstract":"This paper presents a method for direct identification of fungal species solely by means of digital image analysis of colonies as seen after growth on a standard medium. The method described is completely automated and hence objective once digital images of the reference fungi have been established. Using a digital image it is possible to extract precise information from the surface of the fungal colony. This includes color distribution, colony dimensions and texture measurements. For fungal identification, this is normally done by visual observation that often results in a very subjective data recording. Isolates of nine different species of the genus Penicillium have been selected for the purpose. After incubation for 7 days, the fungal colonies are digitized using a very accurate digital camera. Prior to the image analysis each image is corrected for self-illumination, thereby gaining a set of directly corresponding images with respect to illumination. A Windows application has been developed to locate the position and size of up to three colonies in the digitized image. Using the estimated positions and sizes of the colonies, a number of relevant features can be extracted for further analysis. The method used to determine the position of the colonies will be covered as well as the feature selection. The texture measurements of colonies of the nine species were analyzed and a clustering of the data into the correct species was confirmed. This indicates that it is indeed possible to identify a given colony merely by macromorphological features. A classifier (in the normal distribution) based on measurements of 151 colonies incubated on yeast extract sucrose agar (YES) was used to discriminate between the species. This resulted in a correct classification rate of 100% when used on the training set and 96% using cross-validation. The same methods applied to 194 colonies incubated on Czapek yeast extract agar (CYA) resulted in a correct classification rate of 98% on the training set and 71% using cross-validation.","authors":["Thorsten Dörge","Jens Michael Carstensen","Jens Frisvad"],"meta":["August 2000Journal of Microbiological Methods 41(2):121-33","DOI:10.1016/S0167-7012(00)00142-1","SourcePubMed"],"references":["292239323_Approaches_to_Penicillium_and_Aspergillus_systematics","284578746_The_ascomycete_genus_Eupenicillium_and_related_Penicillium_anamorphs","284081516_Revision_of_the_Subsection_Fasciculata_of_Penicillium_and_some_allied_species","223406092_Colour_standards_A_review_and_evaluation_in_relation_to_Penicillium_taxonomy","18416304_Mycotoxin-Producing_Strains_of_Penicillium_viridicatum_Classification_into_Subgroups"]}