{"id":"12813546_Road_accidents_caused_by_drivers_falling_asleep","abstract":"About 29600 Norwegian accident-involved drivers received a questionnaire about the last accident reported to their insurance company. About 9200 drivers (31%) returned the questionnaire. The questionnaire contained questions about sleep or fatigue as contributing factors to the accident. In addition, the drivers reported whether or not they had fallen asleep some time whilst driving. and what the consequences had been. Sleep or drowsiness was a contributing factor in 3.9% of all accidents, as reported by drivers who were at fault for the accident. This factor was strongly over-represented in night-time accidents (18.6%), in running-off-the-road accidents (8.3%), accidents after driving more than 150 km on one trip (8.1%), and personal injury accidents (7.3%). A logistic regression analysis showed that the following additional factors made significant and independent contributions to increasing the odds of sleep involvement in an accident: dry road, high speed limit, driving one's own car, not driving the car daily, high education, and few years of driving experience. More male than female drivers were involved in sleep-related accidents, but this seems largely to be explained by males driving relatively more than females on roads with high speed limits. A total of 10% of male drivers and 4% of females reported to have fallen asleep while driving during the last 12 months. A total of 4% of these events resulted in an accident. The most frequent consequence of falling asleep--amounting to more than 40% of the reported incidents--was crossing of the right edge-line before awaking, whereas crossing of the centreline was reported by 16%. Drivers' lack of awareness of important precursors of falling asleep--like highway hypnosis, driving without awareness, and similar phenomena--as well as a reluctance to discontinue driving despite feeling tired are pointed out as likely contributors to sleep-related accidents. More knowledge about the drivers' experiences immediately preceding such accidents may give a better background for implementing effective driver warning systems and other countermeasures.","authors":["Fridulv Sagberg"],"meta":["December 1999Accident; Analysis and Prevention 31(6):639-49","DOI:10.1016/S0001-4575(99)00023-8","SourcePubMed"],"references":["15310159_Sleep_related_vehicle_accidents","14453856_Characteristics_of_crashes_attributed_to_the_driver_having_fallen_asleep","13502989_Changes_in_Binge_Drinking_and_Related_Problems_Among_American_College_Students_Between_1993_and_1997_Results_of_the_Harvard_School_of_Public_Health_College_Alcohol_Study","296104588_Asleep_at_the_wheel_A_review_of_research_related_to_driver_fatigue","284652143_Driving_without_attention_mode_DWAM_A_formalisation_of_inattentive_states_in_driving","284035584_Calculating_relative_involvement_rates_in_accidents_without_determining_exposure","248346711_A_statistical_analysis_of_rural_Ontario_traffic_accidents_using_induced_exposure_data","248346501_An_historical_note_on_highway_hypnosis","236322334_Sleepiness_Driving_and_Motor_Vehicle_Crashes","232282755_Induced_Exposure","22369324_The_Hypnagogic_State_A_Critical_Review_of_the_Literature","15128043_Fatal_Accidents_among_Car_and_Truck_Drivers_Effects_of_Fatigue_Age_and_Alcohol_Consumption","15128042_Driver_Fatigue","14335579_The_scope_and_nature_of_the_drowsy_driving_problem_in_New_York_State","13970620_Sleepiness_and_driving_The_experience_of_UK_car_drivers","13780837_The_home_and_school_background_of_young_drivers_involved_in_traffic_accidents","13401261_Accidents_related_to_sleepiness_Review_of_medical_causes_and_prevention_with_special_reference_to_Switzerland","9517365_Highway_Hypnosis_An_Hypothesis"]}