{"id":"12885182_Automated_localization_of_the_optic_disc_fovea_and_retinal_blood_vessels_from_digital_color_fundus_images","abstract":"To recognise automatically the main components of the fundus on digital colour images.\nThe main features of a fundus retinal image were defined as the optic disc, fovea, and blood vessels. Methods are described for their automatic recognition and location. 112 retinal images were preprocessed via adaptive, local, contrast enhancement. The optic discs were located by identifying the area with the highest variation in intensity of adjacent pixels. Blood vessels were identified by means of a multilayer perceptron neural net, for which the inputs were derived from a principal component analysis (PCA) of the image and edge detection of the first component of PCA. The foveas were identified using matching correlation together with characteristics typical of a fovea-for example, darkest area in the neighbourhood of the optic disc. The main components of the image were identified by an experienced ophthalmologist for comparison with computerised methods.\nThe sensitivity and specificity of the recognition of each retinal main component was as follows: 99.1% and 99.1% for the optic disc; 83.3% and 91.0% for blood vessels; 80.4% and 99.1% for the fovea.\nIn this study the optic disc, blood vessels, and fovea were accurately detected. The identification of the normal components of the retinal image will aid the future detection of diseases in these regions. In diabetic retinopathy, for example, an image could be analysed for retinopathy with reference to sight threatening complications such as disc neovascularisation, vascular changes, or foveal exudation.","authors":["Chanjira Sinthanayothin","James F Boyce","Helen L Cook","Tom H Williamson"],"meta":["September 1999The British journal of ophthalmology 83(8):902-10","DOI:10.1136/bjo.83.8.902","SourcePubMed"],"references":["237381402_Edge-Region_Integration_for_Segmentation_of_MR_Images","224377985_A_Computational_Approach_To_Edge_Detection","284653608_Snakes_Active_Contour_Models","282111089_Cost-Effectiveness_of_Alternative_Methods_for_Diabetic_Retinopathy_Screening","245343083_An_Image_Processing_System_For_Automatic_Retina_Diagnosis","231155114_A_back_propagation_neural_network_for_the_classification_of_visual_field_data","222439471_A_computer_method_of_understanding_ocular_fundus_images","220690727_Image_Processing_Analysis_and_Machine_Vision","220659872_Active_contour_models_Int_J_Comput_Vis","220611553_Segmentation_of_MR_images_using_neural_nets"]}