{"id":"12940179_Ethnic_and_Gender_Differences_and_Similarities_in_Adolescent_Drug_Use_and_Refusals_of_Drug_Offers","abstract":"This paper examines the relationship among ethnicity, gender, drug use, and resistance to drug offers among a sample of 2,622 African American, Mexican American, and White American seventh graders. A number of similarities were noted. First, these adolescents did not seem to possess large or sophisticated repertoires of offer resistance strategies. Second, most offers came from acquaintances in contrast to more intimate offers among older youths. Ethnic and gender differences were also noted. Ethnicity had significant effects on use and the offer process. Mexican Americans received more offers, used more drugs, and were more likely to be offered drugs by peer family members and at parties. European Americans were more likely to receive drug offers from acquaintances and at friends' homes and on the street. African Americans were more likely to receive offers from dating partners and parents, and in the park, and were more likely to resist offers of drugs-using explanations. Gender significantly affected drug offers and types of offers. Males were more at risk for offers and use at a younger age. Offers of drugs to males were more likely to come from parents or other males, while offers to females were more likely to come from other females or dating partners. Males also were more likely to receive drug offers that appeal to their social standing or self-image while females received either simple offers or those that minimize effects. Finally, offers of drugs to males were more likely to be made in public, while those to females were more likely to occur in private. Cultural explanations are offered for these findings.","authors":["Dreama Gail Moon","Michael L Hecht","Kristina Jackson","Regina E. Spellers"],"meta":["July 1999Substance Use & Misuse 34(8):1059-83","DOI:10.3109/10826089909039397","SourcePubMed"],"references":["344037524_Birth_to_maturity_A_study_in_psychological_development","343502494_The_Reproduction_of_Mothering_Psychoanalysis_and_the_Sociology_of_Gender","330691643_Black_and_White_Styles_in_Conflict","324623238_Black_and_White_Styles_in_Conflict","287943003_Intracultural_communication_rules_and_outcomes_within_three_domestic_cultures","285899267_Substance_abuse_among_Latino_youth","285066504_Ethnicity_Communication_and_Drugs","281976681_Communication_Between_Cultures_9th_edition","275821236_Just_Friends_The_Role_of_Friendship_in_Our_Lives","274347213_In_a_Different_Voice_Psychological_Theory_and_Women's_Development"]}