{"id":"13485236_A_vision_of_the_pharmaceutical_industry","abstract":"As the financial resources available for looking after the health of an aging population are limited, generic drugs (drugs that are no longer covered by a patent and marketed at a lower price) have come to be used in western countries as a means for meeting growing demand while leaving resources in the health budget for new drugs. In Spain, a law on product patents was introduced in 1992, which is much later than in other countries, and created difficulties in the definition and procedure for gaining approval for generic drugs. Circular 3/97 from the Ministry of Health finally resolved these issues. In this circular, generic pharmaceutical products (GPPs) are clearly defined and identified with a positive commitment towards guaranteeing the ability to interchange original drugs for other cheaper generic products and towards clarifying the Spanish vade mecum. The position of the pharmaceutical industry on generic drugs varies widely and consequently, it is impossible to make a general statement on the view of the industry. However, the commitment of Novartis, given the issues described above and in line with the company's global strategy, is to offer innovation and services to society. This is perfectly compatible with offering health professionals both innovative drugs and generic drugs of a high quality at a lower price, given that registering genetics requires less investment in research and development. In any case, GPPs face an uncertain future in Spain and market forecasts also differ widely, ranging from 15 billion to 80 billion pesetas in the year 2000. It will be necessary to get doctors and pharmacists positively involved, to set up fast structural measures, and to avoid rejection by patients through successful information and marketing.","authors":["S Muñio"],"meta":["February 1998Methods and Findings in Experimental and Clinical Pharmacology 20 Suppl A:5-9","SourcePubMed"],"references":[]}