{"id":"13723308_A_Kalman_filter_approach_to_track_fast_impedance_changes_in_electrical_impedance_tomography","abstract":"In electrical impedance tomography (EIT), an estimate for the cross-sectional impedance distribution is obtained from the body by using current and voltage measurements made from the boundary. All well-known reconstruction algorithms use a full set of independent current patterns for each reconstruction. In some applications, the impedance changes may be so fast that information on the time evolution of the impedance distribution is either lost or severely blurred. In this paper, we propose an algorithm for EIT reconstruction that is able to track fast changes in the impedance distribution. The method is based on the formulation of EIT as a state-estimation problem and the recursive estimation of the state with the aid of the Kalman filter. The performance of the proposed method is evaluated with a simulation of human thorax in a situation in which the impedances of the ventricles change rapidly. We show that with optimal current patterns and proper parameterization, the proposed approach yields significant enhancement of the temporal resolution over the conventional reconstruction strategy.","authors":["Marko Vauhkonen","Pasi A. Karjalainen","Jari P Kaipio"],"meta":["May 1998IEEE transactions on bio-medical engineering 45(4):486-93","DOI:10.1109/10.664204","SourcePubMed"],"references":["316806505_Springer_Series_in_Statistics","284658363_On_an_inverse_boundary_value_problem_seminar_on_numerical_analysis_and_its_applications_to_continuum_physics","272281293_Physiology_of_the_Heart_and_Circulation","271828549_Time_Series_Theory_and_Methods","258261972_Applied_Potential_Tomography","256504555_Optimal_Filtering","246410886_Identification_and_Stochastic_Adaptive_Control","245322039_Square-root_RTS_smoothing_algorithms","239981253_Existence_and_Uniqueness_for_Electrode_Models_for_Electric_Current_Computed_Tomography","234807431_Adaptive_Algorithms_and_Stochastic_Approximation"]}