{"id":"13853244_Long_Short-term_Memory","abstract":"Learning to store information over extended time intervals by recurrent backpropagation takes a very long time, mostly because of insufficient, decaying error backflow. We briefly review Hochreiter's (1991) analysis of this problem, then address it by introducing a novel, efficient, gradient-based method called long short-term memory (LSTM). Truncating the gradient where this does not do harm, LSTM can learn to bridge minimal time lags in excess of 1000 discrete-time steps by enforcing constant error flow through constant error carousels within special units. Multiplicative gate units learn to open and close access to the constant error flow. LSTM is local in space and time; its computational complexity per time step and weight is O(1). Our experiments with artificial data involve local, distributed, real-valued, and noisy pattern representations. In comparisons with real-time recurrent learning, back propagation through time, recurrent cascade correlation, Elman nets, and neural sequence chunking, LSTM leads to many more successful runs, and learns much faster. LSTM also solves complex, artificial long-time-lag tasks that have never been solved by previous recurrent network algorithms.","authors":["Sepp Hochreiter","Jürgen Schmidhuber"],"meta":["December 1997Neural Computation 9(8):1735-80","DOI:10.1162/neco.1997.9.8.1735","SourcePubMed"],"references":["277298117_Bridging_Long_Time_Lags_by_Weight_Guessing_and_Long_Short_Term_Memory","277295865_Guessing_Can_Outperform_Many_Long_Time_Lag_Algorithms","243781690_Untersuchungen_zu_dynamischen_neuronalen_Netzen","243698906_Finite_State_Automata_and_Simple_Recurrent_Networks","243683010_The_utility_driven_dynamic_error_propagation_network","313702304_Learning_sequential_structures_with_the_real-time_recurrent_learning_algorithm","263902178_LEARNING_SEQUENTIAL_STRUCTURE_WITH_THE_REAL-TIME_RECURRENT_LEARNING_ALGORITHM","243763246_A_recurrent_cascade-correlation_learning_architecture","243732587_Generalization_of_Back-Propagation_to_Recurrent_Neural_Networks","243683189_Complexity_of_exact_gradient_computation_algorithms_for_recurrent_neural_networks"]}