{"id":"14228366_Medical_Informatics_Training_in_Pathology_Residency_Programs","abstract":"Computers and information technology are increasingly used by pathologists, necessitating training in such technology in pathology residency programs. We surveyed 176 programs in the United States and Canada to assess informatics training in terms of instructional methods used, computer availability, and type of training offered. Eighty-four programs replied, for a response rate of 48%.\nNinety percent of programs reported offering formal informatics training, but only 68% of programs required it. A rotation dedicated to teaching informatics was provided in 24% of the programs; in 44% of programs, informatics was integrated with other rotations. The most common instructional methods used were hands-on experience with microcomputers and the use of tutors. In 94% of programs, computers were available for resident use; in 60%, residents had individual computers assigned to them. Five programs offered a dedicated informatics rotation but did not provide residents with individual computers, and 22 programs required informatics training but did not provide residents with individual computers. Comparison of these data with data from 1993 shows an increase in programs offering (90% vs 84%) or requiring (68% vs 59%) informatics. Fewer programs offer a dedicated rotation (24% vs 31%) or integrate informatics training with other rotations (44% vs 69%).\nThese data suggest that although informatics training is considered important by most training programs, inadequate resources and lack of formal, structured programs may limit training.","authors":["Becki Goldberg-Kahn","Jeremiah C Healy"],"meta":["February 1997American Journal of Clinical Pathology 107(1):122-7","DOI:10.1093/ajcp/107.1.122","SourcePubMed"],"references":["293576230_Informatics_in_pathology_Introduction","21599952_Pathologists_and_training_in_information_technology","21395788_A_management_informatics_rotation_for_pathology_residents","20934743_Informatics_as_a_Separate_Section_within_a_Department_of_Pathology","20751313_Medical_informatics_An_emerging_academic_discipline_and_institutional_priority","19556271_Using_the_computer_to_optimize_human_performance_in_health_care_delivery_The_pathologist_as_medical_information_specialist","15321526_Building_an_informatics_training_program_for_pathology","15293325_ASCP_Colorado_Springs_Conference_IV_Clinical_pathology_residency_Curriculum_reform","14888328_Informatics_training_in_US_pathology_residency_programs_Results_of_a_survey","14852041_Informatics_A_Subspecialty_in_Pathology","14421045_The_role_of_clinical_pathology_in_academic_pathology_departments"]}