{"id":"14491935_Alcoholic_beverage_consumption_and_associated_factors_in_Porto_Alegre_a_southern_Brazilian_city_A_population-based_survey","abstract":"To describe the pattern of alcoholic beverage consumption and the prevalence of at risk drinking behaviors, as well as their association with demographic and socioeconomic factors in the adult population of Porto Alegre, a southern Brazilian city.\nIn a cross-sectional, population-based, multistage random sampling study, 1,091 (600 female) individuals (92% of those eligible) were selected and interviewed at home. Exposure to alcohol was measured by the CAGE questionnaire and by inquiring about the type, quantity and frequency of alcoholic beverage consumption. An average consumption of 30 g per day or more, a level of exposure associated with health risks, was considered as heavy drinking. Two positive answers to the GAGE questionnaire represented the cutoff for indicating dependence.\nThe prevalences were: 9.3% (95% CI: 7.6 to 11.0) for dependence, 15.5% (13.4 to 17.7) for heavy drinking and 12.3% (10.4 to 14.2) for daily drinking; 24.1% (21.7 to 26.6) were abstinent. Women consumed alcoholic beverages in lower frequency and amounts than men. The most widely consumed beverages were beer, wine and \"cachaça,\" a Brazilian sugarcane spirit. In a logistic regression model, increasing age, lower education and income, and nonwhite race were associated with heavy drinking and dependence. Households with 3-4 persons were associated with the lowest risk of heavy drinking, but the prevalence of dependence was higher in crowded households. The presence of another heavy drinker or dependent in the household was associated with heavy drinking but not with dependence.\nThe study characterized a detailed pattern of alcoholic beverage use and indicated that at risk drinking is an important public health problem in a developing country. The risk factors for heavy drinking and dependence were the same, with the exception of age at starting to drink, heavy drinking or dependence-positive household members.","authors":["Benjamim Moreira","Flavio Fuchs","Ruy Silveira Moraes","Markus Bredemeier"],"meta":["June 1996Journal of Studies on Alcohol 57(3):253-9","DOI:10.15288/jsa.1996.57.253","SourcePubMed"],"references":["19669180_Alcohol_Use_and_Alcoholism_in_Latin_America_Changing_Patterns_and_Sociocultural_Explanations","288267163_Epidemiologia_do_alcoolismo_Prevalencia_de_positividade_do_teste_CAGE_em_inquerito_domiciliar_no_municipio_de_Sao_Paulo","20777797_Effects_of_Sex_Race_and_Year_in_College_on_Self-Reported_Drinking-Related_Problem_Behaviors","20535236_The_Relationship_between_Alcohol_Consumption_and_Social_Status_in_Stockholm_Has_the_Social_Pattern_of_Alcohol_Consumption_Changed","20367931_At_Risk_Drinking_in_Primary_Care_report_from_a_survey_in_Sao_Paulo_Brazil","20014242_Trends_in_alcohol-related_morbidity_and_mortality","19932491_Are_The_Cage_Question_Outdated","19734820_Determinants_and_consequences_of_alcohol_abuse_and_cigarette_consumption_in_Mamre","19711524_Medical_and_social_variables_related_to_alcohol_consumption_in_Mexico","19456516_Social_Class_and_Changes_in_Health-Related_Habits_in_Finland_in_1973-1983"]}