{"id":"14562484_Synaesthesia_in_Phantom_Limbs_Induced_with_Mirrors","abstract":"Although there is a vast clinical literature on phantom limbs, there have been no experimental studies on the effects of visual input on phantom sensations. We introduce an inexpensive new device--a 'virtual reality box'--to resurrect the phantom visually to study inter-sensory effects. A mirror is placed vertically on the table so that the mirror reflection of the patient's intact had is 'superimposed' on the felt position of the phantom. We used this procedure on ten patients and found the following results. 1. In six patients, when the normal hand was moved, so that the phantom was perceived to move in the mirror, it was also felt to move; i.e. kinesthetic sensations emerged in the phantom. In D.S. this effect occurred even though he had never experienced any movements in the phantom for ten years before we tested him. He found the return of sensations very enjoyable. 2. Repeated practice led to a permanent 'disappearance' of the phantom arm in patient D.S. and the hand became telescoped into the stump near the shoulder. 3. Using an optical trick, impossible postures--e.g. extreme hyperextension of the fingers--could be induced visually in the phantom. In one case this was felt as a transient 'painful tug' in the phantom. 4. Five patients experienced involuntary painful 'clenching spasms' in the phantom hand and in four of them the spasms were relieved when the mirror was used to facilitate 'opening' of the phantom hand; opening was not possible without the mirror. 5. In three patients, touching the normal hand evoked precisely localized touch sensations in the phantom. Interestingly, the referral was especially pronounced when the patients actually 'saw' their phantom being touched in the mirror. Indeed, in a fourth patient (R.L.) the referral occurred only if he saw his phantom being touched: a curious form of synaesthesia. These experiments lend themselves readily to imaging studies using PET and fMRI. Taken collectively, they suggest that there is a considerable amount of latent plasticity even in the adult human brain. For example, precisely organized new pathways, bridging the two cerebral hemispheres, can emerge in less than three weeks. Furthermore, there must be a great deal of back and forth interaction between vision and touch, so that the strictly modular, hierarchical model of the brain that is currently in vogue needs to be replaced with a more dynamic, interactive model, in which 're-entrant' signalling plays the main role.","authors":["Vilayanur S Ramachandran","D.C. Rogers-Ramachandran"],"meta":["May 1996Proceedings of the Royal Society B: Biological Sciences 263(1369):377-86","DOI:10.1098/rspb.1996.0058","SourcePubMed"],"references":["21311827_Massive_Cortical_Reorganization_After_Sensory_Deafferentation_in_Adult_Macaques","15224901_Coding_of_Visual_Space_by_Premotor_Neurons","313086299_Reorganization_of_sensory_function_in_amputation_stumps_Two-point_discrimination","246308385_Lesions_of_Nerves_and_Their_Consequences","232119988_Brain's_Diseases_of_the_Nervous_System","227870841_Volition_A_New_Experimental_Approach","23324901_Phantom_limbs","21715544_Perceptual_Correlates_of_Massive_Cortical_Reorganization","21246939_Neurobiology_Curious_cortical_change","20863226_Pain_'memories'_in_phantom_limbs_Review_and_clinical_observations","16362542_Topographic_Reorganization_of_Somatosensory_Cortical_Areas_3B_and_1_in_Adult_Monkeys_following_Restricted_Deafferentiation","15314712_Phantom_Limbs_Neglect_Syndromes_Repressed_Memories_And_Freudian_Psychology","15053098_Sensory_maps_in_the_human_brain_13","14951414_Ramachandran_V_S_Behavioral_and_magnetoencephalographic_correlates_of_plasticity_in_the_adult_human_brain_Proc_Natl_Acad_Sci_USA_90_10413-10420","8812092_Phantom_Limbs_in_Amputees_A_Study_of_Changes_in_the_Integration_of_Centripetal_Impulses_with_Special_Reference_to_Referred_Sensations"]}