{"id":"15008220_Magnetization_transfer_theory_and_clinical_applications_in_neuroradiology","abstract":"Magnetization transfer, a new technique for improving image contrast in magnetic resonance (MR) imaging, is based on application of off-resonance radio-frequency pulses and observing their effects on MR images, as well as measuring the signal intensity with and without application of the pulses (ie, magnetization transfer ratio [MTR]). MTRs can be used to detect changes in the structural status of brain parenchyma that may or may not be visible with standard MR techniques. Use of MTRs may allow subcategorization of multiple sclerosis lesions into those with very low MTR (demyelinated lesions) and slightly decreased MTR (edematous lesions). In cases of wallerian degeneration, use of MTRs appears to allow reliable detection of changes undetectable with MR imaging or even light microscopy. In cases of infection with human immunodeficiency virus, MTRs seem to indicate that the macromolecular structure of white matter remains intact until relatively late in the course of disease. In cases of metastatic disease, MTRs of brain lesions indicate structural changes beyond the extent of the lesions seen on standard MR images. These findings may be due to chronic edema, myelin loss, and perhaps previous undetected tumor. In addition to being a new method of providing contrast, the magnetization transfer technique enables semi-quantitative, reproducible characterization of tissue and pathologic entities, which could substantially improve the specificity of MR imaging.","authors":["R I Grossman","J M Gomori","K N Ramer","F J Lexa"],"meta":["April 1994Radiographics 14(2):279-90","DOI:10.1148/radiographics.14.2.8190954","SourcePubMed"],"references":["22321243_Cross_relaxation_and_spin_diffusion_in_the_proton_NMR_of_hydrated_collagen","21542055_Magnetization_time-of-flight_magnetic_resonance_angiography","21534568_Improved_time-of-flight_MR_angiography_of_the_brain_with_magnetization_transfer_contrast","21204914_Mechanisms_of_MR_signal_alteration_by_acute_intracerebral_blood_Old_concepts_and_new_theories","21150274_Magnetization_transfer_contrast_method_for_improving_contrast_In_gradient-recalled-echo_Images","20609288_Magnetization_Transfer_Contrast_MTC_and_Tissue_Water_Proton_Relaxation_in_Vivo","15007328_MR_of_wallerian_degeneration_in_the_feline_visual_system_Characterization_by_magnetization_transfer_rate_with_histopathologic_correlation","14847461_An_in_vitro_study_of_magnetization_transfer_and_relaxation_rates_of_hematoma"]}