{"id":"15829465_Neocognitron_A_self-organizing_neural_network_model_for_a_mechanism_of_pattern_recognition_unaffected_by_shift_in_position","abstract":"A neural network model for a mechanism of visual pattern recognition is proposed in this paper. The network is self-organized by \"learning without a teacher\", and acquires an ability to recognize stimulus patterns based on the geometrical similarity (Gestalt) of their shapes without affected by their positions. This network is given a nickname \"neocognitron\". After completion of self-organization, the network has a structure similar to the hierarchy model of the visual nervous system proposed by Hubel and Wiesel. The network consists of an input layer (photoreceptor array) followed by a cascade connection of a number of modular structures, each of which is composed of two layers of cells connected in a cascade. The first layer of each module consists of \"S-cells\", which show characteristics similar to simple cells or lower order hypercomplex cells, and the second layer consists of \"C-cells\" similar to complex cells or higher order hypercomplex cells. The afferent synapses to each S-cell have plasticity and are modifiable. The network has an ability of unsupervised learning: We do not need any \"teacher\" during the process of self-organization, and it is only needed to present a set of stimulus patterns repeatedly to the input layer of the network. The network has been simulated on a digital computer. After repetitive presentation of a set of stimulus patterns, each stimulus pattern has become to elicit an output only from one of the C-cells of the last layer, and conversely, this C-cell has become selectively responsive only to that stimulus pattern. That is, none of the C-cells of the last layer responds to more than one stimulus pattern. The response of the C-cells of the last layer is not affected by the pattern's position at all. Neither is it affected by a small change in shape nor in size of the stimulus pattern.","authors":["Kunihiko Fukushima"],"meta":["February 1980Biological Cybernetics 36(4):193-202","DOI:10.1007/BF00344251","SourcePubMed"],"references":["18543778_Visual_properties_of_neurons_in_inferotemporal_cortex_of_the_Macaque","301099799_Feature_Extraction_and_Recognition_of_Handwritten_Characters_by_Homogeneous_Layers","285058764_Receptive_fields_binocular_interaction_and_functional_architecture_in_the_cat's_visual_cortex","284745381_Explanatory_models_for_neuroplasticity_in_retinotectal_connections","275807826_Principles_of_Neurodynamics","272159781_Wiesel_TN_Receptive_fields_binocular_interaction_and_functional_architecture_in_cat's_visual_cortex_J_Physiol_London_160_106-154","262214449_Self-organization_of_a_neural_network_which_gives_position-invariant_response","234461398_A_Proposed_Model_for_Visual_Information_Processing_in_the_Human_Brain","23112221_Ferrier_Lecture_Functional_Architecture_of_Macaque_Monkey_Visual_Cortex","21952992_Cognitron_A_self-organizing_multilayered_neural_network","9301289_Receptive_Fields_and_Functional_Architecture_in_Two_Nonstriate_Visual_Areas_18_and_19_of_the_Cat","9137961_Receptive_fields_binocular_interaction_and_functional_architectures_in_cats_visual_cortex"]}