{"id":"16718285_The_Structure_of_Images","abstract":"In practice the relevant details of images exist only over a restricted range of scale. Hence it is important to study the dependence of image structure on the level of resolution. It seems clear enough that visual perception treats images on several levels of resolution simultaneously and that this fact must be important for the study of perception. However, no applicable mathematically formulated theory to deal with such problems appears to exist. In this paper it is shown that any image can be embedded in a one-parameter family of derived images (with resolution as the parameter) in essentially only one unique way if the constraint that no spurious detail should be generated when the resolution is diminished, is applied. The structure of this family is governed by the well known diffusion equation (a parabolic, linear, partial differential equation of the second order). As such the structure fits into existing theories that treat the front end of the visual system as a continuous stack of homogeneous layers, characterized by iterated local processing schemes. When resolution is decreased the images becomes less articulated because the extrem (\"light and dark blobs\") disappear one after the other. This erosion of structure is a simple process that is similar in every case. As a result any image can be described as a juxtaposed and nested set of light and dark blobs, wherein each blob has a limited range of resolution in which it manifests itself. The structure of the family of derived images permits a derivation of the sampling density required to sample the image at multiple scales of resolution.(ABSTRACT TRUNCATED AT 250 WORDS)","authors":["Jan Koenderink"],"meta":["February 1984Biological Cybernetics 50(5):363-70","DOI:10.1007/BF00336961","SourcePubMed"],"references":["37597147_Bandpass_Channels_Zero-Crossings_and_Early_Visual_Information_Processing","17083076_Theory_of_Edge_Detection","286632024_Scale_space_filtering","285022108_Stabilite_Structurelle_et_Morphogenese","284392255_On_hills_and_dales_London_Edinburgh_Dublin_Philos","244954097_A_comprehensive_introduction_to_differential_geometry_Vol_V_2nd_ed","233835811_On_Hills_and_Dales","233194629_XL_On_contour_and_slope_lines","226407961_Ein_Modell_zur_rtlich-zeitlichen_Signalbertragung_im_visuellen_System_des_Menschen_auf_der_Basis_der_linearen_Systemtheorie_kontinuierlicher_Medien","225648571_Die_Systemtheorie_der_homogenen_Schichten","50334338_Differential_topology","22645541_The_structure_of_two-dimensional_scalar_fields_with_applications_to_vision","22433107_Visual_detection_of_spatial_contrast_Influence_of_location_in_the_visual_field_target_extent_and_illuminance_level","22260104_A_model_of_visual_threshold_detection","16142335_Invariant_features_of_contrast_detection_an_explanation_in_terms_of_self-similar_detector_arrays","3115106_Segmentation_and_Estimation_of_Image_Region_Properties_through_Cooperative_Hierarchial_Computation","3046677_Representation_of_Random_Waveforms_by_Relational_Trees"]}