{"id":"19257755_An_Attributional_Theory_of_Achievement_Motivation_and_Emotion","abstract":"Proposes a theory of motivation and emotion in which causal ascriptions play a key role. Evidence is presented indicating that in achievement-related contexts there are a few dominant causal perceptions, and it is suggested that the perceived causes of success and failure share the 3 common properties of locus, stability, and controllability, with intentionality and globality as other possible causal structures. The perceived stability of causes influences changes in expectancy of success; all 3 dimensions of causality affect a variety of common emotional experiences, including anger, gratitude, guilt, hopelessness, pity, pride, and shame. Expectancy and affect, in turn, are presumed to guide motivated behavior. The theory therefore relates the structure of thinking to the dynamics of feeling and action. Analysis of a created motivational episode involving achievement strivings is offered, and numerous empirical observations are examined from this theoretical position. The strength of the empirical evidence and the capability of this theory to address prevalent human emotions are stressed, and examples of research on parole decisions, smoking cessation, and helping behavior are presented to illustrate the generalizability of the theory beyond the achievement-related theoretical focus. (3½ p ref) (PsycINFO Database Record (c) 2012 APA, all rights reserved)","authors":["Bernard Weiner"],"meta":["November 1985Psychological Review 92(4):548-73","DOI:10.1037/0033-295X.92.4.548","SourcePubMed"],"references":["325677752_Impact_of_causal_attributions_on_affective_reactions_to_success_and_failure","325676796_Characterological_versus_behavioral_self-blame_Inquiries_into_depression_and_rape","323385197_Analyzing_Alcoholism","313515827_The_emotional_consequences_of_causal_ascriptions","313008005_An_attributional_approach_to_emotional_development","306152401_The_evolution_of_reciprocal_altruism","316793552_Anger_and_Aggression","313658140_Generalized_Expectancies_for_Internal_versus_External_Control_of_Reinforcement","313515458_Causal_ascription_and_expectancy_of_success","313189014_Empathy_role-taking_guilt_and_development_of_altruistic_motives"]}