{"id":"1955771_Truth_Revelation_in_Approximately_Efficient_Combinatorial_Auctions","abstract":"Some important classical mechanisms considered in Microeconomics and Game Theory require the solution of a difficult optimization problem. This is true of mechanisms for combinatorial auctions, which have in recent years assumed practical importance, and in particular of the gold standard for combinatorial auctions, the Generalized Vickrey Auction (GVA). Traditional analysis of these mechanisms - in particular, their truth revelation properties - assumes that the optimization problems are solved precisely. In reality, these optimization problems can usually be solved only in an approximate fashion. We investigate the impact on such mechanisms of replacing exact solutions by approximate ones. Specifically, we look at a particular greedy optimization method. We show that the GVA payment scheme does not provide for a truth revealing mechanism. We introduce another scheme that does guarantee truthfulness for a restricted class of players. We demonstrate the latter property by identifying natural properties for combinatorial auctions and showing that, for our restricted class of players, they imply that truthful strategies are dominant. Those properties have applicability beyond the specific auction studied.","authors":["Daniel Lehmann","Liadan O'Callaghan","Yoav Shoham"],"meta":["March 2002Journal of the ACM 49(5)","DOI:10.1145/336992.337016","SourcearXiv"],"references":["227447149_Computationally_Manageable_Combinational_Auctions","284039089_Reducibility_among_combinatorial_problems","273698329_Counter_Speculation_Auctions_and_Competitive_Sealed_Tenders","269157523_Optimal_solutions_for_multi-unit_combinatorial_auctions","251351298_Clique_is_hard_to_approximate_within","245586646_Bidding_theory_the_phenomena_to_be_modeled","239294948_Asymptotically_optimal_multi-object_auctions_for_risk-averse_agents","236221580_Multipart_Pricing_of_Public_Goods","227466749_Microeconomic_Theory","222576950_Algorithm_for_Optimal_Winner_Determination_in_Combinatorial_Auctions"]}