{"id":"1960092_Migrating_Multi-page_Web_Applications_to_Single-page_AJAX_Interfaces","abstract":"Recently, a new web development technique for creating interactive web applications, dubbed AJAX, has emerged. In this new model, the single-page web interface is composed of individual components which can be updated/replaced independently. With the rise of AJAX web applications classical multi-page web applications are becoming legacy systems. If until a year ago, the concern revolved around migrating legacy systems to web-based settings, today we have a new challenge of migrating web applications to single-page AJAX applications. Gaining an understanding of the navigational model and user interface structure of the source application is the first step in the migration process. In this paper, we explore how reverse engineering techniques can help analyze classic web applications for this purpose. Our approach, using a schema-based clustering technique, extracts a navigational model of web applications, and identifies candidate user interface components to be migrated to a single-page AJAX interface. Additionally, results of a case study, conducted to evaluate our tool, are presented.","authors":["Ali Mesbah","Arie van Deursen"],"meta":["November 2006Proceedings of the Euromicro Conference on Software Maintenance and Reengineering, CSMR","DOI:10.1109/CSMR.2007.33","SourcearXiv"],"references":["242595509_Building_Web_Applications_with_UML","313595660_Practical_language-independent_detection_of_near-miss_clones","259671324_An_Architectural_Style_for_Ajax","244417314_Ajax_A_New_Approach_to_Web_Applications","239567615_Binary_Codes_Capable_of_Correcting_Deletions","232625535_Comprehending_Web_Applications_by_a_Clustering_Based_Approach","222521345_A_component_and_push_based_architectural_style_for_AJAX_applications","222490617_UIML_An_appliance-independent_XML_user_interface_language","221569951_WARE_A_Tool_for_the_Reverse_Engineering_of_Web_Applications","221501284_Practical_language-independent_detection_of_near-miss_clones"]}