{"id":"19872756_The_Control_of_Neuron_Number","abstract":"In comparing strategies used to control neuron number, we find it useful to view nervous system development as occurring in three phases. The phases overlap--each is a process, not an event. The first phase is the development of a genetic nervous system. This is a nervous system of simple genetic intention, not a blueprint or pile of bricks. Its characteristics are abstract: How many neurons in this stem cell destined to produce, which cells are programmed to die, how much target does this cell need to survive. At the level of the individual, the genetic nervous system is essentially fixed, but over generations it is fluid. As this genetic intent interacts within a world of cells, a real brain appears. A new set of rules only tacitly present in the genome is expressed--the embryonic nervous system emerges. The interaction of its parts defines the shape and size of the nervous system. Neuron numbers are adjusted interactively by changes in proliferative potential and the severity of cell death. Cell fates are established in part through interactions with other cells and with hormones. Glial cell numbers are adjusted to match the neuron populations. This phase of brain development is what the embryologist sees under the microscope. The third and final phase of development begins when the brain starts to function and the animal starts to deal with its world. Small changes in neuron number may occur during this period, but these changes are generally of minor functional importance. At this point, the smaller elements of neuronal organization are refined in shape, number, and distribution. Axons are lost or rearranged; dendrites grow, branch, and retract; synapses are fine-tuned; and finally, receptor densities and transmitter titres are adjusted. Some of these interactions and numerical adjustments continue until the animal dies.","authors":["R W Williams","Karl Herrup"],"meta":["February 1988Annual Review of Neuroscience 11(1):423-53","DOI:10.1146/annurev.ne.11.030188.002231","SourcePubMed"],"references":[]}