{"id":"200085965_Perceived_Usefulness_Perceived_Ease_of_Use_and_User_Acceptance_of_Information_Technology","abstract":"Valid measurement scales for predicting user acceptance of computers are in short supply. Most subjective measures used in practice are unvalidated, and their relationship to system usage is unknown. The present research develops and validates new scales for two specific variables, perceived usefulness and perceived ease of use, which are hypothesized to be fundamental determinants of user acceptance. Definitions for these two variables were used to develop scale items that were pretested for content validity and then tested for reliability and construct validity in two studies involving a total of 152 users and four application programs. The measures were refined and streamlined, resulting in two six-item scales with reliabilities of .98 for usefulness and .94 for ease of use. The scales exhibited high convergent, discriminant, and factorial validity. Perceived usefulness was significantly correlated with both self-reported current usage (r=.63, Study 1) and self-predicted future usage (r =.85, Study 2). Perceived ease of use was also significantly correlated with current usage (r=.45, Study 1) and future usage (r=.59, Study 2). In both studies, usefulness had a significantly greater correlation with usage behavior than did ease of use. Regression analyses suggest that perceived ease of use may actually be a causal antecedent to perceived usefulness, as opposed to a parallel, direct determinant of system usage. Implications are drawn for future research on user acceptance.","authors":["Fred D. Davis","Fred Davis"],"meta":["September 1989MIS Quarterly 13(3):319--339","DOI:10.2307/249008"],"references":["306202582_Attribution_emotion_and_action_Handbook_of_motivation_and_cognition","313069741_Organizational_context_user_involvement_and_the_usefulness_of_information_systems","312888459_A_contingency_model_for_the_selection_of_decision_strategies","302244591_Intrinsic_Motivation_and_Development","298348474_The_theory_of_reasoned_action_A_meta-analysis_of_past_research_with_recommendations_for_modifications_and_future_research","284619484_User_needs_workshops_A_new_approach_to_anticipating_user_needs_for_advanced_office_systems","280797526_Why_interactive_computer_systems_are_sometimes_not_used_by_people_who_might_benefit_from_them","277542896_Consumer_Choice_Strategies_Simplifying_Vs_Optimizing","274185031_Organizations_and_Organization_Theory","272159726_Belief_Attitude_Intention_and_Behaviour_An_Introduction_to_Theory_and_Research_Addison-Wesley_Reading_MA"]}