{"id":"200130187_Learning_through_Teaching","abstract":"This work is the result of a study undertaken aimed at providing an insight into the way individuals learn through their work in an organization. Twenty interviews were held with 20 managers, each lasting between 8 and 10 hours, in which a total of 282 learning stories were acquired. All those interviewed gave accounts of the learning potential that was acquired when they took on the role of teachers within their organization. Observation, listening and experimentation were the most common processes in facilitating learning during the course of teaching. The great learning potential inherent in teaching would appear to be generated as the result of a particular aspect of the teaching process itself: the encounter with diversity, which on the one hand tends to increase reflexivity while on the other hand tends to break down resistance to change. In this sense, the learning process that emerges during the course of teaching is of an intrinsically social nature, made possible by the investigation of an authentically symmetrical relationship between teacher and pupils in which all the interlocutors are able to contribute to a common goal. Teaching also proved to be an important opportunity for recognizing one's own ignorance and thereby rendering oneself open to the possibility of learning. The results of this study confirm certain evolutionary trends which are to be found in the current method of planning managerial training: the utilization of internal resources, the use of a dialogic style, the search for a link between work and training, and the use of small groups. The actual narration and exchange of learning stories also provided an opportunity for promoting the learning process in those interviewed.","authors":["C.G. Cortese"],"meta":["March 2005Management Learning 36(1):87--115","DOI:10.1177/1350507605049905"],"references":["353261382_Is_the_Critical_Pedagogy_of_management_possible","344877695_Education_as_a_Practice_of_Freedom","344560805_Storytelling_in_Organizations","344045644_Innovative_learning_in_work_teams_Analyzing_cycles_of_knowledge_creation_in_practice","325001362_The_Textual_Approach_Risk_and_Blame_in_Disaster_Sensemaking","317433838_Handbook_of_Qualitative_Research","313162481_Metacognitive_Development","313085751_The_narrative_construction_of_reality","312987869_Active_interviewing","303137874_Innovative_learning_in_work_teams_analyzing_cycles_of_knowledge_creation_in_practice","285756797_Nike_Greek_goddess_of_victory_or_cruelty_Women's_stories_of_Asian_factory_life","288008139_Emerging_issues_and_new_directions_for_training_research","286075286_Encyclopedia_of_Educational_Research","285887690_To_avoid_organizational_crises-unlearn","275840445_Tacit_Knowledge_in_Professional_Practice_Researcher_and_Practitioner_Perspectives"]}