{"id":"200552889_a_A_Little_Silly_and_Empty-Headeda_a_Older_Adults'_Understandings_of_Social_Networking_Sites","abstract":"This study suggests reasons for the absence of a growing proportion of the population, the so-called baby boomers, from the otherwise highly popular social networking sites. We explore how people of this age group understand social networking sites and how these understandings fit certain aspects of their life. Designing social networking sites that match older adults' life would increase their possibilities of coping with the changes related to their age and of contributing to the information society. In a qualitative study involving use of an existing social networking site, and group and personal interviews, we found that understanding the internet as a dangerous place, and social networking sites as places of socially unacceptable behavior, hinders the use of these technologies. To include older adults, we propose arrangement of social events for getting familiarized with these services and offering of clear and simple privacy management on the sites. These actions have implications for users of all ages.","authors":["Vilma Lehtinen","Vilma","Jaana Näsänen","Jaana"],"meta":["January 2009","DOI:10.1145/1671011.1671017","Sourcedoi.acm.org","Conference: Proceedings of the 2009 British Computer Society Conference on Human-Computer Interaction, BCS-HCI 2009, Cambridge, United Kingdom, 1-5 September 2009"],"references":["265074677_The_Digital_Divide_in_Europe","259823204_Social_Network_Sites_Definition_History_and_Scholarship","259482101_Age_Differences_in_Online_Social_Networking","247605091_Spatially_Bounded_Online_Social_Networks_and_Social_Capital_The_Role_of_Facebook","237420378_The_family_and_community_life_of_older_people_social_networks_and_social_support_in_three_urban_communities","336571342_Designing_for_Elders_Exploring_the_Complexity_of_Relationships_in_Later_Life","269522307_An_Introduction_to_Social_Constructionism","242633267_Older_Americans_and_the_Internet","242482640_Ageing_Characterizes_the_Demographic_Perspectives_of_the_European_Societies","239479126_Continuity_and_Change_in_the_Family_and_Community_Life_of_Older_People"]}