{"id":"200772850_Always_On_Language_in_an_Online_and_Mobile_World","abstract":"This book shows how Internet and mobile technologies - including instant messaging (IM), cell phones, multitasking, social networking Web sites, blogs, and wikis - are profoundly influencing the way we read and write, speak and listen, but not in the ways we might suppose. The book looks at language in an online and mobile world. It reveals for instance that email, IM, and text messaging have had surprisingly little impact on student writing. Electronic media has magnified the laid-back \"whatever\" attitude toward formal writing that young people everywhere have embraced, but it is not a cause of it. A more troubling trend, according to the book, is the myriad ways in which we block incoming IMs, camouflage ourselves on Facebook, and use ring tones or caller ID to screen incoming calls on our mobile phones. The book argues that our ability to decide who to talk to is likely to be among the most lasting influences that information and communication technology has upon the ways we communicate with one another. Moreover, as more and more people are \"always on\" one technology or another - whether communicating, working, or just surfing the web or playing games - we have to ask what kind of people do we become, as individuals and as family members or friends, if the relationships we form must increasingly compete for our attention with digital media?","authors":["Naomi Baron"],"meta":["April 2008","DOI:10.1093/acprof:oso/9780195313055.001.0001","Publisher: Oxford University PressISBN: 9780195313055"],"references":["291154179_Learning_to_write_in_the_information_age_A_case_study_of_schoolchildren's_writing_in_Sweden","296877721_Cheating-or_postmodern_learning","295596638_Polluting_the_blogosphere","294346324_Whatever_happened_to_encyclopedic_style","291881685_Web_of_risks","288042578_The_trout_and_the_milk_An_ethnobibliographical_talk","288042283_Narrow_Ruled","269884366_The_Originality_of_Texts_in_a_Manuscript_Culture","265819376_The_Sign_Language_of_the_Women_of_Yuendumu_A_Preliminary_Report_on_the_Structure_of_Warlpiri_Sign_Language","259257186_Txtng_The_gr8_db8"]}