{"id":"201168946_Design_Science_in_Information_Systems_Research","abstract":"Two paradigms characterize much of the research in the Information\nSystems discipline: behavioral science and design science. The behavioral-science\nparadigm seeks to develop and verify theories that explain or predict\nhuman or organizational behavior. The design-science paradigm seeks\nto extend the boundaries of human and organizational capabilities\nby creating new and innovative artifacts. Both paradigms are foundational\nto the IS discipline, positioned as it is at the confluence of people,\norganizations, and technology. Our objective is to describe the performance\nof design-science research in Information Systems via a concise conceptual\nframework and clear guidelines for understanding, executing, and\nevaluating the research. In the design-science paradigm, knowledge\nand understanding of a problem domain and its solution are achieved\nin the building and application of the designed artifact. Three recent\nexemplars in the research literature are used to demonstrate the\napplication of these guidelines. We conclude with an analysis of\nthe challenges of performing high-quality design-science research\nin the context of the broader IS community.","authors":["Alan Hevner","Alan R","Salvatore T. March","Salvatore T"],"meta":["March 2004"],"references":["308767258_JPO_Editor's_Comments","290989872_Information_technology_to_support_electronic_meetings","313084820_Improving_Reuse-based_Design_Augmenting_Analysis_Patterns_Reuse_with_Learning","303286114_The_Coming_of_the_New_Organization","294688218_Emperical_research_in_information_systems_The_practice_of_relevance","288947775_Research_commentry_Desperately_seeking_the_IT_in_IT_research_-_A_call_to_theorizing_the_IT_artifact","285098030_A_comparison_of_user_performance_between_the_relational_and_the_extended_entity_relationship_models_in_the_discovery_phase_of_database_design","284879956_The_dynamics_of_innovation_in_beyond_calculation_The_next_fifty_years_of_computing","275704956_Rigor_and_Relevance_in_MIS_Research-Introduction","274369891_Philosophy_Social_Theory_and_the_Thought_of_George_Herbert_Mead"]}