{"id":"201169029_A_Design_Science_Research_Methodology_for_Information_Systems_Research","abstract":"The paper motivates, presents, demonstrates in use, and evaluates\na methodology for conducting design science (DS) research in information\nsystems (IS). DS is of importance in a discipline oriented to the\ncreation of successful artifacts. Several researchers have pioneered\nDS research in IS, yet over the past 15 years, little DS research\nhas been done within the discipline. The lack of a methodology to\nserve as a commonly accepted framework for DS research and of a template\nfor its presentation may have contributed to its slow adoption. The\ndesign science research methodology (DSRM) presented here incorporates\nprinciples, practices, and procedures required to carry out such\nresearch and meets three objectives: it is consistent with prior\nliterature, it provides a nominal process model for doing DS research,\nand it provides a mental model for presenting and evaluating DS research\nin IS. The DS process includes six steps: problem identification\nand motivation, definition of the objectives for a solution, design\nand development, demonstration, evaluation, and communication. We\ndemonstrate and evaluate the methodology by presenting four case\nstudies in terms of the DSRM, including cases that present the design\nof a database to support health assessment methods, a software reuse\nmeasure, an Internet video telephony application, and an IS planning\nmethod. The designed methodology effectively satisfies the three\nobjectives and has the potential to help aid the acceptance of DS\nresearch in the IS discipline.","authors":["Ken Peffers","Ken","Tuure Tuunanen","Tuure"],"meta":["January 2008Journal of Management Information Systems 24(3):45--77","DOI:10.2753/MIS0742-1222240302"],"references":["245385677_A_Survey_of_Design_Philosophies_Models_Methods_and_Systems","242601150_Doing_It_Right_Winning_with_New_Products","285741314_Assessing_information_system_design_theory_in_perspective_How_useful_was_our_1992_initial_rendition","256852152_Design_Science_in_Information_Systems_Research","247958734_The_Psychology_of_Personal_Constructs_Vol_I","242117687_Data_Warehouse_Dissemination_Strategies_for_Community_Health_Assessments","235720481_A_Methodological_Comparison_of_the_Structures_of_Scientific_Research_and_Engineering_Design_Their_Similarities_and_Differences","235720414_Design_Science_Research_in_Information_Systems","235720412_Systematic_Method_for_Designers","233862918_Mental_Models"]}