{"id":"2093979_Harmonic_analysis_of_iterated_function_systems_with_overlap","abstract":"An iterated function system (IFS) is a system of contractive mappings τi: Y→Y, i=1,N (finite), where Y is a complete metric space. Every such IFS has a unique (up to scale) equilibrium measure (also called the Hutchinson measure μ), and we study the Hilbert space L2 (μ). In this paper we extend previous work on IFSs without overlap. Our method involves systems of operators generalizing the more familiar Cuntz relations from operator algebra theory and from subband filter operators in signal processing. These Cuntz-like operator systems were used in recent papers on wavelet analysis by Baggett, Jorgensen, Merrill, and Packer [Contemp. Math. 345, 11-25 (2004)], where they serve as a first step to generating wavelet bases of Parseval type (alias normalized tight frames), i.e., wavelet bases with redundancy. Similarly, it was shown in work by Dutkay and Jorgensen [Rev. Mat. Iberoam. 22, 131-180 (2006)] that the iterative operator approach works well for generating wavelets on fractals from IFSs without overlap. But so far the more general and more difficult case of essential overlap has resisted previous attempts at a harmonic analysis and explicit basis constructions, in particular. The operators generating the appropriate Cuntz relations are composition operators, e.g., Fi: f→f τi, where (τi) is the given IFS. If the particular IFS is essentially nonoverlapping, it is relatively easy to compute the adjoint operators Si = Fi*, and the Si operators will be isometries in L2 (μ) with orthogonal ranges. For the case of essential overlap, we can use the extra terms entering in the computation of the operators Fi* as a \"measure\" of the essential overlap for the particular IFS we study. Here the adjoint operators Fi* refer to the Hilbert space L2 (μ), where μ is the equilibrium measure μ for the given IFS (τi).","authors":["Palle E. T. Jorgensen","Keri A. Kornelson","Karen Shuman"],"meta":["January 2007Journal of Mathematical Physics 48(8)","DOI:10.1063/1.2767004","SourcearXiv","Project: multi-resolution anallysis."],"references":["351271792_Examples","333020689_Differential_Equations_on_Fractals_A_Tutorial","305978335_Random_fractals_and_probability_metrics","286972247_Spectral_triples_for_AF_C-algebras_and_metrics_on_the_cantor_set","285341355_On_the_smoothness_properties_of_a_family_of_Bernoulli_convolutions","279963998_Mock_Fourier_series_and_transforms_associated_with_certain_Cantor_measures","268603857_Analysis_and_Probability_Wavelets_Signals_Fractals","268248408_Lax-Phillips_scattering_and_conservative_linear_systems_A_Cuntz-algebra_multidimensional_setting","267169615_On_the_Random_Series_l_n_an_Erdos_Problem","267121939_Grundbegriffe_der_Wahrscheinlichkeitsrechnung_Osnovnye_ponyatiya_teorii_veroyatnostej_2_Aufl"]}