{"id":"209409925_Transfer_of_Training_A_Review_and_Directions_for_Future_Research","abstract":"Transfer of training is of paramount concern for training researchers and practitioners. Despite research efforts, there is a growing concern over the \"transfer problem.\" The purpose of this paper is to provide a critique of the existing transfer research and to suggest directions for future research investigations. The conditions of transfer include both the generalization of learned material to the job and the maintenance of trained skills over a period of time on the job. The existing research examining the effects of training design, trainee, and work-environment factors on conditions of transfer is reviewed and critiqued. Research gaps identified from the review include the need to (1) test various operationalizations of training design and work-environment factors that have been posited as having an impact on transfer and (2) develop a framework for conducting research on the effects of trainee characteristics on transfer. Needed advancements in the conceptualization and operationalization of the criterion of transfer are also discussed. ABSTRACT FROM AUTHOR Copyright of Personnel Psychology is the property of Blackwell Publishing Limited and its content may not be copied or emailed to multiple sites or posted to a listserv without the copyright holder's express written permission. However, users may print, download, or email articles for individual use. This abstract may be abridged. No warranty is given about the accuracy of the copy. Users should refer to the original published version of the material for the full abstract. (Copyright applies to all Abstracts)","authors":["Timothy Baldwin","J. Kevin Ford"],"meta":["March 1988Personnel Psychology 41(1):63-105","DOI:10.1111/j.1744-6570.1988.tb00632.x"],"references":["289508771_Maintenance_strategies_for_the_treatment_of_obesity_An_evaluation_of_relapse_prevention_training_and_posttreatment_contact_by_mail_and_telephone","288467056_Social_Learning_Theory","288458901_How_personality_and_organizational_climate_variables_moderate_the_effectiveness_of_management_development_programmes_A_review_and_some_recent_research_findings","285920052_Effect_of_Verbal_Feedback_of_Test_Results_upon_Learning","284773475_Research_in_organizational_behavior","283994268_Behavioral_Medicine_Changing_Health_Life-Styles","282813845_Behavior_Modeling_training","275695908_The_Effects_of_Training_Goal_Setting_and_Knowledge_of_Results_on_Safe_Behavior_A_Component_Analysis","275213682_Work_and_Motivation","274219620_Motivation_in_Work_Organizations"]}