{"id":"215483679_Global_Perspectives_and_Challenges_on_Teacher_Education_in_Turkey","abstract":"There have been noticeable developments in technology and knowledge all over the world which have created an amazing learning environment and impacted teaching and learning. As globalization and knowledge societies expand, reform on the teacher education programs is becoming an important issue because teachers are always seen as moderators of a changing society. Consequently, countries had to improve their educational systems in order to provide their people enough knowledge to use this technology. Paralleling fast changes in Turkish society, like in other countries, there have been some changes in the purpose of the functioning of education. Hence, the necessity to make improvements in teacher preparation and training is a current issue. To be highly qualified, teachers must be well prepared, especially in improving the quality of education facing global challenges. For this purpose, we need teacher education reform that aligns teacher preparation with the demands of an emerging information society and an increasingly interdependent world in the 21st Century. Therefore, the purpose of this study is to develop a clear understanding on the following question: What would be the nature of a teacher preparation program for Turkish teachers (especially social studies teachers) that would take into account the demands of a global perspective engendered by an imminent entrance into the EU for Turkey? In other words, how should Turkish teacher education programs be modified to make teachers more globally aware and responsive in their teaching? In this regard, first, I provide a brief history of teacher education in Turkey and give a brief description of what teacher education programs currently look like. Second, I examine the roles of global actors (World Bank, EU etc..) in teacher education and finally I suggest what changes could be made to improve the quality of the program.","authors":["Bulent Tarman"],"meta":["January 2010"],"references":["303382310_Teacher_Socialization","291350601_teacher_education_reform_and_international_globalization_hegomony","249704603_Roles_Responsibilities_and_Relationships_in_Mentoring_A_Literature_Review_and_Agenda_for_Research","237724721_ARE_MENTOR_TEACHERS_TEACHER_EDUCATORS_1","237259044_The_Restructuring_Process_of_Teacher_Training_System_in_Turkey_A_Model_of_Teacher_Training_Based_on_PostGraduate_Education_PGCE","249704493_Institutionalizing_Cross-Cultural_Experiences_and_International_Expertise_in_Teacher_Education_The_Development_and_Potential_of_a_Global_Education_PDS_Network","241731067_Mentoring_teachers_What_are_the_issues","234578222_Preparing_Social_Studies_Teachers_for_the_Twenty-First_Century_Perspectives_on_Program_Effectiveness_from_a_Study_of_Six_Exemplary_Teacher_Education_Programs_on_Global_Education","233456796_Developing_Relationships_significant_episodes_in_professional_development","233282788_Student_Perceptions_of_a_Secondary_Postgraduate_Certificate_in_Education_Course","44835720_Diversity_Within_Unity_Essential_Principles_for_Teaching_and_Learning_in_a_Multicultural_Society","222600879_Curriculum_reform_in_Turkish_teacher_education_Attitudes_of_teacher_educators_towards_change_in_an_EU_candidate_nation","215530804_The_European_Union_and_the_Modernization_of_the_Turkish_Education_System","215530803_Socio-Cultural_Transformation_Western-oriented_Modernization_of_Turkey"]}