{"id":"215480946_Peer_Review_To_Improve_Artificial_Intelligence_Teaching","abstract":"Using a team-work, project-based methodology is a common approach when teaching Artificial Intelligence. However, a major drawback of such approach is that AI courses comprise a wide syllabus composed of quite independent topics. In consequence, students focus on one single topic from the entire course contents: although deep learning of such topic is probably ensured, learning of the rest of the contents is also probably much more superficial. In this paper, peer review is proposed as a complement to project-based learning. Students work not only on their project about a chosen topic, but also review peers' projects on distinct topics, providing them with a wider comprehension of the global syllabus of the course. Empirical results of the application of this approach to an actual course on Artificial Intelligence for senior students in Telecommunication Engineering are presented too. Analysis focuses on the effects of the reviewing task, as it is the one which broadens students learning. Positive results have been achieved, thus validating the interest of peer review as a useful instrument for learning improvement","authors":["Raquel M. Crespo García","Julio Villena-Román","Abelardo Pardo"],"meta":["January 2006Proceedings - Frontiers in Education Conference","DOI:10.1109/FIE.2006.322618","SourceIEEE Xplore","Conference: Frontiers in Education Conference, 36th Annual"],"references":["228958616_Electronic_peer_review_builds_resources_for_teaching_computer_architecture","221538627_Electronic_peer_review_and_peer_grading_in_computer-science_courses","3050718_Web-Based_peer_review_The_learner_as_both_adapter_and_reviewer","2528162_Strategies_And_Mechanisms_For_Electronic_Peer_Review","278417422_Electronic_peer_review_and_peer_grading_in_computer-science_courses","244488020_Peer_Assessment_Between_Students_in_Colleges_and_Universities","229422548_Aspects_of_Web-based_Peer_Assessment_Systems_for_Teaching_and_Learning_Computer_Programming","224757883_From_peer_assessment_towards_collaborative_learning","3883200_Strategies_and_mechanisms_for_electronic_peer_review"]}