{"id":"215616968_Understanding_the_difficulty_of_training_deep_feedforward_neural_networks","abstract":"Whereas before 2006 it appears that deep multilayer neural networks were not successfully trained, since then several algorithms have been shown to successfully train them, with experimental results showing the superiority of deeper vs less deep architectures. All these experimental results were obtained with new initialization or training mechanisms. Our objective here is to understand better why standard gradient descent from random initialization is doing so poorly with deep neural networks, to better understand these recent relative successes and help design better algorithms in the future. We first observe the influence of the non-linear activations functions. We find that the logistic sigmoid activation is unsuited for deep networks with random initialization because of its mean value, which can drive especially the top hidden layer into saturation. Surprisingly, we find that saturated units can move out of saturation by themselves, albeit slowly, and explaining the plateaus sometimes seen when training neural networks. We find that a new non-linearity that saturates less can often be beneficial. Finally, we study how activations and gradients vary across layers and during training, with the idea that training may be more difficult when the singular values of the Jacobian associated with each layer are far from 1. Based on these considerations, we propose a new initialization scheme that brings substantially faster convergence.","authors":["Xavier Glorot","Y. Bengio"],"meta":["January 2010Journal of Machine Learning Research 9:249-256"],"references":["303137904_Greedy_layer-wise_training_of_deep_networks","239033363_Accelerated_learning_in_layered_neural_networks","221346269_Extracting_and_composing_robust_features_with_denoising_autoencoders","306218037_Learning_multiple_layers_of_features_from_tiny_images","245993331_Efficient_Learning_of_Sparse_Overcomplete_Representations_with_an_Energy-Based_Model","235130690_Learning_in_Modular_Systems","229091480_Learning_Representations_by_Back_Propagating_Errors","224309464_Unsupervised_Learning_of_Probabilistic_Grammar-Markov_Models_for_Object_Categories","221618232_A_Scalable_Hierarchical_Distributed_Language_Model","221346162_Lecture_Notes_in_Computer_Science"]}