{"id":"215610329_Fundamentals_of_Algebraic_Graph_Transformation","abstract":"Graphs are widely used to represent structural information in the form of objects and connections between them. Graph transformation is the rule-based manipulation of graphs, an increasingly important concept in computer science and related fields. This is the first textbook treatment of the algebraic approach to graph transformation, based on algebraic structures and category theory.\nPart I is an introduction to the classical case of graph and typed graph transformation. In Part II basic and advanced results are first shown for an abstract form of replacement systems, so-called adhesive high-level replacement systems based on category theory, and are then instantiated to several forms of graph and Petri net transformation systems. Part III develops typed attributed graph transformation, a technique of key relevance in the modeling of visual languages and in model transformation. Part IV contains a practical case study on model transformation and a presentation of the AGG (attributed graph grammar) tool environment. Finally the appendix covers the basics of category theory, signatures and algebras.\nThe book addresses both research scientists and graduate students in computer science, mathematics and engineering.","authors":["Hartmut Ehrig","Karsten Ehrig","Ulrike Golas","Gabriele Taentzer"],"meta":["January 2006","DOI:10.1007/3-540-31188-2","Publisher: SpringerISBN: 3-540-31187-4"],"references":["222709839_Detecting_Structural_Refactoring_Conflicts_Using_Critical_Pair_Analysis","222690731_Overview_of_Formal_Concepts_for_Model_Transformations_Based_on_Typed_Attributed_Graph_Transformation","222681748_Towards_Common_Exchange_Formats_for_Graphs_and_Graph_Transformation_Systems","221570189_Adhesive_Categories","221115306_A_Toolbox_for_Automating_Visual_Software_Engineering","220713394_Computer_Aided_Multi-paradigm_Modelling_to_Process_Petri-Nets_and_Statecharts","221350102_Nested_Constraints_and_Application_Conditions_for_High-Level_Structures"]}