{"id":"215888320_Gender_differences_in_the_use_of_computers_programming_and_peer_interactions_in_computer_science_classrooms","abstract":"Research shows that female and male students in undergraduate computer science programs view computer culture differently. Female students are interested more in the use of computers than in doing programming, whereas male students see computer science mainly as a programming activity. The overall purpose of our research was not to find new definitions for computer science culture but to see how male and female students see themselves involved in computer science practices, how they see computer science as a successful career, and what they like and dislike about current computer science practices. The study took place in a mid-sized university inOntario. Sixteen students and two instructors were interviewed to get their views. We found that male and female views are different on computer use, programming, and the pattern of student interactions. Female and male students did not have any major issues in using computers. In computing programming, female students were not so involved in computing activities whereas male students were heavily involved. As for the opinions about successful computer science professionals, both female and male students emphasized hard working, detailed oriented approaches, and enjoying playing with computers. The myth of the geek as a typical profile of successful computer science students was not found to be true.","authors":["Dorian Stoilescu","Gunawardena Egodawatte"],"meta":["December 2010Computer Science Education 20(4):283-300","DOI:10.1080/08993408.2010.527691"],"references":["329024998_A_cultural_perspective_on_gender_diversity_in_computing","317953648_Naturalistic_inquiry","311473376_Unlocking_the_clubhouse_women_in_computing","287627604_Gender_and_Computers_Understanding_the_Digital_Divide","248437021_Naturalistic_inquiry_Beverly_Hills_CA_Sage_Publications_1985_416_pp_2500_Cloth","244954951_A_Cultural_Perspective_on_Gender_Diversity_in_Computing1","243777054_Qualitative_Inquiry_and_Research_Design","240793069_Gender_Group_Composition_Cooperation_and_Self-Efficacy_in_Computer_Studies","238683206_Gender_and_Technology_in_Education_A_Research_Review","238679166_Previous_Experience_and_The_Learning_of_Computer_Programming_The_Computer_Helps_Those_Who_Help_Themselves"]}