{"id":"215904200_Latent_Dirichlet_allocation_LDA_and_topic_modeling_models_applications_future_challenges_a_survey","abstract":"Graphical models have become the basic framework for topic based probabilistic modeling. Especially models with latent variables have proved to be effective in capturing hidden structures in the data. In this paper, we survey an important subclass Directed Probabilistic Topic Models (DPTMs) with soft clustering abilities and their applications for knowledge discovery in text corpora. From an unsupervised learning perspective, \"topics are semantically related probabilistic clusters of words in text corpora; and the process for finding these topics is called topic modeling\". In topic modeling, a document consists of different hidden topics and the topic probabilities provide an explicit representation of a document to smooth data from the semantic level. It has been an active area of research during the last decade. Many models have been proposed for handling the problems of modeling text corpora with different characteristics, for applications such as document classification, hidden association finding, expert finding, community discovery and temporal trend analysis. We give basic concepts, advantages and disadvantages in a chronological order, existing models classification into different categories, their parameter estimation and inference making algorithms with models performance evaluation measures. We also discuss their applications, open challenges and future directions in this dynamic area of research.","authors":["Ali Daud","Juanzi Li","Lizhu Zhou","Faqir Muhammad"],"meta":["June 2010Frontiers of Computer Science in China 4(2)","DOI:10.1007/s11704-009-0062-y","Project: Social Network Analysis and Mining"],"references":["312369894_Integrating_topics_and_syntax","314824215_Investigating_the_relationship_between_language_model_perplexity_and_IR_precision-recall_measures","313383979_Dynamic_topic_models","313069656_Link-plsa-lda_A_new_unsupervised_model_for_topics_and_influence_of_blogs","312917987_A_gentle_tutorial_of_the_em_algorithm_and_its_application_to_parameter_estimation_for_Gaussian_mixture_and_hidden_Markov_models","303802749_Indexing_by_Latent_Semantic_Analysis","277297380_Topic_Segmentation_with_an_Aspect_Hidden_Markov_Model","272024019_On_the_Theory_of_Brownian_Motion","271436871_Topics_over_time","271076887_Markov_Chain_Monte_Carlo_In_Practice"]}