{"id":"216300853_Evolutionary_Optimization_in_Uncertain_Environments---A_Survey","abstract":"Evolutionary algorithms often have to solve optimization problems in the presence of a wide range of uncertainties. Generally , uncertainties in evolutionary computation can be divided into the following four categories. First, the fitness function is noisy. Second, the design variables and/or the environmental parameters may change after optimization, and the quality of the obtained optimal solution should be robust against environmental changes or deviations from the optimal point. Third, the fitness function is approximated, which means that the fitness function suffers from approximation errors. Fourth, the optimum of the problem to be solved changes over time and, thus, the optimizer should be able to track the optimum continuously. In all these cases, additional measures must be taken so that evolutionary algorithms are still able to work satisfactorily. This paper attempts to provide a comprehensive overview of the related work within a unified framework, which has been scattered in a variety of research areas. Existing approaches to addressing different uncertainties are presented and discussed, and the relationship between the different categories of uncertainties are investigated. Finally, topics for future research are suggested.","authors":["Yaochu Jin","Juergen Branke"],"meta":["June 2005IEEE transactions on neural networks / a publication of the IEEE Neural Networks Council 9(3):303-317","DOI:10.1109/TEVC.2005.846356","SourceDBLP"],"references":["321525950_Noisy_Optimization_With_Evolution_Strategies","313620036_A_new_evolutionary_system_for_evolving_artificial_neural_networks","310750334_Efficiency_and_mutation_strength_adaptation_of_the_mumuilambda-es_in_a_noisy_environment","310750241_Efficient_fitness_estimation_in_noisy_environments","308087511_Response_Surface_Methodology","300913153_Dynamic_Sequencing_of_A_Multi-Processor_System_A_Genetic_Algorithm_Approach","292741906_Neural_Networks_for_Fitness_Approximation_in_Evolutionary_Optimization","292730264_A_cooperative_coevolutionary_approach_to_function_optimisation","285840167_Chance-constrained_genetic_algorithms","285296858_Model_Selection_and_Multimodel_Inference"]}