{"id":"2198164_Quantum_Memory_Hierarchies_Efficient_Designs_to_Match_Available_Parallelism_in_Quantum_Computing","abstract":"The assumption of maximum parallelism support for the successful realization of scalable quantum computers has led to homogeneous, ``sea-of-qubits'' architectures. The resulting architectures overcome the primary challenges of reliability and scalability at the cost of physically unacceptable system area. We find that by exploiting the natural serialization at both the application and the physical microarchitecture level of a quantum computer, we can reduce the area requirement while improving performance. In particular we present a scalable quantum architecture design that employs specialization of the system into memory and computational regions, each individually optimized to match hardware support to the available parallelism. Through careful application and system analysis, we find that our new architecture can yield up to a factor of thirteen savings in area due to specialization. In addition, by providing a memory hierarchy design for quantum computers, we can increase time performance by a factor of eight. This result brings us closer to the realization of a quantum processor that can solve meaningful problems.","authors":["Darshan Thaker","Tzvetan S. Metodi","Andrew Cross","Isaak Chuang"],"meta":["May 2006","DOI:10.1109/ISCA.2006.32","SourcearXiv"],"references":["320387291_Experimental_Issues_in_Coherent_Quantum-State_Manipulation_of_Trapped_Atomic_Ions","294766253_Entanglement_and_quantum_computation_with_ions_in_thermal_motion","280821144_Polynomial-Time_Algorithms_for_Prime_Factorization_and_Discrete_Logarithms_on_a_Quantum_Computer","280639762_Spin_Echoes","259600234_Quantum_repeaters_based_on_entanglement_purification","257976501_Erratum_Quantum_repeaters_based_on_entanglement_purification_Phys_Rev_A_59_169_1999","253297230_Hyperfine-State_Coherence_in_the_Presence_of_Spontaneous_Photon_Scattering","252442918_Sympathetic_Cooling_of_Trapped_Cd","244426581_Fault_tolerant_computation_with_constant_error","240034021_How_to_build_a_300_bit"]}