{"id":"220093593_Master's_Degrees_in_Software_Engineering_An_Analysis_of_28_University_Programs","abstract":"The software engineering institute published the last reference curriculum for a master's in software engineering in 1991. In 2007, a coalition from academia, industry, and government began creating a new reference curriculum. An early step was to establish a baseline of graduate education by surveying 28 master's programs in software engineering. The survey was largely limited to US schools. Key findings showed that the universities viewed software engineering largely as a specialization of computer science, that faculty size is generally small with few dedicated professors, and that new master's programs continue to start despite the decrease in computer science majors over the past few years. We used the IEEE Computer Society's Software Engineering Body of Knowledge (SWEBOK) to structure our analysis of the 28 curricula, focusing primarily on courses and topics required or semirequired of all students. (A course is semirequired if there is at least a 50 percent chance a student must take it.) Major findings show wide variation in the depth and breadth of SWEBOK coverage in required and semirequired courses, less than 40 percent of all programs requiring an introductory course on software engineering, and many universities having required and semirequired courses that are peripheral to SWEBOK.","authors":["Art Pyster","Richard Turner","Devanandham Henry","Kahina Lasfer"],"meta":["September 2009IEEE Software 26(5):94-101","DOI:10.1109/MS.2009.133","SourceDBLP"],"references":["220093079_The_Guide_to_the_Software_Engineering_Body_of_Knowledge","3249247_SE2004_Recommendations_for_Undergraduate_Software_Engineering_Curricula","235205119_SEI_Report_on_Graduate_Software_Engineering_Education_for_1991","229658774_System_and_software_architecture_reconciliation","221554200_A_view_of_20th_and_21st_century_software_engineering","4350196_Software_Engineering_Education_How_Far_We've_Come_and_How_Far_We_Have_to_Go"]}