{"id":"220069313_Covering_Arrays_for_Efficient_Fault_Characterization_in_Complex_Configuration_Spaces","abstract":"Abstract Testing systems with large configurations spaces that chang e often is a challenging problem. The cost and complexity of QA explodes because often there isn’t just one system, but a multitude of related systems. Bugs may appear in certain configurations, but not i n others. The Skoll system and process has been developed,to test these types of systems through distributed, continuous quality assurance, leveraging user resources around-the-world, around-the-clock. It has been shown to be effective in automatically characterizing configurations in which,failures manifest. The derived informa tion helps developers quickly narrow down,the cause of failures which then improves turn around time for fixes. However, this metho d does not scale well. It requires one to exhaustively test eac h configuration in the configuration space. In this paper we examine,an alternative approach. We use a mathematical,object called a covering array to obtain relatively small test schedules with certain coverage properties over the entire configuration space. We empirically assess the effect o f using covering array derived test schedules on the resulting faul t characterizations and provide guidelines to practitioners for th eir use.","authors":["Cemal Yilmaz","Myra B. Cohen","Adam Porter"],"meta":["February 2006ACM SIGSOFT Software Engineering Notes 32(4):20-34","DOI:10.1109/TSE.2006.8","SourceDBLP"],"references":["310606656_Classification_and_regression_trees","290882608_Semantic_Information_Retrieval","245592001_C_Network_Programming_Mastering_Complexity_with_ACE_and_Patterns","242451189_Information_retrieval_2nd_ed","240310918_Classification_and_Regression_Trees_CART","238739309_Robust_testing_of_att_pmxstarmail_using_oats","235961479_Classification_and_Regression_Trees","232654555_Applying_Design_of_Experiments_to_Software_Testing","227725288_On_the_state_of_strength-three_covering_arrays","222505579_The_design_of_the_TAO_real-time_object_request_broker"]}