{"id":"220017462_Enhancing_Teaching_Through_Constructive_Alignment","abstract":"Two lines of thinking are becoming increasingly important in higher educational practice. The first derives from constructivist learning theory, and the second from the instructional design literature. Constructivism comprises a family of theories but all have in common the centrality of the learner's activities in creating meaning. These and related ideas have important implications for teaching and assessment. Instructional designers for their part have emphasised alignment between the objectives of a course or unit and the targets for assessing student performance. \"Constructive alignment\" represents a marriage of the two thrusts, constructivism being used as a framework to guide decision-making at all stages in instructional design: in deriving curriculum objectives in terms of performances that represent a suitably high cognitive level, in deciding teaching/learning activities judged to elicit those performances, and to assess and summatively report student performance. The \"performances of understanding\" nominated in the objectives are thus used to systematically align the teaching methods and the assessment. The process is illustrated with reference to a professional development unit in educational psychology for teachers, but the model may be generalized to most units or programs in higher education.","authors":["John B Biggs"],"meta":["October 1996Higher Education 32:347-364","DOI:10.1007/BF00138871"],"references":["288006470_Effects_of_learning_skills_interventions_on_first_year_university_students'_learning","312939545_Learning_remembering_and_understanding","312605338_General_systems_theory","304440768_CSILE_Trying_to_bring_students_into_world_3","303874494_Learning_remembering_and_understanding","292981243_Constructivism_in_Education","291982526_Beyond_standardized_testing_Assessing_authentic_academic_achievement_in_the_secondary_school","290952874_Understanding_Student_Thinking_and_Learning_in_the_Classroom","286773180_Researcher","284681948_The_learner's_experience_of_learning"]}