{"id":"220017671_YALE_Rapid_Prototyping_for_Complex_Data_Mining_Tasks","abstract":"KDD is a complex and demanding task. While a large number of methods has been established for numerous problems, many challenges remain to be solved. New tasks emerge requiring the development of new methods or processing schemes. Like in software development, the development of such solutions demands for careful analysis, specification, implementation, and testing. Rapid prototyping is an approach which allows crucial design decisions as early as possible. A rapid prototyping system should support maximal re-use and innovative combinations of existing methods, as well as simple and quick integration of new ones. This paper describes YALE, a free open-source environment for KDD and machine learning. YALE provides a rich variety of methods which allows rapid prototyping for new applications and makes costly re-implementations unnecessary. Additionally, YALE offers extensive functionality for process evaluation and optimization which is a crucial property for any KDD rapid prototyping tool. Following the paradigm of visual programming eases the design of processing schemes. While the graphical user interface supports interactive design, the underlying XML representation enables automated applications after the prototyping phase. After a discussion of the key concepts of YALE, we illustrate the advantages of rapid prototyping for KDD on case studies ranging from data pre-processing to result visualization. These case studies cover tasks like feature engineering, text mining, data stream mining and tracking drifting.","authors":["Ingo Mierswa","Michael Wurst","Ralf Klinkenberg","Martin Scholz"],"meta":["August 2006","DOI:10.1145/1150402.1150531","Conference: Proceedings of the 12th ACM SIGKDD International Conference on Know ledge Discovery and Data Mining"],"references":["238103549_Grid-Based_Data_Mining_and_Knowledge_Discovery","229001096_3_The_MiningMart_Approach_to_Knowledge_Discovery_in_Databases","228771764_GridMiner_A_Framework_for_Knowledge_Discovery_on_the_Grid_-_from_a_Vision_to_Design_and_Implementation","225194074_Automatic_Feature_Extraction_for_Classifying_Audio_Data","290696260_KDDML_A_middleware_language_and_system_for_knowledge_discovery_in_databases","228361892_Publishing_Operational_Models_of_Data_Mining_Case_Studies","223117716_Buckley_C_Term-Weighting_Approaches_in_Automatic_Text_Retrieval_Information_Processing_Management_245_513-523","221900847_Data_Mining_Practical_Machine_Learning_Tools_And_Techniques","221653850_Sampling-based_sequential_subgroup_mining","220974337_KDDML_A_Middleware_Language_and_System_for_Knowledge_Discovery_in_Databases_Data_and_Knowledge_Engineering_572_179-220"]}