{"id":"220079574_Developing_and_Validating_an_Observational_Learning_Model_of_Computer_Software_Training_and_Skill_Acquisition","abstract":"Computer skills are key to organizational performance, and past research indicates that behavior modeling is a highly effective form of computer skill training.The present research develops and tests a new theoretical model of the underlying observational learning processes by which modeling-based training interventions influence computer task performance.Observational learning processes are represented as a second-order construct with four dimensions (attention, retention, production, and motivation).New measures for these dimensions were developed and shown to have strong psychometric properties.The proposed model controls for two pretraining individual differences (motivation to learn and self-efficacy) and specifies the relationships among three training outcomes (declarative knowledge, post-training self-efficacy, and task performance).The model was tested using PLS on data from an experiment (N = 95) on computer spreadsheet training.As hypothesized, observational learning processes significantly influenced training outcomes. A representative modeling-based training intervention (retention enhancement) significantly improved task performance through its specific effects on the retention processes dimension of observational learning.The new model provides a more complete theoretical account of the mechanisms by which modeling-based interventions affect training outcomes, which should enable future research to systematically evaluate the effectiveness of a wide range of modeling-based training interventions.Further, the new instruments can be used by practitioners to refine ongoing training programs.","authors":["Mun Y. Yi","Fred D. Davis"],"meta":["June 2003Information Systems Research 14(2):146-169","DOI:10.1287/isre.14.2.146.16016","SourceDBLP"],"references":["313137896_The_partial_least_squares_approach_to_causal_modeling_Personal_computer_adoption_and_use_as_an_illustration","311766005_The_Partial_Least_Squares_Approach_to_Structural_Equation_Modeling","277502351_Meeting_trainees'_expectations_The_influence_of_training_fulfillment_on_the_development_of_commitment_self-efficacy_and_motivation","271675462_Trainees'_Attributes_and_Attitudes_Neglected_Influences_on_Training_Effectiveness","313430484_Effects_of_feedback_and_cognitive_playfulness_on_performance_in_microcomputer_software_training","313208577_A_Paradigm_for_Developing_Better_Measures_of_Marketing_Constructs","280794819_The_effect_of_a_mastery_practice_design_on_learning_and_transfer_in_behavior_modeling_training","279082963_EFFECTS_OF_SYMBOLIC_CODING_AND_REHEARSAL_IN_BEHAVIOR-MODELING_TRAINING","271688994_Toward_A_Taxonomy_of_Multidimensional_Constructs","270726916_Turning_Work_into_Play_Implications_for_Microcomputer_Software_Training"]}