{"id":"220089726_Virtual_Environments_for_Assessing_and_Rehabilitating_CognitiveFunctional_Performance_A_Review_of_Projects_at_the_USC_Integrated_Media_Systems_Center","abstract":"Virtual reality (VR) technology offers new options for the creation of sophisticated tools that could be applied in the areas of assessment and rehabilitation of cognitive and functional processes. VR systems allow for the precise presentation and control of dynamic, multisensory, three-dimensional (3-D) stimulus environments, as well as the recording of all behavioral responses that occur within them. Assessment and rehabilitation scenarios that would be difficult if not impossible to deliver using con- ventional neuropsychological methods are now being developed that take advan- tage of these VR assets. If empirical studies demonstrate effectiveness, virtual envi- ronments (VEs) could be of considerable value for better understanding, measuring, and treating persons with impairments due to traumatic brain injury, neurological disorders, and learning disabilities. This article describes the progress of a VR re- search program at the USC Integrated Media Systems Center and Information Sci- ences Institute that has developed and investigated the use of a series of VEs de- signed to target (i) molecular visuospatial skills using a 3-D, projection-based ImmersaDesk system, and (ii) attention (and soon memory and executive function- ing) processes within ecologically valid functional scenarios utilizing a head-mounted display (HMD). Results from completed research, rationales and methodology of works in progress, and our plan for future work is presented. Our primary vision has been to develop VR systems that target cognitive processes and functional skills that are of relevance to a wide range of patient populations with central nervous system (CNS) dysfunction, as well as for the assessment of unimpaired perfor- mance. We have also sought to select cognitive/functional targets that intuitively appear well matched to the specific assets available with currently available VR technology.","authors":["Albert Rizzo","J. Galen Buckwalter","Jocelyn Shealy Mcgee","Todd Bowerly"],"meta":["August 2001Presence Teleoperators & Virtual Environments 10(4):359-374","DOI:10.1162/1054746011470226","SourceDBLP"],"references":["309254394_Psychometric_Theory","292070539_Virtual_environment_applications_in_clinical_neuropsychology","285642994_Effects_of_estrogen_changes_during_the_menstrual_cycle_on_spatial_performance","284253584_Assessment_of_Children","283559962_The_relationship_between_teststerone_levels_and_cognitive_ability_patterns","279233923_Mental_and_manual_rotation","272860472_Visuospatial_Judgment","243785674_California_Verbal_Learning_Test-II","243782275_Wechsler_Memory_Scale_-_Revised","243770205_Wechsler_Adult_Intelligence_Scale-Revised_UK"]}