{"id":"220049065_An_Objective_Analysis_of_Support_Vector_Machine_Based_Classification_for_Remote_Sensing","abstract":"Abstract Accurate thematic classification is one of the most commonly desired outputs from remote sensing images. Recent research efforts to improve the reliability and accuracy of image classification have led to the introduction of the Support Vector Classification (SVC) scheme. SVC is a new generation of supervised learning method based on the principle of statistical learning theory, which is designed to decrease uncertainty in the model structure and the fitness of data. We have presented a comparative analysis of SVC with the Maximum Likelihood Classification (MLC) method, which is the most popular conventional supervised classification technique. SVC is an optimization technique in which the classification accuracy heavily relies on identifying the optimal parameters. Using a case study, we verify a method to obtain these optimal parameters such that SVC can be applied efficiently. We use multispectral and hyperspectral images to develop thematic classes of known lithologic units in order to compare the classification accuracy of both the methods. We have varied the training to testing data proportions to assess the relative robustness and the optimal training sample requirement of both the methods to achieve comparable levels of accuracy. The results of our study illustrated that SVC improved the classification accuracy, was robust and did not suffer from dimensionality issues such as the Hughes Effect.","authors":["Thomas Oommen","Debasmita Misra","Navin Kumar C. Twarakavi","Anupma Prakash"],"meta":["May 2008Mathematical Geosciences 40:409-424","DOI:10.1007/s11004-008-9156-6"],"references":["307741544_Un_approccio_robusto_alla_verifica_d'ipotesi_basato_sulla_funzione_di_verosomiglianza_pesata","263448108_Support_vector_machines_for_classification_in_remote_sensing","329531048_On_a_closer_look_at_weighted_likelihood_in_the_context_of_mixtures","316805715_Hyperspectral_Imaging","311396907_Hyperspectral_Imaging_Techniques_for_Spectral_Detection_and_Classification","310842623_A_practical_guide_to_support_vector_classification","302204208_On_the_mean_accuracy_of_statistical_pattern_recognizers","288023219_A_Practical_Guide_to_Support_Vector_Classification","255570078_Geologic_Map_of_Nevada","254287675_Weighted_Likelihood_Equations_with_Bootstrap_Root_Search","253832082_The_effect_of_training_set_size_and_composition_on_artificial_neural_network_classification","248591610_An_assessment_of_support_vector_machines_for_land_cover_classie_cation","247703970_Techniques_for_Image_Processing_and_Classification_in_Remote_Sensing","246829162_Million-Scale_Geologic_Map_of_Nevada","243763580_The_Nature_Of_Statistical_Learning_Theory"]}