{"id":"220079462_Application_of_Social_Cognitive_Theory_to_Training_for_Computer_Skills","abstract":"While computer training is widely recognized as an essential contributor to the productive use of computers in organizations, very little research has focused on identifying the processes through which training operates, and the relative effectiveness of different methods for such training. This research examined the training process, and compared a behavior modeling training program, based on Social Cognitive Theory (Bandura 1977, 1978, 1982, 1986), to a more traditional, lecture-based program. According to Social Cognitive Theory, watching others performing a behavior, in this case interacting with a computer system, influences the observers' perceptions of their own ability to perform the behavior, or self-efficacy, and the expected outcomes that they perceive, as well as providing strategies for effective performance. The findings provide only partial support for the research model. Self-efficacy exerted a strong influence on performance in both models. In addition, behavior modeling was found to be more effective than the traditional method for training in Lotus 1-2-3, resulting in higher self-efficacy and higher performance. For WordPerfect, however, modeling did not significantly influence performance. This finding was unexpected, and several possible explanations are explored in the discussion. Of particular surprise were the negative relationships found between outcome expectations and performance. Outcome expectations were expected to positively influence performance, but the results indicated a strong negative effect. Measurement limitations are presented as the most plausible explanation for this result, but further research is necessary to provide conclusive explanations. Copyright © 1995, Institute for Operations Research and the Management Sciences.","authors":["Deborah R. Compeau","Christopher A. Higgins"],"meta":["June 1995Information Systems Research 6(2):118-143","DOI:10.1287/isre.6.2.118","SourceDBLP"],"references":["232444723_Beyond_Imitation_Complex_Behavioral_and_Affective_Linkages_Resulting_From_Exposure_toLeadership_Training_Models","234716110_Systems_Quality_User_Reactions_and_the_Use_of_Information_Systems","232580779_Brainstorming_on_a_hot_problem_Effects_of_training_and_practice_on_individual_and_group_performance"]}