{"id":"220161158_The_MAGMA_algebra_system_I_the_user_language","abstract":"In the rst of two papers on Magma, a new system for computational algebra, we present the Magma language, outline the design principles and theoretical background, and indicate its scope and use. Particular attention is given to the constructors for structures, maps, and sets. c 1997 Academic Press Limited Magma is a new software system for computational algebra, the design of which is based on the twin concepts of algebraic structure and morphism. The design is intended to provide a mathematically rigorous environment for computing with algebraic struc- tures (groups, rings, elds, modules and algebras), geometric structures (varieties, special curves) and combinatorial structures (graphs, designs and codes). The philosophy underlying the design of Magma is based on concepts from Universal Algebra and Category Theory. Key ideas from these two areas provide the basis for a gen- eral scheme for the specication and representation of mathematical structures. The user language includes three important groups of constructors that realize the philosophy in syntactic terms: structure constructors, map constructors and set constructors. The util- ity of Magma as a mathematical tool derives from the combination of its language with an extensive kernel of highly ecient C implementations of the fundamental algorithms for most branches of computational algebra. In this paper we outline the philosophy of the Magma design and show how it may be used to develop an algebraic programming paradigm for language design. In a second paper we will show how our design philoso- phy allows us to realize natural computational \\environments\" for dierent branches of algebra. An early discussion of the design of Magma may be found in Butler and Cannon (1989, 1990). A terse overview of the language together with a discussion of some of the implementation issues may be found in Bosma et al. (1994).","authors":["Wieb Bosma","John J. Cannon","Catherine Playoust"],"meta":["September 1997Journal of Symbolic Computation 24(3-4):235-265","DOI:10.1006/jsco.1996.0125","SourceDBLP"],"references":["221564408_Programming_with_Algebraic_Structures_Design_of_the_MAGMA_Language","319394082_Algebraic_Programming_with_Magma","265354140_Categories_for_the_working_mathematician_2nd_ed","246355624_Handbook_of_Magma_Functions","238351902_The_scientic_computation_system","225537318_The_design_of_cayley_-_a_language_for_modern_algebra","215458786_A_Computer_Algebra_System_based_on_Order-sorted_Algebra","50332962_Categories_for_Working_Mathematicians"]}