{"id":"220195673_A_novel_algorithm_for_ontology_matching","abstract":"Ontology matching is an essential aspect of the Semantic Web with a goal of finding alignments among the entities of given ontologies. Ontology matching is a necessary step for establishing interoperation and knowledge sharing among Semantic Web applications. In this study we present an algorithm and a tool developed based on this algorithm to find correspondences among entities of input ontologies. The proposed algorithm uses a new lexical similarity measure and also utilizes structural information of ontologies to determine their corresponding entities. The lexical similarity measure generates a bag of words for each entity based on its label and description information. The structural approach creates a grid for each node in the ontologies. The combination of lexical and structural approaches creates the similarity matrix between the source and target ontologies. The proposed algorithm was tested on a well known benchmark and also compared to other algorithms presented in the literature. Our experimental results show the proposed algorithm is effective and outperforms other algorithms.","authors":["Ismail Akbari","Mohammad Fathian"],"meta":["May 2010Journal of Information Science 36(3):324-334","DOI:10.1177/0165551510361432","SourceDBLP"],"references":["228579908_A_Semantic_Information_Gathering_Approach_for_Heterogeneous_Information_Sources_on_WWW","226450264_Measuring_Similarity_between_Ontologies","222659233_Peer-to-Peer_Semantic_Coordination","221467252_Ontology_matching_with_CIDER_Evaluation_report_for_the_OAEI_2008","326332911_Semantic_Web_Mining_State_of_the_Art_and_Future_Directions","251896276_An_Improved_MLMA_plus_and_Its_Application_in_Ontology_Matching","243772764_Binary_codes_capable_of_correcting_insertions_and_reversals","242926034_Ontologies_for_universal_information_systems","228397671_Automated_schema_matching_techniques_An_exploratory_study","223395306_A_semantic_similarity_metric_combining_features_and_intrinsic_information_content"]}