{"id":"220134230_A_Hybrid_Centralized_Routing_Protocol_for_80211s_WMNs","abstract":"Wireless mesh networks (WMNs) are being widely accepted as a critical wireless access solution for various applications. Due\nto minimal mobility in mesh nodes, a backbone topology can be effectively maintained in WMN using a proactive routing protocol.\nIn IEEE 802.11s standard, a tree-based routing (TBR) protocol is adopted as a viable proactive routing protocol for a WMN\nwith user traffic flowing to/from a wired network through a root (i.e., a mesh portal). However, the performance of the TBR\nprotocol degrades rapidly as the user traffic becomes dominated by intra-mesh traffic. The reason is that the routing path\nthrough the root even for intra-mesh traffic unnecessarily overloads the root. Furthermore, the TBR performance becomes more\nsevere when the network size of WMN is large, which could lead to the huge amount of intra-mesh traffic towards the root.\nTo overcome these problems, we propose a new routing mechanism, root driven routing (RDR) protocol, for the root to quickly\ndetermine the best-metric route for any source-destination pair of intra-mesh traffic. For inter-mesh traffic, the original\nTBR protocol is employed. Thus, the hybrid centralized routing protocol that combines TBR and RDR and is adaptive to all traffic\nscenarios. Our simulation results reveal that the proposed RDR protocol outperforms the TBR protocol with much lower average\nend-to-end delay and much higher packet delivery ratio for intra-mesh traffic. The simulation results also provide some insight\ninto the right tradeoff between the TBR protocol and the RDR protocol to achieve the best performance of the hybrid centralized\nrouting protocol for WMNs.","authors":["Azman Osman Lim","Xudong Wang","Youiti Kado","Bing Zhang"],"meta":["April 2008Mobile Networks and Applications 13(1-2):117-131","DOI:10.1007/s11036-008-0038-4","SourceDBLP"],"references":["4165581_Architecture_and_algorithms_for_an_IEEE_80211-based_multi-channel_wireless_mesh_network","2385509_Multicast_Operation_of_the_Ad-hoc_On-Demand_Distance_Vector_Routing_Protocol","310670788_Ad-hoc_on-demand_distance_vector_AODV_routing","284602927_Ad_hoc_on-demand_distance_vector_AODV_routing","248893991_Topology_dissemi_-_nation_based_on_reverse_-_path_forwarding_TBRPF_RFC_3684","242609537_Topology_Dissemination_Based_on_Reverse-Path_Forwarding_TBRPF","235559081_Wireless_LAN_medium_access_control_MAC_physical_layer_PHY_specifications_Amendment_1_High-Speed_Physical_Layer_in_the_5_GHz_Band","230750731_Part_11_Wireless_LAN_medium_access_control_MAC_and_physical_layer_PHY_Specifications","228384530_Ad_Hoc_On-demand_Distance_Vector_Routing_Protocol","226665557_Tree_Based_Broadcast_in_Ad_Hoc_Networks","222813654_Wireless_Mesh_Networks_a_survey","220426870_Reverse_Path_Forwarding_of_Broadcast_Packets","216720238_Wireless_Medium_Access_Control_MAC_and_Physical_Layer_PHY_specifications","3048842_Tree-Based_Broadcasting_in_Multihop_Radio_Networks"]}