{"id":"220280136_A_framework_for_the_development_of_videogames","abstract":"A framework is a high-level solution for the reuse of software pieces, a step forward in simple library-based reuse, that allows the sharing of not only common functions but also the generic logic of a domain application. It also ensures a better level of quality for the final product, given the fact that an important fraction of the application is already found within the framework and has therefore already been tested. This case study takes the systematic generation of hot-spot subsystems approach as a reference point to describe the underlying concepts in the design of a framework for the development of 2D action videogames for low-performance machines. The main goal of this paper is to show the applicability of framework-based reuse to videogames. Both standard and framework-based game implementations are compared and the results are analysed. Special attention is paid to the (potential) benefits that the use of frameworks brings to the fulfillment of maintenance tasks along the game's life cycle, a stage that normally consumes most resources in software projects. At the end of the paper, based on the implementation results, this study shows the predicted conditions under which building a framework is cost effective for the development of videogames similar to the ones from the studied domain. Copyright © 2001 John Wiley & Sons, Ltd.","authors":["Raul Santelices","Miguel Nussbaum"],"meta":["September 2001Software Practice and Experience 31(11):1091-1107","DOI:10.1002/spe.403","SourceDBLP"],"references":["234794062_Software_Maintenance_Management","220421142_Managing_Application_Program_Maintenance_Expenditures","246375764_Higher_level_programming_for_the_21st_century","240249302_Software_Engineering_a_Practioner''s_approach","239026074_Maintenance_burden_begging_for_remedy","237106818_The_Unified_Modeling_Language_User_Guide","224773145_Design_Patterns_Elements_of_Reusable_Object-Oriented_Software","221395953_Maintenance_as_a_function_of_design","220071348_Reusing_Software_Issues_and_Research_Directions","27297768_Systematic_Framework_Design_By_Generalization","3247215_Creating_applications_from_components_A_manufacturing_framework_design","2955039_Design_Patterns_in_Object-Oriented_Frameworks","2954905_Scripting_Higher-Level_Programming_for_the_21st_Century","2954630_Managing_object_oriented_framework_reuse"]}