{"id":"220260178_Time_Flies_When_You're_Having_Fun_Cognitive_Absorption_and_Beliefs_about_Information_Technology_Usage","abstract":"Extant explanations of why users behave in particular ways toward information technologies have tended to focus predominantly on instrumental beliefs as drivers of individual usage intentions. Prior work in individual psychology, however, suggests that holistic experiences with technology as captured in constructs such as enjoyment and flow are potentially important explanatory variables in technology acceptance theories. In this paper, we describe a multidimensional construct labeled cognitive absorption and defined as a state of deep involvement with software. Cognitive absorption, theorized as being exhibited through the five dimensions of temporal dissociation, focused immersion, heightened enjoyment, control, and curiosity, is posited to be a proximal antecedent of two important beliefs about technology use: perceived usefulness and perceived ease of use. In addition, we propose that the individual traits of playfulness and personal innovativeness are important determinants of cognitive absorption. Based on the conceptual definition of this construct, operational measures for each dimension are developed. Using the World Wide Web as the target technology, scale validation indicates that the operational measures have acceptable psychometric properties and confirmatory factor analysis supports the proposed multi-dimensional structure. Structural equation analysis provides evidence for the theorized nomological net of cognitive absorption. Theoretical and practical implications are offered.","authors":["Ritu Agarwal","Elena Karahanna"],"meta":["December 2000MIS Quarterly 24(4):665-694","DOI:10.2307/3250951","SourceDBLP"],"references":["311766005_The_Partial_Least_Squares_Approach_to_Structural_Equation_Modeling","329258632_Marketing_in_Hypermedia_Computer-Mediated_Environments_Conceptual_Foundations","324378549_Latent_Variable_Path_Modeling_with_Partial_Least_Squares","318494438_Flow_the_psychology_of_optimal_experience","317953663_Self-Efficacy_Toward_a_Unifying_Theory_of_Behavioral_Change","316807278_Intrinsic_Motivation_and_Self-Determination_in_Human_Behavior","313604424_Evaluating_Structural_Equation_Models_with_Unobservable_Variables_and_Measurement_Error","313074236_Towards_a_psychology_of_optimal_experience","312984568_Perceived_usefulness_perceived_ease_and_user_acceptance_of_information_technology","312982162_Communication_and_information_alternative_uses_of_the_Internet_in_households","304575832_From_intentions_to_actions_a_theory_of_planned_behavior_in_action_control_From_cognition_to_behavior","304534338_Understanding_Attitudes_and_Predicting_Social_Behavior","302244591_Intrinsic_Motivation_and_Development","297403111_ABSORPTION_-_NATURE_ASSESSMENT_AND_CORRELATES","285831994_Self-Efficacy_The_Exercise_of_Control"]}