{"id":"220261894_Primer_Master_A_new_program_for_the_design_and_analysis_of_PCR_primers","abstract":"The polymerase chain reaction (PCR) is one of the most rapidly expanding methods in molecular biology. Although the range of applications of PCR is very broad, the key points for successful performance remain the careful selection of optimal primers and the proper determination of the temperature conditions of the reaction. The program presented here, 'Primer Master', has been developed to assist in solving these problems for two major types of PCR: the amplification of the appropriate fragments of several related, but not identical, sequences and the specific amplification of a certain fragment of only one nucleotide sequence where amplifi- cation of any other sequence needs to be prevented. Unlike other programs developed for the design of PCR primers, 'Primer Master' undertakes an automatic search and selection of the optimal primers and primer pairs for both types of reaction. The wide applicability of'Primer Master' is determined by two main automatic search regimes: 'Universal' and 'Specific'. The 'Universal' regime searches and selects primers and primer pairs which amplify the designated fragments of all required sequences (consensus primers) and allows a 'combined search', where the universal primers for a particular group of sequences must not amplify any sequence from another group. The number of sequences allowed is 2 to 100, with a maximum length of 65 000 nucleotides. The 'Specific' regime is designed to select the primers and primer pairs which amplify the fragment of a specific nucleotide sequence from all those the user wishes to consider. The total number of sequences to be tested is unlimited, and sequences up to 32000 nucleotides in length are allowed. 'Primer Master' also incorporates a number of special features designed to overcome problems common to PCR. Within the 'Specific' regime it may be necessary to find primers from one of several related sequences. However, if the sequences span different positions then there is the risk that the primers chosen may include regions absent from","authors":["Vitali Proutski","Edward C Holmes"],"meta":["June 1996Bioinformatics 12(3):253-255","DOI:10.1093/bioinformatics/12.3.253","SourceDBLP"],"references":["21285532_Stacking_energies_in_DNA","20428974_Influence_of_Abasic_and_Anucleosidic_Sites_on_the_Stability_Conformation_and_Melting_Behavior_of_a_DNA_Duplex_Correlations_of_Thermodynamic_and_Structural_Data","19697491_Predicting_DNA_Duplex_Stability_from_the_Base_Sequence","247381387_NMR_studies_of_abasic_sites_in_DNA_duplexes_Deoxyadenosine_stacks_into_the_helix_opposite_the_cyclic_analogue_of_2-deoxyribose","21136781_Thermodynamic_characterization_of_deoxyribooligonucleotide_duplexes_containing_bulges","19780819_Melting_of_short_DNA_fragments_Relation_between_the_nucleation_constant_of_a_spiral_region_and_the_ionic_strength","19747067_Influence_of_dangling_thymidine_residues_on_the_stability_and_structure_of_two_DNA_duplexes","16133342_Structure_and_energetics_of_a_hexanucleotide_duplex_with_stacked_trinucleotide_ends_formed_by_the_sequence_dGAATTCGCG","16133341_Extra_adenosine_stacks_into_the_self-complementary_dCGCAGAATTCGCG_duplex_in_solution","16133340_Structure_dynamics_and_energetics_of_deoxyguanosinethymidine_wobble_base_pair_formation_in_the_self-complementary_dCGTGAATTCGCG_duplex_in_solution"]}