{"id":"220259897_User_Acceptance_of_Information_Technology_Toward_a_Unified_View","abstract":"Information technology (IT) acceptance research has yielded many competing models, each with different sets of acceptance determinants. In this paper, we (1) review user acceptance literature and discuss eight prominent models, (2) empiri- cally compare the eight models and their exten- sions, (3) formulate a unified model that integrates elements across the eight models, and (4) empiri- cally validate the unified model. The eight models reviewed are the theory of reasoned action, the technology acceptance model, the motivational model, the theory of planned behavior, a model combining the technology acceptance model and the theory of planned behavior, the model of PC utilization, the innovation diffusion theory, and the social cognitive theory. Using data from four organizations over a six-month period with three points of measurement, the eight models ex- plained between 17 percent and 53 percent of the variance in user intentions to use information technology. Next, a unified model, called the Unified Theory of Acceptance and Use of Tech- nology (UTAUT), was formulated, with four core determinants of intention and usage, and up to four moderators of key relationships. UTAUT was then tested using the original data and found to outperform the eight individual models (adjusted","authors":["Viswanath Venkatesh","Michael G Morris","Gordon B Davis","Fred D. Davis"],"meta":["September 2003MIS Quarterly 27(3):425-478","DOI:10.2307/30036540","SourceDBLP"],"references":["311766005_The_Partial_Least_Squares_Approach_to_Structural_Equation_Modeling","298348626_The_Theory_of_Reasoned_Action_A_Meta-Analysis_of_Past_Research_with_Recommendations_for_Modifications_and_Future_Research","313570039_Relationships_of_age_and_seniority_with_career_variables_of_engineers_and_scientists","313558350_Understanding_Information_Technology_Usage_A_Test_of_Competing_Models","309905009_The_bases_of_social_power","298348474_The_theory_of_reasoned_action_A_meta-analysis_of_past_research_with_recommendations_for_modifications_and_future_research","287651935_Development_of_an_instrument_to_measure_perceptions_of_adoption_of_an_information_technology_innovations","284666424_Attention_and_performance_Identifying_and_localizing_age_deficits","274911801_Multiple_Regression_Testing_and_Interpreting_Interactions","274799723_Diffusion_of_Innovations"]}