{"id":"220248383_A_Calculus_of_Mobile_Processes_I","abstract":"We present the π-calculus, a calculus of communicating systems in which one can naturally express processes which have changing structure. Not only may the component agents of a system be arbitrarily linked, but a communication between neighbours may carry information which changes that linkage. The calculus is an extension of the process algebra CCS, following work by Engberg and Nielsen, who added mobility to CCS while preserving its algebraic properties. The π-calculus gains simplicity by removing all distinction between variables and constants; communication links are identified by names, and computation is represented purely as the communication of names across links. After an illustrated description of how the π-calculus generalises conventional process algebras in treating mobility, several examples exploiting mobility are given in some detail. The important examples are the encoding into the π-calculus of higher-order functions (the λ-calculus and combinatory algebra), the transmission of processes as values, and the representation of data structures as processes. The paper continues by presenting the algebraic theory of strong bisimilarity and strong equivalence, including a new notion of equivalence indexed by distinctions—i.e., assumptions of inequality among names. These theories are based upon a semantics in terms of a labeled transition system and a notion of strong bisimulation, both of which are expounded in detail in a companion paper. We also report briefly on work-in-progress based upon the corresponding notion of weak bisimulation, in which internal actions cannot be observed.","authors":["Robin Milner","Joachim Parrow","David Walker"],"meta":["September 1992Information and Computation 100(1):1-40","DOI:10.1016/0890-5401(92)90008-4","SourceDBLP"],"references":["234540515_Algebra_of_communicating_processes","284060434_The_Zero_Assignment_Parallel_Processor_ZAPP_project","270956456_A_Calculus_of_Mobile_Processes_Parts_I_and_II","256554935_Parametric_channels_via_label_expressions_in_CCS","234803172_Communication_and_Concurrency","234777183_Calculus_of_higher_order_communicating_systems","226356938_Functions_as_processes","222436931_Algebra_of_communicating_processes_with_abstraction","220993118_Cell_and_Ensemble_Architecture_for_the_Rewrite_Rule_Machine","220758683_The_Typed_lambda-Calculus_with_First-Class_Processes","220247575_A_Calculus_of_Mobile_Processes_II","35127803_Foundations_of_Actor_Semantics","3498801_Fully_abstract_models_of_the_lazy_lambda_calculus"]}