{"id":"220209990_Intra-Socket_and_Inter-Socket_Communication_in_Multi-core_Systems","abstract":"The increasing computational and communication demands of the scientific and industrial communities require a clear understanding of the performance trade-offs involved in multi-core computing platforms. Such analysis can help application and toolkit developers in designing better, topology aware, communication primitives intended to suit the needs of various high end computing applications. In this paper, we take on the challenge of designing and implementing a portable intra-core communication framework for streaming computing and evaluate its performance on some popular multi-core architectures developped by Intel, AMD and Sun. Our experimental results, obtained on the Intel Nehalem, AMD Opteron and Sun Niagara 2 platforms, show that we are able to achieve an intra-socket small message latency between 120 and 271 nanoseconds depending on the hardware platform, while the inter-socket small message latency is between 218 and 320 nanoseconds. The maximum intra-socket communication bandwidth ranges from 0.179 (Sun Niagara 2) to 6.5 (Intel Nehalem) GBytes/s. We were also able to obtain an inter-socket communication performance of 1.2 and 6.6 GBytes/s for AMD Opteron and Intel Nehalem, respectively.","authors":["Hari Subramoni","Fabrizio Petrini","Virat Agarwal","Davide Pasetto"],"meta":["January 2010IEEE Computer Architecture Letters 9(1):13-16","DOI:10.1109/L-CA.2010.4","SourceDBLP"],"references":["3215236_Petrini_F_The_Quadrics_network_High-performance_clustering_technology_IEEE_Micro_22_46-57","3214750_Myrinet_A_Gigabit-per-Second_Local_Area_Network","2546268_The_Quadrics_Network_QsNet_High-Performance_Clustering_Technology","232628812_Designing_Next_Generation_Clusters_Evaluation_of_InfiniBand_DDRQDR_on_Intel_Computing_Platforms","225654683_An_evaluation_of_Intel's_core_i7_architecture_using_a_comparative_approach","4373945_Lightweight_Kernel-Level_Primitives_for_High-Performance_MPI_Intra-Node_Communication_over_Multi-Core_Systems","3912941_The_Quadrics_network_QsNet_High-performance_clustering_technology","3799361_Myrinet--a_gigabit-per-second_local-area_network"]}