{"id":"220269764_A_data_mining_system_based_on_SQL_queries_and_UDFs_for_relational_databases","abstract":"Most research on data mining has proposed algorithms and optimizations that work on flat files, outside a DBMS, mainly due to the following reasons. It is easier to develop efficient algorithms in a traditional programming language. The integration of data mining algorithms into a DBMS is difficult given its relational model foundation and system architecture. Moreover, SQL may be slow and cumbersome for numerical analysis computations. Therefore, data mining users commonly export data sets outside the DBMS for data mining processing, which creates a performance bottleneck and eliminates important data management capabilities such as query processing and security, among others (e.g. concurrency control and fault tolerance). With that motivation in mind, we developed a novel system based on SQL queries and User-Defined Functions (UDFs) that can directly analyze relational tables to compute statistical models, storing such models as relational tables as well. Most algorithms have been optimized to reduce the number of passes on the data set. Our system can analyze large and high dimensional data sets faster than external data mining tools.","authors":["Carlos Ordonez","Carlos Garcia-Alvarado"],"meta":["October 2011","DOI:10.1145/2063576.2064008","SourceDBLP","Conference: Proceedings of the 20th ACM Conference on Information and Knowledge Management, CIKM 2011, Glasgow, United Kingdom, October 24-28, 2011"],"references":["221654251_Efficient_computation_of_PCA_with_SVD_in_SQL","221615008_Comparing_SQL_and_MapReduce_to_compute_Naive_Bayes_in_a_single_table_scan","220766096_On_the_Computation_of_Stochastic_Search_Variable_Selection_in_Linear_Regression_with_UDFs","242358078_The_Elements_Of_Statistical_Learning","224466478_Bayesian_Classifiers_Programmed_in_SQL","223782408_Fast_UDFs_to_compute_sufficient_statistics_on_large_data_sets_exploiting_caching_and_sampling","221995968_The_Elements_of_Statistical_Learning_Springer-Verlag_New_York","221213534_Database_systems_research_on_data_mining","220073446_Statistical_Model_Computation_with_UDFs","3297516_Integrating_K-means_clustering_with_a_relational_DBMS_using_SQL","2362684_SQLEM_fast_clustering_in_SQL_using_the_EM_algorithm"]}