{"id":"220341656_Heuristic_algorithms_for_scheduling_an_automated_wet-etch_station","abstract":"Wet-etching is a key step in wafer fabrication. A wet-etch station is a chemical batch process involving a complex interplay of mixed intermediate storage (MIS) policies and a shared robot for wafer transfers. Its operation poses a challenging resource-constrained scheduling problem that is crucial for enhancing productivity, improving yield and minimizing contamination. In this paper, we develop three new algorithms for scheduling wafer jobs for a given sequence, which comfortably outperform a literature algorithm in terms of solution quality without requiring excessive effort. Furthermore, we propose a simulated annealing (SA) algorithm for sequencing the wafer jobs. Using this SA algorithm, an existing sequencing algorithm based on tabu search (TS), two job-scheduling algorithms and two algorithms for initial job sequence, we identify eight complete algorithms for scheduling operations in an automated wet-etch station (AWS). After a thorough numerical evaluation, we conclude that the TS sequencing strategy combined with two of our three job-scheduling algorithms is the best option that yields up to 25–30% lower makespans than a literature algorithm, and requires acceptable computing times for industrial-scale problems.","authors":["Swarnendu Bhushan","Iftekhar A Karimi"],"meta":["March 2004Computers & Chemical Engineering 28(3):363-379","DOI:10.1016/S0098-1354(03)00192-3","SourceDBLP"],"references":["220569722_on_a_Scheduling_Problem_in_a_Robotized_Analytical_System","289920374_Application_of_simulated_annealing_in_fuzzy_optimization_problems","257118989_A_Tabu_Search_Approach_to_Scheduling_an_Automated_Wet_Etch_Station","242817148_Preliminary_Design_of_Multiproduct_Non_Continuous_Plants_Using_Simulated_Annealing","242816965_Completion_Time_Algorithms_for_Serial_Multiproduct_Batch_Processes_with_Shared_Storage","231370516_An_MILP_Approach_to_Automated_Wet-Etch_Station_Scheduling","231367485_Evaluation_of_simulated_annealing_for_batch_process_scheduling","231366900_Scheduling_a_Single-Product_Reentrant_Process_with_Uniform_Processing_Times"]}