{"id":"220345624_Survey_propagation_An_algorithm_for_satisfiability","abstract":"We study the satisfiability of randomly generated formulas formed by M clauses of exactly K literals over N Boolean variables. For a given value of N the problem is known to be most difficult when α = M/N is close to the experimental threshold αc separating the region where almost all formulas are SAT from the region where all formulas are UNSAT. Recent results from a statistical physics analysis suggest that the difficulty is related to the existence of a clustering phenomenon of the solutions when α is close to (but smaller than) αc. We introduce a new type of message passing algorithm which allows to find efficiently a satisfying assignment of the variables in this difficult region. This algorithm is iterative and composed of two main parts. The first is a message-passing procedure which generalizes the usual methods like Sum-Product or Belief Propagation: It passes messages that may be thought of as surveys over clusters of the ordinary messages. The second part uses the detailed probabilistic information obtained from the surveys in order to fix variables and simplify the problem. Eventually, the simplified problem that remains is solved by a conventional heuristic. © 2005 Wiley Periodicals, Inc. Random Struct. Alg., 2005","authors":["Alfredo Braunstein","Marc Mezard","Riccardo Zecchina"],"meta":["September 2005Random Structures and Algorithms 27(2):201-226","DOI:10.1002/rsa.20057","SourceDBLP"],"references":["298262813_The_probabilistic_analysis_of_a_greedy_satisfiability_algorithm","264957849_Sharp_thresholds_of_graph_properties_and_the_k-SAT_problem","316517565_Local_search_strategies_for_satisfiability_testing","281657451_Editorial_-_Phase_Transition_in_Combinatorial_Problems","265333396_Gibbs_Measures_and_Phase_TransitionsBerlin_Walter_de_Gruyter","261846136_Rigorous_low_temperature_results_for_the_mean_field_p-spin_interaction_spin_glass_model","248609267_Phase_Transitions_in_Combinatorial_Problems","236157566_Low_Density_Parity_Check_Codes","235488498_Statistical_mechanics_of_the_random_K-SAT_model","235410054_Loiv-Density_Parity-Check_Codes"]}