{"id":"220355462_The_Alignment_Template_Approach_to_Statistical_Machine_Translation","abstract":"A phrase-based statistical machine translation approach — the alignment template approach — is described. This translation approach allows for general many-to-many relations between words. Thereby, the context of words is taken into account in the translation model, and local changes in word order from source to target language can be learned explicitly. The model is described using a log-linear modeling approach, which is a generalization of the often used source-channel approach. Thereby, the model is easier to extend than classical statistical machine translation systems. We describe in detail the process for learning phrasal translations, the feature functions used, and the search algorithm. The evaluation of this approach is performed on three different tasks. For the German-English speech Verbmobil task, we analyze the effect of various sys- tem components. On the French-English Canadian Hansards task, the alignment template system obtains significantly better results than a single-word-based translation model. In the Chinese-English 2002 National Institute of Standards and Technology (NIST) machine transla- tion evaluation it yields statistically significantly better NIST scores than all competing research and commercial translation systems.","authors":["Franz Josef Och","Hermann Ney"],"meta":["December 2004Computational Linguistics 30(4):417-449","DOI:10.1162/0891201042544884","SourceDBLP"],"references":["239051244_An_Evaluation_Tool_for_Machine_Translation_Fast_Evaluation_for_MT_Research","230875890_The_Mathematics_of_Statistical_Machine_Translation_Parameter_Estimation","256406497_The_psychology_of_reactions_to_environmental_agents","245329863_An_evaluation_tool_for_machine_translation_Fast_evaluation_for_machine_translation_research","243777055_Syntax-based_language_models_for_machine_translation","243487631_Verbmobil_Foundations_of_Speech-to-Speech_Translation","240009865_Functional_Evaluation_of_a_Machine_Interpretation_System_Verbmobil","238624214_IBM_Research_Report_Bleu_a_Method_for_Automatic_Evaluation_of_Machine_Translation","234812408_An_efficient_method_for_determining_bilingual_word_classes","222670794_Fast_and_optimal_decoding_for_machine_translation"]}