{"id":"220374965_The_Effect_of_Incorporating_Good_Learners'_Ratings_in_e-Learning_Content-based_Recommender_System","abstract":"One of the anticipated challenges of today's e-learning is to solve the problem of recommending from a large number of learning materials. In this study, we introduce a novel architecture for an e-learning recommender system. More specifically, this paper comprises the following phases i) to propose an e-learning recommender system based on content-based filtering and good learners' ratings, and ii) to compare the proposed e-learning recommender system with exiting e-learning recommender systems that use both collaborative filtering and content-based filtering techniques in terms of system accuracy and student's performance. The results obtained from the test data show that the proposed e-learning recommender system outperforms existing e-learning recommender systems that use collaborative filtering and content-based filtering techniques with respect to system accuracy of about 83.28% and 48.58%, respectively. The results further show that the learner's performance is increased by at least 12.16% when the students use the e-learning with the proposed recommender system as compared to other recommendation techniques. © International Forum of Educational Technology & Society (IFETS).","authors":["Khairil Imran","Nor Aniza Abdullah"],"meta":["April 2011Educational Technology & Society 14(2):248-257","SourceDBLP"],"references":["296706206_Expert_Personalized_E-Learning_Recommender_System","245813772_Creating_cost-effective_adaptive_educational_hypermedia_based_on_markup_technologies_and_e-learning","288467056_Social_Learning_Theory","260048212_MERLOT-Multimedia_Educational_Resource_for_Learning_and_Online_Teaching","255566957_Smart_Recommendation_for_an_Evolving_E-Learning_System_Architecture_and_Experiment","254758380_AH_12_years_later_a_comprehensive_survey_of_adaptive_hypermedia_methods_and_techniques_Extended_abstract","252332862_Trends_in_Peer_Learning","234021315_Social_Learning_Theoy","233810285_Measuring_learner's_performance_in_e-learning_recommender_systems","226219874_Learning_materials_recommendation_using_good_learners'_ratings_and_content-based_filtering"]}