{"id":"220374935_An_empirical_assessment_of_pedagogical_usability_criteria_for_digital_learning_material_with_elementary_school_students","abstract":"This paper presents the pedagogical usability criteria for evaluating the digital learning material. Pedagogical aspects of designing or using digital learning material are much less frequently studied than technical ones. Further, there are relatively few inventories measuring subjective end-user satisfaction with the pedagogical aspects of digital learning material and not a single inventory has undergone a rigorous process of empirical psychometric testing. They include the following components: 1. Learner control, 2. Learner activity, 3. Cooperative/Collaborative learning, 4. Goal orientation, 5. Applicability, 6. Added value, 7. Motivation, 8. Valuation of previous knowledge, 9. Flexibility and 10. Feedback. The pedagogical usability criteria have been operationalized into an on-line Likert -scale self-rating Pedagogically Meaningful Learning Questionnaire (PMLQ) that has 56 items. In the PMLQ, separate items have been developed to measure the usability of the learning management system (LMS) and the learning material (LM). When evaluating the usability of a LMS, it is possible in the pedagogical context to evaluate the kind of learning material it enables the users to produce. Evaluation of the usability of a LM is based on a fact that the learning content is based on a certain learning goal or goals. The criteria of pedagogical usability presented here have undergone two-step psychometric testing process using empirical samples of 5th and 6th grade elementary school students (n = 66 and n = 74). Students evaluated one LMS and four LM's with PMLQ. Results supported the existence of theoretical dimensions of the criteria. The PMLQ was able to capture differences in the pedagogical usability profiles of the learning modules. Generalizability of the pedagogical usability criteria to other domains is limited by the small sample size, the small age range of respondents' and the small number of learning material evaluated. However, empirical studies that aim at evaluating a more representative set of learning material in different domains targeted for both adolescent and adult learners are currently conducted.","authors":["Petri Nokelainen"],"meta":["April 2006Educational Technology & Society 9(2):178-197","SourceDBLP"],"references":["268016512_Theory_and_Practice_of_Case-Based_Learning_Aids","248594191_Development_of_an_Instrument_Measuring_User_Satisfaction_of_the_Human-Computer_Interface","317953561_Mind_in_society_The_development_of_higher_psychological_processes","317953505_Situated_learning_Legitimate_peripheral_participation","314411149_Theory_Supporting_Design_Guidelines_for_Web-Based_Instruction","313153218_Learning_Together_Understanding_the_Processes_of_Computer-Based_Collaborative_Learning","306939383_The_magical_number_seven_plus_or_minus_two_Some_limits_on_our_capacity_to_process_information","292585786_From_constructivism_to_constructionism_Learning_with_hypermediamultimedia_rather_than_from_it","273947524_Interaction_Design_Beyond_Human-Computer_Interaction","252644926_Exploring_the_icebergs_of_adult_learning_Findings_of_the_first_Canadian_survey_of_informal_learning_practices","245911402_Development_of_a_Tool_Measuring_User_Satisfaction_of_the_Human-Computer_Interface","247126281_Peer_Influences_on_Cognitive_Development_Piagetian_and_Vygotskian_Perspectives","246366190_Heuristic_evaluation_of_users_interfaces-Proc","242529653_Evaluating_what_really_matters_in_computer-based_education","241496176_Learning_Together_in_Community_Collaboration_Online"]}