{"id":"220367138_Efficient_Conflict_Detection_in_Graph_Transformation_Systems_by_Essential_Critical_Pairs","abstract":"The well-known notion of critical pairs already allows a static conflict detection, which is important for all kinds of applications and already implemented in AGG. Unfortunately the standard construction is not very ecient. This paper introduces the new concept of essential critical pairs allowing a more ecient conflict detec- tion. This is based on a new conflict characterization, which determines for each conflict occuring between the rules of the system the exact conflict reason. This new notion of conflict reason leads us to an optimization of conflict detection. Ef- ficiency is obtained because the set of essential critical pairs is a proper subset of all critical pairs of the system and therefore the set of representative conflicts to be computed statically diminishes. It is shown that for each conflict in the system, there exists an essential critical pair representing it. Moreover each essential critical pair possesses a unique conflict reason and thus represents each conflict not only in a minimal, but also in a unique way. Main new results presented in this paper are a characterization of conflicts, completeness and uniqueness of essential critical pairs and a local confluence lemma based on essential critical pairs. The theory of essential critical pairs is the basis to develop and implement a more ecient conflict detection algorithm in the near future.","authors":["Leen Lambers","Hartmut Ehrig","Fernando Orejas"],"meta":["April 2008Electronic Notes in Theoretical Computer Science 211:17-26","DOI:10.1016/j.entcs.2008.04.026","SourceDBLP"],"references":["249975776_Fundamental_Theory_for_Typed_Attributed_Graph_Transformation_Long_Version","228528051_Adhesive_High-Level_Replacement_Categories_and_Systems_Long_Version","222709839_Detecting_Structural_Refactoring_Conflicts_Using_Critical_Pair_Analysis","222690731_Overview_of_Formal_Concepts_for_Model_Transformations_Based_on_Typed_Attributed_Graph_Transformation","222301947_Efficient_Detection_of_Conflicts_in_Graph-based_Model_Transformation","319753089_Adhesive_High-Level_Replacement_Categories","313743898_AGG_A_graph_transformation_environment_for_modeling_and_validation_of_software","297313446_Automated_model_transformation_and_its_validation_using_AToM3_and_AGG","221249436_Automated_Model_Transformation_and_Its_Validation_Using_AToM3_and_AGG","221116944_AGG_A_Graph_Transformation_Environment_for_Modeling_and_Validation_of_Software"]}