{"id":"220366587_A_survey_of_search_methodologies_and_automated_system_development_for_examination_timetabling","abstract":"Examination timetabling is one of the most important administrative activities that takes place in all academic institutions. In this paper, we present a critical discussion of the research on exam timetabling which has taken place in the last decade or so. This last ten years has seen a significantly increased level of research attention for this important area. There has been a range of insightful contributions to the scientific literature both in terms of theoretical issues and practical aspects. The main aim of this survey is to highlight the new trends and key research achievements that have been carried out in the last decade. We also aim to outline a range of relevant important research issues and challenges that have been generated by this body of work.\nWe first define the problem and discuss previous survey papers. Within our presentation of the state-of-the-art methodologies, we highlight recent research trends including hybridisations of search methodologies and the development of techniques which are motivated by raising the level of generality at which search methodologies can operate. Summarising tables are presented to provide an overall view of these techniques. We also present and discuss some important issues which have come to light concerning the public benchmark exam timetabling data. Different versions of problem datasets with the same name have been circulating in the scientific community for the last ten years and this has generated a significant amount of confusion. We clarify the situation and present a re-naming of the widely studied datasets to avoid future confusion. We also highlight which research papers have dealt with which dataset. Finally, we draw upon our discussion of the literature to present a (non-exhaustive) range of potential future research directions and open issues in exam timetabling research.","authors":["Rong Qu","Edmund K. Burke","Barry Mccollum","Liam T. G. Merlot"],"meta":["February 2009Journal of Scheduling 12(1):55-89","DOI:10.1007/s10951-008-0077-5","SourceDBLP"],"references":["313502253_Adaptive_decomposition_and_construction_for_examination_timetabling_problems","313105241_Application_of_a_hybrid_multi-objective_evolutionary_algorithm_to_the_uncapacitated_exam_proximity_problem","291835740_Hybridizations_within_a_graph_based_hyper-heuristic_framework_for_university_timetabling_problems","328870170_Bus_and_train_driver_scheduling","313695402_Combining_constraint_programming_and_simulated_annealing_on_university_exam_timetabling","313695161_Ant_algorithms_for_the_exam_timetabling_problem","313039354_A_memetic_approach_for_the_traveling_salesman_problem_implementation_of_a_computational_ecology_for_combinatorial_optimization_on_message-passing_systems","312603086_Constraint_Logic_Programming_for_Examination_Timetabling","306280364_The_Design_of_Memetic_Algorithms_for_Scheduling_and_Timetabling_Problems_in_Recent_Advances_in_Memetic_Algorithms","292004082_Genetic_Algorithms_Modern_Heuristic_Techniques_for_Combinatorial_Problems"]}