{"id":"220365497_Comparing_university_rankings","abstract":"Recently there is increasing interest in university rankings. Annual rankings of world universities are published by QS for\nthe Times Higher Education Supplement, the Shanghai Jiao Tong University, the Higher Education and Accreditation Council of\nTaiwan and rankings based on Web visibility by the Cybermetrics Lab at CSIC. In this paper we compare the rankings using a\nset of similarity measures. For the rankings that are being published for a number of years we also examine longitudinal patterns.\nThe rankings limited to European universities are compared to the ranking of the Centre for Science and Technology Studies \nat Leiden University. The findings show that there are reasonable similarities between the rankings, even though each applies\na different methodology. The biggest differences are between the rankings provided by the QS-Times Higher Education Supplement\nand the Ranking Web of the CSIC Cybermetrics Lab. The highest similarities were observed between the Taiwanese and the Leiden\nrankings from European universities. Overall the similarities are increased when the comparison is limited to the European\nuniversities.","authors":["Isidro F. Aguillo","Judit Bar-Ilan","Mark Levene","Jose Luis Ortega"],"meta":["October 2010Scientometrics 85(1):243-256","DOI:10.1007/s11192-010-0190-z","SourceDBLP"],"references":["263449934_Webometric_Ranking_of_World_Universities_Introduction_Methodology_and_Future_Developments","242915909_Advanced_Bibliometric_Methods_as_Quantitative_Core_of_Peer_Review_Based_Evaluation_and_Foresight_Exercises","312459200_Spearman's_Footrule_as_a_Measure_of_Disarray","292003612_Some_measures_for_comparing_citation_databases","271867831_The_Academic_Ranking_of_World_Universities","247607261_Spearman's_footrule_as_a_measure_of_dissarray","240523710_The_Use_of_University_Rankings_in_the_United_Kingdom","233607399_Examining_Major_Rankings_According_to_the_Berlin_Principles","229545002_Scientific_research_activity_and_communication_measured_with_Cybermetrics_indicators","228939197_1_Academic_Ranking_of_World_Universities_-_Methodologies_and_Problems"]}