{"id":"220413153_Least_Expected_Time_Paths_in_Stochastic_Time-Varying_Transportation_Networks","abstract":"The authors consider stochastic, time-varying transportation networks, where the arc weights (arc travel times) are random variables with probability distribution functions that vary with time. Efficient procedures are widely available for determining least time paths in deterministic networks. In stochastic but time-invariant networks, least expected time paths can be determined by setting each random arc weight to its expected value and solving an equivalent deterministic problem. This paper addresses the problem of determining least expected time paths in stochastic, time-varying networks. Two procedures are presented. The first procedure determines the a priori least expected time paths from all origins to a single destination for each departure time in the peak period. The second procedure determines lower bounds on the expected times of these a priori least expected time paths. This procedure determines an exact solution for the problem where the driver is permitted to react to revealed travel times on traveled links en route, i.e. in a time-adaptive route choice framework. Modifications to each of these procedures for determining least expected cost (where cost is not necessarily travel time) paths and lower bounds on the expected costs of these paths are given. Extensive numerical tests are conducted to illustrate the algorithms` computational performance as well as the properties of the solution.","authors":["Elise Miller-Hooks","Hani S. Mahmassani"],"meta":["May 2000Transportation Science 34:198-215","DOI:10.2172/350896","SourceDBLP"],"references":["303444218_Multiple_criteria_decision_making","284850805_Fastest_paths_in_time-dependent_networks_for_intelligent_vehicle-highway_systems_application","267471649_The_Stochastic_Shortest_Route_Problem","265490509_Application_of_a_Technique_for_Research_and_Development_Program_Evaluation","265374157_On_a_Routing_Problem","263047674_Introduction_to_Stochastic_Dynamic_Programming","245880445_Design_and_Implementation_of_a_Shortest_Path_Algorithm_with_Time_Dependent_Arc_Costs","244442064_Shortest_Paths_in_Probabilistic_Graphs","243777975_Optimum_path_algorithms_on_multidimensional_networks_Analysis","242930628_Critical_Path_Analyses_Via_Chance_Constrained_and_Stochastic_Programming"]}