{"id":"220437004_Social_usage_of_instant_messaging_by_individuals_outside_the_workplace_in_Kuwait_A_structural_equation_model","abstract":"Purpose – The purpose of this paper is to study factors that affect adults' acceptance of instant messaging (IM) for social and entertainment purposes in an Arab country Design/methodology/approach – An expanded version of the Technology Acceptance Model (TAM) was used to test the impact of four factors (subjective norms, perceived ease of use, perceived usefulness, and perceived enjoyment) and a new construct, curiosity about other people, on the level of IM usage by 191 adults in Kuwait. Survey questions from prior studies were adopted and customized, and the model analyzing using Structural Equation Model with LISREL. Findings – IM usage is a different type of technology usage than work-related forms of ICT since it is employed for social and recreational usage. Unlike prior studies that employed TAM in a work-related setting, perceived usefulness was not a significant antecedent of usage; however, perceived enjoyment, social norms, curiosity about other people, and perceived ease of use were all important antecedents of IM usage. Research limitations/implications – This study focused on IM usage outside the workplace for social purposes and was restricted to adults within one country (Kuwait). Additional studies across Arab countries are encouraged as well as comparatives studies about IM usage for different contexts (work-related use of IM from home and IM usage in the workplace). Practical implications – This study is useful for researchers willing to highlight the factors that motivate users' ICT adoption outside the workplace and for social purposes. It also has implications for managers and software vendors seeking to enhance the adoption of communication-oriented forms of ICT in the Arab world Originality/value – The study highlights motives of ICT usage among Arab adults, which has not been widely studied. It also describes Arab culture and shows how certain aspects of culture affect ICT usage.","authors":["Kamel Rouibah"],"meta":["February 2008Information Technology & People 21(1):34-68","DOI:10.1108/09593840810860324","SourceDBLP"],"references":["311644620_Structural_equation_modeling_and_regression_guidelines_for_research_practice","324998215_Social_Construction_of_Communication_Technology","313604424_Evaluating_Structural_Equation_Models_with_Unobservable_Variables_and_Measurement_Error","313558350_Understanding_Information_Technology_Usage_A_Test_of_Competing_Models","312984568_Perceived_usefulness_perceived_ease_and_user_acceptance_of_information_technology","298929263_Predicting_the_use_of_web-based_information_systems_self-efficacy_enjoyment_learning_goal_orientation_and_the_technology_acceptance_model","291899913_Management_in_the_Arab_world","284673910_An_exploratory_investigation_of_consumer_innovativeness_and_interpersonal_influences","284342469_Acceptance_of_technology_with_network_externalities_An_empirical_study_of_internet_instant_messaging_services","283722149_The_Use_of_Computer-Mediated_Communication_in_an_Inter-Organizational_Context"]}