{"id":"220474085_Particle_swarm-based_olfactory_guided_search","abstract":"This article presents a new algorithm for searching odour sources across large search spaces with groups of mobile robots. The proposed algorithm is inspired in the particle swarm optimization (PSO) method. In this method, the search space is sampled by dynamic particles that use their knowledge about the previous sampled space and share this knowledge with other neighbour searching particles allowing the emergence of efficient local searching behaviours. In this case, chemical searching cues about the potential existence of upwind odour sources are exchanged. By default, the agents tend to avoid each other, leading to the emergence of exploration behaviours when no chemical cue exists in the neighbourhood. This behaviour improves the global searching performance.\n\nThe article explains the relevance of searching odour sources with autonomous agents and identifies the main difficulties for solving this problem. A major difficulty is related with the chaotic nature of the odour transport in the atmosphere due to turbulent phenomena. The characteristics of this problem are described in detail and a simulation framework for testing and analysing different odour searching algorithms was constructed. The proposed PSO-based searching algorithm and modified versions of gradient-based searching and biased random walk-based searching strategies were tested in different environmental conditions and the results, showing the effectiveness of the proposed strategy, were analysed and discussed.","authors":["Lino Marques","Urbano J. Nunes","Aníbal T. de Almeida"],"meta":["June 2006Autonomous Robots 20(3):277-287","DOI:10.1007/s10514-006-7567-0","SourceDBLP","Project: RoboNose: Olfaction Based Mobile Robot Navigation (FCT)"],"references":["313749844_Particle_swarm_optimization","294303045_The_state_of_surveillance","279389547_Robot_Motion_Planning","279367981_Robot_Motion_Planning","273453883_Particle_Swarm_Optimization","269780314_Theory_of_Optimal_Search","250525436_ChemInform_Abstract_The_Scientific_Foundation_and_Efficacy_of_the_Use_of_Canines_as_Chemical_Detectors_for_Explosives","247457113_Search_and_Screening_General_Principles_and_Historical_Applications","247161853_Robot_Motion_Planning","242375978_Theory_of_Optimal_Search"]}