{"id":"220473428_Reducing_Transient_and_Steady_State_Electricity_Consumption_in_HVAC_Using_Learning-Based_Model-Predictive_Control","abstract":"Heating, ventilation, and air conditioning (HVAC) systems are an important target for efficiency improvements through new equipment and retrofitting because of their large energy footprint. One type of equipment that is common in homes and some offices is an electrical, single-stage heat pump air conditioner (AC). To study this setup, we have built the Berkeley Retrofitted and Inexpensive HVAC Testbed for Energy Efficiency (BRITE) platform. This platform allows us to actuate an AC unit that controls the room temperature of a computer laboratory on the Berkeley campus that is actively used by students, while sensors record room temperature and AC energy consumption. We build a mathematical model of the temperature dynamics of the room, and combining this model with statistical methods allows us to compute the heating load due to occupants and equipment using only a single temperature sensor. Next, we implement a control strategy that uses learning-based model-predictive control (MPC) to learn and compensate for the amount of heating due to occupancy as it varies throughout the day and year. Experiments on BRITE show that our techniques result in a 30%–70% reduction in energy consumption as compared to two-position control, while still maintaining a comfortable room temperature. The energy savings are due to our control scheme compensating for varying occupancy, while considering the transient and steady state electrical consumption of the AC. Our techniques can likely be generalized to other HVAC systems while still maintaining these energy saving features.","authors":["Anil Aswani","Neal Master","Jay Taneja","David E. Culler"],"meta":["January 2012Proceedings of the IEEE 100(1):240-253","DOI:10.1109/JPROC.2011.2161242","SourceDBLP"],"references":["316666530_Constrained_Optimal_Control_of_Linear_and_Hybrid_Systems","313567678_A_distributed_predictive_control_approach_to_building_temperature_regulation","299031284_Re_High-performance_buildings","268397949_TRNSYS_-_FEATURES_AND_FUNCTIONALITITY_FOR_BUILDING_SIMULATION_2009_CONFERENCE","267488512_Low-Frequency_Pulse_Width_Modulation_Design_for_HVAC_Compressors","264995198_Linear_and_Nonlinear_Iterative_Learning_Control","251721828_An_information-centric_energy_infrastructure_The_Berkeley_view","245991192_Efficient_and_Adaptive_Estimation_in_Non-and_Semiparametric_Models","244358772_Robust_tube-based_MPC_for_tracking_of_constrained_linear_systems_with_additive_disturbances","243787176_Constrained_Optimal_Control_of_Linear_and_Hybrid_Systems"]}