{"id":"220423686_The_Status_of_the_P_versus_NP_problem","abstract":"The methods to handle NP-complete problems and the theory that has developed from those approaches are discussed. The collection of problems that have efficiently verifiable solutions is known as NP (non-deterministic polynomial time). So P=NP means that for every problem that has an efficiently verifiable solution, a solution can be found. An efficient algorithm can be found for the very hardest NP problems. Most computer scientists came to believe P≠NP and are trying to prove it quickly became the single most important question in computer science. To understand the importance of the P versus NP problem, it is supposed that P=NP. Since all the NP-complete optimization problems become easy, everything will be much more efficient. Transportation of all forms will be scheduled optimally to move people and goods around quicker and cheaper. One could find short, fully logical proofs for theorems which are extremely long. Leonid Levin developed a theory of efficient algorithms over a specific distribution and formulated a distributional version of the P versus NP problem.","authors":["Lance Fortnow"],"meta":["September 2009Communications of the ACM 52(9):78-86","DOI:10.1145/1562164.1562186","SourceDBLP"],"references":["304405348_On_computable_numbers_with_an_application_to_the_Entscheidungsproblem","285323814_On_the_solution_of_traveling_salesman_problems_documenta_mathematica_journal_der_deutschen_mathematiker-vereinigung_vol_Extra_Volume_ICM_III","284039089_Reducibility_among_combinatorial_problems","283559921_Paths_trees_flowers","280821144_Polynomial-Time_Algorithms_for_Prime_Factorization_and_Discrete_Logarithms_on_a_Quantum_Computer","265502171_Fundamentals_of_Parameterized_Complexity","257650158_Parameterized_Complexity","247921728_The_Ising_model_is_NP-complete","244439781_Reducibility_among_Combinatorial_Problems_In_Complexity_of_Computer_Compu-tations","243787733_Uber_eine_Eigenschaft_des_Inbegri_es_aller_reellen_algebraischen_Zahlen"]}