{"id":"220433788_The_Relationship_between_Recall_and_Precision","abstract":"Empirical studies of retrieval performance have shown a tendency for Precision to decline as Recall increases. This article examines the nature of the relationship between Precision and Recall. The relationships between Recall and the number of documents retrieved, between Precision and the number of documents retrieved, and between Precision and Recall are described in the context of different assumptions about retrieval performance. It is demonstrated that a tradeoff between Recall and Precision is unavoidable whenever retrieval performance is consistently better than retrieval at random. More generally, for the Precision–Recall trade-off to be avoided as the total number of documents retrieved increases, retrieval performance must be equal to or better than overall retrieval performance up to that point. Examination of the mathematical relationship between Precision and Recall shows that a quadratic Recall curve can resemble empirical Recall–Precision behavior if transformed into a tangent parabola. With very large databases and/or systems with limited retrieval capabilities there can be advantages to retrieval in two stages: Initial retrieval emphasizing high Recall, followed by more detailed searching of the initially retrieved set, can be used to improve both Recall and Precision simultaneously. Even so, a tradeoff between Precision and Recall remains. © 1994 John Wiley & Sons, Inc.","authors":["Michael K. Buckland","Fredric C. Gey"],"meta":["January 1994Journal of the American Society for Information Science 45(1):12-19","DOI:10.1002/(SICI)1097-4571(199401)45:1<12::AID-ASI2>3.0.CO;2-L","SourceDBLP"],"references":["242467781_Characterization_of_Two_New_Experimental_Collections_in_Computer_and_Information_Science_Containing_Textual_and_Bibliographic_Concepts","238994674_Information_retrieval_systems_characteristics","238750395_On_the_Inverse_Relationship_of_Recall_and_Precision","237873813_Two_kinds_of_power_An_essay_on_bibliographic_control","235305088_The_Anomalous_Behavior_of_Precision_in_the_Swets_Model_and_Its_Resolution","230182547_Explicit_and_Implicit_Variables_in_Information_Retrieval_IR_Systems","223117716_Buckley_C_Term-Weighting_Approaches_in_Automatic_Text_Retrieval_Information_Processing_Management_245_513-523","220433942_Recall-Precision_trade-off_A_derivation","220230377_Evaluation_Issues_in_Information_Retrieval","220228998_Term-Weighting_Approaches_in_Automatic_Text_Retrieval","36992276_Information_retrieval_systems_characteristics_testing_and_evaluation"]}