{"id":"220432409_Speed_scaling_to_manage_energy_and_temperature","abstract":"Speed scaling is a power management technique that involves dynamically changing the speed of a processor. We study policies for setting the speed of the processor for both of the goals of minimizing the energy used and the maximum temperature attained. The theoretical study of speed scaling policies to manage energy was initiated in a seminal paper by Yao et al. [1995], and we adopt their setting. We assume that the power required to run at speed s is P ( s ) = s α for some constant α > 1. We assume a collection of tasks, each with a release time, a deadline, and an arbitrary amount of work that must be done between the release time and the deadline. Yao et al. [1995] gave an offline greedy algorithm YDS to compute the minimum energy schedule. They further proposed two online algorithms Average Rate (AVR) and Optimal Available (OA), and showed that AVR is 2 α − 1 α α -competitive with respect to energy. We provide a tight α α bound on the competitive ratio of OA with respect to energy.\nWe initiate the study of speed scaling to manage temperature. We assume that the environment has a fixed ambient temperature and that the device cools according to Newton's law of cooling. We observe that the maximum temperature can be approximated within a factor of two by the maximum energy used over any interval of length 1/ b , where b is the cooling parameter of the device. We define a speed scaling policy to be cooling-oblivious if it is simultaneously constant-competitive with respect to temperature for all cooling parameters. We then observe that cooling-oblivious algorithms are also constant-competitive with respect to energy, maximum speed and maximum power. We show that YDS is a cooling-oblivious algorithm. In contrast, we show that the online algorithms OA and AVR are not cooling-oblivious. We then propose a new online algorithm that we call BKP. We show that BKP is cooling-oblivious. We further show that BKP is e -competitive with respect to the maximum speed, and that no deterministic online algorithm can have a better competitive ratio. BKP also has a lower competitive ratio for energy than OA for α ≥5.\nFinally, we show that the optimal temperature schedule can be computed offline in polynomial-time using the Ellipsoid algorithm.","authors":["Nikhil Bansal","Tracy Kimbrel","Kirk Pruhs"],"meta":["March 2007Journal of the ACM 54(1)","DOI:10.1145/1206035.1206038","SourceDBLP"],"references":["227254817_Min-energy_voltage_allocation_for_tree-structured_tasks","4027223_Optimal_voltage_allocation_techniques_for_dynamically_variable_voltage_processors","3215168_Power-Aware_Microarchitecture_Design_and_Modeling_Challenges_for_Next-Generation_Microprocessors","2857172_Temperature-Aware_Microarchitecture","265271826_Introductory_Lectures_on_Convex_Programming_Volume_I_Basic_course","247442902_Introduction_To_Algorithms","245274646_An_Additional_Proof_of_a_Maximal_Theorem_of_Hardy_and_Littlewood","238680363_Hard_Real-Time_Computing_Systems","229058134_Convex_Optimization","225759102_A_maximal_theorem_with_function-theoretic_applications","220555937_Algorithmic_problems_in_power_management_SIGACT_News_362_63-76","220390426_Algorithms_for_power_savings","220094164_On_Energy-Optimal_Voltage_Scheduling_for_Fixed-Priority_Hard_Real-Time_Systems","4109401_Dynamic_speed_scaling_to_manage_energy_and_temperature","3635304_A_scheduling_model_for_reduced_CPU_energy","2955422_Mudge_T_Power_A_first-class_architectural_design_constraint_Computer_344_52-58","2431620_Reducing_Power_in_High-performance_Microprocessors"]}