{"id":"220412912_An_Intelligent_Information_Retrieval_Approach_Based_on_Two_Degrees_of_Uncertainty_Fuzzy_Ontology","abstract":"In spite of the voluminous studies in the field of intelligent retrieval systems, effective retrieving of information has been remained an important unsolved problem. Implementations of different conceptual knowledge in the information retrieval process such as ontology have been considered as a solution to enhance the quality of results. Furthermore, the conceptual formalism supported by typical ontology may not be sufficient to represent uncertainty information due to the lack of clear-cut boundaries between concepts of the domains. To tackle this type of problems, one possible solution is to insert fuzzy logic into ontology construction process. In this article, a novel approach for fuzzy ontology generation with two uncertainty degrees is proposed. Hence, by implementing linguistic variables, uncertainty level in domain's concepts (Software Maintenance Engineering (SME) domain) has been modeled, and ontology relations have been modeled by fuzzy theory consequently. Then, we combined these uncertain models and proposed a new ontology with two degrees of uncertainty both in concept expression and relation expression. The generated fuzzy ontology was implemented for expansion of initial user's queries in SME domain. Experimental results showed that the proposed model has better overall retrieval performance comparing to keyword-based or crisp ontology-based retrieval systems.","authors":["Maryam Hourali","Gholam Ali Montazer"],"meta":["October 2011Advances in Fuzzy Systems 2011(1)","DOI:10.1155/2011/683976","SourceDBLP"],"references":["301287722_Fuzzy_Information_Retrieval_Model_Based_on_Multiple_Related_Ontologies","242787152_A_Type2_Fuzzy_Ontology_and_Its_Application_to_Personal_Diabetic-Diet_Recommendation","228609294_Organizing_the_knowledge_used_in_software_maintenance","225135218_Ontology-Based_Spatial_Query_Expansion_in_Information_Retrieval","290227438_Ontology-based_query_division_and_reformulation_for_heterogeneous_information_integration","284420410_Institution_mapping_of_power_industry_as_an_example","284379028_Evaluation_of_procedures_and_methods_of_university_researches_commercialization_The_case_of_Tabriz_University","284319128_Measuring_Commercial_Potential_of_Technology_with_fuzzy_Logic","276935841_Introduction_to_Information_Retrieval","251734697_Fuzzy_Rough_Set_Based_Web_Query_Expansion"]}