{"id":"220437995_Communication_and_Trust_in_Global_Virtual_Teams","abstract":"This paper explores the challenges of creating and maintaining trust in a global virtual team whose members transcend time, space, and culture. The challenges are highlighted by integrating recent literature on work teams, computer-mediated communication groups, cross-cultural communication, and interpersonal and organizational trust. To explore these challenges empirically, we report on a series of descriptive case studies on global virtual teams whose members were separated by location and culture, were challenged by a common collaborative project, and for whom the only economically and practically viable communication medium was asynchronous and synchronous computer-mediated communication. The results suggest that global virtual teams may experience a form of \"swift\" trust, but such trust appears to be very fragile and temporal. The study raises a number of issues to be explored and debated by future research. Pragmatically, the study describes communication behaviors that might facilitate trust in global virtual teams.","authors":["Sirkka L. Jarvenpaa","Dorothy E. Leidner"],"meta":["June 1998Journal of Computer-Mediated Communication 3(6)","DOI:10.1111/j.1083-6101.1998.tb00080.x","SourceDBLP"],"references":["301840604_Neither_Market_Nor_Hierarchy_Network_Forms_of_Organization","325001415_Time_and_Transition_in_Work_Teams_Toward_a_New_Model_of_Group_Development","324998215_Social_Construction_of_Communication_Technology","312985464_Building_theories_from_case_study_research","312672990_'Flaming'_in_computer-mediated_communication_Observations_explanations_implications","308553897_Developing_and_Maintaining_Trust_in_Work_Relationships","303564277_Can_we_trust_trust","301536851_Empowerment_in_veterinary_clinics_The_role_of_trust_in_delegation","292779964_Familiarity_confidence_trust_Problems_and_alternatives","292225568_Trust_in_organisations_a_conceptual_framework_linking_organisational_forms_managerial_philosophies_and_the_opportunity_costs_of_controls"]}