{"id":"220538811_Querying_and_mining_of_time_series_data_Experimental_comparison_of_representations_and_distance_measures","abstract":"The last decade has witnessed a tremendous growths of in- terests in applications that deal with querying and min- ing of time series data. Numerous representation methods for dimensionality reduction and similarity measures geared towards time series have been introduced. Each individ- ual work introducing a particular method has made spe- cific claims and, aside from the occasional theoretical justi- fications, provided quantitative experimental observations. However, for the most part, the comparative aspects of these experiments were too narrowly focused on demonstrating the benefits of the proposed methods over some of the previ- ously introduced ones. In order to provide a comprehensive validation, we conducted an extensive set of time series ex- periments re-implementing 8 different representation meth- ods and 9 similarity measures and their variants, and testing their effectiveness on 38 time series data sets from a wide variety of application domains. In this paper, we give an overview of these different techniques and present our com- parative experimental findings regarding their effectiveness. Our experiments have provided both a unified validation of some of the existing achievements, and in some cases, sug- gested that certain claims in the literature may be unduly optimistic.","authors":["Hui Ding","Goce Trajcevski","Peter Scheuermann","Xiaoyue Wang"],"meta":["August 2008","SourceDBLP"],"references":["262566867_A_Study_of_Cross-Validation_and_Bootstrap_for_Accuracy_Estimation_and_Model_Selection","243785467_Fast_Time_Sequence_Indexing_for_Arbitrary_Lp_Norms","225230134_Exact_indexing_of_dynamic_time_warping","308263678_Dimensionality_reduction_for_fast_similarity_search_in_large_time_series_databases","290824136_Pattern_extraction_for_time_series_classification","266135247_Automated_Motion_Editing","262958223_On_Comparing_Classifiers_Pitfalls_to_Avoid_and_a_Recommended_Approach","248848344_Pattern_Classification_and_Scene_Analysis","244456447_Contributions_to_Decision_Tree_Induction_BiasVariance_Tradeoff_and_Time_Series_Classification","233882454_Introduction_to_Data_Mining"]}