{"id":"220538523_AgreementMaker_Efficient_Matching_for_Large_Real-World_Schemas_and_Ontologies","abstract":"We present the AgreementMaker system for matching real- world schemas and ontologies, which may consist of hun- dreds or even thousands of concepts. The end users of the system are sophisticated domain experts whose needs have driven the design and implementation of the system: they require a responsive, powerful, and extensible framework to perform, evaluate, and compare matching methods. The system comprises a wide range of matching methods ad- dressing dierent levels of granularity of the components be- ing matched (conceptual vs. structural), the amount of user intervention that they require (manual vs. automatic), their usage (stand-alone vs. composed), and the types of compo- nents to consider (schema only or schema and instances). Performance measurements (recall, precision, and runtime) are supported by the system, along with the weighted com- bination of the results provided by those methods. The AgreementMaker has been used and tested in practical appli- cations and in the Ontology Alignment Evaluation Initiative (OAEI) competition. We report here on some of its most advanced features, including its extensible architecture that facilitates the integration and performance tuning of a va- riety of matching methods, its capability to evaluate, com- pare, and combine matching results, and its user interface with a control panel that drives all the matching methods and evaluation strategies.","authors":["Isabel F. Cruz","Flavio Palandri Antonelli","Cosmin Stroe"],"meta":["August 2009Proceedings of the VLDB Endowment 2(2):1586-1589","DOI:10.14778/1687553.1687598","SourceDBLP"],"references":["221467082_Results_of_the_Ontology_Alignment_Evaluation_Initiative_2007","221213552_Clio_A_Semi-Automatic_Tool_For_Schema_Mapping","221212846_Schema_and_ontology_matching_with_COMA","220916873_FalconAO_Aligning_Ontologies_with_Falcon","220473763_A_Survey_of_Approaches_to_Automatic_Schema_Matching","30530729_A_Survey_of_Schema-Based_Matching_Approaches","3943325_Similarity_flooding_A_versatile_graph_matching_algorithm_and_its_application_to_schema_matching","227803777_An_Algorithm_to_Solve_the_m_n_Assignment_Problem_in_Expected_Time_Omnlogn","222679585_Using_Bayesian_decision_for_ontology_mapping","222576715_A_visual_tool_for_ontology_alignment_to_enable_geospatial_interoperability","221589599_Handling_semantic_heterogeneities_using_declarative_agreements","221466272_Using_the_AgreementMaker_to_Align_Ontologies_for_the_OAEI_Campaign_2007","221466044_Evaluating_the_Structural_Quality_of_Semantic_Hierarchy_Alignments","220605916_Structural_Alignment_Methods_with_Applications_to_Geospatial_Ontologies"]}