{"id":"220580526_A_Foundation_for_the_Study_of_IT_Effects_A_New_Look_at_DeSanctis_and_Poole's_Concepts_of_Structural_Features_and_Spirit","abstract":"Gerardine DeSanctis and Marshall Scott Poole made an important contribution to the study of IT uses and effects with their insightful concepts of “structural features” and “spirit.” Unlike their concept of “appropriation,” which has found broad acceptance in the IS community, the concepts of structural features and spirit have not been widely used. Published concerns that the concepts are not consistent with basic assumptions in Giddens’ structuration theory, on which the concepts were based, could account for their neglect. However, concepts like structural features and spirit are indispensable for any program of research that attempts to show how IT artifacts can, together with other influences, contribute to the consequences of IT use. Addressing the criticisms that have been leveled against these concepts is, therefore, important. In this paper we unpack DeSanctis and Poole’s concepts and propose redefining them as three new concepts: technical objects, functional affordances, and symbolic expressions. We believe this reconceptualization addresses several concerns about the original concepts, while retaining the core insights of DeSanctis and Poole’s innovative analysis.","authors":["M. L Markus","Mark S Silver"],"meta":["October 2008Journal of the Association for Information Systems 9(10)","DOI:10.17705/1jais.00176","SourceDBLP"],"references":["315360638_WHAT_IS_THE_DIFFERENCE_BETWEEN_ORGANIZATIONAL_CULTURE_AND_ORGANIZATIONAL_CLIMATE_A_NATIVE'S_POINT_OF_VIEW_ON_A_DECADE_OF_PARADIGM_WARS","313602041_Structuration_theory_in_information_systems_research_Methods_and_controversies","307534272_The_theory_of_affordances","305389454_Institutional_Ecology_'Translations'_and_Boundary_Objects_Amateurs_and_Professionals_in_Berkeley's_Museum_of_Vertebrate_Zoology","299057826_A_Comprehensive_Conceptualization_of_Post-Adoption_Behaviors_Associated_with_Information_Technology_Enabled_Work_Systems","288947775_Research_commentry_Desperately_seeking_the_IT_in_IT_research_-_A_call_to_theorizing_the_IT_artifact","276001538_A_Realist_Theory_of_Science","275443421_Computers_and_the_Transformation_of_Social_Analysis","274505282_The_Machine_at_Work_Technology_Work_and_Organisation","272746013_Re-Assembling_the_Social_An_Introduction_to_Actor_Network_Theory"]}