{"id":"220506103_On_Visual_Similarity_Based_3D_Model_Retrieval","abstract":"A large number of 3D models are created and available on the Web, since more and more 3D modelling anddigitizing tools are developed for ever increasing applications. The techniques for content-based 3D model retrievalthen become necessary. In this paper, a visual similarity-based 3D model retrieval system is proposed.This approach measures the similarity among 3D models by visual similarity, and the main idea is that if two 3Dmodels are similar, they also look similar from all viewing angles. Therefore, one hundred orthogonal projectionsof an object, excluding symmetry, are encoded both by Zernike moments and Fourier descriptors as features forlater retrieval. The visual similarity-based approach is robust against similarity transformation, noise, model degeneracyetc., and provides 42%, 94% and 25% better performance (precision-recall evaluation diagram) thanthree other competing approaches: (1) the spherical harmonics approach developed by Funkhouser et al., (2) theMPEG-7 Shape 3D descriptors, and (3) the MPEG-7 Multiple View Descriptor. The proposed system is on the Webfor practical trial use (http://3d.csie.ntu.edu.tw), and the database contains more than 10,000 publicly available3D models collected from WWW pages. Furthermore, a user friendly interface is provided to retrieve 3D modelsby drawing 2D shapes. The retrieval is fast enough on a server with Pentium IV 2.4 GHz CPU, and it takes about2 seconds and 0.1 seconds for querying directly by a 3D model and by hand drawn 2D shapes, respectively.\nCategories and Subject Descriptors (according to ACM CCS): H.3.1 [Information Storage and Retrieval]: Indexing Methods","authors":["Ding-Yun Chen","Xiao-Pei Tian","Yu-Te Shen","Ming Ouhyoung"],"meta":["September 2003Computer Graphics Forum 22(3):223-232","DOI:10.1111/1467-8659.00669","SourceDBLP"],"references":["279826281_Extended_Gaussian_Images","312618019_Plenoptic_modeling_An_image-based_rendering_system","288103365_Combining_features_for_content-based_sketch_retrieval_-_A_comparative_evaluation_of_retrieval_performance","279384963_Principal_Component_Analysis_and_Factor_Analysis","258917097_Algorithm_for_Graphics_and_Image_Processing","242399947_An_efficient_three-dimensional_aircraft_recognition_algorithm_using_normalized_fourier_descriptors","239569823_Content_Based_Retrieval_of_VRML_Objects_-_An_Iterative_and_Interactive_Approach","233530439_Pincipal_Component_Analysis","228890045_An_Integrated_Approach_to_Shape_Based_Image_Retrieval","224483322_Aircraft_Identification_by_Moment_Invariants"]}