{"id":"220564713_Why_there_is_no_such_discipline_as_hypercomputation","abstract":"The editors have kindly invited me to write an introduction to this special issue devoted to ''hypercompu- tation'' despite their perfect awareness of my belief that there is no such subject. In (5), I rather thoroughly debunked the claims of two of the leading proponents of this supposed branch of learning. In this brief intro- duction I will content myself with some general remarks. The analysis of algorithmic process that emerged from the work of Godel, Church, Turing, and Post has been of great importance not only for theoretical investigations but also for practice, by providing an expan- sive framework for computer science. The discussion of computation-like processes that transcend the limits imposed by the Church-Turing thesis can likewise be framed either in terms of theory or of practice. However, although the term ''hypercomputation'' is quite recent, the theoretical side has been flourishing for over half a century, and for the most part without the benefit of those contributing to this issue. As for suggestions in the realm of practice, they boil down to exhortation (''The search is on'') and to the trivial insight: if a physical process exists that generates a definite non-Turing computable function or real number, then such a process could be used to compute the non-Turing computable (2). And even this triviality is questionable, as will be explained, because all that we experience is finite. 1. Hypercomputation as practice","authors":["Martin Davis"],"meta":["July 2006Applied Mathematics and Computation 178(1):4-7","DOI:10.1016/j.amc.2005.09.066","SourceDBLP"],"references":["248049934_The_Universal_Computer_The_Road_from_Leibniz_to_Turing","243784599_The_Myth_of_Hypercomputation","242104266_On_the_existence_of_a_new_family_of_Diophantine_equations_for_Omega","227162426_Quantum_Algorithm_for_Hilbert's_Tenth_Problem","2191345_Quantum_adiabatic_algorithm_for_Hilbert's_tenth_problem_I_The_algorithm","314446032_Engines_of_Logic_Mathematicians_and_the_Origin_of_the_Computer","259716510_On_the_existence_of_a_new_family_of_Diophantine_equations_for_O","245238327_Alan_Turing's_Forgotten_Ideas_in_Computer_Science","242107309_Engines_of_logic_Mathematicians_and_the_origin_of_the_computer","2190169_Numerical_simulations_of_a_quantum_algorithm_for_Hilbert's_tenth_problem"]}