{"id":"220593590_Proposed_NIST_Standard_for_Role_Based_Access_Control","abstract":"this article we propose a standard for role-based access control (RBAC). Although RBAC models have received broad support as a generalized approach to access control, and are well recognized for their many advantages in performing large-scale authorization management, no single authoritative definition of RBAC exists today. This lack of a widely accepted model results in uncertainty and confusion about RBAC's utility and meaning. The standard proposed here seeks to resolve this situation by unifying ideas from a base of frequently referenced RBAC models, commercial products, and research prototypes. It is intended to serve as a foundation for product development, evaluation, and procurement specification. Although RBAC continues to evolve as users, researchers, and vendors gain experience with its application, we feel the features and components proposed in this standard represent a fundamental and stable set of mechanisms that may be enhanced by developers in further meeting the needs of their customers. As such, this document does not attempt to standardize RBAC features beyond those that have achieved acceptance in the commercial marketplace and research community, but instead focuses on defining a fundamental and stable set of RBAC components. This standard is organized into the RBAC Reference Model and the RBAC System and Administrative Functional Specification. The reference model defines the scope of features that comprise the standard and provides a consistent vocabulary in support of the specification. The RBAC System and Administrative Functional Specification defines functional requirements for administrative operations and queries for the creation, maintenance, and review of RBAC sets and relations, as well as for specifying system level functionality in sup...","authors":["David Ferraiolo","Ravi Sandhu","Serban I. Gavrila","D. Richard Kuhn"],"meta":["August 2001ACM Transactions on Information and System Security 4(3):224-274","DOI:10.1145/501978.501980","SourceDBLP"],"references":["242361226_The_graph_model_and_conflicts_of_interest","238743515_Role-based_access_control_features_and_motivations","313193607_Role_based_access_control_models","302558395_TRBAC_A_temporal_role-based_access_control_model","251449285_Role-Based_Access_Control","247462610_Secure_computer_system_unified_exposition_and_MULTICS","240484248_Lattice_-_based_access_control","238982322_Final_report_nist_small_business_innovative_research_sbir_grant_role_based_access_control_phase_2","238741255_An_examination_of_federal_and_commercial_access_control_policy_needs","238672205_Secure_Computer_Systems_Unified_Exposition_and_Multics_Interpretation","220855076_NIST_model_for_role-based_access_control_Towards_a_unified_standard","221495525_Requirements_Capabilities_and_Functionalities_of_User-Role_Based_Security_for_an_Object-Oriented_Design_Model","221495481_Role-Based_Application_Design_and_Enforcement","220855084_RBAC_in_UNIX_administration","220855079_Rebuttal_to_the_NIST_RBAC_model_proposal"]}