{"id":"220543169_Reasoning_About_the_Transfer_of_Control","abstract":"We present DCL-PC: a logic for reasoning about how the abilities of agents and coalitions of agents are altered by transferring control from one agent to another. The logical foundation of DCL-PC is CL-PC, a logic for reasoning about cooperation in which the abilities of agents and coalitions of agents stem from a distribution of atomic Boolean variables to individual agents - the choices available to a coalition correspond to assignments to the variables the coalition controls. The basic modal constructs of CL-PC are of the form 'coalition C can cooperate to bring about ''. DCL-PC extends CL-PC with dynamic logic modalities in which atomic programs are of the form 'agent i gives control of variable p to agent j'; as usual in dynamic logic, these atomic programs may be combined using sequence, iteration, choice, and test operators to form complex programs. By combining such dynamic transfer programs with cooperation modalities, it becomes possible to reason about how the power of agents and coalitions is affected by the transfer of control. We give two alternative semantics for the logic: a 'direct' semantics, in which we capture the distributions of Boolean variables to agents; and a more conventional Kripke semantics. We prove that these semantics are equivalent, and then present an axiomatization for the logic. We investigate the computational complexity of model checking and satisfiability for DCL-PC, and show that both problems are PSPACE-complete (and hence no worse than the underlying logic CL-PC). Finally, we investigate the characterisation of control in DCL-PC. We distinguish between first-order control - the ability of an agent or coalition to control some state of affairs through the assignment of values to the variables under the control of the agent or coalition - and second-order control - the ability of an agent to exert control over the control that other agents have by transferring variables to other agents. We give a logical characterisation of second-order control.","authors":["Wiebe van der Hoek","Dirk Walther","Michael Wooldridge"],"meta":["January 2010Journal of Artificial Intelligence Research 37:437-477","DOI:10.1613/jair.2901","SourceDBLP"],"references":["276940172_Delegation_logic","226540414_Everything_Else_Being_Equal_A_Modal_Logic_for_Ceteris_Paribus_Preferences","226204531_Comparing_Semantics_of_Logics_for_Multi-Agent_Systems","221457057_Knowledge_and_social_laws","221456188_Logics_of_propositional_control","246220748_Formalizing_Admissibility_Criteria_in_Coalition_Formation_among_Goal-directed_Agents","242640524_Modal_Logic_An_Introduction","225181737_Time_Knowledge_and_Cooperation_Alternating-Time_Temporal_Epistemic_Logic_and_Its_Applications","222675562_On_the_logic_of_cooperation_and_propositional_control","222216339_Relationships_between_nondeterministic_and_deterministic_tape_complexities"]}