{"id":"220611570_Scale_and_the_differential_structure_of_images","abstract":"Why and how one should study a scale-space is prescribed by the universal physical law of scale invariance, expressed by the so-called Pi-theorem. The fact that any image is a physical observable with an inner and outer scale bound, necessarily gives rise to a 'scale-space representation', in wphich a given image is represented by a one-dimensiond family of images representing that image on vurious levels of inner spatial scale. An early vision system is completely ignorant of the geometry of its input. Its primary task is to establish this geometry at any available scale. The absence of geometrical knowledge poses additional constraints on the construction of a scale-space, notably linearity, spatial shift invariance and isotropy, thereby defining a complete hierarchical family of scaled pariial differential operators: the Gaussian kernel (the lowest order, rescaling operator) and its linear partirzl derivatives. They enable local image analysis through the detection of local differential structure in a robust wuy, while at the same time capturing global features through the extra scale degree of freedom. In this paper we show why the","authors":["Luc Florack","Bart ter Haar Romeny","Jan Koenderink","Max A. Viergever"],"meta":["July 1992Image and Vision Computing 10(6):376-388","DOI:10.1016/0262-8856(92)90024-W","SourceDBLP"],"references":["243659463_The_Gaussian_derivative_model_for_machine_vision_visual_cortex_simulation","243624623_Simulation_of_human_retinal_function_with_the_Gaussian_derivative_model","321516068_Group-Theoretical_Methods_in_Image_Understanding","313061242_A_theory_for_multiresolution_signal_decomposition_The_wavelet_representation","286632024_Scale_space_filtering","285058764_Receptive_fields_binocular_interaction_and_functional_architecture_in_the_cat's_visual_cortex","275046425_Scale-Space_Filtering","248540894_A_Theory_of_Multiresolution_Signal_Decomposition_The_Wavelet_Representation","239723260_Spatial_Derivatives_and_the_Propagation_of_Noise_in_Gaussian_Scale_Space","230675399_Tensor_Calculus"]}