{"id":"220636751_Three_Paradigms_of_Computer_Science","abstract":"We examine the philosophical disputes among computer scientists concerning methodological, ontological, and epistemological questions: Is computer science a branch of mathematics, an engineering discipline, or a natural science? Should knowledge about the behaviour of programs proceed deductively or empirically? Are computer programs on a par with mathematical objects, with mere data, or with mental processes? We conclude that distinct positions taken in regard to these questions emanate from distinct sets of received beliefs or paradigms within the discipline:\n\nThe rationalist paradigm, which was common among theoretical computer scientists, defines computer science as a branch of mathematics, treats programs on a par with mathematical objects, and seeks certain, a priori knowledge about their ‘correctness’ by means of deductive reasoning.\n\nThe technocratic paradigm, promulgated mainly by software engineers and has come to dominate much of the discipline, defines computer science as an engineering discipline, treats programs as mere data, and seeks probable, a posteriori knowledge about their reliability empirically using testing suites.\n\nThe scientific paradigm, prevalent in the branches of artificial intelligence, defines computer science as a natural (empirical) science, takes programs to be entities on a par with mental processes, and seeks a priori and a posteriori knowledge about them by combining formal deduction and scientific experimentation.\n\nWe demonstrate evidence corroborating the tenets of the scientific paradigm, in particular the claim that program-processes are on a par with mental processes. We conclude with a discussion in the influence that the technocratic paradigm has been having over computer science.","authors":["Amnon H. Eden"],"meta":["August 2007Minds and Machines 17(2):135-167","DOI:10.1007/s11023-007-9060-8","SourceDBLP"],"references":["324459442_Computer_Science_and_its_Relation_to_Mathematics","319395207_Denotational_Semantics_The_Scott-Strachey_Approach_to_Programming_Language_Theory","318494451_Computing_Machinery_and_Intelligence","314741370_The_Ontological_Basis_of_Strong_Artificial_Life","313550915_An_Axiomatic_Basis_of_Computer_Programming","313069970_Foundation_for_the_study_of_software_architecture","304405348_On_computable_numbers_with_an_application_to_the_Entscheidungsproblem","303472440_Program_Verification","303148057_Computer_Science_and_Philosophy","285699485_Software's_chronic_crisis"]}