{"id":"220618257_Node-Deletion_Problems_on_Bipartite_Graphs","abstract":"A set of problems which has attracted considerable interest recently is the set of node-deletion problems. The general node-deletion problem can be stated as follows: Given a graph, find the minimum number of nodes whose deletion results in a subgraph satisfying property $\\pi $. In [LY] this problem was shown to be NP-complete for a large class of properties (the class of properties that are hereditary on induced subgraphs) using a small number of reduction schemes from the node cover problem. Since the node cover problem becomes polynomial on bipartite graphs, it might be hoped that this is the case with other node-deletion problems too.\nIn this paper we characterize those properties for which the bipartite restriction of the node-deletion problem is polynomial and those for which it remains NP-complete. Similar results follow for analogous problems on other structures such as families of sets, hypergraphs and 0,1 matrices. For example, in the case of matrices, our result states that if M is a class of 0,1 matrices which is closed under permutation and deletion of rows and columns, then finding the largest submatrix in M of a matrix is polynomial if the matrices of M have bounded rank and NP-complete otherwise.","authors":["Mihalis Yannakakis"],"meta":["May 1981SIAM Journal on Computing 10(2):310-327","DOI:10.1137/0210022","SourceDBLP"],"references":["221580898_Reducibility_Among_Combinatorial_Problems","243787873_Compexity_of_Computer_Computations","242615785_Stockmeyer_some_simplified_np-complete_graph_problems","238715703_Graph_properties_defined_by_a_forbidden_subgraph","228057735_Computers_And_Intractability_A_Guide_to_the_Theory_of_NP-Completeness","222452091_The_node-deletion_problem_for_hereditary_properties_is_NP-complete","222057470_Some_Simplified_NP-Complete_Graph_Problems","221591101_The_Complexity_of_Theorem-Proving_Procedures","221590732_The_Complexity_of_Satisfiability_Problems","221590308_Testing_Graph_Connectivity","220617408_Node-Deletion_NP-Complete_Problems"]}