{"id":"220632567_Multisensor_Image_Fusion_Using_the_Wavelet_Transform","abstract":"The goal of image fusion is to integrate complementary information from multisensor data such that the new images are more suitable for the purpose of human visual perception and computer-processing tasks such as segmentation, feature extraction, and object recognition. This paper presents an image fusion scheme which is based on the wavelet transform. The wavelet transforms of the input images are appropriately combined, and the new image is obtained by taking the inverse wavelet transform of the fused wavelet coefficients. An area-based maximum selection rule and a consistency verification step are used for feature selection. The proposed scheme performs better than the Laplacian pyramid-based methods due to the compactness, directional selectivity, and orthogonality of the wavelet transform. A performance measure using specially generated test images is suggested and is used in the evaluation of different fusion methods, and in comparing the merits of different wavelet transform kernels. Extensive experimental results including the fusion of multifocus images, Landsat and Spot images, Landsat and Seasat {SAR} images, {IR} and visible images, and {MRI} and {PET} images are presented in the paper","authors":["Hui Li","B. S. Manjunath","Sanjit K. Mitra"],"meta":["May 1995Graphical Models and Image Processing 57(3):235-245","DOI:10.1006/gmip.1995.1022","SourceDBLP"],"references":["3314653_Wavelets_and_Filter_Banks_Theory_and_Design","3192100_Mallat_SG_A_Theory_of_Multiresolution_Signal_Decomposition_The_Wavelet_Representation_IEEE_Trans_Pattern_Anal_Machine_Intell_11_674-693","3175620_Review_of_Multifrequency_Channel_Decomposition_of_Images_and_Wavelet_Models","238224991_Efficient_signal_extension_for_subbandwavelet_decomposition_of_arbitrary-length_signals","216027273_Orthogonal_Bases_of_Compactly_Supported_Wavelets","5556369_Image_coding_using_wavelet_transform_IEEE_Trans_Image_Process"]}