{"id":"220657031_Datalogy_-_The_Copenhagen_Tradition_of_Computer_Science","abstract":"Since the middle of the 1960s, computer science has been practised in Denmark under Peter Naur's term datalogy, the science of data and data processes. Starting at Regnecentralen and the University of Copenhagen, the Copenhagen Tradition of computer science has developed its own special characteristics by means of a close connection with applications and other fields of knowledge. The tradition is not least visible in the area of education. Comprehensive project activity is an integral part of the curriculum, thus presenting theory as an aspect of realistic solutions known primarily through actual experience. Peter Naur early recognized the particular educational challenges presented by computer science. His innovations have shown their quality and vitality also at other universities. There is a close connection between computer science training as it has been formed at Copenhagen University, and the view of computer science which has characterized Peter Naur's research. We illustrate how the study of programming and system development conceived as a human activity has been an all-pervasive theme in Naur's work. This approach has set the scene for central research issues in software development which today seem more topical than ever.","authors":["Edda Sveinsdottir","Erik Frøkjær"],"meta":["September 1988BIT. Numerical mathematics 28(3):450-472","DOI:10.1007/BF01941128","SourceDBLP"],"references":["316662038_The_european_side_of_the_last_phase_of_the_development_of_algol_60","279386395_On_the_Psychology_of_Prototyping","265340353_Understanding_computers_and_cognition_A_new_foundation_for_design","259703596_Understanding_Computers_and_Cognition_A_New_Foundation_for_Design","253430302_Structured_Design_Fundamentals_of_a_Discipline_of_Computer_Program_and_Systems_Design","245037202_The_design_of_the_GIER_ALGOL_compiler_Part_I","243575856_Program_development_studies_based_on_diaries","242735256_Go_To_Statement_Considered_Harmful","242630362_Curriculum_68_-_recommendations_for_academic_programs_in_computer_science","242622080_The_Computer_and_Information_Sciences_A_New_Basic_Discipline"]}