{"id":"220660276_Multiframe_Motion_Segmentation_with_Missing_Data_Using_PowerFactorization_and_GPCA","abstract":"We consider the problem of segmenting multiple rigid-body motions from point correspondences in multiple affine views. We cast this problem as a subspace clustering problem in which point trajectories associated with each motion live in a linear subspace of dimension two, three or four. Our algorithm involves projecting all point trajectories onto a 5-dimensional subspace using the SVD, the PowerFactorization method, or RANSAC, and fitting multiple linear subspaces representing different rigid-body motions to the points in ℝ5 using GPCA. Unlike previous work, our approach does not restrict the motion subspaces to be four-dimensional and independent. Instead, it deals gracefully with all the spectrum of possible affine motions: from two-dimensional and partially dependent to four-dimensional and fully independent. Our algorithm can handle the case of missing data, meaning that point tracks do not have to be visible in all images, by using the PowerFactorization method to project the data. In addition, our method can handle outlying trajectories by using RANSAC to perform the projection. We compare our approach to other methods on a database of 167 motion sequences with full motions, independent motions, degenerate motions, partially dependent motions, missing data, outliers, etc. On motion sequences with complete data our method achieves a misclassification error of less that 5% for two motions and 29% for three motions.","authors":["René Vidal","Roberto Tron","Richard Hartley"],"meta":["August 2008International Journal of Computer Vision 79(1):85-105","DOI:10.1007/s11263-007-0099-z","SourceDBLP"],"references":["268371653_PowerFactorization_3D_reconstruction_with_missing_or_uncertain_data","232620772_Damped_Newton_Algorithms_for_Matrix_Factorization_with_Missing_Data","228735650_Estimating_the_number_of_independent_motions_for_multibody_motion_segmentation","313661566_A_paraperspective_factorization_method_for_shape_and_motion_recovery","262274872_Motion_segmentation_with_missing_data_using_power_factorization_and_GPCA","237934207_Shape_and_motion_from_image_streams_under_orthography_A_factorization_approach","233786489_Motion_Segmentation_with_Missing_Data_by_PowerFactorization_and_Generalized_PCA","228083908_Outlier_Removal_for_Motion_Tracking_by_Subspace_Separation","226183575_Principal_Component_Analysis_with_Missing_Data_and_Its_Application_to_Polyhedral_Object_Modeling","221996566_On_Spectral_Clustering_Analysis_and_an_Algorithm"]}