{"id":"220677373_Breedbot_An_evolutionary_robotics_application_in_digital_content","abstract":"Purpose – This paper aims to describe an integrated hardware/software system based on evolutionary robotics and its application in an edutainment context. Design/methodology/approach – The system is based on a wide variety of artificial life techniques (artificial neural networks, genetic algorithms, user-guided evolutionary design and evolutionary robotics). A user without any computer programming skill can determine the robot's behavior in two different ways: artificial breeding or artificial evolution. Breedbot has been used as a didactic tool in teaching evolutionary biology and as a “futuristic” toy by several science centers. The digital side of Breedbot can be downloaded on the web site: www.isl.unina.it/breedbot Findings – The results in this pilot study suggest that using Breedbot in an educational context can be useful to improve learning in biology. Research limitations/implications – As this is a pilot study, one limitation is the small sample considered. The issue will be investigated further with a wider population and subject-matter, which will also improve the Breedbot system. Practical implications – These results suggest that tools like Breedbot could be introduced into biology curricula at schools. Originality/value – The paper describes an original application in digital content and shows the importance of using such a tool in an Edutainment context. It is therefore interesting for teachers, vocational trainers and anyone involved in educational activities.","authors":["Orazio Miglino","Onofrio Gigliotta","Michela Ponticorvo","Stefano Nolfi"],"meta":["June 2008The Electronic Library 26(3):363-373","DOI:10.1108/02640470810879509","SourceDBLP"],"references":["225740982_Using_artificial_life_to_teach_evolutionary_biology","316387308_Surgeons'_Skills_Training","265024077_Building_Effective_Blended_Learning_Programs","254937211_Chapter_14_Art_Robots_and_Evolution_as_a_Tool_for_Creativity","239060756_Learning_and_Instruction_in_Simulation_Environments","220720947_Artificial_Evolution_for_Computer_Graphics_Computer_Graphics_25319-328","37427220_Evolutionary_Robotics_The_Biology_Intelligence_and_Technology_of_Self-Organizing_Machines","30867887_Evolutionary_Design_by_Computers_Morgan_Kaufmann"]}