{"id":"220725128_The_Price_of_Defense_and_Fractional_Matchings","abstract":"Consider a network vulnerable to security attacks and equipped with defense mechanisms. How much is the loss in the provided security guarantees due to the selfish nature of attacks and defenses? The Price of Defense was recently introduced in [7] as a worst-case measure, over all associated Nash equilibria, of this loss. In the particular strategic game considered in [7], there are two classes of confronting randomized players on a graph G(V, E): νattackers, each choosing vertices and wishing to minimize the probability of being caught, and a single defender, who chooses edges and gains the expected number of attackers it catches.\nIn this work, we continue the study of the Price of Defense. We obtain the following results:\n– The Price of Defense is at least \\(\\frac{|V|}{2}\\); this implies that the Perfect Matching Nash equilibria considered in [7] are optimal with respect to the Price of Defense, so that the lower bound is tight.\n– We define Defense-Optimal graphs as those admitting a Nash equilibrium that attains the (tight) lower bound of \\(\\frac{|V|}{2}\\). We obtain:\n∙ A graph is Defense-Optimal if and only if it has a Fractional Perfect Matching. Since graphs with a Fractional Perfect Matching are recognizable in polynomial time, the same holds for Defense-Optimal graphs.\n∙ We identify a very simple graph that is Defense-Optimal but has no Perfect Matching Nash equilibrium.\n– Inspired by the established connection between Nash equilibria and Fractional Perfect Matchings, we transfer a known bivaluedness result about Fractional Matchings to a certain class of Nash equilibria. So, the connection to Fractional Graph Theory may be the key to revealing the combinatorial structure of Nash equilibria for our network security game.","authors":["Marios Mavronicolas","Vicky Papadopoulou","Giuseppe Persiano","Anna Philippou"],"meta":["December 2006","DOI:10.1007/11947950_13","SourceDBLP","Conference: Distributed Computing and Networking, 8th International Conference, ICDCN 2006, Guwahati, India, December 27-30, 2006."],"references":["221543445_Network_Game_with_Attacker_and_Protector_Entities","220976041_The_Price_of_Defense","313002635_The_price_of_selfish_routing","287012375_Worst-case_equilibria_in_Symposium_on_Theoretical_Aspects_of_Computer_Science","230873253_Non-Cooperative_Games","222577860_Inoculation_strategies_for_victims_of_viruses_and_the_sum-of-squares_partition_problem","222302283_Worst-Case_Equilibria","221933085_Introduction_To_Graph_Theory","221591939_The_price_of_selfish_routing","221343382_When_selfish_meets_evil_Byzantine_players_in_a_virus_inoculation_game"]}