{"id":"220701025_Games_Where_You_Can_Play_Optimally_Without_Any_Memory","abstract":"Reactive systems are often modelled as two person antagonistic games where one player represents the system while his adversary\nrepresents the environment. Undoubtedly, the most popular games in this context are parity games and their cousins (Rabin,\nStreett and Muller games). Recently however also games with other types of payments, like discounted or mean-payoff [5,6],\npreviously used only in economic context, entered into the area of system modelling and verification. The most outstanding\nproperty of parity, mean-payoff and discounted games is the existence of optimal positional (memoryless) strategies for both\nplayers. This observation raises two questions: (1) can we characterise the family of payoff mappings for which there always\nexist optimal positional strategies for both players and (2) are there other payoff mappings with practical or theoretical\ninterest and admitting optimal positional strategies. This paper provides a complete answer to the first question by presenting\na simple necessary and sufficient condition on payoff mapping guaranteeing the existence of optimal positional strategies.\nAs a corollary to this result we show the following remarkable property of payoff mappings: if both players have optimal positional\nstrategies when playing solitary one-player games then also they have optimal positional strategies for two-player games.","authors":["Hugo Gimbert","Wieslaw Zielonka"],"meta":["August 2005Lecture Notes in Computer Science 3653:428-442","DOI:10.1007/11539452_33","SourceDBLP","Conference: CONCUR 2005 - Concurrency Theory, 16th International Conference, CONCUR 2005, San Francisco, CA, USA, August 23-26, 2005, Proceedings"],"references":["221558250_Parity_and_Exploration_Games_on_Infinite_Graphs","220975873_When_Can_You_Play_Positionally","220152706_Model_checking_discounted_temporal_properties","226645887_Positional_strategies_for_mean_payoff_games","225711655_Solving_Pushdown_Games_with_a_Sigma_3_Winning_Condition","222415046_Model_Checking_Discounted_Temporal_Properties","222410919_On_the_positional_determinacy_of_edge-labeled_games","221583864_Pushdown_Games_with_Unboundedness_and_Regular_Conditions","220994735_Positional_Determinacy_of_Infinite_Games","220896900_Discounting_the_Future_in_Systems_Theory"]}