{"id":"220737182_Analysis_of_low_resolution_accelerometer_data_for_continuous_human_activty_recognition","abstract":"The advent of wearable sensors like accelerometers has opened a plethora of opportunities to recognize human activities from other low resolution sensory streams. In this paper we formulate recognizing activities from accelerometer data as a classification problem. In addition to the statistical and spectral features extracted from the acceleration data, we propose to extract features that characterize the variations in the first order derivative of the acceleration signal. We evaluate the performance of different state of the art discriminative classifiers like, boosted decision stumps (AdaBoost), support vector machines (SVM) and regularized logistic regression (RLogReg) under three different evaluation scenarios (namely subject independent, subject adaptive and subject dependent). We propose a novel computationally inexpensive methodology for incorporating smoothing classification temporally, that can be coupled with any classifier with minimal training for classifying continuous sequences. While a 3% increase in the classification accuracy was observed on adding the new features, the proposed technique for continuous recognition showed a 2.5 - 3% improvement in the performance.","authors":["Narayanan Chatapuram Krishnan","Sethuraman Panchanathan"],"meta":["March 2008Acoustics, Speech, and Signal Processing, 1988. ICASSP-88., 1988 International Conference on","DOI:10.1109/ICASSP.2008.4518365","SourceDBLP","Conference: Proceedings of the IEEE International Conference on Acoustics, Speech, and Signal Processing, ICASSP 2008, March 30 - April 4, 2008, Caesars Palace, Las Vegas, Nevada, USA"],"references":["221604452_Activity_Recognition_from_Accelerometer_Data","220815706_A_Hybrid_DiscriminativeGenerative_Approach_for_Modeling_Human_Activities","221016026_Activity_Recognition_from_User-Annotated_Acceleration_Data","4198461_Detection_of_eating_and_drinking_arm_gestures_using_inertial_body-worn_sensors"]}