{"id":"220727323_Embedding_Pure_Type_Systems_in_the_Lambda-Pi-Calculus_Modulo","abstract":"The lambda-Pi-calculus allows to express proofs of minimal predicate logic. It can be extended, in a very simple way, by adding com- putation rules. This leads to the lambda-Pi-calculus modulo. We show in this paper that this simple extension is surprisingly expressive and, in particular, that all functional Pure Type Systems, such as the system F, or the Calculus of Constructions, can be embedded in it. And, moreover, that this embedding is conservative under termination hypothesis. The λΠ-calculus is a dependently typed lambda-calculus that allows to ex- press proofs of minimal predicate logic through the Brouwer-Heyting-Kolmogorov interpretation and the Curry-de Bruijn-Howard correspondence. It can be ex- tended in several ways to express proofs of some theory. A first solution is to express the theory in Deduction modulo (7,9), i.e. to orient the axioms as rewrite rules and to extend the λΠ-calculus to express proofs in Deduction modulo (3). We get this way the λΠ-calculus modulo. This idea of extending the dependently typed lambda-calculus with rewrite rules is also that of Intuitionistic type theory used as a logical framework (13). A second way to extend the λΠ-calculus is to add typing rules, in particular to allow polymorphic typing. We get this way the Calculus of Constructions (4) that allows to express proofs of simple type theory and more generally the Pure Type Systems (2,15,1). These two kinds of extensions of the λΠ-calculus are somewhat redundant. For instance, simple type theory can be expressed in deduction modulo (8), hence the proofs of this theory can be expressed in the λΠ-calculus modulo. But they can also be expressed in the Calculus of Constructions. This suggests to relate and compare these two ways to extend the λΠ-calculus. We show in this paper that all functional Pure Type Systems can be em- bedded in the λΠ-calculus modulo using an appropriate rewrite system. This rewrite system is inspired both by the expression of simple type theory in Deduc- tion modulo and by the mechanisms of universesa la Tarski (12) of Intuitionistic type theory. In particular, this work extends Palmgren's construction of an im- predicative universe in type theory (14).","authors":["Denis Cousineau","Gilles Dowek"],"meta":["June 2007","DOI:10.1007/978-3-540-73228-0_9","SourceDBLP","Conference: Typed Lambda Calculi and Applications, 8th International Conference, TLCA 2007, Paris, France, June 26-28, 2007, Proceedings"],"references":["257283828_Lambda_Calculi_with_Types","226873390_HOL-ls_An_Intentional_First-Order_Expression_of_Higher-Order_Logic","225532518_Proof_Normalization_Modulo","221186701_Proof_Normalization_Modulo","220896107_Strong_Normalization_of_the_Dual_Classical_Sequent_Calculus","220173720_HOL-ls_An_intentional_first-order_expression_of_higher-order_logic","319394269_Intuitionistic_Type_Theory","277283810_Martin-Lof's_Type_Theory","248600036_Interpretation_fonctionelle_et_elimination_des_coupures_de_l'arithmetique_d'ordre_superieur","243681219_On_universes_in_type_theory","220246175_The_Calculus_of_Constructions","216300106_Lambda_Calculi_with_Types","3902815_Definitions_by_rewriting_in_the_calculus_of_constructions","2648946_Martin-Lof's_Type_Theory","2510767_Theorem_Proving_Modulo","2378147_A_Framework_for_Defining_Logics","1960072_Definitions_by_Rewriting_in_the_Calculus_of_Constructions"]}