{"id":"220791661_Assessment_and_Support_for_Software_Capstone_Projects_at_the_Undergraduate_Level_A_Survey_and_Rubrics","abstract":"Software engineering and computer science students conduct a capstone project during the final year of their degree programs. These projects are essential in validating that students have gained required knowledge and they can synthesize and use that knowledge to solve real world problems. However, the external requirements on educational programs often do not provide detailed guidelines for how to conduct or support these capstone projects, which may lead to variations among universities. This paper presents the results from a survey conducted at 19 different Pakistani universities of the current management practices and assessment criteria used for the capstone project courses at Undergraduate level. Based upon the results of this survey and similar work on Master Thesis capstone projects in Sweden, we present assessment rubrics for software-related undergraduate capstone projects. We also present recommendations for the continuous improvement of capstone projects.","authors":["Ehsan Ahmad","Bilal Raza","Robert Feldt"],"meta":["December 2011","DOI:10.1109/FIT.2011.13","SourceDBLP","Conference: 2011 Frontiers of Information Technology, FIT 2011, Islamabad, Pakistan, December 19-21, 2011"],"references":["268630178_CHALLENGES_IN_GRADING_PROJECT_TEAMS","267934598_CS_Capstone_Lessons_from_the_Field","266183923_PROJECT_TEAMS_AND_CHALLENGES_IN_FAIR_GRADING","250696717_DOCUMENT_TEMPLATES_FOR_STUDENT_PROJECTS_IN_SOFTWARE_ENGINEERING","234826260_Running_research-oriented_final_year_projects_for_CS_and_IS_students","277473764_Thinking_ISsues","248965942_Assessing_the_Undergraduate_Dissertation","247924737_Managing_mid-project_progress_reviews_A_model_for_formative_group_assessment_in_Capstone_projects","240699457_Mark_Distributions_and_Marking_Practices_in_UK_Higher_EducationSome_Challenging_Issues","233311137_Allocation_and_Assessment_of_Project_Work_in_the_Final_Year_of_the_Engineering_Degree_Course_At_the_University_of_Bath"]}