{"id":"220756807_The_Inmates_Are_Running_the_Asylum","abstract":"Are you an inmate? What if we switched the metaphor to, “the building contractors are telling the architects where to put the windows?“Strike a little closer to home? The mechanics of building an application often end up taking precedence over the aims of the project, to the point where nobody—user, designer, programmer or manager—ends up getting what they want. Alan Cooper, the “Father of Visual Basic“and author of About Face: The Essentials of User Interface Design, sees a cure for this craziness in a new way to design interaction. Applications created using his Goal-Directed ® Design process provide users with power and pleasure. His keynote presentation will give you some much-needed perspective on design issues and show a case study of how a leading vendor has adopted Cooper’s approach. He’ll also offer tips on how you can make the business case for effective design to your managers. Alan is a motivating, thought-provoking, and original speaker. Come prepared to toss out some old ideas, hear some new ones and perhaps even escape from the asylum.","authors":["Alan Cooper"],"meta":["March 1999","DOI:10.1007/978-3-322-99786-9_1","SourceDBLP","Conference: Software-Ergonomie '99, Design von Informationswelten, Gemeinsame Fachtagung des German Chapter of the ACM, der Gesellschaft für Informatik (GI) und der SAP AG, Walldorf, 8.-11. März 1999, Walldorf/Baden"],"references":["321302483_Do_accreditation_requirements_deter_curriculum_innovationYes","319025821_The_Effects_of_Accreditation_Procedures","319025673_Why_Accreditation","270202603_Accreditation_as_a_Protection_Against_Pressures","269830195_The_Effects_of_Accreditation_Procedures","267786423_Your_Taxes_Support_For-Profits_as_They_Buy_Colleges_Update3","234624193_Accreditors_Revamp_Policies_To_Stress_Student_Learning","233062579_Reducing_Student_Costs_and_Enhancing_Student_Learning","13156685_Recent_Developments_Concerning_Accrediting_Agencies_in_Postsecondary_Education"]}