{"id":"220765092_ADANA_Active_name_disambiguation","abstract":"Name ambiguity has long been viewed as a challenging problem in many applications, such as scientific literature management, people search, and social network analysis. When we search a person name in these systems, many documents (e.g., papers, web pages) containing that person's name may be returned. It is hard to determine which documents are about the person we care about. Although much research has been conducted, the problem remains largely unsolved, especially with the rapid growth of the people information available on the Web. In this paper, we try to study this problem from a new perspective and propose an ADANA method for disambiguating person names via active user interactions. In ADANA, we first introduce a pairwise factor graph (PFG) model for person name disambiguation. The model is flexible and can be easily extended by incorporating various features. Based on the PFG model, we propose an active name disambiguation algorithm, aiming to improve the disambiguation performance by maximizing the utility of the user's correction. Experimental results on three different genres of data sets show that with only a few user corrections, the error rate of name disambiguation can be reduced to 3.1%. A real system has been developed based on the proposed method and is available online.","authors":["Xuezhi Wang","Jie Tang","Hong Cheng","Philip S. Yu"],"meta":["December 2011","DOI:10.1109/ICDM.2011.19","SourceDBLP","Conference: 11th IEEE International Conference on Data Mining, ICDM 2011, Vancouver, BC, Canada, December 11-14, 2011"],"references":["234140148_Variational_Approximations_between_Mean_Field_Theory_and_the_JunctionTree_Algorithm","319770162_Fast_and_Robust_Classification_using_Asymmetric_AdaBoost_and_a_Detector_Cascade","313745907_Experiments_with_a_new_boosting_algorithm_machine_learning","244498683_Experiment_With_a_New_Boosting_Algorithm","236901854_Understanding_the_Metropolis-Hastings_Algorithm","232617537_A_Unified_Probabilistic_Framework_for_Name_Disambiguation_in_Digital_Library","225070191_A_Decision-Theoretic_Generalization_of_On-Line_Learning_and_an_Application_to_Boosting","221654198_A_unified_approach_for_schema_matching_coreference_and_canonicalization","221620391_Generalized_Belief_Propagation","221615233_A_constraint-based_probabilistic_framework_for_name_disambiguation"]}