{"id":"220816913_Statistical_Phrase-Based_Translation","abstract":"We propose a new phrase-based translation model and decoding algorithm that enables us to evaluate and compare several, previously proposed phrase-based translation models. Within our framework, we carry out a large number of experiments to understand better and explain why phrase-based models out-perform word-based models. Our empirical results, which hold for all examined language pairs, suggest that the highest levels of performance can be obtained through relatively simple means: heuristic learning of phrase translations from word-based alignments and lexical weighting of phrase translations. Surprisingly, learning phrases longer than three words and learning phrases from high-accuracy word-level alignment models does not have a strong impact on performance. Learning only syntactically motivated phrases degrades the performance of our systems.","authors":["Philipp Koehn","Franz Josef Och","Daniel Marcu"],"meta":["January 2003","DOI:10.3115/1073445.1073462","SourceDBLP","Conference: Proceedings of the 2003 Conference of the North American Chapter of the Association for Computational Linguistics on Human Language Technology - Volume 1"],"references":["230875890_The_Mathematics_of_Statistical_Machine_Translation_Parameter_Estimation","220873497_Improved_Statistical_Alignment_Models","2930546_An_Efficient_A_Search_Algorithm_for_Statistical_Machine_Translation","248515926_The_Mathematics_of_Statistical_Ma_-_chine_Translation","246586079_Joint_probability_model_for_statistical_machine_translation","230876149_Statistical_Methods_of_Speech_Recognition","230875959_Stochastic_Inversion_Transduction_Grammars_and_Bilingual_Parsing_of_Parallel_Corpora","228609491_Application_of_translation_knowledge_acquired_by_hierarchical_phrase_alignment_for_pattern-based_MT","222670794_Fast_and_optimal_decoding_for_machine_translation","2895052_A_Phrase-Based_Joint_Probability_Model_for_Statistical_Machine_Translation_Daniel_Marcu"]}