{"id":"220814768_Beyond_TFIDF_Weighting_for_Text_Categorization_in_the_Vector_Space_Model","abstract":"KNN and SVM are two machine learning approaches to Text\nCategorization (TC) based on the Vector Space Model. In this model,\nborrowed from Information Retrieval, documents are represented as\na vector where each component is associated with a particular word\nfrom the vocabulary. Traditionally, each component value is assigned\nusing the information retrieval TFIDF measure. While this weighting\nmethod seems very appropriate for IR, it is not clear that it is the\nbest choice for TC problems. Actually, this weighting method does not\nleverage the information implicitly contained in the categorization\ntask to represent documents. In this paper, we introduce a new\nweighting method based on statistical estimation of the importance\nof a word for a specific categorization problem. This method also has\nthe benefit to make feature selection implicit, since useless features\nfor the categorization problem considered get a very small weight.\nExtensive experiments reported in the paper shows that this new\nweighting method improves significantly the classification accuracy \nas measured on many categorization tasks.","authors":["Pascal Soucy","Guy W. Mineau"],"meta":["January 2005","SourceDBLP","Conference: IJCAI-05, Proceedings of the Nineteenth International Joint Conference on Artificial Intelligence, Edinburgh, Scotland, UK, July 30-August 5, 2005"],"references":["302567910_Making_large_scale_SVM_learning_practical","284817652_Interaction_of_Feature_Selection_Methods_and_Linear_Classification_Models","228558349_The_Reuters_Corpus_Volume_1_--_from_Yesterday's_News_to_Tomorrow's_Language_Resources","2530763_Studies_in_Fuzziness_and_Soft_Computing","312894182_A_vector-space_model_for_information_retrieval","238799043_Reuters21578_text_categorization_test_collection_Distribution_10_README_file_v_13","235991653_Probable_Inference_the_Law_of_Succession_and_Statistical_Inference"]}