{"id":"220816639_F_Learning_Morphological_Disambiguation_Rules_for_Turkish","abstract":"In this paper, we present a rule based model for morphological disambiguation of Turkish. The rules are generated by a novel decision list learning algorithm us- ing supervised training. Morphological ambiguity (e.g. lives = live+s or life+s) is a challenging problem for agglutinative languages like Turkish where close to half of the words in running text are morpho- logically ambiguous. Furthermore, it is possible for a word to take an unlimited number of sufx es, therefore the number of possible morphological tags is unlim- ited. We attempted to cope with these problems by training a separate model for each of the 126 morphological features recognized by the morphological analyzer. The resulting decision lists independently vote on each of the potential parses of a word and the nal parse is selected based on our condence on these votes. The accuracy of our model (96%) is slightly above the best previously reported results which use statistical models. For compari- son, when we train a single decision list on full tags instead of using separate models on each feature we get 91% accuracy.","authors":["Deniz Yuret","Ferhan Türe"],"meta":["January 2006","DOI:10.3115/1220835.1220877","SourceDBLP","Conference: Human Language Technology Conference of the North American Chapter of the Association of Computational Linguistics, Proceedings, June 4-9, 2006, New York, New York, USA"],"references":["237133476_Alternative_Strategies_for_Decision_List_Construction","230876366_Two-level_Description_of_Turkish_Morphology","230876180_Constraint_Grammar_A_Language-Independent_System_for_Parsing_Unrestricted_Text","221101514_Statistical_Morphological_Disambiguation_for_Agglutinative_Languages","220874161_Tagging_Inflective_Languages_Prediction_of_Morphological_Categories_for_a_Rich_Structured_Tagset","346063577_Learning_Decision_Lists","261344688_A_Stochastic_Parts_Program_and_Noun_Phrase_Parser_for_Unrestricted_Text","254877817_Syntactic_Wordclass_Tagging","243785548_Design_for_a_turkish_treebank","226192677_The_CN2_Induction_algorithm"]}