{"id":"220808076_Once_she_makes_it_she_is_there_Gender_differences_in_computer_science_study","abstract":"When you sit in a Computer Science lecture at any university in the western world, what are the chances that the person sitting next to you will be a woman? Furthermore, what are the chances that the lecturer will be a woman? And if we were to enter a Computer Science classroom in a high school, what percentage of the students would be female? Computer Science is possibly one of the few remaining disciplines that is almost entirely controlled by men in the university staff, and in which the percentage of female students is usually below 30%. This phenomenon is prevalent throughout the western world.In this paper we present data about women studying Computer Science in universities and high schools in Israel. It deals with the specific problems that lead to a low rate of female enrollment in Computer Science courses and a high female-dropout rate. It describes some suggested solutions to encourage female enrollment and retention rate in Computer Science programs. The research was done at the Open University of Israel. An attempt has been made to identify whether there is a specific stage in the undergraduate program that is the most difficult for women to pass. Finally, we discuss ways to assist female students and enable them to overcome this obstacle and remain in the program.","authors":["Tamar Vilner","Ela Zur"],"meta":["January 2006","SourceDBLP","Conference: Proceedings of the 11th Annual SIGCSE Conference on Innovation and Technology in Computer Science Education, ITiCSE 2006, Bologna, Italy, June 26-28, 2006"],"references":["282294789_Changes_in_CS_students'_attitudes_towards_CS_over_time_An_examination_of_gender_differences","234791478_Building_an_effective_computer_science_student_organization_the_Carnegie_Mellon_womenSCS_action_plan","221538030_Gender_differences_in_computer_science_students","221537676_Culture_and_environment_as_determinants_of_women's_participation_in_computing_Revealing_the_women-CS_fit","221536756_A_CS1_course_designed_to_address_interests_of_women","234795912_Women_in_computing_Where_are_we_now","221537323_Factors_influencing_the_shrinking_pipeline_in_high_schools_A_sector-based_analysis_of_the_Israeli_high_school_system","220613100_Unlocking_the_clubhouse_The_Carnegie_Mellon_experience","220613071_Recruiting_and_retaining_women_in_undergraduate_computing_majors","220612944_Ten_suggestions_for_a_gender-equitable_CS_classroom","220612885_Encouraging_women_in_computer_science","27297778_The_Incredible_Shrinking_Pipeline"]}