{"id":"220867411_The_Problem_with_Evolutionary_Art_Is","abstract":"Computational evolutionary art has been an active practice for at least 20 years. Given the remarkable advances in that time\nin other realms of computing, including other forms of evolutionary computing, for many a vague feeling of disappointment\nsurrounds evolutionary art. Aesthetic improvement in evolutionary art has been slow, and typically achieved in ways that are\nnot widely generalizable or extensible. So what is the problem with evolutionary art? And, frankly, why isn’t it better? In\nthis paper I respond to these questions from my point of view as a practicing artist applying both a technical and art theoretical\nunderstanding of evolutionary art. First the lack of robust fitness functions is considered with particular attention to the\nproblem of computational aesthetic evaluation. Next the issue of genetic representation is discussed in the context of complexity\nand emergence. And finally, and perhaps most importantly, the need for art theory around evolutionary and generative art is\ndiscussed, and a theory that stands typical evolutionary art on its head is proposed.","authors":["Philip Galanter"],"meta":["April 2010","DOI:10.1007/978-3-642-12242-2_33","SourceDBLP","Conference: Applications of Evolutionary Computation, EvoApplications 2010: EvoCOMNET, EvoENVIRONMENT, EvoFIN, EvoMUSART, and EvoTRANSLOG, Istanbul, Turkey, April 7-9, 2010, Proceedings, Part II"],"references":["334905291_A_Neural-Network_Theory_of_Beauty","318494160_What_is_generative_art_Complexity_theory_as_a_context_for_art_theory","309313097_Chaos_fractals_nature_a_new_look_at_Jackson_Pollock","309310624_Three_approaches_to_the_quantitative_definition_of_information","273868761_Theories_of_Art_Today","272746350_Metacreation_Art_and_Artificial_Life","269920709_Creative_Evolutionary_Systems","268903420_Aesthetic_Measure","266217430_On_the_Length_of_Programs_for_Computing_Finite_Binary_Sequences_Statistical_Considerations","256868123_On_Intelligence"]}