{"id":"220808343_A_framework_for_computational_thinking_across_the_curriculum","abstract":"We describe a framework for implementing computational thinking in a broad variety of general education courses. The framework is designed to be used by faculty without formal training in information technology in order to understand and integrate computational thinking into their own general education courses. The framework includes examples of computational thinking in a variety of general education courses, as well as sample in-class activities, assignments, and other assessments for the courses. The examples in the different courses are related and differentiated using categories taken from Denning Great Principles of Computing, so that similar types of computational thinking appearing in different contexts are brought together. This aids understanding of the computational thinking found in the courses and provides a template for future work on new course materials. Specific examples of computational thinking in the design category are provided in the context of three distinct courses.","authors":["Ljubomir Perkovic","Amber Settle","Sungsoon Hwang","Joshua Jones"],"meta":["January 2010","DOI:10.1145/1822090.1822126","SourceDBLP","Conference: Proceedings of the 15th Annual SIGCSE Conference on Innovation and Technology in Computer Science Education, ITiCSE 2010, Bilkent, Ankara, Turkey, June 26-30, 2010"],"references":["274309848_Computational_Thinking","251857630_The_Influence_of_Media_Violence_on_Youth","221619878_Automatic_Generation_of_Social_Tags_for_Music_Recommendation","328941861_Origami_Design_Secrets_Mathematical_Methods_for_an_Ancient_Art","313550304_Automatic_generation_of_social_tags_for_music_recommendation","234825704_A_model_for_piloting_pathways_for_computational_thinking_in_a_general_education_curriculum","228057968_Augmenting_Human_Intellect_A_Conceptual_Framework","220426836_Great_Principles_of_Computing","45853418_The_Convergence_of_Bird_Flocking","31839994_The_Mind's_New_Science_A_History_of_the_Cognitive_Revolution_H_Gardner"]}