{"id":"220862543_Teaching_SQL_-_Which_Pedagogical_Horse_for_This_Course","abstract":"A student with a Computing Science degree is expected to have reached a reasonable level of expertise in writing SQL. SQL is a non-trivial skill to master and is taught with different degrees of success at different institutions. When teaching any skill we have to take both previous learning and experience into consideration as well as the best possible way of teaching the skill.\nWhen learning a new skill humans form mental models of particular problems and formulate internal patterns for solving these problems. When they encounter the same problem later they apply these previously internalised patterns to solve the problem. This reality has to be taken into account when selecting a teaching approach because changing an existing mental model is difficult and much more difficult than encoding the correct model in the first place.\nThis paper considers two different pedagogical approaches to teaching SQL and compares and contrasts these in terms of mental models and cognition. We conclude by making recommendations about the tools that should be used in teaching SQL if the afore-mentioned mental models are to be constructed to support a coherent and correct understanding of SQL semantics and not merely the syntax thereof.","authors":["Karen Renaud","Judy Van Biljon"],"meta":["July 2004Lecture Notes in Computer Science","DOI:10.1007/978-3-540-27811-5_22","SourceDBLP","Conference: Key Technologies for Data Management, 21st British National Conference on Databases, BNCOD 21, Edinburgh, UK, July 7-9, 2004, Proceedings"],"references":["231891806_Precis_of_Deduction","228408902_Mental_models_a_gentle_guide_for_outsiders","221053965_Zazu_-_Investigating_the_Difference_between_Interaction_Approaches_in_Advisory_Support_Systems_for_Curriculum","255680176_Reflections_by_teachers_learning_to_program","251901004_Open_Instructional_Design","243774668_Teacher_training_in_technological_education_in_Finland","229124643_A_Pattern_Language_Towns_Building_and_Construction","222725256_The_framework_for_DIRECTED_online_learning_environments","222495062_Learning_Technology_and_Usability_A_Framework_for_Understanding_Courseware","221222929_A_teaching_system_for_SQL"]}