{"id":"220882066_Classification_Rule_Construction_Using_Particle_Swarm_Optimization_Algorithm_for_Breast_Cancer_Data_Sets","abstract":"Data mining is \"The nontrivial extraction of implicit, previously unknown, and potentially useful information from data.\" Data mining is an inter-disciplinary field, whose core is at the intersection of machine learning, statistics and databases. A major objective of this work is to evaluate data mining tools in medical and health care applications to develop a tool that can help make timely and accurate decisions. One technique used in data mining misclassification where the desired output is a set of Rules or Statements that characterize the data. Within the rule induction paradigm, the algorithm used is Particle Swarm Optimization. Particle Swarm Optimization (PSO) is a heuristic technique suited for search of optimal solutions and based on the concept of swarm which were inspired in group dynamics and its synergy were originated from computer simulations of the coordinated motion. This proposed work is intended to develop Classification rules to extract data from historical or training data of patients which is developed into patterns relevant for diagnosis and suitable for quicker analysis, automated processing, thus reducing cost and helping to provide enhanced care and better cure.","authors":["K. Rajiv Gandhi","Marcus Karnan","S. Kannan"],"meta":["February 2010","DOI:10.1109/ICSAP.2010.58","SourceDBLP","Conference: 2010 International Conference on Signal Acquisition and Processing, ICSAP 2010, Bangalore, India, February 9-10, 2010"],"references":["220742451_Smart_crossover_operator_with_multiple_parents_for_a_Pittsburgh_learning_classifier_system","222436203_Particle_Swarm_based_Data_Mining_Algorithms_for_classification_tasks","4133355_Improving_a_Pittsburgh_learnt_fuzzy_rule_base_using_feature_subset_selection","4113499_Learning_and_optimization_of_fuzzy_rule_base_by_means_of_self-adaptive_genetic_algorithm","3903969_The_effects_of_inactivation_of_rules_for_knowledge_acquisition","3828933_A_hybrid_fuzzy_genetics-based_machine_learning_algorithm_hybridization_of_Michigan_approach_and_Pittsburgh_approach"]}