{"id":"220897744_On_Approximate_Horn_Formula_Minimization","abstract":"The minimization problem for Horn formulas is to find a Horn formula equivalent to a given Horn formula, using a minimum number of clauses. A 2 log 1 ǫ (n) -inapproximability result is proven, which is the first inapproximability result for this problem. We also consider several other versions of Horn minimization. The more general version which allows for the introduction of new variables is known to be too difficult as its equiv- alence problem is co-NP-complete. Therefore, we propose a variant called Steiner- minimization, which allows for the introduction of new variables in a restricted manner. Steiner-minimization of Horn formulas is shown to be MAX-SNP-hard. In the positive direction, a o(n), namely, O(nlog log n/(log n) 1/4 )-approximation algorithm is given for the Steiner-minimization of definite Horn formulas. The algorithm is based on a new result in algorithmic extremal graph theory, on partitioning bipartite graphs into complete bipartite graphs, which may be of independent interest. Inapproximability results and approximation algorithms are also given for restricted versions of Horn minimization, where only clauses present in the original formula may be used.","authors":["Amitava Bhattacharya","Bhaskar Dasgupta","Dhruv Mubayi","Gyorgy Turan"],"meta":["July 2010","DOI:10.1007/978-3-642-14165-2_38","SourceDBLP","Conference: Automata, Languages and Programming, 37th International Colloquium, ICALP 2010, Bordeaux, France, July 6-10, 2010, Proceedings, Part I"],"references":["245588498_Boolean_Functions_and_Computation_Models","319394978_Artificial_Intelligence_---_A_Modern_Approach","290316054_Open_Mind_Common_Sense_Knowledge_acquisition_from_the_general_public","272161464_Artificial_Intelligence_A_Modern_Approach_Second_Edition","268627322_Propositional_logic_deduction_and_algorithms_Transl_from_the_German","268015086_The_Theory_of_Relational_Databases","266438299_On_the_decomposition_of_graphs_into_complete_bipartite_subgraphs","265351877_On_a_problem_of_K_Zarankiewicz","258129822_Complexity_of_lattice-configurations","246174638_Feasibly_constructive_proofs_and_the_propositional_calculus"]}