{"id":"220853282_A_Graph-Theoretic_Network_Security_Game","abstract":"Consider a network vulnerable to viral infection. The system security software can guarantee safety only to a limited part of the network. We model this practical network scenario as a non-cooperative multi-player game on a graph, with two kinds of players, a set of attackers and a protector player, representing the viruses and the system security software, respectively. Each attacker player chooses a node of the graph (or a set of them, via a probability distribution) to infect. The protector player chooses independently, in a basic case of the problem, a simple path or an edge of the graph (or a set of them, via a probability distribution) and cleans this part of the network from attackers. Each attacker wishes to maximize the probability of escaping its cleaning by the protector. In contrast, the protector aims at maximizing the expected number of cleaned attackers. We call the two games obtained from the two basic cases considered, as the Path and the Edge model, respectively.\nWe are interested in the associated Nash equilibria on them, where no network entity can unilaterally improve its local objective. We obtain the following results:\n– The problem of existence of a pure Nash equilibrium is \\(\\cal NP\\)-complete for the Path model. This opposed to that, no instance of the Edge model possesses a pure Nash equilibrium, proved in [4].\n– We compute, in polynomial time, mixed Nash equilibria on corresponding graph instances. These graph families include, regular graphs, graphs that can be decomposed, in polynomially time, into vertex disjoint r-regular subgraphs, graphs with perfect matchings and trees.\n– We utilize the notion of social cost [3] for measuring system performance on such scenario; here is defined to be the utility of the protector. We prove that the corresponding Price of Anarchy in any mixed Nash equilibria of the game is upper and lower bounded by a linear function of the number of vertices of the graph.","authors":["Marios Mavronicolas","Vicky Papadopoulou","Anna Philippou","Paul G. Spirakis"],"meta":["December 2005International Journal of Autonomous and Adaptive Communications Systems 1(4):969-978","DOI:10.1007/11600930_98","SourceDBLP","Conference: Internet and Network Economics, First International Workshop, WINE 2005, Hong Kong, China, December 15-17, 2005, Proceedings"],"references":["226492146_Maximum_skew-symmetric_flows","221543445_Network_Game_with_Attacker_and_Protector_Entities","221499631_An_Osqrtv_E_Algorithm_for_Finding_Maximum_Matching_in_General_Graphs","287012375_Worst-case_equilibria_in_Symposium_on_Theoretical_Aspects_of_Computer_Science","239344419_A_Short_Proof_of_the_Factor_Theorem_for_Finite_Graphs","230873253_Non-Cooperative_Games","228108257_Non-Cooperative_Games","222577860_Inoculation_strategies_for_victims_of_viruses_and_the_sum-of-squares_partition_problem","222302283_Worst-Case_Equilibria","221933085_Introduction_To_Graph_Theory","220976041_The_Price_of_Defense","220848627_The_Power_of_the_Defender","220616322_A_Graph-Theoretic_Game_and_Its_Application_to_the_k_-Server_Problem","220695890_Computers_and_Intracdtability_A_Guide_to_the_Theory_of_NP-Completeness","216301157_Equilibrium_points_in_n-person_games_Proc_Natl_Acad_Sci_USA"]}