{"id":"220841965_An_Analysis_of_Many-to-Many_Relationships_Between_Fact_and_Dimension_Tables_in_Dimensional_Modeling","abstract":"Star schema, which maintains one-to-many relationships between dimensions and a fact table, is widely accepted as the most viable data representation for dimensional analysis. Real- world DW schema, however, frequently includes many-to-many relationships between a dimension and a fact table. Having those relationships in a dimensional model causes several difficult issues, such as losing the simplicity of the star schema structure, increasing complexity in forming queries, and degrading query performance by adding more joins. Therefore, it is desirable to represent the many-to-many relationships with correct semantics while still keeping the structure of the star schema. In this paper, we analyze many-to-many relationships between a dimension table and a fact table in dimensional modeling. We illustrate six different approaches and show the advantages and disadvantages of each. We propose two ad-hoc methods that maintain a star schema structure by denormalizing the dimensions to avoid many-to- many relationships. This method allows quick query processing by using a concatenated attribute with minimal overhead. Other issues addressed are data redundancy, weighting factors, storage requirements, and performance concerns.","authors":["Il-Yeol Song","William Rowen","Carl Medsker","Edward Ewen"],"meta":["January 2001","SourceDBLP","Conference: Proceedings of the 3rd Intl. Workshop on Design and Management of Data Warehouses, DMDW'2001, Interlaken, Switzerland, June 4, 2001"],"references":["220933940_Methodological_Framework_for_Data_Warehouse_Design","220841943_Conceptual_data_warehouse_modeling","313601861_Data_warehouse_schema_and_instance_design","243780920_A_Dimensional_Modeling_Manifesto","242571341_Object-oriented_data_warehouse_design","238711760_The_data_warehousing_toolkit","234828533_Building_a_Better_Data_Warehouse","221269442_Extending_the_ER_Model_for_the_Multidimensional_Paradigm","220933870_The_OLAP_Market_State_of_the_Art_and_Research_Issues","220841952_From_enterprise_models_to_dimensional_models_a_methodology_for_data_warehouse_and_data_mart_design"]}