{"id":"220976041_The_Price_of_Defense","abstract":"We consider a strategic game with two classes of confronting randomized players on a graph G(V, E): v attackers, each choosing vertices and wishing to minimize the probability of being caught, and a defender, who chooses edges and gains the expected number of attackers it catches. The Price of Defense is the worst-case ratio, over all Nash equilibria, of the optimal gain of the defender over its gain at a Nash equilibrium. We provide a comprehensive collection of trade-offs between the Price of Defense and the computational efficiency of Nash equilibria.\n-- Through reduction to a Two-Players, Constant-Sum Game, we prove that a Nash equilibrium can be computed in polynomial time. The reduction does not provide any apparent guarantees on the Price of Defense.\n-- To obtain such, we analyze several structured Nash equilibria:\n-- In a Matching Nash equilibrium, the support of the defender is an Edge Cover. We prove that they can be computed in polynomial time, and they incur a Price of Defense of \\alpha(G), the Independence Number of G.\n-- In a Perfect Matching Nash equilibrium, the support of the defender is a Perfect Matching. We prove that they can be computed in polynomial time, and they incur a Price of Defense of |V|/2 .\n-- In a Defender Uniform Nash equilibrium, the defender chooses uniformly each edge in its support. We prove that they incur a Price of Defense falling between those for Matching and Perfect Matching Nash Equilibria; however, it is NP-complete to decide their existence.\n-- In an Attacker Symmetric and Uniform Nash equilibrium, all attackers have a common support on which each uses a uniform distribution. We prove that they can be computed in polynomial time and incur a Price of Defense of either |V|/2 or \\alpha(G).","authors":["Marios Mavronicolas","Loizos Michael","Vicky Papadopoulou","Anna Philippou"],"meta":["August 2006","DOI:10.1007/11821069_62","SourceDBLP","Conference: 31st International Symposium on Mathematical Foundations of Computer Science (MFCS 2006)At: Stara Lesna, SlovakiaVolume: Lecture Notes in Computer Science (LNCS) 4162, pages 717-728","Project: Collectiveness in Nature, Society, and Computing"],"references":["226492146_Maximum_skew-symmetric_flows","226310648_Maximum_Skew-Symmetric_Flows_and_Matchings","287012375_Worst-case_equilibria_in_Symposium_on_Theoretical_Aspects_of_Computer_Science","240368434_Uber_extreme_Punkt-und_Kantenmengen","230873253_Non-Cooperative_Games","228108257_Non-Cooperative_Games","228108244_Zur_Theorie_der_Gesellschaftspiele","228057735_Computers_And_Intractability_A_Guide_to_the_Theory_of_NP-Completeness","226584520_Zur_Theorie_der_Gesellschaftsspiele","222808307_The_Complexity_of_Computing_the_Permanent"]}