{"id":"220970456_Traffic_Classification_Using_Clustering_Algorithms","abstract":"Classication of network trafc using port-based or payload-based analysis is becoming increasingly difcult with many peer-to-peer (P2P) applications using dynamic port numbers, masquerading tech- niques, and encryption to avoid detection. An alternative approach is to classify trafc by exploiting the distinctive characteristics of applications when they communicate on a network. We pursue this latter approach and demonstrate how cluster analysis can be used to effectively identify groups of trafc that are similar using only transport layer statistics. Our work considers two unsupervised clustering algorithms, namely K-Means and DBSCAN, that have previously not been used for network trafc classication. We eval- uate these two algorithms and compare them to the previously used AutoClass algorithm, using empirical Internet traces. The experi- mental results show that both K-Means and DBSCAN work very well and much more quickly then AutoClass. Our results indicate that although DBSCAN has lower accuracy compared to K-Means and AutoClass, DBSCAN produces better clusters.","authors":["Jeffrey Erman","Martin F. Arlitt","Anirban Mahanti"],"meta":["January 2006","DOI:10.1145/1162678.1162679","SourceDBLP","Conference: Proceedings of the 2nd Annual ACM Workshop on Mining Network Data, MineNet 2006, Pisa, Italy, September 15, 2006"],"references":["221596607_Internet_traffic_classification_using_Bayesian_analysis_techniques","221164762_BLINC_Multilevel_Traffic_Classification_in_the_Dark","220970465_ACAS_Automated_construction_of_application_signatures","220850310_Toward_the_Accurate_Identification_of_Network_Applications","220850213_Flow_Clustering_Using_Machine_Learning_Techniques","285028466_Cluster_analysis_and_display_of_genome-wide_expression_patterns","221995817_Maximum_Likelihood_from_Incomplete_Data_Via_EM_Algorithm","221900847_Data_Mining_Practical_Machine_Learning_Tools_And_Techniques","221653977_A_Density-Based_Algorithm_for_Discovering_Clusters_in_Large_Spatial_Databases_with_Noise","221022125_Accurate_scalable_in-network_identification_of_P2P_Traffic_using_application_signatures"]}