{"id":"220926435_Exposure_in_Wireless_Ad-hoc_Sensor_Networks","abstract":"Wireless ad-hoc sensor networks will provide one of the missing connections between the Internet and the physical world. One of the fundamental problems in sensor networks is the calculation of coverage. Exposure is directly related to coverage in that it is a measure of how well an object, moving on an arbitrary path, can be observed by the sensor network over a period of time.\nIn addition to the informal definition, we formally define exposure and study its properties. We have developed an efficient and effective algorithm for exposure calculation in sensor networks, specifically for finding minimal exposure paths. The minimal exposure path provides valuable information about the worst case exposure-based coverage in sensor networks. The algorithm works for any given distribution of sensors, sensor and intensity models, and characteristics of the network. It provides an unbounded level of accuracy as a function of run time and storage. We provide an extensive collection of experimental results and study the scaling behavior of exposure and the proposed algorithm for its calculation.","authors":["Seapahn Meguerdichian","Farinaz Koushanfar","Gang Qu","Miodrag Potkonjak"],"meta":["July 2001","DOI:10.1145/381677.381691","SourceDBLP","Conference: Proceedings of the 7th annual international conference on Mobile computing and networking"],"references":["291102287_Power-Conscious_Design_of_Wireless_Circuits_and_Systems","251800739_Global_error-tolerant_algorithms_for_location_discovery_in_ad-hoc_wireless_Netoworks","247932032_The_Mobile_Communications_Handbook","247442902_Introduction_To_Algorithms","245576233_Automatic_Vehicle_Locaiton-An_Overview","242370470_Embedding_the_Internet_Wireless_integrated_network_sensors","238750511_An_integrated_method_for_comprehensive_sensor_network_development_in_complex_power_plant_systems","234797419_Wireless_Integrated_Network_Sensors_WINS","234778003_The_Design_and_Implementation_of_an_Intentional_Naming_System","222244289_Generic_interface_chip_for_capacitive_sensors_in_low-power_multi-parameter_microsystems"]}