{"id":"220924572_Effective_self-training_author_name_disambiguation_in_scholarly_digital_libraries","abstract":"Name ambiguity in the context of bibliographic citation records is a hard problem that affects the quality of services and content in digital libraries and similar systems. Supervised methods that exploit training examples in order to distinguish ambiguous author names are among the most effective solutions for the problem, but they require skilled human annotators in a laborious and continuous process of manually labeling citations in order to provide enough training examples. Thus, addressing the issues of (i) automatic acquisition of examples and (ii) highly effective disambiguation even when only few examples are available, are the need of the hour for such systems. In this paper, we propose a novel two-step disambiguation method, SAND (Self-training Associative Name Disambiguator), that deals with these two issues. The first step eliminates the need of any manual labeling effort by automatically acquiring examples using a clustering method that groups citation records based on the similarity among coauthor names. The second step uses a supervised disambiguation method that is able to detect unseen authors not included in any of the given training examples. Experiments conducted with standard public collections, using the minimum set of attributes present in a citation (i.e., author names, work title and publication venue), demonstrated that our proposed method outperforms representative unsupervised disambiguation methods that exploit similarities between citation records and is as effective as, and in some cases superior to, supervised ones, without manually labeling any training example.","authors":["Anderson A. Ferreira","Adriano Veloso","Marcos André Gonçalves","Alberto H. F. Laender"],"meta":["January 2010","DOI:10.1145/1816123.1816130","SourceDBLP","Conference: Proceedings of the 2010 Joint International Conference on Digital Libraries, JCDL 2010, Gold Coast, Queensland, Australia, June 21-25, 2010"],"references":["285843397_Mining_association_rules_between_set_of_items_in_largedatabases","277287559_Self-Organizing-Maps_with_BIC_for_Speaker_Clustering","313606501_Mining_Association_rules_between_sets_of_items_in_large_databases","312538118_Support-vector_networks","307881957_LIBSVM_A_library_for_support_vector_machines","301222514_Modern_Information_Retrieval","272353458_Unsupervised_name_disambiguation_via_social_network_similarity","271513141_Support_Vector_Networks","270254399_Predictive_Inference_An_Introduction","268664872_Predictive_Inference_An_Introduction"]}