{"id":"220933914_Towards_OLAP_Security_Design_-_Survey_and_Research_Issues","abstract":"With the use of data warehousing and online analytical processing (OLAP) for decision support applications new security issues arise. The goal of this paper is to introduce an OLAP security design methodology, pointing out fields that require further research work. We present possible access control requirements categorized by their complexity. OLAP security mechanisms and their implementations in commercial systems are presented and checked for their suitability to address the requirements. Traditionally data warehouses were queried by high level users (executive management, business analysts) only. As the range of potential users with data warehouse access is steadily growing, this assumption is no longer appropriate and the necessity of proper access control mechanisms arises. However, a data warehouse is primarily built as an open system. Especially exploratory OLAP analysis requires this open nature; security controls may hinder the analytical discovery process. Keywords Data warehouse, OLAP, security, access control, design. 1.","authors":["Torsten Priebe","Günther Pernul"],"meta":["January 2000","DOI:10.1145/355068.355313","SourceDBLP","Conference: Proceedings of the 3rd ACM international workshop on Data warehousing and OLAP"],"references":["221495529_Identifying_Security_Holes_in_OLAP_Applications","3764413_A_prototype_model_for_data_warehouse_security_based_on_metadata","2615005_Security_Administration_for_Federations_Warehouses_and_Other_Derived_Data","262312478_Hackers_crackers_and_spooks_ensuring_that_your_data_warehouse_is_secure","234782862_Microsoft_OLAP_solutions","221495209_Security_Issues_in_Data_Warehousing_and_Data_Mining_Panel_Discussion","221269442_Extending_the_ER_Model_for_the_Multidimensional_Paradigm","220662936_Database_Security","220416036_Dayal_U_An_overview_of_data_warehousing_and_OLAP_technology_ACM_Sigmod_Record_261_65-74","2959303_Inference_Controls_for_Statistical_Databases"]}