{"id":"220962944_On_the_Design_of_Codes_for_DNA_Computing","abstract":"In this paper, we describe a broad class of problems arising in the context of designing codes for DNA computing. We primarily fo- cus on design considerations pertaining to the phenomena of secondary structure formation in single-stranded DNA molecules and non-selective cross-hybridization. Secondary structure formation refers to the tendency of single-stranded DNA sequences to fold back upon themselves, thus becoming inactive in the computation process, while non-selective cross- hybridization refers to unwanted pairing between DNA sequences in- volved in the computation process. We use the Nussinov-Jacobson algo- rithm for secondary structure prediction to identify some design criteria that reduce the possibility of secondary structure formation in a code- word. These design criteria can be formulated in terms of constraints on the number of complementary pair matches between a DNA codeword and some of its shifts. We provide a sampling of simple techniques for enumerating and constructing sets of DNA sequences with properties that inhibit non-selective hybridization and secondary structure forma- tion. Novel constructions of such codes include using cyclic reversible extended Goppa codes, generalized Hadamard matrices, and a binary mapping approach. Cyclic code constructions are particularly useful in light of the fact we prove that the presence of a cyclic structure reduces the complexity of testing DNA codes for secondary structure formation.","authors":["Olgica Milenkovic","Navin Kashyap"],"meta":["January 2005Lecture Notes in Computer Science","DOI:10.1007/11779360_9","SourceDBLP","Conference: Coding and Cryptography, International Workshop, WCC 2005, Bergen, Norway, March 14-18, 2005. Revised Selected Papers"],"references":["284777052_On_combinatorial_DNA_word_design","316520114_Breaking_DES_using_a_molecular_computer","268309815_Computational_molecular_biology_An_introduction","258239683_The_theory_of_error-correcting_codes_Parts_I_II","256647400_Spaces_of_RNA_Secondary_Structures","247004921_On_extending_Goppa_codes_to_cyclic_codes","245964563_DNA_Computing_by_Self-Assembly","244445571_Breaking_DES_Using_a_Molecular_Computer","243772764_Binary_codes_capable_of_correcting_insertions_and_reversals","242825963_Computational_Molecular_Biology_An_Introduction"]}