{"id":"220981068_Arabic_calligraphy_classification_using_triangle_model_for_Digital_Jawi_Paleography_analysis","abstract":"Calligraphy classification of the ancient manuscripts gives useful information to paleographers. Researches on digital paleography using calligraphy are done on the manuscripts to identify unidentified place of origin, number of writers, and the date of ancient manuscripts. Information that are used are features from characters, tangent value and features known as Grey-Level Co-occurrence Matrix (GLCM). For Digital Jawi Paleography, a novel technique is proposed based on the triangle. This technique defines three important coordinates in the image of each character and translates it into triangle geometry form. The features are extracted from the triangle to represent the Jawi (Arabic writing in Malay language) characters. Experiments have been conducted using seven Unsupervised Machine Learning (UML) algorithms and one Supervised Machine Learning (SML). This stage focuses on the accuracy of Arabic calligraphy classification. Hence, the model and test data are Arabic calligraphy letters taken from calligraphy books. The number of model is 711 for the UML and 1019 for the SML. Twelve features are extracted from the formed triangles used.","authors":["Mohd Sanusi Azmi","Khairuddin Omar","Mohammad Faidzul Nasrudin","Azah Muda"],"meta":["December 2011","DOI:10.1109/HIS.2011.6122194","SourceDBLP","Conference: 11th International Conference on Hybrid Intelligent Systems, HIS 2011, Melacca, Malaysia, December 5-8, 2011","Project: Jawi Subword Handwritten Recognition using Shared Representation Learning"],"references":["319306359_Batu_Bersurat_Terengganu_Perspektif_Geometri_Segi_Tiga","268371736_Digital_palaeography_using_the_digital_representation_of_medieval_script_to_support_palaeographic_analysis","4054888_Classification_of_Hebrew_Calligraphic_Handwriting_Styles_Preliminary_Results","2872578_SPI_A_System_for_Paleographic_Inspections","252026831_Digital_paleography_Using_the_digital_representation_of_Jawi_manuscripts_to_support_paleographic_analysis","221013559_Arabic_calligraphy_identification_for_Digital_Jawi_Paleography_using_triangle_blocks","4232718_Image_analysis_for_palaeography_inspection"]}