{"id":"220915842_The_On-Line_Encyclopedia_of_Integer_Sequences","abstract":"The On-Line Encyclopedia of Integer Sequences (or OEIS) is a database of some 130000 number sequences. It is freely available on the Web (http://www.research.att.com/~njas/sequences/) and is widely used.\nThere are several ways in which it benefits research:\n1\nIt serves as a dictionary, to tell the user what is known about a particular sequence. There are hundreds of papers which thank the OEIS for assistance in this way.\n1\nThe associated Sequence Fans mailing list is a worldwide network which has evolved into a powerful machine for tackling new problems.\n1\nAs a direct source of new theorems, when a sequence arises in two different contexts.\n1\nAs a source of new research, when one sees a sequence in the OEIS that cries out to be analyzed.\nThe 40-year history of the OEIS recapitulates the story of modern computing, from punched cards to the internet.\nThe talk will be illustrated with numerous examples, emphasizing new sequences that have arrived in the past few months. Many open problems will be mentioned.\nBecause of the profusion of books and journals, volunteers play an important role in maintaining the database. If you come across an interesting number sequence in a book, journal or web site, please send it and the reference to the OEIS. (You do not need to be the author of the sequence to do this.) There is a web site for sending in ”Comments” or ”New sequences”.\nSeveral new features have been added to the OEIS in the past year. Thanks to the work of Russ Cox, searches are now performed at high speed, and thanks to the work of Debby Swayne, there is a button which displays plots of each sequence. Finally, a ”listen” button enables one to hear the sequence played on a musical instrument (try Recamáan’s sequence A005132!).","authors":["N. J. A. Sloane"],"meta":["January 2007Notices of the American Mathematical Society 1:130","DOI:10.1007/978-3-540-73086-6_12","SourceDBLP","Conference: Towards Mechanized Mathematical Assistants, 14th Symposium, Calculemus 2007, 6th International Conference, MKM 2007, Hagenberg, Austria, June 27-30, 2007, Proceedings"],"references":["265730158_Numerical_Analogues_of_Aronson's_Sequence","324422577_How_to_do_Monthly_Problems_With_Your_Computer","280445519_The_Encyclopedia_of_Integer_Sequences","277416849_GFUN_A_Maple_Package_for_the_Manipulation_of_Generating_and_Holonomic_Functions_in_One_Variable","275858379_The_Encyclopedia_of_Integer_Sequences","275620382_A_Handbook_of_Integer_Sequences","265371181_A_Handbook_of_Integer_Sequences","248422458_What_is_the_best_way_to_lace_your_shoes","246339018_Grandes_valeurs_de_la_fonction_somme_des_diviseurs_et_hypothese_de_Riemann","245276923_An_algorithm_to_compute_generalized_Pad'e-Hermite_forms"]}