{"id":"221005540_McPAT_An_integrated_power_area_and_timing_modeling_framework_for_multicore_and_manycore_architectures","abstract":"This paper introduces McPAT, an integrated power, area, and timing modeling framework that supports comprehen- sive design space exploration for multicore and manycore processor configurations ranging from 90nm to 22nm and beyond. At the microarchitectural level, McPAT includes models for the fundamental components of a chip multipro- cessor, including in-order and out-of-order processor cores, networks-on-chip, shared caches, integrated memory con- trollers, and multiple-domain clocking. At the circuit and technology levels, McPAT supports critical-path timing mod- eling, area modeling, and dynamic, short-circuit, and leak- age power modeling for each of the device types forecast in the ITRS roadmap including bulk CMOS, SOI, and double- gate transistors. McPAT has a flexible XML interface to facilitate its use with many performance simulators. Combined with a performance simulator, McPAT enables architects to consistently quantify the cost of new ideas and assess tradeoffs of different architectures using new metrics like energy-delay-area2 product (EDA2P) and energy-delay- area product (EDAP). This paper explores the interconnect options of future manycore processors by varying the degree of clustering over generations of process technologies. Clus- tering will bring interesting tradeoffs between area and per- formance because the interconnects needed to group cores into clusters incur area overhead, but many applications can make good use of them due to synergies of cache shar- ing. Combining power, area, and timing results of McPAT with performance simulation of PARSEC benchmarks at the 22nm technology node for both common in-order and out- of-order manycore designs shows that when die cost is not taken into account clustering 8 cores together gives the best energy-delay product, whereas when cost is taken into ac- count configuring clusters with 4 cores gives the best EDA2P and EDAP.","authors":["Sheng Li","Jung Ho Ahn","Richard D. Strong","Jay B. Brockman"],"meta":["January 2009","DOI:10.1145/1669112.1669172","SourceDBLP","Conference: 42st Annual IEEE/ACM International Symposium on Microarchitecture (MICRO-42 2009), December 12-16, 2009, New York, New York, USA"],"references":["286211411_Power_and_Thermal_Management_in_the_Intel_Core_Duo_Processor","239595712_HotLeakage_A_Temperature-Aware_Model_of_Subthreshold_and_Gate_Leakage_for_Architects","234791111_The_SimpleScalar_tool_set_version_20","228674742_McPAT_10_An_Integrated_Power_Area_and_Timing_Modeling_Framework_for_Multicore_Architecture","261350470_A_Power-Efficient_High-Throughput_32-Thread_SPARC_Processor","248011398_The_SimpleScalar_Tool_Set_Version_2","245929226_Digital_Integrated_Circuit-A_Design_Perspective","242637573_The_microarchitecture_of_the_Pentium_4_processor","238681012_Digital_Integrated_Circuits_A_Design_Perspective","234801534_The_SPLASH-2_Programs_Characterization_and_Methodological_Considerations"]}