{"id":"221013843_A_process_for_building_domain_ontology_An_experience_in_developing_Solat_ontology","abstract":"during the previous years, there has been a growing concern on ontology due to its ability to explicitly describe data semantics in a common way, with independent data source characteristics and to provide a schema that allows data interchanging among heterogeneous information systems and users. Several works have been aimed to improve ontology technological aspects, like languages representation and inference mechanisms, but less attention has been paid to the aspect of practical results of application development method. In this paper we present a discussion on the process and the product of an experience in developing ontologies in the field of Islamic knowledge which focuses on the Solat. This is done as a prototype to ensure what should be considered if a larger domain of knowledge of Islam itself is applied. It is because in generating a relevant knowledge of Islam, a number of sources involved and should be used to understand the essence and truth of such information. Accordingly, utilization of any other sources depend on the prior knowledge of the Qur'an. The Qur'an is the criterion and standard reference for judging all other sources. The Muslims judge hadith and sunnah in the light of the Qur'an. They can accept them only when they are in accordance with the Qur'an, otherwise they will not accept them. This is a primary resource in order to develop a semantic Knowledge of Islam. The secondary sources of the Islamic Knowledge are Qiyas - analogy - and Ijma - consensus. We extract all this information with the guidance from the domain expert and build an ontology for solat according to the methodology that being identified suitable for developing semi automatic ontology creation.","authors":["Saidah Saad","Naomie Salim","Hakim Zainal","Zurina Muda"],"meta":["July 2011","DOI:10.1109/ICEEI.2011.6021572","SourceDBLP","Conference: International Conference on Electrical Engineering and Informatics, ICEEI 2011, Bandung, Indonesia, 17-19 July, 2011"],"references":["302937543_Ontologies_Principles_methods_and_applications","243772462_Ontology_Development_101_A_Guide_to_Creating_Your_First_Ontology","211921623_A_Framework_for_Ontology_Creation_and_Management_for_Semantic_Web","2601385_Gruninger_M_Ontologies_Principles_methods_and_applications_Knowledge_Eng_Rev_112_93-155"]}