{"id":"221015892_A_Formal_Model_of_Obfuscation_and_Negotiation_for_Location_Privacy","abstract":"Obfuscation concerns the practice of deliberately degrading the quality of information in some way, so as to protect the privacy of the individual to whom that information refers. In this paper, we argue that obfuscation is an important technique for protecting an individual's location privacy within a pervasive computing environment. The paper sets out a formal framework within which obfuscated location-based ser- vices are defined. This framework provides a computationally efficient mechanism for balancing an individual's need for high-quality informa- tion services against that individual's need for location privacy. Nego- tiation is used to ensure that a location-based service provider receives only the information it needs to know in order to provide a service of satisfactory quality. The results of this work have implications for numer- ous applications of mobile and location-aware systems, as they provide a new theoretical foundation for addressing the privacy concerns that are acknowledged to be retarding the widespread acceptance and use of location-based services.","authors":["Matt Duckham","Lars Kulik"],"meta":["May 2005Lecture Notes in Computer Science 3468:152-170","DOI:10.1007/11428572_10","SourceDBLP","Conference: Pervasive Computing, Third International Conference, PERVASIVE 2005, Munich, Germany, May 8-13, 2005, Proceedings"],"references":["238437862_Anonymity_Unobservability_Pseudonymity_and_Identity_Management_-_A_Proposal_for_Terminology","228607651_Privacy_in_Context","228605392_A_lightweight_approach_to_managing_privacy_in_location-based_services","346956558_GIS_A_Computing_Perspective_Second_Edition","312973479_Anonymous_usage_of_location-based_services_through_spatial_and_temporal_cloaking","262291972_Anonymity_unobservability_and_pseudeonymity_-_a_proposal_for_terminology","246714292_Location_Systems_for_Ubiquitous_Computing_Computer_Issue_on_Location_Aware_Computing","244998199_A_Presence-based_GEOPRIV_Location_Object_Format","234826172_Algorithms_in_Java_Part_5_Graph_Algorithms","228764469_GeoNotes_Social_and_Navigational_Aspects_of_Location-Based_Information_Systems"]}