{"id":"221076009_A_Bayesian_framework_for_optimal_motion_planning_with_uncertainty","abstract":"This paper considers the problem of planning a safe path for a mobile robot, in spite of noisy odometry and sensor readings. The difficulty in approaching this problem is twofold. Firstly, with respect to the regular path-planning problem, there is considerable more machinery needed to formalize uncertainty: this implies some design decisions even at the modeling stage. Then, the resulting model is a stochastic control problem which is very hard to solve in the general case, hence many approximations are needed to turn it into an approachable problem. This paper tries to solve the problem by working in the extended space of poses◊covariances, as has already been done in (1), (2). The following are the main contributions of this paper with respect to previous work. • We model the problem in a Bayesian framework and we formalize transitions between information states by using the Fisher information matrix. We look for the hypotheses that lead to a weak 'separation princi- ple': that is, a theoretical justification for splitting the stochastic control problem in separate implementations of planning, localization, and control. In particular, the use of the information matrix decouples planning and localization: the planned paths will be safe whatever localization algorithm is used (Kalman filters, particle filters, etc.), as long as it is statistically efficient. • We define our two algorithms as specializations of the same template, which is defined by a generic dominance relation 'D' and a generic precedence relation 'J'. We","authors":["Andrea Censi","Daniele Calisi","Alessandro De Luca","Giuseppe Oriolo"],"meta":["May 2008Proceedings - IEEE International Conference on Robotics and Automation","SourceDBLP","Conference: 2008 IEEE International Conference on Robotics and Automation, ICRA 2008, May 19-23, 2008, Pasadena, California, USA"],"references":["239840461_Robot_motion_planning_with_uncertainty","224705753_On_achievable_accuracy_for_range-finder_localization","321904895_Bayesian_bounds_for_parameter_estimation_and_nonlinear_filteringtracking","228339022_Algorithms_for_planning_under_uncertainty_in_prediction_and_sensing","225229215_Landmark-Based_Robot_Navigation","224773175_Coastal_Navigation_with_Mobile_Robots","224744505_Safe_path_planning_in_an_uncertain-configuration_space","224705308_Planning_with_Uncertainty_in_Position_Using_High-Resolution_Maps","224685569_Safe_Path_Planning_in_an_Uncertain-Configuration_Space_using_RRT","224669036_Planning_robust_motion_strategies_for_a_mobile_robot"]}