{"id":"221023493_Detecting_the_origin_of_text_segments_efficiently","abstract":"In the origin detection problem an algorithm is given a set S of documents, ordered by creation time, and a query doc- ument D. It needs to output for every consecutive sequence of k alphanumeric terms in D the earliest document in S in which the sequence appeared (if such a document exists). Algorithms for the origin detection problem can, for exam- ple, be used to detect the\"origin\"of text segments in D and thus to detect novel content in D. They can also find the document from which the author of D has copied the most (or show that D is mostly original.) We propose novel algorithms for this problem and evaluate them together with a large number of previously published algorithms. Our results show that (1) detecting the origin of text segments efficiently can be done with very high accuracy even when the space used is less than 1% of the size of the documents in S, (2) the precision degrades smoothly with the amount of available space, (3) various estimation techniques can be used to increase the performance of the algorithms.","authors":["Ossama Abdel-Hamid","Behshad Behzadi","Stefan Christoph","Monika Henzinger"],"meta":["January 2009","DOI:10.1145/1526709.1526719","SourceDBLP","Conference: Proceedings of the 18th International Conference on World Wide Web, WWW 2009, Madrid, Spain, April 20-24, 2009"],"references":["221653421_Understanding_Content_Reuse_on_the_Web_Static_and_Dynamic_Analyses","221298956_Local_text_reuse_detection","316928083_Copy_Detection_Mechanisms_for_Digital_Documents","242608934_Fingerprinting_by_Random_Polynomials","234825122_Copy_detection_mechanisms_for_digital_documents","222391121_Syntactic_Clustering_of_the_Web","221613759_Redundant_documents_and_search_effectiveness","221520142_Finding_text_reuse_on_the_web","221299744_Finding_near-duplicate_web_pages_A_large-scale_evaluation_of_algorithms","221240576_The_Case_of_the_Duplicate_Documents_Measurement_Search_and_Science"]}