{"id":"221166403_Encountering_Stronger_Password_Requirements_User_Attitudes_and_Behaviors","abstract":"Text-based passwords are still the most commonly used authentication mechanism in information systems. We took advantage of a unique opportunity presented by a significant change in the Carnegie Mellon University (CMU) computing services password policy that required users to change their passwords. Through our survey of 470 CMU computer users, we collected data about behaviors and practices related to the use and creation of passwords. We also captured users' opinions about the new, stronger policy requirements. Our analysis shows that, although most of the users were annoyed by the need to create a complex password, they believe that they are now more secure. Furthermore, we perform an entropy analysis and discuss how our findings relate to NIST recommendations for creating a password policy. We also examine how users answer specific questions related to their passwords. Our results can be helpful in designing better password policies that consider not only technical aspects of specific policy rules, but also users' behavior in response to those rules.","authors":["Richard Shay","Saranga Komanduri","Patrick Gage Kelley","Pedro Giovanni Leon"],"meta":["September 2010","DOI:10.1145/1837110.1837113","SourceDBLP","Conference: Proceedings of the Sixth Symposium on Usable Privacy and Security, SOUPS 2010, Redmond, Washington, USA, July 14-16, 2010","Project: Secure, usable passwords"],"references":["234799064_Password_policy_The_good_the_bad_and_the_ugly","225175012_A_comprehensive_simulation_tool_for_the_analysis_of_password_policies","221517955_The_true_cost_of_unusable_password_policies","221474693_Order_and_entropy_in_picture_passwords","221305496_Password_policy_simulation_and_analysis","235418978_A_Mathematical_Theory_of_Communication","234816582_Attitudes_and_practices_of_students_towards_password_security","223201064_The_usability_of_passphrases_for_authentication_An_empirical_field_study","222542034_Improving_password_security_and_memorability_to_protect_personal_and_organizational_information","222304661_Improving_system_security_via_proactive_password_checking"]}