{"id":"221164420_Virtual_ring_routing_Network_routing_inspired_by_DHTs","abstract":"This paper presents Virtual Ring Routing (VRR), a new network routing protocol that occupies a unique point in the design space. VRR is inspired by overlay routing algorithms in Distributed Hash Tables (DHTs) but it does not rely on an underlying network routing protocol. It is implemented directly on top of the link layer. VRR provides both traditional point-to-point network routing and DHT routing to the node responsible for a hash table key. VRR can be used with any link layer technology but this paper describes a design and several implementations of VRR that are tuned for wireless networks. We evaluate the performance of VRR using simulations and measurements from a sensor network and an 802.11a testbed. The experimental results show that VRR provides robust performance across a wide range of environments and work- loads. It performs comparably to, or better than, the best wireless routing protocol in each experiment. VRR performs well because of its unique features: it does not require network flooding or trans- lation between fixed identifiers and location-dependent addresses.","authors":["Matthew Caesar","Miguel Castro","Edmund B. Nightingale","Greg O'Shea"],"meta":["October 2006ACM SIGCOMM Computer Communication Review 36(4):351-362","DOI:10.1145/1159913.1159954","SourceDBLP","Conference: Proceedings of the ACM SIGCOMM 2006 Conference on Applications, Technologies, Architectures, and Protocols for Computer Communications, Pisa, Italy, September 11-15, 2006"],"references":["269031340_The_nesC_Language_A_Holistic_Approach_to_Networked_Embedded_Systems","248700451_Host_Identity_Protocol_HIP_architecture","244445366_The_secure_routing_protocol_SRP_for_ad_hoc_networks_IETF_Internet_Draft","299267832_The_Sybil_attack","280287730_A_High-Throughput_Path_Metric_for_Multi-Hop_Wireless_Routing","251322440_L_Scalable_Landmark_Routing_and_Address_Lookup_for_Multi-Hop_Wireless_Networks","246597611_Kademlia_A_peer-to-peer_information_system_based_on_the_XOR_metric","246377146_Highly_Dynamic_Destination-sequenced_Distance-vector_Routing_DSDV_for_Mobile_Computers","244505980_Temporally_Ordered_Routing_Algorithm_TORA_version_1_Functional_specification_Internet-Draft","243544152_Multicast_using_ad-hoc_on-demand_distance_vector_routing"]}