{"id":"221159505_Fuzzy_Semantic-Based_String_Similarity_for_Extrinsic_Plagiarism_Detection_Lab_Report_for_PAN_at_CLEF_2010","abstract":"This report explains our plagiarism detection method using fuzzy semantic-based string similarity approach. The algorithm was developed through four main stages. First is pre-processing which includes tokenisation, stemming and stop words removing. Second is retrieving a list of candidate documents for each suspicious document using shingling and Jaccard coefficient. Suspicious documents are then compared sentence-wise with the associated candidate documents. This stage entails the computation of fuzzy degree of similarity that ranges between two edges: 0 for completely different sentences and 1 for exactly identical sentences. Two sentences are marked as similar (i.e. plagiarised) if they gain a fuzzy similarity score above a certain threshold. The last step is post-processing whereby consecutive sentences are joined to form single paragraphs/sections. Our performance measures on PAN’09 training corpus for external plagiarism detection task (recall=0.3097, precision=0.5424, granularity=7.8867) indicates that about 54 % of our detections are correct while we detect only 30 % of the plagiarism cases. The performance measures on PAN’10 test collection is less (recall = 0.1259, precision = 0.5761, granularity = 3.5828), due to the fact that our algorithm handles external plagiarism detection but neither intrinsic nor cross-lingual. Although our fuzzy semantic-based method can detect some means of obfuscation, it might not work at all levels. Our future work is to improve it for more detection efficiency and less time complexity. In particular, we need to advance the post-processing stage to gain more ideal granularity. 1","authors":["Salha Alzahrani","Naomie Salim"],"meta":["October 2010","SourceDBLP","Conference: CLEF 2010 LABs and Workshops, Notebook Papers, 22-23 September 2010, Padua, Italy"],"references":["232645326_Sentence_Similarity_Based_on_Semantic_Nets_and_Corpus_Statistics","225216293_Using_Word_Clusters_to_Detect_Similar_Web_Documents","224597607_On_the_Use_of_Fuzzy_Information_Retrieval_for_Gauging_Similarity_of_Arabic_Documents","221087240_A_Sentence-Based_Copy_Detection_Approach_for_Web_Documents","220017707_An_algoritm_for_suffix_stripping","200044309_WordNet_A_Lexical_Database_for_English"]}