{"id":"221166436_Human_selection_of_mnemonic_phrase-based_passwords","abstract":"Textual passwords are often the only mechanism used to authenticate users of a networked system. Unfortunately, many passwords are easily guessed or cracked. In an attempt to strengthen passwords, some systems instruct users to create mnemonic phrase-based passwords. A mnemonic password is one where a user chooses a memorable phrase and uses a character (often the first letter) to represent each word in the phrase. In this paper, we hypothesize that users will select mnemonic phrases that are commonly available on the Internet, and that it is possible to build a dictionary to crack mnemonic phrase-based passwords. We conduct a survey to gather user-generated passwords. We show the majority of survey respondents based their mnemonic passwords on phrases that can be found on the Internet, and we generate a mnemonic password dictionary as a proof of concept. Our 400,000-entry dictionary cracked 4% of mnemonic passwords; in comparison, a standard dictionary with 1.2 million entries cracked 11% of control passwords. The user- generated mnemonic passwords were also slightly more resistant to brute force attacks than control passwords. These results suggest that mnemonic passwords may be appropriate for some uses today. However, mnemonic passwords could become more vulnerable in the future and should not be treated as a panacea.","authors":["Kuo Cynthia","Sasha Romanosky","Lorrie Cranor"],"meta":["January 2006","DOI:10.1145/1143120.1143129","SourceDBLP","Conference: Proceedings of the 2nd Symposium on Usable Privacy and Security, SOUPS 2006, Pittsburgh, Pennsylvania, USA, July 12-14, 2006"],"references":["238731788_Users_are_not_the_enemy_Why_users_compromise_security_mechanisms_and_how_to_take_remedial_measures","235061410_A_Random_Word_Generator_for_Pronounceable_Passwords","228582920_Ten_strikes_and_you're_out_Increasing_the_number_of_login_attempts_can_improve_password_usability","4207371_Have_the_cake_and_eat_it_too_-_Infusing_usability_into_text-password_based_authentication_systems","2404434_Transforming_the_'Weakest_Link'_-_a_HumanComputer_Interaction_Approach_to_Usable_and_Effective_Security","247811625_''Foiling_the_Cracker''_y_A_Survey_of_and_Improvements_to_Password_Securit","220615352_Cognitive_passwords_The_key_to_easy_access_control","220614472_Pass-sentence-_a_new_approach_to_computer_code","3437636_Password_Memorability_and_Security_Empirical_Results","2643425_The_Memorability_and_Security_of_Passwords_-_Some_Empirical_Results","2304236_A_New_Attack_on_Random_Pronounceable_Password_Generators"]}