{"id":"221173341_A_Massively_Parallel_FPGA-based_Coprocessor_for_Support_Vector_Machines","abstract":"We present a massively parallel FPGA-based coprocessor for Support Vector Machines (SVMs), a machine learning algorithm whose applications include recognition tasks such as learning scenes, situations and concepts, and reasoning tasks such as analyzing the recognized scenes and semantics. The coprocessor architecture, targeted at both SVM training and classification, is based on clusters of vector processing elements (VPEs) operating in single-instruction multiple data (SIMD) mode to take advantage of large amounts of data parallelism in the application. We use the FPGA's DSP elements as parallel multiply-accumulators (MACs), a core computation in SVMs. A key feature of the architecture is that it is customized to low precision arithmetic which permits one DSP unit to perform two or more MACs in parallel. Low precision also reduces the required number of parallel off-chip memory accesses by packing multiple data words on the FPGA-memory bus. We have built a prototype using an off-the-shelf PCI-based FPGA card with a Xilinx Virtex 5 FPGA and 1 GB DDR2 memory. For SVM training, we observe application-level end-to-end computation speeds of over 9 billion multiply-accumulates per second (GMACs). For SVM classification, using data packing, the application speed increases to 14 GMACs. The FPGA-based system is about 20times faster than a dual Opteron 2.2 GHz processor CPU, and dissipates around 10 W of power.","authors":["Hari Cadambi","Igor Durdanovic","Venkata Jakkula","Murugan Sankaradass"],"meta":["January 2009","DOI:10.1109/FCCM.2009.34","SourceDBLP","Conference: FCCM 2009, 17th IEEE Symposium on Field Programmable Custom Computing Machines, Napa, California, USA, 5-7 April 2009, Proceedings"],"references":["234786663_Fast_Training_of_Support_Vector_Machines_Using_Sequential_Minimal_Optimization","221618269_A_Massively_Parallel_Digital_Learning_Processor","221617998_Map-Reduce_for_Machine_Learning_on_Multicore","270034913_Book_Review_The_Nature_of_Statistical_Learning_Theory","264713616_Generalized_learning_vector_quantization","257985113_Large_scale_parallel_SVM_implementation","243763580_The_Nature_Of_Statistical_Learning_Theory","236736807_Estimation_of_Dependences_Based_on_Empirical_Data","221997108_Estimation_of_Dependence_Based_on_Empirical_Data","221997066_The_Nature_of_Satistical_Learning_Theory"]}