{"id":"221103553_PROUD_A_PRObabilistic_approach_to_processing_similarity_queries_over_Uncertain_Data_streams","abstract":"We present PROUD -- A PRObabilistic approach to processing similarity queries over Uncertain Data streams, where the data streams here are mainly time series streams. In contrast to data with certainty, an uncertain series is an ordered sequence of random variables. The distance between two uncertain series is also a random variable. We use a general uncertain data model, where only the mean and the deviation of each random variable at each timestamp are available. We derive mathematical conditions for progressively pruning candidates to reduce the computation cost. We then apply PROUD to a streaming environment where only sketches of streams, like wavelet synopses, are available. Extensive experiments are conducted to evaluate the effectiveness of PROUD and compare it with Det, a deterministic approach that directly processes data without considering uncertainty. The results show that, compared with Det, PROUD offers a flexible trade-off between false positives and false negatives by controlling a threshold, while maintaining a similar computation cost. In contrast, Det does not provide such flexibility. This trade-off is important as in some applications false negatives are more costly, while in others, it is more critical to keep the false positives low.","authors":["Mi-Yen Yeh","Kun-Lung Wu","Philip S. Yu","Ming-Syan Chen"],"meta":["March 2009","DOI:10.1145/1516360.1516439","SourceDBLP","Conference: EDBT 2009, 12th International Conference on Extending Database Technology, Saint Petersburg, Russia, March 24-26, 2009, Proceedings"],"references":["244625020_10106_Worlds_and_Beyond_Efficient_Representation_and_Processing_of_Incomplete_Information","228789500_LeeWave_Levelwise_distribution_of_wavelet_coefficients_for_processing_kNN_queries_over_distributed_streams","228767821_ULDBs_Databases_with_uncertainty_and_lineage","262324165_Evaluating_Probabilistic_Queries_over_Imprecise_Data","262206804_StatStream_Statistical_Monitoring_of_Thousands_of_Data_Streams_in_Real_Time","246780128_MathWorld-A_Wolfram_Web_Resource","239331328_A_Note_on_the_Delta_Method","221654644_Wavelet_synopsis_for_data_streams_minimizing_non-euclidean_error","221613528_Efficient_range-constrained_similarity_search_on_wavelet_synopses_over_multiple_streams","221559520_Estimating_statistical_aggregates_on_probabilistic_data_streams"]}