{"id":"221179067_A_Smart_Object_Approach_To_Hybrid_Knowledge_Representation_and_Reasoning","abstract":"Human reasoning about non-trivial real world problems is a complex activity that frequently incorporates multiple reasoning strategies, concerning multiple domains of knowledge which may be perceived as having different structures. This paper proposes the use of the \"smart object paradigm\" for the design of complex knowledge based systems. The paradigm provides mechanisms for both hybrid knowledge representation and multiple inference strategies. ( 'entral to the paradigm is the concept of \"smart objects, \" engineered artifacts that combine a high level object structure with a rule based lower level language. The concept of smart objects was developed using criteria that evolved in the course of development of a large, complex knowledge based system. We present these criteria as desirable characteristics for KR s in general, and use them to evaluate traditional KI? 's and smart objects. An overview of a prototype KBS implemented using the smart object paradigm makes its benefits concrete.","authors":["William Kuechler","Nina Lim","Vijay Vaishnavi"],"meta":["January 1995","DOI:10.1109/HICSS.1995.375576","SourceDBLP","Conference: System Sciences, 1995. Vol. III. Proceedings of the Twenty-Eighth Hawaii International Conference onVolume: 3"],"references":["268978882_Logic_Programming","262311711_Knowledge_acquisition_in_expert_system_development","247410986_RIME_Preliminary_Work_Toward_a_Knowledge-Acquisition_Tool","243773511_Toward_a_Theory_of_The_Deep_Structure_of_Information_Systems","239566877_A_fundamental_tradeoff_in_knowledge_representation_and_reasoning","221598569_Guidelines_for_Evaluating_Classes_in_Data_Modeling","220855209_Representing_and_Manipulating_Knowledge_within_Worlds","220692213_Knowledge_representation_An_AI_perspective","220108462_Generic_Tasks_for_Knowledge-Based_Reasoning_The_Right_Level_of_Abstraction_for_Knowledge_Acquisition","30870654_Rule-Based_Systems"]}