{"id":"221260079_Malaria_Parasite_Detection_in_Peripheral_Blood_Images","abstract":"This paper investigates the possibility of computerised diagnosis of malaria and describes a method to detect malaria parasites (Plasmodium spp) in im- ages acquired from Giemsa-stained peripheral blood samples using conven- tional light microscopes. Prior to processing, the images are transformed to match a reference image colour characteristics. The parasite detector utilises a Bayesian pixel classifier to mark stained pixels. The class conditional prob- ability density functions of the stained and the non-stained classes are esti- mated using the non-parametric histogram method. The stained pixels are further processed to extract features (histogram, Hu moments, relative shape measurements, colour auto-correlogram) for a parasite/non-parasite classi- fier. A distance weighted K-nearest neighbour classifier is trained with the extracted features and a detailed performance comparison is presented. Our method achieves 74% sensitivity, 98% specificity, 88% positive prediction, and 95% negative prediction values for the parasite detection.","authors":["F. Boray Tek","Andrew G Dempster","Izzet Kale"],"meta":["January 2006","DOI:10.5244/C.20.36","SourceDBLP","Conference: Proceedings of the British Machine Vision Conference 2006, Edinburgh, UK, September 4-7, 2006","Project: Automated Malaria Diagnosis using mobile phones"],"references":["239745329_A_Colour_Normalization_Method_for_Giemsa-Stained_Blood_Cell_Images","224725683_Bayesian_marker_extraction_for_color_watershed_in_segmenting_microscopic_images","285340716_Linear_Discriminant_Analysis","283921280_Visual_Pattern_Recognition_by_Moment_Invariants","261584732_Statistical_Pattern_Recognition","247974232_The_reliability_of_blood_film_examination_for_malaria_at_the_peripheral_health_unit","245443288_Application_of_Mathematical_Morphology_to_Biomedical_Image_Processing","230675473_Morphological_Image_Analysis_New_York","225921910_Blood_Cell_Segmentation_Using_Minimum_Area_Watershed_and_Circle_Radon_Transformations","224112437_The_Distance-Weighted_k-Nearest-Neighbor_Rule"]}