{"id":"221209606_A_closer_look_at_tracing_explaining_and_code_writing_skills_in_the_novice_programmer","abstract":"The way in which novice programmers learn to write code is of considerable interest to computing education researchers. One research approach to understanding how beginners acquire their programming abilities has been to look at student performance in exams. Lopez et al. (2008) analyzed student responses to an end-of-first-semester exam. They found two types of questions accounted for 46% of the variance on the code writing portion of the same exam. One of those types of question required students to trace iterative code, while the other type required students to explain what a piece of code did. In this paper, we investigate whether the results by Lopez et al. may be generally indicative of something about novice programmers, or whether their results are just an artifact of their particular exam. We studied student responses to our own exam and our results are broadly consistent with Lopez et al. However, we did find that some aspects of their model are sensitive to the particular exam questions used. Specifically, we found that student performance on explaining code was hard to characterize, and the strength of the relationship between explaining and code writing is particularly sensitive to the specific questions asked. Additionally, we found Lopez et al.'s use of a Rasch model to be unnecessary, which will make it far easier for others to conduct similar research.","authors":["Anne Venables","Grace Tan","Raymond Lister"],"meta":["January 2009","DOI:10.1145/1584322.1584336","SourceDBLP","Conference: Proceedings of the Fifth International Workshop on Computing Education Research, ICER 2009, Berkeley, CA, USA, August 10-11, 2009"],"references":["228328573_Automated_assessment_in_CS1","220808137_Not_seeing_the_forest_for_the_trees_Novice_programmers_and_the_SOLO_taxonomy","220807623_Going_SOLO_to_assess_novice_programmers","220420651_Cognitive_Strategies_and_Looping_Constructs_An_Empirical_Study","242359877_Fragile_knowledge_and_neglected_strategies_in_novice_programmers","238724098_Contributing_factors_to_success_in_computer_science_a_study_of_gender_differences"]}