{"id":"221203602_Using_Guidelines_to_Constrain_Interactive_Case-Based_HTN_Planning","abstract":"This paper describes HICAP, a general-purpose, interactive case-based plan authoring architecture that can be applied to decision support tasks to yield a hierarchical course of action. It integrates a hierarchical task editor with a conversational case-based planner. HICAP maintains both a task hierarchy representing guidelines that constrain the final plan and the hierarchical social organization responsible for these tasks. It also supports bookkeeping, which is crucial for real-world large-scale planning tasks. By selecting tasks corresponding to the hierarchy’s leaf nodes, users can activate the conversational case-based planner to interactively refine guideline tasks into a concrete plan. Thus, HICAP can be used to generate context sensitive plans and should be useful for assisting with planning complex tasks such as noncombatant evacuation operations. We describe an experiment with a highly detailed military simulator to investigate this claim. The results show that plans generated by HICAP were superior to those generated by alternative approaches.","authors":["Héctor Muñoz-Avila","Daniel McFarlane","W. Aha","Len Breslow"],"meta":["July 1999","DOI:10.1007/3-540-48508-2_21","SourceDBLP","Conference: Case-Based Reasoning and Development, Third International Conference, ICCBR-99, Seeon Monastery, Germany, July 27-30, 1999, Proceedings"],"references":["235207531_Eastern_Exit_The_Noncombatant_Evacuation_Operation_NEO_From_Mogadishu_Somalia_in_January_1991","235182716_Requirements_for_Humanitarian_Assistance_and_Peace_Operations_Insights_From_Seven_Case_Studies","225238662_Activating_CBR_Systems_Through_Autonomous_Information_Gathering","248285105_Using_the_SIPE-2_Planning_System_A_Manual_for_SIPE-2","235102059_Noncombatant_Evacuation_Operations_--_Plan_Now_or_Pay_Later","225431649_Maintaining_Unstructured_Case_Bases","222219393_STRIPS_A_new_approach_to_the_application_of_theorem_proving_to_problem_solving","221606941_HICAP_An_Interactive_Case-Based_Planning_Architecture_and_its_Application_to_Noncombatant_Evacuation_Operations","221605574_A_Hybrid_Architecture_for_Real-Time_Mixed-Initiative_Planning_and_Control","221203665_Refining_Conversational_Case_Libraries"]}