{"id":"221202184_Live_and_Incremental_Whole-System_Migration_of_Virtual_Machines_Using_Block-Bitmap","abstract":"In this paper, we describe a whole-system live migration scheme, which transfers the whole system run-time state, including CPU state, memory data, and local disk storage, of the virtual machine (VM). To minimize the downtime caused by migrating large disk storage data and keep data integrity and consistency, we propose a three-phase migration (TPM) algorithm. To facilitate the migration back to initial source machine, we use an incremental migration (IM) algorithm to reduce the amount of the data to be migrated. Block-bitmap is used to track all the write accesses to the local disk storage during the migration. Synchronization of the local disk storage in the migration is performed according to the block-bitmap. Experiments show that our algorithms work well even when I/O-intensive workloads are running in the migrated VM. The downtime of the migration is around 100 milliseconds, close to shared-storage migration. Total migration time is greatly reduced using IM. The block-bitmap based synchronization mechanism is simple and effective. Performance overhead of recording all the writes on migrated VM is very low.","authors":["Yingwei Luo","Binbin Zhang","Xiaolin Wang","Zhenlin Wang"],"meta":["September 2008","DOI:10.1109/CLUSTR.2008.4663760","SourceDBLP","Conference: Proceedings of the 2008 IEEE International Conference on Cluster Computing, 29 September - 1 October 2008, Tsukuba, Japan"],"references":["220757638_Self-migration_of_operating_systems","3958192_Internet_suspendresume","2956142_Seamless_mobile_computing_on_fixed_infrastructure","222685178_Seamless_live_migration_of_virtual_machines_over_the_MANWAN","221137809_Live_wide-area_migration_of_virtual_machines_including_local_persistent_state","220881008_Fast_Transparent_Migration_for_Virtual_Machines","220832049_The_Collective_A_Cache-Based_System_Management_Architecture","2572003_Optimizing_the_Migration_of_Virtual_Computers"]}