{"id":"221234503_Air-dropped_Sensor_Network_for_Real-time_High-fidelity_Volcano_Monitoring","abstract":"This paper presents the design and deployment experience of an air-dropped wireless sensor network for volcano hazard monitoring. The deployment of ve stations into the rugged crater of Mount St. Helens only took one hour with a heli- copter. The stations communicate with each other through an amplied 802 :15:4 radio and establish a self-forming and self-healing multi-hop wireless network. The distance be- tween stations is up to 2 km. Each sensor station collects and delivers real-time continuous seismic, infrasonic, light- ning, GPS raw data to a gateway. The main contribution of this paper is the design and evaluation of a robust sen- sor network to replace data loggers and provide real-time long-term volcano monitoring. The system supports UTC- time synchronized data acquisition with 1ms accuracy, and is online congurable. It has been tested in the lab environ- ment, the outdoor campus and the volcano crater. Despite the heavy rain, snow, and ice as well as gusts exceeding 120 miles per hour, the sensor network has achieved a remark- able packet delivery ratio above 99% with an overall system uptime of about 93:8% over the 1:5 months evaluation period after deployment. Our initial deployment experiences with the system have alleviated the doubts of domain scientists and prove to them that a low-cost sensor network system can support real-time monitoring in extremely harsh envi- ronments.","authors":["Wen-Zhan Song","Renjie Huang","Mingsen Xu","Andy Ma"],"meta":["January 2009","DOI:10.1145/1555816.1555847","SourceDBLP","Conference: Proceedings of the 7th International Conference on Mobile Systems, Applications, and Services (MobiSys 2009), Kraków, Poland, June 22-25, 2009"],"references":["285599300_Energy-Efficient_Computing_for_Wildlife_Tracking_Design_Tradeoffs_and_Early_Experiences_with_ZebraNet","228946686_Cane-toad_monitoring_in_kakadu_national_park_using_wireless_sensor_networks","324375437_Monitoring_and_Mitigation_of_Volcano_Hazards","316141229_Monitoring_and_Mitigation_of_Volcano_Hazards","314721767_Energy-efficient_computing_for_wildlife_tracking_design_tradeoffs_and_early_experiences_with_ZebraNet","285605560_TreeMAC_Localized_TDMA_MAC_protocol_for_high-throughput_and_fairness_in_sensor_networks","252156309_OASIS_-_Optimized_Autonomous_Space_-_In-situ_Sensorweb","245037653_A_real-time_seismic_amplitude_measurement_system_RSAM_U","238576299_RSSI_is_under_appreciated","233720549_Monitoring_and_mitigation_of_volcano_hazards"]}