{"id":"221248156_Getting_access_to_what_goes_on_in_people's_heads_Reflections_on_the_think-aloud_technique","abstract":"One of the basic usability testing techniques the HCI community draws on, and which stands out as unique, is thinking aloud. We introduce the many names, uses and modifications of the classical think aloud technique, and ask the rhetorical question: What do researchers think they get when they ask people to think aloud? We answer it by discussing the classical work of Ericsson and Simon(1984), in particular their distinction between vocalisation, verbalisation and retrospective reports and the relation to short term memory. Reintroducing the psychological perspective and the focus on higher order cognitive processes, we argue that access to subjective experience is possible in terms of introspection and describe a technique that invites the user to become a participant in the analysis of his or her own cognitive processes. We suggest that use of think aloud has as a prerequisite explicit descriptions of design, test procedure and framework for analysis. We point out, however, that if the aim is to get access to human thinking, HCI research may benefit from experimental research.","authors":["Janni Nielsen","Torkil Clemmensen","Carsten Yssing"],"meta":["January 2002","DOI:10.1145/572020.572033","SourceDBLP","Conference: Proceedings of the Second Nordic Conference on Human-Computer Interaction 2002, Aarhus, Denmark, October 19-23, 2002"],"references":["268173170_Mindtape_A_Tool_for_Reflection_in_Participatory_Design","229060046_Telling_More_Than_We_Can_Know_Verbal_Reports_on_Mental_Processes","305219626_Telling_more_than_we_can_know_Verbal_reports_on_mental_processes","273947524_Interaction_Design_Beyond_Human-Computer_Interaction","263934555_Logic_and_Psychology","248545046_Investigating_the_Information-Seeking_Processes_of_Adolescents","246398642_Human_Computer_Interaction_First_Edition","234788932_Cultural_effects_in_usability_assessment","234761282_The_use_of_think-aloud_evaluation_methods_in_design","224927550_Protocol_Analysis_Verbal_Reports_As_Data"]}