{"id":"221291640_Mutual_Information_Analysis","abstract":"We propose a generic information-theoretic distinguisher for differential side-channel analysis. Our model of side-channel\nleakage is a refinement of the one given by Standaert et al. An embedded device containing a secret key is modeled as a black box with a leakage function whose output is captured by an\nadversary through the noisy measurement of a physical observable. Although quite general, the model and the distinguisher\nare practical and allow us to develop a new differential side-channel attack. More precisely, we build a distinguisher that\nuses the value of the Mutual Information between the observed measurements and a hypothetical leakage to rank key guesses.\nThe attack is effective without any knowledge about the particular dependencies between measurements and leakage as well as\nbetween leakage and processed data, which makes it a universal tool. Our approach is confirmed by results of power analysis \nexperiments. We demonstrate that the model and the attack work effectively in an attack scenario against DPA-resistant logic.","authors":["Benedikt Gierlichs","Lejla Batina","Pim Tuyls","Bart Preneel"],"meta":["August 2008","DOI:10.1007/978-3-540-85053-3_27","SourceDBLP","Conference: Cryptographic Hardware and Embedded Systems - CHES 2008, 10th International Workshop, Washington, D.C., USA, August 10-13, 2008. Proceedings"],"references":["272785334_SIDE-CHANNEL_ENTROPY_FOR_MODULAR_EXPONENTIATION_ALGORITHMS","228823765_Information_theoretic_measures_applied_to_power_and_electromagnetic_traces_measured_from_an_FPGA_performing_an_Elliptic_Curve_Point_Multiplication","228752743_A_formal_practice-oriented_model_for_the_analysis_of_side-channel_attacks","243617649_On_Optimal_and_Data-Based_Histograms","227992567_Elements_of_Information_Theory","226226622_Lecture_Notes_in_Computer_Science","225679785_Physically_Observable_Cryptography","224773133_Elements_of_information_theory_2nd_ed","221291950_A_Sound_Method_for_Switching_between_Boolean_and_Arithmetic_Masking","221291925_Multiplicative_Masking_and_Power_Analysis_of_AES"]}