{"id":"221273708_Design_and_Implementation_of_FAITH_An_Experimental_System_to_Intercept_and_Manipulate_Online_Social_Informatics","abstract":"om Abstract — Social informatics is the core of Facebook's business and is its most valuable asset which consists of the social graph and the private data of over 500 million users. However, without secure methods of managing this data, Facebook has become vulnerable to privacy risks and devaluation. In Facebook's model, users are asked upon access to grant applications the required permissions without sufficient knowledge of the applications' intentions. As a result, if they are deceived, users risk the exposure of sensitive and personal data. This paper presents a system dubbed FAITH (Facebook Applications: Identification, Transformation & Hypervisor) to mitigate or eliminate these issues by enhancing the management of social data. First, FAITH allows users to adjust the visibility of their social informatics for each individual application depending on how much they trust the application. Users can configure FAITH to let non-trusted applications run with the least privileges (least amount of social informatics) to minimize potential privacy leaks. Second, FAITH logs the activities of applications to assist users in making more secure decisions. Users can closely monitor each activity performed by applications to adjust their privacy settings more securely. Third, FAITH allows users to transform their social graph such that different applications see different social graphs preventing the formation of friendship inflation caused by applications. The implementation of FAITH only needs the resources and tools available to the public by Facebook and requires no further cooperation from the social network. FAITH is a prototype system: the design and concept can be extended to secure other OSNs (Online Social Networks). Currently, FAITH contains thirteen Facebook social applications and has been officially released for public usage with approximately two hundred monthly active users as of now.","authors":["Ruaylong Lee","Roozbeh Nia","Jason Hsu","Karl Levitt"],"meta":["July 2011","DOI:10.1109/ASONAM.2011.86","SourceDBLP","Conference: International Conference on Advances in Social Networks Analysis and Mining, ASONAM 2011, Kaohsiung, Taiwan, 25-27 July 2011"],"references":["220886824_Social_Email_A_Framework_and_Application_for_More_Socially-Aware_Communications","220886821_SocialWiki_Bring_Order_to_Wiki_Systems_with_Social_Context","220775678_Davis_Social_Links_or_How_I_Learned_to_Stop_Worrying_and_Love_the_Net","220886831_Toward_a_Behavioral_Approach_to_Privacy_for_Online_Social_Networks","220269647_Unveiling_facebook_A_measurement_study_of_social_network_based_applications","39998423_Supporting_Meaningful_Social_Networks"]}