{"id":"221361440_AAM_based_Face_Tracking_with_Temporal_Matching_and_Face_Segmentation","abstract":"Active Appearance Model (AAM) based face tracking has advantages of accurate alignment, high efficiency, and effectiveness for handling face deformation. However, AAM suffers from the generalization problem and has difficulties in images with cluttered backgrounds. In this paper, we introduce two novel constraints into AAM fitting to address the above problems. We first introduce a temporal matching constraint in AAM fitting. In the proposed fitting scheme, the temporal matching enforces an inter-frame local appearance constraint between frames. The resulting model takes advantage of temporal matching's good generalizability, but does not suffer from the mismatched points. To make AAM more stable for cluttered backgrounds, we introduce a color-based face segmentation as a soft constraint. Both constraints effectively improve the AAM tracker's performance, as demonstrated with experiments on various challenging real-world videos.","authors":["Mingcai Zhou","Lin Liang","Jian Sun","Yangsheng Wang"],"meta":["June 2010Proceedings / CVPR, IEEE Computer Society Conference on Computer Vision and Pattern Recognition. IEEE Computer Society Conference on Computer Vision and Pattern Recognition","DOI:10.1109/CVPR.2010.5540146","SourceDBLP","Conference: The Twenty-Third IEEE Conference on Computer Vision and Pattern Recognition, CVPR 2010, San Francisco, CA, USA, 13-18 June 2010"],"references":["228058014_Pattern_Classification","221506830_Integrating_Multiple_Visual_Cues_for_Robust_Real-Time_3D_Face_Tracking","307730517_An_Active_Model_for_Facial_Feature_Tracking","285906939_Numerical_optimization","230873264_Numerical_Optimization_Second_Edition","225698134_Active_appearance_models","224361937_A_Robust_Texture_Preprocessing_for_AAM","222323660_View-based_active_appearance_models","221304068_Real_Time_Feature_Based_3-D_Deformable_Face_Tracking","221259985_Feature_Detection_and_Tracking_with_Constrained_Local_Models"]}