{"id":"221345823_Generating_Text_with_Recurrent_Neural_Networks","abstract":"Recurrent Neural Networks (RNNs) are very powerful sequence models that do not enjoy widespread use because it is extremely difficult to train them properly. Fortunately, recent advances in Hessian-free optimization have been able to overcome the difficulties associated with training RNNs, making it possible to apply them successfully to challenging sequence problems. In this paper we demonstrate the power of RNNs trained with the new Hessian-Free optimizer (HF) by applying them to character-level language modeling tasks. The standard RNN architecture, while effective, is not ideally suited for such tasks, so we introduce a new RNN variant that uses multiplicative (or “gated”) connections which allow the current input character to determine the transition matrix from one hidden state vector to the next. After training the multiplicative RNN with the HF optimizer for five days on 8 high-end Graphics Processing Units, we were able to surpass the performance of the best previous single method for characterlevel language modeling – a hierarchical nonparametric sequence model. To our knowledge this represents the largest recurrent neural network application to date. 1.","authors":["Ilya Sutskever","James Martens","Geoffrey E. Hinton"],"meta":["January 2011","SourceDBLP","Conference: Proceedings of the 28th International Conference on Machine Learning, ICML 2011, Bellevue, Washington, USA, June 28 - July 2, 2011"],"references":["221620610_Offline_Arabic_Handwriting_Recognition_with_Multidimensional_Recurrent_Neural_Networks","221345224_A_stochastic_memoizer_for_sequence_data","12384401_Observable_Operator_Models_for_Discrete_Stochastic_Time_Series","228640434_Adaptive_weighing_of_context_models_for_lossless_data_compression","221578512_Lossless_Compression_Based_on_the_Sequence_Memoizer","221346352_Factored_conditional_restricted_Boltzmann_Machines_for_modeling_motion_style","221345102_Deep_learning_via_Hessian-free_optimization","220876997_Dasher---a_data_entry_interface_using_continuous_gestures_and_language_models"]}