{"id":"221369175_Matching_A_Well-Solved_Class_of_Integer_Linear_Programs","abstract":"A main purpose of this work is to give a good algorithm for a certain welldescribed class of integer linear programming problems, called matching problems (or the matching problem). Methods developed for simple matching [2,3], a special case to which these problems can be reduced [4], are applied directly to the larger class. In the process, we derive a description of a system of linear inequalities whose polyhedron is the convex hull of the admissible solution vectors to the given matching problem. At the same time, various combinatorial results about matchings are derived and discussed in terms of graphs. The general integer linear programming problem can be stated as: (1) Minimize z = ∑ j∈E cjxj, where cj is a given real number, subject to (2) xj an integer for each j ∈ E; (3) 0 ≤ xj ≤ αj, j ∈ E, where αj is a given positive integer or +∞; (4) ∑ j∈E aijxj = bi, i ∈ V, where aij and bi are given integers; V and E are index sets having cardinalities |V | and |E|. (5) The integer program (1) is called a matching problem whenever i∈V |aij | ≤ 2 holds for all j ∈ E. (6) A solution to the integer program (1) is a vector [xj], j ∈ E, satisfying (2), (3), and (4), and an optimum solution is a solution which minimizes z among all solutions. When the integer program is a matching problem, a solution is called a matching and an optimum solution is an optimum matching. If the integer restriction (2) is omitted, the problem becomes a linear program. An optimum solution to that linear program will typically have fractional values. There is an important class of linear programs, called transportation or network flow problems, which have the property that for any integer right-hand side bi, i ∈ V, and any cost vector cj, j ∈ E, there is an optimum solution which has all integer xj, j ∈ E. The class of matching probems includes that class of linear programs, but, in addition, includes problems for which omitting","authors":["Jack Edmonds","Ellis L. Johnson"],"meta":["January 2001Lecture Notes in Computer Science","DOI:10.1007/3-540-36478-1_3","SourceDBLP","Conference: Combinatorial Optimization - Eureka, You Shrink!, Papers Dedicated to Jack Edmonds, 5th International Workshop, Aussois, France, March 5-9, 2001, Revised Papers"],"references":["312389833_Maximum_matching_and_a_polyhedron_with_0_l-vertices","306190316_The_factors_of_graphs_Can","283559921_Paths_trees_flowers","268998253_Modification_of_Edmond's_maximum_matching_algorithm","266427708_The_factors_of_graphs_Reprint_Commentary_by_W_T_Tutte","266045444_Theorie_des_Graphs_et_ses_Applications","246773956_Matching_and_a_polyhedron_with_O-1_vertices","242499241_Maximum_matching_and_a_polyhedron_with_01-vertices","235096940_A_parametric_study_of_matchings_and_coverings_in_weighted_graphs","44553813_Theorie_des_graphes_et_ses_applications_Claude_Berge","31182249_The_Factorization_of_Linear_Graphs"]}