{"id":"221397393_Intrinsic_Plagiarism_Detection","abstract":"Current research in the field of automatic plagiarism detection for text documents focuses on algorithms that compare plagiarized documents against potential original documents. Though these approaches perform well in identifying copied or even modified passages, they assume a closed world: a reference collection must be given against which a plagiarized document can be compared.\nThis raises the question whether plagiarized passages within a document can be detected automatically if no reference is given, e. g. if the plagiarized passages stem from a book that is not available in digital form. We call this problem class intrinsic plagiarism detection. The paper is devoted to this problem class; it shows that it is possible to identify potentially plagiarized passages by analyzing a single document with respect to variations in writing style.\nOur contributions are fourfold: (i) a taxonomy of plagiarism delicts along with detection methods, (ii) new features for the quantification of style aspects, (iii) a publicly available plagiarism corpus for benchmark comparisons, and (iv) promising results in non-trivial plagiarism detection settings: in our experiments we achieved recall values of 85% with a precision of 75% and better.","authors":["Sven Meyer zu Eissen","Benno Stein"],"meta":["March 2006Lecture Notes in Computer Science 3936:565-569","DOI:10.1007/11735106_66","SourceDBLP","Conference: Advances in Information Retrieval, 28th European Conference on IR Research, ECIR 2006, London, UK, April 10-12, 2006, Proceedings"],"references":["259364013_Segmenting_documents_by_stylistic_character","316928083_Copy_Detection_Mechanisms_for_Digital_Documents","304049711_Topic_Segmentation_Algorithms_And_Applications","285078182_Exploiting_stylistic_idiosyncrasies_for_authorship_attribution","284339660_Derivation_of_New_Readability_Formulas_Automated_Readability_Index_Fog_Count_and_Flesch_Reading_Ease_Formula_for_Navy_Enlisted_Personnel","267448209_Corpus_Annotation_Linguistic_Information_from_Computer_Text_Corpora","255290986_Topic-Identifikation_Formalisierung_Analyse_und_neue_Verfahren","247665235_Style_mining_of_electronic_messages_for_multiple_author_discrimination","247399875_Research_Report_of_the_Center_for_Academic_Integrity","247340455_Readability_Revisited_The_New_Dale-Chall_Readability_Formula"]}