{"id":"221347533_The_cellular_automata_formalism_and_its_relationship_to_DEVS","abstract":"Cellular automata (CA) were originally conceived by Ulam and von Neumann in the 1940s to provide a formal frame- work for investigating the behaviour of complex, spatially distributed systems. Cellular Automata constitute a dy- namic, discrete space, discrete time formalism where space is usually discretized in a grid of cells. Cellular automata are still used to study, from first principles, the behaviour of a plethora of systems. The Discrete EVent system Specification (DEVS) was first introduced by Zeigler in 1976 as a rigourous basis for discrete-event modelling. At the discrete-event level of abstraction, state variables are considered to change only at event-times. Furthermore, the number of events occur- ring in a bounded time-interval must be finite. The seman- tics of well known discrete-event formalisms such as Event Scheduling, Activity Scanning, and Process Interaction can be expressed in terms of DEVS, making it a common de- nominator for the representation of discrete-event models. Due to its roots in traditional sequential formalisms, DEVS offers little potential for parallel implementation. Further- more, conflicts between simultaneous internal state transi- tions and external events are resolved by ignoring the in- ternal transitions. In 1996, Chow introduced the parallel DEVS (P-DEVS) formalism which alleviates these draw- backs. Since the end of 1993, the European Commission's ESPRIT Basic Research Working Group 8467 (SiE), has identified key areas for future research in modelling and simulation. The most urgent need is to support multi-formalism mod- elling to correctly model complex systems with compo- nents described in diverse formalisms. To achieve this goal, formalisms need to be related. The Formalism Transfor- mation Graph (FTG) shown in Figure 1 depicts behaviour- conserving transformations between formalisms. In this article, both the Cellular Automata and the DEVS and parallel DEVS formalisms are introduced. Then, a mapping between Cellular Automata and parallel DEVS is elaborated. This fills in the CA DEVS edge in the FTG. The mapping describes CA semantics in terms of parallel DEVS semantics. As such, it is a specification for auto- mated transformation of CA models into parallel DEVS models, thus enabling efficient, parallel simulation as well as meaningful coupling with models in other formalisms.","authors":["Hans Vangheluwe","Ghislain C. Vansteenkiste"],"meta":["January 2000","SourceDBLP","Conference: Proceedings of the 14th European Simulation Multiconference on Simulation and Modelling: Enablers for a Better Quality of Life"],"references":["276934811_A_Mathematical_Theory_of_Systems_Engineering_The_Elements","268976217_Multifaceted_Modelling_and_Discrete_Event_Simulation","262209787_Distributed_simulation_of_hierarchical_DEVS_models_Hierarchical_scheduling_locally_and_time_warp_globally","248071225_Theory_and_Applications_of_Cellular_Automata","246898332_Multifacetted_Modelling_and_Discrete_Event_Simulation","243646892_Parallel_DEVS_A_Parallel_Hierarchical_Modular_Modeling_Formalism_and_its_Distributed_Simulator","238757964_The_Fantastic_Combinations_of_John_Horton_Conway's_New_Solitaire_Game_Life'","220420285_The_Time_and_State_Relationships_in_Simulation_Modeling","220177747_A_Cellular_Automata_Simulation_System","220136488_A_Logic-based_Foundation_of_Discrete_Event_Modeling_and_Simulation"]}