{"id":"221348198_Algebraic_Cryptanalysis_of_McEliece_Variants_with_Compact_Keys_2009_Secret_19","abstract":"In this paper we propose a new approach to investigate the security of the McEliece cryptosystem. We recall that this cryptosystem relies on the use of error-correcting codes. Since its invention thirty years ago, no ecient attack had been devised that managed to recover the private key. We prove that the private key of the cryptosystem satises a system of bi-homogeneous polynomial equations. This property is due to the particular class of codes considered which are alternant codes. We have used these highly structured algebraic equations to mount an ecient key-recovery attack against two recent variants of the McEliece cryptosystems that aim at reducing public key sizes. These two compact variants of McEliece managed to propose keys with less than 20,000 bits. To do so, they proposed to use quasi-cyclic or dyadic structures. An implementation of our algebraic attack in the computer algebra system Magma allows to nd the secret-key in a negligible time (less than one second) for almost all the proposed challenges. For instance, a private key designed for a 256-bit security has been found in 0.06 seconds with about 2 17:8 operations.","authors":["Jean-Charles Faugère","Ayoub Otmani","Ludovic Perret","Jean-Pierre Tillich"],"meta":["May 2010","DOI:10.1007/978-3-642-13190-5_14","SourceDBLP","Conference: Advances in Cryptology - EUROCRYPT 2010, 29th Annual International Conference on the Theory and Applications of Cryptographic Techniques, French Riviera, May 30 - June 3, 2010. Proceedings"],"references":["281048891_Shorter_keys_for_code-based_cryptography","234801344_Ideals_over_a_Non-Commutative_Ring_and_their_Application_in_Cryptology","329211923_Correction_to_Ideals_Varieties_and_Algorithms_An_Introduction_to_Computational_Algebraic_Geometry_and_Commutative_Algebra","265333997_An_Introduction_to_Grobner_Basis","258239683_The_theory_of_error-correcting_codes_Parts_I_II","250969195_On_insecurity_of_cryptosystems_based_on_generalized_Reed-Solomon_codes","241885294_Explicit_bounds_for_generic_decoding_algorithms_for_code-based_cryptography","240968569_Public-key_cryptosystem_based_on_binary_Reed-Muller_codes","239086442_A_New_Efficient_Algorithm_for_Computing_Grobner_Bases_F4","237129063_A_public_k_e_y_system_based_on_algebraic_coding_theory"]}