{"id":"221348181_A_Unified_Framework_for_the_Analysis_of_Side-Channel_Key_Recovery_Attacks","abstract":"The fair evaluation and comparison of side-channel attacks and countermeasures has been a long standing open question, limiting further developments in the field. Motivated by this challenge, this work proposes a framework for the analysis of cryptographic implementations that includes a theoretical model and an application methodology. The model is based on weak and commonly accepted hypotheses about side- channels that computations give rise to. It allows quantifying the effect of practically relevant leakage functions with a combination of security and information theoretic metrics, respectively measuring the quality of an implementation and the strength of an adversary. From a theoretical point of view, we demonstrate formal connections between these metrics and discuss their intuitive meaning. From a practical point of view, the model implies a unified methodology for the analysis of side-channel key recovery. The proposed solution allows getting rid of most of the subjective parameters that were limiting previous specialized and often ad hoc approaches in the evaluation of physically observable devices. It typically determines the extent to which basic (but practically essential) questions such as \"How to compare two implementations?\" or \"How to compare two side-channel adversaries?\" can be fairly answered.","authors":["François-Xavier Standaert","Tal G. Malkin","Moti Yung"],"meta":["April 2009","DOI:10.1007/978-3-642-01001-9_26","SourceDBLP","Conference: Advances in Cryptology - EUROCRYPT 2009, 28th Annual International Conference on the Theory and Applications of Cryptographic Techniques, Cologne, Germany, April 26-30, 2009. Proceedings"],"references":["225836546_Towards_Security_Limits_in_Side-Channel_Attacks","225651438_Template_Attacks_in_Principal_Subspaces","299687971_Information_Theory","274891554_Elements_of_Information_Theory_Wiley_New-York","244456894_DES_and_Differential_Power_Analysis","235418978_A_Mathematical_Theory_of_Communication","225679785_Physically_Observable_Cryptography","224354130_Leakage-Resilient_Cryptography","224102213_Transaction_Security_System","221631821_Formally_Bounding_the_Side-Channel_Leakage_in_Unknown-Message_Attacks","221609273_A_block_cipher_based_pseudo_random_number_generator_secure_against_side-channel_key_recovery","221609576_An_information-theoretic_model_for_adaptive_side-channel_attacks","221354213_Algorithmic_Tamper-Proof_ATP_Security_Theoretical_Foundations_for_Security_against_Hardware_Tampering","221348354_Private_Circuits_II_Keeping_Secrets_in_Tamperable_Circuits","221348070_A_Leakage-Resilient_Mode_of_Operation"]}