{"id":"221368326_A_new_CS0_course_for_at-risk_majors","abstract":"The Bureau of Labor Statistics forecasts that approximately 175,100 software engineering jobs will be created between 2008 and 2018. In order to fill these positions, new computer scientists, who enjoy and are competent in the art of programming and software design, must be trained. Computer science departments must look for novel approaches to attract non-traditional students, i.e. women and minorities, to the major, in order to fill the positions predicted by the Bureau of Labor Statistics. Additionally, although computer science enrollment has increased in the freshman and sophomore levels over the past few years, computer science departments are still faced with identifying new approaches to teaching programming that will retain students, particularly if some of them have weak mathematics backgrounds and are placed directly in CS1. In this paper, a study to determine the effectiveness of a CS0 course using Scratch for improving the retention, the performance and the attitudes of at-risk majors is discussed. Initial assessments associated with the study indicate that students of the target group who program using Scratch have a high degree of perceived self-efficacy with respect to their programming abilities. Furthermore, results to date indicate that the originally at-risk students in the study went on to successfully complete CS1 with a passing rate of 74% compared to a 39% passing rate in CS1 by the students who had sufficiently high mathematics scores upon entry into the university.","authors":["Mona E. Rizvi","Thorna Humphries","Debra A Major","Heather Lauzun"],"meta":["May 2011Software Engineering Education Conference, Proceedings","DOI:10.1109/CSEET.2011.5876101","SourceDBLP","Conference: 24th IEEE-CS Conference on Software Engineering Education and Training, CSEE&T 2011, May 22-24, 2011, Waikiki, Honolulu, HI, USA, Proceedings"],"references":["261847581_Dropping_CS_enrollments_Or_the_emperor's_new_clothes","242609584_Introduction_to_Media_Computation_AMultimedia_Cookbook_in_Python","239535030_Comprehensive_Report1_on_the_2001_Survey_of_Departments_Offering_CAC_Accredited_Degree_Programs","234820368_The_Scratch_Programming_Language_and_Environment","228405788_Alice_A_3-D_tool_for_introductory_programming_concepts","221538824_Evaluating_the_effectiveness_of_a_new_instructional_approach","221538633_CS_05_A_better_approach_to_introductory_computer_science_for_majors","220426817_Scratch_Programming_for_All","220420326_Teaching_the_Nintendo_generation_to_program","220094594_The_Greenfoot_Programming_Environment","211391140_Commitment_to_Organizations_and_Occupations_Extension_and_Test_of_a_Three-Component_Conceptualization","38413358_Scratch_for_Budding_Computer_Scientists","3050987_Motivation_and_Nonmajors_in_Computer_Science_Identifying_Discrete_Audiences_for_Introductory_Courses","229043489_Bringing_No_Ceiling_to_Scratch_Can_One_Language_Serve_Kids_and_Computer_Scientists","221538931_Starting_with_scratch_in_CS_1","220094516_The_Design_of_Alice","4818649_Person-Organization_Fit_Job_Choice_Decisions_and_Organizational_Entry"]}