{"id":"221335551_Functional_Video_Games_in_the_CS1_Classroom","abstract":"Over the past decade enrollments in Computer Science undergraduate programs have drastically dropped while simultaneously\nseeing demand for computer scientists in the job market increase. The reason for this disconnect is, in part, due to the perception\nnew potential students have of programming as a dull activity requiring no creativity, very little social interaction, and\nendless hours of coding in front of a monitor. The question then is how can we capture the imagination of new students and\nperk their interest in a way that gets them excited while at the same time giving them a solid foundation in computer programming\nand Computer Science. This article puts forth the thesis that developing video games using functional programming should be\na new trend in the CS1 classroom. The article describes the approach implemented at Seton Hall University using video game \nprogramming and Felleisen et al.’s textbook How to Design Programs. The first-year programming curriculum is briefly described and how to get students interested in programming through the\ndevelopment of a Space-Invaders-like game is illustrated. The presented development gives the reader a clear sense of how\nto use functional video games in the first semester classroom.","authors":["Marco T. Morazán"],"meta":["May 2010","DOI:10.1007/978-3-642-22941-1_11","SourceDBLP","Conference: Trends in Functional Programming - 11th International Symposium, TFP 2010, Norman, OK, USA, May 17-19, 2010. Revised Selected Papers"],"references":["228785589_The_Yampa_Arcade","228647767_Teaching_functional_programming_with_soccer-fun","321876672_Beginning_Game_Development_with_Python_and_Pygame_From_Novice_to_Professional","294807619_Occupational_employment_projections_to_2018","288958507_Occupational_projections_to_2018","262357093_Haskell_in_Space_An_interactive_game_as_a_functional_programming_exercise","259183425_Joint_Task_Force_on_Computing_Curricula_Report_on_Computer_Science","246393956_How_to_Design_Programs_An_Introduction_to_Computing_and_Programming","221241358_A_Functional_IO_System_or_Fun_for_Freshman_Kids","220421389_Why_Computer_Science_Doesn't_Matter"]}