{"id":"221482596_Analysis_and_classification_of_speech_mode_Whispered_through_shouted","abstract":"Variation in vocal effort represents one of the most challenging problems in maintaining speech system performance for coding, speech and speaker recognition. Changes in vocal effort (or mode) result in a fundamental change in speech production which is not simply a change in volume. This is the first study to collectively consider the five speech modes: whispered, soft, neutral, loud and shouted. After corpus development, analysis is performed for i) sound intensity level, ii) duration and silence percentage, iii) frame energy distribution and iv) spectral tilt. The analysis shows vocal effort dependent traits which are used to investigate speaker recognition. Matched vocal mode conditions result in a closed-set speaker ID rate of 97.62%, with mismatch vocal conditions producing 54.02%. Finally, a speech mode classification system is developed, which has a range of classification rate from 44.5% to 98.5% confusing with adjacent vocal modes. These advancements can provide improved speech/speaker modeling information, as well as classified vocal mode knowledge to improve speech and language technology in real scenarios. Index Terms: Whispered, vocal effort, Speaker recognition, classification","authors":["Chi Zhang","John H. L. Hansen"],"meta":["August 2007","DOI:10.21437/Interspeech.2007-621","SourceDBLP","Conference: INTERSPEECH 2007, 8th Annual Conference of the International Speech Communication Association, Antwerp, Belgium, August 27-31, 2007","Project: Whispered Speech Analysis, Detection and Recognition"],"references":["221484298_Cluster-dependent_modeling_and_confidence_measure_processing_for_in-setout-of-set_speaker_identification","234285554_A_comparative_analysis_of_whispered_and_normally_phonated_speech_using_an_LPC-10_vocoder","233614217_Acoustic_Features_of_Shouted_Voice","233601752_Formant_Feature_Differences_Between_Whispered_And_Voiced_Sustained_Vowels","233561942_Phonetic_Structure_of_Shouted_Voice","221491586_A_study_on_the_classification_of_whispered_and_normally_phonated_speech","221478875_Analysis_of_lombard_effect_under_different_types_and_levels_of_noise_with_application_to_in-set_speaker_ID_systems","27531140_Analysis_and_compensation_of_stressed_and_noisy_speech_with_application_to_robust_automatic_recognition","3333661_N-channel_hidden_Markov_models_for_combined_stressed_speech_classification_and_recognition"]}