{"id":"221456257_Automatic_Orchestration_of_Behaviours_through_the_management_of_Resources_and_Priority_Levels","abstract":"Reproducing daily behaviours requires to be able to schedule behaviours depending on resources and priority constraints. A simple way is to say that behaviours which are using the same resources are mutually exclusive. This approach is not sufficient to obtain realism, as in the real life, humans are able to combine them in a more microscopic way. One way consists in a global specificication of all behaviours in one model, integrating all possible combinations. This solution becomes rapidly too complex and has motivated the work presented in this paper. It consists in an extension of HPTS, our behavioural model which integrates several psychological requirements, by the introduction of resources and priority levels. In the contrary of some previous approaches, it is not necessary to specify exhaustively all behaviours that are mutually exclusive; this is done implicitly by attaching resources to nodes, preference values to transitions, and a priority function to each behaviour, and by using a scheduling algorithm at run-time.","authors":["Lamarche Fabrice","Stéphane Donikian"],"meta":["July 2002","DOI:10.1145/545056.545124","SourceDBLP","Conference: The First International Joint Conference on Autonomous Agents & Multiagent Systems, AAMAS 2002, July 15-19, 2002, Bologna, Italy, Proceedings"],"references":["221605597_Open_World_Planning_in_the_Situation_Calculus","221492782_Reactivity_Concurrency_Data-flow_and_Hierarchical_Preemption_for_Behavioural_Animation","221414204_Towards_Personalities_for_Animated_Agents_with_Reactive_and_Planning_Behaviors","220794026_HPTS_A_behaviour_modelling_language_for_autonomous_agents","220793944_Action_Selection_in_an_Autonmous_Agent_with_a_Hierarchical_Distributed_Reactive_Planning_Architecture","229068122_Unified_Theories_of_Cognition","222221648_Situated_agents_can_have_goals","221414196_What_Sort_of_Control_System_Is_Able_to_Have_a_Personality","3698969_Sensor_based_synthetic_actors_in_a_tennis_game_simulation","3601624_Hierarchical_concurrent_state_machines_for_behavior_modeling_and_scenario_control"]}