{"id":"221455156_On_the_complexity_of_practical_ATL_model_checking","abstract":"We investigate the computational complexity of reasoning about multi-agent systems using the cooperation logic ATL of Alur, Hen- zinger, and Kupferman. It is known that satisfiability check ing is EXPTIME-complete for \"full\" ATL, and PSPACE-complete (in the general case) for the fragment of ATL corresponding to Pauly's Coalition Logic. In contrast, the model checking problems for ATL and Coalition Logic can both be solved in time polynomial in the size of the formula and the size of model against which the for- mula is to be checked. However, these latter results assume an extensive representation of models, in which all states of a model are explicitly enumerated. Such representations are not feasible in practice. In this paper we investigate the complexity of the ATL and Coalition Logic model checking problems for a more \"rea- sonable\" model representation known as SRML (\"Simple Reactive Modules Language\"), a simplified version of the actual model rep- resentation languages used for model checkers such as SMV and MOCHA. While it is unsurprising that, when measured against such representations, the model checking problems for ATL and Coali- tion Logic have a higher complexity than when measured against explicit state representations, we show that in fact the ATL and Coalition Logic model checking problems for SRML models have the same complexity as the corresponding satisfiability pro blems. That is, model checking ATL formulae against SRML models is EXPTIME-complete, and model checking Coalition Logic formulae against SRML models is PSPACE-complete. We conclude by inves- tigating some technical issues around these results, and di scussing their implications.","authors":["Wiebe van der Hoek","Alessio Lomuscio","Michael Wooldridge"],"meta":["January 2006","DOI:10.1145/1160633.1160665","SourceDBLP","Conference: 5th International Joint Conference on Autonomous Agents and Multiagent Systems (AAMAS 2006), Hakodate, Japan, May 8-12, 2006"],"references":["221455909_Agents_and_Roles_Refinement_in_Alternating-Time_Temporal_Logic","221403574_MOCHA_Modularity_in_Model_Checking","302282301_Symbolic_Model_Checking","239538939_The_spin_model_checker","236628854_Computational_Complexity","228729601_The_complexity_of_symbolic_model_checking_temporal-epistemic_logics","228057894_Computational_Complexity","226178264_A_Sat-Based_Approach_to_Unbounded_Model_Checking_for_Alternating-Time_Temporal_Epistemic_Logic","222675562_On_the_logic_of_cooperation_and_propositional_control","221471285_Do_Agents_Make_Model_Checking_Explode_Computationally"]}