{"id":"221400052_Policy-Based_Event-Driven_Services-Oriented_Architecture_for_Cloud_Services_Operation_Management","abstract":"Cloud based services, by their nature, are distributed and traditional operation and management processes that often exert centralized control are not suited for cloud services operation and management. This paper introduces a Policy-based Event-driven Service-oriented Architecture (PESA) that enables the manageability of these loosely coupled services distributed across multiple public or private clouds or a hybrid cloud. PESA allows the implementation of policy driven management of service availability, performance, security and risk management. Using the concept of logical and virtual partitioning of the business service fabric into sub-fabrics - islands of services that may span company, geographical, and technological boundaries, public and private clouds, and corporate data centers, we describe a conceptual management architecture for policy enforcement. An example describes service availability and performance assurance in a business process implementation using a set of loosely coupled service components in a virtual cloud.","authors":["Pankaj Goyal","Rao Mikkilineni"],"meta":["January 2009","DOI:10.1109/CLOUD.2009.76","SourceDBLP","Conference: IEEE International Conference on Cloud Computing, CLOUD 2009, Bangalore, India, 21-25 September, 2009"],"references":["224560186_The_Virtual_Business_Services_Fabric_An_Integrated_Abstraction_of_Services_and_Computing_Infrastructure","221015624_FCAPS_in_the_Business_Services_Fabric_Model","221015090_Manageability_and_Operability_in_the_Business_Services_Fabric","274074626_The_growing_role_of_events_in_enterprise_applications","265566098_SOA_EDA_BPM_and_CEP_are_all_Complementary","262400330_Complex_event_processing_CEP","260480191_Combining_Service-Oriented_Architecture_and_Event-Driven_Architecture_using_an_Enterprise_Service_Bus","242382055_The_hp_softbench_environment_an_architecture_for_a_new_generation_of_software_tools"]}