{"id":"221498931_Delayed-logic_and_finite-state_machines","abstract":"This paper concerns switching networks which consist of n identical combinational logic cells interconnected from left to right by alpha communication channels into linear arrays. The synchronous cells in these networks have unit switching delays separating their receipts of external x and left-neighbor alpha inputs from their corresponding productions of external z and right-neighbor alpha outputs. Three basic types of alpha transient behavior are discussed for such networks. In the first type, all transients extend to no more than a bounded number of cells to the right of each x change; in the second, all transients propagate all the way to the right boundary of the network; and in the third, any transient may or may not propagate to the right boundary of the network depending upon the x sequence to the right of the x change in question. In all three cases, necessary and sufficient conditions are given on the type of alpha logic allowed. These conditions are expressed in terms of corresponding alpha state graph structure. The paper's main results hinge on certain properties of a new type of state subgraph, and on an indirect application of permutation groups to the state-pair transition problem. A section of examples proves that individual graphs can contain any mixture of the above three types of transient behavior.","authors":["Dean N. Arden"],"meta":["January 1961","DOI:10.1109/FOCS.1961.13","SourceDBLP","Conference: 2nd Annual Symposium on Switching Circuit Theory and Logical Design, Detroit, Michigan, USA, October 17-20, 1961"],"references":["230876408_Finite_Automata_and_Their_Decision_Problems","307962645_Representation_of_Events_in_Nerve_Nets_and_Finite_Automata","281203517_Probabilistic_Logics_and_the_Synthesis_of_Reliable_Organisms_from_Unreliable_Components_in_Automata_Studies","238321666_Some_universal_elements_for_finite_automata","235246944_Probabilistic_Logic_and_the_Synthesis_of_Reliable_Organisms_from_Unreliable_Components","230876336_Gedanken-Experiments_on_Sequential_Machines","224105225_The_Reduction_of_Two-Way_Automata_to_One-Way_Automata","220430829_Realization_of_Events_by_Logical_Nets","37595780_Some_recent_simplifications_of_the_theory_of_finite_automata"]}