{"id":"221410756_Fast_Extraction_of_Gradual_Association_Rules_A_Heuristic_Based_Method","abstract":"Even if they have proven to be relevant on traditional transactional databases, data mining tools are still inefficient on some kinds of databases. In particular, databases containing discrete values or having a value for each item, like gene expression data, are especially challenging. On such data, existing approaches either transform the data to classical binary attributes, or use discretisation, including fuzzy partition to deal with the data. However, binary mapping of such databases drives to a loss of information and extracted knowledge is not exploitable for end-users. Thus, powerful tools designed for this kind of data are needed. On the other hand, existing fuzzy approaches hardly take gradual notions into account, or are not scalable enougth to tackle the problem. In this paper, we thus propose a heuristic in order to extract tendencies, in the form of gradual association rules. A gradual rule can be read as \"The more X and the less Y, then the more V and the less W\". Instead of using fuzzy sets, we apply our method directly on valued data and we propose an efficient heuristic, thus reducing combinatorial complexity and scalability. Experiments on synthetic datasets show the interest of our method.","authors":["Lisa Di-Jorio","Anne Laurent","Maguelonne Teisseire"],"meta":["October 2008","DOI:10.1145/1456223.1456268","SourceDBLP","Conference: CSTST 2008: Proceedings of the 5th International Conference on Soft Computing as Transdisciplinary Science and Technology, Cergy-Pontoise, France, October 28-31, 2008"],"references":["242090379_Gradual_Trends_in_Fuzzy_Sequential_Patterns","220176665_Gradual_elements_in_a_fuzzy_set","4271945_A_practical_inference_method_with_several_implicative_gradual_rules_and_a_fuzzy_input_One_and_two_dimensions","221900765_Fast_Algorithms_for_Mining_Association_Rules_in_Large_Databases","221522674_On_Data_Summaries_Based_on_Gradual_Rules","220699789_Association_Rules_for_Expressing_Gradual_Dependencies","220031840_An_Alternative_Approach_to_Discover_Gradual_Dependencies"]}