{"id":"221462734_Pseudorandom_Bit_Generators_That_Fool_Modular_Sums","abstract":"We consider the following problem: for given n,M, produce a sequence X\n1,X\n2,…,X\nn\nof bits that fools every linear test modulo M. We present two constructions of generators for such sequences. For every constant prime power M, the first construction has seed length O\nM\n(log(n/ε)), which is optimal up to the hidden constant. (A similar construction was independently discovered by Meka and Zuckerman [MZ]). The second construction works for every M,n, and has seed length O(logn + log(M/ε)log(Mlog(1/ε))).\nThe problem we study is a generalization of the problem of constructing small bias distributions [NN], which are solutions to the M = 2 case. We note that even for the case M = 3 the best previously known constructions were generators fooling general bounded-space computations, and required O(log2n) seed length.\nFor our first construction, we show how to employ recently constructed generators for sequences of elements of ℤM\nthat fool small-degree polynomials (modulo M). The most interesting technical component of our second construction is a variant of the derandomized graph squaring operation of [RV]. Our generalization handles a product of two distinct graphs with distinct bounds on their expansion. This is then used to produce pseudorandom-walks where each step is taken on a different regular directed graph (rather than pseudorandom walks on a single regular directed graph as in [RTV, RV]).","authors":["Shachar Lovett","Omer Reingold","Luca Trevisan","Salil Vadhan"],"meta":["January 2009","DOI:10.1007/978-3-642-03685-9_46","SourceDBLP","Conference: Approximation, Randomization, and Combinatorial Optimization. Algorithms and Techniques, 12th International Workshop, APPROX 2009, and 13th International Workshop, RANDOM 2009, Berkeley, CA, USA, August 21-23, 2009. Proceedings"],"references":["242531854_An_Estimate_for_Character_Sums","262160411_On_e-Biased_Generators_in_NC","245779805_Construction_of_a_Thin_Set_with_small_Fourier_Coefficients","234807273_Pseudorandom_generators_for_space_bounded_computation","232633216_Simple_construction_of_almost_k-wise_independent_random_variables","229764906_Addendum_to_simple_constructions_of_almost_k-wise_independent_random_variables","229238729_BPHSPACESDSPACES32","228057650_Multiparty_Protocols_Pseudorandom_Generators_for_Logspace_and_Time-Space_Trade-offs","223954298_The_probabilistic_method_yields_deterministic_parallel_algorithms","223594156_A_well-characterized_approximation_problem"]}