{"id":"221441519_An_Analysis_and_Critique_of_Research_through_Design_towards_a_formalization_of_a_research_approach","abstract":"The field of HCI is experiencing a growing interest in Research through Design (RtD), a research approach that employs methods and processes from design practice as a legitimate method of inquiry. We are interested in expanding and formalizing this research approach, and understanding how knowledge, or theory, is generated from this type of design research. We conducted interviews with 12 leading HCI design researchers, asking them about design research, design theory, and RtD specifically. They were easily able to identify different types of design research and design theory from contemporary and historical design research efforts, and believed that RtD might be one of the most important contributions of design researchers to the larger research community. We further examined three historical RtD projects that were repeatedly mentioned in the interviews, and performed a critique of current RtD practices within the HCI research and interaction design communities. While our critique summarizes the problems, it also shows possible directions for further developments and refinements of the approach. Author Keywords Design, research through design, design research, design theory ACM Classification Keywords H5.m. Information interfaces and presentation (e.g., HCI): Miscellaneous.","authors":["John Zimmerman","Erik Stolterman","Jodi Forlizzi"],"meta":["January 2010","DOI:10.1145/1858171.1858228","SourceDBLP","Conference: Proceedings of the Conference on Designing Interactive Systems, Aarhus, Denmark, August 16-20, 2010","Project: Constructive Design Research"],"references":["259823341_The_Nature_of_Design_Practice_and_Implications_for_Interaction_Design_Research","255677522_UCPCD_user-centered_product_concept_design","329645326_Thoughtful_Interaction_Design_A_Design_Perspective_on_Information_Technology","314796675_From_perception_to_experience_from_affordances_to_irresistibles","304898664_Envisioning_Information","287921673_The_Product_Ecology_Understanding_Social_Product_Use_and_Supporting_Design_Culture","284222095_Research_in_Art_and_Design","271688990_Theory_Construction_as_Disciplined_Imagination","251880127_Wicked_Problems_in_Design_Thinking","247941064_The_Penguin_Dictionary_of_Philosophy"]}