{"id":"221560691_Self-healing_BPEL_processes_with_Dynamo_and_the_JBoss_rule_engine","abstract":"Many emerging domains such as ambient intelligence, context-aware applications, and pervasive computing are embracing the assumption that their software applications will be deployed in an open-world. By adopting the Service Oriented Architecture paradigm, and in particular its Web service based implementation, they are capable of leveraging components that are remote and not under their jurisdication, i.e. services. However, the distributed nature of these systems, the presence of many stakeholders, and the fact that no one has a complete knowledge of the system preclude classic static verification techniques. The capability to \"self-heal\" has become paramount. In this paper we present our solution to self-healing BPEL compositions called Dynamo. It is an assertion-based solution, that provides special purpose languages (WSCoL and WSReL) for defining monitoring and recovery activities. These are executed using Dynamo, which consists of an AOP-extended version of the ActiveBPEL orchestration engine, and which leverages the JBoss Rule Engine to ensure self-healing capabilities. The approach is exemplified on a complex case study.","authors":["Luciano Baresi","Sam Guinea","Liliana Pasquale"],"meta":["January 2007","DOI:10.1145/1294904.1294906","SourceDBLP","Conference: Proceedings of the 2007 International Workshop on Engineering of Software Services for Pervasive Environments, ESSPE 2007, Dubrovnik, Croatia, September 4, 2007"],"references":["221050640_Reliable_Scientific_Service_Compositions","221050482_Dynamo_Dynamic_monitoring_of_WS-BPEL_processes","221050475_Lecture_Notes_in_Computer_Science","220826473_Self-healing_Execution_of_Business_Processes_Based_on_a_Peer-to-Peer_Service_Architecture","220768535_DIOS_A_Framework_for_Rule-Based_Autonomic_Management_of_Distributed_Scientific_Applications","4251414_SHIWS_a_self-healing_integrator_for_web_services","4251411_Dynamo_and_self-healing_BPEL_compositions","221440087_Autonomic_Computing","220631006_Towards_autonomic_web_services_Achieving_self-healing_using_web_services","4105096_RuleBAM_a_rule-based_framework_for_business_activity_management"]}