{"id":"221566004_Idea_Java_vs_PHP_Security_Implications_of_Language_Choice_for_Web_Applications","abstract":"While Java and PHP are two of the most popular languages for open source web applications found at\nfreshmeat.net\n, Java has had a much better security reputation than PHP. In this paper, we examine whether that reputation is deserved. We studied whether the variation in vulnerability density is greater between languages or between different applications written in a single language by comparing eleven open source web applications written in Java with fourteen such applications written in PHP. To compare the languages, we created a Common Vulnerability Metric (CVM), which is the count of four vulnerability types common to both languages. Common Vulnerability Density (CVD) is CVM normalized by code size. We measured CVD for two revisions of each project, one from 2006 and the other from 2008. CVD values were higher for the aggregate PHP code base than the Java code base, but PHP had a better rate of improvement, with a decline from 6.25 to 2.36 vulnerabilities/KLOC compared to 1.15 to 0.63 in Java. These changes arose from an increase in code size in both languages and a decrease in vulnerabilities in PHP. The variation between projects was greater than the variation between languages, ranging from 0.52 to 14.39 for Java and 0.03 to 121.36 in PHP for 2006. We used security and software metrics to examine the sources of difference between projects.","authors":["James Walden","Maureen Doyle","Robert Lenhof","John Murray"],"meta":["October 2010","DOI:10.1007/978-3-642-11747-3_5","SourceDBLP","Conference: Engineering Secure Software and Systems, Second International Symposium, ESSoS 2010, Pisa, Italy, February 3-4, 2010. Proceedings"],"references":["246828292_Milk_or_Wine_Does_Software_Security_Improve_with_Age","221495002_Security_of_Open_Source_Web_Applications","221292798_Evaluating_static_analysis_defect_warnings_on_production_software","262409041_The_beauty_and_the_beast_vulnerabilities_in_red_hat's_packages","242070565_Cross-project_Defect_Prediction","236944400_Software_Metrics_A_Rigorous_Practical_Approach","221609653_Is_Complexity_Really_the_Enemy_of_Software_Security","221560507_Cross-project_Defect_Prediction_A_Large_Scale_Experiment_on_Data_vs_Domain_vs_Process","221555743_Mining_metrics_to_predict_component_failures","221494930_An_Empirical_Model_to_Predict_Security_Vulnerabilities_using_Code_Complexity_Metrics","220939042_Have_things_changed_now_An_empirical_study_of_bug_characteristics_in_modern_open_source_software","4200440_Static_analysis_tools_as_early_indicators_of_pre-release_defect_density"]}