{"id":"221516252_Bullseye_when_Fitts'_Law_Doesn't_Fit","abstract":"Today's GUI interfaces require considerable visual attention for their operation. Consequently, interface events use up precious screen real estate and disenfranchise blind users from current software usage. If interfaces move to the realm of auditory and tactile designs, these problems are mitigated. However, it is not clear how much useful HCI research, par- ticularly performance time models, will transfer from the vi- sual to the non-visual. This paper attempts to answer a small part of this question by considering performance time mod- els for menu selection in a non-visual bullseye menu. We chose to study non-visual bullseye menus because we have found them to be highly useful in non-visual interfaces: they can serve as effective non-visual replacements for several vi- sual linear menus. MOTlVATlON Standard GUIs rely heavily on the visual modality, because it is an efficient and effective means of interaction between humans and machines. The PC of today includes a large CRT that can display high resolution graphics, but may not include high-quality speakers (or even a sound card) for emitting sounds. Tactile input/output device are not general- ly included either. One may think that the reason for the overwhelming popularity of visual interfaces and the rarity of non-visual ones is that non-visual interfaces are simply not needed in today's mainstream applications. We argue that non-visual interfaces are indeed needed, for several im- portant reasons.","authors":["Naomi Friedlander","Kevin Schlueter","Marilyn Tremaine"],"meta":["January 1998","DOI:10.1145/274644.274681","SourceDBLP","Conference: Proceeding of the CHI '98 Conference on Human Factors in Computing Systems, Los Angeles, California, USA, April 18-23, 1998."],"references":["237240361_An_Empirical_Evaluation_Articulatory_and_Cognitive_Marking_Menus_of_Some_Aspects_of","221515390_Beyond_Fitts'_Law_Models_for_Trajectory-Based_HCI_Tasks","284529299_Fundamental_Statistics_In_Psychology_and_Education","274813601_Fundamental_Statistics_in_Psychology_and_Education","238793256_Fitts's_Law_studies_of_directional_mouse_movement","221517703_Easy_Tactile_Feedback_in_Bargain_Basement_Prices","221515658_Extending_Fitts'_Law_to_Two-Dimensional_Tasks","221514355_The_limits_of_expert_performance_using_hierarchic_marking_menus","35309063_Fitts'_law_as_a_performance_model_in_human-computer_interaction_microform","21752413_The_Information_Capacity_of_the_Human_Motor_System_in_Controlling_the_Amplitude_of_Movement"]}