{"id":"221591080_Optimal_phylogenetic_reconstruction","abstract":"One of the major tasks of evolutionary biology is the reconstruction of phylogenetic trees from molecular data. The evolutionary model is given by a Markov chain on the true evolutionary tree. Given samples from this Markov chain at the leaves of the tree, the goal is to reconstruct the evolutionary tree.It is well known that in order to reconstruct a tree on n leaves, sequences of length Ω(log n) are needed. It was conjectured by M. Steel that for the CFN evolutionary model, if the mutation probability on all edges of the tree is less than p* = (√2-1)/23/2, then the tree can be recovered from sequences of length O(log n). This was proven by the second author in the special case where the tree is \"balanced\". The second author also proved that if all edges have mutation probability larger than p* then the length needed is nΩ(1). This \"phase-transition\" in the number of samples needed is closely related to the phase transition for the reconstruction problem (or extremality of free measure) studied extensively in statistical physics, probability and computer science.Here we complete the proof of Steel's conjecture and give a reconstruction algorithm using optimal (up to a multiplicative constant) sequence length. Our results further extend to obtain an optimal reconstruction algorithm for the Jukes-Cantor model with short edges. All reconstruction algorithms run in polynomial time.","authors":["Constantinos Daskalakis","Elchanan Mossel","Sebastien Roch"],"meta":["May 2006","DOI:10.1145/1132516.1132540","SourceDBLP","Conference: Proceedings of the 38th Annual ACM Symposium on Theory of Computing, Seattle, WA, USA, May 21-23, 2006"],"references":["225703548_Glauber_Dynamics_on_Trees_Boundary_Conditions_and_Mixing_Time","313123661_In_Munro_HN_ed_Mammalian_Protein_Metabolism","262288368_Glauber_Dynamics_onTrees_and_Hyperbolic_Graphs","239063760_A_Probability_Model_for_Inferring_Evolutionary_Trees","238851896_Taxonomy_with_confidence","238722714_Molecular_studies_of_evolution_A_source_of_novel_statistical_problems","226508411_On_the_Extremality_of_the_Disordered_State_for_the_Ising_Model_on_the_Bethe_Lattice","226205967_On_the_purity_of_limiting_Gibbs_state_for_the_Ising_model_on_the_Bethe_lattice","220780162_Fast_mixing_for_independent_sets_colorings_and_other_models_on_trees","220148386_A_Few_Logs_Suffice_to_Build_almost_All_Trees_Part_II"]}