{"id":"221590732_The_Complexity_of_Satisfiability_Problems","abstract":"The problem of deciding whether a given propositional formula in conjunctive normal form is satisfiable has been widely studied. I t is known that, when restricted to formulas having only two literals per clause, this problem has an efficient (polynomial-time) solution. But the same problem on formulas having three literals per clause is NP-complete, and hence probably does not have any efficient solution.In this paper, we consider an infinite class of satisfiability problems which contains these two particular problems as special cases, and show that every member of this class is either polynomial-time decidable or NP-complete. The infinite collection of new NP-complete problems so obtained may prove very useful in finding other new NP-complete problems. The classification of the polynomial-time decidable cases yields new problems that are complete in polynomial time and in nondeterministic log space.We also consider an analogous class of problems, involving quantified formulas, which has the property that every member is either polynomial time decidable or complete in polynomial space.","authors":["Thomas J. Schaefer"],"meta":["January 1978","DOI:10.1145/800133.804350","SourceDBLP","Conference: Proceedings of the 10th Annual ACM Symposium on Theory of Computing, May 1-3, 1978, San Diego, California, USA"],"references":["221580898_Reducibility_Among_Combinatorial_Problems","284039089_Reducibility_among_combinatorial_problems","243786259_Two-value_iterative_systems","235625105_The_Two-Valued_Iterative_Systems_of_Mathematical_Logic","234785422_A_note_on_disjunctive_form_tautologies","222961722_Complete_problems_for_deterministic_polynomial_time","222644906_Space-Bounded_Reducibility_among_Combinatorial_Problems","222216339_Relationships_between_nondeterministic_and_deterministic_tape_complexities","221591101_The_Complexity_of_Theorem-Proving_Procedures","220431995_Putnam_H_A_Computing_Procedure_for_Quantification_Theory_Journal_of_the_ACM_7_201-215"]}