{"id":"221587552_Composing_Non-functional_Concerns_in_Composite_Web_Services","abstract":"The support for non-functional concerns (NFC) is essential for the success and adoption of web services. However, state of the art works offer only a limited support for these concerns especially when it comes to the composition of multiple non-functional concerns with composite web services. In this paper, we focus on the composition of non-functional actions (NFA) with composite web services whose composition logic is made explicit using languages such as BPMN2 or WS-BPEL (gray box view). In contrast to the black box view where only the interface of the service is visible the gray box view reveals additional information on control flow, data flow, composed services, etc. NFAs can also be composite and constitute complex processes such as secure conversations or transactions which have to be integrated with composite web services. Additionally, the execution order of multiple superimposing NFA has to be declared. In our approach we introduce a model-driven approach for the integrated specification and realization of the different types of NFC composition (NFAs with composite services, execution order of superimposing NFAs and composite NFAs) as well as a set of editors and code generators supporting this approach.","authors":["Benjamin Schmeling","Anis Charfi","Mira Mezini"],"meta":["July 2011","DOI:10.1109/ICWS.2011.111","SourceDBLP","Conference: IEEE International Conference on Web Services, ICWS 2011, Washington, DC, USA, July 4-9, 2011"],"references":["249664807_Web_Services_Business_Process_Execution_Language_Version_20","221587606_Composing_Services_for_Third-party_Service_Delivery","221587052_A_Service-oriented_Middleware_for_Runtime_Web_Services_Interoperability","221586191_Isolating_Process-Level_Concerns_Using_Padus","220344551_A_Loosely_Coupled_Aspect_Language_for_SOA_Applications","216884810_Composing_Software_from_Multiple_Concerns_A_Model_and_Composition_Anomalies","4223310_An_Architecture_for_Developing_Aspect-Oriented_Web_Services","3248322_Unraveiling_Crosscutting_Concerns_in_Web_Services_Middleware","252064991_Web_Services_Business_Process_Execution_Language_Version_20_OASIS_Standard","224678235_Reliable_Secure_and_Transacted_Web_Service_Compositions_with_AO4BPEL","222690537_Tailorable_language_for_behavioral_composition_and_configuration_of_software_components","220989581_Aspect-Oriented_Business_Process_Modeling_with_AO4BPMN","200034148_XML_path_language_XPath_version_10"]}