{"id":"221544841_Robust_face_recognition_under_illumination_and_facial_expression_variations","abstract":"Illumination and expression variations are still a challenging problem in face recognition. In this work, we present an efficient face recognition method which can solve the above two problems with single training sample. At first, the effect of the lighting variation is effectively eliminated by the Multi-Scale Retinex algorithm. The Active Appearance Model is adopted to extract the facial block feature to establish the component-based face recognition system. Different from other methods which construct the various classifiers corresponding to the specific facial expression, the proposed method decreases the weights of some dominated facial features which are affected by the severe facial expression. By learning a block weighting support vector machine, the component based approach is achieved. The proposed algorithm has two advantages: (1) only single one face training image is needed to train the classifier; (2) by using the facial block features with lower data dimensions, the proposed system is more computational efficiency. In particular, the proposed method achieves 97.94% face recognition accuracy when only using one training sample on the Yale B database. Experimental results demonstrate that the proposed method has reliable recognition rate when face images are under illumination and facial expression variations.","authors":["Ching-Liang Lu","Luo-Wei Tsai","Yuan-Kai Wang","Kuo-Chin Fan"],"meta":["July 2010","DOI:10.1109/ICMLC.2010.5580693","SourceDBLP","Conference: International Conference on Machine Learning and Cybernetics, ICMLC 2010, Qingdao, China, July 11-14, 2010, Proceedings"],"references":["221305430_Face_Recognition_Using_Active_Appearance_Models","284262417_The_retinex","262163115_Active_Appearance_Models","243743603_What_is_the_set_of_images_of_an_object_under_all_possible_lighting_con-ditions","243483782_Component-based_subspace_linear_discriminant_analysis_method_for_face_recognition_with_one_training_sample","240297269_The_Ugly_American_Scientist","224357025_Expression-Compensated_3D_Face_Recognition_with_Geodesically_Aligned_Bilinear_Models","222550242_Face_recognition_Component-based_versus_global_approaches_Computer_Vision_and_Image_Understanding","222427554_Feature_extraction_based_on_Laplacian_bidirectional_maximum_margin_criterion","221318508_An_efficient_image_normalization_method_for_face_recognition_under_varying_illuminations"]}