{"id":"221587128_Combining_Configuration_and_Query_Rewriting_for_Web_Service_Composition","abstract":"In this paper, we investigate the combination of configuration and query rewriting for semantic Web service composition. Given a user query and a set of service descrip- tions, we rely on query rewriting to find services that imple- ment the functionalities expressed in the user query (discovery stage). Then, we use configuration to capture dependencies between services, and to generate a set of composed Web ser- vices described as a directed acyclic graph, while maintaining validity with respect to business rules (orchestration stage). Finally, we propose a semantic ranking algorithm to rank results according to user preferences (classification stage). The techniques used in our approach take into account the semantics of concepts utilized to describe the elements (services, business rules, query and user preferences) involved in the composition process. We provide a formal approach and its implementation, together with experiments on Web services from different application domains.","authors":["Amin Mesmoudi","Michael Mrissa","Mohand-Said Hacid"],"meta":["July 2011","DOI:10.1109/ICWS.2011.26","SourceDBLP","Conference: IEEE International Conference on Web Services, ICWS 2011, Washington, DC, USA, July 4-9, 2011"],"references":["228769322_A_data_integration_approach_to_automatically_composing_and_optimizing_web_services","228630145_Template-based_composition_of_semantic_web_services","226058510_Practical_Reasoning_for_Expressive_Description_Logics","313764016_Pellet_An_OWL_DL_reasoner","283399496_Exploring_Relational_Structures_Via_mathcalFLE","247045719_On_the_Role_Of_Scientific_Thought","225117291_A_Semantic_Rewriting_Approach_to_Automatic_Information_Providing_Web_Service_Composition","225104149_Dynamic_web_service_composition_based_on_OWL-S","222557344_Pellet_a_practical_OWL-DL_reasoner","221589944_Geographic_information_retrieval_to_suit_immediate_surroundings"]}