{"id":"221520217_A_holistic_lexicon-based_approach_to_opinion_mining","abstract":"One of the important types of information on the Web is the opinions expressed in the user generated content, e.g., customer reviews of products, forum posts, and blogs. In this paper, we focus on customer reviews of products. In particular, we study the problem of determining the semantic orientations (positive, negative or neutral) of opinions expressed on product features in reviews. This problem has many applications, e.g., opinion mining, summarization and search. Most existing techniques utilize a list of opinion (bearing) words (also called opinion lexicon) for the purpose. Opinion words are words that express desirable (e.g., great, amazing, etc.) or undesirable (e.g., bad, poor, etc) states. These approaches, however, all have some major shortcomings. In this paper, we propose a holistic lexicon-based approach to solving the problem by exploiting external evidences and linguistic conventions of natural language expressions. This approach allows the system to handle opinion words that are context dependent, which cause major difficulties for existing algorithms. It also deals with many special words, phrases and language constructs which have impacts on opinions based on their linguistic patterns. It also has an effective function for aggregating multiple conflicting opinion words in a sentence. A system, called Opinion Observer, based on the proposed technique has been implemented. Experimental results using a benchmark product review data set and some additional reviews show that the proposed technique is highly effective. It outperforms existing methods significantly.","authors":["Xiaowen Ding","Bing Liu","Philip S. Yu"],"meta":["January 2008","DOI:10.1145/1341531.1341561","SourceDBLP","Conference: Proceedings of the International Conference on Web Search and Web Data Mining, WSDM 2008, Palo Alto, California, USA, February 11-12, 2008"],"references":["313505614_Fully_automatic_lexicon_expansion_for_domain-oriented_sentiment_analysis","271451830_Automatic_construction_of_polarity-tagged_corpus_from_HTML_documents","248832100_Thumbs_Up_or_Thumbs_Down_Semantic_Orientation_Applied_to_Unsupervised_Classification_of_Reviews","234819093_Toward_opinion_summarization_linking_the_sources","313492263_An_exploration_of_sentiment_summarization","268237801_Toward_opinion_summarization","247062408_Opinion_mining_on_the_Web_by_extracting_subject-attribute-value_relations","239557337_Yahoo_for_Amazon_extracting_market_sentiment_from_stock_message_boards","238672795_An_operational_system_for_detecting_and_tracking_opinions_in_on-line_discussion","230854795_WordNet_-_An_Electronical_Lexical_Database"]}