{"id":"221551318_Revisions_of_Knowledge_Systems_Using_Epistemic_Entrenchment","abstract":"A major problem for knowledge representation is how to revise a knowledge system in the light of new information that is inconsistent with what is already in the system. Another related problem is that of contractions, where some of the information in the knowledge system is taken away. Here, the problems of modelling revisions and contractions are attacked in two ways. First, two sets of rationality postulates or integrity constraints are presented, one for revisions and one for contractions. On the basis of these postulates it is shown that there is a natural correspondence between revisions and contractions. Second, a more constructive approach is adopted based on the \"epistemic entrenchment\" of the facts in a knowledge system which determines their priority in revisions and contractions. We introduce a set of computationally tractable constraints for an ordering of epistemic entrenchments. The key result is a representation theorem which says that a revision method for a knowledge system satisfies the set of rationality postulates, if and only if, there exists an ordering of epistemic entrenchment satisfying the appropriate constraints such that this ordering determines the retraction priority of the facts of the knowledge system. We also prove that the amount of information needed to uniquely determine the required ordering is linear in the number of atomic facts of the knowledge system.","authors":["Peter Gärdenfors","David Clement Makinson"],"meta":["March 1988","SourceDBLP","Conference: Proceedings of the 2nd Conference on Theoretical Aspects of Reasoning about Knowledge, Pacific Grove, CA, March 1988"],"references":["221551326_Theoretical_Foundations_for_Belief_Revision","220660565_Updating_Logical_Databases","220316041_On_the_Logic_of_Theory_Change_Partial_Meet_Contraction_and_Revision_Functions","220266311_On_the_Semantics_of_Updates_in_Databases","243763829_On_the_Status_Of_the_Postulate_Of_Recovery_In_the_Logic_Of_Theory_Change","232862339_Epistemic_Importance_and_Minimal_Changes_of_Belief","227255277_How_To_Give_It_Up_A_Survey_of_Some_Formal_Aspects_of_the_Logic_of_Theory_Change","226026449_Two_Modellings_for_Theory_Change","222750086_Counterfactuals","221218017_Towards_a_Logical_Reconstruction_of_Relational_Database_Theory"]}