{"id":"221591794_A_Hard-Core_Predicate_for_all_One-Way_Functions","abstract":"A central tool in constructing pseudorandom generators, secure encryption functions, and in other areas are “hard-core” predicates b of functions (permutations) ƒ, discovered in [Blum Micali 82]. Such b(x) cannot be efficiently guessed (substantially better than 50-50) given only ƒ(x). Both b, ƒ are computable in polynomial time.\n[Yao 82] transforms any one-way function ƒ into a more complicated one, ƒ*, which has a hard-core predicate. The construction applies the original ƒ to many small pieces of the input to ƒ* just to get one “hard-core” bit. The security of this bit may be smaller than any constant positive power of the security of ƒ. In fact, for inputs (to ƒ*) of practical size, the pieces effected by ƒ are so small that ƒ can be inverted (and the “hard-core” bit computed) by exhaustive search.\nIn this paper we show that every one-way function, padded to the form ƒ(p, x) = (p, g(x)), &Verbar;&Verbar;p&Verbar;&Verbar; = &Verbar;x&Verbar;, has by itself a hard-core predicate of the same (within a polynomial) security. Namely, we prove a conjecture of [Levin 87, sec. 5.6.2] that the scalar product of Boolean vectors p, x is a hard-core of every one-way function ƒ(p, x) = (p, g(x)). The result extends to multiple (up to the logarithm of security) such bits and to any distribution on the x's for which ƒ is hard to invert.","authors":["Oded Goldreich","Leonid A. Levin"],"meta":["January 1989","DOI:10.1145/73007.73010","SourceDBLP","Conference: Proceedings of the 21st Annual ACM Symposium on Theory of Computing, May 14-17, 1989, Seattle, Washigton, USA"],"references":["221354810_How_to_Construct_Pseudo-Random_Permutations_from_Pseudo-Random_Functions_Abstract","220616862_RSA_and_Rabin_Functions_Certain_Parts_are_as_Hard_as_the_Whole","284286127_One-way_function_and_pseudo-random_generators","239953769_Elucient_and_secure_pseudo-random_number_genera-tion","235008694_How_to_generate_cryptographically_strong_sequences_of_pseudorandom_bits","235008641_Theory_and_Applications_of_Trapdoor_Functions","234826533_Digitalized_Signatures_and_Public-Key_Functions_as_Intractable_as_Factorization","222439046_Probabilistic_Encryption","221591172_How_Discreet_is_the_Discrete_Log","220617513_A_Simple_Unpredictable_Pseudo-Random_Number_Generator"]}