{"id":"221587318_Recovery_Policies_for_Enhancing_Web_Services_Reliability","abstract":"Web services are gaining acceptance as a standards-based approach for integrating loosely coupled services often distributed over a network. Hence, achieving high levels of reliability and availability in spite of service or infrastructure failures poses unique set of challenges. However, Web services middleware provide limited constructs for specifying faults detection and recovery actions. Additionally, faults-handling logic often gets scattered and tangled with the service logic. Consequently, this negatively impacts maintainability and adaptability. To address these requirements for reliable and fault tolerant Web services execution, we propose set extensible recovery policies to declaratively specify how to handle and recover from typical faults in Web services composition. The identified constructs were incorporated into a lightweight service management middleware named MASC (manageable and adaptive service composition) to transparently enact the fault management policies and facilitate the monitoring, configuration and control of managed services. Several experimental results with a service based supply chain management system illustrate the effectiveness of our approach to providing reliable and uninterrupted services","authors":["Abdelkarim Erradi","Piyush Kumar Maheshwari","Vladimir Tosic"],"meta":["January 2006","DOI:10.1109/ICWS.2006.110","SourceDBLP","Conference: 2006 IEEE International Conference on Web Services (ICWS 2006), 18-22 September 2006, Chicago, Illinois, USA"],"references":["221194683_Recovery_Nets_Towards_Self-Adaptive_Workflow_Systems","220920878_Developing_Adapters_for_Web_Services_Integration","4079806_An_externalized_infrastructure_for_self-healing_systems","3449335_Basic_Concepts_and_Taxonomy_of_Dependable_and_Secure_Computing","239769746_AdaptiveBPEL_a_Policy-Driven_Middleware_for_Flexible_Web_Services_Composition","237244520_Web_Services_Policy_Framework_WS_Policy","228679429_An_aspect-based_process_container_for_BPEL","4186752_A_broker-based_approach_for_improving_Web_services_reliability","4129553_wsBus_QoS-Aware_Middleware_for_Reliable_Web_Services_Interactions"]}