{"id":"221588708_Comprehensive_Triangular_Decomposition","abstract":"We introduce the concept of comprehensive triangular decomposition (CTD) for a parametric polynomial system F with coefficients in a field. In broad words, this is a finite partition of the the parameter space into regions, so that within each region the “geometry” (number of irreducible components together with their dimensions and degrees) of the algebraic variety of the specialized system F(u) is the same for all values u of the parameters.\nWe propose an algorithm for computing the CTD of F. It relies on a procedure for solving the following set theoretical instance of the coprime factorization problem. Given a family of constructible sets A\n1, ..., A\ns\n, compute a family B\n1, ..., B\nt\nof pairwise disjoint constructible sets, such that for all 1 ≤ i ≤ s the set A\ni\nwrites as a union of some of the B\n1, ..., B\nt\n.\nWe report on an implementation of our algorithm computing CTDs, based on the RegularChains library in maple. We provide comparative benchmarks with maple implementations of related methods for solving parametric polynomial systems. Our results illustrate the good performances of our CTD code.","authors":["Changbo Chen","Oleg Golubitsky","François Lemaire","Marc Moreno Maza"],"meta":["September 2007","DOI:10.1007/978-3-540-75187-8_7","SourceDBLP","Conference: Computer Algebra in Scientific Computing, 10th International Workshop, CASC 2007, Bonn, Germany, September 16-20, 2007, Proceedings"],"references":["265519861_Solving_Zero-Dimensional_Systems_Through_the_Rational_Univariate_Representation","244742960_Preservation_potential_of_individual_couplet_and_deposition_rates_on_mudflats_in_the_Changjiang_Estuary","321600842_Quantifier_Elimination_and_Cylindrical_Algebraic_Decomposition","285022943_A_zero_structure_theorem_for_polynomial_equations_solving","284954895_Sur_la_resolution_des_equations_numeriques","274653094_Commutative_Algebra_Vol_I","268886642_Geometric_Computation","265639649_On_a_projection_theorem_of_quasi-varieties_in_elimination_theory","247321950_Quelques_applications_de_l''evaluation_dynamique","242788267_The_RegularChains_library_in_MAPLE"]}