{"id":"221559427_Multiobjective_Query_Optimization","abstract":"The optimization of queries in distributed database systems is known to be subject to delicate trade-offs. For example, the Mariposa database system allows users to specify a desired delay-cost tradeoff (that is, to supply a decreasing function u(d), specifying how much the user is willing to pay in order to receive the query results within time d); Mariposa divides a query graph into horizontal “strides,” analyzes each stride, and uses a greedy heuristic to find the “best” plan for all strides. We show that Mariposa's greedy heuristic can be arbitrarily far from the desired optimum. Applying a recent approach in multiobjective optimization algorithms to this problem, we show that the optimum cost-delay trade-off (Pareto) curve in Mariposa's framework can be approximated fast within any desired accuracy. We also present a polynomial algorithm for the general multiobjective query optimization problem, which approximates arbirarily well the optimum cost-delay tradeoff (without the restriction of Mariposa's heuristic stride subdivision).","authors":["Christos H. Papadimitriou","Mihalis Yannakakis"],"meta":["January 2001","DOI:10.1145/375551.375560","SourceDBLP","Conference: Proceedings of the Twentieth ACM SIGACT-SIGMOD-SIGART Symposium on Principles of Database Systems, May 21-23, 2001, Santa Barbara, California, USA"],"references":["2573381_Mariposa_A_Wide-Area_Distributed_Database_System","268536515_Survey_of_algorithms_for_vector_optimisation_problems","265372525_Bicriterion_Path_Problems","262207386_Efficient_information_gathering_on_the_Internet","245587132_Bicriterion_Single_Machine_Scheduling_with_Resource_Dependent_Processing_Times","230595783_Approximation_of_Pareto_Optima_in_Multiple-Objective_Shortest-Path_Problems","201168961_Multicriteria_Analysis","3880857_On_the_approximability_of_trade-offs_and_optimal_access_of_Web_sources","2614829_Scheduling_Problems_in_Parallel_Query_Optimization","2266189_Optimization_Algorithms_for_Exploiting_the_Parallelism-Communication_Tradeoff_in_Pipelined_Parallelism"]}