{"id":"221591524_Multiplicative_Updates_Outperform_Generic_No-Regret_Learning_in_Congestion_Games","abstract":"We study the outcome of natural learning algorithms in atomic congestion games. Atomic congestion games have a wide variety of equilibria often with vastly differing social costs. We show that in almost all such games, the well-known multiplicative-weights learning algorithm results in convergence to pure equilibria. Our results show that natural learning behavior can avoid bad outcomes predicted by the price of anarchy in atomic congestion games such as the load-balancing game introduced by Koutsoupias and Papadimitriou, which has super-constant price of anarchy and has correlated equilibria that are exponentially worse than any mixed Nash equilibrium. Our results identify a set of mixed Nash equilibria that we call weakly stable equilibria. Our notion of weakly stable is defined game-theoretically, but we show that this property holds whenever a stability criterion from the theory of dynamical systems is satisfied. This allows us to show that in every congestion game, the distribution of play converges to the set of weakly stable equilibria. Pure Nash equilibria are weakly stable, and we show using techniques from algebraic geometry that the converse is true with probability 1 when congestion costs are selected at random independently on each edge (from any monotonically parametrized distribution). We further extend our results to show that players can use algorithms with different (sufficiently small) learning rates, i.e. they can trade off convergence speed and long term average regret differently.","authors":["Robert D. Kleinberg","Georgios Piliouras","Éva Tardos"],"meta":["January 2009Proceedings of the Annual ACM Symposium on Theory of Computing","DOI:10.1145/1536414.1536487","SourceDBLP","Conference: Proceedings of the 41st Annual ACM Symposium on Theory of Computing, STOC 2009, Bethesda, MD, USA, May 31 - June 2, 2009"],"references":["265311594_Routing_Games","314908663_Stochastic_Uncoupled_Dynamics_and_Nash_Equilibrium","287012375_Worst-case_equilibria_in_Symposium_on_Theoretical_Aspects_of_Computer_Science","274861256_Evolutionary_Game_Theory","274804366_The_Geometry_of_Population_Genetics","268243403_Selfish_load_balancing","265574962_Population_Games_and_Evolutionary_Dynamics","250379371_Learning_Regret_Minimization_and_Equilibria","248674553_Differential_Equations_and_Dynamical_Systems","243970871_Evolutionary_Games_and_Population_Dynamics"]}