{"id":"221540578_Conflict-Free_Replicated_Data_Types","abstract":"Replicating data under Eventual Consistency (EC) allows any replica to accept updates without remote synchronisation. This ensures performance and scalability in large-scale distributed systems (e.g., clouds). However, published EC approaches are ad-hoc and error-prone. Under a formal Strong Eventual Consistency (SEC) model, we study sufficient conditions for convergence. A data type that satisfies these conditions is called a Conflict-free Replicated Data Type (CRDT). Replicas of any CRDT are guaranteed to converge in a self-stabilising manner, despite any number of failures. This paper formalises two popular approaches (state- and operation-based) and their relevant sufficient conditions. We study a number of useful CRDTs, such as sets with clean semantics, supporting both \\add and \\remove operations, and consider in depth the more complex Graph data type. CRDT types can be composed to develop large-scale distributed applications, and have interesting theoretical properties.","authors":["Marc Shapiro","Nuno M. Preguiça","Carlos Baquero","Marek Zawirski"],"meta":["July 2011","DOI:10.1007/978-3-642-24550-3_29","SourceDBLP","Conference: Stabilization, Safety, and Security of Distributed Systems - 13th International Symposium, SSS 2011, Grenoble, France, October 10-12, 2011. Proceedings"],"references":["228542159_Proving_correctness_of_transformation_functions_in_collaborative_editing_systems","227296355_Self-stabilization_with_r-Operators_Revisited","224928722_Self-stabilization_with_r-Operators_Revisited","221602578_Semantics_of_Concurrent_Revisions","285723183_Operational_transformation_in_real-time_group_editors_Issues_algorithms_and_achievements","278639526_Dynamo","247484077_Semantic-based_reconciliation_for_collaboration_in_mobile_environments","247409024_RFC677_The_maintenance_of_duplicate_databases","239564319_The_maintenance_of_duplicate_data_bases","221540393_r-Semi-Groups_A_Generic_Approach_for_Designing_Stabilizing_Silent_Tasks"]}