{"id":"221552319_Ambiguity_Detection_Towards_a_Tool_Explaining_Ambiguity_Sources","abstract":"[Context and motivation] Natural language is the main representation means of industrial requirements documents, which implies that requirements documents are inherently ambiguous. There exist guidelines for ambiguity detection, such as the Ambiguity Handbook [1]. In order to detect ambiguities according to the existing guidelines, it is necessary to train analysts.\n[Question/problem] Although ambiguity detection guidelines were extensively discussed in literature, ambiguity detection has not been automated yet. Automation of ambiguity detection is one of the goals of the presented paper. More precisely, the approach and tool presented in this paper have three goals: (1) to automate ambiguity detection, (2) to make plausible for the analyst that ambiguities detected by the tool represent genuine problems of the analyzed document, and (3) to educate the analyst by explaining the sources of the detected ambiguities.\n[Principal ideas/results] The presented tool provides reliable ambiguity detection, in the sense that it detects four times as many genuine ambiguities as than an average human analyst. Furthermore, the tool offers high precision ambiguity detection and does not present too many false positives to the human analyst.\n[Contribution] The presented tool is able both to detect the ambiguities and to explain ambiguity sources. Thus, besides pure ambiguity detection, it can be used to educate analysts, too. Furthermore, it provides a significant potential for considerable time and cost savings and at the same time quality improvements in the industrial requirements engineering.","authors":["Benedikt Gleich","Oliver Creighton","Leonid Kof"],"meta":["June 2010","DOI:10.1007/978-3-642-14192-8_20","SourceDBLP","Conference: Requirements Engineering: Foundation for Software Quality, 16th International Working Conference, REFSQ 2010, Essen, Germany, June 30 - July 2, 2010. Proceedings"],"references":["269699729_Requirements_for_tools_for_ambiguity_identification_and_measurement_in_natural_language_requirements_specifications","228861133_From_Contract_Drafting_to_Software_Specification_Linguistic_Sources_of_Ambiguity","340164829_Requirements-Engineering_und_-Management_Professionelle_Anforderungsanalyse_im_agilen_und_nicht_agilen_Umfeld","319394983_Artificial_Intelligence_A_Modern_Approach","243784891_Requirements-Engineering_und-Management","242456331_Part-of-speech_Tagging_Guidelines_for_the_Penn_Treebank_Project","239638344_An_Empirical_Investigation_of_Requirements_Specification_Languages_Detecting_Defects_While_Formalizing_Requirements","239047519_Guidelines_fur_das_Tagging_deutscher_Textcorpora_mit_STTS","234804535_The_use_of_lexical_affinities_in_requirements_extraction","234779752_Attempto_Controlled_English_ACELanguage_ManualVersion_30"]}