{"id":"221574013_Memory_efficient_state-space_analysis_in_software_model-checking","abstract":"Formal methods have an unprecedented ability to endorse the correctness of a system. In spite of that, it has been limited to safety-critical and mission-critical systems owing to significant time and memory costs involved. Lately, our ever increasing dependency on software in all walks of our life has necessitated using formal methods for a wider range of softwares. In this paper, we propose an algorithm to make this possible by reducing the memory requirement for model checking, a widely used formal method. A modelchecker stores all explored states in memory to ensure termination. The proposed algorithm slash memory costs by storing these states in compressed form. In compressed form, a state is stored as how different it is from its previous state. Our experiments report a memory reduction of 95% with only doubling of computation delay. Aforesaid reduction allows model checking in a machine with only a fraction of memory needed otherwise. Consequently the advantage is twofold, 1) enormous savings as only a small physical memory is required and 2) as more states can now be stored in a memory of same size, the chances of complete state-space analysis is exceedingly high.","authors":["Anshuman Mukherjee","Zahir Tari","P. Bertok"],"meta":["January 2010","SourceDBLP","Conference: Computer Science 2010, Thirty-Third Australasian Computer Science Conference (ACSC 2010), Brisbane, Australia, January 18-22, 2010, Proceedings"],"references":["221105591_Memory_Efficient_State_Space_Storage_in_Explicit_Software_Model_Checking","2668759_State_Compression_in_SPIN_Recursive_Indexing_and_Compression_Training_Runs","247442902_Introduction_To_Algorithms","229124338_Coloured_Petri_Nets_Basic_Concepts_Analysis_Methods_and_Practical_Use_Volume_1","229124335_Coloured_Petri_Nets_Basic_Concepts_Analysis_Methods_and_Practical_Use","221402911_Reliable_Hashing_without_Collosion_Detection","221342973_Model_Checking_Historical_Perspective_and_Example_Extended_Abstract","220851992_Using_Petri_Net_Invariants_in_State_Space_Construction","220851979_A_Sweep-Line_Method_for_State_Space_Exploration"]}