{"id":"221546357_Hand_Gesture_Recognition_for_Human-Machine_Interaction","abstract":"Even after more than two decades of input devices development, many people still find the interaction with computers an uncomfortable experience. Efforts should be made to adapt computers to our natural means of communication: speech and body language. The PUI paradigm has emerged as a post-WIMP interface paradigm in order to cover these preferences. The aim of this paper is the proposal of a real time vision system for its application within visual interaction environments through hand gesture recognition, using general-purpose hardware and low cost sensors, like a simple personal computer and an USB web cam, so any user could make use of it in his office or home. The basis of our approach is a fast segmentation process to obtain the moving hand from the whole image, which is able to deal with a large number of hand shapes against different backgrounds and lighting conditions, and a recognition process that identifies the hand posture from the temporal sequence of segmented hands. The most important part of the recognition process is a robust shape comparison carried out through a Hausdorff distance approach, which operates on edge maps. The use of a visual memory allows the system to handle variations within a gesture and speed up the recognition process through the storage of different variables related to each gesture. This paper includes experimental evaluations of the recognition process of 26 hand postures and it discusses the results. Experiments show that the system can achieve a 90% recognition average rate and is suitable for real-time applications.","authors":["Elena Nielsen","Luis Antón-Canalís","Mario Hernández-Tejera"],"meta":["January 2004","SourceDBLP"],"references":["225324388_DESEO_An_Active_Vision_System_for_Detection_Tracking_and_Recognition","274686643_Hand_tracking_using_the_Hausdorff_distance","262402054_Increasing_Efficiency_of_Hausdorff_Approach_for_Tracking_Real_Scenes_with_Complex_Environments","262334421_Post-WIMP_user_interfaces","243785475_Smart_Rooms_Machine_Understanding_of_Human_Behavior","223870114_Comparing_face_images_using_the_modified_Hausdorff_distance","221111746_A_State-Based_Technique_for_the_Summarization_and_Recognition_of_Gesture","215439348_Television_Control_by_Hand_Gestures","3917971_Increasing_efficiency_of_Hausdorff_approach_for_tracking_real_scenes_with_complex_environments","3358769_Visual_gesture_recognition"]}