{"id":"221520166_You_are_who_you_know_Inferring_user_profiles_in_online_social_networks","abstract":"Online social networks are now a popular way for users to connect, express themselves, and share content. Users in to- day's online social networks often post a profile, consisting of attributes like geographic location, interests, and schools attended. Such profile information is used on the sites as a basis for grouping users, for sharing content, and for sug- gesting users who may benefit from interaction. However, in practice, not all users provide these attributes. In this paper, we ask the question: given attributes for some fraction of the users in an online social network, can we infer the attributes of the remaining users? In other words, can the attributes of users, in combination with the social network graph, be used to predict the attributes of another user in the network? To answer this question, we gather fine-grained data from two social networks and try to infer user profile attributes. We find that users with com- mon attributes are more likely to be friends and often form dense communities, and we propose a method of inferring user attributes that is inspired by previous approaches to detecting communities in social networks. Our results show that certain user attributes can be inferred with high accu- racy when given information on as little as 20% of the users.","authors":["Alan Mislove","Bimal Viswanath","Krishna P. Gummadi","Peter Druschel"],"meta":["January 2010","DOI:10.1145/1718487.1718519","SourceDBLP","Conference: Proceedings of the Third International Conference on Web Search and Web Data Mining, WSDM 2010, New York, NY, USA, February 4-6, 2010"],"references":["228057937_Data_mining_in_social_networks","221653417_Finding_tribes_identifying_close-knit_individuals_from_employment_patterns","221611895_Measurement_and_Analysis_of_Online_Social_Networks","221518104_Homophily_in_online_dating_When_do_you_like_someone_like_yourself","221022283_To_join_or_not_to_join_The_illusion_of_privacy_in_social_networks_with_mixed_public_and_private_user_profiles","311344563_Finding_community_structure_in_very_large_networks","304533565_Finding_community_structure_in_very_large_networksJ","253253918_Detecting_Community_Structure_in_Networks","233822040_Birds_of_a_Feather_Homophily_in_Social_Networks","222401825_Friends_and_Neighbors_on_the_Web"]}