{"id":"221606983_Automatically_Constructing_a_Dictionary_for_Information_Extraction_Tasks","abstract":"Knowledge-based natural language processing systems have achieved good success with certain tasks but they are often criticized because they depend on a domain-specific dictionary that requires a great deal of manual knowledge engineering. This knowledge engineering bottleneck makes knowledge-based NLP systems impractical for real-world applications because they cannot be easily scaled up or ported to new domains. In response to this problem, we developed a system called AutoSlog that automatically builds a domain-specific dictionary of concepts for extracting information from text. Using AutoSlog, we constructed a dictionary for the domain of terrorist event descriptions in only 5 person-hours. We then compared the AutoSlog dictionary with a hand-crafted dictionary that was built by two highly skilled graduate students and required approximately 1500 person-hours of effort. We evaluated the two dictionaries using two blind test sets of 100 texts each. Overall, the AutoSlog dictionary achieved 98% of the performance of the hand-crafted dictionary. On the first test set, the AutoSlog dictionary obtained 96.3% of the performance of the hand-crafted dictionary. On the second test set, the overall scores were virtually indistinguishable with the AutoSlog dictionary achieving 99.7% of the performance of the handcrafted dictionary.","authors":["Ellen Riloff"],"meta":["January 1993","SourceDBLP","Conference: Proceedings of the 11th National Conference on Artificial Intelligence. Washington, DC, USA, July 11-15, 1993."],"references":["220873868_Towards_a_Self-Extending_Parser","220825505_University_of_Massachusetts_Description_of_the_CIRCUS_system_as_used_for_MUC-4","220825484_University_of_Massachusetts_MUC-4_test_results_and_analysis","220344164_Knowledge_Acquisition_Via_Incremental_Conceptual_Clustering","242382431_Frequency_Analysis_of_English_Usage","234806720_ID_An_Incremental_ID3","228359097_Explanation-Based_Learning_An_Alternative_View","220815930_FOUL-UP_A_program_that_figures_out_meanings_of_words_from_context","220343973_Explanation-Based_Generalization_A_Unifying_View","3593363_Automated_dictionary_construction_for_information_extraction_from_text"]}