{"id":"221628053_Identifying_the_optimal_energy-efficient_operating_points_of_parallel_workloads","abstract":"As the number of cores per processor grows, there is a strong incentive to develop parallel workloads to take advantage of the hardware parallelism. In comparison to single-threaded applications, parallel workloads are more complex to characterize due to thread interactions and resource stalls. This paper presents an accurate and scalable method for determining the optimal system operating points (i.e., number of threads and DVFS settings) at runtime for parallel workloads under a set of objective functions and constraints that optimize for energy efficiency in multi-core processors. Using an extensive training data set gathered for a wide range of parallel workloads on a commercial multi-core system, we construct multinomial logistic regression (MLR) models that estimate the optimal system settings as a function of workload characteristics. We use L1-regularization to automatically determine the relevant workload metrics for energy optimization. At runtime, our technique determines the optimal number of threads and the DVFS setting with negligible overhead. Our experiments demonstrate that our method outperforms prior techniques with up to 51% improved decision accuracy. This translates to up to 10.6% average improvement in energy-performance operation, with a maximum improvement of 30.9%. Our technique also demonstrates superior scalability as the number of potential system operating points increases.","authors":["Ryan Cochran","Can Hankendi","Ayse Kivilcim Coskun","Sherief Reda"],"meta":["November 2011IEEE/ACM International Conference on Computer-Aided Design, Digest of Technical Papers","DOI:10.1109/ICCAD.2011.6105393","SourceDBLP","Conference: 2011 IEEE/ACM International Conference on Computer-Aided Design (ICCAD), San Jose, California, USA, November 7-10, 2011"],"references":["228735976_Woldwide_electricity_use_in_data_centers","224343605_System_level_analysis_of_fast_per-core_DVFS_using_on-chip_switching_regulators","221341061_Profile-Based_Dynamic_Voltage_Scheduling_Using_Program_Checkpoints","221005454_An_Analysis_of_Efficient_Multi-Core_Global_Power_Management_Policies_Maximizing_Performance_for_a_Given_Power_Budget","220939094_PowerNap_Eliminating_Server_Idle_Power","302543541_Profile-based_Dynamic_Voltage_and_Frequency_Scaling_for_a_Multiple_Clock_Domain_Microprocessor","285228497_Worldwide_electricity_used_in_data_centers_environmental_research_letters","221230097_Optimizing_job_performance_under_a_given_power_constraint_in_HPC_centers","221151128_Applying_statistical_machine_learning_to_multicore_voltage_frequency_scaling","221005127_Live_Runtime_Phase_Monitoring_and_Prediction_on_Real_Systems_with_Application_to_Dynamic_Power_Management"]}