{"id":"221653507_MONIC_-_Modeling_and_monitoring_cluster_transitions","abstract":"There is much recent work on detecting and tracking change in clusters, often based on the study of the spatiotemporal properties of a cluster. For the many applications where cluster change is relevant, among them customer relation- ship management, fraud detection and marketing, it is also necessary to provide insights about the nature of cluster change: Is a cluster corresponding to a group of customers simply disappearing or are its members migrating to other clusters? Is a new emerging cluster reflecting a new target group of customers or does it rather consist of existing cus- tomers whose preferences shift? To answer such questions, we propose the framework MONIC for modeling and track- ing of cluster transitions. Our cluster transition model en- compasses changes that involve more than one cluster, thus allowing for insights on cluster change in the whole clus- tering. Our transition tracking mechanism is not based on the topological properties of clusters, which are only avail- able for some types of clustering, but on the contents of the underlying data stream. We present our first results on monitoring cluster transitions over the ACM digital library. Categories and Subject Descriptors: H.2.8 (Database Management): Database Applications - Data Mining; I.5.3 (Pattern Recognition): Clustering","authors":["Myra Spiliopoulou","Irene Ntoutsi","Yannis Theodoridis","Rene Schult"],"meta":["January 2006","DOI:10.1145/1150402.1150491","SourceDBLP","Conference: Proceedings of the Twelfth ACM SIGKDD International Conference on Knowledge Discovery and Data Mining, Philadelphia, PA, USA, August 20-23, 2006"],"references":["277295105_Experiments_in_Document_Clustering_using_Cluster_Specific_Term_Weights","225140109_On_Discovering_Moving_Clusters_in_Spatio-temporal_Data","221654061_Tracking_dynamics_of_topic_trends_using_a_finite_mixture_model","220699810_A_Unified_and_Flexible_Framework_for_Comparing_Simple_and_Complex_Patterns","221900847_Data_Mining_Practical_Machine_Learning_Tools_And_Techniques","221653800_A_generalized_framework_for_mining_spatio-temporal_patterns_in_scientific_data","221651713_Efficient_Monitoring_of_Patterns_in_Data_Mining_Environments","221651543_Discovering_Emerging_Topics_in_Unlabelled_Text_Collections","221559539_A_Framework_for_Measuring_Changes_in_Data_Characteristics","220272030_Discovering_evolutionary_theme_patterns_from_text_-_An_exploration_of_Temporal_Text_Mining"]}