{"id":"221629181_An_Empirical_Study_on_the_Feature's_Type_Effect_on_the_Automatic_Classification_of_Arabic_Documents","abstract":"The Arabic language is a highly flexional and morphologically very rich language. It presents serious challenges to the automatic\nclassification of documents, one of which is determining what type of attribute to use in order to get the optimal classification\nresults. Some people use roots or lemmas which, they say, are able to handle problems with the inflections that do not appear\nin other languages in that fashion. Others prefer to use character-level n-grams since n-grams are simpler to implement, language\nindependent, and produce satisfactory results. So which of these two approaches is better, if any? This paper tries to answer\nthis question by offering a comparative study between four feature types: words in their original form, lemmas, roots, and\ncharacter level n-grams and shows how each affects the performance of the classifier. We used and compared the performance\nof Support Vector Machines and Naïve Bayesian Networks algorithms respectively.","authors":["Saeed Raheel","Joseph Dichy"],"meta":["March 2010","DOI:10.1007/978-3-642-12116-6_57","SourceDBLP","Conference: Computational Linguistics and Intelligent Text Processing, 11th International Conference, CICLing 2010, Iasi, Romania, March 21-27, 2010. Proceedings"],"references":["255010837_AraConc_an_Arabic_Concordance_Software_Based_on_the_DIINAR1_Language_Resource","248591742_An_extensive_empirical_study_of_feature_selection_metrics_for_text_classification_J","322715583_Data_Mining_practical_machine_learning_tools_and_techniques","304179964_Logistic_Regression","285278428_Text_Categorization_with_Support_Vector_Machines_Learning_with_Many_Relevant_Features","272722213_Pour_une_lexicomatique_de_l'arabe_l'unite_lexicale_simple_et_l'inventaire_fini_des_specificateurs_du_domaine_du_mot","270034913_Book_Review_The_Nature_of_Statistical_Learning_Theory","262566601_Data_Mining_Practical_Machine_Learning_Tools_and_Techniques_Third_Edition","250142588_Text_Mining_Technique_for_Data_Mining_Application","243763580_The_Nature_Of_Statistical_Learning_Theory"]}