{"id":"221651908_Cold_Boot_Key_Recovery_by_Solving_Polynomial_Systems_with_Noise","abstract":"A method for extracting cryptographic key material from DRAM used in modern computers has been recently proposed in [9]; the\ntechnique was called Cold Boot attacks. When considering block ciphers, such as the AES and DES, simple algorithms were also proposed in [9] to recover the cryptographic\nkey from the observed set of round subkeys in memory (computed via the cipher’s key schedule operation), which were however\nsubject to errors due to memory bits decay. In this work we extend this analysis to consider key recovery for other ciphers\nused in Full Disk Encryption (FDE) products. Our algorithms are also based on closest code word decoding methods, however\napply a novel method for solving a set of non-linear algebraic equations with noise based on Integer Programming. This method\nshould have further applications in cryptology, and is likely to be of independent interest. We demonstrate the viability\nof the Integer Programming method by applying it against the Serpent block cipher, which has a much more complex key schedule than AES. Furthermore, we also consider the Twofish key schedule,\nto which we apply a dedicated method of recovery.","authors":["Martin Albrecht","Carlos Cid"],"meta":["June 2011","DOI:10.1007/978-3-642-21554-4_4","SourceDBLP","Conference: Applied Cryptography and Network Security - 9th International Conference, ACNS 2011, Nerja, Spain, June 7-10, 2011. Proceedings"],"references":["245272403_Twofish_A_128Bit_Block_Cipher","230595676_Constraint_Integer_Programming","225105527_Algebraic_Side-Channel_Analysis_in_the_Presence_of_Errors","221354789_Distinguisher_and_Related-Key_Attack_on_the_Full_AES-256","234808644_The_Design_of_Rijndael","221354730_Reconstructing_RSA_Private_Keys_from_Random_Key_Bits","221326840_Lecture_Notes_in_Computer_Science","221274722_Related-key_rectangle_attack_on_the_full_SHACAL-1","221274545_An_Improved_Recovery_Algorithm_for_Decayed_AES_Key_Schedule_Images","221260534_Lest_We_Remember_Cold_Boot_Attacks_on_Encryption_Keys"]}