{"id":"221607733_PaleoSketch_Accurate_primitive_sketch_recognition_and_beautification","abstract":"Sketching is a natural form of human communication and has become an increasingly popular tool for interacting with user interfaces. In order to facilitate the integration of sketching into traditional user interfaces, we must first develop accurate ways of recognizing users' intentions while providing feedback to catch recognition problems early in the sketching process. One approach to sketch recognition has been to recognize low-level primitives and then hierarchically construct higher-level shapes based on geometric constraints defined by the user; however, current low-level recognizers only handle a few number of primitive shapes. We propose a new low-level recognition and beautification system that can recognize eight primitive shapes, as well as combinations of these primitives, with recognition rates at 98.56%. Our system also automatically generates beautified versions of these shapes to provide feedback early in the sketching process. In addition to looking at geometric perception, much of our recognition success can be attributed to two new features, along with a new ranking algorithm, which have proven to be significant in distinguishing polylines from curved segments.","authors":["Brandon Paulson","Tracy Anne Hammond"],"meta":["January 2008","DOI:10.1145/1378773.1378775","SourceDBLP","Conference: Proceedings of the 2008 International Conference on Intelligent User Interfaces, January 13-16, 2008, Gran Canaria, Canary Islands, Spain"],"references":["221517414_Visual_similarity_of_pen_gestures","220877257_Perceptually-supported_image_editing_of_text_and_graphics","220877009_Hierarchical_parsing_and_recognition_of_hand-sketched_diagrams","220184708_Perceptually-supported_image_editing_of_text_and_graphics","239278797_Sketchpad_A_Man-Machine_Graphical_Communication_System","223160224_LADDER_a_sketching_language_for_user_interface_developers","223146134_Clarifying_the_distinction_between_lexical_and_gestural_commands","222528207_A_curvature_estimation_for_pen_input_segmentation_in_sketch-based_modeling","220979112_A_domain-independent_system_for_sketch_recognition","220720539_Specifying_gestures_by_example"]}