{"id":"221654449_Visual_Classification_An_Interactive_Approach_to_Decision_Tree_Construction","abstract":"Satisfying the basic requirements of accuracy and understandability of a classifier, decision tree classifiers have become very popular. Instead of constructing the decision tree by a sophisticated algorithm, we introduce a fully interactive method based on a multidimen- sional visualization technique and appropriate interaction capabilities. Thus, domain knowl- edge of an expert can be profitably included in the tree construction phase. Furthermore, after the interactive construction of a decision tree, the user has a much deeper understanding of the data than just knowing the decision tree generated by an arbitrary algorithm. The inter- active approach also overcomes the limitation of most decision trees which are fixed to binary splits for numeric attributes and which do not allow to backtrack in the tree construction phase. Our performance evaluation with sev- eral well-known datasets demonstrates that even users with no a priori knowledge of the data construct a decision tree with an accuracy similar to the tree generated by state of the art algorithms. Additionally, visual interactive classification significantly reduces the tree size and improves the understandibility of the resulting decision tree.","authors":["Mihael Ankerst","Christian Elsen","Martin Ester","Hans-Peter Kriegel"],"meta":["January 1999","DOI:10.1145/312129.312298","SourceDBLP","Conference: Proceedings of the fifth ACM SIGKDD international conference on Knowledge discovery and data mining"],"references":["221653775_Targeting_Business_Users_with_Decision_Table_Classifiers","221214752_OPTICS_Ordering_Points_to_Identify_the_Clustering_Structure","30013012_Circle_Segments_A_Technique_for_Visually_Exploring_Large_Multidimensional_Data_Sets","3618236_Recursive_pattern_A_technique_for_visualizing_very_large_amounts_of_data","2828743_Independence_Diagrams_A_Technique_for_Visual_Data_Mining","2600603_Targeting_Business_Users_with_Decision_Table_Classifiers","242324728_Visual_support_for_query_specfication_and_data_mining","239552916_Visual_database_exploration_techniques","221310521_SPRINT_A_Scalable_Parallel_Classifier_for_Data_Mining","220815890_Multi-Interval_Discretization_of_Continuous-Valued_Attributes_for_Classification_Learning"]}