{"id":"221776109_Qualitative_Differences_between_Bilingual_Language_Control_and_Executive_Control_Evidence_from_Task-Switching","abstract":"Previous research has shown that highly proficient bilinguals have comparable switch costs in both directions when they switch between languages (L1 and L2), the so-called \"symmetrical switch cost\" effect. Interestingly, the same symmetry is also present when they switch between L1 and a much weaker L3. These findings suggest that highly proficient bilinguals develop a language control system that seems to be insensitive to language proficiency. In the present study, we explore whether the pattern of symmetrical switch costs in language switching tasks generalizes to a non-linguistic switching task in the same group of highly proficient bilinguals. The end goal of this is to assess whether bilingual language control (bLC) can be considered as subsidiary to domain-general executive control (EC). We tested highly proficient Catalan-Spanish bilinguals both in a linguistic switching task and in a non-linguistic switching task. In the linguistic task, participants named pictures in L1 and L2 (Experiment 1) or L3 (Experiment 2) depending on a cue presented with the picture (a flag). In the non-linguistic task, the same participants had to switch between two card sorting rule-sets (color and shape). Overall, participants showed symmetrical switch costs in the linguistic switching task, but not in the non-linguistic switching task. In a further analysis, we observed that in the linguistic switching task the asymmetry of the switch costs changed across blocks, while in the non-linguistic switching task an asymmetrical switch cost was observed throughout the task. The observation of different patterns of switch costs in the linguistic and the non-linguistic switching tasks suggest that the bLC system is not completely subsidiary to the domain-general EC system.","authors":["Marco Calabria","Mireia Hernández","F. M. Branzi","Albert Costa"],"meta":["January 2011Frontiers in Psychology 2(399):399","DOI:10.3389/fpsyg.2011.00399","SourcePubMed"],"references":["247514094_Control_mechanisms_in_bilingual_language_production_Neural_evidence_from_language_switching_studies","247411010_A_Computational_Theory_of_Executive_Cognitive_Processes_and_Multiple-Task_Performance_Part_2_Accounts_of_Psychological_Refractory-Period_Phenomena","287697327_Task_switching_stimulus-response_bindings_and_negative_priming","285810088_Consciousness_and_Self-Regulation","277750258_A_Computational_Theory_of_Executive_Cognitive_Processes_and_Human_Multiple-Task_Performance_Part_1_Basic_Mechanisms","277684999_A_Standardized_Set_of_260_Pictures_Norms_for_Name_Agreement_Image_Agreement_Familiarity_and_Visual_Complexity","276941823_A_functional_imaging_study_of_translation_and_language_switching","247514628_Disorganization_of_Behavior_after_Frontal-Lobe_Damage","245139188_A_Windows_display_program_with_millisecond_accuracy","240971236_Inhibition_and_response_selection_in_task_switching"]}