{"id":"221711540_The_Power_of_a_Good_Idea_Quantitative_Modeling_of_the_Spread_of_Ideas_from_Epidemiological_Models","abstract":"The population dynamics underlying the diffusion of ideas hold many qualitative similarities to those involved in the spread of infections. In spite of much suggestive evidence this analogy is hardly ever quantified in useful ways. The standard benefit of modeling epidemics is the ability to estimate quantitatively population average parameters, such as interpersonal contact rates, incubation times, duration of infectious periods, etc. In most cases such quantities generalize naturally to the spread of ideas and provide a simple means of quantifying sociological and behavioral patterns. Here we apply several paradigmatic models of epidemics to empirical data on the advent and spread of Feynman diagrams through the theoretical physics communities of the USA, Japan, and the USSR in the period immediately after World War II. This test case has the advantage of having been studied historically in great detail, which allows validation of our results. We estimate the effectiveness of adoption of the idea in the three Communities and find values for parameters reflecting both intentional social organization and long lifetimes for the idea. These features are probably general characteristics of the spread of ideas, but not of common epidemics. (c) 2005 Elsevier B.V. All rights reserved.","authors":["Luís M A Bettencourt","Ariel Cintrón-Arias","David I. Kaiser","Carlos Castillo-Chávez"],"meta":["February 2005Physica A: Statistical Mechanics and its Applications 364:513-536","DOI:10.1016/J.Physa.2005.08.083","SourcearXiv"],"references":["240044320_In_Search_of_Excellence_Fads_Success_Stories_and_Adaptive_Emulation","305720251_A_New_Product_Growth_Model_for_Consumer_Durables","271832776_Reproduction_Numbers_and_Sub-threshold_Endemic_Equilibria_for_Compartmental_Models_of_Disease_Transmission","270252033_Stochastic_Models_for_Social_Processes","267922562_The_Diffusion_of_Innovations","259345679_The_Mathematics_of_Infectious_Diseases","249722487_Spreading_the_Tools_of_Theory_Feynman_Diagrams_in_the_USA_Japan_and_the_Soviet_Union","248931038_A_differential_equation_model_for_predicting_public_opinions_and_behaviors_from_persuasive_information_Application_to_the_index_of_Consumer_Sentiment","245346363_An_introduction_to_stochastic_processes_with_applications_to_biology_2nd_ed","243755841_Cold_War_requisitions_scientific_manpower_and_the_production_of_American_physicists_after_World_War_II"]}