{"id":"221841409_Repetitive_motor_learning_induces_coordinated_formation_of_clustered_dendritic_spines_in_vivo","abstract":"Many lines of evidence suggest that memory in the mammalian brain is stored with distinct spatiotemporal patterns. Despite recent progresses in identifying neuronal populations involved in memory coding, the synapse-level mechanism is still poorly understood. Computational models and electrophysiological data have shown that functional clustering of synapses along dendritic branches leads to nonlinear summation of synaptic inputs and greatly expands the computing power of a neural network. However, whether neighbouring synapses are involved in encoding similar memory and how task-specific cortical networks develop during learning remain elusive. Using transcranial two-photon microscopy, we followed apical dendrites of layer 5 pyramidal neurons in the motor cortex while mice practised novel forelimb skills. Here we show that a third of new dendritic spines (postsynaptic structures of most excitatory synapses) formed during the acquisition phase of learning emerge in clusters, and that most such clusters are neighbouring spine pairs. These clustered new spines are more likely to persist throughout prolonged learning sessions, and even long after training stops, than non-clustered counterparts. Moreover, formation of new spine clusters requires repetition of the same motor task, and the emergence of succedent new spine(s) accompanies the strengthening of the first new spine in the cluster. We also show that under control conditions new spines appear to avoid existing stable spines, rather than being uniformly added along dendrites. However, succedent new spines in clusters overcome such a spatial constraint and form in close vicinity to neighbouring stable spines. Our findings suggest that clustering of new synapses along dendrites is induced by repetitive activation of the cortical circuitry during learning, providing a structural basis for spatial coding of motor memory in the mammalian brain.","authors":["Min fu","Xinzhu Yu","Ju Lu","Yi Zuo"],"meta":["March 2012Nature 483(7387):92-5","DOI:10.1038/nature10844","SourcePubMed"],"references":["51250605_Functional_mapping_of_single_spines_in_cortical_neurons_in_vivo","43073940_Learning-related_fine-scale_specificity_imaged_in_motor_cortex_circuits_of_behaving_mice","40039403_Rapid_formation_and_selective_stabilization_of_synapses_for_enduring_motor_memories","38015219_Molecular_and_Cellular_Approaches_to_Memory_Allocation_in_Neural_Circuits","26753678_Holtmaat_A_Svoboda_K_Experience-dependent_structural_synaptic_plasticity_in_the_mammalian_brain_Nat_Rev_Neurosci_10_647-658","289992177_Experience-dependent_structural_synaptic_plasticity_in_the_mammalian_brain","51628883_Dendritic_Spines_and_Distributed_Circuits","50375546_Experience-dependent_structural_plasticity_in_the_cortex","45798810_Spine_Plasticity_in_the_Motor_Cortex","45150530_Neuronal_structural_remodeling_Is_it_all_about_access"]}