{"id":"221931642_Atribuicoes_de_causalidade_para_o_sucesso_eo_fracasso_escolar_dos_seus_alunos_por_professoras_do_ensino_fundamental","abstract":"Teacher-student interactions constitute a particular moment to express teachers’ pedagogic thoughts and to transmit, intentionally or not, their beliefs about the student and the educational process. As personal beliefs concerning the reasons why certain events occur or not, causal attribution can affect the characteristics of teacher-student's interactions and by this way the students’ academic achievement. This study investigated causal attributions for students’ success or failure in a sample of 30 high school third grade female teachers. Data were collected using questionnaires and analyzed in qualitative and quantitative ways. The results showed a tendency to consider the students responsible for their academic success and failure, although teachers recognized their educational actions as a factor of students’ learning and development. Some aspects of the relationship among the teachers’ beliefs, their pedagogic practices and the students’ developmental and learning processes are discussed.\nKeywords: teacher-student’s interactions; causal attributions; academic achievement.","authors":["Mirella Lopez Martini","Zilda Aparecida Pereira Del Prette"],"meta":["December 2005Interação em Psicologia 6","DOI:10.5380/psi.v6i2.3302"],"references":["285722198_An_Attributional_Theory_of_Achievement_Motivation_and_Emotion","248526721_In_the_eyes_of_the_beholder_Students'_and_teachers'_judgments_of_students'_motivation","232601935_Metaphors_in_Motivation_and_Attribution","34226588_Uma_analise_da_acao_educativa_do_professor_a_partir_de_seu_relato_verbal_e_da_observacao_em_sala_de_aula","22704692_A_Theory_of_Motivation_for_Some_Classroom_Experience","14984194_On_Sin_Versus_Sickness_A_Theory_of_Perceived_Responsibility_and_Social_Motivation","232560965_Outcome_and_Attributional_Disagreements_Between_Students_and_Their_Teachers","221931598_Habilidades_sociais_e_construcao_de_conhecimento_em_contexto_escolar","36957447_Pygmalion_in_the_Classroom"]}