{"id":"221900771_Metaheuristics_in_Combinatorial_Optimization_Overview_and_Conceptual_Comparison","abstract":"The field of metaheuristics for the application to combinatorial optimization problems is a rapidly growing field of research. This is due to the importance of combinatorial optimization problems for the scientific as well as the industrial world. We give a survey of the nowadays most important metaheuristics from a conceptual point of view. We outline the different components and concepts that are used in the different metaheuristics in order to analyze their similarities and differences. Two very important concepts in metaheuristics are intensification and diversification. These are the two forces that largely determine the behaviour of a metaheuristic. They are in some way contrary but also complementary to each other. We introduce a framework, that we call the I&D frame, in order to put different intensification and diversification components into relation with each other. Outlining the advantages and disadvantages of different metaheuristic approaches we conclude by pointing out the importance of hybridization of metaheuristics as well as the integration of metaheuristics and other methods for optimization.","authors":["Christian Blum","Andrea Roli"],"meta":["January 2001ACM Computing Surveys 35:268-308","DOI:10.1145/937503.937505","SourceDBLP"],"references":["345958582_Guided_local_search_for_solving_SAT_and_weighted_MAX-_SAT_problems","312340966_Parallel_strategies_for_meta-heuristics","303156013_The_ant_colony_optimization_metaheuristic_algorithms_applications_and_advances","346815843_Evolutionary_Algorithms_in_Theory_and_Practice_Evolution_Strategies_Evolutionary_Programming_Genetic_AlgorithmsEvolution_Strategies_Evolutionary_Programming_Genetic_Algorithms","324932789_An_Introduction_to_Probability_Theory_and_its_Applications","313629838_A_template_for_scatter_search_and_path_relinking","312998983_Genetic_algorithms_with_sharing_for_multimodal_function_optimization","312907789_Ant_system_Optimization_by_a_colony_of_cooperating_agents","312617088_Simulated_annealing","304747181_BOA_The_Bayesian_optimization_algorithm"]}