{"id":"221907923_Locomotion_Analysis_of_Hexapod_Robot","abstract":"In this chapter, the locomotion of symmetric hexapods has been studied in detail. We have presented a comprehensive study of hexagonal hexapod gaits including normal and fault tolerant ones. Gaits of rectangular and hexagonal six-legged robots have been compared from several aspects: stability, fault tolerance, terrain adaptability and walking ability. To facilitate simulations and experiments we have provided integrated kinematics of swinging and supporting legs for continuous gaits. Hexagonal hexapod robots have been shown to be more flexible than rectangular ones. Moreover, hexagonal hexapods have many feasible gaits. In addition to the well-know insect gait and mammal gait, a new mixed gait for hexagonal six-legged robots has been proposed in this chapter which entails some features of both insect and mammal gaits. Except classified by legs movement as mentioned above, hexapod robots gaits are categorized according to the number of supporting legs during walking, as 3+3 tripod, 4+2 fault tolerant quadruped, and 5+1 one by one gaits. On account to the introduction of mixed gait, each numbered gait has one more form. Among three tripod-gait forms, the most stable is the mixed one. The mammal gait can reach the longest stride; whereas the continuous insect gait has the shortest maximum stride and poorest stability. Thanks to their six legs, hexapod robots have redundancy and fault tolerance. Gaits where one leg is lost or two opposite legs are lost have been discussed in recent times. In this chapter we have tackled also the cases in which two adjacent legs or two separated by a normal leg are damaged. Algorithms for realizing these two fault-tolerant gaits have been detailed and validated with simulations.","authors":["Xilun Ding","Zhiying Wang","Alberto Rovetta","J.M. Zhu"],"meta":["March 2010","DOI:10.5772/8822","In book: Climbing and Walking Robots"],"references":["257126905_Reactive_Free-Gait_Generation_to_Follow_Arbitrary_Trajectories_with_a_Hexapod_Robot","228362267_Structure_design_and_locomotion_analysis_of_a_novel_robot_for_lunar_exploration","226814773_Improving_walking-robot_performances_by_optimizing_leg_distribution","265000878_New_Robot_Concept_for_Mars_Soil_Exploration_mechanics_and_functionality","243765153_Generalized_Standard_Leg_Trajectory_for_Quadruped_Walking_Vehicle","238173077_Humanitarian_mine_detecting_six-legged_walking_robot_and_hybrid_neuro_walking_control_with_positionforce_control","237795833_New_Progress_on_the_Novel_Robotics_Systems_for_Moon_Exploration","235049241_Gait_and_Foot_Trajectory_Planning_for_Versatile_Motions_of_a_Six_Legged_Robot","230499044_Design_of_a_robot_that_walks_in_any_direction","228556228_Trends_of_space_robotics_Design_methodologies_for_a_colony_of_autonomous_space_robot_explorers"]}