{"id":"221995190_Wavelet_transform_and_neural_networks_for_short-term_electrical_load_forecasting","abstract":"Demand forecasting is key to the efficient management of electrical energy systems. A novel approach is proposed in this paper for short term electrical load forecasting by combining the wavelet transform and neural networks. The electrical load at any particular time is usually assumed to be a linear combination of different components. From the signal analysis point of view, load can also be considered as a linear combination of different frequencies. Every component of load can be represented by one or several frequencies. The process of the proposed approach first decomposes the historical load into an approximate part associated with low frequencies and several detail parts associated with high frequencies through the wavelet transform. Then, a radial basis function neural network, trained by low frequencies and the corresponding temperature records is used to predict the approximate part of the future load. Finally, the short term load is forecasted by summing the predicted approximate part and the weighted detail parts. The approach has been tested by the 1997 data of a practical system. The results show the application of the wavelet transform in short term load forecasting is encouraging.","authors":["S.J Yao","Y.H Song","L.Z Zhang","X.Y Cheng"],"meta":["December 2000Energy Conversion and Management 41(18):1975-1988","DOI:10.1016/S0196-8904(00)00035-2"],"references":["225092530_An_Introduction_to_Wavelets","3265374_Neural_Network_based_Short-Term_Load_Forecasting_Using_Weather_Compensation","3210959_Analysis_and_Evaluation_of_Five_Short-Term_Load_Forecasting_Techniques","3265685_A_new_short-term_load_forecasting_approach_using_self-organizing_fuzzy_ARMAX_models","3265575_Implementing_a_weighted_least_squares_procedure_in_training_a_neural_network_to_solve_the_short-term_load_forecasting_problem","3265569_Building_a_quasi_optimal'_neural_network_to_solve_the_short-term_load_forecasting_problem","3265450_An_adaptable_automated_procedure_for_short-term_electricity_load_forecasting","3263618_Analysis_and_evaluation_of_five_short-term_load_forecasting_techniques"]}