{"id":"221965802_Asynchrony_from_Synchrony","abstract":"A synchronous message passing complete network with an adversary that may purge messages is used to precisely model tasks that are read-write wait-free computable.\nIn the past, adversaries that reduce the computational power of a system as they purge messages were studied in the context of their ability to foil consensus. This paper considers the other extreme. It characterizes the limits on the power of message-adversary so that it cannot foil the solution of tasks which are read-write wait-free solvable but can foil the solution of any task that is not read-write wait-free solvable. Put another way, we study the weakest message-adversary which allows for solving any task that is solvable wait-free in the read-write model.\nA remarkable side-benefit of this characterization is a simple, as simple as can be, derivation of the Herlihy-Shavit condition that equates the wait-free read-write model with a subdivided-simplex. We show how each step in the computation inductively takes a subdivided-simplex and further subdivides it in the simplest way possible, making the characterization of read-write wait-free widely accessible.","authors":["Yehuda Afek","Eli Gafni"],"meta":["March 2012","DOI:10.1007/978-3-642-35668-1_16","SourcearXiv","Conference: International Conference on Distributed Computing and Networking"],"references":["234819920_Shavit_N_The_Topological_Structure_of_Asynchronous_Computability_Journal_of_the_ACM_466_858-923","227288056_The_BG_Distributed_Simulation_Algorithm","309456250_Wait-free_synchronization_ACM_Trans","266989889_Fifty_years_of_further_development_of_a_combinatorial_lemma_Part_B","249638706_Efficient_and_reliable_broadcast_is_achievable_in_an_eventually_connected_networkExtended_Abstract","243656757_On_dominance_relations_and_the_structure_of_animal_societies","240869784_Long-lived_Adaptive_Collect_with_Applications_Extended_Abstract","238313014_Round-by-round_fault_detector-unifying_synchrony_and_asynchrony","234816293_Immediate_atomic_snapshots_and_fast_renaming","228057613_Distributed_Computation_in_Dynamic_Networks"]}