{"id":"221967602_Complete_Vision-Based_Traffic_Sign_Recognition_Supported_by_an_I2V_Communication_System","abstract":"This paper presents a complete traffic sign recognition system based on vision sensor onboard a moving vehicle which detects and recognizes up to one hundred of the most important road signs, including circular and triangular signs. A restricted Hough transform is used as detection method from the information extracted in contour images, while the proposed recognition system is based on Support Vector Machines (SVM). A novel solution to the problem of discarding detected signs that do not pertain to the host road is proposed. For that purpose infrastructure-to-vehicle (I2V) communication and a stereo vision sensor are used. Furthermore, the outputs provided by the vision sensor and the data supplied by the CAN Bus and a GPS sensor are combined to obtain the global position of the detected traffic signs, which is used to identify a traffic sign in the I2V communication. This paper presents plenty of tests in real driving conditions, both day and night, in which an average detection rate over 95% and an average recognition rate around 93% were obtained with an average runtime of 35 ms that allows real-time performance.","authors":["Miguel Ángel García Garrido","Manuel Ocaña","David Fernández-Llorca","Estefanía Arroyo"],"meta":["December 2012Sensors 12(2):1148-69","DOI:10.3390/s120201148","SourcePubMed"],"references":["237436551_Thirteen_Ways_to_Look_at_the_Correlation_Coefficient","228952328_Development_and_Evaluation_of_In-vehicle_Signing_System_Utilizing_RFID_tags_as_Digital_Traffic_Signs","228841662_Automatic_Traffic_Signs_and_Panels_Inspection_System_Using_Computer_Vision","226658534_A_Tutorial_on_Support_Vector_Machines_for_Pattern_Recognition","224719842_Real_Time_Road_Signs_Recognition","308048640_Thirteen_ways_to_look_at_the_correlation_coefficient","304425264_A_Tutorial_on_Support_Vector_Machines_for_Pattern_Recognition","247284531_SD_Shapiro_Properties_of_transforms_for_the_detection_of_curves_in_noisy_pictures_Comput_Graph_Image_Proc_8_219","225075551_A_New_Approach_to_Linear_Filtering_and_Prediction_Problems","224839919_A_New_Approach_To_Linear_Filtering_and_Prediction_Problems"]}