{"id":"222076323_Development_in_recirculation_systems_for_Mediterranean_fish_species","abstract":"Nowadays, most European commercial hatcheries use recirculating water systems for all the different stages of Mediterranean fish rearing, from breeders to fingerlings several grams in weight. Despite a higher initial investment relative to flow-through systems, this technology reduces production costs mainly because much less energy is required for heating and the survival rate of the fingerlings is much higher. The introduction of recirculation systems has sped up the development of reliable and cost effective hatcheries. Commercial pre-growing units with recirculating systems are now used to produce fish weighing several tenths of a gram at the end of the cold season. This increases the productivity of cage structures, offers the possibility of introducing the fish into less sheltered areas, or may simply be an attempt to meet market demand in some countries. Fish farms are characterized by large rearing units, high stocking densities (more than 100 kg m−3), a large increase in biomass and long-term rearing. Several experimental size units (2–5 tons of annual production) have proved to be effective. Applying this technology to actual commercial farms (several hundred to several thousand tons) would require that the problem of drastically scaling-up all of the components of the rearing system be overcome. To achieve this, several companies are now involved with the French research institute Ifremer in the operation and evaluation of pilot commercial size production units (50–70 tons of annual production) financed by private investors, French public funds, and the European Economic Union. Two of these units, one situated in the south of France, the other in Iceland have now been built and the production of sea bass (Dicentrarchus labrax) has just begun. A third is under construction in the west of France (Brittany) and will be used for turbot (Scophthalmus maximus) production. The overall aim of these experiments is to provide data that will enable a model to be constructed that will describe, as far as possible, how each component of the recycling system works. Based on this model, a more complete model will be constructed with which the optimal farm size can be determined, taking into account geographical, biological and economical parameters. In parallel, Ifremer is developing a research program in four main areas : (1) the influence of the rearing environment on fish; (2) the influence of fish on the rearing environment; (3) reducing the environmental impact of the farms, and (4) the optimization of the primary water treatment system, and its integrated management. The most promising foreseeable improvement in recirculating systems used for growing Mediterranean fish are: (1) an increase in mechanical filtration efficiency; (2) a better understanding of the standard optimal rearing medium parameters; (3) more information on the bacterial populations and how to control them, and (4) the incorporation and recycling of waste.","authors":["J.P. Blancheton"],"meta":["May 2000Aquacultural Engineering 22(1-2):17-31","DOI:10.1016/S0144-8609(00)00030-3"],"references":["281421346_Aquaculture_in_the_next_century_opportunities_for_growth_challenges_of_sustainability","2940503_Developing_backwash_protocols_for_floating-bead_filters_a_model_of_solids-loading_and_biofilm-retention_effects_on_nitrification","285777627_Production_characteristics_and_modeling_of_aquacultural_sludge_from_a_recirculating_aquacultural_system_using_a_granular_media_biofilter","262872738_Serial_particle_size_fraction_and_characterisation_of_an_aquacultural_effluent","248945292_Toxicity_of_nitrogenous_wastes_to_aquatic_animals","234203915_A_proposed_model_for_clean_land-based_polyculture_of_fish_bivalves_and_seaweed","231787059_Regulation_of_voluntary_feed_intake_in_juvenile_rainbow_trout_by_hand_and_by_self-feeders_with_diets_containing_two_different_proteinenergy_ratios","226573547_Nitrogen_pollution_in_mariculture_toxicity_and_excretion_of_nitrogenous_compounds_by_marine_fish","225141832_Particle_size_distribution_of_wastes_from_freshwater_fish_farms","223863904_A_proposed_model_for_environmentally_clean_land-based_culture_of_fish_bivalves_and_seaweeds","222543948_Population_of_heterotrophic_bacteria_in_an_experimental_recirculation_aquaculture_system","29489784_The_use_of_high_rate_algal_ponds_for_the_treatment_of_marine_effluent_from_a_recirculating_fish_rearing_system","29489783_A_model_for_predicting_the_quantities_of_dissolved_inorganic_nitrogen_released_in_effluents_from_a_sea_bass_Dicentrarchus_labrax_recirculating_water_system","18461592_The_Response_of_Rainbow_Trout_to_Varying_ProteinEnergy_Ratios_in_a_Test_Diet"]}