{"id":"222125263_An_exact_algorithm_for_large_multiple_knapsack_problems","abstract":"The Multiple Knapsack Problem (MKP) is the problem of assigning a subset of n items to m distinct knapsacks, such that the total profit sum of the selected items is maximized, without exceeding the capacity of each of the knapsacks. The problem has several applications in naval as well as financial management. A new exact algorithm for the MKP is presented, which is specially designed for solving large problem instances. The recursive branch-and-bound algorithm applies surrogate relaxation for deriving upper bounds, while lower bounds are obtained by splitting the surrogate solution into the m knapsacks by solving a series of Subset-sum Problems. A new separable dynamic programming algorithm is presented for the solution of Subset-sum Problems, and we also use this algorithm for tightening the capacity constraints in order to obtain better upper bounds. The developed algorithm is compared to the mtm algorithm by Martello and Toth, showing the benefits of the new approach. A surprising result is that large instances with n=100 000 items may be solved in less than a second, and the algorithm has a stable performance even for instances with coefficients in a moderately large range.","authors":["David Pisinger"],"meta":["May 1999European Journal of Operational Research 114(3):528-541","DOI:10.1016/S0377-2217(98)00120-9"],"references":["239543676_An_Algorithm_for_Large_Zero-One_Knapsack_Problems","220430498_Sahni_S_Computing_partitions_with_applications_to_the_knapsack_problem_Journal_of_the_ACM_21_277-292","304889815_The_One_Dimensional_Cutting_Stock_Problem_Using_Two_Objectives","265354073_A_reduction_algorithm_for_knapsack_problems","256416872_A_Bound_and_Bound_algorithm_for_the_zero-one_multiple_knapsack_problem","255683028_Discrete-Variable_Extremum_Problems","247932370_The_Multiple_Loading_Problem","245280516_The_One_Dimensional_Cutting_Stock_Problem_Using_Two_Objectives","229710958_An_Algorithm_for_0-1_Multiple_Knapsack_Problems","4940979_Solution_of_the_0-1_multiple_knapsack_problem","2547890_A_Minimal_Algorithm_for_the_0-1_Knapsack_Problem"]}