{"id":"222218921_A_Unifying_Reference_Framework_for_Multi-Target_User_Interfaces","abstract":"This paper describes a framework that serves as a reference for classifying user interfaces supporting multiple targets, or multiple contexts of use in the field of context-aware computing. In this framework, a context of use is decomposed into three facets: the end users of the interactive system, the hardware and software computing platform with which the users have to carry out their interactive tasks and the physical environment where they are working. Therefore, a context-sensitive user interface is a user interface that exhibits some capability to be aware of the context (context awareness) and to react to changes of this context. This paper attempts to provide a unified understanding of context-sensitive user interfaces rather than a prescription of various ways or methods of tackling different steps of development. Rather, the framework structures the development life cycle into four levels of abstraction: task and concepts, abstract user interface, concrete user interface and final user interface. These levels are structured with a relationship of reification going from an abstract level to a concrete one and a relationship of abstraction going from a concrete level to an abstract one. Most methods and tools can be more clearly understood and compared relative to each other against the levels of this framework. In addition, the framework expresses when, where and how a change of context is considered and supported in the context-sensitive user interface thanks to a relationship of translation. In the field of multi-target user interfaces is also introduced, defined, and exemplified the notion of plastic user interfaces. These user interfaces support some adaptation to changes of the context of use while preserving a predefined set of usability properties.","authors":["Gaelle Calvary","Joëlle Coutaz","David Thevenin","Quentin Limbourg"],"meta":["June 2003Interacting with Computers 15(3):289-308","DOI:10.1016/S0953-5438(03)00010-9","SourceDBLP"],"references":["267658301_Design_Principles_for_Interactive_Software","262292003_Perceptual_user_interfaces_things_that_see","247131358_Perceptual_components_for_context_awareness","245189405_Adaptation_en_Interaction_Homme-Machine_le_cas_de_la_Plasticite","266321843_The_Psychology_of_Human-Computer_Interaction","243773402_Model-based_user-interface_development_techniques_for_mo-bile_computing","242574078_Augmented_surfaces_a_spatially_continuous_workspace_for_hybrid_computing","242418871_Literate_Development_Weaving_Human_Context_into_Design_Specifications","236157150_Model-Based_Design_and_Evaluation_of_Interactive_Applications_Applied_Computing","228383024_Architectures_for_Context"]}