{"id":"222306987_Square_Root_Approximations_in_Old_Babylonian_Mathematics_YBC_7289_in_Context","abstract":"We consider several aspects of the role and evaluation of the four-sexagesimal-place approximation toon the well-known Old Babylonian tablet YBC 7289. By referring to what is known about OB school texts, we show that this text is most probably a school exercise by a trainee scribe who got the approximation from a coefficient list. These coefficient lists are briefly described, with their use in geometrical problems. We consider other texts involving square roots and derive an algorithm for evaluating them, which complies with all known OB examples, from a simple geometrical construction of the type that seems to underlie many other OB procedures.Copyright 1998 Academic Press.Nous considérons plusieurs aspects du rôle et de l'évaluation de l'approximation à quatre places sexagésimales desur cette tablette paléo-babylonienne. En nous référant à l'état des connaissances quant aux textes scolaires paléo-babyloniens, nous montrons comment ce texte est très probablement un exercice scolaire exécuté par un apprenti scribe qui a obtenu l'approximation à partir d'une liste de coéfficients. Nous décrivons en bref ces listes de coéfficients, ainsi que leur utilisation dans les problèmes de géométrie. Nous considérons d'autres textes traitant de racines carrées , et pour les évaluer nous dérivons un algorithme qui est en accord avec tous les exemples paléo-babyloniens connus; ceci à partir d'une construction géométrique simple du type qui semble être charactéristique de beaucoup d'autres procédures paléo-babyloniennes.Copyright 1998 Academic Press.MSC 1991 subject classifications: 01A17; 11-03","authors":["David Fowler","Eleanor Robson"],"meta":["November 1998Historia Mathematica 25(4):366-378","DOI:10.1006/hmat.1998.2209"],"references":["273092149_Ninurta-Paqidat's_Dog_Bite_and_Notes_on_Other_Comic_Tales","270523527_Algebra_and_Naive_Geometry_An_Investigation_of_Some_Basic_Aspects_of_Old_Babylonian_Mathematical_Thought_II","284804813_A_Babylonian_Geometrical_Text","283968609_Two_New_Key_Lists_of_Mathemat_ical_Operations","274881991_Three_Old_Babylonian_Methods_for_Dealing_with_Pythagorean_Triangles","274202188_A_Table_of_4th_Powers_and_Related_Texts_from_Seleucid_Babylon","270463382_The_Exact_Sciences_in_Antiquity","266916584_Dynamis_mithartum_and_square","253446059_Tables_of_Reciprocals_with_Irregular_Entries","249099544_Systems_for_Learning_Mathematics_in_Mesopotamian_Scribal_Schools","247478258_Selections_Illustrating_the_History_of_Greek_Mathematics","223836665_Dynamis_the_Babylonians_and_Theaetetus_147c7-148d7","220425478_Ancient_Babylonian_Algorithms","35719876_Old_Babylonian_coefficient_lists_and_the_wider_context_of_mathematics_in_ancient_Mesopotamia_2100-1600_BC","8765479_The_Exact_Sciences_in_Antiquity"]}