{"id":"222484427_A_Fast_and_Effective_Heuristic_for_the_Feedback_Arc_Set_Problem","abstract":"Let G=(V, A) denote a simple connected directed graph, and let n=|V|, m=|A|, where nt-1≤m≤(n2) A feedbackarc set (FAS) of G, denoted R(G), is a (possibly empty)set of arcs whose reversal makes G acyclic. A minimum feedbackarc set of G, denoted R∗(G), is a FAS of minimum cardinality r∗(G); the computation of R∗(G) is called the FASproblem. Berger and Shor have recently published an algorithm which, for a given digraph G, computes a FAS whose cardinality is at most m/2t-c1m/Δ1/2 where Δ is the maximum degree of G and c1 is a constant. Further, they exhibited an infinite class of graphs with the property that for every Gϵ and some constant c2, r∗(G)≥m /2t-c2m/Δ1/2. Thus the Berger-Shor algorithm provides, in a certain asymptotic sense, an optimal solution to the FAS problem. Unfortunately, the Berger-Shor algorithm is complicated and requires runni ng time O(mn). In this paper we present a simple FAS algorithm which guarantees a good (though not optimal) performance bound and executes in time O(m). Further, for the sparse graphs which arise frequently in graph drawing and other applications, our algorithm achieves the same asymptotic performance bound that Berger-Shor does.","authors":["Peter Eades","Xuemin Lin","Wf Smyth"],"meta":["February 1996Information Processing Letters 47(6):319-323","DOI:10.1016/0020-0190(93)90079-O"],"references":["221580898_Reducibility_Among_Combinatorial_Problems","284039089_Reducibility_among_combinatorial_problems","265462220_On_subgraphs_without_cycles_in_a_tournament","265462186_On_Sets_of_Consistent_Arcs_in_a_Tournament","244959889_A_new_heuristic_for_the_feedback_arc_set_problem","243037433_Optimally_ranking_unrankable_tournaments","239665311_Inconsistencies_in_a_Schedule_of_Paired_Comparisons","230354540_Optimal_Ranking_of_Tournaments","222295352_On_the_maximum_cardinality_of_a_consistent_set_of_arcs_in_a_random_tournament","220779397_Approximation_Algorithms_for_the_Maximum_Acyclic_Subgraph_Problem","33821526_Analysis_of_algorithms_for_drawing_graphs"]}