{"id":"222404651_Parametric_analysis_of_alternative_energy_conservation_measures_in_an_office_building_in_hot_and_humid_climate","abstract":"The growth of demand for electrical energy in the rapidly expanding towns, cities and industries exceeds the growth of the power being made available. Therefore, energy conservation is becoming an increasingly important issue in Saudi buildings. The objective of this study was to investigate the impact of alternative energy conservation measures on energy requirements in office buildings in hot–humid climates. The study was conducted on a five-story office building located in Dammam, Saudi Arabia, which has been in use since 1998. Different types of HVAC systems were selected and different feasible and practical operational energy conservation measures (ECMs) were evaluated using the energy simulation software of Visual DOE 4.0. Previous studies conducted in this area were reviewed. Data was collected through review of design drawings, building audit and the analysis of 4 years of utility bills. All the collected data was analyzed and the utility bills data was used to calibrate the base case of the existing building using Visual DOE energy simulation software. Conclusions and recommendations were developed for conserving energy using various appropriate ECMs in office buildings in hot and humid climates.","authors":["Imran Iqbal","Mohammad S. Al-Homoud"],"meta":["May 2007Building and Environment 42(5):2166-2177","DOI:10.1016/j.buildenv.2006.04.011"],"references":["313096942_Analysis_of_electric_energy_consumption_in_an_office_building_in_Saudi_Arabia","263499137_Need_for_thermal-storage_air-conditioning_in_Saudi_Arabia","260283348_Thermal_design_of_office_buildings","245145210_Assessing_building_performance_by_simulation","236482412_Climatatic_design_Energy_efficient_building_principles_and_practices","223171127_Conserving_energy_without_sacrificing_thermal_comfort","222658538_Energy_simulation_in_buildings_Overview_and_BLAST_example","222573383_Mathews_E_HVAC_control_strategies_to_enhance_comfort_and_minimise_energy_usage_Energy_and_Buildings_338_853-863","222480190_Effective_tools_toward_electrical_energy_conservation_in_Saudi_Arabia","222203183_Investigation_of_some_large_building_energy_conservation_opportunities_using_the_DOE-2_model","222032831_Energy_characteristics_and_savings_potential_in_office_buildings"]}