{"id":"222431536_Technology_planning_A_roadmap_to_successful_technology_integration_in_schools","abstract":"Since the advent of technologies available for teaching and learning, schools have been advocating considerable amount of their funds for the procurement of hi-tech technologies. Despite this huge investment, there is a little success achieved so far. It is obvious that technology integration is a complex and demanding issues and this puts more burdens on schools. On the other hand, technology planning, as a process and product, holds a number of promises to overcome those problems. Thus, the purpose of this present study was to illustrate how technology planning process was carried out in a private K-12 school in Turkey. Data were collected from 105 teachers, 25 administrative staff, and 376 students. Teachers and administrative staff were asked to fill out a questionnaire to gather data on their perceived computer literacy, issues related to ICT usage. Students were also asked about their perceptions on the current utilization of ICT at their school. Additionally, unstructured interviews were conducted with administrative staff and teachers to validate data obtained through questionnaires. Data were descriptively analyzed to provide necessary input for the technology planning process. Findings indicated that even teachers and administrator staff felt themselves competent in using ICT available at the school; they reported a lack of guidelines that would lead them to successful integration. On the other hand, students reported that ICT is not utilized sufficiently in their classes. Finally, the study illustrated how necessary data were collected and findings were transformed into suggestions to frame a technology plan for a school.","authors":["Yasemin Gulbahar"],"meta":["December 2007Computers & Education 49(4):943-956","DOI:10.1016/j.compedu.2005.12.002","SourceDBLP"],"references":["238102160_No_Access_No_Use_No_Impact_Snapshot_Surveys_of_Educational_Technology_In_K-12","312896002_Promoting_classroom_technology_use","272121796_If_Not_Here_Where_Understanding_Teachers'_Use_Of_Technology_In_Silicon_Valley_Schools","258051798_Educational_Leadership_and_Planning_for_Technology_4th_Ed","255566862_Toward_Technology_Integration_in_the_Schools_Why_It_Isn't_Happening","250889916_Technology_in_the_classroom_Steps_toward_a_new_vision","248986545_Challenges_advantages_and_disadvantages_of_instructional_technology_in_the_community_college_classroom","248114950_Leadership_in_instructional_technology","241739261_Does_Technology_Enhance_Actual_Student_Learning_The_Case_of_Online_Discussion_Boards","234600154_Successful_K-12_Technology_Planning_Ten_Essential_Elements_ERIC_Digest","227809414_Visions_and_realities_of_Internet_use_in_schools_Canadian_perspectives","227803532_Visions_of_change_Information_technology_education_and_postmodernism","223349335_A_'blended'_in-service_arrangement_for_classroom_technology_integration_Impacts_on_teachers_and_students","31772523_Managing_Technological_Change_Strategies_for_College_and_University_Leaders_T_Bates"]}