{"id":"222513527_How_Do_Young_People_Choose_College_Majors","abstract":"Previous studies on the determinants of the choice of college major have assumed a constant probability of success across majors or a constant earnings stream across majors. Our model disregards these two restrictive assumptions in computing an idiosyncratic expected earnings variable to explain the probability that a student will choose a specific major among four choices of concentrations. The construction of an expected earnings variable requires information on the student's perceived probability of success, the predicted earnings of graduates in all majors and the student's expected earnings if he (she) fails to complete a college program. Using data from the National Longitudinal Survey of Youth, we evaluate the chances of success in all majors for all the individuals in the sample. Second, the individuals' predicted earnings of graduates in all majors are obtained using Rumberger and Thomas's [Econ. Educ. Rev. 12 (1993) 1] regression estimates from a 1987 Survey of Recent College Graduates. Third, we obtain idiosyncratic estimates of earnings alternative of not attending college or by dropping out with a condition derived from our college major decision-making model applied to our sample of college students. Finally, with a mixed multinomial logit and probit models and an heteroscedastic extreme value model, we explain the individuals' choice of a major. The results of the paper show that the expected earnings variable is essential in the choice of a college major. There are, however, significant differences in the impact of expected earnings by gender and race.","authors":["Claude Montmarquette","Kathy Cannings","Sophie Mahseredjian"],"meta":["December 2002Economics of Education Review 21(6):543-556","DOI:10.1016/S0272-7757(01)00054-1"],"references":["350372401_Comportement_des_bacheliers_modele_de_choix_de_disciplines","313636333_What_do_students_know_about_wages_Evidence_from_a_survey_of_undergraduates","311718449_The_Theory_and_Practice_of_Econometrics","311718364_Limited-Dependent_and_Qualitative_Variables_in_Econometrics","279952417_Choice_of_major_The_changing_unchanging_gender_gap","274820964_The_Market_for_College-Trained_Manpower","265366492_The_Theory_and_Practice_of_Econometrics_Second_Edition","247220999_Preferences_and_prices_in_choice_of_career_The_switch_to_business_1972-1987","247078353_Option_Values_College_Quality_and_Earnings_A_Dynamic_Model_College_and_Major_Choice","239664833_Applied_Discrete_Choice_Modeling"]}