{"id":"222683769_Conceptualising_sustainability_assessment","abstract":"Sustainability assessment is being increasingly viewed as an important tool to aid in the shift towards sustainability. However, this is a new and evolving concept and there remain very few examples of effective sustainability assessment processes implemented anywhere in the world.Sustainability assessment is often described as a process by which the implications of an initiative on sustainability are evaluated, where the initiative can be a proposed or existing policy, plan, programme, project, piece of legislation, or a current practice or activity. However, this generic definition covers a broad range of different processes, many of which have been described in the literature as ‘sustainability assessment’.This article seeks to provide some clarification by reflecting on the different approaches described in the literature as being forms of sustainability assessment, and evaluating them in terms of their potential contributions to sustainability. Many of these are actually examples of ‘integrated assessment’, derived from environmental impact assessment (EIA) and strategic environmental assessment (SEA), but which have been extended to incorporate social and economic considerations as well as environmental ones, reflecting a ‘triple bottom line’ (TBL) approach to sustainability. These integrated assessment processes typically either seek to minimise ‘unsustainability’, or to achieve TBL objectives. Both aims may, or may not, result in sustainable practice.We present an alternative conception of sustainability assessment, with the more ambitious aim of seeking to determine whether or not an initiative is actually sustainable. We term such processes ‘assessment for sustainability’.‘Assessment for sustainability’ firstly requires that the concept of sustainability be well-defined. The article compares TBL approaches and principles-based approaches to developing such sustainability criteria, concluding that the latter are more appropriate, since they avoid many of the inherent limitations of the triple-bottom-line as a conception of sustainability.","authors":["Jenny Pope","David Annandale","Angus Morrison-Saunders"],"meta":["August 2004Environmental Impact Assessment Review 24(6):595-616","DOI:10.1016/j.eiar.2004.03.001"],"references":["308603175_Chapter_7_Sustainability_Assessment_at_the_Local_Level_Sustainability_Assessment_and_the_Management_of_Urban_Environments","308603083_Introduction_to_Sustainability_Assessment_at_the_Local_Level_Sustainability_Assessment_and_the_Management_of_Urban_Environments","304346273_A_framework_for_environmental_sustainability_assessment_and_assurance","285768478_SEA_methodology_in_practice","284388504_Strategic_environmental_assessment_-_Principles_and_potential","284331089_Criteria_and_standards_for_assessing_significant_impact","271752976_Towards_integration_of_assessments_with_reference_to_integrated_water_management_projects_in_third_world_countries","267681254_Specification_of_sustainability-based_environmental_assessment_decision_criteria_and_implications_for_determining_significance_in_environmental_assessment_Specification_of_sustainability-based_environ","263885356_METHODOLOGIES_FOR_SUSTAINABILITY_IMPACT_ASSESSMENTS_OF_PROPOSALS_FOR_NEW_TRADE_AGREEMENTS","263880059_SUSTAINABILITY_ASSESSMENT_THE_APPLICATION_OF_A_METHODOLOGICAL_FRAMEWORK"]}