{"id":"222667898_Canonical_derivatives_partial_derivatives_and_finite_automaton_constructions","abstract":"Let E be a regular expression. Our aim is to establish a theoretical relation between two well-known automata recognizing the language of E, namely the position automaton constructed by Glushkov or McNaughton and Yamada, and the equation automaton constructed by Mirkin or Antimirov. We define the notion of c-derivative (for canonical derivative) of a regular expression E and show that if E is linear then two Brzozowski's derivatives of E are aci-similar if and only if the corresponding c-derivatives are identical. It allows us to represent the Berry–Sethi's set of continuations of a position by a unique c-derivative, called the c-continuation of the position. Hence the definition of , the c-continuation automaton of E, whose states are pairs made of a position of E and of the associated c-continuation. If states are viewed as positions, is isomorphic to . On the other hand, a partial derivative, as defined by Antimirov, is a class of c-derivatives for some equivalence relation, thus reduces to . Finally makes it possible to go from to , while this cannot be achieved directly (from the state graphs). These theoretical results lead to an space and time algorithm to compute the equation automaton, where |E| is the size of the expression. This is the complexity of the most efficient constructions yielding the position automaton, while the size of the equation automaton is not greater and generally much smaller than the size of the position automaton.","authors":["J.-M. Champarnaud","Djelloul Ziadi"],"meta":["October 2002Theoretical Computer Science 289(1):137-163","DOI:10.1016/S0304-3975(01)00267-5","Sourcedx.doi.org"],"references":["349684482_Representation_of_Events_in_Nerve_Nets_and_Finite_Automata","284210954_An_algorithm_for_constructing_a_base_in_a_language_of_regular_expressions","262371638_Regular_Languages","253068166_The_Abstract_Theory_of_Automata","247391897_Representation_of_Events_in_Nerve_Nets_and_Finite_Automata_Automata_Studies","229124270_Representation_of_Events_in_Nerve_Nets_and_Finite_Automata","228057764_Introduction_To_Automata_Theory_Languages_And_Computation","228057630_Data_Structures_and_Algorithms","224583682_Regular_Expressions_and_State_Graphs_for_Automata","222734141_Partial_derivatives_of_regular_expressions_and_finite_automaton_constructions","220688550_Data_Structures_and_Algorithms","220616541_Three_Partition_Refinement_Algorithms","220444744_From_Mirkin's_Prebases_to_Antimirov's_Word_Partial_Derivatives","220430648_Derivatives_of_Regular_Expressions","220169644_From_C-Continuations_to_New_Quadratic_Algorithms_for_Automaton_Synthesis","44127630_From_Regular_Expressions_to_Deterministic_Automata","29655265_Passage_d'une_expression_rationnelle_a_un_automate_fini_non-deterministe"]}