{"id":"222889168_Golden_ratio_in_science_as_random_sequence_source_its_computation_and_beyond","abstract":"Some rational as well as some irrational numbers, among all real numbers in mathematics, are very special and have fascinated many human minds. Associated with these numbers are not only the fascinating history but also remarkable physical phenomena observed by critical minds of scientists, artists, architects, engineers, naturalists and spiritualists. The rational number 2n and the irrational number π— a transcendental number, for example, have very special places in computer science and in mathematics, respectively. Some of the other famous numbers are the Hilbert number , the Liouville number ≈0.1100010000000000000000010000 which has a 1 in the 1st, 2nd, 6th, 24th, 120th etc. places and 0s elsewhere, the Euler–Mascheroni constant , and the numbers (believed (not proved) to be a transcendental number) and . Presented here is yet another exceedingly delightful, extensively explored irrational algebraic number called the golden ratio φ and its widespread occurrence in mathematics, specifically geometry, computational science, biology, artistic creations, architecture, nature and beyond. Specifically, digits–even randomly or systematically chosen consecutive digits or consecutive blocks of digits–of golden ratio may be used as a source of uniformly distributed random numbers. Unlike any of the several quasi- and pseudo-random number generators using various methods, we need to use no method here; only we have to pick up the consecutive/nonconsecutive blocks of digits from the stored golden ratio and hence it would be a fastest means of obtaining random numbers. This idea of getting random sequences possibly opens up a new efficient way of solving numerous optimization problems including the NP-hard travelling salesman problem by polynomial-time heuristics such as ant system approaches, genetic algorithms, simulated annealing and other randomized algorithms. Also, whether these random numbers sieved out of the golden ratio are quasi- (more uniformly distributed) or pseudo-random numbers may be studied including its scope among other random number generators. Presented here is the golden ratio along with its computation up to a desired number of digits using the single Matlab command vpa. Also described are its occurrences in sciences in very many ways and a fixed-point iteration scheme besides other methods for its computation. Demonstrated are the uniform pseudo-random distribution of its digits and its capability to perform the Monte Carlo integrations using systematically its consecutive blocks of digits. Mentioned are some of the interesting happenings/occurrences in nature, art and architecture in which the golden ratio has been discovered in an exact/approximate form. The article is our way of viewing this amazing number, the golden ratio, and depicting its beauty. Included are several Matlab programs for the reader with Matlab facilities. These will enable him/her to have a deeper insight into its character in the background of our aesthetic sense and its extraordinary tendency to pop up in diverse situations through quick computation.","authors":["S. K. Sen","Ravi Agarwal"],"meta":["July 2008Computers & Mathematics with Applications 56(2):469-498","DOI:10.1016/j.camwa.2007.06.030","SourceDBLP"],"references":["259557430_The_sign_of_the_devil_and_the_sine_of_the_devil","250700417_Quasi-versus_pseudo-random_generators_Discrepancy_complexity_and_integration-error_based_comparison","322904965_Ramanujan_Modular_Equations_and_Approximations_to_Pi_or_How_to_Compute_One_Billion_Digits_of_Pi","285243412_Comparing_random_number_generators_using_Monte_Carlo_integration","281481379_Computing_polynomial_root-clusters_exactly_and_parallely","274212690_The_Crest_of_the_Peacock_Non-European_Roots_of_Mathematics","270088026_The_Divine_Proportion_A_Study_in_Mathematical_Beauty","268168871_Introductory_theory_of_computer_science_Reprint","267668412_The_Fibonacci_sequence_in_successive_partitions_of_a_golden_triangle","266953612_Computational_error_and_complexity_in_science_and_engineering","265697679_A_New_Kind_of_Golden_Triangle","265328805_Golden_triangles_rectangles_and_cuboids","264927080_The_crest_of_the_peacock_The_non-European_roots_of_mathematics_2nd_ed","264919077_Wonders_of_numbers_Adventures_in_mathematics_mind_and_meaning_Paperback_ed","247892363_The_Golden_Ratio_The_Story_of_Phi","246984131_Numerical_Algorithms_Computations_in_Science_and_Engineering","244462009_Fibonacci_and_Lucas_numbers","241411585_The_golden_ratio_The_story_of_phi_the_world's_most_astonishing_number","223107196_2n_in_scientific_computation_and_beyond","44454143_The_crest_of_the_peacock_non-European_roots_of_mathematics_George_Gheverghese_Joseph","3045968_Arithmetic_Algorithms_in_a_Negative_Base","3045828_Deterministic_Division_Algorithm_in_a_Negative_Base","2588632_Ramanujan_Modular_Equations_and_Approximations_to_Pi_or_How_to_Compute_One_Billion_Digits_of_Pi"]}