{"id":"222978954_Computer-based_assessment_A_versatile_educational_tool","abstract":"There are many types of Computer-Based Assessment in use today in higher education, from formative self-tests to summative final exams. CBA is used in various ways as an integral part of many currently used Computer Aided Learning environments. This paper surveys some of the reasons for using computers for assessment and some of the types of test in use, including evidence that coverage can extend beyond first year assessments, where it seems to be stuck in some disciplines. One project and one type are examined in more detail: randomly generated open access tests. With this type of test students are allowed to practise in their own time before sitting the same test for a grade. Evidence from one particular test, in statistics, was taken from computer logs, questionnaires and individual interviews and is used to show that the test style motivated students to study, and, for some students, directed their revision even when they were away from the computer. The results show that random-based tests can have a number of major advantages over fixed assessments, including: increased lifespan, security and flexibility, improved student motivation for study; and use as a learning resource. They also indicate that CBA does not have to be viewed in isolation from the learning environment in which it is situated, but can have an impact upon a student’s study strategy, for example through increased revision. Taken together with previous studies and the survey of uses, there is now a body of evidence to suggest that CBA is an extremely versatile educational tool.","authors":["Mike Thelwall"],"meta":["March 2013Computers & Education","DOI:10.1016/S0360-1315(99)00037-8"],"references":["29812033_Computer-aided_assessment_in_statistics_The_CAMPUS_project","2632627_Rich_Environments_for_Active_Learning_a_Definition","318841545_A_correlational_analysis_of_multiple-choice_and_essay_assessment_measures","248965947_Computer-assisted_Assessment_suggested_guidelines_for_an_institutional_strategy","248965882_The_Mass_Implementation_and_Evaluation_of_Computer-based_Assessments","245748420_Computer_based_assessment_some_issues_for_consideration","242524514_The_Ceilidh_System_A_General_Overview","233068898_The_Introduction_of_Computer-based_Testing_on_an_Engineering_Technology_Course","230273846_Web-Based_Tutoring_and_Testing_in_a_Computer_Networks_Course","225117035_Towards_a_typology_of_educational_uses_of_hypermedia","223573031_The_use_of_a_computer_tutorial_as_a_replacement_for_human_tuition_in_a_mastery_learning_strategy","222485174_Computer-assisted_assignments_in_a_large_physics_class","222345835_Diagnosys_-_A_knowledge-based_diagnostic_test_of_basic_mathematical_skills","30872094_Rethinking_University_Teaching_A_Framework_for_the_Effective_Use_of_Educational_Technology","29812032_A_unique_style_of_computer-assisted_assessment","29811987_Using_computer-based_tests_for_Information_Science","18786483_The_Technology_of_Teaching","2678736_Automatic_assessment_of_elementary_Standard_ML_programs_using_Ceilidh"]}