{"id":"222958839_Mona_Lisa_symbolism_uncovered_by_computer_processing","abstract":"Through the ages the image of the Mona Lisa del Gioconda by Leonardo da Vinci has receded beneath strata of discolored, crackled, and soiled varnish as well as a web of cleavage within the paint layer. This impedes esthetic appreciation as well as scholarly inspection of the piece. Unfortunately, the physical condition of the painting is such that it will not undergo cleaning and treatment very soon. Consequently, digital computer image processing has been applied to the artwork to recover an approximation of its original appearance and to bring out long-hidden details. This was accomplished first by digitizing a high-quality photograph of the composition to 6-million-pixel resolution and then applying gain-bias modulation to the RGB image files to recover the original varnish-free colors. The image restoration was completed through removal of the craquelure by numerically intensive IBM 3090 processing of the data in the large files of RGB data. Sequential application of matched-FFT and blue/green bi-scatter filters yielded the final result. Regional enhancement, local enhancement, and pseudo-color coding of the restored image uncovered pentimenti as well as areas where the painting has been modified. These indicate that at some point in the creation of the piece, a necklace and additional mountains were present. Such clarifications bring out a dramatic tension in the background, revealing a metaphor of the human condition.","authors":["John F. Asmus"],"meta":["September 1992Materials Characterization 29(2):119-128","DOI:10.1016/1044-5803(92)90110-4"],"references":["319837598_Digital_radiography_in_the_analysis_of_paintings_A_new_and_promising_technique","312605171_Computer_enhancement_of_the_Mona_Lisa","293722121_Computer_Studies_Of_The_Isleworth_And_Louvre_Mona_Lisas","272253441_The_Use_of_Digital_Image_Processing_to_Clarify_the_Radiography_of_Underpainting","271690589_Digital_Radiography_in_the_Analysis_of_Paintings_A_New_and_Promising_Technique","269442365_Leonardo_A_Study_in_Chronology_and_Style","253727083_Digital_Image_Processing_Applied_To_Problems_In_Art_And_Archaeology","221724979_The_Fourier_Transform_and_Its_Application","36930519_The_story_of_art"]}