{"id":"223007756_Fluxes_of_nutrients_from_the_tropical_River_Hooghly_at_the_land-ocean_boundary_of_Sundarbans_NE_Coast_of_Bay_of_Bengal_India","abstract":"The Ganges drains much of the southern slopes of the Himalayas and yields high-suspended sediment load during the monsoon. The Hooghly estuary, the first deltaic offshoot of the Ganges and flows through the western part of the Sundarbans mangrove forest is a source for inorganic nutrients due to the high input of litter and sediment associated nutrients that are released during estuarine transport. Dissolved inorganic carbon (DIC), dissolved inorganic nitrogen (DIN), dissolved reactive phosphate (DRP) and silicate budgets and fluxes of the coastal zone of the Hooghly River system have been done by biogeochemical modeling and their annual fluxes were calculated to be 230 × 109 mol (2.76 × 106 t), 4705 × 106 mol (65.8 × 103 t), 415 × 106 mol (12.8 × 103 t), 15.28 × 109 mol (42.8 × 103 t), respectively. Out of the total transport, monsoonal runoff could account 64% for DIC, 71% for DIN and 76% for both DRP and silicate. Annual load of sediment out of the estuary to the NE coast of Bay of Bengal was estimated to be 65.19 × 106 t. During the estuarine transport 7.5% of DIC and 7.0% of silicate were removed while addition for DIN and DRP were found to be 59% and 44%, respectively. Occurrence of light limited conditions and auto-heterotrophic coupling within the estuary results regeneration of nutrients from organic matter originated from external source. Comparison was made with the estimates of nutrient fluxes through the some mangrove dominated Southeast Asian estuaries.","authors":["S.K. Mukhopadhyay","Haimanti Biswas","Tarun Kumar De","Tapan Kumar Jana"],"meta":["May 2006Journal of Marine Systems 62:9 -21","DOI:10.1016/j.jmarsys.2006.03.004"],"references":["284695742_Mangrove_litter_production_in_a_tidal_creek_of_Lothian_island_of_Sundarbans_India","248717139_Carbon_Nitrogen_and_Phosphorus_Transport_by_World_Rivers","303259828_A_Practical_Handbook_of_Seawater_Analysis","284098180_Destruction_of_mangrove_wetlands-causes_and_consequences","280980495_A_Partical_Handbook_of_Seawater_Analysis","279508026_Ecological_changes_in_the_Hooghly_Estuary_due_to_water_release_from_Farakka_Barrage","250217561_Do_mangroves_rather_than_rivers_provide_nutrients_to_coastal_environments_south_of_the_Amazon_River_Evidence_from_long-term_flux_measurements","246078337_Environmental_regulation_of_phytoplankton_productivity_in_the_lower_Hudson_Estuary1","245587487_Biological_Oceanography_An_Introduction","240845666_Redfield_ratios_revisited_Removing_the_biasing_effect_of_anthropogenic_CO2"]}