{"id":"223035566_Contrastive_ESP_rhetoric_Metatext_in_Finnish-English_economics_texts","abstract":"This article describes a contrastive textlinguistic study of rhetorical differences between texts written by academics with different cultural backgrounds. It is assumed that, despite a relative uniformity of academic papers imposed by requirements of the genre, there is significant intercultural variation in the rhetorical preferences of writers. The cultural differences between texts written by Finnish and Anglo-American academics are explored with respect to metatext use in papers from economics journals. The results indicate that Anglo-American writers use more metatext or text about text than Finnish writers. It seems that Anglo-American writers are more concerned with guiding and orienting the reader than Finns, and show more explicit presence of the writer in the text. This is taken to reflect a more reader-oriented attitude, a more positive notion of politeness, and a generally more explicit textual rhetoric. Finnish writers show a more negative kind of politeness and a greater tendency towards implicitness in their writing. Such differences may result in unintentionally inefficient rhetoric when the target audience does not share the writer's assumptions and attitudes.","authors":["Anna Mauranen"],"meta":["December 1993English for Specific Purposes 12(1):3-22","DOI:10.1016/0889-4906(93)90024-I"],"references":["299534768_Process_and_text_Two_aspects_of_human_semiosis","290828252_Quantitative_contrastive_study_of_metadiscourse_Problems_in_design_and_analysis_of_data","285494621_The_problem_of_selection_of_writing_tasks_in_cross-cultural_study","285273873_Zur_kontrastiven_Analyse_von_medizinischen_Fachtexte_Eine_diachrone_Studie","284905542_A_comparative_approach_to_the_learning_of_specialized_written_discourse","284885595_Argumentation_in_Finnish_versus_English_and_German_editorials","247584914_Some_Exploratory_Discourse_on_Metadiscourse","238212291_Cultural_differences_in_academic_rhetoric","235342157_Nonnative_writing_and_native_revising_of_scientific_articles","234635401_Reference_in_Academic_Rhetoric_A_Contrastive_Study_of_Finnish_and_English_Writing","222812365_Cultural_Differences_in_the_Organization_of_Academic_Texts","48512536_Metadiscourse_in_Popular_and_Professional_Science_Discourse"]}