{"id":"223217500_Landmarks_in_graphs","abstract":"Navigation can be studied in a graph-structured framework in which the navigating agent (which we shall assume to be a point robot) moves from node to node of a “graph space”. The robot can locate itself by the presence of distinctively labeled “landmark” nodes in the graph space. For a robot navigating in Euclidean space, visual detection of a distinctive landmark provides information about the direction to the landmark, and allows the robot to determine its position by triangulation. On a graph, however, there is neither the concept of direction nor that of visibility. Instead, we shall assume that a robot navigating on a graph can sense the distances to a set of landmarks.Evidently, if the robot knows its distances to a sufficiently large set of landmarks, its position on the graph is uniquely determined. This suggests the following problem: given a graph, what are the fewest number of landmarks needed, and where should they be located, so that the distances to the landmarks uniquely determine the robot's position on the graph? This is actually a classical problem about metric spaces. A minimum set of landmarks which uniquely determine the robot's position is called a “metric basis”, and the minimum number of landmarks is called the “metric dimension” of the graph. In this paper we present some results about this problem. Our main new results are that the metric dimension of a graph with n nodes can be approximated in polynomial time within a factor of O(logn), and some properties of graphs with metric dimension two.","authors":["Samir Khuller","Balaji Raghavachari","Azriel Rosenfeld"],"meta":["October 1996Discrete Applied Mathematics 70(3):217-229","DOI:10.1016/0166-218X(95)00106-2","SourceDBLP"],"references":["264960330_On_the_metric_dimension_of_a_graph","228057776_Approximation_Algorithms_for_Combinatorial_Problems","222265105_On_the_ratio_of_optimal_integer_and_fractional_covers","221591949_Approximation_Algorithms_for_Combinatorial_Problems","220695890_Computers_and_Intracdtability_A_Guide_to_the_Theory_of_NP-Completeness","220632415_Metric_bases_in_digital_geometry","220573617_Approximation_Algorithms_for_Combinatorial_Problems"]}