{"id":"223400281_The_metric_dimension_of_Cayley_digraphs","abstract":"A vertex x in a digraph D is said to resolve a pair u, v of vertices of D if the distance from u to x does not equal the distance from v to x. A set S of vertices of D is a resolving set for D if every pair of vertices of D is resolved by some vertex of S. The smallest cardinality of a resolving set for D, denoted by dim(D), is called the metric dimension for D. Sharp upper and lower bounds for the metric dimension of the Cayley digraphs Cay(Δ:Γ), where Γ is the group Zn1⊕Zn2⊕⋯⊕Znm and Δ is the canonical set of generators, are established. The exact value for the metric dimension of Cay({(0,1),(1,0)}:Zn⊕Zm) is found. Moreover, the metric dimension of the Cayley digraph of the dihedral group Dn of order 2n with a minimum set of generators is established. The metric dimension of a (di)graph is formulated as an integer programme. The corresponding linear programming formulation naturally gives rise to a fractional version of the metric dimension of a (di)graph. The fractional dual implies an integer dual for the metric dimension of a (di)graph which is referred to as the metric independence of the (di)graph. The metric independence of a (di)graph is the maximum number of pairs of vertices such that no two pairs are resolved by the same vertex. The metric independence of the n-cube and the Cayley digraph Cay(Δ:Dn), where Δ is a minimum set of generators for Dn, are established.","authors":["Melodie Fehr","Shonda Gosselin","Ortrud R. Oellermann"],"meta":["January 2006Discrete Mathematics 306(1):31-41","DOI:10.1016/j.disc.2005.09.015","SourceDBLP"],"references":["265889329_The_metric_dimension_and_metric_independence_of_a_graph","220620982_The_Metric_Dimension_of_Cayley_Digraphs_of_Abelian_Groups","303151748_Leaves_of_trees","268777794_Fractional_graph_theory","268251279_The_directed_distance_dimension_of_oriented_graphs","267178777_The_metric_dimension_of_Cartesian_products_of_graphs","266424540_On_the_dimension_of_oriented_graphs","266168389_Contemporary_Abstract_Algebra","266168303_Contemporary_abstract_algebra_4th_ed","265443592_Dominating_and_reference_sets_in_a_graph","264960330_On_the_metric_dimension_of_a_graph","222514864_Resolvability_in_graphs_and_the_metric_dimension_of_a_graph","220695890_Computers_and_Intracdtability_A_Guide_to_the_Theory_of_NP-Completeness","220442826_On_Metric_Generators_of_Graphs","2485428_Localization_in_Graphs"]}