{"id":"223413893_Implementing_Precision_Agriculture_in_the_21st_Century","abstract":"Precision agriculture has generated a very high profile in the agricultural industry over the last decade of the second millennium—but the fact of ‘within-field spatial variability’, has been known for centuries. With the advent of the satellite-based Global Positioning System, farmers gained the potential to take account of spatial variability. The topic has been ‘technology-driven’ and so many of the engineering developments are in place, with understanding of the biological processes on a localized scale lagging behind. Nonetheless, further technology development is required, particularly in the area of sensing and mapping systems to provide spatially related data on crop, soil and environmental factors. Precision agriculture is ‘information-intense’ and could not be realized without the enormous advances in networking and computer processing power.Precision agriculture, as a crop management concept, can meet much of the increasing environmental, economic, market and public pressures on arable agriculture. By the end of the new decade, most arable enterprises will have taken on the concept on a whole-farm basis.","authors":["John V Stafford"],"meta":["July 2000Journal of Agricultural Engineering Research 76(3):267-275","DOI:10.1006/jaer.2000.0577"],"references":["277224859_Prospects_in_Agricultural_Engineering_in_the_Information_Age_-_Technological_Development_for_the_Producer_and_the_Consumer","271407001_Combining_agricultural_crop_models_and_satellite_observations_From_field_to_regional_scales","313555491_RTK_GPS","299695148_Near-Ground_and_Aerial_Radiometry_Imaging_for_Assessing_Spatial_Variability_in_Crop_Condition","299695057_Grain_Protein_Mapping_for_Precision_Management_of_Dryland_Wheat","284664841_The_GPS_error_budget","279895855_Mapping_of_Spatially_Variable_Yield_During_Grain_Combining","275576571_Dynamic_Sensing_of_Soil_Pans","263751691_Financial_incentives_and_pesticide_use","260597224_The_patch_treatment_of_weeds_in_cereals"]}