{"id":"223448840_The_promise_of_expert_systems_for_urban_planning","abstract":"In this Guest Editorial, we present a brief history of Expert Systems (ES), showing how they have emerged from work in Artificial Intelligence (AI) which has paralleled the availability of massive computer memory made possible by the development of the microprocessor. Our main concern here, however, is to present a context for the papers which follow, and we attempt this by identifying the sorts of planning problem to which expert systems can be applied, emphasising characteristics such as the balance between qualitative and quantitative representation, the degree to which such problems are well- or ill-defined and the extent to which their structure can be modelled using the logics of relation and search which lie at the heart of all expert systems. We also point out certain key features of the papers which comprise this special issue. In particular, we examine the way in which some of the authors use expert systems to interface existing computer models, thus developing Decision Support Systems (DSS). And we also note the concern in these applications for developing appropriate characterisations of the “knowledge base” and the “inference engine” through the generation of appropriate rule-based logics which suitably define the problems in question. Finally, we draw out some of the implications of this stream of research for more effective urban planning.","authors":["Michael Batty","Tony Yeh"],"meta":["December 1991Computers Environment and Urban Systems 15(3):101-108","DOI:10.1016/0198-9715(91)90001-T"],"references":["262411664_Excerpt_from_computer_power_and_human_reason","240541745_Can_Expert_Systems_Help_with_Planning","235956086_Intelligent_planning","235951331_An_intelligent_planning_machine","223701466_A_knowledge-based_computer_system_for_zoning","223591472_Text_animation_or_knowledge_engineering_Two_approaches_to_expert_system_design_in_urban_planning","223450683_Traffic_planning_by_a_desktop_expert","222592006_Expert_systems_for_urban_and_building_planning_and_management","222487232_A_decision_support_and_expert_system_for_retail_planning","222021135_An_expert_system_for_forecasting_roadside_development"]}