{"id":"223521901_Mathematical_modelling_for_optimized_control_of_Moscow's_sewer_network","abstract":"An algorithm for the optimized control of a branching urban head-and-gravity sewer network is proposed. The control consists in redistribution of the sewage flows between the network structural components. The algorithm is based on a mathematical model and presupposes the use of a computer. The mathematical model consists of a set of algebraic equations with the structure transporting capacities captured as constraints. The mathematical task of control is stated and solved as an optimization problem. The objective function is the minimization of total electric energy consumption over all the network pumping stations. The assumptions substantiated by practice would reduce the problem to the known problem of linear programming. The discharge through each pumping station of the considered subnetwork of Moscow's sewer network was computed using a mathematical model and was compared to the value observed under the same actual conditions. From this comparison, it was concluded that the proposed algorithm was more successful in controlling the network than was the traditional operation. The correction of the working conditions of some pumping stations of the Moscow sewer subnetwork in accordance with the precalculated time schedule, has allowed a significant decrease in the electric energy consumption for conveyance of the sewage through the network.","authors":["Yuri A. Ermolin"],"meta":["July 1999Applied Mathematical Modelling 23(7):543-556","DOI:10.1016/S0307-904X(98)10098-7"],"references":["325243738_On_the_Potential_of_Real_Time_Control_of_Urban_Drainage_Systems","277664318_LP_Operation_Model_for_On-Demand_Canal_Systems","274228177_Basic_Linear_Programming","274227986_Mathematical_Handbook_for_Scientists_and_Engineers","274115304_Basic_Optimisation_Methods","266836365_The_optimization_of_transportation_time","245288584_Ordinary_Operating_Conditions_of_Large_Channels_of_Moscow's_Sewerage_Network","245288547_Feedback_Control_of_Basin-Irrigation_System","245287674_Computer_Control_for_Irrigation-canal_System","223342913_Automated_control_of_urban_sewage_disposal_systems","220693241_Optimization_Algorithms_For_Networks_And_Graphs","31637942_Mathematical_Handbook_for_Scientists_and_Engineers_GA_Korn_TM_Korn"]}