{"id":"223659722_Resource-constrained_project_scheduling_Notation_classification_models_and_methods","abstract":"Project scheduling is concerned with single-item or small batch production where scarce resources have to be allocated to dependent activities over time. Applications can be found in diverse industries such as construction engineering, software development, etc. Also, project scheduling is increasingly important for make-to-order companies where the capacities have been cut down in order to meet lean management concepts. Likewise, project scheduling is very attractive for researchers, because the models in this area are rich and, hence, difficult to solve. For instance, the resource-constrained project scheduling problem contains the job shop scheduling problem as a special case. So far, no classification scheme exists which is compatible with what is commonly accepted in machine scheduling. Also, a variety of symbols are used by project scheduling researchers in order to denote one and the same subject. Hence, there is a gap between machine scheduling on the one hand and project scheduling on the other with respect to both, viz. a common notation and a classification scheme. As a matter of fact, in project scheduling, an ever growing number of papers is going to be published and it becomes more and more difficult for the scientific community to keep track of what is really new and relevant. One purpose of our paper is to close this gap. That is, we provide a classification scheme, i.e. a description of the resource environment, the activity characteristics, and the objective function, respectively, which is compatible with machine scheduling and which allows to classify the most important models dealt with so far. Also, we propose a unifying notation. The second purpose of this paper is to review some of the recent developments. More specifically, we review exact and heuristic algorithms for the single-mode and the multi-mode case, for the time–cost tradeoff problem, for problems with minimum and maximum time lags, for problems with other objectives than makespan minimization and, last but not least, for problems with stochastic activity durations.","authors":["Peter Brucker","Andreas Drexl","Rolf H. Möhring","Klaus Neumann"],"meta":["February 1999European Journal of Operational Research 112(1):3-41","DOI:10.1016/S0377-2217(98)00204-5","SourceDBLP"],"references":["345988766_Learning_in_Automated_Manufacturing","338419743_A_practical_use_of_Jackson's_preemptive_schedule_for_solving_the_job_shop_problem","316795176_Scheduling_Algorithms","316693547_Scheduling_Computer_and_Manufacturing_Processes","313216694_Tabu-search_algorithms_and_lower_bounds_for_the_resource-constrained_project_scheduling_problem","312939660_Resource_allocation_via_dynamic_programming_in_activity_networks","302297066_2_Solving_Large-Sized_Resource-Constrained_Project_Scheduling_Problems","299855230_Resource-constrained_project_scheduling_A_survey_of_recent_developments","285222332_Methods_for_Resource-Constrained_Project_Scheduling_with_Regular_and_Nonregular_Objective_Functions_and_Schedule-Dependent_Time_Windows","284667371_Variation_in_activity_level_on_a_cyclical_arrow_diagram","268990709_On_the_complexity_of_scheduling_an_arbitrary_system","284566634_Strong-weak_chain_constrained_scheduling","278325046_Project_Scheduling_with_Resource_Constraints_-_a_Branch_and_Bound_Approach","277677775_An_algorithm_for_a_general_class_of_precedence_and_resource_constrained_scheduling_problem","270285518_Scheduling_Algorithms"]}