{"id":"223621524_A_web-based_expert_system_to_assess_the_complexity_of_manufacturing_organizations","abstract":"Information-theoretic modelling of manufacturing organizations and their supply chains has led to the development of measures of manufacturing complexity. The measures include assessment of the structural, dynamic and decision-making complexity associated with the processing and movement of material and information around a manufacturing system. A computer program has been written to calculate the decision-making complexity of a manufacturing system, under different system layouts and operating characteristics. In order to make the results of this program accessible to manufacturing organizations, an expert system has been developed to act as a mediator between the program and interested organizations. Given some simple quantitative data on manufacturing performance, the expert system can estimate the organization's complexity and suggest some recommendations to reduce it, based on the data provided by the organization. The expert system will be implemented on the web to enable on-line acquisition and searching of data on companies. The quid pro quo of the expert system is that anonymized data on the organizations will be retained so that complexity benchmarks may be established.","authors":["Janet Smart","Anisoara Calinescu","Guy Blackburn"],"meta":["June 2002Robotics and Computer-Integrated Manufacturing 18(3-4):305-311","DOI:10.1016/S0736-5845(02)00022-4"],"references":["257494671_Introduction","247927443_The_Management_of_Complexity_in_Manufacturing","238176326_Modeling_and_analysis_of_manufacturing_systems_Ronald_G_Askin_and_Charles_R_Standridge_authors_John_Wiley_Sons_Inc_C1993_xvi_461_pp_6595","235317483_Measuring_complexity_as_an_aid_to_developing_operational_strategy","230641331_Introduction_to_Expert_Systems","27233941_Complexity_and_chaos_in_manufacturing_systems","3347855_The_too-flexible_factory","2457576_Complexity_in_Manufacturing_Systems_-_Part_1_Analysis_of_Static_Complexity"]}