{"id":"223714691_Analytic_Hierarchy_Process_An_Overview_of_Applications","abstract":"This article presents a literature review of the applications of Analytic Hierarchy Process (AHP). AHP is a multiple criteria decision-making tool that has been used in almost all the applications related with decision-making. Out of many different applications of AHP, this article covers a select few, which could be of wide interest to the researchers and practitioners. The article critically analyses some of the papers published in international journals of high repute, and gives a brief idea about many of the referred publications. Papers are categorized according to the identified themes, and on the basis of the areas of applications. The references have also been grouped region-wise and year-wise in order to track the growth of AHP applications. To help readers extract quick and meaningful information, the references are summarized in various tabular formats and charts.A total of 150 application papers are referred to in this paper, 27 of them are critically analyzed. It is hoped that this work will provide a ready reference on AHP, and act as an informative summary kit for the researchers and practitioners for their future work.","authors":["Omkarprasad Vaidya","Sushil Kumar,"],"meta":["February 2006European Journal of Operational Research 169(1):1-29","DOI:10.1016/j.ejor.2004.04.028"],"references":["263303751_A_hierarchical_method_for_evaluating_products_with_quantitative_and_sensory_characteristics","263268957_Use_of_the_analytic_hierarchy_process_to_measure_the_initial_viability_of_industrial_projects","260621616_An_extension_of_the_Analytic_Hierarchy_Process_for_industrial_RD_project_selection_and_resource_allocation","260621489_Evaluating_space_station_applications_of_automation_and_robotics","280166335_Performance_and_Evaluation_of_FMS","278928604_Multicriteria_decision_model_application_for_managing_group_decisions","264585187_Performance_evaluation_of_flexible_manufacturing_systems","263366452_A_decision-support_model_for_investment_decisions_in_new_ventures","263180899_Forming_teams_An_analytical_approach","262957374_Fuzzy_development_of_crisp_activity_relationship_charts_for_facilities_layout"]}