{"id":"223896524_Remote_sensing_image-based_analysis_of_the_relationship_between_urban_heat_island_and_land_usecover_changes","abstract":"Global warming has obtained more and more attention because the global mean surface temperature has increased since the late 19th century. As more than 50% of the human population lives in cities, urbanization has become an important contributor for global warming. Pearl River Delta (PRD) in Guangdong Province, southern China, is one of the regions experiencing rapid urbanization that has resulted in remarkable Urban Heat Island (UHI) effect, which will be sure to influence the regional climate, environment, and socio-economic development. In this study, Landsat TM and ETM+ images from 1990 to 2000 in the PRD were selected to retrieve the brightness temperatures and land use/cover types. A new index, Normalized Difference Bareness Index (NDBaI), was proposed to extract bare land from the satellite images. Additionally, Shenzhen, which has experienced the fastest urbanization in Guangdong Province, was taken as an example to analyze the temperature distribution and changes within a large city as its size expanded in the past decade. Results show that the UHI effect has become more prominent in areas of rapid urbanization in the PRD region. The spatial distribution of heat islands has been changed from a mixed pattern, where bare land, semi-bare land and land under development were warmer than other surface types, to extensive UHI. Our analysis showed that higher temperature in the UHI was located with a scattered pattern, which was related to certain land-cover types. In order to analyze the relationship between UHI and land-cover changes, this study attempted to employ a quantitative approach in exploring the relationship between temperature and several indices, including the Normalized Difference Vegetation Index (NDVI), Normalized Difference Water Index (NDWI), Normalized Difference Bareness Index (NDBaI) and Normalized Difference Build-up Index (NDBI). It was found that correlations between NDVI, NDWI, NDBaI and temperature are negative when NDVI is limited in range, but positive correlation is shown between NDBI and temperature.","authors":["Xiao-Ling Chen","Hong-Mei Zhao","Ping-Xiang Li","John Yin"],"meta":["September 2006Remote Sensing of Environment 104(2):133-146","DOI:10.1016/j.rse.2005.11.016"],"references":["265397120_Spatial_Distribution_and_microscale_characteristics_of_the_urban_heat_island_in_Tel-Aviv_Israel","252345251_An_Assessment_of_satellite_Remotely-sensed_Land_Cover_Parameters_in_Quantitatively_Describing_the_Climatic_Effect_of_Urbanization","285022153_Urban_heat_island_effect_of_Shenzhen_city","284791446_The_urban_microclimate_of_Singapore","284229002_Advances_in_study_on_vegetation_indices","284098591_Remote_sensing_of_urban_heat_islands_from_an_environmental_satellite","284091797_A_study_on_urban_thermal_field_in_summer_based_on_satellite_remote_sensing","260895907_Relationships_between_percent_vegetation_cover_and_vegetation_indices","256850115_Designing_a_spectral_index_to_estimate_vegetation_water_content_from_remote_sensing_data_Part_2_Validation_and_applications","254311073_A_remote_sensing-GIS_evaluation_of_urban_expansion_and_its_impact_on_surface_temperature_in_the_Zhujiang_Delta_China"]}