{"id":"223922921_Rethinking_Project_Management_Researching_the_Actuality_of_Projects","abstract":"This paper puts forth the somewhat controversial position that what is needed to improve project management in practice is not more research on what should be done or the frequency and/or use of traditional project management practices. We argue that while a great deal is written about traditional project management we know very little about the “actuality” of project based working and management. This paper formulates a research approach that takes seriously practitioner’s lived experience of projects. We explore the ontological, epistemological and methodological assumptions underlying this kind of research and provide examples of some project management research originating from this perspective. We conclude by summarizing the findings from these studies and providing insights into the map ahead for future such research. In this kind of work the attention is refocused on praxis, on context-dependent judgement, on situational ethics and on reflexivity which enables social actors to see how power actually functions in context.","authors":["Svetlana Cicmil","Terry Williams","Janice Thomas","Damian Edward Hodgson"],"meta":["November 2006International Journal of Project Management 24(8):675-686","DOI:10.1016/j.ijproman.2006.08.006"],"references":["311787997_Making_projects_critical_An_introduction","301852773_Megaprojects_and_Risk_An_Anatomy_of_Ambition","299429175_On_the_nature_of_disruption_and_delay_DD","324372256_Making_Sense_of_Management_A_Critical_Introduction","319394845_Sensemaking_in_Organizations","313093127_Assessing_and_building_on_the_underlying_theory_of_Project_Management_in_the_light_of_badly_over-run_projects","311785390_Problematising_project_management","292219868_Essai_Real_TimeReal_Space_Research_Connecting_Action_and_Reflection_in_Organization_Studies","290828319_Beyond_PM_101_Lessons_for_Managing_Large_Development_Programs","290108922_Making_Sense_of_Project_Management"]}