{"id":"223957689_Mining_biological_information_from_3D_short_time-series_gene_expression_data_The_OPTricluster_algorithm","abstract":"Nowadays, it is possible to collect expression levels of a set of genes from a set of biological samples during a series of time points. Such data have three dimensions: gene-sample-time (GST). Thus they are called 3D microarray gene expression data. To take advantage of the 3D data collected, and to fully understand the biological knowledge hidden in the GST data, novel subspace clustering algorithms have to be developed to effectively address the biological problem in the corresponding space.\nWe developed a subspace clustering algorithm called Order Preserving Triclustering (OPTricluster), for 3D short time-series data mining. OPTricluster is able to identify 3D clusters with coherent evolution from a given 3D dataset using a combinatorial approach on the sample dimension, and the order preserving (OP) concept on the time dimension. The fusion of the two methodologies allows one to study similarities and differences between samples in terms of their temporal expression profile. OPTricluster has been successfully applied to four case studies: immune response in mice infected by malaria (Plasmodium chabaudi), systemic acquired resistance in Arabidopsis thaliana, similarities and differences between inner and outer cotyledon in Brassica napus during seed development, and to Brassica napus whole seed development. These studies showed that OPTricluster is robust to noise and is able to detect the similarities and differences between biological samples.\nOur analysis showed that OPTricluster generally outperforms other well known clustering algorithms such as the TRICLUSTER, gTRICLUSTER and K-means; it is robust to noise and can effectively mine the biological knowledge hidden in the 3D short time-series gene expression data.","authors":["Alain B Tchagang","Sieu Phan","Fazel Famili","Heather Shearer"],"meta":["April 2012BMC Bioinformatics 13(1):54","DOI:10.1186/1471-2105-13-54","SourcePubMed"],"references":["292693175_Gene_expression_during_the_life_cycle_of_Drosophila_melanogaster","255597337_Biclustering_Algorithms_A_Survey","224806746_Parallel_identification_of_gene_biclusters_with_coherent_evolutions","224806731_DNA_Microarray_Data_Analysis_A_Novel_Biclustering_Algorithm_Approach","285028466_Cluster_analysis_and_display_of_genome-wide_expression_patterns","258175596_Biclustering_of_DNA_microarray_data_theory_evaluation_and_applications","240026770_Handbook_of_Computational_Molecular_Biology","239667917_Church_GM_Systematic_determination_of_genetic_network_architecture","227167120_Cytokinin_receptor-dependent_and_receptor-independent_pathways_in_the_dehydration_response_of_Arabidopsis_thaliana","225118758_gTRICLUSTER_A_more_general_and_effective_3D_clustering_algorithm_for_gene-sample-time_microarray_data","224806588_Biclustering_of_DNA_Microarray_Data_Theory_Evaluation_and_Applications","224678682_ParTriCluster_A_Scalable_Parallel_Algorithm_for_Gene_Expression_Analysis","221215084_TRICLUSTER_an_effective_algorithm_for_mining_coherent_clusters_in_3D_microarray_data","220932623_Order-Preserving_Clustering_and_Its_Application_to_Gene_Expression_Data","220867726_Order_Preserving_Clustering_over_Multiple_Time_Course_Experiments"]}