{"id":"224087846_Active_e-mail_system_SMTP_protocol_monitoring_algorithm","abstract":"E-mail system is one of the most ubiquitous Internet-based applications today. It enables users to send and receive e-mail messages among each other within and from outside of the local area network. E-mail system is used every day in almost all organizations as a communication tool between managers, employees, customers, and partners for better information flow and conduct business which requires communication with people outside the organization, or from different geographical locations. The e-mail system offers a fast, reliable and easy solution for such communication. SMTP (simple mail transfer protocol) is a transportation protocol used to transfer e-mail messages over the Internet. All e-mail servers use the SMTP to send e-mails from one e-mail server to another. SMTP is also used to send e-mail messages from e-mail clients to e-mail servers. In this paper, the SMTP e-mail system protocol will be briefly explained. New active monitoring algorithm architecture is also proposed to improve the current e-mail system protocol functions and detect the SMTP protocol failure during the process of sending e-mail messages.","authors":["Sureswaran Ramadass","Hussein Al Bazar","Omar Amer Abouabdalla","Ahmad Manasrah"],"meta":["November 2009","DOI:10.1109/ICBNMT.2009.5348490","SourceIEEE Xplore","Conference: Broadband Network & Multimedia Technology, 2009. IC-BNMT '09. 2nd IEEE International Conference on"],"references":["228358160_A_Learning_Approach_to_Spam_Detection_based_on_Social_Networks","220269683_Understanding_passive_and_active_service_discovery","344080214_Computer_Networking_at_UMR","239667619_RFC_2821Simple_Mail_Transfer_Protocol","228419930_ENHANCED_DELIVERY_THROUGH_A_SMART_SMTP_CLIENT","3718935_A_comparative_study_of_Simple_Mail_Transfer_Protocol_SMTP_PostOffice_Protocol_POP_and_X400_Electronic_Mail_Protocols","3614113_The_future_of_email_or_when_will_Grandma_be_on_the_net"]}