{"id":"224085020_Hybrid_Ant_Colony_Systems_for_course_timetabling_problems","abstract":"The university course timetabling is a complex optimization problem which is difficult to solve for optimality. It involves assigning lectures to a fixed number of timeslots and rooms; while satisfying some constraints. The goal is to construct a feasible timetable and satisfy soft constraints as much as possible. In this study, we apply two hybrids ant colony systems, namely the simulated annealing with ant colony system (ACS-SA), and tabu search with ant colony system (ACS-TS) to solve the university course timetabling, a number of ants in the ACS construct a complete assignment of courses to timeslots. Based on a pre-ordered list of courses, the ants probabilistically choose the timeslot for the given course, guided by heuristic information and stigmergic information. We test both ACS algorithms over the Socha's benchmark course timetabling problem. We also compare our results with those obtained by other methodologies recent literature has illustrated. Experimental results showed that both ACS-SA and ACS-TS produces good quality solutions and outperforms previously applied Ant algorithms; they also outperform other methodologies tested on Socha's benchmark test instances, and approaches on some benchmark instances. We believe that these hybrid ACS algorithms are also valid for other types of combinational optimization problems.","authors":["Masri Ayob","Ghaith M. Jaradat"],"meta":["November 2009","DOI:10.1109/DMO.2009.5341898","SourceIEEE Xplore","Conference: Data Mining and Optimization, 2009. DMO '09. 2nd Conference on","Project: NATURE-INSPIRED ALGORITHMS FOR CONSTRAINED AND UNCONSTRAINED OPTIMISATION PROBLEMS"],"references":["308953674_Ant_Colony_Optimization","264470328_Ant_systems_Local_Search_Optimization_for_flexible_Job_Shop_Schedul_Production","243779308_From_Natural_to_Arti_cial_Swarm_Intelligence","235606311_Fuzzy_multiple_heuristic_ordering_for_course_timetabling","235439172_University_timetabling","235439161_Great_deluge_with_nonlinear_decay_rate_for_solving_course_timetabling_problems","235439153_Ant_sytem_Optimization_by_a_colony_of_cooperating_agents","232627738_Generating_University_Course_Timetable_Using_Genetic_Algorithms_and_Local_Search","312907789_Ant_system_Optimization_by_a_colony_of_cooperating_agents","245314645_An_e_ec-tive_hybrid_approach_for_the_university_course_timetabling_problem"]}