{"id":"224129426_Provably_Secure_Integrated_OnOff-Line_Electronic_Cash_for_Flexible_and_Efficient_Payment","abstract":"Due to the ubiquity of the Internet and wireless networks, the development of electronic commerce is growing up rapidly. Many payment mechanisms, such as electronic cash (e-cash), credit cards, and electronic wallets, for electronic transactions have been proposed. Especially, e-cash has become popular since it can fully protect the privacy of customers in various electronic transactions. In general, e-cash can be classified into two types, which are on-line e-cash and off-line e-cash, and they are suitable for different applications and environments. All of the proposed e-cash schemes only focus on on-line or off-line e-cash,\nbut not both. In these schemes, users must decide which type of e-cash they will use later when withdrawing. In this paper, we will propose a novel e-cash scheme, which can support each user to withdraw a generic e-cash and decide to spend it as an on-line e-cash or an off-line e-cash when paying. Owing to the integration of on-line and off-line e-cash, our proposed scheme is more convenient for users and more flexible for the bank and shops as\ncompared with the previous schemes. Furthermore, we consider anonymity control, no swindling, tamper resistance, and other key features of e-cash in the proposed scheme. Finally, we also provide formal proofs for the security of the proposed scheme.","authors":["Chun-I Fan","Vincent Shi"],"meta":["October 2010IEEE Transactions on Systems Man and Cybernetics Part C (Applications and Reviews) 40(5):567-579","DOI:10.1109/TSMCC.2010.2044789","SourceIEEE Xplore"],"references":["243785819_A_Signature_Scheme_with_Ecient_Protocols","226775659_The_One-More-RSA-Inversion_Problems_and_the_Security_of_Chaum's_Blind_Signature_Scheme","321557375_Advances_in_Cryptology_-_CRYPTO'_86_Proceedings","285675222_Untraceable_electronic_cash_C","268299312_Trusted_Platform_Module_TPM_based_Security_on_Notebook_PCs_-White_Paper","262322950_An_Efficient_On-Line_Electronic_Cash_with_Unlinkable_Exact_PaymentsThe_preliminary_version_of_this_paper_was_presented_at_WISA2003_19_and_ISC'04_20","244423655_Determining_Strengths_For_Public_Keys_Used_For_Exchang-ing_Symmetric_Keys","239061977_Revokable_and_versatile_electronic_mony","228799501_Trusted_computing_platforms_the_next_security_solution","227278234_Unlinkable_Electronic_Coupon_Protocol_with_Anonymity_Control","225139870_A_Verifiable_Random_Function_with_Short_Proofs_and_Keys","221354922_A_Practical_and_Provably_Secure_Coalition-Resistant_Group_Signature_Scheme","221348232_Divisible_E-Cash_Systems_Can_Be_Truly_Anonymous","225330348_A_New_Offiine_Privacy_Protecting_E-cash_System_with_Revokable_Anonymity","221354901_Untraceable_Electronic_Cash"]}