{"id":"224157212_An_Efficient_Algorithm_for_Planar_Circuits_Design","abstract":"An efficient algorithm for planar circuits design based on the wave concept (WCIP) is formulated and applied. The algorithm is based in the use of a recursive relationship between incident waves and reflected waves from a discontinuity plane instead of an integral equation method. The advantage here are that no matrix inversion is required, the convergence is insured independently of the kind or numbers of interfaces of the structure and well adapted to multi-layered circuit characterization, antenna coupling over concentric cylinders. The method herein presented solves for the current density and the tangential electrical field on the interface. The robustness of this formulation permits to solve, independently of the frequency or physical size, several problems by applying dual quantities. In order to simplify calculations and accelerate the convergence, a two-dimensional fast modal transformation (FMT) algorithm using periodic walls is used with the 2D-FFT algorithm. As example, the simulation results for two different structures, an open microstrip line and a microstrip patch antenna, are presented.","authors":["A. Serres","Glauco Fontgalland","José Ewerton Pombo de Farias","Henri Baudrand"],"meta":["September 2010IEEE Transactions on Magnetics 46(8):3441 - 3444","DOI:10.1109/TMAG.2010.2044150","SourceIEEE Xplore"],"references":["3356371_Analysis_of_planar_circuit_using_a_multigrid_iterative_method","3130706_A_New_full-wave_hybrid_differential-integral_approach_for_the_investigation_of_multilayer_structure_including_nonuniformly_doped_diffusions","243617299_Foundation_of_Microwave_Engineering","224691880_New_Approaches_for_Multi-Scale_Circuit_Analysis","224440435_Higher_Order_Hybrid_FEM-MoM_Technique_for_Analysis_of_Antennas_and_Scatterers","224351865_A_Symmetric_Electromagnetic-Circuit_Simulator_Based_on_the_Extended_Time-Domain_Finite_Element_Method","224330519_Interfacing_the_TLM_and_the_TWF_Method_using_a_Diakoptics_Approach","44327018_Foundations_for_microwave_engineering_Robert_E_Collin","3123713_Power_Waves_and_the_Scattering_Matrix"]}