{"id":"224140574_Multi-path_transmission_control_scheme_combining_bandwidth_aggregation_and_packet_scheduling_for_real-time_streaming_in_multi-path_environment","abstract":"These days, a wide variety of wireless interfaces are available to connect to Internet. When coverage area of these different technologies overlap, receiver equipped with multiple interfaces can use them simultaneously to improve the performance of its applications in terms of bandwidth rely on bandwidth aggregation. However, specific conditions such as bottleneck bandwidth and end-to-end delay need to be accounted for before using such techniques. If this problem of end-to-end delay and bottleneck bandwidth are not properly addressed, there may be many packets along multiple paths which can arrive late and can lead to a large number of out-of-order packets at the receiver, which can eventually cause serious degradation of video quality at the receiver. For this reason, in this study, the authors propose a multi-path transmission control scheme (MTCS) combining bandwidth aggregation and packet scheduling for real-time streaming in a multi-path environment. In a bandwidth aggregation scheme, the authors propose a mathematical model to find the transmission rate over each path in order to obtain the optimal total throughput. However, the end-to-end delay of each path is not the same. The out-of-order packets problem will become serious in a multi-path environment. Therefore the authors propose a packet scheduling scheme to arrange the transmission sequence in order to effectively minimise the impact of packet reordering at the receiver. Our proposed control scheme not only aggregates the available bandwidth of multiple paths, but also reduces the time of packet reordering at the receiver. Experimental results show with our proposed scheme, the authors not only obtain the optimal transmission throughput but also reduce packet reordering delays under varying drop and delay conditions caused by the underlying network.","authors":["Meng-Feng Tsai","Naveen Chilamkurti","J.H. Park","C.-K. Shieh"],"meta":["June 2010IET Communications 4(8):937 - 945","DOI:10.1049/iet-com.2009.0661","SourceIEEE Xplore"],"references":["3436705_WiSE_Best-Path_Selection_in_Wireless_Multihoming_Environments","3424549_Video_Packet_Selection_and_Scheduling_for_Multipath_Streaming","224374701_A_Concurrent_Multi-path_Transmission_Control_Scheme_to_reduce_packet_reordering_latency_at_the_receiver","221671436_Performance_Evaluation_of_Shortest_Multipath_Source_Routing_Scheme","220664378_Transmission_of_layered_video_streaming_via_multi-path_on_ad_hoc_networks","220664306_Sub-packet_forward_error_correction_mechanism_for_video_streaming_over_wireless_networks","220548126_An_adaptive_multi-hop_forward_error_correction_protection_scheme_for_video_streaming_over_wireless_mesh_networks","220211244_Reorder_buffer-occupancy_density_and_its_application_for_measurement_and_evaluation_of_packet_reordering","3436470_Bandwidth_aggregation_for_real-time_applications_in_heterogeneous_wireless_networks","2884785_A_Measurement_Study_of_Available_Bandwidth_Estimation_Tools"]}