{"id":"224182598_Language-Independent_Clone_Detection_Applied_to_Plagiarism_Detection","abstract":"Clone detection is usually applied in the context of detecting small-to medium scale fragments of duplicated code in large software systems. In this paper, we address the problem of clone detection applied to plagiarism detection in the context of source code assignments done by computer science students. Plagiarism detection comes with a distinct set of constraints to usual clone detection approaches, which influenced the design of the approach we present in this paper. For instance, the source code can be heavily changed at a superficial level (in an attempt to look genuine), yet be functionally very similar. Since assignments turned in by computer science students can be in a variety of languages, we work at the syntactic level and do not consider the source-code semantics. Consequently, the approach we propose is endogenous and makes no assumption about the programming language being analysed. It is based on an alignment method using the parallel principle at local resolution (character level) to compute similarities between documents. We tested our framework on hundreds of real source files, involving a wide array of programming languages (Java, C, Python, PHP, Haskell, bash). Our approach allowed us to discover previously undetected frauds, and to empirically evaluate its accuracy and robustness.","authors":["Romain Brixtel","Mathieu Fontaine","Boris Lesner","Cyril Bazin"],"meta":["October 2010","DOI:10.1109/SCAM.2010.19","SourceIEEE Xplore","Conference: Source Code Analysis and Manipulation (SCAM), 2010 10th IEEE Working Conference on"],"references":["266493507_Design_of_the_AC_Academic_Plagiarism_Detection_System","232635867_Comparison_and_Evaluation_of_Clone_Detection_Tools","221307490_Clone_Detection_Using_Abstract_Syntax_Trees","221214940_Winnowing_Local_Algorithms_for_Document_Fingerprinting","299733859_From_the_Rosetta_stone_to_the_information_society","266277771_Parallel_text_processing_Alignment_and_use_of_translation_corpora","236344183_The_Hungarian_Method_for_the_Assignment_Problem","224600818_Evolution_of_Type-1_Clones","221996415_The_Hungarian_Method_for_The_Assignment_Problem","221419653_Program_Plagiarism_Detection_Using_Parse_Tree_Kernels"]}