{"id":"224142246_Performance_analysis_of_MUSIC_and_ESPRIT_DOA_estimation_algorithms_for_adaptive_array_smart_antenna_in_mobile_communication","abstract":"Adaptive array smart antenna involves the array processing to manipulate the signals induced on various antenna elements in such way that the main beam directing towards the desired signal and forming the nulls towards the interferers. Such smart antennas are widely used in wireless mobile communications as they can increase the channel capacity and coverage range. In adaptive array smart antenna, to locate the desired signal, various direction of arrival (DOA) estimation algorithms are used. This paper investigates and compares MUSIC and ESPRIT, DOA estimation algorithms which are widely used in the design of smart antenna system. MUSIC and ESPRIT algorithms provide high angular resolution and hence they are explored much in detail by varying various parameters of smart antenna system. However simulation in this paper shows that MUSIC algorithm is highly accurate and stable and provides high angular resolution compared to ESPRIT and hence MUSIC algorithm can be widely used in mobile communication to estimate the DOA of the arriving signals.","authors":["T.B. Lavate","V. K. Kokate","A.M. Sapkal"],"meta":["May 2010","DOI:10.1109/ICCNT.2010.45","SourceIEEE Xplore","Conference: Computer and Network Technology (ICCNT), 2010 Second International Conference on"],"references":["259598997_Wireless_Communications","239563691_Application_of_Antenna_Arrays_to_Mobile_Communications_Part_II_BeamForming_and_Direction-of-Arr_ival_Considerations","3920970_Smart_antennas_for_wireless_communications","3674250_Limitations_and_capabilities_of_directions-of-arrival_estimation_techniques_using_an_array_of_antennas_a_mobile_communications_perspective","3177980_Eigenstructure_methods_for_direction_of_arrival_estimation_in_the_presence_of_unknown_noise_fields","2985205_Application_of_antenna_arrays_to_mobile_communications_II_Beam-forming_and_direction-of-arrival_considerations"]}