{"id":"224167940_Marrying_Content_and_Process_in_Computer_Science_Education","abstract":"Constructivist approaches to computer science education emphasize that as well as knowledge, thinking skills and processes are involved in active knowledge construction. K-12 computer science curricula must not be based on fashions and trends, but on contents and processes that are observable in various domains of computer science, that can be taught at every intellectual level, that will stay relevant in the longer term, and that are related to everyday language and/or thinking. Only recently, two empirically determined lists, one of central content concepts (algorithm, computer, data, system, etc.) and another of central process concepts (problem solving and problem posing, analyzing, classifying, generalizing, etc.), have become available for computer science education. This paper tackles the problem of finding content and process concepts to be taught in combination. Computer science experts are surveyed in order to identify combinations of content and process concepts-so-called blocks-that are relevant to computer science education. By using cluster analyses, 15 central blocks for teaching computer science in schools are determined. The results of this study may serve as a reference system for the systematic design of instruction in K-12 computer science education.","authors":["Andreas Zendler","Christian Spannagel","Dieter Klaudt"],"meta":["September 2011IEEE Transactions on Education 54(3):387 - 397","DOI:10.1109/TE.2010.2062184","SourceIEEE Xplore"],"references":["313593641_Hierarchical_groupings_to_optimize_an_objective_function","310595492_Putting_Threshold_Concepts_into_Context_in_Computer_Science_Education","293496508_What_the_schools_teach_A_social_history_of_the_American_curriculum_since_1950","292754995_Conducting_mail_and_Internet_surveys","292251423_Cover_the_material_-_Or_teach_students_to_think","289099346_Cluster_analysis_London","281345394_The_New_Taxonomy_of_Educational_Objectives","260002800_Teaching_And_Learning_Strategies_For_The_Thinking_Classroom","256173380_Leveraging_the_Semantics_of_Topic_Maps","250888362_Supporting_abstraction_processes_in_problem_solving_through_pattern-oriented_instruction"]}