{"id":"224144456_Morphological_Attribute_Profiles_for_the_Analysis_of_Very_High_Resolution_Images","abstract":"Morphological attribute profiles (APs) are defined as a generalization of the recently proposed morphological profiles (MPs). APs provide a multilevel characterization of an image created by the sequential application of morphological attribute filters that can be used to model different kinds of the structural information. According to the type of the attributes considered in the morphological attribute transformation, different parametric features can be modeled. The generation of APs, thanks to an efficient implementation, strongly reduces the computational load required for the computation of conventional MPs. Moreover, the characterization of the image with different attributes leads to a more complete description of the scene and to a more accurate modeling of the spatial information than with the use of conventional morphological filters based on a predefined structuring element. Here, the features extracted by the proposed operators were used for the classification of two very high resolution panchromatic images acquired by Quickbird on the city of Trento, Italy. The experimental analysis proved the usefulness of APs in modeling the spatial information present in the images. The classification maps obtained by considering different APs result in a better description of the scene (both in terms of thematic and geometric accuracy) than those obtained with an MP.","authors":["Mauro Dalla Mura","Jon Atli Benediktsson","Björn Waske","Lorenzo Bruzzone"],"meta":["November 2010IEEE Transactions on Geoscience and Remote Sensing 48(10):3747 - 3762","DOI:10.1109/TGRS.2010.2048116","SourceIEEE Xplore"],"references":["313552808_An_introduction_to_boosting_and_leveraging","288906520_Random_forests","283921280_Visual_Pattern_Recognition_by_Moment_Invariants","268733104_Speeded-up_robust_features_SURF","258304769_Machine_Learning_Volume_45_Number_1_-_SpringerLink","253375035_Modeling_structural_information_for_building_extraction_with_morphological_attribute_filters","251891086_An_Artificial_Immune_Approach_for_Vehicle_Detection_from_High_Resolution_Space_Imagery","248977789_Vehicle_detection_in_1-m_resolution_satellite_and_airborne_imagery","247881137_The_Ftting_of_Power_Series_Meaning_Polynomials_Illustrated_on_Band-Spectroscopic_Data","246872016_Morphological_greyscale_reconstruction_in_image_analysis_efficient_algorithms_and_applications"]}