{"id":"224190514_Digital_Signal_Processing_With_Molecular_Reactions","abstract":"We present a methodology for implementing digital signal processing (DSP) operations such as filtering with biomolecular reactions. From a DSP specification, we demonstrate how to synthesize biomolecular reactions that produce time-varying output quantities of molecules as a function of time-varying input quantities. Unlike all previous schemes for biomolecular computation, ours produces designs that are dependent only on coarse rate categories for the reactions (“fast” and “slow”). Given such categories, the computation is exact and independent of the specific reaction rates. We implement DSP operations through a self-timed “handshaking” protocol that transfers quantities between molecular types based on the absence of other types. Our scheme is efficient: both the number of molecular types and the number of reactions grow linearly with the size of the DSP specification. We illustrate our methodology with the design of a simple moving-average filter as well as a more complex biquad filter. We validate our designs through transient stochastic simulations of the chemical kinetics. Although conceptual for the time being, our methodology has potential applications in domains of synthetic biology such as biochemical sensing and drug delivery. We are exploring DNA-based computation via strand displacement as a possible experimental chassis.","authors":["Hua Jiang","Marc Riedel","Keshab K. Parhi"],"meta":["November 2010","DOI:10.1109/SIPS.2010.5624796","SourceIEEE Xplore","Conference: Signal Processing Systems (SIPS), 2010 IEEE Workshop on"],"references":["224201596_A_synthesis_flow_for_digital_signal_processing_with_biomolecular_reactions","221061495_Synchronous_sequential_computation_with_molecular_reactions","51476393_Rate-Independent_Constructs_for_Chemical_Computation","49813111_A_Simple_DNA_Gate_Motif_for_Synthesizing_Large-Scale_Circuits","285855378_DNA_as_a_Universal_Substrate_for_Chemical_Kinetics","243579272_VLSI_Digital_Signal_Processing_Systems","235324215_SPICE_Simulation_Program_with_Integrated_Circuit_Emphasis","230554866_Discrete-Time_Signal_Processing","224043664_Exact_Stochastic_Simulation_Of_Coupled_Chemical-Reactions","46169993_Selective_cell_death_mediated_by_small_conditional_RNAs"]}