{"id":"224195787_Analysis_of_self-powered_vibration-based_energy_scavenging_system","abstract":"This paper analyses a complete self-powered vibration based energy scavenging system. For the purpose of the analysis, the energy scavenging system (comprising of a SPICE model of Piezoelectric Bender Generator (PBG), an integrated semi-active bridge rectifier and a voltage regulator circuit) has been implemented in SPICE and presented in this paper. The semi-active bridge rectifier proposed in this paper uses Vertical Double-diffused MOS (VDMOS) transistors in place of standard diodes, to be suitable to withstand the high voltage values generated by PBGs. Using SPICE the analysis of the reciprocal interaction between PBG and scavenging system (in terms of stress, strain rate, mechanical and electrical powers at various loads and regulated voltages) is investigated. The simulation results of the semi-active bridge rectifier have shown an efficiency of the rectifier of about the 90 %. The simulation results of the whole system with optimized control circuits have shown how both the load and the regulated voltage can influence the behavior of stress and strain rate and vice versa. Comparisons of simulated stress and strain rate at various loads and regulated voltage values have shown an opposite behavior of the strain rate with respect to the stress. The simulation results of various powers - mechanical and electrical - from PBG to the load have shown the amount of mechanical power converted by the PBG into electrical that can be transferred to the load and that an optimal load exist.","authors":["Luigi Pinna","Ravinder S. Dahiya","Fabrizio De Nisi","Maurizio Valle"],"meta":["August 2010","DOI:10.1109/ISIE.2010.5637866","SourceIEEE Xplore","Conference: Industrial Electronics (ISIE), 2010 IEEE International Symposium on"],"references":["224567459_Piezoelectric_oxide_semiconductor_field_effect_transistor_touch_sensing_devices","224113413_SPICE_model_for_Piezoelectric_Bender_Generators","224086157_A_Low-Power_Stand-Alone_Adaptive_Circuit_for_Harvesting_Energy_From_a_Piezoelectric_Micropower_Generator","39994892_Energy_Harvesting_Vibration_Sources_for_Microsystems_Applications","3280250_Adaptive_piezoelectric_energy_harvesting_circuit_for_wireless_remote_power_supply","239721748_Energy_Scavenging_For_Wireless_Sensor_Networks_With_Special_Focus_On_Vibrations","224503994_Kinetic_Energy_Harvesting_Using_Piezoelectric_and_Electromagnetic_Technologies-State_of_the_Art"]}