{"id":"224215082_Digital_Image_Classification_for_Malaysian_Blooming_Flower","abstract":"Digital image processing is a rapidly growing area of computer science since it was introduced and developed in the 1960's. In the case of flower classification, image processing is a crucial step for computer-aided plant species identification. Colour of the flower plays very important role in image classification since it gives additional information in terms of segmentation and recognition. On the other hand, Texture can be used to facilitate image-based retrieval system normally and it is encoded by a number of descriptors, which represented by a set of statistical measures such as gray-level co-occurrence matrix (GLCM) and Law's Order approach. This study addresses the application of NN and on image processing particularly for understanding flower image features. For predictive analysis, two techniques have been used namely, Neural Network (NN) and Logistic regression. The study shows that NN obtains the higher percentage of accuracy among two techniques. The MLP is trained by 1800 flower's dataset to classify 30 kinds of flower's type.","authors":["Fadzilah Siraj","Salahuddin Muhammad Ashraq","Shahrul Azmi Mohd Yusof"],"meta":["October 2010","DOI:10.1109/CIMSiM.2010.92","SourceIEEE Xplore","Conference: Computational Intelligence, Modelling and Simulation (CIMSiM), 2010 Second International Conference on","Project: Expert system"],"references":["312942469_Local_Binary_Patterns_as_an_Image_Preprocessing_for_Face_Authentication","302937305_A_Threshold_Selection_Method_from_Gray-Level_Histogram","302342953_Introduction_to_Image_Processing","299009533_Recognition_of_weeds_with_image_processing_and_their_use_with_fuzzy_logic_for_precision_farming","293264204_Histogram-based_color_image_retrieval","288920812_Digital_image_processing_for_medical_applications","285026638_Recognition_of_weeds_with_image_processing_and_their_use_with_fuzzy_logic_for_precision_farming","278695407_Digital_Image_Processing_for_Optical_Metrology","260903779_Hyperspectral_image_classification_using_spectral_histograms_and_semi-supervised_learning","260290143_Efficient_Content_Based_Image_Retrieval"]}