{"id":"224294508_Reconfigurable_Control_Allocation_against_Aircraft_Control_Effector_Failures","abstract":"Due to increased requirements on the reliability, maneuverability and survivability of modern and future manned and unmanned aerial vehicles, more control effectors/surfaces are being introduced. This introduces redundant or overactuated control effectors and requires the control allocation function, together with baseline flight control law, to be implemented in the overall flight control systems. In particular, in the case of control effector (actuator) failures or control surface damages, an effective re-distribution (or reallocation) of the control surface deflections with the remaining healthy control effectors is needed in order to achieve acceptable performance even in the presence of control effector failures. In this paper, as a preliminary study of reconfigurable control allocation (control re-allocation) applied to a realistic and nonlinear aircraft model, a pseudo-inverse method and a fixed-point algorithm are implemented and tested in an ADMIRE (aero-data model in research environment) benchmark aircraft model. Partial loss of control effectiveness faults have been implemented in the ADMIRE benchmark and used for evaluating the control re-allocation schemes. Simulation results show satisfactory results for accommodating the control effector failures.","authors":["Youmin Zhang","V. Sivasubramaniam Suresh","Bin Jiang","Didier Theilliol"],"meta":["November 2007","DOI:10.1109/CCA.2007.4389398","SourceIEEE Xplore","Conference: Control Applications, 2007. CCA 2007. IEEE International Conference on"],"references":["317019305_Bibliographical_review_on_reconfigurable_fault-tolerant_control_systems","291105144_Constrained_control_allocation","285599425_Constrained_Control_Allocation","271372351_Use_of_the_pseudo-inverse_for_design_of_a_reconfigurable_flight_control_system","269063112_Closed-loop_comparison_of_control_allocation_methods","268357301_Constrained_Control_Allocation_for_Systems_with_Redundant_Control_Effectors","267786826_Integrated_reconfigurable_control_allocation","245392871_Historical_Overview_of_Research_in_Reconfigurable_Flight_Control","239415008_Evaluation_of_Optimization_Methods_for_Control_Allocation","222427465_Bibliographical_Review_on_Reconfigurable_Fault-Tolerant_Control_System"]}