{"id":"224218018_A_Knowledge-Driven_Approach_to_Activity_Recognition_in_Smart_Homes","abstract":"This paper introduces a knowledge-driven approach to real-time, continuous activity recognition based on multi-sensor data streams in smart homes. The approach goes beyond the traditional data-centric methods for activity recognition in three ways. Firstly, it makes extensive use of domain knowledge in the lifecycle of activity recognition. Secondly, it uses ontologies for explicit context and activity modeling and representation. Thirdly and finally, it exploits semantic reasoning and classification for activity inferencing, thus enabling both coarse-grained and fine-grained activity recognition. In this paper we analyse the characteristics of smart homes and Activities of Daily Living (ADL) upon which we built both context and ADL ontologies. We present a generic system architecture for the proposed knowledge-driven approach and describe the underlying ontology-based recognition process. Special emphasis is placed on semantic subsumption reasoning algorithms for activity recognition. The proposed approach has been implemented in a function-rich software system, which was deployed in a smart home research laboratory. We evaluated the proposed approach and the developed system through extensive experiments involving a number of various ADL use scenarios. An average activity recognition rate of 94.44% was achieved and the average recognition run-time per recognition operation was measured as 2.5 seconds.","authors":["Liming Chen","Chris D. Nugent","Hui Wang"],"meta":["June 2012IEEE Transactions on Knowledge and Data Engineering 24(99):1 - 1","DOI:10.1109/TKDE.2011.51","SourceIEEE Xplore"],"references":["228528877_A_logical_framework_for_behaviour_reasoning_and_assistance_in_a_smart_home","225857625_Multi-Camera_Human_Activity_Monitoring","225732743_FaCT_Description_Logic_Reasoner_System_Description","285691138_Handbook_of_knowledge_representation","284053464_Activities_of_daily_living_and_instrumental_activities_of_daily_living","277390447_Smart_meeting_systems","262426233_A_tableaux_decision_procedure_for_SHOIQ","247835704_Experiences_in_the_development_of_a_Smart_Lab","242917471_A_tableau_decision_procedure_for_SHOIQ","239436670_Applying_Ontology_and_Probabilistic_Model_to_Human_Activity_Recognition_from_Surrounding_Things"]}