{"id":"224200285_A_study_on_distance_estimation_in_binaural_sound_localization","abstract":"The position of a sound source is an important information for robotic systems to be extracted from a sound. Of the three spherical coordinates (azimuth, elevation, distance) only the azimuth direction is extracted in most robot audition systems. So far rarely investigated is the issue of estimating the distance between robot and sound source. In this article we describe a study on distance estimation using a binaural robot system in an indoor environment for sounds ranging in distance from 0.5 to 6m. We investigated several proposed audio cues like interaural differences (IID and ITD), sound amplitude, and spectral characteristics. All cues are computed within the framework of audio proto objects. In an extensive experimental setup with more than 10000 sounds we found that both mean signal amplitude and binaural cues can, under certain circumstances, provide a very reliable distance estimation. There was no observable effect of frequency dependent attenuation so that the spectral amplitude cue was only slightly above chance level. We also investigated the loss of precision of azimuth estimation with distance. In contrast to what could be expected, the performance does not severely deteriorate when the system is calibrated for different distances.","authors":["Tobias Rodemann"],"meta":["November 2010Proceedings of the ... IEEE/RSJ International Conference on Intelligent Robots and Systems. IEEE/RSJ International Conference on Intelligent Robots and Systems","DOI:10.1109/IROS.2010.5651455","SourceIEEE Xplore","Conference: Intelligent Robots and Systems (IROS), 2010 IEEE/RSJ International Conference on"],"references":["243763434_The_Psychophysics_of_Human_Sound_Localization","228607898_Sound_source_localization_using_a_pinna-based_profile_fitting_method","224684984_Real-Time_Tracking_of_Multiple_Sound_Sources_by_Integration_of_In-Room_and_Robot-Embedded_Microphone_Arrays","224339564_Using_Binaural_and_Spectral_Cues_for_Azimuth_and_Elevation_Localization","224091105_Audio_Proto_Objects_for_Improved_Sound_Localization","221062893_Sound_Localization_for_Humanoid_Robots_-_Building_Audio-Motor_Maps_based_on_the_HRTF","200045092_Spatial_hearing_the_psychophysics_of_human_sound_localization","4196096_Sound_source_localisation_through_active_audition","222836264_Review_Estimating_the_distance_to_a_source_of_sound_Mechanisms_and_adaptations_for_long-range_communication","221066282_Multiple_Sound_Source_Mapping_for_a_Mobile_Robot_by_Self-motion_Triangulation","13499405_Accuracy_of_auditory_distance_and_azimuth_perception_by_a_passerine_bird_in_natural_habitat","11836315_Three-dimensional_sound_localization_from_a_compact_non-coplanar_array_of_microphones_using_tree-based_learning","2361587_An_Efficient_Implementation_of_the_Patterson-Holdsworth_Auditory_Filter_Bank"]}