{"id":"224203000_Salient_Feature_Region_A_New_Method_for_Retinal_Image_Registration","abstract":"Retinal image registration is crucial for the diagnoses and treatments of various eye diseases. A great number of methods have been developed to solve this problem; however, fast and accurate registration of low-quality retinal images is still a challenging problem since the low content contrast, large intensity variance as well as deterioration of unhealthy retina caused by various pathologies. This paper provides a new retinal image registration method based on salient feature region (SFR). We first propose a well-defined region saliency measure that consists of both local adaptive variance and gradient field entropy to extract the SFRs in each image. Next, an innovative local feature descriptor that combines gradient field distribution with corresponding geometric information is then computed to match the SFRs accurately. After that, normalized cross-correlation-based local rigid registration is performed on those matched SFRs to refine the accuracy of local alignment. Finally, the two images are registered by adopting high-order global transformation model with locally well-aligned region centers as control points. Experimental results show that our method is quite effective for retinal image registration.","authors":["Jian Zheng","Jie Tian","Kexin Deng","Xiaoqian Dai"],"meta":["April 2011IEEE transactions on information technology in biomedicine: a publication of the IEEE Engineering in Medicine and Biology Society 15(2):221 - 232","DOI:10.1109/TITB.2010.2091145","SourceIEEE Xplore"],"references":["228826193_Hybrid_image_registration_based_on_configural_matching_of_scale-invariant_salient_region_features","225761164_SURF_Speeded_up_robust_features","316240097_Distinctive_Image_Features_from_Scale-Invariant_Keypoints","313527089_Distinctive_image_features_from_scale-invariant_key_points","313522833_PCA-SIFT_A_more_distinctive_representation_for_local_image_descriptors","279433619_The_Statistics_of_Variation","275057952_SURF_Speeded_up_robust_features","239496671_Demo_software_SIFT_keypoint_detector","227992567_Elements_of_Information_Theory","224839945_On_Information_and_Sufficiency"]}