{"id":"224251590_Packet-Hiding_Methods_for_Preventing_Selective_Jamming_Attacks","abstract":"The open nature of the wireless medium leaves it vulnerable to intentional interference attacks, typically referred to as jamming. This intentional interference with wireless transmissions can be used as a launchpad for mounting Denial-of-Service attacks on wireless networks. Typically, jamming has been addressed under an external threat model. However, adversaries with internal knowledge of protocol specifications and network secrets can launch low-effort jamming attacks that are difficult to detect and counter. In this work, we address the problem of selective jamming attacks in wireless networks. In these attacks, the adversary is active only for a short period of time, selectively targeting messages of high importance. We illustrate the advantages of selective jamming in terms of network performance degradation and adversary effort by presenting two case studies; a selective attack on TCP and one on routing. We show that selective jamming attacks can be launched by performing real-time packet classification at the physical layer. To mitigate these attacks, we develop three schemes that prevent real-time packet classification by combining cryptographic primitives with physical-layer attributes. We analyze the security of our methods and evaluate their computational and communication overhead.","authors":["Alejandro Proano","Loukas Lazos"],"meta":["March 2012IEEE Transactions on Dependable and Secure Computing 9(1):101 - 114","DOI:10.1109/TDSC.2011.41","SourceIEEE Xplore"],"references":["288968691_Grade_expectations_and_student_evaluation_of_teaching","287914907_Exploring_factors_affecting_learner's_perception_of_learning_information_and_communication_technology_A_HLM_analysis_of_a_national_farmers'_training_program_in_Taiwan","249987256_Control_Channel_Jamming_Resilience_and_Identification_of_Traitors","313647153_Students'_evaluations_of_university_teaching_A_multidimensional_perspective","310670788_Ad-hoc_on-demand_distance_vector_AODV_routing","299090673_Re-Evaluating_Student_Evaluation_of_Teaching_The_Teaching_Evaluation_Form","298143440_All-or-nothing_encryption_and_the_package_transform","262371411_Intelligent_jamming_in_wireless_networks_with_applications_to_80211b_and_other_networks","250184357_The_Influence_of_Student_Course_and_Instructor_Characteristics_in_Evaluations_of_University_Teaching","248965963_The_Validity_of_Student_Evaluation_of_Teaching_in_Higher_Education_Love_me_love_my_lectures"]}