{"id":"224204127_Security_and_Privacy_in_Cloud_Computing_A_Survey","abstract":"Cloud Computing is becoming a well-known buzzword nowadays. Many companies, such as Amazon, Google, Microsoft and so on, accelerate their paces in developing Cloud Computing systems and enhancing their services to provide for a larger amount of users. However, security and privacy issues present a strong barrier for users to adapt into Cloud Computing systems. In this paper, we investigate several Cloud Computing system providers about their concerns on security and privacy issues. We find those concerns are not adequate and more should be added in terms of five aspects (i.e., availability, confidentiality, data integrity, control, audit) for security. Moreover, released acts on privacy are out of date to protect users' private information in the new environment (i.e., Cloud Computing system environment) since they are no longer applicable to the new relationship between users and providers, which contains three parties (i.e., Cloud service user, Cloud service provider/Cloud user, Cloud provider). Multi located data storage and services (i.e., applications) in the Cloud make privacy issues even worse. Hence, adapting released acts for new scenarios in the Cloud, it will result in more users to step into Cloud. We claim that the prosperity in Cloud Computing literature is to be coming after those security and privacy issues having be resolved.","authors":["Minqi Zhou","Rong Zhang","Wei Xie","Weining Qian"],"meta":["December 2010","DOI:10.1109/SKG.2010.19","SourceIEEE Xplore","Conference: Semantics Knowledge and Grid (SKG), 2010 Sixth International Conference on"],"references":["312917980_The_Google_file_system","312775005_MapReduce_Simplified_data_processing_on_large_clusters","297470471_USA_Patriot_Act","296480969_Data_Confidentiality_and_Privacy_in_Cloud_Computing","284954521_Electronic_Communications_Privacy_Act_of_1986","277295384_Above_the_Clouds_A_Berkeley_View_of_Cloud_Computing","254137353_Fair_Credit_Reporting_Act_Developments","229124758_The_Diverse_and_Exploding_Digital_Universe","225451636_Differential_Privacy","220910111_The_Google_File_System"]}