{"id":"224240011_DODT_Increasing_requirements_formalism_using_domain_ontologies_for_improved_embedded_systems_development","abstract":"In times of ever-growing system complexity and thus increasing possibilities for errors, high-quality requirements are crucial to prevent design errors in later project phases and to facilitate design verification and validation. To ensure and improve the consistency, completeness and correctness of requirements, formal languages have been introduced as an alternative to using natural language (NL) requirement descriptions. However, in many cases existing NL requirements must be taken into account. The formalization of those requirements by now is a primarily manual task, which therefore is both cumbersome and error-prone. We introduce the tool DODT that semi-automatically transforms NL requirements into semi-formal boilerplate requirements. The transformation builds upon a domain ontology (DO) containing knowledge of the problem domain and upon natural language processing techniques. The tool strongly reduced the required manual effort for the transformation. In addition the quality of the requirements was improved.","authors":["Stefan Farfeleder","Thomas Moser","Andreas Krall","Tor Stålhane"],"meta":["May 2011","DOI:10.1109/DDECS.2011.5783092","SourceIEEE Xplore","Conference: Design and Diagnostics of Electronic Circuits & Systems (DDECS), 2011 IEEE 14th International Symposium on"],"references":["264874836_Automated_Assistance_for_Use_Cases_Elicitation_from_User_Requirements_Text","225218413_Generating_Executable_Scenarios_from_Natural_Language","225109885_Ontology-Driven_Guidance_for_Requirements_Elicitation","222667228_Formal_Specification_Generation_from_Requirement_Documents","221403157_Automatic_Translation_of_Natural_Language_System_Specifications","239567615_Binary_Codes_Capable_of_Correcting_Deletions","235148641_Natural_Language_Processing","228620192_Capturing_informal_requirements_as_formal_models","224136281_Scenario_Elicitation_from_Natural_Language_Requirements","221101602_Default_reasoning_in_natural_language_processing"]}