{"id":"224249866_An_Approach_for_Unifying_Rule_Based_Deep_Packet_Inspection","abstract":"High performance Internet traffic inspection and layer-7 content analysis have become essential functions of high speed networks. Over the past decade several DPI systems have evolved targeting specific issues related to traffic management, user/application policing, intrusion detection/prevention, URL/malicious/unwanted content filtering. Snort, OpenDPI, Bro, L7-filter, ClamAV are a number of open-source tools based on custom DPI engines and custom rule-sets. The surging demand for higher bandwidth DPI systems capable of supporting larger rule-sets requires the use of hardware acceleration and hardware-based systems. In comparison to software based systems, the design and development of custom purpose hardware for DPI is expensive. The need for DPI solutions for a range of applications at high speed requires a unified processing platform. This paper presents the research in converting known DPI rule-sets into a meta format based on regular expressions, that can be executed by software and hardware-based processing platforms. To demonstrate this work a Snort2Regex translator has been developed to transform Snort rules into regular expressions using not only the content of the Snort rule but every relevant element that belongs to it and could increase the accuracy of the analysis.","authors":["A. Munoz","Sakir Sezer","D. Burns","Gareth Douglas"],"meta":["July 2011","DOI:10.1109/icc.2011.5963095","SourceIEEE Xplore","Conference: Communications (ICC), 2011 IEEE International Conference on"],"references":["245099749_A_system_for_detecting_network_intruders_in_real_time","221609187_Enhancing_byte_level_network_intrusion_detection_signatures_with_context","220900803_Snort_-_Lightweight_Intrusion_Detection_for_Networks","220900424_Fast_Packet_Classification_for_Snort_by_Native_Compilation_of_Rules","220065414_STATL_An_Attack_Language_for_State-based_Intrusion_Detection","3837636_The_STAT_tool_suite","3556315_USTAT_a_real-time_intrusion_detection_system_for_UNIX","2627853_NetSTAT_A_network-based_intrusion_detection_system","2586454_Translating_Snort_rules_to_STATL_scenarios","2247148_Ustat_A_Real-time_Intrusion_Detection_System_for_Unix"]}