{"id":"224299912_A_comparative_analysis_of_techniques_for_predicting_academic_performance","abstract":"This paper compares the accuracy of decision tree and Bayesian network algorithms for predicting the academic performance of undergraduate and postgraduate students at two very different academic institutes: Can Tho University (CTU), a large national university in Viet Nam; and the Asian Institute of Technology (AIT), a small international postgraduate institute in Thailand that draws students from 86 different countries. Although the diversity of these two student populations is very different, the data-mining tools were able to achieve similar levels of accuracy for predicting student performance: 73/71% for {fail, fair, good, very good} and 94/93% for {fail, pass} at the CTU/AIT respectively. These predictions are most useful for identifying and assisting failing students at CTU (64% accurate), and for selecting very good students for scholarships at the AIT (82% accurate). In this analysis, the decision tree was consistently 3-12% more accurate than the Bayesian network. The results of these case studies give insight into techniques for accurately predicting student performance, compare the accuracy of data mining algorithms, and demonstrate the maturity of open source tools.","authors":["Nguyen Thai-Nghe","Paul Janecek","Peter Haddawy"],"meta":["November 2007Proceedings - Frontiers in Education Conference","DOI:10.1109/FIE.2007.4417993","SourceIEEE Xplore","Conference: Frontiers In Education Conference - Global Engineering: Knowledge Without Borders, Opportunities Without Passports, 2007. FIE '07. 37th Annual"],"references":["221173912_A_Bayesian_Approach_to_Predict_Performance_of_a_Student_BAPPS_A_Case_with_Ethiopian_Students","4054565_Predicting_student_performance_an_application_of_data_mining_methods_with_an_educational_Web-based_system","286101364_Exploring_a_new_frontier_in_higher_education_research_A_case_study_analysis_of_using_data_mining_techniques_to_create_NSSE_institutional_typology","4105706_A_new_model_for_using_data_mining_technology_in_higher_educational_systems","3805199_A_Methodology_for_Evaluating_and_Selecting_Data_Mining_Software"]}