{"id":"224266341_Quantum_Query_Complexity_of_State_Conversion","abstract":"State conversion generalizes query complexity to the problem of converting between two input-dependent quantum states by making queries to the input. We characterize the complexity of this problem by introducing a natural information-theoretic norm that extends the Schur product operator norm. The complexity of converting between two systems of states is given by the distance between them, as measured by this norm. In the special case of function evaluation, the norm is closely related to the general adversary bound, a semi-definite program that lower-bounds the number of input queries needed by a quantum algorithm to evaluate a function. We thus obtain that the general adversary bound characterizes the quantum query complexity of any function whatsoever. This generalizes and simplifies the proof of the same result in the case of boolean input and output. Also in the case of function evaluation, we show that our norm satisfies a remarkable composition property, implying that the quantum query complexity of the composition of two functions is at most the product of the query complexities of the functions, up to a constant. Finally, our result implies that discrete and continuous-time query models are equivalent in the bounded-error setting, even for the general state-conversion problem.","authors":["Troy Lee","Rajat Mittal","Ben W. Reichardt","Robert Spalek"],"meta":["November 2011Foundations of Computer Science, 1975., 16th Annual Symposium on","DOI:10.1109/FOCS.2011.75","SourceIEEE Xplore","Conference: Foundations of Computer Science (FOCS), 2011 IEEE 52nd Annual Symposium on"],"references":["311611804_Span-program-based_quantum_algorithm_for_evaluating_formulas","288631653_Quantum_lower_bounds_for_the_collision_and_the_element_distinctness_problems","284678532_Essai_sur_la_geometrie_a_n_dimensions","267168963_Positive_Definite_Matrices","265920318_Lower_Bounds_in_Communication_Complexity","259263855_Relationship_between_orientation_of_CeO2_films_and_surface_morphology","250664766_Quantum_analogues_of_the_Bell_inequalities_The_case_of_two_spatially_separated_domains","241873479_Noise_in_quantum_and_classical_computation_non-locality","237623831_On_the_hitting_times_of_quantum_versus_random_walks_Fr_ed","227619887_Lower_Bounds_in_Communication_Complexity_Based_on_Factorization_Norms"]}