{"id":"224242457_Enhancing_e-learning_experience_with_online_social_networks","abstract":"The emergence of Web 2.0 has transformed the web into a more dynamic and interactive environment, offering a set of tools that enhance contact and collaboration between users. Several applications, such as online social networks, wikis and blogs, support such Web vision. This study elaborates on the tremendous potential of online social networks to enhance e-learning experience, creating an atmosphere of cooperation and easy interaction among users (teachers and students). A traditional learning content management system is rigid in nature, limiting the student learning process. As a result, the concepts of community, relationship and interaction among users are needed to overcome its limitations. This contribution addresses the evolution from the traditional content learning management systems to a new conceptual learning approach, using personal learning environments. Improving the learning experience using an e-learning platform is the main motivation for this work. Then, several online social networks-related modules were proposed for an e-learning platform, called personal learning environment box, creating a space for sharing and collaboration turning students more active in shaping their learning process. The proposal was evaluated through a utility survey to users, after four months term of system usage, and the results are extremely promising.","authors":["Joel Rodrigues","F.M.R. Sabino","L. Zhou"],"meta":["June 2011IET Communications 5(8):1147 - 1154","DOI:10.1049/iet-com.2010.0409","SourceIEEE Xplore"],"references":["277120522_From_classroom_teaching_to_e-learning_the_way_for_a_strong_definition","224930646_Web_20_in_Education_and_Potential_Factors_of_Web_20_Use_by_Students_of_Information_Systems","224374467_Toward_Social_Learning_Environments","224361267_Promoting_social_networks_among_Computer_Science_students","221574628_Next_generation_social_networks_-_Elicitation_of_user_requirements","4359722_Evaluating_usability_in_learning_management_system_Moodle","4339799_Educational_technology_for_collaborative_virtual_environments","4266107_Open_Dialog_as_a_Tool_for_University_Education","3426898_Understanding_Web_20","3419989_The_Future_of_Social_Networks_on_the_Internet_The_Need_for_Semantics","224399618_Web_20_And_Social_Learning_in_a_Digital_Economy","224318872_A_Blended_Learning_Approach_to_Course_Design_and_Implementation","224094477_The_Role_of_Online_Social_Networks_in_Students'_E-Learning_Experiences","221027796_An_Augmented_Social_Interactive_Learning_Approach_through_Web20"]}