{"id":"224236770_Mobile_Data_Offloading_through_Opportunistic_Communications_and_Social_Participation","abstract":"3G networks are currently overloaded, due to the increasing popularity of various applications for smartphones. Offloading mobile data traffic through opportunistic communications is a promising solution to partially solve this problem, because there is almost no monetary cost for it. We propose to exploit opportunistic communications to facilitate information dissemination in the emerging Mobile Social Networks (MoSoNets) and thus reduce the amount of mobile data traffic. As a case study, we investigate the target-set selection problem for information delivery. In particular, we study how to select the target set with only k users, such that we can minimize the mobile data traffic over cellular networks. We propose three algorithms, called Greedy, Heuristic, and Random, for this problem and evaluate their performance through an extensive trace-driven simulation study. Our simulation results verify the efficiency of these algorithms for both synthetic and real-world mobility traces. For example, the Heuristic algorithm can offload mobile data traffic by up to 73.66 percent for a real-world mobility trace. Moreover, to investigate the feasibility of opportunistic communications for mobile phones, we implement a proof-of-concept prototype, called Opp-off, on Nokia N900 smartphones, which utilizes their Bluetooth interface for device/service discovery and content transfer.","authors":["Bo Han","Pan Hui","Sritesh Kumar","Madhav Marathe"],"meta":["June 2012IEEE Transactions on Mobile Computing 11(5):821 - 834","DOI:10.1109/TMC.2011.101","SourceIEEE Xplore"],"references":["285789197_Network_Models_of_the_Diffusion_of_Innovations","243770630_Network_of_Models_of_Diffusion_of_Innovation","242914003_An_Analysis_of_Approximations_for_Maximizing_Submodular_Set_Functions-I","234796732_Spectral_efficiency_of_mobility-assisted_podcasting_in_cellular_networks","228338607_CoolSpots_Reducing_the_power_consumption_of_wireless_mobile_devices_with_multiple_radio_interfaces","226804694_Talk_of_the_Network_A_Complex_Systems_Look_at_the_Underlying_Process_of_Word-of-Mouth","313636700_Directed_diffusion_for_wireless_sensor_networking","270456401_Network_Models_of_the_Diffusion_of_Innovations","246106899_Eva_Tardos_Maximizing_the_spread_of_influence_through_a_social_network","225246148_An_analysis_of_approximations_for_maximizing_submodular_set_functions-II"]}