{"id":"224257097_Content_Server_System_Architecture_for_Providing_Differentiated_Levels_of_Service_in_a_Digital_Preservation_Cloud","abstract":"The growing use of digital records in organizations creates a challenge of preservation and archival of these records. The entities dealing with the care and keeping of digital records include governmental organizations at the local and national level that must retain evidence of policy and administration, history-oriented institutions that keep cultural heritage for posterity, financial, medical, legal and plethora of other organizations and businesses. Archiving and preserving digital records requires IT infrastructure and personnel to run the infrastructure. Recently, Cloud Computing has gained momentum in the IT world as one of the options for dealing with the challenges of electronic record management, thanks to the maturity of network protocol infrastructure, virtualization technology and a price-based Service Level Agreement structure. This paper discusses the characteristics and challenges of long term digital preservation that motivate the concept of a specialized Digital Preservation Cloud Service. In response to these challenges, a scalable and evolvable Content Server System Architecture is proposed here, which can constitute the core of a Digital Preservation Cloud. The proposed architecture with its SOA paradigm, layers, and open interfaces will be capable of servicing different levels of service requirements for long term archiving, preservation, search, and access.","authors":["Quyen L. Nguyen","Alla Lake"],"meta":["August 2011","DOI:10.1109/CLOUD.2011.73","SourceIEEE Xplore","Conference: Cloud Computing (CLOUD), 2011 IEEE International Conference on"],"references":["267305868_Evaluation_of_bit_preservation_strategies","241478336_Preservation_Is_Not_a_Place","221175770_Adding_Quality-Awareness_to_Evaluate_Migration_Web-Services_and_Remote_Emulation_for_Digital_Preservation","220831923_RACS_a_case_for_cloud_storage_diversity","220422375_A_View_of_Cloud_Computing","220348508_Systematic_Characterisation_of_Objects_in_Digital_Preservation_The_eXtensible_Characterisation_Languages","39997293_Towards_Smart_Storage_for_Repository_Preservation_Services","1771824_Market-Oriented_Cloud_Computing_Vision_Hype_and_Reality_for_Delivering_IT_Services_as_Computing_Utilities","243772086_Overview_of_Technological_Approaches_to_Digital_Preservation_and_Challenges_in_Coming_Years","230877245_How_Much_Information","228396500_Performance_Study_of_Digital_Object_Format_Identification_and_Validation_Tools","221399991_Cloud_Computing_A_Digital_Libraries_Perspective"]}