{"id":"224334043_Limited_feedback_schemes_for_downlink_OFDMA_based_on_sub-channel_groups","abstract":"In a downlink orthogonal frequency division multiple access (OFDMA) system, optimally allocating sub-channels across mobile users can require excessive feedback of channel state information (CSI). We consider an OFDMA model in which the feedback overhead is explicitly taken into account, given a fixed feedback rate and finite coherence time. The tradeoff between feedback rate and sum capacity is studied for two limited feedback schemes: a sequential scheme in which the users send compressed feedback bits over consecutive time slots, and a contention scheme in which users send their feedback via a random access protocol. For both schemes each feedback bit indicates a request for a group containing multiple subchannels. We show that the sum capacity for both schemes with optimized sub-channel groups grows linearly with the number of sub-channels N, and that the associated constant increases as the log of the normalized feedback rate measured in bits per coherence time per sub-channel. We also compare the asymptotic (large N) performance of the two limited feedback schemes as a function of the feedback rate and load (users per sub-channel). The sequential scheme performs best with moderate to large feedback rates, or small loads, whereas the contention scheme performs best with small feedback rates or large loads.","authors":["Jieying Chen","Randall A. Berry","M.L. Honig"],"meta":["November 2008IEEE Journal on Selected Areas in Communications 26(8):1451 - 1461","DOI:10.1109/JSAC.2008.081011","SourceIEEE Xplore"],"references":["228467302_Asymptotic_analysis_of_downlink_OFDMA_capacity","224747946_On_the_capacity_of_MIMO_broadcast_channel_with_partial_side_information","224679157_MIMO_Broadcast_Scheduling_with_Quantized_Channel_State_Information","224679100_Large_System_Performance_of_Downlink_OFDMA_with_Limited_Feedback","274891554_Elements_of_Information_Theory_Wiley_New-York","265668669_The_asymptotic_theory_of_extreme_order_statistics_2nd_ed","261662232_Elements_of_Information_Theory","227992567_Elements_of_Information_Theory","224773133_Elements_of_information_theory_2nd_ed","224761773_Multi-User_Scheduling_for_OFDM_Downlink_with_Limited_Feedback_for_Evolved_UTRA","224386901_Downlink_scheduling_and_resource_allocation_for_OFDMA_systems","224334044_Low_complexity_resource_allocation_with_opportunistic_feedback_over_downlink_OFDMA_networks","224320109_Multiuser_Limited_Feedback_for_Wireless_Multi-Antenna_Communication","224306306_Performance_of_Scalable_Feedback_Schemes_for_Downlink_OFDMA","221168706_Feedback_reduction_in_uplink_MIMO_OFDM_systems_by_chunk_optimization"]}