{"id":"224333311_Rehabilitation_with_Brain-Computer_Interface_Systems","abstract":"BCI systems let users convert thoughts into actions that do not involve voluntary muscle movement. The systems offer a new means of communication for those with paralysis or severe neuromuscular disorders. BCI technology is a relatively new, fast-growing field of research and applications with the potential to improve the quality of life in severely disabled people. To date, several BCI prototypes exist, but most work only in a laboratory environment. Before a BCI can be used for communication and control at home, research must solve several problems. An important next step is to establish protocols for easily setting up and using BCI systems in a practical environment. Many features, such as electrode positions and frequency components, must be automatically selectable for particular motor imagery. The system must use the fewest number of recording electrodes possible, striving for the optimal single EEG channel. Finally, training time must decrease, perhaps through game-like feedback and automatic detection of artifacts, such as uncontrolled muscle activity. With these improvements, which are on the horizon, we expect to see practical BCI systems for a wide range of users and applications.","authors":["Gert Pfurtscheller","Gernot R Müller-Putz","Reinhold Scherer","Christa Neuper"],"meta":["November 2008Computer 41(10):58 - 65","DOI:10.1109/MC.2008.432","SourceIEEE Xplore"],"references":["267792090_4_Human_Brain-Computer_Interface","237442476_Sensorimotor_EEG_patterns_during_motor_imagery_in_hemiparetic_stroke_patients","225815851_The_thought_translation_device_A_neurophysiological_approach_to_communication_in_total_motor_paralysis","220049194_Design_and_Implementation_of_a_Brain-Computer_Interface_With_High_Transfer_Rates","203918044_A_comparison_of_classification_techniques_for_the_P300_Speller","285833494_Event-related_EEG-MEG_synchronization_and_desynchronization_Basic_principles","220049293_Brain-Computer_Interface-a_new_communication_device_for_handicapped_persons","220049229_Automated_feature_selection_with_a_distinction_sensitive_learning_vector_quantizer","203918289_An_Asynchronously_Controlled_EEG-Based_Virtual_Keyboard_Improvement_of_the_Spelling_Rate","203918165_Toward_Noninvasive_Brain-Computer_Interfaces"]}