{"id":"224305466_A_Mobility_Adaptive_Hybrid_Protocol_for_Wireless_Sensor_Networks","abstract":"Wireless sensor networks (WSN) are becoming popular in a wide variety of monitoring applications. Though recent MAC protocol designs for sensor networks have focused on energy efficiency as the main criteria, mobility in a WSN presents interesting challenges and requires special algorithms. In this paper, we present a hybrid MAC protocol for mobile sensor networks, using schedule-based slots for static nodes and contention-based slots for mobile nodes. This protocol adapts to the level of mobility in the network by adjusting the ratio of static and mobile slots as well as the frame time. A mobility estimation algorithm based on the received signal strength of a message is used to determine the mobility level of a node. Simulation results show that in static sensor networks the performance of the proposed protocol is comparable to that of existing protocols, whereas in highly mobile scenarios it outperforms them in energy efficiency, packet delivery ratio, and latency.","authors":["Anjali Raja","Xiao Su"],"meta":["February 2008Conference Record - IAS Annual Meeting (IEEE Industry Applications Society)","DOI:10.1109/ccnc08.2007.159","SourceIEEE Xplore","Conference: Consumer Communications and Networking Conference, 2008. CCNC 2008. 5th IEEE"],"references":["228615873_Mobility_management_in_sensor_networks","221933092_An_energy-efficient_MAC_protocol_for_wireless_sensor_networks","221932962_MAC_protocols_for_wireless_sensor_networks_A_survey","220195181_Medium_access_control_issues_in_sensor_networks","4153416_MMAC_A_mobility-adaptive_collision-free_MAC_protocol_for_wireless_sensor_networks","4136670_AI-LMAC_an_adaptive_information-centric_and_lightweight_MAC_protocol_for_wireless_sensor_networks","4123406_An_adaptive_mobility-aware_MAC_protocol_for_sensor_networks_MS-MAC","2933600_Energy-Efficient_Collision-Free_Medium_Access_Control_for_Wireless_Sensor_Networks","277296469_A_Lightweight_Medium_Access_Protocol_LMAC_for_Wireless_Sensor_Networks","221091396_Ultra-Low_Duty_Cycle_MAC_with_Scheduled_Channel_Polling","4127930_Mobile_awareness_based_cluster_selection_mechanisms_in_wireless_ad_hoc_networks"]}