{"id":"224384174_Isolation_Forest","abstract":"Most existing model-based approaches to anomaly detection construct a profile of normal instances, then identify instances that do not conform to the normal profile as anomalies. This paper proposes a fundamentally different model-based method that explicitly isolates anomalies instead of profiles normal points. To our best knowledge, the concept of isolation has not been explored in current literature. The use of isolation enables the proposed method, iForest, to exploit sub-sampling to an extent that is not feasible in existing methods, creating an algorithm which has a linear time complexity with a low constant and a low memory requirement. Our empirical evaluation shows that iForest performs favourably to ORCA, a near-linear time complexity distance-based method, LOF and random forests in terms of AUC and processing time, and especially in large data sets. iForest also works well in high dimensional problems which have a large number of irrelevant attributes, and in situations where training set does not contain any anomalies.","authors":["Fei Tony Liu","Kai Ming Ting","Zhi-Hua Zhou"],"meta":["January 2009","DOI:10.1109/ICDM.2008.17","SourceIEEE Xplore","Conference: Data Mining, 2008. ICDM '08. Eighth IEEE International Conference on","Project: Isolation Forest"],"references":["228650239_Unsupervised_Learning_With_Random_Forest_Predictors","227275499_On-Line_Unsupervised_Outlier_Detection_Using_Finite_Mixtures_with_Discounting_Learning_Algorithms","221654100_On-line_unsupervised_outlier_detection_using_finite_mixtures_with_discounting_learning_algorithms","280292208_LOF","268497939_On_tests_for_outlying_observations","239666375_Identification_of_Outliers_in_Multivariate_Data","233923639_Art_of_Computer_Programming_Volume_3_Sorting_and_Searching_2nd_Edition","230595722_Data_Structures_and_Algorithms_with_Object-Oriented_Design_Patterns_in_Java","222563748_Discovering_Cluster_Based_Local_Outliers","221654388_Outlier_detection_by_sampling_with_accuracy_guarantees"]}