{"id":"224394976_Vehicle-to-Vehicle_Communication_Fair_Transmit_Power_Control_for_Safety-Critical_Information","abstract":"Direct radio-based vehicle-to-vehicle communication can help prevent accidents by providing accurate and up-to-date local status and hazard information to the driver. In this paper, we assume that two types of messages are used for traffic safety-related communication: 1) Periodic messages (ldquobeaconsrdquo) that are sent by all vehicles to inform their neighbors about their current status (i.e., position) and 2) event-driven messages that are sent whenever a hazard has been detected. In IEEE 802.11 distributed-coordination-function-based vehicular networks, interferences and packet collisions can lead to the failure of the reception of safety-critical information, in particular when the beaconing load leads to an almost-saturated channel, as it could easily happen in many critical vehicular traffic conditions. In this paper, we demonstrate the importance of transmit power control to avoid saturated channel conditions and ensure the best use of the channel for safety-related purposes. We propose a distributed transmit power control method based on a strict fairness criterion, i.e., distributed fair power adjustment for vehicular environments (D-FPAV), to control the load of periodic messages on the channel. The benefits are twofold: 1) The bandwidth is made available for higher priority data like dissemination of warnings, and 2) beacons from different vehicles are treated with ldquoequal rights,rdquo and therefore, the best possible reception under the available bandwidth constraints is ensured. We formally prove the fairness of the proposed approach. Then, we make use of the ns-2 simulator that was significantly enhanced by realistic highway mobility patterns, improved radio propagation, receiver models, and the IEEE 802.11p specifications to show the beneficial impact of D-FPAV for safety-related communications. We finally put forward a method, i.e., emergency message dissemination for vehicular environments (EMDV), for fast and effective multihop information di-\n-\nssemination of event-driven messages and show that EMDV benefits of the beaconing load control provided by D-FPAV with respect to both probability of reception and latency.","authors":["Marc Torrent-Moreno","Jens Mittag","Paolo Santi","Hannes Hartenstein"],"meta":["October 2009IEEE Transactions on Vehicular Technology 58(7):3684 - 3703","DOI:10.1109/TVT.2009.2017545","SourceIEEE Xplore"],"references":["267718980_Doubly_Selective_Vehicle-to-Vehicle_Channel_Measurements_and_Modeling_at_59_GHz","242390136_MobiCom_Poster_Abstract_Studying_Vehicle_Movements_on_Highways_and_their_Impact_on_Ad-Hoc_Connectivity","234815704_Studying_vehicle_movements_on_highways_and_their_impact_on_Ad_Hoc_connectivity","228779186_A_Comparative_Study_of_Data_Dissemination_Models_for_VANETs","247644403_Statistical_Methods_in_Radio_Wave_Propagation","243772734_Digital_Communication_Over_Fading_Channels_A_Unified_Approach_to_Performance_Analysis","242686038_Vehicle_Safety_Communications_Project_Task_3_Final_Report_Identify_Intelligent_Vehicle_Safety_Applications_Enabled_by_DSRC","240284676_The_Appli-cation-Based_Clustering_Concept_and_Requirements_for_Intervechicle_Networks","239060991_The_m-Distribution-A_General_Formula_of_Intensity_Distribution_of_Rapid_Fading","237319932_Memorandum_Opinion_and_Order"]}