{"id":"224377985_A_Computational_Approach_To_Edge_Detection","abstract":"This paper describes a computational approach to edge detection. The success of the approach depends on the definition of a comprehensive set of goals for the computation of edge points. These goals must be precise enough to delimit the desired behavior of the detector while making minimal assumptions about the form of the solution. We define detection and localization criteria for a class of edges, and present mathematical forms for these criteria as functionals on the operator impulse response. A third criterion is then added to ensure that the detector has only one response to a single edge. We use the criteria in numerical optimization to derive detectors for several common image features, including step edges. On specializing the analysis to step edges, we find that there is a natural uncertainty principle between detection and localization performance, which are the two main goals. With this principle we derive a single operator shape which is optimal at any scale. The optimal detector has a simple approximate implementation in which edges are marked at maxima in gradient magnitude of a Gaussian-smoothed image. We extend this simple detector using operators of several widths to cope with different signal-to-noise ratios in the image. We present a general method, called feature synthesis, for the fine-to-coarse integration of information from operators at different scales. Finally we show that step edge detector performance improves considerably as the operator point spread function is extended along the edge.","authors":["John Francis Canny"],"meta":["December 1986IEEE Transactions on Pattern Analysis and Machine Intelligence PAMI-8(6):679 - 698","DOI:10.1109/TPAMI.1986.4767851","SourceIEEE Xplore"],"references":["230675336_The_Measurement_of_Visual_Motion","230675323_Zero_Crossing_Of_Second_Directional_Derivative_Edge_Operator","224377941_On_Edge_Detection","302374300_Mathematical_Analysis_of_Random_Noise","285529497_SIMPLE_PARALLEL_HIERARCHICAL_AND_RELAXATION_ALGORITHMS_FOR_SEGMENTING_TEXTURED_IMAGES_BASED_ON_NONCAUSAL_MARKOVIAN_RANDOM_FIELD_MODELS","242070517_Detecting_half_edges_and_vertices_in_images","234251861_Finding_Edges_and_Lines_in_Images","233822959_The_Extrapolation_Interpolation_and_Smoothing_of_Stationary_Time_Series","224536000_A_Resonance_Effect_in_the_Synchrotron","223049809_Psychophysical_and_Computational_Studies_Towards_a_Theory_of_Human_Stereopsis"]}