{"id":"224504233_Energy_Aware_Network_Operations","abstract":"Networking devices today consume a non-trivial amount of energy and it has been shown that this energy consumption is largely independent of the load through the devices. With a strong need to curtail the rising operational costs of IT infrastructure, there is a tremendous opportunity for introducing energy awareness in the design and operation of enterprise and data center networks. We focus on these networks as they are under the control of a single administrative domain in which network-wide control can be consistently applied. In this paper, we describe and analyze three approaches to saving energy in single administrative domain networks, without significantly impacting the networks' ability to provide the expected levels of performance and availability. We also explore the tradeoffs between conserving energy and meeting performance and availability requirements. We conduct an extensive case study of our algorithms by simulating a real Web 2.0 workload in a real data center network topology using power characterizations that we obtain from real network hardware. Our results indicate that for our workload and data center scenario, 16% power savings (with no performance penalty and small decrease in availability) can be obtained merely by appropriately adjusting the active network elements (links). Significant additional savings (up to 75%) can be obtained by incorporating network traffic management and server workload consolidation.","authors":["Priya Mahadevan","Puneet Sharma","Sujata Banerjee","Parthasarathy Ranganathan"],"meta":["May 2009","DOI:10.1109/INFCOMW.2009.5072138","SourceIEEE Xplore","Conference: INFOCOM Workshops 2009, IEEE"],"references":["234809221_Managing_energy_and_server_resources_in_hosting_centers","221164120_Greening_of_the_Internet","220938977_No_power_struggles_Coordinated_multi-level_power_management_for_the_data_center","220831927_Energy-Aware_Server_Provisioning_and_Load_Dispatching_for_Connection-Intensive_Internet_Services","220771918_Power_Provisioning_for_a_Warehouse-Sized_Computer","220195289_The_Cost_of_a_Cloud_Research_Problems_in_Data_Center_Networks","3049659_Reducing_the_Energy_Consumption_of_Ethernet_with_Adaptive_Link_Rate_ALR","2962080_The_Case_for_Energy-Proportional_Computing","221245698_Using_Low-Power_Modes_for_Energy_Conservation_in_Ethernet_LANs","221198997_A_Power_Benchmarking_Framework_for_Network_Devices","220910226_Managing_Energy_and_Server_Resources_in_Hosting_Centres","220832034_Reducing_Network_Energy_Consumption_via_Sleeping_and_Rate-Adaptation","220831985_Skilled_in_the_Art_of_Being_Idle_Reducing_Energy_Waste_in_Networked_Systems","4334129_Power_Awareness_in_Network_Design_and_Routing","4099160_A_feasibility_study_for_power_management_in_LAN_switches"]}