{"id":"224561575_Design_of_a_parallel_AES_for_graphics_hardware_using_the_CUDA_framework","abstract":"Web servers often need to manage encrypted transfers of data. The encryption activity is computationally intensive, and exposes a significant degree of parallelism. At the same time, cheap multicore processors are readily available on graphics hardware, and toolchains for development of general purpose programs are being released by the vendors. In this paper, we propose an effective implementation of the AES-CTR symmetric cryptographic primitive using the CUDA framework. We provide quantitative data for different implementation choices and compare them with the common CPU-based OpenSSL implementation on a performance-cost basis. With respect to previous works, we focus on optimizing the implementation for practical application scenarios, and we provide a throughput improvement of over 14 times. We also provide insights on the programming knowledge required to efficiently exploit the hardware resources by exposing the different kinds of parallelism built in the AES-CTR cryptographic primitive.","authors":["Andrea Di Biagio","Alessandro Barenghi","Giovanni Agosta","Gerardo Pelosi"],"meta":["June 2009","DOI:10.1109/IPDPS.2009.5161242","SourceIEEE Xplore","Conference: Parallel & Distributed Processing, 2009. IPDPS 2009. IEEE International Symposium on"],"references":["313154513_Parallel_processing_with_CUDA","235720528_AES_the_Advanced_Encryption_Standard","235183820_Recommendation_for_Block_Cipher_Modes_of_Operation_Methods_and_Techniques","227633811_A_Survey_of_General-Purpose_Computation_on_Graphics_Hardware","224363317_CUDA_compatible_GPU_as_an_efficient_hardware_accelerator_for_AES_Cryptography","221498286_A_Concrete_Security_Treatment_of_Symmetric_Encryption","221352895_The_portrait_of_a_common_HTML_web_page","221291940_AES_Encryption_Implementation_and_Analysis_on_Commodity_Graphics_Processing_Units","221260436_Practical_Symmetric_Key_Cryptography_on_Modern_Graphics_Hardware","221208335_CryptoGraphics_Secret_Key_Cryptography_Using_Graphics_Cards"]}