{"id":"224567853_Detection_of_local_community_structures_in_complex_dynamic_networks_with_random_walks","abstract":"Identification of interaction patterns in complex networks via community structures has gathered a lot of attention in recent research studies. Local community structures provide a better measure to understand and visualise the nature of interaction when the global knowledge of networks is unknown. Recent research on local community structures, however, lacks the feature to adjust itself in the dynamic networks and heavily depends on the source vertex position. In this study the authors propose a novel approach to identify local communities based on iterative agglomeration and local optimisation. The proposed solution has two significant improvements: (i) in each iteration, agglomeration strengthens the local community measure by selecting the best possible set of vertices, and (ii) the proposed vertex and community rank criterion are suitable for the dynamic networks where the interactions among vertices may change over time. In order to evaluate the proposed algorithm, extensive experiments and benchmarking on computer generated networks as well as real-world social and biological networks have been conducted. The experiment results reflect that the proposed algorithm can identify local communities, irrespective of the source vertex position, with more than 92% accuracy in the synthetic as well as in the real-world networks.","authors":["Gautam Thakur","Ravi Tiwari","My T. Thai","Su-Shing Chen"],"meta":["August 2009IET Systems Biology 3(4):266 - 278","DOI:10.1049/iet-syb.2007.0061","SourceIEEE Xplore"],"references":["228667629_Visualization_of_Interaction_Patterns_in_Collaborative_Knowledge_Networks_for_Medical_Applications","220320167_Cluster_Ensembles_-_A_Knowledge_Reuse_Framework_for_Combining_Multiple_Partitions","312949552_Robust_data_clustering","259173905_Social_Network_Analysis","232771086_Uncovering_the_overlapping_community_structure_of_complex_networks_in_nature_and_society","228058016_The_Web_as_a_Graph_Measurements_Models_and_Methods","228057735_Computers_And_Intractability_A_Guide_to_the_Theory_of_NP-Completeness","227307781_Wheat_powdery_mildew_and_foliar_N_concentrations_as_influenced_by_N_fertilization_and_belowground_interactions_with_intercropped_faba_bean","221945992_Community_structure_in_social_and_biological_networks","220639605_Computing_Communities_in_Large_Networks_Using_Random_Walks"]}