{"id":"224597233_A_fast_parallel_matrix_multiplication_reconfigurable_unit_utilized_in_face_recognitions_systems","abstract":"In this paper we present a reconfigurable device which significantly improves the execution time of the most computational intensive functions of three of the most widely used face recognition algorithms; those tasks multiply very large dense matrices. The presented architecture utilizes numerous digital signal processing units (DSPs) organized in a parallel manner within a state-of-the-art FPGA device. In order to accelerate those functions we have implemented a ldquoblockedrdquo matrix multiplication algorithm which multiplies certain sub-matrices of fixed-point 32-bit numbers; the size of the sub-matrices has been selected so as to fully exploit the resources of the underlying reconfigurable device. Our system is up to 550 times faster than a conventional general purpose processor when implementing the most CPU intensive parts of a number of very widely used face identification schemes, whereas it is more than 40 times faster than the similar schemes implemented in reconfigurable devices. Moreover, our system is general enough so as to be efficiently utilized in any application incorporating fixed-point matrix multiplications.","authors":["Ioannis Sotiropoulos","Ioannis Papaefstathiou"],"meta":["October 2009","DOI:10.1109/FPL.2009.5272287","SourceIEEE Xplore","Conference: Field Programmable Logic and Applications, 2009. FPL 2009. International Conference on"],"references":["237252846_The_CSU_Face_Identification_Evaluation_System_User's_Guide_Version_50","221224905_64-bit_floating-point_FPGA_matrix_multiplication","2549096_Energy-Efficient_Matrix_Multiplication_on_FPGAs","225481878_Energy-Efficient_Matrix_Multiplication_on_FPGAs","223684091_A_matrix_product_accelerator_for_field_programmable_systems_on_chip","221173423_MPLEM_An_80-processor_FPGA_Based_Multiprocessor_System","4313899_Accelerating_Matrix_Multiplication_on_FPGAs","4253310_Hardware_Acceleration_of_Matrix_Multiplication_on_a_Xilinx_FPGA","4224607_Design_and_Implementation_of_a_High_Performance_Matrix_Multiplier_Core_for_Xilinx_Virtex_Fpgas","4060724_An_FPGA_based_coprocessor_for_large_matrix_product_implementation","3978508_An_FPGA_based_parameterizable_system_for_matrix_product_implementation","3338111_Area-Efficient_Arithmetic_Expression_Evaluation_Using_Deeply_Pipelined_Floating-Point_Cores"]}