{"id":"224570992_Perception_and_Intention_in_Relation_to_Engineering_A_Gendered_Study_Based_on_a_One-Day_Outreach","abstract":"This paper explores both how male and female high school pupils (15-16 years old) perceive the engineering profession and their willingness to pursue a career in this area. A study was performed around a one-day outreach activity, Girls' Day, organized for the first time in Spain. During Girls' Day, students were exposed to specific activities developed for them in engineering research labs and companies, carried out by young female researchers and professionals. The study, based on two questionnaires answered before and after the activity, focuses on the differences between groups of female and male students having differing degrees of interest in studying engineering. The educational level of mothers, the presence of engineers in families, and perceived family support emerged as important factors influencing the probability of a young person's considering pursuing engineering studies. Nevertheless, the need to expose children to outreach activities at a younger age and to involve the students' families and teachers has become clear. If planned properly and thoughtfully, even a single day's experience can contribute to changing the perception of what an engineer is.","authors":["Pilar Molina Gaudó","Sandra Baldassarri","Maria Villarroya-Gaudo","Eva Cerezo"],"meta":["March 2010IEEE Transactions on Education 53(1):61 - 70","DOI:10.1109/TE.2009.2023910","SourceIEEE Xplore"],"references":["250311913_Percepcion_de_la_ciencia_y_la_tecnologia_en_la_adolescencia_madrilena","3051016_Electricity_in_the_Palms_of_Her_Hands-The_Perception_of_Electrical_Engineering_by_Outstanding_Female_High_School_Pupils","273929338_Science_and_Engineering_Indicators-1989","249659831_The_Economics_of_Knowledge_Why_Education_is_Key_for_Europe's_Success","247118009_Girls_and_science_careers_The_role_of_altruistic_values_and_attitudes_about_scientific_tasks","229796900_Science_Enrichment_Programs_for_Gifted_High_School_Girls_and_Boys_Predictors_of_Program_Impact_on_Science_Confidence_and_Motivation","222387859_The_relationship_of_mathematics_self-efficacy_expectations_to_the_selection_of_science-based_college_majors","3050815_Identification_of_factors_that_lead_to_perceived_learning_improvements_for_female_students"]}