{"id":"224683961_The_Facial_Features_Extraction_for_Face_Recognition_Based_on_Geometrical_Approach","abstract":"Over the last two decades, several different techniques have been proposed for face recognition, which is one of the challenging areas of research in the field of image processing, pattern recognition and vision applications. Automatic human face identification system, e.g. security checks and crime investigation, etc. involves face recognition. The basic process consists of extraction of potential, facial features such as eyes, nose, mouth, eyebrows, etc. In the present paper, a geometrical face model proposed by Shi-Hong Jeng et al. for frontal face images is improved by the inclusion of ears and chin also as potential facial features, since it enhances the discrimination ability of the proposed face model during face recognition .The developed approach is divided into four main steps. The first step is pre processing, the goal of this step is to get rid of high intensity noises and to transform the input image into binary one. The second step includes a labeling process, which label the facial feature candidates by block by block. Then find the center, area and the orientation of each feature candidate. Third step is a geometrical model, used to measure relative distances and to locate the actual position of the entire facial features. Finally, the matching process. The modified face model has been experimented with test images and an enhanced success rate of 94% is achieved","authors":["Basavaraj Amarapur","Nagaraj Patil"],"meta":["June 2006","DOI:10.1109/CCECE.2006.277409","SourceIEEE Xplore","Conference: Electrical and Computer Engineering, 2006. CCECE '06. Canadian Conference on"],"references":["222466857_Facial_feature_detection_using_geometrical_face_model_An_efficient_approach","216722159_An_Analytic-to-Holistic_Approach_for_Face_Recognition_Based_on_a_Single_Frontal_View","3424007_Face_Detection_Using_Quantized_Skin_Color_Regions_Merging_and_Wavelet_Packet_Analysis","3193340_Detecting_Faces_in_Images_A_Survey","3192217_Face_Recognition_Features_Versus_Templates","222671573_Triangle-based_approach_to_the_detection_of_human_face","220599714_Automatic_human_face_detection_and_recognition_under_non-uniform_illumination"]}