{"id":"224635069_Programmable_central_pattern_generators_An_application_to_biped_locomotion_control","abstract":"We present a system of coupled nonlinear oscillators to be used as programmable central pattern generators, and apply it to control the locomotion of a humanoid robot. Central pattern generators are biological neural networks that can produce coordinated multidimensional rhythmic signals, under the control of simple input signals. They are found both in vertebrate and invertebrate animals for the control of locomotion. In this article, we present a novel system composed of coupled adaptive nonlinear oscillators that can learn arbitrary rhythmic signals in a supervised learning framework. Using adaptive rules implemented as differential equations, parameters such as intrinsic frequencies, amplitudes, and coupling weights are automatically adjusted to replicate a teaching signal. Once the teaching signal is removed, the trajectories remain embedded as the limit cycle of the dynamical system. An interesting aspect of this approach is that the learning is completely embedded into the dynamical system, and does not require external optimization algorithms. We use our system to encapsulate rhythmic trajectories for biped locomotion with a simulated humanoid robot, and demonstrate how it can be used to do online trajectory generation. The system can modulate the speed of locomotion, and even allow the reversal of direction (i.e. walking backwards). The integration of sensory feedback allows the online modulation of trajectories such as to increase the basin of stability of the gaits, and therefore the range of speeds that can be produced","authors":["Ludovic Righetti","A.J. Ijspeert"],"meta":["June 2006Proceedings - IEEE International Conference on Robotics and Automation 2006:1585 - 1590","DOI:10.1109/ROBOT.2006.1641933","SourceIEEE Xplore","Conference: Robotics and Automation, 2006. ICRA 2006. Proceedings 2006 IEEE International Conference on"],"references":["301232692_The_Kuramoto_model_A_simple_paradigm_for_synchronization_phenomena","243777920_Learning_from_Demonstration_and_Adaptation_of_Biped_Locomotion_with_Dynamical_Movement_Primitives","221702459_WebotsTM_Professional_Mobile_Robot_Simulation","46776356_The_Kuramoto_model_A_simple_paradigm_for_synchronization_phenomena","37423946_From_Dynamic_Hebbian_Learning_for_Oscillators_to_Adaptive_Central_Pattern_Generators","37423935_A_simple_adaptive_locomotion_toy-system","286149891_Dynamic_Hebbian_learning_in_adaptive_frequency_ocillators","245587815_Biped_Locomotion_Dynamics_Stability_Control_and_Application","222784843_Emergence_of_bipedal_locomotion_through_entrainment_among_the_neuro-musculo-skeletal_system_and_the_environment","222544282_Dynamic_Hebbian_learning_in_adaptive_frequency_oscillators"]}