{"id":"224616817_Improved_fast_encoding_method_for_vector_quantization_based_on_subvector_technique","abstract":"The encoding speed of vector quantization (VQ) is a time bottleneck to its practical applications due to it performing a lot of k-dimensional (kD) Euclidean distance computations. By using famous statistical features of the sum and the variance of a kD vector to estimate the Euclidean distance first, an IEENNS (improved equal-average equal-variance nearest neighbor search) method has been proposed to reject most of the unlikely codewords for a certain input vector. By dividing a kD vector in half to generate its two corresponding (k/2)D subvectors and then apply the IEENNS method again to each subvector, an SIEENNS (subvector-based IEENNS) method has been proposed as well. The SIEENNS method is, so far, the most search-efficient subvector-based encoding method for VQ, but it still has a large memory and computational redundancy. The paper aims at improving the state-of-the-art SIEENNS method by introducing a new 3-level data structure to reduce memory redundancy and by avoiding using the variances of two (k/2)D subvectors to reduce computational redundancy. Experimental results confirmed that the proposed method can reduce memory requirement for each kD vector from (k+6) to (k+1) and, at the same time, improve total search efficiency by 20-30% compared to the SIEENNS method.","authors":["Zhibin Pan","Koji Kotani","T. Ohmi"],"meta":["June 2005","DOI:10.1109/ISCAS.2005.1466089","SourceIEEE Xplore","Conference: Circuits and Systems, 2005. ISCAS 2005. IEEE International Symposium on"],"references":["4124769_An_improved_fast_encoding_method_for_vector_quantization_based_on_memory-efficient_data_structure","3358788_Fast_closest_codeword_search_algorithm_for_vector_quantization","3343080_A_Unified_Projection_Method_for_Fast_Search_of_Vector_Quantization","224054643_A_hierarchical_fast_encoding_algorithm_for_vector_quantization_with_PSNR_equivalent_to_full_search","223113087_Equal-average_hyperplane_partitioning_method_for_vector_quantization_of_image_data","5613841_An_efficient_encoding_algorithm_for_vector_quantization_based_on_subvector_technique","4028108_A_fast_full_search_equivalent_encoding_method_for_vector_quantization_by_using_appropriate_features","3342338_Fast_encoding_algorithm_for_vector_quantzation","3157143_Image_coding_using_vector_quantization_A_review"]}