{"id":"224677468_Radio_Channel_Quality_in_Industrial_Wireless_Sensor_Networks","abstract":"Wireless mesh sensor networks are being deployed today in various monitoring and control applications. Some radio network designs, such as ZigBee, presume that radio connectivity is reasonably consistent over time. Others take the opposite approach of presuming that links are entirely unreliable, and build large degrees of physical redundancy into the network in the hope that a collection of redundant but unreliable individual links will result in a reliable overall system. Surprisingly little work has been done in the middle ground, endeavoring to understand the root cause of link failure in real-world factory environments and applying this knowledge in the design of protocols that adoptively detect and use workable radio channels. In collaboration under a Department of Energy grant for the Industries of the Future, General Electric and Sensicast Systems have studied theoretical and actual performance of 2.4 GHz IEEE 802.15.4 radio transceivers on the lab bench and on the factory floor, with particular attention to jamming from 802.11 and multipath fading. Temporal and frequency variations in link quality are explored. The implications for network reliability and protocol design are discussed","authors":["Daniel Sexton","Michael Mahony","Michael Lapinski","Jay Werb"],"meta":["March 2005","DOI:10.1109/SICON.2005.257875","SourceIEEE Xplore","Conference: Sensors for Industry Conference, 2005"],"references":["220305304_Maximum-likelihood_based_estimation_of_the_Nakagami_m_parameter","243772734_Digital_Communication_Over_Fading_Channels_A_Unified_Approach_to_Performance_Analysis","224669349_Diversity_gain_of_transmit_diversity_in_wireless_systems_with_Rayleigh_fading","224268332_On_the_modeling_of_fading_multipath_indoor_radio_channels","220693664_Wireless_communications_principle_and_practice","31745978_Wireless_Communications_Principles_and_Practice_TS_Rappaport","4377881_Digital_Communication_over_Fading_Channels","3667140_Statistical_modeling_of_signal_amplitude_fading_of_indoor_radio_propagation_channels","3473721_Linear_Diversity_Combining_Techniques","3365853_On_arrival_of_paths_in_fading_multipath_indoor_radio_channels"]}