{"id":"224733267_The_Laplacian_Pyramid_as_a_Compact_Image_Code","abstract":"We describe a technique for image encoding in which local operators of many scales but identical shape serve as the basis functions. The representation differs from established techniques in that the code elements are localized in spatial frequency as well as in space. Pixel-to-pixel correlations are first removed by subtracting a lowpass filtered copy of the image from the image itself. The result is a net data compression since the difference, or error, image has low variance and entropy, and the low-pass filtered image may represented at reduced sample density. Further data compression is achieved by quantizing the difference image. These steps are then repeated to compress the low-pass image. Iteration of the process at appropriately expanded scales generates a pyramid data structure. The encoding process is equivalent to sampling the image with Laplacian operators of many scales. Thus, the code tends to enhance salient image features. A further advantage of the present code is that it is well suited for many image analysis tasks as well as for image compression. Fast algorithms are described for coding and decoding.","authors":["PJ BURT","EH ADELSON"],"meta":["May 1983IEEE Transactions on Communications 31(4):532 - 540","DOI:10.1109/TCOM.1983.1095851","SourceIEEE Xplore"],"references":["325579061_SIMPLE_PSYCHOPHYSICAL_MODEL_FOR_PREDICTING_THE_VISIBILITY_OF_DISPLAYED_INFORMATION","285284931_Reduced-alphabet_representation_of_video_signals","260827145_Image_transmission_techniques","247369075_Reduced-alphabet_representation_of_television_signals","238331101_Synthetic_Highs_--_An_Experimental_TV_Bandwidth_Reduction_System","235162723_Visibility_of_Displayed_Information","232345754_Fast_Filter_Transforms_for_Image_Processing","224337734_Multiple_bandpass_filters_in_image_processing","22426551_Complete_adaptation_to_patterned_stimuli_A_necessary_and_sufficient_condition_for_Weber's_law_for_contrast","2995845_Progressive_Transmission_of_Gray-Scale_and_Binary_Pictures_by_Simple_Efficient_and_Lossless_Encoding_Schemes","2995823_Picture_Coding_A_Review","2994749_Adaptive_quantization_of_picture_signals_using_spatial_masking"]}