{"id":"224805909_Springer_Handbook_of_Geographic_Information","abstract":"Computer science provides a powerful tool that was virtually unknown three generations ago. Computer science has changed the shape of many classical domains. Often domains have become more similar than before. On the other hand new applications have emerged that were technically not feasible without the support of a computer. Those developments lead to new high-level domains. One of them is Geographic Information.Some of the classical fields of knowledge are geodesy (surveying), cartography, and geography. Electronics have revolutionized geodetic methods. Cartography has faced the dominance of the computer that results in simplified cartographic products. All three fields make use of basic components such as the Internet and databases. Geodesy may be interpreted as the input-component, cartography may be interpreted as the output-component, and geography may be interpreted as one of many application of Geographic Information.Fast and mobile Internet access as well as a comprehensive standardization of the data exchange has opened the door to many new applications. Typical examples are spatial data infrastructures. They enable an overlay of data that reside on different computers but are geometrically referred to the same area. Spatial data infrastructures revolutionize the relations of citizens with administration and economy. Another booming field is location based services. This links mobile devices with spatial and temporal data. The most advanced concept is called \"Ubiquitous GIS\" which handles a great number of position-coded mobile objects such as containers within one system. The automatic administration of those objects has already gained importance within logistic enterprises.According to the above mentioned thoughts the handbook is organized into the parts, Basics and Applications. Many parts of the basics belong to the larger field of Computer Science. Possibly, those chapters could become a part of a book that is specialized in Computer Science. However, the reader should get a comprehensive view on Geographic Information in the planned handbook. Therefore, the topics selected from Computer Sciences have a close relation to Geographic Information. For a better thematic separation of the two the Basics are split into the sections Computer Science and Geoinformatics.","authors":["Wolfgang Kresse","David M Danko"],"meta":["January 2011","Publisher: Springer"],"references":[]}