{"id":"224839897_Very_high_resolution_interpolated_climate_surfaces_of_global_land_areas","abstract":"We developed interpolated climate surfaces for global land areas (excluding Antarctica) at a spatial resolution of 30 arc s (often referred to as 1-km spatial resolution). The climate elements considered were monthly precipitation and mean, minimum, and maximum temperature. Input data were gathered from a variety of sources and, where possible, were restricted to records from the 1950-2000 period. We used the thin-plate smoothing spline algorithm implemented in the ANUSPLIN package for interpolation, using latitude, longitude, and elevation as independent variables. We quantified uncertainty arising from the input data and the interpolation by mapping weather station density, elevation bias in the weather stations, and elevation variation within grid cells and through data partitioning and cross validation. Elevation bias tended to be negative (stations lower than expected) at high latitudes but positive in the tropics. Uncertainty is highest in mountainous and in poorly sampled areas. Data partitioning showed high uncertainty of the surfaces on isolated islands, e.g. in the Pacific. Aggregating the elevation and climate data to 10 arc min resolution showed an enormous variation within grid cells, illustrating the value of high-resolution surfaces. A comparison with an existing data set at 10 arc min resolution showed overall agreement, but with significant variation in some regions. A comparison with two high-resolution data sets for the United States also identified areas with large local differences, particularly in mountainous areas. Compared to previous global climatologies, ours has the following advantages: the data are at a higher spatial resolution (400 times greater or more); more weather station records were used; improved elevation data were used; and more information about spatial patterns of uncertainty in the data is available. Owing to the overall low density of available climate stations, our surfaces do not capture of all variation that may occur at a resolution of 1 km, particularly of precipitation in mountainous areas. In future work, such variation might be captured through knowledge-based methods and inclusion of additional co-variates, particularly layers obtained through remote sensing.","authors":["Robert Hijmans","Susan E. Cameron","Juan Luis Parra","Peter G. Jones"],"meta":["December 2005International Journal of Climatology 25:1965-1978","DOI:10.1002/joc.1276","Project: Climatology"],"references":["250220860_A_Knowledge-Based_Approach_to_the_Statistical_Mapping_of_Climate","240686114_A_Comparison_among_Strategies_for_Interpolating_Maximum_and_Minimum_Daily_Air_Temperatures_Part_II","228832001_Practical_use_of_SRTM_data_in_the_tropics_comparisons_with_digital_elevation_models_generated_from_cartographic_data","252600936_An_Overview_of_the_Global_Historical_Climatology_Network_Temperature_Database","252514512_Adaptive_optics_for_atmospheric_compensation","248349970_FloraMap_A_computer_tool_for_predicting_the_distribution_of_plants_and_other_organisms_in_the_Wild","241920597_Representing_Twentieth-Century_Space-Time_Climate_Variability_Part_I_Development_of_a_1961-90_Mean_Monthly_Terrestrial_Climatology","241602024_Topographic_Bias_in_Mesoscale_Precipitation_Networks","229863018_Global_Historical_Climatology_Network_GHCN_quality_control_of_monthly_temperature_data","229622492_Creation_of_Homogeneous_Composite_Climatological_Reference_Series"]}