{"id":"224872278_Percolation_Computation_in_Complex_Networks","abstract":"K-clique percolation is an overlapping community finding algorithm which\nextracts particular structures, comprised of overlapping cliques, from complex\nnetworks. While it is conceptually straightforward, and can be elegantly\nexpressed using clique graphs, certain aspects of k-clique percolation are\ncomputationally challenging in practice. In this paper we investigate aspects\nof empirical social networks, such as the large numbers of overlapping maximal\ncliques contained within them, that make clique percolation, and clique graph\nrepresentations, computationally expensive. We motivate a simple algorithm to\nconduct clique percolation, and investigate its performance compared to current\nbest-in-class algorithms. We present improvements to this algorithm, which\nallow us to perform k-clique percolation on much larger empirical datasets. Our\napproaches perform much better than existing algorithms on networks exhibiting\npervasively overlapping community structure, especially for higher values of k.\nHowever, clique percolation remains a hard computational problem; current\nalgorithms still scale worse than some other overlapping community finding\nalgorithms.","authors":["Fergal Reid","Aaron F. McDaid","Neil Hurley"],"meta":["April 2012","DOI:10.1109/ASONAM.2012.54","SourcearXiv"],"references":["228574411_Analyzing_clique_overlap","221273619_Detecting_Highly_Overlapping_Communities_with_Model-Based_Overlapping_Seed_Expansion","220284024_Partitioning_large_networks_without_breaking_communities","253572077_Community_Structure_in_Online_Collegiate_Social_Networks","234825908_Efficient_Algorithms_for_Graph_Manipulation","232771086_Uncovering_the_overlapping_community_structure_of_complex_networks_in_nature_and_society","222523851_Detect_overlapping_and_hierarchical_community_structure_in_networks","220423131_Finding_All_Cliques_of_an_Undirected_Graph","220420298_Efficient_Algorithms_for_Graph_Manipulation_H_Algorithm_447","220094028_Graph_Twiddling_in_a_MapReduce_World"]}