{"id":"224934010_The_influence_of_homocysteine_and_oxidative_stress_on_pregnancy_outcome","abstract":"Oxidative stress in utero–placental tissues plays an important role in the development of placental-related diseases. Maternal hiperhomocysteinemia is associated with placental mediated diseases, such as preeclampsia, spontaneous abortion and placental abruption. The aim of our study is to appreciate the clinical usefulness of the dosage serum homocysteine and malondialdehyde, as an oxidative stress marker, in the pregnancies complicated with risk of abortion or preterm birth.\nThe study was performed at the Obstetric Gynecology Clinical Hospital Oradea from December 2009 until April 2010. It included 18 patients with risk of abortion (group 1), 22 with preterm birth (group 2). The results were compared with a control group composed by 14 healthy pregnant women. Serum homocysteine level was measured by an enzymatic method, on the instrument Hitachi 912, Roche, reagent: Axis-Shield Enzymatic. For proving the oxidative stress we established the level of malondialdehyde using a method with thiobarbituric acid TBA (Kei Satoh 1978) and the level of ceruloplasmin with the Ravin method .Also AST, ALT,CRP, iron, uric acid, urea were assessed.\nHigh level of homocysteine in both groups of study in comparison with the control group was found. The concentration of MDA was significantly higher in pregnancies complicated with risk of abortion and preterm birth compared to the control group (p=0.040, p=0.031). Considerable differences of ceruloplasmin concentration between group 1 and group 2 (p=0.045), and between group 2 and control group (p=0.034), was noticed but not any important differences between group 1 and control group (p=0.683).\nIn women with risk of abortion or with preterm birth an oxidative stress and a hyperhomocysteinemia are present.","authors":["Otilia Micle","M. Mureşan","L Antal","F Bodog"],"meta":["February 2012Journal of Medicine and Life 5(1):68-73","SourcePubMed"],"references":["40033205_Methionine_metabolism_in_human_pregnancy","11522900_The_Hordaland_Homocysteine_Studies","290675358_Methionine_and_homocysteine_metabolism_and_the_nutritional_prevention_of_certain_birth_defects_and_complications_of_pregnancy","26729250_Chemical_Pathology_of_Homocysteine_IV_Excitotoxicity_Oxidative_Stress_Endothelial_Dysfunction_and_Inflammation","22422200_Serum_Lipid_Peroxide_in_cerebrovascular_disorders_determined_by_a_new_colorimetric_method","12846766_Folic_Acid_and_Homocysteine_Metabolic_Defects_and_the_Risk_of_Placental_Abruption_Pre-eclampsia_and_Spontaneous_Pregnancy_Loss_A_Systematic_Review","12687630_An_embryoprotective_role_for_glucose-6-phosphate_dehydrogenase_in_developmental_oxidative_stress_and_chemical_teratogenesis","12446534_Decreased_superoxide_dismutase_expression_and_increased_concentrations_of_lipid_peroxide_and_prostaglandin_F2a_in_the_decidua_of_failed_pregnancy","11619522_Recurrent_miscarriage_and_variant_alleles_of_mannose_binding_lectin_tumour_necrosis_factor_and_lymphotoxin_genes","10866037_Oxygen_early_embryonic_metabolism_and_free_radical-mediated_embryopathies"]}