{"id":"224952248_Machine_Learning_in_Automated_Text_Categorization","abstract":"The automated categorization (or classification) of texts into predefined categories has witnessed a booming interest in the last ten years, due to the increased availability of documents in digital form and the ensuing need to organize them. In the research community the dominant approach to this problem is based on machine learning techniques: a general inductive process automatically builds a classifier by learning, from a set of preclassified documents, the characteristics of the categories. The advantages of this approach over the knowledge engineering approach (consisting in the manual definition of a classifier by domain experts) are a very good effectiveness, considerable savings in terms of expert labor power, and straightforward portability to different domains. This survey discusses the main approaches to text categorization that fall within the machine learning paradigm. We will discuss in detail issues pertaining to three different problems, namely document representation, classifier construction, and classifier evaluation.","authors":["Fabrizio Sebastiani"],"meta":["April 2001ACM Computing Surveys 34:1-47","DOI:10.1145/505282.505283","SourceCiteSeer"],"references":["312608584_One-class_SVMs_for_document_classification","314828821_Unsupervised_document_classification_using_sequential_information_maximization","314828772_Text_genre_classification_with_genre-revealing_and_subject-revealing_features","314807958_Using_web_structure_for_classifying_and_describing_web_pages","314807908_Text_classification_in_a_hierarchical_mixture_model_for_small_training_sets","314801458_Using_LSI_for_text_classification_in_the_presence_of_background_text","313755920_Evaluating_and_optimizing_autonomous_text_classification_systems","312457496_Inductive_learning_algorithms_and_representations_for_text_categorization","301222420_Relevance_weighting_of_search_terms","298836450_Automatic_word_sense_discrimination"]}