{"id":"225006684_Degradation_of_Communication_Range_in_VANETs_Caused_by_Interference_20_-_Real-World_Experiment","abstract":"High channel load in vehicle-to-vehicle communication leads to a degradation of the vehicles’ communication range, due to interference and hence packet loss at larger distances. Packet loss results from two or more concurrent transmissions, colliding at receivers located inbetween, which is also known as the hidden station problem. In previous works, our simulation study has shown that this packet loss leads to a degradation of 90% of the communication range. In this paper, we confirm the simulation results by real-world measurements. We present a methodology for transferring the simulation scenario to a real-world measurement scenario, able to evaluate the problem of hidden stations.\nWith three radios applying the IEEE 802.11p standard, we measure the degradation of the communication range under interference. In the measurement, we find a degradation of 50 to 70%. On the one hand, there are less collisions due to only one hidden station. On the other hand, we identify that the receiving vehicle as a shadowing object itself is an additional origin for hiding the other station which slightly increases the number of collisions even at close distances.","authors":["Robert K. Schmidt","Bernhard Kloiber","Florian Schüttler","Thomas Strang"],"meta":["March 2011Lecture Notes in Computer Science","DOI:10.1007/978-3-642-19786-4_16","SourceDLR","Conference: Nets4Cars"],"references":["255662087_Analysis_of_Variation_in_IEEE80211k_Channel_Load_Measurements_for_Neighbouring_WLAN_Systems","228412138_Architecture_for_Decentralized_Mitigation_of_Local_Congestion_in_VANETs","225005844_An_Approach_for_Performance_Analysis_of_ETSI_ITS-G5A_MAC_for_Safety_Applications","221637376_Experimental_Analysis_of_Broadcast_Reliability_in_Dense_Vehicular_Networks","220109513_Degradation_of_Transmission_Range_in_VANETs_caused_by_Interference","221611971_Understanding_Congestion_in_IEEE_80211b_Wireless_Networks","4203161_Physical_layer_simulations_of_IEEE80211a_for_vehicle-to-vehicle_communications"]}