{"id":"225059812_Measuring_diversity_The_importance_of_species_similarity","abstract":"Realistic measures of biodiversity should reflect not only the relative abundances of species, but also the differences between them. We present a natural family of diversity measures taking both factors into account. This is not just another addition to the already long list of diversity indices. Instead, a single formula subsumes many of the most popular indices, including Shannon's, Simpson's, species richness, and Rao's quadratic entropy. These popular indices can then be used and understood in a unified way, and the relationships between them are made plain. The new measures are, moreover, effective numbers, so that percentage changes and ratio comparisons of diversity value are meaningful. We advocate the use of diversity profiles, which provide a faithful graphical representation of the shape of a community; they show how the perceived diversity changes as the emphasis shifts from rare to common species. Communities can usefully be compared by comparing their diversity profiles. We show by example that this is a far more subtle method than any relying on a single statistic. Some ecologists view diversity indices with suspicion, questioning whether they are biologically meaningful. By dropping the naive assumption that distinct species have nothing in common, working with effective numbers, and using diversity profiles, we arrive at a system of diversity measurement that should lay much of this suspicion to rest.","authors":["Tom Leinster","Christina A Cobbold"],"meta":["March 2012Ecology 93(3):477-89","DOI:10.2307/23143936","SourcePubMed"],"references":["281859162_Functional_diversity_FD_species_richness_and_community_composition","255613056_Species_diversity_in_vertical_horizontal_and_temporal_dimensions_of_a_fruit-feeding_butterfly_community_in_an_Ecuadorian_rainforest","255482754_An_Audience_Effect_for_Ecological_Terminology_Use_and_Misuse_of_Jargon","245587359_Biodiversity_of_a_continental_shelf_soft-sediment_macrobenthos_community","305656700_DNA_Polymorphism_Detectable_by_Restriction_Endonucleases","264799682_Diversity_as_a_Concept_and_Its_Measurement","259694870_A_core_gut_microbiom_in_obese_and_lean_twins","248823624_On_the_measurement_of_species_diversity_incorporating_species_differences","240380538_Use_of_Nucleic-Acid_Homologies_in_the_Taxonomy_of_Anaerobic_Bacteria","235789941_Sampling_Properties_of_a_Family_of_Diversity_Measures"]}