{"id":"225069732_Improper_Gaussian_Signaling_on_the_Two-User_SISO_Interference_Channel","abstract":"On a single-input-single-out (SISO) interference channel (IC), conventional\nnon-cooperative strategies encourage players selfishly maximizing their\ntransmit data rates, neglecting the deficit of performance caused by and to\nother players. In the case of proper complex Gaussian noise, the maximum\nentropy theorem shows that the best-response strategy is to transmit with\nproper signals (symmetric complex Gaussian symbols). However, such equilibrium\nleads to degrees-of-freedom zero due to the saturation of interference.\nWith improper signals (asymmetric complex Gaussian symbols), an extra freedom\nof optimization is available. In this paper, we study the impact of improper\nsignaling on the 2-user SISO IC. We explore the achievable rate region with\nnon-cooperative strategies by computing a Nash equilibrium of a non-cooperative\ngame with improper signaling. Then, assuming cooperation between players, we\nstudy the achievable rate region of improper signals. We propose the usage of\nimproper rank one signals for their simplicity and ease of implementation.\nDespite their simplicity, rank one signals achieve close to optimal sum rate\ncompared to full rank improper signals. We characterize the Pareto boundary,\nthe outer-boundary of the achievable rate region, of improper rank one signals\nwith a single real-valued parameter; we compute the closed-form solution of the\nPareto boundary with the non-zero-forcing strategies, the maximum sum rate\npoint and the max-min fairness solution with zero-forcing strategies. Analysis\non the extreme SNR regimes shows that proper signals maximize the wide-band\nslope of spectral efficiency whereas improper signals optimize the high-SNR\npower offset.","authors":["Zuleita Ho","Eduard Jorswieck"],"meta":["May 2012IEEE Transactions on Wireless Communications 11(9)","DOI:10.1109/TWC.2012.071612.111338","SourcearXiv"],"references":["250021449_On_Gaussian_Interference_Channels_with_mixed_interference","224904662_Improving_Achievable_Rate_for_the_Two-User_SISO_Interference_Channelwith_Improper_Gaussian_Signaling","224586609_Game_Theory_and_the_Flat-Fading_Gaussian_Interference_Channel","224382114_A_New_Outer_Bound_and_the_Noisy-Interference_Sum-Rate_Capacity_for_Gaussian_Interference_Channels","281663367_Statistical_Signal_Processing_of_Complex-Valued_Data-_The_Theory_of_Improper_and_Noncircular_Signals","224679229_Bargaining_Over_the_Interference_Channel","224621735_The_multiplexing_gain_of_wireless_networks","224505516_Gaussian_Fading_Interference_Channels_Power_Control","224349531_Gaussian_Interference_Channel_Capacity_to_Within_One_Bit","224260390_On_the_Capacity_of_the_K-User_Cyclic_Gaussian_Interference_Channel","224242559_Multiuser_MISO_Interference_Channels_With_Single-User_Detection_Optimality_of_Beamforming_and_the_Achievable_Rate_Region","224249211_Complex-Valued_Signal_Processing_The_Proper_Way_to_Deal_With_Impropriety","224211011_Interference_Alignment_with_Asymmetric_Complex_Signaling_and_Multiuser_Diversity","224180271_Coordinated_SINR_Balancing_Techniques_for_Multi-Cell_Downlink_Transmission","224157576_Coordination_and_Bargaining_over_the_Gaussian_Interference_Channel"]}