{"id":"225159884_Markov_Ciphers_and_Differential_Cryptanalysis","abstract":"This paper considers the security of iterated block ciphers against the differential cryptanalysis introduced by Biham and\nShamir. Differential cryptanalysis is a chosen-plaintext attack on secret-key block ciphers that are based on iterating a\ncryptographically weak function r times (e.g., the 16-round Data Encryption Standard (DES)). It is shown that the success\nof such attacks on an r-round cipher depends on the existence of (r-1)-round differentials that have high probabilities, where\nan i-round differential is defined as a couple (α, β) such that a pair of distinct plaintexts with difference α can result in a pair of i-th round outputs that have difference β, for an appropriate notion of “difference”. The probabilities of such differentials can be used to determine a lower bound\non the complexity of a differential cryptanalysis attack and to show when an r-round cipher is not vulnerable to such attacks.\nThe concept of “Markov ciphers” is introduced for iterated ciphers because of its significance in differential cryptanalysis.\nIf an iterated cipher is Markov and its round subkeys are independent, then the sequence of differences at each round output\nforms a Markov chain. It follows from a result of Biham and Shamir that DES is a Markov cipher. It is shown that, for the\nappropriate notion of “difference”, the Proposed Encryption Standard (PES) of Lai and Massey, which is an 8-round iterated\ncipher, is a Markov cipher, as are also the mini-version of PES with block length 8, 16 and 32 bits. It is shown that PES(8)\nand PES(16) are immune to differential cryptanalysis after sufficiently many rounds. A detailed cryptanalysis of the full-size\nPES is given and shows that the very plausibly most probable 7-round differential has a probability about 2−58. A differential cryptanalysis attack of PES(64) based on this differential is shown to require all 264 possible encryptions. This cryptanalysis of PES suggested a new design principle for Markov ciphers, viz., that their transition\nprobability matrices should not be symmetric. A minor modification of PES, consistent with all the original design principles,\nis proposed that satisfies this new design criterion. This modified cipher, called Improved PES (IPES), is described and shown\nto be highly resistant to differential cryptanalysis.","authors":["Xuejia Lai","James L. Massey","Sean Murphy"],"meta":["January 1995","DOI:10.1007/3-540-46416-6_2","Conference: Proceedings of the 10th annual international conference on Theory and application of cryptographic techniques"],"references":["226173374_Shamir_A_Differential_Cryptanalysis_of_DES-like_Cryptosystems_Journal_of_Cryptology_41_3-72","221355555_Differential_Cryptanalysis_of_DES-like_Cryptosystems"]}