{"id":"225184694_Extra-large_letter_spacing_improves_reading_in_dyslexia","abstract":"Although the causes of dyslexia are still debated, all researchers agree that the main challenge is to find ways that allow a child with dyslexia to read more words in less time, because reading more is undisputedly the most efficient intervention for dyslexia. Sophisticated training programs exist, but they typically target the component skills of reading, such as phonological awareness. After the component skills have improved, the main challenge remains (that is, reading deficits must be treated by reading more--a vicious circle for a dyslexic child). Here, we show that a simple manipulation of letter spacing substantially improved text reading performance on the fly (without any training) in a large, unselected sample of Italian and French dyslexic children. Extra-large letter spacing helps reading, because dyslexics are abnormally affected by crowding, a perceptual phenomenon with detrimental effects on letter recognition that is modulated by the spacing between letters. Extra-large letter spacing may help to break the vicious circle by rendering the reading material more easily accessible.","authors":["Marco Zorzi","Chiara Barbiero","Andrea Facoetti","Isabella Lonciari"],"meta":["June 2012Proceedings of the National Academy of Sciences 109(28):11455-9","DOI:10.1073/pnas.1205566109","SourcePubMed"],"references":["242403318_The_magnocellular_theory_of_dyslexia","237109087_What_reading_does_for_the_mind","235692323_French_normative_data_on_reading_and_related_skills_from_EVALEC_a_new_computerized_battery_of_testsend_Grade_1_Grade_2_Grade_3_and_Grade_4","313172770_Review_of_human_visual_development_Crowding_and_dyslexia","279569059_Training_dyslexics_with_acoustically_modified_speech_Evidence_of_improved_phonological_performance","236017807_Diagnostic_and_Statistical_Manual_of_Mental_Disorders_DSM-V","227613428_What_children_see_affects_how_they_read","223965341_A_Causal_Link_between_Visual_Spatial_Attention_and_Reading_Acquisition","200045247_An_interactive_activation_model_of_context_effects_in_letter_perception_I_An_account_of_basic_findings","50594493_Visual_crowding_A_fundamental_limit_on_conscious_perception_and_object_recognition"]}