{"id":"225109885_Ontology-Driven_Guidance_for_Requirements_Elicitation","abstract":"Requirements managers aim at keeping their sets of requirements well-defined, consistent and up to date throughout a project’s\nlife cycle. Semantic web technologies have found many valuable applications in the field of requirements engineering, with\nmost of them focusing on requirements analysis. However the usability of results originating from such requirements analyses\nstrongly depends on the quality of the original requirements, which often are defined using natural language expressions without\nmeaningful structures. In this work we present the prototypic implementation of a semantic guidance system used to assist\nrequirements engineers with capturing requirements using a semi-formal representation. The semantic guidance system uses concepts,\nrelations and axioms of a domain ontology to provide a list of suggestions the requirements engineer can build on to define\nrequirements. The semantic guidance system is evaluated based on a domain ontology and a set of requirements from the aerospace\ndomain. The evaluation results show that the semantic guidance system effectively supports requirements engineers in defining\nwell-structured requirements.\n\nKeywordsrequirements elicitation–domain ontology–elicitation guidance–requirements engineering","authors":["Stefan Farfeleder","Thomas Moser","Andreas Krall","Tor Stålhane"],"meta":["June 2011","DOI:10.1007/978-3-642-21064-8_15","SourceDBLP","Conference: Proceedings of the 8th extended semantic web conference on The semanic web: research and applications - Volume Part II"],"references":["285682403_REAS_An_Interactive_Semi-Automated_System_for_Software_Requirements_Elicitation_Assistance","319394669_An_Analysis_of_the_requirements_Traceability_Problem","255678551_The_missing_link_in_requirements_engineering","243784891_Requirements-Engineering_und-Management","240217533_Requirements_Engineering-Processes_and_Techniques_John_Wiley","238698099_Requirements_Engineering_J_Wiley_Sons_1998","238105911_OWL_2_Web_Ontology_Language_Direct_Semantics","228090869_Requirements_Engineering_2nd_Edition","226550444_A_Supporting_Tool_for_Requirements_Elicitation_Using_a_Domain_Ontology","224155019_Automatic_transformation_of_organization_of_software_requirements_specifications"]}