{"id":"225177725_Analysing_anaphoric_ambiguity_in_natural_language_requirements","abstract":"Many requirements documents are written in natural language (NL). However, with the flexibility of NL comes the risk of introducing\nunwanted ambiguities in the requirements and misunderstandings between stakeholders. In this paper, we describe an automated\napproach to identify potentially nocuous ambiguity, which occurs when text is interpreted differently by different readers.\nWe concentrate on anaphoric ambiguity, which occurs when readers may disagree on how pronouns should be interpreted. We describe\na number of heuristics, each of which captures information that may lead a reader to favor a particular interpretation of\nthe text. We use these heuristics to build a classifier, which in turn predicts the degree to which particular interpretations\nare preferred. We collected multiple human judgements on the interpretation of requirements exhibiting anaphoric ambiguity\nand showed how the distribution of these judgements can be used to assess whether a particular instance of ambiguity is nocuous.\nGiven a requirements document written in natural language, our approach can identify sentences that contain anaphoric ambiguity,\nand use the classifier to alert the requirements writer of text that runs the risk of misinterpretation. We report on a series\nof experiments that we conducted to evaluate the performance of the automated system we developed to support our approach.\nThe results show that the system achieves high recall with a consistent improvement on baseline precision subject to some\nambiguity tolerance levels, allowing us to explore and highlight realistic and potentially problematic ambiguities in actual\nrequirements documents.\n\nKeywordsNocuous ambiguity–Natural language requirements–Anaphoric ambiguity–Noun-phrase coreference resolution–Antecedent preference heuristics–Human judgements–Machine learning","authors":["Hui Yang","Anne N. De Roeck","Vincenzo Gervasi","Alistair Willis"],"meta":["September 2011Requirements Engineering 16(3):163-189","DOI:10.1007/s00766-011-0119-y","SourceDBLP"],"references":["269699729_Requirements_for_tools_for_ambiguity_identification_and_measurement_in_natural_language_requirements_specifications","260537281_Ambiguity_Measures_in_Requirements_Engineering","319395317_Centering_in_Discourse","318440318_A_Methodology_for_Automatic_Identification_of_Nocuous_Ambiguity","317577513_Automatic_Detection_of_Nocuous_Ambiguities_in_Natural_Language_Requirements","313597943_Supervised_noun_phrase_coreference_research_The_first_fifteen_years","274651583_Expertise_and_Decision_Support","246147095_Exploring_Requirements_Quality_Before_Design_Dorset_House","245588543_Book_Requirements_Engineering_Processes_and_Techniques","241014725_DESCRIPTION_OF_THE_LOLITA_SYSTEM_AS_USED_IN_MUC6"]}