{"id":"225273545_L-Py_An_L-System_Simulation_Framework_for_Modeling_Plant_Architecture_Development_Based_on_a_Dynamic_Language","abstract":"The study of plant development requires increasingly powerful modeling tools to help understand and simulate the growth and functioning of plants. In the last decade, the formalism of L-systems has emerged as a major paradigm for modeling plant development. Previous implementations of this formalism were made based on static languages, i.e., languages that require explicit definition of variable types before using them. These languages are often efficient but involve quite a lot of syntactic overhead, thus restricting the flexibility of use for modelers. In this work, we present an adaptation of L-systems to the Python language, a popular and powerful open-license dynamic language. We show that the use of dynamic language properties makes it possible to enhance the development of plant growth models: (i) by keeping a simple syntax while allowing for high-level programming constructs, (ii) by making code execution easy and avoiding compilation overhead, (iii) by allowing a high-level of model reusability and the building of complex modular models, and (iv) by providing powerful solutions to integrate MTG data-structures (that are a common way to represent plants at several scales) into L-systems and thus enabling to use a wide spectrum of computer tools based on MTGs developed for plant architecture. We then illustrate the use of L-Py in real applications to build complex models or to teach plant modeling in the classroom.","authors":["Frédéric Boudon","Christophe Pradal","Thomas Cokelaer","Przemyslaw Prusinkiewicz"],"meta":["May 2012Frontiers in Plant Science 3:76","DOI:10.3389/fpls.2012.00076","SourcePubMed","Project: OpenAlea"],"references":["262995826_OpenAlea_A_visual_programming_and_component_base_software_platform_for_plant_modeling","248888037_Building_a_topological_and_geometrical_model_of_poplar_tree_using_portable_on-ground_scanning_LIDAR","292380539_Preface_to_the_collection_of_papers_on_functional-structural_tree_models","281471933_Plant_architecture_modelling_Virtual_plants_and_complex_systems","279235721_Mathematical_Models_for_Cellular_Interactions_in_Development_Parts_I_and_II","278629615_AMAPmod_v18_Introduction_and_reference_manual","262361224_The_concept_and_design_of_a_virtual_laboratory","255643192_A_Method_for_Describing_Plant_Architecture_which_Integrates_Topology_and_Geometry","250869247_Art_and_Science_for_Life_Designing_and_Growing_Virtual_Plants_with_L-systems","250851989_The_LC_Plant-Modelling_Language"]}