{"id":"225276441_Using_Multivariate_Machine_Learning_Methods_and_Structural_MRI_to_Classify_Childhood_Onset_Schizophrenia_and_Healthy_Controls","abstract":"Introduction: \nMultivariate machine learning methods can be used to classify groups of schizophrenia patients and controls using structural magnetic resonance imaging (MRI). However, machine learning methods to date have not been extended beyond classification and contemporaneously applied in a meaningful way to clinical measures. We hypothesized that brain measures would classify groups, and that increased likelihood of being classified as a patient using regional brain measures would be positively related to illness severity, developmental delays, and genetic risk.\n\nMethods: \nUsing 74 anatomic brain MRI sub regions and Random Forest (RF), a machine learning method, we classified 98 childhood onset schizophrenia (COS) patients and 99 age, sex, and ethnicity-matched healthy controls. We also used RF to estimate the probability of being classified as a schizophrenia patient based on MRI measures. We then explored relationships between brain-based probability of illness and symptoms, premorbid development, and presence of copy number variation (CNV) associated with schizophrenia.\n\nResults: \nBrain regions jointly classified COS and control groups with 73.7% accuracy. Greater brain-based probability of illness was associated with worse functioning (p = 0.0004) and fewer developmental delays (p = 0.02). Presence of CNV was associated with lower probability of being classified as schizophrenia (p = 0.001). The regions that were most important in classifying groups included left temporal lobes, bilateral dorsolateral prefrontal regions, and left medial parietal lobes.\n\nConclusion: \nSchizophrenia and control groups can be well classified using RF and anatomic brain measures, and brain-based probability of illness has a positive relationship with illness severity and a negative relationship with developmental delays/problems and CNV-based risk.","authors":["Deanna (Dede) Greenstein","James D. Malley","Brian Weisinger","Liv Clasen"],"meta":["June 2012Frontiers in Psychiatry 3:53","DOI:10.3389/fpsyt.2012.00053","SourcePubMed"],"references":["295678672_NEUROIMAGING_OF_SCHIZOPHRENIA_FROM_MAPS_TO_MECHANISMS","237804619_Brain_volume_in_first-episode_schizophrenia_Brain_volume_in_first-episode_schizophrenia","228451484_Classification_and_Regression_by_RandomForest","275342330_Random_Forests","272002330_A_hybrid_approach_to_the_skull_stripping_problem_in_MRI","270663502_Random_Forests","265500895_Statistical_Learning_for_Biomedical_Data","247445599_Scaled_for_the_Assessment_of_Positive_Symptoms_SANS","242174349_Diagnostic_and_Statistical_Manual_of_Mental_Disorders_DSM-V","232495554_Modified_Scale_for_the_Assessment_of_Negative_Symptoms_SANS"]}