{"id":"225289298_Clarifying_differences_between_review_designs_and_methods","abstract":"This paper argues that the current proliferation of types of systematic reviews creates challenges for the terminology for describing such reviews. Terminology is necessary for planning, describing, appraising, and using reviews, building infrastructure to enable the conduct and use of reviews, and for further developing review methodology. There is not sufficient consensus on terminology for a typology of reviews to be produced and any such attempt is likely to be limited by the overlapping nature of the dimensions on which reviews vary. It is therefore proposed that the most useful strategy for the field is to develop terminology for the main dimensions of variation. Three such main areas are proposed of: (1) aims and approaches (including what the review is aiming to achieve, the theoretical and ideological assumptions, and the use of theory and aggregation and configuration); (2) structure and components (including the number and type of mapping and synthesis components and how they relate); and (3) breadth and depth and the extent of 'work done' in addressing a research issue (including the breadth of review questions, the detail with which they are addressed, and the amount the review progresses a research agenda). This then provides an overarching strategy to encompass more detailed descriptions of methodology and may lead in time to a more overarching system of terminology for systematic reviews.","authors":["David Gough","James Thomas","Sandy Oliver"],"meta":["June 2012Systematic Reviews 1(1):28","DOI:10.1186/2046-4053-1-28","SourcePubMed"],"references":["303621523_A_conceptual_framework_for_implementation_fidelity","288428253_Best_Practice_in_Systematic_Reviews_The_Importance_of_Protocols_and_Registration","324424938_The_Handbook_of_Research_Synthesis","324367712_Meta-Analysis_for_Explanation_A_Casebook","320194847_Transparency_in_planning_warranting_and_interpreting_research","319552213_Explaining_heterogeneity_in_meta-analysis_a_comparison_of_methods","314309724_The_Handbook_of_Research_Synthesis","310912506_Commonality_and_diversity_in_reviews","307890641_Altman_DG_PRISMA_Group_Preferred_reporting_items_for_systematic_reviews_and_meta-analyses_the_PRISMA_statement","292779771_'An_introduction_to_Systematic_Reviews'"]}