{"id":"225391357_Experimental_and_numerical_investigations_of_the_flow_around_an_oar_blade","abstract":"This article aims at verifying the capabilities of a Reynolds-Averaged Navier-Stokes Equations (RANSE) solver (ISIS-CFD, developed\nat the Fluid Mechanics Laboratory of Ecole Centrale de Nantes [LMF]) to accurately compute the flow around an oar blade and\nto deduce the forces on it and other quantities such as efficiency. This solver is structurally capable of computing the flow\naround any blade shape for any movement in six degrees of freedom, both when the blade pierces the free surface of the water\nand when it does not. To attempt a first validation, a computation was performed for a simplified case chosen among those\nfor which experimental results are available at LMF. If results prove satisfactory for a simplified blade shape and for a\nmovement that respects the main characteristics of blade kinematics, then the solver could be used for real oars and more\nrealistic kinematics. First, the experimental setup is considered, and the objectives, methodologies, and procedures are elucidated.\nThe choice of the test case for numerical validation is explained, i.e., a plane rectangular blade with a constant immersion\nand a specified movement deduced from analogy with tests on propellers. Next, the numerical framework is presented and the\nNavier-Stokes solver and methods for handling multifluid flows and moving bodies are described. Lastly, numerical results\nare compared with experimental data, highlighting an encouraging agreement and proving the relevance and the complementarity\nof both approaches.","authors":["Alban Leroyer","Sophie Barré","Jean-Michel Kobus","Michel Visonneau"],"meta":["February 2008Journal of Marine Science and Technology 13(1):1-15","DOI:10.1007/s00773-007-0256-7"],"references":["236888804_A_One-Equation_Turbulence_Model_for_Aerodynamic_Flows","230606275_Interface_Tracking_Capabilities_of_the_Inter-Gamma_Differencing_Scheme","225601571_On_the_role_played_by_turbulence_closures_in_hull_shape_optimization_at_model_and_full_scale","351245405_FluidMotion_interaction_for_solid_and_flexible_bodies_by_resolution_of_the_Navier-Stokes_equations_Contribution_to_the_numerical_modelisation_of_cavitating_flows","303155181_A_One-Equation_Turbulence_Model_for_Aerodynamic_Flows","269441203_Unsteady_Viscous_Flow_Simulation_around_the_Blade_of_Rowing_Boat","258996718_Bounded_convection_schemes_for_unstructured_grids","229573034_Curvature-compensated_convective_transport_SMART_A_new_boundedness-_preserving_transport_algorithm","228373609_Numerical_methods_for_RANSE_simulations_of_a_self-propelled_fish-like_body","227846949_Computation_of_free-surface_flows_with_local_mesh_adaptation"]}