{"id":"225474256_Detecting_Misspelled_Words_in_Turkish_Text_Using_Syllable_n-gram_Frequencies","abstract":"In this study, we have designed and implemented a system which decides whether or not a word is misspelled in Turkish text.\nFirstly, three databases of syllable monogram, bigram and trigram frequencies are constructed using the syllables that are\nderived from five different Turkish corpora. Then, the system takes words in Turkish text as an input and computes the probability\ndistribution of words using syllable monogram, bigram and trigram frequencies from the databases. If the probability distribution\nof a word is zero, it is decided that this word is misspelled. For testing the system, we have constructed two text databases\nwith the same words. One text database has 685 misspelled words. The other has 685 correctly spelled words. The words from\nthese text databases are taken as inputs for the system. The system produces two results for each word: “Correctly spelled\nword” or “Misspelled word”. The system that is designed with monogram and bigram frequencies has 86% success rate for the\nmisspelled words and has 88% success rate for the correctly spelled words. According to the system designed with bigram and\ntrigram frequencies, there is 97% success rate for the misspelled words and there is 98% success rate for the correctly spelled\nwords.","authors":["Rıfat Aşlıyan","Korhan Günel","Tatyana Yakhno"],"meta":["October 2007","DOI:10.1007/978-3-540-77046-6_68","Conference: Proceedings of the 2nd international conference on Pattern recognition and machine intelligence"],"references":["249876908_CloniZER_Spell_Checker_Adaptive_Language_Independent_Spell_Checker","228981143_Design_and_Implementation_for_Extracting_Turkish_Syllables_and_Analyzing_Turkish_Syllables","280113549_Speech_and_Language_Processing","228619951_Correcting_spelling_errors_by_modelling_their_causes","228603068_A_statistical_approach_to_automatic_OCR_error_correction_in_context","220566331_Techniques_for_Automatically_Correcting_Words_in_Text","4127159_A_Chinese_OCR_spelling_check_approach_based_on_statistical_language_models","2916962_Automatic_Segmentation_of_Words_using_Syllable_Bigram_Statistics"]}