{"id":"225453208_Optimal_Search_and_One-Way_Trading_Online_Algorithms","abstract":"This paper is concerned with the time series search and one-way trading problems. In the (time series) search problem a player is searching for the maximum (or minimum) price in a sequence that unfolds sequentially, one price at a time. Once during this game the player can decide to accept the current price p in which case the game ends and the player's payoff is p . In the one-way trading problem a trader is given the task of trading dollars to yen. Each day, a new exchange rate is announced and the trader must decide how many dollars to convert to yen according to the current rate. The game ends when the trader trades his entire dollar wealth to yen and his payoff is the number of yen acquired.\nThe search and one-way trading are intimately related. Any (deterministic or randomized) one-way trading algorithm can be viewed as a randomized search algorithm. Using the competitive ratio as a performance measure we determine the optimal competitive performance for several variants of these problems. In particular, we show that a simple threat-based strategy is optimal and we determine its competitive ratio which yields, for realistic values of the problem parameters, surprisingly low competitive ratios.\nWe also consider and analyze a one-way trading game played against an adversary called Nature where the online player knows the probability distribution of the maximum exchange rate and that distribution has been chosen by Nature. Finally, we consider some applications for a special case of portfolio selection called two-way trading in which the trader may trade back and forth between cash and one asset.","authors":["Ran El-Yaniv","Amos Fiat","R. M. Karp","G. Turpin"],"meta":["May 2001Algorithmica 30(1):101-139","DOI:10.1007/s00453-001-0003-0","SourceDBLP"],"references":["324632409_Applied_Dynamic_Programming","316518850_A_statistical_adversary_for_on-line_algorithms","313769924_The_statistical_adversary_allows_optimal_money-making_trading_strategies","313119384_A_statistical_adversary_for_on-line_algorithms","283691397_Competitive_snoopy_paging","265461598_Great_Expectations_The_Theory_of_Optimal_Stopping","263047996_Applied_Dynamic_Programming","262273077_The_Cost_of_Achieving_the_Best_Portfolio_in_Hindsight","245588048_Bounds_for_Certain_Multiprocessor_Timing_Anomalies","240457282_The_secretary_problem_and_its_extensions","234784007_Amortized_efficiency_of_list_update_paging_rules","239547539_The_cost_of_achieving_the_best_portfolio_in_hindsight","238472471_Chapter_6_The_economics_of_uncertainty_Selected_topics_and_probabilistic_methods","237107187_Near-Optimal_Bin_Packing_Algorithms","235087503_Mixed_and_behavior_strategies_in_infinite_extensive_games"]}