{"id":"225439155_The_aggregate_complexity_of_decisions_in_the_game_of_Go","abstract":"Artificial intelligence (AI) research is fast approaching, or perhaps has already reached, a bottleneck whereby further advancement\ntowards practical human-like reasoning in complex tasks needs further quantified input from large studies of human decision-making.\nPrevious studies in psychology, for example, often rely on relatively small cohorts and very specific tasks. These studies\nhave strongly influenced some of the core notions in AI research such as the reinforcement learning and the exploration versus\nexploitation paradigms. With the goal of contributing to this direction in AI developments we present our findings on the\nevolution towards world-class decision-making across large cohorts of subjects in the formidable game of Go. Some of these\nfindings directly support previous work on how experts develop their skills but we also report on several previously unknown\naspects of the development of expertise that suggests new avenues for AI research to explore. In particular, at the level\nof play that has so far eluded current AI systems for Go, we are able to quantify the lack of ‘predictability’ of experts\nand how this changes with their level of skill.","authors":["Michael Harré","T. Bossomaier","Alexandra Gillett","A. Snyder"],"meta":["April 2011The European Physical Journal B 80(4):555-563","DOI:10.1140/epjb/e2011-10905-8"],"references":["258430646_Recall_of_rapidly_presented_random_chess_positions_is_a_function_of_skill","239522900_Moves_in_Mind_The_Psychology_of_Board_Games","238378872_Modification_of_UCT_with_Patterns_in_Monte-Carlo_Go","257454838_Characterizing_mature_human_intelligence_Expertise_development","254222403_Knowledge_restructuring_in_expertise_development_Evidence_from_pathophysiological_representations_of_clinical_cases_by_students_and_physicians","247341954_Perception_in_Chess","247269768_Professional_Learning_Gaps_and_Transitions_on_the_Way_from_Novice_to_Expert","235418978_A_Mathematical_Theory_of_Communication","234828825_A_model_of_visual_organization_for_the_game_of_GO","232564609_Search_in_chess_Age_and_skill_differences"]}