{"id":"225518918_An_Epistemological_and_Didactic_Study_of_a_Specific_Calculus_Reasoning_Rule","abstract":"It is widely attested that university students face considerable difficulties with reasoning in analysis, especially when dealing with statements involving two different quantifiers. We focus in this paper on a specific mistake which appears in proofs where one applies twice or more a statement of the kind “for all X, there exists Y such that R(X, Y)”, and forgets that in that case, a priori, “Y depends on X”. We analyse this mistake from both a logical and mathematical point of view, and study it through two inquiries, an historical one and a didactic one. We show that mathematics teachers emphasise the importance of the dependence rule in order to avoid this kind of mistake, while natural deduction in predicate calculus provides a logical framework to analyse and control the use of quantifiers. We show that the relevance of this dependence rule depends heavily on the context: nearly without interest in geometry, but fundamental in analysis or linear algebra. As a consequence, mathematical knowledge is a key to correct reasoning, so that there is a large distance between beginners' and experts' abilities regarding control of validity, that, to be shortened, probably requires more than a syntactic rule or informal advice.\nRésumé\nLes difficultés de manipulation, par les étudiants, des énoncés contenant deux quantificateurs différents, rencontrés dans de nombreux raisonnements en analyse, sont bien attestées. Nous nous intéressons plus spécialement dans cet article à une erreur qui apparaît dans certaines preuves lorsque l'on applique deux fois ou plus un énoncé de la forme “pour tout X, il existe Y tel que R(X,Y)” et que l'on oublie que dans un tel cas, a priori, “Y dépend de X”. Nous analysons cette erreur d'un point de vue logique et d'un point de vue mathématique, puis nous l'étudions à travers deux enquêtes, l'une historique et l'autre didactique. Nous montrons que les professeurs de mathématiques soulignent l'importance de la règle de dépendance pour éviter ce type d'erreur, tandis que la déduction naturelle dans le calcul des prédicats fournit un cadre de référence logique pour analyser et contrôler l'usage des quantificateurs. Nous montrons que la pertinence de la règle de dépendance dépend fortement du contexte: pratiquement sans intérêt en géométrie, elle est tout à fait fondamentale en analyse et en algèbre linéaire. De ce fait, les connaissances mathématiques sont la clé d'un raisonnement correct, si bien qu'il y a une grande distance entre le débutant et l'expert concernant le contrôle de la validité, que quelques règles syntaxiques ou quelques conseils informels ne permettent vraisemblablement pas de réduire.","authors":["Viviane Durand-Guerrier","Gilbert Arsac"],"meta":["January 2005Educational Studies in Mathematics 60(2):149-172","DOI:10.1007/s10649-005-5614-y"],"references":["226405396_Educational_Studies_in_Mathematics_article_Unpacking_the_logic_of_mathematical_statements","314079469_A_First_Course_in_Calculus","300222876_On_student_understanding_of_AE_and_EA_quantification","294446938_Production_of_examples_and_counter-examples_in_anaeysis_Case_study_in_first_year_of_university","285346062_Recherches_sur_la_serie_1_m1x_mm-112x2","274647719_Mathematiques_pour_l'eleve_professeur","268541471_Introduction_a_la_logique_Collection_de_logique_mathematique_Serie_A_XVI_2e_ed","266011685_A_First_Course_in_Calculus","265818730_Proofs_from_THE_BOOK_2nd_ed","253244568_Cours_d'Analyse_de_l'Ecole_Royale_Polytechnique_1_Analyse_Algebrique","249253549_Proofs_and_refutations_iii","247353377_Recherches_sur_La_Deduction_Logique","247282509_Proofs_and_Refutations_The_Logic_of_Mathematical_Discovery","244466885_Introduction_to_Logic_and_to_the_Methodology_of_Deductive_Sciences","242976245_Untersuchungen_uber_das_logische_Schliessen_I-II","241219994_LOGIC_AND_MATHEMATICAL_REASONING_FROM_A_DIDACTICAL_POINT_OF_VIEW_A_MODEL-THEORETIC_APPROACH","238410608_Proofs_and_Refutations","227082587_Structure_du_raisonnement_deductif_et_apprentissage_de_la_demonstration","226345973_Which_notion_of_implication_is_the_right_one_From_logical_considerations_to_a_didactic_perspective","226265512_Alfred_Tarski_Semantic_Shift_Heuristic_Shift_In_Metamathematics","225774248_Production_d'exemples_et_de_contre-exemples_en_analyse_etude_de_cas_en_premiere_d'universite","200026968_Foundations_of_Theory_of_Signs","39768861_Foundations_of_the_Theory_of_Signs","36239572_Untersuchungen_uber_das_logische_Schliessen"]}