{"id":"225683960_Signification_et_fonctionnement_du_concept_de_variable_informatique_chez_des_eleves_debutants","abstract":"Dans le cadre d'une problématique d'ensemble sur les difficultés cognitive posées par l'acquisition des concepts informatiques,\nnous avons étudié chez des élèves débutants, la résolution de problèmes relatifs à la représentation et au traitement des\nvariables informatiques, dans une tâche de complétion de lignes manquantes dans un programme. Les résultats permettent de\ndiscuter les relations entre d'une part la nature des solutions apportées par les élèves, d'autre part les propriétés du champs\nconceptuel en jeu et la maniére dont les concepts ont été introduits.\nOur general purpose is to study the cognitive problems encountered by subjects in their acquisition of programming concepts.\nIn this paper we focus our attention on the concept of variable and its use in problem-solving by naive students (15–16 years\nold) who had previously followed a didactical experience. We offered to the students a set of computer program texts in which\none or more instructions were missing: they were asked to complete these instructions. The results are discussed in terms\nof the nature of the solution given by the student, the properties of the conceptual field and the way in which these concepts\nwere introduced.","authors":["Renan Samurçay"],"meta":["May 1985Educational Studies in Mathematics 16(2):143-161","DOI:10.1007/BF02400935"],"references":["226030819_Collecting_and_analyzing_on-line_protocols_from_novice_programmers","220420651_Cognitive_Strategies_and_Looping_Constructs_An_Empirical_Study","343720591_A_Classification_of_Cognitive_Tasks_and_Operations_of_Thought_Involved_in_Addition_and_Subtraction_Problems","292746526_Analysis_of_beginners'_problem_solving_strategies_in_programming","242602039_What_do_novices_know_about_programming","242368448_A_comparison_of_the_debugging_behavior_of_expert_and_novice_programmers","239584695_An_empirical_invest_igation_of_the_tacit_plan_knowledge_in_programming","222455139_Learning_to_program_in_LISP","200086168_Software_psychology_Human_factors_in_computer_and_information_systems_Winthrop_computer_systems_series"]}