{"id":"225729317_The_BS_class_of_Hermite_spline_quasi-interpolants_on_nonuniform_knot_distributions","abstract":"The BS Hermite spline quasi-interpolation scheme is presented. It is related to the continuous extension of the BS linear\nmultistep methods, a class of Boundary Value Methods for the solution of Ordinary Differential Equations. In the ODE context,\nusing the numerical solution and the associated numerical derivative produced by the BS methods, it is possible to compute,\nwith a local approach, a suitable spline with knots at the mesh points collocating the differential equation at the knots\nand having the same convergence order as the numerical solution. Starting from this spline, here we derive a new quasi-interpolation\nscheme having the function and the derivative values at the knots as input data. When the knot distribution is uniform or\nthe degree is low, explicit formulas can be given for the coefficients of the new quasi-interpolant in the B-spline basis.\nIn the general case these coefficients are obtained as solution of suitable local linear systems of size 2d×2d, where d is the degree of the spline. The approximation order of the presented scheme is optimal and the numerical results prove that\nits performances can be very good, in particular when suitable knot distributions are used.","authors":["Francesca Mazzia","Alessandra Sestini"],"meta":["September 2009BIT. Numerical mathematics 49(3):611-628","DOI:10.1007/s10543-009-0229-9"],"references":["265866339_Spline_Methods_Draft","242589318_Splines_as_linear_combinations_of_B-splines","308631836_A_Practical_Guide_to_Splines","265357564_Solving_differential_equations_by_multistep_Initial_and_boundary_value_methods","246710516_Local_spline_approximation_methods","242814819_Spline_approximation_by_quasiinterpolants","239062419_Spline_approximation_by_quasi-interpolants","233428035_The_continuous_extension_of_the_B-spline_linear_multistep_methods_for_BVPs_on_non-uniform_meshes","233428034_High_Order_Continuous_Approximation_for_the_Top_Order_Methods","233428029_A_class_of_symmetric_methods_for_Hamiltonian_systems"]}