{"id":"225751063_Optimum_values_of_structural_safety_factors_for_a_predefined_reliability_level_with_extension_to_multiple_limit_states","abstract":"In the field of deterministic structural optimization, the designer reduces the structural cost without taking into account uncertainties concerning materials, geometry and loading. This way, the resulting optimum solution may represent a lower level of reliability and thus a higher risk of failure. It is the objective of reliability-based design optimization (RBDO) to design structures that should be both economic and reliable. The coupling between mechanical modeling, reliability analyses and optimization methods leads to very high computational costs and weak convergence stability. Since the traditional RBDO solution is achieved by alternating between reliability and optimization iterations, the structural designers performing deterministic optimization do not consider the RBDO model as a practical tool for the design of real structures. Fortunately, a hybrid method based on simultaneous solution of the reliability and the optimization problem, has successfully reduced the computational time problem. The hybrid method allows us to satisfy a required reliability level, but the vector of variables here contains both deterministic and random variables. The hybrid RBDO problem is thus more complex than that of deterministic design. The major difficulty lies in the evaluation of the structural reliability, which is carried out by a special optimization procedure. In this paper a new methodology is presented with the aim of finding a global solution to RBDO problems without additional computing cost for the reliability evaluation. The safety factor formulation for a single limit state case has been used to efficiently reduce the computational time . This technique is fundamentally based on a study of the sensitivity of the limit state function with respect to the design variables. In order to demonstrate analytically the efficiency of this methodology, the optimality condition is then used. The efficiency of this technique is also extended to multiple limit state cases. Two numerical examples are presented at the end of the paper to demonstrate the applicability of the new methodology.","authors":["Ghais Kharmanda","N. Olhoff","Abdelkhalak ELHami"],"meta":["July 2004Structural and Multidisciplinary Optimization 27(6):421-434","DOI:10.1007/s00158-004-0405-0"],"references":["263047733_Structural_Reliability_Methods","243758427_An_Exact_and_Invariant_First_Order_Reliability_Format","290271137_A_Comparison_of_Some_Algorithms_for_Reliability_Based_Structural_Optimization_and_Sensitivity_Analysis","279373796_Multicriteria_Design_Optimization","279368156_Reliability-Based_Optimum_Structural_Design","271644099_Introduction_To_Optimum_Design","267462397_Elements_of_structural_optimization_3_revised_and_expanded_ed","258928944_On_Structural_Optimization","250694094_Structural_system_reliability_and_optimization","245328897_A_Method_of_Structural_Optimization_Based_on_Structural_System_Reliability","238184454_A_New_Study_on_Reliability-Based_Design_Optimization","236660920_Methods_of_Structural_Safety","235823440_New_hybrid_formulation_for_reliability-based_optimization_of_structures","225101443_Efficient_reliability-based_design_optimization_using_a_hybrid_space_with_application_to_finite_element_analysis","223369127_Reliability-based_optimal_structural_design_by_the_decoupling_approach","222945716_Optimization_algorithms_for_structural_reliability","222350663_General_purpose_procedure_for_reliability_based_structural_optimization_under_parametric_uncertainties","222347480_Reliability-based_structural_optimization_using_improved_two-point_adaptive_nonlinear_approximations"]}