{"id":"225759965_S2S_Structural-to-syntactic_matching_similar_documents","abstract":"Management of large collection of replicated data in centralized or distributed environments is important for many systems\nthat provide data mining, mirroring, storage, and content distribution. In its simplest form, the documents are generated,\nduplicated and updated by emails and web pages. Although redundancy may increase the reliability at a level, uncontrolled\nredundancy aggravates the retrieval performance and might be useless if the returned documents are obsolete. Document similarity\nmatching algorithms do not provide the information on the differences of documents, and file synchronization algorithms are\nusually inefficient and ignore the structural and syntactic organization of documents. In this paper, we propose the S2S matching approach. The S2S matching is composed of structural and syntactic phases to compare documents. Firstly, in the structural phase, documents\nare decomposed into components by its syntax and compared at the coarse level. The structural mapping processes the decomposed\ndocuments based on its syntax without actually mapping at the word level. The structural mapping can be applied in a hierarchical\nway based on the structural organization of a document. Secondly, the syntactic matching algorithm uses a heuristic look-ahead\nalgorithm for matching consecutive tokens with a verification patch. Our two-phase S2S matching approach provides faster results than currently available string matching algorithms.","authors":["Ramazan Aygun"],"meta":["September 2008Knowledge and Information Systems 16(3):303-329","DOI:10.1007/s10115-007-0108-0","SourceDBLP"],"references":["262333747_On_the_Resemblance_and_Containment_of_Documents","221211428_Structure-Preserving_Difference_Search_for_XML_Documents","319395193_The_evolution_of_the_web_and_implications_for_an_incremental_crawler","303802749_Indexing_by_Latent_Semantic_Analysis","242391317_The_MD5_Message-digest_Algorithm","238294548_Peer-to-Peer_Computing_HP_Laboratories_Palo_Alto","228057706_Indexing_By_Latent_Semantic_Analysis","225242520_Improving_the_retrieval_of_information_from_external_sources","225228619_Efficient_string_matching_with_wildcards_and_length_constraints","221151397_Neighbourhood_Counting_Metric_for_Sequences"]}