{"id":"225753093_Trust_and_privacy_in_the_future_internet-a_research_perspective","abstract":"With the proliferation of networked electronic communication came daunting capabilities to collect, process, combine and store\ndata, resulting in hitherto unseen transformational pressure on the concepts of trust, security and privacy as we know them.\nThe Future Internet will bring about a world where real life will integrate physical and digital life. Technology development\nfor data linking and mining, together with unseen data collection, will lead to unwarranted access to personal data, and hence,\nprivacy intrusion. Trust and identity lie at the basis of many human interactions and transactions, and societies have developed\nlegitimate concern for privacy being essential for freedom and creativity. The burgeoning development of the Information Society,\nparticularly during the past fifteen years, transcended the societal readiness to respond to the transformational change evoked\nby ICT. We have reached the eleventh hour for the preservation of trust and privacy as elements that can be transposed into\nour digital future. Europe has been at the forefront in recognizing the importance of privacy protection in relation to digital\ndata, witness the advanced European legislation in this domain. The European Commission recognizes that appropriate measures\nneed to combine technology development with legal means, user awareness and tools supporting data controllers to comply with\nlaw in an accountable and transparent way, and that empower users with a controlling stake in managing their personal data.\nActivities are underway at many levels. European RTD programmes play their role in supporting research in trustworthy ICT,\nprivacy enhancing technologies, privacy-by-design in service layers as well as in networks, enabling technologies such as\ncryptography, and in generalized frameworks for trust and privacy-protective identity management.\n\nKeywordsTrust-Privacy-e-Identity-Research-Technology-Future internet","authors":["Dirk van Rooy","Jacques Bus"],"meta":["August 2010Identity in the Information Society 3(2):397-404","DOI:10.1007/s12394-010-0058-7"],"references":["248159443_Trust_The_Social_Virtues_and_the_Creation_of_Prosperity_Penguin_London","227350044_Social_Capital_Innovation_and_Growth_Evidence_from_Europe","44825100_Trust_The_Social_Virtues_and_the_Creation_of_Prosperity"]}