{"id":"225899150_Provably_secure_masking_of_AES","abstract":"A general method to secure cryptographic algorithms against side-channel attacks is the use of randomization techniques and,\nin particular, masking. Roughly speaking, using random values unknown to an adversary one masks the input to a cryptographic\nalgorithm. As a result, the intermediate results in the algorithm computation are uncorrelated to the input and the adversary\ncannot obtain any useful information from the side-channel. Unfortunately, previous AES randomization techniques have based\ntheir security on heuristics and experiments. Thus, flaws have been found which make AES randomized implementations still\nvulnerable to side-channel cryptanalysis. In this paper, we provide a formal notion of security for randomized maskings of\narbitrary cryptographic algorithms. Furthermore, we present an AES randomization technique that is provably secure against\nside-channel attacks if the adversary is able to access a single intermediate result. Our randomized masking technique is\nquite general and it can be applied to arbitrary algorithms using only arithmetic operations over some finite field. To our\nknowledge this is the first time that a randomization technique for the AES has been proven secure in a formal model.","authors":["Johannes Blömer","Jorge Guajardo","Volker Krummel"],"meta":["January 2005","DOI:10.1007/978-3-540-30564-4_5","Conference: Proceedings of the 11th international conference on Selected Areas in Cryptography"],"references":["225127628_A_Compact_Rijndael_Hardware_Architecture_with_S-Box_Optimization","244456894_DES_and_Differential_Power_Analysis","243771699_Resistance_against_implementation_attacks_A_comparative_study_of_the_AES_proposals","239666203_Power_Analysis_of_the_Key_Scheduling_of_the_AES_Canditates","238726927_Introduction_to_differential_power_analysis_and_related_attacks","226226622_Lecture_Notes_in_Computer_Science","225172017_A_Simple_Power-Analysis_SPA_Attack_on_Implementations_of_the_AES_Key_Expansion","222705564_Balanced_Self-Checking_Asynchronous_Logic_for_Smart_Card_Applications","222442232_A_fast_algorithm_for_computing_multiplicative_inverses_in_GF2m_using_normal_bases","221354811_Towards_Sound_Approaches_to_Counteract_Power-Analysis_Attacks"]}