{"id":"225823444_Influence_of_estimation_errors_on_wayfinding-decisions_in_unknown_street_networks_-_Analyzing_the_least-angle_strategy","abstract":"The least-angle strategy is a common wayfinding method that can be applied in unknown environments if the target direction is known. The strategy is based on the navigator''s heuristic to select the street segment at an intersection which is most in line with the target direction. To use this strategy, the navigator needs to know the angles between the target direction and the street segments leading out from the intersection. If the direct view to the target is blocked and the target vector cannot be perceived, the target direction that is needed for the decision process is based on the agent''s believed position and orientation (estimated through path integration). The agent''s believed position and target direction are distorted by human errors in estimation of distances and directions, mainly affecting the path integration process. In this paper we examine how human estimation errors of distance and rotation influence the decision behavior in the wayfinding process in an unknown street environment. To demonstrate the geometrical consequences for a specific test case, we use a simulated software agent which navigates in a simulated street environment.","authors":["Hartwig Hochmair","Andrew U. Frank"],"meta":["January 2000Spatial Cognition and Computation 2(4):283-313","DOI:10.1023/A:1015566423907"],"references":["262008103_Cognitive_Maps_Spatial_Abilities_and_Human_Wayfinding","249624049_The_Spatio-Cognitive_Abilities_of_the_Visually_Impaired_Population","307507432_Differences_in_spatial_knowledge_acquired_from_maps_and_navigation","286349713_Cognitive_mapping_and_spatial_decision-making","284236622_The_cognitive_structure_of_spatial_knowledge","258132418_An_Information_Storage_Model_for_Distance_Cognition","247603729_Spatial_Orientation_and_the_Angularity_of_Urban_RoutesA_Field_Study","246449848_In_Multiagent_Systems_A_Modern_Introduction_to_Distributed_Artificial_Intelligence","243786244_Analytical_Cybernetics_of_Spider_Navigation","242918909_Dead_Reckoning_Landmark_Learning_and_the_Sense_of_Direction_A_Neurophysiological_and_Computational_Hypothesis"]}