{"id":"225833325_Generalized_Compact_Knapsacks_Cyclic_Lattices_and_Efficient_One-Way_Functions","abstract":"We investigate the average-case complexity of a generalization of the compact knapsack problem to arbitrary rings: given m (random) ring elements a\n1,..., a\n\nm\n∈ R and a (random) target value b ∈ R, find coefficients x\n1, ..., x\n\nm\n∈ S (where S is an appropriately chosen subset of R) such that ∑ a\n\ni\n· x\n\ni\n= b. We consider compact versions of the generalized knapsack where the set S is large and the number of weights m is small. Most variants of this problem considered in the past (e.g., when \n\nR=\\mathbbZR={\\mathbb{Z}} is the ring of the integers) can be easily solved in polynomial time even in the worst case. We propose a new choice of the\nring R and subset S that yields generalized compact knapsacks that are seemingly very hard to solve on the average, even for very small values\nof m. Namely, we prove that for any unbounded function m = ω(1) with arbitrarily slow growth rate, solving our generalized compact knapsack problems on the average is at least as hard as the worst-case instance of various approximation problems over cyclic lattices. Specific worst-case lattice problems considered in this\npaper are the shortest independent vector problem SIVP and the guaranteed distance decoding problem GDD (a variant of the\nclosest vector problem, CVP) for approximation factors n\n1+∈ almost linear in the dimension of the lattice.\n\nOur results yield very efficient and provably secure one-way functions (based on worst-case complexity assumptions) with key\nsize and time complexity almost linear in the security parameter n. Previous constructions with similar security guarantees required quadratic key size and computation time. Our results can\nalso be formulated as a connection between the worst-case and average-case complexity of various lattice problems over cyclic\nand quasi-cyclic lattices.","authors":["Daniele Micciancio"],"meta":["December 2007computational complexity 16(4):365-411","DOI:10.1007/s00037-007-0234-9","SourceDBLP"],"references":["238747500_A_hierarchy_of_polynomial_time_basis_reduction_algorithms","227018363_Approximating_CVP_to_Within_Almost-Polynomial_Factors_is_NP-Hard","284039089_Reducibility_among_combinatorial_problems","266920710_Generating_hard_instance_of_lattice_problems","255674630_Compact_knapsacks_are_polynomially_solvable","248698047_Breaking_Knapsack_Cryptosystems_by_Max_-_Norm_Enumeration","247930627_The_shortest_vector_problem_in_L_2_is_NP_-hard_for_randomized_reductions_extended_abstract","243452325_Another_NP-complete_partition_problem_and_the_complexity_of_computing_short_vectors_in_a_lattice","239063779_The_shortest_vector_problem_is_NP-hard_to_approximate_to_within_some_constant","227274324_A_Knapsack_Type_Public_Key_Cryptosystem_Based_On_Arithmetic_in_Finite_Fields_preliminary_draft"]}