{"id":"225926596_Composition_dependence_of_tensile_yield_stress_in_filled_polymers","abstract":"Filled polymers are the simplest type of composite polymeric materials, which consist of a matrix polymer as a continuous phase and a generally inorganic filler dispersed in the matrix. These materials are practically isotropic, if the geometry of the filler particles is isotropic too, or if no orientation of anisotropic fillers occurs during processing. Fillers are applied to modify various properties (mechanical, electrical, etc.) of polymers or, simply as extenders for lowering the price/volume ratio of the material. In any case, it is essential to know the dependence of the properties on the composition (i.e. on the filler content expressed as volume fraction, ~o) in order to achieve an optimum with respect to the desired objective. Among the mechanical properties yield stress of the composite (aye) has primary importance, giving information on the maximum allowable load without considerable plastic deformation. The yield stress of a composite depends, however, in a very complex way on the microstructure (including the interfacial structure), since the load transfer between the phases and also the stress concentration is determined by structural factors (form and size distribution of the filler, its spatial distribution in the matrix, thickness of the interface etc.). It is not surprising that theoretical analysis of simple models gives no satisfactory description of the yield stress as a function of the composition. In the case of zero adhesion between the filler particles and the continuous polymer phase there is no load transfer to the filler and the total load is carried by the matrix. The composite yield stress depends on the effective load bearing cross-section 1 - 0, which is the minimum value of matrix area in the crosssection perpendicular to the load direction:","authors":["Bela Turcsányi","Bela Pukanszky","F. Tüdõs"],"meta":["February 1988Journal of Materials Science Letters 7(2):160-162","DOI:10.1007/BF01730605"],"references":["248365867_On_the_tensile_behaviour_of_filled_composites","230299102_Simple_Theory_of_Stress-Strain_Properties_of_Filled_Polymers","230116558_The_Strength_of_Polymeric_Composites_Containing_Spherical_Fillers","229984711_A_deformational_mechanism_in_particulate-filled_glassy_polymers","229756538_Stress-strain_behavior_of_styrene-acrylonitrileglass_bead_composites_in_the_glassy_region","227126296_Tensile_yield_stress_of_polypropylene_composites_filled_with_ultrafine_particles"]}