{"id":"225993259_An_Architectural_Approach_Towards_the_Future_Internet_of_Things","abstract":"Many of the initial developments towards the Internet of Things have focused on the combination of Auto-ID and networked infrastructures\nin businessto- business logistics and product life cycle applications. However, a future Internet of Things can provide a\nbroader vision and also enable everyone to access and contribute rich information about things and locations. The success\nof social networks to share experience and personalised insights shows also great potential for integration with business-centric\napplications. The integration and interoperability with mainstream business software platforms can be enhanced and extended\nby real-time analytics, business intelligence and agent-based autonomous services. Information sharing may be rewarded through\nincentives, thus transforming the Internet of Things from a cost-focused experiment to a revenue-generating infrastructure\nto enable trading of enriched information and accelerate business innovation. Mash-ups and end-user programming will enable\npeople to contribute to the Internet of Things with data, presentation and functionality. Things-generated physical world\ncontent and events from Auto-ID, sensors, actuators or meshed networks will be aggregated and combined with information from\nvirtual worlds, such as business databases and Web 2.0 applications, and processed based on new business intelligence concepts.\nDirect action on the physical world will be supported through machine-interfaces and introduction of agile strategies. This\nchapter aims to provide a concept for a future architecture of the Internet of Things, including a definition, a review of\ndevelopments, a list of key requirements and a technical design for possible implementation of the future Internet of Things.\nAs open issues, the evaluation of usability by stakeholders in user-centric as well as business-centric scenarios is discussed\nand the need for quantifying costs and benefits for businesses, consumers, society and the environment is emphasised. Finally,\nguidelines are derived, for use by researchers as well as practitioners.","authors":["Dieter Uckelmann","Mark Harrison","Florian Michahelles"],"meta":["April 2011","DOI:10.1007/978-3-642-19157-2_1","In book: Architecting the Internet of Things (pp.1-24)"],"references":["242427258_What_is_RFID_Worth_to_Your_Company_Measuring_Performance_at_the_Activity_Level_Paper_223","228498840_The_BI_watch_real-time_to_real-value","220841739_Node_Clustering_in_Wireless_Sensor_Networks_by_Considering_Structural_Characteristics_of_the_Network_Graph","321614180_The_Internet_of_Things_First_International_Conference_IOT_2008_Zurich_Switzerland_March_26-28_2008_Proceedings","321600602_Das_Internet_der_Dinge_Ubiquitous_Computing_und_RFID_in_der_Praxis_Visionen_Technologien_Anwendungen_Handlungsanleitungen","321253453_Business-Model-Innovation","243784295_The_electronic_product_code_EPC_A_naming_scheme_for_objects","239549553_white_paper_The_Electronic_Product_Code_EPC","221408165_Into_the_Unknown_Measuring_the_Business_Performance_of_RFID_Applications","220419315_An_Energy_Efficient_Clustering_Scheme_in_Wireless_Sensor_Networks"]}