{"id":"226085821_Financing_higher_education_in_India","abstract":"This paper is an attempt to analyse the present pattern of funding higher education in India and to discuss the desirability and feasibility of various alternative methods of funding the same. Higher education in India is basically a state funded sector. But as higher education benefits not only society at large, but also individuals specifically, and as it attracts relatively more privileged sections of the society, there is a rationale for shifting the financial burden to the individual domain from the social domain.\nIt is argued here that given the resource constraints and equity considerations, financing higher education mostly from the general tax revenue may not be a desirable policy in the long run. Accordingly some of the alternative policy choices are discussed, including financing higher education from the public exchequer, student loans, graduate tax, student fees, and the role of the private sector. Among the available alternatives, it is argued that a discriminatory pricing mechanism would be relatively more efficient and equitable. While given the socioeconomic and political realities, the government has to continue to bear a large responsibility for funding higher education, instead of relying on a single form of funding, efforts should be made to evolve a model of funding that provides a mix of the various methods. It is also argued that fee and subsidy policies need to make distinctions across various layers and forms of higher education.","authors":["Jandhyala Tilak","N.V. Varghese"],"meta":["January 1991Higher Education 21(1):83-101","DOI:10.1007/BF00132343","Project: India Higher Education Report"],"references":["299511372_Economics_of_Inequality_in_Education","324307389_Economics_of_Income_Redistribution","316734715_Economics_of_Income_Redistribution","314798001_Income_Distribution_Macroeconomics","312885892_Investment_in_Men_Versus_Investment_in_Machines_The_Case_of_India","280982356_Carear_Education_and_Higher_Education","275798902_Institutional_Elements_in_the_Financing_of_Education","274108224_Higher_Education_in_India_The_Deepening_Financial_Crisis","273225242_Investment_in_Education_in_India","249103296_The_Perverse_Effects_of_Public_Subsidization_of_Education_or_How_Equitable_Is_Free_Education","234721277_Discriminatory_Pricing_in_Education_Occasional_Paper_8","248993098_Education_and_Economic_Growth_in_Indict","248168580_Family_and_government_investments_in_education","246507335_International_Experience_of_Financial_Support_for_Students_Recent_Trends_and_Developments","234723240_Economics_of_Higher_Education"]}