{"id":"226095821_History_of_Giftedness_Perspectives_from_the_Past_Presage_Modern_Scholarship","abstract":"Across centuries and cultures, exceptional performances and performers have intrigued scholars, practitioners, and the general\npublic. Whatever the domain, highlevel achievements interest people, sometimes as a model to emulate, sometimes as an area\nof inquiry, sometimes as a curiosity.\n\nTheoretically, the modern study of giftedness is related to the psychology of individual differences. In the nineteenth, twentieth,\nand twenty-first centuries, the psychological constructs of intelligence, creativity, and motivation provided the foundation\nfor understanding giftedness. There are, however, earlier conceptions of extraordinary people and performances that have influenced\nour perspectives on giftedness as well. This chapter reviews briefly the historical interest in giftedness to the nineteenth\ncentury, shares four biographical summaries that illustrate key issues in the twentieth-century history of gifted education,\noffers a review of cognitive and affective variables which have historically been used to study giftedness, and concludes\nwith attention to issues of particular interest to psychologists and mental health professionals.","authors":["Ann Robinson","Pamela R. Clinkenbeard"],"meta":["February 2008","DOI:10.1007/978-0-387-74401-8_2","In book: Handbook of Giftedness in Children (pp.13-31)"],"references":["279704843_Challenges_and_Opportunities_for_Students_Who_Are_Gifted_What_the_Experts_Say","263153758_On_the_Relevance_of_Research_Findings_in_Cognitive_Neuroscience_to_Educational_Practice","344898080_Psychosocial_development_in_intellectually_gifted_children","310241413_An_Investigation_of_Self-Concept_in_Gifted_Children","299202021_Best_Practices_In_Gifted_Education_An_Evidence-Based_Guide","286825130_A_History_of_Giftedness_in_School_and_Society","274814572_Case_Studies_of_Negro_Children_of_Binet_IQ_160_and_Above","273303034_Educational_Productivity_Predictors_Among_Mathematically_Talented_Students","271994326_A_study_of_self-concept_and_social_support_in_advantaged_and_disadvantaged_seventh_and_eighth_grade_gifted_students","258137866_The_Experience_of_Giftedness_A_Concept_Map"]}