{"id":"226297265_People's_Biodiversity_Registers_Lessons_Learnt","abstract":"People''s Biodiversity Registers (PBR) document folk knowledge of status, uses, history, ongoing changes and forces driving changes in biodiversity resources, gainers and losers in these processes and people''s perceptions of how these resources should be managed. A number of PBRs have been prepared in different parts of India beginning 1995 through initiatives of NGOs and educational institutions working with local communities and village councils. These attempts have been motivated by a desire to promote decentralised systems of management of natural resources and to create the basis for equitable sharing of benefits of commercial utilisation of folk knowledge of uses of biodiversity. The documents bring together important locality specific information on biodiversity resources and ecological processes affecting them. They lead to recognition of conservation oriented local practices such as protection of sacred groves. They help mobilise local communities to prudently manage local biodiversity resources in ways that would promote social justice. It is however important to recognise that not all folk knowledge may be valid, nor all folk practices wise, and to create systems of careful assessment of the material. There are many encouraging signs globally, as well as within India, such as the coming in force of the Convention on Biological Diversity, forces promoting decentralised democratic systems of governance and institutions of co-management of natural resources which suggest that programmes like PBR will have an important role to play in promoting conservation, sustainable use and equitable sharing of benefits of biodiversity resources in the coming decades.","authors":["Madhav Gadgil"],"meta":["September 2000Environment Development and Sustainability 2(3):323-332","DOI:10.1023/A:1011438729881"],"references":["279937793_Ecological_diversity","259151142_Sacred_woods_grasslands_and_water_bodies_as_self-organized_systems_of_conservation","252490980_New_Meanings_for_Old_Knowledge_The_People's_Biodiversity_Registers_Program","248146028_Traditional_resource_management_systems","240046204_Indigenous_Knowledge_for_Biodiversity_Conservation","42765442_Forging_an_Alliance_Between_Formal_and_Folk_Ecological_Knowledge","313104672_People_refugia_and_resilience","37902794_Rural_Development_-_Putting_The_Last_First"]}