{"id":"226246918_Safety_for_Physical_Human-Robot_Interaction","abstract":"In this chapter, we report on different approaches to dealing with the problem of achieving the best performance under the\ncondition that safety is provided throughout task execution. We also report on intelligent assist devices (IADs) that go beyond\nconventional notions of robot safety to protect human operators from harm, such as cumulative trauma disorders. However, IADs\nand other physical human–robot interaction (pHRI) devices are themselves generally powerful enough to cause harm. We argue\nthat the differences between pHRI applications and conventional industrial manipulation requires that safety and reliability\nstandards be rethought, and we offer apreview of the directions currently being undertaken by international standards committees.\n\nWe chapter discuss the new frontiers of robotic physical interaction with humans, describing motivations and applications\nof safe pHRI. The state of the art, and the technical challenges to develop new robotic systems for safe and effective collaboration\nwith people, are discussed, subdividing the exposition into hands-off and hands-on pHRI systems. We present an overview of\nthe applicable safety standards and their ongoing development.","authors":["Antonio Bicchi","Michael Peshkin","James Colgate"],"meta":["January 2008","DOI:10.1007/978-3-540-30301-5_58","In book: Springer Handbook of Robotics (pp.1335-1348)"],"references":["344822072_Use_of_a_Weighted-Impulse_Criterion_for_Estimating_Injury_Hazard","289825540_The_Force_Vector_Assembler_Concept","285332354_Cartesian_Compliant_Control_Strategies_for_Light-Weight_Flexible_Joint_Robots","284694227_A_review_of_the_severity_index","273821853_Control_of_Self-optimizing_Exercise_Machines","266754741_Fault_Diagnosis_and_Fault_Tolerance_for_Mechatronic_SystemsRecent_Advances","264874522_Intrinsically_Safer_Robots","255037145_Robot_Reliability_and_Safety","251670782_Control_of_self-optimizing_exercise_machines","243461282_A_new_approach_to_robotic_safety_SafetyBUS_p_at_BMW"]}