{"id":"226262115_Learning_Mathematics_in_a_CAS_Environment_The_Genesis_of_a_Reflection_about_Instrumentation_and_the_Dialectics_between_Technical_and_Conceptual_Work","abstract":"The last decade has seen the development in France of a significant body of research into the teaching and learning of mathematics\nin CAS environments. As part of this, French researchers have reflected on issues of ‘instrumentation’, and the dialectics\nbetween conceptual and technical work in mathematics. The reflection presented here is more than a personal one – it is based\non the collaboration and dialogues that I have been involved in during the nineties. After a short introduction, I briefly\npresent the main theoretical frameworks which we have used and developed in the French research: the anthropological approach\nin didactics initiated by Chevallard, and the theory of instrumentation developed in cognitive ergonomics. Turning to the\nCAS research, I show how these frameworks have allowed us to approach important issues as regards the educational use of CAS\ntechnology, focusing on the following points: the unexpected complexity of instrumental genesis, the mathematical needs of\ninstrumentation, the status of instrumented techniques, the problems arising from their connection with paper & pencil techniques,\nand their institutional management.","authors":["Michèle Artigue"],"meta":["October 2002International Journal of Computers for Mathematical Learning 7(3):245-274","DOI:10.1023/A:1022103903080"],"references":["289726586_L'integration_d'instruments_informatiques_dans_l'enseignement_Une_approche_par_les_techniques","266581593_POURQUOI_LA_TRANSPOSITION_DIDACTIQUE","249898223_New_Work_Plans_in_the_Classroom","337823863_A_propos_de_l'apprentissage_des_limites_de_fonctions_dans_un_environnement_calculatrice_etude_des_rapports_entre_processus_d'instrumentation_et_processus_de_conceptualisation","317717151_Calculatrices_graphiques_la_grande_illusion","313429525_La_theorie_des_champs_conceptuels","279377694_Epistemologies_of_Mathematics_and_of_Mathematics_Education","273682705_L'Enseignement_des_Mathematiques","270162336_In_The_Structure_of_Scientific_Revolutions","266005256_Computer_algebra_impact_and_perspectives"]}