{"id":"226668974_Uncertain_convex_programs_Randomized_solutions_and_confidence_levels","abstract":"Many engineering problems can be cast as optimization problems subject to convex constraints that are parameterized by an uncertainty or ‘instance’ parameter. Two main approaches are generally available to tackle constrained optimization problems in presence of uncertainty: robust optimization and chance-constrained optimization. Robust optimization is a deterministic paradigm where one seeks a solution which simultaneously satisfies all possible constraint instances. In chance-constrained optimization a probability distribution is instead assumed on the uncertain parameters, and the constraints are enforced up to a pre-specified level of probability. Unfortunately however, both approaches lead to computationally intractable problem formulations.\nIn this paper, we consider an alternative ‘randomized’ or ‘scenario’ approach for dealing with uncertainty in optimization, based on constraint sampling. In particular, we study the constrained optimization problem resulting by taking into account only a finite set of N constraints, chosen at random among the possible constraint instances of the uncertain problem. We show that the resulting randomized solution fails to satisfy only a small portion of the original constraints, provided that a sufficient number of samples is drawn. Our key result is to provide an efficient and explicit bound on the measure (probability or volume) of the original constraints that are possibly violated by the randomized solution. This volume rapidly decreases to zero as N is increased.","authors":["G. Calafiore","Marco Campi"],"meta":["January 2005Mathematical Programming 102(1):25-46","DOI:10.1007/s10107-003-0499-y","SourceDBLP"],"references":["259694053_Linear_Programming_LP_Approaches_to_Semidefinite_Programming_SDP_Problems","240310526_Robust_Optimization_of_Large-Scale_Systems","344484944_Randomized_Algorithms","321509065_Stochastic_Programming","305387411_Semidefinite_optimization","285688992_Semidefinite_programming","269267548_Identification_of_reliable_predictor_models_for_unknown_systems_A_data-consistency_approach_based_o","243658817_A_Theory_of_Learning_and_Generalization","243134506_On_Constraint_Sampling_in_the_Linear_Programming_Approach_to_Approximate_Dynamic_Programming","240802154_On_the_Rate_of_Convergence_of_Optimal_Solutions_of_Monte_Carlo_Approximations_of_Stochastic_Programs"]}