{"id":"226750137_Digital_Realism_and_the_Governance_of_Spam_as_Cybercrime","abstract":"Spamming is a major threat to the formation of public trust in the Internet and discourages broader civil participation in the emerging information society. To the individual, spams are usually little more than a nuisance, but collectively they expose Internet users to a panoply of new risks while threatening the communications and commercial infrastructure. Spamming also raises important questions of criminological interest. On the one hand it is an example of a pure cybercrime – a harmful behaviour mediated by the Internet that is the subject of criminal law, while on the other hand, it is a behaviour that has in practice been most effectively contained technologically by the manipulation of ‘code’ – but at what cost? Because there is not an agreed meaning as to what constitutes ‘online order’ that renders it simply and uncritically reducible to a set of formulae and algorithms that can be subsequently imposed (surreptitiously) by technological processes. The imposition of order online, as it is offline, needs to be subject to critical discussion and also checks and balances that have their origins in the authority of law. This article deconstructs and analyses spamming behaviour, before exploring the boundaries between law and code (technology) as governance in order to inform and stimulate the debate over the embedding of cybercrime prevention policy within the code itself.\nPre-print version available at http://papers.ssrn.com/sol3/papers.cfm?abstract_id=740549","authors":["David S. Wall"],"meta":["December 2004European Journal on Criminal Policy and Research 10(4):309-335","DOI:10.1007/s10610-005-0554-8"],"references":["344472043_Cyber_Criminals_on_Trial","330865885_The_Culture_of_Control_Crime_and_Social_Order_in_Contemporary_Society","329652378_14_Surveillant_Internet_Technologies_and_the_Growth_in_Information_Capitalism_Spams_and_Public_Trust_in_the_Information_Society","313365085_Teetering_on_the_edge_the_futures_of_crime_control_and_community_safety","310594297_Afterword_The_Subject_and_Power","308559096_Afterword_The_subject_and_power","292506038_The_Virtual_Self_A_Contemporary_Sociology","291190163_Information_Technology_and_the_Criminal_Justice_System","279747573_City_of_Bits_Space_Place_and_the_Infobahn","262278357_City_of_bits_space_place_and_the_infobahn"]}