{"id":"226779490_The_Modern_Theory_of_Consumer_Behavior_Ordinal_or_Cardinal","abstract":"In sum, the cardinal utility numbers generated by neoclassical utility functions provide more information than do their ordinal counterparts. In fact, for any given set of bundles they contain all of the information implicit in ordinal utility numbers for the same set, plus they provide additional information concerning the intensity of the preference for any one bundle relative to any other. It is precisely because utility functions cannot be used to calculate ordinal rankings of bundles without prior calculation of their cardinal utility numbers that the use of utility functions is unacceptable for economic purposes. Moreover, although meaningless with respect to the reality of actual individuals’ preferences, this extra information is harmful because it is misleading.\nI conclude by reiterating the purpose of this article. I have attempted to demonstrate that neoclassical utility functions are an invalid means of analyzing consumer behavior for three reasons: first, and most important, because such functions, and their attendant rankings, are cardinal, not ordinal in nature; second, because, with respect to the set of bundles relevant to actual human beings, such functions are not continuous and, therefore, not differentiable; and, third, because such functions do not correctly, consistently, and properly include dimensions/units.\nLet me put this in another way. I will accept the validity of utility functions as soon as its proponents can show me how to perform basic mathematical or arithmetic operations on such ordinal numbers as 1st, 3rd, 6th, and 17th.","authors":["William Barnett"],"meta":["March 2003The Quarterly Journal of Austrian Economics 6(1):41-65","DOI:10.1007/s12113-003-1012-4"],"references":["240531924_On_Robert_Nozick's_'on_Austrian_methodology'","228250112_The_Microsoft_Corporation_in_Collision_with_Antitrust_Law","275473631_On_the_History_of_Ordinal_Utility_Theory_1900-1932","274182215_Calculus_and_Analytic_Geometry","270442240_A_History_of_Economic_Analysis","269947448_History_of_Economic_Analysis","265577926_Toward_a_Reconstruction_of_Utility_and_Welfare_Economics","240116898_Microeconomic_Theory_Basic_Principles_and_Extensions","230663736_Microeconomic_Analysis","227577249_The_Austrian_Search_for_Realistic_Foundations"]}