{"id":"226970122_The_STEREO_mission_an_introduction","abstract":"The twin STEREO spacecraft were launched on October 26, 2006, at 00:52 UT from Kennedy Space Center aboard a Delta 7925 launch\nvehicle. After a series of highly eccentric Earth orbits with apogees beyond the moon, each spacecraft used close flybys of\nthe moon to escape into orbits about the Sun near 1 AU. Once in heliospheric orbit, one spacecraft trails Earth while the\nother leads. As viewed from the Sun, the two spacecraft separate at approximately 44 to 45 degrees per year. The purposes\nof the STEREO Mission are to understand the causes and mechanisms of coronal mass ejection (CME) initiation and to follow\nthe propagation of CMEs through the inner heliosphere to Earth. Researchers will use STEREO measurements to study the mechanisms\nand sites of energetic particle acceleration and to develop three-dimensional (3-D) time-dependent models of the magnetic\ntopology, temperature, density and velocity of the solar wind between the Sun and Earth. To accomplish these goals, each STEREO\nspacecraft is equipped with an almost identical set of optical, radio and in situ particles and fields instruments provided\nby U.S. and European investigators. The SECCHI suite of instruments includes two white light coronagraphs, an extreme ultraviolet\nimager and two heliospheric white light imagers which track CMEs out to 1AU. The IMPACT suite of instruments measures in\nsitu solar wind electrons, energetic electrons, protons and heavier ions. IMPACT also includes a magnetometer to measure the\nin situ magnetic field strength and direction. The PLASTIC instrument measures the composition of heavy ions in the ambient\nplasma as well as protons and alpha particles. The S/WAVES instrument uses radio waves to track the location of CME-driven\nshocks and the 3-D topology of open field lines along which flow particles produced by solar flares. Each of the four instrument\npackages produce a small real-time stream of selected data for purposes of predicting space weather events at Earth. NOAA\nforecasters at the Space Environment Center and others will use these data in their space weather forecasting and their resultant\nproducts will be widely used throughout the world. In addition to the four instrument teams, there is substantial participation\nby modeling and theory oriented teams. All STEREO data are freely available through individual Web sites at the four Principal\nInvestigator institutions as well as at the STEREO Science Center located at NASA Goddard Space Flight Center.","authors":["M.L. Kaiser","T.A. Kucera","Joseph Davila","O. C. St. Cyr"],"meta":["January 2008Space Science Reviews 136(1):5-16","DOI:10.1007/s11214-007-9277-0"],"references":["316741129_Report_of_the_Mars_2020_Science_Definition_Team","234377360_Solar_Tomography","227245326_EIT_Extreme-ultraviolet_Imaging_Telescope_for_the_SOHO_mission","227114875_The_Solar_Electron_and_Proton_Telescope_for_the_STEREO_mission","227040255_STEREOWaves_goniopolarimetry","226656369_The_solar_terrestrial_relations_observatory_STEREO_Education_and_Outreach_EPO_program","226236704_The_large_angle_spectroscopic_coronagraph_LASCO","226160578_The_electric_antennas_for_the_STEREOWAVES_experiment","225592508_The_STEREO_IMPACT_Suprathermal_Electron_STE_instrument","225469026_The_high_energy_telescope_for_STEREO","225201235_The_IMPACT_solar_wind_electron_analyzer_SWEA","41625389_STEREO_IMPACT_investigation_goals_measurements_and_data_products_overview","41625387_The_Suprathermal_Ion_Telescope_SIT_for_the_IMPACTSEP_investigation","1890027_Astrophysics_in_2006","260965534_Solar_Terrestrial_Relations_Observatory_STEREO","234244965_A_space-borne_solar_stereoscope_experiment_in_solar_physics","229389652_The_problem_of_designing_a_solar_stereoscopic_observatory","226695239_STEREO_space_weather_and_the_Space_Weather_Beacon","226058697_The_stereoimpact_magnetic_field_experiment","225769495_STEREO_Ground_Segment_Science_Operations_and_Data_Archive","225627524_The_STEREO_observatory","225484952_The_STEREO_IMPACT_boom","223531765_Stereoscopic_viewing_of_solar_coronal_and_interplanetary_activity"]}