{"id":"226992714_Blowing_Bubbles_for_Multi-Scale_Analysis_and_Decomposition_of_Triangle_Meshes","abstract":"Tools for the automatic decomposition of a surface into shape\nfeatures will facilitate the editing, matching, texturing,\nmorphing, compression and simplification of three-dimensional shapes. Different\nfeatures, such as flats, limbs, tips, pits and various blending\nshapes that transition between them, may be characterized in terms\nof local curvature and other differential properties of the\nsurface or in terms of a global skeletal organization of the\nvolume it encloses. Unfortunately, both solutions are extremely\nsensitive to small perturbations in surface smoothness and to\nquantization effects when they operate on triangulated surfaces.\nThus, we propose a multi-resolution approach, which not only\nestimates the curvature of a vertex over neighborhoods of variable\nsize, but also takes into account the topology of the surface in\nthat neighborhood. Our approach is based on blowing a spherical\nbubble at each vertex and studying how the intersection of that\nbubble with the surface evolves. We describe an efficient approach\nfor computing these characteristics for a sampled set of bubble\nradii and for using them to identify features, based on easily\nformulated filters, that may capture the needs of a particular\napplication.\n\nShape description–Shape decomposition–Multi-scale shape feature extraction–Shape indexing","authors":["Michela Mortara","Giuseppe Patane","Michela Spagnuolo","Bianca Falcidieno"],"meta":["October 2003Algorithmica 38(1):227-248","DOI:10.1007/s00453-003-1051-4","SourceDBLP"],"references":["234790847_Straightest_Geodesics_on_Polyhedral_Surfaces","221293030_Extended_Reeb_Graphs_for_Surface_Understanding_and_Description","220720898_Topology_matching_for_fully_automatic_similarity_estimation_of_3D_shapes","266920976_Theory_and_problems_of_differential_geometry_Schaum's_Outline_Series","245942888_Discrete_differential-operators_for_triangulated_2-manifolds","230675366_Derential_Topology","228107547_Geometric_Reasoning_for_the_Extraction_of_Surface_Shape_Properties","224378035_Hierarchical_Shape_Description_Via_the_Multiresolution_Symmetric_Axis_Transform","224378034_Multiple_Resolution_Skeletons","222477392_A_Survey_of_Shape_Analysis_Techniques"]}