{"id":"227050141_Rewriting-Based_Techniques_for_Runtime_Verification","abstract":"Techniques for efficiently evaluating future time Linear Temporal Logic (abbreviated LTL) formulae on finite execution traces are presented. While the standard models of LTL are infinite traces, finite traces appear naturally when testing and/or monitoring real applications that only run for limited time periods. A finite trace variant of LTL is formally defined, together with an immediate executable semantics which turns out to be quite inefficient if used directly, via rewriting, as a monitoring procedure. Then three algorithms are investigated. First, a simple synthesis algorithm for monitors based on dynamic programming is presented; despite the efficiency of the generated monitors, they unfortunately need to analyze the trace backwards, thus making them unusable in most practical situations. To circumvent this problem, two rewritingbased practical algorithms are further investigated, one using rewriting directly as a means for online monitoring, and the other using rewriting to generate automata-like monitors, called binary transition tree finite state machines (and abbreviated BTT-FSMs). Both rewriting algorithms are implemented in Maude, an executable specification language based on a very efficient implementation of term rewriting. The first rewriting algorithm essentially consists of a set of","authors":["Grigore Roşu","Klaus Havelund"],"meta":["January 2005Automated Software Engineering 12(2):151-197","DOI:10.1007/s10515-005-6205-y","SourceDBLP"],"references":["271613294_Checking_Finite_Traces_Using_Alternating_Automata","312879533_The_temporal_rover_and_the_ATG_rover","312879331_Partial_orders_for_parallel_debugging","298123938_The_Temporal_Rover_and_the_ATG_rover","281657674_Model_Checking_a_Path_Preliminary_Report","281433650_Boolean_and_Cartesian_abstraction_for_model_checking_C_programs","280765005_Graph-based_algorithms_for_Boolean_function_manipulation","279985163_Model-Checking_Multi-threaded_distributed_Java_programs","263251210_Checking_Finite_Traces_Using_Alternating_Automata_Special_Issue_on_Selected_Papers_from_the_First_International_Workshop_on_Runtime_Verification_Held_in_Paris_July_2001_RV'01","247630774_SRI_International_Computer_Science_Laboratory"]}