{"id":"227080343_Functions_of_restricted_variation","abstract":"For real-valued functions defined on a simply ordered set, we introduce the concept of thek-variations which result from limiting the number of points in a partition tok. Thesek-variations exist finitely for bounded functions. If for a given function the sequence of differences between (k+1)-variations andk-variations has the limit zero ask increases we say the function is ofrestricted variation. In this paper various properties of functions of restricted variation are derived. It is shown that there exists an extension\nof the simply ordered setS to a simply ordered compact setS\n* such that every functionf of restricted variation onS may be extended to a functionf\n* continuous onS\n* and conversely. The set of functions of restricted variation is the completion in the supremum norm of the set of functions\nof bounded variation and is a complete linear space in the supremum norm.\n\nA cyclick-variation is also introduced and properties of these for bounded functions are derived, some of which correspond to similar\nproperties announced by A. H. Stroud for the non-cyclic case. Finally, the extension to complex-valued functions is made.","authors":["Preston C. Hammer","John C. Holladay"],"meta":["January 1959Rendiconti del Circolo Matematico di Palermo 8(1):102-114","DOI:10.1007/BF02843775"],"references":["323708067_Variation_Multiplicity_and_Semicontinuity","279375517_Continuous_Transformations_in_Analysis","274321270_Continuous_Transformation_in_Analysis","268773468_Concerning_Integrals","266216079_Variation_Multiplicity_and_Semicontinuity","266013238_Order-preserving_maps_and_integration_processes","265699025_An_intrinsic_property_of_Lebesgue_area","238872718_A_Study_of_a-Variation_I","38347911_An_intrinsic_inequality_for_Lebesgue_area","35036098_Concerning_integrals","34046600_Concerning_relationships_between_the_Dushnik_and_Mean-Stieltjes_integrals","31258699_Inequalities_Connected_with_Bounded_pth_Power_Variation_in_the_Wiener_Sense_and_with_Integrated_Lipschitz_Conditions"]}