{"id":"227040662_Weighted_Sum_Coloring_in_Batch_Scheduling_of_Conflicting_Jobs","abstract":"Motivated by applications in batch scheduling of interval jobs, processes in manufacturing systems and distributed computing, we study two related problems. Given is a set of jobs { J\n1,...,J\nn\n}, where J\nj\nhas the processing time p\nj\n, and an undirected intersection graph G =({ 1,2,...,n},E); there is an edge (i,j) ∈E if the pair of jobs J\ni\nand J\nj\ncannot be processed in the same batch. At any period of time, we can process a batch of jobs that forms an independent set in G. The batch completes its processing when the last job in the batch completes its execution. The goal is to minimize the sum of job completion times. Our two problems differ in the definition of completion time of a job within a given batch. In the first variant, a job completes its execution when its batch is completed, whereas in the second variant, a job completes execution when its own processing is completed.\nFor the first variant, we show that an adaptation of the greedy set cover algorithm gives a 4-approximation for perfect graphs. For the second variant, we give new or improved approximations for a number of different classes of graphs. The algorithms are of widely different genres (LP, greedy, subgraph covering), yet they curiously share a common feature in their use of randomized geometric partitioning.","authors":["Leah Epstein","Magnús M. Halldórsson","Asaf Levin","Hadas Shachnai"],"meta":["January 1970Algorithmica 55(4):643-665","DOI:10.1007/s00453-007-9161-z","SourceDBLP"],"references":["230595717_Combinatorial_Optimization_Polyhedra_and_Efficiency","225338274_Approximating_Min_Sum_Set_Cover","283559921_Paths_trees_flowers","270285518_Scheduling_Algorithms","268642744_Combinatorial_optimization_Polyhedra_and_efficiency_3_volumes","234803656_Ultimate_interval_graph_recognition_algorithm","228057776_Approximation_Algorithms_for_Combinatorial_Problems","228057772_Fast_Approximation_Algorithms_for_the_Knapsack_and_Sum_of_Subsets_Problems","228029223_Various_Optimizers_For_Single-Stage_Production","226272308_Path_Trees_and_Flowers"]}