{"id":"227128375_Cognitive_Links_Between_Fear_Of_Failure_And_Perfectionism","abstract":"This study investigated links between three forms of perfectionism and beliefs associated with fear of failure (FF). College\nstudents (N=372) enrolled in physical activity classes completed the Multidimensional Perfectionism Scale and Performance Failure Appraisal\nInventory in a single session. After controlling for other forms of perfectionism, only socially prescribed perfectionism\n(SPP) was strongly associated with beliefs that failure led to aversive interpersonal consequences (i.e., important others\nlosing interest, upsetting important others). Other-oriented perfectionism (OOP) exhibited a weak negative relation with beliefs\nthat failure would lead to devaluation of one’s self-estimate; individuals who held the highest standards for others’ behavior\nhad the weakest beliefs that failure would lead to them devaluing their self-estimate. Self-oriented perfectionism (SOP) was\nnot associated with any beliefs that failure led to aversive consequences; however, when SOP and OOP were simultaneously elevated,\nthey contributed positively to fears of experiencing shame and embarrassment (above and beyond main effects of SPP). Collectively\nthese findings indicated that FF was not ubiquitous with all forms of perfectionism because the specific beliefs about the\nconsequences of failure that underlie different forms of perfectionism varied tremendously.","authors":["David E Conroy","Miranda P Kaye","Angela M. Fifer"],"meta":["December 2007Journal of Rational-Emotive & Cognitive-Behavior Therapy 25(4):237-253","DOI:10.1007/s10942-007-0052-7"],"references":["328744825_Trait_and_self-presentational_dimensions_of_perfectionism_among_women_with_anorexia_nervosa","346788682_A_programmatic_approach_to_measuring_perfectionism_The_Almost_Perfect_Scales","328744745_The_interpersonal_expression_of_perfection_Perfectionistic_self-presentation_and_psychological_distress","328744593_Perfectionism_Is_Multidimensional_a_reply_to_Shafran_Cooper_and_Fairburn_2002","313162532_The_dimensions_of_perfectionism","312370939_Perfectionism_and_maladjustment_An_overview_of_theoretical_definitional_and_treatment_issues","292265771_The_spouse_who_is_a_perfectionist","291854048_Burnout_in_Competitive_Junior_Tennis_Players_III_Individual_Differences_in_the_Burnout_Experience","288482131_Perfectionism_and_the_self-conscious_emotions_Shame_guilt_embarrassment_and_pride","279558447_The_Unique_Psychological_Meanings_of_Multidimensional_Fears_of_Failing"]}