{"id":"227140153_The_Electrical_Resistance_Of_A_Graph_Captures_Its_Commute_And_Cover_Times","abstract":"View ann-vertex,m-edge undirected graph as an electrical network with unit resistors as edges. We extend known relations between random walks and electrical networks by showing that resistance in this network is intimately connected with thelengths of random walks on the graph. For example, thecommute time between two verticess andt (the expected length of a random walk froms tot and back) is precisely characterized by the effective resistanceR\n\nst\nbetweens andt: commute time=2mR\n\nst\n. As a corollary, thecover time (the expected length of a random walk visiting all vertices) is characterized by the maximum resistanceR in the graph to within a factor of logn:mRO(mRlogn). For many graphs, the bounds on cover time obtained in this manner are better than those obtained from previous techniques such as the eigenvalues of the adjacency matrix. In particular, we improve known bounds on cover times for high-degree graphs and expanders, and give new proofs of known results for multi-dimensional meshes. Moreover, resistance seems to provide an intuitively appealing and tractable approach to these problems.","authors":["Ashok K. Chandra","Prabhakar Raghavan","Walter L Ruzzo","Roman Smolensky"],"meta":["December 1996computational complexity 6(4):312-340","DOI:10.1007/BF01270385","SourceDBLP"],"references":["344774923_Random_Walks_and_Electric_Networks","324394685_Introduction_to_Probability_Models","313565837_Random_Walks_and_Electric_Networks","312308146_The_fundamental_theorem_of_electrical_networks","279980300_Randomized_time-space_tradeoff_on_OmR_for_USTCON","275582905_Matrix_Theory","268807998_A_Treatise_on_Electricity_and_Magnetism_I","248825285_A_random_polynomial_time_algorithm_for_estimating_volumes_of_convex_bodies","245678874_Coalescing_random_walks_and_voter_model_consensus_times_on_the_torus_in_Zd","245588053_Bounds_for_Eigenvalues_of_certain_stochastic_matrices"]}