{"id":"227202763_A_Physically-Based_Scheme_For_The_Urban_Energy_Budget_In_Atmospheric_Models","abstract":"An urban surface scheme for atmospheric mesoscale models ispresented. A generalization of local canyon geometry isdefined instead of the usual bare soil formulation currently usedto represent cities in atmospheric models. This allows refinement ofthe radiative budgets as well as momentum, turbulent heat and ground fluxes.The scheme is aimed to be as general as possible, in order to representany city in the world, for any time or weather condition(heat island cooling by night, urban wake, water evaporation after rainfalland snow effects).\n\nTwo main parts of the scheme are validated against published data.Firstly, it is shown that the evolution of the model-predictedfluxes during a night with calm winds is satisfactory, considering both the longwave budget and the surface temperatures. Secondly, the original shortwave scheme is tested off-line and compared to the effective albedoof a canyon scale model. These two validations show that the radiative energy input to the urban surface model is realistic.\n\nSensitivity tests of the model are performed for one-yearsimulation periods, for both oceanic and continental climates. The scheme has the ability to retrieve, without ad hoc assumptions, the diurnal hysteresis between the turbulent heat flux and ground heat flux. It reproduces the damping of the daytime turbulent heat flux by the heat storage flux observed in city centres. The latent heat flux is negligible on average,but can be large when short time scales are considered (especially afterrainfall). It also suggests that in densely built areas, domesticheating can overwhelm the net radiation, and supply a continuous turbulentheat flux towards the atmosphere. This becomes very important inwinter for continental climates. Finally, a comparison with a vegetation scheme shows that the suburban environment can be represented with a bare soil formulation for large temporal or spatial averages (typical of globalclimatic studies), but that a surface scheme dedicated to the urban surface is necessary when smaller scales are considered: town meteorological forecasts, mesoscale or local studies.","authors":["Valéry Masson"],"meta":["January 2000Boundary-Layer Meteorology 94(3):357-397","DOI:10.1023/A:1002463829265"],"references":["275590257_The_urban_energy_balance_Prog_Phys_Geogr","263557748_Evaporation_over_land-surfaces_First_results_from_HAPEX-MOBILHY_special_observing_period","260784082_The_Energy_Balance_of_an_Urban_Canyon","248405703_Simulation_of_the_energy_budget_of_an_urban_canyon-I_Model_structure_and_sensitivity_test","303108776_Surface_coefficients_as_affected_by_wind_direction","299737161_Climatology_of_Cities","284504622_Surface_conductances_as_affected_by_air_velocity_temperature_and_character_of_surface","263491054_The_energy_balance_of_central_Mexico_City_during_the_dry_season","258874213_The_Energy_Balance_of_AN_Urban_Canyon","249606867_Modifying_a_Mesoscale_Meteorological_Model_to_Better_Incorporate_Urban_Heat_Storage_A_Bulk-Parameterization_Approach"]}