{"id":"227350498_Customer_Satisfaction_Incentives","abstract":"Customer satisfaction incentive schemes are increasingly common in a variety of industries. We offer explanations as to how and when incenting employees on customer satisfaction is profitable and offer several recommendations for improving upon current practice. Faced with employee groups (including managers) who may have shorter time horizons than the firm, such systems enable a firm to use customer reaction to monitor implicitly how employees allocate effort between the short and long terms. These systems can be used to encourage employees to make tradeoffs that are in the best interests of the firm. We derive optimal reward systems for an equilibrium in which the firm maximizes profits, employees maximize their expected utility, and customers choose purchase quantities based on initial reputations, employee efforts (both ephemeral and enduring), and price. The formal model shows how the reliance placed on customer satisfaction in an incentive scheme should depend upon the precision with which customer satisfaction is measured and the extent to which employees focus on the short term. Recommendations for improving upon current practice include: measure customers, former customers, potential customers; measure satisfaction with competitors' products; disaggregate satisfaction to reflect better the performance of employee groups, and, when different customer segments have different switching costs or they vary in the precision with which their satisfaction can be measured, then measure the segments separately and assign different weights in the incentive plan. Throughout the paper we interpret the formal results based on our experience with actual firms and the current literature. We close with a brief discussion of on-going research at field sites.","authors":["Birger Wernerfelt","John Hauser","Duncan I. Simester"],"meta":["November 1994Marketing Science 13(4):327-350","DOI:10.1287/mksc.13.4.327","SourceRePEc"],"references":["329820691_A_Dynamic_Process_Model_of_Service_Quality_From_Expectations_to_Behavioral_Intentions","329819394_An_Investigation_into_the_Determinants_of_Customer_Satisfaction","329445977_Models_of_Consumer_Satisfaction_Formation_An_Extension","329256588_A_Cognitive_Model_of_the_Antecedents_and_Consequences_of_Satisfaction_Decisions","329055356_A_Longitudinal_Analysis_of_the_Impact_of_Service_Changes_on_Customer_Attitudes","323322180_Investment_in_human_capital","316249304_Decisions_with_Multiple_Objectives_--_Preferences_and_Value_Tradeoffs","313553955_Intrapersonal_affective_influences_on_consumer_satisfaction_with_products","313058521_A_Longitudinal_Assessment_of_Consumer_SatisfactionDissatisfaction_The_Dynamic_Aspect_of_the_Cognitive_Process","296540025_Quality_as_a_board_game","295388992_Law_of_producing_quality","294480606_Using_competitive_benchmarking_to_set_goals","274921303_Continuous_Improvement_Quality_Control_Circles_in_Japanese_Industry","271789926_The_Vicious_Circle_of_Consumer_Complaints","271651825_Why_Improving_Quality_Doesn't_Improve_Quality_Or_Whatever_Happened_to_Marketing"]}