{"id":"227390163_Discrete_Choice_Methods_With_Simulation","abstract":"This book describes the new generation of discrete choice methods, focusing on the many advances that are made possible by simulation. Researchers use these statistical methods to examine the choices that consumers, households, firms, and other agents make. Each of the major models is covered: logit, generalized extreme value, or GEV (including nested and cross-nested logits), probit, and mixed logit, plus a variety of specifications that build on these basics. Simulation-assisted estimation procedures are investigated and compared, including maximum simulated likelihood, method of simulated moments, and method of simulated scores. Procedures for drawing from densities are described, including variance reduction techniques such as anithetics and Halton draws. Recent advances in Bayesian procedures are explored, including the use of the Metropolis-Hastings algorithm and its variant Gibbs sampling. No other book incorporates all these fields, which have arisen in the past 20 years. The procedures are applicable in many fields, including energy, transportation, environmental studies, health, labor, and marketing.","authors":["Kenneth E. Train"],"meta":["January 2009","DOI:10.1017/CBO9780511805271","SourceRePEc","ISBN: 9780521766555"],"references":["254287562_Modeling_Household_Purchase_Behavior_with_Logistic_Normal_Regression","313697568_Mixed_logit_models_for_recreation_demand","285722975_Accommodating_variations_in_responsiveness_to_level-of-service_variables_in_travel_mode_choice_models","280686398_Multinomial_probit_estimation_of_spa_tiall_y_interdependent_choices_An_empirical_comparison_of_two_new_techniques","279972875_A_Bayesian_Lifetime_Model_for_the_Hot_100_Billboard_Songs","274420837_An_Investigation_of_the_Accuracy_of_the_Clark_Approximation_for_the_Multinomial_Probit_Model","268688503_On_the_convergence_properties_of_the_EM_algorithm","265585217_Bayesian_analysis_of_the_multinomial_probit_model","263252246_Monte_Carlo_Evaluations_of_Multivariate_Normal_Probabilities","256509672_Estimating_tree_logit_models"]}