{"id":"227446072_Modeling_Managerial_Behavior_Misperceptions_of_Feedback_in_a_Dynamic_Decision_Making_Experiment","abstract":"Studies in the psychology of individual choice have identified numerous cognitive and other bounds on human rationality, often producing systematic errors and biases. Yet for the most part models of aggregate phenomena in management science and economics are not consistent with such micro-empirical knowledge of individual decision-making. One explanation has been the difficulty of extending the experimental methods used to study individual decisions to aggregate, dynamic settings. This paper reports an experiment on the generation of macrodynamics from microstructure in a common managerial context. Subjects manage a simulated inventory distribution system which contains multiple actors, feedbacks, nonlinearities, and time delays. The interaction of individual decisions with the structure of the simulated firm produces aggregate dynamics which systematically diverge from optimal behavior. An anchoring and adjustment heuristic for stock management is proposed as a model of the subjects' decision processes. Econometric tests show the rule explains the subjects' behavior well. The estimation results identify several `misperceptions of feedback' which account for the poor performance of the subjects. In particular, subjects are shown to be insensitive to the feedbacks from their decisions to the environment. Finally, the generality of the results is considered and implications for behavioral theories of aggregate social and economic dynamics are explored.","authors":["John Sterman"],"meta":["March 1989Management Science 35(3):321-339","DOI:10.1287/mnsc.35.3.321","SourceRePEc"],"references":["242544497_A_System_Pathology_of_an_Organization_The_Rise_and_Fall_of_the_Old_Saturday_Evening_Post","227445535_The_Natural_Logic_of_Management_Policy_Making_Its_Implications_for_the_Survival_of_an_Organization","232474564_Linear_Regression_and_Process-Tracing_Models_of_Judgment","232323176_Systems_Analysis_and_Dynamic_Decision_Making","227712718_Expectation_Formation_in_Behavioral_Simulation_Models","227447839_Consistency_and_Optimality_in_Managerial_Decision_Making","227445648_Rationality_in_the_Analysis_of_Behavioral_Simulation_Models","227445632_Cognitive_Heuristics_and_Feedback_in_a_Dynamic_Decision_Environment","227444811_Testing_Bowman's_Managerial_Coefficient_Theory_Using_a_Competitive_Gaming_Environment","223670697_A_Behavioral_Model_of_the_Economic_Long_Wave"]}