{"id":"227490179_A_FUZZY_DECISION_MAKING_APPROACH_IN_EVALUATING_FERRY_SERVICE_QUALITY","abstract":"The service quality evaluation is undeniably important especially in highly competitive service related industry. However, service quality evaluation is not always straightforward as criteria in evaluation and customer perceptions toward services are intangible measures. This paper presents a fuzzy multi-criteria decision making approach for evaluating the service quality of ferry that transport customers between the mainland of Peninsular Malaysia and a tourist spot island. Service quality is a composite of various criteria, among them many criteria are intangible and difficult to measure. Fuzzy numbers and linguistic level based on fuzzy sets theory as a method to overcome vaguely judgment in evaluation. The crisp survey results were collected via a ten-service criteria questionnaire from eighty seven customers and computed using Best non-Fuzzy Performance and Degree of Similarity. Based on the concept of the defuzzification, the ranking of service performance is obtained. Degree of Similarity provides the level of satisfaction and its degrees for each criterion. The criterion of ‘service efficiency of ferry personnel’ was the first in the ranking. All the criteria received ‘good’ and ‘very good’ for the level of satisfaction. These evaluation results facilitate the ferry operator to upgrade its ferry services and eventually meet its customers’ needs.","authors":["Lazim Abdullah","Nurhanadia WAHAB"],"meta":["January 2010Knowledge Management Research & Practice 2(1):94-107","SourceRePEc"],"references":["270456323_A_Longitudinal_Analysis_of_the_Impact_of_Service_Changes_on_Customer_Attitudes","267067828_Fuzzy_Set_Theory_-_and_Its_Applications","247230484_Tourism_service_quality_begins_at_the_airport","239036949_Jennings_Negotiation_Decision_Functions_for_Autonomous_Agents","235262515_Analysing_service_quality_in_the_hospitality_industry","285691766_Measuring_Service_Quality_in_Scheduled_Bus_Services","283249055_Measuring_teachers'_beliefs_about_mathematics_A_fuzzy_set_approach","271778332_Understanding_How_Product_Attributes_Influence_Product_Categorization_Development_and_Validation_of_Fuzzy_Set-Based_Measures_of_Gradedness_in_Product_Categories","247495680_Service_Management_and_Marketing_Managing_the_Moments_of_Truth_in","245506298_Service_Quality_Concepts_and_Models"]}