{"id":"227441281_Sustainable_consumption_and_the_UK's_leading_retailers","abstract":"Purpose\n– The purpose of this paper is to offer an exploratory case study of how the UK’s leading retailers are addressing sustainable consumption.\n\nDesign/methodology/approach\n– The paper begins with a discussion of the growing awareness of the importance of sustainable consumption and of the role that retailers can play in promoting more sustainable patterns of consumption. This is followed by a short literature review of current thinking on sustainable consumption. The paper draws its empirical information from the top ten UK retailers’ corporate websites and from an observational survey conducted in these retailers’ largest stores in the town of Cheltenham in the UK. The paper concludes with some reflections on how the UK’s leading retailers are addressing sustainable consumption and on how the concept fits into their business models.\n\nFindings\n– The findings reveal that the UK’s top ten retailers make very limited public corporate commitments to sustainable consumption and that while some of these retailers were offering customers some information which might encourage more sustainable shopping behaviour, such information was systematically undermined by marketing messages which were designed to encourage rather than restrict consumption. More critically the paper concludes that the leading retailers’ commitments to sustainable consumption are couched within existing business models centred on continuing growth and that as such they are effectively ignoring the fact that present levels of consumption are not sustainable.\n\nOriginality/value\n– This paper provides an accessible review of the extent to which the UK’s leading food retailers are addressing sustainable consumption and communicating sustainable consumption agendas to their customers within stores, and, as such, it will be of value to academics, practitioners, consumer organizations and policymakers interested in the role retailers can play in promoting sustainable consumption.","authors":["Peter Jones","Daphne Comfort","Gerald Robin Bown","David Hillier"],"meta":["November 2010World Review of Entrepreneurship Management and Sustainable Development 6(3):244-259","DOI:10.1504/WREMSD.2010.036678","SourceRePEc"],"references":["247739202_The_Sustainability_of_Sustainable_Consumption","240739022_Geographies_of_consumption_The_work_of_consumption","235356516_Competing_Discourses_of_Sustainable_Consumption_Does_the_Rationalisation_of_Lifestyles_Make_Sense","233203667_The_international_political_economy_of_unsustainable_consumption_and_the_global_financial_collapse","294644951_Corporate_social_responsibility_CSR_reporting_and_the_WWW_Increasingly_entwined","279617575_How_Europe's_retail_sector_helps_promote_sustainable_production","249871748_The_besieged_body_Geographies_of_retailing_and_consumption","249701891_Sustainable_Development_Mainstream_and_Critical_Perspectives","241721615_Readings_in_Sustainable_Consumption","228431484_Embedding_corporate_responsibility_The_development_of_a_transformational_model_of_organizational_innovation"]}