{"id":"227446117_User_Acceptance_of_Computer_Technology_A_Comparison_of_Two_Theoretical_Models","abstract":"Computer systems cannot improve organizational performance if they aren't used. Unfortunately, resistance to end-user systems by managers and professionals is a widespread problem. To better predict, explain, and increase user acceptance, we need to better understand why people accept or reject computers. This research addresses the ability to predict peoples' computer acceptance from a measure of their intentions, and the ability to explain their intentions in terms of their attitudes, subjective norms, perceived usefulness, perceived ease of use, and related variables. In a longitudinal study of 107 users, intentions to use a specific system, measured after a one-hour introduction to the system, were correlated 0.35 with system use 14 weeks later. The intention-usage correlation was 0.63 at the end of this time period. Perceived usefulness strongly influenced peoples' intentions, explaining more than half of the variance in intentions at the end of 14 weeks. Perceived ease of use had a small but significant effect on intentions as well, although this effect subsided over time. Attitudes only partially mediated the effects of these beliefs on intentions. Subjective norms had no effect on intentions. These results suggest the possibility of simple but powerful models of the determinants of user acceptance, with practical value for evaluating systems and guiding managerial interventions aimed at reducing the problem of underutilized computer technology.","authors":["Fred D. Davis","Richard P. Bagozzi","Paul R. Warshaw"],"meta":["August 1989Management Science 35(8):982-1003","DOI:10.1287/mnsc.35.8.982","SourceRePEc"],"references":["298348626_The_Theory_of_Reasoned_Action_A_Meta-Analysis_of_Past_Research_with_Recommendations_for_Modifications_and_Future_Research","329819488_A_Field_Investigation_of_Causal_Relations_among_Cognitions_Affect_Intentions_and_Behavior","329261403_Predicting_Purchase_and_Other_Behaviors_from_General_and_Contextually_Specific_Intentions","324381904_Implementing_Operations_ResearchManagement_Science","315361015_Variations_in_Decision_Makers'_Use_of_Information_Sources_The_Impact_of_Quality_and_Accessibility_of_Information","313069741_Organizational_context_user_involvement_and_the_usefulness_of_information_systems","304534338_Understanding_Attitudes_and_Predicting_Social_Behavior","296671845_Intrinsic_and_Extrinsic_Motivation","280797526_Why_interactive_computer_systems_are_sometimes_not_used_by_people_who_might_benefit_from_them","271778328_A_Field_Investigation_of_Causal_Relations_among_Cognitions_Affect_Intentions_and_Behavior"]}