{"id":"227445544_Some_Models_for_Estimating_Technical_and_Scale_Efficiency_in_Data_Envelopment_Analysis","abstract":"In management contexts, mathematical programming is usually used to evaluate a collection of possible alternative courses of action en route to selecting one which is best. In this capacity, mathematical programming serves as a planning aid to management. Data Envelopment Analysis reverses this role and employs mathematical programming to obtain ex post facto evaluations of the relative efficiency of management accomplishments, however they may have been planned or executed. Mathematical programming is thereby extended for use as a tool for control and evaluation of past accomplishments as well as a tool to aid in planning future activities. The CCR ratio form introduced by Charnes, Cooper and Rhodes, as part of their Data Envelopment Analysis approach, comprehends both technical and scale inefficiencies via the optimal value of the ratio form, as obtained directly from the data without requiring a priori specification of weights and/or explicit delineation of assumed functional forms of relations between inputs and outputs. A separation into technical and scale efficiencies is accomplished by the methods developed in this paper without altering the latter conditions for use of DEA directly on observational data. Technical inefficiencies are identified with failures to achieve best possible output levels and/or usage of excessive amounts of inputs. Methods for identifying and correcting the magnitudes of these inefficiencies, as supplied in prior work, are illustrated. In the present paper, a new separate variable is introduced which makes it possible to determine whether operations were conducted in regions of increasing, constant or decreasing returns to scale (in multiple input and multiple output situations). The results are discussed and related not only to classical (single output) economics but also to more modern versions of economics which are identified with \"contestable market theories.\"","authors":["Rajiv D. Banker","CHARNES A.W.","William W. Cooper"],"meta":["September 1984Management Science 30(9):1078-1092","DOI:10.1287/mnsc.30.9.1078","SourceRePEc"],"references":["243764095_The_Measurement_of_Productive_Efficiency","227445140_Evaluating_Program_and_Managerial_Efficiency_An_Application_of_Data_Envelopment_Analysis_to_Program_Follow_Through","222443692_Measuring_The_Efficiency_of_Decision_Making_Units","24092765_The_Measurement_of_Productive_Efficiency_A_Reconsideration","23793115_Transforms_and_approximations_in_cost_and_production_function_relations"]}