{"id":"227548200_The_impact_of_direct_and_indirect_bullying_on_mental_and_physical_health_of_Italian_youngsters","abstract":"The aim of the present study was to determine the extent to which direct and indirect bullying and victimization at school affects the mental and physical health of 661 Italian boys and girls, aged 11 to 15 years old. The impact of bullying and victimization is assessed by taking into account the relative buffering effect of a positive relationship with one or both parents. Internalizing symptoms such as withdrawn behaviors, somatic complaints, and anxiety and depression, measured with the self-administered Youth Form of the Achenbach's Child Behavioral Checklist, are indicators of maladjustment. Multiple regression analyses revealed that being a girl is a strong significant risk factor for all internalizing symptoms. Being a victim of indirect bullying is the strongest predictor of withdrawn behaviors, somatic complaints, and anxiety/depression, independent of direct victimization, which significantly predicts somatic complaints, anxiety, and depression, but not withdrawn behaviors. Bullying others directly by hitting, threatening, or calling names is not a significant predictor the poor mental and somatic health of youngsters, whereas indirect bullying (spreading rumors or not talking to someone on purpose) does significantly predict anxiety and depression, as well as withdrawn behaviors. The negative impact of victimization and bullying is buffered by youngsters' positive relationship with one or both parents. Recommendations are provided with regard to possible intervention strategies underlying the importance of distinguishing between different forms of bullying and victimization and providing social support in each different case. Aggr. Behav. 30:343–355, 2004. © 2004 Wiley-Liss, Inc.","authors":["Anna Costanza Baldry"],"meta":["October 2004Aggressive Behavior 30(5):343 - 355","DOI:10.1002/ab.20043","Project: Bullying and cyberbullying: risk and protective factors"],"references":["272160328_The_Nature_of_School_Bullying_A_Cross_National_Perspective","246881750_Do_girls_manipulate_and_boys_fight_Develpmental_trends_in_regard_to_direct_and_indirect_aggression","245539191_Indirect_Aggression_in_Boys_and_Girls","307981760_Relational_and_overt_forms_of_peer_victimization_A_multiinformant_approach","270095000_Bullying_at_School_-_What_We_Know_and_What_We_Can_Do","258129620_Maltreatment_by_Parents_and_Peers_The_Relationship_between_Child_Abuse_Bully_Victimization_and_Psychological_Distress","248203955_Understanding_and_Preventing_Bullying","247718308_Bullying_among_Italian_Middle_School_Students_Combining_Methods_to_Understand_Aggressive_Behaviours_and_Victimization","245539337_Do_Girls_Manipulate_and_Boys_Fight_Developmental_Trends_in_Regard_to_Direct_and_Indirect_Aggression","239665596_Manual_JOT_the_Child_Behavior_Checklist_and_Revised_Child_Behavior_Profiles","237885746_A_Survey_of_the_Nature_and_Extent_of_BullyVictim_Problems_in_JuniorMiddle_and_Secondary_Schools","232417971_Aggression_in_the_schools_Bullies_and_whipping_boys","230015265_Aggression_and_Bullying","229965156_Parenting_influences_on_bullying_and_victimization","228019267_Guess_what_I_just_heard_Indirect_aggression_among_teenage_girls_in_Australia"]}