{"id":"227697328_Correspondence_analysis","abstract":"Correspondence analysis (CA) is a method of data visualization that is applicable to cross-tabular data such as counts, compositions, or any ratio-scale data where relative values are of interest. All the data should be on the same scale and the row and column margins of the table must make sense as weighting factors because the analysis gives varying importance to the respective rows and columns according to these margins. This method is one of a large class of methods based on the singular value decomposition and can be considered as the equivalent of principal component analysis for categorical and ratio-scale data or as a pair of classical scalings of the rows and columns based on their interpoint χ2 distances, using the margins as weights. For categorical data, this method generalizes to multiple CA, a popular method for analyzing questionnaire data. A linearly constrained form of CA, canonical CA, is extensively used in ecological research where species abundance data at various sampling points are visualized subject to being linearly related to environmental variables measured at the same locations. When certain parameters are introduced into its definition, CA has been shown to have limiting cases of unweighted and weighted log-ratio analysis (the latter also known as the spectral map), as well as classical multidimensional scaling. Copyright © 2010 John Wiley & Sons, Inc.\nFor further resources related to this article, please visit the WIREs website.","authors":["Michael Greenacre"],"meta":["September 2010Wiley Interdisciplinary Reviews: Computational Statistics 2(5):613 - 619","DOI:10.1002/wics.114","Project: Correspondence analysis"],"references":["37762729_Subset_Correspondence_Analysis_Visualizing_Relationships_Among_a_Selected_Set_of_Response_Categories_From_a_Questionnaire_Survey","26469582_Correspondence_Analysis_in_R_with_Two_and_Three-dimensional_Graphics_The_ca_Package","344485170_Correspondence_Analysis_and_Data_Coding_with_Java_and_R","265682017_Correspondence_Analysis_in_Practice","229893278_An_equivalence_relation_between_correspondence_analysis_and_classical_metric_multidimensional_scaling_for_the_recovery_of_Euclidean_distances","46494085_Power_transformations_in_correspondence_analysis","23695669_Distributional_Equivalence_and_Subcompositional_Coherence_in_the_Analysis_of_Contingency_Tables_Ratio-Scale_Measurements_and_Compositional_Data","4914334_Biplots_of_Compositional_Data","4762133_Correspondence_Analysis_in_Practice_Second_Edition_by_Michael_Greenacre"]}