{"id":"227691013_Probabilistic_Linkage_of_Large_Public_Health_Data_Files","abstract":"Probabilistic linkage technology makes it feasible and efficient to link large public health databases in a statistically justifiable manner. The problem addressed by the methodology is that of matching two files of individual data under conditions of uncertainty. Each field is subject to error which is measured by the probability that the field agrees given a record pair matches (called the m probability) and probabilities of chance agreement of its value states (called the u probability). Fellegi and Sunter pioneered record linkage theory. Advances in methodology include use of an EM algorithm for parameter estimation, optimization of matches by means of a linear sum assignment program, and more recently, a probability model that addresses both m and u probabilities for all value states of a field. This provides a means for obtaining greater precision from non-uniformly distributed fields, without the theoretical complications arising from frequency-based matching alone. The model includes an interative parameter estimation procedure that is more robust than pre-match estimation techniques. The methodology was originally developed and tested by the author at the U.S. Census Bureau for census undercount estimation. The more recent advances and a new generalized software system were tested and validated by linking highway crashes to Emergency Medical Service (EMS) reports and to hospital admission records for the National Highway Traffic Safety Administration (NHTSA).","authors":["Matthew A. Jaro"],"meta":["March 1995Statistics in Medicine 14(5‐7):491 - 498","DOI:10.1002/sim.4780140510"],"references":["240319386_UNIMATCH_a_computer_system_for_generalized_record_linkage_under_conditions_of_uncertainty","239563023_Advances_in_Record-Linkage_Methodology_as_Applied_to_Matching_the_1985_Census_of_Tampa_Florida","228057942_A_Theory_for_Record_Linkage","221995817_Maximum_Likelihood_from_Incomplete_Data_Via_EM_Algorithm","220425400_Record_linkage_making_maximum_Use_of_the_discriminating_power_of_identifying_information","215721461_Maximum_Likelihood_From_Incomplete_Data_Via_The_EM_algorithm"]}