{"id":"227615889_Collaborative_Public_Space_in_A_National_Innovation_System_A_Case_Study_of_the_Israeli_Military's_Impact_on_the_Software_Industry","abstract":"Both systems of innovation and cluster theories emphasize the importance of institutions that facilitate learning and information diffusion as well as community building for the continuous success of industrial systems. Nevertheless, they fail to combine their insights into a general system-level understanding. In order to fill this gap the concept of collaborative public space (CPS) is defined. It is then used to analyze the Israeli military's role within the Israeli IT industry, employing the case study method to analyze a specific section of the military—MAMRAM—the main programming, software engineering, and computer users training unit. The paper's main findings are that, contrary to the commonly argued view, which sees the military mainly as a supplier of factors of production such as high skilled labor, or technological spin-offs, the military has been playing a critical role in the continuing success of the high-tech industry by providing it with a CPS. The military acts as an important center of information gathering, processing, and dissemination for the Israeli software innovation system, as the originator and strengthener of many social networks, and as the connecting node between various weakly tied social networks.","authors":["Dan Breznitz"],"meta":["March 2005Industry and Innovation 12(1):31-64","DOI:10.1080/1366271042000339058","SourceRePEc"],"references":["312412640_Historical_Institutionalism","344550596_Historical_institutionalism_in_comparative_politics","344495189_The_Associational_Economy","333019337_Governing_the_Market_Economic_Theory_and_the_Role_of_Government_in_East_Asian_Industrialization","332102310_Embedded_Autonomy_States_and_Industrial_Transformation","324411354_Military_Enterprise_and_Technological_Change_Perspectives_on_the_American_Experience","324391525_Regional_Advantage_Culture_and_Competition_in_Silicon_Valley_and_Route_128","324290289_Institutions_Institutional_Change_and_Economic_Performance","317600070_The_New_Institutionalism_in_Organizational_Analysis","313728041_Israel's_Silicon_Wadi_The_Forces_behind_Cluster_Formation"]}