{"id":"227685959_Data_Analysis_in_Combinatorial_Experiments_Applying_Supervised_Principal_Component_Technique_to_Investigate_the_Relationship_Between_ToF-SIMS_Spectra_and_the_Composition_Distribution_of_Ternary_Metall","abstract":"We apply a semi-supervised technique called Supervised Principal Component (SPC) to explore the relationship between the composition of a thin film combinatorial library and the peaks of Time-Of-Flight Secondary Ion Mass Spectrometry (ToF-SIMS) spectra acquired from the library. SPC is first used to select a subset of the available multivariate features (the peak intensities of the ToF-SIMS spectra) based on their association with the outcome variable (the elemental concentration of the thin film samples). Next, using only the selected features, SPC creates optimal linear models which map the ToF-SIMS data onto the composition data. The models for the first two of the considered elemental concentrations use only eight of the 55 available ToF-SIMS peaks, making interpretation of the model much simpler than for a model which uses all 55 available peaks. The percentage of explained variance (R2) in concentration data is in both cases about 0.80. These results are obtained during the model validation phase, performed on test data, which are exclusively used for this purpose. The model for the third considered element did not produce significant results due to the poor variability of the dataset. This work illustrates for the first time that using a multivariate analysis technique, one can establish the relationship between ToF-SIMS measurements and stoichiometric data in a combinatorial experiment. More generally, the described feature selection approach provides an example of how combinatorial experiments can be useful for accelerating the understanding of the chemical–physical behaviors under investigation.","authors":["Rossana Dell'Anna","Paolo Lazzeri","Roberto Canteri","Christian J. Long"],"meta":["February 2008QSAR & Combinatorial Science 27(2):171 - 178","DOI:10.1002/qsar.200740008"],"references":["228655277_Data_management_and_visualization_of_x-ray_diffraction_spectra_from_thin_film_ternary_composition_spreads","228438987_Combinatorial_Investigation_of_Ferromagnetic_Shape-Memory_Alloys_in_the_Ni-Mn-Al_Ternary_System_Using_a_Composition_Spread_Technique","215581620_Corrosion_behaviour_of_amorphous_Ti48Cu52_Ti50Cu50_and_Ti60Ni40_alloys_investigated_by_potentiodynamic_polarization_method","10877061_Identification_of_Novel_Compositions_of_Ferromagnetic_Shape-Memory_Alloys_Using_Composition_Spreads","8608572_Semi-Supervised_Methods_to_Predict_Patient_Survival_from_Gene_Expression_Data","4742165_Prediction_by_Supervised_Principal_Components","263776260_In_Multivariate_Calibration","240949364_Time-of-flight_SIMS_study_of_heterogeneous_catalysts_based_on_praseodymium_and_molybdenum_oxides","221999621_Partial_Least-Squares_Regression_A_Tutorial"]}