{"id":"228078264_An_overview_of_full-waveform_inversion_in_exploration_geophysics","abstract":"Full-waveform inversion (FWI) is a challenging data-fitting procedure based on full-wavefield modeling to extract quantitative information from seismograms. High-resolution imaging at half the propagated wavelength is expected. Recent advances in high-performance computing and multifold/multicomponent wide-aperture and wide-azimuth acquisitions make 3D acoustic FWI feasible today. Key ingredients of FWI are an efficient forward-modeling engine and a local differential approach, in which the gradient and the Hessian operators are efficiently estimated. Local optimization does not, however, prevent convergence of the misfit function toward local minima because of the limited accuracy of the starting model, the lack of low frequencies, the presence of noise, and the approximate modeling of the wave-physics complexity. Different hierarchical multiscale strategies are designed to mitigate the nonlinearity and ill-posedness of FWI by incorporating progressively shorter wavelengths in the parameter space. Synthetic and real-data case studies address reconstructing various parameters, from V(P) and V(S) velocities to density, anisotropy, and attenuation. This review attempts to illuminate the state of the art of FWI. Crucial jumps, however, remain necessary to make it as popular as migration techniques. The challenges can be categorized as (1) building accurate starting models with automatic procedures and/or recording low frequencies, (2) defining new minimization criteria to mitigate the sensitivity of FWI to amplitude errors and increasing the robustness of FWI when multiple parameter classes are estimated, and (3) improving computational efficiency by data-compression techniques to make 3D elastic FWI feasible.","authors":["Jean Virieux","Stéphane Operto"],"meta":["November 2009Geophysics 74:WCC1-WCC26","DOI:10.1190/1.3238367"],"references":["318081482_Semblance_and_differential_semblance_optimisation_for_waveform_tomography_A_frequency_domain_implementation","321605727_Seismic_Tomography_With_Applications_in_Global_Seismology_and_Exploration_Geophysics","318081720_Waveform_tomography_of_marine_seismic_data_What_can_limited_offset_offer","318081715_Combining_wave-equation_imaging_with_travel-time_tomography_to_from_high-reso1ution_images_from_cross-hole_data","318081624_Seismic_Waveform_Tomography-the_Effect_of_Layering_and_Anisotropy","318081617_Two-dimensional_velocity_models_from_wide-angle_seismic_data_by_wavefield_inversion","317776229_New_Trends_in_Identification_of_Distributed_Parameter_Systems","312469788_Quantitative_seismology-theory_and_methods","308394097_Seismic_Wave_Propagation_In_Stratified_Media","308306312_Note_sur_la_convergence_de_methode_de_directions_conjugueesJ"]}