{"id":"228089502_Topographical_Analysis_of_the_Subependymal_Zone_Neurogenic_Niche","abstract":"The emerging model for the adult subependymal zone (SEZ) cell population indicates that neuronal diversity is not generated from a uniform pool of stem cells but rather from diverse and spatially confined stem cell populations. Hence, when analysing SEZ proliferation, the topography along the anterior-posterior and dorsal-ventral axes must be taken into account. However, to date, no studies have assessed SEZ proliferation according to topographical specificities and, additionally, SEZ studies in animal models of neurological/psychiatric disorders often fail to clearly specify the SEZ coordinates. This may render difficult the comparison between studies and yield contradictory results. More so, by focusing in a single spatial dimension of the SEZ, relevant findings might pass unnoticed. In this study we characterized the neural stem cell/progenitor population and its proliferation rates throughout the rat SEZ anterior-posterior and dorsal-ventral axes. We found that SEZ proliferation decreases along the anterior-posterior axis and that proliferative rates vary considerably according to the position in the dorsal-ventral axis. These were associated with relevant gradients in the neuroblasts and in the neural stem cell populations throughout the dorsal-ventral axis. In addition, we observed spatially dependent differences in BrdU/Ki67 ratios that suggest a high variability in the proliferation rate and cell cycle length throughout the SEZ; in accordance, estimation of the cell cycle length of the neuroblasts revealed shorter cell cycles at the dorsolateral SEZ. These findings highlight the need to establish standardized procedures of SEZ analysis. Herein we propose an anatomical division of the SEZ that should be considered in future studies addressing proliferation in this neural stem cell niche.","authors":["Ana Mendanha Falcão","Joana Almeida Palha","Ana Catarina Ferreira","Fernanda Marques"],"meta":["June 2012PLoS ONE 7(6):e38647","DOI:10.1371/journal.pone.0038647","SourcePubMed"],"references":["223914751_Adult_Neurogenesis_and_the_Olfactory_System","51807053_Prospective_isolation_of_adult_neural_stem_cells_from_the_mouse_subependymal_zone","341381308_The_Ki-67_protein_From_the_known_and_the_unknown","289546792_The_rat_brain_in_stereotaxic_coordinates_3rd_edn_San_Diego_academic_press","271828452_The_Rat_Brain_Stereotaxic_Co-Ordinates","248768871_The_Ki-67_protein_From_the_known_and_the_unknown","238326598_Regulation_of_NIH-3T3_cell_G_1_phase_transit_by_serum_during_exponential_growth","229910396_Architecture_and_cell_types_of_the_adult_subventricular_zone_In_search_of_the_stem_cells","51060121_Cdk2_loss_accelerates_precursor_differentiation_and_remyelination_in_the_adult_central_nervous_system","50374069_Restrictions_in_time_and_space-New_insights_into_generation_of_specific_neuronal_subtypes_in_the_adult_mammalian_brain"]}