{"id":"228247192_The_Theory_of_Economic_Development_An_Inquiry_Into_Profits_Capital_Credit_Interest_and_the_Business_Cycle","abstract":"Schumpeter first reviews the basic economic concepts that describe the recurring economic processes of a commercially organized state in which private property, division of labor, and free competition prevail. These constitute what Schumpeter calls \"the circular flow of economic life,\" such as consumption, factors and means of production, labor, value, prices, cost, exchange, money as a circulating medium, and exchange value of money. The principal focus of the book is advancing the idea that change (economic development) is the key to explaining the features of a modern economy. Schumpeter emphasizes that his work deals with economic dynamics or economic development, not with theories of equilibrium or \"circular flow\" of a static economy, which have formed the basis of traditional economics. Interest, profit, productive interest, and business fluctuations, capital, credit, and entrepreneurs can better be explained by reference to processes of development. A static economy would know no productive interest, which has its source in the profits that arise from the process of development (successful execution of new combinations). The principal changes in a dynamic economy are due to technical innovations in the production process. Schumpeter elaborates on the role of credit in economic development; credit expansion affects the distribution of income and capital formation. Bank credit detaches productive resources from their place in circular flow to new productive combinations and innovations. Capitalism inherently depends upon economic progress, development, innovation, and expansive activity, which would be suppressed by inflexible monetary policy. The essence of development consists in the introduction of innovations into the system of production. This period of incorporation or adsorption is a period of readjustment, which is the essence of depression. Both profits of booms and losses from depression are part of the process of development. There is a distinction between the processes of creating a new productive apparatus and the process of merely operating it once it is created. Development is effected by the entrepreneur, who guides the diversion of the factors of production into new combinations for better use; by recasting the productive process, including the introduction of new machinery, and producing products at less expense, the entrepreneur creates a surplus, which he claims as profit. The entrepreneur requires capital, which is found in the money market, and for which the entrepreneur pays interest. The entrepreneur creates a model for others to follow, and the appearance of numerous new entrepreneurs causes depressions as the system struggles to achieve a new equilibrium. The entrepreneurial profit then vanishes in the vortex of competition; the stage is set for new combinations. Risk is not part of the entrepreneurial function; risk falls on the provider of capital. (TNM)","authors":["Joseph Alois Schumpeter"],"meta":["January 1934"],"references":[]}