{"id":"228242264_Cybercrime_Media_and_Insecurity_The_Shaping_of_Public_Perceptions_of_Cybercrime","abstract":"All too often claims about the prevalence of cybercrimes lack clarification as to what it is that is particularly \"cyber\" about them. Perhaps more confusing is the startling contrast between the many hundreds of thousands of incidents of cybercrime supposedly reported each year and the relatively small number of known prosecutions. This contrasting evidence exposes a large gap in our understanding of cybercrime and begs a number of important questions about the quality of the production of criminological knowledge about it. For example, how reliable and partial are the informational sources that mould our opinions about cybercrime. Do we fully understand the epistemological differences between the various legal, academic, expert and popular (lay) constructions of cybercrime? Alternatively, is the criminal justice system just woefully inefficient at bringing wrongdoers to justice? Or are there still some major questions to be answered about the conceptual basis upon which information is gathered and assumptions about cybercrime made? This article takes a critical look at the way that public perceptions of cybercrime are shaped and insecurities about it are generated. It explores the varying conceptualisations of cybercrime before identifying tensions in the production of criminological knowledge that are causing the rhetoric to be confused with reality. It then contrasts the mythology of cybercrime with what is actually going on in order to understand the reassurance gap that has opened up between public demands for Internet security and its provision.","authors":["David S. Wall"],"meta":["April 2008International Review of Law Computers & Technology 22(1)","DOI:10.1080/13600860801924907"],"references":["268264903_Fraud_and_technology_Crimes_findings_from_the_200203_British_Crime_Survey_and_2003_Offending_Crime_and_Justice_Survey","228198960_Organized_Cybercrime_How_Cyberspace_May_Affect_the_Structure_of_Criminal_Relationships","222274407_The_future_for_the_policing_of_cybercrime","284903518_Security_Breaches_Survey","258130653_Reinventing_Tradition_Reassurance_Neighbourhood_Security_and_Policing","254620703_Information_Security_Breaches","248944105_The_Culture_of_Control","239592885_End-to-end_atgments_in_system_desi","235360885_The_Consumer_Society_Myths_and_Structures","228213463_The_Myth_of_the_Superuser_Fear_Risk_and_Harm_Online"]}