{"id":"228234113_Location_Location_Location_An_Analysis_of_Profitability_of_Position_in_Online_Advertising_Markets","abstract":"Sponsored search accounts for 40% of the total online advertising market. These ads appear as ordered lists along with the regular search results in search engine results pages. The conventional wisdom in the industry is that the top position is the most desirable position for advertisers. This has led to intense competition among advertisers to secure the top positions in the results pages.We evaluate the impact of ad placement on revenues and profits generated from sponsored search using data from for several hundred keywords from the ad campaign of an online retailer. Using a hierarchical Bayesian model, we measure the impact of ad placement on both click-through rate and conversion rate for these keywords. We find that while click through rate decreases with position, conversion rate first increases and then decreases with position. The net effect is that, contrary to conventional wisdom, the topmost position in sponsored search advertisements is not necessarily the revenue- or profit-maximizing position. Using a theoretical model we show that one potential driver of these results is the heterogeneity in search costs across consumers and the additional browsing cost incurred in evaluating products across multiple websites.Our results inform the advertising strategies of firms participating in sponsored search auctions and provide insight into consumer behavior in these environments. Specifically, they help correct a significant misunderstanding among advertisers regarding the value of the top position. Further, they reveal potential inefficiencies in present auction mechanisms used by the search engines.","authors":["Ashish Agarwal","Kartik Hosanagar","Michael D. Smith"],"meta":["November 2008Journal of Marketing Research 48(6)","DOI:10.2307/23142904"],"references":["270407192_The_Neglect_of_Prescreening_Information","247837315_E-Customization","235789886_Approximate_Bayesian_Inference_by_the_Weighted_Likelihood_Bootstrap","267421436_Atlas_R_Institute_The_Atlas_Rank_Report_How_Search_Engine_Rank_Impacts_Traffic","244956059_A_formal_analysis_of_search_auctions_including_predictions_on_click_fraud_and_bidding_tactics","237931720_Buying_Searching_or_Browsing_Differentiating_Between_Online_Shoppers_Using_In-Store_Navigational_Clickstream","235726165_An_Efficient_Method_of_Estimating_Seemingly_Unrelated_Regressions_and_Tests_of_Aggretion_Bias","228319667_From_Generic_to_Branded_A_Model_of_Spillover_in_Paid_Search_Advertising","228234045_An_Empirical_Analysis_of_Search_Engine_Advertising_Sponsored_Search_in_Electronic_Markets","227630446_Ordered_Search"]}