{"id":"228352789_The_Complexities_of_Effectively_Teaching_Client-Server_System_Development","abstract":"Developing real-world enterprise systems requires the integration of a number of complex technologies. The 2006 Model Curriculum for Graduate Degree Programs in Information Systems recognizes this need and recommends an integrated capstone experience directed toward helping the graduate student amalgamate the broad knowledge base required for successful development of enterprise systems. Conveying a practical knowledge of client-server systems development to com-puter and information systems graduate students can be challenging. In this paper, we summarize our approach to teaching and evaluation in masters' level client-server computing and software en-gineering courses and our methods for overcoming obstacles, and we report on some novel solutions submitted by our students to the course's final project. The grades on the final project correlated with performance on the more traditional assignments but the correlation was low, representing only 5% of the explained variance. We propose that traditional text and narrative assignments repre-sent a different skill set from client-server system development; therefore, the incorporation of both activities is beneficial to software skill development.","authors":["Richard M Stillman","Alan Peslak"],"meta":["January 2009Information Systems Education Journal 7(7)"],"references":["228949317_Teaching_Software_Engineering_Including_Integration_with_Other_Disciplines","228826228_Methodology_for_educating_information_systems_students_on_the_new_paradigm_of_Service-Oriented_Architecture_SOA_Technology","314813626_Performance_monitoring_of_java_applications","277433872_Describing_the_Elephant","237521559_Defining_the_Essential_Skill_and_Functional_Areas_of_Study_in_Information_Technology_as_Measured_by_a_Survey_of_Field_Professionals","234815376_Developing_and_enhancing_a_clientserver_programming_for_internet_applications_course","234792552_Integrating_role-play_into_software_engineering_courses","234761620_Teaching_software_development_by_example","228699767_Implementing_database_solutions_on_the_web_with_aspect-oriented_programming","228350669_Incorporating_Real_World_Projects_and_Emerging_Technologies_into_One_MIS_Capstone_Course"]}