{"id":"228365744_Digital_manufacturing_History_perspectives_and_outlook","abstract":"Digital manufacturing has been considered, over the last decade, as a highly promis-ing set of technologies for reducing product development times and cost as well as for addres-sing the need for customization, increased product quality, and faster response to the market. This paper describes the evolution of information technology systems in manufacturing, outlin-ing their characteristics and the challenges to be addressed in the future. Together with the digi-tal manufacturing and factory concepts, the technologies considered in this paper include computer-aided design, engineering, process planning and manufacturing, product data and life-cycle management, simulation and virtual reality, automation, process control, shopfloor scheduling, decision support, decision making, manufacturing resource planning, enterprise resource planning, logistics, supply chain management, and e-commerce systems. These tech-nologies are discussed in the context of the digital factory and manufacturing concepts.","authors":["George Chryssolouris","Dimitris Mavrikios","Nikolaos Papakostas","Dimitris Mourtzis"],"meta":["May 2009Proceedings of the Institution of Mechanical Engineers Part B Journal of Engineering Manufacture 223(5)","DOI:10.1243/09544054JEM1241"],"references":["264880486_MODERN_PRODUCTION_MONITORING_IN_AUTOMOTIVE_PLANTS","263495016_Digital_enterprise_technology_-_Defining_perspectives_and_research_priorities","344142424_Advanced_manufacturing_technologies_and_strategically_flexible_production","310802132_Manufacturing_Systems_Theory_and_Practice_2nd_Edition","304089399_Eliminate_bottlenecks_with_integrated_analysis_tools_in_eM-Plant","297906958_Digital_Mock-up_Process_Simulation","292979346_Modern_Automotive_Assembly_Technologies_Status_and_Outlook","292979288_Automotive_assembly_technologies_performance_and_limitations","263422914_Automation_of_the_Computer-Aided-Design-_Computer-Aided_Quality_Assurance_Process_Chain_in_Car_Body_Engineering","261588025_Constructing_virtual_environments_for_manufacturing_simulation"]}