{"id":"228344324_Assessing_participatory_GIS_for_community-based_natural_resource_management_Claiming_community_forests_in_Cameroon","abstract":"This paper critically reviews and analyses participatory GIS (PGIS) and participatory mapping applications within participatory spatial planning for community-based natural resource management in developing countries. There is an often implicit assumption that PGIS use is effective, in that it meets content needs, satisfies underlying local stakeholder interests and therefore is a tool for better governance. The analytical framework looks at participatory spatial planning performance with respect to key dimensions of governance, especially the intensity of community participation and empowerment, equity within communities and between 'governed' and 'governing', respect for indigenous knowledge, rights, ownership, legitimacy, and effectiveness. Specific development focus is given by a case study using participatory mapping and PGIS in community forest legitimization, planning and management in Tinto, Cameroon. 'Good governance' criteria are applied ex-post to the implementation procedures, the geo-information outputs, and the longer-term outcomes of the PGIS processes. Impacts of incorporating PGIS were examined in terms of the types and degrees of participation in the process; access to, and the uses made of, the geographic information; whether the information outputs met stakeholders' requirements; and the overall changes in equity and empowerment in the community. It was found that PGIS/participatory mapping processes contributed – positively, though not comprehensively – to good governance, by improving dialogue, redistributing resource access and control rights – though not always equitably – legitimizing and using local knowledge, exposing local stakeholders to geospatial analysis, and creating some actor empowerment through training. PGIS promoted empowerment by supporting community members' participation in decision-making and actions, and by enabling land use planning decisions beyond community forestry itself.","authors":["Michael Keith McCall","Peter A. Minang"],"meta":["January 2006Journal of the Royal Geographical Society of London 171(4):340-356","DOI:10.1111/j.1475-4959.2005.00173.x","Project: PGIS, Participatory Mapping, Local Spatial Knowledge, critical mapping, cartografia critica"],"references":["242735403_Assessing_Participatory_Geo_graphic_Information_Systems_for_Community_Forestry_Planning_in_Cameroon_A_Local_Governance_Perspective","238728124_The_Future_of_Participatory_Approaches_Using_Geographic_Information_developing_a_research_agenda_for_the_21_st_Century","238537649_Using_GIS_to_Produce_Community-Based_Maps_to_Promote_Collaborative_Natural_Resource_Management","335098106_Landscapes_of_the_Mind_Worlds_of_Sense_and_Metaphor","285037751_The_Role_of_Geographic_Information_Systems_in_American_Indian_Land_and_Water_Rights_Litigation","272791526_Geomatics_Who_Needs_It","271779372_A_Folk_Expert_System_Soils_Classification_in_the_Colca_Valley_Peru","250015948_GIS_Indigenous_Peoples_and_Epistemological_Diversity","246387781_How_and_Why_Community_Groups_Use_Maps_and_Geographic_Information","242377261_GIS_and_Society_The_Social_Implications_of_How_People_Space_and_Environment_Are_Represented_in_GIS"]}