{"id":"228319435_Developing_Theory_Through_Simulation_Methods","abstract":"Simulation is an important method, but its link to theory development remains unclear and even controversial. Our purpose is to clarify when and how to use simulation methods in theory development. First, we develop a roadmap for conducting theory development using simulation methods. It ranges from selecting the research question and simple theory to conducting verification and validation. The primary value of simulation occurs in creative and systematic experimentation to produce novel theory. Second, we position simulation methods within the broad context of theory development. Simulation sits in the “sweet spot” between theory creating using methods such as multiple case inductive studies and formal modeling, and theory testing using methods such as multivariate statistical testing of hypotheses. We note the strengths of theory building using simulation including internal validity, experimentation to create new theory, and facility in coping with longitudinal, non-linear, and process phenomena, especially when empirical data are challenging to obtain. We also note simulation’s weaknesses such as external validity. We conclude with guidelines for evaluation that focus on the importance of theoretical contribution, strength of method, and the insights of the emergent theory.","authors":["Jason P. Davis","Kathleen M. Eisenhardt","Christopher B. Bingham"],"meta":["January 2006The Academy of Management Review 32(2)","DOI:10.5465/AMR.2007.24351453"],"references":["277472358_Interacting_locally_and_evolving_globally_A_computational_approach_to_the_dynamics_of_organizational_populations","325001072_Organizational_Evolution_Learning_and_Selection_A_Genetic-Algorithm-Based_Model","324287747_Discrete_Stochastic_Processes","313706874_Adaptation_in_natural_and_artificial_systems","312985464_Building_theories_from_case_study_research","309311435_What_constitutes_a_theoretical_contribution","309311390_The_relation_of_strength_of_stimulus_to_rapidity_of_habit-formation","284389044_Exploration_and_Exploitation_in_Organizational_Learning","283996103_Genetic_Algorithms_In_Search_Optimization_and_Machine_Learning","276181215_EDITORIAL_NOTE"]}