{"id":"228356652_PPIG_2004_Factors_Affecting_Course_Outcomes_in_Introductory_Programming","abstract":"Learning to program is difficult for many students. Although several factors that affect learning to program have been identified over the years, we are still far from a full understanding of why some students learn to program easily and quickly while others flounder. Two constructs that may affect learning to program are self-efficacy and mental models. Self-efficacy is the individual's judgment of his or her ability to perform a task in a specific domain (Bandura 1986). A mental model is a person's internal (mental) representation of real world objects and systems (Norman 1983). Separate research on self-efficacy and mental models has shown that both are important to knowledge acquisition and transfer. Using a path-analytic approach, this research investigates the joint effects of self-efficacy, mental model, and previous experience on learning to program in an introductory course. The results show that self-efficacy for programming is influenced by previous programming experience, and student self-efficacy increases substantially during an introductory programming course. Furthermore, students' mental models of programming influence their self-efficacy, and both the mental model and self-efficacy have a direct effect on overall success in an introductory course.","authors":["Susan Wiedenbeck","Deborah Labelle","Vennila N R Kain"],"meta":["May 2004"],"references":["247480203_Self-efficacy_and_educational_development","317953663_Self-Efficacy_Toward_a_Unifying_Theory_of_Behavioral_Change","313430484_Effects_of_feedback_and_cognitive_playfulness_on_performance_in_microcomputer_software_training","274566373_Statistical_Power_Analysis","271729841_Development_and_Validation_of_Scores_on_a_Computer_Programming_Self-Efficacy_Scale_and_Group_Analyses_of_Novice_Programmer_Self-Efficacy","242608727_Log_on_education_teaching_the_nintendo_generation_to_program","242416080_The_Social_Foundations_of_Thought_and_Action","242403498_Comprehension_strategies_in_programming","239278824_Exploration_of_the_Relationship_Between_Prior_Computing_Experience_and_Gender_on_Success_in_College_Computer_Science","239060654_Self-Efficacy_Beliefs_in_Academic_Settings"]}