{"id":"228377382_Object_detection_and_classification_with_applications_to_skin_cancer_screening","abstract":"This paper discusses a new approach to the processes of object detection, recognition and classification in a digital image. The classification method is based on the application of a set of features which include fractal parameters such as the Lacunarity and Fractal Dimension. Thus, the approach used, incorporates the characterisation of an object in terms of its texture.\nThe principal issues associated with object recognition are presented which includes two novel fast segmentation algorithms for which C++ code is provided. The self-learning procedure for designing a decision making engine using fuzzy logic and membership function theory is also presented and a new technique for the creation and extraction of information from a membership function considered.\nThe methods discussed, and the ‘system’ developed, have a range of applications in ‘machine vision’. However, in this publication, we focus on the development and implementation of a skin cancer screening system that can be used in a general practice by non-experts to ‘filter’ normal from abnormal cases so that in the latter case, a patient can be referred to a specialist. A demonstration version of the application developed for this purpose has been made available for this publication which is discussed in Section IX.","authors":["Jonathan Blackledge","Dmitriy Dubovitskiy"],"meta":["January 2008"],"references":["288488870_Resolution_of_composite_fuzzy_relation_equation","284073508_Fuzzy_Sets_and_Their_Applications_to_Cognitive_and_Decision_Processes","267477402_The_Making_of_Fractal_Geometry_in_Digital_Imaging","267017655_Machine_vision_algorithms_architectures_and_systems","262368678_Fuzzy_rule-based_expert_systems_II","244952817_2-D_signal_and_image_processing","240364160_Two_Dimensional_Image_and_Signal_Processing_Prentice-Hall","239064517_Advanced_in_the_Linguistic_Synthesis_of_Fuzzy_Controller","234815725_Machine_vision_and_digital_image_processing_fundamentals","223114638_Resolution_of_composite_fuzzy_relation_equations'_Information_and_Control_30_38-48"]}