{"id":"228449802_Preparing_for_Examinations_The_interplay_of_memorising_and_understanding_and_the_development_of_knowledge_objects","abstract":"Two groups of students (N 28) were interviewed about their experiences of preparing for, and taking, final university examinations. The analysis examined the processes of learning used during revision, and, in particular, the ways in which under-standing and memorising were described. A sequence of categories was identified through which to present a typical sequence of study activities in preparing for final examinations. One recurring aspect of the revision process involved the creation of \"knowledge objects\"— tightly structured, quasi-visual forms of understanding. The analysis showed that the distinction between \"understanding\" and \"memorising\" is not easy to delineate, with \"committing to memory\" and \"rote learning of details\" both contributing to the production of a knowledge object. The findings warn against too ready a linkage of intention to any specific process in student learning: a deep intention can involve rote memorisation, while a surface approach at university level will include understanding, even if it is reproduced from lecture notes. They also draw attention to the complexity of the interplay between different learning processes and so complement psychometric studies of memorisation and understanding.","authors":["Noel Entwistle","Dorothy Entwistle"],"meta":["May 2003Higher Education Research and Development 22(1)","DOI:10.1080/0729436032000056562"],"references":["282571805_'Memorisation_with_understanding'_in_approaches_to_studying_cultural_variant_or_response_to_assessment_demands","245459885_Approaches_to_learning_and_forms_of_understanding","234559483_Understanding_Student_Learning","232980953_Frameworks_for_Understanding_as_Experienced_in_Essaiy_Writing_and_in_Preparing_for_Examinations","232455563_Conceptions_styles_and_approaches_within_higher_education_Analytical_abstractions_and_everyday_experience","284687118_Embryonic_'memorising'_models_of_student_learning","272160038_Learning_and_Awareness","248963047_A_Challenge_to_the_Anecdotal_Stereotype_of_the_Asian_Student","248417232_Western_misperceptions_of_the_Confucian-heritage_learners","232563221_On_Qualitative_Difference_in_Learning_I_-_Outcome_and_Process"]}