{"id":"228403430_WLAN_IEEE_80211_abgn_indoor_coverage_and_interference_performance_study","abstract":"An adequate wireless network plan is needed to replace the traditional wired LANs. A full coverage WLAN offers the flexibility to relocate people and equipment or to reconfigure and add more wireless devices to the network. Usually, an IEEE 802.11 variant is chosen based on their bandwidth and their coverage area. However, sometimes there are special cases where the best technology is not the newest one. In addition, suitable positioning of access points (AP) is crucial to determine the efficiency of the network. E.g. in the case where devices are going to transmit at a maximum of 1 Mbps, any choice is acceptable, but when it is required higher performance, other factors must be considered. In this paper, we compare IEEE 802.11a/b/g/n indoor environments to know what technology is better. This comparison will be taken in terms of RSSI, coverage area, and measuring the interferences between channels. These key factors must be optimum to have high performance in the WLAN. This study will help the researchers to choose the best technology depending of their deploying case, and we will see study the best variant for indoors.","authors":["Sandra Sendra","Miguel Garcia-Pineda","Carlos Turro","Jaime Lloret"],"meta":["January 2011International Journal on Advances in Networks and Services 4(1)","Project: WiFi networks"],"references":["239826121_Prediction_of_Wireless_Network_Signal_Strength_within_a_Building","237726040_WIRELESS_LAN_DEPLOYMENT_IN_LARGE_EXTENSION_AREAS_THE_CASE_OF_A_UNIVERSITY_CAMPUS","224193234_IEEE_80211abgn_Indoor_Coverage_and_Performance_Comparison","221611940_Estimation_of_Link_Interference_in_Static_Multi-hop_Wireless_Networks","221611908_Interference_map_for_80211_networks","220419345_The_Development_of_Two_Systems_for_Indoor_Wireless_Sensors_Self-location","296188084_Two_semi-empirical_and_fast_prediction_models_for_urban_microcells_compared_with_measurements_at_919_and_1873_MHz","291118772_Radio_coverage_in_buildings","242467878_Antennas_and_Propagation_of_Wireless_Communication_Systems","236183230_Wireless_Communications_Principles_and_Practice_2nd_Edition"]}