{"id":"228564046_Cut-First_Branch-and-Price-Second_for_the_Capacitated_Arc-Routing_Problem","abstract":"This paper presents the first full-fledged branch-and-price (bap) algorithm for the capacitated arc-routing problem (CARP). Prior exact solution techniques either rely on cutting planes or the transformation of the CARP into a node-routing problem. The drawbacks are either models with inherent symmetry, dense underlying networks, or a formulation where edge flows in a potential solution do not allow the reconstruction of unique CARP tours. The proposed algorithm circumvents all these drawbacks by taking the beneficial ingredients from existing CARP methods and combining them in a new way. The first step is the solution of the one-index formulation of the CARP in order to produce strong cuts and an excellent lower bound. It is known that this bound is typically stronger than relaxations of a pure set-partitioning CARP model. Such a set-partitioning master program results from a Dantzig-Wolfe decomposition. In the second phase, the master program is initialized with the strong cuts, CARP tours are iteratively generated by a pricing procedure, and branching is required to produce integer solutions. This is a cut-first bap-second algorithm and its main function is, in fact, the splitting of edge flows into unique CARP tours.","authors":["Bode Claudia","Stefan Irnich"],"meta":["October 2012Operations Research 60(5)","DOI:10.2307/23323687"],"references":["260125401_Polyhedral_Results_for_Some_Constrained_Arc-Routing_Problems","255586674_A_Branch-and-Cut_Algorithm_for_the_Undirected_Capacitated_Arc_Routing_Problem","242511324_Tabu_Search_Generalized_k-Path_Inequalities_and_Partial_Elementarity_for_the_Vehicle_Routing_Problem_with_Time_Windows","267468387_The_travelling_salesman_problem_as_a_constrained_shortest_path_problem_Theory_and_computational_experience","257480015_Improved_lower_bounds_and_exact_algorithm_for_the_capacitated_arc_routing_problem","244513067_The_shortest_path_problem_with_resource_constraints_and_k-cycle_elimination_with_k_3","239422717_Arc_Routing_Theory_Solutions_and_Applications","238224935_Efficient_Routeing_for_Winter_Gritting","238168262_A_Tabu_Search_Heuristic_for_the_Capacited_Arc_Routing_Problem","230820518_An_Exact_Solution_Framework_for_a_Broad_Class_of_Vehicle_Routing_Problems"]}