{"id":"228579574_Solving_the_Teacher_Assignment_Problem_by_Two_Metaheuristics","abstract":"The timetabling problem arising from a university in Indonesia is addressed in this paper. It involves the assignment of teachers to the courses and course sections. We formulate the problem as a mathematical programming model. Two different algorithms, mainly based on simulated annealing (SA) and tabu search (TS) algorithms, are proposed for solving the problem. The proposed algorithms consist of two phases. The first phase involves allocating the teachers to the courses and determining the number of courses to be assigned to each teacher. The second phase involves assigning the teachers to the course sections in order to balance the teachers' load. The performance of the proposed algorithms is evaluated using two sets of real data and some randomly generated problem instances. The computational results show that in general, tabu search performs better than simulated annealing and other previous work. For the real data sets, the computational results show that both proposed algorithms yield better solutions when compared to manual allocation done by the university.","authors":["Aldy Gunawan","Kien Ming Ng"],"meta":["March 2011International Journal of Information and Management Sciences 22(1):73-86"],"references":["277474071_Tabu_search-part_II","268019006_A_comparative_study_of_algorithms_for_the_flowshop_scheduling_problem","242710329_Discrete_Optimization_A_graph-based_hyper-heuristic_for_educational_timetabling_problems","328870170_Bus_and_train_driver_scheduling","266427551_Handbook_of_Combinatorial_Optimization","264238319_A_Survey_of_Automated_Timetabling","261587681_Simulated_annealing_for_parallel_machine_scheduling_with_earliness-tardiness_penalties_and_sequence-dependent_set-up_times","254348709_Hybridization_of_Ant_Colony_Optimization_Strategies_in_Tabu_Search_for_Solving_Job_Shop_Scheduling_Problems","250786191_Multiple_DNA_Sequence_Alignment_Based_on_Genetic_Simulated_Annealing_Techniques","245102323_A_Tabu_Search_for_Computing_an_Operational_Timetable"]}