{"id":"228525104_Knowledge_Management_Systems_Development_Theory_and_Practice","abstract":"The intricate crafting of online educational systems lie within three principal activities: Design of the system, implementation, and proper post-implementation assessment. There is not enough knowledge or experience in all regards. Efficient execution of these three major activities necessi-tates the use of design and pedagogical models to achieve cost and time efficiency, as well as high pedagogical quality. Models represent a structured approach to analysis and promote quanti-fiable feedback that can be monitored. Components of an online educational system would bene-fit from a design process. Similarly, utilization of the online educational system would benefit from a structured approach to design, implementation, and student's assessment. Following the technology adoption theory, understanding individual's behavior towards technology usage would focus on instrumental beliefs driving intentions. However, this may not be the case with online educational systems because the context and setup is significantly different from previous technology adoption studies. Therefore, the implementation of an online educational system should be designed based on established pedagogical principles, and once developed the assess-ment of students' behavior should be monitored using management information systems method-ology. In this paper, we present the design of an online education system, and the experience of the stu-dents using the system. A survey methodology approach is followed and assessment results are discussed. The technology acceptance model and the theory of planned behavior were used to identify significant constructs as antecedents to intentions. Scale validation for both models indi-cates that the operational measures have acceptable psychometric properties. Confirmatory factor analysis supports both models. Structural equation analysis provides evidence for the superiority of the theory of planned behavior in explaining students' behavior towards educational online systems. Limitation, implications, design recommendations, and suggestions for future research are then discussed.","authors":["Raafat George Saade","Fassil Nebebe","Tak Mak"],"meta":["January 2011Interdisciplinary Journal of Information 6:35-72","DOI:10.28945/1361"],"references":["320656842_The_Emotional_State_of_Technology_Acceptance","288605275_The_emotional_in_e-learning","313772431_On_the_explanation_of_factors_affecting_e-commerce_adoption","313604424_Evaluating_Structural_Equation_Models_with_Unobservable_Variables_and_Measurement_Error","312975805_The_age_of_social_transformation","304575832_From_intentions_to_actions_a_theory_of_planned_behavior_in_action_control_From_cognition_to_behavior","304534338_Understanding_Attitudes_and_Predicting_Social_Behavior","296320987_Getting_smart_about_knowledge_management","290289322_Research-supported_best_practices_for_developing_online_learning","287597300_An_Empirical_Testing_of_the_Theory_of_Planned_Behavior_in_Explaining_IT_Adoption"]}