{"id":"228523135_Twitter_sentiment_classification_using_distant_supervision","abstract":"We introduce a novel approach for automatically classify-ing the sentiment of Twitter messages. These messages are classified as either positive or negative with respect to a query term. This is useful for consumers who want to re-search the sentiment of products before purchase, or com-panies that want to monitor the public sentiment of their brands. There is no previous research on classifying sen-timent of messages on microblogging services like Twitter. We present the results of machine learning algorithms for classifying the sentiment of Twitter messages using distant supervision. Our training data consists of Twitter messages with emoticons, which are used as noisy labels. This type of training data is abundantly available and can be obtained through automated means. We show that machine learn-ing algorithms (Naive Bayes, Maximum Entropy, and SVM) have accuracy above 80% when trained with emoticon data. This paper also describes the preprocessing steps needed in order to achieve high accuracy. The main contribution of this paper is the idea of using tweets with emoticons for distant supervised learning.","authors":["Alec Go","Richa Bhayani","Lei Huang"],"meta":["January 2009"],"references":["221517116_Micro-blogging_as_online_word_of_mouth_branding","262333164_Making_Large-Scale_Support_Vector_Machine_Learning_Practical","248590871_An_introduction_to_sup_-_port_vector_machines_and_other_kernel_-_based_methods","237437436_Using_Maximum_Entropy_for_Text_Classication","228614627_Experiments_with_mood_classification_in_Blog_posts","224890479_Opinion_Mining_and_Sentiment_Analysis","215470760_Opinion_Mining_and_Sentiment_Analysis","208033762_Foundations_of_Statistical_Natural_Language_Processing","200045863_Foundations_of_Statistical_Natural_Language_Processing","200044329_Recognizing_Contextual_Polarity_in_Phrase-Level_Sentiment_Analysis","37419815_An_introduction_to_support_vector_machines_and_other_kernel-based_learning_methods_Repr","2926909_A_Practical_Guide_to_Support_Vector_Classification_Chih-Wei_Hsu_Chih-Chung_Chang_and_Chih-Jen_Lin","2518534_Thumbs_up_Sentiment_Classification_Using_Machine_Learning_Techniques"]}