{"id":"228510805_FDC_12_-_A_Simulink_Toolbox_for_Flight_Dynamics_and_Control_Analysis","abstract":"This report gives an overview of the Flight Dynamics and Control toolbox FDC 1.2, a graphical software environment for the design and analysis of aircraft dynamics and control systems, based upon Matlab and Simulink. Its main goal is to simplify the Flight Control System design process, although it can be applied to a broad range of Stability and Control related problems.\n\nAn early version of the toolbox was used in practice for an autopilot design process for the De Havilland ‘Beaver’ aircraft, which was performed by graduate students of the section Stability and Control of the Faculty of Aerospace Engineering (including myself) in 1992/1993. This project provided an impressive demonstration of the flexibility and power of Simulink-based tools by enabling us to bring the autopilot project from the early designs in Matlab to the actual flight test phase in a short period of time with great results (see refs.[22] and [29]). Based upon this ‘Beaver’ autopilot experience the current version of the FDC toolbox has evolved into an advanced ‘proof of concept’ package which has matured a lot since the early versions from 1992/1993. FDC 1.2 thus paves the way for future general-purpose toolboxes in the field of Flight Dynamics and Control research.\nFDC 1.2 can play an important role in aeronautical education by assisting in Flight Dynamics and Control related training courses. There it can take full advantage of its clear model structure and its flexibility which enables it to be used for a variety of tasks, e.g. control system design, off-line simulations of the open-loop, uncontrolled aircraft (either non-linear or linear), closed-loop simulations of an automatically controlled aircraft, etc. \n\nThe non-linear dynamic model of the ‘Beaver’ aircraft is very suitable for a first introduction to the structure of aircraft dynamics in general due to its relatively simple structure which nevertheless contains many typical aircraft characteristics that make it an ideal basis for a general treatment of aircraft dynamics. For instance, the model clearly exhibits cross-coupling of longitudinal and lateral motions and it describes asymmetrical aircraft behavior due to propeller-slipstream effects. FDC 1.2 can help assisting courses on Automatic Flight Control Systems (AFCS’s) if it is used in combination with the various existing control system toolboxes for Matlab. Its powerful non-linear simulation capabilities make it easy to extend such courses beyond the linear AFCS design and simulations, thus bridging the gap between the control theory and its applications in practice.","authors":["Marc O. Rauw"],"meta":["May 2001"],"references":["23868158_LINEAR_-_DERIVATION_AND_DEFINITION_OF_A_LINEAR_AIRCRAFT_MODEL","229091419_Aircraft_Control_and_Simulation","48012897_Feedback_control_systems","27343659_Stability_and_control_derivatives_of_the_De_Havilland_DHC-2_Beaver_aircraft","27341249_Mathematical_model_of_external_disturbances_acting_on_an_aircraft_during_an_its_approach_and_landing","27340975_Modular_programming_structure_applied_to_the_simulation_of_non-linear_aircraft_models","24371806_Approach_and_landing_simulation","24300254_Development_of_a_category_2_approach_system_model","3544395_Development_of_a_workstation_for_the_integrated_design_and_simulation_of_flight_control_systems"]}