{"id":"228571361_Characterization_of_belief_propagation_and_its_generalizations","abstract":"Graphical models are used in many scientific disciplines, including statistical physics, machine learning, and error-correcting coding. One typically seeks the marginal probability of selected variables (nodes of the graph) given observations at other variables. Belief propagation (BP) is a fast marginalization method, based on passing local messages. Designed for singly-connected graphs, BP nonetheless works well in many applications involving graphs with loops, for rea-sons that were not well understood. We characterize the BP solutions, showing that BP can only converge to a stationary point of an approximate free energy, known as the Bethe free energy in statistical physics. This understanding lets us for construct new message-passing algorithms based on improvements to Bethe's approximation introduced by Kikuchi and others. The new generalized belief propagation (GBP) algorithms are much more accurate than ordinary BP for some problems, and permit solutions to Kikuchi approximations for otherwise intractable inho-mogeneous systems. We illustrate GBP with a spin-glass example and an error-correcting code, showing dramatically improved estimates of local magnetizations and decoding performance using GBP. This work may not be copied or reproduced in whole or in part for any commercial purpose. Permission to copy in whole or in part without payment of fee is granted for nonprofit educational and research purposes provided that all such whole or partial copies include the following: a notice that such copying is by permission of Mitsubishi Electric Research Laboratories, Inc.; an acknowledgment of the authors and individual contributions to the work; and all applicable portions of the copyright notice. Copying, reproduction, or republishing for any other purpose shall require a license with payment of fee to Mitsubishi Electric Research Laboratories, Inc. All rights reserved.","authors":["Jonathan S Yedidia","William T Freeman","Yair Weiss"],"meta":["April 2001"],"references":["226435002_An_Introduction_to_Variational_Methods_for_Graphical_Models","235559029_Graphical_Models_for_Machine_Learning_and_Digital_Communication","220695762_InformationTheory_Inference_and_Learning_Algorithms","216301244_Probabilistic_Reasoning_in_Intelligent_Systems_Networks_Of_Plausible_Inference","3489260_Low-Density_Parity-Check_Codes"]}