{"id":"228517481_Intelligent_web_caching_using_machine_learning_methods","abstract":"Web caching is a technology to improve network traffic on the Internet. It is a temporary storage of Web objects for later retrieval. Three significant ad-vantages of Web caching include reduction in bandwidth consumption, server load, and latency. These advantages make the Web to be less expensive yet it provides better performance. This research aims to introduce an advanced machine learning method for a classification problem in Web caching that requires a decision to cache or not to cache Web objects in a proxy cache server. The challenges in this clas-sification problem include the issues in identifying attributes ranking and improve the classification accuracy significantly. This research includes four methods that are Classification and Regression Trees (CART), Multivariate Adaptive Regression Splines (MARS), Random Forest (RF) and TreeNet (TN) for classification on Web caching. The experimental results reveal that CART performed extremely well in classifying Web objects from the existing log data with a size of Web objects as a significant attribute for Web cache performance enhancement.","authors":["Sarina Sulaiman","Siti Mariyam Shamsuddin","Ajith Abraham","Shahida Sulaiman"],"meta":["January 2011Neural Network World 21(5)","DOI:10.14311/NNW.2011.21.025"],"references":["226116920_Rough_Web_Caching","280027273_Using_predictive_prefetching_to_improve_world_wide_web_latency","273453883_Particle_Swarm_Optimization","258304769_Machine_Learning_Volume_45_Number_1_-_SpringerLink","248619534_Using_Predictive_Prefetching_to_Improve_WWW_Latency","241236959_An_Implementation_of_Rough_Set_in_Optimizing_Mobile_Web_Caching_Performance","240310918_Classification_and_Regression_Trees_CART","234820584_A_Prefetching_Protocol_Using_Client_Speculation_for_the_WWW","225500602_New_Results_on_Web_Caching_with_Request_Reordering","224400642_Application_of_TreeNet_in_Predicting_Object-Oriented_Software_Maintainability_A_Comparative_Study"]}