{"id":"228523621_Extracting_opinions_and_facts_for_business_intelligence","abstract":"Finding information about companies on multiple sources on the Web has become increasingly important for business analysts. In particular, since the emergence of the Web 2.0, opinions about companies and their ser-vices or products need to be found and distilled in order to create an accurate picture of a business entity. Without appropriate text mining tools, company analysts would have to read hundreds of textual reports, newspaper articles, fo-rums' postings and manually dig out factual as well as subjective information. This paper describes a series of experiments to assess the value of a number of lexical, morpho-syntactic, and sentiment-based features derived from linguistic processing and from an existing lexical database for the classification of evalu-ative texts. The paper describes experiments carried out with two different web sources: one source contains positive and negative opinions while the other con-tains fine grain classifications in a 5-point qualitative scale. The results obtain are positive and in line with current research in the area. Our aim is to use the result of classification in a practical application that will combine factual and opinionated information in order to create the reputation of a business entity.","authors":["Horacio Saggion","Adam Funk"],"meta":["January 2009"],"references":["313170906_Word_association_norms_mutual_information_and_lexicography","269088035_Automatic_identification_of_sentiment_vocabulary","250785343_The_SVM_With_Uneven_Margins_And_Chinese_Document_Categorisation","250384613_Cost_Sensitive_Evaluation_Measures_for_F-term_Patent_Classification","248832100_Thumbs_Up_or_Thumbs_Down_Semantic_Orientation_Applied_to_Unsupervised_Classification_of_Reviews","234824859_Automatic_identification_of_sentiment_vocabulary_exploiting_low_association_with_known_sentiment_terms","319393820_WordNet_An_Electronic_Lexical_Database","285278428_Text_Categorization_with_Support_Vector_Machines_Learning_with_Many_Relevant_Features","250369172_SVM_Based_Learning_System_for_F-term_Patent_Classification","243134278_A_Sentimental_Education_Sentiment_Analysis_Using_Subjectivity_Summarization_Based_on_Minimum_Cuts"]}