{"id":"228539856_Random_Context_Picture_Grammars_The_State_of_the_Art","abstract":"Generalized random context picture grammars (grcpgs) are a method of syntactic picture generation. The terminals are subsets of the Euclidean plane and the replacement of variables involves the building of functions that will eventually be applied to terminals. Context is used to permit or forbid production rules.\nIterated function systems (IFSs) and their generalization, mutually recursive function systems (MRFSs), are among the best-known methods for constructing fractals. In earlier work it was shown that any picture sequence generated by an IFS or MRFS can be generated by a grcpg. Moreover, it was shown that grcpgs can generate a wider range of pictures than IFSs or MRFSs.\nIn this essay we give a summary of the above mentioned results. We then consider language-restricted iterated function systems (LRIFSs), a method of picture generation where a language controls which functions of an IFS are applied. We first show that LRIFSs are more powerful than IFSs. Then we show that any picture produced by an LRIFS where the restricting language is regular, can be approximated by a grcpg.","authors":["Sigrid Ewert"],"meta":["January 2009","DOI:10.1007/978-3-642-31644-9_4","In book: Manipulation of Graphs, Algebras and Pictures (pp.135--147)Publisher: Hohnholt Reprografischer Betrieb GmbH, Bremen, GermanyEditors: Frank Drewes, Annegret Habel, Berthold Hoffmann, and Detlef Plump"],"references":["286910524_Picture_languages_-_a_survey","279235850_Chaos_and_Fractals_New_Frontiers_of_Science","269029415_Translating_mutually_recursive_function_systems_into_generalised_random_context_picture_grammars","269023445_Table-driven_context-free_picture_grammars","265461238_Mathematics_for_Computer_Graphics","242328949_Chaos_and_Fractals_New_Frontiers_of_Science","226995227_L-systems_and_mutually_recursive_function_systems","222568303_Tree-based_picture_generation","220359324_Generating_Pictures_Using_Random_Forbidding_Context","220197964_On_Proving_that_Certain_Languages_are_not_ETOL","37923580_Shrink_Indecomposable_Fractals","220155514_A_property_of_random_context_picture_grammars","37923579_A_hierarchy_Result_for_Random_Forbidding_Context_Picture_Grammars","37923578_Generating_Pictures_using_Random_Permitting_Context","37923577_Random_Context_Picture_Grammars"]}