{"id":"228647263_Mundo_do_trabalho_alguns_aspectos_vivenciados_pelos_profissionais_recem-formados_em_enfermagem","abstract":"RESUMO Objetivo: Conhecer algumas vivencias de recém graduados em enfermagem, na transição do mundo acadêmico para o mundo do trabalho. Métodos: Pesquisa exploratória descritiva realizada com amostra de 31 profissionais graduados em cursos de enfermagem no período de 2000 a 2004. Resultados: Na análise e interpretação dos dados, foram identificados três tipos de vivencias: preconceitos no mundo do trabalho, inserção na equipe de trabalho em saúde e fatores que facilitam a transição para o mundo do trabalho. Conclusão: O início da atividade profissional, para o(a) enfermeiro(a), pode ser marcado por dificuldades, gerando ansiedade. Entretanto, o mundo do trabalho pode ser prazeroso, gratificante e instigante, estimulando o profissional a superar os desafios e os próprios limites decorrentes da formação profissional. Descritores: Trabalho; Educação em Enfermagem; Gestão de pessoas ABSTRACT Objective: To know some experiences, of nurses recently graduated, in the transition from academia to the world of work. Methods: It is a descriptive and exploratory study conducted with a sample of 31 professionals graduated in nursing courses in the period 2000-2004. Results: The analysis and data interpretation identified three types of experiences (prejudice in the world of work, integration into the health work-team and factors that facilitate the transition to the world of work). Conclusion: The beginning of the professional activity, for nurses, could be marked by difficulties that generate anxiety. Meanwhile, the world of work can be enjoyable, rewarding and challenging, encouraging professionals to overcome challenges and constraints that arise from the profession education.","authors":["Mariza Maria","Serafim Mattosinho","Maria Seloi Coelho","Betina Hörner"],"meta":["January 2010Acta Paulista de Enfermagem 23(4)","DOI:10.1590/S0103-21002010000400004"],"references":["237643941_O_trabalho_da_enfermagem_e_a_producao_da_subjetividade_de_seus_trabalhadores"]}