{"id":"228686781_Estimating_time_trends_in_Gumbel-distributed_data_by_means_of_generalized_linear_models","abstract":"1] This paper shows how Gumbel-distributed data can be related to explanatory variables by using generalized linear models (GLMs) fitted by using a modified form of the iteratively weighted least squares algorithm (IWLS). Typical applications include (1) testing for trend in annual flood data, as a possible consequence of changing land cover or other factors; (2) testing for trend in annual maximum rainfall intensities of different durations, as a possible consequence of climate change; and (3) testing how annual maximum rainfall intensity is related to weather conditions at the times that annual maximum intensities were recorded. Given a first estimate of the Gumbel scale parameter a, the coefficients b of explanatory variables x are estimated by casting the model in GLM form, and the scale parameter a is updated by solution of relevant maximum likelihood equation for this parameter. The parameters a, b can be readily estimated using currently available statistical software for fitting GLMs, which can also be used to test the significance of trends in annual flood data for which the Gumbel distribution is a plausible hypothesis. A plotting procedure to indicate departures from the Gumbel hypothesis is also given. The proposed procedure avoids the illogicality in which, when a trend in flood data is suspected, it is tested either by linear regression methods that assume Normally distributed residuals, or by nonparametric methods, both of which discard the Gumbel hypothesis. Simulated samples from Gumbel distributions were used to compare estimates of linear trend obtained by (1) the GLM procedure and (2) straightforward use of a Newton-Raphson procedure to locate the maximum of the likelihood surface; the GLM procedure converged more rapidly and was far less subject to numerical instabilities. Simulated samples from Gumbel distributions were also used to compare estimates of a linear trend coefficient b given by the GLM procedure, with estimates of b obtained by simple linear regression (LR). The variance of the distribution of GLM estimates of b was less than the variance of the distribution of LR estimates, while comparison of the powers of the two tests showed that GLM was more powerful than LR at detecting the existence of small trends, although for large linear trends there was little to choose between the two methods.","authors":["Robin T. Clarke"],"meta":["July 2002Water Resources Research 38(7)","DOI:10.1029/2001WR000917"],"references":["313655920_Predicting_the_hydrological_impacts_of_land_cover_transformation_in_the_humid_tropics_The_need_for_integrated_research","253619978_Secular_Trends_of_Precipitation_Amount_Frequency_and_Intensity_in_the_United_States","248300235_Variability_and_Trends_in_Total_Precipitation_and_Snowfall_Over_the_United_States_and_Canada","312623988_Iteratively_reweighted_least_squares_for_maximum_likelihood_estimation_and_some_robust_and_resistant_alternatives_With_Discussion","277664929_Generalized_Linear_Models_Monographs_on_Statistics_and_Applied_Probability_No_37","265370397_Iteratively_Re-weighted_Least_Squares_for_Maximum_Likelihood_Estimation_and_Some_Robust_and_Resistant_Alternatives","248879795_Climate-Related_Fluctuations_in_Midwestern_Floods_during_1921-1985","246295749_In_Generalised_Linear_Models","245641847_Frequency_Analysis_of_Extreme_Events","245375359_Analysis_and_modeling_of_hydrologic_time_series"]}