{"id":"228667645_Examining_the_performance_of_six_heuristic_optimisation_techniques_in_different_forest_planning_problems","abstract":"The existence of multiple decision-makers and goals, spatial and non-linear forest management objectives and the combinatorial nature of forest planning problems are reasons that support the use of heuristic optimisation algorithms in forest planning instead of the more traditional LP methods. A heuristic is a search algorithm that does not necessarily find the global optimum but it can produce relatively good solutions within reasonable time. The performance of different heuristics may vary depending on the complexity of the planning problem. This study tested six heuristic optimisation techniques in five different, increasingly difficult planning problems. The heuristics were evaluated with respect to the objective function value that the techniques were able to find, and the time they consumed in the optimisation process. The tested optimisation techniques were 1) random ascent (RA), 2) Hero sequential ascent technique (Hero), 3) simulated annealing (SA), 4) a hybrid of SA and Hero (SA+Hero), 5) tabu search (TS) and 6) genetic algorithm (GA). The results, calculated as averages of 100 repeated optimisations, were very similar for all heuristics with respect to the objective function value but the time consumption of the heuristics varied considerably. During the time the slowest techniques (SA or GA) required for convergence, the optimisation could have been repeated about 200 times with the fastest technique (Hero). The SA+Hero and SA techniques found the best solutions for non-spatial planning problems, while GA was the best in the most difficult problems. The results suggest that, especially in spatial planning problems, it is a benefit if the method performs more complicated moves than selecting one of the neighbouring solutions. It may also be beneficial to combine two or more heuristic techniques.","authors":["Timo Pukkala","Mikko Kurttila"],"meta":["January 2005Silva Fennica 39(1)","DOI:10.14214/sf.396"],"references":["249533115_Spatially_constrained_timber_harvest_scheduling","248969381_Prediction_of_the_amenity_of_a_tree_stand","292004082_Genetic_Algorithms_Modern_Heuristic_Techniques_for_Combinatorial_Problems","288558482_Home_ranges_and_habitat_use_in_the_declining_flying_squirrel_Pteromys_volans_in_managed_forests","284024084_Metsasuunnitteluohjelmisto_MONSU_Ohjelmiston_toiminta_ja_kaytto","268315585_Intelligent_optimisation_techniques_Genetic_algorithms_tabu_search_simulated_annealing_and_neural_networks","249533651_Harvest_scheduling_with_spatial_constraints_a_simulated_annealing_approach","249533480_The_influence_of_cut-block_size_and_adjacency_rules_on_harvest_levels_and_road_networks","248969811_Spatial_Optimization_by_Simulated_Annealing_and_Linear_Programming","248427656_Formation_of_harvest_units_with_genetic_algorithms","244957295_A_heuristic_optimiztion_method_for_forest_planning_and_decision_making","243638346_Tabu_Search-Modern_Heuristic_Techniques_for_Combinatorial_Problems","242480595_Modern_Heuristic_Techniques_for_Combinatorial_Problems","240672340_Creating_continuous_areas_of_old_forest_in_long-term_forest_planning","240525585_Harvest_scheduling_under_adjacency_constraints_-_a_case_study_from_the_Swedish_sub-alpine_region"]}