{"id":"228668926_Formal_semantics_and_analysis_of_BPMN_process_models_using_Petri_nets","abstract":"The Business Process Modelling Notation (BPMN) is a stan-dard for capturing business processes in the early phases of systems de-velopment. The mix of constructs found in BPMN makes it possible to obtain models with a range of semantic errors. The ability to statically check the semantic correctness of models is thus a desirable feature for modelling tools based on BPMN. However, the static analysis of BPMN models is hindered by ambiguities in the standard specification and the complexity of the language. The fact that BPMN integrates constructs from graph-oriented process definition languages with features for con-current execution of multiple instances of a subprocess and exception handling, makes it challenging to provide a formal semantics of BPMN. Even more challenging is to define a semantics that can be used to anal-yse BPMN models. This paper proposes a formal semantics of BPMN defined in terms of a mapping to Petri nets, for which efficient analysis techniques exist. The proposed mapping has been implemented as a tool that generates code in the Petri Net Markup Language. This formalisa-tion exercise has also led to the identification of a number of deficiencies in the BPMN standard specification.","authors":["Remco Dijkman","Marlon Dumas","Chun Ouyang"],"meta":[],"references":["225913375_Fundamentals_of_Control_Flow_in_Workflows","223096568_YAWL_Yet_another_workflow_language","222303854_Aalst_WMP_Formalization_and_Verification_of_Event-driven_Process_Chains_Information_and_Software_Technology_41_639-650","221586005_Transforming_BPEL_to_Petri_nets","220783728_Achieving_a_General_Formal_and_Decidable_Approach_to_the_OR-Join_in_Workflow_Using_Reset_Nets","264922643_Unified_Modeling_Language_Specification","264922489_XML_Metadata_Interchange_Specification","235949931_Workflow_Management_Coalition_Workflow_Standard_Workflow_Process_Definition_Interface_--_XML_Process_Definition_Language_XPDL_WFMC-TC-1025","229124820_Verification_of_Workflow_Task_Structures_A_Petri-net-based_Approach","228950461_Choreography-based_design_of_business_collaborations","27481323_Workflow_Patterns_On_the_Expressive_Power_of_Petri-net-based_Workflow_Languages"]}