{"id":"228647993_What_does_it_mean_to_Know_Computer_Science_Perspectives_from_Gender_Research","abstract":"The epistemological basis for computer science (CS), on which research and education as well as development of applications are founded, are fundamental for its production of knowledge. In this paper we raise the issue of how gender research developed within science and technology can be used within computer science, to approach and discuss foundations of the discipline, and what the implications of this reflection are for CS education. After an introduction, which serves to motivate the questions raised, we discuss issues concerning the foundations of computer science. We then introduce gender research, as we use it, and present some points where this type of research can contribute to the question \"What does it mean to know CS?\". 1 Introduction \"From its inception just half a century ago, computing has become the defining technology of our age.\" 1 Computer science (CS) 2 , as one of the core disciplines within the broad area of information technology, has become one of today's most important disciplines by virtue of its influence on the shaping of tech-nology and thus also society. There is little technical research, development and production done today that does not, in one way or another, involve results from (mostly in the form of applications of) CS. Computer science thus strongly influences the direction and content of technical research and development It is reasonable to assume that the influence of CS on the current and future developments of technology will continue to grow, and that the discipline will remain at the centre of information technology.","authors":["Christina Björkman","Lena Trojer"],"meta":["January 2006TripleC 4(2):316-327","DOI:10.31269/vol4iss2pp316-327"],"references":["262487090_Refiguring_Life_Metaphors_of_Twentieth-Century_Biology","249752833_Authority_in_Transformation","248880914_Secrets_of_Life_Secrets_of_Death","332640384_Refiguring_Life_Metaphors_of_Twentieth-Century_Biology","320181990_Simians_Cyborgs_and_Women_The_Reinvention_of_Nature","306296469_Epistemological_Pluralism_Styles_and_Voices_Within_the_Computer_Culture","263568014_Artificial_Knowing_Gender_and_the_Thinking_Machine","258962311_Reflection_on_Gender_and_Science","248996506_Technoscientific_Challenges_in_Feminism","247843682_Refiguring_Life_Metaphors_of_Twentieth-Century_Biology"]}