{"id":"228667616_Advanced_IT_Education_for_the_Vision_Impaired_via_e-Learning","abstract":"Lack of accessibility in the design of e-learning courses continues to hinder students with vision impairment. E-learning materials are predominantly vision-centric, incorporating images, anima-tion, and interactive media, and as a result students with acute vision impairment do not have equal opportunity to gain tertiary qualifications or skills relevant to the marketplace and their dis-ability. Due to its logical, rather than physical, nature IT help desk and network administration roles are ideal for people who are blind. This paper describes the development of a fully accessi-ble e-learning environment to deliver advanced IT network curriculum to adults with acute vision disabilities. The components include a virtual classroom, accessible learning materials, a remote computer laboratory, and delivery of the learning materials by vision impaired instructors. Indus-try standard courses in advanced IT were redeveloped, and the accessible on-line learning envi-ronment was developed to deliver the courses. Vision impaired students who excelled in the pilot project were trained as instructors, gaining industry-standard instructor certifications. These in-structors were used to assist with the design of accessible methods and delivered the materials to the vision impaired students. The project has been operational for four years with a pilot project being conducted over a two year period, followed by the delivery of the courses both local and remote vision impaired stu-dents across the globe using this accessible e-learning environment for the past two years. Evaluation results indicate that vision impaired students situated both locally and remotely gained equivalent grades to their sighted counterparts given additional time to comprehend and experi-ment via the virtual classroom and remote computer laboratory. In addition, the use of vision im-paired instructors has resulted in more innovative approaches to accessible teaching methods and delivery of the curriculum.","authors":["Helen Armstrong","Executive Summary"],"meta":["January 2009Journal of Information Technology Education:Research 8","DOI:10.28945/691"],"references":["320664061_The_Effect_of_Student_Background_in_E-Learning_-_Longitudinal_Study","239533153_A_Longitudinal_Analysis_of_the_Effects_of_Instructional_Strategies_on_Student_Performance_in_Traditional_and_E-Learning_Formats","227230605_A_model_to_design_interactive_learning_environments_for_children_with_visual_disabilities","221652312_A_Cisco_education_tool_accessible_to_the_vision_impaired","221515801_Is_your_web_page_accessible_A_comparative_study_of_methods_for_assessing_web_page_accessibility_for_the_blind","290742773_Research_on_web_accessibility_in_higher_education","252360544_FOR_THE_BLIND_AND_INVISIBLE_A_GUIDING_SITE_OUT_OF_DARKNESS","248929894_Inclusive_Pedagogy_Teaching_Methodologies_to_Reach_Diverse_Learners_in_Science_Instruction","242097799_The_Use_of_Innovative_Methods_to_Deliver_Technology_Education_Laboratory_Courses_via_Distance_Learning_A_Strategy_to_Increase_Enrollment","229505234_Using_WebCT_to_teach_courses_online"]}