{"id":"228669885_Do_Provao_ao_ENADE_uma_analise_comparativa_dos_exames_nacionais_utilizados_no_Ensino_Superior_Brasileiro","abstract":"Resumo Nesse artigo, os autores analisam, de maneira comparativa, o Exame Nacional de Avaliação do Desempenho de Estudante – ENADE, e o Exame Nacional de Cursos – ENC, mais conhecido como Provão, a par-tir de críticas feitas ao segundo e da capaci-dade do ENADE de en-dereçá-las. Ao fazê-lo, identificam diferenças e similaridades entre os dois exames, argumen-tam que ambos têm in-tegridade técnica e apre-sentam contribuições para o aprimoramento do exame vigente, tais como a elaboração de uma matriz permanente e a pré-testagem dos ins-trumentos. Em síntese, as análises apontam para uma grande similarida-de dos processos técnicos das duas abor-dagens, enquanto que as diferenças se apre-sentam mais no plano conceitual, vez que o ENADE se propõe a apresentar um indica-dor de diferença de desempenho e, especi-almente, perde o caráter high stakes do exa- Mundial sob encomenda do seu representante Alberto Rodriguez. Os autores agradecem a colaboração de Dilvo Ristoff, Diretor de Estatísticas e Avaliação da Educação Superior no INEP, de Hélgio Trindade, Presidente da CONAES, e dos membros das suas respectivas equipes que prestaram informações para esta pesquisa. me que o antecedeu. Os autores concluem que o novo exame não conseguiu, até o momento, resolver vários dos problemas iden-tificados na abordagem anterior, mas que algumas das propostas, se implementadas, constituirão um avanço real para a utiliza-ção dos seus resultados. Palavras-chave: Avaliação do ensino su-perior. Provão. ENADE. SINAES.","authors":["Robert Evan","Verhine Lys","Maria Vinhaes","Dantas José"],"meta":[],"references":["237074083_O_contexto_institucional_e_politico_da_avaliacao_do_Ensino_Superior","44835426_Accountability_in_higher_education_Bridge_over_troubled_water","26342664_Valor_agregado_de_instituicoes_de_ensino_superior_em_Minas_Gerais_para_os_cursos_de_Direito_Administracao_e_Engenharia_Civil","291574865_Managing_quality_and_the_globalization_of_higher_education","225083847_International_comparisons_and_trends_in_external_quality_assurance_of_higher_education_Commonality_or_diversity","44841597_Assessment_in_Higher_Education_Student_Learning_Teaching_Programmes_and_Institutions"]}