{"id":"228627540_Graph-Based_and_Structural_Methods_for_Fingerprint_Classification","abstract":"Automatic Fingerprint Identification Systems (AFISs) are widely used for criminal investigations for matching the latent fingerprints found at the crime scene with those registered in the police database. As databases usually contain an enormous number of fingerprints, the time required to identify potential suspects can be extremely long. Therefore, a classification phase is performed to whittle down and thus speed up the search. Latent fingerprints are classified into five classes known as Henry classes. In this way each fingerprint only need to be matched against records of the corresponding class contained in the database. Many fingerprint classification methods have been proposed to date, but only a few of these exploit graph-based, or structural, representations of fingerprints. The results reported in the literature indicate that classical statistical methods outperform structural methods for benchmarking fingerprint databases. However, recent works have shown that graph-based methods can offer some advantages for fingerprint classification which warrant further investigation, especially when combined with statistical methods. This chapter opens with a critical review of the main graph-based and structural fingerprint classification methods. Then, these methods are compared with the statistical methods currently used for fingerprint classification. Experimental comparisons using a benchmarking fingerprint data base are described, and the benefits of fusing 2 graph-based and statistical methods are investigated. The chapter closes with some considerations on the present utility and future potential of graph-based methods for fingerprint classification.","authors":["Gian Luca Marcialis","Fabio Roli","Alessandra Serrau"],"meta":["January 2007Studies in Computational Intelligence 52","DOI:10.1007/978-3-540-68020-8_8"],"references":["240047245_Inexact_graph_matching_for_fingerprint_classification","228058014_Pattern_Classification","272353336_Biometirics_Personal_Identifiaction_in_Networked_Society","243773865_Classification_and_Uses_of_Finger_Prints","243743222_PCASYS_A_Pattern-Level_Classification_Automation_System_for_Fingerprints","225173414_A_Graph_Matching_Based_Approach_to_Fingerprint_Classification_Using_Directional_Variance","224377520_Type_Classification_of_Fingerprints_A_Syntactic_Approach","222925711_Allermann_G_Inexact_graph_matching_for_structural_pattern_recognition_Pattern_Recognition_Letters_14_245-253","222571319_Combining_Flat_and_Structured_Representations_for_Fingerprint_Classification_with_Recursive_Neural_Networks_and_Support_Vector_Machines","222270113_B_Moayer_KS_Fu_A_syntactic_approach_to_fingerprint_pattern_recognition_Pattern_Recognition_7_23"]}