{"id":"228628807_Decision_making_with_the_Analytic_Hierarchy_Process","abstract":"Decisions involve many intangibles that need to be traded off. To do that, they have to be measured along side tangibles whose measurements must also be evaluated as to, how well, they serve the objectives of the decision maker. The Analytic Hierarchy Process (AHP) is a theory of measurement through pairwise comparisons and relies on the judgements of experts to derive priority scales. It is these scales that measure intangibles in relative terms. The comparisons are made using a scale of absolute judgements that represents, how much more, one element dominates another with respect to a given attribute. The judgements may be inconsistent, and how to measure inconsistency and improve the judgements, when possible to obtain better consistency is a concern of the AHP. The derived priority scales are synthesised by multiplying them by the priority of their parent nodes and adding for all such nodes. An illustration is included.. He is internationally recognised for his decision-making process, the Analytic Hierarchy Process (AHP) and its generalisation to network decisions, the Analytic Network Process (ANP). He won the Gold Medal from the International Society for Multicriteria Decision Making for his contributions to this field. His work is in decision making, planning, conflict resolution and in neural synthesis.","authors":["Thomas L. Saaty"],"meta":["January 2008International Journal of Services Sciences 1(1):83-98","DOI:10.1504/IJSSCI.2008.017590"],"references":["346679467_Prediction_Projection_and_Forecasting","324625288_Analytical_Planning-The_Organisation_of_Systems","307800676_How_to_Make_a_Decision_The_Analytic_Hierarchy_Process","284907853_Decision_Making_for_Leaders_The_Analytical_Hierarchy_Process_for_Decisions_in_a_Complex_World","268886120_Multiple_Criteria_Decision_Analysis_State_of_the_Art_Surveys","268642685_Strategic_decision_making_Applying_the_analytic_hierarchy_process","265044117_Applications_of_Analytic_Network_Process_in_Entertainment_1","264952831_Decision_making_with_the_analytic_network_process_Economic_political_social_and_technological_applications_with_benefits_opportunities_costs_and_risks","247759512_The_Analytic_Hierarchy_Process_in_Natural_Resource_and_Environmental_Decision_Making","245124315_What_is_relative_measurement_The_ratio_scale_phantom","243774330_The_Logic_of_Priorities","222640005_Modeling_the_graduate_business_school_admissions_process","30480372_Supporting_medical_technology_development_with_the_analytic_hierarchy_process","4941219_How_to_Make_a_Decision_The_Analytic_Hierarchy_Process"]}