{"id":"228676698_Game_theory_for_cyber_security","abstract":"1 While there are significant advances in information technology and infrastructure which offer new opportunities, cyberspace is still far from completely secured. In many cases, the employed security solutions are ad hoc and lack a quantitative decision framework. While they are effective in solving the particular problems they are designed for, they generally fail to respond well in a dynamically changing scenario. To this end, we propose a holistic security approach in this paper. We find that game theory provides huge potential to place such an approach on a solid analytical setting. We consider the interaction between the attacks and the defense mechanisms as a game played between the attacker and the defender (system administrator). In particular, we propose a game theory inspired defense architecture in which a game model acts as the brain. We focus on one of our recently proposed game models, namely imperfect information stochastic game. Although this game model seems to be promising, it also faces new challenges which warrant future attention. We discuss our current ideas on extending this model to address such challenges.","authors":["S. Shiva","Sankardas Roy","Dipankar Dasgupta"],"meta":["April 2010","DOI:10.1145/1852666.1852704"],"references":["266017076_A_Stochastic_Game_Model_with_Imperfect_Information_in_Cyber_Security","224545222_MAC_Games_for_Distributed_Wireless_Network_Security_with_Incomplete_Information_of_Selfish_and_Malicious_User_Types","224123416_A_Survey_of_Game_Theory_as_Applied_to_Network_Security","220953975_On_modeling_and_simulation_of_game_theory-based_defense_mechanisms_against_DoS_and_DDoS_attacks","266066629_Competitive_Markov_Decision_Processes","236612285_An_Intrusion_Detection_Game_with_Limited_Observations","221609070_Protecting_Software_Code_by_Guards","220851820_Securing_Software_by_Enforcing_Data-flow_Integrity","220815772_Computing_Equilibria_in_Multiplayer_Stochastic_Games_of_Imperfect_Information","220320959_Nash_Q-Learning_for_General-Sum_Stochastic_Games"]}