{"id":"228627635_Solving_continuous_constraint_systems","abstract":"This paper provides an overview of the constraint techniques for solving non-linear sys-tems of equations over the real numbers. It introduces the main concepts behind the differ-ent pruning techniques and searching strategies implemented in the most famous constraint solvers over continuous domains. Local consistencies are a key issue in finite domains where arc-consistency is very pop-ular. However, in general it is not possible to achieve arc-consistency on constraint systems over the reals. That's why different relaxations of arc consistency have been proposed. Two of most popular local consistency techniques in continuous domains are analysed. The very general scheme of the filtering algorithm is also described. On difficult problems, local consistencies are often unable to achieve any significant pruning. This is due to the fact that the information provided by a single constraint is too poor to reduce the domains of the variables. The characteristics and capabilities of strong consistency filtering algorithms – which have been developed to achieve better pruning of the domains– are explained. Global constraints did really boost constraint techniques over finite domains. On contin-uous domains only a few global constraints are available. This paper describes two global constraints based more or less on dual approaches. Finally, searching strategies are also briefly discussed and some pointers to successful applications are provided.","authors":["Michel Rueher"],"meta":["January 2005"],"references":["284527425_Global_Optimization_Using_Interval_Analysis","266210888_Interval_computation_as_deduction_in_CHIP","248847335_Networks_of_constraints_fundamental_properties_and_applications","248683023_Deterministic_Global_Optimization_Theory","248212475_UniCalc_A_Novel_Approach_to_Solving_Systems_of_Algebraic_Equations","245346581_An_Interval_Method_to_Validate_Optimal_Solutions_of_the_Packing_Circles_in_a_Unit_Square_Problems","243770408_Convexi_cation_and_Global_Optimization_in_Continuous_and_Mixed-Integer_Nonlinear_Programming","242929790_Jointly_Constrained_Biconvex_Programming","242638017_Computational_Complexity_and_Feasibility_of_Data_Processing_and_Interval_Computations","242609440_Computer_Methods_for_the_Range_of_Functions"]}