{"id":"228615592_Towards_the_extraction_of_conceptual_information_from_corpora","abstract":"From a computational linguistics point of view, specifically related to information extraction, terminology uses statistical and rule-based methods (Cabré et. al. 2001) to extract terms from specialised texts. Furthermore, terminology needs to identify the corresponding definitions of a specific term. Often, when an author introduces a new term, which is not well known to the readers, he/she provides the definition emphasising the new concept with a set of syntactic and typographical features. We thus call definitional context the structure consisting of the term, the definition and the emphatic features in a specialised text. In order to develop a tool capable of extracting definitional contexts from annotated corpora, an inventory of recurrent patterns used by authors to introduce concepts is necessary, as well as a computational linguistic technique capable of identifying concepts from specialised texts. One of the objectives of the Language Engineering Group, from the Instituto de Ingeniería, UNAM (National Autonomous University of Mexico) is to extract conceptual information from corpora. For this reason, the group is working on the study of recurrent patterns in definitional contexts, the elaboration of an annotated corpus on engineering, and the development of the tools required for conceptual information extraction. In this paper we present the process of developing a definitional context extraction tool. First, we present the minimal elements of a definitional context. Second, we define a typology of all the recurrent patterns found in definitional contexts of Spanish specialised texts. Third, we present the kinds of tagging necessary. And fourth, we briefly mention the characteristics that a search engine must have. 2 Definitional contexts Our investigation is based on previous efforts such as the systematic identification of definitions based on lexical and metalinguistic patterns (Pearson, 1998), the analysis of Explicit Metalinguistic Operations (Rodríguez, 1999) and the analysis of Knowledge-Rich Contexts (Meyer, 2001).","authors":["Gerardo Sierra","Alfonso Medina-Urrea","Rodrigo Alarcón","César Antonio Aguilar"],"meta":["January 2003","Project: A formal scope on the relations between definitions and verbal predications"],"references":["233677417_The_conceptual_structure_of_terminological_definition_and_their_linguistic_realisations_A_report_on_research_in_progress"]}