{"id":"228626602_Calidad_en_objetos_de_aprendizaje","abstract":"In this work, we propose a system for quality measurement of Learning Objects (LO), when they are considered as software artifacts. The quality of Learning Objects is important not only in their usage dimension, but also for improve their design methods and techniques. The use and adaptation of the ISO/IEC 9126 standard to LO is presented. Before, some concepts and studies about LO quality, are reviewed. 1 Introducción El uso de Objetos de Aprendizaje (OA) ha permitido organizar los contenidos digitales orientados a la instrucción, en unidades independientes de manera de que puedan ser utilizados en diferentes contextos [1], por ejemplo en distintos LMS (Sistemas de Gestión del Aprendizaje). El proceso de construcción de estos recursos es complejo, y hace necesaria la utilización de conocimientos y habilidades diversos sobre los contenidos, las teorías sobre el aprendizaje y los métodos de diseño instruccional, entre otros. La evaluación de los OA es un elemento importante que incide, tanto en el diseño, como en la comprensión de sus valores utilitarios en los procesos de instrucción y de ayuda al aprendizaje. Son muy diversos los factores a considerar en la evaluación de los OA. El objetivo de este trabajo es revisar los modelos y enfoques de calidad que se aplican a los objetos de aprendizaje, para luego proponer un conjunto de atributos o rasgos a medir al considerarlos como artefactos de software. Este documento comienza presentando el concepto de OA y su relación con la Calidad. Luego se analizan estudios que discuten y proponen dimensiones de los Objetos de Aprendizaje que se relacionan con la calidad. Finalmente se proponen las características y los rasgos que pueden servir para la evaluar la calidad de estos recursos basado en la norma ISO/IEC 9126 (parte 1).","authors":["Christian Vidal-Castro","Alejandra Segura","Manuel E. Prieto"],"meta":["October 2008","DOI:10.13140/2.1.2402.9442","Conference: V Simposio Pluridisciplinar sobre Diseño y Evaluación de Contenidos Educativos ReutilizablesAt: Salamanca, SpainVolume: 1"],"references":["224061098_Work_in_Progress_Semantic_Metadata_for_Learning_Objects_Evaluation","306120005_Learning_objects_A_practical_definition","292717228_A_Convergent_Participation_Model_for_Evaluation_of_Learning_Objects","276934888_Standard_for_Learning_Object_Metadata","267680461_Establishing_technical_quality_criteria_for_Learning_Objects","243772982_Connecting_learning_objects_to_instructional_design_theory_A_definition","242546750_Connecting_learning_objects_to_instructional_design_theory_A_definition_a_metaphor_and_a_taxono","242529653_Evaluating_what_really_matters_in_computer-based_education","228641376_Learning_Object_Evaluation_Computer-Mediated_Collaboration_And_Inter-Rater_Reliability","224753600_Towards_a_model_of_quality_for_learning_objects"]}