{"id":"228686087_It_is_easy_to_determine_whether_a_given_integer_is_prime","abstract":"\"The problem of distinguishing prime numbers from composite numbers, and of resolving the latter into their prime factors is known to be one of the most important and useful in arithmetic. It has engaged the industry and wisdom of ancient and modern geometers to such an extent that it would be superfluous to discuss the problem at length. Nevertheless we must confess that all methods that have been proposed thus far are either restricted to very special cases or are so laborious and difficult that even for numbers that do not exceed the limits of tables constructed by estimable men, they try the patience of even the practiced calculator. And these methods do not apply at all to larger numbers. It frequently happens that the trained calculator will be sufficiently rewarded by reducing large numbers to their factors so that it will compensate for the time spent. Further, the dignity of the science itself seems to require that every possible means be explored for the solution of a problem so elegant and so celebrated. It is in the nature of the problem that any method will become more complicated as the numbers get larger. Nevertheless, in the following methods the difficulties increase rather slowly. The techniques that were previously known would require intolerable labor even for the most indefatigable calculator.\".","authors":["Andrew Granville"],"meta":["October 2004Bulletin of the American Mathematical Society 42(1)","DOI:10.1090/S0273-0979-04-01037-7"],"references":["2742894_There_are_Infinitely_Many_Carmichael_Numbers","321521045_The_New_Book_of_Prime_Number_Records","316799464_Prime_Numbers","265453193_On_Distinguishing_Prime_Numbers_from_Composite_Numbers","246377247_Hilbert''s_Tenth_Problem","243771083_The_Brun-Titchmarsh_Theorem_on_average","243657385_The_Book_of_Prime_Number_Records","240324818_The_Prime_Numbers_and_Their_Distribution","239060590_Prime_Numbers_A_Computational_Perspective","232012998_On_the_number_of_primes_p_for_which_pa_has_a_large_prime_factor","228908623_On_some_subgroups_of_the_multiplicative_group_of_finite_rings","226904112_Thorme_de_Brun-Titchmarsh_application_au_thorme_de_Fermat","221590614_Almost_All_Primes_Can_Be_Quickly_Certified","221499717_On_Distinguishing_Prime_Numbers_from_Composite_Numbers_Abstract","46946143_Primality_Testing_and_Abelian_Varieties_Over_Finite_Fields","3082825_New_Directions_in_Cryptography","2538368_Twenty_Years_of_Attacks_on_the_RSA_Cryptosystem","2104662_Sharpening_PRIMES_is_in_P_for_a_large_family_of_numbers"]}