{"id":"228612518_Competencies_in_the_21st_century","abstract":"Purpose\nThe purpose of this paper is to show that development of competencies needed to be effective managers and leaders requires program design and teaching methods focused on learning. This is the introductory essay to this special issue of JMD .\n\nDesign/methodology/approach\nCompetencies are defined and an overview is provided for the eight papers that will follow with original research on competencies, their link to performance in various occupations, and their development.\n\nFindings\nEmotional, social and cognitive intelligence competencies predict effectiveness in professional, management and leadership roles in many sectors of society. In addition, these competencies can be developed in adults.\n\nResearch limitations/implications\nAs an introductory essay, this lays the foundation for the papers in this issue.\n\nPractical implications\nCompetencies needed to be effective can be developed.\n\nOriginality/value\nDespite widespread application, there are few published studies of the empirical link between competencies and performance. There are even fewer published studies showing that they can be developed. This special issue will add to both literatures.","authors":["Richard E. Boyatzis"],"meta":["January 2008Journal of Management Development 27(1)","DOI:10.1108/02621710810840730"],"references":["297370355_A_complexity_perspective_on_intentional_change_in_careers","282708564_Developing_emotional_intelligence_competencies","247813294_The_Competent_Manager_A_Model_For_Effective_Performance","316506004_Promoting_Emotional_Intelligence_in_Organizations","304813630_Competence_at_Work_Models_for_Superior_Performance","284529560_The_General_Managers","276190504_The_Critical_Incident_Technique","271290452_Psychosocial_Correlates_of_Job_Strain_in_a_Sample_of_Working_Women","270113229_How_College_Affects_Students_Findings_and_Insights_From_Twenty_Years_of_Research","269489468_A_New_Case_for_the_Liberal_Arts_Assessing_Institutional_Goals_and_Student_Development"]}