{"id":"228659206_Game_inspired_tool_support_for_e-learning_processes","abstract":"Student engagement is crucial to the success of e-learning but is often difficult to achieve in practice. One significant factor is the quality of the learning content; also important, however, is the suitability of the process through which that material is studied. In recent years much research has been devoted to improving e-learning content but considerably less attention given to enhancing the associated e-learning process. This paper focuses on that process, considering in particular how student engagement might be improved using techniques common in digital games. The work is motivated by a belief that, with careful design, e-learning systems may be able to achieve the levels of engagement expected of digital games. In general, such games succeed by entertaining players, building on their natural curiosity and competitiveness to encourage them to continue to play. This paper supports a belief that by adopting some of the engagement techniques used in games, e-learning can become equally successful. In particular, the paper considers how the learning process might become a form of game that helps sustain continued study. Factors affecting engagement and elements of digital games that make them engaging are identified. A proposal for improving engagement is then outlined. The approach is to encourage student involvement by rewarding desirable behaviour, including the completion of optional challenges, and giving regular feedback on performance, measured against others in the same class. Feedback is provided through a web-based tool. The paper describes an exploratory assessment of both the tool and approach through action research. Results for two linked university modules teaching software development are presented. The results so far are very encouraging in that student engagement and performance have increased, especially at the weaker end of the class. Limitations of the approach are also outlined, together with an indication of future research plans.","authors":["Therese Charles","David Bustard","Michaela M. Black"],"meta":["January 2008"],"references":["283159673_Motivation_in_the_Classroom_Reciprocal_Effects_of_Teacher_Behavior_and_Student_Engagement_Across_the_School_Year","263325242_Rich_Picture_Building_in_the_Soft_Systems_Methodology","257926467_E-Learning_Strategies_for_Delivering_Knowledge_in_the_Digital_Age","246534901_Inventing_Better_Schools_an_Action_Plan_for_Educational_Reform","245112823_A_Theory_of_Fun_for_Game_Design","242610157_Early_Attrition_among_First_Time_eLearners_A_Review_of_Factors_that_Contribute_to_Drop-out_Withdrawal_and_Non-completion_Rates_of_Adult_Learners_undertaking_eLearning_Programmes","238687478_Making_learning_fun_A_taxonomy_of_intrinsic_motivations_for_learning","237923230_Michael_Allen''s_Guide_to_e-Learning","237035484_Theoretical_Foundations_of_Learning_Environments","234815800_Don't_Bother_Me_Mom--I'm_Learning"]}