{"id":"228690293_Role_joue_par_l'economie_informelle_dans_l'appropriation_des_TIC_en_milieu_urbain_en_Afrique_de_l'Ouest","abstract":"Résumé : L'économie « informelle » concerne des activités directement liées aux évolutions les plus contemporaines. Celles liées à l'insertion des TIC dans les territoires sont autant de manifestations d'une « invention paradoxale de la modernité » [JF Bayart 1994] par rapport au modèle classique universaliste de la modernisation diffusé par l'Occident. Après avoir exposé brièvement ce que l'on entend par « informel » selon différentes approches disciplinaires, on montrera comment l'insertion et l'appropriation des TIC dans les villes Africaines donne lieu à une prolifération d'activités nouvelles de service qui s'incrustent dans le tissu urbain, s'adaptent au faible niveau de revenu des populations et génèrent des emplois plus ou moins qualifiés qui relèvent totalement ou en partie de pratiques informelles. On s'interrogera enfin sur la prolifération de cette « autre économie » expression de la mondialisation. Mots clés : TIC et économie informelle – Afrique de l'Ouest – formes d'appropriation Summary: The \"informal\" economy concerns activities directly bound to the most contemporary evolutions. Those related with the insertion of the ICTs in territories are demonstrations of a \" paradoxical invention of the modernity \" [JF Bayart 1994] with regard to the universalist classic model of the modernization spread by the West. Having explained briefly what we understand by \"informal\" according to various disciplinary approaches, we shall show how the insertion and the appropriation of the ICTs in the African cities gives place to a proliferation of new activities of service which are embedded in the urban fabric, adapt themselves to the low level of income of the populations and generate more or less qualified jobs which recover totally or partially from informal practices. We shall wonder finally about the proliferation of this \" other economy \" expression of the globalization.","authors":["Annie Chéneau-Loquay"],"meta":["June 2008Netcom 2008-1(22-1/2)","DOI:10.4000/netcom.2013"],"references":["242658896_A_Respeito_de_Alguns_Desafios_Contemporaneos_da_Informalidade_Economica_aproximando_a_Africa_Ocidental_e_o_Brasil","259999207_Grands_commercants_d'Afrique_de_l'Ouest_logiques_et_pratiques_d'un_groupe_d'hommes_d'affaires_contemporains","242276748_Disponibilites_et_usages_des_technologies_de_la_communication_dans_les_espaces_de_l'echange_au_Senegal","30986432_The_Mourides_of_Senegal_the_political_and_economic_organization_of_an_Islamic_brotherhood","30439476_L'informel_internationalise_ou_la_subversion_de_la_territorialite"]}