{"id":"228666533_Etudier_le_potentiel_de_developpement_des_utilisateurs_pour_concevoir_un_instrument_didactique","abstract":"instrument didactique destiné à améliorer l'enseignement du français langue de scolarisation (FLSco) auprès d'élèves allophones implique de construire un modèle de l'utilisateur (l'enseignant) fondé sur une analyse de ses pratiques. Les résultats d'un questionnaire original visant à cerner l'espace de développement de l'activité des enseignants sont présentés ici ; ils permettent d'affiner la conception de l'instrument qui sera continuée dans l'usage. MOTS-CLÉS : conception d'instrument ; développement professionnel ; Français Langue de Scolarisation (FLSco) ; didactique du français ; psychologie ergonomique 1. Problématique Formateurs en IUFM, nous sommes témoins des difficultés rencontrées par les enseignants qui accueillent les élèves allophones dans les classes spécialisées de l'enseignement primaire en France. Cet enseignement ne faisant pas l'objet d'un cadrage officiel, ils recourent en conséquence, le plus souvent, « aux outils et aux démarches empruntés au français langue étrangère » (Verdelhan-Bourgade, 2002, p.77). Chercheurs en didactique, nous nous efforçons donc de produire des connaissances utiles pour surmonter ces difficultés qui découlent en grande partie de l'absence d'outils didactiques adaptés à l'enseignement du français langue de scolarisation (Chiss, Marcus & Vigner, 2001). Contrairement aux injonctions des textes réglementaires du ministère de l'éducation nationale (2002), les instruments disponibles visent presque exclusivement l'apprentissage de l'oral au détriment de celui de l'écrit, renvoyé à plus tard ou à la classe ordinaire. C'est pourquoi nous avons entrepris de concevoir un nouvel instrument dans le domaine de la langue écrite et de théoriser notre processus de conception qui accorde une place centrale aux utilisateurs que sont les enseignants.","authors":["Sylvie Courally","Roland Goigoux"],"meta":[],"references":["324946171_Concevoir_un_instrument_didactique_pour_ameliorer_l'enseignement_de_la_comprehension_de_textes","271151464_Entretiens_en_auto-confrontation_croisee_Une_methode_en_clinique_de_l'activite","255645127_Formes_et_enjeux_de_l'analyse_de_l'activite_pour_la_conception_des_systemes_de_travail","276935304_Modeles_du_sujet_pour_la_conception_dialectiques_activites_developpement","269665978_L'acculturation_a_l'ecrit_dans_les_pratiques_et_les_instruments_des_maitres_en_situation_d'enseignement_du_francais_langue_de_scolarisation","246677993_Les_Hommes_et_les_Technologies_Approche_Cognitive_des_Instruments_Contemporains"]}