{"id":"228680178_Efficient_Sparse_Matrix-Vector_Multiplication_on_CUDA","abstract":"The massive parallelism of graphics processing units (GPUs) offers tremendous performance in many high-performance computing applications. While dense linear algebra readily maps to such platforms, harnessing this potential for sparse matrix computations presents additional challenges. Given its role in iterative methods for solving sparse linear systems and eigenvalue problems, sparse matrix-vector multiplication (SpMV) is of singular importance in sparse linear algebra. In this paper we discuss data structures and algorithms for SpMV that are efficiently implemented on the CUDA platform for the fine-grained parallel architecture of the GPU. Given the memory-bound nature of SpMV, we emphasize memory bandwidth efficiency and compact storage formats. We consider a broad spectrum of sparse matrices, from those that are well-structured and regular to highly irregular matrices with large imbalances in the distribution of nonzeros per matrix row. We develop methods to exploit several common forms of matrix structure while offering alternatives which accommodate greater irregularity. On structured, grid-based matrices we achieve performance of 36 GFLOP/s in single precision and 16 GFLOP/s in double precision on a GeForce GTX 280 GPU. For unstructured finite-element matrices, we observe performance in excess of 15 GFLOP/s and 10 GFLOP/s in single and double precision respectively. These results compare favorably to prior state-of-the-art studies of SpMV methods on conventional multicore processors. Our double precision SpMV performance is generally two and a half times that of a Cell BE with 8 SPEs and more than ten times greater than that of a quad-core Intel Clovertown system.","authors":["Nathan Bell","Michael Garland"],"meta":["January 2009"],"references":["225109587_Solving_Dense_Linear_Systems_on_Graphics_Processors","220857607_Vectorized_Sparse_Matrix_Multiply_for_Compressed_Row_Storage_Format","220492248_Basic_linear_algebra_subprograms_for_FORTRAN_usage","213879310_Sparsity_Optimization_Framework_for_Sparse_Matrix_Kernels","29617855_Concurrent_Number_Cruncher_-_A_GPU_implementation_of_a_general_sparse_linear_solver","4355176_Approximation_Algorithms_for_Scheduling_Unrelated_Paralle_Machines","2434555_Toward_The_Optimal_Preconditioned_Eigensolver_Locally_Optimal_Block_Preconditioned_Conjugate_Gradient_Method","2298350_Segmented_Operations_for_Sparse_Matrix_Computation_on_Vector_Multiprocessors","230649887_Iterative_Methods_for_Sparse_Linear_Systems","224581828_Benchmarking_GPUs_to_tune_dense_linear_algebra","220782194_Optimization_of_sparse_matrix-vector_multiply_on_emerging_multicore_platforms","213877997_Scalable_Parallel_Programming_with_CUDA","202260509_Scan_Primitives_for_GPU_Computing","24298853_SPARSKIT_A_basic_tool_kit_for_sparse_matrix_computations","3216496_NVIDIA_Tesla_A_unified_graphics_and_computing_architecture","2787737_Prefix_Sums_and_Their_Applications"]}