{"id":"228724119_Social_Informatics_An_Emerging_Discipline","abstract":"The concept of Social Informatics emerged along with the growing role of information and communication technologies ('ICT') in the 1970s and was articulated in Rob Kling's work in the 1980s and 1990s. In recent years, the notion of Social Informatics has been rapidly expanding in various contexts. Following an overview of related activities on the University of Ljubljana website (http://social-informatics.org) we can identify three broad contexts of Social informatics. The first area is the interaction of ICT with humans at the personal, organizational and society levels. The second direction involves ICT applications in the public/social sphere, encompassing modelling, simulations and information systems through to various e-applications and information architecture. The third segment relates to ICT as a tool in social science research ranging from ICT-supported statistical analysis, computer-assisted data collection to virtual collaboration and cyber-infrastructure. Within this scope we encounter numerous research activities (i.e. journals, events, associations, research institutes, projects...) related to Social Informatics, including a growing number of university study programmes. However, the dynamics, dispersion, fragmentation and lack of common framework, as well as the increasing number of competitive concepts (e.g. e-social science) could prevent Social Informatics effectively establishing itself as a discipline with all the necessary formal attributes and well-defined boarders.","authors":["Vasja Vehovar"],"meta":["September 2006","DOI:10.1007/978-0-387-37876-3_6","SourceOAI","Conference: IFIP International Conference on Human Choice and Computers"],"references":["2239102_Learning_from_Social_Informatics_Information_and_Communication_Technologies_in_Human_Contexts","294354713_Bulletin_of_the_American_Society_for_Information_Science_In_this_Issue","262396475_The_New_Informatics","230291227_Social_informatics","220677174_Informatics_A_brief_survey","220536645_Is_Community_Informatics_Good_for_Communities_Questions_Confronting_an_Emerging_Field","220436952_On_extending_social_informatics_from_a_rich_legacy_of_networks_and_conceptual_resources","37608947_Critical_Professional_Education_about_Information_and_Communications_Technologies_and_Social_Life","2535404_Teaching_Social_Informatics_as_a_knowledge_project","2488922_What_Is_Social_Informatics_and_Why_Does_It_Matter"]}