{"id":"228776617_Un_algoritmo_voraz_para_resolver_el_problema_de_la_programacion_de_tareas_dependientes_en_maquinas_diferentes","abstract":"RESUMEN La planificación industrial ha experimentado notables avances desde sus orígenes a mediados del siglo XX tanto en importancia de aplicación dentro de todas las industrias en donde es usada, como en la eficiencia y sofisticación de los algoritmos que buscan resolver todas sus variantes existentes. El interés por la aplicación de métodos heurísticos ante la necesidad de dar respuestas a los problemas del área de planificación nos ha llevado a desarrollar nuevos algoritmos para resolver una de las variantes del problema de la planificación desde el punto de vista de la Inteligencia Artificial: la programación de tareas o task scheduling definida como un conjunto de tareas dependientes de una línea de producción a ser programadas en un determinado grupo de máquinas diferentes, encontrar un orden adecuado de ejecución que minimice el tiempo total de trabajo de las máquinas o makespan. El presente trabajo muestra un algoritmo voraz para resolver dicha variante del problema del task scheduling. Palabras clave: algoritmos golosos, programación de tareas, optimización combinatoria, heurísticas, Inteli-gencia Artificial.","authors":["Manuel Tupia","David Mauricio"],"meta":["January 2004"],"references":["267778877_Heuristicas_para_secuenciamiento_de_tareas_en_lineas_de_flujo","257525955_Secuenciacion_de_tareas_de_ensamblado_con_recursos_limitados_mediante_algoritmos_de_exploracion_de_entornos","324396846_Plans_and_the_Structure_of_Behavior","263336483_A_grasp_for_single_machine_scheduling_with_sequence_dependent_setup_costs_and_linear_delay_penalties","247442902_Introduction_To_Algorithms","242639238_Plans_and_the_structure_of_behavior","242499995_Theory_of_Scheduling","240159677_Optimization_modeling_with_LINGO","238317684_Single_machine_scheduling_to_minimize_earliness_subject_to_no_tardy_jobs","237135374_Aplicacion_de_una_heuristica_de_busqueda_tabu_en_un_problema_de_programacion_de_tareas_en_linea_flexible_de_manufactura"]}