{"id":"228730784_Approximation_in_Mechanism_Design","abstract":"This paper considers three challenge areas for mechanism design and describes the role approximation plays in resolving them. Challenge 1: optimal mechanisms are finely tuned to precise details of the distribution on agent preferences. Challenge 2: in environments with multi-dimensional agent preferences economic analysis has failed to provide generic characterizations optimal mechanisms. Challenge 3: optimal mecha-nisms are parameterized by unrealistic knowledge of the distribution of agents' private preferences. The theory of approximation is well suited to address these challenges. While the optimal mechanism may require precise distributional assumptions, there may be approximately optimal mechanism that depends only on natural characteris-tics of the distribution. While the multi-dimensional optimal mechanism may resist precise economic characterization, there may be simple description of approximately optimal mechanisms. While the optimal mechanism may be parameterized by the distribution of the agents' private preferences, there may be a single mechanism that approximates the optimal mechanism for any distribution. Finally, these approximately optimal mechanisms, because of their simplicity and tractability, may be more likely to arise in practice, thus making the theory of approximately optimal mechanism more descriptive than that of (precisely) optimal mechanisms. This paper surveys positive resolutions to these challenges with emphasis on basic techniques, relevance to practice, and future research directions for approximation in mechanism design.","authors":["Jason D. Hartline"],"meta":["January 2010American Economic Review 102(3)","DOI:10.1145/1807406.1807441"],"references":["247508003_Sharin_g_the_Cost_of_Multicast_Transmission","313100149_Optimal_auction_design","284039089_Reducibility_among_combinatorial_problems","245809709_Counterspeculation_Auctions_and_Sealed_Tenders","236221580_Multipart_Pricing_of_Public_Goods","227538580_Robust_Mechanism_Design","223930335_Chapter_5_Implementation_theory","222651018_Reducing_Mechanism_Design_to_Algorithm_Design_via_Machine_Learning","222581798_Sharing_the_Cost_of_Multicast_Transmissions","222513546_Derandomization_of_auctions"]}