{"id":"228701265_Deciding_On_the_Number_of_Classes_In_Latent_Class_Analysis_and_Growth_Mixture_Modeling_A_Monte_Carlo_Simulation_Study","abstract":"Mixture modeling is a widely applied data analysis technique used to identify unobserved heterogeneity in a population. Despite mixture models' usefulness in practice, one unresolved issue in the application of mixture models is that there is not one commonly accepted statistical indicator for deciding on the number of classes in a study population. This article presents the results of a simulation study that examines the performance of likelihood-based tests and the traditionally used Information Criterion (ICs) used for determining the number of classes in mixture modeling. We look at the performance of these tests and indexes for 3 types of mixture models: latent class analysis (LCA), a factor mixture model (FMA), and a growth mixture models (GMM). We evaluate the ability of the tests and indexes to correctly identify the number of classes at three different sample sizes (n D 200, 500, 1,000). Whereas the Bayesian Information Criterion performed the best of the ICs, the bootstrap likelihood ratio test proved to be a very consistent indicator of classes across all of the models considered.","authors":["Karen Nylund-Gibson","Tihomir Asparouhov","Bengt O. Muthén"],"meta":["October 2007Structural Equation Modeling A Multidisciplinary Journal 14(4):535-569","DOI:10.1080/10705510701575396"],"references":["281378561_Identifying_the_correct_number_of_classes_in_growth_mixture_models","276323261_Latent_class_models","266363514_Comparing_approaches_for_testing_the_number_of_components_in_a_finite_mixture_model","254817517_Latent_Class_Models_for_Clustering_A_Comparison_with_K-means","247503361_Goodness-of-Fit_Testing_for_Latent_Class_Models","238190464_Applied_Latent_Class_Analysis_Models","287936351_Estimating_the_dimension_of_a_model","271112449_Latent_Class_Analysis","247722886_Testing_the_number_of_components_in_a_normal_mixture","243043704_Piecewise_Growth_Mixture_Modeling_of_Adolescent_Alcohol_Use_Data"]}