{"id":"228790563_Une_nouvelle_representation_vectorielle_pour_la_classification_semantique","abstract":"RÉSUMÉ. L'idée que nous défendons dans cet article est qu'il est possible d'obtenir des concepts sémantiques significatifs par des méthodes de classification automatique. Pour ce faire, nous commençons par proposer des mesures permettant de quantifier les relations sémantiques entre mots. Ensuite, nous utilisons les méthodes de classification non supervisée pour construire les concepts d'une manière automatique. Nous testons alors deux méthodes de partitionnement : l'algorithme des K-means et les cartes de Kohonen. Ensuite, nous utilisons le réseau bayésien AutoClass conçu pour la classification non supervisée. Pour grouper les mots du vocabulaire en différentes classes, nous avons testé trois représentations vectorielles des mots. La première est une représentation contextuelle simple. La deuxième associe à chaque mot un vecteur de valeurs représentant sa similarité avec tous les mots du lexique. Enfin, la troisième représentation est une combinaison des deux premières. ABSTRACT. The idea we defend in this paper is the possibility to obtain significant semantic con-cepts using clustering methods. We start by defining some semantic measures to quantify the semantic relations between words. Then, we use some clustering methods to build up concepts in an automatic way. We test two well known methods : the K-means algorithm and the Ko-honen maps. Then, we propose the use of a Bayesian network conceived for clustering and called AutoClass. To group the words of the vocabulary in various classes, we test three vector representations of words. The first is a simple contextual representation. The second associates to each word a vector which represents its similarity with each word of the vocabulary. The third representation is a combination of the first and the second one. MOTS-CLÉS : classification automatique, concepts sémantiques, représentation vectorielle des mots.","authors":["Salma Jamoussi"],"meta":["September 2010TAL Traitement Automatique des Langues 50(3)"],"references":["278745364_A_complete_understanding_speech_system_based_on_semantic_concepts","236595533_Extraction_automatique_du_sens_d'une_phrase_en_langue_Francaise_par_une_approche_neuronale","242821088_A_Maximum_Entropy_approach_to_adaptive_statistical_language_modeling","222499378_WEBSOM_-_Self-organizing_maps_of_document_collections","222452871_Natural_Language_Processing_With_Modular_Pdp_Networks_and_Distributed_Lexicon","222449846_Finding_Structure_in_Time","221490199_Semi-Automatic_Acquisition_of_Domain-Specific_Semantic_Structures","221397810_Using_Kullback-Leibler_Distance_for_Text_Categorization","220049032_Some_Methods_for_Classification_and_Analysis_of_MultiVariate_Observations","50336131_Information_Theory_And_Statistics"]}