{"id":"228706578_Engagement_semantique_et_engagement_ontologique_conception_et_realisation_d'ontologies_en_ingenierie_des_connaissances","abstract":"Résumé La représentation formelle et symbolique des connaissances repose sur des langages formels composés d'une part de règles syntaxiques génératives pour la construction de formules et d'autre part de règles de composition sémantique associant aux formules construites une signification. La construction syntaxique assemble les formules à partir de primitives dont le sens se compose pour donner la signification des formules. La tâche des ontologies est définir quelles primitives munies de leur signification sont nécessaires pour la représentation des connaissances dans un contexte donné. Définir une ontologie est une tâche de modélisation menée à partir de l'expression linguistique des connaissances. La modélisation s'effectue en trois étapes, correspondant à trois engagements : un engagement sémantique, fixant le sens linguistique des concepts, un engagement ontologique fixant leur sens formel et enfin un engagement computationnel déterminant leur exploitation effective. Nous présentons ici ces trois types d'engagement et explicitons les étapes de l'élaboration d'une ontologie. Mots clés : Ontologie, terminologie, engagement sémantique, engagement ontologique, sémantique formelle, sémantique différentielle. Abstract The symbolic and formal representation of knowledge relies on formal languages. Formal languages consist of generative syntactic rules, that build formula, and of semantic compositional rules that associate formula with meaning. The syntactic building of formula and their compositional semantics rely on primitives. The aim of ontologies is to define which primitives must be used in knowledge representation tasks. Defining an ontology is a modelling task starting from the linguistic expression of knowledge. Ontology modelling is a three-step process. First, the semantic commitment specifies the linguistic meaning of concepts. Second the ontological commitment specifies their formal meaning. Finally, the computational commitment specifies their effective computer-based use. This paper presents those three commitments and explains the main steps that must be followed in ontological modelling.","authors":["Bruno Bachimont"],"meta":[],"references":["30453390_Artefacture_des_machines_qui_pensent_aux_machines_qui_donnent_a_penser","320182224_Idees_directrices_pour_une_phenomenologie","276935659_Ontologie_et_reutilisabilite_experience_et_discussion","273097601_Semantique_Interpretative","262314091_Formal_Ontology_Conceptual_Analysis_and_Knowledge_Representation","244437488_A_Translation_Approach_to_Portable_Ontology_Specifications","25911115_UMLS_semantic_network","2820173_Menelas_Coding_and_Information_Retrieval_from_Natural_Language_Patient_Discharge_Summaries"]}