{"id":"228850003_Predict_the_onset_of_diabetes_disease_using_Artificial_Neural_Network_ANN","abstract":"Diabetes Mellitus is a chronic metabolic disorder, where the improper management of the blood glucose level in the diabetic patients will lead to the risk of heart attack, kidney disease and renal failure. Data Classification is a prime task in Data mining. Accurate and simple data classification task can help the clustering of large dataset appropriately. In this paper we have experimented and suggested an Artificial Neural Network (ANN) based classification model as one of the powerful method in intelligent field for classifying diabetic patients into two classes. For achieving better results, genetic algorithm (GA) is used for feature selection. The GA is used for optimally finding out the number of neurons in the single hidden layered model. Further, the model is trained with Back Propagation (BP) algorithm and GA (Genetic Algorithm) and classification accuracies are compared. The designed models are also compared with the Functional Link ANN (FLANN) and several classification systems like NN (nearest neighbor), kNN(k-nearest neighbor), BSS(nearest neighbor with backward sequential selection of feature, MFS1(multiple feature subset) , MFS2(multiple feature subset) for Data classification accuracies. It is revealed from the simulation that our suggested model is performing better compared to NN(nearest neighbor), kNN(k-nearest neighbor), BSS(nearest neighbor with backward sequential selection of feature, MFS1(multiple feature subset) , MFS2(multiple feature subset) and FLANN model and it can be a very good candidate for many real time domain applications as these are simple with good performances.","authors":["Manaswini Pradhan","Dr Ranjit","Kumar Sahu"],"meta":["January 2011"],"references":["220815580_Bayesian_Classification_with_Correlation_and_Inheritance","2770021_Learning_Classification_Trees","283996103_Genetic_Algorithms_In_Search_Optimization_and_Machine_Learning","281153249_Uniform_convergence_of_relative_frequencies_of_events_to_their_probabilities_theory_of_pobility_and_its_applications","277290823_Nearest_Neighbor_Classification_from_Multiple_Feature_Subsets","236562142_Adaptive_Pattern_Recognition_and_Neural_Netw","220929384_Speaker-Independent_Speech_Recognition_by_Means_of_Functional-Link_Neural_Networks","216721999_Pattern_Classification_and_Scene_Analysis","37530442_Neural_Networks_for_Nonlinear_Dynamic_System_Modelling_and_Identification","11353993_Hybrid_Neural_Modeling_Of_Bioprocesses_Using_Functional_Link_Networks","5600561_Identification_of_nonlinear_dynamic_systems_using_functional_link_artificial_neural_networks","3081159_Nearest_neighbor_pattern_classification_IEEE_Trans_Inf_Theory_IT-13121-27"]}