{"id":"228814699_Semantic_modeling_of_virtual_environments_using_MASCARET","abstract":"Many Virtual Reality (VR) applications, such as Virtual Learning Environments or Interactive Virtual Tours, are based on a rich se-mantic description of the environment and tasks that users have to perform. These applications are built upon Virtual Environments (VEs) in which artificial agents act autonomously while interacting in realtime with users. Semantic modelling of a VR environment makes it possible the knowledge-driven access from the description of VEs that simplifies the development of VR applications. It eases the development of these types of applications. Semantic modelling should provide a consistent representation of the following aspects: 1) The simulated world, its structure and the behavior of its enti-ties, 2) Interactions and tasks, that users and agents can perform in the environment, 3) Knowledge items, that autonomous agents can use for decision-making or for communication with users. This paper presents MASCARET, a model-based approach, for the de-sign of semantic VR environments. This approach is based on the Unified Modeling Language (UML). In this approach, UML is used to provide a knowledge-driven access to the semantic contents of the VE and not for code generation, as in classical software de-velopment process. Interests of a UML-based approach are that its metamodel covers different views of the semantic modelling: on-tology, structure, behaviors, interactions, activities. It is also an extensible language that can be specialized to provide formal oper-ational semantics. We also present how MASCARET can be used to develop content-rich interactive applications that can be deployed over various VR platforms. Finally, we discuss the benefits of such a metamodel-based approach and show how the multi-layer seman-tic model can be used in different VR applications, in which adap-tive behaviors of artificial agents acting within complex environ-ments have to be simulated.","authors":["Pierre Chevaillier","Thanh-Hai Trinh","Mukesh Barange","Pierre De Loor"],"meta":["January 2011","DOI:10.1109/SEARIS.2012.6231174"],"references":["290650674_Towards_Intelligent_VR_-_Multi-layered_Semantic_Reflection_for_Intelligent_Virtual_Environments","280990059_PEGASE_A_Generic_and_Adaptable_Intelligent_System_for_Virtual_Reality_Learning_Environments","260981403_Semantic_Reflection_for_Intelligent_Virtual_Environments","232625844_Coupling_Ontologies_with_Graphics_Content_for_Knowledge_Driven_Visualization","228634283_Engineering_MAS_environment_with_artifacts","228591490_Intelligent_Virtual_Environments-A_state-of-the-art_report","242495381_A_Conceptual_Modelling_Approach_for_Behaviour_in_Virtual_Environments_using_a_Graphical_Notation_and_Generative_Design_Patterns","235720430_OWL_Web_Ontology_Language_Semantics_and_Abstract_Syntax","234783291_The_Object_Constraint_Language_Second_Edition_Getting_Your_Models_Ready_for_MDA","228642351_The_semantics_of_multi-user_virtual_environments"]}