{"id":"228872057_How_Does_Technology-Enabled_Active_Learning_Affect_Undergraduate_Students'_Understanding_of_Electromagnetism_Concepts","abstract":"Educational technology supports meaningful learning and enables the presentation of spatial and dynamic images, which portray relationships among complex con-cepts. The Technology-Enabled Active Learning (TEAL) Project at the Massachu-setts Institute of Technology (MIT) involves media-rich software for simulation and visualization in freshman physics carried out in a specially redesigned classroom to facilitate group interaction. These technology-based tec learning materials are especially useful in electromagnetism to help students conceptualize phenomena and processes. This study analyzes the effects of the unique learning environment of the TEAL project on students ’ cognitive and affective outcomes. The assessment of the project included examining students ’ conceptual understanding before and after studying electromagnetism in a media-rich environment. We also investigated the effect of this environment on students ’ preferences regarding the various teaching methods. As part of the project, we developed pre- and posttests consisting of conceptual questions from standardized tests, as well as questions designed to assess the effect of visualizations and experiments. The research population consisted of 811 undergraduate students. It consisted of a small- and a large-scale experimental groups and a control group. TEAL students improved their conceptual understanding","authors":["Yehudit Judy Dori","John Belcher"],"meta":["January 2004Journal of the Learning Sciences 14(2)","DOI:10.1207/s15327809jls1402_3"],"references":["285276742_Learning_in_Science_-_From_Behaviourism_Towards_Social_Constructivism_and_Beyond","269151906_Preservice_Teachers'_Classroom_Practice_and_Their_Conceptions_of_the_Nature_of_Science","264417442_Conceptual_Change_in_Science_and_in_the_Learning_of_Science","260975044_Difficulties_in_learning_the_concept_of_electric_field","312903536_Conceptual_change_within_and_across_ontological_categories_Examples_from_learning_and_discovery_in_science","289837976_Science_Curriculum_Transforming_Goals_to_Practices","280016272_Visual-Spatial_thinking_An_aspect_of_science_overlooked_by_educators","279933427_Learning-for-Use_A_Framework_for_the_Design_of_Technology-Supported_Inquiry_Activities","269166938_Mind_in_Society","261620472_Creating_Usable_Innovations_in_Systemic_Reform_Scaling_Up_Technology-Embedded_Project-Based_Science_in_Urban_Schools"]}