{"id":"228921156_Human_Language_Technologies","abstract":"A tension exists between the increasingly rich semantic models in knowledge management systems and the continuing prevalence of human language materials in large organisations. The process of tying semantic models and natural language together is referred to as semantic annotation, which may also be char-acterized as the dynamic creation of bidirectional relationships between ontologies and unstructured and semi-structured documents. Information extraction (IE) takes unseen texts as input and produces fixed-format, unambiguous data as output. It involves processing text to identify selected infor-mation, such as particular named entities or relations among them from text docu-ments. Named entities include people, organizations, locations and so on, while relations typically include physical relations (located, near, part-whole, etc.), per-sonal or social relations (business, family, etc.), and membership (employ-staff, member-of-group, etc.). Ontology-based information extraction (OBIE) can be adapted specifically for semantic annotation tasks. An important difference between traditional IE and OBIE is the latter's closely coupled use of an ontology as one of the system's resources – the ontology serves not only as a schema or list of classifications in the output, but also as input data – its structure affects the training and tagging processes. We present here two ontology-based developments for information extrac-tion. OBIE experiments demonstrate clearly that the integration of ontologies as a knowledge source within HLT applications leads to improved perform-ance. Another important finding is that computational efficiency of the under-lying machine learning methods is especially important for HLT tasks, as the system may need to train hundreds of classifiers depending on the size of the ontology.","authors":["Kalina Bontcheva","Brian Davis","Adam Funk","Yaoyong Li"],"meta":["January 2009","DOI:10.1007/978-3-540-88845-1_4"],"references":["319394819_SUS_--_a_quick_and_dirty_usability_scale","290981322_The_virtuous_circle_of_expressing_authorization_policies","241212813_From_ACE_to_OWL_and_from_OWL_to_ACE","234814810_Using_uneven_margins_SVM_and_perceptron_for_information_extraction","228638589_Attempto_Controlled_English_as_ontology_language","296617519_Unstructured_information_management_-_Introduction","246603319_Kernel_methods_for_information_extraction","242403602_D222_Report_Controlled_Language_IE_Components_version_2","242391908_D211_Ontology-Based_Information_Extraction_OBIE_v1","239546749_Statistical_Learning_Theory"]}