{"id":"228960702_Fault_tree_analysis_of_KNICS_RPS_software","abstract":"This paper describes the application of a software fault tree analysis (FTA) as one of the analysis techniques for a software safety analysis (SSA) at the design phase and its analysis results for the safety-critical software of a digital reactor protection system, which is called the KNICS RPS, being developed in the KNICS (Korea Nuclear Instrumentation & Control Systems) project. The software modules in the design description were represented by function blocks (FBs), and the software FTA was performed based on the well-defined fault tree templates for the FBs. The SSA, which is part of the verification and validation (V&V) activities, was activated at each phase of the software lifecycle for the KNICS RPS. At the design phase, the software HAZOP (Hazard and Operability) and the software FTA were employed in the SSA in such a way that the software HAZOP was performed first and then the software FTA was applied. The software FTA was applied to some critical modules selected from the software HAZOP analysis.","authors":["Park Gee-Yong","Kwang Yong Koh","Eunkyoung Jee","Poong Hyun Seong"],"meta":["August 2008Nuclear Engineering and Technology 40(5)","DOI:10.5516/NET.2008.40.5.397"],"references":["225099521_Safety_Analysis_of_Safety-Critical_Software_for_Nuclear_Digital_Protection_System","3246985_Safety_Verification_of_Ada_Programs_Using_Fault_Tree_Analysis_In_IEEE_Software_84_48-59","290245815_Institute_of_electrical_and_electronic_engineers_inc","280940151_Handbook_of_Software_Reliability_Engineering","280940047_Handbook_of_Software_Reliability_Engineering","243644720_Design_and_Code_Inspections_To_Reduce_Errors_In_Program_Development","238739187_Handbook_of_Software_Reliability","228571767_Software_safety_analysis_of_function_block_diagrams_using_fault_trees","220376241_A_formal_software_requirements_specification_method_for_digital_nuclear_plant_protection_systems","4223721_Development_and_EQ_test_of_the_KNICS_RPS_prototype"]}