{"id":"228974136_Instant_Messaging_Literacies_and_Social_Identities","abstract":"THIS STUDY examined the functions of Instant Messaging (IM) among seven youths who regularly used this digital technology in their daily lives. Grounded in theories of literacy as a social and semiotic practice, this research asked what functions IM served in participants' lives and how their social identities shaped and were shaped by this form of digital literacy. To answer these questions, we conducted interviews and videotaped IM sessions, adapting a verbal reporting procedure to document the IM strategies used. Data analysis involved using qualitative coding procedures informed by grounded theory (Strauss, 1987; Strauss & Corbin, 1990), which led to three patterns related to the functions of IM: language use, social networks, and surveillance. On the level of language use, participants manipulated the tone, voice, word choice, and subject matter of their messages to fit their communication needs, negotiating multiple narratives in the process. On the level of social networks, they designed their practice to enhance social relationships and statuses across contexts. And on the level of surveillance, they circulated texts across buddies, combated unwanted messages, assumed alternative identities, and overcame restrictions to their online communication. These functions revealed that the technological and social affordances of IM, particularly related to patterns of circulation and the hybrid nature of textuality, give rise to a performative and multivoiced social subject. Based on our findings, we discuss new conceptual directions for envisioning the reaching and learning of literacy in digitally mediated times.","authors":["Cynthia Lewis","Bettina Fabos"],"meta":["DOI:10.1598/RRQ.40.4.5"],"references":["265529425_A_Pedagogy_of_Multiliteracies_Designing_Social_Futures","27470726_Adolescence_LostChildhood_Regained_on_Early_Intervention_and_the_Emergence_of_the_Techno-Subject","2438219_Literacy_Technologies_What_Stance_Should_We_Take","305327348_Design_sensibilities_schools_and_the_new_computing_and_communication_technologies","290059313_Local_Literacies_Reading_and_Writing_in_One_Community","251823582_But_will_it_work_in_the_heartland_A_response_and_illustration","248929265_Poetics_Play_Process_and_Power_The_Peformative_Turn_in_Anthropology","240885532_The_Three_Ages_of_Internet_Studies_Ten_Five_and_Zero_Years_Ago","234147641_Poetics_and_Performance_as_Critical_Perspectives_on_Social_Life","233329575_On_reading_and_the_sexual_division_of_literacy","232844956_Building_Equitable_Literate_Futures_Home_and_school_computer-mediated_literacy_practices_and_disadvantage","227870510_From_assimilation_to_accommodation_A_developmental_framework_for_integrating_digital_technologies_into_literacy_research_and_instruction","200026862_The_Language_of_New_Media","43445003_Pedagogy_Connectivity_Multimodality_and_Interdisciplinarity","27616810_Technologies_of_the_Chilhood_Imagination_Media_Mixes_Hypersociality_and_Recombinant_Cultural_Form"]}