{"id":"228987310_Empirical_Study_of_Topic_Modeling_in_Twitter","abstract":"Social networks such as Facebook, LinkedIn, and Twitter have been a crucial source of information for a wide spectrum of users. In Twitter, popular information that is deemed important by the com-munity propagates through the network. Studying the character-istics of content in the messages becomes important for a number of tasks, such as breaking news detection, personalized message recommendation, friends recommendation, sentiment analysis and others. While many researchers wish to use standard text mining tools to understand messages on Twitter, the restricted length of those messages prevents them from being employed to their full potential. We address the problem of using standard topic models in micro-blogging environments by studying how the models can be trained on the dataset. We propose several schemes to train a standard topic model and compare their quality and effectiveness through a set of carefully designed experiments from both qualitative and quantitative perspectives. We show that by training a topic model on aggregated messages we can obtain a higher quality of learned model which results in significantly better performance in two real-world classification problems. We also discuss how the state-of-the-art Author-Topic model fails to model hierarchical relationships between entities in Social Media.","authors":["Liangjie Hong","Brian Davison"],"meta":["January 2010","DOI:10.1145/1964858.1964870"],"references":["234786863_Why_we_Twitter_Understanding_microblogging_usage_and_communities","229157667_The_Author-Topic_Model_for_Authors_and_Documents","226018218_Joint_Group_and_Topic_Discovery_from_Relations_and_Text","221620547_Latent_Dirichlet_Allocation","276935841_Introduction_to_Information_Retrieval","262157385_Latent_Dirichlet_Allocation","234810393_A_few_chirps_about_Twitter","221653450_Efficient_methods_for_topic_model_inference_on_streaming_document_collections","221653354_Connections_between_the_lines_Augmenting_social_networks_with_text","221653193_Joint_latent_topic_models_for_text_and_citations"]}