{"id":"228971351_Face_Component_Extraction_Using_Segmentation_Method_on_Face_Recognition_System","abstract":"Biometric technology has been frequently utilized in identifying and recognizing human components. This technology identifies human's unique and static body parts, such fingerprints, eyes, and face. One of the most biometric technologies which are widely used is facial recognition. The identification and recognition of a human face utilize the face components' processing and analysis. This technique consists of determining face components' region and their characteristics, which establishes the role of individual component in face recognition. This research develops a system that defines face components by determining the distance of face components (i.e.: the eyes, nose, mouth) and other facial components. This process conducted on a frontal single still image to acquire the components. Distances between components are determined by detecting the based skin color, cropping to normalize face region, and extracting eyes, nose, and mouth components. This research utilizes 150 Indonesian face samples and has successfully determined the face components'. From the experiment we conclude that the determination of face components and face components' distances can be used to identify a face as a subsystem of a face recognition system. Test of uniqueness to 150 samples has succeeded. The result indicated that eight face component distances give better result than the previous one, which only applied three components distance. The test of uniqueness with eigenspace showed the existence of different characteristic for every face image.","authors":["Dewi Agushinta R.","Adang Suhendra","Sarifuddin Madenda"],"meta":["Project: Biometric Imaging"],"references":["287543411_FRONTAL_FACIAL_SYMMETRY_DETECTION_USING_EIGENVALUE_METHOD","220566092_Face_Recognition_A_Literature_Survey","3193394_Face_detection_in_color_images","3193630_Generating_Discriminating_Cartoon_Faces_Using_Interacting_Snakes"]}