{"id":"229046404_Extended_SAX_extension_of_symbolic_aggregate_approximation_for_financial_time_series_data_representation","abstract":"Efficient and accurate similarity searching for a large amount of time series data set is an important but non-trivial problem. Many dimensionality reduction techniques have been proposed for effective representation of time series data in order to realize such similarity searching, including Singular Value Decomposition (SVD), the Discrete Fourier transform (DFT), the Adaptive Piecewise Constant Approximation (APCA), and the recently proposed Symbolic Aggregate Approximation (SAX). In this work we propose a new extended approach based on SAX, called Extended SAX in order to realize efficient and accurate discovering of important patterns, necessary for financial applications. While the original SAX approach allows a very good dimensionality reduction and distance measures to be defined on the symbolic approach, SAX is based on PAA (Piecewise Aggregate Approximation) representation for dimensionality reduction that minimizes dimensionality by the mean values of equal sized frames. This value based representation causes a high possibility to miss some important patterns in some time series data such as financial time series data. Extended SAX, proposed in the paper, uses additional two new points, that is, max and min points, in equal sized frames besides the mean value for data approximation. We show that Extended SAX can improve representation preciseness without losing symbolic nature of the original SAX representation. We empirically compare the Extended SAX with the original SAX approach and demonstrate its quality improvement.","authors":["Battuguldur Lkhagva","Yu Suzuki","Kyoji Kawagoe"],"meta":["January 2006"],"references":["243785467_Fast_Time_Sequence_Indexing_for_Arbitrary_Lp_Norms","221598030_A_Symbolic_Representation_of_Time_Series_with_Implications_for_Streaming_Algorithms","220791703_Efficient_Similarity_Search_In_Sequence_Databases","308263678_Dimensionality_reduction_for_fast_similarity_search_in_large_time_series_databases","278566933_Efficient_time_series_matching_by_wavelets","221214364_Locally_Adaptive_Dimensionality_Reduction_for_Indexing_Large_Time_Series_Databases","3940200_An_Online_Algorithm_for_Segmenting_Time_Series","3792305_Efficient_time_series_matching_by_wavelets","2548217_Dimensionality_Reduction_for_Fast_Similarity_Search_in_Large_Time_Series_Databases","2455163_Efficient_Similarity_Search_In_Sequence_Databases"]}