{"id":"229131503_The_emergence_of_inferential_rules_The_use_of_pragmatic_reasoning_schemas_by_preschoolers","abstract":"This study contrasts the pragmatic view with the natural logic view regarding the origin of inferential rules in conditional reasoning. The pragmatic view proposes that pragmatic rules emerge first, and the generalizations of these produce formal rules. In contrast, the natural logic view proposes that the formal rules emerge first and serve as a core that is then supplemented by pragmatic rules. In an experiment, scenarios involving conditional rules in different contexts, permission and arbitrary, were administered to independent groups of preschool children. To rule out the matching bias [Evans, J. St. B. T., & Lynch, J. S. (1973). Matching bias in the selection task. Br J Psychol 64, 391–397] as a possible explanation of reasoning performance, children were given conditional rules with a negated consequent. The results show that in the arbitrary context modus tollens (MT) was unavailable, and the use of modus ponens (MP) was unstable. In contrast, children in the permission context reliably used both MP and MT. In addition, they realized that a conditional rule does not imply a definite answer when the consequent holds. These findings suggest that, in their explicit forms, pragmatic rules emerge earlier than formal rules and in particular, even as basic a rule as MP is generalized from a context-specific form to a context-general one in preschool children.","authors":["Shaw-Jing Chao","Patricia W Cheng"],"meta":["January 2000Cognitive Development 15(1):39-62"],"references":["291880865_The_development_of_logical_competence_A_psycholinguistic_perspective","274940175_The_Development_of_Logical_Thinking_in_Children","256620001_Pragmatic_Schemas_and_Logical_Reasoning_in_6-_to_8-year-old_Children","254224320_Pragmatic_Schemas_and_Conditional_Reasoning_in_Children","250184089_A_Study_of_Children's_Abilities_to_Reason_with_Basic_Principles_of_Deductive_Reasoning","232552008_A_reason_to_reason_Pragmatic_basis_of_children's_search_for_counterexamples"]}