{"id":"229159279_Open_Access_versus_Subscription_Journals_A_Comparison_of_Scientific_Impact","abstract":"In the past few years there has been an ongoing debate as to whether the proliferation of open access (OA) publishing would damage the peer review system and put the quality of scientific journal publishing at risk. Our aim was to inform this debate by comparing the scientific impact of OA journals with subscription journals, controlling for journal age, the country of the publisher, discipline and (for OA publishers) their business model.\nThe 2-year impact factors (the average number of citations to the articles in a journal) were used as a proxy for scientific impact. The Directory of Open Access Journals (DOAJ) was used to identify OA journals as well as their business model. Journal age and discipline were obtained from the Ulrich's periodicals directory. Comparisons were performed on the journal level as well as on the article level where the results were weighted by the number of articles published in a journal. A total of 610 OA journals were compared with 7,609 subscription journals using Web of Science citation data while an overlapping set of 1,327 OA journals were compared with 11,124 subscription journals using Scopus data.\nOverall, average citation rates, both unweighted and weighted for the number of articles per journal, were about 30% higher for subscription journals. However, after controlling for discipline (medicine and health versus other), age of the journal (three time periods) and the location of the publisher (four largest publishing countries versus other countries) the differences largely disappeared in most subcategories except for journals that had been launched prior to 1996. OA journals that fund publishing with article processing charges (APCs) are on average cited more than other OA journals. In medicine and health, OA journals founded in the last 10 years are receiving about as many citations as subscription journals launched during the same period.\nOur results indicate that OA journals indexed in Web of Science and/or Scopus are approaching the same scientific impact and quality as subscription journals, particularly in biomedicine and for journals funded by article processing charges.","authors":["Bo-Christer Björk","David Solomon"],"meta":["July 2012BMC Medicine 10(73):73","DOI:10.1186/1741-7015-10-73","SourcePubMed"],"references":["237267400_Open_Access_Journals_in_the_ISI_Citation_Databases_Analysis_of_Impact_Factors_and_Citation_Patterns_-_A_Citation_Study_from_Thomson_Scientific","220433707_Open_Access_and_Scopus_A_New_Approach_to_Scientific_Visibility_From_the_Standpoint_of_Access","51240302_The_Development_of_Open_Access_Journal_Publishing_from_1993_to_2009","48196354_Highlights_from_the_SOAP_project_survey_What_Scientists_Think_aboutOpen_Access_Publishing","47545539_Self-Selected_or_Mandated_Open_Access_Increases_Citation_Impact_for_Higher_Quality_Research","262358629_A_study_of_open_access_journals_using_article_processing_charges","247059256_OPen_Access_Journals_in_the_ISI_Citation_Databases_Analysis_of_Impact_Factors_and_Citation_Patterns","233688138_Going_all_the_way_How_Hindawi_became_an_open_access_publisher","220066065_Comparing_impact_factors_from_two_different_citation_databases_The_case_of_Computer_Science","50936368_Access_Readership_Citations_A_Randomized_Controlled_Trial_Of_Scientific_Journal_Publishing"]}