{"id":"229361653_Digital_Gender_Divide_or_Technologically_Empowered_Women_in_Developing_Countries_A_Typical_Case_of_Lies_Damned_Lies_and_Statistics","abstract":"The discussion about women’s access to and use of digital Information and Communication Technologies (ICT) in developing countries has been inconclusive so far. Some claim that women are rather technophobic and that men are much better users of digital tools, while others argue that women enthusiastically embrace digital communication. This article puts this question to an empirical test. We analyze data sets from 12 Latin American and 13 African countries from 2005-08. This is believed to be the most extensive empirical study in this field so far. The results are surprisingly consistent and revealing: the reason why fewer women access and use ICT is a direct result of their unfavorable conditions with respect to employment, education and income. When controlling for these variables, women turn out to be more active users of digital tools than men. This turns the alleged digital gender divide into an opportunity: given women’s affinity for ICT, and given that digital technologies are tools that can improve living conditions, ICT represent a concrete and tangible opportunity to tackle longstanding challenges of gender inequalities in developing countries, including access to employment, income, education and health services.","authors":["Martin Hilbert"],"meta":["November 2011Women s Studies International Forum 34(6):479-489","DOI:10.1016/j.wsif.2011.07.001"],"references":["259864190_Information_Societies_in_Latin_America_and_the_Caribbean_Development_of_Technologies_and_Technologies_for_Development","313644813_The_gender_gap_at_the_PC_keyboard","298931914_The_Internet_and_knowledge_gaps_-_A_theoretical_and_empirical_investigation","292683691_The_Deepening_Divide_Inequality_in_the_Information_Society","290496258_Kids_and_Media_in_America","267922562_The_Diffusion_of_Innovations","265758950_The_Impact_of_Telecoms_on_Economic_Growth_in_Developing_Countries","265092445_Gender_and_the_digital_economy_perspectives_from_the_developing_world","264799722_Masculinities_and_Technologies_Some_Introductory_Remarks","257115756_InForming_politics_Processes_of_feminist_activism_in_the_information_age"]}