{"id":"229350294_An_interactive_teaching_and_learning_environment_for_graph_sketching","abstract":"An Interactive Teaching and Learning Environment for Graph Sketching (ITALEGS) of polynomial graphs at college level was developed. The objectives of the system are to provide an environment for teachers to design their own lesson plans, to assist students to grasp the “sense” of graph sketching; and to evaluate the effectiveness of using it in teaching and learning. ITALEGS was constructed by integrating Visual BASIC and Maple™ and to take advantage of the strengths of both packages. Such an approach can reduce the effort and time of development of the software and yield a powerful and user-friendly system. ITALEGS contains hypermedia for illustration on sketching graphs of polynomials, examples, and guided exercises. Teachers can design their own examples and students can explore graphs at their own choices. Interactive exercises are also provided. Two questionnaires were designed to collect users' feedback. Three experts in Mathematics teaching and twelve college students were invited to evaluate ITALEGS. Results indicated that incorporating Pedagogical Content Knowledge in a CAI or CAL system is a promising research direction in enhancing its effectiveness. Both teachers and students agreed that ITALEGS is a powerful and flexible system for both teaching and learning. However, further experiments are required to investigate more about its effect in the classroom environment.","authors":["Siu-cheung Kong","Lam For Kwok"],"meta":["January 1999Computers & Education 32(1):1-17","DOI:10.1016/S0360-1315(98)00032-3"],"references":["243765689_Educational_Software_Architecture_and_Systemic_Impact_The_Promise_of_Component_Software1","240174042_Persistent_collaboration_A_methodology_for_applied_AIED","228328457_Intelligent_learning_environments_for_programming_The_case_for_integration_and_adaptation","271047513_The_Psychology_of_Learning_Mathematics","250889378_An_Epistemological_Approach_to_Intelligent_Tutoring_Systems","243769802_Those_Who_Understand_Knowledge_Growth_in_Teaching","234706419_A_Comparison_of_Using_a_Microcomputer_Precision_Teaching_and_Worksheets_to_Master_Basic_Multiplication_Facts","229587078_Pedagogic_principles_of_case-based_CAL","222470690_Effectiveness_of_computer-based_instruction_An_updated_analysis","222360015_Subject_matter_and_related_pedagogical_knowledge_in_teacher_education"]}