{"id":"229698041_The_Bees_Algorithm_Modelling_foraging_behaviour_to_solve_continuous_optimization_problems","abstract":"The Bees Algorithm models the foraging behaviour of honeybees in order to solve optimization problems. The algorithm performs a kind of exploitative neighbourhood search combined with random explorative search. This article describes the Bees Algorithm in its basic formulation, and two recently introduced procedures that increase the speed and accuracy of the search. A critical review of the related swarm intelligence literature is presented. The effective-ness of the proposed method is compared to that of three state-of-the-art biologically inspired search methods. The four algorithms were tested on a range of well-known benchmark func-tion optimization problems of different degrees of complexity. The experimental results proved the reliability of the bees foraging metaphor. The Bees Algorithm performed optimally, or near optimally, in almost all the tests. Compared to the three control algorithms, the Bees Algorithm was highly competitive in terms of learning accuracy and speed. The experimental tests helped also to shed further light on the search mechanisms of the Bees Algorithm and the three control methods, and to highlight their differences, strengths, and weaknesses.","authors":["D. T. Pham","Marco Castellani"],"meta":["December 2009ARCHIVE Proceedings of the Institution of Mechanical Engineers Part C Journal of Mechanical Engineering Science 1989-1996 (vols 203-210) 223(12):2919-2938","DOI:10.1243/09544062JMES1494"],"references":["301232799_The_Self-Organizing_Exploratory_Pattern_of_the_Argentine_Ant","259623508_Preliminary_design_using_the_Bees_Algorithm","259603599_Honey-Bees_Mating_Optimization_HBMO_Algorithm_A_New_Heuristic_Approach_for_Water_Resources_Optimization","253833428_Application_of_the_Bees_Algorithm_to_PCB_assembly_optimisation","324370104_Bees_Their_Vision_Chemical_Senses_and_Language","285868478_Evolutionary_computation_implementations","284048685_The_particle_swarm_explosion_stability_and_convergence_in_multi-dimensional_complex_space","273453883_Particle_Swarm_Optimization","268315585_Intelligent_optimisation_techniques_Genetic_algorithms_tabu_search_simulated_annealing_and_neural_networks","267183134_MVF_-Multivariate_Test_Functions_Library_in_C_for_Unconstrained_Global_Optimization"]}