{"id":"229987149_Developing_a_Standardized_Water_Quality_Index_for_Evaluating_Surface_Water_Quality1","abstract":"  There is a significant need for a science-based approach to interpret water-monitoring data and to facilitate the rapid transfer of information to water resource managers and the general public. The water quality Index (WQI) is defined as a single numeric score that describes the surface water quality condition at a particular time and location. The objective of this paper is to describe the WQI concept and the approach for developing an ecoregion-specific standardized WQI that meets the needs described above. The premise of the proposed WQI is based on categorizing scientifically documented aquatic life responses to changes in instream water chemistry. The method uses an aggregated procedure that matches the entire range of standardized probable biological responses to standardized narrative water quality evaluation categories and standardized rank score categories. The calculation of WQI and decision-making process are performed within an Excel spreadsheet software program. The article includes examples of the proposed WQI applications that could enhance effective water resource management and facilitate timely communication of water quality conditions to water resource managers and the general public.","authors":["Fredrick W. Kaurish","Tamim Younos"],"meta":["March 2007JAWRA Journal of the American Water Resources Association 43(2):533 - 545","DOI:10.1111/j.1752-1688.2007.00042.x"],"references":["238785158_Development_of_a_Water_Quality_Index_for_the_Maryland_Coastal_Bays","236621284_Biological_Response_Signatures_Indicator_Patterns_Using_Aquatic_Communities","279539611_A_Geographically_Variable_Water_Quality_Index_Used_in_Oregon","264655091_REPLY_TO_DISCUSSION_by_David_G_Smith_Robert_J_Davies-Colley_and_John_W_Nagels1","264465717_DISCUSSION1","249490878_DISCUSSION_Oregon_Water_Quality_Index_A_Tool_for_Evaluating_Water_Quality_Management_by_Curtis_G_Cude","249490700_Determining_the_Source_of_Stream_Contamination_in_a_Karst-Water_System_Southwest_Virginia_USA","227624072_Oregon_Water_Quality_Index_A_Tool_for_Evaluating_Water_Quality_Management_Effectiveness"]}