{"id":"230596035_A_Separator_Theorem_for_Planar_Graphs","abstract":"The vertices of any n-vertex planar graph can be partitioned into three sets A, B, C such that no edge joins a vertex in A with a vertex in B, neither A nor B contains more than 2n/3 vertices, and C contains no more than 2 2 n vertices. We exhibit an algorithm which finds such a partition A, B, C in O(n) time by an algorithm. Introduction For many kinds of combinatorial problems, we can use divide-and- conquer\" approach to divide them into some simple subproblems, and then combine the subproblem solutions to give the solution to the original problem. In order to use this approach successfully and efficiently, three things are necessary. First, the subproblems must be of the same type as the original and independent of each other. Second, the cost of solving the original problem given the solutions to the subproblems must be small. Finally, the subproblems must be significantly smaller than the original. any n-vertex graph can be partitioned into three sets A,B,C such that no edge joins a vertex in A with a vertex in B, neither A nor B contains more than αn vertices, and C contains no more than βf(n) vertices(α0). If we can use this approach to consider those problems which are defined on graphs, For example, the sets A and B define the subproblems, we can use divide-and-conquer approach to solve a lot of those problems efficiently. Before we talk about this separator theorem, there are some known separator theorems. For example, if we remove a single edge of any n-vertex binary tree, it can be separated into two subtrees, each with no more than 2n/3 vertices. The same situation is fitting for any n-vertex tree. A n -separator theorem holds for the class of grid graphs, and it also holds for an one-tape Turing machine graph. Although not all sparse graphs has an f(n)-separator theorem for some f(n)=o(n), planarity has. Before we prove it, we need to use three facts about planarity.","authors":["Richard J. Lipton","Robert Endre Tarjan"],"meta":["April 1979SIAM Journal on Applied Mathematics 36(2):177-189","DOI:10.1137/0136016"],"references":["234785732_Space_and_Time_Hierarchies_for_Classes_of_Control_Structures_and_Data_Structures","220427379_Preserving_Average_Proximity_in_Arrays","275620415_The_Art_of_Computer_Programming_Vol_3_Sorting_and_Searching","256623712_On_sparse_graphs_with_dense_long_paths","242608703_Sur_le_Probleme_des_Courbes_Gauches_en_Topologie","242362699_Nested_Dissection_of_a_Regular_Finite_Element_Mesh","242362145_Problems_in_computational_geometry","234825908_Efficient_Algorithms_for_Graph_Manipulation","224107212_Memory_bounds_for_recognition_of_context-free_and_context-sensitive_languages","221590967_Space_Bounds_for_a_Game_of_Graphs","220688555_The_Design_and_Analysis_Computer_Algorithms","220617902_Multidimensional_Searching_Problems","220431864_On_Time_Versus_Space","220430558_Efficient_Planarity_Testing","4355852_Tape-bounds_for_time-bounded_Turing_machines"]}