{"id":"230672582_On_the_Computation_of_Zone_and_Double_Zone_Diagrams","abstract":"Classical objects in computational geometry are defined by explicit\nrelations. A few years ago an interesting family of geometric objects defined\nby implicit relations was introduced in the pioneering works of T. Asano, J.\nMatousek and T. Tokuyama. An important member in this family is a zone diagram,\ndefined formally as a solution to a fixed point equation involving sets. As a\nresult, computation of zone diagrams is a challenging task and in a continuous\nsetting it has been addressed (briefly) only by these authors in the Euclidean\nplane with point sites. This paper discusses the possibility to compute zone\ndiagrams in a wide class of spaces. This class, which is introduced here,\nincludes, in particular, Euclidean spheres and finite dimensional strictly\nconvex normed spaces. Sites of a general form are allowed and it is shown that\na generalization of the iterative algorithm suggested by the above mentioned\nauthors converges to a double zone diagram, another implicit geometric object\nwhose existence is known in general. Occasionally a zone diagram can be\nobtained from the resulting double zone diagram. The actual (approximate)\ncomputation of the corresponding iterations and the resulting (double) zone\ndiagram is done, in the normed case, using a new algorithm which enables the\ncomputation of Voronoi diagrams in a general setting. Along the way certain\ntopological properties of Voronoi cells are discussed. Unexplained interesting\nphenomena are discussed too.","authors":["Daniel Reem"],"meta":["March 2018Discrete & Computational Geometry 59(3)","DOI:10.1007/s00454-017-9958-8","SourcearXiv"],"references":["346699991_Convex_Analysis_and_Optimization_in_Hadamard_Spaces","321610148_Riemannian_Geometry_and_Geometric_Analysis","319393558_Fixed_Point_Theory","318494192_Spatial_Tessellations_Concepts_and_Applications_of_Voronoi_Diagrams","317837033_Springer_Monographs_in_Mathematics","316823922_Classical_Banach_Spaces_I","316798868_Ordinary_Differential_Equations","315231188_Equidistant_sets_and_their_connectivity_properties","302170751_Un_theoreme_sur_les_fonctions_densembles'","285511207_Handbook_of_discrete_and_computational_geometry","279959776_Voronoi_DiagramsPartially_supported_by_the_Deutsche_Forschungsgemeinschaft_grant_K1_655_2-2","270077633_Algorithms_in_Combinatorial_Geometry","268890532_An_Introduction_to_Partial_Differential_Equations","267171381_On_the_existence_of_a_neutral_region_II_The_implicit_relation_case","266539804_Convex_analysis_and_optimization_in_Hadamard_spaces_to_appear"]}