{"id":"230621577_Awareness_perception_and_factors_affecting_utilization_of_cervical_cancer_screening_services_among_women_in_Ibadan_Nigeria_A_qualitative_study","abstract":"Background\nOver the years awareness and uptake of cervical cancer screening services has remained poor in developing countries. Problems associated with cervical cancer incidence include late reporting, ignorance and cultural issues relating to cervical cancer screening. This study sought to explore the awareness, perception and utilization of cervical cancer screening among women in Ibadan as well as factors that influence utilization.\n\nMethod\nThis is a qualitative study that utilized Eight Focus Group Discussions to collect information from women in selected health facilities in Ibadan, South West, Nigeria. The 82 participants were purposely recruited from women attending Antenatal clinics in 4 secondary and 4 primary health care facilities after approval was received from the Institutional Review Board in charge of the facilities. The focus group discussions were tape recorded and transcribed verbatim. The transcripts were analyzed into themes.\n\nFindings\nThe study provided qualitative information on the awareness, perception of the utilization of cervical cancer screening services among women in Ibadan. Participants were mainly married women (92.7%), mean age =27.6, SD =4.5, mainly traders (39%) and from Yoruba ethnic backgrounds (87.8%) and had secondary education (39%). The respondents reported not being aware of cervical cancer and were not utilizing the services. Though they did not know what cervical cancer screening entailed or the screening methods, they still believed that it is important since like for other diseases will help in early detection and treatment. The participants were eager to get more information from nurses on cervical cancer about cervical cancer screening. The major factors identified by the women that influence screening utilization were ignorance, Illiteracy, belief in not being at risk, having many contending issues, nonchalant attitude to their health, financial constraint and fear of having a positive result.\n\nConclusion\nThere is an urgent need for more enlightenment about cervical cancer especially by health workers. Also, cervical cancer services should be made available at very affordable cost so that women can easily access the services in order to reduce incidence of invasive cancer.","authors":["Chizoma Millicent Ndikom","Bola Abosede Ofi"],"meta":["August 2012Reproductive Health 9(1):11","DOI:10.1186/1742-4755-9-11","SourcePubMed","Project: Cervical Cancer Screening Uptake among Women in Ibadan, Nigeria"],"references":["268382447_Pre-screening_counseling_in_cervical_cancer_prevention_Implications_for_nursing","238734401_Preventing_Cervical_Cancer_Worldwide","24022067_Knowledge_and_Awareness_of_Cervical_Cancer_and_Screening_among_Malaysian_Women_Who_Have_Never_Had_a_Pap_smear_A_Qualitative_Study","331582102_An_appraisal_of_the_level_of_awareness_and_utilization_of_the_Pap_smear_as_a_cervical_cancer_screening_test_among_female_health_workers_in_a_tertiary_health_institution","272336677_Carcinoma_Of_The_Uterine_Cervix_In_Nigerian_Women_The_Need_to_Adopt_a_National_Prevention_Strategy","229694968_The_Role_of_Nursing_in_Cervical_Cancer_Prevention_and_Treatment","51373778_Thomas_VN_Saleem_T_Abraham_RBarriers_to_effective_uptake_of_cancer_screening_among_Black_and_minority_ethnic_groups_Int_J_Palliat_Nurs_11_562_564-571","23311537_Modeling_Cervical_Cancer_Prevention_in_Developed_Countries","10867209_Knowledge_attitude_and_practices_related_to_prevention_of_cancer_of_the_cervix_among_female_health_workers_in_Ibadan","8471721_Cervical_Cancer_Screening_in_Low_Resource_Settings_Using_Visual_Inspection_With_Acetic_Acid"]}