{"id":"230687265_Computation_of_Pheromone_Values_in_AntNet_Algorithm","abstract":"In this paper, we discuss the basic routing technique of ants and study the change in pheromone values at each node. Also the optimal paths can then be computed based on the shortest cumulative pheromone count between source and destination nodes. AntNet is a distributed multi-agent system inspired by the stigmergy model of communication observed in ant colonies. The ants or control packets collect information about the network conditions and are used to update and maintain the routing tables. Ants based routing is gaining more popularity because of its adaptive and dynamic nature. A number of Swarm Intelligence based, more specially Ant Colony Optimization (ACO) based routing algorithms are proposed by researchers. A version of ant routing protocol called AntNet has been implemented to work within the network simulator ns-2. Routing tables and Pheromone tables have been computed for each node in the network. On the basis of these tables we have tried to compute the shortest and most optimal path between source node and destination node.","authors":["Anuj Kumar Gupta","Harsh Sadawarti","Anil Kumar Verma"],"meta":["August 2012International Journal of Computer Network and Information Security 4(9):47-54","DOI:10.5815/ijcnis.2012.09.06"],"references":["308953674_Ant_Colony_Optimization","220794243_Ant-Like_Agents_for_Load_Balancing_in_Telecommunications_Networks","220036882_MANET_routing_protocols_based_on_Ant_Colony_Optimization","215904795_Analysis_of_various_Swarm-based_Ant-based_Algorithms","3418512_Gambardella_LM_Ant_Colony_System_A_cooperative_learning_approach_to_the_Traveling_Salesman_Problem_IEEE_Tr_Evol_Comp_1_53-66","242535286_Ants_Pheromone_for_Quality_of_Service_Provisioning_In_Mobile_Adhoc_Networks","228873785_Investigation_of_antnet_routing_algorithm_by_employing_multiple_ant_colonies_for_packet_switched_networks_to_overcome_the_stagnation_problem","220445904_Performance_analysis_of_the_AntNet_algorithm","201977138_Ant_Colony_System_A_Cooperative_Learning_Approach_to_the_Traveling_Salesman_Problem","42427585_A_Probabilistic_Emergent_Routing_Algorithm_for_Mobile_Ad_Hoc_Networks"]}