{"id":"230606838_A_RESTful_proxy_and_data_model_for_linked_sensor_data","abstract":"The vision of a Digital Earth calls for more dynamic information systems, new sources of information, and stronger capabilities for their integration. Sensor networks have been identified as a major information source for the Digital Earth, while Semantic Web technologies have been proposed to facilitate integration. So far, sensor data are stored and published using the Observations & Measurements standard of the Open Geospatial Consortium (OGC) as data model. With the advent of Volunteered Geographic Information and the Semantic Sensor Web, work on an ontological model gained importance within Sensor Web Enablement (SWE). In contrast to data models, an ontological approach abstracts from implementation details by focusing on modeling the physical world from the perspective of a particular domain. Ontologies restrict the interpretation of vocabularies toward their intended meaning. The ongoing paradigm shift to Linked Sensor Data complements this attempt. Two questions have to be addressed: (1) how to refer to changing and frequently updated data sets using Uniform Resource Identifiers, and (2) how to establish meaningful links between those data sets, that is, observations, sensors, features of interest, and observed properties? In this paper, we present a Linked Data model and a RESTful proxy for OGC's Sensor Observation Service to improve integration and inter-linkage of observation data for the Digital Earth.","authors":["Krzysztof Janowicz","Arne Bröring","Christoph Stasch","Sven Schade"],"meta":["January 2011International Journal of Digital Earth (in press)(3):1-20","DOI:10.1080/17538947.2011.614698"],"references":["319393385_Towards_the_Web_of_Things_Web_Mashups_for_Embedded_Devices","344800861_The_World_in_Your_Head_A_Gestalt_View_of_the_Mechanism_of_Conscious_Experience","321569790_Web_and_Wireless_Geographical_Information_Systems_9th_International_Symposium_W2GIS_2009_Maynooth_Ireland_December_7-8_2009_Proceedings","318494191_RESTful_Web_Services","318017811_Semantic_Sensor_Web","313570691_The_Digital_Earth_Understanding_our_planet_in_the_21st_century","313363599_Linked_Sensor_Data_RESTfully_serving_RDF_and_GML","292654921_An_introduction_to_scientific_research_methods_in_geography","272353260_SPARQL_query_language_for_RDF_W3C_Recommendation","271819066_The_Digital_Earth"]}