{"id":"230767393_Declining_health_anxiety_throughout_medical_studies_It_is_mainly_about_a_more_relaxed_perception_of_the_health-related_concerns","abstract":"Background: \nReports on effects of advancing medical education on health anxiety are scarce and contradictory.\n\nAim: \nTo evaluate a hypothesis that its components could be differently affected.\n\nMethod: \nA cross-sectional study assessed the Health Anxiety Questionnaire (HAQ), Anxious Thoughts Inventory, and Somatosensory Amplification Scale scores in medical (n = 214) and law (controls, n = 821) students at different study years.\n\nResults: \nIn the controls, all outcomes minimally differed across the study-year levels. Medical scores were similar to control scores at the lower and intermediate level and were significantly lower at higher study years. However, health worry, fear, and reassurance seeking only differed mildly between the medical study levels (adjusted effect sizes ≤ 0.23), whereas tendency toward amplification, meta-worry, social worry, and the HAQ interference with life score were significantly lower at higher than at the lower years (adjusted effect sizes 0.31-0.47). In the medical students, the HAQ interference with life score was affected mainly by the level of meta-worry, whereas in controls the major impact was that of health-related concerns.\n\nConclusions: \nStudying medicine does not seem to relevantly affect the level of health-related concerns, but the degree by which they are perceived as disruptive declines as a specific function of advancing stages of education. This is closely related to progressively declining tendency toward amplification and levels of meta-worry.","authors":["Hrvoje Baric","Vladimir Trkulja"],"meta":["August 2012Medical Teacher 34(12)","DOI:10.3109/0142159X.2012.716180","SourcePubMed"],"references":["45284327_Reassuring_the_medical_students'_disease_-_Health_related_anxiety_among_medical_students","44674536_Health_Anxiety_Current_Perspectives_and_Future_Directions","19969190_The_amplification_of_somatic_symptoms","277706837_Hypochondriacal_Fears_and_Beliefs_in_Medical_and_Law_Students","247222364_Feeling_your_body_or_feeling_badly","240236128_A_multi-dimensional_measure_of_worry_Development_and_preliminary_validation_of_the_Anxious_Thoughts_Inventory","235948126_The_Health_Anxiety_Questionnaire","234025773_The_Health_Anxiety_Questionnaire","19816435_The_Paradox_of_Health","19197969_Hypochondriacal_fears_and_beliefs_in_medical_and_law_students"]}