{"id":"230750460_Achieving_minimum-error_discrimination_of_an_arbitrary_set_of_laser-light_pulses","abstract":"Laser light is widely used for communication and sensing applications, so the\noptimal discrimination of coherent states--the quantum states of light emitted\nby a laser--has immense practical importance. However, quantum mechanics\nimposes a fundamental limit on how well different coher- ent states can be\ndistinguished, even with perfect detectors, and limits such discrimination to\nhave a finite minimum probability of error. While conventional optical\nreceivers lead to error rates well above this fundamental limit, Dolinar found\nan explicit receiver design involving optical feedback and photon counting that\ncan achieve the minimum probability of error for discriminating any two given\ncoherent states. The generalization of this construction to larger sets of\ncoherent states has proven to be challenging, evidencing that there may be a\nlimitation inherent to a linear-optics-based adaptive measurement strategy. In\nthis Letter, we show how to achieve optimal discrimination of any set of\ncoherent states using a resource-efficient quantum computer. Our construction\nleverages a recent result on discriminating multi-copy quantum hypotheses\n(arXiv:1201.6625) and properties of coherent states. Furthermore, our\nconstruction is reusable, composable, and applicable to designing\nquantum-limited processing of coherent-state signals to optimize any metric of\nchoice. As illustrative examples, we analyze the performance of discriminating\na ternary alphabet, and show how the quantum circuit of a receiver designed to\ndiscriminate a binary alphabet can be reused in discriminating multimode\nhypotheses. Finally, we show our result can be used to achieve the quantum\nlimit on the rate of classical information transmission on a lossy optical\nchannel, which is known to exceed the Shannon rate of all conventional optical\nreceivers.","authors":["Marcus P. da Silva","Saikat Guha","Zachary Dutton"],"meta":["August 2012Physical review A, Atomic, molecular, and optical physics 87(5)","DOI:10.1103/PhysRevA.87.052320","SourcearXiv"],"references":["229076170_Measuring_Nothing","221661587_Polar_coding_to_achieve_the_Holevo_capacity_of_a_pure-loss_opticalchannel","221660945_Ideal_state_discrimination_with_an_O1-qubit_quantum_computer","51958814_Optical_codeword_demodulation_with_error_rates_below_standard_quantumlimit_using_a_conditional_nulling_receiver","51503488_Structured_Optical_Receivers_to_Attain_Superadditive_Capacity_and_the_Holevo_Limit","6879090_Binary_Projective_Measurement_via_Linear_Optics_and_Photon_Counting","2197173_Review_article_Linear_optical_quantum_computing","252923968_Quantum_computations_Algorithms_and_error_correction","243477796_Publisher's_Note_Linear_optical_quantum_computing_with_photonic_qubits_Rev_Mod_Phys_79_135_2007","226104110_Quantum_Detection_and_Estimation_Theory","38011847_Near-quantum_optimum_receivers_for_the_phase-quadrature_coherent-state_channel","6399859_Optical_coherent_state_discrimination_using_a_closed-loop_quantum_measurement"]}