{"id":"230758119_Sentiment_Analysis_on_Social_Media","abstract":"The Web is a huge virtual space where to express and share individual opinions, influencing any aspect of life, with implications for marketing and communication alike. Social Media are influencing consumers' preferences by shaping their attitudes and behaviors. Monitoring the Social Media activities is a good way to measure customers' loyalty, keeping a track on their sentiment towards brands or products. Social Media are the next logical marketing arena. Currently, Facebook dominates the digital marketing space, followed closely by Twitter. This paper describes a Sentiment Analysis study performed on over than 1000 Facebook posts about newscasts, comparing the sentiment for Rai -the Italian public broadcasting service -towards the emerging and more dynamic private company La7. This study maps study results with observations made by the Osservatorio di Pavia, which is an Italian institute of research specialized in media analysis at theoretical and empirical level, engaged in the analysis of political communication in the mass media. This study takes also in account the data provided by Auditel regarding newscast audience, correlating the analysis of Social Media, of Facebook in particular, with measurable data, available to public domain.","authors":["Federico Neri","Carlo Aliprandi","Federico Capeci","Montse Cuadros"],"meta":["August 2012","DOI:10.1109/ASONAM.2012.164","Conference: International Conference on Advances in Social Networks Analysis and Mining"],"references":["255573828_A_multilanguage_platform_for_Open_Source_Intelligence","226065011_Mining_the_Web_to_Monitor_the_Political_Consensus","221273638_Monitoring_the_Web_Sentiment_The_Italian_Prime_Minister's_Case","233869268_Natural_language_processing_for_patents_analysis_and_classification","233869267_'Natural_language_processing_for_patents_analysis_and_classification'","233869261_Natural_Language_Processing_for_patents_analysis_and_classification","227311404_Slot_Grammar","226517837_Text_Mining_Applied_to_Multilingual_Corpora","221360737_Mining_Textual_Data_to_Boost_Information_Access_in_OSINT","221040080_Slot_Grammar_A_System_for_Simpler_Construction_of_Practical_Natural_Language_Grammars"]}