{"id":"230764022_The_feasibility_of_using_natural_language_processing_to_extract_clinical_information_from_breast_pathology_reports","abstract":"The opportunity to integrate clinical decision support systems into clinical practice is limited due to the lack of structured, machine readable data in the current format of the electronic health record. Natural language processing has been designed to convert free text into machine readable data. The aim of the current study was to ascertain the feasibility of using natural language processing to extract clinical information from >76,000 breast pathology reports. APPROACH AND PROCEDURE: Breast pathology reports from three institutions were analyzed using natural language processing software (Clearforest, Waltham, MA) to extract information on a variety of pathologic diagnoses of interest. Data tables were created from the extracted information according to date of surgery, side of surgery, and medical record number. The variety of ways in which each diagnosis could be represented was recorded, as a means of demonstrating the complexity of machine interpretation of free text.\nThere was widespread variation in how pathologists reported common pathologic diagnoses. We report, for example, 124 ways of saying invasive ductal carcinoma and 95 ways of saying invasive lobular carcinoma. There were >4000 ways of saying invasive ductal carcinoma was not present. Natural language processor sensitivity and specificity were 99.1% and 96.5% when compared to expert human coders.\nWe have demonstrated how a large body of free text medical information such as seen in breast pathology reports, can be converted to a machine readable format using natural language processing, and described the inherent complexities of the task.","authors":["Julliette M Buckley","Suzanne B Coopey","John Sharko","Fernanda Polubriaginof"],"meta":["June 2012Journal of Pathology Informatics 3(1):23","DOI:10.4103/2153-3539.97788","SourcePubMed"],"references":["8914644_Facilitating_Research_in_Pathology_using_Natural_Language_Processing","7004822_Automating_Tissue_Bank_Annotation_from_Pathology_Reports_-_Comparison_to_a_Gold_Standard_Expert_Annotation_Set","223678144_Coding_Neuroradiology_Reports_for_the_Northern_Manhattan_Stroke_Study_A_Comparison_of_Natural_Language_Processing_and_Manual_Review","47661144_Does_computer-aided_clinical_decision_support_improve_the_management_of_acute_abdominal_pain_A_systematic_review","23162470_Detection_of_Practice_Pattern_Trends_through_Natural_Language_Processing_of_Clinical_Narratives_and_Biomedical_Literature","12981051_Automatic_indexing_of_pathology_data","11283387_Use_of_Natural_Language_Processing_to_Translate_Clinical_Information_from_a_Database_of_889921_Chest_Radiographic_Reports1","8353211_Facilitating_cancer_research_using_natural_language_processing_of_pathology_reports","6588892_A_Roadmap_for_National_Action_on_Clinical_Decision_Support","5897327_Automated_Acquisition_of_Disease-Drug_Knowledge_from_Biomedical_and_Clinical_Documents_An_Initial_Study"]}