{"id":"230767936_Normalization_of_a_chromosomal_contact_map","abstract":"Background\nChromatin organization has been increasingly studied in relation with its important influence on DNA-related metabolic processes such as replication or regulation of gene expression. Since its original design ten years ago, capture of chromosome conformation (3C) has become an essential tool to investigate the overall conformation of chromosomes. It relies on the capture of long-range trans and cis interactions of chromosomal segments whose relative proportions in the final bank reflect their frequencies of interactions, hence their spatial proximity in a population of cells. The recent coupling of 3C with deep sequencing approaches now allows the generation of high resolution genome-wide chromosomal contact maps. Different protocols have been used to generate such maps in various organisms. This includes mammals, drosophila and yeast. The massive amount of raw data generated by the genomic 3C has to be carefully processed to alleviate the various biases and byproducts generated by the experiments. Our study aims at proposing a simple normalization procedure to minimize the influence of these unwanted but inevitable events on the final results.\n\nResults\nCareful analysis of the raw data generated previously for budding yeast S. cerevisiae led to the identification of three main biases affecting the final datasets, including a previously unknown bias resulting from the circularization of DNA molecules. We then developed a simple normalization procedure to process the data and allow the generation of a normalized, highly contrasted, chromosomal contact map for S. cerevisiae. The same method was then extended to the first human genome contact map. Using the normalized data, we revisited the preferential interactions originally described between subsets of discrete chromosomal features. Notably, the detection of preferential interactions between tRNA in yeast and CTCF, PolII binding sites in human can vary with the normalization procedure used.\n\nConclusions\nWe quantitatively reanalyzed the genomic 3C data obtained for S. cerevisiae, identified some of the biases inherent to the technique and proposed a simple normalization procedure to analyse them. Such an approach can be easily generalized for genomic 3C experiments in other organisms. More experiments and analysis will be necessary to reach optimal resolution and accuracies of the maps generated through these approaches. Working with cell population presenting highest levels of homogeneity will prove useful in this regards.","authors":["Axel Cournac","Hervé Marie-Nelly","Martial Marbouty","Romain Koszul"],"meta":["August 2012BMC Genomics 13(1):436","DOI:10.1186/1471-2164-13-436","SourcePubMed"],"references":["266908522_Reassessment_of_the_Hi-C_analysis_of_human_genome_architecture","237529207_Ultrafast_and_memory-efficient_alignment_of_short_reads_to_the_human_genome","225042184_Physical_tethering_and_volume_exclusion_determine_higher-order_genome_organization_in_budding_yeast","223976604_Topological_Domains_in_Mammalian_Genomes_Identified_by_Analysis_of_Chromatin_Interactions","221766911_Three-Dimensional_Folding_and_Functional_Organization_Principles_of_the_Drosophila_Genome","51924410_Genome_architectures_revealed_by_tethered_chromosome_conformation_capture_and_population-based_modeling","221884382_SnapShot_Chromosome_Conformation_Capture","221839033_Spatial_Organization_of_the_Mouse_Genome_and_Its_Role_in_Recurrent_Chromosomal_Translocations","221766723_Forkhead_Transcription_Factors_Establish_Origin_Timing_and_Long-Range_Clustering_in_S_cerevisiae","221766722_Extensive_Promoter-Centered_Chromatin_Interactions_Provide_a_Topological_Basis_for_Transcription_Regulation","51723706_Probabilistic_modeling_of_Hi-C_contact_maps_eliminates_systematic_biases_to_characterize_global_chromosomal_architecture","51431455_Dohm_JC_Lottaz_C_Borodina_T_Himmelbauer_H_Substantial_biases_in_ultra-short_read_data_sets_from_high-throughput_DNA_sequencing_Nucleic_Acids_Res_36_e105","49817050_Clustering_heterochromatin_Sir3_promotes_telomere_clustering_independently_of_silencing_in_yeast","47661709_Intra-_and_inter-chromosomal_interactions_correlate_with_CTCF_binding_genome_wide","47621447_Mapping_of_Long-Range_Associations_throughout_the_Fission_Yeast_Genome_Reveals_Global_Genome_Organization_Linked_to_Transcriptional_Regulation"]}