{"id":"230732940_Identification_of_Probabilities_of_Languages","abstract":"We consider the problem of inferring the probability distribution associated\nwith a language, given data consisting of an infinite sequence of elements of\nthe languge. We do this under two assumptions on the algorithms concerned: (i)\nlike a real-life algorothm it has round-off errors, and (ii) it has no\nround-off errors. Assuming (i) we (a) consider a probability mass function of\nthe elements of the language if the data are drawn independent identically\ndistributed (i.i.d.), provided the probability mass function is computable and\nhas a finite expectation. We give an effective procedure to almost surely\nidentify in the limit the target probability mass function using the Strong Law\nof Large Numbers. Second (b) we treat the case of possibly incomputable\nprobabilistic mass functions in the above setting. In this case we can only\npointswize converge to the target probability mass function almost surely.\nThird (c) we consider the case where the data are dependent assuming they are\ntypical for at least one computable measure and the language is finite. There\nis an effective procedure to identify by infinite recurrence a nonempty subset\nof the computable measures according to which the data is typical. Here we use\nthe theory of Kolmogorov complexity. Assuming (ii) we obtain the weaker result\nfor (a) that the target distribution is identified by infinite recurrence\nalmost surely; (b) stays the same as under assumption (i). We consider the\nassociated predictions.","authors":["Paul M. B. Vitányi","Nick Chater"],"meta":["August 2012Journal of Mathematical Psychology 76(Pt A)","DOI:10.1016/j.jmp.2016.11.004","SourcearXiv"],"references":["319393405_An_Introduction_to_Kolmogorov_Complexity_and_Its_Applications","311921413_Inference_from_absence_in_language_and_thought","309310624_Three_approaches_to_the_quantitative_definition_of_information","304405348_On_computable_numbers_with_an_application_to_the_Entscheidungsproblem","298081771_Entscheidungsproblem_Proc_London_Maths_Soc_ser","297181812_Ecological_constraints_on_internal_representation_resonant_kinematics_of_perceiving_imagining_thinking_and_dreaming","287257452_The_complexity_of_finite_objects_and_the_basing_of_the_concepts_of_information_and_randomness_on_the_theory_of_algorithms","285640989_Sur_la_loi_forte_des_grands_nombres","281999709_Prob_Inf_Transm","275619177_An_Introduction_To_Probability_Theory_And_Its_Applications"]}