{"id":"230856590_Underwater_vehicle_technology_in_the_European_Research_Project_VENUS","abstract":"This paper describes the work carried out during the first part of the European research project Virtual ExploratioN of Underwater Sites (VENUS) by two of the participating teams. As the project is aimed at developing a set of best practices, procedures and tools for exploring underwater archaeological sites, part of the work concentrated on the use of unmanned underwater vehicles for gathering optical and acoustic data on field and their use in constructing photographic maps. At the same time, the use of unmanned surface vehicles for long-range exploration and construction of large-scale acoustic maps was investigated. Concerning the first point, the main results consist of a series of best practices and procedures for collecting correlated and geo-referenced optic and acoustic images, which are used for constructing online twodimensional photographic maps of the explored area during the survey, as well as offline three-dimensional representation of the site in a virtual reality environment. The construction of two-dimensional photographic maps represents a major innovation towards conducting archaeological exploration and defines a new, efficient way of governing it, at logical level, in a closed-loop fashion. Integration of the information into a geographic information system (GIS) has also been developed to help archaeologists interpret the results of the ongoing exploration with respect to larger scenarios, and possibly to modify or adjust the mission parameters during its execution accordingly. The basic capability of surface vehicles in connection with the objectives of the archaeological exploration has been investigated as a basis for an integration between underwater and surface vehicles in that activity.","authors":["Giuseppe Conte","Gambella L","David Scaradozzi","S. M. Zanoli"],"meta":["November 2009Underwater Technology The International Journal of the Society for Underwater 28(4):175-185","DOI:10.3723/ut.28.175"],"references":["251825000_Precision_Survey_and_Archaeological_Methodology_in_Deep_Water","242392025_Underwater_acoustic_positioning_systems_based_on_buoys_with_GPS","230856593_Underwater_cartography_for_archaeology_in_the_VENUS_project","227170008_Archaeological_Oceanography","224326612_Underwater_archeology_missions_design_for_data_gathering_automation","222536976_The_discovery_of_ancient_history_in_the_deep_sea_using_advanced_deep_submergence_technology","33549713_Applications_of_Geo-Referenced_Underwater_Photo_Mosaics_in_Marine_Biology_and_Archaeology","313404764_Simple_underwater_photogrammetric_techniques","287627459_Digital_mosaicking_of_underwater_imagery_More_important_for_underwater_interpretation_than_aerial_work_limited_field_of_view_obtainable_forces_analyst_to_merge_multiple_images_to_obtain_overview","274438492_A_Fourth-Century_Shipwreck_at_Yassi_Ada","3926107_New_archaeological_uses_of_autonomous_undersea_vehicles","3816624_Object_Recognition_from_Local_Scale-Invariant_Features","2373439_Object_Recognition_from_Local_Scale-Invariant_Features"]}