{"id":"231091081_Self-Organization_and_Information","abstract":"This paper is concerned with processes of self-organization which can take place both in the inanimate and animate world. In particular we study the question what physics can contribute to the understanding of these processes. Its traditional disciplines, namely thermodynamics and statistical mechanics which are concerned with the behavior of multi-component systems, require new ideas and concepts in order to cope with self-organizing systems. These concepts were elaborated in the new field of synergetics from the microscopic point of view. The present paper is mainly concerned with a macroscopic approach.\nIn Section 1 we briefly remind the reader of various concepts of entropy and information and we give brief definitions of structure and self-organization. At present there seems to be no satisfactory definition of complexity available. Section 2 provides two examples of self-organizing systems, namely the laser and slime mold. In Section 3 we briefly remind the reader of the microscopic approach used in synergetics. As a new result it is shown that the information of the total system close to instability points is essentially contained in the information in the order parameters for which the specific example of a single order parameter is then treated explicitly. Finally we show how adequate constraints can be found to formulate the maximum information entropy principle for self-organizing systems. Our approach allows one to deduce the order parameters and dominant spatial patterns of a system which undergoes a non-equilibrium phase transition by means of an algorithm rather than by guessing.","authors":["Hermann Haken"],"meta":["November 2006Physica Scripta 35(3):247","DOI:10.1088/0031-8949/35/3/006"],"references":["316794683_Advanced_Synergetics","243183745_A_nonlinear_theory_of_laser_noise_and_coherence_I","238894534_Information_and_information_gain_close_to_nonequilibrium_phase_transitions_Numerical_results","234492941_Synergetics_A_Introduction","227190956_A_new_access_to_path_integrals_and_Fokker_Planck_equations_via_the_maximum_calibre_principle","227007117_Laserlight_-_first_example_of_a_second-order_phase_transition_far_away_from_thermal_equilibrium","226999914_Application_of_the_maximum_information_entropy_principle_to_selforganizing_systems","226675845_Information_information_gain_and_efficiency_of_self-organizing_systems_close_to_instability_points","226035033_Quantum_theory_of_light_propagation_in_a_fluctuating_laser-active_medium","226005231_The_maximum_entropy_principle_for_non-equilibrium_phase_transitions_Determination_of_order_parameters_slaved_modes_and_emerging_patterns","224539549_Fluctuations_in_Bistable_Tunnel_Diode_Circuits","220024164_Information_Theory_and_Statistical_Mechanics_2","220022167_Information_Theory_and_Statistical_Mechanics_I","18799732_Cyclic-AMP-Controlled_Oscillations_in_Suspended_Dictyostelium_Cells_Their_Relation_to_Morphogenetic_Cell_Interactions","13988269_The_Mathematical_Theory_of_Communication"]}