{"id":"231044675_Levy-taxis_A_novel_search_strategy_for_finding_odor_plumes_in_turbulent_flow-dominated_environments","abstract":"Locating chemical plumes in aquatic or terrestrial environments is important for many economic, conservation, security and health related human activities. The localization process is composed mainly of two phases: finding the chemical plume and then tracking it to its source. Plume tracking has been the subject of considerable study whereas plume finding has received little attention. We address here the latter issue, where the searching agent must find the plume in a region often many times larger than the plume and devoid of the relevant chemical cues. The probability of detecting the plume not only depends on the movements of the searching agent but also on the fluid mechanical regime, shaping plume intermittency in space and time; this is a basic, general problem when exploring for ephemeral resources (e.g. moving and/or concealing targets). Here we present a bio-inspired search strategy named Lévy-taxis that, under certain conditions, located odor plumes significantly faster and with a better success rate than other search strategies such as Lévy walks (LW), correlated random walks (CRW) and systematic zig-zag. These results are based on computer simulations which contain, for the first time ever, digitalized real-world water flow and chemical plume instead of their theoretical model approximations. Combining elements of LW and CRW, Lévy-taxis is particularly efficient for searching in flow-dominated environments: it adaptively controls the stochastic search pattern using environmental information (i.e. flow) that is available throughout the course of the search and shows correlation with the source providing the cues. This strategy finds natural application in real-world search missions, both by humans and autonomous robots, since it accomodates the stochastic nature of chemical mixing in turbulent flows. In addition, it may prove useful in the field of behavioral ecology, explaining and predicting the movement patterns of various animals searching for food or mates.","authors":["Zohar Pasternak","Frederic Bartumeus","Frank Grasso"],"meta":["October 2009Journal of Physics A Mathematical and Theoretical 42(43):434010","DOI:10.1088/1751-8113/42/43/434010"],"references":["231137447_Levy_flights_and_random_searches","230675654_Optimal_search_behavior_and_classic_foraging_theory","227335864_Caribou_Movement_as_a_Correlated_Random_Walk","258829405_Upwind_searching_for_an_odor_plume_is_sometimes_optimal","252643401_Levy_Walks_Versus_Levy_Flights","250075610_Search_Strategies_for_Landscape-Level_Interpatch_Movements","247338270_Spatial_analysis_of_animals'_movements_using_a_correlated_random_walk_model","230675651_Animal_Search_Strategies_A_Quantitative_Random-Walk_Analysis","226882954_The_random_elements_in_the_systematic_search_behavior_of_the_desert_isopod_Hemilepistus_reaumuri","226762446_Integration_of_Flow_and_Chemical_Sensing_for_Guidance_of_Autonomous_Marine_Robots_in_Turbulent_Flows"]}