{"id":"231513148_Group-theoretic_constructions_of_erasure-robust_frames","abstract":"In the field of compressed sensing, a key problem remains open: to explicitly\nconstruct matrices with the restricted isometry property (RIP) whose\nperformance rivals those generated using random matrix theory. In short, RIP\ninvolves estimating the singular values of a combinatorially large number of\nsubmatrices, seemingly requiring an enormous amount of computation in even\nlow-dimensional examples. In this paper, we consider a similar problem\ninvolving submatrix singular value estimation, namely the problem of explicitly\nconstructing numerically erasure robust frames (NERFs). Such frames are the\nlatest invention in a long line of research concerning the design of linear\nencoders that are robust against data loss. We begin by focusing on a subtle\ndifference between the definition of a NERF and that of an RIP matrix, one that\nallows us to introduce a new computational trick for quickly estimating NERF\nbounds. In short, we estimate these bounds by evaluating the frame analysis\noperator at every point of an epsilon-net for the unit sphere. We then borrow\nideas from the theory of group frames to construct explicit frames and\nepsilon-nets with such high degrees of symmetry that the requisite number of\noperator evaluations is greatly reduced. We conclude with numerical results,\nusing these new ideas to quickly produce decent estimates of NERF bounds which\nwould otherwise take an eternity. Though the more important RIP problem remains\nopen, this work nevertheless demonstrates the feasibility of exploiting\nsymmetry to greatly reduce the computational burden of similar combinatorial\nlinear algebra problems.","authors":["Matthew Fickus","John Jasper","Dustin G. Mixon","Jesse Peterson"],"meta":["September 2012Linear Algebra and its Applications 479","DOI:10.1016/j.laa.2015.04.004","SourcearXiv"],"references":["225994233_Equal-Norm_Tight_Frames_with_Erasures","222565757_Grassmannian_Frames_with_Applications_to_Coding_and_Communication","222532215_Optimal_frames_for_erasures","221663362_The_Road_to_Deterministic_Matrices_with_the_Restricted_Isometry_Property","46581445_Explicit_constructions_of_RIP_matrices_and_related_problems","255614882_Quantized_Frame_Expansions_with_Erasures_1","232719034_Phase_Retrieval_with_Polarization","227786084_On_sparse_reconstruction_from_Fourier_and_Gaussian_measurements","225490679_Tight_Frames_and_Their_Symmetries","224513791_A_Simple_Proof_of_the_Restricted_Isometry_Property_for_Random_Matrices","221665540_Numerically_erasure-robust_frames","220617951_Sparse_Approximate_Solutions_to_Linear_Systems","200524228_Deterministic_constructions_of_compressed_sensing_matrices","200524187_The_restricted_isometry_property_and_its_implications_for_compressed_sensing","51945994_Full_Spark_Frames","46588039_Steiner_equiangular_tight_frames","4129425_Real_tight_frames_with_maximal_robustness_to_erasures","3085429_Achieving_the_Welch_Bound_With_Difference_Sets","2502107_Quantized_Frame_Expansions_with_Erasures","1912792_Smallest_Singular_Value_of_a_Random_Rectangular_Matrix"]}