{"id":"231513991_Simulator_Sickness_Questionnaire_An_Enhanced_Method_for_Quantifying_Simulator_Sickness","abstract":"Simulator sickness (SS) in high-fidelity visual simulators is a byproduct of modem simulation technology. Although it involves symptoms similar to those of motion-induced sickness (MS), SS tends to be less severe, to be of lower incidence, and to originate from elements of visual display and visuo-vestibular interaction atypical of conditions that induce MS. Most studies of SS to date index severity with some variant of the Pensacola Motion Sickness Questionnaire (MSQ). The MSQ has several deficiencies as an instrument for measuring SS. Some symptoms included in the scoring of MS are irrelevant for SS, and several are misleading. Also, the configural approach of the MSQ is not readily adaptable to computer administration and scoring. This article describes the development of a Simulator Sickness Questiomaire (SSQ), derived from the MSQ using a series of factor analyses, and illustrates its use in monitoring simulator performance with data from a computerized SSQ survey of 3,691 simulator hops. The database used for development included more than 1,100 MSQs, representing data from 10 Navy simulators. The SSQ provides straightforward computer or manual scoring, increased power to identify \"problem\" simulators, and improved diagnostic capability.","authors":["Robert S. Kennedy","Norman E. Lane","Kevin S Berbaum","Michael G. Lilienthal"],"meta":["July 1993International Journal of Aviation Psychology 3(3):203-220","DOI:10.1207/s15327108ijap0303_3"],"references":["313676212_Vestibular_perceptual_and_subjective_changes_with_extended_VDT_use_A_motion_sickness_syndrome","293371056_Shipboard_Evaluation_of_Motion_Sickness_Incidence_and_Human_Engineering_Problems","232590541_How_we_should_measure_change_Or_should_we","22206273_Sopite_Syndrome_A_Sometimes_Sole_Manifestation_of_Motion_Sickness","20371627_Simulator_induced_syndrome_Evidence_for_long-term_aftereffects","20338638_The_time_course_of_post_flight_simulator_sickness_symptoms","20231847_Simulator_sickness_in_US_Navy_flight_simulators","10072790_Acquired_Sensitivity_to_Seasickness_after_an_Influenza_Infection"]}