{"id":"231609926_Computing_Sparse_Representations_of_Multidimensional_Signals_Using_Kronecker_Bases","abstract":"Recently there has been great interest in sparse representations of signals under the assumption that signals (data sets) can be well approximated by a linear combination of few elements of a known basis (dictionary). Many algorithms have been developed to find such representations for one-dimensional signals (vectors), which requires finding the sparsest solution of an underdetermined linear system of algebraic equations. In this letter, we generalize the theory of sparse representations of vectors to multiway arrays (tensors)-signals with a multidimensional structure-by using the Tucker model. Thus, the problem is reduced to solving a large-scale underdetermined linear system of equations possessing a Kronecker structure, for which we have developed a greedy algorithm, Kronecker-OMP, as a generalization of the classical orthogonal matching pursuit (OMP) algorithm for vectors. We also introduce the concept of multiway block-sparse representation of N-way arrays and develop a new greedy algorithm that exploits not only the Kronecker structure but also block sparsity. This allows us to derive a very fast and memory-efficient algorithm called N-BOMP (N-way block OMP). We theoretically demonstrate that under the block-sparsity assumption, our N-BOMP algorithm not only has a considerably lower complexity but is also more precise than the classic OMP algorithm. Moreover, our algorithms can be used for very large-scale problems, which are intractable using standard approaches. We provide several simulations illustrating our results and comparing our algorithms to classical algorithms such as OMP and BP (basis pursuit) algorithms. We also apply the N-BOMP algorithm as a fast solution for the compressed sensing (CS) problem with large-scale data sets, in particular, for 2D compressive imaging (CI) and 3D hyperspectral CI, and we show examples with real-world multidimensional signals.","authors":["Cesar F Caiafa","Andrzej Cichocki"],"meta":["September 2012Neural Computation 25(1)","DOI:10.1162/NECO_a_00385","SourcePubMed"],"references":["285805406_On_the_best_rank-l_and_rank-Rl_R2_Rn_approximation_of_higher_order_tensors","262256284_On_the_best_rank-1_and_rank-R_1_R_2_R_N_approximation_of_higher-order_tensors","261090698_Block_sparse_representations_of_tensors_using_Kronecker_bases","251229200_Efficient_Implementation_of_the_K-SVD_Algorithm_Using_Batch_Orthogonal_Matching_Pursuit","285519713_Implications_of_factor_analysis_of_three-way_matrices_for_measurement_of_change","278433201_Atomic_Decomposition_by_Basis_Pursuit","278057031_Information_limits_on_neural_identification_of_colored_surfaces_in_natural_scenes","269634058_Robust_Uncertainty_Principles_Exact_Signal_Frequency_Information","265715016_Tucker_Dimensionality_Reduction_of_Three-Dimensional_Arrays_in_Linear_Time","260637143_A_Theory_for_Sampling_Signals_From_a_Union_of_Subspaces"]}