{"id":"231956015_Multiplexing_Performance_Assessment_of_POCET_Method_for_Compass_B1B3_Signals","abstract":"Compared with traditional GPS signals, modern GNSS signals are much more complex and have various new modulations. This introduces a difficulty in combining multiple signal components into a constant-envelope signal that maximises the power efficiency of High Power Amplifiers (HPA) on satellites. This paper first describes the fundamental Phase-Optimised Constant-Envelope Transmission (POCET) technique that searches the optimum combining solution for multiple binary navigation signals. Then the Compass B1/B3 signals are modelled by POCET. For the B1 band, a binary complex sub-carrier is adopted to implement the centre frequency difference between regional and global Compass navigation systems. Regional B1 Open Service (OS) signals and global TMBOC signals are combined with optimum loss of 1路0 dB. For the B3 band, Interplex modulation is proved to be the optimum method to combine QPSK (10) and BOC (15, 2路5) signals. Signal quality in the presence of finite word-length effects of Digital-Analog (DA) converters is analysed. Simulations for signal model validation are conducted. The result indicates that relative amplitude error less than 0路01 and angle error less than 0路1 degree can be achieved with 10 bit DA converters. The POCET method is demonstrated as an efficient solution for Compass signals.","authors":["Kai Zhang","Hongwei Zhou","Feixue Wang"],"meta":["November 2011Journal of Navigation 64(S1)","DOI:10.1017/S0373463311000427"],"references":["280037483_AltBOC_for_Dummies_or_Everything_You_Always_Wanted_to_Know_About_AltBOC","255626746_The_MBOC_Modulation_The_Final_Touch_to_the_Galileo_Frequency_and_Signal_Plan","224169460_Quadrature_multiplexed_BOC_modulation_for_interoperable_GNSS_signals","252944320_Towards_navigation_based_on_120_satellites_Analyzing_the_new_signals","237128624_The_Offset_Carrier_Modulation_for_GPS_Modernization","235678989_GPS_L1C_Enhanced_Performance_Receiver_Design_Suggestions_and_Key_Contributions","231753475_MBOC_and_BOC11_performance_comparison","224731001_Interplex--An_Efficient_Multichannel_PSKPM_Telemetry_System","224320876_Study_of_signal_combining_methodologies_for_future_GPS_flexible_navigation_payload_Part_II"]}