{"id":"231921597_Sur_la_relation_d'laboration_Des_approches_intuitives_aux_approches_formelles","abstract":"Le but de notre article est d'entreprendre une réflexion générale sur une des relations de discours parmi les plus importantes, la relation dite d’Élaboration. Il s'agit d'un terme technique pour désigner une relation sémantique ou conceptuelle entre des phrases ou propositions. Toutefois, le sens mondain (non technique) qu'elle a a des répercussions sur l'emploi technique. On constate alors que c'est bien souvent ce sens mondain ou courant, à savoir qu'élaborer c'est préparer, réaliser quelque chose, qui intervient dans la reconnaissance ou dans l'analyse des exemples. Notre propos se limitera ainsi à examiner les définitions du type intuitif qu'on a pu donner de la relation d’Élaboration. Chemin faisant, nous aborderons également la définition donnée dans le cadre de la RST de W. C. Mann et S. Thompson pour en arriver à des caractérisations plus formelles. Nous ouvrirons, enfin, des pistes qui donneront lieu ultérieurement à une analyse plus poussée qui nous aidera à comparer la relation d'Élaboration avec d'autres relations discursives.","authors":["Georges Kleiber","Helene Vassiliadou"],"meta":["July 2009Journal of French Language Studies 19(02):183 - 205","DOI:10.1017/S0959269509003743"],"references":["319394264_Rhetorical_Structure_Theory_A_Theory_of_Text_Organization","314325849_Relations_de_coherence_et_anaphores_en_contexte_inter-phrastique_une_symbiose_parfaite","304583935_Sur_les_approches_intuitives_de_la_relation_d'elaboration","271401598_Semantic_and_pragmatic_sources_of_coherence_On_the_categorization_of_coherence_relations_in_context","270122958_Relations_de_coherence_en_discours_criteres_de_reconnaissance_caracterisation_et_articulation_cohesion-coherence","348473104_Satztopik_und_Diskurstopik_in_Elaboration-Kontexten","324366255_Coherence_in_Spontaneous_Text","324306533_An_Introduction_to_Functional_Grammar","321306558_La_SDRT_une_approche_de_la_coherence_du_discours_dans_la_tradition_de_la_semantique_dynamique","285516097_Beyond_elaboration"]}