{"id":"231934836_Word_Manager_and_CALL_Structured_access_to_the_lexicon_as_a_tool_for_enriching_learners_vocabulary","abstract":"Morphology consists of inflection and word formation. In foreign \nlanguage teaching it occurs mainly in the form of inflectional paradigms. While this is \ncertainly an important part of mastering a foreign language, an adequate use of \nmorphology, both inflection and word formation, can facilitate the acquisition of \nforeign language vocabulary. By applying word formation rules as a way to structure \ntheir knowledge, advanced learners can multiply their active vocabulary. A practical \nproblem in using inflectional classes and word formation processes in vocabulary \nteaching is that the information required to devise exercises is not readily available. \nIn a dictionary, it is not possible to get an overview of word formation relationships \nor classes of words belonging to the same inflectional class. The nature of word \nformation processes even makes it impossible in principle to fully cover them in a \nprinted dictionary without creating a lot of redundancy. An electronic dictionary does \nnot automatically solve the problems involved, unless it is structured appropriately. \nIn the Word Manager (WM) project morphological relationships have been taken as a \nstarting point in the design of the lexicon. As a consequence, the lexicon is \nstructured in terms of word formation and inflection rules, in such a way that complete \nand flexible access to the morphological processes and classes of a language is \nguaranteed. The full flexibility of WM lexicons requires that the entire system be \ninstalled locally. For a dedicated operational component, however, no such installation \nis necessary. It can be installed as an independently running program or be made \navailable through the Internet. Two such applications (which are freely available) and \ntheir possible uses for teaching purposes are described.","authors":["Pius ten Hacken","CORNELIA  TSCHICHOLD "],"meta":["May 2001","DOI:10.1017/S0958344001001112","Project: Lexicography"],"references":["28648163_Against_split_morphology","270150200_Defining_Morphology_A_Principled_Approach_to_Determining_the_Boundaries_of_Compounding_Derivation_and_Inflection","269426985_Morphology_An_Introduction_to_the_Theory_of_Word-Structure","239063344_Morphology_by_Itself_Stems_and_Inflectional_Classes","236759495_Word_Formation_in_Electronic_Dictionaries","230875809_A-Morphous_Morphology"]}