{"id":"232224731_Effect_of_task-related_continuous_auditory_feedback_during_learning_of_tracking_motion_exercises","abstract":"Background\nThis paper presents the results of a set of experiments in which we used continuous auditory feedback to augment motor training exercises. This feedback modality is mostly underexploited in current robotic rehabilitation systems, which usually implement only very basic auditory interfaces. Our hypothesis is that properly designed continuous auditory feedback could be used to represent temporal and spatial information that could in turn, improve performance and motor learning.\n\nMethods\nWe implemented three different experiments on healthy subjects, who were asked to track a target on a screen by moving an input device (controller) with their hand. Different visual and auditory feedback modalities were envisaged. The first experiment investigated whether continuous task-related auditory feedback can help improve performance to a greater extent than error-related audio feedback, or visual feedback alone. In the second experiment we used sensory substitution to compare different types of auditory feedback with equivalent visual feedback, in order to find out whether mapping the same information on a different sensory channel (the visual channel) yielded comparable effects with those gained in the first experiment. The final experiment applied a continuously changing visuomotor transformation between the controller and the screen and mapped kinematic information, computed in either coordinate system (controller or video), to the audio channel, in order to investigate which information was more relevant to the user.\n\nResults\nTask-related audio feedback significantly improved performance with respect to visual feedback alone, whilst error-related feedback did not. Secondly, performance in audio tasks was significantly better with respect to the equivalent sensory-substituted visual tasks. Finally, with respect to visual feedback alone, video-task-related sound feedback decreased the tracking error during the learning of a novel visuomotor perturbation, whereas controller-task-related sound feedback did not. This result was particularly interesting, as the subjects relied more on auditory augmentation of the visualized target motion (which was altered with respect to arm motion by the visuomotor perturbation), rather than on sound feedback provided in the controller space, i.e., information directly related to the effective target motion of their arm.\n\nConclusions\nOur results indicate that auditory augmentation of visual feedback can be beneficial during the execution of upper limb movement exercises. In particular, we found that continuous task-related information provided through sound, in addition to visual feedback can improve not only performance but also the learning of a novel visuomotor perturbation. However, error-related information provided through sound did not improve performance and negatively affected learning in the presence of the visuomotor perturbation.","authors":["Giulio Rosati","Fabio Oscari","Simone Spagnol","Federico Avanzini"],"meta":["October 2012Journal of NeuroEngineering and Rehabilitation 9(1):79","DOI:10.1186/1743-0003-9-79","SourcePubMed"],"references":["309898847_Review_of_control_strategies_for_robotic_movement_training_after_neurologic_injury","270819558_Motor_Control_and_Learning_A_Behavioral_Emphasis","267494166_First_Test_Results_of_a_Haptic_Tele-Operation_System_to_Enhance_Stability_of_Telescopic_Handlers","260228962_World_Haptics_2009-Third_Joint_EuroHaptics_conference_and_Symposium_on_Haptic_Interfaces_for_Virtual_Environment_and_Teleoperator_Systems","242424398_Motor_Control_and_Learning_A_Behavioral_Emphasis","242237487_Robot-Mediated_Movement_Therapy_a_Tool_for_Training_and_Evaluation1","241187792_The_role_of_visual_feedback_in_conventional_therapy_and_future_research","225305244_Electromechanical_and_robot-assisted_arm_training_for_improving_arm_function_and_activities_of_daily_living_after_stroke","224302333_Some_Key_Problems_for_Robot-Assisted_Movement_Therapy_Research_A_Perspective_from_the_University_of_California_at_Irvine","223060633_Improved_force_perception_through_sensory_substitution"]}