{"id":"232262495_Identifying_free_text_plagiarism_based_on_semantic_similarity","abstract":"It is common knowledge that plagiarism in academia goes as back in time as research itself. However, in the last two decades this phenomenon of academic deception has turned into an academic plague. Undoubtedly, the rapid expansion of the Web and the vast amount of publicly available information and documents facilitate the unethical malpractice of computer-aided plagiarism, which in turn has inflated the problem. Anti-plagiarism techniques build upon technological solutions and especially the development of task-specific software. The role of anti-plagiarism software for text is to process a document and identify the pieces of text that have been reproduced from another source. This work presents a semantic-based approach to text-plagiarism detection which improves the efficiency of traditional keyword matching techniques. Our semantic matching technique is able to detect a larger variety of paraphrases, including the use of synonym terms, the repositioning of words in the sentences etc. We evaluate our methodology in a dataset comprising positive and negative plagiarism samples and present comparative results of both supervised and unsupervised methods.","authors":["George Tsatsaronis","Iraklis Varlamis","Andreas Giannakoulopoulos","Nikolaos Kanellopoulos"],"meta":["June 2010","Conference: 4th International Plagiarism Conference (IPC 2010)"],"references":["233779111_Using_WordNet-based_Context_Vectors_to_Estimate_the_Semantic_Relatedness_of_Concepts","221299803_Strategies_for_retrieving_plagiarized_documents","220795593_Computer-based_plagiarism_detection_methods_and_tools_An_overview","251739328_Avoiding_plagiarism_self-plagiarism_and_other_questionable_writing_practices_A_guide_to_ethical_writing","234825122_Copy_detection_mechanisms_for_digital_documents","228713021_Rebels_without_a_clause_Towards_an_institutional_framework_for_dealing_with_plagiarism_by_students","221996739_Semantic_Similarity_in_a_Taxonomy_An_Information_Based_Measure_and_Its_Application_to_Problems_of_Ambiguity_in_Natural_Language","221299343_An_information-theoretic_measure_for_document_similarity","221112475_An_Unsupervised_Learning_Algorithm_for_Rank_Aggregation","220094568_Sentence-based_natural_language_plagiarism_detection"]}