{"id":"232549605_Role_of_Mathematics_Self-Efficacy_in_the_Choice_of_Math-Related_Majors_of_College_Women_and_Men_A_Path_Analysis","abstract":"Tested the hypothesis that mathematics-related self-efficacy mediates the effects of gender and mathematical preparation and achievement on math relatedness of college major choice. The responses of 72 female and 45 male undergraduates to a series of inventories and questionnaires (including the Mathematics Self-Efficacy Scale, Mathematics Attitude Scales, and Bem Sex-Role Inventory [BSRI]) yielded 7 variables descriptive of the math-related career choice process; a causal model of the interrelationships of these variables was constructed from predictions based on self-efficacy theory. A path analysis and consequent refinement of the model resulted in a final path model that was congruent with a self-efficacy approach to women's career development. The hypothesis was partially supported: Gender-related socialization influences combined with the amount of math preparation did predict math achievement and math-related self-efficacy. Results point to some deficiencies in the path model and to the failure of the BSRI Masculinity score to contribute to the prediction of number of years of high school math courses or American College Test math scores. (36 ref) (PsycINFO Database Record (c) 2012 APA, all rights reserved)","authors":["Gail Hackett"],"meta":["January 1985Journal of Counseling Psychology 32(1):47-56","DOI:10.1037/0022-0167.32.1.47"],"references":["317953663_Self-Efficacy_Toward_a_Unifying_Theory_of_Behavioral_Change","275802906_Causal_Modeling","274465335_Career_Counseling_for_Women","271347990_Fennema-Sherman_Mathematics_Attitudes_Scales_Instruments_Designed_to_Measure_Attitudes_toward_the_Learning_of_Mathematics_by_Females_and_Males","271347825_Women_and_the_Mathematical_Mystique","270321832_Sex-Related_Differences_in_Mathematics_Achievement_and_Related_Factors_A_Further_Study","269979798_Causual_Inferences_In_Nonexperimental_Research","264771653_Path_Analysis_An_Informal_Introduction","250184382_Election_of_High_School_Mathematics_by_Females_and_Males_Attributions_and_Attitudes","250183888_The_Study_of_Mathematics_By_High_School_Girls_and_Boys_Related_Variables"]}