{"id":"232547938_Effects_of_Schema_Acquisition_and_Rule_Automation_on_Mathematical_Problem-Solving_Transfer","abstract":"Hypothesized that schema acquisition would precede rule automation and that it would have a strong effect on problems similar to initial acquisition problems. We further hypothesized that rule automation would have its primary effect on transfer and that the use of worked examples could facilitate both transfer and performance on similar problems. Experiments 1 and 2 contained simple algebra transformation problems involving the changing of the subject of an equation. The results indicated that subjects whose training included a heavy emphasis on worked examples or an extended acquisition period were better able to solve both similar and transfer problems than were those subjects trained with conventional problems. In Experiment 3, the use of verbal protocols gave some support to the hypotheses. Experiment 4, using algebra word problems, yielded data supporting the hypotheses. (PsycINFO Database Record (c) 2012 APA, all rights reserved)","authors":["Graham Cooper","John Sweller"],"meta":["December 1987Journal of Educational Psychology 79(4):using algebra word problems, yielded data supporting the hypotheses","DOI:10.1037/0022-0663.79.4.347"],"references":["247341954_Perception_in_Chess","238750884_Schema_Induction_and_Analogical_Transfer","232947228_The_Use_of_Worked_Examples_as_a_Substitute_for_Problem_Solving_in_Learning_Algebra","232575520_Why_Are_Some_Problems_Hard_Evidence_from_Tower_of_Hanoi","232572007_Usefulness_of_Analogous_Solutions_for_Solving_Algebra_Word_Problems","232571696_Effects_of_Goal_Specificity_on_Means-end_Analysis_and_learning","232536767_What_Do_Students_Learn_While_Solving_Mathematics_Problems","222720807_The_role_of_analogy_in_transfer_between_similar_problem_states","222081028_Discrimination_of_operator_schemata_in_problem_solving_Learning_from_examples","30826117_Analogical_Problem_Solving","16342579_Control_mechanisms_in_problem_solving"]}