{"id":"232760840_User_Acceptance_of_Token_based_Authentication_by_Single_Sign-On","abstract":"Secure and reliable authentication is one important part in the scope of IT security, but the practical experience shows that adequate authentication mechanisms are often inconvenient for the populace. Password-based mechanisms dominate as they are easy to use and do not need additional hardware. However, lots of users do not realize the threads with respect to password-based mechanisms: many users use passwords for remote authentication over unsecured channels or in not trustworthy environments, or repeatedly use the same password. Mechanisms based on asymmetric cryptographic operations in combination with hardware token may solve these security problems but are less comfortable in usage. In order to raise user acceptance of these methods we combine them with client-based single sign-on for local and remote authentication. This combined approach leads to a win-win-situation: token-based authentication reduces the risk of stolen authentication factors as the tokens are protected against misuse by a secret pin and it does not need much more user effort than password-based mechanisms. Furthermore, the approach can be used for further IT security applications, e.g., electronic signatures or encipherment, which raises user acceptance even further.","authors":["Sandro Wefel","Paul Molitor"],"meta":["July 2012","Project: IT-Security"],"references":["227200301_Client_Hardware-Token_Based_Single_Sign-On_over_Several_Servers_without_Trusted_Online_Third_Party_Server","221609543_Fourth-factor_authentication","221324247_Users'_Acceptance_of_Secure_Biometrics_Authentication_System_Reliability_and_Validate_of_an_Extended_UTAUT_Model","221166403_Encountering_Stronger_Password_Requirements_User_Attitudes_and_Behaviors","248286821_Using_TLS_with_IMAP_POP3_and_ACAP","234765974_SSH_the_Secure_Shell_The_Definitive_Guide","232644826_New_Factor_of_Authentication_Something_You_Process","228616460_no_thanks_for_the_externalities_The_rational_rejection_of_security_advice_by_users","221291740_A_Stochastic_Model_for_Differential_Side_Channel_Cryptanalysis","221022488_A_large-scale_study_of_web_password_habits"]}