{"id":"23278729_The_elasticity_and_rigidity_of_the_outer_coats_of_the_eye","abstract":"The aim of this study was to measure the elastic moduli of the cornea and sclera and the rigidity of the eyeball.\nElastic moduli of the cornea and sclera were measured on 22 fresh intact porcine eyes using the relationship between elasticity and changes in pressure and volume applicable to pressure vessel models. Rigidity was determined from the relationship between changes in volume and intraocular pressure (IOP). Induced volume changes were up to 300 mul and within the physiological range of IOP (12-25 mm Hg). IOP readings taken with a transducer were used in calculations. Tonometric values were taken for comparison.\nFor cornea and sclera, the relationship between circumferential stress and volumetric strain (which defines the elastic modulus) was closely approximated to linear (R(2) = 0.96), but better fitted with a second order polynomial (R(2) = 1.00). Elastic moduli ranged from 0.05 to 0.24 MPa and 0.15 to 0.83 MPa for the cornea and sclera, respectively. The mean value of ocular rigidity was found to be 0.0024. The effect of increasing IOP on the average corneal radius of curvature was not statistically significant, but it altered the scleral radius of curvature by 0.07 mm/mmHg.\nThe elasticity of the porcine cornea and sclera could be approximated to constant over the physiological range, but showed a tendency to non-linearity. The modulus of elasticity for the sclera is 3 to 3.5 times that of the cornea. The cornea is more resistant than the sclera to IOP changes within the physiological range.","authors":["Magdalena Asejczyk-Widlicka","Barbara Pierscionek"],"meta":["November 2008The British journal of ophthalmology 92(10):1415-8","DOI:10.1136/bjo.2008.140178","SourcePubMed"],"references":["13525345_Eye_elongation_during_accommodation_in_humans_differences_between_emmetropes_and_myopes","11533369_Corneal_shape_change_during_accommodation","316225916_Basic_Solid_Mechanics","285191825_Contribution_to_the_theory_and_practice_of_tonometry","36826758_Biomechanics_Mechanical_Properties_of_Living_Tissues","18128660_Nonlinear_material_properties_of_intact_cornea_and_sclera","17538635_Rheology_of_the_cornea_Experimental_techniques_and_results","15974933_Mechanical_Considerations_in_Myopia_Relative_Effects_of_Accommodation_Convergence_Intraocular_Pressure_and_the_Extraocular_Muscles","14333290_Ocular_Elasticity_Is_Engineering_Stiffness_a_More_Useful_Characterization_Parameter_than_Ocular_Rigidity","12484883_Thermal_and_Biomechanical_Parameters_of_Porcine_Cornea"]}