{"id":"232753127_Serine_and_tyrosine_phosphorylations_cooperate_in_Raf-1_but_not_B-Raf_activation","abstract":"The Raf family of serine/threonine protein kinases couple growth factor receptor stimulation to mitogen activated protein kinase activation, but their own regulation is poorly understood. Using phospho-specific antisera, we show that activated Raf-1 is phosphorylated on S338 and Y341. Expression of Raf-1 with oncogenic Ras gives predominantly S338 phosphorylation, whereas activated Src gives predominantly Y341 phosphorylation. Phosphorylation at both sites is maximal only when both oncogenic Ras and activated Src are present. Raf-1 that cannot interact with Ras-GTP is not phosphorylated, showing that phosphorylation is Ras dependent, presumably occurring at the plasma membrane. Mutations which prevent phosphorylation at either site block Raf-1 activation and maximal activity is seen only when both are phosphorylated. Mutations at S339 or Y340 do not block Raf-1 activation. While B-Raf lacks a tyrosine phosphorylation site equivalent to Y341 of Raf-1, S445 of B-Raf is equivalent to S338 of Raf-1. Phosphorylation of S445 is constitutive and is not stimulated by oncogenic Ras. However, S445 phosphorylation still contributes to B-Raf activation by elevating basal and consequently Ras-stimulated activity. Thus, there are considerable differences between the activation of the Raf proteins; Ras-GTP mediates two phosphorylation events required for Raf-1 activation but does not regulate such events for B-Raf.","authors":["Clive Mason","Caroline J Springer","Robert G Cooper","Giulio Superti-Furga"],"meta":["April 1999The EMBO Journal 18(8):2137-2148","DOI:10.1093/emboj/18.8.2137","SourcePubMed"],"references":["279240512_PD_098059_Is_a_Specific_Inhibitor_of_the_Activation_of_Mitogen-activated_Protein_Kinase_Kinase_in_Vitro_and_in_Vivo","245593531_Oncogenes_growth_factors_and_phorbol_esters_regulate_RAF-1_through_common_mechanisms","242453798_Phosphorylation_of_Raf1_Serine_338Serine_339_Is_an_Essential_Regulatory_Event_for_Ras-Dependent_Activation_and_Biological_Signaling","327481118_Ras_recruits_Raf-1_to_the_plasma_membrane_for_activation_by_tyrosine_phosphorylation","297251284_REVERSAL_OF_RAF-1_ACTIVATION_BY_PURIFIED_AND_MEMBRANE-ASSOCIATED_PROTEIN_PHOSPHATASES_VOL_268_PG_1902_1995","282709352_Isolation_of_monoclonal_antibodies_specific_for_human_c-myc_proto-oncogene_product","238827262_Requirement_of_Ras-GTP-Raf_Complexes_for_Activation_of_Raf1_by_Protein_Kinase_C","238823395_correction_The_protein_kinase_Pak3_positively_regulates_Raf-1_activity_through_phosphorylation_of_serine_338","236657592_Antibodies_A_Laboratory_Manual","51318427_Requirement_of_Ras-GTP-Raf_complexes_for_activation_of_Raf-1_by_protein_kinase_C"]}