{"id":"232837917_Science_modelling_in_pre-calculus_How_to_make_mathematics_problems_contextually_meaningful","abstract":"‘Use of mathematical representations to model and interpret physical phenomena and solve problems is one of the major teaching objectives in high school math curriculum’ (National Council of Teachers of Mathematics (NCTM), Principles and Standards for School Mathematics, NCTM, Reston, VA, 2000). Commonly used pre-calculus textbooks provide a wide range of application problems. However, these problems focus students’ attention on evaluating or solving pre-arranged formulas for given values. The role of scientific content is reduced to provide a background for these problems instead of being sources of data gathering for inducing mathematical tools. Students are neither required to construct mathematical models based on the contexts nor are they asked to validate or discuss the limitations of applied formulas. Using these contexts, the instructor may think that he/she is teaching problem solving, where in reality he/she is teaching algorithms of the mathematical operations (G. Kulm (ed.), New directions for mathematics assessment, in Assessing Higher Order Thinking in Mathematics, Erlbaum, Hillsdale, NJ, 1994, pp. 221–240). Without a thorough representation of the physical phenomena and the mathematical modelling processes undertaken, problem solving unintentionally appears as simple algorithmic operations. In this article, we deconstruct the representations of mathematics problems from selected pre-calculus textbooks and explicate their limitations. We argue that the structure and content of those problems limits students’ coherent understanding of mathematical modelling, and this could result in weak student problem-solving skills. Simultaneously, we explore the ways to enhance representations of those mathematical problems, which we have characterized as lacking a meaningful physical context and limiting coherent student understanding. In light of our discussion, we recommend an alternative to strengthen the process of teaching mathematical modelling – utilization of computer-based science simulations. Although there are several exceptional computer-based science simulations designed for mathematics classes (see, e.g. Kinetic Book (http://www.kineticbooks.com/) or Gizmos (http://www.explorelearning.com/)), we concentrate mainly on the PhET Interactive Simulations developed at the University of Colorado at Boulder (http://phet.colorado.edu/) in generating our argument that computer simulations more accurately represent the contextual characteristics of scientific phenomena than their textual descriptions.","authors":["Andrzej Sokolowski","Bugrahan Yalvac","Cathleen C. Loving"],"meta":["April 2011International Journal of Mathematical Education 42(3):283-297","DOI:10.1080/0020739X.2010.526255"],"references":["344638606_Systems_Simulation_The_Shortest_Route_to_Applications","260692356_Teaching_Physics_Figuring_Out_What_Works","228564202_Adapting_mathematics_education_to_the_needs_of_ICT","216743127_What_Levels_of_Guidance_Promote_Engaged_Exploration_with_Interactive_Simulations","288226659_What_Is_Curriculum_Theory","274653273_New_Directions_in_Mathematics","264953782_Modelling_and_Applications_in_Mathematics_Education_The_14th_ICMI_Study","252818700_Physics_for_Scientists_and_Engineers_5th_edition_-_Volume_1","250890291_Visual_and_Symbolic_Reasoning_in_Mathematics_Making_Connections_With_Computers","233459427_FROM_THEORY_TO_PRACTICE_CURRICULUM","225885571_Learning_Environments_The_Case_for_Evidence-Based_Practice_and_Issue-Driven_Research"]}