{"id":"233037331_Performance_study_of_the_new_EMCCD-based_all-sky_cameras_for_auroral_imaging","abstract":"The Magnetometers Ionospheric Radars All-sky Cameras Large Experiment (MIRACLE) network monitors auroral activity in the Fennoscandian sector. Network stations cover the range of 55° to 57° magnetic latitude north and span two hours in magnetic local time. Seven of the MIRACLE network stations include digital all-sky cameras (ASCs). Up to recent years, the type of ASC used in the network consisted of an optical system, a charged coupled device (CCD) and an image intensifier enabling short exposure times. This system is referred to as an intensified CCD (ICCD) camera. As image intensifiers degrade over time, it has become necessary to replace the MIRACLE network ASCs with newer technology. Since 2007 the Sodankylä (SOD) and Kilpisjärvi (KIL) stations have been equipped with electron multiplying CCD (EMCCD) cameras. Both ICCD and EMCCD cameras in the MIRACLE network operate at three different wavelengths: 427.8 nm, 557.7 nm and 630.0 nm. The signal-to-noise ratio and dynamic range of the EMCCD camera is greater than that of the ICCD camera by about a factor of 2. The goal of this study is to investigate the differences between the two types of camera placed under the same dome at the Sodankylä station. We also compare ASC images with in situ particle data (total electron energy flux) from low-altitude satellite NOAA18. Our analysis includes two days with different conditions (faint emission and substorm activity). This study shows that the EMCCD camera has greater sensitivity for blue and red wavelengths allowing for better measurement of auroral emission. The dynamic imaging range of the EMCCD camera is about 1.7 times that of the ICCD camera. Moreover, the EMCCD camera data are well correlated with the NOAA18 satellite total electron energy flux (cross-correlation coefficient 0.8) for the 557.7 nm emission.","authors":["L. Sangalli","Noora Partamies","M. Syrjäsuo","C.-F. Enell"],"meta":["June 2011International Journal of Remote Sensing 32(11):2987-3003","DOI:10.1080/01431161.2010.541505"],"references":["268357833_All-sky_imaging_within_the_Canadian_CANOPUS_and_NORSTAR_projects","251434242_Correction_to_Wave_dispersion_and_the_discrete_aurora_New_constraints_derived_from_high-speed_imagery","237415508_Electron_Multiplying_CCDs_-_New_Technology_for_Low_Light_Level_Imaging","41136525_Morphology_and_dynamics_of_aurora_at_fine_scale_First_results_from_the_ASK_instrument","29624324_Testing_an_inversion_method_for_estimating_electron_energy_fluxes_from_all-sky_camera_images","240487748_Reconstruction_of_electron_precipitation_characteristics_from_a_set_of_multiwavelength_digital_all-sky_auroral_images","234248870_Observations_of_Substorm_Electrodynamics_Using_the_MIRACLE_Network","43202170_Calculated_transmission_profile_of_an_interference_filter_placed_in_a_convergent_beam_under_various_incidence_angles","41487408_Instrument_for_the_monochromatic_observation_of_all_sky_auroral_images"]}