{"id":"233140821_Informal_math_coaching_by_instant_messaging_Two_case_studies_of_how_university_students_coach_K-12_students","abstract":"The aim of this study is to describe and explore how instant messaging (IM) can be used to support informal math coaching. We have studied two projects where university students use IM to coach K-12 students in mathematics. The coaches were interviewed with a focus on how informal coaching works by examining coaching challenges, how coaching can be organized, whether coaching should be anonymous or personal, which tools can be used and how informal math coaching supports learning. Research shows that generating and answering questions are important in the process of understanding and learning, which means that both the students and the coaches can learn math through this type of project. The coaches perceive informal math coaching as complementing online math forums. For students to learn effectively, the coaches need to be able to interpret the students' competence level in order to coach on a level that is within their development zone. It seems particularly challenging to coach at the right level when using IM and, therefore, it is important to establish a personal relationship with the students.","authors":["Stefan Hrastinski","Anneli Edman","Fredrik Andersson","Tanvir Kawnine"],"meta":["February 2012Interactive Learning Environments 2012(1)","DOI:10.1080/10494820.2011.641682"],"references":["262172508_Metacognitive_Development","248914079_The_relationship_between_adopting_a_synchronous_medium_and_participation_in_online_group_work_An_explorative_study","317953561_Mind_in_society_The_development_of_higher_psychological_processes","314828434_Effects_of_instant_messaging_interruptions_on_computing_tasks","313162481_Metacognitive_Development","290560490_Did_you_ask_a_good_question_today_Alternative_cognitive_and_metacognitive_strategies","284072060_Constructivism_in_education","249797716_Student_Interaction_and_Learning_in_Small_Groups","248998320_Instant_Messaging_in_a_context_of_virtual_schooling_balancing_the_affordances_and_challenges","248917356_The_International_Encyclopedia_of_Education"]}