{"id":"233294624_Characterizing_the_Experimental_Procedure_in_Science_Laboratories_A_preliminary_step_towards_students_experimental_design","abstract":"Many studies have stressed students’ lack of understanding of experiments in laboratories. Some researchers suggest that if students design all or parts of entire experiment, as part of an inquiry-based approach, it would overcome certain difficulties. It requires that a procedure be written for experimental design. The aim of this paper is to describe the characteristics of a procedure in science laboratories, in an educational context. As a starting point, this paper proposes a model in the form of a hierarchical task diagram that gives the general structure of any procedure. This model allows both the analysis of existing procedures and the design of a new inquiry-based approach. The obtained characteristics are further organized into criteria that can help both teachers and students assess a procedure during and after its writing. These results are obtained through two different sets of data. First, the characteristics of procedures are established by analysing laboratory manuals. This allows the organization and type of information in procedures to be defined. This analysis reveals that students are seldom asked to write a full procedure, but sometimes have to specify tasks within a procedure. Secondly, iterative interviews are undertaken with teachers. This leads to the list of criteria to evaluate the procedure.","authors":["Isabelle Girault","Cédric d'Ham","Muriel Ney","Eric Sanchez"],"meta":["April 2012International Journal of Science Education 34(6):825-854","DOI:10.1080/09500693.2011.569901"],"references":["255745740_RESOLUTION_DE_PROBLEME_ET_PRATIQUE_EXPERIMENTALE_ANALYSE_DU_COMPORTEMENT_DES_ELEVES_EN_DEBUT_DE_SECONDE","252757470_Students'_Performance_in_Investigative_Activity_and_Their_Understanding_of_Activity_Aims","251788881_How_to_scaffold_the_students_to_design_experimental_procedures_A_situation_experienced_by_108_high-school_students","298839194_Revitalizing_instruction_in_scientific_genres_Connecting_knowledge_production_with_writing_to_learn_in_science","294632279_Do_secondary_school_laboratory_texts_reflect_the_goals_of_the_New_science_curricula","285881840_Foundations_of_Behavioral_Research","280852107_Experimental_procedure_design_activities_how_to_build_the_labwork_and_what_is_the_knowledge_mobilised_by_the_students","269907519_A_SocioculturalSemiotic_Interpretation_of_Computer-mediated_Communication","266328563_Design_and_Analysis_of_Experiment","258293793_America's_Lab_Report_Investigations_in_High_School_Science"]}