{"id":"233389626_The_impact_of_medical_education_on_psychological_health_of_students_A_cohort_study","abstract":"Many studies have shown that the prevalence of psychological distress among medical students during medical training is higher than that in general population. A few studies have shown that the prevalence of psychological distress among medical students before the onset of medical training was similar to general population. This study aimed to investigate psychological health of medical students before and during medical training. A one-year prospective study was done on successful applicants who undergo the first year of medical training for 2010/2011 academic session. The stress, anxiety and depression were measured by the DASS-21 at five intervals; during interview (Time 0), two months (Time 1), four months (Time 2), six months (Time 3) and final examination (Time 4) of the first year medical training. The prevalence of unfavourable stress, anxiety and depression before the onset of medical training was 4.1%, 55.6% and 1.8%, respectively. The prevalence of unfavourable stress during medical training ranged between 11.8% and 19.9%. The prevalence of anxiety during medical training ranged between 41.1% and 56.7%. The prevalence of depression during medical training ranged between 12% and 30%. Mean scores of stress and depression before (Time 0) and during medical training (Time 1–4) were significantly different (p < 0.001). The prevalence and level of unfavourable stress and depression during medical training were significantly higher than before the onset medical training. This study supports views that medical training is not an optimal environment to psychological health of medical students.","authors":["Muhamad Saiful Bahri Yusoff","Ahmad Fuad Abdul Rahim","Aziz Baba","Shaiful B Ismail"],"meta":["November 2012Psychology Health and Medicine 18(4)","DOI:10.1080/13548506.2012.740162","Project: Promoting Resilience, Minimizing Burnout Among Students in Higher Education"],"references":["240038088_Stressors_in_Medical_School_Relation_to_Curriculum_Format_and_Year_of_Study","228327306_A_Study_of_Psychological_Distress_in_Two_Cohorts_of_First-Year_Medical_Students_that_Underwent_Different_Admission_Selection_Processes","227795354_Anxiety_symptoms_and_perceived_performance_in_medical_students","220044090_Stress_Management_for_Medical_Students_A_Systematic_Review","281729802_A_Guide_to_Rating_Scales_and_Questionnaires","279399002_Stress_Management_in_Medical_Education","277519992_Burnout_and_Suicidal_Ideation_among_US_Medical_Students","254337599_The_Prevalence_of_Depression_Among_Medical_Students","235913855_Manual_for_the_Depression_Anxiety_and_Stress_Scales_DASS","227683898_Prevalence_of_emotional_disorder_among_medical_students_in_a_Malaysian_University"]}