{"id":"233358212_Small-Time_Asymptotics_for_an_Uncorrelated_Local-Stochastic_Volatility_Model","abstract":"We add some rigour to the work of Henry-Labordère (200916.\n\nHenry-Labordère , P. 2009. Analysis, Geometry, and Modeling in Finance: Advanced Methods in Option Pricing, New York, London: Chapman & Hall. View all references; Analysis, Geometry, and Modeling in Finance: Advanced Methods in Option Pricing (London and New York: Chapman & Hall)), Lewis (200721.\nLewis, A. (2007) Geometries and Smile Asymptotics for a Class of Stochastic Volatility Models. http://www.optioncity.net (http://www.optioncity.net) (Accessed: 28 May 2011). View all references; Geometries and Smile Asymptotics for a Class of Stochastic Volatility Models. Available at http://www.optioncity.net (accessed 28 May 2011)) and Paulot (200924.\nPaulot, L. (2009) Asymptotic implied volatility at the second order with application to the SABR model, Working Paper papers.ssrn.com/sol3/papers.cfm?abstract_id=1413649 (http://papers.ssrn.com/sol3/papers.cfm?abstract_id=1413649) (Accessed: 11 June 2011). View all references; Asymptotic implied volatility at the second order with application to the SABR model, Working Paper, Available at papers.ssrn.com/sol3/papers.cfm?abstract_id=1413649 (accessed 11 June 2011)) on the small-time behaviour of a local-stochastic volatility model with zero correlation at leading order. We do this using the Freidlin—Wentzell (FW) theory of large deviations for stochastic differential equations (SDEs), and then converting to a differential geometry problem of computing the shortest geodesic from a point to a vertical line on a Riemmanian manifold, whose metric is induced by the inverse of the diffusion coefficient. The solution to this variable endpoint problem is obtained using a transversality condition, where the geodesic is perpendicular to the vertical line under the aforementioned metric. We then establish the corresponding small-time asymptotic behaviour for call options using Hölder's inequality, and the implied volatility (using a general result in Roper and Rutkowski (forthcoming27.\n\nRoper , M. and \nRutkowski , M. forthcoming. A note on the behaviour of the Black–Scholes implied volatility close to expiry. International Journal of Theoretical and Applied Finance, View all references, A note on the behavior of the Black–Scholes implied volatility close to expiry, International Journal of Thoretical and Applied Finance). We also derive a series expansion for the implied volatility in the small-maturity limit, in powers of the log-moneyness, and we show how to calibrate such a model to the observed implied volatility smile in the small-maturity limit.","authors":["Martin Forde","Antoine Jacquier"],"meta":["December 2011Applied Mathematical Finance 18(6):517-535","DOI:10.1080/1350486X.2011.591159"],"references":["247884260_The_Local_Volatility_Surface_Unlocking_the_Information_in_Index_Option_Prices","321499880_Random_Perturbations_of_Dynamical_Systems","284037306_On_small_random_perturbations_of_dynamical_systems","267125391_Nonparametric_estimation_for_stochastic_volatility_models","255482463_Brownian_Motion_and_Stochastic_Calculus","253235721_Small-Time_Asymptotics_for_Implied_Volatility_Under_a_General_Local-Stochastic_Volatility_Model","248056340_The_valuation_and_hedging_of_barrier_and_lookback_options_under_the_CEV_process","247588554_Some_Properties_of_Eigenfunctions_of_the_Laplace_Operatoron_Riemannnian_Manifolds","246650031_Large_Deviations_for_Stochastic_Processes","239062860_Notes_on_Option_Pricing_I_Constant_Elasticity_of_Variance_Di_usions","235622441_Managing_Smile_Risk","235622444_Analysis_Geometry_and_Modeling_in_Finance_Advanced_Methods_inOption_Pricing","233971671_Large_Deviation_Techniques_and_Applications","229815392_On_the_Behavior_of_the_Fundamental_Solution_of_the_Heat_Equation_with_Variable_Coefficients","229779706_Computing_the_Implied_Volatility_in_Stochastic_Volatility_Models"]}