{"id":"2334019_Problem_Independent_Distributed_Simulated_Annealing_and_its_Applications","abstract":"Simulated annealing has proven to be a good technique for solving hard combinatorial optimization problems. Some attempts at speeding up annealing algorithms have been based on shared memory multiprocessor systems. Also parallelizations for certain problems on distributed memory multiprocessor systems are known.\nIn this paper, we present a problem independent general purpose parallel implementation of simulated annealing on large distributed memory message-passing multiprocessor systems. The sequential algorithm is studied and we give a classification of combinatorial optimization problems together with their neighborhood structures. Several parallelization approaches are examined considering their suitability for problems of the various classes. For typical representatives of the different classes good parallel simulated annealing implementations are presented.\nWe describe in detail several ’tricks’ increasing efficiency and attained solution quality of the different parallel implementations. Extensive measurements of efficiency, solution quality and other parameters of the algorithms are presented on different numbers of processors. These measurements show, that our algorithms scale up to more that 120 processors. Some applications are described in detail, showing the practical relevance of our work. All algorithms are implemented in OCCAM-2 on a free configurable transputer system.","authors":["Ralf Diekmann","R. Luling","J. Simon"],"meta":["April 1999","DOI:10.1007/978-3-642-46787-5_2"],"references":["314924835_Parallelization_of_Simulated_Annealing_Algorithm_for_FPGA_Placement_and_Routing","316322368_The_Annealing_Algorithm","290787097_Theoretical_and_Computational_Aspects_of_Simulated_Annealing","248656173_TSPLIB-A_traveling_salesman_problem_library","247074870_Optimization_by_Simulated_Annealing_an_Experimental_Evaluation","242609152_Parallel_implementations_of_the_statistical_cooling_algorithm","242419263_An_efficient_general_cooling_schedule_for_simulated_annealing","239841746_Theoretical_and_Computational_Aspects_of_Simulated_Annealing","223749785_Random_Number_Generators_for_MIMD_Parallel_Processors","220758749_Strategies_for_a_Massively_Parallel_Implementation_of_Simulated_Annealing"]}