{"id":"233660049_The_dominance_of_English_in_the_international_scientific_periodical_literature_and_the_future_of_language_use_in_science","abstract":"Throughout the 20th century, international communication has shifted from a plural use of several languages to a clear pre-eminence of English, especially in the field of science. This paper focuses on international periodical publications where more than 75 percent of the articles in the social sciences and humanities and well over 90 percent in the natural sciences are written in English. The shift towards English implies that an increasing number of scientists whose mother tongue is not English have already moved to English for publication. Consequently, other international languages, namely French, German, Russian, Spanish and Japanese lose their attraction as languages of science. Many observers conclude that it has become inevitable to publish in English, even in English only. The central question is whether the actual hegemony of English will create a total monopoly, at least at an international level, or if changing global conditions and language policies may allow alternative solutions. The paper analyses how the conclusions of an inevitable monopoly of English are constructed, and what possible disadvantages such a process might entail. Finally, some perspectives of a new plurilingual approach in scientific production and communication are sketched.","authors":["Rainer Enrique Hamel"],"meta":["December 2007AILA Review 20(1):53-71","DOI:10.1075/aila.20.06ham","Project: Language Policy in the Field of Science and Higher Education"],"references":["315697858_Linguistic_Imperialism","290226590_Regional_blocs_as_a_barrier_against_English_hegemony_The_language_policy_of_Mercosur_in_South_America","324291018_Ist_Deutsch_noch_internationale_Wissenschaftssprache_English_auch_fur_die_Lehre_an_den_deutschsprachigen_Hochschulen","304557243_The_Dawning_of_Desire_Hegel's_Logical_History_of_Philosophy_and_Politics","292056478_Les_langues_internationales_dans_les_publications_scientifiques_et_techniques","290778630_Global_English_and_the_non-native_speaker","286566818_Asian_Englishes_Beyond_the_Canon","273590662_The_Emergent_World_Language_System_An_Introduction","272792102_Why_global_English_may_mean_the_end_of_'English_as_a_Foreign_Language'","272747702_English_as_a_Global_Language"]}