{"id":"233749240_Attitudes_toward_statistics_in_medical_postgraduates_Measuring_evaluating_and_monitoring","abstract":"Background\nIn medical training, statistics is considered a very difficult course to learn and teach. Current studies have found that students’ attitudes toward statistics can influence their learning process. Measuring, evaluating and monitoring the changes of students’ attitudes toward statistics are important. Few studies have focused on the attitudes of postgraduates, especially medical postgraduates. Our purpose was to understand current attitudes regarding statistics held by medical postgraduates and explore their effects on students’ achievement. We also wanted to explore the influencing factors and the sources of these attitudes and monitor their changes after a systematic statistics course.\n\nMethods\nA total of 539 medical postgraduates enrolled in a systematic statistics course completed the pre-form of the Survey of Attitudes Toward Statistics −28 scale, and 83 postgraduates were selected randomly from among them to complete the post-form scale after the course.\n\nResults\nMost medical postgraduates held positive attitudes toward statistics, but they thought statistics was a very difficult subject. The attitudes mainly came from experiences in a former statistical or mathematical class. Age, level of statistical education, research experience, specialty and mathematics basis may influence postgraduate attitudes toward statistics. There were significant positive correlations between course achievement and attitudes toward statistics. In general, student attitudes showed negative changes after completing a statistics course.\n\nConclusions\nThe importance of student attitudes toward statistics must be recognized in medical postgraduate training. To make sure all students have a positive learning environment, statistics teachers should measure their students’ attitudes and monitor their change of status during a course. Some necessary assistance should be offered for those students who develop negative attitudes.","authors":["Yuhai Zhang","Lei Shang","Rui Wang","Qinbo Zhao"],"meta":["November 2012BMC Medical Education 12(1):117","DOI:10.1186/1472-6920-12-117","SourcePubMed"],"references":["280661444_PREDICTING_STUDENT_PERFORMANCE_IN_A_STATISTICS_COURSE_USING_THE_MATHEMATICS_AND_STATISTICS_PERCEPTION_SCALE_MPSP","265098021_FACTORS_INFLUENCING_THE_DEVELOPMENT_OF_MIDDLE_SCHOOL_STUDENTS'_INTEREST_IN_STATISTICAL_LITERACY_6","255723159_Research_experience","255630322_A_Study_of_Student_Attitudes_and_Performance_in_an_Online_Introductory_Business_Statistics_Class","303517524_Factors_influencing_the_development_of_middle_school_students'_interest_in_statistical_literacy","284320547_Assessing_statistical_reasoning","278948057_Bias_Reduction_of_Maximum_Likelihood_Estimates","275848747_The_Assessment_Challenge_in_Statistics_Education","262324688_Using_writing_assignments_in_teaching_statistics_An_empirical_study","258136064_Modeling_Statistics_Achievement_among_Graduate_Students","247728325_The_Development_and_Validation_of_the_Survey_of_Attitudes_Toward_Statistics","252960854_STUDENTS'_ATTITUDES_THE_OTHER_IMPORTANT_OUTCOME_IN_STATISTICS_EDUCATION","248965957_Attitudes_toward_Statistics_Assessments","247727974_The_Survey_of_Attitudes_Toward_Statistics_Scale_A_Construct_Validity_Study","247727633_Attitudes_toward_Statistics_An_Evaluation_of_Multiple_Measures"]}