{"id":"233777224_Analysis_of_cultural_and_gender_influences_on_teamwork_performance_for_software_requirements_analysis_in_multinational_environments","abstract":"Software development is mainly a social activity where teams of developers should work as a coordinated unit to fulfill the needs of customers. Studies have shown the importance of teamwork ability as the main skill for software professionals both in local settings and in global software development. Teamwork performance can be evaluated according to different approaches but we need deeper analysis within software teams of differences in individuals' performance related to culture, nationality or even gender. We applied a simple evaluation experience named teamwork benefits awareness (TBA) to groups of last-year students of computing degrees with experience as junior IT professionals during intensive multinational workshops based on international software projects. TBA allowed to measure individual and team performance during a requirements analysis session based on a real project. Results segmented by nationality and gender are presented and analysed in comparison with the data collected from computing professionals in local settings. In general, no significant differences have been found out although interesting relations are suggested with two Hofstede's country indicators. TBA is also perceived as a good technique for highlighting both teamwork benefits as well as the nature of real situations of software requirements analysis and orientation to customer needs.","authors":["Luis Fernandez-Sanz","Sanjay Misra"],"meta":["June 2012IET Software 6(3):167-175","DOI:10.1049/iet-sen.2011.0070","Project: Achieving Sustainable Development Goals  through ICT/Software Engineering"],"references":["293181253_Cultural_Context_and_its_Impact_on_Requirements_Elicitation_in_Thailand","277468861_Familiarity_Complexity_and_Team_Performance_in_Geographically_Distributed_Software_Development","269199785_Software_engineering_economics","267697816_AV-8B's_Experience_Using_the_TSP_to_Accelerate_SW-CMM_Adoption","265739582_Software_Configuration_Management_Patterns_Effective_Teamwork_Practical_Integration","264799709_The_Psychology_Of_Computer_Programming","248803748_The_Team_Software_Process_in_Practice_A_Summary_of_Recent_Results","248800148_The_team_software_process_TSP","247747763_The_3-D_Managerial_Effectiveness_Seminar_MES_Twenty_Years_of_Transnational_Experience","247573628_Software_Testing_Techniques"]}