{"id":"233799051_MicroScope-An_integrated_microbial_resource_for_the_curation_and_comparative_analysis_of_genomic_and_metabolic_data","abstract":"MicroScope is an integrated platform dedicated to both the methodical updating of microbial genome annotation and to comparative analysis. The resource provides data from completed and ongoing genome projects (automatic and expert annotations), together with data sources from post-genomic experiments (i.e. transcriptomics, mutant collections) allowing users to perfect and improve the understanding of gene functions. MicroScope (http://www.genoscope.cns.fr/agc/microscope) combines tools and graphical interfaces to analyse genomes and to perform the manual curation of gene annotations in a comparative context. Since its first publication in January 2006, the system (previously named MaGe for Magnifying Genomes) has been continuously extended both in terms of data content and analysis tools. The last update of MicroScope was published in 2009 in the Database journal. Today, the resource contains data for >1600 microbial genomes, of which ∼300 are manually curated and maintained by biologists (1200 personal accounts today). Expert annotations are continuously gathered in the MicroScope database (∼50 000 a year), contributing to the improvement of the quality of microbial genomes annotations. Improved data browsing and searching tools have been added, original tools useful in the context of expert annotation have been developed and integrated and the website has been significantly redesigned to be more user-friendly. Furthermore, in the context of the European project Microme (Framework Program 7 Collaborative Project), MicroScope is becoming a resource providing for the curation and analysis of both genomic and metabolic data. An increasing number of projects are related to the study of environmental bacterial (meta)genomes that are able to metabolize a large variety of chemical compounds that may be of high industrial interest.","authors":["David Vallenet","Eugeni Belda","Alexandra Calteau","Stéphane Cruveiller"],"meta":["November 2012Nucleic Acids Research 41(Database issue)","DOI:10.1093/nar/gks1194","SourcePubMed"],"references":["260730887_Reorganizing_the_protein_space_at_the_Universal_Protein_Resource_UniProtThe_UniProt_ConsortiumNucleic_Acids_Res201140D1D71D75324512022102590","242452121_Assigning_protein_functions_by_comparative_genome_analysis_Protein_phylogenetic_profiles_genomicybioinformaticsymetabolic_pathwaysystructural_complexes","230871969_A_comprehensive_evaluation_of_normalization_methods_for_Illumina_high-throughput_RNA_sequencing_data_analysis","225302000_The_CanOE_Strategy_Integrating_Genomic_and_Metabolic_Contexts_across_Multiple_Prokaryote_Genomes_to_Find_Candidate_Genes_for_Orphan_Enzymes","225276722_The_Pathway_Tools_Pathway_Prediction_Algorithm","221831347_Distinct_co-evolution_patterns_of_genes_associated_to_DNA_polymerase_III_DnaE_and_PolC","221694163_The_automatic_annotation_of_bacterial_genomes","310671006_Integrative_genomics_viewer","275410362_Integrative_genomics_viewer","221856951_Magnetosomes_eliminate_intracellular_reactive_oxygen_species_in_Magnetospirillum_gryphiswaldense_MSR-1"]}