{"id":"233725514_3-Dimensional_Examination_of_the_Adult_Mouse_Subventricular_Zone_Reveals_Lineage-Specific_Microdomains","abstract":"Recent studies suggest that the subventricular zone (SVZ) of the lateral ventricle is populated by heterogeneous populations of stem and progenitor cells that, depending on their exact location, are biased to acquire specific neuronal fates. This newly described heterogeneity of SVZ stem and progenitor cells underlines the necessity to develop methods for the accurate quantification of SVZ stem and progenitor subpopulations. In this study, we provide 3-dimensional topographical maps of slow cycling \"stem\" cells and progenitors based on their unique cell cycle properties. These maps revealed that both cell populations are present throughout the lateral ventricle wall as well as in discrete regions of the dorsal wall. Immunodetection of transcription factors expressed in defined progenitor populations further reveals that divergent lineages have clear regional enrichments in the rostro-caudal as well as in the dorso-ventral span of the lateral ventricle. Thus, progenitors expressing Tbr2 and Dlx2 were confined to dorsal and dorso-lateral regions of the lateral ventricle, respectively, while Mash1+ progenitors were more homogeneously distributed. All cell populations were enriched in the rostral-most region of the lateral ventricle. This diversity and uneven distribution greatly impede the accurate quantification of SVZ progenitor populations. This is illustrated by measuring the coefficient of error of estimates obtained by using increasing section sampling interval. Based on our empirical data, we provide such estimates for all progenitor populations investigated in this study. These can be used in future studies as guidelines to judge if the precision obtained with a sampling scheme is sufficient to detect statistically significant differences between experimental groups if a biological effect is present. Altogether, our study underlines the need to consider the SVZ of the lateral ventricle as a complex 3D structure and define methods to accurately assess neural stem cells or progenitor diversity and population sizes in physiological or experimental paradigms.","authors":["Kasum Azim","Roberto Fiorelli","Stefan Zweifel","Anahi Hurtado-Chong"],"meta":["November 2012PLoS ONE 7(11):e49087","DOI:10.1371/journal.pone.0049087","SourcePubMed"],"references":["51019535_Targeted_electroporation_of_defined_lateral_ventricular_walls_A_novel_and_rapid_method_to_study_fate_specification_during_postnatal_forebrain_neurogenesis","51019534_Sequential_generation_of_olfactory_bulb_glutamatergic_neurons_by_Neurog2-expressing_precursor_cells","50195208_Transcriptome_signature_of_the_adult_mouse_choroid_plexus","49640410_In_Vivo_Fate_Mapping_and_Expression_Analysis_Reveals_Molecular_Hallmarks_of_Prospectively_Isolated_Adult_Neural_Stem_Cells","40443665_Adult_Mouse_Subventricular_Zone_Stem_and_Progenitor_Cells_Are_Sessile_and_Epidermal_Growth_Factor_Receptor_Negatively_Regulates_Neuroblast_Migration","223986364_Early_Decline_in_Progenitor_Diversity_in_the_Marmoset_Lateral_Ventricle","51523097_Persistent_Sonic_Hedgehog_Signaling_in_Adult_Brain_Determines_Neural_Stem_Cell_Positional_Identity","51432358_GFAP-GFP_Neural_Progenitors_Are_Antigenically_Homogeneous_and_Anchored_in_Their_Enclosed_Mosaic_Niche","50374069_Restrictions_in_time_and_space-New_insights_into_generation_of_specific_neuronal_subtypes_in_the_adult_mammalian_brain","38073687_High_Levels_of_Id1_Expression_Define_B1_Type_Adult_Neural_Stem_Cells"]}