{"id":"233810960_Evolution_styles_Using_architectural_knowledge_as_an_evolution_driver","abstract":"Software evolution is an increasingly challenging and compelling concern for every developed software system because of the changes in the requirements, the technology, etc. When software evolution is carried out, software architecture emerges as one of the cornerstones that should be considered from two different points of view: as an artifact for the evolution, as it helps the architect plan and restructure the system, and as an artifact\nof the evolution, because it has to be modified as well. This paper focuses on the second point of view—that is, on the evolution of the software architecture, but taking into account architectural knowledge as a key driver of the process. Given that architecture rationale and design intent are critical in evolving software systems, it is imperative that they be captured in some useful form to aid that evolution process. We present a new approach for evolution styles that extends them by considering in their description the architectural knowledge as a valuable asset of the evolution process.","authors":["Carlos E. Cuesta","Elena Navarro","Dewayne E. Perry","Cristina Roda"],"meta":["September 2013Journal of Software Maintenance and Evolution Research and Practice 25(9):891–1059","DOI:10.1002/smr.1575","Project: Enriching UsiXML for the development of post-WIMP User Interfaces (insPIre, TIN2012-34003)"],"references":["309201748_Evolution_styles_to_the_rescue_of_architectural_evolution_knowledge","297967090_Feature-based_survey_of_model_transformation_approaches","277295384_Above_the_Clouds_A_Berkeley_View_of_Cloud_Computing","265780327_Non-Functional_Requirements_in_Software_Engineering","265352649_Causality_Models_reasoning_and_inference_second_edition","263729154_Causality_Models_Reasoning_and_Inference","262353975_Towards_a_taxonomy_of_software_change_Research_Articles","247928846_ETAK_Tailoring_Architectural_Evolution_by_re-using_Architectural_Knowledge","242719040_DESMET_a_Method_for_Evaluating_Software_Engineering_Methods_and_Tools","242427349_SAAM_A_Method_for_Analyzing_the_Properties_of"]}