{"id":"233808031_Building_European_Spatial_Data_Infrastructures","abstract":"Over the last two decades the development of geographic information systems (GIS) and related technologies has dramatically changed the way in which geographic information is handled by a wide range of public and private sector bodies throughout the world and spawned a multi billion dollar industry. But the full potential of these technologies is unlikely to be realised until governments throughout the world the necessary steps to create the spatial data infrastructures (SDIs) that are needed to facilitate access to the geographic information assets that are held by the various stakeholders to maximise their overall usage. With these considerations in mind this book explores the nature of the SDIs that are emerging throughout Europe where the drive to build them has been given added momentum by the efforts of the European Union to create a framework for a multi national infrastructure for spatial information in Europe (INSPIRE). \n\nThis book provides an introduction to the tasks involved in building European Spatial Data Infrastructures (SDIs). It takes the reader through the main stages of the arguments that are involved and explains the procedures that are required for this purpose. Unlike many other books describing GIS and SDIs this book is not technical in character. The discussion focuses instead on the institutional and decision making context within SDIs must be developed and the importance of building partnerships between public and private sector bodies to exploit the opportunities that are being opened up as a result of the continuing development of modern geographic information handling technologies. \n\nThe arguments underlying the book are presented in five chapters, each of which builds upon what has been said in earlier chapters. The first chapter explains the scope and purpose of the book and gives some idea of the range and diversity of applications that are being developed using modern geographic information system (GIS) technologies. The second chapter goes into more detail with respect to the nature of geographic information and the tasks that can be carried out using GIS. It also introduces the concept of spatial data infrastructures (SDIs) and explains why government action is needed to overcome the political and institutional barriers that inhibit the use that can be made of such technologies. Chapter 3 examines the current position with respect to SDI development in Europe and considers the findings of three case studies that highlight in more detail the issues that must be resolved in each of three main components of SDI development. Chapter 4 considers the case that has been made for an integrated SDI strategy at the European wide level and describes the steps that are being undertaken at the present time to create a legal framework ‘for the establishment and operation of an Infrastructure for Spatial Information in Europe, for the purpose of formulating, implementing, monitoring and evaluating Community policies at all levels and providing public information’ as a result of its INSPIRE initiative. The final chapter discusses the overall findings of the analysis and considers their implications for future SDI development. It also identifies four key strategic issues that must be given priority in future debates about SDIs and urges those involved to develop their networking skills.","authors":["Ian Masser"],"meta":["January 2007","Edition: First editionPublisher: ESRI PressISBN: 978-1-58948-165-7"],"references":[]}