{"id":"233879928_A_Robust_Document_Image_Binarization_Technique_for_Degraded_Document_Images","abstract":"Segmentation of text from badly degraded document images is a very challenging task due to the high inter/intravariation between the document background and the foreground text of different document images. In this paper, we propose a novel document image binarization technique that addresses these issues by using adaptive image contrast. The adaptive image contrast is a combination of the local image contrast and the local image gradient that is tolerant to text and background variation caused by different types of document degradations. In the proposed technique, an adaptive contrast map is first constructed for an input degraded document image. The contrast map is then binarized and combined with Cannys edge map to identify the text stroke edge pixels. The document text is further segmented by a local threshold that is estimated based on the intensities of detected text stroke edge pixels within a local window. The proposed method is simple, robust and involves minimum parameter tuning. It has been tested on three public datasets that were used in the recent Document Image Binarization Contest (DIBCO) 2009 & 2011 and Handwritten Document Image Binarization Contest (H-DIBCO) 2010 and achieves accuracies of 93.5%, 87.8% and 92.03%, respectively, that are significantly higher than or close to that of the bestperforming methods reported in the three contests. Experiments on the Bickley diary dataset that consists of several challenging bad quality document images also show the superior performance of our proposed method, compared with other techniques.","authors":["Bolan Su","Chew Lim Tan","Shijian Lu"],"meta":["December 2012IEEE Transactions on Image Processing 22(4)","DOI:10.1109/TIP.2012.2231089","SourcePubMed"],"references":["312890367_'Edge_detection_techniques_An_overview'","228403778_Segmentation_and_analysis_of_double-sided_handwritten_archival_documents","305437251_An_Introduction_to_Digital_Image_Processing","302937305_A_Threshold_Selection_Method_from_Gray-Level_Histogram","264585101_On_threshold_selection_using_clustering_criteria","251763737_Efficient_edge_detection_using_two_scales","244955816_A_fast_adaptive_method_for_binarization_of_document_images","243769649_Dynamic_thresholding_of_gray-level_images","239667287_A_new_approach_for_multithreshold_selection","234388857_An_Introduction_to_Digital_Image_Processing"]}