{"id":"233952834_Productive_re-use_of_CSCL_data_and_analytic_tools_to_provide_a_new_perspective_on_group_cohesion","abstract":"The goals of this paper are twofold: (1) to demonstrate how previously published data can be re-analyzed to gain a new perspective on CSCL dynamics and (2) to propose a new measure of social cohesion that was developed through improvements to existing analytic tools. In this study, we downloaded the Simuligne corpus from the publicly available Mulce repository. We improved the Knowledge Space Visualizer (KSV) to deepen the notion of cohesion by using a dynamic representation of sociograms. The Calico tools have been used and extended to complete this cohesion measure by analyzing lexical markers. These complementary analyses of cohesion, based on clique sizes and communication intensity on the one hand, and lexical markers on the other hand, offer more detailed information on (a) the\nrelationships between participants and (b) the structure and intensity of communication. In particular, the analyses highlight strong convergences that were not visible in the previous analysis.","authors":["Christophe Reffay","Teplovs","Blondel Francois-Marie"],"meta":["July 2011","Conference: Connecting Computer-Supported Collaborative Learning to Policy and Practice: CSCL2011 Conference","Project: ICOGAD"],"references":["254199600_A_Data_Repository_for_the_EDM_Community","222700230_Models_of_CorePeriphery_Structures","221033871_Share_and_explore_discussion_forum_objects_on_the_Calico_website","221033715_Evaluating_CSCL_log_files_by_social_network_analysis","220934286_Software-based_scaffolding_Supporting_the_development_of_knowledge_building_discourse_in_online_courses","262239889_A_systemic_model_of_interaction_analysis_in_CSCL","244476355_Oral_and_Written_Linguistic_Aspects_of_Computer_Conferencing_A_Corpus_Based_Study","222676823_Combining_qualitative_evaluation_and_social_network_analysis_for_the_study_of_classroom_social_interactions","222447730_Centrality_in_Social_Networks'_Conceptual_Clarification","220438219_Networked_Interactivity"]}