{"id":"233941796_Jensen-Bregman_LogDet_Divergence_with_Application_to_Efficient_Similarity_Search_for_Covariance_Matrices","abstract":"Covariance matrices have found success in several computer vision applications, including activity recognition, visual surveillance, and diffusion tensor imaging. This is because they provide an easy platform for fusing multiple features compactly. An important task in all of these applications is to compare two covariance matrices using a (dis)similarity function, for which the common choice is the Riemannian metric on the manifold inhabited by these matrices. As this Riemannian manifold is not flat, the dissimilarities should take into account the curvature of the manifold. As a result such distance computations tend to slow down, especially when the matrix dimensions are large or gradients are required. Further, suitability of the metric to enable efficient nearest neighbor retrieval is an important requirement in the contemporary times of big data analytics. To alleviate these difficulties, this paper proposes a novel dissimilarity measure for covariances, the Jensen-Bregman LogDet Divergence (JBLD). This divergence enjoys several desirable theoretical properties, at the same time is computationally less demanding (compared to standard measures). We propose a K-Means clustering algorithm on JBLD. We demonstrate the superior performance of JBLD on covariance datasets from several computer vision applications.","authors":["Anoop Cherian","Suvrit Sra","Arindam Banerjee","Nikos Papanikolopoulos"],"meta":["December 2012IEEE Transactions on Pattern Analysis and Machine Intelligence","DOI:10.1109/TPAMI.2012.259","SourcePubMed","Project: Machine Learning Methods and Applications"],"references":["265330373_The_Geometric_Mean_Matrices_Metrics_and_More","264947822_Jensen_Divergence-Based_Means_of_SPD_Matrices","236915211_A_Graph_Cut_Approach_to_Image_Segmentation_in_Tensor_Space","234782710_Reflectance_and_texture_of_real-world_surfaces","313566497_Human_detection_via_classification_on_Riemannian_manifolds","267168963_Positive_Definite_Matrices","266298783_FDDB_A_Benchmark_for_Face_Detection_in_Unconstrained_Settings","261455999_Shape_Indexing_Using_Approximate_Nearest-Neighbour_Search_in_High-Dimensional_Spaces","256805480_Means_of_Hermitian_positive-definite_matrices_based_on_the_log-determinant_-divergence_function","243072964_Book_Review_Harmonic_analysis_on_symmetric_spaces_and_applications"]}