{"id":"233982273_Secluded_Connectivity_Problems","abstract":"Consider a setting where possibly sensitive information sent over a path in a\nnetwork is visible to every {neighbor} of the path, i.e., every neighbor of\nsome node on the path, thus including the nodes on the path itself. The\nexposure of a path $P$ can be measured as the number of nodes adjacent to it,\ndenoted by $N[P]$. A path is said to be secluded if its exposure is small. A\nsimilar measure can be applied to other connected subgraphs, such as Steiner\ntrees connecting a given set of terminals. Such subgraphs may be relevant due\nto considerations of privacy, security or revenue maximization. This paper\nconsiders problems related to minimum exposure connectivity structures such as\npaths and Steiner trees. It is shown that on unweighted undirected $n$-node\ngraphs, the problem of finding the minimum exposure path connecting a given\npair of vertices is strongly inapproximable, i.e., hard to approximate within a\nfactor of $O(2^{\\log^{1-\\epsilon}n})$ for any $\\epsilon>0$ (under an\nappropriate complexity assumption), but is approximable with ratio\n$\\sqrt{\\Delta}+3$, where $\\Delta$ is the maximum degree in the graph. One of\nour main results concerns the class of bounded-degree graphs, which is shown to\nexhibit the following interesting dichotomy. On the one hand, the minimum\nexposure path problem is NP-hard on node-weighted or directed bounded-degree\ngraphs (even when the maximum degree is 4). On the other hand, we present a\npolynomial algorithm (based on a nontrivial dynamic program) for the problem on\nunweighted undirected bounded-degree graphs. Likewise, the problem is shown to\nbe polynomial also for the class of (weighted or unweighted) bounded-treewidth\ngraphs.","authors":["Shiri Chechik","Matthew P. Johnson","Merav Parter","David Peleg"],"meta":["September 2013","DOI:10.1007/978-3-642-40450-4_26","SourcearXiv","Conference: European Symposium on Algorithms"],"references":["267075644_Approximation_and_Hardness_Results_for_Label_Cut_and_Related_Problems","226834589_Approximation_and_hardness_results_for_label_cut_and_related_problems","225342694_Knowledge-Based_Probability_Maps_for_Covert_Pathfinding","284039089_Reducibility_among_combinatorial_problems","277473416_A_Linear-Time_Algorithm_for_Finding_Tree-Decompositions_of_Small_Treewidth","263693771_On_the_Minimum_Label_Spanning_Tree_Problem","262171669_The_Labeled_perfect_matching_in_bipartite_graphs","261465510_The_thinnest_path_problem_for_secure_communications_A_directed_hypergraph_approach","243787873_Compexity_of_Computer_Computations","232005540_New_visibility-based_path-planning_approach_for_covert_robotic_navigation"]}