{"id":"233950731_A_Model_for_Determining_the_Degree_of_Contradictions_in_Information","abstract":"Conversational systems are gaining popularity rapidly. Consequently, the believability of the conversational systems or chatterbots is becoming increasingly important. Recent research has proven that learning chatterbots tend to be rated as being more believable by users. Based on Raj’s Model for Chatterbot Trust, we present a model for allowing chatterbots to determine the degree of contradictions in contradictory statements when learning thereby allowing them to potentially learn more accurately via a form of discourse. Some information that is learnt by a chatterbot may be contradicted by other information presented subsequently. Choosing correctly which information to use is critical in chatterbot believability. Our model uses sentence structures and patterns to compute contradiction degrees that can be used to overcome the limitations of Raj’s Trust Model, which takes any contradictory information as being equally contradictory as opposed to some contradictions being greater than others and therefore having a greater impact on the actions that the chatterbot should take. This paper also presents the relevant proofs and tests of the contradiction degree model as well as a potential implementation method to integrate our model with Raj’s Trust Model.","authors":["Ram Gopal Raj","Vimala Balakrishnan"],"meta":["January 2011Malaysian Journal of Computer Science 24(3):160-167"],"references":["237105135_Measuring_consensus_and_conflict_among_stakeholders_in_emergency_response_information_system_requirements_negotiations","233950757_Information_Dissemination_and_Storage_for_Tele-Text_Based_Conversational_Systems'_Learning","221013101_Automatic_Prediction_of_Parser_Accuracy","292766142_Modern_Information_Retrieval_A_Brief_Overview","242430670_Model-based_feedback_in_the_kl-divergence_retrieval_model","228057706_Indexing_By_Latent_Semantic_Analysis","222784872_A_probability_distribution_model_for_information_retrieval","221603864_CHATTERBOTS_TINYMUDS_and_the_Turing_Test_Entering_the_Loebner_Prize_Competition","220688577_Introduction_To_Modern_Information_Retrieval","220688491_Automatic_Text_Processing_The_Transformation_Analysis_and_Retrieval_of_Information_by_Computer_Addison-Wesley_Reading_PA"]}