{"id":"233973136_Protein_interface_classification_by_evolutionary_analysis","abstract":"Background\nDistinguishing biologically relevant interfaces from lattice contacts in protein crystals is a fundamental problem in structural biology. Despite efforts towards the computational prediction of interface character, many issues are still unresolved.\n\nResults\nWe present here a protein-protein interface classifier that relies on evolutionary data to detect the biological character of interfaces. The classifier uses a simple geometric measure, number of core residues, and two evolutionary indicators based on the sequence entropy of homolog sequences. Both aim at detecting differential selection pressure between interface core and rim or rest of surface. The core residues, defined as fully buried residues (>95% burial), appear to be fundamental determinants of biological interfaces: their number is in itself a powerful discriminator of interface character and together with the evolutionary measures it is able to clearly distinguish evolved biological contacts from crystal ones. We demonstrate that this definition of core residues leads to distinctively better results than earlier definitions from the literature. The stringent selection and quality filtering of structural and sequence data was key to the success of the method. Most importantly we demonstrate that a more conservative selection of homolog sequences - with relatively high sequence identities to the query - is able to produce a clearer signal than previous attempts.\n\nConclusions\nAn evolutionary approach like the one presented here is key to the advancement of the field, which so far was missing an effective method exploiting the evolutionary character of protein interfaces. Its coverage and performance will only improve over time thanks to the incessant growth of sequence databases. Currently our method reaches an accuracy of 89% in classifying interfaces of the Ponstingl 2003 datasets and it lends itself to a variety of useful applications in structural biology and bioinformatics. We made the corresponding software implementation available to the community as an easy-to-use graphical web interface at http://www.eppic-web.org.","authors":["Jose M Duarte","Adam Srebniak","Martin A Schärer","Guido Capitani"],"meta":["December 2012BMC Bioinformatics 13(1):334","DOI:10.1186/1471-2105-13-334","SourcePubMed"],"references":["252670752_Petromagnetic_Properties_In_The_Naica_Mining_District_Chihuahua_Mexico_Searching_For_Source_of_Mineralization","225092279_Gapped_blast_and_psi-blastA_new_generation_of_protein_database_search_programs","353606108_Protein-protein_interfaces_Analysis_of_amino_acid_conservation_in_homodimers","353606062_Discriminating_between_homodimeric_and_monomeric_proteins_in_the_crystalline_state","319526430_Discriminating_between_homodimeric_and_monomeric_proteins_in_the_crystalline_state","319213536_Protein-protein_interfaces_Analysis_of_amino_acid_conservation_in_homodimers","285762546_The_PyMol_Molecular_Graphics_System","244635758_Automatic_inference_of_protein_quaternary_structure_from_crystals","223190053_A_language_and_environment_for_statistical_computing","221839022_Immuno-_and_Constitutive_Proteasome_Crystal_Structures_Reveal_Differences_in_Substrate_and_Inhibitor_Specificity"]}