{"id":"233952392_Metrics_for_Requirements_Engineering_and_Automated_Requirements_Tools","abstract":"Software requirements are the foundations from which quality\nis measured. Measurement enables to improve the software\nprocess; assist in planning, tracking and controlling the\nsoftware project and assess the quality of the software thus\nproduced. Quality issues such as accuracy, security and\nperformance are often crucial to the success of a software\nsystem. Quality should be maintained from starting phase of\nsoftware development. Requirements management, play an\nimportant role in maintaining quality of software. A project can\ndeliver the right solution on time and within budget with proper\nrequirements management. Software quality can be maintained\nby checking quality attributes in requirements document.\nRequirements metrics such as volatility, traceability, size and\ncompleteness are used to measure requirements engineering\nphase of software development lifecycle. Manual measurement\nis expensive, time consuming and prone to error therefore\nautomated tools should be used. Automated requirements tools\nare helpful in measuring requirements metrics. The aim of this\npaper is to study, analyze requirements metrics and automated\nrequirements tools, which will help in choosing right metrics to\nmeasure software development based on the evaluation of\nAutomated Requirements Tools","authors":["Mohammad Ubaidullah Bokhari","Shams Tabrez Siddiqui"],"meta":["January 2011","Conference: Proceedings of the 5 th National Conference; INDIACom-2011"],"references":["255738147_Software_Engineering_Processes_Principles_and_Applications","285842809_Petri_Nets_Properties_Analysis_and_Applications","280850641_OOIS'02_Object-Oriented_Information_Systems","277752460_Requirements_Management_Tools_A_Qualitative_Assessment","246773439_Writing_Effective_Use_Cases","245588543_Book_Requirements_Engineering_Processes_and_Techniques","243775347_An_Introduction_to_Requirements_Engineering","243644720_Design_and_Code_Inspections_To_Reduce_Errors_In_Program_Development","243586071_Automated_quality_analysis_of_natural_language_requirement_specifications","242609654_Understanding_Z_A_Specification_Language_and_its_Formal_Semantics"]}