{"id":"233963537_Prospects_from_agroecology_and_industrial_ecology_for_animal_production_in_the_21st_century","abstract":"Agroecology and industrial ecology can be viewed as complementary means for reducing the environmental footprint of animal farming systems: agroecology mainly by stimulating natural processes to reduce inputs, and industrial ecology by closing system loops, thereby reducing demand for raw materials, lowering pollution and saving on waste treatment. Surprisingly, animal farming systems have so far been ignored in most agroecological thinking. On the basis of a study by Altieri, who identified the key ecological processes to be optimized, we propose five principles for the design of sustainable animal production systems: (i) adopting management practices aiming to improve animal health, (ii) decreasing the inputs needed for production, (iii) decreasing pollution by optimizing the metabolic functioning of farming systems, (iv) enhancing diversity within animal production systems to strengthen their resilience and (v) preserving biological diversity in agroecosystems by adapting management practices. We then discuss how these different principles combine to generate environmental, social and economic performance in six animal production systems (ruminants, pigs, rabbits and aquaculture) covering a long gradient of intensification. The two principles concerning economy of inputs and reduction of pollution emerged in nearly all the case studies, a finding that can be explained by the economic and regulatory constraints affecting animal production. Integrated management of animal health was seldom mobilized, as alternatives to chemical drugs have only recently been investigated, and the results are not yet transferable to farming practices. A number of ecological functions and ecosystem services (recycling of nutrients, forage yield, pollination, resistance to weed invasion, etc.) are closely linked to biodiversity, and their persistence depends largely on maintaining biological diversity in agroecosystems. We conclude that the development of such ecology-based alternatives for animal production implies changes in the positions adopted by technicians and extension services, researchers and policymakers. Animal production systems should not only be considered holistically, but also in the diversity of their local and regional conditions. The ability of farmers to make their own decisions on the basis of the close monitoring of system performance is most important to ensure system sustainability.","authors":["Bertrand Dumont","L. Fortun-Lamothe","Magali Jouven","Marielle Thomas"],"meta":["June 2013animal 7(6):1-16","DOI:10.1017/S1751731112002418","SourcePubMed","Project: Agroecology in livestock production systems"],"references":["346930288_Grasslands_in_Europe_Of_High_Nature_Value","341962681_Local_resources_and_typical_animal_products","341458316_Pour_un_elevage_ovin_allaitant_performant_et_durable_sur_parcours_un_systeme_experimental_sur_le_causse_du_Larzac","340973084_Pathologies_infectieuses_du_lapin_en_elevage_rationnel","340726927_Influence_de_la_nutrition_sur_l'excretion_d'azote_de_phosphore_de_cuivre_et_de_zinc_des_porcs_et_sur_les_emissions_d'ammoniac_de_gaz_a_effet_de_serre_et_d'odeurs","313101550_Analyse_de_l'efficacite_environnementale_et_energe_tique_de_la_mesure_agri-environnementale_Systeme_fourrager_econome_en_intrants_SFEI_a_partir_de_l'analyse_de_pratiques_de_quarante-quatre_signataires","313081255_Animals_in_agroecosystems","303266732_Strategies_for_manufacturing_1","303251237_Agricultural_change_and_low-input_technology","298952836_Infectious_pathologies_in_intensive_meat_rabbit_production"]}