{"id":"234091733_Model_Simulations_of_the_Impact_of_the_2002_Antarctic_Ozone_Hole_on_the_Midlatitudes","abstract":"The 2002 Antarctic winter was characterized by unusually strong wave activity. The frequency and intensity of the anomalies increased in August and early September with a series of minor stratospheric warmings and culminated in a major stratospheric warming in late September. A three-dimensional high resolution chemical transport model is used to estimate the effect of the exceptional 2002 Antarctic winter on chemical ozone loss in the midlatitudes and in polar regions. An ozone budget analysis is performed using a range of geographical and chemical ozone tracers. To highlight the unusual behavior of the 2002 winter, the same analysis is performed for the more typical 2001 winter. The ability of the model to reproduce the evolution of polar and midlatitude ozone during these two contrasted winters is first evaluated against ozonesonde measurements at middle and high latitudes. The evolution of the model-calculated 2002 ozone loss within the deep vortex core is found to be somewhat similar to that seen in the 2001 simulation until November, which is consistent with a lower-stratospheric vortex core remaining more or less isolated even during the major warming. However, the simulations suggest that the wave activity anomalies in 2002 enhanced mixing well before the major warming within the usually weakly mixed vortex edge region and, to a lesser extent, within the surrounding extravortex region. As a result of the increased permeability of the vortex edge, the export of chemically activated vortex air is more efficient during the winter in 2002 than in 2001. This has a very noticeable impact on the model-calculated midlatitude ozone loss, with destruction rates being about 2 times higher during August and September in 2002 compared to 2001. If the meteorological conditions of 2002 were to become more prevalent in the future, Antarctic polar ozone depletion would certainly be reduced, especially in the vortex edge region. However, it is also likely that polar chemical activation would affect midlatitude ozone earlier in the winter.","authors":["Marion Marchand","Slimane Bekki","Andrea Pazmino","Franck Lefèvre"],"meta":["March 2005Journal of the Atmospheric Sciences 62(3):871-884","DOI:10.1175/JAS-3326.1"],"references":["252635464_The_impact_of_the_mixing_properties_within_the_Antarctic_stratospheric_vortex_on_ozone_loss_in_spring","249610225_Mixing_and_Chemical_Ozone_Loss_during_and_after_the_Antarctic_Polar_Vortex_Major_Warming_in_September_2002","260936442_An_Alternative_Form_for_Potential_Vorticity","260332078_Diagnosing_ozone_loss_in_the_extratropical_lower_stratosphere","259304804_Vertical_Structure_of_the_Anomalous_2002_Antarctic_Ozone_Hole","252532289_Influence_of_Polar_Ozone_Loss_On_Northern_Midlatitude_Regions_Estimated_By_A_High_Resolution_Chemistry_Transport_Model","248802604_A_model_study_of_the_connection_between_polar_and_midlatitude_ozone_loss_in_the_Northern_Hemisphere_lower_stratosphere","248797022_An_objective_determination_of_the_polar_vortex_using_Erte's_potential_vorticity","241063058_Dynamical_containment_of_Antarctic_ozone_depletion","240486407_Chemistry_of_the_1991-1992_stratospheric_winter_Three_dimensional_model_simuations"]}