{"id":"234047207_XORing_Elephants_Novel_Erasure_Codes_for_Big_Data","abstract":"Distributed storage systems for large clusters typically use replication to provide reliability. Recently, erasure codes have been used to reduce the large storage overhead of three- replicated systems. Reed-Solomon codes are the standard design choice and their high repair cost is often considered an unavoidable price to pay for high storage efficiency and high reliability.\nThis paper shows how to overcome this limitation. We present a novel family of erasure codes that are efficiently repairable and offer higher reliability compared to Reed- Solomon codes. We show analytically that our codes are optimal on a recently identified tradeoff between locality and minimum distance.\nWe implement our new codes in Hadoop HDFS and compare to a currently deployed HDFS module that uses Reed- Solomon codes. Our modified HDFS implementation shows a reduction of approximately 2× on the repair disk I/O and repair network traffic. The disadvantage of the new coding scheme is that it requires 14% more storage compared to Reed-Solomon codes, an overhead shown to be information theoretically optimal to obtain locality. Because the new codes repair failures faster, this provides higher reliability, which is orders of magnitude higher compared to replication.","authors":["Maheswaran Sathiamoorthy","M. Asteris","D. Papailiopoulos","Alexandros Dimakis"],"meta":["August 2013Proceedings of the VLDB Endowment 6(5)","Conference: 39th International Conference on Very Large Data Bases (VLDB)"],"references":["261470798_Locally_repairable_codes","258764373_Asymptotic_Interference_Alignment_for_Optimal_Repair_of_MDS_Codes_in_Distributed_Storage","311556934_Rethinking_erasure_codes_for_cloud_file_systems_Minimizing_IO_for_recovery_and_degraded_reads","266451646_Reed-Solomon_codes_and_their_applications","262405534_Write_OFF-loading_Practical_power_management_for_enterprise_storage","262204122_Rethinking_erasure_codes_for_cloud_file_systems_minimizing_IO_for_recovery_and_degraded_reads","260302636_Optimal_Exact-Regenerating_Codes_for_Distributed_Storage_at_the_MSR_and_MBR_Points_via_a_Product-Matrix_Construction","260302112_Interference_Alignment_in_Regenerating_Codes_for_Distributed_Storage_Necessity_and_Code_Constructions","259860916_Polynomial_Codes_Over_Certain_Finite_Fields","240451052_Write_OffLoading_Practical_Power_Management_for_Enterprise_Storage"]}