{"id":"234082610_A_Service-Oriented_Architecture_for_Robust_e-Voting","abstract":"Of all the requirements for e-voting systems robustness is the one that has received the least attention. This paper is concerned with addressing this issue. It is argued that a two-level consideration of robustness can facilitate the design of e-voting systems and enhance their resilience. An approach is proposed which requires, as a first step, an explicit awareness of robustness at protocol level and robustness at system level. The second step involves the identification of appropriate technologies and their integration into an architecture where the two forms of robustness are addressed. The approach is illustrated by the design and implementation of a service-oriented architecture for robust e-voting (SOREV), based on the FOO92 protocol. The service-oriented architecture has provided the framework for the integration of selected technologies such as blind signatures, encryption and onion routing. In addition to the Just-in-time (JIT) composition of the e-voting system, it supports the distribution of tasks and state. The system conforms to most e-voting requirements.","authors":["Richard Cooke","Rachid Anane"],"meta":["September 2012Service Oriented Computing and Applications 6(3):249-266","DOI:10.1007/s11761-012-0108-0"],"references":["279663456_The_Pret_a_Voter_Verifiable_Election_System","255993399_A_Multidisciplinary_Framework_for_Resilence_to_Disasters_and_Disruptions","242392476_A_Critical_View_on_Internet_Voting_Technology","234092241_File_Management_in_a_Mobile_DHT-based_P2P_Environment","224597253_PrEt_A_Voter_a_Voter-Verifiable_Voting_System","224127059_A_Taxonomy_Refining_the_Security_Requirements_for_Electronic_Voting_Analyzing_Helios_as_a_Proof_of_Concept","260635010_Anonymous_connections_and_onion_routing","245452520_Applied_Cryptography_second_edition","238683273_A_Formal_Treatment_of_Onion_Routing_Preliminary_Version","228820534_Election_verifiability_in_electronic_voting_protocols_Preliminary_version"]}