{"id":"234134564_Calling_patterns_in_human_communication_dynamics","abstract":"Modern technologies not only provide a variety of communication modes (e.g., texting, cell phone conversation, and online instant messaging), but also detailed electronic traces of these communications between individuals. These electronic traces indicate that the interactions occur in temporal bursts. Here, we study intercall duration of communications of the 100,000 most active cell phone users of a Chinese mobile phone operator. We confirm that the intercall durations follow a power-law distribution with an exponential cutoff at the population level but find differences when focusing on individual users. We apply statistical tests at the individual level and find that the intercall durations follow a power-law distribution for only 3,460 individuals (3.46%). The intercall durations for the majority (73.34%) follow a Weibull distribution. We quantify individual users using three measures: out-degree, percentage of outgoing calls, and communication diversity. We find that the cell phone users with a power-law duration distribution fall into three anomalous clusters: robot-based callers, telecom fraud, and telephone sales. This information is of interest to both academics and practitioners, mobile telecom operators in particular. In contrast, the individual users with a Weibull duration distribution form the fourth cluster of ordinary cell phone users. We also discover more information about the calling patterns of these four clusters (e.g., the probability that a user will call the c(r)-th most contact and the probability distribution of burst sizes). Our findings may enable a more detailed analysis of the huge body of data contained in the logs of massive users.","authors":["Zhi-Qiang Jiang","Wen-Jie Xie","Ming-Xia Li","Boris Podobnik"],"meta":["January 2013Proceedings of the National Academy of Sciences 110(5)","DOI:10.1073/pnas.1220433110","SourcePubMed","Projects: Network Motifs and Horizontal visibility graphs in Time series analysisHuman dynamics"],"references":["260623411_Human_Dynamics_Darwin_and_Einstein_correspondence_patterns","232750222_Human_dynamics_Darwin_and_Einstein_correspondence_patterns","231063194_Empirical_Analysis_on_the_Human_Dynamics_of_a_Large-Scale_Short_Message_Communication_System","230621155_Correlated_Dynamics_in_Egocentric_Communication_Networks","226732549_Stretched_exponential_distributions_in_Nature_and_Economy_Fat_tails''_with_characteristic_scales","288863399_Human_dynamics_Darw_in_and_Einstein_correspondence","266293560_Critical_Phenomena_in_Natural_Sciences_Chaos_Fractals_Selforganization_And_Disorder_Concepts_and_Tools","230960531_Critical_Phenomena_in_Natural_Sciences_Chaos_Fractals_Selforganization_and_Disorder_Concepts_and_Tools","230689443_Power-law_distributions_in_binned_empirical_data","228460288_Structure_and_tie_strengths_in_a_mobile_communication_network"]}