{"id":"234168931_Complexity_of_Social_Network_Anonymization","abstract":"With an abundance of social network data being released, the need to protect sensitive information within these networks has become an important concern of data publishers. To achieve this objective, various notions of k-anonymization have been proposed for social network graphs. In this paper we focus on the complexity of optimization problems that arise from trying to anonymize graphs, establishing that optimally k-anonymizing the label sequences of edge-labeled graphs is intractable. We show how this result implies intractability for other notions of k-anonymization in literature. We also consider the case of bipartite social network graphs which arise from the representation of distinct entities, such as movies and viewers, patients and drugs, or products and customers. Within this setting we demonstrate that, although k-anonymizing edge-labeled graphs is intractable for k ≥ 3, polynomial time algorithms exist for arbitrary bipartite graphs when k = 2 and for unlabeled bipartite graphs irrespective of the value of k. Finally, in this paper we extend the study of attribute disclosure within the context of social networks by defining t-closeness, a measure of how effectively an adversary can determine sensitive information about members of a k-anonymous social network.","authors":["Sean Chester","Bruce M. Kapron","Gautam Srivastava","Venkatesh Srinivasan"],"meta":["March 2012Social Network Analysis and Mining 3(2)","DOI:10.1007/s13278-012-0059-7"],"references":["228455853_The_spread_of_media_content_through_blogs","221654439_Preserving_the_Privacy_of_Sensitive_Relationships_in_Graph_Data","221651153_k-Anonymization_of_Social_Networks_by_Vertex_Addition","221609005_The_union-split_algorithm_and_cluster-based_anonymization_of_social_networks","304007758_L-diversity_Privacy_beyond_k-AnonymityJ","277529936_L_-diversity","263882456_ACHIEVING_k-ANONYMITY_PRIVACY_PROTECTION_USING_GENERALIZATION_AND_SUPPRESSION","225125553_The_k-anonymity_and_l-diversity_approaches_for_privacy_preservation_in_social_networks_against_neighborhood_attacks","224285701_L-diversity_Privacy_beyond_kanonymity","221591755_Terminal_Backup_3D_Matching_and_Covering_Cubic_Graphs"]}