{"id":"234131819_Game_theory_and_plant_ecology","abstract":"The fixed and plastic traits possessed by a plant, which may be collectively thought of as its strategy, are commonly modelled as density-independent adaptations to its environment. However, plant strategies may also represent density- or frequency-dependent adaptations to the strategies used by neighbours. Game theory provides the tools to characterise such density- and frequency-dependent interactions. Here, we review the contributions of game theory to plant ecology. After briefly reviewing game theory from the perspective of plant ecology, we divide our review into three sections. First, game theoretical models of allocation to shoots and roots often predict investment in those organs beyond what would be optimal in the absence of competition. Second, game theoretical models of enemy defence suggest that an individual's investment in defence is not only a means of reducing its own tissue damage but also a means of deflecting enemies onto competitors. Finally, game theoretical models of trade with mutualistic partners suggest that the optimal trade may reflect competition for access to mutualistic partners among plants. In short, our review provides an accessible entrance to game theory that will help plant ecologists enrich their research with its worldview and existing predictions.","authors":["Gordon G Mcnickle","Ray Dybzinski"],"meta":["January 2013Ecology Letters 16(4)","DOI:10.1111/ele.12071","SourcePubMed"],"references":["306152401_The_evolution_of_reciprocal_altruism","299182946_Niche_co-evolution_in_consumer-resource_communities","346063298_SPECIALIZATION_AND_RESOURCE_TRADE_BIOLOGICAL_MARKETS_AS_A_MODEL_OF_MUTUALISMS","341617159_Review_Factors_affecting_rhizosphere_priming_effects","312532363_Predator-mediated_coexistence_A_non-equilibrium_model","297269668_The_unseen_majority_Soil_microbes_as_drivers_of_plant_diversity_and_productivity_in_terrestrial_ecosystems_Ecology_Letters_2008_11_3_296-310","296814447_Evolutionarily_stable_leaf_area_production_in_plant_populations","292182832_Resource_Competition_and_Community_Structure","288482517_Review_Factors_affecting_rhizosphere_priming_effects","287481636_Evolutionary_Game_Theory_Natural_Selection_and_Darwinian_Dynamics"]}