{"id":"234133396_Registration_of_PET_and_CT_images_based_on_multiresolution_gradient_of_mutual_information_demons_algorithm_for_positioning_esophageal_cancer_patients","abstract":"Accurate registration of 18F−FDG PET (positron emission tomography) and CT (computed tomography) images has important clinical significance in radiation oncology. PET and CT images are acquired from 18F−FDG PET/CT scanner, but the two acquisition processes are separate and take a long time. As a result, there are position errors in global and deformable errors in local caused by respiratory movement or organ peristalsis. The purpose of this work was to implement and validate a deformable CT to PET image registration method in esophageal cancer to eventually facilitate accurate positioning the tumor target on CT, and improve the accuracy of radiation therapy. Global registration was firstly utilized to preprocess position errors between PET and CT images, achieving the purpose of aligning these two images on the whole. Demons algorithm, based on optical flow field, has the features of fast process speed and high accuracy, and the gradient of mutual information‐based demons (GMI demons) algorithm adds an additional external force based on the gradient of mutual information (GMI) between two images, which is suitable for multimodality images registration. In this paper, GMI demons algorithm was used to achieve local deformable registration of PET and CT images, which can effectively reduce errors between internal organs. In addition, to speed up the registration process, maintain its robustness, and avoid the local extremum, multiresolution image pyramid structure was used before deformable registration. By quantitatively and qualitatively analyzing cases with esophageal cancer, the registration scheme proposed in this paper can improve registration accuracy and speed, which is helpful for precisely positioning tumor target and developing the radiation treatment planning in clinical radiation therapy application.\nPACS numbers: 87.57.nj, 87.57.Q‐, 87.57.uk","authors":["Shuo Jin","Dengwang Li","Hongjun Wang","Yong Yin"],"meta":["January 2013Journal of Applied Clinical Medical Physics 14(1):3931","DOI:10.1120/jacmp.v14i1.3931","SourcePubMed"],"references":["220659489_iLogDemons_A_Demons-Based_Registration_Algorithm_for_Tracking_Incompressible_Elastic_Biological_Tissues","26816774_18-FDG-PETCT_for_Image-guided_and_Intensity_modulated_radiotherapy","281155773_Image_matching_as_a_diffusion_process_An_analogy_with_Maxwell's_demons","243772313_Multi-modal_volume_registration_by_maximization_of_mutual_information","225417210_Understanding_the_Demon's_Algorithm_3D_Non-rigid_Registration_by_Gradient_Descent","224733267_The_Laplacian_Pyramid_as_a_Compact_Image_Code","221729288_CT-PET_weighted_image_fusion_for_separately_scanned_whole_body_rat","42542630_PET-guided_delineation_of_radiation_therapy_treatment_volumes_A_survey_of_image_segmentation_techniques","40021590_Demons_deformable_registration_for_CBCT-guided_procedures_in_the_head_and_neck_Convergence_and_accuracy","24413471_Molecular_PETCT_Imaging-Guided_Radiation_Therapy_Treatment_Planning"]}