{"id":"23426973_McRae_BH_Dickson_BG_Keitt_TH_Shah_VB_Using_circuit_theory_to_model_connectivity_in_ecology_evolution_and_conservation_Ecology_89_2712-2724","abstract":"Connectivity among populations and habitats is important for a wide range of ecological processes. Understanding, preserving, and restoring connectivity in complex landscapes requires connectivity models and metrics that are reliable, efficient, and process based. We introduce a new class of ecological connectivity models based in electrical circuit theory. Although they have been applied in other disciplines, circuit-theoretic connectivity models are new to ecology. They offer distinct advantages over common analytic connectivity models, including a theoretical basis in random walk theory and an ability to evaluate contributions of multiple dispersal pathways. Resistance, current, and voltage calculated across graphs or raster grids can be related to ecological processes (such as individual movement and gene flow) that occur across large population networks or landscapes. Efficient algorithms can quickly solve networks with millions of nodes, or landscapes with millions of raster cells. Here we review basic circuit theory, discuss relationships between circuit and random walk theories, and describe applications in ecology, evolution, and conservation. We provide examples of how circuit models can be used to predict movement patterns and fates of random walkers in complex landscapes and to identify important habitat patches and movement corridors for conservation planning.","authors":["Brad McRae","Brett G Dickson","Timothy H Keitt","Viral B. Shah"],"meta":["November 2008Ecology 89(10):2712-24","DOI:10.1890/07-1861.1","SourcePubMed"],"references":["272504143_Detecting_Critical_Scales_in_Fragmented_Landscapes","346062466_SIMPLE_CONNECTIVITY_MEASURES_IN_SPATIAL_ECOLOGY","319395141_Graph_Theory","313578115_Vertebrate_Responses_to_Environmental_Patchiness_in_Arid_and_Semiarid_Ecosystems","313565837_Random_Walks_and_Electric_Networks","312737725_Quantifying_connectivity_Balancing_metric_performance_with_data_require-_ments","286141163_The_future_of_connectivity_conservation","282758380_Vertebrate_Responses_to_Environmental_Patchiness_in_Arid_and_Semiarid_Ecosystems","272504044_Landscape_Connectivity_A_Graph-Theoretic_Perspective","265775543_Introduction_to_electric_circuits_Incl_1_CD-ROM_4th_ed"]}