{"id":"234689466_Measuring_Student_Engagement_in_Upper_Elementary_through_High_School_A_Description_of_21_Instruments_Issues_Answers_REL_2011-No_098","abstract":"Researchers, educators, and policymakers are focusing more on student engagement as the key to addressing low achievement, student boredom and alienation, and high dropout rates (Fredricks, Blumenfeld, and Paris 2004). As schools and districts seek to increase engagement, it is important for them to understand how it has been defined and to assess the options for measuring it. One challenge educators and evaluators face in measuring engagement is determining the appropriateness of the available instruments, especially given limited time to review the literature. Instruments for measuring engagement also reflect different disciplinary perspectives and theoretical frameworks and are thus not easily compared. To address the information needs of education professionals, this report describes the 21 instruments for measuring engagement in upper elementary through high school identified through a literature review. The report does not include a technical review of the quality of each measure, nor does it recommend or identify strengths or weaknesses of particular instruments. Appendices include: (1) Instrument abstracts; (2) Methodology; and (3) Student self-report subscale information. Some tables contain references. Includes a section containing 38 general references, followed by \"References for Excluded Instruments.\" (Contains 2 boxes, 33 tables, 1 figure and 3 notes.) [For the summary report, see ED514997.]","authors":["Jennifer A. Fredricks","Wendy Mccolskey","Jane E. Manweiler","Joy Mordica"],"meta":["January 2011"],"references":["283159673_Motivation_in_the_Classroom_Reciprocal_Effects_of_Teacher_Behavior_and_Student_Engagement_Across_the_School_Year","313647646_Protective_factors_in_adolescent_problem_behavior_Moderator_effects_and_developmental_change","313171884_Context_self_and_action_a_motivational_analysis_of_self-system_processes_across_the_life-span","289964219_Introduction_to_Classical_and_Modern_Test_Theory","287471045_School_environments_and_the_diverging_pathways_of_students_living_in_poverty","286974139_Dropout_Prevention_for_Youth_with_Disabilities_Efficacy_of_a_Sustained_School_Engagement_Procedure","285609564_Students'_Goal_Orientations_and_Cognitive_Engagement_in_Classroom_Activities","281453238_Beyond_the_Classroom_Why_School_Reform_Has_Failed_and_What_Parents_Need_to_Do","281392462_Identification_with_school","280820290_Student_engagement_in_instructional_activity_Patterns_in_the_elementary_middle_and_high_School_Years"]}