{"id":"234695934_Usability_Level_of_Distance_Education_Website_Sakarya_University_Sample","abstract":"The main goal of this research is to determine the usability of Sakarya University Adapazari Vocational Two-Year Community College's Web Site. A scale was developed to the evaluation and applied to 1512 students. From the applied questionnaire only appropriate ones were selected to be evaluated and 1229 questionnaires were analysed. Finally, usability level of distance education's web site was analysed according to the comments of the students of Sakarya University Adapazari Vocational Two-Year Community College, and were analyzed to determine whether there is a meaningful difference based on their genders, ages, departments, university years and geographical conditions. Results of the research revealed that students feel contented with usability of distance education's web site. In the analysis done according to the gender variable, when compared to the male students, female students; according to the age variable, when compared to the old students, the young students; according to the department variable, when compared to the students of other departments, the students of Mechatronics and Business Management Department; according to the university years variable, when compared to the senior students, the freshmen; according to the geographical conditions variable, when compared to the students of other regions, the students living in Mediterranean region are not content with usability of web site in some factors. (Contains 27 tables.)","authors":["Aytekin Isman","Onur İşbulan"],"meta":["January 2010Turkish Online Journal of Educational Technology 9(1)"],"references":["252421338_Finding_Information_on_the_Web_Does_the_Amount_of_Whitespace_Really_Matter","220382600_Usability_engineering_turns_10","292767709_Usability_on_the_web_isn't_a_luxury","263464568_An_Introduction_to_Human-Computer_Interaction","245579228_Background_and_overview_of_contemporary_American_distance_education","242789100_Entering_the_world-wide_web_a_guide_to_cyberspace","234743015_The_Changing_World_of_Correspondence_Study_International_Readings","234616510_Perspectives_of_Research_on_Distance_Education","200085864_The_Essential_Guide_to_User_Interface_Design","200025867_Shaping_Web_Usability_Interaction_Design_in_Context"]}