{"id":"234637286_Instant_Messaging_in_On-Site_and_Online_Classes_in_Higher_Education","abstract":"In the past, instant messaging (IM) was considered \"a teen thing\" rather than a serious tool for education. As teenagers who rely on IM as a communication tool arrive on college campuses, however, IM usage will become more prevalent in higher education. IM has generated increasing awareness of its value for educational purposes despite its slow adoption in educational settings. Cohn urged universities and faculty members to adopt IM and train themselves in using it, as IM use by prospective and current college students has become pervasive. Walther, meanwhile, expressed some pessimism about the readiness of adults, including faculty, to use IM. Schools can use IM for emergency communication needs, as well. Research on IM in educational settings is growing. Based on a study of 30 students Nicholson reported that students who used IM services found it easier to communicate, felt a stronger sense of community, and had more venues for informal and social communication about class material, the school, and their common degree program. Farmer briefly addressed IM's benefits and drawbacks in educational settings. Benefits include a heightened \"social presence\" for distance-education students and a growth in collaborative opportunities, due to its millions of users everywhere. Drawbacks include adding additional layers to the learning environment, a growing expectation among students of unlimited access to instructors, and the related time issues for faculty. Farmer went so far as to describe the drawbacks as a \"potential faculty nightmare.\" This article presents the author's findings from a study of IM use in both local and distance courses, focusing on student-instructor interactions. Surveyed students appreciated not having to wait for answers to questions and the more informal context of IM conversations. They felt that the potential for IM to be useful in the distance-learning environment was high. (Contains 1 table and 7 endnotes.)","authors":["Wooseob Jeong"],"meta":["January 2007"],"references":[]}