{"id":"234669989_Learning_at_a_Distance_Undergraduate_Enrollment_in_Distance_Education_Courses_and_Degree_Programs_Stats_in_Brief_NCES_2012-154","abstract":"This Statistics in Brief investigates participation in distance education using the most current nationally representative student-reported data collected by the National Center for Education Statistics (NCES). Specifically, the data come from the three most recent administrations of the National Postsecondary Student Aid Study, which were conducted during the 1999-2000, 2003-04, and 2007-08 academic years (NPSAS:2000, NPSAS:04, and NPSAS:08). This Statistics in Brief's use of student-reported data allows for exploration of how participation in these courses varies with student characteristics. Key findings include: (1) From 2000 to 2008, the percentage of undergraduates enrolled in at least one distance education class expanded from 8 percent to 20 percent, and the percentage enrolled in a distance education degree program increased from 2 percent to 4 percent; (2) Compared with all students, students studying computer science and those studying business enrolled at higher rates in both distance education classes (27 percent and 24 percent, respectively, vs. 20 percent) and distance education degree programs (8 percent and 6 percent, respectively, vs. 4 percent); (3) Participation in a distance education course was most common among undergraduates attending public 2-year colleges; 22 percent were so enrolled. Participation in a distance education degree program was most common among undergraduates attending for-profit institutions; 12 percent were so enrolled; (4) Older undergraduates and those with a dependent, a spouse, or full-time employment participated in both distance education classes and degree programs relatively more often than their counterparts; and (5) Students with mobility disabilities enrolled in a distance education course more often than students with no disabilities (26 percent compared with 20 percent), but no other statistically significant difference between students with and without disabilities was detected. (Contains 4 tables, 8 figures and 10 footnotes.)","authors":["Alexandria Walton Radford"],"meta":["January 2011"],"references":[]}