{"id":"234797243_Distributed_Cognition_Toward_a_New_Foundation_for_Human-Computer_Interaction_Research","abstract":"We are quickly passing through the historical moment when people work in front of a single computer, dominated by a small CRT and focused on tasks involving only local information. Networked computers are becoming ubiquitous and are playing increasingly significant roles in our lives and in the basic infrastructures of science, business, and social interaction. For human-computer interaction to advance in the new millennium we need to better understand the emerging dynamic of interaction in which the focus task is no longer confined to the desktop but reaches into a complex networked world of information and computer-mediated interactions. We think the theory of distributed cognition has a special role to play in understanding interactions between people and technologies, for its focus has always been on whole environments: what we really do in them and how we coordinate our activity in them. Distributed cognition provides a radical reorientation of how to think about designing and supporting human-computer interaction. As a theory it is specifically tailored to understanding interactions among people and technologies. In this article we propose distributed cognition as a new foundation for human-computer interaction, sketch an integrated research framework, and use selections from our earlier work to suggest how this framework can provide new opportunities in the design of digital work materials.","authors":["James D. Hollan","Edwin Hutchins","David Kirsh"],"meta":["June 2000ACM Transactions on Computer-Human Interaction 7(2):174-196","DOI:10.1145/353485.353487","SourceDBLP"],"references":["312616338_Formulating_planes_seeing_as_a_situated_activity","250890525_Direct_Manipulation_Interfaces","345976353_A_Cognitive_Theory_of_Cultural_Meaning","332089384_Being_There_Putting_Brain_Body_and_World_Together_Again","324308514_Plans_and_Situated_Actions_The_Problem_of_Human-Machine_Communication","319394840_Distributed_cognitions_psychological_and_educational_considerations","288961023_Information_Visualization","273049580_Systematic_Fieldwork","262007812_Constructing_Meaning_from_Space_Gesture_and_Speech","245345132_STEAMER_An_interactive_inspectable_simulation-based_training_system"]}