{"id":"234762246_Higher_Education_Migrates_to_YouTube_and_Social_Networks","abstract":"True global enlightenment. That's how YouTubeEDU is being promoted by company officials who have announced the launch of a YouTube section devoted to academic content. Calling the new site \"a free, self-organizing, democratic website containing all the world's knowledge,\" YouTubeEDU promises an environment in which \"any qualified teacher can contribute and absolutely anyone can learn.\" It features lectures and other materials from hundreds of colleges and universities, including Stanford, Harvard, and the Massachusetts Institute of Technology (MIT). YouTubeEDU is the result of a volunteer project sparked by a group of employees who wanted to find a better way to collect and highlight all the educational content already being uploaded to YouTube. Many colleges and universities have previously posted videos on the site through their own channels; however, the new EDU page organizes the courses and programs in one place. Colleges are boasting of their presence on YouTubeEDU and making the most of its marketing potential. Some are uploading presentations linked to cultural and entertainment phenomena. YouTube is not the only Internet site offering higher education lectures and courses. One competitor is Big Think, which bills itself as \"a global forum connecting people and ideas.\" Its experts include Paul Krugman, the Nobel-Prize-winning professor from Princeton University, as well as Billy Collins (former U.S. poet laureate), and dozens of other professors, politicians, and business leaders speaking on various topics. Another website, Education for All, offers more than video with its courses. The site provides syllabus materials that accompany courses, plus reading lists. The link for a course on financial markets, taught by Robert Schiller, a professor of economics at Yale University, even added copies of the exams and solutions as well as a discussion forum for viewers. The site also includes a complete set of four Chinese-language courses available with a package of downloadable textbooks and audio recordings of dialogues. And then there is Academic Earth, a site that also offers video courses and lectures from some of the nation's top scholars. Founded by Richard Ludlow, a Yale graduate, Academic Earth's mission is to \"give everyone on earth access to a world-class education.\" It draws material from Harvard, MIT, Princeton, Stanford, Yale, and Berkeley. The idea of adding social networks as educational tools in the academic landscape is catching on fast as colleges recognize the potential to use the networks as both marketing tools and learning tools.","authors":["Marilyn Gilroy"],"meta":["January 2010"],"references":[]}