{"id":"234794393_Proof_Verification_and_the_Hardness_of_Approximation_Problems","abstract":"We show that every language in NP has a probablistic verifier that checks membership proofs for it using logarithmic number of random bits and by examining a constant number of bits in the proof. If a string is in the language, then there exists a proof such that the verifier accepts with probability 1 (i.e., for every choice of its random string). For strings not in the language, the verifier rejects every provided “proof” with probability at least 1/2. Our result builds upon and improves a recent result of Arora and Safra [1998] whose verifiers examine a nonconstant number of bits in the proof (though this number is a very slowly growing function of the input length).\nAs a consequence, we prove that no MAX SNP-hard problem has a polynomial time approximation scheme, unless NP = P. The class MAX SNP was defined by Papadimitriou and Yannakakis [1991] and hard problems for this class include vertex cover, maximum satisfiability, maximum cut, metric TSP, Steiner trees and shortest superstring. We also improve upon the clique hardness results of Feige et al. [1996] and Arora and Safra [1998] and show that there exists a positive ε such that approximating the maximum clique size in an N -vertex graph to within a factor of N ε is NP-hard.","authors":["Sanjeev Arora","Carsten Lund","Rajeev Motwani","Madhu Sudan"],"meta":["September 2001Journal of the ACM 45(3):501-555","DOI:10.1145/278298.278306","SourceCiteSeer"],"references":["346512332_The_Steiner_problem_with_edge_lengths_1_and_2","313693938_The_complexity_of_approximating_a_nonlinear_program","313185557_On_the_complexity_of_approximating_the_independent_set_problem","313040639_The_Decision_Problem_for_the_Probabilities_of_Higher-Order_Properties","291049932_Hardness_of_Approximations_in_Approximation_Algorithms_for_NP-Hard_Problems","284382099_P-complete_approximation_problem","284039089_Reducibility_among_combinatorial_problems","280796730_Guillotine_subdivisions_approximate_polygonal_subdivisions_Part_II-A_simple_polynomial-time_approximation_scheme_for_geometric_k-MST_TSP_and_related_problems","277288046_Generalized_First-Order_Spectra_and_Polynomial-Time_Recognizable_Sets'","273674251_The_Knowledge_Complexity_of_Interactive_Proof_Systems"]}