{"id":"234778455_OSPF_Anatomy_of_an_Internet_routing_protocol","abstract":"From the Publisher:Written for TCP/IP network administrators, protocol designers, and network application developers, this book gives the most complete and practical view ever into the inner workings of Internet routing. The book focuses on OSPF (Open Shortest Path First), a common TCP/IP routing protocol that provides robust and efficient routing support in the most demanding Internet environments. A methodical and detailed description of the protocol is offered and OSPF's role within the wider context of a TCP/IP network is demonstrated. Practical throughout, the book provides not only a theoretical description of Internet routing, but also a real-world look into how theory translates into practice. It shows how algorithms are implemented, and how the routing protocols function in a working network where transmission lines and routers routinely break down.You will find clear explanations of such routing fundamentals as how a router forwards packets, IP addressing, CIDR (Classless Inter-Domain Routing), the routing table, Internet routing architecture, and the two main routing technologies: Distance Vector and link-state algorithms. OSPF is discussed in depth, with an examination of the rationale behind OSPF's design decisions and how it has evolved to keep pace with the rapidly changing Internet environment. OSPF topics covered by the book include the following:OSPF areas and virtual links NBMA (Nonbroadcast multi-access) and Point-to-MultiPoint network segments OSPF configuration and management Interaction with other routing protocols OSPF cryptographic authentication OSPF protocol extensions, including the Demand Circuit extensions and the multicast extensions to OSPF (MOSPF) An OSPF FAQ IP multicast and multicast routing are also discussed. Methods for debugging routing problems are explained, including a catalog of available debugging tools. The book also offers side-by-side comparisons of all the unicast and multicast routing protocols currently in use in the Internet. You will come away from this book with a sophisticated understanding of Internet routing and of the OSPF protocol in particular. Moreover, the book's practical focus will enable you to put this deeper understanding to work in your network environment.","authors":["John T. Moy"],"meta":["January 1998"],"references":[]}