{"id":"234730628_Implementing_a_Strategy_Awareness_Raising_Programme_Strategy_Changes_and_Feedback","abstract":"This article reports on a collaborative action research study carried out on three groups of Spanish beginners during the implementation of a strategy awareness raising programme (SAR). The objective was to analyse the impact of the SAR programme on the students' learning process in three main areas: strategy awareness, strategy use in learning Spanish, and transfer of strategies from Spanish to other subjects. In addition, feedback on the programme was sought from the students. The study involved the use of mixed methods combining self-report and observational data. The triangulated data were collected through a semi-structured questionnaire, interviews and the lecturer's observation journal. Findings revealed significant changes in strategy awareness, strategy use and strategy transfer reported by students, and positive feedback on the programme given by students and lecturer. It is, therefore, argued that these findings illustrate some of the potential benefits of strategy awareness raising programmes, and further development, implementation and research into similar programmes are recommended. (Contains 2 figures and 1 note.)","authors":["Maria Blanco","Margarita Pino-Juste","Beatriz Rodríguez López"],"meta":["January 2010Language Learning Journal 38(1)","DOI:10.1080/09571731003620655"],"references":["346643592_Group_Dynamics_in_the_Language_Classroom","344897151_Learning_Strategies_in_Second_Language_Acquisition","325314013_Modern_Languages_and_Learning_Strategies_In_Theory_and_Practice","303920871_Second_Language_Research_Methodology_and_Design","292310223_Language_learning_strategies","288953605_Strategies_in_learning_and_using_a_second_language","288901731_Methods_for_teaching_learning_strategies_in_the_foreign_language_classroom","284999592_Strategies_and_good_language_learners","283925160_Implementing_the_cognitive_academic_language_learning_approach_CALLA","272792288_Research_methods_in_applied_linguistics"]}