{"id":"234779325_Gender_Achievement_and_Persistence_in_An_Undergraduate_Computer_Science_Program","abstract":"The proportion of computer science (CS) bachelor's degree recipients who are women has consistently been small and is declining. This study investigates factors that predict performance and persistence in an undergraduate CS program and explores why even high-achieving students leave the undergraduate \"CS pipeline.\" The factors that predict achievement and retention sometimes interact in complex, unexpected ways. Male students who earned less than a B in an introductory CS course were more likely to take the next course in the curriculum than were women who earned less than a B. Achievement is a factor in even high-achieving students' decision to leave CS; loss of interest can accompany loss of confidence. Level of achievement was predicted by various background factors including Scholastic Aptitude Test scores, the number of Calculus courses taken before entering the CS program, amount of access to a computer at home, prior computing experience, and having a mentor or role model during high school. Most of these factors also predicted persistence beyond the first two courses required for a CS major. Curiously, women in the introductory CS course who reported having low exposure to specific programming skills outperformed women who reported having a high level of programming experience. The reverse was true of men. Further investigation provided evidence that women who develop programming skills while in high school might do so at the expense of developing other skills that strongly predict CS achievement, particularly math skills.","authors":["Sandra Katz","David Allbritton","John Aronis","Christine Wilson"],"meta":["November 2006Data Base for Advances in Information Systems 37(4):42-57","DOI:10.1145/1185335.1185344"],"references":["282294695_What_Deters_Women_from_Taking_Computer_Science_Courses","314828777_Women_in_CS_and_biology","311473376_Unlocking_the_clubhouse_women_in_computing","293203436_2002-2003_Taulbee_survey","288066806_Predicting_Academic_Achievement_of_College_Computer_Science_Majors","287718906_Effect_of_Gender_and_Computer_Experience_on_Attitudes_toward_Computers","274669053_Analogical_Reasoning_and_Computer_Programming","271729775_Predictors_of_Study_Management_and_Performance_on_A_First-Year_Computer_Course_The_Significance_of_Students'_Study_Goals_and_Perceptions","264799698_Women_Minorities_and_Persons_with_Disabilities_in_Science_and_Engineering_2011_NSF_11-309","264753717_The_New_Occupational_Outlook_Handbook"]}