{"id":"234772650_Cellular_traffic_offloading_through_opportunistic_communications_A_case_study","abstract":"Due to the increasing popularity of various applications for smartphones, 3G networks are currently overloaded by mobile data traffic. Offloading cellular traffic through opportunistic communications is a promising solution to partially solve this problem, because there is no monetary cost for it. As a case study, we investigate the target-set selection problem for information delivery in the emerging Mobile Social Networks (MoSoNets). We propose to exploit opportunistic communications to facilitate the information dissemination and thus reduce the amount of cellular traffic. In particular, we study how to select the target set with only k users, such that we can minimize the cellular data traffic. In this scenario, initially the content service providers deliver information over cellular networks to only users in the target set. Then through opportunistic communications, target-users will further propagate the information among all the subscribed users. Finally, service providers will send the information to users who fail to receive it before the delivery deadline (i.e., delay-tolerance threshold). We propose three algorithms, called Greedy, Heuristic, and Random, for this problem and evaluate their performance through an extensive trace-driven simulation study. The simulation results verify the efficiency of these algorithms for both synthetic and real-world mobility traces. For example, the Heuristic algorithm can offload cellular traffic by up to 73.66% for a real-world mobility trace.","authors":["Bo Han","Pan Hui","Sritesh Kumar","Madhav Marathe"],"meta":["September 2010","DOI:10.1145/1859934.1859943"],"references":["253153146_Inferring_Social_Network_Structure_using_Mobile_Phone_Data","242914003_An_Analysis_of_Approximations_for_Maximizing_Submodular_Set_Functions-I","226804694_Talk_of_the_Network_A_Complex_Systems_Look_at_the_Underlying_Process_of_Word-of-Mouth","224500384_Optimal_and_Scalable_Distribution_of_Content_Updates_over_a_Mobile_Social_Network","224135418_Implications_of_Dynamic_Spectrum_Access_on_the_Efficiency_of_Primary_Wireless_Market","221628503_Effects_of_power_conservation_wireless_coverage_and_cooperation_on_data_dissemination_among_mobile_devicesIn","246106899_Eva_Tardos_Maximizing_the_spread_of_influence_through_a_social_network","224500390_A_Social_Network_Based_Patching_Scheme_for_Worm_Containment_in_Cellular_Networks","224139022_Opportunistic_web_access_via_WLAN_hotspots","221595994_Modeling_epidemic_information_dissemination_on_mobile_devices_with_finite_buffers"]}