{"id":"234756135_UML_for_the_IT_Business_Analyst_A_Practical_Guide_to_Object-Oriented_Requirements_Gathering","abstract":"Coverage includes- Howard Podeswa is the co-founder of Noble, Inc., a Business Analysis (BA) consulting and training company. He has 26 years of experience in many aspects of the software industry, beginning as a developer for Atomic Energy of Canada, Ltd., and continuing as Systems Analyst, Business Analyst, consultant, and author of courseware for IT professionals. He has provided consulting services to a diverse client base, including the Canadian Air Force (MASIS), the South African Community Peace Program, and major financial institutions (Deloitte and Touche, CIBC bank, CGU, etc.) and is a sought-after speaker at international BA conferences. In addition, Howard collaborates with CDI Education on object-oriented projects and training and has designed BA OO training programs for numerous institutions, including Boston University, Humber College, and Polar Bear. Most recently, he was brought on as a subject matter expert for NITAS-a BA apprenticeship program for CompTIA. Howard is also a recognized visual artist whose work has been exhibited and reviewed internationally and supported by the Canada Council for the Arts. His most recent exhibition-Object Oriented Painting Show (OOPS)-was the first to combine his two passions-OO technology and painting. Written for the beginner Business Analyst or Business Analyst student who wants to learn the skills necessary to perform their role on an object-oriented project. Assumes no prior knowledge of business analysis, IT, or object-orientation. Skills are presented in a clear, step-by-step, hands-on style using a real-world case study in order to teach the procedure for applying object-orientation and UML during business analysis. Cuts to the point and covers only what the Business Analyst needs to know to effectively use object-oriented technology. Includes a set of ROSE files for optional use with the hands-on project. If the ROSE files are used, the reader will learn to use this tool to effectively document user requirements and business rules.","authors":["Howard Podeswa"],"meta":[],"references":[]}