{"id":"234804011_Applications_of_weighted_Voronoi_diagrams_and_randomization_to_variance-based-clustering","abstract":"In this paper we consider thek-clustering problem for a set S of n points i=xi in thed-dimensional space with variance-based errors as clustering criteria, motivated from the color quantization problem of computing a color lookup table for frame buffer display. As the inter-cluster criterion to minimize, the sum on intra-cluster errors over every cluster is used, and as the intra-cluster criterion of a clusterSj , a -1pi∈Sjxi-x Sj 2 is considered, where &dot; is the L2 norm and xSj is the centroid of points in Sj, i.e., 1/Sjpi∈Sjxi. The cases of a=1,2 correspond to the sum of squared errors and the all-pairs sum of squared errors, respectively.\nThe k-clustering problem under the criterion with a=1,2 are treated in a unified manner by characterizing the optimum solution to the kclustering problem by the ordinary Euclidean Voronoi diagram and the weighted Voronoi diagram with both multiplicative and additive weights. With this framework, the problem is related to the generalized primary shutter function for the Voronoi diagrams. The primary shutter function is shown to be OnOkd, which implies that, for fixed k, this clustering problem can be solved in a polynomial time. For the problem with the most typical\nintra-cluster criterion of the sum of squared errors, we also present an\nefficient randomized algorithm which, roughly speaking, finds an ∈–approximate 2–clustering inOn1/∈d time, which is quite practical and may be used to real large-scale problems such as the color quantization problem.","authors":["Mary Inaba","Naoki Katoh","Hiroshi Imai"],"meta":["June 1994","DOI:10.1145/177424.178042"],"references":["251360125_e-approximations_of_k_-label_spaces","256417034_A_Parametric_Characterization_and_an_e-Approximation_Scheme_for_the_Minimization_of_a_Quasiconcave_Program","227313991_Three-clustering_of_points_in_the_plane","222232810_Minimizing_the_sum_of_diameters_efficiently","222178480_On_Clustering_Problems_with_Connected_Optima_in_Euclidean_Spaces","221591356_Optimal_Algorithms_for_Approximate_Clustering","220983737_Clustering_Algorithms_Based_on_Minimum_and_Maximum_Spanning_Trees","220618158_On_the_Complexity_of_Some_Common_Geometric_Location_Problems","220492745_An_algorithm_for_multidimensional_data_clustering","220406753_Geometric_Clusterings","220148345_epsilon-Approximations_of_k-Label_Spaces","201976941_An_Efficient_Heuristic_Procedure_for_Partitioning_Graphs"]}