{"id":"234831779_GPU_Gems_Programming_Techniques_Tips_and_Tricks_for_Real-Time_Graphics","abstract":"GPU Gems has won a prestigious Front Line Award from Game Developer Magazine. The Front Line Awards recognize products that enable faster and more efficient game development, advancing the state of the art.FULL COLOR THROUGHOUT! “This collection of articles is particularly impressive for its depth and breadth. The book includes product-oriented case studies, previously unpublished state-of-the-art research, comprehensive tutorials, and extensive code samples and demos throughout.” -Eric Haines, Author of Real-Time Rendering “GPU Gems is a cool toolbox of advanced graphics techniques. Novice programmers and graphics gurus alike will find the Gems practical, intriguing and useful.” -Tim Sweeney, Lead Programmer of Unreal at Epic Games GPU Gems is a compilation of articles covering practical real-time graphics techniques arising from the research and practice of cutting-edge developers. It focuses on the programmable graphics pipeline available in today's graphics processing units (GPUs) and highlights quick and dirty tricks used by leading developers, as well as fundamental, performance-conscious techniques for creating advanced visual effects. The contributors and editors, collectively, bring countless years of experience to enlighten and propel the reader into the fascinating world of programmable real-time graphics.Major topics covered include: Natural effects Lighting and shadows Materials Image processing Performance and practicalities Beyond triangles Contributors are from the following universities and corporations: Alias Systems Brown University Croteam Cyan Worlds Hochschule Bremen Industrial Light & Magic iXBT.com Monolith Productions New York University Novarama NVIDIA Paralelo Computacao Piranha Bytes Pixar Animation Studios Siemens Medical Solutions Softimage Co. Softlab-NSK Sony Pictures Imageworks Stanford University UC Davis UNC-Chapel Hill Universitat Pompeu Fabra University of Utah University of Waterloo The accompanying CD-ROM includes complementary examples and sample programs.","authors":["Randima Fernando"],"meta":["January 2004"],"references":[]}