{"id":"234800767_A_Multi-National_Study_of_Reading_and_Tracing_Skills_in_Novice_Programmers","abstract":"A study by a ITiCSE 2001 working group (\"the McCracken Group\") established that many students do not know how to program at the conclusion of their introductory courses. A popular explanation for this incapacity is that the students lack the ability to problem-solve. That is, they lack the ability to take a problem description, decompose it into sub-problems and implement them, then assemble the pieces into a complete solution. An alternative explanation is that many students have a fragile grasp of both basic programming principles and the ability to systematically carry out routine programming tasks, such as tracing (or \"desk checking\") through code. This ITiCSE 2004 working group studied the alternative explanation, by testing students from seven countries, in two ways. First, students were tested on their ability to predict the outcome of executing a short piece of code. Second, students were tested on their ability, when given the desired function of short piece of near-complete code, to select the correct completion of the code from a small set of possibilities. Many students were weak at these tasks, especially the latter task, suggesting that such students have a fragile grasp of skills that are a prerequisite for problem-solving.","authors":["Raymond Lister","Elizabeth Adams","Sue C Fitzgerald","William Fone"],"meta":["January 2005ACM SIGCSE Bulletin 36(4):119-150","DOI:10.1145/1044550.1041673","SourceDBLP"],"references":["262257018_Processes_in_computer_program_comprehension","242642636_Availability_of_working_group_data","242528543_Conditions_of_Learning_in_Novice_Programmers","242476239_Developing_and_validating_multiple-choice_questions_2nd_edition","242404006_Processes_in_computer_program_comprehension","242359877_Fragile_knowledge_and_neglected_strategies_in_novice_programmers","242355269_Display-based_problem_solving_strategies_in_computer_programming","238727516_Empirical_studies_of_programmers","238674180_Analyzing_the_high-frequenzy_bugs_in_novice_programs","235678850_Empirical_Studies_of_Programming_Knowledge"]}