{"id":"234960985_The_Lung_Image_Database_Consortium_LIDC_and_Image_Database_Resource_Initiative_IDRI_A_completed_reference_database_of_lung_nodules_on_CT_scans","abstract":"Purpose: The development of computer-aided diagnostic (CAD) methods for lung nodule detection, classification, and quantitative assessment can be facilitated through a well-characterized repository of computed tomography (CT) scans. The Lung Image Database Consortium (LIDC) and Image Database Resource Initiative (IDRI) completed such a database, establishing a publicly available reference for the medical imaging research community. Initiated by the National Cancer Institute (NCI), further advanced by the Foundation for the National Institutes of Health (FNIH), and accompanied by the Food and Drug Administration (FDA) through active participation, this public-private partnership demonstrates the success of a consortium founded on a consensus-based process.\nMethods: Seven academic centers and eight medical imaging companies collaborated to identify, address, and resolve challenging organizational, technical, and clinical issues to provide a solid foundation for a robust database. The LIDC/IDRI Database contains 1018 cases, each of which includes images from a clinical thoracic CT scan and an associated XML file that records the results of a two-phase image annotation process performed by four experienced thoracic radiologists. In the initial blinded-read phase, each radiologist independently reviewed each CT scan and marked lesions belonging to one of three categories (“nodule ≥ 3 mm,” “nodule<3 mm,” and “non-nodule ≥ 3 mm”). In the subsequent unblinded-read phase, each radiologist independently reviewed their own marks along with the anonymized marks of the three other radiologists to render a final opinion. The goal of this process was to identify as completely as possible all lung nodules in each CT scan without requiring forced consensus.\nResults: The Database contains 7371 lesions marked “nodule” by at least one radiologist. 2669 of these lesions were marked “nodule ≥ 3 mm” by at least one radiologist, of which 928 (34.7%) received such marks from all four radiologists. These 2669 lesions include nodule outlines and subjective nodule characteristic ratings.\nConclusions: The LIDC/IDRI Database is expected to provide an essential medical imaging research resource to spur CAD development, validation, and dissemination in clinical practice.","authors":["Samuel G Armato III","Geoffrey Mclennan","Luc Bidaut","Michael F. McNitt-Gray"],"meta":["January 2011Medical Physics 38(2):915-931","DOI:10.1118/1.3528204","Project: The Cancer Imaging Archive (TCIA)"],"references":["220168681_Evaluation_Challenges_for_Bridging_Semantic_Gap_Shape_Disagreements_on_Pulmonary_Nodules_in_the_Lung_Image_Database_Consortium","49967854_A_Semantic_Image_Annotation_Model_to_Enable_Integrative_Translational_Research","274609862_Analysis_of_air_contrast_barium_enema_computed_tomographic_colonography_and_colonoscopy_Prospective_comparison","260859058_Design_of_a_common_database_for_research_in_mammogram_image_analysis","252730984_Variations_in_measured_performance_of_CAD_schemes_due_to_database_composition_and_scoring_protocol","246332823_National_Cancer_Institute_Initiative","238012382_Forming_a_reference_standard_from_LIDC_data_Impact_of_reader_agreement_on_reported_CAD_performance_-_art_no_65142A","232203667_A_Threshold_Selection_Method_From_Gray-Level_Histograms","228543259_The_Digital_Database_for_Screening_Mammography","215721564_A_Threshold_Selection_Method_From_Grey_Level_Histograms"]}