{"id":"235110140_Behind_the_Wizard's_Curtain_An_Integration_Environment_for_a_System_of_Systems","abstract":"A central premise to future military strategy is the formation of a system of systems (SOS) to attain dominant battlespace knowledge. By coalescing data from collection and processing systems, the resulting information can be integrated with systems of weaponry and warriors for a seamless sensor-to-shooter flow. This work is directed at recovering successful strategies and determining an environment that supports not only the integration of a SOS but its use for operational training. The integration process and its associated environment do not provide an architecture or offer an alternative to a good design. So why emphasize integration? One reason is that it can be used effectively as an adjunct to the requirements and design processes if accomplished early enough in the life cycle. I view the integration phase as the last certain opportunity to deliver an integrated product before its deployment for operations. Frequently it will be necessary to assemble such a capability despite inadequate previous processes and using systems developed and operated for other and different purposes. This book begins with a brief look at a SOS from the viewpoint of the U.S defense strategy. The intent is to provide an impression of SOS scope and the level of expectations for its operational support. Two case studies are the core of the book. Both programs, the DPS and TF XXI, produced an integrated product characterized as a SOS. Conclusions from this examination take the form of nine lessons learned about integration. These provide practical strategies. The lessons learned provide a foundation upon which to build.","authors":["Annette J. Krygiel"],"meta":["July 1999"],"references":["238206075_Composing_Components_How_Does_One_Detect_Potential_Architectural_Mismatches","200043078_Federated_Database_Systems_for_Managing_Distributed_Heterogeneous_and_Autonomous_Databases","264292731_Architecting_Principles_for_System_of_Systems","247337443_RCASSE_Rapid_Computer-Aided_Systems_of_Systems_Engineering","235209135_Airpower_and_the_Changing_Nature_of_Warfare","13174669_Balancing_Corporate_Power_A_New_Federalist_Paper","3247209_Architectural_design_of_a_common_operating_environment","3002764_On_Architecting_and_Intelligent_Transport_Systems"]}