{"id":"235103135_Service_Level_Agreements_in_Service-Oriented_Architecture_Environments","abstract":"Quality attribute requirements play an important role in service selection in a service-oriented architecture environment. It is easy to envision finding several services that fulfill the functional requirements but fail to meet important quality attribute measures. Service level agreements provide the architect with a specification of the verifiable quality characteristics that the service will provide. Such a specification allows the architect to select the service that best supports the system's quality attribute requirements. This report surveys the state of practice in service level agreement specification and offers guidelines on how to assure that services are provided with high availability, security, performance, and other required qualities. In addition, this report discusses the quality properties that have been expressed in service level agreements, and it considers the mechanisms used to assure service quality by contract and those used by service providers to achieve and monitor quality properties. Also, this report examines the support for expressing service quality requirements in existing service technologies and describes areas where more research is needed.","authors":["Philip Bianco","Grace A. Lewis","Paulo Merson"],"meta":["September 2008"],"references":["238681058_Web_services_agreement_specification_WS-Agreement","228774702_Negotiating_SLAs_with_Dynamic_Pricing_Policies","221508600_A_Categorization_Scheme_for_SLA_Metrics","220352928_Web_services_on_demand_WSLA-driven_automated_management","46160291_Using_SLA_for_Resource_Management_and_Scheduling_-_A_Survey","319805412_The_Web_Service_Modeling_Ontology","251829411_Cooperative_Service_Level_Agreement","247560605_SNAP_A_Protocol_for_Negotiation_of_Service_Level_Agreements_and_Coordinated_Resource_Management_in","36419046_RBSLA_Rule-based_Service_Level_Agreements","4326435_Initiator-Domain-Based_SLA_Negotiation_for_Inter-Domain_QoS-Service_Provisioning","4024003_Modeling_agent-based_framework_for_the_automation_of_sla_management_lifecycle","2604413_SNAP_A_Protocol_for_Negotiating_Service_Level_Agreements_and_Coordinating_Resource_Management_in_Distributed_Systems"]}