{"id":"235252088_Project_management_in_the_international_development_industry_The_project_coordinator's_perspective","abstract":"Purpose – The purpose of this paper is to analyze the empirical relationship between project management (PM) efforts (the extent to which national project coordinators (NPCs) – the project managers in the aid industry sector – make use of available PM tools), project success, and success criteria. Design/methodology/approach – Data were collected by way of questionnaires delivered by mail to 600 recipients in 26 different countries in Africa. Findings – The research results suggest that project success is insensitive to the level of project planning efforts but a significant correlation does exist between the use of monitoring and evaluation tools and project “profile,” a success criterion which is an early pointer of project long-term impact. Research limitations/implications – This paper contributes to PM research by exploring the relationship between the use of PM tools and project success in the non-traditional PM – although project oriented – aid industry sector. The paper highlights self-perceptions of NPCs and should not be interpreted in other ways. Practical implications – This paper highlights the importance of PM tools in practice. Further, it suggests that NPCs (who are in fact only involved in project execution) put a lot of effort into monitoring and evaluation. In so doing, they strive to ensure project performance and accountability throughout project lifecycle, and this contributes to project “profile.” Originality/value – This is the first study that offers insights into the relationship between PM efforts and project success in the aid industry sector. The paper calls for further research on PM practices in the aid industry sector where projects remain important instruments for aid delivery.","authors":["Lavagnon A. Ika","Amadou Diallo","Denis Thuillier"],"meta":["January 2010International Journal of Managing Projects in Business 3(1):61-93","DOI:10.1108/17538371011014035"],"references":["284497132_The_Impact_of_the_Project_Manager_on_Project_Management_Planning_Processes","348098158_Beyond_the_New_Public_Management_Changing_Ideas_and_Practices_in_Governance","326119348_An_Empirical_Investigation_of_International_Project_Management_Practices_The_Role_of_International_Experience","310842507_An_empirical_investigation_of_project_management_practice_In_reality_which_tools_do_practitioners_use","310238595_Tracing_the_African_Project_Failure_Syndrome_The_significance_of_'ubuntu'","304731401_Aid_Project_Proliferation_and_Absorptive_Capacity","291877600_Tools_of_the_Trade_A_Survey_of_Project_Management_Tools","285938073_Assessing_Aid_What_Works_What_Doesn't_and_Why","285739734_A_new_project_cycle_for_the_World_Bank","285309586_Managing_International_Development_Projects-Lessons_Learned"]}