{"id":"235264272_Talent_Management_Strategy_of_Employee_Engagement_in_Indian_ITES_Employees_Key_to_Retention","abstract":"Purpose – With talent management becoming an area of growing concern in the literature, the purpose of this paper is to investigate talent management and its relationship to levels of employee engagement using a mixed method research design. Design/methodology/approach – The first phase was a survey on a sample of 272 BPO/ITES employees, using Gallup q12 or Gallup Workplace Audit. Focus group interview discussion was based on reasons for attrition and the unique problems of employee engagement. In the second phase, one of the BPO organizations from the phase I sample was chosen at random and exit interview data was analyzed using factor analysis and content analysis. Findings – The results were in the expected direction and fulfilled the research aims of the current study. In the first phase low factor loadings indicated low engagement scores at the beginning of the career and at completion of 16 months with the organization. High factor loadings at intermediate stages of employment were indicative of high engagement levels, but the interview data reflected that this may mean high loyalty, but only for a limited time. In the second phase factor loadings indicated three distinct factors of organizational culture, career planning along with incentives and organizational support. The first two were indicative of high attrition. Research limitations/implications – A limitation of the research design was a sample size of 272 respondents. Some of the Cronbach's alpha scores of the subscales of Gallup q12 were low. The strength of the study lies in data triangulation, which was obtained through a mixed method approach, a survey and unstructured focus group interviews. There are theoretical implications for the construct of employee engagement. There seems to be a construct contamination from the fields of employee satisfaction, employee commitment and employee involvement, which is beyond the scope of this paper. Future studies in India may look into this area and construct an independent scale of employee engagement, focusing on the antecedent variables and testing them for theoretical underpinnings. Originality/value – The present study indicated that a good level of engagement may lead to high retention, but only for a limited time in the ITES sector. The need for a more rigorous employee engagement construct is indicated by the study. Practical implications for retention in the BPO/ITES sector are referred to.","authors":["Jyotsna Bhatnagar"],"meta":["October 2007Employee Relations 29(6):640-663","DOI:10.1108/01425450710826122"],"references":["292714014_The_Resource-Based_Theory_of_Competitive_Advantage_Implications_for_Strategy_Formulation","285344430_What_engages_employees_the_most_or_the_ten_C's_of_employee_engagement","347909152_Bottom-Line_Call_Center_Management","325004367_Psychological_Conditions_of_Personal_Engagement_and_Disengagement_at_Work","313642908_Talent_management_Driver_for_organizational_success","313202694_Theoretical_perspectives_for_strategic_human_resource_management","312984529_Talent_management_Trends_that_will_shape_the_future","307749145_A_Study_on_Employee_Engagement","291151571_Offshoring_without_guilt","285875586_Firm_Resources_and_Sustained_Competitive_Advantage","284689712_The_War_for_Talent","277673774_Psychological_Contracts_in_the_Workplace_Understanding_the_Ties_That_Motivate","276935590_A_Resource_Based_Theory_of_Competitive_Advantage","280178174_What_it_means_to_work_here","275697337_Psychological_Conditions_of_Personal_Engagement_and_Disengagement_at_Work"]}