{"id":"235264119_Organizational_sociotechnical_diagnosis_of_managerial_retention_in_an_IT_organization_SAP-LAP_framework","abstract":"Purpose\n– Turnover of managerial employees at junior and middle levels has been widely recognized as a critical organizational concern. The problem happens to be more intensified for organizations belonging to the service sector as the services provided to client/customer groups get directly affected. A number of studies have shown that compensation factor alone does not explain the retention of managerial employees in the organization. This paper aims to focus on designing and balancing the organizational social and technical subsystems elements in order to moderate the turnover of junior and middle level managers in the company.\n\nDesign/methodology/approach\n– A number of selective junior and middle level managers were interviewed in‐depth and content analysis was made for categorization of level‐wise qualitative responses. The situation actor process‐learning action performance (SAP‐LAP) framework has been adopted as the diagnostic instrument of organizational analysis.\n\nFindings\n– The findings from the paper shows that the organizational sociotechnical factors have an impact on managerial retention and the suggestive actions from the paper attempt to find solutions to the problem of managerial turnover faced by the company.\n\nOriginality/value\n– The SAP‐LAP framework as an instrument to the diagnosis of organizational sociotechnical system provides useful inputs to the management for future course of actions. Maintaining the balance between the social and technical subsystem factors is a critical prerequisite to managerial retention.","authors":["Koustab Ghosh","Sangeeta Sahney"],"meta":["March 2010International Journal of Organizational Analysis 18(1):151-166","DOI:10.1108/19348831011033258"],"references":["324997681_PEOPLE_AND_ORGANIZATIONAL_CULTURE_A_PROFILE_COMPARISON_APPROACH_TO_ASSESSING_PERSON-ORGANIZATION_FIT","325670678_Reciprocation_of_perceived_organizational_support","285185174_Case_study_research","283271036_E-Value_to_stakeholders_of_global_institute_of_flexible_systems_management","275677707_The_Research_Interview_Uses_and_Approaches","271796164_Advanced_Manufacturing_Systems_and_Organizational_Choice_Sociotechnical_System_Approach","270540595_Burnout_and_Intention_to_Leave_Among_Mental_Health-Care_Professionals_A_Social_Psychological_Approach","270390692_Technology_Organization_and_Administration","270375517_Organizational_Analysis_A_Sociological_View","270135792_Voluntarily_leaving_an_organization_an_empirical_investigation_of_Steers_and_Mowday's_Model_of_Turnover"]}