{"id":"235321357_Characteristics_of_retailing_internships_contributing_to_students'_reported_satisfaction_with_career_development","abstract":"Purpose – The purpose of this paper is to explore student perceptions of job characteristics of their internships – and to explore the relationship between these job characteristics and overall satisfaction with their retail merchandising internship experiences in terms of contribution toward career development. Design/methodology/approach – Three internship site categories were identified: stores, corporate settings, and other types. Students completed surveys after their internship experiences. Findings – There were significant differences observed between site types and overall satisfaction with internships. Desire to recommend to others, variety of tasks, repetition of duties, similarity of activities, pay, opportunities for networking with others, extent of dealing with other people, and extent of receiving information from supervisors were different among sites. Information and feedback from supervisors, variety of activities, closure with tasks, clear results of tasks, autonomy, and networking opportunities were related to internship satisfaction. Research limitations/implications – The study is limited to US companies and focuses on retail merchandising internships, so results may not be generalizable in other settings. Practical implications – Retailers may use this information to enhance the structure and tasks associated with their internships. Students and professors may use this information as academic internships are sought. Originality/value – This paper provides a comprehensive look at job characteristics as they related to satisfaction in an internship environment and offers insight to companies who offer internships as well as students who seek them.","authors":["V. Ann Paulins"],"meta":["February 2008Journal of Fashion Marketing and Management 12(1):105-118","DOI:10.1108/13612020810857970"],"references":["258153192_Undergraduate_Business_Internships_and_Career_Success_Are_They_Related","329256256_The_Management_of_Customer-Contact_Service_Employees_An_Empirical_Investigation","328705487_Organizational_Commitment_and_Marketing","325002581_The_Measurement_of_Job_Characteristics","313017285_One_more_time_How_do_you_motivate_employees","275933474_Industrial_Jobs_and_the_Worker","271802271_The_Management_of_Customer-Contact_Service_Employees_An_Empirical_Investigation","271802260_Organizational_Commitment_and_Marketing","254085458_Clothing_and_Textiles_Curriculum_Content_Needed_for_Success_in_Fashion_Marketing_Careers","246355628_Handbook_of_Marketing_Scales_Multi-Item_Measures_for_Marketing_and_Consumer_Behaviour_Research"]}