{"id":"235375794_Towards_practical_high-capacity_low-maintenance_information_storage_in_synthesized_DNA","abstract":"Digital production, transmission and storage have revolutionized how we access and use information but have also made archiving an increasingly complex task that requires active, continuing maintenance of digital media. This challenge has focused some interest on DNA as an attractive target for information storage because of its capacity for high-density information encoding, longevity under easily achieved conditions and proven track record as an information bearer. Previous DNA-based information storage approaches have encoded only trivial amounts of information or were not amenable to scaling-up, and used no robust error-correction and lacked examination of their cost-efficiency for large-scale information archival. Here we describe a scalable method that can reliably store more information than has been handled before. We encoded computer files totalling 739 kilobytes of hard-disk storage and with an estimated Shannon information of 5.2 × 10(6) bits into a DNA code, synthesized this DNA, sequenced it and reconstructed the original files with 100% accuracy. Theoretical analysis indicates that our DNA-based storage scheme could be scaled far beyond current global information volumes and offers a realistic technology for large-scale, long-term and infrequently accessed digital archiving. In fact, current trends in technological advances are reducing DNA synthesis costs at a pace that should make our scheme cost-effective for sub-50-year archiving within a decade.","authors":["Nick Goldman","Paul Bertone","Siyuan Chen","Christophe Dessimoz"],"meta":["January 2013Nature 494(7435)","DOI:10.1038/nature11875","SourcePubMed"],"references":["270612555_Ancient_biomolecules_from_deep_ice_cores_reveal_a_forested_southern_Greenland","270051454_A_Draft_Sequence_of_the_Neandertal_Genome","256896215_Deoxynucleoside_phosphoramidites-A_new_class_of_key_intermediates_for_deoxypolynucleotide_synthesis","285473642_Extracting_value_from_chaos","268244004_Algorithms_and_Theory_of_Computation_Handbook","257259360_Molecular_Structure_of_Nucleic_Acids","238336608_The_Clock_of_the_Long_Now","238322980_Preservation_of_DNA","234816462_DNA_computing_a_research_snapshot","233967765_Algorithms_and_Theory_of_Computation_Handbook"]}