{"id":"235362849_A_Diffusion_of_Innovations","abstract":"Getting an innovation adopted is difficult; a common problem is increasing the rate of its diffusion. Diffusion is the communication of an innovation through certain channels over time among members of a social system. It is a communication whose messages are concerned with new ideas; it is a process where participants create and share information to achieve a mutual understanding. Initial chapters of the book discuss the history of diffusion research, some major criticisms of diffusion research, and the meta-research procedures used in the book. This text is the third edition of this well-respected work. The first edition was published in 1962, and the fifth edition in 2003. The book's theoretical framework relies on the concepts of information and uncertainty. Uncertainty is the degree to which alternatives are perceived with respect to an event and the relative probabilities of these alternatives; uncertainty implies a lack of predictability and motivates an individual to seek information. A technological innovation embodies information, thus reducing uncertainty. Information affects uncertainty in a situation where a choice exists among alternatives; information about a technological innovation can be software information or innovation-evaluation information. An innovation is an idea, practice, or object that is perceived as new by an individual or an other unit of adoption; innovation presents an individual or organization with a new alternative(s) or new means of solving problems. Whether new alternatives are superior is not precisely known by problem solvers. Thus people seek new information. Information about new ideas is exchanged through a process of convergence involving interpersonal networks. Thus, diffusion of innovations is a social process that communicates perceived information about a new idea; it produces an alteration in the structure and function of a social system, producing social consequences. Diffusion has four elements: (1) an innovation that is perceived as new, (2) communication channels, (3) time, and (4) a social system (members jointly solving to accomplish a common goal). Diffusion systems can be centralized or decentralized. The innovation-development process has five steps passing from recognition of a need, through R&D, commercialization, diffusions and adoption, to consequences. Time enters the diffusion process in three ways: (1) innovation-decision process, (2) innovativeness, and (3) rate of the innovation's adoption. The innovation-decision process is an information-seeking and information-processing activity that motivates an individual to reduce uncertainty about the (dis)advantages of the innovation. There are five steps in the process: (1) knowledge for an adoption/rejection/implementation decision; (2) persuasion to form an attitude, (3) decision, (4) implementation, and (5) confirmation (reinforcement or rejection). Innovations can also be re-invented (changed or modified) by the user. The innovation-decision period is the time required to pass through the innovation-decision process. Rates of adoption of an innovation depend on (and can be predicted by) how its characteristics are perceived in terms of relative advantage, compatibility, complexity, trialability, and observability. The diffusion effect is the increasing, cumulative pressure from interpersonal networks to adopt (or reject) an innovation. Overadoption is an innovation's adoption when experts suggest its rejection. Diffusion networks convey innovation-evaluation information to decrease uncertainty about an idea's use. The heart of the diffusion process is the modeling and imitation by potential adopters of their network partners who have adopted already. Change agents influence innovation decisions in a direction deemed desirable. Opinion leadership is the degree individuals influence others' attitudes","authors":["Everett M. Rogers"],"meta":["January 1995","DOI:10.1007/978-94-011-1771-5_2","Edition: FourthPublisher: The Free PressISBN: 978-94-010-4778-4"],"references":["240049923_Innovation_in_the_States_A_Diffusion_Study","270162336_In_The_Structure_of_Scientific_Revolutions","250764990_Progress_in_communication_sciences","248925238_The_diffusion_of_innovation_Why_does_it_endure","247822668_The_critical_mass_in_the_di_usion_of_interactive_technologies_in_organizations","243475968_Medical_Innovation_A_Diffusion_Study","241654950_Diffusion_of_Knowledge_of_the_Major_News_Story","240049875_Innovation_Diffusion_as_a_Spatial_Process","239666521_Innovation_Diffusion_A_New_Perspective","238750487_Conceptual_Issues_in_Study_of_Innovation","235987113_Hybrid_Corn_An_Exploration_In_the_Economics_of_Technological_Change","235361635_The_Diffusion_of_Hybrid_Seed_Corn_in_Two_Iowa_Communities","233822705_The_Laws_of_Imitation","233820393_Social_Foundations_of_Thought_Action_A_Social_Cognitive_Theory","222473392_New_telecommunications_services","220434843_An_Empirically_Grounded_Model_of_the_Adoption_of_Intellectual_Technologies","216634633_Spatial_Diffusion_An_Historical_Geography_of_Epidemics_in_an_Island_Community","51992864_The_Strength_of_Weak_Ties","24098395_A_Propositional_Inventory_of_New_Diffusion_Research"]}