{"id":"235405232_A_Routing_Protocol_Based_on_Energy_and_Link_Quality_for_Internet_of_Things_Applications","abstract":"The Internet of Things (IoT) is attracting considerable attention from the universities, industries, citizens and governments for applications, such as healthcare, environmental monitoring and smart buildings. IoT enables network connectivity between smart devices at all times, everywhere, and about everything. In this context, Wireless Sensor Networks (WSNs) play an important role in increasing the ubiquity of networks with smart devices that are low-cost and easy to deploy. However, sensor nodes are restricted in terms of energy, processing and memory. Additionally, low-power radios are very sensitive to noise, interference and multipath distortions. In this context, this article proposes a routing protocol based on Routing by Energy and Link quality (REL) for IoT applications. To increase reliability and energy-efficiency, REL selects routes on the basis of a proposed end-to-end link quality estimator mechanism, residual energy and hop count. Furthermore, REL proposes an event-driven mechanism to provide load balancing and avoid the premature energy depletion of nodes/networks. Performance evaluations were carried out using simulation and testbed experiments to show the impact and benefits of REL in small and large-scale networks. The results show that REL increases the network lifetime and services availability, as well as the quality of service of IoT applications. It also provides an even distribution of scarce network resources and reduces the packet loss rate, compared with the performance of well-known protocols.","authors":["Kássio Machado","Denis Rosário","Eduardo Cerqueira","Antonio Loureiro"],"meta":["February 2013Sensors 13(2):1942-64","DOI:10.3390/s130201942","SourcePubMed"],"references":["254004293_Design_of_a_routing_protocol_using_remaining_energy_and_link_quality_indicator_REL","241624555_SmartSantander_The_meeting_point_between_Future_Internet_research_and_experimentation_and_the_smart_cities","310670788_Ad-hoc_on-demand_distance_vector_AODV_routing","291650812_Energy-efficient_routing_protocol_for_wireless_sensor_networks","284602927_Ad_hoc_on-demand_distance_vector_AODV_routing","264112573_An_Energy_Efficient_Variable_Area_Routing_protocol_in_Wireless_Sensor_networks","248591447_Ad_hoc_on_demand_distance_vector_AODV_routing_for_IP_version_6","239065465_Omnet_discrete_event_simulation_system_2","236183261_Part_154_wireless_medium_access_control_MAC_and_physical_layer_PHY_specifications_for_low-rate_wireless_personal_area_networks_LR-WPANs_ANSIIEEE_Std_802154","234830379_BonnMotion_-_A_mobility_scenario_generation_and_analysis_tool"]}