{"id":"235427894_UniProt_the_Universal_Protein_Knowledgebase","abstract":"The UniProt knowledgebase is a large resource of protein sequences and associated detailed annotation. The database contains over 60 million sequences, of which over half a million sequences have been curated by experts who critically review experimental and predicted data for each protein. The remainder are automatically annotated based on rule systems that rely on the expert curated knowledge. Since our last update in 2014, we have more than doubled the number of reference proteomes to 5631, giving a greater coverage of taxonomic diversity. We implemented a pipeline to remove redundant highly similar proteomes that were causing excessive redundancy in UniProt. The initial run of this pipeline reduced the number of sequences in UniProt by 47 million. For our users interested in the accessory proteomes, we have made available sets of pan proteome sequences that cover the diversity of sequences for each species that is found in its strains and sub-strains. To help interpretation of genomic variants, we provide tracks of detailed protein information for the major genome browsers. We provide a SPARQL endpoint that allows complex queries of the more than 22 billion triples of data in UniProt (http://sparql.uniprot.org/). UniProt resources can be accessed via the website at http://www.uniprot.org/.","authors":["Rolf Apweiler","Amos Bairoch","Cathy H Wu","W. C. Barker"],"meta":["January 2004Nucleic Acids Research 32(D1):D115-9","DOI:10.1093/nar/gkw1099"],"references":["30932350_ProDom_Automated_clustering_of_homologous_domains","24459761_TIGRFAMs_A_protein_family_resource_for_the_functional_identification_of_proteins","21463208_Yeast_Structural_Gene_APN1_for_the_Major_Apurinic_Endonuclease_Homology_to_Escherichia_coli_Endonuclease_IV","255944360_The_FlyBase_database_of_the_Drosophila_genome_projects_andcommunity_literature","239743770_2003_brings_increased_coverage_and_new_features","239062382_A_novel_method_for_automatic_and_reliable_functional_annotation","221493343_A_novel_method_for_automatic_and_reliable_functional_annotation_of_proteins","51317747_Schizosaccharomyces_pombe_Apn1_encodes_a_homologue_of_the_Escherichia_coli_endonuclease_IV_family_of_DNA_repair_proteins","31045543_The_FlyBase_database_of_the_Drosophila_Genome_Projects_and_community_literature_The_FlyBase_Consortium_Nucleic_Acids_Res_1999_27_85_88_148103_9847148_101093nar27185","24459683_The_EMBL_Nucleotide_sequence_database"]}