{"id":"235442331_Extracellular_Life_Cycle_of_ComS_the_Competence-Stimulating_Peptide_of_Streptococcus_thermophilus","abstract":"In streptococci, ComX is the alternative sigma factor controlling the transcription of the genes encoding the genetic transformation machinery. In Streptococcus thermophilus, comX transcription is controlled by a complex consisting of a transcriptional regulator of the Rgg family, ComR and a signaling peptide, ComS which controls ComR activity. Following its initial production, ComS is processed, secreted and imported back into the cell by the Ami oligopeptide transporter. We characterized these steps and the partners interacting with ComS during its extracellular circuit in more detail. We identified the mature form of ComS and demonstrated the involvement of the membrane protease Eep in ComS processing. We found that ComS was secreted, but probably not released into the extracellular medium. Natural competence was first discovered in a chemically defined medium without peptides. We show here that the presence of a high concentration of nutritional peptides in the medium prevents the triggering of competence. In milk, the ecological niche of S. thermophilus, competence was found to be functional, suggesting that the concentration of nutritional peptides was too low to interfere with ComR activation. The kinetics of expression of the comS, comR, and comX genes and of a late competence gene, dprA, in cultures inoculated at different initial densities, revealed that the activation mechanism of ComR by ComS is more a timing device rather than a quorum-sensing mechanism sensu stricto. We conclude that the ComS extracellular circuit facilitates tight control over the triggering of competence in S. thermophilus.","authors":["Rozenn Gardan","Colette Besset","Christophe Gitton","Alain Guillot"],"meta":["February 2013Journal of Bacteriology 195(8)","DOI:10.1128/JB.02196-12","SourcePubMed"],"references":["228064038_The_Cryptic_Competence_Pathway_in_Streptococcus_pyogenes_Is_Controlled_by_a_Peptide_Pheromone","225049340_Extracellular_Identification_of_a_Processed_Type_II_ComRComS_Pheromone_of_Streptococcus_mutans","225049339_Desai_K_Mashburn-Warren_L_Federle_MJ_Morrison_DA_Development_of_competence_for_genetic_transformation_of_Streptococcus_mutans_in_a_chemically_defined_medium_J_Bacteriol_194_3774-3780","221789125_Adaptor_Protein_MecA_Is_a_Negative_Regulator_of_the_Expression_of_Late_Competence_Genes_in_Streptococcus_thermophilus","51559682_Two_Group_A_Streptococcal_Peptide_Pheromones_Act_through_Opposing_Rgg_Regulators_to_Control_Biofilm_Development","234156480_Mechanism_of_competence_activation_by_the_ComRS_signaling_system_in_streptococci","230587463_Microfluidic_study_of_competence_regulation_in_Streptococcus_mutans_Environmental_inputs_modulate_bimodal_and_unimodal_expression_of_comX","200037138_Molecular_Cloning_A_Laboratory_Manual_3-Volume_Set","50849497_Rgg_proteins_associated_with_internalized_small_hydrophobic_peptides_A_new_quorum-sensing_mechanism_in_streptococci","47532472_Mashburn-Warren_L_Morrison_DA_Federle_MJ_A_novel_double-tryptophan_peptide_pheromone_controls_competence_in_Streptococcus_Spp_via_an_Rgg_regulator_Mol_Microbiol_78_589-606"]}