{"id":"235619202_Neurostimulation_for_Parkinson's_Disease_with_Early_Motor_Complications","abstract":"Subthalamic stimulation reduces motor disability and improves quality of life in patients with advanced Parkinson's disease who have severe levodopa-induced motor complications. We hypothesized that neurostimulation would be beneficial at an earlier stage of Parkinson's disease.\nIn this 2-year trial, we randomly assigned 251 patients with Parkinson's disease and early motor complications (mean age, 52 years; mean duration of disease, 7.5 years) to undergo neurostimulation plus medical therapy or medical therapy alone. The primary end point was quality of life, as assessed with the use of the Parkinson's Disease Questionnaire (PDQ-39) summary index (with scores ranging from 0 to 100 and higher scores indicating worse function). Major secondary outcomes included parkinsonian motor disability, activities of daily living, levodopa-induced motor complications (as assessed with the use of the Unified Parkinson's Disease Rating Scale, parts III, II, and IV, respectively), and time with good mobility and no dyskinesia.\nFor the primary outcome of quality of life, the mean score for the neurostimulation group improved by 7.8 points, and that for the medical-therapy group worsened by 0.2 points (between-group difference in mean change from baseline to 2 years, 8.0 points; P=0.002). Neurostimulation was superior to medical therapy with respect to motor disability (P<0.001), activities of daily living (P<0.001), levodopa-induced motor complications (P<0.001), and time with good mobility and no dyskinesia (P=0.01). Serious adverse events occurred in 54.8% of the patients in the neurostimulation group and in 44.1% of those in the medical-therapy group. Serious adverse events related to surgical implantation or the neurostimulation device occurred in 17.7% of patients. An expert panel confirmed that medical therapy was consistent with practice guidelines for 96.8% of the patients in the neurostimulation group and for 94.5% of those in the medical-therapy group.\nSubthalamic stimulation was superior to medical therapy in patients with Parkinson's disease and early motor complications. (Funded by the German Ministry of Research and others; EARLYSTIM ClinicalTrials.gov number, NCT00354133.).","authors":["Michael Schüpbach","Joern Rau","Karina Knudsen","Jens Volkmann"],"meta":["February 2013New England Journal of Medicine 368(7):610-22","DOI:10.1056/NEJMoa1205158","SourcePubMed"],"references":["320634072_Electrical_Stimulation_of_the_Subthalamic_Nucleus_in_Advanced_Parkinson's_Disease","320630766_Pallidal_versus_Subthalamic_Deep-Brain_Stimulation_for_Parkinson's_Disease","227762703_The_Movement_Disorder_Society_Evidence-Based_Medicine_Review_Update_Treatments_for_the_Motor_Symptoms_of_Parkinson's_Disease","320614448_Five-Year_Follow-up_of_Bilateral_Stimulation_of_the_Subthalamic_Nucleus_in_Advanced_Parkinson's_Disease","303673703_Members_of_the_UPDRS_Development_Committee_Unified_Parkinson's_Disease_Rating_Scale_in_Recent_developments_in_Parkinson's_disease","272765725_An_Inventory_for_Measuring_Depression","270973843_A_Randomized_Trial_of_Deep-Brain_Stimulation_for_Parkinson's_Disease","246019505_Determining_minimally_important_differences_for_the_PDQ39_Parkinson's_disease_questionnaire","240114112_Mental_Status_Examination_for_organic_mental_syndrome_in_the_elderly_patients","230581032_Stimulation_of_the_subthalamic_nucleus_at_an_earlier_disease_stage_of_Parkinson's_disease_Concept_and_standards_of_the_EARLYSTIM-study"]}