{"id":"235621681_Embodied_Cognition_is_Not_What_You_Think_It_Is","abstract":"The most exciting hypothesis in cognitive science right now is the theory that cognition is embodied. Like all good ideas in cognitive science, however, embodiment immediately came to mean six different things. The most common definitions involve the straight-forward claim that \"states of the body modify states of the mind.\" However, the implications of embodiment are actually much more radical than this. If cognition can span the brain, body, and the environment, then the \"states of mind\" of disembodied cognitive science won't exist to be modified. Cognition will instead be an extended system assembled from a broad array of resources. Taking embodiment seriously therefore requires both new methods and theory. Here we outline four key steps that research programs should follow in order to fully engage with the implications of embodiment. The first step is to conduct a task analysis, which characterizes from a first person perspective the specific task that a perceiving-acting cognitive agent is faced with. The second step is to identify the task-relevant resources the agent has access to in order to solve the task. These resources can span brain, body, and environment. The third step is to identify how the agent can assemble these resources into a system capable of solving the problem at hand. The last step is to test the agent's performance to confirm that agent is actually using the solution identified in step 3. We explore these steps in more detail with reference to two useful examples (the outfielder problem and the A-not-B error), and introduce how to apply this analysis to the thorny question of language use. Embodied cognition is more than we think it is, and we have the tools we need to realize its full potential.","authors":["Andrew D Wilson","Sabrina Golonka"],"meta":["February 2013Frontiers in Psychology 4(58):58","DOI:10.3389/fpsyg.2013.00058","SourcePubMed"],"references":["329650362_Radical_Embodied_Cognitive_Science","324352933_The_Ecological_Approach_to_Visual_Perception","319770401_Vision_A_Computational_Investigation_into_the_Human_Representation_and_Processing_of_Visual_Information","290922073_LOT_2_The_Language_of_Thought_Revisited","279233528_The_Logic_of_Perception","279233495_The_Effect_of_Implied_Orientation_Derived_from_Verbal_Context_on_Picture_Recognition","276034303_What_Might_Cognition_Be_if_Not_Computation","275083725_LOT_2_The_Language_of_Thought_Revisited","273056982_The_Logic_of_Perception","270326882_The_Senses_Considered_as_Perceptual_Systems"]}