{"id":"235681434_A_mathematical_model_of_the_London_riots_and_their_policing","abstract":"In August 2011, several areas of London experienced episodes of large-scale disorder, comprising looting, rioting and violence. Much subsequent discourse has questioned the adequacy of the police response, in terms of the resources available and strategies used. In this article, we present a mathematical model of the spatial development of the disorder, which can be used to examine the effect of varying policing arrangements. The model is capable of simulating the general emergent patterns of the events and focusses on three fundamental aspects: the apparently-contagious nature of participation; the distances travelled to riot locations; and the deterrent effect of policing. We demonstrate that the spatial configuration of London places some areas at naturally higher risk than others, highlighting the importance of spatial considerations when planning for such events. We also investigate the consequences of varying police numbers and reaction time, which has the potential to guide policy in this area.","authors":["Toby P Davies","Hannah Fry","Alan G Wilson","Steven R Bishop"],"meta":["February 2013Scientific Reports 3(1303):1303","DOI:10.1038/srep01303","SourcePubMed"],"references":["258174974_The_Geographies_of_Policing","255729209_Understanding_Riots","247932817_The_Myth_of_the_Madding_Crowd","313746095_The_role_of_the_airline_transportation_network_in_the_prediction_and_predictability_of_global_epidemics","274650532_Emergent_Actors_in_World_Politics_How_States_and_Nations_Develop_and_Dissolve","274220362_The_Myth_of_the_Madding_Crowdbook_review","271685028_Individual_Participation_in_Collective_Racial_Violence_A_Rational_Choice_Synthesis","264234736_Target_choice_during_extreme_events_A_discrete_spatial_choice_model_of_the_2011_London_Riots","254227461_Modeling_Geographic_Behavior_in_Riotous_Crowds","247966107_The_Reasoning_Criminal_Rational_Choice_Perspectives_on_Offending"]}