{"id":"235663691_Towards_an_Adaptable_Middleware_for_Parallel_Computing_in_Heterogeneous_Environments","abstract":"The adoption of the multi-core processor design has spawned a wide variety of CPU configurations, namely in the number and nature of the hosted cores. The cluster organization of such CPUs is particularly sensitive to this issue, since applications must be aware of such heterogeneity in order to fully exploit the potential of the underlying hardware. The existing frameworks for cluster computing do not fully address this issue, relying on the programmer to handle many of the concerns associated to the aforesaid heterogeneity, burdening him with non-functional details. To this extent, we propose an adaptable middleware for Java High-Performance Computing in heterogeneous clusters. Adaptability is obtained by trusting the runtime system with the management of thread and data placement, and by equipping it with a layer able to adjust its implementation to the particularities of the underlying software and hardware stacks. In this paper we address both the middleware's programming model and runtime system, as well as some initial performance results that attest the validity of the approach.","authors":["João Saramago","Diogo Mourão","Hervé Paulino"],"meta":["September 2012","DOI:10.1109/ClusterW.2012.36","Conference: 2012 IEEE International Conference on Cluster Computing Workshops, CLUSTER Workshops 2012"],"references":["279062908_X10","261341516_Rootbeer_Seamlessly_using_GPUs_from_Java","239761203_Habanero-Java_The_new_adventures_of_Old_X10","229060527_Single_Operation_Multiple_Data_-_Data_Parallelism_at_Subroutine_Level","224694506_Evaluating_MapReduce_for_Multi-core_and_Multiprocessor_Systems","281316129_Fortress_Sun_HPCS_language","258139318_Parallel_Programmability_and_the_Chapel_Language","254006946_GPU_programming_in_a_high_level_language_compiling_X10_to_CUDA","242787762_OpenMP_Application_Program_Interface","237252655_an_Object_Behavioral_Pattern_for_Concurrent_Programming"]}