{"id":"235604168_Central_Pattern_Generator_for_Locomotion_Anatomical_Physiological_and_Pathophysiological_Considerations","abstract":"This article provides a perspective on major innovations over the past century in research on the spinal cord and, specifically, on specialized spinal circuits involved in the control of rhythmic locomotor pattern generation and modulation. Pioneers such as Charles Sherrington and Thomas Graham Brown have conducted experiments in the early twentieth century that changed our views of the neural control of locomotion. Their seminal work supported subsequently by several decades of evidence has led to the conclusion that walking, flying, and swimming are largely controlled by a network of spinal neurons generally referred to as the central pattern generator (CPG) for locomotion. It has been subsequently demonstrated across all vertebrate species examined, from lampreys to humans, that this CPG is capable, under some conditions, to self-produce, even in absence of descending or peripheral inputs, basic rhythmic, and coordinated locomotor movements. Recent evidence suggests, in turn, that plasticity changes of some CPG elements may contribute to the development of specific pathophysiological conditions associated with impaired locomotion or spontaneous locomotor-like movements. This article constitutes a comprehensive review summarizing key findings on the CPG as well as on its potential role in Restless Leg Syndrome, Periodic Leg Movement, and Alternating Leg Muscle Activation. Special attention will be paid to the role of the CPG in a recently identified, and uniquely different neurological disorder, called the Uner Tan Syndrome.","authors":["Pierre A Guertin"],"meta":["January 2012Frontiers in Neurology 3:183","DOI:10.3389/fneur.2012.00183","SourcePubMed"],"references":["313469354_Key_central_pattern_generators_of_the_spinal_cord","312946480_Crustacean_motor_pattern_generator_networks","285183824_L'autonomie_et_la_centralisation_dans_le_systme_nerveux_des_animaux","284299828_Control_of_locomotion_A_neurophysiological_analysis_of_the_cat_locomotor_system","281381229_Spasticity","279366836_Motor_Control","278707142_The_Spinal_Cord_Functional_Organization_Diseases_and_Dysfunctions","258723032_Response_to_Comment_on_Restoring_Voluntary_Control_of_Locomotion_After_Paralyzing_Spinal_Cord_Injury","257238975_Restless_Legs_Syndrome_and_Periodic_Leg_Movements_of_Sleep","253494346_The_Intrinsic_Factors_in_the_Act_of_Progression_in_the_Mammal"]}