{"id":"235638894_Looking_at_Mean-Payoff_and_Total-Payoff_through_Windows","abstract":"We consider two-player games played on weighted directed graphs with\nmean-payoff and total-payoff objectives, two classical quantitative objectives.\nWhile for single-dimensional games the complexity and memory bounds for both\nobjectives coincide, we show that in contrast to multi-dimensional mean-payoff\ngames that are known to be coNP-complete, multi-dimensional total-payoff games\nare undecidable. We introduce conservative approximations of these objectives,\nwhere the payoff is considered over a local finite window sliding along a play,\ninstead of the whole play. For single dimension, we show that (i) if the window\nsize is polynomial, deciding the winner takes polynomial time, and (ii) the\nexistence of a bounded window can be decided in NP $\\cap$ coNP, and is at least\nas hard as solving mean-payoff games. For multiple dimensions, we show that (i)\nthe problem with fixed window size is EXPTIME-complete, and (ii) there is no\nprimitive-recursive algorithm to decide the existence of a bounded window.","authors":["Krishnendu Chatterjee","Laurent Doyen","Mickael Randour","Jean-Francois Raskin"],"meta":["October 2013","DOI:10.1007/978-3-319-02444-8_10","SourcearXiv","Conference: ATVA 2013 - 11th International Symposium on Automated Technology for Verification and AnalysisVolume: LNCS 8172"],"references":["272133839_Strategy_Synthesis_for_Multi-Dimensional_Quantitative_Objectives","262256395_Polynomial-Time_Algorithms_for_Energy_Games_with_Special_Weight_Structures","256926227_Meet_Your_Expectations_With_Guarantees_Beyond_Worst-Case_Synthesis_in_Quantitative_Games","312995330_Finitary_Winning_in_omega-Regular_Games","268164050_Efficient_and_Dynamic_Algorithms_for_Alternating_Buchi_Games_and_Maximal_End-Component_Decomposition","266066629_Competitive_Markov_Decision_Processes","265996860_Mean_Cost_Cyclical_Games","262276852_Finitary_winning_in_o-regular_games","249963949_Approximating_the_minimum_cycle_mean","242597597_A_characterization_of_the_minimum_cycle_mean_in_a_digraph"]}