{"id":"235791711_Fixed-Point_Representation_Fractional_Math_Revison_12","abstract":"In a majority of the commercially available processors on the market today there is no hardware support for floating-point arithmetic due to the cost the extra silicon imposes on a processor’s total cost. In fact a large portion of processors do not even have hardware support for integer multiplication. This necessitates software emulation for floating-point arithmetic and possibly even software emulation for computing integer multiplications. This software overhead can significantly limit the rate at which algorithms can be executed. By implementing algorithms using fixed-point (integer) mathematics, a significant improvement in execution speed can be observed because of inherent integer math hardware support in a large number of processors, as well as the reduced software complexity for emulated integer multiply and divide. This speed improvement does come at the cost of reduced range and accuracy of the algorithms variables. The purpose of this paper is to investigate the issues relating to algorithm implementation utilizing fixed-point rather than floating-point mathematics. The Q[QI].[QF] format fixed-point number format analyzed in this paper is broken down in subsequent sections into integer and fractional content for the purpose of study and understanding. The separate sections on integer and fractional content are subsequently combined to provide an overall understanding of the nature of Q[QI].[QF] format fixed-point numbers","authors":["Erick L. Oberstar"],"meta":["August 2007","DOI:10.13140/RG.2.1.3602.8242","Project: Fixed Point Mathematics"],"references":["232638356_A_floating-point_to_integer_C_converter_with_shift_reduction_for_fixed-point_digital_signal_processors","224255212_Fixed-point_C_compiler_for_TMS320C50_digital_signal_processor","3324633_A_Floating-Point_to_Fixed-Point_Assembly_Program_Translator_for_the_TMS_320C25","2801513_A_Floating-point_to_Fixed-point_C_Converter_for_Fixed-point_Digital_Signal_Processors","2310198_Floating_Point_to_Fixed_Point_Conversion_of_C_Code"]}