{"id":"235709862_The_irace_Package_Iterated_Racing_for_Automatic_Algorithm_Configuration","abstract":"Modern optimization algorithms typically require the setting of a large number of parameters to optimize their performance. The immediate goal of automatic algorithm configuration is to find, automatically, the best parameter settings of an optimizer. Ultimately, automatic algorithm configuration has the potential to lead to new design paradigms for optimization software. Theirace package is a software package that implements a number of automatic configuration procedures. In particular, it offers iterated racing procedures, which have been used successfully to automatically configure various state-of-the-art algorithms. The iterated racing procedures implemented inirace include the iterated F-race algorithm and several extensions and improvements over it. In this paper, we describe the rationale underlying the iterated racing procedures and introduce a number of recent extensions. Among these, we introduce a restart mechanism to avoid premature convergence, the use of truncated sampling distributions to handle correctly parameter bounds, and an elitist racing procedure for ensuring that the best configurations returned are also those evaluated in the highest number of training instances. We experimentally evaluate the most recent version ofirace and demonstrate with a number of example applications the use and potential ofirace, in particular, and automatic algorithm configuration, in general.","authors":["Manuel López-Ibáñez","Jérémie Dubois-Lacoste","Thomas Stützle","Mauro Birattari"],"meta":["January 2011","DOI:10.1016/j.orp.2016.09.002"],"references":["310793197_A_hybrid_metaheuristic_approach_for_the_capacitated_arc_routing_problem","308953674_Ant_Colony_Optimization","232776392_The_Sequential_Parameter_Optimization_Toolbox","283996103_Genetic_Algorithms_In_Search_Optimization_and_Machine_Learning","268687536_Practical_Nonparametric_Statistics","263595747_Using_Experimental_Design_to_Find_Effective_Parameter_Settings_for_Heuristics","247219992_Practical_Nonparametric_Statistics-Third_Edition","244510403_The_Problem_of_Tuning_Metaheuristics_as_Seen_from_a_Machine_Learning_Perspective","235709625_Experimental_Methods_for_the_Analysis_of_Optimization_Algorithms","230660814_Ant_Colony_Optimization","221633588_Tuning_the_Performance_of_the_MMAS_Heuristic","221632672_A_Gender-Based_Genetic_Algorithm_for_the_Automatic_Configuration_of_Algorithms","221608790_Lecture_Notes_in_Computer_Science","229150080_Local_Search_for_a_Routing-Packing_Problem","226889394_The_Racing_Algorithm_Model_Selection_for_Lazy_Learners"]}