{"id":"235755034_Git_can_facilitate_greater_reproducibility_and_increased_transparency_in_science","abstract":"Background\nReproducibility is the hallmark of good science. Maintaining a high degree of transparency in scientific reporting is essential not just for gaining trust and credibility within the scientific community but also for facilitating the development of new ideas. Sharing data and computer code associated with publications is becoming increasingly common, motivated partly in response to data deposition requirements from journals and mandates from funders. Despite this increase in transparency, it is still difficult to reproduce or build upon the findings of most scientific publications without access to a more complete workflow.\n\nFindings\nVersion control systems (VCS), which have long been used to maintain code repositories in the software industry, are now finding new applications in science. One such open source VCS, Git, provides a lightweight yet robust framework that is ideal for managing the full suite of research outputs such as datasets, statistical code, figures, lab notes, and manuscripts. For individual researchers, Git provides a powerful way to track and compare versions, retrace errors, explore new approaches in a structured manner, while maintaining a full audit trail. For larger collaborative efforts, Git and Git hosting services make it possible for everyone to work asynchronously and merge their contributions at any time, all the while maintaining a complete authorship trail. In this paper I provide an overview of Git along with use-cases that highlight how this tool can be leveraged to make science more reproducible and transparent, foster new collaborations, and support novel uses.","authors":["Karthik Ram"],"meta":["February 2013Source Code for Biology and Medicine 8(1):7","DOI:10.1186/1751-0473-8-7","SourcePubMed"],"references":["259701267_Best_Practices_for_Scientific_Computing","236924941_The_Case_for_Open_Preprints_in_Biology","234048319_Mandated_data_archiving_greatly_improves_access_to_research_data","233870994_Ten_Simple_Rules_for_the_Open_Development_of_Scientific_Software","231815020_mMass_as_a_Software_Tool_for_the_Annotation_of_Cyclic_Peptide_Tandem_Mass_Spectra","297431158_Open_access_must_enable_open_use","254134560_Taxonomy_and_Irreproducible_Biological_Science","234098536_Altmetrics_Value_all_research_products","234060429_Advances_in_global_change_research_require_open_science_at_the_individual-level","233964069_Science_publishing_Open_access_must_enable_open_use"]}