{"id":"235796770_Vocal_Indices_of_Stress_A_Review","abstract":"Objective: \nIdentification of stress patterns in the voice has multiple potential applications. The objective was to review literature pertaining to the effects of various forms of stress upon the healthy voice.\n\nStudy design: \nLiterature review, discussion of results, and direction for further study.\n\nMethods: \nThis review article offers a model of stress and a review of the historical and recent research into the effects of stress on the voice. Electronic databases were searched using the key words. No studies were excluded on the basis of design; however, an attempt was made to include in the discussion studies which primarily address physiological and acoustic vocal parameters. The results of greater than 50 studies examining the effect of stressors ranging from lie and guilt to high altitude and space flight upon the voice were included in the review.\n\nResults: \nIncrease in fundamental frequency is the most commonly reported effect of stress in well-controlled trials. The trend, however, is not universal. A reduction in noise as reflected by the diminished vocal jitter is reported, but less frequently.\n\nConclusions: \nStress types, gender, and individual differences in baseline autonomic tone may explain the primarily equivocal findings of effects of stressor exposure or perceived stress on voice; and as such, the article concludes with a discussion of directions for future study.","authors":["Cheryl L Giddens","Kirk W Barron","Jennifer Byrd-Craven","Keith F Clark"],"meta":["February 2013Journal of voice: official journal of the Voice Foundation 27(3)","DOI:10.1016/j.jvoice.2012.12.010","SourcePubMed","Project: Autonomics and voice"],"references":["312389989_The_concepts_of_stress_and_stress_system_disorders","296207866_Sex_differences_in_pain_perception_and_cardiovascular_responses_in_persons_with_parental_history_for_hypertension","295496966_The_Polyvagal_Theory_The_phylogenetic_substrates_of_a_social_nervous_system","291813579_The_effect_of_filtered_speech_on_speaker_race_and_sex_identifications","288921542_Principles_of_Voice_Production_Second_Printing","287120736_Origins_of_normal_and_pathological_tremor","286389241_On_grasping_a_nettle_and_becoming_emotional","286209392_Estimating_speaker_age_across_languages","281317410_Protective_and_Damaging_Effects_of_Stress_Mediators","278522080_Love_An_emergent_property_of_the_mammalian_autonomic_nervous_system"]}