{"id":"235789051_Towards_Robust_Algorithms_for_Current_Deposition_and_Dynamic_Load-Balancing_in_a_GPU_Particle_In_Cell_Code","abstract":"We present ‘jasmine’, an implementation of a fully relativistic, 3D, electromagnetic Particle-In-Cell \n(PIC) code, capable of running simulations in various laser plasma acceleration regimes on Graphics-Processing-Units (GPUs) HPC clusters. Standard energy/charge preserving FDTD-based algorithms have been implemented using double precision and quadratic (or arbitrary sized) shape functions for the particle weighting. When porting a PIC scheme to the GPU architecture (or, in general, a shared memory environment), the particle-to-grid operations (e.g. the evaluation of the current density) require special care to avoid memory inconsistencies and conflicts. Here we present a robust implementation of this operation that is efficient for any number of particles per cell and particle shape function order. Our algorithm exploits the exposed GPU memory hierarchy and avoids the use of atomic operations, which can hurt performance especially when many particles lay on the same cell. We show the code multi-GPU scalability results and present a dynamic load-balancing algorithm. The code is written using a python-based C++ meta-programming technique which translates in a high level of modularity and allows for easy performance tuning and simple extension of the core algorithms to various simulation schemes.","authors":["Francesco Rossi","Pasquale Londrillo","Andrea Sgattoni","Stefano Sinigardi"],"meta":["December 2012AIP Conference Proceedings 1507(1):184-192","DOI:10.1063/1.4773692"],"references":["220206350_Particle-in-cell_simulations_with_charge-conserving_current_deposition_on_graphic_processing_units","2211084_One-to-one_direct_modeling_of_experiments_and_astrophysical_scenarios_Pushing_the_envelope_on_kinetic_plasma_simulations","229137535_Exact_charge_conservation_scheme_for_Particle-in-Cell_simulation_with_an_arbitrary_form-factor","224884172_Ultrahigh_performance_three-dimensional_electromagnetic_relativistic_kinetic_plasma_simulation","220380419_Fast_parallel_Particle-To-Grid_interpolation_for_plasma_PIC_simulations_on_the_GPU","2623351_The_Accuracy_Of_Floating_Point_Summation"]}