{"id":"235996019_AIML_Knowledge_Base_Construction_from_Text_Corpora","abstract":"Text mining (TM) and computational linguistics (CL) are computationally intensive fields where many tools are becoming avail- able to study large text corpora and exploit the use corpora for various purposes. In this chapter we will address the problem of building conversational agents or chatbots from corpora for domain-specific educational purposes. After addressing some linguistic issues relevant to the development of chatbot tools from corpora, a methodology to systematically analyze large text corpora about a limited knowledge domain will be presented. Given the Artificial Intelligence Markup Language as the ”assembly language” for the artificial intelligence conversational agents we present a way of using text corpora as seed from which a set of ”source files” can be derived. More specifically we will illustrate how to use corpus data to extract relevant keywords, multiword expressions, glossary building and text patterns in order to build an AIML knowledge base that could be later used to build interactive conversational systems. The approach we propose does not require deep understanding techniques for the analysis of text. As a case study it will be shown how to build the knowledge base of an English conversational agent for educational purpose from a child story that could answer question about characters, facts and episodes of the story. A discussion of the main linguistic and methodological issues and further improvements is offered in the final part of the chapter.","authors":["Giovanni De Gasperis","Isabella Chiari","Niva Florio"],"meta":["January 2012","DOI:10.1007/978-3-642-29694-9_12","In book: Artificial Intelligence, Evolutionary Computing and Metaheuristics (pp.287-318)Publisher: Springer-Verlag","Project: Text mining, Computational Linguistics and Conversational Systems"],"references":["298129630_Building_an_AIML_Chatter_Bot_Knowledge-Base_Starting_from_a_FAQ_and_a_Glossary","288810206_Learning_to_ReadType_a_Second_Language_in_a_Chatbot_Enhanced_Environment","268022747_Parsing_the_Turing_test_Philosophical_and_methodological_issues_in_the_quest_for_the_thinking_computer_Foreword_by_Daniel_C_Dennett","321611737_The_Turing_Test_The_Elusive_Standard_of_Artificial_Intelligence","319393820_WordNet_An_Electronic_Lexical_Database","284049558_WordNet_and_wordnets","277989245_Educational_Application_of_Dialogue_System_to_Support_e-Learning","269088030_Introducing_MegaHAL","268631365_Leeds_Unix_Knowledge_Expert_a_domain-dependent_Expert_System_generated_with_domain-independent_tools","268054040_The_Learning_Chatbot"]}