{"id":"235919738_Stable_Real-Time_Deformations","abstract":"The linear strain measures that are commonly used in real-time animations of deformable objects yield fast and stable simulations. However, they are not suitable for large deformations. Recently, more realistic results have been achieved in computer graphics by using Green’s non-linear strain tensor, but the non-linearity makes the simulation more costly and introduces numerical problems.\nIn this paper, we present a new simulation technique that is stable and fast like linear models, but without the disturbing artifacts that occur with large deformations. As a precomputation step, a linear stiffness matrix is computed for the system. At every time step of the simulation, we compute a tensor field that describes the local rotations of all the vertices in the mesh. This field allows us to compute the elastic forces in a non-rotated reference frame while using the precomputed stiffness matrix. The method can be applied\nto both finite element models and mass-spring systems. Our approach provides robustness, speed, and a realistic appearance in the simulation of large deformations.","authors":["Matthias Müller","Julie Dorsey","Leonard Mcmillan","Robert Jagnow"],"meta":["January 2002","DOI:10.1145/545265.545269","Conference: Proceedings of ACM SIGGRAPH Symposium on Computer Animation (SCA)"],"references":["258944244_Clifford_Algebra_to_Geometric_Calculus_A_Unified_Language_for_Mathematics_and_Physics","226453877_New_Geometric_Methods_for_Computer_Vision_An_Application_to_Structure_and_Motion_Estimation","220720523_ARTDEFO_accurate_real_time_deformable_objects","215458762_Elastically_Deformable_Models","262830560_Adaptive_Nonlinear_Finite_Elements_for_Deformable_Body_Simulation_Using_Dynamic_Progressive_Meshes","221401661_Real-Time_Large_Displacement_Elasticity_for_Surgery_Simulation_Non-Linear_Tensor-Mass_Model","220694042_Matrix_Computations_3rd_ed","45676451_Dynamic_Real-Time_Deformations_using_Space_Time_Adaptive_Sampling","3208111_Physically_Based_Models_with_Rigid_and_Deformable_Components","2927978_A_Survey_of_Deformable_Modeling_in_Computer_Graphics"]}