{"id":"236051481_Genetic_diversity_and_population_structure_assessed_by_SSR_and_SNP_markers_in_a_large_germplasm_collection_of_grape","abstract":"Background\nThe economic importance of grapevine has driven significant efforts in genomics to accelerate the exploitation of Vitis resources for development of new cultivars. However, although a large number of clonally propagated accessions are maintained in grape germplasm collections worldwide, their use for crop improvement is limited by the scarcity of information on genetic diversity, population structure and proper phenotypic assessment. The identification of representative and manageable subset of accessions would facilitate access to the diversity available in large collections. A genome-wide germplasm characterization using molecular markers can offer reliable tools for adjusting the quality and representativeness of such core samples.\n\nResults\nWe investigated patterns of molecular diversity at 22 common microsatellite loci and 384 single nucleotide polymorphisms (SNPs) in 2273 accessions of domesticated grapevine V. vinifera ssp. sativa, its wild relative V. vinifera ssp. sylvestris, interspecific hybrid cultivars and rootstocks. Despite the large number of putative duplicates and extensive clonal relationships among the accessions, we observed high level of genetic variation. In the total germplasm collection the average genetic diversity, as quantified by the expected heterozygosity, was higher for SSR loci (0.81) than for SNPs (0.34). The analysis of the genetic structure in the grape germplasm collection revealed several levels of stratification. The primary division was between accessions of V. vinifera and non-vinifera, followed by the distinction between wild and domesticated grapevine. Intra-specific subgroups were detected within cultivated grapevine representing different eco-geographic groups. The comparison of a phenological core collection and genetic core collections showed that the latter retained more genetic diversity, while maintaining a similar phenotypic variability.\n\nConclusions\nThe comprehensive molecular characterization of our grape germplasm collection contributes to the knowledge about levels and distribution of genetic diversity in the existing resources of Vitis and provides insights into genetic subdivision within the European germplasm. Genotypic and phenotypic information compared in this study may efficiently guide further exploration of this diversity for facilitating its practical use.","authors":["Francesco Emanuelli","Silvia Lorenzi","Lukasz Grzeskowiak","Valentina Catalano"],"meta":["March 2013BMC Plant Biology 13(1):39","DOI:10.1186/1471-2229-13-39","SourcePubMed"],"references":["307797116_Measuring_genetic_distances_between_breeds_use_of_some_distances_in_various_short_term_evolution_models","291799358_Le_Gouais_un_cepage_cle_du_patrimoine_viticole_europeen","287104091_Structure_Harvester_a_website_and_program_for_visualizing_STRUCTURE_output_and_implementing_the_Evanno_method","351151775_Inference_of_Population_Structure_Using_Multilocus_Genotype_Data_Linked_Loci_and_Correlated_Allele_Frequencies","341816021_Historical_origins_and_genetic_diversity_of_wine_grapes","313159598_Inference_of_Population_Structure_Using_Multilocus_Genotype_Data","304459543_Evolution_of_cultivated_forms_of_grapes","301853229_GENETIX4_05_logiciel_sous_Windows_TM_pour_la_genetiquedes_populations","292328792_Identification_of_microsatellite_sequences_in_Vitis_riparia_and_their_applicability_for_genotyping_of_different_Vitis_species","291852868_Identifying_grape_rootstocks_with_simple_sequence_repeat_SSR_DNA_markers","285841239_Les_populations_sauvages_et_cultivees_de_Vitis_vinifera_L","284373411_Analysis_of_gene_diversity_in_subdivided_population","283596257_Genetic_relationships_among_Pinots_and_related_cultivars","281579638_DISTRUCT_A_program_for_the_graphical_display_of_population_structure","281473131_A_new_Bayesian_method_to_identify_the_environmental_factors_that_influence_recent_migration"]}