{"id":"236031813_Combinatorics_of_Genome_Rearrangements","abstract":"From one cell to another, from one individual to another, and from one species to another, the content of DNA molecules is often similar. The organization of these molecules, however, differs dramatically, and the mutations that affect this organization are known as genome rearrangements. Combinatorial methods are used to reconstruct putative rearrangement scenarios in order to explain the evolutionary history of a set of species, often formalizing the evolutionary events that can explain the multiple combinations of observed genomes as combinatorial optimization problems. This book offers the first comprehensive survey of this rapidly expanding application of combinatorial optimization. It can be used as a reference for experienced researchers or as an introductory text for a broader audience.\n\nGenome rearrangement problems have proved so interesting from a combinatorial point of view that the field now belongs as much to mathematics as to biology. This book takes a mathematically oriented approach, but provides biological background when necessary. It presents a series of models, beginning with the simplest (which is progressively extended by dropping restrictions), each constructing a genome rearrangement problem. The book also discusses an important generalization of the basic problem known as the median problem, surveys attempts to reconstruct the relationships between genomes with phylogenetic trees, and offers a collection of summaries and appendixes with useful additional information.","authors":["Guillaume Fertin","Anthony Labarre","Irena Rusu","Eric Tannier"],"meta":["June 2009","DOI:10.7551/mitpress/9780262062824.001.0001","SourceOAI","Edition: 1Publisher: The MIT PressISBN: 9780262062824","Project: Genome rearrangements"],"references":["228600129_Reversal_distance_of_signed_circular_chromosomes","226296718_The_Solution_Space_of_Sorting_by_Reversals","225628719_Reversal_Distance_for_Strings_with_Duplicates_Linear_Time_Approximation_Using_Hitting_Set","225136861_The_Greedy_Algorithm_for_the_Minimum_Common_String_Partition_Problem","231586595_Genomic_sorting_with_length-weighted_reversals","226306427_A_Simpler_15-Approximation_Algorithm_for_Sorting_By_Transpositions","226237870_Non-breaking_Similarity_of_Genomes_with_Gene_Repetitions","225364364_Genome_Rearrangements_with_Partially_Ordered_Chromosomes","222839503_On_Maximal_Instances_for_the_Original_Syntenic_Distance","222708849_Advances_on_sorting_by_reversals","221583878_Comparing_Sequences_with_Segment_Rearrangements","222691951_A_Simpler_and_Faster_15-Approximation_Algorithm_for_Sorting_by_Transpositions","222664582_Reversal_and_transposition_medians","222661591_Lattice_Path_Matroids_Structural_Properties","222401401_Efficient_algorithms_for_multichromosomal_genome_rearrangements"]}