{"id":"236062547_Feasibility_of_the_virtual_needle_tracking_system_for_percutaneous_radiofrequency_ablation_of_hepatocellular_carcinoma","abstract":"AimTo evaluate the feasibility of the real-time virtual needle tracking system for percutaneous radiofrequency ablation (RFA) of hepatocellular carcinoma (HCC). Methods\nAn electromagnetic field created by an ultrasound (US) machine detected the tracking bracket mounted onto the RFA needle. When the needle tip was confirmed to be in the accurate plane extracorporeally, the needle was inserted into the liver using the virtual navigation US system, and RFA was performed. Eight patients with eight liver lesions underwent percutaneous RFA under ultrasound for HCC from October to November 2012 using the real-time electromagnetic virtual needle tracking system (VirtuTRAX). ResultsThe average size of the tumors was 11.5mm with one lesion in S4, two in S5, two in S7 and three in S8. Sufficient margins were obtained in a single session in all cases. Using only B-mode, the needle tip was obscured due to the condition of the surrounding liver or subcutaneous fat tissue, but it was identifiable with the use of the virtual needle tracking device in all cases. In one case where the lesion was large, the needle was placed twice deliberately, but the second puncture was made difficult by the ablation artifact of the first puncture. With the tracking device, however, it was possible to perform the second puncture accurately. Conclusion\nThe virtual tracking system is useful in cases where the needle tip is obscured due to surrounding liver conditions or when multiple punctures are necessary due to the ablation artifact's obscuring the needle tip. Freehand puncturing may be possible in the future using this technique with further improvements in the system.","authors":["Akiko Tomonari","Kunihiko Tsuji","Hajime Yamazaki","Hironori Aoki"],"meta":["February 2013Hepatology Research 43(12)","DOI:10.1111/hepr.12096","SourcePubMed"],"references":["51868073_Radiofrequency_Ablation_for_Hepatocellular_Carcinoma_10-Year_Outcome_and_Prognostic_Factors","5633744_Effectiveness_of_real-time_virtual_sonography-guided_radiofrequency_ablation_treatment_for_patients_with_hepatocellular_carcinomas","274299101_Radiofrequency_Ablation","233768745_Comparison_of_resection_and_ablation_for_hepatocellular_carcinoma_A_cohort_study_based_on_a_Japanese_nationwide_survey","51713189_Percutaneous_radiofrequency_ablation_of_virtual_tumours_in_canine_kidney_using_Global_Positioning_System-like_technology","23455126_Radiofrequency_Ablation_Assisted_by_Real-Time_Virtual_Sonography_and_CT_for_Hepatocellular_Carcinoma_Undetectable_by_Conventional_Sonography","6561342_Radiofrequency_Ablation_of_Hepatocellular_Carcinoma_Correlation_Between_Local_Tumor_Progression_After_Ablation_and_Ablative_Margin"]}