{"id":"236172768_Classification_and_comparison_of_routing_protocols_in_wireless_sensor_networks","abstract":"The recent advances and the convergence of micro electro-mechanical systems technology, integrated circuit technologies, microprocessor hardware and nano technology, wireless communications, Ad-hoc networking routing protocols, distributed signal processing, and embedded systems have made the concept of Wireless Sensor Networks (WSNs). Sensor network nodes are limited with respect to energy supply, restricted computational capacity and communication bandwidth. Most of the attention, however, has been given to the routing protocols since they might differ depending on the application and network architecture. To prolong the lifetime of the sensor nodes, designing efficient routing protocols is critical. Even though sensor networks are primarily designed for monitoring and reporting events, since they are application dependent, a single routing protocol cannot be efficient for sensor networks across all applications. In this paper, we analyze the design issues of sensor networks and present a classification and comparison of routing protocols. This comparison reveals the important features that need to be taken into consideration while designing and evaluating new routing protocols for sensor networks.","authors":["Rajashree V Biradar","V.C .Patil","Sandipan Sawant","Dr. R. R. Mudholkar"],"meta":["January 2010"],"references":["221420350_Tracking_Real-World_Phenomena_with_Smart_Dust","220926359_Rumor_Routing_Algorithm_for_Sensor_Netowrks","313550485_The_aware_home_A_living_laboratory_for_ubiquitous_computing_research","285480574_PEGASIS_Power-efficient_gathering_in_sensor_information_systems","261355675_APTEEN_a_hybrid_protocol_for_efficient_routing_and_comprehensive_information_retrieval_in_wireless","247597123_Span_An_Energy-Efficient_Coordination_Algorithm_for_Topology_Maintenance_in_Ad_Hoc_Wireless_Networks","224071752_Energy-efficient_communication_protocol_for_wireless_sensor_networks","221420387_Reliable_Set-Up_of_Medical_Body-Sensor_Networks","220926680_Topology_Control_for_Wireless_Sensor_Networks","215619101_Modeling_Data-Centric_Routing_in_Wireless_Sensor_Networks"]}