{"id":"236160250_Hand_gesture_recognition_with_depth_images_A_review","abstract":"This paper presents a literature review on the use of depth for hand tracking and gesture recognition. The survey examines 37 papers describing depth-based gesture recognition systems in terms of (1) the hand localization and gesture classification methods developed and used, (2) the applications where gesture recognition has been tested, and (3) the effects of the low-cost Kinect and OpenNI software libraries on gesture recognition research. The survey is organized around a novel model of the hand gesture recognition process. In the reviewed literature, 13 methods were found for hand localization and 11 were found for gesture classification. 24 of the papers included real-world applications to test a gesture recognition system, but only 8 application categories were found (and three applications accounted for 18 of the papers). The papers that use the Kinect and the OpenNI libraries for hand tracking tend to focus more on applications than on localization and classification methods, and show that the OpenNI hand tracking method is good enough for the applications tested thus far. However, the limitations of the Kinect and other depth sensors for gesture recognition have yet to be tested in challenging applications and environments.","authors":["Carlos Xavier Soto","Robin R. Murphy"],"meta":["September 2012","DOI:10.1109/roman.2012.6343787","Conference: RO-MAN, 2012 IEEERO-MAN, 2012 IEEE"],"references":["259707566_Vision-based_hand_segmentation_techniques_for_human-robot_interaction_for_real-time_applications","257879792_3D_hand_tracking_using_Kalman_filter_in_depth_space","233950932_Efficient_model-based_3D_tracking_of_hand_articulations_using_Kinect","233942827_Natural_DVI_based_on_intuitive_hand_gestures","266017362_Recognizing_Hand_Gestures_with_Microsoft's_Kinect","254055665_Gesture_recognition_using_depth-based_hand_tracking_for_contactless_controller_application","254033582_Interactive_display_using_depth_and_RGB_sensors_for_face_and_gesture_control","241626319_Real-time_hand_tracking_on_depth_images","240224936_Rapid_object_detection_using_a_boosted_cascade_of_simple_features","230690792_Real_time_interaction_with_mobile_robots_using_hand_gestures"]}