{"id":"236209139_Collaboration_between_the_natural_social_and_human_sciences_in_Global_Change_Research","abstract":"In nearly all domains of Global Change Research (GCR), the role of humans is a key factor as a driving force, a subject of impacts, or an agent in mitigating impacts and adapting to change. While advances have been made in the conceptualisation and practice of interdisciplinary Global Change Research in fields such as climate change and sustainability, approaches have tended to frame interdisciplinarity as actor-led, rather than understanding that complex problems which cut across disciplines may require new epistemological frameworks and methodological practices that exceed any one discipline. GCR studies must involve from their outset the social, human, natural and technical sciences in creating the spaces of interdisciplinarity, its terms of reference and forms of articulation. We propose a framework for funding excellence in interdisciplinary studies, named the Radically Inter- and Trans-disciplinary Environments (RITE) framework. RITE includes the need for a realignment of funding strategies to ensure that national and international research bodies and programmes road-map their respective strengths and identified areas for radical interdisciplinary research; then ensure that these areas can and are appropriately funded and staffed by talented individuals who want to apply their creative scientific talents to broader issues than their own field in the long term, rather than on limited scope (5 year and less) research projects. While our references are mostly to Europe, recommendations may be applicable elsewhere.","authors":["Poul Holm","Michael Goodsite Ph.D.","Sierd Cloetingh","Mauro Agnoletti"],"meta":["April 2013Environmental Science & Policy 28:25 - 35","DOI:10.1016/j.envsci.2012.11.010","Projects: Research on researchThe Environment as a Common Good in the Time of Globalization: Its Conceptualization and Social Perception"],"references":["305149283_Education_for_Sustainability_Assessing_Pathways_to_the_Future","326995626_Overcoming_system_roadblocks_to_sustainability_The_evolutionary_redesign_of_worldviews_institutions_and_Technologies","305852929_Learning_as_Transformation_Critical_Perspectives_on_a_Theory_in_Progress","292652317_Political_and_civic_leadership_A_reference_handbook","288455760_Socio-ecological_agency_From_'human_exceptionalism'_to_coping_with_'exceptional'_global_environmental_change","283995609_Self-Organization_in_Non-Equilibrium_Systems","282156075_Theory_U_Learning_From_the_Future_as_It_Emerges","281577162_Education_for_Sustainability_Assessing_Pathways_to_the_Future","269519853_Pedagogy_of_The_Oppressed","265092368_Learning_As_Transformation_Critical_Perspectives_on_A_Theory_in_Progress"]}