{"id":"236580447_A_novel_insight_into_Gene_Ontology_semantic_similarity","abstract":"Existing methods for computing the semantic similarity between Gene Ontology (GO) terms are often based on external datasets and, therefore are not intrinsic to GO. Furthermore, they not only fail to handle identical annotations but also show a strong bias toward well-annotated proteins when being used for measuring similarity of proteins. Inspired by the concept of cellular differentiation and dedifferentiation in developmental biology, we propose a shortest semantic differentiation distance (SSDD) based on the concept of semantic totipotency to measure the semantic similarity of GO terms and further compare the functional similarity of proteins. Using human ratings and a benchmark dataset, SSDD was found to improve upon existing methods for computing the semantic similarity of GO terms. An in-depth analysis shows that SSDD is able to distinguish identical annotations and does not depend on annotation richness, thus producing more unbiased and reliable results. Online services can be accessed at the Gene Functional Similarity Analysis Tools website (GFSAT: http://nclab.hit.edu.cn/GFSAT ).","authors":["Yungang Xu","Mao-zu Guo","Wenli Shi","Xiaoyan Liu"],"meta":["April 2013Genomics","DOI:10.1016/j.ygeno.2013.04.010","SourcePubMed"],"references":["252369528_Evaluating_GO-based_Semantic_Similarity_Measures","228658892_CESSM_Collaborative_Evaluation_of_Semantic_Similarity_Measures","223996394_Modularized_learning_of_genetic_interaction_networks_from_biological_annotations_and_mRNA_expression_data","293228524_An_information-theoretic_definition_of_similarity","257467254_Introduction","246158545_Factoring_the_structure_of_a_taxonomy_into_a_semantic_classification_decision","243333683_A_measure_of_semantic_similarity_between_gene_ontology_terms_based_on_semantic_pathway_covering","241177598_Visualizing_and_Distances_Using_GO","238080579_Ontology-driven_similarity_approaches_to_supporting_gene_func-_tional_assessment","223996390_Modularized_learning_of_genetic_interaction_networks_from_biological_annotations_and_mRNA_expression_data"]}