{"id":"236657042_Efficiency_Analysis_of_Geocast_Target_Region_Specifications_for_VANET_Applications","abstract":"Geocast is a communication paradigm for dissemi- nating information in a specified target region rather than based on IP addresses. Local hazard or accident warnings and warnings of approaching emergency vehicles are examples of potential use cases in vehicular ad hoc networks (VANETs). Different geocast target region specifications have been proposed in recent years. Yet, the impact of the selected geocast target region specification on communication efficiency and network overload has not been extensively studied so far.We provide a comparative analysis of different geocast target region specifications, namely circle, rectangle, polygon, and route. In our analysis we consider introduced communication overhead, as well as false positive and false negative rates for three representative VANET applications. Our simulation results show that a circular region, despite its simplicity, performs better in most scenarios than rectangular, polygon-based, or route-based regions. However, optimal radius selection has a significant impact on efficiency","authors":["Timm Jöchle","Björn Wiedersheim","Florian Schaub","Michael Weber"],"meta":["November 2012","DOI:10.1109/VNC.2012.6407439","Conference: IEEE Vehicular Networking Conference (VNC 2012)"],"references":["234775383_A_Mobicast_Routing_Protocol_in_Vehicular_Ad-Hoc_Networks","224353770_Communication_patterns_in_VANETs","224124620_Design_and_Performance_of_Secure_Geocast_for_Vehicular_Communication","224116353_A_VANET-based_emergency_vehicle_warning_system","224085111_A_Survey_of_Geocast_Routing_Protocols","221388498_Extending_the_Domain_Name_System_DNS_to_provide_geographical_addressing_towards_vehicular_ad-hoc_networks_VANETs","290738224_Analysis_of_Next_Hop_Selection_for_Geocasting_in_VANET","262295175_Unicast_Geographic_Routing_Protocols_for_Inter-Vehicle_Communications_A_Survey","252053322_Position-based_and_geocast_routing_protocols_in_VANETs","242447477_GeoCast-_Geographic_addressing_and_routing"]}