{"id":"236631125_Handbook_of_Natural_Computing","abstract":"Natural Computing is the field of research that investigates both human-designed computing inspired by nature and computing taking place in nature, i.e., it investigates models and computational techniques inspired by nature and also it investigates phenomena taking place in nature in terms of information processing.Examples of the first strand of research covered by the handbook which has three volumesinclude neural computation inspired by the functioning of the brain; evolutionary computation inspired by Darwinian evolution of species; cellular automata inspired by intercellular communication; swarm intelligence inspired by the behavior of groups of organisms; artificial immune systems inspired by the natural immune system; artificial life systems inspired by the properties of natural life in general; membrane computing inspired by the compartmentalized ways in which cells process information; and amorphous computing inspired by morphogenesis. Other examples of natural-computing paradigms are molecular computing and quantum computing, where the goal is to replace traditional electronic hardware, e.g., by bioware in molecular computing. In molecular computing, data are encoded as biomolecules and then molecular biology tools are used to transform the data, thus performing computations. In quantum computing, one exploits quantum-mechanical phenomena to perform computations and secure communications more efficiently than classical physics and, hence, traditional hardware allows.The second strand of research covered by the handbook, computation taking place in nature, is represented by investigations into, among others, the computational nature of self-assembly, which lies at the core of nanoscience, the computational nature of developmental processes, the computational nature of biochemical reactions, the computational nature of bacterial communication, the computational nature of brain processes, and the systems biology approach to bionetworks where cellular processes are treated in terms of communication and interaction, and, hence, in terms of computation.We are now witnessing exciting interaction between computer science and the natural sciences. While the natural sciences are rapidly absorbing notions, techniques and methodologies intrinsic to information processing, computer science is adapting and extending its traditional notion of computation, and computational techniques, to account for computation taking place in nature around us. Natural Computing is an important catalyst for this two-way interaction, and this three-volume handbook is a major record of this important development.","authors":["Grzegorz Rozenberg","Thomas Bäck","Joost N. Kok"],"meta":["January 2012","DOI:10.1007/978-3-540-92910-9","Publisher: SpringerEditor: G. Rozenberg, T. Bäck, J. KokISBN: 978-3-540-92909-3"],"references":[]}