{"id":"236686616_Experience_de_visite_et_construction_des_connaissances_le_cas_des_musees_de_sciences_et_des_centres_de_culture_scientifique","abstract":"Pouvons-nous accéder à l’expérience des visiteurs dans un musée ? Pouvons-nous décrire et comprendre ces expériences ? En particulier, pouvons-nous saisir les enchaînements corporels et cognitifs à travers lesquels nous construisons des connaissances dans les musées de sciences et centres de culture scientifique ?\nCette étude aborde l’expérience des visiteurs à partir d’une perspective énactive comme ce qui fait sens du point de vue du visiteur dans le cours de sa visite. Les principaux résultats portent sur une méthode d’investigation originale dans le champ muséal qui autorise un nouveau point de vue sur l’expérience des visiteurs dans les musées. Nous montrons que l’analyse du cours d’expérience réalisée à partir d’un entretien en re-situ subjectif permet de décrire et de comprendre les unités élémentaires de l’expérience des visiteurs, ainsi que l’expérience globale de visite avec précision, finesse et profondeur. Nous mettons en évidence les actions et les cheminements cognitifs des visiteurs qui concourent à la construction de leurs connaissances.\nNous proposons également des cours d’expérience typiques aux visites de musées qui participent de façon récurrente à la construction de connaissances et qui ouvrent des nouvelles perspectives. Plutôt que transmettre des savoirs, un musée de science ou un centre de culture scientifique paraît surtout encourager et stimuler la créativité des visiteurs pour qu’ils puissent se lier à des expôts et à des œuvres d’une façon qui leur convient. Dans des conditions favorables, ces musées contribuent alors à enrichir le monde propre de chaque visiteur de nouvelles possibilités de connaître.","authors":["Daniel Schmitt"],"meta":["December 2012","Thesis for: PhDAdvisor: Michèle Kirch et Baudouin Jurdant"],"references":["250260459_Expositions_parcs_sites_des_lieux_d'experiences_patrimoniales","250255878_Vulgarisation_scientifique_et_ideologie","247913158_La_construction_de_connaissances_chez_des_sportifs_de_haut_niveau_lors_d'une_interaction_competitive","272344705_Vivre_le_patrimoine_urbain_au_quotidien_pour_une_approche_de_la_patrimonialite","266353439_Dynamique_motionnelle_et_activit_le_cas_des_enseignants_dbutants","265429782_QUE_SIGNIFIE_VOIR_ROUGE_LA_SENSATION_ET_LA_COULEUR_SELON_PEIRCE","251042820_Necessite_d'une_recherche_educative_dans_les_expositions_a_caractere_scientifique_et_technique","251042747_Le_contexte_social_un_des_determinants_du_comportement_d'apprentissage_dans_les_musees","251041879_L'ambiguite_de_la_mediation_culturelle_entre_savoir_et_presence","230290961_Visual_Communication_in_the_Science_Museum1","45358953_Exposition_representation_et_communication","222044450_An_Analysis_of_a_User's_Exploration_And_Learning_of_a_Multimedia_Instruction_System","18759426_Autopoiesis_The_Organization_of_Living_Systems_Its_Characterization_and_a_Model","10081708_The_question_of_family_homeostasis"]}