{"id":"236675323_Microfluidic_genome-wide_profiling_of_intrinsic_electrical_properties_in_Saccharomyces_cerevisiae","abstract":"Methods to analyze the intrinsic physical properties of cells - for example, size, density, rigidity, or electrical properties - are an active area of interest in the microfluidics community. Although the physical properties of cells are determined at a fundamental level by gene expression, the relationship between the two remains exceptionally complex and poorly characterized, limiting the adoption of intrinsic separation technologies. To improve our current understanding of how a cell's genotype maps to a measurable physical characteristic and quantitatively investigate the potential of using these characteristics as biomarkers, we have developed a novel screen that combines microfluidic cell sorting with high-throughput sequencing and the haploid yeast deletion library to identify genes whose functions modulate one such characteristic - intrinsic electrical properties. Using this screen, we are able to establish a high-content electrical profile of the haploid yeast gene deletion strains. We find that individual genetic deletions can appreciably alter the electrical properties of cells, affecting ∼10% of the 4432 gene deletion strains screened. Additionally, we find that gene deletions affecting electrical properties in specific ways (i.e. increasing or decreasing effective conductivity at higher or lower electric field frequencies) are strongly associated with an enriched subset of fundamental biological processes that can be traced to specific pathways and complexes. The screening approach demonstrated here and the attendant results are immediately applicable to the intrinsic separations community.","authors":["Michael D Vahey","Laia Quiros Pesudo","J Peter Svensson","Leona D Samson"],"meta":["May 2013Lab on a Chip 13(14)","DOI:10.1039/c3lc50162k","SourcePubMed"],"references":["224817301_Global_analysis_of_protein_localization_in_budding_yeast","51427739_Nanomechanical_Analysis_of_Cells_from_Cancer_Patients","49788951_Deformability-based_cell_classification_and_enrichment_using_inertial_microfluidics","47791827_Quantitative_analysis_of_fitness_and_genetic_interactions_in_yeast_on_a_genome_scale","251153817_Esophagectomy","232274931_Electromechanics_of_particles_Cambridge_Press_Cambridge","51235697_Measuring_single-cell_density","47499736_Mesenchymal_Stem_Cell_Mechanics_from_the_Attached_to_the_Suspended_State","44852289_Membrane_budding_and_scission_by_the_ESCRT_machinery_It's_all_in_the_neck","41720909_Acoustophoretic_Synchronization_of_Mammalian_Cells_in_Microchannels"]}