{"id":"236737208_A_Stochastic_Vehicle_Routing_Problem_with_Travel_Time_Uncertainty_Trade-Off_Between_Cost_and_Customer_Service","abstract":"On-time shipment delivery is critical for just-in-time production and quick response logistics. Due to uncertainties in travel and service times, on-time arrival probability of vehicles at customer locations can not be ensured. Therefore, on-time shipment delivery is a challenging job for carriers in congested road networks. In this paper, such on-time shipment delivery problems are formulated as a stochastic vehicle routing problem with soft time windows under travel and service time uncertainties. A new stochastic programming model is proposed to minimize carrier’s total cost, while guaranteeing a minimum on-time arrival probability at each customer location. The aim of this model is to find a good trade-off between carrier’s total cost and customer service level. To solve the proposed model, an iterated tabu search heuristic algorithm was developed, incorporating a route reduction mechanism. A discrete approximation method is proposed for generating arrival time distributions of vehicles in the presence of time windows. Several numerical examples were conducted to demonstrate the applicability of the proposed model and solution algorithm.","authors":["J. L. ZHANG","William H. K. Lam","Bi Yu Chen"],"meta":["May 2013Networks and Spatial Economics In press","DOI:10.1007/s11067-013-9190-x"],"references":["313069815_Vrp_with_time_windows","284486598_Iterated_Local_Search_International_series_in_operations_research_and_management_science","275852769_Estimating_the_Benefits_of_Considering_Travel_Time_Variability_in_Urban_Distribution","267109723_The_Vehicle_Routing_Problem_Latest_Advances_and_New_Challenges","265441556_The_Vehicle_Routing_Problem_with_Stochastic_Travel_Times","264963062_An_Exact_Algorithm_for_the_Vehicle_Routing_Problem_with_Stochastic_Demands_and_Customers","263334406_A_probability_model_and_sampling_algorithm_for_the_inter-day_stochastic_traffic_assignment_problem","259928879_Synchronization_in_Vehicle_Routing-A_Survey_of_VRPs_with_Multiple_Synchronization_Constraints","257632489_A_Joint_Replenishment_Inventory-Location_Model","257632486_A_New_Formulation_Approach_for_Location-Routing_Problems"]}