{"id":"236736746_An_Accelerated_Proximal_Gradient_Algorithm_for_Nuclear_Norm_Regularized_Least_Squares_Problems","abstract":"tion problem, in which we wish to recover a (low-rank) data matrix from incomplete samples of its entries. A recent convex relaxation of the rank minimization problem minimizes the nuclear norm instead of the rank of the matrix. Another possible model for the rank minimization problem is the nuclear norm regularized linear least squares problem. This regularized problem is a special case of an unconstrained nonsmooth convex optimization problem, in which the objective function is the sum of a convex smooth function with Lipschitz continuous gradient and a convex function on a set of matrices. In this paper, we propose an accelerated proximal gradient algorithm, which terminates in O(1= p ) iterations with an -optimal solution, to solve this un- constrained nonsmooth convex optimization problem, and in particular, the nuclear norm regularized linear least squares problem. We report numerical results for solving large-scale randomly generated matrix completion problems. The numerical results suggest that our algorithm is ecient and robust in solving large-scale random matrix completion problems. In particular, we are able to solve random matrix completion problems with matrix dimensions up to 105 each in less than 3.5 hours on a modest PC.","authors":["Kim-Chuan Toh","Sangwoon Yun"],"meta":["September 2010Pacific Journal of Optimization 6(3)","Project: Applications of convex programming in science and engineering"],"references":["253736697_Coordinate_gradient_descent_method_for_l1-regularized_convex_minimization","249903370_Fixed-Point_Continuation_for_l1-Minimization_Methodology_and_Convergence","247456496_SDPT3_--_a_MATLAB_software_package_for_semidefinite_programming","304824205_Regression_Shrinkage_and_Selection_via_the_LASSO","278433201_Atomic_Decomposition_by_Basis_Pursuit","269634058_Robust_Uncertainty_Principles_Exact_Signal_Frequency_Information","268837707_On_an_approach_to_the_construction_of_optimal_methods_for_minimizing_smooth_convex_functions","260365721_On_accelerated_proximal_gradient_methods_for_convex-concave_optimization","258222850_Introductory_Lectures_on_Convex_Optimization_A_Basic_Course","257291640_A_method_of_solving_a_convex_programming_problem_with_convergence_rate_O1k2"]}