{"id":"236850664_Speech-Specific_Tuning_of_Neurons_in_Human_Superior_Temporal_Gyrus","abstract":"How the brain extracts words from auditory signals is an unanswered question. We recorded approximately 150 single and multi-units from the left anterior superior temporal gyrus of a patient during multiple auditory experiments. Against low background activity, 45% of units robustly fired to particular spoken words with little or no response to pure tones, noise-vocoded speech, or environmental sounds. Many units were tuned to complex but specific sets of phonemes, which were influenced by local context but invariant to speaker, and suppressed during self-produced speech. The firing of several units to specific visual letters was correlated with their response to the corresponding auditory phonemes, providing the first direct neural evidence for phonological recoding during reading. Maximal decoding of individual phonemes and words identities was attained using firing rates from approximately 5 neurons within 200 ms after word onset. Thus, neurons in human superior temporal gyrus use sparse spatially organized population encoding of complex acoustic-phonetic features to help recognize auditory and visual words. © The Author 2013. Published by Oxford University Press. All rights reserved. For Permissions, please e-mail: [email protected]\n/* */","authors":["Alexander M Chan","Andrew Dykstra","Vinay Jayaram","Matthew Leonard"],"meta":["May 2014Cerebral Cortex 24(10)","DOI:10.1093/cercor/bht127"],"references":["274443981_Hearing_and_saying","263916104_Interaction_of_Information_in_Word_Recognition","257291312_Perceptual_Restoration_of_Missing_Speech_Sounds","319353461_Speaking_modifies_voice-evoked_activity_in_the_human_auditory_cortex","277549294_Identification_of_a_pathway_for_intelligible_speech_in_the_left_temporal_lobe","246289947_Induced_electrocorticographic_gamma_activity_during_auditory_perception","245588852_Brain_mapping_of_native_and_foreign_languages","243768333_Dynamic_Statistical_Parametric_Mapping","243528286_Neural_mechanisms_underlying_sensory_feedback_control_of_speech","236220562_Human_Temporal_Lobe_Activation_by_Speech_and_Nonspeech_Sounds"]}