{"id":"236855882_Tools_and_Methodologies_for_Teaching_Online_Computer-Science_Courses_in_LMS_Environment","abstract":"The author shares his experiences teaching various online computer-science courses (via the Blackboard™ and synchronous web conferencing tools) using state-of-the-art free-license software tools for conducting online virtual labs and numerous students’ projects. The labs were designed to help students explore modern, sophisticated techniques in several areas of computer science: computer-system analysis and design, programming in C/C++ and Java, software quality assurance, data communication in networking systems, computer security, system simulation and modeling, numerical analysis, image processing, multimedia applications, Web development, and database design and management. All the online courses include “warm-up” exercises and lab-based projects that provide students with knowledge, instructions, and hands-on experience, and that motivate them in selecting topics for technology overviews and research.","authors":["Vladimir Riabov"],"meta":["April 2013","DOI:10.4018/978-1-4666-3930-0.ch008","In book: Learning Management Systems and Instructional Design: Best Practices in Online Education (pp.144-171)Chapter: Chapter 8: Tools and Methodologies for Teaching Online Computer-Science Courses in LMS EnvironmentPublisher: IGI GlobalEditors: Yefim Kats"],"references":["262352227_Running_a_computer_security_course_challenges_tools_and_projects_poster_session","260038868_Exploring_Singular_Differential_Equations_with_Exponential_Box-Scheme","324358827_The_Essence_of_Chaos","294161649_Total_graduate_enrollments_rise_number_of_foreign_students_drops","293203436_2002-2003_Taulbee_survey","266607038_A_First_Course_in_Numerical_Methods","265371443_Computer_science_An_overview","265343468_Numerical_methods_in_scientific_computing_Vol_1","262242104_The_design_and_complexity_analysis_of_the_light-up_puzzle_program_faculty_poster","261056412_Digital_video_cluster_simulation"]}