{"id":"236985005_KAZE_Features","abstract":"In this paper, we introduce KAZE features, a novel multiscale 2D fea-ture detection and description algorithm in nonlinear scale spaces. Previous ap-proaches detect and describe features at different scale levels by building or ap-proximating the Gaussian scale space of an image. However, Gaussian blurring does not respect the natural boundaries of objects and smoothes to the same de-gree both details and noise, reducing localization accuracy and distinctiveness. In contrast, we detect and describe 2D features in a nonlinear scale space by means of nonlinear diffusion filtering. In this way, we can make blurring locally adaptive to the image data, reducing noise but retaining object boundaries, obtaining su-perior localization accuracy and distinctiviness. The nonlinear scale space is built using efficient Additive Operator Splitting (AOS) techniques and variable con-ductance diffusion. We present an extensive evaluation on benchmark datasets and a practical matching application on deformable surfaces. Even though our features are somewhat more expensive to compute than SURF due to the con-struction of the nonlinear scale space, but comparable to SIFT, our results reveal a step forward in performance both in detection and description against previous state-of-the-art methods.","authors":["Pablo Fernández Alcantarilla","Adrien Bartoli","Andrew J Davison"],"meta":["October 2012","DOI:10.1007/978-3-642-33783-3_16","Conference: European Conference on Computer Vision (ECCV)Volume: 7577"],"references":["261473816_A_New_Feature-preserving_Nonlinear_Anisotropic_Diffusion_Method_for_Image_Denoising","257419743_On_Template-Based_Reconstruction_from_a_Single_View_Analytical_Solutions_and_Proofs_of_Well-Posedness_for_Developable_Isometric_and_Conformal_Surfaces","236268217_Image_Selective_Smoothing_and_Edge_Detection_by_Nonlinear_Diffusion_II","229005573_On_the_Axioms_of_Scale_Space_Theory","319770396_VLFeat_An_Open_and_Portable_Library_of_Computer_Vision_Algorithms","316240097_Distinctive_Image_Features_from_Scale-Invariant_Keypoints","275057952_SURF_Speeded_up_robust_features","268733104_Speeded-up_robust_features_SURF","230675368_Front-End_Vision_and_Multi-Scale_Image_Analysis_Multi-Scale_Computer_Vision_Theory_and_Applications_Written_in_Mathematica","228826916_Linear_Scale-Space_has_First_been_Proposed_in_Japan"]}