{"id":"236968489_Determining_scientific_impact_using_a_collaboration_index","abstract":"Researchers collaborate on scientific projects that are often measured by both the quantity and the quality of the resultant peer-reviewed publications. However, not all collaborators contribute to these publications equally, making metrics such as the total number of publications and the H-index insufficient measurements of individual scientific impact. To remedy this, we use an axiomatic approach to assign relative credits to the coauthors of a given paper, referred to as the A-index for its axiomatic foundation. In this paper, we use the A-index to compute the weighted sums of peer-reviewed publications and journal impact factors, denoted as the C- and P-indexes for collaboration and productivity, respectively. We perform an in-depth analysis of bibliometric data for 186 biomedical engineering faculty members and from extensive simulation. It is found that these axiomatically weighted indexes better capture a researcher's scientific caliber than do the total number of publications and the H-index, allowing for fairer and sharper evaluation of researchers with diverse collaborative behaviors.","authors":["Jonathan Stallrich","Eric Alan Vance","Jiansheng Yang","Michael W Vannier"],"meta":["May 2013Proceedings of the National Academy of Sciences 110(24)","DOI:10.1073/pnas.1220184110","SourcePubMed"],"references":["51581618_Race_Ethnicity_and_NIH_Research_Awards","45906749_Axiomatic_Quantification_of_Co-authors'_Relative_Contributions","335010115_The_demise_of_the_lone_author","261967959_Race_Disparity_in_Grants_Empirical_Solutions_Vital_with_Response","257692189_A_bibliometric_analysis_of_academic_publication_and_NIH_funding","253938418_Already_live_do_not_publish_gene_chips_unmask_cryptic_diseases","232270104_Patient_centred_model_of_practice_is_unsuited_to_reforms","220207513_The_pros_and_cons_of_computing_the_h-index_using_Web_of_Science","38327026_Permutation_Methods_A_Basis_for_Exact_Inference","24401382_A_proposal_for_calculating_weighted_citations_based_on_author_rank"]}