{"id":"237254892_An_effective_retinal_blood_vessel_segmentation_method_using_multi-scale_line_detection","abstract":"a b s t r a c t Changes in retinal blood vessel features are precursors of serious diseases such as cardiovascular disease and stroke. Therefore, analysis of retinal vascular features can assist in detecting these changes and allow the patient to take action while the disease is still in its early stages. Automation of this process would help to reduce the cost associated with trained graders and remove the issue of inconsistency introduced by manual grading. Among different retinal analysis tasks, retinal blood vessel extraction plays an extremely important role as it is the first essential step before any measurement can be made. In this paper, we present an effective method for automatically extracting blood vessels from colour retinal images. The proposed method is based on the fact that by changing the length of a basic line detector, line detectors at varying scales are achieved. To maintain the strength and eliminate the drawbacks of each individual line detector, the line responses at varying scales are linearly combined to produce the final segmentation for each retinal image. The performance of the proposed method was evaluated both quantitatively and qualitatively on three publicly available DRIVE, STARE, and REVIEW datasets. On DRIVE and STARE datasets, the proposed method achieves high local accuracy (a measure to assess the accuracy at regions around the vessels) while retaining comparable accuracy compared to other existing methods. Visual inspection on the segmentation results shows that the proposed method produces accurate segmentation on central reflex vessels while keeping close vessels well separated. On REVIEW dataset, the vessel width measurements obtained using the segmentations produced by the proposed method are highly accurate and close to the measurements provided by the experts. This has demonstrated the high segmentation accuracy of the proposed method and its applicability for automatic vascular calibre measurement. Other advantages of the proposed method include its efficiency with fast segmentation time, its simplicity and scalability to deal with high resolution retinal images.","authors":["Uyen T. V. Nguyen","Alauddin Bhuiyan","Laurence A F Park","Kotagiri Ramamohanarao"],"meta":["January 2012Pattern Recognition 46(3):703--715","DOI:10.1016/j.patcog.2012.08.009"],"references":["224407509_A_Modified_Matched_Filter_With_Double-Sided_Thresholding_for_Screening_Proliferative_Diabetic_Retinopathy","220603712_Retinal_vessel_segmentation_using_a_probabilistic_tracking_method","46642678_Comparative_study_of_retinal_vessel_segmentation_methods_on_a_new_publicly_available_database","45603253_A_New_Supervised_Method_for_Blood_Vessel_Segmentation_in_Retinal_Images_by_Using_Gray-Level_and_Moment_Invariants-Based_Features","272920837_Retinal_Arteriolar_Diameter_and_Risk_for_Hypertension","224824117_Blood_vessel_segmentation_methodologies_in_retinal_images_-_A_survey","224125216_General_Retinal_Vessel_Segmentation_Using_Regularization-Based_Multiconcavity_Modeling","220603981_Segmentation_of_retinal_blood_vessels_using_the_radial_projection_and_semi-supervised_approach","220521913_FABC_Retinal_vessel_segmentation_using_AdaBoost","220182838_Adaptive_Local_Thresholding_by_Verification-Based_Multithreshold_Probing_with_Application_to_Vessel_Detection_in_Retinal_Images"]}