{"id":"237473923_Estudos_de_revisao_sistematica_Um_guia_para_sintese_criteriosa_da_evidencia_cientifica","abstract":"Systematic review studies: a guide for careful synthesis of the scientific evidence Introduction: Aggregation of research evidence to guide clinical practice is one of the main reasons for conducting studies that provide a synthesis of the literature, but it is not the only reason. Systematic reviews are designed to be methodical, explicit and replicable. Such studies may help to guide project development, by indicating new directions for further investigations and identifying which research methods have been used within a given area. Methods: Systematic reviews require straightforward questions, search strategy definition, establishment of study inclusion and exclusion criteria and careful analysis of the selected literature. The development process for reviews of this type includes characterization of each selected study, evaluation of their quality, identification of important concepts, comparison of statistical analyses used and conclusions regarding what the literature tells us about a specific intervention. Such reviews also suggest problems/questions that need further investigation. Systematic review studies follow the structure of original articles. Conclusion: Good systematic reviews are important resources, in the light of the accelerated growth of scientific information. These studies help in producing syntheses of the evidence available in the literature on specific interventions, and may help clinicians and researchers in their work process.","authors":["Rosana Sampaio"],"meta":["February 2007Revista Brasileira de Fisioterapia 11(1)","DOI:10.1590/S1413-35552007000100013"],"references":["232263029_How_to_read_a_paper_Papers_that_summarise_other_papers_systematic_reviews_and_meta-analyses","7704439_Understanding_systematic_reviews_and_meta-analysis","7704438_Understanding_randomised_controlled_trials","313372952_Reliability_of_the_PEDro_Scale_for_Rating_Quality_of_Randomized_Controlled_Trials","271091507_Clinical_Experience_and_Evidence-Based_Medicine","237382828_Users'_Guides_to_the_Medical_Literature_I_How_to_Get_Started","43489681_The_process_of_evidence-based_practice_in_occupational_therapy_Informing_clinical_decisions","29470778_Rehabilitation_research_Principles_and_applications_Book_review","15266636_Users'_guides_to_the_medical_literature_VI_How_to_use_an_overview_Evidence-Based_Medicine_Working_Group","14055051_A_guide_to_interpreting_discordant_systematic_reviews","11943277_Evidence-based_practice","11224525_A_systematic_review_of_the_effectiveness_of_strength-training_programmes_for_people_with_CP","10958748_Hierarchy_of_Evidence_A_Framework_for_Ranking_Evidence_Evaluating_Health_Care_Interventions","10957520_How_objective_are_systematic_reviews_Differences_between_reviews_on_complementary_medicine"]}