{"id":"237502795_A_Genetic_Algorithm_for_the_Teacher_Assignment_Problem_for_a_University_in_Indonesia","abstract":"In this paper, we address a timetabling problem arising from an institution in Indonesia. The problem addressed is the assignment of teachers to the courses and course sections at the university level. This teacher assignment problem is first formulated as a mathematical programming model and a genetic algorithm with two types of crossover is then proposed for solving the problem. The proposed algorithm consists of two phases. The first phase focuses on allocating the teachers to the courses and determining the number of courses to be assigned to each teacher. From the results obtained in the first phase, the second phase will then involve scheduling the teachers to the course sections in order to balance the teachers' load. The performance of the proposed algorithm is evaluated against two real data sets taken from an institution in Indonesia and some randomly generated problem instances. For the real data sets, the computational results show that the proposed algorithm yields better solutions when compared to manual allocation done by the institution.","authors":["Aldy Gunawan","K. M. Ng","H. L. Ong"],"meta":["March 2008International Journal of Information and Management Sciences 19(1)"],"references":["264238319_A_Survey_of_Automated_Timetabling","242356870_Adaptation_In_Natural_And_Artificial_Systems","239665420_Handbook_of_Genetic_Algorithms_V_an_Nostrand_Reinhold","234656330_Matching_Faculty_to_Courses","229673463_Optimizing_Organizational_Goals_in_Assigning_Faculty_Teaching_Schedules","227493651_A_genetic_algorithm_for_a_university_weekly_courses_timetabling_problem","223517068_Genetic_algorithm_for_flowshop_scheduling_problems","222790992_An_application_of_genetic_algorithm_methods_for_teacher_assignment_problems","222567018_Recent_research_directions_in_automated_timetabling","222472167_A_goal_programming_model_to_optimize_departmental_preference_in_course_assignments"]}