{"id":"237589422_Le_nuove_macchine_per_apprendere_Simulazioni_al_computer_robot_e_videogiochi_multi-utente_Alcuni_prototipi","abstract":"1. INTRODUZIONE In questo scritto presenteremo e descriveremo alcuni prototipi di videogiochi ludici/didattici realizzati e usati in ambiti formativi ben circoscritti1. In particolare, tratteremo di sistemi hardware e software da noi sviluppati e adoperati nella formazione professionale sulla legge 626 (sicurezza nei luoghi di lavoro), nell'insegnamento della Biologia Evoluzionistica a degli studenti di un liceo scientifico napoletano, in un corso introduttivo di Psicologia Sociale dei piccoli gruppi; all'addestramento di insegnanti, amministratori pubblici, manager aziendali nella conduzione di un negoziato; alla divulgazione di nozioni e concetti relativi alle politiche fiscali adottate da uno stato. Tutti i prototipi presentati condividono due principi di base: a) sono stati pensati, progettati e realizzati come dei laboratori dove 1 La maggior parte degli applicativi sono scaricabili presso il sito web del Laboratorio di Sistemi Intelligenti dell'Università Federico II di Napoli al seguente link: www.isl.unina.it/EduGames. I software sono essenzialmente dei prototipi da utilizzare in contesti molto delimitati, quindi si potrebbero presentare dei problemi di configurazione e/o istallazione. Gli eventuali utenti possono richiedere assistenza e segnalare i malfunzionamenti al webmaster del suddetto sito.","authors":["Orazio Miglino","Andrea Di Ferdinando","Angelo Rega","Michela Ponticorvo"],"meta":["January 2007Sistemi Intelligenti","DOI:10.1422/24107"],"references":["245440540_Econets_Neural_networks_that_learn_in_an_environment","320609615_Capire_la_realta_simulandola","302325884_Cellular_Automata_in_an_Artificial_Life_perspective","274082170_Simulare_la_mente","237044580_Parallel_Distributed_Processing_Explorations_in_the_Microstructure_of_Cognition","233823073_Scienze_della_mente","229091445_Mente_i_nuovi_modelli_della_Vita_Artificiale","220689401_An_Introduction_to_Genetic_Algorithms_MIT_Press_Cambridge","215459436_Adaptation_in_Natural_and_Artificial_Systems_An_Introductory_Analysis_With_Applications_to_Biology_Control_and_Artificial_Intelligence"]}