{"id":"237617311_UM_ESTUDO_EXPLORATORIO_PARA_A_INSERCAO_DA_ASTRONOMIA_NA_FORMACAO_DE_PROFESSORES_DOS_ANOS_INICIAIS_DO_ENSINO_FUNDAMENTAL","abstract":"A pesquisa aqui descrita objetivou identificar padrões relativos às perspectivas dos professoresdos anos iniciais do Ensino Fundamental em relação ao ensino da Astronomia, bem como as expectativasdos mesmos sobre uma possível inserção deste tema na formação de docentes. A pesquisa,de natureza qualitativa, foi norteada por uma revisão crítica da literatura e pela aplicação dastécnicas de entrevistas semi-estruturadas a uma amostra de cinco professores predominantementeda Escola Pública. As representações dos docentes sobre temas astronômicos e as abordagens desuas inquietações em relação ao ensino da Astronomia foram interpretadas ao final da investigaçãomediante a análise de seus discursos. A análise dos dados obtidos neste estudo fornece subsídiospara a implementação de um programa de educação continuada, visando uma mudança de posturana prática pedagógica dos docentes.","authors":["Rodolfo Langhi","Roberto Nardi"],"meta":["July 2004Tecné Episteme y Didaxis TED","DOI:10.17227/ted.num16-5543","Project: The dialogue between the academic production in Science Teaching and the knowledge and teaching practices in different levels of education and educational spaces"],"references":["343136612_LICOES_DA_ESCURIDAO_ou_REVISITANDO_VELHOS_FANTASMAS_DO_FAZER_E_DO_ENSINAR_CIENCIA","317613329_Disciplinas_introdutorias_de_Astronomia_nos_cursos_superiores_do_Brasil","272756578_Novas_tendencias_em_Analise_do_Discurso","255640144_Third_grade_students'_ideas_about_lunar_phases","252467865_Where_Are_the_Young_Astronomers","248974600_Students'_conceptions_and_the_learning_of_science","247889636_The_Generative_Learning_Model_and_its_Implications_for_Science_Education","245656138_Children's_understanding_of_familiar_astronomical_events","242168933_ANALISE_DO_CONTEUDO_DE_ASTRONOMIA_DE_LIVROS_DE_GEOGRAFIA_DE_1O_GRAU","234498187_The_Universe_at_Your_Fingertips_an_Activity_and_Resource_Notebook_for_the_Teaching_of_Astronomy"]}