{"id":"237654136_Understanding_Relationship_Marketing_Outcomes_An_Integration_of_Relational_Benefits_and_Relationship_Quality","abstract":"The importance of developing and maintaining enduring relationships with customers of service businesses is generally accepted in the marketing literature. A key challenge for researchers is to identify and understand how managerially controlled antecedent variables influence important relationship marketing outcomes (e.g., customer loyalty and word-of-mouth communication). Relational benefits, which have a focus on the benefits consumers receive apart from the core service, and relationship quality, which focuses on the overall nature of the relationship, represent two approaches to understanding customer loyalty and word of mouth. This article integrates these two concepts by positioning customer satisfaction and commitment as relationship quality dimensions that partially mediate the relationship between three relational benefits (confidence benefits, social benefits, and special treatment benefits) and the two outcome variables. The results provide support for the model and indicate that the concepts of customer satisfaction, commitment, confidence benefits, and social benefits serve to significantly contribute to relationship marketing outcomes in services.","authors":["Thorsten Hennig-Thurau","Kevin P. Gwinner","Dwayne D. Gremler"],"meta":["February 2002Journal of Service Research 4(3):230-247","DOI:10.1177/1094670502004003006"],"references":["280300265_Friendship_over_the_counter_How_social_aspects_of_service_encounters_influence_consumer_service_loyalty","272582450_Powerful_Suppliers_Vulnerable_Resellers_and_the_Effects_of_Supplier_Fairness_A_Cross-National_Study","301840761_A_Model_of_Distributor_Firm_and_Manufacturer_Firm_Working_Partnerships","290636553_Why_Customers_Build_Relationships_with_Companies_-_and_Why_Not","285195262_Patronage_and_Loyalty_Strategies_Understanding_the_Behavioral_and_Attitudinal_Outcomes_of_Customer_Retention_Programs","284908006_Service","284659809_Relationship_marketing","284405235_A_classification_of_switching_costs_with_implications_for_relationship_marketing","280901248_An_Examination_of_the_Nature_of_Trust_in_Buyer-Seller_Relationships","280799097_Customer_Satisfaction_A_Meta-Analysis_of_the_Empirical_Evidence"]}