{"id":"237718864_Learner_motivation_and_E-learning_design_A_multinationally_validated_process","abstract":"A general model for motivational design of instruction is described and reviewed in terms of its application to E-learning contexts. Following a description of what is meant by E-learning environments and an overview of the four category model and design process known as the ARCS model, a variety of studies are summarized. The ARCS model is based on a synthesis of motivational concepts and a problem-solving approach to design, rather than the application of specific motivational solutions that are advocated without regard to the specific characteristics of a given situation. The first group of reviewed studies illustrates the results of testing the motivational design process in several different E-learning settings, in relation to learner self-regulation and in terms of the interaction of personality characteristics and motivational strategies. The second group of studies includes tests of the validity of a simplified motivational design process that has been used in diverse types of E-learning settings, including multiple countries and cultures. Overall, the results of these empirical studies have confirmed the validity of this model for the systematic design of motivationally enhanced instruction in E-learning settings with regard to lowering drop-out rates and other positive motivational outcomes.","authors":["John M Keller","Katsuaki Suzuki"],"meta":["October 2004Journal of Educational Media 29(3):229-239","DOI:10.1080/1358165042000283084"],"references":["339314446_THE_DEVELOPMENT_OF_MOTIVATIONAL_COMMUNICATION_IN_DISTANCE_EDUCATION_SUPPORT","270346593_Achievement_Motivation_and_Attribution_Theory","321609796_Designing_Environments_for_Constructive_Learning","317953663_Self-Efficacy_Toward_a_Unifying_Theory_of_Behavioral_Change","316807278_Intrinsic_Motivation_and_Self-Determination_in_Human_Behavior","313194384_Continuing_Motivation_An_Analysis_of_a_Seldom_Considered_Educational_Outcome","279905249_Inequity_In_Social_Exchange","271727880_The_Development_of_a_Model_for_the_Design_of_Motivational_Adult_Instruction_in_Higher_Education","255650277_Best_Practices_in_Cyberspace_Motivating_the_Online_Learner","253605937_The_Effects_of_Situation-Outcome-Expectancies_and_of_ARCS-Strategies_on_Self-Regulated_Learning_with_Web-Lectures"]}