{"id":"237702273_The_Large_Synoptic_Survey_Telescope_LSST","abstract":"The Large Synoptic Survey Telescope (LSST) will be a large, wide-field ground-based telescope designed to obtain sequential images of the entire visible sky every few nights. The optical design involves a novel 3-mirror system with an 8.4 m primary, which feeds three refractive correcting elements inside a camera, thereby providing a 7 square degree field of view sampled by a 2.3 Gpixel focal plane array. The total system throughput, AΩ = 270 m2 deg2, is nearly two orders of magnitude larger than that of any existing facility. LSST will enable a wide variety of complementary scientific investigations, all utilizing a common database. These range from searches for small bodies in the solar system to the first systematic monitoring campaign for transient phenomena in the optical sky. Of particular interest to high energy physics, LSST images can be co-added to provide a weak lensing survey of the entire sky with unprecedented sensitivity. Measurement of the dark matter power density spectrum through weak lensing will provide tight constraints on models of dark energy, such as the equation of state parameter, w, and its derivative with respect to cosmic time. These constraints are complementary to those which will come from other approaches to studying dark energy (such as the apparent magnitude redshift relation of Type 1a supernovae), but are sensitive to different aspects of the cosmological model and involve quite different systematics. A collaboration has been formed to launch a design and development program for the LSST, leading to commencement of operations in 2011. This collaboration involves both NSF and DOE funded groups, working together under a common management structure. The DOE effort, which will be led by SLAC with significant components at BNL, LLNL and university-based HEP groups, will take overall responsibility for the LSST camera, the data acquisition system, and aspects of the pipeline software.","authors":["W. Althouse","S. Aronson","T. S. Axelrod","R. Blandford"],"meta":["January 2006"],"references":["222699859_Evidence_for_an_Extended_Scattered_Disk"]}