{"id":"237838282_Online_Controlled_Experiments_at_Large_Scale","abstract":"Web-facing companies, including Amazon, eBay, Etsy, Facebook, Google, Groupon, Intuit, LinkedIn, Microsoft, Netflix, Shop Direct, StumbleUpon, Yahoo, and Zynga use online controlled experiments to guide product development and accelerate innovation. At Microsoft’s Bing, the use of controlled experiments has grown exponentially over time, with over 200 concurrent experiments now running on any given day. Running experiments at large scale requires addressing multiple challenges in three areas: cultural/organizational, engineering, and trustworthiness. On the cultural and organizational front, the larger organization needs to learn the reasons for running controlled experiments and the tradeoffs between controlled experiments and other methods of evaluating ideas. We discuss why negative experiments, which degrade the user experience short term, should be run, given the learning value and long-term benefits. On the engineering side, we architected a highly scalable system, able to handle data at massive scale: hundreds of concurrent experiments, each containing millions of users. Classical testing and debugging techniques no longer apply when there are millions of live variants of the site, so alerts are used to identify issues rather than relying on heavy up-front testing. On the trustworthiness front, we have a high occurrence of false positives that we address, and we alert experimenters to statistical interactions between experiments. The Bing Experimentation System is credited with having accelerated innovation and increased annual revenues by hundreds of millions of dollars, by allowing us to find and focus on key ideas evaluated through thousands of controlled experiments. A 1% improvement to revenue equals $10M annually in the US, yet many ideas impact key metrics by 1% and are not well estimated a-priori. The system has also identified many negative features that we avoided deploying, despite key stakeholders’ early excitement, saving us similar large amounts.","authors":["Ron Kohavi","Alex Deng","Brian Frasca","Toby Walker"],"meta":["August 2013","DOI:10.1145/2487575.2488217","Conference: 19th SIGKDD conference on Knowledge Discovery and Data Mining, Chicago, IL"],"references":["254464362_Online_controlled_experiments_introduction_learnings_and_humbling_statistics","237838307_Trustworthy_Online_Controlled_Experiments_Five_Puzzling_Outcomes_Explained","237838291_Improving_the_Sensitivity_of_Online_Controlled_Experiments_by_Utilizing_Pre-Experiment_Data","236345468_SCOPE_parallel_databases_meet_MapReduce","280113401_Make_Data_Useful","270162336_In_The_Structure_of_Scientific_Revolutions","258510769_Statistics_for_experimenters_Design_innovation_and_discovery_2nd_ed","234790583_Do_it_wrong_quickly_how_the_web_changes_the_old_marketing_rules","224285692_How_to_Measure_Anything_Finding_the_Value_of_Intangibles_in_Business","221653329_Overlapping_Experiment_Infrastructure_More_Better_Faster_Experimentation"]}