{"id":"23789023_A_Surgical_Safety_Checklist_to_Reduce_Morbidity_and_Mortality_in_a_Global_Population","abstract":"Surgery has become an integral part of global health care, with an estimated 234 million operations performed yearly. Surgical complications are common and often preventable. We hypothesized that a program to implement a 19-item surgical safety checklist designed to improve team communication and consistency of care would reduce complications and deaths associated with surgery.\nBetween October 2007 and September 2008, eight hospitals in eight cities (Toronto, Canada; New Delhi, India; Amman, Jordan; Auckland, New Zealand; Manila, Philippines; Ifakara, Tanzania; London, England; and Seattle, WA) representing a variety of economic circumstances and diverse populations of patients participated in the World Health Organization's Safe Surgery Saves Lives program. We prospectively collected data on clinical processes and outcomes from 3733 consecutively enrolled patients 16 years of age or older who were undergoing noncardiac surgery. We subsequently collected data on 3955 consecutively enrolled patients after the introduction of the Surgical Safety Checklist. The primary end point was the rate of complications, including death, during hospitalization within the first 30 days after the operation.\nThe rate of death was 1.5% before the checklist was introduced and declined to 0.8% afterward (P=0.003). Inpatient complications occurred in 11.0% of patients at baseline and in 7.0% after introduction of the checklist (P<0.001).\nImplementation of the checklist was associated with concomitant reductions in the rates of death and complications among patients at least 16 years of age who were undergoing noncardiac surgery in a diverse group of hospitals.","authors":["Alex B Haynes","Thomas G Weiser","William R Berry","Stuart R Lipsitz"],"meta":["January 2009New England Journal of Medicine 360(5):491-9","DOI:10.1056/NEJMsa0810119","SourcePubMed"],"references":["23254762_Surgical_team_behaviors_and_patient_outcomes","312922141_Classification_of_surgical_complications_a_new_proposal_with_evaluation_in_a_cohort_of_6336_patients_and_108_results_of_a_survey","285837376_An_estimation_of_the_global_volume_of_surgery_A_modeling_strategy_based_on_available_data","277370316_Classification_of_Surgical_Complications","265326975_In_Statistical_Methods_for_Rates_and_Proportions","256645054_The_timing_of_prophylactic_administration_of_antibiotics_and_the_risk_of_surgical-wound_infection","232431504_The_Social_Problems_Of_An_Industrial_Civilization","21426518_The_Timing_of_Prophylactic_Administration_of_Antibiotics_and_the_Risk_of_Surgical-Wound_Infection","21400583_Antibiotic_Prophylaxis_in_Orthopedic_Surgery","20751763_Perioperative_Antibiotic_Prophylaxis_for_Herniorrhaphy_and_Breast_Surgery"]}