{"id":"238608103_Inadequate_Evidence_for_Multiple_Intelligences_Mozart_Effect_and_Emotional_Intelligence_Theories","abstract":"I (Waterhouse, 2006) argued that, because multiple intelligences, the Mozart effect, and emo- tional intelligence theories have inadequate empirical support and are not consistent with cog- nitive neuroscience findings, these theories should not be applied in education. Proponents countered that their theories had sufficient empirical support, were consistent with cognitive neuroscience findings, and should be applied in education (Cherniss, Extein, Goleman, & Weissberg, 2006; Gardner & Moran, 2006; Rauscher & Hinton, 2006). However, Gardner and Moran offered no validating evidence for multiple intelligences, Rauscher and Hinton con- cluded that \"listening-to-Mozart\" studies should be disregarded, and Cherniss, Extein, Goleman, and Weissberg agreed that emotional intelligence lacked a unitary empirically sup- ported construct. My reply addresses theory proponents' specific criticisms of my review and reasserts my original claims. In \"Multiple Intelligences, the Mozart Effect, and Emotional Intelligence: A Critical Review\" (Waterhouse, 2006), I ar- gued that \"MI theory has no validating data … the Mozart ef- fect theory has more negative than positive findings, and EI theory lacks a unitary empirically supported construct.\" I also argued that these theories' brain system claims were not consistent with relevant cognitive neuroscience findings and concluded that until these theories have garnered reasonable evidentiary support they should not be applied in education. Theory proponents counterargued that their theories were","authors":["Lynn Waterhouse"],"meta":["December 2006Educational Psychologist 41(4):247-255","DOI:10.1207/s15326985ep4104_5"],"references":["283803351_The_Validity_and_Utility_of_Selection_Methods_in_Personnel_Psychology_Practical_and_Theoretical_Implications_of_85_Years_of_Research_Findings","344083240_Mozart_and_the_Mind","328245084_Plate_Tectonics_An_Insider's_History_of_the_Modern_Theory_of_the_Earth","299066229_The_theory_of_multiple_intelligences_A_case_of_missing_cognitive_matter_-_Response_to_Nicholas_Allix","299037708_When_and_where_do_we_apply_what_we_learn_A_taxonomy_for_far_transfer","289963831_Why_g_matters_The_complexity_of_everyday_life","289963465_Why_g_matters_The_complexity_of_everyday_life","283384365_Memory_From_Mind_to_Molecules","275493430_The_Theory_of_Multiple_Intelligences_A_Case_of_Missing_Cognitive_Matter","274574190_Learning_to_Make_Music_Enhances_Spatial_Reasoning"]}