{"id":"238691576_Human-Centered_Vs_User-Centered_Approaches_to_Information_System_Design","abstract":"Despite continuing debates about the \"user\" emphasis in HCI, new design approaches, such as interaction design, continue to focus on humans as technology users, constraining the human-centeredness of design outcomes. This paper argues that the difference between \"user\" focus and a human-centered focus lies in the way in which technology is designed. The emphasis on problem closure that is embedded in current approaches to designing information systems (IS) precludes an examination of those issues central to human-centered design. The paper reviews recent approaches to user-centered IS design and concludes that these methods are targeted at the closure of technology-centered problems, rather than the investigation of suitable changes to a system of human- activity supported by technology. A dual-cycle model of human-centered design is presented, that balances systemic inquiry methods with human-centered implementation methods. The paper concludes with a suggestion that IS design should be viewed as a dialectic between organizational problem inquiry and the implementation of business process change and technical solutions.","authors":["Susan Gasson"],"meta":["January 2003Journal of Information Technology Theory and Application 5(2):29-46","SourceOAI"],"references":["339309498_Design_for_people_at_work","313597543_An_improvisational_model_for_change_management_The_case_of_groupware_technologies","313515861_Introductory_Essay","300233244_Information_Technology_and_Changes_in_Organizational_Work_Images_and_Reflections","288947775_Research_commentry_Desperately_seeking_the_IT_in_IT_research_-_A_call_to_theorizing_the_IT_artifact","285895447_Introductory_essay_The_social_shaping_of_technology","276055999_The_New_Science_of_Management_Decision","275616203_Continual_Permutations_of_Action","271506262_The_Theory_of_Communicative_Action_Volume_1_Reason_and_the_Rationalization_of_Society_Volume_2_The_Critique_of_Functionalist_Reason","267921989_The_Duality_of_Technology_Rethinking_the_Concept_of_Technology_in_Organizations"]}