{"id":"238693982_Vers_une_meilleure_maitrise_des_couts_engages_sur_le_cycle_de_vie_lors_de_la_conception_de_produits_nouveaux","abstract":"Mots-clés : conception de produits nouveaux, cycle de vie, évaluation économique, projet. Abstract :.Managing a new product design project on the product life cycle assumes taking into account the consequences of the designers decisions on the future costs and , particularly, the manufacturing costs of the firm. The life cycle cost perspective focuses on the cost comitted during the design and development stages. Evaluating the cost committed during the design and development stages is becoming an important challenge for the firms of the industrial sector and it is during these stages that the main risks involved can be identified and evaluated. Different methods and tools can be used to influence the designers decisions and the cost committed on the life-cycle : Quality Function Deployment, Design For Manufacturing, Value Analysis, Design-to-Cost, risk analysis, standardization…Having introduced theses tools, the purpose of this paper is to underlye the methodological problems when choosing a particuliar set of tools in order to manage the costs incurred and the economic risks involved Key-words: new product design, life-cycle, evaluation, project. L'évolution économique actuelle rend le pilotage économique des projets de conception et développement de produits nouveaux de plus en plus d'actualité. Différentes analyses consta- tent qu'une partie substantielle des coûts récurrents est engendrée par des décisions prises avant que les opérations ne débutent effectivement. En conséquence, un des objectifs importants du pilotage économique des projets de conception et développement des produits nouveaux est d'influencer les décisions qui vont provoquer les dépenses durant le cycle de vie du futur produit. Pour autant, les outils disponibles aujourd'hui, notamment les systèmes traditionnels de comptabilité et de contrôle de gestion, connaissent des limites en matière d'évaluation écono- mique des décisions de conception de produits nouveaux. Ces limites ont été amplement souli- gnées par la littérature (Berliner & Brimson, 1988, (7), ou Lorino 1989, (32), par exemple). Ce constat conduit alors à s'interroger sur l'instrumentation permettant d'évaluer sur un plan économique les décisions de conception. La comparaison de ces décisions complexes met en avant qu'il convient d'évaluer globalement les alternatives en tenant compte des coûts, dans une perspective temporelle la plus large possible, mais aussi des avantages retirés. Or, aucun outil","authors":["Gautier Frederic","Vincent Giard"],"meta":["January 2000Comptabilite Controle Audit 6(2)","DOI:10.3917/cca.062.0043"],"references":["255648968_Analyse_economique_de_la_standardisation_des_produits","344966624_Target_Costing_and_Value_Engineering","298527899_Managing_the_design_factory","291976245_A_method_for_predicting_direct_operating_costs_during_aircraft_system_design","285438491_Manufacturing_by_design","285142875_Target_costing_An_integrative_management_process","282913731_Activity_Accounting_An_Electronics_Industry_Implementation","269488654_The_Management_Control_Function","247645476_The_power_of_product_platforms_Building_value_and_cost_leadership","247645430_Agile_product_development_for_mass_customization_how_to_develop_and_deliver_products_for_mass_customization_niche_markets_JIT_build-to-order_and_flexible_manufacturing"]}