{"id":"238698400_Bilingual_Children's_Mother_Tongue_Why_Is_It_Important_for_Education","abstract":"The term globalization is never far from the front pages of newspapers these days. It evokes strong positive or negative feelings depending upon whether it is being praised by the business community for opening up world markets to more extensive trade or condemned by those who associate the term with the dramatically widening gap between rich and poor nations and people. One aspect of globalization that has important implications for educators is the increasing movement of people from one country to another. Population mobility is caused by many factors: desire for better economic conditions, the need for labour in many countries that are experiencing low birthrates, a constant flow of refugees resulting from conflicts between groups, oppression of one group by another, or ecological disasters. Economic integration within the EU also encourages the free movement of workers and their families among EU member countries. The fact that travel between countries is now fast and efficient (most of the time) obviously facilitates population mobility. A consequence of population mobility is linguistic, cultural, \"racial\", and religious diversity within schools. To illustrate, in the city of Toronto in Canada, 58% of kindergarten students come from homes where standard English is not the usual language of communication. Schools in Europe and North America have experienced this diversity for many years but it remains controversial, and educational policies and practices vary widely between countries and even within countries. Neo-fascist groups in a number of countries promote overtly racist policies in relation to immigrant and culturally diverse communities. Other political parties and groups adopt a somewhat more enlightened orientation and search for ways to \"solve the problem\" of diverse communities and their integration in schools and society. However, they still define the presence of diverse communities as a \"problem\" and see few positive consequences for the host society. They worry that linguistic, cultural, \"racial\" and religious diversity threaten the identity of the host society. Consequently, they promote educational policies that will make the \"problem\" disappear. Whereas neo-fascist groups advocate expulsion of immigrants or at least exclusion from the mainstream of society (e.g. in largely segregated schools and housing areas), more liberal groups advocate assimilation into the mainstream of society. However, \"assimilation\" is similar in many ways to \"exclusion\" insofar as both orientations are designed to make the \"problem\" disappear. Under both policies, culturally diverse groups will no longer be visible or audible. Assimilationist policies in education discourage students from maintaining their mother tongues. If students retain their culture and language, then they are viewed as less capable of identifying with the mainstream culture and learning the mainstream language of the society.","authors":["Jim Cummins"],"meta":["January 2001"],"references":[]}