{"id":"238763080_The_SHL_Universal_Competency_Framework","abstract":"The SHL Universal Competency Framework (UCF) presents a state-of-the-art perspective on competencies and underpins all of SHL’s products and services. The framework incorporates a model of performance at work that defines the relationships between competency potential, competency requirements and competencies themselves. \n\nThe SHL UCF, supported by the UCF Database (UCFD) provides a comprehensive and easy to use resource for the development and analysis of competency models across a range of industries and locations. It points to ways in which people and their work setting interact, and it has implications for how performance in the work place can be managed. \n\nSince 2001, the UCF has been used to create 403 new competency models by 299 consultants working in 24 different countries with 117 client organisations. In most cases it has been used to assist major clients in building their own integrated corporate competency models. It has also been used to map existing client models.\n\nIt provides the ability to produce tailored competency models quickly and efficiently from a standard set of components. It reduces reliance on the particular skills and abilities of individual consultants or employees and produces a more consistent, high quality product for client organizations.\n\nThis paper explains the definition of competencies and how the UCF was built. It also outlines the key benefits of using a model for competencies and how such a model can be used to assess people in the workplace and, ultimately, to improve organizational performance.","authors":["Dave Bartram"],"meta":["January 2006"],"references":["313154809_Below_the_surface_personality_and_knowledge_sharing","237681604_The_SHL_Corporate_Leadership_Model","228053372_Competency_and_Individual_Performance_Modelling_the_World_of_Work","7453309_The_Great_Eight_Competencies_A_Criterion-Centric_Approach_to_Validation","227865725_Assessment_in_Organisations"]}