{"id":"238732527_Learning_with_multimedia_Engaging_students_in_constructivist_learning","abstract":"The integration of technology into the curriculum has opened up the classroom to accommodate more flexible teaching methods that result not only in more engaged student learning processes, but also in the changing roles of the teacher and student. As such, technology-backed learning environments have enhanced student learning and the learn- ing process, and enabled students to access information, develop applications and commu- nicate with one another, making learning an active process.In this paper, a multimedia-based project was given to a class of 2nd year students in the faculty of Cre- ative Multimedia (FCM) attending an Interactive Multimedia Course. The task was to design and build a multimedia project using the appropriate tools as a course project. Stu- dents worked in groups in this learning environment using the multimedia development process (MDP) to complete the project. The learning process is structured towards The Constructivist Learning Approach. INTRODUCTION: LEARNING WITH MULTIMEDIA Multimedia is changing the way we communicate with each other. This has introduced important changes in our educational system and impact the way we communicate information to the learners. With multimedia, users have the flexi- bility to use this technology in numerous ways in the classroom. Because of its multi-sensory ability, multimedia can be used as an instructional tool to repre- sent and present concepts and ideas using the various media types such as test, images, sound, animation and video. Thus multimedia can be used to enhance traditional \"chalk-and-talk\" method of teaching through multimedia-based instructional strategies. The evolution of multimedia has made it very possible for learners to become involved in their Work. With multimedia technologies, they can create multime- dia applications as part of their project requirements. This would make them active participants in their own learning process, instead of just being passive learners of the educational content. Multimedia application design offers new insights into the learning process of the designer and forces him or her to repre-","authors":["Mai Neo"],"meta":["January 2007"],"references":[]}