{"id":"239146620_A_dynamic_analysis_of_the_interplay_between_asynchronous_and_synchronous_communication_in_online_learning_The_impact_of_motivation","abstract":"With the increased affordances of synchronous communication tools, more opportunities for online learning to resemble face-to-face settings have recently become available. However, synchronous communication does not afford as much time for reflection as asynchronous communication. Therefore, a combination of synchronous and asynchronous communication in e-learning would seem desirable to optimally support learner engagement and the quality of student learning. It is still an open question though, how to best design online learning with a blend of synchronous and asynchronous communication opportunities over time. Few studies have investigated the relationship between learners' actual use of synchronous and asynchronous communication over time. Therefore, this study addressed that relationship in an online course (N = 110), taking into account student motivation, and employing a dynamic inter-temporal perspective. In line with our assumptions, we found some support for the expected association between autonomous motivation and engagement in asynchronous and synchronous communication, be it restricted primarily to the first course period. Also, positive relations between engagement in synchronous and asynchronous communication were found, with the strongest influence from using asynchronous to synchronous communication. This study adds to the knowledge base needed to develop guidelines on how synchronous communication can be combined with asynchronous learning.","authors":["Bas Giesbers","Bart Rienties","Dirk Tempelaar","Wim Gijselaers"],"meta":["June 2013Journal of Computer Assisted Learning","DOI:10.1111/jcal.12020"],"references":["313809657_THE_DEVELOPMENT_OF_A_COMMUNITY_OF_INQUIRY_OVER_TIME_IN_AN_ONLINE_COURSE_UNDERSTANDING_THE_PROGRESSION_AND_INTEGRATION_OF_SOCIAL_COGNITIVE_AND_TEACHING_PRESENCE","284701129_The_development_of_a_Community_of_Inquiry_over_time_in_an_online_course_Understanding_the_progression_and_integration_of_social_cognitive_and_teaching_presence","316807278_Intrinsic_Motivation_and_Self-Determination_in_Human_Behavior","313706668_Blended_learning_systems_Definition_current_trends_and_future_directions","313667086_Problem-based_learning","289963001_Intrinsic_and_Extrinsic_Motivations_Classic_Definition_and_New_Directions","285088849_Self-_Determination_theory","283378533_Barriers_and_Biases_in_Computer-Mediated_Knowledge_Communication_And_How_They_May_Be_Overcome","278666660_How_Do_Students_Participate_in_Synchronous_and_Asynchronous_Online_Discussions","267378972_Computer-Mediated_Communications_Technologies"]}