{"id":"2392443_Extended_Temporal_Logic_Revisited","abstract":"A key issue in the design of a model-checking tool is the choice of the formal language with which properties are specified. It is now recognized that a good language should extend linear temporal logic with the ability to specify all !-regular properties. Also, familiar with finite-state machines, designers prefer extensions based on automata than these based on fixed points or propositional quantification. Early extensions of linear temporal logic with automata use nondeterministic Buchi automata. Their drawback has been inability to refer to the past and the asymmetrical structure of nondeterministic automata. In this work we study an extension of linear temporal logic, called ETL 2a , that uses twoway alternating automata as temporal connectives. Two-way automata can traverse the input word back and forth and they are exponentially more succinct than one-way automata. Alternating automata combine existential and universal branching and they are exponentially more succinct than nondeterministic automata. The rich structure of two-way alternating automata makes ETL 2a a very powerful and convenient logic. We show that ETL 2a formulas can be translated to nondeterministic Buchi automata with an exponential blow up. It follows that the satisfiability and model-checking problems for ETL 2a are PSPACE-complete, as are the ones for LTL and its earlier extensions with automata. So, in spite of the succinctness of two-way and alternating automata, the advantages of ETL 2a are obtained essentially for free. The recent acceptance of alternating automata by the industry and the development of symbolic procedures for handling them make us optimistic about the practicality of ETL 2a . Address: School of Computer Science and Engineering, Hebrew University, Jerus...","authors":["Orna Kupferman","Nir Piterman","Moshe Vardi"],"meta":["January 2002","DOI:10.1007/3-540-44685-0_35","Conference: Proceedings of the 12th International Conference on Concurrency Theory"],"references":["234816535_A_temporal_fixpoint_calculus","277296479_Extending_Temporal_Logic_With_Omega-Automata","263808401_Temporal_and_Modal_Logic_Handbook_of_Theoretical_Computer_Science","248599661_In_transition_from_global_to_modular_reasoning_about_programs","247882810_The_For-Spec_temporal_logic_A_new_temporal_property-specification_logic","243781940_Symbolic_refinement_checking_with_nondeterministic_BDDs","243772011_Hierarchical_development_of_concurrent_systems_in_a_framework","242367571_Weak_monadic_second_order_theory_of_succesor_is_not_elementary-recursive","237128841_The_Temporal_Logic_of_Reactive_and_Concurrent_Systems_Safety","234801957_In_Transition_From_Global_to_Modular_Temporal_Reasoning_about_Programs"]}