{"id":"239389519_Numerical_Investigation_of_Flow_Hydrodynamics_in_a_Channel_with_a_Series_of_Groynes","abstract":"The flow hydrodynamics in a straight open channel containing a multiple-embayment groyne field on one of its sides is investigated numerically using large eddy simulation. The vertical groynes are fully emerged. The mean flow depth in the groyne region is about half that of the main channel and the length and width of the embayments are much larger than the mean depth in the embayment region. The model is validated using mean velocity and turbulent fluctuations data collected at the free surface in a previous experimental study. It is found that despite the fact that the flow inside the main recirculation eddy in the embayments can be characterized as being quasi-two dimensional, the flow inside the mixing layer region between the embayments and the channel is strongly nonuniform over the depth. As this region controls the mass exchange processes between the groyne field and the main channel, a three-dimensional description of the flow in this area is essential. The large-scale eddies that populate the mixing layer can penetrate the embayment region over lateral distances of the order of the channel depth. These eddies advect with them channel fluid inside the. embayment. Eventually, the channel fluid is mixed with the embayment fluid by the small scales. The other main mixing mechanism is due to the injection of patches of high-vorticity mixing-layer fluid near the tip of the downstream groyne and their subsequent convection in the form of a wall-attached jet-like flow into the embayment, first parallel to the downstream groyne face and then to the sidewall. It is shown that on average, most of the fluid leaves the embayment region via the top layer of the embayment-channel interface (upstream half) and enters the embayment region at levels situated around the middepth (practically over the whole length of the embayment) of the interface surface. This explains why the mass exchange coefficients are overestimated when predicted using methods that employ floating particles as a tracer. The instantaneous bed shear stress inside the cavity is found to peak close to the downstream groyne face of each embayment and to show a high variability around the mean values due to the interaction of the mixing layer eddies with the tip of the groynes and the formation of the jet-like flow parallel to the droyne face.","authors":["Andrew Willam McCoy","George Constantinescu","Larry Weber"],"meta":["February 2008Journal of Hydraulic Engineering 134(2)","DOI:10.1061/(ASCE)0733-9429(2008)134:2(157)"],"references":["245296620_Three_Dimensional_Numerical_Model_for_Flow_Through_Natural_Rivers","242362263_2-D_Particle_Tracking_to_Determine_Transport_Characteristics_in_Rivers_with_Dead_Zones","238391012_A_numerical_investigation_of_coherent_structures_and_mass_exchange_processes_in_channel_flow_with_two_lateral_submerged_groynes","300015802_The_complex_flow_in_groyne_fields_numerical_modelling_compared_with_experiments","249281209_A_study_of_phytoplankton_spatial_distributions_flow_structure_and_characteristics_of_mixing_in_a_river_reach_with_groynes","245296829_Exchange_Processes_between_a_River_and_Its_Groyne_Fields_Model_Experiments","245295160_Two-Equation_Turbulence_Model_for_Flow_in_Trenches","235432656_Organized_Oscillations_of_Initially_Turbulent_Flow_past_a_Cavity","225752372_Exchange_Processes_in_a_Channel_with_Two_Vertical_Emerged_Obstructions","222545068_A_numerical_method_for_large-eddy_simulation_in_complex_geometries","43262213_Experiment_in_Stream_Restoration"]}