{"id":"239397705_Using_RP_to_promote_collaborative_design_of_customised_medical_implants","abstract":"Purpose – The last decade has seen major advances in rapid prototyping (RP), with it becoming a multi-disciplinary technology, crossing various research fields, and connecting continents. Process and material advancements open up new applications and manufacturing (through RP) is serving non-traditional industries. RP technology is used to support rapid product development (RPD). The purpose of this paper is to describe how the Integrated Product Development research group of the Central University of Technology, Free State, South Africa is applying various CAD/CAM/RP technologies to support a medical team from the Grootte Schuur and Vincent Palotti hospitals in Cape Town, to save limbs – as a last resort at a stage where conventional medical techniques or practices may not apply any longer. Design/methodology/approach – The paper uses action research to justify the proposal of a new method to use CAD/CAM/RP related technologies to substitute lost/damaged bone regions through the use of CT to CAD to.STL manipulation. Findings – A case study where RP related technologies were used to support medical product development for a patient with severe injuries from a road accident is discussed. Originality/value – The paper considers current available technologies, and discusses new advancements in direct metal freeform fabrication, and its potential to revolutionise the medical industry.","authors":["M. Truscott","Dj De Beer","George Vicatos","Keith Hosking"],"meta":["April 2007Rapid Prototyping Journal 13(2):107-114","DOI:10.1108/13552540710736795"],"references":["239397690_Design_for_medical_rapid_prototyping_of_cranioplasty_implants","313136421_Fundamentals_of_modern_manufacturing_materials_process_and_systems","245340520_Fabrication_of_customised_maxillo-facial_prosthesis_using_computer-aided_design_and_rapid_prototyping_techniques","245340508_The_use_of_rapid_prototyping_to_assist_medical_applications","242336670_RP_in_medicine_A_case_study_in_cranial_reconstructive_surgery","241699756_Customized_design_and_manufacturing_of_chin_implant_based_on_rapid_prototyping","241407530_Rapid_manufacture_of_removable_partial_denture_frameworks","239397699_Rapid_manufacturing_of_patient-specific_shielding_masks_using_RP_in_parallel_with_metal_spraying","235271050_Design_and_fabrication_of_CAP_scaffolds_by_indirect_solid_free_form_fabrication","235267957_Anaesthetic_mouthpiece_development_through_QFD_and_customer_interaction_with_functional_prototypes"]}