{"id":"239374921_Efficient_development_of_web_applications_for_remote_participation_using_Ruby_on_Rails","abstract":"Large-scale experiments such as ITER require international collaboration, and remote participation plays an important role in carrying out such experiments. Web-based applications are useful tools for scientists participating in experiments remotely using personal computers. Since the participants typically download web-based applications to their computer each time they access the web servers, they do not need to install extra software in order to use these applications. In addition, the application developers do not need to distribute the latest program files each time they are modified, thus reducing maintenance costs for remote participation systems.For these reasons, we have been developing web-based applications for the LHD experiments at NIFS. In a previous study, we showed the benefits of using Ruby on Rails (RoR) to develop web-based applications for analysis code. We thought this approach would also be useful for developing applications for remote participation. Therefore, we have developed several web-based applications using RoR for participating in the LHD experiments. These applications include a data viewer and a scheduler of experiments. The main reason to adopt RoR for this purpose is its efficiency for developing web-based applications. For example, to develop a data viewer, we used an existing program running on an X-Windows System. Using RoR, we could minimize the modifications of the existing programs to add web interfaces.In this paper, we will report a web-based application developed using RoR for the LHD experiment. We will also discuss the benefits of using RoR in developing remote participation tools.","authors":["M. Emoto","M. Yoshida","C. Iwata","Shigeru Inagaki"],"meta":["July 2010Fusion Engineering and Design 85(3):622-624","DOI:10.1016/j.fusengdes.2010.03.065"],"references":["223878120_Control_data_acquisition_data_analysis_and_remote_participation_in_LHD","223025683_Overview_of_the_TJ-II_remote_participation_system","32181328_Web_interface_for_plasma_analysis_codes","30866188_Portability_improvement_of_LABCOM_data_acquisition_system_for_the_next-generation_fusion_experiments"]}