{"id":"239321680_Approximate_Distance_Oracles_for_Unweighted_Graphs_in_Expected_On2_Time","abstract":"Let G = (V, E) be an undirected graph on n vertices, and let Δ(u, v) denote the distance in G between two vertices u and v. Thorup and Zwick showed that for any positive integer t, the graph G can be preprocessed to build a data structure that can efficiently report t-approximate distance between any pair of vertices. That is, for any u, v V, the distance reported is at least Δ(u, v) and at most tΔ(u, v). The remarkable feature of this data structure is that, for t3, it occupies subquadratic space, that is, it does not store all-pairs distances explicitly, and still it can answer any t-approximate distance query in constant time. They named the data structure approximate distance oracle because of this feature. Furthermore, the trade-off between the stretch t and the size of the data structure is essentially optimal.In this article, we show that we can actually construct approximate distance oracles in expected O(n2) time if the graph is unweighted. One of the new ideas used in the improved algorithm also leads to the first expected linear-time algorithm for computing an optimal size (2, 1)-spanner of an unweighted graph. A (2, 1) spanner of an undirected unweighted graph G = (V, E) is a subgraph (V, ), E, such that for any two vertices u and v in the graph, their distance in the subgraph is at most 2Δ(u, v) + 1.","authors":["Surender Baswana","Sandeep Sen"],"meta":["October 2006ACM Transactions on Algorithms 2(4):557-577","DOI:10.1145/1198513.1198518","SourceDBLP"],"references":["234785685_New_constructions_of_a_b-spanners_and_purely_additive_spanners","226461725_All-Pairs_Nearly_2-Approximate_Shortest-Paths_in_On2_polylog_n_Time","225345380_A_Simple_Linear_Time_Algorithm_for_Computing_a_2k-_1-Spanner_of_On11k_Size_in_Weighted_Graphs","222985611_All-Pairs_Small-Stretch_Paths","241928380_A_Simple_Linear_Time_Algorithm_for_Computing_a_2k-1Spanner_of_On11k_Size_in_Weighted_Graphs","228057622_All_Pairs_Almost_Shortest_Paths","225636685_All-Pairs_Shortest_Paths_with_Real_Weights_in_On3log_n_Time","225433799_Extremal_problems_in_graph_theory","225177720_Deterministic_Constructions_of_Approximate_Distance_Oracles_and_Spanners","222963965_A_new_approach_to_all-pairs_shortest_paths_on_real-weighted_graphs"]}