{"id":"239427366_Integration_of_ICT_within_a_project-based_learning_environment","abstract":"An enormous challenge is presented to engineering educators by the rapidly changing world of information and communication technologies (ICT). It is essential that students acquire high-quality ICT experience before emerging into the real world of employment. The overall impact of ICT on teaching and learning at the current time, however, is largely through the conversion of conventional lecture notes to static documents, which are made available to students on the web. Project-based learning, by comparison, can provide students with the opportunity to work with emerging technologies and also gain important industrial experience. The first part of this paper presents a summary of the challenges that ICT presents third-level institutions through an examination of the pedagogical issues (and solutions) that arise from a move from traditional lectures to projectbased teaching. This introductory material is followed by the main bulk of the paper, i.e. two case studies. The first is an account of a short project, which involved the evaluation of commercially available undergraduate teaching material provided on CD-ROM. The second case study describes a more substantial project that began life at undergraduate level in collaboration with an indigenous Irish company involved in software development. This project involved the design and development of an online retailing prototype, which was subsequently developed further and launched as a commercial venture.","authors":["Ivan S. Gibson","Cathal O'Reilly","Michael Hughes"],"meta":["March 2002European Journal of Engineering Education 27(1):21-30","DOI:10.1080/03043790110100182"],"references":["232986160_Assessment_and_the_Promotion_of_Academic_Values","262455712_Learning_To_Teach_in_Higher_Education","245494109_Assessment_Criteria_for_Undergraduate_Project_Work_in_Engineering_Design","245494085_Development_and_Assessment_of_a_Combined_CommunicationsDesign_Course_in_Engineering_Education","243783099_Assessing_Student_Learning_in_Higher_Education","228897481_Group_Project_Work_in_Engineering_Design_-_Learning_Goals_and_their_Assessment"]}