{"id":"239430024_Increasing_ISO_9000_certification_benefits_A_continuous_improvement_approach","abstract":"Purpose\n– To test the strength of the relationship between motivation for seeking ISO 9000 certification, quality culture, management responsibility, and the perceived benefits derived from ISO 9000 certification.\n\nDesign/methodology/approach\n– The research involved the development and application of a survey instrument applied to a sample of 1500 ISO 9000 certified organisations. The response rate was 27 per cent (400 responses). The data was analysed using SPSS for Windows, multivariate functions.\n\nFindings\n– Amongst the major findings is organisations that seek ISO 9000 certification with a proactive approach driven by a continuous improvement strategy are more likely to derive significant business benefits as a result. We also found that organisations can effectively use ISO certification as a means of promoting and facilitating a quality culture, where the quality auditor is an important player in the process.\n\nOriginality/value\n– The paper reinforces the long held anecdotal view that the development of a strong quality culture should precede ISO certification. Yet results also show that ISO certification can promote this culture. We conclude that the motivation for seeking certification would determine which comes first: the quality culture or ISO 9000 certification. The findings are important evidence for managers to make a decision whether to seek ISO 9000 certification or not. Our research results show that ISO 9000 certification can deliver significant business benefits if it is implemented as part of a continuous improvement strategy.","authors":["Mile Terziovski","Damien Power"],"meta":["February 2007International Journal of Quality & Reliability Management 24(2):141-163","DOI:10.1108/02656710710722266"],"references":["324767239_From_ISO_9000_Series_Registration_to_Total_Quality_Management_An_Examination","296832859_Does_ISO_9000_have_an_effect_on_quality_management_practices_An_international_empirical_study","293185689_After_the_Quality_Audit_Closing_the_loop_on_the_audit_process","290803349_Industry_experience_with_ISO_9000","287818730_US_firms_lag_in_meeting_quality_standards","247507152_Does_ISO_9000_Have_an_Effect_on_Quality_Management_Practices","240260533_A_journey_towards_total_quality_management_through_ISO_9000_certification_-_a_Singapore_experience","237763636_A_typology_of_approaches_to_ISO_certification_and_TQM","235288671_Training_of_internal_quality_auditors","234021554_Mutivariate_Data_Analysis"]}