{"id":"239526993_From_boring_to_scoring-A_collaborative_serious_game_for_learning_and_practicing_mathematical_logic_for_computer_science_education","abstract":"In this study, we address the problem of low retention and high dropout rates of computer science university students in early semesters of the studies. Complex and high abstract mathematical learning materials have been identified as one reason for the dropout rate. In order to support the understanding and practicing of core mathematical concepts, we developed a game-based multitouch learning environment in which the need for a suitable learning environment for mathematical logic was combined with the ability to train cooperation and collaboration in a learning scenario. As application domain, the field of mathematical logic had been chosen. The development process was accomplished along three steps: First, ethnographic interviews were run with 12 students of computer science revealing typical problems with mathematical logic. Second, a multitouch learning environment was developed. The game consists of multiple learning and playing modes in which teams of students can collaborate or compete against each other. Finally, a twofold evaluation of the environment was carried out (user study and cognitive walk-through). Overall, the evaluation showed that the game environment was easy to use and rated as helpful: The chosen approach of a multiplayer game supporting competition, collaboration, and cooperation is perceived as motivating and \"fun.\".","authors":["Andreas Schäfer","Jan Holz","Thiemo Leonhardt","Ulrik Schroeder"],"meta":["April 2013Computer Science Education 23:87-111","DOI:10.1080/08993408.2013.778040","Project: collaborative serious games for computer science education"],"references":["262008574_Touch_the_future_The_recent_rise_of_multi-touch_interaction","257431200_Learning_and_Teaching_Styles_in_Engineering_Education","316628351_Understanding_Your_Users","312941050_Collaborative_concept_mapping_at_the_tabletop","311898370_What_do_you_mean_by_collaborative_learning","290827763_Computer_Support_for_Collaboration_and_Learning","284853950_What_do_you_mean_by_'collaborative_learning'_collaborative_learning_Cognitive_and_computational_approaches","284528353_A_Machine-Oriented_Logic_based_on_the_Resolution_Principle","265065127_The_Psychology_Behind_Games","245112823_A_Theory_of_Fun_for_Game_Design"]}