{"id":"239744851_A_Categorical_Perspective_on_Qualitative_Constraint_Calculi","abstract":"In the domain of qualitative constraint reasoning, a subfield of AI which has evolved in the last 25 years, a large number of calculi for efficient reasoning about space and time has been developed. Reasoning problems in such calculi are usually formulated as constraint satisfaction problems. For temporal and spatial reasoning, these problems often have infinite domains, which need to be abstracted to (finite) algebras in order to become computationally feasible. Ligozat (13) has argued that the notion of weak representation plays a crucial rˆ ole: it not only captures the correspondence between abstract relations (in a re- lation algebra or non-associative algebra) and relations in a concrete domain, but also corresponds to algebraically closed constraint networks. In this work, we examine properties of the category of weak representations and treat the relations between partition schemes, non-associative algebras and con- crete domains in a systematic way. This leads to the notion of semi-strong rep- resentation, which captures the correspondence between abstract and concrete relations better than the notion of weak representation does. The slogan is that semi-strong representations avoid unnecessary loss of information. Furthermore, we hope that the categorical perspective will help in the future to provide new insights on the important problem of determining whether algebraic closedness decides consistency of constraint networks.","authors":["Till Mossakowski","Stefan Wolfl"],"meta":[],"references":["276959705_Point_Set_Topological_Spatial_Relations","247590685_Some_Varieties_Containing_Relation_Algebras","283925025_Maintaining_Knowledge_about_Temporal_Intervals","267147303_Qualitative_temporal_and_spatial_reasoning","265354140_Categories_for_the_working_mathematician_2nd_ed","243768073_Abstract_and_Concrete_Categories","235970334_RCC_a_Calculus_for_Region-Based_Qualitative_Spatial_Reasoning","221633419_Combining_Topological_and_Qualitative_Size_Constraints_for_Spatial_Reasoning","221632899_Weak_Composition_for_Qualitative_Spatial_and_Temporal_Reasoning","221605322_Weak_Representations_of_Interval_Algebras","221603300_A_System_for_Reasoning_About_Time","221600758_Categorical_Methods_in_Qualitative_Reasoning_The_Case_for_Weak_Representations","221589979_Using_Orientation_Information_for_Qualitative_Spatial_Reasoning","221471597_Reasoning_about_Binary_Topological_Relations","221449446_Qualitative_Spatial_Reasoning_with_Cardinal_Directions"]}