{"id":"239761323_What_Should_We_Expect_From_Research_Through_Design","abstract":"In this essay, I explore several facets of research through design in order to contribute to discussions about how the approach should develop. The essay has three parts. In the first, I review two influential theories from the Philosophy of Science to help reflect on the nature of design theory, concluding that research through design is likely to produce theories that are provisional, contingent, and aspirational. In the second part, I discuss three possible interpretations for the diversity of approaches to research through design, and suggest that this variation need not be seen as a sign of inadequate standards or a lack of cumulative progress in the field, but may be natural for a generative endeavour. In the final section, I suggest that, rather than aiming to develop increasingly comprehensive theories of design, practice based research might better view theory as annotation of realised design examples, and particularly portfolios of related pieces. Overall, I suggest that the design research community should be wary of impulses towards convergence and standardisation, and instead take pride in its aptitude for exploring and speculating, particularising and diversifying, and - especially - its ability to manifest the results in the form of new, conceptually rich artefacts.","authors":["William W. Gaver"],"meta":["May 2012","DOI:10.1145/2207676.2208538"],"references":["324937048_The_Structure_of_Scientific_Revolutions","324352933_The_Ecological_Approach_to_Visual_Perception","314796675_From_perception_to_experience_from_affordances_to_irresistibles","292397228_Science_and_pseudoscience","287921673_The_Product_Ecology_Understanding_Social_Product_Use_and_Supporting_Design_Culture","287878017_Statement_of_Practice_Curating_and_creating_design_collections_from_Social_Mobiles_to_the_Museum_of_Lost_Interactions_and_Six_Speaking_ChairsI","286202454_Objectivity_Value_Judgment_and_Theory_Choice","284222095_Research_in_Art_and_Design","273112021_The_Character_of_Physical_Law","270162336_In_The_Structure_of_Scientific_Revolutions"]}