{"id":"239765657_Offline_handwritten_character_recognition_using_neural_network","abstract":"Character Recognition (CR) has been an active area of research in the past and due to its diverse applications it continues to be a challenging research topic. In this paper, we focus especially on offline recognition of handwritten English words by first detecting individual characters. The main approaches for offline handwritten word recognition can be divided into two classes, holistic and segmentation based. The holistic approach is used in recognition of limited size vocabulary where global features extracted from the entire word image are considered. As the size of the vocabulary increases, the complexity of holistic based algorithms also increases and correspondingly the recognition rate decreases rapidly. The segmentation based strategies, on the other hand, employ bottom-up approaches, starting from the stroke or the character level and going towards producing a meaningful word. After segmentation the problem gets reduced to the recognition of simple isolated characters or strokes and hence the system can be employed for unlimited vocabulary. We here adopt segmentation based handwritten word recognition where neural networks are used to identify individual characters. A number of techniques are available for feature extraction and training of CR systems in the literature, each with its own superiorities and weaknesses.We explore these techniques to design an optimal offline handwritten English word recognition system based on character recognition. Post processing technique that uses lexicon is employed to improve the overall recognition accuracy.","authors":["Anshul Gupta","Manisha Srivastava","Chitralekha Mahanta"],"meta":["December 2011","DOI:10.1109/ICCAIE.2011.6162113"],"references":["4028747_Offline_cursive_handwriting_recognition_system_based_on_hybrid_Markov_model_and_neural_networks","3193409_Optical_character_recognition_for_cursive_handwriting","294744470_Novel_chaotic_neural_network_and_its_application","281196790_Modified_quadratic_classifier_and_directional_features_for_handwritten_Malayalam_character_recognition","222799975_High_accuracy_character_recognition_algorithm_using_fourier_and_topological_descriptors","222403489_Skew_angle_estimation_for_printed_and_handwritten_documents_using_the_Wigner-Ville_distribution","222346393_Character_recognition_using_Fourier_descriptors_and_a_new_form_of_dynamic_semisupervised_neural_network","222299292_Fusion_of_multiple_handwritten_word_recognition_techniques","29465746_An_Investigation_of_the_Modified_Direction_Feature_for_Cursive_Character_Recognition","4064148_Structure-Context_Based_Fuzzy_Neural_Network_Approach_for_Automatic_Target_Detection","4033338_A_novel_feature_extraction_technique_for_the_recognition_of_segmented_handwritten_characters","3817293_Neural-based_solutions_for_the_segmentation_and_recognition_ofdifficult_handwritten_words_from_a_benchmark_database","3730779_Handwritten_character_recognition_by_Fourier_descriptors_and_neural_network","3660309_A_segmentation_and_recognition_strategy_for_handwritten_phrases"]}