{"id":"239934894_Reading_Attitudes_in_L1_and_L2_and_Their_Influence_on_L2_Extensive_Reading","abstract":"This study examines the relationship between both first language ( L1) and second language (L2) reading attitudes, and learners ' performance in L2 extensive reading. Four reading attitude variables were identified (Comfort, Anxiety, Value, Self-perception), both in L1 and L2, according to learners ' responses to a questionnaire. Results of analyses using these four variables are summarised on two levels. First, the study supports the transfer of the affective domain of reading (attitudes) from L1 to L2. But L2 proficiency does not affect this transfer in the way in which the linguistic threshold hypothesis would predict if this hypothesis were applied to the affective domain. Since this hypothesis explains the transfer of the cognitive domain of reading (i.e. , reading abilities and strategies), these findings suggest that cognitive and affective domains of reading relate differently in L1 and L2. Although the transfer of reading attitude is generally supported, there are different degrees of transferability among different attitude variables: what learners think (Value) is more likely to transfer from L1 to L2 than what they feel (Comfort, Anxiety, Self-perception). Second, from a more pedagogical point of view, the positive feeling towards reading, both in L1 and L2, facilitates learners' performance in extensive reading. Merely thinking that reading is beneficial to oneself does not represent a strong enough motivation. The study has thus demonstrated the importance of understanding learners ' attitudes (particularly feelings) to reading both in L1 and L2 for encouraging L2 learners ' involvement in extensive reading.","authors":["Junko Yamashita"],"meta":["January 2004"],"references":["290808878_Reading_Strategies_in_L1_and_L2_Comparison_of_Four_Groups_of_Readers_with_Different_Reading_Ability_in_L1_and_L2","285364490_Extensive_reading_vs_skills_building_in_an_EFL_context","273303055_A_Longitudinal_Investigation_of_Reading_Attitude_Development_from_Childhood_to_Adulthood","345791745_Reading_and_vocabulary_development_in_a_second_language_A_case_study","297286534_The_ABCs_of_attitudes_toward_reading_Inquiring_about_the_reader's_response","285974506_Second_language_vocabulary_acquisition_A_rationale_for_pedagogy","285503743_On_thresholds_ceilings_and_short-circuits_The_relation_between_L1_reading_L2_reading_and_L2_knowledge","284915295_Acquiring_second_language_vocabulary_through_reading_A_replication_of_the_Clockwork_Orange_study_using_second_language_acquirers","264362673_Do_We_Need_to_Teach_Spelling_The_Relationship_Between_Spelling_and_Voluntary_Reading_Among_Community_College_ESL_Students","264343319_The_Relative_Contribution_of_L2_Language_Proficiency_and_L1_Reading_Ability_to_L2_Reading_Performance_A_Test_of_the_Threshold_Hypothesis_in_an_EFL_Context"]}