{"id":"239940000_EMS-MAC_Energy_Efficient_Contention-Based_Medium_Access_Control_Protocol_for_Mobile_Sensor_Networks","abstract":"Energy efficiency is a key characteristic of modern wireless sensors. Assuming that the transceiver is the most power-consuming\ncomponent of a typical sensor node, then a large advantage can be achieved at the data link layer where the medium access\ncontrol (MAC) protocol controls the usage of the radio unit. Many MAC protocols have been developed for traditional wireless\nnetworks. Given that the sensor network is different from the traditional wireless network in many places, researchers are\nlooking for a MAC protocol that is specifically designed and adapted to the sensor network. Moreover, most of the contributions\nin the wireless sensor network have assumed static nodes. However, some applications in the area of medical care and disaster\nresponse make use of the mobile sensor network. Thus, the present paper studies and simulates the sensor MAC (S-MAC), timeout\nMAC and mobility-aware S-MAC (MS-MAC) protocols in terms of their energy efficiency in different mobility situations. Furthermore,\nan enhancement of the MS-MAC protocol, named as enhanced MS-MAC, is introduced and simulated. The results show that this enhancement\ncan significantly improve the energy efficiency when there is a reasonable packet delivery rate.","authors":["Mahdi Zareei","Alireza Taghizadeh","Rahmat Budiarto","Tat-Chee Wan"],"meta":["November 2011The Computer Journal 54(12):1963-1972","DOI:10.1093/comjnl/bxr053"],"references":["269034135_Stochastic_Properties_of_the_Random_Waypoint_Mobility_Model","268273508_Localization_in_Zigbee-based_Sensor_Networks","263501020_Stochastic_Properties_of_the_Random_Waypoint_Mobility_Model_Modeling_and_Analysis_of_Wireless_Networks_Guest_Editors_Michela_Meo_and_Teresa_A_Dahlberg","222534027_Wireless_Sensor_Networks_A_Survey","221933092_An_energy-efficient_MAC_protocol_for_wireless_sensor_networks","221932961_An_adaptive_energy-efficient_MAC_protocol_for_wireless_sensor_networks","221237732_Enhanced_ranging_using_adaptive_filter_of_ZIGBEE_RSSI_and_LQI_measurement","307760027_Addressing_Mobility_in_Wireless_Sensor_Media_Access_Protocol","220465807_Energy-Efficient_Reprogramming_of_a_Swarm_of_Mobile_Sensors","200495784_Towards_a_classification_of_energy_aware_MAC_protocols_for_Wireless_Sensor_Networks"]}