{"id":"239944574_The_Neural_Ring_An_Algebraic_Tool_for_Analyzing_the_Intrinsic_Structure_of_Neural_Codes","abstract":"Neurons in the brain represent external stimuli via neural codes. These codes often arise from stereotyped stimulus-response maps, associating to each neuron a convex receptive field. An important problem confronted by the brain is to infer properties of a represented stimulus space without knowledge of the receptive fields, using only the intrinsic structure of the neural code. How does the brain do this? To address this question, it is important to determine what stimulus space features can-in principle-be extracted from neural codes. This motivates us to define the neural ring and a related neural ideal, algebraic objects that encode the full combinatorial data of a neural code. Our main finding is that these objects can be expressed in a \"canonical form\" that directly translates to a minimal description of the receptive field structure intrinsic to the code. We also find connections to Stanley-Reisner rings, and use ideas similar to those in the theory of monomial ideals to obtain an algorithm for computing the primary decomposition of pseudo-monomial ideals. This allows us to algorithmically extract the canonical form associated to any neural code, providing the groundwork for inferring stimulus space features from neural activity alone.","authors":["Carina Curto","Vladimir Itskov","Alan Veliz-Cuba","Nora Youngs"],"meta":["June 2013Bulletin of Mathematical Biology 75(9)","DOI:10.1007/s11538-013-9860-3","SourcePubMed"],"references":["346088655_Ideals_Varieties_and_Algorithms_An_Introduction_to_Computational_Algebraic_Geometry_and_Commutative_Algebra","329684375_Algebraic_Statistics_Computational_Commutative_Algebra_in_Statistics","287200207_The_hippocampus_as_a_spatial_map_Preliminary_evidence_from_unit_activity_in_the_freely-moving_rat","274521455_Introduction_to_Commutative_Algebra","268305068_Algebraic_statistics_Computational_commutative_algebra_in_statistics","248390470_Algebraic_Topology","248202984_Undergraduate_Texts_in_Mathematics","245745802_Computations_in_Algebraic_Geometry_with_Macaulay_2","243788326_Characterization_of_f-vectors_of_families_of_convex_sets_in_Rd_part_II_Sufficiency_of_Eckhoff's_conditions","242648091_Hellys_Theorem_and_its_relatives"]}