{"id":"240005707_From_cohomology_in_physics_to_q-connectivity_in_social_science","abstract":"If we wish to be “scientific” in our approach to the Social Sciences then, in some way, we must want to make these disciplines more like the Physical Sciences. But here we meet the immediate snag that our intuition runs away from the thought that, as individual people, we can be adequately described as so many electrons and protons. This also leads to the fear that perhaps Physics is not formulated in such a manner as to show us the heart of its methods, as opposed to the fruits of its labours.\nThis paper is a review of a personal search over many years to find a formulation for physical science which would not do too much violence to accepted theories and yet show a way for its extension and generalization into fields of social science. Since the latter seems to require a language which mathematicians would call “combinatorial”, being concerned with finite sets, it became a search for a mathematical language which would describe certain key properties of the familiar continuum but which would carry these over when that continuum should be replaced by a finite set of points.\nThe language which exhibits these properties is the twentieth-century development of algebraic topology (what used to be called combinatorial topology), and some of its basic concepts are referred to in the first half of the paper.\nFrom this point of view an indication of the role of the cocycle in physics is first developed (although many of the intriguing details are given elsewhere), and this is replaced by the same idea but referred to a relation between finite sets. The notion of the simplicial complex is then developed as the vehicle for that sense of structure which is inherent in either the laws of physics or the behaviour of social systems. The result is that one finds, when applying it to some specific field of enquiry, that it is peculiarly powerful for the representation of social or human activities. It leads too to a view of data which is structural (in a multi-dimensional space) in a way which the statistical view is unable to penetrate. Hopefully the method will help to develop new techniques for understanding, the data of relations.","authors":["R. H. Atkin"],"meta":["April 1972International Journal of Man-Machine Studies 4(2):139-167","DOI:10.1016/S0020-7373(72)80029-4"],"references":["248972424_An_Analysis_of_Urban_Structure_Using_Concepts_of_Algebraic_Topology","267472274_An_introduction_to_projective_geometry","266991005_Elements_of_general_topology","248038508_The_topology_of_the_brain_and_visual_perception","246384606_Homology_Groups_of_Relations","243764666_Mathematical_Structure_in_Human_Affairs","225731301_Abstract_physics","44430937_Theory_of_Categories"]}