{"id":"240156358_Ontology_and_Semantic_Interoperability","abstract":"One of the major problems facing systems for Computer Aided Design (CAD), Architecture Engineering and Construction (AEC) and Geographic Information Systems (GIS) applications today is the lack of interoperability among the vari-ous systems. When integrating software applications, substantial di culties can arise in translating information from one application to the other. In this paper, we focus on semantic di culties that arise in software integration. Applications may use di erent terminologies to describe the same domain. Even when appli-cations use the same terminology, they often associate di erent semantics with the terms. This obstructs information exchange among applications. To cir-cumvent this obstacle, we need some way of explicitly specifying the semantics for each terminology in an unambiguous fashion. Ontologies can provide such specification. It will be the task of this paper to explain what ontologies are and how they can be used to facilitate interoperability between software systems used in computer aided design, architecture engineering and construction, and geographic information processing.","authors":["Thomas Bittner","Maureen Donnelly","Stephan Winter"],"meta":["January 2006","DOI:10.1201/9781420036282.pt3"],"references":["285428625_TIGRIS_Topologically_Integrated_Geographic_Information_System","276959705_Point_Set_Topological_Spatial_Relations","247560491_SNAP_and_SPAN_Prolegomenon_to_geodynamic_ontology","314796776_Modularisation_of_domain_ontologies_implemented_in_description_logics_and_related_formalisms_including_OWL","302942570_A_Framework_for_Understanding_and_Classifying_Ontology_Applications","267090169_The_description_logic_handbook_Theory_implementation_and_applications_Reprint_of_the_2007_hardback_ed","266694963_Symbolic_Logic","256744909_Constraint_Query_Languages","256152362_Geometric_Modelling_A_Survey","246003934_Ecological_subsections_of_southeastern_Alaska_and_neighboring_areas_of_Canada"]}