{"id":"240319461_Degrading_network_capacity_may_improve_performance_information_effects_in_the_Braess_Paradox","abstract":"The Braess Paradox is a major finding in the equilibrium analysis of routing decentralized traffic in directed networks that are susceptible to congestion. It demonstrates that removing one or more links from a network that is subject to congestion may under certain combinations of cost structure and number of network users decrease the cost of travel for all its users. The Braess Paradox (BP) may be illustrated in networks modeled as non-atomic games where the number of commuters is very large and, as a consequence, each commuter only controls a negligible fraction of the overall traffic. Alternatively, as in the present study, it may be illustrated in networks modeled as atomic selfish routing games, where each commuter has a non-negligible effect on the travel costs of all the other commuters. Arguments have been raised not against the counterintuitive finding of Braess but, rather, against its relevance to real life situations. The argument goes that these are highly abstract networks and their seemingly paradoxical implications arise from the many aspects in which they differ from reality rather than from these aspects that they share with it. If the BP is a rare event in selfish routing networks, restricted to judiciously chosen combinations of parameter values and very simple networks, then interest in it should clearly be limited. But if a substantial fraction of networks in communication and transportation are susceptible to the BP, then the problem of adding links to the basic network or, alternatively, removing links from the augmented network gains practical significance and should, therefore, be approached with considerable care. Our main purpose is to compare to each other two information conditions. In the PUBLIC condition, each user is informed of the route choices and payoffs of all the users. In the PRIVATE condition, each user is only informed of her own payoff. For this purpose, we construct a basic network where each of n=18 players has to choose one of four routes from a common origin to common destination. We also construct an augmented network with two additional cross road segments that give rise to the Braess paradox. We use a computer-controlled within-subject experimental design in which each player first chooses one of six routes in 60 iterations of the augmented network and then one of four routes in 60 additional iterations of the basic network. We show that when the stage game is iterated in time, under both information conditions and in both games aggregate route choices converge to equilibrium.","authors":["Eyran Gisches","Amnon Rapoport"],"meta":["January 2010","DOI:10.1145/1807406.1807461"],"references":[]}