{"id":"240448261_Attitudes_of_primary_school_2nd_and_3rd_grade_students_towards_mathematics_course","abstract":"This study has been aimed at 230 students that have participated from 12 different primary schools that are part of the Ministry of Education and Culture (MEC) in accordance to their attitudes towards mathematics course. The work group is part of 2009-2010 academic year from 12 different primary schools of the North Cyprus. In this study in order to establish attitudes of primary education 2nd and 3rd grade students towards mathematics courses, “Emotional Facial Expressions” were used, due to the their age level. A questionnaire form was developed by the researchers in 2009 from a questionnaire developed by Trehearne (2003) was used to measure the students’ attitudes towards reading-writing through the help of emotional facial expressions and different mathematic attitude scales developed also used by other researchers.The questionnaire form consists of 10 questions. The students’ were required to answer the questions by colouring the given facial expressions stated as; very happy, happy, neutral, and sad. As a result of the study, students’ expressed positive attitudes towards mathematic courses.","authors":["Murat Tezer","Nedime Karasel"],"meta":["December 2010Procedia - Social and Behavioral Sciences 2(2):5808-5812","DOI:10.1016/j.sbspro.2010.03.947"],"references":["290394647_Matematik_tutum_olcegi_gelistirilmesi","250184524_A_Structural_Model_of_Mathematics_Achievement_for_Men_and_Women","234707414_Mathematics_Anxiety_and_Attitudes_Toward_Mathematics","289637038_Children's_and_adults'_recognition_of_spontaneous_and_posed_emotional_expressions_in_young_children","285749811_Matematik_korkusunu_yenmek","281333375_Matematik_dersine_yonelik_tutumu_olcen_likert_tipi_bir_olcegin_gelistirilmesi","280950291_A_structural_model_of_mathematics_achievement_for_men_and_women","279614972_What_Do_Children_Know_about_Emotions_and_When_Do_They_Know_It","265217484_COMPREHENSIVE_LITERACY_RESOURCE_FOR_KINDERGARTEN_TEACHERS","254110397_Preschool_Children's_Interpretation_of_Facial_Expressions_of_Emotion"]}