{"id":"240764745_Maps_Mental_Imagery_and_Gender_in_the_Recall_of_Geographical_Information","abstract":"This study investigated whether mental imagery can be an effective aid in facilitating the recall of spatial information and whether there are gender-based differences in the ability to employ such a visualization technique. Subjects were assigned to one of three treatment groups and asked to read a geographic text. One group received maps that illustrated the text; one group was instructed to form mental images of the text as they read; and a control group was given neither maps nor imagery instructions. Recall of spatial and non-spatial information was analyzed for differences due to treatment group and gender. In addition, subjects in the imagery-instruction group took standardized tests of visual memory and spatial visualization ability. There were no differences among groups on recall of non-spatial information, but both treatment group and gender had a significant effect on recall of spatial relationships. Maps and mental images functioned equally well to improve scores over the control group, and males scored higher than females from reading the text with maps. There were no gender differences on the standardized spatial ability tests. Men's scores on these tests were positively correlated with their recall of spatial information from the text, but women's scores for the same tasks were uncorrelated.","authors":["Patricia P. Gilmartin"],"meta":["October 1986Cartography and Geographic Information Science 13(4):335-344","DOI:10.1559/152304086783887226"],"references":["272906199_Verbal_Ability_and_Spatial_Task","200772647_Levels_of_Processing_A_Framework_for_Memory_Research","312948871_Human_spatial_abilities","249797642_Memory_Structures_and_Learning_Outcomes","246420245_Imagery_and_Verbal_Process","234621264_The_Instructional_Efficacy_of_Maps_in_Geographic_Text","233424946_Are_Geography_Students_More_Spatialy_Oriented_than_Others","232602853_Influence_of_Spatial_Organization_in_Prose_Learning","232491082_Vividness_of_imagery_in_recalling_connected_discourse","232425800_Concrete_image_and_verbal_memory_codes","44827715_The_Psychology_of_Sa_Differences","16531120_Effects_of_Imagery_Ability_and_Instructions_on_Recall_of_Information_on_Spatial_Location","16356948_Age_Differences_in_the_Use_of_Imagery_in_Integrating_New_and_Old_Information_in_Memory"]}