{"id":"240793125_Toward_an_Understanding_of_Why_Students_Contribute_in_Asynchronous_Online_Discussions","abstract":"The use of online learning is growing very fast in universities. Consequently, understanding how to promote student contribution in asynchronous online discussions, which is considered an integral part of online learning, has become increasingly crucial. Previous research has examined how factors, such as instructor facilitation techniques may influence student contribution. However, issues such as when the online discussion is student facilitated, and students are given a freedom of choice to choose, why students choose to contribute in some forums but not in others are not fully understood. In this article, we report a case study involving pre-service teachers in Singapore that examined this issue. Data were collected from the pre-service teachers' online postings, reflection logs, questionnaires, and interview data. Results suggested six themes that influenced students' decision to contribute or not to contribute: a) relational capital; b) knowledge about the subject or topic; c) discussion activity or topic; d) availability of time; e) reward; and 0 random choice. Practical recommendations to motivate students to contribute and future research directions pertaining to asynchronous online discussions are suggested.","authors":["Wing Sum Cheung","Khe Foon Hew","Connie Ng"],"meta":["January 2008Journal of Educational Computing Research 38(1):29-50","DOI:10.2190/EC.38.1.b"],"references":["284892180_Understanding_and_Validity_in_Qualitative_Research","283924827_Evaluating_the_participation_and_quality_of_thinking_of_pre-service_teachers_in_an_asynchronous_online_discussion_environment_Part_1","345000365_Extending_Richness_with_Reach","317953648_Naturalistic_inquiry","317953471_Qualitative_Research_and_Case_Study_Applications_In_Education","313195115_Computer-mediated_communication","309476109_Affect-_and_Cognition-Based_Trust_as_Foundations_for_Interpersonal_Cooperation_in_Organizations","303854826_J_Social_capital_intellectual_capital_and_the_organizational_advantage","277426875_Trust_as_Social_Reality","277053721_Graduate_Students'_Experiences_of_Challenges_in_Online_Asynchronous_Discussions"]}