{"id":"240795009_Partial_similarity_of_objects_and_text_sequences","abstract":"Similarity is one of the most important abstract con- cepts in the human perception of the world. In computer vision, numerous applications deal with comparing objects observed in a scene with some a priori known patterns. Often, it happens that while two objects are not similar, they have large similar parts, that is, they are partially similar. Here, we present a novel approach to quantify this semantic definition of partial similarity using the notion of Pareto optimality. We exemplify our approach on the problems of recognizing non-rigid objects and analyzing text sequences. I. INTRODUCTION Similarity is one of the most important abstract concepts in the human perception of the world. We encounter it every day during our interaction with other people whose faces we recognize. Similarity also plays a crucial role in many fields in science. Attempts to understand self-similar or symmetric behavior of Nature led to many fundamental discoveries in physics (1). In bioinformatics, a fundamental problem is detecting patterns similar to a sequence of nucleotides in given DNA sequences. In computer vision, comparing objects observed in a scene with some a priori known patterns is a fundamental and largely open problem. The definition of similarity is, to a large extent, a semantic question. Judging the similarity of faces, one may say that two human faces are similar if they have a common skin tone, while someone else would require the identity of the geometric structure of facial features like the eyes, the nose, and the mouth.","authors":["Alexander M. Bronstein","Michael Bronstein","Alfred M. Bruckstein","Ron Kimmel"],"meta":[],"references":["269996289_Laplace-Beltrami_spectra_as_Shape-DNA_of_surfaces_and_solids","257672083_Three-Dimensional_Face_Recognition","244959156_A_MULTIGRID_APPROACH_FOR_MULTIDIMENSIONAL_SCALING","284653335_Iterative_point_matching_for_registration_of_free-from_curves_and_surfaces","271543263_Representation_and_detection_of_deformable_shapes","262389943_Expression-Invariant_3D_Face_Recognition","256844533_The_Elegant_Universe","252750980_Augmented_image_histogram_for_image_and_video_similarity_search","248311932_Vector-Valued_Optimization_Problems_in_Control_Theory","245755615_Computing_geodesic_on_mani-folds"]}