{"id":"240943548_ARTIFICIAL_INTELLIGENCE_IN_MEDICAL_APPLICATION_AN_EXPLORATION","abstract":"The advancement in computer technology has encouraged the researchers to develop software for assisting doctors in making decision without consulting the specialists directly. The software development exploits the potential of human intelligence such as reasoning, making decision, learning (by experiencing) and many others. Artificial intelligence is not a new concept, yet it has been accepted as a new technology in computer science. It has been applied in many areas such as education, business, medical and manufacturing. This paper explores the potential of artificial intelligence techniques particularly for web-based medical applications. In addition, a model for web-based medical diagnosis and prediction is proposed. In most developing countries insufficient of medical specialist has increase the mortality of patients suffered from various diseases. The insufficient of medical specialists will never be overcome within a short period of time. The institutions of higher learning could however, take an immediate action to produce as many doctors as possible. However, while waiting for","authors":["Wan Hussain","Wan Hussain Wan Ishak","Fadzilah Siraj"],"meta":["July 2008"],"references":["342052237_Neo-Dat_An_Expert_System_to_Support_the_Designers_of_Clinical_Trails","222440302_A_Model_of_Inexact_Reasoning_in_Medicine","19576222_Computer_Programs_to_Support_Clinical_Decision_Making-Reply","14259079_Collaborative_medical_informatics_research_using_the_Internet_and_the_World_Wide_Web","12913749_The_Evolution_of_Health-Care_Records_in_the_Era_of_the_Internet","3659557_Hybrid_expert_system_in_anesthesiology_for_critical_patients","294093131_Artificial_neural_network_for_rolling_applications","237065195_Experienced_based_medical_diagnostics_system_over_the_World_Wide_Web_WWW","223365387_SETH_an_expert_system_for_the_management_on_acute_drug_poisoning_in_adults","3726715_Interval-based_reasoning_in_medical_diagnosis"]}