{"id":"241037549_Expertise_Differences_in_the_Comprehension_of_Visualizations_A_Meta-Analysis_of_Eye-Tracking_Research_in_Professional_Domains","abstract":"This meta-analysis integrates 296 effect sizes reported in eye-tracking research on expertise differences in the comprehension\nof visualizations. Three theories were evaluated: Ericsson and Kintsch’s (Psychol Rev 102:211–245, 1995) theory of long-term working memory, Haider and Frensch’s (J Exp Psychol Learn Mem Cognit 25:172–190, 1999) information-reduction hypothesis, and the holistic model of image perception of Kundel et al. (Radiology 242:396–402, 2007). Eye movement and performance data were cumulated from 819 experts, 187 intermediates, and 893 novices. In support of the\nevaluated theories, experts, when compared with non-experts, had shorter fixation durations, more fixations on task-relevant\nareas, and fewer fixations on task-redundant areas; experts also had longer saccades and shorter times to first fixate relevant\ninformation, owing to superiority in parafoveal processing and selective attention allocation. Eye movements, reaction time,\nand performance accuracy were moderated by characteristics of visualization (dynamics, realism, dimensionality, modality,\nand text annotation), task (complexity, time-on-task, and task control), and domain (sports, medicine, transportation, other).\nThese findings are discussed in terms of their implications for theories of visual expertise in professional domains and their\nsignificance for the design of learning environments.","authors":["Andreas Gegenfurtner","Erno Lehtinen","Roger Säljö"],"meta":["December 2011Educational Psychology Review 23(4):523-552","DOI:10.1007/s10648-011-9174-7"],"references":["321525690_Cognitive_Load_Theory","319524760_A_multidimensional_approach_to_skilled_perception_and_performance_in_sport","314751109_Combining_Information_Statistical_Issues_and_Opportunities_for_Research","314364623_Expertise_Differences_in_Attentional_Strategies_Related_to_Pilot_Decision_Making","306939383_The_magical_number_seven_plus_or_minus_two_Some_limits_on_our_capacity_to_process_information","304860437_Multimedia_Learning_Second_Edition","299221779_Comparison_of_two_random-effects_methods_of_meta-analysis","289119064_Effects_of_player_position_task_complexity_in_visual_exploration_behavior_in_soccer","285424773_Visual_search_in_solving_tactical_game_problems","284592521_Driving_Experience_and_the_Functional_Field_of_View"]}