{"id":"241119349_Application_of_the_Forced_Stuart-Landau_Model_to_Cylinder_Wake_Oscillation","abstract":"In this article the application of the forced Stuart-Landau equa- tion to describe the wake flow from a circular cylinder in uni- form flow under transverse forcing is investigated. Previous work has shown that the forced Stuart-Landau equation pre- dicts multivalued behaviour can occur over a range of forcing frequencies for a sufficiently large forcing amplitude. In prac- tice, this should mean that the wake is hysteretic as a function of the forcing frequency. Both numerical simulations and experi- ments have failed to find this predicted hysteresis. The resolu- tion appears to be that forced Landau model predicts that, for a particular forcing amplitude, the range of forcing frequencies over which hysteresis is predicted to occur varies in space. This means that the model can predict the wake response (as mea- sured by the oscillation amplitude) almost up to the frequency corresponding to maximum response, but for higher forcing fre- quencies the predictions deviate from the observations.","authors":["Mark C. Thompson","Patrice Le Gal"],"meta":[],"references":["252123341_Hopf_bifurcation_Landau_equation_and_vortex_shedding_behind_circular_cylinders","231981257_Benard-Vonkarman_Instability-Transient_and_forced_regimes","231906904_Breaking_of_axisymmetry_and_onset_of_unsteadiness_in_the_wake_of_a_sphere","258078248_On_the_spatial_structure_of_global_modes_in_wake_flow","253059281_A_low-dimensional_model_for_chaos_in_open_fluid_flows","252155226_The_Lift_and_Drag_Forces_on_a_Circular_Cylinder_Oscillating_in_a_Flowing_Fluid","251696804_Hysteresis_in_the_forced_Stuart-Landau_equation_Application_to_vortex_shedding_from_an_oscillating_cylinder","247605785_Spatio-Temporal_Pattern_Formation","231910886_Self-excited_oscillations_in_the_wakes_of_2-D_bluff_bodies_and_their_control","231903887_Numerical_and_theoretical_study_of_the_first_Hopf_bifurcation_in_a_cylinder_wake"]}