{"id":"241280269_Impact_of_organizational_sociotechnical_system_on_managerial_retention_A_general_linear_modeling_approach","abstract":"Purpose\n– The industrial organizations all over the world are operating in a highly competitive and challenging business environment. Achieving customer satisfaction on a continual basis keeping in view of the increasing expectations of the customers has been the key to the growth of business and operations. Customer satisfaction and business development can only be achieved by retaining the competent and capable managers at different hierarchical levels of the organizations. But with the growing career opportunities and better employment prospects available, turnover of managerial personnel has become an increasingly important industrial problem worth studying in the recent years. The purpose of this paper is to examine the industry‐wide problem of managerial turnover.\n\nDesign/methodology/approach\n– The paper describes a study which is diagnostic in nature and which follows a causal design approach to empirically examine if the impacts of both the organizational social and technical subsystem elements on managerial retention are significant or not. In the first phase, a pilot survey was conducted on a sample of 93 managerial respondents at junior and middle levels in order to test the validity and reliability of the survey instrument. The second phase of the study was conducted on a sample of 444 junior and middle‐level managers from various organizations located in India to determine the causal impacts of the organizational social and technical subsystem factors on managerial retention through developing an integrated model by using the general linear modeling technique.\n\nFindings\n– The results were in the expected direction and fulfilled the research aim of the current study. The factor analysis had grouped the items into seven constructs with a total of 53 items. Studies indicate that in industrial organizations the design of managerial jobs by balancing both the organizational social and technical subsystem elements does impact managerial retention. The empirical model developed through general linear modeling technique supports the proposed relationships.\n\nOriginality/value\n– Through identifying and empirically establishing the impacts of organizational social and technical subsystem elements on managerial retention in Indian context, this paper helps to understand the managerial expectations from their prospective employers. The top management of the business organizations may use the findings as guiding criteria, while constructing, managing, and evaluating their managerial retention strategies in Indian context.","authors":["Koustab Ghosh","Sangeeta Sahney"],"meta":["March 2011Journal of Modelling in Management 6(1):33-59","DOI:10.1108/17465661111112494"],"references":["324997681_PEOPLE_AND_ORGANIZATIONAL_CULTURE_A_PROFILE_COMPARISON_APPROACH_TO_ASSESSING_PERSON-ORGANIZATION_FIT","297600821_The_Dynamic_Role_of_Social_Exchange_and_Personality_in_Predicting_Turnover_Intentions_among_Professional_Workers","344599661_A_socio-technical_systems_approach_to_cell_design_case_study_and_analysis","325670678_Reciprocation_of_perceived_organizational_support","313645663_A_socioanalytic_perspective_on_person-environment_interaction","313604424_Evaluating_Structural_Equation_Models_with_Unobservable_Variables_and_Measurement_Error","308525516_The_principles_of_sociotechnical_design_revisited","278947794_Structural_Equations_Modeling_Test_of_a_Turnover_Theory_Cross-Sectional_and_Longitudinal_Analyses","271796164_Advanced_Manufacturing_Systems_and_Organizational_Choice_Sociotechnical_System_Approach","271685389_Industrial_Technology_and_Worker_Integration_in_the_Organization"]}