{"id":"241251310_Aligning_teaching_and_assessing_to_course_objectives","abstract":"Teaching as a system Teaching and learning take place in a whole system, which embraces classroom, departmental and institutional levels. A 'poor' system is one in which the components are not integrated, and are not tuned to support high-level learning. In such a system, only the 'academic' students use higher-order learning processes. In a 'good' system, all aspects of teaching and assessment are tuned to support high-level learning, so that all students are encouraged to use higher-order learning processes. Constructive alignment (CA) is such a system. It is an approach to curriculum design that optimizes the conditions for quality learning. For an example of a poor system, here is what a psychology undergraduate said about his teaching: I hate to say it, but what you have got to do is to have a list of 'facts'; you write down ten important points and memorize those, then you'll do all right in the test ... If you can give a bit of factual information – so and so did that, and concluded that – for two sides of writing, then you'll get a good mark. Quoted in Ramsden (1984: 144) The problem here is not the student. In fact, this student liked writing extended essays, and finally graduated with First Class Honours, but he was contemptuous of these quick and snappy assessments. So in psychology, he made a strategic decision to memorize, knowing that it was enough to get him through, saving his big guns for his major subject. The problem here is the assessment: it was not aligned to the aims of teaching. So often the rhetoric in courses and programmes is all that it should be, stating for example that students will graduate with a deep understanding of the discipline, and the ability to solve problems creatively. Then they are told about creative problem solving in packed lecture halls, and tested with multiple-choice tests. It's all out of kilter, but such a situation is not, I strongly suspect, all that uncommon.","authors":["John B Biggs"],"meta":["January 2003"],"references":["262455712_Learning_To_Teach_in_Higher_Education","247700504_Teaching_for_quality_learning_at_university_2_ed_Buckingham","234742177_Educating_for_Understanding","230785204_Teaching_for_Quality_Learning_at_University_Society_for_Research_into_Higher_Education","230557800_Cognitive_Conceptions_of_Learning"]}