{"id":"241281838_Electron_multiplying_CCD_technology_Application_to_ultrasensitive_detection_of_biomolecules","abstract":"A novel Charge Coupled Device (CCD) has been commercially produced by Marconi Applied Technology, UK under the trade name of L3Vision, incorporating a solid-state electron multiplying structure based on the Impact Ionization phenomenon in silicon. Here we review this technology, and evaluate the first electron multiplying CCD camera, in particular using it to image weak emissions form microtitre plates. A theoretical model was constructed to predict S/N and Z-factor performances, which were compared to actual measurements, verifying that a greater than one order of magnitude improvement can be achieved over conventional CCDs. The demonstrations of remarkable sensitivity enhancement presented here are discussed in terms of the EMCCD camera's suitability for use in life sciences applications such as High-Throughput Screening (HTS), and other approaches requiring ultrasensitive detection of biomolecules, including Single Molecule Detection.","authors":["Donal Denvir","Colin G Coates"],"meta":["June 2002Proceedings of SPIE - The International Society for Optical Engineering","DOI:10.1117/12.472117"],"references":["12480692_A_Simple_Statistical_Parameter_for_Use_in_Evaluation_and_Validation_of_High_Throughput_Screening_Assays","259263395_Scientific_Charge-Couple_Devices","251829551_The_LLLCCD_Low_Light_Imaging_without_the_need_for_an_intensifier","235537556_Energy-Conservation_Considerations_in_the_Characterization_of_Impact_Ionization_in_Semiconductors","224404511_Temperature_Dependence_of_Avalanche_Multiplication_in_Semiconductors","224073258_Evaluation_of_a_novel_CCD_camera_for_dose_reduction_in_digital_radiography","24368163_Notch_Charge-Coupled_Devices","13981629_Onoff_blinking_and_switching_behaviour_of_single_molecules_of_Green_Fluorescent_Protein","12227244_Probing_Single_Molecules_in_Single_Living_Cells","11606792_Single_Molecule_Fluorescence_Spectroscopy_at_Ambient_Temperature"]}