{"id":"24137730_Students'_Attitudes_and_Intentions_toward_Entrepreneurship_at_Tallinn_University_of_Technology","abstract":"The objective of the current paper is to identify the students’ attitudes and intentions toward entrepreneurship, their personal characteristics and future plans in connection with entrepreneurship. The results of the empirical study are brought to evaluate the preparation of bachelor programme graduates and master students from Tallinn University of Technology (different specialities) for starting with entrepreneurship. The Likert scale is used for measurement of students’ attitudes based on their own opinions about motivations to start in business, the statements about their entrepreneurial characteristics and behavioural habits connected with business relations and organisations. In this context, the opinions of respondents about the obstacles met in starting a business and possible support needs are also a subject of this analysis, including the role of university to foster entrepreneurial initiative among students. The research results showed that despite a considerable share of respondents thinking about entrepreneurship, most of them do not want to start business after graduation, but postpone this to a more distant future. Based on the students’ previous thoughts about and connections with entrepreneurship, or their plans for the future, we can identify differences in the motives to start a business (e.g. ambition for freedom, self-realisation, and pushing factors), as well as in personal characteristics, skills to participate in business relations and behaviour in organisation. The personal characteristics and behaviour typical of entrepreneur are correlated positively with the intention to start a new venture in the near future. However, we can also find some exceptions and interesting connections based on the student’s status, specialty (economic or technical specialities) and degree of study. The paper seeks to provide clarification so as to understand these differences, as well as suggestions for increasing the role of universities in developing students’ entrepreneurial behaviour and improving entrepreneurship policies in order to stimulate entrepreneurial initiative among students","authors":["Urve Venesaar","Ene Kolbre","Toomas Piliste"],"meta":["February 2006","SourceRePEc"],"references":["313187929_Perceived_fulfillment_of_organizational_employment_versus_entrepreneurship_Work_values_and_career_intentions_of_business_college_graduates","308058706_The_theory_of_planned_behavior_organizational_behavior_and_human_decision_processes","288015105_The_business_idea_The_early_stages_of_entrepreneurship","287312699_A_General_Theory_of_Entrepreneurship_The_Individual-Opportunity_Nexus","272160008_The_Achieving_Society","270794940_Prediction_of_Employment_Status_Choice_Intentions","270794723_Organizational_Employment_Versus_Self-Employment_Reasons_for_Career_Choice_Intentions","265036923_The_Role_of_Structured_Interventions_in_Shaping_Graduate_Entrepreneurship","251184644_The_Roots_of_Entrepreneurship_and_Small_Business_Research","235362880_The_Theory_Of_Economic_Development","228728181_Entrepreneurship_and_Vocational_Education","227625333_Cross-National_Comparisons_of_the_Variation_in_New_Firm_Formation_Rates","229731787_Enterprise_Education_Influencing_Students'_Perceptions_of_Entrepreneurship","228314722_The_Displaced_Uncomfortable_Entrepreneur","227591991_The_'Making'_of_An_Entrepreneur_Testing_a_Model_of_Entrepreneurial_Intent_among_Engineering_Students_at_MIT"]}