{"id":"241630402_Profiling_Skype_video_calls_Rate_control_and_video_quality","abstract":"Video telephony has recently gained its momentum and is widely adopted by end-consumers. But there have been very few studies on the network impacts of video calls and the user Quality-of-Experience (QoE) under different network conditions. In this paper, we study the rate control and video quality of Skype video calls. We first measure the behaviors of Skype video calls on a controlled network testbed. By varying packet loss rate, propagation delay and bandwidth, we observe how Skype adjusts its rates, FEC redundancy and video quality. We find that Skype is robust against mild packet losses and propagation delays, and can efficiently utilize the available network bandwidth. We also find that Skype employs an overly aggressive FEC protection strategy. Based on the measurement results, we develop rate control model, FEC model, and video quality model for Skype. Extrapolating from the models, we conduct numerical analysis to study the network impacts of Skype. We demonstrate that user back-offs upon quality degradation serve as an effective user-level rate control scheme. We also show that Skype video calls are indeed TCP-friendly and respond to congestion quickly when the network is overloaded.","authors":["Xinggong Zhang","Yang Xu","Hao Hu","Yong Liu"],"meta":["March 2012Proceedings - IEEE INFOCOM","DOI:10.1109/INFCOM.2012.6195805"],"references":["228346066_An_Experimental_Study_of_the_Skype_Peer-to-Peer_VoIP_System","224124245_Could_Skype_Be_More_Satisfying_A_QoE-Centric_Study_of_the_FEC_Mechanism_in_an_Internet-Scale_VoIP_System","221164348_Quantifying_Skype_User_Satisfaction","221164164_Locating_Internet_Bottlenecks_Algorithms_Measurements_and_Implications","224733563_Mean_Packet_Queueing_Delay_in_a_Buffered_Two-User_CSMACD_System","224500363_Tuning_Skype's_Redundancy_Control_Algorithm_for_User_Satisfaction","221287918_Opinion_Model_for_Estimating_Video_Quality_of_Videophone_Services","221243961_On_the_TCP-Friendliness_of_VoIP_Traffic","221044600_A_mathematical_model_of_the_Skype_VoIP_congestion_control_algorithm","220446995_Skype_Video_congestion_control_An_experimental_investigation"]}