{"id":"241612850_Twenty-first_century_game_studies_in_the_academy_Libraries_and_an_emerging_discipline","abstract":"Purpose – The purpose of this paper is to explore and emphasize the impact of academic computer game studies programs on library services and collections. Design/methodology/approach – A review of the literature related to the relationship between gamers, game studies, and libraries, precedes discussion of the background of academic computer game studies programs. The potential challenges and opportunities concerning collection development, information literacy instruction, and reference within academic libraries are addressed along with highlights of emerging best practices. Findings – The paper provides analysis of game studies as an emerging academic discipline and of the scholarly communication within this field. It also highlights emerging practices within academic librarians serving students and faculty in this field. Research limitations/implications – Because game studies is a new discipline, best practices to meet users' needs are just beginning to be established for academic libraries. Further research is needed in the area of information-seeking behavior, perception of game studies' students and faculty, and their information literacy skills. Practical implications – This is an opportunity for librarians who serve students and faculty in game studies to learn about the history of this discipline and what several academic librarians are currently doing to meet their needs in collection development, information literacy instruction, and reference services. Originality/value – While discussing the history of game studies as an academic program, the paper also highlights the issues related to library services and collections for the emerging academic discipline of game studies in an effort to support academic librarians who work with game studies students and faculty.","authors":["Brena Smith"],"meta":["May 2008Reference Services Review 36(2):205-220","DOI:10.1108/00907320810873066"],"references":["238660328_Why_Game_Culture_Studies_Now","234651497_Meet_the_Gamers_They_Research_Teach_Learn_and_Collaborate_So_Far_without_Libraries","200795944_An_introduction_to_understanding_digital_games","273946930_Chris_Crawford_on_Game_Design","250889561_Towards_computer_game_studies","240285988_A_Ludicrous_Discipline_Ethnography_and_Game_Studies","234808635_Andrew_Rollings_and_Ernest_Adams_on_Game_Design","234610712_How_Gaming_Could_Improve_Information_Literacy","232851284_Building_a_Collection_of_Video_Games_in_Support_of_a_Newly_Created_Degree_Program_at_the_University_of_California_Santa_Cruz","229726894_Proprietary_schools_Beyond_the_issue_of_profit","221217617_Neomancer_An_Exercise_in_Interdisciplinary_Academic_Game_Development","221217519_BSc_Computer_Game_Development_Why_not","220200750_Computer_Game_Studies_Year_One","220200747_The_Dungeon_and_the_Ivory_Tower_Vive_La_Difference_ou_Liaison_Dangereuse","3000532_Masters_of_doom_How_two_guys_created_an_empire_and_transformed_pop_culture_Book_Review"]}