{"id":"241630442_ThinkAir_Dynamic_resource_allocation_and_parallel_execution_in_the_cloud_for_mobile_code_offloading","abstract":"Smartphones have exploded in popularity in recent years, becoming ever more sophisticated and capable. As a result, developers worldwide are building increasingly complex applications that require ever increasing amounts of computational power and energy. In this paper we propose ThinkAir, a framework that makes it simple for developers to migrate their smartphone applications to the cloud. ThinkAir exploits the concept of smartphone virtualization in the cloud and provides method-level computation offloading. Advancing on previous work, it focuses on the elasticity and scalability of the cloud and enhances the power of mobile cloud computing by parallelizing method execution using multiple virtual machine (VM) images. We implement ThinkAir and evaluate it with a range of benchmarks starting from simple micro-benchmarks to more complex applications. First, we show that the execution time and energy consumption decrease two orders of magnitude for a N-queens puzzle application and one order of magnitude for a face detection and a virus scan application. We then show that a parallelizable application can invoke multiple VMs to execute in the cloud in a seamless and on-demand manner such as to achieve greater reduction on execution time and energy consumption. We finally use a memory-hungry image combiner tool to demonstrate that applications can dynamically request VMs with more computational power in order to meet their computational requirements.","authors":["Sokol Kosta","Andrius Aucinas","Pan Hui","Richard Mortier"],"meta":["March 2012Proceedings - IEEE INFOCOM 945-953:945-953","DOI:10.1109/INFCOM.2012.6195845","Project: Cloud Computing, MCC, and Data Center Infrastructure - Performance, Availability, Reliability and related issues"],"references":["238673024_Dimorphic_Computing","221656462_Accurate_Online_Power_Estimation_and_Automatic_Battery_Behavior_Based_Power_Model_Generation_for_Smartphones","221234602_Odessa_Enabling_interactive_perception_applications_on_mobile_devices","221234545_Tactics-Based_Remote_Execution_for_Mobile_Computing","309201112_The_case_for_VM-based_cloudlets_in_mobile_computing","304620857_Above_the_clouds_A_berkeley_view_of_cloud_computing","228698458_Tactics-Based_Remote_Execution","221567312_Virtual_Smartphone_over_IP","221351797_CloneCloud_Elastic_execution_between_mobile_device_and_cloud","221234601_NWSLite_A_Light-Weight_Prediction_Utility_for_Mobile_Devices"]}