{"id":"241648574_Why_do_corporate_codes_of_conduct_fail_Women_workers_and_clothing_supply_chains_in_Vietnam","abstract":"Despite criticisms of their derivation and implementation, corporate codes of conduct (CoCs) continue to dominate debates on Corporate Social Responsibility and the informal regulation of worker exploitation and abuse by ‘sweatshops’ supplying northern multinational corporations (MNCs). Through analytical interrogation of existing literature and empirical evidence from Vietnamese case studies, two propositions are made to clarify the poor performance of CoCs. It is argued, firstly, that the extent of the control of MNCs over their subcontracting suppliers is misconceived and over-estimated because supply chains function more like networks than the hierarchies assumed by ‘principal-agent’ preconceptions. Conceptualizing such relationships instead as networks of conflicting political and economic imperatives amongst various sets of actors generates a second proposition derived from our case studies. The factory workers, their subcontractor employers, intermediary vendors and even the MNCs seeking CoC commitments, have convergent interests in violating key aspects of the codes and deceiving their auditors. The analysis evaluates the residual value of CoCs in light of these constraints and the options for improving labour regulation, with particular reference to the plight of disadvantaged women workers.","authors":["Dong Hoang","Bryn Jones"],"meta":["April 2012Global Social Policy 12(1):67-85","DOI:10.1177/1468018111431757","Project: Corporate Power and Responsible Capitalism?"],"references":["274552935_Compliance_Collaboration_and_Codes_of_Labor_Practice_The_ADIDAS_Connection","263119525_Restructuring_and_Conflict_in_the_Global_Athletic_Footwear_Industry_Nike_Yue_Yuen_and_labour_codes_of_conduct","262137431_The_Impact_of_the_State_on_Workers'_Conditions_Comparing_Taiwanese_Factories_in_China_and_Vietnam","261826928_Sweatshops_and_Respect_for_Persons","258126541_The_Private_Regulation_of_Global_Corporate_Conduct","299062550_Sweatshops_and_respect_for_persons","293566090_At_the_crossroads","285863727_Secrets_lies_and_sweatshops","285862273_Restructuring_and_conflict_in_the_global_athletic_footwear_industry","261754595_Respect_for_Workers_in_Global_Supply_Chains_Advancing_the_Debate_Over_Sweatshops"]}