{"id":"241711633_Success_and_Failure_Factors_of_Adopting_SAP_in_ERP_System_Installation","abstract":"Purpose – Enterprise resource planning (ERP) systems are software packages that allow companies to have more real time visibility and control over their operations. This paper aims to investigate and analyze common circumstances that occur within most ERP projects, and determines the areas that are key to success versus those that contribute to failure. Design/methodology/approach – The study is based on a content analysis of published articles reporting SAP implementations in 44 companies. Findings – Identifies six common factors that are indicative of successful or non-successful SAP implementations. It has been found that the lack of appropriate culture and organizational (internal) readiness as the most important factor contributing to failure of SAP implementations in 15 companies. The presence of project management approaches and appropriate culture and organizational (internal) readiness are the most important factors contributing to the success of SAP implementations in 29 organizations. Research limitations/implications – The data analyzed is from secondary sources published in the press. Secondary reporting could increase objectivity; however, the weakness is that not all the factors might have been reported. Originality/value – Identifies factors critical to the success of SAP implementation","authors":["Vidyaranya B. Gargeya","Cydnee Brady"],"meta":["October 2005Business Process Management Journal 11(5):501-516","DOI:10.1108/14637150510619858"],"references":["313007299_Companies_don't_learn_from_previous_IS_snafus","312813445_GTE_goes_solo_on_SAP_R3","294709932_Change_management_Energy_to_the_people","288324554_False_starts_strong_finishes","284571742_Disillusionment","284337805_SAP_installation_scuttled_-_unisource_cites_internal_problems_for_168M_write-off","284293321_Enterprise_applications","280016921_Enterprise_resource_planning_survey_of_US_manufacturing_firms","265778816_ERP_Tools_techniques_and_applications_for_integrating_the_supply_chain_With_simulation_CR_ROM_by_Eli_Schragenheim_2nd_ed","246748137_Major_Causes_of_Software_Project_Failures"]}