{"id":"241702072_Making_learning_and_Web_20_technologies_work_for_higher_learning_institutions_in_Africa","abstract":"Purpose – This paper seeks to assess the extent to which learning and Web 2.0 technologies are utilised to support learning and teaching in Africa's higher learning institutions, with a specific focus on Tanzania's public universities. Design/methodology/approach – A combination of content analysis and semi-structured interviews was used to collect data. Semi-structured interviews were conducted with ICT personnel from six of the eight public universities in Tanzania in 2011. Findings – The study found that the adoption of e-learning and Web 2.0 technologies is still in its infancy in Tanzania's public universities. However, there was much enthusiasm amongst respondents for developing the potential of e-learning and Web 2.0 tools in their universities. Practical implications – The study seeks to promote academic inquiry about the need for innovative Web 2.0 technologies in learning and teaching and the adoption of these emerging technologies in Africa's higher learning institutions. Originality/value – The study provides empirical findings on the use of e-learning and Web 2.0 for higher education, specifically in the Tanzanian context. The study provides a basis for further research on the use of Web 2.0 technologies in higher education.","authors":["Edda Tandi Lwoga"],"meta":["March 2012Campus-Wide Information Systems 29(2):90-107","DOI:10.1108/10650741211212359"],"references":["330634195_The_Impact_of_E-Learning_in_Medical_Education","237129454_Challenges_Facing_African_Universities_Selected_Issues","320194831_Education_20_Designing_the_web_for_teaching_and_learning_A_Commentary_by_the_Technology_Enhanced_Learning_phase_of_the_Teaching_and_Learning_Research_Programme","285667145_Challenges_of_adaptive_e-learning_at_higher_learning_institutions_A_case_study_in_Tanzania","284098893_Online_learning_Implications_for_effective_learning_for_higher_education_in_South_Africa","267866011_Using_plasma_TV_broadcasts_in_Ethiopian_secondary_schools_A_brief_survey","254727330_Describing_learning_activities_Tools_and_resources_to_guide_practice","249751260_E-Learning_and_E-Library_Services_at_the_University_of_Ghana_prospects_and_challenges","248921201_Beyond_the_Library's_Walls_Using_Library_20_Tools_to_Reach_Out_to_All_Users","242422396_Repositioning_Information_and_Communication_Technologies_in_Higher_Education"]}