{"id":"241728957_An_integrated_model_for_designing_and_optimising_an_international_logistics_network","abstract":"Supply-chain configuration has recently gained increasing attention both from the practitioner's perspective and as a research area. This paper proposes an integrated model for designing and optimising international logistics networks. It consists of a mixed integer linear programming model and a data-mapping section (i.e. methodological guidelines for gathering and processing the data necessary to set up the model). It has been specifically developed for solving the configuration problem for supply chains characterised by a complexity level typical of real-life global logistics networks. Although this topic is well understood and well elaborated at a technical level in the extant literature, it still presents obstacles in practice especially in terms of dealing with real-life complexity, service-level constraints and data mapping. Thus, we developed our integrated approach with the aim to fill these gaps. We designed our model for dealing with multiple-layer, single location-layer, multiple-commodity and time-constrained logistics networks, to be implemented in a single period time horizon and in a deterministic environment. The proposed approach represents an innovative contribution to the existing body of scientific knowledge and facilitates the data gathering and processing activities, which are largely recognised as complex and time-consuming processes for the management of logistics activities.","authors":["Alessandro Creazza","Fabrizio Dallari","Tommaso Rossi"],"meta":["June 2012International Journal of Production Research 50(11):2925-2939","DOI:10.1080/00207543.2011.578157"],"references":["303455355_Changing_Patterns_of_International_Competition","292307251_New_directions_in_logistics","284042110_Simulation-Tool_for_better_distribution","279204821_The_Capacitated_Plant_Location_Problem","277823903_Theory_and_Application_of_Linear_Flow_Programming","272495180_A_simulated_annealing_methodology_to_distribution_network_design_and_management","271802112_Planning_Physical_Distribution_Operations_with_Dynamic_Simulation","269487507_Business_Logistics_Management","268656969_Sequential_location_and_allocation_Worst_case_performance_and_statistical_estimation","267002132_Two-Phase_Methods_for_Global_Optimization"]}