{"id":"241756331_The_Impact_of_Green_Supply_Chain_Management_on_Transportation_Cost_Reduction_in_Turkey","abstract":"Supply chain management (SCM) has become an important competitive approach for organizations. The issue of green supply chain management is critical for the successful implementation of industrial ecosystems and industrial ecology. Organizations have a number of reasons for implementing these green supply chain policies, from reactive regulatory reasons, to proactive strategic and competitive advantage reasons. From an overall environmental and organizational perspective, it is important to understand the situation and what issues exist in this field. Many organizations worldwide have already experienced globalization and a shifting focus to competition among networks of companies in this environment. Multinational enterprises have established global networks of suppliers that take advantage of country-industry specific characteristics to build this competitive advantage. To success having this competitive advantage, logistics and supply chain managers have to balance efforts to reduce costs and innovate while maintaining good environmental (ecological) performance (Pagell et al., 2004). Therefore, today, competition is not between companies, between supply chains. This study brings us the effect of Green Supply Chain Management (GSCM) on the Transportation Cost Reduction (TCR).","authors":["Mehmet Saridogan"],"meta":["January 2012International Review of Management and Marketing 2(2)"],"references":["284695557_Greening_the_supply_chain","283407012_Environmental_Supply_Chain_Innovation","258326807_Greening_the_Supply_Chain","235284826_Greening_the_Supply_Chain_A_New_Initiative_in_South_East_Asia","229911560_Does_the_Competitive_Environment_Influence_the_Efficacy_of_Investments_in_Environmental_Management","229879299_The_Green_Supply_Chain_Integrating_Suppliers_Into_Environmental_Management_Processes","223949628_Relationships_Between_Operational_Practices_and_Performance_Among_Early_Adopters_of_Green_Supply_Chain_Management_Practices_in_Chinese_Manufacturing_Enterprises"]}