{"id":"242091432_Virtual_students'_perceptions_of_e-learning_in_Iran","abstract":"With the emergence of the Internet, e-learning has increasingly become the promising solution that continues to grow day after day. Considering students' perception toward e-learning is important in successful development of e-learning in higher education, since attitude of user towards application of information technology is one of the most effective factors. This paper examines perception of virtual students' attitudes towards e-learning in Iran. A descriptive-correlation survey approach was used in this study. Students (n = 110) filled in a web-based closed questions questionnaire. Reliability and validity of instrument were determined by investigating the attitudes of e-learning specialists in Tehran University and application of Cronbach's Alpha (α=0.88.) Descriptive and inferential statistics were used to analyze the data using SPSS Win13. Questionnaires received were analyzed, putting the students' perceptions in relation to gender, age, knowledge of computers and attitudes to advantages and disadvantages of e-learning. Results showed that students have positive perception to e- learning. Liner regression analysis indicated that 68% of variation in virtual students' perceptions of e-learning was determined by the four variables of: Students' assessment about competency of e-learning, access to internet, computer and internet usage and assessment of current higher education system's shortcomings.","authors":["Jafar Yaghoubi","Iraj MALEK MOHAMMADI","Hooshang IRAVANI","Mohammad Attaran"],"meta":["January 2008Turkish Online Journal of Educational Technology 7(3)"],"references":["249666401_Information_Communication_Technology_and_the_New_University_A_View_on_eLearning","247857975_The_Effects_of_Internet-Based_Instruction_on_Student_Learning","228971134_The_impact_on_learning_of_an_asynchronous_active_learning_course_format","3230168_Exploratory_research_on_the_role_of_national_and_professional_cultures_in_a_distributed_learning_project"]}