{"id":"242083185_Generic_Emergence_of_Cognitive_Behaviour_in_Self-Generating_Neural_Networks","abstract":"We discuss the design and behaviour of families of neural networks which grow out of a small set of \\mother\" neurons in response to external stimuli and to the activities present in various parts of the net at a given time. The growth process is subject to a few fundamental rules, like the ability of neurons to grow new neurons or connections is gradually exhausted with the number of generations neurons are either of excitatory or inhibitive type inhibitive neurons have a tendency to form long-range connections, whereas excitatory neurons \\prefer\" short-range connections. In addition, there are a number of free parameters in the equations driving the time evolution of the neural activities. Our design is implemented using Matlab, such that the growth process of the network and its activity can be observed and controlled interactively on the computer screen. Once the networks are grown both periodic attractors and xed points are observed generically in response to external input. The inputs used in the network's formation are typically distinguished by characteristic responses, but the resulting networks are capable of other behaviour in response to other inputs.","authors":["Sean Bohun","Samantha J. Carruthers","Roderick Edwards","Reinhard Illner"],"meta":["January 2003Nonlinear Dynamics and Systems Theory 1(1)"],"references":["230887766_The_Handbook_of_Brain_Theory_and_Neural_Network","279233482_How_brains_make_chaos_in_order_to_make_sense_of_the_world","262204100_Neuroanatomy_in_a_computational_perspective","260869557_Introduction_to_The_Theory_of_Neural_Computation","259066861_Approximation_of_Neural_Network_Dynamics_by_Reaction-Diffusion_Equations","247894112_The_Handbook_of_Brain_Theory_and_Neural_Networks_Second_Edition","242554268_The_Organization_of_Behavior","227095887_On_information-processing_abilities_of_chaotic_dynamical_systems","223639648_Nonlinear_neural_networks_Principle_mechanisms_and_architectures","216722102_Modeling_Brain_Function_The_World_of_Attractor_Neural_Networks"]}