{"id":"242037342_A_project_control_process_in_pre-construction_phases_Focus_on_effective_methodology","abstract":"Purpose\nIt is a well‐known fact that the construction industry always passes through two distinctive problems during the construction stage: slippages of project‐schedules, i.e. time‐frame, and overruns of project‐costs, i.e. budget. However, limited literature is available to solve or dilute these two problems before they even occur. It is strongly believed that the bulk of the two mentioned problems can be mitigated to a great extent, if not eliminated, provided that proper attention is paid to the pre‐construction phases of projects. Normally projects are implemented through traditionally old techniques which generally emphasize only solving “construction problems during the construction phase”. The aim of this article is therefore to unveil a professional methodology known as Project Control System (PCS) focusing on pre‐construction phases of construction projects.\n\nDesign/methodology/approach\nIn this article, the authors share the lessons learned during implementation of Kuwait University projects worth approximately $400 million in a span of ten years. The task of the project management/construction management (PM/CM) is being provided to the university by a joint venture team of international and local specialists.\n\nFindings\nThe pre‐construction methodology ensures smooth and successful implementation during construction phases of the projects as they are generally executed in a fast‐pace, deadline‐driven and cost‐conscious environment. The intuitive proactive methods, if implemented during pre‐construction stage, automatically answer the questions that are encountered during the execution periods of projects.\n\nOriginality/value\nIn this article, the authors share the lessons learned during PM/CM during projects over a span of ten years, which could be of use to others.","authors":["Khaled Al-Reshaid","Nabil Kartam","Narendra Tewari","Haya Albader"],"meta":["August 2005Engineering Construction & Architectural Management 12(4):351-372","DOI:10.1108/09699980510608811"],"references":["272121398_Planning_in_Construction_Longitudinal_Study_of_Pre-Contract_Planning_Model_Demonstrates_Reduction_in_Project_Cost_and_Schedule_Growth","247277035_Project_Management_A_Managerial_Approach","313559572_The_power_of_the_work_breakdown_structure","292668846_Professional_Construction_Management","290800002_Effective_project_management_using_web-based_technology","263344417_Design_for_construction_Utilizing_production_experiences_in_development","261729417_Statybos_Vykdymo_Planavimas_Inzinerinio_Pasirengimo_Statybai_Sistemoje","257094691_Project_management_in_the_construction_industry","241969173_Establishing_influence_of_design_process_performance_on_end-project_goals_in_construction_using_process-based_model","235270077_Identifying_key_performance_indicators_for_use_in_control_of_pre-project_stage_process_in_construction"]}