{"id":"242112660_Cyberbullying_Causes_effects_and_remedies","abstract":"Purpose – The purpose of this paper is to present research exploring the pervasiveness and causes of cyberbullying, the psychological impact on students, and the responses to cyberbullying from students and administrators. The goal is to give school leaders a greater understanding of this phenomenon and suggest steps to deal with this challenging issue. Design/methodology/approach – The data are collected from 351 students using a survey, which contains limited choice, scaled response, and open-ended questions. This qualitative/quantitative design enables collection of data from a large population along with rich qualitative data that expand and explain students' experiences. Findings – The paper reveals that cyberbullying emerges most commonly from relationship problems (break-ups, envy, intolerance, and ganging up); victims experience powerfully negative effects (especially on their social well-being); and the reactive behavior from schools and students is generally inappropriate, absent, or ineffective. Research limitations/implications – This is self-reported data collected from a group of students in one institution, who are asked to recall instances from their pre-college experience. Additional research on from a variety of age groups and cross-culturally would add another layer of understanding about cyberbullying among teens. Practical implications – Technological advances have created new challenges for schools in keeping students safe. This paper has implications for educational policy and practice, including steps school leaders can take to curtail cyberbullying. Originality/value – This paper builds on a small body of research on cyberbullying and focuses on underlying causes, categories of psychological effects, and specific remedies.","authors":["Dianne L. Hoff","Sidney Mitchell"],"meta":["August 2009Journal of Educational Administration 47(5):652-665","DOI:10.1108/09578230910981107"],"references":["258201014_Bullies_Move_Beyond_the_Schoolyard_A_Preliminary_Look_at_Cyberbullying","234727840_Offline_Consequences_of_Online_Victimization_School_Violence_and_Delinquency","232907969_Offline_Consequences_of_Online_Victimization","228799343_Cyber_bullying_Clarifying_Legal_Boundaries_for_School_Supervision_in_Cyberspace","27464290_Cyber_Bullying_An_Old_Problem_in_a_New_Guise","265147395_Internet_Gives_Teenage_Bullies_Weapons_to_Wound_From_Afar","249054126_Keeping_Schools_Out_of_Court_Legally_Defensible_Models_of_Leadership","249038330_Character_Education_for_Cyberspace_Developing_Good_Netizens","242625243_Mixed_Methodology_Combining_Qualitative_and_Quantitative_Approaches","242104906_Gender_and_computer_ethics","239560192_Cyberbullying_in_Schools_A_Research_of_Gender_Differences","234766046_Bullying_in_Schools_A_Form_of_Child_Abuse_in_Schools","226768898_An_Integrative_Theory_of_Intergroup_Conflict","200008862_The_role_of_low_self-esteem_in_emotional_and_behavioral_problems_Why_is_low_self-esteem_dysfunctional","200008861_The_Role_of_Low_Self-Esteem_in_Emotional_and_Behavioral_Problems_Why_is_Low_Self-Esteem_Dysfunctional","14741926_Predictors_of_Depression_in_Street_Youth","8377761_Online_aggressortargets_aggressors_and_targets_A_comparison_of_associated_youth_characteristics","5986197_You_wanna_take_this_online"]}