{"id":"242132209_DIALECTOLOGIE_ANTHROPOLOGIE_CULTURELLE_ARCHEOLOGIE_VERS_UN_NOUVEL_HORIZON_CHRONOLOGIQUE_POUR_LA_FORMATION_DES_DIALECTES_EUROPEENS","abstract":"LABURPENA Aztarnategi aurrehistoriko eta toponimo dialektal magiko -erligiosoen arteko korrelaziocn ikerketa alde batetik eta bestetik Atas Linguarum Europae delakoaren egituraren barruko moti- bazio semantikoen ikerketa antropologiko eta gonparatuek badirudi erakusten dutela europear dialektuek beraien estratigrafian geruza aurrehistoriko garrantzitsuak gordetzen dituztela. Azken iritzi honek berak bakarrik nahikoa arrazoi ematen du ondoko problema planteatzeko: europear dialektoen formazioaren datatze tradizionala, hau da, ertarokoa berrikustea. Hitita eta Mizeniar grekoaren aurkikuntza indoeuropear hizkuntza bezala (eta J.C. aurreko 2000. urtean jadanik oso- tua) alde batetik eta bestetik indoeuropear hizkuntzen jatorri neolitikoari buruzko arkeologo modernoen hipotesiek berrikuspen honen beharra sustatzen dute. Dialektoak aurrehistorian osotuak izan direneko hipotesia baieztatzen duten nozio aurrehistorikoei buruzko mapa geolinguistikoen analisian egindako esperimentuak erabiliko dira hurbilketa berri honen ondorio zabalak erakusteko eta orobat europear dialektoen jatorriari buruzko arazoa aztertzeko ikerketa disziplinartekoen beharra. SUMMARY The study of the correlation between prehistoric Sites and magico-religious dialect toponyms, as well as the comparative and anthropological study of semantic motivations within the framework of the Atas Linguarum Europae, seem to demostrate that European dialects pre- serve, within their stratigraphy, imprtant prehistoric layers. This conclusion alone allows the problem to be posed of a review of traditional, i. e. medieval, datings for the formation of European dialects. The discoveries of Hittite and Mycenean Greek as Indo-European languages already formed two thousand years BC, on the one hand, and the new hypotheses of modern archaeologists on the Neolithic origin of Indo-European languages, on the other, confirm the nced for this review. Experiments in the analysis of geolinguistic maps concerning prchistoric notions, conduc- ted on the assumption of a prchistoric formation of dialects, will be used to illustrate the wide- ranging consequences of this new approach, and the need for an inter-disciplinary study of the problem of the origins of European dialects.","authors":["Mario Alinei","Atlas Linguarum Europae"],"meta":[],"references":["315189347_The_Hittites_and_Their_Contemporaries_in_Asia_Minor","313639451_Geolinguistique_et_geogenetique_une_demarche_interdisciplinaire","290161698_An_Analysis_of_Ritual_Co-Parenthood_Compadrazgo","285287201_The_Papal_States_in_Italian_linguistic_history","274205085_The_Earliest_Wheeled_Transport_From_the_Atlantic_Coast_to_the_Caspian_Sea","272855720_Origenes_del_espanol_Estado_linguistico_de_la_Peninsula_Iberica_hasta_el_siglo_XI","270415632_Atlas_Linguarum_Europae","249955028_The_problem_of_dating_in_historical_linguistics","249204318_The_Hittites_and_Their_Contemporaries_in_Asia_Minor","245269984_Alternative_Social_Structures_and_Ritual_Relations_in_the_Balkans"]}