{"id":"242257024_Do_ensino_da_terminologia_para_tradutores_diretrizes_basicas","abstract":"Resumo: Os tradutores técnicos têm intensificado seu interesse pelos termos técnico-científicos, buscando maior conhecimento sobre sua estruturação e funcionamento. Evidencia-se, portanto, a necessidade de que, na formação dos tradutores, sejam oferecidas disciplinas de Terminologia teórica e aplicada que ofereçam subsídios teóricos e práticos que facilitem o manejo das terminologias. Diante disso, são referidos alguns princípios e diretrizes de reconhecimento e de análise dos termos técnico-científicos, relativos à natureza, propriedades prototípicas e funcionamento dos termos. Postula-se ainda que a Terminologia teórica, campo de conhecimento atualmente sustentado por fundamentos lingüísticos e textuais, pode oferecer ao tradutor subsídios teóricos e metodológicos que facilitem o tratamento dos termos técnicos, bem como sua gestão informatizada. Palavras-chave: terminologia, termos técnico-científicos, linguagem especializada, ensino de tradução. Abstract: Technical translators have intensified their interest in technical- scientific terms, searching for more knowledge about their structure and function. It becomes evident, therefore, the necessity for subjects in theo- retical and applied terminology to be offered in translators education, so that these professionals have more appropriate background to manage termi- nologies. Given that scenario, this paper proposes some principles and directions about the recognition and analysis of technical-scientific terms related to the origin, the prototypical properties and the function of terms. It also proposes that theoretical Terminology, a field of knowledge currently supported by linguistic and textual foundations, can offer translators the theoretical and methodological knowledge to facilitate the treatment of tech- nical terms and their computerized management.","authors":["Maria da Graça Krieger"],"meta":["September 2008Cadernos de Tradução 1(17)","DOI:10.5007/6862"],"references":["306039796_Traduccion_y_traductologia_introduccion_a_la_traductologia","270151156_Les_langues_specialisees","49471682_Curso_practico_sobre_el_procesamiento_de_la_terminologia"]}