{"id":"242346674_Rainfall_and_temperature_scenario_for_Bangladesh_using_20km_mesh_AGCM","abstract":"Purpose – The purpose of this paper is to demonstrate the use of the Meteorological Research Institute (MRI) global 20-km mesh Atmospheric General Circulation Model (AGCM), called MRI-AGCM, to simulate rainfall and mean surface air temperature. Through calibration and validation the MRI-AGCM was adapted for Bangladesh for generating rainfall and temperature scenarios. Design/methodology/approach – The model generated rainfall was calibrated with ground-based observed data in Bangladesh during the period of 1979-2006. The Climate Research Unit (CRU) data are also used for understanding of the model performance. Better performance of MRI-AGCM obtained through validation process increased confidence in utilizing it in the future rainfall projection for Bangladesh. Findings – Rainfall and mean surface air temperature projection for Bangladesh is experimentally obtained for the period of 2075-2099. This work finds that the MRI-AGCM simulated rainfall and temperature are not directly useful in application purpose. However, after validation and calibration, acceptable performance is obtained in estimating annual rainfall and mean surface air temperature in Bangladesh. Originality/value – Change of rainfall is projected about 0.64 percent in monsoon season (JJAS), 1.90 percent in post-monsoon season (ON) and 13.46 percent in Winter season (DJF) during the period of 2075-2099. Similarly, change of mean surface air temperature is projected about 2.5 degrees Celsius for the same period.","authors":["Md. Mizanur Rahman","Nazlee Ferdousi","Yasuo Sato","Shoji Kusunoki"],"meta":["February 2012International Journal of Climate Change Strategies and Management 4(1):66-80","DOI:10.1108/17568691211200227"],"references":["258375254_IPCC_Special_Report_on_Emissions_Scenarios","251432442_2003_Global_analyses_of_sea_surface_temperature_sea_ice_and_night_marine_air_temperature_since_the_late_Nineteenth_Century","312515102_Implementation_of_the_Arakawa-Schubert_Cumulus_Parameterization_with_a_Prognostic_Closure","312437169_Will_greenhouse_gas-induced_warming_over_the_next_50_years_lead_to_higher_frequency_and_greater_intensity_of_hurricanes","296215214_Vulnerability_and_Adaptation_to_Climate_Change_for_Bangladesh","285075785_Implementation_of_the_Arakawa-_Schubert_cumulus_parameterization_with_a_prognostic_closure_The_Representation_of_Cumulus_Convection_inNumerical_Models_Meteor_Monogr","283997196_Rainy_season_of_the_Asian-Pacific_summer_monsoon","283091007_Climate_Change_2001_the_Scientific_Basis","263558249_Contribution_of_Working_Group_I_to_the_Second_Assessment_Report_of_the_Intergovernmental_Panel_on_Climate_Change_WMOUNEP","254996005_Rainy_Season_of_the_Asian-Pacific_Summer_Monsoon"]}