{"id":"242341193_DATA_MINING_APPROACH_FOR_PREDICTING_STUDENT_PERFORMANCE","abstract":"Although data mining has been successfully implemented in the business world for some time now, its use in higher education is still relatively new, i.e. its use is intended for identification and extraction of new and potentially valuable knowledge from the data. Using data mining the aim was to develop a model which can derive the conclusion on students' academic success. \nDifferent methods and techniques of data mining were compared during the prediction of students' success, applying the data collected from the surveys conducted during the summer semester at the University of Tuzla, the Faculty of Economics, academic year 2010-2011, among first year students and the data taken during the enrollment. The success was evaluated with the passing grade at the exam. The impact of students' socio-demographic variables, achieved results from high school and from the entrance exam, and attitudes towards studying which can have an affect on success, were all investigated. In future investigations, with identifying and evaulating variables associated with process of studying, and with the sample increase, it would be possible to produce a model which would stand as a foundation for the development of decision support system in higher education.","authors":["Edin Osmanbegović","Mirza Suljic"],"meta":["May 2012"],"references":["242076740_Mining_Student_Data_Using_Decision_Trees","228571634_Mining_Students_Data_to_Analyze_Learning_Behavior_A_Case_Study","228346963_Determination_of_factors_influencing_the_achievement_of_the_first-year_university_students_using_data_mining_methods","222815211_Educational_data_mining_A_survey_from_1995_to_2005","262566861_The_Top_Ten_Algoritms_in_Data_Mining","262565566_The_Top_Ten_Algorithms_in_Data_Mining","262565479_Efficiency_of_Decision_Trees_in_Predicting_Student's_Academic_Performance","262563128_Handbook_of_Data_Mining_and_Knowledge_Discovery","262562942_Data_Mining_A_Knowledge_Discovery_Approach","235323887_Data_Mining_Practical_Machine_Learning_Tools_and_Techniques_Second_Edition_Morgan_Kaufmann_Series_in_Data_Management_Systems"]}