{"id":"242336232_Linking_turnover_reasons_to_family_profiles_for_ITBPO_employees_in_India","abstract":"Purpose – The purpose of this paper is to develop turnover reasons and assess their importance for various family role configurations. Specifically, the authors were interested in whether high levels of family financial obligation related to family-related turnover reasons and whether low levels of family financial obligation related to job-related turnover reasons. Design/methodology/approach – The authors used both qualitative and quantitative methods to develop and test the turnover reasons; this involved conducting interviews and pilot testing the turnover items, which were evaluated with factor analysis. The main study was analyzed using MANOVA. Findings – The authors developed six turnover reasons that help explain why individuals were leaving their jobs. It was also found that employees with relatively low financial obligation were more likely to leave the organization because of lack of managerial support, job content and high levels of work-related stress. Research limitations/implications – The measures in this study were cross-sectional, participants were employees in the information technology/business process outsourcing (IT/BPO) sector, and the study included a single-country. Future studies can focus on multiple industries and countries and use objective variables in determining key relationships. Practical implications – The study's results show the major reasons for turnover, both at an individual and organizational level, which include managerial support, job content and work-related stress; each was particularly significant for those married without children in a dual-earner situation. Originality/value – The paper contributes by examining, for the first time, the relationships between family demographic profiles and turnover reasons for Indian IT/BPO workers.","authors":["Scott L. Boyar","Reimara Valk","Carl P. Maertz","Ranjan Sinha"],"meta":["March 2012Journal of Indian Business Research 4(1):6-23","DOI:10.1108/17554191211206771"],"references":["276055656_The_India_way_Lessons_for_the_US","272790646_The_Theory_of_Planned_Behavior","272581384_Voluntary_Turnover_Social_Capital_and_Organizational_Performance","325005966_An_Organization-Level_Analysis_of_Voluntary_and_Involuntary_Turnover","324998301_An_Unfolding_Model_of_Voluntary_Employee_Turnover","324995361_The_India_Way_Lessons_for_the_US","291936332_Human_capital","289821428_How_to_keep_your_best_employees_Developing_an_effective_retention_policy","279796507_Common_Method_Biases_in_Behavioral_Research_A_Critical_Review_of_the_Literature_and_Recommended_Remedies","278947794_Structural_Equations_Modeling_Test_of_a_Turnover_Theory_Cross-Sectional_and_Longitudinal_Analyses"]}