{"id":"242342008_Recruiting_and_retaining_scarce_information_technology_talent_A_focus_group_study","abstract":"Notes that it has become fiercely competitive to recruit and retain information technology (IT) talent in today’s tight labor market. Cites two main reasons for IT skills shortages. First, the number of students graduating in the USA with bachelor’s degrees in computer science declined more than 40 percent in recent years. Forecasts are that this trend will grow even more during the next few years. Second, according to the US Bureau of Labor Statistics, the demand for trained IT employees has increased in the past few years. The predicted labor shortage for skilled IT staff will be increasing by 1.3 million by year 2005. This labor crisis has forced companies to develop new strategies specifically to address recruitment and retention of scarce IT specialists. Describes effective recruitment and retention practices, as described by participants in this study, with the goal being to provide useful information to other employers of IT specialists. The information used in this study was based on an intensive focus group study conducted with senior IT managers and recruiters from a number of local companies in the Pacific Northwest.","authors":["Diane Lockwood","A. Ansari"],"meta":["September 1999Industrial Management & Data Systems 99(6):251-256","DOI:10.1108/02635579910253805"],"references":["307844881_Barriers_to_tacit_knowledge_retention_An_understanding_of_the_perceptions_of_the_knowledge_management_of_people_inside_and_outside_the_organisation","262906965_Who_stays_with_you_Factors_predicting_employees'_intention_to_stay","242336232_Linking_turnover_reasons_to_family_profiles_for_ITBPO_employees_in_India","241280269_Impact_of_organizational_sociotechnical_system_on_managerial_retention_A_general_linear_modeling_approach","235264119_Organizational_sociotechnical_diagnosis_of_managerial_retention_in_an_IT_organization_SAP-LAP_framework","233339688_The_'country-of-origin_effect'_in_employee_turnover_intention_Evidence_from_China","27313101_A_Model_of_B2B_E-Commerce_Based_on_Connectivity_and_Purpose","269577796_Hoshin_Kanri_planning_process_in_human_resource_management_recruitment_in_a_high-tech_firm"]}