{"id":"242451455_A_Statistical_Model_of_Criminal_Behavior","abstract":"Motivated by empirical observations of spatio-temporal clusters of crime across a wide variety of urban settings, we present a model to study the emergence, dynamics, and steady-state properties of crime hotspots. We focus on a two-dimensional lattice model for residential burglary, where each site is characterized by a dynamic attractiveness variable, and where each criminal is represented as a random walker. The dynamics of criminals and of the attractiveness field are coupled to each other via specific biasing and feedback mechanisms. Depending on parameter choices, we observe and describe several regimes of aggregation, including hotspots of high criminal activity. On the basis of the discrete system, we also derive a continuum model; the two are in good quantitative agreement for large system sizes. By means of a linear stability analysis we are able to determine the parameter values that will lead to the creation of stable hotspots. We discuss our model and results in the context of established criminological and sociological findings of criminal behavior.","authors":["M. B. SHORT","Maria Dorsogna","Virginia Pasour","George Tita"],"meta":["August 2008Mathematical Models and Methods in Applied Sciences 18(supp01)","DOI:10.1142/S0218202508003029"],"references":["254148506_Police_Perceptions_of_the_Long-_and_Short-Term_Spatial_Distribution_of_Residential_Burglary","243102184_Model_hierarchies_for_cell_aggregation_by_chemotaxis","235217015_Spatial_Analyses_of_Crime","285727401_Derivation_of_hyperbolic_models_for_chemosensitive_movement","265601917_Bars_Blocks_and_Crimes","258230611_Global_existence_in_sub-critical_cases_and_finite_time_blow-up_in_super-critical_cases_to_degenerate_Keller-Segel_systems","256748905_Well-posedness_of_a_model_of_point_dynamics_for_a_limit_of_the_Keller-Segel_system","249683877_The_Impact_of_Gang_Formation_on_Local_Patterns_of_Crime","243770597_Broken_Windows_The_Police_and_Neighborhood_Safety","235321458_Compstat_An_analysis_of_an_Emerging_Police_Managerial_Paradigm"]}