{"id":"242453344_Helping_learners_visualize_and_comprehend_algorithms","abstract":"The idea of using animations to illustrate dynamic behaviors of computer algorithms is over fifteen years old. Over a hundred algorithm animation systems have been built since then, with most developed in the belief that the animations would serve as effective learning aids for students. However, only recently have researchers started asking the question - do algorithm animations really help? Unfortunately, results of experiments driven by this question have been disappointing. We believe that previous attempts at using animation to teach algorithm behavior were unsatisfactory not because of a flaw with animation as a technique, but because of the approach used to convey the animations. This paper provides an overview of our algorithm visualization research, based on the premise that a rethinking of algorithm animation design is required in order to harness its power to enhance learning. A novel theoretical framework for the design of effective algorithm visualizations, one which espouses embedding interactive analogies and animations in hypermedia to enhance contextual learning, is presented first. We then describe the architecture of HalVis, an implemented system based on this framework, and illustrate the various learning components of this architecture through an annotated slideshow of a visualization of the SelectionSort algorithm. Finally, a summary of results from eight empirical studies conducted over three years, involving more than 230 undergraduate students, is provided. These experiments demonstrated a statistically significant advantage of our framework over both traditional means of instruction and algorithm animations representative of extant research on this topic. They also led to a surprising discovery of the important role of interactive and animated analogies in priming learning about algorithms from subsequent visualizations.","authors":["S. R. Hansen","N. H. Narayanan"],"meta":["January 2000Interactive Multimedia Electronic Journal of Computer - Enhanced Learning 2"],"references":["3660752_Toward_empirically-based_software_visualization_languages","228753651_On_the_role_of_animated_analogies_in_algorithm_visualizations","220302239_Multimedia_and_Its_Impact_on_Training_Engineers","43952606_Cognitive_Media_Types_for_Multimedia_Information_Access"]}