{"id":"242600969_Neural_Network_Implementation_Using_FPGA_Issues_and_Application","abstract":"Hardware realization of a Neural Network (NN), to a large extent depends on the efficient implementation of a single neuron. FPGA-based reconfigurable computing architectures are suitable for hardware implementation of neural networks. FPGA realization of ANNs with a large number of neurons is still a challenging task. This paper discusses the issues involved in implementation of a multi-input neuron with linear/nonlinear excitation functions using FPGA. Implementation method with resource/speed tradeoff is proposed to handle signed decimal numbers. The VHDL coding developed is tested using Xilinx XC V50hq240 Chip. To improve the speed of operation a lookup table method is used. The problems involved in using a lookup table (LUT) for a nonlinear function is discussed. The percentage saving in resource and the improvement in speed with an LUT for a neuron is reported. An attempt is also made to derive a generalized formula for a multi-input neuron that facilitates to estimate approximately the total resource requirement and speed achievable for a given multilayer neural network. This facilitates the designer to choose the FPGA capacity for a given application. Using the proposed method of implementation a neural network based application, namely, a Space vector modulator for a vector-controlled drive is presented","authors":["A. Muthuramalingam","S. Himavathi","E. Srinivasan"],"meta":["November 2007"],"references":["20235322_A_Neural_Network_Architecture_for_Preattentive_Vision","5583814_Fast_Neural_Networks_Without_Multipliers","4658191_Neural_Nets_for_Adaptive_Filtering_and_Adaptive_Pattern_Recognition","3337554_Highly_efficient_limited_range_multipliers_for_LUT-based_FPGA_architectures","3218823_Hardware_Implementation_of_a_Real-Time_Neural_Network_Controller_With_a_DSP_and_an_FPGA_for_Nonlinear_Systems","234218333_Power_electronics_and_ac_drives","232472619_Neocognitron_A_Self-Organizing_Neural_Network_Model_for_a_Mechanism_of_Visual_Pattern_Recognition","5613963_Implementation_issues_of_neuro-fuzzy_hardware_Going_toward_HWSW_codesign_IEEE_Transactions_on_Neural_Networks_141_176-194","3985258_Neural_network_implementation_on_a_FPGA","3412158_New_membership_functions_for_effective_design_and_implementation_of_fuzzy_systems"]}