{"id":"242822293_An_object-based_approach_to_a_road_network_definition_for_an_accident_database","abstract":"This paper describes a conceptual model for a road accident database, which incorporates the variables defined in the UK national accident data set. The development of the database is carried out using the object modelling technique adapted to meet the requirements of geographical data classes. The paper focuses on an appropriate definition of the road network to reduce data redundancy and provide greater integrity for blackspot analysis by including those elements of the network that do not usually have accidents. The data model is based upon that offered by the Ordnance Survey's Centre Alignment of Roads (OSCAR) Asset Manager digital map series which has been modified to include all road numbers and to reflect the hierarchical structure of the road classification system. A data model has been developed for describing junctions that allows them to be viewed as points on the network or as networks in their own right. Accident frequencies at a high-risk site are usually analysed over intervals of time and so it is important that changes to the site that could affect the accident frequency should be recorded in the database. Consequently, the paper also describes a method for recording temporal aspects of the road network.","authors":["K. Lupton","D. Bolsdon"],"meta":["September 1999Computers Environment and Urban Systems 23(5):383-398","DOI:10.1016/S0198-9715(99)00031-9"],"references":["273002557_Double_Os_-_the_future_of_GIS_databases","220649658_Integrating_GIS_and_Spatial_Data_Analysis-Problems_and_Possibilities","292689902_Accident_databases_Design_concepts","292295658_Traffic_accident_analysis_using_geoprocessing_techniques","286551956_Accuracy_of_accident_data","256639989_Deductive_databases_for_transport_engineering","222088176_The_Location_of_Motor_Vehicle_Crashes_in_Honolulu_A_Methodology_for_Geocoding_Intersections","220649855_GIS-application_development_with_GEOOOA","19772831_Estimating_the_regression-to-mean_effect_associated_with_road_accident_black_spot_treatment_Towards_a_more_realistic_approach","15413590_The_identification_of_mistakes_in_road_accident_records_Part_1_Locational_variables"]}