{"id":"242933344_Time_Dependent_Vehicle_Routing_Problems_Formulations_Properties_and_Heuristic_Algorithms","abstract":"The time dependent vehicle routing problem (TDVRP) is defined as follows. A vehicle fleet of fixed capacities serves customers of fixed demands from a central depot. Customers are assigned to vehicles and the vehicles routed so that the total time of the routes is minimized. The travel time between two customers or between a customer and the depot depends on the distance between the points and time of day. Time windows for serving the customers may also be present. The time dependent traveling salesman problem (TDTSP) is a special case of the TDVRP in which only one vehicle of infinite capacity is available. Mixed integer linear programming formulations of the TDVRP and the TDTSP are presented that treat the travel time functions as step functions. The characteristics and properties of the TDVRP preclude modification of most of the algorithms that have been developed for the vehicle routing problem. Several simple heuristic algorithms are given for the TDTSP and TDVRP without time windows based on the nearest-neighbor heuristic. A mathematical-programming-based heuristic for the TDTSP without time windows using cutting planes is also briefly discussed. Test results on small, randomly generated problems are reported.","authors":["Chryssi Malandraki","Mark S. Daskin"],"meta":["August 1992Transportation Science 26(3):185-200","DOI:10.1287/trsc.26.3.185"],"references":["242703842_MultiTerminal_Network_Flows","238836583_An_N-Constraint_Formulation_of_the_Time-Dependent_Traveling_Salesman_Problem","265369523_A_Heuristic_Algorithm_For_the_Vehicle_Dispatching_Problem","262250486_OR_Forum-Perspectives_on_Vehicle_Routing_Exciting_New_Developments","247822847_A_Computerized_Vehicle_Routing_Application","244476225_Optimal_Routing_under_Capacity_and_Distance_Restrictions","242933009_Survey_Paper--Time_Window_Constrained_Routing_and_Scheduling_Problems","242932077_Technical_Note--An_Exact_Algorithm_for_the_Time-Constrained_Traveling_Salesman_Problem","242425530_On_a_Linear-Programming_Combinatorial_Approach_to_the_Traveling-Salesman_Problem","239666757_The_Time-Dependent_Traveling_Salesman_Problem_and_Its_Application_to_the_Tardiness_Problem_in_One-Machine_Scheduling"]}