{"id":"243391756_American_Hegemony_and_the_Postwar_Reconstruction_of_Science_in_Europe","abstract":"In 1945, the United States was not only the strongest economic and military power in the world; it was also the world's leader in science and technology. In American Hegemony and the Postwar Reconstruction of Science in Europe, John Krige describes the efforts of influential figures in the United States to model postwar scientific practices and institutions in Western Europe on those in America. They mobilized political and financial support to promote not just America's scientific and technological agendas in Western Europe but its Cold War political and ideological agendas as well.Drawing on the work of diplomatic and cultural historians, Krige argues that this attempt at scientific dominance by the United States can be seen as a form of \"consensual hegemony,\" involving the collaboration of influential local elites who shared American values. He uses this notion to analyze a series of case studies that describe how the U.S. administration, senior officers in the Rockefeller and Ford Foundations, the NATO Science Committee, and influential members of the scientific establishment--notably Isidor I. Rabi of Columbia University and Vannevar Bush of MIT--tried to Americanize scientific practices in such fields as physics, molecular biology, and operations research. He details U.S. support for institutions including CERN, the Niels Bohr Institute, the French CNRS and its laboratories at Gif near Paris, and the never-established \"European MIT.\" Krige's study shows how consensual hegemony in science not only served the interests of postwar European reconstruction but became another way of maintaining American leadership and \"making the world safe for democracy.\"","authors":["John Krige","Michael D. Gordin"],"meta":["November 2007Physics Today 60(11)","DOI:10.1063/1.2812125"],"references":["228603099_Nuclear_energy_development_in_postwar_West_Germany_Struggles_over_cooperation_in_the_Federal_Republic's_first_reactor_station","227273320_Science_Advising_and_Science_Policy_in_Post-War_West_Germany_The_example_of_the_Deutscher_Forschungsrat","222522264_The_scientific_dimensions_of_social_knowledge_and_their_distant_echoes_in_20th-century_American_philosophy_of_science","11536078_OPINIONThe_Rockefeller_Foundation_and_the_rise_of_molecular_biology"]}