{"id":"243769661_Split-plot_designs_for_robust_experimentation","abstract":"Genichi Taguchi has emphasized the use of designed experiments in several novel and important applications. In this paper we focus on the use of statistical experimental designs in designingproducts to be robust to environmental conditions. The engineering concept of robust product design is very important because it is frequently impossible or prohibitively expensive to control or eliminate variation resulting from environmental conditions. Robust product design enablesthe experimenter to discover how to modify the design of the product to minimize the effect dueto variation from environmental sources. In experiments of this kind, Taguchi's total experimental arrangement consists of a cross-product of two experimental designs:an inner array containing the design factors and an outer array containing the environmental factors. Except in situations where both these arrays are small, this arrangement may involve a prohibitively large amount of experimental work. One of the objectives of this paper is to show how this amount of work can be reduced. In this paper we investigate the applicability of split-plot designs for thisparticular experimental situation. Consideration of the efficiency of split-plot designs and anexamination of several variants of split-plot designs indicates that experiments conductedin a split-plot mode can be of tremendous value in robust product design since they not only enable the contrasts of interest to be estimated efficiently but also the experiments can be considerably easier to conduct than the designs proposed by Taguchi.","authors":["G. E. P. Box","Stephen Jones"],"meta":["January 1992Journal of Applied Statistics 19(1):3-26","DOI:10.1080/02664769200000001"],"references":["350447005_Applications_of_Statistics_to_Industrial_Experimentation_DanielApplications","315252261_The_Design_and_Analysis_of_Experiments","292023300_Discussion_of_complex_experiments_by_F_Yates","245279039_An_Analysis_for_Unreplicated_Fractional_Factorials","239799486_A_Simple_System_of_Evolutionary_Operation_Subject_to_Empirical_Feedback","238737273_Use_of_Half-Normal_Plots_in_Interpreting_Factorial_Two-Level_Experiments","48376908_Principles_and_procedures_of_staticsA_biometrical_approach","44400849_Principles_and_procedures_of_statistics_a_biometrical_approach_Robert_G_D_Steel_James_H_Torrie"]}