{"id":"243732441_Selecting_a_flexible_manufacturing_system_using_multiple_criteria_analysis","abstract":"A visual interactive decision support framework designed to aid the decision-maker, typically top management, in selecting the most appropriate technology and design when planning a flexible manufacturing system (FMS) is described. The framework can be used in the preinvestment stage of the planning process, after the decision in principle has been made to build an FMS. First, both qualitative and quantitative criteria are used to narrow the set of alternative system configurations under consideration down to a small number of most attractive candidates. After this prescreening phase, a multiobjective programming model is formulated for each remaining configuration, allowing the manager to explore and evaluate the costs and benefits of various different scenarios for each configuration separately by experimenting with different levels of batch sizes and production volumes. The system uses visual interaction with the decision-maker, graphically displaying the relevant trade-offs between such relevant performance criteria as investment and production costs, manufacturing flexibility, production volume and investment risk, for each scenario. Additional criteria, when relevant, can also be included. The ease of use and interpretation and the flexibility make the proposed system a powerful analytical tool in the initial FMS design process. The insights gained from experimenting with the different scenarios form the basis of understanding the anticipated impact of techno-economic factors on the performance of the FMS configuration, and provide valuable information for the implementation stage of building the FMS. An example using real data from a case study in the Finnish metal product industry is provided to illustrate the methodology.","authors":["Antonie Stam","Markku Kuula"],"meta":["April 1991International Journal of Production Research 29(4):803-820","DOI:10.1080/00207549108930103"],"references":["321590469_Aspiration_Based_Decision_Support_Systems_Theory_Software_and_Applications","302198285_Flexible_manufacturing_systems","297814335_A_Mathematical_Basis_for_Satisficing_Decision_Making","284907853_Decision_Making_for_Leaders_The_Analytical_Hierarchy_Process_for_Decisions_in_a_Complex_World","268605232_IAC-DIDAS-N_A_Dynamic_Interactive_Decision_Analysis_and_Support_System_for_Multicriteria_Analysis_of_Nonlinear_Models","265004600_W_O_R_K_I_N_G_P_A_P_E_R_DISCRET_AN_INTERACTIVE_DECISION_SUPPORT_SYSTEM_FOR_DISCRETE_ALTERNATIVES_MULTICRITERIA_PROBLEMS","264585187_Performance_evaluation_of_flexible_manufacturing_systems","247759919_The_Analytic_Hierarchy_Process","245231110_Justification_of_FMS_with_the_Analytic_Hierarchy_Process","244958336_A_mathematical_basis_for_satisficing_decision_making","243732421_VIGA_Visual_Interactive_Support_System_for_Multiple_Criteria_Decision_Making","234782531_Post_Industrial_Manufacturing","229673608_A_Pareto_race","227445770_Flexible_Manufacturing_Systems_A_Review_of_Analytical_Models","223899301_A_Multiple_Criteria_Model_for_Pricing_Alcoholic_Beverages"]}