{"id":"243772913_Information_Technology_and_Tourism_A_Challenging_Relation","abstract":"Everything flows (Heraclit, 540 - 480 AC) \n\nEverything flows - everything changes. Heraclit's aphorism summarizes this book and its content in several ways. Flow refers to things passing by, it alludes to the intangible and immaterial, which is the essence of information technology. But flow also refers to move, which is the core of tourism. Both, the tourist and the information are traveling: the tourist is traveling to the destination, the information about the tourism product is traveling to the consumer. Finally, the aphorism refers to permanent change. Industries, the IT as well as the travel and tourism industry, are constantly changing our way of life, our views and perceptions of life. Moreover, these industries themselves undergo a permanent change. There are other parallels: both industries are not only growing above average, they will also be among the most important industries in the next century. In addition to these similarities, both industries are closely interrelated and intertwined. This interrelationship is not a recent phenomenon, even though it has not been explicitly observed before. It started in the early days of computing, and is becoming increasingly intense, up to the point, where IT is probably the strongest driving force for changes within the tourism industry. \n\nAt the step to the next millennium, mankind is witnessing rapidly evolving technological progress, together with huge changes in human society. We live in the „information society„ (Bell 1973), where information has become as important as capital and labor. The invention of the computing machine has been the starting point of the profound and ongoing changes, which happen at the intersection of two technological developments. In the first area, which is related to human labor and its material conditions, the computer and its basic technology represents the so-called third industrial-technological revolution. The first revolution, which marked the beginning of modern society, took place on three different levels: a) mechanical systems replaced human capabilities; b) inanimate force, especially steam engine, replaced human and animal force; and c) production processes were radically improved (Landes 1968). The second revolution was set in motion by the invention of electrical power and the motor car. \n\nThe second technological development concerns the role of human beings as symbol and information processors. The computer, which is, in contrast to all former and other machines, a symbol manipulator and transformer, partially models and simulates the human mental capabilities. Thus, its invention is also a revolution in information processing. Furthermore, the computer, since it is programmable and can refer to its internal status, is both an integration and a control device of other machines and further technical infrastructures. Nowadays, linked with telecommunication devices the computer represents a worldwide communication machine. In this way the computer marks the intersection of two developments, which drastically have and will change the physical and mental relationship of mankind to its physical as well as social environment. \n\nHowever, this technological as well as the related social development path neither was nor is not straightforward. It is rather a dialectic process, accompanied by great disturbances and contradictions. Together with other factors, it produced widespread, up to now unknown material wealth and, simultaneously, regional and individual poverty. This development also has led to an ecological situation which is not only potentially dangerous to the entire mankind but is also characterized by growing social frictions and often coincides with a paralysis in (political) decision making. \n\nThe phenomena of mass tourism can be related to these social as well as technological developments. The latter provided both the social wealth, which has enabled a growing part of the society to have leisure time and money needed for traveling, and the necessary artifacts and infrastructures which enable travel. Following Guariso and Werthner (1989), a tentative list of generic phenomena can be given to describe the changing context in which travel and tourism is developing: \n\n• Acceleration of change: Today mankind is witnessing rapidly evolving technological progress; a major feature of this progress is the steadily shrinking time interval between the introduction of new inventions and innovative products and their replacement by even newer ones. A brief look at the field of microcomputers may illustrate this process. Eight-bit processors, which formed the basis for modern personal computers at the end of the seventies, which radically changed the habits of computer scientists and lead also to a broad diffusion of these machines, are now outmoded, they are already special objects of historic interest, suitable for museums. Such frontiers as limited memory capacity or speed of \"early\" personal computing have been passed over within a short period, e.g., the processing cost of one instruction per second has fallen from 100 USD in 1975 to 0,01 USD in 1995. \n\n• Knowledge-based economies: This is paralleled by the growth of the so-called knowledge based industries (e.g., high technology manufacturing, communication and IT services, finance). This term emphasizes innovation, information and technology, where knowledge has become a critical factor and source of competition. Knowledge is acquired through investments in research and development, innovation and education. As a matter of fact, international R&D spending has grown over the last 15 years and R&D oriented companies have shown a strong performance. Major challenges are how to codify knowledge and turn it into a strategic advantage, and how to transform a company into a learning organization that values, develops and rewards knowledge. \n\nGiven the rapidly growing number of scientific results, technological changes and new products, potential users are confronted with the problem of monitoring developments and using them for their own needs. Even the specialist has difficulties to remain abreast of innovations in the field and to evaluate seriously all or only a major part of them. Bibliographical databases are almost exploding, and it is quite impossible to read all new publications in even one area of research. An original description of the problem of keeping up with publications in a limited field is given in Schwendter (1982). The problem of information overload has become exacerbated with the growth of the World Wide Web, where the amount of available information is growing so fast, that it is already hard for experts to find their information. Society will be differentiated into those who are able to use the information provided and those, who are overtaxed by this development, creating a new distinction between winners and losers.\n\n• Man - machine systems: Modern society can be characterized by the importance or even dominance of man - machine systems. We live in a technical and man-made environment and nearly all interactions between a person and his environment are carried out via or with the help of instruments. It seems adequate to use the term \"system\" for this type of interaction. Technical artifacts are an important requisite for the development of tourism, enabling traveling. Historically, the mechanical parts of a system had a subordinate role; they were controlled by the human. But technology liberated human beings from certain physical tasks and efforts. In current man - machine systems, both for material and information processing, machines play a more important role and are no longer restricted to physical work. They may also be responsible for controlling tasks in the complicated interaction between humans and the environment. In fact, the impression may be evoked that machines might, sooner or later, liberate themselves from control by human beings. This latter development is caused prominently by the computer. A computer can store, display and transform information, therefore differing significantly from all other information-handling machines, i.e., telephones, television, photography, etc. Its ability to transform data from one representation to another, to store the description of a data transformation in the same way and form as the data themselves, gives the computer the power to model partially the human brain and some of its tasks. Originally developed for freeing human beings from repetitive calculation tasks (Goldstine 1971), its capacity for storing vast amounts of data and for controlling the work of other machines was soon recognized. In a sense a computer can be seen as a general-purpose machine which needs only some extremities for fulfilling specific tasks. \n\nComputers are more than very fast calculators for repetitive or complex operations and storage devices for vast amounts of data. With progress in such fields as Artificial Intelligence (AI), they show even more significantly their capacity to support or to replace humans in their traditional area of creative or analytic thinking. Nowadays, they invade nearly all spheres of human life, and even if not all-technical forecasts have become true, they can give some indication about the future progress of man - machine systems. However, this is a pure engineering perspective and approach. Again we face a dialectic situation: producing everything that can be done we inevitably result in social and political movements questioning such a progress. Experiences from biology and ecology suggest to be cautious about second order effects and unintended side effects in complex systems.\n\n• Convergence: In a technical perspective, different technologies can be integrated by the means of computing technology, e.g.. computers guide vehicles, control power plant and airplanes, they integrate other artifacts into becoming one big machine. Computers enable by the means of digitization the convergence of different media such as video, graphics, text and sound. From a processing point of view digital media are all the same. In some cases the digital representation is so perfect that the human perception cannot draw any distinction. This might lead to a „loss„ of reality, what is the difference between the simulation and the object shown. Tourists experience their vacation site through the frame obtained by viewing an interactive video and the model obtained from it. Real or virtual things, we are already so much used to both that we might have severe problems to identify the difference. \n\nThe loss of boundaries can be also seen in the area of social differentiation, where no clear distinction exists anymore between different groups. We are belonging to the various groups at the same time with varying degrees of membership. Democratic processes have to be reviewed. For example, with the growing number of Internet users and participants in electronic discussion groups, these groups without national boundaries are becoming increasingly important, influencing political and economic processes. The story about a bug in the Intel Pentium processor illustrates the power of virtual communities. The bug was initially reported to Intel, which did however not admit the severity of the problem until after a storm of protest was raised by Internet discussion groups. \n\nThe similar dialectic process of blurring national boundaries can be observed, e.g., in the ongoing political unification of Europe. Political boarders can not easily be removed, and, in the period of decreasing sociological differentiation, the difference between rich and poor is becoming even more important. This process raises the question of identity, creating or enforcing the need for local as well as social and cultural self-determination. We are witnessing this every day on TV. Which again raises, however, the issue of distance, being close to processes we could not observe in the past. This is again related to the problem of reality, the picture we see is at the best an approximation, created by a mainly technically determined environment.\n\n• Globalization, organization and complexity: Modern society can also be described with the notion of complexity. In trying to identify single aspects of society by using a social, economic, ecological, or cultural point of view, one realizes an ongoing trend towards organization with a simultaneous growth of interdependencies. Phenomenologically, large-scale, international and globally acting organizations can be taken as evidence for this process. They might be subdivided into several divisions, each existing and working independently, but on an overall level they have manifold and strong connections. Underlying this observable growth of organizations is the process of globalization, where transglobal companies have revenues exceeding the GDP of small countries. Increasingly dense and complex international inter-firm collaborations (i.e., joint ventures, participations) can be observed. For example, the annual number of new collaboration agreements has doubled in the 1980s; they enable firms to do projects, which exceed individual technical and financial resources. This is especially true for R&D agreements.\n\nIn general, there seems to be a correlation between the growth of such organizations on the one hand, and complexity, on the other. From a historical point of view, large-scale organizations with a parallel high degree of interrelationships represent a new development. As in the case of the above-mentioned progress in technology and information processing, they are at the same time causes and results of industrial changes. Another important feature is related to the growing size and interdependence of organizations. Large organizations are also large information processing systems. The ability to digest information is one of the preconditions for their functioning. In fact, the work of most of them is predominantly in information processing. The complexity of today's society is correlated with the information processing machinery, which also produces too much information. In that sense modern information processing applications increase complexity as well as uncertainty. The most recent example is the World Wide Web. It enables a well-organized description and representation on a micro level and at the same time it is nearly impossible to structure properly the billions of loosely related documents and to query this information cloud. \n\nAnd yet, information and its management appear to be the only means to reduce uncertainty, implying IT applications. Together with education and formation it may support human beings to reduce complexity and to understand the world and its phenomena, thus, providing orientation and improving decision processes. This is also important for tourism, to which all the previous features can be applied. In order to enable sustainable growth, to guarantee a healthy physical and human environment, a satisfied and well-served tourist, the industry has to understand these issues. IT may help to ease some of the problems by appropriate information processing and dissemination. Let us give a brief remark related to Orwell’s 1984 and the respective discussion about a computer-controlled society. Although these fears cannot be put away, a fairly different development can be observed: \n\n• The Internet represents a worldwide electronic network with free, uncontrolled and cheap access, although up to now the Northern and Western Hemisphere have benefited the most. The network has no central controlling institution. The decentralized, federalistic one might even say anarchic form of organization, where everybody can do what he/she wants, enabled its fast growth, but has led also to problems with unstructured and sometimes also offensive information content. New forms of communications and group building, crossing any borders, can be observed, creating new democratic processes, orthogonal to the classical ones defined along geographical boarders.\n\n• This new networked infrastructure runs contrary to the classical host determined and centralized networks of the past. PC based distributed software enables autonomous work for the individual, cooperation is enabled; for example, by Computer Supported Cooperative Work tools (CACM 1991). Also in the software production process one can find such developments as participatory design approaches, putting emphasis on the empowerment of the future users, integrating them already in the design phase of a software product (CACM 1993).\n\n• Easy-to-use devices enable an easier access for households and small companies, which were previously excluded from this form of infrastructure, thus, creating a comparative advantage for small entities. This is especially important for tourism with its huge number of small enterprises - within the EU 95% of the hotel and restaurant sector are small and medium enterprises (SMEs) - and its worldwide consumer community - estimates say that there will be approx. 700 Mn tourists in the year 2000.\n\nHowever, we want to underline that the positive, enabling effects are only one side of the coin. IT can also be used to control human beings, their life and work, and thus, contribute to a repressive society. But it possesses inherent features, which may contribute to an open society. This, however, depends on the human beings that are developing and using it.\n\nAlthough the ongoing changes in the tourism industry can be observed, the entire situation is rather chaotic. Only few quantitative empirical data are available about, for example, new entrants in the tourism market or the modified roles of existing players. It is thus the purpose of this work to provide a common methodological approach and to create awareness of a new research field. This has not been sufficiently recognized up to now, which is also reflected in the literature. Only few books exist which deal with this topic, articles are spread over different fields with their own journals and conferences. But this is changing. The number of conferences and workshops is increasing, e.g., the international conference on IT and tourism, ENTER, is now already in its sixth year. Numerous other conferences followed. Several newsgroups in the Internet deal with that topic; among the most prominent is infotec-travel, moderated by Marcus Endicott. International associations and bodies start to occupy themselves with the topic, and a special federation - IFITT (International Federation for Information Technology and Tourism) has been founded. Moreover, a number of books have been recently published, e.g. Inkpen (1998) and Sheldon (1997). \n\nThe book is synthesizing and analyzing the current situation, trying to set the stage and to show ways of future research. A common methodological approach and framework should enable the analysis of the ongoing processes and the underlying trends. Both, from a technological as well as from a management point of view, the work is focusing on interorganizational processes and information systems, it takes a network oriented approach, corresponding with the fact that travel and tourism is an interorganizational business. In order to provide a coherent picture, the work is located within a multi-disciplinary triangle of the scientific fields such as \n• tourism research, \n• information technology and computer science, and\n• management science. \n\nBased on these scientific fields, different perspectives will be pursued and integrated:\n• a market and industry perspective, looking at trends in the tourism industry,\n• an analysis of the value chain and its redesign induced by modern information and communications technologies,\n• a discussion of organizational impacts and the implications on management strategies, focusing on a business (network) redesign.\n\nFollowing this industry and network perspective a further differentiation will be used, creating a multidimensional framework. The differentiation regards\n• a structural / functional view identifying\n the stakeholders,\n their relationships and the network, and\n phases of transactions, tasks and processes,\n• the information needs with respect to time, both from the consumers' as well as the suppliers' side\n before travel,\n during vacation, and\n after travel,\n• different planning perspectives\n long term planning and product creation, and\n short term utilization and yield management.\n\nTaking into consideration widely unavailable quantitative data, we take a rather qualitative and exploratory methodological approach, working with analogies, based on general trends, and using empirical evidence and case studies where possible in order to underline our arguments. Moreover, we take a bottom up as well top down approach, looking on one side at the tourism industry, identifying its structure, nature and needs. On the other side we use the technology and management science field to draw conclusions and to identify possible future developments within the tourism industry. We are aware of the fact that this approach cannot provide a formal proof of our arguments, as, for example, in formal sciences. However, by putting all the different ingredients into a common framework we hope to provide a comprehensive and consistent picture. The multidisciplinary framework of our approach is shown in the following figure.\n\nFig. 1: Conceptual framework\nThe structure of the book follows this approach; it contains several chapters dealing with IT and its trends as well as management science in order to provide basic methods for an analysis of the tourism industry and its ongoing changes. It should be noted, however, that these chapters only give general overviews and no in-depth insights. Extensive literature references provide the reader with information for a more detailed follow up. Thus, this work is also an invitation to others active in the field for further research. In this way, we hope to contribute to the process of theory building in the field and to extend the related knowledge base. \n\nChapter 1 gives a general introduction and provides some empirical evidence of the ongoing changes within the travel and tourism industry, referring also to overall economic trends. Chapter 2 has to be seen as a structural view of the tourism industry, identifying the different types of players, the nature of the tourism business and tourism product. Chapter 3 discusses major trends in information technology as well as in computer science. It shows the role of information systems within and between companies. Major developments in both the hardware and the software domain are reviewed; subchapters deal with different types of networks including and leading to the Internet and the Web, data modeling and software engineering, intelligent applications, and possible means of integration. Chapter 4 represents a toolbox of different management science methods, enabling the understanding of ongoing structural changes and the formulation of business strategies. Chapter 5 refers to case studies, providing empirical evidence of our arguments. It discusses several IT applications in travel and tourism, including CRS/GDS, electronic destinations and on-line servers. Chapter 6 deals with management implications, the problem of decision-making and the alignment of strategies. \n\nThe target audience of this book, which is both practical and theoretical by building a framework based on real cases and practical examples, is at the interface between tourism and IT as well as between industry and academia. It is directed towards the IT sector in discussing the structure and the dynamics of the tourism sector, and in presenting its challenges for the IT field, both on a technical as well as an implementation level. Another target group is the tourism community, consisting of the private industry, public institutions and consulting companies, since we discuss the dynamics of IT and its impact on tourism. Students in both fields should also read it. This emerging discipline should be included in both curricula, since a main obstacle for the development, implementation and operation of successful IT applications in tourism is the missing interdisciplinary and interrelated know how. \n\nWe hope that at the end the readers will also be able to understand that the processes described are neither inevitable nor deterministic, induced by some exogenous forces which can not be influenced, but that the management, both from private companies as well as from public institutions, has not only ways and means to influence these processes but is also responsible for the ways in which they appropriate IT.\n\nAcknowledgments \nSpecial thanks goes to our home institutions, the Institute for Statistics, Operations Research and Computer Methods at the University of Vienna, Austria, and the Institute for Information Systems at the University of Münster, Germany, for giving us the time, the infrastructure as well as the intellectual support necessary to do this research. We are grateful to IFITT and the TIS company (Tourism Information System) and the Tirol Tourist Board, Austria, which were at the forefront of this development. They enabled us to evaluate our theories and ideas within real life testbeds, sometimes correcting - in a nice way and with an attitude of friendship - our academic ignorance and too abstract view of real life problems. \n\nThe emergence of this book was influenced by our contacts with many colleagues. Many of the insights presented are results of discussions and exchange of ideas with them. Without these contacts, especially in a field that is interdisciplinary by its nature, the book wouldn’t have been possible. Those who contributed include J. Broukal, D. Buhalis, R. Carter, A. Ebner, M. Endicott, P. Fankhauser, D. Fesenmaier, E. Fleisch, K. Fröschl, A. Göldi, P. Hart, M. Hitz, J. Jafari, K. Kärcher, J. Küng, S. Lanfranco, M. Lindemann, J. Margreiter, S. Meis, L. Nell, J. Oliver, K. Plankensteiner, L. Press, B. Pröll, J. Rafferty, H. Schad, W. Schertler, B. Schmid, P. Schubert, D. Selz, G. Simonitsch, I. Starry, O. Stock, A. Tjoa, N. Tschanz, M. Uysal, S. Wayne, K. Wöber. Thanks go to C. Böckers for administrative and logistical support. We are grateful to S. Schilgerius from Springer Verlag, both for her patience and persuasiveness. Our special thanks go to also to Springer Verlag for prove-reading the manuscript. We are, however, the only responsible for any errors and misunderstanding this work may still contain.","authors":["H. Werthner","Stefan Klein"],"meta":["January 1999","DOI:10.1007/978-3-7091-6363-4","Publisher: Springer Verlag WienISBN: 3-211-83274-2"],"references":[]}