{"id":"243715818_The_Surprising_Impact_of_Seat_Location_on_Student_Performance","abstract":"Every physics instructor knows that the most engaged and successful students tend to sit at the front of the class and the weakest students tend to sit at the back. However, it is normally assumed that this is merely an indication of the respective seat location preferences of weaker and stronger students. Here we present evidence suggesting that in fact this may be mixing up the cause and effect. It may be that the seat selection itself contributes to whether the student does well or poorly, rather than the other way around. While a number of studies have looked at the effect of seat location on students, the results are often inconclusive, and few, if any, have studied the effects in college classrooms with randomly assigned seats.1 In this paper, we report on our observations of a large introductory physics course in which we randomly assigned students to particular seat locations at the beginning of the semester. Seat location during the first half of the semester had a noticeable impact on student success in the course, particularly in the top and bottom parts of the grade distribution. Students sitting in the back of the room for the first half of the term were nearly six times as likely to receive an F as students who started in the front of the room. A corresponding but less dramatic reversal was evident in the fractions of students receiving As. These effects were in spite of many unusual efforts to engage students at the back of the class and a front-to-back reversal of seat location halfway through the term. These results suggest there may be inherent detrimental effects of large physics lecture halls that need to be further explored.","authors":["Katherine K. Perkins","C. E. Wieman"],"meta":["January 2005The Physics Teacher 43(1):30-33","DOI:10.1119/1.1845987"],"references":["252734813_Student_Expectations_in_Introductory_Physics","241575603_The_design_and_validation_of_the_Colorado_Learning_Attitudes_about_Science_CLASS_survey","260505372_Peer_Instruction_A_User's_Manual","258862526_The_Frank_C_Walz_Lecture_Halls_A_New_Concept_in_the_Design_of_Lecture_Auditoria","247126331_Peer_Instruction_A_User's_Manual","241469212_How_Things_Work_The_Physics_of_Everyday_Life_2nd_Edition","239666678_The_Physical_Environment_of_the_School_A_Review_of_the_Research"]}