{"id":"24405835_Genetic_and_demographic_features_of_X-linked_agammaglobulinemia_in_Eastern_and_Central_Europe_A_cohort_study","abstract":"Primary immunodeficiency disorders are a recognized public health problem worldwide. The prototype of these conditions is X-linked agammaglobulinemia (XLA) or Bruton's disease. XLA is caused by mutations in Bruton's tyrosine kinase gene (BTK), preventing B cell development and resulting in the almost total absence of serum immunoglobulins. The genetic profile and prevalence of XLA have not previously been studied in Eastern and Central European (ECE) countries. We studied the genetic and demographic features of XLA in Belarus, Croatia Hungary, Poland, Republic of Macedonia, Romania, Russia, Serbia, Slovenia, and Ukraine. We collected clinical, immunological, and genetic information for 122 patients from 109 families. The BTK gene was sequenced from the genomic DNA of patients with a high susceptibility to infection, almost no CD19(+) peripheral blood B cells, and low or undetectable levels of serum immunoglobulins M, G, and A, compatible with a clinical and immunological diagnosis of XLA. BTK sequence analysis revealed 98 different mutations, 46 of which are reported for the first time here. The mutations included single nucleotide changes in the coding exons (35 missense and 17 nonsense), 23 splicing defects, 13 small deletions, 7 large deletions, and 3 insertions. The mutations were scattered throughout the BTK gene and most frequently concerned the SH1 domain; no missense mutation was detected in the SH3 domain. The prevalence of XLA in ECE countries (total population 145,530,870) was found to be 1 per 1,399,000 individuals. This report provides the first comprehensive overview of the molecular genetic and demographic features of XLA in Eastern and Central Europe.","authors":["Beáta Tóth","Alla Volokha","Alexandr Migas","Malgorzata Pac"],"meta":["July 2009Molecular Immunology 46(10):2140-6","DOI:10.1016/j.molimm.2009.03.012","SourcePubMed"],"references":["247914154_Antiaflatoxigenic_Activities_of_Some_Plant_Aqueous_Extracts_Against_Aflatoxin-B1_Induced_Renal_and_Cardiac_Damage","24205246_Bruton's_tyrosine_kinase_Btk_Function_regulation_and_transformation_with_special_emphasis_on_the_PH_domain","277547277_Bruton_tyrosine_kinase_BTK_in_X-linked_agammaglobulinemia_XLA","223023292_Unusual_Mutations_in_Btk_An_Insertion_a_Duplication_an_Inversion_and_Four_Large_Deletions","221971251_The_gene_involved_in_X-linked_agammaglobulinemia_is_a_member_of_the_SRC_family_of_protein-tyrosine_kinases","51336032_Mutations_in_Btk_in_Patients_with_Presumed_X-Linked_Agammaglobulinemia","31429338_Identification_of_Btk_mutations_in_20_unrelated_patients_with_X-Iinked_agammaglobulinaemia_XLA","15566577_Mutation_analysis_in_Bruton's_tyrosine_kinase_the_X-linked_agammaglobulinaemia_gene_including_identification_of_an_insertional_hotspot","14774531_Deficient_expression_of_a_B_cell_cytoplasmic_tyrosine_kinase_in_human_X-linked_agammaglobulinemia","14226264_X-Linked_Agammaglobulinemia_A_Clinical_and_Molecular_Analysis"]}