{"id":"24429804_CHARMM_The_biomolecular_simulation_program","abstract":"CHARMM (Chemistry at HARvard Molecular Mechanics) is a highly versatile and widely used molecular simulation program. It has been developed over the last three decades with a primary focus on molecules of biological interest, including proteins, peptides, lipids, nucleic acids, carbohydrates, and small molecule ligands, as they occur in solution, crystals, and membrane environments. For the study of such systems, the program provides a large suite of computational tools that include numerous conformational and path sampling methods, free energy estimators, molecular minimization, dynamics, and analysis techniques, and model-building capabilities. The CHARMM program is applicable to problems involving a much broader class of many-particle systems. Calculations with CHARMM can be performed using a number of different energy functions and models, from mixed quantum mechanical-molecular mechanical force fields, to all-atom classical potential energy functions with explicit solvent and various boundary conditions, to implicit solvent and membrane models. The program has been ported to numerous platforms in both serial and parallel architectures. This article provides an overview of the program as it exists today with an emphasis on developments since the publication of the original CHARMM article in 1983.","authors":["B. R. R. Brooks","C. L. Brooks Brooks","Alexander MacKerell","L Nilsson"],"meta":["June 2009Journal of Computational Chemistry 30(10):1545-614","DOI:10.1002/jcc.21287","SourcePubMed"],"references":["287996327_Canonical_Dynamics_Equilibrium_Phase-Space_Distributions","343376370_A_fast_algorithm_for_particle_simulations","329487117_Normal_mode_analysis_of_macromolecules_From_enzyme_active_sites_to_molecular_machines","321604122_Computer_Simulation_of_Biomolecular_Systems_Theoretical_and_Experimental_Applications","317365419_On_the_treatment_of_electrostatic_interactions_in_biomolecular_simulation","317319855_Torsional_motions_of_methyl_and_ammonium_groups_in_the_L-alanine_crystal_a_comparison_of_molecular_dynamics_and_normal_mode_calculations","296824265_Local_deformations_of_polymers_with_nonplanar_rigid_main-chain_internal_coordinates","290493488_Computational_Alchemy","289776784_Computation_of_Intermolecular_Interactions_with_a_Combined_Quantum_Mechanical_and_Classical_Approach","289044778_An_Empirical_Potential_Energy_Function_for_Phospholipids_Criteria_for_Parameter_Optimization_and_Applications"]}