{"id":"244476949_A_Survey_on_Smartphone-Based_Systems_for_Opportunistic_User_Context_Recognition","abstract":"The ever-growing computation and storage capability of mobile phones have given rise to mobile-centric context recognition systems, which are able to sense and analyze the context of the carrier so as to provide an appropriate level of service. As nonintrusive autonomous sensing and context recognition are desirable characteristics of a personal sensing system; efforts have been made to develop opportunistic sensing techniques on mobile phones. The resulting combination of these approaches has ushered in a new realm of applications, namely opportunistic user context recognition with mobile phones.\nThis article surveys the existing research and approaches towards realization of such systems. In doing so, the typical architecture of a mobile-centric user context recognition system as a sequential process of sensing, preprocessing, and context recognition phases is introduced. The main techniques used for the realization of the respective processes during these phases are described, and their strengths and limitations are highlighted. In addition, lessons learned from previous approaches are presented as motivation for future research. Finally, several open challenges are discussed as possible ways to extend the capabilities of current systems and improve their real-world experience.","authors":["Seyed Amir Hoseini tabatabaei","Alexander Gluhak","Rahim Tafazolli"],"meta":["June 2013ACM Computing Surveys 45(3):1-51","DOI:10.1145/2480741.2480744"],"references":["313760365_Where's_the_phone_A_study_of_mobile_phone_location_in_public_spaces","281353803_A_review_of_classification_algorithms_for_EEG-based_brain-computer_interfaces","326876096_Fundamentals_of_Network_Planning_and_Optimisation_2G3G4G_Evolution_to_5G","314735194_Multivariate_Calibration","313203504_Reality_mining_Sensing_complex_social_systems","307930555_Software-Based_Extraction_of_Objective_Parameters_from_Music_Performances","307065704_Statistical_Pattern_Recognition_Second_Edition","305397619_Data_Clustering_A_Review","289277674_Research_methods_Third_edition","285906826_Understanding_individual_human_mobility_patterns_Nature_2008_453_779-782"]}