{"id":"244483277_Pedometer-based_behavioral_change_program_can_improve_dependency_in_sedentary_older_adults_A_randomized_controlled_trial","abstract":"Background: Recent studies suggested that pedometer-based walking programs are applicable to older\nadults. Objectives: The purpose of this study was to evaluate the use of pedometer in sedentary older adults to improve physical activity, fear of falling, physical performance, and leg muscle mass. Design: This was a pilot randomized controlled trial (RCT). Setting and participants: Eighty-seven community dwelling sedentary older\nadults living in Japan. Intervention: The intervention group (n=43) received a pedometer-based behavioural change program for 6 months, while the control group (n=44) did not. The participants in the intervention group were instructed to increase their mean daily steps by 10% each month. Thus, at the end of 6 months, participants in the intervention group were expected to have 77 % more daily steps than their baseline step counts. Written activity logs were monthly averaged to determine whether the participants were achieving their goal.\nMeasurements: Outcome measures were physical activity, fear of falling, physical performances, and leg muscle mass. Results: In this 6-month trial 40 older adults (93%) completed the pedometer protocol with good adherence. In the intervention group, average daily steps were increased by 83.4% (from 20311323 to 3726 1607) during the study period, but not in the control group (from 20471698 to 22671837). The pedometer-based behavioral change program was more effective to improve their physical activity, fear of falling, locomotive function, and leg muscle mass than control (P<0.05). Conclusion: These results suggested that the pedometer-based behavioral change program can effectively improve the physical activity, fear of falling, physical\nperformance, and leg muscle mass in sedentary older adults.","authors":["Yamada M","Mori S","Shu Nishiguchi","Kajiwara Y"],"meta":["January 2012","DOI:10.14283/jfa.2012.7"],"references":["230778785_Sarcopenia_European_consensus_on_definition_and_diagnosis","225507886_Promoting_walking_amongst_older_patients_in_rehabilitation_Are_accelerometers_the_answer","225117211_Physiopathological_mechanism_of_Sarcopenia","332855055_Behavioural_medicine_changing_our_behaviour","317041220_Physical_Activity_and_Public_Health_in_Older_Adults_Recommendation_From_the_American_College_of_Sports_Medicine_and_the_American_Heart_Association","304836538_Aging_Decreases_the_Capacity_of_Human_Skin_to_Produce_Vitamin_D3","232241453_ACSM_Position_Stand_Exercise_and_Physical_Activity_for_Older_Adults","221861756_Sarcopenia_Its_assessment_etiology_pathogenesis_consequences_and_future_perspectives","221861429_Association_between_vitamin_D_status_and_physical_performance_The_InCHIANTI_study","220022412_Pedometer-based_behavioral_change_program_can_improve_physical_function_in_sedentary_older_adults_A_randomized_controlled_trial"]}