{"id":"244793862_A_comparative_study_on_the_antioxidant_activity_of_methanolic_leaf_extracts_of_Ficus_religiosa_L_Chromolaena_odorata_L_King_Rabinson_Cynodon_dactylon_L_Pers_and_Tridax_procumbens_L","abstract":"Objective: To compare the antioxidative effects of the methanolic leaf extracts of Ficus religiosa (F. religiosa), Chromolaena odorata (C. odorata), Cynodon dactylon (C. dactylon) and Tridax procumbens (T. procumbens) as well as the contents of antioxidants in the extracts. Methods: Total phenol and total flavanoid contents were measured according to the standard procedures. The total antioxidant capacity was determined using the phosphomolybdenum method. Reducing power was determined by the potassium ferricyanide reducing method. The free radical scavenging activity was measured by 2,2'-Diphenyl-1-picrylhydrazyl (DPPH) assay. Results: Quantitative phytochemical analysis of total phenol content showed that C. odorata had the highest content of phenolic compounds significantly followed by F. religiosa, T. procumbens and C. dactylon. As for the total flavanoids content, F. religiosa had the highest content, followed by C. odorata, T. procumbens and C. dactylon. Study on the total antioxidant capacity revealed that F. religiosa, C. dactylon and C. odorata showed higher total antioxidant capacity. T. procumbens showed the lowest capacity. Meanwhile, T. procumbens and C. odorata have the highest reducing power activity followed by F. religiosa and C. dactylon. The results of DPPH radical scavenging activity indicated that T. procumbens induced the largest elevation as the concentration of its extract increased, followed by C. odorata and F. religiosa and C. dactylon. Conclusions: The present study demonstrates the antioxidative capacity of all the four plant species. Of all the plants, C. odorata, a perennial weed plant showed potentially a high antioxidant activity, with higher phenolic and flavonoids contents. The data suggest that C. odorata can be best utilized in developing bioantioxidants.","authors":["Krishanti P Melinda","Rathinam Xavier","Kasi Marimuthu","Ayyalu Diwakar"],"meta":["May 2010Asian Pacific Journal of Tropical Medicine 3(5):348-350","DOI:10.1016/S1995-7645(10)60084-3"],"references":["285520427_B_Phytochemical_and_antioxidant_screening_of_some_plants_of_apocynaceae_from_South_West_Nigeria","13085157_Hepatotoxicity_induced_by_the_anti-oxidant_food_additive_butylated_hydroxytoluene_BHT_in_rats_An_electron_microscopical_study","13076463_Spectrophotometric_Quantitation_of_Antioxidant_Capacity_through_the_Formation_of_a_Phosphomolybdenum_Complex_Specific_Application_to_the_Determination_of_Vitamin_E","11562713_Free_Radicals_and_Disease","275152761_Studies_on_products_of_browning_reaction_Antioxidative_activity_of_products_of_browning_reaction_prepared_from_glucosamine","223679941_Antioxidant_activity_of_some_Algerian_medicinal_plants_extracts_containing_Phenolic_compounds","19916745_Two_new_flavonoids_and_other_constituents_in_licorice_root_Their_relative_astringency_and_radical_scavenging_effects","12591074_Polyphenol_Content_and_Total_Antioxidant_Activity_of_Vini_Novelli_Young_Red_Wines","10587348_Antioxidant_and_Free_Radical_Scavenging_Activities_of"]}