{"id":"244898935_Graph_Cuts_and_Efficient_ND_Image_Segmentation","abstract":"Combinatorial graph cut algorithms have been successfully applied to a wide range of problems in vision and graphics. This paper focusses on possibly the simplest application of graph-cuts: segmentation of objects in image data. Despite its simplicity, this application epitomizes the best features of combinatorial graph cuts methods in vision: global optima, practical efficiency, numerical robustness, ability to fuse a wide range of visual cues and constraints, unrestricted topological properties of segments, and applicability to N-D problems. Graph cuts based approaches to object extraction have also been shown to have interesting connections with earlier segmentation methods such as snakes, geodesic active contours, and level-sets. The segmentation energies optimized by graph cuts combine boundary regularization with region-based properties in the same fashion as Mumford-Shah style functionals. We present motivation and detailed technical description of the basic combinatorial optimization framework for image segmentation via s/t graph cuts. After the general concept of using binary graph cut algorithms for object segmentation was first proposed and tested in Boykov and Jolly (2001), this idea was widely studied in computer vision and graphics communities. We provide links to a large number of known extensions based on iterative parameter re-estimation and learning, multi-scale or hierarchical approaches, narrow bands, and other techniques for demanding photo, video, and medical applications.","authors":["Yuri Boykov","Gareth Funka-Lea"],"meta":["November 2006International Journal of Computer Vision 70(2):109-131","DOI:10.1007/s11263-006-7934-5","SourceDBLP"],"references":["257825127_Regularized_Laplacian_Zero_Crossings_as_Optimal_Edge_Integrators","255666787_Hierarchical_Segmentation_Satisfying_Constraints","344749706_Flows_in_Networks","324337656_Flows_in_Networks","313742304_An_impossibility_theorem_for_clustering","313086331_A_Taxonomy_And_Evaluation_Of_Dense_Two-Frame_Stereo_Correspondence_Algorithms","309283917_Level_set_methods_and_dynamic_implicit_surfaces","284653608_Snakes_Active_Contour_Models","271512857_Active_Contours","267077002_Geometric_Partial_Differential_Equations_and_Image_Analysis"]}