{"id":"244988711_A_CS_Unplugged_Activity_for_the_Online_Classroom","abstract":"In this paper, we present a group, asynchronous problem solving exercise designed to introduce non-computer science students to a variety of concepts from artificial intelligence and operations research. The exercise is designed to be a Computer Science (CS) Unplugged activity suitable for the online classroom. CS Unplugged is a methodology for teaching CS concepts using hands-on interactive activities without using a computer. CS Unplugged activities are often used to introduce CS concepts to novices, such as elementary, middle, or high school students; but can also be effective at engaging the non-CS undergraduate student. By definition, CS Unplugged seems at odds with online education, as the participants in the exercise are necessarily using computers. We present an interactive activity motivated by CS Unplugged, but implemented within an asynchronous threaded discussion board. The activity is based on the well-known Bin Packing problem, and is specifically an extension of an existing active learning exercise known as Collective Bin Packing but adapted to the online classroom. The activity is\ndesigned for an undergraduate interdisciplinary course as part of a liberal arts curriculum.","authors":["Vincent A Cicirello"],"meta":["June 2013"],"references":["241623893_CS_Unplugged_and_Middle-School_Students'_Views_Attitudes_and_Intentions_Regarding_CS","234806806_Collective_bin_packing_an_active_learning_exercise","234783181_An_interdisciplinary_course_on_artificial_intelligence_designed_for_a_liberal_arts_curriculum","221538729_Analyze_that_Puzzles_and_analysis_of_algorithms","221538606_A_CS_unplugged_design_pattern","221537432_An_introductory_software_engineering_course_that_facilitates_active_learning","228057735_Computers_And_Intractability_A_Guide_to_the_Theory_of_NP-Completeness","221538710_A_systematic_approach_to_active_and_cooperative_learning_in_CS1_and_its_effects_on_CS2","221537715_An_active_learning_approach_to_teaching_the_data_structures_course","221536739_Active_learning_sheets_for_a_beginner's_course_on_reasoning_about_imperative_programs"]}