{"id":"245039754_An_experimental_study_on_tip_velocity_and_downstream_recirculation_zone_of_single_groynes_of_permeability_change","abstract":"Groynes usually are installed along the river side and those are used for various purposes including flow and erosion control \nand bank protection. Recently, the concern of groynes that provide us with ecological environment and improvement of scenary\nnear river has greatly increased for naturalized river and ecological river restoration. However there is no adequate design\nguideline in Korea. Furthermore there is little research for the installation of groynes in Korea. Especially, since the influence\nfactors of groyne are complexly related to the stream characteristics, hydrologic variables, hydraulic characteristics, and\nlocal variables, the analysis considered the influences of all factors is difficult. For that reason, most of existing researches\nhave been focused about local scour at the tip of groynes with sandy bed condition and flow pattern near groynes and recirculation\nzone. In this study, to evaluate influence factor of the interval of groynes, experiments of flow pattern near groynes and\nrecirculation zone with the variation of permeability, approaching velocity, groyne length, and installed angle have been\nperformed. We also measured the tip velocity of groynes and that is scour factor near groyne. Empirical equations for recirculation\nzone and tip velocity of gryones were determined.","authors":["Hong Koo Yeo","Joon Gu Kang","Sung Jung Kim"],"meta":["December 2005KSCE Journal of Civil Engineering 9(1):29-38","DOI:10.1007/BF02829094"],"references":["268593798_Large-Scale_Particle_Image_Velocimetry-A_Reliable_Tool_for_Physical_Modeling","245328416_Unsteady_surface-velocity_field_measurement_using_particle_tracking","245328228_Large-Scale_Particle_Image_Velocimetry_for_Flow_Analysis_in_Hydraulic_Engineering_Applications","245297243_Scale_Effects_in_Flume_Experiments_on_Flow_around_a_Spur_Dike_in_Flatbed_Channel","245296274_Geometry_of_Scour_Holes_Associated_with_90_Spur_Dikes","245295611_2-D_Depth-Averaged_Flow_Computation_near_Groyne","245294922_Flow_Near_Groin-Like_Structures","239435422_TECHNICAL_NOTE_OBSERVATIONS_OF_FLOW_PATTERNS_AROUND_SOME_SIMPLIFIED_GROYNE_STRUCTURES_IN_CHANNELS"]}