{"id":"245169538_Flow_distribution_in_manifolded_solar_collectors_with_negligible_buoyancy_effects","abstract":"To understand the influence of collector design parameters on the flow distribution among the solar collector absorber tubes, and as a first step to any detailed analysis of the influence of flow on heat transfer in the collector and on its consequent thermal performance, this study investigates the distribution of flow through a typical system consisting of two manifolds connected by a number of parallel riser tubes. No thermal effects, such as buoyancy, are taken into account. A discrete hydrodynamic model was developed for this system, and the resulting set of simultaneous nonlinear algebraic equations was solved numerically for 54 different combinations of the major independent variables. Quantitative flow distribution results are presented. In the investigated range, it was determined that the three parameters which have the major influence on flow distribution are, in the order of significance, the ratio of riser diameter to manifold diameter, the number of risers, and the length of the risers, with maldistribution increasing with the increase of the first two and with the decrease of the third one. To demonstrate the most dramatic influence, changing the value of d[sub r]/d[sub i] from 0.25 to 0.75 causes the peak riser flow excess above the average flow to increase 100-fold: from 5% for the first diameter ratio, to 500% for the second. Consistent with his finding, pressure changes in the system arising from inertia in the manifolds become larger than the frictional pressure changes in the risers when the riser tube length-to-diameter is decreased below about 75, causing large flow maldistribution. Predictions from the model are successfully compared with limited experimental data and with the closed-form solutions of two existing models.","authors":["Gerard F. Jones","Noam Lior"],"meta":["March 1994Solar Energy 52(3):289-300","DOI:10.1016/0038-092X(94)90496-0"],"references":["253833824_Isothermal_flow_distribution_in_solar_collectors_and_collector_manifolds","50332070_Applied_Numerical_Methods","285478644_Mechanics_of_Manifold_Flow","283875143_CONJUGATE_HEAT_TRANSFER_AND_FLOW_DISTRIBUTION_IN_AN_ASSEMBLY_OF_MANIFOLDED_FINNED_TUBES","283874879_OPTIMAL_FLOW_CONFIGURATION_IN_SOLAR_COLLECTOR","274053032_A_model_for_flow_distribution_in_manifolds_J_Eng_Power_Trans_ASME","256334586_Analysis_and_performance_of_flat-plate_solar_collector_arrays","256138851_Flow_distributions_in_manifolds","252487863_Flow_Distribution_Manifold","245520790_Flow_in_Distribution_Conduits","245355883_The_Effect_of_Friction_on_Flow_Distribution_in_Dividing_and_Combining_Flow_Manifolds","245168962_The_effect_of_nonuniform_fluid_flow_distribution_on_the_thermal_performance_of_solar_collector","245089349_Flow_distribution_in_parallel_and_reverse_flow_manifolds","244114071_Flow_distribution_and_pressure_drop_in_plate_heat_exchangers-II_Z-type_arrangement","239909909_Flow_distribution_in_solar_absorber_bank","239365322_Consideration_of_the_heat-removal_factor_for_liquid-cooled_flat-plate_solar_collectors","236419698_Simple_balancing_technique_for_liquid_cooled_flat_plate_solar_collector_arrays","233215313_Isothermal_flow_distribution_in_header_systems","231292625_Flow_distribution_in_piping_manifolds","229253614_Flow_distribution_and_pressure_drop_in_plate_heat_exchangers-II_Z-type_arrangement"]}