{"id":"245289616_Three-Dimensional_CFD_Predications_and_Experimental_Comparison_of_Pressure_Drop_of_Some_Common_Pipe_Fittings_in_Turbulent_Flow","abstract":"A three-dimensional computational fluid dynamics (CFD) model has been constructed to simulate fluid flow in two commonly used pipe fittings: An elbow and a T-joint using the STAR-CD code. A k-ε Chen model suitable for high Re numbers flows was used for that purpose. Two flow configurations were used for the T-joint. In the first, the flow enters through the middle leg of the fitting; and in the second, the flow enters from one of the ends and exits from the other two outlets. The Re number for the flow simulations was varied between 0.78 × 10 5 and 1.56×10 5 to simulate a variety of flow conditions with approximately six uniformly distributed values of Re numbers chosen between these limits. The velocity profile indicated some flow reversal regions near the inner radius and some high velocity regions near the outer radius downstream of the elbow. Pressure profiles showed significant changes from a high value on the outer radius to a low one on the inner radius. The T-joint flow case into the center leg showed recirculation regions immediately downstream of the elbows, and high velocity values just downstream from the stagnation zone. The pressure profile for that arrangement showed significant pressure gradients across the flow area before the flow splits into the two legs. For the straight leg inflow case, the velocity shows flow reversals in the 90° bend and the pressure drop is large along the 90° bend as opposed to the straight leg. The simulation uses a flow split of 50-50 between those legs. The simulations agree reasonably well with recently published experimental results. For the T-joint and with the flow introduced through the straight branch (T-joint-Inlet Case B), the difference in pressure drop for the straight run and branch flow was 7.76% and 18.38%, respectively. For the elbow, the difference was 8.1% lower than the experiment. Comparisons were also made with values supplied by the ASHRAE Handbook for K values, i.e., minor loss factors.","authors":["Samir Moujaes","S. Deshmukh"],"meta":["August 2006Journal of Energy Engineering 132(2)","DOI:10.1061/(ASCE)0733-9402(2006)132:2(61)"],"references":["293385575_Incorporating_matlab_and_fluent_in_an_introductory_computational_fluid_dynamics_course","287889691_Pressure_loss_data_for_PVC_pipe_tees","287889690_Pressure_loss_data_for_PVC_pipe_elbows_reducers_and_expansions","267609166_Presentation_of_a_Numerical_3D_Approach_to_Tackle_Thermal_Striping_in_a_PWR_Nuclear_T-Junction","254506218_Computational_Fluid_Dynamics_CFD_Model_for_Phase_Separation_at_Branching_Tee_Junctions","245094040_A_CFD_based_correlation_for_mass_transfer_coefficient_in_elbows","244964302_CFD_prediction_of_k-factor_of_duct_elbows","238166355_Erosion_prediction_in_slurry_pipeline_tee-junctions","236362313_Irrecoverable_pressure_loss_coefficients_for_two_elbows_in_series_with_various_orientation_angles_and_separation_distances","229888927_Gas-liquid_flow_through_horizontal_tees_of_branching_and_impacting_type","229383306_Gas-solid_flow_behavior_in_a_horizontal_pipe_after_a_90_vertical-to-horizontal_elbow","8526749_Computational_Fluid_Dynamics_CFD_Study_of_the_4th_Generation_Prototype_of_a_Continuous_Flow_Ventricular_Assist_Device_VAD"]}