{"id":"245222306_Modelling_dual_carriageway_lane_changing_using_neural_networks","abstract":"Neural networks offer a potential alternative method of modelling driver behaviour within road traffic systems. This paper explores the application of neural networks to modelling the lane-changing decisions of drivers on dual carriageways. Two approaches are considered. The first, preliminary approach uses a prediction type of neural network with a single hidden layer and the back propagation learning algorithm to model the behaviour of an individual driver. A series of consecutive time-scan traffic patterns, which describe the driver's environment and changes over time as the selected vehicle travels along a link, are input to the neural network, which then predicts the new lane and position of the vehicle. Training data are collected from a human subject using an interactive driving simulation. The trained neural network successfully exhibited the rudiments of driving behaviour in terms of lane and speed changes. A major disadvantage of this approach was the difficulty in recording real-life data, which are required to train the neural network, for individual drivers. The second approach concentrates specifically on lane changing and makes use of a learning vector quantization classification type of neural network. Input to the neural network still consists primarily of time-scan traffic patterns, but the format is changed to facilitate the possibility of data acquisition using image processing. The neural network output classifies the input data by determining the new lane for the vehicle concerned. Performance in both testing and training was very good for data generated by the rule-based driver-decision model of a microscopic simulation. Performance in testing was less satisfactory for data taken directly from a road and highlighted the need for extensive data sets for successful training.","authors":["J. G. Hunt","Glenn Lyons"],"meta":["December 1994Transportation Research Part C Emerging Technologies 2(4):231-245","DOI:10.1016/0968-090X(94)90012-4"],"references":["311569810_Learning_vector_quantization","292871236_The_use_of_neural_networks_to_recognise_and_predict_traffic_congestion","269089839_Traffic_Models_-_A_Role_for_Neural_Networks","262250840_Learning_Vector_Quantization","242620672_Parallel_Networks_That_Learn_to_Pronounce_English_Text","230876435_Learning_Internal_Representation_by_Error_Propagation","224755193_The_influence_of_training_sets_on_generalization_in_feed-forward_neural_networks","224740420_Handwritten_numeral_recognition_by_multilayered_neural_network_with_improved_learning_algorithm","221619854_Alvinn_An_Autonomous_Land_Vehicle_in_a_Neural_Network","3592533_Computer_vision_and_neural_networks_for_traffic_monitoring","3538009_Progress_in_neural_network-based_vision_for_autonomous_robot_driving","3529610_A_generalization_technique_for_nearest-neighbor_classifiers","3527837_Estimation_of_generalization_capability_by_combination_of_new_information_criterion_and_cross_validation","3493330_Modeling_human_performance_with_neural_networks","3493228_Improved_Version_of_Learning_Vector_Quantization","3249749_An_Introduction_to_Computing_with_Neural_Nets","3194811_Pattern_Classification_Using_Neural_Networks"]}