{"id":"245414025_ANN-Based_Forecasting_of_Foreign_Currency_Exchange_Rates","abstract":"In this paper, we have investigated artificial neural networks based prediction modeling of foreign currency rates using three learning algorithms, namely, Standard Backpropagation (SBP), Scaled Conjugate Gradient (SCG) and Backpropagation with Bayesian Regularization (BPR). The models were trained from historical data using five technical indicators to predict six currency rates against Australian dollar. The forecasting performance of the models was evaluated using a number of widely used statistical metrics and compared. Results show that significantly close prediction can be made using simple technical indicators without extensive knowledge of market data. Among the three models, SCG based model outperforms other models when measured on two commonly used metrics and attains comparable results with BPR based model on other three metrics. The effect of network architecture on the performance of the forecasting model is also presented. Future research direction outlining further improvement of the model is discussed. Keywords-Neural network, ARIMA, financial forecasting, foreign exchange","authors":["Joarder Kamruzzaman","Ruhul Sarker"],"meta":["January 2004"],"references":["245712720_Comparing_ANN_Based_Models_with_ARIMA_for_Prediction_of_Forex_Rates","332677785_Application_of_Neural_Networks_to_an_Emerging_Financial_Market_Forecasting_and_Trading_the_Taiwan_Stock_Index","316753002_A_Scaled_Conjugate_Gradient_Algorithm_for_Fast_Supervised_Learning","284901604_The_Levenberg-Marquardt_Algorithm_Implementation_and_Theory","284868064_Time_Series_Analysis_Forecasting_and_Control","247144358_Performance_of_Neural_Networks_in_Managerial_Forecasting","246906312_Multiresolution_forecasting_for_future_trading_using_wavelet_decomposition","245578497_Backpropagation_neural_nets_as_models_for_time_series_forecasting","243668613_McClelland_and_the_PDP_Research_Group","239060777_Mor_JJ_The_Levenberg-Marquardt_algorithm_Implementation_and_theory_Numer_Analysis_630_105-116"]}