{"id":"245536425_Practice_of_Ergonomic_Principles_and_Computer_Vision_Syndrome_CVS_among_Undergraduates_Students_in_Chennai","abstract":"ABSTRACT\nBackground: With increasing use of computers by young adults in educational institutions as well as at home there\nis a need to investigate whether students are adopting ergonomic principles when using computers.\nObjective: To assess the practice of students on ergonomic principles while working on computers and their\nassociation with the symptoms of Computer Vision Syndrome (CVS).\nMethodology: A cross-sectional study was conducted among the undergraduate students using pre-tested\nstructured questionnaire on the demographic profile, practice of ergonomic principles and symptoms of CVS\nexperienced while on continuous computer work within the past one month duration.\nResults: Out of 416 students studied, 58% of them viewed computer at a distance of 20 to 40 inches, 61 % viewed\nthe computer screen at the same level, 42.8% placed the reference material between monitor and key board, 24.5%\ntilted screen backward and 75.7% took frequent breaks to prevent CVS. Students who viewed the computer at a\ndistance of less than 20 inches, viewed upwards or downwards to see the computer, who did not avoid glare and did\nnot took frequent breaks were at higher risk of developing CVS. Students who did not used adjustable chair, height\nadjustable keyboard were at higher risk of developing neck and shoulder pain.\nConclusion: The students who were not practicing ergonomics principle and did not check posture and make\nergonomic alteration were at higher risk of developing CVS.\nKeywords: Ergonomic principles, computer vision syndrome, undergraduate students.","authors":["Logaraj Muthunarayanan","V. Madhu Priya","Seetharaman N","Shailendra Kumar Hedge"],"meta":["June 2013"],"references":["228902626_Potential_health_problems_faced_by_an_Asian_youth_population_with_increasing_trends_for_computer_use","284212809_The_Effect_of_Computer_Workstation_Design_on_Student_Posture","273814315_Computer_related_health_problems_among_software_professionals_in_Mumbai_A_cross-sectional_study","267834360_Effects_of_VDT_Viewing_Angle_on_User_Biomechanics_Comfort_and_Preference","263382186_Reports_of_Visual_Fatigue_Resulting_From_Use_of_a_Video_Display_Unit","228652975_Impact_of_Computer_Workstation_Design_on_Health_Users","41467166_A_Study_of_Visual_and_Musculoskeletal_Health_Disorders_among_Computer_Professionals_in_NCR_Delhi","15924211_Visual_Fatigue_and_Occupational_Stress_in_VDT_Operators","15364414_Identification_of_the_preferential_gaze_position_through_elevation_of_visual_fatigue_in_a_selected_group_of_VDU_operators_A_preliminary_study","15181841_Eye_discomfort_and_work_with_visual_display_terminals"]}