{"id":"245568872_Integrated_Multiple_Simulation_for_Optimizing_Performance_of_Stock_Trading_Systems_based_on_Neural_Networks","abstract":"There are many researches about the intelligent stock trading systems with the help of the advance of the artificial intelligence such as machine learning techniques, Though the establishment of the reasonable trading policy plays an important role in the performance of the trading systems most researches focused on the improvement of the predictability. Also some previous works, which treated the trading policy, treated the simplified versions dependent on the predictors in less systematic ways. In this paper, we propose the integrated multiple simulation` as a method of optimizing trading performance of stock trading systems. The propose method is adopted in the NXShell a development environment for neural network based stock trading systems. Under the proposed integrated multiple simulation`, we simulate the multiple tradings for all combinations of the neural network`s outputs and the trading policy parameters, evaluate the learning performance according to the various metrics and establish the optimal policy for a given prediction module based on the resulting performance. In the experiment, we present the trading policy comparison results using the stock value data from the KOSPI and KOSDAQ.","authors":["Jae-Won Lee","Jang-Min O"],"meta":["April 2007The KIPS Transactions PartB 14B(2):127-134","DOI:10.3745/KIPSTB.2007.14-B.2.127"],"references":["3412367_iJADE_Stock_Advisor_An_Intelligent_Agent_Based_Stock_Prediction_System_Using_Hybrid_RBF_Recurrent_Network","242566941_Technical_Analysis_of_Stock_Trends","221465347_A_Multi-agent_Q-learning_Framework_for_Optimizing_Stock_Trading_Systems","220314975_Adaptive_stock_trading_with_dynamic_asset_allocation_using_reinforcement_learning","220314686_Hybrid_genetic-neural_architecture_for_stock_indexes_forecasting","5602298_Learning_to_trade_via_direct_reinforcement","4895880_Long-Term_Memory_in_Stock_Market_Prices","3906964_Stock_selection_using_Support_Vector_Machines"]}