{"id":"245875187_Discourse_functions_and_syntactic_complexity_in_synchronous_and_asynchronous_communication_Electronic_version","abstract":"The present study investigates discourse functions and syntactic complexity in English-as-a-second-language (ESL) learner output obtained via two different modes of computer-mediated communication (CMC): asynchronous and synchronous discussions. Two instructors and twenty-five students from two advanced ESL writing classes participated in this study. Answers were sought to the following questions: a) Are the discourse functions present in ESL learners' synchronous discussions of reading assignments quantitatively and qualitatively different from those found in asynchronous discussions? And, b) which mode of CMC shows more syntactically complex learner output? The results showed that the quantity and types of discourse functions present in synchronous discussions were similar to the types of interactional modifications found in face-to-face conversations that are deemed necessary for second language acquisition. Discourse functions in asynchronous discussions were more constrained than those found in synchronous discussions and similar to the question-response-evaluation sequence of the traditional language classroom. Concerning syntactic complexity, the delayed nature of asynchronous discussions gives learners more opportunities to produce syntactically complex language. Asynchronous and synchronous CMC have different discourse features which may be exploited for different pedagogical purposes. In the hands of experienced teachers, both modes of CMC can be used as novel tools to enhance the language acquisition process by encouraging interaction among participants, collaborative text construction, and the formation of electronic communities of learners.","authors":["Susana Sotillo"],"meta":["May 2000Language, Learning and Technology 4(1)"],"references":["292312774_CALL_in_the_year_2000_Still_developing_the_research_agenda","292018441_Research_questions_for_a_CALL_research_agenda_A_reply_to_Rafael_Salaberry","291894126_The_social_origins_of_individual_mental_functioning_Alternatives_and_perspectives","290039215_Unequal_election_of_morphemes_in_adult_Second_Language_Acquisition","275876847_The_Syntactic_Complexity_of_Written_Texts_in_Spanish_as_a_Foreign_Language_A_Markedness_Perspective","262285567_Seeing_students_as_writers","254301894_Subordination_and_Linguistic_Complexity","240920896_The_internet-based_composition_classroom_A_study_in_pedagogy","234654150_T-Unit_Analysis_in_Second_Language_Research_Applications_Problems_and_Limitations","234574142_Extending_the_Dialogue_Using_Electronic_Mail_and_the_Internet_To_Promote_Conversation_and_Writing_in_Intermediate_German_Language_Courses","227614631_Measures_of_Linguistic_Accuracy_in_Second_Language_Writing_Research","225678177_Message_size_constraints_on_discourse_planning_in_synchronous_computer-mediated_communication","223325356_Using_Computer_Networking_to_Facilitate_the_Acquisition_of_Interactive_Competence"]}