{"id":"246277510_Lactate_Threshold_D-Max_Method_and_Maximal_Lactate_Steady_State_in_Cyclists","abstract":"Lactate Threshold (D-Max Method) and Maximal Lactate Steady State in Cyclists\nThe Maximal Lactate Steady State (MLSS) is defined as the highest workload that can be maintained over time where there is a balance between lactate production and lactate clearance. Therefore, determination of this workload is very importance for diagnosis of aerobic capacity and training program design.\nThe main objective of this study was to evaluate the validity of lactate threshold values determined by the D-max method as related to MLSS in cyclists. The research material included 10 female (body height 167±5.7 cm; body mass 56±4.8 kg; percent body fat 12.3±2.1) and 10 male well-trained cyclists (body height 183.5±4.4 cm; body mass 73.2±4.1 kg; percent body fat 7.9±2.6). The research had two distinct phases, separated by one day of active recovery. During the first phase, progressive tests were carried out to determine lactate threshold and maximal oxygen uptake in each subject. During the second phase, each athlete performed a series of 30-min ergocycle tests, with a fixed workload to establish maximal lactate steady state.\nResults showed no significant differences between lactate threshold workload (WRLT), determined by the D-max method, and maximal lactate steady state workload (WRMLSS) in female and male cyclists, expressed in absolute and relative values. Differences between male and female cyclists in absolute and relative values of WRLT, WRMLSS, and WRmax were significant (p<0.05), but in relative values there was a tendency for decreased differences between groups. The oxygen uptake at the lactate threshold and MLSS were significantly (p<0.05) different. Also, a significant (p<0.05) difference was observed in values of heart rate and lactate concentration at the lactate threshold and MLSS. The analysis of changes in lactate concentration, heart rate and oxygen uptake between the 10th and 30th minutes of MLSS, indicates that there was a significant (p<0.05) increase in these values in male and female cyclists. The strong correlation (r=0.97; p<0.05) between WRLT and WRMLSS was found. Also, a significant correlation between (r=0.96; p<0.05) WRMLSS and peak workload during the incremental test (WRmax) (r=0.96; p<0.05) was also observed.","authors":["Miłosz Czuba","Adam Zajac","Jaroslaw Cholewa","Stanisław Poprzecki"],"meta":["June 2009Journal of Human Kinetics 21(1):49-56","DOI:10.2478/v10078-09-0006-5"],"references":["19964200_Metabolic_and_respiratory_profile_of_the_upper_limit_for_prolonged_exercise_in_man","286515791_Exercise_physiology_in_children","51301616_The_Maximal_Lactate_Steady_State_in_Elite_Endurance_Athletes","22643475_The_signifiance_of_the_aerobic-anaerobic_transition_for_the_determination_of_work_load_intensities_during_endurance_training","21695465_A_New_Approach_for_the_Determination_of_Ventilatory_and_Lactate_Thresholds","21653284_Cycling_efficiency_is_related_to_percentage_of_Type_I_muscle_fibers","21585579_A_comparative_evaluation_of_the_individual_anaerobic_threshold_and_the_critical_power","19753781_Determinants_of_endurance_in_well-trained_cyclists","19132130_Justification_of_the_4-mmoll_Lactate_Threshold","15864854_Lactate_Kinetics_and_Individual_Anaerobic_Threshold"]}