{"id":"246671436_Learning_to_Extract_Answers_in_Question_Answering_Experimental_Studies","abstract":"Question Answering (QA) systems are complex programs able to answer a question in natural language. Their source of information is a given corpus or, as assumed here, the Web. To achieve their goal, these systems perform various subtasks among which the last one, called answer extraction, is very similar to an Information Extraction task. The main objective of this study it to adapt machine learning techniques defined for Information Extraction tasks to the slightly different task of answer extraction in QA systems. The specificities of QA sys- tems are identified and exploited in this adaptation. Three algorithms, assuming an increasing abstraction of natural language texts, are tested and compared. RÉSUMÉ. Les systèmes Question/Réponse sont des programmes complexes capables de répondre à une question en langage naturel, en utilisant comme source d'information soit un corpus donné, soit, comme c'est le cas ici, le Web. Pour cela, ces systèmes réalisent différentes sous- tâches parmi lesquelles la dernière, appelée extraction de la réponse, est très similaire à une tâche d'Extraction d'Information. L'objectif de cet article est d'adapter les techniques d'ap- prentissage automatique utilisées en Extraction d'Information à l'extraction de la réponse. Les spécificités des systèmes Question/Réponse sont identifiées et utilisées dans cette adaptation. Trois algorithmes utilisant une abstraction croissante du texte sont testés et comparés.","authors":["Florent Jousse","Isabelle Tellier","Marc Tommasi","Patrick Marty"],"meta":["January 2005"],"references":["221038285_The_JAVELIN_Question-Answering_System_at_TREC_2003_A_Multi-Strategh_Approach_with_Dynamic_Planning","2939088_Gnration_de_requtes_pour_les_systmes_de_QR_avec_un_modle_d'apprentissage_statistique","2888359_The_TREC-8_Question_Answering_Track_Evaluation","242637407_The_process_of_question_answering_A_computer_simulation_of_cognition","230876691_Baseball_An_Automatic_Question_Answerer","230876660_Progress_in_natural_language_understanding_An_application_to_lunar_geology","225203040_Learning_Information_Extraction_Rules_for_Semi-Structured_and_Free_Text","2555866_An_Analysis_of_the_AskMSR_Question-Answering_System","2550676_Answer_Extraction","2534680_Learning_Surface_Text_Patterns_for_a_Question_Answering_System"]}