{"id":"247478130_The_Utility_of_Hotspot_Mapping_for_Predicting_Spatial_Patterns_of_Crime","abstract":"Hotspot mapping is a popular analytical technique that is used to help identify where to target police and crime reduction resources. In essence, hotspot mapping is used as a basic form of crime prediction, relying on retrospective data to identify the areas of high concentrations of crime and where policing and other crime reduction resources should be deployed. A number of different mapping techniques are used for identifying hotspots of crime – point mapping, thematic mapping of geographic areas (e.g. Census areas), spatial ellipses, grid thematic mapping and kernel density estimation (KDE). Several research studies have discussed the use of these methods for identifying hotspots of crime, usually based on their ease of use and ability to spatially interpret the location, size, shape and orientation of clusters of crime incidents. Yet surprising, very little research has compared how hotspot mapping techniques can accurately predict where crimes will occur in the future. This research uses crime data for a period before a fixed date (that has already passed) to generate hotspot maps, and test their accuracy for predicting where crimes will occur next. Hotspot mapping accuracy is compared in relation to the mapping technique that is used to identify concentrations of crime events (thematic mapping of Census Output Areas, spatial ellipses, grid thematic mapping, and KDE) and by crime type – four crime types are compared (burglary, street crime, theft from vehicles and theft of vehicles). The results from this research indicate that crime hotspot mapping prediction abilities differ between the different techniques and differ by crime type. KDE was the technique that consistently outperformed the others, while street crime hotspot maps were consistently better at predicting where future street crime would occur when compared to results for the hotspot maps of different crime types. The research offers the opportunity to benchmark comparative research of other techniques and other crime types, including comparisons between advanced spatial analysis techniques and predic-tion mapping methods. Understanding how hotspot mapping can predict spatial patterns of crime and how different mapping methods compare will help to better inform their application in practice.","authors":["Spencer Chainey","Lisa Tompson","Sebastian Uhlig"],"meta":["February 2008Security Journal 21:4-28","DOI:10.1057/palgrave.sj.8350066"],"references":["246322301_Getting_the_Grease_to_the_Squeak_Research_lessons_for_crime_prevention","238712947_The_use_of_Geographic_Information_Systems_by_crime_analysts_in_England_and_Wales","238322365_Social_Change_and_Crime_Rate_Trends_A_Routine_Activity_Approach","304580662_GIS_and_crime_mapping","275572593_How_to_Lie_With_Maps_2nd_ed","266390233_Patterns_in_Crime","247966107_The_Reasoning_Criminal_Rational_Choice_Perspectives_on_Offending","246761597_Mapping_Crime_Principles_and_Practice","245815519_CrimeStat_III_a_spatial_statistics_program_for_the_analysis_of_crime_incident_locations","237106666_Ana-lyzing_Crime_Patterns_Frontiers_of_Practice"]}