{"id":"247589871_SOME_SIMPLE_WORD_PROBLEMS_IN_UNIVERSAL_ALGEBRAS","abstract":"An algorithm is described which is capable of solving certain word problems: i.e. of deciding whether or not two words composed of variables and operators can be proved equal as a consequence of a given set of identities satisfied by the operators. Although the general word problem is well known to be unsolvable, this algorithm provides results in many interesting cases. For example in elementary group theory if we are given the binary operator ·, the unary operator −, and the nullary operator e, the algorithm is capable of deducing from the three identities a · (b · c) = (a · b) · c, a · a\n− = e, a · e = a, the laws a\n− · a = e, e · a = a, a\n− −\n= a, etc.; and furthermore it can show that a · b = b · a\n−\nis not a consequence of the given axioms.\nThe method is based on a well-ordering of the set of all words, such that each identity can be construed as a “reduction”, in the sense that the right-hand side of the identity represents a word smaller in the ordering than the left-hand side. A set of reduction identities is said to be “complete” when two words are equal as a consequence of the identities if and only if they reduce to the same word by a series of reductions. The method used in this algorithm is essentially to test whether a given set of identities is complete; if it is not complete the algorithm in many cases finds a new consequence of the identities which can be added to the list. The process is repeated until either a complete set is achieved or until an anomalous situation occurs which cannot at present be handled.\nResults of several computational experiments using the algorithm are given.","authors":["DONALD E. KNUTH","PETER B. BENDIX"],"meta":["January 1983","DOI:10.1007/978-3-642-81955-1_23"],"references":["268761824_A_system_arising_from_a_weakened_set_of_group_postulates","268541999_The_algebraic_theory_of_semigroups_Volume_1_Algebraiceskaja_teorija_polugrupp_Tom_1_Ubersetzung_aus_dem_Englischen_von_V_A_Baranskij_und_V_G_Zitomirskij_Herausgegeben_von_L_N_Shevrin","268242361_Products_of_Points--Some_Simple_Algebras_and_their_Identities","267105419_The_algebraic_theory_of_semigroups_Vol_I","266934959_Zur_Axiomatik_der_Gruppen","243073940_Definitions_of_a_group_and_a_field_by_independent_postulates","242373361_On_Theories_with_a_Combinatorial_Definition_of_Equivalence","240927558_Notes_on_central_groupoids","237596012_On_certain_systems_which_are_almost_groups","231819353_On_multiplicative_systems_defined_by_generators_and_relations","220431985_Semi-Automated_Mathematics","220431038_A_Machine-Oriented_Logic_Based_on_the_Resolution_Principle"]}