{"id":"247697945_Biological_Organisation_and_Anti-Entropy","abstract":"This paper proposes a systemic perspective for some aspects of both phylogenesis and ontogenesis by expressing biological organization in terms of \"anti-entropy\", a notion to be defined below and which conceptually differs from the common use of \"negative entropy\". To this purpose, we introduce two principles, in addition to the thermodynamic ones, which are (mathematically) compatible with traditional principles but which have no meaning with regard to inert matter. A traditional balance equation for the metabolism will then be extended to the new notion as specified by these principles. We examine far from equilibrium systems and we focus in particular on the production of global entropy associated to the irreversible character of the processes. A close analysis of anti-entropy will be performed from the perspective of a diffusion equation of biomass over \"complexity\" and, as a complementary approach and as a tool for specifying a source term, in connection to Schrödinger's method regarding his equation in the field of Quantum Mechanics. We borrow only the operatorial approach from this equation and do so using a classical framework, since we use real coefficients instead of complex ones, thus outside of the mathematical framework of quantum theories. The first application of our proposal is a simple mathematical reconstruction of Gould's complexity curve of biomass over complexity as it applies to evolution. We then present, based on the existence of different time scales, a partition of ontogenetic time, in reference to entropy and anti-entropy variation. On the grounds of this approach, we analyze the metabolism and scaling laws. This allows to compare various relevant coefficients appearing in these scaling laws, which fit empirical data. Finally, a tentative and quantitative evaluation of complexity is proposed, also in relation to some empirical data (caenorhabditis elegans).","authors":["FRANCIS BAILLY","Giuseppe Longo"],"meta":["March 2009Journal of Biological Systems 17(01)","DOI:10.1142/S0218339009002715"],"references":["262486977_Objective_and_epistemic_complexity_in_biology","262486893_The_Century_of_the_Gene","262486785_Mathematiques_sciences_de_la_nature_la_singularite_physique_du_vivant","260861517_Allometric_Scaling_in_Biology","288219420_Schrodinger's_contribution_to_chemistry_and_biology","284925772_Cell_Lineages_and_Development_of_Caenorhabditis_elegans_and_Other_Nematodes","275874223_The_Ecological_Implications_of_Body_Size","262487003_Schrodinger's_what_is_Life_and_molecular_biology","262486809_Scaling","262486793_Self-Organized_Criticality_Emergent_Complex_Behavior_in_Physical_and_Biological_Systems"]}