{"id":"247697811_Extended_critical_situations_The_physical_singularity_of_life_phenomena","abstract":"In this paper, we propose to consider living systems as \"coherent critical structures,\" though extended in space and time, their unity being ensured through global causal relations between levels of organization (integration/regulation). This may be seen as a further contribution to the large amount of work already done on the theme of self-organized criticality. More precisely, our main physical paradigm is provided by the analysis of \"phase transitions,\" as this peculiar form of critical state presents interesting aspect of emergence: the formation of extended correlation lengths and coherence structures, the divergence of some observables with respect to the control parameter(s), etc…. However, the \"coherent critical structures\" which are the main focus of our work cannot be reduced to existing physical approaches, since phase transitions, in physics, are treated as \"singular events,\" corresponding to a specific well-defined value of the control parameter. Whereas our claim is that in the case of living systems, these coherent critical structures are \"extended\" and organized in such a way that they persist in space and time. The relation of this concept to the theory of autopoiesis, as well as to various forms of teleonomy, often present in biological analyses, will be also discussed.","authors":["FRANCIS BAILLY","Giuseppe Longo"],"meta":["June 2008Journal of Biological Systems 16(02)","DOI:10.1142/S0218339008002514"],"references":["300460630_9_Space_time_and_cognition","262497422_El_origen_de_las_especies_por_medio_de_la_deriva_natural","262486977_Objective_and_epistemic_complexity_in_biology","346494214_Scaling_Self-similarity_and_Intermediate_Asymptotics_Dimensional_Analysis_and_Intermediate_Asymptotics","321642802_Ultradian_Rhythms_in_Life_Processes_An_Inquiry_into_Fundamental_Principles_of_Chronobiology_and_Psychobiology","294435169_Stabilisation_in_systems_Chreods_and_epigenetic_landscapes","272160141_Self-Organizaton_in_Non-Equilibrium_Systems","262486793_Self-Organized_Criticality_Emergent_Complex_Behavior_in_Physical_and_Biological_Systems","248019328_The_specious_present_A_neurophenomenology_of_time_consciousness","247149073_Stabilisation_in_systems"]}