{"id":"247628900_Marketing_smart_medical_innovation_Physicians'_attitudes_and_intentions","abstract":"Purpose\n– The purpose of this paper is to investigate physicians' attitudes toward smart fabric medical innovation and more specifically to examine how perceived ease of use and perceived usefulness affect physicians' attitudes and intention to use smart fabric technology.\n\nDesign/methodology/approach\n– Data for this study were collected using a web‐based survey instrument delivered via email to a randomly selected group of physicians (n=207) responses with no missing data). Physicians were chosen because physicians' acceptance is key to social acceptance of smart medical innovations, whether as an instrument to further their efforts to monitor patients through telemedicine or to expand their diagnostic capabilities.\n\nFindings\n– Significant effects were found for the direct relationships between attitude and intention to use and between perceived ease of use and perceived usefulness. However, the relationships between attitude on intention to use, perceived usefulness on intention to use and perceived ease of use on perceived usefulness were not statistically significant.\n\nOriginality/value\n– Smart fabric technology is a recent development that has received widespread attention in textile industry publications as well as consumer market publications, but relatively little in medical journals. Even though many of the applications are still limited to military situations, the diffusion of these “smart” innovations into mainstream markets has the potential to significantly impact numerous lives. This is especially true for smart fabrics that have been developed for medical markets because these innovations have the potential to save lives, alter the way physicians practice and impact significantly the quality of care provided to patients.","authors":["Ella Carter"],"meta":["November 2008International Journal of Pharmaceutical and Healthcare Marketing 2(4):307-320","DOI:10.1108/17506120810922349"],"references":["227446117_User_Acceptance_of_Computer_Technology_A_Comparison_of_Two_Theoretical_Models","221571937_Smart_clothing_Wearable_Multimedia_Computing_and_Personal_Imaging_to_Restore_the_Technological_Balance_Between_People_and_Their_Environments","220079846_Predicting_User_Intentions_Comparing_the_Technology_Acceptance_Model_with_the_Theory_of_Planned_Behavior","10689361_Barriers_to_telemedicine_implementation_Usually_it's_not_technology_issues_that_undermine_a_project--it's_everything_else","277433772_Web_Survey_Design_and_Administration","233057436_Choice_Sets_and_Choice_Intentions","229756864_Perceived_Risk_The_Concept_and_Its_Measurement","227763177_A_Model_of_the_Antecedents_of_Perceived_Ease_of_Use_Development_and_Test","220591737_Examining_the_Technology_Acceptance_Model_Using_Physician_Acceptance_of_Telemedicine_Technology","220260030_Why_Don't_Men_Ever_Stop_to_Ask_for_Directions_Gender_Social_Influence_and_Their_Role_in_Technology_Acceptance_and_Usage_Behavior","12411884_Diffusion_of_Telemedicine_A_Knowledge_Barrier_Perspective"]}