{"id":"247933007_RAMC_a_RSU-assisted_multi-channel_coordination_MAC_protocol_for_VANET","abstract":"Dedicated Short Range Communication (DSRC) employs one control channel for safety-oriented applications and six service channels for non-safety commercial applications. However, most existing multi-channel schemes require all neighboring vehicles periodically (e.g. every 100 milliseconds) tune to the control channel for a full update of safety-oriented data before they can switch to the service channels for non-safety services. The safety exchange interval increases with the increase of traffic density. Consequently, under high traffic densities, the service channels are often completely idle while the control channel is congested. We propose a RSU Assisted Multi-channel Coordination MAC (RAMC) protocol that fully utilizes all channels to provide simultaneous safety and non-safety communications. Within the radio range of a roadside unit (RSU), vehicles are free to tune to any service channel. The RSU monitors all the safety messages being transmitted in both the control and service channels. Periodically, the RSU broadcasts a consolidated traffic view report to all neighboring vehicles in all channels. Therefore, a vehicle can operate in a service channel as long as it needs to achieve high throughput for non-safety applications, while maintaining adequate and timely safety awareness. Our simulation results show that the proposed RAMC protocol consistently achieves very high percentage of non-safety usage, while maintaining high safety message delivery ratios in various traffic density conditions.","authors":["Kai Liu","Jinhua Guo","Ning Lu","Fuqiang Liu"],"meta":["January 2011IEICE Transactions on Communications E94B(1):203-214","DOI:10.1587/transcom.E94.B.203","SourceDBLP"],"references":["224309449_Multichannel_Medium_Access_Control_for_Dedicated_Short-Range_Communications","221453528_Overhaul_of_IEEE_80211_modeling_and_simulation_in_NS-2","220926676_Empirical_determination_of_channel_characteristics_for_DSRC_vehicle-to-vehicle_communication","220926109_Vehicle-to-Vehicle_Safety_Messaging_in_DSRC","220926064_How_much_of_DSRC_is_available_for_non-safety_use","6192639_Lesion_radioactivity_concentration_estimation_using_dual_modality_gamma_rayX-ray_imaging","3436144_Design_of_59_GHz_DSRC-based_vehicular_safety_communication"]}