{"id":"248395341_Scalable_Eventually_Consistent_Counters_over_Unreliable_Networks","abstract":"Counters are an important abstraction in distributed computing, and play a\ncentral role in large scale geo-replicated systems, counting events such as web\npage impressions or social network \"likes\". Classic distributed counters,\nstrongly consistent, cannot be made both available and partition-tolerant, due\nto the CAP Theorem, being unsuitable to large scale scenarios. This paper\ndefines Eventually Consistent Distributed Counters (ECDC) and presents an\nimplementation of the concept, Handoff Counters, that is scalable and works\nover unreliable networks. By giving up the sequencer aspect of classic\ndistributed counters, ECDC implementations can be made AP in the CAP design\nspace, while retaining the essence of counting. Handoff Counters are the first\nCRDT (Conflict-free Replicated Data Type) based mechanism that overcomes the\nidentity explosion problem in naive CRDTs, such as G-Counters (where state size\nis linear in the number of independent actors that ever incremented the\ncounter), by managing identities towards avoiding global propagation and\ngarbage collecting temporary entries. The approach used in Handoff Counters is\nnot restricted to counters, being more generally applicable to other data types\nwith associative and commutative operations.","authors":["Paulo Sérgio Almeida","Carlos Baquero"],"meta":["February 2019Distributed Computing 32(5)","DOI:10.1007/s00446-017-0322-2","SourcearXiv"],"references":["260393511_Better_bitmap_performance_with_Roaring_bitmaps","224731360_A_Protocol_for_Packet_Network_Intercommunication","221540578_Conflict-Free_Replicated_Data_Types","221343719_Towards_robust_distributed_systems","264590022_Weibull_mixture_model_to_characterise_end-to-end_Internet_delay_at_coarse_time-scales","261850079_Riak_Core_building_distributed_applications_without_shared_state","246035155_Efficient_synchronization_primitives_for_large-scale_cache-coherent_multiprocessors","225035741_Introduction_to_Lattices_and_Order_-_2nd_Ed","224483341_Database_Applications_of_the_fetch-and-add_Instruction","221343918_Epidemic_Algorithms_for_Replicated_Database_Maintenance"]}