{"id":"248544637_Explaining_the_acceptance_and_use_of_government_Internet_services_A_multivariate_analysis_of_2006_survey_data_in_the_Netherlands","abstract":"In this article, an attempt is made to explain the descriptive data of a large-scale representative survey of the use of government Internet services by the Dutch population in 2006 by means of a multidisciplinary model of technology acceptance and use that is applied to these services. Ultimately, the model is tested with structural equation modeling techniques. It appears to fit to the data after some modifications and exclusion of variables. The ultimate model could be used to explain the acceptance and use of government Internet services. The larger correlation model could serve as a framework for research of Internet services in general.The social–demographic and psychological factors usually investigated in new technology acceptance and usage research do not prove to be strong here. Instead, it is demonstrated that the availability of Internet services, the knowledge of this availability, the preference to use digital channels, and the ability and experience to do this are the primary conditions.The most general conclusion drawn is that the acceptance and use of government Internet services is a matter of learning, and that acceptance and use should be analyzed as a dynamic process. People will stick to their habits of using traditional channels unless they happen to learn a better alternative.Governments are recommended to add a demand-side orientation and benchmarking for the supply of government Internet services and to develop service tracking technologies monitoring usage and users.","authors":["Jan A.G.M. Van Dijk","Oscar Peters","Wolfgang Ebbers"],"meta":["July 2008Government Information Quarterly 25(3):379-399","DOI:10.1016/j.giq.2007.09.006"],"references":["249737098_Understanding_Internet_Usage_A_Social-Cognitive_Approach_to_Uses_and_Gratifications","233897090_Belief_attitude_intention_and_behaviour_An_introduction_to_theory_and_research","232843977_A_Social_Cognitive_Theory_of_Internet_Uses_and_Gratifications_Toward_a_New_Model_of_Media_Attendance","313161703_An_expectancy-value_approach_to_media_gratifications","292683691_The_Deepening_Divide_Inequality_in_the_Information_Society","291969471_Uses_and_gratifications_A_paradigm_outlined_BT_-_The_uses_of_mass_communications_Current_perspectives_on_gratifications_research","286740137_Utilization_of_mass_communication_by_the_individual","249720354_From_Audiences_to_Consumers_The_Household_and_the_Consumption_of_Communication_and_Information_Technologies","246494986_Belief_Attitude_Intention_and_Behavior_An_Introduction_to_Theory_and_Research","233820393_Social_Foundations_of_Thought_Action_A_Social_Cognitive_Theory"]}