{"id":"248617222_Critical_English_for_academic_purposes","abstract":"This JOllrnal ofEnglish/or academic pllrposes special issue on critical EAP (CEAP) explores a few key questions: How might critical be theorized in EAP contexts in today's globalizing world? What are some ways CEAP is currently being practiced? What does CEAP contribute to EAP, from the perspectives of theory, research, and pedagogy? The vitality of CEAP is seen in the variety of ways these questions are answered in this special issue. Yet, despite the range of contexts, methodologies. and pedagogies, the authors share certain assumptions about criticality and its relationship to EAP. All subscribe to a theory of language as discourses(s). Praxis, the reciprocal relationship between theory and practice, is a central concem for all. A reflexive stance toward praxis is apparent in each contribution. And, all situate praxis in the daily lives of students, instructors. and the institutional contexts in which they meet. A spirit of reflexivity and interrogation is perhaps the most important of the shared assumptions. Some authors pose explicit questions; others embed their questions more implicitly. Yet all report their findings tentatively, avoiding definitive claims and answers. They demonstrate humility about the limits of knowledge and acknowledge incomplete understanding of the complex issues addressed. In this introduction to the special issue I situate CEAP in its wider sociopolitical context, by discussing the exigencies of globalization and their impact on EAP students, teachers, and curricula. This is followed by a discussion of criticality in EAP, including its realization in the authors' praxis.","authors":["Sarah Benesch"],"meta":["June 2009Journal of English for Academic Purposes 8(2):81-85","DOI:10.1016/j.jeap.2008.09.002"],"references":["337005180_Critical_moments_in_a_TESOL_praxicum","280777286_Critical_praxis_as_materials_development_Responding_to_military_recruitment_on_a_US_campus","242490540_Two_Takes_on_the_Critical","231992291_Critical_literacies_and_language_education_Global_and_local_perspectives","351529970_Grassroots_Globalization_and_the_Research_Imagination","346674457_Subversive_identities_pedagogical_safe_houses_and_critical_learning","223283181_Towards_a_'pedagogy_of_connection'_in_critical_research_education_A_REAL_story"]}