{"id":"248706377_Co-registration_of_Eye_Movements_and_Event-Related_Potentials_in_Connected-Text_Paragraph_Reading","abstract":"Eyetracking during reading has provided a critical source of on-line behavioral data informing basic theory in language processing. Similarly, event-related potentials (ERPs) have provided an important on-line measure of the neural correlates of language processing. Recently there has been strong interest in co-registering eyetracking and ERPs from simultaneous recording to capitalize on the strengths of both techniques, but a challenge has been devising approaches for controlling artifacts produced by eye movements in the EEG waveform. In this paper we describe our approach to correcting for eye movements in EEG and demonstrate its applicability to reading. The method is based on independent components analysis, and uses three criteria for identifying components tied to saccades: (1) component loadings on the surface of the head are consistent with eye movements; (2) source analysis localizes component activity to the eyes, and (3) the temporal activation of the component occurred at the time of the eye movement and differed for right and left eye movements. We demonstrate this method's applicability to reading by comparing ERPs time-locked to fixation onset in two reading conditions. In the text-reading condition, participants read paragraphs of text. In the pseudo-reading control condition, participants moved their eyes through spatially similar pseudo-text that preserved word locations, word shapes, and paragraph spatial structure, but eliminated meaning. The corrected EEG, time-locked to fixation onsets, showed effects of reading condition in early ERP components. The results indicate that co-registration of eyetracking and EEG in connected-text paragraph reading is possible, and has the potential to become an important tool for investigating the cognitive and neural bases of on-line language processing in reading.","authors":["John M Henderson","Steven G Luke","Joseph Schmidt","John Richards"],"meta":["July 2013Frontiers in Systems Neuroscience 7:28","DOI:10.3389/fnsys.2013.00028","SourcePubMed"],"references":["248706376_Cortical_Sources_of_ERP_in_the_Prosaccade_and_Antisaccade_Task_using_Realistic_Source_Models_Based_on_Individual_MRIs","236907803_Oculomotor_and_cognitive_control_of_eye_movements_in_reading_Evidence_from_mindless_reading","232550625_Psycholinguistics_electrified_Event-related_brain_potential_investigations","232536172_Combining_EEG_and_eye_tracking_Identification_characterization_and_correction_of_eye_movement_artifacts_in_electroencephalographic_data","285504455_Combining_EEG_and_eye_tracking_identification_characterization_and_correction_of_eye_movement_artifacts_in_electroencephalographic_data","284507547_R_a_language_and_environment_for_statistical_computing_R_Foundation_for_Statistical_Computing","282103354_Independent_component_analysis_using_an_extended_Infomax_algorithm_for_mixed_subGaussian_and_superGaussian_sources","276954687_Establishing_a_time-line_of_word_recognition","263499276_Still_Seeking_Recognition_Mapuche_Demands_State_Violence_and_Discrimination_in_Democratic_Chile","232539930_The_Psychology_and_Pedagogy_of_Reading"]}