{"id":"248808082_A_Detachment-Limited_Model_of_Drainage-Basin_Evolution","abstract":"A drainage basin simulation model introduced here incorporates creep and threshold slumping and both detachment- and transport-limited fluvial processes. Fluvial erosion of natural slopes and headwater channels is argued to be dominantly detachment-limited. Such slopes undergo nearly parallel retreat and replacement with alluvial surfaces under fixed base level, in contrast with gradual slope decline for transport-limited conditions. The arrangement of divides and valleys is sensitive to initial conditions, although average morphology is insensitive. Dissected, initially flat surfaces in which downstream concavity is slight exhibit nearly parallel drainage, compared to very wandering main valleys when concavity is great. Steady state is reached after a cumulative base level drop approximately 3 times the final relief. Simulated valley systems are similar to those predicted by a previous model of optimal drainage basins. A critical value of slope divergence normalized by average slope gradient is a useful criterion for defining the valley network.","authors":["Alan D. Howard"],"meta":["July 1994Water Resources Research 30(7)","DOI:10.1029/94WR00757"],"references":["341791946_Erosion_processes_and_sediment_properties_for_agricultural_cropland","320937147_Recent_Development_of_Mountain_Slopes_in_Karkevagge_and_Surroundings_Northern_Scandinavia","316595474_Modelling_cliff_development_in_South_Wales_Savigear_re-viewed","313766360_A_closed-form_soil_erosion_equation_for_upland_areas","313208922_Talus_slopes_and_mountain_walls_at_Tempelfjorden_Spitsbergen","293171821_Energy_dissipation_runoff_production_and_the_three-dimensional_structure_of_channel_networks","292650893_Modelling_landform_change","292280271_Problems_of_interpretation_of_simulation_models_of_geologic_processes","292274210_Deterministic_continuous_slope_models","291987826_Process_based_modelling_of_soil_erosion_by_water_on_agricultural_land"]}