{"id":"248876087_Learning_to_Live_with_League_Tables_and_Ranking_The_Experience_of_Institutional_Leaders","abstract":"This paper draws on the results of an international survey of HE leaders and senior managers, which was supported by the OECD Programme on Institutional Management for Higher Education (IMHE) and the International Association of Universities (IAU). It focuses on how HEIs are responding to league tables and rankings (LTRS), and what impact or influence — positive or perverse — they are having on institutional behaviour, decision-making and actions. The growing body of academic research and journalist reportage is referenced to contextualize this international experience. The paper shows that while HE leaders are concerned about the impact of rankings, they are also increasingly responsive and reactive to them. In addition, key stakeholders use rankings to influence their decisions: students use rankings to ‘shortlist’ university choice, and others make decisions about funding, sponsorship and employee recruitment. Rankings are also used as a ‘policy instrument’ to underpin and quicken the pace of HE reform.Higher Education Policy (2008) 21, 193–215. doi:10.1057/hep.2008.1","authors":["Ellen Hazelkorn"],"meta":["June 2008Higher Education Policy 21(2):193-215","DOI:10.1057/hep.2008.1"],"references":["250794968_Challenges_in_Ranking_of_Universities","250075393_League_Tables_as_Policy_Instruments","249176686_Rankings_and_Reactivity_How_Public_Measures_Recreate_Social_Worlds","298094365_Why_the_US_News_and_World_Report_Law_School_Rankings_Are_Both_Useful_and_Important","292008524_Ranking_business_schools_Forming_fields_identities_and_boundaries_in_international_management_education","265399874_Playing_the_Rankings_Game","251262657_College_Rankings_Democratized_College_Knowledge_for_Whom","249039603_US_News_World_Report's_college_rankings_Why_do_they_matter","249039428_Playing_The_Ranking_Game","246163805_Fantasy_Higher_Education_University_and_College_League_Tables"]}