{"id":"248942283_Design_and_Reflection_Help_Students_Develop_Scientific_Abilities_Learning_in_Introductory_Physics_Laboratories","abstract":"Design activities, when embedded in an inquiry cycle and appropriately scaffolded and supplemented with reflection, can promote the development of the habits of mind (scientific abilities) that are an important part of scientific practice. Through the Investigative Science Learning Environment (ISLE), students construct physics knowledge by engaging in inquiry cycles that replicate the approach used by physicists to construct knowledge. A significant portion of student learning occurs in ISLE instructional labs where students design their own experiments. The labs provide an environment for cognitive apprenticeship enhanced by formative assessment. As a result, students develop interpretive knowing that helps them approach new problems as scientists. This article describes a classroom study in which the students in the ISLE design lab performed equally well on traditional exams as ISLE students who did not engage in design activities. However, the design group significantly outperformed the non-design group while working on novel experimental tasks (in physics and biology), demonstrating the application of scientific abilities to an inquiry task in a novel content domain. This research shows that a learning environment that integrates cognitive apprenticeship and formative assessment in a series of conceptual design tasks provides a rich context for helping students build scientific habits of mind.","authors":["Eugenia Etkina","Anna Karelina","Maria Ruibal-Villasenor","David Rosengrant"],"meta":["January 2010Journal of the Learning Sciences 19(1):54-98","DOI:10.1080/10508400903452876"],"references":["290528846_From_ambitious_vision_to_partially_satisfying_reality_An_evolving_socio-technical_design_supporting_community_and_collaborative_learning_in_teacher_education","345073713_Types_of_Knowledge_and_Purposes_of_Education","313737754_Cognitive_Apprenticeship_Making_Thinking_Visible","313216871_Forms_of_transfer_in_a_community_of_learners_Flexible_learning_and_transfer","313058559_Fostering_the_development_of_self-regulation_in_children's_knowledge_processing","312888314_From_practice_fields_to_communities_of_practice","303270804_Cognitive_apprenticeship_Teaching_the_crafts_of_reading_writing_mathematics","301341066_Teaching_for_transfer_Fostering_generalization_in_learning","299727925_The_Learning_Cycle","299037708_When_and_where_do_we_apply_what_we_learn_A_taxonomy_for_far_transfer"]}