{"id":"248943539_Exploring_the_Possibilities_for_EFL_Critical_Pedagogy_in_Korea_A_Two-Part_Case_Study","abstract":"The paper reports an investigation carried out in two Korean EFL classrooms , being small-scale interventions within existing classrooms or institutional structures. A teacher-researcher introduced critically-oriented material using an optional class in a junior high school and an existing class in a senior high school. The focus was on establishing critical dialogue between students and teachers, providing opportunities for learners to develop English language abilities while engaging in critical discussion of topics. Data collected included audio and videotapes of classrooms, oral and written interviews with students and teachers, student class evaluations, and associated documents. Findings (based on qualitative analyses of data) suggest that students were by no means resistant to this kind of material or class, and showed the ability to handle and generate critical dialogue in English. Students recognized the classes as challenging though not as fo-cused on exam preparation as their regular course offerings. The study, while small-scale and exploratory, calls into question the stereotype of East-Asian students as passive and non-autonomous and helps dispel the idea that East-Asian classrooms are inherently rigidly hierarchical.","authors":["Hyunjung Shin","Graham Crookes"],"meta":["June 2005Critical Inquiry in Language Studies 2(2):113-136","DOI:10.1207/s15427595cils0202_3"],"references":["345232458_The_ESL_Classroom_Teaching_Critical_Practice_and_Community_Development","336914433_English_and_the_Discourses_of_Colonialism","336914432_Critical_Applied_Linguistics_A_Critical_Introduction","333958284_Student_Activism_and_University_Teaching_in_South_Korea","330864636_When_Students_Have_Power_Negotiating_Authority_in_a_Critical_Pedagogy","330863982_Empowering_Education_Critical_Teaching_for_Social_Change","318273548_The_Cultural_Politics_of_English_as_an_International_Language","307812470_Cross-Cultural_Perspectives_on_Motivations_of_Verbal_Communication_Review_Critique_and_a_Theoretical_Framework","300991227_The_Teachings_of_Yi_Yulgok_Communication_from_a_Neo-Confucian_Perspective","299534495_English_language_education_in_Japan"]}