{"id":"248987739_The_Role_of_the_National_Science_Foundation_Broader_Impacts_Criterion_in_Enhancing_Research_Ethics_Pedagogy","abstract":"The National Science Foundation's (NSF) Second Merit Criterion, or Broader Impacts Criterion (BIC), was introduced in 1997 as the result of an earlier Congressional movement to enhance the accountability and responsibility as well as the effectiveness of federally funded projects. We demonstrate that a robust understanding and appreciation of NSF BIC argues for a broader conception of research ethics in the sciences than is currently offered in Responsible Conduct of Research (RCR) training. This essay advocates augmenting RCR education with training regarding broader impacts. We demonstrate that enhancing research ethics training in this way provides a more comprehensive understanding of the ethics relevant to scientific research and prepares scientists to think not only in terms of responsibly conducted science, but also of the role of science in responding to identified social needs and in adhering to principles of social justice. As universities respond to the mandate from America COMPETES to “provide training and oversight in the responsible and ethical conduct of research”, we urge institutions to embrace a more adequate conception of research ethics, what we call the Ethical Dimensions of Scientific Research, that addresses the full range of ethical issues relevant to scientific inquiry, including ethical issues related to the broader impacts of scientific research and practice.","authors":["Erich Schienke","Nancy Tuana","Donald Brown","Kenneth J. Davis"],"meta":["July 2009Social Epistemology 23(3):317-336","DOI:10.1080/02691720903364282"],"references":["341664939_Science_as_Social_Knowledge_Values_and_Objectivity_in_Scientific_Inquiry","333886761_A_Theory_of_Justice","316691669_Risk_Analysis_and_Scientific_Method","300444609_From_Principles_of_Political_Economy","300272634_Utilitarianism_and_its_Method","300270943_Equality_of_What","275232247_Important_Notice","274858300_Utilitarianism_and_Beyond","273109135_Distributive_Justice_A_Constructive_Critique_of_the_Utilitarian_Theory_of_Distribution","272927725_Science_as_Social_Knowledge_Values_and_Objectivity_in_Scientific_Inquiry"]}