{"id":"249360041_India_in_the_knowledge_economy_-_An_electronic_paradigm","abstract":"Purpose – The purpose of this paper is to make a strong case for investing in information and communication technologies (ICT) for building up of quality human resource capital for economic upliftment of India. An attempt has been made to explore the possibilities of online learning (OL)/e-learning towards building up of quality human resources in higher education for a developing nation like India. A comprehensive environmental scanning of various e-learning experiments, tools, projects to facilitate e-learning or various institutional level efforts has been carried out. The paper also seeks to highlight the options available with traditional institutes for deploying ICT and for implementing e-learning. Design/methodology/approach – The paper is a descriptive account of the contemporary situation in India with regard to education especially e-learning and draws on a variety of secondary sources both published and unpublished. Findings – Argues that the development of e-learning has been limited and reasons out why. The challenges of traditional face-to-face education vis-à-vis e-learning in India are enlisted and suggestions for management of the e-learning process by institutes which intend to venture into e-learning are enumerated. The paper advocates the urgency for the traditional institutions to put an impetus on investment in ICT for providing e-instruction for delivery of knowledge by riding the information super highway. Research limitations/implications – Presents a review of literature developed from secondary sources. Practical implications – Models of e-learning that exclude any face-to-face contact may have limited prospects, but blended learning offers significant potential both on and off campus and should be pursued if the benefits of e-learning are to be fully realized. Originality/value – This paper provides a useful overview of a scenario of OL/e-learning in India's higher education; and, from this summary of the present situation, goes on to suggest possible ways to transform the “digital divide” into “digital opportunities”.","authors":["Indrajit Bhattacharya","Kunal Sharma"],"meta":["August 2007International Journal of Educational Management 21(6):543-568","DOI:10.1108/09513540710780055"],"references":["332370615_Networks_of_Innovation_Change_and_Meaning_in_the_Age_of_the_Internet","295893740_The_Relationship_Between_Leader_Power_Base_And_Influence_The_Moderating_Role_Of_Trust","292663747_Identifying_an_Appropriate_Pedagogical_Networked_Architecture_for_Online_Learning_Communities","292022280_Effective_change_management_in_higher_education","291269068_Teaching_in_the_Knowledge_Society_New_Skills_and_Instruments_for_Teachers","287956827_Teaching_with_Educational_Technology_in_the_21st_Century_The_Case_of_the_Asia-Pacific_Region","287690737_Managing_E-Learning_Strategies_Design_Delivery_Implementation_and_Evaluation","283922941_Seeing_things_as_they_really_are","269519853_Pedagogy_of_The_Oppressed","264402565_E-learning_strategies_how_to_get_implementation_and_delivery_right_first_time"]}