{"id":"249385785_The_Campaign_to_Sell_a_Harsh_Peace_for_Germany_to_the_American_Public_1944-1948","abstract":"In the spring of 1944, a group of prominent US opinion makers launched a campaign aimed at convincing the American public of the need for a harsh peace for Germany. By exploring the dynamics of this campaign, which revolved around the activities of the Writers’ War Board and the Society for the Prevention of World War III, this article focuses on an episode that has generally been neglected in the historiography of US post-war plans for Germany. It also adds a new dimension to the literature on the domestic mood in the US during the crucial period between the end of World War II and the onset of the Cold War, by first demonstrating how these anti-German spokesmen worked successfully to generate a hardening of popular opinion during 1944 and 1945, before charting how they found it increasingly difficult to sustain their campaign during 1946 and 1947. This failure was not simply a product of the natural cooling of popular passions or even the emergence of the Cold War. It also stemmed from the lobby’s inability to sustain the networks it had created during World War II, not to mention its tendency to overreach and oversell at key moments.","authors":["STEVEN CASEY"],"meta":["January 2005History 90(297):62-92","DOI:10.1111/j.1468-229X.2005.00323.x","SourceOAI"],"references":["249211526_The_Protean_Character_of_American_Liberalism","275753176_Sins_of_Fathers","270207067_Propaganda_in_an_Open_Society_The_Roosevelt_Administration_and_the_Media_1933-1941","270145138_The_Japan_Lobby_in_American_Diplomacy_1947-1952","265833697_Sounding_the_Tocsin_NSC_68_and_the_Soviet_Threat","249376580_Selling_the_Marshall_Plan_at_Home_The_Committee_for_the_Marshall_Plan_to_Aid_European_Recovery","249205034_American_Opinion_and_the_Russian_Alliance_1939-1945","249197351_Wartime_Origins_of_the_East-West_Dilemma_Over_Germany","247933389_The_New_Deal_and_the_Problem_of_Monopoly","247756334_The_American_People_and_Foreign_Policy","240316353_The_Marshall_Plan_and_Its_Meaning","229720401_Clearer_than_Truth_Public_Affairs_Television_and_the_State_Department's_Domestic_Information_Campaigns_1947-1952","35832717_The_Press_and_the_Origins_of_the_Cold_War"]}