{"id":"249570344_Developing_Policies_for_Cybercrime","abstract":"In this paper we have raised a number of issues that are particularly important for the development of cybercrime policy. The issues have been grouped around five questions regarding i] the crimes, ii] the criminals, iii] the prevalence of cybercrime, iv] the impacts on victims and v] societal response. We have also explained why each issue is important for policy-making. Globally, and in the European context, cybercrime is the focus of a significant amount concern. The Council of Europe drafted its Convention on Cybercrime in 2001, and the European Union has launched a number of initiatives aimed at controlling cybercrime. The points made in this paper should help in the furthering these activities. In summary, we have discussed: Standardization and Harmonization: that is, the need for a common taxonomy for cybercrime, so that the different types are clearly defined and classified. Hacker behaviour: although important, getting general and detailed information does not seem to be a very promising prospect. We probably need to resort to modelling to infer some of their behaviour. Better surveys and recording methodologies: this is clearly the most urgent need, and should be carried out at all levels and for all segments. Victim response, reporting behaviour and learning: it should be possible to gather more information on these issues. Impacts on victims: we have argued that much more information needs to be collected and it is especially important to refine the valuation methodology for financial losses. Legal activity and criminal justice policies: given the paucity of reliable data, they need to be tentative. Laws and implementation strategies should be developed in the spirit of work-in-progress. As more information is acquired, they should be modified and improved. It is still important to study cybercrime further even though policy with respect to it has been made already in a number of countries (for example, the US, the EU through the Convention on Cybercrime, India, and several others) because modifications will almost certainly be needed in the future as new issues may arise and new types of cybercrimes may appear. So far, public perceptions have been shaped largely by the media reports and publicity for Internet security. All of this is however, mostly based on sensational cases or unusual events. To a certain extent all this also influences lawmakers and as a result, legislation may be enacted before adequate studies have been conducted and sufficient objective information has been acquired. In the future at least, reliable data should be collected and analysed before further policies are developed. In addition, new policies for controlling cybercrime are in the process of being formulated in many other countries and the research suggested here could help them enormously. In the interests of space, this discussion has been limited to only some of the salient issues and there is clearly much that is still left to study. In the next section, we suggest some areas for further analysis.","authors":["Soumyo Moitra"],"meta":["August 2005European Journal of Crime Criminal Law and Criminal Justice 13(3):435-464","DOI:10.1163/1571817054604119"],"references":["263367942_US_Cybercrime_Law_Defining_Offenses_Special_Issue_A_Review_of_US_Criminal_Civil_and_Evidence_Law_as_it_Applies_to_Computer_Technology_Guest_Editors_Susan_W_Brenner_and_Joseph_J_Schwerha_IV","288481236_Making_computer_crime_count","284276102_NETCRIME_More_Change_in_the_Organization_of_Thieving","263452634_Redefining_borders_The_challenges_of_cybercrime","256623629_Simulation_of_Adaptive_Response_A_Model_of_Drug_Interdiction","229589093_Modeling_criminal_careers","220614575_Trends_In_Cybercrime_-_An_Overview_Of_Current_Financial_Crimes_On_The_Internet","220614273_An_empirical_investigation_of_network_attacks_on_computer_systems"]}