{"id":"249621256_Euclidean_Distance_as_a_Similarity_Metric_for_Principal_Component_Analysis","abstract":"Eigentechniques, in particular principal component analysis (PCA), have been widely used in meteorological analyses since the early 1950s. Traditionally, choices for the parent similarity matrix, which are diagonalized, have been limited to correlation, covariance, or, rarely, cross products. Whereas each matrix has unique characteristic benefits, all essentially identify parameters that vary together. Depending on what underlying structure the analyst wishes to reveal, similarity matrices can be employed, other than the aforementioned, to yield different results. In this work, a similarity matrix based upon Euclidean distance, commonly used in cluster analysis, is developed as a viable alternative. For PCA, Euclidean distance is converted into Euclidean similarity. Unlike the variance-based similarity matrices, a PCA performed using Euclidean similarity identifies parameters that are close to each other in a Euclidean distance sense. Rather than identifying parameters that change together, the resulting Euclidean similarity-based PCA identifies parameters that are close to each other, thereby providing a new similarity matrix choice. The concept used to create Euclidean similarity extends the utility of PCA by opening a wide range of similarity measures available to investigators, to be chosen based on what characteristic they wish to identify.","authors":["Kimberly L. Elmore","Michael Richman"],"meta":["March 2001Monthly Weather Review 129(3)","DOI:10.1175/1520-0493(2001)129<0540:EDAASM>2.0.CO;2","Projects: Large scale dynamical influences on Australian east coast rainfallPrincipal Component Analysis"],"references":["249610900_Relationships_between_the_Definition_of_the_Hyperplane_Width_to_the_Fidelity_of_Principal_Component_Loading_Patterns","313767487_The_varimax_criterion_for_analytic_rotation_in_factor_analysis","271774449_Objective_Weather_Forecasting_by_Statistical_Methods","269502239_A_Meterological_Application_of_Principal_Component_Analysis","266958141_MuLtivariate_Data_Analysis","266189530_Modern_Factor_Analysis","253069402_A_Method_for_Producing_and_Evaluating_Probabilistic_Forecasts_from_Ensemble_Model_Integrations","249611152_Robustness_of_Low-Frequency_Circulation_Patterns_Derived_from_EOF_and_Rotated_EOF_Analyses","249606102_Precipitation_Over_Northern_Italy_A_Description_by_Means_of_Principal_Component_Analysis","249605358_Empirical_Eigenvectors_of_Sea-Level_Pressure_Surface_Temperature_and_Precipitation_Complexes_Over_North_America"]}