{"id":"249829779_Time_and_the_Observer_The_Where_and_When_of_Consciousness_in_the_Brain","abstract":"Two models of consciousness are contrasted with regard to their treatmentof subjective timing. The standard Cartesian Theater model postulates aplace in the brain where \"it all comes together\": where the discriminationsin all modalities are somehow put into registration and \"presented\" forsubjective judgment. In particular, the Cartesian Theater model impliesthat the temporal properties of the content-bearing events occurring withinthis privileged representational medium determine subjective order. Thealternative, Multiple Drafts model holds that whereas the brain eventsthat discriminate various perceptual contents are distributed in both spaceand time in the brain, and whereas the temporal properties of these variousevents are determinate, none of these temporal properties determine subjectiveorder, since there is no single, constitutive \"stream of consciousness\"but rather a parallel stream of conflicting and continuously revised contents.Four puzzling phenomena that resist explanation by the standard model areanalyzed: two results claimed by Libet, an apparent motion phenomenon involvingcolor change (Kolers and von Grunau), and the \"cutaneous rabbit\" (Geldardand Sherrick) an illusion of evenly spaced series of \"hops\" produced bytwo or more widely spaced series of taps delivered to the skin. The unexamined assumptions that have always made the Cartesian Theater model so attractiveare exposed and dismantled. The Multiple Drafts model provides a betteraccount of the puzzling phenomena, avoiding the scientific and metaphysicalextravagances of the Cartesian Theater.","authors":["Daniel Dennett","Marcel Kinsbourne"],"meta":["June 1992Behavioral and Brain Sciences 15(02):183-247","DOI:10.1017/S0140525X00068229"],"references":["346824822_The_Emperor's_New_Mind_Concerning_Computers_Minds_and_The_Laws_of_PhysicsConcerning_Computers_Minds_and_The_Laws_of_Physics","341435984_The_Science_of_the_Mind","340430240_Critical_Rate_for_Identification_and_Information_Capacity_in_Hearing_System","322045503_PRODUCTION_OF_THRESHOLD_LEVELS_OF_CONSCIOUS_SENSATION_BY_ELECTRICAL_STIMULATION_OF_HUMAN_SOMATOSENSORY_CORTEX","321592160_Complex_Systems_-_Operational_Approaches_in_Neurobiology_Physics_and_Computers_Proceedings_of_the_International_Symposium_on_Synergetics_at_Schloss_Elmau_Bavaria_May_6-11_1985","321525703_The_Self_and_Its_Brain","316256035_The_Human_Psyche","300215820_What_concept_of_consciousness","300215819_The_haunted_brain_and_consciousness","297181812_Ecological_constraints_on_internal_representation_resonant_kinematics_of_perceiving_imagining_thinking_and_dreaming"]}