{"id":"249996330_Time-angle_sensitivity_kernels_for_sound-speed_perturbations_in_a_shallow_ocean","abstract":"Acoustic waves traveling in a shallow-water waveguide produce a set of multiple paths that can be characterized as a geometric approximation by their travel time (TT), direction of arrival (DOA), and direction of departure (DOD). This study introduces the use of the DOA and DOD as additional observables that can be combined to the classical TT to track sound-speed perturbations in an oceanic waveguide. To model the TT, DOA, and DOD variations induced by sound-speed perturbations, the three following steps are used: (1) In the first-order Born approximation, the Fréchet kernel provides a linear link between the signal fluctuations and the sound-speed perturbations; (2) a double-beamforming algorithm is used to transform the signal fluctuations received on two source-receiver arrays in the time, receiver-depth, and source-depth domain into the eigenray equivalent measured in the time, reception-angle and launch angle domain; and finally (3) the TT, DOA, and DOD variations are extracted from the double-beamformed signal variations through a first-order Taylor development. As a result, time-angle sensitivity kernels are defined and used to build a linear relationship between the observable variations and the sound-speed perturbations. This approach is validated with parabolic-equation simulations in a shallow-water ocean context.","authors":["Florian Aulanier","Barbara Nicolas","Philippe Roux","Jerome Mars"],"meta":["July 2013The Journal of the Acoustical Society of America 134(1):88-96","DOI:10.1121/1.4809650","SourcePubMed","Project: Ocean Acoustic Tomography"],"references":["281697306_Double_formation_de_voies_pour_la_separation_et_l'identification_d'ondes_applications_en_contexte_fortement_bruite_et_a_la_campagne_FAF03","239743906_3-D_sensitivity_kernels_for_surface-wave_observables","278704295_Parabolic_Equations","269066490_Wave-equation_tomography","249865023_Wave-equation_tomography","243771967_A_Split-step_Pad_Solution_for_the_Parabolic_Equation_Method_J_Acoust_Soc_Am_93_1736-1742","243526208_Travel-time_sensitivity_kernels_in_ocean_acoustic_tomography","239644775_First_Born_and_Rytov_approximations_Modeling_and_inversion_conditions_in_a_canonical_example","234391646_Seismic_tomography_adjoint_methods_time_reversal_and_banana-doughnut_kernels","229772149_3-D_sensitivity_kernels_for_surface_wave_observables"]}