{"id":"250027934_Utilizacao_de_pesquisas_como_construir_modelos_teoricos_para_avaliacao","abstract":"Diversos fóruns internacionais consideram que investigações podem subsidiar a tomada de decisão em saúde. O artigo tem como objetivo a revisão bibliográfica para propor modelo de avaliação do uso de resultados de pesquisas em políticas de saúde. Dois autores foram selecionados como referencial teórico, pela contribuição no contexto americano (Weiss, C.) e latino-americano (Trostle et al.). Foram selecionados os seguintes componentes como parte do modelo teórico: pesquisa, comunicação, interação, atores, pressão social e financiamento. Nos resultados incluíram-se critérios para avaliar cada componente. Elaborou-se matriz de efetividade da utilização de pesquisa com as categorias de análise: estrutural, operacional, estratégica, sistêmica e específica. Para demonstrar o balanço de forças atuantes no processo pesquisa/política elaborou-se matriz de fatores de promoção e de impedimento. As dimensões sociais, econômica, política, cultural e gerencial foram selecionadas. O conjunto composto pelo modelo teórico e as matrizes subsidiam a seleção de indicadores de monitoramento e avaliação de um programa de utilização de resultados de pesquisas do Ministério da Saúde.","authors":["Flávia Tavares Silva Elias","Maria Aparecida de Assis Patroclo"],"meta":["March 2005Ciencia & Saude Coletiva 10(1)","DOI:10.1590/S1413-81232005000100028"],"references":["250028017_Avaliacao_dos_programas_de_saude_perspectivas_teorico_metodologicas_e_politicas_institucionais","344867578_Social_knowledge_and_public_policy_eight_models_of_interaction","273550797_How_far_does_research_influence_policy_European","256991172_Research_for_Policy","248056225_The_Use_of_Social_Science_Knowledge_in_Policy_Decisions_at_a_National_Level","247928103_The_Many_Meanings_of_Research_Utilization","246438908_Improving_the_linkage_between_social_research_and_public_policy","246113409_Evaluation_research_in_the_political_context","229499550_Using_social_science_for_social_policy","44822295_Knowledge_utilization_and_the_process_of_policy_formation_towards_a_framework_for_action"]}