{"id":"250185023_IMPROVE_A_Multidimensional_Method_for_Teaching_Mathematics_in_Heterogeneous_Classrooms","abstract":"The purpose of the present research was to design an innovative instructional method for teaching mathematics in heterogeneous classrooms (with no tracking) and to investigate its effects on students' mathematics achievement. The method is based on current theories in social cognition and metacognition. It consists of three interdependent components: metacognitive activities, peer interaction, and systematic provision of feedback-corrective-enrichment. The method is called IMPROVE, the acronym of which represents all the teaching steps that constitute the method: Introducing the new concepts, Metacognitive questioning, Practicing, Reviewing and reducing difficulties, Obtaining mastery, Verification, and Enrichment. The research includes two studies, both implemented in seventh grades: One focused on in-depth analyses of students' information processing under the different learning conditions (N = 247), and one investigated the development of students' mathematical reasoning over a full academic year (N = 265). Results of both studies showed that IMPROVE students significantly outperformed the nontreatment control groups on various measures of mathematics achievement. The theoretical and practical implications of the research are discussed.","authors":["Zemira R. Mevarech","Bracha Kramarski"],"meta":["June 1997American Educational Research Journal 34(2):365-394","DOI:10.3102/00028312034002365"],"references":["286016611_Whenever_and_where_ever_we_choose_Replication_of_success_for_all","276410458_Computer-based_drill_and_practice_in_arithmetic_-_Widening_the_gap_between_high-achieving_and_low-achieving_students","343757201_An_Overview_of_Research_on_Cooperative_Learning_Related_to_Mathematics","319394383_How_to_Solve_it","314414522_Computer-Based_Drill_and_Practice_in_Arithmetic_Widening_the_Gap_between_High-_and_Low-Achieving_Students","304958532_Achievement_Effects_of_Ability_Grouping_in_Secondary_Schools_A_Best-Evidence_Synthesis","284385230_Classwide_Curriculum-Based_Measurement_Helping_General_Educators_Meet_the_Challenge_of_Student_Diversity","277387034_An_Overview_of_Research_on_Cooperative_Learning_Related_to_Mathematics","276245166_The_Effects_of_Cooperative_Mastery_Learning_Strategies_on_Mathematics_Achievement","273302073_Learning_Mathematics_in_Different_Mastery_Environments"]}