{"id":"250151452_'Click_on_Miaow'_How_Children_of_Three_and_Four_Years_Experience_the_Nursery_Computer","abstract":"This article reports the findings of an ecological, mixed-method study of the ways in which children aged three and four, from a variety of class and ethnic backgrounds, learn from the computer in their inner-urban nursery setting. In doing so, it acknowledges and contributes to the ongoing debate over the effects of information and communications technology (ICT) on young children's development and learning (both at home and at school), and explores the claims that are currently made for a positive role for ICT as a context for development in early childhood. The study was undertaken as part of a larger project, DATEC (Developmentally Appropriate Technology in Early Childhood), which is seeking to develop and disseminate exemplary uses of ICT with young children in a range of European settings. DATEC itself follows in the footsteps of an earlier project with European partners, CHAT (Children's Awareness of Technology), which launched a website for the exchange of research ideas and information in this field. Both DATEC and CHAT have aimed to develop cross-national (European) understandings of developmentally appropriate uses of technology, in a manner which parallels the work of the National Association for the Education of Young Children in the USA.","authors":["LIZ BROOKER","John Siraj-Blatchford"],"meta":["June 2002Contemporary Issues in Early Childhood 3(2)","DOI:10.2304/ciec.2002.3.2.7"],"references":["258932974_Electronic_media_and_early_childhood_education","347690992_Actual_Minds_Possible_Worlds","293422092_Young_Children_and_Technology_A_Cautionary_Note","290161742_Play_learning_and_the_early_childhood_curriculum","272177872_Mind_and_Society","262280138_Access_to_learning_problems_and_policies","253221578_Problems_of_the_development_of_clocks","250055167_A_Semiotic_Analysis_of_Young_Children's_Symbol_Making_in_a_Classroom_Computer_Center","247499618_Logo_experiences_with_young_children_Describing_performance_problem-solving_and_social_contexts_of_learning","246161372_Failure_to_Connect_How_Computers_Affect_Our_Children''s_Minds-for"]}