{"id":"250291048_Les_usages_adolescents_des_TIC_entre_autonomie_et_dependance","abstract":"Cet article se propose de traiter des usages adolescents des outils de la communication a distance au travers de la double question de la volonte d’autonomisation avec la famille d’une part, et du desir de rapprochement avec les pairs d’autre part. Nous aborderons donc, en premier lieu, les formes de negociation au sein des foyers et les notions de competences differenciees entre parents et enfants qui rendent difficile le controle par les premiers des usages des seconds. Nous traiterons ensuite de cette volonte farouche de faire groupe. Nous discuterons pour ce faire les appuis que representent l’anonymat pour de nombreuses formes d’experimentations sociales, la facon dont les groupes vivent en dehors de leur espace local d’inscription. Nous examinerons enfin les formes d’objectivation relationnelles et les nouvelles popularites mediatiques liees aux nombreux recensements et comptages operes par les outils de mise en relation. Notre analyse nous poussera, a terme, a favoriser un controle modere de ces univers de la communication a distance ou l’experimentation fait partie des regles du jeu et des moyens d’apprendre.","authors":["Johann Chaulet"],"meta":["January 2009Empan 76(4)","DOI:10.3917/empa.076.0057"],"references":["247294716_Public_Displays_of_Connection","222527539_Are_Social_Networks_Technologically_Embedded_How_Networks_Are_Changing_Today_with_Changes_in_Communication_Technology","295303357_USE_OF_SMS_Dual_strategy_of_exteriorization_and_withdrawal_in_daily_interaction","293060749_From_voice_to_writing_the_diversification_of_modes_of_mobile_communication_in_france_and_japan","251049239_La_production_de_soi_comme_technique_relationnelle_Un_essai_de_typologie_des_blogs_par_leurs_publics","251048892_L'individualisme_connecte_entre_la_technique_numerique_et_la_societe","251045803_De_la_voix_a_l'ecriture_La_diversification_des_modes_de_communication_mobile_en_france_et_au_japon","240986201_La_pratique_du_mini-message_Une_double_strategie_d'exteriorisation_et_de_retrait_de_l'intimite_dans_les_interactions_quotidiennes"]}