{"id":"250221943_Google_Scholar_as_a_New_Source_for_Citation_Analysis","abstract":"Traditionally, the most commonly used source of bibliometric data is Thomson ISI Web of Knowledge, in particular the Web of Science and the Journal Citation Reports (JCR), which provide the yearly Journal Impact Factors (JIF). This paper presents an alternative source of data (Googl Scholar, GS) as well as 3 alternatives to the JIF to assess journal impact (h-index, g-index and the number of citations per paper), Becatise of its broader range of data sources, the use of GS generally results in more comprehensive citation coverage in the area of management and international business. The use of GS particularly benefits academics publishing in sources that are not (well) covered in ISI. Among these are books, conference papers, non-US journals, and in general journals in the field of strategy and international business. The 3 alternative GS-based metrics showed strong correlations with the traditional JIR. As such, they provide academics and universities committed to JIFs with a good alternative for journals that are not ISI-indexed. However, we argue that these metrics provide additional advantages over the JIF and that the free availability of GS allows for a democratization of citation analysis as it provides every academic access to citation data regardless of their institution's financial means.","authors":["Anne-Wil Harzing","Ron van der Wal"],"meta":["June 2008Ethics in Science and Environmental Politics 8(1):61-73","DOI:10.3354/esep00076"],"references":["282577802_Planned_Change_in_Organizations_The_Influence_of_National_Culture","258153619_On_the_Relationship_Between_Research_and_Practice","248843855_Impact_of_Data_Sources_on_Citation_Counts_and_Rankings_of_LIS_Faculty_Web_of_Science_vs","239514143_Deflated_inflated_and_phantom_citation_counts","237349542_Equivalence_of_results_from_two_citation_Thomson_ISI's_Citation_Index_and_Google's_Scholar_service","234095849_Underrepresentation_of_regional_ecologicalresearch_output_by_bibliometric_indices","239727270_The_End_of_Business_Schools_Less_Success_Than_Meets_the_Eye","239232079_Vortex_dynamics_in_3D_continous_myocardium_with_fiber_rotation_filament_instability_and_fibrilla-tion","235361314_What_do_we_know_about_the_index","234014175_Does_the_H-index_for_ranking_scientists_really_work"]}