{"id":"250421031_A_Survey_of_Search_Methodologies_and_Automated_Approaches_for_Examination_Timetabling","abstract":"Exam timetabling is one of the most important administra- tive activities that takes place in academic institutions. In this paper we present a critical discussion of the research on exam timetabling in the last decade or so. This last ten years has seen an increased level of attention on this important topic. There has been a range of significant contributions to the scientific literature both in terms of theoretical and practical aspects. The main aim of this survey is to highlight the new trends and key research achievements that have been carried out in the last decade. We also aim to outline a range of relevant important research issues and challenges that have been generated by this body of work. We first define the problem and review previous survey papers. Algo- rithmic approaches are then classified and discussed. These include early techniques (e.g. graph heuristics) and state-of-the-art approaches includ- ing meta-heuristics, constraint based methods, multi-criteria techniques, hybridisations, and recent new trends concerning neighbourhood struc- tures, which are motivated by raising the generality of the approaches. Summarising tables are presented to provide an overall view of these techniques. We discuss some issues on decomposition techniques, system tools and languages, models and complexity. We also present and discuss some important issues which have come to light concerning the public benchmark exam timetabling data. Different versions of problem datasets with the same name have been circulating in the scientific community in the last ten years which has generated a significant amount of confusion. We clarify the situation and present a re-naming of the widely studied datasets to avoid future confusion. We also highlight which research pa- pers have dealt with which dataset. Finally, we draw upon our discussion of the literature to present a (non-exhaustive) range of potential future research directions and open issues in exam timetabling research.","authors":["Rong Qu","E. K. Burke","Barry Mccollum","Liam T. G. Merlot"],"meta":["January 2006Journal of Scheduling"],"references":["268863483_Local_variable_neighbourhood_search","306280364_The_Design_of_Memetic_Algorithms_for_Scheduling_and_Timetabling_Problems_in_Recent_Advances_in_Memetic_Algorithms","290501437_Variable_Neighbourhood_Search","288952786_An_experimental_investigation_of_iterated_local_search_for_coloring_graphs_applications_of_evolutionary_computing","284668417_A_concept_of_compromise_solutions_and_the_method_of_the_displaced_ideal","284486598_Iterated_Local_Search_International_series_in_operations_research_and_management_science","268615524_Developments_of_Variable_Neighborhood_Search","264238319_A_Survey_of_Automated_Timetabling","263138443_Solving_Examination_Timetabling_Problems_through_Adaption_of_Heuristic_Orderings_Models_and_Algorithms_for_Planning_and_Scheduling_Problems_Editors_Philippe_Baptiste_Jacques_Carlier_Alix_Munier_Andrea","262409031_A_Multicriteria_Approach_to_Examination_Timetabling"]}