{"id":"250806217_Experimental_analysis_of_methods_for_imputation_of_missing_values_in_databases","abstract":"A very important issue faced by researchers and practitioners who use industrial and research databases is incompleteness of data, usually in terms of missing or erroneous values. While some of data analysis algorithms can work with incomplete data, a large portion of them require complete data. Therefore, different strategies, such as deletion of incomplete examples, and imputation (filling) of missing values through variety of statistical and machine learning (ML) procedures, are developed to preprocess the incomplete data. This study concentrates on performing experimental analysis of several algorithms for imputation of missing values, which range from simple statistical algorithms like mean and hot deck imputation to imputation algorithms that work based on application of inductive ML algorithms. Three major families of ML algorithms, such as probabilistic algorithms (e.g. Naive Bayes), decision tree algorithms (e.g. C4.5), and decision rule algorithms (e.g. CLIP4), are used to implement the ML based imputation algorithms. The analysis is carried out using a comprehensive range of databases, for which missing values were introduced randomly. The goal of this paper is to provide general guidelines on selection of suitable data imputation algorithms based on characteristics of the data. The guidelines are developed by performing a comprehensive experimental comparison of performance of different data imputation algorithms.","authors":["Alireza Farhangfar","Lukasz Kurgan","Witold Pedrycz"],"meta":["April 2004Proceedings of SPIE - The International Society for Optical Engineering 5421","DOI:10.1117/12.542509"],"references":["262236141_Hybrid_Inductive_Machine_Learning_An_Overview_of_CLIP_Algorithms","228340648_Mining_the_cystic_fibrosis_data","221112709_Characterizing_the_Applicability_of_Classification_Algorithms_Using_Meta-Level_Learning","314755797_Statistical_Analysis_with_Missing_Data","304345923_Maximum_likelihood_from_incomplete_data_via_the_EM_algorithm_With_discussion","284528507_Multiple_Imputation_for_Nonresponse_in_Surveys","256476485_Maximum-likelihood_estimation_from_incomplete_data_via_the_EM_algorithm_with_discussion","235418978_A_Mathematical_Theory_of_Communication","226222944_Induction_of_Decision_Trees","220205086_Imputation_of_Missing_Data_in_Industrial_Databases"]}