{"id":"250984421_Taxonomia_de_Bloom_revisao_teorica_e_apresentacao_das_adequacoes_do_instrumento_para_definicao_de_objetivos_instrucionais","abstract":"Muitos são os instrumentos existentes para apoiar o planejamento didático-pedagógico, a estruturação, a organização, a definição de objetivos instrucionais e a escolha de instrumentos de avaliação. A Taxonomia de Bloom é um desses instrumentos cuja finalidade é auxiliar a identificação e a declaração dos objetivos ligados ao desenvolvimento cognitivo que, no contexto deste artigo, engloba a aquisição do conhecimento, competência e atitudes, visando facilitar o planejamento do processo de ensino e aprendizagem. Embora este seja um instrumento adequado para utilização no ensino superior, poucos educadores fazem uso dele por não conhecerem uma maneira adequada de utilizá-lo. Este artigo tem como objetivo apresentar a Taxonomia de Bloom e as modificações ocorridas nos últimos anos, assim como esclarecer a forma como ela pode ser utilizada dentro do contexto de ensino de engenharia.Bloom's taxonomy was created in order to support the classification of educational objectives and facilitate the process of teaching, learning and the cognitive development. Even though Bloom's Taxonomy has proven to be a significant tool for the process of teaching, learning, and assessment, few educators use it adequately, mostly because its use is not as clear as it should be. This paper describes the Bloom's Taxonomy including its updated version, and has the objective of clarifying some important points of how to Bloom's Taxonomy can be used in engineering courses (teaching, learning, and assessment) to provide an adequate, planed, and controlled cognitive development.","authors":["Ana paula Marcheti","Renato Vairo Belhot"],"meta":["January 2010Gestão & Produção 17(2)","DOI:10.1590/S0104-530X2010000200015"],"references":["277226376_Requisitos_profissionais_do_estudante_de_engenharia_de_producao_uma_visao_atraves_dos_estilos_de_aprendizagem","271790064_Identifying_Course_Goals_Domains_and_Levels_of_Learning","242403035_Taxonomy_of_educational_objectives_the_classification_of_educational_goals_handbook_i","242400296_A_Revision_of_Bloom's_Taxonomy_An_Overview","240570295_Innocence_in_Education","44832397_Handbook_on_Formative_and_Summative_Evaluation_of_Student_Learning","44828922_A_Taxonomy_for_Learning_Teaching_and_Assessing_a_Revision_of_Bloom's_Taxonomy_of_Educational_Objectives"]}