{"id":"250987796_Sistema_de_classificacao_facetada_e_tesauros_instrumentos_para_organizacao_do_conhecimento","abstract":"O artigo tem o objetivo de aprofundar questões teóricas e conceituais que fundamentam a concepção de sistema de classificação facetada e o tesauro. Apresenta aspectos teóricos referentes aos meios utilizados para organização e recuperação da informação. Os sistemas para organização do conhecimento incluem uma variedade de esquemas para organizar, gerenciar e recuperar a informação, existindo vários tipos de sistemas. Dentre eles, podemos citar sistemas de classificação, tesauro, cabeçalhos de assuntos, ontologia, glossários e dicionários. Descrevem-se princípios, natureza e tipos de sistemas de classificação, com especial ênfase aos sistemas de classificação facetada e o tesauro. \n\nPalavras-chave\n\nSistema de classificação; Classificação facetada; Tesauro; Organização do conhecimento.\n\nFaceted classification system and thesaurus: \ntechnical instruments for knowledge organization\n\nAbstract\n\nThe objective of this article is to contribute to and thoroughly analyze theoretical and conceptual questions which are the base for a conception of faceted classification systems and thesaurus. Theoretical aspects about the means utilized in information organization and retrieval are presented. The systems of knowledge organization include different schemes for organizing, managing and retrieving information.There are different types of systems, for instance, classification system, thesaurus, subject heading, ontology, glossaries and dictionaries. Principles, nature and types of classification systems are described, with special emphasis on the systems of faceted classification and thesaurus. \n\nKeywords\n\nClassification System; Faceted classification; Thesaurus; Knowledge organization.","authors":["Ana Maria Delazari Tristão","Gleisy Fachin","Alarcon Orestes"],"meta":["August 2004Ciência da Informação 33(2)","DOI:10.1590/S0100-19652004000200017"],"references":["255612117_Da_classificacao_dos_seres_a_classificacao_dos_saberes","239562368_A_Web_Semantica_e_suas_contribuicoes_para_a_ciencia_da_informacao","26349993_Organizacao_de_unidades_de_conhecimento_em_hiperdocumentos_o_modelo_conceitual_como_espaco_comunicacional_para_a_realizacao_da_autoria","327462467_Classification_theory_yesterday_and_today","279678976_Classificacoes_facetadas","243768931_Faceted_Access_A_Review_of_the_Literature","239561972_Perspectivas_para_o_estudo_da_area_de_representacao_da_informacao","2577743_A_Conceptual_Framework_For_Classification_Of_Construction_Works"]}