{"id":"250987869_Modelizacao_de_dominios_de_conhecimento_uma_investigacao_de_principios_fundamentais","abstract":"As teorias e metodologias desenvolvidas, tanto no escopo temático da ciência da informação quanto no da ciência da computação, que estão voltadas para a representação do conhecimento, apresentam, de forma mais ou menos abrangente, discussões sobre princípios como contexto de conhecimento, natureza dos conceitos, relações entre conceitos e sistemas de conceito. No campo do quadro teórico, investigam-se os modelos de abstração utilizados nas duas áreas e modelos representacionais associados à modelagem de sistemas de banco de dados, especificamente o modelo orientado a objetos. Da ciência da informação, analisam-se teorias ligadas à representação de sistemas de conceitos, como a teoria da classificação facetada e a teoria do conceito. Da teoria da terminologia, utilizam-se princípios estabelecidos para a determinação de conceitos e suas relações. Garantindo a especificidade de cada área, a comparação entre as teorias se dá, tendo em vista quatro pontos relacionados ao processo de modelização, a saber: o método de raciocínio; o objeto de representação; as relações entre os objetos; as formas de representação gráfica.\n\nhttp://revista.ibict.br/ciinf/article/view/1064","authors":["Maria Luiza de Almeida Campos"],"meta":["April 2004Ciência da Informação 33(1)","DOI:10.1590/S0100-19652004000100003"],"references":["225070439_Knowledge_Representation_Logical_Philosophical_and_Computational_Foundations","26349993_Organizacao_de_unidades_de_conhecimento_em_hiperdocumentos_o_modelo_conceitual_como_espaco_comunicacional_para_a_realizacao_da_autoria","327461073_A_referent-oriented_analytical_concept_theory_for_INTERCONCEPT","327460222_A_new_paradigm_for_social_science_terminology","248132001_Towards_an_integrated_environment_with_open_hypermedia_systems","225070478_Formal_Ontology_in_Information_Systems_FOIS","220691196_Object-oriented_databases_-_a_semantic_data_model_approach","44418626_Prolegomena_to_library_classification_by_S_R_Ranganathan","2626138_Toward_Principles_for_the_Design_of_Ontologies_Used_for_Knowledge_Sharing"]}