{"id":"251112124_The_Relationship_between_the_COP-COM_Variable_and_the_Horizontal_Acceleration_of_the_Body_in_Postural_Sway_Falling_and_Walking","abstract":"Many researchers have referred to the human body as an inverted pendulum. The inverted pendulum model, relating the center\nof mass (COM), the controlled variable, with the center of pressure (COP), the controlling variable, shows that the differences\nbetween COP and COM are proportional to the horizontal accelerations of the body. Using the three-dimensional motion analysis \nsynchronized with three force plates, the inverted pendulum model was applied to four different movements (quiet standing,\nintended postural sway, falling and walking) in twenty healthy volunteers who have no musculoskeletal problems and balance\ndisorders in order to investigate the relationship among COP, COM and the horizontal acceleration of the body. We also performed\nthe crosscorrelation analysis between (COP-COM) and the horizontal acceleration of the body. Results revealed that (COP-COM)\nhad high negative correlations with the horizontal acceleration in quiet standing and postural sway. In addition, high negative\ncorrelations between (COP-COM) and horizontal accelerations of the body were found before falling occurs, but high positive\ncorrelations were found once falling occurs. However, during walking, high negative correlations between (COPCOM) and midial/lateral\naccelerations of the body were found. Therefore, the correlation between (COP-COM) and horizontal accelerations of the body\nbased on the inverted pendulum model can be used to determine the postural stability in falling.","authors":["Hoon-Seok Choi","Youngho Kim"],"meta":["January 2010IFMBE proceedings 25(4)","DOI:10.1007/978-3-642-03882-2_74"],"references":["222307045_Computing_the_COM_from_the_COP_in_postural_sway_movements","8460491_Postural_stability_in_the_elderly_Empirical_confirmation_of_a_theoretical_model","11861426_Analysis_of_postural_perturbation_responses"]}