{"id":"251440561_Search_Engine_Optimization_SEO_as_a_Dynamic_Online_Promotion_Technique_The_Implications_of_Activity_Theory_for_Promotion_Managers","abstract":"The paper examined the possibility of an extension of Bedny's perspective of 'activity' theory as a framework for the elaboration of new online promotion channels, such as the search engines. This conceptualization was approached as a framework for Search Engine Optimization (SEO) contextual issues, which can be used to aid the design and analysis of the SEO promotion technique investigations. A critical hermeneutic approach was adopted for the present study. Our organized literature review has led us to an initial judgmental sample of fifty-five (55) published research works (selected at the first stage of the literature review), in order to be scanned and reached at one to thirty (30) published research works, which were processed to offer some valuable findings. Because of the zero research function of activity theory in the e-marketing literature and as the only refereed journal that focused on the search engine marketing themes was the Search Engine Marketing Journal, which was recently launched, we broadened the selection of research papers based on activity theory focusing on web mediated communication applications. Our research intention was to categorize the constructs of the following fundamental concept: 'behavioristic framework for the elaboration of SEO promotion technique.' The examination of the critical case of Increase Visibility Inc. gave us valuable information with regard to the potentiality of activity theory, application to modern online promotion channels, such as the SEO and, thus, the phenomenon studied became more visible. The literature review and the case study analysis findings indeed revealed very new constructs and established an initial understanding of the constructs and their relationship to other constructs regarding our extension of Bedny's perspective of activity theory about the elaboration of the SEO promotion technique. Practical implications of the extension of Bedny's perspective of activity theory are introduced for promotion managers.","authors":["George S Spais"],"meta":["April 2010Innovative Marketing 6(1):7-24","Project: promotion management"],"references":["295852902_The_Application_of_Activity_Theory_to_Web-Mediated_Communication","271903978_E-Commerce_and_Consumer's_Expectations","313074426_Content_analysis_of_100_company_web_sites","296204204_Contemporary_research_in_e-marketing","294693768_Activity_theory_as_a_potential_framework_for_human-computer_interaction_research_in_Nardi_B_ed_Context_and_consciousness_activity_theory_and_humancomputer_interaction_Cambridge","284693184_Case_Studies_In_The_Handbook_for_Qualitative_Research_NK_Denzin_YS_Lincoln","264816607_WAW_an_activity_theory_based_tool_for_early_website_usability_assessment","258126815_Search_Engine_Marketing_Why_it_Benefits_Us_all","250892564_Promoting_Online_Sales_of_Dental_Supplies_on_a_Tight_Budget","247833874_Developing_an_effective_and_affordable_search_engine_marketing_strategy_for_nonprofits"]}