{"id":"251422102_A_Comparison_Study_between_Data_Mining_Tools_over_some_Classification_Methods","abstract":"Nowadays, huge amount of data and information are available for everyone, Data can now be stored in many different kinds of databases and information repositories, besides being available on the Internet or in printed form. With such amount of data, there is a need for powerful techniques for better interpretation of these data that exceeds the human's ability for comprehension and making decision in a better way. In order to reveal the best tools for dealing with the classification task that helps in decision making, this paper has conducted a comparative study between a number of some of the free available data mining and knowledge discovery tools and software packages. Results have showed that the performance of the tools for the classification task is affected by the kind of dataset used and by the way the classification algorithms were implemented within the toolkits. For the applicability issue, the WEKA toolkit has achieved the highest applicability followed by Orange, Tanagra, and KNIME respectively. Finally; WEKA toolkit has achieved the highest improvement in classification performance; when moving from the percentage split test mode to the Cross Validation test mode, followed by Orange, KNIME and finally Tanagra respectively.","authors":["Abdullah H Wahbeh","Qasem A. Al-Radaideh","Mohammed N. Al-Kabi","Emad Al-Shawakfa"],"meta":["September 2011International Journal of Advanced Computer Science and Applications 2(8)","DOI:10.14569/SpecialIssue.2011.010304"],"references":["313363859_Automatic_Arabic_Text_Classification","267837124_A_Study_on_Selective_Data_Mining_Algorithms","242517154_Automatic_Arabic_Text_Classification","242076740_Mining_Student_Data_Using_Decision_Trees","234791471_Characterising_Data_Mining_software","228949269_The_Impact_of_Classification_Evaluation_Methods_on_Rough_Sets_Based_Classifiers","316600283_Data_Mining_Concepts_and_Techniques","259042246_Rapid_Miner_E-Commerce","248590571_A_Survey_of_Knowledge_Discovery_and_Data_Mining_Tools","225811854_Open-source_machine_learning_R_Meets_Weka"]}