{"id":"251514228_Higher-Order_And_Lower-Order_Thinking_Skills_Achievement_In_Secondary-Level_Animal_Science_Does_Block_Scheduling_Pattern_Influence_End-Of-Course_Learner_Performance","abstract":"Block scheduling has been a significant change in the organizational structure of many schools. However, little is known about its effects on agricultural education and on cognition. This study compared higher- (HOTS) and lower-order thinking skills (LOTS) achievement of students enrolled in animal science on a Modified A/B Block schedule to that of students on a Nine- Week (4X4) Block schedule. Twenty-two teachers participated-I2 Modified A/B schools with I89 students and IO Nine-Week (4X4) schools with 136 students. Achievement was measured by an examination consisting of two scales based on Newcomb and Trefz ' (1987) \"levels of learning\" model. Thirty-three HOTS and 23 LOTS items were included. Teachers responded to a questionnaire describing themselves and their schools. Student achievement for LOTS was slightly more than half of the 'conventional\" 70% passing standard and slightly less for HOTS. T-tests revealed student performance on a Modified A/B schedule was significantly superior. However, hierarchical regression analysis revealed that the moderator variables student length of FFA membership and teacher tenure significantly explained student variability for HOTS achievement. After effects of the moderator variables were removed, then scheduling pattern did not explain additional variation.","authors":["Michael Craig Edwards","Gary Briers"],"meta":["December 2000Journal of Agricultural Education 41(4)","DOI:10.5032/jae.2000.04002"],"references":["315243132_Assessment_Of_Cognitive_Discourse_A_Study_Of_Thinking_Opportunities_Provided_By_Professors","270366914_Elementary_Survey_Analysis","258132393_Teaching_Learning_and_School_Organization_Principles_of_Practice_and_the_Regularities_of_Schooling","254315925_Instructional_Ideas_for_Teaching_in_Block_Schedules","253868794_Higher_Order_Thinking_Opportunities_Provided_By_Professors_In_College_Of_Agriculture_Classrooms","247543953_Skills_for_successful_21st_century_school_leaders","243771127_The_Copernican_plan_Restructuring_the_American_high_school","238511056_Block_Scheduling's_Impact_On_Instruction_FFA_And_SAE_In_Agricultural_Education","237433327_The_Relationship_Between_Instruction_And_Student_Performance_At_The_Various_Levels_Of_Cognition_Among_Selected_Ohio_Production_Agriculture_Programs","234705721_Effects_of_High_School_Restructuring_Ten_Schools_at_Work_ERS_Concerns_in_Education_Series"]}