{"id":"251571967_Investigating_the_Use_of_Remote_Sensing_and_GIS_Techniques_to_Detect_Land_Use_and_Land_Cover_Change_A_Review","abstract":"The accuracy of change detection on the earth’s surface is important for understanding the relationships and interactions between human and natural phenomena. Remote Sensing and Geographic Information Systems (GIS) have the potential to provide accurate information regarding land use and land cover changes. In this paper, we investigate the major tech-niques that are utilized to detect land use and land cover changes. Eleven change detection techniques are reviewed. An analysis of the related literature shows that the most used techniques are post-classification comparison and principle component analysis. Post-classification comparison can minimize the impacts of atmospheric and sensor differences between two dates. Image differencing and image ratioing are easy to implement, but at times they do not provide ac-curate results. Hybrid change detection is a useful technique that makes full use of the benefits of many techniques, but it is complex and depends on the characteristics of the other techniques such as supervised and unsupervised classifica-tions. Change vector analysis is complicated to implement, but it is useful for providing the direction and magnitude of change. Recently, artificial neural networks, chi-square, decision tree and image fusion have been frequently used in change detection. Research on integrating remote sensing data and GIS into change detection has also increased.","authors":["Abdullah F. Alqurashi","Lalit Kumar"],"meta":["June 2013Advances in Remote Sensing 2(2):193-204","DOI:10.4236/ars.2013.22022"],"references":["291898296_Image_Difference_Threshold_Strategies_and_Shadow_Detection","279594716_Change_analysis_in_the_United_Arab_Emirates_An_investigation_of_techniques","321204155_Remote_Sensing_Based_Analysis_of_Land_Use_Land_Cover_Dynamics_in_Takula_Block_Almora_District_Uttarakhand","305391857_Land_use_land_cover_change_detection_of_Indra_river_watershed_through_Remote_Sensing_using_Multi-Temporal_satellite_data","286751961_Effect_of_Land_Use_Land_Cover_change_detection_of_ungauged_watershed","285467427_Vegetation_mapping_and_change_detection_using_SPOT_MLA_and_Landsat_imagery_in_Kluane_National_Park","283880027_An_enhanced_classification_approach_to_change_detection_in_semi-arid_environments","280745248_Land-use_mapping_and_change_detection_in_a_coal_mining_area_-_A_case_study_in_the_Jharia_coalfield_India","279712386_Inland_wetland_change_detection_using_aircraft_MSS_data","279556634_Comparison_of_change-detection_techniques_for_monitoring_tropical_forest_clearing_and_vegetation_regrowth_in_a_time_series"]}