{"id":"251553765_Revisiones_sistematicas_de_la_literatura_Que_se_debe_saber_acerca_de_ellas","abstract":"A systematic review (SR) is an article on the «synthesis of the available evidence», in which a review is performed on the quantitative and qualitative aspects of primary studies, with the aim of summarising the existing information on a particular topic. After collecting the articles of interest the researchers then analyse them and compare the evidence they provide with that from similar ones. The reasons for justifying performing an SR are: when there is uncertainty as regards the effect of an intervention due to there being existing evidence against its real usefulness; when it is desired to know the magnitude of the effect of an intervention; and, when it is desired to analyse the behaviour of an intervention in subject sub-groups. The aim of this article is to perform an update on the basic concepts, indications, strengths and weaknesses of SRs, as well as the development of an SR, the most important potential biases to be taken into account in this type of design, and the basic concepts as regards the meta-analysis. Two examples of SR are also included, of use for surgeons, who often come across this type of design when searching for scientific evidence in biomedical journal bases.\nCopyright © 2011 AEC. Published by Elsevier Espana. All rights reserved.","authors":["Carlos Manterola","Paula Astudillo","Esteban Arias","Nataniel Claros"],"meta":["March 2013Cirugía Española 91(3)","DOI:10.1016/j.ciresp.2011.07.009"],"references":["308161394_Preferred_Reporting_Items_for_Systematic_Reviews_and_Meta-Analyses_the_PRISMA_statement","250374021_Comites_de_evaluacion_etica_y_cientifica_para_la_investigacion_en_seres_humanos_y_las_pautas_CIOMS_2002","246281503_Reseccion_abierta_frente_a_laparoscopica_en_el_cancer_de_colon_no_complicado_Revision_sistematica","240989967_Efectividad_de_la_profilaxis_antibiotica_en_el_curso_de_la_colecistectomia_laparoscopica_electiva_Revision_sistematica_de_la_literatura","236301570_Meta-analysis_of_Observational_Studies_in_EpidemiologyA_Proposal_for_Reporting","224954123_Systematic_Review_of_Literature_with_Different_Types_of_Designs","292739651_El_meta-analisis_en_la_investigacion_clinica","284049281_Revisiones_sistematicas_de_la_literatura","272918333_Moher_D_Liberati_A_Tetzlaff_J_Altman_DG_Group_PPreferred_reporting_items_for_systematic_reviews_and_meta-analyses_the_PRISMA_statement_BMJ_339_b2535","246616456_Metaanalisis_QUOROM"]}