{"id":"251514022_Broadband_optimization_of_a_pentamode-layered_spherical_acoustic_waveguide","abstract":"Transformational acoustics offers the theoretical possibility of cloaking obstacles within fluids, provided metamaterials having continuously varying bulk moduli and densities can be found or constructed. Realistically, materials with the proper, continuously varying anisotropies do not presently exist. Discretely layered cloaks having constant material parameters within each layer are a viable alternative, but due to their discrete nature, may become ineffective outside of narrow frequency ranges. Because of such limitations, there is interest in finding discretely layered systems that can be effective in as wide as possible bandwidth without the need for unrealizable material properties within each layer. The present work introduces a novel methodology for finding optimal material parameters for use in such layered cloaks. In principle, the technique could be applied to any acoustic or electromagnetic scattering problem, but for purposes of demonstration, this paper considers a fluid-loaded acoustically hard sphere with a cloak that comprised layered pentamodes, whose material properties are constrained to lie within reasonable ranges relative to the density and bulk modulus of water.","authors":["Clyde L Scandrett","Jeffrey E. Boisvert","Thomas R. Howarth"],"meta":["September 2011Wave Motion 48(6):505-514","DOI:10.1016/j.wavemoti.2011.02.007"],"references":["255603001_Ultra_wide_band_RCS_optimization_of_multilayered_cylindrical_structures_for_arbitrarily_polarized_incident_plane_waves","253993277_A_multilayer_structured_acoustic_cloak_with_homogeneous_isotropic_materials","249505453_Which_Elasticity_Tensors_are_Realizable","231120819_On_cloaking_for_elasticity_and_physical_equations_with_a_transformation_invariant_form","220116507_Cloaking_Devices_Electromagnetic_Wormholes_and_Transformation_Optics","243782083_Acoustic_Fields_and_Waves_in_Solids","243506045_Properties_of_a_periodically_stratified_acoustic_half-space_and_its_relation_to_a_Biot_fluid","235522904_Cloaking_with_optimized_homogeneous_anisotropic_layers","234481977_Acoustic_and_Electromagnetic_Waves","49645320_Acoustic_cloaking_using_layered_pentamode_materials","1921825_Acoustic_cloaking_theory"]}