{"id":"251713378_Computer_supported_mathematics_with_Geogebra","abstract":"The use of information technology has been used to improve capability and success in teaching and learning environments. This case study has been carried out with a view to replying the question of how we can make the subject of integers, which students in the 6th grades find too difficult to learn, easier and more permanent. The subject of Integers is one of the most difficult subjects that students have difficulty in grasping because they have only learnt natural numbers in Math. In general, when students come across a new number system, they have difficulty in learning it. Also, as they haven’t conceptualized the subject, they do not like the subject and cannot correlate the mathematical links. However, as teachers and mathematics educators, our duty is to make our students enjoy the subject of integers and ensure its retention. For this purpose, so as to eliminate the problems faced during the learning process, we have tried to conceptualize the subject by employing new software, Geogebra, by which we aim to provide a permanent learning for our students. The subject of integers has been taught with different methods to two homogeneous classes. One of the classes was taught with traditional teaching techniques, whereas the other was taught by Geogebra. In order to evaluate how much they understood the subject, a test has been applied immediately after the lesson. Two weeks later, a new test was applied to see how much of the subject they remembered. Thereafter, by comparing the results of both exams, the contributions and benefits of Geogebra in teaching Math have been analyzed.","authors":["Zerrin Ayvaz Reis"],"meta":["December 2010Procedia - Social and Behavioral Sciences 9:1449-1455","DOI:10.1016/j.sbspro.2010.12.348"],"references":["263346310_Intelligent_tutorial_system_for_teaching_of_probability_and_statistics_at_high_school_in_Mexico","239830609_Ways_of_linking_geometry_and_algebra_The_case_of_GeoGebra","228398347_Combination_of_dynamic_geometry_algebra_and_calculus_in_the_software_system_GeoGebra","285747667_Analysis_of_a_learning_community_as_a_social_network"]}