{"id":"251878461_The_Cancer_Imaging_Archive_TCIA_Maintaining_and_Operating_a_Public_Information_Repository","abstract":"The National Institutes of Health have placed significant emphasis on sharing of research data to support secondary research. Investigators have been encouraged to publish their clinical and imaging data as part of fulfilling their grant obligations. Realizing it was not sufficient to merely ask investigators to publish their collection of imaging and clinical data, the National Cancer Institute (NCI) created the open source National Biomedical Image Archive software package as a mechanism for centralized hosting of cancer related imaging. NCI has contracted with Washington University in Saint Louis to create The Cancer Imaging Archive (TCIA)-an open-source, open-access information resource to support research, development, and educational initiatives utilizing advanced medical imaging of cancer. In its first year of operation, TCIA accumulated 23 collections (3.3 million images). Operating and maintaining a high-availability image archive is a complex challenge involving varied archive-specific resources and driven by the needs of both image submitters and image consumers. Quality archives of any type (traditional library, PubMed, refereed journals) require management and customer service. This paper describes the management tasks and user support model for TCIA.","authors":["Kenneth Clark","Bruce Vendt","Kirk Smith","John Freymann"],"meta":["July 2013Journal of Digital Imaging 26(6)","DOI:10.1007/s10278-013-9622-7","SourcePubMed","Project: The Cancer Imaging Archive (TCIA)"],"references":["273353710_Big_data_The_future_of_biocuration","51481343_Informatics_and_Data_Mining_Tools_and_Strategies_for_the_Human_Connectome_Project","40443460_Quantitative_Imaging_for_Evaluation_of_Response_to_Cancer_Therapy","23243080_Collecting_48000_CT_Exams_for_the_Lung_Screening_Study_of_the_National_Lung_Screening_Trial","23235959_The_future_of_Biocuration","273442540_The_future_of_biocuration","253038429_Workstation_acquisition_node_for_multicenter_imaging_studies","245700107_Payments_for_Adverse_Events","221862642_The_Human_Connectome_Project_A_data_acquisition_perspective","49628459_Regulatory_Compliance_Requirements_for_an_Open_Source_Electronic_Image_Trial_Management_System"]}