{"id":"252069448_The_IFC_Standard_-_A_Review_of_History_Development_and_Standardization","abstract":"IFC (Industry Foundation Classes) is an open and standardized data model intended to enable interoperability between building information modeling software applications in the AEC/FM industry. IFC has been in development by an industry consortium since 1994, and since the start of the effort, the evolving industry context, standardization organization, resource availability, and technology development have exposed the standardization process to a dynamic environment. While the overarching mission of IFC standardization has always been to enable interoperability between AEC/FM software applications, the approach for how best to operationalize that mission has changed over the years. Through a literature review supported by the general theory on IT standardization, this study follows the development process of the IFC standard from its origins in the early 1990s to its latest activities in 2012. The end result is both a descriptive review of the history of IFC standardization and the establishment of an initial connection to IT standardization research for the IFC standard by profiling the effort in accordance with existing IT standardization theories and typologies. The review highlights the evolution of IFC standardization through several distinct phases, and its gradual movement from emphasizing technical architecture development towards growing involvement in specifying the processes facilitating its use. The organization behind the standard has also seen changes in its modus operandi, from initially being a closed and loosely coupled alliance to evolving into a consortium incorporating open hybrid standardization, where a formal standards body publishes the standards prepared by the consortium. The consortium has faced many challenges compiling an ambitious interoperability standard with few resources, and were it not for the growing demand for the standard provided by public actors, momentum and enthusiasm for the effort might have petered out due to slow market uptake and low use of the data standard in actual construction projects thus far. While this paper does not investigate the adoption phenomenon in-depth, the moderate uptake of the standard can perhaps be explained to be a symptom of the slow adoption of collaborative model-based construction processes and industry reluctance to switch over to new IT tools, which in turn are prerequisites for the existence of demand for an open interoperability standard.","authors":["Mikael Laakso","Arto Kiviniemi"],"meta":["May 2012Electronic Journal of Information Technology in Construction 17"],"references":["267553386_Understanding_and_managing_systemic_innovation_in_project-based_industries","261951128_Binary_trading_relationships_and_the_limits_of_EDI_standards_The_Procrustean_bed_of_standards","253542777_Modeling_Systemic_Innovation_in_Design_and_Construction_Networks","247955941_The_Process_of_Standard_Making_The_Case_of_Cellular_Mobile_Telephony","247849859_The_Economics_Of_Compatibility_Standards_An_Introduction_To_Recent_Research","293739705_The_Yin_and_Yang_of_standards_development","289539869_IT_Standards_Typology","283681430_IFC_Certification_process_and_data_exchange_problems","268405042_IFC_Aspect_Card_Library","267257978_A_buildingSMART_ontology"]}