{"id":"252157377_ALARM-NET_Wireless_Sensor_Networks_for_Assisted-Living_and_Residential_Monitoring","abstract":"We describe ALARM-NET, a wireless sensor network for assisted-living and residential monitoring. It integrates envi- ronmental and physiological sensors in a scalable, heteroge- neous architecture. A query protocol allows real-time col- lection and processing of sensor data by user interfaces and back-end analysis programs. One such program determines circadian activity rhythms of residents, feeding activity in- formation back into the sensor network to aid context-aware power management, dynamic privacy policies, and data as- sociation. Communication is secured end-to-end to protect sensitive medical and operational information. The ALARM-NET system has been implemented as a network of MICAz sensors, stargate gateways, iPAQ PDAs, and PCs. Customized infrared motion and dust sensors, and integrated temperature, light, pulse, and blood oxygenation sensors are present. Software components include: TinyOS query processor and security modules for motes; AlarmGate, an embedded Java application for managing power, privacy, security, queries, and client connections; Java resident mon- itoring and sensor data querying applications for PDAs and PCs; and a circadian activity rhythm analysis program. We show the correctness, robustness, and extensibility of the system architecture through a scenario-based evaluation of the integrated ALARM-NET system, as well as perfor- mance data for individual software components.","authors":["A. Wood","G. Virone","Tam Thien Doan","Q. Cao"],"meta":["December 2008"],"references":["244446843_VigilNet_An_Integrated_Sensor_Network_System_for_Energy-Ecien_t_Surveillance","221234592_SATIRE_a_software_architecture_for_smart_AtTIRE","38413517_CodeBlue_An_Ad_Hoc_Sensor_Network_Infrastructure_for_Emergency_Medical_Care","23162170_Behavioral_Patterns_of_Older_Adults_in_Assisted_Living","4152352_Monitoring_Volcanic_Eruptions_with_a_Wireless_Sensor_Network","236284799_Katz_S_Ford_A_B_Moskowitz_R_W_Jackson_B_A_Jaffe_M_W_Studies_of_illness_in_the_aged_The_Index_of_ADL_a_standardized_measure_of_biological_and_psychosocial_function_JAMA_185_914-919","221091825_TinySec_A_link_layer_security_architecture_for_wireless_sensor_networks","220293126_SPINS_Security_protocols_for_Sensor_Networks","220098935_A_node_scheduling_scheme_for_energy_conservation_in_large_wireless_sensor_networks","9523454_Studies_of_Illness_in_the_Aged_The_Index_of_Adl_A_Standardized_Measure_of_Biological_and_Psychosocial_Function"]}