{"id":"252313802_A_sensitivity_study_of_the_effectiveness_of_active_debris_removal_in_LEO","abstract":"The near-Earth orbital debris population will continue to increase in the future due to ongoing space activities, on-orbit explosions, and accidental collisions among resident space objects. Commonly adopted mitigation measures, such as limiting postmission orbital lifetimes of satellites to less than 25 years, will slow down the population growth, but will be insufficient to stabilize the environment. To better limit the growth of the future debris population, the remediation option, i.e., removing existing large and massive objects from orbit, needs to be considered. This paper does not intend to address the technical or economical issues for active debris removal. Rather, the objective is to provide a sensitivity study to illustrate and quantify the effectiveness of various remediation options. An effective removal criterion based upon mass and collision probability is developed. This study includes simulations with removal rates ranging from 5 to 20 objects per year, starting in the year 2020. The outcome of each simulation is analyzed and compared with others. The summary of the study serves as a general guideline for future debris removal consideration.","authors":["J.-C. Liou","Nicholas L. Johnson"],"meta":["February 2009Acta Astronautica 64(2-3):236-243","DOI:10.1016/j.actaastro.2008.07.009"],"references":["234449150_Critical_number_of_spacecraft_in_low_Earth_orbit_using_satellite_fragmentation_data_to_evaluate_the_stability_of_the_orbital_debris_environment","223571206_NASA's_new_breakup_model_of_evolve_40","248349861_Collision_activities_in_the_future_orbital_debris_environment","248349380_Analysis_of_the_effectiveness_of_space_debris_mitigation_measures_using_the_DELTA_model","245139595_A_LEO_satellite_postmission_disposal_study_using_LEGEND","223896984_LEGEND_-_a_three-dimensional_LEO-to-GEO_debris_evolutionary_model","223200853_EVOLVE_40_orbital_debris_mitigation_studies","222914568_Instability_of_the_present_LEO_satellite_populations","23624850_A_New_Approach_to_Evaluate_Collision_Probabilities_Among_Asteroids_Comets_and_Kuiper_Belt_Objects","7349074_Planetary_science_-_Risks_in_space_from_orbiting_debris"]}