{"id":"253337615_Cell_density_during_differentiation_can_alter_the_phenotype_of_bone_marrow-derived_macrophages","abstract":"Bone marrow-derived macrophages (BMDMs) are widely used primary cells for studying macrophage function. However, despite numerous protocols that are currently available, lack of a notable consensus on generating BMDMs may obscure the reliability in comparing findings from different studies or laboratories.\nIn this study, we addressed the effect of cell density on the resulting macrophage population. With reference to previously published methods, bone marrow cells from wild type C57BL/6 mice were plated at either 4 x 105 cells or 5 x 106 cells per 10 cm and cultured in 20% L-cell conditioned media for 7 days, after which they were analyzed for cell surface markers, production of proinflammatory cytokines, and responsiveness to polarizing signals. Reproducibly, cells plated at lower density gave a pure population of CD11b+F4/80+ macrophages (97.28 +/- 0.52%) with majority being Ly-6C-Ly-6G- and c-Fms+, while those plated at higher density produced less CD11b+F4/80+ cells and a considerably higher proportion of CD11b+F4/80+CD11c+ (68.72 +/- 2.52%) and Ly-6C-Ly-6G+ (71.10 +/- 0.90%) cells. BMDMs derived from higher plating density also secreted less proinflammatory cytokines such as IL-6, IL-12 and TNF-alpha and were less phagocytic, and had a different pattern of expression for M1- and M2-related genes upon LPS or IL-4 stimulation.\nOverall, our findings indicate that altering cell density during BMDM differentiation can give rise to distinct macrophage populations that could vary the outcome of a functional study.","authors":["Chan Mi Lee","WJ Hu"],"meta":["July 2013Cell and Bioscience 3(1):30","DOI:10.1186/2045-3701-3-30","SourcePubMed"],"references":["51715752_Protective_and_Pathogenic_Functions_of_Macrophage_Subsets","51250254_Generation_of_Mature_Murine_Monocytes_from_Heterogeneous_Bone_Marrow_and_Description_of_Their_Properties","284795924_Generation_of_mouse_bone_marrow-derived_macrophages_BM-MFs","282493986_Methods_in_Molecular_Biology","281359924_The_Isolation_and_Characterization_of_Murine_Macrophages","274408649_Immature_macrophages_derived_from_mouse_bone_marrow_produce_large_amounts_of_IL-12p40_after_LPS_stimulation","240226944_Generation_of_mouse_bone_marrow-derived_macrophages_BM-MFs","227778234_Biology_and_action_of_colony-Stimulating_factor-1","221763952_Generation_of_Mouse_Bone_Marrow-Derived_Macrophages","50225862_Bone_Marrow-Derived_Macrophages_BMM_Isolation_and_Applications"]}