{"id":"253644715_Pareto_Distance_for_Multi-layer_Network_Analysis","abstract":"Social Network Analysis has been historically applied to single networks, e.g., interaction networks between co-workers. However, the advent of on-line social network sites has emphasized the stratified structure of our social experience. Individuals usually spread their identities over multiple services, e.g., Facebook, Twitter, LinkedIn and Foursquare. As a result, the analysis of on-line social networks requires a wider scope and, more technically speaking, models for the representation of this fragmented scenario. The recent introduction of more realistic layered models has however determined new research problems related to the extension of traditional single-layer network measures. In this paper we take a step forward over existing approaches by defining a new concept of geodesic distance that includes heterogeneous networks and connections with very limited assumptions regarding the strength of the connections. This is achieved by exploiting the concept of Pareto efficiency to define a simple and at the same time powerful measure that we call Pareto distance, of which geodesic distance is a particular case when a single layer (or network) is analyzed. The limited assumptions on the nature of the connections required by the Pareto distance may in theory result in a large number of potential shortest paths between pairs of nodes. However, an experimental computation of distances on multi-layer networks of increasing size shows an interesting and non-trivial stable behavior.","authors":["Matteo Magnani","Luca Rossi"],"meta":["April 2013","DOI:10.1007/978-3-642-37210-0_27","Conference: Proceedings of the 6th international conference on Social Computing, Behavioral-Cultural Modeling and Prediction"],"references":["253644716_Formation_of_Multiple_Networks","233747155_Social_Network_Data_and_Practices_The_Case_of_Friendfeed","232276305_Shortest_Path_Discovery_in_the_Multi-layered_Social_Network","283617410_Emergence_of_Scaling_in_Random_Networks","280566512_Networks_An_Introduction","266755883_The_Evolution_of_Random_Graphs","259173905_Social_Network_Analysis","257163017_The_small_world_problem","239592320_Frame_analysis_an_essay_on_the_oranization_of_experience","235338615_Conversation_practices_and_network_structure_in_Twitter"]}