{"id":"253953906_Equations_of_tropical_varieties","abstract":"We introduce a scheme-theoretic enrichment of the principal objects of\ntropical geometry. Using a category of semiring schemes, we construct tropical\nhypersurfaces as schemes over idempotent semirings (such as the tropical\nnumbers T) by writing them as solution sets to explicit systems of tropical\nequations that are uniquely determined by tropical linear algebra. We then\ndefine a tropicalization functor that sends closed subschemes of a toric\nvariety over a ring R with non-archimedean valuation to closed subschemes of\nthe corresponding tropical toric variety. Upon passing to the set of T-points\nthis reduces to Kajiwara-Payne's extended tropicalization, and in the case of a\nprojective hypersurface we show that the scheme structure determines the\nmultiplicities attached to the top-dimensional cells. By varying the valuation,\nthese tropicalizations form algebraic families of T-schemes parameterized by\nthe analytification of Spec R. For projective subschemes, the Hilbert\npolynomial is preserved by tropicalization, regardless of the valuation. We\nconclude with some examples and a discussion of tropical bases in the\nscheme-theoretic setting.","authors":["Jeffrey Giansiracusa","Noah Giansiracusa"],"meta":["July 2013Duke Mathematical Journal 165(18)","DOI:10.1215/00127094-3645544","SourcearXiv"],"references":["346470233_Semirings_Algebraic_Theory_and_Applications_in_Computer_Science","316800400_Graduate_Texts_in_Mathematics","298566986_Specialization_of_linear_systems_from_curves_to_graphs","288606824_double-struck_F_sign1-schemes_and_toric_varieties","267015212_Tropical_geometry_and_mirror_symmetry","266861399_Tropical_toric_geometry","265820447_Specialization_of_linear_systems_from_curves_to_graphs_with_an_appendix_by_Brian_Conrad","265682445_Spectral_theory_and_analytic_geometry_over_non-archimedean_fields","265427522_F1-schemes_and_toric_varieties","259804328_Tropical_schemes_tropical_cycles_and_valuated_matroids"]}