{"id":"254056832_Shift_2D_Rotation_Invariant_Sparse_Coding_for_Multivariate_Signals","abstract":"Classical dictionary learning algorithms (DLA) allow unicomponent signals to be processed. Due to our interest in two-dimensional (2D) motion signals, we wanted to mix the two components to provide rotation invariance. So, multicomponent frameworks are examined here. In contrast to the well-known multichannel framework, a multivariate framework is first introduced as a tool to easily solve our problem and to preserve the data structure. Within this multivariate framework, we then present sparse coding methods: multivariate orthogonal matching pursuit (M-OMP), which provides sparse approximation for multivariate signals, and multivariate DLA (M-DLA), which empirically learns the characteristic patterns (or features) that are associated to a multivariate signals set, and combines shift-invariance and online learning. Once the multivariate dictionary is learned, any signal of this considered set can be approximated sparsely. This multivariate framework is introduced to simply present the 2D rotation invariant (2DRI) case. By studying 2D motions that are acquired in bivariate real signals, we want the decompositions to be independent of the orientation of the movement execution in the 2D space. The methods are thus specified for the 2DRI case to be robust to any rotation: 2DRI-OMP and 2DRI-DLA. Shift and rotation invariant cases induce a compact learned dictionary and provide robust decomposition. As validation, our methods are applied to 2D handwritten data to extract the elementary features of this signals set, and to provide rotation invariant decomposition.","authors":["Quentin Barthélemy","Larue Anthony","Aurélien Mayoue","David Mercier"],"meta":["April 2012IEEE Transactions on Signal Processing 60(4):1597-1611","DOI:10.1109/TSP.2012.2183129"],"references":["312994338_MOTIF_AN_EFFICIENT_ALGORITHM_FOR_LEARNING_TRANSLATION_INVARIANT_DICTIONARIES","283531358_Sparse_approximation_by_greedy_algorithms","267703799_Shift_Invariant_Sparse_Coding_of_Image_and_Music_Data","266491808_Apprentissage_de_Dictionnaires_Multivaries_et_Decomposition_Parcimonieuse_Invariante_par_Translation_et_par_Rotation_2D","316588757_A_Wavelet_Tour_of_Signal_Processing","313005343_Identification_of_Partially_Observed_Objects_in_Two_and_Three_Dimensions_by_Matching_Noisy_Characteristic_Curves","312973075_The_tradeoffs_of_large_scale_learning","285744826_Sparse_representation_for_color_image_restoration","283360188_Sparse_Coding_with_an_Overcomplete_Basis_Set_A_Strategy_Employed_by_V1","278433201_Atomic_Decomposition_by_Basis_Pursuit"]}