{"id":"254006607_Query_preserving_graph_compression","abstract":"It is common to find graphs with millions of nodes and billions of edges in, e.g., social networks. Queries on such graphs are often prohibitively expensive. These motivate us to propose query preserving graph compression, to compress graphs relative to a class Λ of queries of users' choice. We compute a small Gr from a graph G such that (a) for any query Q Ε Λ Q, Q(G) = Q'(Gr), where Q' Ε Λ can be efficiently computed from Q; and (b) any algorithm for computing Q(G) can be directly applied to evaluating Q' on Gr as is. That is, while we cannot lower the complexity of evaluating graph queries, we reduce data graphs while preserving the answers to all the queries in Λ. To verify the effectiveness of this approach, (1) we develop compression strategies for two classes of queries: reachability and graph pattern queries via (bounded) simulation. We show that graphs can be efficiently compressed via a reachability equivalence relation and graph bisimulation, respectively, while reserving query answers. (2) We provide techniques for aintaining compressed graph Gr in response to changes ΔG to the original graph G. We show that the incremental maintenance problems are unbounded for the two lasses of queries, i.e., their costs are not a function of the size of ΔG and changes in Gr. Nevertheless, we develop incremental algorithms that depend only on ΔG and Gr, independent of G, i.e., we do not have to decompress Gr to propagate the changes. (3) Using real-life data, we experimentally verify that our compression techniques could reduce graphs in average by 95% for reachability and 57% for graph pattern matching, and that our incremental maintenance algorithms are efficient.","authors":["Wenfei Fan","Jianzhong Li","Xin Wang","Yinghui Wu"],"meta":["May 2012","DOI:10.1145/2213836.2213855"],"references":["221613532_Compact_reachability_labeling_for_graph-structured_data","221611895_Measurement_and_Analysis_of_Online_Social_Networks","313562144_Index_Structures_for_Path_Expressions","283750345_What's_new_on_the_Web_The_evolution_of_the_Web_from_a_search_engine_perspective","270549257_Graph_pattern_matching","250428492_Laws_of_Graph_Evolution_Densiflcation_and_Shrinking_Diameters","227039422_Graph_Reachability_Queries_A_Survey","222502511_On_the_Computational_Complexity_of_Dynamic_Graph_Problems","221654429_Neighbor_query_friendly_compression_of_social_networks","221653630_On_compressing_social_networks"]}