{"id":"254049121_Work_in_progress_-_Courses_dedicated_to_the_development_of_logical_and_algorithmic_thinking","abstract":"Undergraduate students often start their academic course of studies with inadequate learning and thinking skills. Our college has a policy of setting high standards, while supporting students' learning in a variety of ways. In this paper we present two distinctive courses designed to aid students develop logical and algorithmic thinking, essential for coping with software engineering studies. The courses are taught independently from but in parallel to Introduction to Computer Science and Math courses of first semester. Courses elaborate on algorithmic thinking, logical reasoning and argumentation while explicating abstract ideas which are often hidden in a loaded curriculum of the disciplinary courses. At the same time, connections are made to the application of the abstract ideas in the disciplinary courses. Feedback from participants in the two courses demonstrates an increased awareness and appreciation of abstract ideas beyond mathematical and programming knowledge, improved problem-solving skills and deeper understanding of concepts and principles.","authors":["Orna Muller","Amir Rubinstein"],"meta":["October 2011Proceedings - Frontiers in Education Conference","DOI:10.1109/FIE.2011.6142846"],"references":["322875561_The_Role_of_Logic_in_Teaching_Proof","269104215_Validations_of_Proofs_Considered_as_Texts_Can_Undergraduates_Tell_Whether_an_Argument_Proves_a_Theorem","264944143_Examining_the_Role_of_Logic_in_Teaching_Proof","256288231_Validations_of_Proofs_Considered_as_Texts_Can_Undergraduates_Tell_Whether_an_Argument_Proves_a_Theorem","288047613_Analogical_Transfer_in_Problem_Solving","263555096_Multimedia_aids_to_problem-solving_transfer_-_A_dual_coding_approach","250888362_Supporting_abstraction_processes_in_problem_solving_through_pattern-oriented_instruction","242625839_Why_universities_require_compute_science_students_to_take_math","234827817_Pattern_oriented_instruction_and_the_enhancement_of_analogical_reasoning","232564298_Problem-solving_transfer"]}