{"id":"254042947_On_the_speedup_of_single-disk_failure_recovery_in_XOR-coded_storage_systems_Theory_and_practice","abstract":"Modern storage systems stripe redundant data across multiple disks to provide availability guarantees against disk failures. One form of data redundancy is based on XOR-based erasure codes, which use only XOR operations for encoding and decoding. In addition to providing failure tolerance, a storage system must also provide fast failure recovery to avoid data unavailability. We consider the problem of speeding up the recovery of a single-disk failure for arbitrary XOR-based erasure codes. We address this problem from both theoretical and practical perspectives. We propose a replace recovery algorithm, which uses a hill-climbing technique to search for a fast recovery solution, such that the solution search can be completed within a short time period. We further implement our replace recovery algorithm atop a parallelized architecture to justify its practicality. We experiment our replace recovery algorithm and its parallelized implementation on a networked storage system testbed, and demonstrate that our replace recovery algorithm uses less recovery time than the conventional approach.","authors":["Yunfeng Zhu","Patrick P. C. Lee","Yuchong Hu","Liping Xiang"],"meta":["April 2012","DOI:10.1109/MSST.2012.6232371"],"references":["228743856_In_search_of_IO-optimal_recovery_from_disk_failures","224252111_NCFS_On_the_Practicality_and_Extensibility_of_a_Network-Coding-Based_Distributed_File_System","312917980_The_Google_file_system","311556934_Rethinking_erasure_codes_for_cloud_file_systems_Minimizing_IO_for_recovery_and_degraded_reads","262204122_Rethinking_erasure_codes_for_cloud_file_systems_minimizing_IO_for_recovery_and_degraded_reads","261267657_A_cost-based_heterogeneous_recovery_scheme_for_distributed_storage_systems_with_RAID-6_codes","259860916_Polynomial_Codes_Over_Certain_Finite_Fields","247417879_Ro_w-diagonal_parity_for_double_disk_failure_correction","228815345_Flat_XOR-based_erasure_codes_in_storage_systems_Constructions_efficient_recovery_and_tradeoffs","224285715_Artificial_Intelligence_A_Modern_Approach"]}