{"id":"254257856_Sensitivity_distribution_visualizations_of_impedance_tomography_measurement_strategies","abstract":"As reconstruction of images in electrical impedance tomography (EIT) is sensitive to noise, low signal level and small errors in measured data result into large errors in final images. In order to optimize the signal acquisition from any region, measurement should possess the highest sensitivity and selectivity in that region. This study was conducted to illustrate measurement properties of various generally applied measurement strategies in EIT. Computer models were utilized in simulating the sensitivity distributions of neighboring, cross, opposite and adaptive methods in simplified volume conductors. Animation sequences of visualized sensitivity fields were created for each method. Highest sensitivity values were obtained with the cross and opposite methods, while neighboring was the least sensitive, when investigating a single measurement. Maximum proportional selectivities in the centre of a 2D model were 100, 94, 88 and 62 %, respectively, as compared between the neighboring, cross, opposite and adaptiv methods. In 3D, the corresponding values were 100, 55, 50 and 7.6 %. Regions of negative sensitivity were detected, which in part complicates the reconstruction. Nevertheless, studying sensitivity distributions may improve the basic understanding of the technique and help improving the outcome of EIT in the future.","authors":["Pasi Kauppinen","Jari AK Hyttinen","Jaakko Malmivuo"],"meta":["January 2006International Journal of Bioelectromagnetism 8(1):VII/1 - VII/9"],"references":["330005331_Sensitivity_Distribution_Simulations_of_Impedance_Tomography_Electrode_Combinations","258884491_Bioelectromagnetism_-_Principles_and_Applications_of_Bioelectric_and_Biomagnetic_Fields","254320278_Sensitivity_distribution_simulations_of_impedance_tomography_electrode_combinations","13617974_Detailed_model_of_the_thorax_as_a_volume_conductor_based_on_the_visible_human_man_data","13199151_A_software_implementation_for_detailed_volume_conductor_modelling_in_electrophysiology_using_finite_difference_method","284685279_Bioelectrical_impedance_techniques_in_medicine","222133851_Electrical_Impedance_Tomography_Methods_History_and_Applications","19592503_The_Sheffield_Data_Collection_System","19592494_Physical_study_of_the_sensitivity_distribution_in_multi-electrode_systems","14879267_An_Adaptive_Current_Tomograph_Using_Voltage_Sources"]}