{"id":"254319307_Non-local_unsupervised_variational_image_segmentation_models","abstract":"⋆ Abstract. New image denoising models based on non-local image information have been recently introduced in the literature. These so-called \"non-local\" denoising models provide excellent results because these models can denoise smooth regions or/and textured regions simultaneously, unlike standard denoising models. Stan- dard variational models s.a. Total Variation-based models are defined to work in a small local neighborhood, which is enough to denoise smooth regions. However, textures are not local in nature and requires semi-local/non-local information to be denoised efficiently. Several papers have introduced non-local filters and non-local variational models for image denoising. Yet, few studies have been done to develop unsupervised image segmentation models based on non-local information. This will be the goal of this paper. We define and study three unsupervised non-local seg- mentation models. These models will be based on the continuous global minimiza- tion approach for image segmentation recently introduced in (10, 6). The energy of (10, 6) is a first order energy composed of the weighted Total Variation norm and a linear term. The first proposed non-local segmentation model will extend the Total Variation regularization term of (10, 6) to the non-local Total Variation energy. We will see that the non-local energy can segment fine and small structures better than the standard Total Variation energy. The second model will extend the data-based term of (10, 6) to a non-local term using the Chan-Vese model. The proposed non-local Chan-Vese model will overcome the main limitation of the orig- inal model, that does not work with local intensity inhomogeneities. Finally, the third model will also extend the data-based term of (10, 6) to a non-local term using the Mumford-Shah energy. The original Mumford-Shah energy is designed to work for piecewise smooth images only. We suggest to extend it to textures, defining a non-local Mumford-Shah model that works with real-world images. Numerical minimization schemes presented in this paper are based on continuous and discrete (graph cut) approaches. Experimental results will illustrate the improvements pro- vided by the three proposed non-local unsupervised segmentation models.","authors":["Xavier Bresson","T. F. CHAN"],"meta":["January 2008"],"references":["248964741_A_Duality_Based_Approach_for_Realtime_TV-L1_Optical_Flow","324337656_Flows_in_Networks","313060456_User's_guide_to_viscosity_solutions_of_second_order_partial_differential_equations","310487702_Fronts_propagating_with_curve-dependent_speed_algorithms_based_on_Hamilton-Jacobi_formulations","301822646_The_Split_Bregman_method_for_L1_regularized_problems","278282637_An_algorithm_for_total_variation_minimization_and_applications","269633959_The_Split_Bregman_method_for_L1-egularized_problems","263559970_An_Algorithm_for_Total_Variation_Minimization_and_Applications_Special_Issue_on_Mathematics_and_Image_Analysis","263155724_A_Multiphase_Level_Set_Framework_for_Image_Segmentation_Using_the_Mumford_and_Shah_Model","248336793_Viscosity_solutions_of_fully_non-linear_second-order_partial_differential_equations"]}