{"id":"254464403_Mining_the_web_for_points_of_interest","abstract":"A point of interest (POI) is a focused geographic entity such as a landmark, a school, an historical building, or a business. Points of interest are the basis for most of the data supporting location-based applications. In this paper we propose to curate POIs from online sources by bootstrapping training data from Web snippets, seeded by POIs gathered from social media. This large corpus is used to train a sequential tagger to recognize mentions of POIs in text. Using Wikipedia data as the training data, we can identify POIs in free text with an accuracy that is 116% better than the state of the art POI identifier in terms of precision, and 50% better in terms of recall. We show that using Foursquare and Gowalla checkins as seeds to bootstrap training data from Web snippets, we can improve precision between 16% and 52%, and recall between 48% and 187% over the state-of-the-art. The name of a POI is not sufficient, as the POI must also be associated with a set of geographic coordinates. Our method increases the number of POIs that can be localized nearly three-fold, from 134 to 395 in a sample of 400, with a median localization accuracy of less than one kilometer.","authors":["Adam Rae","Vanessa Murdock","Adrian Popescu","Hugues Bouchard"],"meta":["August 2012","DOI:10.1145/2348283.2348379"],"references":["245585636_Exploring_place_through_user-generated_content_Using_Flickr_to_describe_city_cores","288676499_YAGO2_A_Spatially_and_Temporally_Enhanced_Knowledge_Base_from_Wikipedia","257574316_Modeling_locations_with_social_media","248509440_Introduction_to_the_CoNLL_-_2003_Shared_Task","233688161_Direct_and_Inverse_Solutions_of_Geodesics_on_the_Ellipsoid_with_Application_of_Nested_Equations","228057950_Conditional_Random_Fields_Probabilistic_Models_for_Segmenting_and_Labeling_Sequence_Data","226284737_Discovering_points_of_interest_from_users'_map_annotations","221572384_How_flickr_helps_us_make_sense_of_the_world_Context_and_content_in_community-contributed_media_collections","221318675_Spirittagger_a_geo-aware_tag_suggestion_tool_mined_from_flickr","221299581_Web-a-Where_Geotagging_web_content"]}