{"id":"254401531_Profile_identification_via_weighted_related_metric_scaling_An_application_to_dependent_Spanish_children","abstract":"Disability and dependency (lack of autonomy in performing common everyday actions) affect health status and quality of life, therefore they are significant public health issues. The main purpose of this study is to establish the existing relationship among different variables (continuous, categorical and binary) referred to children between 3 and 6 years old and their functional dependence in basic activities of daily living. We combine different types of information via weighted related metric scaling to obtain homogeneous profiles for dependent Spanish children. The redundant information between groups of variables is modeled with an interaction parameter that can be optimized according to several criteria. In this paper, the goal is to obtain maximum explained variability in an Euclidean configuration. Data comes from the Survey about Disabilities, Personal Autonomy and Dependence Situations, EDAD 2008, (Spanish National Institute of Statistics, 2008)","authors":["Irene Albarran Lozano","Pablo J. Alonso-Gonz치lez","Aurea Grane"],"meta":["June 2015Journal of the Royal Statistical Society Series A (Statistics in Society) 178(3):1-26","DOI:10.1111/rssa.12084","Project: Selecci칩n de factores en la gesti칩n del riesgo. Contribuciones al sector asegurador con especial atenci칩n a dependencia y longevidad"],"references":["299747936_Principios_de_Geriatria_y_Gerontologia","297658455_Bibliography_--_An_Annotated_Bibliography_on_Children_with_Disabilities","292852685_Is_the_World_Health_Organization_WHO_international_classification_of_functioning_disability_and_health_ICF_relevant_to_ergonomics","290254402_The_Public_Health_Dimensions_of_Disability","281506737_On_the_use_of_mixture_models_in_clustering_multivariate_frequency_data","280294982_Chapter_25_Visualizing_Categorical_Data_with_Related_Metric_Scaling","275742158_Multivariate_Analysis_Part_1_Distributions_Ordination_and_Inference","270349089_Nonlinear_Multivariate_Analysis","270236622_Methods_for_Statistical_Data_Analysis_of_Multivariate_Observations","269856421_Methods_for_Statistical_Data_Analysis_of_Multivariate_Data"]}