{"id":"254461499_V-lab_A_cloud-based_virtual_laboratory_platform_for_hands-on_networking_courses","abstract":"For computer-network education, hands-on laboratories are essential in addition to lectures. Existing laboratory solutions are usually expensive to build, configure and maintain, while still lacking reusability, flexibility and scalability. This paper presents a cloud-based virtual laboratory education solution, called V-Lab, where instructors can use an interactive web GUI to configure computer network testbeds based on a set of dedicated virtual computers interconnected through VLAN-based virtual networks. The established virtual network system can be accessed by students via remote access using standard Secure Shell (SSH), Virtual Network Computing (VNC), or Remote Desktop Protocol (RDP). By using a flexible and re-configurable design, V-Lab greatly reduces the effort needed to establish and maintain a physical laboratory, while providing a secure and reliable environment that encourages students to use the resources based on their own schedule. V-Lab also helps re-design laboratory curriculum to focus on six educational factors, and the survey results show that V-Lab system is easy to use and setup and has satisfactory performance and reliability. It is also indicated that V-Lab helps students understand and solve real-world problems with sufficient laboratory resources and improved efficiency.","authors":["Le Xu","Dijiang Huang","Wei-Tek Tsai"],"meta":["July 2012","DOI:10.1145/2325296.2325357"],"references":["234782019_Network_security_development_process_a_framework_for_teaching_network_security_courses","228427410_The_Zen_Art_of_Teaching-Communication_and_Interactions_in_eEducation","224243207_Secure_data_processing_framework_for_mobile_cloud_computing","221260448_V-NetLab_An_Approach_for_Realizing_Logically_Isolated_Networks_for_Security_Experiments","234777318_VLabNet_the_integrated_design_of_hands-on_learning_in_information_security_and_networking","224563130_NCSU's_Virtual_Computing_Lab_A_Cloud_Computing_Solution","220094481_SEED_A_Suite_of_Instructional_Laboratories_for_Computer_Security_Education"]}