{"id":"254639513_Network_Sampling_via_Edge-based_Node_Selection_with_Graph_Induction","abstract":"In order to efficiently study the characteristics of network domains and support development of network systems (e.g. algorithms, protocols that operate on networks), it is often necessary to sample a representative subgraph from a large complex network. While prior research has shown that topological (e.g. random-walk based) sampling methods produce more accurate samples than approaches based on node or edge sampling, they still do not produce samples that closely match the distributions of graph properties (e.g., degree) found in the original graph. In this paper, we observe that part of the problem is that any sampling process fundamentally biases the structure of the sampled subgraph, since all neighbors of a sample node may not be included in the sampled subgraph. We address this problem using a novel sampling algorithm called TIES that (1) aims to offset this bias by using edge-based node selection, which favors selection of high-degree nodes, and (2) uses a graph induction step to select additional edges between sampled nodes to restore connectivity and bring the structure closer to that of the original graph. To understand the properties of TIES we compare it analytically to random node and edge sampling. We also evaluate the efficacy of TIES empirically using several real-world data sets. Across all datasets, we found that TIES produces samples that better match the original distributions. In terms of two distributional distance metrics, KS distance and skew divergence, we found that samples produced by TIES consistently outperform other sampling algorithms—with up to 2 × reduction in KS distance and up to 3-7 × reduction in skew divergence, compared to the current state-ofthe-art algorithms.","authors":["Nesreen Ahmed","Jennifer Neville","Ramana Kompella"],"meta":["January 2011","Project: Network Sampling"],"references":["240430944_Worldwide_Buzz_Planetary-Scale_Views_on_an_Instant-Messaging_Network","224137028_Walking_in_Facebook_A_Case_Study_of_Unbiased_Sampling_of_OSNs","281748678_Sampling_from_large_graphs","243772974_Authoritative_Sources_in_a_Hyperlinked_Environment","243601131_On_the_Eectiveness_of_the_Skew_Divergence_for_Statistical_Language_Analysis","237912898_Authoritative_sources_in_a_hyperlinked_environment","224384171_Metropolis_Algorithms_for_Representative_Subgraph_Sampling","222429961_Exploring_networks_with_traceroute-like_probes_Theory_and_simulations","221996591_The_PageRank_Citation_Ranking_Bringing_Order_to_the_Web","221653778_Microscopic_evolution_of_social_networks"]}