{"id":"254637828_STEM_Integration_Teacher_Perceptions_and_Practice","abstract":"To gain a better understanding of teachers’ beliefs about, perceptions of, and classroom practices using STEM integration, a multi-casecase study was conducted with three middle school teachers. These teachers were purposefully selected from a pool of teachers involvedin a year-long professional development module on STEM integration to represent science, mathematics and engineering teachers. Thisstudy addresses the following research questions: (1) What are teachers’ beliefs about and perceptions of STEM integration after a yearlongteacher professional development training? and (2) What is the connection between beliefs about and perceptions of STEMintegration and teachers’ classroom practices? Data collection consisted of document analysis, classroom observations, and interviews.Data were analyzed using the constant comparative method. Findings from the case studies suggest that (1) the problem solving process isa key component to integrate STEM disciplines, (2) teachers in different STEM disciplines have different perceptions about STEMintegration and that leads to different classroom practices, (3) technology is the hardest discipline to integrate in these cases, and (4)teachers are aware of the need to add more content knowledge in their STEM integration.","authors":["Hui-Hui Wang","Tamara J. Moore","Gillian Roehrig","Mi Sun Park"],"meta":["January 2011"],"references":["313390246_Basics_of_qualitative_research_Grounded_theory_procedures_and_techniques","308305763_A_Model_for_the_Integration_of_Science_Technology_Engineering_and_Mathematics","281495658_Integrated_interdisciplinary_or_thematic_instruction_Is_this_a_question_or_is_it_questionable_semantics","270195804_Sociological_Work_Method_and_Substance","260884931_A_Novel_Strategy_for_Assessing_the_Effects_of_Curriculum_Reform_on_Student_Competence","249860995_Learning_Engineering_Design_Languages_and_Experiences","249120900_Authentic_Pedagogy_and_Student_Performance","247565669_Sociological_Work_Method_and_Substance","245825433_Curriculum_integration_and_the_disciplines_of_knowledge","245581479_Basics_Of_Qualitative_Research_Grounded_Theory_Procedures_And_Techniques"]}