{"id":"254898221_The_Dawn_of_a_Critical_Transparency_Right_for_the_Profiling_Era","abstract":"Potential consumers are increasingly profiled to detect their habits and preferences in order to provide for targeted services. Both industry and the European Commission are investing huge sums of money into what they call Ambient Intelligence and the creation of an 'Internet of Things'. Such intelligent networked environments will depend on real time monitoring and profiling,resulting in real time adaptations of the environment. In this contribution Mireille Hildebrandt will assess the threats and opportunities of such autonomic profiling interms of its impact on individual autonomy and refined discrimination and indicatethe extent to which traditional data protection is ineffective as regards profiling.She will then highlight the potential of the draft General Data Protection Regulation to provide a more adequate and effective level playing field for boththe industry and individual citizens in the profiling era. The most revolutionary change she detects is not the right to be forgotten or the right to data portability butthe right to be informed about the potential consequences of being profiled.","authors":["Mireille Hildebrandt"],"meta":["June 2012","DOI:10.3233/978-1-61499-057-4-41"],"references":["334006211_Profiles_Probabilities_and_Stereotypes","329654013_Profiling_Machines_Mapping_the_Personal_Information_Economy","324352933_The_Ecological_Approach_to_Visual_Perception","313403304_The_Right_to_be_Forgotten","298607101_Beyond_Lessig's_code_for_Internet_privacy_Cyberspace_filters_privacy_control_and_fair_information_practices","292927070_The_role_of_phenomenological_reports_in_experiments_on_consciousness","273947523_Technology_and_the_Lifeworld_From_Garden_to_Earth","272721982_Seeing_Like_a_State_How_Certain_Schemes_to_Improve_the_Human_Condition_Have_Failed","268201693_The_Discipline_of_Machine_Learning","264863870_The_Mood_of_Information_a_Critique_of_Online_Behavioural_Advertising"]}