{"id":"254968035_Is_It_Real_or_Is_It_Motion_Capture_The_Battle_to_Redefine_Animation_in_the_Age_of_Digital_Performance","abstract":"In lieu of an abstract, here is a brief excerpt of the content:\n\nThe most intriguing scene in Ratatouille (Brad\nBird, 2007) occurs after the movie is over. At the very bottom of\nthe end credits, following the usual Pixar-perfect lists of loop\ngroups and Production Babies, comes an unexpected disclaimer. \"Our\nQuality Assurance Guarantee,\" it reads, \"100% Genuine Animation! No\nmotion capture or any other performance shortcuts were used in the\nproduction of this film.\" Next to the statement stands a winking\ncaricature of a 1950s businessman giving the audience a thumbs-up\nfor supporting such an apparently worthy endeavor.\nIt is, without a doubt, an odd way to postscript a film, but\nRatatouille's swipe at motion capture is also\nindicative of a larger dispute over the use of modern technology\nwithin the pantheon of animation techniques. The debate has been\nquietly raging for over a decade, even as the technology itself\nbecomes more powerful, more convincing, and more widespread. The\npast two years, however, have seen several moves to end the debate,\nwith various disciplines attempting to categorize motion\ncapture—often to contradictory extremes. Rules have been written\nand opinions have been proffered from film practitioners,\ncorporations, unions, and even award shows reflecting numerous\nagendas and points of view. Clearly, the question of how to view\nmotion capture is an important one, as it illustrates the\ndifficulties of defining different forms of film in the digital\nage.\nMotion capture occupies a unique and disputed place among film\ntechnologies. By capturing live movement as raw computer data, it\nexists as an unprecedented amalgam of both recorded and synthetic\ncinema. As such, motion capture is at the center of an ongoing\ndebate about what constitutes animation in the digital age. Whereas\nit was once compared almost exclusively to animation and to\ntechniques such as rotoscoping in particular, the medium has\nevolved into its own particular mode of expression. This has\nspurred an industry-wide race to redefine motion capture in which\ndifferent factions of filmmakers—everyone from actors to visual\neffects artists, studios to labor unions—have attempted to claim\nthe technology as their own. This essay examines how various groups\nwithin Hollywood have sought to control the conversation about\nmotion capture as well as efforts by a prominent umbrella\norganization—the Academy of Motion Picture Arts and Sciences—to end\nthe debate by scrutinizing its own definitions of animation.\nPrevious essays on motion capture have largely dealt with the\ntheoretical problems it presents: issues of reality versus\nrepresentation, media confluence, and the \"uncanny valley\" of\nphotorealism. Many of these same topics are being discussed within\nthe film industry, only with the much more concrete goal of\nassigning creative and financial credit (or blame) for motion\ncapture's successes (or failures). The major players\ninvolved—institutions including the Screen Actors Guild and the\nWalt Disney Company— recognize that the current debates over motion\ncapture will have long-range professional ramifications.\nFurthermore, motion capture is an expensive technology, one that\nrequires sizable investments of both funds and physical space.\nHollywood's internal debate, therefore, is perhaps even more\nimportant than its academic counterpart, since industrial forces\nmay ultimately decide whether motion capture will be canonized as\nanimation, live action, or visual effect. Yet all these debates\ndistract from another possibility, one advanced primarily by\ndirector/producer Robert Zemeckis: that motion capture represents a\nwholly new form of filmmaking, one that cannot and should not be\nlimited by our previously held definitions of synthetic versus\nrecorded cinema. For Zemeckis, categorizing motion capture is by\nitself problematic and would potentially stifle a new art form in\nits infancy.\n\nClick for larger view\n\nFigure 1. \nRatatouille takes a stand against motion capture\nduring its end credits (Disney/Pixar, 2007).\n\nPart 1: Animated Origins and Academy Rules\nIn addition to its end-credit caveat, the entirety of\nRatatouille can be read as an extended critique of\nmotion capture. The plot focuses on Remy, a rat who realizes his\nlifelong dream of becoming a French chef by using a surrogate human\nto cook meals for him. Safely hidden beneath a chef 's hat, Remy\ncontrols the human's actions by pulling his hair. The human, named\nLinguini, achieves local fame and professional success, all of\nwhich is...","authors":["Yacov Freedman"],"meta":["January 2012The Velvet Light Trap 69(1):38-49","DOI:10.1353/vlt.2012.0001"],"references":["290485704_Cadaver_of_the_real_Animation_rotoscoping_and_the_politics_of_the_body","263567069_From_Synthespian_to_Avatar_Re-framing_the_Digital_Human_in_Final_Fantasy_and_The_Polar_Express"]}