{"id":"255661802_SDI_Effectiveness_from_the_User_Perspective","abstract":"Definitions of spatial data infrastructure (SDI), and claims about its value, emphasise applications that solve real societal issues as the ultimate benefit. While it may be premature to expect that those benefits show up in many SDIs (if in any, by now), preparing for systematic evaluation is timely. Initiatives like the Spatial Data Interest Community on Monitoring and Reporting, in conjunction with the implementation of the Infrastructure for Spatial Information in Europe (INSPIRE) and the project Multi-view Framework to Assess National Spatial Data Infrastructures (NSDIs) funded by the Dutch innovation program Space for Geo-Information, are contributing to this goal. Drawing mainly from the information systems literature, we discuss possible measures of SDI effectiveness and present empirical results of a national survey of inter-organisational geographic information systems (GIS) in the United States. We model the measures of GIS effectiveness and other user-based perceptions of benefits against factors that tell us about possible determinants of inter-organisational GIS success that are potentially applicable to SDIs as well. Understanding the significance of those factors could help us move towards more useful and effective SDIs.","authors":["Zorica Nedovic-Budic","Jeffrey K. Pinto","Nama Budhathoki"],"meta":["January 2008"],"references":["311886855_The_Rainbow_Metaphor_Spatial_Data_Infrastructure_Organization_and_Implementation_in_India","340320292_H_Rohracher_ed_User_Involvement_in_Innovation_Processes_Strategies_and_Limitations_from_a_Socio-Technical_Perspective","329321305_The_Future_of_the_Spatial_Information_Infrastructure","326432347_The_Rainbow_Metaphor_Spatial_Data_Infrastructure_Organization_and_Implementation_in_India","324368812_Improving_Productivity_and_Effectiveness","316875073_Mail_and_Telephone_Surveys_The_Total_Design_Method","312984568_Perceived_usefulness_perceived_ease_and_user_acceptance_of_information_technology","307855529_Geospatial_data_infrastructure--concepts_cases_and_good_practice","304183784_Spatial_Data_Infrastructures","292933334_White_knights_of_spatial_data_infrastructure_The_role_and_motivation_of_key_individuals"]}