{"id":"255666955_Evaluating_the_levels_of_problem_solving_abilities_in_mathematics","abstract":"Currently, there is a general agreement among mathematics educators that students need to acquire problem solving skill, learn to communicate using mathematical knowledge and skills, develop mathematical thinking and reasoning, to see the interconnectedness between mathematics and other disciplines. Based on this perspective, this research looked into the levels of problem solving ability amongst selected Malaysian secondary school students. A sample of 242 Form Four science and non-science students from four schools in an urban district participated in this research. The respondents were asked to solve several mathematical problems. The students' level of abilities in using basic knowledge, standard procedures and problem solving skills were evaluated from their written responses. The evaluation was done based on Polya's problem solving model. Data were gathered through questionnaires and interviews. These data indicated that students have limited exposure to problem solving instruction. Research findings also showed that students have fairly good command of basic knowledge and skills, but did not show the use of problem solving strategies as expected. Generally, these students have a low command on problem solving skills. Most of the students were unable to use correct and suitable mathematical symbols and vocabulary in providing reasons and explanations for certain problem-solving procedures. It is hope that these findings will serve as a reference for educators in improving the learning and teaching of mathematics in general and problem solving instruction in particular. Background There is currently a general agreement among mathematics educators that students need learn and often, different mathematics. They stress the importance of students being actively involved in their learning. That is they should \"construct, modify and integrate ideas by interacting with the physical world, materials and other children\" (Romberg, 1992). Given this background, we argue that the mathematics curriculum should at least include, among others, the opportunities for students to solve problems, learn to communicate using mathematics ideas and symbols, acquire mathematical reasoning, see the connectedness of mathematics {National Council for the Teachers of Mathematics (NCTM), 1989}. Through these, students need to acquire new skills in various relevant mathematical topics (NCTM, 1989). The research reported here is part of a bigger study that attempts to look at sudents' levels of understanding in several selected topics as related to the four strands mentioned above. The research group realized that this would require a tremendous amount of effort and time. As an initial step, we decided to look into the levels of understanding in problem solving skills, which in Malaysia, are important components of both the primary and the secondary mathematics curriculum (Kementerian Pendidikan, 1989). Further, the emphasis of problem skills in the learning and teaching of mathematics is well documented. This will further followed by studies that will attempt to look at the other three strands. \"Problem\" in mathematics has been interpreted in various ways by mathematics educators. There is a general agreement, however, that mathematical problems refers to a situation that requires one to make decisions. The individual does not have an immediately clear or a spontaneous solution to the problem at hand (Polya, 1945; Krulik & Rudnick, 1980; Newell & Simon, 1972; Bur ns 1992). Problem solving is a process of achieving a solution goal (Polya, 1981). In his book, How To solve it, Polya (1945) describes the processes involved, in terms of the heuristics, in problem solving. The four processes involved are understanding of the problem, planning the solution, carrying out the solution and looking back. In this study, the Polya's model of problem solving, modified to suit the research questions generated, is used as a guideline in determining the students' levels of problem solving abilities (see Appendix 2).","authors":["NOOR AZLAN AHMAD"],"meta":[],"references":[]}