{"id":"255787270_Smart_business_networks_and_business_genetics_with_a_high_tech_communications_supplier_selection_industry_case","abstract":"Despite the emergence of event driven business process management, smart business networks, social networks, etc. as important research areas in management, for all the attractiveness of these concepts, two major challenges remain around their design and the partner selection rules while learning from interaction events.While smart business networks should provide advantages due to the quick connect of business partners for selected functions in a process common to several parties, literature does not provide constructive methods\nwhereby the selection of temporary partners and functions can be done. Most discussions only rely solely on human judgment. This paper introduces both computational geometry, and genetic programming, as systematic methods whereby to identify, characterize, and then display on a continuing basis from event\nmonitoring such possible partnerships; such techniques also allow to plan for their effect on the organizations and thus to carry out selection. The two methods are being put in the context of emergence theory. Tessellations address the identification and categorization issues; business maps address the display and monitoring challenge with the use of Voronoii diagrams. Cellular automata mimicking living bodies, with genetic algorithms of which parameters are estimated by learning, address the selection and effect issues. To illustrate the approach, some experimental results from the sourcing function in a high tech industry, are discussed; they address the case of how to determine the selection process for a systems integrator to set up joint ventures with smaller technology suppliers.","authors":["Louis-Francois Pau"],"meta":["January 2008","SourcearXiv","In book: Smart business networks: a new business paradygm (pp.218-240)Chapter: 15Publisher: ERIM"],"references":["345890555_Hidden_Assets_Harnessing_the_Power_of_Informal_Networks","319395212_Cultivating_of_Communities_of_Practice","290999172_The_agile_enterprise_Reinventing_your_organization_for_success_in_an_on_demand_world","289782372_Emergence_of_collecttve_behavior_in_large_chaotic_dynamical_systems","287569604_Super-Flexibility_for_Knowledge_Enterprises","284578471_Business_Process_Management","249080356_On_Some_Patterns_of_Reduction","243597864_The_Social_Psychology_Organizing","243243724_From_collective_oscillations_to_collective_chaos_in_a_globally_coupled_oscillator_system","242531750_Virtual_Communities_are_Communities_Net_Surfers_Don''t_Ride_Alone"]}