{"id":"255794833_Harnessing_Folksonomies_to_Produce_a_Social_Classification_of_Resources","abstract":"In our daily lives, organizing resources like books or webpages into a set of categories to ease future access is a common task. The usual largeness of these collections requires a vast endeavor and an outrageous expense to organize manually. As an approach to effectively produce an automated classification of resources, we consider the immense amounts of annotations provided by users on social tagging systems in the form of bookmarks. In this paper, we deal with the utilization of these user-provided tags to perform a social classification of resources. For this purpose, we have created three large-scale social tagging data sets including tagging data for different types of resources, webpages and books. Those resources are accompanied by categorization data from sound expert-driven taxonomies. We analyze the characteristics of the three social tagging systems and perform an analysis on the usefulness of social tags to perform a social classification of resources that resembles the classification by experts as much as possible. We analyze six different representations using tags and compare to other data sources by using three different settings of SVM classifiers. Finally, we explore combinations of different data sources with tags using classifier committees to best classify the resources.","authors":["Arkaitz Zubiaga","Víctor Fresno Fernández","Raquel Martínez-Unanue","Alberto Pérez García-Plaza"],"meta":["August 2013IEEE Transactions on Knowledge and Data Engineering 25(8):1801-1813","DOI:10.1109/TKDE.2012.115"],"references":["235357340_Empirical_Analysis_of_Predictive_Algorithm_for_Collaborative_Filtering","232647157_Link_Creation_and_Profile_Alignment_in_the_aNobii_Social_Network","316691744_Distributional_Structure","285278428_Text_Categorization_with_Support_Vector_Machines_Learning_with_Many_Relevant_Features","284772341_Pairwise_classification_and_support_vector_machines","277430990_Web_page_classification","261145970_Web_Page_Classification_Using_Social_Tags","242637644_An_Algorithm_for_Suffix_Stripping","239597642_Papers_in_structural_and_transformational_linguistics","232622380_Ranking_and_Suggesting_Popular_Items_HTML","224401943_A_Unified_Framework_for_Providing_Recommendations_in_Social_Tagging_Systems_Based_on_Ternary_Semantic_Analysis","232591129_Distributional_Structure","230876652_Pairwise_Classification_and_Support_Vector_Machines","224374471_Ranking_and_Suggesting_Popular_Items","224212606_Optimizing_Academic_Conference_Classification_Using_Social_Tags"]}