{"id":"255702830_Understanding_the_importance_of_organizational_resources_to_reduce_organizational_problems_Evidence_from_nonprofit_sport_clubs_in_Germany","abstract":"Nonprofit sport clubs experience organizational problems regarding the recruitment and retention of members, volunteers, and coaches, and the financial situation of the club. The purpose of this study is to investigate the impact of different types of organizational resources on the severity of organizational prob- lems. A theoretical framework based on the concept of organizational capacity is presented, which explains the influence of human, financial, infrastructure, and cultural resources on organizational problems. The empirical evaluation is undertaken using data from a nationwide online survey of nonprofit sport clubs in Germany (n = 19,345). The regression results show that human resources (women on the board, secondary volunteers, etc.), financial resources (Herfindahl index), infrastructure resources (own facilities, and public facilities), and cultural resources (e.g., strategic policy, formation policy, value of conviviality, and variety of sports) are significant determinants of organizational problems. The findings of this study have implications for the management of voluntary sport organizations.","authors":["Pamela Wicker","Christoph Breuer"],"meta":["January 2012International Journal of Voluntary and Nonprofit Organizations 17(2):461-484","Project: Economics and sociology of non-profit sports clubs"],"references":["287456018_A_System_Resource_Approach_to_Organizational_Effectiveness","350682693_Multiple_Regression_and_Beyond","324995251_Board_Power_and_Organizational_Effectiveness_Among_Human_Service_Agencies","312387719_The_Strategic_Analysis_of_Intangible_Resources","303057645_The_resource-based_view_of_the_firm_Ten_years_after","292295549_Resource_composition_and_oligarchization_Evidence_from_german_sport_clubs","292294361_The_Politics_of_Sport_Clubs_Positioning_Your_Program_in_an_Era_of_Dwindling_Resources","288184917_Multidimensionality_and_Multiple_Perspectives_of_Organizational_Effectiveness","285875586_Firm_Resources_and_Sustained_Competitive_Advantage","284041695_Self-Report_in_Organisational_Research_Problems_and_Prospects"]}