{"id":"255966550_Embedding_signed_graphs_in_the_line","abstract":"Signed graphs are graphs with an assignment of a positive or a negative sign to each edge. These graphs are helpful to represent different types of networks. For instance, they have been used in social networks, where a positive sign in an edge represents friendship between the two endpoints of that edge, while a negative sign represents enmity. Given a signed graph, an important question is how to embed such a graph in a metric space so that in the embedding every vertex is closer to its positive neighbors than to its negative ones. This problem is known as Sitting Arrangement (SA) problem and it was introduced by Kermarrec et al. (Proceedings of the 36th International Symposium on Mathematical Foundations of Computer Science (MFCS), pp. 388–399, 2011). Cygan et al. (Proceedings of the 37th International Symposium on Mathematical Foundations of Computer Science (MFCS), 2012) proved that the decision version of SA problem is NP-Complete when the signed graph has to be embedded into the Euclidean line. In this work, we study the minimization version of SA (MinSA) problem in the Euclidean line. We relate MinSA problem to the well known quadratic assignment (QA) problem. We establish such a relation by proving that local minimums in MinSA problem are equivalent to local minimums in a particular case of QA problem. In this document, we design two heuristics based on the combinatorial structure of MinSA problem. We experimentally compare their performances against heuristics designed for QA problem. This comparison favors the proposed heuristics.","authors":["Eduardo G. Pardo","Mauricio Soto","Christopher Thraves"],"meta":["February 2013Journal of Combinatorial Optimization 29(2):1-21","DOI:10.1007/s10878-013-9604-1"],"references":["225237245_Greedy_Randomized_Adaptive_Search_Procedures","285899345_On_the_notion_of_balance_of_signed_graph","284382099_P-complete_approximation_problem","270371741_The_Quadratic_Assignment_Problem-Theory_and_Algorithms","268309953_The_Quadratic_Assignment_Problem_Theory_and_Algorithms","263241993_Correlation_Clustering_Theoretical_Advances_in_Data_Clustering_Guest_Editors_Nina_Mishra_and_Rajeev_Motwani","238677883_A_Greedy_Randomized_Adaptive_Search_Procedure_for_Maximum_Independent_Set","232477307_Clustering_and_Structural_Balance_in_Graphs","228712159_A_survey_of_meta-heuristic_solution_methods_for_the_quadratic_assignment_problem","227289995_Recent_Advances_for_the_Quadratic_Assignment_Problem_with_Special_Emphasis_on_Instances_that_are_Difficult_for_Meta-Heuristic_Methods"]}