{"id":"256005803_Computer_Programming_Goes_Back_to_School","abstract":"We are witnessing a remarkable comeback of programming. Current initiatives to promote computational thinking and to broaden participation in computing signal a renewed interest to bring programming back into K-12 schools and help develop children as producers and not simply consumers of digital media. This essay explores the re-emergence of programming in K-12 schools, addressing three questions in particular: First, what is the role of programming in facilitating children’s learning with digital media? Second, how can schools play a more prominent role in supporting such coded production as a veritable new literacy for the 21st century? Third, what are some of the systemic equity issues of access and participation that will need to be addressed? Given these questions facing schools as well as the wider economic viability of this country, it is crucial that we understand the importance of programming as a means to process and communicate information, how it relates to developing minds through computational thinking, and why computational participation as an extension of such thinking represents our best chance to teach programming in schools.","authors":["Yasmin B. Kafai","Quinn Burke"],"meta":["September 2013Phi Delta Kappan 95(1):61-65","DOI:10.1177/003172171309500111"],"references":["305427044_Youth_Technology_and_DIY_Developing_Participatory_Competencies_in_Creative_Media_Production","274309848_Computational_Thinking","258134758_The_Common_Core_State_Standards'_Quantitative_Text_Complexity_Trajectory_Figuring_Out_How_Much_Complexity_Is_Enough","258134754_Computational_Thinking_in_K-12_A_Review_of_the_State_of_the_Field","261900429_New_Technology_and_Digital_Worlds_Analyzing_Evidence_of_Equity_in_Access_Use_and_Outcomes","255618740_Confronting_the_Challenges_of_Participatory_Culture_Media_Education_for_the_21st_Century","250185477_New_Technology_and_Digital_Worlds_Analyzing_Evidence_of_Equity_in_Access_Use_and_Outcomes","227711444_The_second_educational_revolution_Rethinking_education_in_the_age_of_technology"]}