{"id":"256023863_A_Healthy_Way_to_Handle_Work_Place_Stress_Through_Yoga_Meditation_and_Soothing_Humor","abstract":"The productivity of the work force is the most decisive factor as far as the success of an organization is concerned. The productivity in turn is dependent on the psychosocial well being of the employees. Stress can affect one‘s health, work performance, social life and the relationship with family members. The stress response is a complex emotion that produces physiological changes to prepare us for - fight or flight - to defend ourselves from the threat or flee from it. The stressors and its consequences are to be understood at individual and organizational level. Stress in the workplace has emerged as a major issue for businesses and has reached alarming proportions. Organizations must develop stress prevention as well as stress reduction techniques. This research focuses on practices adopted by organizations to prevent, minimize and to overcome the stress. The study aims at understanding use of yoga, meditation and soothing humor by different organizations as an antidote to workplace stress.","authors":["Revati Chandrashekhar Deshpande"],"meta":["May 2012Agris On-line Papers in Economics and Informatics 2(4)","DOI:10.6088/ijes.002020300100"],"references":["249929423_Humor_Coping_with_Stress_Self-Concept_and_Psychological_Well-Being","313199798_Effect_of_yogic_practices_on_depression_and_anxiety","309311390_The_relation_of_strength_of_stimulus_to_rapidity_of_habit-formation","305355195_Yoga_as_a_Preventative_and_Treatment_for_Depression_Anxiety_and_Stress","304757545_Mindfulness-based_stress_reduction_and_health-related_quality_of_life_in_a_heterogeneous_patient_population","241007499_Corporate_Yoga_and_Its_Implications","232502427_Stress_and_coping_The_Indian_experience_2nd_ed","26426199_Burnout","26416015_Occupational_Stress_and_Job_Satisfaction_among_Managers","20830516_Benefits_of_Humor_in_Reduction_of_Threat-Induced_Anxiety","8153100_The_role_of_psychiatry_in_medicine"]}