{"id":"256040275_Minimizing_Global_Catastrophic_and_Existential_Risks_from_Emerging_Technologies_Through_International_Law","abstract":"Mankind is rapidly developing \"emerging technologies\" in the fields of bioengineering, nanotechnology, and artificial intelligence with the hope that they will solve some of the world's biggest problems -- climate chance, disease, pollution, resource shortages, and even human death. However, emerging technologies can also be dangerous, posing low-probability risks that they will result in serious, global damage to humans (called \"global catastrophic risks\") or even human extinction (called \"existential risks\"). This Article argues that bioengineering already presents a global catastrophic or existential risk, like from the ability of scientists to engineer an extremely deadly virus, while nanotechnology and artificial intelligence will likely present global catastrophic or existential risks in the near future, such as through the development of nanotechnology super weapons or through misuse of artificial greater-than-human intelligence. Emerging technologies should be regulated at the international level because global catastrophic risks and existential risks have a global effect, so a failure to regulate dangerous emerging technologies in one country might be hugely detrimental to the entire world. However, current international instruments only regulate bioengineering to a small extent and nanotechnology and artificial intelligence essentially not at all. Dangerous bioengineered organisms in specific—the most immediately threatening of the emerging technologies discussed in this article—indeed fall within treaties like the Convention on Biological Diversity, the Cartagena Protocol on Biosafety, and the Biological Weapons Convention, but these international instruments either only regulate limited aspects of bioengineering or have huge exceptions that limit their effectiveness, not to mention that the United States is not a party to any of them. After establishing that international law is insufficient to protect mankind from dangerous emerging technologies, this Article lays out a series of specific recommendations for an an international treaty on emerging technologies that uses mechanisms such as the precautionary principle, a body of experts, laboratory regulations, oversight of scientific publications, a review mechanism for noncompliance, and public participation in decisionmaking.Non-Technical Summary:Short Summary\"Emerging technologies\" like bioengineering, nanotechnology, and artificial intelligence are rapidly developing. While emerging technologies could remedy some of the world's largest problems -- climate change, diseases, hunger, and so forth -- they also pose a small risk of causing global catastrophes or even wiping out the entire human population. Despite these high stakes, existing treaties do not sufficiently regulate emerging technologies, so this paper recommends a potential treaty that would provide adequate safeguards. Long SummaryMankind is rapidly developing “emerging technologies” in the fields of bioengineering, nanotechnology, and artificial intelligence that have the potential to solve humanity’s biggest problems, such as by curing all disease, extending human life, or mitigating massive environmental problems like climate change. However, if these emerging technologies are misused or have an unintended negative effect, the consequences could be enormous, potentially resulting in serious, global damage to humans (known as “global catastrophic harm”) or severe, permanent damage to the Earth—including, possibly, human extinction (known as “existential harm”). The chances of a global catastrophic risk or existential risk actually materializing are relatively low, but mankind should be careful when a losing gamble means massive human death and irreversible harm to our planet. While international law has become an important source of global regulation for other global risks like climate change and biodiversity loss, emerging technologies do not fall neatly within existing international regimes, and thus any country is more or less free to develop these potentially dangerous technologies without practical safeguards that would curtail the risk of a catastrophic event. In light of these problems, this paper serves to discuss the risks associated with bioengineering, nanotechnology, and artificial intelligence; review the potential of existing international law to regulate these emerging technologies; and propose an international regulatory regime that would put the international world in charge of ensuring that low-probability, high-risk disasters never materialize.","authors":["Grant S. Wilson"],"meta":["November 2012"],"references":[]}