{"id":"256199465_Crowdsourcing_a_Word-Emotion_Association_Lexicon","abstract":"Even though considerable attention has been given to the polarity of words\n(positive and negative) and the creation of large polarity lexicons, research\nin emotion analysis has had to rely on limited and small emotion lexicons. In\nthis paper we show how the combined strength and wisdom of the crowds can be\nused to generate a large, high-quality, word-emotion and word-polarity\nassociation lexicon quickly and inexpensively. We enumerate the challenges in\nemotion annotation in a crowdsourcing scenario and propose solutions to address\nthem. Most notably, in addition to questions about emotions associated with\nterms, we show how the inclusion of a word choice question can discourage\nmalicious data entry, help identify instances where the annotator may not be\nfamiliar with the target term (allowing us to reject such annotations), and\nhelp obtain annotations at sense level (rather than at word level). We\nconducted experiments on how to formulate the emotion-annotation questions, and\nshow that asking if a term is associated with an emotion leads to markedly\nhigher inter-annotator agreement than that obtained by asking if a term evokes\nan emotion.","authors":["Saif M. Mohammad","Peter David Turney"],"meta":["August 2013Computational Intelligence 29(3)","DOI:10.1111/j.1467-8640.2012.00460.x","SourcearXiv"],"references":["316459840_Clustering_semantic_spaces_of_suicide_notes_and_newsgroups_articles","285722198_An_Attributional_Theory_of_Achievement_Motivation_and_Emotion","284481048_Word_of_mouth_communication_as_negative_information","342183905_A_Coefficient_of_Agreement_for_Nominal_Scales","316459839_Using_natural_language_processing_to_classify_suicide_notes","313640274_The_cognition-emotion_debate_A_bit_of_history","304078482_Affect_analysis_of_text_using_fuzzy_semantic_typing","285812344_How_do_they_know_Their_customers_so_well","284740464_Emotion_Theory_search_and_experience","284092251_The_antecedents_of_brand_switching_brand_loyalty_and_verbal_responses_to_service_failure"]}