{"id":"256133608_Large-Scale_Bisimulation_of_RDF_Graphs","abstract":"RDF datasets with billions of triples are no longer unusual and continue to grow constantly (e.g. LOD cloud) driven by the inherent flexibility of RDF that allows to represent very diverse datasets, ranging from highly structured to un-structured data. Because of their size, understanding and processing RDF graphs is often a difficult task and methods to reduce the size while keeping as much of its structural in-formation become attractive. In this paper we study bisimu-lation as a means to reduce the size of RDF graphs according to structural equivalence. We study two bisimulation algo-rithms, one for sequential execution using SQL and one for distributed execution using MapReduce. We demonstrate that the MapReduce-based implementation scales linearly with the number of the RDF triples, allowing to compute the bisimulation of very large RDF graphs within a time which is by far not possible for the sequential version. Ex-periments based on synthetic benchmark data and real data (DBPedia) exhibit a reduction of more than 90% of the size of the RDF graph in terms of the number of nodes to the number of blocks in the resulting bisimulation partition.","authors":["Alexander Schätzle","Antony Neu","Georg Lausen","Martin Zablocki"],"meta":["June 2013","DOI:10.1145/2484712.2484713","Conference: Proc. of the Fifth Workshop on Semantic Web Information Management (SWIM 2013)","Project: Distributed Processing of Semantic Data (DiPoS)"],"references":["287631618_Similar_structures_inside_RDF-graphs","263589362_Similar_Structures_inside_RDF-Graphs","254006607_Query_preserving_graph_compression","233952465_SchemEX---Efficient_Construction_of_a_Data_Catalogue_by_stream-based_Indexing_of_Linked_Data","227190215_A_Distributed_Algorithm_for_Strong_Bisimulation_Reduction_of_State_Spaces","224400495_SP2Bench_A_SPARQL_performance_benchmark","273079556_KiWi_and_the_Linking_Open_Data_cloud","262426655_Bisimulation_Reduction_of_Big_Graphs_on_MapReduce","254006436_Efficient_External-Memory_Bisimulation_on_DAGs","223271545_CCS_expressions_finite_state_processes_and_three_problems_of_equivalence"]}