{"id":"256102925_Novel_Ergonomic_Postural_Assessment_Method_NERPA_Using_Product-Process_Computer_Aided_Engineering_for_Ergonomic_Workplace_Design","abstract":"Musculoskeletal disorders (MSDs) that result from poor ergonomic design are one of the occupational disorders of greatest concern in the industrial sector. A key advantage in the primary design phase is to focus on a method of assessment that detects and evaluates the potential risks experienced by the operative when faced with these types of physical injuries. The method of assessment will improve the process design identifying potential ergonomic improvements from various design alternatives or activities undertaken as part of the cycle of continuous improvement throughout the differing phases of the product life cycle.\nThis paper presents a novel postural assessment method (NERPA) fit for product-process design, which was developed with the help of a digital human model together with a 3D CAD tool, which is widely used in the aeronautic and automotive industries. The power of 3D visualization and the possibility of studying the actual assembly sequence in a virtual environment can allow the functional performance of the parts to be addressed. Such tools can also provide us with an ergonomic workstation design, together with a competitive advantage in the assembly process.\nThe method developed was used in the design of six production lines, studying 240 manual assembly operations and improving 21 of them. This study demonstrated the proposed method's usefulness and found statistically significant differences in the evaluations of the proposed method and the widely used Rapid Upper Limb Assessment (RULA) method.","authors":["Alberto Sanchez-Lite","Manuel Garcia","Rosario Domingo","Miguel A. Sebastián"],"meta":["August 2013PLoS ONE 8(8):e72703","DOI:10.1371/journal.pone.0072703","SourcePubMed","Project: Projects: Management, engineering and teaching"],"references":["251362724_The_development_of_competencies_in_manufacturing_engineering_by_means_of_a_deep-drawing_tool","285898083_Citation_classic_Use_of_ranks_in_one-criterion_variance_analysis","277706999_Handbook_of_Human_Factors_and_Ergonomics_Fourth_Edition","272070045_Simulation_and_Ergonomics_Approach_for_Service_Manufacturing_Process_Improvement","267241882_An_Evaluation_of_the_Utility_of_Three_Ergonomics_Checklists_for_Predicting_Health_Outcomes_in_a_Car_Manufacturing_Environment","257036102_Comparing_the_Results_of_Eight_Methods_Used_to_Evaluate_Risk_Factors_Associated_with_Musculoskeletal_Disorders","245095590_Ergonomic_performance_and_quality_relationship_An_empirical_evidence_case","245095203_Productivity_and_quality_improvements_revenue_increment_and_rejection_cost_reduction_in_the_manual_component_insertion_lines_through_the_application_of_ergonomics","243766442_Errata_Use_of_Ranks_in_One-Criterion_Variance_Analysis","240026850_Handbook_of_Human_Factors_and_Ergonomics"]}