{"id":"256117634_Reputation_and_Impact_in_Academic_Careers","abstract":"Reputation is an important social construct in science, enabling informed\nquality assessments of both publications and careers in the absence of complete\nsystemic information. However, the relation between reputation and career\ngrowth remains poorly understood, despite the rapid growth of quantitative\nmethods developed for research evaluation. We develop an original framework for\nmeasuring how citation paths are influenced by two distinct factors -- the\nscientific merit of each individual paper versus the reputation of its authors\nwithin the scientific community. To estimate their relative strength, we\nperform a longitudinal analysis of publication data for 450 leading scientists\nand find a citation crossover $c_{\\times}$ which distinguishes the strength of\nthe reputation effect. For papers with citations $c$ below $c_{\\times}$, the\nauthor reputation dominates the citation rate; if $c\\geq c_{\\times}$ then the\npaper quality dominates the citation rate. Hence, papers may gain a significant\nearly citation advantage if coauthored by authors already having high\nreputations in the scientific community. Concomitant to this reputation\nmechanism, we observe for top scientists a non-decreasing growth in both\npublications and citations, a pattern which reflects the amplifying role of\nsocial processes. As quantitative measures become increasingly common in the\nevaluation of scientific careers, we show that it is important to account for\nauthor reputation when estimating the intrinsic quality of research.\nFurthermore, our results also indicate a strong role played by reputation in\nthe mentor matching process within academic institutions, in the effectiveness\nof double blinding in peer-review, and in other generic reputation systems.","authors":["Alexander M. Petersen","Santo Fortunato","Raj Kumar Pan","Kimmo Kaski"],"meta":["October 2013Proceedings of the National Academy of Sciences","DOI:10.1073/pnas.1323111111","SourcearXiv"],"references":["301233136_Diffusion_of_scientific_credits_and_the_ranking_of_scientists","258314355_The_Retraction_Penalty_Evidence_from_the_Web_of_Science","258116439_On_the_Predictability_of_Future_Impact_in_Science","255579933_Commentary_The_case_for_caution_in_predicting_scientists'_future_impact","344486804_How_Economics_Shapes_Science","303854826_J_Social_capital_intellectual_capital_and_the_organizational_advantage","296913048_Readers_say_scientists_can_indeed_knock_on_heaven's_door","284474794_Peer_review_benefits_perception_and_alternatives","277815637_The_Matthew_effect_in_science","271805313_Productivity_Differences_Among_Scientists_Evidence_for_a_Cumulative_Advantage"]}