{"id":"256187680_Information_needs_and_information-seeking_behaviour_analysis_of_primary_care_physicians_and_nurses_A_literature_review","abstract":"The increase in the adoption of electronic health records (EHR) has contributed to physicians and nurses experiencing information overload. To address the problem of information overload, an assessment of the information needs of physicians and nurses will assist in understanding what they view as useful information to make patient care more efficient.\nTo analyse studies that assessed the information needs and information-seeking behaviour of physicians and nurses in a primary care setting to develop a better understanding of what information to present to physicians when they making clinical decisions.\nA literature review of studies was conducted with a comprehensive search in PubMed, cinahl, scopus, as well as examination of references from relevant papers and hand-searched articles to identify articles applicable to this review.\nOf the papers reviewed the most common information needs found among physicians and nurses were related to diagnoses, drug(s) and treatment/therapy. Colleagues remain a preferred information source among physicians and nurses; however, a rise in Internet usage is apparent.\nPhysicians and nurses need access to the Internet and job-specific resources to find practitioner-oriented information. In addition, effective usage of resources is important for improving patient care.","authors":["Martina A Clarke","Jeffery L Belden","Richelle J Koopman","Linsey Steege"],"meta":["September 2013Health Information & Libraries Journal 30(3):178-90","DOI:10.1111/hir.12036","SourcePubMed","Projects: Creating a More Readable Electronic Health Record (EHR) ModelLayered EHR"],"references":["321384468_Nurses_and_Computers_An_International_Perspective_on_Nurses'_Requirements","284481211_Usability_of_Electronic_Medical_Records","270960171_Human_Information_Behavior","258140625_Information_seeking_behaviour_of_physicians_in_Tanzania","250953519_Hamster_health_care_Time_to_stop_running_faster_and_redesign_health_care","297888420_A_study_of_clinical_questions_posed_by_hospital_clinicians","297471755_Use_of_information_sources_among_New_Zealand_family_physicians_with_high_access_to_computers","290553090_Meeting_the_information_needs_of_family_physicians_in_the_complex_world_of_cancer_control","284704568_Experiments_in_field_settings","277433230_Obstacles_to_answering_doctors'_questions_about_patient_care_with_evidence_qualitative_study"]}