{"id":"256190858_The_use_of_remote_presence_for_health_care_delivery_in_a_northern_Inuit_community_A_feasibility_study","abstract":"To evaluate the feasibility of remote presence for improving the health of residents in a remote northern Inuit community.\nA pilot study assessed patient's, nurse's and physician's satisfaction with and the use of the remote presence technology aiding delivery of health care to a remote community. A preliminary cost analysis of this technology was also performed.\nThis study deployed a remote presence RP-7 robot to the isolated Inuit community of Nain, Newfoundland and Labrador for 15 months. The RP-7 is wirelessly controlled by a laptop computer equipped with audiovisual capability and a joystick to maneuver the robot in real time to aid in the assessing and care of patients from a distant location. Qualitative data on physician's, patient's, caregiver's and staff's satisfaction were collected as well as information on its use and characteristics and the number of air transports required to the referral center and associated costs.\nA total of 252 remote presence sessions occurred during the study period, with 89% of the sessions involving direct patient assessment or monitoring. Air transport was required in only 40% of the cases that would have been otherwise transported normally. Patients and their caregivers, nurses and physicians all expressed a high level of satisfaction with the remote presence technology and deemed it beneficial for improved patient care, workloads and job satisfaction.\nThese results show the feasibility of deploying a remote presence robot in a distant northern community and a high degree of satisfaction with the technology. Remote presence in the Canadian North has potential for delivering a cost-effective health care solution to underserviced communities reducing the need for the transport of patients and caregivers to distant referral centers.","authors":["Ivar Mendez","Michael Jong","Debra Keays-White","Gail Turner"],"meta":["August 2013International Journal of Circumpolar Health 72","DOI:10.3402/ijch.v72i0.21112","SourcePubMed"],"references":["224978283_Current_and_Projected_Workforce_Requirements_for_Care_of_the_Critically_Ill_and_Patients_With_Pulmonary_Disease_Can_We_Meet_the_Requirements_of_an_Aging_Population","51980169_Adoption_of_telemedicine_From_pilot_stage_to_routine_delivery","51366099_Indigenous_health_in_the_Arctic_An_overview_of_the_circumpolar_Inuit_population","47644715_Health_care_in_the_North_What_Canada_can_learn_from_its_circumpolar_neighbours","271239025_Telemedicine","225375319_The_Status_of_Telestroke_in_the_United_States_A_Survey_of_Currently_Active_Stroke_Telemedicine_Programs","225301695_Telestroke_Ambulances_in_Prehospital_Stroke_Management_Concept_and_Pilot_Feasibility_Study","221826340_Robotic_remote_presence_technology_in_the_surgical_intensive_care_unit","51849354_Robotic_telepresence_A_helpful_adjunct_that_is_viewed_favorably_by_critically_ill_surgical_patients","51797082_Barriers_to_Telemedicine_Survey_of_Current_Users_in_Acute_Care_Units"]}