{"id":"256221965_How_Easy_Is_Local_Search","abstract":"We investigate the complexity of finding locally optimal solutions to NP-hard combinatorial optimization problems. Local optimality arises in the context of local search algorithms, which try to find improved solutions by considering perturbations of the current solution (“neighbors” of that solution). If no neighboring solution is better than the current solution, it is locally optimal. Finding locally optimal solutions is presumably easier than finding optimal solutions. Nevertheless, many popular local search algorithms are based on neighborhood structures for which locally optimal solutions are not known to be computable in polynomial time, either by using the local search algorithms themselves or by taking some indirect route. We define a natural class PLS consisting essentially of those local search problems for which local optimality can be verified in polynomial time, and show that there are complete problems for this class. In particular, finding a partition of a graph that is locally optimal with respect to the well-known Kernighan-Lin algorithm for graph partitioning is PLS-complete, and hence can be accomplished in polynomial time only if local optima can be found in polynomial time for all local search problems in PLS.","authors":["David S. Johnson","Christos H. Papadimitriou","Mihalis Yannakakis"],"meta":["August 1988Journal of Computer and System Sciences 37(1):79–100","DOI:10.1016/0022-0000(88)90046-3"],"references":["239553376_Some_Examples_of_Difficult_Traveling_Salesman_Problems","220695898_Combinatorial_Optimization_Algorithms_and_Complexity","6026283_Optimization_by_Simulated_Annealing","265316143_The_largest_subdeterminant_of_a_matrix","245314817_An_e_ective_heuristic_procedure_for_the_traveling_salesman_problem","234805553_The_monotone_and_planar_circuit_value_problems_are_log_space_complete_for_P","220695890_Computers_and_Intracdtability_A_Guide_to_the_Theory_of_NP-Completeness","220045421_Optimization_by_simulated_annealing","201976941_An_Efficient_Heuristic_Procedure_for_Partitioning_Graphs","201976935_An_Effective_Heuristic_Algorithm_for_the_TSP"]}