{"id":"256282309_Perspectives_on_Open_and_Distance_Learning_Open_Educational_Resources_Innovation_Research_and_Practice","abstract":"Open Educational Resources (OER) – that is, teaching, learning and research materials that their owners make free to others to use, revise and share – offer a powerful means of expanding the reach and effectiveness of worldwide education. Those resources can be full courses, course materials, modules, textbooks, streaming videos, software, and other materials and techniques used to promote and support universal access to knowledge.\n\nThis book, initiated by the UNESCO/COL Chair in OER, is one in a series of publications by the Commonwealth of Learning (COL) examining OER. It describes the movement in detail, providing readers with insight into OER’s significant benefits, its theory and practice, and its achievements and challenges. The 16 chapters, written by some of the leading international experts on the subject, are organised into four parts by theme:\n\nOER in Academia – describes how OER are widening the international community of scholars, following MIT’s lead in sharing its resources and looking to the model set by the OpenCourseWare Consortium\nOER in Practice – presents case studies and descriptions of OER initiatives underway on three continents\nDiffusion of OER – discusses various approaches to releasing and “opening” content, from building communities of users that support lifelong learning to harnessing new mobile technologies that enhance OER access on the Internet\nProducing, Sharing and Using OER – examines the pedagogical, organisational, personal and technical issues that producing organisations and institutions need to address in designing, sharing and using OER \n\nInstructional designers, curriculum developers, educational technologists, teachers, researchers, students, others involved in creating, studying or using OER: all will find this timely resource informative and inspiring.","authors":["Rory McGreal (Editor","Wanjira Kinuthia","Stewart Marshall (Editor","Tim McNamara (Editor"],"meta":["May 2013","Edition: 1stPublisher: COL, Athabasca University (May 2013)Editor: Rory McGreal (Editor), Wanjira Kinuthia (Editor), Stewart Marshall (Editor), Tim McNamara (Editor)ISBN: 9781894975629"],"references":["256474439_A_Pedagogy_of_Abundance_or_a_Pedagogy_to_Support_Human_Beings_Participant_Support_on_Massive_Open_Online_Courses","254299911_Determinants_of_Individual_Engagement_in_Knowledge_Sharing","254200695_Supporting_the_process_of_developing_and_managing_LOM_application_profiles_The_ASK-LOM-AP_tool","247717091_Introduction_Knowledge_Management_in_Professional_Service_Firms","243765689_Educational_Software_Architecture_and_Systemic_Impact_The_Promise_of_Component_Software1","239800097_The_Promise_of_Open_Educational_Resources","237522363_OPEN_EDUCATIONAL_RESOURCES_FOR_BLENDED_LEARNING_IN_HIGH_SCHOOLS_OVERCOMING_IMPEDIMENTS_IN_DEVELOPING_COUNTRIES","235992932_ASK-LDT_A_web-based_learning_scenarios_authoring_environment_based_on_IMS_learning_design","235312453_Managing_Knowledge-based_Value_Systems","235335281_Openness_Dynamic_Specialization_and_the_Disaggregated_Future_of_Higher_Education"]}