{"id":"256206327_Vandermonde_and_Wronskian_matrices_over_division_rings","abstract":"In [L], the first author initiated the study of Vandermonde matrices with entries over a division ring K. Even in the case when K is a field, the definition of a Vandermonde matrix in [L] is already more general than that in the classical sense, as it takes into account a given endomorphism S of K. Under the epilogue of [L], it was further pointed out that the results of that paper remain valid if, in the definition of a Vandermonde matrix, one allows for a given S-derivation D and uses the appropriate definition of the “power functions” in the (S, D)-setting. Such a generalization is worthwhile because, in this setting, the study of Vandermonde matrices over K also encompasses the study of Wronskian matrices with respect to D, so results on Vandermonde matrices may be used to study linear differential equations arising from the operator D. More generally, Vandermonde matrices seem to be an important tool in studying the skew polynomial ring K[t, S, D], so a deeper understanding of Vandermonde matrices should be important to the study of the arithmetic of a division ring. The purpose of this paper is threefold. First, we shall develop (under Sec- tion 2) the basic facts on skew polynomials in the (S, D)-setting, define the evaluation of such polynomials, and prove the all-important “Product Theorem” (2.7). Second, we shall give a general computation of the rank of a Vandermonde matrix with respect to (S, D). As in [L], the computation is first reduced to the case when the elements a,, . . . . a, used to build the Vandermonde matrix are pairwise “(S, D)-conjugate.” In this case, the rank of the Vandermonde matrix is computed by the dimension of a vector space over a certain division subring of K (cf. Theorem 4.5). Last, under","authors":["Tsit Lam","André Leroy"],"meta":["December 1988Journal of Algebra 119(2):308–336","DOI:10.1016/0021-8693(88)90063-4"],"references":["268707523_Nilpotent_S-Derivations","266438743_Inverses_of_Vandermonde_Matrices","266177395_On_generalized_Vandermonde_determinants","265996626_Algebraic_Conjugacy_Classes_and_Skew_Polynomial_Rings","265935590_On_the_Zeros_of_Polynomials_over_Division_Rings","265451975_Finite_dimensional_division_algebras","265423473_The_art_of_computer_programming_Vol_IV_3_parts","265367829_Skew_field_constructions","258239683_The_theory_of_error-correcting_codes_Parts_I_II","256205277_S-derivations_internes_dans_les_corps","248865039_Derivees_logarithmiques_pour_une_S_-_derivation_algebrique","246995074_On_a_Special_Class_of_Polynomials","243044987_S-derivations_algebriques_sur_les_corps_gauches_et_sur_les_anneaux_premiers","239328737_A_general_theory_of_Vandermonde_matrices","238865561_Derivees_logarithmiques_pour_une_s-derivation_algebrique","50333437_A_Treatise_On_The_Theory_of_Determinants"]}