{"id":"256392292_Orthogonal_circulant_matrices_over_finite_fields_and_how_to_find_them","abstract":"It is currently fashionable to construct linear binary codes by specifying a set of generating vectors of the code in partitioned form (E, A).In the case of particular interest E, A are both n × n matrices over the field F = GF(p), p prime. E = diagonal [1, 1,…, 1] and is a circulant matrix which is also orthogonal, that is, AAT = E.The interest in these codes arises, in part, from the fact that several of the known “best” codes (for example n = 4, n = 12 for p = 2) can be put into this form, so that it seems possible that there are good codes for larger values of n. To look for these codes one obviously needs to be able to find orthogonal circulant matrices for a class of larger values of n. This is fairly straightforward if n is prime to p, more difficult if n is divisible by p, and most difficult of all for the important case p = 2.The real purpose of this paper is to provide methods (suitable for the computer) by which to construct orthogonal circulant matrices of any size. This purpose is somewhat unclear in Sections 1 and 2, where we seem to be interested chiefly in counting these and other classes of matrices, by laborious (but constructive) methods. However, the construction is illustrated by an example in Appendix B.Let Gn, Sn, On denote, respectively, the groups of invertible circulant, invertible and symmetric circulant, and orthogonal circulant matrices of size n × n over the field F = GF(p). In Section 1 of this paper we find the orders of these groups for n prime to p, and in Section 2 show how to construct Gsp, Ssp, Osp from Gs, Ss, Os. The order of Gn is already known, since it is an instance the last lemma of [1], and it is very likely that the order of Sn is also known. However, the same methods apply to all three cases, and it seems a kindness to the reader to lead up gently to the most complicated one.","authors":["F.J MacWilliams"],"meta":["January 1971Journal of Combinatorial Theory Series A 10(1):1–17","DOI:10.1016/0097-3165(71)90062-8"],"references":["248499453_A_New_Treatment_of_Bose-Chaudhuri_Codes","242624578_Representation_Theory_of_Finite_Groups_and_Associative_Algebras","38334508_Distribution_of_cyclic_matrices_in_a_finite_field"]}