{"id":"256380006_On_the_optimization_of_discrete_structures_with_aeroelastic_constraints","abstract":"It is observed that modern optimal design of structures represents a confluence of two streams of theoretical development: Matric finite element approximation on the digital computer—a technology of which Professor Argyris is one of the founders; and practical application of the variational calculus. The present paper addresses optimization problems wherein complicated constraints involving dynamic aeroelastic behavior are prominent. Search procedures based on optimality criteria are believed to offer special advantages relative to such problems.With the principal constraint formulated in terms of the “ V-g method” of flutter analysis, three search schemes are applied to the minimum-weight redesign of a particular wing. The first scheme is based on the method of feasible directions and is representative of mathematical programming methods. The other two are derived from necessary conditions for a local optimum and can be classed as optimality-criteria schemes. Although the results are by no means definitive, they do suggest that a heuristic redesign algorithm based on an optimality criterion may be the best candidate for incorporation in a more general design procedure capable of treating multiple constraints with large numbers of design variables.The paper's final section undertakes to show how optimality criteria might be constructed when the aeroelastic constraint is written in the time domain. Three special forms of the aerodynamic generalized forces are considered: quasi-steady, quasi-steady with dissipation omitted, and fully unsteady. The resulting criteria for the first and last cases are based on an unproven hypothesis, but it is suggested that their simplicity merits a trial application.","authors":["Samuel McIntosh","Holt Ashley"],"meta":["May 1978Computers & Structures 8(s 3–4):411–419","DOI:10.1016/0045-7949(78)90186-4"],"references":["271384418_Finite_State_Modelling_of_Aeroelastic_Systems","280956137_An_optimality_criteria_method_based_on_slack_variables_concept_for_large_structural_optimization","268462952_A_flutter_optimization_program_for_aircraft_structural_design","267055822_On_the_stability_and_optimal_design_of_elastic_structures","256158819_CONMIN-a_FORTRAN_program_for_constrained_function_minimisation_user's_manual","245420490_Optimization_of_structures_to_satisfy_flutter_requirements","241412749_A_General_Method_for_Flutter_Optimization","234198662_Errata_Doublet-Lattice_Method_for_Calculating_Lift_Distributions_on_Oscillating_Surfaces_in_Subsonic_Flows","35315088_An_application_of_control_theory_methods_to_the_optimization_of_structures_having_dynamic_or_aeroelastic_constraints","23976877_Optimization_of_complex_structures_to_satisfy_flutter_requirements","23864007_Automated_structural_design_with_aeroelastic_constraints_-_A_review_and_assessment_of_the_state_of_the_art","23862238_Optimization_of_multi-constrained_structures_based_on_optimality_criteria","23835080_A_comparison_of_two_types_of_structural_optimization_procedures_for_satisfying_flutter_requirements","23600167_Weight_minimization_of_structures_for_fixed_flutter_speed_via_an_optimality_criterion"]}