{"id":"256440602_Teaching_Human_Factors_to_Graduate_and_Undergraduate_Computer_Science_Students","abstract":"Human factors (HF) is not a subject traditionally taught in the Computer Science (CS) curriculum. The traditional CS curriculum focuses on the computer (the machine) and the programs for the machine. Because the faculty was not introduced to HF in their education, studying users has no role in their discipline. Undergraduate CS students are more receptive to new ideas and consequently do not define their discipline as rigidly. Nevertheless, they typically chose to study CS because of their interest in the technology and the machines. Another challenge to introducing HF to the CS curriculum is that there is no space in the program for another course. Human-Computer Interaction (HCI) is an existing course in most CS curricula that can be leveraged to expose CS undergraduates to HF concepts. The traditional HCI course focused primarily on the technology and implementation of graphical user interfaces. Only recently has design, specifically user centered design, been taught in CS HCI courses.\nThis paper describes combining undergraduate and graduate HCI courses that expose CS students to HF. Students in the undergraduate HCI course design and implements group projects, consisting of smart phone applications (apps), and the graduate students evaluate and test the apps. The challenges of introducing HF to CS students and principles for overcoming them are explained, along with the interactions between the undergraduate and graduate students.","authors":["Robert Pastel","Christopher Brown","Margo M Woller-Carter","Shrya Kumar"],"meta":["October 2012Proceedings of the Human Factors and Ergonomics Society Annual Meeting 56(1)","DOI:10.1177/1071181312561124","Conference: Annual Meeting of the Human Factors and Ergonomics SocietyAt: Boston, MAVolume: 56"],"references":["311468969_Integration_of_usability_issues_within_initial_software_development_education_It's_all_about_the_user_dummy","305262113_Teaching_software_psychology_experimentation_through_team_projects","273347709_A_Service_Learning_Case_Study_for_the_Ergonomics_Classroom","271715992_A_Studio-Based_Approach_to_Teaching_Ergonomics_and_Human_Factors","271715991_Applied_Experimental_Psychology_A_Capstone_Course_for_Undergraduate_Psychology_Degree_Programs","271436643_Applying_cognitive_psychology_to_computer_systems","271368550_Teaching_human-computer_interaction","247926428_Teaching_software_psychology_experimentation_through_team_projects","238799545_Applying_cognitive_psychology_to_computer_systems_A_graduate_seminar_in_psychology","234832848_Teaching_human-computer_interaction_in_introductory_courses"]}