{"id":"256439081_Data_Science_and_Its_Relationship_to_Big_Data_and_Data-Driven_Decision_Making","abstract":"Companies have realized they need to hire data scientists, academic institutions are scrambling to put together data science programs, and publications are touting data science as a hot -- even \"sexy\" -- career choice. However, there is confusion about what exactly data science is, and this confusion could lead to disillusionment as the concept diffuses into meaningless buzz. In this paper we argue that there are good reasons why it has been hard to pin down exactly what data science is. One reason is that data science is intricately intertwined with other important concepts also of growing importance, such as big data and data-driven decision making. Another reason is the natural tendency to associate what a practitioner does with the definition of the practitioner's field; this can result in overlooking the fundamentals of the field. We believe that trying to define the boundaries of Data Science precisely right now is not of the utmost importance. We can debate the boundaries of the field in an academic setting, but in order for data science to serve business effectively, it is important (i) to understand its relationships to other important related concepts, and (ii) to begin to identify the fundamental principles underlying data science. Once we embrace (ii) we can much better understand and explain exactly what data science has to offer. Furthermore, only once we embrace (ii) should we be comfortable calling it data science. In this paper we present a perspective that addresses all these things. We close by offering as examples a partial list of fundamental principles underlying data science.","authors":["Foster Provost","Tom Fawcett"],"meta":["March 2013Big Data 1(1)","DOI:10.1089/big.2013.1508","Project: Data Science for Business"],"references":["293449812_Good_data_won't_guarantee_good_decisions","249623358_The_Construction_of_Work_in_Artificial_Intelligence","239585378_CRISP-DM_Towards_a_standard_process_model_for_data_mining","232279315_Data_Scientist_The_Sexiest_Job_of_the_21st_Century","228221847_Strength_in_Numbers_How_Does_Data-Driven_Decisionmaking_Affect_Firm_Performance","228150559_Pseudo-Social_Network_Targeting_from_Consumer_Transaction_Data","200121167_Cross_Industry_Standard_Process_for_Data_Mining","37935746_What_I_Know_about_You","2128673_Network-Based_Marketing_Identifying_Likely_Adopters_Via_Consumer_Networks"]}