{"id":"256453165_Algorithm_for_shortest_path_search_in_Geographic_Information_Systems_by_using_reduced_graphs","abstract":"The use of Geographic Information Systems has increased considerably since the eighties and nineties. As one of their most demanding applications we can mention shortest paths search. Several studies about shortest path search show the feasibility of using graphs for this purpose. Dijkstra's algorithm is one of the classic shortest path search algorithms. This algorithm is not well suited for shortest path search in large graphs. This is the reason why various modifications to Dijkstra's algorithm have been proposed by several authors using heuristics to reduce the run time of shortest path search. One of the most used heuristic algorithms is the A* algorithm, the main goal is to reduce the run time by reducing the search space. This article proposes a modification of Dijkstra's shortest path search algorithm in reduced graphs. It shows that the cost of the path found in this work, is equal to the cost of the path found using Dijkstra's algorithm in the original graph. The results of finding the shortest path, applying the proposed algorithm, Dijkstra's algorithm and A* algorithm, are compared. This comparison shows that, by applying the approach proposed, it is possible to obtain the optimal path in a similar or even in less time than when using heuristic algorithms.","authors":["Rafael Rodríguez Puente","Manuel S. Lazo-Cortés"],"meta":["September 2013SpringerPlus 2(1):291","DOI:10.1186/2193-1801-2-291","SourcePubMed","Project: Graph reduction model"],"references":["262407565_A_shortest_path_algorithm_with_novel_heuristics_for_dynamic_transportation_networks","252869259_Solar_energy_enhancement_using_down-converting_particles_A_rigorous_approach","316824218_Graduate_Texts_in_Mathematics","280940059_Analyzing_process_models_using_graph_reduction_techniques","257972452_Limiting_efficiency_of_generalized_realistic_c-Si_solar_cells_coupled_to_ideal_up-converters","257375724_Enhancement_of_power_conversion_efficiency_in_GaAs_solar_cells_with_dual-layer_quantum_dots_using_flexible_PDMS_film","251928112_An_improved_verification_method_for_workflow_model_based_on_Petri_net_reduction","247224812_Solar_cell_performance_improvement_via_photoluminescence_conversion_of_Si_nanoparticles","243279294_Photovoltaic_quantum_efficiency_enhancement_by_light_harvesting_of_organo-lanthanide_complexes","242476059_BIDIRECTIONAL_AND_HEURISTIC_SEARCH_IN_PATH_PROBLEMS"]}