{"id":"256447392_A_Mobile_and_Ubiquitous_Approach_for_Supporting_Frailty_Assessment_in_Elderly_People","abstract":"Frailty is a health condition related to aging and dependence. A reduction in or delay of the frailty state can improve the quality of life of the elderly. However, providing frailty assessments can be difficult because many factors must be taken into account. Usually, measurement of these factors is performed in a noncentralized manner. Additionally, the lack of quantitative methods for analysis makes it impossible for the diagnosis to be as complete or as objective as it should be.\nTo develop a centralized mobile system to conduct elderly frailty assessments in an accurate and objective way using mobile phone capabilities.\nThe diagnosis of frailty includes two fundamental aspects: the analysis of gait activity as the main predictor of functional disorders, and the study of a set of frailty risk factors from patient records. Thus, our system has several stages including gathering information about gait using accelerometer-enabled mobile devices, collecting values of frailty factors, performing analysis through similarity comparisons with previous data, and displaying the results for frailty on the mobile devices in a formalized way.\nWe developed a general mechanism to assess the frailty state of a group of elders by using mobile devices as supporting tools. In collaboration with geriatricians, two studies were carried out on a group of 20 elderly patients (10 men and 10 women), previously selected from a nursing home. Frailty risk factors for each patient were collected at three different times over the period of a year. In the first study, data from the group of patients were used to determine the frailty state of a new incoming patient. The results were valuable for determining the degree of frailty of a specific patient in relation to other patients in an elderly population. The most representative similarity degrees were between 73.4% and 71.6% considering 61 frailty factors from 64 patient instances. Additionally, from the provided results, a physician could group the elders by their degree of similarity influencing their care and treatment. In the second study, the same mobile tool was used to analyze the frailty syndrome from a nutritional viewpoint on 10 patients of the initial group during 1 year. Data were acquired at three different times, corresponding to three assessments: initial, spontaneous, and after protein supplementation. The subsequent analysis revealed a general deterioration of the subset of elders from the initial assessment to the spontaneous assessment and also an improvement of biochemical and anthropometric parameters in men and women from the spontaneous assessment to the assessment after the administration of a protein supplement.\nThe problem of creating a general frailty index is still unsolved. However, in recent years, there has been an increase in the amount of research on this subject. Our studies took advantage of mobile device features (accelerometer sensors, wireless communication capabilities, and processing capacities among others) to develop a new method that achieves an objective assessment of frailty based on similarity results for an elderly population, providing an essential support for physicians.","authors":["Jesús Fontecha","Ramón Hervás","José Bravo","Fco. Javier Navarro"],"meta":["September 2013Journal of Medical Internet Research 15(9):e197","DOI:10.2196/jmir.2529","SourcePubMed"],"references":["252764592_Risk_Factors_for_Frailty_in_the_Older_Adult","231223676_The_Smartphone_in_Medicine_A_Review_of_Current_and_Potential_Use_Among_Physicians_and_Students","23291322_A_standard_procedure_for_creating_a_frailty_index","20557640_Failure_to_Thrive_Paradigm_for_the_Frail_Elder","235324596_Elderly_Frailty_Detection_by_using_Accelerometer-Enabled_Smartphones_and_Clinical_Information_Records","235324542_A_Model_to_Develop_Frailty_Diagnosis_Tools_through_Mobile_Devices_and_a_Service-Oriented_Approach","232128574_A_General_Coefficient_of_Similarity_and_Some_of_Its_Properties","41623829_Towards_an_integral_conceptual_model_of_frailty","21578297_Preventing_Frail_Health","20644480_Long-Term_Care_Options_for_the_Frail_Elderly","12079685_Frailty_in_Older_Adults_Evidence_for_a_Phenotype","19904610_Who_are_the_frail_elderly","19218344_Performance-Oriented_Assessment_of_Mobility_Problems_in_Elderly_Patients","14886561_Frailty_in_elderly_people_An_evolving_concept","12924443_Toward_an_Understanding_of_Frailty"]}