{"id":"256545181_Predicting_general_academic_performance_and_identifying_the_differential_contribution_of_participating_variables_using_artificial_neural_networks","abstract":"Many studies have explored the contribution of different factors from diverse theoretical perspectives to the explanation of academic performance. These factors have been identified as having important implications not only for the study of learning processes, but also as tools for improving curriculum designs, tutorial systems, and students' outcomes. Some authors have suggested that traditional statistical methods do not always yield accurate predictions and/or classifications (Everson, 1995; Garson, 1998). This paper explores a relatively new methodological approach for the field of learning and education, but which is widely used in other areas, such as computational sciences, engineering and economics. This study uses cognitive and non-cognitive measures of students, together with background information, in order to design predictive models of student performance using artificial neural networks (ANN). These predictions of performance constitute a true predictive classification of academic performance over time, a year in advance of the actual observed measure of academic performance. A total sample of 864 university students of both genders, ages ranging between 18 and 25 was used. Three neural network models were developed. Two of the models (identifying the top 33% and the lowest 33% groups, respectively) were able to reach 100% correct identification of all students in each of the two groups. The third model (identifying low, mid and high performance levels) reached precisions from 87% to 100% for the three groups. Analyses also explored the predicted outcomes at an individual level, and their correlations with the observed results, as a continuous variable for the whole group of students. Results demonstrate the greater accuracy of the ANN compared to traditional methods such as discriminant analyses. In addition, the ANN provided information on those predictors that best explained the different levels of expected performance. Thus, results have allowed the identification of the specific influence of each pattern of variables on different levels of academic performance, providing a better understanding of the variables with the greatest impact on individual learning processes, and of those factors that best explain these processes for different academic levels.","authors":["Mariel Musso","Eva Kyndt","Eduardo Cascallar","Filip Dochy"],"meta":["August 2013FRONTLINE LEARNING RESEARCH 1(1):42-71","DOI:10.14786/flr.v1i1.13"],"references":["285943794_A_structural_model_of_cognitive-motivational_variables_as_explanatory_factors_of_academic_achievement_in_Spanish_Language_and_Mathematics","296963871_Working_Memory_and_Education","296267917_Relation_of_memory_and_attention_to_academic_achievement_in_adults","296258621_The_relation_of_memory_and_attention_to_academic_achievement_in_children","289963936_Reasoning_ability_is_little_more_than_working-memory_capacity","289963056_Reasoning_ability_is_little_more_than_working-memory_capacity","286420976_Working_memory_and_aging","285728697_Effects_of_noise_letters_upon_the_identification_of_a_target_letter_in_a_non-search_task","280302171_Classificatory_Stream_Analysis_in_the_Prediction_of_Expected_Reading_Readiness_Understanding_Student_Performance","280301716_Predicting_academic_performance_the_role_of_cognition_motivation_and_learning_approaches_A_neural_network_analysis"]}