{"id":"256643058_Evidence_for_an_ozone_hole_perturbation_at_30_South","abstract":"A relatively strong stratospheric column ozone decrease was observed in the south of Brazil (29.5‡S) in 1993, at the end of October. This ozone decrease was observed when the normal behavior of the ozone column at low latitudes, in Brazil, reaches its yearly maximum, so that a decrease of ozone during this time period is unexpected. The local observations were made by two different measurement techniques. Two independent ground-based Brewer spectrophotometers documented strong column ozone decreases in the south of Brazil, in 1993. The vertical distribution of ozone was observed with ozone-soundings, showing a uniform ozone decrease at all heights in the stratosphere, and very low ozone in the lower stratosphere, which has been shown to be a characteristic of Antarctic ozone in Spring. TOMS ozone data, representing a third observational technique, averaged over small latitude-longitude bands, correlate very well with the local observations, which leaves no doubt that the observed ozone decreases in the south of Brazil during October 1993 were real. Also, the observed ozone decreases may be considered large, since for comparison, the local seasonal variation is at most of the order of 30 Dobson Units (DU), whereas one of the October decreases measured about 60 DU. There seems to be no physical or chemical mechanism at low latitudes, that could account for such a large and fast perturbation in the stratosphere. On the other hand, inspection of the TOMS total ozone data maps, on the days of the above observations, show a distinct link between the Antarctic ozone hole latitudes, reaching out to the north in a curved path, and touching tropical latitudes over a narrow belt. Trajectory analyses confirm that for days of low ozone in Santa Maria, Brazil, the air masses at 20 and 25 km height have an Antarctic origin.","authors":["V.W.J.H. Kirchhoff","N.J. Schuch","D.K. Pinheiro","Joyce M. Harris"],"meta":["May 1996Atmospheric Environment 30(9):1481–1484, 1487–1488","DOI:10.1016/1352-2310(95)00362-2"],"references":["253891597_Analysis_of_10-day_isentropic_flow_patterns_for_Barrow_Alaska_1985-1992","242875257_New_ozone_hole_phenomenon","226028367_Extension_of_Antarctic_ozone_hole_to_lower_latitudes_in_the_South-American_region","43653628_The_Brazilian_network_of_stratospheric_ozone_monitors_observations_of_the_1992_ozone_hole","24157743_Evidence_of_mid-latitude_impact_of_Antarctic_ozone_depletion","23923033_Ozone_climatology_at_Natal_Brazil_from_in_situ_ozonesonde_data","23913014_Interactions_between_HCl_NOx_and_H2O_ice_in_the_Antarctic_stratosphere_-_Implications_for_ozone","23887949_Global_impact_of_the_Antarctic_ozone_hole_-_Dynamical_dilution_with_a_three-dimensional_chemical_transport_model","23887771_Global_impact_of_the_Antarctic_ozone_hole_-_Chemical_propagation","23824845_The_Antarctic_Ozone_Hole"]}