{"id":"256661697_The_History_and_New_Trends_of_Medical_Informatics","abstract":"The breakthrough of the computer and information technologies in all the segments of the society, led to the needs for the computer and information technologies. The knowledge of information technology is now part of general literacy. The computer literacy does not require comprehensive and detailed knowledge of the electronics or programming.\nAlthough with the electronic computer which is the invention of our age, the attempts of the construction of the first machine for the processing of the information reach far in the history of human civilization. The only and global function of a computer data processing can be naturally separated into the series of the other elementary operations, as for examples are: ‘the followup of the data, their registration, reproduction, selection, sorting, and comparison’ and so on.\nThe computers are being classified according to ‘the purpose, type and computer size’. According to the purpose the computers it can be of the general and specific purposes. The computers for the general purpose serve for the commercial applications or any other application that is necessary.\nIf medical informatics is regarded as a scientific discipline dealing with theory and practice of information processes in medicine, comprising data communication by information and communication technologies (ICT), with computers as an especially important ICT, then it can be stated that the history medical informatics is connected with the beginnings of computer usage in medicine.\nThe medical informatics is the foundation for understanding and practice of the up-to-day medicine. Its basic tool is the computer, subject of studying and the means by which the aspects and achieve the new knowledge in the studying of a man, his health and disease, and functioning of the total health activities.\nCurrent network system possesses the limited global performance in the organization of health care, and that is especially expressed in the clinical medicine, where the computer technology has not received the wanted applications yet.\nIn front of us lies the brilliant future of the medical informatics. It should expect that the application of terminal and personal computers with more simple manners of operation will enable routine use of computer technology by all health professionals in the fields of telemedicine, distance learning (DL) (web-based medical education), application of ICT, medical robotics, genomics, etc. The development of nature languages for communication with the computers and the identification of input voice will make the work simpler.\nRegarding the future of medical informatics education there are numerous controversies. Everybody agrees that the medical informatics is very significant for the whole health care and for the needs for personnel. However, there is not yet the general agreement regarding the teaching programs, because the medical informatics is very involved and propulsive, what makes the performance of the stable education programs more difficult. There are also not general agreement in which year of studding should transfer the knowledge from medical informatics. The majority of the experts still agree that the priority should be given in later study years, since more and more students enroll the faculties with prior informatics illiteracy, and the comprehension of some medical informatics fields is not possible without prior clinical knowledge.\n\nHow to cite this article\nMasic I. The History and New Trends of Medical Informatics. Donald School J Ultrasound Obstet Gynecol 2013;7(3):301-312.","authors":["Izet Masic"],"meta":["July 2013Donald School Journal of Ultrasound in Obstetrics and Gynecology 7(3):72-83","DOI:10.5005/jp-journals-10009-"],"references":["260951340_A_Short_History_of_Medical_Informatics_in_Bosnia_and_Herzegovina","257366854_History_of_the_Society_for_Medical_Informatics_of_Bosnia_and_Herzegovina","235793719_A_Review_of_Informatics_and_Medical_Informatics_History","229125225_A_Handbook_of_Medical_Informatics","31612888_Informations_systems_theory_and_practice_JG_Burch","13681980_Medical_informatics--an_interdisciplinary_approach","8569119_Medical_informatics_in_Bosnia_and_Herzegovina"]}