{"id":"256942175_A_generic_statistical_approach_for_spam_detection_in_Online_Social_Networks","abstract":"In this paper, we present a generic statistical approach to identify spam profiles on Online Social Networks (OSNs). Our study is based on real datasets containing both normal and spam profiles crawled from Facebook and Twitter networks. We have identified a set of 14 generic statistical features to identify spam profiles. The identified features are common to both Facebook and Twitter networks. For classification task, we have used three different classification algorithms – naïve Bayes, Jrip, and J48, and evaluated them on both individual and combined datasets to establish the discriminative property of the identified features. The results obtained on a combined dataset has detection rate (DR) as 0.957 and false positive rate (FPR) as 0.048, whereas on Facebook dataset the DR and FPR values are 0.964 and 0.089, respectively, and that on Twitter dataset the DR and FPR values are 0.976 and 0.075, respectively. We have also analyzed the contribution of each individual feature towards the detection accuracy of spam profiles. Thereafter, we have considered 7 most discriminative features and proposed a clustering-based approach to identify spam campaigns on Facebook and Twitter networks.","authors":["Faraz Ahmed","Muhammad Abulaish"],"meta":["June 2013Computer Communications 36(s 10–11):1120–1129","DOI:10.1016/j.comcom.2013.04.004"],"references":["225243434_Stegobot_A_Covert_Social_Network_Botnet","224204823_The_Koobface_botnet_and_the_rise_of_social_malware","221613448_Content-driven_detection_of_campaigns_in_social_media","221611968_Characterizing_user_behavior_in_online_social_networks","261232918_An_MCL-Based_Approach_for_Spam_Profile_Detection_in_Online_Social_Networks","254002849_Suspended_Accounts_in_Retrospect_An_Analysis_of_Twitter_Spam","228990846_Detecting_and_Characterizing_Social_Spam_Campaigns","221651818_Social_Network-Based_Botnet_Command-and-Control_Emerging_Threats_and_Countermeasures","221609515_Spam_The_underground_on_140_characters_or_less","221609304_Detecting_and_characterizing_social_spam_campaigns"]}