{"id":"257001029_Propagation_time_for_zero_forcing_on_a_graph","abstract":"Zero forcing (also called graph infection) on a simple, undirected graph GG is based on the color-change rule: if each vertex of GG is colored either white or black, and vertex vv is a black vertex with only one white neighbor ww, then change the color of ww to black. A minimum zero forcing set is a set of black vertices of minimum cardinality that can color the entire graph black using the color change rule. The propagation time of a zero forcing set BB of graph GG is the minimum number of steps that it takes to force all the vertices of GG black, starting with the vertices in BB black and performing independent forces simultaneously. The minimum and maximum propagation times of a graph are taken over all minimum zero forcing sets of the graph. It is shown that a connected graph of order at least two has more than one minimum zero forcing set realizing minimum propagation time. Graphs GG having extreme minimum propagation times |G|−1|G|−1, |G|−2|G|−2, and 00 are characterized, and results regarding graphs having minimum propagation time 1 are established. It is shown that the diameter is an upper bound for maximum propagation time for a tree, but in general propagation time and diameter of a graph are not comparable.","authors":["Leslie Hogben","My Huynh","Nicole Kingsley","Sarah Meyer"],"meta":["September 2012Discrete Applied Mathematics 160(s 13–14):1994–2005","DOI:10.1016/j.dam.2012.04.003"],"references":["234129129_Zero_forcing_sets_and_the_minimum_rank_of_graphs","51890739_Iteration_Index_of_a_Zero_Forcing_Set_in_a_Graph","5915600_Full_Control_by_Locally_Induced_Relaxation","267665410_Zero_forcing_sets_and_the_minimum_rank_of_graphs","258319062_Nondiscriminatory_propagation_on_trees","251484028_A_technique_for_computing_the_zero_forcing_number_of_a_graph_with_a_cutvertex","228979144_Vertex_and_edge_spread_of_zero_forcing_number_maximum_nullity_and_minimum_rank_of_a_graph","228570699_Minimum_rank_problems","45905415_Zero_forcing_parameters_and_minimum_rank_problems"]}