{"id":"257035079_Image-based_mapping_of_surface_fissures_for_the_investigation_of_landslide_dynamics","abstract":"The development of surface fissures is an important indicator for understanding and forecasting slope movements. Landslide investigations therefore frequently include the elaboration and interpretation of maps representing their spatial distribution, typically comprising intensive field work and instrumentation. It is only recently that aerial photography with sub-decimetre spatial resolution is becoming more commonly available and opens a window to analyse such features from a remote sensing perspective. While these data are in principle helpful to elaborate maps from image interpretation techniques, there is still no image processing technique available to extract efficiently these geomorphological features. This work proposes a largely automated technique for the mapping of landslide surface fissures from very-high resolution aerial images. The processing chain includes the use of filtering algorithms and post-processing of the filtered images using object-oriented analysis. The accuracy of the resulting maps is assessed by comparisons with several expert maps in terms of affected area, fissure density and fissure orientation. Under homogenous illumination conditions, true positive rates up to 65% and false positive rates generally below 10% are achieved. The resulting fissure maps provide sufficient detail to infer mechanical processes at the slope scale and to prioritize areas for more detailed ground investigations or monitoring.","authors":["Andre Stumpf","J.-P. Malet","Norman Kerle","U. Niethammer"],"meta":["March 2013Geomorphology 186:12–27","DOI:10.1016/j.geomorph.2012.12.010"],"references":["319960108_Relating_the_occurrence_of_crevasses_to_surface_strain_rates","319938497_Crevasse_patterns_and_the_strain-rate_tensor_a_high-resolution_comparison","297546957_Crevasse_patterns_and_the_strain-rate_tensor_a_high-resolution_comparison","302937305_A_Threshold_Selection_Method_from_Gray-Level_Histogram","289641658_Toward_preliminary_hazard_assessment_using_DEM_topographic_analysis_and_simple_mechanical_modeling_by_means_of_sloping_local_base_level","288008237_Regulations_and_Requirements","288008079_On_the_landslide_cracks_classification","285901251_Tension_cracks_and_slope_failure","285769347_Field_investigation","284668266_Zur_Mechanik_geologischer_Brucherscheinungen"]}