{"id":"257074200_Population_Genetics_of_Lactobacillus_sakei_Reveals_Three_Lineages_with_Distinct_Evolutionary_Histories","abstract":"Lactobacillus sakei plays a major role in meat fermentation and in the preservation of fresh meat. The large diversity of L. sakei strains represents a valuable and exploitable asset in the development of a variety of industrial applications; however, an efficient method to identify and classify these strains has yet to be developed. In this study, we used multilocus sequence typing (MLST) to analyze the polymorphism and allelic distribution of eight loci within an L. sakei population of 232 strains collected worldwide. Within this population, we identified 116 unique sequence types with an average pairwise nucleotide diversity per site (π) of 0.13%. Results from Structure, goeBurst, and ClonalFrame software analyses demonstrated that the L. sakei population analyzed here is derived from three ancestral lineages, each of which shows evidence of a unique evolutionary history influenced by independent selection scenarios. However, the signature of selective events in the contemporary population of isolates was somewhat masked by the pervasive phenomenon of homologous recombination. Our results demonstrate that lineage 1 is a completely panmictic subpopulation in which alleles have been continually redistributed through the process of intra-lineage recombination. In contrast, lineage 2 was characterized by a high degree of clonality. Lineage 3, the earliest-diverging branch in the genealogy, showed evidence of both clonality and recombination. These evolutionary histories strongly indicate that the three lineages may correspond to distinct ecotypes, likely linked or specialized to different environmental reservoirs. The MLST scheme developed in this study represents an easy and straightforward tool that can be used to further analyze the population dynamics of L. sakei strains in food products.","authors":["Stéphane Chaillou","Isabelle Lucquin","Afef Najjari","Monique Zagorec"],"meta":["September 2013PLoS ONE 8(9):e73253","DOI:10.1371/journal.pone.0073253","SourcePubMed"],"references":["281534996_MEGA4_a_molecular_evolutionary_genetic_analysis_MEGA_software_version_40","313159598_Inference_of_Population_Structure_Using_Multilocus_Genotype_Data","287554690_Garlic_fermentation_by_lactic_acid_bacteria","273562047_Emended_Descriptions_of_LactobacilZus_sake_Katagiri_Kitahara_and_Fukami_and_Lactobacillus_curvatus_Abo-Elnaga_and_Kandler_Numerical_Classification_Revealed_by_Protein_Fingerprinting_and_Identification","272976623_Structural_similarity_and_distribution_of_small_cryptic_plasmids_of_Lactobacillus_curvatus_and_L_sake","224768173_Identification_and_characterization_of_lactic_acid_bacteria_isolated_from_mixed_pasture_of_timothy_and_orchardgrass_and_its_badly_preserved_silage","223796052_Industrial_application_of_an_antilisterial_strain_of_Lactobacillus_sakei_as_a_protective_culture_and_its_effect_on_the_sensory_acceptability_of_cooked_sliced_vacuum-packaged_meats","223644193_Lactic_acid_bacteria_in_meat_fermentation_FEMS","223294792_Characterization_of_lactobacilli_from_meats_and_meat_products","51926281_Fingerprint_of_lactic_acid_bacteria_population_in_beef_carpaccio_is_influenced_by_storage_process_and_seasonal_changes"]}