{"id":"257054192_Spatio-temporal-based_joint_range_and_angle_estimation_for_wideband_signals","abstract":"Object localization using active sensor network exploiting the\nscattering of the emitted waves by a transmitter has been drawing a lot\nof research interest in the last years. For most applications, the\nenvironment leads to the arrival of multiple signals corresponding to\nemitted signal, signals which are scattered by the objects, and noise.\nIn practical systems, the signals impinging on an array are frequently\ncorrelated, and the object number rapidly exceeds the number of sensors,\nmaking unsuitable most high-resolution methods used in array processing.\nWe propose a solution to overcome these two experimental constraints.\nFirstly, frequential smoothing is used to decorrelate the scattered\nsignals, enabling the estimation of their time delays of arrival (TDOA),\nusing subspace-based methods. Secondly, an efficient algorithm for\nsource localization using the TDOA is proposed. The advantage of the\ndeveloped method is its efficiency even if the number of sources is\nlarger than the number of sensors, in the presence of correlated\nsignals. The performances of the proposed method are assessed on\nsimulated signals. The results on real-world data are also presented and\nanalyzed.","authors":["Caroline Fossati","Guilhem Villemin"],"meta":["December 2013EURASIP Journal on Advances in Signal Processing 2013(1)","DOI:10.1186/1687-6180-2013-131"],"references":["224605573_DOA_Estimation_of_Quasi-Stationary_Signals_With_Less_Sensors_Than_Sources_and_Unknown_Spatial_Noise_Covariance_A_Khatri-Rao_Subspace_Approach","224144884_Robust_Expectation-Maximization_Algorithm_for_Multiple_Wideband_Acoustic_Source_Localization_in_the_Presence_of_Nonuniform_Noise_Variances","312230773_A_method_for_the_solution_of_certain_nonlinear_problems_in_least_squares","271196714_New_Look_at_Statistical-Model_Identification","253395820_Identification_of_electromagnetic_sources","247487676_Sensor_Array_Signal_Processing","243515921_Calibration_of_a_distorted_towed_array_using_a_propagation_operator","241130679_Comparison_of_resolving_power_of_array_processing_methods_by_using_an_analytical_criterion","235117029_Performance_of_Bayes-Optimal_Angle-of-Arrival_Estimators","224738722_Eigensystem_properties_of_the_sampled_space_correlation_matrix"]}