{"id":"257135562_Grapevine_powdery_mildew_resistance_and_susceptibility_loci_identified_on_a_high-resolution_SNP_map","abstract":"Improved efficacy and durability of powdery mildew resistance can be enhanced via knowledge of the genetics of resistance and susceptibility coupled with the development of high-resolution maps to facilitate the stacking of multiple resistance genes and other desirable traits. We studied the inheritance of powdery mildew (Erysiphe necator) resistance and susceptibility of wild Vitis rupestris B38 and cultivated V. vinifera 'Chardonnay', finding evidence for quantitative variation. Molecular markers were identified using genotyping-by-sequencing, resulting in 16,833 single nucleotide polymorphisms (SNPs) based on alignment to the V. vinifera 'PN40024' reference genome sequence. With an average density of 36 SNPs/Mbp and uniform coverage of the genome, this 17K set was used to identify 11 SNPs on chromosome 7 associated with a resistance locus from V. rupestris B38 and ten SNPs on chromosome 9 associated with a locus for susceptibility from 'Chardonnay' using single marker association and linkage disequilibrium analysis. Linkage maps for V. rupestris B38 (1,146 SNPs) and 'Chardonnay' (1,215 SNPs) were constructed and used to corroborate the 'Chardonnay' locus named Sen1 (Susceptibility to Erysiphe necator 1), providing the first insight into the genetics of susceptibility to powdery mildew from V. vinifera. The identification of markers associated with a susceptibility locus in a V. vinifera background can be used for negative selection among breeding progenies. This work improves our understanding of the nature of powdery mildew resistance in V. rupestris B38 and 'Chardonnay', while applying next-generation sequencing tools to advance grapevine genomics and breeding.","authors":["Paola Barba","Lance Cadle-Davidson","James Harriman","Jeffrey C Glaubitz"],"meta":["September 2013Theoretical and Applied Genetics 127(1)","DOI:10.1007/s00122-013-2202-x","SourcePubMed"],"references":["279687140_Marker-assisted_Selection_for_Powdery_Mildew_Resistance_in_Grapes","263087600_Marker-assisted_selection_for_powdery_mildew_resistance_in_grapes","258049503_Natural_infection_of_Run1-positive_vines_by_naive_genotypes_of_Erysiphe_necator","235371993_Switchgrass_Genomic_Diversity_Ploidy_and_Evolution_Novel_Insights_from_a_Network-Based_SNP_Discovery_Protocol","234156930_Saturated_linkage_map_construction_in_Rubus_idaeus_using_genotyping_by_sequencing_and_genome-independent_imputation","230713048_Construction_of_a_high-density_genetic_map_for_grape_using_next_generation_restriction-site_associated_DNA_sequencing","288636841_JoinMapR_40_software_for_the_calculation_of_genetic_linkage_maps_in_experimental_population_Kyazma_BV","284250084_GRAPES_VITIS","275791428_Compendium_of_Grape_Diseases","258304800_Genome-wide_genetic_marker_discovery_and_genotyping_using_next-generation_sequencing_Nat_Rev_Genet"]}