{"id":"257142871_Multilayer_Networks","abstract":"Most real and engineered systems include multiple subsystems and layers of\nconnectivity, and it is important to take such features into account to try to\nimprove our understanding of these systems. It is thus necessary to generalize\n\"traditional\" network theory by developing (and validating) a framework and\nassociated tools to study multilayer systems in a comprehensive fashion. The\norigins of such efforts date back several decades and arose in multiple\ndisciplines, and now the study of multilayer networks has become one of the\nmost important directions in network science. In this paper, we discuss the\nhistory of multilayer networks (and related concepts) and review the exploding\nbody of work on such networks. To unify the disparate terminology in the large\nbody of recent work, we discuss a general framework for multilayer networks,\nconstruct a dictionary of terminology to relate the numerous existing concepts\nto each other, and provide a thorough discussion that compares, contrasts, and\ntranslates between related notions such as multilayer networks, multiplex\nnetworks, interdependent networks, networks of networks, and many others. We\nalso survey and discuss existing data sets that can be represented as\nmultilayer networks. We review attempts to generalize single-layer-network\ndiagnostics to multilayer networks. We also discuss the rapidly expanding\nresearch on multilayer-network models and notions like community detection,\nconnected components, tensor decompositions, and various types of dynamical\nprocesses on multilayer networks. We conclude with a summary and an outlook.","authors":["Mikko Kivelä","Alex Arenas","Marc Barthelemy","James P. Gleeson"],"meta":["September 2013SSRN Electronic Journal 2(3)","DOI:10.1093/comnet/cnu016","SourcearXiv"],"references":["301957108_On_Clustering_on_Graphs_with_Multiple_Edge_Types","346671096_Algebraic_Models_for_Social_Networks","333746439_Exploiting_Cellular_Data_for_Disease_Containment_and_Information_Campaigns_Strategies_in_Country-Wide_Epidemics","330577194_Keep_Your_Friends_Close_and_Your_Facebook_Friends_Closer_A_Multiplex_Network_Approach_to_the_Analysis_of_Offline_and_Online_Social_Ties","313695087_Spatial_Contact_Models_for_Ecological_and_Epidemic_Spread","313607570_The_architecture_of_complex_weighted_networks","313606501_Mining_Association_rules_between_sets_of_items_in_large_databases","313130163_The_Judicial_Process_Among_the_Barotse_of_Northern_Rhodesia","303244285_Structural_change_and_learning_within_organizations","298503683_Application_of_pattern_recognition_in_RoboCup"]}