{"id":"257153312_A_survey_of_DEA_applications","abstract":"The literature of data envelopment analysis (DEA) encompasses many surveys, yet all either emphasize methodologies or do not make a distinction between methodological and application papers. This study is the first literature survey that focuses on DEA applications, covering DEA papers published in journals indexed by the Web of Science database from 1978 through August 2010. The results show that on the whole around two-thirds (63.6%) of DEA papers embed empirical data, while the remaining one-third are purely-methodological. Purely-methodological articles dominated the first 20 years of DEA development, but the accumulated number of application-embedded papers caught up to purely-methodological papers in 1999. Among the multifaceted applications, the top-five industries addressed are: banking, health care, agriculture and farm, transportation, and education. The applications that have the highest growth momentum recently are energy and environment as well as finance. In addition to the basic statistics, we uncover the development trajectory in each application area through the main path analysis. An observation from these works suggests that the two-step contextual analysis and network DEA are the recent trends across applications and that the two-step contextual analysis is the prevailing approach.","authors":["John S. Liu","Louis Y. Y. Lu","Wen-Min Lu","Bruce J.Y. Lin"],"meta":["October 2013Omega 41(5):893–902","DOI:10.1016/j.omega.2012.11.004"],"references":["321619879_Data_Envelopment_Analysis_A_Comprehensive_Text_with_Models_Applications_References_and_DEA-Solver_Software","338891137_Technical_allocative_and_economic_efficiencies_in_swine_production_in_Hawaii_a_comparison_of_parametric_and_nonparametric_approaches","312084140_Recent_developments_in_frontier_modelling_and_efficiency_measurement","303201886_Assessing_bank_and_bank_branch_performance_modeling_considerations_and_approaches","298180309_DO_NEW-YORK_DAIRY_FARMERS_MAXIMIZE_PROFITS","281265794_Economic_efficiency_of_railways_and_implications_for_public_policy_a_comparative_study_of_the_OECD_countries'_railways","276969066_Hospital_Efficiency_Measurement_and_Evaluation","265634784_Quantitative_models_for_performance_evaluation_and_benchmarking_Data_envelopment_analysis_with_spreadsheets_3rd_ed","265168479_A_slacks-based_measure_of_super-efficiency_in_data_envelopment_analysis_An_alternative_approach","264952743_Data_envelopment_analysis_A_comprehensive_text_with_models_applications_references_and_dea-solver_software_Second_editions"]}