{"id":"257252088_An_efficient_parallel_construction_of_optimal_independent_spanning_trees_on_hypercubes","abstract":"Reliable data broadcasting on parallel computers can be achieved by applying more than one independent spanning tree (IST). Using k-IST-based broadcasting from root r on an interconnection network (N = 2(k)) provides k-degree fault tolerance in broadcasting, while construction of optimal height k-ISTs needs more time than that of one IST. In the past, most research focused on constructing k ISTs on the hypercube Q(k), an efficient communication network. One sequential approach utilized the recursive feature of Q(k) to construct k ISTs working on a specific root (r) = 0 in O(kN) time. Another parallel approach was introduced for generating k ISTs with optimal height on Q(k), based on HDLS (Hamming Distance Latin Square), single pointer jumping, which is applied for a source (r) = 0 in O(k(2)) time for successful broadcasting in O(k). For broadcasting from r not equal 0, those existing approaches require a special routine to reassign new nodes' IDs for logical r = 0. This paper proposes a flexible and efficient parallel construction of k ISTs with optimal height on Q(k), a generalized approach, for an arbitrary root (r = 0, 1, 2, . . . , or 2(k) - 1) in O(k) time. Our focus is to introduce the more efficient time (O(k)) of preprocessing, based on double pointer jumping over O(k(2)) of the HDLS approach. We also prove that our generalized parallel k-IST construction (arbitrary r) with optimal height on Q(k) is correctly set in efficient O(k) time. Finally, experiments were performed by simulation to investigate the fault-tolerance effect in reliable broadcasting. Experimental results showed that our efficient ISTs yielded 10%-20% fault tolerance for successful broadcasting (on N = 16-1024 PEs). (c) 2012 Elsevier Inc. All rights reserved.","authors":["Jeeraporn Werapun","Sarun Intakosum","Veera Boonjing"],"meta":["December 2012Journal of Parallel and Distributed Computing 72(12):1713–1724","DOI:10.1016/j.jpdc.2012.07.003"],"references":["228960920_Parallel_construction_of_independent_spanning_trees_on_multidimensional_tori","220587447_Optimal_Independent_Spanning_Trees_on_Hypercubes","220327777_Optimum_Broadcasting_and_Personalized_Communication_in_Hypercubes","3301188_Reducing_the_Height_of_Independent_Spanning_Trees_in_Chordal_Rings","227103332_Independent_trees_in_graphs","226950322_A_Linear-Time_Algorithm_to_Find_Four_Independent_Spanning_Trees_in_Four-Connected_Planar_Graphs","222814706_Parallel_construction_of_optimal_independent_spanning_trees_on_hypercubes","222754329_Application_of_the_special_Latin_square_to_a_parallel_routing_algorithm_on_a_recursive_circulant_network","220752925_Independent_Spanning_Trees_of_Product_Graphs","220752647_Completely_Independent_Spanning_Trees_in_Maximal_Planar_Graphs","220397812_Independent_Trees_in_Planar_Graphs_Independent_trees","220397803_Independent_Trees_and_Branchings_in_Planar_Multigraphs","220113150_Topological_Properties_of_the_Directional_Hypercube","32164419_Independent_Spanning_Trees_of_Chordal_Rings","3042345_Reliable_Broadcast_in_Hypercube_Multicomputers","3042227_Topological_Properties_of_Hypercubes"]}