{"id":"257350649_Novel_evidence_in_support_of_the_bilingual_advantage_Influences_of_task_demands_and_experience_on_cognitive_control_and_working_memory","abstract":"The bilingual advantage-enhanced cognitive control relative to monolinguals-possibly occurs due to experience engaging general cognitive mechanisms in order to manage two languages. Supporting this hypothesis is evidence that bimodal (signed language-spoken language) bilinguals do not demonstrate such an advantage, presumably because the distinct language modalities reduce conflict and control demands. We hypothesized that the mechanism responsible for the bilingual advantage is the interplay between (a) the magnitude of bilingual management demands and (b) the amount of experience managing those demands. We recruited adult bimodal bilinguals with high bilingual management demands and examined cognitive control and working memory capacity longitudinally. After gaining experience managing high bilingual management demands, participants outperformed themselves from 2 years earlier on cognitive abilities associated with managing the bilingual demands. These results suggest that cognitive control outcomes for bilinguals vary as a function of the mechanisms recruited during bilingual management and the amount of experience managing the bilingual demands.","authors":["Brooke N Macnamara","Andrew Conway"],"meta":["October 2013Psychonomic Bulletin & Review 21(2)","DOI:10.3758/s13423-013-0524-y","SourcePubMed"],"references":["255616091_Cognitive_and_Linguistic_Processing_in_the_Bilingual_Mind","236026471_Simultaneous_interpreting_A_cognitive_perspective","235391028_There_is_no_coherent_evidence_for_a_bilingual_advantage_in_executive_processing","232571677_Decomposing_Adult_Age_Differences_in_Working_Memory","313472317_Mental_control_of_the_bilingual_lexicosemantic_system","293206659_The_measurement_of_working_memory_capacity","290368545_Shadowing","262196947_Advanced_Progressive_Matrices_Set_II","239966462_Empirical_studies_of_simultaneous_interpretation_A_review_and_a_model","231880772_Mental_control_of_the_bilingual_lexico-sematic_system"]}