{"id":"257336310_Integrated_scheduling_of_flexible_manufacturing_system_using_evolutionary_algorithms","abstract":"Effective sequencing and scheduling of the material handling system (MHS) have an impact on the productivity of the flexible manufacturing system (FMS). The MHS cannot be neglected while scheduling the production tasks. It is necessary to take into account the interaction between machines and MHS. This paper highlights the importance of integration between production schedule and MHS schedule in FMS. The Giffler and Thompson algorithm with different priority dispatching rules is developed to minimize the makespan in the FMS production schedule. Its output is used for MHS scheduling where the distance traveled and the number of backtrackings of the automated-guided vehicles are minimized using an evolutionary algorithms such as an ant colony optimization algorithm and particle swarm optimization (PSO) algorithm. The proposed evolutionary algorithms are validated with benchmark problems. The results available for the existing algorithms are compared with results obtained by the proposed evolutionary algorithms. The analysis reveals that PSO algorithm provides better solution with reasonable computational time.","authors":["Pranesh Udhayakumar","Somasundaram Kumanan"],"meta":["October 2012The International Journal of Advanced Manufacturing Technology 61(5-8):621-635","DOI:10.1007/s00170-011-3727-2"],"references":["266614041_Research_Opportunities_in_Supply_Chain_Management","313606758_Perspectives_in_supply_chain_risk_management","313103009_The_Use_of_Particle_Swarm_Optimization_for_Order_Allocation_Under_Multiple_Capacitated_Sourcing_and_Quantity_Discounts","305295139_Integrated_Production_Control_Systems","293757269_ADAPTING_HORIZONTAL_MATERIAL_HANDLING_SYSTEMS_TO_FLEXIBLE_MANUFACTURING_SETUPS","279909659_Beam_search_based_algorithm_for_scheduling_machines_and_AGVs_in_an_FMS","277298436_Multi-Objective_Particle_Swarm_Optimisation_Methods","273453883_Particle_Swarm_Optimization","266476598_Multi-Objective_Optimization_Using_Evolutionary_Algorithms","265787619_MULTI_OBJECTIVE_SCHEDULING_OF_JOBS_AGVs_AND_ASRS_IN_FMS_USING_ARTIFICIAL_IMMUNE_SYSTEM"]}