{"id":"257352640_The_one-against-all_partition_based_binary_tree_support_vector_machine_algorithms_for_multi-class_classification","abstract":"The binary tree support vector machine (SVM) algorithm is one of the mainstream algorithms for multi-class classification in the fields of pattern recognition and machine learning. In order to reduce the training and testing time of one-against-all SVM (OAA-SVM) and reduced OAA-SVM (R-OAA-SVM), in this study, two OAA partition based binary tree SVM algorithms are proposed for multi-class classification. One is the single-space-mapped binary tree SVM (SBT-SVM) and the other is the multi-space-mapped binary tree SVM (MBT-SVM). In the proposed two algorithms, the best OAA partition is determined for each non-leaf node and the k-fold cross validation strategy is adopted to obtain the optimal classifiers. A set of experiments is conducted on nine UCI datasets and two face recognition datasets to demonstrate their performances. The results show that in term of testing accuracy, MBT-SVM is comparable with one-against-one SVM (OAO-SVM), R-OAA-SVM and OAA-SVM and superior to SBT-SVM. In term of testing time, MBT-SVM is superior to OAO-SVM, binary tree of SVM (BTS), R-OAA-SVM and OAA-SVM and slightly longer than SBT-SVM. In term of training time, MBT-SVM is superior to BTS, R-OAA-SVM and OAA-SVM and comparable with SBT-SVM. For the datasets with smaller class number and training sample number, the training time of MBT-SVM is comparable with that of OAO-SVM. For the datasets with larger class number or training sample number, in most cases, the training time of MBT-SVM is longer than that of OAO-SVM.","authors":["Xiaowei Yang","Qiaozhen Yu","Lifang He","Tengjiao Guo"],"meta":["August 2013Neurocomputing 113(3):1–7","DOI:10.1016/j.neucom.2012.12.048","Project: Support Vector Machine"],"references":["229006003_Support_vector_machines_with_binary_tree_architecture_for_multi-class_classification","313557859_Pairwise_classification_and_support_vector_machines_In_Advances_in_kernel_methods_Support_vector_learning_Cambridge_MA","312964265_Support_vector_machines_for_multi-class_pattern_recognition","312538118_Support-vector_networks","284772341_Pairwise_classification_and_support_vector_machines","283997566_Parallel_networks_that_learn_to_pronounce_English_text","278651717_The_Nature_of_Statistical_Learning_Theory","271513141_Support_Vector_Networks","243763580_The_Nature_Of_Statistical_Learning_Theory","230876652_Pairwise_Classification_and_Support_Vector_Machines"]}