{"id":"257367544_Spatially_Varying_Coefficient_Model_for_Neuroimaging_Data_With_Jump_Discontinuities","abstract":"Motivated by recent work on studying massive imaging data in various\nneuroimaging studies, we propose a novel spatially varying coefficient model\n(SVCM) to spatially model the varying association between imaging measures in a\nthree-dimensional (3D) volume (or 2D surface) with a set of covariates. Two key\nfeatures of most neuorimaging data are the presence of multiple piecewise\nsmooth regions with unknown edges and jumps and substantial spatial\ncorrelations. To specifically account for these two features, SVCM includes a\nmeasurement model with multiple varying coefficient functions, a jumping\nsurface model for each varying coefficient function, and a functional principal\ncomponent model. We develop a three-stage estimation procedure to\nsimultaneously estimate the varying coefficient functions and the spatial\ncorrelations. The estimation procedure includes a fast multiscale adaptive\nestimation and testing procedure to independently estimate each varying\ncoefficient function, while preserving its edges among different\npiecewise-smooth regions. We systematically investigate the asymptotic\nproperties (e.g., consistency and asymptotic normality) of the multiscale\nadaptive parameter estimates. We also establish the uniform convergence rate of\nthe estimated spatial covariance function and its associated eigenvalue and\neigenfunctions. Our Monte Carlo simulation and real data analysis have\nconfirmed the excellent performance of SVCM.","authors":["Hongtu Zhu","Jianqing Fan","Linglong Kong"],"meta":["October 2013Journal of the American Statistical Association 109(507)","DOI:10.1080/01621459.2014.881742","SourcearXiv"],"references":["318392948_Kernel_Smoothing","306204103_On_the_statistical_analysis_of_dirty_pictures_with_discussion","292523940_Image_Processing_and_Jump_Regression_Analysis","291290501_Statistical_Parametric_Mapping_The_Analysis_of_Functional_Brain_Images","284537528_Multivariate_Density_Estimation_Theory_Practice_and_Visualization","283863199_3D_Anatomical_Atlas_of_the_Human_Brain","281380483_Functional_Data_Analysis","279720746_Principles_Methods_and_Applications_of_Diffusion_Tensor_Imaging","279720415_Statistical_Parametric_Mapping","274202807_Weak_Convergence_of_Empirical_Processes"]}