{"id":"257436119_Application_of_machine_learning_to_predict_the_recurrence-proneness_for_cervical_cancer","abstract":"This study applied advanced machine learning techniques, widely considered as the most successful method to produce objective to an inferential problem of recurrent cervical cancer. Traditionally, clinical diagnosis of recurrent cervical cancer was based on physician’s clinical experience with various risk factors. Since the risk factors are broad categories, years of clinical study and experience have tried to identify key risk factors for recurrence. In this study, three machine learning approaches including support vector machine, C5.0 and extreme learning machine were considered to find important risk factors to predict the recurrence-proneness for cervical cancer. The medical records and pathology were accessible by the Chung Shan Medical University Hospital Tumor Registry. Experimental results illustrate that C5.0 model is the most useful approach to the discovery of recurrence-proneness factors. Our findings suggest that four most important recurrence-proneness factors were Pathologic Stage, Pathologic T, Cell Type and RT Target Summary. In particular, Pathologic Stage and Pathologic T were important and independent prognostic factor. To study the benefit of adjuvant therapy, clinical trials should randomize patients stratified by these prognostic factors, and to improve surveillance after treatment might lead to earlier detection of relapse, and precise assessment of recurrent status could improve outcome.","authors":["Chih-Jen Tseng","Chi-Jie Lu","Chi-Chang Chang","Gin-Den Chen"],"meta":["January 2014Neural Computing and Applications","DOI:10.1007/s00521-013-1359-1"],"references":["258372192_A_Comparison_of_Machine_Learning_Techniques_for_Survival_Prediction_in_Breast_Cancer","257512921_Extreme_learning_machine_algorithm_theory_and_applications","342232632_Extreme_Learning_Machine_Theory_and_Applications","292214812_Policy_analysis_of_cervical_cancer_screening_strategies_in_low-resource_settings_Clinical_benefits_and_cost-effectiveness_vol_285_pg_3107_2001","287651605_Practical_gynecologic_oncology_3rd_ed","285765918_A_computer_aided_diagnosis_system_for_lung_cancer_detection_using_machine_learning_technique","285373396_Efficient_Classification_of_Cancer_using_Support_Vector_Machines_and_Modified_Extreme_Learning_Machine_based_on_Analysis_of_Variance_Features","282811023_Cancer_Classification_using_Support_Vector_Machines_and_Relevance_Vector_Machine_based_on_Analysis_of_Variance_Features","278695382_The_Nature_of_Statistical_Learning_Theory","273539047_Long-term_outcomes_and_survival_prognostic_factors_in_patients_with_positive_nodes_treated_by_neoadjuvant_chemotherapyradical_surgeryadjuvant_chemotherapy_in_locally_advanced_cervical_cancer"]}