{"id":"257488400_Predicting_academic_success_in_higher_education_What's_more_important_than_being_smart","abstract":"This study investigated the combined predictive validity of intelligence and personality factors on multiple measures of academic achievement. Students in a college of higher education in the Netherlands (N = 137) completed a survey that measured intelligence, the Big Five personality traits, motivation, and four specific personality traits. Student performance was measured with grade point average (GPA) and time to graduation, as well as with five specific performance measures: regular exams, skills training, team projects, internships, and a written thesis. Results show that 33% of the variance in GPA and 30% of the variance in time to graduation can be explained by combining intelligence, personality, and motivational predictors. Conscientiousness is the best predictor across a broad spectrum of academic achievement measures and explains five times as much variance in GPA as does intelligence. The practical implications are that institutes of higher education should collect personality data on students at the outset and then help students accordingly. Highly conscientious students who are organized and internally motivated might potentially be offered more challenging honours programs with corresponding special commendations on their diplomas, whereas students who score low on conscientious would receive more structure through student study groups, frequent deadlines, shorter assignments, group assignments, clearly defined learning goals, and less second chances for passing examinations.","authors":["Rutger Kappe","Henk van der Flier"],"meta":["December 2012European Journal of Psychology of Education 27(4)","DOI:10.1007/s10212-011-0099-9","Project: PhD project"],"references":["314798298_Comparability_of_GATB_scores_for_immigrants_and_majority_group_members_Some_Dutch_findings","254829317_Determinants_of_success_a_longitudinal_study_in_higher_professional_education","247728051_On_the_Assessment_of_Intrinsic_Extrinsic_and_Amotivation_in_Education_Evidence_on_the_Concurrent_and_Construct_Validity_of_the_Academic_Motivation_Scale","287243080_Personality_and_Intellectual_Competence","285688835_Intelligence_personality_and_interest_Evidence_for_overlapping_traits","279929283_Personality_and_Cognitive_Ability_Predictors_of_Performance_in_Graduate_Business_School","278934356_Comparability_of_GATB_scores_for_immigrants_and_majority_group_members_Some_Dutch_findings","249797725_Correlates_Causes_Effects_and_Treatment_of_Test_Anxiety","247408295_Professional_Manual_of_the_Revised_NEO_Personality_Inventory_and_NEO_Five-Factor_Inventory","247166780_Intellectual_ability_learning_style_personality_achievement_motivation_and_academic_success_of_psychology_students_in_higher_education"]}