{"id":"257404826_Advanced_computational_reasoning_based_on_the_NKRL_conceptual_model","abstract":"After having recalled some well-known shortcomings linked with the Semantic Web approach to the creation of (application oriented) systems of “rules” – e.g., limited expressiveness, adoption of an Open World Assumption (OWA) paradigm, absence of variables in the original definition of OWL – this paper examines the technical solutions successfully used for implementing advanced reasoning systems according to the NKRL’s methodology. NKRL (Narrative Knowledge Representation Language) is a conceptual meta-model and a Computer Science environment expressly created to deal, in an ‘intelligent’ and complete way, with complex and content-rich non-fictional ‘narrative’ data sources. These last include corporate memory documents, news stories, normative and legal texts, medical records, surveillance videos, actuality photos for newspapers and magazines, etc. In this context, we will expound first the need for distinguishing between “plain/static” and “structured/dynamic” knowledge and for introducing appropriate (and different) knowledge representation structures for these two types of knowledge. In a structured/dynamic context, we will then show how the introduction of “functional roles” – associated with the possibility of making use of n-ary structures – allows us to build up highly ‘expressive’ rules whose “atoms” can directly represent complex situations, actions, etc. without being restricted to the use of binary clauses. In an NKRL context, “functional roles” are primitive symbols interpreted as “relations” – like “subject”, “object”, “source”, “beneficiary”, etc. – that link a semantic predicate with its arguments within an n-ary conceptual formula. Functional roles contrast then with the “semantic roles” that are equated to ordinary concepts like “student”, to be inserted into the “non-sortal” (no direct instances) branch of a traditional ontology.","authors":["Gian Piero Zarri"],"meta":["June 2013Expert Systems with Applications 40(8):2872–2888","DOI:10.1016/j.eswa.2012.12.005"],"references":["314184732_Formal_Ontology_for_Media_Rights_Transactions","334585057_A_Framework_For_Representing_Knowledge","326429859_OWL2_The_Next_Step_for_OWL","326341675_Query_Answering_for_OWL-DL_with_rules","326338097_Pellet_A_Practical_OWL-DL_Reasoner","326337843_OWL-QL_A_Language_for_Deductive_Query_Answering_on_the_Semantic_Web","319394754_Logical_Foundations_of_Object-Oriented_and_Frame-Based_Languages","319394162_Programming_in_Prolog","319393968_The_Logical_Form_of_Action_Sentences","313575536_Rete_A_fast_algorithm_for_the_many_patternmany_object_pattern_match_problem"]}