{"id":"257514875_Relational_Concept_Analysis_Mining_Concept_Lattices_From_Multi-Relational_Data","abstract":"The processing of complex data is admittedly among the major concerns of knowledge discovery from data (kdd). Indeed, a major part of the data worth analyzing is stored in relational databases and, since recently, on the Web of Data. This clearly underscores the need for Entity-Relationship and rdf compliant data mining (dm) tools. We are studying an approach to the underlying multi-relational data mining (mrdm) problem, which relies on formal concept analysis (fca) as a framework for clustering and classification. Our relational concept analysis (rca) extends fca to the processing of multi-relational datasets, i.e., with multiple sorts of individuals, each provided with its own set of attributes, and relationships among those. Given such a dataset, rca constructs a set of concept lattices, one per object sort, through an iterative analysis process that is bound towards a fixed-point. In doing that, it abstracts the links between objects into attributes akin to role restrictions from description logics (dls). We address here key aspects of the iterative calculation such as evolution in data description along the iterations and process termination. We describe implementations of rca and list applications to problems from software and knowledge engineering.","authors":["Mohamed Rouane-Hacene","Marianne Huchard","Amedeo Napoli","Petko Valtchev"],"meta":["January 2013Annals of Mathematics and Artificial Intelligence 67(1)","DOI:10.1007/s10472-012-9329-3","Project: Relational Concept Analysis"],"references":["346062916_Discovery_of_frequent_DATALOG_patterns","262235258_Generation_of_Operational_Transformation_Rules_from_Examples_of_Model_Transformations","285277704_Ordered_sets_chap_restructuring_lattice_theory","280113714_Relational_Data_Mining","279347205_Formal_Concept_Analysis","272003835_Concept_lattices_and_order_in_fuzzy_logic","267090169_The_description_logic_handbook_Theory_implementation_and_applications_Reprint_of_the_2007_hardback_ed","265826011_Mining_Graph_Data","257479721_Advances_in_Knowledge_Discovery_Data_Mining","256822029_Mining_generalized_association_rules"]}