{"id":"257516019_Comparison_of_Traditional_and_WEB-Based_Education_-_Case_Study_BigBlueButton","abstract":"The goal of this research was an analysis of the paper results in two groups of students in second semester to see the result of an earlier research was correct or not. In the first group I made the presentation of the lectures virtual by using the BigBlueButton web conference system (n=118) while the lectures for the second group were delivered in class (traditional way, n=171). The experience shows, the majority of the students do not visit the presentations at the universities, just download the learning material and try to take a successful exam, but they do not have too much chance to pass it. First of all I wanted to see how many students take part in the virtual and traditional presentations respectively in the next semester and I observed that the virtual way was preferred (∼80% of students) to the classical way (∼30–40%), I got same result like in the first semester. The students in the first group were more motivated; they took this opportunity rather than the conventional educational method. My starting hypothesis was that the group where I used the web conference system as a presentation tool would achieve better results in the papers. It was based on the differentiation of the number of participants at the presentations, because more students visited the virtual presentations and followed the lessons over the Internet. After the evaluation of the final tests results the correctness of the original presumption seemed to be proved. Significance level was 5% through the analysis. It was found significant divergence in the knowledge of the students taking part in the virtual presentations and that of the students using the traditional way. The students could get one mark better paper results when they followed the virtual lesson. I made this research with partly other students and I get same result. Consequently, the use of the web conference system as a presentation tool is productive; the students follow the presentations with more motivation to use this new tool in their studies and get better results when writing papers.","authors":["Gabor Kiss"],"meta":["August 2012","DOI:10.1109/ITiME.2012.6291286","Conference: 2012 International Symposium on Information Technology in Medicine and Education (ITME 2012)At: Hokkaido"],"references":["305893904_Practice_based_course_of_Information_Technology_Service_Management_for_BSc_students","301959659_Robust_tests_for_equality_of_variances","265092376_Educating_the_Net_Generation","261456164_Empirical_results_about_efforts_for_effective_teaching_to_y-generation_freshman_students","260735751_Evaluation_of_lecture_using_web-based_e-learning_and_development_of_rapid_e-learning_system","258178020_The_Analysing_Of_The_Computer_Science_Learning_Habits_In_The_First_Year_On_The_Budapest_Tech","258176860_Wie_kann_man_die_Steganographie_und_Kryptographie_bekannt_machen","258160609_Analyse_der_Studienleistungen_von_Studierenden_an_der_Universitat_Obuda_und_deren_Implikationen_fur_die_Infomatikausbildung","258159945_Analysing_the_relationship_between_students'_paper_results_and_flash_based_logical_problem_solving_in_the_course_Introduction_to_Informatics","257515961_Using_web_conference_system_during_the_lessons_in_the_Higher_Education","257515700_Using_web_conference_system_during_the_consultation_hours","251929066_Experiences_in_teaching_data_concealment_and_data_encryption_to_engineering_undergraduates","232585427_Eta-Squared_and_Partial_Eta-Squared_in_Fixed_Factor_Anova_Desings","231381418_A_Nation_Online_How_Americans_Are_Expanding_Their_Use_of_the_Internet"]}