{"id":"257553428_A_single_pass_algorithm_for_clustering_evolving_data_streams_based_on_swarm_intelligence","abstract":"Existing density-based data stream clustering algorithms use a two-phase scheme approach consisting of an online phase, in which raw data is processed to gather summary statistics, and an offline phase that generates the clusters by using the summary data. In this article we propose a data stream clustering method based on a multi-agent system that uses a decentralized bottom-up self-organizing strategy to group similar data points. Data points are associated with agents and deployed onto a 2D space, to work simultaneously by applying a heuristic strategy based on a bio-inspired model, known as flocking model. Agents move onto the space for a fixed time and, when they encounter other agents into a predefined visibility range, they can decide to form a flock if they are similar. Flocks can join to form swarms of similar groups. This strategy allows to merge the two phases of density-based approaches and thus to avoid the computing demanding offline cluster computation, since a swarm represents a cluster. Experimental results show that the bio-inspired approach can obtain very good results on real and synthetic data sets.","authors":["Agostino Forestiero","Clara Pizzuti","Giandomenico Spezzano"],"meta":["January 2013Data Mining and Knowledge Discovery 26(1)","DOI:10.1007/s10618-011-0242-x"],"references":["229124762_Data_Streams_Models_and_Algorithms","228616913_Online_clustering_of_data_streams","226625371_On_Clustering_Massive_Data_Streams_A_Summarization_Paradigm","313561896_Tecno-streams_Tracking_evolving_clusters_in_noisy_data_streams_with_a_scalable_immune_system_learning_model","245402995_AND_SCHOOLS_A_DISTRIBUTED_BEHAVIORAL_MODEL","235709967_Flocks_Herds_and_Schools_A_Distributed_Behavioral_Model","232642010_Clustering_data_streams_theory_and_practice_IEEE_Trans_Knowl_Data_Eng","222671953_Clustering_distributed_data_streams_in_peer-to-peer_environments","222435345_Online_clustering_of_parallel_data_streams","222429855_An_adaptive_flocking_algorithm_for_performing_approximate_clustering"]}