{"id":"257560017_The_impact_of_identifier_style_on_effort_and_comprehension","abstract":"A family of studies investigating the impact of program identifier style on human comprehension is presented. Two popular identifier styles are examined, namely camel case and underscore. The underlying hypothesis is that identifier style affects the speed and accuracy of comprehending source code. To investigate this hypothesis, five studies were designed and conducted. The first study, which investigates how well humans read identifiers in the two different styles, focuses on low-level readability issues. The remaining four studies build on the first to focus on the semantic implications of identifier style. The studies involve 150 participants with varied demographics from two different universities. A range of experimental methods is used in the studies including timed testing, read aloud, and eye tracking. These methods produce a broad set of measurements and appropriate statistical methods, such as regression models and Generalized Linear Mixed Models (GLMMs), are applied to analyze the results. While unexpected, the results demonstrate that the tasks of reading and comprehending source code is fundamentally different from those of reading and comprehending natural language. Furthermore, as the task becomes similar to reading prose, the results become similar to work on reading natural language text. For more “source focused” tasks, experienced software developers appear to be less affected by identifier style; however, beginners benefit from the use of camel casing with respect to accuracy and effort.","authors":["Dave Binkley","Marcia Davis","Dawn Lawrie","Jonathan I. Maletic"],"meta":["April 2013Empirical Software Engineering 18(2)","DOI:10.1007/s10664-012-9201-4"],"references":["292067025_A_comparison_of_fillers_and_spaces_in_text_Evidence_for_the_importance_of_word_recognition_in_reading","269034973_Eye_tracking_in_web_search_tasks","254330973_Linear_Transformations_of_Linear_Mixed-Effects_Models","321621253_Models_for_Discrete_Longitudinal_Data","315616639_The_Programmer's_Lexicon_Volume_I_The_Verbs","282236013_Linear_Mixed_Models_For_Longitudinal_Data","266995177_Linear_Mixed_Models_For_Longitudinal_Data","264649211_Models_for_Discrete_Longitudinal_Data","252065335_Hungarian_Notation","235678850_Empirical_Studies_of_Programming_Knowledge"]}