{"id":"257549123_Parallel_distributed-memory_simplex_for_large-scale_stochastic_LP_problems","abstract":"We present a parallelization of the revised simplex method for large extensive forms of two-stage stochastic linear programming (LP) problems. These problems have been considered too large to solve with the simplex method; instead, decomposition approaches based on Benders decomposition or, more recently, interior-point methods are generally used. However, these approaches do not provide optimal basic solutions, which allow for efficient hot-starts (e.g., in a branch-and-bound context) and can provide important sensitivity information. Our approach exploits the dual block-angular structure of these problems inside the linear algebra of the revised simplex method in a manner suitable for high-performance distributed-memory clusters or supercomputers. While this paper focuses on stochastic LPs, the work is applicable to all problems with a dual block-angular structure. Our implementation is competitive in serial with highly efficient sparsity-exploiting simplex codes and achieves significant relative speed-ups when run in parallel. Additionally, very large problems with hundreds of millions of variables have been successfully solved to optimality. This is the largest-scale parallel sparsity-exploiting revised simplex implementation that has been developed to date and the first truly distributed solver. It is built on novel analysis of the linear algebra for dual block-angular LP problems when solved by using the revised simplex method and a novel parallel scheme for applying product-form updates.\n\nAwarded the prize for the best paper of 2013 in Computational Optimization and Applications.","authors":["Miles Lubin","Julian Hall","Cosmin G Petra","Mihai Anitescu"],"meta":["July 2013Computational Optimization and Applications 55(3)","DOI:10.1007/s10589-013-9542-y"],"references":["255942763_Permuting_Sparse_Rectangular_Matrices_into_Block-Diagonal_Form","330263875_Using_MPI-2_Advanced_Features_of_the_Message-Passing_Interface","316799349_Springer_Series_in_Operations_Research_and_Financial_Engineering","270956418_Validity_of_the_Single-Processor_Approach_to_Achieving_Large_Scale_Computing_Capabilities","268307938_Active_set_methods_for_problems_in_column_block_angular_form","266952515_Some_results_concerning_an_algorithm_for_the_discrete_recourse_problem","247956274_The_Product_Form_for_the_Inverse_in_the_Simplex_Method","245935349_Direct_Methods_for_Sparse_Linear_Systems","245180857_Active_set_algorithms_for_problems_in_block_angular_form","243530145_Optimization_Theory_For_Large_Systems"]}