{"id":"257559885_What_are_developers_talking_about_An_analysis_of_topics_and_trends_in_Stack_Overflow","abstract":"Programming question and answer (Q&A) websites, such as Stack Overflow, leverage the knowledge and expertise of users to provide answers to technical questions. Over time, these websites turn into repositories of software engineering knowledge. Such knowledge repositories can be invaluable for gaining insight into the use of specific technologies and the trends of developer discussions. Previous work has focused on analyzing the user activities or the social interactions in Q&A websites. However, analyzing the actual textual content of these websites can help the software engineering community to better understand the thoughts and needs of developers. In the article, we present a methodology to analyze the textual content of Stack Overflow discussions. We use latent Dirichlet allocation (LDA), a statistical topic modeling technique, to automatically discover the main topics present in developer discussions. We analyze these discovered topics, as well as their relationships and trends over time, to gain insights into the development community. Our analysis allows us to make a number of interesting observations, including: the topics of interest to developers range widely from jobs to version control systems to C# syntax; questions in some topics lead to discussions in other topics; and the topics gaining the most popularity over time are web development (especially jQuery), mobile applications (especially Android), Git, and MySQL.","authors":["Anton Barua","Stephen W. Thomas","Ahmed E. Hassan"],"meta":["June 2014Empirical Software Engineering 19(3)","DOI:10.1007/s10664-012-9231-y"],"references":["267792598_Questioning_Yahoo_Answers","264799710_The_Road_Ahead_for_Mining_Software_Repositories","259118325_Studying_software_evolution_using_topic_models","305000760_Software_Engineering_A_Practitioner's_Approach_8th_Ed","276935841_Introduction_to_Information_Retrieval","262157385_Latent_Dirichlet_Allocation","242637644_An_Algorithm_for_Suffix_Stripping","240249302_Software_Engineering_a_Practioner''s_approach","239582331_Stochastic_Relaxation_Gibbs_Distributions_and_the_Bayesian_Resoration_of_Images","236221002_How_do_open_source_communities_blog"]}