{"id":"257666727_Dynamics_of_lying","abstract":"We propose a dynamic logic of lying, wherein a ‘lie that \n\n$\\varphi $\n’ (where \n\n$\\varphi $\nis a formula in the logic) is an action in the sense of dynamic modal logic, that is interpreted as a state transformer relative to the formula \n\n$\\varphi $\n. The states that are being transformed are pointed Kripke models encoding the uncertainty of agents about their beliefs. Lies can be about factual propositions but also about modal formulas, such as the beliefs of other agents or the belief consequences of the lies of other agents. We distinguish two speaker perspectives: (Obs) an outside observer who is lying to an agent that is modelled in the system, and (Ag) an agent who is lying to another agent, and where both are modelled in the system. We distinguish three addressee perspectives: (Cred) the credulous agent who believes everything that it is told (even at the price of inconsistency), (Skep) the skeptical agent who only believes what it is told if that is consistent with its current beliefs, and (Rev) the belief revising agent who believes everything that it is told by consistently revising its current, possibly conflicting, beliefs. The logics have complete axiomatizations, which can most elegantly be shown by way of their embedding in what is known as action model logic or in the extension of that logic to belief revision.","authors":["Hans van Ditmarsch"],"meta":["August 2011Synthese 191(5)","DOI:10.1007/s11229-013-0275-3","SourcearXiv"],"references":["277227050_The_Definition_of_Lying_and_Deception","266440694_First_and_second-order_false-belief_reasoning_Does_language_support_reasoning_about_the_beliefs_of_others","265945520_The_Conway_paradox_Its_solution_in_an_epistemic_framework","264882208_On_the_Tractability_of_Comparing_Informational_Structures","284463519_Lying","281274114_The_Folly_of_Fools_The_Logic_of_Deceit_and_Self-Deception_in_Human_Life","275746338_Lying_Moral_Choice_in_Public_and_Private_Life","269519876_On_Bullshit","266524057_Modal_Logic","264957063_A_Mathematician's_Miscellany"]}