{"id":"257664311_Design_and_Ground_Calibration_of_the_Helioseismic_and_Magnetic_Imager_HMI_Instrument_on_the_Solar_Dynamics_Observatory_SDO","abstract":"The Helioseismic and Magnetic Imager (HMI) investigation (Solar Phys. doi:10.1007/s11207-011-9834-2, 2011) will study the solar interior using helioseismic techniques as well as the magnetic field near the solar surface. The HMI instrument is part of the Solar Dynamics Observatory (SDO) that was launched on 11 February 2010. The instrument is designed to measure the Doppler shift, intensity, and vector magnetic field at the solar photosphere using the 6173 Å Fe i absorption line. The instrument consists of a front-window filter, a telescope, a set of waveplates for polarimetry, an image-stabilization system, a blocking filter, a five-stage Lyot filter with one tunable element, two wide-field tunable Michelson interferometers, a pair of 40962 pixel cameras with independent shutters, and associated electronics. Each camera takes a full-disk image roughly every 3.75 seconds giving an overall cadence of 45 seconds for the Doppler, intensity, and line-of-sight magnetic-field measurements and a slower cadence for the full vector magnetic field. This article describes the design of the HMI instrument and provides an overview of the pre-launch calibration efforts. Overviews of the investigation, details of the calibrations, data handling, and the science analysis are provided in accompanying articles.","authors":["J. Schou","Philip H Scherrer","R. I. Bush","R. Wachter"],"meta":["January 2011Solar Physics 275(1-2)","DOI:10.1007/s11207-011-9842-2"],"references":["257664310_The_Helioseismic_and_Magnetic_Imager_HMI_Investigation_for_the_Solar_Dynamics_Observatory_SDO","234398028_Wavelength_Dependence_of_the_Helioseismic_and_Magnetic_Imager_HMI_Instrument_onboard_the_Solar_Dynamics_Observatory_SDO","234379033_The_Solar_Oscillation_Investigation_-_Michelson_Doppler_Imager_SOI-MDI","225567779_Polarization_Calibration_of_the_Helioseismic_and_Magnetic_Imager_HMI_onboard_the_Solar_Dynamics_Observatory_SDO","225244077_Image_Quality_of_the_Helioseismic_and_Magnetic_Imager_HMI_Onboard_the_Solar_Dynamics_Observatory_SDO","225194195_The_Atmospheric_Imaging_Assembly_AIA_on_the_Solar_Dynamics_Observatory_SDO","279128691_The_solar_x-ray_imager_for_GOES","261007833_Status_of_the_Solar_Oscillations_Investigation_-_Michelson_Doppler_Imager","253667233_Helioseismic_and_Magnetic_Imager_Investigation_on_SDO_-_Current_Status","225578322_Inferring_Small-Scale_Flatfields_from_Solar_Rotation"]}