{"id":"257618432_Completing_causal_networks_by_meta-level_abduction","abstract":"Meta-level abduction is a method to abduce missing rules in explaining observations. By representing rule structures of a problem in a form of causal networks, meta-level abduction infers missing links and unknown nodes from incomplete networks to complete paths for observations. We examine applicability of meta-level abduction on networks containing both positive and negative causal effects. Such networks appear in many domains including biology, in which inhibitory effects are important in several biological pathways. Reasoning in networks with inhibition involves nonmonotonic inference, which can be realized by making default assumptions in abduction. We show that meta-level abduction can consistently produce both positive and negative causal relations as well as invented nodes. Case studies of meta-level abduction are presented in p53 signaling networks, in which causal relations are abduced to suppress a tumor with a new protein and to stop DNA synthesis when damage has occurred. Effects of our method are also analyzed through experiments of completing networks randomly generated with both positive and negative links.","authors":["Katsumi Inoue","Andrei Doncescu","Hidetomo Nabeshima"],"meta":["May 2013Machine Learning 91(2)","DOI:10.1007/s10994-013-5341-z"],"references":["346700689_A_logic_for_default_reasoning","321557302_Computational_Logic_Logic_Programming_and_Beyond_Essays_in_Honour_of_Robert_A_Kowalski_Part_II","320181465_The_origins_of_order_self-organization_and_selection_in_evolution","313665793_Inverse_entailment_and_Progol","291183979_A_Logic-Based_Calculus_of_Events","275697437_Causality_Models_Reasoning_and_Inference","269092925_Cooperation_of_Abduction_and_Induction_in_Logic_Programming","267109117_Cooperation_of_Abduction_and_Induction_in_Logic_Programming","266583829_Learning_Abductive_and_Nonmonotonic_Logic_Programs","266513639_Using_Abduction_for_Induction_Based_on_Bottom_Generalization"]}