{"id":"257657214_Ehrenfeucht-Fraisse_Games_on_Omega-Terms","abstract":"Fragments of first-order logic over words can often be characterized in terms\nof finite monoids or finite semigroups. Usually these algebraic descriptions\nyield decidability of the question whether a given regular language is\ndefinable in a particular fragment. An effective algebraic characterization can\nbe obtained from identities of so-called omega-terms. In order to show that a\ngiven fragment satisfies some identity of omega-terms, one can use\nEhrenfeucht-Fraisse games on word instances of the omega-terms. The resulting\nproofs often require a significant amount of book-keeping with respect to the\nconstants involved. In this paper we introduce Ehrenfeucht-Fraisse games on\nomega-terms. To this end we assign a labeled linear order to every omega-term.\nOur main theorem shows that a given fragment satisfies some identity of\nomega-terms if and only if Duplicator has a winning strategy for the game on\nthe resulting linear orders. This allows to avoid the book-keeping. As an\napplication of our main result, we show that one can decide in exponential time\nwhether all aperiodic monoids satisfy some given identity of omega-terms,\nthereby improving a result of McCammond (Int. J. Algebra Comput., 2001).","authors":["Martin Huschenbett","Manfred Kufleitner"],"meta":["October 2013","DOI:10.4230/LIPIcs.STACS.2014.374","SourcearXiv"],"references":["265889081_Normal_forms_for_free_aperiodic_semigroups","266433584_Finite_Automata_Formal_Logic_and_Circuit_Complexity","265667603_Automata_languages_and_machines_Vol_A","251563064_The_word_problem_for_o_-terms_over_DA","248596806_Finite_automata_and_logic_of_monadic_predicates","242942915_Weak_Second-Order_Arithmetic_and_Finite_Automata","234798109_Varieties_Of_Formal_Languages","234005293_Quantifier_Alternation_in_Two-Variable_First-Order_Logic_with_SuccessorIs_Decidable","223090679_Definability_with_a_bounded_number_of_variables","222575456_An_automata-theoretic_approach_to_the_word_problem_for_o_-terms_over_R"]}