{"id":"257663339_Scientific_collaboration_in_biotechnology_The_case_of_the_northeast_region_in_Brazil","abstract":"The objective of this study is to investigate scientific collaboration in biotechnology in the northeast region of Brazil. The data presented refer to the 1980–2010 period and were collected from the Brazilian National Council for Scientific and Technological Development platform database known as Lattes (a compilation of curricula vitae of researchers in Brazil, including a record of their scientific production) and from the Institute for Scientific Information Web of Science database. Our analysis involved the use of bibliometric indicators, specifically co-authorship between or among institutions, as well as the evaluation of social networks and multivariate statistics. Overall, we verified that collaboration takes place mostly at the intra-institutional level. At intra-regional scale, we could observe the development of four clusters in relation to the collaboration dynamics, in which geographic proximity stands out as grouping factor. At the interregional level, the partnerships revolve around institutions that count with laboratory infrastructure and research tradition in the field of biotechnology. Regarding international collaboration, it remains connected to national scientific cooperation programs.","authors":["Benedita Marta Costa","Edilson da Silva Pedro","Gorete Macedo"],"meta":["May 2013Scientometrics 95(2)","DOI:10.1007/s11192-012-0924-1"],"references":["301865836_Network_Structure_Self-Organization_and_the_Growth_of_International_Collaboration_in_Science","281592812_ANALISE_DA_EVOLUCAO_DO_SISTEMA_NACIONAL_DE_INOVACAO_EM_BIOTECNOLOGIA_NO_BRASIL","312970191_Scientific_collaboration_networks","304373193_Analise_multivariada_de_dados","296860247_The_citation_impact_of_research_collaborations_the_case_of_European_biotechnology_and_applied_microbiology_1988-2002","290621167_Social_network_analysis_a_powerful_strategy_also_for_the_information_sciences","287511968_The_geography_of_research_collaboration_Theoretical_considerations_and_stylized_facts_in_biotechnology_in_Europe_and_the_United_States","281263059_Evolution_of_the_social_network_of_scientific_collaboration","277768359_Estrategias_para_a_organizacao_da_pesquisa_em_cana-de-acucar_uma_analise_de_governanca_em_sistemas_de_inovacao","274359919_Os_periodicos_brasileiros_e_a_comunicacao_da_pesquisa_nacional"]}