{"id":"257718341_A_Creative_and_Literary_Writing_Digital_LMS_in_Supporting_Writers'_Group_Learning_and_Knowledge_Sharing_among_Creative_Writers","abstract":"The purpose of this research is attempted to examine the feasibility of a creative writing digital learning management system in sharing and social networking among creative and literary writers in improving the quality of their knowledge, creative literary writing skills and upgrading their livelihood. The creative and literary writers could use the internet facilities and connectivity of the platform not only to communicate but also to acquire knowledge on creative and literary writing skill as well as the world of literary publishing. The culture of using technologies in acquiring creative writing knowledge for the newbie, sharing experiences and the publishing of written creative works have great influence in determining the quality of their livelihood. Design and methodology used are by looking into the five dimensions of enhancing a creative writers’ learning management system to support writers’ group learning and knowledge sharing in improving livelihood of Malaysian creative writers through digital technologies (demographic, technology availability, creative writers learning culture and experiences, learners’ efficacy in digital technology and digital technology leadership and managerial quality) were examined to determine the success of supporting writers’ group learning and knowledge sharing in the digital age and improve livelihood among creative writers. In general, there are significant differences among factors stated above which will support writers’ group learning and knowledge sharing in improving livelihood. The enhancing of digital technologies could be beneficial to the creative writers upgrading their knowledge on writing, sharing of experiences and publishing of their literary works. In addition, the creative writers could use the ICT facilities to foster friendship, exchange of ideas and networking among their peers in the region either individually or their respective writer's association in the country.","authors":["Tan Luck Lee","Filouz Hashim","Syaidatul Zarina Mat Din"],"meta":["December 2012Procedia - Social and Behavioral Sciences 67:238–249","DOI:10.1016/j.sbspro.2012.11.326"],"references":["243460349_E-learning_Research_and_applications","235272688_ICT-supported_team-based_experiential_learning_Classroom_perspectives","290583051_Knowledge_management_as_an_E-learning_tool","277295991_Independent_Agent_Architecture","242023310_The_effective_deployment_of_e-learning","235271249_E-learning_Engagement_enhancement_and_execution","235266127_Multicultural_education_knowledgebase_attitudes_and_preparedness_for_diversity","235259279_Bringing_management_reality_into_the_classroom_-_the_development_of_interactive_learning","235250232_E-learning_markets_and_providers_Some_issues_and_prospects","234721613_Synthesis_of_Research_on_Computer-Based_Instruction"]}