{"id":"257718739_The_Role_of_Information_Systems_in_Creating_Strategic_Leadership_Model","abstract":"Recent articles claim that the management Information Systems (IS) [1] function should no longer be faced in its classic role, but in terms of a strategic role for exploiting IS-based competitive advantages. Rooted in such a strategic role perspective, this paper develops a research with the aid of a Dynamic Simulation Model [2] of IS and creates an effective plan of Strategic Leadership. Such modeling has been frequently used in similar studies [3], [4], [5], [6], [7], [8], [9], [10], [11], [12], [13], [14], [15], [16] and [17]. The effectiveness of this plan is the supporting mechanism to strategic management of an organization.In the research we conducted on this paper, we focus on the significant role that the IS function plays in the complete strategic management. Based on the requirements of the IS strategic role, an important planning system indicates the major factors which are identified to evolve a Dynamic Simulation Model of IS. At this point, the effectiveness of IS design is proved by the complete support, provided by IS in strategic management. Additionally, this model is tested through the results that arise by using information from companies, in order to estimate the importance of the design factors of different systems, presumed to affect IS design efficiency.This paper is based on two cases. The first one is that official IS-based planning systems play a predominant role in the capacity of organizational improvement. Although the role of other factors is not discounting, we believe that formalized systems play a determinant role in providing mechanism to reclaim such advantages. The second case is that the operational role of the IS [18] has changed. The IS constitute, in our days, a general management tool.","authors":["Nasiopoulos K. Dimitrios","Damianos P. Sakas","Dimitrios Vlachos"],"meta":["February 2013Procedia - Social and Behavioral Sciences 73:285–293","DOI:10.1016/j.sbspro.2013.02.054"],"references":["272637206_Outsourcing_or_Insourcing_in_the_High_Technology_Systems_Sector_in_a_Maritime_Company","272069865_Selecting_the_Project_Teams'_Members_A_Challenging_Human_Resources_Management_Process_for_Laboratory_Research","254187994_Impact_of_information_technology_on_quality_management_dimensions_and_its_implications","285665958_Culture_and_MIS_Effectiveness_Patterns_in_a_Quality_Context_A_Case_Study_in_Greece","272070023_The_Performance_Management_after_Mergers_and_Acquisitions_in_High_Technology_Manufacturing_Business","272048120_Pricing_Strategy_Dynamic_Simulation_Modelling_within_the_High-Tech_Sector","272035702_Marketing_Dynamic_Simulation_Modelling_in_High_Tech_Laboratories","271962820_The_Role_of_Leadership_in_High_Tech_Manufacturing_Companies_in_a_Changing_Environment","263556612_Managing_knowledge_for_business_performance_improvement","257296347_A_fifth_algebraic_order_trigonometrically-fitted_modified_Runge-Kutta_Zonneveld_method_for_the_numerical_solution_of_orbital_problems"]}