{"id":"257719695_Dependency_Analysis_of_System-of-Systems_Operational_and_Development_Networks","abstract":"In this research, a Dependency Network Analysis technique has been adapted to assess operability, reliability, and resilience in both operational and development networks, associated with System of System architectures.The architecture is modeled as a directed network where nodes represent either the component systems or the capabilities to be acquired. Links on the network represent various kinds of dependencies between the constituent systems: functional dependency in an operational network, sequential development dependency in a development network. Each dependency is characterized by strength and criticality. The ultimate goal of the technique seeks to analyze effects of such dependencies -and of their strength and criticality- on operability, and to identify valid operating and developing strategies and architectures. For operational networks, Functional Dependency Network Analysis is used to assess the effect of topology and of possible degraded functioning of one or more systems on the operability of the network. For development networks, Development Dependency Network Analysis is used to assess how development time or capabilities are affected by the network topology and by delays in the development of component systems.Each technique is evaluated with regard to amount and quality of necessary input, completeness and usefulness of results, and applicability to problems of diverse nature.","authors":["Cesare Guariniello","Daniel DeLaurentis"],"meta":["December 2013Procedia Computer Science 16:265–274","DOI:10.1016/j.procs.2013.01.028"],"references":["268022740_Advanced_Risk_Analysis_in_Engineering_Enterprise_Systems","267690543_INTRODUCTION_TO_FUNCTIONAL_DEPENDENCY_NETWORK_ANALYSIS","319549601_Architecting_principles_for_systems-of-systems","284544502_On_the_systems_engineering_and_management_of_systems_of_systems_and_federations_of_systems_Information_Knowledge_Systems_Management","280940124_Systems_Engineering_And_Analysis","274440808_Taxonomy_to_Guide_Systems-of-Systems_Decision-Making_in_Air_Transportation_Problems","264292731_Architecting_Principles_for_System_of_Systems","251944949_The_study_of_guided_emergent_behavior_in_system_of_systems_requirement_analysis","235410176_A_Different_Universe_Reinventing_Physics_From_the_Bottom_Down","234777203_On_the_System_Engineering_and_Management_of_Systems_of_Systems_and_Federations_of_Systems"]}