{"id":"257740185_The_impact_of_using_multimedia_on_students'_academic_achievement_in_the_College_of_Education_at_King_Saud_University","abstract":"The purpose of this study is to find out the impact of using multimedia on students’ academic achievement in the College of Education at King Saud University. This study’s effort is to answer the following questions:•What is the impact of using multimedia on students’ academic achievement in the “computer & its use in education” curriculum?•Are there any statistically-significant differences between the average marks of the experimental group & that of the control group in the pre & post measurements of students’ academic achievement in the school of Education?To this end, an experiment of two equivalent groups was designed, one of the groups is experimental & the other is control; each of them consists of 20 female students. The lecture was given to the first group using a computer presentation program which uses multimedia treated as an experimental group, while the second group was given the same lecture using the traditional method which uses the dialog & discussion technique treated as a control group.Both groups were subjected to pre & post tests in the subject tackled by the lecture. The analysis result of the pre test showed no statistically-significant differences, which in turn proves the equivalence of the two groups. Meanwhile, the analysis result of the post test showed the following: There are statistically-significant differences between the experimental group and the control group at a significance level of 0.05 for the interest of the experimental group.Both groups were subjected to pre & post tests in the subject tackled by the lecture. The analysis result of the pre test showed no statistically-significant differences, which in turn proves the equivalence of the two groups. Meanwhile, the analysis result of the post test showed the following: There are statistically-significant differences between the experimental group and the control group at a significance level of 0.05 for the interest of the experimental group.","authors":["Sara Ibrahem"],"meta":["July 2012Journal of King Saud University - Languages and Translation 24(2):75–82","DOI:10.1016/j.jksult.2012.05.002"],"references":["234609915_Multimedia_Editing_to_Promote_Science_Learning","234602909_The_Effect_of_Simulation_Software_on_Students'_Attitudes_and_Understanding_in_Introductory_Statistics","34967880_An_interactive_multimedia_computer_package_on_photosynthesis_for_high_school_students_based_on_a_matrix_of_cognitive_and_learning_styles"]}