{"id":"257718771_Disciplinary_Perspectives_on_Information_Management","abstract":"This paper addresses the need for a coherent conceptual framework for information management. The paper discusses the field of information management as represented by existing analyses of author affiliations, and a distinction is introduced between information management at institutional level and information management at conceptual level. Conceptual frameworks should be founded on concepts.One of the challenges of developing a framework is to delimit the area of inquiry. Is information management a discipline in its own right, or is information management several disciplines? Little research has examined information management in a disciplinary perspective. It is argued that an exploration of the components of a discipline is important as a foundation for development of a conceptual framework for information management.The paper concludes by suggesting that information management has three different underlying concepts: Information Management1: information management at institutional level. Information Management2: content-oriented information management, rooted in information science and Information Management3: technology-oriented information management, rooted in information systems. A coherent conceptual framework that incorporates disciplinary perspectives may provide a new theoretical understanding that helps us conceptualize the identity of information management.","authors":["Dorte Madsen"],"meta":["February 2013Procedia - Social and Behavioral Sciences 73:534–537","DOI:10.1016/j.sbspro.2013.02.087"],"references":["289378321_Becoming_Interdisciplinary_An_Introduction_to_Interdisciplinary_Studies_3rd_Ed","26387638_The_development_of_the_information_management_research_area","298983887_Information_and_knowledge_management_Dimensions_and_approaches","269748922_Crossing_Boundaries_Knowledge_Disciplinarities_and_Interdisciplinarities","250182418_Do_You_See_What_I_See_The_Epistemology_of_Interdisciplinary_Inquiry1","242336340_Introducing_Information_Management_An_Information_Research_Reader","220041532_Crossing_Boundaries_Knowledge_Disciplinarities_and_Interdisciplinarities","37715815_Interdisciplinarity_History_Theory_and_Practice","26459046_Information_and_knowledge_management_Dimensions_and_approaches"]}