{"id":"257757888_Global_Scenario_of_Open_Access_Publishing_A_Decadal_Analysis_of_Directory_of_Open_Access_Journals_DOAJ_2003-2012","abstract":"The present study aims to assess the growth of open access journals at a global level. The concept of Open Access (OA) publishing is being well received among academic circles and as a result we can see more and more scholarly content is being made these days available in open access format. The present study is simply an attempt to assess the trend and growth of open access journals during the last decade, viz. for the period 2003-2012, for which data has been retrieved from the Directory of Open Access Journals (DOAJ), which as of date hosts more than 9700 journals from 120 countries across the world covering major languages of the world. But keeping in view the period of our study the data has been retrieved as per our applicability, which as a result confines our study to 8453 journals only. The directory covers 18 main subject areas having 76 sub-disciplines, each having on average 118.53 journals. During the entire decade the number of countries which entered into OA publishing rose from 49 to 120 with a growth of 144%, and if this growth rate continues to be the same for the next five years, viz. by 2018, the world will turn into 100% open access. At the continental level Europe leads the tally by publishing a maximum of 3140 OA journals contributed by 43 countries across Europe, which again is the highest number from any continent.","authors":["Ramesh Pandita"],"meta":["September 2013Journal of Information Science Theory and Practice 1(3):47-59","DOI:10.1633/JISTaP.2013.1.3.4","Project: Open Access Movement"],"references":["249774716_Open_Access_and_Institutional_Repositories_-_A_Developing_Country_Perspective_A_case_study_of_India","235338118_OPEN_ACCESS_JOURNALS_A_GLOBAL_PERSPECTIVE","235262241_Scholarly_communication_in_the_digital_environment_The_2005_survey_of_journal_author_behaviour_and_attitudes","224930929_The_case_for_open_source_appropriate_technology","293021643_Open_access_in_India","274164493_When_is_a_journal_not_a_journal_A_closer_look_at_the_DOAJ","269518548_India's_Efforts_in_Open_Access_Publishing","250397647_Editor_Will_Quit_over_Hoax_Paper","233585187_Free_electronic_refereed_journals_Getting_past_the_arc_of_enthusiasm","221436067_Development_of_Open_Access_in_India"]}