{"id":"257715769_Explaining_failures_in_innovative_thought_processes_in_engineering_design","abstract":"The aim of this study is to explore factors causing failures in innovative thought processes in engineering design. An innovation process is here understood as a complex and multi-phased thinking and problem solving process generating new and mostly unforeseeable solutions. The phases are partly overlapping and simultaneous. This complicated nature of innovation process demands a lot from innovation management, and thus it is not unusual that innovation processes fail. Identifying problems and shortcomings is important because it helps organizations to eliminate them in the future. This study focus on thought processes of individual participants in an innovation process, which is referred by us as microinnovation approach. This approach understands innovations as being based on human thinking.This study shows that factors related to knowledge, management and interaction are causing failures in engineering design. We found haste to be the most common reason for failures. Other contributing factors were lack of long-term thinking and inability to understand others’ perspective.","authors":["Minna Pärttö","Pertti Saariluoma"],"meta":["December 2012Procedia - Social and Behavioral Sciences 41:442–449","DOI:10.1016/j.sbspro.2012.04.053"],"references":["264791639_Microinnovations_among_the_paradigms_of_innovation_research_-_what_are_the_common_ground_issues","318982647_The_Engineering_Design_Process","316172726_Untersuchungen_zur_Struktur_des_Sicherheitsproblems_von_Bauwerken","303854826_J_Social_capital_intellectual_capital_and_the_organizational_advantage","300832504_On_the_Importance_of_the_Unconscious_and_the_Cognitive_Economy_in_Design","276445732_Book_Review_The_Engineering_Design_Process","259329155_Engineering_Design_A_Systematic_Approach","258188899_The_Organic_Organization_and_Innovation","255851439_The_Economics_of_Industrial_Innovation","254080153_Normal_Accidents_Living_with_High-Risk_Technologies"]}