{"id":"257714690_A_study_to_analyze_the_effectiveness_of_audio_visual_aids_in_teaching_learning_process_at_uvniversity_level","abstract":"Audio visual aids are important in education system. Audio visual aids are those devices which are used in classrooms to encourage teaching learning process and make it easier and interesting. Audio -visual aids are the best tool for making teaching effective and the best dissemination of knowledge .So there is no doubt that technical devices have greater impact and dynamic informative system. This study designed to analyze the effectiveness of audio visual aids in teaching learning process at university level. To achieve the purpose of study two questionnaires was design as research tool separately for teachers and students. The questionnaire was administered to 150 students and 50 teachers of The Islamia University of Bahawalpur,(faculty of arts and faculty of science) Mean score was calculated to determine the empirical reaction of students and teachers on each item. The data was analyzed by using standard deviation and Z test. The findings for each statement were made. On the basis of findings, the conclusion was drawn. It was found that (i) the respondents viewed that A.V aids play important role in teaching learning process (ii) A.V aids make teaching learning process effective (iii) The respondents viewed that A.V aids provide knowledge in depth and detail (iv)It brings change in class room environment.(v)It motivates to teachers and students. On the basis of findings of study, following recommendation were made (1) Teachers may be trained for using A.V aids (2) Teachers may planning before using A.V aids (3) University may provided proper facilities of A.V aids (4) A.V aids may be according to level and interest of students.(5) Training may be provided to student for proper use of A.V aids.","authors":["Saima Rasul","Qadir Bukhsh","Shazia Batool"],"meta":["December 2011Procedia - Social and Behavioral Sciences 28:78–81","DOI:10.1016/j.sbspro.2011.11.016"],"references":["22106773_Methods_in_teaching_technology"]}