{"id":"257714749_Machine_Learning-based_Syllabus_Classification_toward_Automatic_Organization_of_Issue-oriented_Interdisciplinary_Curricula","abstract":"The purpose of this study is to organize issue-oriented interdisciplinary curricula, in which natural language processing, and machine learning-based automatic classification are combined. The recent explosion in scientific knowledge due to the rapid advancement of academia and society makes it difficult for learners and educators to recognize the overall picture of syllabus. In addition, the growing amount of interdisciplinary research makes it harder for learners to find subjects that suit their needs from the syllabi. In an attempt to present clear directions to suitable subjects, issue-oriented interdisciplinary curricula are expected to be more efficient in learning and education. However, these curricula normally require all the syllabi be manually categorized in advance, which is generally time consuming. Thus, this emphasizes the importance of developing efficient methods for (semi-) automatic syllabus classification in order to accelerate syllabus retrieval. In this paper, we introduce design and implementation of an issue-oriented automatic syllabus classification. Preliminary experiments using more than 850 engineering syllabi of the University of Tokyo show that our proposed syllabus classification system obtains sufficient accuracy.","authors":["Susumu Ota","Hideki Mima"],"meta":["December 2011Procedia - Social and Behavioral Sciences 27(2):241–247","DOI:10.1016/j.sbspro.2011.10.604"],"references":["266176521_Structuring_and_Visualizing_the_Curricula_with_MIMA_Search","228527875_An_application_and_e_aluation_of_the_CNC-value_approach_for_the_automatic_term_recognition_of_multi-word_units_in_Japanese","221604720_Feature_Selection_in_SVM_Text_Categorization","221397355_Complex_Linguistic_Features_for_Text_Classification_A_Comprehensive_Study","309056667_An_application_and_evaluation_of_the_CNC-value_approach_for_the_automatic_term_recognition_of_multi-word_units_in_Japanese","278651717_The_Nature_of_Statistical_Learning_Theory","270106065_Structuring_and_Visualising_the_Engineering_Knowledge_-Basic_Principles_Methods_and_the_Application_to_the_UT's_Engineering_Curriculum","245914499_Developments_in_Automatic_Text_Retrieval_Science","243763580_The_Nature_Of_Statistical_Learning_Theory","221997066_The_Nature_of_Satistical_Learning_Theory"]}