{"id":"257717666_Information_System_Acceptance_and_User_Satisfaction_The_Mediating_Role_of_Trust","abstract":"Satisfying users is one of the crucial objectives of information system success. In addition, trust has been found as an important factor in information system studies. Although a large amount of research have been conducted to investigate and evaluate information system satisfaction, the role of trust that mediates the relationship between satisfaction and its acceptance antecedence still requires a close attention. This paper examines the role of trust that mediates the relationship between information system acceptance and user satisfaction. Selected domains from the past models are adapted and integrated with theoretical findings from prior IS satisfaction research to theorize a model of trust and satisfaction. Six hypotheses are derived and empirically validated. Findings of the study suggest ease of learning is related to ease of use; ease of use and information quality are the determinants of trust; and trust mediates the acceptance and satisfaction relationship. This study draws substantive attention to the requirement of understanding trust as a mediating variable in an information system context.","authors":["Erne Suzila Kassim","Sri Fatiany Abdul Kader Jailani","Hanitahaiza Hairuddin","Norol Hamiza Zamzuri"],"meta":["October 2012Procedia - Social and Behavioral Sciences 57:412–418","DOI:10.1016/j.sbspro.2012.09.1205"],"references":["281274059_The_moderator-mediator_variable_distinction_in_social_psychological_research_Conceptual_strategic_and_statistical_considerations","257693538_Using_hybrid_method_to_evaluate_the_green_performance_in_uncertainty","313744794_Alternative_ways_of_assessing_model_fit","289963269_Re-Examining_Perceived_Ease_of_Use_and_Usefulness_A_Confirmatory_Factor_Analysis","285740962_The_art_of_writing_a_scientific_article","284775089_How_to_prepare_an_electronic_version_of_your_article","284314659_An_empirical_evaluation_of_user_information_satisfaction_UIS_measures_for_use_with_general_ledger_accounting_software","255721476_The_Elements_of_Style","239666604_Alternative_Ways_of_Assessing_Model_Fit","235913760_Alternative_Ways_of_Assessing_Model_Fit"]}