{"id":"257714412_Academic_Performance_and_Perceived_Employability_of_Graduate_Students_in_Business_and_Management_-_An_Analysis_of_Nationwide_Graduate_Destination_Survey","abstract":"Employability denotes skills and attributes that make an individual desirable to potential employers. Owing to the dramatic increase in enrollment rate of higher education, a diploma is no longer a guarantee of employment and higher education institutes are expected to equip students with employability skills and attributes. However, the mandatory inclusion of employability skills and attributes in higher education has provoked considerable debate and controversy. Although the connection between employability and employment is well-documented, it is not clear whether employability skills have potential impacts on academic performance of graduate students. This study investigated the relationship between academic publication and perceived employability of graduate students in business and management by analyzing data from Graduate Destination Survey (GDS) in Taiwan. Of the 6,876 graduate students in business and management responding to the survey, 2,015 (29.3%) and 508 (7.4%) of them submitted at least one conference paper or peer-reviewed journal article, respectively. Logistic regression was used to evaluate the associations between paper/article submission and perceived employability of graduate students, controlled for student attributes. The findings suggest that 4 employability skills are significantly associated with academic publication of graduate students, including “foreign language ability”, “computer literacy”, “application of theory to work”, and “stability and pressure resistance”. All control factors, including “school type”, “gender”, “entrance exam for graduate school”, “years in graduate school”, “full-time student”, and “participation in academic community”, have significantly connection with academic publication. The results imply that employability is not only associated with employment processes but also related to academic publication of graduate students and provide insights into the potential benefits of enhancing employability to both students and universities.","authors":["Ying-Ju Pan","Lung-Sheng Lee"],"meta":["December 2011Procedia - Social and Behavioral Sciences 25(4):91–103","DOI:10.1016/j.sbspro.2011.10.531"],"references":["263155623_Graduate_Employability_'Soft_Skills'_Versus_'Hard'_Business_Knowledge_A_European_Study","257693538_Using_hybrid_method_to_evaluate_the_green_performance_in_uncertainty","254158380_Establishing_a_group_to_encourage_writing_for_publication_among_doctoral_students","248966390_'Becoming_and_being_writers'_The_experiences_of_doctoral_students_in_writing_groups","242710319_Bringing_pedagogy_to_doctoral_publishing","272930539_Academic_Writing_for_Graduate_Students_Essential_Tasks_and_Skills","248963151_Researching_Academic_Writing_within_a_Structured_Programme_Insights_and_outcomes","248963122_Getting_a_GRiP_Examining_the_outcomes_of_a_pilot_program_to_support_graduate_research_students_in_writing_for_publication","240531613_Disciplining_writing_The_case_for_multi-disciplinary_writing_groups_to_support_writing_for_publication_by_higher_degree_by_research_candidates_in_the_humanities_arts_and_social_sciences","239667902_Academic_Writing_for_Graduate_Students"]}