{"id":"257879758_Compressive_sampling_of_swallowing_accelerometry_signals_using_time-frequency_dictionaries_based_on_modulated_discrete_prolate_spheroidal_sequences","abstract":"Monitoring physiological functions such as swallowing often generates large volumes of samples to be stored and processed, which can introduce computational constraints especially if remote monitoring is desired. In this article, we propose a compressive sensing (CS) algorithm to alleviate some of these issues while acquiring dual-axis swallowing accelerometry signals. The proposed CS approach uses a time-frequency dictionary where the members are modulated discrete prolate spheroidal sequences (MDPSS). These waveforms are obtained by modulation and variation of discrete prolate spheroidal sequences (DPSS) in order to reflect the time-varying nature of swallowing acclerometry signals. While the modulated bases permit one to represent the signal behavior accurately, the matching pursuit algorithm is adopted to iteratively decompose the signals into an expansion of the dictionary bases. To test the accuracy of the proposed scheme, we carried out several numerical experiments with synthetic test signals and dual-axis swallowing accelerometry signals. In both cases, the proposed CS approach based on the MDPSS yields more accurate representations than the CS approach based on DPSS. Specifically, we show that dual-axis swallowing accelerometry signals can be accurately reconstructed even when the sampling rate is reduced to half of the Nyquist rate. The results clearly indicate that the MDPSS are suitable bases for swallowing accelerometry signals.","authors":["Ervin Sejdic","Azime Can-Cimino","Luis F. Chaparro","Catriona M Steele"],"meta":["March 2012EURASIP Journal on Advances in Signal Processing 2012(1)","DOI:10.1186/1687-6180-2012-101"],"references":["228858651_Successive_Slepian_subspace_projection_in_time_and_frequency_for_time-variant_channel_estimation","228467487_Dysphagia_service_delivery_by_speech-language_pathologists_in_Canada_Results_of_a_national_survey","274368955_Complications_and_Outcome_After_Acute_Stroke_Does_Dysphagia_Matter","273037731_Evaluation_and_Treatment_of_Swallow_Disorders","271942601_Treatment_of_swallowing_disorders_through_a_multidisciplinary_team_approach","261053603_Fractal_analysis_of_acceleration_signals_due_to_swallowing","257941844_Introduction_to_Compressive_Sampling","243766442_Errata_Use_of_Ranks_in_One-Criterion_Variance_Analysis","224697688_Spectral_analysis_of_acceleration_signals_during_swallowing_and_coughing","224697004_Neural_networks_for_recognition_of_acceleration_patterns_during_swallowing_and_coughing"]}