{"id":"257909948_A_powerful_and_efficient_evolutionary_optimization_algorithm_based_on_stem_cells_algorithm_for_data_clustering","abstract":"There are many ways to divide datasets into some clusters. One of most popular data clustering algorithms is K-means algorithm which uses the distance criteria for measuring the data correlation. To do that, we should know in advance the number of classes (K) and choose K data points as an initial set to run the algorithm. However, the choice of initial points is a main problem in this algorithm which may cause the algorithm to converge to a local minimum. Some other data clustering algorithms have been proposed to overcome this problem. The methods are Genetic algorithm (GA), Ant Colony Optimization (ACO), PSO algorithm, and ABC algorithms. In this paper, we employ the Stem Cells Optimization algorithm for data clustering. The algorithm was inspired by behavior of natural stem cells in the human body. We developed a new data clustering based on this new optimization scheme which has the advantages such as high convergence rate and easy implementation process. It also avoids local minimums in an intelligent manner. The experimental results obtained by using the new algorithm on different well-known test datasets compared with those obtained using other mentioned methods demonstrate the better accuracy and high speed of the new algorithm.","authors":["Mohammad Taherdangkoo","Mehran Yazdi","Mohammad Hadi Bagheri"],"meta":["March 2012Central European Journal of Computer Science 2(1)","DOI:10.2478/s13537-012-0002-z"],"references":["242623360_Cytological_demonstration_of_the_clonal_nature_of_spleen_colonies_derived_from_transplanted_mouse_marrow_cells","226709814_Swarm_Intelligence_Algorithms_for_Data_Clustering","339016441_Power_Quality_Disturbance_Classification_Using_Fuzzy_C-Means_Algorithm_and_Adaptive_Particle_Swarm_Optimization","312937298_The_distribution_of_colony-forming_cells_among_spleen_colonies","261524068_Segmentation_of_MR_brain_images_using_FCM_improved_by_artificial_bee_colony_ABC_algorithm","244104891_An_ant_colony_approach_for_clustering","239406594_Clustering_techniques_and_their_applications_in_engineering","225857548_Comparison_between_K-Means_and_K-Medoids_Clustering_Algorithms","225432958_Genetic_Algorithm-Based_Text_Clustering_Technique","224320299_Power_Quality_Disturbance_Classification_Using_Fuzzy_C-Means_Algorithm_and_Adaptive_Particle_Swarm_Optimization"]}