{"id":"257945102_A_Novel_Web-based_Human_Advisor_Fuzzy_Expert_System","abstract":"The applications of the Internet-based technologies and the concepts of fuzzy expert systems (FES) have created new methods for sharing and distributing knowledge. However, there has been a general lack of investigation in the area of web-based fuzzy expert systems. In this paper, the issues associated with the design, development, and use of web-based applications from a standpoint of the benefits and challenges of development and utilization are investigated. The original theory and concepts in conventional FES are reviewed and a knowledge engineering framework for developing such systems is revised. For a human advisor to have a satisfying performance, expertise is a must. In addition, some of advisory rules are subject to change because of domain knowledge update. The human requests may have linguistic or crisp forms and a conventional expert system (ES) is not able to overcome the fuzziness in the problem nature. In this research, a Web-based fuzzy expert system for Common Human Advisor (FES-CHA) is developed and implemented to be used as a student advisor at the department‘s web portal. The system is implemented by using Microsoft Visual Studio .NET 2010, MVC and Microsoft SQL Server 2012.","authors":["Vahid Rafe"],"meta":["February 2013Journal of Applied Research and Technology 11(1)","DOI:10.1016/S1665-6423(13)71525-6"],"references":["267206278_A_Fuzzy_Expert_System_Architecture_for_Intelligent_Tutoring_Systems_A_Cognitive_Mapping_Approach","266462083_Educational_Advisor_System_Implemented_by_Web-Based_Fuzzy_Expert_Systems","257636157_Student_achievement_and_education_system_performance_in_a_developing_country","236951314_A_Fuzzy-Based_Advisor_for_Elections_and_the_Creation_of_Political_Communities","221087598_Evaluating_Students'_Learning_Progress_by_Using_Fuzzy_Inference_System","284771980_A_web-based_implementation_of_a_portfolio_advisor_system_based_on_fuzzy_expert_systems","277287593_Web_Based_Fuzzy_Expert_System_for_Integrated_Pest_Management_in_Soybean","220216377_An_intelligent_human-expert_forum_system_based_on_fuzzy_information_retrieval_technique","23794484_Design_and_development_of_a_fuzzy_expert_system_for_hotel_selection"]}