{"id":"258010206_Teaching_Computer_Science_to_Young_Children_through_Creativity_Lessons_Learned_from_the_Case_of_Norway","abstract":"Computer science education often faces problems related to passive teaching and curricular constraints. These problems distort the students' perception of computer science and thus lead to lack of interest in the curriculum and in related professions. The main goals of the project reported in this paper are (1) to excite and motivate students in computer science through creative activities, and (2) to introduce the idea of becoming creators of digital media through programming instead of remaining passive learners. Based on the above goals, we conducted field studies, collected data through student interviews, qualitatively analyzed the data and summarized the lessons learned through the project. Specifically, a group of researchers and artists designed and implemented two 2-day workshops involving a total of 29 students, exploring their experiences with the program. The workshops were based on the open source software Scratch, as well as the creative use of recycled materials. The qualitative approach of the research is based on data collected through interviews, photos, and observations. The results showed that: (a) the participants regarded the workshop as an overall positive experience, (b) creativity is an excellent means to promote and teach programming, and (c) a workshop approach raises interest in computer science among female students in particular.","authors":["Michail Giannakos","Letizia Jaccheri","Roberta Proto"],"meta":["January 2013","Conference: In Computer Science Education Research Conference"],"references":["254006843_Toward_an_emergent_theory_of_broadening_participation_in_computer_science_education","234820368_The_Scratch_Programming_Language_and_Environment","233869619_Computer_Scienceinformatics_in_secondary_education","228405788_Alice_A_3-D_tool_for_introductory_programming_concepts","221537427_Renaissance_computing_An_initiative_for_promoting_student_participation_in_computing","311473376_Unlocking_the_clubhouse_women_in_computing","247924649_Enjoying_Python_processing_and_Java_in_CS1","229036418_Exploring_careers_while_learning_Alice_3D_a_summer_camp_for_middle_school_girls","221537619_Alice_middle_schoolers_the_imaginary_worlds_camps","221537527_Gr8_designs_for_Gr8_girls_a_middle-school_program_and_its_evaluation"]}