{"id":"258048710_Bullying_in_School_and_Violence_on_the_Streets_Are_the_Same_People_Involved","abstract":"Two ideas concerning the link between bullying in school and violence on the streets are investigated. (1) Bullying and victimization in school is a product of the school situation and people's inability to choose their levels of exposure to others. According to this hypothesis, bullying is largely a phenomenon that is isolated to the school context. (II) Bullying behaviour in school and inflicting damage to others outside school is a reflection of a more general aggressive behaviour pattern and, hence, bullying in school and violence on the streets will, to a great extent, involve the same individuals. The literature offers suggestions that either could be the case. Participants were 2915 14-year-olds in a medium-sized county in Sweden who responded to a self-report questionnaire.Theresults showed that bullying others in school was strongly linked to violent behaviour and weapon-carrying on the streets, both among boys and girls. It was also found that bullying others in school was related to being violently victimized on the streets. The findings remained the same when statistically controlling for loitering and nights spent away from home, which were both related to bullying behaviour. It is concluded that bullying behaviour in school is in many cases a part of a more general violent and aggressive behaviour pattern and that preventive efforts targeting individuals with bullying behaviour in school could, according to the present study, decrease violence among adolescents out in the community as well.","authors":["Henrik Andershed","Margaret Kerr","Hakan Stattin"],"meta":["January 2001Journal of Scandinavian Studies in Criminology and Crime Prevention 2(1):31-49","DOI:10.1080/140438501317205538"],"references":["272160328_The_Nature_of_School_Bullying_A_Cross_National_Perspective","258031967_Violence_at_school_Recent_evidence_from_four_national_surveys","321605236_Cross-National_Research_in_Self-Reported_Crime_and_Delinquency","295608960_The_contribution_of_bullying_at_school_and_low_self-esteem_to_acts_of_delinquency_among_Australian_teenagers","280887431_Victims_of_Peer_Aggression","249719343_Perceived_Family_Relationships_of_Bullies_Victims_and_BullyVictims_in_Middle_Childhood","247718308_Bullying_among_Italian_Middle_School_Students_Combining_Methods_to_Understand_Aggressive_Behaviours_and_Victimization","247230774_Predictors_Causes_and_Correlates_of_Male_Youth_Violence","240174411_The_contributions_of_bullying_and_low_self-esteem_to_acts_of_delinquency_among_Australian_teenagers","232953897_Bullying_A_Preliminary_Investigation_of_its_Nature_and_the_Effects_of_Social_Cognition"]}