{"id":"258149535_Game-Console-Based_Projects_for_Learning_the_Computer_InputOutput_Subsystem","abstract":"The input/output (I/O) subsystem is an important topic within computer architecture (CA) because it determines how the computer interacts with its environment. For this reason, computer scientists and engineers must understand how the computer manages this interaction, which is usually taught in introductory CA courses. Of course, there are many different styles of teaching, ranging from purely theoretical to completely practical. The CA course considered in this paper has already applied a practical approach for some time. For the I/O subsystem, students must be able to describe what polling and interrupts are and handle them through low-level programming. However, programming at this level in operating system (OS)-driven computers is not possible without being familiar with the kernel and drivers, which is not usually the case for students in an introductory course. Fortunately, there are many bare and specialized embedded systems around that are not OS-driven. In this proposal, the Nintendo DS (NDS) console was used in a classroom setting. It proved to be an appropriate infrastructure for developing attractive and engaging projects and was useful in providing a better understanding of the mechanisms related to the I/O subsystem. At the same time, the teaching methods were altered to make the transition from classical, passive, lecture-based classes to an active project-based learning (PBL) approach. It has been a very rewarding experience to see students learning to control the NDS devices on their own. In addition to describing the implementation of the proposed changes in two subsequent school years, this paper also presents some data and conclusions.","authors":["Edurne Larraza-Mendiluze","Nestor Garay-Vitoria","Jose Ignacio Martín","Javier Muguerza"],"meta":["November 2013IEEE Transactions on Education 56(4):453-458","DOI:10.1109/TE.2013.2255877"],"references":["268381334_SimMips_A_MIPS_System_Simulator","257939742_The_Learning_Outcomes_of_the_Exam_Question_in_the_InputOutput_Topic_in_Computer_Architecture","233903658_A_comparison_between_lecturers'_and_students'_concept_maps_related_to_the_inputoutput_topic_in_computer_architecture","232990269_From_Archi_Torture_to_architecture_Undergraduate_students_design_and_implement_computers_using_the_Multimedia_Logic_emulator","228977043_Games_as_Motivation_in_Computer_Design_Courses_IO_is_the_Key","228579320_Project_Based_Learning_of_Embedded_Systems","228368132_Applying_Multiplayer_Role-Based_Learning_in_Engineering_Education_Three_Case_Studies_to_Analyze_the_Impact_on_Students'_Performance","234789679_Use_of_a_simulator_and_an_assembler_in_teaching_input-output_processing_and_interrupt_handling","232656251_A_Tool_for_Teaching_and_Research_on_Computer_Architecture_and_Reconfigurable_Systems","228884764_A_full_system_x86_simulator_for_teaching_computer_organization"]}