{"id":"258104160_Cancer_Control_in_Bangladesh","abstract":"Cancer is predicted to be an increasingly important cause of morbidity and mortality in Bangladesh in the next few decades. The estimated incidence of 12.7 million new cancer cases will rise to 21.4 million by 2030. More than two-thirds of the total expenditure on health is through out-of-pocket payments. According to the Bangladesh Bureau of Statistics, cancer is the sixth leading cause of death. International Agency for Research on Cancer has estimated cancer-related death rates in Bangladesh to be 7.5% in 2005 and 13% in 2030. The two leading causes are in males are lung and oral cancer and in females are breast cancer and cervical cancer. Bangladesh is now in severe shortage of radiation therapy machines, hospital bed, trained oncologists, medical radiation physicists and technologists. Bangladesh having different cancers associated with smoking and smokeless tobacco use, Human papilloma virus infection, Hepatitis B and C infection, Helicobacter Pylori infection, arsenic contaminated groundwater, availability of chemical carcinogens mainly formalin treated fruits, fish and vegetables at open market, tannery waste contaminated with chromium (which is used for poultry feed and fish feed preparation). A World Health Organization study revealed the annual cost of illnesses in Bangladesh attributable to tobacco usage is US$ 500 million and the total annual benefit from the tobacco sector is US$ 305 million as tax revenue. Bangladesh has developed a National Cancer Control Strategy and Action Plan with the aim of delivering a universal, quality-based and timely service. Cancer prevention through tobacco control, health promotion and vaccination program, cancer early detection program for oral cavity, breast and cervix has initiated. Cancer detection and diagnostic facilities will be made available at medical colleges and district- hospitals and establish a referral chain. National capacity development, more cancer research will allow Bangladesh to deal effectively and efficiently with the cancer problems through evidence-based decision making.","authors":["Syed Md Akram Hussain","Richard Sullivan"],"meta":["October 2013Japanese Journal of Clinical Oncology 43(12)","DOI:10.1093/jjco/hyt140","SourcePubMed"],"references":["287866925_Food_safety_and_public_health_issues_in_bangladesh_A_regulatory_concern","259880320_A_fresh_look_at_oncology_facts_on_south_central_Asia_and_SAARC_countries","257746557_Hepatitis_B_virus_related_hepatocellular_carcinoma_is_the_predominant_cause_of_liver_cancer_in_Bangladesh","236263859_Population_Dynamics_in_Bangladesh_A_case_study_on_the_causes_and_effects_of_demographic_change_in_Bangladesh","236231315_Hexavalent_Chromium_in_Tannery_Solid_Waste_Based_Poultry_Feed_in_Bangladesh_and_Its_Transfer_to_Food_Chain","51920753_Safety_and_Immunogenicity_Profile_of_Human_Papillomavirus-1618_AS04_Adjuvant_Cervical_Cancer_Vaccine_A_Randomized_Controlled_Trial_in_Healthy_Adolescent_Girls_of_Bangladesh","12305245_Smith_AH_Lingas_EO_Rahman_M_Contamination_of_Drinking_Water_by_Arsenic_in_Bangladesh_A_Public_Health_Emergency_Bulletin_of_the_World_Health_Organization_78_1093-1103","291800004_Contamination_of_drinking_water_by_arsenic_in_Bangladesh_A_public_health_emergency","258106840_Structure_of_the_heparin_macromonomer_and_features_of_its_radical_polymerization","244942182_Histopathologic_Pattern_of_Gastric_Cancer_in_Bangladesh","242119677_Climate_change_and_its_impact_on_health_in_Bangladesh","14379066_Seroepidemiological_study_of_Epstein-Barr_virus_infection_in_Bangladesh"]}