{"id":"258166634_Using_Technology_to_Increase_Parent_Involvement_in_Schools","abstract":"The importance of parent involvement in Parents who monitor their student’s schoolwork and daily activities, communicate frequently with teachers and help develop schools and its relationship to student achievement have been widely studied. Nevertheless, many principals and teachers report that lack of parent involvement continues to be an obstacle to increasing student achievement at school. The purpose of this study was to determine whether emerging technologies facilitate better parent-teacher communication and parent involvement. Data were collected through surveys and semi-structured focus group interviews to analyze the relationship between parents’ and teachers’ perceptions of student achievement when electronic communications are used between parents and school. The study revealed that parents and teachers both place a high value on proactive parent involvement. Because proactive involvement does not require parents to be physically at their children’s school, the question of how technology can be used to keep parents involved in their children’s academic lives becomes important. As access to technology continues to expand, the capabilities for connecting parents to schools will continue to grow. As schools invest in websites, phone calling systems, parent portals, online curriculum, and other types of technologies that connect schools to home, research needs to continue to focus on the effectiveness of these technologies to increase parent involvement.","authors":["Christine Olmstead"],"meta":["November 2013TechTrends 57(6)","DOI:10.1007/s11528-013-0699-0"],"references":["238728797_A_New_Wave_of_Evidence_The_Impact_of_School_Family_and_Community_Connections_on_Student_Achievement","221900447_Learning_to_Learn_with_parents_Lessons_from_two_research_projects","317953561_Mind_in_society_The_development_of_higher_psychological_processes","316823281_Self-efficacy_the_exercise_of_control","249797703_Why_Do_Parents_Become_Involved_in_Their_Children's_Education","238435506_What_Do_School_Principals_Think_About_Current_School-Family_Relationships","233896835_Home_and_school_connections_in_schools_of_the_future_Implications_of_research_on_parent_involvement","232499962_School_family_and_community_partnerships_Your_handbook_for_action_2nd_ed","229068345_Self-Efficacy_The_Exercise_of_Control","229068230_Mind_in_society_The_development_of_higher_mental_processes","228396874_Parental_involvement_in_children's_education_Connecting_family_and_school_by_using_telecommunication_technologies"]}