{"id":"258188013_Adverb_Placement_in_Second_Language_Acquisition_Some_Effects_of_Positive_and_Negative_Evidence_in_the_Classroom","abstract":"This paper focuses on a parametric difference between French and English, namely the issue of whether or not the language allows verb movement. The lack of verb-raising in English causes a potential learnability problem for francophones, as far as English adverb placement is concerned. In particular, an adverb in English is not allowed to interrupt a verb and its direct object, in contrast to French. It is argued in this paper that form-focused classroom instruction, including negative evidence, is more effective in helping L2 learners to arrive at the appropriate properties of English than positive input alone. An experimental study on the effectiveness of teaching adverb placement was conducted with I 1 and 12 year-old francophone learners of English. One group (n = 82) was explicitly instructed on adverb placement, and another on ques tion formation (n = 56). Subjects were tested on a variety of tasks relating to adverb placement; they were pretested, and post-tested twice, immediately after the instructional period, and again five weeks later. Some of the subjects were followed up a year after the original testing. Results show significant differences between the two groups: only the group that received positive and negative evidence that was specifically oriented towards adverb placement came to know that adverbs may not interrupt the verb and object. The results from the follow up, however, suggest that this knowledge is not retained in the long-term.","authors":["Lydia White"],"meta":["June 1991Second language Research 7(2):133-161","DOI:10.1177/026765839100700205"],"references":["240412239_The_Logical_Problem_of_Foreign_Language_Learning","349691594_A_Unified_Theory_of_Syntactic_Categories","346450280_Universal_Grammar_and_Second_Language_Acquisition","329651064_The_Acquisition_of_Syntactic_Knowledge","273245221_ForeignSecond_Language_Pedagogy_Research_A_Commemorative_Volume_for_Claus_Faerch","245121331_A_Transformational_Approach_to_English_Syntax","243762953_A_Unified_Theory_of_Syntactic_Categories","243651441_Some_Notes_on_Economy_of_Derivation_and_Representation","239667473_The_verbal_complex_V'-V_in_French","239063272_Verb_Movement_Universal_Grammar_and_the_Structure_of_IP","239059761_Parameters_and_Learnability_in_Binding_Theory","239020030_Formal_Principles_of_Language_Acquisition","231925550_The_child's_trigger_experience_Degree-0_learnability","231844316_Down_the_Garden_Path_Inducing_and_correcting_overgeneralization_errors_in_the_foreign_language_classroom","231747057_Second_Language_Acquisition_and_Universal_Grammar","36962072_Semantic_interpretation_in_generative_grammar","31368853_Input_Enhancement_and_L2_Question_Formation","31252666_Second_Language_Acquisition_and_Its_Relationship_to_Universal_Grammar"]}