{"id":"258111954_An_adaptation_algorithm_for_an_intelligent_natural_language_tutoring_system","abstract":"The focus of computerised learning has shifted from content delivery towards personalised online learning with Intelligent Tutoring Systems (ITS). Oscar Conversational ITS (CITS) is a sophisticated ITS that uses a natural language interface to enable learners to construct their own knowledge through discussion. Oscar CITS aims to mimic a human tutor by dynamically detecting and adapting to an individual's learning styles whilst directing the conversational tutorial. Oscar CITS is currently live and being successfully used to support learning by university students. The major contribution of this paper is the development of the novel Oscar CITS adaptation algorithm and its application to the Felder–Silverman learning styles model. The generic Oscar CITS adaptation algorithm uniquely combines the strength of an individual's learning style preference with the available adaptive tutoring material for each tutorial question to decide the best fitting adaptation. A case study is described, where Oscar CITS is implemented to deliver an adaptive SQL tutorial. Two experiments are reported which empirically test the Oscar CITS adaptation algorithm with students in a real teaching/learning environment. The results show that learners experiencing a conversational tutorial personalised to their learning styles performed significantly better during the tutorial than those with an unmatched tutorial.","authors":["Annabel Latham","Keeley Crockett","David McLean"],"meta":["February 2014Computers & Education 71(1):97-110","DOI:10.1016/j.compedu.2013.09.014","Project: Oscar Conversational Intelligent Tutoring System"],"references":["318232959_Learning_from_human_tutoring","312470401_Learningteaching_styles_in_engineering_education","264224326_Understanding_Student_Differences","257431200_Learning_and_Teaching_Styles_in_Engineering_Education","247112557_The_impact_of_a_Technology-based_Mathematics_After-school_Program_using_ALEKS_on_Student's_Knowledge_and_Behaviors","247087653_Testing_the_ATI_hypothesis_Should_multimedia_instruction_accommodate_verbalizer-visualizer_cognitive_style","237439677_The_Case_for_Social_Agency_in_Computer-Based_Teaching_Do_Students_Learn_More_Deeply_When_They_Interact_With_Animated_Pedagogical_Agents","262328406_High_Relevance_Keyword_Extraction_facility_for_Bayesian_text_classification_on_different_domains_of_varying_characteristic","246670283_Learning_Styles_And_Pedagogy_In_Post-16_Learning_A_Systematic_And_Critical_Review","239545795_The_case_for_social_agency_in_computer-based_teaching_Do_students_learn_more_deeply_when_they_interact_with_animated_pedagogical_agents"]}