{"id":"258110393_Automating_Skin_Disease_Diagnosis_Using_Image_Classification","abstract":"There have been many attempts to implement traditional telemedicine across the world especially in the developing countries, but the efforts has been characterized with challenges such as high-cost of sustaining telemedicine solutions and non-availability of medical expertise. Cancerous Skin disease such as melanoma and nevi typically results from environmental factors (such as exposure to sunlight) among other causes. The necessary tools needed for early detection of these diseases are still not a reality in most African communities. In recent years, there have been high expectations for techniques such as Dermoscopy or Epiluminiscence Light Microscopy (ELM) in aiding diagnosis; however evaluation of pigmented skin lesions using ELM is not only non-affordable by most of African communities but also complex and highly subjective, thus motivating researches in diagnosis automation. This study would focus on designing and modeling a system that will collate past Pigmented Skin Lesion (PSL) image results, their analysis, corresponding observations and conclusions by medical experts using prototyping methodology. These wealth of information would be used as a library. A part of the system would use computational intelligence technique to analyze, process, and classify the image library data based on texture and possibly morphological features of the images. Trained medical personnel in a remote location can use mobile data acquisition devices (such as cell phone) to generate images of PSL, supply such images as input to the proposed system, which in turns should intelligently be able to specify the malignancy (life-threatening) or benign (non-threatening) status of the imaged PSL.","authors":["Damilola Okuboyejo","Oludayo Olugbara","Solomon Odunaike"],"meta":["October 2013","Conference: International Conference in Modeling Health Advances 2013 ( ICMHA ), IAENGAt: San Francisco, California, USA","Project: Automating Skin Disease Diagnosis Using Image Classification"],"references":["260563625_2011_Automated_Detection_of_Skin_Diseases_using_Texture_Features","258651204_Automatic_Detection_of_Melanoma_Skin_Cancer_using_Texture_Analysis","26889335_Lacunarity_Analysis_A_Promising_Method_for_the_Automated_Assessment_of_Melanocytic_Naevi_and_Melanoma","26743604_Definition_of_an_automated_Content-Based_Image_Retrieval_CBIR_system_for_the_comparison_of_dermoscopic_images_of_pigmented_skin_lesions","26453369_A_prelimary_approach_for_the_automated_recognition_of_malignant_melanoma","7435767_Computer-aided_diagnosis_of_melanocytic_lesions","5406640_A_New_Concept_for_Medical_Imaging_Centered_on_Cellular_Phone_Technology","289186447_A_hierarchical_content-based_image_retrieval_approach_to_assisting_decision_support_in_clinical_dermatology","289088277_Dermatoscopy_of_pigmented_skin_lesions","284114556_Primary_malignant_melanoma_of_the_skin_The_call_for_action_to_identify_persons_at_risk_to_discover_precursor_lesions_to_detect_early_melanomas","14894615_An_evaluation_of_the_revised_seven-point_checklist_for_the_early_diagnosis_of_cutaneous_malignant_melanoma","10695804_A_fuzzy-based_histogram_analysis_technique_for_skin_lesion_discrimination_in_dermatology_clinical_images"]}