{"id":"258277822_Implementations_of_the_Monte_Carlo_EM_Algorithm","abstract":"The Monte Carlo EM (MCEM) algorithm is a modification of the EM algorithm where the expectation in the E-step is computed numerically through Monte Carlo simulations. The most flexible and generally applicable approach to obtaining a Monte Carlo sample in each iteration of an MCEM algorithm is through Markov chain Monte Carlo (MCMC) routines such as the Gibbs and Metropolis-Hastings samplers. Although MCMC estimation presents a tractable solution to problems where the E-step is not available in closed form, two issues arise when implementing this MCEM routine: (1) how do we minimize the computational cost in obtaining an MCMC sample? and (2) how do we choose the Monte Carlo sample size? We address the first question through an application of importance sampling whereby samples drawn during previous EM iterations are recycled rather than running an MCMC sampler each MCEM iteration. The second question is addressed through an application of regenerative simulation. We obtain approximate independent and identical samples by subsampling the generated MCMC sample during different renewal periods. Standard central limit theorems may thus be used to gauge Monte Carlo error. In particular, we apply an automated rule for increasing the Monte Carlo sample size when the Monte Carlo error overwhelms the EM estimate at any given iteration. We illustrate our MCEM algorithm through analyses of two datasets fit by generalized linear mixed models. As a part of these applications, we demonstrate the improvement in computational cost and efficiency of our routine over alternative MCEM strategies. © 2001 American Statistical Association, Institute of Mathematical Statistics, and Interface Foundation of North America.","authors":["Richard A Levine","George Casella"],"meta":["January 2001Journal of Computational and Graphical Statistics 10(3):422-439"],"references":["271513114_Convergence_Controls_for_MCMC_Algorithms_with_Applications_to_Hidden_Markov_Chains","5066744_Post-Processing_Accept-Reject_Samples_Recycling_and_Rescaling"]}