{"id":"258220733_Teaching_Logic_through_Web-Based_and_Gamified_Quizzing_of_Formal_Arguments","abstract":"In this paper the focus is on the construction, use, pedagogical potential, and long-term sustainability of certain web-based tools designed for teaching logic. A series of web-based tools have been implemented as a two-part system, and the tools have been tested and evaluated in a number of practical experiments. The first part of the system is a student-facing Java-Applet running in the student’s browser, implemented using the Prolog programming language as embodied in a Java implementation called Prolog+CG. The second part is a teacher-oriented, server-based backend for logging the progress of students. In the paper, we provide a presentation of the pedagogical and technical ideas of construction that underpin the tools which have been made so far. It is explained how the tools can be developed as web applications using gamified quizzing. We then provide an evaluation of the potential of log data as learning analytics offered by these tools in the context of university courses introducing basic logic and formal aspects of argumentation. We also describe how we have used and evaluated the tools in a real learning context, using both quantitative, log-based data and qualitative interview. The evaluation also includes a discussion of the ethical aspects concerning the logging of student data. We also provide some insights on how the tools can and have been made sustainable.","authors":["Peter Øhrstrøm","Ulrik Sandborg-Petersen","Steinar Thorvaldsen","Thomas Ploug"],"meta":["September 2013Lecture Notes in Computer Science 8095:410-423","DOI:10.1007/978-3-642-40814-4_32","Conference: European Conference on Technology Enhanced Learning","Project: Syllogistics and Logic Teaching"],"references":["258220738_Classical_Syllogisms_in_Logic_Teaching","239526993_From_boring_to_scoring-A_collaborative_serious_game_for_learning_and_practicing_mathematical_logic_for_computer_science_education","228559299_What_the_Student_Does_teaching_for_enhanced_learning","225365101_The_Effects_of_Informational_Complexity_and_Working_Memory_on_Problem-Solving_Efficiency","221648993_Uses_Improvements_and_Extensions_of_PrologCG_Case_Studies","263575752_PrologCG_A_Maintainer's_Perspective","263154838_Syllogistic_Reasoning_Tasks_Working_Memory_and_Skill","221648939_From_PROLOG_to_PROLOGCG_A_CG_Object-Oriented_Logic_Programming_Language","220691704_The_Cathedral_the_Bazaar_Musings_on_Linux_and_Open_Source_by_an_Accidental_Revolutionary","220480257_Strategies_in_Syllogistic_Reasoning","200022405_Moodle_Using_Learning_Communities_to_Create_an_Open_Source_Course_Management_System","16654955_Syllogistic_Inference"]}