{"id":"258279081_Dynamic_Network_Formation_with_Incomplete_Information","abstract":"How do networks form and what is their ultimate topology? Most of the\nliterature that addresses these questions assumes complete information: agents\nknow in advance the value of linking to other agents, even with agents they\nhave never met and with whom they have had no previous interaction (direct or\nindirect). This paper addresses the same questions under what seems to us to be\nthe much more natural assumption of incomplete information: agents do not know\nin advance -- but must learn -- the value of linking to agents they have never\nmet. We show that the assumption of incomplete information has profound\nimplications for the process of network formation and the topology of networks\nthat ultimately form. Under complete information, the networks that form and\nare stable typically have a star, wheel or core-periphery form, with high-value\nagents in the core. Under incomplete information, the presence of positive\nexternalities (the value of indirect links) implies that a much wider\ncollection of network topologies can emerge and be stable. Moreover, even when\nthe topologies that emerge are the same, the locations of agents can be very\ndifferent. For instance, when information is incomplete, it is possible for a\nhub-and-spokes network with a low-value agent in the center to form and endure\npermanently: an agent can achieve a central position purely as the result of\nchance rather than as the result of merit. Perhaps even more strikingly: when\ninformation is incomplete, a connected network could form and persist even if,\nwhen information were complete, no links would ever form, so that the final\nform would be a totally disconnected network. All of this can occur even in\nsettings where agents eventually learn everything so that information, although\ninitially incomplete, eventually becomes complete.","authors":["Yangbo Song","Mihaela van der Schaar"],"meta":["November 2013Economic Theory 59(2)","DOI:10.1007/s00199-015-0858-y","SourcearXiv"],"references":["266564273_Nestedness_in_networks_A_theoretical_model_and_some_applications","314450247_A_Structural_Model_of_Segregation_in_Social_Networks","283617653_Emergence_of_Scaling_in_Random_Networks","260635522_Information_Production_and_Link_Formation_in_Social_Computing_Systems","260635493_Strategic_Networks_Information_Dissemination_and_Link_Formation_Among_Self-Interested_Agents","256059952_Two-Step_Estimation_of_Network-Formation_Models_with_Incomplete_Information","256001476_Bayesian_Learning_in_Social_Networks","251328703_Emergent_Star_Networks_with_Ex_Ante_Homogeneous_Agents","228294402_A_Structural_Model_of_Segregation_in_Social_Networks","227606308_Who's_Who_in_Networks_Wanted_The_Key_Player"]}