{"id":"258291381_Lagrangean_method_with_topological_changes_for_numerical_modelling_of_forest_fire_propagation","abstract":"We introduce a mathematical model and new Lagrangean numerical algorithm for\nmodelling of a wind-driven forest fire front propagation. The model is based on evolution of plane\ncurve (representing the fire front) in the outer normal direction by a speed given by the properties\nof a fuel bed which is scaled exponentially by a wind speed projected onto the normal to the front.\nThe influence of the front shape on the speed of propagation is modelled by adding the curvature\nregularization to the normal velocity. For numerical modelling we use so-called Lagrangean approach\nwhere the crucial point is an asymptotically uniform tangential redistribution of grid points which\nprevents the moving front from forming spurious crossovers and swalow tails. Moreover, thanks to the\nuniform tangential redistribution and our new idea of computing distance function in a narrow tube\nalong discrete curve grid points, we detect and solve in\nO\n(\nn\n) complexity the topological changes in\nmoving front. Such approach makes our Lagrangean method highly efficient and represents significant\nimprovement of the existing numerical models for the forest fire propagation and, in general, it\nrepresent new fast and stable method for solving free boundary problems modelled by moving fronts\nwith possible topological changes","authors":["Martin Balažovjech","Karol Mikula","Mária Šibíková","Jozef Urbán"],"meta":["September 2012","Conference: ALGORITMY 2012, 19th Conference on Scientific ComputingAt: Podbanské, Slovakia"],"references":["268057284_Algorithm_for_topological_changes_of_parametrically_described_curves","241052074_Inflow-ImplicitOutflow-Explicit_Scheme_for_Solving_Advection_Equations","220411434_A_New_Level_Set_Method_for_Motion_in_Normal_Direction_Based_on_a_Semi-Implicit_Forward-Backward_Diffusion_Approach","220222490_Evolution_of_Plane_Curves_Driven_by_a_Nonlinear_Function_of_Curvature_and_Anisotropy","2210210_A_Simple_Fast_and_Stabilized_Flowing_Finite_Volume_Method_for_Solving_General_Curve_Evolution_Equations","246163680_FARSITE_Fire_Area_Simulator-model_development_and_evaluation","229762932_Elliptical_growth_model_of_forest_fire_fronts_and_its_numerical_solution","229532840_A_direct_method_for_solving_an_anisotropic_mean_curvature_flow_of_plane_curves_with_an_external_force"]}