{"id":"258224316_Convexity_in_Source_Separation_Models_geometry_and_algorithms","abstract":"Source separation or demixing is the process of extracting multiple\ncomponents entangled within a signal. Contemporary signal processing presents a\nhost of difficult source separation problems, from interference cancellation to\nbackground subtraction, blind deconvolution, and even dictionary learning.\nDespite the recent progress in each of these applications, advances in\nhigh-throughput sensor technology place demixing algorithms under pressure to\naccommodate extremely high-dimensional signals, separate an ever larger number\nof sources, and cope with more sophisticated signal and mixing models. These\ndifficulties are exacerbated by the need for real-time action in automated\ndecision-making systems.\nRecent advances in convex optimization provide a simple framework for\nefficiently solving numerous difficult demixing problems. This article provides\nan overview of the emerging field, explains the theory that governs the\nunderlying procedures, and surveys algorithms that solve them efficiently. We\naim to equip practitioners with a toolkit for constructing their own demixing\nalgorithms that work, as well as concrete intuition for why they work.","authors":["Michael B. McCoy","Volkan Cevher","Quoc Tran-Dinh","Afsaneh Asaei"],"meta":["November 2013IEEE Signal Processing Magazine 31(3)","DOI:10.1109/MSP.2013.2296605","SourcearXiv"],"references":["272792309_The_direct_extension_of_ADMM_for_multi-block_convex_minimization_problems_is_not_necessarily_convergent","262351545_Repairing_Sparse_Low-Rank_Texture","261196588_Manifold_Sparse_Beamforming","278762029_Signal_recovery_by_proximal_forwardC_backward_splitting","278433201_Atomic_Decomposition_by_Basis_Pursuit","267542011_Blind_Deconvolution_Using_Convex_Programming","262572661_Sharp_Recovery_Bounds_for_Convex_Demixing_with_Applications","261262035_Universality_in_polytope_phase_transitions_and_iterative_algorithms","258818373_Living_on_the_edge_A_geometric_theory_of_phase_transitions_in_convex_optimization","258222850_Introductory_Lectures_on_Convex_Optimization_A_Basic_Course"]}