{"id":"258390522_A_Review_of_Hybrid_Brain-Computer_Interface_Systems","abstract":"Increasing number of research activities and different types of studies in brain-computer interface (BCI) systems show potential in this young research area. Research teams have studied features of different data acquisition techniques, brain activity patterns, feature extraction techniques, methods of classifications, and many other aspects of a BCI system. However, conventional BCIs have not become totally applicable, due to the lack of high accuracy, reliability, low information transfer rate, and user acceptability. A new approach to create a more reliable BCI that takes advantage of each system is to combine two or more BCI systems with different brain activity patterns or different input signal sources. This type of BCI, called hybrid BCI, may reduce disadvantages of each conventional BCI system. In addition, hybrid BCIs may create more applications and possibly increase the accuracy and the information transfer rate. However, the type of BCIs and their combinations should be considered carefully. In this paper, after introducing several types of BCIs and their combinations, we review and discuss hybrid BCIs, different possibilities to combine them, and their advantages and disadvantages.","authors":["Setare Amiri","Reza Fazel-Rezai","Vahid Asadpour"],"meta":["January 2013Advances in Human-Computer Interaction 2013(6725)","DOI:10.1155/2013/187024"],"references":["271909474_Toward_a_Hybrid_BCI_for_Grasp_Rehabilitation","256372358_The_Design_of_a_Point-and-Click_System_by_Integrating_a_Self-Paced_Brain-Computer_Interface_With_an_Eye-Tracker","304342288_Towards_brain-computer_interfacing","287486319_BCIs_That_Use_Steady-State_Visual_Evoked_Potentials_or_Slow_Cortical_Potentials","286291285_BCIs_That_Use_P300_Event-Related_Potentials","285833494_Event-related_EEG-MEG_synchronization_and_desynchronization_Basic_principles","285088658_An_introduction_to_brain-computer_interfacing","283361288_VISUAL_EVOKED_RESPONSE_AS_A_COMMUNICATION_CHANNEL","267057025_Discriminant_Analysis","234812468_Hybrid_P300_and_mu-beta_brain_computer_interface_to_operate_a_brain_controlled_wheelchair"]}