{"id":"258329472_Logic_for_Computer_Scientists","abstract":"This book introduces the notions and methods of formal logic from a computer science standpoint, covering propositional logic, predicate logic, and foundations of logic programming. It presents applications and themes of computer science research such as resolution, automated deduction, and logic programming in a rigorous but readable way.The style and scope of the work, rounded out by the inclusion of exercises, make this an excellent textbook for an advanced undergraduate course in logic for computer scientists. This is a short introductory book on the topic of propositional and first-order logic, with a bias towards computer scientists. Schning decides to concentrate on computational issues, and gives us a short book (less than 170 pages) with a tight storyline. I found this a nicely written book with many examples and exercises (126 of them). The presentation is natural and easy to follow. This book seems suitable for a short course, a seminar series, or part of a larger course on Prolog and logic programming, probably at the advanced undergraduate level. SIGACT NewsContains examples and 126 interesting exercises which put the student in an active reading mode.... Would provide a good university short course introducing computer science students to theorem proving and logic programming. Mathematical ReviewsThis book concentrates on those aspects of mathematical logic which have strong connections with different topics in computer science, especially automated deduction, logic programming, program verification and semantics of programming languages.... The numerous exercises and illustrative examples contribute a great extent to a better understanding of different concepts and results. The book can be successfully used as a handbook for an introductory course in artificial intelligence. Zentralblatt MATH","authors":["Uwe Schöning"],"meta":["January 2008","DOI:10.1007/978-0-8176-4763-6","ISBN: 978-0-8176-4762-9"],"references":[]}