{"id":"258384107_An_Energy-Efficient_and_Fault-Tolerant_Convergecast_Protocol_in_Wireless_Sensor_Networks","abstract":"The simple graph theory is commonly employed in wireless sensor networks topology control. An inherent problem of small-granularity algorithms is the high computing complexity and large solution space when managing large-scale WSNs. Computed transmission paths are of low fault tolerance because of unattended sensor nodes and frail wireless transmitting channels. This paper uses hyper-graph theory to solve these practical problems and proposes a spanning hyper-tree algorithm (SHTa) to compute the minimum transmitting power delivery paths set for WSNs convergecast. There are three main contributions of this paper: (1) we present a novel hyper-graph model to abstract large-scale and high connectivity WSNs into a robust hyper-tree infrastructure; (2) we present a precise mathematical derivation that solves the “hyper-tree existence” problem; (3) SHTa is proposed to compute the delivery paths set, which is the minimum power transmitting convergecast hyper-tree. Variable scale hyper-edges represented as computing units limit solution space and reduce computing complexity. Mutual backup delivery paths in one hyper-edge improve the capability of fault tolerance. With experiment results, SHTa computes short latency paths with low energy consumption, compared with previous algorithms. Furthermore, in dynamic experiments scenes, SHTa retains its robust transmitting quality and presents high fault tolerance.","authors":["Ting Yang","ChunJian Kang","Guofang Nan"],"meta":["September 2012International Journal of Distributed Sensor Networks 2012(1550-1329)","DOI:10.1155/2012/429719"],"references":["252059484_Data_Gathering_Mechanism_with_Local_Sink_in_Geographic_Routing_for_Wireless_Sensor_Networks","224687284_NTP_versus_PTP_in_Com_puter_Networks_Clock_Synchronization","224640435_Networked_Control_using_GPS_Synchronization","224401932_Opportunity-Based_Topology_Control_in_Wireless_Sensor_Networks","224251865_Energy_Optimized_Topologies_for_Distributed_Averaging_in_Wireless_Sensor_Networks","224209797_Dynamic_Cluster_Header_Selection_and_Conditional_Re-clustering_for_Wireless_Sensor_Networks","313636700_Directed_diffusion_for_wireless_sensor_networking","269034336_Directed_Diffusion","260673366_On_QoS_guaranteed_cluster-based_multihop_wireless_ad_hoc_networks","224184062_Sensor_Network_Based_Localization_Algorithm_using_Fusion_Sensor-Agent_for_Indoor_Service_Robot"]}