{"id":"258373513_Quantum_Commuting_Circuits_and_Complexity_of_Ising_Partition_Functions","abstract":"Instantaneous quantum polynomial-time (IQP) computation is a class of quantum\ncomputation consisting only of commuting two-qubit gates and is not universal\nin the sense of standard quantum computation. Nevertheless, it has been shown\nthat if there is a classical algorithm that can simulate IQP efficiently, the\npolynomial hierarchy (PH) collapses at the third level, which is highly\nimplausible. However, the origin of the classical intractability is still less\nunderstood. Here we establish a relationship between IQP and computational\ncomplexity of the partition functions of Ising models. We apply the established\nrelationship in two opposite directions. One direction is to find subclasses of\nIQP that are classically efficiently simulatable in the strong sense, by using\nexact solvability of certain types of Ising models. Another direction is\napplying quantum computational complexity of IQP to investigate (im)possibility\nof efficient classical approximations of Ising models with imaginary coupling\nconstants. Specifically, we show that there is no fully polynomial randomized\napproximation scheme (FPRAS) for Ising models with almost all imaginary\ncoupling constants even on a planar graph of a bounded degree, unless the PH\ncollapses at the third level. Furthermore, we also show a multiplicative\napproximation of such a class of Ising partition functions is at least as hard\nas a multiplicative approximation for the output distribution of an arbitrary\nquantum circuit.","authors":["Keisuke Fujii","Tomoyuki Morimae"],"meta":["November 2013New Journal of Physics 19(3)","DOI:10.1088/1367-2630/aa5fdb","SourcearXiv"],"references":["263979635_Diagonal-unitary_2-design_and_their_implementations_by_quantum_circuits","263471647_Computational_quantum-classical_boundary_of_commuting_quantum_circuits","262640569_Diagonal_quantum_circuits_Their_computational_power_and_applications","262264271_A_quantum_algorithm_for_additive_approximation_of_Ising_partition_functions","261914893_Measurement-Based_Classical_Computation","260961982_Generating_a_state_t-design_by_diagonal_quantum_circuits","260939232_Efficient_experimental_validation_of_photonic_boson_sampling_against_the_uniform_distribution","304405348_On_computable_numbers_with_an_application_to_the_Entscheidungsproblem","291787199_Fault-tolerant_quantum_computation_by_anyons","263352271_Simple_universal_models_capture_all_spin_physics"]}