{"id":"258442676_On_Density-Based_Data_Streams_Clustering_Algorithms_A_Survey","abstract":"Clustering data streams has drawn lots of attention in the last few years due to their ever-growing presence. Data streams put additional challenges on clustering such as limited time and memory and one pass clustering. Furthermore, discovering clusters with arbitrary shapes is very important in data stream applications. Data streams are infinite and evolving over time, and we do not have any knowledge about the number of clusters. In a data stream environment due to various factors, some noise appears occasionally. Density-based method is a remarkable class in clustering data streams, which has the ability to discover arbitrary shape clusters and to detect noise. Furthermore, it does not need the number of clusters in advance. Due to data stream characteristics, the traditional density-based clustering is not applicable. Recently, a lot of density-based clustering algorithms are extended for data streams. The main idea in these algorithms is using densitybased methods in the clustering process and at the same time overcoming the constraints, which are put out by data stream's nature. The purpose of this paper is to shed light on some algorithms in the literature on density-based clustering over data streams. We not only summarize the main density-based clustering algorithms on data streams, discuss their uniqueness and limitations, but also explain how they address the challenges in clustering data streams. Moreover, we investigate the evaluation metrics used in validating cluster quality and measuring algorithms' performance. It is hoped that this survey will serve as a steppingstone for researchers studying data streams clustering, particularly density-based algorithms.","authors":["Amineh Amini","Teh Ying Wah","Hadi Saboohi"],"meta":["January 2014Journal of Computer Science and Technology 29(1):116-141","DOI:10.1007/s11390-013-1416-3"],"references":["271269325_Online_Clustering_for_Trajectory_Data_Stream_of_Moving_Objects","333958469_A_Survey_of_Stream_Clustering_Algorithms","324286003_Finding_Groups_in_Data_An_Introduction_to_Cluster_Analysis","312388900_STING_A_statistical_information_grid_approach_to_spatial_data_mining","309715704_Least_squares_quantization_in_PCM","279578298_Comparing_clusterings_-_An_axiomatic_view","277671634_OPTICS","277671403_KDD-cup_99","276935841_Introduction_to_Information_Retrieval","272849719_Clustering_over_Data_Streams_Based_on_Grid_Density_and_Index_Tree"]}