{"id":"258430980_Human_facial_beauty_-_Averageness_symmetry_and_parasite_resistance","abstract":"It is hypothesized that human faces judged to be attractive by people possess two features-averageness and symmetry-that promoted adaptive mate selection in human evolutionary history by way of production of offspring with parasite resistance. Facial composites made by combining individual faces are judged to be attractive, and more attractive than the majority of individual faces. The composites possess both symmetry and averageness of features. Facial averageness may reflect high individual protein heterozygosity and thus an array of proteins to which parasites must adapt. Heterozygosity may be an important defense of long-lived hosts against parasites when it occurs in portions of the genome that do not code for the essential features of complex adaptations. In this case heterozygosity can create a hostile microenvironment for parasites without disrupting adaptation. Facial bilateral symmetry is hypothesized to affect positive beauty judgments because symmetry is a certification of overall phenotypic quality and developmental health, which may be importantly influenced by parasites. Certain secondary sexual traits are influenced by testosterone, a hormone that reduces immunocompetence. Symmetry and size of the secondary sexual traits of the face (e.g., cheek bones) are expected to correlate positively and advertise immunocompetence honestly and therefore to affect positive beauty judgments. Facial attractiveness is predicted to correlate with attractive, nonfacial secondary sexual traits; other predictions from the view that parasite-driven selection led to the evolution of psychological adaptations of human beauty perception are discussed. The view that human physical attractiveness and judgments about human physical attractiveness evolved in the context of parasite-driven selection leads to the hypothesis that both adults and children have a species-typical adaptation to the problem of identifying and favoring healthy individuals and avoiding parasite-susceptible individuals. It is proposed that this adaptation guides human decisions about nepotism and reciprocity in relation to physical attractiveness.","authors":["Randy Thornhill","Steven W Gangestad"],"meta":["September 1993Human Nature 4(3):237-269","DOI:10.1007/BF02692201","SourcePubMed"],"references":["344496277_SEXUAL_SELECTION_AND_THE_EVOLUTION_OF_MATING_SYSTEMS","325146601_Adaptive_Significance_of_Female_Physical_Attractiveness_Role_of_Waist-to-Hip_Ratio","317333309_EFFECTS_OF_A_HAEMATOPHAGOUS_MITE_ON_THE_BARN_SWALLOW_HIRUNDO_RUSTICA_A_TEST_OF_THE_HAMILTON_AND_ZUK_HYPOTHESIS","317285098_THE_INHERITANCE_OF_QUANTITATIVE_FITNESS_TRAITS_IN_GUPPIES_POECILIA_RETICULATA_PISCES_POECILIIDAE","313153448_Non-random_mating_and_offspring_fitness","312992450_Fluctuating_asymmetry_An_epigenetic_measure_of_stress","306198872_Fluctuating_Asymmetry_Measurement_Analysis_Patterns","304973382_The_evolution_of_human_sexuality_revisited","285469648_Dental_asymmetry_of_genetic_and_environmental_conditions_in_human_populations","285287735_The_inheritance_of_quantitative_fitness_traits_in_guppies_Poecilia_reticulata_Pisces_Poeciliidae","276956091_Averaged_faces_are_attractive","275383393_Testosterone_Social_Class_and_Antisocial_Behavior_in_a_Sample_of_4462_Men","271809661_Parasite-Induced_Changes_in_Chironomus_decorus_Diptera_Chironomidae","254346470_Attractiveness_Ratings_of_Photographs_of_Blacks_by_Cruzans_and_Americans","249576048_Parasites_and_Male_Ornaments_in_Free-Ranging_and_Captive_Red_Jungle_Fowl"]}