{"id":"258507302_HUMANS_a_HUman_Models_based_Artificial_eNvironments_software_platform","abstract":"Taking human-factors into account in training simulations enables these systems to address issues such as coactivity and management training. However, systems which use virtual reality technologies are usually designed so as to immerse the users in perfectly realistic virtual environment, focusing only on technical gestures and prescribed procedures. Therefore, they can only tackle situations with little complexity, where the user's activity is highly constrained; otherwhise they can't ensure the pedagogic control and the relevance of the simulation. The HUMANS (HUman Models based Artificial eNvironments Software) platform is a generic framework, designed to build tailor-made virtual environments, which can be adapted to different application cases, technological configurations or pedagogical strategies. This suite rests upon the integration of multiple explicit models (domain, activity and risk model). In order to build ecologically valid virtual environments, these models represent not only the prescribed activity but the situated knowledge of operators about their tasks, including deviations from the procedures. Moreover, rather than a fixed world only populated by reactive characters, they are used to build a dynamic world populated with autonomous characters. These models can be used both by domain and procedures experts, and by computer experts. They are used both: to monitor learners actions, detecting errors and compromises; and to generate virtual characters behaviours.","authors":["Vincent Lanquepin","Domitile Lourdeaux","Camille Barot","Kevin Carpentier"],"meta":["March 2013","DOI:10.1145/2466816.2466826","Conference: Virtual Reality International Conference (VRIC 2013)At: Laval, France"],"references":["280990059_PEGASE_A_Generic_and_Adaptable_Intelligent_System_for_Virtual_Reality_Learning_Environments","285837929_NEO-PI-R_professional_manual_Revised_NEO_personality_and_NEO_Five-Factor_Inventory_NEO-FFI_Odessa_FL_psychological_assessment_resources","285713481_Revised_NEO_personality_inventory_NEO_PI-R_and_NEO_five-factor_inventory_Odessa_Florida_FL","284277198_Psychological_Parameters_for_Crowd_Simulation_From_Audiences_to_Mobs","281428402_The_Cognitive_Structure_of_Emotions","274810355_Unified_Theories_of_Cognition","272177872_Mind_and_Society","270120441_Flow_The_Psychology_of_Optimal_Experience","265122097_Virtual_Reality_to_support_human_factors_for_safety_where_we_are_and_where_we_aim_to_go","257765134_Designing_Virtual_Environments_for_Risk_Prevention_the_MELISSA_Approach"]}