{"id":"258543123_Understanding_conflict-resolution_taskload_Implementing_advisory_conflict-detection_and_resolution_algorithms_in_an_airspace","abstract":"From 2010 to 2030, the number of instrument flight rules aircraft\noperations handled by Federal Aviation Administration en route traffic\ncenters is predicted to increase from approximately 39 million flights\nto 64 million flights. The projected growth in air transportation demand\nis likely to result in traffic levels that exceed the abilities of the\nunaided air traffic controller in managing, separating, and providing\nservices to aircraft. Consequently, the Federal Aviation Administration,\nand other air navigation service providers around the world, are making\nseveral efforts to improve the capacity and throughput of existing\nairspaces. Ultimately, the stated goal of the Federal Aviation\nAdministration is to triple the available capacity of the National\nAirspace System by 2025. In an effort to satisfy air traffic demand\nthrough the increase of airspace capacity, air navigation service\nproviders are considering the inclusion of advisory conflict-detection\nand resolution systems. In a human-in-the-loop framework, advisory\nconflict-detection and resolution decision-support tools identify\npotential conflicts and propose resolution commands for the air traffic\ncontroller to verify and issue to aircraft. A number of researchers and\nair navigation service providers hypothesize that the inclusion of\ncombined conflict-detection and resolution tools into air traffic\ncontrol systems will reduce or transform controller workload and enable\nthe required increases in airspace capacity. In an effort to understand\nthe potential workload implications of introducing advisory\nconflict-detection and resolution tools, this thesis provides a detailed\nstudy of the conflict event process and the implementation of\nconflict-detection and resolution algorithms. Specifically, the research\npresented here examines a metric of controller taskload: how many\nresolution commands an air traffic controller issues under the guidance\nof a conflict-detection and resolution decision-support tool. The goal\nof the research is to understand how the formulation, capabilities, and\nimplementation of conflict-detection and resolution tools affect the\ncontroller taskload (system demands) associated with the\nconflict-resolution process, and implicitly the controller workload\n(physical and psychological demands). Furthermore this thesis seeks to\nestablish best practices for the design of future conflict-detection and\nresolution systems. To generalize conclusions on the conflict-resolution\ntaskload and best design practices of conflict-detection and resolution\nsystems, this thesis focuses on abstracting and parameterizing the\nbehaviors and capabilities of the advisory tools. Ideally, this\nabstraction of advisory decision-support tools serves as an alternative\nto exhaustively designing tools, implementing them in high-fidelity\nsimulations, and analyzing their conflict-resolution taskload. Such an\napproach of simulating specific conflict-detection and resolution\nsystems limits the type of conclusions that can be drawn concerning the\ndesign of more generic algorithms. In the process of understanding\nconflict-detection and resolution systems, evidence in the thesis\nreveals that the most effective approach to reducing conflict-resolution\ntaskload is to improve conflict-detection systems. Furthermore, studies\nin the this thesis indicate that there is significant exibility in the\ndesign of conflict-resolution algorithms.","authors":["Adan Vela"],"meta":["January 2011"],"references":[]}