{"id":"258655708_First_Departure_Algorithms_and_Image_Decompositions_Into_Peaks_and_Wells","abstract":"An image may be decomposed as a difference between an image of peaks and an image of wells. This decomposition depends upon the point of view, an arbitrary set from where the image is considered: a peak appears as a peak if it is impossible to reach it starting from any position in the point of view without climbing. A well cannot be reached without descending. To each particular point of view corresponds a different decomposition. The decomposition is reversible. If one applies a morphological operator to the peaks-and-wells components before applying the inverse transform, one gets a new, transformed image. The decomposition is produced by a generalized shortest path algorithm on weighted graphs; the node weights represent departure times and the arc weights represent traversal times. If a train starts at each node at a time equal to the weight of this node and crosses each arc in a time equal to the weight of the node, the outcome of the algorithm is the earliest departure time of a train from each node: equal to the initial node weight if no other train arrives earlier, and equal to the earliest train coming from another node otherwise. Reconstruction closings or floodings also belong to this family of first departure algorithms. A number of applications illustrate the method.","authors":["Fernand Meyer"],"meta":["November 2012IEEE Journal of Selected Topics in Signal Processing 6(7):795-808","DOI:10.1109/JSTSP.2012.2210994"],"references":["5597679_Fast_computation_of_a_contrast-invariant_image_representation","3326322_Flat_Zones_Filtering_Connected_Operators_and_Filters_by_Reconstruction","2637862_Connected_Operators_Based_On_Region-Tree_Pruning","2519826_The_Tree_of_Shapes_of_an_Image","284307231_Alternating_sequential_filters","266599741_Bounded_variation_in_posets_with_applications_in_morphological_image_processing","257823473_Inf-Semilattice_Approach_to_Self-Dual_Morphology","232654658_Connected_Morphological_Operators_and_Filters_for_Binary_Images","230837969_Filters_and_lattices","224067992_First_steps_towards_a_self-dual_morphology","222721675_Adjacency_lattices_and_shape-tree_semilattices","221991372_Scale-Space_from_a_Level_Lines_Tree","220146206_Shape-Tree_Semilattice","220135239_Connected_Morphological_Operators_for_Binary_Images","3720136_Connected_morphological_operators_for_binary_images"]}