{"id":"258656438_Hyperspectral_Image_Denoising_Employing_a_Spectral-Spatial_Adaptive_Total_Variation_Model","abstract":"The amount of noise included in a hyperspectral image limits its application and has a negative impact on hyperspectral image classification, unmixing, target detection, and so on. In hyperspectral images, because the noise intensity in different bands is different, to better suppress the noise in the high-noise-intensity bands and preserve the detailed information in the low-noise-intensity bands, the denoising strength should be adaptively adjusted with the noise intensity in the different bands. Meanwhile, in the same band, there exist different spatial property regions, such as homogeneous regions and edge or texture regions; to better reduce the noise in the homogeneous regions and preserve the edge and texture information, the denoising strength applied to pixels in different spatial property regions should also be different. Therefore, in this paper, we propose a hyperspectral image denoising algorithm employing a spectral-spatial adaptive total variation (TV) model, in which the spectral noise differences and spatial information differences are both considered in the process of noise reduction. To reduce the computational load in the denoising process, the split Bregman iteration algorithm is employed to optimize the spectral-spatial hyperspectral TV model and accelerate the speed of hyperspectral image denoising. A number of experiments illustrate that the proposed approach can satisfactorily realize the spectral-spatial adaptive mechanism in the denoising process, and superior denoising results are produced.","authors":["Qiangqiang Yuan","Liangpei Zhang","Huanfeng Shen"],"meta":["October 2012IEEE Transactions on Geoscience and Remote Sensing 50(10):3660-3677","DOI:10.1109/TGRS.2012.2185054","Project: Hyper-spectral Image Noise Reduction"],"references":["253933900_Fast_dual_minimization_of_the_vectorial_total_variation_norm_and_applications_to_color_image_processing","313001335_De-noising_by_soft_thresholding","312771295_Image_quality_assessment_From_error_visibility_to_structural_similarity","301822646_The_Split_Bregman_method_for_L1_regularized_problems","286199959_Mean_squared_error_Love_it_or_leave_it_A_new_look_at_Signal_Fidelity_Measures","269633959_The_Split_Bregman_method_for_L1-egularized_problems","269352807_Simultaneous_dimensionality_reduction_and_denoising_of_hyperspectral_imagery_using_bivariate_wavelet_shrinking_and_principal_component_analysis","248978078_Denoising_and_dimensionality_reduction_of_hyperspectral_imagery_using_wavelet_packets_neighbour_shrinking_and_principal_component_analysis","247131283_Image_Quality_Assessment_From_Error_Visibility_to_Structural_Similarity","243778239_A_variational_approach_to_MAP_Estimation_for_image_denoising"]}