{"id":"258726264_Kernelization_Lower_Bounds_By_Cross-Composition","abstract":"We introduce the cross-composition framework for proving kernelization\nlower bounds. A classical problem L AND/OR-cross-composes into a\nparameterized problem Q if it is possible to efficiently construct an\ninstance of Q with polynomially bounded parameter value that expresses\nthe logical AND or OR of a sequence of instances of L. Building on work\nby Bodlaender et al. (ICALP 2008) and using a result by Fortnow and\nSanthanam (STOC 2008) with a refinement by Dell and van Melkebeek (STOC\n2010), we show that if an NP-hard problem OR-cross-composes into a\nparameterized problem Q then Q does not admit a polynomial kernel unless\nNP \\subseteq coNP/poly and the polynomial hierarchy collapses.\nSimilarly, an AND-cross-composition for Q rules out polynomial kernels\nfor Q under Bodlaender et al.'s AND-distillation conjecture. Our\ntechnique generalizes and strengthens the recent techniques of using\ncomposition algorithms and of transferring the lower bounds via\npolynomial parameter transformations. We show its applicability by\nproving kernelization lower bounds for a number of important graphs\nproblems with structural (non-standard) parameterizations, e.g., Clique,\nChromatic Number, Weighted Feedback Vertex Set, and Weighted Odd Cycle\nTransversal do not admit polynomial kernels with respect to the vertex\ncover number of the input graphs unless the polynomial hierarchy\ncollapses, contrasting the fact that these problems are trivially\nfixed-parameter tractable for this parameter. After learning of our\nresults, several teams of authors have successfully applied the\ncross-composition framework to different parameterized problems. For\ncompleteness, our presentation of the framework includes several\nextensions based on this follow-up work. For example, we show how a\nrelaxed version of OR-cross-compositions may be used to give lower\nbounds on the degree of the polynomial in the kernel size.","authors":["Hans L. Bodlaender","Bart M. P. Jansen","Stefan Kratsch"],"meta":["June 2012SIAM Journal on Discrete Mathematics 28(1)","DOI:10.1137/120880240"],"references":["274523136_Kernels_for_problems_with_no_kernel","262335742_Kernel_Lower_Bounds_using_Co-Nondeterminism_Finding_Induced_Hereditary_Subgraphs","261160105_Meta_Kernelization","257428706_On_Cutwidth_Parameterized_by_Vertex_Cover","285709435_Simultaneously_satisfying_linear_equations_over_f2_Maxlin2_and_maxr-lin2_parameterized_above_average","268072213_Lower_bounds_based_on_the_exponential_time_hypothesis","261243918_New_Limits_to_Classical_and_Quantum_Instance_Compression","257650163_Invitation_to_Fixed-Parameter_Algorithms","257376289_On_the_Hardness_of_Losing_Width","257048173_Towards_fully_multivariate_algorithmics_Parameter_ecology_and_the_deconstruction_of_computational_complexity"]}