{"id":"258757101_Active_debris_removal_Recent_progress_and_current_trends","abstract":"According to all available findings at international level, the Kessler\nsyndrome, increase of the number of space debris in Low Earth Orbits due\nto mutual collisions, appears now to be a fact, triggered mainly by\nseveral major break-ups in orbit which occurred since 2007. The time may\nhave come to study how to clean this fundamentally useful orbital region\nin an active way.CNES has studied potential solutions for more than 12\nyears! The paper aims at reviewing the current status of these\nactivities.The high level requirements are fundamental, and have to be\nproperly justified. The working basis, as confirmed through IADC studies\nconsists in the removal of 5-10 integer objects from the\novercrowded orbits, spent upper stages or old satellites, as identified\nby NASA.The logic of CNES activities consider a stepped approach aiming\nat progressively gaining the required Technological Readiness Level on\nthe features required for Active Debris Removal which have not yet been\ndemonstrated in orbit. The rendezvous with a non-cooperative,\nun-prepared, tumbling debris is essential. Following maturation gained\nwith Research and Technology programs, a set of small orbital\ndemonstrators could enable a confidence high enough to perform a full\nend to end demonstration performing the de-orbiting of a large debris\nand paving the way for the development of a first generation operational\nde-orbiter.The internal CNES studies, led together by the Toulouse Space\nCentre and the Paris Launcher Directorate, have started in 2008 and led\nto a detailed System Requirements Document used for the Industrial\nstudies.Three industrial teams did work under CNES contract during 2011,\nled by Thales Alenia Space, Bertin Technologies and Astrium Space\nTransportation, with numerous sub-contractors. Their approaches were\nvery rich, complementary, and innovative. The second phase of studies\nbegan mid-2012. Some key questions nevertheless have to be resolved, and\ncorrespond generally to current IADC actions:The casualty risk\nassociated to a “passive” de-orbitation is of paramount\nimportance, major driver between passive and active re-entry,The\nresidual movement of debris is crucial for the interfacing phase,\nwhichever the solution is,The debris physical state in orbit is a major\nquestion,Some solutions increase the collision risk, but for a limited\ntime period; we may not have yet the appropriate tools.The paper gives a\nstatus of where we stand, of the cooperation with the international\npartners, and raises the questions which remain open and have to be\ndealt with in the coming months.","authors":["Christophe Bonnal","Jean-Marc Ruault","Marie-Christine Desjean"],"meta":["April 2013Acta Astronautica 85:51-60","DOI:10.1016/j.actaastro.2012.11.009"],"references":["260979239_Active_Space_Debris_Removal_by_Hybrid_Engine_Module","258785936_Active_Debris_Removal_mission_design_in_Low_Earth_Orbit","286808269_Cost_estimation_of_active_debris_removal","231182840_Study_on_the_eddy_current_damping_of_the_spin_dynamics_of_spatial_debris_from_the_Ariane_launcher","229370514_Measures_to_reduce_the_growth_or_decrease_the_space_debris_population","223774642_Controlling_the_growth_of_future_LEO_Debris_populations_with_active_debris_removal","23888776_Collision_frequency_of_artificial_satellites_-_The_creation_of_a_debris_belt"]}