{"id":"258740229_Digit_Recognition_for_ArabicJawi_and_Roman_using_Features_from_Triangle_Geometry","abstract":"A novel method is proposed to recognize the Arab/Jawi and Roman digits.\nThis new method is based on features from the triangle geometry,\nnormalized into nine features. The features are used for zoning which\nresults in five and 25 zones. The algorithm is validated by using three\nstandard datasets which are publicly available and used by researchers\nin this field. The first dataset is HODA that contains 60,000 images for\ntraining and 20,000 images for testing. The second dataset is IFHCDB.\nThis dataset has 52,380 isolated characters and 17,740 digits. Only the\n17,740 images of digits are used for this research. For the roman digit,\nMNIST are chosen. MNIST dataset has 60,000 images for training and\n10,000 images for testing. Supervised (SML) and Unsupervised Machine\nLearning (UML) are used to test the nine features. The SML used are\nNeural Network (NN) and Support Vector Machine (SVM). Whereas the UML\nuses Euclidean Distance Method with data mining algorithms; namely Mean\nAverage Precision (eMAP) and Frequency Based (eFB). Results for SML\ntesting for HODA dataset are 98.07% accuracy for SVM, and 96.73% for NN.\nFor IFHCDB and MNIST the accuracy are 91.75% and 93.095% respectively.\nFor the UML tests, HODA dataset is 93.91%, IFHCDB 85.94% and MNIST\n86.61%. The train and test images are selected using both random and the\noriginal dataset's distribution. The results show that the accuracy of\nproposed algorithm is over 90% for each SML trained datasets where the\nhighest result is the one that uses 25 zones features.","authors":["Mohd Sanusi Azmi","Khairuddin Omar","Mohammad Faidzul Nasrudin","Bahari Idrus"],"meta":["April 2013","DOI:10.1063/1.4801171","Project: computational Jawi"],"references":["222826762_Introducing_a_very_large_dataset_of_handwritten_Farsi_digits_and_a_study_on_their_varieties","210250733_Farsi_handwritten_digit_recognition_based_on_mixture_of_RBF_experts","222707789_A_new_benchmark_on_the_recognition_of_handwritten_Bangla_and_Farsi_numeral_characters","220645598_Using_codebooks_of_fragmented_connected-component_contours_in_forensic_and_historic_writer_identification","220578257_Robust_Handwritten_Character_Recognition_with_Features_Inspired_by_Visual_Ventral_Stream","3045216_Experiments_with_Characteristic_Loci_for_Recognition_of_Handprinted_Characters"]}