{"id":"258792932_A_One-Year_Introductory_Robotics_Curriculum_for_Computer_Science_Upperclassmen","abstract":"This paper describes a one-year introductory robotics course sequence focusing on computational aspects of robotics for third- and fourth-year students. The key challenges this curriculum addresses are scalability, i.e., how to teach a robotics class with a limited amount of hardware to a large audience,student assessment, i.e., how to assess the students' success on robotic design and programming assignments, and depth versus breadth, i.e., how to down-select content from the interdisciplinary field of robotics to computer science students. This is achieved by combining simulation-based laboratory assignments, which can be conducted anywhere and anytime, with compatible hardware devices that allow a seamless transition from simulation to real hardware, and a focus on performance-based assessment with an open-ended final project/competition. Content learning and retention is assessed for a subset of students who successfully went through the proposed curriculum. All class materials as well as hardware-in particular, a low-cost, highly articulated robotic arm developed for teaching advanced robotics concepts-are open-source and available online.","authors":["Nikolaus Correll","Rowan Wing","David Coleman"],"meta":["February 2013IEEE Transactions on Education 56(1):54-60","DOI:10.1109/TE.2012.2220774"],"references":["266460185_DEVELOPMENT_OF_A_SUCCESSFUL_OPEN-ENDED_ROBOTICS_DESIGN_COURSE_AT_THE_HIGH_SCHOOL_LEVEL","265113664_Mobile_robotics_A_tool_for_application-based_integration_of_multidisciplinary_undergraduate_concepts_and_research","254098812_RGB-D_Mapping_Using_Kinect-Style_Depth_Cameras_for_Dense_3D_Modeling_of_Indoor_Environments","240718512_A_Mobile_Robotics_Course_for_Undergraduate_Students_in_Computer_Science","316240097_Distinctive_Image_Features_from_Scale-Invariant_Keypoints","313527089_Distinctive_image_features_from_scale-invariant_key_points","275057952_SURF_Speeded_up_robust_features","271526580_Introduction_to_Robotics_Mechanics_and_Control_Addison_Wesley","268733104_Speeded-up_robust_features_SURF","263646055_Computational_Principles_of_Mobile_Robotics"]}