{"id":"258713935_A_Systematic_Review_of_Automated_Melanoma_Detection_in_Dermatoscopic_Images_and_its_Ground_Truth_Data","abstract":"Malignant melanoma is the third most frequent type of skin cancer and\none of the most malignant tumors, accounting for 79% of skin cancer\ndeaths. Melanoma is highly curable if diagnosed early and treated\nproperly as survival rate varies between 15% and 65% from early to\nterminal stages, respectively. So far, melanoma diagnosis is depending\nsubjectively on the dermatologist's expertise. Computer-aided diagnosis\n(CAD) systems based on epiluminescense light microscopy can provide an\nobjective second opinion on pigmented skin lesions (PSL). This work\nsystematically analyzes the evidence of the effectiveness of automated\nmelanoma detection in images from a dermatoscopic device. Automated CAD\napplications were analyzed to estimate their diagnostic outcome.\nSearching online databases for publication dates between 1985 and 2011,\na total of 182 studies on dermatoscopic CAD were found. With respect to\nthe systematic selection criterions, 9 studies were included, published\nbetween 2002 and 2011. Those studies formed databases of 14,421\ndermatoscopic images including both malignant \"melanoma\" and benign\n\"nevus\", with 8,110 images being available ranging in resolution from\n150 x 150 to 1568 x 1045 pixels. Maximum and minimum of sensitivity and\nspecificity are 100.0% and 80.0% as well as 98.14% and 61.6%,\nrespectively. Area under the receiver operator characteristics (AUC) and\npooled sensitivity, specificity and diagnostics odds ratio are\nrespectively 0.87, 0.90, 0.81, and 15.89. So, although that automated\nmelanoma detection showed good accuracy in terms of sensitivity,\nspecificity, and AUC, but diagnostic performance in terms of DOR was\nfound to be poor. This might be due to the lack of dermatoscopic image\nresources (ground truth) that are needed for comprehensive assessment of\ndiagnostic performance. In future work, we aim at testing this\nhypothesis by joining dermatoscopic images into a unified database that\nserves as a standard reference for dermatology related research in PSL\nclassification.","authors":["Abder-Rahman Ali","Thomas M. Deserno"],"meta":["February 2012Proceedings of SPIE - The International Society for Optical Engineering 1:50-","DOI:10.1117/12.912389"],"references":["267722807_Measures_of_Diagnostic_Accuracy_Basic_Definitions","321565764_Advances_in_Intelligent_Information_Systems","292594915_Key_Topics_in_Surgical_Research_and_Methodology","285340572_Estimating_the_Treatment_Difference_in_an_Individual_Trial","279613764_Diagnosis_and_Treatment_of_Early_Melanoma","279597178_ABCD_rule_of_dermatoscopy_A_new_practical_method_for_early_recognition_of_malignant_melanoma","277456716_Epiluminescence_Microscopy_for_the_Diagnosis_of_Doubtful_Melanocytic_Skin_Lesions","277294976_A_probabilistic_framework_for_classification_of_dermatoscopic_images","252068000_Electrical_engineering_and_applied_computing_series_lecture_notes_in_electrical_engineering","245145083_ABCD_rule_of_dermatoscopy_A_new_practical_method_for_early_recognition_of_malignant_melanoma"]}