{"id":"258792855_Joint_Wall_Mitigation_and_Compressive_Sensing_for_Indoor_Image_Reconstruction","abstract":"Compressive sensing (CS) for urban operations and through-the-wall radar imaging has been shown to be successful in fast data acquisition and moving target localizations. The research in this area thus far has assumed effective removal of wall electromagnetic backscatterings prior to CS application. Wall clutter mitigation can be achieved using full data volume which is, however, in contradiction with the underlying premise of CS. In this paper, we enable joint wall clutter mitigation and CS application using a reduced set of spatial-frequency observations in stepped frequency radar platforms. Specifically, we demonstrate that wall mitigation techniques, such as spatial filtering and subspace projection, can proceed using fewer measurements. We consider both cases of having the same reduced set of frequencies at each of the available antenna locations and also when different frequency measurements are employed at different antenna locations. The latter casts a more challenging problem, as it is not amenable to wall removal using direct implementation of filtering or projection techniques. In this case, we apply CS at each antenna individually to recover the corresponding range profile and estimate the scene response at all frequencies. In applying CS, we use prior knowledge of the wall standoff distance to speed up the convergence of the orthogonal matching pursuit for sparse data reconstruction. Real data are used for validation of the proposed approach.","authors":["Eva Lagunas","Moeness G. Amin","Fauzia Ahmad","Montse Najar"],"meta":["February 2013IEEE Transactions on Geoscience and Remote Sensing 51(2):891-906","DOI:10.1109/TGRS.2012.2203824"],"references":["238531746_Compressed_sensing_technique_for_high-resolution_radar_imaging_-_art_no_69681A","297303127_Advances_in_Indoor_Radar_Imaging","278448552_Through-wall_imaging_and_characterization_of_human_activity_using_ultrawideband_UWB_random_noise_radar","278433201_Atomic_Decomposition_by_Basis_Pursuit","269634058_Robust_Uncertainty_Principles_Exact_Signal_Frequency_Information","261380828_Wall_clutter_mitigation_based_on_eigen-analysis_in_through-the-wall_radar_imaging","261084385_An_SVD-based_approach_for_mitigating_wall_reflections_in_through-the-wall_radar_imaging","253237972_Change_Detection_Analysis_of_Humans_Moving_Behind_Walls","239222885_Exact_signal_reconstruction_from_highly_incomplete_frequency_information","234882727_Defense_and_Security"]}