{"id":"258884606_Lyricons_Lyrics_Earcons_Designing_a_New_Auditory_Cue_Combining_Speech_and_Sounds","abstract":"To complement visual displays, auditory researchers have developed various auditory cues such as auditory icons, earcons, spearcons, and spindex cues. Even though those auditory cues were successfully applied to a number of electronic devices, they still require some improvements. From this background, the present work introduces more intuitive and fun auditory cues, \"Lyricons (Lyrics + Earcons), which integrate the benefits of speech (i.e., accuracy) and earcons (i.e., aesthetics). We categorized functions of electronic products into meta-functional groups and devised a plausible earcon set for each functional group. Nine students conducted the sound card sorting task to match earcons with functional groups and brainstormed to generate lyrics for each functional group. Based on the results, several lyricon sets were created and improvements and application directions were discussed in focus group sessions. The use of lyricons is expected to increase accessibility to electronic devices for multiple users, including novices, older adults, children, and people with vision impairment.","authors":["Myounghoon Jeon"],"meta":["July 2013Communications in Computer and Information Science 373","DOI:10.1007/978-3-642-39473-7_69","Conference: In C. Stephanidis (Ed.), Posters, Part I, HCII 2013, CCISAt: Las Vegas, NVVolume: 373"],"references":["258884831_Spearcons_Improve_Navigation_Performance_and_Perceived_Speediness_in_Korean_Auditory_Menus","258737709_Developing_the_design_guideline_of_auditory_user_interface_for_domestic_appliances","236068918_Spearcons_Speech-Based_Earcons_Improve_Navigation_Performance_in_Advanced_Auditory_Menus","228469439_Two_or_three_things_you_need_to_know_about_AUI_design_or_designers","258884954_Developing_the_design_guideline_of_auditory_user_interface_for_domestic_appliances","242316584_Earcons_and_Icons_Their_Structure_and_Common_Design_Principles","220535544_Spindex_Speech_Index_Improves_Auditory_Menu_Acceptance_and_Navigation_Performance","213800949_Auditory_Icons_Using_Sound_in_Computer_Interfaces","213798756_Earcons_and_Icons_Their_Structure_and_Common_Design_Principles"]}