{"id":"258924062_In_Situ_Structure_and_Dynamics_of_DNA_Origami_Determined_Through_Molecular_Dynamics_Simulations","abstract":"The DNA origami method permits folding of long single-stranded DNA into complex 3D structures with subnanometer precision. Transmission electron microscopy, atomic force microscopy, and recently cryo-EM tomography have been used to characterize the properties of such DNA origami objects, however their microscopic structures and dynamics have remained unknown. Here, we report the results of all-atom molecular dynamics simulations that characterized the structural and mechanical properties of DNA origami objects in unprecedented microscopic detail. When simulated in an aqueous environment, the structures of DNA origami objects depart from their idealized targets as a result of steric, electrostatic, and solvent-mediated forces. Whereas the global structural features of such relaxed conformations conform to the target designs, local deformations are abundant and vary in magnitude along the structures. In contrast to their free-solution conformation, the Holliday junctions in the DNA origami structures adopt a left-handed antiparallel conformation. We find the DNA origami structures undergo considerable temporal fluctuations on both local and global scales. Analysis of such structural fluctuations reveals the local mechanical properties of the DNA origami objects. The lattice type of the structures considerably affects global mechanical properties such as bending rigidity. Our study demonstrates the potential of all-atom molecular dynamics simulations to play a considerable role in future development of the DNA origami field by providing accurate, quantitative assessment of local and global structural and mechanical properties of DNA origami objects.","authors":["Jejoong Yoo","Aleksei Aksimentiev"],"meta":["November 2013Proceedings of the National Academy of Sciences 106(2)","DOI:10.1073/pnas.1316521110","SourcePubMed"],"references":["258686554_Sub-micrometer_Geometrically_Encoded_Fluorescent_Barcodes_Self-Assembled_from_DNA","233915350_Rapid_Folding_of_DNA_into_Nanoscale_Shapes_at_Constant_Temperature","233738604_Cryo-EM_structure_of_a_3D_DNA-origami_object","233539179_Synthetic_Lipid_Membrane_Channels_Formed_by_Designed_DNA_Nanostructures","263939225_Improved_Parametrization_of_Li_Na_K_and_Mg2_Ions_for_All-Atom_Molecular_Dynamics_Simulations_of_Nucleic_Acid_Systems","251567721_Nanoscale_Structure_and_Microscale_Stiffness_of_DNA_Nanotubes","249656447_Particle_Mesh_Ewald_An_Nlog_N_Method_for_Ewald_Sums_in_Large_Systems","241615418_Constant-Pressure_Molecular-Dynamics_Algorithms","237055042_DNA_Origami_Nanopores_for_Controlling_DNA_Translocation","236275509_Self-Assembled_DNA_Nanopores_that_Span_Lipid_Bilayers","232742073_Fluorescence_Enhancement_at_Docking_Sites_of_DNA-Directed_Self-Assembled_Nanoantennas","225092463_Comparison_of_Simple_Potential_Functions_for_Simulating_Liquid_Water","223970627_DNA_Origami_Gatekeepers_for_Solid-State_Nanopores","222108950_Fluctuating_filaments_Statistical_mechanics_of_helices","225092558_Scalable_molecular_dynamics_with_NAMD_Comput_Chem"]}