{"id":"258918503_Algorithm_for_Minimum_Cost_Maximum_Flow_in_Transportation_Network","abstract":"Minimum Cost Maximum Flow Problem (MCMFP) is to find the maximum flow with minimal total cost, i.e., the minimum cost maximum flow, in transportation network. In this paper, MCMFP is formulated using a bi-level programming model. As a solution method of the model, an algorithm named MCMF-A is proposed. The basic idea of the MCMF-A algorithm can be described as follows: first find a maximum flow without opposite flow in transportation network, next construct its residual network with regard to the maximum flow, then find a negative-cost cycle in the residual network by calling well-known Floyd Algorithm; if Floyd Algorithm finds that there is no negative-cost cycle in the residual network, then the maximum flow is minimum cost maximum flow, else adjust the maximum flow via the negative-cost cycle to get a new maximum flow with no opposite flow and less total transportation cost. The theory, on which the MCMF-A algorithm is based, is presented. The MCMF-A algorithm can find the optimal solution to MCMFP, and has good performance in the sense of being implemented on computer, computational time and required memory for computation. Numerical experiments demonstrate that the MCMF-A algorithm is an efficient and robust method to solve MCMFP, which can serve as an effective tool to solve other related optimization problems.","authors":["Fanrong Xie","Yuchen Jia","Renan Jia","Corresponding Author"],"meta":["April 2012Journal of Convergence Information Technology 7(7)","DOI:10.4156/jcit.vol7.issue7.21"],"references":["284501714_Algorithm_for_Minimum_Cost_Flow_Minimum_Cost_Maximum_Flow_in_Network_with_Lower_Upper_Arc_Capacities","241168803_On_Minimum_Duration_Project_Schedule","234056423_An_exterior_simplex_type_algorithm_for_the_Minimum_Cost_Network_Flow_Problem","225960770_A_Network_Simplex_Method","225761347_A_polynomial_time_primal_network_simplex_algorithm_for_minimum_cost_flows","289802612_A_genetic_local_search_algorithm_based_on_insertion_neighborhood_for_the_job_shop_scheduling_problem","276014634_Flow-based_travel_plan_via_VANET","276011928_The_Popularization_of_Vogel_Method_of_Optimizing_the_Initial_Solution_for_Traveling_Salesman_Problem","274118097_Chaotic_Quantum_Genetic_Algorithm_and_Its_Application","232617569_On_Capacitated_Transportation_Problem_with_Bounds_on_Rim_Conditions"]}