{"id":"259006326_Analitica_de_aprendizaje_y_personalizacion_Learning_Analytics_and_Personalization","abstract":"Resumen En este trabajo se plantea una revisión de las analíticas masivas de datos de aprendizaje en la Educación Superior. Se relaciona con un nuevo paradigma de aprendizaje basado en tareas y en logros en consonancia con las capacidades individuales y no con el tiempo, con el espacio o con la edad. Es pertinente plantearlo ahora porque es la primera vez que la potencia tecnológica puede responder a esta necesidad. La viabilidad y la relevancia las define claramente el problema de 2 sigma, que plantea el amplio horizonte por recorrer hasta un objetivo límite de aprendizaje. Actualmente se constata un decidido interés por el análisis de datos de aprendizaje utilizando los sistemas y el software basado en los entornos sociales y ubicuos y en los nuevos LMS que lo incorporan. El problema es que hasta ahora las herramientas consolidadas de uso común solo obtienen datos y gráficas que relacionan el rendimiento individual con el grupal, y el de éste en conjunto, y además sólo lo hacen con referencia a datos de aprendizaje que hemos introducido merced a procedimientos de evaluación convencionales. Sin embargo hay un espacio que suministra una enorme cantidad de datos no solo para la evaluación del alumno y que actualmente ignoramos, al menos de forma explícita, es el espacio de trabajo personal del alumno conectado, en red con sus iguales, con los profesores, con los recursos y con todo el material que va utilizando y con el registro de los métodos y estrategias con que lo hace. Ahora hay una nueva perspectiva: La analítica masiva de datos personalizados. Los algoritmos utilizados en otros medios, adecuadamente orientados por las teorías del aprendizaje personalizado, por técnicas pedagógicas y de diseño instruccional pueden, junto con los avances en minería de datos, obtener informaciones para ajustar mejor la intervención educativa, para mejorar el rendimiento del alumnos, a más de su satisfacción, y el del programa educativo. Analizamos las teorías y las prácticas existentes y la revisión ha identificado cuatro grandes desafíos que este campo debe ahora abordar, así como que sería bueno contar con un modelo de referencia para el análisis de aprendizaje. Un modelo que apoye dando herramientas de comunicación y patrones de trabajo conjunto entre los investigadores. Un desafío de naturaleza prioritaria consiste en utilizar la analítica para detectar indicadores de abandono precoz en estudios en línea. Por último concluimos que es imprescindible un planteamiento que implique una mediación entre la analítica y su aplicación en contextos de orientación al alumno o de diseño instruccional. Palabras clave Analiticas de aprendizaje, personalización, problema 2 sigmas, aprendizaje divergente, paradigma aprendizaje postindustrial, analítica de datos masivos, detección abandono, educación universitaria, analítica de datos masivos. Abstract This paper presents a review of the big data learning analytics in Higher Education. It relates to a new task-based and achievement-based learning paradigm in line with individual capacities, but not with time, space or age. It is","authors":["Miguel Zapata-Ros"],"meta":["October 2013"],"references":["288658315_MOOCs_as_disruptive_technologies_Strategies_for_enhancing_the_learner_experience_and_quality_of_MOOCs","259175298_Globalization_Local_Knowledge_and_the_Growth_of_Ignorance_The_Epistemic_Construction_of_Reality","254463043_Social_Learning_Analytics_Five_Approaches","248939211_Developing_an_Effective_Lifelong_Learning_Inventory_the_ELLI_Project","324307921_Voices_of_the_Mind_A_Sociocultural_Approach_to_Mediated_Action","277989495_Embedding_reflective_thinking_on_approaches_to_learning_-_moving_from_pilot_study_to_developing_institutional_good_practice","270095401_Human_Characteristics_and_School_Learning","266203510_Social_Learning_Analytics_Social_Learning_Analytics","262293023_Learning_analytics_Drivers_developments_and_challenges","249994962_MOOC_completion_rates_The_data","245073663_A_sociocultural_approach_to_mediated_action","241770497_Learning_Dispositions_and_Transferable_Competencies_Pedagogy_Modelling_and_Learning_Analytics","236619731_MOOCs_una_vision_critica_y_una_alternativa_complementaria_La_individualizacion_del_aprendizaje_y_de_la_ayuda_pedagogica","246941478_New_Think_The_Use_of_Lateral_Thinking_in_the_Generation_of_New_Ideas","237412197_A_Self-Directed_Guide_to_Designing_Courses_for_Significant_Learning"]}