{"id":"259044196_Characterizing_and_Extending_Answer_Set_Semantics_using_Possibility_Theory","abstract":"Answer Set Programming (ASP) is a popular framework for modeling\ncombinatorial problems. However, ASP cannot easily be used for reasoning about\nuncertain information. Possibilistic ASP (PASP) is an extension of ASP that\ncombines possibilistic logic and ASP. In PASP a weight is associated with each\nrule, where this weight is interpreted as the certainty with which the\nconclusion can be established when the body is known to hold. As such, it\nallows us to model and reason about uncertain information in an intuitive way.\nIn this paper we present new semantics for PASP, in which rules are interpreted\nas constraints on possibility distributions. Special models of these\nconstraints are then identified as possibilistic answer sets. In addition,\nsince ASP is a special case of PASP in which all the rules are entirely\ncertain, we obtain a new characterization of ASP in terms of constraints on\npossibility distributions. This allows us to uncover a new form of disjunction,\ncalled weak disjunction, that has not been previously considered in the\nliterature. In addition to introducing and motivating the semantics of weak\ndisjunction, we also pinpoint its computational complexity. In particular,\nwhile the complexity of most reasoning tasks coincides with standard\ndisjunctive ASP, we find that brave reasoning for programs with weak\ndisjunctions is easier.","authors":["Kim Bauters","Steven Schockaert","Martine De Cock","Dirk Vermeir"],"meta":["November 2013Theory and Practice of Logic Programming 15(01)","DOI:10.1017/S147106841300063X","SourcearXiv"],"references":["268199310_Stable_Models_in_Generalized_Possibilistic_Logic","287101170_Ordered_epistemic_logic_Semantics_complexity_and_applications","285897572_Possibilistic_nested_logic_programs","268978965_Classical_Negation_in_Logic_Programs_and_Deductive_Databases","268863432_Probability_theory_The_logic_of_science_Edited_and_with_a_foreword_by_G_Larry_Bretthorst","268722626_Reasoning_and_Declarative_Problem_Solving","248799759_The_Stable_Model_Se_-_mantics_for_Logic_Programs","236628854_Computational_Complexity","234801440_Autoepistemic_Logic","234163994_Probability_Theory_The_Logic_Of_Science"]}