{"id":"259030869_Construction_of_an_aligned_monolingual_treebank_for_studying_semantic_similarity","abstract":"Modern paraphrase research would benefit from large corpora with detailed annotations. However, currently these corpora are still thin on the ground. In this paper, we describe the development of such a corpus for Dutch, which takes the form of a parallel monolingual treebank consisting of over 2 million tokens and covering various text genres, including both parallel and comparable text. This publicly available corpus is richly annotated with alignments between syntactic nodes, which are also classified using five different semantic similarity relations. A quarter of the corpus is manually annotated, and this informs the development of an automatic tree aligner used to annotate the remainder of the corpus. We argue that this corpus is the first of this size and kind, and offers great potential for para-phrasing research. Preliminary descriptions of the corpus were presented at the 18th Annual Meeting of Computational Linguistics in the Netherlands (CLIN 2007, Nijmegen, The Netherlands) and the 6th International Workshop on Treebanks and Linguistic Theories (TLT 2007, Bergen, Norway).","authors":["Erwin Marsi","Emiel Krahmer"],"meta":["June 2013Language Resources and Evaluation 48(2)","DOI:10.1007/s10579-013-9252-1"],"references":["319395280_The_pascal_recognising_textual_entailment_challenge","262277312_Paraphrase_Acquisition_via_Crowdsourcing_and_Machine_Learning","262203675_SemEval-2012_task_6_a_pilot_on_semantic_textual_similarity","255631290_Building_a_Large_Machine-Aligned_Parallel","311640138_Modeling_semantic_containment_and_exclusion_in_natural_language_inference","272230556_Association_of_Coffee_and_Caffeine_Intake_With_the_Risk_of_Parkinson_Disease","255820724_Het_ontstaan_van_de_soorten_door_natuurlijke_selectie_ofwel_het_bewaard_blijven_van_de_rassen_die_in_voordeel_zijn_in_de_strijd_om_het_bestaan_de_definitieve_editie","255820716_TEI_Lite_Encoding_for_Interchange_an_introduction_to_the_TEI_Revised_for_TEI_P5_release","255820563_Sentence-splitting_and_tokenization_in_D-Coi","253618730_Phrase_Alignment_in_Parallel_Treebanks"]}