{"id":"259079292_Selective_vehicle_routing_problems_under_uncertainty_without_recourse","abstract":"We argue that the selective vehicle routing problem is more appropriate than the conventional VRP in handling uncertainty with limited resources. However, previous formulations of selective VRPs have all been deterministic. Three new formulations are proposed to account for different optimization strategies under uncertain demand (or utility) level: reliable, robust, and fuzzy selective vehicle routing problems. Three parallel genetic algorithms (PGA) and a classic genetic algorithm are developed and compared to the deterministic solution. PGAs differ based on their communication strategies and diversity in sub-populations. Results show that a PGA, wherein communication between demes, or subpopulations, occurs in every generation and does not eliminate repeated chromosomes, outperforms other algorithms at the cost of higher computation time. A faster variation of PGA is used to solve the non-convex reliable selective VRP, robust selective VRP and the large-scale fuzzy selective VRP, consisting of 200 nodes. Large scale application demonstrates the value of fuzzy selective vehicle routing problem FSVRP in humanitarian logistics.","authors":["Mahdieh Allahviranloo","Joseph Y. J. Chow","Will Recker"],"meta":["January 2013Transportation Research Part E Logistics and Transportation Review","DOI:10.1016/j.tre.2013.12.004"],"references":["267067828_Fuzzy_Set_Theory_-_and_Its_Applications","313634398_Fuzzy_programming_and_linear_programming_with_several_objective_functions","302975742_A_survey_of_Parallel_Genetic_Algorithms","297247779_INTERVAL_NUMBER_AND_FUZZY_NUMBER_LINEAR_PROGRAMMINGS","292811383_Under_the_guidance_of_modern_teaching_theory_Compiler_Principle_comprehensive_reform_of_the_teaching_J","281190649_A_parallel_evolutionary_algorithm_for_the_vehicle_routing_problem_with_heterogeneous_fleet","279604153_The_value_of_travel_time_-_A_review_of_British_evidence","279233940_Fuzzy_Set_Theory_And_Its_Applications","264963062_An_Exact_Algorithm_for_the_Vehicle_Routing_Problem_with_Stochastic_Demands_and_Customers","263366449_Stochastic_vehicle_routing"]}