{"id":"259122098_SCADA_system_for_oil_refinery_control","abstract":"A Supervisory Control and Data Acquisition (SCADA)/Programmable Logic Control (PLC) system is always used to control small industries like water treatment stations; electric power stations and irrigation systems. Oil and gas refineries generally rely on a Distributed Control System (DCS) to provide all process and equipment control functionality. In this paper, a SCADA/PLC system is used to control a whole oil refinery instead of the conventional control through DCS. The design and specific implementation method of a SCADA/PLC real system in an oil refinery process is introduced. It consists of four main units: a crude oil storage unit, a crude oil pretreatment unit, a distillation unit and products storage/dispatch unit. The output products from crude oil refinery process are Liquefied Petroleum Gas (LPG), Naphtha, Gasoline, Kerosene and Diesel that have a great usage in our daily life. The reason for using the Multipoint Interface/Decentralized Peripherals (MPI/DP) connection in main control loop instead of Ethernet connection is that MPI/DP speed is 185 kbps and Ethernet connection speed is 10/100 kbps, which increases the speed of transfer data through the system. Displacer level transmitters and automatic servo level gauging transmitters are used for measuring levels in the crude oil refinery process. Also differential pressure flow transmitters are used for measuring flow rate. Temperature transmitters with thermocouple temperature elements are used for temperature control. Constructing a highly stable and reliable SCADA/PLC system instead of DCS must realize automatic management and control of oil refinery process in order to avoid the waste of manpower, physical resources, and also to increase the safety of workers.","authors":["Israa Moursi","Loay Mohy El-Din"],"meta":["January 2014Measurement 47(1):5–13","DOI:10.1016/j.measurement.2013.08.032"],"references":["290856142_Refining_Processes_Handbook","254045542_Wastewater_treatment_plant_SCADA_application"]}