{"id":"259163171_SHERLOCK_Semantic_management_of_Location-Based_Services_in_wireless_environments","abstract":"Location-Based Services (LBSs) are attracting great interest nowadays, mainly due to the economic value they can provide. So, different applications are being developed for tracking, navigation, advertising, etc., but most of those applications are designed for specific scenarios and goals with implicit knowledge about the application context. However, currently it is a challenge to provide a common framework that allows us to manage knowledge obtained from data sent by heterogeneous moving objects (textual data, multimedia data, sensor data, etc.). Moreover, the challenge is even greater considering situations where the system must adapt itself to contexts where the knowledge changes dynamically and in which moving objects can use different underlying wireless technologies and positioning systems.\nIn this paper we present the system SHERLOCK, that offers a common framework with new functionalities for LBSs. Our system processes user requests continuously to provide up-to-date answers in heterogeneous and dynamic contexts. Ontologies and semantic techniques are used to share knowledge among devices, which enables the system to guide the user selecting the service that best fits his/her needs in the given context. Moreover, the system uses mobile agent technology to carry out the processing tasks wherever necessary in the dynamic underlying networks at any time.","authors":["Roberto Yus","Eduardo Mena","Sergio Ilarri","Arantza Illarramendi"],"meta":["August 2013Pervasive and Mobile Computing","DOI:10.1016/j.pmcj.2013.07.018","Project: SHERLOCK"],"references":["313001009_Comparison_and_performance_evaluation_of_mobile_agent_platforms","277390815_Location-dependent_query_processing","264342107_SHERLOCK_A_System_for_Location-Based_Services_in_Wireless_Environments_Using_Semantics","262218829_A_Friendly_Location-Aware_System_to_Facilitate_the_Work_of_Technical_Directors_when_Broadcasting_Sport_Events","262057002_Android_goes_Semantic_DL_Reasoners_on_Smartphones","326338097_Pellet_A_Practical_OWL-DL_Reasoner","312615775_Seven_good_reasons_for_mobile_agents","247498845_Seven_Good_Reasons_for_Using_Mobile_Agents","244446048_Toward_Principles_for_the_Design_of_Ontologies_Used_for_Knowledge_Sharing_Knowledge_Systems_Laboratory","225707690_Nearest_Neighbor_and_Reverse_Nearest_Neighbor_Queries_for_Moving_Objects"]}