{"id":"259112690_The_Benefits_of_Playing_Video_Games","abstract":"Video games are a ubiquitous part of almost all children's and adolescents' lives, with 97% playing for at least one hour per day in the United States. The vast majority of research by psychologists on the effects of \"gaming\" has been on its negative impact: the potential harm related to violence, addiction, and depression. We recognize the value of that research; however, we argue that a more balanced perspective is needed, one that considers not only the possible negative effects but also the benefits of playing these games. Considering these potential benefits is important, in part, because the nature of these games has changed dramatically in the last decade, becoming increasingly complex, diverse, realistic, and social in nature. A small but significant body of research has begun to emerge, mostly in the last five years, documenting these benefits. In this article, we summarize the research on the positive effects of playing video games, focusing on four main domains: cognitive, motivational, emotional, and social. By integrating insights from developmental, positive, and social psychology, as well as media psychology, we propose some candidate mechanisms by which playing video games may foster real-world psychosocial benefits. Our aim is to provide strong enough evidence and a theoretical rationale to inspire new programs of research on the largely unexplored mental health benefits of gaming. Finally, we end with a call to intervention researchers and practitioners to test the positive uses of video games, and we suggest several promising directions for doing so. (PsycINFO Database Record (c) 2013 APA, all rights reserved).","authors":["Isabela Granic","Adam Lobel","Rutger C M E Engels"],"meta":["December 2013American Psychologist 69(1)","DOI:10.1037/a0034857","SourcePubMed"],"references":["313564029_Self_Theories_Their_Impact_on_Competence_Motivation_and_Acquisition","261297532_Classification_of_learning_outcomes_Evidence_from_the_computer_games_literature","259560644_Ingroup_Versus_Outgroup_Conflict_in_the_Context_of_Violent_Video_Game_Play_The_Effect_of_Cooperation_on_Increased_Helping_and_Decreased_Aggression","292652178_From_digital_natives_to_digital_wisdom_Hopeful_essays_for_21st_century_learning","279074862_RELATION_OF_SOCIAL_FANTASY_PLAY_TO_SOCIAL_COMPETENCE_IN_PRESCHOOLERS","272079251_The_Role_of_Positive_Emotions_in_Positive_Psychology","272078884_The_Role_of_Positive_Emotions_in_Positive_Psychology","270688549_Toys_and_Reasons_Stages_in_the_Ritualization_of_Experience","259982128_Child_Adolescent_Therapy_Cognitive-Behavioural_Procedures","257623699_Friends_fun_frustration_and_fantasy_Child_motivations_for_video_game_play"]}