{"id":"259268283_Metacognitive_and_Problem-Solving_Skills_to_Promote_Self-Directed_Learning_in_Computer_Programming_Teachers'_Experiences","abstract":"This article reports on Information Technology (IT) (Computer Science) teachers’ experiences regarding the promotion of self-directed learning (SDL) in computer programming through the application of metacognitive and problem-solving skills. Programming is complex and students experience difficulty in solving programming problems as these require various high-level skills. One of the aspects that direct the solution of such problems may be substantiated by students’ self-directedness where they take responsibility for their own learning. We developed metacognitive and problem-solving guidelines with the aim to support teachers in promoting SDL as part of an intervention programme. Six teachers were selected as part of a case study in economically deprived schools that offered IT to Grade 10 students. Data collection comprised semi-structured interviews with teachers before and after applying the intervention. Teachers’ classroom experiences after the intervention included students’ detailed planning, a higher level of understanding, management of students’ thinking processes and their active involvement in programming. Our findings suggest that the teaching of metacognitive and problem-solving skills could provide opportunities and benefit students to manage their own learning. We proposed some patterns of meaning that could give insight into the development of a self-directed learner in computer programming.","authors":["Marietjie Havenga","Betty Breed","Elsa Mentz","Desmond Govender"],"meta":["October 2013"],"references":["251401430_Training_metacognition_in_the_classroom_The_influence_of_incentives_and_feedback_on_exam_predictions","234809756_Examining_the_role_of_self-regulated_learning_on_introductory_programming_performance","321599261_Metacognition_in_Learning_and_Instruction_Theory_Research_and_Practice","318788146_A_constructivist_approach_to_a_programming_course_Students'_responses_to_the_use_of_a_learning_management_system","286272795_Self_Directed_Learning_A_Guide_for_Learners_and_Teachers","259953924_Self-Directed_Learning_A_Guide_for_Learners_and_Teachers","257178525_Assessing_Metacognitive_Awareness","247931303_Concepts_of_programming_languages_4_ed","233073320_Design_Experiments_Theoretical_and_Methodological_Challenges_in_Creating_Complex_Interventions_in_Classroom_Settings","232599909_Metacognition_and_Cognitive_Monitoring_A_New_Area_of_Cognitive-Developmental_Inquiry"]}