{"id":"259231435_Constraint_Programming_as_a_Means_to_Manage_Configurations_in_Self-Adaptive_Systems","abstract":"In recent years, new software architectures have been developed in which components can be bound and unbound dynamically as the context demands. This capacity to dynamically adapt the software's structure, behaviour and quality of service should make resilience easier to achieve by allowing systems to respond more flexibly to changing environmental contexts. However, because the decision of how to react to a new context is devolved to a run-time decision-making element that senses the context and selects an appropriate component configuration, a new approach to how software is specified is needed. A self-adaptive system that uses architectural adaptation may be conceptualized as a dynamic SPL. In this paper we argue that the problem of specifying a DSPL can be reduced to a constraint satisfaction problem. We combine goal modeling techniques with constraint programming to provide the analyst with a means to identify the system variants best suited to the various environmental contexts that a system might encounter at runtime. We illustrate our approach using the example of a self-adaptive wireless sensor network.","authors":["Peter Sawyer","Raúl Mazo","Daniel Diaz","Camille Salinesi"],"meta":["December 2012"],"references":["259231432_Constraints_The_Heart_of_Domain_and_Application_Engineering_in_the_Product_Lines_Engineering_Strategy","221222225_Requirements-Aware_Systems_A_Research_Agenda_for_RE_for_Self-adaptive_Systems","221001976_Exploiting_non-functional_preferences_in_architectural_adaptation_for_self-managed_systems","220883277_Towards_Requirements_Aware_Systems_Run-time_Resolution_of_Design-time_Assumptions","220439366_A_generic_component_model_for_building_systems_software","226769891_Extended_KAOS_Method_to_Model_Variability_in_Requirements","220693667_Requirements_Engineering_From_System_Goals_to_UML_Models_to_Software_Specifications","220475607_Dynamic_Software_Product_Lines","220105925_An_experiment_with_reflective_middleware_to_support_grid-based_flood_monitoring","3453352_Architectural_Constraints_in_the_Model-Driven_Development_of_Self-Adaptive_Applications"]}