{"id":"259268750_Modelling_reading_development_through_phonological_decoding_and_self-teaching_Implications_for_dyslexia","abstract":"The most influential theory of learning to read is based on the idea that children rely on phonological decoding skills to learn novel words. According to the self-teaching hypothesis, each successful decoding encounter with an unfamiliar word provides an opportunity to acquire word-specific orthographic information that is the foundation of skilled word recognition. Therefore, phonological decoding acts as a self-teaching mechanism or 'built-in teacher'. However, all previous connectionist models have learned the task of reading aloud through exposure to a very large corpus of spelling-sound pairs, where an 'external' teacher supplies the pronunciation of all words that should be learnt. Such a supervised training regimen is highly implausible. Here, we implement and test the developmentally plausible phonological decoding self-teaching hypothesis in the context of the connectionist dual process model. In a series of simulations, we provide a proof of concept that this mechanism works. The model was able to acquire word-specific orthographic representations for more than 25 000 words even though it started with only a small number of grapheme-phoneme correspondences. We then show how visual and phoneme deficits that are present at the outset of reading development can cause dyslexia in the course of reading development.","authors":["Johannes C Ziegler","Conrad Perry","Marco Zorzi"],"meta":["January 2014Philosophical Transactions of The Royal Society B Biological Sciences 369(1634):20120397","DOI:10.1098/rstb.2012.0397","SourcePubMed"],"references":["308468949_Developmental_dyslexia_in_different_languages_Language-specific_or_universal","247513834_The_connectionist_dual_process_CDP_approach_to_modeling_reading_aloud","247513774_Learning_orthographic_and_phonological_representations_in_model_of_monosyllabic_and_bisyllabic_naming","243644261_The_Nonword_Reading_Deficit_in_Developmental_Dyslexia_A_Review","233890369_Predictors_of_developmental_dyslexia_in_European_orthographies_with_varying_complexity","232572825_Measurement_of_word_recognition_orthographic_and_phonological_skills","256816206_When_'slime'_becomes_'smile'_Developmental_letter_position_dyslexia_in_English","239507500_Developmental_model_of_word_recognition_and_naming","236045146_A_Computational_and_Empirical_Investigation_of_Graphemes_in_Reading","234601663_Frames_of_Reference_for_the_Assessment_of_Learning_Disabilities_New_Views_on_Measurement_Issues"]}