{"id":"259258947_AllAboard_A_System_for_Exploring_Urban_Mobility_and_Optimizing_Public_Transport_Using_Cellphone_Data","abstract":"The deep penetration of mobile phones offers cities the ability to opportunistically monitor citizens' interactions and use data-driven insights to better plan and manage services. In this context, transit operators can leverage pervasive mobile sensing to better match observed demand for travel with their service offerings. With large scale data on mobility patterns, operators can move away from the costly and resource intensive four-step transportation planning processes prevalent in the West, to a more data-centric view, that places the instrumented user at the center of development. In this framework, using mobile phone data to perform transit analysis and optimization represents a new frontier with significant societal impact, especially in developing countries. AllAboard is a system to optimize the planning of a public transit network using mobile phone data with the goal to improve ridership and user satisfaction. Mobile phone location data is used to infer origin-destination flows in the city, which are then converted to ridership on the existing transit network. Sequential travel patterns from individual call location data is used to propose new candidate transit routes. An optimization model evaluates how to improve the existing transit network to increase ridership and user satisfaction, both in terms of travel and wait time. The system has been tested for the city of Abidjan, Ivory Coast, with the focus to improve the existing SOTRA transit network.","authors":["Michele Berlingerio","Francesco Calabrese","Giusy Di Lorenzo","Rahul Nair"],"meta":["September 2013","DOI:10.1007/978-3-642-40994-3_50","Conference: NetMob D4D Challenge"],"references":["220473829_Unveiling_the_Complexity_of_Human_Mobility_by_Querying_and_Mining_Massive_Trajectory_Data","321609390_Computing_with_Spatial_Trajectories","313203504_Reality_mining_Sensing_complex_social_systems","285018777_Real_time_rome","220141708_Reality_Mining_Sensing_Complex_Social_Systems"]}