{"id":"259355518_National_and_Local_Influenza_Surveillance_through_Twitter_An_Analysis_of_the_2012-2013_Influenza_Epidemic","abstract":"Social media have been proposed as a data source for influenza surveillance because they have the potential to offer real-time access to millions of short, geographically localized messages containing information regarding personal well-being. However, accuracy of social media surveillance systems declines with media attention because media attention increases \"chatter\" - messages that are about influenza but that do not pertain to an actual infection - masking signs of true influenza prevalence. This paper summarizes our recently developed influenza infection detection algorithm that automatically distinguishes relevant tweets from other chatter, and we describe our current influenza surveillance system which was actively deployed during the full 2012-2013 influenza season. Our objective was to analyze the performance of this system during the most recent 2012-2013 influenza season and to analyze the performance at multiple levels of geographic granularity, unlike past studies that focused on national or regional surveillance. Our system's influenza prevalence estimates were strongly correlated with surveillance data from the Centers for Disease Control and Prevention for the United States (r = 0.93, p < 0.001) as well as surveillance data from the Department of Health and Mental Hygiene of New York City (r = 0.88, p < 0.001). Our system detected the weekly change in direction (increasing or decreasing) of influenza prevalence with 85% accuracy, a nearly twofold increase over a simpler model, demonstrating the utility of explicitly distinguishing infection tweets from other chatter.","authors":["David A. Broniatowski","Michael J Paul","Mark Dredze"],"meta":["December 2013PLoS ONE 8(12):e83672","DOI:10.1371/journal.pone.0083672","SourcePubMed","Project: Big Data and Health"],"references":["233423419_Right_Time_Right_Place_Health_Communication_on_Twitter_Value_and_Accuracy_of_Location_Information","291049088_Separating_fact_from_fear_Tracking_flu_infections_on_twitter","289850924_Carmen_A_twitter_geolocation_system_with_applications_to_public_health","284868064_Time_Series_Analysis_Forecasting_and_Control","269504318_Time_Series_Analysis_Forecasting_and_Control","260707292_How_Social_Media_Will_Change_Public_Health","250924172_Forecasting_Peaks_of_Seasonal_Influenza_Epidemics","245026976_Influenza_A_H7N9_and_the_Importance_of_Digital_Epidemiology","242421762_Time_series_analysis_forecasting_and_control_third_ed","229046024_A_model_for_mining_public_health_topics_from_Twitter"]}