{"id":"259335281_A_Review_of_Temporal_Aspects_of_Hand_Gesture_Analysis_Applied_to_Discourse_Analysis_and_Natural_Conversation","abstract":"Lately, there has been an increasing interest in hand gesture analysis\nsystems. Recent works have employed pattern recognition techniques and have\nfocused on the development of systems with more natural user interfaces. These\nsystems may use gestures to control interfaces or recognize sign language\ngestures, which can provide systems with multimodal interaction; or consist in\nmultimodal tools to help psycholinguists to understand new aspects of discourse\nanalysis and to automate laborious tasks. Gestures are characterized by several\naspects, mainly by movements and sequence of postures. Since data referring to\nmovements or sequences carry temporal information, this paper presents a\nliterature review about temporal aspects of hand gesture analysis, focusing on\napplications related to natural conversation and psycholinguistic analysis,\nusing Systematic Literature Review methodology. In our results, we organized\nworks according to type of analysis, methods, highlighting the use of Machine\nLearning techniques, and applications.","authors":["Renata C. B. Madeo","Priscilla Koch Wagner","Sarajane Marques Peres"],"meta":["December 2013International Journal of Computer Science and Information Technology 5(4)","DOI:10.5121/ijcsit.2013.5401","SourcearXiv","Project: Machine Learning applied to Human Behaviour Analysis based on Gestural Actions"],"references":["286979785_Multimodal_model_integration_for_sentence_unit_detection","262213166_A_Compositional_Model_for_Gesture_Definition","258926636_BoVDW_Bag-of-Visual-and-Depth-Words_for_gesture_recognition","243779963_Gesticulation_and_speech_Two_aspects_of_the_process_of_utterance_in_M","234832841_Multimodal_human_discourse_Gesture_and_speech","333191227_Gesticulation_and_Speech_Two_Aspects_of_the_Process_of_Utterance","319770618_The_search_for_a_safer_driver_interface_a_review_of_gesture_recognition_Human_Machine_Interface","314819550_Hand_motion_gestural_oscillations_and_multimodal_discourse","307826268_The_Catchment_Feature_Model_A_Device_for_Multimodal_Fusion_and_a_Bridge_between_Signal_and_Sense","286103412_Psycholinguistics_Central_topics"]}