{"id":"259346506_Heterogeneous_Programming_with_Single_Operation_Multiple_Data","abstract":"Heterogeneity is omnipresent in today's commodity computational systems,\nwhich comprise at least one multi-core Central Processing Unit (CPU) and one\nGraphics Processing Unit (GPU). Nonetheless, all this computing power is not\nbeing exploited in mainstream computing, as the programming of these systems\nentails many details of the underlying architecture and of its distinct\nexecution models. Current research on parallel programming is addressing these\nissues but, still, the systems' heterogeneity is exposed at language level.\nThis paper proposes a uniform framework, grounded on the Single Operation\nMultiple Data model, for the programming of such heterogeneous systems. The\nmodel is declarative, empowering the compiler to generate code for multiple\narchitectures from the same source. To this extent, we designed a simple\nextension of the Java programming language that embodies the model, and\ndeveloped a compiler that generates code for both multi-core CPUs and GPUs. A\nperformance evaluation attests the validity of the approach that, despite being\nbased on a simple programming model, is able to deliver performance gains on\npar with hand-tuned data parallel multi-threaded Java applications.","authors":["Hervé Paulino","Eduardo Marques"],"meta":["December 2013Journal of Computer and System Sciences 81(1)","DOI:10.1016/j.jcss.2014.06.021","SourcearXiv"],"references":["279062908_X10","262352569_Compiling_a_High-Level_Language_for_GPUs_via_Language_Support_for_Architectures_and_Compilers","261355861_Performance_Portability_with_the_Chapel_Language","261341516_Rootbeer_Seamlessly_using_GPUs_from_Java","313135583_Sequoia_Programming_the_memory_hierarchy","312775005_MapReduce_Simplified_data_processing_on_large_clusters","303636701_Improving_MapReduce_performance_in_heterogeneous_environments","258218873_DOpenCL_Towards_uniform_programming_of_distributed_heterogeneous_multi-many-core_systems","255738608_OpenACC_Application_Program_Interface","254006946_GPU_programming_in_a_high_level_language_compiling_X10_to_CUDA"]}