{"id":"259354371_Computational_model_of_precision_grip_in_Parkinson's_disease_A_Utility_based_approach","abstract":"We propose a computational model of Precision Grip (PG) performance in normal subjects and Parkinson's Disease (PD) patients. Prior studies on grip force generation in PD patients show an increase in grip force during ON medication and an increase in the variability of the grip force during OFF medication (Ingvarsson et al., 1997; Fellows et al., 1998). Changes in grip force generation in dopamine-deficient PD conditions strongly suggest contribution of the Basal Ganglia, a deep brain system having a crucial role in translating dopamine signals to decision making. The present approach is to treat the problem of modeling grip force generation as a problem of action selection, which is one of the key functions of the Basal Ganglia. The model consists of two components: (1) the sensory-motor loop component, and (2) the Basal Ganglia component. The sensory-motor loop component converts a reference position and a reference grip force, into lift force and grip force profiles, respectively. These two forces cooperate in grip-lifting a load. The sensory-motor loop component also includes a plant model that represents the interaction between two fingers involved in PG, and the object to be lifted. The Basal Ganglia component is modeled using Reinforcement Learning with the significant difference that the action selection is performed using utility distribution instead of using purely Value-based distribution, thereby incorporating risk-based decision making. The proposed model is able to account for the PG results from normal and PD patients accurately (Ingvarsson et al., 1997; Fellows et al., 1998). To our knowledge the model is the first model of PG in PD conditions.","authors":["Ankur Gupta","Pragathi Priyadharsini Balasubramani","Srinivasa Chakravarthy"],"meta":["December 2013Frontiers in Computational Neuroscience 7:172","DOI:10.3389/fncom.2013.00172","SourcePubMed"],"references":["263901907_THE_ROLE_OF_THE_BASAL_GANGLIA_IN_EXPLORATION_IN_A_NEURAL_MODEL_BASED_ON_REINFORCEMENT_LEARNING","262281099_Understanding_the_Role_of_Serotonin_in_Basal_Ganglia_through_a_Unified_Model","317415439_Modern_control_engineering","296734414_Microcircuitry_of_the_direct_and_indirect_pathways_of_the_basal_ganglia","283996103_Genetic_Algorithms_In_Search_Optimization_and_Machine_Learning","281430537_Dopamine_signals_for_reward_value_and_risk_Basic_and_recent_data","279979721_In_Monkeys_Making_Value-Based_Decisions_LIP_Neurons_Encode_Cue_Salience_and_Not_Action_Value","279272290_Portfolio_Selection","273037924_Precision_grip_and_Parkinson's_disease","270423459_Premorbid_Personality_and_the_Risk_of_Parkinson's_Disease_P07132"]}