{"id":"259393929_Pulmonary_Hypertension_in_Chronic_Lung_Diseases","abstract":"Chronic obstructive lung disease (COPD) and diffuse parenchymal lung diseases (DPLD), including idiopathic pulmonary fibrosis (IPF) and sarcoidosis, are associated with a high incidence of pulmonary hypertension (PH), which is linked with exercise limitation and a worse prognosis. Patients with combined pulmonary fibrosis and emphysema (CPFE) are particularly prone to the development of PH. Echocardiography and right heart catheterization are the principal modalities for the diagnosis of COPD and DPLD. For discrimination between group 1 PH patients with concomitant respiratory abnormalities and group 3 PH patients (PH caused by lung disease), patients should be transferred to a center with expertise in both PH and lung diseases for comprehensive evaluation. The task force encompassing the authors of this article provided criteria for this discrimination and suggested using the following definitions for group 3 patients, as exemplified for COPD, IPF, and CPFE: COPD/IPF/CPFE without PH (mean pulmonary artery pressure [mPAP] <25 mm Hg); COPD/IPF/CPFE with PH (mPAP ≥25 mm Hg); PH-COPD, PH-IPF, and PH-CPFE); COPD/IPF/CPFE with severe PH (mPAP ≥35 mm Hg or mPAP ≥25 mm Hg with low cardiac index [CI <2.0 l/min/m(2)]; severe PH-COPD, severe PH-IPF, and severe PH-CPFE). The \"severe PH group\" includes only a minority of chronic lung disease patients who are suspected of having strong general vascular abnormalities (remodeling) accompanying the parenchymal disease and with evidence of an exhausted circulatory reserve rather than an exhausted ventilatory reserve underlying the limitation of exercise capacity. Exertional dyspnea disproportionate to pulmonary function tests, low carbon monoxide diffusion capacity, and rapid decline of arterial oxygenation upon exercise are typical clinical features of this subgroup with poor prognosis. Studies evaluating the effect of pulmonary arterial hypertension drugs currently not approved for group 3 PH patients should focus on this severe PH group, and for the time being, these patients should be transferred to expert centers for individualized patient care.","authors":["Werner Seeger","Yochai Adir","Joan Albert Barbera","Hunter Champion"],"meta":["December 2013Journal of the American College of Cardiology 62(25 Suppl):D109-16","DOI:10.1016/j.jacc.2013.10.036","SourcePubMed"],"references":["257882317_Clinical_case_Combined_pulmonary_fibrosis_and_emphysema_with_pulmonary_hypertension_-_Clinical_management","297825357_Treatment_of_idiopathic_pulmonary_fibrosis_with_ambrisentan_A_parallel_randomized_trial_vol_158_pg_641_2013","286471241_Pulmonary_hypertension_associated_with_sarcoidosis","282820569_Extracorporeal_membrane_oxygenation_in_awake_patients_as_bridge_to_lung_transplantation","279790253_Echocardiographic_assessment_of_pulmonary_hypertension_in_patients_with_advanced_lung_disease","279364238_Pulmonary_hypertension_in_patients_with_idiopathic_pulmonary_fibrosis","278194592_A_Controlled_Trial_of_Sildenafil_in_Advanced_Idiopathic_Pulmonary_Fibrosis","262044326_Riociguat_for_the_Treatment_of_Pulmonary_Arterial_Hypertension","262043967_Riociguat_for_the_Treatment_of_Chronic_Thromboembolic_Pulmonary_Hypertension","257655607_Treatment_of_Idiopathic_Pulmonary_Fibrosis_With_Ambrisentan_A_Parallel_Randomized_Trial"]}