{"id":"259440086_Process_Improvement_and_CMMI_for_Systems_and_Software_Planning_Implementation_and_Management","abstract":"Process Improvement and CMMI® for Systems and Software provides a workable approach for achieving cost-effective process improvements for systems and software. Focusing on planning, implementation, and management in system and software processes, it supplies a brief overview of basic strategic planning models and covers fundamental concepts and approaches for system and software measurement, testing, and improvements. The book represents the significant cumulative experience of the authors who were among the first to introduce quality management to the software development processes. It introduces CMMI® and various other software and systems process models. It also provides readers with an easy-to-follow methodology for evaluating the status of development and maintenance processes and for determining the return on investment for process improvements. The authors examine beta testing and various testing and usability programs. They highlight examples of useful metrics for monitoring process improvement projects and explain how to establish baselines against which to measure achieved improvements. Divided into four parts, this practical resource covers: •Strategy and basics of quality and process improvement •Assessment and measurement in systems and software •Improvements and testing of systems and software •Managing and reporting data The text concludes with a realistic case study that illustrates how the process improvement effort is structured and brings together the methods, tools, and techniques discussed. Spelling out how to lay out a reasoned plan for process improvement, this book supplies readers with concrete action plans for setting up process improvement initiatives that are effective, efficient, and sustainable.","authors":["Ron Kenett","Emanuel R. Baker"],"meta":["October 2010","DOI:10.1201/9781420060515","Publisher: CRC Taylor and FrancisISBN: 9780429119415"],"references":[]}