{"id":"259426532_Logic-Based_Event_Recognition","abstract":"Today's organizations require techniques for automated transformation of their large data volumes into operational knowledge. This requirement may be addressed by using event recognition systems that detect events/activities of special significance within an organization, given streams of ‘low-level’ information that is very difficult to be utilized by humans. Consider, for example, the recognition of attacks on nodes of a computer network given the Transmission Control Protocol/Internet Protocol messages, the recognition of suspicious trader behaviour given the transactions in a financial market and the recognition of whale songs given a symbolic representation of whale sounds. Various event recognition systems have been proposed in the literature. Recognition systems with a logic-based representation of event structures, in particular, have been attracting considerable attention, because, among others, they exhibit a formal, declarative semantics, they have proven to be efficient and scalable and they are supported by machine learning tools automating the construction and refinement of event structures. In this paper, we review representative approaches of logic-based event recognition and discuss open research issues of this field. We illustrate the reviewed approaches with the use of a real-world case study: event recognition for city transport management.","authors":["Alexander Artikis","Anastasios Skarlatidis","François Portet","Georgios Paliouras"],"meta":["December 2012The Knowledge Engineering Review 27(04)","DOI:10.1017/S0269888912000264"],"references":["312994459_Situation_recognition_Representation_and_algorithms","299221600_Abduction_in_logic_programming","329645603_Knowledge_in_Action_Logical_Foundations_for_Specifying_and_Implementing_Dynamical_Systems","316692904_Commonsense_Reasoning","313665793_Inverse_entailment_and_Progol","291183979_A_Logic-Based_Calculus_of_Events","284332223_Declarative_bias_in_ILP","283925025_Maintaining_Knowledge_about_Temporal_Intervals","280113714_Relational_Data_Mining","274074620_Event_Processing_Glossary_-_Version_11"]}