{"id":"259510198_Context-aware_intelligent_service_system_for_coal_mine_industry","abstract":"In coal mine industry, the context-aware intelligent service system can be used to provide the most appropriate information services to miners according to their real-time situation. As a result, the information resources can be taken full advantage of so as to help miners to improve their safety condition, which are not just accessible to the management staff. However, there is not a detailed discussion or an in-depth research on the implementation of service system at present. In order to bridge the gap between the theory and the practice in the field, three critical problems need to be solved: (1) How to model the served miners’ context? (2) How to provide the information services to meet miners’ customized demands? (3) How to verify the availability of service invocation? According to the characteristics and practical needs of coal mine, this paper first proposes the Coal Mine Semantic Sensor Network Ontology (CMSSN) to build miner's context model, which can facilitate reusing the context resources in different coal mines. Then, the configuration model connecting context information and business services is constructed to realize the customized service invocation. Thirdly, the method of computational experiment is proposed to verify the availability and validity of service system, i.e. whether the service system can provide the suitable service on time in various virtual accident experiments. A case study is given to explain how to implement the computational experiment on a virtual coal mine simulation platform. Finally, the potential problems in realizing the system are discussed, which will be our research focus in future.\nPACS: 75.40.-s; 71.20.LP","authors":["Xiao Xue","Jing-kun Chang","Zhi-Zhong Liu"],"meta":["January 2013Computers in Industry 65(2)","DOI:10.1016/j.compind.2013.11.010"],"references":["256092056_The_SSN_Ontology_of_the_W3C_Semantic_Sensor_Network_Incubator_Group","242371750_WonderWeb_Deliverable_D17_The_WonderWeb_Library_of_Foundational_Ontologies_Preliminary_Report","236943394_Context-Aware_Recommender_Systems_a_service_oriented_approach","221568547_A_context-aware_patient_safety_system_for_the_operating_room","221343194_Detection_of_Suspicious_Activity_Using_Different_Rule_Engines_-_Comparison_of_BaseVISor_Jena_and_Jess_Rule_Engines","220605653_Context-Aware_Recommender_Systems","220515649_The_Active_Badge_Location_System","4374664_Context-Aware_Computing_Applications","3283175_Context-Aware_Wireless_Sensor_Networks_for_Assisted-Living_and_Residential_Monitoring","269484141_Framework_of_Context-Aware_Based_Service_System","261346405_The_Research_on_Context-Aware-Based_Intelligent_Service_System_for_Miners","259922916_Semantic_Sensor_Network_XG_Final_Report","235257188_Designing_viable_business_models_for_context-aware_mobile_services","227007340_Context-Aware_Recommender_Systems","221238229_Context_Aware_Health_Monitoring_System","220251055_There_is_more_to_context_than_location","220172753_A_service-oriented_middleware_for_building_context-aware_services","2458505_A_Survey_of_Context-Aware_Mobile_Computing_Research"]}