{"id":"259599991_Estrategias_educativas_para_el_desarrollo_de_la_competencia_digital","abstract":"Las tecnologías educativas tradicionales se caracterizan por su especificidad, es decir, un uso especializado y unívoco (una pizarra es soporte para escribir o un microscópio es un instrumento para ampliar la visualización objetos pequeños); su estabilidad, es decir, la inalterabilidad de sus características técnicas básicas (microscopios o pizarras no cambian mucho con el tiempo y su uso no exige un aprendizaje continuo); y la transparencia de su función, es decir, la facilidad en la comprensión de la finalidad de su utilización (el funcionamiento interno de un lápiz es bastante simple y está relacionado directamente con su función). Un uso continuado y habitual las han convertido en tecnologías «transparentes», por ser herramientas docentes comunes, hasta el punto de dejar de ser conceptualizadas como «tecnologías». En contraste con las tecnologías tradicionales, las tecnologías digitales son versátiles, es decir, utilizables en diferentes formas y para múltiples propósitos); inestables, puesto que cambian rápidamente y exigen un aprendizaje continuo; y opacas, ya que su funcionamiento interno está oculto al usuario, dada su enorme complejidad. \nLa versatilidad de las tecnologías digitales hace que, por ejemplo, el ordenador sea una herramienta única para almacenar, distribuir y ayudar a manipular una variedad de sistemas de símbolos. Puede simular el funcionamiento de cualquier otro medio, constituyéndose en un «meta-medio», con múltiples posibilidades para la representación y expresión. Esta naturaleza versátil también significa que las tecnologías digitales hacen cosas muy diferentes según quién, en qué contexto y para qué las utiliza. Es la razón por la cual el ordenador tiene aplicación prácticamente en cualquier campo de la actividad humana. Sin embargo, su versatilidad también convierte al ordenador en una herramienta compleja en su uso y difícil en su aprendizaje. No ha de sorprender que su introducción en las aulas complique la actividad del profesor. \nLa inestabilidad de las TIC se manifiesta de dos formas. Por un lado, no existe un conocimiento estable y duradero para el aprendizaje de estas tecnologías. Su obsolescencia se manifiesta en ritmos de cambio muy acelerados que son difíciles de asumir por muchos usuarios. Se necesita estar continuamente al día de las demandas novedosas de estas tecnologías, es decir, ser un aprendiz continuo. Por otra parte, las tecnologías digitales no suelen tener un comportamiento fiable debido a su continua modificación y mejora. El software es un producto inacabado, siempre por perfeccionar, susceptible de ser modificado para satisfacer nuevas demandas. Esto afecta a su calidad y obliga al profesorado a moverse en el terreno de la ambigüedad, la frustración y el cambio frecuente de tecnología. Para algunos profesores esto es difícilmente asumible y admisible dentro de un aula, que habitualmente es un espacio de aprendizaje previsible y rutinario.\nPor otra parte, el funcionamiento interno de la mayoría de las tecnologías digitales son opacas para quienes las utilizan. Esta cualidad hace que la interacción con el ordenador sea simbólica y, con frecuencia, arbitraria. El hecho de que la mayoría del software esté diseñado para contextos no educativos, contribuye aún más a esta opacidad. Adaptar software de propósito general del entorno laboral, (p.ej. las hojas de cálculo) a la práctica escolar requiere trabajar a través de esta opacidad para reconfigurar y modificar sus propósitos iniciales a las necesidades educativas (Koehler & Mishra, 2008).","authors":["Jesús Valverde-Berrocoso"],"meta":["January 2012","Chapter: Estrategias educativas para el desarrollo de la competencia digitalPublisher: Ediciones Universidad de Santiago de CaliEditors: Yamile Sandobal Romero, Arturo Arenas Fernadéz, Eloy López Meneses, Julio Cabero Almenara, José Ignacio Aguaded"],"references":["259599742_Politicas_educativas_y_buenas_practicas_con_TIC","42377371_Ensenar_y_aprender_con_tecnologias_un_modelo_teorico_para_las_buenas_practicas_educativas_con_TIC","40902023_La_generacion_interactiva_en_Mexico_Ninos_y_adolescentes_frente_a_las_pantallas","265092107_Confronting_the_Challenges_of_Participatory_Culture_-_Media_Education_for_the_21st_Century_Part_2","259598075_Docentes_e-competentes_Buenas_practicas_educativas_con_TIC","243757657_The_Cathedral_and_the_Bazaar","228973674_From_Edutainment_to_Serious_Games_A_Change_in_the_Use_of_Game_Characteristics","220433003_Judgment_of_Information_Quality_and_Cognitive_Authority_in_the_Web","220141059_Applying_distributed_cognition_theory_to_the_redesign_of_the_'Copy_and_Paste'_function_in_order_to_promote_appropriate_learning_outcomes","200772321_Distributed_Cognitions"]}