{"id":"259548706_University_Rankings_and_Social_Science","abstract":"University rankings widely affect the behaviours of prospective students and their families, university executive leaders, academic faculty, governments and investors in higher education. Yet the social science foundations of global rankings receive little scrutiny. Rankings that simply recycle reputation without any necessary connection to real outputs are of no common value. It is necessary that rankings be soundly based in scientific terms if a virtuous relationship between performance and ranking is to be established, the worst potentials of rankings are to be constrained, and rankings are optimised as a source of comparative information. This article evaluates six ranking systems, Shanghai ARWU, Leiden University, QS, Scopus, Times Higher Education and U-Multirank, according to six social science criteria and two behavioural criteria. The social science criteria are materiality (rankings must be grounded in the observable higher education world), objectivity (opinion surveys should not be used), externality (ranked universities should not be a source of data about themselves), comprehensiveness (rankings should cover the broadest possible range of functions), particularity (ranking systems should eschew multi-indicators with weights, or proxy measures) and ordinal proportionality (vertical distinctions between universities should not be exaggerated). The behavioural criteria are the alignment of the ranking with tendencies to improved performance of all institutions and countries, and transparency, meaning accessibility to strategy making designed to maximize institutional position. The pure research rankings rate well overall but lack comprehensiveness. U-Multirank is also strong under most criteria but stymied by its 100 per cent reliance on subjective data collected via survey.","authors":["Simon Marginson"],"meta":["December 2013European Journal of Education 49(1)","DOI:10.1111/ejed.12061"],"references":["274379817_Rankings_and_the_Reshaping_of_Higher_Education_The_Battle_for_World-Class_Excellence","254078726_The_Discipline_of_Rankings_Tight_Coupling_and_Organizational_Change","248992507_Global_field_and_global_imagining_Bourdieu_and_worldwide_higher_education_British_Journal_of_Sociology_of_Education_293_303-315","248876087_Learning_to_Live_with_League_Tables_and_Ranking_The_Experience_of_Institutional_Leaders","346647686_Social_Limits_to_Growth","281273800_Global_University_Rankings_and_Their_Impact_EUA_Report_on_Rankings","273087647_The_Social_Limits_to_Growth","271253325_The_Times_Higher_Education_World_University_Rankings_2004-2012","245951883_Distinction_A_Social_Critique_of_The_Judgement_of_Taste","245073202_A_Social_Critique_of_the_Judgment_of_Taste","229755584_Paradoxes_of_the_Competition_State_The_Dynamics_of_Political_Globalization","235362934_The_Wealth_of_Nations","228799496_A_World_of_Difference_a_Global_Survey_of_University_League_Tables","44838608_League_tables_as_policy_instruments_Uses_and_misuses"]}