{"id":"259581511_Kinect_vs_Low-cost_Inertial_Sensing_for_Gesture_Recognition","abstract":"In this paper, we investigate efficient recognition of human gestures / movements from multimedia and multimodal data, including the Microsoft Kinect and translational and rotational acceleration and velocity from wearable inertial sensors. We firstly present a system that automatically classifes a large range of activities (17 different gestures)\nusing a random forest decision tree. Our system can achieve near real time recognition by appropriately selecting the sensors that led to the greatest contributing factor for a particular task. Features extracted from multimodal sensor data were used to train and evaluate a customized classfifer. This novel technique is capable of successfully classifying various gestures with up to 91 % overall accuracy on a publicly available data set. Secondly we investigate a wide range of diferent motion capture modalities and compare their results in terms of gesture recognition accuracy using our proposed approach. We conclude that gesture recognition can be effectively performed by considering an approach that overcomes many of the limitations associated with the Kinect and potentially paves the way for low-cost gesture recognition in unconstrained environment.","authors":["Marc Gowing","Amin Ahmadi","Francois Destelle","David Monaghan"],"meta":["January 2014","DOI:10.1007/978-3-319-04114-8_41","Conference: Multimedia ModelingAt: Dublin, Ireland"],"references":["260137349_Human_Computer_Interaction","245033301_A_Brief_History_of_Human_Computer_Interaction_Technology","284692817_Human-Computer_Interaction","267772078_Monitoring_and_Interpreting_Human_Movement_Patterns_Using_a_Triaxial_Accelerometer","266065003_Moving_Volume_KinectFusion","242422889_Understanding_Motion_Capture_for_Computer_Animation_and_Video_Games","239744629_A_Brief_History_of_Motion_Capture_for_Computer_Character_Animation","222651025_Gesture_spotting_with_body-worn_inertial_sensors_to_detect_user_activities","222543433_A_Survey_of_Computer_Vision-Based_Human_Motion_Capture","222413793_Using_acceleration_measurements_for_activity_recognition_An_effective_learning_algorithm_for_constructing_neural_classifiers"]}