{"id":"259566492_Phenome-Wide_Association_Studies_on_a_Quantitative_Trait_Application_to_TPMT_Enzyme_Activity_and_Thiopurine_Therapy_in_Pharmacogenomics","abstract":"Phenome-Wide Association Studies (PheWAS) investigate whether genetic polymorphisms associated with a phenotype are also associated with other diagnoses. In this study, we have developed new methods to perform a PheWAS based on ICD-10 codes and biological test results, and to use a quantitative trait as the selection criterion. We tested our approach on thiopurine S-methyltransferase (TPMT) activity in patients treated by thiopurine drugs. We developed 2 aggregation methods for the ICD-10 codes: an ICD-10 hierarchy and a mapping to existing ICD-9-CM based PheWAS codes. Eleven biological test results were also analyzed using discretization algorithms. We applied these methods in patients having a TPMT activity assessment from the clinical data warehouse of a French academic hospital between January 2000 and July 2013. Data after initiation of thiopurine treatment were analyzed and patient groups were compared according to their TPMT activity level. A total of 442 patient records were analyzed representing 10,252 ICD-10 codes and 72,711 biological test results. The results from the ICD-9-CM based PheWAS codes and ICD-10 hierarchy codes were concordant. Cross-validation with the biological test results allowed us to validate the ICD phenotypes. Iron-deficiency anemia and diabetes mellitus were associated with a very high TPMT activity (p = 0.0004 and p = 0.0015, respectively). We describe here an original method to perform PheWAS on a quantitative trait using both ICD-10 diagnosis codes and biological test results to identify associated phenotypes. In the field of pharmacogenomics, PheWAS allow for the identification of new subgroups of patients who require personalized clinical and therapeutic management.","authors":["Antoine Neuraz","Laurent Chouchana","Georgia Malamut","Christine Le Beller"],"meta":["December 2013PLoS Computational Biology 9(12):e1003405","DOI:10.1371/journal.pcbi.1003405","SourcePubMed"],"references":["311348205_The_new_NHGRI-EBI_Catalog_of_published_genome-wide_association_studies_GWAS_Catalog","277419245_The_efficacy_of_azathioprine_for_the_treatment_of_inflammatory_bowel_disease_a_30_year_review","243968986_Poor_Response_to_Thiopurine_in_Inflammatory_Bowel_Disease_How_to_Overcome_Therapeutic_Resistance","235670355_P385_Intrauterine_exposure_and_pharmacology_of_conventional_thiopurine_therapy_in_pregnant_inflammatory_bowel_disease_patients","329476370_Controlling_the_False_Discovery_Rate_A_Practical_and_Powerful_Approach_to_Multiple_Testing","285014042_Mercaptopurine_phara-macogenetics_Monogenic_inheritance_of_erythrocyte_thiopurine_methyltranferease_activity","270051795_A_second_generation_human_haplotype_map_of_over_31_million_SNPs","254282261_A_Multiple_Comparison_Procedure_for_Comparing_Several_Treatments_with_a_Control","235797911_Genome-_and_Phenome-Wide_Analyses_of_Cardiac_Conduction_Identifies_Markers_of_Arrhythmia_Risk","235620185_Nomenclature_for_alleles_of_the_thiopurine_methyltransferase_TPMT_gene"]}