{"id":"259695377_Transformation_of_Attributed_Structures_with_Cloning_Long_Version","abstract":"Copying, or cloning, is a basic operation used in the specification of many\napplications in computer science. However, when dealing with complex\nstructures, like graphs, cloning is not a straightforward operation since a\ncopy of a single vertex may involve (implicitly)copying many edges. Therefore,\nmost graph transformation approaches forbid the possibility of cloning. We\ntackle this problem by providing a framework for graph transformations with\ncloning. We use attributed graphs and allow rules to change attributes. These\ntwo features (cloning/changing attributes) together give rise to a powerful\nformal specification approach. In order to handle different kinds of graphs and\nattributes, we first define the notion of attributed structures in an abstract\nway. Then we generalise the sesqui-pushout approach of graph transformation in\nthe proposed general framework and give appropriate conditions under which\nattributed structures can be transformed. Finally, we instantiate our general\nframework with different examples, showing that many structures can be handled\nand that the proposed framework allows one to specify complex operations in a\nnatural way.","authors":["Dominique Duval","Rachid Echahed","Frédéric Prost","Leila Ribeiro"],"meta":["January 2014","DOI:10.1007/978-3-642-54804-8_22","SourcearXiv","Conference: International Conference on Fundamental Approaches to Software Engineering"],"references":["239580441_Handbook_of_Graph_Grammars_and_Computing_by_Graph_Transformation","321509003_Monographs_in_Theoretical_Computer_Science_An_EATCS_Series","287313905_Lambda_calculus_with_types","268018172_Fundamental_Probability_A_Computational_Approach","266985926_Handbook_of_graph_grammars_and_computing_by_graph_transformation_Vol_2_Applications_languages_and_tools_With_1_CD-ROM_Windows_Linux_and_Solaris","262326654_A_general_attribution_concept_for_models_in_M-adhesive_transformation_systems","262311881_Graph_Transformation_with_Focus_on_Incident_Edges","256082013_Lambda_calculus_with_types","242818143_Verification_of_graph_grammars_using_a_logical_approach","241194579_Handbook_of_Graph_Grammars_and_Computing_by_Graph_TransformationVolume_3_Concurrency_Parallelism_and_Distribution"]}