{"id":"259653467_A_computational_model_of_altered_gait_patterns_in_Parkinson's_disease_patients_negotiating_narrow_doorways","abstract":"We present a computational model of altered gait velocity patterns in Parkinson’s Disease (PD) patients. PD gait is characterized by short shuffling steps, reduced walking speed, increased double support time and sometimes increased cadence. The most debilitating symptom of PD gait is the context dependent cessation in gait known as freezing of gait (FOG). Cowie et al (2010) and Almeida and Lebold (2010) investigated FOG as the changes in velocity profiles of PD gait, as patients walked through a doorway with variable width. The former reported a sharp dip in velocity, a short distance from the doorway that was greater for narrower doorways. They compared the gait performance in PD freezers ON and OFF dopaminergic medication. In keeping with this finding, the latter also reported the same for ON medicated PD freezers and non-freezers. In the current study, we sought to simulate these gait changes using a computational model of Basal Ganglia based on Reinforcement Learning, coupled with a spinal rhythm mimicking central pattern generator (CPG) model. In the model, a simulated agent was trained to learn a value profile over a corridor leading to the doorway by repeatedly attempting to pass through the doorway. Temporal difference error in value, associated with dopamine signal, was appropriately constrained in order to reflect the dopamine-deficient conditions of PD. Simulated gait under PD conditions exhibited a sharp dip in velocity close to the doorway, with PD OFF freezers showing the largest decrease in velocity compared to PD ON freezers and controls. PD ON and PD OFF freezers showed sensitivity to the doorway width, with narrow door producing the least velocity/ stride length. Step length variations were also captured with PD freezers producing smaller steps and larger stepvariability than PD non-freezers and controls. In addition this model is the first to explain the non-dopamine dependence for FOG giving rise to several other possibilities for its etiology.","authors":["Vignesh Muralidharan","Pragathi Priyadharsini Balasubramani","Srinivasa Chakravarthy","Simon J G Lewis"],"meta":["January 2014Frontiers in Computational Neuroscience 7:190","DOI:10.3389/fncom.2013.00190","SourcePubMed"],"references":["312944060_Programmable_Central_Pattern_Generators_an_application_to_biped_locomotion_control","267953639_Application_of_hybrid_van_der_Pol-Rayleigh_oscillators_for_modeling_of_a_bipedal_robot","263901907_THE_ROLE_OF_THE_BASAL_GANGLIA_IN_EXPLORATION_IN_A_NEURAL_MODEL_BASED_ON_REINFORCEMENT_LEARNING","233847896_Norepinephrine_the_next_therapeutics_frontier_for_Parkinson's_disease","283996103_Genetic_Algorithms_In_Search_Optimization_and_Machine_Learning","283458371_Central_pattern_generators_for_locomotion_control_in_animals_and_robots_a_review","281430537_Dopamine_signals_for_reward_value_and_risk_Basic_and_recent_data","246346135_Cognitive_impact_on_freezing_of_gait_in_Parkinson's_disease","237127939_Models_of_Information_Processing_in_the_Basal_Ganglia","235240358_A_Neural_Substrate_of_Prediction_and_Reward"]}