{"id":"259624951_Skew_in_Parallel_Query_Processing","abstract":"We study the problem of computing a conjunctive query q in parallel, using p\nof servers, on a large database. We consider algorithms with one round of\ncommunication, and study the complexity of the communication. We are especially\ninterested in the case where the data is skewed, which is a major challenge for\nscalable parallel query processing. We establish a tight connection between the\nfractional edge packings of the query and the amount of communication, in two\ncases. First, in the case when the only statistics on the database are the\ncardinalities of the input relations, and the data is skew-free, we provide\nmatching upper and lower bounds (up to a poly log p factor) expressed in terms\nof fractional edge packings of the query q. Second, in the case when the\nrelations are skewed and the heavy hitters and their frequencies are known, we\nprovide upper and lower bounds (up to a poly log p factor) expressed in terms\nof packings of residual queries obtained by specializing the query to a heavy\nhitter. All our lower bounds are expressed in the strongest form, as number of\nbits needed to be communicated between processors with unlimited computational\npower. Our results generalizes some prior results on uniform databases (where\neach relation is a matching) [4], and other lower bounds for the MapReduce\nmodel [1].","authors":["Paul Beame","Paraschos Koutris","Dan Suciu"],"meta":["January 2014","DOI:10.1145/2594538.2594558","SourcearXiv"],"references":["262348273_Worst-case_Optimal_Join_Algorithms","262233351_Resilient_distributed_datasets_A_fault-tolerant_abstraction_for_in-memory_cluster_computing","241689300_Communication_Steps_for_Parallel_Query_Processing","227397029_Upper_and_Lower_Bounds_on_the_Cost_of_a_Map-Reduce_Computation","322881079_Hypergraphs_Entropy_and_Inequalities","312775005_MapReduce_Simplified_data_processing_on_large_clusters","260707483_Optimizing_Multiway_Joins_in_a_Map-Reduce_Environment","235246933_Pig_Latin_A_Not-So-Foreign_Language_for_Data_Processing","233764065_Shark_SQL_and_Rich_Analytics_at_Scale","224354154_Size_Bounds_and_Query_Plans_for_Relational_Joins"]}