{"id":"259695333_An_Overview_of_Schema_Theory","abstract":"The purpose of this paper is to give an introduction to the field of Schema Theory written by a mathematician and for mathematicians. In particular, we endeavor to to highlight areas of the field which might be of interest to a mathematician, to point out some related open problems, and to suggest some large-scale projects. Schema theory seeks to give a theoretical justification for the efficacy of the field of genetic algorithms, so readers who have studied genetic algorithms stand to gain the most from this paper. However, nothing beyond basic probability theory is assumed of the reader, and for this reason we write in a fairly informal style.\n\nBecause the mathematics behind the theorems in schema theory is relatively elementary, we focus more on the motivation and philosophy. Many of these results have been proven elsewhere, so this paper is designed to serve a primarily expository role. We attempt to cast known results in a new light, which makes the suggested future directions natural. This involves devoting a substantial amount of time to the history of the field.\nWe hope that this exposition will entice some mathematicians to do research in this area, that it will serve as a road map for researchers new to the field, and that it will help explain how schema theory developed. Furthermore, we hope that the results collected in this document will serve as a useful reference. Finally, as far as the author knows, the questions raised in the final section are new.\n\nPublished version: https://gradmath.org/2020/10/05/an-overview-of-schema-theory/","authors":["David White"],"meta":["January 2018","SourcearXiv"],"references":["317771241_Mathematical_analysis_of_schema_survival_for_genetic_algorithms_having_dual_mutation","321766079_Schema_Theory_Based_Data_Engineering_in_Gene_Expression_Programming_for_Big_Data_Analytics","313706874_Adaptation_in_natural_and_artificial_systems","308004628_Mathematical_Analysis_of_the_Cumulative_Effect_of_Novel_Ternary_Crossover_Operator_and_Mutation_on_Probability_of_Survival_of_a_Schema","279870373_Evolutionary_Computation_and_Genetic_Programming","267444250_The_simple_genetic_algorithm_Foundations_and_theory","267324457_The_Dynamical_Systems_Approach_-_Progress_Measures_and_Convergence_Properties","262293800_Rooted-tree_schemata_in_genetic_programming","259170623_A_novel_probabilistically-guided_context-sensitive_crossover_operator_for_clustering","242356870_Adaptation_In_Natural_And_Artificial_Systems"]}