{"id":"259624370_Models_and_Algorithms_for_Stochastic_and_Robust_Vehicle_Routing_with_Deadlines","abstract":"We consider the vehicle routing problem with deadlines under travel time uncertainty in the contexts of stochastic and robust optimization. The problem is defined on a directed graph where a fleet of vehicles is required to visit a given set of nodes and deadlines are imposed at a subset of nodes. In the stochastic vehicle routing problem with deadlines (SVRP-D), the probability distribution of the travel times is assumed to be known and the problem is solved to minimize the sum of probability of deadline violations. In the robust vehicle routing problem with deadlines (RVRP-D), however, the exact probability distribution is unknown but it belongs to a certain family of distributions. The objective of the problem is to optimize a performance measure, called lateness index, which represents the risk of violating the deadlines. Although novel mathematical frameworks have been proposed to solve these problems, the size of the problem that those approaches can handle is relatively small. Our focus in this paper is the computational aspects of the two solution schemes. We introduce formulations that can be applied for the problems with multiple capacitated vehicles and discuss the extensions to the cases of incorporating service times and soft time windows. Furthermore, we develop an algorithm based on a branch-and-cut framework to solve the problems. The experiments show that these approaches provide substantial improvements in computational efficiency compared to the approaches in the literature. Finally, we provide a computational comparison to evaluate the solution quality of the SVRP-D and the RVRP-D. The results show that the RVRP-D produces solutions that are very competitive to those obtained by the SVRP-D with a large number of scenarios, whereas much less sensitive to the distributional uncertainty.","authors":["Yossiri Adulyasak","Patrick Jaillet"],"meta":["January 2014Transportation Science 50(2)","DOI:10.1287/trsc.2014.0581"],"references":["225929534_The_Sample_Average_Approximation_Method_Applied_to_Stochastic_Routing_Problems_A_Computational_Study","220589791_An_exact_algorithm_for_the_vehicle_routing_problem_based_on_the_set_partitioning_formulation_with_additional_cuts","30848671_The_Value_of_the_Stochastic_Solution_in_Stochastic_Linear_Programs_With_Fixed_Recourse","2851978_A_New_Branch-and-Cut_Algorithm_for_the_Capacitated_Vehicle_Routing_Problem","251379815_Two-Stage_Recourse_Problems","220590042_Analytical_comparison_of_different_formulations_of_the_travelling_salesman_problem","45913909_User-Friendly_Tail_Bounds_for_Sums_of_Random_Matrices","24053859_Partitioning_procedures_for_solving_mixed-variables_programming_problems_Reprint"]}