{"id":"259668770_Framework_for_Computer_Programming_in_Preschool_and_Kindergarten","abstract":"This thesis aims to be a contribution to the integration of activities with computer programming into preschool education contexts. It is based on experiences and observations of children aged 3, 4, and 5 years olds programming computers, using an animated programming language, ToonTalk, held between 2000 and 2004 in seven different settings, typically in weekly session held over the course of several months in each year, involving approximately 150 children and 10 educators, including early childhood teachers and computer-activities teachers.\nBackground information on the use of computers and computer programming with preschool children are included, as well as an extensive survey on existing computer programming environments for children. I also provide introductory information about the fields of computing and programming, for the benefit of readers from outside the computing field; for the benefit of readers external to the educational field, and introduction to preschool education is provided.\nThe research results are provided in various forms: sample activities for integration of specific computer-science concepts into preschool education contexts; an analysis of hurdles faced by preschool children in the process of programming, and suggestions of approaches to help overcome them; an analysis of issues faced by educators in the process of using programming; and finally, a framework for integration of computer-programming activities in preschool education contexts, to assist preschool teachers and educators wishing to employ this resource.\nHopefully the insights from this thesis may prove also helpful for the computer scientist in research on the field of human-computer interaction, particularly regarding the use of computers in the development of cognition.","authors":["Leonel Morgado"],"meta":["January 2005","Thesis for: PhD in Applied Computer ScienceAdvisor: Kahn, Kenneth; Bulas Cruz, Maria Gabriel","Project: ICEI - Internet em Contextos de Educação de Infância"],"references":[]}