{"id":"259658425_Case_studies_of_incorporation_of_prior_information_in_electrical_resistivity_tomography_Comparison_of_different_approaches","abstract":"Many geophysical inverse problems are ill-posed and their solution non-unique. It is thus important to reduce the amount of mathematical solutions to more geologically plausible models by regularizing the inverse problem and incorporating all available prior information in the inversion process. We compare three different ways to incorporate prior information for electrical resistivity tomography (ERT): using a simple reference model or adding structural constraints to Occam's inversion and using geostatistical constraints. We made the comparison on four real cases representing different field applications in terms of scales of investigation and level of heterogeneities. In those cases, when electromagnetic logging data are available in boreholes to control the solution, it appears that incorporating prior information clearly improves the correspondence with logging data compared to the standard smoothness constrain. However, the way to incorporate it may have a major impact on the solution. A reference model can often be used to constrain the inversion; however, it can lead to misinterpretation if its weight is too strong or the resistivity values inappropriate. When the computation of the vertical and/or horizontal correlation length is possible, the geostatistical inversion gives reliable results everywhere in the section. However, adding geostatistical constraints can be difficult when there is not enough data to compute correlation lengths. When a known limit between two layers exists, the use of structural constrain seems to be more indicated particularly when the limit is located in zones of low sensitivity for ERT. This work should help interpreters to include their prior information directly into the inversion process through an appropriate way.","authors":["David Caterina","Thomas Hermans","Frederic Nguyen"],"meta":["August 2014Near Surface Geophysics 12:451-465","DOI:10.3997/1873-0604.2013070"],"references":["270882654_Comparison_of_image_appraisal_tools_for_electrical_resistivity_tomography","302467933_The_electrical_resistivity_log_as_an_aid_in_determining_some_reservoir_characteristics","301378611_Combined_seismic_refraction_and_electrical_imaging","293103850_Properties_and_hazards_of_108_selected_substances","288011763_Electrical_impedance_tomography_of_a_perchloroethylene_release","287114171_ERI_Evaluation_of_Injectates_Used_to_Remediate_a_Dry_Cleaning_Site_Jackson_Tennessee","275568062_Integrating_geologic_and_geophysical_data_through_advanced_constrained_inversions","269123936_Monitoring_DNAPL_Pumping_Using_Integrated_Geophysical_Techniques","264730858_ERI_evaluation_of_injectates_used_at_a_dry-cleaning_site","259674774_Physical_Properties_of_Rocks_A_Workbook"]}