{"id":"259717491_Comparison_of_temperature_estimates_from_heat_transport_model_and_electrical_resistivity_tomography_during_a_shallow_heat_injection_and_storage_experiment","abstract":"sses and quantification of parameters determining heat transport in porous media is therefore important. Geophysical methods may be useful in order to yield additional information with greater coverage than conventional wells. We report a heat transport study during a shallow heat injection and storage field test. Heated water (about 50째C) was injected for 6 days at the rate of 80 l/h in a 10.5째C aquifer. Since bulk electric resistivity variations can bring important information on temperature changes in aquifers (water electric conductivity increases about 2%/째C around 25째C), we monitored the test with surface electric resistivity tomography and demonstrate its ability to monitor spatially temperature variations. Time-lapse electric images clearly show the decrease and then the increase in bulk electric resistivity of the plume of heated water, during respectively the injection and the storage phase. This information enabled to calibrate the conceptual flow and heat model used to simulate the test. Inverted resistivity values are validated with borehole electromagnetic measurements (EM39) and are in agreement with the temperature logs used to calibrate the parameters of the thermo-hydrogeological model for the injection phase. This field work demonstrates that surface electric resistivity tomography can monitor heat and storage experiments in shallow aquifers. These results could potentially lead to a number of practical applications, such as the monitoring or the design of shallow geothermal systems or the use of heated water to replace salt water in tracer tests.","authors":["Thomas Hermans","Moubarak Daoudi","Alexander Vandenbohede","Tanguy Robert"],"meta":["December 2011","Conference: 1st International Workshop on Geoelectrical Monitoring - GELMON 2011At: ViennaVolume: Berichte der Geologischen Bundesanstalt 93"],"references":["228448220_A_shallow_geothermal_experiment_in_a_sandy_aquifer_monitored_using_electric_resistivity_tomography","255006741_Direct_utilization_of_geothermal_energy_a_layman's_guide_Geothermal_Resources_Council_special_report_No_8","248814977_Low_temperature_dependence_of_electrical_resistivity_Implications_for_near_surface_geophysical_monitoring","229076916_Shallow_heat_injection_and_storage_experiment_Heat_transport_simulation_and_sensitivity_analysis","223854233_Low-enthalpy_geothermal_energy_resources_from_groundwater_in_fluvioglacial_gravels_of_buried_valleys","222680127_Tracer_tests_for_the_investigation_of_heterogeneous_porous_media_and_stochastic_modelling_of_flow_and_transport-A_review_of_some_recent_developments","6896672_Chemico-electromechanical_coupling_in_microporous_media"]}