{"id":"259782966_A_User's_Guide_to_Compressed_Sensing_for_Communications_Systems","abstract":"This survey provides a brief introduction to compressed sensing as well as several major algorithms to solve it and its various applications to communications systems. We firstly review linear simultaneous equations as ill-posed inverse problems, since the idea of compressed sensing could be best understood in the context of the linear equations. Then, we consider the problem of compressed sensing as an underdetermined linear system with a prior information that the true solution is sparse, and explain the sparse signal recovery based on l_1 optimization, which plays the central role in compressed sensing, with some intuitive explanations on the optimization problem. Moreover, we introduce some important properties of the sensing matrix in order to establish the guarantee of the exact recovery of sparse signals from the underdetermined system. After summarizing several major algorithms to obtain a sparse solution focusing on the l_1 optimization and the greedy approaches, we introduce applications of compressed sensing to communications systems, such as wireless channel estimation, wireless sensor network, network tomography, cognitive radio, array signal processing, multiple access scheme, and networked control.","authors":["Kazunori Hayashi","Masaaki Nagahara","Toshiyuki Tanaka"],"meta":["March 2013IEICE Transactions on Communications E96-B(3):685-712","DOI:10.1587/transcom.E96.B.685","Project: Maximum hands-off control by sparse optimization"],"references":["267120366_Signal_Recovery_and_the_Large_Sieve","329475599_Regression_Shrinkage_and_Selection_Via_the_Lasso","304824205_Regression_Shrinkage_and_Selection_via_the_LASSO","284776723_Cognitive_radio_Brain-empowered_wireless_communications_selected_areas_in_communications","284024684_Stability_of_networked_control_systems","278762029_Signal_recovery_by_proximal_forwardC_backward_splitting","269634058_Robust_Uncertainty_Principles_Exact_Signal_Frequency_Information","268424691_COMPRESSED_SENSING_BASED_ESTIMATION_OF_DOUBLY_SELECTIVE_CHANNELS_USING_A_SPARSITY-OPTIMIZED_BASIS_EXPANSION","267990128_Compressed_channel_estimation_for_sparse_multipath_two-way_relay_networks","265450418_Stochastic_an_Integral_Geometry"]}