{"id":"259756486_An_Mr_Brain_Images_Classifier_via_Principal_Component_Analysis_and_Kernel_Support_Vector_Machine","abstract":"Automated and accurate classification of MR brain images is extremely important for medical analysis and interpretation. Over the last decade numerous methods have already been proposed. In this paper, we presented a novel method to classify a given MR brain image as normal or abnormal. The proposed method first employed wavelet transform to extract features from images, followed by applying principle component analysis (PCA) to reduce the dimensions of features. The reduced features were submitted to a kernel support vector machine (KSVM). The strategy of K-fold stratified cross validation was used to enhance generalization of KSVM. We chose seven common brain diseases (glioma, meningioma, Alzheimer's disease, Alzheimer's disease plus visual agnosia, Pick's disease, sarcoma, and Huntington's disease) as abnormal brains, and collected 160 MR brain images (20 normal and 140 abnormal) from Harvard Medical School website. We performed our proposed methods with four different kernels, and found that the GRB kernel achieves the highest classification accuracy as 99.38%. The LIN, HPOL, and IPOL kernel achieves 95%, 96.88%, and 98.12%, respectively. We also compared our method to those from literatures in the last decade, and the results showed our DWT+PCA+KSVM with GRB kernel still achieved the best accurate classification results. The averaged processing time for a 256 × 256 size image on a laptop of P4 IBM with 3 GHz processor and 2 GB RAM is 0.0448 s. From the experimental data, our method was effective and rapid. It could be applied to the field of MR brain image classification and can assist the doctors to diagnose where a patient is normal or abnormal to certain degrees.","authors":["Yu-Dong Zhang","Lenan Wu"],"meta":["January 2012Progress In Electromagnetics Research 130:369-388","DOI:10.2528/PIER12061410"],"references":["275876966_A_Novel_Wavelet-Galerkin_Method_for_Modeling_Radio_Wave_Propagation_in_Tropospheric_Ducts","267367123_A_feasibility_study_on_Microwave_Imaging_for_brain_stroke_monitoring","266874709_The_support_vector_machine_for_dielectric_target_detection_through_a_wall","259756570_A_novel_method_for_magnetic_resonance_brain_image_classification_based_on_adaptive_chaotic_PSO","259756400_Magnetic_Resonance_Brain_Image_Classification_by_an_Improved_Artificial_Bee_Colony_Algorithm","257723797_Overview_of_Support_Vector_Machine_in_Modeling_Machining_Performances","278651717_The_Nature_of_Statistical_Learning_Theory","275875663_Concentration_of_the_specific_absorption_rate_around_deep_brain_stimulation_electrodes_during_MRI","266099013_Phased-array_near_field_radiometry_for_brain_intracranial_applications","256759936_Lagrange_multiplier_characterizations_of_robust_best_approximations_under_constraint_data_uncertainty"]}