{"id":"259752225_Methodology_in_Biological_Game_Theory","abstract":"Game theory has a prominent role in evolutionary biology, in particular in the ecological study of various phenomena ranging from conflict behaviour to altruism to signalling and beyond. The two central methodological tools in biological game theory are the concepts of Nash equilibrium and evolutionarily stable strategy. While both were inspired by a dynamic conception of evolution, these concepts are essentially static - they only show that a population is uninvadable, but not that a population is likely to evolve. In this article, we argue that a static methodology can lead to misleading views about dynamic evolutionary processes. We advocate, instead, a more pluralistic methodology, which includes both static and dynamic game theoretic tools. Such an approach provides a more complete picture of the evolution of strategic behaviour. 1 Introduction2 The Equilibrium Methodology3 Common Interest Signalling 3.1 Lewis's signalling game 3.2 Static analysis 3.3 Dynamic analysis4 The Sir Philip Sidney Game 4.1 Static analysis 4.2 Other equilibria 4.3 Dynamic analysis5 Related Literature6 Static and Dynamic Approaches © 2013 The Author 2013. Published by Oxford University Press on behalf of British Society for the Philosophy of Science. All rights reserved. For Permissions, please email: [email protected]\n/* */","authors":["Simon M Huttegger","Kevin J S Zollman"],"meta":["August 2013The British Journal for the Philosophy of Science 64(3):637-658","DOI:10.1093/bjps/axs035"],"references":["249907665_Talking_to_Neighbors_The_Evolution_of_Regional_Meaning","240699140_Explaining_fairness_in_complex_environments","238350093_The_rock-paper-scissors_game_and_the_evolution_of_alternative_male_strategies","285406245_Introduction","284051203_The_logic_of_animal_conflict","264959680_The_Statistical_Process_of_Evolutionary_Theory","261950263_Animal_Signals","259927028_Deterministic_Chaos_and_the_Evolution_of_Meaning","258864484_The_Logic_of_Animal_Conflict","243767969_Evolutionary_Stable_Strategies_and_Game_Dynamics"]}