{"id":"259875158_A_New_Look_at_BDDs_for_Pseudo-Boolean_Constraints","abstract":"Pseudo-Boolean constraints are omnipresent in practical applications, and\nthus a significant effort has been devoted to the development of good SAT\nencoding techniques for them. Some of these encodings first construct a Binary\nDecision Diagram (BDD) for the constraint, and then encode the BDD into a\npropositional formula. These BDD-based approaches have some important\nadvantages, such as not being dependent on the size of the coefficients, or\nbeing able to share the same BDD for representing many constraints.\nWe first focus on the size of the resulting BDDs, which was considered to be\nan open problem in our research community. We report on previous work where it\nwas proved that there are Pseudo-Boolean constraints for which no polynomial\nBDD exists. We also give an alternative and simpler proof assuming that NP is\ndifferent from Co-NP. More interestingly, here we also show how to overcome the\npossible exponential blowup of BDDs by phcoefficient decomposition. This allows\nus to give the first polynomial generalized arc-consistent ROBDD-based encoding\nfor Pseudo-Boolean constraints.\nFinally, we focus on practical issues: we show how to efficiently construct\nsuch ROBDDs, how to encode them into SAT with only 2 clauses per node, and\npresent experimental results that confirm that our approach is competitive with\nother encodings and state-of-the-art Pseudo-Boolean solvers.","authors":["Ignasi Abío","Robert Nieuwenhuis","Albert Oliveras","Enric Rodríguez-Carbonell"],"meta":["January 2014Journal of Artificial Intelligence Research 45(1)","DOI:10.1613/jair.3653","SourcearXiv"],"references":["313347989_On_Using_Cutting_Planes_in_Pseudo-Boolean_Optimization","241212827_The_Barcelogic_SMT_Solver_Tool_Paper","225178129_Why_Cumulative_Decomposition_Is_Not_as_Bad_as_It_Sounds","221403394_The_Barcelogic_SMT_Solver","285797770_Improvements_of_General_Multiple_Test_Procedures_for_Redundant_Systems_of_Hypotheses","280765005_Graph-based_algorithms_for_Boolean_function_manipulation","244921404_Efficient_BDDs_for_bounded_arithmetic_constraints","237515573_Towards_Solving_a_System_of_Pseudo_Boolean_Constraints_with_Binary_Decision_Diagrams","222252342_A_linear-time_transformation_of_linear_inequalities_into_conjunctive_normal_form","221607107_Latent_Class_Models_for_Algorithm_Portfolio_Methods"]}