{"id":"259865492_Reinforced_Concrete_Force_Visualization_and_Design_Using_Bilinear_Truss-Continuum_Topology_Optimization","abstract":"A new force visualization and design tool employing hybrid topology optimization is introduced for RC and prestressed concrete structural members. The optimization scheme couples a minimum compliance (maximum stiffness) objective function with a hybrid truss-continuum ground structure that can generate a strut-and-tie model for any general concrete member, loading, and set of boundary conditions. The truss ground structure represents discrete steel reinforcing bars (tensile load paths) that can be sized based on axial forces output directly by the optimization routine, whereas the continuum elements simulate concrete compression struts. This separation of compressive and tensile load-carrying elements is achieved through bilinear elastic models with an orthotropic constitutive relationship for the continuum. Examples are provided demonstrating the potential value of the optimization tool to RC design. Reinforcing layouts that can minimize cracking and reduce steel quantities when compared with traditional designs are provided for a prismatic beam, a hammerhead pier, a stepped beam with a cutout, and the local anchorage zone of a prestressed concrete block. A minimum length scale constraint is employed to control complexity of the strut-and-tie topology, accommodating design solutions that balance material savings, structural performance, and constructability.","authors":["Andrew T Gaynor","Cristopher Dennis Moen","James K Guest"],"meta":["January 2013Journal of Structural Engineering 139(4):607-618","DOI:10.1061/(ASCE)ST.1943-541X.0000692"],"references":["265602120_Nonlinear_Biaxial_Stress-Strain_Law_for_Concrete","295176768_CONSTRUCTING_THE_EGG_CONCRETE_OR_STEEL","286804012_Thermal_stress_analysis_of_reinforced_concrete","285758352_Experimental_validation_of_strut-and-tie_method_for_complex_region","279587391_Automatic_generation_of_truss_model_for_optimal_design_of_reinforced_concrete_structures","275621630_Shear_and_Torsion_Design_of_Prestressed_and_Non-Prestressed_Concrete_Beams","273436034_Continuum_Topology_Optimization_for_Concept_Design_of_Frame_Bracing_Systems","268967189_Topology_optimization_Theory_methods_and_applications_2nd_ed_corrected_printing","265584165_Optimal_strut-and-tie_models_in_reinforced_concrete_structures","257526321_Conceptual_design_of_reinforced_concrete_structures_using_topology_optimization_with_elastoplastic_material_modeling"]}