{"id":"259810884_Dynamic_Epistemic_Logic","abstract":"Dynamic Epistemic Logic is the logic of knowledge change. This is not about one logical system, but about a whole family of logics that allows us to specify static and dynamic aspects of multi-agent systems. This book provides various logics to support such formal specifications, including proof systems. Concrete examples and epistemic puzzles enliven the exposition. The book also contains exercises including answers and is eminently suitable for graduate courses in logic. A sweeping chapter-wise outline of the content of this book is the following. The chapter 'Introduction' informs the reader about the history of the subject, and its relation to other disciplines. 'Epistemic Logic' is an overview of multi-agent epistemic logic - the logic of knowledge - including modal operators for groups, such as general and common knowledge. 'Belief Revision' is an overview on how to model belief revision, both in the 'traditional' way and in a dynamic epistemic setting. 'Public Announcements' is a detailed and comprehensive introduction into the logic of knowledge to which dynamic operators for truthful public announcement are added. Many interesting applications are also presented in this chapter: a form of cryptography for ideal agents also known as 'the russian cards problem', the sum-and-product riddle, etc. 'Epistemic Actions' introduces a generalization of public announcement logic to more complex epistemic actions. A different perspective on that matter is independently presented in 'Action Models'. 'Completeness' gives details on the completeness proof for the logics introduced in 'Epistemic Logic', 'Public Announcements', and 'Action Models'. 'Expressivity' discusses various results on the expressive power of the logics presented.","authors":["Hans van Ditmarsch","Wiebe van der Hoek","Barteld Pieter Kooi"],"meta":["January 2008","DOI:10.1007/978-1-4020-5839-4","Publisher: SpringerISBN: 978-1-4020-6908-6"],"references":[]}