{"id":"259998496_Notional_Machines_and_Introductory_Programming_Education","abstract":"This article brings together, summarizes, and comments on several threads of research that have contributed to our understanding of the challenges that novice programmers face when learning about the runtime dynamics of programs and the role of the computer in program execution. More specifically, the review covers the literature on programming misconceptions, the cognitive theory of mental models, constructivist theory of knowledge and learning, phenomenographic research on experiencing programming, and the theory of threshold concepts. These bodies of work are examined in relation to the concept of a “notional machine”—an abstract computer for executing programs of a particular kind. As a whole, the literature points to notional machines as a major challenge in introductory programming education. It is argued that instructors should acknowledge the notional machine as an explicit learning objective and address it in teaching. Teaching within some programming paradigms, such as object-oriented programming, may benefit from using multiple notional machines at different levels of abstraction. Pointers to some promising pedagogical techniques are provided.","authors":["Juha Sorva"],"meta":["June 2013ACM Transactions on Computing Education 13(2):8:1-8:31","DOI:10.1145/2483710.2483713"],"references":["347784294_Threshold_Concepts_within_the_Disciplines","336099530_Threshold_Concepts_In_Computer_Science_A_Multi-National_Empirical_Investigation","336090610_The_Everydayness_of_Threshold_Concepts_State_as_an_Example_from_Computer_Science","321567827_Computer_Science_Education_in_the_21st_Century","303990302_Overcoming_Barriers_to_Student_Understanding_Threshold_concepts_and_troublesome_knowledge","292981243_Constructivism_in_Education","285896994_Constructivism_and_troublesome_knowledge","285622131_The_Good_the_Bad_and_the_Ugly","285473047_Threshold_concepts_and_troublesome_knowledge_Linkages_to_ways_of_thinking_and_practising_within_the_disciplines","282180944_Metacognition_affect_and_conceptual_difficulty"]}