{"id":"259974069_Application_of_Geographic_Information_System_to_Solid_Waste_Management","abstract":"Waste management is a global observable occurrence. It constitutes a huge environmental problem if notproperly supervised. There is a considerable amount of waste disposal without proper planning which has led to both economic and environment challenges. There is a tremendous amount of loss in terms of environmental degradation, health hazards and economic descend due to direct disposal of waste. GIS is a tool that enhances effective coordination of spatial data. However, this effective planning tool has not been used in most African countries, particularly Nigeria, for managing waste disposal. On the technology side, existing systems are often closed and un-commercialised forcing agencies to use GIS solutions that are primarily not for waste disposal thereby limiting developing countries environmental management effort. This work develops a system that enhances waste management authority in planning and combating the menace of the improper solid waste disposal. The developed system solves the problem of allocation and relocation of waste bins, no separate bins for recyclable waste, and no direct communication means between citizen and waste management authority. A survey with 60 respondentswithin the study area was carried out. The analysis of the result that 90% of the residents uses personal house waste bins to collect and store their garbage before dumping it into the municipal waste bin and it was seen that 65% keep the garbage for 1 or 2 days and 30% keep it for 2 to 3days while 5% keep it for 3 to 4days. It was also seen that 70% had given a preference of 100 meters as a convenient distance to the municipal waste bins.","authors":["Olumuyiwa Ibidunmoye","Aderonke Thompson","Abimbola Helen Afolayan","Ibidunmoye E.O."],"meta":["July 2013","DOI:10.1109/SCAT.2013.7055110","Conference: Pan African International Conference on Information Science, Computing and TelecommunicationsAt: Zambia"],"references":["325568126_GIS_Based_Solutions_for_Waste_Disposals_-_Geospatial_World","228363008_Solid_and_Liquid_Waste_Management","300503928_Solid_Waste_Management","293306818_Solid_waste_management","292203821_REMOTE_SENSING_APPLICATIONS_TO_OCEANS","265489527_Using_GIS_in_Solid_Waste_Management_Planning_A_case_study_for_Aurangabad_India","265032572_FEASIBILITY_AND_ACTION_PLAN_FOR_COMPOSTING_OPERATION_INCORPORATING_APPROPRIATE_TECHNOLOGY_AT_RIVERTON_DISPOSAL_SITE_KINGSTON_JAMAICA","228819583_The_history_of_environmental_policy_and_pollution_of_water_sources_in_Nigeria_1960-2004_The_way_forward","35083991_Mathematical_model_for_strategy_evaluation_of_municipal_solid_waste_management_systems"]}