{"id":"259922042_Spatial_Education_for_Different_User_Groups_as_a_Prerequisite_for_Creating_a_Spatially_Enabled_Society_and_Leveraging_SDI","abstract":"During recent years spatial data infrastructure (SDI) concepts have developed towards user-centered initiatives, whose creation is strongly driven by user requirements. Closely related to (user-centric) SDIs is the vision of spatially enabled societies where access to and use of spatial data is regarded as relevant support for everyone to organize their activities. Both user-centric SDI models and the concept of spatially enabled societies focus on large and diverse user communities encompassing, besides public and private sector organizations, the general public as well. Although the benefits of spatial data use for professional reasons are widely recognized, awareness of the potential advantages for private life such as activities related to citizenship (civic duties and rights) has only recently been raised. Nevertheless, most citizens, as non-professionals regarding spatial data use, face difficulties when carrying out tasks related to the use of resources provided by a SDI. While capacity building is a long-established feature to ensure effective use by professionals, the need for citizens’ spatial education has lately become an important consideration. This asks, on the one hand, for the specification of skills and competencies required on the part of citizens to open up opportunities to benefit from SDIs and on the other hand, suitable education initiatives addressing the general public. Therefore, this paper argues that “Spatial Citizenship” seems to be an appropriate education approach to train user groups as pupils/ students and adults (non-GI professionals), who demand for different education initiatives adjusted to their particular situation.\nURL: https://ijsdir.sadl.kuleuven.be/index.php/ijsdir/article/view/336/352","authors":["Sabine Hennig","Robert Vogler","Inga Gryl"],"meta":["December 2013International Journal of Spatial Data Infrastructures Research 2013(8):98-127","DOI:10.2902/1725-0463.2013.08.art5","Project: NaturSDI-plus"],"references":["302373979_Toward_a_Participatory_Geographic_Information_Science","291089003_Defining_global_geospatial_data_infrastructure_GGDI_components_stakeholders_and_interfaces","277047604_Spatially_Enabled_society","273954381_Mapping_Children's_Politics_The_Promise_of_Articulation_and_the_Limits_of_Nonrepresentational_Theory","273577457_The_Institutionalization_of_Regions_A_Theoretical_Framework_for_Understanding_the_Emergence_of_Regions_and_the_Constitution_of_Regional_Identity","338931672_Die_Geo-Komponente_in_der_Informationsgesellschaft_-_auf_dem_Weg_zur_Geo-Kommunikation","297332648_Ground_Truth_The_Social_Implications_of_Geographic_Information_Systems","296888874_Mark_Twain_A_Short_Introduction","274192547_Re-centring_Geoinformation_in_Secondary_Education_Toward_a_Spatial_Citizenship_Approach","268012412_Global_Spatial_Data_Infrastructure_GSDI_Encouraging_SDI_Development_Internationally"]}