{"id":"260010809_Grey_Wolf_Optimizer","abstract":"This work proposes a new meta-heuristic called Grey Wolf Optimizer (GWO) inspired by grey wolves (Canis lupus). The GWO algorithm mimics the leadership hierarchy and hunting mechanism of grey wolves in nature. Four types of grey wolves such as alpha, beta, delta, and omega are employed for simulating the leadership hierarchy. In addition, the three main steps of hunting, searching for prey, encircling prey, and attacking prey, are implemented. The algorithm is then benchmarked on 29 well-known test functions, and the results are verified by a comparative study with Particle Swarm Optimization (PSO), Gravitational Search Algorithm (GSA), Differential Evolution (DE), Evolutionary Programming (EP), and Evolution Strategy (ES). The results show that the GWO algorithm is able to provide very competitive results compared to these well-known meta-heuristics. The paper also considers solving three classical engineering design problems (tension/compression spring, welded beam, and pressure vessel designs) and presents a real application of the proposed method in the field of optical engineering. The results of the classical engineering design problems and real application prove that the proposed algorithm is applicable to challenging problems with unknown search spaces.","authors":["Seyedali Mirjalili","Seyed Mohammad Mirjalili","Andrew Lewis"],"meta":["March 2014Advances in Engineering Software 69:46–61","DOI:10.1016/j.advengsoft.2013.12.007","Project: Grey Wolf Optimizer (GWO): theories, variants, and applications"],"references":["308953674_Ant_Colony_Optimization","313749844_Particle_swarm_optimization","313151683_Test_functions_for_optimization_needs","304425270_Differential_Evolution_-_A_Simple_and_Efficient_Heuristic_for_global_Optimization_over_Continuous_Spaces","303155163_A_new_metaheuristic_bat-inspired_algorithm_nature_inspired_cooperative_strategies_for_optimization_NISCO_2010","291249072_Artificial_Intelligence_through_Simulated_Evolution","291047084_Use_of_a_self-adaptive_penalty_approach_for_engineering_optimization_problems","285856879_An_efficient_constraint_handling_method_for_genetic_algorithms","285237745_DE-a_simple_and_efficient_heuristic_for_global_optimization_over_continuous_space","283996103_Genetic_Algorithms_In_Search_Optimization_and_Machine_Learning"]}