{"id":"260015399_NeuCube_A_spiking_neural_network_architecture_for_mapping_learning_and_understanding_of_spatio-temporal_brain_data","abstract":"The brain functions as a spatio-temporal information processing machine. Spatio- and spectro-temporal brain data (STBD) are the most commonly collected data for measuring brain response to external stimuli. An enormous amount of such data have been already collected, including brain structural and functional data under different conditions, molecular and genetic data, in an attempt to make a progress in medicine, health, cognitive science, engineering, education, neuro-economics, Brain-Computer Interfaces (BCI), games. Yet, there is no unifying computational framework to deal with all these types of data in order to better understand this data and the processes that generated it. Standard machine learning techniques only partially succeeded and they were not designed in the first instance to deal with such complex data. Therefore, there is a need for a new paradigm to deal with STBD. This paper reviews some methods of spiking neural networks (SNN) and argues that SNN are suitable for the creation of a unifying computational framework for learning and understanding of various STBD, such as EEG, fMRI, genetic, DTI, MEG, NIRS, etc. in their integration and interaction. One of the reasons is that SNN use the same computational principle that generates STBD, namely spiking information processing. This paper introduces a new SNN architecture, called NeuCube, for the creation of concrete models to map, learn and understand STBD. A NeuCube model is based on a 3D evolving SNN that is an approximate map of structural and functional areas of interest of the brain related to the modeling STBD. Gene information is included optionally in the form of gene regulatory networks (GRN) if this is relevant to the problem and the data. A NeuCube model learns from STBD and creates connections between clusters of neurons that manifest chains (trajectories) of neuronal activity. Once learning is applied, a NeuCube model can reproduce these trajectories, even if only part of the input STBD or the stimuli data is presented, thus acting as an associative memory. The NeuCube framework can be used not only to discover functional pathways from data, but also as a predictive system of brain activities, to predict and possibly—prevent certain events. Analysis of the internal structure of a model after training can reveal important spatio-temporal relationships ‘hidden’ in the data. NeuCube will allow the integration in one model of various brain data-, information- and knowledge, related to a single subject (personalized modeling) or to a population of subjects. The use of NeuCube for classification of STBD is illustrated on a case study problem of EEG data. NeuCube models result in a better accuracy of STBD classification than standard machine learning techniques. They are robust to noise (so typical in brain data) and facilitate a better interpretation of the results and understanding of the STBD and the brain conditions under which data was collected. Future directions for the use of SNN for STBD are discussed.","authors":["Nikola Kirilov Kasabov"],"meta":["April 2014Neural networks: the official journal of the International Neural Network Society 52","DOI:10.1016/j.neunet.2014.01.006"],"references":["334542205_The_chronotron_a_neuron_that_learns_to_fire_temporally-precise_spike_patterns","327297935_Computational_Neuro-genetic_Modelling","313694013_String_pattern_recognition_using_evolving_spiking_neural_networks_and_quantum_inspired_particle_swarm_optimization","312912045_On-line_spatiotemporal_pattern_recognition_with_evolving_spiking_neural_networks_utilising_address_event_representation_rank_oder-and_temporal_spike_learning","312911942_Real-time_epileptic_seizure_detection_on_intra-cranial_rat_data_using_reservoircomputing","312911607_Human_activity_detection_using_spiking_neural_networks_regulated_by_a_gene_regulatory_network","301037005_ARTIFICIAL_NEURAL_NETWORKS_OF_THE_PERCEPTRON_MADALINE_AND_BACKPROPAGATION_FAMILY","296417314_The_Tempotron_a_neuron_that_learns_spike-timing_based_decisions","292215395_Neural_networks_and_physical_systems_with_emergent_collective_computational_abilities","289934219_Automated_Talairach_Atlas_labels_for_functional_brain_mapping"]}