{"id":"260021509_A_New_Method_for_Solving_Polynomial_Systems_with_Noise_over_F2_and_Its_Applications_in_Cold_Boot_Key_Recovery","abstract":"The family of Max-PoSSo problems is about solving polyno- mial systems with noise, and is analogous to the well-known Max-SAT fam- ily of problems when the ground field is F2. In this paper, we present a new method called ISBS for solving the family of Max-PoSSo problems over F2 . This method is based on the ideas of incrementally solving polynomial sys- tem and searching the values of polynomials with backtracking. The ISBS method can be combined with different algebraic methods for solving poly- nomial systems, such as the Gr ̈obner Basis method or the Characteristic Set(CS) method. By combining with the CS method, we implement ISBS and apply it in Cold Boot attacks. A Cold Boot attack is a type of side chan- nel attack in which an attacker recover cryptographic key material from DRAM relies on the data remanence property of DRAM. Cold Boot key re- covery problems of block ciphers can be modeled as Max-PoSSo problems over F2. We apply the ISBS method to solve the Cold Boot key recovery problems of AES and Serpent, and obtain some experimental results which are better than the existing ones.","authors":["Zhenyu Huang"],"meta":["January 2013"],"references":["257682696_Parametric_equation_solving_and_quantifier_elimination_in_finite_fields_with_the_characteristic_set_method","225799891_A_characteristic_set_method_for_solving_Boolean_equations_and_applications_in_cryptanalysis_of_stream_ciphers","221651908_Cold_Boot_Key_Recovery_by_Solving_Polynomial_Systems_with_Noise","221462145_Attacking_Bivium_and_Trivium_with_the_Characteristic_Set_Method","221062015_Zero-Suppressed_BDDs_for_Set_Manipulation_in_Combinatorial_Problems","285022936_Basic_principles_of_mechanical_theorem_proving_in_elementary_geometries","257253103_Characteristic_set_algorithms_for_equation_solving_in_finite_fields","239086442_A_New_Efficient_Algorithm_for_Computing_Grobner_Bases_F4","234792420_A_new_efficient_algorithm_for_computing_Grobner_bases_without_reduction_to_zero_F_5","221462820_Satisfying_Degree-d_Equations_over_GF2n"]}