{"id":"260190061_20_Years_of_Pattern_Mining_a_Bibliometric_Survey","abstract":"In 1993, Rakesh Agrawal, Tomasz Imielinski and Arun N. Swami published one of the founding papers of Pattern Mining: \"Mining Association Rules between Sets of Items in Large Databases\". Beyond the introduction to a new problem, it introduced a new methodology in terms of resolution and evaluation. For two decades, Pattern Mining has been one of the most active fields in Knowledge Discovery in Databases. This paper provides a bibliometric survey of the literature relying on 1,087 publications from five major international conferences: KDD, PKDD, PAKDD, ICDM and SDM. We first measured a slowdown of research dedicated to Pattern Mining while the KDD field continues to grow. Then, we quantified the main contributions with respect to languages, constraints and condensed representations to outline the current directions. We observe a sophistication of languages over the last 20 years, although association rules and itemsets are so far the most studied ones. As expected, the minimal support constraint predominates the extraction of patterns with approximately 50% of the publications. Finally, condensed representations used in 10% of the papers had relative success particularly between 2005 and 2008.","authors":["Arnaud Giacometti","Dominique H. Li","Patrick Marcel","Arnaud Soulet"],"meta":["January 2013ACM SIGKDD Explorations Newsletter 15(1):41-50","DOI:10.1145/2594473.2594480"],"references":["307174918_Mining_association_rules_between_sets_of_items_in_large_databases","235621958_Phylomemetic_Patterns_in_Science_Evolution-The_Rise_and_Fall_of_Scientific_Fields","228459588_A_Survey_of_Frequent_Subgraph_Mining_Algorithms","313553730_Constrained_frequent_pattern_mining_A_pattern-growth_view","310606656_Classification_and_regression_trees","307175251_Induction_of_Decision_Trees","277517189_Summary_from_the_KDD-03_panel","240310918_Classification_and_Regression_Trees_CART","228396750_Discovery_Analysis_and_Presentation_of_Strong_Rules","226393126_Pattern_Detection_and_Discovery"]}