{"id":"260186291_Growing_the_use_of_Virtual_Worlds_in_education_an_OpenSim_perspective","abstract":"The growth in the range of disciplines that Virtual Worlds support for educational purposes is evidenced by recent applications in the fields of cultural heritage, humanitarian aid, space exploration, virtual laboratories in the physical sciences, archaeology, computer science and coastal geography. This growth is due in part to the flexibility of OpenSim, the open source virtual world platform which by adopting Second Life protocols and norms has created a de facto standard for open virtual worlds that is supported by a growing number of third party open source viewers. Yet while this diversity of use-cases is impressive and Virtual Worlds for open learning are highly popular with lecturers and learners alike immersive education remains an essentially niche activity. This paper identifies functional challenges in terms of Management, Network Infrastructure, the Immersive 3D Web and Programmability that must be addressed to enable the wider adoption of Open Virtual Worlds as a routine learning technology platform. We refer to specific use-cases based on OpenSim and abstract generic requirements which should be met to enable the growth in use of Open Virtual Worlds as a mainstream educational facility. A case study of a deployment to support a formal education curriculum and associated informal learning is used to illustrate key points.","authors":["Colin Allison","Anne Campbell","Christopher John Davies","Lisa Dow"],"meta":["January 2012"],"references":["260186453_Managing_humanitarian_emergencies_Teaching_and_learning_with_a_virtual_humanitarian_disaster_tool","260186383_Policy_Considerations_for_Managing_3D_Multi_User_Learning_Environments-Achieving_Usability_and_Trust_for_Learning","242762265_Experiential_Learning_Theory_Previous_Research_and_New_Directions","240319548_Developing_intercultural_competence_through_videogames","313193607_Role_based_access_control_models","290673358_Effective_policy_based_management_of_3D_MULE_An_exploratory_study_towards_developing_student_supportive_policy_considerations","281562731_State_of_the_Internet_Akamai","260186463_Virtual_Worlds_as_a_Platform_for_3D_Application_Development","228038521_Second_Life_in_higher_education_Assessing_the_potential_for_and_the_barriers_to_deploying_virtual_worlds_in_learning_and_teaching","225207995_Designing_Online_Virtual_Worlds_for_Cultural_Heritage"]}