{"id":"260295445_Minimizing_Running_Costs_in_Consumption_Systems","abstract":"A standard approach to optimizing long-run running costs of discrete systems\nis based on minimizing the mean-payoff, i.e., the long-run average amount of\nresources (\"energy\") consumed per transition. However, this approach inherently\nassumes that the energy source has an unbounded capacity, which is not always\nrealistic. For example, an autonomous robotic device has a battery of finite\ncapacity that has to be recharged periodically, and the total amount of energy\nconsumed between two successive charging cycles is bounded by the capacity.\nHence, a controller minimizing the mean-payoff must obey this restriction. In\nthis paper we study the controller synthesis problem for consumption systems\nwith a finite battery capacity, where the task of the controller is to minimize\nthe mean-payoff while preserving the functionality of the system encoded by a\ngiven linear-time property. We show that an optimal controller always exists,\nand it may either need only finite memory or require infinite memory (it is\ndecidable in polynomial time which of the two cases holds). Further, we show\nhow to compute an effective description of an optimal controller in polynomial\ntime. Finally, we consider the limit values achievable by larger and larger\nbattery capacity, show that these values are computable in polynomial time, and\nwe also analyze the corresponding rate of convergence. To the best of our\nknowledge, these are the first results about optimizing the long-run running\ncosts in systems with bounded energy stores.","authors":["Tomáš Brázdil","David Klaška","Antonín Kucera","Petr Novotný"],"meta":["February 2014","DOI:10.1007/978-3-319-08867-9_30","SourcearXiv","Conference: International Conference on Computer Aided Verification"],"references":["262394662_Playing_Games_with_Counter_Automata","262256395_Polynomial-Time_Algorithms_for_Energy_Games_with_Special_Weight_Structures","226777210_Infinite_Runs_in_Weighted_Timed_Automata_with_Energy_Constraints","226182550_Energy_Games_in_Multiweighted_Automata","225949495_Reachability_Games_on_Extended_Vector_Addition_Systems_with_States","224907495_Minimizing_Expected_Termination_Time_in_One-Counter_Markov_DecisionProcesses","221661834_Efficient_Controller_Synthesis_for_Consumption_Games_with_MultipleResource_Types","309898404_Games_and_Markov_decision_processes_with_mean-payoff_parity_and_energy_parity_objectives","237617986_Weighted_Timed_Automata_with_Energy_Constraints","235033582_FINDING_A_CYCLE_IN_A_GRAPH_WITH_MINIMUM_COST_TO_TIME_RATIO_WITH_APPLICATION_TO_A_SHIP_ROUTING_PROBLEM"]}