{"id":"260254488_Equation-oriented_specification_of_neural_models_for_simulations","abstract":"Simulating biological neuronal networks is a core method of research in computational neuroscience. A full specification of such a network model includes a description of the dynamics and state changes of neurons and synapses, as well as the synaptic connectivity patterns and the initial values of all parameters. A standard approach in neuronal modeling software is to build network models based on a library of pre-defined components and mechanisms; if a model component does not yet exist, it has to be defined in a special-purpose or general low-level language and potentially be compiled and linked with the simulator. Here we propose an alternative approach that allows flexible definition of models by writing textual descriptions based on mathematical notation. We demonstrate that this approach allows the definition of a wide range of models with minimal syntax. Furthermore, such explicit model descriptions allow the generation of executable code for various target languages and devices, since the description is not tied to an implementation. Finally, this approach also has advantages for readability and reproducibility, because the model description is fully explicit, and because it can be automatically parsed and transformed into formatted descriptions. The presented approach has been implemented in the Brian2 simulator.","authors":["Marcel Stimberg","Dan F M Goodman","Victor Benichoux","Romain Brette"],"meta":["February 2014Frontiers in Neuroinformatics 8(February):6","DOI:10.3389/fninf.2014.00006","SourcePubMed","Project: Brian 2"],"references":["230893250_Creating_documenting_and_sharing_network_models","230686720_On_the_design_of_script_languages_for_neural_simulation","226367060_NineML_The_Network_Interchange_for_Neuroscience_Modeling_Language","225953373_Synthesis_of_models_for_excitable_membranes_synaptic_transmission_and_neuromodulation_using_a_common_kinetic_formalism","281203447_Simulation_of_networks_of_spiking_neurons_A_review_of_tools_and_strategies","258217433_Differential_equations_dynamical_systems_and_linear_algebra","257239492_Automated_Capture_of_Experiment_Context_for_Easier_Reproducibility_in_Computational_Research","254003754_Open_source_computer_algebra_systems_SymPy","243769655_Column_and_map_development_and_cortical_re-mapping_through_spike-timing_dependent_plasticity","242405619_The_Neuron_Book"]}