{"id":"260254555_optGpSampler_An_Improved_Tool_for_Uniformly_Sampling_the_Solution-Space_of_Genome-Scale_Metabolic_Networks","abstract":"Constraint-based models of metabolic networks are typically underdetermined, because they contain more reactions than metabolites. Therefore the solutions to this system do not consist of unique flux rates for each reaction, but rather a space of possible flux rates. By uniformly sampling this space, an estimated probability distribution for each reaction’s flux in the network can be obtained. However, sampling a high dimensional network is time-consuming. Furthermore, the constraints imposed on the network give rise to an irregularly shaped solution space. Therefore more tailored, efficient sampling methods are needed. We propose an efficient sampling algorithm (called optGpSampler), which implements the Artificial Centering Hit-and-Run algorithm in a different manner than the sampling algorithm implemented in the COBRA Toolbox for metabolic network analysis, here called gpSampler. Results of extensive experiments on different genome-scale metabolic networks show that optGpSampler is up to 40 times faster than gpSampler. Application of existing convergence diagnostics on small network reconstructions indicate that optGpSampler converges roughly ten times faster than gpSampler towards similar sampling distributions. For networks of higher dimension (i.e. containing more than 500 reactions), we observed significantly better convergence of optGpSampler and a large deviation between the samples generated by the two algorithms. Availability:\noptGpSampler for Matlab and Python is available for non-commercial use at: http://cs.ru.nl/~wmegchel/optGpSampler/.","authors":["Wout Megchelenbrink","Martijn Huynen","Elena Marchiori"],"meta":["February 2014PLoS ONE 9(2):e86587","DOI:10.1371/journal.pone.0086587","SourcePubMed"],"references":["317415309_Operations_research_applications_and_algorithms","284760600_Evaluating_the_Accuracy_of_Sampling-Based_Approaches_to_the_Calculation_of_Posterior_Moments","271076887_Markov_Chain_Monte_Carlo_In_Practice","267465470_Simulation_Run_Length_Control_in_the_Presence_of_An_Initial_Transient","255649541_Direction_Choice_for_Accelerated_Convergence_in_Hit-and-Run_Sampling","248510587_Markov_Chain_Monte_Carlo_Convergence_Diagnostics_A_Comparative_Review","245586762_OpenMP_Application_Program_Interface_--_Version_30","238287929_Operations_Research_Applications_and_Algorithms_4","232787011_Metabolic_Flux_Balancing_Basic_Concepts_Scientific_and_Practical_Use","231587277_Network-based_Analysis_of_Metabolic_Regulation_in_the_Human_Red_Blood_Cell"]}