{"id":"260249957_Occupational_Hazards_Among_Clinical_Dental_Staff","abstract":"Although identification of risks to dental healthcare workers has been explored in several industrialized nations, very little data is available from developing countries. This paper examines the occupational hazards present in the dental environment and reports survey results concerning attitudes and activities of a group of Nigerian dental care providers.\nA survey on occupational hazards was conducted among the clinical dental staff at the Dental Hospital of the Obafemi Awolowo University Teaching Hospital Complex, Ile-Ife in Osun State, Nigeria. Thirty eight of the forty staff responded, yielding a response rate of 95%. Subject ages ranged from 26 to 56 years with approximately 25% in the 31-46 year old bracket. All of the staff were aware of the occupational exposure to hazards, and the majority had attended seminars/workshops on the subject. Only five staff members (13.2%) owned a health insurance policy and 26 (68.4%) had been vaccinated against Hepatitis B infection. All dentists (24) had been vaccinated compared with only two non-dentists; this relationship was significant (p= 30.07, x2=0.000). Fourteen members of the clinical staff (36.8%) could recall a sharp injury in the past six months, and the majority (71.1%) had regular contact with dental amalgam. Wearing protective eye goggles was the least employed cross infection control measure, while backache was the most frequently experienced hazard in 47% of the subjects. The need for Hepatitis B vaccinations for all members of the staff was emphasized, and the enforcement of strict cross infection control measures was recommended. The physical activities and body positions that predispose workers to backaches were identified and staff education on the prevention of backaches was provided.\n\nCitation\nFasunloro A, Owotade FJ. Occupational Hazards Among Clinical Dental Staff. J Contemp Dent Pract 2004 May;(5)2:134-152.","authors":["Adebola Fasunloro","Foluso J Owotade"],"meta":["May 2004The Journal of Contemporary Dental Practice 5(2):134-152","DOI:10.5005/jcdp-5-2-134"],"references":["229732752_Infectious_hepatitis_C_hepatitis_G_and_TT_virus_review_and_implications_for_dentists","21811981_AIDS_and_infection_control_experiences_attitudes_knowledge_and_perception_of_occupational_hazards_among_Nigerian_dentists","21756755_Disinfection_and_sterilisation_the_duties_and_responsibilities_of_dentists_and_dental_hygienists","21347008_Health_Hazards_and_Nitrous_Oxide_A_Time_for_Reappraisal","21324352_Hepatitis_B_vaccination_and_infection_control_in_Brazilian_dental_practice_1990","21320560_Dentists'_perceptions_of_HIVAIDS_as_an_occupational_hazard_a_qualitative_investigation","21014173_The_role_of_biomaterials_as_occupational_hazards_in_dentistry","20192247_Review_of_hepatitis_non-A_non-B_The_potential_hazards_in_dental_care","19680583_Optical_hazard_evaluation_of_dental_curing_lights","14044126_The_use_of_powdered_gloves_in_dental_practice_A_cause_for_concern"]}