{"id":"260358172_Compressing_Network_Access_Control_Lists","abstract":"An access control list (ACL) provides security for a private network by controlling the flow of incoming and outgoing packets. Specifically, a network policy is created in the form of a sequence of (possibly conflicting) rules. Each packet is compared against this ACL, and the first rule that the packet matches defines the decision for that packet. The size of ACLs has been increasing rapidly due to the explosive growth of Internet-based applications and malicious attacks. This increase in size degrades network performance and increases management complexity. In this paper, we propose ACL Compressor, a framework that can significantly reduce the number of rules in an access control list while maintaining the same semantics. We make three major contributions. First, we propose an optimal solution using dynamic programming techniques for compressing one-dimensional range-based access control lists. Second, we present a systematic approach for compressing multidimensional access control lists. Last, we conducted extensive experiments to evaluate ACL Compressor. In terms of effectiveness, ACL Compressor achieves an average compression ratio of 50.22 percent on real-life rule sets. In terms of efficiency, ACL runs in seconds, even for large ACLs with thousands of rules.","authors":["Alex X. Liu","Eric Torng","Chad R. Meiners"],"meta":["December 2011IEEE Transactions on Parallel and Distributed Systems 22(12):1969-1977","DOI:10.1109/TPDS.2011.114","SourceDBLP"],"references":["260353596_Towards_Systematic_Design_of_Enterprise_Networks","224608528_TCAM_razor_A_systematic_approach_towards_minimizing_packet_classifiers_in_TCAMs","224500372_Minimizing_Rulesets_for_TCAM_Implementation","224083820_Bit_Weaving_A_Non-prefix_Approach_to_Compressing_Packet_Classifiers_in_TCAMs","242391317_The_MD5_Message-digest_Algorithm","235720425_US_secure_hash_algorithm_1_SHA-1","225132508_Complete_Redundancy_Detection_in_Firewalls","224378599_Firewall_Rule_Ordering_Based_On_Statistical_Model","224334018_Complete_Redundancy_Removal_for_Packet_Classifiers_in_TCAMs","222817494_Structured_firewall_design"]}