{"id":"260389352_Programacao_Visual_para_um_Framework_de_Desenvolvimento_de_Aplicacoes_Medicas_Baseadas_em_Realidade_Virtual","abstract":"Resumo -Aplicações computacionais baseadas em Realidade Virtual (RV) tem se destacado em tarefas de treinamento e ensino na área médica devido à sua capacidade de simular ambientes e cenários realistas, interativos e imersivos. Estas simulações permitem aos usuários treinar habilidades e a tomada de decisão diante de situações diversas. A complexidade envolvida no processo de geração de aplicações médicas baseadas em RV exige a manipulação de ferramentas computacionais. Neste contexto, se destaca o CyberMed como framework para desenvolvimento de aplicações médicas baseadas em RV. Observa-se que tanto o CyberMed quanto outros frameworks com as mesmas potencialidades não possuem uma interface voltada para leigos em programação de aplicações, como os profissionais de saúde. Esse artigo apresenta um estudo relacionado a estes frameworks, com o objetivo de analisar suas características e verificar o nível de conhecimento necessário para utilizá-los. A partir dessa pesquisa será proposta a criação de um sistema de programação visual integrado ao CyberMed para facilitar a criação de aplicações baseadas em RV para a área médica. Abstract -Computer applications based on Virtual Reality (VR) has been outstanding in training and teaching jobs in the medical field because of its ability to simulate realistic scenarios and environments, interactive and immersive. These simulations allow users to practice skills and decision making in different areas. The complexity involved in the generation of medical applications based RV requires manipulation of computational tools. In this context, CyberMed is a framework for developing medical applications based on VR for medical purposes. It was observed that both the CyberMed as other frameworks with the same capabilities do not have an interface easy to be used by health professionals. This article presents a study related to these frameworks, in order to analyze their characteristics and check the level of knowledge needed to use them. From this research is proposed a visual programming system integrated to CyberMed to facilitate the development of applications based on VR for the medical field.","authors":["Aline Marques De Morais","Liliane S. Machado","Santos Machado"],"meta":[],"references":["267839568_ViRAL_Um_Framework_para_o_Desenvolvimento_de_Aplicacoes_de_Realidade_Virtual","239510886_Dimensions_and_Functions_as_Values","237485103_Desenvolvimento_Rapido_de_Aplicacoes_de_Realidade_Virtual_Utilizando_Software_Livre","228638461_The_Calculadora_Estatistica_for_Present_and_Distance_Learning","40811182_The_GIPSY_architecture","319394793_A_Small_Matter_of_Programming_Perspectives_on_End_User_Computing","262278843_Visual_Programming","252798502_ITK_and_ANALYZE_a_synergistic_integration","238671323_The_Computer_from_Pascal_to_von_Neumann","220566223_Advances_in_dataflow_programming_languages"]}