{"id":"260358189_Scalable_and_Secure_Sharing_of_Personal_Health_Records_in_Cloud_Computing_Using_Attribute-Based_Encryption","abstract":"Personal health record (PHR) is an emerging patient-centric model of health information exchange, which is often outsourced to be stored at a third party, such as cloud providers. However, there have been wide privacy concerns as personal health information could be exposed to those third party servers and to unauthorized parties. To assure the patients' control over access to their own PHRs, it is a promising method to encrypt the PHRs before outsourcing. Yet, issues such as risks of privacy exposure, scalability in key management, flexible access, and efficient user revocation, have remained the most important challenges toward achieving fine-grained, cryptographically enforced data access control. In this paper, we propose a novel patient-centric framework and a suite of mechanisms for data access control to PHRs stored in semitrusted servers. To achieve fine-grained and scalable data access control for PHRs, we leverage attribute-based encryption (ABE) techniques to encrypt each patient's PHR file. Different from previous works in secure data outsourcing, we focus on the multiple data owner scenario, and divide the users in the PHR system into multiple security domains that greatly reduces the key management complexity for owners and users. A high degree of patient privacy is guaranteed simultaneously by exploiting multiauthority ABE. Our scheme also enables dynamic modification of access policies or file attributes, supports efficient on-demand user/attribute revocation and break-glass access under emergency scenarios. Extensive analytical and experimental results are presented which show the security, scalability, and efficiency of our proposed scheme.","authors":["Ming Li","Shucheng Yu","Yao Zheng","Kaili Ren"],"meta":["January 2013IEEE Transactions on Parallel and Distributed Systems 24(1):131-143","DOI:10.1109/TPDS.2012.97"],"references":["346554948_Shared_and_searchable_encrypted_data_for_untrusted_servers","313564280_Over-encryption_Management_of_access_control_evolution_on_outsourced_data","305444617_Revocable_key-policy_attribute-based_encryption_scheme_with_two_revocation_lists","305173678_Key-policy_attribute-based_encryption_scheme_for_general_circuits","282741501_Efficient_key-policy_attribute-based_encryption_scheme","270796052_Health_Insurance_in_Transition_The_Health_Insurance_Portability_and_Accountability_Act_of_1996","262331503_Secure_attribute-based_systems","261318067_DACC_Distributed_Access_Control_in_Clouds","255670422_Ciphertext_Policy_Attribute_Based_Encryption_with_Efficient_Revocation","241017908_Ciphertext-Policy_Attribute-Based_Threshold_Decryption_with_Flexible_Delegation_and_Revocation_of_User_Attributes"]}