{"id":"260382037_Parsimonious_Path_Openings_and_Closings","abstract":"Path openings and closings are morphological tools used to preserve long, thin, and tortuous structures in gray level images. They explore all paths from a defined class, and filter them with a length criterion. However, most paths are redundant, making the process generally slow. Parsimonious path openings and closings are introduced in this paper to solve this problem. These operators only consider a subset of the paths considered by classical path openings, thus achieving a substantial speed-up, while obtaining similar results. In addition, a recently introduced 1D opening algorithm is applied along each selected path. Its complexity is linear with respect to the number of pixels, independent of the size of the opening. Furthermore, it is fast for any input data accuracy (integer or floating point) and works in stream. Parsimonious path openings are also extended to incomplete paths, i.e., paths containing gaps. Noise-corrupted paths can thus be processed with the same approach and complexity. These parsimonious operators achieve a several orders of magnitude speed-up. Examples are shown for incomplete path openings, where computing times are brought from minutes to tens of milliseconds, while obtaining similar results.","authors":["Vincent Morard","Petr Dokladal","Etienne Decencière"],"meta":["April 2014IEEE Transactions on Image Processing 23(4):1543-55","DOI:10.1109/TIP.2014.2303647","SourcePubMed"],"references":["266630541_Region_Growing_Structuring_Elements_and_New_Operators_Based_on_Their_Shape","258655711_One-Dimensional_Openings_Granulometries_and_Component_Trees_in_O1_Per_Pixel","257581878_Efficient_Geodesic_Attribute_Thinnings_Based_on_the_Barycentric_Diameter","293497374_Dynamic_programming","277286121_Comprehensive_Survey_on_DistanceSimilarity_Measures_Between_Probability_Density_Functions","264960216_Image_analysis_and_mathematical_morphology_English_version_rev_by_Noel_Cressie","262208704_Multiscale_Detection_of_Curvilinear_Structures_in_2-D_and_3-D_Image_Data","259341431_Dynamic_Programming","255908334_Efficient_Robust_d-Dimensional_Path_Operators","251399515_Historical_overview_of_image_analysis_and_mathematical_morphology"]}