{"id":"260349786_Robust_Part-Based_Hand_Gesture_Recognition_Using_Kinect_Sensor","abstract":"The recently developed depth sensors, e.g., the Kinect sensor, have provided new opportunities for human-computer interaction (HCI). Although great progress has been made by leveraging the Kinect sensor, e.g., in human body tracking, face recognition and human action recognition, robust hand gesture recognition remains an open problem. Compared to the entire human body, the hand is a smaller object with more complex articulations and more easily affected by segmentation errors. It is thus a very challenging problem to recognize hand gestures. This paper focuses on building a robust part-based hand gesture recognition system using Kinect sensor. To handle the noisy hand shapes obtained from the Kinect sensor, we propose a novel distance metric, Finger-Earth Mover's Distance (FEMD), to measure the dissimilarity between hand shapes. As it only matches the finger parts while not the whole hand, it can better distinguish the hand gestures of slight differences. The extensive experiments demonstrate that our hand gesture recognition system is accurate (a 93.2% mean accuracy on a challenging 10-gesture dataset), efficient (average 0.0750 s per frame), robust to hand articulations, distortions and orientation or scale changes, and can work in uncontrolled environments (cluttered backgrounds and lighting conditions). The superiority of our system is further demonstrated in two real-life HCI applications.","authors":["Zhou Ren","Junsong Yuan","Jingjing Meng","Zhengyou Zhang"],"meta":["August 2013IEEE Transactions on Multimedia 15(5):1110-1120","DOI:10.1109/TMM.2013.2246148"],"references":["248609712_Hand_Motion_from_3D_Point_Trajectories_and_a_Smooth_Surface_Model","228659202_A_review_of_vision_based_hand_gesture_recognition","277460483_Image_retrieval","261283562_Mining_Actionlet_Ensemble_for_Action_Recognition_with_Depth_Cameras","257925052_The_Earth_Mover's_Distance_as_a_metric_for_image_retrieval","256084991_Minimum_Near-Convex_Shape_Decomposition","255563558_Fitting_parameterised_3D_models_to_images","247492327_Sequential_Monte_Carlo_in_Practice","239317040_Local_Features_and_Kernels_for_Classification_of_Texture_and_Object_Categories_A_Comprehensive_Study","228803789_Fitting_parameterized_3-D_models_to_images"]}