{"id":"260373545_Neuronal_Machinery_of_Sleep_Homeostasis_in_Drosophila","abstract":"Sleep is under homeostatic control, but the mechanisms that sense sleep need and correct sleep deficits remain unknown. Here, we report that sleep-promoting neurons with projections to the dorsal fan-shaped body (FB) form the output arm of Drosophila's sleep homeostat. Homeostatic sleep control requires the Rho-GTPase-activating protein encoded by the crossveinless-c (cv-c) gene in order to transduce sleep pressure into increased electrical excitability of dorsal FB neurons. cv-c mutants exhibit decreased sleep time, diminished sleep rebound, and memory deficits comparable to those after sleep loss. Targeted ablation and rescue of Cv-c in sleep-control neurons of the dorsal FB impair and restore, respectively, normal sleep patterns. Sleep deprivation increases the excitability of dorsal FB neurons, but this homeostatic adjustment is disrupted in short-sleeping cv-c mutants. Sleep pressure thus shifts the input-output function of sleep-promoting neurons toward heightened activity by modulating ion channel function in a mechanism dependent on Cv-c.","authors":["Jeff Donlea","Diogo Pimentel","Gero Miesenböck"],"meta":["February 2014Neuron 81(4):860-72","DOI:10.1016/j.neuron.2013.12.013","SourcePubMed"],"references":["304541571_Natural_Waking_and_Sleep_States_A_View_From_Inside_Neocortical_Neurons","264935772_A_Dynamic_Deep_Sleep_Stage_in_Drosophila","313375599_Sleep_Deprivation_Specifically_Impairs_Short-term_Olfactory_Memory_in_Drosophila","304541564_Thalamocortical_oscillations_in_the_sleeping_and_aroused_brain","292215471_Clock_Mutants_of_Drosophila_melanogaster","277551080_Adenosine_A_Mediator_of_the_Sleep-Inducing_Effects_of_Prolonged_Wakefulness","247372691_Sleep_and_Synaptic_Homeostasis","245589032_Brain_Stem_Control_of_Wakefulness_and_Sleep","236602360_Sleep_and_the_single_neuron_The_role_of_global_slow_oscillations_in_individual_cell_rest","236225028_A_Dynamic_Deep_Sleep_Stage_in_Drosophila"]}