{"id":"260409417_NDTAODV_Neighbor_Defense_Technique_for_Ad_Hoc_On-Demand_Distance_Vector_AODV_to_Mitigate_Flood_Attack_in_Manets","abstract":"Mobile Ad Hoc Networks (MANETs) are collections of mobile nodes that can communicate with one another\nusing multihop wireless links. MANETs are often deployed in the environments, where there is no\nfixed infrastructure and centralized management. The nodes of mobile ad hoc networks are susceptible to\ncompromise. In such a scenario, designing an efficient, reliable and secure routing protocol has been a\nmajor challengesue over the last many years. The routing protocol Ad hoc On-demand Distance Vector\n(AODV) has no security measures in-built in it. It is vulnerable to many types of routing attacks. The flood\nattack is one of them. In this paper, we propose a simple and effective technique to secure Ad hoc Ondemand\nDistance Vector (AODV) routing protocol against flood attacks. To deal with a flood attack, we\nhave proposed Neighbor Defense Technique for Ad hoc On-demand Distance Vector (NDTAODV). This\nmakes AODV more robust. The proposed technique has been designed to isolate the flood attacker with the\nuse of timers, peak value and hello alarm technique.\nWe have simulated our work in Network Simulator NS-2.33 (NS-2) with different pause times by way of\ndifferent number of malicious nodes. We have compared the performance of NDTAODV with the AODV in\nnormal situation as well as in the presence of malicious attacks. We have considered Packet Delivery\nFraction (PDF), Average Throughput (AT) and Normalized Routing Load (NRL) for comparing the performance\nof NDTAODV and AODV.","authors":["Akshai Aggarwal","Savita Gandhi","Nirbhay Chaubey","Naren Tada"],"meta":["January 2014International Journal of Computer Networks and Communications 6(1):19-32","DOI:10.5121/ijcnc.2014.6102","Project: Security in Mobile Cloud Computing Environment"],"references":["308631954_A_new_routing_attack_in_mobile_ad_hoc_networks","260127250_Performance_Analysis_of_AODV_DSDV_and_DSR_in_MANETs","241636880_Scenario-based_performance_comparison_of_reactive_proactive_Hybrid_protocols_in_MANET","230639532_AODVSEC_A_Novel_Approach_to_Secure_Ad_Hoc_on-Demand_Distance_VectorAODV_Routing_Protocol_from_Insider_Attacks_in_MANETs","221327550_Mitigating_Route_Request_Flooding_Attacks_in_Mobile_Ad_Hoc_Networks","46093611_Hello_Flood_Attack_and_its_Countermeasures_in_Wireless_Sensor_Networks","41845830_A_Review_of_Current_Routing_Attacks_in_Mobile_Ad_Hoc_Networks","41392265_DPRAODV_a_dynamic_learning_system_against_blackhole_attack_in_AODV_based_MANET","263747621_Performance_Analysis_of_Flooding_Attack_Prevention_Algorithm_in_MANETs","224120219_Effect_of_Routing_Misbehavior_in_Mobile_Ad_Hoc_Network"]}