{"id":"260586219_Direct_Causality_Detection_via_the_Transfer_Entropy_Approach","abstract":"The detection of direct causality, as opposed to indirect causality, is an important and challenging problem in root cause and hazard propagation analysis. Several methods provide effective solutions to this problem when linear relationships between variables are involved. For nonlinear relationships, currently only overall causality analysis can be conducted, but direct causality cannot be identified for such processes. In this paper, we describe a direct causality detection approach suitable for both linear and nonlinear connections. Based on an extension of the transfer entropy approach, a direct transfer entropy (DTE) concept is proposed to detect whether there is a direct information flow pathway from one variable to another. Especially, a differential direct transfer entropy concept is defined for continuous random variables, and a normalization method for the differential direct transfer entropy is presented to determine the connectivity strength of direct causality. The effectiveness of the proposed method is illustrated by several examples, including one experimental case study and one industrial case study.","authors":["Ping Duan","Fan Yang","Tongwen Chen","Sirish Shah"],"meta":["November 2013Control Systems Technology, IEEE Transactions on 21(6):2052-2066","DOI:10.1109/TCST.2012.2233476"],"references":["268146885_Equivalence_of_Granger_Causality_and_Transfer_Entropy_A_Generalization","324410153_Density_Estimation_for_Statistics_and_Data_Analysis","324354916_Applied_Multivariate_Statistical_Analysis","316233523_Specifying_the_directionality_of_fault_propagation_paths_using_transfer_entropy","314787784_Applied_Multivariate_Statistical_Analysis","292965580_The_kernel_method_for_univariate_data","288368445_Confounding_Effects_of_Indirect_Connections_on_Causality_Estimation","283617632_Investigating_Causal_Relations_by_Econometric_Models_and_Cross-Spectral_Methods","278714342_Information_Theory_and_Network_Coding","266920237_Information_Theory_and_Network_Coding"]}