{"id":"260523260_Concept_Principle_and_Application_of_Dynamic_Configuration_for_Intelligent_Algorithms","abstract":"Since genetic algorithm (GA) presented decades ago, large amount of intelligent algorithms and their improvements and mixtures have been putting forward one after another. However, little works have been done to extend their applications and verify their competence in different problems. For each specific complex problem, people always take a long time to find appropriate intelligent algorithm and develop improvements. To overcome these shortcomings, new dynamic configuration methods for intelligent algorithms (DC-IA) is presented in this paper on the basis of the requirements of three kinds of algorithm users. It separates the optimization problems and intelligent algorithms, modularizes each step of algorithms and extracts their core operators. Based on the coarse-grained operator modules, three-layer dynamical configurations, i.e., parameter-based configuration, operator-based configuration and algorithm-based configuration, are fully exploited and implemented. Under these methods, dozens of hybrid and improved intelligent algorithms can be easily produced in a few minutes just based on several configurable operator modules. Also, problem-oriented customizations in configurations can further extend the application range and advance the efficiency of the existing operators enormously. Experiments based on the established configuration platform verify the new configuration ways of applying and improving intelligent algorithm for both numerical and combinatorial optimization problems in industries on aspects of flexibility, robustness, and reusability.","authors":["Fei Tao","Yuanjun Laili","Yilong Liu","Ying Feng"],"meta":["March 2014IEEE Systems Journal 8(1):28-42","DOI:10.1109/JSYST.2013.2275619"],"references":["274995092_Utility_modelling_equilibrium_and_coordination_of_resource_service_transaction_in_service-oriented_manufacturing_system","267553084_On_the_Approximability_of_NP-complete_Optimization_Problems","266880452_Cloud_manufacturing_A_computing_and_service-oriented_manufacturing_model","321620224_Numerical_Optimization","313749844_Particle_swarm_optimization","313706874_Adaptation_in_natural_and_artificial_systems","285906939_Numerical_optimization","273453883_Particle_Swarm_Optimization","266476828_The_immune_system_adaptation_and_machne_learning","264996084_Polyhedral_combinatorics_and_combinatorial_optimization"]}