{"id":"260520661_Standard_Simplices_and_Pluralities_are_Not_the_Most_Noise_Stable","abstract":"The Standard Simplex Conjecture and the Plurality is Stablest Conjecture are two conjectures stating that certain partitions are optimal with respect to Gaussian and discretenoise stability respectively. These two conjectures are natural generalizations of the Gaussian noise stability result by Borell (1985) and the Majority is Stablest Theorem (2004). Here we show that the standard simplex is not the most stable partition in Gaussian space and that Plurality is not the most stable low inuence partition in discrete space for every number of parts k > 3, for every value ρ ≠ of the noise and for every prescribed measures for the different parts as long as they are not all equal to 1/k. Our results do not contradict the original statements of the Plurality is Stablest and Standard Simplex Conjectures concerning partitions into sets of equal measure. However, they indicate that if these conjectures are true, their veracity and their proofs will crucially rely on assuming that the sets are of equal measures, in stark contrast to Borell's result, the Majority is Stablest Theorem and many other results in isoperimetric theory.\nIn other words, the optimal partitions for noise stability are of a different nature than the ones considered for partitions into three parts in isoperimetric theory. In the latter case, the standard simplex is the partition of the plane into three sets of smallest Gaussian perimeter, where the sets are restricted to have Gaussian measures a1, a2, a3 > 0 respectively, with a1 + a2 + a3 = 1 and |ai --1/3| i ∈ {1, 2, 3}. Thus, we now know that the extension of noise stability theory from two to three or more parts is very much different than the extension of isoperimetric theory from two to three or more parts. Moreover, all existing proofs which optimize noise stability of two sets must fail for more than three sets, since these proofs rely on the fact that a half-space optimizes noise stability with respect to any measure restriction. Given our results it is natural to ask for (conjectured) partitions achieving the optimum noise stability.\nThe main new ingredient in our work shows that the Ornstein-Uhlenbeck operator applied to the indicator function of a simplicial cone becomes holomorphic when restricted to certain lines. This holomorphicity condition, when combined with a first variation argument (i.e. an innite dimensional perturbative argument of the rst order), then shows that any simplicial cone can be perturbed in a volume-preserving manner to improve its noise stability. Such a holomorphicity argument seems unavailable for the is operimetric problem, since this argument uses the inherent non-locality of the Ornstein-Uhlenbeck semigroup.\nA full version of the paper is available at arXiv:1403.0885","authors":["Steven Heilman","Elchanan Mossel","Joe Neeman"],"meta":["March 2014Israel Journal of Mathematics 213(1)","DOI:10.1145/2688073.2688076","SourcearXiv"],"references":["252801050_Generic_mean_curvature_flow_I_Generic_singularities","248382209_A_two-sided_estimate_for_the_Gaussian_noise_stability_deficit","243112012_On_the_first_and_second_variations_of_a_nonlocal_isoperimetric_problem","228929620_Double_bubbles_in_Gauss_space_and_spheres","226058795_Stability_of_Hypersurfaces_with_Constant_Mean_Curvature","220138499_Optimal_inapproximability_results_for_MAX-CUT_and_other_2-variable_CSPs","2113006_Proof_of_the_Double_Bubble_Conjecture","316934785_Proof_of_the_double_bubble_conjecture","268707241_Problemes_concrets_d'analyse_fonctionnelle_Avec_un_complement_sur_les_fonctionnelles_analytiques_par_F_Pellegrino","265669955_Geometric_Measure_Theory_A_Beginner's_Guide","263802823_OPEN_PROBLEMS_IN_SOAP_BUBBLE_GEOMETRY","261468883_Gaussian_Noise_Sensitivity_and_Fourier_Tails","251701320_The_Ehrhard_inequality","250663204_Extremal_properties_of_half-spaces_for_spherically_invariant_measures","247248837_Princeton_Lectures_in_Analysis","243107115_Einfache_Beweise_der_isoperimetrischen_Hauptsatze","240747357_Noise_stability_of_functions_with_low_influences_invariance_and_optimality_Extended_Abstract","239055914_Isoperimetry_and_Gaussian_analysis","233809980_Euclidean_Partitions_that_Optimize_an_Ornstein-Uhlenbeck_Quadratic_Form","232244747_Robust_Optimality_of_Gaussian_Noise_Stability","226496454_The_Brunn-Minkowski_Inequality_in_Gauss_Space","226429958_Geometric_bounds_on_the_Ornstein-Uhlenbeck_velocity_process","222183565_A_Fourier-theoretic_perspective_on_the_Condorcet_paradox_and_Arrow's_theorem","24165695_New_Maximally_Stable_Gaussian_Partitions_with_Discrete_Applications","4109394_Optimal_inapproximability_results_for_MAX-CUT_and_other_2-variable_CSPs","1744189_Approximate_Kernel_Clustering"]}