{"id":"260593719_Malicious_AODV_Implementation_and_Analysis_of_Routing_Attacks_in_MANETs","abstract":"From the security perspective Mobile Ad hoc Networks (MANETs) are amongst the most challenging research areas and one of the key reasons for this is the ambiguous nature of insider attacks in these networks. In recent years, many attempts have been made to study the intrinsic attributes of these insider attacks but the focus has generally been on the analysis of one or very few particular attacks, or only the survey of various attacks without any performance analysis. Therefore, a major feature that research has lately lacked is a detailed and comprehensive study of the effects of various insider attacks on the overall performance of MANETs. In this paper we investigate, in detail, some of the most severe attacks against MANETs namely the blackhole attack, sinkhole attack, selfish node behavior, RREQ flood, hello flood, and selective forwarding attack. A detailed NS-2 implementation of launching these attacks successfully using Ad hoc On-Demand Distance Vector (AODV) routing protocol has been presented and a comprehensive and comparative analysis of these attacks is performed. We use packet efficiency, routing overhead, and throughput as our performance metrics. Our simulation-based study shows that flooding attacks like RREQ flood and hello flood drastically increase the routing overhead of the protocol. Route modification attacks such as sinkhole and blackhole are deadly and severely affect the packet efficiency and bring down the throughput to unacceptable ranges.","authors":["Humaira Ehsan","Farrukh Aslam Khan"],"meta":["June 2012","DOI:10.1109/TrustCom.2012.199","Conference: Trust, Security and Privacy in Computing and Communications (TrustCom), 2012 IEEE 11th International Conference"],"references":["221611438_Ad-hoc_On-Demand_Distance_Vector_Routing","221508155_Launching_a_Sinkhole_Attack_in_Wireless_Sensor_Networks_The_Intruder_Side","313647649_Detecting_selective_forwarding_attacks_in_wireless_sensor_networks","243544152_Multicast_using_ad-hoc_on-demand_distance_vector_routing","226663966_Dynamic_Source_Routing_in_Ad_Hoc_Wireless_Networks","222511609_Secure_Routing_in_Wireless_Sensor_Networks_Attacks_and_Countermeasures","222047665_Sinkhole_intrusion_in_mobile_ad_hoc_networks_The_problem_and_some_detection_indicators","221207398_Modelling_and_Analysis_of_Attacks_on_the_MANET_Routing_in_AODV","221148391_How_to_Misuse_AODV_A_Case_Study_of_Insiider_Attacks_against_Mobile_Ad-hoc_Routing_Protocols","221056787_Study_of_Different_Types_of_Attacks_on_Multicast_in_Mobile_Ad_Hoc_Networks"]}