{"id":"260648443_Five_Major_Shifts_in_100_Years_of_Engineering_Education","abstract":"In this paper, five major shifts in engineering education are identified. During the engineering science revolution, curricula moved from hands-on practice to mathematical modeling and scientific analyses. The first shift was initiated by engineering faculty members from Europe; accelerated during World War II, when physicists contributed multiple engineering breakthroughs; codified in the Grinter report; and kick-started by Sputnik. Did accreditation hinder curricular innovations? Were engineering graduates ready for practice? Spurred by these questions, the Accreditation Board for Engineering and Technology (ABET) required engineering programs to formulate outcomes, systematically assess achievement, and continuously improve student learning. The last three shifts are in progress. Since the engineering science revolution may have marginalized design, a distinctive feature of engineering, faculty members refocused attention on capstone and first-year engineering design courses. However, this third shift has not affected the two years in between. Fourth, research on learning and education continues to influence engineering education. Examples include learning outcomes and teaching approaches, such as cooperative learning and inquiry that increase student engagement. In shift five, technologies (e.g., the Internet, intelligent tutors, personal computers, and simulations) have been predicted to transform education for over 50 years; however, broad transformation has not yet been observed. Together, these five shifts characterize changes in engineering education over the past 100 years.","authors":["Jeffrey E. Froyd","Phillip C. Wankat","Karl A. Smith"],"meta":["May 2012Proceedings of the IEEE 100(Special Centennial Issue):1344-1360","DOI:10.1109/JPROC.2012.2190167"],"references":["320315143_9_Moving_From_the_Scholarship_of_Teaching_and_Learning_to_Educational_Research_An_Example_From_Engineering","313853898_First-Year_and_Capstone_Design_Projects_Is_the_Bookend_Curriculum_Approach_Effective_for_Skill_Gain","312470401_Learningteaching_styles_in_engineering_education","347881175_Peer_Instruction_Ten_years_of_experience_and_results","345937836_Creating_Effective_And_Efficient_Learning_Experiences_While_Addressing_The_Needs_Of_The_Poor_An_Overview_Of_Service_Learning_In_Engineering_Education","345936055_Service_Learning_In_Engineering_Science_Courses_Does_It_Work","345933476_An_Effective_Teaching_Strategy_For_Motivation_And_Rentention_Of_Engineering_And_Technology_Freshmen","321619684_Rethinking_Engineering_Education_The_CDIO_Approach","320548440_The_21st-century_engineer_A_proposal_for_engineering_education_reform","319395212_Cultivating_of_Communities_of_Practice"]}