{"id":"260657853_QuaDRiGa_A_3-D_Multi-Cell_Channel_Model_with_Time_Evolution_for_Enabling_Virtual_Field_Trials","abstract":"Channel models are important tools to evaluate the performance of new concepts in mobile communications. How-ever, there is a trade-off between complexity and accuracy. In this paper, we extend the popular WINNER channel model with new features to make it as realistic as possible. Our approach enables more realistic evaluation results at an early stage of algorithm development. The new model supports three-dimensional (3-D) propagation, 3-D antenna patterns, time evolving channel traces of arbitrary length, scenario transitions and variable terminal speeds. We validated the model by measurements in a coherent LTE advanced testbed in downtown Berlin, Germany. We then reproduced the same scenario in the model and compared several channel parameters (delay spread, path gain, K-factor, geometry factor and capacity). The results match very well and we can accurately predict the performance for an urban macro-cell setup with commercial high-gain antennas. At the same time, the computational complexity does not increase significantly and we can use all existing WINNER parameter tables. These artificial channels, having equivalent characteristics as measured data, enable virtual field trials long before prototypes are available.","authors":["Stephan Jaeckel","Leszek Raschkowski","Kai Börner","Lars Thiele"],"meta":["June 2014IEEE Transactions on Antennas and Propagation 62(6)","DOI:10.1109/TAP.2014.2310220","Projects: 5G Channel ModelEASY-C"],"references":["261467821_CP5-026_WINNER_D53_v10_WINNER_Final_Channel_Models","259900906_IST-4-027756_WINNER_II_D112_v12_WINNER_II_channel_models","308048640_Thirteen_ways_to_look_at_the_correlation_coefficient","305345790_Pervasive_Mobile_and_Ambient_Wireless_Communications_-_COST_Action_2100","291959983_Mobile_Broadband_Multimedia_Networks","290109890_Radio_Channel_Modeling_for_4G_Networks","285021498_Empirical_formula_for_propagation_loss_in_land_mobile_radio_service","260655177_Empirical_formula_for_propagation_loss_in_land_mobile_radio_services","260582767_The_COST_2100_channel_model_Parameterization_and_validation_based_on_outdoor_MIMO_measurements_at_300_MHz","259904123_Time-Variant_Channel_Modeling_with_Application_to_Mobile_Radio_Based_Positioning"]}