{"id":"260642718_Credible_Autocoding_of_Convex_Optimization_Algorithms","abstract":"The efficiency of modern optimization methods, coupled with increasing\ncomputational resources, has led to the possibility of real-time optimization\nalgorithms acting in safety critical roles. There is a considerable body of\nmathematical proofs on on-line optimization programs which can be leveraged to\nassist in the development and verification of their implementation. In this\npaper, we demonstrate how theoretical proofs of real-time optimization\nalgorithms can be used to describe functional properties at the level of the\ncode, thereby making it accessible for the formal methods community. The\nrunning example used in this paper is a generic semi-definite programming (SDP)\nsolver. Semi-definite programs can encode a wide variety of optimization\nproblems and can be solved in polynomial time at a given accuracy. We describe\na top-to-down approach that transforms a high-level analysis of the algorithm\ninto useful code annotations. We formulate some general remarks about how such\na task can be incorporated into a convex programming autocoder. We then take a\nfirst step towards the automatic verification of the optimization program by\nidentifying key issues to be adressed in future work.","authors":["Timothy Wang","Romain Jobredeaux","Marc Pantel","Pierre-Loic Garoche"],"meta":["December 2016Optimization and Engineering 17(4)","DOI:10.1007/s11081-016-9320-7","SourcearXiv"],"references":["289032849_Frama-C","280018811_SDPT3_-_a_MATLAB_software_package_for_semidefinite_programming_version_13","319395113_DO-178B_Software_Considerations_in_Airborne_Systems_and_Equipment_Certification","313550915_An_Axiomatic_Basis_of_Computer_Programming","313045748_Interior_point_methods_in_semidefinite_programming_with_applications_to_combinatorial_optimization","308353423_Linear_matrix_inequalities_in_system_and_control_theory","305387411_Semidefinite_optimization","289832960_Checking_a_Large_Routine","279869595_Latest_developments_in_the_SDPA_family_for_solving_large-scale_SDPs","273002355_Convex_Optimization"]}