{"id":"260662503_A_Data-Level_Fusion_Model_for_Developing_Composite_Health_Indices_for_Degradation_Modeling_and_Prognostic_Analysis","abstract":"Prognostics involves the effective utilization of condition or performance-based sensor signals to accurately estimate the remaining lifetime of partially degraded systems and components. The rapid development of sensor technology, has led to the use of multiple sensors to monitor the condition of an engineering system. It is therefore important to develop methodologies capable of integrating data from multiple sensors with the goal of improving the accuracy of predicting remaining lifetime. Although numerous efforts have focused on developing feature-level and decision-level fusion methodologies for prognostics, little research has targeted the development of “data-level” fusion models. In this paper, we present a methodology for constructing a composite health index for characterizing the performance of a system through the fusion of multiple degradation-based sensor data. This methodology includes data selection, data processing, and data fusion steps that lead to an improved degradation-based prognostic model. Our goal is that the composite health index provides a much better characterization of the condition of a system compared to relying solely on data from an individual sensor. Our methodology was evaluated through a case study involving a degradation dataset of an aircraft gas turbine engine that was generated by the Commercial Modular Aero-Propulsion System Simulation (C-MAPSS).","authors":["Kaibo Liu","Nagi Gebraeel","Jianjun Shi"],"meta":["July 2013IEEE Transactions on Automation Science and Engineering 10(3):652-664","DOI:10.1109/TASE.2013.2250282"],"references":["265996485_User's_Guide_for_the_Commercial_Modular_Aero-Propulsion_System_Simulation_C-MAPSS","251867162_Metrics_for_evaluating_performance_of_prognostic_techniques","311673037_An_introduction_to_predictive_maintenance","274228299_Accelerated_Testing_Statistical_Models_Test_Plans_and_Data_Analyses","269906050_Accelerated_Testing_Statistical_Models_Test_Plans_and_Data_Analysis","267489219_Ensemble_of_Data-Driven_Prognostic_Algorithms_With_Weight_Optimization_and_K-Fold_Cross_Validation","261455548_Res_Inst_for_Adv_Comput_Sci_at_NASA_Ames_Res_Center_Ames_IA","257934428_Statistical_Methods_of_Reliability_Data","257929683_Accelerated_Testing_Statistical_Models_Test_Plans_and_Data_Analysis","253230738_User's_Guide_for_TOMLAB_45"]}