{"id":"260684647_How_stereotypes_impair_women's_careers_in_science","abstract":"Women outnumber men in undergraduate enrollments, but they are much less likely than men to major in mathematics or science or to choose a profession in these fields. This outcome often is attributed to the effects of negative sex-based stereotypes. We studied the effect of such stereotypes in an experimental market, where subjects were hired to perform an arithmetic task that, on average, both genders perform equally well. We find that without any information other than a candidate's appearance (which makes sex clear), both male and female subjects are twice more likely to hire a man than a woman. The discrimination survives if performance on the arithmetic task is self-reported, because men tend to boast about their performance, whereas women generally underreport it. The discrimination is reduced, but not eliminated, by providing full information about previous performance on the task. By using the Implicit Association Test, we show that implicit stereotypes are responsible for the initial average bias in sex-related beliefs and for a bias in updating expectations when performance information is self-reported. That is, employers biased against women are less likely to take into account the fact that men, on average, boast more than women about their future performance, leading to suboptimal hiring choices that remain biased in favor of men.","authors":["Ernesto Reuben","Paola Sapienza","Luigi Zingales"],"meta":["March 2014Proceedings of the National Academy of Sciences 111(12)","DOI:10.1073/pnas.1314788111","SourcePubMed"],"references":["238669442_Culture_Gender_and_Math","233195891_Science_Faculty's_Subtle_Gender_Biases_Favor_Male_Students","232546479_Gender_Differences_in_the_Accuracy_of_Self-Evaluations_of_Performance","51427273_Gender_Similarities_Characterize_Math_Performance","26655629_Understanding_and_Using_the_Implicit_Association_Test_III_Meta-Analysis_of_Predictive_Validity","254997224_Gender_and_the_Career_Choice_Process_The_Role_of_Biased_Self-Assessments","228168655_The_Emergence_of_Male_Leadership_in_Competitive_Environments","222527307_Solo_status_stereotype_threat_and_performance_expectancies_Their_effects_on_women's_performance","46451805_College_Major_Choice_and_the_Gender_Gap","26258437_Gender_culture_and_mathematics_performance","6445598_Implicit_Stereotypes_Gender_Identification_and_Math-Related_Outcomes_A_Prospective_Study_of_Female_College_Students","5338649_Diversity_Culture_gender_and_math","24091981_Do_Women_Shy_Away_from_Competition_Do_Men_Compete_too_Much","21016828_Gender_Differences_in_Mathematics_Performance_A_Meta-Analysis","13629558_Measuring_Individual_Differences_in_Implicit_Cognition_The_Implicit_Association_Test"]}