{"id":"260655054_Adaptive_Reduced-Rank_Estimation_of_Nonstationary_Time-Variant_Channels_Using_Subspace_Selection","abstract":"In this paper, we focus on adaptive time-variant channel estimation for vehicle-to-vehicle (V2V) communications in intelligent transportation systems (ITS) using the IEEE 802.11p physical layer. The IEEE 802.11p pilot pattern is identical to that in the well-known IEEE 802.11a/g (WiFi) standard, which was initially designed for indoor environments with little or no mobility. However, in a V2V drive-by situation, the channel impulse response rapidly changes due to the high relative velocity between transmitter and receiver, as well as the changes in the scattering environment. Hence, for such V2V channels, advanced decision directed channel estimation methods are needed to reach a frame error rate (FER) smaller than 10-1 . Even more importantly, the channels are nonstationary, which implies that the Doppler power spectral density (DSD) and the power delay profile (PDP) change on a timescale comparable with the frame length, which complicates the estimator design. In this paper, we develop an adaptation method for the channel estimation filter that is suitable for the following: 1) the short frame length in IEEE 802.11p; 2) the given pilot structure; and 3) the requirement of only a single received short frame for filter adaptation. We define a set of hypotheses on the support of the DSD and a second set of hypotheses on the support of the PDP. Each hypothesis is represented by a specific subspace spanned by orthogonal basis vectors. For basis vector calculation, we develop a numerically stable algorithm utilizing generalized discrete prolate spheroidal sequences. The adaptation algorithm chooses a hypothesis from both sets such that a probabilistic bound on the channel estimation error is minimized. We implement the hypothesis test by means of a novel subspace selection algorithm that allows utilizing correlated observations of a time- and frequency-selective (2-D) fading process. We validate the adaptive channel estimation scheme in an IEEE 802.11p compl- ant link level simulation for a relative velocity range from 0 to 111 m/s ≈ 400 km/h ≈ 249 mi/h. Adaptive filtering enables an up to fourfold reduction in the number of required iterations to reach an FER below 10-1 for an Eb/N0 = 12 dB.","authors":["Thomas Zemen","Andreas F. Molisch"],"meta":["November 2012IEEE Transactions on Vehicular Technology 61(9):4042-4056","DOI:10.1109/TVT.2012.2211053"],"references":["312910508_Prolate_spheroidal_wave_functions-Prolate_spheroidal_wave_functions-Fourier_analysis_and_uncertainty_1_Bell_Syst","312125077_A_Comparison_of_Optimal_and_Sub-optimal_MAP_Decoding_Algorithms_Operating_in_the_Log-Domain","298457735_Wireless_communications_over_rapidly_time-varying_channels","289404426_New_semi-blind_channel_estimation_in_MIMO_based_on_second_order_statistics","284895176_Citation_classic_-_Probability_random-variables_and_stochastic-processes","275067058_Probability_Random_Variables_and_Stochastic_Processes_2nd_Edition","267117861_Spectral_Analysis_for_Physical_Applications_Multitaper_and_Conventional_Univariate_Techniques","265366078_Random_Variables_and_Stochastic_Processes","264569594_A_Statistical_Theory_of_Mobile-Radio_Reception","251990163_Dynamic_channel_equalization_for_IEEE_80211p_waveforms_in_the_vehicle-to-vehicle_channel"]}