{"id":"260750293_Integrated_Methods_for_Optimization","abstract":"The first edition of Integrated Methods for Optimization was published in January 2007. Because the book covers a rapidly developing field, the time is right for a second edition. The book provides a unified treatment of optimization methods. It brings ideas from mathematical programming (MP), constraint programming (CP), and global optimization (GO)into a single volume. There is no reason these must be learned as separate fields, as they normally are, and there are three reasons they should be studied together. (1) There is much in common among them intellectually, and to a large degree they can be understood as special cases of a single underlying solution technology. (2) A growing literature reports how they can be profitably integrated to formulate and solve a wide range of problems. (3) Several software packages now incorporate techniques from two or more of these fields. The book provides a unique resource for graduate students and practitioners who want a well-rounded background in optimization methods within a single course of study. Engineering students are a particularly large potential audience, because engineering optimization problems often benefit from a combined approachparticularly where design, scheduling, or logistics are involved. The text is also of value to those studying operations research, because their educational programs rarely cover CP, and to those studying computer science and artificial intelligence (AI), because their curricula typically omit MP and GO. The text is also useful for practitioners in any of these areas who want to learn about another, because it provides a more concise and accessible treatment than other texts. The book can cover so wide a range of material because it focuses on ideas that arerelevant to the methods used in general-purpose optimization and constraint solvers. The book focuses on ideas behind the methods that have proved useful in general-purpose optimization and constraint solvers, as well as integrated solvers of the present and foreseeable future. The second edition updates results in this area and includes several major new topics: Background material in linear, nonlinear, and dynamic programming.Network flow theory, due to its importance in filtering algorithms.A chapter on generalized duality theory that more explicitly develops a unifying primal-dual algorithmic structure for optimization methods.An extensive survey of search methods from both MP and AI, using the primal-dual framework as an organizing principle.Coverage of several additional global constraints used in CP solvers.The book continues to focus on exact as opposed to heuristic methods. It is possible to bring heuristic methods into the unifying scheme described in the book, and the new edition will retain the brief discussion of how this might be done.","authors":["John N. Hooker"],"meta":["January 2012","DOI:10.1007/978-1-4614-1900-6","Edition: 2Publisher: SpringerISBN: 9781461418993"],"references":[]}