{"id":"260733555_Memory_scaling_A_systems_architecture_perspective","abstract":"The memory system is a fundamental performance and energy bottleneck in almost all computing systems. Recent system design, application, and technology trends that require more capacity, bandwidth, efficiency, and predictability out of the memory system make it an even more important system bottleneck. At the same time, DRAM technology is experiencing difficult technology scaling challenges that make the maintenance and enhancement of its capacity, energy-efficiency, and reliability significantly more costly with conventional techniques. In this paper, after describing the demands and challenges faced by the memory system, we examine some promising research and design directions to overcome challenges posed by memory scaling. Specifically, we survey three key solution directions: 1) enabling new DRAM architectures, functions, interfaces, and better integration of the DRAM and the rest of the system, 2) designing a memory system that employs emerging memory technologies and takes advantage of multiple different technologies, 3) providing predictable performance and QoS to applications sharing the memory system. We also briefly describe our ongoing related work in combating scaling challenges of NAND flash memory.","authors":["Onur Mutlu"],"meta":["May 2013","DOI:10.1109/IMW.2013.6582088","Conference: Memory Workshop (IMW), 2013 5th IEEE International"],"references":["284437201_Staged_memory_scheduling","331084121_Bottleneck_identification_and_scheduling_in_multithreaded_applications","313523824_Stall-time_fair_memory_access_scheduling_for_chip_multiprocessors","311476926_The_dynamic_granularity_memory_system","311471745_Adaptive_granularity_memory_systems_a_tradeoff_between_storage_efficiency_and_throughput","311464932_A_case_for_exploiting_subarray-level_parallelism_SALP_in_DRAM","311464876_Bottleneck_identification_and_scheduling_in_multithreaded_applications","310830826_Kilo-NOC_a_heterogeneous_network-on-chip_architecture_for_scalability_and_service_guarantees","308308348_Accelerating_critical_section_execution_with_asymmetric_multi-core_architectures","291201444_RAIDR"]}