{"id":"260709276_Identifying_Knowledge_Skill_and_Competence_for_Nanoscience_and_Nanotechnology_Research_A_Study_of_Postgraduate_Researchers'_Experiences","abstract":"Over the past few decades, scientific disciplines have changed significantly with the introduction of new and complex aspects of research, particularly in the area of nanoscience and nanotechnology (N&N). Efforts to develop science education programmes in N&N area to adopt these complex changes are also evident from recent literature and educational reports. However, these attempts are focused towards identification and inclusion of contextual scientific knowledge in the curricula and very little is understood about the attributes knowledge, skill and competence necessary to successfully undertake N&N research. Identification of these attributes is important so that the contextual scientific knowledge can be embedded in the curricula more effectively. Also, it is uncertain whether this growing research area requires researchers that have studied specialised undergraduate or postgraduate N&N programmes or traditional science and engineering disciplines. In other words, is N&N research multidisciplinary, interdisciplinary or will it develop into a unique discipline is not clear. To address this question, this qualitative study will examine the postgraduate researchers' experiences of researching in N&N area. Studying how the researchers understand, interpret and describe their experiences, we can achieve a new; or; at the very least a wider understanding of what N&N research is; and how the postgraduate researchers use their education and training to research in this area. This in turn will inform the curriculum development at the undergraduate and postgraduate levels and address the issues of whether we should have specialised undergraduate N&N programmes or simply different distinct science and engineering disciplines coming together.","authors":["Deepa Chari","Paul W. Irving","Robert Howard","Brian Bowe"],"meta":["January 2012International Journal of Engineering Education 28(5):1046-1055"],"references":["298796837_The_Development_Of_Education_And_Training_Systems_In_The_Field_Of_Nanotechnology","285679194_Debating_Phenomenological_Research_Methods","237233474_A_Phenomenological_Research_Design_Illustrated","312447949_Doing_Template_analysis","305197515_Nanotechnology_Education_Contemporary_Content_and_Approaches","272786976_Phenomenological_Research_Method","270162336_In_The_Structure_of_Scientific_Revolutions","245131368_Concerns_of_new_technology_based_industries_-_The_case_of_nanotechnology","235939798_Curriculum_at_forty_below_A_phenomenological_inquiry_of_an_educatorexplorer's_experience_with_adventure_learning_in_the_Arctic","233569423_A_Capstone_Course_in_Nanotechnology_for_Chemistry_Majors"]}