{"id":"260794408_Miscanthus_spatial_location_as_seen_by_farmers_A_machine_learning_approach_to_model_real_criteria","abstract":"Miscanthus is an emerging crop with high potential for bioenergy production. Its effective sustainability depends greatly on the spatial location of this crop, although few modelling approaches have been based on real maps. To fill this gap, we propose a spatially explicit method based on real location data. We mapped all of the miscanthus fields in the supply area of a transformation plant located in east-central France. Then, we used a boosted regression tree, machine learning method, to model miscanthus presence/absence at the level of the farmer’s block as mapped in the French land parcel identification system. Each of these modelling spatial units was characterised on agronomical, morphological and contextual variables selected from in-depth spatially explicit farm surveys. The model fostered a two-fold aim: to assess the farmers’ decision criteria and predict miscanthus location probability. In addition, we evaluated the consequence of possible legislative constraints, which could prevent the miscanthus to be planted in protected areas or in place of grasslands. The small and complex-shaped farmer’ blocks that were predicted by our model to be planted with miscanthus were also characterised by their great distance from the farm and the roads. This kind of result could provide a different perspective on the definition of “marginal land” by integrating also the farm management criteria. In conclusion, our approach elicited real farmers’ criteria regarding miscanthus location to capture local specificities and explore different miscanthus location probabilities at the farm and landscape levels.","authors":["Davide Rizzo","Laura Martin","Julie Wohlfahrt"],"meta":["March 2014Biomass and Bioenergy 66","DOI:10.1016/j.biombioe.2014.02.035"],"references":["310166134_Marginal_land_for_energy_crops_Exploring_definitions_and_embedded_assumptions","285895938_Scenario_analysis_and_the_watershed_futures_planner_predicting_future_aquatic_conditions_in_an_intensively_mined_Appalachian_watershed","281074772_Modeling_farmers'_choice_of_miscanthus_allocation_in_farmland_a_case-based_reasoning_model","319352408_Using_species_distribution_models_to_identify_suitable_areas_for_biofuel_feedstock_production","318773282_Growth_and_agronomy_of_miscanthus_giganteus_for_biomass_production","318393858_R_A_Language_and_Environment_for_Statistical_Computing","313385761_Data_Mining_Practical_Machine_Learning_Tools_and_Techniques","285891903_Perennial_biomass_crops_allocation_a_French_case_study_regarding_miscanthus","281466606_Estimating_UK_perennial_energy_crop_supply_using_farm-scale_models_with_spatially_disaggregated_data","276951956_Growth_and_agronomy_of_Miscanthus_giganteus_for_biomass_production"]}