{"id":"260835944_Max-Ratio_Relay_Selection_in_Secure_Buffer-Aided_Cooperative_Wireless_Networks","abstract":"This paper considers the security of transmission in buffer-aided decode-and-forward cooperative wireless networks. An eavesdropper which can intercept the data transmission from both the source and relay nodes is considered to threaten the security of transmission. Finite size data buffers are assumed to be available at every relay in order to avoid having to select concurrently the best source-to-relay and relay-to-destination links. A new max-ratio relay selection policy is proposed to optimize the secrecy transmission by considering all the possible source-to-relay and relay-to-destination links and selecting the relay having the link which maximizes the signal to eavesdropper channel gain ratio. Two cases are considered in terms of knowledge of the eavesdropper channel strengths: exact and average gains, respectively. Closed-form expressions for the secrecy outage probability for both cases are obtained, which are verified by simulations. The proposed max-ratio relay selection scheme is shown to outperform one based on a max-min-ratio relay scheme.","authors":["Yi GONG","Gaojie Chen","Zhao Tian","Zhi Chen"],"meta":["April 2014IEEE Transactions on Information Forensics and Security 9(4):719-729","DOI:10.1109/TIFS.2014.2307672"],"references":["259357594_Buffer-Aided_Relaying_in_a_Three_Node_Network","254061026_Comment_on_Relay_Selection_for_Secure_Cooperative_Networks_with_Jamming","237099493_Secure_Broadcasting_Over_Fading_Channels","270260605_Table_of_Integrals_Series_and_Products_CD-ROM_Version_10","266853637_Plemmons_RJ_Nonnegative_Matrices_in_the_Mathematical_Sciences_SIAM_Philadelphia_PA","260512059_A_General_Relaying_Transmission_Protocol_for_MIMO_Secrecy_Communications","260244200_Introduction_To_Probability","254059705_Buffer-Aided_Relay_Selection_for_Cooperative_Diversity_Systems_without_Delay_Constraints","254056908_Max-Max_Relay_Selection_for_Relays_with_Buffers","242589487_The_Wire-tap_Channel"]}