{"id":"260872667_Modular_Entanglement_of_Atomic_Qubits_using_both_Photons_and_Phonons","abstract":"Quantum entanglement is the central resource behind applications in quantum\ninformation science, from quantum computers and simulators of complex quantum\nsystems to metrology and secure communication. All of these applications\nrequire the quantum control of large networks of quantum bits (qubits) to\nrealize gains and speedups over conventional devices. However, propagating\nquantum entanglement generally becomes difficult or impossible as the system\ngrows in size, owing to the inevitable decoherence from the complexity of\nconnections between the qubits and increased couplings to the environment.\nHere, we demonstrate the first step in a modular approach to scaling\nentanglement by utilizing a hierarchy of quantum buses on a collection of three\natomic ion qubits stored in two remote ion trap modules. Entanglement within a\nmodule is achieved with deterministic near-field interactions through phonons,\nand remote entanglement between modules is achieved through a probabilistic\ninteraction through photons. This minimal system allows us to address generic\nissues in synchronization and scalability of entanglement with multiple buses,\nwhile pointing the way toward a modular large-scale quantum computer\narchitecture that promises less spectral crowding and less decoherence. We\ngenerate this modular entanglement faster than the observed qubit decoherence\nrate, thus the system can be scaled to much larger dimensions by adding more\nmodules.","authors":["D. Hucul","I. V. Inlek","G. Vittorini","Clayton Crocker"],"meta":["March 2014Nature Physics 11(1)","DOI:10.1038/nphys3150","SourcearXiv"],"references":["261714218_Quantum_information_Unconditional_quantum_teleportation_between_distant_solid-state_quantum_bits","258083246_A_quantum_network_of_clocks","255202848_Manipulation_and_detection_of_a_trapped_Yb_hyperfine_qubit","294766253_Entanglement_and_quantum_computation_with_ions_in_thermal_motion","277365679_Sympathetic_cooling_of_9Be_and_24Mg_for_quantum_logic","263837180_Phase_Control_of_Trapped_Ion_Quantum_Gates","262489326_Quantum_Gates_with_Phase_Stability_over_Space_and_Time","258728579_Room-temperature_entanglement_between_single_defect_spins_in_diamond","258686737_Quantum_simulation","252982561_Colloquium_Quantum_networks_with_trapped_ions"]}