{"id":"260873685_Using_a_large-scale_knowledge_database_on_reactions_and_regulations_to_propose_key_upstream_regulators_of_various_sets_of_molecules_participating_in_cell_metabolism","abstract":"Most of the existing methods to analyze high-throughput data are based on gene ontology principles, providing information on the main functions and biological processes. However, these methods do not indicate the regulations behind the biological pathways. A critical point in this context is the extraction of information from many possible relationships between the regulated genes, and its combination with biochemical regulations. This study aimed at developing an automatic method to propose a reasonable number of upstream regulatory candidates from lists of various regulated molecules by confronting experimental data with encyclopedic information.\nA new formalism of regulated reactions combining biochemical transformations and regulatory effects was proposed to unify the different mechanisms contained in knowledge libraries. Based on a related causality graph, an algorithm was developed to propose a reasonable set of upstream regulators from lists of target molecules. Scores were added to candidates according to their ability to explain the greatest number of targets or only few specific ones. By testing 250 lists of target genes as inputs, each with a known solution, the success of the method to provide the expected transcription factor among 50 or 100 proposed regulatory candidates, was evaluated to 62.6% and 72.5% of the situations, respectively. An additional prioritization among candidates might be further realized by adding functional ontology information. The benefit of this strategy was proved by identifying PPAR isotypes and their partners as the upstream regulators of a list of experimentally-identified targets of PPARA, a pivotal transcriptional factor in lipid oxidation. The proposed candidates participated in various biological functions that further enriched the original information. The efficiency of the method in merging reactions and regulations was also illustrated by identifying gene candidates participating in glucose homeostasis from an input list of metabolites involved in cell glycolysis.\nThis method proposes a reasonable number of regulatory candidates for lists of input molecules that may include transcripts of genes and metabolites. The proposed upstream regulators are the transcription factors themselves and protein complexes, so that a multi-level description of how cell metabolism is regulated is obtained.","authors":["Pierre Blavy","Florence Gondret","Sandrine Lagarrigue","Jaap van Milgen"],"meta":["March 2014BMC Systems Biology 8(1):32","DOI:10.1186/1752-0509-8-32","SourcePubMed"],"references":["224890537_The_sequence_of_the_human_genome","224867144_DAVID-WS_A_stateful_web_service_to_facilitate_geneprotein_list_analysis","51403928_TRANSPATHR_-_A_high_quality_database_focused_on_signal_transduction","50225226_Assessing_quality_and_completeness_of_human_transcriptional_regulatory_pathways_on_a_genome-wide_scale","313102947_KEGG_Kyoto_encyclopedia_of_genes_and_genomes","283617653_Emergence_of_Scaling_in_Random_Networks","277367516_Up-regulation_of_the_fibrogenic_cytokine_TGF-b1_by_oxysterols_a_mechanistic_link_between_cholesterol_and_atherosclerosis","246274219_Fundamentals_of_Enzyme_Kinetics_3rd_Ed","235938765_Fundamental_of_Enzyme_Kinetics","221996231_Combining_Microarrays_and_Biological_Knowledge_for_Estimating_Gene_Networks_via_Bayesian_Networks","47755335_Pathway_Commons_a_web_resource_for_biological_pathway_data","47385276_Peroxisome_Proliferator-Activated_Receptor_Alpha_Target_Genes","46220566_Novel_roles_for_JNK1_in_metabolism","41668582_An_Empirical_Bayesian_Method_for_Estimating_Biological_Networks_from_Temporal_Microarray_Data","44889555_Activation_of_vitamin_D_receptor_VDR-_and_peroxisome_proliferator-activated_receptor_PPAR-signaling_pathways_through_125OH_2_D_3_in_melanoma_cell_lines_and_other_skin-derived_cell_lines"]}