{"id":"260932475_Fine-grain_voice_strength_estimation_from_vowel_spectral_cues","abstract":"This study investigates the possibility to recover the voice strength, i.e. the sound level produced by the speaker, from the signal recorded. The dataset consists of a set of isolated vowels (720 tokens) recorded in a situation where two interlocutors interacted orally at a distance comprised between 0.40 and 6 meters, in a furnished room. For each token, voice strength is measured at the intensity peak, and several sets of acoustic cues are extracted from the signal spectrum, after frequency weighting and intensity normalization. In the first phase, the tokens are grouped into increasing voice strength categories. Discriminant Analysis produces a classifier which takes into account all the signal dimensions implicitly coded in the set of cues. In the second phase, the cues of a new token are given to the classifier, which in turn produces its distances to the groups, providing the basis for estimating the unknown voice strength. The quality of the process is evaluated either in self-consistency mode or by cross-validation, i.e. by comparing the estimate with the value initially measured on the same token. The statistical margin of error is quite low, of the order of 3 dB, depending on the sets of cues used.","authors":["Jean-Sylvain Liénard","Claude Barras"],"meta":["August 2013","Conference: InterSpeechAt: Lyon, France"],"references":["284701748_Voice_source_parameters_and_prosodic_analysis","259810776_PRAAT_Doing_phonetics_by_computer_Version_5351","243630331_A_Four-Parameter_Model_of_Glottal_Flow","233713302_The_Spectrum_of_Glottal_Flow_Models","208032992_PRAAT_a_system_for_doing_phonetics_by_computer","45401885_Communiquer_en_environnement_bruyant_de_l'adaptation_jusqu'au_forcage_vocal","243782464_Loudness_Its_Definition_Measurement_and_Calculation","233614217_Acoustic_Features_of_Shouted_Voice","209436180_Loudness_Its_Definitions_Measurement_and_Calculation","14776576_The_Lombard_reflex_and_its_role_on_human_listeners_and_automatic_speech_recognizers"]}