{"id":"260948523_The_MedSeq_Project_A_randomized_trial_of_integrating_whole_genome_sequencing_into_clinical_medicine","abstract":"Background: \nWhole genome sequencing (WGS) is already being used in certain clinical and research settings, but its impact on patient well-being, health-care utilization, and clinical decision-making remains largely unstudied. It is also unknown how best to communicate sequencing results to physicians and patients to improve health. We describe the design of the MedSeq Project: the first randomized trials of WGS in clinical care.\n\nMethods/design: \nThis pair of randomized controlled trials compares WGS to standard of care in two clinical contexts: (a) disease-specific genomic medicine in a cardiomyopathy clinic and (b) general genomic medicine in primary care. We are recruiting 8 to 12 cardiologists, 8 to 12 primary care physicians, and approximately 200 of their patients. Patient participants in both the cardiology and primary care trials are randomly assigned to receive a family history assessment with or without WGS. Our laboratory delivers a genome report to physician participants that balances the needs to enhance understandability of genomic information and to convey its complexity. We provide an educational curriculum for physician participants and offer them a hotline to genetics professionals for guidance in interpreting and managing their patients' genome reports. Using varied data sources, including surveys, semi-structured interviews, and review of clinical data, we measure the attitudes, behaviors and outcomes of physician and patient participants at multiple time points before and after the disclosure of these results.\n\nDiscussion: \nThe impact of emerging sequencing technologies on patient care is unclear. We have designed a process of interpreting WGS results and delivering them to physicians in a way that anticipates how we envision genomic medicine will evolve in the near future. That is, our WGS report provides clinically relevant information while communicating the complexity and uncertainty of WGS results to physicians and, through physicians, to their patients. This project will not only illuminate the impact of integrating genomic medicine into the clinical care of patients but also inform the design of future studies.\n\nTrial registration: \nClinicalTrials.gov identifier NCT01736566.","authors":["Jason Vassy","Denise M Lautenbach","Heather M Mclaughlin","Sek Won Kong"],"meta":["March 2014Trials 15(1):85","DOI:10.1186/1745-6215-15-85","SourcePubMed"],"references":["283453708_Accurate_whole_human_genome_sequencing_using_reversible_terminator_chemistry","259084495_Actionable_Pathogenic_Incidental_Findings_in_1000_Participants'_Exomes","257308904_Clinical_Whole-Exome_Sequencing_for_the_Diagnosis_of_Mendelian_Disorders","249996236_Whole-Genome_Sequencing_for_Rapid_Susceptibility_Testing_of_M-tuberculosis","291256200_A_metadata-driven_methodology_and_workflow_process_for_providing_translational_research_informatics_support","286026668_Clinical_Genome_Sequencing","283496567_CONSORT_2010_Statement_Updated_Guidelines_for_Reporting_Parallel_Group_Randomised_Trials","278666455_Boutron_I_Moher_D_Altman_DG_Schulz_KF_Ravaud_PExtending_the_CONSORT_statement_to_randomized_trials_of_nonpharmacologic_treatment_explanation_and_elaboration_Ann_Intern_Med_148_295-309","271233037_Schulz_KF_Altman_DG_Moher_DCONSORT_2010_statement_updated_guidelines_for_reporting_parallel_group_randomized_trials_Ann_Intern_Med_152_726-732","256608021_A_systematic_approach_to_assessing_the_clinical_significance_of_genetic_variants"]}