{"id":"260946275_Single_Disk_Failure_Recovery_for_X-Code-Based_Parallel_Storage_Systems","abstract":"In modern parallel storage systems (e.g., cloud storage and data centers), it is important to provide data availability guarantees against disk (or storage node) failures via redundancy coding schemes. One coding scheme is X-code, which is double-fault tolerant while achieving the optimal update complexity. When a disk/node fails, recovery must be carried out to reduce the possibility of data unavailability. We propose an X-code-based optimal recovery scheme called minimum-disk-read-recovery (MDRR), which minimizes the number of disk reads for single-disk failure recovery. We make several contributions. First, we show that MDRR provides optimal single-disk failure recovery and reduces about 25 percent of disk reads compared to the conventional recovery approach. Second, we prove that any optimal recovery scheme for X-code cannot balance disk reads among different disks within a single stripe in general cases. Third, we propose an efficient logical encoding scheme that issues balanced disk read in a group of stripes for any recovery algorithm (including the MDRR scheme). Finally, we implement our proposed recovery schemes and conduct extensive testbed experiments in a networked storage system prototype. Experiments indicate that MDRR reduces around 20 percent of recovery time of the conventional approach, showing that our theoretical findings are applicable in practice.","authors":["Silei Xu","Runhui Li","Patrick P. C. Lee","Yunfeng Zhu"],"meta":["April 2014IEEE Transactions on Computers 63(4):995-1007","DOI:10.1109/TC.2013.8"],"references":["259212107_A_repair_framework_for_scalar_MDS_codes","254042947_On_the_speedup_of_single-disk_failure_recovery_in_XOR-coded_storage_systems_Theory_and_practice","312917980_The_Google_file_system","311556934_Rethinking_erasure_codes_for_cloud_file_systems_Minimizing_IO_for_recovery_and_degraded_reads","262204122_Rethinking_erasure_codes_for_cloud_file_systems_minimizing_IO_for_recovery_and_degraded_reads","261267657_A_cost-based_heterogeneous_recovery_scheme_for_distributed_storage_systems_with_RAID-6_codes","260740105_A_repair_framework_for_scalar_MDS_codes","260576479_Repair_Optimal_Erasure_Codes_Through_Hadamard_Designs","259860916_Polynomial_Codes_Over_Certain_Finite_Fields","247417879_Ro_w-diagonal_parity_for_double_disk_failure_correction"]}