{"id":"260952270_Comparative_Analysis_of_Software_Engineering_Models_from_Traditional_to_Modern_Methodologies","abstract":"Software Engineering aims to produce a quality software product that is delivered on time, within the allocated budget, and with the requirements expected by the customer but unfortunately maximum of the times this goal is rarely achieved. A software life cycle is the series of identifiable stages that a software product undergoes during its lifetime. However, a properly managed project in a matured software engineering environment can consistently achieve this goal. This research is concerned with the methodologies that examine the life cycle of software through the development models, which are known as software development life cycle. Hereby, we are representing traditional i.e. waterfall, Iteration, Spiral models as well as modern development methodologies like Agile methodologies that includes Extreme programming, Scrum, Feature Driven Development; Component based software development methodologies etc. All of these models have advantages and disadvantages as well. Therefore, the main objective of this research is to represent different models of software development by showing the good and bad practices of each model. A comparative analysis of traditional as well as modern methodologies is made.","authors":["Gaurav Kumar","Pradeep Kumar Bhatia"],"meta":["February 2014","DOI:10.1109/ACCT.2014.73","Conference: IEEE Fourth International Conference on Advanced Computing & Communication TechnologiesAt: Rohtak, Haryana, India","Project: Software Engineering Life Cycle Models"],"references":["292542090_Agile_Software_Development_Methods_Review_and_Analysis","268334807_Software_Development_Life_Cycle_AGILE_vs_Traditional_Approaches","258959806_A_Comparison_Between_Five_Models_Of_Software_Engineering","255707851_Impact_of_Agile_Methodology_on_Software_Development_Process","235758483_Software_Engineering_Issues_in_Development_Models_of_Open_Source_Software","314554796_Test-Driven_Development","303048765_Evolving_a_New_Software_Development_Life_Cycle_Model_SDLC-2013_with_Client_Satisfaction","288777633_An_agile_methodology_for_implementing_knowledge_management_systems_A_case_study_in_component-based_software_engineering","267228106_THE_EVOLUTION_OF_COMPONENT_BASED_SOFTWARE_ENGINEERING_FROM_THE_TRADITIONAL_APPROACH_TO_CURRENT_PRACTICES","232637594_Analysis_on_Agile_Software_Development_Methods_from_the_View_of_Informationalization_Supply_Chain_Management"]}