{"id":"260985018_Exploring_the_Use_of_Text_and_Instant_Messaging_in_Higher_Education_Classrooms","abstract":"This article examined how higher education students used text and instant messaging for academic purposes with their peers and faculty. Specifically, comfort level, frequency of use, usefulness, reasons for messaging and differences between peer-to-peer and peer-to-instructor interactions were examined. Students noted that they were very comfortable with using both text and instant messaging. Text messaging was used weekly with instructors and daily with peers. Instant messaging was used rarely with instructors but weekly with peers. Students rated\ntext messaging as very useful and instant messaging as moderately useful for academic purposes. Key reasons cited for using both text and instant messaging included saving time, resolving administrative issues, convenience and ease of use. Text messaging appears to be the preferred mode of communication for students with respect to communicating with both peers and instructors. It is concluded that both text and instant messaging are useful and viable tools for augmenting student’s communication among peers and faculty in higher education.","authors":["Sharon Lauricella","Robin Holding Kay"],"meta":["September 2013Research in Learning Technology 21","DOI:10.3402/rlt.v21i0.19061","Project: Online Learning including E-learning and M-learning"],"references":["307709695_Towards_an_understanding_of_the_virtual_context_in_mobile_learning","259258959_Insights_into_the_social_and_psychological_effects_of_SMS_text_messaging_available_at_160charactersorg","313759679_A_power_primer","312972059_Perpetual_contact_Mobile_communication_private_talk_public_performance","302323851_A_Comparison_of_Text_Messaging_and_Email_Support_for_Digital_Communities_A_Case_Study","277246419_Digital_Learners_in_Higher_Education_Generation_is_Not_the_Issue","277163087_College_Student_Internet_Use_Convenience_and_Amusement","265225694_THE_INCORPORATION_OF_MOBILE_LEARNING_INTO_MAINSTREAM_EDUCATION_AND_TRAINING","265158373_Mobile_and_PDA_technologies_and_their_future_use_in_education","254374907_Text_Messaging_in_an_Academic_Library_Integrating_SMS_into_Digital_Reference"]}