{"id":"261079608_Bit_Level_Encryption_Standard_BLES_Version-II","abstract":"In the present paper the authors have introduced a new symmetric key cryptographic method called Bit Level Encryption Standard(BLES) Version-II which is based on bit exchanging or bit reshuffling method from left to right as well as from right to left of the entire bit stream. In addition to that the authors have used bit-wise XOR operation to make the algorithm more powerful. Recently Nath et al has developed BLES Version-I where they have used bit exchange method but with some fixed block size which were multiple of 2. Due to even power of two sometimes there were some repeat of characters in the encrypted file if the input plain text has also duplicate characters. To overcome this problem in the present work the authors have taken block size of square of off numbers starting from three onwards. For scanning from right to left the authors used square of even numbers starting from four onwards. After finishing bit exchange the authors have performed bit-wise XOR to make the cryptosystem almost unbreakable. The authors have also introduced a special bit manipulation method so the encryption algorithm will work even for all characters with ASCII Code 0 or all characters with ASCII Code 255. The most of the standard encryption algorithm will fail to encrypt a file where all characters are ASCII '0' or all characters with ASCII '255' but the present method will be able to encrypt a file where all characters are ASCII '0' or all characters are ASCII '255'. The present method will be effective for encrypting short message, password, confidential key etc. The spectral analysis in the result sections shows that the BLES version-II method is free from known plain text attack, differential attack or any type brute force attack.","authors":["Gaurav Bhadra","Tanya Baia","Samik Banik","Asoke Nath"],"meta":["October 2012","DOI:10.1109/WICT.2012.6409061","Conference: Information and Communication Technologies (WICT), 2012 World Congress on"],"references":["276029435_Symmetric_key_Cryptography_using_two-way_updated_-Generalized_Vernam_Cipher_method_TTSJA_algorithm","259643865_An_Integrated_Symmetric_Key_Cryptographic_Method--Amalgamation_of_TTJSA_Algorithm_Advanced_Caesar_Cipher_Algorithm_Bit_Rotation_and_Reversal_Method_SJA_Algorithm","258651788_Ultra_Encryption_Standard_UES_Version-IV_New_Symmetric_key_Cryptosystem_with_bit-level_columnar_Transposition_and_Reshuffling_of_bits"]}