{"id":"261018562_On_Skill_Acquisition_Support_by_Analogical_Rule_Abduction","abstract":"In this paper, we report our attempt to realize analogical abduction as an extension of our work on meta level abductive framework for rule abduction and predicate invention. In our previous work, we gave a set of axioms to state the object level causalities in terms of first-order-logic (FOL) clauses, which represent direct and indirect causalities by transitive rules. Here we extend our formalism of the meta level abductive reasoning by adding rules to conduct analogical inference. We apply our analogical abduction method to the problem of explaining the difficult cello playing techniques of spiccato, rapid cross strings of the bow movement and one-bow staccato. Our method constructs persuasive analogical explanations about how to play them. We use a model of forced vibration mechanics as the base world for spiccato, the specification of the skeletal structure of the hand as the basis for the cross string bowing technique and behavioral similarity for one-bow staccato, respectively. These experimental studies suggest effectiveness of our approach to realize skill acquisition support by giving persuasive explanations of knacks provided by experts through analogical abduction.","authors":["Keita Kinjo","Tomonobu Ozaki","Koichi Furukawa","Makoto Haraguchi"],"meta":["November 2013Transactions of the Japanese Society for Artificial Intelligence 29(1)","DOI:10.1527/tjsai.29.188"],"references":["292777771_Towards_a_mathematical_theory_of_analogy","225170833_SOLAR_A_Consequence_Finding_System_for_Advanced_Reasoning","223929596_Linear_resolution_for_consequence_finding","221475163_Discovering_Rules_by_Meta-level_Abduction","220811864_Analogy_and_Abduction_in_Automated_Deduction","220769916_A_Sketch_of_Analogy_as_Reasoning_with_Equality_Hypotheses","220308984_SOLAR_An_automated_deduction_system_for_consequence_finding","220118281_Inductive_Logic_Programming_Theory_and_Methods","31908194_TOWARDS_A_MATHEMATICAL_THEORY_OF_ANALOGY","2467547_Translating_Case-Based_Reasoning_into_Abductive_Logic_Programming","2466729_Analogical_Logic_Program_Synthesis_from_Examples"]}