{"id":"261041483_PBL_in_teaching_computing_An_overview_of_the_last_15_years","abstract":"In computing courses, the teaching and learning approach normally emphasizes theoretical knowledge at the expense of practical knowledge. The major disadvantages of this approach are learners' lack of motivation during class and their quickly forgetting the knowledge they have acquired. With a view to overcoming these difficulties, Problem Based Learning (PBL), an institutional method of teaching, has been applied to teaching computing disciplines. Despite the growth of the practice of PBL in various disciplines of Computing, there is little evidence of its specific characteristics in this area, the effectiveness of different PBL methodological approaches, or of benefits and challenges encountered. In this context, this paper presents a systematic mapping study in order to identify studies which involve best practices when using the PBL method in Computing between 1997 and 2011, answering five research questions: “What are the main characteristics of PBL that support teaching in Computing?”; “What are the criteria for applying PBL effectively in this area?”; “How is the PBL methodology applied?”, “What are the advantages and benefits of applying PBL in Computing?” and, finally, “What are the main challenges about learning in PBL in Computing?”.","authors":["Maria Carmo Amorim","S.C. dos Santos","Vinicius Cardoso Garcia"],"meta":["October 2013Proceedings - Frontiers in Education Conference","DOI:10.1109/FIE.2013.6684830","Conference: 2013 IEEE Frontiers in Education ConferenceAt: Oklahoma City, OK"],"references":["302924724_Guidelines_for_performing_Systematic_Literature_Reviews_in_Software_Engineering","268183847_APRENDIZAGEM_BASEADA_EM_PROBLEMAS_PBL_NA_EDUCACAO_EM_ENGENHARIA","258968007_Kitchenham_B_Guidelines_for_performing_Systematic_Literature_Reviews_in_software_engineering_EBSE_Technical_Report_EBSE-2007-01","336573400_Systematic_Mapping_Studies_in_Software_Engineering","291228621_Educating_Leaders_For_The_New_Competitive_Environment","282876149_Is_problem_based_learning_the_only_way","251959850_Practice_and_experience_in_the_application_of_problem-based_learning_in_computer_programming_course","245766468_Problem-based_learning_PBL","243688987_Problem-based_Learning_How_to_Gain_the_Most_from_PBL","239601262_The_Challenge_of_Problem-Based_Learning"]}