{"id":"261082858_Improvement_of_MPTCP_Performance_in_heterogeneous_network_using_packet_scheduling_mechanism","abstract":"Recently, requirement of ubiquitous availability and increase of mobile user driving traffic has become a serious problem. On the other hand, most mobile equipment have more than one network interface and a host can use multiple network interfaces simultaneously with multi-homing technology. Therefore, multiple paths are utilized for data transfer in one pair of terminals. This is a Con-current Multi-path Transfer (CMT). It makes acquire improved bandwidth and resilience just by modifying previous transport layer protocol like TCP (transmission control protocol). TCP is the most common transport layer protocol in Internet applications. Accordingly, IETF have proposed Multi-path TCP (MPTCP) that previous single-TCP with multi-homing technology. However, when transmit the packet using different two path which has dissimilar characteristic simultaneously, there is some throughput degradation compared to single-TCP that shows best performance. The reason is that out-of-ordered packet is generated because each path has different bandwidth, delay and packet loss rate. To solve these problems, this research proposes reordering considered packet scheduling algorithm at the sender. Main idea of the proposed scheme is estimating packet receiving time at the receiver and scheduling packet. By using proposed algorithm, the number of out-of-ordered packet in the receiver buffer is reduced. Therefore, performance degradation is also mitigated especially in the case that asymmetry between two path is severe.","authors":["Han Ah Kim","Bong-Hwan Oh","Jai-Yong Lee"],"meta":["October 2012","DOI:10.1109/APCC.2012.6388200","Conference: Communications (APCC), 2012 18th Asia-Pacific Conference on"],"references":["224355595_Non-Renegable_Selective_Acknowledgments_NR-SACKs_for_SCTP","221288230_On_the_Use_of_Concurrent_Multipath_Transfer_over_Asymmetric_Paths","221192723_Evaluation_of_Concurrent_Multipath_Transfer_over_Dissimilar_Paths","221138060_Refined_PFTK-Model_of_TCP_Reno_Throughput_in_the_Presence_of_Correlated_Losses","51963094_A_Multipath_TCP_model_for_ns-3_simulator","252045530_Evaluation_of_multipath_TCP_load_sharing_with_coupled_congestion_control_option_in_heterogeneous_networks","245405653_One-way_delay_estimation_without_clock_sychronization","221317380_Timer_and_Sequence_Based_Packet_Loss_Detection_Scheme_for_Efficient_Selective_Retransmission_in_DCCP","220702640_Path_diversified_retransmission_for_TCP_over_wireless_mesh_networks","4322800_Enhanced_response_algorithm_for_spurious_TCP_timeout_ER-SRTO","4253367_Multi-Path_Load_Balancing_in_Transport_Layer","3417861_Reverse_acknowledgment_RA_scheme_Fast_detection-of_retransmission_failures_for_SR-ARQ"]}