{"id":"261041289_Comparison_of_missing_data_imputation_methods_for_traffic_flow","abstract":"The complete and reliable field traffic data are vital for the planning, design and operation of urban traffic management systems. However, the problem of traffic data missing widely exists in many traffic information systems, which brings great troubles to the further utilization. Some approaches for imputing missing traffic data are needed, therefore, to minimize the effect of incomplete data on utilization. There are also problems of value missing in microarray data and several methods to estimate the missing values are proposed. These methods don't exploit any biology knowledge to estimate the missing value and they are just methods for data mining which can also be applied to the imputation of traffic flow data. In the paper, ten imputation methods for handling missing value problem of microarray data are compared with Bayesian Principle Component Analysis (BPCA) imputation method which is convinced to outperform many conventional approaches. Experiment analysis shows that LSI_gene, LSI_array, LSI_combined, LSI_adaptive, EM_gene and local least square imputation methods outperform BPCA and be good choices to deal with the problem of missing traffic data imputation.","authors":["Gang Chang","Tongmin Ge"],"meta":["December 2011","DOI:10.1109/TMEE.2011.6199284","Conference: Transportation, Mechanical, and Electrical Engineering (TMEE), 2011 International Conference on"],"references":["220263062_Missing_Value_Estimation_Methods_for_DNA_Microarrays","40893988_Comparative_analysis_of_missing_value_imputation_methods_to_improve_clustering_and_interpretation_of_microarray_experiments","8213473_Reuse_of_imputed_data_in_microarray_analysis_increases_imputation_efficiency","314755797_Statistical_Analysis_with_Missing_Data","265620140_Statistical_Analysis_With_Missing_Data","254282360_Missing_Observations_in_Multivariate_Statistics_I_Review_of_the_Literature","245559838_Use_of_Local_Lane_Distribution_Patterns_to_Estimate_Missing_Data_Values_from_Traffic_Monitoring_Systems","239438498_Archived_Intelligent_Transportation_System_Data_Quality_Preliminary_Analyses_of_San_Antonio_TransGuide_Data","239056767_Discriminatory_Analysis_Nonparametric_Discrimination_Consistency_Properties","228611647_Detecting_Errors_and_Imputing_Missing_Data_for_Single-Loop_Surveillance_Systems","220109188_PPCA-Based_Missing_Data_Imputation_for_Traffic_Flow_Volume_A_Systematical_Approach"]}