{"id":"261065917_Scalable_detection_of_statistically_significant_communities_and_hierarchies_message-passing_for_modularity","abstract":"Modularity is a popular measure of community structure. However, maximizing\nthe modularity can lead to many competing partitions with almost the same\nmodularity that are poorly correlated to each other; it can also overfit,\nproducing illusory \"communities\" in random graphs where none exist. We address\nthis problem by using the modularity as a Hamiltonian, and computing the\nmarginals of the resulting Gibbs distribution. If we assign each node to its\nmost-likely community under these marginals, we claim that, unlike the ground\nstate, the resulting partition is a good measure of statistically-significant\ncommunity structure.\nWe propose an efficient Belief Propagation (BP) algorithm to compute these\nmarginals. In random networks with no true communities, the system has two\nphases as we vary the temperature: a paramagnetic phase where all marginals are\nequal, and a spin glass phase where BP fails to converge. In networks with real\ncommunity structure, there is an additional retrieval phase where BP converges,\nand where the marginals are strongly correlated with the underlying\ncommunities. We show analytically and numerically that the proposed algorithm\nworks all the way down to the detectability transition in networks generated by\nthe stochastic block model. We also show that our algorithm performs well on\nreal-world networks, revealing large communities in some networks where\nprevious work has claimed no communities exist. Finally we show that by\napplying our algorithm recursively, subdividing communities until no\nstatistically-significant subcommunities can be found, we can detect\nhierarchical structure in real-world networks more efficiently than previous\nmethods. Our algorithm is highly scalable, working in time nearly linear in the\nnumber of edges: for networks with $10^5$ nodes and $10^6$ edges, for instance,\nit takes 14 seconds to find community structure.","authors":["Pan Zhang","Cristopher Moore"],"meta":["March 2014Proceedings of the National Academy of Sciences 111(51)","DOI:10.1073/pnas.1409770111","SourcearXiv"],"references":["258924057_Spectral_Redemption_in_Clustering_Sparse_Networks","258442326_Community_detection_thresholds_and_the_weak_Ramanujan_property","258310378_Belief_propagation_for_graph_partitioning","257836726_Hierarchical_Block_Structures_and_High-Resolution_Model_Selection_in_Large_Networks","311344563_Finding_community_structure_in_very_large_networks","296934181_Extracting_the_hierarchical_organization_of_complex_systems_vol_104_pg_15224_2007","289861931_Modularity_from_Uctuations_in_Random_Graphs_and_Complex_Networks","288913482_Community_Structure_Identification","283738615_Resolution_limit_in_community_detection","258566918_A_Proof_Of_The_Block_Model_Threshold_Conjecture","255173726_A_testing_based_extraction_algorithm_for_identifying_significant_communities_in_networks","248519014_An_Information_Flow_Model_for_Conflict_and_Fission_in_Small_Groups1","237005291_Community_identification_using_Extremal_Optimization","253253918_Detecting_Community_Structure_in_Networks","235929805_Information_Physics_and_Computation"]}