{"id":"261032577_Fast_Algorithms_for_Approximate_Circular_String_Matching","abstract":"Circular string matching is a problem which naturally arises in many biological contexts. It consistsin finding all occurrences of the rotations of a pattern of length m in a text of length n. There existoptimal average-case algorithms for exact circular string matching. Approximate circular stringmatching is a rather undeveloped area.\nIn this article, we present a suboptimal average-case algorithm for exact circular string matchingrequiring time O(n). Based on our solution for the exact case, we present two fast average-casealgorithms for approximate circular string matching with k-mismatches, under the Hammingdistance model, requiring time O(n) for moderate values of k, that is k = O(m/ logm). We showhow the same results can be easily obtained under the edit distance model. The presented algorithmsare also implemented as library functions. Experimental results demonstrate that the functionsprovided in this library accelerate the computations by more than three orders of magnitudecompared to a naïve approach.\nWe present two fast average-case algorithms for approximate circular string matching withk-mismatches; and show that they also perform very well in practice. The importance of ourcontribution is underlined by the fact that the provided functions may be seamlessly integrated intoany biological pipeline. The source code of the library is freely available athttp://www.inf.kcl.ac.uk/research/projects/asmf/.","authors":["Carl Barton","Costas Iliopoulos","Solon P Pissis"],"meta":["March 2014Algorithms for Molecular Biology 9(1):9","DOI:10.1186/1748-7188-9-9","SourcePubMed"],"references":["313580551_Fast_and_practical_approximate_string_matching","280849155_Applied_Combinatorics_on_Words","274171431_Bit-Parallel_Algorithms_for_Exact_Circular_String_Matching","268862803_Algorithms_on_strings_Translated_from_the_2001_French_original","262168371_All-Against-All_Circular_Pattern_Matching","244957922_A_linear_space_algorithm_for_com-puting_longest_common_subsequences","238719541_Fast_and_practical_approximate_pattern_matching","234799012_Hirschberg_DS_A_Linear_space_algorithm_for_Computing_Maximal_Common_Subsequences_Commun_ACM_186_341-343","228057969_Algorithms_on_Stings_Trees_and_Sequences","223115327_Lecture_Notes_in_Computer_Science"]}