{"id":"261039636_Self-Explanation_in_Adaptive_Systems","abstract":"The behaviour of self adaptive systems can be emergent. The difficulty in predicting the system's behaviour means that there is scope for the system to surprise its customers and its developers. Because its behaviour is emergent, a self-adaptive system needs to garner confidence in its customers and it needs to resolve any surprise on the part of the developer during testing and mainteinance. We believe that these two functions can only be achieved if a self-adaptive system is also capable of self-explanation. We argue a self-adaptive system's behaviour needs to be explained in terms of satisfaction of its requirements. Since self-adaptive system requirements may themselves be emergent, a means needs to be found to explain the current behaviour of the system and the reasons that brought that behaviour about. We propose the use of goal-based models during runtime to offer self-explanation of how a system is meeting its requirements, and why the means of meeting these were chosen. We discuss the results of early experiments in self-explanation, and set out future work.","authors":["Nelly Bencomo","Kris Welsh","Pete Sawyer","Jon Whittle"],"meta":["January 2012","DOI:10.1109/ICECCS.2012.34","Conference: Engineering of Complex Computer Systems (ICECCS), 2012 17th International Conference on"],"references":["228804239_Why_and_why_not_explanations_improve_the_intelligibility_of_context-aware_intelligent_systems","221553551_Awareness_Requirements_for_Adaptive_Systems","215588340_RELAX_A_language_to_address_uncertainty_in_self-adaptive_systems_requirement","2956204_Rainbow_Architecture-Based_Self-Adaptation_with_reusable_infrastructure","251879801_Software_evolution--Background_theory_practice","222486961_Explaining_type_inference","220706429_Constructing_Self-Adaptive_Systems_Using_a_KAOS_Model","220643020_Automated_theorem_provers_A_practical_tool_for_the_working_mathematician","40961183_Trust_in_Automation_Part_I_Theoretical_Issues_in_the_Study_of_Trust_and_Human_Intervention_in_Automated_Systems","2487128_Proof_Verbalization_as_an_Application_of_NLG"]}