{"id":"261056239_Activity_recognition_using_smartphone_sensors","abstract":"Motion sensor embedded smartphones have provided a new platform for activity inference. These sensors, initially used for cell phone feature enhancement, are now being used for a variety of applications. Providing cell phone users information about their own physical activity in an understandable format can enable users to make more informed and healthier lifestyle choices. In this work, we built a smartphone application which tracks users' physical activities and provide feedback requiring no user input during routine operation. The application reports estimates of the calories burned, broken up by physical activities. Detectable physical activities include walking, running, climbing stairs, descending stairs, driving, cycling and being inactive. We evaluated a number of classification algorithms from the area of Machine Learning, including Naïve Bayes, Decision Tree, K-Nearest Neighbor and Support Vector Machine classifiers. For training and verification of classifiers, we collected a dataset of 510 activity traces using cell phone sensors. We developed a smartphone app that performs activity recognition that does not require any user intervention. The classifier implemented in the Android app performs at an average true positives rate of greater than 95%, false positives rate of less than 1.5% and an ROC area of greater than 98%.","authors":["A. Anjum","Muhammad Usman Ilyas"],"meta":["January 2013","DOI:10.1109/CCNC.2013.6488584","Conference: Consumer Communications and Networking Conference (CCNC), 2013 IEEE"],"references":["267847444_BeWell_A_Smartphone_Application_to_Monitor_Model_and_Promote_Wellbeing","234801633_Toward_Physical_Activity_Diary_Motion_Recognition_Using_Simple_Acceleration_Features_with_Mobile_Phones","228620409_Sensing_and_modeling_activities_to_support_physical_fitness","224222673_Movement_recognition_using_the_accelerometer_in_smartphones","221582585_Activity_Recognition_from_Accelerometer_Data_on_a_Mobile_Phone","221518229_Activity_Sensing_in_the_Wild_A_Field_Trial_of_UbiFit_Garden","250729218_Detection_of_posture_and_motion_by_accelerometry_A_validation_study_in_ambulatory_monitoring","246516811_Intille_Activity_recognition_from_user-annotated_acceleration_data","221601187_Activity_Recognition_on_an_Accelerometer_Embedded_Mobile_Phone_with_Varying_Positions_and_Orientations","221568646_WearNET_A_Distributed_Multi-sensor_System_for_Context_Aware_Wearables"]}