{"id":"261047286_Using_scrum_to_teach_software_engineering_A_case_study","abstract":"The diffusion of agile methodologies in software development makes them more mature for corporative environment. However, teaching agile methodologies on the academic environment poses many difficulties and limitations. This paper describes a case study where an innovative approach for teaching software development technologies was adopted. In this approach, the entire course was designed to fit Scrum's principles, so that the students could apply them as they were learning it. Also, the course's main project was to be developed in sprints, as proposed in Scrum. After almost two years using this approach, in this paper we describe our experience and perform a critical analysis. We observed some positive points, such as the practical nature of learning by example, and a better preparation of the students regarding agile methodologies. As negative points, we highlight the impossibility of delivering complete products in earlier sprints, and some interaction and collaboration difficulties. The main conclusion of this study is that, for the approach to work in our academic scenario, a modified version of the Scrum methodology was necessary.","authors":["Sérgio Donizetti Zorzo","Leandro de Ponte","Daniel Lucredio"],"meta":["October 2013Proceedings - Frontiers in Education Conference","DOI:10.1109/FIE.2013.6684866","Conference: Frontiers in Education Conference, 2013 IEEE"],"references":["234831799_ABC-Sprints_adapting_Scrum_to_academic_game_development_courses","224236694_A_Capstone_Course_on_Agile_Software_Development_Using_Scrum","3247627_The_Scrum_Software_Development_Process_for_Small_Teams","252038914_Stories_from_My_Experiences_Learning_Scrum","242403407_Agile_Software_Development_With_Scrum","220630640_Teaching_software_engineering_a_practical_approach","4365436_U-SCRUM_An_Agile_Methodology_for_Promoting_Usability","4129229_Curriculum_Development_in_Educating_Undergraduate_Software_Engineers_-_Are_Students_Being_Prepared_for_the_Profession"]}