{"id":"261057504_A_Randomized_Trial_of_Genotype-Guided_Dosing_of_Warfarin","abstract":"Background: \nThe level of anticoagulation in response to a fixed-dose regimen of warfarin is difficult to predict during the initiation of therapy. We prospectively compared the effect of genotype-guided dosing with that of standard dosing on anticoagulation control in patients starting warfarin therapy.\n\nMethods: \nWe conducted a multicenter, randomized, controlled trial involving patients with atrial fibrillation or venous thromboembolism. Genotyping for CYP2C9*2, CYP2C9*3, and VKORC1 (-1639G→A) was performed with the use of a point-of-care test. For patients assigned to the genotype-guided group, warfarin doses were prescribed according to pharmacogenetic-based algorithms for the first 5 days. Patients in the control (standard dosing) group received a 3-day loading-dose regimen. After the initiation period, the treatment of all patients was managed according to routine clinical practice. The primary outcome measure was the percentage of time in the therapeutic range of 2.0 to 3.0 for the international normalized ratio (INR) during the first 12 weeks after warfarin initiation.\n\nResults: \nA total of 455 patients were recruited, with 227 randomly assigned to the genotype-guided group and 228 assigned to the control group. The mean percentage of time in the therapeutic range was 67.4% in the genotype-guided group as compared with 60.3% in the control group (adjusted difference, 7.0 percentage points; 95% confidence interval, 3.3 to 10.6; P<0.001). There were significantly fewer incidences of excessive anticoagulation (INR ≥4.0) in the genotype-guided group. The median time to reach a therapeutic INR was 21 days in the genotype-guided group as compared with 29 days in the control group (P<0.001).\n\nConclusions: \nPharmacogenetic-based dosing was associated with a higher percentage of time in the therapeutic INR range than was standard dosing during the initiation of warfarin therapy. (Funded by the European Commission Seventh Framework Programme and others; ClinicalTrials.gov number, NCT01119300.).","authors":["Munir Pirmohamed","Girvan Burnside","Niclas Eriksson","Andrea Jorgensen"],"meta":["December 2013New England Journal of Medicine 369(24):2294-303","DOI:10.1056/NEJMoa1311386"],"references":["232779081_Integration_of_Genetic_Clinical_and_INR_Data_to_Refine_Warfarin_Dosing","230805428_Influence_of_CYP2C9_and_VKORC1_on_Patient_Response_to_Warfarin_A_Systematic_Review_and_Meta-Analysis","230631766_The_future_of_warfarin_pharmacogenetics_in_under-represented_minority_groups","289949320_Risk_Factors_for_Intracranial_Hemorrhage_in_Outpatients_Taking_Warfarin","272921535_Comparison_of_10-mg_and_5-mg_Warfarin_Initiation_Nomograms_Together_with_Low-Molecular-Weight_Heparin_for_Outpatient_Treatment_of_Acute_Venous_Thromboembolism","255732894_Influence_of_CYP2C9_and_VKORC1_genotypes_on_the_risk_of_hemorrhagic_complications_in_warfarin-treated_patients_A_systematic_review_and_meta-analysis","237146427_Genetic_variants_associated_with_warfarin_dose_in_African-American_individuals_A_genome-wide_association_study","235397224_Optimal_dosing_of_warfarin_and_other_coumarin_anticoagulants_The_role_of_genetic_polymorphisms","233909069_Optimal_loading_dose_of_warfarin_for_the_initiation_of_oral_anticoagulation","232175921_Genetic_and_environmental_factors_determining_clinical_outcomes_and_cost_of_warfarin_therapy_A_prospective_study"]}