{"id":"261141151_Mapping_stain_distribution_in_pathology_slides_using_whole_slide_imaging","abstract":"Whole slide imaging (WSI) offers a novel approach to digitize and review pathology slides, but the voluminous data generated by this technology demand new computational methods for image analysis.\nIn this study, we report a method that recognizes stains in WSI data and uses kernel density estimator to calculate the stain density across the digitized pathology slides. The validation study was conducted using a rat model of acute cardiac allograft rejection and another rat model of heart ischemia/reperfusion injury. Immunohistochemistry (IHC) was conducted to label ED1(+) macrophages in the tissue sections and the stained slides were digitized by a whole slide scanner. The whole slide images were tessellated to enable parallel processing. Pixel-wise stain classification was conducted to classify the IHC stains from those of the background and the density distribution of the identified IHC stains was then calculated by the kernel density estimator.\nThe regression analysis showed a correlation coefficient of 0.8961 between the number of IHC stains counted by our stain recognition algorithm and that by the manual counting, suggesting that our stain recognition algorithm was in good agreement with the manual counting. The density distribution of the IHC stains showed a consistent pattern with those of the cellular magnetic resonance (MR) images that detected macrophages labeled by ultrasmall superparamagnetic iron-oxide or micron-sized iron-oxide particles.\nOur method provides a new imaging modality to facilitate clinical diagnosis. It also provides a way to validate/correlate cellular MRI data used for tracking immune-cell infiltration in cardiac transplant rejection and cardiac ischemic injury.","authors":["Fang-Cheng Yeh","Qing Ye","Kevin Hitchens","Yijen Lin Wu"],"meta":["January 2014","DOI:10.4103/2153-3539.126140","SourcePubMed"],"references":["255986689_Pathology_imaging_informatics_for_quantitative_analysis_of_whole-slide_images","255695829_Automatic_Nuclei_Segmentation_in_HE_Stained_Breast_Cancer_Histopathology_Images","305397799_Remarks_on_Some_Nonparametric_Estimates_of_a_Density_Function","243618687_An_Introduction_to_Morphological_Image_Processing","230827273_An_Efficient_Computational_Framework_for_the_Analysis_of_Whole_Slide_Images_Application_to_Follicular_Lymphoma_Immunohistochemistry","224817392_On_Estimation_of_Probability_Density_Function_and_Mode","220602469_Computer-aided_Prognosis_of_Neuroblastoma_on_Whole-slide_Images_Classification_of_Stromal_Development","220430343_A_General_Approach_to_Connected-Component_Labelling_for_Arbitrary_Image_Representations","51770434_Digital_Transplantation_Pathology_Combining_Whole_Slide_Imaging_Multiplex_Staining_and_Automated_Image_Analysis","49787842_Ensemble_based_system_for_whole-slide_prostate_cancer_probability_mapping_using_color_texture_features"]}