{"id":"261187712_Flexible_bimetal_and_piezoelectric_based_thermal_to_electrical_energy_converters","abstract":"A new approach to thermal energy harvesting is presented in this paper. The devices we fabricate are composed of thermal bimetals and piezoelectric membranes. Bimetals that show a snapping behavior when heated are used. When brought to a predetermined temperature, a bimetal snaps abruptly from one position to another. In this step a thermal to mechanical conversion takes place. The provided mechanical energy is then converted into electricity by a piezoelectric membrane. When shocked by the bimetal, the piezoelectric material provides voltage pulses that can be recovered with the help of an energy harvesting circuit. With this approach we have managed to build thin devices that are assembled into matrixes on a flexible substrate, and work at temperatures close to ambient. The key point of their functioning is their intrinsic ability to keep a high temperature gradient when heated and thus work without a heat sink. This is a substantial advantage over the thermal harvesters based on Seebeck effect that need a bulky heat sink for optimal performance. Pulse frequencies of 2.4 Hz have been reached, with an electrical energy per pulse up to 31 μJ. The mechanical energy per cycle delivered by a bimetal is bigger and can reach 770 μJ for a 3 °C temperature difference operation. These results have been obtained while cooling with ambient air, without a heat sink. The main characteristics of our devices and ways to improve the performance are discussed in this paper.","authors":["O. Puscasu","Stephane Monfray","J. Boughaleb","P. J. Cottinet"],"meta":["August 2014Sensors and Actuators A Physical 214","DOI:10.1016/j.sna.2014.03.027"],"references":["243676611_Revival_of_the_jumping_disc","235258430_Semi-flexible_bimetal-based_thermal_energy_harvesters","7686062_Toward_energy_harvesting_using_active_materials_and_conversion_improvement_by_nonlinear_processing","5633071_Complex_Thermoelectric_Materials","265367407_Stability_of_a_bimetallic_disc_Part_II","230909702_Instability_in_micromachined_curved_thermal_bimorph_structures","224454960_Small-scale_energy_harvesting_through_thermoelectric_vibration_and_radiofrequency_power_conversion","200036890_Analysis_of_Bi-Metal_Thermostats"]}