{"id":"261128937_Devnagari_character_recognition_using_self_organizing_maps","abstract":"Online handwriting recognition is gaining more and more interest as there is increase of pen computing applications and new pen input devices. The main reason behind this is the easy availability of pen computing devices due to the advances in the technology. The recognition of Devnagari characters is different from western handwriting recognition and poses a special challenge. The objective of this work is to develop a system which can recognize an online handwritten Devnagari character. The character is written with the help of tablet pen. The character written on canvas is then cropped out, converted into fixed size, sampled horizontally and vertically and is mapped on 5 × 7 matrix template. This matrix is then converted into a vector with thirty five elements. Which are used as inputs to the two layer Self Organizing Maps network. The number of characters to be recognized are fourty. For the given input the network is trained using unsupervised learning. On the links between the input layer and output layer a random weight matrix is defined. In the training process of the network, this random weight matrix moves more and more closer to the input. When it becomes nearly equal to the input, training stops. For every input character only one of the output neurons wins.","authors":["Kailash Sharma","Anil Karwankar","Anjali Bhalchandra"],"meta":["October 2010","DOI:10.1109/ICCCCT.2010.5670752","Conference: Communication Control and Computing Technologies (ICCCCT), 2010 IEEE International Conference on","Project: Online Devnagari character recognition"],"references":["239915974_Segmentation_of_Touching_Characters_in_Devanagari","232644640_Machine_recognition_of_online_handwritten_Devanagari_characters","228848968_LipiTk_A_Generic_Toolkit_for_Online_Handwriting_Recognition","228058014_Pattern_Classification","220860947_On_How_to_Describe_Shapes_of_Devanagari_Characters_and_Use_Them_for_Recognition","3191825_State_of_the_art_in_on-line_handwriting_recognition","224673275_Structural_Approach_on_Writer_Independent_Nepalese_Natural_Handwriting_Recognition","222537795_Segmentation_of_touching_and_fused_Devanagari_characters","4310690_Recognition_of_hand_written_Devnagari_characters_with_percentage_component_regular_expression_matching_and_classification_tree"]}