{"id":"261146570_Mobile_collaboration_technology_in_engineering_asset_maintenance_A_Delphi_study","abstract":"Currently, doing maintenance has significantly altered due to changes in equipment design, information and communication technology, cost pressures and customer acceptance of risk and failures. Moreover, current working circumstances are more complex and require parallel multiple actions. An integrated high-level maintenance comprising multiple sub-systems requires the collaboration of many stakeholders including multiple systems and departments. They work together to improve coordination and sharing of information within the whole disparate maintenance process. The emerging mobile technologies are rapidly developing viewed as business enablers, and they have the impact, use and penetration of the marketplace to support asset maintenance practices. Mobile technology can maintain collaborative information sharing and provides a number of benefits to an organization such as working collaboratively or separately. To achieve high quality and efficiency of maintenance for engineering assets, this research proposes to develop an appropriate mobile collaboration framework based on a Delphi investigation. This framework is concerned with adopting and implementing new mobile technologies that meet all maintenance collaboration requirements, where organizations can expand the existing technology they are using.","authors":["Faisal Syafar","Jing Gao"],"meta":["June 2013","DOI:10.1109/CSCWD.2013.6581010","Conference: Computer Supported Cooperative Work in Design (CSCWD), 2013 IEEE 17th International Conference on"],"references":["242165496_The_maintenance_management_framework","237035943_The_Delphi_Method_Techniques_and_Applications","235339764_Education_in_Engineering_Asset_Management_-_current_trends_and_challenges","291568461_mobileSJ","279712459_Collaborative_maintenance_A_strategy_to_help_manufacturers_become_lean_mean_and_agile","272177878_An_Experimental_Application_of_the_DELPHI_Method_to_the_Use_of_Experts","270389806_The_Unbounded_Mind_Breaking_the_Chains_of_Traditional_Business_Thinking","239060364_Decision-making_for_Technology_Executives_Using_Multiple_Perspectives_to_Improve_Performance","238655842_Coordination_theory_and_collaboration_technology","238194240_CMMS_and_its_application_in_power_system"]}