{"id":"261134127_PIE_A_lightweight_control_scheme_to_address_the_bufferbloat_problem","abstract":"Bufferbloat is a phenomenon where excess buffers in the network cause high latency and jitter. As more and more interactive applications (e.g. voice over IP, real time video conferencing and financial transactions) run in the Internet, high latency and jitter degrade application performance. There is a pressing need to design intelligent queue management schemes that can control latency and jitter; and hence provide desirable quality of service to users. We present here a lightweight design, PIE (Proportional Integral controller Enhanced), that can effectively control the average queueing latency to a reference value. The design does not require per-packet extra processing, so it incurs very small overhead and is simple to implement in both hardware and software. In addition, the design parameters are self-tuning, and hence PIE is robust and optimized for various network scenarios. Simulation results, theoretical analysis and Linux testbed results show that PIE can ensure low latency and achieve high link utilization under various congestion situations.","authors":["Rong Pan","Preethi Natarajan","Chiara Piglione","Mythili Suryanarayana Prabhu"],"meta":["July 2013","DOI:10.1109/HPSR.2013.6602305","Conference: HPSR 2013"],"references":["221244070_On_Designing_Improved_Controllers_for_AQM_Routers_Supporting_TCP_Flows","221164229_Fluid-based_analysis_of_network_of_AQM_routers_supporting_TCP_flows_with_an_application_to_RED","3893922_A_control_theoretic_analysis_of_RED","313491236_Random_early_detection_gateways_for_congestion_avoidance","302452910_Analysis_and_simulation_of_a_fair_queueing_algorithm","242505628_Random_Early_Detection_Gateways_for_Congestion_AIvoidance","242368595_On_designing_improve_controllers_for_aqm_routers_supporting_tcp","224393001_Approximate_fair_bandwidth_allocation_A_method_for_simple_and_flexible_traffic_management","224231908_Bufferbloat_Dark_Buffers_in_the_Internet","3334975_An_Adaptive_Virtual_Queue_AVQ_algorithm_for_Active_Queue_Management"]}