{"id":"261102092_Carbon_footprint_and_land_requirement_for_dairy_herd_rations_Impacts_of_feed_production_practices_and_regional_climate_variations","abstract":"Feed production is a significant source of greenhouse gas (GHG) emissions from dairy production and demands large arable and pasture acreage. This study analysed how regional conditions influence GHG emissions of dairy feed rations in a life cycle perspective, that is the carbon footprint (CF) and the land area required. Factors assessed included regional climate variations, grass/clover silage nutrient quality, feedstuff availability, crop yield and feed losses. Using the Nordic feed evaluation model NorFor, rations were optimised for different phases of lactation, dry and growing periods for older cows, first calvers and heifers by regional feed advisors and combined to annual herd rations. Feed production data at farm level were based on national statistics and studies. CF estimates followed standards for life cycle assessment and used emissions factors provided by IPCC. The functional unit was 'feed consumption to produce 1 kg energy corrected milk (ECM) from a cow with annual milk yield of 9 900 kg ECM including replacement animals and feed losses'. Feed ration CF varied from 417 to 531 g CO2 e/kg ECM. Grass/clover silage contributed more than 50% of total GHG emissions. Use of higher quality silage increased ration CF by up to 5% as a result of an additional cut and increased rates of synthetic N-fertiliser. Domestically produced horse bean (Vicia faba), by-products from the sugar industry and maize silage were included in the rations with the lowest CF, but horse bean significantly increased ration land requirement. Rations required between 1.4 to 2 m2 cropland and 0.1 to 0.2 m2/kg semi-natural grassland per kg ECM and year. Higher yield levels reduced ration total CF. Inclusion of GHG emissions from land use change associated with Brazilian soya feed significantly increased ration CF. Ration CF and land use depended on ration composition, which was highly influenced by the regional availability and production of feedstuffs. The impact of individual feedstuffs on ration CF varies due to, for example, cultivation practices and climate conditions and feedstuffs should therefore be assessed in a ration and regional perspective before being used to decrease milk CF. Land use efficiency should be considered together with ration CF, as these can generate goal conflicts.","authors":["Maria Henriksson","Christel Cederberg","Christian Swensson"],"meta":["March 2014animal 8(8):1-10","DOI:10.1017/S1751731114000627","SourcePubMed"],"references":["268806051_Evaluation_of_the_feed_intake_models_in_the_Nordic_feed_evaluation_system_NorFor","265250670_Evaluation_of_the_Livestock_Sector's_Contribution_to_the_EU_Greenhouse_Gas_Emissions_GGELS_-_Final_Report","312456093_Environmental_Management_-_Life_Cycle_Assessment_-_Requirements_and_Guidelines_ISO_140442006","286556066_Feed_calculations_in_NorFor","285085563_Contribution_of_Working_Group_I_to_the_Fourth_Assessment_Report_of_the_Intergovernmental_Panel_on_Climate_Change","281466143_Greenhouse_gas_emissions_from_production_of_imported_and_local_cattle_feed","279909034_Dry_matter_losses_of_grass_lucerne_and_maize_silages_in_bunker_silos","279419444_Exploring_variability_in_methods_and_data_sensitivity_in_carbon_footprints_of_feed_ingredients","271006230_Enteric_methane_production_digestibility_and_rumen_fermentation_in_dairy_cows_fed_different_forages_with_and_without_rapeseed_fat_supplementation","263107623_Impact_of_cultivation_strategies_and_regional_climate_on_greenhouse_gas_emissions_from_grassclover_silage"]}