{"id":"261228872_Analysis_of_distributed_algorithms_for_density_estimation_in_VANETs_Poster","abstract":"Vehicle density is an important system metric used in monitoring road traffic conditions. Most of the existing methods for vehicular density estimation require either building an infrastructure, such as pressure pads, inductive loop detector, roadside radar, cameras and wireless sensors, or using a centralized approach based on counting the number of vehicles in a particular geographical location via clustering or grouping mechanisms. These techniques however suffer from low reliability and limited coverage as well as high deployment and maintenance cost. In this paper, we propose fully distributed and infrastructure-free mechanisms for the density estimation in vehicular ad hoc networks. Unlike previous distributed approaches, that either rely on group formation, or on vehicle flow and speed information to calculate density, our study is inspired by the mechanisms proposed for system size estimation in peer-to-peer networks. We adapted and implemented three fully distributed algorithms, namely Sample & Collide, Hop Sampling and Gossip-based Aggregation. The extensive simulations of these algorithms at different vehicle traffic densities and area sizes for both highways and urban areas reveal that Hop Sampling provides the highest accuracy in least convergence time and introduces least overhead on the network, but at the cost of higher load on the initiator node.","authors":["Nabeel Akhtar","Sinem Coleri Ergen","Oznur Ozkasap"],"meta":["November 2012","DOI:10.1109/VNC.2012.6407425","Conference: Vehicular Networking Conference (VNC), 2012 IEEE"],"references":["224368372_Evaluation_of_a_Neighbor-based_Vehicle_Density_Estimation_Scheme","224290764_An_Infrastructure-Free_Traffic_Information_System_for_Vehicular_Networks","224248169_MobSampling_V2V_Communications_for_Traffic_Density_Estimation","261450705_Traffic_density_estimation_under_heterogeneous_traffic_conditions_using_data_fusion","238007440_Store-Carry-Forward_Message_Dissemination_in_Vehicular_Ad-Hoc_Networks_with_Local_Density_Estimation","228446697_Automatic_Traffic_Density_Estimation_and_Vehicle_Classification_for_Traffic_Surveillance_Systems_Using_Neural_Networks","224360789_Extracting_vehicle_density_from_background_estimation_using_Kalman_filter","224321852_Analytical_Model_for_Connectivity_in_Vehicular_Ad_Hoc_Networks","224240121_Exploiting_Wireless_Communication_in_Vehicle_Density_Estimation","224237222_Evaluating_vehicular_ad_hoc_networks_for_group_applications"]}