{"id":"261213953_Teaching_Introductory_Programming_to_IS_Students_The_Impact_of_Teaching_Approaches_on_Learning_Performance","abstract":"Introductory programming courses are typically required for undergraduate students majoring in Information Systems. Instructors use different approaches to teaching this course: some lecturing and assigning programming exercises, others only assigning programming exercises without lectures. This research compares the effects of these two teaching approaches on learning performance by collecting data from two sections of an introductory programming course in an urban public university. One section used lectures and assignments while the other used assignments only. Data analysis included tests within each dataset, tests across the two datasets, and tests of a simple model over the combined dataset. Results indicated that both approaches are effective, but the exercises-only approach is more effective than lectures combined with exercises. Further analysis indicated that students' current programming skills, prior programming experience, and grade expectations are significant antecedents of learning performance in the course. Results support the conclusion suggesting that when teaching introductory programming courses, instructors may want to consider choosing the student-centered active learning over the traditional lecture format in order to improve students' learning performance. This study contributes to the improvement of teaching and learning effectiveness as well as efficiency of introductory programming classes to the benefit of instructors and students, alike.","authors":["Xihui Zhang","Chi Zhang","Thomas F. Stafford","Ping Zhang"],"meta":["January 2013Journal of Information Systems Education 24(2):147-155"],"references":["285051263_Personality_and_Programming","266278173_Practicing_Learner-Centered_Teaching_Pedagogical_Design_and_Assessment_of_a_Second_Life_Project","297472595_Collaborative_team_learning_in_information_systems_A_pedagogy_for_developing_team_skills_and_high_performance","290859656_An_Examination_of_Age_Race_and_Sex_as_Predictors_of_Success_in_the_First_Programming_Course","289427595_An_empirical_examination_of_a_model_of_computer_learning_performance","287181822_Assessing_the_Effectiveness_of_Problem_Based_Learning_in_Higher_Education_Lessons_from_the_literature","268326173_From_Teaching_to_Learning_Learner-Centered_Teaching_and_Assessment_in_Information_Systems_Education","266717660_C_how_to_program_2nd_ed","249797781_School_Engagement_Potential_of_the_Concept_State_of_the_Evidence","242376536_Metaphors_for_instruction_Why_we_talk_about_learning_environments"]}