{"id":"261203841_A_restoration_scheme_for_virtual_networks_using_switches","abstract":"Despite the success story of Internet, the ossification in the underlying infrastructure has become a key problem for its development. Network virtualization allows de-ossifying the internet and it is already a hot research topic nowadays. Virtualization is a very successful technique for sharing and reusing of resources, resulting in higher efficiency. On the other side, there is a need to cope with heterogeneity and a higher complexity in resource management. We will focus here on traffic restoration in virtual networks. The aim of this paper is to propose a simplified scalable restoration scheme for virtual networks using switches. The scheme is very easy to implement and do not need global information on the state of network. The failure is treated only locally and the other nodes in the network do not need to know nothing about it or to undertake special actions. In contrast to conventional IP routing schemes, each node routes the traffic on the basis of the entering arc and on the destination. We show that this is sufficient to deal with all link failure situations in the network, assuming that the network is two-link connected. We model the dimensioning problem with an Integer Linear Program which can be solved exactly for small networks of the literature.","authors":["Thanh Son Pham","Joel Lattmann","Jean-Luc Lutton","Laurent Valeyre"],"meta":["October 2012","DOI:10.1109/ICUMT.2012.6459773","Conference: Ultra Modern Telecommunications and Control Systems and Workshops (ICUMT), 2012 4th International Congress on"],"references":["225137130_Survivable_Virtual_Network_Embedding","248600092_IP_Fast_Reroute_using_Not_-_via_Addresses","242587064_Multiwavelength_Optical_Networks_a_Layered_Approach","234804921_Optimizing_Post-Failure_Network_Performance_for_IP_Fast_Reroute_using_Tunnels","228982167_IP_fast_reroute_with_failure_inferencing","224694170_Fast_IP_Network_Recovery_Using_Multiple_Routing_Configurations","220545090_Virtual_networks_Isolation_performance_and_trends","3513310_Fault-tolerant_real-time_communication_in_distributed_computing_systems","3300259_Fault-tolerant_real-time_communication_in_distributed_computing_systems"]}