{"id":"261265074_Use_of_Digital_Signature_with_Diffie_Hellman_Key_Exchange_and_AES_Encryption_Algorithm_to_Enhance_Data_Security_in_Cloud_Computing","abstract":"Cloud computing is the apt technology for the decade. It allows user to store large amount of data in cloud storage and use as and when required, from any part of the world, via any terminal equipment. Since cloud computing is rest on internet, security issues like privacy, data security, confidentiality, and authentication is encountered. In order to get rid of the same, a variety of encryption algorithms and mechanisms are used. Many researchers choose the best they found and use it in different combination to provide security to the data in cloud. On the similar terms, we have chosen to make use of a combination of authentication technique and key exchange algorithm blended with an encryption algorithm. This combination is referred to as \"Three way mechanism\" because it ensures all the three protection scheme of authentication, data security and verification, at the same time. In this paper, we have proposed to make use of digital signature and Diffie Hellman key exchange blended with (AES) Advanced Encryption Standard encryption algorithm to protect confidentiality of data stored in cloud. Even if the key in transmission is hacked, the facility of Diffie Hellman key exchange render it useless, since key in transit is of no use without user's private key, which is confined only to the legitimate user. This proposed architecture of three way mechanism makes it tough for hackers to crack the security system, thereby protecting data stored in cloud.","authors":["Prashant Rewagad","Yogita Pawar"],"meta":["April 2013","DOI:10.1109/CSNT.2013.97","Conference: Communication Systems and Network Technologies (CSNT), 2013 International Conference on","Project: Data Security in cloud storage services"],"references":["264235540_Modern_Encryption_Techniques_for_Cloud_Computing_Randomness_and_Performance_Testing","261155650_Security_threats_in_cloud_computing","255708329_An_analysis_of_the_cloud_computing_security_problem","254029141_Data_Security_and_Privacy_Protection_Issues_in_Cloud_Computing","261131364_Research_on_cloud_computing_data_security_model_based_on_multi-dimension","254020856_Security_architecture_for_cloud_networking","224602462_Cloud_Security_Issues","224209314_Implementing_digital_signature_with_RSA_encryption_algorithm_to_enhance_the_Data_Security_of_cloud_in_Cloud_Computing"]}