{"id":"261208093_Towards_a_Modular_and_Lightweight_Model_for_Android_Development_Platforms","abstract":"With the growing complexity of embedded systems, new development platforms based on modular decoupled components and a pluggable dynamic service design are needed for implementation, and maintenance of heterogeneous mobile applications. As mobile devices have limited resources, these platforms need to be lightweight to achieve required performances. New middleware layers are added to the mobile devices to provide more modularity and loose coupling between components. However, most of these multi-layer designed middle wares are complex and heavy, and need important resources that become the bottleneck for reactive services. This article aims to introduce service oriented approach to integrate modularity and dynamic service management into the mobile Android platform to make the software development adaptive without altering performances. The main contribution of this paper is the establishment of a low level solution incorporating modularity into Android software development platform. The proposed solution is a service-architecture for Android-based applications without adding a multi-layer middleware while maintaining the initial performances.","authors":["Mussab Zneika","Hassan Loulou","Fatiha Houacine","Samia Bouzefrane"],"meta":["August 2013","DOI:10.1109/GreenCom-iThings-CPSCom.2013.400","Conference: Green Computing and Communications (GreenCom), 2013 IEEE and Internet of Things (iThings/CPSCom), IEEE International Conference on and IEEE Cyber, Physical and Social Computing"],"references":["288629846_OSGi_ME_-_An_OSGi_Profile_for_Embedded_Devices","261319738_MCC-OSGi_An_OSGi-based_mobile_cloud_service_model","228344147_Service-oriented_architecture_for_mobile_applications","41086306_A_security_framework_for_SOA_applications_in_mobile_environment","279255670_Convergence_OSGI-JAVACARD_Fine-grained_dynamic_update","225916419_A_Platform_for_Mobile_Service_Provisioning_Based_on_SOA-Integration"]}