{"id":"261348818_Mobile_examination_system","abstract":"Mobile computing has found a number of newer applications today ranging from PDAs and cellphones to a number of applications in the field of education. One such application is the “mobile examination system”. Mobile examination system is a technique of conducting the examination without the use of pen and paper. The technique involves the use of a mobile device in the hands of the student through which he/she can take the examination. Result is displayed immediately after the examination ends. The system is consistent with the current technological advancements in the mobile device design & the wireless technology. The motivation behind the design of the system is to find an alternative to the traditional method of conduct of the examination wherein a lot of head ache is involved for both the students as well as examiners (faculty members). The system is basically an extension of the online examination system. The system has been designed in the Qt SDK, a freeware IDE provided by Forum Nokia. The backend database used by us is the open source SQLite. In this paper I have brought out the detailed technical design of my mobile examination system along with the work flow between various modules of the system.","authors":["Prashant K Gupta"],"meta":["December 2012","DOI:10.1109/PDGC.2012.6449836","Conference: Parallel Distributed and Grid Computing (PDGC), 2012 2nd IEEE International Conference on"],"references":["268407380_Implementing_the_Emerging_Mobile_Technologies_in_Facilitating_Mobile_Exam_System","269922894_An_Architectural_Insight_into_the_National_Online_Examination_System","268044357_The_definitive_guide_to_SQLite","238008142_Design_and_implementation_of_network_examination_system_based_on_J2EE_architecture","232630445_Performance_Optimization_for_Flash_Memory_Database_in_Mobile_Embedded_System","224369098_The_Research_and_Application_of_Online_Examination_and_Monitoring_System","224256088_The_Design_and_Implementation_of_On-Line_Examination_System","220841549_Online_Examination","4054841_A_novel_web-based_online_examination_system_for_computer_science_education"]}