{"id":"261369028_First_Cycle_Games","abstract":"First cycle games (FCG) are played on a finite graph by two players who push a token along the edges until a vertex is repeated, and a simple cycle is formed. The winner is determined by some fixed property Y of the sequence of labels of the edges (or nodes) forming this cycle. These games are traditionally of interest because of their connection with infinite-duration games such as parity and mean-payoff games.\n\nWe study the memory requirements for winning strategies of FCGs and certain associated infinite duration games. We exhibit a simple FCG that is not memoryless determined (this corrects a mistake in \\it Memoryless determinacy of parity and mean payoff games: a simple proof by Björklund, Sandberg, Vorobyov (2004) that claims that FCGs for which Y is closed under cyclic permutations are memoryless determined). We show that Θ(n)! memory (where n is the number of nodes in the graph), which is always sufficient, may be necessary to win some FCGs. On the other hand, we identify easy to check conditions on Y (i.e., Y is closed under cyclic permutations, and both Y and its complement are closed under concatenation) that are sufficient to ensure that the corresponding FCGs and their associated infinite duration games are memoryless determined. We demonstrate that many games considered in the literature, such as mean-payoff, parity, energy, etc., satisfy these conditions. On the complexity side, we show (for efficiently computable Y) that while solving FCGs is in PSPACE, solving some families of FCGs is PSPACE-hard.","authors":["Benjamin Aminof","Sasha Rubin"],"meta":["April 2014","DOI:10.4204/EPTCS.146.11","SourcearXiv"],"references":["235885316_Energy_Parity_Games","220897038_Half-Positional_Determinacy_of_Infinite_Games","220701025_Games_Where_You_Can_Play_Optimally_Without_Any_Memory","220643239_Exploring_the_boundary_of_half-positionality","226645887_Positional_strategies_for_mean_payoff_games","220555391_Introduction_to_the_Theory_of_Computation","220148647_Memoryless_determinacy_of_parity_and_mean_payoff_games_A_simple_proof"]}