{"id":"261386106_Efficient_wireless_scheduling_with_limited_channel_feedback_and_performance_guarantees","abstract":"It is well known that Max-Weight scheduling provides queue stability whenever this is possible. However, Max-Weight scheduling requires the complete channel state information (CSI) to make the best transmission decision at every time slot. The common assumption in this line of research assumes that the network controller has full CSI at every decision time without taking into account the overhead associated with channel probing. In practice, however, acquiring CSI is not cost-free and requires certain amount of resources. In this work, we design a Scheduling and Dynamic Feedback algorithm, named SDF, by considering the overhead of obtaining the channel state information. We first establish a bound on the achievable rate region of SDF algorithm by proving that SDF supports 1+ ϵ fraction of of the full rate region (the rate region when all users are probed) where ϵ only depends on the expected number of users which are not probed. Then, for homogenous channel, we show that when the number of users in the network is greater than 3, ϵ >;0, i.e., we guarantee to expand the rate region. We also demonstrate numerically in a realistic simulation setting that this rate region can be achieved by probing only less than 50% of all channels in a CDMA based cellular network utilizing high data rate protocol under normal channel conditions.","authors":["Mehmet Karaca","Yunus Sarıkaya","Ozgur Ercetin","Tansu Alpcan"],"meta":["September 2012","DOI:10.1109/PIMRC.2012.6362504","Conference: Personal Indoor and Mobile Radio Communications (PIMRC), 2012 IEEE 23rd International Symposium on"],"references":["228441660_Approximately_Optimal_Adaptive_Learning_in_Opportunistic_Spectrum_Access","224243975_Exploiting_channel_memory_for_joint_estimation_and_scheduling_in_downlink_networks","221941003_Throughput_Optimal_Scheduling_with_Dynamic_Channel_Feedback","221628402_Scheduling_with_limited_information_in_wireless_systems","311702569_Stability_properties_of_constrained_queueing_systems_and_scheduling_policies_for_maximum_throughput_in_multihop_radio_networks","260661557_Max_Weight_Learning_Algorithms_for_Scheduling_in_Unknown_Environments","224493570_Max_weight_learning_algorithms_with_application_to_scheduling_in_unknown_environments","224266593_On_Wireless_Scheduling_With_Partial_Channel-State_Information","222403206_A_Framework_for_Opportunistic_Scheduling_in_Wireless_Networks","221243290_Energy_optimal_control_for_time-varying_wireless_networks"]}