{"id":"261305816_Evaluating_the_Role_of_Collaboration_Scripts_as_Group_Guiding_Tools_in_Activities_of_Educational_Robotics_Conclusions_from_Three_Case_Studies","abstract":"Although educational robotics (ER) is considered an innovative and engaging technology for teaching and learning, certain studies emphasize the lack of a coherent and well elaborated pedagogical framework for its implementation. This work contributes toward the development of such a framework by presenting evidence from three case studies implementing ER activities in the school context. The objective has been to explore the impact of various collaboration scripts when used as tools to guide students' groupwork during the ER activity. ER activities have been conducted in three secondary education schools (one lower and two higher) employing the TAPPS, Jigsaw and “Send a problem” collaboration techniques and assigning specific roles to students. Key results (based on observation, students' questionnaire and interviews) include the following: (a) combining the Jigsaw and “Send a problem” scripts had the greatest impact on increasing students' interest and active participation; (b) students' subjective impression of improved learning was generated by structured collaboration, (c) students reported improved understanding of programming structures already known from other contexts, (d) the motive “help my group learn based on my expertise” was rated higher by students. Overall, this study presents and discusses field evidence that contribute to an improved pedagogical framework of in-school ER activities.","authors":["Soumela Atmatzidou","Stavros N. Demetriadis"],"meta":["July 2012","DOI:10.1109/ICALT.2012.111","Conference: Advanced Learning Technologies (ICALT), 2012 IEEE 12th International Conference on"],"references":["236577446_Robots_for_Education","261427440_Case_study_of_jigsaw_cooperative_learning_effect_within_Electrical_Engineering_courses","259665345_The_Effects_of_Thinking_Aloud_Pair_Problem_Solving_on_High_School_Students'_Chemistry_Problem-Solving_Performance_and_Verbal_Interactions","255618087_Engaging_Students_A_Framework_Using_LEGOR_Robotics_to_Teach_Problem_Solving","249902458_Scaffolding_Knowledge_Construction_through_Robotic_Technology_A_Middle_School_Case_Study","245686604_Collaborative_Learning_Techniques_A_Handbook_for_College_Faculty","239545651_THE_EFFECTIVENESS_OF_USING_LEGO_MINDSTORMS_ROBOTICS_ACTIVITIES_TO_INFLUENCE_SELF-REGULATED_LEARNING_IN_A_UNIVERSITY_INTRODUCTORY_COMPUTER_PROGRAMMING_COURSE","239484148_Cooperative_Learning_Resources_for_Teachers","228858659_Robotics_education_for_all_ages","228328529_Mindstorms_Children_Computers_and_Powerful_Ideas"]}