{"id":"261353409_Segmentation_of_unknown_objects_in_indoor_environments","abstract":"We present a framework for segmenting unknown objects in RGB-D images suitable for robotics tasks such as object search, grasping and manipulation. While handling single objects on a table is solved, handling complex scenes poses considerable problems due to clutter and occlusion. After pre-segmentation of the input image based on surface normals, surface patches are estimated using a mixture of planes and NURBS (non-uniform rational B-splines) and model selection is employed to find the best representation for the given data. We then construct a graph from surface patches and relations between pairs of patches and perform graph cut to arrive at object hypotheses segmented from the scene. The energy terms for patch relations are learned from user annotated training data, where support vector machines (SVM) are trained to classify a relation as being indicative of two patches belonging to the same object. We show evaluation of the relations and results on a database of different test sets, demonstrating that the approach can segment objects of various shapes in cluttered table top scenes.","authors":["Andreas Richtsfeld","Thomas Mörwald","Johann Prankl","Michael Zillich"],"meta":["October 2012Proceedings of the ... IEEE/RSJ International Conference on Intelligent Robots and Systems. IEEE/RSJ International Conference on Intelligent Robots and Systems","DOI:10.1109/IROS.2012.6385661","Conference: Intelligent Robots and Systems (IROS), 2012 IEEE/RSJ International Conference on"],"references":["265402850_Gestalt_Principles_for_Attention_and_Segmentation_in_Natural_and_Artificial_Vision_Systems","229044549_Fast_and_Automatic_Detection_and_Segmentation_of_unknown_objects","225239147_A_Variational_Model_for_Interactive_Shape_Prior_Segmentation_and_Real-Time_Tracking","224135993_Joint_optimization_of_segmentation_and_appearance_models","321526241_Monographs_in_Visual_Communications","252482398_Interactive_Graph_Cuts_for_Optimal_Boundary_Region_Segmentation_of_Objects_in_N-D_Images","243787475_Monographs_in_Visual_Communication","243632993_Untersuchung_zur_Lehre_von_der_Gestalt_II","228715647_LIBSVM_A_library_for_support_vector_machines","227212967_Combining_SVMs_with_Various_Feature_Selection_Strategies"]}