{"id":"261482639_Discriminatively_weighted_multi-scale_Local_Binary_Patterns_Applications_in_prostate_cancer_diagnosis_on_T2W_MRI","abstract":"In this paper, we present discriminatively weighted Local Binary Patterns (DWLBP), a new similarity metric to match Multi-scale LBP (MsLBP) in Hamming space. While MsLBP is widely used in image processing on account of its extremely fast bitwise operations on modern CPU, identifying a good metric that measures the dissimilarity of MsLBP remains an open problem. The Hamming score is typically computed at each individual scale and the scores across scales are summed up. This approach however often results in underestimating salient patterns. In this paper we seek to learn a vector obtained by optimally weighing the contribution of each individual scale when performing MsLBP based matching. Inspired by supervised learning, our methodology aims to learn the multi-scale, weight vector by minimizing the Hamming scores between positive class samples and jointly maximizing the scores between positive and negative class samples. This objective function leads to a convex formulation with equality and inequality constraints, which can then be solved via the interior-point optimization method. In this paper we evaluate the efficacy of the DWLBP scheme in detecting prostate cancer from T2w MRI and demonstrate that the approach statistically significantly outperforms MsLBP.","authors":["Haibo Wang","Satish Viswanath","Anant Madabhushi"],"meta":["April 2013Proceedings / IEEE International Symposium on Biomedical Imaging: from nano to macro. IEEE International Symposium on Biomedical Imaging","DOI:10.1109/ISBI.2013.6556496","Conference: Biomedical Imaging (ISBI), 2013 IEEE 10th International Symposium on"],"references":["222526399_Locality_sensitive_hashing_A_comparison_of_hash_function_types_and_querying_mechanisms","51708586_Optimization_of_Complex_Cancer_Morphology_Detection_Using_the_SIVQ_Pattern_Recognition_Algorithm","46788099_LDAHash_Improved_Matching_with_Smaller_Descriptors","319770469_Spectral_Hashing","316240097_Distinctive_Image_Features_from_Scale-Invariant_Keypoints","313181023_Distinctive_image_features_from_scale-invariant_keypoints","268733104_Speeded-up_robust_features_SURF","200038910_Distinctive_Image_Features_from_Scale-Invariant_Keypoints","51178952_Elastic_registration_of_multimodal_prostate_MRI_and_histology_via_multiattribute_combined_mutual_information","3193420_Multiresolution_Gray-Scale_and_Rotation_Invariant_Texture_Classification_with_Local_Binary_Patterns"]}