{"id":"261456253_The_impact_of_YouTube_videos_on_the_student's_learning","abstract":"An important part of education is student's learning. Good quality education is based mainly on how well student attain the knowledge. One way to achieve that is to simplify the content and make it as intuitive as possible. This can be challenging especially for introductory computer science courses for non-computer science students. Such courses are supposed to cover a wide range of complex computer concepts such as networking, computer internal hardware, databases, operating systems and others. In this paper we are presenting the results of a study done on the use of YouTube videos to enhance students' learning. We have evaluated the student's performance in an introduction to computers course for non-computer science students by comparing two groups of students, The first one is a test group in which we have supplied the students with a set of videos from YouTube to illustrate different concepts such as multiple core versus single core processor, hard disk internal components, using fiber optic cables to connect continents under water. ect. The second is a control group in which we have only used the traditional resources, such as the textbook, in class lectures and handouts. The results of the study have shown that students understand and can remember the complex concepts much better when they are exposed to a visual explanation video. We found that most of the students if not all watched the short videos, which is not the case with textual content. One of the main advantages of YouTube is that it is a free web based service that contains short contents about specific concepts taught in schools. Educators can easily search and review videos related to a specific concept or knowledge, and then provide the students with the link. In our case the videos were downloaded using RealPlayer plugin, which allowed us to download any video streaming content on the web. Then we have uploaded the videos in our LMS (learning management system). We have opted to include th- videos in the LMS so that we can track the number of students who have downloaded the videos and keep track of the number of downloads. In this study we have found that using YouTube videos encouraged students to look for similar videos, and get a habit of using YouTube as an educational resource. The only challenge is the evaluation of the reliability of the content, for that reason content selection has to done by the instructor. Lastly, YouTube videos have been a useful source of educational content, it is a free web based tool, and the impact has been important based on our study on students' performance. Educators have used YouTube videos in other fields such as nursing in [1] and have proven to be an effective tool to enhance students learning and engagement.","authors":["Yousra Chtouki","Hamid Harroud","Mohammed Khalidi","Samir Bennani"],"meta":["June 2012","DOI:10.1109/ITHET.2012.6246045","Conference: Information Technology Based Higher Education and Training (ITHET), 2012 International Conference on"],"references":["254703243_YouTube_and_Other_Web_20_Applications_for_Nursing_Education","232632467_Content_Contribution_in_Social_Media_The_Case_of_YouTube","221363016_YouTubeCat_Learning_to_Categorize_Wild_Web_Videos","242648051_The_National_Committee_of_Inquiry_into_Higher_Education","240336153_The_social_work_practicum_A_guide_and_workbook_for_students","225083673_Higher_Education_in_the_Learning_Society_Main_Report","23685913_An_Untapped_Resource_Using_YouTube_in_Nursing_Education"]}