{"id":"261461914_SDC-based_modulo_scheduling_for_pipeline_synthesis","abstract":"Modulo scheduling is a popular technique to enable pipelined execution of successive loop iterations for performance improvement. While a variety of modulo scheduling algorithms exist for software pipelining, they are not amenable to many complex design constraints and optimization goals that arise in the hardware synthesis context. In this paper we describe a modulo scheduling framework based on the formulation of system of difference constraints (SDC). Our framework can systematically model a rich set of performance constraints that are specific to the hardware design. The scheduler also exploits the unique mathematical properties of SDC to carry out efficient global optimization and fast incremental update on the constraint system to minimize the resource usage of the synthesized pipeline. Experiments demonstrate that our proposed technique provides efficient solutions for a set of real-life applications and compares favorably against a widely used lifetime-sensitive modulo scheduling algorithm.","authors":["Zhiru Zhang","Bin Liu"],"meta":["November 2013IEEE/ACM International Conference on Computer-Aided Design, Digest of Technical Papers","DOI:10.1109/ICCAD.2013.6691121","Conference: Computer-Aided Design (ICCAD), 2013 IEEE/ACM International Conference on"],"references":["228937160_Swing_modulo_scheduling_for_gcc","228057700_Theoretical_Improvement_in_Algorithmic_Efficiency_for_Network_Flow_Problems","225417333_Solving_Systems_of_Difference_Constraints_Incrementally","314807884_A_comparative_study_of_modulo_scheduling_techniques","305258039_Lifetime-Sensitive_Modulo_Scheduling","287646409_AutoPilot_A_platform-based_ESL_synthesis_system","269200506_Rotation_scheduling","245609808_Caracterisation_des_Matrices_Totalement_Unimodulaires","239539601_Loop_winding--a_data_flow_approach_to_functional_pipelining","234781514_Software_pipelining_An_effective_scheduling_technique_for_VLIW_machines"]}