{"id":"261459906_An_innovative_approach_to_problem_identification_and_design_for_capstone_projects","abstract":"Capstone project forms an important part of engineering degree programme as it has a bearing on both employability and admission to higher education. Choice of problem is very crucial decision in the first stage of the project. Problem definition is normally given by the faculty members or chosen by the students. Inadequate efforts and thinking at this stage has negative impact on the performance of the student teams. Poorly managed requirements resulting in poorly defined scope extend the project time and efforts or mostly leave the projects half done. Sometimes, the very problem definitions are changed in the middle. Yet another phenomenon observed is gross injustice done to design phase. Students tackle the project with the mindset of one problem and a unique solution. Further traceability is rarely achieved among the various stages of development. A new approach to problem identification is attempted by the authors in the capstone project wherein every project team puts in adequate efforts while finalizing the problem definition for the capstone project. An innovative approach to alternate designs is tried resulting in the choice of the right design through discussions and deliberations. In the entire process, peer review and feedback is made part of assessment which has improved the learning. Assessment rubrics are developed and communicated to stakeholders resulting in uniform assessment which was otherwise a challenge. This has resulted in improved leaning by students and enhanced participation of both faculty members and students right from the beginning of the project phase. The paper discusses the experiences of the authors and the innovative practices adopted to address the issues related to handling of large number of student projects.","authors":["M. Vijayalakshmi","Padmashree D. Desai","Gopalkrishna Joshi"],"meta":["July 2012","DOI:10.1109/AICERA.2012.6306738","Conference: Engineering Education: Innovative Practices and Future Trends (AICERA), 2012 IEEE International Conference on"],"references":["224088849_Guidelines_for_the_final_year_project_assessment_in_engineering","242394951_A_Survey_of_Capstone_Engineering_Courses_in_North_America"]}