{"id":"261403714_Promotional_Strategy_in_Computer_Science_Research_Articles_of_A_Malaysian_Journal","abstract":"Research articles are known to be concise and straight to the point however, studies have shown that promotional strategies have permeated into the writings of the scientific authors. The inclination to use promotional strategies can be attributed to the various research article writing motivations such as for career advancement, for sharing of knowledge, to secure research funding, to meet the requirement of the grant sponsors and to meet the university performance measures. While the native writers have been reported to utilize the promotional strategy as part of their writing strategy, lesser account on such practice has been described in relation to research articles written by non native writers. Broader account on the practice among non native writers is necessary to enhance the teaching of this strategy in the academic writing of ESL writers. This paper is aimed to discuss the use of promotional strategies in the research articles and to examine the finding of promotional strategies found in the introduction section of the research articles in a journal published in Malaysia. Ancient Greek rhetorical concepts of Logos, Ethos, Pathos, Telos and Kairos are employed to explain the basic rhetorical function of the Computer Science research articles and then, two steps in Swales (2004) CARS model are used to analyzed the research articles. Findings showed that the use promotional strategy among the subjects is still limited, which brought to a suggestion for the strategy to be incorporated into the teaching of writing research article.","authors":["Ina Suryani","Jasin A.H","Muhammad Hassan Tanveer","Hazry Desa"],"meta":["February 2014","Conference: Symposium of International Language and Knowledge (SILK)At: Langkawi, MalaysiaVolume: 1","Project: Covid-19, Edisi Khas 2020, PENDETA, Journal of Malay Language,  Education and Literature"],"references":["315041228_Research_Publication_Output_by_Academicians_in_Public_and_Private_Universities_in_Malaysia","289431288_Determining_the_significant_factors_affecting_the_physical_and_mental_components_of_academicians_using_robust_linear_regression_models","268378476_Improving_QOS_In_WLAN_Using_Dynamic_Weighted_Fair_Scheduling","267767859_Reducing_Handoff_Delay_In_WLan_Using_Selective_Proactive_Context_Caching","267297639_Classification_And_Regression_Tree_In_Prediction_Of_Survival_Of_AIDS_Patients_CLASSIFICATION_AND_REGRESSION_TREE_IN_PREDICTION_OF_SURVIVAL_OF_AIDS_PATIENTS","291122160_A_Precise_Specification_For_The_Modelling_Of_Collaborations","290361741_Region_Based_Huffman_RBH_Compression_Technique_with_code_interchange","266892473_DChord_An_Efficient_and_Robust_Peer_to_Peer_Lookup_System","265628154_INVESTIGATING_TEXTUAL_STRUCTURE_IN_NATIVE_AND_NON-NATIVE_ENGLISH_RESEARCH_ARTICLES_STRATEGY_DIFFERENCES_BETWEEN_ENGLISH_AND_INDONESIAN_WRITERS","265143370_Writing_Scientific_Research_Articles_in_Thai_and_English_Similarities_and_Differences"]}