{"id":"261494032_Building_An_Interactive_Simulator_on_A_Cloud_Computing_Platform_to_Enhance_Students'_Understanding_of_Computer_Systems","abstract":"Cloud computing technologies have been widely adopted to improve the competitiveness and efficiency of core operations in many enterprises through additional computational resources and/or storage as provided on the underlying cloud platforms. Yet there are relatively few studies on how cloud computing may enhance students' understanding of a specific subject in e-learning systems. In a research project awarded by the Microsoft Research Asia, we successfully developed an interactive simulator aimed to enhance the students' understanding of essential concepts related to computer systems through live animations on a cloud computing platform. Essentially, we propose to integrate the latest technologies of cloud computing and learning objects into an efficient, flexible and interactive simulator to deliver powerful computing services for dynamic simulations of various computer systems specified as \"reactive\" models of learning objects on the cloud storage. More importantly, through adopting the IEEE learning object metadata standard to represent each key concept/component in different computer systems, our proposed simulator can readily facilitate the sharing and reuse of relevant concepts for future e-learning applications. The system design and prototype implementation of our cloud-based interactive simulator is carefully considered with a thorough evaluation plan to investigate on how learners may benefit from our interactive simulator in various ways. And there are many directions for future extensions.","authors":["Vincent W.L. Tam","Alex Jiaqu Yi","Edmund Y Lam"],"meta":["July 2013","DOI:10.1109/ICALT.2013.48","Conference: Advanced Learning Technologies (ICALT), 2013 IEEE 13th International Conference on"],"references":["281643388_Faculty_Perspectives_on_the_334_Curriculum_Reform_in_Hong_Kong_A_Case_Study","221425333_Enhancing_Learning_Paths_with_Concept_Clustering_and_Rule-Based_Optimization","221424117_Developing_an_Innovative_and_Pen-Based_Simulator_to_Enhance_Education_and_Research_in_Computer_Systems"]}