{"id":"261566649_The_dynamics_of_interdisciplinary_research_fields_The_case_of_river_research","abstract":"Interdisciplinarity results from dynamics at two levels. Firstly, research questions are approached using inputs from a variety of disciplinary fields. Secondly, the results of this multidisciplinary research feed back into the various research fields. This may either contribute to the further development of these fields, or may lead to disciplinary reconfiguration. If the latter is the case, a new interdisciplinary field may emerge. Following this perspective, the scientific landscape of river research and river science is mapped to assess to which current river research is a multi-disciplinary endeavor, and to which extent it results in a new emerging (inter)disciplinary field of river science. The paper suggests that this two level approach is a useful method to study interdisciplinary research and, more generally, disciplinary dynamics. With respect to river research, we show that it is mainly performed in several fields (limnology, fisheries & fish research, hydrology & water resources, and geomorphology) that hardly exchange knowledge. The different river research topics are multidisciplinary in nature, as they are shared by different fields. However, river science does not emerge as an interdisciplinary field, and often-mentioned new interdisciplinary fields such as hydroecology or hydromorphology are not (yet) visible. There is hardly any involvement of social within river research. Finally, the field of ecology occupies a central position within river research, whereas an expected engineering field is shown absent. This together may signal the acceptance of the ecosystem-based paradigm in river management, replacing the traditional engineering paradigm.","authors":["Pim Vugteveen","H. J. R. Lenders","Peter Van den Besselaar"],"meta":["April 2014Scientometrics 100(1)","DOI:10.1007/s11192-014-1286-7"],"references":["267939164_Disciplinary_Multidisciplinary_Interdisciplinary_-Concepts_and_Indicators","267378184_Eco-geomorphology_An_interdisciplinary_approach_to_river_science","254871193_The_temporal_and_social_dimensions_of_river_rehabilitation_towards_a_multi-dimensional_research_perspective","288950925_Ecological_function_in_rivers_insights_from_crossdisciplinary_science","281801392_Turbulence_and_train_wrecks_using_knowledge_strategies_to_enhance_the_application_of_integrative_river_science_to_effective_river_management","280566512_Networks_An_Introduction","276942517_Interdisciplinary_research_-_Meaning_metrics_and_nurture_Research_Evaluation_153_187-195","272225347_Ecosystem_Management_Research_Clarifying_the_Concept_of_Interdisciplinary_Work","264920260_Networks_An_Introduction","254859177_Making_rivers_modular_emerging_river_science_1980-2005","252528392_Positioning_indicators_for_cross-disciplinary_challenges_The_Dutch_coastal_defense_research_case","254200906_How_journal_rankings_can_suppress_interdisciplinary_research_A_comparison_between_Innovation_Studies_and_Business_Management","247504794_Facing_Diversity_of_Science_A_Challenge_for_Bibliometric_Indicators","246207338_Fluvial_Landscape_Ecology_Addressing_Uniqueness_Within_the_River_Discontinuum","244455314_Betweenness_Centrality_as_an_Indicator_of_the"]}