{"id":"261526000_An_empirical_study_on_the_efficiency_of_graphical_vs_textual_representations_in_requirements_comprehension","abstract":"Graphical representations are used to visualise, specify, and document software artifacts in all stages of software development process. In contrast with text, graphical representations are presented in two-dimensional form, which seems easy to process. However, few empirical studies investigated the efficiency of graphical representations vs. textual ones in modelling and presenting software requirements. Therefore, in this paper, we report the results of an eye-tracking experiment involving 28 participants to study the impact of structured textual vs. graphical representations on subjects' efficiency while performing requirement comprehension tasks. We measure subjects' efficiency in terms of the percentage of correct answers (accuracy) and of the time and effort spend to perform the tasks. We observe no statistically-significant difference in term of accuracy. However, our subjects spent more time and effort while working with the graphical representation although this extra time and effort does not affect accuracy. Our findings challenge the general assumption that graphical representations are more efficient than the textual ones at least in the case of developers not familiar with the graphical representation. Indeed, our results emphasise that training can significantly improve the efficiency of our subjects working with graphical representations. Moreover, by comparing the visual paths of our subjects, we observe that the spatial structure of the graphical representation leads our subjects to follow two different strategies (top-down vs. bottomup) and subsequently this hierarchical structure helps developers to ease the difficulty of model comprehension tasks.","authors":["Zahra Sharafi","Alessandro Marchetto","Angelo Susi","Giuliano Antoniol"],"meta":["May 2013","DOI:10.1109/ICPC.2013.6613831","Conference: Program Comprehension (ICPC), 2013 IEEE 21st International Conference on","Project: Modified equation of state extended to imidazolium-, phosphonium-, pyridinium-, pyrrolidinium- and ammonium-based ionic liquids"],"references":["265451711_The_Evaluation_of_Information_Visualisation_Techniques_Using_Eye_Tracking","259118316_TAUPE_Visualizing_and_analyzing_eye-tracking_data","238644354_Evaluating_Graphical_vs_Textual_Secondary_Displays_for_Information_Notification","225198353_Tropos_An_Agent-Oriented_Software_Development_Methodology","336387055_Experimental_Comparison_of_the_Comprehensibility_of_a_UML-based_Formal_Specification_versus_a_Textual_One","299534836_Linguistic_distance_A_quantitative_measure_of_the_distance_between_English_and_other_languages","274015857_Team_RDCR_A_Language_And_Environment_For_Statistical_Computing_R_Foundation_for_Statistical_Computing_Vienna_Austria","254007935_An_eye-tracking_study_on_the_role_of_scan_time_in_finding_source_code_defects","251513492_Making_sense_of_business_process_descriptions_An_experimental_comparison_of_graphical_and_textual_notations","234125556_Elements_of_UML_20_Style"]}