{"id":"261514582_Genome_alignment_with_graph_data_structures_A_comparison","abstract":"Recent advances in rapid, low-cost sequencing have opened up the opportunity to study completegenome sequences. The computational approach of multiple genome alignment allows investigationof evolutionarily related genomes in an integrated fashion, providing a basis for downstream analysessuch as rearrangement studies and phylogenetic inference.Graphs have proven to be a powerful tool for coping with the complexity of genome-scale sequencealignments. The potential of graphs to intuitively represent all aspects of genome alignments led tothe development of graph-based approaches for genome alignment. These approaches construct agraph from a set of local alignments, and derive a genome alignment through identification andremoval of graph substructures that indicate errors in the alignment.\nWe compare the structures of commonly used graphs in terms of their abilities to represent alignmentinformation. We describe how the graphs can be transformed into each other, and identify andclassify graph substructures common to one or more graphs. Based on previous approaches, wecompile a list of modifications that remove these substructures.\nWe show that crucial pieces of alignment information, associated with inversions and duplications,are not visible in the structure of all graphs. If we neglect vertex or edge labels, the graphs differ intheir information content. Still, many ideas are shared among all graph-based approaches. Based onthese findings, we outline a conceptual framework for graph-based genome alignment that can assistin the development of future genome alignment tools.","authors":["Birte Kehr","Kathrin Trappe","Manuel Holtgrewe","Reinert Knut"],"meta":["April 2014BMC Bioinformatics 15(1):99","DOI:10.1186/1471-2105-15-99","SourcePubMed"],"references":["312656699_Efficient_bounds_for_oriented_chromosome_inversion_distance","303167148_CLUSTAL_W_Improving_the_sensitivity_of_progressive_multiple_sequence_alignment_through_sequence_weighting_position-specific_gap_penalties_and_weight_matrix_choice","277508262_Katoh_K_Misawa_K_Kuma_KI_Miyata_T_MAFFT_a_novel_method_for_rapid_multiple_sequence_alignment_based_on_fast_Fourier_transform_Nucleic_Acids_Res_30_3059-3066","253330456_Sibelia_A_Scalable_and_Comprehensive_Synteny_Block_Generation_Tool_for_Closely_Related_Microbial_Genomes","252358737_Fast_Statistical_Alignment_Text_S1","247442902_Introduction_To_Algorithms","239063123_T-co_ee_A_novel_method_for_multiple_sequence_alignments","237128705_A_Combinatorial_Problem","233596044_MAFFT_A_novel_method_for_rapid_multiple_sequence_alignment_based_on_fast_Fourier_transform","233396221_Class_of_Multiple_Sequence_Alignment_Algorithm_Affects_Genomic_Analysis","230570059_Hidden_Breakpoints_in_Genome_Alignments","224006418_Integrating_Genomes","222693263_Notredame_C_Higgins_D_G_Heringa_J_T-Coffee_A_novel_method_for_fast_and_accurate_multiple_sequence_alignment_J_Mol_Biol_302_205-217","221693703_Analysis_of_Gene_Order_Evolution_Beyond_Single-Copy_Genes","221693696_Whole-Genome_Alignment"]}