{"id":"261693034_The_Lateral_Coding_of_Rotations","abstract":"A number of experimental studies have consistently shown the locus of spatial S-R compatibility effects to be the selection of the response within an abstract memory code. The purpose of the present study was to test, in the particular case of wheel rotations, the general proposition that any response that a subject internally codes in terms of left and right may be interfered with by the lateral location of the stimuli in a Simon paradigm. Experiment 1 showed that the auditory Simon effect occurred in a task where the subjects had to rotate a steering wheel bimanually either clockwise or counterclockwise according to sound pitch, despite the fact that responses of this kind are undefined with respect to laterality. Experiment 2 confirmed this result in a unimanual rotation condition and suggested that the ear-rotation compatibility effect may be added to the effect of a biomechanical factor, pronation versus supination, supporting the idea of an abstract motor code. In Experiment 3, subjects rotated the steering wheel with their hands on the lowest part of the wheel. When the response movement made the spot of a C.R.T. move laterally in accordance with the performed rotation, the subjects coded their response directly in terms of its effect on the visual display. For subjects not receiving visual feedback, no compatibility effect occurred. However, the individual data were compatible with the notion that some subjects in this group coded their responses in terms of wheel rotations, and others in terms of hand movements.","authors":["Yves Guiard"],"meta":["August 2013Journal of Motor Behavior 15(4):331-342","DOI:10.1080/00222895.1983.10735303"],"references":["18077755_S-R_compatibility_and_the_idea_of_response_code","243764232_20_Stage_Analysis_of_Reaction_Processes","51272729_Auditory_S-R_compatibility_Reaction_time_as_a_function_of_ear-hand_correspondence_and_ear-response-location_correspondence","22507411_Evidence_for_Abstract_Response_Codes_Ear-Hand_Correspondence_Effects_in_a_Three-Choice_Reaction-Time_Task","19064362_Processing_symbolic_information_from_a_visual_display_Interference_from_an_irrelevant_directional_cue","17139914_Auditory_S-R_compatibility_The_effect_of_an_irrelevant_cue_on_information_processing","10456751_S-R_compatibility_spatial_characteristics_of_stimulus_and_response_codes_Journal_of_Experimental_Psychology_46_199-210"]}