{"id":"261609312_BraX-Ray_An_X-Ray_of_the_Brazilian_Computer_Science_Graduate_Programs","abstract":"Research productivity assessment is increasingly relevant for allocation of research funds. On one hand, this assessment is challenging because it involves both qualitative and quantitative analysis of several characteristics, most of them subjective in nature. On the other hand, current tools and academic social networks make bibliometric data web-available to everyone for free. Those tools, especially when combined with other data, are able to create a rich environment from which information on research productivity can be extracted. In this context, our work aims at characterizing the Brazilian Computer Science graduate programs and the relationship among themselves. We (i) present views of the programs from different perspectives, (ii) rank the programs according to each perspective and a combination of them, (iii) show correlation between assessment metrics, (iv) discuss how programs relate to another, and (v) infer aspects that boost programs' research productivity. The results indicate that programs with a higher insertion in the coauthorship network topology also possess a higher research productivity between 2004 and 2009.","authors":["Luciano A. Digiampietri","Jesús P Mena-Chalco","Pedro O.S. Vaz de Melo","Ana P R Malheiro"],"meta":["April 2014PLoS ONE 9(4):e94541","DOI:10.1371/journal.pone.0094541","SourcePubMed","Project: Brazilian Academic Social Networks Analysis"],"references":["281018149_Assessing_the_research_and_education_quality_of_the_top_brazilian_computer_science_graduate_programs","234138970_A_Framework_for_Social_Network_of_Researchers_Analysis","228108125_Journal_Status","221653159_Can_complex_network_metrics_predict_the_behavior_of_NBA_teams","279384963_Principal_Component_Analysis_and_Factor_Analysis","272102209_Citation_Indexes_for_Science_A_New_Dimension_in_Documentation_through_Association_of_Ideas","242886456_THE_NEW_VOLUMES_OF_THE_ENCYCLOPAEDIA_BRITANNICA","229124516_Power_and_Centrality_A_Family_of_Measures","226248049_Google's_Pagerank_and_Beyond_The_Science_of_Search_Engine_Rankings","221580101_The_DBLP_Computer_Science_Bibliography_Evolution_Research_Issues_Perspectives"]}