{"id":"261603817_Optimal_Schedules_of_Light_Exposure_for_Rapidly_Correcting_Circadian_Misalignment","abstract":"Jet lag arises from a misalignment of circadian biological timing with the timing of human activity, and is caused by rapid transmeridian travel. Jet lag's symptoms, such as depressed cognitive alertness, also arise from work and social schedules misaligned with the timing of the circadian clock. Using experimentally validated mathematical models, we develop a new methodology to find mathematically optimal schedules of light exposure and avoidance for rapidly re-entraining the human circadian system. In simulations, our schedules are found to significantly outperform other recently proposed schedules. Moreover, our schedules appear to be significantly more robust to both noise in light and to inter-individual variations in endogenous circadian period than other proposed schedules. By comparing the optimal schedules for thousands of different situations, and by using general mathematical arguments, we are also able to translate our findings into general principles of optimal circadian re-entrainment. These principles include: 1) a class of schedules where circadian amplitude is only slightly perturbed, optimal for dim light and for small shifts 2) another class of schedules where shifting occurs along the shortest path in phase-space, optimal for bright light and for large shifts 3) the determination that short light pulses are less effective than sustained light if the goal is to re-entrain quickly, and 4) the determination that length of daytime should be significantly shorter when delaying the clock than when advancing it.","authors":["Kirill Serkh","Daniel B Forger"],"meta":["April 2014PLoS Computational Biology 10(4):e1003523","DOI:10.1371/journal.pcbi.1003523","SourcePubMed"],"references":["261051967_Optimal_circadian_rhythm_control_with_light_input_for_rapid_entrainment_and_improved_vigilance","236911635_Genetic_redundancy_strengthens_the_circadian_clock_leading_to_a_narrow_entrainment_range","316799009_Interdisciplinary_Applied_Mathematics","312940380_Phase_shifting_two_coupled_circadian_pacemakers_Implications_for_jet_lag","290618192_THE_GEOMETRY_OF_BIOLOGICAL_TIME","288108704_Nonstandard_work_schedules_over_the_life_course_A_first_look","272824312_Jet_lag","248390310_Dynamical_Systems_in_Neuroscience","245431953_Efficient_algorithm_for_time-optimal_control_of_a_two-link_manipulator","236739415_Critical_phase_shifts_slow_down_circadian_clock_recovery_Implications_for_jet_lag"]}