{"id":"261757978_True_Digital_Control_Statistical_Modelling_and_Non-Minimal_State_Space_Design","abstract":"True Digital Control: Statistical Modelling and Non–Minimal State Space Design develops a true digital control design philosophy that encompasses data–based model identification, through to control algorithm design, robustness evaluation and implementation. With a heritage from both classical and modern control system synthesis, this book is supported by detailed practical examples based on the authors’ research into environmental, mechatronic and robotic systems. Treatment of both statistical modelling and control design under one cover is unusual and highlights the important connections between these disciplines.\n\nStarting from the ubiquitous proportional–integral controller, and with essential concepts such as pole assignment introduced using straightforward algebra and block diagrams, this book addresses the needs of those students, researchers and engineers, who would like to advance their knowledge of control theory and practice into the state space domain; and academics who are interested to learn more about non–minimal state variable feedback control systems. Such non–minimal state feedback is utilised as a unifying framework for generalised digital control system design. This approach provides a gentle learning curve, from which potentially difficult topics, such as optimal, stochastic and multivariable control, can be introduced and assimilated in an interesting and straightforward manner.\n\nSee: http://eu.wiley.com/WileyCDA/WileyTitle/productCd-1118521218.html","authors":["C. James Taylor","Peter C. Young","Arun Chotai"],"meta":["June 2013","DOI:10.1002/9781118535523","Publisher: Wiley: ChichesterISBN: 9781118521212","Project: True Digital Control book"],"references":["294859484_Control_of_a_dual-arm_robotic_manipulator","265315582_On_the_relationship_between_GPC_and_PIP_control","261730577_State_space_control_system_design_based_on_non-minimal_state-variable_feedback_Further_generalization_and_unification_results","317985282_A_Second_Generation_Adaptive_Autostabilization_System_for_Airborne_Vehicles","307557267_Modern_Control_Systems_9th_Edition","276437450_A_Feedback_Amplifier_Tutor","271704254_Modelling_and_coarse_sampling_control_of_a_nutrient_film_system","268683386_The_theory_of_optimal_control_and_the_calculus_of_variations","268672329_Towards_robust_adaptive_predictive_control","262639714_True_digital_control_of_carbon_dioxide_in_agricultural_crop_growth_experiments"]}