{"id":"261725710_A_New_Space_for_Comparing_Graphs","abstract":"Finding a new mathematical representations for graph, which allows direct\ncomparison between different graph structures, is an open-ended research\ndirection. Having such a representation is the first prerequisite for a variety\nof machine learning algorithms like classification, clustering, etc., over\ngraph datasets. In this paper, we propose a symmetric positive semidefinite\nmatrix with the $(i,j)$-{th} entry equal to the covariance between normalized\nvectors $A^ie$ and $A^je$ ($e$ being vector of all ones) as a representation\nfor graph with adjacency matrix $A$. We show that the proposed matrix\nrepresentation encodes the spectrum of the underlying adjacency matrix and it\nalso contains information about the counts of small sub-structures present in\nthe graph such as triangles and small paths. In addition, we show that this\nmatrix is a \\emph{\"graph invariant\"}. All these properties make the proposed\nmatrix a suitable object for representing graphs.\nThe representation, being a covariance matrix in a fixed dimensional metric\nspace, gives a mathematical embedding for graphs. This naturally leads to a\nmeasure of similarity on graph objects. We define similarity between two given\ngraphs as a Bhattacharya similarity measure between their corresponding\ncovariance matrix representations. As shown in our experimental study on the\ntask of social network classification, such a similarity measure outperforms\nother widely used state-of-the-art methodologies. Our proposed method is also\ncomputationally efficient. The computation of both the matrix representation\nand the similarity value can be performed in operations linear in the number of\nedges. This makes our method scalable in practice.\nWe believe our theoretical and empirical results provide evidence for\nstudying truncated power iterations, of the adjacency matrix, to characterize\nsocial networks.","authors":["Anshumali Shrivastava","Ping Li"],"meta":["April 2014","DOI:10.1109/ASONAM.2014.6921561","SourcearXiv"],"references":["261761613_Graph_Kernels_via_Functional_Embedding","308107678_Distributed_random_walks","307881957_LIBSVM_A_library_for_support_vector_machines","304417886_Subgraph_frequencies_mapping_the_empirical_and_extremal_geography_of_large_graph_collections","283598027_Learning_to_discover_social_circles_in_ego_networks","243772974_Authoritative_Sources_in_a_Hyperlinked_Environment","242409962_On_the_Distribution_of_the_Roots_of_Certain_Symmetric_Matrices","237912898_Authoritative_sources_in_a_hyperlinked_environment","236118761_Subgraph_Frequencies_Mapping_the_Empirical_and_Extremal_Geography_of_Large_Graph_Collections","228830154_Distributed_Random_Walks"]}