{"id":"261846036_Selection_of_appropriate_software_development_life_cycle_using_fuzzy_logic","abstract":"Selection of appropriate Software Development Life Cycles can increase projects success. Depending on the selected SDLC Software Development Life Cycle, one can decrease development time/cost, minimize overhead and risk exposure, manage uncertainty, improve quality, promote client relations, and provide better project tracking and control. Despite the benefits of using suitable SDLCs, it is generally difficult to select the most appropriate one. There is not enough information in the literature about the criteria and how to take them into account to select appropriate SDLCs. Frequently used SDLCs and their comparative properties were elicited from literature, Internet and experts according to the criteria to select appropriate SDLCs. A Fuzzy Logic FL system was developed according to the elicited knowledge about the criteria and their affect on selecting suitable SDLCs in various cases. Fuzzy input/output variables, membership functions and fuzzy rules were defined and generated according to the elicited knowledge. The FL system was tested for various inputs and improved according to the test results.","authors":["Veysi Ozturk"],"meta":["May 2013Journal of Intelligent and Fuzzy Systems 25(3):797-810","DOI:10.3233/IFS-120686"],"references":["318528480_Educational_Software_Development_Life_Cycle","258968273_Capability_Maturity_Model_for_Software_Version_11","291313737_Requirements_in_agile_software_development","267401665_Software_Development_Methodologies_in_Industry","253935668_Selecting_a_Software_Development_Methodology_based_on_Organizational_Characteristics","251947140_A_Comparison_between_Agile_and_Traditional_Software_Development_Methodologies","248700517_Guide_to_the_Software_Engineering_Body_of_Knowledge_2004_Version_-_SWEBOK","245234843_Agile_Software_Development_Software_Through_People","242363489_Software_engineering_6th_edition","239069733_Artificial_intelligence_and_soft_computing_Behavioral_and_cognitive_modeling_of_the_human_brain_Amit_Konar"]}