{"id":"261834291_On_0-Complete_Partial_Metric_Spaces_and_Quantitative_Fixed_Point_Techniques_in_Denotational_Semantics","abstract":"In 1994, Matthews introduced the notion of partial metric space with the aim of providing a quantitative mathematical model suitable for program verification. Concretely, Matthews proved a partial metric version of the celebrated Banach fixed point theorem which has become an appropriate quantitative fixed point technique to capture the meaning of recursive denotational specifications in programming languages. In this paper we show that a few assumptions in statement of Matthews fixed point theorem can be relaxed in order to provide a quantitative fixed point technique useful to analyze the meaning of the aforementioned recursive denotational specifications in programming languages. In particular, we prove a new fixed point theorem for self-mappings between partial metric spaces in which the completeness has been replaced by 0-completeness and the contractive condition has been weakened in such a way that the new one best fits the requirements of practical problems in denotational semantics. Moreover, we provide examples that show that the hypothesis in the statement of our new result cannot be weakened. Finally, we show the potential applicability of the developed theory by means of analyzing a few concrete recursive denotational specifications, some of them admitting a unique meaning and others supporting multiple ones.","authors":["O. Valero","Naseer Shahzad"],"meta":["January 2013Abstract and Applied Analysis 2013(2):Article ID 985095, 11 pages","DOI:10.1155/2013/985095"],"references":["267142026_Matkowski's_type_theorems_for_generalized_contractions_on_ordered_partial_metric_spaces","261834283_On_Banach_fixed_point_theorems_for_partial_metric_spaces","257878417_On_fixed_point_theory_in_partial_metric_spaces","257878376_Fixed_point_theorems_in_generalized_metric_spaces_with_applications_to_computer_science","257878104_Fixed_point_theory_for_cyclic_generalized_contractions_in_partial_metric_spaces","267074410_Fixed_point_theory_in_partial_metric_spaces","267017939_Mathematical_Aspects_of_Logic_Programming_Semantics","267003350_Lattices_and_Ordered_Sets","257003674_Partial_Hausdor_metric_and_Nadler's_fixed_point_theorem_on_partial_metric_spaces","257003532_Fixed_point_theorems_for_generalized_contractions_on_partial_metric_spaces"]}