{"id":"261857918_Divide_and_Conquer_on_Hybrid_GPU-Accelerated_Multicore_Systems","abstract":"With the raw computing power of graphics processing units (GPUs) being more widely available in commodity multicore systems, there is an imminent need to harness their power for important numerical libraries such as LAPACK. In this paper, we consider the solution of dense symmetric and Hermitian eigenproblems by the LAPACK divide and conquer algorithm on such modern heterogeneous systems. We focus on how to make the best use of the individual strengths of the massively parallel manycore GPUs and multicore CPUs. The resulting algorithm overcomes performance bottlenecks faced by current implementations that are optimized for a homogeneous multicore. On a dual socket quad-core Intel Xeon 2.33 GHz with an NVIDIA GTX 280 GPU, we typically obtain up to about a tenfold improvement in performance for the complete dense problem. The techniques described here thus represent an example of how to develop numerical software to efficiently use heterogeneous architectures. As heterogeneity becomes more common in the architecture design, the significance of and need for this work are expected to grow.","authors":["Christof Vömel","Stanimire Tomov","Jack Dongarra"],"meta":["April 2012SIAM Journal on Scientific Computing 34(2):70-82","DOI:10.1137/100806783"],"references":["251449442_Accelerating_the_reduction_to_upper_Hessenberg_form_through_hybrid_GPU-based_computing","244437745_PAPI_A_Portable_Interface_to_Hardware_Performance_Counters","319528381_Density-functional_method_for_very_large_systems_with_LCAO_basis_sets","316542149_Block_reduction_of_matrices_to_condensed_forms_for_eigenvalue_computations","312840633_A_fully_parallel_algorithm_for_the_symmetric_eigenvalue_problem","276959721_A_Portable_Programming_Interface_for_Performance_Evaluation_on_Modern_Processors","269855989_The_Symmetric_Eigenvalue_Problem","248029351_The_Symmetric_Eigen_Value_Problem","243096237_On_the_Orthogonality_of_Eigenvectors_Computed_by_Divide-and-Conquer_Techniques","242644417_Some_Modified_Matrix_Eigenvalue_Problems"]}