{"id":"261835635_Sistematizacion_teorica_sobre_la_competencia_investigativa","abstract":"Es un artículo de revisión bibliográfica donde se evidencia que la formación de\ncompetencia en la educación superior ha tomado mayor auge en el siglo XXI, y una de las\ncompetencias en las cuales se ha trabajado es la investigativa. Este trabajo tiene como objetivo\nrealizar una sistematización teórica a partir de 1999-2013 acerca de las investigaciones existentes\npara la formación y desarrollo de la competencia investigativa en la educación superior, partiendo\nde su concepto, y las relaciones entre cada uno de sus componentes y dimensiones. Para la\nrealización de la investigación se utilizaron como método investigativo el histórico-lógico y el\nanalítico-sintético y como técnica el análisis documental de 40 investigaciones presentadas por\nautores europeos, asiáticos y americanos (América del Norte y América del Sur). En el trabajo se\npresenta un análisis pedagógico de los resultados obtenidos en la investigación, se identifican\nfortalezas y debilidades, y además se proponen una serie de consideraciones pedagógicas a\ntener en cuenta para la formación y desarrollo de dicha competencia. El principal resultado que\nse obtuvo es que no se ha logrado integrar completamente un componente profesional y otro\ntecnológico a la estructura de la competencia investigativa.","authors":["Odiel Estrada Molina"],"meta":["May 2014Revista Electrónica Educare 18(2):177-194","DOI:10.15359/ree.18-2.9","Project: Training tutors of the software development centers of the University of Informatics Science in consolidating the ability to model in software engineering"],"references":["329440312_La_formacion_basada_en_competencias_en_la_educacion_superior_el_enfoque_complejo","279540142_The_Interaction_of_Motivational_Orientation_and_Knowledge-Seeking_Inquiry_in_Computer-Supported_Collaborative_Learning","259502813_Competencias_Investigativas_Su_desarrollo_en_carreras_del_Area_de_la_Salud","321084853_MODELO_PEDAGOGICO_PARA_EL_MEJORAMIENTO_DEL_DESEMPENO_PEDAGOGICO_PROFESIONAL_DE_LOS_PROFESORES_DE_AGRONOMIA_DE_LOS_INSTITUTOS_POLITECNICOS_AGROPECUARIOS","271237526_Scientific_Research_Competence_Two_Forms_of_Collegial_Judgment","269166874_Pensamiento_y_Lenguaje","230179484_A_Condition_That_Is_Not_Yet_Reactions_Reflections_and_Closing_Comments","220643477_What_makes_good_research_in_software_engineering","39152704_Los_siete_saberes_necesarios_para_la_educacion_del_futuro","28243756_La_interdisciplinariedad_y_la_transdisciplinariedad_en_las_ciencias_una_mirada_a_la_teoria_bibliologico-informativa","28228376_Visibilidad_y_formacion_en_investigacion_estrategias_para_el_desarrollo_de_competencias_investigativas"]}