{"id":"261843650_SPARSE_Quadratic_Time_Simultaneous_Alignment_and_Folding_of_RNAs_without_Sequence-Based_Heuristics","abstract":"RNA-Seq experiments have revealed a multitude of novel ncRNAs. The gold standard for their analysis based on simultaneous alignment and folding (Sankoff, 1985) suffers from extreme time complexity of O(n(6)). Subsequently, numerous faster \"Sankoff-style\" approaches have been suggested. Commonly, the performance of such methods relies on sequence-based heuristics that restrict the search space to optimal or near-optimal sequence alignments; however, the accuracy of sequence-based methods breaks down for RNAs with sequence identities below 60% (Gardner et al., 2005). Alignment approaches like LocARNA (Will et al., 2007) that do not require sequence-based heuristics, have been limited to high complexity (≥ quartic time.) RESULTS: Breaking this barrier, we introduce the novel Sankoff-style algorithm \"SPARSE\", which runs in quadratic time without sequence-based heuristics. To achieve this low complexity, on par with sequence alignment algorithms, SPARSE features strong sparsification based on structural properties of the RNA ensembles. Following PMcomp (Hofacker et al., 2004), SPARSE gains further speed-up from lightweight energy computation. While all existing lightweight Sankoff-style methods restrict Sankoff's original model by disallowing loop deletions and insertions, SPARSE transfers the Sankoff algorithm to the lightweight energy model completely for the first time. Compared to LocARNA, SPARSE achieves similar alignment and better folding quality in significantly less time (speedup: 3.7). At similar run-time, it aligns low sequence identity instances substantially more accurate than RAF (Do et al., 2008), which uses sequence-based heuristics.\nSPARSE is freely available at http://www.bioinf.uni-freiburg.de/Software/SPARSE.\nbackofen@informatik.uni-freiburg.de SUPPLEMENTARY INFORMATION: Supplementary information is available at Bioinformatics online.\n© The Author(s) 2015. Published by Oxford University Press.","authors":["Sebastian Will","Christina Schmiedl","Milad Miladi","Mathias Möhl"],"meta":["April 2013Bioinformatics 31(15):289-290","DOI:10.1007/978-3-642-37195-0_28","Conference: Proceedings of the 17th international conference on Research in Computational Molecular Biology"],"references":["270343183_ExpaRNA-P_Simultaneous_exact_pattern_matching_and_folding_of_RNAs","254337852_Inferring_Non-Coding_RNA_Families_and_Classes_by_Means_of_Genome-Scale_Structure-Based_Clustering","225293445_CARNA-alignment_of_RNA_structure_ensembles","221980078_LocARNA-P_Accurate_boundary_prediction_and_improved_detection_of_structural_RNAs","291161877_Graphical_Methods_for_Data_Analysis","273232313_LOWESS_A_Program_for_Smoothing_Scatterplots_by_Robust_Locally_Weighted_Regression","238831754_Simultaneous_Solution_of_the_RNA_Folding_Alignment_and_Protosequence_Problems","229672702_RNA_Secondary_Structure_Prediction","221675867_Comparison_of_the_Predicted_and_Observed_Secondary_Structure_of_T4_Phage_Lysozime","220263396_Multiple_structural_alignment_and_clustering_of_RNA_sequences"]}