{"id":"261966743_Managing_the_Inclusion_Process_in_Collaborative_Governance","abstract":"Facilitators that use a collaborative governance approach are regularly pushed, mandated, or naturally desire to achieve broad inclusion of stakeholders in collaborations. How to achieve such inclusion is an important but often overlooked aspect of implementation. To fully realize the value of collaborative governance, we investigate how institutional design choices made about inclusion practices during the critical early stages of collaboration affect stakeholders' expectations of each other's contribution to a civic program and subsequently influences collaboration process outcomes. Informed by field observations from uniquely successful community health programs, we identify two institutional design choices related to inclusion that are associated with favorable group outcomes. The first design process uses time instrumentally to build trust and commitment in the collaboration, whereas the second design process includes new participants thoughtfully to limit their risk exposure. Based on experimental economics, strategic behaviors of stakeholders are formalized as a minimum effort coordination game in a multiagent model. A series of simulated experiments are conducted to gain fine-grained understanding of how the two design processes uniquely engender and reinforce commitment among stakeholders, minimize uncertainty, and increase the likelihood of positive process outcomes. For practitioners, the findings suggest how to navigate collaboration tensions during the early stages of their development while still respecting the competing need for stakeholder inclusiveness. The theoretical framework and the multiagent method of this study embrace the complexity of collaborative processes and trace how each intervention uniquely contributes to increases in trust and commitment.","authors":["Erik Johnston","Darrin Hicks","Ning Nan","Jennifer Claire Auer"],"meta":["October 2011Journal of Public Administration Research and Theory 21(4):699-721","DOI:10.2307/41342601"],"references":["299713138_Procedural_Justice_in_Law_II","277289140_Center_for_the_Computational_Analysis_of_Social_and_Organizational_Systems","329648617_Growing_Artificial_Societies_Social_Science_from_the_Bottom_Up","325000625_The_Importance_of_Collaborative_Know-How_An_Empirical_Test_of_the_Learning_Organization","323321351_Legitimation_crisis","322870920_Governing_the_Commons_The_Evolution_of_Institutions_for_Collective_Action","313080007_Collaborative_governance_in_theory_and_practice","293131370_Making_Collaboration_Work_Lessons_from_Innovation_in_Natural_Resource_Management","286519956_The_Stag_Hunt_and_the_Evolution_of_Social_Structure","274468075_Book_Review_of_Democracy_Dialogue_and_Environmental_Disputes_The_Contested_Languages_of_Social_Regulation_by_Bruce_A_Williams_and_Albert_R_Matheny","258374992_Policy_Research_Using_Agent-Based_Modeling_to_Assess_Future_Impacts_of_Urban_Expansion_into_Farmlands_and_Forests","250959455_Toward_a_Comprehensive_Theory_of_Collaboration","274205618_The_Importance_of_Collaborative_Know-How_An_Empirical_Test_of_the_Learning_Organization","257267956_Theories_of_Policy_Process","247720072_Capacity_and_Capability_Seven_Studies_of_Entrainment_of_Task_Performance_Rates"]}