{"id":"261956809_Hebbian_learning_and_predictive_mirror_neurons_for_actions_sensations_and_emotions","abstract":"Spike-timing-dependent plasticity is considered the neurophysiological basis of Hebbian learning and has been shown to be sensitive to both contingency and contiguity between pre- and postsynaptic activity. Here, we will examine how applying this Hebbian learning rule to a system of interconnected neurons in the presence of direct or indirect re-afference (e.g. seeing/hearing one's own actions) predicts the emergence of mirror neurons with predictive properties. In this framework, we analyse how mirror neurons become a dynamic system that performs active inferences about the actions of others and allows joint actions despite sensorimotor delays. We explore how this system performs a projection of the self onto others, with egocentric biases to contribute to mind-reading. Finally, we argue that Hebbian learning predicts mirror-like neurons for sensations and emotions and review evidence for the presence of such vicarious activations outside the motor system.","authors":["Christian Keysers","Valeria Gazzola"],"meta":["April 2014Philosophical Transactions of The Royal Society B Biological Sciences 369(1644):20130175","DOI:10.1098/rstb.2013.0175","SourcePubMed"],"references":["261954720_Mirror_neurons_From_origin_to_function","259701491_Functional_Magnetic_Resonance_Imaging_Connectivity_Analyses_Reveal_Efference-Copy_to_Primary_Somatosensory_Area_BA2","256614417_Vicarious_Neural_Processing_of_Outcomes_during_Observational_Learning","288865833_Imitation_of_Facial_and_Hand_Gestures_by_Human_Neonates","285797377_Action_recognition_in_the_premotor_cortex","283617632_Investigating_Causal_Relations_by_Econometric_Models_and_Cross-Spectral_Methods","261954735_Hebbian_Learning_is_about_contingency_not_contiguity_and_explains_the_emergence_of_predictive_mirror_neurons","256467797_Theory_of_Mind_A_Neural_Prediction_Problem","255974326_Trends_Mirror_neurons_through_the_lens_of_epigenetics","252320670_The_Empathic_Brain"]}