{"id":"261989628_A_model_of_how_working_memory_capacity_influences_insight_problem_solving_in_situations_with_multiple_visual_representations_An_eye_tracking_analysis","abstract":"Insight problem solving, which involves the restructuring of problems and insights, should be closely related to attention and working memory (WM). This study aimed to employ eye-tracking techniques to understand the process by which attention and WM capacity may influence insight problem solving when situations with multiple visual representations are employed. Fourteen graduate students participated in a 70-minute experimental session in this study. The adapted Situation-based Creativity Task (SCT) and the adapted Situation-based WM Task (SWMT) were employed to measure WM capacity and insight problem solving. Using situation-based visual WM tasks and insight problem solving the findings of this study suggest the following. First, fixation, gaze duration, and saccades to targets are effective eye movement indicators that can aid in the understanding of the cognitive processes of WM and insight problem solving. Second, attention, eye movements, and WM capacity interactively influence insight problem solving, and that influence varies with WM capacity and the insight stage. Accordingly, we propose three stages of insight processes based on eye movements.","authors":["Yu-chu Yeh","Jie-Li Tsai","Wei Chin Hsu","Chun Fu Lin"],"meta":["September 2014Thinking Skills and Creativity 13","DOI:10.1016/j.tsc.2014.04.003"],"references":["286207176_An_eye-movement_analysis_of_web-page_usability","254913339_Eye_Tracking_A_Comprehensive_Guide_To_Methods_And_Measures","251233156_Components_of_Working_Memory_and_Visual_Selective_Attention","283472146_Recognizing_Defining_and_Representing_Problems","281245883_Influence_of_problem_representation_and_working_memory_span_on_pupils'_mathematical_problem_solving","258128209_Working_Memory_Capacity_Attentional_Focus_and_Problem_Solving","257171657_Data_mining_for_providing_a_personalized_learning_path_in_creativity_An_application_of_decision_trees","254301065_Creativity_and_cognition_some_implications_for_arts_education","247497370_Working_memory_demands_in_insight_versus_analytic_problem_solving","245322285_An_embedded_process_model_of_working_memory"]}