{"id":"262009924_Sensitivity_of_Mangrove_Ecosystem_to_Changing_Climate_Sensitivity_of_Mangrove_Ecosystem_to_Changing_Climate_Sensitivity_of_Mangrove_Ecosystem_to_Changing_Climate","abstract":"Mangroves are basically salt tolerant forest ecosystems found mainly in tropical and sub-tropical inter-tidal regions. Till about 1960s, mangroves were largely viewed as \"economically unproductive areas\" and were therefore destroyed for reclaiming land for various economic and commercial activities. Gradually, with the passage of time, the economic and ecological benefi ts of mangroves have become visible and their impor-tance is now well appreciated. Today, mangroves are observed in about 30 countries in tropical subtropical regions covering an area of about 99,300 Sq.Km. However, during the past 50 years, over 50% of the mangrove cover has been lost, mainly because of the increased pressure of human activities like shrimp farming and agriculture, forestry, salt extraction, urban development, tourist development and infrastructure. Also, dam on rivers, contamination of sea waters caused by heavy metals, oil spills, pesticides and other products etc. have been found to be responsible for the decline of mangroves. Although the temperature eff ect on growth and species diversity is not known, sea-level rise may pose a serious threat to these ecosystems. Th e present book addresses all these important issues in separate chapters with some interesting case studies whose data may serve as pathfi nder for future researches in the sphere of the infl uence of climate change on mangrove ecosystem. Th e role of mangroves in the sector of bioremediation is a unique feather in the crown of this coastal and brackishwater vegetation that may be taken up by the coastal industries in order to maintain the health of ambient environ-ment. Th is book seeks to discover and to assess the vulnerability of climate change on mangrove fl ora and fauna, their role in carbon sequestration and some interesting case studies by some groups of dedicated researchers that may serve as the basis of future climate related policies.","authors":["Abhijit Mitra"],"meta":["May 2014","Publisher: SPRINGER"],"references":["276058184_CLIMATE_PROXY","275044935_Carbon_sequestration_by_halophytes","273450928_Annals_of_Marine_Biology_and_Research_Health_of_Estuaries_in_the_East_Coast_of_the_Indian_Sub-Continent","273140797_Conservative_pollutants_in_Ganges_shark_A_case_study_from_the_lower_Gangetic_delta_region_of_Indian_sub-continent","272493799_Floral_Biodiversity_of_Kalinganagar_Project_site_Tata_Steel_Odisha_India","271897337_JOIN_THE_PLATFORM_-_SAVE_THE_PLANET-WE_ALL_BELONG_TO_A_SINGE_FAMILY_UNDER_ONE_SKY_ONE_SUN_AND_ONE_MOON","271838077_CBP_We_give_value_to_your_ideas_knowledge_and_faith","272742339_Oceanography_A_Journey_in_Search_of_Root","272684618_Mangrove_Health_Card_A_Case_Study_on_Indian_Sundarbans","272202221_On_Blue_Carbon","270902586_vermicomposting_under_progress","270795773_Seaweed_carbon","271776186_INTERNATIONAL_JOURNAL_OF_INSTITUTIONAL_PHARMACY_AND_LIFE_SCIENCES_CONCENTRATIONS_OF_ZINC_COPPER_LEAD_AND_CADMIUM_IN_EDIBLE_FIN_FISHES_OF_COASTAL_WEST_BENGAL_INDIA","269931925_International_Conference_to_be_held_on_March_2015_GET_READY_FOR_THE_RESEARCHER_OF_THE_YEAR_AWARD","269577206_On_mangrove_biomass_and_carbon"]}