{"id":"262020726_Power_Calculations_for_General_Linear_Multivariate_Models_Including_Repeated_Measures_Applications","abstract":"Recently developed methods for power analysis expand the options available for study design. We demonstrate how easily the methods can be applied by (1) reviewing their formulation and (2) describing their application in the preparation of a particular grant proposal. The focus is a complex but ubiquitous setting: repeated measures in a longitudinal study. Describing the development of the research proposal allows demonstrating the steps needed to conduct an effective power analysis. Discussion of the example also highlights issues that typically must be considered in designing a study. First, we discuss the motivation for using detailed power calculations, focusing on multivariate methods in particular. Second, we survey available methods for the general linear multivariate model (GLMM) with Gaussian errors and recommend those based on F approximations. The treatment includes coverage of the multivariate and univariate approaches to repeated measures, MANOVA, ANOVA, multivariate regression, and univariate regression. Third, we describe the design of the power analysis for the example, a longitudinal study of a child's intellectual performance as a function of mother's estimated verbal intelligence. Fourth, we present the results of the power calculations. Fifth, we evaluate the tradeoffs in using reduced designs and tests to simplify power calculations. Finally, we discuss the benefits and costs of power analysis in the practice of statistics. We make three recommendations: Align the design and hypothesis of the power analysis with the planned data analysis, as best as practical.Embed any power analysis in a defensible sensitivity analysis.Have the extent of the power analysis reflect the ethical, scientific, and monetary costs. We conclude that power analysis catalyzes the interaction of statisticians and subject matter specialists. Using the recent advances for power analysis in linear models can further invigorate the interaction.","authors":["Keith E Muller","Lisa M Lavange","Sharon Landesman Ramey","Craig T. Ramey"],"meta":["December 1992Journal of the American Statistical Association 87(420):1209-1226","DOI:10.1080/01621459.1992.10476281","SourcePubMed"],"references":["285024072_Power_analysis_for_linear_models_The_time_has_come","290857549_An_Efficient_Method_of_Estimating_Seemingly_Unrelated_Regression_Equations_and_Tests_for_Aggregation_Bias","284820999_Enhancing_the_outcomes_of_low_birth_weight_premature_infants_A_multisite_randomized_trial","281475756_Enhancing_the_outcomes_of_low-birth-weight_premature_infants_A_multisite_randomized_trial","271995048_Power_and_sample_size_via_MSPC-DOS_computers","254330663_How_Appropriate_Are_Popular_Sample_Size_Formulas","254286863_Bootstrap_Bartlett_Adjustment_in_Seemingly_Unrelated_Regression","254286850_Approximate_Power_for_repeat-Measures_ANOVA_Lacking_Sphericity","246089850_Errors_of_the_Third_Kind_in_Statistical_Consulting","243048213_Hypothesis_Testing_in_Multivariate_Linear_Models_with_Randomly_Missing_Data"]}