{"id":"262077044_Measuring_precision_of_modeled_behavior","abstract":"Conformance checking techniques compare observed behavior (i.e., event logs) with modeled behavior for a variety of reasons. For example, discrepancies between a normative process model and recorded behavior may point to fraud or inefficiencies. The resulting diagnostics can be used for auditing and compliance management. Conformance checking can also be used to judge a process model automatically discovered from an event log. Models discovered using different process discovery techniques need to be compared objectively. These examples illustrate just a few of the many use cases for aligning observed and modeled behavior. Thus far, most conformance checking techniques focused on replay fitness, i.e., the ability to reproduce the event log. However, it is easy to construct models that allow for lots of behavior (including the observed behavior) without being precise. In this paper, we propose a method to measure precision of process models, given their event logs by first aligning the logs to the models. This way, the measurement is not sensitive to non-fitting executions and more accurate values can be obtained for non-fitting logs. Furthermore, we introduce several variants of the technique to deal better with incomplete logs and reduce possible bias due to behavioral property of process models. The approach has been implemented in the ProM 6 framework and tested against both artificial and real-life cases. Experiments show that the approach is robust to noise and applicable to handle logs and models of real-life complexity.","authors":["Arya Adriansyah","Jorge Munoz-Gama","Josep Carmona","Boudewijn F. van Dongen"],"meta":["January 2014Information Systems and e-Business Management 13(1)","DOI:10.1007/s10257-014-0234-7"],"references":["306014995_Process_mining_with_the_heuristics_miner-algorithm","280172983_Quality_Dimensions_in_Process_Discovery_The_Importance_of_Fitness_Precision_Generalization_and_Simplicity","259289710_A_General_Framework_for_Precision_Checking","321519437_Fundamentals_of_Business_Process_Management","312596001_Memory-Efficient_Alignment_of_Observed_and_Modeled_Behavior","307957429_Alignment_based_precision_checking","285842809_Petri_Nets_Properties_Analysis_and_Applications","272353258_The_six_sigma_way_how_GE_Motora_and_other_top_companies_are_honing_their_performance","261643503_Total_Quality_Management-The_Critical_Success_Factors","261498694_A_comprehensive_benchmarking_framework_CoBeFra_for_conformance_analysis_between_procedural_process_models_and_event_logs_in_ProM"]}