{"id":"262020129_Time_series_forecasting_using_a_deep_belief_network_with_restricted_Boltzmann_machines","abstract":"Multi-layer perceptron (MLP) and other artificial neural networks (ANNs) have been widely applied to time series forecasting since 1980s. However, for some problems such as initialization and local optima existing in applications, the improvement of ANNs is, and still will be the most interesting study for not only time series forecasting but also other intelligent computing fields. In this study, we propose a method for time series prediction using Hinton and Salakhutdinov׳s deep belief nets (DBN) which are probabilistic generative neural network composed by multiple layers of restricted Boltzmann machine (RBM). We use a 3-layer deep network of RBMs to capture the feature of input space of time series data, and after pretraining of RBMs using their energy functions, gradient descent training, i.e., back-propagation learning algorithm is used for fine-tuning connection weights between “visible layers” and “hidden layers” of RBMs. To decide the sizes of neural networks and the learning rates, Kennedy and Eberhart׳s particle swarm optimization (PSO) is adopted during the training processes. Furthermore, “trend removal”, a preprocessing to the original data, is also approached in the forecasting experiment using CATS benchmark data. Additionally, approximating and short-term prediction of chaotic time series such as Lorenz chaos and logistic map were also applied by the proposed method.","authors":["Takashi Kuremoto","Shinsuke Kimura","Kunikazu Kobayashi","Masanao Obayashi"],"meta":["August 2014Neurocomputing 137:47–56","DOI:10.1016/j.neucom.2013.03.047"],"references":["272912659_Behaviour_Analysis_of_Multilayer_Perceptronswith_Multiple_Hidden_Neurons_and_Hidden_Layers","265633680_Forecasting_Time_Series_by_SOFNN_with_Reinforcement_Learning","242509302_Learning_and_relearning_in_Boltzmann_machines","228712118_Predicting_chaotic_time_series_by_reinforcement_learning","284868064_Time_Series_Analysis_Forecasting_and_Control","273453883_Particle_Swarm_Optimization","258051743_Time_series_analysis_Forecasting_and_control_Rev_ed","229091480_Learning_Representations_by_Back_Propagating_Errors","227446076_Note---Seasonal_Exponential_Smoothing_with_Damped_Trends","224839716_Time_Series_Analysis_Forecasting_and_Control"]}