{"id":"262030026_Majority_Vote_of_Diverse_Classifiers_for_Late_Fusion","abstract":"In the past few years, a lot of attention has been devoted to multimedia\nindexing by fusing multimodal informations. Two kinds of fusion schemes are\ngenerally considered: The early fusion and the late fusion. We focus on late\nclassifier fusion, where one combines the scores of each modality at the\ndecision level. To tackle this problem, we investigate a recent and elegant\nwell-founded quadratic program named MinCq coming from the machine learning\nPAC-Bayesian theory. MinCq looks for the weighted combination, over a set of\nreal-valued functions seen as voters, leading to the lowest misclassification\nrate, while maximizing the voters' diversity. We propose an extension of MinCq\ntailored to multimedia indexing. Our method is based on an order-preserving\npairwise loss adapted to ranking that allows us to improve Mean Averaged\nPrecision measure while taking into account the diversity of the voters that we\nwant to fuse. We provide evidence that this method is naturally adapted to late\nfusion procedures and confirm the good behavior of our approach on the\nchallenging PASCAL VOC'07 benchmark.","authors":["Emilie Morvant","Amaury Habrard","Stéphane Ayache"],"meta":["April 2014","DOI:10.1007/978-3-662-44415-3_16","SourcearXiv","Conference: Joint IAPR International Workshops on Statistical Techniques in Pattern Recognition (SPR) and Structural and Syntactic Pattern Recognition (SSPR)"],"references":["258725042_Ensemble_Methods","319770349_Pascal_Visual_Object_Classes_Challenge_Results","313745907_Experiments_with_a_new_boosting_algorithm_machine_learning","312466400_Early_versus_late_fusion_in_semantic_video_analysis","307881957_LIBSVM_A_library_for_support_vector_machines","298606994_Ensemble_methods_in_machine_learning","262216035_Multiview_Semi-Supervised_Ranking_for_Automatic_Image_Annotation","258560356_Preference_Learning","257436121_A_survey_of_multi-view_machine_learning","244498683_Experiment_With_a_New_Boosting_Algorithm"]}