{"id":"262008155_The_real-time_city_Big_data_and_smart_urbanism","abstract":"‘Smart cities’ is a term that has gained traction in academia, business and government to describe cities that, on the one hand, are increasingly composed of and monitored by pervasive and ubiquitous computing and, on the other, whose economy and governance is being driven by innovation, creativity and entrepreneurship, enacted by smart people. This paper focuses on the former and, drawing on a number of examples, details how cities are being instrumented with digital devices and infrastructure that produce ‘big data’. Such data, smart city advocates argue enables real-time analysis of city life, new modes of urban governance, and provides the raw material for envisioning and enacting more efficient, sustainable, competitive, productive, open and transparent cities. The final section of the paper provides a critical reflection on the implications of big data and smart urbanism, examining five emerging concerns: the politics of big urban data, technocratic governance and city development, corporatisation of city governance and technological lock-ins, buggy, brittle and hackable cities, and the panoptic city.","authors":["Rob Kitchin"],"meta":["February 2013GeoJournal 79(1):1-14","DOI:10.1007/s10708-013-9516-8"],"references":["268359932_Planning_Cyber-Cities_Integrating_Telecommunications_into_Urban_Planning","347494731_Intelligent_Cities_Innovation_Knowledge_Systems_and_Digital_Spaces","321602075_Digital_Cities_Technologies_Experiences_and_Future_Perspectives","312596137_Big_data_The_next_frontier_for_innovation_competition_and_productivity","304929258_3-D_Data_Management_Controlling_Data_Volume_Velocity_and_Variety","303990205_Against_the_Smart_City","303912977_Sentient_city_ubiquitous_computing_architecture_and_the_future_of_urban_space","303571113_This_is_what_modern_deregulation_looks_like_co-optation_and_contestation_in_the_shaping_of_the_UK's_Open_Government_Data_Initiative","281562527_To_Save_Everything_Click_Here_Technology_Solutionism_and_the_Urge_to_Fix_Problems_that_Don't_Exist","271509126_The_Rise_of_the_Creative_Class_-_Revisited"]}