{"id":"262170115_Daily_travel_behavior_Lessons_from_a_week-long_survey_for_the_extraction_of_human_mobility_motifs_related_information","abstract":"Multi-agent models for simulating the mobility behavior of the urban population are gaining momentum due to increasing computing power. Such models pose high demands in terms of input data in order to be reliably able to match real world behavior. To run the models a synthetic population mirroring typical mobility demand needs to be generated based on real world observations. Traditionally this is done using travel diary surveys, which are costly (and hence have relatively low sample size) and focus mainly on trip choice rather than on activities for an entire day. Thus in this setting the generation of synthetic populations either relies on resampling identical activity chains or on imposing independence of various trips occurring during the day. Both assumptions are not realistic.\nUsing Call Detail Records (CDRs) it has been found that individual daily movement uses only a small number of movement patterns. These patterns, termed motifs, appear stably in many different cities, as has been shown for both CDR data as well as travel diaries.\nIn this paper the relation between these motifs and other mobility related quantities like the distribution of travel distances and times as well as mode choice is investigated. Additionally transition probabilities both for motifs (relevant for multi-day simulations) and mode transitions are discussed.\nThe main finding is that while some of the characteristics seem to be unrelated to motifs, others such as mode choice exhibit strong correlations which could improve the provision of synthetic populations for multi-agent models.\nThus the results in this paper are seen as one step further towards the creation of realistic (with respect to mobility behavior) synthetic populations for multi-agent models in order to analyze the performance of multi-modal transportation systems or disease spreading in urban areas.","authors":["Christian M. Schneider","Christian Rudloff","Dietmar Bauer","Marta C. Gonzalez"],"meta":["August 2013","DOI:10.1145/2505821.2505829","Conference: Proceedings of the 2nd ACM SIGKDD International Workshop on Urban Computing"],"references":["236666207_Unravelling_daily_human_mobility_motifs","233965122_Understanding_Road_Usage_Patterns_in_Urban_Areas","230566158_A_Metric_of_Influential_Spreading_during_Contagion_Dynamics_through_the_Air_Transportation_Network","228325278_Inferring_land_use_from_mobile_phone_activity","227283414_Observing_the_rhythms_of_daily_life_A_six-week_travel_diary","23526726_Household_travel_surveys_Where_are_we_going","5328225_Understanding_Individual_Human_Mobility_Patterns","3480996_Deriving_origin-destination_data_from_a_mobile_phone_network","261511007_The_Future_Mobility_Survey_Experiences_in_developing_a_smartphone-based_travel_survey_in_Singapore","234704202_Cell-based_Finding_and_Classification_of_Prominent_Places_of_Mobile_Phone_Users","5159002_Micro-simulation_of_daily_activity-travel_patterns_for_travel_demand_forecasting"]}