{"id":"262159992_Traffic_Management_A_Holistic_Approach_to_Memory_Placement_on_NUMA_Systems","abstract":"NUMA systems are characterized by Non-Uniform Memory Access times, where accessing data in a remote node takes longer than a local access. NUMA hardware has been built since the late 80's, and the operating systems designed for it were optimized for access locality. They co-located memory pages with the threads that accessed them, so as to avoid the cost of remote accesses. Contrary to older systems, modern NUMA hardware has much smaller remote wire delays, and so remote access costs per se are not the main concern for performance, as we discovered in this work. Instead, congestion on memory controllers and interconnects, caused by memory traffic from data-intensive applications, hurts performance a lot more. Because of that, memory placement algorithms must be redesigned to target traffic congestion. This requires an arsenal of techniques that go beyond optimizing locality. In this paper we describe Carrefour, an algorithm that addresses this goal. We implemented Carrefour in Linux and obtained performance improvements of up to 3.6 relative to the default kernel, as well as significant improvements compared to NUMA-aware patchsets available for Linux. Carrefour never hurts performance by more than 4% when memory placement cannot be improved. We present the design of Carrefour, the challenges of implementing it on modern hardware, and draw insights about hardware support that would help optimize system software on future NUMA systems.","authors":["Mohammad Dashti","Alexandra Fedorova","Justin Funston","Fabien Gaud"],"meta":["April 2013ACM SIGPLAN Notices 48(4):381-394","DOI:10.1145/2499368.2451157","Conference: Proceedings of the eighteenth international conference on Architectural support for programming languages and operating systemsVolume: 48"],"references":["268223458_Data-Oriented_Transaction_Execution","262329928_MemProf_a_memory_profiler_for_NUMA_multicore_systems","225769358_The_CSU_Face_Identification_Evaluation_System","279843864_A_Software_Approach_to_Unifying_Multicore_Caches","269135988_Memory_management_in_NUMA_multicore_systems","264159793_A_Case_for_NUMA-Aware_Contention_Management_on_Multicore_Processors","241623777_Clearing_the_Clouds_A_Study_of_Emerging_Scale-out_Workloads_on_Modern_Hardware","241623334_Memory_Management_for_Many-Core_Processors_with_Software_Configurable_Locality_Policies","234826842_Simple_but_effective_techniques_for_NUMA_memory_management","228743091_Instruction-based_sampling_A_new_performance_analysis_technique_for_AMD_family_10h_processors"]}