{"id":"262174428_Using_app_inventor_in_a_K-12_summer_camp","abstract":"Educators are often seeking new ways to motivate or inspire students to learn. Our past efforts in K-12 outreach included robotics and media computation as the contexts for teaching Computer Science (CS). With the deep interest in mobile technologies among teenagers, our recent outreach has focused on using smartphones as a new context. This paper is an experience report describing our approach and observations from teaching a summer camp for high school students using App Inventor (AI). The paper describes two separate methods (one using a visual block language, and another using Java) that were taught to high school students as a way to create Android applications. We observed that initiating the instruction with the block language, and then showing the direct mapping to an equivalent Java version, assisted students in understanding app development in Java. Our evaluation of the camp includes observations of student work and artifact assessment of student projects. Although the assessment suggests the camp was successful in several areas, we present numerous lessons learned based on our own reflection on the camp content and instruction.","authors":["Amber Wagner","Jeff Gray","Jonathan Corley","David Wolber"],"meta":["March 2013","DOI:10.1145/2445196.2445377","Conference: Proceeding of the 44th ACM technical symposium on Computer science education"],"references":["234780733_Smart_smartphone_development_IOS_versus_Android","220807590_Best_practices_in_teaching_mobile_application_development","278914833_Local","262237336_App_inventor_for_android_Report_from_a_summer_camp","249780477_Textile_Education_at_Massachusetts_Institute_of_Technology","234816644_Teaching_mobile_computing_and_developing_software_to_support_computer_science_education","234815054_App_inventor_and_real-world_motivation","228732100_Human_computer_interaction_that_reaches_beyond_desktop_applications","221538314_Filling_the_gap_in_programming_instruction_A_text-enhanced_graphical_programming_environment_for_junior_high_students","221537799_Local_a_model_geared_towards_ubiquitous_learning"]}