{"id":"262156279_Teaching_novice_programming_using_goals_and_plans_in_a_visual_notation","abstract":"Introductory programming courses have been continuously reported as having a high rate of failure or withdrawal. This research aims to develop a new approach for teaching novice programming, which is both easy to introduce and effective in improving novice learning. Our approach combines three key ideas: using a visual programming language; using strategies, specifically using the concepts of \"goal\" and \"plan\"; and having a well-defined process. We present a way of representing goals and plans in a visual notation together with a plan library that we developed in a visual programming environment (VPE). A key feature of the approach is that a design, i. e. an unmerged \"plan network\", is executable and can be tested, giving feedback in the VPE. Furthermore, we describe a detailed process for using existing plans and building new plans in the VPE. This approach had been evaluated experimentally and the results indicated its potential to significantly improve teaching programming to novices.","authors":["Minjie Hu","Michael Winikoff","Stephen Cranefield"],"meta":["January 2012","Conference: Proceedings of the Fourteenth Australasian Computing Education Conference - Volume 123","Project: PhD research"],"references":["240953681_The_TeachScheme_Project_Computing_and_Programming_for_Every_Student","240793117_Determining_the_Effectiveness_of_the_3D_Alice_Programming_Environment_at_the_Computer_Science_I_Level","277374591_Lowering_the_barriers_to_programming","254003363_COMPUTING_EDUCATION_RESEARCHProgramming_syntax_and_cognitive_load","243766442_Errata_Use_of_Ranks_in_One-Criterion_Variance_Analysis","242380937_Supporting_Programming_and_Learning-to-Program_with_an_Integrated_CAD_and_Scaffolding_Workbench","242379769_A_GoalPlan_Analysis_of_Buggy_Pascal_Programs","241622272_Programming_syntax_and_cognitive_load_part_2","234826946_Teaching_and_assessing_programming_strategies_explicitly","234814198_Programming_pedagogy-A_psychological_overview"]}