{"id":"262162590_Higher-Order_Masking_Schemes_for_S-Boxes","abstract":"Masking is a common countermeasure against side-channel attacks. The principle is to randomly split every sensitive intermediate variable occurring in the computation into d+1 shares, where d is called the masking order and plays the role of a security parameter. The main issue while applying masking to protect a block cipher implementation is to design an efficient scheme for the s-box computations. Actually, masking schemes with arbitrary order only exist for Boolean circuits and for the AES s-box. Although any s-box can be represented as a Boolean circuit, applying such a strategy leads to inefficient implementation in software. The design of an efficient and generic higher-order masking scheme was hence until now an open problem. In this paper, we introduce the first masking schemes which can be applied in software to efficiently protect any s-box at any order. We first describe a general masking method and we introduce a new criterion for an s-box that relates to the best efficiency achievable with this method. Then we propose concrete schemes that aim to approach the criterion. Specifically, we give optimal methods for the set of power functions, and we give efficient heuristics for the general case. As an illustration we apply the new schemes to the DES and PRESENT s-boxes and we provide implementation results.","authors":["Claude Carlet","Louis Goubin","Emmanuel Prouff","Michaël Quisquater"],"meta":["March 2012","DOI:10.1007/978-3-642-34047-5_21","Conference: Proceedings of the 19th international conference on Fast Software Encryption"],"references":["264458001_Provably_Secure_Higher-Order_Masking_of_AES","264457991_Block_Ciphers_Implementations_Provably_Secure_Against_Second_Order_Side_Channel_Analysis","335493321_Safeguarding_cryptographic_keys","316857373_Computer_programming_as_an_art","298122842_Using_second-order_power_analysis_to_attack_DPA_resistant_software","262493823_The_Art_of_Computer_Programming","262155109_Satisfiability_and_The_Art_of_Computer_Programming","232626171_Safeguarding_cryptographic_keys_PDF","226464987_The_evaluation_of_polynomials","226226622_Lecture_Notes_in_Computer_Science"]}