{"id":"262175378_A_support_program_for_introductory_CS_Courses_that_improves_student_performance_and_retains_students_from_underrepresented_groups","abstract":"In line with institutions across the United States, the Computer Science Department at Swarthmore College has faced the challenge of maintaining a demographic composition of students that matches the student body as a whole. To combat this trend, our department has made a concerted effort to revamp our introductory course sequence to both attract and retain more women and minority students.\nThe focus of this paper is the changes instituted in our Introduction to Computer Science course (i.e., CS1) intended for both majors and non-majors. In addition to changing the content of the course, we introduced a new student mentoring program that is managed by a full-time coordinator and consists of undergraduate students who have recently completed the course.\nThis paper describes these efforts in detail, including the extension of these changes to our CS2 course and the associated costs required to maintain these efforts. We measure the impact of these changes by tracking student enrollment and performance over 13 academic years. We show that, unlike national trends, enrollment from underrepresented groups has increased dramatically over this time period. Additionally, we show that the student mentoring program has increased both performance and retention of students, particularly from underrepresented groups, at statistically significant levels.","authors":["Tia Newhall","Lisa Meeden","Andrew Danner","Ameet Soni"],"meta":["March 2014","DOI:10.1145/2538862.2538923","Conference: Proceedings of the 45th ACM technical symposium on Computer science education"],"references":["234798348_Using_peer-led_team_learning_to_increase_participation_and_success_of_under-represented_groups_in_introductory_computer_science","221537711_A_study_of_the_impact_of_student_background_and_preparedness_on_outcomes_in_CS_I","221537235_Contributing_to_success_in_an_introductory_computer_science_course_A_study_of_twelve_factors","311473376_Unlocking_the_clubhouse_women_in_computing","290571733_Using_peer-led_team_learning_to_increase_participation_and_success_of_under-represented_groups_in_introductory_computer_science","262168888_Create_two_three_many_courses_an_experiment_in_contextualized_introductory_computer_science","248590941_A_study_of_the_impact_of_student_background_and_preparedness_on_outcomes_in_CSI","234823723_Mathematical_preparation_as_a_basis_for_success_in_CS-II","221538832_Women_in_CS_An_evaluation_of_three_promising_practices","220423419_Women_in_Computing-Take_2"]}