{"id":"262156291_Brief_announcement_Deterministic_self-stabilizing_leader_election_with_Ologlog_n-bits","abstract":"This paper focuses on compact deterministic self-stabilizing solutions for the leader election problem. Self-stabilization is a versatile approach to withstand any kind of transient failures. Leader election is a fundamental building block in distributed computing, enabling to distinguish a unique node, in order to, e.g., execute particular actions. When the protocol is required to be silent (i.e., when communication content remains fixed from some point in time during any execution), there exists a lower bound of Ω(log n) bits of memory per node participating to the leader election (where n denotes the number of nodes in the system). This lower bound holds even in rings.\nWe present a new deterministic (non-silent) self-stabilizing protocol for n-node rings that uses only O(log log n) memory bits per node, and stabilizes in O(n log2 n) time. Our protocol has several attractive features that make it suitable for practical purposes. First, the communication model matches the one that is expected by existing compilers for real networks. Second, the size of the ring (or any upper bound for this size) needs not to be known by any node. Third, the node identifiers can be of various sizes. Finally, no synchrony assumption besides a weak fair scheduler is assumed. Therefore, our result shows that, perhaps surprisingly, trading silence for exponential improvement in term of memory space does not come at a high cost regarding stabilization time, neither it does regarding minimal assumptions about the framework for our algorithm.","authors":["Lélia Blin","Sebastien Tixeuil"],"meta":["July 2013","DOI:10.1145/2484239.2484289","Conference: Proceedings of the 2013 ACM symposium on Principles of distributed computing"],"references":["256650364_A_Space_Optimal_Deterministic_Self-Stabilizing_Leader_Election_Algorithm_for_Unidirectional_Rings","234794177_Self-stabilizing_Algorithms","225205843_Transient_Fault_Detectors","224928759_Communication_Efficiency_in_Self-Stabilizing_Silent_Protocols","224928742_A_Taxonomy_of_Daemons_in_Self-stabilization","289669361_Self-Stabilization_in_Spite_of_Distributed_Control","243772619_Memory-efficient_and_self-stabilizing_net-work_reset","239552157_Self_stabilizing_systems_in_spite_of_distributed_control","225707516_Memory_requirements_for_silent_stabilization","224928713_On_Bootstrapping_Topology_Knowledge_in_Anonymous_Networks"]}