{"id":"262219011_High-order_timing_attacks","abstract":"The timing attack (TA) is a side-channel analysis (SCA) variant that exploits information leakage through the computation duration. Previously, leakages in timing have been exploited by comparison analysis, most often thanks to \"correlation - collision\" or pre-characterization on a clone device. Time bias can also be used to break a secret crypto-system by linear correlations in a non-profiled setting. There is direct parallel between the Correlation Power Attack (CPA) and TA, the distinguisher being the same, but the exploited data being either vertical or horizontal. The countermeasures against such attacks consist in making the algorithm run in either random or constant time. In this paper, we show that the former is prone to high-order attacks that analyse the higher moments of the time computation during code execution. We present successful second-order timing attacks (2O-TA) based on a correlation and compare it to the second-order power attack. All experiments have been conducted on an 8-bit processor running an AES-128.","authors":["Jean-Luc Danger","Nicolas Debande","Sylvain Guilley","Youssef Souissi"],"meta":["January 2014","DOI:10.1145/2556315.2556316","Conference: Proceedings of the First Workshop on Cryptography and Security in Computing Systems"],"references":["261021057_On_reconfigurable_fabrics_and_generic_side-channel_countermeasures","235223805_Compact_Implementation_and_Performance_Evaluation_of_Block_Ciphers_in_ATtiny_Devices","228749114_An_advanced_timing_attack_scheme_on_RSA","225169127_Mutual_Information_Analysis_a_Comprehensive_Study","285671044_A_Statistical_Model_for_DPA_with_Novel_Algorithmic_Confusion_Analysis","260309559_Boosting_Profiled_Cache_Timing_Attacks_With_A_Priori_Analysis","242587987_Timing_attacks_on_implementations_of_Diffie-Hellman","228939782_Cache-timing_attacks_on_AES","226844226_A_Timing_Attack_on_RC5","225178341_A_Timing_Attack_against_RSA_with_the_Chinese_Remainder_Theorem"]}