{"id":"262206697_Theories_Solvers_and_Static_Analysis_by_Abstract_Interpretation","abstract":"The algebraic/model theoretic design of static analyzers uses abstract domains based on representations of properties and pre-calculated property transformers. It is very efficient. The logical/proof theoretic approach uses SMT solvers/theorem provers and computation of property transformers on-the-fly. It is very expressive. We propose to unify both approaches, so that they can be combined to reach the sweet spot best adapted to a specific application domain in the precision/cost spectrum. We first give a new formalization of the proof theoretic approach in the abstract interpretation framework, introducing a semantics based on multiple interpretations to deal with the soundness of such approaches. Then we describe how to combine them with any other abstract interpretation-based analysis using an iterated reduction to combine abstractions. The key observation is that the Nelson-Oppen procedure, which decides satisfiability in a combination of logical theories by exchanging equalities and disequalities, computes a reduced product (after the state is enhanced with some new “observations” corresponding to alien terms). By abandoning restrictions ensuring completeness (such as disjointness, convexity, stably-infiniteness, or shininess, etc.), we can even broaden the application scope of logical abstractions for static analysis (which is incomplete anyway).","authors":["Patrick Cousot","Radhia Cousot","Laurent Mauborgne"],"meta":["December 2012Journal of the ACM 59(6)","DOI:10.1145/2395116.2395120"],"references":["313579242_Comparing_the_Galois_connection_and_wideningnarrowing_approaches_to_abstract_interpretation","304925458_Constructive_versions_of_tarski's_fixed_point_theorems","268637110_A_constructive_characterization_of_the_lattices_of_all_retractions_preclosure_quasi-closure_and_closure_operators_on_a_complete_lattice","243785179_The_calculational_design_of_a_generic_abstract_interpreter","312628439_A_new_correctness_proof_of_the_Nelson-Oppen_combination_procedure","290957651_Safer_unsafe_code_forNET","284757804_L'operation_de_fermeture_et_ses_invariants_dans_les_systemes_partiellement_ordonnes","267176691_Introduction_to_set_theory","266523703_The_closure_operators_of_a_lattice","255663479_Methods_and_Logics_for_Proving_Programs"]}