{"id":"262270904_Set_Cover_Revisited_Hypergraph_Cover_with_Hard_Capacities","abstract":"In this paper, we consider generalizations of classical covering problems to handle hard capacities. In the hard capacitated set cover problem, additionally each set has a covering capacity which we are not allowed to exceed. In other words, after picking a set, we may cover at most a specified number of elements. Based on the classical results by Wolsey, an O(logn) approximation follows for this problem.\nChuzhoy and Naor [FOCS 2002], first studied the special case of unweighted vertex cover with hard capacities and developed an elegant 3 approximation for it based on rounding a natural LP relaxation. This was subsequently improved to a 2 approximation by Gandhi et al. [ICALP 2003]. These results are surprising in light of the fact that for weighted vertex cover with hard capacities, the problem is at least as hard as set cover to approximate. Hence this separates the unweighted problem from the weighted version.\nThe set cover hardness precludes the possibility of a constant factor approximation for the hard-capacitated vertex cover problem on weighted graphs. However, it was not known whether a better than logarithmic approximation is possible on unweighted multigraphs, i.e., graphs that may contain parallel edges. Neither the approach of Chuzhoy and Naor, nor the follow-up work of Gandhi et al. can handle the case of multigraphs. In fact, achieving a constant factor approximation for hard-capacitated vertex cover problem on unweighted multigraphs was posed as an open question in Chuzhoy and Naor’s work. In this paper, we resolve this question by providing the first constant factor approximation algorithm for the vertex cover problem with hard capacities on unweighted multigraphs. Previous works cannot handle hypergraphs which is analogous to consider set systems where elements belong to at most f sets. In this paper, we give an O(f) approximation algorithm for this problem. Further, we extend these works to consider partial covers.","authors":["Barna Saha","Samir Khuller"],"meta":["July 2012","DOI:10.1007/978-3-642-31594-7_64","Conference: Proceedings of the 39th international colloquium conference on Automata, Languages, and Programming - Volume Part I"],"references":["225808701_Approximation_of_Partial_Capacitated_Vertex_Cover","221499476_Tight_Approximation_Results_for_General_Covering_Integer_Programs","220779903_Energy_Efficient_Scheduling_via_Partial_Shutdown","220779085_Approximating_k-median_with_non-uniform_capacities","288951549_An_analysis_of_the_greedy_algorithm_for_the_submodular_set_covering_problem","262394007_Covering_Problems_with_Hard_Capacities","242538384_A_Local-Ratio_Theorem_for_Approximating_the_Weighted_Vertex_Cover_Problem","228057776_Approximation_Algorithms_for_Combinatorial_Problems","226771845_Approximation_Algorithms_for_Partial_Covering_Problems","225983337_Wolsey_LA_An_analysis_of_the_greedy_algorithm_for_submodular_set_covering_problem_Combinatorica_24_385-393","225575944_A_Primal-Dual_Approximation_Algorithm_for_Partial_Vertex_Cover_Making_Educated_Guesses","225324277_An_Improved_Approximation_Algorithm_For_Vertex_Cover_with_Hard_Capacities_Lambda","223827183_Approximating_covering_integer_programs_with_multiplicity_constraints","223729659_Approximation_algorithms_for_partial_covering_problems","222562921_Generalized_submodular_cover_problems_and_applications","222265105_On_the_ratio_of_optimal_integer_and_fractional_covers","221257762_Scheduling_to_Minimize_Power_Consumption_using_Submodular_Functions","220897686_An_Improved_Approximation_Algorithm_for_Vertex_Cover_with_Hard_Capacities","220616921_Approximation_Algorithms_for_the_Set_Covering_and_Vertex_Cover_Problems","220573617_Approximation_Algorithms_for_Combinatorial_Problems","220406854_Capacitated_vertex_covering","2472813_Universal_Facility_Location"]}