{"id":"262213884_Optimizing_the_One_big_switch_abstraction_in_software-defined_networks","abstract":"Software Defined Networks (SDNs) support diverse network policies by offering direct, network-wide control over how switches handle traffic. Unfortunately, many controller platforms force applications to grapple simultaneously with end-to-end connectivity constraints, routing policy, switch memory limits, and the hop-by-hop interactions between forwarding rules. We believe solutions to this complex problem should be factored in to three distinct parts: (1) high-level SDN applications should define their end-point connectivity policy on top of a \"one big switch\" abstraction; (2) a mid-level SDN infrastructure layer should decide on the hop-by-hop routing policy; and (3) a compiler should synthesize an effective set of forwarding rules that obey the user-defined policies and adhere to the resource constraints of the underlying hardware. In this paper, we define and implement our proposed architecture, present efficient rule-placement algorithms that distribute forwarding policies across general SDN networks while managing rule-space constraints, and show how to support dynamic, incremental update of policies. We evaluate the effectiveness of our algorithms analytically by providing complexity bounds on their running time and rule space, as well as empirically, using both synthetic benchmarks, and real-world firewall and routing policies.","authors":["Nanxi Kang","Zhenming Liu","Jennifer Rexford","David Walker"],"meta":["December 2013","DOI:10.1145/2535372.2535373","Conference: Proceedings of the ninth ACM conference on Emerging networking experiments and technologies"],"references":["266660199_Infinite_CacheFlow_in_software-defined_networks","261860283_PAST_scalable_ethernet_for_data_centers","321521130_Approximation_Algorithms","313406230_Compressing_rectilinear_pictures_and_minimizing_access_control_lists","284574072_Frenetic","279402289_NOX","273001794_Approximation_Algorithms","262152829_The_Beacon_OpenFlow_Controller","261084304_Palette_Distributing_Tables_in_Software-Defined_Networks","254464665_A_Smart_Pre-Classifier_to_Reduce_Power_Consumption_of_TCAMs_for_Multi-dimensional_Packet_Classification"]}