{"id":"262242604_What_influences_dwell_time_during_source_code_reading_Analysis_of_element_type_and_frequency_as_factors","abstract":"While knowledge about reading behavior in natural-language text is abundant, little is known about the visual attention distribution when reading source code of computer programs. Yet, this knowledge is important for teaching programming skills as well as designing IDEs and programming languages. We conducted a study in which 15 programmers with various expertise read short source codes and recorded their eye movements. In order to study attention distribution on code elements, we introduced the following procedure: First we (pre)-processed the eye movement data using log-transformation. Taking into account the word lengths, we then analyzed the time spent on different lexical elements. It shows that most attention is oriented towards understanding of identifiers, operators, keywords and literals, relatively little reading time is spent on separators. We further inspected the attention on keywords and provide a description of the gaze on these primary building blocks for any formal language. The analysis indicates that approaches from research on natural-language text reading can be applied to source code as well, however not without review.","authors":["Teresa Busjahn","Roman Bednarik","Carsten Schulte"],"meta":["March 2014","DOI:10.1145/2578153.2578211","Conference: Proceedings of the Symposium on Eye Tracking Research and Applications","Project: Gaze in Programming"],"references":["257560017_The_impact_of_identifier_style_on_effort_and_comprehension","254913339_Eye_Tracking_A_Comprehensive_Guide_To_Methods_And_Measures","228592285_The_roles_beacons_play_in_comprehension_for_novice_and_expert_programmers","224001215_The_Java_Language_Specification","288925436_Analyzing_individual_differences_in_program_comprehension","284148554_How_do_we_read_algorithms","262371788_The_use_of_code_reading_in_teaching_programming","258138248_Goals_and_Performance_in_Computer_Programming","254004382_Analysis_of_code_reading_to_gain_more_insight_in_program_comprehension","220106939_Expertise-dependent_visual_attention_strategies_develop_over_time_during_debugging_with_multiple_code_representations"]}