{"id":"262287199_RFID_security_in_the_context_of_internet_of_things","abstract":"Internet has emerged as a medium to connect entities across the world for emailing, conferencing, trading, gaming and so on. Internet of Things (IoT) is emerging as a global network for connecting any objects (physical or virtual) across the globe, ranging applications from home appliances to consumer electronics. In IoT, physical objects such as home appliances, vehicles, supply-chain items, containers, etc. should have unique identities for interacting among themselves. As a result, unique identification of trillion of objects is a foremost requirement in IoT. RFID (Radio Frequency IDentification) technology plays an important role in IoT for solving identification issues of objects around us in a cost effective manner. The usage of low cost RFID tags draws greater attention from researchers in recent past, as the cost of supply-chain items should not exceed much because of embedded tag cost. The communication between tag and reader takes place over insecure channel. Therefore, security concern has become an important issue in RFID systems. In recent years, several light-weight protocols and improvements have been proposed for RFID security. Some of them have succeeded with their security claim, but many protocols suffer from security weaknesses or design flaws. In this paper, we discuss a recently proposed protocol's strengths and weaknesses and then proposed an improved protocol, retaining efficiency of the protocol intact.","authors":["Renu Aggarwal","Manik Lal Das"],"meta":["August 2012","DOI:10.1145/2490428.2490435","Conference: Proceedings of the First International Conference on Security of Internet of Things"],"references":["229000642_A_simple_and_cost-effective_RFID_tag-reader_mutual_authentication_scheme","224315509_Security_analysis_of_the_SASI_protocol","221551475_RFID_authentication_protocol_for_low-cost_tags","220068454_On_the_Security_of_Chien's_Ultralightweight_RFID_Authentication_Protocol","45815133_Security_Analysis_of_Two_Ultra-Lightweight_RFID_Authentication_Protocols","288823608_The_Internet_of_things_From_RFID_to_the_next-generation_pervasive_networked_systems","228769448_Low-Cost_RFID_Authentication_Protocol_for_Anti-Counterfeiting_and_Privacy_Protection","224702404_Low-Cost_RFID_Authentication_Protocol_for_Anti-Counterfeiting_and_Privacy_Protection","224401884_Security_Analysis_of_the_Song-Mitchell_Authentication_Protocol_for_Low-cost_RFID_Tags","220793281_Security_Enhancement_of_the_Authentication_Protocol_for_RFID_Systems","220624187_Security_of_ultra-lightweight_RFID_authentication_protocols_and_its_improvements","46122407_Cryptanalysis_of_Two_RFID_Authentication_Protocols","3449455_SASI_A_New_Ultralightweight_RFID_Authentication_Protocol_Providing_Strong_Authentication_and_Strong_Integrity"]}