{"id":"262241583_Fundamentos_da_Gestao_do_Conhecimento_Organizacional","abstract":"Uma parte importante da argumentação teórica desenvolvida neste livro gira em torno da questão dos paradigmas organizacionais. Ao longo do mesmo, tentamos provar que a organização mecanicista, o paradigma dominante ao longo do último século, está a perder terreno para um novo tipo de paradigma que pode ser seguramente chamado o da organização aprendente (learning organization). Consideramos a organização aprendente como um conceito amplo, englobando muitos dos princípios organizacionais do arqui-paradigma da Complexidade, que são discutidos nos Capítulo 1, 2 e 3. Na organização aprendente, o factor imperativo para o crescimento das empresas, é a criação de conhecimento. Contudo, a criação de conhecimento não é apenas um requisito de crescimento. Conforme se demonstra no Capítulo 4, a criação de conhecimento é também um objectivo estratégico primário. A criação de conhecimento enquanto objectivo microeconómico está muito ligado à acção, não numa perspectiva puramente comportamental mas numa perspectiva estratégica e organizacional. O conceito de organização aprendente constitui uma das propostas mais atraentes apresentadas aos gestores e aos pensadores organizacionais, na última década. Neste livro tentamos explicar o que é e como se alcança a organização aprendente, através de um novo paradigma organizacional a que podemos chamar o paradigma do conhecimento. Este paradigma pode resumir-se da seguinte forma, em termos dos seus fundamentos:\n\n (1) Aprendizagem, transformação, emergência e auto-organização são estados permanentes e normais nas organizações, sendo que a noção de que as organizações tendem para a estabilidade e para o equilíbrio, é falaciosa.\n (2) Transformação permanente significa que as organizações são constituídas por uma grande variedade de interesses políticos, negociações e conflitos, com os actores em presença posicionando-se continuamente para obterem mais e melhor influência. \n (3) A perspectiva das organizações como redes informais de poder ajuda a dissipar o mito da teoria clássica, que diz que a hierarquia formal é capaz de conseguir o controlo da organização. \n (4) Se o controlo não é possível através da micro-gestão diária da organização, gerir e mudar contextos torna-se a competência principal a aprender e a aperfeiçoar, pelos gestores.\n (5) A aprendizagem organizacional é feita pelos membros da organização, através da construção os seus próprios sistemas de significado, quer no que diz respeito à sua envolvente interna, quer no que respeita à sua envolvente externa. \n (6) A construção da envolvente externa da organização, realizada de uma forma auto-referencial, pelos seus membros, tem consequências muito relevantes para a aprendizagem dos factores externos e da envolvente competitiva.\n (7) A mudança e a transformação organizacional são sempre fontes de agitação nas políticas internas da organização; neste contexto, a legitimidade do líder torna-se um factor estabilizador. \n (8) A legitimidade é construída através da acção dos gestores e exerce a sua influência no comportamento dos membros da organização, através de meios simbólicos, percebidos pelos observadores externos como a cultura da organização.","authors":["Rodrigo Magalhães"],"meta":["January 2005","Publisher: Silabo, Lisboa"],"references":[]}