{"id":"262240269_Performance_Analysis_of_Software-Defined_Networking_SDN","abstract":"Software-Defined Networking (SDN) approaches were introduced as early as the mid-1990s, but just recently became a well-established industry standard. Many network architectures and systems adopted SDN, and vendors are choosing SDN as an alternative to the fixed, predefined, and inflexible protocol stack. SDN offers flexible, dynamic, and programmable functionality of network systems, as well as many other advantages such as centralized control, reduced complexity, better user experience, and a dramatic decrease in network systems and equipment costs. However, SDN characterization and capabilities, as well as workload of the network traffic that the SDN-based systems handle, determine the level of these advantages. Moreover, the enabled flexibility of SDN-based systems comes with a performance penalty. The design and capabilities of the underlying SDN infrastructure influence the performance of common network tasks, compared to a dedicated solution. In this paper we analyze two issues: a) the impact of SDN on raw performance (in terms of throughput and latency) under various workloads, and b) whether there is an inherent performance penalty for a complex, more functional, SDN infrastructure. Our results indicate that SDN does have a performance penalty, however, it is not necessarily related to the complexity level of the underlying SDN infrastructure.","authors":["Alexander Gelberger","Niv Yemini","Ran Giladi"],"meta":["August 2013","DOI:10.1109/MASCOTS.2013.58","Conference: Proceedings of the 2013 IEEE 21st International Symposium on Modelling, Analysis & Simulation of Computer and Telecommunication Systems"],"references":["272788552_Forwarding_and_Control_Element_Separation_ForCES_Framework","255569159_OFLOPS_An_open_framework_for_OpenFlow_switch_evaluation","221167813_OpenFlow_Switching_Data_Plane_Performance","221164572_A_Programmable_Generic_Forwarding_Element_Approach_for_Dynamic_Network_Functionality","220195143_OpenFlow_Enabling_innovation_in_campus_networks","262423689_On_Controller_Performance_in_Software-defined_Networks","243767736_Forwarding_and_Control_Element_Separation_ForCES_Framework","224243823_Software-Defined_Networking_Could_Shake_Up_More_than_Packets","220018686_Modeling_and_Performance_Evaluation_of_an_OpenFlow_Architecture","3948275_Towards_an_active_network_architecture"]}