{"id":"262201963_RUBRIC_a_flexible_tool_for_automated_checking_of_conformance_to_requirement_boilerplates","abstract":"Using requirement boilerplates is an effective way to mit- igate many types of ambiguity in Natural Language (NL) requirements and to enable more automated transformation and analysis of these requirements. When requirements are expressed using boilerplates, one must check, as a first qual- ity assurance measure, whether the requirements actually conform to the boilerplates. If done manually, boilerplate conformance checking can be laborious, particularly when requirements change frequently. We present RUBRIC (Re- qUirements BoileRplate sanIty Checker), a flexible tool for automatically checking NL requirements against boilerplates for conformance. RUBRIC further provides a range of di- agnostics to highlight potentially problematic syntactic con- structs in NL requirement statements. RUBRIC is based on a Natural Language Processing (NLP) technique, known as text chunking. A key advantage of RUBRIC is that it yields highly accurate results even in early stages of requirements writing, where a requirements glossary may be unavailable or only partially specified. RUBRIC is scalable and can be applied repeatedly to large sets of requirements as they evolve. The tool has been validated through an industrial case study which we outline briefly in the paper.","authors":["Chetan Arora","Mehrdad Sabetzadeh","Lionel C. Briand","Frank Zimmer"],"meta":["August 2013","DOI:10.1145/2491411.2494591","Conference: Proceedings of the 2013 9th Joint Meeting on Foundations of Software Engineering"],"references":["228861133_From_Contract_Drafting_to_Software_Specification_Linguistic_Sources_of_Ambiguity","224240011_DODT_Increasing_requirements_formalism_using_domain_ontologies_for_improved_embedded_systems_development","2381816_Developing_Language_Processing_Components_with_GATE_a_User_Guide","261464430_Automatic_Checking_of_Conformance_to_Requirement_Boilerplates_via_Text_Chunking_An_Industrial_Case_Study","247161871_Requirements_Engineering_Tools_Capabilities_Survey_and_Assessment","220277638_Improving_automated_requirements_trace_retrieval_A_study_of_term-based_enhancement_methods"]}