{"id":"262284697_A_supervised_machine_learning_approach_to_classify_host_roles_on_line_using_sFlow","abstract":"Classifying host roles based on network traffic behavior is valuable for network security analysis and detecting security policy violation. Behavior-based network security analysis has advantages over traditional approaches such as code patterns or signatures. Modeling host roles based on network flow data is challenging because of the huge volume of network traffic and overlap among host roles. Many studies of network traffic classification have focused on classifying applications such as web, peer-to-peer, and DNS traffic. In general, machine learning approaches have been applied on classifying applications, security awareness, and anomaly detection. In this paper, we present a supervised machine learning approach that use On-Line Support Vector Machine and Decision Tree to classify host roles. We collect sFlow data from main gateways of a large campus network. We classify different roles, namely, clients versus servers, regular web non-email servers versus web email servers, clients at personal offices versus public places of laboratories and libraries, and personal office clients from two different colleges. We achieved very high classification accuracy, i.e., 99.2% accuracy in classifying clients versus servers, 100% accuracy in classifying regular web non-email servers versus web email servers, 93.3% accuracy in classifying clients at personnel offices versus public places, and 93.3% accuracy in classifying clients at personal offices from two different colleges.","authors":["Bingdong Li","Mehmet Gunes","George Bebis","Jeff Springer"],"meta":["June 2013","DOI:10.1145/2465839.2465847","Conference: Proceedings of the first edition workshop on High performance and programmable networking"],"references":["267551756_Nfsight_NetFlow-based_Network_Awareness_Tool","267229446_Classification_with_an_improved_Decision_Tree_Algorithm","242019463_Toward_Scalable_Internet_Traffic_Measurement_and_Analysis_with_Hadoop","221996079_An_Introduction_of_Variable_and_Feature_Selection","221244425_Network-aware_behavior_clustering_of_Internet_end_hosts","221164762_BLINC_Multilevel_Traffic_Classification_in_the_Dark","220850186_Profiling_the_End_Host","220320193_Fast_Kernel_Classifiers_with_Online_and_Active_Learning","220269644_Digging_into_HTTPS_flow-based_classification_of_webmail_traffic","220169867_Properties_and_Evolution_of_Internet_Traffic_Networks_from_Anonymized_Flow_Data","44164569_Unsupervised_host_behavior_classification_from_connection_patterns","277672213_BLINC","260707921_Synoptic_Graphlet_Bridging_the_Gap_Between_Supervised_and_Unsupervised_Profiling_of_Host-Level_Network_Traffic","257489192_A_survey_of_network_flow_applications","243787961_Discriminators_for_Use_in_Flow-Based_Classification","221164050_Unconstrained_endpoint_profiling_Googling_the_Internet","2956495_Behavior-Based_Network_Security_Goes_Mainstream","2481012_Role_Classification_of_Hosts_within_Enterprise_Networks_Based_on_Connection_Patterns"]}