{"id":"262264271_A_quantum_algorithm_for_additive_approximation_of_Ising_partition_functions","abstract":"We investigate quantum computational complexity of calculating partition\nfunctions of Ising models. We construct a quantum algorithm for an additive\napproximation of Ising partition functions on square lattices. To this end, we\nutilize the overlap mapping developed by Van den Nest, D\\\"ur, and Briegel\n[Phys. Rev. Lett. 98, 117207 (2007)] and its interpretation through\nmeasurement-based quantum computation (MBQC). We specify an algorithmic domain,\non which the proposed algorithm works, and an approximation scale, which\ndetermines the accuracy of the approximation. We show that the proposed\nalgorithm does a nontrivial task, which would be intractable on any classical\ncomputer, by showing the problem solvable by the proposed quantum algorithm are\nBQP-complete. In the construction of the BQP-complete problem coupling\nstrengths and magnetic fields take complex values. However, the Ising models\nthat are of central interest in statistical physics and computer science\nconsist of real coupling strengths and magnetic fields. Thus we extend the\nalgorithmic domain of the proposed algorithm to such a real physical parameter\nregion and calculate the approximation scale explicitly. We found that the\noverlap mapping and its MBQC interpretation improves the approximation scale\nexponentially compared to a straightforward constant depth quantum algorithm.\nOn the other hand, the proposed quantum algorithm also provides us a partial\nevidence that there exist no efficient classical algorithm for a multiplicative\napproximation of the Ising partition functions even on the square lattice. This\nresult supports that the proposed quantum algorithm does a nontrivial task also\nin the physical parameter region.","authors":["Akira Matsuo","Keisuke Fujii","Nobuyuki Imoto"],"meta":["May 2014Physical review A, Atomic, molecular, and optical physics 90(2)","DOI:10.1103/PhysRevA.90.022304","SourcearXiv"],"references":["258373513_Quantum_Commuting_Circuits_and_Complexity_of_Ising_Partition_Functions","231001263_On_the_computational_complexity_of_Ising_spin_glass_models","230569939_An_algorithmic_proof_for_the_completeness_of_two-dimensional_Ising_model","228109550_Multiparty_entanglement_in_graph_states","284882445_Proc_International_School_of_Physics_Enrico_Fermi","262991845_Exponentially_improved_classical_and_quantum_algorithms_for_three-body_Ising_models","257961266_On_the_Dimer_Solution_of_Planar_Ising_Models","253860610_Statistics_of_the_Two-Dimensional_Ferromagnet_Part_II","243458379_Quantum_Information_and_Statistical_Mechanics_An_Introduction_to_Frontier","230700601_Low_Depth_Quantum_Circuits_for_Ising_Models"]}