{"id":"262292720_Star-Join_Spatio-textual_similarity_join","abstract":"Location-based services have attracted significant attention due to modern mobile phones equipped with GPS devices. These services generate large amounts of spatio-textual data which contain both spatial location and textual descriptions. Since a spatio-textual object may have different representations, possibly because of deviations of GPS or different user descriptions, it calls for efficient methods to integrate spatio-textual data from different sources. In this paper we study a new research problem called spatio-textual similarity join: given two sets of spatio-textual objects, we find the similar object pairs. To the best of our knowledge, we are the first to study this problem. We make the following contributions: (1) We develop a filter-and-refine framework and devise several efficient algorithms. We first generate spatial and textual signatures for the objects and build inverted index on top of these signatures. Then we generate candidate pairs using the inverted lists of signatures. Finally we refine the candidates and generate the final result. (2) We study how to generate high-quality signatures for spatial information. We develop an MBR-prefix based signature to prune large numbers of dissimilar object pairs. (3) Experimental results on real and synthetic datasets show that our algorithms achieve high performance and scale well.","authors":["Sitong Liu","Guoliang Li","Jianhua Feng"],"meta":["October 2012","DOI:10.1145/2396761.2398600","Conference: Proceedings of the 21st ACM international conference on Information and knowledge management"],"references":["228533842_DESKS_Direction-aware_spatial_keyword_search","221309648_Efficient_Exact_Set-Similarity_Joins","221213205_R_Trees_A_Dynamic_Index_Structure_for_Spatial_Searching","220225504_Spatial_Join_Techniques","33030343_Efficient_Processing_of_Spatial_Joins_Using_R-Trees","4330914_Keyword_Search_on_Spatial_Databases","2458422_Spatial_Hash-Joins","279401876_R-trees","242412344_Efficient_Processing_of_Spatial_Joins","225075170_SEAL_Spati-textual_similarity_search","220538735_Ed-Join_An_Efficient_Algorithm_for_Similarity_Joins_With_Edit_Distance_Constraints","200110669_Scaling_up_all_pairs_similarity_search","51960359_PASS-JOIN_A_Partition-based_Method_for_Similarity_Joins","4234787_A_Primitive_Operator_for_Similarity_Joins_in_Data_Cleaning","2774619_Size_Separation_Spatial_Join","2463872_Partition_Based_Spatial--Merge_Join"]}