{"id":"262287322_Nondeterminism_in_the_Presence_of_a_Diverse_or_Unknown_Future","abstract":"Choices made by nondeterministic word automata depend on both the past (the prefix of the word read so far) and the future (the suffix yet to be read). In several applications, most notably synthesis, the future is diverse or unknown, leading to algorithms that are based on deterministic automata. Hoping to retain some of the advantages of nondeterministic automata, researchers have studied restricted classes of nondeterministic automata. Three such classes are nondeterministic automata that are good for trees (GFT; i.e., ones that can be expanded to tree automata accepting the derived tree languages, thus whose choices should satisfy diverse futures), good for games (GFG; i.e., ones whose choices depend only on the past), and determinizable by pruning (DBP; i.e., ones that embody equivalent deterministic automata). The theoretical properties and relative merits of the different classes are still open, having vagueness on whether they really differ from deterministic automata. In particular, while DBP ⊆ GFG ⊆ GFT, it is not known whether every GFT automaton is GFG and whether every GFG automaton is DBP. Also open is the possible succinctness of GFG and GFT automata compared to deterministic automata. We study these problems for ω-regular automata with all common acceptance conditions. We show that GFT=GFG⊃DBP, and describe a determinization construction for GFG automata.","authors":["Udi Boker","Denis Kuperberg","Orna Kupferman","Michał Skrzypczak"],"meta":["July 2013","DOI:10.1007/978-3-642-39212-2_11","Conference: Proceedings of the 40th international conference on Automata, Languages, and Programming - Volume Part II"],"references":["234827421_On_the_synthesis_of_a_reactive_module","230876408_Finite_Automata_and_Their_Decision_Problems","221591753_Trees_Automata_and_Games","254640205_Solving_Sequential_Conditions_by_Finite_State_Strategies","242505342_Automata_Logics_and_Infinite_Games_A_Guide_to_Current_Research_outcome_of_a_Dagstuhl_seminar_February_2001","239583398_Weakly_Definable_Relations_and_Special_Automata","238698002_Decision_Problems_for_omega-Automata","232654228_On_the_complexity_of_omega_-automata","226389077_Relating_hierarchies_of_word_and_tree_automata","222333696_Deciding_branching_time_logic"]}