{"id":"262238973_Algorithms_for_Context_Based_Sequential_Pattern_Mining","abstract":"This paper describes practical aspects of a novel approach to the sequential pattern mining named Context Based Sequential Pattern Mining (CBSPM). It introduces a novel ContextMapping algorithm used for the context pattern mining and an illustrative example showing some advantages of the proposed method. The approach presented here takes into consideration some shortcomings of the classic problem of the sequential pattern mining. The significant advantage of the classic sequential patterns mining is simplicity. It introduces simple element construction, built upon set of atomic items. The comparison of sequence's elements utilizes simple inclusion of sets. But many practical problems like web event mining, monitoring, tracking and rules generation often require mining more complex data. The CBSPM takes into account non nominal attributes and similarity of sequence's elements. An approach described here extends traditional problem adding a vector of context attributes of any kind to sequences and sequences elements. Context vectors contain details about sequence's and element's origin. The mining process results in context patterns containing additional, valuable context information useful in interpretation of patterns origin.","authors":["Radosław Ziembiński"],"meta":["December 2007Fundamenta Informaticae 76(4):495-510"],"references":["225266300_Zaki_MJ_SPADE_An_efficient_algorithm_for_mining_frequent_sequences_Machine_Learning_421_31-60","221654035_FreeSpan_Frequent_pattern-projected_sequential_pattern_mining","220791703_Efficient_Similarity_Search_In_Sequence_Databases","221900765_Fast_Algorithms_for_Mining_Association_Rules_in_Large_Databases","221614311_Multi_-_Dimensional_Sequential_Pattern_Mining","220966044_PrefixSpan_Mining_Sequential_Patterns_by_Prefix-Projected_Growth","220268819_Mining_Context_Based_Sequential_Patterns","2647482_Mining_Sequential_Patterns_Generalizations_And_Performance_Improvements","2592178_Mining_Sequential_Patterns","2569961_Efficiently_Mining_Frequent_Trees_in_a_Forest","2449203_SPIRIT_Sequential_Pattern_Mining_with_Regular_Expression_Constraints"]}