{"id":"262290855_DSCLU_A_New_Data_Stream_Clustring_Algorithm_for_Multi_Density_Environments","abstract":"Recently, data stream has become popular in many contexts of data mining. Due to the high amount of incoming data, traditional clustering algorithms are not suitable for this family of problems. Many data stream clustering algorithms proposed in recent years considered the scalability of data, but most of them did not attend the following issues: (1) The quality of clustering can be dramatically low over the time. (2) Some of the algorithms cannot handle arbitrary shapes of data stream and consequently the results are limited to specific regions. (3) Most of the algorithms have not been evaluated in multi-density environments. Identifying appropriate clusters for data stream by handling the arbitrary shapes of clusters is the aim of this paper. The gist of the overall approach in this paper can be stated in two phases. In online phase, data manipulate with specific data structure called micro cluster. This phase is activated by incoming of data. The offline phase is manually activated by coming a request from user. The algorithm handles clusters by considering with micro clusters created by the online phase. The experimental evaluation showed that proposed algorithm has suitable quality and also returns appropriate results even in multi-density environments.","authors":["Amin Namadchian","Gholamreza Esfandani"],"meta":["August 2012","DOI:10.1109/SNPD.2012.119","Conference: Proceedings of the 2012 13th ACIS International Conference on Software Engineering, Artificial Intelligence, Networking and Parallel/Distributed Computing"],"references":["221559503_Maintaining_variance_and_k-medians_over_data_stream_windows","324399223_A_Course_in_the_Geometry_of_n_Dimensions","324354436_A_Course_in_the_Geometry_of_n_Dimensions","280292208_LOF","268245046_A_Course_in_the_Geometry_of_n_Dimensions","243081918_A_Course_in_the_Geometry_of_n_Dimensions","221653977_A_Density-Based_Algorithm_for_Discovering_Clusters_in_Large_Spatial_Databases_with_Noise","221653130_Density-based_clustering_for_real-time_stream_data","221570944_MSDBSCAN_Multi-density_Scale-Independent_Clustering_Algorithm_Based_on_DBSCAN","221310440_A_Framework_for_Clustering_Evolving_Data_Streams"]}