{"id":"262285368_A_General_Constraint-centric_Scheduling_Framework_for_Spatial_Architectures","abstract":"Specialized execution using spatial architectures provides energy efficient computation, but requires effective algorithms for spatially scheduling the computation. Generally, this has been solved with architecture-specific heuristics, an approach which suffers from poor compiler/architect productivity, lack of insight on optimality, and inhibits migration of techniques between architectures.\nOur goal is to develop a scheduling framework usable for all spatial architectures. To this end, we expresses spatial scheduling as a constraint satisfaction problem using Integer Linear Programming (ILP). We observe that architecture primitives and scheduler responsibilities can be related through five abstractions: placement of computation, routing of data, managing event timing, managing resource utilization, and forming the optimization objectives. We encode these responsibilities as 20 general ILP constraints, which are used to create schedulers for the disparate TRIPS, DySER, and PLUG architectures. Our results show that a general declarative approach using ILP is implementable, practical, and typically matches or outperforms specialized schedulers.","authors":["Tony Nowatzki","Michael Sartin-Tarm","Lorenzo De Carli","Karthikeyan Sankaralingam"],"meta":["June 2013ACM SIGPLAN Notices 48(6):495-506","DOI:10.1145/2499370.2462163","Conference: Proceedings of the 34th ACM SIGPLAN conference on Programming language design and implementationVolume: 48"],"references":["260331915_Neural_Acceleration_for_General-Purpose_Approximate_Programs","321524823_Software_Synthesis_from_Dataflow_Graphs","314828905_Denali_a_goal-directed_superoptimizer","311476581_Instruction_scheduling_for_a_tiled_dataflow_architecture","311476348_A_spatial_path_scheduling_algorithm_for_EDGE_architectures","311474874_An_evaluation_of_the_TRIPS_computer_system","311471819_Tartan_evaluating_spatial_computation_for_whole_program_execution","305257622_Scanning_polyhedra_with_DO_loops","285621547_Dark_silicon_and_the_end_of_multicore_scaling_SIGARCH_Comput","278917254_Denali"]}