{"id":"262348273_Worst-case_Optimal_Join_Algorithms","abstract":"Efficient join processing is one of the most fundamental and well-studied tasks in database research. In this work, we examine algorithms for natural join queries over many relations and describe a novel algorithm to process these queries optimally in terms of worst-case data complexity. Our result builds on recent work by Atserias, Grohe, and Marx, who gave bounds on the size of a full conjunctive query in terms of the sizes of the individual relations in the body of the query. These bounds, however, are not constructive: they rely on Shearer's entropy inequality which is information-theoretic. Thus, the previous results leave open the question of whether there exist algorithms whose running time achieve these optimal bounds. An answer to this question may be interesting to database practice, as we show in this paper that any project-join plan is polynomially slower than the optimal bound for some queries. We construct an algorithm whose running time is worst-case optimal for all natural join queries. Our result may be of independent interest, as our algorithm also yields a constructive proof of the general fractional cover bound by Atserias, Grohe, and Marx without using Shearer's inequality. In addition, we show that this bound is equivalent to a geometric inequality by Bollobás and Thomason, one of whose special cases is the famous Loomis-Whitney inequality. Hence, our results algorithmically prove these inequalities as well. Finally, we discuss how our algorithm can be used to compute a relaxed notion of joins.","authors":["Hung Q. Ngo","Ely Porat","Christopher Ré","Atri Rudra"],"meta":["May 2012","DOI:10.1145/2213556.2213565","SourcearXiv","Conference: Proceedings of the 31st symposium on Principles of Database Systems"],"references":["232635757_ISOMER_Consistent_Histogram_Construction_Using_Query_Feedback","230595717_Combinatorial_Optimization_Polyhedra_and_Efficiency","325868590_Probability_on_trees_and_networks","313664547_Improved_histograms_for_selectivity_estimation_of_range_predicates","271452213_Generalized_hypertree_decompositions","268642744_Combinatorial_optimization_Polyhedra_and_efficiency_3_volumes","256392305_Some_intersection_theorems_for_ordered_sets_and_graphs","246227710_Foundations_of_Databases_The_Logical_Level","244491733_Projections_of_Bodies_and_Hereditary_Properties_of_Hypergraphs","244453272_An_Inequality_Related_to_the_Isoperimetric_Inequality"]}