{"id":"262352639_Security_scheduling_for_real-world_networks","abstract":"Network based security games, where a defender strategically places security measures on the edges of a graph to protect against an adversary, who chooses a path through a graph is an important research problem with potential for real-world impact. For example, police forces face the problem of placing checkpoints on roads to inspect vehicular traffic in their day-to-day operations, a security measure the Mumbai police have performed since the terrorist attacks in 2008. Algorithms for solving such network-based security problems have been proposed in the literature, but none of them scale up to solving problems of the size of real-world networks. In this paper, we present Snares, a novel algorithm that computes optimal solutions for both the defender and the attacker in such network security problems. Based on a double-oracle framework, Snares makes novel use of two approaches: warm starts and greedy responses. It makes the following contributions: (1) It defines and uses mincut-fanout, a novel method for efficient warm-starting of the computation; (2) It exploits the sub-modularity property of the defender optimization in a greedy heuristic, which is used to generate \"better-responses\"; Snares} also uses a better-response computation for the attacker. Furthermore, we evaluate the performance of Snares in real-world networks illustrating a significant advance: whereas state-of-the-art algorithms could handle just the southern tip of Mumbai, {\\sc Snares} can compute optimal strategy for the entire urban road network of Mumbai.","authors":["Manish Jain","Vincent Conitzer","Milind Tambe"],"meta":["May 2013","Conference: Proceedings of the 2013 international conference on Autonomous agents and multi-agent systems"],"references":["262364860_Designing_better_strategies_against_human_adversaries_in_network_security_games","262251154_Game-theoretic_resource_allocation_for_malicious_packet_detection_in_computer_networks","242932388_Two-Person_Zero-Sum_Games_for_Network_Interdiction","242914003_An_Analysis_of_Approximations_for_Maximizing_Submodular_Set_Functions-I","228522337_The_Deployment-to-Saturation_Ratio_in_Security_Games","221604948_Urban_Security_Game-Theoretic_Resource_Allocation_in_Networked_Domains","221456290_A_double_oracle_algorithm_for_zero-sum_security_games_on_graphs","221454663_Stackelberg_vs_Nash_in_security_games_Interchangeability_equivalence_and_uniqueness","268652442_Search_Games","262410579_PROTECT_A_deployed_game_theoretic_system_to_protect_the_ports_of_the_United_States","262314242_Solving_non-zero_sum_multiagent_network_flow_security_games_with_attack_costs","238856551_Infiltration_Games_on_Arbitrary_Graphs","221589588_Studying_non-planar_road_networks_through_an_algorithmic_lens","221345955_Planning_in_the_Presence_of_Cost_Functions_Controlled_by_an_Adversary","220812564_Multi-Step_Multi-Sensor_Hider-Seeker_Games"]}