{"id":"262313837_Pay-As-You-Go_Data_Integration_Using_Functional_Dependencies","abstract":"Setting up a full data integration system for many ap-plication contexts, e.g. web and scientific data management, requires significant human effort which prevents it from being really scalable. In this paper, we propose IFD (Integration based on Functional Dependen-cies), a pay-as-you-go data integration system that allows integrating a given set of data sources, as well as incrementally integrating addi-tional sources. IFD takes advantage of the background knowledge im-plied within functional dependencies for matching the source schemas. Our system is built on a probabilistic data model that allows capturing the uncertainty in data integration systems. Our performance evaluation results show significant performance gains of our approach in terms of re-call and precision compared to the baseline approaches. They confirm the importance of functional dependencies and also the contribution of using a probabilistic data model in improving the quality of schema matching. The analytical study and experiments show that IFD scales well.","authors":["Naser Ayat","Hamideh Afsarmanesh","Reza Akbarinia","Patrick Valduriez"],"meta":["August 2012","DOI:10.1007/978-3-642-32498-7_28","Conference: Multidisciplinary Research and Practice for Information SystemsVolume: Lecture Notes in Computer Science Volume 7465, 2012, pp 375-389"],"references":["260324588_Efficient_Evaluation_of_SUM_Queries_Over_Probabilistic_Data","221900777_The_WEKA_data_mining_software_An_update","221035540_Functional_Dependency_Generation_and_Applications_in_Pay-As-You-Go_Data_Integration_Systems","280300447_Tane_An_Efficient_Algorithm_for_Discovering_Functional_and_Approximate_Dependencies","242528475_Principles_of_Distributed_Database_Systems","226834347_Data_integration_with_uncertainty","222669148_Extracting_information_from_heterogeneous_information_sources_using_ontologically_specified_target_views","221214293_Bootstrapping_Pay-As-You-Go_Data_Integration_Systems","220988143_Web-Scale_Data_Integration_You_can_afford_to_Pay_as_You_Go","220695902_Principles_of_Distributed_Database_Systems_Third_Edition"]}