{"id":"262357969_Demonstration_of_Hadoop-GIS_A_Spatial_Data_Warehousing_System_Over_MapReduce","abstract":"The proliferation of GPS-enabled devices, and the rapid improvement of scientific instruments have resulted in massive amounts of spatial data in the last decade. Support of high performance spatial queries on large volumes data has become increasingly important in numerous fields, which requires a scalable and efficient spatial data warehousing solution as existing approaches exhibit scalability limitations and efficiency bottlenecks for large scale spatial applications.\nIn this demonstration, we present Hadoop-GIS -- a scalable and high performance spatial query system over MapReduce. Hadoop-GIS provides an efficient spatial query engine to process spatial queries, data and space based partitioning, and query pipelines that parallelize queries implicitly on MapReduce. Hadoop-GIS also provides an expressive, SQL-like spatial query language for work-load specification. We will demonstrate how spatial queries are expressed in spatially extended SQL queries, and submitted through a command line/web interface for execution. Parallel to our system demonstration, we explain the system architecture and details on how queries are translated to MapReduce operators, optimized, and executed on Hadoop. In addition, we will showcase how the system can be used to support two representative real world use cases: large scale pathology analytical imaging, and geo-spatial data warehousing.","authors":["Ablimit Aji","Xiling Sun","Hoang Vo","Qioaling Liu"],"meta":["November 2013","DOI:10.1145/2525314.2525320","Conference: Proceedings of the 21st ACM SIGSPATIAL International Conference on Advances in Geographic Information Systems","Project: Digital Pathology - Software Platforms,  Data and Analytics"],"references":["271966411_Hadoop-GIS_A_High_Performance_Spatial_Data_Warehousing_System_over_MapReduce","260118269_Towards_Building_a_High_Performance_Spatial_Query_System_for_Large_Scale_Medical_Imaging_Data","258255533_Hadoop-GIS_A_High_Performance_Spatial_Data_Warehousing_System_over_MapReduce","274341713_Hadoop_GIS","220538285_Hive_-_A_Warehousing_Solution_Over_a_Map-Reduce_Framework"]}