{"id":"262393281_How_video_production_affects_student_engagement_An_empirical_study_of_MOOC_videos","abstract":"Videos are a widely-used kind of resource for online learning. This paper presents an empirical study of how video production decisions affect student engagement in online educational videos. To our knowledge, ours is the largest-scale study of video engagement to date, using data from 6.9 million video watching sessions across four courses on the edX MOOC platform. We measure engagement by how long students are watching each video, and whether they attempt to answer post-video assessment problems.\nOur main findings are that shorter videos are much more engaging, that informal talking-head videos are more engaging, that Khan-style tablet drawings are more engaging, that even high-quality pre-recorded classroom lectures might not make for engaging online videos, and that students engage differently with lecture and tutorial videos.\nBased upon these quantitative findings and qualitative insights from interviews with edX staff, we developed a set of recommendations to help instructors and video producers take better advantage of the online video format. Finally, to enable researchers to reproduce and build upon our findings, we have made our anonymized video watching data set and analysis scripts public. To our knowledge, ours is one of the first public data sets on MOOC resource usage.","authors":["Philip J. Guo","Juho Kim","Rob Rubin"],"meta":["March 2014","DOI:10.1145/2556325.2566239","Conference: Proceedings of the first ACM conference on Learning @ scale conference"],"references":["264548150_Investigating_Differences_among_the_Commonly_Used_Video_Lecture_Styles","260265661_Deconstructing_Disengagement_Analyzing_Learner_Subpopulations_in_Massive_Open_Online_Courses","245493112_Pedagogy_Meets_PowerPoint_A_Research_Review_of_the_Effects_of_Computer-Generated_Slides_in_the_Classroom","237091973_Studying_Learning_in_the_Worldwide_Classroom_Research_into_edX's_First_MOOC","236973386_Who_Does_What_in_a_Massive_Open_Online_Course","284971556_Multimedia_learning_and_games","275474403_Guidelines_for_the_Use_of_Multimedia_in_Instruction","265764288_Editors'_Introduction_The_Teaching_Self","262361998_Should_your_MOOC_forum_use_a_reputation_system","262204160_TypeRighting_Combining_the_benefits_of_handwriting_and_typeface_in_online_educational_videos"]}