{"id":"262330177_Object_Constraint_Language_OCL_A_Definitive_Guide","abstract":"The Object Constraint Language (OCL) started as a complement of the UML notation with the goal to overcome the limitations of UML (and in general, any graphical notation) in terms of precisely specifying detailed aspects of a system design. Since then, OCL has become a key component of any model-driven engineering (MDE) technique as the default language for expressing all kinds of (meta)model query, manipulation and specification requirements. Among many other applications, OCL is frequently used to express model transformations (as part of the source and target patterns of transformation rules), well-formedness rules (as part of the definition of new domain-specific languages), or code-generation templates (as a way to express the generation patterns and rules).\nThis chapter pretends to provide a comprehensive view of this language, its many applications and available tool support as well as the latest research developments and open challenges around it.","authors":["Jordi Cabot","Martin Gogolla"],"meta":["June 2012","DOI:10.1007/978-3-642-30982-3_3","Conference: Proceedings of the 12th international conference on Formal Methods for the Design of Computer, Communication, and Software Systems: formal methods for model-driven engineering","Project: Conceptual Modeling"],"references":["308951609_Modeling_the_OCL_Standard_Library","225954093_Validating_UML_and_OCL_models_in_USE_by_automatic_snapshot_generation","225601728_On_Better_Understanding_OCL_Collections_or_An_OCL_Ordered_Set_Is_Not_an_OCL_Set","225102401_UML2Alloy_A_Challenging_Model_Transformation","221340424_Verifying_UMLOCL_models_using_Boolean_satisfiability","308951355_A_Framework_for_Generating_Query_Language_Code_from_OCL_Invariants","234783291_The_Object_Constraint_Language_Second_Edition_Getting_Your_Models_Ready_for_MDA","222594748_USE_A_UML-based_specification_environment_for_validating_UML_and_OCL","222530521_Incremental_integrity_checking_of_UMLOCL_conceptual_schemas","221269364_Lecture_Notes_in_Computer_Science"]}