{"id":"262356200_Leakage-Resilient_Circuits_without_Computational_Assumptions","abstract":"Physical cryptographic devices inadvertently leak information through numerous side-channels. Such leakage is exploited by so-called side-channel attacks, which often allow for a complete security breache. A recent trend in cryptography is to propose formal models to incorporate leakage into the model and to construct schemes that are provably secure within them.\nWe design a general compiler that transforms any cryptographic scheme, e.g., a block-cipher, into a functionally equivalent scheme which is resilient to any continual leakage provided that the following three requirements are satisfied: (i) in each observation the leakage is bounded, (ii) different parts of the computation leak independently, and (iii) the randomness that is used for certain operations comes from a simple (non-uniform) distribution. In contrast to earlier work on leakage resilient circuit compilers, which relied on computational assumptions, our results are purely information-theoretic. In particular, we do not make use of public key encryption, which was required in all previous works.","authors":["Stefan Dziembowski","Sebastian Faust"],"meta":["March 2012","DOI:10.1007/978-3-642-28914-9_13","Conference: Proceedings of the 9th international conference on Theory of Cryptography"],"references":["220336940_Leakage-Resilient_Storage","265527793_Leakage-Resilient_ElGamal","225679785_Physically_Observable_Cryptography","224354130_Leakage-Resilient_Cryptography","221355111_Protecting_Cryptographic_Keys_against_Continual_Leakage","221354906_One-Time_Programs","221354783_Securing_Computation_against_Continuous_Leakage","221354076_Physically_Observable_Cryptography_Extended_Abstract","221348450_Protecting_Circuits_from_Leakage_the_Computationally-Bounded_and_Noisy_Cases","221348070_A_Leakage-Resilient_Mode_of_Operation","221327119_Leakage-Resilient_Cryptography_from_the_Inner-Product_Extractor","221326762_Leakage_Resilient_ElGamal_Encryption","220336672_Leakage-Resilient_Cryptography_in_the_Standard_Model","2477978_Physically_Observable_Cryptography","2415823_Private_Circuits_Securing_Hardware_against_Probing_Attacks"]}