{"id":"262395542_An_experience_report_on_using_gamification_in_technical_higher_education","abstract":"Technical universities, especially in Europe, are facing an important challenge in attracting more diverse groups of students, and in keeping the students they attract motivated and engaged in the curriculum. We describe our experience with gamification, which we loosely define as a teaching technique that uses social gaming elements to deliver higher education. Over the past three years, we have applied gamification to undergraduate and graduate courses in a leading technical university in the Netherlands and in Europe. Ours is one of the first long-running attempts to show that gamification can be used to teach technically challenging courses. The two gamification-based courses, the first-year B.Sc. course Computer Organization and an M.Sc.-level course on the emerging technology of Cloud Computing, have been cumulatively followed by over 450 students and passed by over 75% of them, at the first attempt. We find that gamification is correlated with an increase in the percentage of passing students, and in the participation in voluntary activities and challenging assignments. Gamification seems to also foster interaction in the classroom and trigger students to pay more attention to the design of the course. We also observe very positive student assessments and volunteered testimonials, and a Teacher of the Year award.","authors":["Alexandru Iosup","D. H. J. Epema"],"meta":["March 2014","DOI:10.1145/2538862.2538899","Conference: Proceedings of the 45th ACM technical symposium on Computer science education"],"references":["263009331_Using_Gamification_to_Motivate_Children_to_Complete_Empirical_Studies_in_Lab_Environments","259841647_Defining_Gamification_-_A_Service_Marketing_Perspective","230854710_From_Game_Design_Elements_to_Gamefulness_Defining_Gamification","262370141_20_Obstacles_to_Scalability","262357649_Strategies_for_adding_the_emerging_PDC_curriculum_recommendations_into_CS_courses","262321920_Using_Clouds_for_MapReduce_Measurement_Assignments","245112823_A_Theory_of_Fun_for_Game_Design","244486327_Soviet_and_American_precursors_to_the_gamification_of_work","242106004_Heuristics_for_Designing_Enjoyable_User_Interfaces_Lessons_from_Computer_Games","234796797_WebMapReduce_An_accessible_and_adaptable_tool_for_teaching_map-reduce_computing"]}