{"id":"262312964_Combinatorics_and_Geometry_of_Finite_and_Infinite_Squaregraphs","abstract":"Squaregraphs were originally defined as finite plane graphs in which all inner faces are quadrilaterals (i.e., 4-cycles) and all inner vertices (i.e., the vertices not incident with the outer face) have degrees larger than three. The planar dual of a finite squaregraph is determined by a triangle-free chord diagram of the unit disk, which could alternatively be viewed as a triangle-free line arrangement in the hyperbolic plane. This representation carries over to infinite plane graphs with finite vertex degrees in which the balls are finite squaregraphs. Algebraically, finite squaregraphs are median graphs for which the duals are finite circular split systems. Hence squaregraphs are at the crosspoint of two dualities, an algebraic one and a geometric one, and thus lend themselves to several combinatorial interpretations and structural characterizations. With these and the 5-colorability theorem for circle graphs at hand, we prove that every squaregraph can be isometrically embedded into the Cartesian product of five trees. This embedding result can also be extended to the infinite case without reference to an embedding in the plane and without any cardinality restriction when formulated for median graphs free of cubes and further finite obstructions. Further, we exhibit a class of squaregraphs that can be embedded into the product of three trees, and we characterize those squaregraphs that are embeddable into the product of just two trees. Finally, finite squaregraphs enjoy a number of algorithmic features that do not extend to arbitrary median graphs. For instance, we show that minimum-size median-generating sets of finite squaregraphs can be computed in polynomial time, whereas, not unexpectedly, the corresponding problem for median graphs turns out to be NP-hard. Finite squaregraphs can be recognized in linear time by a Breadth-First-Search.","authors":["Hans-Jürgen Bandelt","Victor Chepoi","David Eppstein"],"meta":["September 2010SIAM Journal on Discrete Mathematics 24(4):1399-1440","DOI:10.1137/090760301"],"references":["265184000_Embedding_Topological_Median_Algebras_in_Products_of_Dendrons","248855504_The_expansion_procedure_for_graphs","278730102_Simplicite_de_groupes_d'automorphismes_d'espaces_a_courbure_negative","268825179_Median_lattices_and_convex_subalgebras","268243665_On_upper_estimates_for_the_chromatic_number_of_graphs","267058482_Theory_of_Convex_Structures","256694057_Induced_cycles_in_crossing_graphs_of_median_graphs","256693598_On_cube-free_median_graphs","256391598_Distance-preserving_subgraphs_of_hypercubes","246815356_Metric_Spaces_of_Non-Positive_Curvature"]}