{"id":"262368514_Decision-theoretic_approach_to_maximizing_observation_of_multiple_targets_in_multi-camera_surveillance","abstract":"This paper presents a novel decision-theoretic approach to control and coordinate multiple active cameras for observing a number of moving targets in a surveillance system. This approach offers the advantages of being able to (a) account for the stochasticity of targets' motion via probabilistic modeling, and (b) address the trade-off between maximizing the expected number of observed targets and the resolution of the observed targets through stochastic optimization. One of the key issues faced by existing approaches in multi-camera surveillance is that of scalability with increasing number of targets. We show how its scalability can be improved by exploiting the problem structure: as proven analytically, our decision-theoretic approach incurs time that is linear in the number of targets to be observed during surveillance. As demonstrated empirically through simulations, our proposed approach can achieve high-quality surveillance of up to 50 targets in real time and its surveillance performance degrades gracefully with increasing number of targets. We also demonstrate our proposed approach with real AXIS 214 PTZ cameras in maximizing the number of Lego robots observed at high resolution over a surveyed rectangular area. The results are promising and clearly show the feasibility of our decision-theoretic approach in controlling and coordinating the active cameras in real surveillance system.","authors":["Prabhu Natarajan","Trong Nghia Hoang","Kian Hsiang Low","Mohan Kankanhalli"],"meta":["June 2012","Conference: Proceedings of the 11th International Conference on Autonomous Agents and Multiagent Systems - Volume 1"],"references":["262313123_Assigning_cameras_to_subjects_in_video_surveillance_systems","224156219_Probabilistic_Surveillance_with_Multiple_Active_Cameras","221477849_Scalable_target_coverage_in_smart_camera_networks","220936035_A_Decision-Theoretic_Approach_to_Dynamic_Sensor_Selection_in_Camera_Networks","314416124_Distributed_multi-target_tracking_in_a_self-configuring_camera_network","262405213_Video_Surveillance_with_PTZ_Cameras_The_Problem_of_Maximizing_Effective_Monitoring_Time","242506502_An_efficient_and_accurate_camera_calibration_technique_for_3D_machine_vision","224626999_Surveillance_Camera_Coordination_Through_Distributed_Scheduling","224605194_Planning_ahead_for_PTZ_camera_assignment_and_handoff","221364064_Distributed_multi-target_tracking_in_a_self-configuring_camera_network"]}