{"id":"262361269_Tree_reconfiguration_without_lightpath_interruption_in_WDM_optical_networks","abstract":"Efficient reconfiguration of optical multicast trees in wavelength division multiplexing (WDM) networks is required. Multimedia applications which consume a huge bandwidth, require multicasting. So, multicast concept is extended to optical networks to improve performance. Today, networks are facing many phenomena such as changes in the traffic model, failures, additions or deletions of some network resources due to a maintenance operation. To cope with these phenomena, network operators compute new topology according to the applications requirements. Some real-time multicast applications are not indulgent with lightpath interruptions. So the configuration of the network must be done as quickly as possible to be spontaneously deal with the problem before other events appear and without connection interruption. To the best of our knowledge, there is no work in the literature that considers the reconfiguration of an optical multicast tree to another one without connection interruption. We prove that it is impossible to reconfigure any initial tree into any final tree using only one wavelength and without connection interruption. We propose in this paper BpBAR_2 method, using several wavelengths to reconfigure optical WDM network. This algorithm does tree reconfiguration without lightpath interruption, reduce the reconfiguration setup time and the cost of wavelengths used.","authors":["Bernard A. Cousin","Joel Christian Adépo","Souleymane Oumtanaga","Michel Babri"],"meta":["November 2012International Journal of Internet Protocol Technology 7(2):85-95","DOI:10.1504/IJIPT.2012.050217"],"references":["239551153_Fast_reconfiguration_of_dynamic_networks","228918143_Multicast_Routing_and_Wavelength_Assignment_in_WDM_Mesh_Networks_with_Sparse_Splitting","228772933_Dynamic_Multicast_Traffic_Grooming_in_WDM_Networks_with_Reconfigurable_Light-trees","306157654_Shortest_Connection_Networks_and_Some_Generalizations","244164897_General_Switch_Management_Protocol_GSMP_Applicability","243777505_General_switch_management_protocol_GSMP_v3","242562037_A_Note_on_Two_Problems_in_Connexion_with_Graphs","238698550_A_Path_Computation_Element_PCE-based_Architecture","228738032_Consolidation_strategies_of_provisioning-oriented_optical_networks","228597876_Optimal_reconfiguration_of_provisioning_oriented_optical_networks"]}