{"id":"262361985_RNS-Based_Elliptic_Curve_Point_Multiplication_for_Massive_Parallel_Architectures","abstract":"Acceleration of cryptographic applications on massive parallel computing platforms, such as Graphic Processing Units (GPUs),\nbecomes a real challenge concerning practical implementations. In this paper, we propose a parallel algorithm for Elliptic\nCurve (EC) point multiplication in order to compute EC cryptography on these platforms. The proposed approach relies on the\nusage of the Residue Number System (RNS) to extract parallelism on high-precision integer arithmetic. Results suggest a maximum\nthroughput of 9827 EC multiplications per second and minimum latency of 29.2 ms for a 224-bit underlying field, in a commercial\nNvidia 285 GTX GPU. Performances up to an order of magnitude better in latency and 122% in throughput are achieved regarding\nother approaches reported in the related art. An experimental analysis of the scalability, based on OpenCL descriptions of\nthe proposed algorithms, suggest that further advantage can be obtained from the proposed RNS approach for GPUs and EC curves\nsupported by underlying finite fields of smaller size, regarding implementations on general purpose multi-cores.","authors":["Samuel Antao","Jean Claude Bajard","Leonel Sousa"],"meta":["May 2012The Computer Journal 55(5):629-647","DOI:10.1093/comjnl/bxr119"],"references":["267221714_Efficient_Implementation_of_Elliptic_Curve_Cryptography_on_DSP_for_Underwater_Sensor_Networks","260687001_GPU_computing","226111306_Cox-Rower_Architecture_for_Fast_Parallel_Montgomery_Multiplication","225230939_Ultra_High_Performance_ECC_over_NIST_Primes_on_Commercial_FPGAs","266861872_Combining_leak-resistant_arithmetic_for_elliptic_curves_defined_over_Fp_and_RNS_representation","266709815_Advance_in_Elliptic_Curve_Cryptography","264952435_Residue_Arithmetic_and_Its_Applications_to_Computer_Technology","254892277_The_billion-mulmod-per-second_PC","253848136_Efficient_RNS_Bases_for_Cryptography","227865190_GPU-accelerated_boundary_element_method_for_Helmholtz'_equation_in_three_dimensions"]}