{"id":"262368547_A_Fully_Pipelined_FPGA_Architecture_of_a_Factored_Restricted_Boltzmann_Machine_Artificial_Neural_Network","abstract":"Artificial neural networks (ANNs) are a natural target for hardware acceleration by FPGAs and GPGPUs because commercial-scale applications can require days to weeks to train using CPUs, and the algorithms are highly parallelizable. Previous work on FPGAs has shown how hardware parallelism can be used to accelerate a “Restricted Boltzmann Machine” (RBM) ANN algorithm, and how to distribute computation across multiple FPGAs.\nHere we describe a fully pipelined parallel architecture that exploits “mini-batch” training (combining many input cases to compute each set of weight updates) to further accelerate ANN training. We implement on an FPGA, for the first time to our knowledge, a more powerful variant of the basic RBM, the “Factored RBM” (fRBM). The fRBM has proved valuable in learning transformations and in discovering features that are present across multiple types of input. We obtain (in simulation) a 100-fold acceleration (vs. CPU software) for an fRBM having N = 256 units in each of its four groups (two input, one output, one intermediate group of units) running on a Virtex-6 LX760 FPGA. Many of the architectural features we implement are applicable not only to fRBMs, but to basic RBMs and other ANN algorithms more broadly.","authors":["Lokwon Kim","Sameh W. Asaad","Ralph Linsker"],"meta":["February 2014ACM Transactions on Reconfigurable Technology and Systems 7(1)","DOI:10.1145/2539125"],"references":["238716709_Random_Numbers_Generated_by_Linear_Recurrence_Modulo_Two","221618956_Gated_Softmax_Classification","221362351_Modeling_Pixel_Means_and_Covariances_Using_Factorized_Third-Order_Boltzmann_Machines","254465275_Review_of_hardware_neural_networksa_user's_perspective","225943507_An_Efficient_Hardware_Architecture_for_a_Neural_Network_Activation_Function_Generator","224175896_High-Performance_Reconfigurable_Hardware_Architecture_for_Restricted_Boltzmann_Machines","222423082_Artificial_neural_networks_A_review_of_commercial_hardware","222114533_GPU_implementation_of_neural_networks","221346352_Factored_conditional_restricted_Boltzmann_Machines_for_modeling_motion_style","221345446_Large-scale_deep_unsupervised_learning_using_graphics_processors"]}