{"id":"262350911_Positioning_and_Presenting_Design_Science_Research_for_Maximum_Impact","abstract":"Design science research (DSR) has staked its rightful ground as an important and legitimate Information Systems (IS) research paradigm. We contend that DSR has yet to attain its full potential impact on the development and use of information systems due to gaps in the understanding and application of DSR concepts and methods. This essay aims to help researchers (1) appreciate the levels of artifact abstractions that may be DSR contributions, (2) identify appropriate ways of consuming and producing knowledge when they are preparing journal articles or other scholarly works, (3) understand and position the knowledge contributions of their research projects, and (4) structure a DSR article so that it emphasizes significant contributions to the knowledge base. Our focal contribution is the DSR knowledge contribution framework with two dimensions based on the existing state of knowledge in both the problem and solution domains for the research opportunity under study. In addition, we propose a DSR communication schema with similarities to more conventional publication patterns, but which substitutes the description of the DSR artifact in place of a traditional results section. We evaluate the DSR contribution framework and the DSR communication schema via examinations of DSR exemplar publications.","authors":["Shirley Gregor","Alan Hevner"],"meta":["June 2013MIS Quarterly 37(2):337-356","DOI:10.25300/MISQ/2013/37.2.01"],"references":["287232457_Detecting_Fake_Websites_The_Contribution_of_Statistical_Learning_Theory","285843397_Mining_association_rules_between_set_of_items_in_largedatabases","284503626_A_design_science_research_methodology_for_information_systems_research","313843504_Writing_for_Computer_Science","313174403_Exaptation_A_Missing_Term_in_the_Science_of_Form","285838293_A_Framework_for_Theory_Development_in_Design_Science_Research_Multiple_Perspectives","285741314_Assessing_information_system_design_theory_in_perspective_How_useful_was_our_1992_initial_rendition","284215329_The_Structure_of_Science_Problems_in_the_Logic_of_Scientific_Explanation","279394600_Writing_for_Computer_Science","276054426_Trends_in_Theory_Building_and_Theory_Testing_A_Five-Decade_Study_of_the_Academy_of_Management_Journal"]}