{"id":"262328721_The_Zones_of_Proximal_flow_Guiding_students_through_a_space_of_computational_thinking_skills_and_challenges","abstract":"This paper presents a novel pedagogical framework, entitled the Zones of Proximal Flow, which integrates Vygotsky's Zone of Proximal Development theory with Csikszentmihalyi's ideas about Flow. Flow focuses on the individual-- an individual is in Flow when challenges are balanced with skills. The Zone of Proximal Development, on the other hand, brings in a social learning aspect focusing on a student's ability to learn concepts with external support. From our research experiences bringing game and simulation design into middle school classrooms, we attempt to provide students with appropriate challenges using a project-first based approach that aims to keep students in Flow. The project-first approach employs inquiry based scaffolding to guide students, with appropriate support by their teachers, through Vygotsky's Zone of Proximal Development, back in to Csikszentmihalyi's state of Flow for an ideal learning experience. We call this space the Zones of Proximal Flow. Data indicate that the Zones of Proximal Flow approach works, keeping classrooms engaged in the act of game design and enabling students to advance to more complex program creations.","authors":["Ashok Basawapatna","Alexander Repenning","Kyu Han Koh","Hilarie Nickerson"],"meta":["August 2013","DOI:10.1145/2493394.2493404","Conference: Proceedings of the ninth annual international ACM conference on International computing education research"],"references":["262402225_Will_it_stick_exploring_the_sustainability_of_computational_thinking_education_through_game_design","254006843_Toward_an_emergent_theory_of_broadening_participation_in_computer_science_education","228826422_Recognizing_computational_thinking_patterns","317953561_Mind_in_society_The_development_of_higher_psychological_processes","277374591_Lowering_the_barriers_to_programming","271706555_Video_Games_in_Education","265047892_The_Zone_of_Proximal_Development_in_Vygotsky's_Analysis_of_Learning_and_Instruction","262205263_The_simulation_creation_toolkit_An_initial_exploration_into_making_programming_accessible_while_preserving_computational_thinking","258721956_Learning_Science_Through_Computer_Games_and_Simulations","239061544_Beyond_Boredom_and_Anxiety_The_Experience_of_Play_in_Work_and_Games"]}