{"id":"262372065_Improving_retention_Predicting_at-risk_students_by_analysing_clicking_behaviour_in_a_virtual_learning_environment","abstract":"One of the key interests for learning analytics is how it can be used to improve retention. This paper focuses on work conducted at the Open University (OU) into predicting students who are at risk of failing their module. The Open University is one of the worlds largest distance learning institutions. Since tutors do not interact face to face with students, it can be difficult for tutors to identify and respond to students who are struggling in time to try to resolve the difficulty. Predictive models have been developed and tested using historic Virtual Learning Environment (VLE) activity data combined with other data sources, for three OU modules. This has revealed that it is possible to predict student failure by looking for changes in user's activity in the VLE, when compared against their own previous behaviour, or that of students who can be categorised as having similar learning behaviour. More focused analysis of these modules applying the GUHA (General Unary Hypothesis Automaton) method of data analysis has also yielded some early promising results for creating accurate hypothesis about students who fail.","authors":["Annika Wolff","Zdenek Zdráhal","Andriy Nikolov","Michal Pantucek"],"meta":["April 2013","DOI:10.1145/2460296.2460324","Conference: Proceedings of the Third International Conference on Learning Analytics and Knowledge"],"references":["254462830_Course_signals_at_Purdue_Using_learning_analytics_to_increase_student_success","249033905_Motivating_learners_in_open_and_distance_learning_Do_we_need_a_new_theory_of_learner_support","228741202_A_comparison_of_student_outcomes_satisfaction_between_traditional_Web_based_course_offerings","287097640_Why_online_learners_drop_out","245951209_Distance_learners_in_higher_education","243775775_Barriers_to_Learning_in_Distance_Education","242453132_Academic_Analytics","228394219_Comparison_of_student_characteristics_and_evaluation_of_student_success_in_an_online_health_education_course","227753809_In_practice_Purdue_Signals_Mining_real-time_academic_data_to_enhance_student_success","226299872_The_GUHA_method_of_automatic_hypotheses_determination"]}