{"id":"262354511_Depth_Synthesis_and_Local_Warps_for_Plausible_Image-Based_Navigation","abstract":"Modern camera calibration and multiview stereo techniques enable users to smoothly navigate between different views of a scene captured using standard cameras. The underlying automatic 3D reconstruction methods work well for buildings and regular structures but often fail on vegetation, vehicles, and other complex geometry present in everyday urban scenes. Consequently, missing depth information makes Image-Based Rendering (IBR) for such scenes very challenging. Our goal is to provide plausible free-viewpoint navigation for such datasets. To do this, we introduce a new IBR algorithm that is robust to missing or unreliable geometry, providing plausible novel views even in regions quite far from the input camera positions. We first oversegment the input images, creating superpixels of homogeneous color content which often tends to preserve depth discontinuities. We then introduce a depth synthesis approach for poorly reconstructed regions based on a graph structure on the oversegmentation and appropriate traversal of the graph. The superpixels augmented with synthesized depth allow us to define a local shape-preserving warp which compensates for inaccurate depth. Our rendering algorithm blends the warped images, and generates plausible image-based novel views for our challenging target scenes. Our results demonstrate novel view synthesis in real time for multiple challenging scenes with significant depth complexity, providing a convincing immersive navigation experience.","authors":["Gaurav Chaurasia","Sylvain Duchêne","Olga Sorkine-Hornung","George Drettakis"],"meta":["June 2013ACM Transactions on Graphics 32(3)","DOI:10.1145/2487228.2487238"],"references":["255564611_Multiple_View_Object_Cosegmentation_Using_Appearance_and_Stereo_Cues","254461917_Image-Based_Rendering_for_Scenes_with_Reflections","330180129_Light_Field_Editing_and_Rendering","319770714_Photo_tourism_Exploring_photo_collections_in_3D","313368213_Multi-view_stereo_via_graph_cuts_on_the_dual_of_an_adaptive_tetrahedral_mesh","312618019_Plenoptic_modeling_An_image-based_rendering_system","312152791_Poisson_surface_reconstruction","277479597_Algorithm_887","274422361_Moving_gradients","263338773_Silhouette-Aware_Warping_for_Image-Based_Rendering"]}