{"id":"262322336_A_Source_Code_Similarity_System_for_Plagiarism_Detection","abstract":"Source code plagiarism is an easy to do task, but very difficult to detect without proper tool support. Various source code similarity detection systems have been developed to help detect source code plagiarism. Those systems need to recognize a number of lexical and structural source code modifications. For example, by some structural modifications (e.g. modification of control structures, modification of data structures or structural redesign of source code) the source code can be changed in such a way that it almost looks genuine. Most of the existing source code similarity detection systems can be confused when these structural modifications have been applied to the original source code. To be considered effective, a source code similarity detection system must address these issues. To address them, we designed and developed the source code similarity system for plagiarism detection. To demonstrate that the proposed system has the desired effectiveness, we performed a well-known conformism test. The proposed system showed promising results as compared with the JPlag system in detecting source code similarity when various lexical or structural modifications are applied to plagiarized code. As a confirmation of these results, an independent samples t-test revealed that there was a statistically significant difference between average values of F-measures for the test sets that we used and for the experiments that we have done in the practically usable range of cut-off threshold values of 35–70%.","authors":["Zoran Đurić","Dragan Gasevic"],"meta":["January 2013The Computer Journal 56(1):70-86","DOI:10.1093/comjnl/bxs018"],"references":["277287260_A_Survey_on_Software_Clone_Detection_Research","262763983_String_Similarity_via_Greedy_String_Tiling_and_Running_Karp-Rabin_Matching","262281635_Plagiarism_detection_for_Java_a_tool_comparison","234792131_Detection_of_similarities_in_student_programs_YAP'ing_may_be_preferable_to_Plague'ing","277290534_Scalable_Document_Fingerprinting","255678146_Natural_laws_controlling_algorithm_structure","244438006_Plagiarism_in_natural_and_programming_languages_An_overview_of_current_tools_and_technologies","242024779_Contested_texts_Issues_of_plagiarism","240319454_Plaggie_GNU-licensed_source_code_plagiarism_detection_engine_for_Java_exercises","234830766_A_Software_Study_Using_Halstead_Metrics"]}