{"id":"262414966_Procedimiento_para_determinar_las_Tendencias_Estadisticas_del_Desarrollo_de_la_Competencia_Investigativa_del_Ingeniero_en_Ciencias_Informaticas","abstract":"En la Universidad de las Ciencias Informáticas de Cuba algunos estudiantes en su\ncuarto año académico de la carrera de ingeniería en ciencias informáticas se incorporan a\nlos Centros de Desarrollo de Software y forman parte del equipo de desarrollo de un\nproyecto productivo real. Las tareas que se le orientan y evalúan se realizan por el mismo\nSistema de Gestión de Proyectos (GESPRO) que posee el proyecto de software, pero este\nsistema tiene como limitantes didácticas que el módulo de orientación de tareas carecen de\nelementos que le permitan al tutor o especialistas (profesionales que atienden al estudiante)\nevaluar a los alumnos según los indicadores que comprende la competencia investigativa, ni\npermite conocer las tendencias estadísticas del aprendizaje del estudiante en un intervalo de\ntiempo determinado. Debido a las limitantes antes señaladas, se propuso desarrollar una\naplicación que permitiera orientar a los tutores en la evaluación de la competencia\ninvestigativa y a su vez que este sistema se pudiera integrar al Sistema de Gestión de\nProyectos (GESPRO) de la universidad determinando las tendencias estadísticas actual del\naprendizaje de los estudiantes en torno al desarrollo de la competencia investigativa para la\ntoma de decisiones oportunas. Para desarrollar el software se elaboró un procedimiento\nbasado en series temporales que permitiera determinar las tendencias estadísticas del\naprendizaje del estudiante en función del desarrollo de la competencia investigativa\nasociada al desarrollo de software, que es a su vez el resultado que se presentará en este\nartículo.","authors":["Odiel Estrada Molina","Misleydi Alfonso Pulido","Leonardo Hidalgo Iglesia","Sahara María Blanco Hernández"],"meta":["January 2014","Project: Model for virtualization educational  of the research skills training in the software development process"],"references":["221528965_Effects_of_Time-Varied_Arrival_Rates_An_Investigation_in_Emergency_Ambulance_Service_Systems","5147690_The_application_of_forecasting_techniques_to_modeling_emergency_medical_system_calls_in_Calgary_Alberta","264959733_Time_series_Data_analysis_and_theory_Repr","259872469_Analysis_of_Financial_Time_Series_Financial_Econometrics","235622497_Analsis_of_Financial_Time_Series","225111196_Forecasting_in_a_Multi-skill_Call_Centre","223269789_EMS_Call_Volume_Predictions_A_Comparative_Study","221936093_Time_Series_Theory_and_Methods","39109013_Uso_de_los_modelos_de_series_temporales_como_tecnica_de_analisis_de_los_disenos_conductuales"]}