{"id":"262424069_Robust_artifactual_independent_component_classification_for_BCI_practitioners","abstract":"Objective: \nEEG artifacts of non-neural origin can be separated from neural signals by independent component analysis (ICA). It is unclear (1) how robustly recently proposed artifact classifiers transfer to novel users, novel paradigms or changed electrode setups, and (2) how artifact cleaning by a machine learning classifier impacts the performance of brain-computer interfaces (BCIs).\n\nApproach: \nAddressing (1), the robustness of different strategies with respect to the transfer between paradigms and electrode setups of a recently proposed classifier is investigated on offline data from 35 users and 3 EEG paradigms, which contain 6303 expert-labeled components from two ICA and preprocessing variants. Addressing (2), the effect of artifact removal on single-trial BCI classification is estimated on BCI trials from 101 users and 3 paradigms.\n\nMain results: \nWe show that (1) the proposed artifact classifier generalizes to completely different EEG paradigms. To obtain similar results under massively reduced electrode setups, a proposed novel strategy improves artifact classification. Addressing (2), ICA artifact cleaning has little influence on average BCI performance when analyzed by state-of-the-art BCI methods. When slow motor-related features are exploited, performance varies strongly between individuals, as artifacts may obstruct relevant neural activity or are inadvertently used for BCI control.\n\nSignificance: \nRobustness of the proposed strategies can be reproduced by EEG practitioners as the method is made available as an EEGLAB plug-in.","authors":["Irene Dowding","Stephanie Brandl","Franziska Horn","Eric Waldburger"],"meta":["May 2014Journal of Neural Engineering 11(3):035013","DOI:10.1088/1741-2560/11/3/035013","SourcePubMed"],"references":["312854561_EEGLAB_an_open_source_toolbox_for_analysis_of_single-trial_EEG_dynamics","257602145_EyeCatch_Data-mining_over_Half_a_Million_EEG_Independent_Components_to_Construct_a_Fully-Automated_Eye-Component_Detector","254061882_Optimizing_the_Performances_of_a_P300Based_Brain-Computer_Interface_in_Ambulatory_Conditions","232236933_Content-specific_coordination_of_listeners'_to_speakers'_EEG_during_communication_Front","229326704_Review_of_the_BCI_competition_IV","229059733_Brain-Computer_Interfaces_Beyond_Medical_Applications","313528562_Fast_and_robust_fixed-point_algorithm_for_independent_component_analysis","264126303_Classification_of_independent_components_of_EEG_into_multiple_artifact_classes","242810544_Unbiased_nonlinear_average_age-appropriate_brain_templates_from_birth_to_adulthood","231212716_How_about_Taking_a_Low-Cost_Small_and_Wireless_EEG_for_a_Walk"]}