{"id":"262496227_COMPETENCIA_EN_INVESTIGACION_EN_ENFERMERIA","abstract":"Nursing as a social profession and discipline finds itself immersed in the accelerated development of mankind in every aspect, needing to adjust in order to give an integrated and quality response to the new healthcare needs of users and society, as well as adapting to an increasingly competitive labor market. The use of research allows obtaining information and generating own knowledge needed to make decisions and solve problems in the practice, being the means to respond to it and, at the same time, make the humanist and autonomous nature of nursing visible. The purpose of this paper is to examine the research competence in nursing, applying the fve elements of a competence from the human resources perspective in nursing work environment. It is concluded that, for the development of competence in professional Nursing research, wanting to do and being able to, turn out to be determinants to carry out studies of the phenomena of the practice, added to the knowledge, know how to do and know how to be. It is the responsibility of the institution of health to provide the resources and the necessary infrastructure to specify the power to do in research competence.","authors":["Alda Orellana Y","Olivia Sanhueza Alvarado"],"meta":["December 2010Ciencia y Enfermeria 17(2):9-17","DOI:10.4067/S0717-95532011000200002"],"references":["317038204_Como_ensenar_a_investigar_en_la_universidad","296697082_La_sociedad_del_conocimiento_y_la_formacion_de_profesionales_2004-09","266162334_Curriculo_por_competencias_en_el_postgrado_de_enfermeria_a","251076929_La_nueva_formacion_de_profesionales_Sobre_la_competencia_profesional_y_la_competencia_del_estudiante_de_enfermeria","251071217_COMPETENCIAS_EN_INVESTIGACION_PARA_DIFERENTES_NIVELES_DE_FORMACION_DE_ENFERMERAS_UNA_PERSPECTIVA_LATINOAMERICANA","28097761_Como_ensenar_a_investigar_en_la_universidad","26379494_Investigar_en_enfermeria_Concepto_y_estado_actual_de_la_investigacion_en_enfermeria","331380394_La_nueva_formacion_de_profesionales_sobre_la_competencia_profesional_y_la_competencia_del_estudiante_de_enfermeria","240929950_Establecimiento_de_prioridades_de_investigacion_en_enfermeria_en_Espana_estudio_Delphi","28226261_Reflexiones_sobre_el_grado_y_postgrado_de_Enfermeria_la_Investigacion_en_Enfermeria"]}