{"id":"262404591_How_do_designers_and_user_experience_professionals_actually_perceive_and_use_personas","abstract":"Personas are a critical method for orienting design and development teams to user experience. Prior work has noted challenges in justifying them to developers. In contrast, it has been assumed that designers and user experience professionals - whose goal is to focus designs on targeted users - will readily exploit personas. This paper examines that assumption. We present the first study of how experienced user-centered design (UCD) practitioners with prior experience deploying personas, use and perceive personas in industrial software design. We identify limits to the persona approach in the context studied. Practitioners used personas almost exclusively for communication, but not for design. Participants identified four problems with personas, finding them abstract, impersonal, misleading and distracting. Our findings argue for a new approach to persona deployment and construction. Personas cannot replace immersion in actual user data. And rather than focusing on creating engaging personas, it is critical to avoid persona attributes that mislead or distract.","authors":["Tara Matthews","Tejinder Judge","Steve Whittaker"],"meta":["May 2012","DOI:10.1145/2207676.2208573","Conference: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems"],"references":["246069017_Engaging_Personas_and_Narrative_Scenarios","241622921_Comparing_collaboration_and_individual_personas_for_the_design_and_evaluation_of_collaboration_software","226944691_Productive_Interrelationships_between_Collaborative_Groups_Ease_the_Challenges_of_Dynamic_and_Multi-Teaming","221631255_Personas_is_not_Applicable_Local_Remedies_Interpreted_in_a_Wider_Context","282701026_Real_or_imaginary_The_effectiveness_of_using_personas_in_product_design","246361068_He_Inmates_are_Running_the_Asylum_hy_High_ech_Products_Drive_us_Crazy_and_How_to_Restore_the_Sanit","235700725_The_persona_lifecycle_keeping_people_in_mind_throughout_product_design","235700610_Why_Personas_Work_The_Psychological_Evidence","228594908_Personas_Participatory_Design_and_Product_Development_An_Infrastructure_for_Engagement","222534148_Scenarios_in_user-centred_design-Setting_the_stage_for_reflection_and_action"]}