{"id":"262494609_Prospective_ergonomics_Origin_goal_and_prospects","abstract":"Abstract. So far ergonomics has been concerned with two categories of activities: correction and design. We propose to add a third category: prospection, and by so doing, we introduce a new series of activities that opens up the future of ergonomics. Corrective ergonomics relates to the past and comes with a demand and a client. It is turned towards the correction of existing situations and aims to reduce or eliminate problems. Here, after delimiting and defining the problem, the challenge is to find the best solution. Ergonomics for design relates to the present and also comes with a demand and a client. It is turned towards the design of new artefacts that have already been identified by a client, and that will allow users to do some activity and attain their goals. Here, after defining the scope of the project and the functional requirements, the challenge is to do the best design. Finally, prospective ergonomics relates to the future and does not come with a demand and a client. It is turned towards the creation of future things that have not been identified yet. Here the challenge is to detect existing user needs or anticipate future ones, and imagine solutions. These three categories of activities overlap and are not exclusive of each other. In this paper we define prospective ergonomics and compare it with corrective ergonomics and ergonomics for design. We describe its origin, goal, and prospects, we analyze its impacts on education and practice, and we emphasize the need of new collaboration between ergonomics and other disciplines.","authors":["Eric Brangier","Jean-Marc-Robert"],"meta":["February 2012Work 41(1):5235-5242","DOI:10.3233/WOR-2012-0012-5235","Project: Prospective ergonomics"],"references":["240978676_La_methode_des_staffs_d'experts_de_communautes_Orientation_theorique_demarche_methodologique_et_application_pratique","235292060_Introducing_a_classification_framework_for_prospective_methods","228369140_Challenges_for_corporate_foresight_Towards_strategic_prospective_through_scenario_thinking","330310611_Persona_A_Method_to_Produce_Representations_Focused_on_Consumers'_Needs","280939853_Creativity_As_an_Exact_Science","278102813_Anticipating_needs_and_designing_new_items_rapidly_-_A_case_study_for_the_design_of_postural_aid_equipment","274979204_Ergonomic_Design_by_Means_of_Human_Models","242375629_Technology_futures_analysis_Toward_integration_of_the_field_and_new_methods_Technology_Futures_Analysis_Methods_Working_Group","240173987_Scenarios_to_challenge_strategic_paradigms_Lessons_from_2025","224927651_The_Design_of_Future_Things"]}