{"id":"262403418_Dual_Techniques_for_Scheduling_on_a_Machine_with_Varying_Speed","abstract":"We study scheduling problems on a machine of varying speed. Assuming a known speed function (given through an oracle) we ask for a cost-efficient scheduling solution. Our main result is a PTAS for minimizing the total weighted completion time on a machine of varying speed. This implies also a PTAS for the closely related problem of scheduling to minimize generalized global cost functions. The key to our results is a re-interpretation of the problem within the well-known two-dimensional Gantt chart: instead of the standard approach of scheduling in the time-dimension, we construct scheduling solutions in the weight-dimension.\nWe also consider a dynamic problem variant in which deciding upon the speed is part of the scheduling problem and we are interested in the tradeoff between scheduling cost and speed-scaling cost, which is typically the energy consumption. We obtain two insightful results: (1) the optimal scheduling order is independent of the energy consumption and (2) the problem can be reduced to the setting where the speed of the machine is fixed, and thus admits a PTAS.","authors":["Nicole Megow","José Verschae"],"meta":["July 2013","DOI:10.1007/978-3-642-39206-1_63","Conference: Proceedings of the 40th international conference on Automata, Languages, and Programming - Volume Part I"],"references":["260349326_Universal_Sequencing_on_an_Unreliable_Machine","331862927_Energy-efficient_algorithms_for_flow_time_minimization","285769453_Machine_scheduling_with_an_availability_constraints","281222307_Machine_scheduling_with_availability_constraints","280707315_Two-dimensional_gantt_charts_and_a_scheduling_algorithm_of_lawler","266213279_The_NP-hardness_of_the_single_machine_common_due_date_weighted_tardiness_problem","262253012_On_the_Performance_of_Smith's_Rule_in_Single-Machine_Scheduling_with_Nonlinear_Cost","261080922_Energy_Aware_Scheduling_for_Unrelated_Parallel_Machines","234005171_Energy_in_computing_systems_with_speed_scaling_optimization_andmechanisms_design","228057587_Approximation_Schemes_for_Minimizing_Average_Weighted_Completion_Time_with_Release_Dates"]}