{"id":"262400261_Evolutionary-computer-assisted_design_of_image_operators_that_detect_interest_points_using_genetic_programming","abstract":"This work describes a way of designing interest point detectors using an evolutionary-computer-assisted design approach. Nowadays, feature extraction is performed through the paradigm of interest point detection due to its simplicity and robustness for practical applications such as: image matching and view-based object recognition. Genetic programming is used as the core functionality of the proposed human-computer framework that significantly augments the scope of interest point design through a computer assisted learning process. Indeed, genetic programming has produced numerous interest point operators, many with unique or unorthodox designs. The analysis of those best detectors gives us an advantage to achieve a new level of creative design that improves the perspective for human-machine innovation. In particular, we present two novel interest point detectors produced through the analysis of multiple solutions that were obtained through single and multi-objective searches. Experimental results using a well-known testbed are provided to illustrate the performance of the operators and hence the effectiveness of the proposal.","authors":["Gustavo Olague","Leonardo Trujillo"],"meta":["June 2011Image and Vision Computing 29(7):484-498","DOI:10.1016/j.imavis.2011.03.004","SourceDBLP","Projects: Evolutionary Computer VisionEvolutionary Computation for Image Processing and AnalysisBrain programming"],"references":["255619921_Object_Categorization_Computer_and_Human_Vision_Perspectives","313706874_Adaptation_in_natural_and_artificial_systems","302560124_A_fast_elitist_multi-objective_genetic_algorithm_NSGA-II","292796591_Learning_OpenCV_Computer_vision_with_OpenCV_library","285784760_Strategies_for_the_Integration_of_EvolutionaryAdaptive_Search_with_the_Engineering_Design_Process","284652161_Object_recognition_using_local_characterization_and_semi-local_constraints","266532270_Shape_classification_and_analysis_Theory_and_practice","258654529_A_fast_operator_for_detection_and_precise_location_of_distinct_points_corners_and_circular_features","247935986_Computer_Vision_Algorithms_and_Applications","244959198_A_New_Approach_to_Low_Level_Image_Processing_Tech"]}