{"id":"262486785_Mathematiques_sciences_de_la_nature_la_singularite_physique_du_vivant","abstract":"2006, IX + 284 p. Francis Bailly et Giuseppe Longo sont tous deux cher-cheurs au CNRS ; le premier est physicien, le second, logicien et mathématicien. Leur ouvrage se compose d'un avant-propos, de sept chapitres, d'un appendice et d'une bibliographie. L'avant-propos ainsi qu'une grande partie des chapitres ont été écrits à deux. Certains chapitres du début de l'ouvrage, posant le problème et justifiant la rencontre des deux chercheurs autour de probléma-tiques communes, ont été signés soit par l'un, soit par l'autre. Quelques chapitres, enfin, sont des reprises re-maniées d'articles parus dans des revues ou des actes de colloques. Disons-le tout net : ce livre nous propose un grand bol d'air et des perspectives inédites ! À celui qui le feuillette rapidement, il peut apparaître comme un ouvrage de bio-logie théorique. En réalité, les thèmes abordés concernent tout aussi directement les modélisateurs en sciences de la vie, en sciences de l'environnement ou des anthropo-systèmes. Et on aurait tort de laisser passer cet ouvrage à côté des débats qui animent les colonnes de Natures Sciences Sociétés. Sa densité et parfois sa technicité mathé-matique pourraient cependant rebuter. Sans prétendre épuiser sa richesse, ce compte rendu s'organisera en quatre points qui ne suivront pas exactement le cours des chapitres. Premier point : la question centrale. Les auteurs se situent dans le cadre d'une réflexion technique et épisté-mologique sur le rapport entre biologie et mathématiques. La question est celle-ci : Comment se fait-il que le rapport entre mathématiques et physique soit organique, alors que la biologie mathématisée reste encore balbutiante et prend seulement la forme de modélisations ou même de simulations informatiques plus que de constructions in-séparablement conceptuelles et mathématiques ? Tout en plaidant pour une innovation mathématique en direction de la biologie, cet ouvrage donne des outils précis pour comprendre tout l'apport, mais aussi certaines des limites, des modèles assistés par ordinateur, plus précisément par l'ordinateur tel qu'il est conçu, construit et utilisé aujourd'hui.","authors":["F Bailly","Giuseppe Longo"],"meta":["January 2006","Publisher: Hermann"],"references":[]}