{"id":"262487366_Optimization_of_Information_Retrieval_for_Cross_Media_contents_in_a_Best_Practice_Network","abstract":"Recent challenges in information retrieval are related to cross media information in social networks including rich media and web based content. In those cases, the cross media content includes classical file and their metadata plus web pages, events, blog, discussion forums, comments in multilingual. This heterogeneity creates large complex problems in cross media indexing and retrieval for services that integrate qualified documents and user generated content together. Problems are also related to scalability, robustness and resilience to errors. Moreover, users expect to have fast and efficient indexing and searching services, from social media in best practice network services. This paper presents a model and an indexing and searching solution for cross media contents, addressing the above issues, developed for the ECLAP Social Network, in the domain of Performing Arts. Effectiveness and optimization analysis of the retrieval solution are presented with relevant metrics. The research aimed to cope with the complexity of a heterogeneous indexing semantic model, using stochastic optimization techniques, with tuning and discrimination of relevant metadata terms. The research was conducted in the context of the ECLAP European Commission project and services (http:// www. eclap. eu).","authors":["Paolo Nesi","Daniele Cenni","Pierfrancesco Bellini"],"meta":["September 2014International Journal of Multimedia Information Retrieval 3(3)","DOI:10.1007/s13735-014-0058-8"],"references":["257315251_A_New_Generation_Digital_Content_Service_for_Cultural_Heritage_Institutions","336387332_Using_Genetic_Algorithms_for_Query_Reformulation","315615465_Research_Results_in_Dynamic_Taxonomy_and_Faceted_Search_Systems","313558294_Literature_review_of_cross_language_information_retrieval","312447838_Query_Improvement_in_Information_Retrieval_Using_Genetic_Algorithms_-_A_Report_on_the_Experiments_of_the_TREC_Project","308161218_Introduction_to_information_retrieval_chapt","301222514_Modern_Information_Retrieval","290311739_A_Linked_Open_Data_Service_for_Performing_Arts","276935841_Introduction_to_Information_Retrieval","269953350_WordNet_An_Electronic_Lexical_Database"]}