{"id":"262559527_Utility_Proportional_Fairness_Resource_Allocation_with_Carrier_Aggregation_in_4G-LTE","abstract":"In this paper, we consider a resource allocation optimization problem with carrier aggregation in fourth generation long term evolution (4G-LTE). In our proposed model, each user equipment (UE) is assigned a utility function that represents the application type running on the UE. Our objective is to allocate the resources from two carriers to each user based on its application that is represented by the utility function assigned to that user. We consider two groups of users, one with elastic traffic and the other with inelastic traffic. Each user is guaranteed a minimum resource allocation. In addition, a priority resource allocation is given to the UEs running adaptive real time applications. We prove that the optimal rate allocated to each UE by the single carrier resource allocation optimization problem is equivalent to the aggregated optimal rates allocated to the same user by the primary and secondary carriers when their total resources is equivalent to the single carrier resources. Our goal is to guarantee a minimum quality of service (QoS) that varies based on the user application type. We present a carrier aggregation rate allocation algorithm to allocate two carriers resources optimally among users. Finally we present simulation results with the carrier aggregation rate allocation algorithm.","authors":["Haya Jamal Shajaiah","Ahmed Abel-Hadi","Charles Clancy"],"meta":["November 2013","DOI:10.1109/MILCOM.2013.77","Conference: MilcomAt: San Diego, CA"],"references":["220144434_Carrier_Aggregation_for_LTE-Advanced_Mobile_Communication_Systems","3335108_Downlink_Power_Allocation_for_Multi-Class_Wireless_Systems","2502252_Rate_Control_for_Communication_NetworksShadow_Prices_Proportional_Fairness_and_Stability","269311580_A_utility_proportional_fairness_approach_for_resource_allocation_in_4G-LTE","261386431_Utility-proportional_fairness_in_wireless_networks","224132078_Resource_Allocation_Considerations_for_Multi-Carrier_LTE-Advanced_Systems_Operating_in_Backward_Compatible_Mode"]}