{"id":"262567786_Spatial_Modulation_for_Generalized_MIMO_Challenges_Opportunities_and_Implementation","abstract":"A key challenge of future mobile communication research is to strike an attractive compromise between wireless network's area spectral efficiency and energy efficiency. This necessitates a clean-slate approach to wireless system design, embracing the rich body of existing knowledge, especially on multiple-input-multiple-ouput (MIMO) technologies. This motivates the proposal of an emerging wireless communications concept conceived for single-radio-frequency (RF) large-scale MIMO communications, which is termed as SM. The concept of SM has established itself as a beneficial transmission paradigm, subsuming numerous members of the MIMO system family. The research of SM has reached sufficient maturity to motivate its comparison to state-of-the-art MIMO communications, as well as to inspire its application to other emerging wireless systems such as relay-aided, cooperative, small-cell, optical wireless, and power-efficient communications. Furthermore, it has received sufficient research attention to be implemented in testbeds, and it holds the promise of stimulating further vigorous interdisciplinary research in the years to come. This tutorial paper is intended to offer a comprehensive state-of-the-art survey on SM-MIMO research, to provide a critical appraisal of its potential advantages, and to promote the discussion of its beneficial application areas and their research challenges leading to the analysis of the technological issues associated with the implementation of SM-MIMO. The paper is concluded with the description of the world's first experimental activities in this vibrant research field.","authors":["Marco Di Renzo","Harald Haas","Ali Ghrayeb","Shinya Sugiura"],"meta":["January 2014Proceedings of the IEEE 102(1):56-103","DOI:10.1109/JPROC.2013.2287851"],"references":["299427507_Structured_Dispersion_Matrices_From_Division_Algebra_Codes_for_Space-Time_Shift_Keying","313629843_Cisco_Visual_Networking_Index_Global_Mobile_Data_Traffic_Forecast_Update_2014-2019","295665295_An_Introduction_to_Millimeter-Wave_Mobile_Broadband_Systems","286734649_Optical_spatial_pulse_position_amplitude_modulation_over_atmospheric_turbulence_channels","279832342_Spatially-Averaging_Channel_Estimation_for_Spatial_Modulation","278745816_Spatial_Modulation_for_MIMO_Wireless_Systems","278745379_On_the_Performance_of_SSK_Modulation_over_Multiple-Access_Rayleigh_Fading_Channels_IEEE_Global_Communications_Conference","278706438_MIMO_Communication_for_Cellular_Networks","278696790_Low_Power_Spatial_Modulation_Scheme_for_Wide_Band_Multiple_Input_and_Multiple_Output_Wireless_Communication_Systems","276198879_Fractional_Bit_Encoding_and_Data_Dependency_Check_Based_Low_Power_MIMO_Spatial_Modulator"]}