{"id":"262512084_Factores_asociados_al_rendimiento_academico_en_estudiantes_universitarios_desde_el_nivel_socioeconomico_Un_estudio_en_la_Universidad_de_Costa_Rica","abstract":"Recibido 6 de mayo de 2013 • Corregido 15 de julio de 2013 • Aceptado 31 de julio de 2013Por ser el desempeño académico de la población estudiantil en la educación superior uno de los indicadores de calidad más sobresalientes y trascendentales de la labor académica del sistema de educación superior, se realiza una investigación de corte cuantitativa, en la cual se trabaja con una cohorte de estudiantes universitarios en la educación superior, específicamente en la Universidad de Costa Rica, que en el momento del estudio se encontraban graduados o en los últimos años de su carrera, se les aplicó un cuestionario en forma personalizado. El estudio indaga el tema de los factores asociados al rendimiento académico desde el nivel socioeconómico en estudiantes universitarios y su objetivo general consiste en analizar los factores asociados al rendimiento académico en estudiantes que, por su condición socioeconómica, se les asignó la máxima categoría de beca, y estudiantes que no solicitaron beca por esta condición de carreras de alta y baja demanda de la Universidad de Costa Rica. De esta forma, se aborda la problemática del rendimiento académico, desde el nivel socioeconómico de sus estudiantes, esta variable se considera de importancia para ofrecer un marco explicativo y proporcionar insumos a las políticas institucionales en el campo de la educación superior pública. El estudio permitió ratificar que el rendimiento académico es altamente multicausal y complejo; es el producto de la interacción de múltiples factores sociales, personales, institucionales-académicos que pueden variar de una población a otra, así como la existencia de diferencias significativas entre las variables lineales: índice de satisfacción universitaria, índice de hábitos de estudio, índice de apoyo en los estudios universitarios, índice de satisfacción con los profesores e índice de nivel socioeconómico; sin embargo, se mostró que no producen diferencias en las variables más importantes, como lo son el promedio ponderado y la nota de admisión.","authors":["Guiselle María Garbanzo Vargas"],"meta":["December 2013Revista Electrónica Educare 17(3):57-87","DOI:10.15359/ree.17-3.4"],"references":[]}