{"id":"262604315_Approximate_and_Multipartite_Quantum_Correlation_Communication_Complexity","abstract":"The concepts of quantum correlation complexity and quantum communication complexity were recently proposed to quantify the minimum amount of resources needed in generating bipartite classical or quantum states in the single-shot setting. The former is the minimum size of the initially shared state \\({\\sigma}\\) on which local operations by the two parties (without communication) can generate the target state \\({\\rho}\\), and the latter is the minimum amount of communication needed when initially sharing nothing. In this paper, we generalize these two concepts to multipartite cases, for both exact and approximate state generation. Our results are summarized as follows.\n1.\nFor multipartite pure states, the correlation complexity can be completely characterized by local ranks of sybsystems.\n2.\nWe extend the notion of PSD-rank of matrices to that of tensors, and use it to bound the quantum correlation complexity for generating multipartite classical distributions.\n3.\nFor generating multipartite mixed quantum states, communication complexity is not always equal to correlation complexity (as opposed to bipartite case). But they differ by at most a factor of 2. Generating a multipartite mixed quantum state has the same communication complexity as generating its optimal purification. But the correlation complexities of these two tasks can be different (though still related by less than a factor of 2).\n4.\nTo generate a bipartite classical distribution P(x, y) approximately, the quantum communication complexity is completely characterized by the approximate PSD-rank of P. The quantum correlation complexity of approximately generating multipartite pure states is bounded by approximate local ranks.","authors":["Rahul Jain","Zhaohui Wei","Penghui Yao","Shengyu Zhang"],"meta":["March 2017computational complexity 26(1)","DOI:10.1007/s00037-016-0126-y","SourcearXiv"],"references":["220679095_The_communication_complexity_of_correlation","220138459_The_Communication_Complexity_of_Correlation","276534506_Exponential_Lower_Bounds_for_Polytopes_in_Combinatorial_Optimization","265354161_Communication_complexity_A_survey","260512729_Efficient_Protocols_for_Generating_Bipartite_Classical_Distributions_and_Quantum_States","250398372_Nonnegative_matrix_factorization_and_applications","234828972_Lower_bounds_for_non-commutative_computation","223030131_Expressing_combinatorial_optimization_problems_by_Linear_Programs","221591539_Expressing_Combinatorial_Optimization_Problems_by_Linear_Programs_Extended_Abstract","221590219_Lower_Bounds_for_Non-Commutative_Computation_Extended_Abstract","51951884_Linear_vs_Semidefinite_Extended_Formulations_Exponential_Separationand_Strong_Lower_Bounds","4257934_The_Communication_Complexity_of_Correlation","200524403_Quantum_Computation_and_Quantum_Information","48173570_Quantum_Strategic_Game_Theory","24061019_The_Approximation_of_One_Matrix_by_Another_of_Lower_Rank"]}