{"id":"262642236_Human_Resource_Information_Systems_HRIS_in_HR_Planning_and_Development_in_Mid_to_Large_Sized_Organizations","abstract":"The role of HRM has changed altogether from a traditional (popularly called personnel management) to a strategic one. Most medium and large scale organisations spend large amounts of money and reserves on HR software, but unfortunately many of them utilise it only for HR administrative purposes rather than for effective and efficient human resource planning (true HRP). This study aims to explore the extent of usage of a Human Resource Information System (HRIS) in mid to large sized organizations and the advantages they derive from the implementation of the same in the Human Resource Planning (HRP) sub-functions. HRIS outline the integration between Human Resource Management (HRM) and Information Technology (Gerardine deSanctis, 1986). Primary data was collected by means of questionnaires from 50 senior and junior HR executives/managers in three organizations in Pune. It was found that the greatest uses of HRIS were its contribution to the efficiency and effectiveness of HR planning through HRIS skills’ inventory, HRIS training needs analysis, HRIS succession planning and HRIS labour demand and supply analysis. Results showed that identification of unfilled job positions accurately is the most frequently accepted HRIS feature. Organisations can record good HR planning efficiency and effectiveness if HRIS aligns with information system strategy and HR strategy. Organisations need to integrate HRIS functions with other business functions. The study revealed that HRIS needs to offer more intelligent capabilities to increase the effectiveness of HR planning.","authors":["Asha Nagendra","Mohit Deshpande"],"meta":["May 2014Procedia - Social and Behavioral Sciences 133:61–67","DOI:10.1016/j.sbspro.2014.04.169"],"references":["254858551_Does_e-HRM_contribute_to_HRM_Effectiveness_Results_from_a_quantitative_study_in_a_Dutch_Ministry","247615648_New_directions_in_the_roles_and_responsibilities_of_the_HRM_function","313550025_Human_Resource_Information_Systems","257929914_Human_Resource_Management","254578981_Linking_the_MIS_Plan_with_Corporate_Strategy_An_Exploratory_Study","254187659_Reconceptualising_Absorptive_Capacity_to_Explain_the_E-Enablement_of_the_HR_Function_E-HR_in_Organizations","249633201_The_adoption_and_diffusion_of_human_resources_information_systems_in_Singapore","242055264_Project_social_capital_leadership_and_trust_A_study_of_human_resource_information_systems_development","235290847_Human_resource_information_systems_A_review_and_empirical_analysis","235290762_Training_and_development_needs_assessment_A_practical_model_for_partner_institutes"]}