{"id":"262668753_Informatica_en_la_salud_publica_cubana","abstract":"A historical review of the most important events in the development of informatics in the healthcare sector was made with a view to contributing to the general culture of the workers in this sector, and particularly of those involved in the study of this discipline. It is interesting to underline that since the first years of the Cuban revolution, the study and processing of the vital health events was a political strategy of interest for the revolutionary government and the Ministry of Public Health as well. At the very beginning, the data processing was manually made and later IBM equipment-assisted. Some years afterwards, the first Cuban minicomputers (CID) were introduced and the first computer center for public healthcare was built in the Oncology and Radiobiology Institute. In 1992, Telematics Network of Health of Cuba (INFOMED)was in operation within the structure of the National Center of Medical Information, which made it possible to link the whole health system to give a more efficient response in the field of scientific information. At present, there is a comprehensive work on a group of basic applications of technological development including close cooperation with other sectors, and it is just this integration that allows us to speak about informatization of the Cuban healthcare sector. Projects based on new Internet technologies, free software and other options that assure integrated compatible operation are being worked on. They will be implemented using the Telematics Network of Health of Cuba","authors":["Ariel Delgado","María Vidal Ledo"],"meta":["September 2006Revista Cubana de Salud Publica 32(3)","Project: Indicadores de desempeño hospitalario"],"references":["28803822_Informatizacion_de_la_red_de_bibliotecas_de_las_unidades_de_la_atencion_primaria_en_Cuba","28802401_El_Localizador_de_Informacion_de_Salud_como_herramienta_para_gerenciar_los_recursos_de_informacion_en_Cuba","28802259_Las_redes_de_computadoras_al_servicio_de_la_bibliotecologia_medica_INFOMED_una_experiencia_cubana","266883630_Conferencia_a_los_estudiantes_de_la_Facultad_de_Tecnologia","262481462_Educacion_a_distancia","51042124_A_Case_Analysis_of_INFOMED_The_Cuban_National_Health_Care_Telecommunications_Network_and_Portal","28803914_Tele-educacion_y_tele-salud_en_Cuba_mucho_mas_que_desarrollo_tecnologico","7195066_A_case_analysis_of_INFOMED_The_Cuban_National_Health_Care_Telecommunications_Network_and_Portal"]}