{"id":"262787471_Co-Occurring_Gland_Angularity_in_Localized_Subgraphs_Predicting_Biochemical_Recurrence_in_Intermediate-Risk_Prostate_Cancer_Patients","abstract":"Quantitative histomorphometry (QH) refers to the application of advanced computational image analysis to reproducibly describe disease appearance on digitized histopathology images. QH thus could serve as an important complementary tool for pathologists in interrogating and interpreting cancer morphology and malignancy. In the US, annually, over 60,000 prostate cancer patients undergo radical prostatectomy treatment. Around 10,000 of these men experience biochemical recurrence within 5 years of surgery, a marker for local or distant disease recurrence. The ability to predict the risk of biochemical recurrence soon after surgery could allow for adjuvant therapies to be prescribed as necessary to improve long term treatment outcomes. The underlying hypothesis with our approach, co-occurring gland angularity (CGA), is that in benign or less aggressive prostate cancer, gland orientations within local neighborhoods are similar to each other but are more chaotically arranged in aggressive disease. By modeling the extent of the disorder, we can differentiate surgically removed prostate tissue sections from (a) benign and malignant regions and (b) more and less aggressive prostate cancer. For a cohort of 40 intermediate-risk (mostly Gleason sum 7) surgically cured prostate cancer patients where half suffered biochemical recurrence, the CGA features were able to predict biochemical recurrence with 73% accuracy. Additionally, for 80 regions of interest chosen from the 40 studies, corresponding to both normal and cancerous cases, the CGA features yielded a 99% accuracy. CGAs were shown to be statistically signicantly ([Formula: see text]) better at predicting BCR compared to state-of-the-art QH methods and postoperative prostate cancer nomograms.","authors":["George Lee","Rachel Sparks","Sahirzeeshan Ali","Natalie N C Shih"],"meta":["May 2014PLoS ONE 9(5):e97954","DOI:10.1371/journal.pone.0097954","SourcePubMed"],"references":["302341151_Textural_Features_for_Image_Classification","237077465_Co-occurring_Gland_Tensors_in_Localized_Cluster_Graphs_Quantitative_Histomorphometry_for_Predicting_Biochemical_Recurrence_for_Intermediate_Grade_Prostate_Cancer","236848340_Cell_Cluster_Graph_for_Prediction_of_Biochemical_Recurrence_in_Prostate_Cancer_Patients_from_Tissue_Microarrays","344046749_Biochemical_Prostate_Specific_Antigen_Recurrence_Probability_Following_Radical_Prostatectomy_for_Clinically_Localized_Prostate_Cancer","293277290_Quantitative_grading_of_tissue_and_nuclei_in_prostate_cancer_for_prognosis_prediction","289934158_Biochemical_Prostate_Specific_Antigen_Recurrence_Probability_Following_Radical_Prostatectomy_for_Clinically_Localized_Prostate_Cancer","288906520_Random_forests","258304769_Machine_Learning_Volume_45_Number_1_-_SpringerLink","246972578_Non_Parametric_Estimation_From_Incomplete_Observation","246512707_Interobserver_reproducibility_of_Gleason_grading_of_prostatic_carcinoma"]}