{"id":"262766809_Supporting_Queries_and_Analyses_of_Large-Scale_Social_Media_Data_with_Customizable_and_Scalable_Indexing_Techniques_over_NoSQL_Databases","abstract":"Social media data analysis demonstrates two special characteristics in Big Data processing. First, most analyses focus on data subsets related to specific social events or activities instead of the whole dataset. Second, analysis workflows consist of multiple stages, and algorithms applied in each stage may use different computation and communication patterns depending on processing frameworks. This paper presents our efforts in supporting the data storage and processing requirements for such characteristics. To achieve efficient queries about target data subsets, we propose a general customizable and scalable indexing framework that can be built over distributed NoSQL databases. This framework allows users to define suitable customized index structures for their query patterns against social media data, and supports scalable indexing of both historical and streaming data. We implement this framework on HBase, and name it IndexedHBase. Starting from IndexedHBase, we build a distributed analysis stack based on YARN to support analysis algorithms using different processing frameworks, such as Hadoop MapReduce, Harp, and Giraph. This analysis stack is used to host the Truthy social media data observatory, and we have applied the customized index structures in supporting both query evaluation and sophisticated analysis algorithms. Performance tests show that our solutions outperform implementations using both direct raw data scans and current indexing mechanisms in existing NoSQL databases.","authors":["Xiaoming Gao","Judy Qiu"],"meta":["May 2014","DOI:10.1109/CCGrid.2014.57","Conference: 14th IEEE/ACM International Symposium on Cluster, Cloud and Grid Computing (CCGrid 2014)At: Chicago, IL, USAVolume: Doctoral Symposium"],"references":["262766974_Supporting_a_Social_Media_Observatory_with_Customizable_Index_Structures_-_Architecture_and_Performance","262766962_Social_Media_Data_Analysis_with_IndexedHBase_and_Iterative_MapReduce","262234317_Design_and_prototyping_of_a_social_media_observatory","259208572_More_Tweets_More_Votes_Social_Media_as_a_Quantitative_Indicator_of_Political_Behavior","237018316_The_Digital_Evolution_of_Occupy_Wall_Street","301958626_Apache_hadoop_yarn_Yet_another_resource_negotiator","280292106_Hadoop","266653645_Eagle-eyed_elephant_Split-oriented_indexing_in_Hadoop","262241359_Apache_Hadoop_YARN_yet_another_resource_negotiator","256052806_More_Tweets_More_Votes_Social_Media_as_a_Quantitative_Indicator_of_Political_Behavior"]}