{"id":"262852991_A_Comparison_of_Continuous_Intravenous_Epoprostenol_Prostacyclin_With_Conventional_Therapy_for_Primary_Pulmonary_Hypertension","abstract":"Background. Primary pulmonary hypertension is a progressive disease for which no treatment has been shown in a prospective, randomized trial to improve survival. Methods. We conducted a 12-week prospective, randomized, multicenter open trial comparing the effects of the continuous intravenous infusion of epoprostenol (formerly called prostacyclin) plus conventional therapy with those of conventional therapy alone in 81 patients with severe primary pulmonary hypertension (New York Heart Association functional class III or IV). Results. Exercise capacity was improved in the 41 patients treated with epoprostenol (median distance walked in six minutes, 362 m at 12 weeks vs. 315 m at base line), but it decreased in the 40 patients treated with conventional therapy alone (204 m at 12 weeks vs. 270 m at base line; P<0.002 for the comparison of the treatment groups). Indexes of the quality of life were improved only in the epoprostenol group (P<0.01). Hemodynamics improved at 12 weeks in the epoprostenol-treated patients. The changes in mean pulmonary-artery pressure for the epoprostenol and control groups were -8 percent and +3 percent, respectively (difference in mean change, -6.7 mm Hg; 95 percent confidence interval, -10.7 to -2.6 mm Hg; P<0.002), and the mean changes in pulmonary vascular resistance for the epoprostenol and control groups were -21 percent and +9 percent, respectively (difference in mean change, -4.9 mm Hg per liter per minute; 95 percent confidence interval, -7.6 to -2.3 mm Hg per liter per minute; P<0.001). Eight patients died during the study, all of whom had been randomly assigned to conventional therapy (P=0.003). Serious complications included four episodes of catheter-related sepsis and one thrombotic event. Conclusions. As compared with conventional therapy, the continuous intravenous infusion of epoprostenol produced symptomatic and hemodynamic improvement, as well as improved survival in patients with severe primary pulmonary hypertension.","authors":["R. J. Barst","L. J. Rubin","W.A. Long","M.D. McGoon"],"meta":["May 1997ACC Current Journal Review 6(3)","DOI:10.1016/S1062-1458(97)89581-5"],"references":["227125654_An_adrenergic_participation_subserving_a_positive_inotropism_and_chronotropism_of_prostacyclin_on_isolated_rat_atria","22741555_Control_of_elevated_pulmonary_vascular_resistance_in_neonatal_swine_with_prostacyclin_PGI2","22055247_Sequential_Treatment_Assignment_with_Balancing_for_Prognostic_Factors_in_the_Controlled_Clinical_Trial_Pocock_SJ_Simon_R_Biometrics_1975_31_1_103_115_1023072529712_1100130","21554418_Complications_of_home_parenteral_nutrition","21228189_Infectious_complications_among_patients_receiving_home_intravenous_therapy_with_peripheral_central_or_peripherally_placed_central_venous_catheters","21197188_Single-lung_transplantation_for_pulmonary_hypertension_Three-month_hemodynamic_follow-up","21047813_Treatment_of_primary_pulmonary_hypertension_with_continuous_intravenous_prostacyclin_epoprostenol_Results_of_a_randomized_trial","20611245_Changes_in_Dyspnea-Fatigue_Ratings_As_Indicators_of_Quality_of_Life_in_the_Treatment_of_Congestive_Heart-Failure","19420595_The_case_for_treatment_of_selected_patients_with_primary_pulmonary_hypertension","16999197_Cytoprotective_effect_of_prostacyclin_and_protein_synthesis","16931793_Intravenous_infusion_of_prostacyclin_sodium_in_man_Clinical_effects_and_influence_on_platelet_adenosine_diphosphate_sensitivity_and_adenosine_3'5'-cyclic_monophosphate_levels"]}