{"id":"262805723_Software-Defined_Networking_A_Comprehensive_Survey","abstract":"Software-Defined Networking (SDN) is an emerging paradigm that promises to\nchange the state of affairs of current networks, by breaking vertical\nintegration, separating the network's control logic from the underlying routers\nand switches, promoting (logical) centralization of network control, and\nintroducing the ability to program the network. The separation of concerns\nintroduced between the definition of network policies, their implementation in\nswitching hardware, and the forwarding of traffic, is key to the desired\nflexibility: by breaking the network control problem into tractable pieces, SDN\nmakes it easier to create and introduce new abstractions in networking,\nsimplifying network management and facilitating network evolution. Today, SDN\nis both a hot research topic and a concept gaining wide acceptance in industry,\nwhich justifies the comprehensive survey presented in this paper. We start by\nintroducing the motivation for SDN, explain its main concepts and how it\ndiffers from traditional networking. Next, we present the key building blocks\nof an SDN infrastructure using a bottom-up, layered approach. We provide an\nin-depth analysis of the hardware infrastructure, southbound and northbounds\nAPIs, network virtualization layers, network operating systems, network\nprogramming languages, and management applications. We also look at cross-layer\nproblems such as debugging and troubleshooting. In an effort to anticipate the\nfuture evolution of this new paradigm, we discuss the main ongoing research\nefforts and challenges of SDN. In particular, we address the design of switches\nand control platforms -- with a focus on aspects such as resiliency,\nscalability, performance, security and dependability -- as well as new\nopportunities for carrier transport networks and cloud providers. Last but not\nleast, we analyze the position of SDN as a key enabler of a software-defined\nenvironment.","authors":["Diego Kreutz","Fernando M. V. Ramos","Paulo Veríssimo","Christian Esteve Rothenberg"],"meta":["June 2014Proceedings of the IEEE 103(1)","DOI:10.1109/JPROC.2014.2371999","SourcearXiv"],"references":["305787621_RFC7491_A_PCE-Based_Architecture_for_Application-Based_Network_Operations","318494191_RESTful_Web_Services","316858631_Fay_Extensible_Distributed_Tracing_from_Kernels_to_Clusters","316857231_B4_experience_with_a_globally-deployed_software_defined_wan","315311080_The_Cyber_Threat_Landscape_Challenges_and_Future_Research_Directions","313424004_Automated_and_scalable_QoS_control_for_network_convergence","308995228_NetVM_High_Performance_and_Flexible_Networking_using_Virtualization_on_Commodity_Platforms","308525529_Network_virtualization_in_multi-tenant_datacenters","303919383_Maxinet_Distributed_emulation_of_software-defined_networks","303151321_Network_virtualization_in_multi-tenant_datacenters"]}