{"id":"262881712_Analysis_of_Open_Access_Scholarly_Journals_in_Chemistry","abstract":"The present study has investigated the trends of open access journals appeared in the Directory of Open Access Journals (DOAJ). It provides an insight to the open access publishing in the field of chemistry based on the data collected from DOAJ. The DOAJ available at http://en.wikipedia.org/wiki/Website lists Open Access Journals and is maintained by Infrastructure Services for Open Access (IS4OA). Notably, it has listed about 9804 journals across 124 countries till 8th January 2014. Out of 9804 journals, 164 (1.67%) journals are listed under Chemistry. The data was extracted in excel format and analysis was carried out on the basis of subject coverage, decade and year, country of origin, publisher, language, format and Indian contribution to OA journals. The select subject i.e. Chemistry is being categorised into Chemistry General, Chemical Engineering, Analytical Chemistry, Organic Chemistry and Inorganic Chemistry. It was found that out of 164 journals from chemistry, majority of the open access journals belong to the category chemistry general and contribute some about 68.9% of the total chemistry journals in DOAJ. Though the maximum growth of these journals has been recorded in the decade 2000s, however in 2011, a record number of 30 journals of Chemistry appeared in DOAJ. Interestingly, India contributed 24 OA journals and is placed second after Egypt in publishing OA journals in chemistry. Further, it has been found that commercial publishers with 29 journals are the major contributors to OA in DOAJ with Hindawi Publishing Corporation as the leading contributor. Moreover, English has been found as the most popular language of OA journals. While as Indian Academy of Sciences: Chemical Sciences is reported to be the oldest journal publishing since 2005.","authors":["Faizul Nisha"],"meta":["June 2014Reflective Practice 2014(1)"],"references":["270439821_Analysis_of_Open_Access_Scholarly_Journals_in_Media_Communication","51042121_Open_Access_Journals_Knowledge_and_Attitudes_among_Cuban_Health_Researchers","44807347_Open_Access_To_The_Scientific_Journal_Literature_Situation_2009","289350053_Attitude_towards_the_use_of_open_access_scholarly_publications_The_position_of_LIS_lecturers_in_Southern_Nigeria","215993622_The_future_of_open_access_in_Croatia_A_survey_of_academic_and_research_libraries"]}