{"id":"262813340_Experimental_Evidence_of_Massive-Scale_Emotional_Contagion_Through_Social_Networks","abstract":"Emotional states can be transferred to others via emotional contagion, leading people to experience the same emotions without their awareness. Emotional contagion is well established in laboratory experiments, with people transferring positive and negative emotions to others. Data from a large real-world social network, collected over a 20-y period suggests that longer-lasting moods (e.g., depression, happiness) can be transferred through networks [Fowler JH, Christakis NA (2008) BMJ 337:a2338], although the results are controversial. In an experiment with people who use Facebook, we test whether emotional contagion occurs outside of in-person interaction between individuals by reducing the amount of emotional content in the News Feed. When positive expressions were reduced, people produced fewer positive posts and more negative posts; when negative expressions were reduced, the opposite pattern occurred. These results indicate that emotions expressed by others on Facebook influence our own emotions, constituting experimental evidence for massive-scale contagion via social networks. This work also suggests that, in contrast to prevailing assumptions, in-person interaction and nonverbal cues are not strictly necessary for emotional contagion, and that the observation of others' positive experiences constitutes a positive experience for people.","authors":["Adam D I Kramer","Jamie Guillory","Jeffrey T Hancock"],"meta":["June 2014Proceedings of the National Academy of Sciences 111(24)","DOI:10.1073/pnas.1320040111","SourcePubMed"],"references":["267325836_Primitive_emotional_contagion","230841708_A_61-Million-Person_Experiment_in_Social_Influence_and_Political_Mobilization","228650445_The_Development_and_Psychometric_Properties_of_LIWC2007","221513903_Upset_now_Emotion_contagion_in_distributed_groups","265843775_Emotional_Contagion","239761306_The_spread_of_emotion_via_Facebook","232568608_When_Small_Effects_are_Impressive","220538285_Hive_-_A_Warehousing_Solution_Over_a_Map-Reduce_Framework","200772575_A_Theory_of_Social_Comparison_Processes","51682789_Diurnal_and_Seasonal_Mood_Vary_with_Work_Sleep_and_Daylength_Across_Diverse_Cultures","46608952_Bad_Is_Stronger_than_Good","40685537_Distinguishing_Influence-Based_Contagion_From_Homophily-Driven_Diffusion_in_Dynamic_Networks","23571732_Dynamic_Spread_of_Happiness_in_a_Large_Social_Network_Longitudinal_Analysis_Over_20_Years_in_the_Framingham_Heart_Study","50382537_Alone_Together_Why_We_Expect_More_from_Technology_and_Less_From_Each_Other","41969463_Social_network_determinants_of_depression"]}