{"id":"262981640_Thirty-two_Years_of_Sahelian_Zone_Growing_Season_Non-Stationary_NDVI3g_Patterns_and_Trends","abstract":"We update the Global Inventory Modeling and Mapping Studies (GIMMS) analysis of Sahelian vegetation dynamics and trends using the normalized difference vegetation index (NDVI; version 3g) 1981 to 2012 data set. We compare the annual NDIV3g and July to October growing season averages with the three rainfall data sets: the Africa Rainfall Climatology from 1983 to 2012, the Variability Analyses of Surface Climate Observations Version-1.1 from 1951 to 2000, and the Nicholson ground-station precipitation rainfall data from 1981 to 1994. We use the Nicholson ground-station annual precipitation data to determine the reliability of the two continental precipitation data sets for specific locations and specific times, extrapolate these confirmed relationships over the Sahelian Zone from 1983 to 2012 with the Africa Rainfall Climatology, and then place these zonal findings within the 1951 to 2000 record of the Variability Analyses of Surface Climate Observations Version-1.1 precipitation data set. We confirm the extreme nature of the 1984-1985 Sahelian drought, a signature event that marked the minima during the 1980s desiccation period followed within ten years by near-maxima rainfall event in 1994 and positive departures is NDVI, marking beginning of predominantly wetter conditions that have persisted to 2012. We also show the NDVI3g data capture effective rainfall, the rainfall that is utilized by plants to grow, as compared to rainfall that evaporates or is runoff. Using our effective rainfall concept, we estimate average effective rainfall for the entire Sahelian Zone for the 1984 extreme drought was 223 mm/yr as compared to 406 mm/yr in during the 1994 wet period. We conclude that NDVI3g data can used as a proxy for analyzing and interpreting decadal-scale land surface variability and trends over semi arid-lands.","authors":["Assaf Anyamba","Jennifer Small","Compton J Tucker","Edwin W. Pak"],"meta":["March 2014Remote Sensing 6(4)","DOI:10.3390/rs6043101"],"references":["264382710_A_non-stationary_1981-2012_AVHRR_NDVI3g_time_series","258695460_EMD_Correction_of_Orbital_Drift_Artifacts_in_Satellite_Data_Stream","314714143_Applied_Regression_Analysis_Linear_Models_and_Related_Methods","288280973_Statistical_Summaries_of_Distributions","285808003_Canopy_reflectance_photosynthesis_and_transpiration","284967071_Sahel_West_Africa","271960450_The_Rangelands_of_the_Sahel","258794923_African_Rainfall_Climatology_Version_2_for_Famine_Early_Warning_Systems","255569496_The_Seasonal_Evolution_of_the_Atmospheric_Circulation_over_West_Africa_and_Equatorial_Africa","254894313_A_New_Monthly_Precipitation_Climatology_for_the_Global_Land_Areas_for_the_Period_1951_to_2000"]}