{"id":"262987677_Growth_rates_of_modern_science_A_bibliometric_analysis_based_on_the_number_of_publications_and_cited_references_Growth_Rates_of_Modern_Science_A_Bibliometric_Analysis_Based_on_the_Number_of_Publicatio","abstract":"Many studies in information science have looked at the growth of science. In this study, we re-examine the question of the growth of science. To do this we (i) use current data up to publication year 2012 and (ii) analyse it across all disciplines and also separately for the natural sciences and for the medical and health sciences. Furthermore, the data are analysed with an advanced statistical technique - segmented regression analysis - which can identify specific segments with similar growth rates in the history of science. The study is based on two different sets of bibliometric data: (1) The number of publications held as source items in the Web of Science (WoS, Thomson Reuters) per publication year and (2) the number of cited references in the publications of the source items per cited reference year. We have looked at the rate at which science has grown since the mid-1600s. In our analysis of cited references we identified three growth phases in the development of science, which each led to growth rates tripling in comparison with the previous phase: from less than 1% up to the middle of the 18th century, to 2 to 3% up to the period between the two world wars and 8 to 9% to 2012.","authors":["Lutz Bornmann","Ruediger Mutz"],"meta":["January 2014Journal of the Association for Information Science and Technology 66(11)","DOI:10.1002/asi.23329"],"references":["267221601_The_Piecewise_Regression_Model_as_a_Response_Modeling_Tool","260356989_What_is_social_impact_of_research_and_how_can_it_be_assessed_A_literature_survey","319352407_Aging_obsolescence_impact_growth_and_utilization_Definitions_and_relations","312428347_Science_Since_Babylon","292720591_The_growth_of_printed_literature_in_the_twentieth_century","287422776_Literature_dynamics_Studies_on_growth_diffusion_and_epidemics","286339824_Karl_Popper's_philosophy_of_science_Rationality_without_foundations","272561513_Fitting_Segmented_Regression_Models_by_Grid_Search","264516550_Scientific_communities_as_autopoietic_systems_The_reproductive_function_of_citations","261336926_Determining_juvenile-mature_wood_transition_in_Scots_pine_using_latewood_density"]}