{"id":"262940316_Predicting_Epileptic_Seizures_in_Advance","abstract":"Epilepsy is the second most common neurological disorder, affecting 0.6-0.8% of the world's population. In this neurological disorder, abnormal activity of the brain causes seizures, the nature of which tend to be sudden. Antiepileptic Drugs (AEDs) are used as long-term therapeutic solutions that control the condition. Of those treated with AEDs, 35% become resistant to medication. The unpredictable nature of seizures poses risks for the individual with epilepsy. It is clearly desirable to find more effective ways of preventing seizures for such patients. The automatic detection of oncoming seizures, before their actual onset, can facilitate timely intervention and hence minimize these risks. In addition, advance prediction of seizures can enrich our understanding of the epileptic brain. In this study, drawing on the body of work behind automatic seizure detection and prediction from digitised Invasive Electroencephalography (EEG) data, a prediction algorithm, ASPPR (Advance Seizure Prediction via Pre-ictal Relabeling), is described. ASPPR facilitates the learning of predictive models targeted at recognizing patterns in EEG activity that are in a specific time window in advance of a seizure. It then exploits advanced machine learning coupled with the design and selection of appropriate features from EEG signals. Results, from evaluating ASPPR independently on 21 different patients, suggest that seizures for many patients can be predicted up to 20 minutes in advance of their onset. Compared to benchmark performance represented by a mean S1-Score (harmonic mean of Sensitivity and Specificity) of 90.6% for predicting seizure onset between 0 and 5 minutes in advance, ASPPR achieves mean S1-Scores of: 96.30% for prediction between 1 and 6 minutes in advance, 96.13% for prediction between 8 and 13 minutes in advance, 94.5% for prediction between 14 and 19 minutes in advance, and 94.2% for prediction between 20 and 25 minutes in advance.","authors":["Negin Moghim","David Corne"],"meta":["June 2014PLoS ONE 9(6):e99334","DOI:10.1371/journal.pone.0099334","SourcePubMed"],"references":["341030574_Epilepsies_as_Dynamical_Diseases_of_Brain_Systems_Basic_Models_of_the_Transition_Between_Normal_and_Epileptic_Activity","310382187_Nonlinear_Times_sequence_Analysis","348868820_Signal_Processing_for_Communications","313386604_Libsvm_a_library_for_support_vector_machines","312538118_Support-vector_networks","310842623_A_practical_guide_to_support_vector_classification","307881957_LIBSVM_A_library_for_support_vector_machines","301233024_Characterization_of_Strange_Attractors","292745848_Pairwise_classification_and_support_vector_machines","288023219_A_Practical_Guide_to_Support_Vector_Classification"]}