{"id":"262951110_Centralized_Timestamp_based_Approach_for_Wireless_Sensor_Networks","abstract":"Sensor Network has gained the reputation of becoming the most promising technology of 21st century due to its low cost and ability to traverse longer distances in unattended hostile environments. However, security has still remained a burning and an unresolved issue for both centralized and decentralized wireless sensor networks. Using rigorous theoretical and practical analysis, we have traced numerous security challenges, security attacks and have designed an efficient timestamp-based protocol called “SET-CTA” to provide defense against variety of security attacks in non-clustered wireless sensor deployment environments. Previously proposed TESLA and 𝜇-TESLA [40] schemes were limited in scope; those schemes were only able to provide protection against basic security attacks like non-repudiation. But SETCTA scheme gives a flexibility to provide protection against numerous security attacks like (eg eavesdropping, node capture, man in the middle attack, con-currency attacks, trust attacks and many more [40]) by considering various timestamp based parameters like current-timestamp, sending time-stamp, timestamp-difference (Δt) etc. To the best of my knowledge, this is the only end-to-end timestamp based scheme that can provide secure and efficient transmission in centralized wireless sensor environments and can also assure protection against different range of security attacks.","authors":["K. H. Wandra","Sharnil Pandya"],"meta":["March 2014International Journal of Computer Applications 91(2)","DOI:10.5120/15853-4752"],"references":["305265761_A_Survey_on_Threats_and_Security_schemes_in_Wireless_Sensor_Networks","261486307_Computational_intelligence_based_optimization_in_wireless_sensor_network","313601763_On-lineoff-line_digital_signatures","307632417_Identity_Based_Cryptosystems_and_Signature_Scheme_In_G_R_Blakley_and_David_Chaum_Eds","303436443_Ad_hoc_sensor_networks_Theory_and_applications","296668244_Wireless_Sensor_Network_Security","261567116_Secure_and_Efficient_Data_Transmission_for_Cluster-Based_Wireless_Sensor_Networks","261305639_Issues_of_Trust_Management_for_Mobile_Wireless_Sensor_Networks","252039030_Design_of_Security_Gateway_Based_on_Chaotic_Encryption","241190902_A_robust_key_predistribution_scheme_for_wireless_sensor_networks"]}