{"id":"262996281_Lattice_Gauge_Tensor_Networks","abstract":"We present a unified framework to describe lattice gauge theories by means of tensor networks: this framework is efficient as it exploits the high amount of local symmetry content native of these systems describing only the gauge invariant subspace. Compared to a standard tensor network description, the gauge invariant one allows to speed-up real and imaginary time evolution of a factor that is up to the square of the dimension of the link variable. The gauge invariant tensor network description is based on the quantum link formulation, a compact and intuitive formulation for gauge theories on the lattice, and it is alternative and can be combined with the global symmetric tensor network description. We present some paradigmatic examples that show how this architecture might be used to describe the physics of condensed matter and high-energy physics systems. Finally, we present a cellular automata analysis which estimates the gauge invariant Hilbert space dimension as a function of the number of lattice sites and that might guide the search for effective simplified models of complex theories.","authors":["Pietro Silvi","Enrique Rico Ortega","Tommaso Calarco","Simone Montangero"],"meta":["March 2014New Journal of Physics 16(10)","DOI:10.1088/1367-2630/16/10/103015","Project: Quantum Technologies for Lattice Gauge Theories"],"references":["262974410_Interfaces_Strings_and_a_Soft_Mode_in_the_Square_Lattice_Quantum_Dimer_Model","261799378_Quantum_Spin-Ice_and_Dimer_Models_with_Rydberg_Atoms","261606189_Constrained_Dynamics_via_the_Zeno_Effect_in_Quantum_Simulation_Implementing_Non-Abelian_Lattice_Gauge_Theories_with_Cold_Atoms","259441415_Matrix_Product_States_for_Gauge_Field_Theories","259240023_Tensor_Networks_for_Lattice_Gauge_Theories_and_Atomic_Quantum_Simulation","303436280_Lattice_Methods_for_Quantum_Chromodynamics","267652769_Lattice_Methods_for_Quantum_Chromodynamics","264908423_Lattice_gauge_theories_An_introduction_2nd_ed","260519889_Grassmann_Tensor_Renormalization_Group_Approach_to_One-Flavor_Lattice_Schwinger_Model","258843259_Field_Theories_of_Condensed_Matter_Physics"]}