{"id":"263069716_A_Variational_Approach_to_Remove_Outliers_and_Impulse_Noise","abstract":"We consider signal and image restoration using convex cost-functions composed of a non-smooth data-fidelity term and a smooth regularization term. We provide a convergent method to minimize such cost-functions. In order to restore data corrupted with outliers and impulsive noise, we focus on cost-functions composed of an 1 data-fidelity term and an edge-preserving regularization term. The analysis of the minimizers of these cost-functions provides a natural justification of the method. It is shown that, because of the 1 data-fidelity, these minimizers involve an implicit detection of outliers. Uncorrupted (regular) data entries are fitted exactly while outliers are replaced by estimates determined by the regularization term, independently of the exact value of the outliers. The resultant method is accurate and stable, as demonstrated by the experiments. A crucial advantage over alternative filtering methods is the possibility to convey adequate priors about the restored signals and images, such as the presence of edges. Our variational method furnishes a new framework for the processing of data corrupted with outliers and different kinds of impulse noise.","authors":["Mila Nikolova"],"meta":["January 2004Journal of Mathematical Imaging and Vision 20(1/2)","DOI:10.1023/B:JMIV.0000011920.58935.9c","Sourcedx.doi.org"],"references":["316594980_Handbook_of_Image_and_Video_Processing","286784019_Ill-posed_problems","286740252_Adaptive_impulse_detection_using_center-weighted_median_filters","281570260_Random_fields_and_inverse_problems_in_imaging_in_Ecole_d'ete_de_Probabilites_de_Saint-Flour_XVIII_-_1988","263047897_Convex_Analysis_and_Minimization_Algorithms_II","246970944_Nonlinear_nonsuperposal_methods_for_smoothing_data","246970649_Nonlinear_image_recovery_with_half-quadratic_regularization_and_FFT''s","243677785_Inverse_Problem_Theory_Methods_For_Data_Fitting_and_Model_Parameter_Estimation","243097607_Solutions_of_Ill-Posed_Problems_A_N_Tikhonov_and_V_Y_Arsenin","240355956_Towards_Bayesian_Image_Analysis"]}