{"id":"263056598_Manipulation_of_visual_biofeedback_during_gait_with_a_time_delayed_adaptive_Virtual_Mirror_Box","abstract":"Background\nA mirror placed in the mid-sagittal plane of the body has been used to reduce phantom limb pain and improve movement function in medical conditions characterised by asymmetrical movement control. The mirrored illusion of unimpaired limb movement during gait might enhance the effect, but a physical mirror is only capable of showing parallel movement of limbs in real time typically while sitting. We aimed to overcome the limitations of physical mirrors by developing and evaluating a Virtual Mirror Box which delays the mirrored image of limbs during gait to ensure temporal congruency with the impaired physical limb.\n\nMethods\nAn application was developed in the CAREN system’s D-Flow software which mirrors selected limbs recorded by real-time motion capture to the contralateral side. To achieve phase shifted movement of limbs during gait, the mirrored virtual limbs are also delayed by a continuously calculated amount derived from past gait events. In order to accommodate non-normal proportions and offsets of pathological gait, the movements are morphed so that the physical and virtual contact events match on the mirrored side. Our method was tested with a trans-femoral amputee walking on a treadmill using his artificial limb. Joint angles of the elbow and knee were compared between the intact and mirrored side using cross correlation, root mean squared difference and correlation coefficients.\n\nResults\nThe time delayed adaptive virtual mirror box produced a symmetrical looking gait of the avatar coupled with a reduction of the difference between the intact and virtual knee and elbow angles (10.86° and 5.34° reduced to 4.99° and 2.54° respectively). Dynamic morphing of the delay caused a non-significant change of toe-off events when compared to delaying by 50% of the previous gait cycle, as opposed to the initial contact events which showed a practically negligible but statistically significant increase (p < 0.05).\n\nConclusions\nAdding an adaptive time delay to the Virtual Mirror Box has extended its use to treadmill gait, for the first time. Dynamic morphing resulted in a compromise between mirrored movement of the intact side and gait events of the virtual limbs matched with physical events of the impaired side. Asymmetrical but repeatable gait is expected to provide even more faithful mirroring.","authors":["Gabor J Barton","Alan R De Asha","Edwin C.P. van Loon","Thomas Geijtenbeek"],"meta":["June 2014Journal of NeuroEngineering and Rehabilitation 11(1):101","DOI:10.1186/1743-0003-11-101","SourcePubMed"],"references":["251878110_A_real-time_system_for_biomechanical_analysis_of_human_movement_and_muscle_function","237545709_An_Investigation_into_the_performance_of_a_Virtual_Mirror_Box_for_the_treatment_of_Phantom_Limb_Pain_in_Amputees_using_Augmented_Reality_Technology","234166793_Whittle's_Gait_Analysis","42255453_The_Mirror_Box_Illusion_Effect_of_Visual_Information_on_Bimanual_Coordination_in_Children_with_Spastic_Hemiparetic_Cerebral_Palsy","297503420_International_Journal_of_Human-Computer_Interaction_Editorial","274619381_Development_of_a_virtual_mirror_box_for_spatial_and_temporal_manipulation_of_visual_feedback_on_body_movement_during_gait_A_technical_evaluation","254004727_D-Flow_Immersive_virtual_reality_and_real-time_feedback_for_rehabilitation","246379396_Variation_in_Phantom_Limb_Pain","227167264_A_marker_based_kinematic_method_of_identifying_initial_contact_during_gait_for_use_in_real-time_visual_feedback_applications","40729498_Effect_of_viewing_angle_on_arm_reaching_while_standing_in_a_virtual_environment_Potential_for_virtual_rehabilitation"]}