{"id":"263034896_Fast_calculation_with_point-based_method_to_make_CGHs_of_the_polygon_model","abstract":"Holography is one of the three-dimensional technology. Light waves from an object are recorded and reconstructed by using a hologram. Computer generated holograms (CGHs), which are made by simulating light propagation using a computer, are able to represent virtual object. However, an enormous amount of computation time is required to make CGHs. There are two primary methods of calculating CGHs: the polygon-based method and the point-based method. In the polygon-based method with Fourier transforms, CGHs are calculated using a fast Fourier transform (FFT). The calculation of complex objects composed of multiple polygons requires as many FFTs, so unfortunately the calculation time become enormous. In contrast, in the point-based method, it is easy to express complex objects, an enormous calculation time is still required. Graphics processing units (GPUs) have been used to speed up the calculations of point-based method. Because a GPU is specialized for parallel computation and CGH calculation can be calculated independently for each pixel. However, expressing a planar object by the point-based method requires a signi cant increase in the density of points and consequently in the number of point light sources. In this paper, we propose a fast calculation algorithm to express planar objects by the point-based method with a GPU. The proposed method accelerate calculation by obtaining the distance between a pixel and the point light source from the adjacent point light source by a difference method. Under certain speci ed conditions, the difference between adjacent object points becomes constant, so the distance is obtained by only an additions. Experimental results showed that the proposed method is more effective than the polygon-based method with FFT when the number of polygons composing an objects are high.","authors":["Yuki Ogihara","Tsubasa Ichikawa","Yuji Sakamoto"],"meta":["January 2014Proceedings of SPIE - The International Society for Optical Engineering 9006","DOI:10.1117/12.2039821"],"references":["227398438_Effective_memory_reduction_of_the_novel_look-up_table_with_one-dimensional_sub-principle_fringe_patterns_in_computer-generated_holograms","26686803_Computer_generated_hologram_with_geometric_occlusion_using_GPU-accelerated_depth_buffer_rasterisation_for_3D_display","10571736_Fast_calculation_method_for_optical_diffraction_on_tilted_planes_by_use_of_the_angular_spectrum_of_plane_waves","2766592_Interactive_Computation_of_Holograms_Using_a_Look-Up_Table","232272177_Fast_calculation_method_for_CGHs_using_spherical_pre-calculated_object_light","226201786_Fast_Computation_of_Fresnel_Holograms_Employing_Difference","44852813_Fast_calculation_of_computer-generated-hologram_on_AMD_HD5000_series_GPU_and_OpenCL","40443375_Fast_computation_method_for_a_Fresnel_hologram_using_three-dimensional_affine_transformations_in_real_space","5257950_Effective_generation_of_digital_holograms_of_three-dimensional_objects_using_a_novel_look-up_table_method"]}