{"id":"263020530_Quantum_randomness_extraction_for_various_levels_of_characterization_of_the_devices","abstract":"The amount of intrinsic randomness that can be extracted from measurement on quantum systems depends on several factors: notably, the power given to the adversary and the level of characterization of the devices of the authorized partners. After presenting a systematic introduction to these notions, in this paper we work in the class of least adversarial power, which is relevant for assessing setups operated by trusted experimentalists, and compare three levels of characterization of the devices. Many recent studies have focused on the so-called \"device-independent\" level, in which a lower bound on the amount of intrinsic randomness can be certified without any characterization. The other extreme is the case when all the devices are fully characterized: this \"tomographic\" level has been known for a long time. We present for this case a systematic and efficient approach to quantifying the amount of intrinsic randomness, and show that setups involving ancillas (POVMs, pointer measurements) may not be interesting here, insofar as one may extract randomness from the ancilla rather than from the system under study. Finally, we study how much randomness can be obtained in presence of an intermediate level of characterization related to the task of \"steering\", in which Bob's device is fully characterized while Alice's is a black box. We obtain our results here by adapting the NPA hierarchy of semidefinite programs to the steering scenario.","authors":["Yun Zhi Law","Le Phuc Thinh","Jean-Daniel Bancal","Valerio Scarani"],"meta":["December 2013"],"references":["261069214_Optimised_quantum_hacking_of_superconducting_nanowire_single-photon_detectors","260269232_Physical_Randomness_Extractors","260148062_A_universal_setup_for_active_control_of_a_single-photon_detector","260062095_Device-independent_randomness_extraction_for_arbitrarily_weak_min-entropy_source","259983706_Quantum_randomness_certified_by_the_uncertainty_principle","258203441_Full_randomness_from_arbitrarily_deterministic_events","256606289_More_Randomness_from_the_Same_Data","256606094_Using_complete_measurement_statistics_for_optimal_device-independent_randomness_evaluation","260022695_Robust_protocols_for_securely_expanding_randomness_and_distributing_keys_using_untrusted_quantum_devices","258555582_Certifiable_Quantum_Dice_-_Or_testable_exponential_randomness_expansion"]}