{"id":"263105247_Do_undergraduate_students_view_calculator_usage_as_a_proxy_for_learning_with_understanding","abstract":"The (limited) evidence about the largely procedural use of calculators as a substitute for mathematical thinking presented indicates that there might be a need to rethink how and when calculators may be used in mathematics classes. This is imperative so that the habitual use of calculators does not replace or erode basic or fundamental mathematical skills. Calculators provide optimum aid for mathematical learning when they \"release us from the drudgery of acquiring speed and accuracy in doing complicated calculations. They do not release us from the task of knowing what are the appropriate calculations to do, orwhether the answer makes sense\" (Skemp, 1989, p. 169). However, it appears that some students view the calculator as a way of bypassing the need for understanding or automacity development. These students probably see the calculator as a tool to use, ie., they are mathematical users instead of a device to learn mathematics with, ie, as mathematical learners (Hoyles & Noss, 2006). An alternative view of calculator use is that it promotes efficiency, ie, ability to obtain the right answer. In this case, it is important to point out that only 39% of the students obtained the correct answer when the question was initially presented during regular instruction (Figure 1). In conclusion, further research needs to be undertaken regarding the role that calculators play in enhancing student mathematical thinking skills, as opposed to their use for computational processing (NMAP-National Mathematics Advisory Panel, 2008, p. 24), in mathematics and allied subjects, such as engineering, economics, statistics, etc. Moreover, a relevant research investigation would be to evaluate whether there is a correlation between how and why students use calculators for problem solving and the type(s) of learning approaches that students adopt towards solving related mathematics problems with respect to the deep and surface learning theoretical framework (Biggs, 1999).","authors":["Samuel Olugbenga King","Carol Robinson"],"meta":["May 2012British Journal of Educational Technology 43(3)","DOI:10.1111/j.1467-8535.2012.01289.x"],"references":["345866570_Mathematics_in_the_Primary_School","251408399_What_can_digital_technologies_take_from_and_bring_to_research_in_mathematics_education","42788897_The_role_of_the_graphic_calculator_in_mediating_graphing_activity"]}