{"id":"263150657_Epistemological_Issues_Concerning_Computer_Simulations_in_Science_and_Their_Implications_for_Science_Education","abstract":"Computers and simulations represent an undeniable aspect of daily scientific life, the use of simulations being comparable to the introduction of the microscope and the telescope, in the development of knowledge. In science education, simulations have been proposed for over three decades as useful tools to improve the conceptual understanding of students and the development of scientific capabilities. However, various epistemological aspects that relate to simulations have received little attention. Although the absence of this discussion is due to various factors, among which the relatively recent interest in the analysis of longstanding epistemological questions concerning the use of simulations, the inclusion of this discussion on the research agenda in science education appears relevant, if we wish to educate scientifically literate students in a vision of the nature of science closer to the work conducted by researchers today. In this paper we review some contemporary thoughts emerging from philosophy of science about simulations in science and set out questions that we consider of relevance for discussion in science education, in particular related with model-based learning and experimental work.","authors":["Ileana María Greca","María Eugenia Seoane","Irene Arriassecq"],"meta":["April 2014Science & Education 23(4)","DOI:10.1007/s11191-013-9673-7"],"references":["292352441_Science_without_God","283630224_Learning_and_teaching_in_the_school_science_laboratory_An_analysis_of_research_theory_and_practice","346678208_Extending_Ourselves","341748588_Numerical_Linear_Algebra","330329322_Simulation_and_Its_Discontents","314830565_Using_Simulations_in_the_Middle_School_Does_Assertiveness_of_Dyad_Partners_Influence_Conceptual_Change","312894050_Positioning_Models_in_Science_Education_and_in_Design_and_Technology_Education","292253870_Inquiry_modeling_and_metacognition_Making_science_accessible_to_all_students","286420482_Creating_Cybernetic_and_Psychological_Ramps_from_the_Concrete_to_the_Abstract_Examples_from_Multiplicative_Structures","285810212_Toward_a_new_culture_of_prediction_Computational_modeling_in_the_era_of_desktop_computing"]}