{"id":"263130986_Sliding_Mode_Control_in_Electro-Mechanical_Systems","abstract":"Apply Sliding Mode Theory to Solve Control Problems\nInterest in SMC has grown rapidly since the first edition of this book was published. This second edition includes new results that have been achieved in SMC throughout the past decade relating to both control design methodology and applications.\nIn that time, Sliding Mode Control (SMC) has continued to gain increasing importance as a universal design tool for the robust control of linear and nonlinear electro-mechanical systems. Its strengths result from its simple, flexible, and highly cost-effective approach to design and implementation. Most importantly, SMC promotes inherent order reduction and allows for the direct incorporation of robustness against system uncertainties and disturbances. These qualities lead to dramatic improvements in stability and help enable the design of high-performance control systems at low cost.\nWritten by three of the most respected experts in the field, including one of its originators, this updated edition of Sliding Mode Control in Electro-Mechanical Systems reflects developments in the field over the past decade. It builds on the solid fundamentals presented in the first edition to promote a deeper understanding of the conventional SMC methodology, and it examines new design principles in order to broaden the application potential of SMC.\nSMC is particularly useful for the design of electromechanical systems because of its discontinuous structure. In fact, where the hardware of many electromechanical systems (such as electric motors) prescribes discontinuous inputs, SMC becomes the natural choice for direct implementation. This book provides a unique combination of theory, implementation issues, and examples of real-life applications reflective of the authors’ own industry-leading work in the development of robotics, automobiles, and other technological breakthroughs.","authors":["Vadim Utkin","Juergen Guldner","Jingxin Shi"],"meta":["January 2009","DOI:10.1201/9781420065619","Edition: 2ndPublisher: Boca Raton, London: CRC Press, Taylor & FrancisEditor: Frank L. Lewis, Shuzhi Sam GeISBN: 978-1-4200-6560-2"],"references":[]}