{"id":"263273751_A_novel_probabilistic_method_for_robust_parametric_identification_and_outlier_detection","abstract":"Outliers are one of the main concerns in statistics. Parametric identification results of ordinary least squares are sensitive to outliers. Many robust estimators have been proposed to overcome this problem but there are still some drawbacks in existing methods. In this paper, a novel probabilistic method is proposed for robust parametric identification and outlier detection in linear regression problems. The crux of this method is to calculate the probability of outlier, which quantifies how probable it is that a data point is an outlier. There are several appealing features of the proposed method. First, not only the optimal values of the parameters and residuals but also the associated uncertainties are taken into account for outlier detection. Second, the size of the dataset is incorporated because it is one of the key variables to determine the probability of obtaining a large-residual data point. Third, the proposed method requires no information on the outlier distribution model. Fourth, the proposed approach provides the probability of outlier. In the illustrative examples, the proposed method is compared with three well-known methods. It turns out that the proposed method is substantially superior and it is capable of robust parametric identification and outlier detection even for very challenging situations.","authors":["Ka-Veng Yuen","He-Qing Mu"],"meta":["October 2012Probabilistic Engineering Mechanics 30","DOI:10.1016/j.probengmech.2012.06.002"],"references":["284537526_Robust_Regression_and_Outlier_Detection","329476290_An_Approach_to_Bayesian_Sensitivity_Analysis","324641512_An_Introduction_to_Bayesian_Inference_in_Econometrics","324281628_Outliers_in_Statistical_Data","312900032_Robust_regression_by_means_of_S-estimators_in_robust_and_nonlinear_time_series_analysis","311743912_Statistical_Theory_and_Methodology_in_Science_and_Engineering","306203443_Sampling_and_Bayes'_inference_in_scientific_modelling_and_robustness_with_discussion","302989289_Robust_regression_Asymptotics_conjectures_and_Monte_Carlo","297156848_'Efficient_Bounded-Influence_Regression_Estimation'","285499542_Robust_Statistics"]}