{"id":"263291448_Fiber-Based_Wearable_Electronics_A_Review_of_Materials_Fabrication_Devices_and_Applications","abstract":"Fiber-based structures are highly desirable for wearable electronics that are expected to be light-weight, long-lasting, flexible, and conformable. Many fibrous structures have been manufactured by well-established lost-effective textile processing technologies, normally at ambient conditions. The advancement of nanotechnology has made it feasible to build electronic devices directly on the surface or inside of single fibers, which have typical thickness of several to tens microns. However, imparting electronic functions to porous, highly deformable and three-dimensional fiber assemblies and maintaining them during wear represent great challenges from both views of fundamental understanding and practical implementation. This article attempts to critically review the current state-of-arts with respect to materials, fabrication techniques, and structural design of devices as well as applications of the fiber-based wearable electronic products. In addition, this review elaborates the performance requirements of the fiber-based wearable electronic products, especially regarding the correlation among materials, fiber/textile structures and electronic as well as mechanical functionalities of fiber-based electronic devices. Finally, discussions will be presented regarding to limitations of current materials, fabrication techniques, devices concerning manufacturability and performance as well as scientific understanding that must be improved prior to their wide adoption.","authors":["Wei Zeng","Lin Shu","Qiao Li","Song Chen"],"meta":["August 2014Advanced Materials 26(31)","DOI:10.1002/adma.201400633","SourcePubMed"],"references":["289318305_Application_of_Nickel-Titanium_alloys_NiTi-NOL_in_smart_textiles_and_clothes","317741778_Erratum_High_Conductivity_Elastomeric_Electronics_Advanced_Materials_2004_16_393","313431227_A_novel_fabrication_process_to_realize_a_valveless_micropump_on_a_flexible_substrate","289884313_A_functional_and_biomechanical_perspective_of_locomotion_in_sauropod_dinosaurs_-_Or_why_sauropods_did_not_waddle","289427223_The_brave_new_world_of_wearable_intelligence","289224027_A_Multi-Agent-based_RFID_Framework_for_Smart-object_Applications","281941479_Effects_of_Age_on_the_Spinal_Stretch_Reflex","278313222_Sustained_Growth_of_Ultralong_Carbon_Nanotube_Arrays_for_Fiber_Spinning","278172704_High-Conductivity_Elastomeric_Electronics_Adv_Mater_2004_16_393","278052603_A_curvy_stretchy_future_for_electronics_vol_106_10875_2009"]}