{"id":"263371932_Realising_process_planning_and_scheduling_integration_through_adaptive_setup_planning","abstract":"Setup planning is one of the crucial exercises that affects process planning, scheduling and their integration. In a reconfigurable environment where more than one machine is available to process a part, setup planning assumes an important position which involves a complex optimisation problem facing several constraints. In this research machining features are sequenced and grouped into certain setup based on tool approach direction (TAD). Therefore considering the criteria such as machine utilisation, cost and makespan, near optimal solutions are selected to satisfy the requirements of the scheduling system. We have also addressed in this paper adaptive characteristics of process plan associated with setup, i.e. a cross machine setup planning to capture the different configuration of machines. Exploiting the stress of the immune system, a well known intelligent search technique known as artificial immune system (AIS) has been applied to solve two problems associated with the research issue discussed here. The proposed AIS based approach is demonstrated to resolve an example problem. It is found that the proposed approach is successfully applicable to machines having several configurations and accommodative to different setup requirements from a scheduling system where the frequent changes in machines are witnessed. By the way of combining the setup for alternative machines with process planning, we can demonstrate clearly a true relation of integration of functionalities of process planning and scheduling.","authors":["Priyabrata Mohapatra","Lyes Benyoucef","Manoj Kumar Tiwari"],"meta":["April 2013International Journal of Production Research 51(8)","DOI:10.1080/00207543.2012.715770"],"references":["246069146_Engineering_an_Immune_System1","245315380_A_progressive_approach_for_the_integration_of_process_planning_and_scheduling","323415851_Engineering_the_immune_system","270371803_Shop_Floor_Control_Systems_From_Design_to_Implementation","261671017_Automated_setup_selection_in_feature-based_process_planning","261653360_Graph-based_set-up_planning_and_tolerance_decomposition_for_computer-aided_fixture_design","254237125_Automatic_set-up_planning_for_metal_cutting_An_integrated_methodology","245331254_Setup_planning_for_machining_the_features_of_prismatic_parts","245330502_Integration_of_process_planning_and_scheduling_by_exploring_the_flexibility_of_process_planning","245330139_A_hierarchical_bicriterion_approach_to_integrated_process_plan_selection_and_job_shop_scheduling"]}