{"id":"263390182_Linear-time_Computation_of_Minimal_Absent_Words_Using_Suffix_Array","abstract":"Background. An absent word of a word y of length n is a word that does not occur in y. It is a minimal absent word if all its proper factors occur in y. Minimal absent words have been computed in genomes of organisms from all domains of life; their computation also provides a fast alternative for measuring approximation in sequence comparison. There exists an O(n) -time and O(n) -space algorithm for computing all minimal absent words on a fixed-sized alphabet based on the construction of suffix automata (Crochemore et al., 1998). No implementation of this algorithm is publicly available. There also exists an O(n2) -time and O(n) -space algorithm for the same problem based on the construction of suffix arrays (Pinho et al., 2009). An implementation of this algorithm was also provided by the authors and is currently the fastest available.\n\nResults. Our contribution in this article is twofold: first, we bridge this unpleasant gap by presenting an O(n) -time and O(n) -space algorithm for computing all minimal absent words based on the construction of suffix arrays; and second, we provide the respective implementation of this algorithm. Experimental results, using real and synthetic data, show that this implementation outperforms the one by Pinho et al. The open-source code of our implementation is freely available at http://github.com/solonas13/maw.\n\nConclusions. Classical notions for sequence comparison are increasingly being replaced by other similarity measures that refer to the composition of sequences in terms of their constituent patterns. One such measure is the minimal absent words. In this article, we present a new linear-time and linear-space algorithm for the computation of minimal absent words based on the suffix array","authors":["Carl Barton","Alice Heliou","Laurent Mouchard","Solon P. Pissis"],"meta":["December 2014BMC Bioinformatics 15:388","DOI:10.1186/s12859-014-0388-9","SourcearXiv"],"references":["257145051_Using_minimal_absent_words_to_build_phylogeny","235783927_Minimal_Forbidden_Words_and_Applications","221577802_Linear_Suffix_Array_Construction_by_Almost_Pure_Induced-Sorting","220126152_On_finding_minimal_absent_words","220110473_Automata_and_Forbidden_Words","265715795_Versatile_Succinct_Representations_of_the_Bidirectional_Burrows-Wheeler_Transform","228526199_Words_and_forbidden_factors_1","223162957_Efficient_computation_of_shortest_absent_words_in_a_genomic_sequence","220779327_Suffix_Arrays_a_New_Method_for_On-Line_String_Searches","220617310_Suffix_Arrays_A_New_Method_for_On-Line_String_Searches"]}