{"id":"263351604_Exploring_Shifts_in_Middle_School_Learners'_Modeling_Activity_While_Generating_Drawings_Animations_and_Computational_Simulations_of_Molecular_Diffusion","abstract":"Modeling and using technology are two practices of particular interest to K-12 science educators. These practices are inextricably linked among professionals, who engage in modeling activity with and across a variety of representational technologies. In this paper, we explore the practices of five sixth-grade girls as they generated models of smell diffusion using drawing, stop motion animation, and computational simulation during a multi day workshop. We analyze video, student discourse, and artifacts to address the questions: In what ways did learners' modeling practices, reasoning about mechanism, and ideas about smell shift as they worked across this variety of representational technologies? And, what supports enabled them to persist and progress in the modeling activity? We found that the girls engaged in two distinct modeling cycles that reflected persistence and deepening engagement in the task. In the first, messing about, they focused on describing and representing many ideas related to the spread of smell at once. In the second, digging in, they focused on their testing and revision of particular mechanisms that underlie smell diffusion. Upon deeper analysis, we found these cycles were linked to the girls' invention of “oogtom,” a representational object that encapsulated many ideas from the first cycle and allowed the girls to re-start modeling with the mechanistic focus required to construct simulations. We analyze the role of activity design, facilitation, and technological infrastructure in this pattern of engagement over the course of the workshop, and discuss implications for future research, curriculum design, and classroom practice.","authors":["Michelle Hoda Wilkerson","Brian Gravel","Christopher A. Macrander"],"meta":["June 2014Journal of Science Education and Technology Online First(2-3)","DOI:10.1007/s10956-014-9497-5"],"references":["275024323_Balancing_curricular_and_pedagogical_needs_in_computational_construction_kits_Lessons_from_the_DeltaTick_Project","274377900_Computational_Thinking","274309848_Computational_Thinking","263351729_SiMSAM_An_integrated_toolkit_to_bridge_student_scientific_and_mathematical_ideas_using_computational_media","345102653_Multiple_Notational_Systems_and_Algebraic_Understandings_The_Case_of_the_Best_Deal_Problem","292253870_Inquiry_modeling_and_metacognition_Making_science_accessible_to_all_students","283078490_I_thought_the_smaller_the_wave_was_the_louder_the_sound_was_Highlighting_negotiation_in_developing_meta-representational_competence","271903562_Confusing_Claims_for_Data_A_Critique_of_Common_Practices_for_Presenting_Qualitative_Research_on_Learning","268441182_Developing_New_Notations_for_a_Learnable_Mathematics_in_the_Computational_Era","265092033_Toward_a_Design_Science_of_Education"]}