{"id":"263380317_E-learning_and_the_University_of_Huelva_A_study_of_WebCT_and_the_technological_acceptance_model","abstract":"Purpose\n– The purpose of this paper is to investigate the factors that determine the acceptance of the WebCT learning system among students of the faculties of Business and Education Sciences at the University of Huelva, and to verify the direct and indirect effects of these factors.\n\nDesign/methodology/approach\n– A total of 226 students at the University of Huelva completed a survey questionnaire measuring their responses to six constructs which explain the system usage in the context of e‐learning: technical support (TS); computer self‐efficacy (CSE); perceived ease of use (PEOU); perceived usefulness (PU); attitude (A); and system usage (SU). Structural equation modelling (SEM) was employed for modelling and data analysis.\n\nFindings\n– The most significant results point to the need to rethink the original structural model in terms of the relations of certain variables, although the authors also establish the importance of the direct effect of technical support on perceived ease of use and perceived usefulness among the students. The authors also confirm that WebCT usage and acceptance is directly influenced by perceived usefulness and indirectly by perceived ease of use.\n\nOriginality/value\n– The findings in this study have implications for the virtual learning systems managers at the University of Huelva, and for other universities that use online tuition systems. This paper reflects a lack of technical support which students need to use WebCT more efficiently and shows that training courses and technical assistance for students must be extended.","authors":["Rocío Arteaga Sánchez","Ana Duarte Hueros","Mercedes Garcia Ordaz"],"meta":["March 2013Campus-Wide Information Systems 30(2)","DOI:10.1108/10650741311306318"],"references":["305195804_E-learning_transforms_higher_education","329819488_A_Field_Investigation_of_Causal_Relations_among_Cognitions_Affect_Intentions_and_Behavior","316823281_Self-efficacy_the_exercise_of_control","313069741_Organizational_context_user_involvement_and_the_usefulness_of_information_systems","312984568_Perceived_usefulness_perceived_ease_and_user_acceptance_of_information_technology","285473316_Structural_Equation_Modeling_Concepts_Issues_and_Applications","284807344_TPACK_and_Web_20_Transformation_of_Teaching_and_Learning","284792036_What_Web_20_can_teach_us_about_learning","271787795_Digital_Game-Based_Learning","271778328_A_Field_Investigation_of_Causal_Relations_among_Cognitions_Affect_Intentions_and_Behavior"]}