{"id":"263475852_A_comparative_study_of_the_SVM_and_K-nn_machine_learning_algorithms_for_the_diagnosis_of_respiratory_pathologies_using_pulmonary_acoustic_signals","abstract":"Background\nPulmonary acoustic parameters extracted from recorded respiratory sounds provide valuable information for the detection of respiratory pathologies. The automated analysis of pulmonary acoustic signals can serve as a differential diagnosis tool for medical professionals, a learning tool for medical students, and a self-management tool for patients. In this context, we intend to evaluate and compare the performance of the support vector machine (SVM) and K-nearest neighbour (K-nn) classifiers in diagnosis respiratory pathologies using respiratory sounds from R.A.L.E database.\n\nResults\nThe pulmonary acoustic signals used in this study were obtained from the R.A.L.E lung sound database. The pulmonary acoustic signals were manually categorised into three different groups, namely normal, airway obstruction pathology, and parenchymal pathology. The mel-frequency cepstral coefficient (MFCC) features were extracted from the pre-processed pulmonary acoustic signals. The MFCC features were analysed by one-way ANOVA and then fed separately into the SVM and K-nn classifiers. The performances of the classifiers were analysed using the confusion matrix technique. The statistical analysis of the MFCC features using one-way ANOVA showed that the extracted MFCC features are significantly different (p < 0.001). The classification accuracies of the SVM and K-nn classifiers were found to be 92.19% and 98.26%, respectively.\n\nConclusion\nAlthough the data used to train and test the classifiers are limited, the classification accuracies found are satisfactory. The K-nn classifier was better than the SVM classifier for the discrimination of pulmonary acoustic signals from pathological and normal subjects obtained from the RALE database.","authors":["Rajkumar Palaniappan","Kenneth Sundaraj","Sebastian Sundaraj"],"meta":["June 2014BMC Bioinformatics 15(1):223","DOI:10.1186/1471-2105-15-223","SourcePubMed"],"references":["340253350_An_Innovative_Computer_Assisted_Instructional_Programme","271565107_Power_of_the_test_of_one-way_ANOVA_after_transforming_with_large_sample_size_data","266569975_Classification_of_Wheeze_Sounds_Using_Wavelets_and_Neural_Networks","261520485_Detecting_Unilateral_Phrenic_Paralysis_by_Acoustic_Respiratory_Analysis","257375944_Computer-Based_Respiratory_Sound_Analysis_A_Systematic_Review","312538118_Support-vector_networks","290297280_Neural_network_based_respiratory_signal_classification_using_various_feed-Forward_back_propagation_training_algorithms","271513141_Support_Vector_Networks","262360663_When_Is_''Nearest_Neighbor''_Meaningful","257648862_Artificial_intelligence_techniques_used_in_respiratory_sound_analysis_-_A_systematic_review"]}