{"id":"263407454_Design_configuration_with_architectural_objects_Linking_customer_requirements_with_system_capabilities_in_industrialized_house-building_platforms","abstract":"There are two main routes for customers of industrialized house building to follow: either rigid platforms offering preconfigured products, often called ‘type houses’, or more flexible platforms open to customization. The problem in customization is to link customer requirements with system opportunities. In axiomatic design processes, this problem is understood as the transformation of customer requirements in the architectural view into design parameters that are supported by the system. A new method is proposed that allows requirements and constraints of an industrialized building platform to be handled fully in the architectural view through configuration with so-called architectural objects. It is based upon established theories and complies with the rationale of separating platform development from product customization. An experimental study, using standard building information modelling software, shows that a hierarchical structure of architectural objects can support both the development, as well as the configuration process, of the platform. Modularization in the architectural view is believed to be an important first step to capturing user requirements in the development of platforms for a specific market segment. It is also anticipated that if these requirements can be conceptualized as architectural objects the capabilities in different configurator solutions can be made more transparent to the customer.","authors":["Fredrik Wikberg","Thomas Olofsson","Anders Ekholm"],"meta":["March 2014Construction Management and Economics 32(1-2)","DOI:10.1080/01446193.2013.864780"],"references":["241699135_Supply_chains_in_the_construction_industry","235909297_Product_modeling_of_configurable_building_systems_-_A_case_study","233566842_Models_of_manufacturing_and_the_construction_process_The_genesis_of_re-engineering_construction","302300458_Science_Explanatory_Theory_and_Environment-Behavior_Studies","301888656_The_Power_of_Product_Platform","273232936_Mass_Customization_The_New_Frontier_in_Business_Competition","257371489_Configuration_through_the_parameterization_of_building_components","247870574_The_Evolution_of_Designs_Biological_Analogy_in_Architecture_and_the_Applied_Arts","239538398_Planning_for_Product_Platforms","235357433_A_Pattern_Language"]}