{"id":"263483647_INNOVATION_IN_MARITIME_EDUCATION_AND_TRAINING","abstract":"The extensive amendments to the STCW Convention agreed in 1995 only came into effect in\n2002 with some additional changes in January 2003. The provisions concerning the need for\ngovernments to submit quality standard reports to the IMO, concerning their national training and\ncertification systems, were only required to be met as recently as 2004. The paper argues that\nsufficient time has elapsed to assess the impact of the changes introduced particularly the prime\nobjective of the changes i.e. whether confidence is stored in the validity of seafarers’ certificates\nof competency regardless of the country of issue. The paper further argues that since 1995, there\nhave been rapid changes in the design of ships and the equipment used in the navigation and\npropulsion systems and yet there has been no serious attempt to revise the STCW and/or the IMO\nmodel courses in these connections. The changes introduced in 2003 were not extensive and the\nexpected changes in 2010 while they are expected to address several important issues the paper\nargues that there remains a number of deficiencies in STCW even if all of the proposed changes\nare implemented. New regulations and conventions in the majority of cases have been reactive\nand have each come about after a major disaster at sea. The introduction of some of these new\nregulations such as ISM and ISPS codes, together with commercial demands, has increased the\nworkload on-board. Considering that certain sectors of the industry have experienced very severe\nshortages of officers and this together with the continuing growth of the world fleet raises several\nserious questions for instance, does STCW and the expected changes address the automation\nproblems or identified communications failures and would they address difficulties resulting\nfrom manning problems which have often manifested themselves into long working hours and\nfatigue, which in turn has resulted in several accidents at sea and in ports. Under the above\nconsiderations, the paper questions if STCW and the expected changes are sufficient to address\nthe MET requirements and the problems faced by the industry and are these changes in short fit\nfor the purpose. Special references are made to the work of Yongxing (2009) and Ziarati (2010)\nregarding the expected changes to STCW and their consequences.\n\nThis paper gives a background to TUDEV and its contributions to the development of MET\nprogrammes and practices and summarises TUDEV’s initiatives to harmonise the maritime\neducation and training in Europe and to address the deficiencies of the STCW.\n\nKey Words: STCW, Maritime Education and Training, European Maritime projects.","authors":["Reza Ziarati","Ergun Demirel","Taner Albayrak"],"meta":["January 2010","Conference: International Maritime Lecturers Association (IMLA) 2010At: Shanghai, China"],"references":["268058705_Safety_at_Sea_-_Applying_Pareto_Analysis"]}