{"id":"263495206_Visualization_of_web_form_submissions_for_security_analysis","abstract":"Purpose ‐ The purpose of this paper is to propose novel information visualization and interaction techniques to help security administrators analyze past web form submissions, with the goals of searching, inspecting, verifying, and understanding about malicious submissions. Design/methodology/approach ‐ The authors utilize well-known visual design principles in the techniques to support the analysis process. They also implement a prototype and use it to investigate simulated normal and malicious web submissions. Findings ‐ The techniques can increase analysts' efficiency by displaying large amounts of information at a time, help analysts detect certain kinds of anomalies, and support the analyzing process via provided interaction capabilities. Research limitations/implications ‐ Due to resources constraints, the authors experimented on simulated data only, not real data. Practical implications ‐ The techniques can be used to investigate past web form submissions, which is a first step in analysing and understanding the current security situation and attackers' skills. The knowledge gained from this process can be used to plan for effective future defence strategy, e.g. by improving/fine-tuning the attack signatures of an automatic intrusion detection system. Originality/value ‐ The visualization and interaction designs are the first visual analysis technique for security investigation of web form submissions.","authors":["Tran Tri Dang","Tran Khanh Dang"],"meta":["June 2013International Journal of Web Information Systems 9(2)","DOI:10.1108/IJWIS-12-2012-0036"],"references":["263123406_A_survey_on_security_visualization_techniques_for_web_information_systems","226284322_Visual_Analysis_of_Network_Flow_Data_with_Timelines_and_Event_Plots","225198879_Model-Based_Clustering_and_Visualization_of_Navigation_Patterns_on_a_Web_Site","225159230_Fine-Grained_Analysis_of_Web_Tasks_through_Data_Visualization","291874236_The_magical_number_seven_plus_or_minus_two","247641124_Static_Detection_of_Security_Vulnerabilities_in_Scripting_Languages","245899453_Detection_of_SQL_Injection_and_Cross-site_Scripting_Attacks","237422172_Pixy_A_Static_Analysis_Tool_for_Detecting_Web_Application_Vulnerabilities_Technical_Report","225239186_A_Learning-Based_Approach_to_the_Detection_of_SQL_Attacks","223517847_Preattentive_Processing_in_Vision"]}