{"id":"263441607_Development_of_Assamese_Phonetic_Engine_Some_issues","abstract":"The phonetic engine is a system that performs speech signal to symbol transformation. This work describes some issues in the development of an Assamese Phonetic Engine (PE). International phonetic alphabet (IPA) is used as the phonetic unit to transcribe the speech database collected in three different modes, namely, reading, lecture and conversation modes. Only reading mode data is used for training and Hidden markov model (HMM) is used to model each phonetic unit without imposing any language or contextual constraint. The trained HMMs are used to derive a sequence of phonetic units from a test speech signal. Accuracy of 47.31%, 45.30% and 36.13% is achieved in reading, lecture and conversation mode, respectively. Confusion among the phonetic units specific to Assamese are discussed. Issues related to different recording modes, language and native speaker dependencies are discussed. The speech data is also collected in Hindi from three different sets of speakers to study speaker, language and native dependancies. Accuracy of 40.5%, 36.10% and 29.61% is achieved in native speaker dependent, native speaker independent and non-native speaker independent cases, respectively.","authors":["Biswajit Dev Sarma","Mousmita Sarma","Meghamallika Sarma","S.R. Mahadeva Prasanna"],"meta":["December 2013","DOI:10.1109/INDCON.2013.6725966","Conference: 2013 Annual IEEE India Conference (INDICON)At: Mumbai, India"],"references":["236023819_The_HTK_book","257767946_Salient_phonetic_features_of_Indian_languages_in_speech_technology","245123229_A_Tutorial_on_Hidden_Markov_Models_and_Selected_Applications_in_Speech_Recognition","225883788_Phonetic_Searching_vs_LVCSR_How_to_Find_What_You_Really_Want_in_Audio_Archives","220691539_Fundamentals_of_Speech_Recognition","208034127_Acoustic_Phonetics","3175691_Speaker-independent_phone_recognition_using_hidden_Markov_models","2984124_A_Tutorial_on_Hidden_Markov_Models_and_Selected_Applications_on_Speech_Recognition"]}