{"id":"263463707_A_review_of_talent_management_'infancy_or_adolescence'","abstract":"The aim of this paper is to provide a critical review of the academic literature on talent management in search of alternative perspectives. We found three dominant themes: the exploration of the concept of talent (definitions), the intended outcomes or effects of talent management and talent management practices. These themes are explored in more detail, and we discuss possible limitations of the current points of view on talent management. Our main finding was that the current talent management literature has a too narrow and one-dimensional approach. It can be characterized as managerialist and unitarist and has a limited view of the practices and activities of human resources. To broaden this view to a more balanced or pluralistic approach to talent management, we added new perspectives, such as stakeholder theory, multiple goals and an extended consideration of practices. The new perspectives are not only valuable for the development of the field of talent management in general but also essential for a broader theoretical framework for talent management in different contexts.","authors":["Marian Thunnissen","Paul Boselie","Ben Fruytier"],"meta":["May 2013The International Journal of Human Resource Management 24(9)","DOI:10.1080/09585192.2013.777543"],"references":["291178303_Global_Talent_Management_How_Leading_Multinationals_Build_and_Sustain_Their_Talent_Pipeline","288833178_Global_Talent_Management_and_Global_Talent_Challenges_Strategic_Opportunities_for_IHRM","324429687_Manufacturing_Advantage_Why_High-Performance_Work_Systems_Pay_Off","313640619_The_Oxford_handbook_of_human_resource_management_scope_analysis_and_significance","312984529_Talent_management_Trends_that_will_shape_the_future","294174006_The_people_problem_in_talent_management","291877466_Talent_management_in_the_21st_century_Help_your_company_find_develop_and_keep_its_strongest_workers","290784215_Making_talent_a_strategic_priority","288043014_Human_Resource_Management_Scope_Analysis_and_Significance","286785360_Faulty_Intel_in_the_War_for_Talent_Replacing_the_Assumptions_of_Talent_Management_with_Evidence-based_Strategies"]}