{"id":"263556682_Meta-analysis_of_scientometric_research_of_knowledge_management_Discovering_the_identity_of_the_discipline","abstract":"Purpose ‐ The purpose of this study is to conduct a meta-analysis of prior scientometric research of the knowledge management (KM) field.Design/methodology/approach ‐ A total of 108 scientometric studies of the KM discipline were subjected to meta-analysis techniques.Findings ‐ The overall volume of scientometric KM works has been growing, reaching up to ten publications per year by 2012, but their key findings are somewhat inconsistent. Most scientometric KM research is published in non-KM-centric journals. The KM discipline has deep historical roots. It suffers from a high degree of over-differentiation and is represented by dissimilar research streams. The top six most productive countries for KM research are the USA, the UK, Canada, Germany, Australia, and Spain. KM exhibits attributes of a healthy academic domain with no apparent anomalies and is progressing towards academic maturity.Practical implications ‐ Scientometric KM researchers should use advanced empirical methods, become aware of prior scientometric research, rely on multiple databases, develop a KM keyword classification scheme, publish their research in KM-centric outlets, focus on rigorous research of the forums for KM publications, improve their cooperation, conduct a comprehensive study of individual and institutional productivity, and investigate interdisciplinary collaboration. KM-centric journals should encourage authors to employ under-represented empirical methods and conduct meta-analysis studies and should discourage conceptual publications, especially the development of new frameworks. To improve the impact of KM research on the state of practice, knowledge dissemination channels should be developed.Originality/value ‐ This is the first documented attempt to conduct a meta-analysis of scientometric research of the KM discipline.","authors":["Alexander Serenko"],"meta":["September 2013Journal of Knowledge Management 17(5)","DOI:10.1108/JKM-05-2013-0166"],"references":["330580281_English_Men_of_Science_Their_Nature_and_Nurture","328896155_Research_Methodologies_in_MIS_An_Update","315191121_The_System_of_Professions_An_Essay_on_the_Division_of_Expert_Labor","313564201_Managerial_Fads_and_Fashions_The_Diffusion_and_Rejection_of_Innovations","313429406_A_preliminary_test_of_Google_Scholar_as_a_source_for_citation_data_A_longitudinal_study_of_Nobel_Prize_winners","313082025_Knowledge_management_and_knowledge_management_systems_conceptual_foundations_and_research_issues","313046598_The_quality_of_evidence_in_knowledge_management_research_Practitioner_versus_scholarly_literature","298852493_The_Matthew_Effect_in_Science","292763248_Bridging_the_gap_between_research_and_practice","292457971_The_future_of_knowledge_management"]}