{"id":"263556690_The_intellectual_core_and_impact_of_the_knowledge_management_academic_discipline","abstract":"Purpose ‐ The purpose of this paper is two-fold: to explore the intellectual core of the knowledge management (KM) academic discipline in order to test whether it exhibits signs of a reference discipline; and to analyze the theoretical and practical impact of the discipline. Design/methodology/approach ‐ The most influential articles published in the Journal of Knowledge Management were selected and their cited and citing works were scientometrically analysed. Findings ‐ The KM discipline: builds its knowledge primarily upon research reports published in the English language; successfully disseminates its knowledge in both English and non-English publications; does not exhibit a problematic self-citation behavior; uses books and practitioner journals in the development of KM theory; converts experiential knowledge into academic knowledge; is not yet a reference discipline, but is progressing well towards becoming one; exerts a somewhat limited direct impact on practice; and is not a scientific fad. Practical implications ‐ KM researchers need to become aware of and use knowledge published in non-English outlets. Given the status of KM as an applied discipline, it is critical that researchers continue utilizing non-peer reviewed sources in their scholarly work. KM researchers should promote the dissemination of KM knowledge beyond the disciplinary boundaries. The issue whether KM should strive towards becoming a reference discipline should be debated further. Originality/value ‐ This study analyzes the KM field from the reference discipline perspective.","authors":["Alexander Serenko","Nick Bontis"],"meta":["February 2013Journal of Knowledge Management 17(1)","DOI:10.1108/13673271311300840"],"references":["324937048_The_Structure_of_Scientific_Revolutions","319032823_Grading_and_the_Nature_of_the_Discipline","315191121_The_System_of_Professions_An_Essay_on_the_Division_of_Expert_Labor","314911544_Accounting_for_Intellectual_Capital_On_the_Elusive_Path_from_Theory_to_Practice","313564201_Managerial_Fads_and_Fashions_The_Diffusion_and_Rejection_of_Innovations","310827143_MANAGEMENT_FASHION_LIFECYCLES_TRIGGERS_AND_COLLECTIVE_LEARNING_PROCESSES","308052677_Why_most_published_research_findings_are_false","292917678_How_business_schools_lost_their_way_2","292763248_Bridging_the_gap_between_research_and_practice","291002195_Journal_Self-Citation_IX_The_Power_of_the_Unspoken_in_Journal_Referencing"]}