{"id":"263572125_Do_screencasts_help_to_revise_prerequisite_mathematics_An_investigation_of_student_performance_and_perception","abstract":"Basic calculus skills that are prerequisites for advanced mathematical studies continue to be a problem for a significant proportion of higher education students. While there are many types of revision material that could be offered to students, in this paper we investigate whether short, narrated video recordings of mathematical explanations (screencasts) are a useful tool to enhance student learning when revisiting prerequisite topics. We report on the outcomes of a study that was designed to both measure change in student performance before and after watching screencasts, and to capture students’ perception of the usefulness of screencasts in their learning. Volunteers were recruited from students enrolled on an entry module for the Mathematics Master of Science programme at the Open University to watch two screencasts sandwiched between two online calculus quizzes. A statistical analysis of student responses to the quizzes shows that screencasts can have a positive effect on student performance. Further analysis of student feedback shows that student confidence was increased by watching the screencasts. Student views on the value of screencasts for their learning indicated that they appreciated being able to watch a problem being solved and explained by an experienced mathematician;hear the motivation for a particular problem-solving approach;engage more readily with the material being presented, thereby retaining it more easily.The positive student views and impact on student scores indicate that short screencasts could play a useful role in revising prerequisite mathematics.","authors":["Birgit Loch","Camilla R. Jordan","Tim W. Lowe","Ben Mestel"],"meta":["February 2014International Journal of Mathematical Education 45(2)","DOI:10.1080/0020739X.2013.822581"],"references":["268294632_An_instructional_design_model_for_screencasting_Engaging_students_in_self-regulated_learning","263849937_Do_short_screencasts_improve_student_learning_of_mathematics","263849908_Teaching_threshold_concepts_in_engineering_mathematics_using_MathsCasts","263849811_Complementing_mathematics_support_with_online_MathsCasts","228990059_Elements_of_a_Science_of_E-Learning","253370326_Does_students'_confidence_in_their_ability_in_mathematics_matter","233452961_Student_perceptions_of_effective_use_of_tablet_PC_recorded_lectures_in_undergraduate_mathematics_courses","233178572_First_principles_of_motivation_to_learn_and_e3-learning","228699465_Do_Screencasts_Really_Work_Assessing_Student_Learning_through_Instructional_Screencasts","228556807_Optimizing_learning_from_examples_using_animated_pedagogical_agents","226869642_Example-Based_Learning_in_Heuristic_Domains_A_Cognitive_Load_Theory_Account","220663243_Saying_the_wrong_thing_Improving_learning_with_multimedia_by_including_misconceptions","216300549_An_Introduction_To_Generalized_Linear_Models","211906113_Guidelines_for_effective_online_instruction_using_multimedia_screencasts","200773238_Learning_from_Examples_Instructional_Principles_from_the_Worked_Examples_Research"]}