{"id":"263658395_Modeling_and_Discovering_Vulnerabilities_with_Code_Property_Graphs","abstract":"The vast majority of security breaches encountered today are a direct result of insecure code. Consequently, the protection of computer systems critically depends on the rigorous identification of vulnerabilities in software, a tedious and error-prone process requiring significant expertise. Unfortunately, a single flaw suffices to undermine the security of a system and thus the sheer amount of code to audit plays into the attacker's cards. In this paper, we present a method to effectively mine large amounts of source code for vulnerabilities. To this end, we introduce a novel representation of source code called a code property graph that merges concepts of classic program analysis, namely abstract syntax trees, control flow graphs and program dependence graphs, into a joint data structure. This comprehensive representation enables us to elegantly model templates for common vulnerabilities with graph traversals that, for instance, can identify buffer overflows, integer overflows, format string vulnerabilities, or memory disclosures. We implement our approach using a popular graph database and demonstrate its efficacy by identifying 18 previously unknown vulnerabilities in the source code of the Linux kernel.","authors":["Fabian Yamaguchi","Nico Golde","Daniel Arp","Konrad Rieck"],"meta":["May 2014","DOI:10.1109/SP.2014.44","Conference: IEEE Symposium on Security and Privacy"],"references":["258903333_Chucky_Exposing_Missing_Checks_in_Source_Code_for_Vulnerability_Discovery","258903284_Structural_Detection_of_Android_Malware_using_Embedded_Call_Graphs","313705078_Interprocedural_slicing_using_dependence_graphs","313580789_Program_slicing","312532894_Clone_detection_using_abstract_syntax_trees","262170417_Scheduling_black-box_mutational_fuzzing","262155628_Leveraging_choice_to_automate_authorization_hook_placement","261485945_Towards_Practical_Reactive_Security_Audit_Using_Extended_Static_Checkers","242533283_Classes_of_Recursively_Enumerable_Sets_and_Their_Decision_Problems","242529649_Pscan_a_limited_problem_scanner_for_c_source_files"]}