{"id":"263699678_CTArcade_Computational_thinking_with_games_in_school_age_children","abstract":"We believe that children as young as ten can directly benefit from opportunities to engage in computational thinking. One approach to provide these opportunities is to focus on social game play. Understanding game play is common across a range of media and ages. Children can begin by solving puzzles on paper, continue on game boards, and ultimately complete their solutions on computers. Through this process, learners can be guided through increasingly complex algorithmic thinking activities that are built from their tacit knowledge and excitement about game play. This paper describes our approach to teaching computational thinking skills without traditional programming—but instead by building on children’s existing game playing interest and skills. We built a system called CTArcade, with an initial game (Tic-Tac-Toe), which we evaluated with 18 children aged 10–15. The study shows that our particular approach helped young children to better articulate algorithmic thinking patterns, which were tacitly present when they played naturally on paper, but not explicitly apparent to them until they used the CTArcade interface.","authors":["Tak Yeon Lee","Matthew Louis Mauriello","June Ahn","Ben Bederson"],"meta":["July 2014International Journal of Child-Computer Interaction 2(1)","DOI:10.1016/j.ijcci.2014.06.003","Project: CTArcade"],"references":["274377900_Computational_Thinking","274309848_Computational_Thinking","260205419_The_MOOC_model_for_digital_practice","257719457_Learning_Programming_at_the_Computational_Thinking_Level_via_Digital_Game-Play","254004440_CTArcade_learning_computational_thinking_while_training_virtual_characters_through_game_play","250458226_The_Transfer_of_Scientific_Principles_Using_Concrete_and_Idealized_Simulations","262400134_Racing_Games_for_Exploring_Kinematics_A_Computational_Thinking_Approach","259258513_The_Discovery_of_Ground_Theory","242569642_The_Discovery_of_Grounded_Theory_Strategies_for_Qualitative_Research","242540768_Methods_for_visual_understanding_of_heirarchical_systems"]}