{"id":"263620565_Visualization_of_arrestin_recruitment_by_a_G_Protein-Coupled_Receptor","abstract":"G Protein Coupled Receptors (GPCRs) are critically regulated by β-arrestins (βarrs), which not only desensitize G protein signaling but also initiate a G protein independent wave of signaling1-5. A recent surge of structural data on a number of GPCRs, including the β2 adrenergic receptor (β2AR)-G protein complex, has provided novel insights into the structural basis of receptor activation6-11. Lacking however has been complementary information on recruitment of βarrs to activated GPCRs primarily due to challenges in obtaining stable receptor-βarr complexes for structural studies. Here, we devised a strategy for forming and purifying a functional β2AR-βarr1 complex that allowed us to visualize its architecture by single particle negative stain electron microscopy (EM) and to characterize the interactions between β2AR and βarr1 using hydrogen-deuterium exchange mass spectrometry (HDXMS) and chemical cross-linking. EM 2D averages and 3D reconstructions reveal bimodal binding of βarr1 to the β2AR, involving two separate sets of interactions, one with the phosphorylated carboxy-terminus of the receptor and the other with its seven-transmembrane core. Areas of reduced HDX together with identification of cross-linked residues suggest engagement of the finger loop of βarr1 with the seven-transmembrane core of the receptor. In contrast, focal areas of increased HDX indicate regions of increased dynamics in both N and C domains of βarr1 when coupled to the β2AR. A molecular model of the β2AR-βarr signaling complex was made by docking activated βarr1 and β2AR crystal structures into the EM map densities with constraints provided by HDXMS and cross-linking, allowing us to obtain valuable insights into the overall architecture of a receptor-arrestin complex. The dynamic and structural information presented herein provides a framework for better understanding the basis of GPCR regulation by arrestins.","authors":["Arun Shukla","Gerwin H Westfield","Kunhong Xiao","Rosana I Reis"],"meta":["June 2014Nature 512(7513)","DOI:10.1038/nature13430"],"references":["242878887_-Arrestin_acts_as_a_clathrin_adaptor_in_endocytosis_of_the_2-_adrenergic_receptor","236252876_Structure_of_active_-arrestin-1_bound_to_a_G-protein-coupled_receptor_phosphopeptide","234836107_b-Arrestins_and_Cell_Signaling","234019969_Involvement_of_distinct_arrestin-1_elements_in_binding_to_different_functional_forms_of_rhodopsin","232611488_Conformation_of_receptor-bound_visual_arrestin","229075407_Manipulation_of_Very_Few_Receptor_Discriminator_Residues_Greatly_Enhances_Receptor_Specificity_of_Non-visual_Arrestins","228444625_Identification_of_cross-linked_peptides_from_complex_samples","286271538_Crystal_structure_of_the_b2_adrenergic_receptor-Gs_protein_complex","259110516_Arrestin_Interactions_with_G_Protein-Coupled_Receptors","237820004_Structural_Determinants_of_Arrestin_Functions"]}