{"id":"26360304_Trabalhando_com_estrategias_de_ensino-aprendizado_por_descoberta_na_area_da_saude_a_problematizacao_e_a_aprendizagem_baseada_em_problemas","abstract":"Considerando os processos de mudança no ensino em saúde e a demanda por novas formas de trabalhar com o conhecimento no ensino superior, discutem-se dois caminhos metodológicos inovadores no ensino na área da saúde: a aprendizagem baseada em problemas (ABP) e a problematização. Descrevendo suas raízes teóricas, procura-se identificar os seus princípios orientadores. Enquanto propostas distintas, ambas contribuem para rever o processo de ensino-aprendizagem: a problematização, voltando-se para a construção do conhecimento no contexto de uma formação crítica; a ABP, voltando-se para os aspectos cognitivos do processo de construção de conceitos e apropriação dos mecanismos básicos da ciência. Tanto a problematização como a ABP levam a rupturas com a forma tradicional de ensinar e aprender, estimulando gestão participativa dos protagonistas da experiência e reorganização da relação teoria/prática. A crítica às possibilidades e limites de cada proposta, valendo-se da análise de seus fundamentos teórico-metodológicos, leva-nos a concluir que experiências pedagógicas apoiadas na ABP e/ou na problematização, podem representar um movimento inovador no contexto da educação na área da saúde favorecendo rupturas e processos mais amplos de mudança.","authors":["Eliana Goldfarb Cyrino","Toralles-Pereira Maria Lúcia"],"meta":["June 2004Cadernos de saúde pública / Ministério da Saúde, Fundação Oswaldo Cruz, Escola Nacional de Saúde Pública 20(3)","DOI:10.1590/S0102-311X2004000300015"],"references":["287699463_O_ensino_medico_no_Brasil_esta_mudando","47868288_Implementando_as_novas_diretrizes_curriculares_para_a_educacao_medica_o_que_nos_ensina_o_caso_de_Harvard","26359332_Alfabetizando_o_corpo_o_pioneirismo_de_Hortensia_de_Hollanda_na_educacao_em_saude","26359092_Promocao_a_saude_e_educacao_diagnostico_de_saneamento_atraves_da_pesquisa_participante_articulada_a_educacao_popular_Distrito_Sao_Joao_dos_Queiroz_Quixada_Ceara_Brasil","277059624_Ensino_com_pesquisa_a_pratica_do_professor_universitario","249000019_Inquiry_Based_And_Problem_Based_Learning_How_Similar_are_these_Approaches_to_Nursing_and_Medical_Education","44721099_Educacao_medica_e_saude_possibilidades_de_mudanca_Marcio_Jose_de_Almeida","44379671_Pedagogia_universitaria_conhecimento_etica_e_politica_no_ensino_superior_Denise_Leite_organizadora","32105350_Educacion_medica_Nuevos_enfoques_metas","12592245_Effectiveness_of_Problem-Based_Learning_Curricula_Research_and_Theory"]}