{"id":"263745870_The_Matthew_effect_in_empirical_data","abstract":"The Matthew effect describes the phenomenon that in societies, the rich tend to get richer and the potent even more powerful. It is closely related to the concept of preferential attachment in network science, where the more connected nodes are destined to acquire many more links in the future than the auxiliary nodes. Cumulative advantage and success-breads-success also both describe the fact that advantage tends to beget further advantage. The concept is behind the many power laws and scaling behaviour in empirical data, and it is at the heart of self-organization across social and natural sciences. Here, we review the methodology for measuring preferential attachment in empirical data, as well as the observations of the Matthew effect in patterns of scientific collaboration, socio-technical and biological networks, the propagation of citations, the emergence of scientific progress and impact, career longevity, the evolution of common English words and phrases, as well as in education and brain development. We also discuss whether the Matthew effect is due to chance or optimization, for example related to homophily in social systems or efficacy in technological systems, and we outline possible directions for future research.","authors":["Matjaž Perc"],"meta":["September 2014Journal of The Royal Society Interface 11(98)","DOI:10.1098/rsif.2014.0378","SourcePubMed"],"references":["301233136_Diffusion_of_scientific_credits_and_the_ranking_of_scientists","345702449_The_Structure_and_Dynamics_of_Networks","333019923_Small_Worlds_The_Dynamics_of_Networks_between_Order_and_Randomness","329255289_First-Mover_Advantage_A_Synthesis_Conceptual_Framework_and_Research_Propositions","321510895_Matthew_Effects_in_Reading_Some_Consequences_of_Individual_Differences_in_the_Acquisition_of_Literacy","312940435_2001_Statistical_mechanics_of_complex_networksJ","309078761_A_model_for_income_distribution","303721324_First-mover_advantage_A_synthesis_conceptual_framework_and_research_propositions","301233236_Clustering_and_preferential_attachment_in_growing_networks","298852493_The_Matthew_Effect_in_Science"]}