{"id":"263759024_Assessing_the_causes_and_scales_of_the_leaf_economics_spectrum_using_venation_networks_in_Populus_tremuloides","abstract":"The leaf economics spectrum (LES) describes global interspecific correlations between leaf traits. Despite recent theoretical advances, the biological scale at which LES correlations emerge and the physiological and climatic causes of these correlations remains partially unknown.Here, we test an extant theory based on universal trade‐offs in leaf venation networks that predicts that (i) the LES primarily originates within individuals; (ii) minor vein density drives LES trait correlations; and (iii) between individuals, LES correlations reflects variation in minor vein density driven by water availability. To test these predictions, we sample leaves within and between clones of Populus tremuloides across a wide climate gradient.We show that predictions i) and iii) are supported but ii) is only partially supported. To account for this discrepancy, we develop a more general venation theory. This theory describes linkages between vein density, leaf area and leaf thickness that can modulate LES correlations across scales. This theory helps to identify multiple selective pressures that can drive trait covariation underlying the LES.Synthesis. Our results broaden the range of biological scales at which the leaf economics spectrum (LES) is found and highlight the complex causal roles of venation networks in LES correlations. This study points to the need to better understand the coupling between venation networks, leaf size and climate to fully understand the LES.","authors":["Benjamin Blonder","Cyrille Violle","Brian J. Enquist","Hans Cornelissen"],"meta":["July 2013Journal of Ecology 101(4)","DOI:10.1111/1365-2745.12102"],"references":["281732550_Leaf_Trait_Diversification_and_Design_in_Seven_Rare_Taxa_of_the_Hawaiian_Plantago_Radiation","259956910_Photosynthetic_activity_chloroplast_ultrastructure_and_leaf_characteristics_of_high-light_and_low-light_plants_and_of_sun_and_shade_leaves","242585578_Viewing_leaf_structure_and_evolution_from_a_hydraulic_perspective","242448131_Causation_Prediction_and_Search","238656321_Generality_of_Leaf_Trait_Relationships_A_Test_across_Six_Biomes","236456883_Photosynthetically_relevant_foliar_traits_correlating_better_on_a_mass_vs_an_area_basis_Of_ecophysiological_relevance_or_just_a_case_of_mathematical_imperatives_and_statistical_quicksand","236160783_The_world-wide_leaf_economics_spectrum","346271931_GLOBAL-SCALE_CLIMATIC_CONTROLS_OF_LEAF_DRY_MASS_PER_AREA_DENSITY_AND_THICKNESS_IN_TREES_AND_SHRUBS","271804959_Relative_Growth-Rate_Its_Range_and_Adaptive_Significance_in_a_Local_Flora","260101916_Does_the_leaf_economic_spectrum_hold_within_local_species_pools_across_varying_environmental_conditions"]}