{"id":"263744705_Preventing_Shoulder-Surfing_Attack_with_the_Concept_of_Concealing_the_Password_Objects'_Information","abstract":"Traditionally, picture-based password systems employ password objects (pictures/icons/symbols) as input during an authentication session, thus making them vulnerable to \"shoulder-surfing\" attack because the visual interface by function is easily observed by others. Recent software-based approaches attempt to minimize this threat by requiring users to enter their passwords indirectly by performing certain mental tasks to derive the indirect password, thus concealing the user's actual password. However, weaknesses in the positioning of distracter and password objects introduce usability and security issues. In this paper, a new method, which conceals information about the password objects as much as possible, is proposed. Besides concealing the password objects and the number of password objects, the proposed method allows both password and distracter objects to be used as the challenge set's input. The correctly entered password appears to be random and can only be derived with the knowledge of the full set of password objects. Therefore, it would be difficult for a shoulder-surfing adversary to identify the user's actual password. Simulation results indicate that the correct input object and its location are random for each challenge set, thus preventing frequency of occurrence analysis attack. User study results show that the proposed method is able to prevent shoulder-surfing attack.","authors":["Peng Foong Ho","H.s. Kam","Meechin Wee","Yu Nam Chong"],"meta":["May 2014The Scientific World Journal 2014(7):838623","DOI:10.1155/2014/838623","SourcePubMed"],"references":["286816797_An_enhanced_mechanism_for_image_steganography_using_sequential_colour_cycle_Algorithm","266583345_Issues_Threats_and_Future_Trend_for_GSP","266177789_An_Enhanced_Mechanism_for_Image_Steganography_Using_Sequential_Colour_Cycle_Algorithm","266005342_Frequency_of_Occurrence_Analysis_Attack_and_Its_Countermeasure","261321339_Are_graphical_authentication_mechanisms_as_strong_as_passwords","256991692_UniSpaCh_A_text-based_data_hiding_method_using_Unicode_space_characters","255661573_StegCure_An_Amalgamation_of_Different_Steganographic_Methods_in_GIF_Image","255660592_Background_Pass-Go_BPG_a_New_Approach_for_GPS","254478407_MultiGrid_Background_Pass-Go","251423304_Usability_and_user_Authentication_Pictorial_passwords_vs_PIN"]}