{"id":"263791053_Resource_oriented_workflow_nets_and_workflow_resource_requirement_analysis","abstract":"Petri nets are a powerful formalism in modeling workflows. A workflow determines the flow of work according to pre-defined business process. In many situations, business processes are constrained by scarce resources. The lack of resources can cause contention, the need for some tasks to wait for others to complete, which slows down the accomplishment of larger goals. In our previous work, a resource-constrained workflow model was introduced and a resource requirement analysis approach was developed for emergency response workflows, in which support of on-the-fly workflow change is critical [14]. In this paper, we propose a Petri net based approach for recourse requirements analysis, which can be used for more general purposes. The concept of resource-oriented workflow nets (ROWN) is introduced and the transition firing rules of ROWN are presented. Resource requirements for general workflows can be done through reachability analysis. An efficient resource analysis algorithm is developed for a class of well-structured workflows, in which when a task execution is started it is guaranteed to finish successfully. For a task that may fail in the middle of execution, an equivalent non-failing task model in terms of resource consumption is developed.","authors":["Jiacun Wang","Demin Li"],"meta":["September 2013International Journal of Software Engineering and Knowledge Engineering 23(05)","DOI:10.1142/S0218194013400135"],"references":["254060972_Deadlock_Control_of_Automated_Manufacturing_Systems_Based_on_Petri_Nets-A_Literature_Review","252401643_Deadlock_Resolution_in_Automated_Manufacturing_Systems","228727014_Incident_command_systems_workflow_modeling_and_analysis_A_case_study","224397250_Emergency_Response_Workflow_Resource_Requirements_Modeling_and_Analysis","223096568_YAWL_Yet_another_workflow_language","220921057_Work_Distribution_Resource_Management_in_BPEL4People_Capabilities_Opportunities","220920449_Workflow_Resource_Patterns_Identification_Representation_and_Tool_Support","348868693_System_Modeling_and_Control_with_Resource-Oriented_Petri_Nets","247402463_Resource_modeling_in_work-ow_applications","220783394_Instance_Deadlock_A_Mystery_behind_Frozen_Programs"]}