{"id":"263766135_Cost-Effective_Implementation_of_Multicasting_in_Wavelength-Routed_Networks","abstract":"Multicasting in the optical domain has been recently shown to provide substantial savings in terms of the network-wide average packet hop distance and the total number of transceivers in the network. Current proposed multicasting architectures [e.g., Splitter-and-Delivery (SaD)] employ power splitting mechanisms which have the side effect of high fabrication cost due to the large number of splitters and the need for optical amplifiers. We propose a low-cost novel architecture called Tap-and-Continue (TaC) for realizing multicasting. This architecture provides a natural evolution from current unicast cross-connects and is based on tapping devices. We prove that any multicasting session can be feasibly realized in networks employing only TaC cross-connects, and the problem of finding the optimal multiple-destination minimum cost trail in such networks is NP-complete. Therefore, we develop a 4-approximation algorithm for multiple-destination routing. Simulation results demonstrate that the TaC cross-connect provides a realistic, cost-effective approach for implementing multicasting with negligible blocking degradation especially in multifiber networks. [IEEE ]","authors":["Ma Al","Jitender S. Deogun"],"meta":["December 2000Journal of Lightwave Technology 18(12)"],"references":["3720752_Optical_path_strategies_in_WDM_all-optical_networks_minimization_of_wavelength_converters_in_optical_cross_connects","3647369_Degree-constrained_multicasting_in_point-to-point_networks","3240145_Impact_of_Transmission_Impairments_on_the_Teletraffic_Performance_of_Wavelength-Routed_Optical_Networks","3234432_Power-efficient_design_of_multicast_wavelength-routed_networks","3232524_Routing_of_Multipoint_Connection","3198740_Architectures_for_Guided-Wave_Optical_Space_Switching_Systems","3196209_Differentiated_optical_services_model_for_WDM_networks","3158066_Lightpath_Communications_An_Approach_to_High_Bandwidth_Optical_WAN'S"]}