{"id":"263728851_How_specific_is_English_for_Academic_Purposes_A_look_at_verbs_in_business_linguistics_and_medical_research_articles","abstract":"English for Academic Purposes vocabulary teaching has been the subject of much debate. While some authors defend the idea of general academic vocabulary, others highlight the specificity inherent in each discipline. This article takes the debate one step further by analyzing the distribution of all the academic verbs found in the three-million-word Louvain Corpus of Research Articles (LOCRA). The aim is to distinguish the verbs which are shared across the three disciplines in the corpus (business, linguistics and medicine) from those which are specific to a particular discipline. Two vocabulary extraction methods are explored to extract the academic verbs, i.e. the keyness analysis (Scott 1997) and the analysis of relative frequencies. The results show that the combination of these two methods proves fruitful, as the analysis of relative frequencies brings out verbs that were overlooked by the keyness method. The distributional analysis of the academic verbs shows that general academic verbs represent, in each discipline, a much larger proportion than discipline-specific verbs, as they account for c. 50% of the total number of academic verb types and over 54% of the total number of verb tokens. A qualitative examination of the general academic verbs identified in LOCRA then shows how these verbs need to be presented in context to better describe their general academic uses and, in consequence, be more useful to learners.","authors":["Natassia Schutz"],"meta":["January 2013Language and Computers 77"],"references":["272167778_An_English_spoken_academic_word_list","323281503_Learning_Vocabulary_in_Another_Language","314925827_Extracting_a_bilingual_transdisciplinary_scientific_lexicon","313444784_Comparing_corpora_and_identifying_key_words_collocations_frequency_distributions_through_the_Wordsmith_Tool_suit_of_computer_programs","291905488_An_investigation_into_the_use_of_word_frequency_lists_in_computing_vocabulary_profiles","290804481_Trust_the_Text_Language_Corpus_and_Discourse","284543317_A_university_word_list","282565942_Is_there_an_academic_vocabulary","275779388_English_for_Specific_Purposes_A_Learning-Centred_Approach","269854502_English_for_Academic_Purposes_A_Guide_and_Resource_Book_for_Teachers"]}