{"id":"263899595_A_Comparative_Review_of_Component_Tree_Computation_Algorithms","abstract":"Connected operators are morphological tools that have the property of filtering images without creating new contours and without moving the contours that are preserved. Those operators are related to the max-tree and min-tree representations of images, and many algorithms have been proposed to compute those trees. However, no exhaustive comparison of these algorithms has been proposed so far, and the choice of an algorithm over another depends on many parameters. Since the need for fast algorithms is obvious for production code, we present an in-depth comparison of the existing algorithms in a unique framework, as well as variations of some of them that improve their efficiency. This comparison involves both sequential and parallel algorithms, and execution times are given w.r.t. the number of threads, the input image size, and the pixel value quantization. Eventually, a decision tree is given to help the user choose the most appropriate algorithm with respect to the user requirements. To favor reproducible research, an online demo allows the user to upload an image and bench the different algorithms, and the source code of every algorithms has been made available.","authors":["Edwin Carlinet","Thierry Géraud"],"meta":["July 2014IEEE Transactions on Image Processing 23(9)","DOI:10.1109/TIP.2014.2336551","SourcePubMed"],"references":["267085997_A_Quasi-linear_Algorithm_to_Compute_the_Tree_of_Shapes_of_nD_Images","265481739_Playing_with_Kruskal_Algorithms_for_Morphological_Trees_in_Edge-Weighted_Graphs","258655711_One-Dimensional_Openings_Granulometries_and_Component_Trees_in_O1_Per_Pixel","237061924_A_parallel_implementation_of_the_dual-input_Max-Tree_algorithm_for_attribute_filtering","228747458_1D_Component_tree_in_linear_time_and_space_and_its_application_to_gray-level_image_multithresholding","224812453_Morphological_Filtering_in_Shape_Spaces_Applications_using_Tree-BasedImage_Representations","233865924_A_fair_comparison_of_many_max-tree_computation_algorithms_Extendedversion_of_the_paper_submitted_to_ISMM_2013","230837999_Grayscale_area_openings_and_closings_their_efficient_implementation_and_applications","228057630_Data_Structures_and_Algorithms","222852790_Connected_Filtering_and_Segmentation_Using_Component_Trees"]}