{"id":"263807790_Kernel_Additive_Models_for_Source_Separation","abstract":"Source separation consists of separating a signal into additive components. It is a topic of considerable interest with many applications that has gathered much attention recently. Here, we introduce a new framework for source sepa-ration called Kernel Additive Modelling, which is based on local regression and permits efficient separation of multidimensional and/or nonnegative and/or non-regularly sampled signals. The main idea of the method is to assume that a source at some location can be estimated using its values at other locations nearby, where nearness is defined through a source-specific proximity kernel. Such a kernel provides an efficient way to account for features like periodicity, continuity, smoothness, stability over time or frequency, self-similarity, etc. In many cases, such local dynamics are indeed much more natural to assess than any global model such as a tensor factorization. This framework permits one to use different proximity kernels for different sources and to separate them using the iterative kernel backfitting algorithm we describe. As we show, kernel additive modelling generalizes many recent and efficient techniques for source separation and opens the path to creating and combining source models in a principled way. Experimental results on the separation of synthetic and audio signals demonstrate the effectiveness of the approach.","authors":["Antoine Liutkus","Derry Fitzgerald","Zafar Rafii","Bryan Pardo"],"meta":["August 2014IEEE Transactions on Signal Processing 62(16)","DOI:10.1109/TSP.2014.2332434"],"references":["265883529_MUSICVOICE_SEPARATION_USING_THE_SIMILARITY_MATRIX","263807677_On_the_use_of_masking_filters_in_sound_source_separation","261132715_Non-negative_dynamical_system_with_application_to_speech_and_audio","261042624_Adaptive_filtering_for_musicvoice_separation_exploiting_the_repeating_musical_structure","318494274_Auditory_Scene_Analysis_The_Perceptual_Organization_of_Sound","313528056_On_estimating_regression","279007619_Locally_Weighted_Regression_An_Approach_to_Regression_Analysis_by_Local_Fitting","269996418_Gaussian_Processes_for_Machine_Learning_Adaptive_Computation_and_Machine_Learning","268489038_Nonlinear_Signal_Processing_A_Statistical_Approach","261274093_Modeling_musical_instrument_tones_as_dynamic_textures"]}