{"id":"263895628_Modelo_para_valorar_las_organizaciones_al_iniciar_la_mejora_de_procesos_de_software","abstract":"La mejora de procesos de software se centra en mejorar la madurez del proceso y como consecuencia, la calidad del producto. La ejecución de una mejora resulta compleja; lo que impide que las organizaciones se decidan a iniciarla. Para enfrentar estas dificultades diferentes modelo proponen realizar un diagnóstico al iniciar la mejora de procesos de software, que incluye la evaluación de la organización con el objetivo de analizar y definir cómo mejorar las prácticas del desarrollo software. Las técnicas aplicadas en esta área se centran en identificar el estado de los procesos y no el estado de la organización integralmente y valorar las condiciones para iniciarla, el cual representan un punto de partida que condicionará el resultado. El objetivo principal de la investigación es elaborar un modelo para valorar las organizaciones desarrolladoras de software al iniciar la mejora de proceso, con el uso de indicadores y métricas, que tenga en cuenta la experiencia de los expertos para contribuir a minimizar el impacto negativo de los factores críticos de éxito. Como elementos originales el modelo incorpora el “qué” y el “cómo” valorar una organización en términos de indicadores y en función de los factores críticos de éxito. Esta propuesta contribuye a detectar las fortalezas y las debilidades para acometer el cambio y facilita el análisis de los riesgos. Finalmente se presenta la validación del modelo a través de un cuasiexperimento y se analizan los resultados obtenidos.","authors":["Yaimí Trujillo Casañola","Ailyn Febles","Giraldo León Rodriguez"],"meta":["September 2014Ingeniare 22(3):412-420","DOI:10.4067/S0718-33052014000300011"],"references":["260298932_SOFTWARE_PROCESS_MANAGEMENT_IN_TAIWAN'S_TOP_1000_COMPANIES_A_LONGITUDINAL_ANALYSIS","242016034_Barriers_to_Project_Performance","220449414_A_view_of_21st_century_healthcare_industry_and_software_quality_improvement_practices","40231468_Risk_analysis_of_software_process_measurements","283424808_Diagnostico_al_iniciar_la_mejora_de_proceso_de_software","283424692_La_gestion_de_informacion_y_los_factores_criticos_de_exito_en_la_mejora_de_procesos","224256031_The_Application_of_a_New_Process_Quality_Measurement_Model_for_Software_Process_Improvement_Initiatives","220520937_Tacit_Knowledge_and_Knowledge_Conversion_Controversy_and_Advancement_in_Organizational_Knowledge_Creation_Theory","4294519_Concept_Maps_Combined_with_Case-Based_Reasoning_in_Order_to_Elaborate_Intelligent_TeachingLearning_Systems"]}