{"id":"263814547_Camels_and_humps_a_retraction","abstract":"1 Background University computer-science departments mostly feel that they should teach their students to program. The academic computer-science community as a whole certainly doesn't know how to teach programming well and anecdotally one hears of widespread low achievement, high failure rates and attempts to mask the failure with administrative smokescreens. My own experience is, I believe, typical: in 35 years of trying to teach introductory programmming I never managed to teach more than a minority to program well, and a similarly-sized minority apparently failed to learn anything. In trying to overcome the problem it often seems to me that we have tried everything, and that we continue to try old things as if they were new. Although success is often trumpeted it somehow fails to find its way into communal practice, and failure is usually forgotten about (my own failure, for example, to teach programming through proof (Bornat, 1986)). Widespread low achievement in undergraduate programming studies is well known and well researched (see, for example, (Lister et al., 2004; Tolhurst et al., 2006; Fincher et al., 2005; Simon et al., 2006)). The question of failure rates is less well researched and is controversial (Bennedsen and Caspersen, 2007). There have been all kinds of attempts to find predictors of performance, with little success; Robins et al. (2003) gives a summary.","authors":["Richard Bornat"],"meta":["July 2014"],"references":["268151571_Falling_Behind_Early_and_Staying_Behind_When_Learning_to_Program","268151397_Blinded_by_their_Plight_Tracing_and_the_Preoperational_Programmer","234800767_A_Multi-National_Study_of_Reading_and_Tracing_Skills_in_Novice_Programmers","234792152_Do_map_drawing_styles_of_novice_programmers_predict_success_in_programming_A_multi-national_multi-institutional_study","228846667_Mental_models_consistency_and_programming_aptitude","228422771_Meta-analysis_of_the_effect_of_consistency_on_success_in_early_learning_of_programming","228338988_Multi-institutional_multi-national_studies_in_CSEd_Research_some_design_considerations_and_trade-offs","277852792_A_cognitive_study_of_learning_to_program_in_introductory_programming_courses","234486216_Programming_from_first_principles","228758380_Learning_edge_momentum_A_new_account_of_outcomes_in_CS1"]}