{"id":"263874546_ON_THE_EXISTENCE_OF_LOOKAHEAD_DELEGATORS_FOR_NFA","abstract":"We investigate deterministically simulating (i.e., solving the membership problem for) nondeterministic finite automata (NFA), relying solely on the NFA's resources (states and transitions). Unlike the standard NFA simulation, involving an algorithm which stores at each step all the states reached nondeterministically while reading the input, we consider deterministic finite automata (DFA) with lookahead, which choose the “right” NFA transitions based on a fixed number of input symbols read ahead. This concept, known as lookahead delegation, arose in a formal study of web services composition and its subsequent practical applications. Here we answer several related questions, such as “when is lookahead delegation possible?” and “how hard is it to find a delegator with a given lookahead buffer size?”. In particular, we show that only finite languages have the property that all their NFA have delegators. This implies, among others, that delegation is a machine property, rather than a language property. We also prove that the existence of lookahead delegators for unambiguous NFA is decidable, thus partially solving an open problem. Finally, we show that finding delegators (even for a given buffer size) is hard in general, and is more efficient for unambiguous NFA, and we give an algorithm and a compact characterization for NFA delegation in general.","authors":["Balaravikumar","Nicolaesantean"],"meta":["November 2011International Journal of Foundations of Computer Science 18(05)","DOI:10.1142/S0129054107005078","Sourcedx.doi.org"],"references":["221050722_Automated_composition_of_e-services_lookaheads","221050338_Automatic_Composition_of_E-services_That_Export_Their_Behavior","220520495_Quality-Aware_Service_Delegation_in_Automated_Web_Service_Composition_An_Automata-Theoretic_Approach","31593969_Handbook_of_Formal_Languages","4187344_Online_and_minimum-cost_ad_hoc_delegation_in_e-service_composition","319394622_Introduction_to_Automata_Theory_Languages_and_Computation_2nd_Edition","247931082_Introduction_to_automata_theory_languages_and_computation_-_2_ed","223702154_On_the_equivalence_containment_and_covering_problems_for_the_regular_and_context-free_languages","221543840_Composability_of_Infinite-State_Activity_Automata","221212986_Tools_for_Design_of_Composite_Web_Services","220617224_On_the_Equivalence_and_Containment_Problems_for_Unambiguous_Regular_Expressions_Regular_Grammars_and_Finite_Automata"]}