{"id":"263801375_Upper-truncated_power_law_distributions","abstract":"Power law cumulative number-size distributions are widely used to describe the scaling properties of data sets and to establish scale invariance. We derive the relationships between the scaling exponents of non-cumulative and cumulative number-size distributions for linearly binned and logarithmically binned data. Cumulative number-size distributions for data sets of many natural phenomena exhibit a \"fall-off\" from a power law at the largest object sizes. Previous work has often either ignored the fall-off region or described this region with a different function. We demonstrate that when a data set is abruptly truncated at large object size, fall-off from a power law is expected for the cumulative distribution. Functions to describe this fall-off are derived for both linearly and logarithmically binned data. These functions lead to a generalized function, the upper-truncated power law, that is independent of binning method. Fitting the upper-truncated power law to a cumulative number-size distribution determines the parameters of the power law, thus providing the scaling exponent of the data. Unlike previous approaches that employ alternate functions to describe the fall-off region, an upper-truncated power law describes the data set, including the fall-off, with a single function.","authors":["S. M. Burroughs","S. F. Tebbens"],"meta":["November 2011Fractals 09(02)","DOI:10.1142/S0218348X01000658"],"references":["269631702_Determination_of_total_strain_from_faulting_using_slip_measurements","241422471_Mechanics_of_continental_rift_architecture","233746851_Fault_Growth_in_Brittle-Ductile_Experiments_and_the_Mechanics_of_Continental_Collisions","268664281_Fractals_and_Chaos_in_Geology_and_Geophysics","258946129_Fractal_Viewpoint_of_Fracture_and_Accretion","252916692_A_Laboratory_and_Field_Study_of_Cobble_Abrasion","252404965_Seismicity_of_The_Earth_and_Associated_Phenomena","252090508_Fault_spacing_in_the_El_Teniente_Mine_central_Chile_Evidence_for_nonfractal_fault_geometry","223494523_Scaling_of_fault_displacements_from_the_Badajoz-Cordoba_shear_zone_SW_Spain","222502947_Sampling_power-law_distribution"]}