{"id":"263972496_Neural_correlates_of_dueling_affective_reactions_to_win-win_choices","abstract":"Win-win choices cause anxiety, often more so than decisions lacking the opportunity for a highly desired outcome. These anxious feelings can paradoxically co-occur with positive feelings, raising important implications for individual decision styles and general well-being. Across three studies, people chose between products that varied in personal value. Participants reported feeling most positive and most anxious when choosing between similarly high-valued products. Behavioral and neural results suggested that this paradoxical experience resulted from parallel evaluations of the expected outcome (inducing positive affect) versus the cost of choosing a response (inducing anxiety). Positive feelings were reduced when there was no high-value option, and anxiety was reduced when only one option was highly valued. Dissociable regions within the striatum and the medial prefrontal cortex (mPFC) tracked these dueling affective reactions during choice. Ventral regions, associated with stimulus valuation, tracked positive feelings and the value of the best item. Dorsal regions, associated with response valuation, tracked anxiety. In addition to tracking anxiety, the dorsal mPFC was associated with conflict during the current choice, and activity levels across individual items predicted whether that choice would later be reversed during an unexpected reevaluation phase. By revealing how win-win decisions elicit responses in dissociable brain systems, these results help resolve the paradox of win-win choices. They also provide insight into behaviors that are associated with these two forms of affect, such as why we are pulled toward good options but may still decide to delay or avoid choosing among them.","authors":["Amitai Shenhav","Randy L Buckner"],"meta":["July 2014Proceedings of the National Academy of Sciences 111(30)","DOI:10.1073/pnas.1405725111","SourcePubMed"],"references":["325671148_Belief_and_feeling_Evidence_for_an_accessibility_model_of_emotional_self-report","331021754_Choosing_the_lesser_of_two_evils_the_better_of_two_goods_Specifying_the_roles_of_ventromedial_prefrontal_cortex_and_dorsal_anterior_cingulate_in_object_choice","325680923_The_psychology_of_doing_nothing_Forms_of_decision_avoidance_result_from_reason_and_emotion","325671755_Conflict_monitoring_and_cognitive_control","312656700_Personality_and_the_Behavior_Disorders","291786346_The_Paradox_of_Choice_Why_More_is_Less","288951807_The_somatic_marker_hypothesis_A_neural_theory_of_economic_decision_Games","280786696_Behavioral_Inhibition_Behavioral_Activation_and_Affective_Responses_to_Impending_Reward_and_Punishment_The_BISBAS_Scales","276283372_Spending_Time_versus_Spending_Money","274539782_Opportunity_Costs-An_Experimental_Approach"]}