{"id":"264084789_Into_the_Square_-_On_the_Complexity_of_Quadratic-Time_Solvable_Problems","abstract":"This paper will analyze several quadratic-time solvable problems, and will\nclassify them into two classes: problems that are solvable in truly\nsubquadratic time (that is, in time $O(n^{2-\\epsilon})$ for some $\\epsilon>0$)\nand problems that are not, unless the well known Strong Exponential Time\nHypothesis (SETH) is false. In particular, we will prove that some\nquadratic-time solvable problems are indeed easier than expected. We will\nprovide an algorithm that computes the transitive closure of a directed graph\nin time $O(mn^{\\frac{\\omega+1}{4}})$, where $m$ denotes the number of edges in\nthe transitive closure and $\\omega$ is the exponent for matrix multiplication.\nAs a side effect, we will prove that our algorithm runs in time\n$O(n^{\\frac{5}{3}})$ if the transitive closure is sparse. The same time bounds\nhold if we want to check whether a graph is transitive, by replacing m with the\nnumber of edges in the graph itself. As far as we know, this is the fastest\nalgorithm for sparse transitive digraph recognition. Finally, we will apply our\nalgorithm to the comparability graph recognition problem (dating back to 1941),\nobtaining the first truly subquadratic algorithm. The second part of the paper\ndeals with hardness results. Starting from an artificial quadratic-time\nsolvable variation of the k-SAT problem, we will construct a graph of Karp\nreductions, proving that a truly subquadratic-time algorithm for any of the\nproblems in the graph falsifies SETH. The analyzed problems are the following:\ncomputing the subset graph, finding dominating sets, computing the betweenness\ncentrality of a vertex, computing the minimum closeness centrality, and\ncomputing the hyperbolicity of a pair of vertices. We will also be able to\ninclude in our framework three proofs already appeared in the literature,\nconcerning the graph diameter computation, local alignment of strings and\northogonality of vectors.","authors":["Michele Borassi","Pierluigi Crescenzi","Michel Habib"],"meta":["July 2014Electronic Notes in Theoretical Computer Science 322","DOI:10.1016/j.entcs.2016.03.005","SourcearXiv"],"references":["267868110_Diameters_centers_and_approximating_trees_of_d-hyperbolic_geodesic_spaces_and_graphs","265252616_Computing_Classic_Closeness_Centrality_at_Scale","307648826_Computing_the_Eccentricity_Distribution_of_Large_Graphs","291245832_On_the_Solvability_of_the_Six_Degrees_of_Kevin_Bacon_Game","284504804_Finding_orthogonal_vectors_in_discrete_structures","284039089_Reducibility_among_combinatorial_problems","282766686_New_lower_bounds_for_Hopcroft's_problem","280765566_Lex-BFS_and_partition_refinement_with_applications_to_transitive_orientation_interval_graph_recognition_and_consecutive_ones_testing","265681744_Hyperbolic_Groups","265218525_Exact_and_approximate_algorithms_for_computing_the_hyperbolicity_of_large-scale_graphs"]}