{"id":"264127084_Microstructural_Changes_in_the_Striatum_and_Their_Impact_on_Motor_and_Neuropsychological_Performance_in_Patients_with_Multiple_Sclerosis","abstract":"Grey matter (GM) damage is a clinically relevant feature of multiple sclerosis (MS) that has been previously assessed with diffusion tensor imaging (DTI). Fractional anisotropy (FA) of the basal ganglia and thalamus might be increased in MS patients, and correlates with disability scores. Despite the established role of the striatum and thalamus in motor control, mood and cognition, the impact of DTI changes within these structures on motor and neuropsychological performance has not yet been specifically addressed in MS. We investigated DTI metrics of deep GM nuclei and their potential association with mobility and neuropsychological function. DTI metrics from 3T MRI were assessed in the caudate, putamen, and thalamus of 30 MS patients and 10 controls. Sixteen of the patients underwent neuropsychological testing. FA of the caudate and putamen was higher in MS patients compared to controls. Caudate FA correlated with Expanded Disability Status Scale score, Ambulation Index, and severity of depressive symptomatology. Putamen and thalamus FA correlated with deficits in memory tests. In contrast, cerebral white matter (WM) lesion burden showed no significant correlation with any of the disability, mobility and psychometric parameters. Our findings support evidence of FA changes in the basal ganglia in MS patients, as well as deep GM involvement in disabling features of MS, including mobility and cognitive impairment. Deep GM FA appears to be a more sensitive correlate of disability than WM lesion burden.","authors":["Michele Cavallari","Antonia Ceccarelli","Guang-Yi Wang","Nicola Moscufo"],"meta":["July 2014PLoS ONE 9(7):e101199","DOI:10.1371/journal.pone.0101199","SourcePubMed","Project: Magnetic Resonance Imaging in Multiple Sclerosis"],"references":["313071026_The_CES-D_Scale_A_self-report_depression_scale_for_research_in_the_general_popula-_tion","309079388_The_histology_of_multiple_sclerosis","299313616_Altered_diffusion_tensor_in_multiple_sclerosis_normal-appearing_brain_changes_seem_related_to_tissue_Cortical_diffusion_clinical_deterioration_vol_23_pg_628_2006","284247370_The_histology_of_diseminated_sclerosis","280321363_Hirnrindenbefunde_bei_multipler_Sklerose","277519200_Use_of_the_Multiple_Sclerosis_Functional_Composite_as_an_Outcome_Measure_in_a_Phase_3_Clinical_Trial","265356101_Correcting_for_Motion_between_Acquisitions_in_Diffusion_MR_Imaging","243548914_The_CES-D_Scale_A_Self-Report_Depression_Scale_for_Research_in_the_General_Population","233922758_Free-Energy_Relationships_in_Ion_Channels_Dually_Activated_by_Voltage_and_Ligand","227797404_Altered_diffusion_tensor_in_multiple_sclerosis_normal-appearing_brain_tissue_Cortical_diffusion_changes_seem_related_to_clinical_deterioration"]}