{"id":"264122912_Are_there_good_mistakes_A_theoretical_analysis_of_CEGIS","abstract":"Counterexample-guided inductive synthesis CEGIS is used to synthesize\nprograms from a candidate space of programs. The technique is guaranteed to\nterminate and synthesize the correct program if the space of candidate programs\nis finite. But the technique may or may not terminate with the correct program\nif the candidate space of programs is infinite. In this paper, we perform a\ntheoretical analysis of counterexample-guided inductive synthesis technique. We\ninvestigate whether the set of candidate spaces for which the correct program\ncan be synthesized using CEGIS depends on the counterexamples used in inductive\nsynthesis, that is, whether there are good mistakes which would increase the\nsynthesis power. We investigate whether the use of minimal counterexamples\ninstead of arbitrary counterexamples expands the set of candidate spaces of\nprograms for which inductive synthesis can successfully synthesize a correct\nprogram. We consider two kinds of counterexamples: minimal counterexamples and\nhistory bounded counterexamples. The history bounded counterexample used in any\niteration of CEGIS is bounded by the examples used in previous iterations of\ninductive synthesis. We examine the relative change in power of inductive\nsynthesis in both cases. We show that the synthesis technique using minimal\ncounterexamples MinCEGIS has the same synthesis power as CEGIS but the\nsynthesis technique using history bounded counterexamples HCEGIS has different\npower than that of CEGIS, but none dominates the other.","authors":["Susmit Jha","Sanjit A. Seshia"],"meta":["July 2014","DOI:10.4204/EPTCS.157.10","SourcearXiv"],"references":["341351834_Systems_That_Learn_An_Introduction_to_Learning_Theory","308607126_From_program_verification_to_program_synthesis","265930097_Program_Synthesis_By_Sketching","262158679_MaxSAT-based_MCS_enumeration","248186066_Types_of_Queries_for_Concept_Learning","247695766_Systems_That_Learn-An_Introduction_to_Learning_Theory","239553617_Superoptimizer_a_look_at_the_shortest_program","234816184_Classifying_learnable_geometric_concepts_with_the_Vapnik-Chervonenkis_dimension","228333601_Counterexample-guided_Planning","226947811_Toward_Efficient_Agnostic_Learning"]}