{"id":"264161297_A_scatter_search_algorithm_for_the_distributed_permutation_flowshop_scheduling_problem","abstract":"The distributed permutation flowshop problem has been recently proposed as a generalization of the regular flowshop setting where more than one factory is available to process jobs. Distributed manufacturing is a common situation for large enterprises that compete in a globalized market. The problem has two dimensions: assigning jobs to factories and scheduling the jobs assigned to each factory. Despite being recently introduced, this interesting scheduling problem has attracted attention and several heuristic and metaheuristic methods have been proposed in the literature. In this paper we present a scatter search (SS) method for this problem to optimize makespan. SS has seldom been explored for flowshop settings. In the proposed algorithm we employ some advanced techniques like a reference set made up of complete and partial solutions along with other features like restarts and local search. A comprehensive computational campaign including 10 existing algorithms, together with statistical analyses, shows that the proposed scatter search algorithm produces better results than existing algorithms by a significant margin. Moreover all 720 known best solutions for this problem are improved.","authors":["Bashir Naderi","Rubén Ruiz"],"meta":["December 2014European Journal of Operational Research 239(2):323–334","DOI:10.1016/j.ejor.2014.05.024"],"references":["321609883_Computational_Intelligence_in_Flow_Shop_and_Job_Shop_Scheduling","321608342_Integrated_Product_Process_and_Enterprise_Design","284669700_A_Template_for_Scatter_Search_and_Path_Relinking_Artificial_Evolution_Lecture_Notes_in_Computer_Science_1363","284536374_Design_and_Analysis_of_Experiments","280017485_An_NEH-based_heuristic_algorithm_for_distributed_permutation_flowshop_scheduling_problems","279542499_Solving_multi-factory_flowshop_problems_with_a_novel_variable_neighbourhood_descent_algorithm","272852544_A_Knowledge-based_Genetic_Algorithm_for_Permutation_Flowshop_Scheduling_Problems_with_Multiple_Factories","271885086_A_comprehensive_review_and_evaluation_of_permutation_flowshop_heuristics","268615524_Developments_of_Variable_Neighborhood_Search","267056678_Scheduling_Theory_algorithms_and_systems_4th_ed"]}