{"id":"264107210_Data_Mining_Tool_for_Stock_Investors'_Decision_Support","abstract":"There are many investors in the stock market, and more and more people get interested in the stock investment. In order to avoid risks and make profit in the stock investment, we have to determine several aspects using various information. That is, we have to select profitable stocks and determine appropriate buying/selling prices and holding period. This paper proposes a data mining tool for the investors' decision support. The data mining tool makes stock investors apply machine learning techniques and generate stock price prediction model. Also it helps determine buying/selling prices and holding period. It supports individual investor's own decision making using past data. Using the proposed tool, users can manage stock data, generate their own stock price prediction models, and establish trading policy via investment simulation. Users can select technical indicators which they think affect future stock price. Then they can generate stock price prediction models using the indicators and test the models. They also perform investment simulation using proper models to find appropriate trading policy consisting of buying/selling prices and holding period. Using the proposed data mining tool, stock investors can expect more profit with the help of stock price prediction model and trading policy validated on past data, instead of with an emotional decision.","authors":["Sung Dong Kim"],"meta":["February 2012The Journal of the Korea Contents Association 12(2)","DOI:10.5392/JKCA.2012.12.02.472"],"references":["238747905_A_Hybrid_Machine_Learning_System_for_Stock_Market_Forecasting","222489987_Forecasting_With_Artificial_Neural_Networks_The_State_of_the_Art","44260645_Financial_Stock_Market_Forecast_using_Data_Mining_Techniques","265317409_Machine_Learning_Techniques_for_Stock_Prediction","225877897_Time_Series_Prediction_and_Neural_Networks","44259647_Stock_Price_Forecasting_by_Hybrid_Machine_Learning_Techniques","24127430_Financial_Time_Series_Forecasting_By_Neural_Network_Using_Conjugate_Gradient_Learning_Algorithm_And_Multiple_Linear_Regression_Weight_Initialization"]}