{"id":"264160616_Identifying_Codes_in_Hereditary_Classes_of_Graphs_and_VC-Dimension","abstract":"An identifying code of a graph is a subset of its vertices such that every\nvertex of the graph is uniquely identified by the set of its neighbours within\nthe code. We show a dichotomy for the size of the smallest identifying code in\nclasses of graphs closed under induced subgraphs. Our dichotomy is derived from\nthe VC-dimension of the considered class C, that is the maximum VC-dimension\nover the hypergraphs formed by the closed neighbourhoods of elements of C. We\nshow that hereditary classes with infinite VC-dimension have infinitely many\ngraphs with an identifying code of size logarithmic in the number of vertices\nwhile classes with finite VC-dimension have a polynomial lower bound.\nWe then turn to approximation algorithms. We show that the problem of finding\na smallest identifying code in a given graph from some class is log-APX-hard\nfor any hereditary class of infinite VC-dimension. For hereditary classes of\nfinite VC-dimension, the only known previous results show that we can\napproximate the identifying code problem within a constant factor in some\nparticular classes, e.g. line graphs, planar graphs and unit interval graphs.\nWe prove that it can be approximate within a factor 6 for interval graphs. In\ncontrast, we show that on C_4-free bipartite graphs (a class of finite\nVC-dimension) it cannot be approximated to within a factor of c.log(|V|) for\nsome c>0.","authors":["Nicolas Bousquet","Aurélie Lagoutte","Zhentao Li","Aline Parreau"],"meta":["July 2014SIAM Journal on Discrete Mathematics 29(4)","DOI:10.1137/14097879X","SourcearXiv"],"references":["279833338_Combinatorial_and_algorithmic_aspects_of_identifying_codes_in_graphs","264911602_On_location-domination_numbers_for_certain_classes_of_graphs","263369699_Complexity_results_for_identifying_codes_in_planar_graphs","279389455_Large_Scale_Linear_and_Integer_Optimization_A_Unified_Approach","279345542_Large_Scale_Linear_and_Integer_Optimization_A_Unified_Approach","265386330_Decision_and_approximation_complexity_for_identifying_codes_and_locating-dominating_sets_in_restricted_graph_classes","263032432_Identification_location-domination_and_metric_dimension_on_interval_and_permutation_graphs_I_Bounds","262264530_Identification_Location-Domination_and_Metric_Dimension_on_Interval_and_Permutation_Graphs_II_Algorithms_and_Complexity","257650319_Complexity_and_Approximation","239311106_On_graphs_on_n_vertices_having_an_identifying_code_of_cardinality"]}