{"id":"264160686_Learning_Rich_Features_from_RGB-D_Images_for_Object_Detection_and_Segmentation","abstract":"In this paper we study the problem of object detection for RGB-D images using\nsemantically rich image and depth features. We propose a new geocentric\nembedding for depth images that encodes height above ground and angle with\ngravity for each pixel in addition to the horizontal disparity. We demonstrate\nthat this geocentric embedding works better than using raw depth images for\nlearning feature representations with convolutional neural networks. Our final\nobject detection system achieves an average precision of 37.3%, which is a 56%\nrelative improvement over existing methods. We then focus on the task of\ninstance segmentation where we label pixels belonging to object instances found\nby our detector. For this task, we propose a decision forest approach that\nclassifies pixels in the detection window as foreground or background using a\nfamily of unary and binary tests that query shape and geocentric pose features.\nFinally, we use the output from our object detectors in an existing superpixel\nclassification framework for semantic scene segmentation and achieve a 24%\nrelative improvement over current state-of-the-art for the object categories\nthat we study. We believe advances such as those represented in this paper will\nfacilitate the use of perception in fields like robotics.","authors":["Saurabh Gupta","Ross Girshick","Pablo Arbelaez","Jitendra Malik"],"meta":["July 2014","DOI:10.1007/978-3-319-10584-0_23","SourcearXiv","Conference: European Conference on Computer Vision"],"references":["319770357_DeCAF_A_Deep_Convolutional_Activation_Feature_for_Generic_Visual_Recognition","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","314100361_Indoor_Segmentation_and_Support_Inference_from_RGBD_Images","313619815_Unsupervised_feature_learning_for_RGB-D_based_object_recognition","306548709_Histogram_of_oriented_normal_vectors_for_object_recognition_with_a_depth_sensor","303003338_Semantic_labeling_of_3d_point_clouds_for_indoor_scenes","288906520_Random_forests","286943772_Discriminatively_trained_sparse_code_gradients_for_contour_detection","286594360_Multiscale_Combinatorial_Grouping","285416982_Images"]}