{"id":"26414473_Educacao_Permanente_em_Saude_descentralizacao_e_disseminacao_de_capacidade_pedagogica_na_saude","abstract":"O texto discute a relevância e a viabilidade de disseminar capacidade pedagógica por toda a rede do Sistema Único de Sáude, de forma que se cumpra uma das mais nobres metas formuladas pela saúde coletiva no Brasil: tornar a rede pública de saúde uma rede de ensino-aprendizagem no exercício do trabalho. O conceito de educação permanente em saúde serve para dimensionar esta tarefa, não no prolongamento do tempo/carreira, mas na ampla intimidade e intercessão educação/atenção na área de saberes e de práticas em saúde. O exercício concreto desta meta se fez como política pública de maneira inédita no Brasil, apresentada pelo Departamento de Gestão da Educação na Saúde, do Ministério da Saúde, em 2003. A política pública criou um novo \"dispositivo\" no SUS: os Pólos de Educação Permanente em Saúde, que no espaço de 16 meses foram capazes de aglutinar 1.122 entidades segundo as bases locorregionais com que se organizaram, cumprindo o art. 14, da Lei Orgânica da Saúde, tal como se previu no ideário de lutas da reforma sanitária brasileira. Criar um novo dispositivo não foi um ato formal, mas de construção, priorizar a educação dos profissionais de saúde como ação finalística (e não meio) é o original de novidade apresentado por este texto, documento de uma produção concreta.","authors":["Ricardo Ceccim"],"meta":["December 2005Ciencia & Saude Coletiva 10(4)","DOI:10.1590/S1413-81232005000400020"],"references":["250989288_Comentarios_estimulados_por_la_lectura_del_articulo_Educacao_permanente_em_saude_desafio_ambicioso_e_necessario","250989287_O_desafio_que_a_educacao_permanente_tem_em_si_a_pedagogia_da_implicacao","250988452_O_quadrilatero_da_formacao_para_a_area_da_saude_ensino_gestao_atencao_e_controle_social","237471536_Educacao_Permanente_em_Saude_desafio_ambicioso_e_necessario","26370211_O_que_dizem_a_legislacao_e_o_controle_social_em_saude_sobre_a_formacao_de_recursos_humanos_e_o_papel_dos_gestores_publicos_no_Brasil"]}