{"id":"264201582_Medical_student_syndrome_fact_or_fiction_A_cross-sectional_study","abstract":"Objectives: \nIt is often reported by medical practitioners that medical students develop hypochondriacal concerns and symptoms relating to diseases they are studying, a phenomenon labelled 'medical student syndrome'. However, the evidence that this syndrome exists and particularly that it contributes to an increased number of consultations (as typical hypochondriasis does) is weak. The present study investigates this phenomenon in terms of differences between medical and non-medical students in help-seeking behaviour.\n\nDesign: \nCross-sectional survey.\n\nSetting: \nThree universities in London.\n\nParticipants: \nMedical students (n = 103), non-medical science student controls (n = 107) and law student controls (n = 78), all third-year undergraduates, were recruited from within their universities.\n\nMain outcome measures: \nHelp-seeking behaviour was measured using the 'Health Anxiety Questionnaire' reassurance-seeking behaviour subscale; the overall number of doctors' visits made for new health complaints since beginning university; a new 'Hypochondriacal and Help-Seeking Behaviour' scoring-system, which asked questions pertaining to not just the number but the nature of consultations, identifying participants who had experienced health concerns that were disproportionate to the diseases diagnosed.\n\nResults: \nNo significant differences were found between medical students and either control group in any of the main outcome variables.\n\nConclusions: \nThese findings fail to support the notion that medical students, more so than other students, seek medical advice for hypochondriacal health concerns. They are pertinent to clinicians due to the potentially negative consequences of incorrectly assuming medical students to behave in this way, including cursory evaluations and disintegration of the doctor-patient relationship.","authors":["Lauren Z Waterman","John Weinman"],"meta":["February 2014JRSM Open 5(2):2042533313512480","DOI:10.1177/2042533313512480","SourcePubMed"],"references":["45284327_Reassuring_the_medical_students'_disease_-_Health_related_anxiety_among_medical_students","44670744_Health_anxiety_and_hypochondriasis_Description_and_treatment_issues_highlighted_through_a_case_illustration","299272316_Behavioral_medicine_approaches_to_somatoform_disorders","277706837_Hypochondriacal_Fears_and_Beliefs_in_Medical_and_Law_Students","275581377_Cognitive_Therapy_of_Anxiety_Disorders_A_Practice_Manual_and_Conceptual_Guide","236017807_Diagnostic_and_Statistical_Manual_of_Mental_Disorders_DSM-V","234025773_The_Health_Anxiety_Questionnaire","51402751_Advances_in_understanding_illness_anxiety","24200369_Inaccurate_perception_of_asthma_symptoms_A_cognitive-affective_framework_and_implications_for_asthma_treatment","24182511_The_perils_of_cyberchondria"]}