{"id":"264205341_A_Catalogue_of_Digital_Editions","abstract":"Since the earliest days of hypertext, textual scholars have produced, discussed and theorised upon critical digital editions of manuscripts, in order to investigate how digital technologies can provide another means to present and enable the interpretative study of text. This work has generally been done by looking at particular case studies or examples of critical digital editions, and, as a result, there is no overarching understanding of how digital technologies have been employed across the full range of textual interpretations. This chapter will describe the creation of a catalogue of digital editions that could collect information about extant digital editions and, in so doing, contribute to research in related disciplines. The resulting catalogue will provide a means of answering, in the form of a quantitative survey, the following research questions: What makes a good digital edition? What features do digital editions share? What is the state of the art in the field of digital editions? Why are there so few electronic editions of ancient texts, and so many of texts from other periods? By collecting data regarding existing digital editions, and corresponding directly with the projects in question, we provide a unique record of extant digital critical editions of text across a range of subject areas, and show how this collaboratively edited catalogue can benefit the Digital Humanities community.","authors":["Greta Franzini","Melissa Terras","Simon Mahony"],"meta":["August 2016","DOI:10.11647/OBP.0095","In book: Digital Scholarly Editing: Theories and Practices (pp.161-182)Chapter: A Catalogue of Digital EditionsPublisher: Open Book PublishersEditors: Elena Pierazzo, Matthew Driscoll"],"references":["317268641_After_the_editing_is_done_Designing_a_Graphic_User_Interface_for_digital_editions","350307533_Kollation_und_Satztechnik_als_Vorbereitung_fur_eine_kritische_Edition","350306716_The_Italian_'Third_Way'_of_Editing_between_Globalization_and_Localization","350271848_Digital_Editions_in_the_Net_Perspectives_for_Scholarly_Editing_in_a_Digital_World","344810392_Women_authors_and_women's_literacy_in_fourteenth-_and_fifteenth-century_England","342409083_The_Culture_of_Correction_in_Renaissance_Europe","329866420_The_Inward_Turn_of_Narrative","324377496_Truth_and_Mourning_in_a_Sonnet_by_Surrey","324321533_Writing_Women's_Literary_History","317268575_Research_communities_and_open_collaboration_the_example_of_the_Digital_Classicist_wik"]}