{"id":"264205241_Errare_machinale_est_The_use_of_error-related_potentials_in_brain-machine_interfaces","abstract":"The ability to recognize errors is crucial for efficient behavior. Numerous studies have identified electrophysiological correlates of error recognition in the human brain (error-related potentials, ErrPs). Consequently, it has been proposed to use these signals to improve human-computer interaction (HCI) or brain-machine interfacing (BMI). Here, we present a review of over a decade of developments toward this goal. This body of work provides consistent evidence that ErrPs can be successfully detected on a single-trial basis, and that they can be effectively used in both HCI and BMI applications. We first describe the ErrP phenomenon and follow up with an analysis of different strategies to increase the robustness of a system by incorporating single-trial ErrP recognition, either by correcting the machine's actions or by providing means for its error-based adaptation. These approaches can be applied both when the user employs traditional HCI input devices or in combination with another BMI channel. Finally, we discuss the current challenges that have to be overcome in order to fully integrate ErrPs into practical applications. This includes, in particular, the characterization of such signals during real(istic) applications, as well as the possibility of extracting richer information from them, going beyond the time-locked decoding that dominates current approaches.","authors":["Ricardo Chavarriaga","Aleksander Sobolewski","Jose del R. Millan"],"meta":["July 2014Frontiers in Neuroscience 8","DOI:10.3389/fnins.2014.00208","Project: CNBI@NCCR-Robotics"],"references":["313432479_Learning_dictionaries_of_spatial_and_temporal_EEG_primitives_for_brain-computer_interfaces","312944319_Simultaneous_Real-Time_Detection_of_Motor_Imagery_and_Error-Related_Potentials_for_Improved_BCI_Accuracy","296775614_Proceedings_-_2009_3rd_International_Conference_on_Affective_Computing_and_Intelligent_Interaction_and_Workshops_ACII_2009_Foreword","281353803_A_review_of_classification_algorithms_for_EEG-based_brain-computer_interfaces","267366125_Implementation_of_Error_Detection_into_the_Graz-Brain-Computer_Interface_the_Interaction_Error_Potential","318940506_Errors_in_reward_prediction_are_reflected_in_the_event-related_brain_potential","288901060_Enhancing_human-machine_systems_with_secondary_input_from_passive_brain-computer_interfaces","281399769_In_Proceedings_of_the_IEEE_international_conference_on_systems_man_and_cybernetics","278062247_The_neural_basis_of_human_error_processing_Reinforcement_learning_dopamine_and_the_error-related_negativity","272161307_Reinforcement_Learning_An_Introduction"]}