{"id":"264310273_On_the_performance_of_Linkage-tree_Genetic_Algorithms_for_the_multidimensional_knapsack_problem","abstract":"Model-based Genetic Algorithms (GAs), as the Linkage-tree GA (LTGA) and most Estimation of Distribution Algorithms (EDAs), assume a reductionist perspective when solving optimization problems. They use machine-learning techniques to discover problem's substructures that might be useful to generate new solutions. This idea, was grounded on Simon's near-decomposability principle and Holland's Building-block (BB)-hypothesis, and have enabled the development of effective algorithms in some contexts. Although near-decomposability is commonly seen in nature, we cannot assume the same occurs for optimization problems. Therefore, the existence of problems where these algorithms are not effective is also focus of research. Recent studies have argued that Multidimensional Knapsack Problems (MKP) are examples of such cases. This paper extends these studies with an extensive comparison of various LTGA variants for the MKP. Using a well-known GA as reference, we analyzed the difficulties faced by the LTGA and explained why its linkage-tree model is not of much help to solve the problem. The results have shown that the LTGA was not able to outperform the GA and performed very similarly to a LTGA using random linkage-models. Further analysis of the linkage-trees, grounded on the knapsack-core concept, enabled interesting conclusions about the reasons linkage-learning did not provide useful information to solve MKP in the settings used for the experiments.","authors":["Jean Paulo Martins","Carlos M. Fonseca","Alexandre C. B. Delbem"],"meta":["July 2014Neurocomputing 146:17-29","DOI:10.1016/j.neucom.2014.04.069","Project: Analysis of linkage learning in evolutionary optimization"],"references":["277224988_Analyzing_limits_of_effectiveness_in_different_implementations_of_estimation_of_distribution_algorithms","313706874_Adaptation_in_natural_and_artificial_systems","281611716_HEURISTIC_WITH_TIE_BREAKING_FOR_CERTAIN_0-1_INTEGER_PROGRAMMING_MODELS","281266055_No_Free_Lunch_Theorems_for_Optimization","278690128_Knapsack_Problems","263325354_A_Branch_and_Bound_Method_for_the_Multiconstraint_Zero-One_Knapsack_Problem","262411249_On_measures_to_build_linkage_trees_in_LTGA","260166917_Particle_Swarm_Optimization_with_Time-Varying_Acceleration_Coefficients_for_the_Multidimensional_Knapsack_Problem","259170633_Improved_binary_artificial_fish_swarm_algorithm_for_the_0-1_multidimensional_knapsack_problems","258905371_Decomposition_of_Black-Box_Optimization_Problems_by_Community_Detection_in_Bayesian_Networks","257200119_Evolutionary_Computation_Meets_Machine_Learning_A_Survey","243770938_Meta-Heuristics","257739789_An_introduction_and_survey_of_estimation_of_distribution_algorithms","257351970_A_novel_modified_binary_differential_evolution_algorithm_and_its_applications","256721317_Linkage_learning_by_number_of_function_evaluations_estimation_Practical_view_of_building_blocks"]}