{"id":"264312333_A_Fast_Hierarchical_Method_for_Multi-script_and_Arbitrary_Oriented_Scene_Text_Extraction","abstract":"Typography and layout lead to the hierarchical organisation of text in words,\ntext lines, paragraphs. This inherent structure is a key property of text in\nany script and language, which has nonetheless been minimally leveraged by\nexisting text detection methods. This paper addresses the problem of text\nsegmentation in natural scenes from a hierarchical perspective. Contrary to\nexisting methods, we make explicit use of text structure, aiming directly to\nthe detection of region groupings corresponding to text within a hierarchy\nproduced by an agglomerative similarity clustering process over individual\nregions. We propose an optimal way to construct such an hierarchy introducing a\nfeature space designed to produce text group hypotheses with high recall and a\nnovel stopping rule combining a discriminative classifier and a probabilistic\nmeasure of group meaningfulness based in perceptual organization. Results\nobtained over four standard datasets, covering text in variable orientations\nand different languages, demonstrate that our algorithm, while being trained in\na single mixed dataset, outperforms state of the art methods in unconstrained\nscenarios.","authors":["Lluis Gomez","Dimosthenis Karatzas"],"meta":["December 2016International Journal on Document Analysis and Recognition (IJDAR) 19(4)","DOI:10.1007/s10032-016-0274-2","SourcearXiv"],"references":["283954359_Multilingual_Text_Detection_with_Nonlinear_Neural_Network","277553590_Robust_Scene_Text_Detection_with_Convolution_Neural_Network_Induced_MSER_Trees","319770170_Deep_Features_for_Text_Spotting","298992100_Object_countArea_Graphs_for_the_Evaluation_of_Object_Detection_and_Segmentation_Algorithms","292744761_Machine_learning_improved_boosting_algorithms_using_confidence-rated_predictions","286813746_Strokelets_A_Learned_Multi-scale_Representation_for_Scene_Text_Recognition","283921280_Visual_Pattern_Recognition_by_Moment_Invariants","280865150_Multi-Spectral_Fusion_Based_Approach_for_Arbitrarily_Oriented_Scene_Text_Detection_in_Video_Images","280632074_Multi-Orientation_Scene_Text_Detection_with_Adaptive_Clustering","272396379_Fast_and_accurate_scene_text_understanding_with_image_binarization_and_off-the-shelf_OCR"]}