{"id":"264458092_Masking_against_Side-Channel_Attacks_A_Formal_Security_Proof","abstract":"Masking is a well-known countermeasure to protect block cipher implementations against side-channel attacks. The principle is to randomly split every sensitive intermediate variable occurring in the computation into d+1 shares, where d is called the masking order and plays the role of a security parameter. Although widely used in practice, masking is often considered as an empirical solution and its effectiveness is rarely proved. In this paper, we provide a formal security proof for masked implementations of block ciphers. Specifically, we prove that the information gained by observing the leakage from one execution can be made negligible (in the masking order). To obtain this bound, we assume that every elementary calculation in the implementation leaks a noisy function of its input, where the amount of noise can be chosen by the designer (yet linearly bounded). We further assume the existence of a leak-free component that can refresh the masks of shared variables. Our work can be viewed as an extension of the seminal work of Chari et al.published at CRYPTO in 1999 on the soundness of combining masking with noise to thwart side-channel attacks.","authors":["Emmanuel Prouff","Matthieu Rivain"],"meta":["May 2013","DOI:10.1007/978-3-642-38348-9_9","Conference: Advances in Cryptology - EUROCRYPT 2013, 32nd Annual International Conference on the Theory and Applications of Cryptographic Techniques","Project: PRINCE"],"references":["264458001_Provably_Secure_Higher-Order_Masking_of_AES","262162590_Higher-Order_Masking_Schemes_for_S-Boxes","267185998_How_to_Compute_under_calACsf0_Leakage_without_Secure_Hardware","265527793_Leakage-Resilient_ElGamal","262356200_Leakage-Resilient_Circuits_without_Computational_Assumptions","261455354_How_to_Compute_in_the_Presence_of_Leakage","244456894_DES_and_Differential_Power_Analysis","242587987_Timing_attacks_on_implementations_of_Diffie-Hellman","232626171_Safeguarding_cryptographic_keys_PDF","226854771_Leakage-Resilient_Signatures"]}