{"id":"264497823_The_Value_of_Help_Bits_in_Randomized_and_Average-Case_Complexity","abstract":"“Help bits\" are some limited trusted information about an instance or instances of a computational problem that may reduce the computational complexity of solving that instance or instances. In this paper, we study the value of help bits in the settings of randomized and average-case complexity.\nIf k instances of a decision problem can be efficiently solved using \\({\\ell < k}\\) help bits, then without access to help bits one can efficiently compute a k-bit vector that is not equal to the k-bit vector of solutions to the k instances. A decision problem with this property is called k-membership comparable.\nAmir, Beigel, and Gasarch (1990) show that for constant k, all k-membership comparable languages are in P/poly. We extend this result to the setting of randomized computation: We show that for k at most logarithmic, the decision problem is k-membership comparable if using \\({\\ell}\\) help bits, k instances of the problem can be efficiently solved with probability greater than \\({2^{\\ell-k}}\\). The same conclusion holds if using less than \\({k(1 - h(\\alpha))}\\) help bits (where \\({h(\\cdot)}\\) is the binary entropy function), we can efficiently solve \\({1-\\alpha}\\) fraction of the instances correctly with non-vanishing probability. We note that when k is constant, k-membership comparability implies being in P/poly.\nNext we consider the setting of average-case complexity: Assume that we can solve k instances of a decision problem using some help bits whose entropy is less than k when the k instances are drawn independently from a particular distribution. Then we can efficiently solve an instance drawn from that distribution with probability better than 1/2. Finally, we show that in the case where k is super-logarithmic, assuming k-membership comparability of a decision problem, one cannot prove that the problem is in P/poly by a “relativizing\" proof technique. All previous known proofs in this area have been relativizing.","authors":["Salman Beigi","Omid Etesami","Amin Gohari"],"meta":["March 2017computational complexity 26(1)","DOI:10.1007/s00037-016-0135-x","SourcearXiv"],"references":["243764125_OptP_as_the_normal_behavior_of_NP-complete_problems","262236190_One_help-bit_doesn't_help","258239683_The_theory_of_error-correcting_codes_Parts_I_II","243780933_The_Synthesis_of_Two-Terminal_Switching_Circuits","242371333_The_Theory_of_Error_Correcting_Codes","223601014_Some_connections_between_bounded_query_classes_and_non-uniform_complexity","223571788_The_complexity_of_optimization_problems","222515989_On_the_Reducibility_of_Sets_Inside_NP_to_Sets_with_Low_Information_Content","222444239_On_Membership_Comparable_Sets","222324110_Lower_bounds_for_constant-depth_circuits_in_the_presence_of_help_bits"]}