{"id":"264497911_Vertex_Fault_Tolerant_Additive_Spanners","abstract":"A fault-tolerant structure for a network is required to continue functioning following the failure of some of the network’s edges or vertices. In this paper, we address the problem of designing a fault-tolerant additive spanner, namely, a subgraph H of the network G such that subsequent to the failure of a single vertex, the surviving part of H still contains an additive spanner for (the surviving part of) G, satisfying dist(s,t,H ∖ {v}) ≤ dist(s,t,G ∖ {v}) + β for every s,t,v ∈ V. Recently, the problem of constructing fault-tolerant additive spanners resilient to the failure of up to f-edges has been considered [8]. The problem of handling vertex failures was left open therein. In this paper we develop new techniques for constructing additive FT-spanners overcoming the failure of a single vertex in the graph. Our first result is an FT-spanner with additive stretch 2 and O(n\n5/3) edges. Our second result is an FT-spanner with additive stretch 6 and O(n\n3/2) edges. The construction algorithm consists of two main components: (a) constructing an FT-clustering graph and (b) applying a modified path-buying procedure suitably adopted to failure prone settings. Finally, we also describe two constructions for fault-tolerant multi-source additive spanners, aiming to guarantee a bounded additive stretch following a vertex failure, for every pair of vertices in S ×V for a given subset of sources S ⊆ V. The additive stretch bounds of our constructions are 4 and 8 (using a different number of edges).","authors":["Merav Parter"],"meta":["October 2017Distributed Computing 30(5)","DOI:10.1007/s00446-015-0252-9","SourcearXiv"],"references":["263619867_Fault-Tolerant_Approximate_Shortest-Path_Trees","263390493_Fault_Tolerant_Approximate_BFS_Structures","322744213_f-sensitivity_distance_oracles_and_routing_schemes","300489758_Fault_Tolerant_BFS_Structures","286169692_New_Additive_Spanners","281977238_New_pairwise_spanners","266961815_Fault_Tolerant_Additive_Spanners","262351644_Small_Stretch_Pairwise_Spanners","261211957_Improved_Distance_Sensitivity_Oracles_via_Fast_Single-Source_Replacement_Paths","260482374_Additive_Spanners_A_Simple_Construction"]}