{"id":"264458001_Provably_Secure_Higher-Order_Masking_of_AES","abstract":"Implementations of cryptographic algorithms are vulnerable to Side Channel Analysis (SCA). To counteract it, masking schemes\nare usually involved which randomize key-dependent data by the addition of one or several random value(s) (the masks). When dth-order masking is involved (i.e. when d masks are used per key-dependent variable), the complexity of performing an SCA grows exponentially with the order d. The design of generic dth-order masking schemes taking the order d as security parameter is therefore of great interest for the physical security of cryptographic implementations. This paper\npresents the first generic dth-order masking scheme for AES with a provable security and a reasonable software implementation overhead. Our scheme is\nbased on the hardware-oriented masking scheme published by Ishai et al. at Crypto 2003. Compared to this scheme, our solution can be efficiently implemented in software on any general-purpose processor.\nThis result is of importance considering the lack of solution for d ≥ 3.","authors":["Matthieu Rivain","Emmanuel Prouff"],"meta":["August 2010","DOI:10.1007/978-3-642-15031-9_28","Conference: 12th International Workshop on Cryptographic Hardware and Embedded Systems (CHES 2010)At: Santa Barbara, CA, USA"],"references":["264457991_Block_Ciphers_Implementations_Provably_Secure_Against_Second_Order_Side_Channel_Analysis","335493321_Safeguarding_cryptographic_keys","298122842_Using_second-order_power_analysis_to_attack_DPA_resistant_software","273674251_The_Knowledge_Complexity_of_Interactive_Proof_Systems","251763287_Share_conversion_pseudorandom_secret-sharing_and_applications_to_secure_distributed_computing","244456894_DES_and_Differential_Power_Analysis","242155634_Higher-order_Masking_and_Shuing_for_Software_Implementations_of_Block_Ciphers_-_Extended_Version","235008694_How_to_generate_cryptographically_strong_sequences_of_pseudorandom_bits","234808644_The_Design_of_Rijndael","232626171_Safeguarding_cryptographic_keys_PDF"]}