{"id":"264497972_Approximate_Consensus_in_Highly_Dynamic_Networks_The_Role_of_Averaging_Algorithms","abstract":"We investigate the approximate consensus problem in highly dynamic networks in which topology may change continually and unpredictably. We prove that in both synchronous and partially synchronous networks, approximate consensus is solvable if and only if the communication graph in each round has a rooted spanning tree. Interestingly, the class of averaging algorithms, which have the benefit of being memoryless and requiring no process identifiers, entirely captures the solvability issue of approximate consensus in that the problem is solvable if and only if it can be solved using any averaging algorithm.\nWe develop a proof strategy which for each positive result consists in a reduction to the nonsplit networks. It dramatically improves the best known upper bound on the decision times of averaging algorithms and yields a quadratic time non-averaging algorithm for approximate consensus in non-anonymous networks. We also prove that a general upper bound on the decision times of averaging algorithms have to be exponential, shedding light on the price of anonymity.\nFinally we apply our results to networked systems with a fixed topology and benign fault models to show that with n processes, up to \\(2n-3\\) of link faults per round can be tolerated for approximate consensus, increasing by a factor 2 the bound of Santoro and Widmayer for exact consensus.","authors":["Bernadette Charron-Bost","Matthias Függer","Thomas Nowak"],"meta":["August 2014","DOI:10.1007/978-3-662-47666-6_42","SourcearXiv","Conference: International Colloquium on Automata, Languages, and Programming"],"references":["268670080_Markov_chains_and_mixing_times_With_a_chapter_on_Coupling_from_the_past_by_James_G_Propp_and_David_B_Wilson","261196094_Sarymsakov_matrices_and_their_application_in_coordinating_multi-agent_systems","312943070_The_Heard-Of_Model_Computing_in_Distributed_Systems_with_Benign_Failures","305982134_Coefficients_of_ergodicity_structure_and_applications","305978807_Towards_consensus_some_convergence_theorems_on_repeated_averaging","267434685_A_Characterization_of_Dynamic_Networks_Where_Consensus_Is_Solvable","265543421_Coefficients_of_Ergodicity_Structure_and_Applications","260662063_Degree_Fluctuations_and_the_Convergence_Time_of_Consensus_Algorithms","260661761_Convergence_of_Type-Symmetric_and_Cut-Balanced_Consensus_Seeking_Systems","248126722_Towards_Consensus_Some_Convergence_Theorems_on_Repeated_Averaging"]}