{"id":"264590960_Positioning_Research_and_Design_in_Academia_and_Practice_A_Contribution_to_a_Continuing_Debate","abstract":"In response to changing social, professional and academic parameters in recent decades, the discipline of architecture has sought to develop an integral research culture. Many proponents argue that this disciplinary knowledge production should be based on research through design or on designerly research. These concepts however are often seen as confusing and ambiguous notions, covering different modes of production. In order to clarify this confusion, this article aims at positioning research and design by connecting them to distinctions in modality and finality of diverse approaches of inquiry, trying to map differences as well as possible alliances between the world of academia and the world of practice. Challenging the often ill-used opposition of research and design, this paper proposes a constellation which enables to position hybrid modes of knowledge production that rely on various combinations of research and design. The productivity of this constellation will be illustrated by discussing two cases in which various versions of design/research combinations work together in a specific line of investigation. In the first case, design is used as an exploration of what is at the onset a very unclear, messy situation, in which designerly research can help to identify a problem definition. In the second case, design practice can be inscribed in a further strictly scientific defined project, as a practical contribution to the formulation of questions, the gathering of data, or reflection on theories. These two cases form hybrids on the design – research scale, not clearly belonging just to the one or the other. They will be used as examples to illustrate how research in architecture can indeed encompass different modes of knowledge production, in which creative practice undoubtedly can be of major importance.","authors":["Marijn van de Weijer","Koenraad Van Cleempoel","Hilde Heynen"],"meta":["April 2014Design Issues 30(2):17-29","DOI:10.1162/DESI_a_00259"],"references":["254908547_Mind_the_evaluation_gap_Reviewing_the_assessment_of_architectural_research_in_the_Netherlands","240677962_Rigor_and_Practice-based_Research","233520109_Research_into_by_and_for_design","256971133_Special_issue_on_participatory_design","251880127_Wicked_Problems_in_Design_Thinking","240530898_Drawing_research","235321914_Discourses_on_research_and_the_PhD_in_Design","233605818_The_pedestal_and_the_pendulum_Fine_art_practice_research_and_doctorates","233211253_Unthinkable_doctorates_Introduction","233015441_Doctorates_caught_between_disciplines_and_projects"]}