{"id":"264595739_Incremental_and_Radical_Innovation_Design_Research_vs_Technology_and_Meaning_Change","abstract":"Incremental and Radical Innovation: Design Research vs. Technology and Meaning Change Donald A. Norman, Roberto Verganti Donald A. Norman and Stephen W. Draper, Centered System Design: New Perspectives on Human–Computer Inter- action (Mahwah, NJ: Lawrence Erlbaum Associates, 1986); Donald A. Norman, “Human-Centered Product Development,” Chapter 10 in The Invisible Computer: Why Good Products Can Fail, the Personal Computer Is So Complex, and Information Appliances Are the Solution (Cambridge, MA: MIT Press, 1998), Background Our work began independently. Norman was one of the originators of the class of design exploration now commonly known as user- centered or human-centered design (HCD). 1 These methods have a common framework: an iterative cycle of investigation—usually characterized by observations, an ideation phase, and rapid proto- type and testing. Each iteration builds on the lessons learned from the previous cycle, and the process terminates either when the results are appropriate or when the allotted time has run out. Norman realized that this continual process of checking with the intended users would indeed lead to incremental enhancements of the product; he also realized that it actually was a form of hill climbing—a well-known mathematical procedure for finding local optimization. In hill climbing’s application to design, consider a multi-dimensional hill where position on one dimen- sion—height along the vertical axis—represents product quality; and where position along the other dimensions, represents choices among various design parameters. This image is usually illus- trated with just two axes: product quality along the vertical axis and design parameters along the horizontal, as shown in Figure 1. Hill-climbing is used in situations, such as design, where the shape of the hill cannot be known in advance. Therefore, one makes tiny movements along all the design dimensions and selects the one that yields an increase in height, repeating until satisfied. This movement is precisely what the repeated rapid prototyping and testing is doing in HCD. Think of a blindfolded person trying to reach the top of a hill by feeling the ground in all directions around the current position and then moving to the highest posi- tion, repeating until the “ground” in all directions is lower than the current one: This position would be the top of the hill. Although the hill-climbing procedure guarantees continual improvement, with eventual termination at the peak of the hill, it has a well-known limit: “Climbers” have no way of knowing whether even higher hills might be scaled in some other part of the design space. Hill-climbing methods get trapped in local maxima. © 2013 Massachusetts Institute of Technology DesignIssues: Volume 30, Number 1 Winter 2014 doi:10.1162/DESI_a_00250","authors":["Donald Arthur Norman","Roberto Verganti"],"meta":["January 2014Design Issues 30(1):78-96","DOI:10.1162/DESI_a_00250","Project: Design"],"references":["271009122_A_critical_look_at_technological_innovation_typology_and_innovativeness_terminology_A_literature_review","228847812_Parallel_Prototyping_Leads_to_Better_Design_Results_More_Divergence_and_Increased_Self-Efficacy","280794991_Mapping_the_Winds_of_Creative_Destruction","273356801_Innovating_Through_Design","273356034_Designing_Breakthrough_Products","256720451_Interpreting_and_envisioning_-_A_hermeneutic_framework_to_look_at_radical_innovation_of_meanings","248605280_Multi_-_Touch_Systems_that_I_Have_Known_and_Loved","235701066_On_the_Essential_Contexts_of_Artifacts_or_on_the_Proposition_That_Design_Is_Making_Sense_Of_Things","235700908_Design_Research_A_Disciplined_Conversation","235304222_Assembling_the_elephant_A_review_of_empirical_studies_on_the_impact_of_technical_change_upon_incumbent_firms","227715954_Design_Meanings_and_Radical_Innovation_A_Meta-Model_and_a_Research_Agenda","223495386_Technological_Discontinuities_and_Flexible_Production_Networks_The_Case_of_Switzerland_and_the_World_Watch_Industry","222635713_Managing_Product_Families_The_Case_of_the_Sony_Walkman","222563106_Theory_Construction_in_Design_Research_Criteria","222465572_Technological_Paradigms_and_Technological_Trajectories_A_Suggested_Interpretation_of_the_Determinants_and_Directions_of_Technical_Change"]}