{"id":"264553106_DRUM_A_New_Framework_for_Metabolic_Modeling_under_Non-Balanced_Growth_Application_to_the_Carbon_Metabolism_of_Unicellular_Microalgae","abstract":"Metabolic modeling is a powerful tool to understand, predict and optimize bioprocesses, particularly when they imply\nintracellular molecules of interest. Unfortunately, the use of metabolic models for time varying metabolic fluxes is hampered\nby the lack of experimental data required to define and calibrate the kinetic reaction rates of the metabolic pathways. For\nthis reason, metabolic models are often used under the balanced growth hypothesis. However, for some processes such as\nthe photoautotrophic metabolism of microalgae, the balanced-growth assumption appears to be unreasonable because of\nthe synchronization of their circadian cycle on the daily light. Yet, understanding microalgae metabolism is necessary to\noptimize the production yield of bioprocesses based on this microorganism, as for example production of third-generation\nbiofuels. In this paper, we propose DRUM, a new dynamic metabolic modeling framework that handles the non-balanced\ngrowth condition and hence accumulation of intracellular metabolites. The first stage of the approach consists in splitting\nthe metabolic network into sub-networks describing reactions which are spatially close, and which are assumed to satisfy\nbalanced growth condition. The left metabolites interconnecting the sub-networks behave dynamically. Then, thanks to\nElementary Flux Mode analysis, each sub-network is reduced to macroscopic reactions, for which simple kinetics are\nassumed. Finally, an Ordinary Differential Equation system is obtained to describe substrate consumption, biomass\nproduction, products excretion and accumulation of some internal metabolites. DRUM was applied to the accumulation of\nlipids and carbohydrates of the microalgae Tisochrysis lutea under day/night cycles. The resulting model describes\naccurately experimental data","authors":["Caroline Baroukh","Rafael Muñoz-Tamayo","J-P Steyer","Olivier Bernard"],"meta":["August 2014PLoS ONE 9(8):e104499","DOI:10.1371/journal.pone.0104499"],"references":["309105234_Erratum_to_On_the_description_of_Tisochrysis_lutea_gen_nov_sp_nov_and_Isochrysis_nuda_sp_nov_in_the_Isochrysidales_and_the_transfer_of_Dicrateria_to_the_Prymnesiales_Haptophyta","259820980_Cell_cycle_implication_on_nitrogen_acquisition_and_synchronization_in_Thalassiosira_weissflogii_Bacillariophyceae","304363951_Hurdles_and_challenges_for_modelling_and_control_of_microalgae_for_CO2_mitigation_and_biofuel_production","302970924_A_Simplex_Method_for_Function_Minimization","301692334_A_simplex_method_for_functions_minimizations","285191890_ADAPTIVE_CONTROL_OF_BIOREACTORS","281611431_Metabolic_modeling_of_Chlamydomonas_reinhardtii_Energy_requirements_for_photoautotrophic_growth_and_maintenance","271196714_New_Look_at_Statistical-Model_Identification","260406952_Dynamic_models_of_metabolism_Review_of_the_cybernetic_approach","258960109_On-Line_Estimation_and_Adaptive_Control_Bioreactors"]}