{"id":"264625947_Homomorphisms_of_Signed_Graphs","abstract":"A signed graph is a graph G together with an assignment of signs + and − to all the edges of G where Σ is the set of negative edges. Furthermore and are considered to be equivalent if the symmetric difference of Σ1 and Σ2 is an edge cut of G. Naturally arising from matroid theory, several notions of graph theory, such as the theory of minors and the theory of nowhere-zero flows, have been already extended to signed graphs. In an unpublished manuscript, B. Guenin introduced the notion of signed graph homomorphisms where he showed how some well-known conjectures can be captured using this notion. A signed graph is said to map to if there is an equivalent signed graph of and a mapping such that (i) if then and if and only if . The chromatic number of a signed graph can then be defined as the smallest order of a homomorphic image of . Capturing the notion of graph homomorphism order, signed graph homomorphisms provide room for extensions and strengthenings of most homomorphism and coloring theories on graphs. Thus this paper is the first general study of signed graph homomorphisms. In this work, our focus would be on the relation of homomorphisms of signed graphs with minors of signed graphs. After a thorough introduction to the concept we show that the notion of signed graph homomorphism on the set of signed graphs whose underlying graph is bipartite already captures the standard notion of graph homomorphism. We prove that the largest planar signed clique is of order 8. For the maximum chromatic number of planar signed graphs we give the lower bound of 10 and the upper bound of 48. We determine this maximum for some other families such as outerplanar signed graphs. Finally, reformulating Hadwiger's conjecture in the language of homomorphism of signed graphs whose underlying graph is bipartite, we show that while some stronger form of the conjecture holds for small chromatic number, such strengthening of the conjecture would not hold for large chromatic numbers. This could be regarded as a first indication that perhaps Hadwiger's conjecture only holds for small chromatic numbers.","authors":["Reza Naserasr","Edita Rollová","Eric Sopena"],"meta":["August 2014Journal of Graph Theory 79(3)","DOI:10.1002/jgt.21817"],"references":["267436576_Homomorphisms_of_planar_signed_graphs_to_signed_projective_cubes","259718566_Homomorphisms_of_signed_planar_graphs","344486692_Graphs_and_Homomorphisms","316824218_Graduate_Texts_in_Mathematics","299217659_Grad_and_classes_with_bounded_expansion_III_Restricted_graph_homomorphism_dualities","285899345_On_the_notion_of_balance_of_signed_graph","267186349_The_Complexity_of_Homomorphisms_of_Signed_Graphs_and_Signed_Constraint_Satisfaction","267120443_Combinatorial_Algebraic_and_Topological_Representations_of_Groups_Semigroups_and_Categories","263479544_Mapping_Planar_Graphs_into_Projective_Cubes","256157728_Acyclic_colorings_of_planar_graphs"]}