{"id":"264674014_Statistical_guarantees_for_the_EM_algorithm_From_population_to_sample-based_analysis","abstract":"We develop a general framework for proving rigorous guarantees on the\nperformance of the EM algorithm and a variant known as gradient EM. Our\nanalysis is divided into two parts: a treatment of these algorithms at the\npopulation level (in the limit of infinite data), followed by results that\napply to updates based on a finite set of samples. First, we characterize the\ndomain of attraction of any global maximizer of the population likelihood. This\ncharacterization is based on a novel view of the EM updates as a perturbed form\nof likelihood ascent, or in parallel, of the gradient EM updates as a perturbed\nform of standard gradient ascent. Leveraging this characterization, we then\nprovide non-asymptotic guarantees on the EM and gradient EM algorithms when\napplied to a finite set of samples. We develop consequences of our general\ntheory for three canonical examples of incomplete-data problems: mixture of\nGaussians, mixture of regressions, and linear regression with covariates\nmissing completely at random. In each case, our theory guarantees that with a\nsuitable initialization, a relatively small number of EM (or gradient EM) steps\nwill yield (with high probability) an estimate that is within statistical error\nof the MLE. We provide simulations to confirm this theoretically predicted\nbehavior.","authors":["Sivaraman Balakrishnan","Martin J. Wainwright","B. Yu"],"meta":["August 2014The Annals of Statistics 45(1)","DOI:10.1214/16-AOS1435","SourcearXiv"],"references":["329473260_Missing_Values_in_Multivariate_Analysis","284674786_EM_algorithm_for_clustering_and_two_stochastic_versions","283617574_A_view_of_the_EM_algorithm_that_justifies_incremental_sparse_and_other_variants","277297445_On_Stochastic_Versions_of_the_EM_Algorithm","274202807_Weak_Convergence_of_Empirical_Processes","272582975_Missing_Values_in_Experiments_Analysed_on_Automatic_Computers","267677183_Oracle_inequalities_in_empirical_risk_minimization_and_sparse_recovery_problems_Ecole_d'Ete_de_Probabilites_de_Saint-Flour_XXXVIII-2008","265347833_Metric_characterization_of_random_variables_and_random_processes_Transl_from_the_Russian_by_V_Zaiats","262489426_Theory_of_Convex_Optimization_for_Machine_Learning","261260455_Corrupted_and_missing_predictors_Minimax_bounds_for_high-dimensional_linear_regression"]}