{"id":"264631800_Identification_of_copy_number_variants_from_exome_sequence_data","abstract":"With advances in next generation sequencing technologies and genomic capture techniques, exome sequencing has become a cost-effective approach for mutation detection in genetic diseases. However, computational prediction of copy number variants (CNVs) from exome sequence data is a challenging task. Whilst numerous programs are available, they have different sensitivities, and have low sensitivity to detect smaller CNVs (1–4 exons). Additionally, exonic CNV discovery using standard aCGH has limitations due to the low probe density over exonic regions. The goal of our study was to develop a protocol to detect exonic CNVs (including shorter CNVs that cover 1–4 exons), combining computational prediction algorithms and a high-resolution custom CGH array.\nWe used six published CNV prediction programs (ExomeCNV, CONTRA, ExomeCopy, ExomeDepth, CoNIFER, XHMM) and an in-house modification to ExomeCopy and ExomeDepth (ExCopyDepth) for computational CNV prediction on 30 exomes from the 1000 genomes project and 9 exomes from primary immunodeficiency patients. CNV predictions were tested using a custom CGH array designed to capture all exons (exaCGH). After this validation, we next evaluated the computational prediction of shorter CNVs. ExomeCopy and the in-house modified algorithm, ExCopyDepth, showed the highest capability in detecting shorter CNVs. Finally, the performance of each computational program was assessed by calculating the sensitivity and false positive rate.\nIn this paper, we assessed the ability of 6 computational programs to predict CNVs, focussing on short (1–4 exon) CNVs. We also tested these predictions using a custom array targeting exons. Based on these results, we propose a protocol to identify and confirm shorter exonic CNVs combining computational prediction algorithms and custom aCGH experiments.","authors":["Pubudu Samarakoon","Hanne Sørmo Sorte","Bjørn Evert Kristiansen","Tove Skodje"],"meta":["August 2014BMC Genomics 15(1):661","DOI:10.1186/1471-2164-15-661","SourcePubMed","Project: cnvScan - CNV screening and annotation package"],"references":["230813038_GENCODE_the_reference_human_genome_annotation_for_the_ENCODE_project","230783911_A_robust_model_for_read_count_data_in_exome_sequencing_experiments_and_implications_for_copy_number_variant_calling","227379246_Modeling_Read_Counts_for_CNV_Detection_in_Exome_Sequencing_Data","224867157_The_1000_Genomes_Project_Data_Management_and_Community_Access","223986586_CONTRA_Copy_number_analysis_for_targeted_resequencing","51673996_Exome_sequencing_as_a_tool_for_Mendelian_disease_gene_discovery","51558407_Exome_Sequencing-Based_Copy-Number_Variation_and_Loss_of_Heterozygosity_Detection_ExomeCNV","253336037_Detection_of_Clinically_Relevant_Copy_Number_Variants_with_Whole-Exome_Sequencing","232065133_Discovery_and_Statistical_Genotyping_of_Copy-Number_Variation_from_Whole-Exome_Sequencing_Depth","224958569_Copy_number_variation_detection_and_genotyping_from_exome_sequence_data"]}