{"id":"264772899_Teaching_Creativity_in_Engineering_Courses","abstract":"Background\nThe ability to engage in a creative process to solve a problem or to design a novel artifact is essential to engineering as a profession. Research indicates a need for curricula that enhance students' creative skills in engineering.PurposeOur purpose was to document current practices in engineering pedagogy with regard to opportunities for students' creative growth by examining learning goals, instructional methods, and assessments focused on cognitive creative skills.Design/Method\nWe conducted a critical case study of engineering pedagogy at a single university with seven engineering courses where instructors stated the goal of fostering creativity. Data included instructor and student interviews, student surveys, and course materials. For qualitative analysis, we used frameworks by Treffinger, Young, Selby, and Shepardson and by Wiggins and McTighe.ResultsOne aspect of creativity, convergent thinking (including analysis and evaluation), was well represented in the engineering courses in our case study. However, instruction on generating ideas and openness to exploring ideas was less often evident. For many of the creative skills, especially those related to divergent thinking and idea exploration, assessments were lacking.Conclusions\nAn analysis of pedagogy focused on goals, instruction, and assessments in the engineering curriculum revealed opportunities for growth in students' creative skill development. Designing assessments that motivate students to improve their creative skills and to become more aware of their own creative process is a key need in engineering pedagogy.","authors":["Shanna Daly","Erika Mosyjowski","Colleen M. Seifert"],"meta":["July 2014Journal of Engineering Education 103(3)","DOI:10.1002/jee.20048"],"references":["301850449_Five_Misunderstandings_About_Case-Study_Research","345927176_The_Thinking_Expedition_A_Course_In_Creativity_Innovation_And_Change","325671334_What_is_the_common_thread_of_creativity_Its_dialectical_relation_to_intelligence_and_wisdom","321315636_An_Interactionist_Model_of_Creative_Behavior","320353624_Handbook_of_Creativity","320353407_Creativity","317953650_Research_design_Qualitative_quantitative_approaches","314115047_Creative_cognition_Theory_research_and_applications","306190942_IEEE_CONFERENCE_ON_FRONTIERS_IN_EDUCATION_PROCEEDINGS_1972","302429263_Metacognition_executive_control_self-regulation_and_other_more_mysterious_mechanisms"]}