{"id":"264791219_Change_in_disgust_reactions_following_cognitive-behavioral_therapy_for_childhood_anxiety_disorders","abstract":"La asco, además del miedo, es un estado emocional prominente asociado con la evitación de estímulos perturbadores. Aunque la mayoría de la investigación se ha llevado a cabo en relación con el trastorno obsesivo-compulsivo (TOC), datos recientes han implicado la asco en la etiología de trastornos de ansiedad en general. Se ha demostrado que la disminución de la asco es clave para la reducción de los síntomas en personas con TOC. Sin embargo, son escasos los trabajos que exploren si estas intervenciones son eficaces en trastornos de ansiedad en la infancia con componentes prominentes de asco. Este estudio examinó cómo la propensión a la asco en niños con trastornos de ansiedad responde a la terapia cognitivo-conductual (TCC) con énfasis en la exposición. Cuarenta y un niños de 7 a 17 años, con trastornos de ansiedad, fueron evaluados en la propensión a la asco y tratados semanalmente con TCC intensiva. Se encontró que los niveles de asco disminuyeron tras el tratamiento en todos los diagnósticos de trastorno de ansiedad, siendo los niños con TOC primario los que mostraron reducciones significativamente mayores. Se discuten las implicaciones clínicas y sugerencias para futuras investigaciones sobre el tratamiento de la asco en relación con los trastornos de ansiedad infantil.","authors":["William Taboas","Rachel Ojserkis","Dean Mckay"],"meta":["August 2014International Journal of Clinical and Health Psychology 15(1)","DOI:10.1016/j.ijchp.2014.06.002"],"references":["313403509_The_children's_Yale-Brown_obsessive-compulsive_scale_preliminary_report_of_reliability_and_validity","288950605_Clinical_significance_A_statistical_appraoch_to_defining_meaningful_change_in_psychotherapy_research","288154677_The_psychophysiology_of_disgust_motivation_action_and_autonomic_support","284673646_Assessment_and_analysis_of_clinically_significant_change","283998232_Anxiety_disorders_Panic_and_phobias","279235621_Yuck_The_Nature_and_Moral_Significance_of_Disgust","261850467_Treating_Disgust_in_Anxiety_Disorders","260216420_Specificity_of_Disgust_Domains_in_the_Prediction_of_Contamination_Anxiety_and_Avoidance_A_Multimodal_Examination","251877194_Biased_interpretation_and_memory_in_children_with_varying_levels_of_spider_fear","236275073_Nonverbal_and_Verbal_Transmission_of_Disgust_From_Mothers_to_Offspring_Effects_on_Children's_Evaluation_of_a_Novel_Animal"]}