{"id":"264796098_BESST_-_Efficient_scaffolding_of_large_fragmented_assemblies","abstract":"The use of short reads from High Throughput Sequencing (HTS) techniques is now commonplace in de novo assembly. Yet, obtaining contiguous assemblies from short reads is challenging, thus making scaffolding an important step in the assembly pipeline. Different algorithms have been proposed but many of them use the number of read pairs supporting a linking of two contigs as an indicator of reliability. This reasoning is intuitive, but fails to account for variation in link count due to contig features.\nWe have also noted that published scaffolders are only evaluated on small datasets using output from only one assembler. Two issues arise from this. Firstly, some of the available tools are not well suited for complex genomes. Secondly, these evaluations provide little support for inferring a software’s general performance.\nWe propose a new algorithm, implemented in a tool called BESST, which can scaffold genomes of all sizes and complexities and was used to scaffold the genome of P. abies (20 Gbp). We performed a comprehensive comparison of BESST against the most popular stand-alone scaffolders on a large variety of datasets. Our results confirm that some of the popular scaffolders are not practical to run on complex datasets. Furthermore, no single stand-alone scaffolder outperforms the others on all datasets. However, BESST fares favorably to the other tested scaffolders on GAGE datasets and, moreover, outperforms the other methods when library insert size distribution is wide.\nWe conclude from our results that information sources other than the quantity of links, as is commonly used, can provide useful information about genome structure when scaffolding.","authors":["Kristoffer Sahlin","Francesco Vezzi","Bjorn Nystedt","Joakim Lundeberg"],"meta":["August 2014BMC Bioinformatics 15(1):281","DOI:10.1186/1471-2105-15-281","SourcePubMed"],"references":["260443607_A_comprehensive_evaluation_of_assembly_scaffolding_tools","237529207_Ultrafast_and_memory-efficient_alignment_of_short_reads_to_the_human_genome","236932291_The_Norway_spruce_genome_sequence_and_conifer_genome_evolution_Nature","234043775_Reevaluating_Assembly_Evaluations_with_Feature_Response_Curves_GAGE_and_Assemblathons","232234427_SLIQ_Simple_Linear_Inequalities_for_Efficient_Contig_Scaffolding","230742298_Improved_gap_size_estimation_for_scaffolding_algorithms","230565796_Finished_bacterial_genomes_from_shotgun_sequence_data","311424207_Ultrafast_and_memory-efficient_alignment_of_short_DNA_sequences_to_the_human_genome","281298083_Ultrafast_and_memory-efficient_alignment_of_short_DNA_sequences_to_the_human_genome","243770937_Sulla_Determinazione_Empirica_di_una_Legge_Distribuzione"]}