{"id":"264746569_IncMap_Pay_as_you_go_Matching_of_Relational_Schemata_to_OWL_Ontologies","abstract":"Ontology Based Data Access (OBDA) enables access to re-lational data with a complex structure through ontologies as conceptual domain models. A key component of an OBDA system are mappings be-tween the schematic elements in the ontology and their correspondences in the relational schema. Today, in existing OBDA systems these map-pings typically need to be compiled by hand, which is a complex and la-bor intensive task. In this paper we address the problem of creating such mappings and present IncMap, a system that supports a semi-automatic approach for matching relational schemata and ontologies. Our approach is based on a novel matching technique that represents the schematic ele-ments of an ontology and a relational schema in a unified way. IncMap is designed to work in a query-driven, pay as you go fashion and leverages partial, user-verified mappings to improve subsequent mapping sugges-tions. This effectively reduces the overall effort compared to compiling a mappings in one step. Moreover, IncMap can incorporate knowledge from user queries to enhance suggestion quality.","authors":["Christoph Pinkel","Carsten Binnig","Evgeny Kharlamov","Peter Haase"],"meta":["January 2013","Conference: OMAt: Sydney"],"references":["262284031_YAM_A_Multi-strategy_Based_Approach_for_Ontology_Matching_Task","228095822_SODA_generating_SQL_for_business_users","221549243_Composing_Mappings_Between_Schemas_Using_a_Reference_Ontology","326340404_SAMBO_-_A_System_for_Aligning_and_Merging_Biomedical_Ontologies","319393573_OWL_2_Web_Ontology_Language_Structural_Specification_and_Functional-Style_Syntax","267384881_High_Performance_Query_Answering_over_DL-Lite_Ontologies","260324688_Ontology_Matching_State_of_the_Art_and_Future_Challenges","228786740_RONTO_Relational_to_ontology_schema_matching","222402757_SAMBO_-_A_System_for_Aligning_and_Merging_Biomedical_Ontologies","221466748_OntoNaviERP_Ontology-Supported_Navigation_in_ERP_Software_Documentation"]}