{"id":"264790567_JIDT_An_Information-Theoretic_Toolkit_for_Studying_the_Dynamics_of_Complex_Systems","abstract":"Complex systems are increasingly being viewed as distributed information\nprocessing systems, particularly in the domains of computational neuroscience,\nbioinformatics and Artificial Life. This trend has resulted in a strong uptake\nin the use of (Shannon) information-theoretic measures to analyse the dynamics\nof complex systems in these fields. We introduce the Java Information Dynamics\nToolkit (JIDT): a Google code project which provides a standalone, (GNU GPL v3\nlicensed) open-source code implementation for empirical estimation of\ninformation-theoretic measures from time-series data. While the toolkit\nprovides classic information-theoretic measures (e.g. entropy, mutual\ninformation, conditional mutual information), it ultimately focusses on\nimplementing higher-level measures for information dynamics. That is, JIDT\nfocusses on quantifying information storage, transfer and modification, and the\ndynamics of these operations in space and time. For this purpose, it includes\nimplementations of the transfer entropy and active information storage, their\nmultivariate extensions and local or pointwise variants. JIDT provides\nimplementations for both discrete and continuous-valued data for each measure,\nincluding various types of estimator for continuous data (e.g. Gaussian,\nbox-kernel and Kraskov-Stoegbauer-Grassberger) which can be swapped at run-time\ndue to Java's object-oriented polymorphism. Furthermore, while written in Java,\nthe toolkit can be used directly in MATLAB, GNU Octave and Python. We present\nthe principles behind the code design, and provide several examples to guide\nusers.","authors":["Joseph T Lizier"],"meta":["August 2014Frontiers in Robotics and AI 1","DOI:10.3389/frobt.2014.00011","SourcearXiv"],"references":["274446568_On_Thermodynamic_Interpretation_of_Transfer_Entropy","269828361_Moving_Frames_of_Reference_Relativity_and_Invariance_in_Transfer_Entropy_and_Information_Dynamics","268589910_Evolutionary_Transitions_and_Top-Down_Causation","321613059_Directed_Information_Measures_in_Neuroscience","307846855_Disruption_of_transfer_entropy_and_inter-hemispheric_brain_functional_connectivity_in_patients_with_disorder_of_consciousness","285930368_Efficient_Estimation_of_Information_Transfer","278695757_Understanding_Complex_Systems","278651552_Understanding_Complex_Systems","275180705_Transmission_of_Information","270237696_Information_Theory"]}