{"id":"264849244_Equality_and_Inequality_in_the_Dataflow_Algebra","abstract":"A fundamental concept of the dataflow algebra is the notion that certain sequences can be treated as equal, even though they have different constructions, and the basic axioms defining this equality have been foundational to the development of the algebra so far. In the course of this development, though, it has become apparent that a rigorous formulation of the concept of equality would require additional axioms, in order to express the properties that are normally assumed for an equality operation. Also, the definition of equality in terms of these axioms is not constructive, so that there has not been an algorithm for determining whether or not two arbitrary sequences are in fact equal. This report therefore addresses these two issues, firstly by defining a full set of axioms for equality, together with a machinery for reasoning about properties of this set of axioms, and then defining a constructive version of the equality operation and showing that it is equivalent to the axiomatic definition. The report then goes on to consider inequality in a similar fashion, by defining a set of axioms for inequality, showing that these are complete and consistent with respect to the denotational semantics of the algebra, and then defining a constructive version of the inequality operation and establishing its properties. Finally, the report considers the relationship between equality and substitutability, and analyses the application of this relationship to some of the basic operations that have been defined for the algebra.","authors":["A J Cowling"],"meta":[],"references":["246701183_Linking_Dataflow_Algebra_with_the_CaDiZ_tool","268405353_Normal_Forms_in_the_Dataflow_Algebra","266462911_A_Revised_Denotational_Semantics_for_the_Dataflow_Algebra","245839576_Dataflow_Algebras_as_Formal_Specifications_of_Data_Flows","242427043_Using_Dataflow_Algebra_as_a_Specification_Method","242427042_An_Operational_Semantics_for_the_Dataflow_Algebra","242426966_A_Simplified_Abstract_Syntax_for_the_Dataflow_Algebra"]}