{"id":"264804160_Latent_Dictionary_Learning_for_Sparse_Representation_based_Classification","abstract":"Dictionary learning (DL) for sparse coding has shown promising results in classification tasks, while how to adaptively build the relationship between dictionary atoms and class labels is still an important open question. The existing dictionary learning approaches simply fix a dictionary atom to be either class-specific or shared by all classes beforehand, ignoring that the relationship needs to be updated during DL. To address this issue, in this paper we propose a novel latent dictionary learning (LDL) method to learn a discriminative dictionary and build its relationship to class labels adaptively. Each dictionary atom is jointly learned with a latent vector, which associates this atom to the representation of different classes. More specifically, we introduce a latent representation model, in which discrimination of the learned dictionary is exploited via minimizing the within-class scatter of coding coefficients and the latent-value weighted dictionary coherence. The optimal solution is efficiently obtained by the proposed solving algorithm. Correspondingly, a latent sparse representation based classifier is also presented. Experimental results demonstrate that our algorithm outperforms many recently proposed sparse representation and dictionary learning approaches for action, gender and face recognition.","authors":["Meng Yang","Dengxin Dai","Linlin Shen","Luc Van Gool"],"meta":["June 2014","DOI:10.13140/2.1.3734.2080","Conference: IEEE Conference on Computer Vision and Pattern Recognition","Project: dictionary learning"],"references":["261479428_Multi-Level_Discriminative_Dictionary_Learning_towards_Hierarchical_Visual_Categorization","313510386_Classification_and_clustering_via_dictionary_learning_with_structured_incoherence_and_shared_features","310842565_Action_MACH_A_spatio-temporal_maximum_average_correlation_height_filter_for_action_recognition","285975509_Learning_sparse_representations_for_human_action_recognition","283360188_Sparse_Coding_with_an_Overcomplete_Basis_Set_A_Strategy_Employed_by_V1","264499164_Sparse_Representation_Based_Fisher_Discrimination_Dictionary_Learning_for_Image_Classification","262189052_Label_Consistent_K-SVD_Learning_A_Discriminative_Dictionary_for_Recognition","262162161_A_Dictionary_Learning_Approach_for_Classification_Separating_the_Particularity_and_the_Commonality","261121788_Learning_inter-related_visual_dictionary_for_object_recognition","257672274_Sparse_Modeling_of_Human_Actions_from_Motion_Imagery"]}