{"id":"264810279_Role_of_Information_Communication_Technology_in_Higher_Education_Learners_Perspective_in_Rural_Medical_Schools","abstract":"Background: Higher education has undergone profound transformation due to recent technological advancements. Resultantly health profession students have a strong base to utilize information technology for their professional development. Studies over recent past reflect a striking change in pattern of technology usage amongst medical students expanding prospects exponentially by e-books, science apps, readymade power-point presentations, evidence based medicine, Wikipedia, etc.\n\nAim & Objectives: The study was undertaken with an aim to explore the general perceptions of medical students and faculties about the role of Information Communication Technology in higher education and to gauge student’s dependence on the same for seeking knowledge and information.\n\nStudy Design: Cross-sectional, mixed research design.\n\nMaterials and Methods: The study was conducted in Department of Physiology, Datta Meghe Institute of Medical Sciences (Deemed University). Study population included students (n=150) and teaching faculty (n=10) of Ist phase of medical curriculum. The survey questionnaire (10 closed ended and 5 open ended items) and Focus group discussion (FGD) captured the perceptions and attitudes of students and faculties respectively regarding the role and relevance of technology in higher education.\n\nObservations and Results: Quantitative analysis of closed ended responses was done by percentage distribution and Qualitative analysis of open ended responses and FGD excerpts was done by coding and observing the trends and patterns respectively. Overall the observations were in favour of increasing usability and dependability on technology as ready reference tool of subject information. Learners valued text books and technology almost equally and regarded computer training as a desirable incorporation in medical curriculum.\n\nConclusion: Role of technology in education should be anticipated and appropriate measures should be undertaken for its adequate and optimum utilization by proper training of students as well as facilitators.","authors":["Tripti Srivastava","Lalit","Arunita Jagzape","Alka Rawekar"],"meta":["June 2014Journal of Clinical and Diagnostic Research 8(6):XC01-XC06","DOI:10.7860/JCDR/2014/8371.4448"],"references":["234000023_How_are_our_medical_students_using_the_computer_and_internet_A_study_from_a_medical_college_of_north_India","239606209_Information_Technology_Practices_Amongst_Dental_Under_graduate_Students_at_a_Private_Dental_Institution_in_India","222504111_Computer-assisted_learning_in_dentistry_A_view_from_the_UK","221815950_Trends_to_access_internet_among_medical_students_of_a_government_medical_college_in_West_Bengal","51312812_Clinical_informatics_and_the_dental_curriculum_A_review_of_the_impact_of_informatics_in_dental_care_its_implications_for_dental_education","44830017_Technology_Open_Learning_and_Distance_Education","13631702_Computer_assisted_learning","12454163_The_Internet_in_dental_education","11490473_Computer_literacy_and_attitudes_among_students_in_16_European_dental_schools_Current_aspects_regional_differences_and_future_trends","11278458_Developments_in_outcome-based_education"]}