{"id":"264884167_STRATEGI_PEMBELAJARAN_DI_PERGURUAN_TINGGI_Optimalisasi_Kinerja_Dosen_Dalam_Pembelajaran_Di_Fakultas_Agama_Islam_Universitas_Muhammadiyah_Surakarta","abstract":"ABSTRAK P P P P Pada umumnya implementasi strategi pembelajaran aktif di Perguruan Tinggi masih bersifat paedagogis, akan tetapi tidak demikian halnya proses pembelajaran di Fakultas Agama Islam (FAI) Universitas Muhammadiyah Surakarta (UMS). Oleh sebab itu menarik untuk diteliti mengenai. Setelah diteliti diperoleh kesimpulan bahwa: Pertama, upaya-upaya dosen FAI dalam menerapkan strategi pembelajaran aktif meliputi: (1) pembuatan course outline dan lesson plan, (2) penyiapan alat-alat dan media pembelajaran, (3) penerapan strategi-strategi pembelajaran aktif yang berupa strategi Group Resume, Point Conter Point, Snowballing, Reading Guide, Modeling the Way, Jigsaw Learning, Every one is a teacher here, Brainstorming & Elisitasi, Physical Self Assesment, Problem Solving dan Kolaborasi, dan (4) pelaksanaan evaluasi yang sesuai dengan pembelajaran orang dewasa. Kedua, berbagai upaya dosen FAI dalam penerapan strategi pembelajaran aktif telah menumbuhkan suasana pembelajaran yang merangsang keterlibatan aktif mahasiswa dalam pembelajaran, berupa aktifitas-aktifitas belajar yang berciri: (a) mandiri dan mengarahkan-diri, (b) partisipasi aktif dalam kegiatan kelompok, (c) bersikap kritis dan kreatif, (d) melakukan kolaborasi, (e) beraktifitas dan mengalami (action learning), dan (f) melakukan evaluasi-diri atau refleksi. Kata Kunci: FAI, Strategi Pembelajaran, aktif.","authors":["Zaenal Abidin","Fakultas Agama","Muhammadiyah Surakarta"],"meta":[],"references":["348864385_Teaching_for_Learning_at_University","262455712_Learning_To_Teach_in_Higher_Education","243766879_The_Modern_Practice_of_Adult_Education_Andragogy_Versus_Pedagog","242375639_Principles_of_Instructional_Design","240001027_Postering_Critical_Reflection_in_Adulthood","238750198_Active_Learning_101_Strategies_to_Teach_Any_Subject","232565769_Cognitive_Strategy_Instruction_that_Really_Improves_Children's_Academic_Performance"]}