{"id":"264860968_Modeling_and_Simulation_Support_for_System_of_Systems_Engineering_Applications","abstract":"\"...a much-needed handbook with contributions from well-chosen practitioners. A primary accomplishment is to provide guidance for those involved in modeling and simulation in support of Systems of Systems development, more particularly guidance that draws on well-conceived academic research to define concepts and terms, that identifies primary challenges for developers, and that suggests fruitful approaches grounded in theory and successful examples.\" Paul Davis, The RAND Corporation. Modeling and Simulation Support for System of Systems Engineering Applications provides a comprehensive overview of the underlying theory, methods, and solutions in modeling and simulation support for system of systems engineering. Highlighting plentiful multidisciplinary applications of modeling and simulation, the book uniquely addresses the criteria and challenges found within the field. Cutting edge coverage of modeling and simulation within the field of system of systems, including transportation, system health management, space mission analysis, systems engineering methodology, and energy. State-of-the-art advances within multiple domains to instantiate theoretic insights, applicable methods, and lessons learned from real-world applications of modeling and simulation. The challenges of system of systems engineering using a systematic and holistic approach. Key concepts, terms, and activities to provide a comprehensive, unified, and concise representation of the field. A collection of chapters written by over 40 recognized international experts from academia, government, and industry. A research agenda derived from the contribution of experts that guides scholars and researchers towards open questions.","authors":["Andreas Tolk","Larry Bruce Rainey"],"meta":["December 2014","DOI:10.1002/9781118501757","Publisher: John WileyISBN: 978-1-118-46031-3","Projects: Engineering Emergence: A Modeling and Simulation ApproachThe Profession of Modeling and Simulation"],"references":["277694456_Toward_a_Research_Agenda_for_MS_Support_of_System_of_Systems_Engineering"]}