{"id":"264878708_Genero_Uma_categoria_util_de_analise_historica","abstract":"Gênero, Gram. Categoria que indica por meio de desinência uma divisão dos nomes baseada em critérios tais como sexo e associações psicológicas. Há gêneros masculino, feminino e neutro. Novo Dicionário da Língua Portuguesa (Aurélio B. de Hollanda Ferreira). Aqueles que se propõem a codificar os sentidos das palavras lutam por uma causa perdida, porque as palavras, como as idéias e as coisas que elas significam, têm uma história. Nem os professores de Oxford, nem a Academia Francesa foram inteiramente capazes de controlar a maré, de captar e fixar os sentidos livres do jogo da invenção e da imaginação humana. Mary Wortley Montagu acrescentava a ironia à sua denúncia do \"belo sexo\" (\"meu único consolo em pertencer a este gênero é ter certeza de que nunca vou me casar com uma delas\") fazendo uso, deliberadamente errado, da referência gramatical. Ao longo dos séculos, as pessoas utilizaram de forma figurada os termos gramaticais para evocar traços de caráter ou traços sexuais. Por exemplo, a utilização proposta pelo Dicionário da Língua Francesa de 1879 era: \"Não se sabe qual é o seu gênero, se é macho ou fêmea, fala-se de um homem muito retraído, cujos sentimentos são desconhecidos\". E Gladstone fazia esta distinção em 1878: \"Atenas não tinha nada do sexo a não ser o gênero, nada de mulher a não ser a fama\". Mais recentemente – recentemente demais para encontrar seu caminho nos dicionários ou na enciclopédia das ciências sociais – as feministas começaram a utilizar a palavra \"gênero\" mais seriamente, no sentido mais literal, como uma maneira de referir-se à organização social da relação entre os sexos. A conexão com a gramática é ao mesmo tempo explícita e cheia de possibilidades inexploradas. Explícita, porque o uso gramatical implica em regras que decorrem da designação do masculino ou feminino; cheia de possibilidades inexploradas, porque em vários idiomas indo-europeus existe uma terceira categoria – o sexo indefinido ou neutro. Na gramática, gênero é compreendido como um meio de classificar fenômenos, um sistema de distinções socialmente acordado mais do que uma descrição objetiva de traços inerentes. Além disso, as classificações sugerem uma relação entre categorias que permite distinções ou agrupamentos separados. No seu uso mais recente, o \"gênero\" parece ter aparecido primeiro entre as feministas americanas que queriam insistir na qualidade fundamentalmente social das distinções baseadas no sexo. A palavra indicava uma rejeição ao determinismo biológico implícito no uso de termos como \"sexo\" ou \"diferença sexual\". O \"gênero\" sublinhava também o aspecto relacional das definições normativas de feminilidade. As que estavam mais preocupadas com o fato de que a produção dos estudos femininos centrava-se sobre as mulheres de forma muito estreita e isolada, utilizaram o termo \"gênero\" para introduzir uma noção relacional no nosso vocabulário analítico. Segundo esta opinião, as mulheres e os homens eram definidos em termos recíprocos e nenhuma compreensão de qualquer um poderia existir através de estudo inteiramente separado. Assim, Nathalie Davis dizia em 1975: \"Eu acho que deveríamos nos interessar pela história tanto dos homens quanto das mulheres, e que não deveríamos trabalhar unicamente sobre o sexo oprimido, da mesma forma que um historiador das classes não pode fixar seu olhar unicamente sobre os camponeses. Nosso objetivo é entender a importância dos sexos, dos grupos de gêneros no passado histórico. Nosso objetivo é descobrir a amplitude dos papéis sexuais e do simbolismo sexual nas várias sociedades e épocas, achar qual o seu sentido e como funcionavam para manter a ordem social e para mudá-la\".","authors":["Joan Scott"],"meta":["January 1995"],"references":[]}