{"id":"264848187_Basic_System_and_Subsystem_Structures_in_the_Dataflow_Algebra","abstract":"Most of the recent work on the development of the dataflow algebra has been concerned with the algebraic structure of the sequences that are defined in its event layer, and with the properties that follow from this algebraic structure. Underpinning the event layer, however, is the topological layer of the algebra, and so far only the very basic concepts of this have been defined. For practical applications, however, the algebra has to allow specifications to be constructed for complete systems and subsystems, and this requires that these concepts can be modelled in the topological layer as well as in the event layer. This report therefore develops the basic structures that are needed within the topological layer to model systems and their subsystems, and then begins the process of relating these to event layer specifications of their behaviour. Specifically, the report creates definitions for the topological layer structures of systems and subsystems, and it defines properties of subsystems such as being connected or being disjoint. At the event layer it then goes on to define the restriction operation, which extracts the specification of a subsystem from the specification of the system that contains it, and it develops some of the properties of this operation, such as its relationships with the concepts of the alphabet and the effective alphabet of a sequence, and it establishes that the restriction operation possesses the property of substitutability. Formal specifications, dataflow algebra, topological structures of systems, topological structures of subsystems, restriction of specifications.","authors":["A J Cowling"],"meta":[],"references":["246701183_Linking_Dataflow_Algebra_with_the_CaDiZ_tool","268405353_Normal_Forms_in_the_Dataflow_Algebra","266462911_A_Revised_Denotational_Semantics_for_the_Dataflow_Algebra","264849244_Equality_and_Inequality_in_the_Dataflow_Algebra","245839576_Dataflow_Algebras_as_Formal_Specifications_of_Data_Flows","242427043_Using_Dataflow_Algebra_as_a_Specification_Method","242427042_An_Operational_Semantics_for_the_Dataflow_Algebra","242426966_A_Simplified_Abstract_Syntax_for_the_Dataflow_Algebra"]}