{"id":"264827727_Using_virtual_reality_to_support_the_physical_security_of_nuclear_facilities","abstract":"The Brazilian nuclear program has reinforced the importance of improving the physical security of nuclear facilities located in this country. Thus, the present work proposes the development of a new tool that allows the user to make interactions inside a virtual environment, which simulates the nuclear facility's structure, in order to aid on planning action strategies to improve its security. For such, a virtual model of the Brazilian nuclear research center known as Instituto de Engenharia Nuclear (IEN), located on Ilha do Fundão – Rio de Janeiro was developed. It is defined as a 3D model with a high degree of fidelity to the real environment in which it is based. Inside this model, characters known as avatars can move and interact in real time. Situations that could affect invader's visibility and detection such as natural and artificial illumination, climate and shadows can be represented with realism. In addition, the tool has a virtual CCTV surveillance system that allows environment supervising. Thus, the system makes possible strategies simulation, allowing an evaluation of the performed procedures as well as assisting in the training of security personnel in nuclear and radioactive installations.","authors":["Marcio Henrique da Silva","Andre Cotelli do Espirito Santo","Eugenio R. Marins","Ana Paula Legey de Siqueira"],"meta":["January 2015Progress in Nuclear Energy 78:19–24","DOI:10.1016/j.pnucene.2014.07.004"],"references":["316281476_3-D_Virtual_Reality_for_Education_Training_and_Improved_Human_Performance_in_Nuclear_Applications","3210696_Virtual_Control_Desks_for_Nuclear_Power_Plant_Simulation_Improving_Operator_Training","328717373_Security_Strategy_From_Requirements_to_Reality","295812983_Virtual_Simulation_for_Training_Personnel_in_Emergency_and_Security_Preparedness_and_Counteraction","285255510_Virtual_reality_as_a_training_instrument","251574384_Radiation_dose_rate_map_interpolation_in_nuclear_plants_using_neural_networks_and_virtual_reality_techniques","245187025_Virtual_environments_simulation_for_dose_assessment_in_nuclear_plants","5358094_Using_a_Game_Engine_for_VR_Simulations_in_Evacuation_Planning"]}