{"id":"264915525_How_to_Certify_the_Leakage_of_a_Chip","abstract":"Evaluating side-channel attacks and countermeasures requires determining the amount of information leaked by a target device. For this purpose, information extraction procedures published so far essentially combine a “leakage model” with a “distinguisher”. Fair evaluations ideally require exploiting a perfect leakage model (i.e. exactly corresponding to the true leakage distribution) with a Bayesian distinguisher. But since such perfect models are generally unknown, density estimation techniques have to be used to approximate the leakage distribution. This raises the fundamental problem that all security evaluations are potentially biased by both estimation and assumption errors. Hence, the best that we can hope is to be aware of these errors. In this paper, we provide and implement methodological tools to solve this issue. Namely, we show how sound statistical techniques allow both quantifying the leakage of a chip, and certifying that the amount of information extracted is close to the maximum value that would be obtained with a perfect model.","authors":["François Durvaux","François-Xavier Standaert","Nicolas Veyrat-Charvillon"],"meta":["May 2014","DOI:10.1007/978-3-642-55220-5_26","Conference: Annual International Conference on the Theory and Applications of Cryptographic Techniques"],"references":["265353829_A_Multidimensional_Goodness-of-Fit_Test_Based_on_Interpoint_Distances","262322037_Shuffling_against_Side-Channel_Attacks_A_Comprehensive_Study_with_Cautionary_Note","250044477_Towards_Security_Limits_in_Side-Channel_Attacks_With_an_Application_to_Block_Ciphers","287104147_Predictive_Inference","262238400_Optimal_First-Order_Masking_with_Linear_and_Non-linear_Bijections","262235484_Theory_and_Practice_of_a_Leakage_Resilient_Masking_Scheme","257803300_Portability_of_templates","254204765_Spacings_revisited","242358078_The_Elements_Of_Statistical_Learning","239727257_The_Elements_of_Statistical_Learning_Theory"]}