{"id":"264948466_A_Bit-Encoding_Phase_Selection_Strategy_for_Satisfiability_Solvers","abstract":"The phase (also called polarity) selection strategy is an important component of a SAT solver based on conflict-driven DPLL. DPLL algorithm is due to Davis, Putnam, Logemann, Loveland. It is a complete, backtracking-based search algorithm for deciding the satisfiability of propositional logic formulae. This paper studies the phase selection strategy and presents a new phase selection strategy, called bit-encoding scheme. The basic idea of this new strategy is to let the phase at each decision level correspond to a bit value of the binary representation of a counter. The counter increases in step with the increase of the number of restarts. In general, only the first 6 decision levels use this new scheme. The other levels use an existing scheme. Compared with the existing strategies, the new strategy is simple, and its cost is low. Experimental results show that the performance of the new phase strategy is good, and the new solver Glue_bit based on it can improve Glucose 2.1 which won a Gold Medal for application category at the SAT Challenge 2012. Furthermore, Glue_bit solved a few application instances that were not solved in the SAT Challenge 2012. From the results on the application SAT+UNSAT category at the SAT Competition 2013, Glue_bit was the best improved version of Glucose, and outperformed glucose 2.3 that is the latest improved version of glucose 2.1.","authors":["Jingchao Chen"],"meta":["April 2014","DOI:10.1007/978-3-319-06089-7_11","Conference: International Conference on Theory and Applications of Models of Computation"],"references":["221633294_Heavy-Tailed_Distributions_in_Combinatorial_Search","220944633_A_Lightweight_Component_Caching_Scheme_for_Satisfiability_Solvers","220944584_Minimizing_Learned_Clauses","220944343_On-the-Fly_Clause_Improvement","220944342_On_Freezing_and_Reactivating_Learnt_Clauses","262321197_Refining_restarts_strategies_for_SAT_and_UNSAT_formulae","230633469_A_Dynamic_Phase_Selection_Strategy_for_Satisfiability_Solvers","220944554_Building_a_Hybrid_SAT_Solver_via_Conflict-Driven_Look-Ahead_and_XOR_Reasoning_Techniques","220812877_Predicting_Learnt_Clauses_Quality_in_Modern_SAT_Solvers","220642599_Solving_Propositional_Satisfiability_Problems","51910399_Phase_Selection_Heuristics_for_Satisfiability_Solvers","2409503_Chaff_Engineering_an_Efficient_SAT_Solver"]}