{"id":"264988578_Switching_neuronal_state_optimal_stimuli_revealed_using_a_stochastically-seeded_gradient_algorithm","abstract":"Inducing a switch in neuronal state using energy optimal stimuli is relevant to a variety of problems in neuroscience. Analytical techniques from optimal control theory can identify such stimuli; however, solutions to the optimization problem using indirect variational approaches can be elusive in models that describe neuronal behavior. Here we develop and apply a direct gradient-based optimization algorithm to find stimulus waveforms that elicit a change in neuronal state while minimizing energy usage. We analyze standard models of neuronal behavior, the Hodgkin-Huxley and FitzHugh-Nagumo models, to show that the gradient-based algorithm: 1) enables automated exploration of a wide solution space, using stochastically generated initial waveforms that converge to multiple locally optimal solutions; and 2) finds optimal stimulus waveforms that achieve a physiological outcome condition, without a priori knowledge of the optimal terminal condition of all state variables. Analysis of biological systems using stochastically-seeded gradient methods can reveal salient dynamical mechanisms underlying the optimal control of system behavior. The gradient algorithm may also have practical applications in future work, for example, finding energy optimal waveforms for therapeutic neural stimulation that minimizes power usage and diminishes off-target effects and damage to neighboring tissue.","authors":["Joshua Chang","David Paydarfar"],"meta":["August 2014Journal of Computational Neuroscience 37(3)","DOI:10.1007/s10827-014-0525-5","SourcePubMed","Project: Electroceutical optimization"],"references":["276225453_A_Review_of_Gradient_Algorithms_for_Numerical_Computation_of_Optimal_Trajectories","268042868_A_Survey_of_Numerical_Methods_for_Optimal_Control","315948584_Energy-efficient_action_potentials_in_hippocampal_mossy_fibers","301233014_Synchronization_and_rhythmic_processes_in_biology","301232983_The_Geometry_of_Biological_Time","299765290_Brain_Stimulation_in_Epilepsy","280960608_Method_of_Gradients","280895796_Neural_excitability_spiking_and_bursting","274652670_Calculus_of_Variations","270309504_The_Geometry_of_Biological_Time"]}