{"id":"264936516_Designing_Technology_Services_and_Systems_for_Social_Impact_in_the_Developing_World_Strong_Sustainability_Required","abstract":"In the post-Bruntland era of sustainable development, design has taken a decided turn towards social impact although shows limited understanding of sustainable development. Socially responsible design (SRD) in developing countries builds on discourses of human-centred design, sustainability and social impact. Despite its successes, design approaches, however, remain firmly embedded in the mainstream sustainable development (MSD) discourse of market environmentalism, populism and ecological modernization. This has led to short term successes and failures of technology innovation, which a broader and deeper understanding could have helped avoid. Beyond Life Cycle Analysis (LCA) and eco-design for sustainability are development demands that question economic, social and environmental common sense, demanding systemic approaches to innovation and policy and governance change for sustainable livelihoods in BoP contexts. Focused on material and object constraints, industrial and product design is intellectually weak in this respect and divorced from actively participating in larger informed debates although new models, such as industrial ecology suggest new possibilities. From end-of-pipe pollution control to deep green ecology, the ladder of sustainable development ideologies position technology innovation relative to human and ecological well-being differently. Taking such an agenda seriously will demand radical change to design curricula to better integrate social impact economics and innovation. This paper proposes that sustainable development and social entrepreneurship and not sustainability and philanthropy should be the framework of choice for design’s theoretical and practical contribution to development in BoP. Contributing to this discussion are outcomes and experiences from a joint IITM (Madras) and Swinburne University (Australia) collaboration.","authors":["Gavin Melles","Blair Kuys","Ajay Kapoor","James Rajanayagam"],"meta":["January 2015","DOI:10.1007/978-81-322-2229-3_8","In book: ICoRD’15 – Research into Design Across Boundaries. (pp.89-97)Edition: Smart Innovation, Systems and Technologies 35, Vol.2Chapter: 8Publisher: SpringerEditors: A. Chakrabarti"],"references":["272500741_After_2015_Progress_and_Challenges_for_Development","263772174_Social_entrepreneurship_with_design_in_Southern_India_lessons_for_Australia","346928880_Design_Futuring_Sustainability_Ethics_and_New_Practice","292899381_The_Post-Washington_Consensus_Development_After_the_Crisis","290938250_Frugal_innovation_in_emerging_markets","290059227_Teaching_for_sustainable_development","288769620_Sustainable_Development","281263048_The_birth_of_sustainable_development","273354145_Design_Thinking_for_Social_Innovation_By","269434503_Green_Development_Environment_and_Sustainability_in_the_Third_World","262406593_One_Laptop_Per_Child_Vision_vs_Reality","254231661_Environment_sustainabilities_An_analysis_and_a_typology","253411658_Social_Entrepreneurship_The_Case_for_Definition","251497754_Innovative_initiatives_supporting_inclusive_innovation_in_India_Social_business_incubation_and_micro_venture_capital","249563513_Design_for_Development_A_Capability_Approach"]}