{"id":"264918983_Understanding_the_Mathematics_of_Personal_Finance_An_Introduction_to_Financial_Literacy","abstract":"A user-friendly presentation of the essential concepts and tools for calculating real costs and profits in personal finance Understanding the Mathematics of Personal Finance explains how mathematics, a simple calculator, and basic computer spreadsheets can be used to break down and understand even the most complex loan structures. In an easy-to-follow style, the book clearly explains the workings of basic financial calculations, captures the concepts behind loans and interest in a step-by-step manner, and details how these steps can be implemented for practical purposes. Rather than simply providing investment and borrowing strategies, the author successfully equips readers with the skills needed to make accurate and effective decisions in all aspects of personal finance ventures, including mortgages, annuities, life insurance, and credit card debt. The book begins with a primer on mathematics, covering the basics of arithmetic operations and notations, and proceeds to explore the concepts of interest, simple interest, and compound interest. Subsequent chapters illustrate the application of these concepts to common types of personal finance exchanges, including: Loan amortization and savings Mortgages, reverse mortgages, and viatical settlements Prepayment penalties Credit cards The book provides readers with the tools needed to calculate real costs and profits using various financial instruments. Mathematically inclined readers will enjoy the inclusion of mathematical derivations, but these sections are visually distinct from the text and can be skipped without the loss of content or complete understanding of the material. In addition, references to online calculators and instructions for building the calculations involved in a spreadsheet are provided. Furthermore, a related Web site features additional problem sets, the spreadsheet calculators that are referenced and used throughout the book, and links to various other financial calculators. Understanding the Mathematics of Personal Finance is an excellent book for finance courses at the undergraduate level. It is also an essential reference for individuals who are interested in learning how to make effective financial decisions in their everyday lives.","authors":["Lawrence Dworsky"],"meta":["September 2009","DOI:10.1002/9780470538395"],"references":[]}