{"id":"264933254_Inverting_for_a_deterministic_surface_gravity_wave_using_he_sensitivity_kernel_approach","abstract":"The dynamic imaging of a deterministic gravity wave propagating at an air-water interface requires continuous sampling of every point at this interface. This sampling can be done acoustically using waves that propagate in the water column but have specular reflection points that fully scan the air-water interface. This study aims to perform this complex task experimentally, with identical ultrasonic source and receiver arrays that face each other in a 1-m-long, 5-cm-deep fluid waveguide, and with frequencies in the MHz range. The waveguide transfer matrix is recorded 100 times per second between the source-receiver arrays, while a gravity wave is generated at the air-water interface. Through the beamforming process, a large set of acoustic multi-reverberated beams are isolated and identified that interact with the air-water interface. The travel-time and amplitude modulations of each eigenbeam are measured when the surface gravity wave travels through the source-receiver plane. Linear inversion of the travel-time and amplitude perturbations is performed from a few thousand eigenbeams using diffraction-based sensitivity kernels. Inversion results using travel-times, amplitudes, or these two observables together, lead to accurate spatial-temporal patterns of the surface deformation. The advantages and limitations of the method are discussed.","authors":["Philippe Roux","Barbara Nicolas"],"meta":["April 2014","DOI:10.1121/1.4867374"],"references":["257749648_Shallow-water_acoustic_tomography_from_angle_measurements_instead_of_travel-time_measurements","249996330_Time-angle_sensitivity_kernels_for_sound-speed_perturbations_in_a_shallow_ocean","249996077_Experimental_measuement_of_the_acoustic_sensitivity_kernel","269066490_Wave-equation_tomography","266235755_Attenuation_of_the_coherent_component_of_sound_propagating_in_shallow_water_with_rough_boundaries","253704393_Tomography_Adjoint_Methods_Time-Reversal_and_Banana-Doughnut_Kernels","252696679_Generating_eigenray_tubes_from_two_solutions_of_the_wave_equation","249865023_Wave-equation_tomography","243776990_The_Validity_of_the_Kirchoff_Approximation_for_Rough_Surface_Scattering_Using_a_Gaussian_Roughness_Spectrum","243771967_A_Split-step_Pad_Solution_for_the_Parabolic_Equation_Method_J_Acoust_Soc_Am_93_1736-1742"]}