{"id":"265024077_Building_Effective_Blended_Learning_Programs","abstract":"Introduction The first generation of e-learning or Web-based learning programs focused on presenting physical classroom-based instructional content over the Internet. Furthermore, first-generation e-learning (digitally delivered learning) programs tended to be a repetition or compilation of online versions of classroom-based courses. The experience gained from the first-generation of e-learning, often riddled with long sequences of 'page-turner' content and point-and-click quizzes, is giving rise to the realization that a single mode of instructional delivery may not provide sufficient choices, engagement, social contact, relevance, and context needed to facilitate successful learning and performance. In the second wave of e-learning, increasing numbers of learning designers are experimenting with blended learning models that combine various delivery modes. Anecdotal evidence indicates that blended learning not only offers more choices but also is more effective. November -December 2003 Issue of Educational Technology, Volume 43, Number 6, Pages 51-54. This article has two objectives: 1. To provide a comprehensive view of blended learning and discuss possible dimensions and ingredients (learning delivery methods) of blended learning programs. 2. To provide a model to create the appropriate blend by ensuring that each ingredient, individually and collectively, adds to a meaningful learning experience. Badrul Khan's blended e-learning framework, referred to here as Khan's Octagonal Framework (see Figure 1) enables one to select appropriate ingredients (http://BooksToRead.com/framework). Khan's framework serves as a guide to plan, develop, deliver, manage, and evaluate blended learning programs. Organizations exploring strategies for effective learning and performance have to consider a variety of issues to ensure effective delivery of learning and thus a high return on investment. Figure 1. Khan's Octagonal Framework.","authors":["Harvey Singh"],"meta":["January 2003"],"references":[]}