{"id":"265077377_A_Review_of_various_k-Nearest_Neighbor_Query_Processing_Techniques","abstract":"Identifying the queried object, from a large volume of given uncertain dataset, is a tedious task which involves time complexity and computational complexity. To solve these complexities, various research techniques were proposed. Among these, the simple, highly efficient and effective technique is, finding the K-Nearest Neighbor (kNN) algorithm. It is a technique which has applications in various fields such as pattern recognition, text categorization, moving object recognition etc. Different kNN techniques are proposed by various researchers under various situations. In this paper, we classified these techniques into two ways: (1) structure based (2) non-structure based kNN techniques. The aim of this paper is to analyze the key idea, merits, demerits and target data behind each kNN techniques. The structure based kNN techniques such as Ball Tree, k-d Tree, Principal Axis Tree (PAT), Orthogonal Structure Tree (OST), Nearest Feature Line (NFL), Center Line (CL) and Non-structured kNN techniques such as Weighted kNN, Condensed NN, Model based k-NN, Ranked NN (RNN), Pseudo/Generalized NN, Clustered k-NN(CkNN), Mutual kNN (MkNN), Constrained RkNN etc., are analyzed in this paper. It is observed that the structure based kNN techniques suffer due to memory limit whereas the Non-structure based kNN techniques suffer due to computation complexity. Hence, structure based kNN techniques can be applied to small volume of data whereas Non-structure kNN techniques can be applied to large volume of data.","authors":["Subramaniam Dhanabal","Chandramathi SA"],"meta":["January 2011International Journal of Computers and Applications 3(7)"],"references":["312939678_An_improved_kNN_text_classification_algorithm_based_on_clustering","282707871_Nearest_Neighbor_Pattern_Classification","277292408_Voronoi_Diagrams_of_Moving_Points","265400697_A_Note_on_Distance-Weighted_k-Nearest_Neighbor_Rules","247338065_Re_nements_to_nearest-neighbor_searching_in_k-d_trees","246438324_Improving_text_categorization_methods_for_event_tracking","243785032_The_Reduced_Nearest_Neighbor_Rule","242367092_The_r-tree_an_efficient_and_robust_method_for_points_and_rectangles","228980116_Log-based_chat_room_monitoring_using_text_categorization_A_comparative_study","222868068_Locally_nearest_neighbor_classifiers_for_pattern_classification"]}