{"id":"265092235_Characteristics_of_Problem-Based_Learning","abstract":"Problem-based learning (PBL) is widely regarded as a successful and innovative method for engineering education. Since the development of the PBL model at McMaster University in Canada in the late 1960s, many different varieties have emerged. This paper highlights the Dutch approach of directing the learning process through problem analysis and the Danish model of project-organised learning. Various definitions of the concept PBL identify characteristics at the levels of theoretical learning principles, educational models and educational practices. The McMaster-Maastricht PBL model and the Aalborg model of project work share characteristic features such as the theoretical principle of the problem analysis at the basis of the learning process, integration of knowledge and practice, collaboration and group work. Notable differences were found with respect to the type of assignments, assessment methods and organisation of the group work. In comparison to traditional engineering curricula, the PBL models appear to inspire a higher degree of involvement in study activities and, consequently, a higher level of complex comprehension. A possible drawback is the risk of gaps in specific knowledge areas. Therefore, it is crucial that the students in a PBL curriculum become lifelong learners who have learned to take responsibility for their own learning process.","authors":["Erik De Graaff","Anette Kolmos"],"meta":["January 2003International Journal of Engineering Education 19(5):657-662","Project: Innovative engineering education"],"references":["245494037_Reflections_on_Project_Work_and_Problem-based_Learning","243783611_Problem-based_Learning_in_Higher_Education_Untold_Stories","234153990_Using_the_student_questionnaire_in_implementing_a_problem-based_learning_programme","284890181_New_directions_for_teaching_and_learning_Vol_68_Bringing_problem-based_learning_to_higher_education_Theory_and_practice","257926245_Bringing_Problem-Based_Learning_to_Higher_Education_Theory_and_Practice","255049369_Theory_and_Practice_of_Educational_Innovation_through_Introduction_of_Problem-Based_Learning_in_Architecture","238286529_On_Becoming_An_Innovative_University_Teacher_Reflection_in_Action","233298278_The_evaluation_system_at_the_Medical_School_of_Maastricht","21131563_Pitfalls_in_the_pursuit_of_objectivity_issues_of_reliability"]}