{"id":"265049190_R_Reply_to_Angius_and_Primiero_on_Software_Intensive_Science","abstract":"This paper provides a reply to articles by Nicola Angius and Guiseppe Primiero responding to our paper \"Software Intensive Science\" (Symons and Horner, Philosophy and Technology, 2014). Keywords Software intensive science . Computational models We are very grateful to Nicola Angius and Giuseppe Primiero for their careful critical readings of our paper \"Software Intensive Science\" (Symons and Horner 2014). While both are in agreement with the specific results we present, their responses indicate the need for further work on our part to articulate the implications of these results for Philosophy of Computing and General Philosophy of Science. In our reply, we endeavor to clarify some potential points of confusion and explain where and why we disagree. The central thesis of our paper is this: the high conditionality of typical software, as we restrict the term in that paper, implies that, in general (i.e., over all cases of interest), there is no known effective method for characterizing (i.e., articulating all necessary and sufficient conditions describing) the error distribution in software. It follows that to the extent knowledge in a scientific domain directly depends on \"software,\" there is no known effective method for characterizing the error distribution of that scientific domain. We accordingly claim that these considerations motivate defining a distinction between software-intensive science (SIS) and non-software-intensive science (NSIS) in terms of a measure of software conditionality which we call \"path complexity.\" Both Angius and Primiero agree that this feature of contemporary science has important philosophical implications and they indicate some important lines of inquiry that merit further consideration. Both Angius and Primiero raise important questions concerning the integration of our arguments concerning path complexity with traditional debates in philosophy. Primiero is highly sympathetic to the main thrust of our paper. \"SIS,\" he writes, \"is here to stay, and we better have the conceptual and formal tools to understand it.\" (Primiero 2014) Of course, we are in complete agreement and concur with his account Philos. Technol.","authors":["E P Ly","Jack Horner","John Symons"],"meta":["August 2014Philosophy & Technology 27(3)","DOI:10.1007/s13347-014-0172-9"],"references":["265049176_R_Software_Intensive_Science","264489775_Computational_Idealizations_in_Software_Intensive_Science_a_Comment_on_Symons'_Horner's_paper","264418839_On_the_Ontology_of_the_Computing_Process_and_the_Epistemology_of_the_Computed","245738620_Computability_and_Logic"]}