{"id":"265026009_A_Domain-Specific_Language_for_Modelling_Security_Objectives_in_a_Business_Process_Models_of_SOA_Applications","abstract":"Business process modelling is very crucial for enterprises because it give an idea how the business would be operated in the real world and it is important for every stakeholder. SOA is one of the most popular architecture for building Web Information Systems. In current SOA system development practices, security is not defined at the early phases of software development and left on the developer. Properly configuring security requirements in SOA applications is quite difficult for developers because they are not security experts, furthermore SOA security is cross-domain and all required information are not available at downstream phases. The post-hoc, low-level integration of security has a negative impact on resulting SOA applications. Business process modelling is normally performed by the Business Process expert who is not a security expert. Furthermore current business process modelling languages like UML or BPMN do not support the specification of security requirements along the business process modelling. We have presented a DSL, to model the security requirements along the business process model. We are facilitating the Business Process expert to model the security in business process diagram. This security annotated business process model will facilitate the security expert in specifying concrete security implementation. As a proof of work the proposed DSL is applied to the modeling of a typical business process of \"on-line student information system\".","authors":["M.Q. Saleem","Jafreezal Jaafar","Mohd Fadzil Hassan"],"meta":["January 2012","DOI:10.4156/aiss.vol4.issue1.45"],"references":["313598450_Extending_the_UML_for_multidimensional_modeling","254439913_SECTISSIMO_A_platform-independent_framework_for_security_services","224564275_Metamodels_in_Europe_Languages_Tools_and_Applications","297128421_Making_the_internet_search_as_a_smarter_service_Based_on_Taiwanese_searching_preferences","272849516_A_SOA-Based_e-Learning_System_for_Teaching_Fundamental_Information_Management_Courses","240121394_Modeling_security_concerns_in_service-o_riented_architectures","228359476_Metamodel-based_UML_notations_for_domain-specific_languages","225219474_Towards_a_UML_20_Extension_for_the_Modeling_of_Security_Requirements_in_Business_Processes","224602480_A_Security_Meta-model_for_Service-Oriented_Architectures","224501400_Security_Requirements_Specification_in_Service-Oriented_Business_Process_Management"]}