{"id":"265118412_Transient_Thermal_and_Structural_Analysis_of_the_Rotor_Disc_of_Disc_Brake","abstract":"Transient Thermal and Structural Analysis of the Rotor Disc of Disk Brake is aimed at evaluating the performance of disc brake rotor of a car under severe braking conditions and there by assist in disc rotor design and analysis. An investigation into usage of new materials is required which improve braking efficiency and provide greater stability to vehicle. This investigation can be done using ANSYS software. ANSYS 11.0 is a dedicated finite element package used for determining the temperature distribution, variation of the stresses and deformation across the disc brake profile. In the present work, an attempt has been made to investigate the suitable hybrid composite material which is lighter than cast iron and has good Young's modulus, Yield strength and density properties. Aluminum base metal matrix composite and High Strength Glass Fiber composites have a promising friction and wear behavior as a Disk brake rotor. The transient thermo elastic analysis of Disc brakes in repeated brake applications has been performed and the results were compared. The suitable material for the braking operation is S2 glass fiber and all the values obtained from the analysis are less than their allowable values. Hence the brake Disc design is safe based on the strength and rigidity criteria. By identifying the true design features, the extended service life and long term stability is assured.","authors":["Thilak V M M","Krishnaraj Ramaswamy","K Sakthivel","Deepan Kanthavel"],"meta":[],"references":["261266723_A_new_structure_of_MR_brake_with_the_waveform_boundary_of_rotary_disk","251952012_Mechanical_and_magnetic_analysis_of_magnetostrictive_disc_brake_system","251902038_Numerical_study_on_the_vibration_characteristics_of_automobile_brake_disk_and_pad","251830761_Thermophysical_Properties_of_Automotive_Brake_Disk_Materials","232658665_Image_Analysis_System_for_Measuring_the_Thickness_of_Train_Brakes","224673672_Disk_Brake_Squeal_Modeling_and_Active_Control","224595820_The_Finite_Element_Model_of_Transient_Temperature_Field_of_Airplane_Brake_Disks_with_Rough_Surface_Profile","224591725_Semi-similarity_design_of_motorcycle-hydraulic-disk_brake_Strategy_and_application","224185254_Thermal-structure_coupling_analysis_of_disc_brake","224171179_Design_of_a_Multidisc_Electromechanical_Brake"]}