{"id":"265174857_Evaluating_environmental_impacts_of_contrasting_pig_farming_systems_with_life_cycle_assessment","abstract":"Environmental impacts of 15 European pig farming systems were evaluated in the European Union Q-PorkChains project using life cycle assessment. One conventional and two non-conventional systems were evaluated from each of the five countries: Denmark, The Netherlands, Spain, France and Germany. The data needed for calculations were obtained from surveys of 5 to 10 farms from each system. The systems studied were categorised into conventional (C), adapted conventional (AC), traditional (T) and organic (O). Compared with C systems, AC systems differed little, with only minor changes to improve meat quality, animal welfare or environmental impacts, depending on the system. The difference was much larger for T systems, using very fat, slow-growing traditional breeds and generally outdoor raising of fattening pigs. Environmental impacts were calculated at the farm gate and expressed per kg of pig live weight and per ha of land used. For C systems, impacts per kg LW for climate change, acidification, eutrophication, energy use and land occupation were 2.3 kg CO2-eq, 44.0 g SO2-eq, 18.5 g PO4-eq, 16.2 MJ and 4.1 m2, respectively. Compared with C, differences in corresponding mean values were +13%, +5%, 0%, +2% and +16% higher for AC; +54%, +79%, +23%, +50% and +156% for T, and +4%, -16%, +29%, +11% and +121% for O. Conversely, when expressed per ha of land use, mean impacts were 10% to 60% lower for T and O systems, depending on the impact category. This was mainly because of higher land occupation per kg of pig produced, owing to feed production and the outdoor raising of sows and/or fattening pigs. The use of straw bedding tended to increase climate change impact per kg LW. The use of traditional local breeds, with reduced productivity and feed efficiency, resulted in higher impacts per kg LW for all impact categories. T systems with extensive outdoor raising of pigs resulted in markedly lower impact per ha of land used. Eutrophication potential per ha was substantially lower for O systems. Conventional systems had lower global impacts (global warming, energy use, land use), expressed per kg LW, whereas differentiated systems had lower local impacts (eutrophication, acidification), expressed per ha of land use.","authors":["Jean-Yves Dourmad","Julie Ryschawy","Tiphaine Trousson","Michel Bonneau"],"meta":["August 2014animal 8(12):1-11","DOI:10.1017/S1751731114002134","SourcePubMed"],"references":["311450644_Life_Cycle_Inventories_of_Swiss_and_European_Agricultural_Systems_Data_v20","272130985_Implementation_of_Life_Cycle_Impact_Assessment_Methods","265418550_Evaluation_of_the_sustainability_of_contrasted_pig_farming_systems_Development_of_a_market_conformity_tool_for_pork_products_based_on_technological_quality_traits","265135970_Evaluation_of_the_sustainability_of_contrasted_pig_farming_systems_The_procedure_the_evaluated_systems_and_the_evaluation_tools","265135944_Evaluation_of_the_sustainability_of_contrasted_pig_farming_systems_Economy","265135820_Evaluation_of_the_sustainability_of_contrasted_pig_farming_systems_Breeding_programmes","263239333_Life_Cycle_Inventories_of_Agricultural_Production_Systems","313610126_Environmental_impact_assessment_for_a_farming_region_a_review_of_methods","313604835_Life_cycle_assessment_An_operational_guide_to_ISO_standards","285264366_Determining_the_Environmental_Burdens_and_Resource_Use_in_the_Production_of_Agricultural_and_Horticultural_Commodities"]}