{"id":"265165842_An_Intelligent_and_Object-oriented_Blueprint_for_a_Mobile_Learning_Institute_Information_System","abstract":"The purpose of this conceptual paper is to develop an original framework that summarizes the applicable software model, and guiding approaches and principles for designing a comprehensive information system for a mobile learning institute. Artificial intelligence has played a role in various strands of computer-mediated education, including e-learning learning platforms. In adaptive delivery mode, learning applications simulate the behavior and interaction of human teachers. AI functionality can be incorporated into mobile learning because mobile devices have the processing power and operate in wireless networks. In addition, the individual elements of the framework are illustrated in industry-standard Unified Modeling Language diagrams. A review of educational and artificial intelligence literatures shows how these fields are related and helps identify techniques to develop smart mobile learning applications. An overview of mobile learning application design helps build a theoretical foundation in this area. The individual parts of the proposed framework are: the architectural framework, cognitive framework, project definition framework, application design framework, and organizational framework. The organizational framework lays the conceptual foundation for creating and implementing an information system within a newly established mobile learning institute. This paper fills a gap in the literature as there is currently no comprehensive overview of this topic. Furthermore, there are currently no existing schools, organizations, or individual departments within that focus only on and provide mobile learning. In addition to fostering the development of such a mobile learning institute, the proposed framework is also useful for guiding technical work on content design.","authors":["Emre Erturk"],"meta":["September 2013","DOI:10.20533/iji.1742.4712.2013.0085"],"references":["279841460_Automatic_Generation_of_HardwareSoftware_Interfaces","265163589_INTERNATIONAL_TECHNOLOGY_TRANSFER_THE_CASE_OF_FREE_COMPUTER_SOFTWARE","8915890_A_General_Architecture_for_Intelligent_Tutoring_of_Diagnostic_Classification_Problem_Solving","220801095_Skeuomorphs_and_Cultural_Algorithms","47278141_Developing_Mobile_Learning_Applications_for_Android_using_Web_Services"]}