{"id":"265175098_Exome_sequence_read_depth_methods_for_identifying_copy_number_changes","abstract":"Copy number variants (CNVs) play important roles in a number of human diseases and in pharmacogenetics. Powerful methods exist for CNV detection in whole genome sequencing (WGS) data, but such data are costly to obtain. Many disease causal CNVs span or are found in genome coding regions (exons), which makes CNV detection using whole exome sequencing (WES) data attractive. If reliably validated against WGS-based CNVs, exome-derived CNVs have potential applications in a clinical setting. Several algorithms have been developed to exploit exome data for CNV detection and comparisons made to find the most suitable methods for particular data samples. The results are not consistent across studies. Here, we review some of the exome CNV detection methods based on depth of coverage profiles and examine their performance to identify problems contributing to discrepancies in published results. We also present a streamlined strategy that uses a single metric, the likelihood ratio, to compare exome methods, and we demonstrated its utility using the VarScan 2 and eXome Hidden Markov Model (XHMM) programs using paired normal and tumour exome data from chronic lymphocytic leukaemia patients. We use array-based somatic CNV (SCNV) calls as a reference standard to compute prevalence-independent statistics, such as sensitivity, specificity and likelihood ratio, for validation of the exome-derived SCNVs. We also account for factors known to influence the performance of exome read depth methods, such as CNV size and frequency, while comparing our findings with published results.","authors":["Latha Kadalayil","Sajjad Rafiq","Matthew Rose-Zerilli","Reuben J Pengelly"],"meta":["August 2014Briefings in Bioinformatics 16(3)","DOI:10.1093/bib/bbu027","SourcePubMed"],"references":["260608535_An_Evaluation_of_Copy_Number_Variation_Detection_Tools_from_Whole-Exome_Sequencing_Data","259156370_Comparative_Study_of_Exome_Copy_Number_Variation_Estimation_Tools_Using_Array_Comparative_Genomic_Hybridization_as_Control","258203045_EXCAVATOR_Detecting_copy_number_variants_from_whole-exome_sequencing_data","234109494_CoNVEX_Copy_number_variation_estimation_in_exome_sequencing_data_using_HMM","234040925_Estimation_of_Copy_Number_Alterations_from_Exome_Sequencing_Data","282821093_High-resolution_mapping_of_copy-number_alterations_with_massively_parallel_sequencing_nature","260556257_Comparative_analysis_of_methods_for_identifying_somatic_copy_number_alterations_from_deep_sequencing_data","258304693_Population-genetic_nature_of_copy_number_variations_in_the_human_genome","253336037_Detection_of_Clinically_Relevant_Copy_Number_Variants_with_Whole-Exome_Sequencing","236090721_FishingCNV_A_graphical_software_package_for_detecting_rare_copy_number_variations_in_exome-sequencing_data"]}