{"id":"265232894_Collocational_Differences_Between_L1_and_L2_Implications_for_EFL_Learners_and_Teachers","abstract":"Collocations are one of the areas that produce problems for learners of English as a foreign language. Iranian learners of English are by no means an exception. Teaching experience at schools, private language centers, and universities in Iran suggests that a significant part of EFL learners’ problems with producing the language, especially at lower levels of proficiency, can be traced back to the areas where there is a difference between source- and target-language word partners. As an example, whereas people in English make mistakes, Iranians do mistakes when speaking Farsi (Iran’s official language, also called Persian) or Azari (a Turkic language spoken mainly in the north west of Iran). Accordingly, many beginning EFL learners in Iran are tempted to produce the latter incorrect form rather than its acceptable counterpart in English. This is a comparative study of Farsi (Persian) and English collocations with respect to lexis and grammar. The results of the study, with 76 participants who sat a 60-item Farsi (Persian)- English test of collocations, indicated that learners are most likely to face great obstacles in cases where they negatively transfer their linguistic knowledge of the L1 to an L2 context. The findings of this study have some immediate implications for both language learners and teachers of EFL/ESL, as well as for writers of materials.","authors":["Karim Sadeghi"],"meta":["June 2009TESL Canada Journal 26(2)","DOI:10.18806/tesl.v26i2.417"],"references":["354800506_Words_Meaning_and_Vocabulary_An_introduction_to_modern_English_lexicology","333036326_Contrastive_analysis_error_analysis_and_learning_difficulty","319394170_The_Concise_Oxford_Dictionary_of_Linguistics","281770916_Vocabulary_Applied_Linguistic_Perspectives","281430493_Collocations_and_idioms","277136690_English_Collocations_in_Use_Intermediate","276228055_Lexical_Semantics","270551340_Students'_Errors_and_the_Learning_of_French_as_a_Second_Language_A_Pilot_Study","270085864_Working_with_Words_A_Guide_to_Teaching_and_Learning_Vocabulary","265182625_pre-intermediate_intermediate_English_Vocabulary_in_Use"]}