{"id":"265215707_SenSocial_A_Middleware_for_Integrating_Online_Social_Networks_and_Mobile_Sensing_Data_Streams","abstract":"Smartphone sensing enables inference of physical context, while online social networks (OSNs) allow mobile applications to harness users’ interpersonal relationships. However, OSNs and smartphone sensing remain disconnected, since obstacles, including the synchronization of mobile sensing and OSN monitoring, inefficiency of smartphone sensors, and privacy concerns, stand in the way of merging the information from these two sources.\nIn this paper we present the design, implementation and evaluation of SenSocial, a middleware that automates the process of obtaining and joining OSN and physical context data streams for the development of ubiquitous computing applications. SenSocial enables instantiation, management and aggregation of context streams from multiple remote devices. Through micro-benchmarks we show that SenSocial successfully and efficiently captures OSN and mobile sensed data streams. We developed two prototype applications in order to evaluate our middleware and we demonstrate that SenSocial significantly reduces the amount of programming effort needed for building social sensing applications.","authors":["Abhinav Mehrotra"],"meta":["December 2014","DOI:10.1145/2663165.2663331","Conference: Middleware’14At: Bordeaux, France"],"references":["267847444_BeWell_A_Smartphone_Application_to_Monitor_Model_and_Promote_Wellbeing","262208784_StressSense_Detecting_stress_in_unconstrained_acoustic_environments_using_smartphones","258180066_The_Smartphone_Psychology_Manifesto","257458095_A_content_search_system_considering_the_activity_and_context_of_a_mobile_user","290108429_Pogo_a_Middleware_for_Mobile_Phone_Sensing","281697921_APISENSE_Crowd-Sensing_Made_Easy","270996206_Mobile_social_networking_middleware_A_survey","262277128_Open_source_smartphone_libraries_for_computational_social_science","260359171_Smartphones_for_Large-Scale_Behavior_Change_Interventions","254462489_ACE_Exploiting_Correlation_for_Energy-Efficient_and_Continuous_Context_Sensing"]}