{"id":"265224954_INNOVATION_et_MANAGEMENT_des_CONNAISSANCES","abstract":"2001, Editions d'organisation Une façon d'aborder l'économie de l'immatériel, une démarche d'organisation et de gestion des connaissances qui s'inscrit dans un processus d'innovation globale. Au motif de restructurations douloureuses (right-sizing, reegineeing, qualité totale), les organisations n'ont pas su saisir les opportunités qui se présentaient. Si l'on considère l'entreprise du point de vue de sa richesse immatérielle, on constate qu'elle réside dans chaque être humain, dans chaque échange ou idée. Ce sont ces connaissances obtenues notamment par apprentissage, qui se traduiront par des idées donc des avantages compétitifs. Au lieu d'une concurrence effrénée, il faut coopérer avec les fournisseurs, les clients, en réseau par exemple. Etre leader c'est avoir une capacité à développer des visions, des changements continuels plutôt que du profit à court terme. L'innovation c'est un bienfait au niveau de l'homme, d'une entreprise, d'une nation. La dynamique du kaléidoscope montre que chaque mouvement modifie l'image, ainsi chaque décision de gestion modifie la situation de l'entreprise et aucune gestion ne permet de retrouver l'état initial et peut avoir de multiples conséquences (la systémique). Pour gérer cinq tendances managériales : 1) passer de l'information à la connaissance c'est-à-dire que l'information c'est une information associée à la connaissance, 2) passer de la bureaucratie au réseaux i e flexibilité, information vient de l'intérieur ou de l'extérieur, 3) passer de l'enseignement à au développement de l'apprentissage i e une information continue, structurelle et informelle, 4) passer du local au national à l'international afin de trouver la meilleure recette de gestion dans la diversité, 5) passer d'une stratégie de compétition à une stratégie de collaboration. Ces cinq tendances détermineraient l'entreprise de 5 ième génération. L'histoire de la connaissance aboutit à des courants qui développent de nouvelles techniques de mesure des actifs immatériels ; fait apparaître un engagement pour la qualité et le reengeenering ; engage une nouvelle vision de la gestion de l'innovation et de l'application de l'intelligence artificielle au management ; développe l'apprentissage et utilise comme atout compétitif la technique. Chacun de ces concepts modifie la nature du management et permet l'émergence d'une communauté de pratiques de la connaissance. En conséquence, l'actif le plus précieux est le capital intellectuel de l'entreprise.","authors":["Debra M Amidon"],"meta":[],"references":[]}