{"id":"265248637_PRAXEOLOGY_AS_A_TOOL_FOR_THE_ANALYSIS_OF_A_SCIENCE_MUSEUM_EXHIBIT","abstract":"Dans cet article, je soutiens que la recherche sur la conception d'expositions scientifiques ne saurait produire des résultats d'utilité réelle que si l'on adopte une approche sensible aux contenus et aux contextes institutionnelles spécifiques. En utilisant la notion de praxéologie, je fais l'analyse d'une exposition. Concrètement, je construis une praxéologie visée et une praxéologie observée. Une comparaison de ces deux praxéologies montre que les visiteurs ne mobilisent pas la technologie visée, et aussi les niveaux détaillés où cette divergence se produit. Nous discutons ensuite la façon dont l'application de la notion de praxéologie peut servir comme un outil d'analyse a posteriori, et également comme un outil d'analyse a priori, dans la conception d'une exposée. Abstract. Con el fin de la investigación en el diseño de la ciencia muestra para producir resultados útiles, un contenido y contexto de enfoque específico que se necesita. Puedo investigar una exposición de museo de la ciencia usando la noción de praxeología para construir un objeto y una praxeología observado. Una comparación de estos dos praxeologies no demuestra que los visitantes no están logrando que la tecnología prevista, y señala que esta divergencia tiene lugar. Discutir cómo la aplicación de praxeología utilizado aquí tiene potencial como herramienta de análisis post hoc, sino también como un a priori, la herramienta de diseño para el diseño de exposiciones.","authors":["Marianne Achiam"],"meta":["June 2011","Project: Museums and ATD (Anthropological Theory of Didactics)"],"references":["270116416_Museographic_Transposition_The_Development_of_a_Museum_Exhibit_on_Animal_Adaptations_to_Darkness","254088675_Methodology_and_the_Research-Practice_Gap","220041075_Developing_Learning_Theory_by_Refining_Conjectures_Embodied_in_Educational_Designs","281345602_Design-based_research_An_emerging_paradigm_for_educational_inquiry","256406711_Mindful_visitors_Heritage_and_tourism","250798026_Didactic_Restrictions_on_the_Teacher's_Practice_The_Case_of_Limits_of_Functions_in_Spanish_High_Schools"]}