{"id":"265300502_Robust_Skew_Estimation_of_Handwritten_and_Printed_Documents_Based_on_Grayvalue_Images","abstract":"Skew estimation is a preprocessing step in document image analysis to determine the global dominant orientation of a document's text lines. A skew angle can be introduced during scanning, or if a document is photographed. The correction of the skew angle is necessary for further image analysis, to avoid an influence to the performance of skew sensitive methods, e.g. Optical Character Recognition (OCR) or page segmentation. The performance of current skew estimation methods is shown at the ICDAR2013 Document Image Skew Estimation Contest (DISEC), which uses a benchmark dataset of binarized printed documents with varying layouts and languages like English, Chinese or Greek. The proposed method is based on a Focused Nearest Neighbour Clustering (FNNC) of interest points and the analysis of paragraphs/lines and achieved rank 5 at the contest. In this paper it is shown, that the use of gray value images can outperform the results restricted to binarized images, thus the proposed method avoids the binarization step which is still an open research topic in document image analysis. The robustness of the method is also shown on a dataset comprising historical documents and on low resolution images. The method is evaluated on the DISEC dataset and three additional datasets (historical documents, low resolution documents, and machine printed documents).","authors":["Florian Kleber","Markus Diem","Robert Sablatnig"],"meta":["September 2014","DOI:10.1109/ICPR.2014.521","Conference: Int. Conference on Pattern Recognition (ICPR)At: Stockholm, Schweden"],"references":["239762669_Skew_Estimation_of_Sparsely_Inscribed_Document_Fragments","224265458_Determining_Document_Skew_Using_Inter-Line_Spaces","220933012_Binarization_of_historical_document_images_using_the_local_maximum_and_minimum","261349668_ICDAR_2013_document_image_skew_estimation_contest_DISEC_2013","237471333_Skew_Detection_Technique_for_Binary_Document_Images_based_on_Hough_Transform","226492892_A_Document_Skew_Detection_Method_Using_the_Hough_Transform","224278508_Skew_detection_of_document_images_by_focused_nearest-neighbor_clustering","224074451_Improved_document_skew_detection_based_on_text_line_connected-component_clustering","222403489_Skew_angle_estimation_for_printed_and_handwritten_documents_using_the_Wigner-Ville_distribution","222306652_Skew_detection_and_text_line_position_determination_in_digitized_documents"]}