{"id":"265385644_Hyperbolic_systems_of_conservation_laws","abstract":"A wide class of difference equations is described for approximating discontinuous time dependent solutions, with prescribed initial data, of hyperbolic systems of nonlinear conservation laws. Among these schemes we determine the best ones, i.e., these which have the smallest truncation error and in which the discontinuities are confined to a narrow band of 2 to 3 meshpoints. These schemes are tested for stability and are found to be stable under a mild strengthening of the CourantFriedrichs-Lewy criterion. Test calculations of onedimensional flows of compressible fluids with shocks, rarefaction waves and contact discontinuities show excellent agreement with exact solutions. In particular, when Lagrange coordinates are used, there is no smearing of interfaces. The additional terms introduced into the difference scheme for the purpose of keeping the shock transition narrow are similar to, although not identical with, the artificial viscosity terms, and the like of them introduced by Richtmyer and von Neumann and elaborated by other workers in this field. (auth)","authors":["Lax P. D.","Burton Wendroff"],"meta":["May 1960Communications on Pure and Applied Mathematics 13(2):217-237","DOI:10.1002/cpa.3160130205"],"references":["321315634_Survey_of_the_stability_of_linear_finite_difference_equations","311962960_Weak_solutions_of_nonlinear_hyperbolic_equation_and_their_numerical_computation","268651773_On_difference_schemes_for_solving_initial_value_problems_for_conservation_laws","255593863_The_Scope_of_the_Energy_Method","235086020_A_Numerical_Method_for_Treating_Fluid_Flow_in_the_Presence_of_Shocks","229529319_On_integration_of_parabolic_equations_by_difference_methods_I_Linear_and_quasi-linear_equations_for_the_infinite_interval","226135084_Oberdie_Partiellen_Differengleichurgen_der_Mathematishen_Physik","224536115_A_Method_for_the_Numerical_Calculation_of_Hydrodynamic_Shocks","220431951_Hydrodynamic_Problems_Involving_Large_Fluid_Distortions","51992587_Hyperbolic_Systems_of_Conservation_Laws_II"]}