{"id":"265344015_Systematic_Production_of_Inactivating_and_Non-Inactivating_Suppressor_Mutations_at_the_relA_Locus_That_Compensate_the_Detrimental_Effects_of_Complete_spoT_Loss_and_Affect_Glycogen_Content_in_Escherich","abstract":"In Escherichia coli, ppGpp is a major determinant of growth and glycogen accumulation. Levels of this signaling nucleotide are controlled by the balanced activities of the ppGpp RelA synthetase and the dual-function hydrolase/synthetase SpoT. Here we report the construction of spoT null (ΔspoT) mutants obtained by transducing a ΔspoT allele from ΔrelAΔspoT double mutants into relA+ cells. Iodine staining of randomly selected transductants cultured on a rich complex medium revealed differences in glycogen content among them. Sequence and biochemical analyses of 8 ΔspoT clones displaying glycogen-deficient phenotypes revealed different inactivating mutations in relA and no detectable ppGpp when cells were cultured on a rich complex medium. Remarkably, although the co-existence of ΔspoT with relA proficient alleles has generally been considered synthetically lethal, we found that 11 ΔspoT clones displaying high glycogen phenotypes possessed relA mutant alleles with non-inactivating mutations that encoded stable RelA proteins and ppGpp contents reaching 45–85% of those of wild type cells. None of the ΔspoT clones, however, could grow on M9-glucose minimal medium. Both Sanger sequencing of specific genes and high-throughput genome sequencing of the ΔspoT clones revealed that suppressor mutations were restricted to the relA locus. The overall results (a) defined in around 4 nmoles ppGpp/g dry weight the threshold cellular levels that suffice to trigger net glycogen accumulation, (b) showed that mutations in relA, but not necessarily inactivating mutations, can be selected to compensate total SpoT function(s) loss, and (c) provided useful tools for studies of the in\nvivo regulation of E. coli RelA ppGpp synthetase.","authors":["Manuel Montero","Mehdi Rahimpour","Alejandro Viale","Goizeder Almagro"],"meta":["September 2014PLoS ONE 9(9):e106938","DOI:10.1371/journal.pone.0106938","SourcePubMed"],"references":["290891419_Gapped_BLAST_and_PSIBLAST_A_new_generation_of_protein_database_search_programs","275399417_Glycogen_Biosynthesis_and_Regulation","252670752_Petromagnetic_Properties_In_The_Naica_Mining_District_Chihuahua_Mexico_Searching_For_Source_of_Mineralization","236088770_GlgS_described_previously_as_a_glycogen_synthesis_control_protein_negatively_regulates_motility_and_biofilm_formation_in_Escherichia_coli","230655660_EasyLCMS_An_asynchronous_web_application_for_the_automated_quantification_of_LC-MS_data","228102142_Glycogen_is_the_primary_source_of_glucose_during_the_lag_phase_of_E_coli_proliferation","313502569_One-step_inactivation_of_chromosomal_genes_in_Escherichia_coli_K-12_using_PCR_products","239983395_Miller_JH_Experiments_in_Molecular_Genetics_Cold_Spring_Harbor_Laboratory_Press_Cold_Spring_Harbor_NY","239665864_Experiments_In_Molecular_Genetics","230176108_The_Energy-Dependent_Degradation_of_Guanosine_5'-Diphosphate_3'-Diphosphate_in_Escherichia_coli"]}