{"id":"265467348_PT-Symmetric_Acoustics","abstract":"The concept of acoustic parity-time (PT) symmetry is introduced and used for the study of extraordinary scattering behavior in acoustic PT-symmetric media consist of loss and gain units. The analytical study of acoustic PT-symmetric media shows that these media can be designed to achieve unidirectional transparency at specific frequencies named exceptional points (EPs). This unidirectional transparency occurs at the EPs is due to the asymmetrical arrangement of the periodic loss and gain units that results in different Bragg scatterings on the two sides of the PT-symmetric media. A close look at the phases of the reflections on both sides reveals a sudden jump of the reflection phase on one side at the EPs. This step-function like behavior causes an infinite delay time of the reflected wave on that side, and hence the media become reflectionless in that direction. Combining the concept of acoustic PT-symmetry with transformation acoustics, we design a two-dimensional acoustic cloak that is invisible in a prescribed direction. This kind of directional cloak is important especially for military use since a target object is hidden from the enemy in front can still be identified by friendly at the back. Other useful applications such as directional acoustic imaging,\nnoise cancellation,\narchitectural acoustics, acoustic amplification, etc., can also be developed.","authors":["Xuefeng Zhu","Hamidreza Ramezani","Chengzhi Shi","Jie Zhu"],"meta":["September 2014Physical Review X 4(3):031042","DOI:10.1103/PhysRevX.4.031042"],"references":["262451086_Parity-time-symmetric_whispering-gallery_microcavities","261766141_Local_P_T_Symmetry_Violates_the_No-Signaling_Principle","259989778_Sound_Isolation_and_Giant_Linear_Nonreciprocity_in_a_Compact_Acoustic_Circulator","258807344_Wave_propagation_control_at_the_deep_subwavelength_scale_in_metamaterials","262950266_Nonlinear_optics_Asymmetry_from_symmetry","261915107_Resonant_Acoustic_Propagation_and_Negative_Density_in_Liquid_Foams","260393960_Non-reciprocal_and_highly_nonlinear_active_acoustic_metamaterials","260153512_Demonstration_of_a_large-scale_optical_exceptional_point_structure","259404753_Acoustic_Metamaterials","258540259_A_holey-structured_metamaterial_for_acoustic_deep-subwavelength_imaging"]}