{"id":"265473206_Supervised_Multi-View_Canonical_Correlation_Analysis_sMVCCA_Integrating_Histologic_and_Proteomic_Features_for_Predicting_Recurrent_Prostate_Cancer","abstract":"In this work, we present a new methodology to facilitate prediction of recurrent prostate cancer (CaP) following radical prostatectomy (RP) via the integration of quantitative image features and protein expression in the excised prostate. Creating a fused predictor from high-dimensional data streams is challenging because the classifier must 1) account for the “curse of dimensionality” problem, which hinders classifier performance when the number of features exceeds the number of patient studies and 2) balance potential mismatches in the number of features across different channels to avoid classifier bias towards channels with more features. Our new data integration methodology, supervised Multi-view Canonical Correlation Analysis (sMVCCA), aims to integrate infinite views of highdimensional data to provide more amenable data representations for disease classification. Additionally, we demonstrate sMVCCA using Spearman's rank correlation which, unlike Pearson's correlation, can account for nonlinear correlations and outliers. Forty CaP patients with pathological Gleason scores 6-8 were considered for this study. 21 of these men revealed biochemical recurrence (BCR) following RP, while 19 did not. For each patient, 189 quantitative histomorphometric attributes and 650 protein expression levels were extracted from the primary tumor nodule. The fused histomorphometric/proteomic representation via sMVCCA combined with a random forest classifier predicted BCR with a mean AUC of 0.74 and a maximum AUC of 0.9286. We found sMVCCA to perform statistically significantly (p <; 0.05) better than comparative state-of-the-art data fusion strategies for predicting BCR. Furthermore, Kaplan-Meier analysis demonstrated improved BCR-free survival prediction for the sMVCCA-fused classifier as compared to histology or proteomic features alone.","authors":["George Lee","Asha Singanamalli","Haibo Wang","Michael D Feldman"],"meta":["September 2014IEEE Transactions on Medical Imaging","DOI:10.1109/TMI.2014.2355175","SourcePubMed"],"references":["302341151_Textural_Features_for_Image_Classification","262787471_Co-Occurring_Gland_Angularity_in_Localized_Subgraphs_Predicting_Biochemical_Recurrence_in_Intermediate-Risk_Prostate_Cancer_Patients","329476185_Canonical_Correlation_Analysis_When_the_Data_are_Curves","323889982_Molecular_Diagnosis_Classification_Model_Selection_and_Performance_Evaluation","313346892_Canonical_correlation_analysis_An_overview_with_application_to_learning_methods","297015178_CANONICAL_ANALYSIS_OF_SEVERAL_SETS_OF_VARIABLES","293277290_Quantitative_grading_of_tissue_and_nuclei_in_prostate_cancer_for_prognosis_prediction","288906520_Random_forests","275841474_Probability_and_Stochastic_Processes","260432223_Variable_Importance_in_Nonlinear_Kernels_VINK_Classification_of_Digitized_Histopathology"]}