{"id":"265490820_Prime_numbers_and_computer_methods_for_factorization_Reprint_of_the_2nd_ed_1994","abstract":"From the original hard cover edition: In the modern age of almost universal computer usage, practically every individual in a technologically developed society has routine access to the most up-to-date cryptographic technology that exists, the so-called RSA public-key cryptosystem. A major component of this system is the factorization of large numbers into their primes. Thus an ancient number-theory concept now plays a crucial role in communication among millions of people who may have little or no knowledge of even elementary mathematics. Hans Riesel's highly successful first edition of this book has now been enlarged and updated with the goal of satisfying the needs of researchers, students, practitioners of cryptography, and non-scientific readers with a mathematical inclination. It includes important advances in computational prime number theory and in factorization as well as re-computed and enlarged tables, accompanied by new tables reflecting current research by both the author and his coworkers and by independent researchers. The book treats four fundamental problems: the number of primes below a given limit, the approximate number of primes, the recognition of primes and the factorization of large numbers. The author provides explicit algorithms and computer programs, and has attempted to discuss as many of the classically important results as possible, as well as the most recent discoveries. The programs include are written in PASCAL to allow readers to translate the programs into the language of their own computers. The independent structure of each chapter of the book makes it highly readable for a wide variety of mathematicians, students of applied number theory, and others interested in both study and research in number theory and cryptography. © Springer Science+Business Media, LLC 2012. All rights reserved.","authors":["Hans Riesel"],"meta":["January 2012","DOI:10.1007/978-0-8176-8298-9","ISBN: 978-0-8176-8297-2"],"references":["302363953_The_probability_that_a_random_probable_prime_is_composite"]}