{"id":"265579421_Getting_from_Research_to_Personas_Harnessing_the_Power_of_Data","abstract":"The usefulness of personas in defining and designing interactive products has become more widely accepted in the last few years, but a lack of published information has, unfortunately, left room for a lot of misconceptions about how personas are created, and about what information actually comprises a persona. Although space does not permit a full treatment of persona creation in this article, I hope to highlight a few essential points. Start with the right kind of research Personas are based primarily on ethnographic user data. Ethnographic techniques are valuable because they assume that an interview subject's attitudes and behaviors are so habitual as to be unconscious. Rather than asking users what they want, it is more effective to focus on what users do, what frustrates them, and what gives them satisfaction. By combining interviewing with direct observation—preferably in the actual usage context—you can get a lot of data very quickly. Observation also helps minimize dependence on users' self-reported behavior, which is often inaccurate. A dozen hour-long interviews are usually sufficient for defining a simple consumer product, though it can take several dozen for a complex enterprise application. You'll know you can stop interviewing when you can predict how each user will respond; this means patterns are beginning to emerge. If you have the time and budget, you can verify your findings with quantitative surveys or other techniques, but these cannot replace direct observation. Identify behavioral patterns from the data Once you finish interviewing, list all of the behavioral variables, i.e., ways in which interviewee behavior differed. Most variables can be represented as ranges with two ends. In an online shopping domain, for example, you might have variables such as frequency of shopping, degree of enjoyment, and price vs. service orientation. There may also be demographic variables that seem to affect behavior, such as age or technical skill. Be wary of focusing on demographics during persona creation, since behavioral variables will have far more impact on the design. Note that if you are doing an enterprise application, each role* will have its own set of behavioral and demographic variables. Although the number of variables will differ from project to project, it's typical to find 20 or so variables per role.","authors":["Kim Goodwin"],"meta":[],"references":[]}