{"id":"265516000_Reading_the_Leaves_A_Comparison_of_Leaf_Rank_and_Automated_Areole_Measurement_for_Quantifying_Aspects_of_Leaf_Venation","abstract":"The reticulate venation that is characteristic of a dicot leaf has excited interest from systematists for more than a century, and from physiological and developmental botanists for decades. The tools of digital image acquisition and computer image analysis, however, are only now approaching the sophistication needed to quantify aspects of the venation network found in real leaves quickly, easily, accurately, and reliably enough to produce biologically meaningful data. In this paper, we examine 120 leaves distributed across vascular plants (representing 118 genera and 80 families) using two approaches: a semiquantitative scoring system called \"leaf ranking,\" devised by the late Leo Hickey, and an automated image-analysis protocol. In the process of comparing these approaches, we review some methodological issues that arise in trying to quantify a vein network, and discuss the strengths and weaknesses of automatic data collection and human pattern recognition. We conclude that subjective leaf rank provides a relatively consistent, semiquantitative measure of areole size among other variables; that modal areole size is generally consistent across large sections of a leaf lamina; and that both approaches-semiquantitative, subjective scoring; and fully quantitative, automated measurement-have appropriate places in the study of leaf venation.","authors":["Walton A Green","Stefan A Little","Charles A Price","Scott L Wing"],"meta":["August 2014APPLICATIONS IN PLANT SCIENCES 2(8)","DOI:10.3732/apps.1400006","SourcePubMed"],"references":["322847741_PRINCIPLES_OF_FOLIAR_ORGANIZATION_SHOWN_BY_SUN-SHADE_LEAVES_FROM_TEN_SPECIES_OF_DECIDUOUS_DICOTYLEDONOUS_TREES","322844852_THE_BUNDLE_SHEATH_EXTENSION_IN_LEAVES_OF_DICOTYLEDONS","322838951_LEAF_ORGANIZATION_OF_SOME_WOODY_DICOTYLEDONS_FROM_NEW_ZEALAND","322822461_CLASSIFICATION_OF_THE_ARCHITECTURE_OF_DICOTYLEDONOUS_LEAVES","313008360_Stratigraphy_and_paleobotany_of_the_Golden_Valley_Formation_Early_Tertiary_of_the_Western_North_Dakota","291785891_Ecological_aspects_of_plant_morphology_Leaf_form_in_relation_to_environment","289991223_CELLULAR_PARAMETERS_OF_LEAF_MORPHOGENESIS_IN_MAIZE_AND_TOBACCO","285309457_Erosional_Development_of_Streams_and_Their_Drainage_Basins_Hydrophysical_Approach_to_Quantitative_Morphology","284790568_The_Spandrels_of_San_Marco_and_the_Panglossian_Paradigm_A_Critique_of_the_Adaptionist_Programme","284269420_Pollen_and_leaves_from_the_mid-Cretaceous_Potomac_Group_and_their_bearing_on_early_angiosperm_evolution"]}