{"id":"265565052_Behind_the_Scene_of_Side_Channel_Attacks","abstract":"Since the introduction of side channel attacks in the nineties, a large amount of work has been devoted to their effectiveness and efficiency improvements. On the one side, general results and conclusions are drawn in theoretical frameworks, but the latter ones are often set in a too ideal context to capture the full complexity of an attack performed in real conditions. On the other side, practical improvements are proposed for specific contexts but the big picture is often put aside, which makes them difficult to adapt to different contexts. This paper tries to bridge the gap between both worlds. We specifically investigate which kind of issues is faced by a security evaluator when performing a state of the art attack. This analysis leads us to focus on the very common situation where the exact time of the sensitive processing is drown in a large number of leakage points. In this context we propose new ideas to improve the effectiveness and/or efficiency of the three considered attacks. In the particular case of stochastic attacks, we show that the existing literature, essentially developed under the assumption that the exact sensitive time is known, cannot be directly applied when the latter assumption is relaxed. To deal with this issue, we propose an improvement which makes stochastic attack a real alternative to the classical correlation power analysis. Our study is illustrated by various attack experiments performed on several copies of three micro-controllers with different CMOS technologies (respectively 350, 130 and 90 nanometers).","authors":["Victor Lomné","Emmanuel Prouff","Thomas Roche"],"meta":["December 2013","DOI:10.1007/978-3-642-42033-7_26","Conference: International Conference on the Theory and Application of Cryptology and Information Security"],"references":["262203372_Improving_Side-Channel_Analysis_with_Optimal_Linear_Transforms","258727311_A_New_Second-Order_Side_Channel_Attack_Based_on_Linear_Regression","228997254_Principal_and_Independent_Component_Analysis_for_Crypto-systems_with_Hardware_Unmasked_Units","225651438_Template_Attacks_in_Principal_Subspaces","225414601_Univariate_side_channel_attacks_and_leakage_modeling","298122842_Using_second-order_power_analysis_to_attack_DPA_resistant_software","254023687_Revealing_side-channel_issues_of_complex_circuits_by_enhanced_leakage_models","250975898_Advanced_stochastic_methods_in_side_channel_analysis_on_block_ciphers_in_the_presence_of_masking","238738068_Improved_Template_Attacks","226226622_Lecture_Notes_in_Computer_Science"]}