{"id":"265536308_Examination_Phobia_among_Secondary_Level_Students","abstract":"The study was an effort to measure secondary school level students' views about fear of examination. The paper identifies problems and causes of examination phobia (fear of examination) among female students of secondary level. The data for the study was collected from students of secondary level through a questionnaire. The findings of the study reported that fear of examination affects the academic performance of the students in the examination and they could not perform according to their knowledge due to fear of examination as they forget the answers of some questions during examination due to nervousness and fear of examination. A significant number of students answered their mind go blank before start of examination and they could not depict their knowledge on paper due to limited time pressure allowed for paper. The study found out that fear of punishment from parents and fear of annoyance of teachers on poor performance in the examination, tough competition among class fellows for getting good grades, limited time pressure in attempting for examination questions, fear of repeating the same class and poor preparation of examination were the main causes of examination phobia. At the same time it was also identified that students were familiar with the importance of the examinations and they answered that examination provide them chance to depict their abilities of thinking and decision making. Students may be given frequent tests so that they may take examination as routine work. Healthy competitive environment among students, remedy teaching to low achievers, Parents' encouragement for children to better performance in the exams, introduction of internal semester examination system. Examination phobia on male and female students, differences among male and female students regarding examination phobia and the relationship of examination phobia and the achievement of the students may further be investigated.","authors":["Dr. Sufiana Khatoon Malik","Farhat Parveen"],"meta":[],"references":["49308647_Professional_school_psychology"]}