{"id":"265688207_The_Use_of_Sequential_Pattern_Mining_to_Predict_Next_Prescribed_Medications","abstract":"Background: \nTherapy for certain medical conditions occurs in a stepwise fashion, where one medication is recommended as initial therapy and other medications follow. Sequential pattern mining is a data mining technique used to identify patterns of ordered events.\n\nObjective: \nTo determine whether sequential pattern mining is effective for identifying temporal relationships between medications and accurately predicting the next medication likely to be prescribed for a patient.\n\nDesign: \nWe obtained claims data from Blue Cross Blue Shield of Texas for patients prescribed at least one diabetes medication between 2008 and 2011, and divided these into a training set (90% of patients) and test set (10% of patients). We applied the CSPADE algorithm to mine sequential patterns of diabetes medication prescriptions both at the drug class and generic drug level and ranked them by the support statistic. We then evaluated the accuracy of predictions made for which diabetes medication a patient was likely to be prescribed next.\n\nResults: \nWe identified 161,497 patients who had been prescribed at least one diabetes medication. We were able to mine stepwise patterns of pharmacological therapy that were consistent with guidelines. Within three attempts, we were able to predict the medication prescribed for 90.0% of patients when making predictions by drug class, and for 64.1% when making predictions at the generic drug level. These results were stable under 10-fold cross validation, ranging from 89.1%-90.5% at the drug class level and 63.5-64.9% at the generic drug level. Using 1 or 2 items in the patient's medication history led to more accurate predictions than not using any history, but using the entire history was sometimes worse.\n\nConclusion: \nSequential pattern mining is an effective technique to identify temporal relationships between medications and can be used to predict next steps in a patient's medication regimen. Accurate predictions can be made without using the patient's entire medication history.","authors":["Aileen P. Wright","Adam T. Wright","Allison Beck McCoy","Dean Forrest Sittig"],"meta":["September 2014Journal of Biomedical Informatics 53","DOI:10.1016/j.jbi.2014.09.003"],"references":["315615850_Protein_Classification_using_Sequential_Pattern_Mining","267418486_Mining_short_sequential_patterns_for_hepatitis_type_detection","261412482_Discovering_sequential_patterns_in_a_UK_general_practice_database","236644192_Validation_of_an_Association_Rule_Mining-Based_Method_to_Infer_Associations_Between_Medications_and_Problems","228639856_A_delivery_framework_for_health_data_mining_and_analytics","319393506_Mining_Sequential_Patterns_Generalizations_and_Performance_Improvements","311847952_Medical_Management_of_Hyperglycemia_in_Type_2_Diabetes_A_Consensus_Algorithm_for_the_Initiation_and_Adjustment_of_Therapy_A_consensus_statement_of_the_American_Diabetes_Association_and_the_European_As","266814103_Cesarean_section_rate_variation_across_hospital_referral_regions_in_Texas_A_claims_analysis_of_privately_insured_population_from_2008-2011","259251669_Development_of_a_Clinician_Reputation_Metric_to_Identify_Appropriate_Problem-Medication_Pairs_in_a_Crowdsourced_Knowledge_Base","255693848_Mining_Information_Dependency_in_Outpatient_Encounters_for_Chronic_Disease_Care"]}