{"id":"265687615_Parallel_Distributed_Block_Coordinate_Descent_Methods_based_on_Pairwise_Comparison_Oracle","abstract":"This paper provides a block coordinate descent algorithm to solve\nunconstrained optimization problems. In our algorithm, computation of function\nvalues or gradients is not required. Instead, pairwise comparison of function\nvalues is used. Our algorithm consists of two steps; one is the direction\nestimate step and the other is the search step. Both steps require only\npairwise comparison of function values, which tells us only the order of\nfunction values over two points. In the direction estimate step, a Newton type\nsearch direction is estimated. A computation method like block coordinate\ndescent methods is used with the pairwise comparison. In the search step, a\nnumerical solution is updated along the estimated direction. The computation in\nthe direction estimate step can be easily parallelized, and thus, the algorithm\nworks efficiently to find the minimizer of the objective function. Also, we\nshow an upper bound of the convergence rate. In numerical experiments, we show\nthat our method efficiently finds the optimal solution compared to some\nexisting methods based on the pairwise comparison.","authors":["Kota Matsui","Wataru Kumagai","Takafumi Kanamori"],"meta":["September 2017Journal of Global Optimization 69(1)","DOI:10.1007/s10898-016-0465-x","SourcearXiv"],"references":["317083799_Linear_and_Nonlinear_Programming","263618093_Reducing_the_Number_of_Function_Evaluations_in_Mesh_Adaptive_Direct_Search_Algorithms","259288229_Relative_Upper_Confidence_Bound_for_the_K-Armed_Dueling_Bandit_Problem","321620119_Linear_and_Nonlinear_Programming","302970924_A_Simplex_Method_for_Function_Minimization","274015857_Team_RDCR_A_Language_And_Environment_For_Statistical_Computing_R_Foundation_for_Statistical_Computing_Vienna_Austria","267675410_Algorithmic_Connections_Between_Active_Learning_and_Stochastic_Convex_Optimization","267004513_Foundations_of_Machine_Learning","258727013_Query_Complexity_of_Derivative-Free_Optimization","258435933_Using_simplex_gradients_of_nonsmooth_functions_in_direct_search_methods"]}