{"id":"265687719_On_the_Optimality_of_Shape_and_Data_Representation_in_the_Spectral_Domain","abstract":"A proof of the optimality of the eigenfunctions of the Laplace-Beltrami\noperator (LBO) in representing smooth functions on surfaces is provided and\nadapted to the field of applied shape and data analysis. It is based on the\nCourant-Fischer min-max principle adapted to our case. % The theorem we present\nsupports the new trend in geometry processing of treating geometric structures\nby using their projection onto the leading eigenfunctions of the decomposition\nof the LBO. Utilisation of this result can be used for constructing numerically\nefficient algorithms to process shapes in their spectrum. We review a couple of\napplications as possible practical usage cases of the proposed optimality\ncriteria. % We refer to a scale invariant metric, which is also invariant to\nbending of the manifold. This novel pseudo-metric allows constructing an LBO by\nwhich a scale invariant eigenspace on the surface is defined. We demonstrate\nthe efficiency of an intermediate metric, defined as an interpolation between\nthe scale invariant and the regular one, in representing geometric structures\nwhile capturing both coarse and fine details. Next, we review a numerical\nacceleration technique for classical scaling, a member of a family of\nflattening methods known as multidimensional scaling (MDS). There, the\noptimality is exploited to efficiently approximate all geodesic distances\nbetween pairs of points on a given surface, and thereby match and compare\nbetween almost isometric surfaces. Finally, we revisit the classical principal\ncomponent analysis (PCA) definition by coupling its variational form with a\nDirichlet energy on the data manifold. By pairing the PCA with the LBO we can\nhandle cases that go beyond the scope defined by the observation set that is\nhandled by regular PCA.","authors":["Yonathan Aflalo","Haim Brezis","Ron Kimmel"],"meta":["September 2014SIAM Journal on Imaging Sciences 8(2)","DOI:10.1137/140977680","SourcearXiv"],"references":["258373774_Spectral_Generalized_Multi-Dimensional_Scaling","257599392_Spectral_multidimensional_scaling","314727241_Functional_maps_a_flexible_representation_of_maps_between_shapes","312210566_Principal_Component_Analysis","285891007_Efficient_algorithms_for_globally_optimal_trajectories","285087635_Fast_marching_methods_on_triangulated_domains","278181398_Graph-Laplacian_PCA_Closed-Form_Solution_and_Robustness","266859658_Scale_Invariant_Geometry_for_Nonrigid_Shapes","265424881_Variational_Methods_for_Eigenvalue_Approximation","262364394_Map-Based_Exploration_of_Intrinsic_Shape_Differences_and_Variability","254461830_Functional_Maps_A_Flexible_Representation_of_Maps_Between_Shapes","234814791_Fast_exact_and_approximate_geodesics_on_meshes","231513036_Coupled_quasi-harmonic_bases","231337922_Sparse_Modeling_of_Intrinsic_Correspondences","230221658_Modern_Multidimensional_Scaling_Theory_and_Applications"]}