{"id":"265685423_The_influence_of_technology_on_the_future_of_Human_Resource_Management","abstract":"In recent years, information technology has had a profound effect on human resources (HR) processes and practices. However, relatively little research has examined its effectiveness, and most of the existing studies have not assessed the degree to which these new systems enable organizations to reach their HR goals of attracting, motivating and retaining employees. One reason for this is that there are a number of limitations associated with current systems including the fact that they: (a) use one way communication systems, (b) are impersonal and passive, (c) do not always allow for interpersonal interaction, and (d) often create an artificial distance between individuals and organizations. Thus, the primary purposes of the present article are to review the current effects of technology on HR processes, consider the existing literature on the topic, and discuss the advantages and potential limitations of using these systems. In addition, we offer directions for future research and practice on using technology to facilitate HR processes.","authors":["Dianna L. Stone","Diana L. Deadrick","Kimberly M. Lukaszewski","Richard D. Johnson"],"meta":["June 2015Human Resource Management Review 25(2)","DOI:10.1016/j.hrmr.2015.01.002","Project: Research on Electronic Human Resource management (see https://diannastone.com)"],"references":["312973190_The_Impact_Of_Human_Resource_Management_Practices_On_Turnover_Productivity_And_Corporate_Financial_Performance","301148857_An_Evaluation_of_a_Training_Program","298128687_ASTD_2012_state_of_the_industry_report_Organizations_continue_to_invest_in_workplace_learning","294492455_Generational_differences_in_work_values_outcomes_and_person-organisation_values_fit","292390755_Understanding_e-learning_continuance_intention_An_extension_of_the_technology_acceptance_model","286012439_The_Social_Psychology_of_Organizations","285918283_Research-based_guidelines_for_designing_distance_learning_What_we_know_so_far","285261553_Recruitment_A_review_of_research_and_emerging_directions","284543195_eHR_Trends_in_delivery_methods","284439079_The_Social_Psychology_of_Organization"]}