{"id":"265635031_Transmission_Eigenvalues_in_Inverse_Scattering_Theory","abstract":"In the past few years transmission eigenvalues have become an important area of research in inverse scattering theory with active research being undertaken in many parts of the world. Transmission eigenvalues appear in the study of scattering by inhomogeneous media and are closely related to non-scattering waves. Such eigenvalues provide information about material properties of the scattering media and can be determined from scattering data. Hence they can play an important role in a variety of inverse problems in target identification and nondestructive testing. The transmission eigenvalue problem is a non-selfadjoint and nonlinear eigenvalue problem that is not covered by the standard theory of eigenvalue problems for elliptic operators. This article provides a comprehensive review of the state-of-the art theo-retical results on the transmission eigenvalue problem including a discussion on fundamental questions such as existence and discreteness of transmis-sion eigenvalues as well as Faber–Krahn type inequalities relating the first eigenvalue to material properties of inhomogeneous media. We begin our presentation by showing how the transmission eigenvalue problem appears in scattering theory and how transmission eigenvalues are determined from scattering data. Then we discuss the simple case of spherically stratified media where it is possible to obtain partial results on inverse spectral problems. In the case of more general inhomogeneous media we discuss the transmission eigenvalue problem for various types of media employing different mathemati-cal techniques. We conclude our presentation with a list of open problems that in our opinion merit investigation.","authors":["Fioralba Cakoni","Houssem Haddar"],"meta":["January 2012"],"references":["265242250_The_Linear_Sampling_Method_in_Inverse_Electromagnetic_Scattering","264965096_Nature_of_the_transmission_eigenvalue_spectrum_for_elastic_bodies","303521750_The_construction_of_solutions_to_acoustic_scattering_problems_in_a_spherically_stratified_medium_II","281262970_On_the_existence_of_transmission_eigenvalues","269000470_Interpolation_and_Approximation","266507481_Asymptotic_expansions_Translated_from_the_English_by_N_Ya_Vilenkin","266302274_Qualitative_Methods_in_Inverse_Scattering_Theory","265619897_Scattering_theory_Rev_ed","265586129_The_Factorization_Method_for_Inverse_Problems","264823397_On_the_interior_transmission_eigenvalue_problem"]}