{"id":"265647762_Decision_Support_Framework_for_Parkinson's_Disease_Based_on_Novel_Handwriting_Markers","abstract":"Parkinson's disease (PD) is a neurodegenerative disorder which impairs motor skills, speech, and other functions such as behavior, mood, and cognitive processes. One of the most typical clinical hallmarks of PD is handwriting deterioration, usually the first manifestation of PD. The aim of this study is twofold: (a) to find a subset of handwriting features suitable for identifying subjects with PD and (b) to build a predictive model to efficiently diagnose PD. We collected handwriting samples from 37 medicated PD patients and 38 age- and sex- matched controls. The handwriting samples were collected during seven tasks such as writing a syllable, word, or sentence. Every sample was used to extract the handwriting measures. In addition to conventional kinematic and spatio-temporal handwriting measures, we also computed novel handwriting measures based on entropy, signal energy, and empirical mode decomposition of the handwriting signals. The selected features were fed to the support vector machine classifier with radial Gaussian kernel for automated diagnosis. The accuracy of the classification of PD was as high as 88:13%, with the highest values of sensitivity and specificity equal to 89:47% and 91:89%, respectively. Handwriting may be a valuable marker as a diagnostic and screening tool.","authors":["Peter Drotar","Jiri Mekyska","Irena Rektorova","Lucia Masarova"],"meta":["September 2014IEEE transactions on neural systems and rehabilitation engineering: a publication of the IEEE Engineering in Medicine and Biology Society 23(3)","DOI:10.1109/TNSRE.2014.2359997"],"references":["261089727_A_new_modality_for_quantitative_evaluation_of_Parkinson's_disease_In-air_movement","260662600_Collection_and_Analysis_of_a_Parkinson_Speech_Dataset_With_Multiple_Types_of_Sound_Recordings","316991409_Mini-Mental_State_A_practical_method_for_grading_the_cognitive_state_of_patients_for_the_clinician","312609767_Mini-mental_state-practical_method_for_grading_cognitive_state_of_patients_for_clinicians","285111988_The_empirical_mode_decomposition_and_the_Hilbert_spectrum_for_nonlinear_and_non-stationary_time_series_analysis","277511172_The_accuracy_of_diagnosis_of_parkinsonian_syndromes_in_a_specialist_movement_disorder_service","274891554_Elements_of_Information_Theory_Wiley_New-York","259849180_Prediction_potential_of_different_handwriting_tasks_for_diagnosis_of_Parkinson's","239546749_Statistical_Learning_Theory","239075512_Handwriting_as_an_objective_tool_for_Parkinson's_disease_diagnosis"]}