{"id":"265797241_New_frameworks_for_studying_and_assessing_the_development_of_computational_thinking","abstract":"Mitchel Resnick (mres@media.mit.edu) MIT Media Lab Brennan, K., & Resnick, M. (2012). Using artifact-based interviews to study the development of computational thinking in interactive media design. Paper presented at annual American Educational Research Association meeting, Abstract Computational thinking is a phrase that has received considerable attention over the past several years – but there is little agreement about what computational thinking encompasses, and even less agreement about strategies for assessing the development of computational thinking in young people. We are interested in the ways that design-based learning activities – in particular, programming interactive media – support the development of computational thinking in young people. Over the past several years, we have developed a computational thinking framework that emerged from our studies of the activities of interactive media designers. Our context is Scratch – a programming environment that enables young people to create their own interactive stories, games, and simulations, and then share those creations in an online community with other young programmers from around the world. The first part of the paper describes the key dimensions of our computational thinking framework: computational concepts (the concepts designers engage with as they program, such as iteration, parallelism, etc.), computational practices (the practices designers develop as they engage with the concepts, such as debugging projects or remixing others' work), and computational perspectives (the perspectives designers form about the world around them and about themselves). The second part of the paper describes our evolving approach to assessing these dimensions, including project portfolio analysis, artifact-based interviews, and design scenarios. We end with a set of suggestions for assessing the learning that takes place when young people engage in programming.","authors":["Karen Brennan"],"meta":[],"references":["247924673_Bringing_computational_thinking_to_K-12_what_is_Involved_and_what_is_the_role_of_the_computer_science_education_community","220426817_Scratch_Programming_for_All","278694075_Imagining_Creating_Playing_Sharing_Reflecting_How_Online_Community_Supports_Young_People_as_Designers_of_Interactive_Media","277785401_More_than_code_The_significance_of_social_interactions_in_young_people's_development_as_interactive_media_creators","265092184_Constructionism_in_Practice_Designing_Thinking_and_Learning_in_a_Digital_World","227705777_Social_Cognitive_Theory_An_Agentic_Perspective","49761166_Making_projects_making_friends_Online_community_as_catalyst_for_interactive_media_creation","12181655_Social_Cognitive_Theory_An_Agentic_Perspective"]}