{"id":"265731903_Probabilistic_neural_network_training_procedure_based_on_Q0-learning_algorithm_in_medical_data_classification","abstract":"In this article, an iterative procedure is proposed for the training process of the probabilistic neural network (PNN). In each stage of this procedure, the Q(0)-learning algorithm is utilized for the adaptation of PNN smoothing parameter (σ). Four classes of PNN models are regarded in this study. In the case of the first, simplest model, the smoothing parameter takes the form of a scalar; for the second model, σ is a vector whose elements are computed with respect to the class index; the third considered model has the smoothing parameter vector for which all components are determined depending on each input attribute; finally, the last and the most complex of the analyzed networks, uses the matrix of smoothing parameters where each element is dependent on both class and input feature index. The main idea of the presented approach is based on the appropriate update of the smoothing parameter values according to the Q(0)-learning algorithm. The proposed procedure is verified on six repository data sets. The prediction ability of the algorithm is assessed by computing the test accuracy on 10 %, 20 %, 30 %, and 40 % of examples drawn randomly from each input data set. The results are compared with the test accuracy obtained by PNN trained using the conjugate gradient procedure, support vector machine algorithm, gene expression programming classifier, k–Means method, multilayer perceptron, radial basis function neural network and learning vector quantization neural network. It is shown that the presented procedure can be applied to the automatic adaptation of the smoothing parameter of each of the considered PNN models and that this is an alternative training method. PNN trained by the Q(0)-learning based approach constitutes a classifier which can be treated as one of the top models in data classification problems.","authors":["Maciej Kusy","Roman Zajdel"],"meta":["October 2014Applied Intelligence 41(3)","DOI:10.1007/s10489-014-0562-9","Project: Training algorithms for probabilistic neural network"],"references":["267203433_Qualitative_Autonomous_Navigation_System_Employing_Event_Driven-_Fuzzy_Cognitive_Maps_and_Fuzzy_Logic","264573572_Probabilistic_neural_networks_and_the_polynomial_Adaline_as_complementary_techniques_for_classification","310403387_A_K-means_clustering_algorithm","278397429_Stateless_Q-Learning_Algorithm_for_Training_of_Radial_Basis_Function_Based_Neural_Networks_in_Medical_Data_Classification","272825857_UCI_Machine_Learning_Repository","272161307_Reinforcement_Learning_An_Introduction","270034913_Book_Review_The_Nature_of_Statistical_Learning_Theory","262314640_Probabilistic_neural_networks_and_general_regression_neural_networks","257518441_Handwritten_characters_recognition_based_on_nature-inspired_computing_and_neuro-evolution","257518358_Learning_via_human_feedback_in_continuous_state_and_action_spaces"]}