{"id":"265746136_Chapter_6_Individual_Acceptance_of_Information_Technologies","abstract":"85 In today's increasingly global, digital, and networked economy, corporate spending and organizational dependence on information technology (IT) are mushrooming at unprecedented rates. In 1999, the IT budget of a single U.S. company, Federal Ex-press, has been reported to be $1.4 billion (King, 1999). When spending on informa-tion technologies by other firms is added to this figure and the scope is extended to firms across the globe, it is clear that IT represents a substantial investment for organizations of all varieties. This technology is being utilized to support diverse strategic and operational objectives ranging from enabling competitive strategy, as in the case of Amazon.com and Dell Computers, to performing routine operational tasks. In this context of ubiquitous and pervasive use of IT, it is not surprising that all knowledge workers in today's economy need to utilize IT as an integral compo-nent of accomplishing organizational work. Acquiring IT to support business needs is clearly a crucial prerequisite to ex-ploiting the potential of IT. Unfortunately acquiring appropriate IT is a necessary but not a sufficient condition for utilizing it effectively. 1 Organizations (i.e., leaders and managers) make primary adoption decisions, yet it is individuals within the firm who are the ultimate users and consumers of IT. Thus, it is evident that true busi-ness value from any information technology would derive only through appropriate use by its target user group. In other words, systems that are not utilized will not de-liver the returns anticipated by managers. Evidence suggests that individual users can exhibit a variety of different behaviors when confronted with a new information technology: They may completely reject it and engage in sabotage or active resis-tance, they may only partially utilize its functionality, or they may wholeheartedly embrace the technology and the opportunities it offers. Obviously, each behavior has some consequential outcomes—both negative and positive—for managers. What causes individuals to exhibit these different behaviors? How can man-agers design appropriate implementation tactics and interventions that will alle-viate problems associated with the rejection of information technologies? These and related questions have been the subject of considerable academic research over the past several decades. Their importance has been elevated because of the recognition that as technologies become more malleable and flexible, greater potential exists for users to discover new and innovative ways of exploiting them. Indeed, competitive advantage may accrue only through these nonimitable ways of utilizing technolo-gies that are discovered within the firm by its knowledge workers at the confluence of business and technical knowledge. Such discovery and \"learning,\" however, will occur only if the technology is accepted as an integral part of a work process and if users are appropriately motivated to expend effort in exploration. Thus, the problem of individual acceptance of information technology is a crucial one for those respon-sible for implementing technologies as well as those responsible for demonstrating the business value of an IT. The purpose of this chapter is to provide an overview of existing research in individual acceptance of information technologies. In particular, the chapter sum-marizes what we know about this phenomenon and points out areas in which future research is warranted.","authors":["Ritu Agarwal"],"meta":["January 2000Educational Technology Research and Development 40"],"references":[]}