{"id":"265887379_Content-Based_Navigation_Within_Virtual_Museums","abstract":"The ongoing evolution of the Internet has enabled web applications that use real time three-dimensional (3D) graphics and virtual environments. Moreover, in recent years, cultural technology has also flourished notably. Virtual museums represent one significant application that combines culture with modern technologies and the internet, requiring an interdisciplinary approach aiming both at dissemination and education. We present our approach to enhance virtual museums by incorporating content-based retrieval that refers to 3D objects. In this context, a virtual visitor is able to navigate within the museum, examine the exhibited artifacts and perform queries-by-example in order to locate the position of related artifacts. The retrieval mechanism responds to the visitor's queries by indicating similar artifacts, which are ranked according to their similarity scores. This way, the visitor is able to navigate within a virtual museum not only by means of a virtual walkthrough but also by means of the context.","authors":["Anestis Koutsoudis","Christina Makarona","George Pavlidis"],"meta":["May 2012Journal of Advanced Computer Science & Technology 1(2)","DOI:10.14419/jacst.v1i2.135"],"references":["314815516_Designing_a_virtual_museum_within_a_museum","253696824_A_3D_Digital_Library_System_Capture_Analysis_Query_and_Display","250178104_MOMI_A_DYNAMIC_AND_INTERNET-BASED_3D_VIRTUAL_MUSEUM_OF_MUSICAL_INSTRU-_MENTS","239743994_3D_Information_Visualisation_Identifying_and_Measuring_Success","319770652_3D_shape_descriptor_based_on_3D_Fourier_transform","314813657_Indexing_and_retrieval_of_3D_models_aided_by_active_learning","313490499_Digitisation_to_presentation-Building_virtual_museum_exhibitions","240435703_Qp_A_tool_for_generating_3D_models_of_ancient_Greek_pottery","237452941_Building_an_adaptive_museum_gallery_in_Second_Life","228649559_3D_Pottery_content-based_retrieval_based_on_pose_normalisation_and_segmentation"]}