{"id":"265845261_A_Semantic_Rule-based_Approach_Supported_by_Process_Mining_for_Personalised_Adaptive_Learning","abstract":"Currently, automated learning systems are widely used for educational and training purposes within various organisations including, schools, universities and further education centres. There has been a big gap between the extraction of useful patterns from data sources to knowledge, as it is crucial that data is made valid, novel, potentially useful and understandable. To meet the needs of intended users, there is requirement for learning systems to embody technologies that support learners in achieving their learning goals and this process don’t happen automatically. This paper propose a novel approach for automated learning that is capable of detecting changing trends in learning behaviours and abilities through the use of process mining techniques. The goal is to discover user interaction patterns within learning processes, and respond by making decisions based on adaptive rules centred on captured user profiles. The approach applies semantic annotation of activity logs within the learning process in order to discover patterns automatically by means of semantic reasoning. Therefore, our proposed approach is grounded on Semantic Modelling and Process Mining techniques. To this end, it is possible to apply effective reasoning methods to make inferences over a Learning Process Knowledge-Base that leads to automated discovery of learning patterns or behaviour.","authors":["Kingsley Okoye","Abdel-Rahman Tawil","Usman Naeem","Rabih Bashroush"],"meta":["December 2014Procedia Computer Science 37:203-210","DOI:10.1016/j.procs.2014.08.031","Project: Semantic-based Process Mining and Model Analysis"],"references":["263145609_Ontology-driven_disability-aware_e-learning_personalisation_with_ONTODAPS","261574304_Ontology-Based_E-Learning_Personalisation_For_Disabled_Students_in_Higher_Education","234841977_Automatic_Discovery_of_Data-Centric_and_Artifact-Centric_Processes","229125186_Lecture_Notes_in_Computer_Science","228938574_Activity_patterns_in_process-aware_information_systems_Basic_concepts_and_empirical_evidence","224261251_Conformance_Checking_Using_Cost-Based_Fitness_Analysis","303206384_Data_Mining_Concepts_and_Techniques","285724853_A_user-centric_adaptive_learning_system_for_e-learning_20","264822141_A_semantic_approach_to_the_discovery_of_workflow_activity_patterns_in_event_logs","229125325_Process_Mining_in_Flexible_Environments"]}