{"id":"265884701_La_formacion_docente_como_politica_publica_consideraciones_y_debates","abstract":"Resumen La formación docente, por su reconocida importancia social, reclama que este problema se encare y se resuelva de acuerdo con las condiciones que impone la adopción de una política pública. De-biera apoyarse, en consecuencia, sobre las teorías actuales acerca de cómo se han de formar mejores profesores. Sin embargo, el análisis de la cuestión re-vela que existe heterogeneidad teórica y una controversia no resuelta que se manifiesta en la diversidad de respues-tas políticas y académicas así como en las dificultades que se hallan en su implantación. Ambos aspectos deben ser superados, lo cual requiere, además, que las escuelas donde adquieran experien-cia práctica los futuros profesores, sean buenas escuelas. Palabras clave: Formación docente -Política pública -Conocimientos del profesor -Conocimiento teórico -Cono-cimiento práctico -Políticas de formación docente. Summary Due to its recognized social relevance, the problem of teacher education needs to be addressed according to the con-ditions imposed by the adoption of a public policy. Consequently, it should be supported by current theories about how to educate better teachers. How-ever, analysis of this matter reveals the existence of theoretical heterogeneity as well as an unsolved controversy. Such a controversy emerges from the diversity of political and academic answers and from the difficulties found in their implementa-tion. Both issues must be resolved, which requires, in addition, that the schools in which future teachers gain practical ex-perience, be actually good schools.","authors":["Alicia Camilloni"],"meta":[],"references":["345311740_Inside_Teaching_How_Classroom_Life_Undermines_Reform","261948438_An_introduction_to_the_policy_process_Theories_concepts_and_models_of_public_policy_making_Fourth_edition","242434041_Form_and_Substance_in_Inservice_Teacher_Education","237143784_Professional_Development_and_Teacher_Learning_Mapping_the_Terrain","234590951_Are_the_Effects_of_University_Teacher_Education_Washed_Out_by_School_Experience","288883979_Studying_teacher_education_The_report_of_the_AERA_panel_on_research_on_teacher_education","248527049_Teacher_knowledge_What_is_it_How_do_we_uncover_it_What_are_its_implications_for_schooling","231935276_Policy_Learning_And_Failure","229947167_Narrative_Reflection_in_the_Philosophy_of_Teaching_Genealogies_and_Portraits","49132302_Les_croyances_et_connaissances_des_enseignants_a_propos_de_l'acte_d'enseigner_Vers_un_cadre_d'analyse","44837475_Global_Perspectives_on_Teacher_Learning_improving_policy_and_practice"]}