{"id":"265895366_Detecting_Level-of-Detail_Inconsistencies_in_Volunteered_Geographic_Information_Data_Sets","abstract":"Whereas defining the level of detail (LoD) of authoritative data sets is possible, the opposite is true for volunteered geographic information (VGI), which is often characterized by heterogeneous LoDs. This heterogeneity is a curb for map-making, particularly when using traditional map derivation processes such as generalization. This paper proposes a method to infer the LoD of VGI features. Then, inconsistencies between features with different LoDs that get in the way of good map-making can be automatically identified. Some proposals are made to harmonize LoD heterogeneities. The inferring of LoDs is implemented, and results are presented on OpenStreetMap data. \nRésumé:\nIl est possible de définir le niveau de détail (NdD) des ensembles de données qui font autorité, mais le contraire est vrai dans le cas de l’information géographique fournie volontairement (IGV), souvent caractérisée par des NdD hétérogènes. Cette hétérogénéité nuit à la cartographie, particulièrement lorsqu’on utilise les processus traditionnels de dérivation cartographique comme la généralisation. Cette communication propose une méthode d’inférence du NdD à partir des caractéristiques IGV. Il est alors possible de déterminer automatiquement les incohérences entre les caractéristiques de différents NdD qui nuisent à une bonne cartographie. On présente des propositions pour harmoniser les hétérogénéités au niveau des NdD. Les NdD sont établis par inférence et les résultats sont présentés sur OpenStreetMap.","authors":["Guillaume Touya","Carmen Brando-Escobar"],"meta":["June 2013Cartographica The International Journal for Geographic Information and Geovisualization 48(2):134-143","DOI:10.3138/carto.48.2.1836"],"references":["266874378_Connecting_LinkedGeoData_and_Geonames_in_the_Spatial_Semantic_Web","254889446_State-of-the-art_of_automated_generalisation_in_commercial_software","232959960_Generalisation_symbol_specification_and_map_evaluation_Feedback_from_research_done_at_COGIT_laboratory_IGN_France","339914027_An_evaluation_of_the_impact_of_cartographic_generalisation_on_length_measurement_computed_from_linear_vector_databases","284263122_Multiple_Criteria_Decision_Analysis_State_of_the_Art_Surveys_chapter_Promethee_methods","275969191_Conflicts_in_Neogeography_Maps","264244128_Capitalisation_problem_in_research_Example_of_a_new_platform_for_generalisation_CartAGen","262895832_The_Annotation_Process_in_OpenStreetMap","254238114_The_CARTACOM_model_transforming_cartographic_features_into_communicating_agents_for_cartographic_generalisation","233703488_Evaluation_of_Analytical_Measures_of_Map_Legibility"]}