{"id":"265873340_Resiliencia_Definicion_caracteristicas_y_utilidad_del_concepto","abstract":"Resumen: La resiliencia, o capacidad de superar los eventos adversos, y ser capaz de tener un desa-rrollo exitoso a pesar de circunstancias muy adversas (muerte de los padres, guerras, graves trau-mas, etc.), ha cobrado un gran interés en los últimos años y poco a poco se va convirtiendo en un término muy popular. En este artículo se revisa la información que existe sobre la resiliencia clari-ficando aspectos centrales como son su definición, características, delimitarlo de otros conceptos relacionados (competencia, vulnerabilidad, locus de control y estilo atribucional, dureza, recupera-ción, factores de riesgo y protección, psicología positiva) y los tipos de investigación que se han hecho bajo este término (centrada en la variable o en la persona, como rasgo de personalidad o patrón conductual, como proceso o como resultado). Se concluye que a resiliencia es un término útil pero que precisa tanto una mayor clarificación conceptual como la realización de estudios para comprobar la utilidad del constructo a nivel explicativo, para la prevención y para el tratamiento de los distintos trastornos psicopatológicos. Abstract: Resilience, or the capacity to overeóme adverse events, and to be able to develop one-self successfully despite very adverse circumstances (parents' death, wars, serious traumas, etc.), has become a concept of great interest during the last years and is becoming a popular term. In this paper we review the existing information about resilience, and clarify some of its central aspects such as its definition, characteristics, diíTerentiation from other related concepts (com-petence, vulnerability, locus of control and attributional style, hardiness, recovery, risk and pro-tective factors, positive psychology), and the types of studies that have been carried out on this topic (centred in the variable or in the person, as a trait or a behavioural pattem, as the process or the result). We conclude that resilience is a useful term that needs, however, more conceptu-al clarification as well as further studies to verify the utility ofthe explanatory power ofthe con-struct as regards the prevention and treatment of diflferent psychopathological disorders.","authors":["Elisardo Becona"],"meta":["September 2006Revista de Psicopatología y Psicología Clínica 11(3)","DOI:10.5944/rppc.vol.11.num.3.2006.4024"],"references":["338110114_El_hombre_en_busca_de_sentido_nueva_traduccion","313473581_Resilience_as_cumulative_competence_promotion_and_stress_protection_Theory_and_intervention","312914629_Resilience_in_children's_adaptation_to_negative_life_events_and_stressed_environments","312910249_The_syndrome_of_the_psychologically_invulnerable_child","311938236_Resilience_in_development","303517121_Toward_an_Understanding_of_Resilience_A_Critical_Review_of_Definitions_and_Models","292315691_Stessful_life_events_personality_and_hwalth_An_inquiry_into_hardiness","292295380_Resilience_and_Vulnerability_Adaptation_in_the_Context_of_Childhood_Adversities","287648508_Ordinary_magic_Resilience_process_in_development","285677581_Resilience_and_development_Positive_life_adaptations","282845536_Rethinking_Resilience_A_Developmental_Process_Perspective","282783578_Research_on_Resilience_An_Integrative_Review","284480440_Risk_and_Protective_Factors_in_the_Development_of_Psychopathology","281124019_A_developmental_psychopathology_perspective_on_bipolar_disorder","275133697_Risk_and_Protection_Are_Both_Necessary_to_Understand_Diverse_Behavioral_Outcomes_in_Adolescence"]}