{"id":"265941546_IDENTIFICACAO_UMA_NOVA_FUNCAO_ARQUIVISTICA","abstract":"Professora Adjunta Programa de Pós-Graduação em Ciência da Informação – Universidade Federal Fluminense (UFF) – Brasil RESUMO Estudo dos processos de identificação arquivística, especialmente da identificação de documentos desenvolvidos nos parâmetros da tipologia documental. A identificação é uma tarefa de pesquisa de natureza intelectual, que versa sobre o documento de arquivo e o seu órgão produtor, fundamentando as análises para o planejamento do tratamento técnico documental. A pesquisa tem por objetivo lançar bases teóricas para caracterizar a identificação como função independente no âmbito da metodologia arquivística, sistematizando-a na perspectiva da tradição arquivística brasileira. Alia uma dimensão teórica a uma aplicada, apresentando os estudos de caso sobre a aplicabilidade da metodologia no contexto de gestão de documentos e de tratamento de massas acumuladas em arquivos. ABSTRACT This study presents the archival identification processes, especially about the identification of documents developed by documental typology parameters. The identification is a search procedure on the archival document and its producer entity that uses intelligence to search and records data with adequate instruments. This technique is developed in the beginning of the documental treatment to fundament the analysis related to the production, appraisal, classification and description of the document. The research aims to launch a theoretical basis for characterizing the identification as an independent function within the archival methodology, systematizing it in the perspective of the archival tradition in Brazil. Combines a theoretical dimension to an applied, presenting case studies on the applicability of the methodology in the context of document management and treatment of mass accumulated in archives.","authors":["Ana Célia Rodrigues"],"meta":[],"references":["27594774_Consideraciones_sobre_el_metodo_en_Archivistica","49506051_Metodologia_para_la_investigacion_y_valoracion_de_fondos_documentales","31749043_Los_archivos_entre_la_memoria_historica_y_la_sociedad_del_conocimiento_R_Alberch_Fugueras_prol_de_Michel_Duchein","28802213_Los_archiveros_y_sus_investigaciones","28115013_Nuestro_modelo_de_Analisis_Documental","27339441_Identificacion_y_valoracion_de_documentos_en_Espana_a_partir_de_1975"]}