{"id":"265915730_Proposal_for_a_Conceptual_Framework_for_Educators_to_Describe_and_Design_MOOCs","abstract":"Massive Open Online Courses (MOOCs) are a disruptive trend in education. Several initiatives have emerged during the last months to give support to MOOCs, and many educators have started offering courses as MOOCs in different areas and disciplines. However, designing a MOOC is not an easy task. Educators need to face not only pedagogical issues, but also other issues of logistical, technological and financial nature, as well as how these issues relate and constrain each other. Currently, little guidance is available for educators to address the design of MOOCs from scratch keeping a balance between all these issues. This paper proposes a conceptual framework for supporting educators in the description and design of MOOCs called the MOOC Canvas. The MOOC Canvas defines eleven interrelated issues that are addressed through a set of questions, offering a visual and understandable guidance for educators during the MOOC design process. As a practical usage example, this paper shows how the MOOC Canvas captures the description and design of a real 9-week MOOC. An analysis of the different elements of the course shed some light on the usage of the MOOC Canvas as a mechanism to address the description and design of MOOCs.","authors":["Carlos Alario-Hoyos","Mar Pérez-Sanagustín","Dave Cormier","Carlos Delgado-Kloos"],"meta":["March 2014JOURNAL OF UNIVERSAL COMPUTER SCIENCE 20(1):6-23","DOI:10.3217/jucs-020-01-0006"],"references":["313447046_Generating_CSCL_scripts_From_a_conceptual_model_of_pattern_languages_to_the_design_of_real_scripts","289735192_Diagrams_of_learning_flow_patterns'_solutions_as_visual_representations_of_refinable_IMS_learning_design_templates","272321102_Massive_Open_Online_Courses_Legal_and_Policy_Issues_for_Research_Libraries","268800194_Analysing_the_Impact_of_Built-In_and_External_Social_Tools_in_a_MOOC_on_Educational_Technologies","260583991_The_Apache_Software_Foundation_Brian_Behlendorf","303215801_Online_educational_delivery_models_a_descriptive_view","273238414_New_Classification_of_the_Protozoa","265994732_The_Role_of_Mediating_Artefacts_in_Learning_Design","262175205_In_the_year_of_disruptive_education","260584175_Teaching_the_World_Daphne_Koller_and_Coursera"]}