{"id":"265908711_The_Complexity_of_Approximating_complex-valued_Ising_and_Tutte_partition_functions","abstract":"We study the complexity of approximating the Ising and Tutte partition\nfunctions with complex parameters. Our results are motivated by the study of\nthe quantum complexity classes BQP and IQP. Recent results show how to encode\nquantum computations as partition functions. These results rely on interesting\nand deep results about quantum computation in order to obtain hardness results\nabout the difficulty of (classically) evaluating the partition functions. The\nmain motivation for this paper is to go the other way around. Partition\nfunctions are combinatorial in nature and classifying the difficulty of\napproximating these partition functions does not require a detailed\nunderstanding of quantum computation. Using combinatorial arguments, we give a\nfull classification of the complexity of multiplicatively approximating the\nnorm of the partition function for complex edge interactions. We also classify\nthe complexity of additively approximating the argument of the partition\nfunction (and of approximating the partition function according to a natural\ncomplex metric). Using our classifications, we then revisit the connections to\nquantum computation, drawing conclusions that are different from (and\nincomparable to) the results in the quantum complexity literature. We show that\nstrong simulation of IQP within any constant factor is #P-hard, even for the\nrestricted class of circuits studied by Bremner et al. We also show that\ncomputing the sign of the Tutte polynomial is #P-hard at a certain point\nrelated to the simulation of BQP. Finally, motivated by further BQP-hardness\nresults, we study the problem of approximating the norm of the Ising partition\nfunction in the presence of external fields. We give a complete dichotomy for\nthe case in which the parameters are roots of unity. Previous results were\nknown just for a few such points, and we strengthen these results from\nBQP-hardness to #P-hardness.","authors":["Leslie Ann Goldberg","Heng Guo"],"meta":["December 2017computational complexity 26(2063)","DOI:10.1007/s00037-017-0162-2","SourcearXiv"],"references":["262264271_A_quantum_algorithm_for_additive_approximation_of_Ising_partition_functions","258373513_Quantum_Commuting_Circuits_and_Complexity_of_Ising_Partition_Functions","346670950_Approximation_by_Algebraic_Numbers","344496607_The_multivariate_Tutte_polynomial_alias_Potts_model_for_graphs_and_matroids","280215305_The_Complexity_of_Computing_the_Sign_of_the_Tutte_Polynomial","278798661_Approximation_by_algebraic_numbers_-_Cambridge_Tracts_in_Mathematics_160","266984604_Approximation_by_algebraic_numbers","259090840_The_complexity_of_complex_weighted_Boolean_CSP","243780198_A_spanning_tree_expansion_of_the_Jones_polynomial","243685997_Temporally_unstructured_quantum_computation","242921899_Relative_Distance--An_Error_Measure_in_Round-Off_Error_Analysis","236936122_Classical_simulation_complexity_of_extended_Clifford_circuits","231831212_On_the_computational_complexity_of_the_Jones_and_Tutte_polynomials","230700601_Low_Depth_Quantum_Circuits_for_Ising_Models","222470866_NP_is_as_Easy_as_Detecting_Unique_Solutions"]}