{"id":"265928094_Bibliometrics_and_Research_Data_Management_Services_Emerging_Trends_in_Library_Support_for_Research","abstract":"Developments in network technologies, scholarly communication, and national policy are challenging academic libraries to find new ways to engage with research communities in the economic downturn. Librarians are responding with service innovations in areas such as bibliometrics and research data management. Previous surveys have investigated research data support within North America and other research services globally with small samples. An online multiple-choice questionnaire was used to survey bibliometric and data support activities of 140 libraries in Australia, New Zealand, Ireland, and the United Kingdom, including current and planned services, target audiences, service constraints, and staff training needs. A majority of respondents offered or planned bibliometrics training, citation reports, and impact calculations but with significant differences between countries. Current levels of engagement in data management were lower than for bibliometrics, but a majority anticipated future involvement, especially in technology assistance, data deposit, and policy development. Initiatives were aimed at multiple constituencies, with university administrators being important clients and partners for bibliometric services. Gaps in knowledge, skills, and confidence were significant constraints, with near-universal support for including bibliometrics and particularly data management in professional education and continuing development programs. The study also found that librarians need a multilayered understanding of the research environment.","authors":["Sheila Corrall","Mary Anne Kennan","Waseem Afzal"],"meta":["January 2013Library Trends 61(3):636-674","DOI:10.1353/lib.2013.0005"],"references":["335415308_70th_Meeting_of_the_Association_of_Research_Libraries","329451165_Practical_research_methods_for_librarians_and_information_professionals","326221791_Managing_Research_Data","322646387_Lib-Value_Measuring_Value_and_Return_on_Investment_of_Academic_Libraries","322607789_Joining_in_the_Enterprise_of_Response_in_the_Wake_of_the_NSF_Data_Management_Planning_Requirement","318774430_Exploring_research_data_hosting_at_the_HKUST_institutional_repository","313363642_Institutional_repositories_-_now_and_next","296757733_Libraries_in_the_converging_worlds_of_open_data_e-research_and_web_20","288926126_Escaping_the_Island_of_Lost_Faculty_Collaboration_as_a_Means_of_Visibility","287786352_Exploring_Publishing_Patterns_at_a_Large_Research_University_Implications_for_Library_Practice"]}