{"id":"265988144_A_Theory_of_Shape_Identification","abstract":"Recent years have seen dramatic progress in shape recognition algorithms applied to ever-growing image databases. They have been applied to image stitching, stereo vision, image mosaics, solid object recognition and video or web image retrieval. More fundamentally, the ability of humans and animals to detect and recognize shapes is one of the enigmas of perception. The book describes a complete method that starts from a query image and an image database and yields a list of the images in the database containing shapes present in the query image. A false alarm number is associated to each detection.Many experiments will show that familiar simple shapes or images can reliably be identified with false alarm numbers ranging from 10-5 to less than 10-300. Technically speaking, there are two main issues. The first is extracting invariant shape descriptors from digital images. Indeed, a shape can be seen from various angles and distances and in various lights. A shape can even be partially occluded by other shapes and still be identifiable. Because the extraction step is so crucial, three acknowledged shape descriptors, SIFT, MSER and LLD, are introduced. The second issue is deciding whether two shape descriptors are identifiable as the same shape or not.A perceptual principle, the Helmholtz principle, is the cornerstone of this decision. It asserts that two shapes can be identified if the probability, that their resemblance may be due to chance, is very small. Not only may this principle be useful in this identification step, but it is also used throughout the complete system that will be presented: from the extraction of shape descriptors in digital images to their grouping in whole shapes. These decisions rely on elementary stochastic geometry and compute a false alarm number. The lower this number, the more secure the identification. The description of the processes, the many experiments on digital images and the simple proofs of mathematical correctness are interlaced so as to make a reading accessible to various audiences, such as students, engineers, and researchers.","authors":["Frederic Cao","Jose-Luis Lisani","Jean-Michel Morel","Pablo Musé"],"meta":["January 2005","DOI:10.1007/978-3-540-68481-7","ISBN: 978-3-540-68480-0"],"references":["228796029_On_the_Theory_of_Planar_Shape","246843865_Model-based_recognition_by_geometric_hashing","238653555_Detection_of_unusual_events_in_intermittent_non-Gaussian_images_using_multiresolution_background_models","226919858_Reconstruction_of_two-dimensional_patterns_from_Fourier_descriptors","225778821_Application_of_the_Gestalt_principles_to_the_detection_of_good_continuations_and_corners_in_image_level_lines","224377936_Perceptual_Organization_and_Curve_Partitioning","223879439_Tracking_line_segments","222705551_Shape_matching_of_partially_occluded_curves_invariant_under_projective_transformation","222686673_Robust_normalization_of_silhouettes_for_recognition_applications","221991372_Scale-Space_from_a_Level_Lines_Tree","220660015_Quasi-Invariant_Parameterisations_and_Matching_of_Curves_in_Images","220146282_Extracting_Meaningful_Curves_From_Images","5602024_Dequantizing_Image_Orientation","221620551_Compositionality_MDL_Priors_and_Object_Recognition","221259770_N-tree_Disjoint-Set_Forests_for_Maximally_Stable_Extremal_Regions"]}