{"id":"265910150_Differing_contributions_of_inferior_prefrontal_and_anterior_temporal_cortex_to_concrete_and_abstract_conceptual_knowledge","abstract":"Semantic cognition is underpinned by regions involved in representing conceptual knowledge and executive control areas that provide regulation of this information according to current task requirements. Using distortion-corrected fMRI, we investigated the contributions of these two systems to abstract and concrete word comprehension. We contrasted semantic decisions made either with coherent contextual support, which encouraged retrieval of a rich conceptual representation, or with irrelevant contextual information, which instead maximised demands on control processes. Inferior prefrontal cortex was activated more when decisions were made in the presence of irrelevant context, suggesting that this region is crucial for the semantic control functions required to select appropriate aspects of meaning in the face of competing information. It also exhibited greater activation for abstract words, which reflects the fact that abstract words tend to have variable, context-dependent meanings that place higher demands on control processes. In contrast, anterior temporal regions were most active when decisions were made with the benefit of a coherent context, suggesting a representational role. There was a graded shift in concreteness effects in this region, with dorsolateral areas particularly active for abstract words and ventromedial areas preferentially activated by concrete words. This supports the idea that concrete concepts are closely associated with visual experience and abstract concepts with auditory-verbal information; and that sub-regions of the ATL display graded specialisation for these two types of knowledge. Between these two extremes, we identified significant activations for both word types in ventrolateral ATL. This area is known to be involved in representing knowledge for concrete concepts; here we established that it is also activated by abstract concepts. These results converge with data from rTMS and neuropsychological investigations in demonstrating that representational content and task demands influence recruitment of different areas in the semantic network.","authors":["Paul Hoffman","Richard J. Binney","Matthew A. Lambon Ralph"],"meta":["September 2014Cortex 63","DOI:10.1016/j.cortex.2014.09.001","Project: Lexical Semantics"],"references":["316510115_Structure_and_Deterioration_of_Semantic_Memory_A_Neuropsychological_and_Computational_Investigation","316238789_Non-verbal_semantic_impairment_in_semantic_dementia","262150059_Clustering_Hierarchical_Organization_and_the_Topography_of_Abstract_and_Concrete_Nouns","260150194_The_anterior_temporal_lobes_support_residual_comprehension_in_Wernicke's_aphasia","316737944_Declarative_memory_impairments_in_Alzheimer's_disease_and_semantic_dementia","312703942_The_brain's_default_network_Anatomy_function_and_relevance_to_disease","284235827_Semantic_unification","280863383_Deep_Dyslexia_A_Case_Study_of_Connectionist_Neuropsychology","277549294_Identification_of_a_pathway_for_intelligible_speech_in_the_left_temporal_lobe","261188774_A_comparison_of_dual_gradient-echo_and_spin-echo_fMRI_of_the_inferior_temporal_lobe"]}