{"id":"266017685_The_Structure_of_Scientific_Theories","abstract":"Scientific inquiry has led to immense explanatory and technological successes, partly as a result of the pervasiveness of scientific theories. Relativity theory, evolutionary theory, and plate tectonics were, and continue to be, wildly successful families of theories within physics, biology, and geology. Other powerful theory clusters inhabit comparatively recent disciplines such as cognitive science, climate science, molecular biology, microeconomics, and Geographic Information Science (GIS). Effective scientific theories magnify understanding, help supply legitimate explanations, and assist in formulating predictions. Moving from their knowledge-producing representational functions to their interventional roles (Hacking 1983), theories are integral to building technologies used within consumer, industrial, and scientific milieus.\n\nThis entry explores the structure of scientific theories from the perspective of the Syntactic, Semantic, and Pragmatic Views. Each of these answers questions such as the following in unique ways. What is the best characterization of the composition and function of scientific theory? How is theory linked with world? Which philosophical tools can and should be employed in describing and reconstructing scientific theory? Is an understanding of practice and application necessary for a comprehension of the core structure of a scientific theory? Finally, and most generally, how are these three views ultimately related?\n\nhttp://plato.stanford.edu/entries/structure-scientific-theories/","authors":["Rasmus Grønfeldt Winther"],"meta":["March 2015"],"references":["350651370_Styles_of_Reasoning_in_the_British_Life_Sciences","345863893_The_Myth_of_the_Framework_In_Defence_of_Science_and_Rationality","316807496_The_Structure_and_Dynamics_of_Theories","313765065_The_Role_of_Models_in_Science","313159598_Inference_of_Population_Structure_Using_Multilocus_Genotype_Data","312294046_The_Semantic_Tradition_from_Kant_to_Carnap_To_the_Vienna_Station","312247059_Thematic_Origins_of_Scientific_Thought_Kepler_to_Einstein","311720904_The_Structure_of_Scientific_Theories","306643411_PREFACE","300230893_Protocol_Statements"]}