{"id":"266086643_Context-aware_modeling_of_neuronal_morphologies","abstract":"Neuronal morphologies are pivotal for brain functioning: \nphysical overlap between dendrites and axons constrain the circuit topology, and the precise shape and composition of dendrites determine the integration of inputs to produce an output signal. At the same time, morphologies are highly diverse and variant. The variance, presumably, originates from neurons developing in a densely packed brain substrate where they interact (e.g., repulsion or attraction) with other actors in this substrate. However, when studying neurons their context is never part of the analysis and they are treated as if they existed in isolation. Here we argue that to fully understand neuronal morphology and its variance it is important to consider neurons in relation to each other and to other actors in the surrounding brain substrate, i.e., their context. We propose a context-aware computational framework, NeuroMaC, in which large numbers of neurons can be grown simultaneously according to growth rules expressed in terms of interactions between the developing neuron and the surrounding brain substrate. As a proof of principle, we demonstrate that by using NeuroMaC we can generate accurate virtual morphologies of distinct classes both in isolation and as part of neuronal forests. Accuracy is validated against population statistics of experimentally reconstructed morphologies. We show that context-aware generation of neurons can explain characteristics of variation. Indeed, plausible variation is an inherent property of the morphologies generated by context-aware rules. We speculate about the applicability of this framework to investigate morphologies and circuits, to classify healthy and pathological morphologies, and to generate large quantities of morphologies for large-scale modeling.","authors":["Benjamin Torben-Nielsen","Erik De Schutter"],"meta":["September 2014Frontiers in Neuroanatomy 8(92):92","DOI:10.3389/fnana.2014.00092","SourcePubMed"],"references":["259879423_Independently_Outgrowing_Neurons_and_Geometry-Based_Synapse_Formation_Produce_Networks_with_Realistic_Synaptic_Connectivity","257603618_Corrigendum_Impact_of_functional_MRI_data_preprocessing_pipeline_on_default-mode_network_detectability_in_patients_with_disorders_of_consciousness","256076745_Simulating_Cortical_Development_as_a_Self_Constructing_Process_A_Novel_Multi-Scale_Approach_Combining_Molecular_and_Physical_Aspects","235406559_Self-referential_forces_are_suffcient_to_explain_different_dendritic_morphologies","230880505_PNAS_plus_statistical_connectivity_provides_a_sufficient_foundation_for_specific_functional_connectivity_in_neocortical_neural_microcircuits","285966234_Diversity_in_the_Neuronal_Machine_Order_and_Variability_in_Interneuronal_Microcircuits","275648838_Subthreshold_Resonance_and_Membrane_Potential_Oscillations_in_a_Neuron_with_Nonuniform_Active_Dendritic_Properties","275210041_An_Approach_to_Capturing_Neuron_Morphological_Diversity","246933191_Neuronal_shape_parameters_and_substructures_as_a_basis_of_neuronal_form","226115595_The_projection_of_the_lateral_geniculate_nucleus_to_area_17_of_the_rat_cerebral_cortex_I_General_description"]}