{"id":"266097750_Fuzzy_Set_Conjoint_Model_in_Describing_Students'_Perceptions_on_Computer_Algebra_System_Learning_Environment","abstract":"There are many ways of analysing effectiveness of learning especially in computer learning environment. However, not much attention has been given to analyse it from fuzzy theory perspective. Due to the fuzziness in perception toward learning, this paper presents an application of fuzzy set conjoint model in analyzing students' perceptions on learning algebra and role of teacher in the presence of a computer algebra system (CAS). The study involves a survey which consists of eleven attributes in which six attributes were about learning algebra and another five attributes about role of teacher in a CAS learning environment. Data were collected from one hundred and sixty four students at a secondary school in Terengganu, Malaysia. Scores of perceptions were transformed into degree of similarity and level of agreement for attributes using fuzzy set conjoint model. It is found that attributes about learning indicate the highest degree of similarity at 0.77 with the level of 'disagree' while attributes about role of teacher measured at 0.81 degree of similarity with the level of 'strongly agree'. These measurements implicate the successful of fuzzy approach to evaluate perceptions toward learning algebra in CAS environment.","authors":["Lazim Abdullah","Abu Osman","Md Tap","Wan Salihin"],"meta":["March 2011International Journal of Computer Science Issues 8(2)"],"references":["267067828_Fuzzy_Set_Theory_-_and_Its_Applications","247536218_Situational_Influences_of_Acceptable_Wildland_Fire_Management_Actions","242483266_Fuzzy_Sets_in_the_Social_Sciences_An_Overview_of_Related_Researches","313553914_Conjoint_analysis_in_consumer_research_Issues_and_outlook","283249055_Measuring_teachers'_beliefs_about_mathematics_A_fuzzy_set_approach","268489703_Fuzzy_Logic_for_Beginners","265461287_Fuzzy_set_theory_-_and_its_applications_2nd_revised_ed","245770326_Conjoint_Analysis_in_Marketing_Research_New_Developments_and_Directions","237237549_Perceptions_of_Career_and_Technology_and_Training_and_Development_Students_regarding_basic_personal_computer_knowledge_and_skills","235356398_Commercial_Use_of_Conjoint_Analysis_An_Update"]}