{"id":"266206172_Structural_dynamics_at_the_berry_colour_locus_in_Vitis_vinifera_L_somatic_variants","abstract":"Background and AimsIn the grapevine, the coloured-berry phenotype depends on the allelic state of a major locus on chromosome 2. Several somatic variants for berry skin colour and their original varieties were genetically characterised at this locus and its surrounding genomic region.Methods and ResultsThe 38 accessions studied belong to 14 Vitis vinifera L. varieties (cépage), encompassing two groups: (A) consisting of less coloured/colourless variants deriving from a coloured wild type, and (B) including coloured variants from a non-coloured wild type. Based on a layer-specific approach, ten single sequence repeat markers, six single-nucleotide polymorphism regions and two sequenced characterised amplified region markers distributed along the distal arm of chromosome 2 were analysed. Within group A, deletions of different extent and position were detected, also in accessions of diverse origin; the deletions affected only the inner cell layer in the less coloured and both cell layers in the colourless variants. Within group B, the coloured variants could be distinguished mostly for a deletion causing the partial Gret1 retrotransposon excision from the VvMybA1 promoter. Moreover, within this latter group, an extensive homozygosity was detected along the distal arm of chromosome 2.Conclusions\nThis study allowed the discrimination of all somatic variants of group A and all but two of group B, and showed the occurrence of different mutation patterns both among and within grapevine varieties.Significance of the StudyThis study offers several molecular markers enabling the discrimination of a range of berry skin colour variants.","authors":["Daniele Migliaro","Manna Crespan","G. Muñoz-Organero","Riccardo Velasco"],"meta":["October 2014Australian Journal of Grape and Wine Research 20(3)","DOI:10.1111/ajgw.12103"],"references":["305470544_Essai_de_definition_du_cepage","281717902_Detection_of_polymorphism_in_ancient_Tempranillo_clones_Vitis_vinifera_L_using_microsatellite_and_retrotransposon_markers","277996318_Genetic_Divergence_and_Chimerism_within_Ancient_Asexually_Propagated_Winegrape_Cultivars","271132035_Origins_and_Consequences_of_Somatic_Variation_in_Grapevine","341816021_Historical_origins_and_genetic_diversity_of_wine_grapes","322831333_CYTOHISTOLOGICAL_STUDIES_OF_CYTOCHIMERIC_AND_TETRAPLOID_GRAPES","285494981_'Giant'_sports_of_grapes","280980699_Revising_how_the_computer_program_CERVUS_accommodates_genotyping_error_increases_success_in_paternity_assignment","279901914_Influence_of_pigment_composition_on_skin_color_in_a_wide_range_of_vegetables","268507717_Influence_of_Pigment_Composition_on_Skin_Color_in_a_Wide_Range_of_Fruit_and_Vegetables"]}