{"id":"266282081_Comparative_modeling_of_CO_2_laser_cutting_using_multiple_regression_analysis_and_artificial_neural_network","abstract":"In this paper, empirical modeling of surface roughness in CO 2 laser cutting of mild steel using the multiple regression analysis (MRA) and artificial neural network (ANN) was presented. To cover wider range of laser cutting parameters such as cutting speed, laser power and assist gas pressure as well as to obtain experimental database for MRA and ANN model development, Taguchi's L 25 orthogonal array was implemented for experimental plan. The average surface roughness was chosen as a measure of surface quality. The mathematical models of surface roughness developed by MRA and ANN were expressed as explicit nonlinear functions of the selected input parameters. The comparison between experimental results and models predictions showed that ANN model provided more accurate predictions when compared with the MRA model. The use of MRA for surface roughness prediction in CO 2 laser cutting was of limited applicability and reliability. Powerful modeling ability of the ANNs justified the use of the ANN models for accurate modeling of the complex processes with many non-linearities and interactions such as CO 2 laser cutting. Finally, based on the derived ANN equation, the effects of the laser cutting parameters on surface roughness were examined.","authors":["Miloš Madić","Miroslav Radovanović"],"meta":["April 2012International Journal of Physical Sciences 7(16)","DOI:10.5897/IJPS12.109"],"references":["267947002_Experimental_investigations_of_CO2_laser_cut_quality_A_review","233532686_Particle_swarm_optimization_prediction_model_for_surface_roughness","230737335_Particle_Swarm_Optimisation_Prediction_Model_for_Surface_Roughness","313421729_Introduction_to_Time_Series_Analysis_and_Forecasting","273210164_Surface_roughness_prediction_model_for_CNC_machining_of_polypropylene","257336149_Combining_the_Taguchi_method_with_artificial_neural_network_to_construct_a_prediction_model_of_a_CO2_laser_cutting_experiment","256079904_Introduction_to_Time_Series_Analysis_and_Forecasting","243310576_Laser_cutting_of_polymeric_materials_An_experimental_investigation","236145675_An_investigation_of_quality_in_CO2_laser_cutting_of_aluminum","228872638_Selection_and_validation_of_predictive_regression_and_neural_network_models_based_on_designed_experiments"]}