{"id":"266290878_Stylistic_Features_of_Scientific_English_A_Study_of_Scientific_Research_Articles","abstract":"This study intends to explore what stylistic features characterize scientific English and make it different from any other language used in any other discipline. What are certain areas of language that are used more frequently in science than in non-science oriented language texts? This paper deals with the linguistic features concerning the application of vocabulary, grammar, discourse and style used in scientific English. A comparative analysis of literary and scientific language has been undertaken to make the nature and discourse of scientific English clearer. It was found that scientific use of English is marked with accuracy, precision and objective interpretation of facts and findings whereas literary language is subjective interpretation of life. Literary language contains literary impulse and represents the artist's inner self and his spontaneous overflow of feeling whereas scientific language represents universal truth and verifiable research findings. Scientific research papers drawn from Medical and Natural sciences were analyzed and it was found that frequent occurrence of Passive Voice in Method Section of scientific research articles makes scientific research findings impersonal and universal. Scientists use Passive Voice most often in order to get rid of personal whims and fancies. Many other features of scientific English such as nominalization and 'interrogative gambit' which occur frequently as unique discourse features in scientific research journals have also been taken into account in this study.","authors":["Jameel Ahmad"],"meta":["February 2012English Language and Literature Studies 2(1)","DOI:10.5539/ells.v2n1p47","Project: English Language Teaching"],"references":["289348489_Scientific_discourse_and_contrastive_linguistics_Hedging","316368258_Words_in_Everyday_Life","315252889_How_to_Write_and_Publish_a_Scientific_Paper","312616245_On_the_language_of_physical_science","284319427_This_bread_I_break'_-_language_and_interpretation","275998717_English_for_Science_and_Technology_A_Discourse_Approach","264524444_Science_Research_Writing_for_Non-Native_Speakers_of_English","249713021_Pedagogy_Pathology_and_Ideology_The_Production_Transmission_and_Reproduction_of_Medical_Discourse","248530796_The_function_of_questions_in_different_medical_journal_genres","247453028_Scientific_English_A_Guide_for_Scientists_and_Other_Professionals"]}