{"id":"266200037_On_Bootstrapping_Sensori-Motor_Patterns_for_a_Constructivist_Learning_System_in_Continuous_Environments","abstract":"The theory of cognitive development from Jean Piaget (1923) is a constructivist perspective of learning that has substantially influenced cognitive science domain. Within AI, lots of works have tried to take inspiration from this paradigm since the beginning of the discipline. Indeed it seems that constructivism is a possible trail in order to overcome the limitations of classical techniques stemming from cognitivism or connectionism and create autonomous agents, fitted with strong adaptation ability within their environment, modelled on biological organisms. Potential applications concern intelligent agents in interaction with a complex environment, with objectives that cannot be predefined. Like robotics, Ambient Intelligence (AmI) is a rich and ambitious paradigm that represents a high complexity challenge for AI. In particular, as a part of constructivist theory, the agent has to build a representation of the world that relies on learning of sensori-motor patterns starting from his own experience only. This step is difficult to set up for systems in continuous environments, using raw data from sensors without a priori modelling. With the use of multi-agent systems, we investigate the development of new techniques in order to adapt constructivist approach of learning on actual cases. Therefore, we use ambient intelligence as a reference domain for the application of our approach.","authors":["Sébastien Mazac","Salima Hassas","Frédéric Armetta"],"meta":["August 2014","DOI:10.7551/978-0-262-32621-6-ch028","Conference: ALIFE 14 : the 14th International Conference on the Synthesis and Simulation of Living SystemsAt: New York City"],"references":["242405224_Constructivist_Learning_A_Neural_Implementation_of_the_Schema_Mechanism","236682141_Constructivist_Ambient_Intelligent_Agent_for_Smart_Environments","228850896_Learning_distinctions_and_rules_in_a_continuous_world_through_active_exploration","329645339_Made-Up_Minds_A_Constructivist_Approach_to_Artificial_Intelligence","304631690_The_Radical_Interactionism_Conceptual_Commitment","284462862_An_introduction_to_radical_constructivism","277416724_A_stroll_through_the_worlds_of_animals_and_men_A_picture_book_of_invisible_worlds","268801085_The_Construction_of_Reality_in_The_Child","239659878_Intelligence_without_representation_Artificial_Intelligence_47","226256668_Towards_a_Radical_Constructivist_Understanding_of_Science"]}