{"id":"26622041_Arabic_Text_Classification_using_K-NN_and_Naive_Bayes","abstract":"Problem statement: The ability to classify unlabeled vast amount of information available on the internet would lead to easier access for those doing research specific area. Text Classification (TC) topic is quite significant due to several information systems have to deal with various numbers of documents; therefore, there must be some techniques and tools that can be used to classify those documents to their categories. Key Nearest Neighbor (K-NN) and the Naïve Bayes algorithm both are TC techniques, which are used to classify documents in different languages. Most of the work in this area was carried out for the English text, on the other hand very few researches have been carried out for the Arabic text. Approach: In this study we have implemented the K-NN and Naïve Bayes algorithm in order to make a practical comparison between them and previous studies. The algorithms are considered as some of the most famous algorithms in the field of text classification. Result: Conducted experiments with Arabic text showed that the K-NN classifier had better performance than the Naïve Bayesian classifier and the current implementation for both classifiers had yielded competitive results when compared to other implementations by other researchers. Conclusions/Recommendations: we have also extract feature set of keywords in order to improve the performance, the result illustrates that 2 algorithms can be applied to Arabic text, a sufficient numberof examples for each category, the selection of the feature space, the training data set used an the value of K can enormously affect the accuracy of classification.","authors":["Mohammed J. Bawaneh","Mahmud Alkoffash","Adnan Alrabea"],"meta":["July 2008Journal of Computer Science 4(7)","DOI:10.3844/jcssp.2008.600.605"],"references":["224952248_Machine_Learning_in_Automated_Text_Categorization","224297749_Improve_text_classification_accuracy_based_on_classifier_fusion_methods","221346527_A_MFoM_Learning_Approach_to_Robust_Multiclass_Multi-Label_Text_Categorization","312457588_Improve_text_classification_accuracy_based_on_classifier_fusion_methods","310606656_Classification_and_regression_trees","301222420_Relevance_weighting_of_search_terms","292773345_A_multistrategy_approach_for_digital_text_categorization_from_imbalanced_documents","244953961_A_comparison_of_two_learning_algorithms_for_text_classification","240310918_Classification_and_Regression_Trees_CART","221510034_AIRX_-_A_rule-based_multistage_indexing_system_for_Iarge_subject_fields"]}