{"id":"266242097_NETEDU_-_UM_AMBIENTE_COMPUTACIONAL_PARA_O_MAPEAMENTO_DO_CONHECIMENTO_DO_ESTUDANTE","abstract":"O mapeamento do nível de conhecimentos de um estu-dante ou de um grupo de estudantes é uma tarefa pra-ticamente impossível para os professores. As medidas de conhecimento predominantes no sistema educacio-nal se baseiam em médias e conseguem apenas desta-car aqueles estudantes que estão bem acima ou bem abaixo da média. Além disso, as medidas de autoco-nhecimento raramente são utilizadas. Desconhecer o nível atual de conhecimentos de um estudante em con-ceitos específicos impede que a aprendizagem seja sig-nificativa, pois não é possível identificar se o estudante possui os pré-requisitos para aprender um novo con-ceito. Este artigo tem por objetivo apresentar a arqui-tetura e as funcionalidades do NetEdu, um ambiente de avaliação formativa que possibilitará o mapeamento cognitivo e metacognitivo da aprendizagem. As infor-mações fornecidas pelo ambiente poderão auxiliar o professor e o aluno no acompanhamento e no trata-mento das lacunas de aprendizagem. Palavras-chave: avaliação formativa, metacognição, ambientes computacionais de avaliação. RESUMO ABSTRACT The mapping knowledge level of a student or a group is a very difficult task for teachers. The predominant measures of knowledge in Educational System are based on averages and can only indicate those students who are so far above or below the average. Moreover, the measures of self-knowledge are rarely used. To be unaware of the current student's knowledge level in a specific subject make impossible a significant learning because it is not possible to identify if the student possess the necessary prerequisite to learn a new concept. This paper aims to present the architecture and functionalities of NetEdu, an environment of formative assessment that will provide cognitive and metacognitive learning mapping. The information provided for this environment will assist teacher and students in the accompaniment and treatment of the learning gaps.","authors":["André A B Chinen","Felipe Schirmer","Ricardo N Carrer","Rodrigo H C Santos"],"meta":[],"references":["278785356_Um_modelo_para_Avaliacao_e_Acompanhamento_Continuo_do_Nivel_de_Aquisicao_de_Conhecimentos_do_Aprendiz","244437488_A_Translation_Approach_to_Portable_Ontology_Specifications","239531755_Knowing_What_You_Know_and_What_You_Don't_Further_Research_on_Metacognitive_Knowledge","232599909_Metacognition_and_Cognitive_Monitoring_A_New_Area_of_Cognitive-Developmental_Inquiry"]}