{"id":"266347691_The_Avatar_as_a_Knowledge_Worker_How_Immersive_3D_Virtual_Environments_may_Foster_Knowledge_Acquisition","abstract":"The rapid development of virtual worlds has created new possibilities for supporting formal and informal knowledge acquisition and learning processes online. Consequently, greater immersion of \"knowledge workers\" in cooperation and communication tasks in social virtual worlds should be a more prominent topic in sociological and cognitive-psychological research designs. The relatively new social potential of virtual worlds can be examined using theoretical models that describe the use and assessment of virtual world technologies in contexts of knowledge acquisition and exchange. In this paper, three co-created scenarios will be described to help demonstrate how virtual worlds can be used to explore new forms of interaction in (virtual) social contexts. These scenarios and the results of the avatar-based ethnographic investigation during the process of co-creation and collaboration will be introduced and used to reflect on the 3D projects. Afterwards, two sets of criteria to evaluate 3D environments for learning and teaching will be presented. The paper ends with suggestions for further research concerning the effects of immersion during collaboration and education in virtual worlds and an outlook on other upcoming 3D projects.","authors":["Klaus Bredl","Amrei Groß","Julia Hünniger","Jane Müller"],"meta":["January 2012","Project: 3D-Technologien"],"references":["329056416_Immersion_in_virtuellen_Wissenswelten","228342521_Virtual_Humans_and_Persuasion_The_Effects_of_Agency_and_Behavioral_Realism","220580589_Avatars_People_and_Virtual_Worlds_Foundations_for_Research_in_Metaverses","200773296_Putting_a_Second_Life_Metaverse_skin_on_learning_management_systems","284419701_Defining_virtual_reality_Dimensions_determining_telepresence_Communication_in_the_Age_of_Virtual_Reality","281550395_Deep_learning_properties_of_good_digital_games_How_far_can_they_go","242583979_Communities_Of_Practice_Learning_Meaning_and_Identity","221518876_Information_spaces_-_Building_meeting_rooms_in_virtual_environments","220691178_Enterprise_20_-_Planung_Einfuhrung_und_erfolgreicher_Einsatz_von_Social_Software_in_Unternehmen_2_Aufl","220373735_3-D_Virtual_Worlds_in_Education_Applications_Benefits_Issues_and_Opportunities"]}