{"id":"266374849_Pourquoi_notre_semantique_naive_n'est_pas_formalisable_et_pourquoi_c'est_presque_sans_consequence_sur_l'ingenierie_ontologique","abstract":"Le projet de représenter la sémantique des termes et concepts humains à l'aide de langages formels ne date pas d'hier, mais il connait aujourd'hui un regain d'intérêt avec le développement des ontologies computationnelles. Fer de lance du Web sémantique, la principale ambition de ces systèmes de représentation est de permettre aux machines d'accéder au « sens » des données qu'elles manipulent. Les langages formels ont toujours eu leurs détracteurs et l'usage qui en est fait en ingénierie ontologique ne fait pas exception. Différents auteurs dénoncent le projet de soumettre notre sémantique naïve à des formalismes logiques, trop rigides et trop mécaniques pour en capter la mobilité et l'adaptabilité, et proposent de leur substituer des approches et modèles alternatifs, censés être plus proches des mécanismes de conceptualisation et de représentation « naturels » de l'humain. L'objet de cet article est de montrer que ces critiques sont pour la plupart infondées, et en tout cas hors sujet, en ce qu'elles présupposent la subordination des ontologies à une exigence épistémique (modéliser de manière fidèle un référent) plutôt qu'opérationnelle (fonctionner et rendre service). Elles perdent leur raison d'être dès lors que l'on considère que la fonction des ontologies n'est pas (i) de représenter de manière fidèle le mobilier et les structures constitutives de la réalité (réalisme) ou la manière dont l'esprit se représente cette réalité (conceptualisme), mais (ii) d'augmenter les capacités de catégorisation, d'accès à l'information et de manipulation de données et documents, et (iii) de normaliser les pratiques de catégorisation et d'encodage. Considérer les ontologies computationnelles dans la perspective de l'augmentation cognitive et de l'instrumentation des pratiques exige un nouveau cadre épistémologique pour leur conception. Nous en décrivons ici les principes de base et proposons de qualifier cette nouvelle approche d'instrumentaliste.","authors":["Gunnar Declerck","Jean Charlet"],"meta":["January 2014Intellectica Revue de l Association pour la Recherche Cognitive 61(Monnin & G. Declerck (éds), Dossier « Philosophie du Web et Ingénierie des Connaissances »):143-188","DOI:10.3406/intel.2014.1042"],"references":["297428382_Evaluating_ontological_decisions_with_ontoclean","279252452_Pourquoi_n'y_a-t-il_pas_d'experience_en_ingenierie_des_connaissances","332089429_Word_and_Object","328756079_La_physique_naive_un_essai_d'ontologie","320181783_Sauver_les_apparences_Essai_sur_la_notion_de_theorie_physique_de_Platon_a_Galilee","298417858_The_Extended_Mind","291588123_Revue_d'intelligence_artificielle_Foreword","289066388_Human_categorization","280847183_La_philosophie_du_langage","279187296_Philosophical_Investigations_PI"]}