{"id":"266375414_Using_a_Collaborative_Learning_Technique_as_a_Pedagogic_Intervention_for_the_Effective_Teaching_and_Learning_of_a_Programming_Course","abstract":"Educators are faced with ever increasing challenges when teaching programming. The increase in the number of operating systems brings with it challenges for programmers because of the change in programming paradigms, programming languages and software suites that are dependent on most recent developments in technology and more so operating systems. The issue for educators maybe to move away from teacher centred teaching and learning to student centred learning. Pair programming is a technique that offers educators an opportunity to further enhance student centred learning. This study conducted an empirical study of “pair programming” in the teaching and learning of an introductory programming course in computer science with input from educators and learners. The purpose was to determine how a collaborative learning technique can be used as a pedagogic intervention for effective teaching and learning of a programming course. The study attempted to determine the impact of collaborative pair programming on students and whether Information Technology educators can use pair programming as a teaching strategy. There was a pre-test for students to secure data on how students attempted programming tasks. Thereafter the pair-programming technique was implemented and a post-test was administered to determine the effectiveness of the intervention strategy. The research findings indicated that the educators and learners had a positive attitude towards the use of pair programming to support teaching and learning and learners were convinced that they would become better programmers in the future. \n\nDOI: 10.5901/mjss.2014.v5n20p1077","authors":["Desmond Govender","Prinavin Govender"],"meta":["September 2014Mediterranean Journal of Social Sciences 5(20)","DOI:10.5901/mjss.2014.v5n20p1077"],"references":["259269333_Views_of_the_Use_of_Self-directed_Metacognitive_Questioning_during_Pair_Programming_in_Economically_Deprived_Rural_Schools","258403990_Collaborative-Adversarial_Pair_Programming","260616969_History_of_Programming_Languages","255681559_Pair_programming_and_pair_trading_Effects_on_learning_and_motivation_in_a_CS2_course","242350998_Extreme_Programming_Explained_Embrace_Change","234831230_Experiences_with_pair_programming_at_a_small_college","234826597_Why_students_drop_out_CS1_course","234792743_The_school_subject_information_technology_A_South_African_perspective","234792482_PAIR_programming_as_a_model_of_collaborative_learning_a_review_of_the_research","233254425_A_study_of_attrition_and_the_use_of_student_learning_communities_in_the_computer_science_introductory_programming_sequence"]}