{"id":"266398023_Gamification_in_Theory_and_Action_A_Survey","abstract":"Gamification has drawn the attention of academics, practitioners and business professionals in domains as diverse as education, information studies, human-computer interaction, and health. As yet, the term remains mired in diverse meanings and contradictory uses, while the concept faces division on its academic worth, underdeveloped theoretical foundations, and a dearth of standardized guidelines for application. Despite widespread commentary on its merits and shortcomings, little empirical work has sought to validate gamification as a meaningful concept and provide evidence of its effectiveness as a tool for motivating and engaging users in non-entertainment contexts. Moreover, no work to date has surveyed gamification as a field of study from a human-computer studies perspective. In this paper, we present a systematic survey on the use of gamification in published theoretical reviews and research papers involving interactive systems and human participants. We outline current theoretical understandings of gamification and draw comparisons to related approaches, including alternate reality games (ARGs), games with a purpose (GWAPs), and gameful design. We present a multidisciplinary review of gamification in action, focusing on empirical findings related to purpose and context, design of systems, approaches and techniques, and user impact. Findings from the survey show that a standard conceptualization of gamification is emerging against a growing backdrop of empirical participants-based research. However, definitional subjectivity, diverse or unstated theoretical foundations, incongruities among empirical findings, and inadequate experimental design remain matters of concern. We discuss how gamification may to be more usefully presented as a subset of a larger effort to improve the user experience of interactive systems through gameful design. We end by suggesting points of departure for continued empirical investigations of gamified practice and its effects.","authors":["Katie Seaborn","Deborah Fels"],"meta":["February 2015International Journal of Human-Computer Studies 74:14-31","DOI:10.1016/j.ijhcs.2014.09.006","Project: Gamification in Theory and Action"],"references":["303018696_Gamification_Toward_a_definition","299860489_Gaming_for_Therapy_in_a_Healthcare_Smart_Ambient","318494438_Flow_the_psychology_of_optimal_experience","292313296_The_Oxford_Handbook_of_Human_Motivation","289963904_Intrinsic_and_extrinsic_motivations_Classic_definitions_and_new_directions","289963001_Intrinsic_and_Extrinsic_Motivations_Classic_Definition_and_New_Directions","289776933_Gamification_as_a_strategy_for_promoting_deeper_investigation_in_a_reverse_engineering_activity","289575768_Mobile_communication_gamification_and_ludification","285677413_Gamification_is_not_a_dirty_word","285106589_Self-determination_theory_and_the_facilitation_of_intrinsic_motivation_social_Schwartz_S_H_1977"]}