{"id":"266483471_Learning_from_Online_Video_Lectures","abstract":"Brecht@csus.edu; gomailroof@comcast.net Executive Summary This study empirically examines the instructional value of online video lectures – videos that a course's instructor prepares to supplement classroom or online-broadcast lectures. The study ex-amines data from a classroom course, where the videos have a slower, more step-by-step lecture style than the classroom lectures; student use of videos is voluntary, can be tailored by students to meet their learning and topic-review needs, and can occur when and where students learn most effectively. The study's specific objectives are to identify and measure types of learning benefits that video lectures provide, gauge students' acceptance and use of this form of computer-based instruction, and compare results from alternative video designs to determine if learning is differ-ently affected. The course is highly technical (financial accounting) and is required of all business school stu-dents as they enter the school. The university is middle-tier and located in a medium-sized metro-politan area. Students are highly varied in their academic abilities and motivation, and they often have substantial off-campus job responsibilities. Three video designs were tested, each with an alternative learning environment designed into the videos. Design 1 had a complete absence of attention to relief and change-of-pace elements. De-sign 2 included graphics/cartoons and sounds/music clips that were strongly presented to provide relief from study tedium. Design 3 used a greatly reduced number of graphics and sounds and subtly presented them so that they did not command viewer attention. Learning benefits are con-sistently best with design 2. Findings are based on analysis of survey data and grade distributions. They include comparisons of with-videos and no-videos sample data. The most significant findings are that video lectures are used by students for tutorial help, they improve initial learning, they reduce dropout rates, and they improve course grades. Although the study is for a classroom course with the videos provided online, it is expected that video lectures will have similar or greater use and value in an online course when live-instruction and discussion are limited. Findings indicate that a very large percentage of students who watch the videos use them as a helpful tutoring resource and receive several types of improved-learning benefits including improvement in topic understanding, better grades, and greater ease of learning. The weakest students are especially benefited, with significantly reduced course withdrawal rates. Use of video lectures occurs when alternative study resources with the same topic content are always available.","authors":["H David Brecht"],"meta":["January 2012Journal of Information Technology Education: Innovations in Practice 11(1)","DOI:10.28945/1712"],"references":["321215056_The_Use_of_Cartoons_as_a_Teaching_Tool_to_Enhance_Student_Learning_in_Economics_Education","268186094_Assessing_Web-Enhanced_Courses_and_Student_Learning_Outcomes","254429427_Assimilating_Online_Technologies_into_School_Culture","253772914_Nine_Ways_to_Reduce_Cognitive_Load_in_Multimedia_Learning","249794925_Using_Video_to_Record_Summary_Lectures_to_Aid_Students'_Revision","234638111_Supplemental_Instruction_in_Developmental_Mathematics","324320472_Nonparametric_Statistics_for_the_Behavioral_Sciences","283753648_The_Role_of_Supplemental_Instruction_in_the_First_Accounting_Course","254081480_Learning_in_High-Tech_and_Multimedia_Environments","243668632_Effective_Tutoring_Techniques_A_Comparison_of_Human_Tutors_and_Intelligent_Tutoring_Systems"]}