{"id":"266482885_Representation_et_activite_deux_concepts_etroitement_associes","abstract":"Les behavioristes voulaient se débarrasser du concept de représentation. Non seulement ils ont échoué, mais la représentation est aujourd'hui le concept le plus central de la psychologie. Concernant le développement des connaissances mathématiques chez l'enfant, la représentation n'est pas faite seulement de nombres, de figures, de dessins, de diagrammes, de tableaux, de graphes ou d'algèbres, mais aussi de formes intériorisées d'activité en situation. L'activité est davantage que la conduite : la conduite n'est que la partie visible de l'activité. Dans ces conditions, pour analyser les conduites mathématiques, il faut s'interroger sur l'activité de représentation sous-jacente. Le concept de schème est alors essentiel pour conduire cette interrogation. La plus grande part de nos connaissances consiste en compétences, et elles ne peuvent pas être mises en mots aisément. Ceci est vrai dans tous les domaines de connaissance, y compris les mathématiques ; et c'est encore plus vrai pour les enfants, qui ne sont guère capables d'exprimer les connaissances qu'ils utilisent dans l'action. Confrontés à des situations, les enfants peuvent saisir progressivement des entités relationnelles entre quantités et grandeurs, entre positions, figures et mouvements... Les relations partie-partie-tout, ou état transformation-état, les propriétés d'isomorphisme dans les problèmes de proportion ne peuvent être réduites à des structures numériques ; ni être considérées seulement comme des entités linguistiques ou symboliques. Ce sont des concepts et des théorèmes en acte. Le caractère implicite d'une grande partie de nos connaissances, ne signifie pas que les connaissances explicites ne sont pas opératoires. Mais on ne peut se satisfaire d'une théorie qui considérerait les mathématiques seulement comme un corps de connaissances explicites. Même si on est intéressé par la fonction du langage et des symboles dans le développement de la pensée, il est nécessaire d'identifier avec sûreté quelles propriétés du signifiant représentent quelles propriétés du signifié. Nous savons bien aujourd'hui que les mots signifient des choses différentes pour des individus différents, en particulier pour le professeur et les élèves pris individuellement. Vygotski a expliqué il y 70 ans que le « sens » donné aux mots est différent de leur « signification » conventionnelle. Ce problème ne peut être résolu que si on accepte l'idée que les schèmes contiennent des invariants opératoires : concepts et théorèmes en acte. C'est notre tâche que de les identifier, en même temps que les autres composantes des schèmes et de la représentation. Plusieurs exemples illustrent cette vision peu habituelle. Recherches en Education -n° 4 octobre 2007 -Géra rd Vergnaud 2 Peu de concepts sont utilisés avec autant de significations différentes, même dans le seul domaine de la psychologie. En outre c'est de la représentation que traitent de nombreux auteurs lorsqu'ils parlent de mémoire, de jugement, de langage ou de raisonnement. Je n'ai pas le loisir, dans cet article, de passer en revue ces différentes significations. Il y faudrait un ouvrage. Je me contenterai de définir trois d'entre elles, assez fréquemment adoptées, et que je trouve utiles à l'analyse ; puis j'en introduirai une quatrième, qui modifie sensiblement la compréhension des trois premières : Sens 1 -Le flux de la conscience. Sens 2 -Les signes et symboles, langagiers ou non, avec lesquels nous communiquons. Sens 3 -Les systèmes de concepts, explicites ou non, avec lesquels un sujet pense le réel, c'està-dire identifie les objets du monde, leurs propriétés, leurs relations et transformations. Sens 4 -La représentation comme ensemble de schèmes.","authors":["Gérard Vergnaud"],"meta":["October 2007","DOI:10.4000/ree.3889"],"references":[]}