{"id":"266482075_Evaluating_Student_Satisfaction_with_Blended_Learning_in_a_Gender-Segregated_Environment","abstract":"Blended learning combines multiple delivery media that are designed to complement each other and promote learning and application-learned behavior (Smith&Dillon, 1999). This article re-ports on a study conducted in the College of Information Technology to evaluate levels of stu-dent' satisfaction with blended learning. The particular blend of learning modalities used at the college combines an equal balance of traditional face-to-face and videoconference learning, com-plemented with the use of a learning management system (Moodle). Recently, discussions of blended learning have begun to examine the benefits derived from learn-ing situations characterized by face-to-face education and mixed modalities of instruction. Re-gardless of comparisons made by researchers and developers, those studying blended learning have agreed that student satisfaction is a baseline requirement for successful implementation. Student satisfaction is considered an important factor in measuring the quality of blended learn-ing. It results from a combination of factors. In this study a model is proposed by the aggregation of these factors into five groups: instructor, technology, class management, interaction, and in-struction. The purpose of this study is to develop and validate an instrument that can be used to measure perceived student satisfaction with blended learning and explore whether satisfaction differs according to gender. The results indicate that the Student Satisfaction Survey Forms (SSSF) used were a valid measure of student satisfaction. They also show that students were sat-isfied with all components, although the level of satisfaction varied according to gender.","authors":["Mahmoud abou naaj","Mirna Nachouki","Ahmed Ankit"],"meta":["January 2012Journal of Information Technology Education:Research 11(1)","DOI:10.28945/1692","Project: Blended Learning"],"references":["274704352_Students'_Perceptions_Towards_Blended_Learning_Environment_Using_the_OCC","344561498_Evaluation_and_Implementation_of_Distance_Learning_Technologies_Tools_and_Techniques","288296800_Models_of_asynchronous_computer_conferencing_for_collaborative_learning_in_large_college_classes","285881840_Foundations_of_Behavioral_Research","284041463_Key_factors_for_determining_student_satisfaction_in_online_courses","281358183_Achievement_Motivation_and_College_Satisfaction_in_Traditional_and_Nontraditional_Students","279641960_Technology_Is_The_Tool_Teaching_Is_The_Task_Student_Satisfaction_In_Distance_Learning","278244687_Perceptions_of_Blended_Learning_in_Saudi_Universities","277753519_Stories_Models_and_Examples_from_the_Upcoming_Handbook_of_Blended_Learning_Global_Perspectives_Local_Designs_Part_2","274858453_Does_College_Make_a_Difference_Long-Term_Changes_in_Activities_and_Attitudes"]}