{"id":"266466487_A_Cognitive_Approach_to_Teaching_English_for_Special_Purposes_ESP","abstract":"Cognitive science today makes it possible to combine independent studies under the auspices of one focal problem — the workings of the human mind in knowledge acquisition. Foreign language teaching draws heavily on linguistics, psychology, and philosophy. In this article we come up with a cognitive approach to teaching language for special purposes. The focus of our attention is on terms belonging to a specific domain (options). The acquisition of terminology in a foreign language presupposes knowledge of a non-linguistic conceptual structure (conceptual content) and means of verbalization (linguistic content). To expose the conceptual content of an individual term we employ the notion of qualia which allows us to study a term from four cognitive aspects. In order to give students a holistic picture of the domain in question we make use of cognitive modeling which means constructing an abstract \"infrastructure\" of the subject area and showing possible links among its elements. The objective of teaching is to help students create a \"personal construct\" — a personal model of knowledge — which enhances their information processing capacity and lays down the foundation of their future progress in advanced knowledge acquisition and comprehending and generating professional discourse.","authors":["Natalya Davidko"],"meta":["June 2011Studies About Languages","DOI:10.5755/j01.sal.0.18.414"],"references":["321602561_The_Psychology_of_Expertise_Cognitive_Research_and_Empirical_AI","319394956_The_Generative_Lexicon","318494453_Metaphors_We_Live_By","288013510_Personality_and_interpersonal_communication_Issues_and_directions","285907359_Toward_a_general_theory_of_expertise_Prospects_and_limits","285268822_Introduction_A_rough_guide_to_Cognitive_Linguistics","265012834_An_Essay_Concerning_Humane_Understanding","247407369_The_Educational_Theory_of_Immanuel_Kant","246829482_MIND-Introduction_to_Cognitive_Science","245684295_Cognitive_Models_and_Prototype_Theory"]}