{"id":"266410882_Clustering_for_Data_Mining_A_Data_Recovery_Approach","abstract":"One of the goals of the first edition of this book back in 2005 was to present a coherent theory for K-Means partitioning and Ward hierarchical clustering. This theory leads to effective data pre-processing options, clustering algorithms and interpretation aids, as well as to firm relations to other areas of data analysis. \n\nThe goal of this second edition is to consolidate, strengthen and extend this island of understanding in the light of recent developments. Here are examples of newly added material for each of the objectives:\nConsolidating:\n- Five equivalent formulations for K-Means criterion \n- Usage of split base vectors in hierarchical clustering\n- Similarities between the clustering data recovery models and singular/eigenvalue decompositions \nStrengthening:\n- Experimental evidence to support the PCA-like Anomalous Pattern clustering as a tool to initialize K-Means\n- Weighting variables with Minkowski metric three-step K-Means\n- Effective versions of least squares divisive clustering\nExtending:\n- Similarity and network clustering \n- Consensus clustering.\n\nThe structure of the book has been streamlined; the chapter on Mathematics of the data recovery approach has almost doubled in size, now concludes the book. Parts of the removed chapters are integrated within the new structure. The change has added a hundred pages and a couple of dozen examples to the text and, in fact, transformed it into a different species of a book. In the first edition, the book had a Russian doll structure, with a core and a couple of nested shells around. Now it is a linear structure presentation of the data recovery clustering.\n\nThis book offers advice regarding clustering goals and ways to achieve them to a student, an educated user, and application developer. This advice involves methods that are compatible with the data recovery framework and experimentally tested. Fortunately, this embraces most popular approaches including most recent ones. The emphasis on the data recovery framework sets this book apart from the other books on clustering that try to inform the reader of as many approaches as possible with no much regard for their properties.","authors":["Boris G Mirkin"],"meta":["April 2005","DOI:10.1201/9781420034912"],"references":[]}