{"id":"266592264_Professional_Training_in_Software_Engineering_A_Critical_Need_in_the_United_States_Formacion_Profesional_en_Ingenieria_de_Software_Una_Necesidad_Critica_en_los_Estados_Unidos","abstract":"The software is related to almost every aspect of daily life: manufacturing, banking, travel, communications, defense, medicine, research, government, education, entertainment, law ... Is an essential part of military systems and is used in all civilian sectors, including safety and mission critical. Moreover, the complexity of many of these systems has increased exponentially in recent decades and the software has become an essential component for all of them. Unfortunately, the \"systems of higher education\", in almost all countries have not kept pace with these changes. The current science and engineering programs, both undergraduate and graduate, they need to incorporate more training in Software Engineering. It is especially true in areas such as aerospace engineering, because these systems are highly dependent on computer, information, communications and software. This article presents an analysis of the current situation of the United States in what has to do with software engineering training that receive and require the aerospace engineers. RESUMEN El software se relaciona con casi todos los aspectos de la vida cotidiana: manufactura, banca, viajes, comunicaciones, defensa, medicina, investigación, gobierno, educación, entretenimiento, leyes,… Es una parte esencial de los sistemas militares y se utiliza en todos los sectores civiles, incluyendo a los de seguridad y los de misión crítica. Además, la complejidad de muchos de estos sistemas se ha incrementado exponencialmente en las últimas décadas y el software se ha convertido en un componente esencial para todos ellos. Por desgracia, los \"sistemas de educación superior\", en casi todos los países, no le han seguido el paso a estos cambios. Los actuales programas de ciencia e ingeniería, tanto de pregrado como de posgrado, necesitan incorporar más capacitación en Ingeniería de Software. Lo que es especialmente cierto en áreas como la Ingeniería Aeroespacial, porque estos sistemas dependen en gran medida de la computación, la información, las comunicaciones y el software. En este artículo se presenta un análisis a la situación actual de los Estados Unidos en lo que tiene que ver con la formación en Ingeniería de Software que reciben y requieren los ingenieros aeroespaciales. © 2012 IAI. All rights reserved. 1. INTRODUCCIÓN El software está en todas partes, desde los teléfonos celulares hasta los grandes sistemas militares y, de acuerdo con la National Academy of Science [1], el software no es más que un artículo de comercialización básico que, de hecho, incorpora en sí a la función productiva de la economía. El National Institute of Standards and Technology NIST estima que los errores del software le cuestan a la economía de los EE.UU. $59,5 billones al año y que las ventas de productos software representan $180 billones [2], pero la formación en Ingeniería de Software no recibe la atención que merece, a pesar de que es de vital importancia para su economía. Las cuestiones relacionadas con la Ingeniería de software como disciplina y los debates en los últimos años no son nuevos y se describen en [3-5].","authors":["Jennifer Waldrow"],"meta":[],"references":["290127395_Software_engineering_degree_programs","248736665_The_Software_Quality_Certification_Triangle","245439108_Computing_Information_and_Communication_The_Fifth_Pillar_of_Aerospace_Engineering","243503924_Facts_and_Fallacies_of_Software_Engineering","243500916_Software_runaways_monumental_software_disasters","228794109_The_Role_of_Software_in_Spacecraft_Accidents","220420167_Software_and_higher_education"]}