{"id":"266560500_Quantum_attacks_against_iterated_block_ciphers","abstract":"We study the amplification of security against quantum attacks provided by\niteration of block ciphers. In the classical case, the Meet-in-the-middle\nattack is a generic attack against those constructions. This attack reduces the\ntime required to break double iterations to only twice the time it takes to\nattack a single block cipher, given that the attacker has access to a large\namount of memory. More abstractly, it shows that security by composition does\nnot achieve exact multiplicative amplification. We present a quantized version\nof this attack based on an optimal quantum algorithm for the Element\nDistinctness problem. We then use the generalized adversary method to prove the\noptimality of the attack. An interesting corollary is that the time-space\ntradeoff for quantum attacks is very different from what classical attacks\nallow. This first result seems to indicate that composition resists better to\nquantum attacks than to classical ones because it prevents the quadratic\nspeedup achieved by quantizing an exhaustive search.\nWe investigate security amplification by composition further by examining the\ncase of four iterations. We quantize a recent technique called the dissection\nattack using the framework of quantum walks. Surprisingly, this leads to better\ngains over classical attacks than for double iterations, which seems to\nindicate that when the number of iterations grows, the resistance against\nquantum attacks decreases.","authors":["Marc Kaplan"],"meta":["October 2014","SourcearXiv"],"references":["224266341_Quantum_Query_Complexity_of_State_Conversion","220422285_On_the_Security_of_Multiple_Encryption","2199060_Search_via_Quantum_Walk","2191489_Quantum_Walk_Algorithm_for_Element_Distinctness","1961125_Security_amplification_by_composition_The_case_of_doubly-iterated_ideal_ciphers","266462498_Efficient_Dissection_of_Composite_Problems_with_Applications_to_Cryptanalysis_Knapsacks_and_Combinatorial_Search_Problems","260667071_A_Note_on_the_Quantum_Collision_and_Set_Equality_Problems","259764484_Adversary_Lower_Bound_for_Element_Distinctness_with_Small_Range","220980304_Quantum_Cryptanalysis_of_Hash_and_Claw-Free_Functions","220961277_Grover_vs_McEliece","220430763_Quantum_lower_bounds_for_the_collision_and_the_element_distinctness_problems","2957223_Special_Feature_Exhaustive_Cryptanalysis_of_the_NBS_Data_Encryption_Standard","1744887_Quantum_Walk_Based_Search_Algorithms"]}