{"id":"266567167_Alignathon_A_competitive_assessment_of_whole-genome_alignment_methods","abstract":"Multiple sequence alignments (MSAs) are a prerequisite for a wide variety of evolutionary analyses. Published assessments and benchmark datasets for protein and, to a lesser extent, global nucleotide MSAs are available, but less effort has been made to establish benchmarks in the more general problem of whole genome alignment (WGA). Using the same model as the successful Assemblathon competitions we organized a competitive evaluation in which teams submitted their alignments and then assessments were performed collectively after all the submissions were received. Three datasets were used; two were simulated and based on primate and mammalian phylogenies and one was comprised of 20 real fly genomes. In total 35 submissions were assessed, submitted by ten teams using 12 different alignment pipelines. We found agreement between independent simulation-based and statistical assessments indicating that there are substantial accuracy differences between contemporary alignment tools. We saw considerable difference in the alignment quality of differently annotated regions and found few tools aligned the duplications analysed. We found many tools worked well at shorter evolutionary distances, but fewer performed competitively at longer distances. We provide all datasets, submissions and assessment programs for further study and provide, as a resource for future benchmarking, a convenient repository of code and data for reproducing the simulation assessments.","authors":["Dent A Earl","Ngan K Nguyen","Glenn Hickey","Robert Harris"],"meta":["October 2014Genome Research 24(12)","DOI:10.1101/gr.174920.114","SourcePubMed"],"references":["308319762_ALF--a_simulation_framework_for_genome_evolution","261326414_TCS_A_New_Multiple_Sequence_Alignment_Reliability_Measure_to_Estimate_Alignment_Accuracy_and_Improve_Phylogenetic_Tree_Reconstruction","295010437_RepeatMasker_Open-30","295010341_RepeatModeler_Open-10","283075873_An_integrated_encyclopedia_of_DNA_elements_in_the_human_genome","270051543_28-way_vertebrate_alignment_and_conservation_track_in_the_UCSC_Genome_Browser","270051470_Analyses_of_deep_mammalian_sequence_alignments_and_constraint_predictions_for_1_of_the_human_genome","270051410_A_high-resolution_map_of_human_evolutionary_constraint_using_29_mammals","266664530_Ensembl_2012","263394353_Decoding_long_nanopore_sequencing_reads_of_natural_DNA"]}