{"id":"266531126_Leakage-Resilient_Symmetric_Cryptography_under_Empirically_Verifiable_Assumptions","abstract":"Leakage-resilient cryptography aims at formally proving the security of cryptographic implementations against large classes of side-channel adversaries. One important challenge for such an approach to be relevant is to adequately connect the formal models used in the proofs with the practice of side-channel attacks. It raises the fundamental problem of finding reasonable restrictions of the leakage functions that can be empirically verified by evaluation laboratories. In this paper, we first argue that the previous “bounded leakage” requirements used in leakage-resilient cryptography are hard to fulfill by hardware engineers. We then introduce a new, more realistic and empirically verifiable assumption of simulatable leakage, under which security proofs in the standard model can be obtained. We finally illustrate our claims by analyzing the physical security of an efficient pseudorandom generator (for which security could only be proven under a random oracle based assumption so far). These positive results come at the cost of (algorithm-level) specialization, as our new assumption is specifically defined for block ciphers. Nevertheless, since block ciphers are the main building block of many leakage-resilient cryptographic primitives, our results also open the way towards more realistic constructions and proofs for other pseudorandom objects.","authors":["François-Xavier Standaert","Olivier Pereira","Yu Yu"],"meta":["January 2013","DOI:10.1007/978-3-642-40041-4_19"],"references":["267188740_Security_Evaluations_Beyond_Computing_Power_How_to_Analyze_Side-Channel_Attacks_you_Cannot_Mount","262275606_Practical_Leakage-Resilient_Pseudorandom_Objects_with_Minimum_Public_Randomness","226079366_Leakage-Resilient_Public-Key_Cryptography_in_the_Bounded-Retrieval_Model","278703735_Information_Security_and_Cryptography","268073735_Fault_analysis_in_cryptography_Foreword_by_Dan_Boneh","265533007_Statistical_Tools_Flavor_Side-Channel_Collision_Attacks","265527793_Leakage-Resilient_ElGamal","262355884_Practical_Leakage-Resilient_Symmetric_Cryptography","228906420_Simultaneous_Hardcore_Bits_and_Cryptography_Against_Freezing_Attacks","226226622_Lecture_Notes_in_Computer_Science"]}