{"id":"266653559_The_social_turn_in_K-12_programming_Moving_from_computational_thinking_to_computational_participation","abstract":"In this conceptual paper, we argue that recent developments in K-12 programming education are suggestive of what can be called a \"social turn\", a shift in the field in which learning to code has shifted from being a predominantly individualistic and tool-oriented approach to now one that is decidedly sociologically and culturally grounded in the creation and sharing of digital media. We discuss in detail three dimensions of this social turn (1) from writing code to creating applications, (2) from composing \"from scratch\" to remixing the work of others, and (3) from designing tools to facilitating communities. These three shifts illustrate how the development of artifacts, tools, and communities of programming lead us to move from computational thinking to computational participation. We draw from examples of past and current research, both inside and outside of school, and situate these developments in the context of current discussions around computational thinking, which has become a driving force in revitalizing programming in K-12 curricula and altogether broadening participation in computing.","authors":["Yasmin B. Kafai","Quinn Burke"],"meta":["March 2013","DOI:10.1145/2445196.2445373"],"references":["288955934_The_classroom_as_living_laboratory_Design-based_research_for_understanding_comparing_and_evaluating_learning_science_through_design","274377900_Computational_Thinking","274309848_Computational_Thinking","270092019_Entering_the_Clubhouse","265797241_New_frameworks_for_studying_and_assessing_the_development_of_computational_thinking","265435403_Scratch_Programming_for_Everyone","318494168_Epistemological_Pluralism_Styles_and_Voices_within_the_Computer_Culture","317953505_Situated_learning_Legitimate_peripheral_participation","277374591_Lowering_the_barriers_to_programming","265092107_Confronting_the_Challenges_of_Participatory_Culture_-_Media_Education_for_the_21st_Century_Part_2"]}