{"id":"266653555_On_the_nature_of_fires_and_how_to_spark_them_when_you're_not_there","abstract":"Traditionally, computer science education research contributes new tools, techniques, and theories to improve institutionalized learning spaces e.g. classrooms. However, we take the position that the study and improvement of computer science learning spaces outside the classroom are just as important. We take a step toward illuminating the critical qualities of non-institutional computer science learning spaces by engaging in a grounded-theoretical examination of first-hand accounts of non-institutional learning. To further study the topic, we attempted to recreate (in the lab) a learning environment with many qualities that characterize non-institutional learning. To make this possible, we employed a modified version of CodeSpells -- a video game designed to teach Java programming in a way that engenders the sense of sustained, playful, creative exploration driven entirely by the learner. This study introduced 40 girls, ages 10 to 12, to programming for the first time. We use the results of both studies to develop a theoretical framework which we use to examine existing tools such as Scratch, Alice, and educational games in a new light.","authors":["Sarah Esper","Stephen R. Foster","William G. Griswold"],"meta":["March 2013","DOI:10.1145/2445196.2445290"],"references":["249909626_From_SuperGoo_to_Scratch_Exploring_creative_digital_media_production_in_informal_learning","234820368_The_Scratch_Programming_Language_and_Environment","228969093_Attitudes_about_computing_in_postsecondary_graduates","228405788_Alice_A_3-D_tool_for_introductory_programming_concepts","221537555_A_simple_framework_for_interactive_games_in_CS1","221537160_Programming_by_Choice_Urban_Youth_Learning_Programming_with_Scratch","220094594_The_Greenfoot_Programming_Environment","32231568_Literature_Review_in_Informal_Learning_with_Technology_Outside_School","262329810_Multi-agent_simulation_and_netLogo_in_the_introductory_computer_science_curriculum","245581479_Basics_Of_Qualitative_Research_Grounded_Theory_Procedures_And_Techniques","221537833_Exploring_studio-based_instructional_models_for_computing_education","221413570_Habitable_3D_Learning_Environments_for_Situated_Learning"]}