{"id":"266656378_Sampling_with_Removal_in_LP-type_Problems","abstract":"Random sampling is an important tool in optimization subject to finitely or infinitely many constraints. Here we are interested in obtaining solutions of low cost that violate only few constraints. Under convexity or similar favorable conditions, and assuming fixed dimension, one can indeed derive combinatorial bounds on the expected number (or probability mass) of constraints violated by the optimal solution subject to a (small) random sample of constraints. The cost of the sample solution, however, cannot be bounded combinatorially.\nSuppose that for a fixed integer k, we locally minimize the cost by removing k constraints from the sample. Can we still guarantee (good) bounds on the number or mass of violated constraints? This question was asked and partially answered in the framework of chance-constrained optimization [1].\nHere we study the question in the completely combinatorial setting of LP-type problems that allows a unified treatment of many different optimization problems. Given a nondegenerate LP-type problem of combinatorial dimension δ, we prove that sampling with removal of the best k constraints induces an LP-type problem of combinatorial dimension O(δk+1), and this bound is tight in the worst case. It follows that through this kind of removal, the expected number of violated constraints blows up by a factor of at most O(δk); for relevant sample sizes, however, a matching lower bound for the blowup factor is not implied. At the same time, our results show that further improvements require new tools that go beyond combinatorial dimension.","authors":["Bernd Gärtner"],"meta":["June 2014","DOI:10.1145/2582112.2582121"],"references":["257641481_Removing_degeneracy_may_require_unbounded_dimension_increase","228808252_The_Exact_Feasibility_of_Randomized_Solutions_of_Robust_Convex_Programs","226748092_On_geometric_optimization_with_few_violated_constraints","226714951_A_Subexponential_Bound_for_Linear_Programming","225611863_A_Sampling-and-Discarding_Approach_to_Chance-Constrained_Optimization_Feasibility_and_Optimality","225603704_A_Simple_Sampling_Lemma_Analysis_and_Applications_in_Geometric_Optimization","220995001_Linear_Programming_-_Randomization_and_Abstract_Frameworks","220994694_A_Combinatorial_Bound_for_Linear_Programming_and_Related_Problems","220983592_A_Subexponential_Bound_for_Linear_Programming","2784691_Las_Vegas_Algorithms_for_Linear_and_Integer_Programming_When_the_Dimension_is_Small","2655189_A_Bound_on_Local_Minima_of_Arrangements_that_implies_the_Upper_Bound_Theorem","2306484_Smallest_Enclosing_Disks_balls_and_Ellipsoids"]}