{"id":"266656637_Robust_set_reconciliation","abstract":"Set reconciliation is a fundamental problem in distributed databases, where two parties each holding a set of elements wish to find their difference, so as to establish data consistency. Efficient algorithms exist for this problem with communication cost proportional only to the difference of the two sets, as opposed to the cardinality of the sets themselves. However, all existing work on set reconciliation considers two elements to be the same only if they are exactly equal. We observe that, in many applications, the elements correspond to objects on which a distance function can be defined, e.g., points in the Euclidean space, and close points often actually represent the same object. During the reconciliation, the algorithm should only find the truly different elements in the two sets while tolerating small perturbations. In this paper, we propose the robust set reconciliation problem, and take a principled approach to address this issue via the earth mover's distance. We have developed a communication and time-efficient algorithm with provable guarantees on the quality of the reconciliation. This is then complemented with an essentially matching lower bound showing the optimality of the algorithm. Our experimental results on both synthetic and real data sets have demonstrated that our algorithm also performs very well in practice.","authors":["Di Chen","Christian Konrad","Ke Yi","Wei Yu"],"meta":["June 2014","DOI:10.1145/2588555.2610528"],"references":["261170589_Invertible_Bloom_Lookup_Tables","260325016_Set_Reconciliation_via_Counting_Bloom_Filters","239761519_A_near-linear_time_e-approximation_algorithm_for_geometric_bipartite_matching","274343404_Consistency_rationing_in_the_cloud","262208591_Rademacher-Sketch_A_Dimensionality-Reducing_Embedding_for_Sum-Product_Norms_with_an_Application_to_Earth-Mover_Distance","239059434_The_Hungarian_Method_for_the_Assignment_Problem","236344183_The_Hungarian_Method_for_the_Assignment_Problem","224127278_Efficient_Sketches_for_Earth-Mover_Distance_with_Applications","222466434_New_hash_functions_and_their_use_in_authentication_and_set_equality","221996415_The_Hungarian_Method_for_The_Assignment_Problem"]}