{"id":"266652852_Xbase_Implementing_Domain-Specific_Languages_for_Java","abstract":"Xtext is an open-source framework for implementing external, textual domain-specific languages (DSLs). So far, most DSLs implemented with Xtext and similar tools focus on structural aspects such as service specifications and entities. Because behavioral aspects are significantly more complicated to implement, they are often delegated to general-purpose programming languages. This approach introduces complex integration patterns and the DSL's high level of abstraction is compromised.\nWe present Xbase as part of Xtext, an expression language that can be reused via language inheritance in any DSL implementation based on Xtext. Xbase expressions provide both control structures and program expressions in a uniform way. Xbase is statically typed and tightly integrated with the Java type system. Languages extending Xbase inherit the syntax of a Java-like expression language as well as language infrastructure components, including a parser, an unparser, a linker, a compiler and an interpreter. Furthermore, the framework provides integration into the Eclipse IDE including debug and refactoring support.\nThe application of Xbase is presented by means of a domain model language which serves as a tutorial example and by the implementation of the programming language Xtend. Xtend is a functional and object-oriented general purpose language for the Java Virtual Machine (JVM). It is built on top of Xbase which is the reusable expression language that is the foundation of Xtend.","authors":["Sven Efftinge","Moritz Eysholdt","Jan Köhnlein","Sebastian Zarnekow"],"meta":["September 2012ACM SIGPLAN Notices 48(3)","DOI:10.1145/2371401.2371419"],"references":["242345539_Entwurf_einer_domanenspezifischen_Sprache_fur_elektronische_Stellwerke","228572379_Language_Modularization_and_Composition_with_Projectional_Language_Workbenches_illustrated_with_MPS","221323653_Einsatz_domanenspezifischer_Sprachen_zur_Migration_von_Datenbankanwendungen","321061618_DSLs_In_Action","314085065_How_to_Write_a_Financial_Contract","314083901_Describing_and_Interpreting_Music_in_Haskell","312944303_Language_Virtualization_for_Heterogeneous_Parallel_Computing","272294887_Why_Functional_Programming_Matters","235779841_Domain-Specific_Languages","234789169_Groovy_in_Action"]}