{"id":"266660532_Increasing_cellular_capacity_using_ISM_band_side-channels_a_first_study","abstract":"The rise of ISM band radios, notably for WiFi, with near-default inclusion in smartphones, has been phenomenal. The use of ISM band radios is largely controlled by end-users for data access, either directly connecting to a WiFi access point or wireless tethering. We study an additional use of ISM bands to manage interference in cellular bands, by creating ISM ``side-channels\" between mobile clients. Our objective is to increase the network capacity in cellular bands, when there is no opportunity of data offloading to WiFi. We first study the likelihood of finding a WiFi-free environment, specifically on highways, to establish an ISM side-channel between smartphones. The likelihood is found by experimentally studying the range of WiFi links between smartphones with our designed Android applications, combined with rush hour traffic data on highways; the result is that there is high probability of finding at least one smartphone within the ISM band range. Finally, we show that the proposed use of ISM side-channels can significantly reduce interference in a MIMO wireless system and increase the overall cellular network capacity, by flexibly accommodating both multiuser beam-forming and full-duplex operation.","authors":["Jingwen Bai","Chenxi Liu","Ashutosh Sabharwal"],"meta":["August 2014","DOI:10.1145/2627585.2627586","Project: Massive MIMO Full-duplex"],"references":["235432173_Passive_Self-Interference_Suppression_for_Full-Duplex_InfrastructureNodes","233967314_Distributed_Full-Duplex_via_Wireless_Side-Channels_Bounds_and_Protocols","232028220_Design_and_Characterization_of_a_Full-Duplex_Multiantenna_System_for_WiFi_Networks","224578697_Pilot_Contamination_Problem_in_Multi-Cell_TDD_Systems","261319966_Decode-and-cancel_for_interference_cancellation_in_a_three-node_full-duplex_network","254464299_Argos_practical_many-antenna_base_stations","224342812_Multi-User_MISO_Broadcast_Channel_with_User-Cooperating_Decoder","224059321_Experimental_Measurements_and_Modeling_for_Vehicle-to-Vehicle_Dedicated_Short_Range_Communication_DSRC_Wireless_Channels","3236249_On_the_Optimality_of_Multiantenna_Broadcast_Scheduling_Using_Zero-Forcing_Beamforming","3086096_MIMO_Broadcast_Channels_with_Finite_Rate_Feedback"]}