{"id":"266660319_Optimizing_Rules_Placement_in_OpenFlow_Networks_Trading_Routing_for_Better_Efficiency","abstract":"The idea behind Software Defined Networking (SDN) is to conceive the network as one programmable entity rather than a set of devices to manually configure, and OpenFlow meets this objective. In OpenFlow, a centralized programmable controller installs rules onto switches to implement policies. However, this flexibility comes at the expense of extra overhead as the number of rules might exceed the memory capacity of switches, which raises the question of how to place most profitable rules on board. Solutions proposed so far strictly impose paths to be followed inside the network. We advocate instead that we can trade routing requirements within the network to concentrate on where to forward traffic, not how to do it. As an illustration of the concept, we propose an optimization problem that gets the maximum amount of traffic delivered according to policies and the actual dimensioning of the network. The traffic that cannot be accommodated is forwarded to the controller that has the capacity to process it further. We also demonstrate that our approach permits a better utilization of scarce resources in the network.","authors":["Xuan-Nam Nguyen","Damien Saucez","Chadi Barakat","Thierry Turletti"],"meta":["August 2014","DOI:10.1145/2620728.2620753"],"references":["262213884_Optimizing_the_One_big_switch_abstraction_in_software-defined_networks","261860283_PAST_scalable_ethernet_for_data_centers","316857231_B4_experience_with_a_globally-deployed_software_defined_wan","284574072_Frenetic","279402289_NOX","278664988_DevoFlow","262364586_B4_Experience_with_a_Globally-Deployed_Software_Defined_WAN","262363523_DomainFlow_practical_flow_management_method_using_multiple_flow_tables_in_commodity_switches","261208325_SwitchReduce_Reducing_switch_state_and_controller_involvement_in_OpenFlow_networks","261084304_Palette_Distributing_Tables_in_Software-Defined_Networks"]}