{"id":"266652884_PScout_Analyzing_the_Android_permission_specification","abstract":"Modern smartphone operating systems (OSs) have been developed with a greater emphasis on security and protecting privacy. One of the mechanisms these systems use to protect users is a permission system, which requires developers to declare what sensitive resources their applications will use, has users agree with this request when they install the application and constrains the application to the requested resources during runtime. As these permission systems become more common, questions have risen about their design and implementation. In this paper, we perform an analysis of the permission system of the Android smartphone OS in an attempt to begin answering some of these questions. Because the documentation of Android's permission system is incomplete and because we wanted to be able to analyze several versions of Android, we developed PScout, a tool that extracts the permission specification from the Android OS source code using static analysis. PScout overcomes several challenges, such as scalability due to Android's 3.4 million line code base, accounting for permission enforcement across processes due to Android's use of IPC, and abstracting Android's diverse permission checking mechanisms into a single primitive for analysis.\nWe use PScout to analyze 4 versions of Android spanning version 2.2 up to the recently released Android 4.0. Our main findings are that while Android has over 75 permissions, there is little redundancy in the permission specification. However, if applications could be constrained to only use documented APIs, then about 22% of the non-system permissions are actually unnecessary. Finally, we find that a trade-off exists between enabling least-privilege security with fine-grained permissions and maintaining stability of the permission specification as the Android OS evolves.","authors":["Kathy Wain Yee Au","Yi Fan Zhou","Zhen Huang","David Lie"],"meta":["October 2012","DOI:10.1145/2382196.2382222","Project: Analyzing the Security of Android OS"],"references":["268182647_Curbing_Android_Permission_Creep","254007208_Short_paper_A_look_at_smartphone_permission_models","245022829_Crowdroid_Behavior-Based_Malware_Detection_System_for_Android","241770730_Automatically_Securing_Permission-Based_Software_by_Reducing_the_Attack_Surface_An_Application_to_Android","229033887_Using_static_analysis_for_automatic_assessment_and_mitigation_of_unwanted_and_malicious_activities_within_Android_applications","228960320_Permission_Re-Delegation_Attacks_and_Defenses","228728707_A_study_of_Android_application_security","221609963_These_aren't_the_droids_you're_looking_for_Retrofitting_android_to_protect_data_from_imperious_applications","221609608_Android_Permissions_Demystified","262312078_The_Effectiveness_of_Application_Permissions"]}