{"id":"266657039_Failure_rates_in_introductory_programming_revisited","abstract":"Whilst working on an upcoming meta-analysis that synthesized fifty years of research on predictors of programming performance, we made an interesting discovery. Despite several studies citing a motivation for research as the high failure rates of introductory programming courses, to date, the majority of available evidence on this phenomenon is at best anecdotal in nature, and only a single study by Bennedsen and Caspersen has attempted to determine a worldwide pass rate of introductory programming courses.\nIn this paper, we answer the call for further substantial evidence on the CS1 failure rate phenomenon, by performing a systematic review of introductory programming literature, and a statistical analysis on pass rate data extracted from relevant articles. Pass rates describing the outcomes of 161 CS1 courses that ran in 15 different countries, across 51 institutions were extracted and analysed. An almost identical mean worldwide pass rate of 67.7% was found. Moderator analysis revealed significant, but perhaps not substantial differences in pass rates based upon: grade level, country, and class size. However, pass rates were found not to have significantly differed over time, or based upon the programming language taught in the course. This paper serves as a motivation for researchers of introductory programming education, and provides much needed quantitative evidence on the potential difficulties and failure rates of this course.","authors":["Christopher Watson","Fred Li"],"meta":["June 2014","DOI:10.1145/2591708.2591749"],"references":["243464895_Increasing_student_commitment_in_introductory_programming_learning","228846667_Mental_models_consistency_and_programming_aptitude","220613236_Why_the_high_attrition_rate_for_computer_science_students_Some_thoughts_and_observations","220613179_Failure_rates_in_introductory_programming","220422564_Pair_programming_improves_student_retention_confidence_and_program_quality","262425643_No_tests_required_Comparing_traditional_and_dynamic_predictors_of_programming_success","262321546_BlueFix_Using_Crowd-Sourced_Feedback_to_Support_Programming_Students_in_Error_Diagnosis_and_Repair","261231902_Predicting_Performance_in_an_Introductory_Programming_Course_by_Logging_and_Analyzing_Student_Programming_Behavior","228465660_On_the_difficulty_of_learning_to_program","220886403_Learning_Programming_Languages_through_Corrective_Feedback_and_Concept_Visualisation","220807482_Comparison_of_OOP_first_and_OOP_later_first_results_regarding_the_role_of_comfort_level","220612681_Controversy_on_how_to_teach_CS_1_a_discussion_on_the_SIGCSE-members_mailing_list"]}