{"id":"266656687_Investigating_the_skill_gap_between_graduating_students_and_industry_expectations","abstract":"Graduating computer science and software engineering students do not always possess the necessary skills, abilities, or knowledge when beginning their careers in the software industry. The lack of these skills and abilities can limit the productivity of newly hired, recent graduates, or even prevent them from gaining employment. This paper presents the results of an empirical study where twenty-three managers and hiring personnel from various software companies in the United States and Europe were interviewed. Participants were asked about areas where recent graduates frequently struggled when beginning employment at their companies and which skill deficiencies might prevent a recent graduate from being hired. The results of this study indicate that recent graduates struggle with using configuration management systems (and other software tools), effectively communicating with co-workers and customers, producing unit tests for their code, and other skills or abilities. The results also indicate that a lack of project experience and problem solving abilities are the most commonly cited issues preventing students from gaining employment. This research is intended to assist educators in identifying areas where students may not measure up the expectations of industry companies and in improving the curriculum at their universities to better prepare them for their future careers.","authors":["Alex Radermacher","Gursimran Walia","Dean Knudson"],"meta":["May 2014","DOI:10.1145/2591062.2591159"],"references":["320655033_The_Skills_Gap_as_Observed_between_IS_Graduates_and_the_Systems_Development_Industry_A_South_African_Experience","302924724_Guidelines_for_performing_Systematic_Literature_Reviews_in_Software_Engineering","258968226_Procedures_for_Undertaking_Systematic_Reviews","258968007_Kitchenham_B_Guidelines_for_performing_Systematic_Literature_Reviews_in_software_engineering_EBSE_Technical_Report_EBSE-2007-01","236028959_Software_Engineering_and_Project_Management_in_CS_Projects_vs_'Real-world'_Projects_A_Case_Study","303875049_Tracking_and_proling_successful_it_graduates_An_exploratory_study","297481274_What_knowledge_is_important_to_a_software_professional","269034054_Software_engineering_2004","263344061_A_comparison_between_the_recommendations_of_computing_curriculum_1991_and_the_views_of_software_development_managers_in_Ireland","234825831_Post-Graduate_Assessment_of_CS_Students_Experience_and_Position_Paper"]}