{"id":"266718917_Typed_Tagless_Final_Interpreters","abstract":"The so-called ‘typed tagless final’ approach of [6] has collected and polished a number of techniques for representing typed higher-order languages in a typed metalanguage, along with type-preserving interpretation, compilation and partial evaluation. The approach is an alternative to the traditional, or ‘initial’ encoding of an object language as a (generalized) algebraic data type. Both approaches permit multiple interpretations of an expression, to evaluate it, pretty-print, etc. The final encoding represents all and only typed object terms without resorting to generalized algebraic data types, dependent or other fancy types. The final encoding lets us add new language forms and interpretations without breaking the existing terms and interpreters.\nThese lecture notes introduce the final approach slowly and in detail, highlighting extensibility, the solution to the expression problem, and the seemingly impossible pattern-matching. We develop the approach further, to type-safe cast, run-time-type representation, Dynamics, and type reconstruction. We finish with telling examples of type-directed partial evaluation and encodings of type-and-effect systems and linear lambda-calculus.","authors":["Oleg Kiselyov"],"meta":["January 2012","DOI:10.1007/978-3-642-32202-0_3"],"references":["246197131_A_Monadic_Multistage_Metalanguage","230876408_Finite_Automata_and_Their_Decision_Problems","266689236_Programming_methodology_A_collection_of_articles_by_members_of_IFIP_WG23","266481863_Theoretical_aspects_of_object-oriented_programming_Types_semantics_and_language_design","246048842_Eliminating_array_bounds_checks_through_dependent_types","238671211_User-Defined_Types_and_Procedural_Data_Structures_as_Complementary_Approaches_to_Data_Abstraction","234830547_Higher-order_abstract_syntax","234779198_A_Metalanguage_for_interactive_proof_in_LCF","226094857_Type-Directed_Partial_Evaluation","225108828_Syntax_for_Free_Representing_Syntax_with_Binding_Using_Parametricity"]}