{"id":"266871293_Matching_and_Alignment_What_Is_the_Cost_of_User_Post-Match_Effort","abstract":"Generating new knowledge from scientific databases, fusion-ing products information of business companies or computing an overlap between various data collections are a few examples of applications that require data integration. A crucial step during this integration process is the discovery of correspondences between the data sources, and the evaluation of their quality. For this purpose, a few measures such as pre-cision and recall have been designed. However, these measures do not evaluate user post-match effort, that matching approaches aim at re-ducing. Furthermore, the overall metric suffers from a major drawback. Thus, we present in this paper two measures to compute this user effort during the post-match phase, that takes into account both the correction of discovered correspondences and the manual search for missing ones. A set of experiments with three matching tools including a comparison with the overall measure highlights the benefits of our metrics. We also show that time performance during matching is not significant w.r.t. time performance during post-matching. 1 Plots : Evaluation In this section, we compare the quality results of three matching tools to demon-strate the benefits of our measure.","authors":["Fabien Duchateau","Zohra Bellahsene","Remi Coletta"],"meta":["October 2011","DOI:10.1007/978-3-642-25109-2_28","Conference: OTM Confederated International Conferences \"On the Move to Meaningful Internet Systems\""],"references":["221311533_COMA_-_A_System_for_Flexible_Combination_of_Schema_Matching_Approaches","221212846_Schema_and_ontology_matching_with_COMA","220829945_A_Boosting_Schema_Matchers","220483980_The_Role_of_Schema_Matching_in_Large_Enterprises","275575027_STBenchmark","261180225_Ontology_Matching","252292779_Schema_Matching_and_Mapping","220988115_The_Role_of_Schema_Matching_in_Large_Enterprises","220604832_Semantic_Integration","220538641_STBenchmark_Towards_a_benchmark_for_mapping_systems"]}