{"id":"266852840_Gamification_and_Student_Motivation","abstract":"The literature suggests that gamified learning interventions may increase student engagement and enhance learning. We empirically investigate this by exploring the impact of intrinsic and extrinsic motivation on the participation and performance of over 100 undergraduate students in an online gamified learning intervention. The paper makes a number of contributions. First, by synthesizing the literature the central concepts required for a learning intervention to be considered gamified are mapped and the development of an online gamified learning intervention is described. Second, the effect of gamification on learning outcomes is examined using a pre- and post-intervention survey. We find that gamified learning interventions have a positive impact on student learning. Third, our results show that while generally positive, the impact of gamified intervention*ns on student participation varies depending on whether the student is motivated intrinsically or extrinsically. These findings will be of practical interest to teaching and learning practitioners working in a range of educational contexts, and at all levels of education, who wish to increase student engagement and enhance learning.","authors":["Patrick Buckley","Elaine Doyle"],"meta":["October 2014Interactive Learning Environments","DOI:10.1080/10494820.2014.964263"],"references":["304361902_The_academic_motivation_scale_A_measure_of_intrinsic_extrinsic_and_amotivation_in_education","266853048_Play_As_You_Learn_Gamification_as_a_Technique_for_Motivating_Learners","306154002_This_game_sucks_How_to_improve_the_gamification_of_education","298487464_Harnessing_the_power_of_game_dynamics_Why_how_to_and_how_not_to_gamify_the_library_experience","289963001_Intrinsic_and_Extrinsic_Motivations_Classic_Definition_and_New_Directions","287302097_Motivating_students_to_learn_Third_edition","287063088_Pedagogical_synergies_between_Austrian_economics_and_the_case_method","281702988_Motivating_students_to_learn_4th_edition","273947281_The_gamification_of_learning_and_instruction_Game-based_methods_and_strategies_for_training_and_education_San_Francisco_CA_Pfeiffer","271706555_Video_Games_in_Education"]}