{"id":"266882704_Computer_Science_Unplugged_school_students_doing_real_computing_without_computers","abstract":"The Computer Science Unplugged project provides ways to expose students to ideas from Computer Science without having to use computers. This has a number of applications, including outreach, school curriculum support, and clubs. The \"Unplugged\" project, based at Canterbury University, uses activities, games, magic tricks and competitions to show children the kind of thinking that is expected of a computer scientist. All of the activities are available free of charge at csunplugged.org. The project has recently enjoyed widespread adoption internationally, and substantial industry support. It is recommended in the ACM K-12 curriculum, and has been translated into 12 languages. As well as simply providing teaching resources, there is a very active program developing and evaluating new formats and activities. This includes adaptations of the kinaesthetic activities in virtual worlds; integration with other outreach tools such as the Alice language, adaptation for use by students in large classrooms, and videos to help teachers and presenters understand how to use the material. This paper will explore why this approach has become popular, and describe developments and adaptations that are being used for outreach and teaching around New Zealand, as well as internationally. Authors Tim Bell is Associate Professor in the Department of Computer Science and Software Engineering at the University of Canterbury, where he has been for 20 years. He is the recipient of several teaching awards, including an inaugural NZ TTEA in 2002. In the past his main research has been in text compression, and he is the co-author of three books and many papers on this topic. Jason Alexander is a Ph.D. student in the Human-Computer Interaction lab in the Department of Computer Science and Software Engineering at the University of Canterbury. He has presented many Unplugged shows over the last three years. He is currently in the concluding stages of his thesis entitled Understanding and Improving Electronic Document Navigation. Isaac Freeman has a Graduate Diploma in Computer Science, a Diploma in Teaching, and a Masters in Mathematics. He has worked as a classroom teacher, and is now a fulltime web designer and developer. Mick Grimley is a Senior Lecturer in the School of Educational Studies and Human Development at the University of Canterbury. Mick is interested in the enhancement of learning, and in particular as it relates to cognition, motivation, interest, interactivity, new technologies and e-learning. These interests have led him into the study of how technology can be leveraged to improve learning.","authors":["Timothy C. Bell","Jason Alexander","Isaac Freeman","Mick Grimley"],"meta":["January 2009"],"references":["274309848_Computational_Thinking","239823179_Computer_Science_without_computers_new_outreach_methods_from_old_tricks","221538606_A_CS_unplugged_design_pattern","239582464_A_model_curriculum_for_k-12_computer_science_report_of_the_acm_k-12_education_task_force_computer_science_curriculum_committee","232533481_Studies_of_Interference_in_Serial_Verbal_Reactions","228620612_What_is_computing_Bridging_the_gap_between_teenagers'_perceptions_and_graduate_students'_experiences","221537619_Alice_middle_schoolers_the_imaginary_worlds_camps","221437627_Development_of_an_Integrated_Informatics_Curriculum_for_K-12_in_Korea","220808514_In_the_realm_of_si_piuh","220808423_Designing_offline_computer_science_activities_for_the_korean_elementary_school_curriculum"]}