{"id":"266860206_Understanding_Petri_nets_Modeling_techniques_analysis_methods_case_studies_Translated_from_the_German_by_the_author","abstract":"With their intuitive graphical approach and expressive analysis techniques, Petri nets are suitable for a wide range of applications and teaching scenarios, and they have gained wide acceptance as a modeling technique in areas such as software design and control engineering. The core theoretical principles have been studied for many decades and there is now a comprehensive research literature that complements the extensive implementation experience. In this book the author presents a clear, thorough introduction to the essentials of Petri nets. He explains the core modeling techniques and analysis methods and he illustrates their usefulness with examples and case studies. Part I describes how to use Petri nets for modeling; all concepts are explained with the help of examples, starting with a generic, powerful model which is also intuitive and realistic. Part II covers the essential analysis methods that are specific to Petri nets, introducing techniques used to formulate key properties of system nets and algorithms for proving their validity. Part III presents case studies, each introducing new concepts, properties and analysis techniques required for very different modeling tasks. The author offers different paths among the chapters and sections: the elementary strand for readers who wish to study only elementary nets; the modeling strand for those who wish to study the modeling but not the analysis of systems; and finally the elementary models of the modeling strand for those interested in technically simple, but challenging examples and case studies. The author achieves an excellent balance between consistency, comprehensibility and correctness in a book of distinctive design. Among its characteristics, formal arguments are reduced to a minimum in the main text with many of the theoretical formalisms moved to an appendix, the explanations are supported throughout with fully integrated graphical illustrations, and each chapter ends with exercises and recommendations for further reading. The book is suitable for students of computer science and related subjects such as engineering, and for a broad range of researchers and practitioners. © Springer-Verlag Berlin Heidelberg 2013. All rights are reserved.","authors":["W. Reisig"],"meta":["July 2013","DOI:10.1007/978-3-642-33278-4","ISBN: 978-3-642-33277-7"],"references":["258705139_Stochastic_Petri_Nets_-An_Introduction_to_the_Theory","321595464_Unfoldings_A_Partial-Order_Approach_to_Model_Checking","313569154_Partial_Set_2_structures_I_II","313495985_Decidability_and_complexity_of_Petri_Net_problems_An_introduction","313054736_Using_unfoldings_to_avoid_the_state_explosion_problem_in_the_verification_of_asynchronous_circuits","288620419_INVARIANCE_AND_NON-DETERMINACY","268501754_Parallel_program_schemata","266725372_Ein_Algorithmus_fur_das_allgemeine_Erreichbarkeitsproblem_bei_Petrinetzen_und_damit_zusammenhaengende_Probleme_Dissertation","265457621_Parallel_Program_Design_A_Foundation","259563469_Petrify_A_Tool_for_Manipulating_Concurrent_Specifications_and_Synthesis_of_Asynchronous_Controllers","256554886_System_Modelling_with_High-Level_Petri_Nets","255569275_Unfoldings_-_A_Partial-Order_Approach_to_Model_Checking","248533860_Petri_Nets_for_Systems_Engineering","248069540_Theoretische_Informatik_Petri-Netze","247930438_The_Mathematics_of_Petri_Nets"]}