{"id":"266854357_Knowledge_representations_with_ontology_support_for_collaborative_engineering_in_architecture_engineering_and_construction","abstract":"This paper brings a contribution focused on collaborative engineering projects where knowledge plays a key role in the process. Collaboration is the arena, engineering projects are the target, knowledge is the currency used to provide harmony into the arena since it can potentially support innovation and, hence, a successful collaboration. The Building and Construction domain is challenged with significant problems for exchanging, sharing and integrating information among actors. Semantic gaps or lack of meaning definition at the conceptual and technical level, for example, are problems fundamentally originated through the employment of representations to map the ‘world’ into models in an endeavour to anticipate other actors’ views, vocabulary, and even motivations. One of the primary research challenges addressed in this work relates to the process of formalization and representation of document contents, where most existing approaches are limited and only take into account of the explicit, word-based information in the document. The research described in this paper explores how traditional knowledge representations can be enriched through incorporation of implicit information derived from the complex relationships (Semantic Associations) modelled by domain ontologies with the addition of information presented in documents, by providing a baseline for facilitating knowledge interpretation and sharing between humans and machines. The paper introduces a novel conceptual framework for representation of knowledge sources, where each knowledge source is semantically represented (within its domain of use) by a Semantic Vector. This work contributes to the enrichment of Semantic Vectors, using the classical vector space model approach extended with ontological support, employing ontology concepts and their relations in the enrichment process. The test bed for the assessment of the approach is the Building and Construction, using an appropriate domain Ontology. Preliminary results were collected using a clustering algorithm for document classification, which indicates that the proposed approach does improve the precision and recall of classifications. Future work and open issues are also discussed.","authors":["Ruben Costa","Celson Lima"],"meta":["September 2014Electronic Journal of Information Technology in Construction 19:434-461"],"references":["312457496_Inductive_learning_algorithms_and_representations_for_text_categorization","273750095_Epistemology_of_Construction_Informatics","264120731_Ontology-based_optimisation_of_knowledge_management_in_e-Construction","245282551_Domain_Taxonomy_for_Construction_Concepts_Toward_a_Formal_Ontology_for_Construction_Knowledge","227119140_Why_does_language_matter_to_artificial_intelligence","223765947_Value_proposition_on_interoperability_of_BIM_and_collaborative_working_environments","223158406_An_integration_of_WordNet_and_fuzzy_association_rule_mining_for_multi-label_document_clustering","220604574_The_State_of_the_Art_in_Ontology_Design_A_Survey_and_Comparative_Review","28579283_Ontology-Centered_Knowledge_Management_Using_Information_Retrieval_Techniques"]}