{"id":"266891895_IX_ENCONTRO_EVASAO_UNIVERSITARIA_O_CASO_DO_INSTITUTO_DE_FISICA_DA_UFRJ","abstract":"RESUMO O curso de Física da UFRJ é um curso com alto índice de evasão. Com 120 estudantes ingressantes, formam-se em Física cerca de 10% deste total, e outros 10% concluem algum outro curso. Este trabalho pretende, através da análise de dados quantitativos e qualitativos, fazer um estudo do que é a evasão em cursos universitários, com base no caso do curso de Física do IF-UFRJ, onde ela ocorre, quais as suas causas principais, e se algo pode ser efeito para reduzir seus índices. Os dados permitem estudar o perfil social, econômico e cultural dos ingressantes no IF-UFRJ, dos alunos concluintes e dos que abandonam o curso. Identifica-se quando a evasão do curso ocorre, quais as características deste abandono e faz-se numa análise qualitativa de suas causas. Também mostra-se a influência que uma metodologia aplicada às disciplinas do primeiro ano pode ter sobre estes índices de evasão, possibilitando a construção de uma reflexão sobre os processos de aprendizagem de Física em nível universitário. I -INTRODUÇÃO A Física é uma disciplina que faz parte de todos os cursos em nível universitário das áreas de ciências exatas, tecnologia e licenciaturas. É uma constante, já há muitos anos, o relato de dificuldades no processo de aprendizagem de física, e também a queixa que essas dificuldades aumentam os índices de evasão já altos dos cursos de baixa procura (cursos em que a relação candidato/vaga no vestibular é baixa). Muitos trabalhos foram e vem sido desenvolvidos, como por exemplo os relatos em [1,2,3], para encontrar formas apropriadas para processos de ensino e aprendizagem de física na universidade. A formação de físicos insere-se neste caso. O curso de física é um curso de baixa procura, e as características específicas da f ormação profissional de um físico exigem uma grande dedicação e interesse dos estudantes. Em relação ao ambiente desta formação, Leite Lopes já em 1958 [4] alertava sobre a necessidade de que ela fosse efetuada em instituições com atividade de pesquisa. Os cursos universitários de Física tem a característica de formar basicamente pesquisadores e professores de Física [5].","authors":["N Acional De","P Esquisa","Em Ensino","De Física"],"meta":[],"references":["267234060_O_Professor_como_Organizador_das_Condicoes_Externas_da_Aprendizagem","261834038_Ensino_de_Fisica_no_Brasil_Retrospectiva_e_Perspectivas"]}