{"id":"266971408_A_comparative_survey_of_Symmetric_and_Asymmetric_Key_Cryptography","abstract":"Network security is an important aspect of information sharing. Attempts have been made to remove various insecurities over internet. For this, many technological implementations and security policies have been developed. The amount of data, transferred, is not a factor. The basic factor is, how much security, the channel provides while transmitting data. Cryptography is one such technique, which allows secure data transmission without losing its confidentiality and integrity. Based on the key distribution, cryptography is further classified into two major types-Symmetric Key Cryptography and Asymmetric Key Cryptography. In this paper, we have surveyed the traditional algorithms, along with the proposed algorithms based on their pros and cons, related to Symmetric and Asymmetric Key Cryptography. We have also compared the importance of both these cryptographic techniques. The proposed algorithms proved to be highly efficient in their respective grounds but there are certain areas that remained open, related to these algorithms, and have not yet been thoroughly discussed. This paper also presents an appropriate future scope related to these open fields.","authors":["Sourabh Chandra","Smita Paira","Sk Safikul Alam","Siddhartha Bhattacharyya"],"meta":["November 2014","DOI:10.1109/ICECCE.2014.7086640","Conference: IC3I-2014At: Mysore, India"],"references":["271557093_An_algorithm_to_enhance_security_in_RSA","262840408_E-commerce_Security_Through_Asymmetric_Key_Algorithm","262013708_Quantum_Security_using_Property_of_a_Quantum_Wave_Function","277632670_E-commerce_Security_Through_Asymmetric_Key_Algorithm","271546415_A_secure_symmetric_image_encryption_based_on_linear_geometry","269305278_Proposed_Method_for_Multimedia_Data_Security_Using_Cyclic_Elliptic_Curve_Chaotic_System_and_Authentication_Using_Neural_Network","269291496_ECC_with_hidden_generator_point_in_WSNs","262836797_HardwareSoftware_Co-Design_of_Elliptic-Curve_Cryptography_for_Resource-Constrained_Applications","261380155_Symmetric_key_based_RFID_authentication_protocol_with_a_secure_key-updating_scheme","261212475_A_study_on_wireless_secret_key_randomness_in_multiuser_networks"]}