{"id":"26690920_CSA_An_efficient_algorithm_to_improve_circular_DNA_multiple_alignment","abstract":"The comparison of homologous sequences from different species is an essential approach to reconstruct the evolutionary history of species and of the genes they harbour in their genomes. Several complete mitochondrial and nuclear genomes are now available, increasing the importance of using multiple sequence alignment algorithms in comparative genomics. MtDNA has long been used in phylogenetic analysis and errors in the alignments can lead to errors in the interpretation of evolutionary information. Although a large number of multiple sequence alignment algorithms have been proposed to date, they all deal with linear DNA and cannot handle directly circular DNA. Researchers interested in aligning circular DNA sequences must first rotate them to the \"right\" place using an essentially manual process, before they can use multiple sequence alignment tools.\nIn this paper we propose an efficient algorithm that identifies the most interesting region to cut circular genomes in order to improve phylogenetic analysis when using standard multiple sequence alignment algorithms. This algorithm identifies the largest chain of non-repeated longest subsequences common to a set of circular mitochondrial DNA sequences. All the sequences are then rotated and made linear for multiple alignment purposes.To evaluate the effectiveness of this new tool, three different sets of mitochondrial DNA sequences were considered. Other tests considering randomly rotated sequences were also performed. The software package Arlequin was used to evaluate the standard genetic measures of the alignments obtained with and without the use of the CSA algorithm with two well known multiple alignment algorithms, the CLUSTALW and the MAVID tools, and also the visualization tool SinicView.\nThe results show that a circularization and rotation pre-processing step significantly improves the efficiency of public available multiple sequence alignment algorithms when used in the alignment of circular DNA sequences. The resulting alignments lead to more realistic phylogenetic comparisons between species.","authors":["Francisco Fernandes","Luísa Pereira","Ana Teresa Correia Freitas"],"meta":["February 2009BMC Bioinformatics 10(1):230","DOI:10.1186/1471-2105-10-230","SourcePubMed"],"references":["343236529_Tracing_European_Founder_Lineages_in_the_Near_Eastern_mtDNA_Pool","240434148_ARLEQUIN_ver_30_an_integrated_software_package_for_population_genetics_data_analysis","232762992_Sequence_and_organization_of_the_human_mitochondrial_genome","229067733_Linear_Pattern_Matching_Algorithm","319394814_Algorithms_on_strings_trees_and_sequences_computer_science_and_computational_biology","303167148_CLUSTAL_W_Improving_the_sensitivity_of_progressive_multiple_sequence_alignment_through_sequence_weighting_position-specific_gap_penalties_and_weight_matrix_choice","278324220_Genbank","239063123_T-co_ee_A_novel_method_for_multiple_sequence_alignments","229067720_On-Line_Construction_of_Suffix_Trees","222693263_Notredame_C_Higgins_D_G_Heringa_J_T-Coffee_A_novel_method_for_fast_and_accurate_multiple_sequence_alignment_J_Mol_Biol_302_205-217"]}