{"id":"267094856_SQL_Island_An_Adventure_Game_to_Learn_the_Database_Language_SQL","abstract":"Background: SQL Island is mainly addressed to university students, to help them apply concepts as taught in database lectures, and is suited for exam preparation.\nHowever, it was designed especially for computer‐science introducing courses in\nschools. We consider writing SQL queries a good method to teach children how to\ncommand a machine, focusing on the accuracy and precision of the input which is\napplicable to all programming languages. Our goal was to develop a new type of\neducational game, namely a combination of classic programming tutorials and\ntext‐adventure games. With SQL Island, we wanted to put motivation, fun and\naction in the learning process.\nDescription: Imagine you are marooned on an island. The inhabitants only under‐\nstand the database language SQL. The adventure game SQL Island\n(http://www.sql‐island.de) is controlled by sending SQL queries which teach the\nfundamentals of the language in an entertaining and funny way. The player learns\nhow to search and manipulate data in a relational database. Prior knowledge of\nthe SQL language is not required. Tutorials include both the matter of study as\nwell as a quiz. In text‐adventure games, the user controls a fictional character by\nusing text commands in order to achieve a certain goal. A typical command in said\ntext‐adventure games would be for example: \"Collect the ring\". In SQL Island, the\nuser would enter: UPDATE item SET owner = 20 WHERE item = ring. In the begin‐\nning of the game, the player is marooned on an island and encounters the people\nthere. Luckily they are in the company of a pilot who could help you escape but\nhe is being held captive. The player's task is to earn money, sell items and buy a\nsword which will help him to free the pilot from the fetters of the kidnapper. The\nsystem presents the very first SQL queries to help the player find their way\naround the island. Following this, they are asked to apply their knowledge in other\nqueries in order to solve different problems and answer questions. The complex‐\nity of the SQL language increases logically and inevitably must be incorporated to\nprogress and to finally reach the end goal. The game, consisting of 30 levels138\nroughly, can be finished in about an hour and will train the player in the basics of\nSQL.\nLinks: SQL Island can be played online: http://www.sql‐island.de. On this website,\na game‐trailer video can be found, too.","authors":["Johannes Schildgen"],"meta":["October 2014","Conference: The 8th European Conference on Games Based Learning (ECGBL 2014)At: Berlin, Germany","Project: Learning Games"],"references":["36384763_Game-based_learning_Erfahrungen_mit_und_Perspektiven_fur_digitale_Lernspiele_in_der_beruflichen_Bildung"]}