{"id":"267044745_A_PDB-wide_evolution-based_assessment_of_protein-protein_interfaces","abstract":"Background\nThanks to the growth in sequence and structure databases, more than 50 million sequences are now available in UniProt and 100,000 structures in the PDB. Rich information about protein¿protein interfaces can be obtained by a comprehensive study of protein contacts in the PDB, their sequence conservation and geometric features.ResultsAn automated computational pipeline was developed to run our Evolutionary Protein¿Protein Interface Classifier (EPPIC) software on the entire PDB and store the results in a relational database, currently containing > 800,000 interfaces. This allows the analysis of interface data on a PDB-wide scale. Two large benchmark datasets of biological interfaces and crystal contacts, each containing about 3000 entries, were automatically generated based on criteria thought to be strong indicators of interface type. The BioMany set of biological interfaces includes NMR dimers solved as crystal structures and interfaces that are preserved across diverse crystal forms, as catalogued by the Protein Common Interface Database (ProtCID) from Xu and Dunbrack. The second dataset, XtalMany, is derived from interfaces that would lead to infinite assemblies and are therefore crystal contacts. BioMany and XtalMany were used to benchmark the EPPIC approach. The performance of EPPIC was also compared to classifications from the Protein Interfaces, Surfaces, and Assemblies (PISA) program on a PDB-wide scale, finding that the two approaches give the same call in about 85% of PDB interfaces. By comparing our safest predictions to the PDB author annotations, we provide a lower-bound estimate of the error rate of biological unit annotations in the PDB. Additionally, we developed a PyMOL plugin for direct download and easy visualization of EPPIC interfaces for any PDB entry. Both the datasets and the PyMOL plugin are available at http://www.eppic-web.org/ewui/\\#downloads.Conclusions\nOur computational pipeline allows us to analyze protein¿protein contacts and their sequence conservation across the entire PDB. Two new benchmark datasets are provided, which are over an order of magnitude larger than existing manually curated ones. These tools enable the comprehensive study of several aspects of protein¿protein contacts in the PDB and represent a basis for future, even larger scale studies of protein¿protein interactions.","authors":["Kumaran Baskaran","Jose M Duarte","Nikhil Biyani","Spencer Bliven"],"meta":["October 2014BMC Structural Biology 14(1):22","DOI:10.1186/s12900-014-0022-0","SourcePubMed"],"references":["290891419_Gapped_BLAST_and_PSIBLAST_A_new_generation_of_protein_database_search_programs","264390033_Avoidable_errors_in_deposited_macromolecular_structures_An_impediment_to_efficient_data_mining","258053961_An_analysis_of_oligomerization_interfaces_in_transmembrane_proteins","252670752_Petromagnetic_Properties_In_The_Naica_Mining_District_Chihuahua_Mexico_Searching_For_Source_of_Mineralization","235747916_Update_on_activities_at_the_Universal_Protein_Resource_UniProt_in_2013UniProtConsortiumNucleic_Acids_Res201341D43D47353109423161681","233973136_Protein_interface_classification_by_evolutionary_analysis","270903100_The_Protein_Data_Bank","247957623_The_Protein_Data_Bank_Nucleic_Acids_Research","244635758_Automatic_inference_of_protein_quaternary_structure_from_crystals","236689853_Structural_Evolutionary_and_Assembly_Principles_of_Protein_Oligomerization"]}