{"id":"267079760_Merge-and-Shrink_Abstraction_A_Method_for_Generating_Lower_Bounds_in_Factored_State_Spaces","abstract":"Many areas of computer science require answering questions about reachability in compactly described discrete transition systems. Answering such questions effectively requires techniques to be able to do so without building the entire system. In particular, heuristic search uses lower-bounding (“admissible”) heuristic functions to prune parts of the system known to not contain an optimal solution. A prominent technique for deriving such bounds is to consider abstract transition systems that aggregate groups of states into one. The key question is how to design and represent such abstractions. The most successful answer to this question are pattern databases, which aggregate states if and only if they agree on a subset of the state variables. Merge-and-shrink abstraction is a new paradigm that, as we show, allows to compactly represent a more general class of abstractions, strictly dominating pattern databases in theory. We identify the maximal class of transition systems, which we call factored transition systems, to which merge-and-shrink applies naturally, and we show that the well-known notion of bisimilarity can be adapted to this framework in a way that still guarantees perfect heuristic functions, while potentially reducing abstraction size exponentially. Applying these ideas to planning, one of the foundational subareas of artificial intelligence, we show that in some benchmarks this size reduction leads to the computation of perfect heuristic functions in polynomial time and that more approximate merge-and-shrink strategies yield heuristic functions competitive with the state of the art.","authors":["Malte Helmert","Patrik Haslum","Jörg Hoffmann","Raz Nissim"],"meta":["May 2014Journal of the ACM 3(3)","DOI:10.1145/2559951"],"references":["239524429_Attack_Planning_in_the_Real_World","312596057_Generalized_best-first_search_strategies_and_the_optimality_of_A","285309457_Erosional_Development_of_Streams_and_Their_Drainage_Basins_Hydrophysical_Approach_to_Quantitative_Morphology","265546197_Diagnosis_of_Active_Systems_-_Principles_and_Techniques","265186605_How_to_Relax_a_Bisimulation","255663476_Operational_and_Algebraic_Semantics_of_Concurrent_Processes","245624208_CCS-A_Calculus_for_Communicating_Systems","243771905_The_Planning_Domain_Definition_Language_Manual","238799612_A_Formal_Basis_for_the_Heuristic_Determination_of_Minimum_Cost_Paths","229068193_GPS_a_program_that_simulates_human_thought"]}