{"id":"267093639_The_man_who_knew_too_much_Alan_Turing_and_the_invention_of_the_computer","abstract":"Great Discoveries series, W. W. Norton, Dec. 2005, ISBN 0-393-05236-2) Mathematicians like to think of themselves as seekers after truth. At the same time, there is an optimistic modeling of mathematics as a rational activity based upon generally shared foundations. Alan Turing -along with Kurt Gödel and Alonzo Church and others -was one of those meta-mathematical pioneers working in the 1930s who showed that the actual picture was in some ways more mundane, and in others very much stranger. And what makes Turing's work so interesting to people outside mathematics is the extent to which his mathematical investigations were tied up with his own personality and tortuous per-sonal affairs. In many ways, Turing's mathematics was not just about what mathematicians and computers can and cannot do, but seems to many to be highly relevant to his own life and all too early death. David Leavitt's highly readable account of Turing's life and work is yet one more example of this attention from non-mathematicians, and one which will be greeted with the usual mixed feelings by those of us who work professionally in the field. We are happy to see mathematics and mathematicians given the popular science treatment -even when, as here, it is marred by the occasional technical gaffe. But there are many points at which David Leavitt, who (the publisher tells us) \"teaches creative writing at the University of Flor-ida\", tests the readers patience with his extra-mathematical takes on Turing's career, particularly in regard to the relationship between Turing's sexuality and his scientific work. He certainly seems to have tested that of Andrew Hodges, the perceptive and sensitive author of the definitive Turing biography (one which must be a front-runner for the best biography of a mathematician ever written). In his Scientific American review (Janu-ary 22, 2006) of The Man Who Knew Too Much Hodges describes, as someone who has moved beyond 1960s posturing, how \"Leavitt's focus ... is on Turing as the gay outsider, driven to his death\" with no \"oppor-tunity ... lost to highlight this subtext\"; how it is \"a survey of a field long cultivated by other hands, devoid of new witnesses\" (most of Leavitt's factual account of Turing is based on already published sources); but -and how could one not enjoy this readable page-turner of a book? -he concludes, the book \"is one that many will find congenial and that will at least introduce new readers to the still tingling enigma of Alan Turing.\" There will, of course, be more radical and variously dissenting views on what might seem the much hyped status of Alan Turing, in particular from those who point to the paucity of his published mathematical works, and these technically surpassed by a legion of worthy researchers for whom we will never see popular biog-raphies. For the dissenters the continuing fascination exercised by Turing and his work is a by-product of the mythology generated by his Bletchley Park code-breaking (shortening the Second World War by two years, it is estimated); of his controversial role as \"father of the computer\"; of his persecution as an openly gay man in post-war Britain; and of his mysterious premature death from the eating of an apple dipped in cyanide (which Leavitt, building on what Hodges tells us, bizarrely links to Turing's captivation by the Disney version of Snow White and the Seven Dwarfs).","authors":["David Leavitt"],"meta":["January 2007"],"references":[]}