{"id":"267020133_Bayesian_Networks_with_Imprecise_Probabilities_Theory_and_Application_to_Classification","abstract":"Bayesian network are powerful probabilistic graphical models for modelling uncertainty. Among others, classification represents an important application: some of the most used classifiers are based on Bayesian networks. Bayesian networks are precise models: exact numeric values should be provided for quantification. This requirement is sometimes too narrow. Sets instead of single distributions can provide a more realistic description in these cases. Bayesian networks can be generalized to cope with sets of distributions. This leads to a novel class of imprecise probabilistic graphical models, called credal networks. In particular, classifiers based on Bayesian networks are generalized to so-called credal classifiers. Unlike Bayesian classifiers, which always detect a single class as the one maximizing the posterior class probability, a credal classifier may eventually be unable to discriminate a single class. In other words, if the available information is not sufficient, credal classifiers allow for indecision between two or more classes, this providing a less informative but more robust conclusion than Bayesian classifiers.","authors":["Giorgio Corani","Alessandro Antonucci","M. Zaffalon"],"meta":["May 2012Intelligent Systems Reference Library 23","DOI:10.1007/978-3-642-23166-7_4"],"references":["344486892_Statistical_Reasoning_with_Imprecise_Probabilities","322715583_Data_Mining_practical_machine_learning_tools_and_techniques","314725134_The_Enterprise_of_Knowledge_An_Essay_on_Knowledge_Credal_Probability_and_Chance","293177953_Decision_Making_with_Imprecise_Probabilities_A_Short_Review","280743082_Inference_and_Missing_Data","274909026_Statistical_Reasoning_With_Imprecise_Probabilities","271154333_The_Enterprise_of_Knowledge_An_Essay_on_Knowledge_Credal_Probability_and_Chances","265620140_Statistical_Analysis_With_Missing_Data","265372150_Credal_networks","262904620_A_Bias-Variance_Analysis_of_a_Real_World_Learning_Problem_The_CoIL_Challenge_2000_Special_Issue_Data_Mining_Lessons_Learned_Guest_Editors_Nada_Lavrac_Hiroshi_Motoda_and_Tom_Fawcett"]}