{"id":"26702924_Perceptual_contributions_of_the_consonant-vowel_boundary_to_sentence_intelligibility","abstract":"Although research has focused on the perceptual contribution of consonants to spoken syllable or word intelligibility, in sentences vowels have a distinct perceptual advantage over consonants in determining intelligibility [Kewley-Port et al., J. Acoust. Soc. Am. 122, 2365-2375 (2007)]. The current study used a noise replacement paradigm to investigate how perceptual contributions of consonants and vowels are mediated by transitional information at segmental boundaries. The speech signal preserved between replacements is defined as a glimpse window. In the first experiment, glimpse windows contained proportional amounts of transitional boundary information that was either added to consonants or deleted from vowels. Results replicated a two-to-one vowel advantage for intelligibility at the traditional consonant-vowel boundary and suggest that vowel contributions remain robust against proportional deletions of the signal. The second experiment examined the combined effect of random glimpse windows not locked to segments and the distributions of durations measured from the consonant versus vowel glimpses observed in Experiment 1. Results demonstrated that, for random glimpses, the cumulative sentence duration glimpsed was an excellent predictor of performance. Comparisons across experiments confirmed that higher proportions of vowel information within glimpses yielded the highest sentence intelligibility.","authors":["Daniel Fogerty","Diane Kewley-Port"],"meta":["September 2009The Journal of the Acoustical Society of America 126(2):847-57","DOI:10.1121/1.3159302","SourcePubMed"],"references":["243787812_TIMIT_Acoustic-phonetic_Continuous_Speech_Corpus","284511599_Erratum_Some_Experiments_on_the_Perception_of_Synthetic_Speech_Sounds_J_Acoust_Soc_Am_24_597_1952","284506561_Why_Short_Subjects_Are_Harder_to_Find","265414111_American_National_Standard_Methods_for_Calculation_of_the_Speech_Intelligibility_Index","248562858_Glimpsing_speech","247743915_The_Acoustic_Analysis_of_Speech_Singular","243764415_Coarticulation_in_recent_speech_production_models","243494334_Erratum_Some_Experiments_on_the_Perception_of_Synthetic_Speech_Sounds","239064655_Transcription_and_Alignment_of_the_TIMIT_Database","239030209_The_DARPA_TIMIT_Acoustic-Phonetic_Continuous_Speech_Corpus_CDROM"]}