{"id":"26702912_Travel-time_sensitivity_kernels_versus_diffraction_patterns_obtained_through_double_beam-forming_in_shallow_water","abstract":"In recent years, the use of sensitivity kernels for tomographic purposes has been frequently discussed in the literature. Sensitivity kernels of different observables (e.g., amplitude, travel-time, and polarization for seismic waves) have been proposed, and relationships between adjoint formulation, time-reversal theory, and sensitivity kernels have been developed. In the present study, travel-time sensitivity kernels (TSKs) are derived for two source-receiver arrays in an acoustic waveguide. More precisely, the TSKs are combined with a double time-delay beam-forming algorithm performed on two source-receiver arrays to isolate and identify each eigenray of the multipath propagation between a source-receiver pair in the acoustic waveguide. A relationship is then obtained between TSKs and diffraction theory. It appears that the spatial shapes of TSKs are equivalent to the gradients of the combined direction patterns of the source and receiver arrays. In the finite-frequency regimes, the combination of TSKs and double beam-forming both simplifies the calculation of TSK and increases the domain of validity for ray theory in shallow-water ocean acoustic tomography.","authors":["Ion Iturbe","Philippe Roux","Jean Virieux","Barbara Nicolas"],"meta":["September 2009The Journal of the Acoustical Society of America 126(2):713-20","DOI:10.1121/1.3158922","SourcePubMed"],"references":["241232669_Can_finite-frequency_effects_be_accounted_for_in_ray_theory_surface_wave_tomography","253220296_A_guide_to_the_limits_of_resolution_imposed_by_scattering_ray_tomography","249865047_Resolution_limits_in_ray_tomography_due_to_wave_behavior_Numerical_experiments","249865023_Wave-equation_tomography","243765047_Introduction_to_Fourier_Optics_McGraw-Hill","243677785_Inverse_Problem_Theory_Methods_For_Data_Fitting_and_Model_Parameter_Estimation","243526208_Travel-time_sensitivity_kernels_in_ocean_acoustic_tomography","243525451_Turning_point_filters_Analysis_of_sound_propagation_on_a_gyre-scale","239291835_A_higher-order_energy-conserving_parabolic_equation_for_range-dependent_ocean_depth_sound_speed_and_density","234391646_Seismic_tomography_adjoint_methods_time_reversal_and_banana-doughnut_kernels"]}