{"id":"267012176_Design_of_Office_Information_Systems","abstract":"The goal of this book is to present a framework within which the myriad of office technologies and office systems design techniques can be better understood. There are a number of office books which deal with the social/organizational aspects of office automation or with office equipment introduction strategies. This book differs from those in that it is written by technical computer people for technical computer people. As such, it assumes a general computer literacy and contains a technical emphasis with a social fiber woven in. Besides the framework, it also presents the current state of office primitives, office tools, and office technology. Particularly at the applications layer, emphasis is placed on the user interface and its design. Some design areas (e.g. window package design) have not been generally treated in the previous literature. In these cases, amalgamation and distillation of useful research ideas of the authors and of others is presented. The book covers relevant work on-going by international standards bodies, and it discusses the concepts that are emerging (or which the authors feel will be emerging) from universities and industrial research laboratories. Office technologies and techniques are classified as personal environment aids versus communal environment aids. Thus there are large sections concerned with workstations and their peripherals, and concerned with communications networks and distributed applications. Clarence Ellis is past head of the Office Research Group at Xerox PARC, and author of the well known Computing Surveys article \"Office Information Systems and Computer Science\" (1980). Najah Naffah is past head of the KAYAK Office Research Project at the French government INRIA research laboratory, and editor of various international conference proceedings on office information systems.","authors":["Clarence A. Ellis","Najah Naffah"],"meta":["January 1987","DOI:10.1007/978-3-642-83095-2"],"references":[]}