{"id":"267006455_A_New_Detail-Preserving_Regularization_Scheme","abstract":"It is a challenging task to reconstruct images from their noisy, blurry, and/or incomplete measurements, especially those with important details and features such as medical magnetic resonance (MR) and CT images. We propose a novel regularization model that integrates two recently developed regularization tools: total generalized variation (TGV) by Bredies, Kunisch, and Pock; and shearlet transform by Labate, Lim, Kutyniok, and Weiss. The proposed model recovers both edges and fine details of images much better than the existing regularization models based on the total variation (TV) and wavelets. Specifically, while TV preserves sharp edges but suffers from oil painting artifacts, TGV ”selectively regularizes” different image regions at different levels and thus largely avoids oil painting artifacts. Unlike the wavelet transform, which represents isotropic image features much more sparsely than anisotropic ones, the shearlet transform can efficiently represent anisotropic features such as edges, curves, and so on. The proposed model based on TGV and the shearlet transform has been tested in the compressive sensing context and produced high-quality images using fewer measurements than the state-of-the-art methods. The proposed model is solved by splitting variables and applying the alternating direction method of multiplier (ADMM). For certain sensing operators, including the partial Fourier transform, all the ADMM subproblems have closed-form solutions. Convergence of the algorithm is briefly mentioned. The numerical simulations presented in this paper use the incomplete Fourier, discrete cosine, and discrete wavelet measurements of MR images and natural images. The experimental results demonstrate that the proposed regularizer preserves various image features (including edges and textures), much better than the TV/wavelet based methods.","authors":["Weihong Guo","Jing Qin","Wotao Yin"],"meta":["April 2014SIAM Journal on Imaging Sciences 7(2)","DOI:10.1137/120904263"],"references":["273472615_Compactly_Supported_Shearlets_are_Optimally_Sparse","265360216_On_the_Global_and_Linear_Convergence_of_the_Generalized_Alternating_Direction_Method_of_Multipliers","265144739_Edge_Guided_Reconstruction_for_Compressive_Imaging","262934168_The_Construction_of_Smooth_Parseval_Frames_of_Shearlets","254044577_Hybrid_regularization_for_MRI_reconstruction_with_static_field_inhomogeneity_correction","299070718_Ridgelets_A_key_to_higher-dimensional_intermittency","267440785_Shearlets_Multiscale_analysis_for_multivariate_data","262358698_Full_length_article_Compactly_supported_shearlets_are_optimally_sparse","260365821_Sur_l'approximation_par_elements_finis_d'ordre_un_et_la_resolution_par_penalisation-dualite_d'une_classe_de_problemes_de_Dirichlet_non_lineaires","257291946_A_Wavelet_Tour_of_Signal_Processing_The_Sparse_Way"]}