{"id":"267149147_Strategy-proof_approximation_mechanisms_for_an_obnoxious_facility_game_on_networks","abstract":"We study a new facility game, namely, an obnoxious facility game, on a network where the facility is undesirable and all agents try to be as far away from the facility as possible. The following process is considered: at first the agents declare their locations, then, given these bids, a mechanism selects a place on the network to locate the facility. The aim of the mechanism is to maximize the obnoxious social welfare, i.e., the total distance between the agents and the facility. The objective of each agent is to maximize his/her utility, i.e., the distance from the facility. Thus an agent may lie if, by doing so, he/she can get strictly more benefit. We are interested in mechanisms without money to decide the facility location so that the obnoxious social welfare is maximized and all agents are enforced to report their true locations. In this paper we give a first attempt at this game on different networks. Our main results are the following. When the network is a path, we show a 3-approximation group strategy-proof deterministic mechanism which is best possible if the facility can only take one of the endpoints on the path, and a group strategy-proof randomized mechanism with tight approximation ratio of 3 2. When the networks are a circle (known as a ring in the case of computer networks) and a tree, we propose two group strategy-proof deterministic mechanisms that each provides the approximation ratio of 3. Furthermore, when all agents are on a general network, we propose a 4-approximation group strategy-proof deterministic mechanism and a 2-approximation group strategy-proof randomized mechanism.","authors":["Yukun Cheng","Wei Yu","Guochuan Zhang"],"meta":["July 2013Theoretical Computer Science 497(3)","DOI:10.1016/j.tcs.2011.11.041","Project: the National Nature Science Foundation of China No. 11301475"],"references":["220533197_Obnoxious_Facility_Location_on_Graphs","4813174_Incentives_in_Teams","268712358_Mechanism_Design_without_Money","268552348_Introduction_to_mechanism_design_for_computer_scientists","246713807_Locating_an_Obnoxious_Facility_on_a_Network","242933085_A_Linear-Time_Algorithm_for_Maxisum_Facility_Location_on_Tree_Networks","239013963_Medians_and_peripherians_on_trees","237124206_Auctions_and_competitive_sealed_tenders","236221580_Multipart_Pricing_of_Public_Goods","221445084_Approximate_Mechanism_Design_without_Money","221444906_Asymptotically_optimal_strategy-proof_mechanisms_for_two-facility_games","220853203_Tighter_Bounds_for_Facility_Games","210303573_Counterspeculation_Auctions_and_Competitive_Sealed_Tenders","46450746_Strategyproof_Approximation_Mechanisms_for_Location_on_Networks"]}