{"id":"267184697_A_New_Approach_for_Database_Fragmentation_and_Allocation_to_Improve_the_Distributed_Database_Management_System_Performance_A_New_Approach_for_Database_Fragmentation_and_Allocation_to_Improve_the_Distr","abstract":"The efficiency and performance of Distributed Database Management Systems (DDBMS) is mainly measured by its proper design and by network communication cost between sites. Fragmentation and distribution of data are the major design issues of the DDBMS. In this paper, we propose new approach that integrates both fragmentation and data allocation in one strategy based on high performance clustering technique and transaction processing cost functions. This new approach achieves efficiently and effectively the objectives of data fragmentation, data allocation and net-work sites clustering. The approach splits the data relations into pair-wise disjoint fragments and determine whether each fragment has to be allocated or not in the network sites, where allocation benefit outweighs the cost depending on high performance clustering technique. To show the performance of the proposed approach, we performed experimental studies on real database ap-plication at different networks connectivity. The obtained results proved to achieve minimum to-tal data transaction costs between different sites, reduced the amount of redundant data to be ac-cessed between these sites and improved the overall DDBMS performance.","authors":["Rizik M. H, Al-Sayyed","Fawaz A Al Zaghoul","Dima Suleiman","Mariam Abd Alfattah Itriq"],"meta":["October 2014Journal of Software Engineering and Applications 7(7):891-905","DOI:10.4236/jsea.2014.711080"],"references":["270626041_Nonreplicated_Static_Data_Allocation_in_Distributed_Databases_Using_Biogeography-Based_Optimization","252632935_DATA_ALLOCATION_IN_DISTRIBUTED_DATABASE_SYSTEMS_PERFORMED_BY_MOBILE_INTELLIGENT_AGENTS","220588163_Fragment_Allocation_in_Distributed_Database_Design","45602003_A_New_Technique_for_Database_Fragmentation_in_Distributed_Systems","260349911_A_New_Data_Re-Allocation_Model_for_Distributed_DatabasSystems","220358969_Improving_network_systems_performance_by_clustering_distributed_database_sites","200031992_Principles_of_Distributed_Database_Systems"]}