{"id":"267111391_Principles_of_Modeling_and_Simulation_A_Multidisciplinary_Approach","abstract":"Explores wide-ranging applications of modeling and simulation techniques that allow readers to conduct research and ask \"What if?\" Principles of Modeling and Simulation: A Multidisciplinary Approach is the first book to provide an introduction to modeling and simulation techniques across diverse areas of study. Numerous researchers from the fields of social science, engineering, computer science, and business have collaborated on this work to explore the multifaceted uses of computational modeling while illustrating their applications in common spreadsheets. The book is organized into three succinct parts: Principles of Modeling and Simulation provides a brief history of modeling and simulation, outlines its many functions, and explores the advantages and disadvantages of using models in problem solving. Two major reasons to employ modeling and simulation are illustrated through the study of a specific problem in conjunction with the use of related applications, thus gaining insight into complex concepts. Theoretical Underpinnings examines various modeling techniques and introduces readers to two significant simulation concepts: discrete event simulation and simulation of continuous systems. This section details the two primary methods in which humans interface with simulations, and it also distinguishes the meaning, importance, and significance of verification and validation. Practical Domains delves into specific topics related to transportation, business, medicine, social science, and enterprise decision support. The challenges of modeling and simulation are discussed, along with advanced applied principles of modeling and simulation such as representation techniques, integration into the application infrastructure, and emerging technologies. With its accessible style and wealth of real-world examples, Principles of Modeling and Simulation: A Multidisciplinary Approach is a valuable book for modeling and simulation courses at the upper-undergraduate and graduate levels. It is also an indispensable reference for researchers and practitioners working in statistics, mathematics, engineering, computer science, economics, and the social sciences who would like to further develop their understanding and knowledge of the field.","authors":["John A. Sokolowski","Catherine M. Banks"],"meta":["January 2009","DOI:10.1002/9780470403563"],"references":[]}