{"id":"267200041_An_Analysis_of_Article_Errors_among_Saudi_Female_EFL_Students_A_Case_Study","abstract":"This study aims at providing a comprehensive account of the types of errors produced by Saudi female EFL students in their use of articles, based on the Surface Structure Taxonomies (SST) of errors. Data were collected from written samples of 100 first-year female EFL students at the Department of English in the University of Ha'il. Students were given one-and-a-half hours to write on one of six different descriptive topics related to their life and culture. Analysis of errors in students' written samples revealed that while students made a considerable number of errors in their use of articles according to SST, omission errors were the most frequent, while substitutions were the least frequent. Additionally, among all types of omission errors identified, the omission of the indefinite article 'a' was the most frequent. In sharp contrast, the omission of the indefinite article 'an' was the least frequent error. Not surprisingly, errors relating to the addition of the definite article 'the' were the most frequent, which correlates with the fact that the definite article is used more widely in the Arabic language than in English. In fact, the English article system is a complex aspect of English grammar. It is one of the most difficult areas of acquisition for even the most advanced learners who have perfectly learnt all other features of the language. This means that EFL instructors may tolerate these errors and look at article errors as more serious. Further, results showed that Arabic interference was not the only source of errors, but that English was a source of many errors as well. Findings showed that 57. % of the errors were interlingual ones, indicating the influence of the native language. Thus, interlingual errors are the most commonly occurring types. On the other hand, intralingual errors represented 42.56% of article errors. This result also indicates that L1 interference strongly influences the process of second language acquisition of the articles, having a negative effect on the learning process. Teachers and instructors should therefore point out more clearly the differences between L1 and L2 in the use of articles.","authors":["Maha Alhaysony"],"meta":["September 2012Asian Social Science 8(12)","DOI:10.5539/ass.v8n12p55"],"references":["238225042_Errors_and_Strategies_in_Child_Second_Language_Acquisition","223357198_Information_Structure_and_English_Article_Pedagogy","216315339_Error_Analysis_Learning_Articles_and_Prepositions_among_Secondary_School_Students_in_Pakistan","317953684_Principles_of_language_learning_and_teaching","295852894_Language_Transfer_in_Language_Learning","288407453_Interlanguage_analysis_of_the_English_article_system_Some_cognitive_constraints_facing_the_Japanese_adult_learners","286695763_Arabic_speakers","285260288_Comparative_Method_Studies","284702122_Lexical_choice_Towards_writing_problematic_word_lists","274814601_Understanding_ESL_Writers","274339958_Learner_English_A_Teacher's_Guide_to_Interference_and_Other_Problems","263588481_The_Applied_Linguistics_Cooperative_Today_and_Tomorrow","247252022_Principles_of_Language_Learning_And_Teaching","240536010_Writing_Errors_A_Study_of_the_Writing_Ability_of_Arab_Learners_of_Academic_English_and_Arabic_at_University","234624141_Second_Language_Learning_An_Examination_of_Two_Hypotheses","231872038_Error_Analysis_Interlanguage_and_Second_Language_Acquisition","230876406_A_Grammar_of_Contemporary_English","229447760_Error_analysis_and_English-language_strategies_of_Arab_students","49551179_Longman_Dictionary_of_Applied_Linguistics"]}