{"id":"267248425_Dialogue_Categories_and_Chiralities","abstract":"In this paper, we consider a two-sided notion of dialogue category – called dialogue chirality – formulated as an adjunction between a mo-noidal category A of proofs and a monoidal category B of refutations equivalent to its opposite category A op(0,1) . The two-sided formulation is compared to the original one-sided formulation of dialogue categories by exhibiting a 2-dimensional equivalence between a 2-category of dia-logue categories and a 2-category of dialogue chiralities. The resulting coherence theorem clarifies in what sense every dialogue chirality may be strictified to an equivalent dialogue category. Forewords. This paper is part of an ongoing research program at the interface of proof theory, computer science and algebra, whose purpose is to understand the interactive nature of continuations in programming lan-guages. The paper is guided by the insight that this interactive structure already lies in the traditional description of continuations in the language of categories and functors. This basic intuition leads to the idea of for-mulating a dialogue category C as a pair consisting of a category A of proofs (or programs) confronted to a category B of refutations (or environ-ments). However, in order to justify this two-sided and properly symmetric formulation of dialogue categories, one needs to compare it with the origi-nal one-sided formulation. The purpose of the paper is precisely to develop this comparison in full detail, by exhibiting a 2-dimensional equivalence between a pair of appropriately defined 2-categories of dialogue categories and dialogue chiralities.","authors":["Paul-André Melliès"],"meta":["January 2016Publications of the Research Institute for Mathematical Sciences 52(4)","DOI:10.4171/PRIMS/185"],"references":["242383678_Polarized_category_theory_modules_and_game_semantics","312986265_An_Algorithmic_Interpretation_of_Classical_Natural_Deduction","268614879_Review_of_the_elements_of_2-categories","268553662_On_Double_Dualization_Monads","266752743_Interactive_models_of_computation_and_program_behavior","266485023_Game_Semantics_in_String_Diagrams","261055518_Game_Semantics_in_String_Diagrams","248601799_Linear_and_Affine_Typing_of_Continuation-Passing_Style","245595736_Calculus_An_algorithmic_interpretation_of_natural_deduction","228559297_Sequent_calculi_for_second_order_logic_based_upon_dual_linear_decompositions_of_classical_implication"]}