{"id":"267390438_Image_Matching_Using_Generalized_Scale-Space_Interest_Points","abstract":"The performance of matching and object recognition methods based on interest points depends on both the properties of the underlying interest points and the choice of associated image descriptors. This paper demonstrates advantages of using generalized scale-space interest point detectors in this context for selecting a sparse set of points for computing image descriptors for image-based matching.\n\nFor detecting interest points at any given scale, we make use of the Laplacian nabla^2 L, the determinant of the Hessian det H L and four new unsigned or signed Hessian feature strength measures D_1 L, \\tilde{D}_1 L, D_2, L and \\tilde{D}_2 L, which are defined by generalizing the definitions of the Harris and Shi-and-Tomasi operators from the second moment matrix to the Hessian matrix. Then, feature selection over different scales is performed either by scale selection from local extrema over scale of scale-normalized derivates or by linking features over scale into feature trajectories and computing a significance measure from an integrated measure of normalized feature strength over scale.\n\nA theoretical analysis is presented of the robustness of the differential entities underlying these interest points under image deformations, in terms of invariance properties under affine image deformations or approximations thereof. Disregarding the effect of the rotationally symmetric scale-space smoothing operation, the determinant of the Hessian det H L is a truly affine covariant differential entity and the Hessian feature strength measures D_1 L and \\tilde{D}_1 L have a major contribution from the affine covariant determinant of the Hessian, implying that local extrema of these differential entities will be more robust under affine image deformations than local extrema of the Laplacian operator or the Hessian feature strength measures D_2 L, \\tilde{D}_2 L.\n\nIt is shown how these generalized scale-space interest points allow for a higher ratio of correct matches and a lower ratio of false matches compared to previously known interest point detectors within the same class.The best results are obtained using interest points computed with scale linking and with the new Hessian feature strength measures D_1 L$, \\tilde{D}_1 L and the determinant of the Hessian det H L being the differential entities that lead to the best matching performance under perspective image transformations with significant foreshortening, and better than the more commonly used Laplacian operator, its difference-of-Gaussians approximation or the Harris-Laplace operator.\n\nWe propose that these generalized scale-space interest points, when accompanied by associated local scale-invariant image descriptors, should allow for better performance of interest point based methods for image-based matching, object recognition and related visual tasks.","authors":["Tony Lindeberg"],"meta":["April 2015Journal of Mathematical Imaging and Vision 52(1):3-36","DOI:10.1007/s10851-014-0541-0"],"references":["339502865_Object_Categorization","321600739_Gaussian_Scale-Space_Theory","319770820_Histograms_of_Oriented_Gradients_for_Human_Detection","319770516_A_combined_corner_and_edge_detector","319770432_Evaluating_color_descriptors_for_object_and_scene_recognition","319770401_Vision_A_Computational_Investigation_into_the_Human_Representation_and_Processing_of_Visual_Information","316800405_Computer_Vision_Using_Local_Binary_Patterns","316240097_Distinctive_Image_Features_from_Scale-Invariant_Keypoints","313606555_On_scale_selection_for_differential_operators","313527089_Distinctive_image_features_from_scale-invariant_key_points"]}