{"id":"267334617_Free_Rings_and_their_Relations","abstract":"The second edition of “Free rings and their relations” covers not only the material of the first edition (1971), but also the important contributions to the area in the period between the two books. The second edition has 8 chapters, a chapter 0 and two appendices and has almost doubled in size compared to the first edition. The first edition has been reviewed in great details in Zbl 0232.16003 and we will mainly comment on the additions, but we will like to mention that the material of the first edition has been rewritten, many improvements in the presentation have been made and a number of new exercises has been added. Chapter 0 which mainly consists of background material from ring theory now includes a paragraph on Hermite Rings. As major additions to the Chapters 1-4 are “The Theory of Hilbert Series of a filtered Ring” and “Computation of the dependence number”, the dependence number for a ring is an important concept in constructing rings with certain pathological properties. Chapter 5: “Modules over Firs and Semifirs” has a paragraph on Sylvester domains, the results here are used later in the description of non-full matrices. Also a new version of the “specialization lemma” is included in this chapter. Chapter 6 has been completely changed from the corresponding chapter in the first edition and substantial extended. It now includes the theory of automorphisms of the ring of polynomials in two indeterminates over a field as well as a proof of the Makar-Limanov Theorem: Automorphisms of k<x 1 ,x 2 > are tame and the natural mapping from Aut k k<x 1 ,x 2 > to Aut k k[x 1 ,x 2 ] is an automorphism. In this chapter one also finds recent results of Kharchenko, Dicks and Formanek on the fixed ring of a group of linear automorphisms of k<x 1 ,···,x d >. The chapter finishes by Kharchenko’s results on Galois correspondence for X-outer automorphism groups. Chapter 7, which is a very central chapter in the book, contains an extensive theory of prime matrix ideals, the universal field of fractions of a semifir and localization in the style of Gerasimov and Malcolmson. Chapter 8 now also includes Laurent series and the Malcev-Neumann construction. The author has taken great care in presenting the topics of the book and the reviewer finds that the author has succeeded in making a very readable book, which is highly recommended to anyone interested in non commutative ring theory.","authors":["P.M. Cohn"],"meta":["September 1971","DOI:10.1090/s0002-9904-1973-13243-4","Publisher: Academic Press, London & New YorkISBN: 0121791521 (10) / 978-0121791520 (13)"],"references":[]}