{"id":"267340262_Conventional_and_Multiscale_Modeling_of_Microstructure_Evolution_During_Laminar_Cooling_of_DP_Steel_Strips","abstract":"Physical and numerical simulations of the hot rolling and laminar cooling of DP steel strips are presented in the paper. The objectives of the paper were twofold. Physical simulations of hot plastic deformation were used to identify and validate numerical models. Validated models were applied to simulate the manufacturing of DP steel strips. Conventional flow stress model and microstructure evolution model were used in the hot deformation part. The approach to the complex systems analysis based on global thermodynamic characterization and detailed microstructure characterization was applied to determine equilibrium state at various temperatures. Finally, two numerical models were used to simulate kinetics of austenite decomposition at varying temperatures: the first, conventional model based on the Avrami equation, and the second, the discrete Cellular Automata approach. Plastometric tests and stress relaxation tests were used for identification of the hot rolling model for the DP steel. Dilatometric tests were performed to identify the phase transformation models. Verification confirmed good accuracy of all models. Validated models were applied to simulate the manufacturing of DP steel strips. Influence of technological parameters (e.g., strip thickness and velocity, active sections in the laminar cooling, and water flux in the sections) on the DP microstructure was analyzed. The cooling schedules, which give required microstructures were proposed. The numerical tool, which simulates manufacturing chain for DP steel strips is the main output of the paper.","authors":["Maciej Pietrzyk","Jan Kusiak","Roman Kuziak","Łukasz Madej"],"meta":["December 2014Metallurgical and Materials Transactions A 45(13)","DOI:10.1007/s11661-014-2393-z"],"references":["260305988_Physical_and_Numerical_Simulation_of_the_Continuous_Annealing_of_DP_Steel_Strips","257678399_Advanced_high_strength_steels_for_automotive_industry_A_review","250159300_Characteristics_of_Static_and_Metadynamic_Recrystallization_and_Strain_Accumulation_in_Hot-deformed_Austenite_as_Revealed_by_the_Stress_Relaxation_Method","288219334_Kraft_-_und_Arbeitsbedarf_bildsamer_Formgebungsverfahren","259164074_Discrete_micro-scale_cellular_automata_model_for_modelling_phase_transformation_during_heating_of_dual_phase_steels","257678283_Multiscale_modelling_of_microstructure_evolution_during_laminar_cooling_of_hot_rolled_DP_steels","250160965_Phase_Transformations_in_Two_C-Mn-Si-Cr_Dual_Phase_Steels","248503801_A_microstructure_model_for_recrystallisation_and_phase_transformation_during_the_dual-phase_steel_annealing_cycle","248360813_A_general_equation_prescribing_extent_of_austenite-martensite_transformation_in_pure_Fe-C_alloys_and_plain_carbon_steels","248185172_Growth_modes_of_individual_ferrite_grains_in_the_austenite_to_ferrite_transformation_of_low_carbon_steels"]}