{"id":"267365734_Opti_Lowering_the_Barrier_Between_Open_Source_Optimizers_and_the_Industrial_MATLAB_User","abstract":"For those interested in tackling industrial optimization problems, typical approaches include either purchasing a sophisticated and often specialised solver perhaps with accompanying consulting support, using an internet-based optimization server or using a Matlab toolbox. While there are a number of open source optimization solvers that enable one to solve a wide range of continuous and discrete, linear and nonlinear, medium and large-scale optimization problems, only a few contain useable pre-compiled binaries for Windows. The initiative described in this work, Opti, bridges this gap by providing an intuitive object-based general optimization platform that interfaces with many of those freely available, and those with low or no-cost licence requirements, high-quality optimization codes all accessible within the rapid development environment Matlab. The user needs not compile or build the various tools, but still leverages off the advantages of using high-end desktop hardware (such as 64bit multi-core processors) and remaining in a powerful and familiar development environment.","authors":["Jonathan Currie","David Ian Wilson"],"meta":["January 2012","Conference: Foundations of Computer-Aided Process Operations, FOCAPO/CPC 2012At: Savannah, Georgia","Project: Optimal Control"],"references":["316153816_Interpolated_Model_Predictive_Control_Having_Your_Cake_and_Eating_it_Too","226162108_Test_Examples_for_Nonlinear_Programming_Codes","301362356_The_NLopt_nonlinear-optimization_package","285970877_Lightweight_Model_Predictive_Control_intended_for_embedded_applications","244386411_A_Rigorous_MINLP_Model_for_the_Optimal_Synthesis_and_Operation_of_Utility_Plants","237052908_Design_and_Optimization_of_Flexible_Utility_Systems_Subject_to_Variable_Conditions_-_Part_1_Modelling_Framework","230873528_An_Interior_Point_Algorithm_for_Large-Scale_Nonlinear_Optimization_with_Applications_in_Process_Engineering","228771582_Applications_of_integer_quadratic_programming_in_control_and_communication","228392056_Integer_quadratic_programming_for_control_and_communication","222529984_Multifrontal_Parallel_Distributed_Symmetric_and_Unsymmetric_Solvers"]}