{"id":"267301980_Using_Virtual_World_Platform_for_Language_and_Critical_Thinking_Skills_Learning_and_Practice","abstract":"Digital natives of today need frequent stimuli and a variety of activities to keep them engaged and connected in the learning process. With the availability of web 2.0 technologies and its impact on the mode of online interaction and networking, they are highly dependable on the informal social media or technologies to make meaning of the world around them and to voice their opinions. The educators of today thus, face the challenge of incorporating informal media or technologies in the formal lesson delivery setting, in order to close the digital divide within, so as to actively engage them. On the other hand, the incorporation of the ICT tools should not be focused on a teacher-centered approach, but more importantly to leverage these affordances to support learner or student-centered practices. Critical thinking, in particular, taking multiple perspectives, is an important component in the teaching of Chinese Language in Singapore. To entice the student to understand, practice and develop multiple perspectives skills in the use of their Mother Tongue language, the classroom setting must include the use of digital media to motivate them and ICT tools that facilitate discussions so that the students are cognitively engaged. Literature on using Virtual World immersive environment for educational purposes have highlighted on the high possibility of implementing learner centered pedagogies to provide a 3-Dimensional (3D), interactive, avatar-based collaborative learning and practice for students. Leveraging on the affordances of the immersive platform, our educational metaverse provided immersive experiences, authentic contexts and activities for experiential learning and role-play for students to practice on their multiple perspectives taking and language skills. This paper will share the core findings on the concept behind the pedagogical and content design, implementation, challenges, adaptations and recommendations for a 3D virtual world environment for language and critical thinking learning and practice in a Singapore secondary schools context.","authors":["Tan Chuan Leong"],"meta":[],"references":["253925731_Welcome_to_Our_Virtual_Worlds","227733212_Use_of_three-dimensional_3-D_immersive_virtual_worlds_in_K-12_and_higher_education_settings_A_review_of_the_research","221009677_Making_Yourself_at_Home_-_Portable_Personal_Access_Preferences","220309181_The_Singapore_experience_Synergy_of_national_policy_classroom_practice_and_design_research"]}