{"id":"267429660_Promoting_Relevance_in_IS_Research_An_Informing_System_for_Design_Science_Research","abstract":"The relevance gap between academic research and the world of practice is a perennial topic of discussion in all fields, including the information technology disciplines. The common sense view of the issue concludes that academic research frequently fails to address the 'street level' prob-lems that business information technology wrestles with, and so isn't interesting to practice. This is primarily a content issue, one that Informing Science characterizes as the academic fascination with easily decomposable problems which leads to the tendency to over-research models that are obvious or trivial to practice. In Information Systems (IS) we have engaged in discipline-wide discussions of this problem for over fifteen years. Some of us feel we have a solution that scales to other information technology fields: design science research (DSR) – learning through build-ing. In this article we overview the relevance gap in information technology research and then introduce design science research (DSR), first as it is practiced in multiple fields and then as it has been refined by the IS academic community specifically for information technology research. We then use the DSR methodology to design an informing system to address the issues we feel inhibit the growth of design science research in IS (DSRIS). We conclude with an analysis of a recently published DSRIS research effort to demonstrate the benefits that obtain from formalized DSR.","authors":["Bill Kuechler","Vijay Vaishnavi"],"meta":["January 2011Informing Science 14","DOI:10.28945/1498"],"references":["250772780_The_Informing_Sciences_at_a_Crossroads_The_Role_of_the_Client","285741314_Assessing_information_system_design_theory_in_perspective_How_useful_was_our_1992_initial_rendition","273267973_Technology_and_Creativity","270208563_Doing_research_that_is_useful_to_practice_A_model_and_empirical_exploration","263327521_On_theory_development_in_design_science_research_Anatomy_of_a_research_project","251880029_The_Utilization_Process_A_Conceptual_Framework_and_Synthesis_of_Empirical_Findings","249677903_The_Extent_and_Organizational_Determinants_of_Research_Utilization_in_Canadian_Health_Services_Organizations","247083200_Organization_Science_Managers_and_Language_Games","244956056_A_form_of_non-monotonic_reasoning","243694392_The_Reflective_Practitioner"]}