{"id":"267407227_AC_2011-308_TEACHING_COMPUTER_PROGRAMMING_SKILLS_TO_ENGINEERING_AND_TECHNOLOGY_STUDENTS_WITH_A_MODULAR_PROGRAMMING_STRATEGY_Teaching_Computer_Programming_Skills_to_Engineering_and_Technology_Students_","abstract":"Learning basic computer programming skills is important for engineering and technology students in their early years of college education. In our school, ENGR 266 Computer Programming for Engineers is a required course for freshmen and sophomores whose majors are mechanical engineering, renewable energy engineering, mechanical engineering technology and manufacturing engineering technology. In this course, students learn how to develop computer programs with VBA (Visual Basic Application) and MATLAB. ENGR 266 has been a challenging course to teach due to three major factors: course coverage and students' previous programming experiences and technical competence to solve engineering problems. After years of trial and error, the instructor (the first author of this paper) summarized a set of core programming skills that can be mastered in one academic quarter. These programming skills are taught with a modular programming strategy. Through an in-class project, the students learned how to solve a complex problem by dividing it into small pieces, addressing each piece by a programming procedure and integrating the intermediate result from each procedure into the final solution. It is believed that with the modular programming strategy and the core programming skills, the students will be able to develop computer code to solve most engineering problems. Meanwhile, this pedagogic model makes the computer programming course less challenging. The authors are seeking the opportunity to apply the same pedagogic model in a pilot VBA Programming course at a high school.","authors":["Wangping Sun"],"meta":[],"references":["345922929_An_Effective_Approach_For_Teaching_Computer_Programming_To_Freshman_Engineering_Students","268982825_Motivating_Civil_Engineering_Students_to_Learn_Computer_Programming_With_a_Structural_Design_Project","255598827_Using_Robotics_to_Teach_Computer_Programming_AI_Concepts_to_Engineering_Students","345928266_Teaching_Computer_Programming_Skills_To_First_Year_Engineering_Students_Using_Fun_Animation_In_Matlab","345928193_Developing_An_Introductory_Software_Programming_Course_For_Engineering_Students","345924658_Integration_Of_Graphical_Programming_Into_A_First_Year_Engineering_Course","344537978_The_Case_For_Computer_Programming_Instruction_For_All_Engineering_Disciplines","224299981_Work_in_progress_-_Comparing_the_use_of_a_graphical_programming_language_to_a_traditional_text-based_language_to_learn_programming_concepts"]}