{"id":"267434436_Secure_Signatures_and_Chosen_Ciphertext_Security_in_a_Quantum_Computing_World","abstract":"We initiate the study of quantum-secure digital signatures and quantum chosen ciphertext security. In the case of signatures, we enhance the standard chosen message query model by allowing the adversary to issue quantum chosen message queries: given a superposition of messages, the adversary receives a superposition of signatures on those messages. Similarly, for encryption, we allow the adversary to issue quantum chosen ciphertext queries: given a superposition of ciphertexts, the adversary receives a superposition of their decryptions. These adversaries model a natural ubiquitous quantum computing environment where end-users sign messages and decrypt ciphertexts on a personal quantum computer.\nWe construct classical systems that remain secure when exposed to such quantum queries. For signatures, we construct two compilers that convert classically secure signatures into signatures secure in the quantum setting and apply these compilers to existing post-quantum signatures. We also show that standard constructions such as Lamport one-time signatures and Merkle signatures remain secure under quantum chosen message attacks, thus giving signatures whose quantum security is based on generic assumptions. For encryption, we define security under quantum chosen ciphertext attacks and present both public-key and symmetric-key constructions.","authors":["Dan Boneh","Mark Zhandry"],"meta":["August 2013","DOI:10.1007/978-3-642-40084-1_21"],"references":["221354818_A_Digital_Signature_Based_on_a_Conventional_Encryption_Function","51930509_Merkle_Puzzles_in_a_Quantum_World","45933270_Random_Oracles_in_a_Quantum_World","29681841_A_message_recovery_signature_scheme_equivalent_to_DSA_over_elliptic_curves","2554568_Provably_Secure_Blind_Signature_Schemes","267133533_Quantum-Secure_Message_Authentication_Codes","261211899_How_to_Construct_Quantum_Random_Functions","227099814_Bonsai_Trees_or_How_to_Delegate_a_Lattice_Basis","225494708_Chosen-Ciphertext_Security_from_Identity-Based_Encryption","225168161_Efficient_Lattice_HIBE_in_the_Standard_Model","221591873_Trapdoors_for_hard_lattices_and_new_cryptographic_constructions","221354829_Classical_Cryptographic_Protocols_in_a_Quantum_World","220616803_Chosen-Ciphertext_Security_from_Identity-Based_Encryption","220333796_How_to_Delegate_a_Lattice_Basis","45878557_Universally_Composable_Quantum_Multi-Party_Computation","4320907_Quantum_Merkle_Puzzles","3921140_Universally_Composable_Security_A_New_Paradigm_for_Cryptographic_Protocols","2375874_Chameleon_Hashing_and_Signatures"]}