{"id":"267411691_The_Effect_of_Experience_on_System_Usability_Scale_Ratings","abstract":"Longitudinal studies have to do with testing over time and thus take into consideration previous user experience with a product or product versions. However, it is difficult to conduct these types of studies. Therefore the literature is sparse on examples of the explicit effect of user experience on user satisfaction metrics in industry-standard survey instruments. During a development experience in 2009, we used a cross-sectional method to look at the effects of user profiles on ratings for commercial products that use one such instrument, the System Usability Scale or SUS. Recent research has reported finding that differences in user ratings could be based on the extent of a user's prior experience with the computer system, a Web site being visited or a desktop application like Microsoft's Office suite being used. Compared to off-the-shelf office products or personal Web applications, we were curious if we would find the same experience effect for domain specialists using geosciences products in the course of their daily professional job roles. In fact, from data collected with 262 end users across different geographic locations testing two related oilfield product releases, one Web-based and one desktop-based, we found results that were quite close to early assessment studies: Users having a more extensive experience with a product tended to provide higher, more favorable, SUS scores over users with either no or limited experience with a product—and by as much as 15-16%, regardless of the domain product type. This and other observations found during our product testing have led us to offer some practical how-to's to our internal product analysts responsible for managing product test cycles, administering instruments like the SUS to users, and reporting results to development teams.","authors":["Sam Mclellan","Andrew Muddimer","S. Camille Peres"],"meta":["November 2011"],"references":["319394819_SUS_--_a_quick_and_dirty_usability_scale","237124434_Improving_user_satisfaction_The_questionnaire_for_user_interaction_satisfaction_version_55","234821475_Does_time_heal_a_longitudinal_study_of_usability","228609327_A_Comparison_of_Questionnaires_for_Assessing_Website_Usability","228593520_SUS_A_quick_and_dirty_usability_scale","226527931_Consumer_Satisfaction_for_Internet_Service_Providers_An_Analysis_of_Underlying_Processes","289491336_Sources_of_dissatisfaction_in_end-user_support_An_empirical_study","234788932_Cultural_effects_in_usability_assessment","228707326_The_System_Usability_Scale_and_Non-Native_English_Speakers","228658874_The_Effect_of_Culture_on_Usability_Comparing_the_Perceptions_and_Performance_of_Taiwanese_and_North_American_MP3_Player_Users"]}