{"id":"267450633_Dynamic_information_processing_states_revealed_through_neurocognitive_models_of_object_semantics","abstract":"Recognising objects relies on highly dynamic, interactive brain networks to process multiple aspects of object information. To fully understand how different forms of information about objects are represented and processed in the brain requires a neurocognitive account of visual object recognition that combines a detailed cognitive model of semantic knowledge with a neurobiological model of visual object processing. Here we ask how specific cognitive factors are instantiated in our mental processes and how they dynamically evolve over time. We suggest that coarse semantic information, based on generic shared semantic knowledge, is rapidly extracted from visual inputs and is sufficient to drive rapid category decisions. Subsequent recurrent neural activity between the anterior temporal lobe and posterior fusiform supports the formation of object-specific semantic representations – a conjunctive process primarily driven by the perirhinal cortex. These object-specific representations require the integration of shared and distinguishing object properties and support the unique recognition of objects. We conclude that a valuable way of understanding the cognitive activity of the brain is though testing the relationship between specific cognitive measures and dynamic neural activity. This kind of approach allows us to move towards uncovering the information processing states of the brain and how they evolve over time.","authors":["Alex Clarke"],"meta":["February 2015Language, Cognition and Neuroscience 30(4):409-419","DOI:10.1080/23273798.2014.970652"],"references":["279777858_On_the_nature_and_scope_of_featural_representation_of_word_meaning","265558134_Predicting_the_Time_Course_of_Individual_Objects_with_MEG","261328114_Object-Specific_Semantic_Coding_in_Human_Perirhinal_Cortex","329650509_Semantic_Cognition_A_Parallel_Distributed_Processing_Approach","291760487_Disrupted_temporal_lobe_connections_in_semantic_dementia","285500521_Conceptual_structure","283617459_Hierarchies_similarity_and_interactivity_in_object_recognition_category-specific_neuropsychological_deficits","283617363_Hierarchies_similarity_and_interactivity_in_object_recognition_Category-specific_neuropsychological_deficits","280957169_Fast_saccades_towards_faces_Face_detection_in_just_100_ms","277439261_Dynamics_of_visual_feature_analysis_and_object-level_processing_in_face_versus_letter-string_perception"]}