{"id":"267439070_Finite_Automata","abstract":"This chapter presents the field of finite automata, which is a branch of mathematics connected with the algebraic theory of semigroups and associative algebras. From another viewpoint, finite automata are a branch of algorithm design concerned with string manipulation and sequence processing. The chapter presents the basic definitions and a proof of the fundamental result of S. C. Kleene. The chapter discusses the notion of star-height, which is one of the fast developing areas of automata theory. The chapter discusses star-free sets, which is an important notion especially because of its connection with logic. The chapter presents a complete proof of P. Schutzenberger's theorem, stating the equality between star-free sets and aperiodic sets. It also presents the syntactic characterization of two important subfamilies of star-free sets, namely, locally testable and piecewise testable. The chapter describes the applications of finite automata, such as string matching or file indexing. The chapter introduces the field of automata recognizing numbers expanded at some basis. This is an aspect of finite automata regarding several fields in classical mathematics, such as number theory and ergodic theory.","authors":["Dominique Perrin"],"meta":["December 1990","DOI:10.1016/B978-0-444-88074-1.50006-8"],"references":["229067733_Linear_Pattern_Matching_Algorithm","3083779_Algorithms_for_sliding_block_codes---An_application_of_symbolic_dynamics_to_information_theory","247491280_Sequences_Defined_by_Iterated_Morphisms","242942915_Weak_Second-Order_Arithmetic_and_Finite_Automata","240903849_Detection_of_periodicities_and_string-matching_in_real_time","226972884_Subshifts_of_finite_type_and_sofic_systems","225865226_Uniform_Tag_Seqences","225456570_Equivalence_of_topological_Markov_shifts","225144510_A_Logical_Calculus_of_the_Idea_Immanent_in_Nervous_Activity","220917273_Longest_Common_Factor_of_Two_Words","220544043_On_the_Base-Dependence_of_Sets_of_Numbers_Recognizable_by_Finite_Automata","220543899_Algebraic_Decision_Procedures_for_Local_Testability","3475998_The_Theory_of_Definite_Automata"]}