{"id":"267495016_Improvement_of_Students_Professional_Formation_Curriculums_to_Meet_the_Market_Work","abstract":"The idea of this paper is based on how to help the student and the educative centres to develop competitive curriculums, which must be flexible to adapt to the industrial needs of the companies and to the students group. The problem we faced was that, it is not the type of the specialized work that is done at the bigger companies, but the type of work given to the student to develop during his practice period. Taking Spain as an example, the numbers of small companies, called micro-pymes, are the majority. The 98.88% of the Spanish companies are pymes and the 53.9% of them are companies of only one worker. That's means that, students have the capability to create and work in the market, and such help from the educative centres to the students, to develop their Curriculums, become necessary to focus them in their abilities of work. So what we expect from these students, after creating their work in the market, taking into consideration that currently, and due to the elevated unemployment rate, because of the actual situation \"The world financial crises\", it is necessary a system that let the students with professional formation access to work. For that, we propose to establish a curricular system more specific and very flexible to adequate to the needs of the companies depending on the geographical environment of the country. We have always to take into account that the goal of the professional formation is the insertion of student's to work. (C) 2013 The Authors. Published by Elsevier Ltd.","authors":["Habib M. Fardoun","Antonio Paules Ciprés","Abdulfatah S Mashat"],"meta":["March 2014Procedia - Social and Behavioral Sciences 122:416-420","DOI:10.1016/j.sbspro.2014.01.1364"],"references":["236890573_Monitoring_Students_Moods_for_the_Detection_of_Weaknesses_in_Secondary_Schools","236890529_CSchool_-_DUI_for_Educational_System_using_Clouds","45087654_LAS_GRANDES_CIFRAS_DEL_FRACASO_Y_LOS_RIESGOS_DE_EXCLUSION_EDUCATIVA","28052504_Modelos_pedagogicos_en_los_sistemas_de_ensenanza_no_presencial_basados_en_nuevas_tecnologias_y_redes_de_comunicacion"]}