{"id":"267404445_IMMERSED_IN_THE_GAME_OF_SCIENCE_BELIEFS_EMOTIONS_AND_STRATEGIES_OF_NNES_SCIENTISTS_WHO_REGULARLY_PUBLISH_IN_ENGLISH","abstract":"Not all scientists or researchers need to communicate their research in English. However, those who do face a complexity of challenges as we discussed in an earlier publication where we examined the struggles of non-native English Speakers (NNES) to become engaged in international scientific fields conducted in English. There we argue that lack of experience and fluency in English impede their immersion in cutting edge science, but lack of immersion in cutting-edge science limits their experience in scientific English, impeding growth of fluency to support more complete, immersive participation. Thus, scientific success breeds linguistic success and linguistic success supports scientific success, in a version of the \"Matthew Effect\" by which the rich get richer and the poor get marginalized (Merton, 1968). Applied linguistics studies of the experience of NNES scientists writing in English for international publication have focused on novice scientists at the periphery of their fields who have not yet achieved success or fluency. However, there is very little avail-able research on NNES scientists who have managed, in spite of the well-documented problems, to succeed. In this current chapter, we explore more fully what it means for an NNES scientist to overcome linguistic and scientific challenges to become a successful published researcher in an English-dominant discipline. In particular, we study the psychological orientation that a group of successful NNES physicists and mathematicians working in Mexico have developed in the course of their careers. We find that they are deeply immersed and invested in the work of science. They strongly identify with their scientific careers, played out within an international community to which they contribute by their publications. We find that their self-reported confidence in their expertise is matched by a set of dispositions and orientations similar to those of immersed players of computer games.","authors":["Nancy Keranen","Fatima Encinas","Charles Bazerman"],"meta":["July 2012","DOI:10.37514/PER-B.2012.0452.2.22","In book: International Advances in Writing Research: Cultures, Places, Measures (pp.387-402)Chapter: IMMERSED IN THE GAME OF SCIENCE: BELIEFS, EMOTIONS, AND STRATEGIES OF NNES SCIENTISTS WHO REGULARLY PUBLISH IN ENGLISHPublisher: WAC Clearinghouse and Parlor PressEditors: C. Bazerman, C. Dean, J. Early, K. Lunsford, S. Null, P. Rogers, A. Stansell"],"references":["316996736_The_processing_demands_of_writing","269221875_Facilitated_Immersion_at_a_Distance_in_Second_Language_Scientific_Writing","301341066_Teaching_for_transfer_Fostering_generalization_in_learning","298852493_The_Matthew_Effect_in_Science","279235557_Narrative_Research_Reading_Analysis_and_Interpretation","266330024_Genre_media_and_communicating_to_learn_in_the_disciplines_Vygotsky_developmental_theory_and_North_American_genre_theory","246197693_First-Person_Methodologies_What_Why_How","232463578_The_flow_experience_and_its_significance_for_human_psychology","226010061_The_Psychology_of_Massively_Multi-User_Online_Role-Playing_Games_Motivations_Emotional_Investment_Relationships_and_Problematic_Usage","221518652_Investigating_computer_game_immersion_and_the_component_real_world_dissociation"]}