{"id":"267561557_Fingerprinting_Information_in_JavaScript_Implementations","abstract":"To date, many attempts have been made to fingerprint users on the web. These fingerprints allow browsing sessions to be linked together and possibly even tied to a user's identity. They can be used constructively by sites to supplement tra-ditional means of user authentication such as passwords; and they can be used destructively to counter attempts to stay anonymous online. In this paper, we identify two new avenues for browser fin-gerprinting. The new fingerprints arise from the browser's JavaScript execution characteristics, making them difficult to simulate or mitigate in practice. The first uses the innate performance signature of each browser's JavaScript engine, allowing the detection of browser version, operating system and microarchitecture, even when traditional forms of sys-tem identification (such as the user-agent header) are modi-fied or hidden. The second subverts the whitelist mechanism of the popular NoScript Firefox extension, which selectively enables web pages' scripting privileges to increase privacy by allowing a site to determine if particular domains exist in a user's NoScript whitelist. We have experimentally verified the effectiveness of our system fingerprinting technique using a 1,015-person study on Amazon's Mechanical Turk platform.","authors":["Keaton Mowery","Dillon Bogenreif","Scott Yilek","Hovav Shacham"],"meta":["May 2012"],"references":["221022225_Invasive_browser_sniffing_and_countermeasures","4238337_Cache_cookies_for_browser_authentication","2910678_Tor_The_Second-Generation_Onion_Router","228736466_Attacking_tor_at_the_application_layer","228401821_Busting_frame_busting_a_study_of_clickjacking_vulnerabilities_at_popular_sites","223151528_Remote_Timing_Attacks_are_Practical","221609770_Hot_or_not_Revealing_hidden_services_by_their_clock_skew","221394395_Browser_Fingerprinting_from_Coarse_Traffic_Summaries_Techniques_and_Implications","221260449_An_Analysis_of_Private_Browsing_Modes_in_Modern_Browsers","221023964_Protecting_browser_state_from_web_privacy_attacks","200110652_Exposing_private_information_by_timing_web_applications","28358486_Browser_Fingerprinting_from_Coarse_Traffic_Summaries","2441386_Timing_Attacks_on_Web_Privacy"]}