{"id":"267515366_Immersive_and_Collaborative_Data_Visualization_Using_Virtual_Reality_Platforms","abstract":"Effective data visualization is a key part of the discovery process in the\nera of big data. It is the bridge between the quantitative content of the data\nand human intuition, and thus an essential component of the scientific path\nfrom data into knowledge and understanding. Visualization is also essential in\nthe data mining process, directing the choice of the applicable algorithms, and\nin helping to identify and remove bad data from the analysis. However, a high\ncomplexity or a high dimensionality of modern data sets represents a critical\nobstacle. How do we visualize interesting structures and patterns that may\nexist in hyper-dimensional data spaces? A better understanding of how we can\nperceive and interact with multi dimensional information poses some deep\nquestions in the field of cognition technology and human computer interaction.\nTo this effect, we are exploring the use of immersive virtual reality platforms\nfor scientific data visualization, both as software and inexpensive commodity\nhardware. These potentially powerful and innovative tools for multi dimensional\ndata visualization can also provide an easy and natural path to a collaborative\ndata visualization and exploration, where scientists can interact with their\ndata and their colleagues in the same visual space. Immersion provides benefits\nbeyond the traditional desktop visualization tools: it leads to a demonstrably\nbetter perception of a datascape geometry, more intuitive data understanding,\nand a better retention of the perceived relationships in the data.","authors":["Ciro Donalek","George Djorgovski","Scott Davidoff","Alex Cioc"],"meta":["October 2014","DOI:10.1109/BigData.2014.7004282","SourcearXiv","Conference: 2014 IEEE International Conference on Big Data (Big Data)","Project: Immersive Analytics"],"references":["261130501_Feature_Selection_Strategies_for_Classifying_High_Dimensional_Astronomical_Data_Sets","260996196_Effects_of_VR_System_Fidelity_on_Analyzing_Isosurface_Visualization_of_Volume_Datasets","258727146_Flashes_in_a_Star_Stream_Automated_Classification_of_Astronomical_Transient_Events","235356781_The_MICA_Experiment_Astrophysics_in_Virtual_Worlds","234792774_WYSIWIS_revised_early_experiences_with_multiuser_interfaces","233762832_Effects_of_Stereo_and_Screen_Size_on_the_Legibility_of_Three-Dimensional_Streamtube_Visualization","319770818_Toward_a_theory_of_situation_awareness_in_dynamic_systems_Situation_awareness","247534012_Situation_awareness_in_dynamic_systems","243469288_Wysiwls_revised_early_experiences_with_multi-user_interfaces","242344320_4_Some_guidelines_for_conducting_a_cognitive_task_analysis"]}