{"id":"267502070_Automatic_Analysis_of_Facial_Affect_A_Survey_of_Registration_Representation_and_Recognition","abstract":"Automatic affect analysis has attracted great interest in various contexts including the recognition of action units and basic or non-basic emotions. In spite of major efforts, there are several open questions on what the important cues to interpret facial expressions are and how to encode them. In this paper, we review the progress across a range of affect recognition applications to shed light on these fundamental questions. We analyse the state-of-the-art solutions by decomposing their pipelines into fundamental components, namely face registration, representation, dimensionality reduction and recognition. We discuss the role of these components and highlight the models and new trends that are followed in their design. Moreover, we provide a comprehensive analysis of facial representations by uncovering their advantages and limitations; we elaborate on the type of information they encode and discuss how they deal with the key challenges of illumination variations, registration errors, head-pose variations, occlusions, and identity bias. This survey allows us to identify open issues and to define future directions for designing real-world affect recognition systems.","authors":["Evangelos Sariyanidi","Hatice Gunes","Andrea Cavallaro"],"meta":["October 2014IEEE Transactions on Pattern Analysis and Machine Intelligence","DOI:10.1109/TPAMI.2014.2366127"],"references":["319877813_Face_Recognition_by_Elastic_Bunch_Graph_Matching","320112472_Face_recognition_by_Elastic_Bunch_Graph_Matching","319770820_Histograms_of_Oriented_Gradients_for_Human_Detection","313556846_Sift_flow_Dense_correspondence_across_scenes_and_its_applications","312879599_The_expression_of_the_emotions_in_man_and_animals","311450635_Recognition_Action_Units_for_Facial_Expression_Analysis","310842463_Tied_factor_analysis_for_face_recognition_across_large_pose_differences","285058764_Receptive_fields_binocular_interaction_and_functional_architecture_in_the_cat's_visual_cortex","284478529_A_Social_Interactional_Theory_of_Emotions","284473673_Induced_disgust_happiness_and_surprise_An_addition_to_the_mmi_facial_expression_database"]}