{"id":"267676431_General_Interpolation_by_Polynomial_Functions_of_Distributive_Lattices","abstract":"For a distributive lattice L, we consider the problem of interpolating functions f : D → L defined on a finite set D ⊆ L\nn\n, by means of lattice polynomial functions of L. Two instances of this problem have already been solved.\nIn the case when L is a distributive lattice with least and greatest elements 0 and 1, Goodstein proved that a function f : {0,1}n\n→ L can be interpolated by a lattice polynomial function p : L\nn\n→ L if and only if f is monotone; in this case, the interpolating polynomial p was shown to be unique.\nThe interpolation problem was also considered in the more general setting where L is a distributive lattice, not necessarily bounded, and where D ⊆ L\nn\nis allowed to range over cuboids \\(D=\\left\\{ a_{1},b_{1}\\right\\} \\times\\cdots\\times\\left\\{ a_{n},b_{n}\\right\\} \\) with a\ni\n,b\ni\n∈ L and a\ni\n< b\ni\n. In this case, the class of such partial functions that can be interpolated by lattice polynomial functions was completely described.\nIn this paper, we extend these results by completely characterizing the class of lattice functions that can be interpolated by polynomial functions on arbitrary finite subsets D ⊆ L\nn\n. As in the latter setting, interpolating polynomials are not necessarily unique. We provide explicit descriptions of all possible lattice polynomial functions that interpolate these lattice functions, when such an interpolation is available.","authors":["Miguel Couceiro","Didier Dubois","Henri Prade","Rico Agnes"],"meta":["July 2012Communications in Computer and Information Science 299","DOI:10.1007/978-3-642-31718-7_36","Conference: International Conference on Information Processing and Management of Uncertainty in Knowledge-Based Systems"],"references":["302179072_Fuzzy_measures_and_fuzzy_integrals_a_survey_In_Fuzzy_Automata_and_Decision_Processes","239662875_Fuzzy_measures_and_fuzzy_integrals_A_survey","238353506_The_solution_of_equations_in_a_lattice","225035741_Introduction_to_Lattices_and_Order_-_2nd_Ed","222669494_Weighted_lattice_polynomials","222562905_Characterizations_of_discrete_Sugeno_integrals_as_polynomial_functions_over_distributive_lattices","222529298_On_Sugeno_integral_as_an_aggregation_function","220925336_Elicitation_of_Sugeno_Integrals_A_Version_Space_Learning_Perspective","220528457_Sugeno_integral_in_a_finite_Boolean_algebra","213879545_Introduction_to_Lattice_and_Order"]}