{"id":"267602321_Mathematical_Modelling_and_Finite_Element_Simulation_of_Pre-Bending_Stage_of_Three-Roller_Plate_Bending_Process","abstract":"Continuous three roller bending process is widely used in practice to bend the plates into cylinders. Bending load for plate material under bending is affected by plate thickness, width and shell diameter combinations. Maximum top roller load is encountered during the edge pre-bending stage as top roller is set at an offset distance from its mid position. Shell diameter, thickness and material for cylindrical structural element to be produced are fixed by design. Width of the plate for roller bending decides number of cylindrical segments required to achieve the designed shell length. Maximum pre-bending width depends on maximum top roller load imparting capacity. Looking to the above considerations, maximum width which can be pre-bend at limiting top roller load (for designed shell diameter, thickness and material combinations) specifies the capacity. Presented work aims at developing the mathematical model of top roller load for pre-bending. Top roller offset for pre-bending were calculated based on practical top roller pre-bending load data, for different grades of C-Mn steel plates (as per ASME sec II part-A). Based on these top roller offsets, finite element analysis (FEA) of pre-bending stage were performed using Hyperform LS-DYNA. Effect of co-efficient of friction at roller plate interfaces was analyzed. FE simulation of pre-bending of cladded plate (54 mm thick C-Mn steel plate of material grade SA-387Gr11Cl2 having 3 mm thick layer of stain less steel material grade SS-308) was performed. FEA load results were found in good agreement with the practical load results and can be used for capacity assessment and analysis of roller bending machines.","authors":["Anish Gandhi","Himanshu V. Gajjar","H. K. Raval"],"meta":["January 2008","DOI:10.1115/MSEC_ICMP2008-72454","Conference: ASME 2008 International Manufacturing Science and Engineering Conference collocated with the 3rd JSME/ASME International Conference on Materials and Processing"],"references":["279723530_Modelling_of_Elastic-Plastic_Bending_of_Beams_Using_a_Roller_Bending_Machine","275093040_The_Plastic_Bending_of_Beams_Considering_Die_Friction_Effects","248249072_Design_aspects_and_parametric_study_of_3-roll_heavy-duty_plate-bending_machines","245393448_The_bending_of_plate_using_a_three-roll_pyramid_type_plate_bending_machine","245096199_Theoretical_analysis_and_experimental_study_to_support_the_development_of_a_more_valuable_roll-bending_process"]}