{"id":"267664725_Distance_Geometry_Theory_Methods_and_Applications","abstract":"This volume is a collection of research surveys on the Distance Geometry Problem (DGP) and its applications. It will be divided into three parts: Theory, Methods and Applications. Each part will contain at least one survey and several research papers. The first part, Theory, will deal with theoretical aspects of the DGP, including a new class of problems and the study of its complexities as well as the relation between DGP and other related topics, such as: distance matrix theory, Euclidean distance matrix completion problem, multispherical structure of distance matrices, distance geometry and geometric algebra, algebraic distance geometry theory, visualization of K-dimensional structures in the plane, graph rigidity, and theory of discretizable DGP: symmetry and complexity. The second part, Methods, will discuss mathematical and computational properties of methods developed to the problems considered in the first chapter including continuous methods (based on Gaussian and hyperbolic smoothing, difference of onvex functions, semidefinite programming, branch-and-bound), discrete methods (based on branch-and-prune, geometric build-up, graph rigidity), and also heuristics methods (based on simulated annealing, genetic algorithms, tabu search, variable neighborhood search). Applications will comprise the third part and will consider applications of DGP to NMR structure calculation, rational drug design, molecular dynamics simulations, graph drawing and sensor network localization. This volume will be the first edited book on distance geometry and applications. The editors are in correspondence with the major contributors to the field of distance geometry, including important research centers in molecular biology such as Institut Pasteur in Paris. © 2013 Springer Science+Business Media New York. All rights reserved.","authors":["Antonio Mucherino","Carlile Lavor","Leo Liberti","Nelson Maculan"],"meta":["November 2013","DOI:10.1007/978-1-4614-5128-0","ISBN: 978-1-4614-5127-3"],"references":["282597937_Multidimensional_Scaling_II","330132118_Spheres_Unions_and_Intersections_and_Some_of_their_Applications_in_Molecular_Modeling","324466982_Rigid_and_Flexible_Frameworks","317315100_A_NEW_MEASURE_OF_GENETIC_IDENTITY_BETWEEN_POPULATIONS_OF_SEXUAL_AND_ASEXUAL_SPECIES","313638856_Nouvelles_methodes_pour_le_calcul_des_travures_reticulaires","312879591_Some_distance_properties_of_latent_root_and_vector_methods_used_in_multivariate_data_analysis","289240516_Theory_of_semidefinite_programming_for_sensor_network_localization","285981037_Global_continuation_for_distance_geometry_problems","285599593_A_Global_Geometric_Framework_for_Nonlinear_Dimensionality_Reduction","285599320_Laplacian_Eigenmaps_for_Dimensionality_Reduction_and_Data_Representation","281048932_Finding_Low-Energy_Homopolymer_Conformations_by_a_Discrete_Approach","280750305_Adaptive_Branching_in_iBP_with_Clifford_Algebra","279384963_Principal_Component_Analysis_and_Factor_Analysis","279255279_On_the_Discretization_of_Distance_Geometry_Problems","277291705_A_tractable_approximate_combinatorial_3d_rigidity_characterization"]}