{"id":"267625987_Near-Crash_Identification_in_a_Connected_Vehicle_Environment","abstract":"The main objective of this study was to identify near crashes in vehicle trajectory data with interdriver heterogeneity and situation dependency considered. Several efforts have been made to evaluate the effects of near-crash events on safety with the use of naturalistic driving data, driving simulators, and test tracks. However, these efforts have faced some challenges because the observations reflected only the equipped vehicles. The development of connected vehicle technology provided the essential data to study high-risk maneuvers in the entire traffic stream. In this study, two near-crash detection algorithms were proposed. One algorithm had its basis in fixed thresholds, while the other considered interdriver heterogeneity and estimates driver-specific thresholds. The models were tested against two NGSIM trajectory data sets. Initial results showed that consideration of driver preferences resulted in more realistic identification of near crashes than otherwise.","authors":["Alireza Talebpour","Hani S. Mahmassani","Fiorella Mete","Samer H. Hamdar"],"meta":["October 2014Transportation Research Record Journal of the Transportation Research Board 2424(2424):20-28","DOI:10.3141/2424-03","Projects: Vehicle Trajectories in Large-Scale Networks:  Analysis, Pattern Recognition, and ApplicationsTransportation System Safety: Behavior, Models, Application and Program Assessment"],"references":["275850991_Near_Crashes_as_Crash_Surrogate_for_Naturalistic_Driving_Studies","274409883_Multiregime_Sequential_Risk-Taking_Model_of_Car-Following_Behavior","260553298_Correlated_Parameters_in_Driving_Behavior_Models","256762161_Safety_First_Microsimulation_Approach_to_Assessing_Congestion_Effects_on_Risk_Experienced_by_Drivers","237188588_Future_directions_of_environmental_engineering_in_Canada","318586619_Crash_data_analyses_for_vehicle-to-infrastructure_communications_for_safety_applications","275456425_Descriptive_Analysis_of_Light_Vehicle-Heavy_Vehicle_Interactions_from_the_Light_Vehicle_Driver's_Perspective","270211407_Analysis_of_Naturalistic_Driving_Event_Data","245562132_Real-Time_Detection_of_Crash-Prone_Conditions_at_Freeway_High-Crash_Locations","241349912_Feasibility_of_Driver_Judgment_as_Basis_for_a_Crash_Avoidance_Database"]}