{"id":"267741672_The_effects_of_task_difficulty_novelty_and_the_size_of_the_search_space_on_intrinsically_motivated_exploration","abstract":"Devising efficient strategies for exploration in large open-ended spaces is one of the most difficult computational problems of intelligent organisms. Because the available rewards are ambiguous or unknown during the exploratory phase, subjects must act in intrinsically motivated fashion. However, a vast majority of behavioral and neural studies to date have focused on decision making in reward-based tasks, and the rules guiding intrinsically motivated exploration remain largely unknown. To examine this question we developed a paradigm for systematically testing the choices of human observers in a free play context. Adult subjects played a series of short computer games of variable difficulty, and freely choose which game they wished to sample without external guidance or physical rewards. Subjects performed the task in three distinct conditions where they sampled from a small or a large choice set (7 vs. 64 possible levels of difficulty), and where they did or did not have the possibility to sample new games at a constant level of difficulty. We show that despite the absence of external constraints, the subjects spontaneously adopted a structured exploration strategy whereby they (1) started with easier games and progressed to more difficult games, (2) sampled the entire choice set including extremely difficult games that could not be learnt, (3) repeated moderately and high difficulty games much more frequently than was predicted by chance, and (4) had higher repetition rates and chose higher speeds if they could generate new sequences at a constant level of difficulty. The results suggest that intrinsically motivated exploration is shaped by several factors including task difficulty, novelty and the size of the choice set, and these come into play to serve two internal goals-maximize the subjects' knowledge of the available tasks (exploring the limits of the task set), and maximize their competence (performance and skills) across the task set.","authors":["Adrien Baranes","Pierre-Yves Oudeyer","Jacqueline Gottlieb"],"meta":["October 2014Frontiers in Neuroscience 8(8):317","DOI:10.3389/fnins.2014.00317","SourcePubMed"],"references":["303621159_How_Self-Determined_Choice_Facilitates_PerformanceA_Key_Role_of_the_Ventromedial_Prefrontal_Cortex","260117876_The_Role_of_the_Striatum_in_Effort-Based_Decision-Making_in_the_Absence_of_Reward","258504591_Intersection_of_Effort_and_Risk_Ethological_and_Neurobiological_Perspectives","278706483_Intrinsically_Motivated_Learning_in_Natural_and_Artificial_Systems","262885201_Novelty_Enhances_Visual_Salience_Independently_of_Reward_in_the_Parietal_Lobe","262787932_Sins_of_omission_Children_selectively_explore_when_teachers_are_under-informative","261455709_The_Strategic_Student_Approach_for_Life-Long_Exploration_and_Learning","261293524_Development_of_goal-directed_action_selection_guided_by_intrinsic_motivations_An_experiment_with_children","259114564_How_Self-Determined_Choice_Facilitates_Performance_A_Key_Role_of_the_Ventromedial_Prefrontal_Cortex","257813843_Information-seeking_curiosity_and_attention_Computational_and_neural_mechanisms"]}