{"id":"267771708_The_Stochastic_Search_Network","abstract":"A fundamental difficulty when using neural networks applied to pattern recognition, is the problem of stimulus equivalence - the invariance of symbolic information independent of transformation within a search space. For example, symbolically, the letter A remains an A irrespective of its position, size or orientation within an image field. Adult humans can generally recognise patterns accurately, despite such transformations and distortions. Classically it has been hypothesised that this ability is due to a normalisation process that occurs before the classification process begins.\n\nOne criticism of the network paradigm has been that there is no clear mechanism by which such normalisation can occur, since at first sight such unstructured systems do not provide any mechanism for attention - the focussing of analysis onto a subset of a larger pattern. This chapter will describe two network solutions to this normalisation process: Hinton Mapping and Stochastic Networks, give an introduction to the analysis of Stochastic Networks and illustrate their use within the British Telecom CONNEX project.\n\nThe problem of stimulus equivalence is a specific example of a best fit constraint satisfaction search, where the target pattern has been mapped into the search space, using translational, rotational or scale transformations. The goal of a system that can solve such problems is to ascertain the inverse mapping from search space to pattern. For example, in the situation where a letter has been rotated in a visual field, the inverse mapping would be the angle of rotation q, if it had been translated then the inverse mapping would be its cartesian coordinates X,Y, etc. One solution to this problem is a technique described by Hinton, summarised below.","authors":["John Mark Bishop","Philip Hilaire Torr"],"meta":["January 1992","DOI:10.1007/978-94-011-2360-0_24","In book: Neural Networks for Vision, Speech & Natural Language (pp.370-388)Publisher: Chapman HallEditors: Lingard R, Myers DJ, Nightingale C"],"references":["233758476_The_Minchinton_Cell_-Analogue_input_to_the_n-Tuple_Net","3576975_Stochastic_searching_networks","247405900_Retrieving_General_Knowledge_from_Stored_Knowledge_of_Specifics","243712656_Retrieving_general_and_specific_information_from_stored_knowledge_af_specifics","242484906_The_theory_of_stochastic_processes_Reprint","235260318_WISARDa_radical_step_forward_in_image_recognition","230875859_Pattern_Recognition_and_Reading_by_Machine","228108149_The_Theory_of_Stochastic_Processes","224398408_Guide_to_pattern_recognition_using_random-access_memories","220812197_A_Parallel_Computation_that_Assigns_Canonical_Object-Based_Frames_of_Reference"]}