{"id":"267742849_The_Metacaspase_Mca1p_has_a_Dual_Role_in_Farnesol-induced_Apoptosis_in_Candida_albicans","abstract":"Manipulating the apoptotic response of Candida albicans may help in the control of this opportunistic pathogen. The metacaspase Mca1p has been described as a key protease for apoptosis in C. albicans but little is known about its cleavage specificity and substrates. We therefore initiated a series of studies to describe its function. We used a strain disrupted for the MCA1 gene and compared its proteome to that of a wild-type isogenic strain, in the presence and absence of a known inducer of apoptosis, the quorum-sensing molecule farnesol. Label-free and TMT labeling quantitative proteomic analyses showed that both mca1 disruption and farnesol treatment significantly affected the proteome of the cells. The combination of both conditions led to an unexpected biological response: the strong overexpression of proteins implicated in the general stress. We studied sites cleaved by Mca1p using native peptidomic techniques, and a bottom-up approach involving GluC endoprotease: there appeared to be a K/R substrate specificity in P1 and a D/E specificity in P2. We also found 80 potential substrates of Mca1p, implicated in protein folding, protein aggregate resolubilization, glycolysis and a number of mitochondrial functions. These various results indicate that Mca1p is involved in a limited and specific proteolysis program triggered by apoptosis. One of the main functions of Mca1p appears to be the degradation of several major Heat Shock Proteins, thereby contributing to weakening cellular defenses and amplifying the cell death process. Finally, Mca1p appears to contribute significantly to the control of mitochondria biogenesis and degradation. Consequently, Mca1p may be a link between the extrinsic and the intrinsic programmed cell death pathways in C. albicans.","authors":["Thibaut Léger","Camille Garcia","Marwa Ounissi","Gaëlle Lelandais"],"meta":["October 2014Molecular & Cellular Proteomics 14(1)","DOI:10.1074/mcp.M114.041210","SourcePubMed"],"references":["260611492_Crystal_Structures_of_Nucleotide-Free_and_Glutathione-Bound_Mitochondrial_ABC_Transporter_Atm1","260611491_Structural_Basis_for_Heavy_Metal_Detoxification_by_an_Atm1-Type_ABC_Exporter","256072446_The_Arabidopsis_Metacaspase9_Degradome","250925179_Candida_albicans_Czf1_and_Efg1_Coordinate_the_Response_to_Farnesol_during_Quorum_Sensing_White-Opaque_Thermal_Dimorphism_and_Cell_Death","231815133_Hsp90_Is_Involved_in_Apoptosis_of_Candida_albicans_by_Regulating_the_Calcineurin-Caspase_Apoptotic_Pathway","225064820_The_Heat-Induced_Molecular_Disaggregase_Hsp104_of_Candida_albicans_Plays_a_Role_in_Biofilm_Formation_and_Pathogenicity_in_a_Worm_Infection_Model","51970163_Farnesol-Induced_Apoptosis_in_Candida_albicans_Is_Mediated_by_Cdr1-p_Extrusion_and_Depletion_of_Intracellular_Glutathione","277446737_A_Yeast_Mutant_Showing_Diagnostic_Markers_of_Early_and_Late_Apoptosis","235396742_The_role_of_Yca1_in_Proteostasis_Yca1_Regulates_the_Composition_of_the_Insoluble_Proteome","51875471_Alanine_scanning_of_all_cysteines_and_construction_of_a_functional_cysteine-less_Cdr1p_a_multidrug_ABC_transporter_of_Candida_albicans"]}