{"id":"267781197_Automatic_Detection_System_for_the_Identification_of_Plants_Using_Herbarium_Specimen_Images","abstract":"An automatic leaves image identification system for endemic plants in Sri Lanka using neural networks is described in this study. Stemonoporus, a genus of Dipterocarpaceae which has about 30 species of plants was selected for the proposed system. National Herbarium specimens were used to obtain the images. Digital pictures of leaves were enhanced, segmented, and a set of features were extracted from the image. The most discriminating set of features were selected and then used as inputs to a Probabilistic Neural Network (PNN) which is used in MATLAB classifier and tests were performed to identify the best system. Several classification models were assessed via cross-validation in order to select the leaves in an image and identify the correct one. The results suggested that, leaf width, length, perimeter and area related features can be used as factors for prediction, and that machine vision systems lead to successful prediction of targets when fed with appropriate information. The overall classification accuracy utilizing the proposed technique for the test set was 85 %, whereas that feature extraction obtained was 95 %.","authors":["Darshani Wijesinghe","Faiz Marikar"],"meta":["September 2012Tropical Agricultural Research 23(1)","DOI:10.4038/tar.v23i1.4630"],"references":["261570226_A_Field_Guide_to_the_Common_Trees_and_Shrubs_of_Sri_Lanka","255665300_Texture-Based_Weed_Classification_Using_Gabor_Wavelets_and_Neural_Network_for_Real-time_Selective_Herbicide_Application_s","250719155_Weed_image_classification_using_Gabor_wavelet_and_gradient_field_distribution","345677445_Data_Mining_A_Tutorial-Based_Primer","311374481_Data_Mining_A_Tutorial-Based_Primer_Second_Edition","306150595_Neural_Networks_A_Comprehensive_Foundation","274085149_A_Revised_Handbook_to_the_Flora_of_Ceylon_Vol_7","235890195_Digital_Image_Processing","228083862_Digital_Image_Processing","226472736_Identification_of_broad-leaved_dock_Rumex_obtusifoliusL_on_grassland_by_means_of_digital_image_processing"]}