{"id":"267756231_Coiling_of_elastic_rods_on_rigid_substrates","abstract":"We investigate the deployment of a thin elastic rod onto a rigid substrate and study the resulting coiling patterns. In our approach, we combine precision model experiments, scaling analyses, and computer simulations toward developing predictive understanding of the coiling process. Both cases of deposition onto static and moving substrates are considered. We construct phase diagrams for the possible coiling patterns and characterize them as a function of the geometric and material properties of the rod, as well as the height and relative speeds of deployment. The modes selected and their characteristic length scales are found to arise from a complex interplay between gravitational, bending, and twisting energies of the rod, coupled to the geometric nonlinearities intrinsic to the large deformations. We give particular emphasis to the first sinusoidal mode of instability, which we find to be consistent with a Hopf bifurcation, and analyze the meandering wavelength and amplitude. Throughout, we systematically vary natural curvature of the rod as a control parameter, which has a qualitative and quantitative effect on the pattern formation, above a critical value that we determine. The universality conferred by the prominent role of geometry in the deformation modes of the rod suggests using the gained understanding as design guidelines, in the original applications that motivated the study.","authors":["Khalid Jawed","Fang Da","Jungseock Joo","Eitan Grinspun"],"meta":["September 2014Proceedings of the National Academy of Sciences 111(41)","DOI:10.1073/pnas.1409118111","SourcePubMed"],"references":["286143047_Submarine_cables_and_the_oceans_Connecting_the_world","274356466_Submarine_Cable_Kink_Analysis","260442625_Shapes_of_a_Suspended_Curly_Hair","258797610_Continuation_of_equilibria_and_stability_of_slender_elastic_rods_using_an_asymptotic_numerical_method","255773492_Contorting_a_heavy_and_naturally_curved_elastic_rod","313595837_Submarine_Cable_Kink_Analysis","270196524_A_Thread_across_the_Ocean_The_Heroic_Story_of_the_Transatlantic_Cable","268491201_Elasticity_and_geometry_From_hair_curls_to_the_non-linear_response_of_shells_With_a_foreword_by_John_W_Hutchinson","263534285_A_Thread_across_the_Ocean_-_The_Heroic_Story_of_the_Transatlantic_Cable","259124423_Pattern_Formation_and_Dynamics_in_Nonequilibrium_Systems"]}