{"id":"267841746_MODELAGEM_MATEMATICA_O_QUE_E_POR_QUE_COMO","abstract":"Resumo Nesse artigo, apresento algumas idéias teóricas sobre Modelagem na perspectiva da Educação Matemática. Usando exemplos de sala de aula e colocando ênfase sobre aspectos sócio-culturais, Modelagem é relacionada a problemas com referência na realidade. A integração de Modelagem no currículo escolar também é discutida. Abstract Mathematical Modelling: what is? Why? How? In this paper, I present some theoretical ideas about modelling in mathematics education. Using examples from classrooms and putting emphasis on socio-cultural aspects, modelling is related to problems that are rooted in reality. The integration of modelling into the mathematics curriculum is also discussed. Para início de conversa... Modelagem Matemática tem sido o foco de minha atenção nos últimos anos. Tenho desenvolvido atividades dessa natureza em minhas aulas, acompanhado outros professores e conduzido investigações. Nessas práticas, muitos colegas me perguntam sobre o tema: o que é Modelagem? Por que fazer Modelagem? Como fazer Modelagem? Esse artigo é justamente uma tentativa de oferecer subsídios para as pessoas compreenderem uma maneira (e não a maneira) de entender Modelagem na perspectiva da Educação Matemática Muitas vezes, Modelagem é conceituada, em termos genéricos, como a aplicação de matemática em outrás áreas do conhecimento, o que, a meu ver, é uma limitação teórica. Dessa forma, Modelagem é um grande 'guarda-chuva', onde cabe quase tudo. Com isso, não quero dizer que exista a necessidade de se ter fronteiras claras, mas de se ter maior clareza sobre o que chamamos de Modelagem.","authors":["Jonei Barbosa"],"meta":[],"references":["304274788_GALBRAITH_PL_Modelling_teaching_and_reflecting_What_I_have_learned","314589556_Guide_to_Mathematical_Modelling","301051444_Issues_and_Problems_of_Research_on_the_Teaching_and_Learning_of_Applications_and_Modelling","301051299_Mathematics_Before_or_Through_Applications_Top-Down_and_Bottom-Up_Understandings_of_Linear_and_Exponential_Functions","248129486_Towards_a_Philosophy_of_Critical_Mathematics_Education","232857619_Reflective_knowledge_Its_relation_to_the_mathematical_modelling_process","226782152_Applied_mathematical_problem_solving_modelling_applications_and_links_to_other_subjects-State_trends_and_issues_in_mathematics_instruction","27478592_Continuous_In-Service_Professional_Development_of_Teachers_and_School_Change_Lessons_From_Mexico"]}