{"id":"267804545_Vector_Addition_Systems_Reachability_Problem_A_Simpler_Solution","abstract":"The reachability problem for Vector Addition Systems (VASs) is a central problem of net theory. The general problem is known to be decidable by algorithms based on the classical Kosaraju-Lambert-Mayr-Sacerdote-Tenney decomposition (KLMTS decomposition). Recently from this decomposition, we deduced that a final configuration is not reachable from an initial one if and only if there exists a Presburger inductive invariant that contains the initial configura-tion but not the final one. Since we can decide if a Preburger formula denotes an inductive invariant, we deduce from this result that there exist checkable certifi-cates of non-reachability in the Presburger arithmetic. In particular, there exists a simple algorithm for deciding the general VAS reachability problem based on two semi-algorithms. A first one that tries to prove the reachability by enumerating fi-nite sequences of actions and a second one that tries to prove the non-reachability by enumerating Presburger formulas. In another recent paper we provide the first proof of the VAS reachability problem that is not based on the KLMST decom-position. The proof is based on the notion of production relations that directly proves the existence of Presburger inductive invariants. In this paper we propose new intermediate results simplifying a bit more this last proof.","authors":["Jérôme Leroux"],"meta":["June 2012"],"references":["220287072_Decidability_Issues_for_Petri_Nets_-_a_survey","256555232_A_structure_to_decide_reachability_in_Petri_nets","228057867_Theory_of_Linear_and_Integer_Programming","221591746_An_Algorithm_for_the_General_Petri_Net_Reachability_Problem","221591022_Decidability_of_Reachability_in_Vector_Addition_Systems_Preliminary_Version","221590481_The_Decidability_of_the_Reachability_Problem_for_Vector_Addition_Systems_Preliminary_Version","221443134_The_General_Vector_Addition_System_Reachability_Problem_by_Presburger_Inductive_Invariants","220836171_Vector_Addition_System_Reachability_Problem_A_Short_Self-Contained_Proof","220430782_The_Complexity_of_the_Finite_Containment_Problem_for_Petri_Nets","220248353_Bouziane's_transformation_of_the_Petri_net_reachability_problem_and_incorrectness_of_the_related_algorithm","220152940_Decidability_of_a_Temporal_Logic_Problem_for_Petri_Nets","220151637_On_the_Reachability_Problem_for_5-Dimensional_Vector_Addition_Systems","38346841_Semigroups_Presburger_formulas_and_languages","3784999_A_Primitive_Recursive_Algorithm_for_the_General_Petri_Net_Reachability_Problem"]}