{"id":"267875936_GRASP_with_path_relinking_for_the_orienteering_problem","abstract":"In this paper, we address an optimization problem resulting from the combination of the well-known travelling salesman and knapsack problems. In particular, we target the orienteering problem, originated in the context of sport, which consists of maximizing the total score associated with the vertices visited in a path within the available time. The problem, also known as the selective travelling salesman problem, is NP-hard and can be formulated as an integer linear program. Since the 1980s, several solution methods for this problem have been developed and applied to a variety of fields, particularly in routing and tourism. We propose a heuristic method—based on the Greedy Randomized Adaptive Search Procedure (GRASP) and the Path Relinking methodologies—for finding approximate solutions to this optimization problem. We explore different constructive methods and combine two neighbourhoods in the local search of GRASP. Our experimentation with 196 previously reported instances shows that the proposed procedure obtains high-quality solutions employing short computing times.","authors":["Vicente Campos","Rafael Marti","Jesús Sánchez-Oro Calvo","Abraham Duarte"],"meta":["December 2014Journal of the Operational Research Society 65(12)","DOI:10.1057/jors.2013.156"],"references":["230856233_Heuristic_Methods_Applied_to_Orienteering","228346477_Tabu_Search","226136659_A_Hybrid_Heuristic_for_the_p-Median_Problem","225117596_Scatter_search_for_the_cutwidth_minimization_problem","265170130_Multiobjective_GRASP_with_path_relinking","223760907_A_Path_Relinking_approach_for_the_Team_Orienteering_Problem","223564230_A_guided_local_search_metaheuristic_for_the_team_orienteering_problem","222416766_A_tabu_search_approach_to_an_urban_transport_problem_in_northern_Spain","222397986_GRASP_and_path_relinking_for_the_max-min_diversity_problem","222236796_A_fast_and_effective_heuristic_for_the_orienteering_problem"]}