{"id":"267828647_LETRAMENTO_DIGITAL_E_FORMACAO_DE_PROFESSORES","abstract":"RESUMO: Este artigo aborda o letramento digital no interior da discussão sobre a forma-ção de professores, reportando-se às experiências construídas em um grupo de pesqui-sa orientado pela perspectiva psicológica histórico-cultural. Apresentadas algumas defi-nições de letramento digital, reflete-se sobre os desafios postos à escola pelo confronto com as novas práticas de leitura e escrita propiciadas pelos usos do computador e da internet. Em seguida, analisa-se como, em sua formação inicial e continuada, os profes-sores são preparados para a inserção dessas tecnologias em suas práticas pedagógicas e para compreenderem o letramento digital de seus alunos. Ao final, situa-se o professor na era da internet, em seu lugar insubstituível de mediador e problematizador do conhe-cimento, que adota uma posição aberta e ao mesmo tempo crítica diante do que essa tec-nologia digital oferece. Palavras-chave: Letramento Digital; Escola; Formação de Professores. DIGITAL LITERACY AND TEACHER TRAINING ABSTRACT: This article has approached the digital literacy in the internal discussion on teacher training, reporting the experiences constructed in a research group guided through the psychological historical-cultural perspective. Having presented some defini-tions of digital literacy, we could reflect upon the challenges posed to the educational system by the confrontation with new reading and writing practices made possible by the use of computers and the internet. Next, we analyzed how teachers, in their initial and continued training program, are prepared to the insertion of these technologies in their pedagogical practices and how to understand their student's digital literacy. At the end, teachers are placed in the internet age, in their irreplaceable task as knowledge mediator and questioner, adopting an open position, and, at the same time, a critical one, on the face of what this digital technology offers.","authors":["Teresa Maria","Freitas"],"meta":[],"references":["242229367_Letramentos_Digitais_e_Formacao_de_Professores","26357184_Novas_Praticas_de_Leitura_e_Escrita_Letramento_na_Cibercultura"]}