{"id":"267979576_Route_Guidance_Bridging_System_and_User_Optimization_in_Traffic_Assignment","abstract":"In this paper we study the problem of the assignment of road paths to ve-hicles. Due to the assumption that a low percentage of vehicles follow the routes proposed by route guidance systems (RGS) and the increase of the use of the same, the conventional RGSs might shortly result obsolete. Assuming a complete road network information at the disposal of RGSs, their proposed paths are related with user optimization which in general can be arbitrarily more costly than the system optimum. However, the user optimum is fair for the drivers of the same Origin-Destination (O-D) pair but it doesn't guarantee fairness for different O-D pairs. Contrary, the system optimum can produce unfair assignments both for the vehicles of the same as of different O-D pairs. This is the reason why, in this paper, we propose an optimization model which bridges this gap between the user and traffic system optimum, and propose a new mathematical programming formulation based on Nash Welfare optimization which results in a good egalitarian and utilitarian welfare for all O-D pairs. To avoid the issues with the lack of robustness related with the centralized implementation, the proposed model is highly distributed. We test the solution approach through simulation and compare it with the conventional user-and system-optimization.","authors":["Marin Lujak","Stefano Giordani","S. Ossowski"],"meta":["September 2014Neurocomputing 151","DOI:10.1016/j.neucom.2014.08.071"],"references":["271746245_A_review_on_agent-based_technology_for_traffic_and_transportation","331672869_A_Decentralized_Scheme_for_Real-Time_Route_Guidance_in_Vehicular_Traffic_Networks","290316226_Multiagent_learning_on_traffic_lights_control_Effects_of_using_shared_information","287012375_Worst-case_equilibria_in_Symposium_on_Theoretical_Aspects_of_Computer_Science","265716851_Voronoi_Diagrams_and_Delaunay_Triangulations","265315954_Algorithms_games_and_the_internet_extended_abstract","261801728_System_optimal_dynamic_traffic_assignment_Properties_and_solution_procedures_in_the_case_of_a_many-to-one_network","260139626_On_the_Efficiency-Fairness_Trade-off","252125583_Mathematical_and_Computational_Models_for_Congestion_Charging","243771558_Network_Optimization_Continuous_and_Discrete_Models"]}