{"id":"267983125_Julia_A_Fresh_Approach_to_Numerical_Computing","abstract":"Bridging cultures that have often been distant, Julia combines expertise from the diverse fields of computer science and computational science to create a new approach to numerical computing. Julia is designed to be easy and fast. Julia questions notions generally held as “laws of nature” by practitioners of numerical computing:\n1. High-level dynamic programs have to be slow,\n2. One must prototype in one language and then rewrite in another language for speed or deploy- ment, and\n3. There are parts of a system for the programmer, and other parts best left untouched as they are built by the experts.\nWe introduce the Julia programming language and its design — a dance between specialization and abstraction. Specialization allows for custom treatment. Multiple dispatch, a technique from computer science, picks the right algorithm for the right circumstance. Abstraction, what good computation is really about, recognizes what remains the same after differences are stripped away. Abstractions in mathematics are captured as code through another technique from computer science, generic programming.\nJulia shows that one can have machine performance without sacrificing human convenience.","authors":["Jeff Bezanson","Alan Edelman","Stefan Karpinski","Viral B. Shah"],"meta":["July 2015SIAM Review","DOI:10.1137/141000671","SourcearXiv","Project: Julia - A fresh approach to numerical computing"],"references":["321621456_The_Grammar_of_Graphics","285689927_The_best_of_the_20th_century_Editors_name_Top_10_Algorithms","283620269_Abstraction_in_technical_computing","268492685_Engineering_and_Scientific_Computing_with_Scilab","267933178_Interactive_notebooks_Sharing_the_code","265486173_Interactive_Supercomputing's_Star-P_Platform_Parallel_MATLAB_and_MPI_Homework_Classroom_Study_on_High_Level_Language_Productivity_Productivity_through_High_Level_Infrastructure_Star-P_Architecture","259151410_Computing_in_Operations_Research_Using_Julia","258139318_Parallel_Programmability_and_the_Chapel_Language","243103007_The_Grammar_of_GraphicsThe_Grammar_of_Graphics_2nd_ed","234808845_Octave_A_Free_High-Level_Language_for_Mathematics"]}