{"id":"267979739_Fair_route_guidance_Bridging_system_and_user_optimization","abstract":"In this paper we study the problem of the assignment of road paths to vehicles. If we assume available\nthe real-time road network information, then (self-concerned) vehicles select paths in a way related to user optimization which results in Wardrop equilibrium. The latter, even though fair for the vehicles of the same Origin-Destination (O-D) pair, in general can be arbitrarily more costly than the system optimum.\nSystem optimization, on the other hand, can produce unfair assignments both for the vehicles of the same as of different O-D pairs. To surmount the performance issue of the user- in respect to the system-optimization while considering the fairness issues, we propose a MAS-based distributed optimization model for path assignment to vehicles from the same and different OD pairs at two levels. On the upper level, the proposed model optimizes the overall O-D pairs’ Nash Welfare with the fairness related constraints while on the lower level, for every O-D pair separately, paths are assigned to individual vehicles through the auction algorithm. We test the solution approach through simulation, compare it with the conventional user- and system optimization, and thus demonstrate that it results in fair and globally efficient path-vehicle assignments.","authors":["Marin Lujak","Stefano Giordani","S. Ossowski"],"meta":["October 2014","DOI:10.1109/ITSC.2014.6957885","Conference: The IEEE Conference on Intelligent Transportation Systems (ITSC 2014)At: Qingdao, China"],"references":["271746245_A_review_on_agent-based_technology_for_traffic_and_transportation","245558581_System_Optimal_Time-Dependent_Path_Assignment_and_Signal_Timing_in_Traffic_Network","232859156_Competitive_cooperative_and_Stackelberg_congestion_pricing_for_multiple_regions_in_transportation_networks","228819825_Multicommodity_flows_on_road_networks","227555985_Wardrop_Equilibria","287012375_Worst-case_equilibria_in_Symposium_on_Theoretical_Aspects_of_Computer_Science","261801728_System_optimal_dynamic_traffic_assignment_Properties_and_solution_procedures_in_the_case_of_a_many-to-one_network","251824281_Dynamic_User_Equilibrium_Traffic_Assignment_Model_Considered_as_a_Discrete_Optimal_Control_Problem","243771558_Network_Optimization_Continuous_and_Discrete_Models","242042577_Choice-Consistent_Resolutions_of_the_Eciency-Equity_Trade-O"]}