{"id":"267986410_PROJETO_LIRA_-LIVRO_INTERATIVO_COM_REALIDADE_AUMENTADA","abstract":"This paper presents the project LIRA -Interactive Book using Augmented Reality, powering the use of the conventional book. In the augmented reality environment implemented by ARToolKit software, the book receives further elements such as sound and 3D animated images, motivating people. 1 Keywords -augmented reality, virtual reality, interaction, interactive book. . I. INTRODUÇÃO A comunicação tem sido, desde os primórdios da origem do homem como ser inteligente, objeto de desenvolvimento natural através dos tempos. Quer tenha sido mediante desenhos, hieróglifos ou a própria língua falada, é através do recurso da comunicação que permitiu ao ser humano desenvolver-se nas mais diferentes áreas. Levando em conta que o livro impresso é a forma mais utilizada pelo homem para sua instrução há vários séculos, o presente trabalho tem por objetivo principal estimular o processo de leitura, de tal forma que este seja o mais proveitoso, atraente e eficiente possíveis. Relacionados ao campo da Realidade Aumentada (RA), vários são os projetos espalhados pelo mundo. Dentre alguns conhecidos, é possível destacar o Magic Book [4], resultado de um trabalho colaborativo entre várias instituições, sendo uma delas a Universidade de Washington. O livro foi visto por muitas pessoas durante o SIGGRAPH 2000, ocorrido no estado da Lousiana, USA. A figura 1 mostra uma aplicação do MagicBook. Outro livro envolvendo RA, visto por mais de 400 mil pessoas durante alguns meses na Nova Zelândia, foi o BlackMagic [5]. Através de um óculos especial, o livro conta a história das Copas das Américas. Diferentemente de um livro comum, através deste é possível, além de ler, também \"assistir\" a história, uma vez que esta é narrada em partes, através de áudio e imagens.","authors":["Francisco César De Oliveira","Ricardo Recchia","Claudio Kirner"],"meta":[],"references":["228693539_Augmented_reality_videoconferencing_for_collaborative_work","254221974_Interactive_Entertainment_Systems_Using_Tangible_Cubes"]}