{"id":"267939164_Disciplinary_Multidisciplinary_Interdisciplinary_-Concepts_and_Indicators","abstract":"Introduction The production of knowledge is dominantly organized in disciplines. At the same time, multidisciplinary and interdisciplinary research is developing at the boundaries of the scientific disciplines. In this paper we compare disciplinary and non-disciplinary forms of knowledge production in terms of communication patterns. We will suggest an indicator for measuring the degree of interdisciplinarity, and this allows us to evaluate the development of interdisciplinary fields. The indicator is based on the patterns and intensity of the knowledge streams between research fields. The communication of knowledge within a disciplinary field is expected to differ from the communication of knowledge within a non-disciplinary field. The same holds for the communication between a disciplinary and a non-disciplinary research field with their respective scientific environments. Clarifying these patterns of knowledge communication improves our understanding of the nature and dynamics of non-disciplinary research, and we will illustrate that interdisciplinary fields develop towards disciplinary patterns. Disciplinarity and interdisciplinarity Interdisciplinarity is an important and a complex issue. It is important as modern society increasingly demands application-oriented knowledge, and the usability of scientific knowledge generally requires the combination and integration of knowledge form various scientific disciplines. Traditionally, the disciplines have been very dominant in the organization of the science system, in the reward system, and in the career system. Nevertheless, funding agencies are increasingly stressing the social relevance of research results, and consequently a new mode of application-oriented research is emerging, on top of traditional academic research. In other words, the science system is not only growing in size, but its structure and functioning are changing too: the locus of research, the patterns of collaboration, and the aims of the scientific enterprise. Gibbons et al (1994) analyzed these changes by contrasting two modes of knowledge production, and the distinction between disciplinarity and interdisciplinarity is in the core of their approach. The differences between the two modes can be summarized as follows. Mode 1 is the production of traditional 'disciplinary science', in which the academic interest in 'pure' knowledge prevails. The aim is to produce theoretical knowledge of (physical and human) nature. The locus of Mode 1 is the university organized along disciplinary lines in faculties and departments. Consequently it is homogeneous in terms of organizational structures and practitioners, it is hierarchical, and relatively stable. Quality control is internal by peer review, and based on the journal system. In contrast, Mode 2 is interdisciplinary and application-oriented knowledge production. The focus is not so much on discovering 'laws of nature' but o n studying artifacts and the operation of complex systems. Examples are among others computer science, chemical engineering, and biotechnology. Mode 2 is heterogeneous, as a wider set of organizations and types of researchers are involved, operating in specific contexts on specific problems. Various different organizational forms co-exist within Mode 2, and research is not exclusively based in universities. The system of quality control is broader, and not only based on peer review of academic papers, and includes usability and social accountability. In that sense Mode 2 is heterarchical. Mode 2 knowledge production finds its roots in the intimate interaction between information and communication technologies (ICT), and advanced scientific and technological research and innovation. It is reflected and reinforced by large application-oriented and collaborative transnational research programs like the EU framework programs. Mode 2 is growing in importance, but not supplanting Mode 1 research, as it remains dependent on the development of disciplinary knowledge.","authors":["Peter Van den Besselaar","Gaston Heimeriks"],"meta":["January 2001"],"references":[]}