{"id":"267994775_Uso_y_abuso_de_la_voz_pasiva_en_el_lenguaje_medico_escrito","abstract":"Qué es la voz pasiva? Un paseo por la ignota selva gramatical La voz o diátesis es una categoría gramatical del verbo que indica si el sujeto del proceso verbal es exterior o interior a éste. Las dos voces más importantes en las lenguas moder-nas son la activa, en la cual se expresa que el sujeto realiza la acción del verbo, y la pasiva, en la que el sujeto gramatical sufre o recibe la acción ejecutada por otro. La relación lógica entre sujeto y complemento no se modifica porque la oración con que se exprese sea activa o pasiva 1 . Entre el médico recetó un antibiótico y un antibiótico fue recetado por el mé-dico, no hay diferencia en cuanto a la relación que entre sí guardan el médico y el antibiótico. En la segunda oración hemos convertido el complemento en sujeto gramatical y el sujeto en ablativo agente, pero no hay duda sobre quién ha realizado la acción. Se distinguen dos formas pasivas: la perifrástica y la prono-minal. Voz pasiva propia o perifrástica 1-4 Cuando hablamos de voz pasiva sin más, por lo general nos referimos a la que se forma con el participio del verbo que expresa la acción y el verbo ser como auxiliar (perífrasis ver-bal ser + participio). En la construcción pasiva, el participio concierta en género y número con el sujeto: las crisis epilép-ticas fueron descritas ya por Hipócrates. Esta construcción permite expresar el contenido de una ora-ción transitiva (la que lleva un objeto o complemento directo) cuando no se puede -por ser desconocido-o no se quiere -por el motivo que sea-nombrar el sujeto que realiza la ac-ción, o bien cuando se prefiere enfocar la atención sobre el objeto directo de la oración activa dándole el papel prepon-derante de sujeto gramatical. En castellano, la forma de hablar espontánea prefiere con gran diferencia la voz activa. El uso de la pasiva con ser ha disminuido mucho en nuestra lengua en relación con su uso latino. La influencia humanística y culta lo mantuvo, pero el incremento de las construcciones con sentido pasivo conse-guidas con el signo se, creciente hasta hoy, ha restringido más y más su uso. Como veremos en el segundo apartado, la pasiva perifrástica conoce en la lengua científica y técnica una particular renovación por influjo del inglés 5 .","authors":["Fernando A. Navarro","Francisco Hernández","Lydia Rodríguez-Villanueva","Servicio De"],"meta":[],"references":["324393041_Gramatica_espanola","324308285_Diccionario_de_uso_del_espanol","48071792_Curso_Superior_de_Sintaxsis_Espanola","40945902_Manual_de_espanol_urgente","31614149_Diccionario_de_dudas_y_dificultades_de_la_lengua_espanola_M_Seco","21547242_The_use_of_the_first_person_in_academic_writing_Objectivity_language_and_gatekeeping","20353978_Portrait_of_the_scientist_as_a_frustrated_writer","16077415_Bad_language"]}