{"id":"267919829_Chunk-based_Grammar_Checker_for_Detection_Translated_English_Sentences","abstract":"Machine Translation systems expect target language output to be grammatically correct within the frame of proper grammatical category. In Myanmar-English statistical machine translation system, the target language output (English) can often be ungrammatical. To solve this need, we propose an ongoing chunk-based grammar checker for translated English sentences. Most of the typical grammar checkers can detect ungrammatical sentences and seek for what error it is. However, they often fail to detect grammar errors for translated English sentences such as missing words. Therefore, we intend to develop a grammar checker by using trigram language model and rule based model. The system identifies the chunk types and generates context free grammar (CFG) rules for recognizing grammatical relations of chunks. In this paper, we present an overview of the current research being carried out three main functions: detecting sentence patterns in chunk types, analyzing chunk errors and correcting the errors. We hope that it encourages improving the translation quality of Myanmar to English.","authors":["Nay Yee Lin","Khin Mar Soe","Ni Lar Thein"],"meta":["August 2011International Journal of Computer Applications 28(1)","DOI:10.5120/3355-4628"],"references":["224084474_Textual_and_stylistic_error_detection_and_correction_Categorization_annotation_and_correction_strategies","221336416_Macros_for_context-free_grammars","221102166_Hybrid_Processing_for_Grammar_and_Style_Checking","220746465_Using_a_Grammar_Checker_for_Evaluation_and_Postprocessing_of_Statistical_Machine_Translation","220155897_Structural_Parsing_of_Natural_Language_Text_in_Tamil_Language_Using_Dependency_Model","272912755_Solving_the_Noun_Phrase_and_Verb_Phrase_Agreement_in_Kannada_Sentences","265003782_Reducing_Errors_in_Translation_using_Pre-editor_for_Indian_English_Sentences","245802691_Corpus-Based_Methods_in_Language_and_Speech","239556866_A_Rule-Based_Style_and_Grammar_Checker","220694695_Artificial_intelligence_2_ed"]}