{"id":"268022769_A_fast_compound_algorithm_for_mining_generators_closed_itemsets_and_computing_links_between_equivalence_classes","abstract":"In pattern mining and association rule mining, there is a variety of algorithms for mining frequent closed itemsets (FCIs) and frequent generators (FGs), whereas a smaller part further involves the precedence relation between FCIs. The interplay of these three constructs and their joint computation have been studied within the formal concept analysis (FCA) field yet none of the proposed algorithms is scalable. In frequent pattern mining, at least one suite of efficient algorithms has been designed that exploits basically the same ideas and follows the same overall computational schema. Based on an in-depth analysis of the aforementioned interplay that is rooted in a fundamental duality from hypergraph theory, we propose a new schema that should enable for a more parsimonious computation. We exemplify the new schema in the design of Snow-Touch, a concrete FCI/FG/precedence miner that reuses an existing algorithm, Charm, for mining FCIs, and completes it with two original methods for mining FGs and precedence, respectively. The performance of Snow-Touch and of its closest competitor, Charm-L, were experimentally compared using a large variety of datasets. The outcome of the experimental study suggests that our method outperforms Charm-L on dense data while on sparse one the trend is reversed. Furthermore, we demonstrate the usefulness of our method and the new schema through an application to the analysis of a genome dataset. The initial results reported here confirm the capacity of the method to focus on significant associations.","authors":["Laszlo Szathmary","Petko Valtchev","Amedeo Napoli","Robert Godin"],"meta":["February 2014Annals of Mathematics and Artificial Intelligence 70(1)","DOI:10.1007/s10472-013-9372-8","Project: Lattice-based itemset mining algorithms"],"references":["228845858_JEN_un_algorithme_efficace_de_construction_de_generateurs_pour_l'identification_des_regles_d'association","314819083_CLOSET_searching_for_the_best_strategies_for_mining_frequent_closed_itemsets","313103354_Incremental_transformations_of_lattices_A_key_to_effective_knowledge_discovery","313090003_Concise_representations_of_association_rules","279356941_Formal_Concept_Analysis","272962146_Detection_of_antibiotic-resistant_bacteria_and_their_resistance_genes_in_wastewater_surface_water_and_drinking_water_biofilms","257403783_DBV-Miner_A_Dynamic_Bit-Vector_approach_for_fast_mining_frequent_closed_itemsets","247453304_Scientific_Knowledge_Discovery_through_Iterative_Transformation_of_Concept_Lattices","246396786_Hsiao_CHARM_An_efficient_algorithm_for_closed_itemset_mining","243783734_Hypergraphs_Combinatorics_of_Finite_Sets"]}