{"id":"268029423_Increasing_Student-Teacher_Interactions_at_an_Urban_Commuter_Campus_through_Instant_Messaging_and_Online_Office_Hours","abstract":"Encouraging first year undergraduate students in large lecture-hall classes to seek out and actively engage their professors is a perennial problem in science education. This problem is especially acute for commuter and minority populations. Thus, because personal relationships between students and professors are well known to promote student learning and academic success, fostering new ways to connect students and faculty is essential for reducing attrition at inner-city colleges. In the current study, we demonstrate that the use of instant messaging (IM) is highly effective in fostering student-teacher interactions in the lecture-hall setting of an introductory major-level biology course at John Jay College of Criminal Justice, a senior college within The City University of New York. We found that not only did the use of IM allow more students to directly contact their professors through the internet, but also formed the basis for a personal relationship, leading to increased in-person interaction during office hours. This argues that new internet-based communication technologies can help break down barriers between students and professors at the undergraduate level. We also discuss some of the further enhancements that are possible given these preliminary successes with IM. Clearly, increased use and development of Instant Messaging can play a vital role in the active engagement of students in the learning process.","authors":["Oscar E Cifuentes","Nathan H Lents"],"meta":["January 2010"],"references":["247844315_Innovation_in_Large_Lectures_Teaching_for_Active_Learning","271674953_A_Text_and_Reconceptualization_of_a_Theoretical_Model_of_College_Withdrawal_in_a_Commuter_Institution_Setting","252007724_Differences_in_learning_outcomes_for_the_online_and_F2F_versions_of_An_Introduction_to_Shakespeare","250184664_Professors_as_Models_and_Mentors_for_College_Students","249802926_Intergenerational_Bonding_in_School_The_Behavioral_and_Contextual_Correlates_of_Student-Teacher_Relationships","249797757_Mentoring_and_Undergraduate_Academic_Success_A_Literature_Review","249795687_Relational_Networks_Social_Trust_and_Norms_A_Social_Capital_Perspective_on_Students'_Chances_of_Academic_Success","249360144_The_relationship_between_college_experience_and_academic_performance_among_minority_students","247857975_The_Effects_of_Internet-Based_Instruction_on_Student_Learning","240696785_Pioneering_Experiences_in_Distance_Learning_Lessons_Learned"]}