{"id":"268079628_How_transferable_are_features_in_deep_neural_networks","abstract":"Many deep neural networks trained on natural images exhibit a curious\nphenomenon in common: on the first layer they learn features similar to Gabor\nfilters and color blobs. Such first-layer features appear not to be specific to\na particular dataset or task, but general in that they are applicable to many\ndatasets and tasks. Features must eventually transition from general to\nspecific by the last layer of the network, but this transition has not been\nstudied extensively. In this paper we experimentally quantify the generality\nversus specificity of neurons in each layer of a deep convolutional neural\nnetwork and report a few surprising results. Transferability is negatively\naffected by two distinct issues: (1) the specialization of higher layer neurons\nto their original task at the expense of performance on the target task, which\nwas expected, and (2) optimization difficulties related to splitting networks\nbetween co-adapted neurons, which was not expected. In an example network\ntrained on ImageNet, we demonstrate that either of these two issues may\ndominate, depending on whether features are transferred from the bottom,\nmiddle, or top of the network. We also document that the transferability of\nfeatures decreases as the distance between the base task and target task\nincreases, but that transferring features even from distant tasks can be better\nthan using random features. A final surprising result is that initializing a\nnetwork with transferred features from almost any number of layers can produce\na boost to generalization that lingers even after fine-tuning to the target\ndataset.","authors":["Jason Yosinski","Jeff Clune","Y. Bengio","Hod Lipson"],"meta":["November 2014Advances in Neural Information Processing Systems 27","SourcearXiv"],"references":["264979485_Caffe_Convolutional_Architecture_for_Fast_Feature_Embedding","259441043_OverFeat_Integrated_Recognition_Localization_and_Detection_using_Convolutional_Networks","319770357_DeCAF_A_Deep_Convolutional_Activation_Feature_for_Generic_Visual_Recognition","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","310752533_Visualizing_and_understanding_convolutional_networks","283601334_Deep_learning_of_representations_for_unsupervised_and_transfer_learning","268265707_ICA_with_Reconstruction_Cost_for_Efficient_Overcomplete_Feature_Learning","267960550_ImageNet_Classification_with_Deep_Convolutional_Neural_Networks","258424423_Visualizing_and_Understanding_Convolutional_Neural_Networks","258374356_Rich_Feature_Hierarchies_for_Accurate_Object_Detection_and_Semantic_Segmentation"]}