{"id":"268043216_A_Formalization_of_Minimalist_Syntax","abstract":"The goal of this paper is to give a precise, formal account of certain fundamental notions in minimalist syntax, including Merge, Select, Transfer, occurrences, workspace, labels, and convergence. We would like this formalization to be useful to minimalist syntacticians in formulating new proposals and evaluating their own proposals, both conceptually and empirically. We do not attempt to formalize all minimalist analyses that have been proposed in the last two decades. Rather, we focus on widely accepted formulations. Where certain alternatives loom large, we mention them briefly. There are many operations we have not treated for reasons of space, including: head movement, Pair-Merge (adjunction), QR Agree and Feature Inheritance. The framework given in this paper could be extended to incorporate various versions of these operations, which could then be compared rigorously. Our basic approach bears a resemblance to the Minimalist Grammars devised by Stabler (1997) and the work that it has given rise to. 1 Those grammars were simplified to facilitate computational assessment, but here we make an effort to stay close to mainstream formulations. We use basic set theory to represent syntactic objects, with standard notation: ∈ (is an element of), ∪ (set union), ⊆ (is a subset of), ⊂ (is a proper subset of). Given any two sets S and T, the set difference S-T={x| x∈S, x∉T}. And S×T is the Cartesian product of S and T, that is, the set of ordered pairs {〈a,b〉| a∈S,b∈T}. As usual, free variables in definitions are understood to be universally quantified. For example, \"W is a workspace iff…\" means the same thing as \"For all W, W is a workspace iff…\" 1. Preliminary Definitions Definition 1. Universal Grammar Universal Grammar is a 6-tuple: <PHON, SYN, SEM, Select, Merge, Transfer> PHON, SYN and SEM are universal sets of features. Select, Merge and Transfer are universal operations. Select is an operation that introduces lexical items into the derivation. Merge is an operation that takes two syntactic objects and combines them into a syntactic object. Transfer is an operation that maps the syntactic objects built by Merge to pairs <PHON, SEM> that are interpretable at the interfaces. Select, Merge and Transfer are defined later in the paper. Definition 1 captures what is invariant in the human language faculty. There is no need to augment the 6-tuple with a specification of the format of lexical items, since the required format of lexical items is already given by the definitions of the operations. We assume that UG specifies three sets of features: semantic features (SEM), phonetic features (PHON), and syntactic features (SYN). We assume that these three sets do not overlap, although in some cases this assumption may be too restrictive (e.g., for 1 See for example, Michaelis (2001), Harkema (2001), Stabler (2010), Salvati (2011).","authors":["Chris Collins","Edward P. Stabler"],"meta":["March 2016Syntax 19(1)","DOI:10.1111/synt.12117"],"references":["307599246_Linearization_of_Chains_and_Sideward_Movement","350809749_Minimalist_Investigations_in_Linguistic_Theory","346531679_Imposters_A_Study_of_Pronominal_Agreement","332863072_On_the_logic_of_LGB_type_structures_Part_I_Multidominance_structures","316099861_On_Formal_Properties_of_Minimalist_Grammars","313584291_'Chains_of_arguments'","313078080_Beyond_explanatory_adequacy","304973922_Computational_Perspectives_on_Minimalism","299660529_Incomplete_Category_Fronting","292632985_Shared_constituents_and_Linearization"]}