{"id":"268151922_Super-star_networks_Growing_optimal_scale-free_networks_via_likelihood","abstract":"Preferential attachment — by which new nodes attach to existing nodes with probability pro-portional to the existing nodes' degree — has become the standard growth model for scale-free networks, where the asymptotic probability of a node having degree k is proportional to k . However, the motivation for this model is entirely ad hoc. We use exact likelihood arguments and show that the optimal way to build a scale-free network is to attach most new links to nodes of low degree. Curiously, this leads to a scale-free networks with a single dominant hub: a star-like structure we call a super-star network. Asymptotically, the optimal strategy is to attach each new node to one of the nodes of degree k with probability proportional to 1 N +⇣()(k+1) (in a N node network) — a stronger bias toward high degree nodes than exhibited by standard preferential attachment. Our algorithm generates optimally scale-free networks (the super-star networks) as well as randomly sampling the space of all scale-free networks with a given degree exponent . We generate viable realisation with finite N for 1 ⌧ < 2 as well as > 2. We observe an appar-ently discontinuous transition at ⇡ 2 between so-called super-star networks and more tree-like realisations. Gradually increasing further leads to re-emergence of a super-star hub. To quantify these structural features we derive a new analytic expression for the expected degree exponent of a pure preferential attachment process, and introduce alternative measures of network entropy. Our approach is generic and may also be applied to an arbitrary degree distribution.","authors":["Michael Small","Yingying Li","Thomas Stemler","Kevin Judd"],"meta":["November 2014Physical Review E 91(4)","DOI:10.1103/PhysRevE.91.042801"],"references":["309030323_Three-dimensional_reconstruction_of_single-cell_chromosome_structure_using_recurrence_plots","301233254_Superfamily_phenomena_and_motifs_of_networks_induced_from_time_series","301232812_From_time_series_to_complex_networks_The_visibility_graph","283556791_Dynamical_Systems_Induced_on_Networks_Constructed_from_Time_Series","264795304_Geometrical_invariability_of_transformation_between_a_time_series_and_a_complex_network","301233037_Dynamical_aspects_of_interaction_networks","301233024_Characterization_of_Strange_Attractors","280566512_Networks_An_Introduction","270443093_Change-point_detection_with_recurrence_networks","270343801_Ordinal_symbolic_analysis_and_its_application_to_biomedical_recordings","264483281_Discriminating_chaotic_and_stochastic_dynamics_through_the_permutation_spectrum_test","262984799_Characterizing_system_dynamics_with_a_weighted_and_directed_network_constructed_from_time_series_data","264426812_From_the_time_series_to_the_complex_networks_The_parametric_natural_visibility_graph","263985830_DYNAMICAL_ASPECTS_OF_INTERACTION_NETWORKS","263001403_Topological_properties_and_fractal_analysis_of_recurrence_network_constructed_from_fractional_Brownian_motions"]}