{"id":"268153001_Native_Apps_Vs_Mobile_Web_Apps","abstract":"The extensive growth and expansion of smartphones and tablets and therewith the use of mobile web applications that utilize HTML5 and related technologies are frequently discussed and debated in media as possible replacements for native applications. The aim of this study was to explore the viability of replacing native applications with mobile web applications in a developing country setting. Two mobile web applications were developed. The first mobile web application tracked runs and the second mobile web application was a booking system for scheduling â??slum runsâ?. The subjects who tested these apps were elite, semi-professional Kenyan runners primarily from the Kibera slum area outside of Nairobi. After a 6-month test period the participants concluded and results indicated that the mobile web application for tracking runs performed poorly compared to native applications due to poor GPS performance, while the mobile web application for booking slum runs performed well. The conclusion from this study is that mobile web applications that require hardware interaction such as using the GPS, GPU, or camera are not yet viable alternatives for native applications. However, mobile applications that only require a native interface and content consumption are suitable substitutes for native applications.","authors":["William Jobe"],"meta":["October 2013International Journal of Interactive Mobile Technologies (iJIM) 7(4):pp. 27-32","DOI:10.3991/ijim.v7i4.3226"],"references":["261447249_Mobile_Web_Apps_-_The_Non-programmer's_Alternative_to_Native_Applications","224169674_Data_collection_with_iPhone_Web_apps_efficiently_collecting_patient_data_using_mobile_devices","201168946_Design_Science_in_Information_Systems_Research","271439186_Selecting_the_right_mobile_app_paradigms","262234310_Best_Practices_on_the_Move_Building_Web_Apps_for_Mobile_Devices","262204536_Best_Practices_on_the_Move_Building_Web_Apps_for_Mobile_Devices","261226331_HTML_5_in_Mobile_Devices_--_Drivers_and_Restraints","260305821_2013_Trends_and_Strategies","256852152_Design_Science_in_Information_Systems_Research","224130232_Will_HTML_5_restandardize_the_web"]}