{"id":"268173783_Autoclass_-_A_Bayesian_Approach_to_Classification","abstract":"We describe a Bayesian approach to the unsupervised discovery of classes in a set of cases, sometimes called finite mixture separation or clustering. The main difference between clustering and our approach is that we search for the “best” set of class descriptions rather than grouping the cases themselves. We describe our classes in terms of probability distribution or density functions, and the locally maximal posterior probability parameters. We rate our classifications with an approximate posterior probability of the distribution function w.r.t. the data, obtained by marginalizing over all the parameters. Approximation is necessitated by the computational complexity of the joint probability, and our marginalization is w.r.t. a local maxima in the parameter space. This posterior probability rating allows direct comparison of alternate density functions that differ in number of classes and/or individual class density functions.\nWe discuss the rationale behind our approach to classification. We give the mathematical development for the basic mixture model, describe the approximations needed for computational tractability, give some specifics of models for several common attribute types, and describe some of the results achieved by the AutoClass program..","authors":["John Stutz","Peter C Cheeseman"],"meta":["January 1996","DOI:10.1007/978-94-009-0107-0_13"],"references":["236499972_Automatic_classification_of_spectra_from_the_Infrared_Astronomical_Satellite_IRAS","220815580_Bayesian_Classification_with_Correlation_and_Inheritance","23815998_A_Bayesian_classification_of_the_IRAS_LRS_atlas","284261409_Maximum_likelihood_eitimation_from_imcomplete_data_via_EM_algorithm_J","269501556_The_Lognormal_Distribution","257259241_Bayesian_Inference_in_Statistical_Analysis","229100480_Statistical_Analysis_of_Finite_Mixture_Distributions","221995817_Maximum_Likelihood_from_Incomplete_Data_Via_EM_Algorithm","220459136_Occupancy_of_a_Rectangular_Array"]}