{"id":"268196953_Noncommutative_Determinant_is_Hard_A_Simple_Proof_Using_an_Extension_of_Barrington's_Theorem","abstract":"We show that, for many noncommutative algebras A, the hardness of computing the determinant of matrices over A follows almost immediately from Barrington's Theorem. Barrington showed how to express a NC1 circuit as a product program over any non-solvable group. We construct a simple matrix directly from Barrington's product program whose determinant counts the number of solutions to the product program. This gives a simple proof that computing the determinant over algebras containing a non-solvable group is #P-hard or ModpP-hard, depending on the characteristic of the algebra. To show that computing the determinant is hard over noncommutative matrix algebras whose group of units is solvable, we construct new product programs (in the spirit of Barrington) that can evaluate 3SAT formulas even though the algebra's group of units is solvable. The hardness of noncommutative determinant is already known, it was recently proven by retooling Valiant's (rather complex) reduction of #3SAT to computing the permanent. Our emphasis here is on obtaining a conceptually simpler proof.","authors":["Craig Gentry"],"meta":["June 2014Proceedings of the Annual IEEE Conference on Computational Complexity","DOI:10.1109/CCC.2014.26","Conference: 2014 IEEE Conference on Computational Complexity (CCC)"],"references":["221590846_Bounded-Width_Polynomial-Size_Branching_Programs_Recognize_Exactly_Those_Languages_in_NC","266835280_On_the_multiplicative_group_of_a_field","265440810_Graph_theory_and_crystal_physics","262173585_Noncommutativity_Makes_Determinants_Hard","239053778_Dimer_problem_in_statistical_mechanics-an_exact_result","238883777_The_Ore_conjecture","234828972_Lower_bounds_for_non-commutative_computation","223150594_The_statistics_of_dimers_on_a_lattice_I_The_number_of_dimer_arrangements_on_a_quadratic_lattice","222808307_The_Complexity_of_Computing_the_Permanent","222450604_Bounded-width_polynomial-size_branching_programs_recognize_exactly_those_languages_in_NC1","221590768_On_the_hardness_of_the_noncommutative_determinant","221590219_Lower_Bounds_for_Non-Commutative_Computation_Extended_Abstract","48180159_Almost_Settling_the_Hardness_of_Noncommutative_Determinant","7191079_Some_Properties_of_a_Sfield"]}