{"id":"268108292_Understanding_Boundaries_For_Knowledge_Sharing_In_Online_Communities","abstract":"Online knowledge sharing activities are flourishing with the advent of social media. Websites such as Facebook, Twitter, and Wikipedia facilitate knowledge sharing in online communities that extend beyond the constraints of existing organizational boundaries (Qualman 2011). Since the focus of prior research has generally been limited to knowledge sharing within organizations (e.g., Wang & Noe, 2010), it is imperative to better understand its practice on Web 2.0 platforms and in these online communities (Allen 2010). As Vakkayil (2012) contends, the concept of boundaries is informative for understanding knowledge sharing and creation among heterogeneous users with diverse cultural, organizational, socio-economic and spatial backgrounds. In organizational settings, boundaries, such as physical, cognitive, social, and political (e.g., Carlile, 2004), may privilege certain participants, motivations, and modes of participation. However, these boundaries may function quite differently in Web 2.0 environments outside these organizational settings. Although it becomes easier and faster to share knowledge and collaborate online, few studies have investigated how boundaries and boundary-crossing in Web 2.0 environments affect online collaboration, knowledge sharing, and participation. This paper aims to explore the usefulness of employing existing boundary frameworks to facilitate knowledge sharing and collaboration. To test and modify existing theoretical frameworks of boundaries we analyzed Wikipedia entries about the Japanese nuclear power plant accident triggered by the Tōhoku earthquake in March 2011. This event attracted attention from around the world and is useful for our research because the case involves multiple boundaries and various processes of boundary-crossing. Based on the data and the literature we propose a refined framework for boundaries and boundary-crossing, and by doing so this paper advances our understanding of boundaries for knowledge sharing in online communities and identifies how these boundaries facilitate or hinder equal participation.","authors":["Noriko Hara","Pnina Fichman"],"meta":["July 2014","Conference: XVIII ISA World Congress of Sociology"],"references":[]}