{"id":"268186564_Paragraphs_on_Conceptual_Art","abstract":"Artforum (June, 1967). The editor has written me that he is in favor of avoiding \"the notion that the artist is a kind of ape that has to be explained by the civilized critic\". This should be good news to both artists and apes. With this assurance I hope to justify his confidence. To use a baseball metaphor (one artist wanted to hit the ball out of the park, another to stay loose at the plate and hit the ball where it was pitched), I am grateful for the opportunity to strike out for myself. I will refer to the kind of art in which I am involved as conceptual art. In conceptual art the idea or concept is the most important aspect of the work. When an artist uses a conceptual form of art, it means that all of the planning and decisions are made beforehand and the execution is a perfunctory affair. The idea becomes a machine that makes the art. This kind of art is not theoretical or illustrative of theories; it is intuitive, it is involved with all types of mental processes and it is purposeless. It is usually free from the dependence on the skill of the artist as a craftsman. It is the objective of the artist who is concerned with conceptual art to make his work mentally interesting to the spectator, and therefore usually he would want it to become emotionally dry. There is no reason to suppose, however, that the conceptual artist is out to bore the viewer. It is only the expectation of an emotional kick, to which one conditioned to expressionist art is accustomed, that would deter the viewer from perceiving this art. Conceptual art is not necessarily logical. The logic of a piece or series of pieces is a device that is used at times, only to be ruined. Logic may be used to camouflage the real intent of the artist, to lull the viewer into the belief that he understands the work, or to infer a paradoxical situation (such as logic vs. illogic). Some ideas are logical in conception and illogical perceptually. The ideas need not be complex. Most ideas that are successful are ludicrously simple. Successful ideas generally have the appearance of simplicity because they seem inevitable. In terms of ideas the artist is free even to surprise himself. Ideas are discovered by intuition. What the work of art looks like isn't too important. It has to look like something if it has physical form. No matter what form it may finally have it must begin with an idea. It is the process of conception and realization with which the artist is concerned. Once given physical reality by the artist the work is open to the perception of al, including the artist. (I use the word perception to mean the apprehension of the sense data, the objective understanding of the idea, and simultaneously a subjective interpretation of both). The work of art can be perceived only after it is completed.","authors":["Sol Lewitt"],"meta":[],"references":[]}