{"id":"268242560_Coinductive_0_-categorical_theories","abstract":"Let L be a countable language which contains only constant and relation symbols but no function symbols. All theories considered here will be L -theories. A theory is coinductive if it can be axiomatized by a set of ∃∀ sentences, and a structure is coinductive if its theory is.\nThe object of this paper is to show that coinductive ℵ 0 -categorical structures are especially simple. First, they are ω -stable with Morley rank ≤ 1; and second, they have simple algebraic closures, by which is meant that the algebraic closure of the union of two sets is the union of their algebraic closures. While these two properties do not characterize coinductive ℵ 0 -categorical structures, they do characterize those structures which are cellular.\nWe will say that a countable structure is cellular if there is a finite subset A 0 ⊆ A and there are equivalence relations E and F on A∖A 0 such that the following hold:\n(1) There are only finitely many E -classes.\n(2) If C is an E -class and D an F -class, then ∣ C ∩ D ∣ = 1.\n(3) If a 0 , a 1 , …, a k − 1 , b 0 , b 1 , …, b k − 1 Є A , then 〈 a 0 , a 1 , …, a k − 1 〉 and 〈 b 0 , b 1 , …, b k − 1 〉, satisfy the same quantifier-free formulas provided that:\n(a) if i < k and either a i Є A 0 or b i Є A 0 , then a i = b i ;\n(b) if i < k , then a i ; and b i are E -equivalent; and\n(c) if i, j < k , then a i ; is F -equivalent to a j if b j is F -equivalent to b j .\nThe main result of this paper is the following theorem.\nTheorem 1. If is coinductive and ℵ 0 - categorical, then is cellular .\nThe results of this paper were obtained independently of similar results obtained by Lachlan which can be found in [4] and [5]. The proofs here are quite different.","authors":["James Schmerl"],"meta":["September 1990Journal of Symbolic Logic 55(3)","DOI:10.2307/2274478"],"references":["266008642_Complete_Theories_with_Only_Universal_and_Existential_Axioms","243763766_Building_Models_by_Games","220316131_Relational_Structures_Determined_by_Their_Finite_Induced_Substructures","220315753_Complete_Theories_with_Only_Universal_and_Existential_Axioms","38380181_Countable_Homogeneous_Relational_Structures_and_aleph_0-Categorical_Theories"]}