{"id":"268223424_Computed_Tomographic_Measurement_of_Airway_Remodeling_and_Emphysema_in_Advanced_Chronic_Obstructive_Pulmonary_Disease_Correlation_with_Pulmonary_Hypertension","abstract":"Rationale: \nPulmonary hypertension (PH) is an established complication of advanced chronic obstructive pulmonary disease (COPD) associated with increased mortality. The mechanisms coupling PH and bronchial obstruction are unknown; in particular, PH appears to be unrelated to emphysema. We hypothesized that computed tomographic (CT) measurement of airway remodeling instead of emphysema may correlate with PH in COPD.\n\nObjectives: \nWe aimed to describe the clinical and CT characteristics of patients with COPD with or without PH and to correlate CT measurements of airway remodeling and emphysema with PH.\n\nMethods: \nData were retrieved from 60 COPD patients who underwent both right heart catheterization and computed tomography in a period of stability and had no other disease known to cause PH. CT measurement of airway wall thickness (WT-Pi10) was used to assess airway remodeling and low lung area percentage (LAA%) to quantify emphysema extent.\n\nMeasurements and main results: \nThirty-four of the sixty patients with COPD had PH (mean pulmonary arterial pressure [PAPm] ≥ 25 mm Hg). There was no difference between the two groups regarding age, sex, and spirometric results, whereas there was more profound hypoxemia in the PH group. WT-Pi10 was increased in the patients with COPD and PH and correlated with PAPm (ρ = 0.62; P < 0.001). Conversely, there was no difference or correlation between PAPm and LAA% (ρ = 0.12; P = 0.33). In multivariate analysis (R(2) = 0.53), WT-Pi10 was the independent predictor most associated with PAPm elevation, as compared to hypoxia (PaO2) or pulmonary arterial enlargement (diameter ratio between the pulmonary arterial truncus and the ascending aorta).\n\nConclusions: \nThis study demonstrates, for the first time to our knowledge, an association between structural alterations of bronchi and PH in COPD. Unlike quantification of emphysema, CT measurement of airway remodeling correlates with PAPm and could be used to estimate the severity of PH in COPD. Airway remodeling burden is not limited to airflow limitation in the assessment of COPD severity and mortality.","authors":["Gael Dournes","François Laurent","Florence Coste","Claire Dromer"],"meta":["January 2015American Journal of Respiratory and Critical Care Medicine 191(1):63-70","DOI:10.1164/rccm.201408-1423OC"],"references":["261519299_Tadalafil_in_patients_with_chronic_obstructive_pulmonary_disease_A_randomised_double-blind_parallel-group_placebo-controlled_trial","259393929_Pulmonary_Hypertension_in_Chronic_Lung_Diseases","277649651_CT_measurement_of_airway_wall_thickness_and_emphysema_in_COPD_Correlation_with_pulmonary_hypertension","273723679_The_emphysematous_and_bronchial_types_of_chronic_airways_obstruction","270342692_Uncovering_the_Bronchovascular_Links_in_Patients_with_Chronic_Obstructive_Pulmonary_Disease_with_Pulmonary_Hypertension","265608366_Location_location_location_studying_anatomically_comparable_airways_is_highly_relevant_to_understanding_COPD","262787811_Using_pulmonary_imaging_to_move_COPD_beyond_FEV1","260270304_Cardiopulmonary_Coupling_in_Chronic_Obstructive_Pulmonary_Disease_The_Role_of_Imaging","259917493_Increased_expression_of_vascular_endothelial_growth_factor_and_hypoxia_inducible_factor-1a_in_lung_tissue_of_patients_with_chronic_bronchitis","257690288_45_Pulmonary_hypertension_in_COPD"]}