{"id":"268219655_Profiling_First-Year_Students_in_STEM_Programs_Based_on_Autonomous_Motivation_and_Academic_Self-Concept_and_Relationship_with_Academic_Achievement","abstract":"The low success rate of first-year college students in Science, Technology, Engineering, and Mathematics (STEM) programs has spurred many academic achievement studies in which explanatory factors are studied. In this study, we investigated from a person-oriented perspective whether different motivational and academic self-concept profiles could be discerned between male and female first-year college students in STEM and whether differences in early academic achievement were associated with these student groups. Data on autonomous motivation, academic self-concept, and early academic achievement of 1,400 first-year STEM college students were collected. Cluster analyses were used to distinguish motivational profiles based on the relative levels of autonomous motivation and academic self-concept for male and female students. Differences in early academic achievement of the various profiles were studied by means of ANCOVA. Four different motivational profiles were discerned based on the dimensions of autonomous motivation (A) and academic selfconcept (S): students scoring high and respectively low on both dimensions (HA-HS or LA-LS), and students scoring high on one dimension and low on the other (HA-LS or LA-HS). Also gender differences were found in this study: male students with high levels of academic self-concept and autonomous motivation had higher academic achievement compared to male students with low levels on both motivational dimensions. For female students, motivational profiles were not associated with academic achievement. The findings partially confirm the internal and external validity of the motivational theories underpinning this study and extend the present insights on identifying subgroup(s) of at risk students in contemporary STEM programs at university level.","authors":["Carolien Van Soom","Vincent Donche"],"meta":["November 2014PLoS ONE Volume 9(11):e112489","DOI:10.1371/journal.pone.0112489","Project: Transition to Higher Education"],"references":["280806223_A_Multifaceted_Academic_Self-Concept_Its_Hierarchical_Structure_and_Its_Relation_to_Academic_Achievement","270647446_Student_achievement_and_academic_self-concept_among_secondary_students_in_Flanders_Gender_and_changes_over_time","269462101_Self-Concept_Validation_of_Construct_Interpretations","289658368_Academic_self-concept_and_academic_achievement_Developmental_perspectives_on_their_causal_ordering","280805982_Longitudinal_structural_equation_models_of_academic_self-concept_and_achievement_Gender_differences_in_the_development_of_math_and_English_constructs","278900266_A_threat_in_the_air_-_How_stereotypes_shape_intellectual_identity_and_performance","278480374_Discriminant_and_predictive_validity_of_academic_self-concept_academic_self-efficacy_and_mathematics-specific_self-efficacy","277674317_The_Big-Fish-Little-Pond_Effect_on_Academic_Self-Concept","269423515_The_Self_Concept","264647562_Modeling_Engineering_Degree_Attainment_Using_High_School_and_College_Physics_and_Calculus_Coursetaking_and_Achievement"]}