{"id":"268206941_Um_modelo_colaborativo_para_a_aprendizagem_do_pensamento_computacional_aliado_a_autorregulacao","abstract":"ABSTRACT.\nThe recent literature on computer science education in high school and assessment of learning emphasises the need to develop students' self-regulatory and problem-solving skills. Students must be trained so they can to set their own goals, monitor and evaluate their own learning. They must also be able to problems solving with the application of computational thinking and to carry out such activities in collaboration with their peers. In this light, this paper presents a model that aims at developing such skills, in the context of computational thinking learning. The model was built based on an exploratory study and its phases are presented in detail. We also discuss its strengths with respect to other related works found in the literature. \n\nRESUMO.\nA literatura recente sobre ensino de ciência da computação no ensino médio e avaliação da aprendizagem enfatiza a necessidade de se desenvolver as habilidades de autorregulação e resolução de problemas dos estudantes. Os aprendizes devem ser formados para que possam definir seus próprios objetivos, monitorar e avaliar a própria aprendizagem. Eles devem também ser capazes de resolver problemas com a aplicação do pensamento computacional e realizar tais atividades em colaboração com seus pares. Assim, este trabalho apresenta um modelo para o desenvolvimento de tais habilidades no contexto da aprendizagem do pensamento computacional. O modelo foi construído a partir de um estudo exploratório e suas fases são descritas, assim como seus diferenciais em relação a outros trabalhos correlatos encontrados na literatura.","authors":["Rozelma Soares de França","Patricia Azevedo Tedesco"],"meta":["January 2014","DOI:10.13140/2.1.2764.0008","Conference: XXV Simpósio Brasileiro de Informática na EducaçãoAt: Dourados"],"references":["264489459_A_disseminacao_do_pensamento_computacional_na_educacao_basica_licoes_aprendidas_com_experiencias_de_licenciandos_em_computacao","236218030_Assessment_of_Programming_Language_Learning_Based_on_Peer_Code_Review_Model_Implementation_and_Experience_Report","221537039_Empirical_evidence_for_the_existence_and_uses_of_metacognition_in_computer_science_problem_solving","4336467_Computational_thinking_and_thinking_about_computing","220808180_Effective_peer_assessment_for_learning_computer_programming","220613310_On_the_implementation_of_self-assessment_in_an_introductory_programming_course"]}