{"id":"268237325_Performance_of_students_across_assessment_methods_and_courses_using_Correlation_analysis","abstract":"Professional education aims to provide students with requisite knowledge and skills to face today's competitive environment. To achieve this currently practices like systematically assessing student learning and measuring learning outcomes are presently in place. The primary goal achieved by this process is the continued improvement of academic quality for the institution. This paper investigates the application of correlation analysis for finding relationships between skills acquired is one test with the other components like assignments, individual marks with the final result and the correlation of performances of students' across courses. The results obtained for the first study indicates that there exists moderately strong relationship. The second study shows that correlation coefficients of related courses are better while that of some unrelated courses have moderate value. This means that in case of related courses the skills acquired in a prerequisite course can help them to do better in the current course. This exploratory analysis when properly interpreted can help plan and retrospect and re-adjust the mode of assessment or course delivery to enhance student learning.","authors":["Aruna Malapati","N. L. Bhanu Murthy"],"meta":["December 2013","DOI:10.1109/MITE.2013.6756359","Conference: 2013 IEEE International Conference in MOOC, Innovation and Technology in Education (MITE)"],"references":["26457916_Correlation_between_marks_obtained_by_students_in_assignments_and_final_examination_of_master_of_education_conducted_by_Allama_Iqbal_Open_University","276942820_Interpersonal_Influences_and_Educational_Aspirations_in_12_Countries_The_Importance_of_Institutional_Context","274917020_Beyond_College_For_All_Career_Paths_for_the_Forgotten_Half","271497121_Attendance_performance_and_culture_Experience_of_the_School_of_Engineering_Nazarbayev_University_-_An_update","254964894_Adoption_Adaptation_Evaluating_the_Formation_of_Educational_Expectations","232520231_The_interpretation_of_the_correlation_coefficient","222930060_Stratification_and_the_formation_of_expectations_in_highly_differentiated_educational_systems","44841168_Cross-National_Gender_Gaps_in_Educational_Expectations_The_Influence_of_National-Level_Gender_Ideology_and_Educational_Systems"]}