{"id":"268235427_Human_Motivation_in_Question_Discussing_Emotions_Motives_and_Subjectivity_from_a_Cultural-Historical_Standpoint","abstract":"Vygotsky, at the end of his life, advanced a new representation of a psychological system that was ruled by a cognitive-emotional unity, a theorization that remains inconclusive due to Vygotsky's early death. This article discusses the advances made by Vygotsky in the comprehension of human motivation through his concepts of sense and perezhivanie at the end of his work. Through these concepts, he further advanced the discussion of motivation, despite the fact that these concepts have only very recently been considered a relevant part of his legacy in both Russian and Western psychology. This paper discusses the departure from and the historical presentations of the concept of motive in the following two main approaches of Soviet psychology that were mistakenly equated in Western interpretations: Vygotsky's approach, mainly at the first as last moment of his work, and Leontiev's Activity Theory. Based on the final theoretical positions of Vygotsky and of other Soviet authors, and further developing this legacy, this article proposes a new definition of motivation as a specific quality of subjectively configured systems and defines motive as intrinsic to the functioning of all psychological function defines subjective functions as subjectively configured processes. This new proposal of human motivation within a new way of defining subjectivity defines new categories as subjective senses and subjective configurations on which the author bases a specific approach for advancing the topic of subjectivity and motivation within a cultural-historical framework.","authors":["Fernando Gonzalez Rey"],"meta":["December 2014Journal for the Theory of Social Behaviour 45(4)","DOI:10.1111/jtsb.12073"],"references":["247887096_Guest_Editor's_Introduction_Archival_Revolution_in_Vygotskian_Studies_Uncovering_Vygotsky's_Archives","237010463_Revisionist_Revolution_in_Vygotskian_Science_Toward_Cultural-Historical_Gestalt_Psychology","344551461_Cultural-historical_psychology_and_the_psychological_theory_of_activity_retrospect_and_prospect","297218367_Thought_and_Word_The_Approaches_of_L_S_Vygotsky_and_G_G_Shpet","292668488_Pedagogy","286710605_Vygotsky_in_perspective","276008659_On_the_Phenomenon_of_Perezhivanie","271670544_Emotions_in_Imaginative_Situations_The_Valued_Place_of_Fairytales_for_Supporting_Emotion_Regulation","271506523_Sujeto_y_Subjetividad_una_aproximacion_historico_cultural","267922967_Activity_Consciousness_Personality","260251502_Advancing_further_the_history_of_Soviet_psychology_Moving_forward_from_dominant_representations_in_Western_and_Soviet_psychology","247887277_Consciousness_as_the_Subject_Matter_and_Task_of_Psychology","233102038_A_Re-examination_of_Defining_Moments_in_Vygotsky's_Work_and_Their_Implications_for_His_Continuing_Legacy","228474613_Historical_relevance_of_Vygotsky's_work_Its_significance_for_a_new_approach_to_the_problem_of_subjectivity_in_psychology"]}