{"id":"268213795_Quantifying_the_Benefits_of_Active_Debris_Removal_in_a_Range_of_Scenarios","abstract":"Long-term space debris modelling studies have suggested that the ≥10 cm low Earth orbit debris population will continue to grow even with the widespread adoption of mitigation measures recommended by the Inter-Agency Space Debris Coordination Committee. However, a number of recent studies have shown that, with additional removal of a small number of debris objects, it is possible to prevent the growth of debris in LEO. These modelling studies were based on assumptions constraining future launch and explosion rates, solar activity and mitigation, amongst others, to a limited number of cases. As a result, the effectiveness of Active Debris Removal (ADR) has only been established and quantified for a narrow range of possible outcomes. Therefore, the potential benefits of ADR, in practice, remain uncertain and there is a need to investigate a wider range of potential future scenarios to help establish ADR requirements.\nIn this paper, we present results of a study to model and quantify the influence of four essential assumptions on the effectiveness of ADR: (1) launch activity, (2) explosion activity, (3) solar activity and (4) compliance with post-mission disposal. Each assumption is given a realistic range based upon historic worst-case data and an optimistic best-case. Using the University of Southampton’s Debris Analysis and Monitoring Architecture to the Geosynchronous Environment (DAMAGE) tool, these assumptions were modelled randomly from their permitted range in Monte Carlo projections from 2009 to 2209 of the ≥5 cm LEO debris environment. In addition, two yearly ADR rates were investigated: five and ten objects per year. \nThe results show an increase in the variance of the mean LEO debris population at the 2209 epoch. The uncertainty is such that, in some cases, ADR was not sufficient to prevent the long-term growth of the population, whilst in others ADR is not required to prevent population growth.","authors":["Adam White","Hugh G. Lewis"],"meta":["April 2013","Conference: Sixth European Conference on Space DebrisAt: Darmstadt, Germany"],"references":[]}