{"id":"268263798_Evaluacion_de_Objetos_de_Aprendizaje_a_traves_del_Aseguramiento_de_Competencias_Educativas","abstract":"Resumen El impulso al desarrollo y mejora de recursos digitales de apoyo a la educación, ha repercutido en los objetos de aprendizaje mediante el desarrollo de metodologías para su creación, puesto que a través de diversas convenciones respecto a los contenidos que deben tener y a la distribución de éstos, se busca garantizar el trabajo de los estudiantes y su inclusión en los procesos de aprendizaje, teniendo como fin en un sentido más concreto, garantizar el logro de metas pedagógicas. Para esto, se requiere que los objetos de aprendizaje cuenten con un diseño de calidad afín a sus propias características, y al desarrollo de habilidades y capacidades en los estudiantes, de manera independiente a la temática tratada en sus contenidos. Por estas razones se propone un sistema de evaluación que permita cotejar el nivel alcanzado por un objeto dentro de una escala, dicha propuesta retoma una primera iteración que hasta el momento se ha empleado para la evaluación de objetos de aprendizaje en la Universidad Autónoma de Aguascalientes, teniendo la característica de enfocar la evaluación de la calidad a través de la pertinencia de los contenidos, el diseño estético, funcional e instruccional de los objetos, y ahora, el aseguramiento de competencias a través de actividades de evaluación y retroalimentación, como una manera para asegurar el logro del aprendizaje.","authors":["Roberto Eduardo Ruiz González","Jaime Muñoz-Arteaga","Francisco Javier","Francisco Alvarez Rodriguez"],"meta":[],"references":["267388791_La_Determinacion_de_la_Calidad_de_Objetos_de_Aprendizaje","266185446_La_Importancia_de_la_Definicion_de_la_Calidad_del_Contenido_de_un_Objeto_de_Aprendizaje","28079683_Secuenciacion_de_contenidos_y_objetos_de_aprendizaje","313241423_Connecting_learning_objects_to_instructional_design_theory_A_definition_a_metaphor_and_a_taxonomy","31641165_Tecnologia_educacional_para_el_docente_CB_Chadwick"]}