{"id":"268391666_Numeric_Invariants_from_Multidimensional_Persistence","abstract":"Topological data analysis is the study of data using techniques from algebraic topology. Often, one begins with a finite set of points representing data and a “filter” function which assigns a real number to each datum. Using both the data and the filter function, one can construct a filtered complex for further analysis. For example, applying the homology functor to the filtered complex produces an algebraic object known as a “one-dimensional persistence module”, which can often be interpreted as a finite set of intervals representing various geometric features in the data. If one runs the above process incorporating multiple filter functions simultaneously, one instead obtains a multidimensional persistence module. Unfortunately, these are much more difficult to interpret. In this article, we analyze the space of multidimensional persistence modules from the perspective of algebraic geometry. We first build a moduli space of a certain subclass of easily analyzed multidimensional persistence modules, which we construct specifically to capture much of the information which can be gained by using multidimensional persistence instead of one-dimensional persistence. We argue that the global sections of this space provide interesting numeric invariants when evaluated against our subclass of multidimensional persistence modules. Finally, we extend these global sections to the space of all multidimensional persistence modules and discuss how the resulting numeric invariants might be used to study data. This paper extends the results of Adcock et al. (Homol Homotopy Appl 18(1), 381–402, 2016) by constructing numeric invariants from the computation of a multidimensional persistence module as given by Carlsson et al. (J Comput Geom 1(1), 72–100, 2010).","authors":["Jacek Skryzalin","Gunnar Carlsson"],"meta":["September 2017Journal of Applied and Computational Topology 1(8)","DOI:10.1007/s41468-017-0003-z","SourcearXiv"],"references":["243073634_Topology_and_Data","225878794_The_Theory_of_Multidimensional_Persistence","221543179_Computing_Multidimensional_Persistence","316628508_Persistence_images_A_stable_vector_representation_of_persistent_homology","308805632_A_stable_multi-scale_kernel_for_topological_machine_learning","281766106_Statistical_topological_data_analysis_using_persistence_landscapes","272037870_Topological_pattern_recognition_for_point_cloud_data","266221953_Multisymmetric_functions","258819239_The_Ring_of_Algebraic_Functions_on_Persistence_Bar_Codes"]}