{"id":"268387441_Sociologie_d'un_curiositif_Smartphone_code-barres_2D_et_self-marketing","abstract":"Depuis quelques temps, on voit proliférer dans l’espace marchand des « datamatrix », « flashcode » ou « QR-code ». Ces codes-barres bidimensionnels permettent avec l’aide d’un smartphone, d’accéder à Internet en mobilité. L’objectif de ce livre est de mesurer la capacité d’un tel dispositif à activer, du côté du consommateur, la disposition qui lui est confiée, la curiosité, ou plutôt de mettre au jour les processus qui rendent une telle activation possible. En effet, parce que le code-barres 2D ne signifie rien pour le consommateur mais pointe vers une information mystérieuse qu’on lui propose de découvrir, il tente d’intriguer le consommateur et d’inviter le consommateur ainsi intrigué à le décoder. Ce livre propose de parler de « curiositif » pour désigner ce genre de dispositif qui joue sur la curiosité. Le livre propose d’abord de prendre la mesure de la technologisation du commerce, en dressant l’inventaire des dispositifs de ce type : datamatrix, mais aussi réalité augmentée, systèmes de lecture de l’environnement, vitrines interactives, etc. La suite de l’ouvrage est consacrée à l’analyse de l’introduction du code-barres bidimensionnel sur le marché du vin. L’auteur propose d’abord d’évaluer le devenir possible de ce curiositif, machin sans lendemain ou machine d’avenir ? – grâce à une anamnèse, en pariant que c’est vers les curiosités technologiques du passé qu’il vaut mieux se tourner si l’on veut saisir le sort des technologies de curiosité d’aujourd’hui. L’enquête se poursuit par l’examen d’un cas empirique, dans lequel le datamatrix permet d’obtenir des informations additionnelles sur une bouteille de vin. Après avoir mieux présenté ce terrain, l’auteur s’efforce de cerner les potentialités du code-barres bidimensionnel puis d’estimer son accueil possible auprès du public, avant d’observer les usagers à l’épreuve de son usage concret. Au terme de ce parcours, il devient possible de mieux évaluer les modalités et les chances d’insertion d’un curiositif dans son marché et, au-delà, de cerner quels sont les mécanismes technologiques, sociaux et marchands qui sous-tendent le succès – ou l’échec – de telles innovations.","authors":["Franck Cochoy"],"meta":["January 2011","Publisher: Le Bord de l'EauISBN: 2356871489"],"references":[]}