{"id":"268347770_LAS_TECNOLOGIAS_DE_LA_INFORMACION_Y_LA_COMUNICACION_EN_EDUCACION_ESPECIAL","abstract":"1. INTRODUCCION La incorporación de las tecnologías de la información y la comunicación al ámbito educativo ha generado grandes expectativas, y muy especialmente en el campo de la discapacidad donde los desarrollos en torno al hardware con adaptaciones, creaciones y transformaciones han beneficiado enormemente a estas personas. Ejemplo de ello son las prótesis para la deficiencia sensorial auditiva, las pantallas táctiles, los emuladores de teclado, los teclados de conceptos; todos ellos son dispositivos que facilitan la comunicación y la exploración del entorno. En el plano pedagógico, muchos trabajos han dado cuenta del uso que se hace de las computadoras en el aula; específicamente en nuestro medio se pudieron conocer muchas experiencias que se desarrollan en distintos servicios de educación especial. Se realizan proyectos áulicos para usar la computadora puntualmente el procesador de texto, por ejemplo, para editar una revista o publicar un cuento. 1 De las observaciones y entrevistas realizadas en el trabajo citado, se desprende que de las tecnologías de la información y la comunicación la que adquiere relevancia es la computadora. No se observó la inclusión en las propuestas curriculares de otras herramientas tecnológicas de uso cotidiano en el contexto, tal como la T.V o el teléfono celular. A partir de lo expuesto, y en consonancia con los paradigmas vigentes en Educación Especial consideramos que se necesita implementar y evaluar propuestas educativas que permitan el enriquecimiento intelectual, desde una perspectiva holística y globalizadora, que incluyan las herramientas tecnológicas que usan los niños y las familias. Un aporte importante para el desarrollo de estas propuestas integradoras, tanto para la docencia como para la investigación, es el Proyecto Inteligencia Harvard que lleva a cabo el Centro Tecnológico Educativo en Harvard donde usan y evalúan las tecnologías de la información como medios interactivos que ayudan a pensar y a aprender, en contextos sociales cooperativos. Este modelo educativo nos sirvió como base para diseñar un proyecto de investigación para aplicar y evaluar un programa específico destinado a niños pequeños con discapacidad.","authors":["María Divito","Claudia Mabel Isabel-Cavallero","Pahud","Fernanda"],"meta":[],"references":[]}