{"id":"268344776_Performance_analysis_of_Dynamic_MANET_On-demand_DYMO_Routing_protocol_Performance_analysis_of_Dynamic_MANET_On-_demand_DYMO_Routing_protocol","abstract":"Routing in a MANET is challenging because of the dynamic topology and the lack of an existing fixed infrastructure. In such a scenario a mobile host can act as both a host and a router forwarding packets for other mobile nodes in the network. Routing protocols used in mobile ad hoc networks (MANET) must adapt to frequent or continual changes of topology, while simultaneously limiting the impact of tracking these changes on wireless resources. The DYMO protocol intended for the use by mobile nodes in wireless multihop ad hoc networks. It can adapt to the changing network topology and determine unicast routes between nodes within the network. This paper presents a comprehensive summarization and a comparative study of the Dynamic MANET On-demand (DYMO) protocol for MANET and simulation analysis of existing protocols DSR and AODV and comparison among them under varying number of nodes. Comparative study shows that DYMO is only a good choice if the nodes are mobile and wireless multihop. We have compared the performance of DSR and AODV with DYMO protocol by taking some performance metrics. Result shows that DYMO simulation provides better performance than DSR when compared in a given network topology with respect to throughput, packet loss, delay, packet delivery ratio, normalized routing load.","authors":["Sukant Kishoro Bisoy","Sarita Sahu"],"meta":["January 2012","DOI:10.47893/IJCCT.2011.1082"],"references":["250021343_Experimental_Performance_Evaluation_of_AODV_Implementations_in_Static_Environments","242628825_Wireless_ad_hoc_networking-The_art_of_networking_without_a_network","221611438_Ad-hoc_On-Demand_Distance_Vector_Routing","221017789_Upgrading_Performance_of_DSR_Routing_Protocol_in_Mobile_Ad_Hoc_Networks","284602927_Ad_hoc_on-demand_distance_vector_AODV_routing","247393587_Request_for_Comments_Ad_hoc_on-demand_distance_vector_AODV_routing","245833140_Das_Ad_hoc_On-Demand_Distance_Vector_AODV_Routing_work_in_progress","239052893_The_Dynamic_Source_Routing_Protocol_for_Mobile_Ad_Hoc_Networks","237128285_Flow_State_in_the_Dynamic_Source_Routing_Protocol_for_Mobile_Ad_Hoc_Networks","4003973_A_user_level_framework_for_ad_hoc_routing","2440375_Ad_hoc_On-Demand_Distance_Vector_AODV_Routing"]}