{"id":"268452200_Robust_Exponential_Memory_in_Hopfield_Networks","abstract":"The Hopfield recurrent neural network is a classical auto-associative model of memory, in which collections of symmetrically coupled McCulloch–Pitts binary neurons interact to perform emergent computation. Although previous researchers have explored the potential of this network to solve combinatorial optimization problems or store reoccurring activity patterns as attractors of its deterministic dynamics, a basic open problem is to design a family of Hopfield networks with a number of noise-tolerant memories that grows exponentially with neural population size. Here, we discover such networks by minimizing probability flow, a recently proposed objective for estimating parameters in discrete maximum entropy models. By descend-ing the gradient of the convex probability flow, our networks adapt synaptic weights to achieve robust exponential storage, even when presented with vanishingly small numbers of training patterns. In addition to providing a new set of low-density error-correcting codes that achieve Shannon’s noisy channel bound, these networks also efficiently solve a variant of the hidden clique problem in computer science, opening new avenues for real-world applications of computational models originating from biology.","authors":["Christopher Hillar","Ngoc Tran"],"meta":["January 2018The Journal of Mathematical Neuroscience 8(1)","DOI:10.1186/s13408-017-0056-2","SourcearXiv"],"references":["280695502_A_Three-Threshold_Learning_Rule_Approaches_the_Maximal_Capacity_of_Recurrent_Neural_Networks","260800833_Noise_Facilitation_in_Associative_Memories_of_Exponential_Capacity","305380944_The_organization_of_behavior","304405348_On_computable_numbers_with_an_application_to_the_Entscheidungsproblem","297123726_Updating_Quasi-Newton_Matrices_with_Limited_Storage","295833452_Computational_principles_of_memory","292215395_Neural_networks_and_physical_systems_with_emergent_collective_computational_abilities","287792671_On_a_modification_of_chebyshev's_inequality_and_of_the_error_formula_of_laplace","284713004_Efficient_Associative_Computation_with_Discrete_Synapses","284027053_Exactly_soluble_model_of_a_spin_glass"]}