{"id":"268451688_Fracpairs_fractions_over_a_reduced_commutative_ring","abstract":"In the well-known construction of the field of fractions, division by zero is\nexcluded. We introduce \"fracpairs\" as pairs subject to laws consistent with the\nuse of the pair as a fraction, but do not exclude denominators to be zero. We\ninvestigate fracpairs over a reduced commutative ring (that is, a commutative\nring that has no nonzero nilpotent elements) and find that these constitute a\n\"common meadow\" (a field equipped with a multiplicative inverse and an\nadditional element \"a\" that is the inverse of zero and propagates through all\noperations). We prove that fracpairs over Z constitute a homomorphic pre-image\nof the common meadow Qa, the field Q of rational numbers expanded with an\na-totalized inverse. Moreover, we characterize the initial common meadow as an\ninitial algebra of fracpairs. Next, we define canonical term algebras (and\ntherewith normal forms) for fracpairs over the integers and some related\nstructures that model the rational numbers, and we provide negative results\nconcerning their associated term rewriting properties. Then we define \"rational\nfracpairs\" that constitute an initial algebra that is isomorphic to Qa.\nFinally, we express some negative conjectures concerning alternative\nspecifications for these (concrete) datatypes.","authors":["Jan Bergstra","Alban Ponse"],"meta":["November 2014Indagationes Mathematicae 27(3)","DOI:10.1016/j.indag.2016.01.007","SourcearXiv"],"references":["263091709_Three_Datatype_Defining_Rewrite_Systems_for_Datatypes_of_Integers_each_extending_a_Datatype_of_Naturals","237010083_Cancellation_Meadows_a_Generic_Basis_Theorem_and_Some_Applications","234820363_Module_Algebra","234800298_The_rational_numbers_as_an_abstract_data_type","234754890_Equational_Specifications_Complete_Term_Rewriting_Systems_and_Computable_and_Semicomputable_Algebras","1916835_Cancellation_Meadows_A_Generic_Basis_Theorem_and_Some_Applications","1736440_The_initial_meadows","324433038_Algebra_I","244955308_A_First_Course_in_Noncommutative_Rings","242355338_A_Generic_Basis_Theorem_for_Cancellation_Meadows","222652039_Inversive_Meadows_and_Divisive_Meadows","222207254_Termination_orderings_for_associative-commutative_rewriting_systems","221220685_Rewrite_Systems_for_Natural_Integral_and_Rational_Arithmetic"]}