{"id":"268426233_Building_Blocks_for_Mobile_Games_A_Multiplayer_Framework_for_App_Inventor_for_Android","abstract":"Building Blocks for Mobile Games is a client-server multiplayer game-building-framework for the App Inventor for Android platform. The Building Blocks for Mobile Games multiplayer framework includes an App Inventor component and a Game Server running on Google App Engine. The client-side-component packages the complexity of web service calls, data transfer and game state management into a set of graphical code blocks that allow users without programming experience to create Android applications that can access the Game Server API. The Game Server provides basic functionality that can be used to create simple multiplayer games and message-passing applications, such as a multiuser bulletin board. The Game Server is also extensible and can be enhanced with custom modules which provide server commands that implement game logic, perform database operations, access third-party web services, and read RSS feeds. Custom modules were used with Building Blocks to develop a multiplayer card game, a variant of Bulls and Cows with a shared scoreboard, an application that accesses Amazon's book search API and a pair of applications for creating, managing and voting in polls. The clients for these applications are built entirely with the App Inventor graphical blocks language, which can be assembled into Android Applications. The custom modules that support the client programs average less than 50 lines of Python code.","authors":["Bill Magnuson"],"meta":["February 2011"],"references":["221536878_Engaging_students_through_mobile_game_development","221391519_CAN_mobile_gaming_be_improved","220491363_Game-Based_Learning_with_Ubiquitous_Technologies","242393297_Learning_to_Program_with_Alice","228296879_StarLogo_TNG_The_Convergence_of_Graphical_Programming_and_Text_Processing","220426578_Mobile_gaming","38001837_OpenBlocks_an_extendable_framework_for_graphical_block_programming_systems"]}