{"id":"268495603_A_new_stream_cipher_based_on_Fialka_M-125","abstract":"In 2010, a new cipher Hummingbird by [Engels, D.-Fan, X.-Gong, G.-Hu, H.-Smith, E. M. Hummingbird: Ultra-Lightweight Cryptography for Resource-Constrained Devices, in: 1st International Workshop on Lightweight Cryptography for Resource-Constrained Devices. Tenerife, Canary Islands, Spain, January 2010] was proposed. It is a combination of both block and stream cipher and its design was inspired and motivated by the Enigma machine. The encryption process of the cipher can be considered as a continuous running of a rotor-cipher. Four block ciphers play the role of the rotors that apply the permutation to the 16-bit words. This cipher motivated us to investigate a new cipher design based on a Fialka cipher machine. Fialka M-125 is an Enigma based rotor-cipher machine used during the Cold War. It is considered one of the most secure cipher machines. Advantages of this cipher are based on the elimination of the Enigma's known weaknesses. There are no known attacks on this cipher. In this paper we introduce a new cipher based on the Fialka machine. We transform the Fialka encryption algorithm to a modern stream cipher. The rotors are represented as S-boxes and shift registers are used to provide the rotor clocking. We propose three different versions of the cipher and investigate the statistical properties of their outputs. In the article we also provide basic implementation details and basic performance analysis.","authors":["Eugen Antal","Viliam Hromada"],"meta":["November 2013Tatra Mountains Mathematical Publications 57(1)","DOI:10.2478/tmmp-2013-0038"],"references":["258402720_NIST_Special_Publication_800-22_A_Statistical_Test_Suite_for_the_Validation_of_Random_Number_Generators_and_Pseudo_Random_Number_Generators_for_Cryptographic_Applications","220796797_Hummingbird_Ultra-Lightweight_Cryptography_for_Resource-Constrained_Devices","235090427_A_Statistical_Test_Suite_for_Random_and_Pseudorandom_Number_Generators_for_Cryptographic_Applications"]}