{"id":"268514299_PCA_Based_Offline_Handwritten_GurmukhiCharacter_Recognition_System","abstract":"Principal component analysis (PCA) has been used widely in pattern recognition to reduce the extent of the data. In this paper, we explore using this technique to recognize offline handwritten Gurmukhi characters, and a system for offline handwritten Gurmukhi character recognition using PCA is proposed. The system first prepares a skeleton of the character so that meaningful feature information about the character can be extracted. For classification, we used k-nearest neighbor, Linear-SVM, polynomial-SVM and RBF-SVM based approaches and combinations of these approaches. In this work, we collected 16,800 samples of isolated offline handwritten Gurmukhi characters. These samples were divided into three categories. In category 1 (5600 samples), each Gurmukhi character was written 100 times by a single writer. In category 2 (5600 samples), each Gurmukhi character was written 10 times by 10 different writers, and in category 3 (5600 samples), each Gurmukhi character was written by 100 different writers. The set of the basic 35 akhars of Gurmukhi has been considered here. A partitioning strategy for selecting the training and testing patterns is also explored in this work. We used zoning, diagonal, directional, transition, intersection and open end point, parabola curve fitting–based and power curve fitting–based feature extraction in order to find the feature set for a given character. The proposed system achieves a recognition accuracy of 99.06% in category 1, 98.73% in category 2 and 78.30% in category 3.","authors":["Munish Kumar","Rishav Kumar Sharma","M. K. Jindal"],"meta":["October 2013The Smart Computing Review 3(5):346-357","DOI:10.6029/smartcr.2013.05.005"],"references":["268514513_Classification_of_Characters_and_Grading_Writers_in_Offline_Handwritten_Gurmukhi_Script","268514406_SVM_based_Offline_Handwritten_Gurmukhi_Character_Recognition","268514262_Offline_Handwritten_Gurmukhi_Character_Recognition_Using_Curvature_Feature","254014401_Classification_of_characters_and_grading_writers_in_offline_handwritten_Gurmukhi_script","315616677_A_System_for_Off-Line_Oriya_Handwritten_Character_Recognition_Using_Curvature_Feature","315615720_Handwritten_Bangla_Compound_Character_Recognition_Using_Gradient_Feature","270529390_Evaluation_of_Different_Feature_Extractors_and_Classifiers_for_Offline_Handwritten_Devnagari_Character_Recognition","261859283_HMM-based_online_handwritten_Gurmukhi_character_recognition","257472202_Offline_recognition_of_handwritten_Bangla_characters_An_efficient_two-stage_approach","234803275_Suen_CY_A_Fast_Parallel_Algorithm_for_Thinning_Digital_Patterns_Communications_of_the_ACM_273_236-239"]}