{"id":"268557575_Nonlinear_Position_Control_Approaches_for_Quadcopters_Using_a_Novel_State_Representation","abstract":"This paper presents two novel nonlinear control designs for quadcopters using backstepping and dynamic inversion approaches. The focus of this work is to introduce a novel state variable gB in the backstepping and dynamic inversion control design. By the new state variable direct non-cascaded position control using backstepping is made possible for the quadcopter. Asymptotical stability is guaranteed by the Lyapunov based control law. To maximize the control bandwidth, analytical computations of the virtual control derivatives are preferred and command filtering is used only when the analytical solution is not available. Another dynamic inversion approach using the new state variable gB is designed with a classical structure: position loop of relative degree (RD) 2 plus attitude loop of RD 2. This design has comparatively lower control bandwidth than the backstepping design but good structural robustness. It is especially suitable for quadcopters equipped with relatively low quality vision sensor. It results in a clean separation between the inner loop and the outer loop, in terms of bandwidth, sensor locations and data fusion. In the end, flight tests are performed to verify the designs. Good position tracking is achieved for both controllers. Differences in the control bandwidth and robustness are emphasized. © 2012 by the American Institute of Aeronautics and Astronautics, Inc. All rights reserved.","authors":["Jian Wang","Thomas Raffler","Florian Holzapfel"],"meta":["August 2012","DOI:10.2514/6.2012-4913","Conference: AIAA Guidance, Navigation, and Control Conference"],"references":["266039048_Block_Backstepping_NDI_and_Related_Cascade_Designs_for_Efficient_Development_of_Nonlinear_Flight_Control_Laws","224685297_Backstepping_Control_for_a_Quadrotor_Helicopter","224471846_Command_Filtered_Backstepping","221076856_Backstepping_and_Sliding-mode_Techniques_Applied_to_an_Indoor_Micro_Quadrotor","312942865_Backstepping_and_Sliding-mode_Techniques_Applied_to_an_Indoor_Micro_Quadrotor","291412381_Bilinearization_of_Nonlinear_Systems","268556555_Simulation_and_Robust_Backstepping_Control_of_a_Quadrotor_Aircraft","268554074_Dynamic_Inversion_Based_Control_Concept_with_Application_to_an_Unmanned_Aerial_Vehicle","226029795_Novel_Dynamic_Inversion_Architecture_Design_for_Quadrocopter_Control","224459823_Nonlinear_control_of_a_quadrotor_micro-UAV_using_feedback-linearization"]}