{"id":"268689927_An_architecture_for_automatically_developing_secure_OLAP_applications_from_models","abstract":"Decision makers query enterprise information stored in Data Warehouses (DW) by using tools (such as On-Line Analytical Processing (OLAP) tools) which use specific views or cubes from the corporate DW or Data Marts, based on the multidimensional modeling. Since the information managed is critical, security constraints have to be correctly established in order to avoid unauthorized accesses.Objective\nIn previous work we have defined a Model-Driven based approach for developing a secure DWs repository by following a relational approach. Nevertheless, is also important to define security constraints in the metadata layer that connects the DWs repository with the OLAP tools, that is, over the same multidimensional structures that final users manage. This paper defines a proposal to develop secure OLAP applications and incorporates it into our previous approach.Method\nOur proposal is composed of models and transformations. Our models have been defined using the extension capabilities from UML (conceptual model) and extending the OLAP package of CWM with security (logical model). Transformations have been defined by using a graphical notation and implemented into QVT and MOFScript. Finally, this proposal has been evaluated through case studies.ResultsA complete MDA architecture for developing secure OLAP applications. The main contributions of this paper are: improvement of a UML profile for conceptual modeling; definition of a logical metamodel for OLAP applications; and definition and implementation of transformations from conceptual to logical models, and from logical models to the secure implementation into a specific OLAP tool (SSAS).Conclusion\nOur proposal allows us to develop secure OLAP applications, providing a complete MDA architecture composed of several security models and automatic transformations towards the final secure implementation. Security aspects are early identified and fitted into a most robust solution that provides us a better information assurance and a saving of time in maintenance.","authors":["Carlos Blanco","Ignacio García Rodríguez de Guzmán","Eduardo Fernández-Medina","Juan Trujillo"],"meta":["November 2014Information and Software Technology 59","DOI:10.1016/j.infsof.2014.10.008"],"references":["220349216_Designing_Secure_Data_Warehouses_by_Using_MDA_and_QVT","3679163_Towards_modeling_and_reasoning_support_for_early-phase_requirements_engineering","2902512_A_Pragmatic_Approach_to_Conceptual_Modeling_of_OLAP_Security","2413225_Building_Secure_Data_Warehouse_Schemas_from_Federated_Information_Systems","261084373_Security_Engineering_Approach_to_Support_Software_Security","250034971_Model_Driven_Architecture","235779853_Meta_Object_Facility_MOF_20_QueryViewTransformation_Specification_11","234827165_Editorial_Model-Driven_Development_for_secure_information_systems","229061763_Verification_of_Security_Coherence_in_Data_Warehouse_Designs","223806493_Developing_secure_data_warehouses_with_a_UML_extension","223682955_An_engineering_process_for_developing_Secure_Data_Warehouses","223571120_Building_a_secure_star_schema_in_data_warehouses_by_an_extension_of_the_relational_package_from_CWM","223194602_A_UML_20_profile_to_define_security_requirements_for_Data_Warehouses","222820160_Access_control_and_audit_model_for_the_multidimensional_modeling_of_data_warehouses","220790195_Evaluation_of_Approaches_for_Modeling_of_Security_in_Data_Warehouses","220609641_Model-Driven_Development_for_secure_information_systems","220579656_Extended_RBAC_-_Based_Design_and_Implementation_for_a_Secure_Data_Warehouse","220579640_How_to_implement_multidimensional_security_into_OLAP_tools","220403761_Model_Driven_Security_From_UML_models_to_access_control_infrastructures","220393180_Model-driven_multidimensional_modeling_of_secure_data_warehouses","42794369_Secure_Systems_Development_with_UML"]}