{"id":"268690685_Carrot_and_stick_20_The_benefits_of_natural_and_motivational_prosody_in_computer-assisted_learning","abstract":"For acquiring new skills or knowledge, contemporary learners frequently rely on the help of educational technologies supplementing human teachers as a learning aid. In the interaction with such systems, speech-based communication between the human user and the technical system has increasingly gained importance. Since spoken computer output can take on a variety of forms depending on the method of speech generation and the employment of prosodic modulations, the effects of such auditory variations on the user’s learning achievement require systematic investigation. The experiment reported here examined the specific effects of speech generation method and prosody of spoken system feedback in a computer-supported learning environment, and may serve as validational tool for future investigations of spoken computer feedback effects on learning. Learning performance in a basic cognitive task was compared between users receiving pre-recorded, naturally spoken system feedback with neutral prosody, pre-recorded feedback with motivating (praising or blaming) prosody, or computer-synthesized feedback. The observed results provide empirical evidence that users of technical tutoring systems benefit from pre-recorded, naturally spoken feedback, and do even more so from feedback with motivational prosodic modulations matching their performance success. Theoretical implications and considerations for future implementations of spoken feedback in computer-based educational systems are discussed.","authors":["Susann Wolff","André Brechmann"],"meta":["November 2014Computers in Human Behavior 43","DOI:10.1016/j.chb.2014.10.015"],"references":["317953663_Self-Efficacy_Toward_a_Unifying_Theory_of_Behavioral_Change","316807278_Intrinsic_Motivation_and_Self-Determination_in_Human_Behavior","313557086_Individual_interest_and_its_implications_for_understanding_intrinsic_motivation","304262704_Achievement_attributions_and_self-instructions_under_competitive_and_individualistic_goal_structures","298302479_The_Temporal_Contingency_of_Feedback_Effects_on_Brain_Activity","297187930_COMMUNICATING_EMOTION_-_THE_ROLE_OF_PROSODIC_FEATURES","289963904_Intrinsic_and_extrinsic_motivations_Classic_definitions_and_new_directions","289963001_Intrinsic_and_Extrinsic_Motivations_Classic_Definition_and_New_Directions","289320575_Trust_in_Computers_The_Computers-Are-Social-Actors_CASA_Paradigm_and_Trustworthiness_Perception_in_Human-Computer_Communication","287832954_Explorations_in_Personality"]}