{"id":"268689412_Understanding_Image_Representations_by_Measuring_Their_Equivariance_and_Equivalence","abstract":"Despite the importance of image representations such as histograms of\noriented gradients and deep Convolutional Neural Networks (CNN), our\ntheoretical understanding of them remains limited. Aiming at filling this gap,\nwe investigate three key mathematical properties of representations:\nequivariance, invariance, and equivalence. Equivariance studies how\ntransformations of the input image are encoded by the representation,\ninvariance being a special case where a transformation has no effect.\nEquivalence studies whether two representations, for example two different\nparametrisations of a CNN, capture the same visual information or not. A number\nof methods to establish these properties empirically are proposed, including\nintroducing transformation and stitching layers in CNNs. These methods are then\napplied to popular representations to reveal insightful aspects of their\nstructure, including clarifying at which layers in a CNN certain geometric\ninvariances are achieved. While the focus of the paper is theoretical, direct\napplications to structured-output regression are demonstrated too.","authors":["Karel Lenc","Andrea Vedaldi"],"meta":["May 2019International Journal of Computer Vision 127(8)","DOI:10.1007/s11263-018-1098-y","SourcearXiv"],"references":["319770820_Histograms_of_Oriented_Gradients_for_Human_Detection","319770430_Rich_feature_hierarchies_for_accurate_object_detection_and_semantic_segmentation","319770363_Deep_Fisher_Networks_for_Large-Scale_Image_Classification","319770357_DeCAF_A_Deep_Convolutional_Activation_Feature_for_Generic_Visual_Recognition","319770291_Very_Deep_Convolutional_Networks_for_Large-Scale_Image_Recognition","319770284_Edge_Boxes_Locating_Object_Proposals_from_Edges","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","319769911_Faster_R-CNN_Towards_Real-Time_Object_Detection_with_Region_Proposal_Networks","311609041_Deep_Residual_Learning_for_Image_Recognition","310752533_Visualizing_and_understanding_convolutional_networks"]}