{"id":"268712358_Mechanism_Design_without_Money","abstract":"Despite impossibility results on general domains, there are some classes of situations in which there exist interesting dominant-strategy mechanisms. While some of these situations (and the resulting mechanisms) involve the transfer of money, we examine some that do not. Specifically, we analyze problems where agents have single-peaked preferences over a one-dimensional “public” policy space; and problems where agents must match with each other. Introduction The Gibbard-Satterthwaite Theorem (Theorem 9. 8) is a Procrustean bed that is escaped only by relaxing its assumptions. In conjunction with the Revelation Principle (Proposition 9. 25), it states that on the general domain of preferences, only dictatorial rules can be implemented in dominant strategies (if the range contains at least three alternatives). In this chapter we escape Procrustes by examining dominant strategy implementation on restricted domains of preferences. In most applications it is clearly unreasonable to assume that agents' preferences are completely unrestricted, as was assumed in the voting context of Section 9.2.4. For instance, in situations involving the allocation of goods, including money, one can safely assume that each agent prefers to receive more money (or other goods). As can be seen in the following chapters, the ability for agents to make monetary transfers allows for a rich class of strategy-proof rules. Nevertheless there are many important environments where money cannot be used as a medium of compensation. This constraint can arise from ethical and/or institutional considerations: many political decisions must be made without monetary transfers; organ donations can be arranged by “trade” involving multiple needy patients and their relatives, yet monetary compensation is illegal. © Noam Nisan, Tim Roughgarden, Éva Tardos, Vijay V. Vazirani 2007.","authors":["James Schummer","Rakesh V. Vohra"],"meta":["January 2007","DOI:10.1017/CBO9780511800481.012"],"references":["24058609_Strategy-Proofness_and_Median_Voters","10433313_The_Matching_Program_for_Intern_Placement"]}