{"id":"268819903_Audio_Splicing_Detection_and_Localization_Using_Environmental_Signature","abstract":"Audio splicing is one of the most common manipulation techniques in the area\nof audio forensics. In this paper, the magnitudes of acoustic channel impulse\nresponse and ambient noise are proposed as the environmental signature.\nSpecifically, the spliced audio segments are detected according to the\nmagnitude correlation between the query frames and reference frames via a\nstatically optimal threshold. The detection accuracy is further refined by\ncomparing the adjacent frames. The effectiveness of the proposed method is\ntested on two data sets. One is generated from TIMIT database, and the other\none is made in four acoustic environments using a commercial grade microphones.\nExperimental results show that the proposed method not only detects the\npresence of spliced frames, but also localizes the forgery segments with near\nperfect accuracy. Comparison results illustrate that the identification\naccuracy of the proposed scheme is higher than the previous schemes. In\naddition, experimental results also show that the proposed scheme is robust to\nMP3 compression attack, which is also superior to the previous works.","authors":["Hong Zhao","Yifan Chen","Rui Wang","Hafiz Malik"],"meta":["June 2017Multimedia Tools and Applications 76(12)","DOI:10.1007/s11042-016-3758-7","SourcearXiv"],"references":["313544906_Audio-based_context_recognition","307881957_LIBSVM_A_library_for_support_vector_machines","289753689_Securing_speaker_verification_system_against_replay_attack","289426571_The_electric_network_frequency_ENF_as_an_aid_to_authenticating_forensic_digital_audio_recordings_-an_automated_approach","288628256_Source_of_ENF_in_battery-powered_digital_recordings","288389724_Statistical_tools_for_multimedia_forensics","288389489_Detecting_butt-spliced_edits_in_forensic_digital_audio_recordings","288382727_Applications_of_ENF_Analysis_in_Forensic_Authentication_of_Digital_Audio_and_Video_Recordings","285828530_Microphone_identification_using_higher-order_statistics","280940018_Pattern_Recognition_and_Machine_Learning"]}