{"id":"26883425_First-Person_Shooter_Games_as_a_Way_of_Connecting_to_People_Brothers_in_Blood","abstract":"This work seeks to understand young adults' motives for online gaming and extends previous research concerning social interaction in virtual contexts. The focus of the study is on Counter-Strike and World of Warcraft. Drawing on Baudrillard's concept of simulacra, an analysis of young gamers' motivation for gaming is carried out. The empirical data was generated employing a mix of qualitative methods such as researcher introspection, observation, and interviews with young adults in two different online gaming centers in Stockholm during 2006 and 2007. The results show that online gaming is foremost motivated by social reasons providing the gamers with a possibility of cooperation and communication. Some of the gamers in the study were motivated by escapism. Online gaming also provides gamers with an experience in which \"flow\" can be obtained and serves as a \"hallucination of the real,\" making it possible to do things and try out behaviors that would be impossible to do or try in real life. The gamers felt that online gaming gave them more experiences than real life could provide. For research purposes, this work provides a better understanding of the motivational aspects for gamers.","authors":["Maria Frostling-Henningsson"],"meta":["October 2009Cyberpsychology & behavior: the impact of the Internet, multimedia and virtual reality on behavior and society 12(5):557-62","DOI:10.1089/cpb.2008.0345","SourcePubMed"],"references":["224927532_Flow_The_Psychology_of_Optimal_Experience","24098921_Liberatory_Postmodernism_and_the_Reenchantment_of_Consumption","6761618_Sharing_Tips_with_Strangers_Exploiting_Gift_Culture_in_Computer_Gaming","6501010_Appeal_of_Playing_Online_First_Person_Shooter_Games","275848160_The_Transparent_Society","200026149_Flow_The_Psychology_of_Optimal_Experience","10843353_Breaking_the_Stereotype_The_Case_of_Online_Gaming","8381349_Demographic_Factors_and_Playing_Variables_in_Online_Computer_Gaming","6598675_Motivations_for_Play_in_Online_Games","6129334_Social_Interactions_in_Massively_Multiplayer_Online_Role-Playing_Gamers"]}