{"id":"26880895_Assistive_technology_applied_to_education_of_students_with_visual_impairment","abstract":"Verify the application of assistive technology, especially information technology in the education of blind and low-vision students from the perceptions of their teachers.\nDescriptive survey study in public schools in three municipalities of the state of São Paulo, Brazil. The sample comprised 134 teachers.\nAccording to the teachers' opinions, there are differences in the specificities and applicability of assistive technology for blind and low-vision students, for whom specific computer programs are important. Information technology enhances reading and writing skills, as well as communication with the world on an equal basis, thereby improving quality of life and facilitating the learning process. The main reason for not using information technology is the lack of planning courses. The main requirements for the use of information technology in schools are enough computers for all students, advisers to help teachers, and pedagogical support.\nAssistive technology is applied to education of students with visual impairment; however, teachers indicate the need for infrastructure and pedagogical support. Information technology is an important tool in the inclusion process and can promote independence and autonomy of students with visual impairment.","authors":["Cássia Cristiane de Freitas Alves","Gelse Beatriz Martins Monteiro","Suzana Rabello","Maria Elisabete Rodrigues Freire Gasparetto"],"meta":["August 2009Revista Panamericana de Salud Pública 26(2):148-52","DOI:10.1590/S1020-49892009000800007","SourcePubMed"],"references":["262596296_Low_vision_student_in_the_regular_school_A_challenge_to_the_teacher","26378365_Cirurgia_de_catarata_o_porque_dos_excluidos","15494094_Global_Data_on_Blindness","8352583_Causes_of_low_vision_and_use_of_optical_aids_in_the_elderly","268354391_AS_NOVAS_TECNOLOGIAS_NA_ESCOLA_E_NO_MUNDO_ATUAL_FATOR_DE_INCLUSAO_SOCIAL_DO_ALUNO_COM_NECESSIDADES_ESPECIAIS","262518539_Reasons_for_not_having_cataract_surgery","242394144_Assistive_technologies_Principles_and_practice","232587161_Inclusion_A_guide_for_educators"]}