{"id":"268831480_Lambda_Calculus_Some_Models_Some_Philosophy","abstract":"The chapter presents an exposition of why the λ-calculus has models. The A-calculus was one of the first areas of research of Professor Kleene, in which the experience gained by him was surely beneficial in his later development of the recursive function theory. The chapter discusses a very short historical summary, and it is found that there is considerable overlap with CURRY. There is a review of the theory of functions and relations as sets leading up to the important notion of a continuous set mapping. The problem of the self-application of a function to itself as an argument is discussed in the chapter from a new angle. The model (essentially due to PLOTKIN) of the basic laws of λ -calculus thus results. The chapter describes self-application to recursion by the proof of David Park's theorem to the effect that the least fixed-point operator and the paradoxical combinator are the same in a wide class of well-behaved models. The connection thus engendered to recursion theory (r. e. sets) is outlined, and some remarks on recent results about ill-behaved models and on induction principles are discussed. The theme of type theory and a construction of an (η)-model with fewer -type distinctions is presented. There is a brief discussion of how to introduce more type distinctions into models via equivalence relations. The chapter also presents various points of philosophical disagreement with Professor Curry.","authors":["Dana S. Scott"],"meta":["December 1980Studies in Logic and the Foundations of Mathematics 101","DOI:10.1016/S0049-237X(08)71262-X"],"references":["262493916_Un_theoreme_sur_les_fonctions_d'ensembles","250916555_Some_properties_of_conversion","245281901_ALS_An_analysis_of_logical_substitution","243658427_The_inconsistency_of_certain_formal_logics","242917965_On_the_consistency_of_a_slight_modification_of_NF","239229857_The_Type_Free_Lambda_Calculus","227079997_Die_Axiomatisierung_der_Mengenlehre","226784266_Uber_die_Bausteine_der_mathematischen_Logik","215446114_A_Set_of_Postulates_for_the_Foundation_of_Logic"]}