{"id":"268882245_Fast_detection_of_facial_wrinkles_based_on_Gabor_features_using_image_morphology_and_geometric_constraints","abstract":"Facial wrinkles are important features of aging human skin which can be incorporated in several image-based applications related to aging. Facial wrinkles are 3D features of skin and appear as subtle discontinuities or cracks in surrounding skin texture. However, facial wrinkles can easily be masked by illumination/acquisition conditions in 2D images due to the specific nature of skin surface texture and its reflective properties. Existing approaches to image-based analysis of aging skin are based on the analysis of wrinkles as texture and not as curvilinear discontinuity/crack features. Previously, we proposed a stochastic approach based on Marked Point Processes (MPP) to localize facial wrinkles as curves. In this paper, we present a fast deterministic algorithm based on Gabor filters and image morphology to improve localization results. We propose image features based on Gabor filter bank to highlight the subtle curvilinear discontinuities in skin texture caused by wrinkles. Then, image morphology is used to incorporate geometric constraints to localize curvilinear shapes of wrinkles at image sites of large Gabor filter responses. Experiments are conducted on two sets of low and high resolution images and results are compared with those of MPP modeling. Experiments show that the proposed algorithm not only is significantly faster than MPP-based approach but also provides visually better results.","authors":["Nazre Batool","Rama Chellappa"],"meta":["August 2014Pattern Recognition 48(3)","DOI:10.1016/j.patcog.2014.08.003"],"references":["263477005_Detection_and_Inpainting_of_Facial_Wrinkles_Using_Texture_Orientation_Fields_and_Markov_Random_Field_Modeling","262359069_Modeling_and_Detection_of_Wrinkles_in_Aging_Human_Faces_Using_Marked_Point_Processes","261387448_A_Markov_Point_Process_model_for_wrinkles_in_human_faces","261115592_Assessment_of_facial_wrinkles_as_a_soft_biometrics","258381376_Automatic_Road_Pavement_Assessment_with_Image_Processing_Review_and_Comparison","240308788_FAIR_a_Fast_Algorithm_for_Document_Image_Restoration","226020675_Skin_Texture_Modeling","260636424_Morphology-Based_Crack_Detection_for_Steel_Slabs","225299838_Assessing_Facial_Wrinkles_Automatic_Detection_and_Quantification","224824117_Blood_vessel_segmentation_methodologies_in_retinal_images_-_A_survey"]}