{"id":"268874856_Whole-cell_multicolor_superresolution_imaging_using_volumetric_multifocus_microscopy","abstract":"Single molecule-based superresolution imaging has become an essential tool in modern cell biology. Because of the limited depth of field of optical imaging systems, one of the major challenges in superresolution imaging resides in capturing the 3D nanoscale morphology of the whole cell. Despite many previous attempts to extend the application of photo-activated localization microscopy (PALM) and stochastic optical reconstruction microscopy (STORM) techniques into three dimensions, effective localization depths do not typically exceed 1.2 µm. Thus, 3D imaging of whole cells (or even large organelles) still demands sequential acquisition at different axial positions and, therefore, suffers from the combined effects of out-of-focus molecule activation (increased background) and bleaching (loss of detections). Here, we present the use of multifocus microscopy for volumetric multicolor superresolution imaging. By simultaneously imaging nine different focal planes, the multifocus microscope instantaneously captures the distribution of single molecules (either fluorescent proteins or synthetic dyes) throughout an ∼4-µm-deep volume, with lateral and axial localization precisions of ∼20 and 50 nm, respectively. The capabilities of multifocus microscopy to rapidly image the 3D organization of intracellular structures are illustrated by superresolution imaging of the mammalian mitochondrial network and yeast microtubules during cell division.","authors":["Bassam Hajj","Jan Wisniewski","Mohamed El Beheiry","Jiji Chen"],"meta":["November 2014Proceedings of the National Academy of Sciences 111(49)","DOI:10.1073/pnas.1412396111","SourcePubMed"],"references":["262885790_Accessing_the_third_dimension_in_localization-based_super-resolution_microscopy","253647406_ViSP_Representing_single-particle_localizations_in_three_dimensions","243658057_Understanding_diffractive_optic_design_in_the_scalar_domain","233881108_Fast_multicolor_3D_imaging_using_aberration-corrected_multifocus_microscopy","262985247_Isotropic_3D_Super-resolution_Imaging_with_a_Self-bending_Point_Spread_Function","262844747_High-Density_3D_Single_Molecular_Analysis_Based_on_Compressed_Sensing","258760626_Isotropic_3D_Super_Resolution_Imaging_with_Self-Bending_Point_Spread_Function","248705009_Nuclear_Pore_Scaffold_Structure_Analyzed_by_Super-Resolution_Microscopy_and_Particle_Averaging","236090280_FISH-quant_automatic_counting_of_transcripts_in_3D_FISH_images","233788365_Super-resolution_photon-efficient_imaging_by_nanometric_double-helix_point_spread_function_localization_of_emitters_SPINDLE"]}