{"id":"268985247_HiCorrector_A_fast_scalable_and_memory-efficient_package_for_normalizing_large-scale_Hi-C_data","abstract":"Unlabelled: \nGenome-wide proximity ligation assays, e.g. Hi-C and its variant TCC, have recently become important tools to study spatial genome organization. Removing biases from chromatin contact matrices generated by such techniques is a critical preprocessing step of subsequent analyses. The continuing decline of sequencing costs has led to an ever-improving resolution of the Hi-C data, resulting in very large matrices of chromatin contacts. Such large-size matrices, however, pose a great challenge on the memory usage and speed of its normalization. Therefore, there is an urgent need for fast and memory-efficient methods for normalization of Hi-C data. We developed Hi-Corrector, an easy-to-use, open source implementation of the Hi-C data normalization algorithm. Its salient features are (i) scalability-the software is capable of normalizing Hi-C data of any size in reasonable times; (ii) memory efficiency-the sequential version can run on any single computer with very limited memory, no matter how little; (iii) fast speed-the parallel version can run very fast on multiple computing nodes with limited local memory.\n\nAvailability and implementation: \nThe sequential version is implemented in ANSI C and can be easily compiled on any system; the parallel version is implemented in ANSI C with the MPI library (a standardized and portable parallel environment designed for solving large-scale scientific problems). The package is freely available at http://zhoulab.usc.edu/Hi-Corrector/.","authors":["Wenyuan Li","Ke Gong","Qingjiao Li","Frank Alber"],"meta":["November 2014Bioinformatics","DOI:10.1093/bioinformatics/btu747","SourcePubMed"],"references":["263130816_A_statistical_approach_for_inferring_the_3D_structure_of_the_genome","261139787_Three-dimensional_modeling_of_the_P_falciparum_genome_during_the_erythrocytic_cycle_reveals_a_strong_connection_between_genome_architecture_and_gene_expression","258347528_Organization_of_the_Mitotic_Chromosome","258061266_A_high-resolution_map_of_three-dimensional_chromatin_interactome_in_human_cells","231613637_HiCNorm_Removing_biases_in_Hi-C_data_via_Poisson_regression","230786177_Iterative_Correction_of_Hi-C_Data_Reveals_Hallmarks_of_Chromosome_Organization","223976604_Topological_Domains_in_Mammalian_Genomes_Identified_by_Analysis_of_Chromatin_Interactions","221392230_A_Parallel_Matrix_Scaling_Algorithm","258044528_High-Resolution_Mapping_of_the_Spatial_Organization_of_a_Bacterial_Chromosome","226737681_Vector_and_parallel_computing_for_matrix_balancing"]}