{"id":"268992343_Applied_Linear_Regression","abstract":"Master linear regression techniques with a new edition of a classic text Reviews of the Second Edition: \"I found it enjoyable reading and so full of interesting material that even the well-informed reader will probably find something new . . . a necessity for all of those who do linear regression.\" -Technometrics, February 1987 \"Overall, I feel that the book is a valuable addition to the now considerable list of texts on applied linear regression. It should be a strong contender as the leading text for a first serious course in regression analysis.\"-American Scientist, May-June 1987 Applied Linear Regression, Third Edition has been thoroughly updated to help students master the theory and applications of linear regression modeling. Focusing on model building, assessing fit and reliability, and drawing conclusions, the text demonstrates how to develop estimation, confidence, and testing procedures primarily through the use of least squares regression. To facilitate quick learning, the Third Edition stresses the use of graphical methods in an effort to find appropriate models and to better understand them. In that spirit, most analyses and homework problems use graphs for the discovery of structure as well as for the summarization of results. The Third Edition incorporates new material reflecting the latest advances, including: Use of smoothers to summarize a scatterplot Box-Cox and graphical methods for selecting transformations Use of the delta method for inference about complex combinations of parameters Computationally intensive methods and simulation, including the bootstrap method Expanded chapters on nonlinear and logistic regression Completely revised chapters on multiple regression, diagnostics, and generalizations of regression Readers will also find helpful pedagogical tools and learning aids, including: More than 100 exercises, most based on interesting real-world data Web primers demonstrating how to use standard statistical packages, including R, S-Plus, SPSS, SAS, and JMP, to work all the examples and exercises in the text A free online library for R and S-Plus that makes the methods discussed in the book easy to use With its focus on graphical methods and analysis, coupled with many practical examples and exercises, this is an excellent textbook for upper-level undergraduates and graduate students, who will quickly learn how to use linear regression analysis techniques to solve and gain insight into real-life problems.","authors":["Sanford Weisberg"],"meta":["January 2005","DOI:10.1002/0471704091"],"references":[]}