{"id":"269117074_Fast_Rates_by_Transferring_from_Auxiliary_Hypotheses","abstract":"In this work we consider the learning setting where in addition to the\ntraining set, the learner receives a collection of auxiliary hypotheses\noriginating from other tasks. This paradigm, known as Hypothesis Transfer\nLearning (HTL), has been successfully exploited in empirical works, but only\nrecently has received a theoretical attention. Here, we try to understand when\nHTL facilitates accelerated generalization -- the goal of the transfer learning\nparadigm. Thus, we study a broad class of algorithms, a Hypothesis Transfer\nLearning through Regularized ERM, that can be instantiated with any\nnon-negative smooth loss function and any strongly convex regularizer. We\nestablish generalization and excess risk bounds, showing that if the algorithm\nis fed with a good source hypotheses combination, generalization happens at the\nfast rate $\\mathcal{O}(1/m)$ instead of usual $\\mathcal{O}(1/\\sqrt{m})$. We\nalso observe that if the combination is perfect, our theory formally backs up\nthe intuition that learning is not necessary. On the other hand, if the source\nhypotheses combination is a misfit for the target task, we recover the usual\nlearning rate. As a byproduct of our study, we also prove a new bound on the\nRademacher complexity of the smooth loss class under weaker assumptions\ncompared to previous works.","authors":["Ilja Kuzborskij","Francesco Orabona"],"meta":["February 2017Machine Learning 106(2)","DOI:10.1007/s10994-016-5594-4","SourcearXiv"],"references":["280774728_Stability_and_Hypothesis_Transfer_Learning","264545800_Transfer_Learning_Through_Greedy_Subset_Selection","321330188_On_the_Complexity_of_Linear_Prediction_Risk_Bounds_Margin_Bounds_and_Regularization","319770372_Object_Bank_A_High-Level_Image_Representation_for_Scene_Classification_Semantic_Feature_Sparsification","308050388_Stability_and_hypothesis_transfer_learning","281886334_Learning_and_Transferring_Mid-Level_Image_Representations_using_Convolutional_Neural_Networks","271551079_Learning_to_Rank_Using_Privileged_Information","267665795_Understanding_machine_learning_From_theory_to_algorithms","267004513_Foundations_of_Machine_Learning","265210833_Classemes_and_Other_Classifier-Based_Features_for_Efficient_Object_Categorization"]}