{"id":"269185493_A_Survey_of_Scholarly_Literature_Describing_the_Field_of_Bioinformatics_Education_and_Bioinformatics_Educational_Research","abstract":"Bioinformatics education can be broadly defined as the teaching and learning of the use of computer and information technology, along with mathematical and statistical analysis for gathering, storing, analyzing, interpreting, and integrating data to solve biological problems. The recent surge of genomics, proteomics, and structural biology in the potential advancement of research and development in complex biomedical systems has created a need for an educated workforce in bioinformatics. However, effectively integrating bioinformatics education through formal and informal educational settings has been a challenge due in part to its cross-disciplinary nature. In this article, we seek to provide an overview of the state of bioinformatics education. This article identifies: 1) current approaches of bioinformatics education at the undergraduate and graduate levels; 2) the most common concepts and skills being taught in bioinformatics education; 3) pedagogical approaches and methods of delivery for conveying bioinformatics concepts and skills; and 4) assessment results on the impact of these programs, approaches, and methods in students' attitudes or learning. Based on these findings, it is our goal to describe the landscape of scholarly work in this area and, as a result, identify opportunities and challenges in bioinformatics education.\n© 2014 A. J. Magana et al. CBE—Life Sciences Education © 2014 The American Society for Cell Biology. This article is distributed by The American Society for Cell Biology under license from the author(s). It is available to the public under an Attribution–Noncommercial–Share Alike 3.0 Unported Creative Commons License (http://creativecommons.org/licenses/by-nc-sa/3.0).","authors":["Alejandra J. Magana","Manaz Taleyarkhan","Daniela Rivera Alvarado","Michael Kane"],"meta":["December 2014CBE life sciences education 13(4):607-23","DOI:10.1187/cbe.13-10-0193","SourcePubMed"],"references":["274309848_Computational_Thinking","345935494_Developing_A_Multidisciplinary_Online_Cyberinfrastructure_Course_Through_Project_Centric_Bioinformatics","345935489_A_Project_Centric_Approach_For_Cyberinfrastructure_In_Bioinformatics","319393828_Communities_of_Practice_Learning_as_a_Social_System","311472286_A_bioinformatics_track_in_computer_science","307839710_Comparison_of_Online_and_Onsite_Bioinformatics_Instruction_for_a_Fully_Online_Bioinformatics_Master's_Program","296234172_Evolution_as_a_basis_for_bioinformatics_education","291438258_Introducing_bioinformatics_into_the_biology_curriculum_Exploring_the_National_Center_for_Biotechnology_Information","289769171_Aligning_Course_Content_Assessment_and_Delivery_Creating_a_Context_for_Outcome-Based_Education","285600510_Discipline-based_education_research_understanding_and_improving_learning_in_undergraduate_science_and_engineering"]}