{"id":"269116559_Mining_Rooted_Ordered_Trees_under_Subtree_Homeomorphism","abstract":"Mining frequent tree patterns has many practical applications in different\nareas such as XML data, bioinformatics and World Wide Web. The crucial step in\nfrequent pattern mining is frequency counting which involves performing a\nmatching operator to find occurrences (instances) of a pattern tree in database\ntrees. A widely used matching operator for tree-structured data is subtree\nhomeomorphism, where an edge in the pattern tree is mapped onto an\nancestor-descendant relationship in the database tree. Tree patterns that are\nfrequent under subtree homeomorphism are usually called embedded patterns. In\nthis paper, we present an efficient algorithm for subtree homeomorphism with\napplication to frequent pattern mining. We propose a compact data-structure,\ncalled occ, which can encode and represent several occurrences of a pattern\ntree. We then define efficient join operations on the occ data-structure, which\nhelp us count occurrences of tree patterns according to occurrences of their\nproper subtrees. Based on the proposed subtree homeomorphism method, we develop\nan effective pattern mining algorithm, called TPMiner. We evaluate the\nefficiency of TPMiner on several real-world and synthetic datasets. Our\nextensive experiments confirm that TPMiner always outperforms well-known\nexisting algorithms, and in several cases the improvement with respect to a\nspecific existing algorithm is significant.","authors":["Mostafa Haghir Chehreghani","Maurice Bruynooghe"],"meta":["September 2016Data Mining and Knowledge Discovery 30(5)","DOI:10.1007/s10618-015-0439-5","SourcearXiv"],"references":["228866583_Efficiently_mining_frequent_embedded_unordered_trees","227311044_Mining_frequent_closed_rooted_trees","226845985_Using_trees_to_mine_multirelational_databases","225689690_TwigList_Make_Twig_Pattern_Matching_Fast","278249047_Efficient_data_mining_for_maximal_frequent_subtrees","272353344_Inductive_Logic_Programming","267114728_Graph_theory_4th_ed","247350412_Recent_advances_in_inductive_logic_programming","243775787_Verkamo_Fast_Discovery_of_Association_Rules","228877793_Efficient_discovery_of_frequent_unordered_trees","225145215_XRules_An_effective_algorithm_for_structural_classification_of_XML_data","224210376_OInduced_An_Efficient_Algorithm_for_Mining_Induced_Patterns_From_Rooted_Ordered_Trees","222547202_The_Gaston_Tool_for_Frequent_Subgraph_Mining","221654250_2PXMiner_an_efficient_two_pass_mining_of_frequent_XML_query_patterns","221654683_CloseGraph_Mining_Closed_Frequent_Graph_Patterns"]}