{"id":"269223292_A_Workflow_for_Characterizing_Nanoparticle_Monolayers_for_Biosensors_Machine_Learning_on_Real_and_Artificial_SEM_Images","abstract":"A persistent challenge in materials science is the characterization of a large ensemble of heterogeneous nanostructures in a set of images. This often leads to practices such as manual particle counting, and sampling bias of a favorable region of the \"best\" image. Herein, we present the open-source software, imaging criteria and workflow necessary to fully characterize an ensemble of SEM nanoparticle images. Such characterization is critical to nanoparticle biosensors, whose performance and characteristics are determined by the distribution of the underlying nanoparticle film. We utilize novel artificial SEM images to objectively compare commonly-found image processing methods through each stage of the workflow: acquistion, preprocessing, segmentation, labeling and object classification. Using the semi-supervised machine learning application, Ilastik, we demonstrate the decomposition of a nanoparticle image into particle subtypes relevant to our application: singles, dimers, flat aggregates and piles. We outline a workflow for characterizing and classifying nanoscale features on low-magnification images with thousands of nanoparticles. This work is accompanied by a repository of supplementary materials, including videos, a bank of real and artificial SEM images, and ten IPython Notebook tutorials to reproduce and extend the presented results.","authors":["Adam Hughes","Zhaowen Liu","Mayam Raftari","Mark E Reeves"],"meta":["December 2014","DOI:10.7287/peerj.preprints.671v2"],"references":["270492046_AFM_and_XRD_Characterization_of_Silver_Nanoparticles_Films_Deposited_on_the_Surface_of_DGEBA_Epoxy_Resin_by_Ion_Sputtering","312913846_Design_and_FPGA_implementation_of_a_perimeter_estimator","312187867_Review_of_image_segmentation_techniques","292793744_Random_walks_for_image_segmentation","271828097_Image_Analysis_and_Mathematical_Morphology_Vol_1","271526843_MATLAB_The_language_of_technical_computing","271295725_Microscopic_Image_Analysis_of_Nanoparticles_by_Edge_Detection_Using_Ant_Colony_Optimization","270227978_Aberration-Corrected_Scanning_Transmission_Electron_Microscopy_The_Potential_for_Nano-_and_Interface_Science","269634033_Affine_Invariant_Flows_in_the_Beltrami_Framework","268733176_MATLAB_and_Octave_Functions_for_Computer_Vision_and_Image_Processing"]}