{"id":"269250098_Sketch_Recognition_by_Ensemble_Matching_of_Structured_Features","abstract":"Sketch recognition aims to automatically classify human hand sketches of objects into known categories. This has become increasingly a desirable capability due to recent advances in human computer interaction on portable devices. The problem is nontrivial because of the sparse and abstract nature of hand drawings as compared to photographic images of objects, compounded by a highly variable degree of details in human sketches. To this end, we present a method for the representation and matching of sketches by exploiting not only local features but also global structures of sketches, through a star graph based ensemble matching strategy. Different local feature representations were evaluated using the star graph model to demonstrate the effectiveness of the ensemble matching of structured features. We further show that by encapsulating holistic structure matching and learned bag-of-features models into a single framework, notable recognition performance improvement over the state-of-the-art can be observed. Extensive comparative experiments were carried out using the currently largest sketch dataset released by Eitz et al. [15], with over 20,000 sketches of 250 object categories generated by AMT (Amazon Mechanical Turk) crowd-sourcing.","authors":["Yi Li","Yi-Zhe Song","Shaogang Gong"],"meta":["January 2013","DOI:10.5244/C.27.35","Conference: British Machine Vision Conference 2013"],"references":["221365012_2D_Nonrigid_Partial_Shape_Matching_Using_MCMC_and_Contour_Subdivision","257484942_A_performance_evaluation_of_gradient_field_HOG_descriptor_for_sketch_based_image_retrieval","222116423_Sketch-based_retrieval_of_complex_drawings_using_hierarchical_topology_and_geometry","221120633_Gradient_field_descriptor_for_sketch_based_retrieval_and_localization","220781349_A_Generalized_Local_Binary_Pattern_Operator_for_Multiresolution_Gray_Scale_and_Rotation_Invariant_Texture_Classification","220578918_Sketch-based_retrieval_of_drawings_using_spatial_proximity","220252255_An_evaluation_of_descriptors_for_large-scale_image_retrieval_from_sketched_feature_lines"]}