{"id":"269217897_Model_Reference_Adaptive_Control_of_a_Quadrotor_UAV","abstract":"This paper presents an application of Model Reference Adaptive Control (MRAC) to a quadrotor unmanned aerial vehicle (UAV). After a review of the fundamental MRAC theoretical results, a detailed nonlinear model of the quadrotor is presented, including uncertainties which the adaptive control is to accommodate. Four approximate SISO LTI models are derived from the nonlinear model, which form the basis for the design of the adaptive controllers, which provide robust asymptotic tracking of step commands. The design is implemented in Boeing’s Vehicle Swarm Technology Laboratory, and the utility of the adaptive controller is demonstrated through simulated actuator degradation events. I. Background Model Reference Adaptive Control (MRAC) is concerned with forcing the dynamic response of the controlled system to asymptotically approach that of a reference system, despite parametric uncertainties in the plant. Two major subcategories of MRAC are those of indirect methods, in which the uncertain plant parameters are estimated and the controller \\redesigned\" online based on the parameter estimates, and direct methods, in which the tracking error is forced to zero without regard to parameter estimation accuracy (though under certain conditions related to the level of excitation in the command signal, the adaptive laws often can converge to the proper values). MRAC for linear systems has received, and continues to receive, considerable attention in the literature. Several comprehensive texts are available 1234 . Robustness of the adaptive algorithms has been a persistent issue in the literature. It is well-known that the presence of unmodeled dynamics in the system under control can lead to divergence of the parameter estimates and, ultimately, instability of the closed loop system; this phenomenon can occur even in the case of state feedback. 2 Modications of the adaptive laws, including parameter projection, dead-zones and leakage terms, have been suggested and used to combat the robustness issue. 3 This paper presents an example of the use of adaptive control on a small remote-controlled vehicle. Results of Model Reference Adaptive Control theory are presented in Section II.A. Sections III and III.C provide nonlinear and approximate linear models of the quadrotor helicopter system, respectively. Finally, Section IV details the application of the MRAC controller to the onominal quadrotor model and provides example results obtained from implementation in an indoor ight laboratory.","authors":["Brian Whitehead","Stefan Bieniawski"],"meta":["August 2010","DOI:10.2514/6.2010-8148","Conference: AIAA Guidance, Navigation, and Control Conference"],"references":["3332722_Attitude_stabilization_of_a_VTOL_quadrotor_aircraft"]}