{"id":"269266625_Scheduling_Supply_Chain_Node_with_fixed_Components_Arrivals_and_Two_Partially_Flexible_Deliveries","abstract":"We consider here a logistic platform or more generally a node of a supply chain. After previous research works at the planning level whose aim was to smooth the workload by modifying slightly arrival and departure dates, we are now interested by the scheduling level. Our particular industrial framework led us to original hypotheses: given component quantities are delivered by trucks at some fixed times; a first optimized tour of the customers is planned at a known fixed date and a second optimized tour will be executed at a flexible date corresponding to the end of the schedule with the remaining customer orders. We reduce the activity inside the platform to the most important operation. This operation is performed by a single non renewable resource. Nevertheless most of the presented results could be easily extended to identical parallel machines. The considered scheduling problem is NP-Hard. With the goal of solving it by a branch and bound approach, we propose here a series of upper bounds (rapid approximation methods) and a series of lower bounds (obtained by various relaxations). Experimentations permit us to compare quality and computational times of the lower bounds and give us a first idea of the quality of the rapid approximation approaches.","authors":["Susana Carrera"],"meta":["September 2010IFAC Proceedings Volumes (IFAC Papers-OnLine) 43(17):152-157","DOI:10.3182/20100908-3-PT-3007.00030","Conference: Management and Control of Production and Logistics"],"references":["42244058_Outils_d'aide_a_la_decision_pour_le_lissage_de_charges_des_plateformes_logistiques","313043209_Scheduling_with_fixed_delivery_dates","277677775_An_algorithm_for_a_general_class_of_precedence_and_resource_constrained_scheduling_problem","247447624_Scheduling_Under_Resource_Constraints_Deterministic_Models","242932206_The_Weighted_Total_Tardiness_Problem_with_Fixed_Shipping_Times_and_Overtime_Utilization","239666746_Problemes_d''ordonnancement_a_contraintes_de_ressources_algorithmes_et_complexite_These_de_Doctorat_d''Etat","222164304_Slowinski_R_Preemptive_scheduling_of_independent_jobs_on_parallel_machines_subject_to_financial_constraints_European_Journal_of_Operational_Research_15_366-373","220570024_The_project_scheduling_problem_with_production_and_consumption_of_resources_A_list-scheduling_based_algorithm","37437183_Preemptive_scheduling_with_staircase_and_piecewise_linear_resource_availability"]}