{"id":"269337615_A_Symmetric_Encryption_Algorithm_based_on_DNA_Computing","abstract":"Deoxyribo Nucleic Acid (DNA) computing is a new method \nof simulating the bimolecular structure of DNA and \ncomputing by means of molecular biology. DNA \ncryptography is a new field which has been explored \nworldwide. The concept of using DNA computing in the \nfields of cryptography and steganography has been identified \nas a possible technology, which may bring forward a new \nhope for unbreakable algorithms. This paper proposed a new \nDNA cryptographic algorithm which used the key features of\nDNA and amino acid coding to overcome limitations of the \nclassical One Time Pad (OTP) cipher. A significant feature of \nthe proposed algorithm is that; it is considered an encryption \nand hiding algorithm at the same time. The proposed \nalgorithm also enhances the security level of OTP cipher. An \nevaluation for the proposed algorithm is performed according \nto randomness testing by using the National Institute of \nStandards and Technology (NIST) test. The study showed that \nthe proposed algorithm had better performance with respect to \ntime, capacity and robustness compared to previous studies.","authors":["Fatma El-Sayed","Mahmoud I Moussa","Hatem Ahmed Abd elkader"],"meta":["July 2014International Journal of Computer Applications 97(16)","DOI:10.5120/17094-7634"],"references":["256918738_A_novel_data_hiding_method_based_on_deoxyribonucleic_acid_coding","234165934_DNA-Based_Data_Encryption_and_Hiding_Using_Playfair_and_Insertion_Techniques","220939817_A_DNA-based_implementation_of_YAEA_encryption_algorithm","220311653_Data_hiding_methods_based_upon_DNA_sequences","45198045_A_DNA_and_Amino_Acids-Based_Implementation_of_Playfair_Cipher","278475117_Hiding_messages_in_DNA_microdots_vol_399_pg_533_1999","257627241_A_DNA-based_data_hiding_technique_with_low_modification_rates","243772991_Cryptography_and_Network_Security_Principles_And_Practices","226258717_Design_of_true_random_one-time_pads_in_DNA_XOR_cryptosystem","224741640_A_DNA-based_biomolecular_cryptography_design"]}