{"id":"269398622_Usage_of_electronic_journals_e-journals_versus_print_journals_by_healthcare_professionals_in_H_M_Patel_Centre_for_Medical_Care_and_Education_HMPCME","abstract":"This article presents a study that seeks to examine the use of e-journals by the health care professionals of HMPCME and that of print journals which can be availed at the behest of library at Pramukhswami Medical College(PSMC), Karamsad, Gujarat-India. From this survey it was found that most of the research scholars i.e. (Doctors, Physicians, Medical officers, Interns, Post Graduate students, Residents) are referring to e-journals, as well as print journals from their departmental library as well as computer center in the central library. The main aim of consulting these journals is for retrieving information regarding research, dissertation, presentations, seminars, lectures, treatment protocols for unusual cases and journal clubs etc and largely to update their own knowledge. However, this study also reveals several inherent problems especially with the use of e-journals e.g. Computer illiteracy, lack of computer training, inability of retrieving particular/relevant health based information via various advanced databases like MD-Consult, EBSCO, ProQuest, Science Direct etc. Other mechanical deficits like slow downloading, slow connectivity, and subjective strain to eyes are also present while using e-journals. Moreover problems regarding subscription for a particular time phase are highlighted. Abstract","authors":["Mayank Trivedi","Anuradha Joshi"],"meta":["September 2009","Project: Google scholar"],"references":["11371986_Print_versus_electronic_journals_A_preliminary_investigation_into_the_effect_of_journal_format_on_research_processes","10641611_Use_patterns_of_online_journals_and_databases","7878705_Online_journals'_impact_on_the_citation_patterns_of_medical_faculty","254610207_The_Use_of_Electronic-Only_Journals_in_Scientific_Research","238128225_Print_journals_Fit_for_the_future","237247175_A_Snapshot_of_Early_Adopters_of_E-journals_Challenges_to_the_Library","228395895_Print_versus_Electronic_Journal_Use_in_Three_SciTech_Disciplines_What's_Going_On_Here","13799857_Information-seeking_behavior_of_health_sciences_faculty_The_impact_of_new_information_technologies","12655836_Use_of_print_journals_in_an_intracampus_exchange_program_Implications_for_service_and_electronic_journal_subscriptions","11887652_Electronic_journals_Are_they_a_paradigm_shift"]}