{"id":"269305915_Implementation_of_IEEE_80211n_LDPC_codes_based_on_general_purpose_processors","abstract":"Recently, General-purpose processor (GPP) soft defined radio (SDR) platforms have drawn great attention for their programmability and flexibility, and some high-speed wireless protocol stacks (e.g., IEEE 802.11a/b/g) have been implemented on them using commodity general-purpose PCs. Low-density parity-check (LDPC) codes are optionally used in IEEE 802.11n high throughput (HT) system as a high-performance error correcting code instead of convolutional codes for the near Shannon limit performance. In order to complete the implementation of IEEE 802.11n on SDR platforms, this paper presents the encoding and decoding of IEEE 802.11n LDPC codes on GPPs. We extensively use the features of contemporary processor architectures to accelerate data processing, including large low-latency caches to store lookup tables and SIMD processing on GPPs. Layered decoding is used in this paper, which can significantly reduce the number of iterations and is well suited to using SIMD instructions. The implementation results show that the throughput can meet the protocol timing requirement under the performance premise.","authors":["Xiao Han","Kai Niu","Zhiqiang He"],"meta":["November 2013","DOI:10.1109/ICCT.2013.6820375","Conference: 2013 15th IEEE International Conference on Communication Technology (ICCT)"],"references":["3085107_Quasi-Cyclic_Low-Density_Parity-Check_Codes_From_Circulant_Permutation_Matrices","290616273_6_Fine_Particles_Thin_Films_and_Exchange_Anisotropy_Effects_of_Finite_Dimensions_and_Interfaces_on_the_Basic_Properties_of_Ferromagnets","268807998_A_Treatise_on_Electricity_and_Magnetism_I","265937452_A_treatise_on_electricity_and_magnetism_Vol_2_Reprint_of_the_unabr_3rd_ed","224699633_Decoding_of_Quasi-cyclic_LDPC_Codes_Using_an_On-the-Fly_Computation","220832145_Sora_High_Performance_Software_Radio_Using_General_Purpose_Multi-core_Processors","4107348_A_reduced_complexity_decoder_architecture_via_layered_decoding_of_LDPC_codes","3489260_Low-Density_Parity-Check_Codes"]}