{"id":"269387170_Nonlinear_Recursive_Formulation_for_Kinematic_and_Dynamic_Analysis_of_Robotic_Manufacturing_Systems","abstract":"The objective of this paper is to develop a nonlinear recursive formulation for the dynamic analysis of robotic manufacturing systems. The nonlinear recursive equations are used for open-loop flexible manipulators that undergo large translational and rotational displacements. These equations are formulated in terms of a set of time invariant scalars, vectors and matrices that depend on the\nspatial coordinates as well as the assumed displacement fields, and these time invariant quantities represent the dynamic manufacturing couplings between the rigid body motion and elastic deformation. This formulation applies recursive procedures with the nonlinear equations for flexible manipulators to obtain a large, loosely coupled system equation of motion in robotic manufacturing\nsystems. The numerical techniques used to solve for the system equations of motion can be more efficiently implemented in any computer systems. The algorithms presented in this investigation are illustrated by using standard mechanical joints for robotic manufacturing systems that can be easily extended to other special joints. The nonlinear recursive formulation developed in this paper is illustrated by a robotic manufacturing system using standard revolute mechanical joints.","authors":["Yunn-Lin Hwang"],"meta":["January 2006Materials Science Forum 505-507:553-558","DOI:10.4028/www.scientific.net/MSF.505-507.553"],"references":["225397960_Direct_violation_correction_method_in_numerical_simulation_of_constrained_multibody_systems","223056285_A_new_approach_for_dynamic_analysis_of_flexible_manipulator_systems","239065881_Dynamics_of_Articulated_Open-Chain_Active_Mechanisms","226966917_Dynamics_of_spatial_structure-varying_rigid_multibody_systems","226672703_An_Integrated_Approach_for_Computer_Aided_Design_in_Multibody_System_Dynamics","225570240_Parallel_Implementation_of_a_Low_Order_Algorithm_for_Dynamics_of_Multibody_Systems_on_a_Distributed_Memory_Computing_System","225453536_Hierarchical_modeling_in_multibody_dynamics","222573570_Dynamic_modeling_of_multi-link_flexible_robotic_manipulators"]}