{"id":"269414389_Validity_of_the_Global_Physical_Activity_Questionnaire_GPAQ_in_assessing_levels_and_change_in_moderate-vigorous_physical_activity_and_sedentary_behaviour","abstract":"Feasible, cost-effective instruments are required for the surveillance of moderate-to-vigorous physical activity (MVPA) and sedentary behaviour (SB) and to assess the effects of interventions. However, the evidence base for the validity and reliability of the World Health Organisation-endorsed Global Physical Activity Questionnaire (GPAQ) is limited. We aimed to assess the validity of the GPAQ, compared to accelerometer data in measuring and assessing change in MVPA and SB.\nParticipants (n = 101) were selected randomly an on-going research study, stratified by level of physical activity (low, moderate or highly active, based on the GPAQ) and sex. Participants wore an accelerometer (Actigraph GT3X) for seven days and completed a GPAQ on Day 7. This protocol was repeated for a random sub-sample at a second time point, 3-6 months later. Analysis involved Wilcoxon-signed rank tests for differences in measures, Bland-Altman analysis for the agreement between measures for median MVPA and SB mins/day, and Spearman's rho coefficient for criterion validity and extent of change.\n95 participants completed baseline measurements (44 females, 51 males; mean age 44 years, (SD 14); measurements of change were calculated for 41 (21 females, 20 males; mean age 46 years, (SD 14). There was moderate agreement between GPAQ and accelerometer for MVPA mins/day (r = 0.48) and poor agreement for SB (r = 0.19). The absolute mean difference (self-report minus accelerometer) for MVPA was -0.8 mins/day and 348.7 mins/day for SB; and negative bias was found to exist, with those people who were more physically active over-reporting their level of MVPA: those who were more sedentary were less likely to under-report their level of SB. Results for agreement in change over time showed moderate correlation (r = 0.52, p = 0.12) for MVPA and poor correlation for SB (r = -0.024, p = 0.916).\nLevels of agreement with objective measurements indicate the GPAQ is a valid measure of MVPA and change in MVPA but is a less valid measure of current levels and change in SB. Thus, GPAQ appears to be an appropriate measure for assessing the effectiveness of interventions to promote MVPA.","authors":["Claire Lyne Cleland","Ruth Hunter","Frank Kee","Margaret E Cupples"],"meta":["December 2014BMC Public Health 14(1):1255","DOI:10.1186/1471-2458-14-1255","SourcePubMed"],"references":["311469451_A_comparison_of_direct_versus_self-report_measures_for_assessing_physical_activity_in_adults_A_systematic_review","257532805_Physical_activity_and_the_rejuvenation_of_Connswater_PARC_study_Protocol_for_a_natural_experiment_investigating_the_impact_of_urban_regeneration_on_public_health","249657936_Validity_and_Reliability_of_the_Global_Physical_Activity_Questionnaire_GPAQ","239614028_Division_of_Nutrition_and_Physical_Activity_National_Center_for_Chronic_Disease_Prevention_and_Health_Promotion_Centers_for_Disease_Control_and_Prevention_USA","324683968_Letter_to_the_editor_standardized_use_of_the_terms_sedentary_and_sedentary_behaviours","313178819_FC_Development_of_the_world_health_organisation_global_physical_activity_questionnaire","305011222_A_hitchhiker's_guide_to_assessing_sedentary_behaviour_among_young_people_deciding_what_method_to_use","286744413_Actual_causes_of_death_in_the_United_States","257750204_Validity_of_the_ActiGraph_GT1M_during_walking_and_cycling","237922286_Calibration_of_the_computer_science_and_applications_Inc_accelerometer"]}