{"id":"269409702_Climate_change_and_its_impact_on_plant_diseases","abstract":"Climate change is the biggest threat to mankind, and is the cause of nearly 0.4 million deaths a year worldwide and costing the world more than US$ 1.2 trillion. Climate change is affecting our agriculture due to 0.74°C average global increase in temperature in the last 100 years and atmospheric CO2 concentration increase from 280ppm in 1750 to 400ppm in 2013. Such changes will have a drastic effect on the growth and cultivation of the different crops on the Earth. Simultaneously, these changes will also affect the reproduction, spread and severity of many plant pathogens, thus posing a threat to our food security. Climate change is also putting stem rust resistance due to Sr31 under threat of Ug99 race of stem rust caused by Puccinia graminis f. sp. tritici. Elevated temperature and CO2 concentration are also posing higher threat perception of late blight (Phytophthora infestans) disease of potato and important diseases of rice, namely blast (Pyricularia oryzae) and sheath blight (Rhizoctonia solani). Changing disease scenario due to climate change has highlighted the need for future studies on such models which can predict the severity of important pathogens of major crops in real-field conditions. Simultaneously, disease management strategies should be reoriented in changing conditions with amalgamation of new strategies for sustainable food production.","authors":["Hardik Gautam","Ml Bhardwaj","Rohitashw Kumar"],"meta":["December 2013Current Science 105(12):2013"],"references":["343336289_IMPACT_OF_CLIMATE_CHANGE_ON_WHEAT_DISEASE_SCENARIO_IN_PUNJAB","313646553_Climate_change_potential_effects_of_increased_atmospheric_carbon_dioxide_CO2_ozone_O3_and_ultraviolet-B_UV-B_radiation_on_plant_diseases","287900742_Impact_of_climate_change_on_the_occurrence_and_activity_of_harmful_organisms","262761162_Risk_analysis_of_climatic_change_on_black_Sigatoka_on_banana_in_Brazil","303163478_Fungicides_in_crop_health_security","279700840_Assessing_the_risks_and_uncertainties_of_regional_crop_potential_under_a_changing_climate_in_Finland","269111611_The_effects_of_drought_on_sugar_beet_growth_in_isolation_and_in_combination_with_beet_yellows_virus_infection","268404466_The_effect_of_climate_change_on_plant_diseases","262824904_Genetic_structure_and_local_adaptation_of_European_wheat_yellow_rust_populations_The_role_of_temperature-specific_adaptation","259799900_Plant_Pathogens_as_Indicators_of_Climate_Change"]}