{"id":"269417833_Strategyproof_Mechanisms_for_One-Dimensional_Hybrid_and_Obnoxious_Facility_Location","abstract":"We consider a strategic variant of the facility location problem. We would\nlike to locate a facility on a closed interval. There are n agents located on\nthat interval, divided into two types: type 1 agents, who wish for the facility\nto be as far from them as possible, and type 2 agents, who wish for the\nfacility to be as close to them as possible. Our goal is to maximize a form of\naggregated social benefit: maxisum- the sum of the agents' utilities, or the\negalitarian objective- the minimal agent utility. The strategic aspect of the\nproblem is that the agents' locations are not known to us, but rather reported\nto us by the agents- an agent might misreport his location in an attempt to\nmove the facility away from or towards to his true location. We therefore\nrequire the facility-locating mechanism to be strategyproof, namely that\nreporting truthfully is a dominant strategy for each agent. As simply\nmaximizing the social benefit is generally not strategyproof, our goal is to\ndesign strategyproof mechanisms with good approximation ratios.\nFor the maxisum objective, in the deterministic setting, we provide a\nbest-possible 3- approximate strategyproof mechanism; in the randomized\nsetting, we provide a 23/13- approximate strategyproof mechanism and a lower\nbound of 3/2. For the egalitarian objective, we provide a lower bound of 3/2 in\nthe randomized setting, and show that no bounded approximation ratio is\nattainable in the deterministic setting. To obtain our deterministic lower\nbounds, we characterize all deterministic strategyproof mechanisms when all\nagents are of type 1. Finally, we consider a generalized model that allows an\nagent to control more than one location, and provide best-possible 3- and 3/2-\napproximate strategyproof mechanisms, in the deterministic and randomized\nsettings respectively, when only type 1 agents are present.","authors":["Itai Feigenbaum","Jay Sethuraman"],"meta":["December 2014","SourcearXiv"],"references":["236687786_Approximately_Optimal_Mechanisms_for_Strategyproof_Facility_Location_Minimizing_L_p_Norm_of_Costs","267149147_Strategy-proof_approximation_mechanisms_for_an_obnoxious_facility_game_on_networks","267013503_Characterizing_Mechanisms_in_Obnoxious_Facility_Game","265432821_Obnoxious_Facility_Game_with_a_Bounded_Service_Range","262323873_Strategyproof_facility_location_and_the_least_squares_objective","226038155_On_Strategy-Proofness_and_Single_Peakedness","221445084_Approximate_Mechanism_Design_without_Money","220442825_Strategyproof_Approximation_of_the_Minimax_on_Networks","46450746_Strategyproof_Approximation_Mechanisms_for_Location_on_Networks"]}