{"id":"269591260_A_scalable_data_dissemination_protocol_for_both_highway_and_urban_vehicular_environments","abstract":"Vehicular ad hoc networks (VANETs) enable the timely broadcast dissemination of event-driven messages to interested vehicles. Especially when dealing with broadcast communication, data dissemination protocols must achieve a high degree of scalability due to frequent deviations in the network density. In dense networks, suppression techniques are designed to prevent the so-called broadcast storm problem. In sparse networks, protocols incorporate store-carry-forward mechanisms to take advantage of the mobility of vehicles to store and relay messages until a new opportunity for dissemination emerges. Despite numerous efforts, most related works focus on either highway or urban scenarios, but not both. Highways are mostly addressed with a single directional dissemination. For urban scenarios, protocols mostly concentrate on either using infrastructure or developing methods for selecting vehicles to perform the store-carry-forward task. In both cases, dense networks are dealt with suppression techniques that are not optimal for multi-directional dissemination. To fill this gap, we present an infrastructure-less protocol that combines a generalized time slot scheme based on directional sectors and a store-carry-forward algorithm to support multi-directional data dissemination. By means of simulations, we show that our protocol scales properly in various network densities in both realistic highway and urban scenarios. Most importantly, it outperforms state-of-the-art protocols in terms of delivery ratio, end-to-end delay, and number of transmissions. Compared to these solutions, our protocol presents up to seven times lower number of transmissions in dense highway scenarios.","authors":["Ramon S. Schwartz","Hans Scholten","Paul Havinga"],"meta":["December 2013EURASIP Journal on Wireless Communications and Networking 2013(1):257","DOI:10.1186/1687-1499-2013-257"],"references":["274915210_Performance_Analysis_of_Round_Trip_Time_in_Narrowband_RF_Networks_For_Remote_Wireless_Communications","254463327_Exploiting_beacons_for_scalable_broadcast_data_dissemination_in_VANETs","230819973_IEEE_80211p_transmission_using_GNURadio","230799237_Evaluating_the_impact_of_a_novel_message_dissemination_scheme_for_Vehicular_Networks_using_real_maps","225022282_SUMO_-_Simulation_of_Urban_MObility_An_Overview","296515056_Efficient_broadcast_in_mobile_ad_hoc_networks_using_connected_dominating_sets","279491305_Measuring_and_using_the_RSSI_of_IEEE_80211p","261228934_DAZL_Density-Aware_Zone-based_packet_forwarding_in_vehicular_networks","239061961_Wireless_Communications_Principles_and_Practice_Upper_Saddle_River_NJ_Prentice-Hall","236157555_Wireless_Communications_First_Edition"]}