{"id":"269611326_Interpretation_of_Well-Block_Pressures_in_Numerical_Reservoir_Simulationincludes_associated_paper_6988","abstract":"Original manuscript received in Society of Petroleum Engineers officeJune 16, 1977. Paper accepted for publication Dec. 20, 1977. Revisedmanuscript received April 3, 1978. Paper (SPE 6893) first presentedat the SPE-AIME 52nd Annual Fall Technical Conference and Exhibition, held in Denver, Oct. 9-12, 1977.\n\nAbstract\nExamination of grid pressures obtained in thenumerical simulation of single-phase flow into asingle well shows that the well-block pressure isessentially equal to the actual flowing pressure ata radius of 0.2 x. Using the equation forsteadystate radial flow then allows calculation ofthe flouring bottom-hole pressure.\nThe relation between pressures measured in abuildup test and the simulator well-block pressureis derived. In particular, the buildup pressure andthe well-block pressure are shown equal at ashut-in time of 67.5 ct x2/k. This is aboutone-third the shut-in time stated by previous authors, who derived their results from an erroneousassumption concerning the significance of thewell-block pressure.\nWhen only a single buildup pressure is observedat a different shut-in time, an adjustment to theobserved pressure can be made for matching with the simulator well-block pressure.\n\nIntroduction\nWhen modeling reservoir behavior by numericalmethods, inevitably the horizontal dimensions ofany grid block containing a well are much larger than the wellbore radius of that well. It long hasbeen recognized that the pressure calculated for awell block will be greatly different from the flowingbottom-hole pressure of the modeled well, but theliterature contains few specific guides as to how tomake the correction.\nIn this study, we confine our attention tosinglephase flow in two dimensions. Consider the fiveblocks abstracted from a regular grid system(Fig.1) with the center block containing a well producingat rate q. Schwabe and Brand proposed therelationship\n2 kh Pe - Pwfq = ------- -----------------,..............(1)1n(r /r) + se w\nwhere re is taken equal to x, and pe is an effectivepressure at the\"drainage radius,\" re, obtainedfrom4Pe = Po + Fi (Pi - Po).i=1\nSchwabe and Brand did not define Fi, but seemedto imply that it be taken as zero. Thus, in theabsence of a skin effect, Eq. 1 reduces to\n2 kh Po - Pwfq = ------- -------------...................(2)1n (x/r) w\nThe most significant treatment of this subjectuntil now was that of van Poollen et al. Theystated that the calculated pressure for a well block should be tithe areal average pressure in theportion of the reservoir represented by the block.\nSPEJ\nP. 183","authors":["D.W. Peaceman"],"meta":["April 2013Society of Petroleum Engineers Journal 18(03):183-194","DOI:10.2118/6893-PA"],"references":["250090455_Three-Dimensional_Simulation_of_Steamflooding","250090365_Treatment_of_Individual_Wells_and_Grids_in_Reservoir_Modeling"]}