{"id":"269610816_Adaptive_Virtual_Exhibitions","abstract":"Virtual Exhibitions are single- or multi-user realistic 3D representations of artifact collections, in which visitors navigate, observe the exhibits, learn related information about them presented in various media, and in some cases interact with them. Given that virtual exhibitions have no physical restrictions, they may host a limitless number of exhibits in a very large presentation space. On the other hand studies have shown that visitors have various goals concerning their experience within an exhibition space, they follow different navigation strategies in browsing the exhibits, and they may be interested only in parts of the collection. These differentiations among online users raise a need for adaptation and personalization of the 3D environment and its content. Researchers in Adaptive Hypermedia distinguish between adaptation of content, adaptation of presentation and modality, and adaptation of structure. In the case of Virtual Exhibitions the content can be adapted by dynamically altering the artifacts presented in the exhibition spaces based on given criteria, e.g. user interests. The presentation and modality of the exhibition collection can be adapted","authors":["Bill Bonis","Spyros Vosinakis","Ioannis Andreou","Themis Panayiotopoulos"],"meta":["May 2013DESIDOC Journal of Library & Information Technology 33(3):183-198","DOI:10.14429/djlit.33.4604"],"references":["263377228_Hybrid_Recommender_Systems_Survey_and_Experiments","257819726_Adaptive_Hypermedia","319395522_Running_Out_of_Space_-_Models_of_Information_Navigation","315574355_Adaptive_Virtual_Reality_Museums_on_the_Web","305397619_Data_Clustering_A_Review","277771228_Personalised_hypermedia_presentation_techniques_for_improving_online_customer_relationships","277283605_Performance_and_Flexibility_of_Stereotype-based_User_Models","277244505_A_Second_Life_for_Your_Museum_3D_Multi-User_Virtual_Environments_and_Museums","267838694_Behavior_in_a_Museum_A_Semio-Cognitive_Approach_to_Museum_Consumption_Experiences","256410714_Fuzzy_extension_of_inheritance_hierarchies"]}