{"id":"269612016_Probability_Model_for_Estimating_Three-Phase_Relative_Permeability","abstract":"With the method described here, three-phase relative permeability data may be estimated from two sets of more easily measured two-phase data - water displacing oil, and gas displacing oil. The resulting data compare favorably with the limited experimental data available in the literature, so that they may be used to estimate three-phase data for combination-drive reservoir calculations.\nIntroduction\nAlthough thorough analysis of combination gas- and water-drive reservoirs requires three-phase relative permeability data, the effort involved in determining permeability data, the effort involved in determining these data experimentally generally rules out such a direct approach. Refs. 1 through 4 suggest, however, that more easily measured two-phase data can be used to predict the relative permeability to both the wetting and nonwetting fluids in three-phase flow. This report describes a method of using two sets of two-phase data to predict the relative permeability of the intermediate wettability phase in a three-phase system. Use is made of probability concepts and appropriate empirical definitions.\nThis technique may be regarded as a means of interpolating between the two sets of two-phase data to obtain the three-phase relative permeability. In many reservoirs that involve three-phase flow, only gas and oil are mobile in the upper portion of the reservoir; in the lower portion, water and oil are the phases of high mobility. The probability model is phases of high mobility. The probability model is such that it will yield the correct two-phase data when only two phases are flowing, and will provide interpolated data for three-phase flow that are consistent and continuous functions of the phase saturations. It will be shown later that these interpolated values agree with the available three-phase data within experimental uncertainty.\nAlthough the method applies to either a preferentially water-wet or a preferentially oil-wet system, preferentially water-wet or a preferentially oil-wet system, this discussion will be limited to a water-wet system. Extension of the method to a preferentially oil-wet system is straightforward; here, water becomes the fluid of intermediate wettability.\nEstimation of Three-Phase Relative Permeability Data Permeability Data This section presents the data required to predict three-phase relative permeability data, the equations used, and the definitions and assumptions on which the method is based. The next section describes a reasonable physical model that is consistent with these assumptions, and the final section presents an empirical evaluation of the model:\nData Required\nData required for the estimation of three-phase relative permeability are two sets of two-phase data water-oil and gas-oil. From the water-oil data we obtain both krw and krow, as a function of water saturation, where krow is defined as the relative permeability to oil in the oil-water two-phase system. Similarly, we obtain krg and krog as a function of gas saturation. Hysteresis effects are taken into consideration, as far as possible, by employing the appropriate two-phase data. For example, consider a water-wet system in which oil saturation is decreasing and gas and water saturations are increasing. Imbibition data should be used for the water-oil data, and drainage data should be used for the oil-gas data.\nJPT\nP. 214","authors":["H.L. Stone"],"meta":["April 2013Journal of Petroleum Technology 22(02):214-218","DOI:10.2118/2116-PA"],"references":[]}