{"id":"269651898_Parallel_variable_neighbourhood_search_strategies_for_the_cutwidth_minimization_problem","abstract":"Variable neighbourhood search (VNS) and all its variants have been successfully proved in hard combinatorial optimization\nproblems. However, there are only few works concerning parallel VNS algorithms, compared with the amount of works devoted\nto sequential VNS design. In this paper, we propose different parallel designs for the VNS schema. We illustrate the performance\nof these general strategies by parallelizing a new VNS variant called variable formulation search (VFS). Specifically, we\npropose six different variants which differ in the VNS stages to be parallelized as well as in the communication mechanisms\namong processes. We group these variants into three different templates. The first one is oriented to parallelize the whole\nVNS method. The second one parallelizes the shake and the local search procedures. Finally, the third one explores in parallel\nthe set of predefined neighbourhoods. We test the resulting designs on the cutwidth minimization problem (CMP). Experimental\nresults show that the parallel implementation of the VFS outperforms previous methods in the state of the art for the CMP.\nThis fact is also confirmed by non-parametric statistical tests.","authors":["Abraham Duarte","Juan J. Pantrigo","Eduardo G. Pardo","Jesús Sánchez-Oro Calvo"],"meta":["January 2013IMA Journal of Management Mathematics 27(1)","DOI:10.1093/imaman/dpt026"],"references":["312340966_Parallel_strategies_for_meta-heuristics","263124172_Cooperative_Parallel_Variable_Neighborhood_Search_for_the_p-Median_Special_Issue_New_Advances_on_Parallel_Meta-Heuristics_for_Complex_Problems_Guest_Editor_Enrique_Alba","312628082_Optimal_numberings_and_isoperimetric_problems_on_graphs","279926696_Randomized_fully_polynomial_time_approximation_scheme_for_the_all-terminal_network_reliability_problem","268490069_Parallel_Metaheuristics_A_New_Class_of_Algorithms","265367662_Optimal_Linear_Ordering","265303019_Handbook_of_Metaheuristics","262409501_Parallel_algorithms_for_the_minimum_cut_and_the_minimum_length_tree_layout_problems","262169369_Heuristics_for_backplane_ordering","255966548_Variable_Formulation_Search_for_the_Cutwidth_Minimization_Problem"]}