{"id":"269612022_Representation_Of_A_Horizontal_Well_In_Numerical_Reservoir_Simulation","abstract":"The range of validity of Peaceman's equation for the equivalent wellblock radius of a horizontal well is explored.\n\nSummary\nThe derivation of Peaceman's equation for the equivalent wellblock radius of a well in an anisotropic medium assumes that the grid is uniform and that the well is isolated, i.e., far from the grid boundaries. For a horizontal well, the assumption of being isolated may not be valid. The range of validity of Peaceman's equation is explored, using recent work of Babu and Odeh. If the reservoir is stratified or if the grid is not uniform, the assumptions underlying the equations of either Peaceman or Babu and Odeh are not valid, and a special program must be used to calculate the equivalent radius.\n\nIntroduction\nIn numerical reservoir simulation by finite differences, well models are used to relate the flowing bottomhole pressure of a well, to the pressure calculated for the block containing the well, . For single-phase flow, the well model for a vertical well may be written\n(1)\nwhere is the equivalent radius of the well block. For a vertical well in an isotropic medium and a uniform rectangular rid Peacemani showed that Peacemani showed that (2)\nFor an anisotropic medium, he showed that\n(3)\nThe ratios () and () in the numerator account for the scaling of and to an equivalent isotropic grid, while the whole denominator is a correction for the fact that, in the equivalent isotropic problem, the wellbore is an ellipse rather than a circle.\n\nAPPLICATION OF EQ. 3 TO A HORIZONTAL WELL\nFor a horizontal well, it appears to be sufficient to interchange and, as well as and in Eqs. 1 and 3, to yield\n(4)\nSome workers have applied Eq. 5 rather uncritically for representing a horizontal well. It is necessary to realize, however, that Eqs. 3 and 5 are based on several assumptions that, perhaps, should have been stressed more in Refs. 1 and 4. First are the assumptions of uniform grid spacing and uniform permeability (i.e., constant, and throughout). Secondly, the well is assumed isolated. By that is meant that it is not near any other well, which is obviously satisfied for a single horizontal well. But, more to the point, it is assumed that the well is not near any grid boundary. That may be hard to satisfy in the simulation of a horizontal well. The question arises then: how far does a well have to be from the boundary to be considered isolated?\nPeaceman gave some preliminary, and perhaps overly conservative, Peaceman gave some preliminary, and perhaps overly conservative, requirements for an isolated well: it should be at a distance greater than 10 max(,) from any other well, no closer than from a vertical grid boundary, and no closer than from a horizontal grid boundary.\nExact Calculation of ro.\nA more exact analysis of the applicability of Eq. 5 to a single horizontal well is provided by some recent work by Babu et al. They considered as a vertical cross section a rectangle of width w and height h, with a single horizontal well at position xw, zw, producing at rate q. They assumed that kx and kz are constant, that there is no flow across any of the four sides, and that the system is in pseudosteady state. Then the differential equation for pressure is\n(6)\nwhere L is the length of the reservoir perpendicular to the rectangle. The well is assumed fully penetrating for the distance L.\nLet the rectangle be overlain with a uniform grid having Nx by Nz, blocks of size by, as in Fig. 1, and let the well be at the center of block (,). Then Eq. 6 may be approximated by the difference system\n(7)\nwhere, = 1 for the wellblock, and = 0 otherwise. The boundary conditions are\n(8a)\n(8b)","authors":["D.W. Peaceman"],"meta":["April 2013SPE Advanced Technology Series 1(01):7-16","DOI:10.2118/21217-PA"],"references":[]}