{"id":"269669347_Graph_based_Representation_and_Analysis_of_Text_Document_A_Survey_of_Techniques","abstract":"A common and standard approach to model text document is bag-of-words. This model is suitable for capturing word frequency, however structural and semantic information is ignored. Graph representation is mathematical constructs and can model relationship and structural information effectively. A text can appropriately represented as Graph using vertex as feature term and edge relation can be significant relation between the feature terms. Text representation using Graph model provides computations related to various operations like term weight, ranking which is helpful in many applications in information retrieval. This paper presents a systematic survey of existing work on Graph based representation of text and also focused on Graph based analysis of text document for different operations in information retrieval. In this process taxonomy of Graph based representation and analysis of text document is derived and result of different methods of Graph based text representation and analysis are discussed. The survey results shows that Graph based representation is appropriate way of representing text document and improved result of analysis over traditional model for different text applications. General Terms: Graph, Graph based methods, Text analysis.","authors":["Sheetal Sonawane","P. A. Kulkarni"],"meta":["June 2014International Journal of Computer Applications 96(19):1-8","DOI:10.5120/16899-6972"],"references":["267262068_Enhancing_text_representation_for_classification_tasks_with_semantic_graph_structures","261127273_From_Ambiguous_Words_to_Key-Concept_Extraction","228909171_Graph-based_text_representation_for_novelty_detection","221417899_Determining_Degree_of_Relevance_of_Reviews_Using_a_Graph-Based_Text_Representation","301451587_Analysis_and_Evaluation_of_Current_Graph-Based_Text_Mining_Researches","287165197_Matching_sets_of_parse_trees_for_answering_multi-sentence_questions","262405601_Graph-of-word_and_TW-IDF_new_approach_to_ad_hoc_IR","228682820_Construction_of_Conceptual_Graph_representation_of_texts","224178451_Graph-based_Text_Representation_Model_and_its_Realization","221358156_Visualization_and_analytical_support_of_questionnaire_free-texts_data_based_on_HK_Graph_with_concepts_of_words"]}