{"id":"269636341_Bisimulations_for_coalgebras_on_Stone_spaces","abstract":"We introduce and study bisimulations for coalgebras on Stone spaces (Kupke et al., 2004, Theoretical Computer Science, 327, 109–134), motivated by previous work on ultrafilter extensions for coalgebras (Kupke et al., 2005, Algebra and Coalgebra in Computer Science, 263–277), bisimulations for the Vietoris functor (Bezhanishvili et al., 2010, Journal of Logic and Computation, 20, 1017–1040) and building on an idea of Gorín and Schröder (2013, Algebra and Coalgebra in Computer Science, 8089, 253–266). We provide a condition under which our notion of bisimulation gives a sound and complete proof method for behavioural equivalence, and show that it generalizes Vietoris bisimulations. Our main technical result proves that the topological closure of any bisimulation between Stone coalgebras in our sense is still a bisimulation. This answers a question raised in Bezhanishvili et al. (2010, Journal of Logic and Computation, 20, 1017–1040), and also leads to a simpler proof of the main theorem in that paper, that the topological closure of a Kripke bisimulation is a Vietoris bisimulation. As a second application of our general bisimulation concept, we study neighbourhood bisimulations on descriptive frames for monotone modal logic as they were introduced in Hansen et al. (2009, Logical Methods in Computer Science, 5, 1–38). From our general results we derive that these are sound and complete for behavioural equivalence and that the topological closure of a neighbourhood bisimulation is still a neighbourhood bisimulation, in analogy with the main result in Bezhanishvili et al. (2010, Journal of Logic and Computation, 20, 1017–1040). Finally, we apply our result to bisimulations for Stone companions of set functors as defined in Kupke et al. (2004, Theoretical Computer Science, 327, 109–134).","authors":["Sebastian Enqvist","Sumit Sourabh"],"meta":["February 2018Journal of Logic and Computation 28(6)","DOI:10.1093/logcom/exy001","SourcearXiv"],"references":["313362578_Modal_Logics_are_Coalgebraic","299454664_Lax_Extensions_of_Coalgebra_Functors_and_Their_Logic","276840903_Lax_Extensions_of_Coalgebra_Functors","275137105_Modal_compact_Hausdorff_spaces","310750253_Concurrency_and_automata_on_infinite_sequences","277296934_Universal_Coalgebra_a_Theory_of_Systems","266524057_Modal_Logic","265440486_Topology_and_Geometry","262334660_Some_Sahlqvist_Completeness_Results_for_Coalgebraic_Logics","255663476_Operational_and_Algebraic_Semantics_of_Concurrent_Processes"]}