{"id":"269740161_Retour_critique_sur_la_sociologie_des_usages","abstract":"Quelle evaluation peut-on faire d'une vingtaine d'annees de recherches consacrees a la sociologie des usages des objets de communication ? A partir d'un point de vue critique, cet article retrace l'archeologie de ce courant (caracteristiques des chercheurs et des equipes, modalites de financement de la recherche...) qui a emerge avec le developpement des technologies de l'information et de la communication et s'est etendu ensuite a l'etude d'autres medias et de dispositifs de communication diversifies. Cette demarche heuristique nous conduit a retracer les origines theoriques de la sociologie des usages et a identifier les problematiques qui ont contribue a sa genese puis a son evolution. Par dela la diversite des etudes et des approches, le projet tente de degager les principaux apports de la sociologie des usages a la comprehension des phenomenes de communication. Cet examen nous permet, en dernier lieu, de nous interroger sur les perspectives de la sociologie des usages et, face a la montee de l'empirisme, de plaider pour son inscription forte dans les sciences sociales.","authors":["Josiane Jouët"],"meta":["January 2000Réseaux 18(100):487-521","DOI:10.3406/reso.2000.2235"],"references":["272466719_L'usage_en_son_contexte_Sur_les_usages_des_interactifs_et_des_cederoms_des_musees","272324468_Pratiques_de_communication_et_figures_de_la_mediation","268150845_Constitution_d'un_espace_de_communication_sur_Internet_Forums_pages_personnelles_courrier_electronique","315207119_MSG_GRETEL_Images_de_personne_s","306089085_De_l'appropriation_militante_d'Internet_en_contexte_associatif_Engagement_distancie_et_sociabilites_digitales","277185145_Les_jeunes_et_la_culture_de_l'ecran_Enquete_nationale_aupres_des_6-17_ans","272453966_Messageries_professionnelles_en_transit_ou_en_sursis","272345004_Le_cadre_interactionnel_de_l'echange_visiophonique","271235624_Une_situation_interactionnelle_negligee_la_messagerie_telematique","271234986_Une_Caisse_d'allocations_familiales_en_progress_la_gestion_moderne_de_la_misere"]}