{"id":"269721515_Structure_Dynamics_Assembly_and_Evolution_of_Protein_Complexes","abstract":"The assembly of individual proteins into functional complexes is fundamental to nearly all biological processes. In recent decades, many thousands of homomeric and heteromeric protein complex structures have been determined, greatly improving our understanding of the fundamental principles that control symmetric and asymmetric quaternary structure organization. Furthermore, our conception of protein complexes has moved beyond static representations to include dynamic aspects of quaternary structure, including conformational changes upon binding, multistep ordered assembly pathways, and structural fluctuations occurring within fully assembled complexes. Finally, major advances have been made in our understanding of protein complex evolution, both in reconstructing evolutionary histories of specific complexes and in elucidating general mechanisms that explain how quaternary structure tends to evolve. The evolution of quaternary structure occurs via changes in self-assembly state or through the gain or loss of protein subunits, and these processes can be driven by both adaptive and nonadaptive influences. Expected final online publication date for the Annual Review of Biochemistry Volume 84 is June 02, 2015. Please see http://www.annualreviews.org/catalog/pubdates.aspx for revised estimates.","authors":["Joseph A Marsh","Sarah A Teichmann"],"meta":["December 2014Annual Review of Biochemistry 84(1)","DOI:10.1146/annurev-biochem-060614-034142","SourcePubMed"],"references":["262681357_Protein_Flexibility_Facilitates_Quaternary_Structure_Assembly_and_Evolution","262577917_The_amyloid_state_and_its_association_with_protein_misfolding_diseases","319001716_Widespread_cotranslational_formation_of_protein_complexes","314721342_Specificity_and_Evolvability_in_Eukaryotic_Protein_Interaction_Networks","311901124_Comparative_evolutionary_analysis_of_protein_complexes_in_E_coli_and_yeast","291736124_The_frailty_of_adaptative_hypotheses_for_the_origins_of_organismal_complexity","285368231_Proteomeorganization_in_a_genome-reduced_bacterium","270903100_The_Protein_Data_Bank","264053247_A_Million_Peptide_Motifs_for_the_Molecular_Biologist","262490210_Evolution_of_Protein_Interactions_From_Interactomes_to_Interfaces"]}