{"id":"269770244_Evoked_Emotions_Predict_Food_Choice","abstract":"In the current study we show that non-verbal food-evoked emotion scores significantly improve food choice prediction over merely liking scores. Previous research has shown that liking measures correlate with choice. However, liking is no strong predictor for food choice in real life environments. Therefore, the focus within recent studies shifted towards using emotion-profiling methods that successfully can discriminate between products that are equally liked. However, it is unclear how well scores from emotion-profiling methods predict actual food choice and/or consumption. To test this, we proposed to decompose emotion scores into valence and arousal scores using Principal Component Analysis (PCA) and apply Multinomial Logit Models (MLM) to estimate food choice using liking, valence, and arousal as possible predictors. For this analysis, we used an existing data set comprised of liking and food-evoked emotions scores from 123 participants, who rated 7 unlabeled breakfast drinks. Liking scores were measured using a 100-mm visual analogue scale, while food-evoked emotions were measured using 2 existing emotion-profiling methods: a verbal and a non-verbal method (EsSense Profile and PrEmo, respectively). After 7 days, participants were asked to choose 1 breakfast drink from the experiment to consume during breakfast in a simulated restaurant environment. Cross validation showed that we were able to correctly predict individualized food choice (1 out of 7 products) for over 50% of the participants. This number increased to nearly 80% when looking at the top 2 candidates. Model comparisons showed that evoked emotions better predict food choice than perceived liking alone. However, the strongest predictive strength was achieved by the combination of evoked emotions and liking. Furthermore we showed that non-verbal food-evoked emotion scores more accurately predict food choice than verbal food-evoked emotions scores.","authors":["Jelle R. Dalenberg","Swetlana Gutjar","Gert J Ter Horst","Kees de Graaf"],"meta":["December 2014PLoS ONE 9(12):e115388","DOI:10.1371/journal.pone.0115388","SourcePubMed","Project: TIFN: Sensory and Liking"],"references":["313757692_Measuring_emotion_Development_and_application_of_an_instrument_to_Measure_Emotional_Responses_to_Products","303287370_Feeling_and_thinking_preferences_need_no_inferences_American_Psychologist","262533662_Food_choice_The_battle_between_package_taste_and_consumption_situation","260803641_The_Development_of_an_Emotion_Lexicon_for_the_Coffee_Drinking_Experience","260014053_A_review_of_measurement_and_relationships_between_food_eating_behavior_and_emotion","257390266_Emotional_response_to_fruit_salads_with_different_visual_quality","257390264_Beyond_liking_Comparing_the_measurement_of_emotional_response_using_EsSense_Profile_and_consumer_defined_check-all-that-apply_methodologies","257389804_Measuring_emotional_responses_to_foods_and_food_names_using_questionnaires","248706999_Diversity_in_the_determinants_of_food_choice_A_psychological_perspective","248512414_Hedonic_asymmetry_in_emotional_response_to_consumer_products"]}