{"id":"269769780_Use_B-factor_related_features_for_accurate_classification_between_protein_binding_interfaces_and_crystal_packing_contacts","abstract":"Distinction between true protein interactions and crystal packing contacts is important for structural bioinformatics studies to respond to the need of accurate classification of the rapidly increasing protein structures. There are many unannotated crystal contacts and there also exist false annotations in this rapidly expanding volume of data. Previous tools have been proposed to address this problem. However, challenging issues still remain, such as low performance when the training and test data contain mixed interfaces having diverse sizes of contact areas.\nB factor is a measure to quantify the vibrational motion of an atom, a more relevant feature than interface size to characterize protein binding. We propose to use three features related to B factor for the classification between biological interfaces and crystal packing contacts. The first feature is the sum of the normalized B factors of the interfacial atoms in the contact area, the second is the average of the interfacial B factor per residue in the chain, and the third is the average number of interfacial atoms with a negative normalized B factor per residue in the chain. We investigate the distribution properties of these basic features and a compound feature on four datasets of biological binding and crystal packing, and on a protein binding-only dataset with known binding affinity. We also compare the cross-dataset classification performance of these features with existing methods and with a widely-used and the most effective feature interface area. The results demonstrate that our features outperform the interface area approach and the existing prediction methods remarkably for many tests on all of these datasets.\nThe proposed B factor related features are more effective than interface area to distinguish crystal packing from biological binding interfaces. Our computational methods have a potential for large-scale and accurate identification of biological interactions from the experimentally determined structural data stored at PDB which may have diverse interface sizes.","authors":["Qian Liu","Zhenhua Li","Jinyan Li"],"meta":["December 2014BMC Bioinformatics 15(Suppl 16):S3","DOI:10.1186/1471-2105-15-S16-S3","SourcePubMed"],"references":["260379910_Integrating_water_exclusion_theory_into_bcontacts_to_predict_binding_free_energy_changes_and_binding_hot_spots","236582072_Beta_Atomic_Contacts_Identifying_Critical_Specific_Contacts_in_Protein_Binding_Interfaces","233973136_Protein_interface_classification_by_evolutionary_analysis","319526430_Discriminating_between_homodimeric_and_monomeric_proteins_in_the_crystalline_state","287011007_A_Framework_for_Computational_Morphology","259721753_Benchmarking_protein-protein_interface_predictions_Why_you_should_care_about_protein_size","258313207_Binding_Affinity_Prediction_for_Protein-Ligand_Complexes_Based_on_b_Contacts_and_B_Factor","244635758_Automatic_inference_of_protein_quaternary_structure_from_crystals","227611759_Protein_crystal_packing_contacts","26826110_Propensity_vectors_of_low-ASA_residue_pairs_in_the_distinction_of_protein_interactions"]}