{"id":"269710174_Problems_In_Indoor_Mapping_and_Modelling","abstract":"Research in support of indoor mapping and modelling (IMM) has been active for over thirty years. This research has come in the form of As-Built surveys, Data structuring, Visualisation techniques, Navigation models and so forth. Much of this research is founded on advancements in photogrammetry, computer vision and image analysis, computer graphics, robotics, laser scanning and many others. While IMM used to be the privy of engineers, planners, consultants, contractors, and designers, this is no longer the case as commercial enterprises and individuals are also beginning to apply indoor models in their business process and applications. There are three main reasons for this. Firstly, the last two decades have seen greater use of spatial information by enterprises and the public. Secondly, IMM has been complimented by advancements in mobile computing and internet communications, making it easier than ever to access and interact with spatial information. Thirdly, indoor modelling has been advanced geometrically and semantically, opening doors for developing user-oriented, context-aware applications. This reshaping of the public's attitude and expectations with regards to spatial information has realised new applications and spurred demand for indoor models and the tools to use them. This paper examines the present state of IMM and considers the research areas that deserve attention in the future. In particular the paper considers problems in IMM that are relevant to commercial enterprises and the general public, groups this paper expects will emerge as the greatest users IMM. The subject of indoor modelling and mapping is discussed here in terms of Acquisitions and Sensors, Data Structures and Modelling, Visualisation, Applications, Legal Issues and Standards. Problems are discussed in terms of those that exist and those that are emerging. Existing problems are those that are currently being researched. Emerging problems are those problems or demands that are expected to arise because of social changes, technological advancements, or commercial interests. The motivation of this work is to define a set of research problems that are either being investigated or should be investigated. These will hopefully provide a framework for assessing progress and advances in indoor modelling. The framework will be developed in the form of a problem matrix, detailing existing and emerging problems, their solutions and present best practices. Once the framework is complete it will be published online so that the IMM community can discuss and modify it as necessary. When the framework has reached a steady state an empirical benchmark will be provided to test solutions to posed problems. A yearly evaluation of the problem matrix will follow, the results of which will be published.","authors":["Sisi Zlatanova","George Sithole","Masafumi Nakagawa","Qing Zhu"],"meta":["December 2013","DOI:10.5194/isprsarchives-XL-4-W4-63-2013","Conference: ISPRS Acquisition and Modelling of Indoor and Enclosed Environments 2013At: Cape Town, South ArficaVolume: XL-4/W4"],"references":["266054641_Spatial_models_for_context-aware_indoor_navigation_systems_A_survey","235759072_A_research_framework_for_Implementing_Building_Information_Models_in_Geospatial_Context","226395873_A_Multilayered_Space-Event_Model_for_Navigation_in_Indoor_Spaces","221589395_Modeling_indoor_space","221104092_Testing_Landmark_Identification_Theories_in_Virtual_Environments","51873511_Indoor_Pedestrian_Navigation_Using_Foot-Mounted_IMU_and_Portable_Ultrasound_Range_Sensors","285841494_Close_range_photogrammetry_for_analyzing_distressed_trees"]}