{"id":"269767347_Extensive_Parallel_Processing_on_Scale-Free_Networks","abstract":"We adapt belief-propagation techniques to study the equilibrium behavior of a bipartite spin glass, with interactions between two sets of N and P=αN spins each having an arbitrary degree, i.e., number of interaction partners in the opposite set. An equivalent view is then of a system of N neurons storing P diluted patterns via Hebbian learning, in the high storage regime. Our method allows analysis of parallel pattern processing on a broad class of graphs, including those with pattern asymmetry and heterogeneous dilution; previous replica approaches assumed homogeneity. We show that in a large part of the parameter space of noise, dilution, and storage load, delimited by a critical surface, the network behaves as an extensive parallel processor, retrieving all P patterns in parallel without falling into spurious states due to pattern cross talk, as would be typical of the structural glassiness built into the network. Parallel extensive retrieval is more robust for homogeneous degree distributions, and is not disrupted by asymmetric pattern distributions. For scale-free pattern degree distributions, Hebbian learning induces modularity in the neural network; thus, our Letter gives the first theoretical description for extensive information processing on modular and scale-free networks.","authors":["Peter Sollich","Daniele Tantari","Alessia Annibale","Adriano Barra"],"meta":["December 2014Physical Review Letters 113(23):238106","DOI:10.1103/PhysRevLett.113.238106","SourcePubMed"],"references":["283617646_Storing_Infinite_Numbers_of_Patterns_in_a_Spin-Glass_Model_of_Neural_Networks","260700881_Finite-size_corrections_to_disordered_systems_on_Erdos-Renyi_random_graphs","236935869_Immune_networks_Multitasking_capabilities_near_saturation","235738158_Immune_networks_Multi-tasking_capabilities_at_medium_load","235389552_Multitasking_Associative_Networks","232906096_Random_Walk_Kernels_and_Learning_Curves_for_Gaussian_Process_Regression_on_Random_Graphs","230929831_A_Hebbian_approach_to_complex-network_generation","286097895_Random_Graphs","233820301_Modeling_Brain_Function","223550511_Statistical_mechanics_of_neural_networks_near_saturation"]}