{"id":"269760373_A_Nation_at_Risk_and_the_Blind_Men","abstract":"ONCE upon a time, there lived six blind men in a faraway country. They were revered as leaders, and one day the villagers said to them, \"We need education reform in this land.\" The six men, having no idea what this \"education reform\" was, decided to set about finding out. All of them went to where the reform lived, grabbed hold of a portion, and described what seemed most salient about it. \"Lo, education reform is a way to catch the public's attention and help us get elected,\" said the man who wanted to further his political agenda. \"No! Education reform means educating citizens to support democratic values,\" said the man who lived on a $3-million houseboat. \"Oh, no! It means all students must learn basic skills and how to follow directions,\" said the man who owned the factories. \"Not at all,\" said the fourth man, a strong believer in testing. \"It is a chance to test children at least twice a year, and the more tests the better. We can finally hold teachers accountable.\" \"No! It is an opportunity to garner some state revenue by selling tests for teachers and students,\" said the fifth man, who was a test-maker. \"You're all wrong! It is a way to make sure all children learn what they need to know. It will create academic equality,\" said the sixth man, who was an academician. Then they began to argue about education reform, and every one of them insisted that he was right. They were growing agitated, when a wise man was passing by and heard the commotion. When he had learned the cause of their troubles, the wise man calmly explained, \"All of you are right, and all of you are wrong.\" THE PARADOXES IN EDUCATION Like the six blind men, every part of the land of education reacted differently to A Nation at Risk. And during the rest of the 1980s and 1990s, that report spawned an outpouring of other reports on various aspects of education. Some saw the problem as \"bad teachers,\" which immediately raised the question of \"bad schools of education\" where they were trained. Today, a similar perception is at least partly responsible for the surge in alternative teacher certification programs that has been taking place over the past 25 years. Other observers--even some members of the panel that wrote A Nation at Risk--saw the problem as low standards. Their subsequent labors led to the development of what came to be known as the standards movement--a broad enough term to encompass the efforts of the individual disciplines to set out a body of knowledge and skills in each field along with the efforts of those who pushed for high school graduation exams, which are now facts of life in the majority of states. With regard to the disciplinary standards, Diane Ravitch said in a 2006 interview, \"When they [the standards standards documents] are overwhelming in bulk, they can't be taken seriously. Then they are just a wish list.\" The jury is still out on the high school graduation tests, though concerned observers such as Anne Wheelock in Massachusetts have been collecting and analyzing data on school dropouts before ninth grade. (1) Nor was higher education exempt from criticism in A Nation at Risk, though, as an institution, it has proved less willing to go along with the various proposals that spun off from the original report than has K-12 education. …","authors":["Sally Blake"],"meta":["April 2008Phi Delta Kappan 89(8):601-602","DOI:10.1177/003172170808900814"],"references":[]}