{"id":"269962935_Biometric_Attendance_System","abstract":"This research work has application for attendance system of employer's and students in general. The system will facilitate institutions! organization to make attendance individual in time along with data information thumb impression will be taken as a signature for the system entry. Main design and challenge in this system is the design of database architecture and its business logic. I. AIMS AND OBJECTIVE The aim of this system is to implement in C#.net set of reliable techniques for fingerprint image enhancement and minutiae extraction. The performance of these techniques will be evaluated on a fingerprint data set. In combination with these development techniques, statistical experiments can then be performed on the fingerprint data set. The results from these experiments can be used to help us better understand what is involved in determining the statistical uniqueness of fingerprint minutiae. The main aim that this system would test whether attendance by fingerprint is enough for identification. It is expected that the work in this system will reach the stage of being able to fully test hypothesis. II. BACKGROUND/CONTEXT Fingerprints are the oldest form of biometric identification. Modem fingerprint based identification is used in forensic science, and in biometric systems such as civilian identification devices. Despite the widespread use of fingerprints, there is little statistical theory on the uniqueness of fingerprint minutiae. A fingerprint is formed from an impression on a surface of composite curve segments. A ridge is defined as a single curved segment, and a valley is the region between two adjacent ridges. The minutiae, which are the local discontinuities in the ridge flow pattern, provide the details of the ridge-valley structures, like ridge endings and bifurcations. There are 50 to 150 minutiae on a single fingerprint image. Features such as the type, direction, and location of minutiae are taken into account when performing minutiae extraction. The work of F.Galton defined a set of Galton Features for fingerprint identification, which since then, has been refines and extended to include additional types of fingerprint features. However, most of these features are not used in automatic fingerprint identification systems. Instead the set of minutiae types are restricted into only two types, ridge endings and bifurcations, as other types of minutiae can be expressed in terms of these two features types. Ridge endings are the points where the ridge curves terminates, and bifurcations are where a ridge splits from a single path to two paths at a Y-978-1-4244-9324-1/11/$26.00 ©20 11 IEEE 499 junction. In this research, we will be dealing mainly with ridge endings and bifurcations. There are various types of approaches proposed in literature for both image enhancement, and minutiae extraction from fingerprints. The literature on these techniques will be examined are reviewed in determining the best approach to develop for this research. In particular, the fingerprint image enhancement algorithm employed by Hong et al. will be evaluated and implemented to understand how the enhancement algorithm works and how well it performs. Once a reliable minutiae extraction technique has been implemented and tested, this can be used as the basis of statistical analysis of fingerprint minutiae. The work of Tu and Hartley and Pankanti et al. can be examined in which a statistical framework for analyzing system performance has been presented. Tu and Hartley defined a means of forming a binary code from set of fingerprint features and then performing a set of matching experiments on the database to estimate the number of degrees of freedom within the fingerprint popUlation. Problem There are some problems which face by fingerprint recognition or identification security. We can catch a cold by touching a biometric system (fingerprint). • Twins have identical biometric traits (identical fingerprints, irises ...). This is the same clones. • • • Stolen body parts can be reused. Biometric features can be reconstructed from the template. Making a fake finger is easy. The inability of fingerprint systems to enroll children and small Asian women. III. PROJECT SPECIFICATION A. Project Description The goal of this project is to daily attendance of employee through fingerprint. The project is design and implements software architecture for fingerprint analysis. The system should be able to extract key features from a scanned fingerprint image and to compare these with a database of known fingerprint images and/or extracted feature sets. For this project we provided with a set of previously acquired fingerprints and a working fingerprint sensor with driver software for Windows. Our expectation had fulfilled by most of the algorithm development which executed in C# dot net and this work done on a Windows PC.","authors":["Engr Imran","Imran Anwar Ujan","Ali Imdad","Ismaili"],"meta":["May 2011","DOI:10.1109/ICCME.2011.5876792","Conference: International Conference on Complex Medical EngineeringAt: Harbin, ChinaVolume: Proceedings of the 20 11 IEEEIICME","Project: Assessing the Acceptance of Health Information System by  Healthcare Professionals of Pakistan"],"references":["265290170_Gender_Discrimination_in_Workforce_and_its_Impact_on_the_Employees","3707574_Real-time_minutiae_extraction_in_fingerprint_images","3192878_Fingerprint_Image_Enhancement_Algorithm_and_Performance_Evaluation","2493329_Real-Time_Minutiae_Extraction_In_Fingerprint_Images","220423656_Hall_RW_Parallel_thinning_with_two-subiteration_algorithms_Commun_ACM_32_359-373","15802654_Biological_foundations_for_forensic_identifications_based_on_fingerprint"]}