{"id":"269997422_Information_Theoretic_Graph_Kernels","abstract":"This thesis addresses the problems that arise in state-of-the-art structural learning methods for (hyper)graph classification or clustering, particularly focusing on developing novel information theoretic kernels for graphs.\nTo this end, we commence in Chapter 3 by defining a family of Jensen-Shannon diffusion kernels, i.e., the information theoretic kernels, for (un)attributed graphs. We show that our kernels overcome the shortcomings of inefficiency (for the unattributed diffusion kernel) and discarding un-isomorphic substructures (for the attributed diffusion kernel) that arise in the R-convolution kernels. In Chapter 4, we present a novel framework of computing depth-based complexity traces rooted at the centroid vertices for graphs, which can be efficiently computed for graphs with large sizes. We show that our methods can characterize a graph in a higher dimensional complexity feature space than state-of-the-art complexity measures. In Chapter 5, we develop a novel unattributed graph kernel by matching the depth-based substructures in graphs, based on the contribution in Chapter 4. Unlike most existing graph kernels in the literature which merely enumerate similar\nsubstructure pairs of limited sizes, our method incorporates explicit local substructure correspondence into the process of kernelization. The new kernel thus overcomes the shortcoming of neglecting structural correspondence that arises in most state-of-the-art graph kernels. The novel methods developed in Chapters 3, 4, and 5 are only restricted to graphs. However, real-world data usually tends to be represented by higher order relationships (i.e., hypergraphs). To overcome the shortcoming, in Chapter 6 we present a new hypergraph kernel using substructure isomorphism tests. We show that our kernel limits tottering that arises in the existing walk and subtree based (hyper)graph kernels. In Chapter 7, we summarize the contributions of this thesis. Furthermore, we analyze the proposed methods. Finally, we give some suggestions for the future work.","authors":["Lu Bai"],"meta":["October 2014","Thesis for: Doctor of Philosophy, University of York, UKAdvisor: Edwin Hancock"],"references":["274006359_Prediction_of_cell_penetrating_peptides_by_support_vector_machines","319770516_A_combined_corner_and_edge_detector","313385761_Data_Mining_Practical_Machine_Learning_Tools_and_Techniques","312538118_Support-vector_networks","307881957_LIBSVM_A_library_for_support_vector_machines","300441969_CLASSIFICATION_AND_CLUSTERING_OF_VECTOR_SPACE_EMBEDDED_GRAPHS","286680987_Quantifying_complexity_in_networks_The_von_Neumann_entropy","285278428_Text_Categorization_with_Support_Vector_Machines_Learning_with_Many_Relevant_Features","280940018_Pattern_Recognition_and_Machine_Learning","268026516_A_Unified_Framework_for_Strengthening_Topological_Node_Features_and_Its_Application_to_Subgraph_Isomorphism_Detection","266889647_Entropy_and_the_Complexity_of_Graphs_Revisited","262349003_Entropy_and_Heterogeneity_Measures_for_Directed_Graphs","266999329_Center_of_a_graph_with_respect_to_edges","266959712_Bridging_the_Gap_Between_Graph_Edit_Distance_and_Kernel_Machines","265426020_Algorithms_for_the_Assignment_and_Transportation_Problems"]}