{"id":"270055026_Measuring_the_effectiveness_of_scientific_gatekeeping","abstract":"Peer review is the main institution responsible for the evaluation and gestation of scientific research. Although peer review is widely seen as vital to scientific evaluation, anecdotal evidence abounds of gatekeeping mistakes in leading journals, such as rejecting seminal contributions or accepting mediocre submissions. Systematic evidence regarding the effectiveness-or lack thereof-of scientific gatekeeping is scant, largely because access to rejected manuscripts from journals is rarely available. Using a dataset of 1,008 manuscripts submitted to three elite medical journals, we show differences in citation outcomes for articles that received different appraisals from editors and peer reviewers. Among rejected articles, desk-rejected manuscripts, deemed as unworthy of peer review by editors, received fewer citations than those sent for peer review. Among both rejected and accepted articles, manuscripts with lower scores from peer reviewers received relatively fewer citations when they were eventually published. However, hindsight reveals numerous questionable gatekeeping decisions. Of the 808 eventually published articles in our dataset, our three focal journals rejected many highly cited manuscripts, including the 14 most popular; roughly the top 2 percent. Of those 14 articles, 12 were desk-rejected. This finding raises concerns regarding whether peer review is ill-suited to recognize and gestate the most impactful ideas and research. Despite this finding, results show that in our case studies, on the whole, there was value added in peer review. Editors and peer reviewers generally-but not always-made good decisions regarding the identification and promotion of quality in scientific manuscripts.","authors":["Kyle Siler","Kirby Lee","Lisa Bero"],"meta":["December 2014Proceedings of the National Academy of Sciences 112(2)","DOI:10.1073/pnas.1418218112","SourcePubMed"],"references":["333026320_Laboratory_Life_The_Construction_of_Scientific_Facts","308052677_Why_most_published_research_findings_are_false","303151791_Competing_Technologies_Increasing_Returns_and_Lock-in_by_Historical_Events","298852493_The_Matthew_Effect_in_Science","297098418_RADIOIMMUNOASSAY_-_PROBE_FOR_FINE-STRUCTURE_OF_BIOLOGIC_SYSTEMS","285666280_The_Frequency_Distribution_of_Scientific_Productivity","283617653_Emergence_of_Scaling_in_Random_Networks","283617410_Emergence_of_Scaling_in_Random_Networks","278173788_Diffusing_through_Disciplines_Insiders_Outsiders_and_Socially_Influenced_Citation_Behavior","277815637_The_Matthew_effect_in_science"]}