{"id":"270165347_A_Numerical_Simulation_Model_for_Thermal_Recovery_Processes","abstract":"This paper describes a model for numerically simulating thermal recovery processes. The primary locus is on the simulation of in-situ combustion, but the formulation also represents fire-and-water flooding, steamflooding, hot water flooding, steam stimulation, and spontaneous ignition as well. The simulator describes the flow of water, oil, and gas, and includes gravity and capillary effects. Heat transfer by conduction, convection, and vaporization-condensation of both water and hydrocarbons are included.\nThe rigorous but general nature of the simulator is obtained by employing conservation balance equations for oxygen, inert gases, a light hydrocarbon pseudocomponent, a heavy hydrocarbon pseudocomponent, water, coke, and energy. pseudocomponent, water, coke, and energy. Vaporization-condensation is governed by vaporliquid equilibrium using temperature and pressure-dependent equilibrium coefficients. Four pressure-dependent equilibrium coefficients. Four chemical reactions are accounted for: formation of coke from the heavy hydrocarbon component and the oxidation of coke and both heavy and light hydrocarbon components.\nFormulation details, numerical solution procedures, and computational results are presented. procedures, and computational results are presented. The computational results include both one- and two-dimensional cross-sectional studies. The simulator represents a major improvement in the ability to simulate thermal recovery processes under complex conditions.\n\nIntroduction\nConsiderable progress has been made in numerically simulating thermally enhanced oil-recovery processes during the last few years. This is particularly true for-processes involving steam, where we have seen a continual improvement of our ability to treat the problem. The most recent contributions provide an analysis capability for steam displacement and steam stimulation recovery methods, accounting for all the important physical mechanisms of these processes.\nProgress in simulating the performance of in-situ combustion processes is not so advanced. Initial simulation attempts were concerned primarily with the heat-transfer aspects of combustion. The most sophisticated heat-transfer model was developed by Chu. His numerical model considers the energy effects of vaporization and condensation on the temperature distribution, but neglects the accompanying phase changes by assuming constant fluid saturations.\nMore recent heat transfer or heat-wave models for the in-situ combustion process were proposed by Kuo in 1969 and by Smith and Farouq-Ali in 1971. Kuo's model allows two temperature fronts-one at the combustion zone and one at a heat front. The heat-front position is predicted by gas flow that is allowed to have a velocity different from the velocity of the combustion front. The simulator proposed by Smith and Farouq-Ali is designed for proposed by Smith and Farouq-Ali is designed for predicting sweep efficiencies in confined well predicting sweep efficiencies in confined well patterns. Their numerical model accounts for heat patterns. Their numerical model accounts for heat generation by a combustion zone (assuming fixed fuel content all through the reservoir), heat transfer by conduction and convection (single-phase gas flow) in the reservoir, heat losses by conduction to adjacent formations, and different permeability-to-gas (air) flow on either side of the combustion zone.\nSpecial cases of the in-situ combustion process were studied by Gottfried and Khelil. These authors examine the heat transfer and oxygen use in reservoirs composed of an oil-bearing layer and an overlying \"clean\" porous zone containing only gas. These models were designed primarily to investigate the various transport mechanisms present when combustion is initiated in a reservoir present when combustion is initiated in a reservoir containing a gas cap. Because of the many assumptions invoked and the specialized geometry to which they apply, they do not satisfy the need for a general purpose simulator.\nSPEJ\nP. 37","authors":["R.B. Crookston","W.E. Culham","W.H. Chen"],"meta":["April 2013Society of Petroleum Engineers Journal 19(01):37-58","DOI:10.2118/6724-PA"],"references":[]}