{"id":"270163293_Application_of_k-Nearest_Neighbour_Classification_in_Medical_Data_Mining","abstract":"Medical data is an ever-growing source of information from hospitals in form of patient records. When mined, the information hidden in these records is a huge resource bank for medical research. This data contains hidden patterns and relationships, which can lead to better diagnosis. Unfortunately, discovery of these patterns and relationships often goes unexploited. Studies have been carried out in medical diagnosis to predict heart diseases, lungs diseases, and various tumors based on the past data collected from patients. However, they are mostly limited to domain-specific systems that predict diseases restricted to their area of operations. In retrospect, the performance of the k-nearest neighborhoods (k-NN) classifier is highly dependent on the distance metric used to identify the k nearest neighbors of the query points. The standard Euclidean distance is commonly used in practice. This study uses vast storage of information so that diagnosis based on historical data can be made. It focuses on computing the probability of occurrence of a particular ailment by using a unique algorithm. This k-NN algorithm increases the accuracy of such diagnosis. The algorithm can be used to enhance the automated diagnoses, which include diagnosis of multiple diseases showing similar symptoms.","authors":["Hassan Shee","Wilson Cheruiyot","Stephen Kimani"],"meta":["April 2014"],"references":["307840134_Statistical_Analysis_of_Risk_Factors_for_Cardiovascular_disease_in_Malakand_Division","283968335_Applications_of_data_mining_techniques_in_healthcare_and_prediction_of_heart_attacks","255611934_Cardiovascular_Disease_Risk_Factors_among_Adult_Australian-Lebanese_in_Melbourne","249910228_Data_Modelling_and_Specific_Rule_Generation_via_Data_Mining_Techniques","321570626_The_History_of_Medical_Informatics_in_the_United_States","312463714_Knowledge_discovery_in_databases_An_overview","296765561_Primary_health_care_now_more_than_ever","267161621_Principles_of_Data_Mining","258055333_Optimizing_Total_Facial_Nerve_Patient_Management_for_Effective_Clinical_Outcomes_Research","248579388_Sample-Specific_Universal_Metric_Approaches_for_Determining_the_Sex_of_Immature_Human_Skeletal_Remains_Using_Permanent_Tooth_Dimensions"]}