{"id":"270157832_Taches_de_programmation_avec_Scratch_a_l'ecole_primaire_Observation_et_analyse_du_developpement_des_competences_en_mathematique","abstract":"Cette contribution a pour objet d’une part de décrire un dispositif d’apprentissage en mathématique mobilisant le logiciel de programmation « Scratch » développé par le MIT et d’autre part, de rapporter des résultats quant aux effets de cet environnement sur la progression de la maîtrise des compétences des élèves à l’école primaire. Les études empiriques relatives à l’usage du Logo révèlent qu’il ne suffit pas de laisser l’élève livré à lui-même dans un micromonde pour observer des effets positifs sur le développement de ses compétences (Gurtner, 1991). Elles mettent en évidence que le rôle de l’enseignant est primordial à la fois en termes de conception de tâches didactiques et en termes d’encadrement de celles-ci. La scénarisation présentée dans cet article prend en considération cette recommandation. Elle s’appuie sur une dizaine de séquences d’apprentissage basées sur des situations problèmes guidées et pouvant être résolues à l’aide de la programmation de scripts dans Scratch. Si nous observons des gains d’apprentissage élevés dans le domaine des grandeurs, des nombres et de la structuration spatiale, l'impact du dispositif semble plus réduit pour les compétences relatives à la résolution de problèmes et pour le raisonnement logique. Un autre résultat intéressant qui ressort de notre analyse est l'effet du scénario en termes d’équité. Les résultats des apprenants sont en effet plus homogènes au terme de l’apprentissage.","authors":["Gaëtan Temperman","Caroline Anthoons","Bruno De Lièvre","Joachim De Stercke"],"meta":["December 2014","Projects: Mathématique, Didactique & NumériqueUsages du numérique en Education"],"references":["271746747_The_Effects_of_Teaching_Programming_via_Scratch_on_Problem_Solving_Skills_A_Discussion_from_Learners'_Perspective","237066768_Using_Scratch_with_Primary_School_Children_An_Evaluation_of_Games_Constructed_to_Gauge_Understanding_of_Programming_Concepts","228986212_What_videogame_making_can_teach_us_about_literacy_and_learning_Alternative_pathways_into_participatory_culture","220426817_Scratch_Programming_for_All","32231259_LOGO_and_the_Development_of_Thinking_Skills","278694075_Imagining_Creating_Playing_Sharing_Reflecting_How_Online_Community_Supports_Young_People_as_Designers_of_Interactive_Media","234731271_Transfer_of_LOGO_Debugging_Skill_Analysis_Instruction_and_Assessment","34823071_LOGO_programming_and_the_teaching_and_learning_of_problem_solving"]}