{"id":"270292476_On_Randomized_Algorithms_for_Matching_in_the_Online_Preemptive_Model","abstract":"We investigate the power of randomized algorithms for the maximum cardinality matching (MCM) and the maximum weight matching (MWM) problems in the online preemptive model. In this model, the edges of a graph are revealed one by one and the algorithm is required to always maintain a valid matching. On seeing an edge, the algorithm has to either accept or reject the edge. If accepted, then the adjacent edges are discarded. The complexity of the problem is settled for deterministic algorithms [7, 9].\nAlmost nothing is known for randomized algorithms. A lower bound of 1.693 is known for MCM with a trivial upper bound of two. An upper bound of 5.356 is known for MWM. We initiate a systematic study of the same in this paper with an aim to isolate and understand the difficulty. We begin with a primal-dual analysis of the deterministic algorithm due to [7]. All deterministic lower bounds are on instances which are trees at every step. For this class of (unweighted) graphs we present a randomized algorithm which is \\(\\frac{28}{15}\\)-competitive. The analysis is a considerable extension of the (simple) primal-dual analysis for the deterministic case. The key new technique is that the distribution of primal charge to dual variables depends on the “neighborhood” and needs to be done after having seen the entire input. The assignment is asymmetric: in that edges may assign different charges to the two end-points. Also the proof depends on a non-trivial structural statement on the performance of the algorithm on the input tree.\nThe other main result of this paper is an extension of the deterministic lower bound of Varadaraja [9] to a natural class of randomized algorithms which decide whether to accept a new edge or not using independent random choices. This indicates that randomized algorithms will have to use dependent coin tosses to succeed. Indeed, the few known randomized algorithms, even in very restricted models follow this.\nWe also present the best possible \\(\\frac{4}{3}\\)-competitive randomized algorithm for MCM on paths.","authors":["Ashish Chiplunkar","Sumedh Tirodkar","Sundar Vishwanathan"],"meta":["December 2014","DOI:10.1007/978-3-662-48350-3_28","SourcearXiv"],"references":["248382125_Ranking_on_Arbitrary_Graphs_Rematch_via_Continuous_LP_with_Monotone_and_Boundary_Condition_Constraints","220897836_Buyback_Problem_-_Approximate_Matroid_Intersection_with_Cancellation_Costs","261211954_Randomized_Greedy_Algorithms_for_the_Maximum_Matching_Problem_with_New_Analysis","228444946_Improved_Bounds_for_Online_Preemptive_Matching","222519034_On_Graph_Problems_in_a_Semi-Streaming_Model","221591759_An_Optimal_Algorithm_for_On-line_Bipartite_Matching","221462683_Finding_Graph_Matchings_in_Data_Streams","220365644_The_Design_of_Competitive_Online_Algorithms_via_a_Primal-Dual_Approach","46587346_Buyback_Problem_-_Approximate_Matroid_Intersection_with_Cancellation_Costs","4354712_Probabilistic_computations_Toward_a_unified_measure_of_complexity"]}