{"id":"270290019_The_effect_of_repeated_firings_on_the_color_change_of_dental_ceramics_using_different_glazing_methods","abstract":"Surface color is one of the main criteria to obtain an ideal esthetic. Many factors such as the type of the material, surface specifications, number of firings, firing temperature and thickness of the porcelain are all important to provide an unchanged surface color in dental ceramics. The aim of this study was to evaluate the color changes in dental ceramics according to the material type and glazing methods, during the multiple firings.\nThree different types of dental ceramics (IPS Classical metal ceramic, Empress Esthetic and Empress 2 ceramics) were used in the study. Porcelains were evaluated under five main groups according to glaze and natural glaze methods. Color changes (ΔE) and changes in color parameters (ΔL, Δa, Δb) were determined using colorimeter during the control, the first, third, fifth, and seventh firings. The statistical analysis of the results was performed using ANOVA and Tukey test.\nThe color changes which occurred upon material-method-firing interaction were statistically significant (P<.05). ΔE, ΔL, Δa and Δb values also demonstrated a negative trend. The MC-G group was less affected in terms of color changes compared to other groups. In all-ceramic specimens, the surface color was significantly affected by multiple firings.\nFiring detrimentally affected the structure of the porcelain surface and hence caused fading of the color and prominence of yellow and red characters. Compressible all-ceramics were remarkably affected by repeated firings due to their crystalline structure.","authors":["Kerem Yılmaz","Fehmi Gonuldas","Caner Ozturk"],"meta":["December 2014The Journal of Advanced Prosthodontics 6(6):427-33","DOI:10.4047/jap.2014.6.6.427","SourcePubMed"],"references":["227850717_Color_managing_the_3rd_edition_of_Billmeyer_and_Saltzman's_Principles_of_Color_Technology","51545441_The_effect_of_ceramic_thickness_and_number_of_firings_on_the_color_of_a_zirconium_oxide_based_all_ceramic_system_fabricated_using_CADCAM_technology","26235304_Effect_of_repeated_firings_on_the_color_of_opaque_porcelain_applied_on_different_dental_alloys","271618825_Relative_translucency_of_six_all-ceramic_systems_Part_I_Core_materials","240043747_Introduction_to_Ceramics","227863497_A_Comparison_of_the_Microstructure_and_Properties_of_the_IPS_Empress_2_and_the_IPS_Empress_Glass-Ceramics","221956757_Color_stability_of_dental_resin_materials_for_crown_and_bridge_veneers","49626598_The_effect_of_repeated_firings_on_the_color_of_an_all-ceramic_system_with_two_different_veneering_porcelain_shades","44516151_Esthetics_of_anterior_fixed_prosthodontics_Gerard_Chiche_Alain_Pinault","44475901_Theory_and_Practice_of_Crown_and_Bridge_Prosthodontics"]}