{"id":"270282794_Opportunities_for_Nonvolatile_Memory_Systems_in_Extreme-Scale_High_Performance_Computing","abstract":"For extreme-scale high performance computing systems, system-wide power consumption has been identified as one of the key constraints moving forward, where the DRAM main memory systems account for about 30-50% of a node's overall power consumption. Moreover, as the benefits of device scaling for DRAM memory slow, it will become increasingly difficult to keep memory capacities balanced with increasing computational rates offered by next-generation processors. However, a number of emerging memory technologies - nonvolatile memory (NVM) devices - are being investigated as an alternative for DRAM. Moving forward, these NVM devices may offer a number of solutions for HPC architectures. First, as the name, NVM, implies, these devices retain state without continuous power, which can, in turn, reduce power costs. Second, certain NVM devices can be as dense as DRAM, facilitating more memory capacity in the same physical volume. Finally, NVM, such as contemporary NAND flash memory, can be less expensive than DRAM in terms of cost per bit. Taken together, these benefits can provide opportunities for revolutionizing the design of extreme-scale HPC systems. Researchers are investigating how to integrate these emerging technologies into future extreme-scale HPC systems, and how to expose these capabilities in the software stack and applications. Current results show a number of these strategies may offer high-bandwidth I/O, larger main memory capacities, persistent data structures, and new approaches for application resilience and output post-processing, such as transaction-based, incremental-checkpointing and in-situ visualization, respectively.","authors":["Jeffrey Vetter","Sparsh Mittal"],"meta":["March 2015Computing in Science and Engineering 17(2)","DOI:10.1109/MCSE.2015.4"],"references":["277637285_A_Survey_of_Software_Techniques_for_Using_Non-Volatile_Memories_for_Storage_and_Main_Memory_Systems","266316557_Flipping_Bits_in_Memory_Without_Accessing_Them_An_Experimental_Study_of_DRAM_Disturbance_Errors","261722253_LastingNVCache_A_Technique_for_Improving_the_Lifetime_of_Non-volatile_Caches","261400322_Identifying_Opportunities_for_Byte-Addressable_Non-Volatile_Memory_in_Extreme-Scale_Scientific_Applications","312713749_Hybrid_memory_cube_HMC","305699709_Contemporary_High_Performance_Computing_From_Petascale_Toward_Exascale","278878621_A_19_nm_1128_mm2_64_Gb_Multi-Level_Flash_Memory_With_400_Mbitsecpin_18_V_Toggle_Mode_Interface","278641126_Mnemosyne","262152418_Exploring_DRAM_organizations_for_energy-efficient_and_resilient_exascale_memories","261494705_Evaluating_STT-RAM_as_an_energy-efficient_main_memory_alternative"]}