{"id":"270397806_Closing_the_gender_gap_in_an_introductory_programming_course","abstract":"Although there is a growing interest in learning to program, the number of women involved in programming remains surprisingly low. We don't understand completely the causes but it has become clear that men and women have different perceptions of programming. The pedagogy of introductory programming courses should take these differences into account. In this study we analyze gender differences in an introductory programming course at the university level. Our results indicate that male and female students have different perceptions and learning outcomes: male students find programming easier, have a higher intention to program in the future and show higher learning outcomes than female students. To reduce these differences we have designed and implemented several learning modules using the principles of physical computing. The physical computing approach aims to take computational concepts out of the screen and into the real world so that students can interact with them. We have applied these modules in a MATLAB introductory programming course in a biology degree. When using these modules both male and female students showed similar results in perceptions and learning outcomes. The use of physical computing principles in combination with the traditional methodology reduced –actually closed– this gender gap.","authors":["Miguel Angel Rubio","Rocio Romero-Zaliz","Carolina Mañoso","Ángel Pérez De Madrid"],"meta":["March 2015Computers & Education 82","DOI:10.1016/j.compedu.2014.12.003","Project: Physical computing in introductory programming"],"references":["347881175_Peer_Instruction_Ten_years_of_experience_and_results","312455832_R_A_Language_and_Environment_for_Statistical_Computing","291578456_Women_catch_up","290232301_European_Women_in_Computing","290108564_Programming_Pathways_A_Technique_for_Analyzing_Novice_Programmers'_Learning_Trajectories","285886153_Brain-based_programming_continued","284354409_Student_Coding_Styles_as_Predictors_of_Help-Seeking_Behavior","281038162_Georgia_Computes_An_Intervention_in_a_US_State_with_Formal_and_Informal_Education_in_a_Policy_Context","274056277_A_Case_Study_of_the_Introduction_of_Computer_Science_in_NZ_Schools","272177691_Cronbach's_Alpha_A_Tool_for_Assessing_the_Reliability_of_Scales"]}