{"id":"270412806_Effects_of_Computer_Programming_on_Cognitive_Outcomes_A_Meta-Analysis","abstract":"Although claims regarding the cognitive benefits of computer programming have been made, results from existing empirical studies are conflicting. To make a more reliable conclusion on this issue, a meta-analysis was performed to synthesize existing research concerning the effects of computer programming on cognitive outcomes. Sixty-five studies were located from three sources, and their quantitative data were transformed into a common scale—Effect Size. The analysis showed that 58 or 89 percent of the study-weighted effect sizes were positive and favored the computer programming group over the control groups. The overall grand mean of the study-weighted effect size for all 432 comparisons was 0.41; this suggests that students having computer programming experiences scored about sixteen percentile points higher on various cognitive-ability tests than students who did not have programming experiences. In addition, four of the seven coded variables selected for this study (i.e., type of publication, grade level, language studied, and duration of treatment) had a statistically significant impact on the mean study-weighted effect sizes. The findings suggest that the outcomes of learning a computer language go beyond the content of that specific computer language. The results also suggest to teachers a mildly effective approach for teaching cognitive skills in a classroom setting.","authors":["Yuen-kuang Cliff Liao","George W. Bright"],"meta":["August 1991Journal of Educational Computing Research 7(3):251-266","DOI:10.2190/E53G-HH8K-AJRR-K69M"],"references":["291101856_Computer_programming_as_a_vehicle_for_teaching_thinking_skills","287718804_Problem_Solving_Metacognition_and_Composition_The_Effects_of_Interactive_Software_for_First-Grade_Children","275899460_Effects_of_A_Logo_Microworld_on_Student_Ability_To_Transfer_A_Concept","275624003_A_Comparison_of_the_Effects_of_Logo_and_a_CAI_Learning_Environment_on_Skills_Acquisition","274347098_Cognitive_Effects_of_A_Logo-Enriched_Mathematics_Program_For_Middle_School_Students","272586761_Mathematical_Problem-Solving_Performance_of_Eighth-Grade_Programmers_and_Nonprogrammers","270413534_Microcomputer-Based_Instruction_In_Special_Education","269949286_Concept_Learning_in_Preschool_Children_Effects_of_a_Short-Term_Logo_Experience","269864941_The_Effect_of_Learning_To_Program_In_Logo_on_Reasoning_Skills_of_Junior_High_School_Students","262321649_Effects_of_Learning_to_Program_A_Computer_in_BASIC_or_Logo_on_Problem-solving_Abilities"]}