{"id":"270454809_Community_detection_in_temporal_multilayer_networks_and_its_application_to_correlation_networks","abstract":"Networks are a convenient way to represent complex systems of interacting\nentities. Many networks contain \"communities\" of nodes that are more densely\nconnected to each other than to nodes in the rest of the network. In this\npaper, we investigate the detection of communities in temporal networks\nrepresented as multilayer networks. As a focal example, we study time-dependent\nfinancial-asset correlation networks. We first argue that the use of the\n\"modularity\" quality function---which is defined by comparing edge weights in\nan observed network to expected edge weights in a \"null network\"---is\napplication-dependent. We differentiate between \"null networks\" and \"null\nmodels\" in our discussion of modularity maximization, and we highlight that the\nsame null network can correspond to different null models. We then investigate\na multilayer modularity-maximization problem to identify communities in\ntemporal networks. Our multilayer analysis only depends on the form of the\nmaximization problem and not on the specific quality function that one chooses.\nWe introduce a diagnostic to measure \\emph{persistence} of community structure\nin a multilayer network partition. We prove several results that describe how\nthe multilayer maximization problem measures a trade-off between static\ncommunity structure within layers and higher values of persistence across\nlayers. We also discuss some implementation issues that the popular \"Louvain\"\nheuristic faces with temporal multilayer networks and suggest ways to mitigate\nthem.","authors":["Marya Bazzi","Mason A. Porter","Stacy Williams","Mark Mcdonald"],"meta":["December 2014SIAM Journal on Multiscale Modeling and Simulation 14(1)","DOI:10.1137/15M1009615","SourcearXiv"],"references":["272422849_Random_Walks_Markov_Processes_and_the_Multiscale_Modular_Organization_of_Complex_Networks","266477772_Change_Point_Detection_in_Correlation_Networks","313203353_The_architecture_of_complexity","296934181_Extracting_the_hierarchical_organization_of_complex_systems_vol_104_pg_15224_2007","285874604_Functional_Cartography_of_Complex_Metabolic_Networks","285098439_Exponential_numbers","283738615_Resolution_limit_in_community_detection","280773148_Modern_temporal_network_theory_A_colloquium","280566512_Networks_An_Introduction","268817412_The_Structure_and_Dynamics_of_Multilayer_Networks"]}