{"id":"270443256_Amoeba-inspired_algorithm_for_cognitive_medium_access","abstract":"The “tug-of-war (TOW) model” is a unique parallel search algorithm for solving the multi-armed bandit problem (BP), which was inspired by the photoavoidance behavior of a single-celled amoeboid organism, the true slime mold Physarum polycephalum [1-4]. “The cognitive medium access (CMA) problem,” which refers to multiuser channel allocations of the cognitive radio, can be interpreted as a “competitive multi-armed bandit problem (CBP) [5, 6].” Unlike the normal BP, the CBP considers a competitive situation in which more than one user selects a channel whose reward probability (probability of which channel is free) varies depending on the number and combination of the selecting users as indicated in a payoff matrix. Depending on the payoff matrix, the CBP provides a hard problem instance in which the users should not be attracted to the Nash equilibrium to achieve the “social maximum,” which is the most desirable state to obtain the maximum total score (throughput) for all the users. In this study, we propose two variants of the TOW model (solid type and liquid type) for the CBP toward developing a CMA protocol using a distributed control in uncertain environments. Using the minimum CBP cases where both the users choose a channel from the two considered channels, we show that the performance of our solid-type TOW model is better than that of the well-known upper confidence bound 1 (UCB1)-tuned algorithm, particularly for the hard problem instances. The aim of this study is to explore how the users can achieve the social maximum in a decentralized manner. We also show that our liquid-type TOW model, which introduces direct interactions among the users for avoiding mutual collisions, makes it possible to achieve the social maximum for general CBP instances.","authors":["Song-Ju Kim","Masashi Aono"],"meta":["April 2014Nonlinear Theory and Its Applications IEICE 5(2):198-209","DOI:10.1587/nolta.5.198"],"references":["269581333_Tug-of-war_Model_for_Competitive_Multi-armed_Bandit_Problem_Amoeba-inspired_Algorithm_for_Cognitive_Medium_Access","258360231_Unconventional_Computation","255715069_ERRATUM_Decision_Maker_based_on_Nanoscale_Photo-excitation_Transfer","238378872_Modification_of_UCT_with_Patterns_in_Monte-Carlo_Go","236234990_Amoeba-based_Chaotic_Neurocomputing_Combinatorial_Optimization_by_Coupled_Biological_Oscillators","236234164_Greedy_versus_social_Resource-competing_oscillator_network_as_a_model_of_amoeba-based_neurocomputer","255638348_An_Idea_Based_on_Honey_Bee_Swarm_for_Numerical_Optimization_Technical_Report_-_TR06","243770427_Ant_algorithm_for_discrete_optimization","236234970_Tug-of-war_model_for_the_two-bandit_problem_Nonlocally-correlated_parallel_exploration_via_resource_conservation","224505430_Medium_Access_in_Cognitive_Radio_Networks_A_Competitive_Multi-armed_Bandit_Framework"]}