{"id":"270454513_Efficient_Two-Step_Protocol_and_Its_Discriminative_Feature_Selections_in_Secure_Similar_Document_Detection","abstract":"Secure similar document detection (SSDD) identifies similar documents of two\nparties while each party does not disclose its own sensitive documents to\nanother party. In this paper, we propose an efficient 2-step protocol that\nexploits a feature selection as the lower-dimensional transformation and\npresents discriminative feature selections to maximize the performance of the\nprotocol. For this, we first analyze that the existing 1-step protocol causes\nserious computation and communication overhead for high dimensional document\nvectors. To alleviate the overhead, we next present the feature selection-based\n2-step protocol and formally prove its correctness. The proposed 2-step\nprotocol works as follows: (1) in the filtering step, it uses low dimensional\nvectors obtained by the feature selection to filter out non-similar documents;\n(2) in the post-processing step, it identifies similar documents only from the\nnon-filtered documents by using the 1-step protocol. As the feature selection,\nwe first consider the simplest one, random projection (RP), and propose its\n2-step solution SSDD-RP. We then present two discriminative feature selections\nand their solutions: SSDD-LF (local frequency) which selects a few dimensions\nlocally frequent in the current querying vector and SSDD-GF (global frequency)\nwhich selects ones globally frequent in the set of all document vectors. We\nfinally propose a hybrid one, SSDD-HF (hybrid frequency), that takes advantage\nof both SSDD-LF and SSDD-GF. We empirically show that the proposed 2-step\nprotocol outperforms the 1-step protocol by three or four orders of magnitude.","authors":["Sang-Pil Kim","Myeong-Sun Gil","Yang-Sae Moon","Hee-Sun Won"],"meta":["March 2017Security and Communication Networks 2017(2)","DOI:10.1155/2017/6841216","SourcearXiv"],"references":["304459767_Secure_principal_component_analysis_in_multiple_distributed_nodes_Secure_principal_component_analysis_in_multiple_distributed_nodes","313079592_Privacy_preserving_data_mining","303802749_Indexing_by_Latent_Semantic_Analysis","295919316_Secure_Similar_Document_Detection_with_Simhash","292142072_Novel_Approaches_for_Privacy_Preserving_Data_Mining_in_k-Anonymity_Model","286964082_Privacy-Preserving_Data_Mining_A_Survey","276950797_The_pyramid-technique","272037815_Triangular_inequality-based_rotation-invariant_boundary_image_matching_for_smart_devices","268688956_Privacy_Preserving_Data_Mining_Techniques_in_a_Distributed_Environment","262235629_Privacy-preserving_data_mining"]}