{"id":"270454518_On_the_Uniform_Computational_Content_of_Computability_Theory","abstract":"We demonstrate that the Weihrauch lattice can be used to study the uniform\ncomputational content of computability theoretic properties and theorems in one\ncommon setting. The properties that we study include diagonal\nnon-computability, hyperimmunity, complete extensions of Peano arithmetic,\n1-genericity, Martin-L\\\"of randomness and cohesiveness. The theorems that we\ninclude in our case study are the Low Basis Theorem of Jockusch and Soare, the\nKleene-Post Theorem and Friedman's Jump Inversion Theorem. It turns out that\nall the aforementioned properties and many theorems in computability theory,\nincluding all theorems that claim the existence of some Turing degree, have\nvery little uniform computational content. They are all located outside of the\nupper cone of binary choice (also known as LLPO) and we call problems with this\nproperty indiscriminative. Since practically all theorems from classical\nanalysis whose computational content has been classified are discriminative,\nour observation could yield an explanation for why theorems and results in\ncomputability theory typically have very little direct consequences in other\ndisciplines such as analysis. A notable exception in our case study is the Low\nBasis Theorem which is discriminative, this is perhaps why it is considered to\nbe one of the most applicable theorems in computability theory. In some cases a\nbridge between the indiscriminative world and the discriminative world of\nclassical mathematics can be established via a suitable residual operation and\nwe demonstrate this in case of the cohesiveness problem, which turns out to be\nthe quotient of two discriminative problems, namely the limit operation and the\njump of Weak K\\H{o}nig's Lemma.","authors":["Vasco Brattka","Matthew Hendtlass","Alexander P. Kreuzer"],"meta":["November 2017Theory of Computing Systems 61(4)","DOI:10.1007/s00224-017-9798-1","SourcearXiv"],"references":["319254591_Computability_of_the_Radon-Nikodym_Derivative","321524558_Texts_in_Theoretical_Computer_Science_An_EATCS_Series","319393392_Computability_Theory","316807405_Constructive_Analysis","311332505_Separating_fragments_of_WLEM_LPO_and_MP","300779618_Degrees_of_Unsolvability_A_Tutorial","282692184_On_the_Uniform_Computational_Content_of_the_Baire_Category_Theorem","281717179_Las_Vegas_computability_and_algorithmic_randomness","268820239_Diagonally_non-computable_functions_and_fireworks","267002206_Slicing_the_truth_On_the_computable_and_reverse_mathematics_of_combinatorial_principles","266591162_New_directions_in_computability_and_randomness","264994761_1_Algorithmic_Randomness_and_Complexity","265782746_Diagonally_Non-Computable_Functions_and_Bi-Immunity","265318560_Computability_Theory","262214882_On_the_Computational_Content_of_the_Brouwer_Fixed_Point_Theorem"]}