{"id":"270570650_Engagement_with_and_participation_in_online_discussion_forums","abstract":"This article reports on a small-scale study that examined student engagement with and participation in a university online discussion forum site. The main aim of the study was to identify factors that encourage or discourage student participation in the forum. The study involved the tasks posted on the forum site with which students could engage and provide answers. The content of the discussion forums provided data for this study. The study used a post-graduate module with relatively high student numbers offered by an open and distance learning (ODL) institution of higher education in South Africa. A grounded theory approach was used for data analysis. The results show that participation does not mean that the discussion forums are being used effectively, and it certainly does not indicate that student learning is being enhanced. Discussion forum effectiveness and student interaction are increased by greater social presence on the part of lecturers, especially in the form of technical support, providing constructive feedback, and by setting clear expectations to help students understand what is expected of them.","authors":["Sello Mokoena"],"meta":["April 2013Turkish Online Journal of Educational Technology 12(2):97-105"],"references":["289151844_The_importance_of_interaction_in_web-based_education_A_program-level_case_study_of_online_MBA_courses","263162138_Student_interactions_in_online_discussion_forum_empirical_research_from_'Media_Richness_Theory'_perspective","242682355_Online_community_of_inquiry_review_Social_cognitive_and_teaching_presence_issues","242077170_Socialization_in_the_Online_Classroom","238348806_The_Role_of_the_Online_InstructorFacilitator","237117735_Assessing_Social_Presence_In_Asynchronous_Text-based_Computer_Conferencing","331900408_CULTIVATING_VOLUNTARY_ONLINE_LEARNING_COMMUNITIES_IN_BLENDED_ENVIRONMENTS","262007813_Grounded_Theory_Methodology_An_Overview_Handbook_of_Qualitative_Research","242584812_MY_three_principles_of_effective_online_pedagogy","240729770_Communication_dynamics_Discussion_boards_weblogs_and_the_development_of_communities_of_inquiry_in_online_learning_environments"]}