{"id":"270552720_Matrix_Genetics_and_Algebraic_Properties_of_the_Multi-Level_System_of_Genetic_Alphabets","abstract":"The article is devoted to algebraic properties of the multi-level system of moleculargenetic alphabets. It leads to help solve the problem of algebraic unity of inherited information systems in living matter. These algebraic properties are revealed by means of Kronecker families of matrix forms of a presentation of molecular-genetic alphabets. A family of genetic (8x8)-matrices shows unexpected connections of the genetic system with Rademacher and Walsh functions and with special Hadamard matrices which are well-known in theory of noise-immunity coding and digital communication. Decompositions of such genetic (8x8)-matrices on the basis of the known principle of dyadic-shifts lead to sets of 8 sparse matrices. Each of these sets is closed in relation to multiplication and defines a special algebra of 8-dimensional hypercomplex numbers. Mathematical aspects of these 8-dimensional algebras are presented in connection with metric vector spaces, the sequency theory by Harmuth and some methods of spectral analysis. The diversity of known dialects of the genetic code can be analyzed from the viewpoint of these algebras. Our results are discussed taking into account the important role of dyadic shifts, hypercomplex numbers and Hadamard matrices in mathematics, informatics, theoretical physics, etc. These results testify that living matter has a profound algebraic essence which is interconnected with 8-dimensional vector spaces. In our opinion these results lead to a new way of knowledge of living matter in the field of algebraic biology and its mathematical modeling. The idea of a biological meaning of Kronecker multiplication of matrices is based on the structure of Punnett squares in the field of Mendelian genetics. The author believes that the Mendelian laws of independent inheritance of traits have revealed just the tip of an algebraic iceberg of informational structure of living matter and that matrix genetics has contributed to the next steps to disclose this important iceberg.","authors":["Sergey Petoukhov"],"meta":["December 2011NeuroQuantology 9(4)","DOI:10.14704/nq.2011.9.4.501"],"references":["261402069_Recursive_Genome_Function_of_the_Cerebellum_Geometric_Unification_of_Neuroscience_and_Genomics","344120295_Symmetrical_Analysis_Techniques_for_Genetic_Systems_and_Bioinformatics_Advanced_Patterns_and_Applications","324353844_Finite-Dimensional_Vector_Spaces","315384520_Division_algebras_octonions_quaternions_complex_numbers_and_the_algebraic_design_of_physics","313521001_Metallic_phase_with_long-range_orientation_order_and_no_translational_symmetry","270314048_Introduction_to_Matrix_Analysis","268651815_Transmission_of_Information_by_Orthogonal_Functions","267003196_Mathematics_of_Bioinformatics_Theory_Practice_and_Applications","265668031_Digital_Communications_Fundamentals_and_Applications","260470750_Fast_Algorithms_for_Digital_Signal_Processing"]}