{"id":"270658266_A_unified_machine_learning_method_for_task-related_and_resting_state_fMRI_data_analysis","abstract":"Functional magnetic resonance imaging (fMRI) aims to localize task-related brain activation or resting-state functional connectivity. Most existing fMRI data analysis techniques rely on fixed thresholds to identify active voxels under a task condition or functionally connected voxels in the resting state. Due to fMRI non-stationarity, a fixed threshold cannot adapt to intra- and inter-subject variation and provide a reliable mapping of brain function. In this work, a machine learning method is proposed for a unified analysis of both task-related and resting state fMRI data. Specifically, the mapping of brain function in a task condition or resting state is formulated as an outlier detection process. Support vector machines are used to provide an initial mapping and refine mapping results. The method does not require a fixed threshold for the final decision, and can adapt to fMRI non-stationarity. The proposed method was evaluated using experimental data acquired from multiple human subjects. The results indicate that the proposed method can provide reliable mapping of brain function, and is applicable to various quantitative fMRI studies.","authors":["Xiaomu Song","Nan-Kuei Chen"],"meta":["August 2014","DOI:10.1109/EMBC.2014.6945099","SourcePubMed"],"references":["220654479_Nearest_Neighbour_Editing_and_Condensing_Tools-Synergy_Exploitation","220499623_Estimating_Support_of_a_High-Dimensional_Distribution","215597163_Behavioral_Interpretations_of_Intrinsic_Connectivity_Networks","26684397_Correspondence_of_the_brain_functional_architecture_during_activation_and_rest","239546749_Statistical_Learning_Theory","227725220_Statistical_Parametric_Maps_in_Functional_Imaging_A_General_Linear_Approach","221127060_Spatiotemporal_Denoising_and_Clustering_of_fMRI_Data","220694713_Statistical_Learning_Theory","203918300_Smola_A_Learning_with_Kernels_-_Support_Vector_Machines_Regularization_Optimization_and_Beyond_MIT_Press_Cambridge_MA","24256172_Unsupervised_Spatiotemporal_fMRI_Data_Analysis_using_Support_Vector_Machines"]}