{"id":"270665101_Secure_semantic_expansion_based_search_over_encrypted_cloud_data_supporting_similarity_ranking","abstract":"With the advent of cloud computing, more and more information data are outsourced to the public cloud for economic savings and ease of access. However, the privacy information has to be encrypted to guarantee the security. To implement efficient data utilization, search over encrypted cloud data has been a great challenge. The existing solutions depended entirely on the submitted query keyword and didn’t consider the semantics of keyword. Thus the search schemes are not intelligent and also omit some semantically related documents. In view of the deficiency, as an attempt, we propose a semantic expansion based similar search solution over encrypted cloud data. Our solution could return not only the exactly matched files, but also the files including the terms semantically related to the query keyword. In the proposed scheme, a corresponding file metadata is constructed for each file. Then both the encrypted metadata set and file collection are uploaded to the cloud server. With the metadata set, the cloud server builds the inverted index and constructs semantic relationship library (SRL) for the keywords set. After receiving a query request, the cloud server first finds out the keywords that are semantically related to the query keyword according to SRL. Then both the query keyword and the extensional words are used to retrieve the files. The result files are returned in order according to the total relevance score. Eventually, detailed security analysis shows that our solution is privacy-preserving and secure under the previous searchable symmetric encryption (SSE) security definition. Experimental evaluation demonstrates the efficiency and effectives of the scheme.","authors":["Zhihua Xia","Yanling Zhu","Sun Xingming","Lihong Chen"],"meta":["July 2014Journal of Cloud Computing 3(1):8","DOI:10.1186/s13677-014-0008-2"],"references":["235766214_Query_Expansion_Using_Term_Distribution_and_Term_Association","306218220_Modern_information_retrieval_A_brief_overview_IEEE_Data_Eng","292766142_Modern_Information_Retrieval_A_Brief_Overview","269197029_Practical_Dynamic_Searchable_Encryption_with_Small_Leakage","262325511_Approximate_Keyword-based_Search_over_Encrypted_Cloud_Data","261094231_A_Fast_Privacy-Preserving_Multi-keyword_Search_Scheme_on_Cloud_Data","257884648_Embedding_edit_distance_to_enable_private_keyword_search","254032015_Achieving_usable_and_privacy-assured_similarity_search_over_outsourced_cloud_dataC_INFOCOM","252052037_Full_keyword_search_on_encrypted_cloud_storage_data_with_small_index","229593960_Word-Word_Associations_in_Document_Retrieval_Systems","225346616_Public_Key_Encryption_with_Keyword_Search","225135218_Ontology-Based_Spatial_Query_Expansion_in_Information_Retrieval","229034337_Enabling_Secure_and_Efficient_Ranked_Keyword_Search_over_Outsourced_Cloud_Data","224137113_Fuzzy_Keyword_Search_over_Encrypted_Data_in_Cloud_Computing","223195212_Integration_of_association_rules_and_ontologies_for_semantic_query_expansion"]}