{"id":"270662033_Forced-choice_decision-making_in_modified_trolley_dilemma_situations_A_virtual_reality_and_eye_tracking_study","abstract":"Based on the frameworks of dual-process theories, we examined the interplay between intuitive and controlled cognitive processes related to moral and social judgments. In a virtual reality (VR) setting we performed an experiment investigating the progression from fast, automatic decisions towards more controlled decisions over multiple trials in the context of a sacrificing scenario. We repeatedly exposed participants to a modified ten-to-one version and to three one-to-one versions of the trolley dilemma in VR and varied avatar properties, such as their gender and ethnicity, and their orientation in space. We also investigated the influence of arousing music on decisions. Our experiment replicated the behavioral pattern observed in studies using text versions of the trolley dilemma, thereby validating the use of virtual environments in research on moral judgments. Additionally, we found a general tendency towards sacrificing male individuals which correlated with socially desirable responding. As indicated by differences in response times, the ten-to-one version of the trolley dilemma seems to be faster to decide than decisions requiring comparisons based on specific avatar properties as a result of differing moral content. Building upon research on music-based emotion induction, we used music to induce emotional arousal on a physiological level as measured by pupil diameter. We found a specific temporal signature displaying a peak in arousal around the moment of decision. This signature occurs independently of the overall arousal level. Furthermore, we found context-dependent gaze durations during sacrificing decisions, leading participants to look prolonged at their victim if they had to choose between avatars differing in gender. Our study confirmed that moral decisions can be explained within the framework of dual-process theories and shows that pupillometric measurements are a promising tool for investigating affective responses in dilemma situations.","authors":["Alexander Skulmowski","Andreas Bunge","Kai Kaspar","Gordon Pipa"],"meta":["December 2014Frontiers in Behavioral Neuroscience 8:426","DOI:10.3389/fnbeh.2014.00426","SourcePubMed"],"references":["284565272_Implicit_and_explicit_measures_of_attitudes_The_perspective_of_the_MODE_model","264951591_A_method_for_generating_an_illusion_of_backwards_time_travel_using_immersive_virtual_reality_-_an_exploratory_study","262291337_Confronting_a_Moral_Dilemma_in_Virtual_Reality_A_Pilot_Study","259446524_Affective_basis_of_judgment-behavior_discrepancy_in_virtual_experience_of_moral_dilemmas","325671748_The_emotional_dog_and_its_rational_tail_A_social_intuitionist_approach_to_moral_judgment","312630341_The_secret_joke_of_Kant's_Soul","304985415_Descriptive_and_Pragmatic_Levels_of_Empirical_Ethics_Utilizing_the_Situated_Character_of_Moral_Concepts_Judgment_and_Decision-Making","284969177_The_secret_joke_of_Kant's_soul","283089153_On_The_Nature_of_Prejudice_Automatic_and_Controlled_Processes","274411823_The_Trolley_Problem"]}