{"id":"270651624_Finding_long_chains_in_kidney_exchange_using_the_traveling_salesman_problem","abstract":"As of May 2014 there were more than 100,000 patients on the waiting list for a kidney transplant from a deceased donor. Although the preferred treatment is a kidney transplant, every year there are fewer donors than new patients, so the wait for a transplant continues to grow. To address this shortage, kidney paired donation (KPD) programs allow patients with living but biologically incompatible donors to exchange donors through cycles or chains initiated by altruistic (nondirected) donors, thereby increasing the supply of kidneys in the system. In many KPD programs a centralized algorithm determines which exchanges will take place to maximize the total number of transplants performed. This optimization problem has proven challenging both in theory, because it is NP-hard, and in practice, because the algorithms previously used were unable to optimally search over all long chains. We give two new algorithms that use integer programming to optimally solve this problem, one of which is inspired by the techniques used to solve the traveling salesman problem. These algorithms provide the tools needed to find optimal solutions in practice.","authors":["Ross Anderson","Itai Ashlagi","David Gamarnik","Alvin E Roth"],"meta":["January 2015Proceedings of the National Academy of Sciences 112(3)","DOI:10.1073/pnas.1421853112","SourcePubMed"],"references":["254435287_The_Need_for_long_Chains_in_Kidney_Exchange","227143989_On_the_complexity_of_approximating_k-Set_Packing","270991902_New_insights_on_integer-programming_models_for_the_kidney_exchange_problem","269050552_Failure-aware_kidney_exchange","262317710_Failure-aware_kidney_exchange","262254364_Paired_and_Altruistic_Kidney_Donation_in_the_UK_Algorithms_and_Experimentation","262165202_Optimizing_kidney_exchange_with_transplant_chains_Theory_and_reality","249961091_Kidney_Exchange","225198415_On_the_fractional_matching_polytope_of_a_hypergraph","224866431_Graph-Based_Optimization_Algorithm_and_Software_on_Kidney_Exchanges"]}