{"id":"270608176_A_Comparative_Study_on_Fingerprint_Matching_Algorithms_for_EVM","abstract":"In biometric system, the fingerprint recognition has been researched for the long period of time and it has shown the most promising future in the real world application. However, because of the complex distortions among the different impression of the same finger in real life, fingerprint recognition is still a challenging problem. Matching two fingerprints can be unsuccessful due to various reasons and also depends upon the method that is being used for matching. Electronic Voting Machine (EVM) is a simple electronic device used to record votes in place of ballot papers and boxes which were used earlier in conventional voting system. Because biometric identifiers cannot be easily misplaced, forged, or shared, they are considered more reliable for person recognition than traditional token or knowledge based methods. In this paper, the authors are interested to compare three fingerprint matching algorithms by conducting the election using novel EVM. Based on the election result in terms of matching accuracy, time taken for matching, the best algorithm is found for novel EVM. The three matching techniques are direct matching, minutiae matching and matching based on Ratios of distance. We conducted the evaluation on the FVC-2000 datasets and the results were observed by conducting election with the help of these matching techniques and the best matching technique is found for novel EVM.","authors":["Ashok Kumar D","UMMAL SARIBA BEGUM T"],"meta":["January 2013Journal of Computer Sciences and Applications 1(4):55-60","DOI:10.12691/jcsa-1-4-1"],"references":["277551338_A_Novel_design_of_Electronic_Voting_System_Using_Fingerprint","267235287_ANALYSIS_OF_ELECTRONIC_VOTING_SYSTEM_IN_VARIOUS_COUNTRIES","221383443_K-plet_and_Coupled_BFS_A_Graph_Based_Fingerprint_Representation_and_Matching_Algorithm","5597678_Filterbank-based_fingerprint_matching_IEEE_Trans_Image_Process","3974245_Integrating_local_and_global_features_in_automatic_fingerprint_verification","282386866_SIMILARITY_MEASURE_BETWEEN_ATTRIBUTED_RELATIONAL_GRAPHS_FOR_IMAGE_ANALYSIS","239646973_Electronic_vote_tabulation_checks_balances","223202469_Automated_fingerprint_recognition_using_structural_matching","220929730_Fingerprint_Minutiae_Matching_Based_on_the_Local_and_Global_Structures","220742467_Fingerprint_Matching_by_Genetic_Algorithms","3919937_Fingerprint_Matching_Using_Minutiae_And_Texture_Features","3883540_Robust_fingerprint_authentication_using_local_structural_similarity","3748981_A_fingerprint_classification_technique_using_directional_images","3940640_On_the_individuality_fingerprints","3894939_Curvature-based_matching_approach_for_automatic_fingerprint_identification"]}