{"id":"270763507_Unimodular_lattice_triangulations_as_small-world_and_scale-free_random_graphs","abstract":"Real-world networks, e.g., the social relations or world-wide-web graphs, exhibit both small-world and scale-free behaviour.Weinterpret lattice triangulations as planar graphs by identifying triangulation vertices with graph nodes and one-dimensional simplices with edges. Since these triangulations\nare ergodic with respect to a certain Pachner flip, applying different Monte Carlo simulations enables us to calculate average properties of random triangulations, as well as canonical ensemble averages,using an energy functional that is approximately the variance of the degree distribution. All considered triangulations have clustering coefficients comparable with real-world graphs; for the canonical ensemble there are inverse temperatures with small shortest path length independent of system size.\nTuning the inverse temperature to a quasi-critical value leads to an indication of scale-free behaviour for degrees k ⩾ 5.Using triangulations as a randomgraphmodel can improve the understanding of real-world networks, especially if the actual distance of the embedded nodes becomes important.","authors":["Benedikt Krüger","Ella Schmidt","Klaus Mecke"],"meta":["January 2015New Journal of Physics 17(2)","DOI:10.1088/1367-2630/17/2/023013","SourcearXiv"],"references":["235737415_On_the_properties_of_small-world_network_models","233281516_Random_Lattice_Triangulations_Structure_and_Algorithms","232904094_Analyzing_and_Modeling_Real-World_Phenomena_with_Complex_Networks_A_Survey_of_Applications","232714777_Exploring_complex_networks_via_topological_embedding_on_surfaces","313609388_On_the_evolution_of_random_graphs","309108677_Calculation_of_equations_of_state_by_fast_computing_machines","301233132_Renormalization_group_analysis_of_the_small-world_network_model","279432589_Quantum_Gravity","265436879_Konstruktionsmethoden_und_das_kombinatorische_Homoomorphieproblem_fur_Triangulationen_kompakter_semilinearer_Mannigfaltigkeiten","264920260_Networks_An_Introduction"]}