{"id":"270758389_Evaluer_un_dispositif_sectoriel_d'aide_a_l'emploi_l'exemple_des_hotels-cafes-restaurants","abstract":"An Evaluation of Sector-Specific payroll Tax Cuts : The Case of Hotels and Restaurants\nThis paper analyses the impact of government grants introduced in August 2004 in the French sector hotels and restaurants. This program is based on payroll tax reductions and covers the period 2004-2009. The amount of the payroll tax reductions varied according the subsector, the wage and firm tenure. To evaluate the effects on job creation and job destruction we used several quasi-exhaustive administrative sources containing the plants complete grant and employment history. By using a semi-aggregated balanced sample, to include entry and exit of firms, we compare the change in outcomes for the targeted firms to the changes in firms operating in the similar industries. These industries are retail trade (except retail sale of pharmaceutical, medical, electronic and computer goods, doorstep and mail sale, supermarkets) and personal services (except sporting, recreational and cultural activities). We consider a panel Tobit model with unobserved heterogeneity. Our findings suggest that the HCR subsidy program did lead to significant and small employment effect (7,500 jobs by year). However, the cost of the actual job creation was quite huge (€80,000 per job). We also find differences in the employment response to subsidies between subsectors. Therefore, a different targeting of the aid could have been more effective.","authors":["Mathieu Bunel"],"meta":["January 2013Revue Française D Économie 28(1):73 - 121","DOI:10.3917/rfe.131.0073"],"references":["251060756_A_qui_profiterait_une_baisse_de_la_TVA_dans_la_restauration","46522107_Zones_Franches_Urbaines_Quels_effets_sur_l'emploi_salarie_et_les_creations_d'etablissements","309476266_Matching_as_an_econometric_valuation_estimator","250185730_Sample_Size_Estimation_for_Longitudinal_Designs_with_Attrition_Comparing_Time-Related_Contrasts_Between_Two_Groups","222514244_Interaction_Terms_In_Logit_And_Probit_Models","46565514_Processus_de_detection_et_evaluation_de_la_fraude_sociale","46552477_Limited_Dependent_Variable_Models_Using_Panel_Data","46521849_Flux_d'emploi_et_de_main-d'oeuvre_en_France_Un_reexamen","46521335_Les_rallocations_d'emplois_en_France_sont-elles_en_phase_avec_le_cycle","46515806_De_l'impact_sectoriel_a_l'effet_macro-economique_des_allegements_de_cotisations_sociales"]}