{"id":"270774954_Investigation_on_the_Effort_Transmission_in_Planar_Parallel_Manipulators","abstract":"In the design of a mechanism, the quality of effort transmission is a key issue. Traditionally, the effort transmissivity of a mechanism is defined as the quantitative measure of the power flowing effectiveness from the input link(s) to the output link(s). Many researchers have focused their work on the study of the effort transmission in mechanisms and diverse indices have been defined. However, the developed indices have exclusively dealt with the studies of the ratio between the input and output powers and they do not seem to have been devoted to the studies of the admissible reactions in passive joints. However, the observations show that it is possible for a mechanism to reach positions in which the transmission indices will have admissible values but the reaction(s) in passive joint(s) can reach excessively high values leading to the breakdown of the mechanism. In the present paper, a method is developed to ensure the admissible values of reactions in passive joints of planar parallel manipulators. It is shown that the increase of reactions in passive joints of a planar parallel manipulator depends not only on the transmission angle but also on the position of the instantaneous center of rotation of the platform. It allows the determination of the maximal reachable workspace of planar parallel manipulators taking into account the admissible reactions in its passive joints. The suggested method is illustrated via a 5R planar parallel mechanism and a planar 3-RPR parallel manipulator.","authors":["Sébastien Briot","Vi Ar Glasunov","Vigen Arakelyan Arakelian"],"meta":["February 2013Journal of Mechanisms and Robotics 5(1):011011","DOI:10.1115/1.4023325"],"references":["274875021_A_New_Approach_for_Singularity_Analysis_and_Closeness_Measurement_to_Singularities_of_Parallel_Manipulators","267682798_Design_and_Multi-Objective_Optimization_of_a_Linkage_for_a_Haptic_Interface","267622346_Consistent_Kinetostatic_Indices_for_Planar_3-DOF_Parallel_Manipulators_Application_to_the_Optimal_Kinematic_Inversion","258846558_Jacobian_Manipulability_Condition_Number_and_Accuracy_of_Parallel_Robots","258819938_Development_of_a_Five-Bar_Parallel_Robot_With_Large_Workspace","275423541_A_Transmission_Index_for_Spatial_Mechanisms","269462912_Kinematic_and_Static_Characteristics_of_In-Parallel_Actuated_Manipulators_at_Singular_Points_and_in_Their_Neighborhood","269462911_Motion_Transmissibility_of_In-Parallel_Actuated_Manipulators","269462898_Motion_Transmissibility_in_Parallel_Manipulators","266414600_Standardization_of_terminology_for_the_mechanism_and_machine_science"]}