{"id":"270847103_Impact_of_Management_Information_Systems_MIS_on_School_Administration_What_the_Literature_Says","abstract":"In the initial stages of its development, management information systems (MIS) main purpose and usage was to improve the efficiency of school office activities. It was used to store student and personnel data. The most concern was being focused on data entry and collation, rather than upon data transfer or analysis. The value of management information was recognized during its integration stages. Overall review of literature highlighted positive impact of MIS on school administration and management including better accessibility to information, more efficient administration, higher utilization of school resources, reduction in workload, better time management, and improvement in the quality of reports. A number of inhibitors to MIS use are evident in the literature; foremost among these are lack of time, lack of confidence or skills, lack of training, lack of senior management support, and lack of technical support. MIS can provide administrators and teachers with the information required for informed planning, policy-making, and evaluation. MIS have changed school management in the areas of leadership, decision making, workload, human resource management, communication, responsibility, and planning. These systems can assist the school manager in determining the aims of the school, formulating strategic plans, distributing resources, and evaluating staff performance as well as organizational success. (C) 2013 The Authors. Published by Elsevier Ltd.","authors":["Madiha Shah"],"meta":["February 2014Procedia - Social and Behavioral Sciences 116:2799-2804","DOI:10.1016/j.sbspro.2014.01.659"],"references":["277860037_ImpacCT2_The_Impact_of_Information_and_Communication_Technologies_on_Pupil_Learning_and_Attainment","255566860_Creating_a_Community_of_Technology_Users_Students_Become_Technology_Experts_for_Teachers_and_Peers","237651299_ICT_and_School_Management_A_Review_of_Selected_Literature","347494204_Developing_the_ICT_Capable_School","304259909_Perspectives_for_school_information_systems","288069370_A_Fundamental_Methodology_for_Designing_Management_Information_Systems_for_Schools","288066934_A_Case_Study_of_the_Impact_of_School_Administration_Computerization_on_the_Department_Head's_Role","262330604_Maximizing_the_potential_of_information_for_management_strategies_for_interfacing_the_technical_core_of_education","255628000_The_impact_of_ICT_in_schools_-_a_landscape_review","239061052_The_Internet_Galaxy-Reflections_on_the_Internet_Business_and_Society"]}