{"id":"270851624_A_Game-based_learning_system_for_improving_student's_learning_effectiveness_in_system_analysis_course","abstract":"This paper practically develops a game-based learning system to improve self-efficacy for student's learning. The game-based learning is combined with educational and information technology. From the e-learning carried on, the game-based learning is getting more attention. In game-based learning, the course content is mapped into the game to provide a scenario environment of learning, the repeated self-learning, and the ongoing interaction and feedback can increase the learning interest and motivation. Hence, game-based learning could reach the goal of learning effectively. For evaluating the learning effects, this paper uses 3D game development tools and the course content corresponding to the game level content. In the questionnaire, the questionnaire design is based on the ARCS Motivation Model, and the questionnaire items have been revised by the experts' opinions. This quasi-experimental teaching is executed for system analysis course (at third-year undergraduate level), the subjects (students) have an information management background. The students are separated into two groups for quasi-experimental design: one is the experimental group, the other is the control group. After the implementation of game-based learning system, the achievement scores and questionnaire of the experimental group are collected practically, and the difference in learning achievement between the experimental and control groups is examined. The results show that the learning motivations of students have significant impact on the learning achievement, and the learning achievements of students with game-based learning are better than those who use the traditional face-to-face teaching. And the results could provide the related educators as references. (C) 2012 Published by Elsevier Ltd. Selection and/or peer-review under responsibility of Prof. Huseyin Uzunboylu.","authors":["Ching-Hsue Cheng","Chung-Ho Su"],"meta":["December 2012Procedia - Social and Behavioral Sciences 31:669-675","DOI:10.1016/j.sbspro.2011.12.122"],"references":["260649247_To_Game_or_Not_to_Game","313596192_M_Motivational_design_of_instruction","285709477_Analysis_on_absorption_refrigeration_by_using_ionic_liquid_and_carbon_dioxide","285160410_A_Case_for_a_Formal_Design_Paradigm_for_Serious_Games","284025284_Reliability_and_Validity_Assessment","271787795_Digital_Game-Based_Learning","238374519_What_Video_Games_Have_to_Teach_Us_About_Learning_and_Literacy","234791913_Learning_and_motivational_impacts_of_a_multimedia_science_game","234570941_Development_and_Use_of_the_ARCS_Model_of_Motivational_Design","233196580_Learning_from_Video_Games"]}