{"id":"270877878_Fast_and_Robust_Neural_Network_Joint_Models_for_Statistical_Machine_Translation","abstract":"Recent work has shown success in using neural network language models (NNLMs) as features in MT systems. Here, we present a novel formulation for a neural network joint model (NNJM), which augments the NNLM with a source context window. Our model is purely lexicalized and can be integrated into any MT decoder. We also present several variations of the NNJM which provide significant additive improvements. Although the model is quite simple, it yields strong empirical results. On the NIST OpenMT12 Arabic-English condition, the NNJM features produce a gain of +3.0 BLEU on top of a powerful, featurerich baseline which already includes a target-only NNLM. The NNJM features also produce a gain of +6.3 BLEU on top of a simpler baseline equivalent to Chiang's (2007) original Hiero implementation. Additionally, we describe two novel techniques for overcoming the historically high cost of using NNLM-style models in MT decoding. These techniques speed up NNJM computation by a factor of 10,000x, making the model as fast as a standard back-off LM.","authors":["Jacob Devlin","Rabih Zbib","Zhongqiang Huang","Thomas Lamar"],"meta":["June 2014","DOI:10.3115/v1/P14-1129","Conference: Proceedings of the 52nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)"],"references":["290650943_Bilingual_word_embeddings_for_phrase-based_machine_translation","319770436_Efficient_backprop","312369762_Continuous_space_translation_models_with_neural_networks","289690359_Factored_soft_source_syntactic_constraints_for_hierarchical_machine_translation","287008400_An_efficient_language_model_using_double-array_structures","285895924_Linguistic_regularities_in_continuous_space_word_representations","285432248_Decoding_with_large-scale_neural_language_models_improves_translation","283112108_Joint_language_and_translation_modeling_with_recurrent_neural_networks","277186684_Lexical_Features_for_Statistical_Machine_Translation","270878785_Continuous_Space_Translation_Models_for_Phrase-Based_Statistical_Machine_Translation"]}