{"id":"270824859_Tri-Subject_Kinship_Verification_Understanding_the_Core_of_A_Family","abstract":"One major challenge in computer vision is to go beyond the modeling of\nindividual objects and to investigate the bi- (one-versus-one) or tri-\n(one-versus-two) relationship among multiple visual entities, answering such\nquestions as whether a child in a photo belongs to given parents. The\nchild-parents relationship plays a core role in a family and understanding such\nkin relationship would have fundamental impact on the behavior of an artificial\nintelligent agent working in the human world. In this work, we tackle the\nproblem of one-versus-two (tri-subject) kinship verification and our\ncontributions are three folds: 1) a novel relative symmetric bilinear model\n(RSBM) introduced to model the similarity between the child and the parents, by\nincorporating the prior knowledge that a child may resemble a particular parent\nmore than the other; 2) a spatially voted method for feature selection, which\njointly selects the most discriminative features for the child-parents pair,\nwhile taking local spatial information into account; 3) a large scale\ntri-subject kinship database characterized by over 1,000 child-parents\nfamilies. Extensive experiments on KinFaceW, Family101 and our newly released\nkinship database show that the proposed method outperforms several previous\nstate of the art methods, while could also be used to significantly boost the\nperformance of one-versus-one kinship verification when the information about\nboth parents are available.","authors":["Xiaoqian Qin","Xiaoyang Tan","Songcan Chen"],"meta":["January 2015IEEE Transactions on Multimedia 17(10)","DOI:10.1109/TMM.2015.2461462","SourcearXiv"],"references":["286594619_Who_Do_I_Look_Like_Determining_Parent-Offspring_Resemblance_via_Gated_Autoencoders","273958406_The_FG_2015_Kinship_Verification_in_the_Wild_Evaluation","273396997_Social_Image_Analysis_From_a_Non-IID_Perspective","271551078_Like_Father_Like_Son_Facial_Expression_Dynamics_for_Kinship_Verification","292020683_Large_Margin_Multi-metric_Learning_for_Face_and_Kinship_Verification_in_the_Wild","290622129_Centering_SVDD_for_Unsupervised_Feature_Representation_in_Object_Classification","286291201_Identity_and_Kinship_Relations_in_Group_Pictures","274386132_Discriminative_Deep_Metric_Learning_for_Face_Verification_in_the_Wild","271555035_Kinship_classification_by_modeling_facial_feature_heredity","269933006_Prototype-Based_Discriminative_Feature_Learning_for_Kinship_Verification"]}