{"id":"271020414_Blogel_A_Block-Centric_Framework_for_Distributed_Computation_on_Real-World_Graphs","abstract":"The rapid growth in the volume of many real-world graphs (e.g., social networks, web graphs, and spatial networks) has led to the development of various vertex-centric distributed graph computing systems in recent years. However, real-world graphs from different domains have very different characteristics, which often create bottlenecks in vertex-centric parallel graph computation. We identify three such important characteristics from a wide spectrum of real-world graphs, namely (1)skewed degree distribution, (2)large diameter, and (3)(relatively) high density. Among them, only (1) has been studied by existing systems, but many real-world power-law graphs also exhibit the characteristics of~(2) and~(3). In this paper, we propose a block-centric framework, called Blogel, which naturally handles all the three adverse graph characteristics. Blogel programmers may think like a block and develop efficient algorithms for various graph problems. We propose parallel algorithms to partition an arbitrary graph into blocks efficiently, and block-centric programs are then run over these blocks. Our experiments on large real-world graphs verified that Blogel is able to achieve orders of magnitude performance improvements over the state-of-the-art distributed graph computing systems.","authors":["Da Yan","James Cheng","Yi Lu","Wee Keong Ng"],"meta":["October 2014Proceedings of the VLDB Endowment 7(14)","Conference: Proceedings of the VLDB EndowmentVolume: 7"],"references":["271020290_Pregel_Algorithms_for_Graph_Connectivity_Problems_with_Performance_Guarantees","262373805_Fast_Iterative_Graph_Computation_with_Block_Updates","262240253_Mizan_A_system_for_dynamic_load_balancing_in_large-scale_graph_processing","259384818_From_Think_Like_a_Vertex_to_Think_Like_a_Graph","301233247_Network_structure_and_minimum_degree","280692862_The_graph_Voronoi_diagram_with_applications","262392280_PowerGraph_Distributed_graph-parallel_computation_on_natural_graphs","262369784_GPS_a_graph_processing_system","254006796_Efficient_processing_of_distance_queries_in_large_graphs_A_vertex_cover_approach","242638896_Bounds_on_Multiprocessing_Timing_Anomalies"]}