{"id":"271198648_Mathematical_Modeling_and_Simulation_of_Photovoltaic_Cell_using_Matlab-Simulink_Environment","abstract":"Photovoltaic power supplied to the utility grid is gaining more and more visibility while the world's powers demand is increases. Growing demand, advancements in semiconductor technology and magnetic materials such as high frequency inductor cores, has a significant impact on PV inverter topologies and their efficiencies, on the improvement of the control circuits on the potential of costs reduction. The user naturally wants to operate the Photovoltaic (PV) array at its highest energy conversion output by continuously utilizing the maximum available solar power of the array. The electrical system PV modules are powered by solar arrays requires special design considerations due to varying nature of the solar power generated resulting from unpredictable and sudden changes in weather conditions which change the solar irradiation level as well as the cell operating temperature. This paper, a mathematical model of a Photovoltaic (PV) cell used matlab-simulink environment, is developed and presented. The model is developed using basic circuit equations of the photovoltaic solar cells including the effects of solar irradiation and temperature changes. The main objective is to find the parameters of the nonlinear I–V equation by adjusting the curve at three points: open circuit, maximum power, and short circuit. the method finds the best I–V equation for the single-diode photovoltaic (PV) model including the effect of the series and parallel resistances Keyword: Mathematical Modeling Photovoltaic System Maximum Power PV Array 1. INTRODUCTION A photovoltaic system converts sunlight into electricity. The basic device of a photovoltaic system is the photovoltaic cell. Cells may be grouped to form panels or modules. Panels can be grouped to form large photovoltaic arrays. The term array is usually employed to describe a photovoltaic panel (with several cells connected in series and/or parallel) or a group of panels. Most of time one are interested in modeling photovoltaic panels, which are the commercial photovoltaic devices. This paper focuses on modeling photovoltaic modules or panels composed of several basic cells. The term array used henceforth means any photovoltaic device composed of several basic cells. In the Appendix at the end of this paper there are some explanations about how to model and simulate large photovoltaic arrays composed of several panels connected in series or in parallel. All though solar cells prices were very expensive at the beginning, they become cheaper during last decade due to developing manufacturing processes, so that it is expected that the electricity from PV arrays will be able to compete with the conventional ones by the next decade. Since a PV array is an expensive system to build, and the cost of electricity from the utility grid, the user of such an expensive system","authors":["J Hemanth Kumar","Sai Babu Ch"],"meta":["March 2012International Journal of Electrical and Computer Engineering 2(1):26-34","DOI:10.11591/ijece.v2i1.117"],"references":["4261271_A_Photovoltaic_Array_Simulation_Model_for_Matlab-Simulink_GUI_Environment","3763674_Multilevel_converters_for_single-phase_grid_connected_photovoltaic_systems_An_overview","313578513_String_and_module_integrated_inverters_for_single-phase_grid_connected_photovoltaic_systems_a_review","3870847_A_transformerless_five_level_cascaded_inverter_based_single_phase_photovoltaic_system","3731594_A_multilevel_PWM_inverter_topology_for_photovoltaic_applications","3220027_Multilevel_Inverter_Topologies_for_Stand-Alone_PV_Systems","3172011_A_Review_of_Single-Phase_Grid-Connected_Inverters_for_Photovoltaic_Modules","3171959_Multilevel_DC-Link_Inverter"]}