{"id":"271140048_Broadband_Photodetector_Based_on_Graphene-Bi2Te3_Heterostructure","abstract":"Recently, research on graphene based photodetectors has drawn substantial attention due to ultrafast and broadband photoresponse of graphene. However, they usually have low responsivity and low photoconductive gain induced by the gapless nature of graphene, which greatly limit their applications. The synergetic integration of graphene with other two-dimensional (2D) materials to form van der Waal's heterostructure is a very promising approach to overcome these shortcomings. Here we report the growth of graphene-Bi2Te3 heterostructure where Bi2Te3 is a small bandgap material from topological insulator family with a similar hexagonal symmetry to graphene. Because of the effective photo-carrier generation and transfer at the interface between graphene and Bi2Te3, the device photocurrent can be effectively enhanced without sacrificing the detecting spectral width. Our results show that the graphene-Bi2Te3 photodetector has much higher photoresponsivity (35 AW-1 at a wavelength of 532 nm) and higher sensitivity (photoconductive gain up to 83), as compared to the pure monolayer graphene-based devices. More interestingly, the detection wavelength range of our device is further expanded to near-infrared (980 nm) and telecommunication band (1550 nm), which is not observed on the devices based on heterostructures of graphene and transition metal dichalcogenides.","authors":["Hong Qiao","Jian Yuan","Zai-Quan Xu","Caiyun Chen"],"meta":["January 2015ACS Nano 9(2)","DOI:10.1021/nn506920z","SourcePubMed"],"references":["259876692_Ultrahigh-Gain_Photodetectors_Based_on_Atomically_Thin_Graphene-MoS2_Heterostructures","258060923_Graphene-MoS_2_hybrid_structures_for_multifunctional_photoresponsive_memory_devices","257866379_Ahluwalia_PK_Electronic_structure_of_transition_metal_dichalcogenides_monolayers_1H-MX2_M_Mo_W_X_S_Se_Te_from_ab_initio_theory_new_direct_band_gap_semiconductors_Electronic_structure_of_transition_met","255749742_Fast-Speed_and_High-Gain_Photodetectors_of_Individual_Single_Crystalline_Zn3P2_Nanowires","311652861_Giant_Intrinsic_Carrier_Mobilities_in_Graphene_and_Its_Bilayer","271208557_Few-Layer_Nanoplates_of_Bi2Se3_and_Bi2Te3_with_Highly_Tunable_Chemical_Potential","260633195_Topological_insulator_nanostructures_and_devices","259672644_Detection_of_Individual_Gas_Molecules_Absorbed_on_Graphene","258102807_Highly_efficient_gate-tunable_photocurrent_generation_in_vertical_heterostructures_of_layered_materials","257866572_Collective_transport_of_coupled_particles"]}