{"id":"271124992_Tensions_in_higher_education_Widening_participation_student_diversity_and_the_challenge_of_academic_languageliteracy","abstract":"Widening participation is implicitly associated with increased diversity in student populations because of the emphasis on segments of society traditionally under-represented in higher education. While this is worthy from a social justice perspective, it brings the potential for numerous\ntensions, one of which concerns language and literacy skills and the supports institutions need to provide if they are to ensure that students within ‘non-traditional’ cohorts are not incorrectly labelled as ‘lacking academic quality’. Traditionally, such supports have\nlargely focused on those from non-English speaking backgrounds, despite the fact that a proportion of native-speaker students exhibit language that does not align with the academy's expectations. Admitting students from non-traditional backgrounds (the majority of whom are native speakers)\nwithout providing measures to support their particular needs adequately, can be both short-sighted and counter to equity principles. This paper discusses assessment mechanisms for identifying students most at risk due to weaknesses in language and academic literacy and considers aspects of\nprofessional development that help to ensure that academic staff are equipped to understand, and be empathetic towards, the distinctive needs of this cohort, as well as having the wherewithal to identify language/literacy related problems and to intervene appropriately, where necessary.","authors":["Christopher M. Klinger","Neil Murray"],"meta":["June 2012Widening Participation and Lifelong Learning 14(1):27-44","DOI:10.5456/WPLL.14.1.27"],"references":["229628531_A_Framework_for_Transition_Supporting_'Learning_to_Learn'_in_Higher_Education","225120722_Is_That_Paper_Really_Due_Today_Differences_in_First-Generation_and_Traditional_College_Students'_Understanding_of_Faculty_Expectations","227994016_Increasing_or_Widening_Participation_in_Higher_Education_A_European_Overview","3230348_The_Effects_of_Tutor_Expertise_in_Engineering_Writing_A_Linguistic_Analysis_of_Writing_Tutors'_Comments"]}