{"id":"271159062_Instrucao_pelos_colegas_e_ensino_sob_medida_uma_proposta_para_o_engajamento_dos_alunos_no_processo_de_ensino-aprendizagem_de_Fisica","abstract":"http://dx.doi.org/10.5007/2175-7941.2013v30n2p362\n\nMelhorar a formação profissional e acadêmica dos indivíduos nos mais diversos níveis, passa por repensar o papel das estratégias formais de ensino. Em termos educacionais, pesquisa após pesquisa tem mostrado os problemas de se investir quase exclusivamente na apresentação oral dos conteúdos como estratégia didática. Seja por falta de infraestrutura para implementar novas soluções, inércia do sistema escolar ou mesmo desconhecimento de alternativas viáveis de mudança, essa estratégia quase milenar ainda hoje é onipresente no ambiente escolar. Em sua face mais visível, o chamado ensino tradicional está fortemente associado com a evasão escolar, a aprendizagem mecânica e a desmotivação para aprender, por parte dos estudantes. Diversas são as recomendações abstratas e gerais de cunho pedagógico feitas aos professores para reverter esse quadro. Contudo, poucas são as alternativas concretas apresentadas, em especial no Ensino de Física em nível médio e nas disciplinas básicas de nível superior. Tendo em vista esse cenário, o presente artigo tem como objetivos divulgar as potencialidades do uso combinado de dois métodos de ensino, focados na aprendizagem significativa de conceitos e procedimentos; e também fornecer conselhos práticos para favorecer a implementação deles em sala de aula.","authors":["Ives Solano Araujo","Eric Mazur"],"meta":["August 2013Caderno Brasileiro de Ensino de Física 30(2)","DOI:10.5007/2175-7941.2013v30n2p362"],"references":["313333022_Engajamento_interativo_no_curso_de_Fisica_I_da_UFJF","273208426_Implementacao_do_metodo_de_ensino_Peer_Instruction_com_o_auxilio_dos_computadores_do_projeto_UCA_em_aulas_de_Fisica_do_Ensino_Medio","260772833_The_effect_of_formative_assessment_in_Brazilian_university_physics_courses","243491495_Comparing_problem_solving_performance_of_physics_students_in_inquiry-based_and_traditional_introductory_physics_courses","270938839_Using_Peer_Instruction_to_Teach_Philosophy_Logic_and_Critical_Thinking","259324211_Peer_Instruction_in_the_General_Chemistry_Laboratory_Assessment_of_Student_Learning","253809090_Peer_Instruction_Results_from_a_Range_of_Classrooms","247744193_The_Acquisition_and_Retention_of_Knowledge_A_Cognitive_View","247126331_Peer_Instruction_A_User's_Manual","242628031_Just-In-Time_Teaching_Blending_Active_Learning_with_Web_Technology"]}