{"id":"271135270_Towards_a_Meta-Language_for_the_Concurrency_Concern_in_DSLs","abstract":"Concurrency is of primary interest in the development of complex software-intensive systems, as well as the deployment on modern platforms. Furthermore, Domain-Specific Languages (DSLs) are increasingly used in industrial processes to separate and abstract the various concerns of complex systems.However, reifying the definition of the DSL concurrency remains a challenge. This not only prevents leveraging the concurrency concern of a particular domain or platform, but it also hinders: a) the development of a complete understanding of the DSL semantics; b) the effectiveness of concurrency-aware analysis techniques; c) the analysis of the deployment on parallel architectures. In this paper, we present MoCCML, a dedicated meta-language for formally specifying the concurrency concern within the definition of a DSL. The concurrency constraints can reflect the knowledge in a particular domain, but also the constraints of a particular platform. MoCCML comes with a complete language workbench to help a DSL designer in the definition of the concurrency directly within the concepts of theDSL itself, and a generic workbench to simulate and analyze any model conforming to this DSL. Mo CCML is illustrated on the definition of an lightweight extension of SDF (Synchronous Data Flow).","authors":["Julien Deantoni","Papa Issa Diallo","Ciprian Teodorov","Joel Champeau"],"meta":["March 2015","DOI:10.7873/DATE.2015.1052","Conference: Design, Automation and Test in Europe Conference and Exhibition (DATE)","Project: GEMOC initiative"],"references":["281159522_ECL_the_Event_Constraint_Language_an_Extension_of_OCL_with_Events","265343249_Operational_Semantics_of_the_Model_of_Concurrency_and_Communication_Language","221223674_ModHel'X_A_Component-Oriented_Approach_to_Multi-Formalism_Modeling","220473431_Taming_Heterogeneity_-_The_Ptolemy_Approach","278797266_Model_Based_Engineering_for_the_support_of_Models_of_Computation_The_Cometa_Approach","264383601_Encyclopedia_of_Computer_Science","262254296_Backus-Naur_form_BNF","245624208_CCS-A_Calculus_for_Communicating_Systems","221554010_Empirical_assessment_of_MDE_in_industry","220690524_Communicating_and_Mobile_Systems_The_p-Calculus"]}