{"id":"271274780_About_some_robustness_and_complexity_properties_of_G-graphs_networks","abstract":"Given a finite group and a set , we consider the different cosets of each cyclic group with . Then the -graph associated with and can be defined as the intersection graph of all these cosets. These graphs were introduced in Bretto and Faisant (2005) as an alternative to Cayley graphs: they still have strong regular properties but a more flexible structure. We investigate here some of their robustness properties (connectivity and vertex/edge-transitivity) recognized as important issues in the domain of network design. In particular, we exhibit some cases where -graphs are optimally connected, i.e. their edge and vertex-connectivity are both equal to the minimum degree. Our main result concerns the case of a -graph associated with an abelian group and its canonical base , which is shown to be optimally connected. We also provide a combinatorial characterization for this class as clique graphs of Cartesian products of complete graphs and we show that it can be recognized in polynomial time. These results motivate future researches in two main directions: revealing new classes of optimally connected -graphs and investigating the complexity of their recognition.","authors":["Jean-François Culus","Marc Demange","Ruxandra Marinescu-Ghemeci","Cerasela Tanasescu"],"meta":["February 2015Discrete Applied Mathematics 182","DOI:10.1016/j.dam.2014.11.003"],"references":["268025287_On_automorphisms_permuting_generators_in_groups_of_rank_two","281504950_Incidence_Graphs_of_Bipartite_G-Graphs","275347337_A_Course_in_the_Theory_of_Groups","268839264_Symmetric_presentations","266721803_A_note_on_orbit_graphs_of_finite_groups_and_colour-clique_graphs_of_Cayley_graphs","266360773_Graph_Theory_and_Its_Application","265781474_Partition_intersection_graphs","265702777_Another_way_for_associating_a_graph_to_a_group","259775361_Symmetric_Presentations_of_Abelian_Groups","248115298_Topics_in_the_Theory_of_Group_Presentations"]}