{"id":"271219036_Practical_quantum_oblivious_transfer_and_bit_commitment_protocols","abstract":"Oblivious transfer (OT) and bit commitment (BC) are two-party cryptographic protocols which play crucial roles in the construction of various cryptographic protocols. We propose three practical quantum cryptographic protocols in this paper. We first construct a practical quantum random oblivious transfer (R-OT) protocol based on the fact that non-orthogonal states cannot be reliably distinguished. Then, we construct a fault-tolerant one-out-of-two oblivious transfer ( O T 1 2 ) protocol based on the quantum R-OT protocol. Afterwards, we propose a quantum bit commitment (QBC) protocol which executes the fault-tolerant O T 1 2 several times. Mayers, Lo and Chau (MLC) no-go theorem proves that QBC protocol cannot be unconditionally secure. However, we find that computing the unitary transformation of no-go theorem attack needs so many resources that it is not realistically implementable. We give a definition of physical security for QBC protocols and prove that the practical QBC we proposed is physically secure and can be implemented in the real world.","authors":["Ya-Qi Song","Li Yang"],"meta":["January 2015Applied Sciences 8(10)","DOI:10.3390/app8101990","SourcearXiv"],"references":["241689195_Bit_commitment_protocol_based_on_random_oblivious_transfer_via_quantum_channel","238961339_Quantum_Oblivious_Transfer","236935660_Dissipation_attack_on_Bennett-Brassard_1984_protocol_in_practical_quantum_key_distribution_system","221499660_A_Quantum_Bit_Commitment_Scheme_Provably_Unbreakable_by_both_Parties","221354779_Practical_Quantum_Oblivious_Transfer","51978664_One-way_information_reconciliation_schemes_of_quantum_key_distribution","13375059_Unambiguous_quantum_measurement_of_nonorthogonal_states","235476842_Oblivious_transfer_using_quantum_entanglement","223151706_How_to_differentiate_between_non-orthogonal_states","222437412_How_to_differentiate_between_non-orthogonal_states"]}