{"id":"271267386_O_Modelo_de_Design_Thinking_como_Indutor_da_Inovacao_nas_Empresas_Um_Estudo_Empirico","abstract":"Atualmente a inovação é um dos principais direcionadores estratégicos das organizações, da mesma forma como ocorreu nas décadas de 1970 e 1980 quando as empresas se dedicaram à qualidade total e nos anos 90 à reengenharia. Para criar liderança sustentável no futuro, a organização deve: mudar de forma fundamental as regras de engajamento em um setor antigo, redefinir as fronteiras entre os setores; e criar outros inteiramente novos. Além disso, a capacidade de previsão de mudanças surge quando os executivos seniores de uma empresa conseguem sentir empatia com as necessidades humanas básicas. É nesse contexto que o Design Thinking (DT) surge como um modelo de inovação com alto potencial de gerar resultados diferenciados para as organizações que buscam a liderança, pois contempla métodos de investigação e de desenvolvimento de soluções altamente focados nos usuários. O objetivo desse estudo é explorar o modelo Design Thinking sob a ótica da gestão estratégica da inovação e aprofundar o conhecimento sobre o tema. Para isso, o estudo contempla pesquisas bibliográficas sobre inovação, design e DT, uma survey com profissionais que possuem experiência na aplicação do modelo e, por último, um estudo de caso de uma empresa brasileira fabricante de computadores. Os resultados obtidos nesse estudo demonstram que a implantação de um modelo sistematizado de DT pelas organizações exige diversas mudanças culturais e processuais. Entretanto, o modelo tem capacidade de gerar resultados bastante positivos no desenvolvimento de soluções inovadoras, pois sustenta-se sobre métodos avançados de entendimento do contexto e de geração de ideias focadas no usuário e em suas necessidades.DOI:10.5585/gep.v2i1.36","authors":["Luiz Alberto Bonini","Roberto Sbragia"],"meta":["October 2011Revista de Gestão e Projetos 2(1)","DOI:10.5585/gep.v2i1.36"],"references":["314480720_The_Design_of_Business_Why_Design_Thinking_Is_the_Next_Competitive_Edge","303784954_Inovacoes_nas_Organizacoes_Empresariais","303753104_Organizacoes_Inovadoras_Estudos_e_Casos_Brasileiros","287333391_Towards_holistic_front_end_in_new_product_development","243774407_Knowledge_and_Organization_A_Social-Practice_Perspective","235700989_Change_by_Design_How_Design_Thinking_Transforms_Organizations_and_Inspires_Innovation","235091699_Unleashing_Design_Planning_and_the_Art_of_Battle_Command","229491185_Towards_Holistic_Front_Ends_In_New_Product_Development","49481888_Capitalismo_Socialismo_y_Democracia"]}