{"id":"271202711_Modeles_et_outils_pour_la_conception_de_jeux_serieux_une_approche_meta-design","abstract":"Cette thèse en informatique se situe dans le domaine des jeux sérieux destinés à l’apprentissage et s’intéresse à leur conception et aux outils auteurs d’adaptation.\nLes jeux sérieux sont des Environnements Informatiques Pour l’Apprentissage Humain dont la conception nécessite la collaboration d’experts variés parmi lesquels les enseignants. \nPour faciliter la conception multi-expertise initiale des jeux sérieux métissant motivation et apprentissage, nous proposons un cadre conceptuel, les 6 facettes de la conception des jeux sérieux, qui aide les parties prenantes à collaborer à chaque étape de conception. Les 6 facettes sont enrichies par la bibliothèque de patrons de conception que nous proposons, et qui construit un vocabulaire favorisant la conception participative.\nPour permettre la co-conception des jeux sérieux dans l’usage par les enseignants, nous avons prolongé l’approche de la conception participative à celle du meta-design. Nous proposons un modèle et un outil auteur permettant aux enseignants d’adapter les jeux sérieux à leurs contextes spécifiques d’enseignement.\nMoPPLiq est un modèle à la fois formel et graphique qui représente la scénarisation des jeux sérieux à étapes, de façon à la rendre compréhensible et manipulable. APPLiq est un outil auteur permettant de manipuler des modèles MoPPLiq, en maintenant leur cohérence grâce à une vérification et une compensation automatique de la planification.\nNos outils conceptuels (6 facettes et patrons de conception) et logiciels (MoPPLiq et APPLiq) ont été mis à l’épreuve lors de travaux de conception de jeux sérieux avec des partenaires publics et privés et avec des jeux sérieux utilisés par des enseignants.\n\nThis thesis in computer science is in the field of Serious Games (SGs) for learning, and focuses on design and authoring tools for adaptation.\nSGs are Technology Enhanced Learning systems whose design requires collaboration of different types of experts among which teachers.\nTo help the initial multi-expertise design of the SGs that mix fun and learning, we propose a conceptual framework named the 6 Facets of the Design of SGs, which helps stakeholders to collaborate at every stage of design. The 6 Facets are enhanced by the design pattern (DPs) library we offer, which builds a vocabulary promoting participatory design.\nTo enable teachers to co-design SGs during the use stage, we extend the participatory design approach to meta-design. We propose a model and an authoring tool that help teachers to adapt SGs to their specific teaching contexts.\nMoPPLiq is a model, both formal and visual, representing the several stages of an SG. It is meant to be explicit and adaptable by teachers. APPLiq is an authoring tool meant to adapt instances of MoPPLiq models, and automatically check and compensate their inconsistencies.\nOur conceptual tools (6 Facets and DPs) and software tools (MoPPLiq and APPLiq) were tested while designing SGs with public and private partners and with SGs used by teachers.","authors":["Bertrand Marne"],"meta":["July 2014","Thesis for: PhDAdvisor: Jean-Marc Labat"],"references":["281886047_Comment_evaluer_la_qualite_d'un_Learning_Game_pendant_sa_conception","277106567_Design_Patterns_en_EIAH_vers_un_langage_de_Patterns_pour_l'evaluation_des_apprenants","271202761_Implementation_de_patrons_de_conception_pour_l'adaptation_des_parcours_pedago-ludiques_dans_les_jeux_serieux","271202681_Conceptual_and_Technical_Frameworks_for_Serious_Games","267154631_Modelisation_des_parcours_pedago-ludiques_pour_l'adaptation_des_jeux_serieux","264004469_Deep_Learning_Games_through_the_Lens_of_the_Toy","262370367_The_Six_Facets_of_Serious_Game_Design_A_Methodology_Enhanced_by_Our_Design_Pattern_Library","313362969_A_conceptual_framework_for_serious_games","281566127_Modeles_pour_la_conception_de_Learning_Role-Playing_Games_en_formation_professionnelle","267154727_Model_and_Authoring_Tool_to_Help_Teachers_Adapt_Serious_Games_to_their_Educational_Contexts","262174857_A_Design_Pattern_Library_for_Mutual_Understanding_and_Cooperation_in_Serious_Game_Design","261244194_MoPPLiq_A_Model_for_Pedagogical_Adaptation_of_Serious_Game_Scenarios","254798732_Design_Patterns_for_Learning_Games","261303484_The_Complete_guide_to_Simulations_and_Serious_Games_how_the_Most_Valuable_Content_Will_be_Created_in_the_Age_Beyond_Gutenberg_to_Google","259532895_The_Art_of_Game_Design_A_book_of_lenses"]}