{"id":"271293267_Self-Esteem_and_Motivation_for_Learning_among_Minority_Students_A_Comparison_between_Students_of_Pre-Academic_and_Regular_Programs","abstract":"Motivation for learning, which explains the impulses and motives for an individual to act to achieve his or her goals, is of great importance for students, particularly students of pre-academic preparatory programs. The literature suggests a relationship between self-esteem and motivation, yet there is a lack of studies that consider self-esteem among students in pre-academic preparatory programs and its relationship to motivation for learning. The main question of this study is whether there are differences in the motivation for learning among students in preparatory programs and regular students. Thus, it examines the relation- ship between self-esteem and motivation for learning among pre-academic preparatory program students and among regular students in their first year of study. Data collection was based on a questionnaire. The sample included 175 students who were enrolled in courses at Sakhnin College. Of these students, 43% were in the pre-academic program and 57% were in their first year of study in other departments. The findings show a positive relationship between self-image and motivation for learning among the two populations. The findings have theoretical implications as well as practical implications. They indicate that pre-academic students are not “lost”; they have motivations similar to the regular students. The prac- tical pedagogical implications suggest that pre-academic students should be exposed to academic subjects beyond the core subjects and should be treated as equal to other students at various levels of the academic system. \n\n(PDF) Self-Esteem and Motivation for Learning among Minority Students: A Comparison between Students of Pre-Academic and Regular Programs. Available from: https://www.researchgate.net/publication/271293267_Self-Esteem_and_Motivation_for_Learning_among_Minority_Students_A_Comparison_between_Students_of_Pre-Academic_and_Regular_Programs [accessed Dec 03 2020].","authors":["Khawla Zoabi"],"meta":["January 2012Creative Education 03(08):1397-1403","DOI:10.4236/ce.2012.38204"],"references":["286109985_Towards_motivation-based_adaptation_of_difficulty_in_e-learning_programs","275714106_In_A_Different_Voice_Psychological_Theory_and_Women's_Development","275158688_Cultural_Intervention_Strategies_Employed_by_Arab_Social_Workers_in_Israel_Identification_and_Conceptualisation","275027413_URBAN_LEISURE_AS_A_PLACE_OF_TRUST_FOR_AN_ETHNIC_MINORITY_-_THE_CASE_OF_THE_GERMAN_COLONY_IN_HAIFA_Yosef_Jabareen","312191824_Practising_Identities_Power_and_Resistance","288084217_Intrinsic_Motivation_and_Effective_Teaching","287302097_Motivating_students_to_learn_Third_edition","285088849_Self-_Determination_theory","284255536_Body_Image_Development_in_Adolescence","274347213_In_a_Different_Voice_Psychological_Theory_and_Women's_Development"]}