{"id":"271253992_Remote_Area_Plant_Disease_Detection_Using_Image_Processing","abstract":"India being an agro-based economy, farmers experince alot of problem in detecting andpreventing diseases in fauna. So there is a necessacity in detecting diseases in fauna which proves to be effective and conviennent for researchers. Relying on pure naked-eye observation to detect and classify diseases can be very unprecise and cumbersome. The color and texture features are used to recognize and classify different agriculture/horticulture produce into normal and affected regions. The combinations of features prove to be very effective in disease detection. The experimental results indicate that proposed approach significantly enhances accuracy in automatic detection of normal and affected produce. This paper presents an effective method for detection of diseases in Malus Domestica using methods like K-meanclustering, color and texture analysis. Keywords-CCM method, color & texture segmentation, K-mean clustering, Malus Domestica, nuclei segmentation","authors":["Sabah Bashir"],"meta":["January 2012IOSR Journal of Electronics and Communication Engineering 2(6):31-34","DOI:10.9790/2834-0263134"],"references":["228681044_Plant_leaves_classification_based_on_morphological_features_and_a_fuzzy_surface_selection_technique","26625462_Hyperspectral_Imagery_for_Mapping_Disease_Infection_in_Oil_Palm_PlantationUsing_Vegetation_Indices_and_Red_Edge_Techniques","283362635_Identification_and_classicifacion_of_normal_and_affectedhorticulture_produce_based_on_combined_color_and_textural_feature_extraction","249454435_Early_detection_and_localisation_of_sugar_beet_diseases_new_approaches","238770565_Leaves_recognition_using_back_propagation_neural_network-advice_for_pest_and_disease_control_on_crops","229084668_Early_detection_and_classification_of_plant_diseases_with_Support_Vector_Machines_based_on_hyperspectral_reflectance","224395688_Rice_disease_identification_using_pattern_recognition_techniques"]}