{"id":"271231569_An_Overview_of_the_Schwartz_Theory_of_Basic_Values","abstract":"This article presents an overview of the Schwartz theory of basic human values. It discusses the nature of values and spells out the features that are common to all values and what distinguishes one value from another. The theory identifies ten basic personal values that are recognized across cultures and explains where they come from. At the heart of the theory is the idea that values form a circular structure that reflects the motivations each value expresses. This circular structure, that captures the conflicts and compatibility among the ten values is apparently culturally universal. The article elucidates the psychological principles that give rise to it. Next, it presents the two major methods developed to measure the basic values, the Schwartz Value Survey and the Portrait Values Questionnaire. Findings from 82 countries, based on these and other methods, provide evidence for the validity of the theory across cultures. The findings reveal substantial differences in the value priorities of individuals. Surprisingly, however, the average value priorities of most societal groups exhibit a similar hierarchical order whose existence the article explains. The last section of the article clarifies how values differ from other concepts used to explain behavior—attitudes, beliefs, norms, and traits.","authors":["Shalom H Schwartz"],"meta":["December 2012Online Readings in Psychology and Culture 2(1)","DOI:10.9707/2307-0919.1116"],"references":["304380643_Universals_in_the_content_and_structure_of_values_Theory_and_empirical_tests_in_20_countries","284255111_Les_valeurs_de_base_de_la_personne_Th_e_orie_mesures_et_applications_Basic_Human_Values_Theory_Measurement_and_Applications","272160193_Value_orientations_Measurement_antecedents_and_consequences_across_nations","247746627_The_Measurement_of_Values_and_Individualism-Collectivism","247724015_The_Structural_Organization_of_Human_Values-Evidence_from_Three_Rounds_of_the_European_Social_Survey_ESS","247723936_Extending_the_Cross-Cultural_Validity_of_the_Theory_of_Basic_Human_Values_with_a_Different_Method_of_Measurement","317953663_Self-Efficacy_Toward_a_Unifying_Theory_of_Behavioral_Change","292754713_New_introductory_lectures_on_psycho-analysis_1933_1932","274842932_The_Protestant_Ethic_and_the_Spirit_of_Capitalism","272160008_The_Achieving_Society"]}