{"id":"271211944_Constructing_Interpretative_Views_of_Learners'_Interaction_Behavior_in_an_Open_Learner_Model","abstract":"In this paper, we discuss how externalizing learners’ interaction behavior may support learners’ explorations in an adaptive educational hypermedia environment that provides activity-oriented content. In particular, we propose a model for producing interpretative views of learners’ interaction behavior and we further apply this model to INSPIREus for visualizing specific indicators. In the proposed approach, we collect raw data from learners’ interaction at various grains, model the state of interaction using a set of indicators that combine temporal, navigational and performance data with semantic data of content and tools, and visualize this information alongside with comparative information coming from the instructor or peers. In this way, we provide users (learners, tutors, peers) with a mirror of learners’ behavior and a point of reference such as the instructor’s proposal or peers’ behavior, in order to enable monitoring and reflection. An empirical study with students is also described investigating how they interpret the visualizations of their interaction data provided by INSPIREus, the metacognitive skills they cultivate and the personal data of peers they value for selecting collaborators. Preliminary results provide evidence about the understandability and expressiveness of the indicators of effort, progress, working style, and the visualisations used.","authors":["Kyparisia A. Papanikolaou"],"meta":["April 2015IEEE Transactions on Learning Technologies 8(2)","DOI:10.1109/TLT.2014.2363663"],"references":["317219663_Exploring_various_guidance_mechanisms_to_support_interaction_with_inspectable_learner_models","308067314_Enhancing_teaching_and_learning_through_educational_data_mining_and_learning_analytics_An_issue_brief","267420832_Computer_based_Interaction_Analysis_Supporting_Self-regulation_Achievements_and_Prospects_of_an_Emerging_Research_Direction","265186433_A_Comparative_Study_of_Learning_Object_Metadata_Learning_Material_Repositories_Metadata_Annotation_an_Automatic_Metadata_Annotation_Tool","312941691_From_mirroring_to_guiding_A_review_of_the_state_of_art_technology_for_supporting_collaborative_learning","290261775_New_learning_Elements_of_a_science_of_education_second_edition","278650406_Open_Learner_Models_as_Drivers_for_Metacognitive_Processes","277197718_Blended_Learning_in_Higher_Education_Framework_Principles_and_Guidelines","263932840_Promotion_of_Self-Assessment_for_Learners_in_Online_Discussion_Using_the_Visualization_Software","262403396_A_Reference_Model_for_Learning_Analytics"]}