{"id":"271322767_Difficulties_of_Academic_Achievement_in_Principles_of_Accounting_Courses_from_the_Student_Perspective_Evidence_from_Libya","abstract":"Many studies by researchers and accounting educators explore various factors associated with the success or failure of accounting majors in college level accounting courses. This paper identifies and summarizes the main obstacles associated with low student academic achievement in introductory courses in the College of Accounting at Al-Jabal Al-Gharbi University, Libya. The research empirically investigates student perceptions of the difficulties of academic achievement in principles of accounting courses. The research method was a survey that involved classifying students as either accounting majors or non-accounting majors. Data was collected through a questionnaire with 28 items related to five primary groups: an instructor’s teaching style, exams and quizzes, students, accounting textbooks, and general groups plus one open-ended question. Findings show that the major obstacles of learning and source of negative perceptions students have toward accounting courses are: lack of teaching assistants, lack of computer laboratories and computer applications, crowded dormitories, lack of interaction between students and faculty, a gap between what is taught and practical applications, irrelevant textbooks and exams, and lack of proficiency in English. Solutions offered include: greater emphasis on teaching computer accounting technology, improving effectiveness of accounting instructors and textbooks, and offering pre-college accounting courses. This study focuses on one public university, which limits its generalisability. For future research, the author suggests interviews with students upon collecting their questionnaires to elicit more complete responses, and greater attention to perspectives based on gender in order to discover and understand any differences among male and female attitudes toward accounting courses.","authors":["Mohamed Tailab"],"meta":["September 2013Higher Education Studies 3(5)","DOI:10.5539/hes.v3n5p36"],"references":["315242477_Academic_Performance_of_Male_versus_Female_Accounting_Undergraduate_Students_Evidence_from_Nigeria","267963276_Academic_Performance_of_Male_versus_Female_Accounting_Undergraduate_Students_Evidence_from_Nigeria","267416201_The_Effects_of_PowerPoint_Lecture_Notes_on_Student_Performance_and_Attitudes","292691754_The_effect_of_final_examination_scheduling_on_student_performance","288964224_The_development_of_accounting_in_Libya","288008446_Empirical_evidence_on_the_effectiveness_of_quizzes_as_a_motivational_technique","285890678_Computerized_practice_set_in_introductory_financial_accounting","285311886_Evaluating_the_effectiveness_of_a_computer-intensive_learning_aid_for_teaching_pension_accounting","284034739_The_impact_of_one-minute_papers_on_learning_in_an_introductory_accounting_course","266469203_Student_Performance_in_Introductory_Accounting_A_Multi-Sample_Multi-Model_Analysis"]}