{"id":"271332451_Hyperspectral_Face_Recognition_With_Spatiospectral_Information_Fusion_and_PLS_Regression","abstract":"Hyperspectral imaging offers new opportunities for face recognition via improved discrimination along the spectral dimension. However, it poses new challenges including low signal to noise ratio, inter band misalignment and high data dimensionality. Due to these challenges, the literature on hyperspectral face recognition is not only sparse but is limited to ad-hoc dimensionality reduction techniques and lacks comprehensive evaluation. We propose a hyperspectral face recognition algorithm using spatiospectral covariance for band fusion and PLS regression for classification. Moreover, we extend 13 existing face recognition techniques, for the first time, to perform hyperspectral face recognition. We formulate hyperspectral face recognition as an image-set classification problem and evaluate the performance of seven state-of-the-art image-set classification techniques. We also test six state-of-the-art grayscale and RGB face recognition algorithms after applying fusion techniques on hyperspectral images. Comparison with the 13 extended and five existing hyperspectral face recognition techniques on three standard datasets show that the proposed algorithm outperforms all by a significant margin. Finally, we perform band selection experiments to find the most discriminative bands in the visible and NIR spectrum.","authors":["Muhammad Uzair","Arif Mahmood","Ajmal Saeed Mian"],"meta":["January 2015IEEE Transactions on Image Processing 24(3)","DOI:10.1109/TIP.2015.2393057","SourcePubMed"],"references":["317083802_Eigenfaces_vs_Fisherfaces_Recognition_Using_Class_Specific_Linear_Projection","269071789_Visualization_of_spectral_images","258382390_QUEST_Hierarchy_for_Hyperspectral_Face_Recognition","235761708_A_Compact_Discriminative_Representation_for_Efficient_Image-set_Classificationwith_Application_to_Biometric_Recognition","313752682_Face_recognition_using_eigenfaces","281792271_Estimation_of_high-dimensional_prior_and_posterior_covariance_matrices_in_Kalman_filter_variants","261502521_Covariance_discriminative_learning_A_natural_and_efficient_approach_to_image_set_classification","261157831_Hyperspectral_face_recognition_using_3D_Gabor_wavelets","243772019_Recognition_using_class_specific_linear_projection","239328236_A_Comparison_of_Computational_Colour_Constancy_Algorithms_Part_Two_Experiments_on_Image_Data"]}