{"id":"271385626_A_Vision-Based_System_for_the_Dynamic_Measurement_of_In-Plane_Displacements","abstract":"Computer vision has advanced markedly in the last decade and has had new applications such as the analysis of the behavior of structures. The analysis of displacement and deformation of structures is an important process in Structural Health Monitoring (SHM). There are different techniques and devices for measuring strains and displacements, such as linear-variable-differential-transducers (LVDTs) and the global position system (GPS), which can be expensive and may not provide sufficient accuracy. This paper proposes vision-based methods for non-contact measurement of displacements and deformations. These methods allow for accurate non-contact measurements at low cost using off-the-shelf components, basically a camera, a computer, and a target. In this work, we test propose a vision based method for the measurement of displacements and we discuss the trade-offs in terms of robustness, computational complexity and accuracy. Encouraging results show that the displacement of a structure can be both determined accurately and fast enough in real time.","authors":["Walberto Marrugo Orozco","Enrique Sierra","Jose Marrugo","Carlos Camacho"],"meta":["October 2014","DOI:10.1109/CIIMA.2014.6983467","Conference: 2014 III International Congress of Engineering Mechatronics and Automation (CIIMA)"],"references":["231742864_A_Synchronized_Multipoint_Vision-Based_System_for_Displacement_Measurement_of_Civil_Infrastructures","230833751_A_Vision-Based_Dynamic_Rotational_Angle_Measurement_System_for_Large_Civil_Structures","257093851_Experimental_assessment_of_high-rate_GPS_receivers_for_deformation_monitoring_of_bridge","232407360_Structural_dynamic_displacement_vision_system_using_digital_image_processing","231017086_A_vision-based_approach_for_the_direct_measurement_of_displacements_in_vibrating_systems","222191465_A_Vision-based_System_for_Remote_Sensing_of_Bridge_Displacement"]}