{"id":"271387823_Revealing_Multiple_Layers_of_Hidden_Community_Structure_in_Networks","abstract":"We introduce a new conception of community structure, which we refer to as\nhidden community structure. Hidden community structure refers to a specific\ntype of overlapping community structure, in which the detection of weak, but\nmeaningful, communities is hindered by the presence of stronger communities. We\npresent Hidden Community Detection HICODE, an algorithm template that\nidentifies both the strong, dominant community structure as well as the weaker,\nhidden community structure in networks. HICODE begins by first applying an\nexisting community detection algorithm to a network, and then removing the\nstructure of the detected communities from the network. In this way, the\nstructure of the weaker communities becomes visible. Through application of\nHICODE, we demonstrate that a wide variety of real networks from different\ndomains contain many communities that, though meaningful, are not detected by\nany of the popular community detection algorithms that we consider.\nAdditionally, on both real and synthetic networks containing a hidden\nground-truth community structure, HICODE uncovers this structure better than\nany baseline algorithms that we compared against. For example, on a real\nnetwork of undergraduate students that can be partitioned either by `Dorm'\n(residence hall) or `Year', we see that HICODE uncovers the weaker `Year'\ncommunities with a JCRecall score (a recall-based metric that we define in the\ntext) of over 0.7, while the baseline algorithms achieve scores below 0.2.","authors":["Kun He","Sucheta Soundarajan","Xuezhi Cao","John Hopcroft"],"meta":["January 2015","SourcearXiv","Project: Social Networks"],"references":["264197837_Deep_Community_Detection","262201307_Overlapping_Community_Detection_via_Leader-Based_Local_Expansion_in_Social_Networks","232906131_Unveiling_Hidden_Communities_Through_Cascading_Detection_on_NetworkStructures","221520166_You_are_who_you_know_Inferring_user_profiles_in_online_social_networks","51951775_Overlapping_Community_Detection_in_Networks_The_State-of-the-Art_and_Comparative_Study","262411165_Overlapping_community_detection_using_seed_set_expansion","261961399_Detecting_community_structure_for_undirected_big_graphs_based_on_random_walks","261006513_Fuzzy_overlapping_community_detection_based_on_local_random_walk_and_multidimensional_scaling","221945992_Community_structure_in_social_and_biological_networks","220639605_Computing_Communities_in_Large_Networks_Using_Random_Walks"]}