{"id":"271444562_Discerning_truth_from_deception_Human_judgments_automation_efforts","abstract":"Recent improvements in effectiveness and accuracy of the emerging field of automated deception detection and the associated potential of language technologies have triggered increased interest in mass media and general public. Computational tools capable of alerting users to potentially deceptive content in computer–mediated messages are invaluable for supporting undisrupted, computer– mediated communication and information practices, credibility assessment and decision–making. The goal of this ongoing research is to inform creation of such automated capabilities. In this study we elicit a sample of 90 computer–mediated personal stories with varying levels of deception. Each story has 10 associated human deception level judgments, confidence scores, and explanations. In total, 990 unique respondents participated in the study. Three approaches are taken to the data analysis of the sample: human judges, linguistic detection cues, and machine learning. Comparable to previous research results, human judgments achieve 50–63 percent success rates, depending on what is considered deceptive. Actual deception levels negatively correlate with their confident judgment as being deceptive (r = -0.35, df = 88, ρ = 0.008). The highest-performing machine learning algorithms reach 65 percent accuracy. Linguistic cues are extracted, calculated, and modeled with logistic regression, but are found not to be significant predictors of deception level, confidence score, or an authors' ability to fool a reader. We address the associated challenges with error analysis. The respondents' stories and explanations are manually content–analyzed and result in a faceted deception classification (theme, centrality, realism, essence, self–distancing) and a stated perceived cue typology. Deception detection remains novel, challenging, and important in natural language processing, machine learning, and the broader library information science and technology community.","authors":["Victoria Rubin","Nadia Conroy"],"meta":["March 2012First Monday 17(3)","DOI:10.5210/fm.v17i3.3933","Project: Deception Detection. Satirical (fake) news recognition."],"references":["287471528_Facets_of_serendipity_in_everyday_chance_encounters_A_grounded_theory_approach_to_blog_analysis","285935448_Reality_monitoring_and_detection_of_deception","248925175_How_people_really_detect_lies","233456318_The_Language_of_Truthful_and_Deceptive_Denials_and_Confessions","322715583_Data_Mining_practical_machine_learning_tools_and_techniques","285208352_The_psychology_of_human_deception","280781159_Statement_Validity_Analysis_and_the_'detection_of_the_truth'","243773194_Verbal_and_Nonverbal_Communication_of_Deception","241645014_Spotting_Lies_Can_Humans_Learn_to_Do_Better","235676492_The_Detection_of_Deception_in_Forensic_Contexts"]}