{"id":"271461588_Throughput_performance_analysis_of_the_wormhole_and_sybil_attack_in_AODV","abstract":"The Mobile Ad hoc Networks (MANETs) is a collection of wireless devices or nodes that communicate by dispatching packets to one another or on behalf of another device or node, without having any central network authority or infrastructure controlling data routing. In order to communicate each other, the nodes cooperatively forward data packets to other nodes in the network by using the routing protocol. However, these routing protocols are not secure hence leaving the MANET unprotected from malicious attack. Wormhole attack is a common malicious attack in MANET environment. The network consisting of 20, 60 and 100 mobile nodes uses the random model in 1000 m × 1000 m flat area. The sources are spread randomly over the network and only 512 bytes data packets are used. Each packet is uniformly dispersed at 180 sec, starting its journey from a random location to a random destination the objective of this paper is to evaluate the throughput performance in AODV with the existence of wormhole and Sybil attack. The simulation result has shown that there is difference performance in throughput when there is an attack.","authors":["Zolidah Kasiran","Juliza Mohamad"],"meta":["May 2014","DOI:10.1109/DICTAP.2014.6821661","Conference: 2014 Fourth International Conference on Digital Information and Communication Technology and its Applications (DICTAP)"],"references":["272854980_Effect_of_Black_Hole_Attack_on_MANET_Routing_Protocols","233819860_Secure_Routing_Protocol_Affection_on_MANETs_Performance","224197802_A_comprehensive_review_on_wormhole_attacks_in_MANET","220747272_Detecting_Route_Attraction_Attacks_in_Wireless_Networks","316339027_Routing_Protocols_for_Mobile_Ad_Hoc_Network","289503870_Semi-Centralised_Multi_Authenticated_RSSI_Based_Solution_to_Sybil_Attack","261494483_Wormhole_attacks_detection_in_MANETs_using_routes_redundancy_and_time-based_hop_calculation","261431897_Wormhole_detection_using_channel_characteristics","251970388_Modeling_and_Analyzing_the_Sybil_Attack_to_Ad-Hoc_Routing_Protocols","51888960_Performance_Analysis_of_AODV_under_Black_Hole_Attack_through_Use_ofOPNET_Simulator"]}