{"id":"271435866_Using_the_EPSA_rubric_to_evaluate_student_work_on_ethics_case_studies_in_a_Professional_Issues_course","abstract":"Engineering programs commonly utilize ethics case studies as the basis for student discussions. Measuring the student learning resulting from the case study process is often very subjective and difficult to quantify. The Engineering Professional Skill Assessment (EPSA) was created as a direct method for eliciting and measuring ABET professional skills such as ethics. EPSA is a performance assessment consisting of: 1) a 1-2 page scenario about a contemporary, interdisciplinary engineering problem 2) a discussion period where a small group of students are asked to address a series of leading questions about the scenario; and 3) an analytical rubric which is used to evaluate the students' discussion. The EPSA project is currently in the third year of a four year National Science Foundation sponsored validity study. As part of this study the team of researchers has applied EPSA to test groups of students at Washington State University, the University of Idaho, and Norwich University. As a result of the work done on the validity study, faculty members from Norwich University who were not part of the project team were introduced to the EPSA method. These faculty members have independently started to utilize aspects of the EPSA method in their courses. This paper describes how the EPSA scenarios and EPSA rubric are being used in the “Ethics” section of a senior level “Professional Issues” course for engineering students. The EPSA Rubric provides a standardized means to evaluate the quality of student discussions and to help make the evaluation of students' work more consistent between the multiple sections of the course.","authors":["Edwin Schmeckpeper","Mike Kelley","Steven Beyerlein"],"meta":["April 2014","DOI:10.1109/ASEEZone1.2014.6820686","Conference: 2014 Zone 1 Conference of the American Society for Engineering Education (ASEE Zone 1)"],"references":["345928895_The_Case_Study_Approach_To_Engineering_Ethics","344539035_Methods_for_Efficient_and_Reliable_Scoring_of_Discussion_Transcripts","344536185_A_Direct_Method_for_Teaching_and_Measuring_Engineering_Professional_Skills_A_Validity_Study","236134379_Implementation_and_Assessment_of_Case_Studies_in_a_Freshman_Engineering_Program"]}