{"id":"271455948_A_comparative_study_of_breast_cancer_detection_based_on_SVM_and_MLP_BPN_classifier","abstract":"The breast cancer is a severe disease found among females all over the world. This is a type of cancer disease arising from human breast tissue cells, usually from the lobules or the inner lining of the milk ducts that provide the ducts with milk. A recent medical survey reveals that throughout the world breast cancer occurs in 22.9% of all cancers in women and it also causes 13.7% of cancer deaths in them. Breast cancer, being very harmful to all women, may cause loss of breasts or may even cost their life. Diagnosis of breast cancer disease is an important area of data mining research. In our work, different classification techniques are applied on the benchmark Breast Cancer Wisconsin dataset from the UCI machine language repository for detection of breast cancer. Principal component analysis (PCA) technique has been used to reduce the dimension of the dataset. Our objectives is to diagnose and analyze breast cancer disease with the help of two well-known classifiers, namely, MLP using Backpropagation NN (MLP BPN) and Support Vector Machine (SVM) and, thereafter assess their performance in terms of different performance measures like Accuracy, Precision, Recall, F-Measure, Kappa statistic etc.","authors":["Soumadip Ghosh","Sujoy Mondal","Bhaskar Ghosh"],"meta":["February 2014","DOI:10.1109/ACES.2014.6808002","Conference: 2014 First International Conference on Automation, Control, Energy and Systems (ACES)","Project: Machine Learning"],"references":["290606140_Distinct_types_of_diffuse_large_B-cell_lymphoma_identified_by_gene_expression_profiling","316600283_Data_Mining_Concepts_and_Techniques","312538118_Support-vector_networks","307881957_LIBSVM_A_library_for_support_vector_machines","303206384_Data_Mining_Concepts_and_Techniques","292059826_Pattern_Recognition","286784937_Microarray_applications_and_challenges_A_vast_array_of_possibilities","284823699_Therapeutic_uses_of_pulsed_magnetic-field_exposure_A_review","279384963_Principal_Component_Analysis_and_Factor_Analysis","278636902_Extremely_low_frequency_ELF_pulsed-gradient_magnetic_fields_inhibit_malignant_tumour_growth_at_different_biological_levels","270051453_Prediction_of_central_nervous_system_embryonal_tumour_outcome_based_on_gene_expression_Nature","275967361_Neural_Networks_A_Systematic_Introduction","275967304_Neutral_Networks_A_Systematic_Introduction","271513141_Support_Vector_Networks","270545552_Medical_Instrumentation-Application_and_Design"]}