{"id":"271458021_A_comparative_study_of_vehicles'_routing_algorithms_for_route_planning_in_smart_cities","abstract":"Vehicle routing problem (VRP) is a generic name referring to optimization problems in transportation, distribution and logistics industry. They mainly focus on serving a number of customers by a number of vehicles. Route planning techniques is one of the main tasks of VRP which aims to find an optimal route from a starting point to a destination on a road map. As road traffic conditions may change during the car journey (e.g., increase/decrease of the congestion level, road incidents etc), the optimal route should be re-evaluated as soon as an update in traffic conditions is available. Choosing an appropriate route planning algorithm among the existing algorithms in the literature to apply it in real road networks is an important task for any transportation application. In this paper, we first present a classification of the different route planning algorithms, and then explain how we compare and analyze their performance when they are applied in real road networks. For the purpose of comparison, we simulate the behavior of these algorithms during runtime using Simulation of Urban Mobility (SUMO) package and TRACI. We have chosen Dijkstra, the most wellknown shortest path algorithm, to be the first algorithm to be implemented in SUMO. Upon reception of any traffic conditions update that affects the current optimal route of a car, we use TRACI to re-apply the algorithm and change this cars route accordingly. In the near future, our target is to simulate other algorithms and compare their performance based on the quality of the obtained best route.","authors":["Vi Ngoc-Nha Tran","Soufiene Djahel","John Murphy"],"meta":["November 2012","DOI:10.1109/VTM.2012.6398701","Conference: 2012 First International Workshop on Vehicular Traffic Management for Smart Cities (VTM)"],"references":["228966705_A_Review_of_Traffic_Simulation_Software","228346477_Tabu_Search","225022282_SUMO_-_Simulation_of_Urban_MObility_An_Overview","224124049_Travel_time_prediction_for_dynamic_routing_using_Ant_Based_Control","266454703_Continuous-Time_Dynamic_Shortest_Path_Algorithms","249852634_Three_Fastest_Shortest_Path_Algorithms_on_Real_Road_Networks_Data_Structures_and_Procedures","239814383_Real-Time_Heuristic_Search_First","225315695_Metaheuristics_for_the_Vehicle_Routing_Problem_and_Its_Extensions_A_Categorized_Bibliography","223384900_Real-time_vehicle_routing_Solution_concepts_algorithms_and_parallel_computing_strategies","220740474_Hybrid_genetic_algorithm_for_dynamic_multi-objective_route_planning_with_predicted_traffic_in_a_real-world_road_network","220412981_Shortest_Path_Algorithms_An_Evaluation_Using_Real_Road_Networks","37454736_TraCI_An_Interface_for_Coupling_Road_Traffic_and_Network_Simulators","220301544_Dynamic_route_planning_for_car_navigation_systems_using_virus_genetic_algorithm","220215017_An_object-oriented_evaluation_framework_for_dynamic_vehicle_routing_problems_under_real-time_information","4155983_Multiobjective_route_selection_for_car_navigation_system_using_genetic_Algorithm"]}