{"id":"271456174_The_West_Digital_Conservatory_of_Archaelogical_Heritage_Project","abstract":"The West Digital Conservatory of Archaeological Heritage project, a.k.a. WDCAH, is a new French research organization whose aim is to both ensure the preservation of digital archaeological data, and deliver expertise in production, analysis, visualization and virtual reality exploration techniques. This project is an interdisciplinary project composed of engineers and researchers in archaeology, computer science, virtual reality and 3D interaction with virtual environments. The major objectives of this conservatory project are: (i) sustainable and centralized safeguarding and archiving of 2D/3D data produced by the archaeological community; (ii) free access to metadata; (iii) secure access to data for the different actors involved in scientific projects and (iv) the support and advice for these actors in the 3D data production and exploration through the latest digital technologies, modeling tools and virtual reality systems. This paper focuses on the first activities of the WDCAH which mainly concern digital models production using photogrammetry, 3D laser scans, and 3D computer graphics software. We are currently working on the reconstitution of six archaeological sites located in the west of France ranging from prehistory to the Middle Ages: the Cairn of Carn Island, the covered pathway of Roh Coh Coet, the Goh Min Ru megalithic site, the gallo-roman mansion of Vanesia, the keep of the Château de Sainte-Suzanne, the Porte des Champs of the Château d'Angers. Other proposals are currently under study.","authors":["Jean-Baptiste Barreau","Yann Bernard","Ronan Gaugne","Gaetan Le Cloirec"],"meta":["October 2013","DOI:10.1109/DigitalHeritage.2013.6743795","Conference: 2013 Digital Heritage International Congress (DigitalHeritage)"],"references":["291600186_L'usage_scientifique_des_modeles_3D_en_archeologie_De_la_validation_a_la_simulation","291600098_Virtual_Archaeology_as_an_Integrated_Preservation_Method","286135235_Photogrammetry_and_laser_scanning_for_archaeological_site_3D_modeling_-_Some_critical_issues","285953498_Scientific_method_chaine_operatoire_and_visualization_3D_modelling_as_a_research_tool_in_archaeology","277916886_Large-scale_immersive_reconstitution_of_a_Neolithic_corbel_dome","277266028_3D-COFORM_Making_3D_documentation_an_everyday_choice_for_the_cultural_heritage_sector","220451468_Research_challenges_for_digital_archives_of_3D_cultural_heritage_models","313610862_Un_point_sur_la_photogrammetrie"]}