{"id":"271448325_A_Unified_Framework_for_Identifiability_Analysis_in_Bilinear_Inverse_Problems_with_Applications_to_Subspace_and_Sparsity_Models","abstract":"Bilinear inverse problems (BIPs), the resolution of two vectors given their\nimage under a bilinear mapping, arise in many applications. Without further\nconstraints, BIPs are usually ill-posed. In practice, properties of natural\nsignals are exploited to solve BIPs. For example, subspace constraints or\nsparsity constraints are imposed to reduce the search space. These approaches\nhave shown some success in practice. However, there are few results on\nuniqueness in BIPs. For most BIPs, the fundamental question of under what\ncondition the problem admits a unique solution, is yet to be answered. For\nexample, blind gain and phase calibration (BGPC) is a structured bilinear\ninverse problem, which arises in many applications, including inverse rendering\nin computational relighting (albedo estimation with unknown lighting), blind\nphase and gain calibration in sensor array processing, and multichannel blind\ndeconvolution (MBD). It is interesting to study the uniqueness of such\nproblems.\nIn this paper, we define identifiability of a BIP up to a group of\ntransformations. We derive necessary and sufficient conditions for such\nidentifiability, i.e., the conditions under which the solutions can be uniquely\ndetermined up to the transformation group. Applying these results to BGPC, we\nderive sufficient conditions for unique recovery under several scenarios,\nincluding subspace, joint sparsity, and sparsity models. For BGPC with joint\nsparsity or sparsity constraints, we develop a procedure to compute the\nrelevant transformation groups. We also give necessary conditions in the form\nof tight lower bounds on sample complexities, and demonstrate the tightness of\nthese bounds by numerical experiments. The results for BGPC not only\ndemonstrate the application of the proposed general framework for\nidentifiability analysis, but are also of interest in their own right.","authors":["Yanjun Li","Kiryung Lee","Yoram Bresler"],"meta":["January 2015IEEE Transactions on Information Theory PP(99)","DOI:10.1109/TIT.2016.2637933","SourcearXiv"],"references":["276296204_Identifiability_in_Blind_Deconvolution_with_Subspace_or_Sparsity_Constraints","260147608_Identifiability_Scaling_Laws_in_Bilinear_Inverse_Problems","319953056_A_Clustering_Approach_to_Learning_Sparsely_Used_Overcomplete_Dictionaries","289757888_Learning_sparsely_used_overcomplete_dictionaries","283675767_Uniqueness_in_bilinear_inverse_problems_with_applications_to_subspace_and_joint_sparsity_models","271430071_Sparse_blind_deconvolution_What_cannot_be_done","261495206_On_identifiability_in_bilinear_inverse_problems","259571962_More_Algorithms_for_Provable_Dictionary_Learning","258813869_Subspace_Methods_for_Computational_Relighting","258144696_Learning_Sparsely_Used_Overcomplete_Dictionaries_via_Alternating_Minimization"]}