{"id":"271507804_Toward_an_Improved_Automatic_Melodic_Accompaniment_to_Arab_Vocal_Improvisation_Mawwal","abstract":"Although automatic accompaniment debuted in the mid-1980s, it was\nnot applied to Arab music till recently. This is due, in part, to the\nlack of research applying informatics to Arab music, also to the particularity\nof Arab music. As a case study, we review the melodic part of the mawaweel\nweb model for the Accompaniment of Arab vocal improvisation, Mawwāl.\nThe three tracks – the retrieved score, reduced score and imitation – are\nmore of an illustration to the tasks performed by the music information\nretrieval unit rather than a creative composition. The instrumental tracks\nfollow the improvisation literally without a mere creativity.\nWe also propose an approach for accompaniment in this heterophonic\ncontext. Firstly, the maqam’s pivot notes are marked within the structural\nscore of the improvisation. Then, the contours of accompaniment tracks\ncan be generated by connecting successive structural pivots using several\nroutes: sequence, glissando, etc.\nAt the end, we cross-checked with common practice by recording two\nimprovisations, asking an oudist to perform two diferent accompaniments\nfor each, and analyzing the score of each pair: vocal & oud. The analysis\nallows for a more robust modeling of accompaniment and reveals those\nfindings:\n• Similarity is huge within pairs, ranging from 75% to 81%, using\ncombinatorial contour representation for distance comparison.\n• When measuring the relative importance of the tonics of the main tetrachords\nover other tones, the proportion of the tonics is found from 37% to\n50%. Relative importance of the lower chord is also measured over the\nupper one; the former does not go below 55%.\n• The number of notes in the oud score exceeds the vocal by 66% to 174%.\nDuration distributions show that the proportion of long notes ranges from\n29% to 37% in the vocal scores, but is about 5% to 11% in the oud. This\nalerts to a drawback in the reviewed model in which the oud performs a\nslightly modified copy of the improvisation, but note density is similar in\nboth. On the other hand, the findings agree with our proposed approach in\nembellishing the route between pivots.\n• Creating an accompanying line by connecting structural pivots is\nrepeatedly followed by the oudist. However, the route can twist in a pattern\nthat is challenging-to-model.\n• Examples of oud embellishments include hitting the lower octave interval\nat resolution and arpeggios. Imitation isn’t very common, but recapitulating\nsingers’ figures by melodic variations is.","authors":["Fadi M. Al-Ghawanmeh","Mohammad T. Al-Ghawanmeh","Nedal Obeidat"],"meta":["December 2014","Conference: The 9th Conference on Interdisciplinary Musicology – CIM14At: Berlin, Germany,Volume: Conference Proceedings, pp. 397-­400","Project: Proposed Exercises to Overcome Difficulties in Playing Oud Instrument for Beginner Students in Music Department/ Yarmouk University   تمارين مقترحه للتغلب على صعوبات العزف على آلة العود لدى الطلبة المبتدئين في قسم الموسيقا/ جامعة اليرموك"],"references":["272238126_Automatic_Accompaniment_to_Arab_Vocal_Improvisation_Mawwal","270897174_Proposing_a_Process_for_Using_Music_Analysis_Software_to_Improve_Teaching_Authentic_Arab_Singing_and_Ornamenting","233686483_Educational_tools_based_on_MIR_system_for_Arabian_woodwinds","275791235_The_Maqam_Phenomenon_An_Improvisation_Technique_in_the_Music_of_the_Middle_East","271676577_The_Combinatorial_Model_of_Pitch_Contour","263725306_Computational_Analysis_of_Turkish_Makam_Music_Review_of_State-of-the-Art_and_Challenges","261663096_Musical_Accompaniment_Systems","254720913_Java_Music_Specification_Language_an_introduction_and_overview","252032950_Development_of_improved_automatic_music_transcription_system_for_the_arabian_flute_NAY","228841876_An_Automatic_Jazz_Accompaniment_System_Reacting_to_Solo"]}