{"id":"271547000_An_application_of_classification_models_to_predict_learner_progression_in_tertiary_education","abstract":"This paper reports on an application of classification models to identify college students at risk of failing in the first year of study. Data was gathered from three student cohorts in the academic years 2010 through 2012. Students within the cohorts were sampled from a range of academic disciplines (n=1074), and were diverse in their academic backgrounds and abilities. Metrics used included data that are typically available to colleges such as age, gender and prior academic performance. The study also considered psychometric indicators that can be assessed in the early stages after enrolment, specifically, personality, motivation and learning strategies. Six classification algorithms were considered. Model accuracy was assessed using cross validation and was compared to outcomes when models were applied to a subsequent academic year. It was found that mature students were more complex to model than younger students. Furthermore, 10-fold cross validation accurately estimated model performance when modeling younger students only, but over-estimated model accuracy when modeling mature students.","authors":["Geraldine Gray","Colm McGuinness","Philip Owende"],"meta":["February 2014","DOI:10.1109/IAdCC.2014.6779384","Conference: 2014 IEEE International Advance Computing Conference (IACC)"],"references":["286368488_An_Investigation_of_Psychometric_Measures_for_Modelling_Academic_Performance_in_Tertiary_Education","277129758_The_Leaving_Certificate_and_first_year_university_performance","271429287_A_Manual_for_the_Use_of_the_Motivated_Strategies_for_Learning_Questionnaire_MSLQ","270820426_Making_Sense_of_Cronbach's_Alpha","267406187_The_Sum_is_Greater_than_the_Parts_Ensembling_Student_Knowledge_Models_in_ASSISTments","286368981_Using_ict_to_enable_inclusive_teaching_practices_in_higher_education","284331831_Design_and_discovery_in_educational_assessment_Evidence_centered_design_psychometrics_and_data_mining","279002791_What_Is_Coefficient_Alpha_An_Examination_of_Theory_and_Applications","262403396_A_Reference_Model_for_Learning_Analytics","258827857_Pitfalls_in_the_use_of_kappa_when_interpreting_agreement_between_multiple_raters_in_reliability_studies"]}