{"id":"271510571_Polarimetric_Radar_Imaging_From_Basics_to_Applications","abstract":"The recent launches of three fully polarimetric synthetic aperture radar (PolSAR) satellites have shown that polarimetric radar imaging can provide abundant data on the Earth’s environment, such as biomass and forest height estimation, snow cover mapping, glacier monitoring, and damage assessment. Written by two of the most recognized leaders in this field, Polarimetric Radar Imaging: From Basics to Applications presents polarimetric radar imaging and processing techniques and shows how to develop remote sensing applications using PolSAR imaging radar.\n\nThe book provides a substantial and balanced introduction to the basic theory and advanced concepts of polarimetric scattering mechanisms, speckle statistics and speckle filtering, polarimetric information analysis and extraction techniques, and applications typical to radar polarimetric remote sensing. It explains the importance of wave polarization theory and the speckle phenomenon in the information retrieval problem of microwave imaging and inverse scattering. The authors demonstrate how to devise intelligent information extraction algorithms for remote sensing applications. They also describe more advanced polarimetric analysis techniques for polarimetric target decompositions, polarization orientation effects, polarimetric scattering modeling, speckle filtering, terrain and forest classification, manmade target analysis, and PolSAR interferometry.\n\nWith sample PolSAR data sets and software available for download, this self-contained, hands-on book encourages you to analyze space-borne and airborne PolSAR and polarimetric interferometric SAR (Pol-InSAR) data and then develop applications using this data.","authors":["Jong-Sen Lee","Eric Pottier"],"meta":["February 2009","DOI:10.1201/9781420054989","Publisher: CRC PressISBN: 9781420054989"],"references":["299636701_Polarimetric_SAR_Techniques_for_Remote_Sensing_of_the_Ocean_Surface"]}