{"id":"271585638_The_Emerging_Internet_of_Things_Marketplace_From_an_Industrial_Perspective_A_Survey","abstract":"The Internet of Things (IoT) is a dynamic global information network consisting of Internet-connected objects, such as RFIDs, sensors, actuators, as well as other instruments and smart appliances that are becoming an integral component of the future Internet. Over the last decade, we have seen a large number of the IoT solutions developed by start-ups, small and medium enterprises, large corporations, academic research institutes (such as universities), and private and public research organizations making their way into the market. In this paper, we survey over 100 IoT smart solutions in the marketplace and examine them closely in order to identify their applications and the technologies they use. More importantly, we identify the trends, opportunities, and open challenges in the industry-based IoT solutions. Based on the application domain, we classify and discuss these solutions under five different categories: 1) smart wearable; 2) smart home; 3) smart city; 4) smart environment; and 5) smart enterprise. This survey is intended to serve as a guideline and a conceptual framework for future research in the IoT and to motivate and inspire further developments. It also provides a systematic exploration of existing research and suggests a number of potentially significant research directions. 14 INDEX TERMS Internet of Things, industry solutions, IoT marketplace.","authors":["Charith Perera","Chi Harold Liu","Srimal Jayawardena"],"meta":["January 2015IEEE Transactions on Emerging Topics in Computing 3(4)","DOI:10.1109/TETC.2015.2390034"],"references":["270742269_Internet_of_Things_in_Industries_A_Survey","266287969_Role_Of_Middleware_For_Internet_Of_Things_A_Study","310845326_Survey_internet_of_things_Vision_applications_and_research_challenges","268733241_Google_glass","266567291_The_JOYO_Remote_Monitoring_System","264585236_Data_Mining_for_Internet_of_Things_A_Survey","262319303_An_operating_system_for_the_home","262238903_Lab_of_things_A_platform_for_conducting_studies_with_connected_devices_in_multiple_homes","262237981_A_Survey_on_the_Internet_of_Things_Security","261486270_Network_self-organization_in_the_Internet_of_Things"]}