{"id":"271546159_Data_privacy_protection_using_multiple_cloud_storages","abstract":"With the rapid development of cloud computing and storage technologies, an increasing number of businesses and individuals are using cloud to store or backup data. However, when users upload private data to the cloud, they lose absolute control over the data. With the continued development of cloud storage, the protection of users' privacy has become a pertinent issue to be addressed. Currently, most users make use of a mainstream encryption algorithm to encrypt data before uploading and to decrypt the data after downloading and before use. To solve this problem, in this paper, we propose a new cloud storage privacy protection method that involves bit split (BS) and bit combination (BC). BS is performed on data and reassembled to form numerous part-files before these are uploaded to the different cloud storage servers. After downloading, the part-files from multiple cloud servers are combined to re-create the original file. Experiments show that this method is effective in protecting the privacy of the users' data, with a performance improvement of ~20 times compared with traditional encryption and decryption methods.","authors":["Wei Zhang","Xinwei Sun","Tao Xu"],"meta":["December 2013","DOI:10.1109/MEC.2013.6885340","Conference: 2013 International Conference on Mechatronic Sciences, Electric Engineering and Computer (MEC)"],"references":["221609535_Venus_Verification_for_untrusted_cloud_storage","312228856_Venus_Verification_for_untrusted_cloud_storage","292393274_A_method_for_obtaining_digital_signatures_and_public-key_cryptosystems","251954380_DES96_-_improved_DES_security","224675166_Performance_Evaluation_of_Novel_DSA_Scheme_that_Combines_Polling_Method_with_Random_Access_Method","220426448_A_Method_for_Obtaining_Digital_Signatures_and_Public-Key_Cryptosystems","220426289_A_Method_for_Obtaining_Digital_Signatures_and_Public-Key_Cryptosystems","2891073_Key-Schedule_Cryptanalysis_of_IDEA_G-DES","2646851_Key-schedule_cryptanalysis_of_idea_g-des_gost_safer_and_triple-des"]}