{"id":"271555010_Rising_popularity_of_interdisciplinary_research_-_An_analysis_of_citation_networks","abstract":"A common consensus among researchers is that interdisciplinarity is one of the key factors in doing research at current time. However, a pertinent question deals with identifying appropriate indicators of interdisciplinarity. Using a set of citation based indicators, here we investigate the evolution of the extent of interdisciplinary research in computer science and physics in the period 1975-2008. For this, we study the citation networks of these two domains from different orthogonal directions, namely citation and reference patterns of a paper, overlapping membership of the papers in different research communities, inclination of the researchers to adopt new fields, and propose several indices to quantify the degree of interdisciplinarity of a field. The new indices of interdisciplinarity corroborate with the hypothesis that the emergence of interdisciplinarity occurs through cross-fertilization of ideas between the sub-fields that otherwise have little overlap as they are studied independently. At the end, we analyze the core-periphery organization of citation networks and arrive to the conclusion that with the advancement of interdisciplinary research, the core part of the network is also changing from theoretical towards more applied fields of research.","authors":["Tanmoy Chakraborty","Niloy Ganguly","Animesh Mukherjee"],"meta":["January 2014","DOI:10.1109/COMSNETS.2014.6734940","Conference: 2014 Sixth International Conference on Communication Systems and Networks (COMSNETS)"],"references":["267939164_Disciplinary_Multidisciplinary_Interdisciplinary_-Concepts_and_Indicators","230624643_The_evolution_of_interdisciplinarity_in_physics_research","222822272_Community_Structure_of_the_Physical_Review_Citation_Network","220365153_Measuring_researcher_interdisciplinarity","51951624_SLPA_Uncovering_Overlapping_Communities_in_Social_Networks_via_A_Speaker-listener_Interaction_Dynamic_Process","45884320_Betweenness_Centrality_as_an_Indicator_of_the_Interdisciplinarity_of_Scientific_Journals","269200173_Computer_science_fields_as_ground-truth_communities","253816387_An_approach_to_interdisciplinarity_through_bibliometric_indicators","242896004_Interdisciplinary_Research_From_Belief_to_Reality","37715815_Interdisciplinarity_History_Theory_and_Practice"]}