{"id":"271525133_Big_Data_New_Epistemologies_and_Paradigm_Shift","abstract":"This article examines how the availability of Big Data, coupled with new data analytics, challenges established epistemologies across the sciences, social sciences and humanities, and assesses the extent to which they are engendering paradigm shifts across multiple disciplines. In particular, it critically explores new forms of empiricism that declare ‘the end of theory’, the creation of data-driven rather than knowledge-driven science, and the development of digital humanities and computational social sciences that propose radically different ways to make sense of culture, history, economy and society. It is argued that: (1) Big Data and new data analytics are disruptive innovations which are reconfiguring in many instances how research is conducted; and (2) there is an urgent need for wider critical reflection within the academy on the epistemological implications of the unfolding data revolution, a task that has barely begun to be tackled despite the rapid changes in research practices presently taking place. After critically reviewing emerging epistemological positions, it is contended that a potentially fruitful approach would be the development of a situated, reflexive and contextually nuanced epistemology.","authors":["Rob Kitchin"],"meta":["April 2014Big Data & Society 1(1):1-12","DOI:10.1177/2053951714528481"],"references":["298975647_Positivistic_geographies_and_spatial_science","324937048_The_Structure_of_Scientific_Revolutions","320181990_Simians_Cyborgs_and_Women_The_Reinvention_of_Nature","313199441_Data_data_everywhere","304929258_3-D_Data_Management_Controlling_Data_Volume_Velocity_and_Variety","299032701_Graphs_maps_trees_-_Abstract_models_for_literary_history_-_2","293108461_Trending_The_Promises_and_the_Challenges_of_Big_Social_Data","289228359_Reading_machines_Toward_an_algorithmic_criticism","284977657_Big-Data_Computing_Creating_Revolutionary_Breakthroughs_in_Commerce","280170390_Automated_PostPositivism"]}