{"id":"271555519_On_Combinatoric_Approach_to_Circumvent_Internet_Censorship_Using_Decoy_Routers","abstract":"The Internet is often referred to as an information highway since it offers a great mean for the general public to access the almost unlimited amount of information. At the same time, this communication technology poses a great threat to the system in those countries that wish to control the information flow. As a result, the Internet is subject to be under censorship, which is, however, a great privacy issue. Deploying decoy routers is one emerging approach to tackle this issue, since it helps each packet whose destination is a prohibited server to hide its ultimate destination from the censorship authority also known as warden. The recent report by Schuchard et al. shows an existence of an efficient approach to detect and isolate active decoy routers from the public. As a countermeasure, they propose to deploy decoy routers surrounding a target country such that isolating the decoy routers will result in isolating the the country from the rest of the Internet. Based on our observation that this problem in fact is with two opposite optimization goals, minimizing the number of decoy routers and maximizing the confinement rate, we introduce two polynomial time algorithms which handle this deployment problem under the presence of uncooperative ASes. We also conduct simulations to compare and analyze the performance of our algorithms.","authors":["Donghyun Kim","Glenn R. Frye","Sung-Sik Kwon","Hyung Jae Chang"],"meta":["November 2013","DOI:10.1109/MILCOM.2013.107","Conference: MILCOM 2013 - 2013 IEEE Military Communications Conference"],"references":["242352806_Parallel_Algorithms_for_Sparse_Linear_Systems","228576383_Decoy_routing_Toward_unblockable_internet_communication","221609468_Cirripede_Circumvention_infrastructure_using_router_redirection_with_plausible_deniability","2910678_Tor_The_Second-Generation_Onion_Router","279043538_Applications_of_a_Planar_Separator_Theorem","262174724_Routing_around_decoys","239223000_Geometric_Separators_for_Finite-Element_Meshes","230596035_A_Separator_Theorem_for_Planar_Graphs","225129442_Partitioning_Planar_Graphs_with_Vertex_Costs_Algorithms_and_Applications","222393305_A_combinatorial_algorithm_for_weighted_stable_sets_in_bipartite_graphs","220589356_The_vertex_separator_problem_A_polyhedral_investigation","4354716_Applications_of_a_Planar_Separator_Theorem","3593078_Finding_separator_cuts_in_planar_graphs_within_twice_the_optimal"]}