{"id":"271585522_A_Survey_on_Internet_of_Things_From_Industrial_Market_Perspective","abstract":"The Internet of Things (IoT) is a dynamic global information network consisting of Internet-connected objects, such as radio frequency identifications, sensors, and actuators, as well as other instruments and smart appliances that are becoming an integral component of the Internet. Over the last few years, we have seen a plethora of IoT solutions making their way into the industry marketplace. Context-aware communications and computing have played a critical role throughout the last few years of ubiquitous computing and are expected to play a significant role in the IoT paradigm as well. In this paper, we examine a variety of popular and innovative IoT solutions in terms of context-aware technology perspectives. More importantly, we evaluate these IoT solutions using a framework that we built around well-known context-aware computing theories. This survey is intended to serve as a guideline and a conceptual framework for context-aware product development and research in the IoT paradigm. It also provides a systematic exploration of existing IoT products in the marketplace and highlights a number of potentially significant research directions and trends.","authors":["Charith Perera","Chi Harold Liu","Srimal Jayawardena","Min Chen"],"meta":["January 2015IEEE Access 2:1660-1679","DOI:10.1109/ACCESS.2015.2389854"],"references":["274074382_Towards_a_Better_Understanding_of_Context_and_Context-Awareness","269702679_A_Scalable_and_Self-Configuring_Architecture_for_Service_Discovery_in_the_Internet_of_Things","265130707_Semantic_Interoperability_Architecture_for_Pervasive_Computing_and_Internet_of_Things","263128758_Securing_the_Internet_of_Things_A_Standardization_Perspective","262881774_The_Cluster_Between_Internet_of_Things_and_Social_Networks_Review_and_Research_Challenges","262528189_Event-Based_Mobile_Social_Networks_Services_Technologies_and_Applications","281043867_All_gadget_and_no_representation_makes_jack_a_dull_environment","278699051_Towards_a_Better_Understanding_of_Context_and_Context-Awareness","263813729_Toward_Scalable_Systems_for_Big_Data_Analytics_A_Technology_Tutorial","262771844_Big_Data_Deep_Learning_Challenges_and_Perspectives"]}