{"id":"271658874_Sandboxes_for_Model-Based_Inquiry","abstract":"In this article, we introduce a class of constructionist learning environments that we call Emergent Systems Sandboxes (ESSs), which have served as a centerpiece of our recent work in developing curriculum to support scalable model-based learning in classroom settings. ESSs are a carefully specified form of virtual construction environment that support students in creating, exploring, and sharing computational models of dynamic systems that exhibit emergent phenomena. They provide learners with “entity”-level construction primitives that reflect an underlying scientific model. These primitives can be directly “painted” into a sandbox space, where they can then be combined, arranged, and manipulated to construct complex systems and explore the emergent properties of those systems. We argue that ESSs offer a means of addressing some of the key barriers to adopting rich, constructionist model-based inquiry approaches in science classrooms at scale. Situating the ESS in a large-scale science modeling curriculum we are implementing across the USA, we describe how the unique “entity-level” primitive design of an ESS facilitates knowledge system refinement at both an individual and social level, we describe how it supports flexible modeling practices by providing both continuous and discrete modes of executability, and we illustrate how it offers students a variety of opportunities for validating their qualitative understandings of emergent systems as they develop.","authors":["Corey Brady","Nathan Ryan Holbert","Firat Soylu","Michael Novak"],"meta":["April 2014Journal of Science Education and Technology 24(2-3)","DOI:10.1007/s10956-014-9506-8","Project: Democratizing access to computational modeling"],"references":["288916604_SimCalc_and_the_Networked_Classroom","346064703_Diversity-by-Design_The_What_Why_and_How_of_Generativity_in_Next-Generation_Classroom_Networks","329654173_Changing_Minds_Computers_Learning_and_Literacy","326467439_The_Handbook_of_Education_and_Human_Development_New_Models_of_Learning_Teaching_and_Schooling","324937048_The_Structure_of_Scientific_Revolutions","324293380_The_Domestication_of_the_Savage_Mind","316934073_Developing_understanding_through_model-based_inquiry","313426080_Learning_through_Participatory_Simulations_Network-based_Design_for_Systems_Learning_in_Classrooms","289901038_Alternatives_to_Trajectories_and_Pathways_to_Describe_Development_in_Modeling_and_Problem_Solving","289469310_GasLab-an_Extensible_Modeling_Toolkit_for_Connecting_Micro-and_Macro-properties_of_Gases"]}