{"id":"271662265_Exploring_a_Mechanistic_Approach_to_Experimentation_in_Computing","abstract":"The mechanistic approach in philosophy of science contributes to our understanding of experimental design. Applying the mechanistic approach to experimentation in computing is beneficial for two reasons. It connects the methodology of experimentation in computing with the methodology of experimentation in established sciences, thereby strengthening the scientific reputability of computing and the quality of experimental design therein. Furthermore, it pinpoints the idiosyncrasies of experimentation in computing: computing deals closely with both natural and engineered mechanisms. Better understanding of the idiosyncrasies, which manifest in terms of a nonstandard role for experimentation, are interesting both for computer scientists and for philosophers of science. Computer scientists can think more clearly about their experimental choices. The role of experimentation elucidated by computer science merits further study from philosophers of science generally, as it highlights a role for experimentation hitherto unrecognized by philosophers: demonstration that activities exist.","authors":["Eric Hatleback","Jonathan M. Spring"],"meta":["September 2014Philosophy & Technology 27(3):441-459","DOI:10.1007/s13347-014-0164-9"],"references":["247389798_Replicability_Reproducibility_and_Robustness_Comments_on_Harry_Collins","240548010_Thinking_About_Mechanisms","314896282_Information_Processing_Computation_and_Cognition","277471415_What_is_computation","262360232_Should_security_researchers_experiment_more_and_draw_more_inferences","261310205_Hiding_Information_in_Flash_Memory","261222444_The_instructional_information_processing_account_of_digital_computation","252501405_The_electromagnetic_pulse_EMP","250141163_Experimental_Computer_Science_The_Need_for_a_Cultural_Change","248396412_Oceanic_navigation_in_Cory's_Shearwaters_evidence_for_a_crucial_role_of_olfactory_cues_for_homing_after_displacement"]}