{"id":"271638354_Factors_that_influence_secondary_school_students'_attitude_to_mathematics","abstract":"Pupils could like, enjoy, or the opposite, could hate mathematics. Attitude could be described as a long-term positive or negative emotional disposition towards mathematics. There is a correlation between pupils. attitude towards mathematics and their mathematical results, thus it is important to develop a positive attitude towards learning mathematics. This attitude could be influenced by many factors. In this research a questionnaire was developed for identifying the factors that influence secondary school pupils (5th-8th grade, 10/11 to 14/15 years old) attitude to mathematics. 337 pupils from the north-vest and central part of Romania have completed the questionnaire. The findings show that the most important factor is the teacher: the teachers. attitude to mathematics and the amount of confidence and support he/she gives to the pupil influence their attitude towards mathematics. Another important factor is how pupils think about the utility of mathematics in their everyday life. Self-efficacy and self-judgment also influence pupils. attitude towards learning mathematics. (C) Published by Elsevier Ltd. Selection and/or peer-review under responsibility of Dr Zafer Bekirogullari.","authors":["Marchis Iuliana"],"meta":["December 2011Procedia - Social and Behavioral Sciences 29(1):786-793","DOI:10.1016/j.sbspro.2011.11.306"],"references":["247727872_Reliability_and_Predictive_Validity_of_the_Motivated_Strategies_for_Learning_Questionnaire_MSLQ","324340292_Overcoming_Math_Anxiety","313079991_Towards_a_definition_of_attitude_The_relationship_between_the_affective_and_the_cognitive_in_pre-university_students","285246361_Describing_the_Affective_Domain_Saying_What_We_Mean","280758090_Motivational_and_Self-Regulated_Learning_Components_of_Classroom_Academic_Performance","280751547_Attaining_self-regulation_A_social_cognitive_perspective","277681069_Attaining_Self-Regulation","275849329_Mathematical_Problem_Solving","262187490_Mathematical_Problem_Solving","254074788_Goal_and_Self-Evaluative_Influences_During_Children's_Cognitive_Skill_Learning"]}