{"id":"271605841_Spatially_Weighted_Principal_Component_Analysis_for_Imaging_Classification","abstract":"The aim of this article is to develop a supervised dimension-reduction framework, called spatially weighted principal component analysis (SWPCA), for high-dimensional imaging classification. Two main challenges in imaging classification are the high dimensionality of the feature space and the complex spatial structure of imaging data. In SWPCA, we introduce two sets of novel weights, including global and local spatial weights, which enable a selective treatment of individual features and incorporation of the spatial structure of imaging data and class label information. We develop an efficient two-stage iterative SWPCA algorithm and its penalized version along with the associated weight determination. We use both simulation studies and real data analysis to evaluate the finite-sample performance of our SWPCA. The results show that SWPCA outperforms several competing principal component analysis (PCA) methods, such as supervised PCA (SPCA), and other competing methods, such as sparse discriminant analysis (SDA).","authors":["Ruixin Guo","Mihye Ahn","Hongtu Zhu"],"meta":["January 2015Journal of Computational and Graphical Statistics 24(1):274-296","DOI:10.1080/10618600.2014.912135","Project: Predictive Models based on Imaging Data"],"references":["301859063_Eigenvalues_of_Large_Sample_Covariance_Matrices_of_Spiked_Population_Models","262022202_Tensor_Regression_with_Applications_in_Neuroimaging_Data_Analysis","260421974_A_Simple_and_Efficient_Supervised_Method_for_Spatially_Weighted_PCA_in_Face_Image_Analysis","243103281_On_General_Adaptive_Sparse_Principal_Component_Analysis","236015019_Sparse_Discriminant_Analysis","312210566_Principal_Component_Analysis","291290501_Statistical_Parametric_Mapping_The_Analysis_of_Functional_Brain_Images","279720415_Statistical_Parametric_Mapping","266166922_The_Statistical_Analysis_of_Functional_MRI_Data","228649256_Asymptotics_of_sample_eigenstruture_for_a_large_dimensional_spiked_covariance_model"]}