{"id":"271647254_Gamification_of_MOOCs_for_Increasing_User_Engagement","abstract":"As the educational organizations worldwide are moving towards bringing education experience on internet, via Massive Open Online Courses (MOOCs) on Massive Open Online Education Platforms (MOOEPs), the retention of the enrolled students throughout the course is still a huge challenge. Although the online education has an immensely noble aim, i.e., to provide freeless expensive quality education to everyone, but if the existing MOOCs are upgraded to more captivating environment for users, a drastic increase in the user engagement in the course can be achieved, and hence MOOCs' providers can reach their ultimate goal in a more ubiquitous manner. In this paper it is suggested that this divide between a MOOC and user's engagement can be bridged with Gamification. Gamification is the use of game design elements in non-game contexts. Here an experimental environment was setup to compare the results of a small vocabulary course distributed among 100 candidates, and a comparative analysis between the gamified learning method and conventional learning method has been done. After the completion of the course a small survey was also taken from the candidates who had gamified tool. The results show that if the learning platform is gamified, it does not only drastically increase the user enrolment but also increase user engagement throughout the course. Gamification also makes learning, a unique and amusing experience.","authors":["Anant Vaibhav","Pooja Gupta"],"meta":["December 2014","DOI:10.1109/MITE.2014.7020290","Conference: IEEE MITE 2014 on MOOCs, Innovation and Technology in EducationAt: Thapar University, Patiala, Punjab, INDIA"],"references":["260205419_The_MOOC_model_for_digital_practice","259841647_Defining_Gamification_-_A_Service_Marketing_Perspective","230854710_From_Game_Design_Elements_to_Gamefulness_Defining_Gamification","225157840_Critical_success_factors_in_online_education","292631553_Ubiquitous_learning","223257621_Shift_Happens_Online_Education_as_a_New_Paradigm_in_Learning"]}