{"id":"271658384_Students_teach_students_Alternative_teaching_in_Greek_secondary_education","abstract":"The students of a Greek junior high school collaborated to prepare the teaching material of a theoretical Computer Science (CS) course and then shared their understanding with other students. This study investigates two alternative teaching methods (collaborative learning and peer tutoring) and compares the learning results to the traditional learning context. A test was used to measure all participating students’ learning results and a questionnaire was distributed to record participant student attitudes towards the alternative teaching conditions. The questionnaire was designed to evaluate each aspect in terms of perceived knowledge, experience, satisfaction, diversity, oddness and interest. The analysis explores potential differences of students’ learning results between alternative and traditional teaching and also differences in the two aspects in relation to students’ preferences. Results provide evidence that active-learning methods can promote positive attitudinal shifts and improve skills in creativity, teamwork, collaboration and communication. Students perceived higher levels of learning than with traditional teaching. Finally in terms of students’ preferences, the majority wanted to have more courses taught with active-learning methods.","authors":["Anastasios Theodoropoulos","Angeliki Antoniou","George Lepouras"],"meta":["April 2014Education and Information Technologies 21(2)","DOI:10.1007/s10639-014-9327-7"],"references":["279589632_Learning_by_doing","274496732_Cooperative_learning_instructional_methods_for_CS1","262388917_Cooperative_Learning_Instructional_Methods_for_CS1_Design_Implementation_and_Evaluation","343364402_Running_on_Empty_the_Failure_to_Teach_K--12_Computer_Science_in_the_Digital_Age","336944207_Learning_by_explaining_to_oneself_and_to_others","288652022_Active_Learning_in_Secondary_and_College_Science_Classrooms_A_Working_Model_for_Helping_the_Learner_To_Learn","284414280_The_Variation_of_Memory_with_Time_for_Information_Appearing_During_a_Lecture","284265939_Peer_Teaching_To_Teach_Is_to_Learn_Twice","281304993_Supporting_self-_peer-_and_collaborative-assessment_in_E-learning_The_case_of_the_PEer_and_Collaborative_Assessment_Environment_PECASSE","270314025_Group_Dynamics_Research_and_Theory"]}