{"id":"271609661_Relationship_between_Type_A_Personality_and_Mental_Health","abstract":"One of the constitutional factors on mental health can be effective, is the concept of personality types. Because the major segments of the active population consist of students form, paying attention to mental health in this group of people is very important and vital. This study reviews the relationship between type A personality and mental health. Methods: The method of this study is a descriptive and correlation method. Therefore, the sample group consists of 50 psychology students in Payam-e-Noor University in Babol, which were randomly selected and answered to two type A personality questionnaire and general health Goldberg. In data analysis, Pearson correlation, T test and SPSS software were used. Results: The results show that between type A personality and mental health, there is a significant relationship. In number of subjects with type a personality, mental health is lower than the number of subjects having Type B personality, The results indicate that there is no significant differences between mean mental health in the two groups of male and female respondents. Discussion: The assessment of personality types, despite the valuable information about the psychiatric diagnosis given to experts and psychologists; it can assess the mental health of patients and be helpful in preventing dimension so that assessment of personality types can be discussed in the introduction of mental health. (C) 2011 Published by Elsevier Ltd. Selection and/or peer-review under responsibility of the 2nd World Conference on Psychology, Counselling and Guidance.","authors":["HosseinAli GhorbaniAmir","Teymor AhmadiGatab b","Nasram shayan"],"meta":["December 2011Procedia - Social and Behavioral Sciences 30:2010-2018","DOI:10.1016/j.sbspro.2011.10.390"],"references":["232826249_Task_preference_in_relation_to_achievement_striving_and_impatience-irritability_components_of_Type_A_behaviour","15710891_Type_a_Behaviour_in_the_Australian_Working_Population","6568938_Stability_and_change_in_personality_type_membership_and_anxiety_in_adolescence"]}