{"id":"271728752_Natural_Frequency_Computation_of_Parallel_Robots","abstract":"The characterization of the elastodynamic behavior and natural frequencies of parallel robots is a crucial point. Accurate elastodynamic models of parallel robots are useful at both their design and control stages in order to define their optimal dimensions and shapes while improving their vibratory behavior. Several methods exist to write the elastodynamic model of manipulators. However, those methods do not provide a straightforward way to write the Jacobian matrices related to the kinematic constraints of parallel manipulators. Therefore, the subject of this paper is about a systematic method for the determination of the mass and stiffness matrices of any parallel robot in stationary configurations. The proposed method is used to express the mass and stiffness matrices of the Nantes Variable Actuation Robot (NaVARo), a three-degree-of-freedom (3DOF) planar parallel robot with variable actuation schemes, developed at IRCCyN. Then, its natural frequencies are evaluated and compared with those obtained from both CAST3M software and experimentally.","authors":["Coralie Germain","Sébastien Briot","Stéphane Caro","Philippe Wenger"],"meta":["March 2015Journal of Computational and Nonlinear Dynamics 10(2):021004","DOI:10.1115/1.4028573"],"references":["289724158_Kinematic_and_Dynamic_Modeling_of_a_Parallel_Manipulator_with_Eight_Actuation_Modes","285599322_Formulas_for_Natural_Frequency_and_Mode_Shape","278817029_Modeling_of_a_High_Speed_Machining_Center_with_a_Multibody_Approach_the_Dynamic_Modeling_of_Flexible_Manipulators","275377996_An_Algorithm_to_Study_the_Elastodynamics_of_Parallel_Kinematic_Machines_With_Lower_Kinematic_Pairs","268397476_Rigidity_analysis_of_T3R1_parallel_robot_with_uncoupled_kinematics","267177238_Dynamics_of_Multibody_Systems","259384773_Flexible_Multibody_Dynamics","245388358_New_Approach_for_Dynamic_Modelling_of_Flexible_Manipulators","245371884_Modeling_Identification_and_Control_of_Robots","245356910_Formulas_for_Natural_Frequency_and_Mode_Shape"]}