{"id":"271709003_Application_of_Data_Mining_Techniques_to_Explore_Predictors_of_HCC_in_Egyptian_Patients_with_HCV-related_Chronic_Liver_Disease","abstract":"Hepatocellular carcinoma (HCC) is the second most common malignancy in Egypt. Data mining is a method of predictive analysis which can explore tremendous volumes of information to discover hidden patterns and relationships. Our aim here was to develop a non-invasive algorithm for prediction of HCC. Such an algorithm should be economical, reliable, easy to apply and acceptable by domain experts.\nThis cross-sectional study enrolled 315 patients with hepatitis C virus (HCV) related chronic liver disease (CLD); 135 HCC, 116 cirrhotic patients without HCC and 64 patients with chronic hepatitis C. Using data mining analysis, we constructed a decision tree learning algorithm to predict HCC.\nThe decision tree algorithm was able to predict HCC with recall (sensitivity) of 83.5% and precession (specificity) of 83.3% using only routine data. The correctly classified instances were 259 (82.2%), and the incorrectly classified instances were 56 (17.8%). Out of 29 attributes, serum alpha fetoprotein (AFP), with an optimal cutoff value of ≥50.3 ng/ml was selected as the best predictor of HCC. To a lesser extent, male sex, presence of cirrhosis, AST>64U/L, and ascites were variables associated with HCC.\nData mining analysis allows discovery of hidden patterns and enables the development of models to predict HCC, utilizing routine data as an alternative to CT and liver biopsy. This study has highlighted a new cutoff for AFP (≥50.3 ng/ml). Presence of a score of >2 risk variables (out of 5) can successfully predict HCC with a sensitivity of 96% and specificity of 82%.","authors":["Dalia Abdelhamid Omran","Abubakr Hussien Awad","Mahasen Mabrouk","Ahmad Fouad Soliman"],"meta":["February 2015Asian Pacific journal of cancer prevention: APJCP 16(1):381-5","SourcePubMed"],"references":["272161265_Overall_Survival_in_Acute_Myeloid_Leukaemia_Patients_with_and_without_Internal_Tandem_Duplication","235799902_Cancer_epidemiology_and_control_in_the_arab_world_-_past_present_and_future","232704144_Why_is_Hepatocellular_Carcinoma_Less_Attributable_to_Viral_Hepatitis_in_Yemen","322715583_Data_Mining_practical_machine_learning_tools_and_techniques","309669089_Management_of_hepatocellular_carcinoma_an_update_american_association_for_the_study_of_liver_diseases_AASLD_practice_guideline","303206384_Data_Mining_Concepts_and_Techniques","288893158_Cancer_pathology_regestry_2003_2004_And_time_trend_analysis","284667423_Estimating_the_world_cancer_burden_Globocan","275270590_CART_Classification_and_Regression_Trees","271610399_Characteristic_difference_of_hepatocellular_carcinoma_between_hepatitis_B-_and_C-_viral_infection_in_Japan"]}