{"id":"271772745_A_GlobalLocal_Affinity_Graph_for_Image_Segmentation","abstract":"Construction of a reliable graph capturing perceptual grouping cues of an image is fundamental for graph-cut based image segmentation methods. In this paper, we propose a novel sparse global/local affinity graph over superpixels of an input image to capture both short and long range grouping cues, thereby enabling perceptual grouping laws, e.g., proximity, similarity, continuity, to enter in action through a suitable graph cut algorithm. Moreover, we also evaluate three major visual features, namely color, texture and shape,for their effectiveness in perceptual segmentation and propose a simple graph fusion scheme to implement some recent findings from psychophysics which suggest combining these visual features with different emphases for perceptual grouping. Specifically, an input image is first oversegmented into superpixels at different scales. We postulate a gravitation law based on empirical observations and divide superpixels adaptively into small, medium and large sized sets. Global grouping is achieved using medium sized superpixels through a sparse representation of superpixels' features by solving a `0-minimization problem, thereby enabling continuity or propagation of local smoothness over long range connections. Small and large sized superpixels are then used to achieve local smoothness through an adjacent graph in a given feature space, thus implementing perceptual laws, e.g., similarity and proximity. Finally, a bipartite graph is also introduced to enable propagation of grouping cues between superpixels of different scales. Extensive experiments are carried out on the Berkeley Segmentation Database in comparison with several state of the art graph constructions. The results show the effectiveness of the proposed approach.","authors":["Xiaofang Wang","Yuxing Tang","Simon Masnou","Liming Chen"],"meta":["January 2015IEEE Transactions on Image Processing 24(4)","DOI:10.1109/TIP.2015.2397313","SourcePubMed"],"references":["281923328_Sparse_Coding_and_Mid-Level_Superpixel-Feature_for_l0-Graph_Based_Unsupervised_Image_Segmentation","271554842_A_graph-cut_approach_to_image_segmentation_using_an_affinity_graph_based_on_l0-sparse_representation_of_features","317084032_Affinity_learning_on_a_tensor_product_graph_with_applications_to_shape_and_image_retrieval","317083801_Affinity_learning_via_self-diffusion_for_image_segmentation_and_clustering","313487833_A_tutorial_on_spectral_clustering","292773066_Mean_shift_towards_feature_space_analysis","285641435_Unsupervised_Segmentation_of_Color-Texture_Regions_in_Images_and_video","284040965_Mean_shift_A_robust_approach_toward_feature_space_analysis","281981556_A_sourcebook_of_gestalt_psychology_Kapitel_Laws_of_organization_in_perceptual_forms","279578298_Comparing_clusterings_-_An_axiomatic_view","261116252_Segmentation_Using_Superpixels_A_Bipartite_Graph_Partitioning_Approach","267847442_Algorithms_for_Sparse_Approximation","261317688_Affinity_learning_via_self-diffusion_for_image_segmentation_and_clustering","260835402_Regularized_Tree_Partitioning_and_Its_Application_to_Unsupervised_Image_Segmentation","258548125_Sparse_Representation_based_Spectral_Clustering_for_SAR_Image_Segmentation"]}