{"id":"271725214_QA_procedures_needed_for_advanced_RT_techniques_and_its_impact_on_treatment_outcome","abstract":"The radiotherapy process is reviewed briefly and potential risks or pitfalls are identified. The focus is on modern advanced modalities in radiation therapy such as IMRT, VMAT, gating and tracking and also for the unknown to come. Existing methods, or quality controls (QC), or with better word barriers, are introduced at important steps of process with the purpose of prohibiting errors to continue through the process and thus avoiding an unwanted erroneous irradiation of the patient. The soft branch of quality assurance (QA) such as peer-review is also a major component of today's process and its safety. The importance of knowing your QCs is pointed out. The role of dosimetry method i.e. 3D-dosimetry is reviewed. Staff have to be working with awareness and alertness that can reduce most of the risks. Having comprehensive protocols known by all involved together with well-trained staff at the department with dedicated functions and responsibilities will further reduce the risk for unintended irradiations of patient. Having a well-designed QA system with the appropriate barriers have the possibility of producing high quality radiotherapy, which will also result in better outcome for the patients. The international head and neck trial illustrates very well the importance of accurate radiotherapy.","authors":["Tommy Knöös"],"meta":["January 2015Journal of Physics Conference Series 573(1):012001","DOI:10.1088/1742-6596/573/1/012001"],"references":["314051672_Polymer_gel_dosimetry","263476817_OC-0107_Normal_tissue_sparing_in_a_Phase_II_trial_of_daily_adaptive_plan_selection_in_radiotherapy_for_urinary_bladder_cancer","259250694_Evaluating_IMRT_and_VMAT_dose_accuracy_Practical_examples_of_failure_to_detect_systematic_errors_when_applying_a_commonly_used_metric_and_action_levels","258205168_Enhancing_the_role_of_case-oriented_peer_review_to_improve_quality_and_safety_in_radiation_oncology_Executive_summary","264430374_Process-based_quality_management_for_clinical_implementation_of_adaptive_radiotherapy","263743266_On_the_feasibility_of_comprehensive_high-resolution_3D_remote_dosimetry","263131337_The_Magnetic_Resonance_Imaging-Linac_System","263092062_The_Australian_Magnetic_Resonance_Imaging-Linac_Program","263092061_The_Rotating_Biplanar_Linac-Magnetic_Resonance_Imaging_System","262645407_Outcome_impact_and_cost-effectiveness_of_quality_assurance_for_radiotherapy_planned_for_the_EORTC_22071-24071_prospective_study_for_head_and_neck_cancer"]}