{"id":"271766878_Regard_multidimensionnel_des_conceptions_du_vivant_Situation_en_contexte_quebecois","abstract":"Au cours des dernières décennies, la recherche en didactique de la biologie s’est attardée à différents problèmes, dont ceux reliés à l’identification de conceptions et d’obstacles, à l’analyse de situations didactiques et de processus d’apprentissage. À cet effet, Astolfi (1992) conçoit « l’obstacle comme un véritable outil didactique au service des apprentissages ». En continuité avec les travaux de Jean-Pierre Astolfi, la présente recherche étudie les conceptions sur le vivant de futurs enseignants et/ou biologistes (N = 543), dont certaines d’entre elles sont des obstacles à une conceptualisation contemporaine du vivant. Descriptive et exploratoire, cette étude évoque la présence de conceptions historiques sur le vivant qui perdurent en co-acceptation avec celles en adéquation aux savoirs biologiques actuels. Les résultats témoignent de la présence de cinq composantes constituées des conceptions animiste, vitaliste, finaliste, évolutionniste, interactionniste, déterministe héréditaire et déterministe comportemental, dont certaines sont des obstacles épistémologiques historiques. Ces obstacles, formés d’explications animiste et vitaliste, finaliste et déterministe comportemental, sont observés chez 51,9 %, 82,4 % et 44,0 % des répondants. La présence de ces conceptions s’insère dans une réflexion d’objectif-obstacle en situation d’enseignement et d’apprentissage.\n\nCatherine Simard, Léon Harvey et Ghislain Samson, « Regard multidimensionnel des conceptions du vivant : situation en contexte québécois », RDST [En ligne], 9 | 2014, mis en ligne le 29 septembre 2016, consulté le 03 février 2015. URL : http://rdst.revues.org/852","authors":["Catherine Simard","Léon Harvey","Ghislain Samson"],"meta":["September 2014","DOI:10.4000/rdst.852"],"references":["305994408_Les_conceptions_d'enseignants_du_primaire_et_du_secondaire_sur_le_determinisme_biologique_de_la_personnalite_humaine_dans_12_pays_d'Europe_d'Afrique_et_du_Moyen_Orient","352743968_Rupture_epistemologique_et_travail_sur_les_representationsEpistemologic_breack_and_changing_conceptions","346865947_Rapports_aux_savoirs_et_didactique_des_sciences","324937048_The_Structure_of_Scientific_Revolutions","324556631_Apprendre_par_franchissement_d'obstacles","322525691_Dictionnaire_des_concepts_fondamentaux_des_didactiques","320181743_Fin_du_tout_genetique","315653447_L'enseignement_de_l'evolution_au_lycee_entre_description_et_explication","313208577_A_Paradigm_for_Developing_Better_Measures_of_Marketing_Constructs","304214277_College_Students'_Perceptions_of_the_Theory_of_Evolution"]}