{"id":"271740708_Analyzing_topic_evolution_in_bioinformatics_investigation_of_dynamics_of_the_field_with_conference_data_in_DBLP","abstract":"In this paper we analyze topic evolution over time within bioinformatics to uncover the underlying dynamics of that field, focusing on the recent developments in the 2000s. We select 33 bioinformatics related conferences indexed in DBLP from 2000 to 2011. The major reason for choosing DBLP as the data source instead of PubMed is that DBLP retains most bioinformatics related conferences, and to study dynamics of the field, conference papers are more suitable than journal papers. We divide a period of a dozen years into four periods: period 1 (2000-2002), period 2 (2003-2005), period 3 (2006-2008) and period 4 (2009-2011). To conduct topic evolution analysis, we employ three major procedures, and for each procedure, we develop the following novel technique: the Markov Random Field-based topic clustering, automatic cluster labeling, and topic similarity based on Within-Period Cluster Similarity and Between-Period Cluster Similarity. The experimental results show that there are distinct topic transition patterns between different time periods. From period 1 to period 3, new topics seem to have emerged and expanded, whereas from period 3 to period 4, topics are merged and display more rigorous interaction with each other. This trend is confirmed by the collaboration pattern over time.","authors":["Min Song","Go Eun Heo","Suyeon Kim"],"meta":["October 2014Scientometrics 101(1):397-428","DOI:10.1007/s11192-014-1246-2"],"references":["263688774_Simple_Semantics_in_Topic_Detection_and_Tracking_Special_Issue_on_ECIR","262241875_Citation_Characterization_and_Impact_Normalization_in_Bioinformatics_Journals","259481271_Productivity_and_Influence_in_Bioinformatics_A_Bibliometric_Analysis_Using_PubMed_Central","292183357_A_Trend_Analysis_of_Domain-Specific_Literatures_with_Content_and_Co-author_Network_Similarity","290013189_Tracking_and_predicting_growth_areas_in_science","284531959_Statistical_Methods_for_Meta-Analysis","280895340_Visualizing_a_discipline_An_author_co-citation_analysis_of_information_science_1972-1995","271512969_Probabilistic_Inference_Using_Markov_Chain_Monte_Carlo_Methods","271436871_Topics_over_time","262157385_Latent_Dirichlet_Allocation"]}