{"id":"271710270_Polyhedral_Omega_A_New_Algorithm_for_Solving_Linear_Diophantine_Systems","abstract":"Polyhedral Omega is a new algorithm for solving linear Diophantine systems\n(LDS), i.e., for computing a multivariate rational function representation of\nthe set of all non-negative integer solutions to a system of linear equations\nand inequalities. Polyhedral Omega combines methods from partition analysis\nwith methods from polyhedral geometry. In particular, we combine MacMahon's\niterative approach based on the Omega operator and explicit formulas for its\nevaluation with geometric tools such as Brion decompositions and Barvinok's\nshort rational function representations. In this way, we connect two recent\nbranches of research that have so far remained separate, unified by the concept\nof symbolic cones which we introduce. The resulting LDS solver Polyhedral Omega\nis significantly faster than previous solvers based on partition analysis and\nit is competitive with state-of-the-art LDS solvers based on geometric methods.\nMost importantly, this synthesis of ideas makes Polyhedral Omega the simplest\nalgorithm for solving linear Diophantine systems available to date. Moreover,\nwe provide an illustrated geometric interpretation of partition analysis, with\nthe aim of making ideas from both areas accessible to readers from a wide range\nof backgrounds.","authors":["Felix Breuer","Zafeirakis Zafeirakopoulos"],"meta":["June 2017Annals of Combinatorics 21(3)","DOI:10.1007/s00026-017-0349-x","SourcearXiv"],"references":["277299165_MacMahon's_Partition_Analysis_III_The_Omega_Package","293424954_Lecture_hall_partitions","292809302_On_linear_homogeneous_diophantine_equations","291413075_Sur_un_probleme_de_geometrie_diophantienne_lineaire_II","287118768_Computing_the_volume_counting_integral_points_and_exponential_sums","285519874_MacMahon's_partition_analysis_VII_Constrained_compositions_q-series_with_applications_to_combinatorics_number_theory_and_physics_Urbana_IL_2000","284775057_Sur_un_probleme_de_geometrie_diophantienne_lineaire_I_Polyedres_et_reseaux","274429612_MacMahon's_Partition_Analysis_VI_A_New_Reduction_Algorithm","268934910_An_introduction_to_combinatory_analysis","268733512_Homogeneous_diophantine_equations"]}