{"id":"271837719_Interactive_Vault_Design","abstract":"This paper presents a new computational framework based on Thrust Network Analysis (TNA) for the design of funicular structures. Fast and robust solving algorithms enable the interactive exploration of these constrained structural systems. By giving explicit, bidirectional control over the internal force distribution and overall geometry to the designer, free exploration of these statically highly indeterminate systems is made possible. The equilibrium of funicular compression networks is represented by reciprocal diagrams, which visually express the force dependencies between different parts of the structure. By modifying these diagrams in real-time, the designer is able to explore novel and expressive vaulted geometries that are blurring the difference between shapes associated to typical compression-only forms, obtained e.g. with hanging networks, and freeform surface structures. The power of this framework for design is demonstrated by a user-friendly software implementation, which has been used to design and build a freeform, thin-tile masonry vault.","authors":["Matthias Rippmann","Lorenz Lachauer","Philippe Block"],"meta":["December 2012International Journal of Space Structures 27(4):219-230","DOI:10.1260/0266-3511.27.4.219"],"references":["279894928_Particle-spring_systems_for_structural_form_finding","271995350_Innovative_Funicular_Tile_Vaulting_A_prototype_in_Switzerland","267692368_Geometry-based_Understanding_of_Structures","267414070_Validating_Thrust_Network_Analysis_using_3D-printed_structural_models","295097558_Heinz_Isler_Engineer's_Contribution_to_Contemporary_Architecture","289794013_Morphogenesis_in_the_theory_and_methodology_of_digital_tectonics","265367264_Graphical_statics_Two_treatises_on_the_graphical_calculus_and_reciprocal_figures_in_graphical_statics","256734139_An_overview_and_comparison_of_structural_form_finding_methods_for_general_networks","256158623_Die_Graphische_Statik","245286946_Computational_Analysis_of_Masonry_Structures_with_a_Funicular_Model"]}