{"id":"271855181_Rational_design_of_self-assembly_pathways_for_complex_multicomponent_structures","abstract":"The field of complex self-assembly is moving toward the design of\nmulti-particle structures consisting of thousands of distinct building blocks.\nTo exploit the potential benefits of structures with such `addressable\ncomplexity,' we need to understand the factors that optimize the yield and the\nkinetics of self-assembly. Here we use a simple theoretical method to explain\nthe key features responsible for the unexpected success of DNA-brick\nexperiments, which are currently the only demonstration of reliable\nself-assembly with such a large number of components. Simulations confirm that\nour theory accurately predicts the narrow temperature window in which\nerror-free assembly can occur. Even more strikingly, our theory predicts that\ncorrect assembly of the complete structure may require a time-dependent\nexperimental protocol. Furthermore, we predict that low coordination numbers\nresult in non-classical nucleation behavior, which we find to be essential for\nachieving optimal nucleation kinetics under mild growth conditions. We also\nshow that, rather surprisingly, the use of heterogeneous bond energies improves\nthe nucleation kinetics and in fact appears to be necessary for assembling\ncertain intricate three-dimensional structures. This observation makes it\npossible to sculpt nucleation pathways by tuning the distribution of\ninteraction strengths. These insights not only suggest how to improve the\ndesign of structures based on DNA bricks, but also point the way toward the\ncreation of a much wider class of chemical or colloidal structures with\naddressable complexity.","authors":["William Jacobs","Aleks Reinhardt","Daan Frenkel"],"meta":["February 2015Proceedings of the National Academy of Sciences 112(20)","DOI:10.1073/pnas.1502210112","SourcearXiv"],"references":["270763437_Communication_Theoretical_prediction_of_free-energy_landscapes_for_complex_self-assembly","263811751_The_Statistical_Mechanics_of_Dynamic_Pathways_to_Self-Assembly","260367276_Numerical_Evidence_for_Nucleated_Self-Assembly_of_DNA_Brick_Structures","233915350_Rapid_Folding_of_DNA_into_Nanoscale_Shapes_at_Constant_Temperature","265371922_In_On_the_Equilibrium_of_Heterogeneous_Substances","262984258_Growth_of_equilibrium_structures_built_from_a_large_number_of_distinct_component_types","262086942_LEGO-like_DNA_structures","260429169_Controlled_Nucleation_and_Growth_of_DNA_Tile_Arrays_within_Prescribed_DNA_Origami_Frames_and_Their_Dynamics","258822617_Design_Space_for_Complex_DNA_Structures","248397541_Self-Assembly_of_DNA_Origami_and_Single-Stranded_Tile_Structures_at_Room_Temperature"]}