{"id":"271830707_Reviewing_the_Flipped_Classroom_Research_Reflections_for_Computer_Science_Education","abstract":"Recent technical and infrastructural developments posit flipped (or inverted) classroom approaches ripe for exploration. Flipped classroom approaches have students use technology to access the lecture and other instructional resources outside the classroom in order to engage them in active learning during in-class time. Scholars and educators have reported a variety of outcomes of a flipped approach to instruction; however, the lack of a summary from these empirical studies prevents stakeholders from having a clear view of the benefits and challenges of this style of instruction. The purpose of this article is to provide a review of the flipped classroom approach in order to summarize the findings, to guide future studies, and to reflect the major achievements in the area of Computer Science (CS) education. 32 peer-reviewed articles were collected from a systematic literature search and analyzed based on a categorization of their main elements. The results of this survey show the direction of flipped classroom research during recent years and summarize the benefits and challenges of adopting a flipped approach in the classroom. Suggestions for future research include: describing in-detail the flipped approach; performing controlled experiments; and triangulating data from diverse sources. These future research efforts will reveal which aspects of a flipped classroom work better and under which circumstances and student groups. The findings will ultimately allow us to form best practices and a unified framework for guiding/assisting educators who want to adopt this teaching style.","authors":["Michail Giannakos","John Krogstie","Nikos Chrisochoides"],"meta":["December 2014","DOI:10.1145/2691352.2691354","Conference: In Proceedings of the Computer Science Education Research Conference (CSERC '14)At: Berlin, Germany","Project: Computer-Aided Personalized Education"],"references":["285935974_The_flipped_classroom_A_survey_of_the_research","272688967_Challenges_and_Perspectives_in_an_Undergraduate_Flipped_Classroom_Experience_Looking_through_the_Lens_of_Learning_Analytics","345929198_Implementing_An_Inverted_Classroom_Model_In_Engineering_Statics_Initial_Results","306150855_Writing_wasn't_really_stressed_accurate_historical_analysis_was_stressed_Student_Perceptions_of_In-Class_Writing_in_the_Inverted_General_Education_University_History_Survey_Course","303101301_The_flipped_classroom_in_world_history","288347639_Flipping_the_college_spreadsheet_skills_classroom_Initial_empirical_results","274434507_The_Flipped_Class_A_Method_to_Address_the_Challenges_of_an_Undergraduate_Statistics_Course","263678400_The_hybrid_course_Merging_on-line_instruction_and_the_traditional_classroom","263572056_Student_learning_and_perceptions_in_a_flipped_linear_algebra_course","263306536_Flipping_Calculus"]}