{"id":"271919729_The_Impact_of_Centralized_Advising_on_First-Year_Academic_Performance_and_Second-Year_Enrollment_Behavior","abstract":"To enhance student success, many colleges and universities have expanded academic support services and programmatic interventions. One popular measure that has been recognized as critical to student success is academic advising. Many institutions have expanded advising by creating centralized units staffed with professional advisors who serve specific student groups. In this study, I used propensity score matching to estimate the impact of using centralized academic advising at a large metropolitan public research university on undergraduate students’ first-year GPA and second-year enrollment behavior. Using a cohort of 2,745 first-time full-time freshmen who matriculated in fall 2010, I matched students who used centralized advising with those who used no advising, over the course of two semesters. I then fit an OLS regression model to examine the impact of centralized advising on first-year GPA and a Zero Inflated Negative Binomial model to examine its impact on students’ enrollment behavior in the second year. I used these parametric results to simulate average treatment effects. Results indicated that students who used centralized academic instead of no advising experienced an increase in their first-term GPA, second-term GPA, and first-year cumulative GPA. Also, students who used centralized advising during the second term experienced a decrease in their probability of first-year attrition.","authors":["Felly Chiteng Kot"],"meta":["September 2014Research in Higher Education 55(6):527-563","DOI:10.1007/s11162-013-9325-4"],"references":["311806471_The_Impacts_of_State_Performance_Funding_Systems_on_Higher_Education_Institutions_Research_Literature_Review_and_Policy_Recommendations","329472396_A_Characterization_of_Optimal_Designs_for_Observational_Studies","327860166_Methods_Matter_Improving_Causal_Inference_in_Educational_and_Social_Science_Research","323377848_Matching_Using_Estimated_Propensity_Scores_Relating_Theory_to_Practice","318517973_Leaving_College_Rethinking_the_Causes_and_Cures_of_Student_Attrition","313567226_Missing_data_A_conceptual_review_for_applied_psychologists","313399308_Econometric_analysis_of_cross_section_and_panel_data","313209792_Centralizing_advising_to_improve_student_outcomes","305166663_Dropout_from_Higher_Education_A_Theoretical_Synthesis_of_Recent_Research","303197102_Introductory_Econometrics_A_Modern_Approach"]}