{"id":"271924588_Control_strategy_of_multi-point_bending_one-off_straightening_process_for_LSAW_pipes","abstract":"At present, the straightening process for longitudinally submerged arc welding (LSAW) pipes is a three-point bending multi-step straightening method. In the process, the straightness of the overall pipe length requires to be measured prior to each single straightening operation, and the determination of the straightness parameters mainly relies on the operator’s experience. All of this has resulted in low efficiency of the current process. In this paper, a quantitative method is firstly established to calculate the theoretical straightening moment according to a pipe’s initial deflection distribution, which is based on the springback equation of small curvature plane bending previously developed. The multi-point bending one-off straightening control strategy is then developed, along with the method for obtaining corresponding straightening parameters by discretizing and linearizing the theoretical moment curve. The finite element methods (FEM) simulation results from the LSAW pipe indicate the more number of pressure points, the higher the straightening accuracy. To reduce the number of pressure points and ensure the straightening accuracy, the concept of the load correction coefficient is introduced, and the method to obtain an optimal correction coefficient is then excessively studied. Feasibility and reliability of the newly developed control strategy is verified through a FEM simulation model. Furthermore, the FEM simulation model is validated by physical simulation experiments of small-sized pipes. The FEM simulation results indicate that by using the newly developed control strategy with an optimal load correction coefficient, a LSAW pipe with an initial deflection of 70.89 mm could be modified into the one with a maximum residue deflection of 8 mm or less in one round of straightening operation, when numbers of the pressure points are set up as 3, 4, 5, and 6, respectively, so that the straightness can be obtained within 0.065 % to far less than the standard requirement of 0.2 %.","authors":["Jun Zhao","Xiaokang Song"],"meta":["June 2014The International Journal of Advanced Manufacturing Technology 72(9-12):1615-1624","DOI:10.1007/s00170-014-5776-9"],"references":["257337433_Artificial_neural_network_prediction_of_weld_distortion_rectification_using_a_travelling_induction_coil","257337180_Advanced_gas_metal_arc_welding_processes","238492803_Springback_equation_of_small_curvature_plane_bending","225448692_Improvement_on_straightness_of_metal_bar_based_on_straightening_stroke-deflection_model","270741350_Measurement_and_Control_of_a_Straightening_Process_for_Seamless_Pipes","270679340_Control_for_Straightening_Process_of_Seamless_Pipe","257337663_Control_system_to_counteract_axial_displacement_during_the_welding_of_huge_pipes","245447731_Research_on_straightening_technology_CAM_system","229368009_Synthesis_of_the_multi-step_straightness_control_system_for_shaft_straightening_processes","225991113_An_investigation_on_multistage_bending_of_blank_sheet_into_cylindrical_tube_by_experiment_and_numerical_simulation"]}