{"id":"271906975_A_Rule-based_Approach_for_Discovering_Effective_Software_Team_Composition","abstract":"Human aspects in software engineering play a key role in composing effective team members. However, to date there is no general consensus on the effective personality types and diversity based on software team roles. Thus, this paper aims to discover the effective personality types and diversity based on two software team roles – team leader and programmer by using a rule-based approach. The rule-based approach by employing the rough set technique was used to discover patterns of the\ndata selected. In this study, four main steps were involved to discover the patterns – reduct generation rules, rules generation, rules filtering, and rules evaluation. The results show that the rules generated achieved acceptable prediction accuracy with more than 70 per cent accuracy. In addition, the ROC value achieved 0.65, which indicates the rule-based model is valid and useful. The results reveal that the extrovert personality type is dominant for both software team roles and a homogeneous or heterogeneous team plays an equal role to determine an effective team. This study provides useful rules for decision makers to understand and get insight into selecting effective team members that lead to producing high-quality software.","authors":["Abdul Rehman Gilal","Mazni Omar","Kamal Imran Mohd Sharif"],"meta":["December 2014International Journal of Information and Communication Technology 13(2014):1-20","DOI:10.32890/jict.13.2014.8145"],"references":["303141082_Efficiency_of_decision_trees_in_predicting_student's_academic_performance","288106706_Developing_a_Team_Performance_Prediction_Model_A_Rough_Sets_Approach","278660599_Research_of_Customer_Classification_Based_on_Rough_Set_Using_Rosetta_Software","270094453_The_Social_Environment_as_a_Determinant_for_the_Impact_of_the_Big_Five_Personality_Factors_and_the_Group's_Performance","267217191_THE_CONTRIBUTION_OF_TEAMWORK_THINKING_STYLES_AND_INNOVATION_TOWARDS_KNOWLEDGE_MANAGEMENT","265544297_Supervised_Machine_Learning_A_Review_of_Classification_Techniques","263849049_Extreme_Programming_Explained_Embrace_Change","260734266_Personality_in_software_engineering_Preliminary_findings_from_a_systematic_literature_review","257584557_Exploring_the_Effects_of_Value_Diversity_on_Team_Effectiveness","257391326_Team_building_criteria_in_software_projects_A_mix-method_replicated_study"]}