{"id":"271966208_Students'_engagement_with_Facebook_in_a_university_undergraduate_policing_unit","abstract":"p>Web 2.0 technologies are increasingly being used to support teaching in higher education courses. However, preliminary research has shown that students are using such technologies primarily for social purposes, rather than as a means of further engaging with academic content. This study examines a cohort of tertiary students' use of a Facebook page, which was created for a second year university policing unit at the Queensland University of Technology in Brisbane, Australia. Results from content analysis of the Facebook \"wall\" and a survey of student users and non-users showed that although students only demonstrated very little active engagement with academic content posted on the site (that is, they were reluctant to interact with unit materials in a way that would leave a digital trace ), they reported that Facebook had increased their ability to engage with and critically analyse the unit content. In alignment with other research in this area, students also reported the usefulness of the Facebook page for increasing communication with their peers and with the teaching staff. This paper concludes by offering a number of best practice guidelines for the use of Facebook in tertiary education.\n\n</p","authors":["Zoe Staines","Mark Adam Lauchs"],"meta":["December 2013Australasian Journal of Educational Technology 29(6):792-805","DOI:10.14742/ajet.270"],"references":["249032941_Informal_learning_and_identity_formation_in_online_social_networks","235912573_Social_network_sites_usage_habits_of_undergraduate_students_Case_study_of_Facebook","306174471_Unravelling_the_social_network_Theory_and_research_Learning","277040843_Blended_learning_environments_Using_social_networking_sites_to_enhance_the_first_year_experience","254447500_Learning_or_lurking","237714222_H_Sapiens_Digital_From_Digital_Immigrants_and_Digital_Natives_to_Digital_Wisdom","235316599_Digital_Natives_Digital_Immigrants_Part_1","233483026_Faceworking_Exploring_Students'_Education-Related_Use_of_Facebook","233336387_Unravelling_the_social_network_Theory_and_research","233293334_The_Effects_of_Teacher_Self-Disclosure_Via_Facebook_on_Teacher_Credibility"]}