{"id":"272091697_All_STEM_Fields_Are_Not_Created_Equal_People_and_Things_Interests_Explain_Gender_Disparities_across_STEM_Fields","abstract":"The degree of women’s underrepresentation varies by STEM fields. Women are now overrepresented in social sciences, yet only constitute a fraction of the engineering workforce. In the current study, we investigated the gender differences in interests, and used it to explain the differential distribution of women across sub-disciplines of STEM as well as the overall underrepresentation of women in STEM fields. Specifically, we meta-analytically reviewed norm data on basic interests from 52 samples in 33 interest inventories published between 1964 and 2007, with a total of 209,810 male and 223,268 female respondents. We found gender differences in interests to vary largely by STEM field, with the largest gender differences in interests favoring men observed in engineering disciplines (d = .83 to 1.21), and in contrast, gender differences in interests favoring women in social sciences and medical services (d = -.33 and -.40, respectively). Importantly, the gender composition (percentages of women) in STEM fields reflects these gender differences in interests. The patterns of gender differences in interests and the actual gender composition in STEM fields were explained by the people-orientation and things-orientation of work environments, and were not associated with the level of quantitative ability required. These findings suggest potential interventions targeting interests in STEM education to facilitate individuals’ ability and career development and strategies to reform work environments to better attract and retain women in STEM occupations.","authors":["Rong Su","James Rounds"],"meta":["February 2015Frontiers in Psychology 6:189","DOI:10.3389/fpsyg.2015.00189"],"references":["310424091_'Person-environment_fit'","279969998_Women_in_Academic_Science_A_Changing_Landscape","263858016_Communally_Constrained_Decisions_in_Workplace_Contexts","286122081_I_can_but_I_don't_want_to_The_Impact_of_Parents_Interests_and_Activities_on_Gender_Differences_in_Math","284531959_Statistical_Methods_for_Meta-Analysis","271429539_Psychology_of_Human_Motivation_Exploring_the_Psychology_of_Interest","269822687_Sex-stereotyping_in_four-year-olds'_occupational_aspirations","264799698_Women_Minorities_and_Persons_with_Disabilities_in_Science_and_Engineering_2011_NSF_11-309","264393560_Breadth-Based_Models_of_Women's_Underrepresentation_in_STEM_Fields","264340043_Enabling_Engineering_Performance_Skills_A_Program_to_Teach_Communication_Leadership_and_Teamwork"]}