{"id":"272170082_Building_Effective_Representations_for_Sketch_Recognition","abstract":"As the popularity of touch-screen devices, understanding a user's hand-drawn sketch has become an increasingly important research topic in artificial intelligence and computer vision. However, different from natural images, the hand-drawn sketches are often highly abstract , with sparse visual information and large intra-class variance, making the problem more challenging. In this work, we study how to build effective representations for sketch recognition. First, to capture saliency patterns of different scales and spatial arrangements , a Gabor-based low-level representation is proposed. Then, based on this representation, to discovery more complex patterns in a sketch, a Hybrid Multilayer Sparse Coding (HMSC) model is proposed to learn mid-level representations. An improved dictionary learning algorithm is also leveraged in HMSC to reduce over-fitting to common but trivial patterns. Extensive experiments show that the proposed representations are highly discriminative and lead to large improvements over the state of the arts.","authors":["Jun Guo","Changhu Wang","Hongyang Chao"],"meta":["January 2015","Conference: The Twenty-Ninth AAAI Conference on Artificial Intelligence (AAAI-15)At: Austin, Texas, USA"],"references":["254461838_How_Do_Humans_Sketch_Objects","234754545_Learning_Incoherent_Dictionaries_for_Sparse_Approximation_Using_Iterative_Projections_and_Rotations","319770820_Histograms_of_Oriented_Gradients_for_Human_Detection","314779249_How_do_humans_sketch_objects","289578089_SmartVisio_Interactive_Sketch_Recognition_with_Natural_Correction_and_Editing","281327886_Histograms_of_Oriented_Gradients_for_Human_Detection","262403783_Query-adaptive_shape_topic_mining_for_hand-drawn_sketch_recognition","261227188_Multipath_Sparse_Coding_Using_Hierarchical_Matching_Pursuit","257484942_A_performance_evaluation_of_gradient_field_HOG_descriptor_for_sketch_based_image_retrieval","224605770_Robust_Recovery_of_Signals_From_a_Structured_Union_of_Subspaces"]}