{"id":"272184822_Social_significance_of_community_structure_Statistical_view","abstract":"Community structure analysis is a powerful tool for social networks that can simplify their topological and functional analysis considerably. However, since community detection methods have random factors and real social networks obtained from complex systems always contain error edges, evaluating the significance of a partitioned community structure is an urgent and important question. In this paper, integrating the specific characteristics of real society, we present a framework to analyze the significance of a social community. The dynamics of social interactions are modeled by identifying social leaders and corresponding hierarchical structures. Instead of a direct comparison with the average outcome of a random model, we compute the similarity of a given node with the leader by the number of common neighbors. To determine the membership vector, an efficient community detection algorithm is proposed based on the position of the nodes and their corresponding leaders. Then, using a log-likelihood score, the tightness of the community can be derived. Based on the distribution of community tightness, we establish a connection between p-value theory and network analysis, and then we obtain a significance measure of statistical form . Finally, the framework is applied to both benchmark networks and real social networks. Experimental results show that our work can be used in many fields, such as determining the optimal number of communities, analyzing the social significance of a given community, comparing the performance among various algorithms, etc.","authors":["H. Li","Jasmine J Daniels"],"meta":["January 2015Physical Review E 91(1):012801","DOI:10.1103/PhysRevE.91.012801","SourcePubMed","Project: The study of hidden patterns and dynamical evolution mechanisms of community structure in social network"],"references":["262030019_Phase_transitions_in_semisupervised_clustering_of_sparse_networks","261065917_Scalable_detection_of_statistically_significant_communities_and_hierarchies_message-passing_for_modularity","255173726_A_testing_based_extraction_algorithm_for_identifying_significant_communities_in_networks","239815393_Community_structure_detection_based_on_Potts_model_and_network's_spectral_characterization","231079488_Analysis_of_the_structure_of_complex_networks_at_different_resolution_levels","260726148_Analysis_of_stability_of_community_structure_across_multiple_hierarchical_levels","258080189_Potts_model_based_on_a_Markov_process_computation_solves_the_community_structure_problem_effectively","247650049_Stochastic_Blockmodels_First_Steps","232771086_Uncovering_the_overlapping_community_structure_of_complex_networks_in_nature_and_society","231139904_Modularity_optimization_in_community_detection_of_complex_networks"]}