{"id":"272157732_Walking_in_the_Uncanny_Valley_Importance_of_the_Attractiveness_on_the_Acceptance_of_a_Robot_as_a_Working_Partner","abstract":"The Uncanny valley hypothesis, which tells us that almost-human characteristics in a robot or a device could cause uneasiness in human observers, is an important research theme in the Human Robot Interaction (HRI) field. Yet, that phenomenon is still not well-understood. Many have investigated the external design of humanoid robot faces and bodies but only a few studies have focused on the influence of robot movements on our perception and feelings of the Uncanny valley. Moreover, no research has investigated the possible relation between our uneasiness feeling and whether or not we would accept robots having a job in an office, a hospital or elsewhere. To better understand the Uncanny valley, we explore several factors which might have an influence on our perception of robots, be it related to the subjects, such as culture or attitude toward robots, or related to the robot such as emotions and emotional intensity displayed in its motion. We asked 69 subjects (N = 69) to rate the motions of a humanoid robot (Perceived Humanity, Eeriness, and Attractiveness) and state where they would rather see the robot performing a task. Our results suggest that, among the factors we chose to test, the attitude toward robots is the main influence on the perception of the robot related to the Uncanny valley. Robot occupation acceptability was affected only by Attractiveness, mitigating any Uncanny valley effect. We discuss the implications of these findings for the Uncanny valley and the acceptability of a robotic worker in our society.","authors":["Matthieu Destephe","Martim Brandão","Tatsuhiro Kishi","Massimiliano Zecca"],"meta":["February 2015Frontiers in Psychology 6","DOI:10.3389/fpsyg.2015.00204"],"references":["280571773_Individual_differences_predict_sensitivity_to_the_uncanny_valley","343505782_The_Managed_Heart_Commercialization_of_Human_Feeling","324407464_Japanese_Religion_Unity_and_Diversity","286701177_The_Managed_Heart_Commercialisation_of_Human_Feeling","274268674_Japan_Nature_Artifice_and_Japanese_Culture","272087835_The_Uncanny_Valley","270324094_The_Managed_Heart_Commercialization_of_Human_Feeling","262202087_Exploring_Children's_Attitudes_towards_Static_and_Moving_Humanoid_Robots","261433141_What_you_do_is_who_you_are_The_role_of_task_context_in_perceived_social_robot_personality","259257966_The_Managed_Heart_Commercialization_of_Human_Feeling_Updated_with_a_New_Preface","258199754_Perception_of_Emotion_and_Emotional_Intensity_in_Humanoid_Robots_Gait","257602499_The_influences_of_emotional_intensity_for_happiness_and_sadness_on_walking","241217609_Subjective_Ratings_of_Robot_Video_Clips_for_Human_Likeness_Familiarity_and_Eeriness_An_Exploration_of_the_Uncanny_Valley","238193670_Assessing_Human_Likeness_by_Eye_Contact_in_an_Android_Testbed","235304147_Emotional_Intelligence_Leadership_Effectiveness_and_Team_Outcomes"]}