{"id":"272133839_Strategy_Synthesis_for_Multi-Dimensional_Quantitative_Objectives","abstract":"Multi-dimensional mean-payoff and energy games provide the mathematical foundation for the quantitative study of reactive systems, and play a central role in the emerging quantitative theory of verification and synthesis. In this work, we study the strategy synthesis problem for games with such multi-dimensional objectives along with a parity condition, a canonical way to express ω-regular conditions. While in general, the winning strategies in such games may require infinite memory, for synthesis the most relevant problem is the construction of a finite-memory winning strategy (if one exists). Our main contributions are as follows. First, we show a tight exponential bound (matching upper and lower bounds) on the memory required for finite-memory winning strategies in both multi-dimensional mean-payoff and energy games along with parity objectives. This significantly improves the triple exponential upper bound for multi energy games (without parity) that could be derived from results in literature for games on VASS (vector addition systems with states). Second, we present an optimal symbolic and incremental algorithm to compute a finite-memory winning strategy (if one exists) in such games. Finally, we give a complete characterization of when finite memory of strategies can be traded off for randomness. In particular, we show that for one-dimension mean-payoff parity games, randomized memoryless strategies are as powerful as their pure finite-memory counterparts.","authors":["Krishnendu Chatterjee","Mickael Randour","Jean-Francois Raskin"],"meta":["September 2012","DOI:10.1007/978-3-642-32940-1_10","Conference: CONCUR 2012 - 23rd International Conference on Concurrency TheoryVolume: LNCS 7454"],"references":["251936113_Games_with_Imperfect_Information_Theory_and_Algorithms","251396842_Supervisory_control_of_discrete_event_processes","248675526_Supervisory_control_of_a_class_of_discrete_event_systems","313628527_Antichains_A_new_algorithm_for_checking_universality_of_finite_automata","312603299_Tree_automata_mu-calculus_and_determinacy","309898404_Games_and_Markov_decision_processes_with_mean-payoff_parity_and_energy_parity_objectives","303969276_Alternating-Time_Temporal_Logic","303353284_Bounds_on_positive_integral_solutions_of_linear_diophantine_equations","291057187_Interface_theories_for_component-based_design","262170529_When_simulation_meets_antichains_on_checking_language_inclusion_of_nondeterministic_finite_tree_automata"]}