{"id":"272160113_Minds_Brains_and_Programs","abstract":"This article can be viewed as an attempt to explore the consequences of two propositions. (I) Intentionality in human beings (and animals) is a product of causal features of the brain. I assume this is an empirical fact about the actual causal relations between mental processes and brains. It says simply that certain bran processes are sufficient for intentionality. (2) Instantiating a computer program is never by itself a sufficient condition of intentionality. The main argument of this paper is directed at establishing this claim. The form of the argument is to show how a human agent could instantiate the program and still not have the relevant intentionality. These two propositions have the following consequences: (3) The explanation of how the brain produces intentionality cannot be that it does it by instantiating a computer program. This is a strict logical consequence of 1 and 2. (4) Any mechanism capable of producing intentionality must have causal powers equal to those of the brain. This is meant to be a trivial consequence of 1. (5) Any attempt literally to create intentionality artificially (strong AI) could not succeed just by designing programs but would have to duplicate the causal powers of the human brain. This follows from 2 and 4. 'Could a machine think?' On the argument advanced here only a machine could think, and only very special kinds of machines, namely brains and machines with internal causal powers equivalent to those of brains. And that is why strong AI has little to tell us about thinking, since it is not about machines but about programs, and no program by itself is sufficient for thinking.","authors":["John R. Searle"],"meta":["January 1980Behavioral and Brain Sciences 3(3):417-457","DOI:10.1016/B978-1-4832-1446-7.50007-8"],"references":["294496874_On_perceptual_aboutness","284421079_A_neuropsychological_comparison_between_man_chimpanzee_and_monkey","249258180_What_Is_an_Intentional_State","247370528_Haugeland's_first_hurdle","247050082_On_the_Uniqueness_of_Semantic_Mapping","232500067_Residual_subjectivity","227211854_Reasons_For_Realism","223263664_The_Intentionality_of_Intention_and_Action","18779399_A_Computer_Model_for_the_Perception_of_Syntactic_Structure"]}