{"id":"272164813_Optimization_of_Running_Strategies_Based_on_Anaerobic_Energy_and_Variations_of_Velocity","abstract":"The aim of this work is to present a model relying on a system of ordinary differential equations describing the evolution of the anaerobic energy and the velocity of a runner. We perform numerical simulations and rigorous analysis to deduce an optimal running strategy. Our model relies on the fundamental principle of dynamics, energy conservation, a hydraulic analogy, and control conditions. We take into account the resistive force, the propulsive force, and the variations in the volume of oxygen used per unit time. Our main result is to show that varying one's velocity rather than running at a constant velocity allows one to run longer. Using optimal control theory, we present proofs on the structure of the optimal race and relate the problem to a relaxed formulation, where the propulsive force represents a probability distribution rather than a function of time. Our mathematical analysis leads us to introduce a bound on the variations of the propulsive force to obtain a more realistic model which displays oscillations of the velocity. We also present numerical simulations of our system which qualitatively reproduce quite well physiological measurements on real runners. We show how, by optimizing over a period, we recover the oscillations of speed.","authors":["Amandine Aftalion","Frédéric J Bonnans"],"meta":["October 2014SIAM Journal on Applied Mathematics 74(5):1615-1636","DOI:10.1137/130932697"],"references":["262098198_BOCOP_-_A_collection_of_examples","324457860_Optimal_Velocity_in_a_Race","301362113_On_the_Implementation_of_an_Interior-Point_Filter_Line-Search_Algorithm_for_Large-Scale_Nonlinear_Programming","279365330_Perturbation_Analysis_of_Optimization_Problems","268663768_Applications_to_regular_and_bang-bang_control_Second-order_necessary_and_sufficient_optimality_conditions_in_calculus_of_variations_and_optimal_control","267664302_Geometric_Optimal_Control_Theory_Methods_and_Examples","266314500_A_geometric_approach_to_optimal_control","265916232_Optimal_Velocity_in_a_Race","265664673_Convex_analysis_and_variational_problems_Translated_by_Minerva_Translations_Ltd_London","257119596_Second-order_Analysis_for_Optimal_Control_Problems_with_Pure_State_Constraints_and_Mixed_Control-State_Constraints"]}