{"id":"272183345_Automatic_Optimization_of_Hardware_Accelerators_for_Image_Processing","abstract":"In the domain of image processing, often real-time constraints are required.\nIn particular, in safety-critical applications, such as X-ray computed\ntomography in medical imaging or advanced driver assistance systems in the\nautomotive domain, timing is of utmost importance. A common approach to\nmaintain real-time capabilities of compute-intensive applications is to offload\nthose computations to dedicated accelerator hardware, such as Field\nProgrammable Gate Arrays (FPGAs). Programming such architectures is a\nchallenging task, with respect to the typical FPGA-specific design criteria:\nAchievable overall algorithm latency and resource usage of FPGA primitives\n(BRAM, FF, LUT, and DSP). High-Level Synthesis (HLS) dramatically simplifies\nthis task by enabling the description of algorithms in well-known higher\nlanguages (C/C++) and its automatic synthesis that can be accomplished by HLS\ntools. However, algorithm developers still need expert knowledge about the\ntarget architecture, in order to achieve satisfying results. Therefore, in\nprevious work, we have shown that elevating the description of image algorithms\nto an even higher abstraction level, by using a Domain-Specific Language (DSL),\ncan significantly cut down the complexity for designing such algorithms for\nFPGAs. To give the developer even more control over the common trade-off,\nlatency vs. resource usage, we will present an automatic optimization process\nwhere these criteria are analyzed and fed back to the DSL compiler, in order to\ngenerate code that is closer to the desired design specifications. Finally, we\ngenerate code for stereo block matching algorithms and compare it with\nhandwritten implementations to quantify the quality of our results.","authors":["Oliver Reiche","Konrad Häublein","Marc Reichenbach","Frank Hannig"],"meta":["March 2015","Conference: DATE 2015, Workshop Heterogeneous Architectures and Design Methods for Embedded Image Systems"],"references":["264936537_Code_Generation_for_High-Level_Synthesis_of_Multiresolution_Applications_on_FPGAs","259095078_Fast_image_processing_for_optical_metrology_utilizing_heterogeneous_computer_architectures","221405427_PARO_Synthesis_of_Hardware_Accelerators_for_Multi-Dimensional_Dataflow-Intensive_Applications","286591737_An_image_processing_library_for_C-based_high-level_synthesis","275338891_Fast_and_Generic_Hardware_Architecture_for_Stereo_Block_Matching_Applications_on_Embedded_Systems","271556972_Real-time_range_image_preprocessing_on_FPGAS","271497811_Code_generation_for_embedded_heterogeneous_architectures_on_android","265170029_Towards_a_performance-portable_description_of_geometric_multigrid_algorithms_using_a_domain-specific_language","221477888_An_Automated_Face_Recognition_System_for_Intelligence_Surveillance_Smart_Camera_Recognizing_Faces_in_the_Crowd","4022931_High-accuracy_stereo_depth_maps_using_structured_light"]}