{"id":"272164429_Towards_a_framework_for_the_design_of_mixed_reality_immersive_education_spaces","abstract":"Immersive Education is moving beyond just the use of virtual worlds to\nbecome more embedded into the physical world around us. Some attempts have\nbeen made to characterize this mixed reality space along a virtuality continuum,\nwith a particular focus on the interface between real and virtual worlds and the\nemergence of inter-reality applications where virtual reality systems are coupled\nwith real-world objects. Some researchers have proposed frameworks that aim to\nunderstand the affordances of 3-dimensional (3D) virtual environments. However,\nthere is little support for practitioners and designers in creating mixed-reality\neducation spaces. This paper attempts to address this issue by using an Augmented\nReality learning scenario as the initial basis for the creation of an initial design\nframework that aims to characterize the learning benefits (or affordances) of this\ntechnology. This is then used to identify the technical challenges which underpin\nmixed-reality learning spaces, and where possible, supporting pedagogical\nframeworks, which can be used to guide the design process. Finally we suggest the\nfuture steps necessary to move this work forward, from an initial outline\nframework, with the intention of developing a practical tool to help practitioners\nand researchers make informed choices in this emerging field.","authors":["JB ELLIOTT","Michael Gardner","Malek Alrashidi"],"meta":["November 2012","Conference: 2nd European Immersive Education SummitAt: Paris, FranceVolume: 63-76"],"references":["261027505_Towards_the_Next_Generation_of_Learning_Environments_An_InterReality_Learning_Portal_and_Model","254200886_The_InterReality_Portal_A_Mixed_Reality_Co_creative_Intelligent_Learning_Environment","252980570_Learning_in_Technology_Reconceptualizing_Immersive_Environments","231514051_A_Taxonomy_of_Mixed_Reality_Visual_Displays","228634517_An_Educational_Psychology_Success_Story_Social_Interdependence_Theory_and_Cooperative_Learning","226694356_End-user_Customisation_of_Intelligent_Environments","260410978_Virtual_reality_and_learning_Where_is_the_pedagogy_Learning_activities_in_3-D_virtual_worlds","256937806_Handheld_Augmented_Reality_involving_gravity_measurements","251787428_From_Content_to_Context_Videogames_as_Designed_Experience","226873200_Toward_a_Design_Theory_of_Problem_Solving"]}