{"id":"272164853_What_Is_an_Emerging_Technology","abstract":"There is considerable and growing interest in the emergence of novel technologies, especially from the policy-making perspective. Yet as an area of study, emerging technologies lacks key foundational elements, namely a consensus on what classifies a technology as ’emergent’ and strong research designs that operationalize central theoretical concepts. The present paper aims to fill this gap by developing a definition of ’emerging technologies’ and linking this conceptual effort with the development of a framework for the operationalisation of technological emergence. The definition is developed by combining a basic understanding of the term and in particular the concept of ’emergence’ with a review of key innovation studies dealing with definitional issues of technological emergence. The resulting definition identifies five attributes that feature in the emergence of novel technologies. These are: (i) radical novelty, (ii) relatively fast growth, (iii) coherence, (iv) prominent impact, and (v) uncertainty and ambiguity. The framework for operationalising emerging technologies is then elaborated on the basis of the proposed attributes. To do so, we identify and review major empirical approaches (mainly in, although not limited to, the scientometric domain) for the detection and study of emerging technologies (these include indicators and trend analysis, citation analysis, co-word analysis, overlay mapping, and combinations thereof) and elaborate on how these can be used to operationalise the different attributes of emergence.","authors":["Daniele Rotolo","Diana Hicks","Ben Martin"],"meta":["December 2015Research Policy 44(10):1827-1843","DOI:10.1016/j.respol.2015.06.006"],"references":["315026675_What_is_Technology_Six_Definitions_and_Two_Pathologies","289211064_Science_Overlay_Maps_A_New_Tool_for_Research_Policy_and_Library_Management","313627530_The_import_of_uncertainty","313621056_Bibliometric_techniques_for_monitoring_performance_in_strategic_research_The_case_of_integrated_optics","313619746_Weak_emergence","313215740_On_user_needs_and_need_determination_Aspects_of_the_theory_of_technological_innovation","312913768_Strong_and_weak_emergence","290938078_Architectural_innovation_The_reconfiguration_of_existing_product_technologies_and_the_failure_of_established_firms","290013189_Tracking_and_predicting_growth_areas_in_science","288945826_Divergence_measures_based_on_the_Shannon_entropy"]}