{"id":"272174763_Analysis_and_Visualization_of_Citation_Networks","abstract":"Citation analysis—the exploration of reference patterns in the scholarly and scientific literature—has long been applied in a number of social sciences to study research impact, knowledge flows, and knowledge networks. It has important information science applications as well, particularly in knowledge representation and in information retrieval.\n\nRecent years have seen a burgeoning interest in citation analysis to help address research, management, or information service issues such as university rankings, research evaluation, or knowledge domain visualization. This renewed and growing interest stems from significant improvements in the availability and accessibility of digital bibliographic data (both citation and full text) and of relevant computer technologies. The former provides large amounts of data and the latter the necessary tools for researchers to conduct new types of large-scale citation analysis, even without special access to special data collections. Exciting new developments are emerging this way in many aspects of citation analysis.\n\nThis book critically examines both theory and practical techniques of citation network analysis and visualization, one of the two main types of citation analysis (the other being evaluative citation analysis). To set the context for its main theme, the book begins with a discussion of the foundations of citation analysis in general, including an overview of what can and what cannot be done with citation analysis (Chapter 1). An in-depth examination of the generally accepted steps and procedures for citation network analysis follows, including the concepts and techniques that are associated with each step (Chapter 2). Individual issues that are particularly important in citation network analysis are then scrutinized, namely: field delineation and data sources for citation analysis (Chapter 3); disambiguation of names and references (Chapter 4); and visualization of citation networks (Chapter 5). Sufficient technical detail is provided in each chapter so the book can serve as a practical how-to guide to conducting citation network analysis and visualization studies.\n\nWhile the discussion of most of the topics in this book applies to all types of citation analysis, the structure of the text and the details of procedures, examples, and tools covered here are geared to citation network analysis rather than evaluative citation analysis. This conscious choice was based on the authors’ observation that, compared to evaluative citation analysis, citation network analysis has not been covered nearly as well by dedicated books, despite the fact that it has not been subject to nearly as much severe criticism and has been substantially enriched in recent years with new theory and techniques from research areas such as network science, social network analysis, or information visualization.","authors":["Dangzhi Zhao","Andreas Strotmann"],"meta":["February 2015Synthesis Lectures on Information Concepts Retrieval and Services 7(1)","DOI:10.2200/S00624ED1V01Y201501ICR039","Publisher: Morgan & ClaypoolEditor: Gary Marchionini"],"references":["308623991_Evaluative_bibliometrics_The_use_of_publication_and_citation_analysis_in_the_Evaluation_of_Scientific","298808287_Mapping_the_Structure_and_Evolution_of_Chemistry_Research","327815431_Author_Co-citation_Analysis_Using_Custom_Bibliographic_Databases_An_Introduction_to_the_SAS_Approach","316799442_Studies_in_Operational_Regional_Science","306204769_Reconciling_structure_and_process_in_the_study_of_scholarly_communication","300258632_Norms_of_Inquiry_Rationality_Consistency_Requirements_and_Normative_Conflict","285069397_Citation_context_analysis","279888650_Collaborative_research_in_the_social_sciences_Multiple_authorship_and_publication_credit","278000960_Relevance_of_Library_Collections_for_Graduate_Student_Research_A_Citation_Analysis_Study_of_Doctoral_Dissertations_at_Notre_Dame","272562330_The_Group_Structure_of_Cocitation_Clusters_A_Comparative_Study"]}