{"id":"272238126_Automatic_Accompaniment_to_Arab_Vocal_Improvisation_Mawwal","abstract":"INTRODUCTION \n“Mawwāl” is an Arab term that refers to the traditional/classical vocal improvisation of the Middle East and North Africa. It is a non-metric form that is usually applied to narrative poetry. It is usually preceded by a short instrumental improvisation or composition as a preparatory phase to develop the sense of “Saltanah” (modal ecstasy). In the Mawwāl, the singer demonstrates his/her talent and expertise while the instrumentalists attempt to provide support to the singer. The instrumentalists accomplish this by following the lead during each improvised phrase, and by recapitulating the phrase upon its \ncompletion. In addition, the instrumentalists add their own aesthetic touches on what they follow (Racy, 1998) and (Maqām World, 2012). The liveliness and the interactivity––between the improviser, the instrumentalists as well as with the audience––are among reasons why this form gains much admire and influence on listeners. \n\nThis thesis presents a computer application that receives a monophonic vocal input and returns a full ensemble mix. The application consists of four sequential units: music information retrieval (MIR), composition, expressive performance emulation and effects. The MIR unit extracts the basic musical information such as the pitch contour and analyze it afterwards. The composition unit uses the MIR analysis to control the algorithmic composition of several accompanying tracks. In the expressive performance emulation unit, several common Arab ornaments and articulations are added to the generated notes before playing them back using the sample-sequencing technique. Whether in analysis, composition or in expressive performance emulation, Arab music theory and practice are used as references during algorithms' design. In the last unit, the auditory scene is improved via audio effects, mainly the multi-delay and reverberation. The accompaniment model is designed for use as a web application for this would expand usability, and allow future updating without confusing its users. \n\nArab music has great aesthetics and deserve to be disseminated among the young generation. While several accompaniment models have been presented for western musical forms since the mid-eighties (Christopher Raphael 2004) my research have not found a specific model dedicated to an Arab form, such as the Mawwāl. Arab music features interesting qualities that can be really challenging for such an application. Examples includes: rich ornamentation, wide vibrato, on stage improvised embellishments, quarter tone intervals, large number of modes and related formulas, lack of relevant literature, etc. \nThese challenging qualities would limit the performance of the basic control unit, the MIR unit. This is partially because pitch tracking is a block-based process, and there is always a trade-off between the accuracy of the onset and duration in one hand and the pitch in another hand. \n\nIn contrast, there are several qualities that might simplify developing successful applications. Examples include the heterophonic nature of Arab music and the common slight asynchronization between notes' onsets due to rich ornamentation. The latter quality, indeed, is necessarily stressed when accompanying a vocal improvisation, Mawwāl. Such qualities permit, to some extent, tolerating non-confident results when provided by the MIR unit, mainly in pitch tracking and onset detection. In addition to cultural and \nprofessional motivations, there is a social motivation as well.\n\nA web application providing a decent accompaniment to Mawwāl performance might be a pleasant way to share talent, poetry, and ideas among people. This idea is backed up by the fact that the complexity of the Mawwāl is subject to the performer. To some extent, anybody can perform a Mawwāl, at least a simple narrow-range phrase(s). \n\nThe following chapter, background, reviews literature in the domain of automatic accompaniment systems. It also introduces the Java music systems used in the development of this accompaniment web application. In addition, it discusses some related aspects in Arab music theory. Chapter three presents the four system units in details, and chapter four discusses results, conclusions and future work.","authors":["Fadi M. Al-Ghawanmeh"],"meta":["January 2013","DOI:10.13140/2.1.4210.7689","Thesis for: Master's of Music in Music TechnologyAdvisor: Dr. Morwaread Farbood"],"references":["311886644_maqamat_in_contemporary_songs","272170290_thlyl_wastkhlas_alkhsays_almwsyqyt_lnghmat_alt_alnay_alrby_Analysis_and_Features_Recognition_of_Arabian_Flute_Nay_Musical_Tones","267295661_INCORPORATING_FEATURES_OF_DISTRIBUTION_AND_PROGRESSION_FOR_AUTOMATIC_MAKAM_CLASSIFICATION","254021088_Real-time_Melodic_Accompaniment_System_for_Indian_Music_Using_TMS320C6713","242155298_REAL-TIME_TIME_DOMAIN_PITCH_TRACKING_USING_WAVELETS","261663096_Musical_Accompaniment_Systems","254720913_Java_Music_Specification_Language_an_introduction_and_overview","252032950_Development_of_improved_automatic_music_transcription_system_for_the_arabian_flute_NAY","249979666_Aural_Analysis_of_Arabic_Improvised_Instrumental_Music_Taqsm","242748167_Automatic_accompaniment_for_improvised_music","233686483_Educational_tools_based_on_MIR_system_for_Arabian_woodwinds","228841876_An_Automatic_Jazz_Accompaniment_System_Reacting_to_Solo","228659447_Automatic_classification_of_Turkish_traditional_art_music_recordings_by_Arel_theory","228588073_JSyn_-_A_Real-time_Synthesis_API_for_Java","221618351_Harmonising_Chorales_by_Probabilistic_Inference"]}