{"id":"272200982_Diversity_of_references_as_an_indicator_of_the_interdisciplinarity_of_journals_Taking_similarity_between_subject_fields_into_account","abstract":"The objective of this article is to further the study of journal interdisciplinarity, or, more generally, knowledge integration at the level of individual articles. Interdisciplinarity is operationalized by the diversity of subject fields assigned to cited items in the article's reference list. Subject fields and subfields were obtained from the Leuven-Budapest (ECOOM) subject-classification scheme, while disciplinary diversity was measured taking variety, balance, and disparity into account. As diversity measure we use a Hill-type true diversity in the sense of Jost and Leinster-Cobbold. The analysis is conducted in 3 steps. In the first part, the properties of this measure are discussed, and, on the basis of these properties it is shown that the measure has the potential to serve as an indicator of interdisciplinarity. In the second part the applicability of this indicator is shown using selected journals from several research fields ranging from mathematics to social sciences. Finally, the often-heard argument, namely, that interdisciplinary research exhibits larger visibility and impact, is studied on the basis of these selected journals. Yet, as only 7 journals, representing a total of 15,757 articles, are studied, albeit chosen to cover a large range of interdisciplinarity, further research is still needed.","authors":["Lin Zhang","Ronald Rousseau","Wolfgang Glänzel"],"meta":["March 2015Journal of the Association for Information Science and Technology 67(5)","DOI:10.1002/asi.23487","Project: NSFC Project: Measurements of Interdisciplinarity: Knowledge Sources, Information Linkages, and Collaboration activity (71573085)"],"references":["235272203_A_framework_for_knowledge_integration_and_diffusion_Journal_of_Documentation_681_31-44","282615876_On_the_relationship_between_interdisciplinary_and_scientific_impact","279585905_The_Lorenz_curve_A_graphical_representation_of_evenness","276942517_Interdisciplinary_research_-_Meaning_metrics_and_nurture_Research_Evaluation_153_187-195","260135705_Measuring_Biological_Diversity","255823392_A_general_framework_for_describing_diversity_within_systems_and_similarity_between_systems_with_applications_in_informetrics","247504794_Facing_Diversity_of_Science_A_Challenge_for_Bibliometric_Indicators","246796826_The_Measurement_of_Inequality_of_Income","230220838_Jost_L_Entropy_and_diversity_Oikos","227205516_Measuring_Biodiversity"]}