{"id":"272223834_Finishing_mill_thread_speed_set-up_and_control_by_interval_type_1_non-singleton_type_2_fuzzy_logic_systems","abstract":"The set-up of the finishing mill (FM) thread speed to achieve the desired strip temperature as measured by the finish mill delivery temperature sensor is made by an intelligent controller based on interval type 2 fuzzy logic system. The controller calculates the FM thread speed required to achieve the strip FM exit target temperature, and the interstand strip surface temperature profiles. The interval type 2 fuzzy set-up controller uses as inputs the predicted transfer bar FM entry temperature, the transfer bar thickness, the target strip FM exit temperature, the target strip FM exit gauge, last stand draft reduction, last stand work roll diameter, last stand rolling force, %C of strip, and target width. Taking into account that the measurements are modelled as type 1 non-singleton fuzzy numbers, the authors present the so called interval type 1 non-singleton type 2 fuzzy logic system controllers. As reported in the literature, interval type 2 fuzzy logic systems have greater approximation capacity than that of its type 1 counterpart and it has the advantage to develop more robust and reliable solutions than the latter. The experiments of these applications were carried out for three different types of coils, from a real hot strip mill. The results proved the feasibility of the developed system for FM thread speed set-up and control, and for interstand strip temperature profile prediction. Comparisons with the online mathematical based models show that the proposed interval type 2 fuzzy logic system equalises the performance in FM strip thread speed, and temperature set-up and control under the tested conditions characterised by high uncertainty levels.","authors":["Gerardo Maximiliano Mendez","Rafael Colás","Luis Adolfo Leduc Lezama","I. Lopez-Juarez"],"meta":["July 2012Ironmaking & Steelmaking 39(5):342-354","DOI:10.1179/1743281211Y.0000000083","Project: Industrial Control"],"references":["265063214_Adaptive_Non-singleton_Type-2_Fuzzy_Logic_Systems_A_Way_Forward_for_Handling_Numerical_Uncertainties_in_Real_World_Applications","252722080_Type2_TSK_Fuzzy_Logic_System_and_its_Type1_Counterpart","235225225_Interval_Type-2_TSK_Fuzzy_Logic_System_and_Its_Type-1_Counterpart","283329546_Neural_Fuzzy_and_Grey-Box_Modelling_for_Entry_Temperature_Prediction_in_a_Hot_Strip_Mill","257124572_Intelligent_Control_of_Dynamic_Systems_Using_Type-2_Fuzzy_Logic_And_Stability_Issues","251941128_Oxidization_of_Polymer_Si-Fe_Coagulant","250159805_A_New_Mill-setup_System_for_Hot_Strip_Finishing_Mill_Integrating_a_Process_Model_and_Expertise","246350639_Guidelines_for_Evaluating_and_Expressing_the_Uncertainty_of_NIST_Measurement_Results","241171879_Interval_type-2_Boolean_fuzzy_systems_are_universal_approximators","234792211_A_Course_in_Fuzzy_Systems_and_Control"]}