{"id":"272359355_Parameterized_Complexity_of_Secluded_Connectivity_Problems","abstract":"The Secluded Path problem models a situation where a sensitive information\nhas to be transmitted between a pair of nodes along a path in a network. The\nmeasure of the quality of a selected path is its exposure, which is the total\nweight of vertices in its closed neighborhood. In order to minimize the risk of\nintercepting the information, we are interested in selecting a secluded path,\ni.e. a path with a small exposure. Similarly, the Secluded Steiner Tree problem\nis to find a tree in a graph connecting a given set of terminals such that the\nexposure of the tree is minimized. The problems were introduced by Chechik et\nal. in [ESA 2013]. Among other results, Chechik et al. have shown that Secluded\nPath is fixed-parameter tractable (FPT) on unweighted graphs being\nparameterized by the maximum vertex degree of the graph and that Secluded\nSteiner Tree is FPT parameterized by the treewidth of the graph. In this work,\nwe obtain the following results about parameterized complexity of secluded\nconnectivity problems.\nWe give FPT-algorithms deciding if a graph G with a given cost function\ncontains a secluded path and a secluded Steiner tree of exposure at most k with\nthe cost at most C.\nWe initiate the study of \"above guarantee\" parameterizations for secluded\nproblems, where the lower bound is given by the size of a Steiner tree.\nWe investigate Secluded Steiner Tree from kernelization perspective and\nprovide several lower and upper bounds when parameters are the treewidth, the\nsize of a vertex cover, maximum vertex degree and the solution size. Finally,\nwe refine the algorithmic result of Chechik et al. by improving the exponential\ndependence from the treewidth of the input graph.","authors":["Fedor V. Fomin","Petr A. Golovach","Nikolai Karpov","Alexander S. Kulikov"],"meta":["October 2017Theory of Computing Systems 61(3)","DOI:10.1007/s00224-016-9717-x","SourcearXiv"],"references":["311087619_Secluded_Connectivity_Problems","264905604_Secluded_Path_via_Shortest_Path","258726264_Kernelization_Lower_Bounds_By_Cross-Composition","257428612_Fast_Polynomial-Space_Algorithms_Using_Inclusion-Exclusion","316797733_Texts_in_Theoretical_Computer_Science_An_EATCS_Series","313903170_Parameterized_Algorithms","265502171_Fundamentals_of_Parameterized_Complexity","262327703_Deterministic_Single_Exponential_Time_Algorithms_for_Connectivity_Problems_Parameterized_by_Treewidth","261465510_The_thinnest_path_problem_for_secure_communications_A_directed_hypergraph_approach","243787873_Compexity_of_Computer_Computations","233982273_Secluded_Connectivity_Problems","232958986_Solving_weighted_and_counting_variants_of_connectivity_problemsparameterized_by_treewidth_deterministically_in_single_exponential_time","236203734_Efficient_Computation_of_Representative_Sets_with_Applications_in_Parameterized_and_Exact_Algorithms","228057843_Matching_is_as_Easy_as_Matrix_Inversion","228057735_Computers_And_Intractability_A_Guide_to_the_Theory_of_NP-Completeness"]}