{"id":"272321888_Spatiotemporal_data_from_mobile_phones_for_personal_mobility_assessment","abstract":"In this paper, we will review several alternative methods of collecting data from mobile phones for human mobility analysis. We will briefly describe cellular phone network architecture and the location data it can provide, and will discuss two types of data collection: active and passive localization. Active localization is something like a personal travel diary. It provides a tool for recording positioning data on a survey sample over a long period of time. Passive localization, on the other hand, is based on phone network data which are automatically recorded for technical or billing purposes. It offers the advantage of access to very large user populations for mobility flow analysis of a broad area. We propose considering cellular network location data as a useful complementary source for human mobility research and provide case studies to illustrate the advantages and disadvantages of each method.","authors":["Zbigniew Smoreda","Ana-Maria Olteanu Raimond","Thomas Couronné"],"meta":["January 2013","In book: Transport Survey Methods: Best Practice for Decision Making. (pp.745-767)Chapter: 41Publisher: Emerald Group Publishing LimitedEditors: Johanna Zmud, Martin Lee-Gosselin, Juan Antonio Carrasco, Marcela A. Munizaga"],"references":["271738077_Where_you_stop_is_who_you_are_Understanding_people's_activities_by_places_visited","266886783_Utilising_Mobile_Phone_Billing_Records_for_Travel_Mode_Discovery","258516052_Deriving_origin-destination_data_from_a_mobile_phone_network","257098903_Chatty_mobiles_individual_mobility_and_communication_patterns_NetMob_Boston","313203504_Reality_mining_Sensing_complex_social_systems","301958661_The_mobile_data_challenge_Big_data_for_mobile_computing_research","285906826_Understanding_individual_human_mobility_patterns_Nature_2008_453_779-782","285712579_Moving_beyond_observed_outcomes_Integrating_global_positioning_systems_and_interactive_computer-based_travel_behavior_surveys","258600564_Are_we_in_our_travel_decisions_self-determined","252819638_Processing_GPS_Raw_Data_Without_Additional_Information"]}