{"id":"272385805_DROPS_Division_and_Replication_of_Data_in_the_Cloud_for_Optimal_Performance_and_Security","abstract":"Outsourcing data to a third-party administrative control, as is done in cloud computing, gives rise to security concerns. The data compromise may occur due to attacks by other users and nodes within the cloud. Therefore, high security measures are required to protect data within the cloud. However, the employed security strategy must also take into account the optimization of the data retrieval time. In this paper, we propose division and replication of data in the cloud for optimal performance and security (DROPS) that collectively approaches the security and performance issues. In the DROPS methodology, we divide a file into fragments, and replicate the fragmented data over the cloud nodes. Each of the nodes stores only a single fragment of a particular data file that ensures that even in case of a successful attack, no meaningful information is revealed to the attacker. Moreover, the nodes storing the fragments, are separated with certain distance by means of graph T-coloring to prohibit an attacker of guessing the locations of the fragments. Furthermore, the DROPS methodology does not rely on the traditional cryptographic techniques for the data security; thereby relieving the system of computationally expensive methodologies. We show that the probability to locate and compromise all of the nodes storing the fragments of a single file is extremely low. We also compare the performance of the DROPS methodology with 10 other schemes. The higher level of security with slight performance overhead was observed.","authors":["Mazhar Ali","Kashif Bilal","Samee U. Khan","Bharadwaj Veeravalli"],"meta":["January 2015IEEE Transactions on Cloud Computing 6(99):1-1","DOI:10.1109/TCC.2015.2400460"],"references":["273348630_SeDaSC_Secure_data_sharing_in_clouds","272373406_Security_in_Cloud_Computing_Opportunities_and_Challenges","271891328_Surveying_and_Analyzing_Security_Privacy_and_Trust_Issues_in_Cloud_Computing_Environments","269304402_Energy-efficient_data_replication_in_cloud_computing_datacenters","264580090_On_the_Characterization_of_the_Structural_Robustness_of_Data_Center_Networks","292020949_Data_security_in_the_world_of_cloud_computing","280566512_Networks_An_Introduction","266208389_Virtualization-aware_Access_Control_for_Multitenant_Filesystems","264920260_Networks_An_Introduction","262292007_New_approaches_to_security_and_availability_for_cloud_data"]}