{"id":"272405475_On_the_use_of_helium-filled_soap_bubbles_for_large-scale_tomographic_PIV_in_wind_tunnel_experiments","abstract":"The flow-tracing fidelity of sub-millimetre diameter helium-filled soap bubbles (HFSB) for low-speed\naerodynamics is studied. The main interest of using HFSB in relation to micron-size droplets is the large amount of scattered light, enabling larger-scale three-dimensional experiments by tomographic PIV. The assessment of aerodynamic behaviour closely follows the method proposed in the early work of Kerho and Bragg (Exp Fluids\n50:929–948, 1994) who evaluated the tracer trajectories around the stagnation region at the leading edge of an airfoil. The conclusions of the latter investigation differ from the present work, which concludes sub-millimetre HFSB do represent a valid alternative for quantitative velocimetry in wind tunnel aerodynamic experiments. The flow stagnating ahead of a circular cylinder of 25 mm diameter is considered at speeds up to 30 m/s. The tracers are injected in the free-stream and high-speed PIV, and PTV are used to obtain the velocity field distribution. A qualitative assessment based on streamlines is followed by acceleration and slip velocity measurements using PIV experiments with fog droplets as a term of reference. The tracing fidelity is controlled by the flow rates of helium, liquid soap and air in HFSB production. A characteristic time response, defined as the ratio of slip velocity and the fluid acceleration, is obtained. The feasibility of performing\ntime-resolved tomographic PIV measurements over large volumes in aerodynamic wind tunnels is also studied. The flow past a 5-cm-diameter cylinder is measured over a volume of 20 × 20 × 12 cm3\nat a rate of 2 kHz. The achieved seeding density of <0.01 ppp enables resolving the Kármán vortices, whereas turbulent substructures cannot be captured.","authors":["Fulvio Scarano","Sina Ghaemi","Giuseppe Carlo Alp Caridi","Johannes Bosbach"],"meta":["February 2015Experiments in Fluids 56(2):42","DOI:10.1007/s00348-015-1909-7","Project: large scale particle image velocimetry"],"references":["321614380_Particle_Image_Velocimetry_A_Practical_Guide","267961282_Influence_of_number_of_cameras_and_preprocessing_for_thick_volume_Tomographic_PIV","266163175_Reconstructing_the_vortex_skeleton_of_the_desert_locust_using_phase_averaged_POD_approximations_from_time_resolved_thin_volume_tomographic_PIV","264351789_Experimental_determination_of_tomographic_PIV_accuracy_by_a_12-camera_system","258294865_Tomographic_PIV_Principles_and_practice","321251191_Three_dimensional_particle_streak_tracking_PST_velocity_measurements_Experiments_in_Fluids","279541260_Experimental_characterization_of_airflows_in_aircraft_cabins_Part_I_Experimental_system_and_measurement_procedure","270935814_Experimental_analysis_of_the_wake_of_a_horizontal-axis_wind-turbine_model","256742184_On_the_estimation_of_wall_pressure_coherence_using_time-resolved_tomographic_PIV","245427539_Helium_bubble_survey_of_an_opening_parachute"]}