{"id":"272478674_Plotting_partial_correlation_and_regression_in_ecological_studies","abstract":"Multiple regression, the General linear model (GLM) and the Generalized linear model (GLZ) are widely used in ecology. The widespread use of graphs that include fitted regression lines to document patterns in simple linear regression can be easily extended to these multivariate techniques in plots that show the partial relationship of the dependent\nvariable with each independent variable. However, the latter procedure is not nearly as widely used in ecological studies. In fact, a brief review of the recent ecological literature showed that in ca 20% of the papers the results of multiple regression are displayed by plotting the dependent variable against the raw values of the independent variable. This latter procedure may be misleading because the value of the partial slope may change in magnitude and even in sign relative to the slope obtained in simple least-squares regression. Plots of partial relationships should be used in these situations. Using numerical simulations and real data we show how displaying plots of partial relationships may also be useful for: 1) visualizing the true scatter of points around the partial regression line, and 2) identifying influential observations and non-linear patterns more efficiently than using plots of residuals vs fitted values. With the aim to help in the assessment of data quality, we show how partial residual plots (residuals from overall model + predicted values from the explanatory variable vs the explanatory variable) should only be used in restricted situations, and how partial regression plots (residuals of Y on the remaining explanatory variables vs residuals of the target explanatory\nvariable on the remaining explanatory variables) should be the ones displayed in publications because they accurately reflect the scatter of partial correlations. Similarly, these partial plots can be applied to visualize the effect of continuous variables in GLM and GLZ for normal distributions and identity link functions.","authors":["Jordi Moya-Laraño","Guadalupe Corcobado"],"meta":["June 2008Web Ecology 8:35","DOI:10.5194/we-8-35-2008"],"references":["314309723_Introduction_to_Linear_Regression_Analysis","313630985_Categorical_data_analysis","302171550_Regression_diagnostics_identifying_data_and_sources_of_collinearity","298063753_On_the_misuse_of_residuals_in_ecology_regression_of_residuals_vs_multiple_regression_vol_71_pg_542_2002","288951965_Applied_Linear_Statistical_Models","278028780_Experimental_Design_and_Data_Analysis_For_Biologists","267067160_Improved_Added_Variable_and_Partial_Residual_Plots_for_the_Detection_of_Influential_Observations_in_Generalized_Linear_Models","264933916_Categorical_Data_Analysis_2nd_Edn","261651191_Residuals_and_Influence_Regression","250076809_Land_use_primary_productivity_and_lake_area_as_descriptors_of_zooplankton_diversity"]}