{"id":"272480994_Multi-stage_LTL_transport_systems_in_supply_chain_management","abstract":"This chapter aims to unify concepts and to describe the multi-stage transport systemsand their integration to supply chain management. Multi-stage distribution systems arecommon in logistics management, and in some cases they can be assimilated to multistagetransport strategies. However, transport is often considered as an external operationor a specific stage, even when it is a multi-stage system. First, the chapter presents themain concepts of multi-stage transport systems by defining the concept and making atypology of transport schemes. Then, an overview and an analysis of the mainoptimization problems and methods for multi-stage LTL transport optimization isproposed.Then, an interview-based analysis is proposed to identify the main socioeconomicissues related to the integration of multi-stage transport on supply chainmanagement and a simulation shows the impacts of multi-stage transport on supply chainglobal costs and quality indicators.","authors":["Jesus Gonzalez-Feliu"],"meta":["April 2013","In book: Logistics: Perspectives, Approaches and Challenges (pp.65-86)Publisher: Nova Science PublishingEditors: Cheung, J.; Song, H"],"references":["280493809_Supply_Chain_Management_Processes_Partnerships_Performance_Chapter_1_Supply_Chain_Management","272565096_Models_and_Methods_for_the_City_Logistics_The_Two-Echelon_Capacitated_Vehicle_Routing_Problem","272481062_Collaborative_Transportation_Sharing_From_Theory_to_Practice_via_a_Case_Study_from_France","271604239_Hybrid_Ant_Colony_Optimization_Algorithm_for_Two_Echelon_Vehicle_Routing_Problem","335776112_Port_Planning_and_Operations","298452280_Intermodal_freight_transport","293316983_Technologies_for_Supporting_Reasoning_Communities_and_Collaborative_Decision_Making_Cooperative_Approaches","280780595_Supply_chain_design_and_analysis_Models_and_methods","279542932_Real-Time_Trailer_Scheduling_for_Crossdock_Operations","268628157_Vehicle_Routing_Methods_and_Studies"]}