{"id":"272446756_Introducing_Web_Accessibility_to_Localization_Students_Implications_for_a_Universal_Web","abstract":"The importance of web accessibility has spread throughout close technical disciplines, leading to new forms of collaboration between that area of study and other related fields, such as internationalization and web localization. Recent investigations have illustrated that web accessibility experts support the involvement of localization professionals in the achievement of a more accessible web for all, especially in the case of the multilingual web. However, most training institutions do not teach yet the basic technical competence on the matter. Within such research framework, over the last two years, a series of seminars on web accessibility have been taught both for undergraduate and graduate translation students at two European universities. The relevance of acquiring web accessibility knowledge and know how was generally welcomed by all participants, who showed a high level of interest and motivation. Data gathered up to date have helped to develop a better informed theoretical framework about the participation of localizers in the web development cycle and their contribution to a universal web.","authors":["Silvia Rodríguez Vázquez"],"meta":["October 2014","DOI:10.1145/2661334.2661414","Conference: 16th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS 2014)At: Rochester, NY, USA"],"references":["272447819_Applying_Accessibility-Oriented_Controlled_Language_CL_Rules_to_Improve_Appropriateness_of_Text_Alternatives_for_Images_an_Exploratory_Study","272446358_Towards_Defining_the_Role_of_Localisation_Professionals_in_the_Achievement_of_Multilingual_Web_Accessibility","258838750_Localization_and_web_accessibility","223999202_A_challenge_to_web_accessibility_metrics_and_guidelines_Putting_people_and_processes_first","221652180_Including_accessibility_within_and_beyond_undergraduate_computing_courses","287413752_Translation_and_Web_Localization","266657816_The_role_of_accessibility_in_a_universal_web","262367503_Multilingual_website_assessment_for_accessibility_A_survey_on_current_practices","262216587_Progress_on_Website_Accessibility"]}