{"id":"272475898_Plates-formes_d'enseignement_a_distance_dans_l'enseignement_superieur_modes_d'appropriation_et_standardisation_des_usages","abstract":"L’intégration des TIC dans l’enseignement supérieur au Maroc est devenue depuis quelques années une des préoccupations majeures de l’Etat marocain. Dans la mesure où les TIC sont considérées comme un vecteur du développement humain et d’accès au monde de l’information et de la connaissance. Ce projet de recherche portant sur l’usage des platesformes au supérieur intervient dans ce contexte et entend s’inscrire dans cette nouvelle dynamique et étudier les usages de ces outils technologiques en contexte universitaire. Le projet a été réalisé en quatre phases : après la formation des enseignants à l’usage des TIC en enseignement, nous avons expérimenté une série de cours en ligne. Ensuite, nous avons mené une enquête auprès des acteurs impliqués dans cette expérimentation et, enfin, nous avons analysé les données recueillies dans cette enquête. Dans ce rapport, nous avons présenté l’expérimentation des cours sur la plateforme claroline, le cadre conceptuel et méthodologique de l’étude, l’enquête menée sous forme de questionnaire aux étudiants et d’entretiens non directifs avec les enseignants. Cette enquête a mis l’accent sur l’accessibilité aux TIC, la représentation de la plateforme et les types d’usage qui se sont développés sur Claroline. Cette enquête a montré que si les étudiants, bien que moins équipés, accueillent favorablement l’usage d’une plateforme d’enseignement à distance dans leur apprentissage, les enseignants sont dans leur majorité réticents à une intégration systématique d’une plateforme d’enseignement à distance dans leurs enseignements.","authors":["Maaroufi Fatiha"],"meta":["September 2012","Project: Resatice 2012"],"references":["270390735_Usage_de_plateformes_d'enseignement_a_distance_dans_l'enseignement_superieur_marocain_avantages_pedagogiques_et_difficultes_d'appropriation","269740161_Retour_critique_sur_la_sociologie_des_usages","267923428_Usages_de_l'Internet_la_pensee-reseaux_et_l'appropriation_d'une_culture_numerique","251849528_APPRENDRE_EN_PRESENCE_ET_A_DISTANCE_A_LA_RECHERCHE_DES_EFFETS_DES_DISPOSITIFS_HYBRIDES","238450878_Apprendre_en_presence_et_a_distance_Une_definition_des_dispositifs_hybrides","222863721_Blended_Learning_Uncovering_Its_Transformative_Potential_in_Higher_Education","355716233_Chapitre_6_Absence_et_presence_dans_la_mediation_pedagogique_ou_comment_faire_circuler_les_signes_de_la_presence","277239708_Le_Support_a_l'Etudiant_en_enseignement_a_distance","269404124_Le_tutorat_dans_l'enseignement_a_distance_Perspectives_et_pistes_de_reflexion","238450867_Penser_une_formation_aux_TIC_Une_professionnalisation_des_acteurs_de_la_formation_formateurs_et_chefs_de_projet"]}