{"id":"272590900_Capacitated_Domination_Problem_Complexity_and_Approximation_Algorithms","abstract":"We consider a local service-requirement assignment problem named capacitated domination from an algorithmic point of view. In this problem, we are given a graph with three parameters defined on each vertex, which are the cost, the capacity, and the demand, of a vertex, respectively. A vertex can be chosen multiple times in order to generate sufficient capacity for the demands of the vertices in its closed neighborhood. The objective of this problem is to compute a demand assignment of minimum cost such that the demand of each vertex is fully-served by some of its closed neighbors without exceeding the amount of capacity they provide. In this paper, we provide complexity results as well as several approximation algorithms to compose a comprehensive study for this problem. First, we provide logarithmic approximations for general graphs which are asymptotically optimal. From the perspective of parameterized complexity, we show that this problem is W[1]-hard with respect to treewidth and solution size. Moreover, we show that this problem is fixed-parameter tractable with respect to treewidth and the maximum capacity of the vertices. The latter result implies a pseudo-polynomial time approximation scheme for planar graphs under a standard framework. In order to drop the pseudo-polynomial factor, we develop a constant-factor approximation for planar graphs, based on a new perspective which we call general ladders on the hierarchical structure of outer-planar graphs. We believe that the approach we use can be applicable to other capacitated covering problems.","authors":["Mong-Jen Kao","Han-Lin Chen","D. T. Lee"],"meta":["January 2013Algorithmica 72(1)","DOI:10.1007/s00453-013-9844-6"],"references":["266186200_Linear-Time_Computation_of_a_Linear_Problem_Kernel_for_Dominating_Set_on_Planar_Graphs","316800486_Monographs_in_Computer_Science","313726837_Combinatorial_optimization_of_graphs_of_bounded_treewidth","289954347_On_embedding_an_outer-planar_graph_in_a_point_set","277473416_A_Linear-Time_Algorithm_for_Finding_Tree-Decompositions_of_Small_Treewidth","273001794_Approximation_Algorithms","263906229_A_SIMPLE_HEURISTIC_FOR_MINIMUM_CONNECTED_DOMINATING_SET_IN_GRAPHS","262394007_Covering_Problems_with_Hard_Capacities","262210644_Simpler_Linear-Time_Kernelization_for_Planar_Dominating_Set","257650163_Invitation_to_Fixed-Parameter_Algorithms"]}