{"id":"272572214_Rethinking_the_role_of_algorithms_in_school_mathematics_a_conceptual_model_with_focus_on_cognitive_development","abstract":"Starting from the context of mathematics learning in the East and West, this paper discusses the position and role of algorithms within school mathematics and argues that learning of algorithms has suffered from an alleged dichotomy between procedures and understanding, in that algorithms have been associated with low-level cognition. The paper first introduces a broad perspective about algorithms in school mathematics, and then, partially drawing on Bloom’s taxonomy and Säljö’s categorization of learning, proposes a model for the learning of algorithms with focus on students’ cognitive development. The model consists of three cognitive levels: (1) Knowledge and Skills, (2) Understanding and Comprehension, and (3) Evaluation and Construction. The model suggests that the learning of algorithms does not simply imply a low level of cognition, and provides a new perspective and framework to analyse the learning of algorithms. Following the model, we present examples to demonstrate the three levels and discuss related teaching strategies. We propose that the model can be used as an analysis tool to reconceptualize the role of algorithms in school mathematics and pose some questions for further research and scholarly discourse in this direction.","authors":["Lianghuo Fan","Christian Bokhove"],"meta":["July 2014ZDM: the international journal on mathematics education 46(3):481-492","DOI:10.1007/s11858-014-0590-2"],"references":["336088876_What_is_Effective_Mathematics_Teaching_International_Educators'_Judgments_of_Mathematics_Lessons_from_the_TIMSS_1999_Video_Study","324459442_Computer_Science_and_its_Relation_to_Mathematics","320243678_Mathematics_Education_in_East_Asia_and_the_West_Does_Culture_Matter","317953584_Adding_it_up_Helping_children_learn_mathematics","313749719_The_Two_Basics_Mathematics_Teaching_and_Learning_in_Mainland_China","313246645_A_new_algorithm_for_division_of_polynomials","313166203_Memorising_and_understanding_the_keys_to_the_paradox","300140651_Implementing_Self-Assessment_to_Develop_Reflective_Teaching_and_Learning_in_Mathematics","289963502_Conceptual_and_procedural_knowledge_in_mathematics_An_introductory_analysis","289339930_How_we_learn_Learning_and_non-learning_in_school_and_beyond"]}