{"id":"272569158_Camera_model_identification_based_on_DCT_coefficient_statistics","abstract":"The goal of this paper is to design a statistical test for the camera model identification problem from JPEG images. The approach focuses on extracting information in Discrete Cosine Transform (DCT) domain. The main motivation is that the statistics of DCT coefficients change with different sensor noises combining with various in-camera processing algorithms. To accurately capture this information, this paper relies on the state-of-the-art model of DCT coefficients proposed in our previous work. The DCT coefficient model is characterized by two parameters . The parameters that characterize the simplified relation between these parameters are exploited as camera fingerprint for camera model identification. The camera model identification problem is cast in the framework of hypothesis testing theory. In an ideal context where all model parameters are perfectly known, the Likelihood Ratio Test is presented and its performances are theoretically established. For a practical use, two Generalized Likelihood Ratio Tests are designed to deal with unknown model parameters such that they can meet a prescribed false alarm probability while ensuring a high detection performance. Numerical results on simulated and real JPEG images highlight the relevance of the proposed approach.","authors":["Thanh Hai Thai","Florent Retraint","Rémi Cogranne"],"meta":["February 2015Digital Signal Processing 40(1)","DOI:10.1016/j.dsp.2015.01.002"],"references":["284015321_Camera_model_identification_based_on_the_generalized_noise_model_in_natural_images","274406753_Generalized_signal-dependent_noise_model_and_parameter_estimation_for_natural_images","277496116_Information_Forensics_An_Overview_of_the_First_Decade","271463285_Steganalysis_of_Jsteg_algorithm_based_on_a_novel_statistical_model_of_quantized_DCT_coefficients","262171250_Camera_Model_Identification_Based_on_the_Characteristic_of_CFA_and_Interpolation","261443551_Statistical_Model_of_Quantized_DCT_Coefficients_Application_in_the_Steganalysis_of_Jsteg_Algorithm","261387555_Statistical_model_of_natural_images","258635347_Camera_Model_Identification_Based_on_the_Heteroscedastic_Noise_Model","251604663_Using_decision_fusion_of_feature_selection_in_digital_forensics_for_camera_source_model_identification","243620229_Accurate_Approximations_for_Posterior_Moments_and_Marginal_Densities"]}