{"id":"272543487_Some_Simple_Economics_of_Crowdfunding","abstract":"It is not surprising that the financing of early-stage creative projects and ventures is typically geographically localized since these types of funding decisions are usually predicated on personal relationships and due diligence requiring face-to-face interactions in response to high levels of risk, uncertainty, and information asymmetry. So, to economists, the recent rise of crowdfunding—raising capital from many people through an online platform—which offers little opportunity for careful due diligence and involves not only friends and family but also many strangers from near and far, is initially startling. On the eve of launching equity-based crowdfunding, a new market for early-stage finance in the United States, we provide a preliminary exploration of its underlying economics. We highlight the extent to which economic theory, in particular transaction costs, reputation, and market design, can explain the rise of nonequity crowdfunding and offer a framework for speculating on how equity-based crowdfunding may unfold. We conclude by articulating open questions related to how crowdfunding may affect social welfare and the rate and direction of innovation.","authors":["Ajay Agrawal","Christian Catalini","Avi Goldfarb"],"meta":["January 2014NBER/Innovation Policy and the Economy 14(1):63-97","DOI:10.1086/674021","Project: crowdfunding"],"references":["258122991_The_Rise_and_Decline_of_an_Open_Collaboration_System_How_Wikipedia's_Reaction_to_Popularity_Is_Causing_Its_Decline","298067636_What_Do_Entrepreneurs_Pay_for_Venture_Capital_Affiliation","288264966_Reputation_on_the_Internet","261979790_Rational_Herding_in_Microloan_Markets","260162346_Resources_as_Dual_Sources_of_Advantage_Implications_for_Valuing_Entrepreneurial-Firm_Patents","259926713_How_Do_Product_Users_Influence_Corporate_Invention","256052881_Crowdfunding_Creative_Ideas_The_Dynamics_of_Project_Backers_in_Kickstarter","256036398_Signaling_in_Equity_Crowdfunding","256021946_The_Dynamics_of_Crowdfunding_Determinants_of_Success_and_Failure","256015833_Financing_from_Friends_and_Family"]}