{"id":"272524233_Neverlang_A_framework_for_feature-oriented_language_development","abstract":"Reuse in programming language development is an open research problem. Many authors have proposed frameworks for modular language development. These frameworks focus on maximizing code reuse, providing primitives for componentizing language implementations. There is also an open debate on combining feature-orientation with modular language development. Feature-oriented programming is a vision of computer programming in which features can be implemented separately, and then combined to build a variety of software products. However, even though feature-orientation and modular programming are strongly connected, modular language development frameworks are not usually meant primarily for feature-oriented language definition. In this paper we present a model of language development that puts feature implementation at the center, and describe its implementation in the Neverlang framework. The model has been evaluated through several languages implementations: in this paper, a state machine language is used as a means of comparison with other frameworks, and a JavaScript interpreter implementation is used to further illustrate the benefits that our model provides.","authors":["Edoardo Vacchi","Walter Cazzola"],"meta":["February 2015Computer Languages Systems & Structures 43","DOI:10.1016/j.cl.2015.02.001","Project: Neverlang"],"references":["292340900_Towards_User-Friendly_Projectional_Editors","266661846_A_Domain-Specific_Language_for_Building_Self-Optimizing_AST_Interpreters","264730849_Automating_Variability_Model_Inference_for_Component-Based_Language_Implementations","321061618_DSLs_In_Action","305262908_Regular_right-part_attribute_grammars","291039118_Model-Based_Language_Engineering_with_EMFText","271335554_An_On-the-Fly_Grammar_Modification_Mechanism_for_Composing_and_Defining_Extensible_Languages","270650820_A_type-safe_embedding_of_SQL_into_Java_using_the_extensible_compiler_framework_J","264922652_EMF_Eclipse_Modeling_Framework_20_2nd_Edition","262525893_On_the_Incremental_Growth_and_Shrinkage_of_LR_Goto-Graphs"]}