{"id":"272521197_Facility_location_with_double-peaked_preference","abstract":"We study the problem of locating a single facility on a real line based on\nthe reports of self-interested agents, when agents have double-peaked\npreferences, with the peaks being on opposite sides of their locations. We\nobserve that double-peaked preferences capture real-life scenarios and thus\ncomplement the well-studied notion of single-peaked preferences. We mainly\nfocus on the case where peaks are equidistant from the agents' locations and\ndiscuss how our results extend to more general settings. We show that most of\nthe results for single-peaked preferences do not directly apply to this\nsetting; this makes the problem essentially more challenging. As our main\ncontribution, we present a simple truthful-in-expectation mechanism that\nachieves an approximation ratio of 1+b/c for both the social and the maximum\ncost, where b is the distance of the agent from the peak and c is the minimum\ncost of an agent. For the latter case, we provide a 3/2 lower bound on the\napproximation ratio of any truthful-in-expectation mechanism. We also study\ndeterministic mechanisms under some natural conditions, proving lower bounds\nand approximation guarantees. We prove that among a large class of reasonable\nmechanisms, there is no deterministic mechanism that outperforms our\ntruthful-in-expectation mechanism.","authors":["Aris Filos-Ratsikas","Minming Li","Jie Zhang","Qiang Zhang"],"meta":["November 2017Autonomous Agents and Multi-Agent Systems 31(3)","DOI:10.1007/s10458-017-9361-0","SourcearXiv"],"references":["279968399_Who_to_Trust_for_Truthfully_Maximizing_Welfare","271825999_Truthful_Mechanisms_without_Money_for_Non-utilitarian_Heterogeneous_Facility_Location","324338896_The_Theory_of_Committees_and_Elections","315823440_The_Theory_of_Committees_and_Elections","301773289_Heterogeneous_facility_location_without_money","283842558_Facility_location_games_with_dual_preference","271817998_Do_Something_Politics_and_Double-Peaked_Policy_Preferences","270421156_The_Theory_of_Committees_and_Elections","269417833_Strategyproof_Mechanisms_for_One-Dimensional_Hybrid_and_Obnoxious_Facility_Location","267149147_Strategy-proof_approximation_mechanisms_for_an_obnoxious_facility_game_on_networks"]}