{"id":"272675524_Employer_Branding_Constrains_Applicants'_Job_Seeking_Behaviour","abstract":"Los investigadores han sido consistentes en el asesoramiento a los directivos de que inviertan en la marca del empleador de la organización, con base en el argumento de que se beneficiará la práctica del reclutamiento. Sin embargo, esta premisa ha sido mayormente sostenida siguiendo un punto de vista organizativo. Como tal, los efectos de marca del empleador sobre el comportamiento de búsqueda de empleo de los candidatos que solicitan una vacante siguen siendo indeterminados. El objetivo principal de este estudio es conocer si la marca del empleador limita la conducta de búsqueda de los solicitantes. Nosotros proponemos que los candidatos desarrollan el deseo de solicitar una vacante a través de un proceso que tiene los atributos de la organización como predictor y el atractivo como su mediador. A continuación, investigamos si y cómo la marca del empleador restringe este proceso, mediante la evaluación de su efecto moderador. Utilizando la metodología de análisis confirmatorio, encontramos que la marca del empleador modera el proceso de búsqueda de trabajo propuesto. Una marca de empleador positiva ha fortalecido el proceso conducente a la intención de solicitar una vacante, en comparación con marcas de empleador neutrales o negativas. Esto explica el deseo de los candidatos de solicitar a una vacante. En base a nuestros resultados, sugerimos recomendaciones a los profesionales, relativas a la eficacia del reclutamiento.","authors":["Daniel Roque Gomes","José Gonçalves Das Neves"],"meta":["January 2010Journal of Work and Organizational Psychology / Revista de Psicología del Trabajo y de las Organizaciones 26(3):223-234","DOI:10.5093/tr2010v26n3a6","Project: Corporate Social Responsibility"],"references":["313219279_The_importance_of_recruitment_in_job_choice_A_different_way_of_looking","289963902_In_Search_of_Golden_Rules_Comment_on_Hypothesis-Testing_Approaches_to_Setting_Cutoff_Values_for_Fit_Indexes_and_Dangers_in_Overgeneralizing_Hu_and_Bentler's_1999_Findings","282630797_Organizational_Attractiveness_An_Interactionist_Perspective","325001492_What's_in_a_Name_Reputation_Building_and_Corporate_Strategy","324998646_Corporate_Image_Recruitment_Image_And_Initial_Job_Choice_Decisions","313007792_The_people_make_the_place","309032267_Cutoff_criteria_for_fit_indexes_in_covariance_structure_analysis_Conventional_criteria_versus_new_alternatives","289641398_Poisoned_by_a_toxic_brand_A_worst_case_scenario_of_employer_branding_-_A_case_study_of_a_Fortune_100_technology_firm","283634737_E-recruitment_Individual_and_organizational_perspectives","281069890_Structural_equation_modeling_in_practice_A_review_and_recommended_two-step_approach"]}