{"id":"272646359_Comparison_of_Volunteered_Geographic_Information_Data_Contributions_and_Community_Development_for_Selected_World_Regions","abstract":"Volunteered Geographic Information (VGI) projects and their crowdsourced data have been the focus of a number of scientific analyses and investigations in recent years. Oftentimes the results show that the collaboratively collected geodata of one of the most popular VGI projects, OpenStreetMap (OSM), provides good coverage in urban areas when considering particular completeness factors. However, results can potentially vary significantly for different world regions. In this article, we conduct an analysis to determine similarities and differences in data contributions and community development in OSM between 12 selected urban areas of the world. Our findings showed significantly different results in data collection efforts and local OSM community sizes. European cities provide quantitatively larger amounts of geodata and number of contributors in OSM, resulting in a better representation of the real world in the dataset. Although the number of volunteers does not necessarily correlate with the general population density of the urban areas, similarities could be detected while comparing the percentage of different contributor groups and the number of changes they made to the OSM project. Further analyses show that socio-economic factors, such as income, can have an impact on the number of active contributors and the data provided in the analyzed areas. Furthermore, the results showed significant data contributions by members whose main territory of interest lies more than one thousand kilometers from the tested areas.","authors":["Pascal Neis","Dennis Zielstra","Alexander Zipf"],"meta":["June 2013Future Internet 5(2):282-300","DOI:10.3390/fi5020282","Projects: Geographic Social Media AnalyticsOpenStreetMap Data Quality Analytics (VGI Big Spatial Data Analytics)"],"references":["279845943_Nutzungspotentiale_crowdsource-erhobener_Geodaten_auf_verschiedenen_Skalen","277482176_Characteristics_of_Heavily_Edited_Objects_in_OpenStreetMap","276038036_Towards_Automatic_Vandalism_Detection_in_OpenStreetMap","272645574_Analyzing_the_Contributor_Activity_of_a_Volunteered_Geographic_Information_Project_-_The_Case_of_OpenStreetMap","268430310_Towards_Defining_a_Framework_for_the_Automatic_Derivation_of_3D_CityGML_Models_from_Volunteered_Geographic_Information","307855241_NeoGeography_and_the_nature_of_geographic_expertise","300362169_Interoperable_location_based_services_for_3D_cities_on_the_web_using_user_generated_content_from_OpenStreetMap","291891168_United_States_Digital_Street_Data_A_Comparison_between_Free_and_Proprietary_Datasets","276935722_What_is_Web_20_Design_patterns_and_business_models_for_the_next_generation_of_software","266443804_Accessing_the_history_of_objects_in_OpenStreetMap"]}