{"id":"272624375_Gene_Regulation_by_H-NS_as_a_Function_of_Growth_Conditions_Depends_on_Chromosomal_Position_in_Escherichia_coli","abstract":"Cellular adaptation to changing environmental conditions requires the coordinated regulation of expression of large sets of genes by global regulatory factors such as nucleoid associated proteins. While in eukaryotic cells genomic position is known to play an important role in regulation of gene expression, it remains to be established whether in bacterial cells there is an influence of chromosomal position on the efficiency of these global regulators. Here we show for the first time that genome position can affect transcription activity of a promoter regulated by the H-NS protein, a global regulator of bacterial transcription and genome organization. We have used as a local reporter of H-NS activity the level of expression of a fluorescent reporter protein under control of an H-NS regulated promoter (Phns) at different sites along the genome. Our results show that the activity of the Phns promoter depends on whether it is placed within the AT-rich regions of the genome that are known to be bound preferentially by H-NS. This modulation of gene expression moreover depends on the growth phase and the growth rate of the cells, reflecting the changes taking place in the relative abundance of different nucleoid proteins and the inherent heterogeneous organization of the nucleoid. Genomic position can thus play a significant role in the adaptation of the cells to environmental changes, providing a fitness advantage that can explain the selection of a gene's position during evolution.\nCopyright © 2015 Author et al.","authors":["Elisa Brambilla","Bianca Sclavi"],"meta":["February 2015G3-Genes Genomes Genetics 5(4)","DOI:10.1534/g3.114.016139","SourcePubMed","Project: Genome organisation and regulation of gene expression"],"references":["265558006_Chromosome_position_effects_on_gene_expression_in_Escherichia_coli_K-12","259847112_Widespread_suppression_of_intragenic_transcription_initiation_by_H-NS","259321721_Gene_expression_scaled_by_distance_to_the_genome_replication_site","255951353_Role_of_RNA_Polymerase_and_Transcription_in_the_Organization_of_the_Bacterial_Nucleoid","317240533_NuST_analysis_of_the_interplay_between_nucleoid_organization_and_gene_expression","295275773_Bacterial_chromatin_organization_by_H-NS_protein_unraveled_using_a_dual_DNA_assay","260093010_Bacterial_growth_Global_effects_on_gene_expression_growth_feedback_and_proteome_partition","259349483_Dynamic_regulation_of_transcriptional_states_by_chromatin_and_transcription_factors","259252422_Bacterial_nucleoid_structure_probed_by_active_drag_and_resistive_pulse_sensing","257330957_H-NS_the_genome_sentinel"]}