{"id":"272662421_Visual_Auditory_Kinaesthetic_Learning_Styles_and_Their_Impacts_on_English_Language_Teaching","abstract":"One of the most important uses of learning styles is that it makes it easy for teachers to incorporate them into their teaching. There are different learning styles. Three of the most \npopular ones are visual, auditory , and kinaesthetic in which students take in information. Some students are visual learners\n, while others are auditory or kinaesthetic learners. While students use all of their senses to take in information, they seem to have preferences in how they learn best. In order to help students learn, teachers need to \nteach as many of these \npreferences as possible. Teachers can incorporate these learning styles in their curriculum activities so that students are able to succeed in their classes. This study is an analysis of learning styles for Iranian EFL university students. Over 100 students completed a questionnaire to determine if their learning styles are auditory, visual or kinaesthetic. The finding showed that Iranian EFL university students preferred learning style was visual. The purpose of this study is to increase faculty awareness and understanding of the effect of learning styles on the teaching process. A review of the literature will determine how learning styles affect the teaching process","authors":["Abbas Pourhosein Gilakjani"],"meta":["December 2011Journal of Studies in Education 2(1):104","DOI:10.5296/jse.v2i1.1007"],"references":["312470401_Learningteaching_styles_in_engineering_education","257431200_Learning_and_Teaching_Styles_in_Engineering_Education","288941098_Enhancing_learning_a_matter_of_style_of_approach_Perspectives_on_Thinking","283832711_Language_Learning_Style_Preferences_A_Students_Case_Study_of_Shiraz_EFL_Institutes","274274749_Making_Sense_of_Adult_Learning","270175858_Teaching_English_as_a_Second_Language","268745264_Frames_of_Mind_The_Theory_of_Multiple_Intelligences","260304254_The_Learning_Style_Preferences_of_ESL_Students","249768756_Bridging_the_Cultural_Gap_A_Study_of_Chinese_Students'_Learning_Style_Preferences","247933257_The_Neurobiology_of_Affect_in_Language"]}