{"id":"272728874_Making_up_History_False_Memories_of_Fake_News_Stories","abstract":"Previous research has shown that information that is repeated is more likely to be rated as true than information that has not been heard before. The current experiment examines whether familiarity with false news stories would increase rates of truthfulness and plausibility for these events. Further, the experiment tested whether false stories that were familiar would result in the creation of a false memory of having heard the story outside of the experiment. Participants were exposed to false new stories, each portrayed by the investigator as true news stories. After a five week delay, participants who had read the false experimental stories rated them as more truthful and more plausible than participants who had not been exposed to the stories. In addition, there was evidence of the creation of false memories for the source of the news story. Participants who had previously read about the stories were more likely to believe that they had heard the false stories from a source outside the experiment. These results suggest that repeating false claims will not only increase their believability but may also result in source monitoring errors.","authors":["Danielle C. Polage"],"meta":["May 2012Europe's Journal of Psychology 8(2):245-250","DOI:10.5964/ejop.v8i2.456"],"references":["232450862_Dissociation_of_Processes_in_Belief_Source_Recollection_Statement_Familiarity_and_the_Illusion_of_Truth","229937605_The_generality_of_the_relation_between_familiarity_and_judged_validity","222438522_Frequency_and_the_Conference_of_Referential_Validity","8670003_Evolving_Informational_Credentials_The_MisAttribution_of_Believable_Facts_to_Credible_Sources","232451078_Credibility_of_Repeated_Statements_Memory_for_Trivia","232444110_Becoming_Famous_Overnight_Limits_on_the_Ability_to_Avoid_Unconscious_Influences_of_the_Past","229398063_Incorporating_new_information_into_existing_world_knowledge","222703935_Learning_Facts_from_Fiction","14853629_Source_Monitoring","12244651_The_quality_of_false_memory_over_time_Is_memory_for_misinformation_remembered_or_known"]}