{"id":"272718099_From_Freshman_to_Graduate_Making_the_Case_for_Student-Centric_Institutional_Repositories","abstract":"INTRODUCTION Institutional repositories provide an opportunity to enhance the undergraduate education experience by developing student-centric collections. This article highlights five IR collections focusing on undergraduate student work at a medium size university. LITERATURE REVIEW Students benefit when they actively participate in undergraduate research activities that are tied to high-impact educational practices. However, there are limited options for undergraduate students to publish and share their work. Academic librarians are well-positioned to develop a student-centric institutional repository supporting undergraduate student research while working at instilling better information literacy standards and practices. DESCRIPTION OF PROJECT Western Oregon University’s Hamersly Library developed an institutional repository with an initial collection development strategy around undergraduate student collections based on the university’s strong identity and emphasis on undergraduate education. While traditional academic publishing opportunities are represented, there is also space and encouragement for publication of other types of student created material including presentations and creative works. There is an emphasis on representing student work from all grade levels. By connecting the student scholarship collections to high-impact educational practices, the library can advocate and demonstrate additional types of value that resonate with faculty and university administrators. NEXT STEPS The library will explore student publishing opportunities that originate in existing classes and new courses taught by librarians. Library faculty will continue to educate university administration and faculty on scholarly communication initiatives and their concerns of plagiarism and quality of work.","authors":["Erin Passehl-Stoddart","Robert Monge"],"meta":["August 2014Journal of Librarianship and Scholarly Communication 2(3)","DOI:10.7710/2162-3309.1130"],"references":["271343138_Point_Counterpoint_The_Purpose_of_Institutional_Repositories_-_Green_OA_or_Beyond","271343104_How_to_Scuttle_a_Scholarly-Communication_Initiative","264846192_Keeping_Them_Enrolled_How_Academic_Libraries_Contribute_to_Student_Retention","256854274_Completing_the_Research_Cycle_A_Framework_for_Promoting_Dissemination_of_Undergraduate_Research_and_Inquiry","271295351_A_Survey_of_Library_Support_for_Formal_Undergraduate_Research_Programs","254608938_Engaging_Undergraduates_in_Scholarly_Communication","237242672_High-impact_educational_practices_What_they_are_who_has_access_to_them_and_why_they_matter","227867251_The_Boyer_Commission_Report_and_ItsImpact_on_Undergraduate_Research","227691385_Learning_Through_Inquiry_An_Overview_of_Undergraduate_Research","222554004_Promoting_and_Archiving_Student_Work_through_an_Institutional_Repository_Trinity_University_LASR_and_the_Digital_Commons"]}