{"id":"272787843_A_Semantic_Similarity_Assessment_Tool_for_Computer_Science_Subjects_Using_Extended_Wu_Palmer's_Algorithm_and_Ontology","abstract":"This paper presents a process model and a system for calculating the correspondence between the content of courses in Computer Science with the standard of The Thailand Qualifications Framework for Higher Education (TQF: HEd). The aim is to improve the curriculum of universities in Thailand by meeting the standards and decreasing the duration of the operation to be more convenient. We designed an ontology of courses and TQF: HEd, and then we developed the system as a web application that can map the information from two ontologies using the extended Wu & Palmer's algorithm and WordNet. At last, the system summarizes the consistency of the course descriptions with the body of knowledge of TQF: HEd. Tests with sample data show that this method indicates whether the course description is consistent with the standards or not. It also indicates the relative importance of each part of the body of knowledge in teaching of this subject as well. 1 Background and Problems The higher education management in Thailand has had some problems relating standards of curriculum and teaching because the curriculum and teaching design in each discipline of most universities vary. This leads to the situation that most students try to enter prestigious universities where they expect the best teaching quality. However, each university can receive only a limited number of students, so many students who not admitted must chose to study at other universities that may still have problems in accordance with the teaching standard. This is a problem of inequality in education and can affect suitability of careers after graduation as well.","authors":["Chayan Nuntawong","Chakkrit Snae","Michael Brückner"],"meta":["February 2015Lecture Notes in Electrical Engineering 339:989-996","DOI:10.1007/978-3-662-46578-3_118"],"references":["252067295_A_Framework_for_Improving_the_Performance_of_Ontology_Matching_Techniques_in_Semantic_Web","230585379_Verbs_Semantics_and_Lexical_Selection","220346157_A_cyber_forensics_ontology_Creating_a_new_approach_to_studying_cyber_forensics","305083440_Combining_local_context_and_WordNet_similarity_for_word_sense_identification","271155488_Alternative_Approaches_for_Ontology_Matching","261231699_A_Use_Case_Diagrams_ontology_that_can_be_used_as_common_reference_for_Software_Engineering_education","239765260_Overview_on_ontology_mapping_and_approach","224362186_The_Development_of_Ontology-Based_Course_for_Computer_Networks","224095680_Protege-Based_Ontology_Knowledge_Representation_for_MIS_Courses","220875256_Verb_Semantics_and_Lexical_Selection","200045856_Combining_Local_Context_and_WordNet_Similarity_for_Word_Sense_Identification","2903260_WordNetSimilarity_-_Measuring_the_Relatedness_of_Concepts","2720890_An_Information-Theoretic_Definition_of_Similarity","2327068_Verb_Semantics_And_Lexical_Selection"]}