{"id":"272797822_What_can_children_tell_us_about_the_fixedness_of_idiomatic_phrases_The_psycholinguistic_relevance_of_a_linguistic_model","abstract":"The present paper contains two distinct yet intricately linked studies concerning idiomatic phrases in Greek: a linguistic study and a psycholinguistic study. The linguistic study aims at investigating the degree of fixedness of idiomatic phrases, through a semantic-lexical categorization of 470 phrases with fixed subject. Three phrase categories were distinguished: typical phrases characterized by a strong semantic-lexical articulation between their constituents, and non-typical phrases, in which the constituents have a certain semantic autonomy. Non-typical phrases were further categorized into a) quasi-phrases and b) conventionalized phrases, the constituents of which have the highest degree of semantic autonomy. Α linguistic model was developed named “graded fixedness model”, and the psycholinguistic relevance of the model assessed by examining idiom comprehension in Greek elementary school children, aged 7.5 and 9.5 years old. To achieve this, a psycholinguistic study was then carried out. Children were presented with 8 typical, 8 quasi and 8 conventionalized phrases. For each phrase, they were asked to choose the one they thought correct out of three interpretations proposed (idiomatic, literal and other). The research findings presented and discussed herein provide evidence supporting the psychological reality of the notion of semantic autonomy even for the younger children’s processing which was overall quite poor: thus, the greater the semantic autonomy of a phrase’s constituents, the easier the access to its idiomatic meaning.","authors":["Marianna Mini","Kleopatra Diakogiorgi","Angeliki/Aggeliki Fotopoulou"],"meta":["December 2011Discours","DOI:10.4000/discours.8579"],"references":["347422048_Une_classification_des_phrases_a_complements_figes_en_grec_moderne_Etude_morphosyntaxique_des_phrases_figees","270780569_Idiom_Understanding_in_Youth","248904594_Les_notions_linguistiques_de_figement_et_de_contrainte","248204315_Understanding_Figurative_and_Literal_Language_The_Graded_Salience_Hypothesis","306197901_Cultural_and_instructional_influences_on_figurative_language_comprehension_by_inner_city_children","301325905_Idiom_meanings_and_allusional_content","278865781_Comprehension_of_idiomatic_expressions_Effects_of_predictability_and_literality","271124716_Une_classification_des_phrases_figees_du_francais","259373367_Rules_and_Representations","258431099_On_catching_on_to_idiomatic_expressions"]}