{"id":"272831678_Nascent_Research_Trends_in_MOOCs_in_Higher_Educational_Institutions_A_Systematic_Literature_Review","abstract":"The emergence of Massive Open Online Courseware (MOOC) has garnered widespread attention for revolutionizing open access learning and it is considered as the main driver of education innovation. The literature on MOOC is steadily growing. However, there is not much effort being conducted to systematically curate, review and analyse the emergent trends on MOOC in higher educational institutions. For this research, a systematic literature review is initiated using Data Mining and Knowledge Discovery Model where the database comprises state-of-the-art researches on MOOC ranging from 2008 to mid-2014. There were 405 papers identified for primary study and 164 papers were found relevant to the research. State-of-the-art researches on MOOC in higher educational institutions were identified and current trends, issues and stances on MOOC were identified, analysed and discussed. This research is expected to assist policy makers, academicians and researchers to understand the trends and issues in the conceptualization and execution of MOOC in higher educational institutions and propagate future studies on MOOC. Keywords—Massive Open Online Courseware; MOOC; higher educational institutions; systematic literature review","authors":["Nor Fadzleen Binti Sa'don","Rose Alinda Alias","Naoki Ohshima"],"meta":["November 2014","DOI:10.1109/ICWOAL.2014.7009215","Conference: International Conference on Web and Open Access to Learning 2014At: Atlantis The Palm, Dubai, UAE"],"references":["286690038_Making_Sense_of_MOOCs_Musings_in_a_Maze_of_Myth_Paradox_and_Possibility","277060958_The_Technological_Dimension_of_a_Massive_Open_Online_Course_The_Case_of_the_CCK08_Course_Tools","267453244_MOOCs_a_Systematic_Study_of_the_Published_Literature_2008-2012","262584203_Unpacking_MOOC_scholarly_discourse_A_review_of_nascent_MOOC_scholarship","262320364_Will_MOOCs_destroy_academia","260316869_Initial_Trends_in_Enrolment_and_Completion_of_Massive_Open_Online_Courses","260205419_The_MOOC_model_for_digital_practice","237091973_Studying_Learning_in_the_Worldwide_Classroom_Research_into_edX's_First_MOOC","221787522_A_Data_Mining_Knowledge_Discovery_Process_Model","220616145_Mining_Text_Using_Keyword_Distributions","50888830_Connectivism_Its_Place_in_Theory-Informed_Research_and_Innovation_in_Technology-Enabled_Learning"]}