{"id":"272853143_The_Use_of_Educational_Web_Tools_An_Innovative_Technique_in_Teacher_Education_Courses","abstract":"With the increasing dependence on internet sources, educational web tools have offered teachers with various opportunities to investigate the most appropriate educational tools to suit their students’ learning preferences. Undeniably, students in this digital age need to learn how to effectively and efficiently create, collaborate and share new information on the web through the use of different tools available on the web for lifelong learning.In response to this need, an empirical study on educational web tools as a technique to enhance student’s learning was conducted. Hence, the aim of this paper was to determine the students’ attitudes, skills and benefits they may have experienced during the conduct of their web tool activities in selected education subjects. The results showed that students demonstrate positive attitudes on the use of educational web tools. Results further revealed that the students’ skills and the benefits they have experienced differ according to their attitudes toward the use of educational web tools in the subject. Based from the findings, conclusion has been drawn regarding the use of educational web tools to support the teaching-learning process. Finally, this paper is supported by an actual student’s output, which can be found in the website (http://robles2011.blogspot.com/).","authors":["Ava Clare Marie Oclarit Robles"],"meta":["February 2013International Journal of Modern Education and Computer Science 5(2):34-40","DOI:10.5815/ijmecs.2013.02.05"],"references":["276195884_Graduate_School_Cyber_Portfolio_The_Innovative_Menu_For_Sustainable_Development","256461823_Learning_20_The_Impact_of_Web_20_Innovations_on_Education_and_Training_in_Europe_Final_Report","236134581_Exploring_the_Influence_of_Context_on_Attitudes_Toward_Web-Based_Learning_Tools_WBLTs_and_Learning_Performance","229733149_Using_the_Internet_in_teaching_The_views_of_practitioners_A_survey_of_the_views_of_secondary_school_teachers_in_Sheffield_UK","12804092_A_hypertext-based_tutorial_with_links_to_the_Web_for_teaching_statistics_and_research_methods","234722197_Computer-Mediated_Group_Projects_Facilitating_Collaborative_Learning_With_the_World_Wide_Web","234614355_Campus_Computing_1992_The_EDUCOM-USC_Survey_of_Desktop_Computing_in_Higher_Education","233179301_Comparisons_and_Contrasts_in_Traditional_Versus_On-Line_Teaching_in_Management","23807587_Web_20_tools_in_medical_and_nursing_school_curricula"]}