{"id":"272814986_What_Drives_Academic_Data_Sharing","abstract":"Despite widespread support from policy makers, funding agencies, and scientific journals, academic researchers rarely make their research data available to others. At the same time, data sharing in research is attributed a vast potential for scientific progress. It allows the reproducibility of study results and the reuse of old data for new research questions. Based on a systematic review of 98 scholarly papers and an empirical survey among 603 secondary data users, we develop a conceptual framework that explains the process of data sharing from the primary researcher’s point of view. We show that this process can be divided into six descriptive categories: Data donor, research organization, research community, norms, data infrastructure, and data recipients. Drawing from our findings, we discuss theoretical implications regarding knowledge creation and dissemination as well as research policy measures to foster academic collaboration. We conclude that research data cannot be regarded as knowledge commons, but research policies that better incentivise data sharing are needed to improve the quality of research results and foster scientific progress.","authors":["Benedikt Fecher","Sascha Friesike","Marcel Hebing"],"meta":["February 2015PLoS ONE 10(2)","DOI:10.1371/journal.pone.0118053","Project: Open Science"],"references":["324974277_Reinventing_Discovery_The_New_Era_of_Networked_Science","311443250_The_German_Socio-Economic_Panel_Study_SOEP-Scope_evolution_and_enhancemants","297622251_Towards_Effective_and_Rewarding_Data_Sharing","289248697_Full_Disclosure_Matters","284417939_Open_Source_Software_Development_and_the_Private-Collective_Innovation_Model_Issues_for_Organization_Science","278410636_Ethical_and_Secure_Data_Sharing_across_Borders","277988821_Motivating_Subjects_Data_Sharing_in_Cancer_Research","277370264_Data_sharing_and_intellectual_property_in_a_genomic_epidemiology_network_policies_for_large-scale_research_collaboration","272302403_Access_to_Research_Inputs_Open_Science_Versus_the_Entrepreneurial_University","271503413_Reinventing_Discovery_-_The_New_Era_of_Networked_Science"]}