{"id":"272845040_A_Holistic_Approach_for_Modeling_and_Synthesis_of_Image_Processing_Applications_for_Heterogeneous_Computing_Architectures","abstract":"Image processing applications are common in every field of our daily life.\nHowever, most of them are very complex and contain several tasks with different\ncomplexities which result in varying requirements for computing architectures.\nNevertheless, a general processing scheme in every image processing application\nhas a similar structure, called image processing pipeline: (1) capturing an\nimage, (2) pre-processing using local operators, (3) processing with global\noperators and (4) post-processing using complex operations. Therefore,\napplication-specialized hardware solutions based on heterogeneous architectures\nare used for image processing. Unfortunately the development of applications\nfor heterogeneous hardware architectures is challenging due to the distribution\nof computational tasks among processors and programmable logic units. Nowadays,\nimage processing systems are started from scratch which is time-consuming,\nerror-prone and inflexible. A new methodology for modeling and implementing is\nneeded in order to reduce the development time of heterogenous image processing\nsystems. This paper introduces a new holistic top down approach for image\nprocessing systems. Two challenges have to be investigated. First, designers\nought to be able to model their complete image processing pipeline on an\nabstract layer using UML. Second, we want to close the gap between the abstract\nsystem and the system architecture.","authors":["Christian Hartmann","Anna Deitsch","Marc Reichenbach","Dietmar Fey"],"meta":["February 2015","SourcearXiv"],"references":["221341376_Closing_the_gap_between_UML-based_modeling_simulation_and_synthesis_of_combined_HWSW_systems","287646611_Design_for_Embedded_Image_Processing_on_FPGAs","285331220_Mapping_Techniques","224056581_Archlog_High-Level_Synthesis_of_Reconfigurable_Multiprocessors_for_Logic_Programming","220694915_The_Image_Processing_Handbook"]}