{"id":"272946536_Phases_of_inquiry-based_learning_Definitions_and_the_inquiry_cycle","abstract":"Inquiry-based learning is gaining popularity in science curricula, international research and development projects as well as teaching. One of the underlying reasons is that its success can be significantly improved due to the recent technical developments that allow the inquiry process to be supported by electronic learning environments. Inquiry-based learning is often organized into inquiry phases that together form an inquiry cycle. However, different variations on what is called the inquiry cycle can be found throughout the literature. The current article focuses on identifying and summarizing the core features of inquiry-based learning by means of a systematic literature review and develops a synthesized inquiry cycle that combines the strengths of existing inquiry-based learning frameworks. The review was conducted using the EBSCO host Library; a total of 32 articles describing inquiry phases or whole inquiry cycles were selected based on specific search criteria. An analysis of the articles resulted in the identification of five distinct general inquiry phases: Orientation, Conceptualization, Investigation, Conclusion, and Discussion. Some of these phases are divided into sub-phases. In particular, the Conceptualization phase is divided into two (alternative) sub-phases, Questioning and Hypothesis Generation; the Investigation phase is divided into three sub-phases, Exploration or Experimentation leading to Data Interpretation; and the Discussion phase is divided into two sub-phases, Reflection and Communication. No framework bringing together all of these phases and sub-phases was found in the literature. Thus, a synthesized framework was developed to describe an inquiry cycle in which all of these phases and sub-phases would be present. In this framework, inquiry-based learning begins with Orientation and flows through Conceptualization to Investigation, where several cycles are possible. Inquiry-based learning usually ends with the Conclusion phase. The Discussion phase (which includes Communication and Reflection) is potentially present at every point during inquiry-based learning and connects to all the other phases, because it can occur at any time during (discussion in-action) or after inquiry-based learning when looking back (discussion on-action).","authors":["Margus Pedaste","Mario Mäeots","Leo Siiman","Ton de Jong"],"meta":["February 2015Educational Research Review 14(1)","DOI:10.1016/j.edurev.2015.02.003","Project: Go-Lab"],"references":["338612531_Teaching_Science_Using_Guided_Inquiry_as_the_Central_Theme_A_Professional_Development_Model_for_High_School_Science_Teachers","313392560_Scaffolds_for_scientific_discovery_learning","304748027_Inquiry_Learning_and_Teaching_in_Science_Education","292253870_Inquiry_modeling_and_metacognition_Making_science_accessible_to_all_students","289382086_Developing_students'_transformative_and_regulative_inquiry_skills_in_a_computer-based_simulation","288284135_Inquiry-based_science_laboratories_An_analysis_of_preservice_teachers'_beliefs_about_learning_science_through_inquiry_and_their_performances","288261820_Scientific_inquiry_based_professional_development_models_in_teacher_education","285381827_What_is_Scientific_Thinking_and_How_Does_It_Develop","285329027_Teaching_artistry_through_reflection-in-action","285309371_Inquiry_in_the_adult_classroom_an_ESL_literacy_experience"]}