{"id":"273064409_Inclusion_of_terrtorial_resources_i_the_product_development_process","abstract":"Facing globalization, territorial competitiveness is considered by (French) public policy makers as promising both economic and social value creation locally. Companies consider territorial specificities when selecting a location (e.g. low production costs, highly qualified labor pool) in a utilitarian perspective. This research proposes encouraging companies to consider territory as a value creation network where exploitable resources flow. The proposal presented in this paper is to integrate these latent territorial resources into the product development process to create value for both the company and its territory in a sustainable perspective. The literature review highlights that current eco design practices have great impact on territories, but that this dimension is not considered in terms of resources. Moreover, current assessment practices are not adapted to overall performance evaluation and need revision to meet the system innovation goal. After clarifying the concept of territory, two industrial cases are provided to analyze how territorial resources were included in the design process and how it improved the overall performance of the company-territory system. From the success factors emerging from literature and cases, a method to release the potential of territorial resources is presented. A revised strategic process dedicated to senior management is proposed as the enabler of system innovation with the intention of improving the design of sustainable products. This paper concludes with the necessary cultural evolution that every stakeholder in the value network must undergo to promote territorial values in a sustainable perspective. This study contributes to the emerging discipline of design for local value creation.","authors":["Romain Allais","Tatiana Reyes","Roucoules Lionel"],"meta":["February 2015Journal of Cleaner Production","DOI:10.1016/j.jclepro.2015.01.091","Project: Convergence"],"references":["301210386_Integration_of_New_Dimensions_in_Design_Process","281992125_Using_environmental_segmentation_to_perform_ecodesign_with_users","281988060_Toward_unified_environmental_activities_in_enterprise","281331628_The_global_reporting_initiative_G3_sustainability_reporting_guidelines_conclusion","280940066_Design_methodologies_Industrial_and_educational_applications","313696004_Backcasting_from_non-overlapping_sustainability_principles_-_A_framework_for_strategic_planning","313211744_The_effect_of_buyer_pressure_on_suppliers_in_SMEs_to_demonstrate_CSR_an_added_incentive_or_counter_productive","292861845_Capitalism_As_If_the_World_Matters","288260466_Organizational_learning_of_environmental_responsibility_A_structured_'journey'","285365652_The_territory_as_a_complex_system_An_operational_concept_for_land_planning_and_geography"]}