{"id":"273089346_An_Ecology_of_Social_Categories","abstract":"This article proposes that meaningful social classification emerges from an ecological dynamic that operates in two planes: feature space and label space. It takes a dynamic view of classification, allowing objects' movements in both spaces to change the meaning of social categories. The first part of the theory argues that agents assign labels to objects based on perceptions of their similarities to existing members of a category. The second part of the theory shows that an object's perceived similarity to members of other categories reduces its typicality in a focal category. This means that for categories with a high degree of overlap with other categories in label space (lenient categories), the link between feature-based similarities and labeling weakens. The findings suggest that social classification will likely evolve to contain both constraining and lenient categories. The theory implies that this process is self-reinforcing, so that constraining categories become more constraining, whereas lenient categories become more lenient.","authors":["Elizabeth G. Pontikes","Michael Hannan"],"meta":["August 2014Sociological Science 1(20):311-343","DOI:10.15195/v1.a20"],"references":["275623617_Out_of_Sight_Out_of_Mind_Evidence_of_Perceptual_Factors_in_the_Multiple-Category_Discount","275450712_Contrasting_alternative_explanations_for_the_consequences_of_category_spanning_A_study_of_restaurant_reviews_and_menus_in_San_Francisco","313200645_Institutionalized_organizations_Formal_structure_as_myth_and_ceremony","313128874_Vagueness_An_exercise_in_logical_analysis","297144588_WHERE_DO_MARKETS_COME_FROM","285874651_The_ADA_mediation_guidelines_A_community_collaboration_moves_the_field_forward","281453343_Institutionalized_Organizations_Formal_Structures_as_Myth_and_Ceremony","279934599_Politics_and_institutionalism_Explaining_durability_and_change","279236624_Studies_of_similarity","275856808_The_Elementary_Forms_of_Religious_Life"]}