{"id":"273003972_Human_Facial_Expression_Recognition_Using_Stepwise_Linear_Discriminant_Analysis_and_Hidden_Conditional_Random_Fields","abstract":"This paper introduces an accurate and robust facial expression recognition (FER) system. For feature extraction, the proposed FER system employs stepwise linear discriminant analysis (SWLDA). SWLDA focuses on selecting the localized features from the expression frames using the partial $boldsymbol {F}$ -test values, thereby reducing the within class variance and increasing the low between variance among different expression classes. For recognition, the hidden conditional random fields (HCRFs) model is utilized. HCRF is capable of approximating a complex distribution using a mixture of Gaussian density functions. To achieve optimum results, the system employs a hierarchical recognition strategy. Under these settings, expressions are divided into three categories based on parts of the face that contribute most toward an expression. During recognition, at the first level, SWLDA and HCRF are employed to recognize the expression category; whereas, at the second level, the label for the expression within the recognized category is determined using a separate set of SWLDA and HCRF, trained just for that category. In order to validate the system, four publicly available data sets were used, and a total of four experiments were performed. The weighted average recognition rate for the proposed FER approach was 96.37% across the four different data sets, which is a significant improvement in contrast to the existing FER methods.","authors":["Muhammad Hameed Siddiqi","Rahman Ali","Adil Mehmood Khan","Young Tack Park"],"meta":["April 2015IEEE Transactions on Image Processing 24(4):1386-1398","DOI:10.1109/TIP.2015.2405346"],"references":["317083802_Eigenfaces_vs_Fisherfaces_Recognition_Using_Class_Specific_Linear_Projection","313544668_The_effects_of_pose_on_facial_expression_recognition","313742060_Facial_expression_analysis","307960646_Kernel_Fisher_Discriminants","307815812_Manifold_Adaptive_Kernel_Local_Fisher_Discriminant_Analysis_for_Face_Recognition","303322246_Communication_without_words","292709872_Eigenface-Gabor_algorithm_for_feature_extraction_in_face_recognition","289543360_Facial_Expressions_Recognition_Using_Eigenspaces","288961221_A_survey_of_face_recognition_on_feature_extraction_process_of_dimensionality_reduction_techniques","288715234_An_Optical_Flow_Feature-Based_Robust_Facial_Expression_Recognition_with_HMM_from_Video"]}