{"id":"273005795_Weak_topologies_and_compactness_in_asymmetric_functional_analysis","abstract":"The classical Bourbaki-Alaoglu theorem asserts that the polar U degrees of a neighborhood of 0 in a locally convex topological vector space V is a weak* compact subset of the dual space V*. G. Plotkin has proved an analogous theorem in the framework of continuous d-cones, a kind of asymmetric version of topological vector spaces in Domain Theory. In this paper we extend Plotkin's results. We consider topological spaces X with a finitary continuous algebraic structure in the sense of universal algebra instead of a cone structure. Linear functionals are replaced by continuous algebra homomorphisms into a test algebra R replacing the reals. Our main result, Theorem 5.8, concerns the compactness of the space C* of continuous homomorphisms from X to R under appropriate hypotheses. We exhibit conditions under which C* is not only a space but also an algebra, as in the classical situation. This leads us to the notion of entropicity in the sense of universal algebra. The background for our investigation is Domain Theory and its use in denotational semantics (see [8]). Thus our spaces are strongly non-Hausdorff. This paper can be seen as a contribution to asymmetric topology and analysis.","authors":["Klaus Keimel"],"meta":["February 2015Topology and its Applications 185-186","DOI:10.1016/j.topol.2015.01.015"],"references":["263729841_The_bounded-complete_hull_of_an_a-space","228678754_The_cone_of_lower_semicontinuous_traces_on_a_C-algebra","220909803_The_Versatile_Continuous_Order","220371164_Retraction_notice_to_Semantic_Domains_for_Combining_Probability_and_Non-Determinism_Electron_Notes_Theoret_Comput_Sci_129_2005_1-104_DOI101016jentcs200406063","220370791_Semantic_Domains_for_Combining_Probability_and_Non-Determinism","220173764_Predicate_transformers_for_extended_probability_and_non-determinism","277065078_Probabilistic_Non-Determinism","268537982_On_the_existence_of_probability_measures_with_given_marginals","265366135_The_round_ideal_completion_via_sobrification","264968529_Z-distributive_function_lattices","247741588_The_ABC_of_order_and_topology","222671045_The_probabilistic_powerdomain_for_stably_compact_spaces","221570294_Prevision_Domains_and_Convex_Powercones","220173457_A_domain-theoretic_Banach-Alaoglu_theorem"]}