{"id":"273180314_Computation_Offloading_for_Service_Workflow_in_Mobile_Cloud_Computing","abstract":"The development of cloud computing and virtualization techniques enables mobile devices to overcome the severity of scarce resource constrained by allowing them to offload computation and migrate several computation parts of an application to powerful cloud servers. A mobile device should judiciously determine whether to offload computation as well as what portion of an application should be offloaded to the cloud. This paper considers a mobile computation offloading problem where multiple mobile services in workflows can be invoked to fulfill their complex requirements and makes decision on whether the services of a workflow should be offloaded. Due to the mobility of portable devices, unstable connectivity of mobile networks can impact the offloading decision. To address this issue, we propose a novel offloading system to design robust offloading decisions for mobile services. Our approach considers the dependency relations among component services and aims to optimize execution time and energy consumption of executing mobile services. To this end, we also introduce a mobility model and a trade-off fault-tolerance mechanism for the offloading system. A genetic algorithm (GA) based offloading method is then designed and implemented after carefully modifying parts of a generic GA to match our special needs for the stated problem. Experimental results are promising and show near-optimal solutions for all of our studied cases with almost linear algorithmic complexity with respect to the problem size.","authors":["Shuiguang Deng","Longtao Huang","Javid Taheri","Albert Zomaya"],"meta":["January 2014IEEE Transactions on Parallel and Distributed Systems 26(12):1-1","DOI:10.1109/TPDS.2014.2381640"],"references":["266416071_Performance_Analysis_of_Cloud_Computing_Centers","264590921_Top-_Automatic_Service_Composition_A_Parallel_Method_for_Large-Scale_Service_Sets","297816577_Cloud_computing_for_mobile_users_Can_offloading_computation_save_energy","285554190_Service_Selection_for_Composition_with_QoS_Correlations","285450766_Mobility-Enabled_Service_Selection_for_Composite_Services","271496478_A_Framework_For_Mobile_Cloud_Computing_Selective_Service_System","267070496_On_the_performance_of_static_and_dynamic_location_management_strategies_in_mobile_computing","262395402_A_Bayesian_Game_Formulation_of_Power_Dissipation_and_Response_Time_Minimization_in_a_Mobile_Cloud_Computing_System","262150493_The_Faces_of_Engagement_Automatic_Recognition_of_Student_Engagementfrom_Facial_Expressions","260656454_Gearing_Resource-poor_Mobile_Devices_with_Powerful_Clouds_Architectures_Challenges_and_Applications"]}