{"id":"273124867_Automatic_Facial_Expression_Recognition_Using_Features_of_Salient_Facial_Patches","abstract":"Extraction of discriminative features from salient facial patches plays a vital role in effective facial expression recognition. The accurate detection of facial landmarks improves the localization of the salient patches on face images. This paper proposes a novel framework for expression recognition by using appearance features of selected facial patches. A few prominent facial patches, depending on the position of facial landmarks, are extracted which are active during emotion elicitation. These active patches are further processed to obtain the salient patches which contain discriminative features for classification of each pair of expressions, thereby selecting different facial patches as salient for different pair of expression classes. One-against-one classification method is adopted using these features. In addition, an automated learning-free facial landmark detection technique has been proposed, which achieves similar performances as that of other state-of-art landmark detection methods, yet requires significantly less execution time. The proposed method is found to perform well consistently in different resolutions, hence, providing a solution for expression recognition in low resolution images. Experiments on CK+ and JAFFE facial expression databases show the effectiveness of the proposed system.","authors":["S L Happy","Aurobinda Routray"],"meta":["May 2015IEEE Transactions on Affective Computing 6(1)","DOI:10.1109/TAFFC.2014.2386334"],"references":["317083802_Eigenfaces_vs_Fisherfaces_Recognition_Using_Class_Specific_Linear_Projection","264197330_Discriminative_filter_based_regression_learning_for_facial_expression_recognition","312538118_Support-vector_networks","302937305_A_Threshold_Selection_Method_from_Gray-Level_Histogram","299197766_Robust_face_detection_using_the_Hausdorff_distance","287484999_Design_of_face_recognition_algorithm_using_PCALDA_combined_for_data_pre-processing_and_polynomial-based_RBF_neural_networks","285302728_Active_and_dynamic_information_fusion_for_facial_expression_understanding_from_image_sequences","284568615_Automatic_Facial_Expression_Recognition","271513141_Support_Vector_Networks","264151601_Robust_Facial_Expression_Recognition_Based_on_Local_Directional_Pattern"]}