{"id":"273184295_Edition_Visualization_Technology_A_Simple_Tool_to_Visualize_TEI-based_Digital_Editions","abstract":"The TEI schemas and guidelines have made it possible for many scholars and researchers to encode texts of any kind for (almost) all kinds of purposes, but this excellent standard is matched by an astounding diversity of publishing tools, which is particularly true when it comes to image-based digital editions. The different needs of scholars, coupled with the constant search for an effective price/result ratio and the local availability of technical skills, have led to a remarkable fragmentation: publishing solutions range from simple HTML pages produced using the TEI stylesheets (or the TEI Boilerplate software) to very complex frameworks based on CMS and SQL search engines. Researchers of the Digital Vercelli Book project started looking into a simple, user-friendly solution and eventually decided to build their own: EVT (Edition Visualization Technology) has been under development since about 2010 and has turned into a flexible tool that can be used to create a web-based digital edition starting from transcription files encoded in TEI XML. This paper describes why this tool was created, how it works, and developments planned for the future.","authors":["Roberto Rosselli Del Turco","Giancarlo Buomprisco","Chiara Di Pietro","Julia Kenny"],"meta":["December 2014Journal of the Text Encoding Initiative 8(Issue 8 - PREVIEW)","DOI:10.4000/jtei.1077","Project: Edition Visualization Technology"],"references":["317268641_After_the_editing_is_done_Designing_a_Graphic_User_Interface_for_digital_editions","273450359_Toward_modeling_the_social_edition_An_approach_to_understanding_the_electronic_scholarly_edition_in_the_context_of_new_and_emerging_social_media","227774739_Theorizing_the_Digital_Scholarly_Edition","283464386_Current_issues_in_making_digital_editions_of_medieval_texts_-_Or_do_electronic_scholarly_editions_have_a_future","262363527_The_Electronic_Beowulf"]}