{"id":"273170916_RESERVA_DE_MERCADO_UM_MAL_ENTENDIDO_CASO_POLITICO-TECNOLOGICO_DE_SUCESSO_DEMOCRATICO_E_FRACASSO_AUTORITARIO","abstract":"A oferta ao mercado de produtos tecnicamente defasados com precos altos\ne a pressao norte-americana sao explicacoes insatisfatorias para que a reserva\nde mercado no setor da informatica praticada no Brasil, nos anos 70\ne 80, seja hoje uma experiencia ainda mais intensamente rejeitada do que\nconsiderada fracassada. A situacao requer explicacoes mais complexas. Este\nartigo oferece uma nova explicacao para o fracasso e a rejeicao e tambem\npara um pouco conhecido sucesso da reserva de mercado, colocando em\ncena tres fatores sociotecnicos especificos: o carater especial da comunidade\nde profissionais brasileiros de informatica, a intervencao do SNI (a policia\npolitica da ditadura) e o advento dos microcomputadores. A imbricacao\ndesses fatores problematiza de uma nova forma os vinculos entre a reserva\nde mercado, o carater autoritario do regime militar e os ideais do liberalismo\ndemocratico. A abordagem de inclinacao sociotecnica aqui adotada\ndivide o periodo em duas fases em que esses vinculos diferem radicalmente.\nCom surpresa, a primeira fase da reserva do mercado dos computadores\nno Brasil mostra uma afinidade nao explorada entre as formas democraticas\ne a possibilidade de sucesso de politicas industriais para o desenvolvimento\ndas ciencias e das tecnologias nos paises em desenvolvimento.\nAbstract \nSupplying the computer market with technically obsolete and high priced\nproducts plus the American pressure do not provide a satisfactory explanation\nfor the fact that the market reserve practiced in Brazil in the 1980-90 is\ntoday even more intensely rejected than just taken as a failure. The situation\nrequires more complex explanations. This paper offers a new explanation for\nthe rejection and failure of the market reserve, and for its little known success\nas well, by means of three specific sociotechnical factors: the special character\nof the community of Brazilian computer professionals, the intervention of\nthe political police of the military dictatorship (SNI), and the appearance of\nthe microcomputer. This paper runs against the mainstream opinion that does\nnot sufficiently problematizes the links between the market reserve, the authoritarian\ncharacter of the military regime, and liberal democratic ideals.\nThe sociotechnically inspired approach here adopted performs a division of\nthe period into two phases where these links differ radically. Surprisingly, the\nfirst phase of the computer market reserve presents a frequently denied affinity\nbetween the democratic forms and the possibility of successful implementation\nof industrial and scientific policies seeking the development of\nsciences and technologies in developing countries.","authors":["Ivan Da Costa Marques"],"meta":["December 2005Revista de Economia 24","DOI:10.5380/re.v24i0.1984"],"references":["320853055_Hi-Tech_for_Industrial_Development_Lessons_from_the_Brazilian_Experience_in_Electronics_and_Automation","275944002_Hi-Tech_for_Industrial_Development_Lessons_from_the_Brazilian_Experience_in_Electronics_and_Automation","273055265_Embedded_Autonomy_States_and_Industrial_Transformation","270015986_The_Power_of_Ideology_The_Quest_for_Technological_Autonomy_in_Argentina_and_Brazil","243779304_Embedded_Autonomy-States_and_Industrial_Transformation","44464789_An_Inquiry_Into_the_Nature_and_Causes_of_the_Wealth_of_Nations_by_Adam_Smith","4936682_The_development_of_the_'electronics_complex'_and_government_policies_in_Brazil"]}