{"id":"273157891_How_Damage_Diversification_Can_Reduce_Systemic_Risk","abstract":"We consider the problem of risk diversification in complex networks. Nodes\nrepresent e.g. financial actors, whereas weighted links represent e.g.\nfinancial obligations (credits/debts). Each node has a risk to fail because of\nlosses resulting from defaulting neighbors, which may lead to large failure\ncascades. Classical risk diversification strategies usually neglect network\neffects and therefore suggest that risk can be reduced if possible losses\n(i.e., exposures) are split among many neighbors (exposure diversification,\nED). But from a complex networks perspective diversification implies higher\nconnectivity of the system as a whole which can also lead to increasing failure\nrisk of a node. To cope with this, we propose a different strategy (damage\ndiversification, DD), i.e. the diversification of losses that are imposed on\nneighboring nodes as opposed to losses incurred by the node itself. Here, we\nquantify the potential of DD to reduce systemic risk in comparison to ED. For\nthis, we develop a branching process approximation that we generalize to\nweighted networks with (almost) arbitrary degree and weight distributions. This\nallows us to identify systemically relevant nodes in a network even if their\ndirected weights differ strongly. On the macro level, we provide an analytical\nexpression for the average cascade size, to quantify systemic risk.\nFurthermore, on the meso level we calculate failure probabilities of nodes\nconditional on their system relevance.","authors":["Rebekka Burkholz","Antonios Garas","Frank Schweitzer"],"meta":["March 2015PHYSICAL REVIEW E 93(4)","DOI:10.1103/PhysRevE.93.042313","SourcearXiv"],"references":["258100764_Complex_Networks_Structure_Robustness_and_Function","257073897_Default_Cascades_in_Complex_Networks_Topology_and_Systemic_Risk","233763602_On_Watts'_Cascade_Model_with_Random_Link_Weights","314891537_Contagion_in_Financial_Networks","299397643_Interconnected_Networks","264920260_Networks_An_Introduction","263790330_STRESS_TESTING_THE_RESILIENCE_OF_FINANCIAL_NETWORKS","262319902_A_Critical_Point_for_Random_Graphs_with_a_Given_Degree_Sequence","254451179_Default_Cascades_When_Does_Risk_Diversification_Increase_Stability","239060155_The_Statistical_Theory_of_the_Strength_of_Bundles_of_Threads_I"]}