{"id":"273161689_Revenue_Maximization_with_Optimal_Capacity_Control_in_Infrastructure_as_a_Service_Cloud_Markets","abstract":"Infrastructure-as-a-Service cloud providers offer diverse purchasing options and pricing plans, namely on-demand, reservation, and spot market plans. This allows them to efficiently target a variety of customer groups with distinct preferences and to generate more revenue accordingly. An important consequence of this diversification however, is that it introduces a nontrivial optimization problem related to the allocation of the provider’s available data center capacity to each pricing plan. The complexity of the problem follows from the different levels of revenue generated per unit of capacity sold, and the different commitments consumers and providers make when resources are allocated under a given plan. In this work, we address a novel problem of maximizing revenue through an optimization of capacity allocation to each pricing plan by means of admission control for reservation contracts, in a setting where aforementioned plans are jointly offered to customers. We devise both an optimal algorithm based on a stochastic dynamic programming formulation and two heuristics that trade-off optimality and computational complexity. Our evaluation, which relies on an adaptation of a large-scale real-world workload trace of Google, shows that our algorithms can significantly increase revenue compared to an allocation without capacity control given that sufficient resource contention is present in the system. In addition, we show that our heuristics effectively allow for online decision making and quantify the revenue loss caused by the assumptions made to render the optimization problem tractable.","authors":["Adel N. Toosi","Kurt Vanmechelen","Kotagiri Ramamohanarao","Rajkumar Buyya"],"meta":["January 2014IEEE Transactions on Cloud Computing 3(3):1-1","DOI:10.1109/TCC.2014.2382119"],"references":["300445511_Comparison_of_Two_Yield_Management_Strategies_for_Cloud_Service_Providers","266030136_Optimizing_IaaS_Reserved_Contract_Procurement_Using_Load_Prediction","264371471_A_Novel_Model_for_Competition_and_Cooperation_Among_Cloud_Providers","261451515_Financial_Option_Market_Model_for_Federated_Cloud_Environments","243767251_A_Taxonomy_and_Research_Overview_of_Perishable-Asset_Revenue_Management_Yield_Management_Overbooking_and_Pricing","266257773_Approximate_Dynamic_Programming_Solving_the_Curses_of_Dimensionality","261245720_Dynamic_Cloud_Resource_Reservation_via_Cloud_Brokerage","261224460_Towards_Optimal_Capacity_Segmentation_with_Hybrid_Cloud_Pricing","260520251_Dynamic_Cloud_Pricing_for_Revenue_Maximization","232640787_Optimization_of_Resource_Provisioning_Cost_in_Cloud_Computing"]}