{"id":"273156506_Patient-matched_instruments_versus_standard_instrumentation_in_total_knee_arthroplasty_a_prospective_randomized_study","abstract":"Optimal positioning of implants and restoration of neutral mechanical axis are two primary surgical goals in total knee arthroplasty (TKA). Despite modern instruments and improved surgical techniques, malalignment remains an important cause of early failure after TKA. The aim of this prospective randomized study was to compare the value of a new patient-matched instrument system (PMI) (Signature(TM); Biomet, Inc, Warsaw, Indiana) to that of standard TKA surgical instrumentation (STD) in terms of coronal mechanical alignment, time of operation and blood loss.\nA total of 38 patients waiting for primary TKA were enrolled and randomized into two groups (19 PMI and 19 STD). Magnetic resonance imaging was performed in all patients in the PMI group, and specific instruments for the femur and tibia were designed preoperatively. All patients were operated on using the standard medial parapatellar approach with no use of tourniquet. Mechanical axis, time for the operation, and blood loss were evaluated.\nPatients in both groups had comparable age, body mass index, preoperative mechanical axis, Knee Society Score, and level of hemoglobin. Postoperative results showed that the PMI group fell significantly closer to neutral mechanical axis (STD: 2.7 ± 1.7, PMI: 1.7 ± 0.9; P = 0.013) with no outliers and a reduced time for the operation. There was no difference in the evaluation blood loss.\nThe use of PMI can contribute in achieving better mechanical axis with reduction in outliers and decreased operation time. Due to small differences between PMI and standard instruments, additional research are needed to confirm these preliminary results, and to discover potential benefits and functional improvements in the long-term outcome.","authors":["Andrej Moličnik","Jakob Naranda","Drago Dolinar"],"meta":["March 2015Wiener klinische Wochenschrift 127(Suppl 5)","DOI:10.1007/s00508-015-0703-0","SourcePubMed"],"references":["51641771_Computer-Assisted_Techniques_Versus_Conventional_Guides_for_Component_Alignment_in_Total_Knee_Arthroplasty","233930893_Benefits_of_using_customized_instrumentation_in_total_knee_arthroplasty_Results_from_an_activity-based_costing_model","232205374_Knee_Failure_Mechanisms_After_Total_Knee_Arthroplasty","228070824_Evaluation_of_the_accuracy_of_a_patient-specific_instrumentation_by_navigation","221759744_What's_New_in_Adult_Reconstructive_Knee_Surgery","51726181_Can_CT-based_patient-matched_instrumentation_achieve_consistent_rotational_alignment_in_knee_arthroplasty","51639625_The_Value_of_Patient-Matched_Instrumentation_in_Total_Knee_Arthroplasty","51509090_Comparison_Between_Computer-Assisted-Navigation_and_Conventional_Total_Knee_Arthroplasties_in_Patients_Undergoing_Simultaneous_Bilateral_Procedures_A_Randomized_Clinical_Trial","51122151_Biomechanical_Effects_of_Total_Knee_Arthroplasty_Component_Malrotation_A_Computational_Simulation","49832051_Three-Dimensional_Component_Alignment_and_Functional_Outcome_in_Computer-Navigated_Total_Knee_Arthroplasty_A_Prospective_Randomized_Study_Comparing_Two_Navigation_Systems"]}