{"id":"273102894_Variable_speed_limit_An_overview","abstract":"This paper provides an overview of various Variable Speed Limit (VSL) strategies developed over the last two decades. It first explains the theoretical background of VSL systems and how it can be used as dynamic traffic control device to improve traffic conditions and increase safety. An overview of VSL control strategies, ranging from early rule-based approaches to the most advanced network-wide coordinated approach is provided, followed by a discussion of their associated potential benefits and areas for improvement. The likely environmental benefits of VSL strategies are also discussed, along with some further related aspects of VSL application, such as driver compliance to VSL and the integration of a differential speed limit with VSL. Finally, the paper presents a critical review, pointing out some key issues that were identified from the literature review; and, recommends some directions for future research that need to be addressed as recommendations for best practices to underpin further refinement, development and application of VSL.","authors":["Bidoura Khondaker","Lina Kattan"],"meta":["January 2015Transportation Letters The International Journal of Transportation Research 7(5):1942787514Y.000","DOI:10.1179/1942787514Y.0000000053"],"references":["272118868_A_Probe-Based_Variable_Speed_Limit_System","268265918_Application_of_Simulation-Based_Traffic_Conflict_Analysis_for_Highway_APPLICATION_OF_SIMULATION-BASED_TRAFFIC_CONFLICT_ANALYSIS_FOR_HIGHWAY_SAFETY_EVALUATION","263387345_Cell_transmission_model_based_variable_speed_limit_control_for_freeways","261707248_Hysteresis_and_Capacity_Drop_Phenomena_in_Freeway_Networks_Empirical_Characterization_and_Interpretation","318287176_Nonlinear_Speed-control_for_a_Continuum_Theory_of_Traffic_Flow","313693672_Speed_limitation_on_freeways_Traffic-responsive_strategies","313620883_Variable_speed_limits_Safety_and_operational_impacts_of_a_candidate_control_strategy_for_freeway_applications","304375862_Optimal_Mainstream_Traffic_Flow_Control_of_Motorway_Networks","286825071_Reliability_of_Freeway_Traffic_Flow","274420829_New_Model_for_Variable_Speed_Limits"]}