{"id":"273104072_Ranking_sets_of_interacting_objects_via_semivalues","abstract":"In this paper, we address the problem of how to extend a ranking over single objects to another ranking over all possible collections of objects, taking into account the fact that objects grouped together can have mutual interaction. An answer to this issue is provided by using game theory and, specifically, the fact that an extension (i.e., a total proorder on the set of all subsets of objects) must be aligned with some probabilistic value, in the sense that the ranking of the objects (according to some probabilistic value computed on a numerical representation of the extension) must also preserve the primitive preorder on the singletons, no matter which utility function is used to represent the extension. We characterize families of aligned extensions, we focus on their geometric properties and we provide algorithms to verify their alignments. We also show that the framework introduced in this paper may be used to study a new class of extension problems, which integrate some features dealing with risk and complete uncertainty within the class of preference extension problems known in the literature with the name of sets as final outcomes.","authors":["Roberto Lucchetti","Stefano Moretti","Fioravante Patrone"],"meta":["July 2015Top 23(2)","DOI:10.1007/s11750-014-0357-5"],"references":["323715811_College_Admissions_and_the_Stability_of_Marriage","311344193_College_Admission_and_the_Stability_of_Marriage","288969635_Some_theoretical_reasons_for_using_regular_semivalues","287377818_Ranking_sets_of_possibly_interacting_objects_using_shapley_extensions","284289939_A_Value_for_n-Person_Games","268993583_Probabilistic_values_for_games","267405669_Ranking_Sets_of_Possibly_Interacting_Objects_Using_Shapley_Extensions","263988093_A_note_on_regular_semivalues","259764745_Automated_Search_for_Impossibility_Theorems_in_Social_Choice_Theory_Ranking_Sets_of_Objects","248414237_Weighted_Voting_Doesn't_Work_A_Mathematical_Analysis"]}