{"id":"273158482_Modeling_and_Analysis_of_Wireless_Channels_via_the_Mixture_of_Gaussian_Distribution","abstract":"Considerable efforts have been devoted to statistical modeling and the\ncharacterization of channels in a range of statistical models for fading\nchannels. In this paper, we consider a unified approach to model wireless\nchannels by the mixture of Gaussian (MoG) distribution. Simulations provided\nhave shown the new probability density function to accurately characterize\nmultipath fading as well as composite fading channels. We utilize the well\nknown expectation-maximization algorithm to estimate the parameters of the MoG\nmodel and further utilize the Kullback-Leibler divergence and the mean square\nerror criteria to demonstrate that our model provides both high accuracy and\nlow computational complexity, in comparison with existing results.\nAdditionally, we provide closed form expressions for several performance\nmetrics used in wireless communication systems, including the moment generating\nfunction, the raw moments, the amount of fading, the outage probability, the\naverage channel capacity, and the probability of energy detection for cognitive\nradio. Numerical Analysis and Monte-Carlo simulations are presented to\ncorroborate the analytical results and to provide detailed performance\ncomparisons with the other models in the literature.","authors":["Bassant Selim","Omar Alhussein","Sami Muhaidat","George K. Karagiannidis"],"meta":["March 2015IEEE Transactions on Vehicular Technology 65(99)","DOI:10.1109/TVT.2015.2503351","SourcearXiv","Project: Spectrum Sharing & Dynamic Spectrum Access in Future Wireless Networks"],"references":["329322914_Gaussian_mixtures_and_their_applications_to_signal_processing","308861161_On_the_capacity_of_the_underwater_acoustic_channel_with_dominant_noise_sources","303672489_Gaussian_Mixture_Models","286723765_Shadowed_fading_in_body-to-body_communications_channels_in_an_outdoor_environment_at_245_GHz","283815480_A_measurements_based_comparison_of_new_and_classical_models_used_to_characterize_fading_in_body_area_networks","279236862_Model_Selection_and_Multi-Model_Inference_A_Practical-Theoretical_Approach","278308117_Finite_Mixture_Distributions","278069140_Energy_Detection_Based_Spectrum_Sensing_Over_and_Extreme_Fading_Channels","277822705_Some_Integrals_Involving_the_Q_sub_M-Function","273395658_Human_Body_Shadowing_in_Cellular_Device-to-Device_Communications_Channel_Modeling_Using_the_Shadowed_Fading_Model"]}