{"id":"273145079_Assessment_of_Logical_Consistency_in_OpenStreetMap_Based_on_the_Spatial_Similarity_Concept","abstract":"The growth in the number of users and the volume of information in OpenStreetMap (OSM) indicate the success of this VGI-based project in attracting diverse sets of people from all over the world. A huge amount of information is generated daily by non-professional users and OSM faces the challenge of ensuring data quality. Spatial data quality comprises several basic elements; among them, logical consistency concerns the existence of logical contradictions within a dataset. It is one of the most important elements, but has not been studied much in VGI despite the key role in quality assurance. Because of the participatory nature of data collection and entry in OSM, the common consistency checking routines for spatial data should be revised. Since contributors have different views about objects, data integration in OSM may be considered as a form of multi-representation data combination. In this article, the concept of spatial similarity in multi-representation considering three elements, i.e. directional relationships, topological relationships, and metric distance relationships, is used to build a framework to determine the probable inconsistencies in OSM.","authors":["Peyman Hashemi","Rahim A. Abbaspour"],"meta":["March 2015","DOI:10.1007/978-3-319-14280-7_2","In book: OpenStreetMap in GIScience: Experiences, Research, and Applications (pp.19-36)Publisher: Springer International PublishingEditors: Jamal Jokar Arsanjani, Alexander Zipf, Peter Mooney, Marco Helbich"],"references":["313518500_An_empirical_study_on_relevant_aspects_for_sketch_map_alignment","266334963_A_Comparative_Study_of_Proprietary_Geodata_and_Volunteered_Geographic_Information_for_Germany","321605886_Crowdsourcing_Geographic_Knowledge_Volunteered_Geographic_Information_VGI_in_Theory_and_Practice","304124954_GIS_a_Computing_Perspective","300971620_Logical_consistency","295210967_Spatial_data_quality","292055490_Spatial_data_quality_Elements_of_spatial_data_quality","280296840_Spatial_Data_Quality","271561734_Assuring_the_Quality_of_Volunteered_Geographic_Information","259556537_A_Comprehensive_Framework_for_Intrinsic_OpenStreetMap_Quality_Analysis"]}