{"id":"273187950_Analyzing_best_practices_on_Web_development_frameworks_The_lift_approach","abstract":"Choosing the Web framework that best fits the requirements is not an easy task for developers. Several frameworks now exist to develop Web applications, such as Struts, JSF, Ruby on Rails, Grails, CakePHP, Django, and Catalyst. However, Lift is a relatively new framework that emerged in 2007 for the Scala programming language and which promises a great number of advantages and additional features. Companies such as Siemens© and IBM®, as well as social networks such as Twitter® and Foursquare®, have now begun to develop their applications by using Scala and Lift. Best practices are activities, technical or important issues identified by users in a specific context, and which have rendered excellent service and are expected to achieve similar results in similar situations. Each framework has its own best practices whose aim is to facilitate the development of Web applications. However, there is no current comparative analysis that identifies the best practices for Web frameworks. Thus, as its salient contribution, this paper identifies a set of best practices for Web frameworks. Afterwards, these best practices were analyzed and discussed in terms of developing Lift-based Web applications. The identification of these best practices would allow developers to construct more interactive and efficient Lift-based Web applications, integrating features of Web 2.0 technologies with less effort and exploiting the frameworks' benefits. In addition, this paper contains a comparative analysis with Web frameworks such as JSF, Struts, CakePHP, Ruby on Rails, Lift, Django, and Catalyst. Finally, as proof of concept, a set of Lift-based Web applications were developed for this paper by applying best practices such as actors, lazy loading, Comet support, SiteMap, Wiring, HyperText Markup Language, version 5 (HTML5) support, and parallel rendering.","authors":["María Del Pilar Salas Zarate","Giner Alor-Hernández","Rafael Valencia-García","Lisbeth Rodríguez"],"meta":["May 2015Science of Computer Programming 102","DOI:10.1016/j.scico.2014.12.004"],"references":["260377287_QTREDS_a_Ruby_on_Rails-based_platform_for_omics_laboratories","259821823_A_simple_versatile_solution_for_collecting_multidimensional_clinical_data_based_on_the_CakePHP_web_application_framework","316793597_The_Definitive_Guide_to_Lift","291076240_Beginning_CakePHP_From_novice_to_professional","285769896_Importance_of_software_documentation","285769346_Unit_Testing_Debugging_and_Instruments","281497968_Research_and_implementation_of_information_management_system_of_oil_field_based_on_Struts_framework","262294667_Analyzing_PHP_frameworks_for_use_in_a_project-based_software_engineering_course","261198919_Design_and_Implementation_of_Fire_Administrative_Management_System_Based_on_JSF_and_EJB30","259542489_A_systematic_review_of_tools_languages_and_methodologies_for_mashup_development"]}