{"id":"273176660_A_Decision-Theoretic_Rough_Set_Approach_for_Dynamic_Data_Mining","abstract":"Uncertainty and fuzziness generally exist in real-life data. Approximations are employed to describe the uncertain information approximately in rough set theory. Certain and uncertain rules are induced directly from different regions partitioned by approximations. Approximation can further be applied to data mining related task, e.g., attribute reduction. Nowadays, different types of data collected from different applications evolve with time, especially new attributes may appear while new objects are added. This paper presents an approach for dynamic maintenance of approximations w.r.t. objects and attributes added simultaneously under the framework of Decision- Theoretic Rough Set (DTRS). Equivalence feature vector and matrix are defined firstly to update approximations of DTRS in different levels of granularity. Then, the information system is decomposed into subspaces and the equivalence feature matrix is updated in different subspaces incrementally. Finally, the approximations of DTRS are renewed during the process of updating the equivalence feature matrix. Extensive experimental results verify the effectiveness of the proposed methods.","authors":["Hongmei Chen","Tianrui Li","Chuan Luo","Shi-Jinn Horng"],"meta":["December 2015IEEE Transactions on Fuzzy Systems 23(6):1-1","DOI:10.1109/TFUZZ.2014.2387877"],"references":["272911363_Evaluation_of_Rough_Set_Theory_Based_Network_TrafficData_Classifier_Using_Different_Discretization_Method","346010568_Autonomous_Knowledge-oriented_Clustering_Using_Decision-Theoretic_Rough_Set_Theory","312888648_Classification_of_rough_sets_dynamics","307967540_Incremental_Embedding_and_Learning_in_the_Local_Discriminant_Subspace_With_Application_to_Face_Recognition","290616211_Fuzzy_Logic_Computing_with_Words","285633816_Toward_a_theory_of_fuzzy_information_granulation_and_its_centrality_in_human_reasoning_and_fuzzy_logic","262320279_Granular_computing_neural-fuzzy_modelling_A_neutrosophic_approach","262219401_Modelling_Multi-agent_Three-way_Decisions_with_Decision-theoretic_Rough_Sets","262175242_Lecture_Notes_in_Computer_Science","260652527_Incremental_Lifecycle_Validation_of_Knowledge-Based_Systems_Through_CommonKADS"]}