{"id":"273294632_Interdisciplinary_Trends_in_Higher_Education","abstract":"The knowledge economy requires an adept workforce and cadre of leaders to help address the many challenges and needs facing companies, governments and societies worldwide. Many of the challenges we face today are new and there will undoubtedly be others arise in the future that will require innovative approaches and solutions to overcome them. No longer are higher education institutions able to train graduates to address all of the current and emerging challenges from a singular disciplinary source. Interdisciplinary (ID) approaches to research and training are essential underpinnings to best meet the dynamic needs of today’s higher education students. As the first in a series of forthcoming articles on ID research, this article examines ID trends in higher education research, instruction and degree offerings. It highlights how central ID solutions are in helping to address some of the most complex needs and challenges in higher education today, including how best to prepare higher education graduates for future employment and leadership positions.","authors":["W. James Jacob"],"meta":["January 2015Palgrave Communications 1(1):15001","DOI:10.1057/palcomms.2015.1","Project: Trends in Higher Education Research"],"references":["324656110_Cultivating_Creativity_in_Conservation_Science","317953623_Teacher_pedagogical_beliefs_The_final_frontier_in_our_quest_for_technology_integration","315975621_Mix_and_Match_Promoting_Interdisciplinary_Teaching_Learning_and_Community_through_Classroom-level_Partnerships","350653329_The_Liberal_Arts_College_Adapting_to_Change","349860890_Interdisciplinarity","327305437_Tomorrow's_Professor_Preparing_for_careers_in_science_and_engineering","325185299_Teaching_the_Linkages_among_Technology_Economics_and_Societal_Values_to_Interdisciplinary_Graduate_Students","319216560_Interdisciplinary_Researches_Of_The_Process_Of_Training","285633345_Towards_best_practice_in_online_learning_and_teaching_in_higher_education","284502093_A_taxonomy_of_interdisciplinarity"]}