{"id":"273258945_Brain_tumor_segmentation_based_on_a_hybrid_clustering_technique","abstract":"Image segmentation refers to the process of partitioning an image into mutually exclusive regions. It can be considered as the most essential and crucial process for facilitating the delin-eation, characterization, and visualization of regions of interest in any medical image. Despite intensive research, segmentation remains a challenging problem due to the diverse image content, cluttered objects, occlusion, image noise, non-uniform object texture, and other factors. There are many algorithms and techniques available for image segmentation but still there needs to develop an efficient, fast technique of medical image segmentation. This paper presents an efficient image segmentation approach using K-means clustering technique integrated with Fuzzy C-means algorithm. It is followed by thresholding and level set segmen-tation stages to provide an accurate brain tumor detection. The proposed technique can get benefits of the K-means clustering for image segmentation in the aspects of minimal computation time. In addition, it can get advantages of the Fuzzy C-means in the aspects of accuracy. The performance","authors":["Eman Abdelmaksoud","Mohammed Elmogy","Rashid Al-Awadi"],"meta":["January 2015Egyptian Informatics Journal"],"references":["288260534_Brain_Tumor_Detection_and_Identification_from_T1_Post_Contrast_MR_Images_Using_Cluster_Based_Segmentation","283479945_An_Experimental_Analysis_of_Fuzzy_C-Means_and_K-Means_Segmentation_Algorithm_for_Iron_Detection_in_Brain_SWI_using_Matlab","269978717_Segmentation_of_Bone_Structure_in_X-ray_Images_using_Convolutional_Neural_Network","306157770_Automatic_Segmentation_of_Brain_Tumour_from_Multiple_Images_of_Brain_MRI","288260467_Intelligent_Based_Brain_Tumor_Detection_Using_ACO","288258216_A_Study_of_Segmentation_Methods_forDetection_of_Tumor_in_Brain_MRI","288258215_Review_on_recent_image_segmentation_techniques","288257908_Segmentation_techniques_for_image_analysis_A_review","284908363_Image_segmentation_techniques","284653608_Snakes_Active_Contour_Models"]}