{"id":"273290734_Marine_Wind_and_Wave_Height_Trends_at_Different_ERA-Interim_Forecast_Ranges","abstract":"Trends in marine wind speed and significant wave height are investigated using the global reanalysis ERA-Interim over the period 1979-2012, based on monthly-mean and monthly-maximum data. Besides the traditional reanalysis, the authors include trends obtained at different forecast range, available up to 10 days ahead. Any model biases that are corrected differently over time are likely to introduce spurious trends of variable magnitude. However, at increased forecast range the model tends to relax, being less affected by assimilation. Still, there is a trade-off between removing the impact of data assimilation at longer forecast range and getting a lower level of uncertainty in the predictions at shorter forecast range. Because of the sheer amount of assimilations made in ERA-Interim, directly and indirectly affecting the data, it is difficult, if not impossible, to distinguish effects imposed by all updates. Here, special emphasis is put on the introduction of wave altimeter data in August 1991, the only type of data directly affecting the wave field. From this, it is shown that areas of higher model bias introduce quite different trends depending on forecast range, most apparent in the North Atlantic and eastern tropical Pacific. Results are compared with 23 in situ measurements, Envisat altimeter winds, and two stand-alone ECMWF operational wave model (EC-WAM) runs with and without wave altimeter assimilation. Here, the 48-h forecast is suggested to be a better candidate for trend estimates of wave height, mainly due to the step change imposed by altimeter observations. Even though wind speed seems less affected by undesirable step changes, the authors believe that the 24-48-h forecast more effectively filters out any unwanted effects.","authors":["Ole Johan Aarnes","Saleh Abdalla","Jean Bidlot","Oyvind Breivik"],"meta":["January 2015Journal of Climate 28(2):819-837","DOI:10.1175/JCLI-D-14-00470.1"],"references":["263498668_Wave_power_variability_and_trends_across_the_North_Pacific","258614897_Wind_Waves_in_the_Coupled_Climate_System","258495787_A_comparison_of_extratropical_cyclones_in_recent_reanalyses_ERA-interim_NASA_MERRA_NCEP_CFSR_and_JRA-25","284529285_Rank_Correlation_Methods","264047486_How_robust_is_the_recent_strengthening_of_the_Tropical_Pacific_Trade_Winds","261602891_Wave_Heights_in_the_21st_Century_Arctic_Ocean_Simulated_with_a_Regional_Climate_Model","261477176_Ten_years_of_ENVISAT_observations_at_ECMWF_a_review_of_activities_and_lessons_learnt","260939527_Patterns_and_cycles_in_the_Climate_Forecast_System_Reanalysis_wind_and_wave_data","260013296_Intercomparison_of_Wind_and_Wave_Data_from_the_ECMWF_Reanalysis_Interim_and_the_NCEP_Climate_Forecast_System_Reanalysis","259542191_Estimating_low-frequency_variability_and_trends_in_atmospheric_temperature_using_ERA-Interim"]}