{"id":"273337040_Work-Oriented_Design_of_Computer_Artifacts","abstract":"This thesis is an inquiry into the human activity of designing computer artifacts that are useful to people in their daily activity at work. The emphasis is on opportunities and constraints for industrial democracy and quality of work. First, the philosophical foundation of design of computer artifacts is con­ sidered. The need for a more fundamental understanding of design than the one offered by rationalistic systems thinking is argued. The alternative design philosophy suggested is based on pragmatic interpretations of the philosophies of existential phenomenology, emancipatory practice, and or­ dinary language. Design is seen as a concerned social and creative activity founded in our traditions, but aiming at transcending them by anticipation and construction of alternative futures. Second, it is argued that the existing disciplinary boundaries between natural sciences, social sciences and humanities are dysfunctional for the subject matter of designing computer artifacts. An alternative under­ standing of the subject matter and a curriculum for its study is discussed. The alternative emphasizes social systems design methods, a new theoreti­ cal foundation of design, and the new potential for design in the use of prototyping software and hardware. The alternative also emphasizes the need to learn from other more mature design disciplines such as architec­ tural design. Towards this background, and based on the practical research in two projects (DEMOS and UTOPIA), a view on work-oriented design of computer artifacts is presented. This concerns, thirdly, the collective resource approach to design of com­ puter artifacts-an attempt to widen the design process to also include trade union activities, and the explicit goal of industrial democracy in design and use. It is argued that a participative approach to the design process is not sufficient in the context of democratization. However, it is suggested that it is technically possible to design computer artifacts based on criteria such as skill and democracy at work, and a trade union investigation and negotia­ tion strategy is argued for as a democratic and workable complement to traditional design activities. Finally, a tOEil perspective-the ideal of skilled workers and designers in coopération designing computer artifacts as tools for skilled work is consid­ ered. It is concluded that computer artifacts can be designed with the ideal of c rail tools for a specific profession, utilizing interactive hardware devices and the computer's capacity for symbol manipulation to create this resemblance, and that a tool perspective, used with care, can be a useful design ideal. However, the ideological use of a tool metaphor is also taken into account, as is the instrumental blindness a tool perspective may create towards the importance of social interaction competence at work.","authors":["Pelle Ehn"],"meta":["May 1988","Publisher: Arbetslivscentrum, StockholmISBN: 91-86158-45-7"],"references":["319394658_The_Language_of_Dialectics_and_the_Dialectics_of_Language","312986364_The_nature_of_soft_systems_thinking_the_work_of_Churchman","295902223_On_Models_and_their_Role_in_the_Use_of_Computers","295899780_Design_and_Professional_Languages","289910310_Systems_Thinking_in_Management_The_Development_of_Soft_Systems_Methodology_and_Its_Implications_for_Social_Science","284980214_Whatever_became_of_design_methodology","284290165_Semiotics_and_informatics_Computers_as_media","275440423_Workplace_Reform_and_Democratic_Dialogue","270336436_The_Language_of_Post-Modern_Architecture","270162336_In_The_Structure_of_Scientific_Revolutions","263464591_Principles_of_Socio-Technical_Design_Re-visited","259703596_Understanding_Computers_and_Cognition_A_New_Foundation_for_Design","256600050_The_Name_of_the_Rose","249674082_Social_Choice_in_Machine_Design_The_Case_of_Automatically_Controlled_Machine_Tools_and_a_Challenge_for_Labor","249001335_Meaning_Context_and_Control_Convergent_Trends_and_Controversial_Issues_in_Current_Social-Scientific_Research_on_Human_Cognition_and_Communication"]}