{"id":"273389730_Self-regulation_of_time_management_Mental_contrasting_with_implementation_intentions","abstract":"Mental contrasting with implementation intentions (MCII) has been found to improve self-regulation across many life domains. The present research investigates whether MCII can benefit time management. In Study 1, we asked students to apply MCII to a pressing academic problem and assessed how they scheduled their time for the upcoming week. MCII participants scheduled more time than control participants who in their thoughts either reflected on similar contents using different cognitive procedures (content-control group) or applied the same cognitive procedures on different contents (format-control group). In Study 2, students were taught MCII as a metacognitive strategy to be used on any upcoming concerns of the subsequent week. As compared with the week prior to the training, students in the MCII (vs. format control) condition improved in self-reported time management. In Study 3, MCII (vs. format control) helped working mothers who enrolled in a vocational business program to attend classes more regularly. The findings suggest that performing MCII on one's everyday concerns improves time management. Copyright © 2015 John Wiley & Sons, Ltd.","authors":["Gabriele Oettingen","Heather Kappes","Katie B. Guttenberg","Peter M. Gollwitzer"],"meta":["March 2015European Journal of Social Psychology 45(2)","DOI:10.1002/ejsp.2090"],"references":["265446207_Planning_Promotes_goal_Striving","263762237_Promoting_integrative_bargaining_Mental_contrasting_with_implementation_intentions","325698272_Self-regulation_of_goal_setting_Turning_free_fantasies_about_the_future_into_binding_goals","319559822_Effects_of_a_group_forgiveness_intervention_on_forgiveness_perceived_stress_and_trait-anger","313071026_The_CES-D_Scale_A_self-report_depression_scale_for_research_in_the_general_popula-_tion","311469777_Beyond_pleasure_and_pain","285831994_Self-Efficacy_The_Exercise_of_Control","279608751_Processes_in_Delay_of_Gratification","278670129_Bounded_Effort_Automaticity_A_Drama_in_Four_Parts","272159642_The_Satisfaction_With_Life_Scale"]}