{"id":"273345595_Modeling_and_Verification_for_Cross-Department_Collaborative_Business_Processes_Using_Extended_Petri_Nets","abstract":"Recently, cross-department business processes are becoming more and more complex. Different kinds of coordination patterns exist among different departments, which make modeling and analysis work more difficult. To our best knowledge, there is no formal method to give systematic modeling and verification for the cross-department processes when considering different kinds of coordination patterns among different departments. This paper proposes such a method based on Petri nets. The WF-net model extended with resource and message factors, RM_WF_Net for short, is first introduced. Then, the formal model of tasks is proposed and its coordination relations are given. Next, RM_WF_Net modeling for intradepartment processes is investigated and cross-department coordination patterns, including message interaction pattern, resource interaction pattern, task collaboration pattern, procedure abstract, service outsourcing pattern, and process activation pattern, are formally defined. The soundness of the RM_WF_Net is verified based on the reachability graph. A running case of the cross-department medical diagnosis business process is given to validate our proposed method.","authors":["Qingtian Zeng","Faming Lu","Cong Liu","Hua Duan"],"meta":["February 2015IEEE Transactions on Systems, Man, and Cybernetics: Systems 45(2):349-362","DOI:10.1109/TSMC.2014.2334276"],"references":["272964070_Invariant_Decomposition_Conditions_for_Petri_Nets_Based_on_the_Index_of_Transitions","266860206_Understanding_Petri_nets_Modeling_techniques_analysis_methods_case_studies_Translated_from_the_German_by_the_author","348868693_System_Modeling_and_Control_with_Resource-Oriented_Petri_Nets","325369963_Modeling_and_control_of_discrete-event_dynamic_systems_With_petri_nets_and_other_tool","296611448_Method_of_workflow_model_performance_analysis","293284082_Modeling_and_analysis_based_on_Petri_net_for_IHE_workflow","287463918_Business_and_Scientific_Workflows_A_Web_Service-Oriented_Approach","285842809_Petri_Nets_Properties_Analysis_and_Applications","278720099_Optimized_cross-organizational_business_process_monitoring_Design_and_enactment","267072764_Petri_nets_Modeling_technique_analysis_methods_case_studies"]}