{"id":"273398707_A_Neuroevolution_Approach_to_General_Atari_Game_Playing","abstract":"This paper addresses the challenge of learning to play many different video games with little domain-specific knowledge. Specifically, it introduces a neuroevolution approach to general Atari 2600 game playing. Four neuroevolution algorithms were paired with three different state representations and evaluated on a set of 61 Atari games. The neuroevolution agents represent different points along the spectrum of algorithmic sophistication - including weight evolution on topologically fixed neural networks (conventional neuroevolution), covariance matrix adaptation evolution strategy (CMA-ES), neuroevolution of augmenting topologies (NEAT), and indirect network encoding (HyperNEAT). State representations include an object representation of the game screen, the raw pixels of the game screen, and seeded noise (a comparative baseline). Results indicate that direct-encoding methods work best on compact state representations while indirect-encoding methods (i.e., HyperNEAT) allow scaling to higher dimensional representations (i.e., the raw game screen). Previous approaches based on temporal-difference (TD) learning had trouble dealing with the large state spaces and sparse reward gradients often found in Atari games. Neuroevolution ameliorates these problems and evolved policies achieve state-of-the-art results, even surpassing human high scores on three games. These results suggest that neuroevolution is a promising approach to general video game playing (GVGP).","authors":["Matthew Hausknecht","Joel Lehman","Risto Miikkulainen","Peter Stone"],"meta":["December 2014IEEE Transactions on Computational Intelligence and AI in Games 6(4):355-366","DOI:10.1109/TCIAIG.2013.2294713"],"references":["272478871_General_Video_Game_Playing","319770434_The_First_Level_of_Super_Mario_Bros_is_Easy_with_Lexicographic_Orderings_and_Time_Travel_after_that_it_gets_a_little_tricky","289953470_Sketch-based_linear_value_function_approximation","287550753_Automatic_design_and_manufacture_of_robotic_life_forms","287151791_Human-Like_Combat_Behaviour_via_Multiobjective_Neuroevolution","268064067_Investigating_Contingency_Awareness_Using_Atari_2600_Games","261452205_A_video_game_description_language_for_model-based_or_interactive_learning","261161965_Building_high-level_features_using_large_scale_unsupervised_learning","257618569_TEXPLORE_Real-time_sample-efficient_reinforcement_learning_for_robots","257342368_Learning_Games_from_Videos_Guided_by_Descriptive_Complexity"]}