{"id":"273397923_Multi-Gbs_Software_Decoding_of_Polar_Codes","abstract":"This paper presents an optimized software implementation of a Successive Cancellation (SC) decoder for polar codes. Despite the strong data dependencies in SC decoding, a highly parallel software polar decoder is devised for x86 processor target. A high level of performance is achieved by exploiting the parallelism inherent in today's processor architectures (SIMD, multicore, etc.). Some optimizations that were originally thought for hardware implementation (memory reduction techniques and algorithmic simplifications) were also applied to enhance the throughput of the software implementation. Finally, some low level optimizations such as explicit assembly description or data packing are used to improve the throughput even more. The resulting decoder description is implemented on different x86 processor targets. An analysis of the decoder in terms of latency and throughput is proposed. The influence of several parameters on the throughput and the latency is investigated: the selected target, the code rate, the code length, the SIMD mode (SSE/AVX), the multithreading mode, etc. The energy per decoded bit is also estimated. The proposed software decoder compares favorably with state of the art software polar decoders. Extensive experimentations demonstrate that the proposed software polar decoder exceeds 1 Gb/s for code lengths N ≤ 217 on a single core and reaches multi-Gb/s throughputs when using four cores in parallel in AVX mode.","authors":["Bertrand Le Gal","Camille Leroux","Christophe Jego"],"meta":["January 2015IEEE Transactions on Signal Processing 63(2):349-359","DOI:10.1109/TSP.2014.2371781"],"references":["256546517_High_throughput_low_latency_LDPC_decoding_on_GPU_for_SDR_systems","312944042_Performance_of_Polar_Codes_for_Channel_and_Source_Coding","271554369_Performance_evaluation_of_LDPC_decoding_on_a_general_purpose_mobile_CPU","261271638_Accelerating_fast_Fourier_Transform_for_wideband_channelization","261229938_An_evaluation_on_using_GPU_coprocessing_for_software_radios_on_a_low-cost_platform","260708591_CRC-Aided_Decoding_of_Polar_Codes","258794022_Low-Latency_Sequential_and_Overlapped_Architectures_for_Successive_Cancellation_Polar_Decoder","257942369_A_pure_software_LDPC_decoder_on_a_multi-core_processor_platform_with_reduced_inter-processor_communication_cost","256911274_A_successive_cancellation_decoder_ASIC_for_a_1024-bit_polar_code_in_180nm_CMOS","256911270_A_Semi-Parallel_Successive-Cancellation_Decoder_for_Polar_Codes"]}