{"id":"273392542_An_Energy_and_Performance_Efficient_DVFS_Scheme_for_Irregular_Parallel_Divide-and-Conquer_Algorithms_on_the_Intel_SCC","abstract":"The divide-and-conquer paradigm can be used to express many computationally significant problems, but an important subset of these applications is inherently load-imbalanced. Load balancing is a challenge for irregular parallel divide-and-conquer algorithms and efficiently solving these applications will be a key requirement for future many-core systems. To address the load imbalance issue, instead of attempting to dynamically balancing the workloads, this paper proposes an energy and performance efficient Dynamic Voltage and Frequency Scaling (DVFS) scheduling scheme, which takes into account the load imbalance behavior exhibited by these applications. More specifically, we examine the core of the divide-and-conquer paradigm and determine that the base-case-reached point where recursion stops is a suitable place in a divide-and-conquer paradigm to apply the proposed DVFS scheme. To evaluate the proposed scheme, we implement four representative irregular parallel divide-and-conquer algorithms, tree traversal, quicksort, finding primes, and n-queens puzzle, on the Intel Single-chip Cloud Computer (SCC) many-core machine. We demonstrate that, on average, the proposed scheme can improve performance by 41% while reducing energy consumption by 36% compared to the baseline running the whole computation with the default frequency configuration (400MHz).","authors":["Yu-Liang Chou","Shaoshan Liu","Eui-Young Chung","Jean-Luc Gaudiot"],"meta":["January 2014IEEE Computer Architecture Letters 13(1):13-16","DOI:10.1109/L-CA.2013.1"],"references":["230807814_Acceleration_of_XML_Parsing_Through_Prefetching","220782416_The_48-core_SCC_Processor_the_Programmer's_View","3299652_On_the_Efficiency_of_Parallel_Backtracking","266717001_On_the_classification_of_parallel_algorithms","257680599_Pinned_OSServices_A_case_study_of_xml_parsing_on_intel_SCC","257251975_Understanding_the_future_of_energy-performance_trade-off_via_DVFS_in_HPC_environments","222689436_Just-in-time_dynamic_voltage_scaling_Exploiting_inter-node_slack_to_save_energy_in_MPI_programs","220826573_Load_balancing_of_irregular_parallel_divide-and-conquer_algorithms_in_group-SPMD_programming_environments","2870384_Practical_Parallel_Divide-and-Conquer_Algorithms"]}