{"id":"273388159_Model_Predictive_Control_under_Timing_Constraints_induced_by_Controller_Area_Networks","abstract":"When multiple model predictive controllers are implemented on a shared\ncontrol area network (CAN), their performance may degrade due to the\ninhomogeneous timing and delays among messages. The priority based real-time\nscheduling of messages on the CAN introduces complex timing of events,\nespecially when the types and number of messages change at runtime. This paper\nintroduces a novel hybrid timing model to make runtime predictions on the\ntiming of the messages for a finite time window. Controllers can be designed\nusing the optimization algorithms for model predictive control by considering\nthe timing as optimization constraints. This timing model allows multiple\ncontrollers to share a CAN without significant degradation in the controller\nperformance. The timing model also provides a convenient way to check the\nschedulability of messages on the CAN at runtime. Simulation results\ndemonstrate that the timing model is accurate and computationally efficient to\nmeet the needs of real-time implementation. Simulation results also demonstrate\nthat model predictive controllers designed when considering the timing\nconstraints have superior performance than the controllers designed without\nconsidering the timing constraints.","authors":["Zhenwu Shi","Fumin Zhang"],"meta":["March 2017Real-Time Systems 53(2)","DOI:10.1007/s11241-016-9263-2","SourcearXiv","Project: Scheduling and Control Co-Design for Cyber-Physical Systems"],"references":["282925754_Mutual_trust_based_scheduling_for_semiautonomous_multi-agent_systems","281391538_Dynamic_real-time_scheduling_for_human-agent_collaboration_systems_based_on_mutual_trust","275210332_Human-Robot_Mutual_Trust_in_Semiautonomous_Underwater_Robots","318205680_Calculating_controller_area_network_CAN_message_response_times","311996915_Scheduling_Feasibility_of_Energy_Management_in_Micro-Grids_Based_on_Significant_Moment_Analysis","306107190_Optimal_control_of_LTI_systems_over_unreliable_communications_links","283374505_Understanding_and_Using_the_Controller_Area_Network_Communication_Protocol","276106143_Design_Analysis_and_Real-time_Implementation_of_Networked_Predictive_Control_Systems","274084604_Model_Predictive_Control_System_Design_and_Implementation_using_MATLAB","262365011_Paper_Model_predictive_heuristic_control"]}