{"id":"273380880_Increasing_Adoption_of_Smart_Learning_Content_for_Computer_Science_Education","abstract":"Computer science educators are increasingly using interactive learning content to enrich and enhance the pedagogy of their courses. A plethora of such learning content, specifically designed for computer science education, such as visualization, simulation, and web-based environments for learning programming, are now available for various courses. We call such content smart learning content. However, such learning content is seldom used outside its host site despite the benefits it could offer to learners everywhere. In this paper, we investigate the factors that impede dissemination of such content among the wider computer science education community. To accomplish this we surveyed educators, existing tools and recent research literature to identify the current state of the art and analyzed the characteristics of a large number of smart learning content examples along canonical dimensions. In our analysis we focused on examining the technical issues that must be resolved to support finding, integrating and customizing smart learning content in computer science courses. Finally, we propose a new architecture for hosting, integrating and disseminating smart learning content and discuss how it could be implemented based on existing protocols and standards.","authors":["Peter Brusilovsky","Stephen H. Edwards","Amruth Kumar","Lauri Malmi"],"meta":["June 2014","DOI:10.1145/2713609.2713611","Conference: ITiCSE-WGR '14: Proceedings of the Working Group Reports of the 2014 on Innovation & Technology in Computer Science Education ConferenceAt: Uppsala, Sweden","Project: Infrastructure for Computer Science Education"],"references":["309120076_Learning_and_teaching_styles_in_engineering_education_Engr","282260627_Learning_SQL_Programming_with_Interactive_Tools_From_Integration_to_Personalization","282017068_MOOCs_A_Systematic_Study_of_the_Published_Literature_2008-2012","269923437_Learning_SQL_Programming_with_Interactive_Tools","319393897_Taxonomy_of_educational_objectives_The_classification_of_educational_goals_Handbook_I_cognitive_domain","314816876_DrJava_a_lightweight_pedagogic_environment_for_Java","290796278_The_Collected_Works_of_Vygotsky_vol_4_The_History_of_Development_of_Higher_Mental_Functions","287110473_WADEIn_II","281095381_The_history_of_development_of_higher_mental_functions_Chapter_2_Research_method","277374591_Lowering_the_barriers_to_programming"]}