{"id":"273327941_Parallelizing_the_dual_revised_simplex_method","abstract":"This paper introduces the design and implementation of two parallel dual\nsimplex solvers for general large scale sparse linear programming problems. One\napproach, called PAMI, extends a relatively unknown pivoting strategy called\nsuboptimization and exploits parallelism across multiple iterations. The other,\ncalled SIP, exploits purely single iteration parallelism by overlapping\ncomputational components when possible. Computational results show that the\nperformance of PAMI is superior to that of the leading open-source simplex\nsolver, and that SIP complements PAMI in achieving speedup when PAMI results in\nslowdown. One of the authors has implemented the techniques underlying PAMI\nwithin the FICO Xpress simplex solver and this paper presents computational\nresults demonstrating their value. This performance increase is sufficiently\nvaluable for the achievement to be used as the basis of promotional material by\nFICO. In developing the first parallel revised simplex solver of general\nutility and commercial importance, this work represents a significant\nachievement in computational optimization.","authors":["Q. Huangfu","Julian Hall"],"meta":["March 2015Mathematical Programming Computation 10(1)","DOI:10.1007/s12532-017-0130-5","SourcearXiv"],"references":["265381590_Novel_update_techniques_for_the_revised_simplex_method","258698596_A_High_Performance_Dual_Revised_Simplex_Solver","243776146_Notes_on_the_Dual_Simplex_Method","242916524_ASYNPLEX_an_asynchronous_parallel_revised_simplex_algorithm","262825438_A_review_of_the_LU_update_in_the_simplex_algorithm","245583174_Benchmarks_for_optimization_software","227446564_Evolution_of_Linear_Programming_Computing_Techniques","227187856_Updated_triangular_factors_of_the_basis_to_maintain_sparsity_in_the_product_form_simplex_method","227103753_Multiple_pricing_and_suboptimization_in_dual_linear_programming_algorithms","226395876_Pivot_Selection_Method_of_the_Devex_LP_Code"]}