{"id":"273308842_Qualifications_of_Physics_Teachers_in_ICT_to_Integrate_the_Use_of_ICT_in_Moroccan_Physics_Schools_Obstacles_and_Solutions","abstract":"In this paper, we focus on the qualification of physics sciences teachers in terms of the integration of the use of the in Information and Communication Technology ( ICT ) in Moroccan physics school, Continuous training courses for the teachers ICT are vital to improve the teaching quality, pedagogical skills also to update a teaching disciplinary . However, Moroccan teachers are not often profit from continuous training courses in ICT in general and especially ineducational simulation softwares. We propose in this paper distance learning ineducational simulation softwares. The objective of this distance learning is to ease the use of ICT in general and the educational simulation softwares for all the Moroccan teachers of physics sciences. This distance training courses will combines by the elements of flexibility and efficiency, flexible in terms of time and space because the physics teachers can have their training at any time they like and where ever they are whithout needed to displace, also flexible in term of choosing the desired and needed courses. Also this training is efficient because it is professional one and offers to the physics teachers the needed educational simulation softwares.","authors":["Khalid Mahdi","Mohamed Laafou"],"meta":["January 2015Journal of Educational and Social Research 5(1):177-182","DOI:10.5901/jesr.2015.v5n1p177","Projects: Conception d'un support numérique d'aide pour l'enseignement des sciences physiquesIngénierie pédagogique et l’enseignement des sciences physiques au MarocConception d'un support numérique d'aide pour l'enseignement des sciences physiques"],"references":["310795856_Distance_training_for_physics_teachers_in_education_sciences_flexible_and_efficient","304420572_Integration_des_TIC_dans_l'enseignement_des_sciences_physiques_au_Maroc_dans_le_cadre_du_programme_GENIE_difficultes_et_obstacles","260391401_Integration_des_technologies_de_l'information_et_de_la_communication_dans_le_travail_enseignant","216743334_The_learning_effects_of_computer_simulations_in_science_education","310795476_Distance_training_for_physics_teachers_in_education_sciences_flexible_and_efficient","220912388_Online_Testing_and_Grading_Using_WebCT_in_Computer_Science"]}