{"id":"273394027_Utility-Based_Resource_Allocation_for_Multi-Channel_Decentralized_Networks","abstract":"The architecture of decentralization makes future wireless networks more flexible and scalable. However, due to the lack of the central authority (e.g., BS or AP), the limitation of spectrum resource, and the coupling among different users, designing efficient resource allocation strategies for decentralized networks faces a great challenge. In this paper, we address the distributed channel selection and power control problem for a decentralized network consisting of multiple users, i.e., transmit-receiver pairs. Particularly, we first take the users' interactions into account and formulate the distributed resource allocation problem as a non-cooperative transmission control game (NTCG). Then, a utility-based transmission control algorithm (UTC) is developed based on the formulated game. Our proposed algorithm is completely distributed as there is no information exchange among different users and hence, is especially appropriate for this decentralized network. Furthermore, we prove that the global optimal solution can be asymptotically obtained with the devised algorithm, and more importantly, in contrast to existing utility-based algorithms, our method does not require that the converging point is one Nash equilibrium (NE) of the formulated game. In this light, our algorithm can be adopted to achieve efficient resource allocation in more general use cases.","authors":["Min Sheng","Chao Xu","Xijun Wang","Yan Zhang"],"meta":["October 2014IEEE Transactions on Communications 62(10):3610-3620","DOI:10.1109/TCOMM.2014.2357028","Project: Future Mobile Communications"],"references":["269296621_Energy-Aware_Competitive_Link_Adaptation_in_Small-Cell_Networks_Invited_Paper","260722743_Self-Organization_in_Decentralized_Networks_A_Trial_and_Error_Learning_Approach","260670865_A_Survey_of_Self_Organisation_in_Future_Cellular_Networks","312454318_The_evolution_of_conventions","265565410_Fundamentals_of_Wireless_Communication_Hardcover","264566998_Distributed_Channel_Selection_in_Time-Varying_Radio_Environment_Interference_Mitigation_Game_With_Uncoupled_Stochastic_Learning","263094244_Pricing-Based_Multiresource_Allocation_in_OFDMA_Cognitive_Radio_Networks_An_Energy_Efficiency_Perspective","261051743_Achieving_pareto_optimality_through_distributed_learning","260670532_Self-Configuration_and_Self-Optimization_in_LTE-Advanced_Heterogeneous_Networks","260657167_Self-Organization_in_Small_Cell_Networks_A_Reinforcement_Learning_Approach"]}