{"id":"273441805_Algoritmo_Inmune_de_Seleccion_Clonal_para_el_problema_de_Job_Shop_Scheduling","abstract":"En el presente artículo se establece una implementación de un algoritmo inmune artificial conocido como CLONALG para dar solución al problema de Job shop Scheduling (JSP), este es un problema de gran interés para la industria. Una de sus principales características es su naturaleza combinatoria y su complejidad, NP-Hard, la cual implica altos costos computacionales. Por tanto, se hace necesario abordar este tipo de problemáticas por medio de métodos que a pesar de que no encuentren soluciones óptimas en la mayoría de los casos, produzcan aproximaciones competitivas, a este tipo de métodos se les denomina metaheurísticas. Éstas garantizan soluciones aproximadas, y reducen el tiempo de cómputo, una de ellas los sistemas inmunes artificiales (SIA) que buscan, a partir de abstracciones, aprovechar las virtudes del sistema inmune biológico para brindar soluciones algorítmicas a problemas complejos en nuestro caso de optimización. El interés creciente en esta técnica de computación blanda radica en que es una técnica con amplio espectro de aplicación, ágil y poco demandante en términos complejidad computacional y uso de memoria. Keywords— CLONALG, Job Shop Scheduling, Optimización Combinatoria, Planificación de Trabajos, Sistemas Inmunes Artificiales I. INTRODUCCIÓN Los problemas de Scheduling aparecen constantemente en la vida real en numerosos ambientes productivos y de servicios. Son problemas en los cuales se requiere organizar la ejecución de trabajos que compiten entre sí por el uso de un conjunto finito de recursos, y que a su vez están sujetos a un conjunto de restricciones. Estos problemas son de naturaleza combinatoria, es decir, hay que elegir una entre un conjunto exponencialmente grande de combinaciones posibles. Este tipo de complejidad pertenece a la clase NP-Hard [1], en otras palabras, problemas en los que el tiempo de cómputo necesario para resolverlos crece desproporcionadamente conforme aumenta el tamaño del problema. Por esta razón los investigadores han desarrollado distintos métodos o algoritmos que procuren soluciones efectivas, ya sea de forma determinística o no [2]. Lo anterior plantea el reto de optimizar uno o varios criterios que se representan mediante funciones objetivo y que están relacionados con el costo, el beneficio o el tiempo de ejecución [3]. El objetivo de la optimización es maximizar o minimizar los criterios sujetos a las restricciones. Por ejemplo, maximizar la eficiencia de la utilización de las máquinas, minimizar el tiempo de ejecución, minimizar el tiempo de retardo entre trabajos, etc. Debido a su complejidad, los problemas de scheduling precisan de algoritmos de búsqueda eficientes para encontrar soluciones aceptables en tiempos razonables [4]. Por lo que en la literatura se pueden encontrar aproximaciones a los problemas de scheduling basadas en los algoritmos de búsqueda heurística propios de áreas como la Investigación Operativa y la Inteligencia Artificial [5], [6], entre estos en la literatura se relacionan nuevas implementaciones de algoritmos inspirados en la naturaleza como lo son los sistemas inmunes artificiales, que son el objeto de estudio del presente artículo.","authors":["Nelson Diaz","Wilfredo Ariel Gómez Bueno","Leidy Johana Luna","Lola Bautista"],"meta":["August 2013","Conference: Infornor Chile 2013 IV Congreso Internacional de Computación e Informática del Norte de Chil"],"references":["228776617_Un_algoritmo_voraz_para_resolver_el_problema_de_la_programacion_de_tareas_dependientes_en_maquinas_diferentes","227336463_Solving_job_shop_scheduling_problems_using_artificial_immune_system","310828581_An_artificial_immune_network_for_multimodal_function_optimization","283994900_Um_algoritmo_genetico_baseado_em_chaves_aleatorias_para_sequenciamento_de_operacoes","238691740_The_Complexity_of_Flowshop_and_Jobshop_Scheduling","235439125_Meta-heuristics_in_combinatorial_optimisation_Overview_and_conceptual_comparison","235323865_Clever_Algorithms_Nature-Inspired_Programming_Recipes","227446897_A_Fast_Taboo_Search_Algorithm_for_the_Job_Shop_Problem","223380998_An_Artificial_Immune_Algorithm_for_the_project_scheduling_problem_under_resource_constraints","221008200_Heuristics_and_a_hybrid_meta-heuristic_for_a_generalized_job-shop_scheduling_problem"]}