{"id":"273444648_Freer_Monads_More_Extensible_Effects","abstract":"We present a rational reconstruction of extensible effects, the recently proposed alternative to monad transformers, as the confluence of efforts to make effectful computations compose. Free monads and then extensible effects emerge from the straightforward term representation of an effectful computation, as more and more boilerplate is abstracted away. The generalization process further leads to freer monads, constructed without the Functor constraint. The continuation exposed in freer monads can then be represented as an efficient type-aligned data structure. The end result is the algorithmically efficient extensible effects library, which is not only more comprehensible but also faster than earlier implementations. As an illustration of the new library, we show three surprisingly simple applications: non-determinism with committed choice (LogicT), catching IO exceptions in the presence of other effects, and the semi-automatic management of file handles and other resources through monadic regions. We extensively use and promote the new sort of 'laziness', which underlies the left Kan extension: instead of performing an operation, keep its operands and pretend it is done.","authors":["Oleg Kiselyov","Hiromi Ishii"],"meta":["March 2015ACM SIGPLAN Notices 50(12)","DOI:10.1145/2887747.2804319","Conference: 17th Programming and Programming Languages workshop (PPL 2015)At: Matsuyama, Japan"],"references":["266661102_Reflection_without_Remorse_Revealing_a_hidden_sequence_to_speed_up_monadic_reflection","313217939_Foundations_for_structured_programming_with_GADTs","311463735_Lightweight_monadic_regions","286432596_Iteratees","269203332_Composing_and_decomposing_data_types","269079010_Extensible_effects","266661163_Composing_and_decomposing_data_types_a_closed_type_families_implementation_of_data_types_a_la_carte","266661150_Effect_Handlers_in_Scope","266520591_Category_Theory","262324458_Programming_and_Reasoning_with_Algebraic_Effects_and_Dependent_Types","262318951_Names_For_Free_-_Polymorphic_Views_of_Names_and_Binders","262271137_The_Constrained-Monad_Problem","262245757_Handlers_in_Action","262236674_Extensible_Effects_An_Alternative_to_Monad_Transformers","231879468_Parallel_parsing_processes"]}