{"id":"273471480_LINE_Large-scale_Information_Network_Embedding","abstract":"This paper studies the problem of embedding very large information networks\ninto low-dimensional vector spaces, which is useful in many tasks such as\nvisualization, node classification, and link prediction. Most existing graph\nembedding methods do not scale for real world information networks which\nusually contain millions of nodes. In this paper, we propose a novel network\nembedding method called the \"LINE,\" which is suitable for arbitrary types of\ninformation networks: undirected, directed, and/or weighted. The method\noptimizes a carefully designed objective function that preserves both the local\nand global network structures. An edge-sampling algorithm is proposed that\naddresses the limitation of the classical stochastic gradient descent and\nimproves both the effectiveness and the efficiency of the inference. Empirical\nexperiments prove the effectiveness of the LINE on a variety of real-world\ninformation networks, including language networks, social networks, and\ncitation networks. The algorithm is very efficient, which is able to learn the\nembedding of a network with millions of vertices and billions of edges in a few\nhours on a typical single machine. The source code of the LINE is available\nonline.","authors":["Jian Tang","Meng Qu","Mingzhe Wang","Ming Zhang"],"meta":["March 2015","DOI:10.1145/2736277.2741093","SourcearXiv"],"references":["266660385_Reducing_the_sampling_complexity_of_topic_models","347573615_Multidimensional_Scaling","319770439_Efficient_Estimation_of_Word_Representations_in_Vector_Space","314733943_Multidimensional_Scaling","307955489_Distributed_representations_of_words_and_phrases_and_their_compositionality","307631671_The_pagerank_citation_ranking_Bringing_order_to_the_web","287514944_Neural_word_embedding_as_implicit_matrix_factorization","285599593_A_Global_Geometric_Framework_for_Nonlinear_Dimensionality_Reduction","284035345_Nonlinear_Dimensionality_Reduction_by_Locally_Linear_Embedding","276935841_Introduction_to_Information_Retrieval"]}