{"id":"273450837_How_a_Prototype_Argues","abstract":"In this article, we argue that, just as an edition of a book can be a means of reifying a theory about how books should be edited, so can the creation of an experimental digital prototype be understood as conveying an argument about designing interfaces. Building on this premise, we explore theoretical affinities shared by recent design and book history scholarship, and connect those theories to the emerging practice of peer-reviewing digital objects in scholarly contexts. We suggest a checklist for subjecting prototypes directly to peer review:\n\nIs the argument reified by the prototype contestable, defensible, and substantive?\n\nDoes the prototype have a recognizable position in the context of similar work, either in terms of concept or affordances?\n\nIs the prototype part of a series of prototypes with an identifiable trajectory?\n\nDoes the prototype address possible objections?\n\nIs the prototype itself an original contribution to knowledge?\n\nWe also outline some implications for funding agencies interested in supporting researchers who are designing experimental computer prototypes. For instance, if a series of prototypes functions as a set of smaller arguments within a larger debate, it might be more appropriate to fund the sequence rather than treating each project as an individual proposal.","authors":["Alan Galey","Stan Ruecker","Implementing New Knowledge Environments (INKE)"],"meta":["October 2010Literary and Linguistic Computing 25(4)","DOI:10.1093/llc/fqq021","Sourcedx.doi.org"],"references":["274826020_In_Praise_of_the_Variant_A_Critical_History_of_Philology","324461930_The_Nature_of_the_Book_Print_and_Knowledge_in_the_Making","324344020_Erasmus_Man_of_Letters_The_Construction_of_Charisma_in_Print","314471515_In_Praise_of_the_Variant_A_Critical_History_of_Philology","313089162_Morphology_and_the_Book_from_an_American_Perspective","303435527_The_Fellowship_of_the_Book_Printed_Voices_and_Written_Friendships_in_More's_Utopia","303411366_Old_Books_and_new_Histories_An_Orientation_to_Studies_in_Book_and_Print_Culture","290708380_The_Form_of_Hamlet's_Fortunes","284768066_Out_of_Praxis_Three_MetaTheories_of_Textuality","275685612_Renaissance_Utopias_and_the_Problem_of_History"]}