{"id":"273474952_Distributed_Low-Overhead_Schemes_for_Multi-Stream_MIMO_Interference_Channels","abstract":"Our aim in this paper is to propose fully distributed schemes for transmit and receive filter optimization. The novelty of the proposed schemes is that they only require a few forward-backward iterations, thus causing minimal communication overhead. For that purpose, we relax the well-known leakage minimization problem, and then propose two different filter update structures to solve the resulting nonconvex problem: though one leads to conventional full-rank filters, the other results in rank-deficient filters, that we exploit to gradually reduce the transmit and receive filter rank, and greatly speed up the convergence. Furthermore, inspired from the decoding of turbo codes, we propose a turbo-like structure to the algorithms, where a separate inner optimization loop is run at each receiver (in addition to the main forward-backward iteration). In that sense, the introduction of this turbo-like structure converts the communication overhead required by conventional methods to computational overhead at each receiver (a cheap resource), allowing us to achieve the desired performance, under a minimal overhead constraint. Finally, we show through comprehensive simulations that both proposed schemes hugely outperform the relevant benchmarks, especially for large system dimensions.","authors":["Hadi Ghauch","Taejoon Kim","Mats Bengtsson","Mikael Skoglund"],"meta":["April 2015IEEE Transactions on Signal Processing 63(7):1737-1749","DOI:10.1109/TSP.2015.2396005"],"references":["261127840_Interference_Alignment_A_One-Sided_Approach","224861423_On_the_Overhead_of_Interference_Alignment_Training_Feedback_andCooperation","287372978_Interference_alignment_with_limited_feedback_In_IEEE_international_symposium_on_information_theory_2009","264160694_Large-Scale_MIMO_versus_Network_MIMO_for_Multicell_Interference_Mitigation","258794318_Comparison_of_Distributed_Beamforming_Algorithms_for_MIMO_Interference_Networks","258727003_A_Unified_Convergence_Analysis_of_Block_Successive_Minimization_Methods_for_Nonsmooth_Optimization","254029806_Optimizing_training_and_feedback_for_MIMO_interference_alignment","229058134_Convex_Optimization","224252051_Interference_Alignment_Algorithms_for_the_K_User_Constant_MIMO_Interference_Channel","224238546_A_Distributed_Numerical_Approach_to_Interference_Alignment_and_Applications_to_Wireless_Interference_Networks"]}