{"id":"273498204_Modeling_of_Safety-Critical_Systems_Using_Petri_Nets","abstract":"Safety plays a crucial role in the development of complex computer systems in the relevant areas like railway transport, process industry, power plants, etc. In the design phase of safety-critical systems, various methods are used to make the system work correctly. Due to advancements in technology, safety-critical systems are equipped with the necessary safety precautions but not completely. The malfunctioning of systems may lead to catastrophic accidents. Compared to commonly used safety-analysis approaches like Failure Mode and Effects Analysis, Fault Tree Analysis, Event Tree Analysis, etc., Petri Nets are more suitable for hazard analysis as they can specify data flow and stochastic interdependencies. An example safety-critical system, Railroad Crossing Junction has been modeled using Petri Nets for hazard analysis to detect the occurrences of possible hazards in the system. The proposed modeling framework provides a flexible graphical representation allowing a qualitative analysis based on the safe and unsafe state representations and a quantitative analysis based on the reachability graph that in turn leads to an effective safety analysis. The result of careful and rigorous safety analysis is to identify unsafe states. The results of safety analysis can be used by the designer for re-designing the system to improve safety. The designer of the system needs to repeat the process to detect the unsafe states.","authors":["B. Esther Sunanda","P. Seetharamaiah"],"meta":["February 2015ACM SIGSOFT Software Engineering Notes 40(1):1-7","DOI:10.1145/2693208.2693238"],"references":["291874996_System_modeling_with_Petri_nets","255678457_Fault_Analysis_Using_Petri_Nets","221502705_Recent_Catastrophic_Accidents_Investigating_How_Software_was_Responsible","221051955_Specification_Safety_and_Reliability_Analysis_Using_Stochastic_Petri_Net_Models","2830405_System_Modelling_With_Petri_Nets","303284626_FMEA_and_fault_tree_based_software_safety_analysis_of_a_railroad_crossing_critical_system","285842809_Petri_Nets_Properties_Analysis_and_Applications","261055287_Modeling_and_Prediction_of_Performability_of_Safety_Critical_Computer_Based_Systems_Using_Petri_Nets","220695413_Software_safety_and_reliability_-_techniques_approaches_and_standards_of_key_industrial_sectors","220692377_Metrics_and_Models_in_Software_Quality_Engineering","220616271_Modeling_and_Analysis_of_Workflows_Using_Petri_Nets","3952061_Safety_Critical_Systems_Challenges_and_Directions","2984167_Analysis_and_Applications_Proceedings_of_the_IEEE_774_541-580","2617823_Software_Engineering_for_Safety_A_Roadmap","2548883_Combining_Fault_Trees_And_Petri_Nets_To_Model_Safety-Critical_Systems"]}