{"id":"273407216_Mobile_App_Rating_Scale_A_New_Tool_for_Assessing_the_Quality_of_Health_Mobile_Apps","abstract":"The use of mobile apps for health and well being promotion has grown exponentially in recent years. Yet, there is currently no app-quality assessment tool beyond \"star\"-ratings.\nThe objective of this study was to develop a reliable, multidimensional measure for trialling, classifying, and rating the quality of mobile health apps.\nA literature search was conducted to identify articles containing explicit Web or app quality rating criteria published between January 2000 and January 2013. Existing criteria for the assessment of app quality were categorized by an expert panel to develop the new Mobile App Rating Scale (MARS) subscales, items, descriptors, and anchors. There were sixty well being apps that were randomly selected using an iTunes search for MARS rating. There were ten that were used to pilot the rating procedure, and the remaining 50 provided data on interrater reliability.\nThere were 372 explicit criteria for assessing Web or app quality that were extracted from 25 published papers, conference proceedings, and Internet resources. There were five broad categories of criteria that were identified including four objective quality scales: engagement, functionality, aesthetics, and information quality; and one subjective quality scale; which were refined into the 23-item MARS. The MARS demonstrated excellent internal consistency (alpha = .90) and interrater reliability intraclass correlation coefficient (ICC = .79).\nThe MARS is a simple, objective, and reliable tool for classifying and assessing the quality of mobile health apps. It can also be used to provide a checklist for the design and development of new high quality health apps.","authors":["Stoyan R Stoyanov","Leanne Hides","David J. Kavanagh","Oksana Zelenko"],"meta":["March 2015JMIR mhealth and uhealth 3(1):e27","DOI:10.2196/mhealth.3422"],"references":["265734474_mHealth_and_Mobile_Medical_Apps_A_Framework_to_Assess_Risk_and_Promote_Safer_Use","264312757_A_Preliminary_Survey_of_Knowledge_Discovery_on_Smartphone_Applications_apps_Principles_Techniques_and_Research_Directions_for_E-health","235414815_Issues_and_considerations_for_healthcare_consumers_using_mobile_applications","230834969_Conceptual_Framework_for_Development_of_Comprehensive_e-Health_Evaluation_Tool","230562606_Computing_Inter-Rater_Reliability_for_Observational_Data_An_Overview_and_Tutorial","221409909_Measurement_of_user-perceived_web_quality","313629843_Cisco_Visual_Networking_Index_Global_Mobile_Data_Traffic_Forecast_Update_2014-2019","261526189_Trusting_smartphone_Apps_To_install_or_not_to_install_that_is_the_question","228324961_Sample_size_formulas_for_estimating_intraclass_correlation_coefficients_with_precision_and_assurance","222544401_Developing_and_Validating_an_Instrument_for_Measuring_User-Perceived_Web_Quality"]}