{"id":"273405864_Finding_the_Form_of_an_Irregular_Meshed_Steel_and_Glass_Shell_Based_on_Construction_Constraints","abstract":"In the context of the search for an efficient structural shape to cover the Dutch Maritime Museum courtyard in Amsterdam, Netherlands, the authors briefly discuss the driving design factors that influenced the earliest glass roof coverings. The trends that emerged during the late 20th and early 21st century in the design of skeletal steel glass shells are exposed. These design developments range from sculptural to geometric and structural intentions. The discussion of the competition design development of the Dutch Maritime Museum steel glass shell roof shows the quest for a structurally efficient catenary form based on a poetic geometric idea. This paper presents a construction-driven design methodology that slightly adapts the numerical form found catenary shape with the objective of achieving planarity in all the triangulated, four-sided and five-sided mesh faces. The challenge of facet planarity is gracefully solved by an analytical origami approach and presented. This approach is compared with finding the Maxwell reciprocal network diagram. The final faceted shape shows elegance and structural efficiency.","authors":["Sigrid Adriaenssens","Laurent Ney","Eric Bodarwe","Chris J K Williams"],"meta":["September 2012Journal of Architectural Engineering 18(3):206-213","DOI:10.1061/(ASCE)AE.1943-5568.0000074","Project: Bending-Active Elastic Rod and Strip Systems"],"references":["303161560_The_analytic_and_numerical_definition_of_the_geometry_of_the_British_Museum_Great_Court_Roof","279894928_Particle-spring_systems_for_structural_form_finding","271523278_Computational_morphogenesis_in_architecture_the_cost_optimization_of_free_form_grid-shells","264843797_The_definition_of_curved_geometry_for_widespan_enclosures","299311147_The_Art_of_Structural_Design_A_Swiss_Legacy","273976126_Eurocode_0_Basis_of_Structural_Design","273108840_Glass_Houses_A_History_of_Greenhouses_Orangeries_and_Conservatories","264523422_Geometrie-Prinzipien_fur_wirtschaftliche_und_effiziente_Schalentragwerke_Teil_1","246661547_Le_Figure_Reciproche_Nella_Statica_Grafica","246379698_History_of_Strength_of_Materials"]}