{"id":"273425327_A_New_Teaching_Approach_in_Basic_Sciences_Peer_Assisted_Learning","abstract":"Studies on medical education suggest that Peer Assisted Learning (PAL) could be an acceptable and beneficial educational strategy to organize the programs by which students can tutor or teach their peers. The present study conducted in Birjand University of Medical Sciences to examine and compare the effects of two educational methods: Peer Assisted Learning and lecture on medical students learning and retention scores. This semi-experimental study was conducted on medical basic pharmacology teaching for students who divided in PAL and lecture groups based on demographic features through a block randomized sampling method. Data compiled using a questionnaire consisting of: a) 15 demographic questions and b) 30 multiple choice questions [knowledge level (15 questions), comprehension level (11 questions) and application level (4 questions)]. The teaching were carried out in eight sessions (1.5 hours each) for both groups who were attended the pre-test, immediate and also three mouths post-test without any prior notice. The student's learning and retention determined by subtracting of pre-test and immediate post-test scores, as well as immediate post-test and three months post-test scores after teaching, respectively. Paired t-test and t-test were used for assessing effectiveness of educational methods. The study demonstrates: a) both methods increase learning scores (p< 0.001); b) PAL learning scores significantly are higher than lecture in overall and knowledge level (p< 0.02) as well as comprehension and application levels (p< 0.001); c) PAL retention marks are dramatically higher compared with lecture in overall (P< 0.00l), comprehension and application levels (P< 0.02); but not in knowledge level (P> 0.05). These findings support the notion that PAL is more effective than lecture on student's learning and retention, specifically in comprehension and application levels. PAL could be an effective mean to encourage students and improve their knowledge and performance in basic sciences. (C) 2013 The Authors. Published by Elsevier Ltd.","authors":["Mohammadreza Abedini","Fathieh Mortazavi","Seyed Alireza Javadinia","Karimi Moonaghi Hossein"],"meta":["July 2013Procedia - Social and Behavioral Sciences 83:39-43","DOI:10.1016/j.sbspro.2013.06.008"],"references":["26766266_Involvement_in_teaching_improves_learning_in_medical_students_A_randomized_cross-over_study","312971776_Introduction_to_peer_Assisted_learning","288080165_The_21_clinical_placement_model_Perceptions_of_clinical_educators_and_students","244829407_A_juggling_act_in_the_classroom_Managing_different_learning_styles","233751642_The_Use_of_Student_Derived_Marking_Criteria_in_Peer_and_Self-assessment","232038860_A_Peer-Assisted_Learning_System_'PALS'_approach_to_teaching_basic_sciences_A_model_developed_in_basic_medical_pharmacology_instruction","223073018_Environments_processes_and_mechanisms_in_peer_learning","46821010_The_Impact_of_Team-Based_Learning_on_Medical_Students'_Academic_Performance","44651708_Can_training_in_musculoskeletal_examination_skills_be_effectively_delivered_by_undergraduate_students_as_part_of_the_standard_curriculum","26721620_A_model_of_clinical_problem-based_learning_for_clinical_attachment_in_medicine","23501959_Self_and_peer_assessment_-_Does_it_make_a_difference_to_student_group_work","23501929_Clinician_and_student_evaluation_of_a_collaborative_clinical_teaching_model","20121423_Peer_evaluation_as_a_teaching-learning_strategy_in_baccalaureate_education_for_community_health_nursing","11278443_Twelve_tips_for_peer-assisted_learning_A_classic_concept_revisited","7068141_Student_perceptions_of_effective_small_group_teaching_Medical_Education_38_286-293_LR17"]}