{"id":"273559873_CREW_PRAMs_and_decision_trees","abstract":"This paper gives a full characterization of the time needed to compute a boolean function on a CREW PRAM with an unlimited number of processors.The characterization is given in terms of a new complexity measure of boolean functions: the “block sensitivity,” a generalization of the well-known “critical sensitivity” measure. The block sensitivity is also shown to relate to the boolean decision tree complexity, and the implication is that the decision tree complexity also fully characterizes the CREW PRAM complexity. This solves an open problem of Wegener.\nThe results imply that changes in the instruction set of the processors or in the capacity of the shared memory cells do not change by more than a constant factor the time required by a CREW PRAM to compute any boolean function. Moreover, it is shown that a seemingly weaker version of a CREW PRAM, the CROW PRAM, can compute functions as quickly as a general CREW PRAM. This solves an open problem of Dymond and Ruzzo.\nFinally, the results have implications regarding the power of randomization in the boolean decision tree model. It is shown that in this model, randomization may achieve only a polynomial speedup over deterministic computation. This was known for Las Vegas randomized computation; it is also proven for one-sided error computation (a quadratic bound) and two-sided error (a cubic bound).","authors":["Noam Nisan"],"meta":["December 1991SIAM Journal on Computing 20(6):999-1007","DOI:10.1137/0220062"],"references":["220897257_Parallel_RAMs_with_Owned_Global_Memory_and_Deterministic_Context-Free_Language_Recognition_Extended_Abstract","267160178_Query_complexity_or_why_is_it_difficult_to_separate_NP_A_coNP_A_from_P_A_by_random_oracles_APH","256391834_Further_results_on_the_Aanderaa-Rosenberg_conjecture","234783892_On_the_time_required_to_recognize_properties_of_graphs","225788159_The_conjunctive_complexity_of_quadratic_Boolean_functions","222448509_On_recognizing_graph_properties_from_adjacency_matrices","221149980_Lecture_Notes_in_Computer_Science","220688436_The_Complexity_of_Boolean_Functions","220617172_Upper_and_Lower_Time_Bounds_for_Parallel_Random_Access_Machines_without_Simultaneous_Writes","220616418_Trade-Offs_Between_Depth_and_Width_in_Parallel_Computation","220148791_Lower_Bounds_on_Probabilistic_Linear_Decision_Trees","220112053_The_Critical_Complexity_of_Graph_Properties"]}