{"id":"273513099_A_Novel_Scheme_to_Minimize_Hop_Count_for_GAF_in_Wireless_Sensor_Networks_Two-Level_GAF","abstract":"In wireless sensor networks, geographic adaptive fidelity (GAF) is one of the most popular energy-aware routing protocols. It conserves energy by identifying equivalence between sensors from a routing perspective and then turning off unnecessary sensors, while maintaining the connectivity of the network. Nevertheless, the traditional GAF still cannot reach the optimum energy usage since it needs more number of hops to transmit data packets to the sink. As a result, it also leads to higher packet delay. In this paper, we propose a modified version of GAF to minimize hop count for data routing, called two-level GAF (T-GAF). Furthermore, we use a generalized version of GAF called Diagonal-GAF (DGAF) where two diagonal adjacent grids can also directly communicate. It has an advantage of less overhead of coordinator election based on the residual energy of sensors. Analysis and simulation results show significant improvements of the proposed work comparing to traditional GAF in the aspect of total hop count, energy consumption, total distance covered by the data packet before reaching the sink, and packet delay. As a result, compared to traditional GAF, it needs 40% to 47% less hop count and consumes 27% to 35% less energy to extend the network lifetime.","authors":["Vaibhav Soni","Dheeresh K. Mallick"],"meta":["February 2015Journal of Computer Networks and Communications 2015(3-4):1-9","DOI:10.1155/2015/527594"],"references":["265845857_Localization_in_wireless_sensor_networks_Classification_and_evaluation_of_techniques","258389033_A_Survey_of_Localization_in_Wireless_Sensor_Network","225749687_Monte-Carlo_Localization_for_Mobile_Wireless_Sensor_Networks","307762487_A_Survey_of_Localization_in_Wireless_Sensor_Network","288350735_Survey_on_routing_protocols_in_wireless_sensor_networks","265800371_Multi-hop_Topology_Control_Algorithm_for_Wireless_Sensor_Networks","261313401_Routing_Protocols_in_Wireless_Sensor_Networks_A_Survey","236183037_Wireless_Sensor_Networks_A_Networking_Perspective","235200425_Routing_and_Addressing_Problems_in_Large_Metropolitan-Scale_Internetworks","222837567_Langendoen_K_Monte_Carlo_Localization_for_Mobile_Wireless_Sensor_Networks_Ad_Hoc_Networks_6_718-733"]}