{"id":"273504916_Bibliometric_analysis_of_two_subdomains_in_philosophy_free_will_and_sorites","abstract":"In this study we tested the fruitfulness of advanced bibliometric methods for mapping subdomains in philosophy. The development of the number of publications on free will and sorites, the two subdomains treated in the study, over time was studied. We applied the cocitation approach to map the most cited publications, authors and journals, and we mapped frequently occurring terms, using a term co-occurrence approach. Both subdomains show a strong increase of publications in Web of Science. When we decomposed the publications by faculty, we could see an increase of free will publications also in social sciences, medicine and natural sciences. The multidisciplinary character of free will research was reflected in the cocitation analysis and in the term co-occurrence analysis: we found clusters/groups of cocited publications, authors and journals, and of co-occurring terms, representing philosophy as well as non-philosophical fields, such as neuroscience and physics. The corresponding analyses of sorites publications displayed a structure consisting of research themes rather than fields. All in all, both philosophers involved in this study acknowledge the validity of the various networks presented. Bibliometric mapping appears to provide an interesting tool for describing the cognitive orientation of a research field, not only in the natural and life sciences but also in philosophy, which this study shows.","authors":["Per Ahlgren","Peter Pagin","Olle Persson","Maria Svedberg"],"meta":["April 2015Scientometrics 103(1)","DOI:10.1007/s11192-015-1535-4"],"references":["285473885_How_to_use_Bibexcel_for_various_types_of_bibliometric_analysis","284078906_A_performance_indicator_based_on_complete_data_for_the_scientific_publication_output_at_research_institutions","260603814_Triple_Helix_indicators_as_an_emergent_area_of_enquiry_A_bibliometric_perspective","345729174_LIETUVOS_FILOSOFIJOS_RAIDA_1960-2010_APIMTIS_INSTITUCIJOS_LEIDINIAI","292455592_The_development_of_Lithuanian_philosophy_during_1960-2010_Volume_institutions_publications","291809211_The_death_of_the_scholarly_monograph_in_the_humanities_Citation_patterns_in_literary_scholarship","290703981_Interdisciplinarity_and_New_Methodologies_in_Art_History_A_Citation_Analysis","263682375_Harvesting_footnotes_in_a_rural_field_Citation_patterns_in_Swedish_literary_studies","260357122_Visualizing_the_history_of_evidence-based_medicine_A_bibliometric_analysis","258507392_EU27_and_USA_leadership_in_fruit_and_vegetable_research_A_bibliometric_study_from_2000_to_2009"]}