{"id":"273502012_Changing_the_Learning_Environment_in_the_College_of_Engineering_and_Applied_Science_Using_Challenge_Based_Learning","abstract":"Over the past 20 years there have been many changes to the primary and secondary educational system that have impacted students, teachers, and post-secondary institutions across the United States of America. One of the most important is the large number of standardized tests students are required to take to show adequate performance in school. Students think differently because they are taught differently due to this focus on standardized testing, thus changing the skill sets students acquire in secondary school. This presents a critical problem for colleges and universities, as they now are using practices for and have expectations of these students that are unrealistic for the changing times. High dropout rates in the colleges of engineering have been attributed to the cultural atmosphere of the institution. Students have reported a low sense of belonging and low relatability to course material. To reduce negative experiences and increase motivation, Challenge Based Learning (CBL) was introduced in an undergraduate Basic Electric Circuits (BEC) course. CBL is a structured model for course content with a foundation in problem-based learning. CBL offers general concepts from which students derive the challenges they will address. Results show an improved classroom experience for students who were taught with CBL.","authors":["Whitney Gaskins","Jeffrey Johnson","Cathy Maltbie","Anant Kukreti"],"meta":["February 2015","DOI:10.3991/ijep.v5i1.4138"],"references":["283749746_The_future_of_engineering_education_Part_1_A_vision_for_a_new_century","271672153_Learning_History_in_Middle_School_by_Designing_Multimedia_in_a_Project-Based_Learning_Experience","292719172_The_extent_to_which_psychology_students_read_textbooks_A_multiple_class_analysis_of_reading_across_the_psychology_curriculum","281508477_Statistics_Anxiety_And_Science_Attitudes_Age_Gender_And_Ethnicity_Factors","275911479_The_Case_Against_Standardized_Testing_Raising_the_Scores_Ruining_the_Schools","272160038_Learning_and_Awareness","270152487_Understanding_Research_in_Second_Language_Learning_A_Teacher's_Guide_to_Statistics_and_Research_Design","266498065_WHY_WOMEN_LEAVE_ENGINEERING","264217997_Engineering_Student_Attitudes_Assessment","258261295_Case_Study_Research_in_Education_A_Qualitative_Approach"]}