{"id":"273684926_String_Matching_Algorithms_for_Intrusion_Detection_System_A_Survey_and_Taxonomy","abstract":"Nowadays the Internet is very massive and the need for a system to protect the networks from being attacked becomes very important. The Intrusion Detection System (IDS) is an important part of any modern network to detect the intrusion activities in the network. IDS inspects the content of the packets and identify the attack signatures by utilizing string matching algorithms. As network technology goes\ninto high speed and complex structure, the need for efficient and accurate string matching techniques has increased and become important for identifying and detecting malicious packets. However, most string matching algorithms did not work well in high-speed networks without dropping the network packets during the matching process. In this work, we investigate important IDS string matching\nalgorithms in order to provide some suggestions for the characteristics of good string matching algorithm which will work properly and can be fully adapted to work in a complex environment such as IDS. We suggest implementing the hybrid string matching algorithm for IDS as alternative of using the current single string matching algorithms, to provide faster performance and resistance against any algorithmic performance attack.","authors":["Awsan A. Hasan","Nur'Aini Abdul Rashid","Atheer Akram Abdulrazzaq","Muhannad A. Abu-Hashem"],"meta":["April 2013International Journal of Advancements in Computing Technology 5(8):317-333","DOI:10.4156/ijact.vol5.issue8.36","Project: exact String matching"],"references":["233856094_Feasibility_of_Intrusion_Detection_System_with_High_Performance_Computing_HPC_A_Survey","225156476_Survey_and_Taxonomy_of_Feature_Selection_Algorithms_in_Intrusion_Detection_System","344575215_Enhancing_Computer_Security_with_Smart_Technology","269786293_Research_on_Cluster_Analysis_for_Intrusion_Detection_System","269778927_An_Architecture_for_Parallelizing_Network_Monitoring_Based_on_Multi-Core_Processors","267964633_An_Efficient_Automaton_Based_Matching_Algorithm_and_Its_Application_in_Intrusion_Detection_System","267418431_Robust_Quick_String_Matching_Algorithm_for_Network_Security","245405720_A_fast_and_scalable_string_matching_algorithm_using_contents_correction_signature_hashing_for_network_IDS","242429635_Techniques_for_Improving_the_Performance_of_Signature-Based_Network_Intrusion_Detection_Systems","228769672_Optimizing_pattern_matching_for_intrusion_detection"]}