{"id":"273682037_Characterization_of_seawater_intrusion_using_2D_electrical_imaging","abstract":"We have investigated the potential of 2D electrical imaging for the characterization of seawater intrusion using field data from a site in Almeria, SE Spain. Numerical simulations have been run for several scenarios, with a hydrogeological model reflecting the local site conditions. The simulations showed that only the lower salt concentrations of the seawater-freshwater transition zone could be recovered, due to the loss of resolution with depth. We quantified this capability in terms of the cumulative sensitivity associated with the measurement setup and showed that the mismatch between the targeted and imaged parameter values occurs from a certain sensitivity threshold. Similarly, heterogeneity may only be determined accurately if located in an adequately sensitive area. At the field site, we identified seawater intrusion at the scale of a few kilometres down to a hundred metres. Borehole logs show a remarkable correlation with the image obtained from surface data but indicate that the electrically derived mass fraction of pure seawater could not be recovered due to the discrepancy between the in-situ and laboratory-derived petrophysical relationships. Surface-to-hole inversion results suggest that the laterally varying resolution pattern associated with such a setup dominates the image characteristics compared to the laterally more homogeneous resolution pattern of surface only inversion results and hence, surface-to-hole images are not easily interpretable in terms of larger-scale features. Our results indicate that electrical imaging can be used to constrain seawater intrusion models if image appraisal tools are appropriately used to quantify the spatial variation of sensitivity and resolution. The most crucial limitation is probably the apparent non-stationarity of the petrophysical relationship during the imaging process.","authors":["Frederic Nguyen","Andreas Kemna","A. Antonsson","Peter Engesgaard"],"meta":["October 2009Near Surface Geophysics 7(1303)","DOI:10.3997/1873-0604.2009025"],"references":["327033850_Coastal_aquifer_management-monitoring_modeling_and_case_studies","277987906_Automated_monitoring_of_coastal_aquifers_with_electrical_resistivity_tomography","346694810_Geophysical_Data_Analysis_Understanding_Inverse_Problem_Theory_and_Practice","341016726_Borehole-to-Surface_ERT_Inversion","321610642_Applied_Hydrogeophysics","321609394_Seawater_Intrusion_in_Coastal_Aquifers_-_Concepts_Methods_and_Practices","265817776_Computational_Methods_in_Subsurface_Flow","260450698_Groundwater_Geophysics","260355917_Characterization_of_saltwater_intrusion_using_electrical_imaging_numerical_simulation_and_field_study","259307721_Hydrogeophysics"]}