{"id":"273758258_Decentralized_Charging_Control_of_Large_Populations_of_Plug-in_Electric_Vehicles","abstract":"This paper develops a strategy to coordinate the charging of autonomous plug-in electric vehicles (PEVs) using concepts from non-cooperative games. The foundation of the paper is a model that assumes PEVs are cost-minimizing and weakly coupled via a common electricity price. At a Nash equilibrium, each PEV reacts optimally with respect to a commonly observed charging trajectory that is the average of all PEV strategies. This average is given by the solution of a fixed point problem in the limit of infinite population size. The ideal solution minimizes electricity generation costs by scheduling PEV demand to fill the overnight non-PEV demand \"valley\". The paper's central theoretical result is a proof of the existence of a unique Nash equilibrium that almost satisfies that ideal. This result is accompanied by a decentralized computational algorithm and a proof that the algorithm converges to the Nash equilibrium in the infinite system limit. Several numerical examples are used to illustrate the performance of the solution strategy for finite populations. The examples demonstrate that convergence to the Nash equilibrium occurs very quickly over a broad range of parameters, and suggest this method could be useful in situations where frequent communication with PEVs is not possible. The method is useful in applications where fully centralized control is not possible, but where optimal or near-optimal charging patterns are essential to system operation.","authors":["Zhongjing Ma","Duncan S. Callaway","Ian Hiskens"],"meta":["January 2013Control Systems Technology, IEEE Transactions on 21(1):67-78","DOI:10.1109/TCST.2011.2174059"],"references":["239569071_Large-Population_Cost-Coupled_Stochastic_Control_Problems_with_Non-uniform_Agents_Individual-Mass_Behaviour_and_Decentralized_e","230663805_Potential_Games","269153069_Routing_without_regret","268013984_Fixed_Point_Theorems","255243501_Transportation_Energy_Data_Book_Edition_30","245534996_Some_Theoretical_Aspects_of_Road_Traffic_Research","245534689_Correspondence_Some_theoretical_aspects_of_road_traffic_research","243787853_Dynamic_Programming_and_Optimal_Control-III","241980287_Evaluation_of_Utility_System_Impacts_and_Benefits_of_Optimally_Dispatched_Plug-In_Hybrid_Electric_Vehicles_Revised","234554575_Transportation_Energy_Data_Book"]}