{"id":"273783034_Mapping_Bias_Overestimates_Reference_Allele_Frequencies_at_the_HLA_Genes_in_the_1000_Genomes_Project_Phase_I_Data","abstract":"Next Generation Sequencing (NGS) technologies have become the standard for data generation in studies of population genomics, as the 1000 Genomes Project (1000G). However, these techniques are known to be problematic when applied to highly polymorphic genomic regions, such as the Human Leukocyte Antigen (HLA) genes. Because accurate genotype calls and allele frequency estimations are crucial to population genomics analyses, it is important to assess the reliability of NGS data. Here, we evaluate the reliability of genotype calls and allele frequency estimates of the SNPs reported by 1000G (phase I) at five HLA genes (HLA-A, -B, -C, -DRB1, -DQB1). We take advantage of the availability of HLA Sanger sequencing of 930 of the 1,092 1000G samples, and use this as a gold standard to benchmark the 1000G data. We document that 18.6% of SNP genotype calls in HLA genes are incorrect, and that allele frequencies are estimated with an error higher than ±0.1 at approximately 25% of the SNPs in HLA genes. We found a bias towards overestimation of reference allele frequency for the 1000G data, indicating mapping bias is an important cause of error in frequency estimation in this dataset. We provide a list of sites that have poor allele frequency estimates, and discuss the outcomes of including those sites in different kinds of analyses. Since the HLA region is the most polymorphic in the human genome, our results provide insights into the challenges of using of NGS data at other genomic regions of high diversity.\nCopyright © 2015 Author et al.","authors":["Débora Y C Brandt","Vitor R C Aguiar","Bárbara D Bitarello","Kelly Nunes"],"meta":["March 2015G3-Genes Genomes Genetics 5(5)","DOI:10.1534/g3.114.015784","SourcePubMed"],"references":["287791295_The_variant_call_format_and_VCFtools","275525412_Improved_genome_inference_in_the_MHC_using_a_population_reference_graph","263710702_HLA_Diversity_in_the_1000_Genomes_Dataset","260019462_An_integrated_map_of_genetic_variation_from_1092_human_genomes_Consortium_GP_Nature_2012_491_56_65_101038nature11632","258504246_HLA_Typing_from_1000_Genomes_Whole_Genome_and_Whole_Exome_Illumina_Data","256611581_Transcriptome_and_genome_sequencing_uncovers_functional_variation_in_humans","309608433_The_IMGTHLA_database","284801616_An_integrated_map_of_genetic_variation_from_1","281765561_3-Dimensional_structure_of_the_human_class_II-histocompatinility_antigen_HLA-DR1","265600385_Molecular_Mechanisms_for_Contribution_of_MHC_Molecules_to_Autoimmune_Diseases"]}