{"id":"273772180_Computational_Thinking_in_K-9_Education","abstract":"In this report we consider the current status of the coverage of computer science in education at the lowest levels of education in multiple countries. Our focus is on computational thinking (CT), a term meant to encompass a set of concepts and thought processes that aid in formulating problems and their solutions in different fields in a way that could involve computers [130].\n\nThe main goal of this report is to help teachers, those involved in teacher education, and decision makers to make informed decisions about how and when CT can be included in their local institutions. We begin by defining CT and then discuss the current state of CT in K-9 education in multiple countries in Europe as well as the United States. Since many students are exposed to CT outside of school, we also discuss the current state of informal educational initiatives in the same set of countries.\n\nAn important contribution of the report is a survey distributed to K-9 teachers, aiming at revealing to what extent different aspects of CT are already part of teachers' classroom practice and how this is done. The survey data suggest that some teachers are already involved in activities that have strong potential for introducing some aspects of CT. In addition to the examples given by teachers participating in the survey, we present some additional sample activities and lesson plans for working with aspects of CT in different subjects. We also discuss ways in which teacher training can be coordinated as well as the issue of repositories. We conclude with future directions for research in CT at school.","authors":["Linda Mannila","Amber Settle","Valentina Dagiene","Barbara Demo"],"meta":["June 2014","DOI:10.1145/2713609.2713610","Conference: ITiCSE-WGR '14"],"references":["337291946_Philosophy_for_Children_Some_Assumptions_and_Implications","309916650_Computational_thinking_tools","285849724_Visual_Representations_of_Narratives_for_Poor_Comprehenders","318419122_In_and_out_of_the_School_Activities_Implementing_IBSE_and_Constructionist_Learning_Methodologies_by_Means_of_Robotics","298217000_Computational_thinking_in_Dutch_secondary_education","295134892_Understanding_Computer_Programming_as_a_Literacy","292757284_Critical_Enquiry_in_Computer_Science_Education","291411704_Unplugged_Computational_Thinking_for_Fun","288448082_Themes_or_motifs_Aiming_for_coherence_through_interdisciplinary_outlines","283553646_The_school_to_the_test_of_digital_literacy_of_students"]}