{"id":"273700070_Education_in_Disaster_Management_and_Emergencies_Defining_a_New_European_Course","abstract":"Unremitting natural disasters, deliberate threats, pandemics, and humanitarian suffering resulting from conflict situations necessitate swift and effective response paradigms. The European Union's (EU) increasing visibility as a disaster response enterprise suggests the need not only for financial contribution but also for instituting a coherent disaster response approach and management structure. The DITAC (Disaster Training Curriculum) project identified deficiencies in current responder training approaches and analyzed the characteristics and content required for a new, standardized European course in disaster management and emergencies.\nOver 35 experts from within and outside the EU representing various organizations and specialties involved in disaster management composed the DITAC Consortium. These experts were also organized into 5 specifically tasked working groups. Extensive literature reviews were conducted to identify requirements and deficiencies and to craft a new training concept based on research trends and lessons learned. A pilot course and program dissemination plan was also developed.\nThe lack of standardization was repeatedly highlighted as a serious deficiency in current disaster training methods, along with gaps in the command, control, and communication levels. A blended and competency-based teaching approach using exercises combined with lectures was recommended to improve intercultural and interdisciplinary integration.\nThe goal of a European disaster management course should be to standardize and enhance intercultural and inter-agency performance across the disaster management cycle. A set of minimal standards and evaluation metrics can be achieved through consensus, education, and training in different units. The core of the training initiative will be a unit that presents a realistic situation \"scenario-based training.\" (Disaster Med Public Health Preparedness. 2015;0:1-11).","authors":["Amir Khorram-Manesh","Michael Ashkenazi","Ahmadreza Djalali","Pier Luigi Ingrassia"],"meta":["March 2015Disaster Medicine and Public Health Preparedness 9(3):1-11","DOI:10.1017/dmp.2015.9","SourcePubMed","Project: Disaster Medicine"],"references":["277126262_The_EU_and_US_as_International_Actors_in_Disaster_Relief_Bruges_Political_Research_Paper_No_22_January_2012","263293405_Identifying_Deficiencies_in_National_and_Foreign_Medical_Team_Responses_Through_Expert_Opinion_Surveys_Implications_for_Education_and_Training-ERRATUM","261932700_Mission_Integrity_in_Disaster_Management","260914983_Education_and_Training_Initiatives_for_Crisis_Management_in_the_European_Union_A_Web-based_Analysis_of_Available_Programs-CORRIGENDUM","257139044_Hospital_Evacuation_Learning_from_the_Past_Flooding_of_Bangkok_2011","312891815_Techniques_for_Evaluating_Training_Programs_Reaction","288592630_Managing_mass_casualty_events_is_just_the_application_of_normal_activity_on_a_grander_scale_for_the_emergency_health_services_Or_is_it","285898663_Blended_learning_The_convergence_of_e-learning_and_meetings","277753519_Stories_Models_and_Examples_from_the_Upcoming_Handbook_of_Blended_Learning_Global_Perspectives_Local_Designs_Part_2","262894180_Enhancing_Plan_Quality_Evaluating_the_Role_of_State_Planning_Mandates_for_Natural_Hazard_Mitigation"]}