{"id":"273789179_Science_capital_A_conceptual_methodological_and_empirical_argument_for_extending_bourdieusian_notions_of_capital_beyond_the_arts_SCIENCE_CAPITAL","abstract":"This paper sets out an argument and approach for moving beyond a primarily arts-based conceptualization of cultural capital, as has been the tendency within Bourdieusian approaches to date. We advance the notion that, in contemporary society, scientific forms of cultural and social capital can command a high symbolic and exchange value. Our previous research [Archer et al. (2014) Journal of Research in Science Teaching 51, 1–30] proposed the concept of “science capital” (science-related forms of cultural and social capital) as a theoretical lens for explaining differential patterns of aspiration and educational participation among young people. Here, we attempt to theoretically, methodologically, and empirically advance a discussion of how we might conceptualize science capital and how this might be translated into a survey tool for use with students. We report on findings from a survey conducted with 3658 secondary school students, aged 11–15 years, in England. Analysis found that science capital was unevenly spread across the student population, with 5% being classified as having “high” science capital and 27% “low” science capital. Analysis shows that levels of science capital (high, medium, or low) are clearly patterned by cultural capital, gender, ethnicity, and set (track) in science. Students with high, medium, or low levels of science capital also seem to have very different post-16 plans (regarding studying or working in science) and different levels of self-efficacy in science. They also vary dramatically in terms of whether they feel others see them as a “science person.” The paper concludes with a discussion of conceptual and methodological issues and implications for practice.","authors":["Louise Archer","Emily Dawson","Jennifer DeWitt","Amy Seakins"],"meta":["March 2015Journal of Research in Science Teaching 52(7)","DOI:10.1002/tea.21227"],"references":["294730043_Disorientating_fun_or_meaningful_Disadvantaged_families'_experiences_of_a_science_museum_visit","344552487_Class_Strategies_and_the_Education_Market_The_Middle_Classes_and_Social_Advantage","344486690_Outline_of_a_Theory_of_Practice","329987757_Whose_Science_Whose_Knowledge_Thinking_from_Women's_Lives","324299825_Distinction_A_Social_Critique_of_the_Judgement_of_Taste","324292382_Human_Capital_A_Theoretical_and_Empirical_Analysis_with_Special_Reference_to_Education","321605255_Democratic_Science_Teaching_Building_the_Expertise_to_Empower_Low-Income_Minority_Youth_in_Science","317128320_An_Invitation_of_Reflexive_Sociology","299849017_The_labour_market_value_of_STEM_qualifications_and_occupations","289681902_Childcare_Choice_and_Class_Practices_Middle_Class_Parents_and_their_Children"]}