{"id":"273788062_Cost-Effective_Conceptual_Design_Using_Taxonomies","abstract":"It is known that annotating named entities in unstructured and\nsemi-structured data sets by their concepts improves the effectiveness of\nanswering queries over these data sets. As every enterprise has a limited\nbudget of time or computational resources, it has to annotate a subset of\nconcepts in a given domain whose costs of annotation do not exceed the budget.\nWe call such a subset of concepts a {\\it conceptual design} for the annotated\ndata set. We focus on finding a conceptual design that provides the most\neffective answers to queries over the annotated data set, i.e., a {\\it\ncost-effective conceptual design}. Since, it is often less time-consuming and\ncostly to annotate general concepts than specific concepts, we use information\non superclass/subclass relationships between concepts in taxonomies to find a\ncost-effective conceptual design. We quantify the amount by which a conceptual\ndesign with concepts from a taxonomy improves the effectiveness of answering\nqueries over an annotated data set. If the taxonomy is a tree, we prove that\nthe problem is NP-hard and propose an efficient approximation and\npseudo-polynomial time algorithms for the problem. We further prove that if the\ntaxonomy is a directed acyclic graph, given some generally accepted hypothesis,\nit is not possible to find any approximation algorithm with reasonably small\napproximation ratio for the problem. Our empirical study using real-world data\nsets, taxonomies, and query workloads shows that our framework effectively\nquantifies the amount by which a conceptual design improves the effectiveness\nof answering queries. It also indicates that our algorithms are efficient for a\ndesign-time task with pseudo-polynomial algorithm being generally more\neffective than the approximation algorithm.","authors":["Ali Vakilian","Yodsawalai Chodpathumwan","Arash Termehchy","Amir Nayyeri"],"meta":["June 2018The VLDB Journal 27(13)","DOI:10.1007/s00778-018-0501-1","SourcearXiv"],"references":["287456998_Rule-based_information_extraction_is_dead_Long_live_rule-based_information_extraction_systems","278331931_MeSHLabeler_improving_the_accuracy_of_large-scale_MeSH_indexing_by_integrating_diverse_evidence","317639575_Almost-polynomial_ratio_ETH-hardness_of_approximating_densest_k-subgraph","316346367_Cost-Effective_Conceptual_Design_Over_Taxonomies","308161218_Introduction_to_information_retrieval_chapt","299905712_Robust_and_Noise_Resistant_Wrapper_Induction","290833650_Improved_Pattern_Learning_for_Bootstrapped_Entity_Extraction","283609507_Learning_adaptive_value_of_information_for_structured_prediction","282744876_Short_text_understanding_through_lexical-semantic_analysis","279257884_Web_Data_Management","268060606_Brainwash_A_Data_System_for_Feature_Engineering","276465072_An_integrated_development_environment_for_faster_feature_engineering","273001794_Approximation_Algorithms","269087907_Legal_docket-entry_classification","266657759_Database_principles_in_Information_Extraction"]}