{"id":"273855384_The_impact_of_carbon_policies_on_supply_chain_design_and_logistics_of_a_major_retailer","abstract":"The energy used to move freight comprised about 17% of all the energy consumed in the United States in 2010. This percentage was an increase from 8.7% in 1970 even though fuel efficiency gradually improved over the period. One major reason of this phenomenon is that the longer supply chains of many industries caused by globalization increase freight movement. Various carbon policies have been discussed and even implemented for some industry sectors in the European Union to reduce carbon emissions. However, the emissions of surface transportation have not been well studied. This paper investigates three of the most common carbon policies: carbon emission tax, inflexible cap, and cap-and-trade. The impact on a company may include the redesign of its supply chains and different choices of transportation modes (truck, rail, or waterway). This paper proposes optimization models for major retailers, who make a huge contribution to freight movement, to design their supply chains under various carbon policies. The results from the models can help policy makers to predict the impact of policies on overall emissions in the freight transportation sector. The model may also be incorporated into the integrated assessment models for climate change analyses. Furthermore, a sensitivity analysis is conducted to study the impact of the policy parameters on carbon emissions and logistics cost. This research uses the supply chain of a major U.S. retailer (i.e., Wal-Mart) to demonstrate how to use the models and conduct the sensitivity analysis. In order to realize significant emission reduction, a redesign of supply chains of major retailers is necessary and will be triggered only by a high carbon tax rate, a high carbon price, or a very strict carbon cap, which all may involve high social and/or economic complexity. Numerical experiments show that different policies have different impacts on the costs and the effectiveness of emission reduction. How to choose policy parameters is critical to the effectiveness of a carbon policy. The different sensitivity also implies different challenges during the implementation of the policies, such as the high cost preventing retailers from accepting any carbon taxes and the difficulty of reaching an agreement on the carbon caps between retailers and policy makers.","authors":["Mingzhou Jin","Nelson A. Granda-Marulanda","Ian Down"],"meta":["December 2014Journal of Cleaner Production 85:453-461","DOI:10.1016/j.jclepro.2013.08.042"],"references":["228905906_Carbon_Footprint_and_the_Management_of_Supply_Chains_Insights_From_Simple_Models","224096929_A_Carbon-Capped_Supply_Chain_Network_Problem","296960027_Policy_analysis_in_the_presence_of_distorting_taxes","261302000_A_review_of_carbon_emission_management_from_the_perspective_of_logistics_industry","251623652_Integrating_carbon_footprint_into_supply_chain_management_The_case_of_Hyundai_Motor_Company_HMC_in_the_automobile_industry","249569185_The_European_Carbon_Market_in_Action_Lessons_from_the_First_Trading_Period","229886178_The_control_of_goods_transportation_growth_by_modal_share_re-planning_The_role_of_a_carbon_tax","227668930_Green_Supply_Chain_Management_A_State-of-The-Art_Literature_Review","227647818_Policy_analysis_in_the_presence_of_distorting_taxes","227420682_Modeling_carbon_footprints_across_the_supply_chain","227415609_Evaluating_renewable_portfolio_standards_and_carbon_cap_scenarios_in_the_US_electric_sector","224229362_System_Dynamics_Modeling_and_Simulation_of_China's_SO2_Emission_Trading_Policy","223688187_A_system_dynamics_model_of_CO2_mitigation_in_China's_inter-city_passenger_transport","223394893_Environmental_conscious_long-range_planning_and_design_of_supply_chain_networks","223248997_Carbon_price_volatility_Evidence_from_EU_ETS","222088286_Interactions_between_Operational_Research_and_Environmental_Management_European_Journal_of_Operational_Research_85_229-243","221951786_Climate_policy_impacts_on_the_competitiveness_of_energy-intensive_manufacturing_sectors","7460775_Application_of_a_system_dynamics_approach_for_assessment_and_mitigation_of_CO2_emissions_from_the_cement_industry"]}