{"id":"273896784_Grounded_fixpoints_and_their_applications_in_knowledge_representation","abstract":"(to appear in Artificial Intelligence) \nIn various domains of logic, researchers have made use of a similar intuition: that facts (or models) can be derived from the ground up. They typically phrase this intuition by saying, e.g., that the facts should be grounded, or that they should not be unfounded, or that they should be supported by cycle-free arguments, et cetera. In this paper, we formalise this intuition in the context of algebraical fixpoint theory. We define when a lattice element x ∈ L is grounded for lattice operator O : L → L. On the algebraical level, we investigate the relationship between grounded fixpoints and the various classes of fixpoints of approximation fixpoint theory, including supported, minimal, Kripke-Kleene, stable and well-founded fixpoints. On the logical level, we investigate groundedness in the context of logic programming, autoepistemic logic, default logic and argumentation frameworks. We explain what grounded points and fixpoints mean in these logics and show that this concept indeed formalises intuitions that existed in these fields. We investigate which existing semantics are grounded. We study the novel semantics for these logics that is induced by grounded fixpoints, which has some very appealing properties, not in the least its mathematical simplicity and generality. Our results unveil a remarkable uniformity in intuitions and mathematics in these fields.","authors":["Bart Bogaerts","Joost Vennekens","Marc Denecker"],"meta":["July 2015Artificial Intelligence 224:51-71","DOI:10.1016/j.artint.2015.03.006"],"references":["268211096_Grounded_Fixpoints","262381317_Vicious_Circle_Principle_and_Logic_Programs_with_Aggregates","262225045_FOC_A_Knowledge_Representation_Language_of_Causality","312630792_The_well-founded_semantics_is_the_principle_of_inductive_definition_revisited","300028768_A_Generalization_of_Approximation_Fixpoint_Theory_and_Application","268978899_Nonmonotonic_Logic_I","263965183_HEX_Semantics_via_Approximation_Fixpoint_Theory","261597653_Analyzing_the_Computational_Complexity_of_Abstract_Dialectical_Frameworks_via_Approximation_Fixpoint_Theory","259279658_Abstract_Dialectical_Frameworks_Revisited","259084964_Approximating_operators_and_semantics_for_abstract_dialectical_frameworks"]}