{"id":"273828466_Measuring_university_faculty_attitudes_toward_disability_Willingness_to_accommodate_and_adopt_Universal_Design_principles","abstract":"Today, more students with disabilities attend four year institutions, but may struggle to succeed within these settings. University faculty attitudes and practices contribute to the success or failure of students in these postsecondary settings. In this study, we developed, administered, and evaluated a measure of faculty attitudes and perceptions toward students with disabilities. Results from 289 faculty members indicated that responses loaded on eight reliable factors pertaining to (a) Fairness in Providing Accommodations, (b) Knowledge of Disability Law, (c) Adjustment of Course Assignments and Requirements, (d) Minimizing Barriers, (e) Campus Resources, (f) Willingness to Invest Time, (g) Accessibility of Course Materials, and (h) Performance Expectations. Group comparisons by faculty gender, rank, college/school, and prior disability-focused training indicated more positive attitudes toward providing accommodations and adopting Universal Design principles among faculty who are female, nontenured, housed within the College of Education, or had prior disability-focused training experiences. These findings suggest that faculty attitudes and perceptions toward disability and their willingness to accommodate and adopt Universal Design principles can be reliably assessed. The potential usefulness of such assessments for practices within postsecondary environments are discussed.","authors":["Allison Lombardi","christopher murray"],"meta":["January 2011Journal of Vocational Rehabilitation 34(1):43-56","DOI:10.3233/JVR-2010-0533"],"references":["258166548_College_Students'_Willingness_to_Seek_Help_for_Their_Learning_Disabilities","291771140_Attitudes_of_selected_university_faculty_members_toward_disabled_students","290029848_Faculty_willingness_to_provide_accommodations_and_course_alternatives_to_postsecondary_students_with_learning_disabilities","258166749_University_Faculty_Perceptions_of_Students_with_Learning_Disabilities_Correlates_and_Group_Differences","258166645_Associations_between_Prior_Disability-Focused_Training_and_Disability-Related_Attitudes_and_Perceptions_among_University_Faculty","257946502_Universal_design_for_learning_in_postsecondary_education_Reflections_on_principles_and_their_application","254685088_Faculty_Development_and_Universal_Instructional_Design","250181150_Psychometric_Theory-_25_Years_Ago_and_Now1","249832856_Section_504Differences_in_the_Regulations_for_Secondary_and_Postsecondary_Education","247641902_Students_With_Learning_Disabilities_in_Higher_Education_Faculty_Attitude_and_Practices"]}