{"id":"273955106_An_automatic_tool_to_analyze_and_cluster_macromolecular_conformations_based_on_Self-Organizing_Maps","abstract":"Sampling the conformational space of biological macromolecules generates large sets of data with considerable complexity. Data-mining techniques, such as clustering, can extract meaningful information. Among them, the Self-Organizing Maps (SOMs) algorithm has shown great promise, in particular since its computation time rises only linearly with the size of the data set. Whereas SOMs are generally used with few neurons, we investigate here their behavior with large numbers of neurons.\nWe present here a python library implementing the full SOM analysis workflow. Large SOMs can readily be applied on heavy data sets. Coupled with visualization tools they have very interesting properties. Descriptors for each conformation of a trajectory are calculated and mapped onto a 3D landscape, the U-matrix, reporting the distance between neighboring neurons. To delineate clusters, we developed the flooding algorithm, which hierarchically identifies local basins of the U-matrix from the global minimum to the maximum. Availability: The python implementation of the SOM library is freely available on github: https://github.com/bougui505/SOM.\nmichael.nilges@pasteur.fr, guillaume.bouvier@pasteur.fr.\n© The Author (2014). Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.","authors":["Guillaume Bouvier","Nathan Desdouits","Mathias Ferber","Arnaud Blondel"],"meta":["December 2014Bioinformatics 31(9)","DOI:10.1093/bioinformatics/btu849","SourcePubMed"],"references":["238808165_Morphological_segmentation","24022369_Distance_Matrix-Based_Approach_to_Protein_Structure_Prediction","261255056_Distinct_Docking_and_Stabilization_Steps_of_the_Pseudopilus_Conformational_Transition_Path_Suggest_Rotational_Assembly_of_Type_IV_Pilus-like_Fibers","259626114_Functional_Motions_Modulating_VanA_Ligand_Binding_Unraveled_by_Self-Organizing_Maps","256612598_Stabilization_of_the_integrase-DNA_complex_by_Mg_2_ions_and_prediction_of_key_residues_for_binding_HIV-1_integrase_inhibitors","230825944_Erratum_A_convective_replica-exchange_method_for_sampling_new_energy_basins","26809702_How_Does_a_Simplified-Sequence_Protein_Fold"]}