{"id":"273955275_Memory_and_Energy_Optimization_Strategies_for_Multithreaded_Operating_System_on_the_Resource-Constrained_Wireless_Sensor_Node","abstract":"Memory and energy optimization strategies are essential for the resource-constrained wireless sensor network (WSN) nodes. In this article, a new memory-optimized and energy-optimized multithreaded WSN operating system (OS) LiveOS is designed and implemented. Memory cost of LiveOS is optimized by using the stack-shifting hybrid scheduling approach. Different from the traditional multithreaded OS in which thread stacks are allocated statically by the pre-reservation, thread stacks in LiveOS are allocated dynamically by using the stack-shifting technique. As a result, memory waste problems caused by the static pre-reservation can be avoided. In addition to the stack-shifting dynamic allocation approach, the hybrid scheduling mechanism which can decrease both the thread scheduling overhead and the thread stack number is also implemented in LiveOS. With these mechanisms, the stack memory cost of LiveOS can be reduced more than 50% if compared to that of a traditional multithreaded OS. Not is memory cost optimized, but also the energy cost is optimized in LiveOS, and this is achieved by using the multi-core \"context aware\" and multi-core \"power-off/wakeup\" energy conservation approaches. By using these approaches, energy cost of LiveOS can be reduced more than 30% when compared to the single-core WSN system. Memory and energy optimization strategies in LiveOS not only prolong the lifetime of WSN nodes, but also make the multithreaded OS feasible to run on the memory-constrained WSN nodes.","authors":["Xing Liu","Kun-Mean Hou","Christophe De Vaulx","Jun Xu"],"meta":["December 2014Sensors 15(1):22-48","DOI:10.3390/s150100022","SourcePubMed"],"references":["261958666_Fundamentals_of_Wireless_Sensor_Networks_Theory_and_Practice","242422183_Low_Power_Operating_System_for_Heterogeneous_Wireless_Communication_System","286896209_Wireless_Sensor_Networks_Technology_Protocols_and_Applications","271325478_OpenWSN_A_Standards-Based_Low-Power_Wireless_Development_Environment","266863948_Challenges_and_Solutions_in_the_Design_of_a_Java_Virtual_Machine_for_Resource_Constrained_Microcontrollers","243581817_The_mote_revolution_Low_power_wireless_sensor_network_devices","242608945_Why_threads_are_a_bad_idea_for_most_purposes","239950058_TinyOs_Programming","236623980_System_Architecture_Directions_for_Network_Sensors","228726095_Automatic_thread_stack_management_for_resource-constrained_sensor_operating_systems"]}