{"id":"274012408_On_the_Categorization_of_Scientific_Citation_Profiles_in_Computer_Science","abstract":"A common consensus in the literature is that the citation profile of\npublished articles in general follows a universal pattern - an initial growth\nin the number of citations within the first two to three years after\npublication followed by a steady peak of one to two years and then a final\ndecline over the rest of the lifetime of the article. This observation has long\nbeen the underlying heuristic in determining major bibliometric factors such as\nthe quality of a publication, the growth of scientific communities, impact\nfactor of publication venues etc. In this paper, we gather and analyze a\nmassive dataset of scientific papers from the computer science domain and\nnotice that the citation count of the articles over the years follows a\nremarkably diverse set of patterns - a profile with an initial peak (PeakInit),\nwith distinct multiple peaks (PeakMul), with a peak late in time (PeakLate),\nthat is monotonically decreasing (MonDec), that is monotonically increasing\n(MonIncr) and that can not be categorized into any of the above (Oth). We\nconduct a thorough experiment to investigate several important characteristics\nof these categories such as how individual categories attract citations, how\nthe categorization is influenced by the year and the venue of publication of\npapers, how each category is affected by self-citations, the stability of the\ncategories over time, and how much each of these categories contribute to the\ncore of the network. Further, we show that the traditional preferential\nattachment models fail to explain these citation profiles. Therefore, we\npropose a novel dynamic growth model that takes both the preferential\nattachment and the aging factor into account in order to replicate the\nreal-world behavior of various citation profiles. We believe that this paper\nopens the scope for a serious re-investigation of the existing bibliometric\nindices for scientific research.","authors":["Tanmoy Chakraborty","Suhansanu Kumar","Pawan Goyal","Niloy Ganguly"],"meta":["March 2015Communications of the ACM 58(9)","DOI:10.1145/2701412","SourcearXiv"],"references":["259368438_Bibliometrics_Global_Gender_Disparities_in_Science","257718405_The_Development_of_Standards_Factors_and_Indicators_for_Evaluating_the_Quality_of_Classroom_Action_Research","235251464_What_do_citation_counts_measure_A_review_of_studies_on_citing_behavior_J_Doc_64145-80_DOI_10110800220410810844150","231537502_Stochastic_Dynamical_Model_of_a_Growing_Citation_Network_Based_on_a_Self-Exciting_Point_Process","294281587_Predicting_High_Impact_Academic_Papers_Using_Citation_Network_Features","283617653_Emergence_of_Scaling_in_Random_Networks","278902213_The_Impact_Factor_and_using_it_correctly","269200173_Computer_science_fields_as_ground-truth_communities","254006037_To_better_stand_on_the_shoulder_of_giants","231130919_Self-citation_corrections_for_the_Hirsch_index"]}