{"id":"274068831_Network-Conscious_p-calculus_-A_Model_of_Pastry","abstract":"A peer-to-peer (p2p) system provides the networking substrate for the execution of distributed applications. It is made of peers that interact over an overlay network. Overlay networks are highly dynamic, as peers can join and leave at any time. Traditional process calculi, such as π-calculus, CCS and others, seem inadequate to capture these kinds of networks, their routing mechanisms, and to verify their properties. In order to model network architecture in a more explicit way, in [14,18,15] we have introduced the Network Conscious π-calculus (NCPi), an extension of the π-calculus with names representing network nodes and links. In [15] (a simpler version of) NCPi has been equipped with a coalgebraic operational models, along the lines of Fiore-Turi presheaf-based approach [6], and with an equivalent History Dependent Automaton [13], i.e., an (often) finite-state automaton suitable for verification. In this paper we first give a brief account of these results. Then, our contribution is the sketch of a NCPi representation of the p2p architecture Pastry. In particular, we give models of its overlay network and of a Distributed Hash Table built on top of it, and we give evidence of their correctness by proving convergence of routing mechanisms.","authors":["Ugo Montanari","Matteo Sammartino"],"meta":["September 2014Electronic Notes in Theoretical Computer Science 312","DOI:10.1016/j.entcs.2015.04.002","Conference: LSFA 2014","Project: ASCENS"],"references":["262601177_Reasoning_about_Explicit_Resource_Management","257643493_Network_Conscious_p-calculus_A_Concurrent_Semantics","222835045_Families_of_Symmetries_as_Efficient_Models_of_Resource_Binding","277296934_Universal_Coalgebra_a_Theory_of_Systems","262206069_Semantics_of_Name_and_Value_Passing","260608343_A_network-conscious_p-calculus_and_its_coalgebraic_semantics","222840479_Universal_coalgebra_A_theory_of_systems","222824330_Structured_coalgebras_and_minimal_HD-automata_for_the_-calculus","222676155_Basic_Observables_for_a_Calculus_for_Global_Computing","222659550_Resource_Access_Control_in_Systems_of_Mobile_Agents"]}