{"id":"274095027_Events_Determine_Spreading_Patterns_Information_Transmission_via_Internal_and_External_Influences_on_Social_Networks","abstract":"Recently, information transmission models motivated by the classical epidemic\npropagation, have been applied to a wide-range of social systems, generally\nassume that information mainly transmits among individuals via peer-to-peer\ninteractions on social networks. In this paper, we consider one more approach\nfor users to get information: the out-of-social-network influence. Empirical\nanalyses of eight typical events' diffusion on a very large micro-blogging\nsystem, \\emph{Sina Weibo}, show that the external influence has significant\nimpact on information spreading along with social activities. In addition, we\npropose a theoretical model to interpret the spreading process via both\ninternal and external channels, considering three essential properties: (i)\nmemory effect; (ii) role of spreaders; and (iii) non-redundancy of contacts.\nExperimental and mathematical results indicate that the information indeed\nspreads much quicker and broader with mutual effects of the internal and\nexternal influences. More importantly, the present model reveals that the event\ncharacteristic would highly determine the essential spreading patterns once the\nnetwork structure is established. The results may shed some light on the\nin-depth understanding of the underlying dynamics of information transmission\non real social networks.","authors":["Chuang Liu","Xiu-Xiu Zhan","Zi-Ke Zhang","Gui-Quan Sun"],"meta":["March 2015New Journal of Physics 17(11)","DOI:10.1088/1367-2630/17/11/113045","SourcearXiv"],"references":["284752173_Novelty_and_Collective_Attention","265394968_Optimal_Network_Modularity_for_Information_Diffusion","263862822_Reconstructing_propagation_networks_with_natural_diversity_and_identifying_hidden_sources","261882168_Emergence_of_Blind_Areas_in_Information_Spreading","258567214_Temporal_scaling_in_information_propagation","323142837_Rumor_evolution_in_social_networks","311899572_Epidemic_processes_in_complex_networks","264708826_Epidemic_processes_in_complex_networks","260520766_The_impact_of_network_characteristics_on_the_diffusion_of_innovations","260009389_Epidemic_spreading_on_weighted_adaptive_networks"]}