{"id":"274175108_Skyline_Sets_Queries_for_Incomplete_Data","abstract":"With the increase of data volume, advanced query operators, such as skyline queries, are necessary inorder to help users to handle the huge amount of available data by identifying a set of interesting dataobjects. Skyline queries help us to filter unnecessary information efficiently and provide us clues forvarious decision making tasks.Most of the existing skyline algorithms cannot preserve individual’s privacy and are not well suited fordata with outliers and frequently updated data. Considering these issues, earlier we have proposed skylinesets queries from databases where all dimensions are available for all data items and considered anefficient algorithm for computing convex skyline sets. In this paper, we use that idea for skyline sets queriesfor incomplete data and propose a method, namely, RBSSQ. RBSSQ method uses a replacement-basedapproach and is applicable to the databases having any number of missing dimensions in the databaseobjects. We have conducted several experiments in terms of computational cost and found that ourproposed method can efficiently compute skyline sets from data items with missing values.","authors":["Mohammad Shamsul Arefin"],"meta":["October 2012International Journal of Computer Science and Information Technology 4(5):67-80","DOI:10.5121/ijcsit.2012.4506"],"references":["221310231_Maximal_Vector_Computation_in_Large_Data_Sets","220964972_Parallel_Skyline_Computation_on_Multicore_Architectures","314819465_An_optimal_and_progressive_algorithm_for_skyline_queries","262398185_Agent-based_anonymous_skyline_set_computation_in_cloud_databases","221607375_Skyline_Sets_Query_and_Its_Extension_to_Spatio-temporal_Databases","221464386_Parallelizing_Progressive_Computation_for_Skyline_Queries_in_Multi-disk_Environment","221367069_Privacy_Aware_Parallel_Computation_of_Skyline_Sets_Queries_from_Distributed_Databases","221310438_Shooting_Stars_in_the_Sky_An_Online_Algorithm_for_Skyline_Queries","221310241_Efficient_Progressive_Skyline_Computation","221103331_Parallelizing_Skyline_Queries_for_Scalable_Distribution"]}