{"id":"274251748_Statistical_Bayesian_Learning_for_Automatic_Arabic_Text_Categorization","abstract":"Approach: Problem statement: The rapid increasing of online Arabic documents necessitated applying Text Categorization techniques which are commonly used for English language to categorize them automatically. The complex morphology of Arabic language and its large vocabulary size make using these techniques difficult and costly in time and effort. Approach: We have investigated Bayesian learning models in order to enhance Arabic ATC. Three classifiers based on Bayesian theorem had been implemented which are Simple Naïve Bayes (NB), Multi-variant Bernoulli Naïve Bayes (MBNB) and Multinomial Naïve Bayes (MNB) models. TREC-2002 Light Stemmer was applied for Arabic stemming. For text representation, BOW and character-level 3, 4 and 5 g had been used. In order to reduce the dimensionality of feature space, we have used several feature selection methods; Mutual Information (MI), CHI-Square statistic (CHI), Odds Ratio (OR) and GSS-coefficient (GSS). Conclusion: MBNB classifier outperforms both of NB and MNB classifiers. BOW representation type leads to the best classification performance, nevertheless using character level n-gram leads to satisfied results by Bayesian learning for Arabic ATC.","authors":["Bassam Al-Salemi","Mohd Juzaiddin Ab Aziz"],"meta":["January 2010Journal of Computer Science 7(1):39-45","DOI:10.3844/jcssp.2011.39.45"],"references":["266071235_Translation_Based_Arabic_Text_Categorization","248591742_An_extensive_empirical_study_of_feature_selection_metrics_for_text_classification_J","242517154_Automatic_Arabic_Text_Classification","237293959_Automatic_Arabic_Document_Categorization_Based_on_the_Naive_Bayes_Algorithm","226582414_Support_Vector_Machines_Based_Arabic_Language_Text_Classification_System_Feature_Selection_Comparative_Study","224952248_Machine_Learning_in_Automated_Text_Categorization","224597175_Improving_arabic_text_categorization_using_decision_trees","265544297_Supervised_Machine_Learning_A_Review_of_Classification_Techniques","226570674_Light_Stemming_for_Arabic_Information_Retrieval","222772881_Feature_selection_for_text_classification_with_Nave_Bayes"]}