{"id":"274271844_Interpretation_of_Well-Block_Pressures_in_Numerical_Reservoir_Simulation_With_Nonsquare_Grid_Blocks_and_Anisotropic_Permeability","abstract":"Previous work on the interpretation of well-block Previous work on the interpretation of well-block pressure (WBP) for a single isolated well is extended to pressure (WBP) for a single isolated well is extended to the case of nonsquare grid blocks (delta x does not equal delta y). Numerical solutions for the single-phase five-spot problem, involving various grid sizes, show that the effective well-block radius (where the actual flowing pressure equals the numerically calculated WBP) is given by\nThis relationship is verified by a mathematical derivation for a single well in an infinite grid. The exact value of the constant is shown to be c -gamma/4, where gamma is Euler's constant. Finally, the analysis is extended to include anisotropic permeability, and an expression for the effective permeability, and an expression for the effective well-block radius in terms of delta x, delta y, kx, and ky is derived.\nIntroduction\nIn the modeling of a reservoir by numerical methods, it is necessary to use grid blocks whose horizontal dimensions are much larger than the diameter of a well. As a result, the pressure calculated for a block containing a well, po, is greatly different from the flowing bottomhole pressure (BHP) of the well, pwf. In a previous paper, the equivalent radius of a well block, ro, was paper, the equivalent radius of a well block, ro, was defined as that radius at which the steady-state flowing pressure for the actual well is equal to the numerically pressure for the actual well is equal to the numerically calculated pressure for the well block. This definition for ro gives\n(1)\nFor a square grid (delta x = delta y), careful numerical experiments on a five-spot pattern showed that the ratio of ro to delta x ranges from 0.1936 (for a 3 x 3 grid to a limit\n(2)\nIt was also shown that the pressures in the blocks adjacent to a well block approximately satisfy the steady-state radial flow equation\n(3)\nBy assuming that Eq. 3 is satisfied exactly, one can derive the relation\n(4)\nSPEJ\nP. 531","authors":["D.W. Peaceman"],"meta":["April 2013Society of Petroleum Engineers Journal 23(03):531-543","DOI:10.2118/10528-PA"],"references":[]}