{"id":"274376870_Knowledge_formalization_for_vector_data_matching_using_Belief_Theory","abstract":"Nowadays geographic vector data is produced both by public and private institutions using well defined specifications or crowdsourcing via Web 2.0 mapping portals. As a result, multiple representations of the same real world objects exist, without any links between these different representations. This becomes an issue when integration, updates, or multi-level analysis needs to be performed, as well as for data quality assessment. In this paper a multi-criteria data matching approach allowing the automatic definition of links between identical features is proposed. The originality of the approach is that the process is guided by an explicit representation and fusion of knowledge from various sources. Moreover the imperfection (imprecision, uncertainty, and incompleteness) is explicitly modeled in the process. Belief theory is used to represent and fuse knowledge from different sources, to model imperfection, and make a decision. Experiments are reported on real data coming from different producers, having different scales and either representing relief (isolated points) or road networks (linear data).","authors":["Ana-Maria Olteanu Raimond","Sebastien Mustiere","Anne Ruas"],"meta":["June 2015Journal of Spatial Information Science in press(10)","DOI:10.5311/JOSIS.2015.10.194"],"references":["259695103_The_semantic_similarity_ensemble","234822602_Fusion_of_Local_Statistical_Parameters_for_Buried_Underwater_Mine_Detection_in_Sonar_Imaging","320934627_Maintenance_of_Multiple_Representation_Databases_for_Topographic_Data","290165116_Imperfect_information_Imprecision_and_uncertainty_in_A_Motro_and_P_Smets_Eds_Uncertainty_Management_in_Information_Systems_From_Needs_to_Solutions","286686463_Models_of_uncertainty_in_spatial_data","279249150_Thematic_Map_Comparison_Evaluating_the_Statistical_Significance_of_Differences_in_Classification_Accuracy","262895664_Assessing_Data_Completeness_of_VGI_through_an_Automated_Matching_Procedure_for_Linear_Data","254093953_GIS_Conflation_using_Open_Source_Tools","233654626_Maintenance_of_Multiple_Representation_Databases_for_Topographic_Data","232876918_An_optimisation_model_for_linear_feature_matching_in_geographical_data_conflation"]}