{"id":"274378317_A_Serious_Game_for_Developing_Computational_Thinking_and_Learning_Introductory_Computer_Programming","abstract":"Owing to their ease of engagement and motivational nature, especially for younger age groups, games have been omnipresent in education since earliest times. More recently, computer video games have become widely used, particularly in secondary and tertiary education, to impart core knowledge in some subject areas and as an aid to attracting and retaining students. Academics have proposed a number of approaches, using games-based learning (GBL), to impart theoretical and applied knowledge, especially in the computer science discipline. Our research is concerned with the design of an innovative educational game framework focused on the development of Computational Thinking (CT) skills, and herein we introduce a serious game, based on our framework, which encourages the development of CT skills to facilitate learning introductory computer programming. We describe how a limited number of key introductory computer programming concepts have been mapped onto the game-play, and how an equivalent set of skills characterising CT can be acquired through playing the game. A survey response group of 25 students, following computer science and related degree programmes but with very diverse backgrounds and experience, provided initial usability feedback on the game. Their feedback confirmed that they found the game enjoyable, and also universally believed that this approach would be beneficial in helping students learn problem-solving skills for introductory computer programming. Feedback from this group will be incorporated in a revised version of the game, which will now be subject to rigorous experimental evaluation and analysis, to provide structured empirical evidence in support of our approach. (C) 2012 Published by Elsevier Ltd.","authors":["Cagin Kazimoglu","Mary Kiernan","Liz Bacon","Lachlan Mackinnon"],"meta":["December 2012Procedia - Social and Behavioral Sciences 47:1991-1999","DOI:10.1016/j.sbspro.2012.06.938"],"references":["290161258_Efforts_to_Reverse_the_Trend_of_Enrollment_Decline_in_Computer_Science_Programs","274377900_Computational_Thinking","274309848_Computational_Thinking","234812396_Education_Paving_the_way_for_computational_thinking","234806065_Why_computational_thinking_should_be_integrated_into_the_curriculum","228659969_Experimental_evaluation_of_teaching_recursion_in_a_video_game","226813317_Exposing_the_Programming_Process","280321247_Understanding_Computational_Thinking_before_Programming","277773347_Using_Scratch_as_game-based_learning_tool_to_reduce_learning_anxiety_in_programming_course","277755904_Developing_a_game_model_for_computational_thinking_and_learning_traditional_programming_through_game-play"]}