{"id":"274379817_Rankings_and_the_Reshaping_of_Higher_Education_The_Battle_for_World-Class_Excellence","abstract":"University rankings have gained popularity worldwide because they appear to fulfil demands by students, parents, policymakers, employers, and other stakeholders for information and transparency. They are often equated with quality, and are now a significant factor shaping institutional reputation. Today, there are eleven global rankings, experiencing varying degrees of popularity, reliability and trustworthiness, and national rankings in over 40 countries. Despite their popularity, how much do we really know and understand about the influence and impact of rankings? This book is the first comprehensive study of rankings from a global perspective. Based on original international surveys and interviews with universities and stakeholders, Ellen Hazelkorn draws together a wealth of international experience to chronicle how rankings are helping reshape higher education in the age of globalization. Written in an easy but authoritative style, the book makes an important contribution to our understanding of the rankings phenomenon. It is essential reading for policy makers, institutional leaders, managers, advisors, and scholars.","authors":["Ellen Hazelkorn"],"meta":["March 2015","DOI:10.1057/9780230306394","Edition: 2nd EditionPublisher: Palgrave MacMillan"],"references":["292615170_Building_World-Class_Universities_in_China","238449095_Creating_World-Class_Universities_in_Japan_Policy_and_Initiatives","233224009_The_Globalization_of_College_and_University_Rankings","289880845_World-Class_University_in_Korea_Proactive_Government_Responsive_University_and_Procrastinating_Academics","288273338_Public_Opinion_and_Public_Opinion_Polling","288257732_The_story_of_academic_rankings","278720462_To_Be_or_Not_to_Be_The_Impacts_of_the_Excellence_Initiative_on_the_German_System_of_Higher_Education","265121795_Funding_Selectivity_Concentration_and_Excellence_-_How_Good_is_the_UK's_Research","258339559_Reconciling_Republican_'Egalite'_and_Global_Excellence_Values_in_French_Higher_Education","233582771_Setting_Tuition_Fees_in_Institutions_of_Higher_Education_Supporting_a_public_service_or_charging_what_the_market_will_pay"]}