{"id":"274309937_Building_Extraction_from_Airborne_Laser_Scanning_Data_An_Analysis_of_the_State_of_the_Art","abstract":"This article provides an overview of building extraction approaches applied to\nAirborne Laser Scanning (ALS) data by examining elements used in original publications,\nsuch as data set area, accuracy measures, reference data for accuracy assessment, and the use\nof auxiliary data. We succinctly analyzed the most cited publication for each year between\n1998 and 2014, resulting in 54 ISI-indexed articles and 14 non-ISI indexed publications.\nBased on this, we position some built-in features of ALS to create a comprehensive picture\nof the state of the art and the progress through the years. Our analyses revealed trends and\nremaining challenges that impact the community. The results show remaining deficiencies,\nsuch as inconsistent accuracy assessment measures, limitations of independent reference\ndata sources for accuracy assessment, relatively few documented applications of the methods\nto wide area data sets, and the lack of transferability studies and measures. Finally, we predict\nsome future trends and identify some gaps which existing approaches may not exhaustively\ncover. Despite these deficiencies, this comprehensive literature analysis demonstrates that\nALS data is certainly a valuable source of spatial information for building extraction. When\ntaking into account the short civilian history of ALS one can conclude that ALS has become\nwell established in the scientific community and seems to become indispensable in many\napplication fields.","authors":["Ivan Tomljenovic","Bernhard Höfle","Dirk Tiede","Thomas Blaschke"],"meta":["April 2015Remote Sensing 7(4):3826-3862","DOI:10.3390/rs70403826"],"references":["273280298_Building_Detection_in_Complex_Scenes_Thorough_Effective_Separation_of_Buildings_from_Trees","270273309_Updating_digital_elevation_models_via_change_detection_and_fusion_of_human_and_remote_sensor_data_in_urban_environments","269834530_A_marked_point_process_for_automated_building_detection_from_lidar_point-clouds","269220137_3D_Building_Model_Reconstruction_from_Multi-view_Aerial_Imagery_and_Lidar_Data","266588650_The_ISPRS_benchmark_on_urban_object_classification_and_3D_building_reconstruction","266334903_BUILDING_EXTRACTION_USING_LIDAR_DATA","304346317_Geomorphological_change_detection_using_object-based_feature_extraction_from_multi-temporal_lidar_data","304345982_Updating_digital_elevation_models_via_change_detection_and_fusion_of_human_and_remote_sensor_data_in_urban_environments","297581163_Creation_of_Digital_Terrain_Models_Using_an_Adaptive_Lidar_Vegetation_Point_Removal_Process","268045600_Applications_and_Solutions_for_Interoperable_3d_Geo-Visualization"]}