{"id":"274417440_Writeprints_A_Stylometric_Approach_to_Identity-level_Identification_and_Similarity_Detection_in_Cyberspace","abstract":"One of the problems often associated with online anonymity is that it hinders social accountability, as substantiated by the high levels of cybercrime. Although identity cues are scarce in cyberspace, individuals often leave behind textual identity traces. In this study we proposed the use of stylometric analysis techniques to help identify individuals based on writing style. We incorporated a rich set of stylistic features, including lexical, syntactic, structural, content-specific, and idiosyncratic attributes. We also developed the Writeprints technique for identification and similarity detection of anonymous identities. Writeprints is a Karhunen-Loeve transforms-based technique that uses a sliding window and pattern disruption algorithm with individual author-level feature sets. The Writeprints,technique and extended feature set were evaluated on a testbed encompassing four online datasets spanning different domains: email, instant messaging, feedback comments, and program code. Writeprints outperformed benchmark techniques, including SVM, Ensemble SVM, PCA, and standard Karhunen-Loeve transforms, on the identification and similarity detection tasks with accuracy as high as 94% when differentiating between 100 authors. The extended feature set also significantly outperformed a baseline set of features commonly used in previous research. Furthermore, individual-author-level feature sets generally outperformed use of a single group of attributes.","authors":["Ahmed Abbasi","Hsiu-chin Chen"],"meta":["March 2008ACM Transactions on Information Systems 26(2):1-29","DOI:10.1145/1344411.1344413","Sourcedoi.acm.org"],"references":["253253587_An_experiment_in_authorship_attribution","313763919_Application_of_the_karhunen-loeve_procedure_for_the_characterisation_of_human_faces","307065704_Statistical_Pattern_Recognition_Second_Edition","298606994_Ensemble_methods_in_machine_learning","285078182_Exploiting_stylistic_idiosyncrasies_for_authorship_attribution","279714113_Computer-mediated_communication_on_the_Internet","267465664_Applied_Bayesian_and_classical_inference_The_case_of_the_Federalist_papers_2nd_ed_of_Inference_and_disputed_authorship_The_Federalist","266041543_Statistical_Pattern_Recognition_Third_Edition","261159689_New_evolving_ensemble_classifier_for_handling_concept_drifting_data_streams","254893781_Outside_the_cave_of_shadows_Using_syntactic_annotation_to_enhance_authorship_attribution","250900159_Feature-Finding_for_Text_Classification","250015000_Empirical_evaluations_of_language-based_author_identification_techniques","246175447_Feature_finding_for_text_classification","245452103_Applied_Bayesian_and_Classical_Inference","243779738_A_Stylometric_Analysis_of_Mormon_Scripture_and_Related_Texts"]}