{"id":"274412756_What_Makes_a_Scientific_Explanation_Distinctively_Mathematical","abstract":"Certain scientific explanations of physical facts have recently been characterized as distinctively mathematical-that is, as mathematical in a different way from ordinary explanations that employ mathematics. This article identifies what it is that makes some scientific explanations distinctively mathematical and how such explanations work. These explanations are non-causal, but this does not mean that they fail to cite the explanandum's causes, that they abstract away from detailed causal histories, or that they cite no natural laws. Rather, in these explanations, the facts doing the explaining are modally stronger than ordinary causal laws (since they concern the framework of any possible causal relation) or are understood in the why question's context to be constitutive of the physical arrangement at issue. A distinctively mathematical explanation works by showing the explanandum to be more necessary (given the physical arrangement in question) than ordinary causal laws could render it. Distinctively mathematical explanations thus supply a kind of understanding that causal explanations cannot. 1 Introduction2 Some Distinctively Mathematical Scientific Explanations3 Are Distinctively Mathematical Explanations Set Apart by their Failure to Cite Causes?4 Distinctively Mathematical Explanations do not Exploit Causal Powers5 How these Distinctively Mathematical Explanations Work6 Conclusion © 2012 The Author 2012. Published by Oxford University Press on behalf of British Society for the Philosophy of Science. All rights reserved. For Permissions, please email: [email protected]\n/* */","authors":["Marc Lange"],"meta":["August 2012The British Journal for the Philosophy of Science 64(3):485-511","DOI:10.1093/bjps/axs012"],"references":["247272387_Program_Explanation_A_General_Perspective","227679246_A_Tale_of_Two_Vectors","227391197_In_Defense_of_Explanatory_Ecumenism","31122339_Mathematical_Explanation_in_Science","30969544_Are_There_Genuine_Mathematical_Explanations_of_Physical_Phenomena","287150434_Varieties_of_Necessity","285357009_Structural_explanation","284585955_Humean_Supervenience_Debugged","281249590_Mathematical_Explanation_Why_it_Matters","268209413_Mathematics_Explanation_and_Scientific_Knowledge","259709315_Conservation_Laws_in_Scientific_Explanations_Constraints_or_Coincidences","253287748_Can_the_Eleatic_Principle_Be_Justified","248085154_Three_Theses_About_Dispositions","243488270_Lorentz_transformations_from_the_first_postulate","229451140_A_Role_for_Mathematics_in_the_Physical_Sciences","228345646_What_Are_Mathematical_Coincidences_and_Why_Does_It_Matter","225070178_The_Logic_of_Explanation","36445163_On_the_Explanatory_Role_of_Mathematics_in_Empirical_Science","31490544_The_Explanatory_Power_of_Phase_Spaces"]}