{"id":"274462121_Optimal_Parallel_Algorithms_for_Computing_the_Sum_the_Prefix-Sums_and_the_Summed_Area_Table_on_the_Memory_Machine_Models","abstract":"The main contribution of this paper is to show optimal parallel algorithms to compute the sum, the prefix-sums, and the summed area table on two memory machine models, the Discrete Memory Machine (DMM) and the Unified Memory Machine (UMM). The DMM and the UMM are theoretical parallel computing models that capture the essence of the shared memory and the global memory of GPUs. These models have three parameters, the number p of threads, and the width w of the memory, and the memory access latency /. We first show that the sum of n numbers can be computed in O{ JJ + ^ + / log ri) time units on the DMM and the UMM. We then go on to show that Cl(^ + ^ + Hog ri) time units are necessary to compute the sum. We also present a parallel algorithm that computes the prefix-sums of n numbers in O(j; + ^j + Hog ri) time units on the DMM and the UMM. Finally, we show that the summed area table of size V'' x V'' can be computed in O time units on the DMM and the UMM. Since the computation of the prefix-sums and the summed area table is at least as hard as the sum computation, these parallel algorithms are also optimal. © 2013 The Institute of Electronics, Information and Communication Engineers.","authors":["Koji Nakano"],"meta":["December 2013IEICE Transactions on Information and Systems E96.D(12):2626-2634","DOI:10.1587/transinf.E96.D.2626"],"references":["261147115_Simple_Memory_Machine_Models_for_GPUs","261090948_An_Implementation_of_Conflict-Free_Offline_Permutation_on_the_GPU","224483213_Some_computer_organizations_and_their_effectiveness_IEEE_Trans_Comput_C-21948","319770176_Summed-area_tables_for_texture_mapping","313560953_Some_computer_organizations_and_their_effectiveness","305386579_NVIDIA_CUDA_c_programming_guide","292255497_GPU_Computing_Gems_Emerald_Edition","272356916_Nvidia_Cuda_C_Programming_Guide","234815014_Update_to_data_parallel_algorithms","234791241_Summed-Area_Tables_for_Texture_Mapping"]}