{"id":"274403259_Low-Latency_Software_Polar_Decoders","abstract":"Polar codes are a new class of capacity-achieving error-correcting codes with\nlow encoding and decoding complexity. Their low-complexity decoding algorithms\nrender them attractive for use in software-defined radio applications where\ncomputational resources are limited. In this work, we present low-latency\nsoftware polar decoders that exploit modern processor capabilities. We show how\nadapting the algorithm at various levels can lead to significant improvements\nin latency and throughput, yielding polar decoders that are suitable for\nhigh-performance software-defined radio applications on modern desktop\nprocessors and embedded-platform processors. These proposed decoders have an\norder of magnitude lower latency compared to state of the art decoders, while\nmaintaining comparable throughput. In addition, we present strategies and\nresults for implementing polar decoders on graphical processing units. Finally,\nwe show that the energy efficiency of the proposed decoders, running on desktop\na processor, is comparable to state of the art software polar decoders.","authors":["Pascal Giard","Gabi Sarkis","Camille Leroux","C. Thibeault"],"meta":["May 2018Journal of Signal Processing Systems 90(5)","DOI:10.1007/s11265-016-1157-y","SourcearXiv","Project: Polar Codes"],"references":["283837094_Autogenerating_software_polar_decoders","273397923_Multi-Gbs_Software_Decoding_of_Polar_Codes","262605026_A_High_Throughput_Efficient_Approach_for_Decoding_LDPC_Codes_onto_GPU_Devices","257299518_A_122Mbs_Turbo_decoder_using_a_mid-range_GPU","290754881_Software_polar_decoder_on_an_embedded_processor","270649968_A_LTE_receiver_framework_using_GNU_Radio","269305915_Implementation_of_IEEE_80211n_LDPC_codes_based_on_general_purpose_processors","260519233_Implementation_of_LTE_system_on_an_SDR_platform_using_CUDA_and_UHD","256911270_A_Semi-Parallel_Successive-Cancellation_Decoder_for_Polar_Codes","256911269_Increasing_the_Throughput_of_Polar_Decoders"]}