{"id":"274512986_Model_of_e-Learning_Acceptance_and_Use_for_Teaching_Staff_in_Higher_Education_Institutions","abstract":"We live in a world where we are exposed to everyday changes that information and communication\ntechnologies (ICT) give us impose. These changes are largely related to education, and so the introduction of\nICT in universities as institutions of higher education, clearly changing the way it is implemented. The policy of\n“Goce Delcev” University (UGD) is to fully implement ICT in all segments of management, administration and\nteaching. For this purpose, several projects for e-learning implementation at UGD have been conducted. But, as much as important introduction is, the more important is the acceptance of new technologies in education.\nTherefore, we shall use a modified Unified Theory of Acceptance and Use of Technology (UTAUT) as the\nresearch methodology. The purpose of this paper is understanding teaching staff acceptance and use eLearning system (ELC) and investigating the influence of seven determinants (four UTAUT determinants, 2\nadditional determinants and one personal \"selfconfidence\" determinant). A survey was administered to\n92 respondents (teaching staff) to capture their perceptions of e-learning. The findings of this research\nshow that among the seven UTAUT factors, the effort expectancy and facilitating conditions have the strongest\neffect of intention to use new technology. Also according to the survey, social influence and facilitating conditions are in strongest correlation with the behavioral intention and thereby the most influence on the behavior of participants for acceptance and use of the e – learning system.","authors":["Mirjana Kocaleva","Igor Stojanovic","Zoran Zdravev"],"meta":["April 2015","DOI:10.5815/ijmecs.2015.04.03"],"references":["267978168_Issues_of_Technical_Support_for_e-Learning_Systems_in_Higher_Education_Institutions","263816362_A_Model_of_ICT_Acceptance_and_Use_for_Teachers_in_Higher_Education_Institutions","263547274_Research_on_UTAUT_Application_in_Higher_Education_Institutions","262285392_Acceptance_of_blog_technology_in_E-business_course","260921405_UTAUT_and_its_application_in_an_educational_environment_State-of-the-Art","258841651_Analysis_of_Citizens_Acceptance_for_E-government_Services_Applying_the_UTAUT_Model","274656345_Faculty_Use_of_Established_and_Emerging_Technologies_in_Higher_Education_A_Unified_Theory_of_Acceptance_and_Use_of_Technology_Perspective","272852967_Moodle_and_e-learning_Tools","262852656_Library_mobile_applications_in_university_libraries","262162063_Adapting_the_Unified_Theory_of_Acceptance_and_Use_of_Technology_UTAUT_as_a_Tool_for_Validating_User_Needs_on_the_Implementation_of_e-Trial_Software_Systems"]}