{"id":"274632820_USING_SCRATCH_IN_INTRODUCTION_TO_PROGRAMMING_COURSE_FOR_ENGINEERING_STUDENTS","abstract":"Introduction to programming languages course is an important course for several engineering disciplines such as computer engineering, software engineering, information systems engineering, electrical engineering and industrial engineering. However, in the first year of their engineering programs, students as well as the instructors are facing with several problems during these courses. Most of these problems are originating from the complexity of the programming concepts like variables, loops, arrays, functions and of syntax of programming languages. These complexities may become barriers for learning programming and source of lack of motivation for students. In this study, for the introduction to programming course namely COMPE 112 Computer Programming in C, in parallel to the classical lessons we have used the Scratch programming environment. Main aim of this implementation is to better facilitate the understanding and usage of the programming concepts and eliminate the syntactical barriers of a text-based C language. Accordingly, this study is designed as an action research to better understand the problems of this course and the effect of support of Scratch environment for this course. Hence, this study describes how Scratch is used in this course in parallel to the classical course lessons that is offered for computer engineering, software engineering and information systems engineering students and the insights taken from this study.","authors":["Dinçer Özoran","Nergiz Cagiltay","Damla Topalli"],"meta":["October 2012","Conference: 2nd International Engineering Education Conference (IEEC2012)At: Antalya / TurkeyVolume: 2"],"references":["270883053_Remote_laboratory_development_as_an_action_research_A_case_study","261725579_The_Effects_of_a_Social_Constructivist_Pedagogy_on_At-risk_Students_Completing_a_Computer_Programming_Course_at_a_Post-secondary_Institution","252016589_Visual_programming_for_smartphones","234831832_Alice_Greenfoot_and_Scratch_-_A_Discussion","234803601_A_CS0_course_using_Scratch","228525906_Programming_osmosis_Knowledge_transfer_from_imperative_to_visual_programming_environments","290333506_Measuring_the_effect_of_intervening_early_for_academically_at_risk_students_in_a_CS1_course","254006887_What_do_students_learn_about_programming_from_game_music_video_and_storytelling_projects","234794185_Teaching_computer_science_in_context","233315542_Investigating_and_improving_the_models_of_programming_concepts_held_by_novice_programmers"]}