{"id":"274622188_Kinematic_Modelling_and_Simulation_of_a_2-R_Robot_Using_SolidWorks_and_Verification_by_MATLABSimulink","abstract":"The simulation of robot systems is becoming very popular, especially with the lowering of the cost of computers, and it can be used for layout evaluation, feasibility studies, presentations with animation and off‐ line programming.\nThe trajectory planning of redundant manipulators is a very active area since many tasks require special characteristics to be satisfied. The importance of redundant manipulators has increased over the last two decades because of the possibility of avoiding singularities as well as obstacles within the course of motion. The angle that the last link of a 2 DOF manipulator makes with the x‐axis is required in order to find the solution for the inverse kinematics problem. This angle could be optimized with respect to a given specified key factor (time, velocity, torques) while the end‐effector performs a chosen trajectory (i.e., avoiding an obstacle) in the task space.\nModeling and simulation of robots could be achieved using either of the following models: the geometrical model (positions, postures), the kinematic model and the dynamic model.\nTo do so, the modelization of a 2‐R robot type is implemented. Our main tasks are comparing two robot postures with the same trajectory (path) and for the same length of time, and establishing a computing code to obtain the kinematic and dynamic parameters.\nSolidWorks and MATLAB/Simulink softwares are used to check the theory and the robot motion simulation.\nThis could be easily generalized to a 3‐R robot and possibly therefore to any serial robot (Scara, Puma, etc.).\nThe verification of the obtained results by both softwares allows us to qualitatively evaluate and underline the validity of the chosen model and obtain the right conclusions. The results of the simulations are discussed and an agreement between the two softwares is certainly obtained.","authors":["Mahmoud Gouasmi","Ouali Mohammed","Brahim Fernini","Mhamed Meghatria"],"meta":["December 2012International Journal of Advanced Robotic Systems 9(6):1","DOI:10.5772/50203","Projects: Dynamics analysis of robotsROBOTICS"],"references":["221702459_WebotsTM_Professional_Mobile_Robot_Simulation","220674427_Mathematical_modelling_simulation_and_experimental_verification_of_a_scara_robot","269263536_Modelling_and_simulation_in_mechatronics","267093484_Theory_of_applied_robotics_Kinematics_dynamics_and_control_2nd_Edition","264006623_VIRTUAL_RALITY_IN_MECHANICAL_ENGINEERING_MODELLING_AND_SIMULATION_WITH_SOLID_DYNYMICS","260592365_Modular_Structured_Model_Design_Simulation_and_Control_of_Hydraulic_and_Pneumatic_Driving_Systems_by_Using_HYPAS","260145899_Robotics_Modelling_Planning_and_Control","257880556_Robotics_modelling_planning_and_control","235261908_Efficient_robotic_welding_for_shipyards_-_virtual_reality_simulation_holds_the_key","224782517_Design_optimisation_of_industrial_robots_using_the_Modelica_multi-physics_modeling_language"]}