{"id":"274645139_A_Three-Operator_Splitting_Scheme_and_its_Optimization_Applications","abstract":"Operator splitting schemes have been successfully used in computational\nsciences to reduce complex problems into a series of simpler subproblems. Since\n1950s, these schemes have been widely used to solve problems in PDE and\ncontrol. Recently, large-scale optimization problems in machine learning,\nsignal processing, and imaging have created a resurgence of interest in\noperator-splitting based algorithms because they often have simple\ndescriptions, are easy to code, and have (nearly) state-of-the-art performance\nfor large-scale optimization problems. Although operator splitting techniques\nwere introduced over 60 years ago, their importance has significantly increased\nin the past decade.\nThis paper introduces a new operator-splitting scheme for solving a variety\nof problems that are reduced to a monotone inclusion of three operators, one of\nwhich is cocoercive. Our scheme is very simple, and it does not reduce to any\nexisting splitting schemes. Our scheme recovers the existing forward-backward,\nDouglas-Rachford, and forward-Douglas-Rachford splitting schemes as special\ncases.\nOur new splitting scheme leads to a set of new and simple algorithms for a\nvariety of other problems, including the 3-set split feasibility problems,\n3-objective minimization problems, and doubly and multiple regularization\nproblems, as well as the simplest extension of the classic ADMM from 2 to 3\nblocks of variables. In addition to the basic scheme, we introduce several\nmodifications and enhancements that can improve the convergence rate in\npractice, including an acceleration that achieves the optimal rate of\nconvergence for strongly monotone inclusions. Finally, we evaluate the\nalgorithm on several applications.","authors":["Damek Davis","Wotao Yin"],"meta":["December 2017Set-Valued and Variational Analysis 25(4)","DOI:10.1007/s11228-017-0421-z","SourcearXiv"],"references":["320356932_Convergence_Rate_Analysis_of_Several_Splitting_Schemes","305692934_On_the_convergence_of_the_direct_extension_of_ADMM_for_three-block_separable_convex_minimization_models_with_one_strongly_convex_function","304185942_Backward-forward_algorithms_for_structured_monotone_inclusions_in_Hilbert_spaces","289588114_Coordinate_Friendly_Structures_Algorithms_and_Applications","272792309_The_direct_extension_of_ADMM_for_multi-block_convex_minimization_problems_is_not_necessarily_convergent","269998340_On_the_convergence_rate_of_a_forward-backward_type_primal-dual_splitting_algorithm_for_convex_optimization_problems","315573860_Convex_Analysis_and_Monotone_Operator_Theory_in_Hilbert_Spaces","303561475_Two_remarks_on_the_method_of_successive_approximations","279893241_Approximation_by_Finite_Elements_of_Order_One_and_Solution_by_Penalization-Duality_of_a_Class_of_Nonlinear_Dirichlet_ProblemsSUR_L'APPROXIMATION_PAR_ELEMENTS_FINIS_D'ORDRE_UN_ET_LA_RESOLUTION_PAR_PENA","272825857_UCI_Machine_Learning_Repository"]}