{"id":"274637376_Distributed_Constrained_Optimization_for_Bayesian_Opportunistic_Visual_Sensing","abstract":"We propose a control mechanism to obtain oppor-tunistic high resolution facial imagery, via distributed constrained optimization of the pan, tilt, zoom (PTZ) parameters for each camera in a sensor network. The objective function of the optimization problem quantifies the per camera per target image quality. The tracking constraints, which are a lower bound on the information about the estimated position for each target, define the feasible PTZ parameter space. Each camera alters its own PTZ settings. All cameras use information broadcast by neighboring cameras such that the PTZ parameters of all cameras are simultaneously optimized relative to the global objective. At certain times of opportunity, due to the configuration of the targets relative to the cameras, and the fact that each camera may track many targets, the camera network may be able to reconfigure itself to achieve the tracking specification for all targets with remaining degrees of freedom that can be used to obtain high-res facial images from desirable aspect angles for certain targets. The challenge is to define algorithms to automatically find these time instants, the appropriate imaging camera, and the appropriate parameter settings for all cameras to capitalize on these opportunities. The solution proposed herein involves a Bayesian formulation in a game theoretic setting. The Bayesian formulation automatically trades off objective maximization versus the risk of losing track of any target. This paper describes the problem and solution formulations, design of aligned local and global objective functions and the inequality constraint set, and development of a distributed Lagrangian consensus algorithm that allows cameras to exchange information and asymptotically converge on a pair of primal–dual optimal solutions. This paper presents the theoretical solution along with the simulation results.","authors":["Akshay Morye","Chong Ding","Amit Roy-Chowdhury","Jay Farrell"],"meta":["November 2014Control Systems Technology, IEEE Transactions on 22(6):2302","DOI:10.1109/TCST.2014.2300416","Project: Decentralized Intelligent Camera Networks"],"references":["261109437_Passivity-based_visual_pose_regulation_for_a_moving_target_object_in_three_dimensions_Structure_design_and_convergence_analysis","255686035_Constrained_Optimization_for_Opportunistic_Distributed_Visual_Sensing","314416124_Distributed_multi-target_tracking_in_a_self-configuring_camera_network","312941995_Probabilistic_Broadcast_for_Flooding_in_Wireless_Mobile_Ad_hoc_Networks","312890364_Consensus_seeking_in_multi-agent_systems_under_dynamically_changing_interaction_topologies","299148323_Vision-based_gesture_recognition_A_review","284661956_Consensus_seeking_in_multi-agent_systems_using_dynamically_changing_interaction_topologies","261051601_Information_weighted_consensus","260453705_Simulated_Annealing_Theory_and_Applications","258494711_Distributed_Computer_Vision_Algorithms"]}