{"id":"274734405_A_dynamic_attention_assessment_and_enhancement_tool_using_computer_graphics","abstract":"Training Programs to enhance Math Solving Skills, Memory, Visualization, etc in children are gaining popularity worldwide. Any skill is better acquired, when attention, the basic cognitive ability of the trainee is improved. This study makes an attempt to devise a technique in the form of a Brain Computer Interface (BCI) Game, to assist the trainers in monitoring and evaluating the attention levels of the trainees, at regular intervals during the training period.\nThe gaming environment is designed using Open Source Graphics Library (OpenGL) package and the game control is through the player’s brain waves using the BCI technology. The players control the movement of an object from a source to a destination location on the screen by focussing their thought processes. The time taken to complete one game can be recorded. More the time taken, lesser would be the attention sustaining capacity of the player.\nThirteen subjects under different levels of the ABACUS Math Solving training program controlled the ball movement while solving math problems mentally, the time taken reduced for most of the subjects as they reached higher levels of their training course, indicating the benefit of such training programmes. The game was also played by eight non-abacus literates. The evaluation procedure was found to be very easy and fast.","authors":["Geeta Navalyal","Rahul Gavas"],"meta":["July 2014Human-centric Computing and Information Sciences 4(1)","DOI:10.1186/s13673-014-0011-0"],"references":["239803923_What_Is_Neurofeedback","232619431_Brain-Computer_Interfaces_Virtual_Reality_and_Videogames","229358112_The_performance_evaluation_context_Social_emotional_cognitive_political_and_relationship_components","224634500_A_Brain-Controlled_Wheelchair_Based_on_P300_and_Path_Guidance","224202319_EEG-Based_Serious_Games_Design_for_Medical_Applications","224174310_Evaluating_a_Brain-Computer_Interface_to_Categorise_Human_Emotional_Response","221157580_Brain-Computer_Interface_Next_Generation_Thought_Controlled_Distributed_Video_Game_Development_Platform","44803567_Effectiveness_of_a_Brain-Computer_Interface_Based_Programme_for_the_Treatment_of_ADHD_A_Pilot_Study","246041020_Electric_Fields_of_the_Brain_The_Neurophysics_of_EEG","221633778_Tennis_computer_game_with_brain_control_using_EEG_signals"]}