{"id":"274747527_Existence_and_Uniqueness_of_Solutions_to_the_Generalized_Riemann_Problem_for_Isentropic_Flow","abstract":"We consider network models for isentropic flow and evaluate the application of three different momentum-related coupling constants: pressure, momentum flux, and the Bernoulli invariant. Subsonic solutions to generalized Riemann problems with subsonic initial conditions are proved to be unique, and the region where such initial conditions yield subsonic solutions is identified. The proof is restricted to monotone coupling constants. We also prove that the three momentumrelated coupling constants fulfill the monotonicity constraint. Further, we analyze the existence of entropic solutions using a commonly applied entropy condition. The condition states that nonphysical solutions are characterized by production of mechanical energy at a junction. Both pressure and momentum flux are seen to yield nonphysical solutions in a constructed test case consisting of three pipe sections of equal cross-sectional area that are connected at a junction. The Bernoulli invariant is proved to yield entropic solutions for all subsonic flow conditions in the general case of a junction connecting N pipe sections of arbitrary cross-sectional area. Hence, among the three considered network models, only the model with the Bernoulli invariant as the momentum-related coupling constant yields physical solutions for all subsonic flow conditions at the pipe-junction interfaces.","authors":["Gunhild Allard Reigstad"],"meta":["March 2015SIAM Journal on Applied Mathematics 75(2):679-702","DOI:10.1137/140962759","Project: Enabling low emission LNG production"],"references":["275251619_Coupling_constants_and_the_generalized_Riemann_problem_for_isothermal_junction_flow","272694969_Numerical_network_models_and_entropy_principles_for_isothermal_junction_flow","266196794_Coupling_Drift-Flux_Models_with_Unequal_Sonic_Speeds","264954117_Flows_on_networks_Recent_results_and_perspectives","252491761_Trac_Flow_on_Networks_Conservation_Laws_Models","227633428_Simulation_of_transient_gas_flow_at_pipe-to-pipe_intersections","267018007_Euler_System_for_compressible_fluids_at_a_junction","263872054_A_riemann_problem_at_a_junction_of_open_canals","239442330_Coupling_conditions_for_the_3_3_Euler_system","224010913_Finite_Volume_Methods_for_Hyperbolic_Systems"]}