{"id":"274921023_Spreadable_Media_Creating_Value_and_Meaning_in_a_Networked_Culture","abstract":"The following conversation is an edited excerpt from a broader roundtable discussion, organized and moderated by Cinema Journal between June and July 2013. In this section, the conversation focuses on popular culture, fans, and niche cultures. The contributors responded to a series of prompts that asked them to consider the relationship between Spreadable Media and past and current work in fan studies (including Henry Jenkins’s Textual Poachers and Convergence Culture).1 Participants also explore Spreadable Media’s relationship to fan studies scholarship and ask whether Spreadable Media represents a shift in the way we think of fans in relationship to popular culture. The full conversation addresses Spreadable Media’s engagement with questions of transmedia, digital culture, and online social activism more broadly, and it will be published online in an upcoming edition of Transformative Works and Cultures. [End Page 152]\nAlthough Spreadable Media is ultimately not a fan studies book, nor does it try to be, it purposefully engages the concept of the fan and thus gets read in conjunction with fan scholarship, including Jenkins’s previous works, Textual Poachers and Convergence Culture. Given that trajectory and the way the book repeatedly deploys specific examples of fan activities within its larger project, it raises the question as to how Spreadable Media uses the fan and how it engages with fan scholarship. Looking at the way Spreadable Media stretches the concept of being a fan to a point of seeming unrecognizability, I would suggest that the book is ultimately not interested in fans, except what they tell us about larger audiences.\nThere are obviously strategic reasons to expand the term fan from the narrow confines that Henry Jenkins’s earlier Textual Poachers set out. In the intervening years, many aspects of fandom have mainstreamed, a move that Henry has both described extensively and partly helped bring about. There are many benefits to conceptualizing active audiences as fans, but I’d like to look at some of the drawbacks. In particular, I’d like to look at what happens when the definition of fan changes from one based on identity to one based on action. I’d like to look at what gets left out when the definition of fan is as broadly conceived as it is in Spreadable Media, when any “like” click on Facebook, any forwarding of a YouTube link, constitutes a fan activity. I am concerned that such a broadening of the concept facilitates a shift from the fans studied in Textual Poachers to general audiences. Such a shift moves the focus away from the marginal media fan, who was mostly commercially nonviable, often resistant, and uncooperative, and whose dedication to a gift economy was often in spite of capitalist alternatives and not because they didn’t exist. In its stead, the fans who take center stage in Spreadable Media are the commercializable audiences, who happily seem to collaborate in their own exploitation, free laborers creating value of which they cannot even assume ownership. What gets excluded and marginalized in Spreadable Media, then, are the very founders of the concept of fan, the unruly and aggressively anticommercial, the queered and sexually explicit, the anticapitalist and anticopyright. What gets excluded are the audiences whose practices may have been adapted and adopted and celebrated but whose presence is ultimately not desired in this brand-new, commercially viable fan universe.\nSpreadable Media acknowledges this danger: “We all should be vigilant over what gets sacrificed, compromised, or co-opted by media audiences as part of this process of mainstreaming the activities and interests of cult audiences.”2 But when reading through the chapters, I am distressed by observing that very compromise the authors warn against. I fear the actual driving force of...","authors":["Louisa Stein","Henry Jenkins","Sam Ford","Joshua Green"],"meta":["January 2014Cinema Journal 53(3):152-177","DOI:10.1353/cj.2014.0021"],"references":[]}