{"id":"274900619_What_Happens_Before_A_Field_Experiment_Exploring_How_Pay_and_Representation_Differentially_Shape_Bias_on_the_Pathway_Into_Organizations","abstract":"Little is known about how discrimination manifests before individuals formally apply to organizations or how it varies within and between organizations. We address this knowledge gap through an audit study in academia of over 6,500 professors at top U.S. universities drawn from 89 disciplines and 259 institutions. In our experiment, professors were contacted by fictional prospective students seeking to discuss research opportunities prior to applying to a doctoral program. Names of students were randomly assigned to signal gender and race (White, Black, Hispanic, Indian, Chinese), but messages were otherwise identical. We hypothesized that discrimination would appear at the informal \"pathway\" preceding entry to academia and would vary by discipline and university as a function of faculty representation and pay. We found that when considering requests from prospective students seeking mentoring in the future, faculty were significantly more responsive to White males than to all other categories of students, collectively, particularly in higher-paying disciplines and private institutions. Counterintuitively, the representation of women and minorities and discrimination were uncorrelated, a finding that suggests greater representation cannot be assumed to reduce discrimination. This research highlights the importance of studying decisions made before formal entry points into organizations and reveals that discrimination is not evenly distributed within and between organizations. (PsycINFO Database Record\n(c) 2015 APA, all rights reserved).","authors":["Katherine L. Milkman","Modupe Akinola","Dolly Chugh"],"meta":["April 2015Journal of Applied Psychology 100(6)","DOI:10.1037/apl0000022","SourcePubMed"],"references":["287163424_1964_was_not_that_long_ago_A_story_of_gateways_and_pathways","314897332_Race_and_Ethnic_Differences_in_College_Achievement_Does_High_School_Attended_Matter","292759617_Faculty_diversity_Too_little_for_too_long","281627116_Race_Network_Hiring_and_Statistical_Discrimination","278900266_A_threat_in_the_air_-_How_stereotypes_shape_intellectual_identity_and_performance","275698463_The_Power_in_Demography_Women's_Social_Construction_of_Gender_Identity_at_Work","273076181_Work_and_Friendship_Ties_in_Organizations_A_Comparative_Analysis_of_Relation_Networks","272541633_Rank_Advancement_in_Academic_Careers_Sex_Differences_and_the_Effects_of_Productivity","271815120_Exploring_Underrepresentation_The_Case_of_Faculty_of_Color_in_the_Midwest","271807672_Racial_and_Marital_Status_Differences_in_Faculty_Pay"]}