{"id":"275046100_Measuring_Team_Cohesion_Observations_from_the_Science","abstract":"The aim of this study was to review literature relevant to cohesion measurement, explore developing measurement approaches, and provide theoretical and practical recommendations for optimizing cohesion measurement.\nCohesion is essential for team effectiveness and performance, leading researchers to focus attention on understanding how to enhance it. However, cohesion is inconsistently defined and measured, making it difficult to compare findings across studies and limiting the ability to advance science and practice.\nWe reviewed empirical research through which we uncovered specific information about cohesion's conceptualization, measurement, and relationships with performance, culminating in a set of current trends from which we provide suggestions and possible solutions to guide future efforts and help the field converge toward greater consistency.\nCohesion demonstrates more significant relationships with performance when conceptualized using social and task (but not other) dimensions and when analyses are performed at the team level. Cohesion is inherently temporal, yet researchers rarely measure cohesion at multiple points during the life of a team. Finally, cohesion matters in large, dynamic collectives, complicating measurement. However, innovative and unobtrusive methodologies are being used, which we highlight.\nPractitioners and researchers are encouraged to define cohesion with task and social subdimensions and to measure with behavioral and attitudinal operationalizations. Individual and team-oriented items are recommended, though team-level analyses are most effective. Innovative/unobtrusive methods should be further researched to enable cohesion measurement longitudinally and in large, dynamic collectives.\nBy applying our findings and conclusions, researchers and practitioners will be more likely to find consistent, reliable, and significant cohesion-to-performance relationships.\nThis work is not subject to U.S. copyright restrictions.","authors":["Eduardo Salas","Rebecca Grossman","Ashley Hughes","Chris W. Coultas"],"meta":["May 2015Human Factors The Journal of the Human Factors and Ergonomics Society 57(3):365-74","DOI:10.1177/0018720815578267","SourcePubMed"],"references":["280771035_A_Conceptual_Review_of_Emergent_State_Measurement","279231908_Teams_in_Space_Exploration_A_New_Frontier_for_the_Science_of_Team_Effectiveness","271776415_A_Temporally_Based_Framework_and_Taxonomy_of_Team_Processes","271728250_Cognition_and_Physiological_Response_Towards_a_Model_of_Validated_Physiological_Measurement","264164067_An_integrative_framework_for_sensor-based_measurement_of_teamwork_in_healthcare","260089237_Do_High-Commitment_Work_Systems_Affect_Creativity_A_Multilevel_Combinational_Approach_to_Employee_Creativity","292225568_Trust_in_organisations_a_conceptual_framework_linking_organisational_forms_managerial_philosophies_and_the_opportunity_costs_of_controls","270702663_Team_Players_and_Collective_Performance_How_Agreeableness_Affects_Team_Performance_Over_Time","261171141_Developing_adaptive_teams_A_theory_of_compilation_and_performance_across_levels_and_time","259129693_Short-_and_long-term_stability_in_organizational_networks_Temporal_structures_of_project_teams"]}