{"id":"275039237_The_Integration_of_Information_Technology_in_Higher_Education_A_Study_of_Faculty's_Attitude_Towards_its_Adoption_in_the_Teaching_Process","abstract":"It is a reality that advancement of Information Technology revolutionized the business practices and strategies of entire Industries. The field of higher education is not an exception to this phenomenon. Colleges and universities around the world are investing considerable amount of money to create Information Technology resources that meet their student’s and faculty’s instructional needs. While universities encourage their faculties to adopt the new technologies for their preparation and delivery of classes, various other factors influence the integration or resistance of acceptance of these technologies. Age, highest education earned, teaching experience, computer competency, prior computer experience, availability of technology, Institutional support etc. are examples of these factors. Based on the theoretical support of Roger’s Diffusion Theory, a conceptual model is developed to identify the critical success factors that influence the adoption of Information Technology among faculties of tertiary educational institutions. The model is empirically tested among the faculty members of leading universities in Asian region. 261 full time lecturers participated in this study and the results show that factors such as computer self-efficacy, relative advantage, compatibility and prior computer experience are significantly influencing their perceived ease of use and attitude towards using educational technologies.","authors":["Surej John"],"meta":["January 2015Contaduría y Administración 60(4)","DOI:10.1016/j.cya.2015.08.004","Conference: XIV International Business and Economy Conference (IBEC)At: Bangkok, Thailand","Project: IT adoption in higher education"],"references":["289310762_Modeling_Perceived_Usefulness_on_adopting_on_line_banking_through_the_TAM_model_in_a_Canadian_banking_environment","313558350_Understanding_Information_Technology_Usage_A_Test_of_Competing_Models","313052103_What_drives_a_successful_e-learning","312984568_Perceived_usefulness_perceived_ease_and_user_acceptance_of_information_technology","312976801_Emerging_educational_technology_Assessing_the_factors_that_influence_instructors'_acceptance_in_information_systems_and_other_classrooms","304534338_Understanding_Attitudes_and_Predicting_Social_Behavior","297130132_The_web-enhanced_classroom","287651935_Development_of_an_instrument_to_measure_perceptions_of_adoption_of_an_information_technology_innovations","285902394_Factors_Influencing_the_Adoption_of_Internet_Banking_in_Tunisia","282415961_Understanding_the_Formation_of_General_Computer_Self-Efficacy"]}