{"id":"275071808_Identification_of_V-Formations_and_Circular_and_Doughnut_Formations_in_a_Set_of_Moving_Entities_with_Outliers","abstract":"Diverse movement patterns may be identified when we study a set of moving entities. One of these patterns is known as a V-formation for it is shaped like the letter V. Informally, a set of entities shows a V-formation if the entities are located on one of their two characteristic lines. These lines meet in a position where there is just one entity considered the leader of the formation. Another movement pattern is known as a circular formation for it is shaped like a circle. Informally, circular formations present a set of entities grouped around a center in which the distance from these entities to the center is less than a given threshold. In this paper we present a model to identify V-formations and circular formations with outliers. An outlier is an entity which is part of a formation but is away from it. We also present a model to identify doughnut formations, which are an extension of circular formations. We present formal rules for our models and an algorithm for detecting outliers. The model was validated with NetLogo, a programming and modeling environment for the simulation of natural and social phenomena.","authors":["Francisco Moreno","Jaime Alberto Guzmán Luna","Sebastian Alonso Gomez Arias"],"meta":["April 2014Abstract and Applied Analysis 2014(4):1-11","DOI:10.1155/2014/241684"],"references":["237436551_Thirteen_Ways_to_Look_at_the_Correlation_Coefficient","308048640_Thirteen_ways_to_look_at_the_correlation_coefficient","262209756_Interacting_with_Stock_Market_Data_in_a_Virtual_Environment","257591166_Adaptive_flocking_with_a_virtual_leader_of_multiple_agents_governed_by_local_Lipschitz_nonlinearity","245629134_Center_for_Connected_Learning_and_Computer-Based_Modeling","244468262_Location_of_Several_Outliers_in_Multiple-Regression_Data_Using_Elemental_Sets","235709967_Flocks_Herds_and_Schools_A_Distributed_Behavioral_Model","224384613_Flocking_of_Multi-Agents_With_a_Virtual_Leader","224114404_Self-organization_in_bird_flight_formations_using_diffusion_adaptation","224010948_V-like_Formations_in_Flocks_of_Artificial_Birds"]}