{"id":"275066672_A_Novel_Two-Stage_Spectrum-Based_Approach_for_Dimensionality_Reduction_A_Case_Study_on_the_Recognition_of_Handwritten_Numerals","abstract":"Dimensionality reduction (feature selection) is an important step in pattern recognition systems. Although there are different conventional approaches for feature selection, such as Principal Component Analysis, Random Projection, and Linear Discriminant Analysis, selecting optimal, effective, and robust features is usually a difficult task. In this paper, a new two-stage approach for dimensionality reduction is proposed. This method is based on one-dimensional and two-dimensional spectrum diagrams of standard deviation and minimum to maximum distributions for initial feature vector elements. The proposed algorithm is validated in an OCR application, by using two big standard benchmark handwritten OCR datasets, MNIST and Hoda. In the beginning, a 133-element feature vector was selected from the most used features, proposed in the literature. Finally, the size of initial feature vector was reduced from 100% to 59.40% (79 elements) for the MNIST dataset, and to 43.61% (58 elements) for the Hoda dataset, in order. Meanwhile, the accuracies of OCR systems are enhanced 2.95% for the MNIST dataset, and 4.71% for the Hoda dataset. The achieved results show an improvement in the precision of the system in comparison to the rival approaches, Principal Component Analysis and Random Projection. The proposed technique can also be useful for generating decision rules in a pattern recognition system using rule-based classifiers.","authors":["Mohammad Amin Shayegan","Saeed Aghabozorgi","Ram Gopal Raj"],"meta":["May 2014Journal of Applied Mathematics 2014(2):1-14","DOI:10.1155/2014/654787"],"references":["273136183_Feature_Selection_in_Statistical_Classification","271974169_Offline_OCR_System_for_Machine-Printed_Turkish_Using_Template_Matching","270628850_A_New_Dataset_Size_Reduction_Approach_for_PCA-Based_Classification_in_OCR_Application","261930093_Recent_Trends_and_Tools_for_Feature_Extraction_in_OCR_Technology","261853759_Offline_Arabic_Handwritten_Text_Recognition_A_Survey","313758938_A_Survey_of_Dimension_Reduction_Techniques","309121181_A_literature_review_on_hand_written_character_recognition","287458301_Improving_Offline_Handwritten_Digit_Recognition_Using_Concavity-Based_Features","285924372_Novel_Moment_Features_Extraction_for_Recognizing_Handwritten_Arabic_Letters","262175206_Multilingual_OCR_research_and_applications_An_overview"]}