{"id":"275017642_The_Universe_as_a_Cyclic_Organized_Information_System_John_Wheeler's_World_Revisited","abstract":"This essay highlights the scientific vision of John Archibald Wheeler, a giant of 20th century physics. His ideas provided the important insight that humanity may be in the very center of disclosure and manifestation of the evolution of our universe. This on the basis of scientific reasoning derived from quantum physics rather than simple anthropocentrism or scale chauvinism. Wheeler, the Joseph Henry Professor of Physics Emeritus at Princeton University, became 96. Over a long, productive scientific life, he was known for his drive to address big, overarching questions in physics, subjects which he liked to be merged with philosophical questions about the origin of matter, information and the universe. His interests ranged far and wide and were characterized by true fearlessness. Wheeler's work was not only in gravity and nuclear physics. In the 1950s Wheeler grew increasingly intrigued by the philosophical implications of quantum physics. According to Wheeler, there was no universe until the rise of consciousness to perceive it. In fact, Wheeler was one of the first prominent physicists seriously to propose that reality might not be a wholly physical phenomenon. In some sense, Wheeler suggested, reality grows out of the act of observation, and thus consciousness itself: it is “participatory.” He also stated that information is the most fundamental building block of reality, and that the universe should be seen as a selfsynthesized information system: a self-excited circuit that is developing through a (closed loop) cycle. His cosmic variant of the delayed choice experiment led to the idea that human observers may not only determine the present, but also may influence the past. According to Wheeler, ultimate mutability is the central feature of physics, and the meaning of reality can only be established if there is a universal knowledge field, that transcends physical past, present and future.\n,","authors":["Dirk K F Meijer"],"meta":["March 2015NeuroQuantology vol 13(issue 1):pp 57-78,","Project: The Information Universe. On the Missing Link in Concepts on the Architecture of Reality."],"references":["275017249_Quantum_Modeling_of_the_Mental_State_the_Concept_of_a_Cyclic_Mental_Workspace","275017089_Quantum_Physics_in_Consciousness_Studies_The_Quantum_Mind_Extended","275017053_Information_What_Do_You_Mean","275016988_The_Extended_Brain_Cyclic_Information_Flow_in_a_Quantum_Physical_Realm","275016983_Immortality_Myth_or_Becoming_Reality_On_the_Conservation_of_Information","301268487_The_Transactional_Interpretation","296151801_In_the_beginning_was_the_bit","292261211_Information_and_the_nature_of_reality_From_physics_to_metaphysics","287553629_Consciousness_and_Perception_in_Higher_Dimensional_Quantum_Space-time","281890392_The_holographic_principle_theory_of_mind_-_Revised"]}