{"id":"275031189_Development_of_New_Family_of_Normalized_Modulus_Reduction_and_Material_Damping_Curves","abstract":"As part of various research projects [including the SRS (Savannah River\nSite) Project AA891070, EPRI (Electric Power Research Institute)\nProject 3302, and ROSRINE (Resolution of Site Response Issues from the\nNorthridge Earthquake) Project], numerous geotechnical sites were\ndrilled and sampled. Intact soil samples over a depth range of several\nhundred meters were recovered from 20 of these sites. These soil samples\nwere tested in the laboratory at The University of Texas at Austin (UTA)\nto characterize the materials dynamically. The presence of a database\naccumulated from testing these intact specimens motivated a\nre-evaluation of empirical curves employed in the state of practice. The\nweaknesses of empirical curves reported in the literature were\nidentified and the necessity of developing an improved set of empirical\ncurves was recognized. This study focused on developing the empirical\nframework that can be used to generate normalized modulus reduction and\nmaterial damping curves. This framework is composed of simple equations,\nwhich incorporate the key parameters that control nonlinear soil\nbehavior. The data collected over the past decade at The University of\nTexas at Austin are statistically analyzed using First-order,\nSecond-moment Bayesian Method (FSBM). The effects of various parameters\n(such as confining pressure and soil plasticity) on dynamic soil\nproperties are evaluated and quantified within this framework. One of\nthe most important aspects of this study is estimating not only the mean\nvalues of the empirical curves but also estimating the uncertainty\nassociated with these values. This study provides the opportunity to\nhandle uncertainty in the empirical estimates of dynamic soil properties\nwithin the probabilistic seismic hazard analysis framework. A refinement\nin site-specific probabilistic seismic hazard assessment is expected to\nmaterialize in the near future by incorporating the results of this\nstudy into state of practice.","authors":["Mehmet Baris Darendeli"],"meta":["December 2001","Thesis for: Ph.D.Advisor: K. H. Stokoe II"],"references":[]}