{"id":"275039368_Measuring_Consistency_in_Translation_Memories_A_Mixed-Methods_Case_Study","abstract":"Introduced in the early 1990s, translation memory (TM) tools have since become widely used as an aid to human translation based on commonly-held assumptions that they save time, reduce cost, and maximise consistency. The purpose of this research is twofold: it aims to develop a method for measuring consistency in TMs; and it aims to use this method to interrogate selected TMs from the localisation industry in order to find out whether the use of TM tools does, in fact, promote consistency in translation. \n\nThe research uses an explanatory, sequential mixed-methods approach. Following a pilot study, the first phase of the research involved a quantitative study of two English-to-German and two English-to-Japanese TMs. Inconsistencies found in these TMs were categorised and counted. The research found inconsistencies of letter case, spacing, and punctuation in source texts, and inconsistent terminology, formatting, and punctuation in target texts despite the restrictive nature of TM tools. \n\nIn a follow-on qualitative phase, thirteen interviews were conducted with translators and others from the localisation industry with experience of TMs. Interviewees believed inconsistency to be a problem in translations completed using TM tools and confirmed that the findings from the quantitative phase corresponded with their experiences. Furthermore, they expressed their frustration with recent developments in TM tool functionality that, they say, do not address their needs and concerns. The thesis collates interviewees’ procedures for minimising inconsistency in TMs and suggests changes to the functionality of TM tools that may improve consistency and prove beneficial to translation professionals.","authors":["Joss Moorkens"],"meta":["July 2012","DOI:10.13140/RG.2.1.3166.1604","Thesis for: PhDAdvisor: Sharon O'Brien, Dorothy Kenny, Reinhard Schaler"],"references":["267387434_Improving_Third_Generation_Translation_Memory_Systems_Through_Identification_of_Rhetorical_Predicates","260319044_The_Process_of_Post-Editing_a_Pilot_Study","258237841_Making_WikiMedia_resources_more_useful_for_translators","272713542_Interactive_Translation_vs_Pre-Translation_in_TMs_A_Pilot_Study","272160171_Handling_Qualitative_Data_A_Practical_Guide","269113536_Qualitative_data_analysis_with_NVIVO","254966842_Innovation_Starvation","254290621_Metrics_for_Evaluating_Translation_Memory_Software","250183024_Notes_on_Pragmatism_and_Scientific_Realism","249052282_Translating_and_Revising_for_Localisation_What_do_We_Know_What_do_We_Need_to_Know"]}