{"id":"275048525_Color_Difference_Thresholds_in_Dentistry","abstract":"The aim of this prospective multicenter study was to determine 50:50% perceptibility threshold (PT) and 50:50% acceptability threshold (AT) of dental ceramic under simulated clinical settings.\nThe spectral radiance of 63 monochromatic ceramic specimens was determined using a non-contact spectroradiometer. A total of 60 specimen pairs, divided into 3 sets of 20 specimen pairs (medium to light shades, medium to dark shades, and dark shades), were selected for psychophysical experiment. The coordinating center and seven research sites obtained the Institutional Review Board (IRB) approvals prior the beginning of the experiment. Each research site had 25 observers, divided into five groups of five observers: dentists-D, dental students-S, dental auxiliaries-A, dental technicians-T, and lay persons-L. There were 35 observers per group (five observers per group at each site ×7 sites), for a total of 175 observers. Visual color comparisons were performed using a viewing booth. Takagi-Sugeno-Kang (TSK) fuzzy approximation was used for fitting the data points. The 50:50% PT and 50:50% AT were determined in CIELAB and CIEDE2000. The t-test was used to evaluate the statistical significance in thresholds differences.\nThe CIELAB 50:50% PT was ΔEab = 1.2, whereas 50:50% AT was ΔEab = 2.7. Corresponding CIEDE2000 (ΔE00 ) values were 0.8 and 1.8, respectively. 50:50% PT by the observer group revealed differences among groups D, A, T, and L as compared with 50:50% PT for all observers. The 50:50% AT for all observers was statistically different than 50:50% AT in groups T and L.\nA 50:50% perceptibility and ATs were significantly different. The same is true for differences between two color difference formulas ΔE00 /ΔEab . Observer groups and sites showed high level of statistical difference in all thresholds.\nVisual color difference thresholds can serve as a quality control tool to guide the selection of esthetic dental materials, evaluate clinical performance, and interpret visual and instrumental findings in clinical dentistry, dental research, and subsequent standardization. The importance of quality control in dentistry is reinforced by increased esthetic demands of patients and dental professionals.\n© 2015 Wiley Periodicals, Inc.","authors":["Rade Paravina","Razvan Ionut Ghinea","Luis Herrera","Alvaro Della Bona"],"meta":["April 2015Journal of Esthetic and Restorative Dentistry 27(S1)","DOI:10.1111/jerd.12149","SourcePubMed"],"references":["268792670_Threshold_Value_for_the_Perception_of_Color_Changes_of_Human_Gingiva","233787453_A_novel_evaluation_method_for_optical_integration_of_Class_IV_composite_restorations","311591371_Fuzzy_identification_of_systems_and_its_application_to_modelling_and_control","283997798_Algunas_reflexiones_y_recientes_recomendaciones_internacionales_sobre_evaluacion_de_diferencias_de_color","263671360_Color_Stability_Over_Time_of_Three_Resin-Based_Restorative_Materials_Stored_Dry_and_in_Artificial_Saliva","263671356_Color_Stability_of_Denture_Teeth_and_Acrylic_Base_Resin_Subjected_Daily_to_Various_Consumer_Cleansers","262826034_An_Experiment_in_Visual_Scaling_of_Small_Color_Differences","253395684_Color_Science_Concepts_and_Methods_Quantitative_Data_and_Formulae_2nd_Edition","246842782_Color_in_dentistry_Match_me_match_me_not","233932660_Fuzzy_Identification_of_Systems_and_Its_Applications_to_Modeling_and_Control"]}