{"id":"275014340_Attracting_Students_to_the_Computing_Disciplines_A_Case_Study_of_a_Robotics_Contest","abstract":"Guiding high school students towards a specific career choice is one of the challenges that parents, teachers, and career- counselors alike have to participate in with a lot of involvement. While career-fairs, open-houses, and other such activities from universities play an important role in attracting students to specific programs, it has been felt over the years that students tend to choose relatively easy majors and avoid computing and similar disciplines due to the involvement of programming and mathematics. This trend has affected Computer Science programs throughout the world in different proportions. In this paper we would like to share our experiences with an effort to make high school students more aware of the computing disciplines by involving them in doing something that belongs to the core of this discipline, i.e., developing correct logic and computational infrastructure, in a friendly and fun way. One well established fact is that if these young minds are motivated to go for higher education in computing, engineering or STEM (Science, Technology, Engineering & Mathematics)-based programs of study, they can find their own path and would know it better as to what would be a better line of career for them. The presented experiences are related to a set of “Computing Contests” that the Department of Computer Science & Engineering at Qatar University has been holding for the past five years. Initially, it was designed as a website design contest, but after a couple of years’ experience, the interest was observed to be declining. The contest theme was then changed to robotics using the LEGO Mindstorms’ NXT kits and giving simple challenges to the students in which the emphasis was on developing robust logic for computational implementation. Unlike the existing robotic contests in the region, including First LEGO League (FLL), National Robotics Olympiad (NRO), and Bot-Ball, the actual contest track was unknown to the participants until the contest day. This implied that the robots were to be programmed for certain general rules while the actual implementation sequence of the rules was not known. In fact, the emphasis was not given to the mechanical design but on generic sensory-perception based actuation mechanism that was to be programmed in order to solve the given challenge in minimum time.","authors":["Uvais Qidwai","Ryan Riley","Sayed A. H. El-Sayed"],"meta":["November 2013Procedia - Social and Behavioral Sciences 102:520-531","DOI:10.1016/j.sbspro.2013.10.768"],"references":[]}