{"id":"275068417_Mobility_Aware_Energy_Efficient_Congestion_Control_in_Mobile_Wireless_Sensor_Network","abstract":"In this paper, we introduce a mobility aware and energy efficient congestion control protocol “time sharing energy efficient congestion control (TSEEC) for mobile wireless sensor network.” TSEEC is based on hybrid scheme of time division multiple access protocol (TDMA) and statistical time division multiple access (STDMA) protocol that inform the sensor nodes when to wake up and to go to listening state so as to save energy. This management helps in minimizing congestion and improving network energy conservation through its load based allocation (LBA) and time allocation leister (TAL) techniques. LBA is typically based on STDMA that uses sensor node information for assignment of dynamic timeslots to the sensor, nodes, whereas TAL targets the mobility management of sensor nodes that further comprises three main strategies of cluster member node that is, joining cluster, leaving cluster, and absence of data/redundant data with extricated time allocation (ETA), shift back time allocation (SBTA), and eScaped Time Allocation (STA) subtechniques. In addition, TSEEC protocol introduces the mobility pattern to control the mobile sensor node (MSN) movement to enable the protocol to effectively adapt itself to change the traffic environments and mobility. Mathematical analysis and NS2 simulation show that TSEEC outperforms SMAC in terms of energy consumption and packet deliver ratio. Furthermore, a comparative analysis of TSEEC with various well-known related MAC protocols is also given.","authors":["Awais Ahmad","Sohail Jabbar","Anand Paul","Seungmin Rho"],"meta":["March 2014International Journal of Distributed Sensor Networks 2014(3):1-13","DOI:10.1155/2014/530416"],"references":["234814943_Integrated_Coverage_and_Connectivity_Configuration_in_Wireless_Sensor_Networks","261464730_Wireless_Sensor_Network_Redeployment_under_the_Target_Coverage_Constraint","261356420_Energy_efficient_routing_protocol_for_zone_based_mobile_sensor_networks","260581209_LCM_A_Link-Aware_Clustering_Mechanism_for_Energy-Efficient_Routing_in_Wireless_Sensor_Networks","260513839_Fuzzy-Logic-Based_Clustering_Approach_for_Wireless_Sensor_Networks_Using_Energy_Predication","247597123_Span_An_Energy-Efficient_Coordination_Algorithm_for_Topology_Maintenance_in_Ad_Hoc_Wireless_Networks","229984450_Multiple_Bit_Stream_Image_Transmission_over_Wireless_Sensor_Networks","226573289_Compression_Techniques_for_Wireless_Sensor_Networks","224715072_Efficient_Intra_Prediction_in_H264_Based_on_Intensity_Gradient_Approach","224668386_The_tree-search_resource_auction_multiple_access_TRAMA_protocol_for_wireless_personal_communications"]}