{"id":"275054848_A_Survey_on_Applications_of_Model-Free_Strategy_Learning_in_Cognitive_Wireless_Networks","abstract":"Model-free learning has been considered as an efficient tool for designing\ncontrol mechanisms when the model of the system environment or the interaction\nbetween the decision-making entities is not available as a-priori knowledge.\nWith model-free learning, the decision-making entities adapt their behaviors\nbased on the reinforcement through their interaction with the environment, and\nare able to (implicitly) build the understanding of the system through\ntry-and-error mechanisms. Such a characteristics of model-free learning is\nhighly in accordance with the requirement of cognition and intelligence for\nwireless devices in cognitive wireless networks. Recently, model-free learning\nhas been considered as one key implementation approach to adaptive,\nself-organized network control in cognitive wireless networks. In this paper,\nwe provide a comprehensive survey on the applications of the state-of-art\nmodel-free learning mechanisms in wireless networks. A systematic overview of\nthe learning algorithms in the domains of both multi-agent systems and\nmulti-player games is provided. Furthermore, the applications of model-free\nlearning to various problems in wireless networks are discussed with the focus\non how the learning mechanisms helps to provide the solutions to these problems\nand improve the network performance over the existing model-based, non-adaptive\nmethods. Finally, a broad spectrum of challenges and open issues are discussed\nto offer a guideline for the future research directions.","authors":["Wenbo Wang","Andres Kwasinski","Dusit Niyato","Zhu Han"],"meta":["April 2015IEEE Communications Surveys & Tutorials 18(3)","DOI:10.1109/COMST.2016.2539923","SourcearXiv"],"references":["314089936_Studies_in_Computational_Intelligence","313135362_Q-learning","312966021_Packet_routing_in_dynamically_changing_networks_A_reinforcement_learning_approach","308844587_Adaptive_learning_for_scalable_video_transmission_with_HARQ_over_dynamic_wireless_channels","306202620_Cognitive_radio_An_integrated_agent_architecture_for_software_defined_radio_Doctor_of_Technology","304355198_Average_Reward_Reinforcement_Learning_Foundations_Algorithms_and_Empirical_Results","291801716_Sophisticated_Experience-Weighted_Attraction_Learning_and_Strategic_Teaching_in_Repeated_Games","286870700_Hybrid_Learning_in_Stochastic_Games_and_Its_Application_in_Network_Security","285006700_Self-Organization_Approaches_for_Optimization_in_Cognitive_Radio_Networks","284776723_Cognitive_radio_Brain-empowered_wireless_communications_selected_areas_in_communications"]}