{"id":"275114995_Is_There_a_Core_General_Vocabulary_Introducing_the_New_General_Service_List","abstract":"The current study presents a New General Service List (new-GSL), which is a result of robust comparison of four language corpora (LOB, BNC, BE06, and EnTenTen12) of the total size of over 12 billion running words. The four corpora were selected to represent a variety of corpus sizes\nand approaches to representativeness and sampling. In particular, the study investigates the lexical overlap among the corpora\nin the top 3,000 words based on the average reduced frequency (ARF), which is a measure that takes into consideration both frequency and dispersion of lexical items. The results show that there\nexists a stable vocabulary core of 2,122 items (70.7%) among the four corpora. Moreover, these vocabulary items occur with\ncomparable ranks in the individual wordlists. In producing the new-GSL, the core vocabulary items were combined with new items frequently occurring in the corpora representing current language\nuse (BE06 and EnTenTen12). The final product of the study, the new-GSL, consists of 2,494 lemmas and covers between 80.1 and 81.7 per cent of the text in the source corpora.","authors":["Vaclav Brezina","Dana Gablasova"],"meta":["January 2013Applied Linguistics 36(1):1-22","DOI:10.1093/applin/amt018"],"references":["335802775_Corpus-Based_Frequency_Profiling_Migration_To_A_Word_List_Based_On_The_British_National_Corpus","323281503_Learning_Vocabulary_in_Another_Language","303248780_Vocabulary_size_text_coverage_and_word_lists","290804481_Trust_the_Text_Language_Corpus_and_Discourse","284626889_Six_principles_for_teaching_foreign_language_vocabulary_A_commentary_on_Laufer_Meara_and_Nation's_Ten_Best_Ideas","284566325_Materials_for_teaching_vocabulary","283948027_1_A_study_of_the_most_frequent_word_families_in_the_British_National_Corpus","282565942_Is_there_an_academic_vocabulary","281770916_Vocabulary_Applied_Linguistic_Perspectives","279575308_What_Vocabulary_Size_Is_Needed_to_Read_Unsimplified_Texts_for_Pleasure"]}