{"id":"275152525_Multilevel_Modeling_Toward_a_New_Paradigm_of_Conceptual_Modeling_and_Information_Systems_Design","abstract":"Domain-specific modeling languages (DSMLs) promise clear advantages over general-purpose modeling languages. However, their design poses a fundamental challenge. While economies of scale advocate the development of DSMLs that can be used in a wide range of cases, modeling productivity demands more specific language concepts tuned to individual requirements. Inspired by the actual use of technical languages (German: “Fachsprachen”), this paper presents a novel multilevel modeling approach to conceptual modeling and to the design of information systems. Unlike traditional language architectures such as Meta Object Facility (MOF), it features a recursive architecture that allows for an arbitrary number of classification levels and, hence, for the design of hierarchies of DSMLs ranging from reference DSMLs to “local” DSMLs. It can not only diminish the conflict inherent in designing DSMLs, but enables the reuse and integration of software artifacts in general. It also helps reduce modeling complexity by relaxing the rigid dichotomy between specialization and instantiation. Furthermore, it integrates a meta-modeling language with a metamodel of a reflective meta-programming language, thereby allowing for executable models. The specification of the language architecture is supplemented by the description of use scenarios that illustrate the potential of multilevel modeling and a critical discussion of its peculiarities.","authors":["Ulrich Frank"],"meta":["December 2014Business & Information Systems Engineering 6(6):319-337","DOI:10.1007/s12599-014-0350-4"],"references":["309423129_On_the_Conceptualisation_of_Modelling_Methods_Using_the_ADOxx_Meta_Modelling_Platform","281023519_Modelling_of_the_people_by_the_people_for_the_people","278703993_Modelling_of_the_People_by_the_People_for_the_People","277819386_Superlanguages_developing_languages_and_applications_with_XMF","254781965_Metamodeling_and_method_engineering_with_ConceptBase","254460746_Specialisation_in_business_process_modelling_Motivation_approaches_and_limitations","254460741_Beyond_ERP_systems_An_outline_of_self-referential_enterprise_systems_Requirements_conceptual_foundation_and_design_options","316807337_Grundsatze_ordnungsmassiger_Referenzmodellierung","267642566_Grundsatze_ordnungsmassiger_Referenzmodellierung_Konstruktion_konfigurations-und_anpassungsorientierter_Modelle_Gabler_Wiesbaden","257491512_An_ontology-based_framework_for_domain-specific_modeling"]}