{"id":"275101262_ScaffMatch_Scaffolding_Algorithm_Based_on_Maximum_Weight_Matching","abstract":"Next-generation high-throughput sequencing (HTS) has become a state-of-the-art technique in genome assembly. Scaffolding is one of the main stages of the assembly pipeline. During this stage contigs assembled from the paired-end reads are merged into bigger chains called scaffolds. Due to a high-level of statistical noise, chimeric reads, genome repeats the problem of scaffolding is a challenging task. Current scaffolding software packages widely vary in their quality and are highly dependent on the read data quality and genome complexity. There are no clear winners and multiple opportunities for further improvements of the tools still exist.\nThis paper presents an efficient scaffolding algorithm ScaffMatch that is able to handle reads with both short (<600 bp) and long (>35000 bp) insert sizes producing high-quality scaffolds. We evaluate our scaffolding tool with the F-score and other metrics (N50, corrected N50) on 8 data sets comparing it with the most available packages. Our experiments show that ScaffMatch is the tool of preference for the most data sets.\nThe source code is available at http://alan.cs.gsu.edu/NGS/?q=content/scaffmatch.\nmandric@cs.gsu.edu.\n© The Author (2015). Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.","authors":["Igor Mandric","A. Zelikovsky"],"meta":["April 2015Bioinformatics 31(16)","DOI:10.1093/bioinformatics/btv211","SourcePubMed"],"references":["304036022_SOAPdenovo2_an_empirically_improved_memory-efficient_short-read_de_novo_assembler","266152219_ILP-based_maximum_likelihood_genome_scaffolding","264796098_BESST_-_Efficient_scaffolding_of_large_fragmented_assemblies","260443607_A_comprehensive_evaluation_of_assembly_scaffolding_tools","236183749_SOAPdenovo2_an_empirically_improved_memory-efficient_short-read","234010873_SCARPA_Scaffolding_reads_with_practical_algorithms","230742298_Improved_gap_size_estimation_for_scaffolding_algorithms","283559921_Paths_trees_flowers","226272308_Path_Trees_and_Flowers","226066870_Dual_Integrality_in_B-Matching_Problems"]}