{"id":"275115044_Trustworthy_Stigmergic_Service_Composition_and_Adaptation_in_Decentralized_Environments","abstract":"The widespread use of web services in forming complex online applications requires service composition to cope with highly dynamic and heterogeneous environments. Traditional centralized service composition techniques are not sufficient to address the needs of applications in decentralized environments. In this paper, a stigmergic-based approach is proposed to model the decentralized service interactions and handle service composition in highly dynamic open environments. In the proposed approach, web services and resources are modeled as multiple agents. Stigmergic-based self-organization mechanisms among agents are deployed to facilitate adapting service composition. In addition, to overcome the limitations of traditional QoS-based approaches, trust measurements are deployed as a criterion for service selection. To improve the performance of the proposed stigmergic-based approach under dynamic scale-free environments, we investigate the hybridization with local search operators to consolidate adaptation, and diversity schemes are introduced to facilitate continual service adaptation. Extensive experiments show the efficiency of the proposed approach in dealing with incomplete information and dynamic factors in composing and adapting web services in open environments. The experiment results also show that the proposed approach achieves a better performance than other traditional approaches.","authors":["Ahmed Mostafa","Minjie Zhang","Quan Bai"],"meta":["January 2014IEEE Transactions on Services Computing 9(2):1-1","DOI:10.1109/TSC.2014.2298873"],"references":["313742183_Stigmergy_and_collaboration_Tracing_the_contingencies_of_mediated_interaction","261239507_IRIS_A_Novel_Method_of_Direct_Trust_Computation_for_Generating_Trusted_Social_Networks","232624661_A_Service_Search_Method_Based_on_Referral_Network_PDF","281361904_Research_Frontier_Memetic_Computation_-_Past_Present_Future","261506399_Shapley_Value_Based_Impression_Propagation_for_Reputation_Management_in_Web_Service_Composition","260722900_Cost_and_Accuracy_Aware_Scientific_Workflow_Composition_for_Service-Oriented_Environments","257366835_A_Chemistry-Inspired_Workflow_Management_System_for_Decentralizing_Workflow_Execution","251821023_The_elusive_QoS_what_is_missing","236129562_Reputation_Systems_for_Open_Collaboration","232620383_Stigmergic_Collaboration_A_Sign-Based_Perspective_of_Stigmergy"]}