{"id":"275249519_Attacking_the_Internet_Using_Broadcast_Digital_Television","abstract":"In the attempt to bring modern broadband Internet features to traditional broadcast television, the Digital Video Broadcasting (DVB) consortium introduced a specification called Hybrid Broadcast-Broadband Television (HbbTV), which allows broadcast streams to include embedded HTML content that is rendered by the television. This system is already in very wide deployment in Europe and has recently been adopted as part of the American digital television standard. Our analyses of the specifications, and of real systems implementing them, show that the broadband and broadcast systems are combined insecurely. This enables a large-scale exploitation technique with a localized geographical footprint based on Radio Frequency (RF) injection, which requires a minimal budget and infrastructure and is remarkably difficult to detect. In this article, we present the attack methodology and a number of follow-on exploitation techniques that provide significant flexibility to attackers. Furthermore, we demonstrate that the technical complexity and required budget are low, making this attack practical and realistic, especially in areas with high population density: In a dense urban area, an attacker with a budget of about $450 can target more than 20,000 devices in a single attack. A unique aspect of this attack is that, in contrast to most Internet of Things/Cyber-Physical System threat scenarios, where the attack comes from the data network side and affects the physical world, our attack uses the physical broadcast network to attack the data network.","authors":["Yossi Oren","Angelos D. Keromytis"],"meta":["April 2015ACM Transactions on Information and System Security 17(4):1-27","DOI:10.1145/2723159"],"references":["269291214_A_privacy_protection_system_for_HbbTV_in_Smart_TVs","262219933_Tracking_DDoS_attacks_insights_into_the_business_of_disrupting_the_web","259753269_Comprehensive_Experimental_Analyses_of_Automotive_Attack_Surfaces","228851902_Puppetnets_Misusing_Web_Browsers_as_a_Distributed_Attack_Infrastructure","262393346_Trafficking_fraudulent_accounts_the_role_of_the_underground_market_in_Twitter_spam_and_abuse","262322006_GPS_software_attacks","262168538_Eradicating_DNS_rebinding_with_the_extended_same-origin_policy","260362885_SkyNET_A_3G-Enabled_Mobile_Attack_Drone_and_Stealth_Botmaster","225146892_Protecting_the_Intranet_Against_JavaScript_Malware_and_Related_Attacks","224227670_A_Comprehensive_Survey_of_Voice_over_IP_Security_Research","221260430_Crying_Wolf_An_Empirical_Study_of_SSL_Warning_Effectiveness","220269460_Robust_defenses_for_cross-site_request_forgery"]}