{"id":"275221971_Development_of_Loop_Antennas_for_Partial_Discharge_Detection","abstract":"This paper discusses the development of loop antenna to detect partial discharge (PD). The loop antenna is designed to measure PD induced EM wave in the frequency up to 100 MHz. The form, the circumference, the number of rounds of loop antenna affect the frequency response of the antenna. In the design, the circumference of a loop antenna is set to be a tenth of a wavelength of PD induced EM wave. The conductor wire length of loop antenna is set to be 30 cm to achieve 100 MHz bandwidth. Various forms of the loop antenna: circle, square, and triangle have been designed and implemented. The designed loop antennas were applied to measure PD in high voltage laboratory. The needle-plate electrodes in air is used as a PD source. The test results showed that the new designed loop antennas were able to detect and measure PD. PD induced EM wave waveform and pattern were measured. The effect of distance between PD source and the antennas was observed. The sensitivity of the circle loop antenna is the best among the new designed loop antennas. © 2015, School of Electrical Engineering and Informatics .All right reserved.","authors":["Fakhru Rozi","Umar Khayam"],"meta":["March 2015International Journal on Electrical Engineering and Informatics 7(1):29-41","DOI:10.15676/ijeei.2015.7.1.3"],"references":["261229710_Characteristics_of_External_Loop_Sensor_Located_Near_Bushing_on_Partial_Discharge_Induced_Electromagnetic_Wave_Measurement","224380458_Two_Types_of_Compact_UHF_Antennas_for_Partial_Discharge_Measurement","224321634_A_study_on_the_measurement_of_partial_discharges_in_XLPE_power_cables_using_planer_loop_sensors","4377837_Electrical_Insulation_for_Rotating_Machines_Design_Evaluation_Aging_Testing_and_Repair","3712983_Two_opposite_coplanar_open_rectangular_loop_antennas","3467149_Low-Frequency_Radio_Transmission","3009785_An_exact_integration_procedure_for_vector_potentials_of_thin_circular_loop_antennas"]}