{"id":"275256125_Real-time_monocular_image-based_6-DoF_localization","abstract":"In this paper we present a new real-time image-based localization method for scenes that have been reconstructed offline using structure from motion. From input video, our method continuously computes six-degree-of-freedom camera pose estimates by efficiently tracking natural features and matching them to 3D points reconstructed by structure from motion. Our main contribution lies in efficiently interleaving a fast keypoint tracker that uses inexpensive binary feature descriptors with a new approach for direct 2D-to-3D matching. Our 2D-to-3D matching scheme avoids the need for online extraction of scale-invariant features. Instead, offline we construct an indexed database containing multiple DAISY descriptors per 3D point extracted at multiple scales. The key to the efficiency of our method is invoking DAISY descriptor extraction and matching sparingly during localization, and in distributing this computation over a temporal window of successive frames. This enables the system to run in real-time and achieve low per-frame latency over long durations. Our algorithm runs at over 30 Hz on a laptop and at 12 Hz on a low-power computer suitable for onboard computation on a mobile robot such as a micro-aerial vehicle. We have evaluated our method using ground truth and present results on several challenging indoor and outdoor sequences.","authors":["Hyon Lim","Sudipta N. Sinha","Michael F. Cohen","Matt Uyttendaele"],"meta":["April 2015The International Journal of Robotics Research 34(4-5):476-492","DOI:10.1177/0278364914561101","Project: Image-based Localization"],"references":["262332080_Worldwide_Pose_Estimation_Using_3D_Point_Clouds","258224672_Visual_Landmark-Based_Localization_for_MAVs_Using_Incremental_Feature_Updates","319770286_Visual_Odometry_and_Mapping_for_Autonomous_Flight_Using_an_RGB-D_Camera","316240097_Distinctive_Image_Features_from_Scale-Invariant_Keypoints","312471414_Detection_and_Tracking_of_Point_Features","266278689_Improving_Image-Based_Localization_by_Active_Correspondence_Search","262328993_Improving_Image-Based_Localization_by_Active_Correspondence_Search","261236203_SLAM_Simultaneous_Localisation_and_Mapping_at_the_Level_of_Objects","260698272_Build_Your_Own_Quadrotor_Open-Source_Projects_on_Unmanned_Aerial_Vehicles","258140602_Vision-based_place_recognition_How_low_can_you_go"]}