{"id":"275276454_Predicting_Success_in_a_Master_of_Information_Science_Degree_Programme","abstract":"This study provides an insight into factors that can help predict the success of students admitted to a Master of information science (MInfSc) programme and aid admission committees in selecting candidates that are most likely to succeed in a graduate programme of information science, using the MInfSc programme at the Africa Regional Centre for Information Science, University of Ibadan (Nigeria) as case study. Success was measured by MInfSc degree attainment, class of degree obtained and time taken to complete the programme. Data was extracted from the records of 338 students admitted to the MInfSc between 1990 and 2002, and graduating between 1992 and 2004. Data analysis showed that the undergraduate grade point average was the most significant predictor of student's success in the MInfSc programme. Undergraduate major, type of undergraduate institution and possession of a postgraduate qualification did not significantly influence students' success. Students who enrolled for the programme less than five years after obtaining an undergraduate degree were significantly more likely to complete the programme. Additionally, foreign students with scholarships completed the programme significantly faster than other categories of students. There is need for increased scholarship opportunities for foreign students and part-time programmes for students with full-time jobs. (Contains 11 tables and 3 figures.)","authors":["Rosemary O. Agbonlahor","Uzoamaka J. Offor"],"meta":["December 2008Education for Information 25(3-4):169-190","DOI:10.3233/EFI-2008-263-402"],"references":["293787486_Persistent_issues_in_library_and_information_science_education_in_Africa","285907077_Factors_determining_success_in_a_graduate_business_program","247728543_Selecting_Tomorrow's_Forensic_Psychologists_a_Fresh_Look_at_Some_Familiar_Predictors","247727659_Predicting_Graduate_Academic_Success_from_Undergraduate_Academic_Performance_A_Canonical_Correlation_Study","247726003_Prediction_of_Success_in_an_Applied_MA_Psychology_Program","247224101_Predicting_Graduate_Student_Success_in_an_MBA_Program_Regression_Versus_Classification","220435170_Information_Science_in_2010_A_Loughborough_University_View"]}