{"id":"275222707_Design_and_Development_of_a_High-Speed_and_High-Rotation_Robot_With_Four_Identical_Arms_and_a_Single_Platform","abstract":"In this paper, a novel parallel kinematic mechanism (PKM) with Sch€ onflies motion has been proposed under the guidance of a graphical type synthesis method. This PKM is composed of four identical arms and a single platform and has high rotational capability. The single-platform structure used in the proposed PKM can reduce structural complexity , increase dynamic response. In addition, the composite parallelogram structure in each arm brings in better limb stiffness. Based on the proposed concept, optimal design is carried out to make the PKM realize its high rotational potential. In this process, an input transmission index (ITI) and an output transmission index (OTI) (the two indices can be used to numerically evaluate motion and force transmission performance of PKMs, respectively) are taken as the performance evaluation criteria. On this basis, some other indices are defined and the corresponding performance atlases are also plotted to investigate the potential workspace. Consequently, dimensional parameters of the discussed PKM are derived on the precondition that the rotational capability should reach at least 690 deg, and the workspace has also been identified. Based on these foundations , a parallel robot X4 has been developed which can realize high-speed pick-and-place manipulation in industrial lines.","authors":["Fugui Xie","Xin-Jun Liu"],"meta":["November 2015Journal of Mechanisms and Robotics 7(4):041015","DOI:10.1115/1.4029440"],"references":["274875021_A_New_Approach_for_Singularity_Analysis_and_Closeness_Measurement_to_Singularities_of_Parallel_Manipulators","265402460_Singularity_Conditions_of_3T1R_Parallel_Manipulators_with_Identical_Limb_Structures","261757795_Screw_Theory_Based_Methodology_for_the_Deterministic_Type_Synthesis_of_Flexure_Mechanisms","280789838_High-Speed_Parallel_Robot_with_Four_Degrees_of_Freedom","275089991_Singularity_Conditions_of_3T1R_Parallel_Manipulators_With_Identical_Limb_Structures","268455595_A_Parallel_Robot_with_Scara_Motions_and_its_Kinematic_Issues","267489028_Design_of_Lambda-Quadriglide_A_New_4-DOF_Parallel_Kinematics_Mechanism_for_Schonflies_Motion","260662505_Type_Synthesis_Kinematic_Analysis_and_Optimal_Design_of_a_Novel_Class_of_Schonflies-Motion_Parallel_Manipulators","259131430_Type_synthesis_of_2T1R-type_parallel_kinematic_mechanisms_and_the_application_in_manufacturing","259095948_Optimal_Design_of_a_4-DOF_SCARA_Type_Parallel_Robot_Using_Dynamic_Performance_Indices_and_Angular_Constraints"]}