{"id":"275377612_Bistable_Compliant_Mechanisms_Corrected_Finite_Element_Modeling_for_Stiffness_Tuning_and_Preloading_Incorporation","abstract":"Bistable straight-guided buckling beams are essential mechanisms for precision engineering, compliant mechanisms, and MEMS. However, a straightforward and accurate numerical modeling have not been available. When preloading effects must be included, numerical modeling becomes an even more challenging problem. This article presents a straightforward numerical model for bistable straight-guided buckling beams, which includes preloading effects as well. Adjusting the bistable force-displacement characteristic by variation of design parameters and preloading is also investigated. Both lumped compliance and distributed compliance are considered in this work. In order to validate the model, measurements have been performed. It was shown that a small precurvature of bistable straight-guided buckling beams is crucial to avoid convergence into higher order buckling modes in nonlinear analysis of ANSYS TM and to obtain reliable results. Transient analysis using ANSYS TM with subsequent preloading and motion displacements can incorporate preloading effects. Moreover, the model correction allows accurate description of the increased symmetry and energy efficiency of the bistable behavior in case of increasing (in order of effectiveness) the initial angle and preloading for the case of distributed compliance. This behavior was observed by increasing the initial angle, thickness, and length of the rigid segment for the case of lumped compliance.","authors":["Alje G. Dunning","N. Tolou","P. P. Pluimers","L. F. Kluit"],"meta":["August 2012Journal of Mechanical Design 134(8):084502","DOI:10.1115/1.4006961"],"references":["279296501_A_statically_balanced_and_bi-stable_compliant_end_effector_combined_with_a_laparoscopic_2DoF_robotic_arm","275377266_Modeling_and_Experiments_of_Buckling_Modes_and_Deflection_of_Fixed-Guided_Beams_in_Compliant_Mechanisms","269617418_Analytical_Method_for_Determination_of_Young's_Modulus_of_Large_Deflection_Carbon_Nanotube","267651366_Collinear-Type_Statically_Balanced_Compliant_Micro_Mechanism_SB-CMM_Experimental_Comparison_Between_Pre-Curved_and_Straight_Beams","267488796_Statically_Balanced_Compliant_Micro_Mechanisms_SB-MEMS_Concepts_and_Simulation","289895231_Design_optimization_of_a_fully-compliant_bistable_micro-mechanism","267489527_Curve_Decomposition_Analysis_for_Fixed-Guided_Beams_With_Application_to_Statically_Balanced_Compliant_Mechanisms","267489180_Design_of_Small-Scale_Statically_Balanced_Compliant_Joints","245367001_Design_and_Testing_of_a_Thin-Flexure_Bistable_Mechanism_Suitable_for_Stamping_From_Metal_Sheets","245366789_A_Compliant_Bistable_Mechanism_Design_Incorporating_Elastica_Buckling_Beam_Theory_and_Pseudo-Rigid-Body_Model"]}