{"id":"275365611_Research_Fronts_in_data_envelopment_analysis","abstract":"Research activities relating to data envelopment analysis (DEA) have grown at a fast rate recently. Exactly what activities have been carrying the research momentum forward is a question of particular interest to the research community. The purpose of this study is to find these research activities, or research fronts, in DEA. A research front refers to a coherent topic or issue addressed by a group of research articles in recent years. The large amount of DEA literature makes it difficult to use any traditional qualitative methodology to sort out the matter. Thus, this study applies a network clustering method to group the literature through a citation network established from the DEA literature over the period 2000 to 2014. The keywords of the articles in each discovered group help pinpoint its research focus. The four research fronts identified are “bootstrapping and two-stage analysis”, “undesirable factors”, “cross-efficiency and ranking”, and “network DEA, dynamic DEA, and SBM”. Each research front is then examined with key-route main path analysis to uncover the elements in its core. In addition to presenting the research fronts, this study also updates the main paths and author statistics of DEA development since its inception and compares them with those reported in a previous study.","authors":["John S. Liu","Louis Y. Y. Lu","Wen-Min Lu"],"meta":["April 2015Omega 58","DOI:10.1016/j.omega.2015.04.004"],"references":["301345304_Pajek-program_for_large_Network_analysis","321596861_Data_Envelopment_Analysis_A_Handbook_of_Models_and_Methods","292354554_DEA_cross_efficiency","285096511_Analyzing_Performance_in_Service_Organization","284674193_Measuring_the_effciency_of_decision_making_units","284415003_Slacks_and_congestion_A_response","279898276_Infeasibility_Of_Super-Efficiency_Data_Envelopment_Analysis_Models","279377670_Intertemporal_Production_Frontiers_With_Dynamic_DEA","279377413_Intertemporal_Production_Frontiers_With_Dynamic_DEA","279360159_Intertemporal_Production_Frontiers_With_Dynamic_DEA"]}