{"id":"275383649_Mobility_Change_in_Two_Types_of_Metamorphic_Parallel_Mechanisms","abstract":"This paper presents a new joint coined as the rT joint and proposes two types of metamorphic parallel mechanisms assembled with this rT joint. In the first type, the mechanism changes its topology by turning the rT joints in all limbs into different configurations. This change in mobility is completed by two cases illustrated by a 3(rT)PS metamorphic parallel mechanism having variable mobility from 3 to 6 and a 3(rT)P(rT) parallel mechanism having various configurations including pure translations, pure rotations, and mobility 4. In the second type, a central strut with the rT joint is added in a parallel mechanism. The variable mobility of the mechanism results from the topological change of the central (rT)P(rT) strut. This is illustrated in a 3SPS-1(rT)P(rT) metamorphic parallel mechanism, which changes its mobility from 4 to 5. It is demonstrated in mobility analysis that the change in local mobility of each limb results in the change in the platform mobility that a metamorphic process can be achieved. This particular analysis leads to advancement of improved Gruumlbler-Kutzbach criterion by introducing the local mobility factor in the mobility analysis. [DOI: 10.1115/1.3211023]","authors":["Dongming Gan","Jian S Dai","Qizheng Liao"],"meta":["November 2009Journal of Mechanisms and Robotics 1(4):041007","DOI:10.1115/1.3211023"],"references":["278687614_A_Three-dof_Tripod_for_Generating_Spherical_Rotation","258846558_Jacobian_Manipulability_Condition_Number_and_Accuracy_of_Parallel_Robots","349618527_Dynamic_Modeling_of_Parallel_Manipulators","313009417_Mobility_in_metamorphic_mechanisms_of_foldableerectable_kinds","274437511_Reconfiguration_of_Spatial_Metamorphic_Mechanisms","266695986_A_translational_3-DOF_parallel_manipulator","246300615_Generalized_Stewart_Platforms_and_their_Direct_Kinematics1","245934009_A_Direct_Determination_of_the_Instantaneous_Kinematics_of_Fully_Parallel_Robot_Manipulators","245513493_Kinematic_Representations_of_Pop-Up_Paper_Mechanisms","245513483_Parametric_Design_of_a_Spherical_Eight-Bar_Linkage_Based_on_a_Spherical_Parallel_Manipulator"]}