{"id":"275306380_A_Comparison_of_Three_Occam's_Razors_for_Markovian_Causal_Models","abstract":"The framework of causal Bayes nets, currently influential in several scientific disciplines, provides a rich formalism to study the connection between causality and probability from an epistemological perspective. This article compares three assumptions in the literature that seem to constrain the connection between causality and probability in the style of Occam's razor. The trio includes two minimality assumptions—one formulated by Spirtes, Glymour, and Scheines (SGS) and the other due to Pearl—and the more well-known faithfulness or stability assumption. In terms of logical strength, it is fairly obvious that the three form a sequence of increasingly stronger assumptions. The focus of this article, however, is to investigate the nature of their relative strength. The comparative analysis reveals an important sense in which Pearl's minimality assumption is as strong as the faithfulness assumption and identifies a useful condition under which it is as safe as SGS's relatively secure minimality assumption. Both findings have notable implications for the theory and practice of causal inference.\n\n• 1 Introduction\n• 2 Background: Inference of Causal Structure in Markovian Causal Models\n• 3 Three Assumptions of Simplicity\n• 4 A Comparison of P-minimality and Faithfulness\n• 5 A Comparison of P-minimality and SGS-minimality\n• 6 Methodological Formulations and Prior Knowledge of Causal Order\n• 7 Conclusion","authors":["Jiji Zhang"],"meta":["May 2012The British Journal for the Philosophy of Science 64(2):423-448","DOI:10.1093/bjps/axs005"],"references":["249079855_Two_Notes_on_the_Probabilistic_Approach_to_Causality","240264589_Stochastic_independence_causal_independence_and_shieldability","228092005_Adjacency-Faithfulness_and_Conservative_Causal_Inference","30771133_Detection_of_Unfaithfulness_and_Robust_Causal_Inference","30527010_What_is_Wrong_with_Bayes_Nets","2459723_Ancestral_Graph_Markov_Models","232933846_Causal_Independence_and_Faithfulness","226724015_Homogeneity_selection_and_the_faithfulness_condition","220607232_Intervention_determinism_and_the_causal_minimality_condition","31239289_Redundant_Causation","30770452_On_the_completeness_of_orientation_rules_for_causal_discovery_in_the_presence_of_latent_confounders_and_selection_bias"]}