{"id":"275484315_A_Review_of_Data_Mining_Using_Big_Data_in_Health_Informatics","abstract":"The amount of data produced within Health Informatics has grown to be quite vast, and analysis of this Big Data grants potentially limitless possibilities for knowledge to be gained. In addition, this information can improve the quality of healthcare offered to patients. However, there are a number of issues that arise when dealing with these vast quantities of data, especially how to analyze this data in a reliable manner. The basic goal of Health Informatics is to take in real world medical data from all levels of human existence to help advance our understanding of medicine and medical practice. This paper will present recent research using Big Data tools and approaches for the analysis of Health Informatics data gathered at multiple levels, including the molecular, tissue, patient, and population levels. In addition to gathering data at multiple levels, multiple levels of questions are addressed: human-scale biology, clinical-scale, and epidemic-scale. We will also analyze and examine possible future work for each of these areas, as well as how combining data from each level may provide the most promising approach to gain the most knowledge in Health Informatics.","authors":["Matthew Herland","Taghi Khoshgoftaar","Randall Wald"],"meta":["December 2014Journal of Big Data 1(1):2","DOI:10.1186/2196-1115-1-2"],"references":["309185766_Support_vector_regression_machines","281534996_MEGA4_a_molecular_evolutionary_genetic_analysis_MEGA_software_version_40","279243266_APACHE_II","312897926_The_multiple_logistic_regression_model","308953945_New_models_in_probabilistic_information_retrieval","297235987_Big_datasocial_media_combo_poised_to_advance_healthcare","292636412_XAR_An_Integrated_Framework_for_Semantic_Extraction_and_Annotation","285970633_Advances_in_Neural_Information_Processing_Systems","272234847_A_new_Simplified_Acute_Physiology_Score_SAPS_II_based_on_a_EuropeanNorth_American_multicenter_study","271196714_New_Look_at_Statistical-Model_Identification"]}