{"id":"275449694_Peer_review_in_higher_education_Student_perceptions_before_and_after_participation","abstract":"Peer review is integral to academic endeavour, but opportunities for students to benefit from peer review in higher education remain limited, and relatively little is known about how student perceptions influence their appreciation of peer review. University student perceptions were examined before and after experiencing student peer review in four university subjects differing in discipline, year level and class size. Prior to engaging in peer review, students had remarkably high expectations of both the process and the competence of their peers as reviewers. Students reported high satisfaction levels with the peer-review process and its positive impact on their learning, and particularly showed an enhanced appreciation of the influence of review writing on learning. However, a modest overall downward shift in positive perceptions was observed following peer review, suggesting that student opinions of peer review became somewhat more polarized as a consequence of their experiences. Drawing on survey response data and student comments, several recommendations are made that may help to improve student perceptions of peer review and ensure that the diverse learning benefits of the peer-review process are achieved.","authors":["Raoul A Mulder","Jon Pearce","Chi Baik"],"meta":["May 2014Active Learning in Higher Education 15(2):157-171","DOI:10.1177/1469787414527391"],"references":["286557045_Focuson_formative_feedback","349861048_Learning_to_Teach_in_Higher_Education","305688123_Teaching_for_Quality_Learning_at_University","285684933_Students'_interpersonal_perspectives_on_conceptions_of_and_approaches_to_learning_in_online_peer_assessment","271079012_Having_Second_Thoughts_Student_perceptions_before_and_after_a_peer_assessment_exercise","266294132_A_Case_Study_of_Peer_Feedback_in_a_Chinese_EFL_Writing_Classroom","262455712_Learning_To_Teach_in_Higher_Education","258182775_The_Power_of_Feedback","255603587_Guiding_principles_for_eective_peer_response","254340425_Goals_of_peer_assessment_and_their_associated_quality_concepts"]}