{"id":"275480377_Cancer_Detection_Using_Aritifical_Neural_Network_and_Support_Vector_Machine_A_Comparative_Study","abstract":"Accurate diagnosis of cancer plays an importance role in order to save human life. The results of the diagnosis indicate by the medical experts are mostly differentiated based on the experience of different medical experts. This problem could risk the life of the cancer patients. From the literature, it has been found that Artificial Intelligence (AI) machine learning classifiers such as an Artificial Neural Network (ANN) and Support Vector Machine (SVM) can help doctors in diagnosing cancer more precisely. Both of them have been proven to produce good performance of cancer classification accuracy. The aim of this study is to compare the performance of the ANN and SVM classifiers on four different cancer datasets. For breast cancer and liver cancer dataset, the features of the data are based on the condition of the organs which is also called as standard data while for prostate cancer and ovarian cancer; both of these datasets are in the form of gene expression data. The datasets including benign and malignant tumours is specified to classify with proposed methods. The performance of both classifiers is evaluated using four different measuring tools which are accuracy, sensitivity, specificity and Area under Curve (AUC). This research has shown that the SVM classifier can obtain good performance in classifying cancer data compare to ANN classifier.","authors":["Sharifah Hafizah Sy Ahmad Ubaidillah","Roselina Sallehuddin","Nor Azizah Ali"],"meta":["October 2013Jurnal Teknologi 65(1)","DOI:10.11113/jt.v65.1788"],"references":["257814734_Feature_Selection_and_Classification_of_Breast_Cancer_on_Dynamic_Magnetic_Resonance_Imaging_Using_ANN_and_SVM","256821709_Nonlinear_Programming","224751055_FS_SFS_A_novel_feature_selection_method_for_support_vector_machines","224654552_Applying_RBF_Neural_Networks_to_Cancer_Classification_Based_on_Gene_Expressions","278651717_The_Nature_of_Statistical_Learning_Theory","251988622_Breast_Cancer_prediction_based_on_Backpropagation_Algorithm","241103035_ANN_vs_SVM_Which_one_performs_better_in_classification_of_MCCs_in_mammogram_imaging","232620976_An_Effective_Classification_Model_for_Cancer_Diagnosis_Using_Micro_Array_Gene_Expression_Data_PDF","229366429_Classification_of_prostate_magnetic_resonance_spectra_using_Support_Vector_Machine","224261319_Classification_of_Benign_and_Malignant_Breast_Tumors_in_Ultrasound_Images_Based_on_Multiple_Sonographic_and_Textural_Features"]}