{"id":"275458686_A_Semantic_Enrichment_Engine_for_Building_Information_Modeling","abstract":"Significant difficulties remain in exchanging information between building information modeling (BIM) tools. The industry foundation classes (IFC) exchange schema is too generic to capture the full semantic meaning needed for direct use by different construction project stakeholders’ BIM tools. Although BIM standards that prescribe model view definitions (MVD) for domain-specific exchanges are under development, insufficient semantic definition of exchanges prevents achievement of the full potential of BIM through seamless interoperability. We propose an innovative approach for supplementing an IFC exchange file with semantically useful concepts inferred from the explicit and implicit information contained in the building model. A prototype software was implemented to test the applicability of the approach. It consists of a rule-processing engine and allows composition of inference rule-sets that can be tailored for different domains. The tests demonstrate semantic enrichment with precast concrete building models, adding inferred joint, slab aggregation and connection concepts.","authors":["Michael Belsky","Rafael Sacks","Ioannis Brilakis"],"meta":["April 2016Computer-Aided Civil and Infrastructure Engineering 31(4):n/a-n/a","DOI:10.1111/mice.12128"],"references":["290791738_Editorial_-_Case_studies_of_bim_in_use","281596020_Interoperability_in_practice_Geometric_data_exchange_using_the_IFC_standard","270483249_Interoperability_for_precast_concrete_building_models","261642080_Product_Lifecycle_Management_Closing_the_Knowledge_Loops","313469148_Highlights_of_the_development_process_of_industry_foundation_classes","273024541_Ontology-Based_Partial_Building_Information_Model_Extraction","262826878_Computer-aided_feature-based_design_for_net_shape_manufacturing","261202854_A_method_toward_building_semantic-enriched_product_model","260189336_No-Schema_Algorithm_for_Extracting_a_Partial_Model_from_an_IFC_Instance_Model","259969760_Design_Research_in_Information_Systems_Theory_and_Practice"]}