{"id":"275526513_A_review_of_empirical_evidence_on_different_uncanny_valley_hypotheses_Support_for_perceptual_mismatch_as_one_road_to_the_valley_of_eeriness","abstract":"The uncanny valley hypothesis, proposed already in the 1970s, suggests that almost but not fully humanlike artificial characters will trigger a profound sense of unease. This hypothesis has become widely acknowledged both in the popular media and scientific research. Surprisingly, empirical evidence for the hypothesis has remained inconsistent. In the present article, we reinterpret the original uncanny valley hypothesis and review empirical evidence for different theoretically motivated uncanny valley hypotheses. The uncanny valley could be understood as the naïve claim that any kind of human-likeness manipulation will lead to experienced negative affinity at close-to-realistic levels. More recent hypotheses have suggested that the uncanny valley would be caused by artificial-human categorization difficulty or by a perceptual mismatch between artificial and human features. Original formulation also suggested that movement would modulate the uncanny valley. The reviewed empirical literature failed to provide consistent support for the naïve uncanny valley hypothesis or the modulatory effects of movement. Results on the categorization difficulty hypothesis were still too scarce to allow drawing firm conclusions. In contrast, good support was found for the perceptual mismatch hypothesis. Taken together, the present review findings suggest that the uncanny valley exists only under specific conditions. More research is still needed to pinpoint the exact conditions under which the uncanny valley phenomenon manifests itself.","authors":["Jari Kätsyri","Klaus Förger","Meeri Mäkäräinen","Tapio Takala"],"meta":["April 2015Frontiers in Psychology 6(1488):390","DOI:10.3389/fpsyg.2015.00390","SourcePubMed"],"references":["290787319_Evaluation_of_the_Uncanny_Valley_in_CG_Characters","284604945_More_human_than_human_Does_the_uncanny_curve_really_matter","276173688_The_effect_of_onset_asynchrony_in_audio-visual_speech_and_the_Uncanny_Valley_in_virtual_characters","325671474_Core_Affect_and_the_Psychological_Construction_of_Emotion","313311679_Psychophysical_and_cognitive_aspects_of_categorical_perception_A_critical_overview","302295976_Categorical_Perception_Issues_Methods_Findings","281397546_Exploring_the_Uncanny_Valley_to_find_the_edge_of_play","278401248_Exaggerating_Facial_Expressions_A_Way_to_Intensify_Emotion_or_a_Way_to_the_Uncanny_Valley","275067549_Quantitative_Methods_for_Literature_Reviews","272087835_The_Uncanny_Valley"]}