{"id":"275539063_Business_Process_Model_Reasoning_From_Workflow_to_Case_Management","abstract":"Existing limitations and problems in the current life-cycle of software applications is expected to encourage new development paradigms. New technological trends, aimed at responding to current needs, such as flexibility, dynamics, scalability and creativity will drive the envisaged changes. This article describes the various types of business processes, ranging from structured workflows to semi-structured flexible business processes, and methods to model each type of business process. Development of business process models based on the knowledge economy, changing corporate strategy and organization design, and agile enterprise paradigm requires BPMS technology to support weakly structured business activities and emerging ad-hoc tasks. Increasingly, organizations are expanding the use of BPM beyond their initial focus on structured processes into more challenging, cross-boundary processes that include more unstructured components. Case management technology allows the modeling of cases in which a business goal is achieved by taking decisions in the context of documents and other content objects. Case management is considered dynamic because it focuses on unstructured and ad- hoc processes. It is likewise a continuing process that involves people, information, processes, and technical tools. Furthermore, it is adaptive and adaptable because it can be used by non-technical users and is versatile in its applications in different situations. With the use of case management, circuitous business processes, fragmented communication, repetitive operations, missing documents, and long approval times can be permanently abolished.","authors":["Julia Stavenko","Nikolay Kazantsev","Alexander Gromoff"],"meta":["December 2013Procedia Technology 9","DOI:10.1016/j.protcy.2013.12.089","Project: Flexible business architectures"],"references":["224169352_BPM_and_Exception_Handling_Focus_on_Organizational_Resilience","222423876_Case_Handling_A_New_Paradigm_for_Business_Process_Support","247189026_Plans_and_Situated_Actions","220095052_The_Case_Handling_Case","3188112_Exception_handling_in_workflow_management_systems"]}