{"id":"275586560_CASD-NMR_2_Robust_and_accurate_unsupervised_analysis_of_raw_NOESY_spectra_and_protein_structure_determination_with_UNIO","abstract":"UNIO is a comprehensive software suite for protein NMR structure determination that enables full automation of all NMR data analysis steps involved-including signal identification in NMR spectra, sequence-specific backbone and side-chain resonance assignment, NOE assignment and structure calculation. Within the framework of the second round of the community-wide stringent blind NMR structure determination challenge (CASD-NMR 2), we participated in two categories of CASD-NMR 2, namely using either raw NMR spectra or unrefined NOE peak lists as input. A total of 15 resulting NMR structure bundles were submitted for 9 out of 10 blind protein targets. All submitted UNIO structures accurately coincided with the corresponding blind targets as documented by an average backbone root mean-square deviation to the reference proteins of only 1.2 Å. Also, the precision of the UNIO structure bundles was virtually identical to the ensemble of reference structures. By assessing the quality of all UNIO structures submitted to the two categories, we find throughout that only the UNIO-ATNOS/CANDID approach using raw NMR spectra consistently yielded structure bundles of high quality for direct deposition in the Protein Data Bank. In conclusion, the results obtained in CASD-NMR 2 are another vital proof for robust, accurate and unsupervised NMR data analysis by UNIO for real-world applications.","authors":["Paul Guerry","Viet Dung Duong","Torsten Herrmann"],"meta":["April 2015Journal of Biomolecular NMR 62(4)","DOI:10.1007/s10858-015-9934-7","SourcePubMed"],"references":["268877995_APSY-NMR_for_protein_backbone_assignment_in_high-throughput_structural_biology","268873087_J-UNIO_protocol_used_for_NMR_structure_determination_of_the_206-residue_protein_NP_3464871_from_Streptococcus_pneumoniae_TIGR4","259738923_WeNMR_Structural_biology_on_the_grid","256466586_Recommendations_of_the_wwPDB_NMR_validation_task_force","228104749_The_J-UNIO_protocol_for_automated_protein_structure_determination_by_NMR_in_solution","227857801_Structure_and_backbone_dynamics_of_a_microcrystalline_metalloprotein_by_solid-state_NMR","281674046_Automated_protein_structure_determination_from_NMR_data","263213394_Automated_NMR_protein_structure_calculation_with_CYANA","262533962_Robust_and_highly_accurate_automatic_NOESY_assignment_and_structure_determination_with_Rosetta","228770999_Automated_NMR_protein_structure_calculation_with_CYANA"]}