{"id":"275649984_On_Skill_Acquisition_Support_by_Analogical_Rule_Abduction","abstract":"This paper describes our development of analogical abduction as an extension to our work on meta level abductive reasoning for rule abduction and predicate invention. Previously, we gave a set of axioms to state the object level causalities in terms of first-order-logic (FOL) clauses, which represent direct and indirect causalities with transitive rules. Here we extend our formalism of the meta level abductive reasoning, by adding rules to conduct analogical inference. We have applied our analogical abduction method to the problem of explaining the difficult cello playing techniques of spiccato and rapid cross strings of the bow movement. Our method has constructed persuasive analogical explanations about how to play them. We have used a model of forced vibration mechanics as the base world for spiccato, and the specification of the skeletal structure of the hand as the basis for the cross string bowing technique. We also applied analogical abduction to show the effectiveness of a metaphorical expression of “eating pancake on the sly” to achieve forte-piano dynamics, and successfully created an analogical explanation of how it works.","authors":["Koichi Furukawa","Keita Kinjo","Tomonobu Ozaki","Makoto Haraguchi"],"meta":["July 2014Communications in Computer and Information Science 421:71-83","DOI:10.1007/978-3-319-08732-0_6","Conference: International Workshop on Information Search, Integration, and Personalization"],"references":["292777771_Towards_a_mathematical_theory_of_analogy","225170833_SOLAR_A_Consequence_Finding_System_for_Advanced_Reasoning","223929596_Linear_resolution_for_consequence_finding","221475163_Discovering_Rules_by_Meta-level_Abduction","220811864_Analogy_and_Abduction_in_Automated_Deduction","220769916_A_Sketch_of_Analogy_as_Reasoning_with_Equality_Hypotheses","220118281_Inductive_Logic_Programming_Theory_and_Methods","31908194_TOWARDS_A_MATHEMATICAL_THEORY_OF_ANALOGY","2467547_Translating_Case-Based_Reasoning_into_Abductive_Logic_Programming","2466729_Analogical_Logic_Program_Synthesis_from_Examples"]}