{"id":"275654155_Zero-Overhead_Metaprogramming_Reflection_and_Metaobject_Protocols_Fast_and_without_Compromises","abstract":"Runtime metaprogramming enables many useful applications and is often a convenient solution to solve problems in a generic way, which makes it widely used in frameworks, middleware, and domain-specific languages. However, powerful metaobject protocols are rarely supported and even common concepts such as reflective method invocation or dynamic proxies are not optimized. Solutions proposed in literature either restrict the metaprogram-ming capabilities or require application or library developers to apply performance improving techniques. For overhead-free runtime metaprogramming, we demonstrate that dispatch chains, a generalized form of polymorphic inline caches common to self-optimizing interpreters, are a simple optimization at the language-implementation level. Our evaluation with self-optimizing interpreters shows that unrestricted metaobject protocols can be realized for the first time without runtime overhead, and that this optimization is applicable for just-in-time compilation of interpreters based on meta-tracing as well as partial evaluation. In this context, we also demonstrate that optimizing common reflective operations can lead to significant performance improvements for existing applications.","authors":["Stefan Marr","Chris Seaton","Stéphane Ducasse"],"meta":["June 2015ACM SIGPLAN Notices 50(6)","DOI:10.1145/2737924.2737963","Conference: 36th ACM SIGPLAN Conference on Programming Language Design and ImplementationAt: Portland, OR, USA"],"references":["266661846_A_Domain-Specific_Language_for_Building_Self-Optimizing_AST_Interpreters","266659800_Debugging_at_Full_Speed","266078363_An_object_storage_model_for_the_truffle_language_implementation_framework","330265230_The_Art_of_the_Metaobject_Protocol","279970262_Dynamo","273188647_Accelerating_iterators_in_optimizing_AST_interpreters","267857088_The_Impact_of_Meta-Tracing_on_VM_Design_and_Implementation","266661845_Compiling_a_Reflective_Language_using_MetaOCaml","266661751_TruffleC_dynamic_execution_of_C_on_a_Java_virtual_machine","266657548_First-class_Runtime_Generation_of_High-performance_Types_using_Exotypes"]}