{"id":"275663198_Quantification_of_Interactions_between_Dynamic_Cellular_Network_Functionalities_by_Cascaded_Layering","abstract":"Large, naturally evolved biomolecular networks typically fulfil multiple functions. When modelling or redesigning such systems, functional subsystems are often analysed independently first, before subsequent integration into larger-scale computational models. In the design and analysis process, it is therefore important to quantitatively analyse and predict the dynamics of the interactions between integrated subsystems; in particular, how the incremental effect of integrating a subsystem into a network depends on the existing dynamics of that network. In this paper we present a framework for simulating the contribution of any given functional subsystem when integrated together with one or more other subsystems. This is achieved through a cascaded layering of a network into functional subsystems, where each layer is defined by an appropriate subset of the reactions. We exploit symmetries in our formulation to exhaustively quantify each subsystem's incremental effects with minimal computational effort. When combining subsystems, their isolated behaviour may be amplified, attenuated, or be subject to more complicated effects. We propose the concept of mutual dynamics to quantify such nonlinear phenomena, thereby defining the incompatibility and cooperativity between all pairs of subsystems when integrated into any larger network. We exemplify our theoretical framework by analysing diverse behaviours in three dynamic models of signalling and metabolic pathways: the effect of crosstalk mechanisms on the dynamics of parallel signal transduction pathways; reciprocal side-effects between several integral feedback mechanisms and the subsystems they stabilise; and consequences of nonlinear interactions between elementary flux modes in glycolysis for metabolic engineering strategies. Our analysis shows that it is not sufficient to just specify subsystems and analyse their pairwise interactions; the environment in which the interaction takes place must also be explicitly defined. Our framework provides a natural representation of nonlinear interaction phenomena, and will therefore be an important tool for modelling large-scale evolved or synthetic biomolecular networks.","authors":["Thomas P Prescott","Moritz Lang","Antonis Papachristodoulou"],"meta":["May 2015PLoS Computational Biology 11(5):e1004235","DOI:10.1371/journal.pcbi.1004235","SourcePubMed","Project: Modularization"],"references":["305395054_Modular_Cell_Biology_Retroactivity_and_Insulation","305394977_Untangling_the_wires_a_novel_strategy_to_trace_functional_interactions_in_signaling_and_gene_networks","279839624_Limitations_and_trade-offs_in_gene_expression_due_to_competition_for_shared_cellular_resources","260809329_Modular_Composition_of_Gene_Transcription_Networks","321594250_Advances_in_Systems_Biology","292135929_Robust_perfect_adaptation_in_bacterial_chemotaxis_through_integral_feedback_control","278649460_Design_and_Analysis_of_Biomolecular_Circuits","271419652_Synthetic_biology_A_control_engineering_perspective","269293518_Signal_propagation_across_layered_biochemical_networks","261734674_Layered_decomposition_for_the_model_order_reduction_of_timescale_separated_biochemical_reaction_networks"]}