{"id":"275684942_Studying_the_Impact_of_Using_Multimedia_Interactive_Programs_on_Children's_Ability_to_Learn_Basic_Math_Skills","abstract":"The continuous inventions and evolutions in all information technology fields open new channels and opportunities to enhance teaching and educational methods. On one side, these may improve the abilities of educators to present information in interactive and media-enhanced formats relative to traditional methods. This may help students or learners through offering them the information in channels and methods that can be easier to understand, deal with and retrieve. On the other hand, offering those alternative methods of teaching can be helpful particularly for children, people with special needs, or students in rural areas where they can have virtual or remote instructors, especially for majors who have shortages. The purpose of this study is to investigate the impact of utilising multimedia technologies on enhancing, or not, the effectiveness of teaching students at early stages in Jordanian primary schools. To achieve this objective, a program has been developed to test the students' ability to understand basic mathematical knowledge and skills. Two groups were selected from a local school based on their own class distribution, where one group was taught the subject in basic math using a program developed for this purpose and the second class was taught the same subject using traditional methods of teaching (i.e. direct student-to-child instruction, board, etc.). Results showed that in such math skills at this age, using programs or multimedia-enhanced methods of teaching can be effective in getting students' attention, especially when cartoon characters are used. Results also showed that there is no significant difference in learning and knowledge skills and information absorption based on gender distribution, as a comparison of the results between little boys and girls showed no significant difference in their learning skills.","authors":["S. Nusir","Izzat Alsmadi","Mohammed N. Al-Kabi","Fatima Sharadgah"],"meta":["September 2013","DOI:10.2304/elea.2013.10.3.305"],"references":["250758671_Interactive_Nonlinear_Learning_Environments","295505805_Development_and_usage_of_concept_inventories_in_an_optical_engineering_program","274577775_Knowledge-Worker_Productivity_The_Biggest_Challenge","267239310_The_future_of_multimedia_learning_Essential_issues_for_research","255625985_Can_Music_Instruction_Affect_Children's_Cognitive_Development","254173392_Selling_to_Generation_Y_Virtual_Workers_and_Boomer_Grandparents_Tools_for_Tracking_Marketing_Trends","250149960_A_Study_of_Pre-School_Teachers'_Thoughts_about_Computer-Assisted_Instruction","246899935_Multimedia_Learning_Are_We_Asking_the_Right_Questions","246590984_Joystick_Nation-How_Videogames_Ate_Our_Quarters","242325759_RF01_THE_SIGNIFICANCE_OF_TASK_DESIGN_IN_MATHEMATICS_EDUCATION_EXAMPLES_FROM_PROPORTIONAL_REASONING"]}