{"id":"275669290_Clock_Synchronization_and_Distributed_Estimation_in_Highly_Dynamic_Networks_An_Information_Theoretic_Approach","abstract":"We consider the External Clock Synchronization problem in dynamic sensor networks. Initially, sensors obtain inaccurate estimations of an external time reference and subsequently collaborate in order to synchronize their internal clocks with the external time. For simplicity, we adopt the drift-free assumption, where internal clocks are assumed to tick at the same pace. Hence, the problem is reduced to an estimation problem, in which the sensors need to estimate the initial external time. In this context of distributed estimation, this work is further relevant to the problem of collective approximation of environmental values by biological groups.\nUnlike most works on clock synchronization that assume static networks, this paper focuses on an extreme case of highly dynamic networks. We do however impose a restriction on the dynamicity of the network. Specifically, we assume a non-adaptive scheduler adversary that dictates an arbitrary, yet independent, meeting pattern. Such meeting patterns fit, for example, with short-time scenarios in highly dynamic settings, where each sensor interacts with only few other arbitrary sensors.\nWe propose an extremely simple clock synchronization (or an estimation) algorithm that is based on weighted averages, and prove that its performance on any given independent meeting pattern is highly competitive with that of the best possible algorithm, which operates without any resource or computational restrictions, and further knows the whole meeting pattern in advance. In particular, when all distributions involved are Gaussian, the performances of our scheme coincide with the optimal performances. Our proofs rely on an extensive use of the concept of Fisher information. We use the Cramér-Rao bound and our definition of a Fisher Channel Capacity to quantify information flows and to obtain lower bounds on collective performance. This opens the door for further rigorous quantifications of information flows within collaborative sensors.","authors":["Ofer Feinerman","Amos Korman"],"meta":["April 2015","DOI:10.1007/978-3-319-25258-2_2","SourcearXiv","Conference: International Colloquium on Structural Information and Communication Complexity"],"references":["271699475_PulseSync_An_Efficient_and_Scalable_Clock_Synchronization_Protocol","266571810_Confidence_Sharing_An_Economic_Strategy_for_Efficient_Information_Flows_in_Animal_Groups","279258484_Breathe_before_speaking_Efficient_information_dissemination_despite_noisy_limited_and_anonymous_communication","269078909_Improved_Algorithms_for_Synchronizing_Computer_Network_Clocks","266908024_Network_Information_Theory","244958444_A_Mathematical_Theory_of_Communication_The_Bell_System_Technical_Journal","243763312_Global_and_local_properties_in_networks_of_processors","242501896_Tempo--a_network_time_controller_for_a_distributed_berkeley_unix_system","239593861_Distributed_Computing_A_Locality-Sensitive_Approach","239539660_Internet_time_synchronization_The_network_time_protocol"]}