{"id":"275605011_E-Learning_Methodologies_and_Tools","abstract":"E-learning is among the most important explosion propelled by the internet transformation. This allows users to fruitfully gather knowledge and education both by synchronous and asynchronous methodologies to effectively face the need to rapidly acquire up to date know-how within productive environments. This review paper discusses on e-learning methodologies and tools. The different categories of e-learning that includes informal and blending learning, network and work-based learning. The main focus of e-learning methodologies is on both asynchronous and synchronous methodology. The paper also looked into the three major e-learning tools which are (i) curriculum tools (ii) digital library tools and (iii) knowledge representation tools. The paper resolves that e-learning is a revolutionary way to empower workforce with the skill and knowledge it needs to turn change to an advantage. Consequently, many corporations are discovering that e-learning can be used as a tool for knowledge management. Finally the paper suggests that synchronous tools should be integrated into asynchronous environments to allow for “any-time” learning model. This environment would be primarily asynchronous with background discussion, assignments and assessment taking place and managed through synchronous tools.","authors":["N.D. Oye","Mazleena Salleh"],"meta":["February 2012International Journal of Advanced Computer Science and Applications 3(2)","DOI:10.14569/IJACSA.2012.030208"],"references":["253945403_Title_A_SYSTEMATIC_APPROACH_FOR_DESIGNING_HYPERMEDIA_ENVIRONMENTS_FOR_TEACHING_AND_LEARNING","228900933_Challenges_of_E-Learing_in_Nigerian_University_Education_Based_on_the_Experience_of_Developed_Countries","228628119_Describing_learning_objects_for_situation-oriented_knowledge_management_applications","221267405_Generating_instructional_hypermedia_with_APHID","314819774_A_phenomenographic_study_of_students'_attitudes_toward_the_use_of_multiple_media_for_learning","290054671_Virtual_Mentor_and_the_Lab_System_-_Toward_Building_an_Interactive_Personalized_and_Intelligent_E-Learning_Environment","242529420_Foundations_of_educational_theory_for_online_learning","235720414_Design_Science_Research_in_Information_Systems","220818548_A_Visual_Language_System_for_Developing_and_Presenting_Internet-Based_Education","220807290_A_Phenomenographic_Study_of_Students'_Attitudes_Toward_the_Use_of_Multiple_Media_for_Learning"]}