{"id":"275647428_DIR-visible_grey_matter_lesions_and_atrophy_in_multiple_sclerosis_Partners_in_crime","abstract":"Background: The extent and clinical relevance of grey matter (GM) pathology in multiple sclerosis (MS) are increasingly recognised. GM pathology may present as focal lesions, which can be visualised using double inversion recovery (DIR) MRI, or as diffuse pathology, which can manifest as atrophy. It is, however, unclear whether the diffuse atrophy centres on focal lesions. This study aimed to determine if GM lesions and GM atrophy colocalise, and to assess their independent relationship with motor and cognitive deficits in MS.\n\nMethods: Eighty people with MS and 30 healthy controls underwent brain volumetric T1-weighted and DIR MRI at 3 T, and had a comprehensive neurological and cognitive assessment. Probability mapping of GM lesions marked on the DIR scans and voxel- based morphometry (assessing GM atrophy) were carried out. The associations of GM lesion load and GM volume with clinical scores were tested.\n\nResults: DIR-visible GM lesions were most commonly found in the right cerebellum and most apparent in patients with primary progressive MS. Deep GM structures appeared largely free from lesions, but showed considerable atrophy, particularly in the thalamus, caudate, pallidum and putamen, and this was most apparent in secondary progressive patients with MS. Very little co-localisation of GM atrophy and lesions was seen, and this was generally confined to the cerebellum and postcentral gyrus. In both regions, GM lesions and volume independently correlated with physical disability and cognitive performance.\n\nConclusions: DIR-detectable GM lesions and GM atrophy do not significantly overlap in the brain but, when they do, they independently contribute to clinical disability.","authors":["Steven Harry Pieter Van de Pavert","Nils Muhlert","Varun Sethi","Claudia Angela Michela Gandini Wheeler-Kingshott"],"meta":["April 2015Journal of Neurology, Neurosurgery, and Psychiatry 87(5)","DOI:10.1136/jnnp-2014-310142"],"references":["265057913_Regional_patterns_of_grey_matter_atrophy_and_magnetisation_transfer_ratio_abnormalities_in_multiple_sclerosis_clinical_subgroups_A_voxel-based_analysis_study","263778615_The_grey_matter_correlates_of_impaired_decision-making_in_multiple_sclerosis","262883320_Multiple_sclerosis_deep_grey_matter_The_relation_between_demyelination_neurodegeneration_inflammation_and_iron","260218005_Permutation_Inference_for_the_General_Linear_Model","295313266_Regional_grey_matter_atrophy_in_early_primary_progressive_multiple_sclerosis_a_voxel-based_morphometry_study","285426085_Symbol_Digit_Modalities_Test_SDMT","285080388_Functional_topography_of_the_cerebellum_for_motor_and_cognitive_tasks_An_fMRI_study","284655516_Recognition_Memory_Test","284553553_Cortical_lesions_in_multiple_sclerosis_presenting_combined_postmorten_MR_imaging_and_histopathology","274800076_Statistical_Methods_In_Medical_Research"]}