{"id":"275663908_Why_do_bacteria_divide","abstract":"The problem of not only how but also why cells divide can be tackled using recent ideas. One idea from the origins of life - Life as independent of its constituents - is that a living entity like a cell is a particular pattern of connectivity between its constituents. This means that if the growing cell were just to get bigger the average connectivity between its constituents per unit mass - its cellular connectivity - would decrease and the cell would lose its identity. The solution is division which restores connectivity. The corollary is that the cell senses decreasing cellular connectivity and uses this information to trigger division. A second idea from phenotypic diversity - Life on the Scales of Equilibria - is that a bacterium must find strategies that allow it to both survive and grow. This means that it has learnt to reconcile the opposing constraints that these strategies impose. The solution is that the cell cycle generates daughter cells with different phenotypes based on sufficiently complex equilibrium (E) and non-equilibrium (NE) cellular compounds and structures appropriate for survival and growth, respectively, alias 'hyperstructures.' The corollary is that the cell senses both the quantity of E material and the intensity of use of NE material and then uses this information to trigger the cell cycle. A third idea from artificial intelligence - Competitive Coherence - is that a cell selects the active subset of elements that actively determine its phenotype from a much larger set of available elements. This means that the selection of an active subset of a specific size and composition must be done so as to generate both a coherent cell state, in which the cell's contents work together harmoniously, and a coherent sequence of cell states, each coherent with respect to itself and to an unpredictable environment. The solution is the use of a range of mechanisms ranging from hyperstructure dynamics to the cell cycle itself.","authors":["Vic Norris"],"meta":["April 2015Frontiers in Microbiology 6:322","DOI:10.3389/fmicb.2015.00322","SourcePubMed"],"references":["272083481_Membrane_Recognition_and_Dynamics_of_the_RNA_Degradosome","269986418_Cell-Size_Control_and_Homeostasis_in_Bacteria_Curr_Biol_2015_data_extended_Supplementary_Information","269720493_Spatial_localization_of_the_first_and_last_enzymes_effectively_connects_active_metabolic_pathways_in_bacteria","269189530_Molecular_complementarity_between_simple_universal_molecules_and_ions_limited_phenotype_space_in_the_precursors_of_cells","267933333_Compartmentalization_and_Cell_Division_through_Molecular_Discreteness_and_Crowding_in_a_Catalytic_Reaction_Network","267871773_Chromosome_Replication_in_Escherichia_coli_Life_on_the_Scales","316804627_Cell-Size_Control_and_Homeostasis_in_Bacteria_corrections","294757947_Object_ordering_in_hierarchical_systems","273888774_What_Properties_of_Life_Are_Universal_Substance-Free_Scale-free_Life","269283899_A_Constant_Size_Extension_Drives_Bacterial_Cell_Size_Homeostasis"]}