{"id":"275853183_Multi-Channel_Data_Collection_for_Throughput_Maximization_in_Wireless_Sensor_Networks","abstract":"We present the design and implementation of Multi-Channel Collection (MCC) protocol , a high-rate multi-channel time-scheduled protocol for fair, real-time data collection in Wireless Sensor Networks (WSN). MCC incorporates sophisticated mechanisms for balanced routing tree formation, multiple frequency channel allocation and globally synchronized TDMA scheduling. Through systematic experiments with real WSN hardware (Tmote Sky), we identify the maximum possible throughput for many-to-one (convergecast) data collection as a function of key communication parameters such as packet size, use of acknowledgements, and network topology. Then, we demonstrate that the maximum achievable network throughput can in fact be attained in practice using a carefully designed mix of routing, frequency allocation and time scheduling. Compared to state of the art collection protocols for WSN, we show that MCC offers 33-155% improvement in throughput. We also show how to exploit the time-scheduled nature of this approach for reducing the number of required frequency channels. MCC presents an algorithmic approach for time-frequency scheduling and routing that could be adapted and used in conjunction with relevant emerging standards such as WirelessHART, ISA 100.11a and IEEE 802.15.4e TSCH.","authors":["Ying Chen","Pedro Henrique Gomes","Bhaskar Krishnamachari"],"meta":["October 2014","DOI:10.1109/MASS.2014.47","Conference: 2014 IEEE 11th International Conference on Mobile Ad Hoc and Sensor Systems (MASS)"],"references":["313640165_The_flooding_time_synchronization_protocol","254882478_Multichannel_wireless_sensor_networks_protocols_design_and_evaluation","228665579_Explicit_and_Precise_Rate_Control_for_Wireless_Sensor_Networks","228555393_TSMP_Time_synchronized_mesh_protocol","224218022_Fast_Data_Collection_in_Tree-Based_Wireless_Sensor_Networks","279401450_RCRT_Rate-Controlled_Reliable_Transport_Protocol_for_Wireless_Sensor_Networks","261960065_P3_A_Practical_Packet_Pipeline_using_synchronous_transmissions_for_wireless_sensor_networks","238489004_Approaching_the_Maximum_802154_Multi-hop_Throughput","229816907_The_Complexity_of_the_Capacitated_Tree_Problem","224311458_Realistic_and_Efficient_Multi-Channel_Communications_in_Wireless_Sensor_Networks"]}