{"id":"275841177_The_Influence_of_Particle_Breakage_on_the_Location_of_the_Critical_State_Line_of_Sands","abstract":"Recent constitutive models for sands that incorporate the effects of particle breakage have emphasised the change of location of the critical state line in the void ratio: logarithm of the mean effective stress plane as the grading changes. This approach differs from earlier experimental work in which a unique and static critical state line was assumed: the basic difference between the two approaches being the question of whether the soil ̀̀ knows\" about the breakage that it has undergone. A series of triaxial tests was therefore conducted to investigate the effect of particle breakage on the current location of the critical state line. Two different shearing stages were used: the first to produce particle breakage and the second one to see if the material ̀̀remembers\" the original state if sheared again. It was found that the critical state line does move with particle breakage, so indicating that the soil does ̀̀know\" about the breakage that has occurred. However, large amounts of breakage were required to create a significant shift. The results show, furthermore, that the effect of the change of grading is not only a verticle movement in the the critical state line but also a rotation. Comparisons with the behaviour of reconstituted samples with the same grading as the pre-sheared samples demonstrated that while the soil does have some ̀̀knowledge\" that it has undergone breakage, the initial grading remains more important than the current grading in determining its behaviour. An analysis of thin sections showed that this is probably because when particles break, the broken fragments remain in close proximity to each other and are not distributed uniformly throughout the soils.","authors":["V. Bandini","M. R. Coop"],"meta":["August 2011Soils and Foundations -Tokyo- 51(4):591-600","DOI:10.3208/sandf.51.591"],"references":["239343706_Structural_changes_in_granular_materials_The_case_of_irregular_polygonal_particles","313505409_Critical_states_and_soil_modeling","290813065_Automated_triaxial_apparatus_for_elevated_pressures","274764425_The_Steady_State_of_Sandy_Soils","269463450_Undrained_monotonic_response_of_clean_and_silty_sands","245411253_Sand_state_from_cone_penetrometer_tests_A_framework_considering_grain_crushing_stress","245112041_A_plasticity_theory_without_Drucker's_postulate_for_granular_materials","239388945_Undrained_Fragility_of_Clean_Sands_Silty_Sands_and_Sandy_Silts","237370918_Defining_an_appropriate_steady_state_line_for_Merriespruit_gold_tailings","223937864_Breakage_mechanics-Part_II_Modelling_granular_materials","223063586_Breakage_mechanics-Part_I_Theory"]}