{"id":"275836443_Nash_equilibrium_and_evolutionary_dynamics_in_semifinalists'_dilemma","abstract":"We consider a tournament among four equally strong semifinalists. The players\nhave to decide how much stamina to use in the semifinals, provided that the\nrest is available in the final and the third-place playoff. We investigate\noptimal strategies for allocating stamina to the successive matches when\nplayers' prizes (payoffs) are given according to the tournament results. From\nthe basic assumption that the probability to win a match follows a\nnondecreasing function of stamina difference, we present symmetric Nash\nequilibria for general payoff structures. We find three different phases of the\nNash equilibria in the payoff space. First, when the champion wins a much\nbigger payoff than the others, any pure strategy can constitute a Nash\nequilibrium as long as all four players adopt it in common. Second, when the\nfirst two places are much more valuable than the other two, the only Nash\nequilibrium is such that everyone uses a pure strategy investing all stamina in\nthe semifinal. Third, when the payoff for last place is much smaller than the\nothers, a Nash equilibrium is formed when every player adopts a mixed strategy\nof using all or none of its stamina in the semifinals. In a limiting case that\nonly last place pays the penalty, this mixed-strategy profile can be proved to\nbe a unique symmetric Nash equilibrium, at least when the winning probability\nfollows a Heaviside step function. Moreover, by using this Heaviside step\nfunction, we study the tournament by using evolutionary replicator dynamics to\nobtain analytic solutions, which reproduces the corresponding Nash equilibria\non the population level and gives information on dynamic aspects.","authors":["Seung Ki Baek","Seung-Woo Son","Hyeong-Chai Jeong"],"meta":["April 2015Physical Review E 91(4-1)","DOI:10.1103/PhysRevE.91.042144","SourcearXiv"],"references":["271218499_Theory_of_fads_Traveling-wave_solution_of_evolutionary_dynamics_in_a_one-dimensional_trait_space","258445024_Universal_statistics_of_the_knockout_tournament","253336081_Faster_Is_More_Different_Mean-Field_Dynamics_of_Innovation_Diffusion","236189156_The_Evolution_of_Extortion_in_Iterated_Prisoner's_Dilemma_Games","235753436_Scaling_in_Tournaments","230899444_Randomness_in_Competitions","225054497_Iterated_Prisoners_Dilemma_Contains_Strategies_That_Dominate_Any_Evolutionary_Opponent","46554914_Parity_and_Predictability_of_Competitions","262266406_Optional_games_on_cycles_and_complete_graphs","243767969_Evolutionary_Stable_Strategies_and_Game_Dynamics"]}