{"id":"275983096_Employers'_Perceptions_on_Graduates_in_Malaysian_Services_Sector","abstract":"In this challenging world, competition is everywhere. Individual works hard to equip themselves with knowledge and skills to avoid being left far behind and survive. Obtaining a degree from institute of higher education in local or overseas has become necessary in order to get a good job with nice salary. However, a quite alarming issue is a high unemployment rate among graduate in this country. Among the factors that cause unemployment among graduates are lacks of soft skills, high employers' expectation, mismatching and the fluctuation of economy in the country. The main purpose of this study is to get the perception of employers' in services sector on graduates performance. Services sector is selected since, it has become the main sector in the country. A total of 749 employers' in the services sector in Lembah Klang involved in this research. The questionnaires were distributed to employers' and human resource managers and head of other departments in the organization in 2009 and 2010. The difference in mean score obtained by graduates from the University Kebangsaan Malaysia (UKM), graduates from other local institute of higher education and graduates from overseas were compared and tested. In general, the results show that respondents give moderate scores to all of the graduates. This shows that the graduates performances are good and satisfying but not the best. In addition, some weaknesses among graduates from UKM and other local and overseas institute of higher education have been recognized from the results of comparing the mean scores. The implication from this finding is that institutes of higher education still need to work hard to improve the ability and employability of their graduates in the job market where quality is more needed than quantity.","authors":["Rahmah Ismail","Ishak Yussof","Lai Wei Sieng"],"meta":["March 2011International Business Management 5(3):184-193","DOI:10.3923/ibm.2011.184.193"],"references":["234605864_Graduates'_Employment_and_the_Discourse_of_Employability_A_Critical_Analysis","46527326_Employability_Skills_Initiatives_in_Higher_Education_What_Effects_do_They_Have_on_Graduate_Labour_Market_Outcomes","304829815_Tips_from_Top_Advertising_Executives_Implications_for_Advertising_Education","288556675_AD_executives_grade_new_grads_The_final_exam_that_counts","250915562_Promoting_employability_skills_development_in_a_research-intensive_university","240526685_Business_graduates_and_management_jobs_An_employability_match_made_in_heaven","237967491_Tips_from_Top_Advertising_Executives_Implications_for_Advertising_Education","234637267_Evaluation_in_Practice_Identifying_Factors_for_Improving_Transfer_of_Training_in_Technical_Domains","222876933_What_determines_employment_opportunity_for_college_graduates_in_China_after_higher_education_reform","222703759_Graduates'_personality_characteristics_and_labor_market_entry_an_empirical_study_among_Dutch_economics_graduates","42386024_Perception_Differential_between_Employers_and_Undergraduates_on_the_Importance_of_Employability_Skills","44832990_Generic_Cognitive_Abilities_in_Higher_Education_An_international_analysis_of_skills_sought_by_stakeholders"]}