{"id":"276065623_The_attention_schema_theory_A_mechanistic_account_of_subjective_awareness","abstract":"We recently proposed the attention schema theory, a novel way to explain the brain basis of subjective awareness in a mechanistic and scientifically testable manner. The theory begins with attention, the process by which signals compete for the brain's limited computing resources. This internal signal competition is partly under a bottom-up influence and partly under top-down control. We propose that the top-down control of attention is improved when the brain has access to a simplified model of attention itself. The brain therefore constructs a schematic model of the process of attention, the 'attention schema,' in much the same way that it constructs a schematic model of the body, the 'body schema.' The content of this internal model leads a brain to conclude that it has a subjective experience. One advantage of this theory is that it explains how awareness and attention can sometimes become dissociated; the brain's internal models are never perfect, and sometimes a model becomes dissociated from the object being modeled. A second advantage of this theory is that it explains how we can be aware of both internal and external events. The brain can apply attention to many types of information including external sensory information and internal information about emotions and cognitive states. If awareness is a model of attention, then this model should pertain to the same domains of information to which attention pertains. A third advantage of this theory is that it provides testable predictions. If awareness is the internal model of attention, used to help control attention, then without awareness, attention should still be possible but should suffer deficits in control. In this article, we review the existing literature on the relationship between attention and awareness, and suggest that at least some of the predictions of the theory are borne out by the evidence.","authors":["Michael S A Graziano","Taylor W Webb"],"meta":["April 2015Frontiers in Psychology 6(500):500","DOI:10.3389/fpsyg.2015.00500","SourcePubMed"],"references":["325671446_Social_influence_effects_on_automatic_racial_prejudice","320288294_Model_predictive_control","313091864_Sensory_disturbances_from_cerebral_lesions","292192425_Towards_a_Neurobiological_Theory_of_Consciousness","286109221_Neural_Mechanisms_of_Selective_Visual_Attention","285256602_Conscious_Contents_Provide_the_Nervous_System_with_Coherent_Global_Information","284778408_How_the_brain_represents_the_body_Insights_from_neurophysiology_and_psychology","283089153_On_The_Nature_of_Prejudice_Automatic_and_Controlled_Processes","280743455_Stereotypes_and_Prejudice_Their_Automatic_and_Controlled_Components","279235562_Inattentional_Blindness","260876711_Attributing_awareness_to_oneself_and_to_others","277460860_Inhibition_in_the_eye_of_Limulus","272412335_A_Mechanistic_Theory_of_Consciousness","266155982_Unconscious_pop-out_Attentional_capture_by_unseen_feature_singletons_only_when_top-down_attention_is_available","265790209_Model_Predictive_Control"]}