{"id":"276025001_A_Scalable_Method_for_Partitioning_Workflows_with_Security_Requirements_over_Federated_Clouds","abstract":"The significant increase in the use of cloud computing , has led to an interest in partitioning applications over a set of public and private clouds in order to meet a range of non-functional requirements including performance (for example where private cloud resources alone are insufficient), dependability (e.g. to allow the application to continue to operate even if one cloud fails) and security (for example to ensure that sensitive data is restricted to sufficiently secure clouds and networks). This paper describes a novel deployment planning algorithm to partition complex workflow-based applications over federated clouds, while meeting security requirements. The security issues are based on our previous work which extends the Bell-LaPadula model to encompass cloud computing. Selecting the cheapest option for partitioning a workflow over a set of resources has been shown to be an NP-hard problem, which can take impractically long for partitioning large workflows over multiple clouds. We therefore introduce a novel adaptive partitioning algorithm to handle these large workflow applications, which significantly reduces the time required to choose a sufficiently-good partitioning option. This is based on generating an initial partitioning, and then adapting it to see if a better solution can be found by bringing together on the same node services with significant communication costs. The algorithm has been implemented and evaluated by using both randomly generated and real world scientific workflows. The experiment results show that our algorithm is thousands times quicker than the exhaustive algorithm presented in our previous work. Yet, on average it generates only 25% more costly solutions. We also compared this algorithm with two other methods commonly used to partition workflows over a set of clouds.","authors":["Zhenyu Wen","Jacek Cała","Paul Watson"],"meta":["December 2014","DOI:10.1109/CloudCom.2014.89","Conference: Cloud Computing Technology and Science (CloudCom), 2014 IEEE 6th International Conference on"],"references":["315615387_Secure_and_Flexible_Monitoring_of_Virtual_Machines","262277826_Dynamic_Exception_Handling_for_Partitioned_Workflow_on_Federated_Clouds","261265866_Partitioning_and_Cloud_Deployment_of_Composite_Web_Services_under_Security_Constraints","261156893_Secure_and_Flexible_Monitoring_of_Virtual_Machines","254038660_Integration_of_Workflow_Partitioning_and_Resource_Provisioning","248573637_Cost-and_Deadline-Constrained_Provisioning_for_Scientific_Workflow_Ensembles_in_IaaS_Clouds","266369148_From_Scripted_HPC-Based_NGS_Pipelines_to_Workflows_on_the_Cloud","261522309_Predicting_the_Execution_Time_of_Workflow_Activities_Based_on_Their_Input_Features","261071174_Formalising_Workflows_Partitioning_over_Federated_Clouds_Multi-level_Security_and_Costs","260357977_A_Truthful_Dynamic_Workflow_Scheduling_Mechanism_for_Commercial_Multicloud_Environments"]}