{"id":"276161656_An_empirical_study_on_the_importance_of_source_code_entities_for_requirements_traceability","abstract":"Requirements Traceability (RT) links help developers during program comprehension and maintenance tasks. However, creating RT links is a laborious and resource-consuming task. Information Retrieval (IR) techniques are useful to automatically create traceability links. However, IR-based techniques typically have low accuracy (precision, recall, or both) and thus, creating RT links remains a human intensive process. We conjecture that understanding how developers verify RT links could help improve the accuracy of IR-based RT techniques to create RT links. Consequently, we perform an empirical study consisting of four case studies. First, we use an eye-tracking system to capture developers’ eye movements while they verify RT links. We analyse the obtained data to identify and rank developers’ preferred types of Source Code Entities (SCEs), e.g., domain vs. implementation-level source code terms and class names vs. method names. Second, we perform another eye-tracking case study to confirm that it is the semantic content of the developers’ preferred types of SCEs and not their locations that attract developers’ attention and help them in their task to verify RT links. Third, we propose an improved term weighting scheme, i.e., Developers Preferred Term Frequency/Inverse Document Frequency (D P T F / I D F), that uses the knowledge of the developers’ preferred types of SCEs to give more importance to these SCEs into the term weighting scheme. We integrate thisweighting scheme with an IR technique, i.e., Latent Semantic Indexing (LSI), to create a new technique to RT link recovery. Using three systems (iTrust, Lucene, and Pooka), we show that the proposed technique statistically improves the accuracy of the recovered RT links over a technique based on LSI and the usual Term Frequency/Inverse Document Frequency (T F / I D F) weighting scheme. Finally, we compare the newly proposed D P T F / I D F with our original Domain Or Implementation/Inverse Document Frequency (D O I / I D F) weighting scheme.","authors":["Nasir Ali","Zohreh Sharafi","Yann-Gaël Guéhéneuc","Giuliano Antoniol"],"meta":["April 2014Empirical Software Engineering 20(2):442-478","DOI:10.1007/s10664-014-9315-y"],"references":["285445167_Factors_Impacting_the_Inputs_of_Traceability_Recovery_Approaches","262763337_Cliff's_Delta_Calculator_A_non-parametric_effect_size_program_for_two_groups_of_observations","261416893_An_empirical_study_on_requirements_traceability_using_eye-tracking","260648762_Trustrace_Mining_Software_Repositories_to_Improve_the_Accuracy_of_Requirement_Traceability_Links","259580948_An_exploratory_study_of_feature_location_process_Distinct_phases_recurring_patterns_and_elementary_actions","259362438_An_Empirical_Study_on_Requirements_Traceability_Using_Eye-Tracking","259118316_TAUPE_Visualizing_and_analyzing_eye-tracking_data","321502252_Treatise_on_Basic_Philosophy","319394669_An_Analysis_of_the_requirements_Traceability_Problem","285714412_Information_Retrieval_Methods_for_Automated_Traceability_Recovery"]}