{"id":"276148313_Understanding_the_Psychology_of_Bullying_Moving_Toward_a_Social-Ecological_Diathesis-Stress_Model","abstract":"With growing recognition that bullying is a complex phenomenon, influenced by multiple factors, research findings to date have been understood within a social-ecological framework. Consistent with this model, we review research on the known correlates and contributing factors in bullying/victimization within the individual, family, peer group, school and community. Recognizing the fluid and dynamic nature of involvement in bullying, we then expand on this model and consider research on the consequences of bullying involvement, as either victim or bully or both, and propose a social-ecological, diathesis-stress model for understanding the bullying dynamic and its impact. Specifically, we frame involvement in bullying as a stressful life event for both children who bully and those who are victimized, serving as a catalyst for a diathesis-stress connection between bullying, victimization, and psychosocial difficulties. Against this backdrop, we suggest that effective bullying prevention and intervention efforts must take into account the complexities of the human experience, addressing both individual characteristics and history of involvement in bullying, risk and protective factors, and the contexts in which bullying occurs, in order to promote healthier social relationships. (PsycINFO Database Record\n(c) 2015 APA, all rights reserved).","authors":["Susan M Swearer","Shelley Hymel"],"meta":["May 2015American Psychologist 70(4):344-353","DOI:10.1037/a0038929","SourcePubMed"],"references":["299566800_Bullying_and_morality_Understanding_how_good_kids_can_behave_badly","285466908_Part_of_the_solution_and_part_of_the_problem_The_role_of_peers_in_bullying_dominance_and_victimization_during_the_transition_from_primary_school_through_secondary_school","313694023_From_psychological_stress_to_the_emotions_A_history_of_changing_outlooks","313532748_Peer_ecologies_of_aggression_and_bullying","312622513_A_social_cognitive_perspective_on_peer_aggression_and_victimization","308525829_Childhood_mood_disorders","306275224_Family_relationships_of_bullies_and_victims","284844752_Peer_processes_in_bullying_Informing_prevention_and_intervention_strategies","284588374_Cognitions_Stress_and_Depression_in_Children_and_Adolescents","284503239_Parent-child_relationships_and_bullying"]}