{"id":"276185309_RESEARCH_ON_SECURITY_REQUIREMENTS_ENGINEERING_PROBLEMS_AND_PROSPECTS","abstract":"Due to constant pressure on software development\nteam for development of workable software at a fast pace, the\nfocus of the development team has always been on the\nfunctional requirements. As such, the identification and\nimplementation of nonfunctional requirements, especially,\nsecurity which otherwise is considered as a time consuming\nand quality providing process has always been neglected. But\nas per the available statistics, security has played a vital role in\nthe success and failure of software systems. The nonfunctional\nrequirement not only introduces characteristics like quality,\nthey also present constraints under which the system must\noperate. This process maximizes the success of the software\nsystem. As per the recent trend, software security is gaining\nattention from the industries, experts and research\ncommunities. The aim of development of secure software is\nthat it attempts to mitigate risks from assets so that the\nbusiness goals could be achieved. Measuring security of\nsoftware is still in its infancy and the properties and metrics\nfor measuring security needs to be properly defined. Further,\nmethods need to be made comprehensive for accurate and\ncomplete measurement of security properties of software. This\nresearch paper reviews the existing work done in the field of\nsecurity requirements engineering. In addition, it identifies the\nfuture research work which could be carried out for\nbetterment of security incorporation in the software\ndevelopment process.","authors":["Drchitreshh Banerjee","Megha Sharma","Arpita Banerjee","Santosh K Pandey"],"meta":["April 2015"],"references":["253133430_A_Survey_of_Non-Functional_Requirements_in_Software_Development_Process","220631717_Research_on_software_security_awareness_problems_and_prospects","220631656_Security_quality_requirements_engineering_SQUARE_methodology","220428145_A_vulnerability-centric_requirements_engineering_framework_analyzing_security_attacks_countermeasures_and_requirements_based_on_vulnerabilities","44261703_Security_Requirements_Engineering_State_of_the_Art_and_Research_Challenges","40423042_Software_Security_Rules_SDLC_Perspective","246548344_Survey_and_analysis_on_Security_Requirements_Engineering","232633130_Security_Requirements_Engineering_A_Framework_for_Representation_and_Analysis","220428102_A_Comparison_of_Security_Requirements_Engineering_Methods"]}