{"id":"276151911_Hybrid_Fuzzy-ontology_Design_Using_FCA_Based_Clustering_for_Information_Retrieval_in_Semantic_Web","abstract":"Ontology is a way to represent the domain knowledge into a human understandable and machine readable format. It is used as one of the major knowledge representation mechanism for semantic web. Introducing the ontology knowledge provides more relevant search results for the users information need. To deal with uncertain information, the mechanism supported by the regular ontology may not be adequate and the requirement for new technique arises. Fuzzy based methods are the proven methods to interpret the uncertain information. The combination of Fuzzy and Ontology based information retrieval provides better results as they mainly deal with the semantics and the uncertainty of information. Keyword matching is one another widely used method which matches the input keywords with the existing information domain to find the best match results. When the input queries are complex the fuzzy ontology based information retrieval which respects the user's keyword and the domain produces more accurate results. This work enlarges the fuzzy ontology knowledge results along with the input queries and keyword matching. The given algorithm is a hybrid technique based on matching extracted instances from the input queries and in information domain. Overall, compared to the existing query models supported by fuzzy ontology or keyword based models the hybrid ontology with keyword matching is sufficient and easy way to retrieve the documents in semantic web. The performance of the hybrid ontology approach is measured using improved precision, recall and f-measure values.","authors":["K. Balasubramaniam"],"meta":["December 2015Procedia Computer Science 50","DOI:10.1016/j.procs.2015.04.075"],"references":["261182515_Information_Retrieval_IR_through_Semantic_Web_SW_An_Overview","257404116_A_Conceptual_Representation_of_Documents_and_Queries_for_Information_Retrieval_Systems_by_Using_Light_Ontologies","221466518_Ontology-Based_Interpretation_of_Keywords_for_Semantic_Search","288260623_Ontology_learning_process_using_fuzzy_formal_concept_analysis","272202388_Fuzzy_Ontology-Based_Approach_for_Automatic_Construction_of_User_Profiles","260324688_Ontology_Matching_State_of_the_Art_and_Future_Challenges","258312308_Automatic_ontology_generation_for_data_mining_using_fca_and_clustering","223699474_Ontology_refinement_for_improved_information_retrieval","223449903_A_new_taxonomy_of_sublinear_right-to-left_scanning_keyword_pattern_matching_algorithms","222839450_Markov_network_based_ontology_matching"]}