{"id":"276155721_Governing_the_smart_city_a_review_of_the_literature_on_smart_urban_governance","abstract":"Academic attention to smart cities and their governance is growing rapidly, but the fragmentation in approaches makes for a confusing debate. This article brings some structure to the debate by analyzing a corpus of 51 publications and mapping their variation. The analysis shows that publications differ in their emphasis on (1) smart technology, smart people or smart collaboration as the defining features of smart cities, (2) a transformative or incremental perspective on changes in urban governance, (3) better outcomes or a more open process as the legitimacy claim for smart city governance. We argue for a comprehensive perspective: smart city governance is about crafting new forms of human collaboration through the use of ICTs to obtain better outcomes and more open governance processes. Research into smart city governance could benefit from previous studies into success and failure factors for e-government and build upon sophisticated theories of socio-technical change. This article highlights that smart city governance is not a technological issue: we should study smart city governance as a complex process of institutional change and acknowledge the political nature of appealing visions of socio-technical governance.\n\nPoints for practitioners\nThe study provides practitioners with an in-depth understanding of current debates about smart city governance. The article highlights that governing a smart city is about crafting new forms of human collaboration through the use of information and communication technologies. City managers should realize that technology by itself will not make a city smarter: building a smart city requires a political understanding of technology, a process approach to manage the emerging smart city and a focus on both economic gains and other public values.","authors":["Albert Meijer","Manuel Pedro Rodríguez Bolívar"],"meta":["April 2015International Review of Administrative Sciences 82(2)","DOI:10.1177/0020852314564308","Project: Smart Cities. E-Participation. Web 2.0 and Financial Sustainability in Governments"],"references":["278658877_Lecture_Notes_in_Computer_Science","346545342_Making_the_Digital_City","323322037_The_Rise_of_the_Creative_Class_And_How_It's_Transforming_Work_Leisure_Community_and_Everyday_Life","315497736_Enacting_Electronic_Government_Success","303135282_American_Political_Science_Review","301115257_Smart_Cities_and_Urban_Networks","292724494_Governance_in_the_digital_economy","289353824_If_Mayors_Ruled_the_World_Dysfunctional_Nations_Rising_Cities","286355568_Interactive_Governance_Advancing_the_Paradigm","273373666_The_Art_of_City_Making"]}