{"id":"276245114_Improving_Mass_Transit_Operations_by_Using_AVL-Based_Systems_A_Survey","abstract":"Intelligent transportation systems based on automated data collection frameworks are widely used by the major transit companies around the globe. This paper describes the current state of the art on improving both planning and control on public road transportation companies using automatic vehicle location (AVL) data. By surveying this topic, the expectation is to help develop a better understanding of the nature, approaches, challenges, and opportunities with regard to these problems. This paper starts by presenting a brief review on improving the network definition based on historical location-based data. Second, it presents a comprehensive review on AVL-based evaluation techniques of the schedule plan (SP) reliability, discussing the existing metrics. Then, the different dimensions on improving the SP reliability are presented in detail, as well as the works addressing such problem. Finally, the automatic control strategies are also revised, along with the research employed over the location-based data. A comprehensive discussion on the techniques employed is provided to encourage those who are starting research on this topic. It is important to highlight that there are still gaps in AVL-based literature, such as the following: 1) long-term travel time prediction; 2) finding optimal slack time; or 3) choosing the best control strategy to apply in each situation in the event of schedule instability. Hence, this paper includes introductory model formulations, reference surveys, formal definitions, and an overview of a promising area, which is of interest to any researcher, regardless of the level of expertise.","authors":["Luis Moreira-Matias","João Mendes Moreira","Jorge Freire de Sousa","João Gama"],"meta":["July 2015IEEE Transactions on Intelligent Transportation Systems 16(4):1636 - 1653","DOI:10.1109/TITS.2014.2376772","Project: Online approaches to control Public Transport operations in real-time"],"references":["309185766_Support_vector_regression_machines","306527837_Online_bus_arrival_time_prediction_using_hybrid_neural_network_and_Kalman_filter_techniques","331518644_Forecasting_seasonals_and_trends_by_exponentially_weighted_moving_averages","314154569_Optimal_coordination_of_public-transit_vehicles_using_operational_tactics_examined_by_simulation","313528056_On_estimating_regression","312900100_Pattern_recognition_with_fuzzy_objective_function_algorithms_Kluwer_Academic","310480573_Non-normality_and_tests_on_variances","308749023_Public_Transit_Planning_and_Operation_Theory_Modeling_and_Practice","307717092_The_theory_of_algorithms","292859876_Strategies_for_improving_reliability_of_bus_transit_service"]}