{"id":"276229909_Addressing_the_challenges_of_a_new_digital_technologies_curriculum_MOOCs_as_a_scalable_solution_for_teacher_professional_development","abstract":"England and Australia have introduced new learning areas, teaching computer science to children from the first year of school. This is a significant milestone that also raises a number of big challenges: the preparation of teachers and the development of resources at a national scale. Curriculum change is not easy for teachers, in any context, and to ensure teachers are supported, scaled solutions are required. One educational approach that has gained traction for delivering content to large-scale audiences are massively open online courses (MOOCs); however, little is known about what constitutes effective MOOC design, particularly within professional development contexts. To prepare teachers in Australia, we decided to ride the wave of MOOCs, developing a MOOC to deliver free computing content and pedagogy to teachers with the integration of social media to support knowledge exchange and resource building. The MOOC was designed to meet teacher needs, allowing for flexibility, ad-hoc interactions, support and the open sharing of resources. In this paper, we describe the process of developing our initiative, participant engagement and experiences, so that others encountering similar changes and reforms may learn from our experience.","authors":["Rebecca Vivian","Katrina Falkner","Nickolas Falkner"],"meta":["August 2014Research in Learning Technology 22","DOI:10.3402/rlt.v22.24691"],"references":["295400457_Rethinking_pedagogy_for_a_digital_age_designing_for_21st_Century_Learning","277060958_The_Technological_Dimension_of_a_Massive_Open_Online_Course_The_Case_of_the_CCK08_Course_Tools","266224111_Exploring_the_MOOC_format_as_a_pedagogical_approach_for_mLearning","264978853_The_Australian_Digital_Technologies_Curriculum_Challenge_and_Opportunity","262166570_Experiences_in_Computer_Science_Wonderland_A_Success_Story_with_Alice","287763143_Learning_Theory_and_Online_Technologies","285837006_Computer_science_outreach_in_an_elementary_school","272298982_HarvardX_and_MITx_The_First_Year_of_Open_Online_Courses_Fall_2012-Summer_2013","263308228_Teachers'_perceptions_of_the_recent_curriculum_reforms_and_their_implementation_What_can_we_learn_from_the_case_of_Korean_elementary_teachers","258422618_The_pedagogical_foundations_of_massive_open_online_courses_First_Monday"]}