{"id":"276254601_Solving_Uncompromising_Problems_With_Lexicase_Selection","abstract":"We describe a broad class of problems, called “uncompromising problems,” characterized by the requirement that solutions must perform optimally on each of many test cases. Many of the problems that have long motivated genetic programming research, including the automation of many traditional programming tasks, are uncompromising. We describe and analyze the recently proposed “lexicase” parent selection algorition and show that it can facilitate the solution of uncompromising problems by genetic programming. Unlike most traditional parent selection techniques, lexicase selection does not base selection on a fitness value that is aggregated over all test cases; rather, it considers test cases one at a time in random order. We present results comparing lexicase selection to more traditional parent selection methods, including standard tournament selection and implicit fitness sharing, on four uncompromising problems: finding terms in finite algebras, designing digital multipliers, counting words in files, and performing symbolic regression of the factorial function. We provide evidence that lexicase selection maintains higher levels of population diversity than other selection methods, which may partially explain its utility as a parent selection algorithm in the context of uncompromising problems.","authors":["Thomas Helmuth","Lee Spector","James Matheson"],"meta":["January 2014IEEE transactions on neural networks / a publication of the IEEE Neural Networks Council 19(5):1-1","DOI:10.1109/TEVC.2014.2362729"],"references":["264906070_Algebras_lattices_varieties_Volume_I","312998983_Genetic_algorithms_with_sharing_for_multimodal_function_optimization","300830841_Uniform_Linear_Transformation_with_Repair_and_Alternation_in_Genetic_Programming","294695930_Advances_in_Genetic_Programming","281266055_No_Free_Lunch_Theorems_for_Optimization","274316004_Genetic_Algorithms_with_Sharing_for_Multi-modal_Function_Optimization","269352615_An_Investigation_of_Fitness_Sharing_in_Genetic_Programming","266656284_Word_count_as_a_traditional_programming_benchmark_problem_for_genetic_programming","262215718_Evolving_a_digital_multiplier_with_the_PushGP_genetic_programming_system","254461778_Assessment_of_problem_modality_by_differential_performance_of_lexicase_selection_in_genetic_programming_A_preliminary_report"]}