{"id":"276298496_RSS-Based_Localization_in_Wireless_Sensor_Networks_Using_Convex_Relaxation_Noncooperative_and_Cooperative_Schemes","abstract":"In this paper, we propose new approaches based on convex optimization to address the received signal strength (RSS)-based noncooperative and cooperative localization problems in wireless sensor networks (WSNs). By using an array of passive anchor nodes, we collect the noisy RSS measurements from radiating source nodes in WSNs, which we use to estimate the source positions. We derive the maximum likelihood (ML) estimator, since the ML-based solutions have particular importance due to their asymptotically optimal performance. However, the ML estimator requires the minimization of a nonconvex objective function that may have multiple local optima, thus making the search for the globally optimal solution hard. To overcome this difficulty, we derive a new nonconvex estimator, which tightly approximates the ML estimator for small noise. Then, the new estimator is relaxed by applying efficient convex relaxations that are based on second-order cone programming and semidefinite programming in the case of noncooperative and cooperative localization, respectively, for both cases of known and unknown source transmit power. We also show that our approaches work well in the case when the source transmit power and the path loss exponent are simultaneously unknown at the anchor nodes. Moreover, we show that the generalization of the new approaches for the localization problem in indoor environments is straightforward. Simulation results show that the proposed approaches significantly improve the localization accuracy, reducing the estimation error between 15% and 20% on average, compared with the existing approaches.","authors":["Slavisa Tomic","Marko Beko","Rui Dinis"],"meta":["May 2015IEEE Transactions on Vehicular Technology 64(5):2037-2050","DOI:10.1109/TVT.2014.2334397"],"references":["260637176_Cooperative_Received_Signal_Strength-Based_Sensor_Localization_With_Unknown_Transmit_Powers","259978472_Non-Line-of-Sight_Node_Localization_Based_on_Semi-Definite_Programming_in_Wireless_Sensor_Networks","309078774_The_Use_of_RTOF_and_RSS_for_a_one_base_station_RFID_system","287613683_Ultra-wideband_positioning_systems_Theoretical_limits_ranging_algorithms_and_protocols","265502195_Interior_Point_Methods_for_Nonlinear_Optimization","263565690_Implementation_of_Interior_Point_Methods_for_Mixed_Semidefinite_and_Second_Order_Cone_Optimization_Problems","263447722_Localization_of_wireless_sensor_networks_with_a_mobile_beacon","261041935_RSS-based_localization_in_wireless_sensor_networks_using_SOCP_relaxation","260711046_Cooperative_Positioning_for_Vehicular_Networks_Facts_and_Future","259997725_On_Received-Signal-Strength_Based_Localization_with_Unknown_Transmit_Power_and_Path_Loss_Exponent"]}