{"id":"276246938_Cognitive_Validity_of_a_Causal_Value_Function_with_Loose_Symmetry_and_Its_Effectiveness_for_N-armed_Bandit_Problems","abstract":"Cognitive psychology and behavioral economics have shown that humans have cognitive biases that deviate from normative systems such as classical logic and probability theory. Considering that humans have the ability to understand the world from sparse and/or imprecise data, it is natural to assume that the biases in human have some ecological merits in adaptation. We focus on two cognitive biases, symmetry and mutual exclusivity, that are considered peculiar to human. In this study, with the framework of empirical Bayes, we clarify the implication of a model of human causal cognition, the loosely symmetric (LS) model [Shinohara 07]) that implements the cognitive biases. We show that LS has great descriptive validity in inductive inference of causal relationship (causal induction) with a meta-analysis and an experiment in causal induction. The result of another experiment strongly suggests that humans use the inductively inferred causal relationship to decision-making. Then we show that LS effectively works in sequential decision-making under uncertainty (N-armed bandit problems). Operating LS as a simple value function under the greedy method in the framework of reinforcement learning, we analyze its behavior in terms of cognitive biases or heuristics under uncertainty. The three cognitive properties resulting from the loose symmetry, comparative valuation, satisficing, and prospect theory-like risk attitudes, are shown to be the key of the performance of LS. We parameterize the reference for satisficing and show that the quite intuitive parameter enables optimization.","authors":["Kuratomo Oyo","Manabu Ichino","Tatsuji Takahashi"],"meta":["January 2015Transactions of the Japanese Society for Artificial Intelligence 30(2):403-416","DOI:10.1527/tjsai.30.403"],"references":["309107324_The_Equiprobability_Hypothesis_of_Reasoning_and_Judgment_Symmetry_in_Thinking_and_its_Adaptive_Implications","285863720_Cognitive_symmetries_as_bases_for_anticipation_A_model_of_Vygotskyan_development_applied_to_word_learning","285850238_Cognitive_Symmetry_Illogical_but_Rational_Biases","275865560_A_Melody_Generation_System_Based_on_Cognitive_Biases_in_Causal_Inference_by_Human","275541351_A_Cognitively_Inspired_Heuristic_for_Two-armed_Bandit_Problems_The_Loosely_Symmetric_LS_Model","312907789_Ant_system_Optimization_by_a_colony_of_cooperating_agents","288417614_Adaptive_Thinking_Rationality_in_the_Real_World","287100829_'Bayesian_models_of_cognition'","286270780_Judgment_Under_Uncertainty_Heuristics_and_Biases","275697437_Causality_Models_Reasoning_and_Inference"]}