{"id":"276396779_Diagnosis_of_Time_Petri_Nets_Using_Fault_Diagnosis_Graph","abstract":"This paper proposes an online approach for fault diagnosis of timed discrete event systems modeled by Time Petri Net (TPN). The set of transitions is partitioned into two subsets containing observable and unobservable transitions, respectively. Faults correspond to a subset of unobservable transitions. In accordance with most of the literature on discrete event systems, we define three diagnosis states, namely normal, faulty and uncertain states, respectively. The proposed approach uses a fault diagnosis graph, which is incrementally computed using the state class graph of the unobservable TPN. After each observation, if the part of FDG necessary to compute the diagnosis states is not available, the state class graph of the unobservable TPN is computed starting from the consistent states. This graph is then optimized and added to the partial FDG keeping only the necessary information for computation of the diagnosis states. We provide algorithms to compute the FDG and the diagnosis states. The method is implemented as a software package and simulation results are included.","authors":["Xu Wang","Cristian Mahulea","Manuel Silva"],"meta":["September 2015IEEE Transactions on Automatic Control 60(9):1-1","DOI:10.1109/TAC.2015.2405293"],"references":["278695284_The_On-Line_Diagnosis_of_Time_Petri_Nets","277958228_Molecular_and_Cellular_Therapies_New_challenges_and_opportunities","285459567_ERROR_DETECTION_AND_CORRECTION_ON_PETRI_NET_MODELS_OF_DISCRETE_EVENTS_CONTROL_SYSTEMS","271549665_Design_of_observations_graphs_for_partially_observed_Petri_nets_Application_to_the_diagnosability_analysis_of_DES1","271475609_Model_Checking_on_Fault_Diagnosis_Graph","270285420_modelling_and_verication_of_time_dependant_systems_using_time_petri_nets","269075140_On_State_Estimation_of_Timed_Choice-Free_Petri_Nets","261448622_Fault_Diagnosis_Graph_of_time_Petri_nets","261321153_Marking_estimation_of_Time_Petri_nets_with_unobservable_transitions","261321152_Decentralized_diagnosis_based_on_fault_diagnosis_graph"]}