{"id":"276384653_Downward_Lowenheim-Skolem_Theorem_and_interpolation_in_logics_with_constructors","abstract":"The present article describes a method for proving Downward Löwenheim–Skolem Theorem within an arbitrary institution satisfying\ncertain logic properties. In order to demonstrate the applicability of the present approach, the abstract results are instantiated\nto many-sorted first-order logic and preorder algebra. In addition to the first technique for proving Downward Löwenheim–Skolem\nTheorem, another one is developed, in the spirit of institution-independent model theory, which consists of borrowing the\nresult from a simpler institution across an institution comorphism. As a result, the Downward Löwenheim–Skolem Property is\nexported from first-order logic to partial algebras, and from higher-order logic with intensional Henkin semantics to higher-order\nlogic with extensional Henkin semantics. The second method successfully extends the domain of application of Downward Löwenheim–Skolem\nTheorem to other non-conventional logical systems for which the first technique may fail. One major application of Downward\nLöwenheim–Skolem Theorem is interpolation in constructor-based logics with universally quantified sentences. The interpolation\nproperty is established by borrowing it from a base institution for its constructor-based variant across an institution morphism.\nThis result is important as interpolation for constructor-based first-order logics is still an open problem.","authors":["Daniel Găină"],"meta":["May 2015Journal of Logic and Computation 27(6)","DOI:10.1093/logcom/exv018","Projects: The relationship between gaining expressive power in extending first-order logics and losing “control” over the extensionConstructor-based logics"],"references":["263738843_Initial_semantics_in_logics_with_constructors","263735026_Constructor-Based_Inductive_Theorem_Prover","263734995_Constructor-based_Logics","258167173_Forcing_Downward_Lowenheim-Skolem_and_Omitting_Types_Theorems_Institutionally","257145353_Interpolation_in_logics_with_constructors","233833149_Institution-independent_Ultraproducts","265354140_Categories_for_the_working_mathematician_2nd_ed","265351414_CafeOBJ_Report_The_language_proof_techniques_and_methodologies_for_object-oriented_algebraicspecification","243675425_Membership_algebra_as_a_semantic_framework_for_equational_specification","233851660_Institution-independent_Model_Theory"]}