{"id":"276369577_Cultural_Dynamics_Deep_Time_and_Data_Planning_Cyberinfrastructure_Investments_for_Archaeology","abstract":"Archaeological data and research results are essential to addressing such fundamental questions as the origins of human culture; the origin, waxing, and waning of civilizations and cities; the response of societies to long-term climate changes; and the systemic relationships implicated in human-induced changes in the environment. However, we lack the capacity for acquiring, managing, analyzing, and synthesizing the data sets needed to address important questions such as these. We propose investments in computational infrastructure that would transform archaeology’s ability to advance research on the field’s most compelling questions with an evidential base and inferential rigor that have heretofore been impossible. At the same time, new infrastructure would make archaeological data accessible to researchers in other disciplines. We offer recommendations regarding data management and availability, cyberinfrastructure tool building, and social and cultural changes in the discipline. We propose funding synthetic case studies that would demonstrate archaeology’s ability to contribute to transdisciplinary research on long-term social dynamics and serve as a context for developing computational tools and analytical workflows that will be necessary to attack these questions. The case studies would explore how emerging research in computer science could empower this research and would simultaneously provide productive challenges for computer science research.","authors":["Keith W. Kintigh","Jeffrey H Altschul","Ann P. Kinzig","W. Fredrick Limp"],"meta":["February 2015Advances in Archaeological Practice 3(1):1-15","DOI:10.7183/2326-3768.3.1.1"],"references":["313121741_Merging_Taxonomies_under_RCC-5_Algebraic_Articulations","315180101_The_City_in_History_Its_Origins_Its_Transformations_and_Its_Prospects","314551828_Collapse_How_Societies_Choose_to_Fail_or_Succeed","304380808_The_Role_of_Ancient_Cities_in_Research_on_Contemporary_Urbanization","300329974_Ecology_Reconfigured_Organizational_Innovation_Group_Dynamics_and_Scientific_Change","288476262_Deep_sides_of_archaeological_relevance","287978055_The_Model-Based_Archaeology_of_Socionatural_Systems","286169196_The_Cross-scale_Interplay_between_Social_and_Biophysical_Context_and_the_Vulnerability_of_Irrigation-dependent_Societies_Archaeology's_Long-term_Perspective","285941824_Emergence_and_collapse_of_early_villages_Models_of_central_Mesa_Verde_archaeology","279951150_Nongeospatial_metadata_for_ecology"]}