{"id":"276422223_Heuristic_and_Exact_Algorithms_for_the_Interval_Min-Max_Regret_Knapsack_Problem","abstract":"We consider a generalization of the 0-1 knapsack problem in which the profit of each item can take any value in a range characterized by a minimum and a maximum possible profit. A set of specific profits is called a scenario. Each feasible solution associated with a scenario has a regret, given by the difference between the optimal solution value for such scenario and the value of the considered solution. The interval min-max regret knapsack problem (MRKP) is then to find a feasible solution such that the maximum regret over all scenarios is minimized. The problem is extremely challenging both from a theoretical and a practical point of view. Its decision version is complete for the second level of the polynomial hierarchy hence it is most probably not in NP. In addition, even computing the regret of a solution with respect to a scenario requires the solution of an NP-hard problem. We examine the behavior of classical combinatorial optimization approaches when adapted to the solution of the MRKP. We introduce an iterated local search approach and a Lagrangian-based branch-and-cut algorithm and evaluate their performance through extensive computational experiments.","authors":["Fabio Furini","Manuel Iori","Silvano Martello","Mutsunori Yagiura"],"meta":["April 2015Informs Journal on Computing 27(2):392-405","DOI:10.1287/ijoc.2014.0632"],"references":["316799349_Springer_Series_in_Operations_Research_and_Financial_Engineering","288961037_Robust_discrete_optimization_and_network_flows","278690128_Knapsack_Problems","243776533_Robust_Discrete_Optimization_and_Its_Applications","242932538_On_the_Max-Min_0-1_Knapsack_Problem_with_Robust_Optimization_Applications","228057894_Computational_Complexity","228057735_Computers_And_Intractability_A_Guide_to_the_Theory_of_NP-Completeness","227447203_Dynamic_Programming_and_Strong_Bounds_for_the_0-1_Knapsack_Problem","225574248_On_the_complexity_of_a_class_of_combinatorial_optimization_problems_with_uncertainty","225444452_The_Robust_Set_Covering_Problem_with_interval_data"]}