{"id":"276422351_Using_dynamic_time_warping_distances_as_features_for_improved_time_series_classification","abstract":"Dynamic time warping (DTW) has proven itself to be an exceptionally strong distance measure for time series. DTW in combination with one-nearest neighbor, one of the simplest machine learning methods, has been difficult to convincingly outperform on the time series classification task. In this paper, we present a simple technique for time series classification that exploits DTW’s strength on this task. But instead of directly using DTW as a distance measure to find nearest neighbors, the technique uses DTW to create new features which are then given to a standard machine learning method. We experimentally show that our technique improves over one-nearest neighbor DTW on 31 out of 47 UCR time series benchmark datasets. In addition, this method can be easily extended to be used in combination with other methods. In particular, we show that when combined with the symbolic aggregate approximation (SAX) method, it improves over it on 37 out of 47 UCR datasets. Thus the proposed method also provides a mechanism to combine distance-based methods like DTW with feature-based methods like SAX. We also show that combining the proposed classifiers through ensembles further improves the performance on time series classification.","authors":["Rohit Kate"],"meta":["May 2015Data Mining and Knowledge Discovery 30(2)","DOI:10.1007/s10618-015-0418-x"],"references":["268446135_Time_series_classification_with_ensembles_of_elastic_distance_measures","308161218_Introduction_to_information_retrieval_chapt","307881957_LIBSVM_A_library_for_support_vector_machines","298606994_Ensemble_methods_in_machine_learning","290824136_Pattern_extraction_for_time_series_classification","276935841_Introduction_to_Information_Retrieval","275574898_Querying_and_mining_of_time_series_data","272623654_Libsvm","270723186_Automated_Feature_Design_for_Numeric_Sequence_Classification_by_Genetic_Programming","265831163_Evaluating_Learning_Algorithms_A_Classification_Perspective"]}