{"id":"276441411_Systematic_inequality_and_hierarchy_in_faculty_hiring_networks","abstract":"The faculty job market plays a fundamental role in shaping research priorities, educational outcomes, and career trajectories among scientists and institutions. However, a quantitative understanding of faculty hiring as a system is lacking. Using a simple technique to extract the institutional prestige ranking that best explains an observed faculty hiring network-who hires whose graduates as faculty-we present and analyze comprehensive placement data on nearly 19,000 regular faculty in three disparate disciplines. Across disciplines, we find that faculty hiring follows a common and steeply hierarchical structure that reflects profound social inequality. Furthermore, doctoral prestige alone better predicts ultimate placement than a U.S. News & World Report rank, women generally place worse than men, and increased institutional prestige leads to increased faculty production, better faculty placement, and a more influential position within the discipline. These results advance our ability to quantify the influence of prestige in academia and shed new light on the academic system.","authors":["Aaron Clauset","Samuel Arbesman","Daniel B Larremore"],"meta":["February 2015Science Advances 1(1):e1400005-e1400005","DOI:10.1126/sciadv.1400005"],"references":["261838322_Career_on_the_Move_Geography_Stratification_and_Scientific_Impact","257069407_Structure_and_dynamics_of_core-periphery_networks","344713686_An_Introduction_to_the_Bootstrap","313054334_Back_to_Bentham","304848848_An_Evolutionary_Approach_to_Norms","280566512_Networks_An_Introduction","279341287_US_News_World_Report_College_Ranking_Modeling_Institutional_Effects_on_Organizational_Reputation","264920260_Networks_An_Introduction","262319902_A_Critical_Point_for_Random_Graphs_with_a_Given_Degree_Sequence","258186601_The_Matilda_Effect_in_Science_Communication_An_Experiment_on_Gender_Bias_in_Publication_Quality_Perceptions_and_Collaboration_Interest"]}