{"id":"276512165_Evolutionary_Schema_of_Modeling_Based_on_Genetic_Algorithms","abstract":"In this paper, I propose a populational schema of modeling that consists of: (a) a linear AFSV schema (with four basic stages of abstraction, formalization, simplification, and verification), and (b) a higher-level schema employing the genetic algorithm (with partially random procedures of mutation, crossover, and selection). The basic ideas of the proposed solution are as follows: (1) whole populations of models are considered at subsequent stages of the modeling process, (2) successive populations are subjected to the activity of genetic operators and undergo selection procedures, (3) the basis for selection is the evaluation function of the genetic algorithm (this function corresponds to the model verification criterion and reflects the goal of the model). The schema can be applied to automate the modeling of the mind/brain by means of artificial neural networks: the structure of each network is modified by genetic operators, modified networks undergo a learning cycle, and successive populations of networks are verified during the selection procedure. The whole process can be automated only partially, because it is the researcher who defines the evaluation function of the genetic algorithm.","authors":["Paweł Stacewicz"],"meta":["April 2015Studies in Logic 40(1)","DOI:10.1515/slgr-2015-0011"],"references":["236035176_Modeling_in_the_Context_of_Computer_Science_-_A_Methodological_Approach","341438036_Neurophilosophy_Toward_a_Unified_Science_of_the_Mind-Brain","313706874_Adaptation_in_natural_and_artificial_systems","283996103_Genetic_Algorithms_In_Search_Optimization_and_Machine_Learning","272161464_Artificial_Intelligence_A_Modern_Approach_Second_Edition","253128746_The_Significance_of_the_Evaluation_Function_in_Evolutionary_Algorithms","247935382_Knowledge_and_the_Body-Mind_Problem_In_Defence_of_Interaction","246528594_Introduction_to_Neural_Artificial_Systems","246309479_Genetic_Programs_Data_Structures_Evolution_Programs","242356870_Adaptation_In_Natural_And_Artificial_Systems"]}