{"id":"276530319_Towards_to_an_Bio-inspired_Orchestration_of_Mobile_Learning_Activities","abstract":"This paper presents a new approach to a recommendation of learning activities adapted to the spatial and temporal context of each mobile learner. Indeed, the path traveled by the user during a field trip can be guided using the technique of passivecollaborative filtering. This recommendation is based on the ACO (Ant Colony Optimization) algorithm, which represents a good model for swarm intelligence. For this reason, the structure of our mobile scenario is described as a graph where POIs (Point Of Interest) are represented by nodes and the arcs indicate the probability of moving between them. This recommendation system allows the orchestration of mobile learning according to the geographical location of learners and the historical of their activities. Our contribution is devised in three parts: (1) the creation of a mobile learning scenario based on POIs, (2) the adaptation of the ACO algorithm for the orchestration of paths taken by learners, and (3) the development of a recommender system that helps learners to better choose their paths during the field trip.","authors":["Nassim Dennouni","Yvan Peter","Luigi Lancieri","Zohra Slama"],"meta":["April 2015International Journal of Modern Education and Computer Science 7(4):1-11","DOI:10.5815/ijmecs.2015.04.01","Project: ad hoc environment for the collection and capitalization of human interactions"],"references":["279577170_Seamless_connection_between_learning_and_assessment-_applying_progressive_learning_tasks_in_mobile_ecology_inquiry","269651846_Bio-inspired_Ant_Algorithms_A_review","262573813_To_a_Geographical_Orchestration_of_Mobile_Learning_Activities","262351020_An_Approach_to_Social_Recommendation_for_Context-Aware_Mobile_Services","236124970_Probabilistic_sequential_POIs_recommendation_via_check-in_data","235439153_Ant_sytem_Optimization_by_a_colony_of_cooperating_agents","313311374_State-of-the-art_recommender_systems","312907789_Ant_system_Optimization_by_a_colony_of_cooperating_agents","262160656_Recommending_suitable_learning_scenarios_according_to_learners'_preferences_An_improved_swarm_based_approach","255564551_Towards_Mobile_Intelligence_Learning_from_GPS_History_Data_for_Collaborative_Recommendation"]}