{"id":"276758941_The_avignon_bridge_A_3D_reconstruction_project_integrating_archaeological_historical_and_gemorphological_issues","abstract":"The history and identity of the Avignon’s bridge is inseparable from that of the Rhône river. Therefore, in order to share the history and memory of the Rhône, it is essential to get to know this bridge and especially to identify and make visible the traces of its past, its construction, its interaction with the river dynamics, which greatly influenced his life. These are the objectives of the PAVAGE project that focuses on digitally surveying, modelling and re-visiting a heritage site of primary importance with the aim of virtually restoring the link between the two sides which, after the disappearance of the Roman bridge of Arles, constituted for a long time the only connection between Lyon or Vienna and the sea. Therefore, this project has an important geo-historical dimension for which geo-morphological and paleoenvironmental studies were implemented in connection with the latest digital simulation methods exploiting geographic information systems. By integrating knowledge and reflections of archaeologists, historians, geomorphologists, environmentalists, architects, engineers and computer scientists, the result of this project (which involved 5 laboratories during 4 years) is a 3D digital model covering an extension of 50 km2 achieved by integrating satellite imagery, UAV-based acquisitions, terrestrial laser scanning and photogrammetry, etc. Beyond the actions of scientific valorisation concerning the historical and geomorphological dimensions of the project, the results of this work of this interdisciplinary investigation and interpretation of this site are today integrated within a location-based augmented reality application allowing tourists to exploring the virtual reconstruction of the bridge and its environment through tablets inside the portion of territory covered by this project (between Avignon and Villeneuve-lez-Avignon). This paper presents the main aspects of the 3D virtual reconstruction approach.","authors":["M. Berthelot","N. Nony","L. Gugi","A. Bishop"],"meta":["February 2015","DOI:10.5194/isprsarchives-XL-5-W4-223-2015"],"references":["281955348_Geoarchaeology_of_the_Rhone_River_in_the_area_of_Pont_Saint-_Benezet_Avignon_Provence_France_during_the_second_half_of_the_second_millennium_AD_An_integrated_historical_geography_and_palaeoenvironment"]}