{"id":"276837954_Optimized_LTE_Cell_Planning_With_Varying_Spatial_and_Temporal_User_Densities","abstract":"Base station (BS) deployment in cellular networks is one of the fundamental problems in network design. This paper proposes a novel method for the cell planning problem for fourth-generation (4G) cellular networks using metaheuristic algorithms. In this approach, we aim to satisfy both cell coverage and capacity constraints simultaneously by formulating an optimization problem that captures practical planning aspects. The starting point of the planning process is defined through a dimensioning exercise that captures both coverage and capacity constraints. Afterward, we implement a metaheuristic algorithm based on swarm intelligence (e.g., particle swarm optimization or the recently proposed gray-wolf optimizer) to find suboptimal BS locations that satisfy both problem constraints in the area of interest, which can be divided into several subareas with different spatial user densities. Subsequently, an iterative approach is executed to eliminate eventual redundant BSs. We also perform Monte Carlo simulations to study the performance of the proposed scheme and compute the average number of users in outage. Next, the problems of green planning with regard to temporal traffic variation and planning with location constraints due to tight limits on electromagnetic radiations are addressed, using the proposed method. Finally, in our simulation results, we apply our proposed approach for different scenarios with different subareas and user distributions and show that the desired network quality-of-service (QoS) targets are always reached, even for large-scale problems.","authors":["Hakim Ghazzai","E. Yaacoub","Mohamed-Slim Alouini","Zaher Dawy"],"meta":["January 2015IEEE Transactions on Vehicular Technology 65(3):1-1","DOI:10.1109/TVT.2015.2411579"],"references":["308953674_Ant_Colony_Optimization","283622630_Optimized_LTE_Cell_Planning_for_Multiple_User_Density_Subareas_Using_Meta-Heuristic_Algorithms","297078477_The_long-term_evolution_of_3G","291195858_Introduction","290751924_Single_Carrier_FDMA_A_New_Air_Interface_for_Long_Term_Evolution","284048685_The_particle_swarm_explosion_stability_and_convergence_in_multi-dimensional_complex_space","283996103_Genetic_Algorithms_In_Search_Optimization_and_Machine_Learning","275391476_Network_Planning_under_Demand_Uncertainty_with_Robust_Optimization","273453883_Particle_Swarm_Optimization","263285713_Interference_Modeling_and_Performance_Evaluation_of_Heterogeneous_Cellular_Networks"]}