{"id":"276852207_Developing_Creative_Behavior_in_Elementary_School_Students_with_Robotics","abstract":"The School Robotics Initiative (SRI), a problem-based robotics program for elementary school students, was developed with the objective of reaching students early on to instill an interest in Science, Technology, Engineering, and Math disciplines. The purpose of this exploratory, observational study was to examine how the SRI fosters student creative behavior. Weekly observations of 194 students (4th–6th grade) were conducted in three classrooms, over 3 years. Supplemental data were collected from student-written journals. Data were coded for themes. The findings revealed that the robotics classrooms were characterized by a high degree of energy. The students worked intensely on robotic tasks, engaging in a two-stage creative process that involved first designing a robot with a preplanned or spontaneous work approach, followed by an iterative period of trial and error creative programming. A variety of creativity techniques were observed being used. The SRI was shown to develop creative behavior in the students through the myriad of creative robot products generated. Based on the findings, the authors propose a componential model for developing creative behavior in the students through robotics, which includes a set of social, psychological, and physical elements necessary for the students to produce creative results in school robotics programs.","authors":["Jill Nemiro","Cesar Larriva","Mariappan Jawaharlal"],"meta":["May 2015The Journal of Creative Behavior 51(1)","DOI:10.1002/jocb.87","Project: Pedagogy"],"references":["265807277_Is_the_foundation_under_PISA_solid_A_critical_look_at_the_scaling_model_underlying_international_comparisons_of_student_attainment","308523712_A_model_of_organizational_innovation","291036271_Bringing_engineering_to_elementary_school","286964643_Roads_not_taken_new_roads_to_take_Looking_for_creativity_in_the_classroom","285930574_Learning_for_Creativity","285704407_Infusing_creative_and_critical_thinking_into_the_curriculum_together","277481088_Tough_choices_or_tough_times_The_report_on_the_new_commission_on_the_skills_of_the_American_workforce","271672066_Robotics_as_Means_to_Increase_Achievement_Scores_in_an_Informal_Learning_Environment","270820216_Componential_Theory_of_Creativity","268000896_Teaching_Basic_Engineering_Concepts_in_a_K-12_Environment_Using_LEGO_R_Bricks_and_Robotics"]}