{"id":"276842475_Query-Time_Record_Linkage_and_Fusion_over_Web_Databases","abstract":"Data-intensive Web applications usually require integrating data from Web sources at query time. The sources may refer to the same real-world entity in different ways and some may even provide outdated or erroneous data. An important task is to recognize and merge the records that refer to the same real world entity at query time. Most existing duplicate detection and fusion techniques work in the off-line setting and do not meet the online constraint. There are at least two aspects that differentiate online duplicate detection and fusion from its off-line counterpart. (i) The latter assumes that the entire data is available, while the former cannot make such an assumption. (ii) Several query submissions may be required to compute the \" ideal \" representation of an entity in the online setting. This paper presents a general framework for the online setting based on an iterative record-based caching technique. A set of frequently requested records is deduplicated off-line and cached for future reference. Newly arriving records in response to a query are deduplicated jointly with the records in the cache, presented to the user and appended to the cache. Experiments with real and synthetic data show the benefit of our solution over traditional record linkage techniques applied to an online setting.","authors":["El Kindi Rezig","Eduard C. Dragut","Mourad Ouzzani","Ahmed K. Elmagarmid"],"meta":["April 2015","DOI:10.1109/ICDE.2015.7113271","Conference: International Conference on Data EngineeringAt: Seoul, South Korea"],"references":["270549091_Data_fusion","262165033_Fast_and_accurate_incremental_entity_resolution_relative_to_an_entity_knowledge_base","226119474_The_concentration_of_commercial_success_in_popular_music_An_analysis_of_the_distribution_of_gold_records","319770399_Approximate_nearest_neighbors_towards_removing_the_curse_of_dimensionality","316600283_Data_Mining_Concepts_and_Techniques","309456867_Efficient_similarity_joins_for_near_duplicate_detection","303206384_Data_Mining_Concepts_and_Techniques","276465221_Incremental_record_linkage","260324760_Pay-As-You-Go_Entity_Resolution","227801749_The_FedLemur_project_Federated_search_in_the_real_world"]}