{"id":"276859377_Interactive_e-learning_through_Second_Life_with_Blackboard_Technology","abstract":"In todays’ economically viable worldview scenario, everyone wants to earn sufficient money which can be spent to maintain better lifestyle. There are many factors such as people living in the remote areas without appropriate communication systems or the physically challenged people et al who are not able to attend the traditional college system hence they seek an alternative option to gain education. E-Learning is a best alternative that provides suitable opportunity to all such individuals to obtain the desired qualifications or degrees as quality education even without attending any face to face college system in the educational institutions. The most positive point in E-Learning is that students find opportunity for access to the course materials anytime and anywhere whenever they find time through the use and application of electronic gadgets. Today, every reputed educational institution especially universities worldwide run their distance learning courses under the E-Learning system. Most powerful feature of E-Learning is that it remains an extremely interactive experience. Too many applications and tools are already available abundantly in the market today to promote E-learning in multiple ways. Take for example Moodle, Blackboard, LectureCast, Classroom 2.0, ELE (E-learning Environments) and E-Learning 2.0 amongst others. In this paper, we have focussed on the Second Life by Linden Lab (USA) for educational trainings. It has special instructiveness as we compare to rest E-Learning training methodologies available before us nowadays. It gives an opportunity to the students to attend virtual classrooms and attend lectures. The good thing is that Second Life develops a sense of presence in the students who feel as if they are physically present in the university campuses and spend time with their faculty members or peers. There are several other impeccable and strong features in Second Life. We have focused on Second Life education project to connect with Blackboard which we have already started to use in our university.","authors":["Ahmed Maajoon Alenezi","Krishna kirti Shahi"],"meta":["February 2015Procedia - Social and Behavioral Sciences 176:891-897","DOI:10.1016/j.sbspro.2015.01.555","Project: E-learning"],"references":["330271450_Adolescent_Literature_and_Second_Life_Teaching_Young_Adult_Texts_in_the_Digital_World2008","254049185_The_third_dimension_in_open_learning","247740122_Examining_the_societal_impacts_of_nanotechnology_through_simulation_NANO_SCENARIO","228951003_Virtual_Campus_as_a_Framework_for_Educational_and_Social_Activities","224207314_Educationally_enhanced_virtual_worlds","228342944_Get_your_consumer_health_information_from_an_avatar_health_and_medical_related_activities_in_a_virtual_environment","227733212_Use_of_three-dimensional_3-D_immersive_virtual_worlds_in_K-12_and_higher_education_settings_A_review_of_the_research","222350009_Fostering_argumentative_knowledge_construction_through_enactive_role_play_in_Second_Life","220981043_Second_Life_A_New_Window_for_E-learning","220040283_Minds_on_fire_Open_education_the_long_tail_and_learning_20"]}