{"id":"276851962_A_Theory_of_Formal_Synthesis_via_Inductive_Learning","abstract":"Formal synthesis is the process of generating a program satisfying a\nhigh-level specification. In recent times, effective formal synthesis methods\nhave been proposed based on the use of inductive learning. We refer to this\nclass of methods that learn programs from examples as formal inductive\nsynthesis. In this paper, we present a theoretical framework for formal\ninductive synthesis. We discuss how formal inductive synthesis differs from\ntraditional machine learning. We then describe oracle-guided inductive\nsynthesis (OGIS), a class of synthesizers that operate by iteratively querying\nan oracle. An instance of OGIS that has had much practical impact is\ncounterexample-guided inductive synthesis (CEGIS). We present a theoretical\ncharacterization of CEGIS for learning any program that computes a recursive\nlanguage. In particular, we analyze the relative power of CEGIS variants where\nthe types of counterexamples generated by the oracle varies. We also consider\nthe impact of bounded versus unbounded memory available to the learning\nalgorithm. In the special case where the universe of candidate programs is\nfinite, we relate the speed of convergence to the notion of teaching dimension\nstudied in machine learning theory. Altogether, the results of the paper take a\nfirst step towards a theoretical foundation for the emerging field of formal\ninductive synthesis.","authors":["Susmit Jha","Sanjit A. Seshia"],"meta":["November 2017Acta Informatica 54(7)","DOI:10.1007/s00236-017-0294-5","SourcearXiv"],"references":["344131954_Synthesizing_software_verifiers_from_proof_rules","341351834_Systems_That_Learn_An_Introduction_to_Learning_Theory","311471661_TRANSIT_specifying_protocols_with_concolic_snippets","308607126_From_program_verification_to_program_synthesis","307175251_Induction_of_Decision_Trees","284980826_Satisfiability_modulo_theories","281739013_Bounded_model_checking","280765005_Graph-based_algorithms_for_Boolean_function_manipulation","279554751_Hyperproperties","268992343_Applied_Linear_Regression","264122912_Are_there_good_mistakes_A_theoretical_analysis_of_CEGIS","268992342_Applied_Linear_Regression","266653613_Mining_Requirements_From_Closed-Loop_Control_Models","266439821_Towards_Automated_System_Synthesis_Using_SCIDUCTION","262355491_TRANSIT_Specifying_protocols_with_concolic_snippets"]}