{"id":"276922957_A_Local_Broadcast_Layer_for_the_SINR_Network_Model","abstract":"We present the first algorithm that implements an abstract MAC (absMAC) layer in the Signal-to-Interference-plus-Noise-Ratio (SINR) wireless network model. We first prove that efficient SINR implementations are not possible for the standard absMAC specification. We modify that specification to an \"approximate\" version that better suits the SINR model. We give an efficient algorithm to implement the modified specification, and use it to derive efficient algorithms for higher-level problems of global broadcast and consensus.\nIn particular, we show that the absMAC progress property has no efficient implementation in terms of the SINR strong connectivity graph G[subscript 1-ε], which contains edges between nodes of distance at most (1-ε) times the transmission range, where ε>0 is a small constant that can be chosen by the user. This progress property bounds the time until a node is guaranteed to receive some message when at least one of its neighbors is transmitting. To overcome this limitation, we introduce the slightly weaker notion of approximate progress into the absMAC specification. We provide a fast implementation of the modified specification, based on decomposing the algorithm of [10] into local and global parts. We analyze our algorithm in terms of local parameters such as node degrees, rather than global parameters such as the overall number of nodes. A key contribution is our demonstration that such a local analysis is possible even in the presence of global interference.\nOur absMAC algorithm leads to several new, efficient algorithms for solving higher-level problems in the SINR model. Namely, by combining our algorithm with high-level algorithms from [26], we obtain an improved (compared to [10]) algorithm for global single-message broadcast in the SINR model, and the first efficient algorithm for multi-message broadcast in that model. We also derive the first efficient algorithm for network-wide consensus, using a result of [32]. This work demonstrates that one can develop efficient algorithms for solving high-level problems in the SINR model, using graph-based algorithms over a local broadcast abstraction layer that hides the technicalities of the SINR platform such as global interference. Our algorithms do not require bounds on the network size, nor the ability to measure signal strength, nor carrier sensing, nor synchronous wakeup.","authors":["Magnús M. Halldórsson","Stephan Holzer","Nancy Ann Lynch"],"meta":["May 2015","DOI:10.1145/2767386.2767432","SourcearXiv"],"references":["263048826_On_the_Impact_of_Geometry_on_Ad_Hoc_Communication_in_Wireless_Networks","313377016_Distributed_algorithms_for_approximating_wireless_network_capacity","303226526_Distributed_Randomized_Broadcasting_in_Wireless_Networks_under_the_SINR_Model","289823416_Broadcast_in_the_Ad_Hoc_SINR_Model","283072219_Distributed_Randomized_Broadcasting_in_Wireless_Networks_under_the_SINR_Model","263737008_Distributed_Multiple-Message_Broadcast_in_Wireless_Ad-Hoc_Networks_under_the_SINR_Model","263037389_Multi-Message_Broadcast_with_Abstract_MAC_Layers_and_Unreliable_Links","262331998_Randomized_broadcast_in_radio_networks_with_collision_detection","262331025_Connectivity_and_aggregation_in_multihop_wireless_networks","262207397_Deterministic_Distributed_Data_Aggregation_under_the_SINR_Model"]}