{"id":"276903966_Three-dimensional_printing_in_the_construction_industry_A_review","abstract":"Three-dimensional (3D) printing has long been used in the manufacturing sector as a way to automate, accelerate production and reduce waste materials. By using this technology, it is possible to build a wide variety of objects if the necessary specifications are provided to the printer and no problems are presented by the limited range of materials available. With 3D printing becoming cheaper, more reliable and, as a result, more prevalent in the world at large, it may soon make inroads into the construction industry. Little is known, however, of 3D printing in current use in the construction industry and its potential for the future, and this paper seeks to investigate this situation by providing a review of the relevant literature. In doing this, the three main 3D printing methods of contour crafting, concrete printing and D-shape 3D printing are described, which, as opposed to the traditional construction method of cutting materials down to size, deliver only what is needed for completion, vastly reducing waste. The paper also identifies 3D printing's potential to enable buildings to be constructed many times faster and with significantly reduced labour costs. In addition, it is clear that construction 3D printing can allow the further inclusion of building information modelling into the construction process, thus streamlining and improving the scheduling requirements of a project. However, the current 3D printing processes are known to be costly, unsuited to large-scale products and conventional design approaches and have a very limited range of materials that can be used. Moreover, the only successful examples of construction in action to date have occurred in controlled laboratory environments and, as real world trials have yet to be completed, it is yet to be seen whether it can be equally proficient in practical situations.","authors":["Isaac Perkins","Martin Skitmore"],"meta":["March 2015International Journal of Construction Management 15(1):1-9","DOI:10.1080/15623599.2015.1012136"],"references":["259496068_Interoperability_requirements_for_automated_manufacturing_systems_in_construction","256678872_Hardened_properties_of_high-performance_printing_concrete","251617962_Developments_in_construction-scale_additive_manufacturing_processes","321221292_When_the_levee_breaks","320561767_Toward_Total_Automation_of_On-Site_Construction_-_An_Integrated_Approach_Based_on_Contour_Crafting","320560735_Concrete_Wall_Fabrication_by_Contour_Crafting","313430270_Printed_buildings_An_international_race_for_the_ultimate_in_automation","286777057_Contour_crafting-a_mega_scale_fabrication_technology","259135975_Extending_automation_of_building_construction_-_Survey_on_potential_sensor_technologies_and_robotic_applications","257371558_Optimal_machine_operation_planning_for_construction_by_Contour_Crafting"]}