{"id":"277084798_Sequential_pattern_mining_for_discovering_gene_interactions_and_their_contextual_information_from_biomedical_texts","abstract":"Discovering gene interactions and their characterizations from biological text collections is a crucial issue in bioinformatics. Indeed, text collections are large and it is very difficult for biologists to fully take benefit from this amount of knowledge. Natural Language Processing (NLP) methods have been applied to extract background knowledge from biomedical texts. Some of existing NLP approaches are based on handcrafted rules and thus are time consuming and often devoted to a specific corpus. Machine learning based NLP methods, give good results but generate outcomes that are not really understandable by a user.\nWe take advantage of an hybridization of data mining and natural language processing to propose an original symbolic method to automatically produce patterns conveying gene interactions and their characterizations. Therefore, our method not only allows gene interactions but also semantics information on the extracted interactions (e.g., modalities, biological contexts, interaction types) to be detected. Only limited resource is required: the text collection that is used as a training corpus. Our approach gives results comparable to the results given by state-of-the-art methods and is even better for the gene interaction detection in AIMed.\nExperiments show how our approach enables to discover interactions and their characterizations. To the best of our knowledge, there is few methods that automatically extract the interactions and also associated semantics information. The extracted gene interactions from PubMed are available through a simple web interface at https://bingotexte.greyc.fr/. The software is available at https://bingo2.greyc.fr/?q=node/22.","authors":["Peggy Cellier","Thierry Charnois","Marc Plantevit","Christophe Rigotti"],"meta":["December 2015Journal of Biomedical Semantics 6(1):27","DOI:10.1186/s13326-015-0023-3","SourcePubMed"],"references":["234156489_A_detailed_error_analysis_of_13_kernel_methods_for_protein-protein_interaction_extraction","228957289_Consensus_pattern_alignment_to_find_protein-protein_interactions_in_text","328305159_Information_extraction","320316120_Extracting_Trees_of_Quantitative_Serial_Episodes","319393506_Mining_Sequential_Patterns_Generalizations_and_Performance_Improvements","312463714_Knowledge_discovery_in_databases_An_overview","281733055_Discovering_Knowledge_from_Local_Patterns_in_SAGE_Data","267839832_Studies_in_Fuzziness_and_Soft_Computing","250940135_Signal_Transducer_and_Activator_of_Transcription-3_Inflammation_and_Cancer_How_Intimate_Is_the_Relationship","228349822_The_CoNLL-2010_Shared_Task_Learning_to_Detect_Hedges_and_their_Scope_in_Natural_Language_Text"]}