{"id":"277060958_The_Technological_Dimension_of_a_Massive_Open_Online_Course_The_Case_of_the_CCK08_Course_Tools","abstract":"In 2008, a new term emerged in the already crowded e-learning landscape: MOOC, or massive open online course. Lifelong learners can now use various tools to build and manage their own learning networks, and MOOCs may provide opportunities to test such networks. This paper focuses on the technological aspects of one MOOC, the Connectivism and Connective Knowledge (CCK08) course, in order to investigate lifelong learners’ attitudes towards learning network technologies. The research framework is represented by three perspectives: (a) lifelong learning in relation to open education, with a focus on the effective use of learning tools; (b) the more recent personal knowledge management (PKM) skills approach; and (c) the usability of web-based learning tools. \n\nFindings from a survey of CCK08 participants show that the course attracted mainly adult, informal learners, who were unconcerned about course completion and who cited a lack of time as the main reason for incompletion. Time constraints, language barriers, and ICT skills affected the participants’ choice of tools; for example, learners favoured the passive, filtered mailing list over interactive but time-consuming discussion forums and blogs. Some recommendations for future MOOCs include highlighting the pedagogical purpose of the tools offered (e.g., learning network skill-building) and stating clearly that the learners can choose which tools they prefer to use. Further research on sustainability and instructor workload issues should be conducted to determine the cost and effectiveness of MOOCs. Investigation is also necessary to understand whether such terms as course, drop-out, and attrition are appropriate in relation to MOOCs.","authors":["Antonio Fini"],"meta":["November 2009International Review of Research in Open and Distance Learning 10(5)","DOI:10.19173/irrodl.v10i5.643"],"references":["239549918_Distance_learning_-_Social_software's_killer_ap","228350341_Personal_Learning_Environments-the_future_of_eLearning","285964907_Personal_knowledge_management_skills_for_lifelong-learners_20","265537288_When_Professors_Print_Their_Own_Diplomas_Who_Needs_Universities","242239846_Course_Completion_Rates_among_Distance_Learners_Identifying_Possible_Methods_to_Improve_Retention","229067956_Designing_Web_Usability","225519393_An_approach_to_usability_evaluation_of_e-learning_applications","225148737_An_Empirical_Investigation_on_the_Effectiveness_of_Virtual_Learning_Environment_in_Supporting_Collaborative_Learning_A_System_Design_Perspective","223780327_Tool_use_in_computer-based_learning_environments_Towards_a_research_framework","222557874_Using_Web_20_for_learning_in_the_community"]}