{"id":"277053766_Social_robots_in_advanced_dementia","abstract":"Aims: Pilot studies applying a humanoid robot (NAO), a pet robot (PARO) and a real animal (DOG) in therapy sessions of patients with dementia in a nursing home and a day care center.\nMethods:In the nursing home, patients were assigned by living units, based on dementia severity, to one of the three parallel therapeutic arms to compare: CONTROL, PARO and NAO (Phase 1) and CONTROL, PARO, and DOG (Phase 2). In the day care center, all patients received therapy with NAO (Phase 1) and PARO (Phase 2). Therapy sessions were held 2 days per week during 3 months. Evaluation, at baseline and follow-up, was carried out by blind raters using: the Global Deterioration Scale (GDS), the Severe Mini Mental State Examination (sMMSE), the Mini Mental State Examination (MMSE), the Neuropsychiatric Inventory (NPI), the Apathy Scale for Institutionalized Patients with Dementia Nursing Home version (APADEM-NH), the Apathy Inventory (AI) and the Quality of Life Scale (QUALID). Statistical analysis included descriptive statistics and non-parametric tests performed by a blinded investigator.\nResults: In the nursing home, 101 patients (Phase 1) and 110 patients (Phase 2) were included. There were no significant differences at baseline. The relevant changes at follow-up were: (Phase 1) patients in the robot groups showed an improvement in apathy; patients in NAO group showed a decline in cognition as measured by the MMSE scores, but not the sMMSE; the robot groups showed no significant changes between them; (Phase 2) QUALID scores increased in the PARO group. In the day care center, 20 patients (Phase 1) and 17 patients (Phase 2) were included. The main findings were: (Phase 1) improvement in the NPI irritability and the NPI total score; (Phase 2) no differences were observed at follow-up.","authors":["Meritxell Valentí-Soler","Luis Agüera","Javier Olazarán Rodríguez","Carolina Mendoza Rebolledo"],"meta":["May 2015Frontiers in Aging Neuroscience 7","DOI:10.3389/fnagi.2015.00133"],"references":["277541616_Robotherapy_with_Dementia_Patients_Regular_Paper","229058790_Assistive_social_robots_in_elderly_care_A_review","228642722_Improving_the_Quality_of_Life_of_People_with_Dementia_through_the_Use_of_Socially_Assistive_Robots","316991409_Mini-Mental_State_A_practical_method_for_grading_the_cognitive_state_of_patients_for_the_clinician","316271586_Animal-assisted_therapy_for_people_with_serious_mental_illness","312609767_Mini-mental_state-practical_method_for_grading_cognitive_state_of_patients_for_clinicians","289025558_Trends_of_Robot_Therapy_with_Neurological_Therapeutic_Seal_Robot_PARO","260686487_Therapeutic_Seal_Robot_as_Biofeedback_Medical_Device_Qualitative_and_Quantitative_Evaluations_of_Robot_Therapy_in_Dementia_Care","250922727_A_Novel_Rating_Scale_for_the_Measurement_of_Apathy_in_Institutionalized_Persons_with_Dementia_The_APADEM-NH","235390203_Animal-assisted_interventions_for_elderly_patients_affected_by_dementia_or_psychiatric_disorders_A_review"]}