{"id":"277252374_A_comparison_framework_for_temporal_image_reconstructions_in_electrical_impedance_tomography","abstract":"Electrical impedance tomography (EIT) provides low-resolution images of internal conductivity distributions, but is able to achieve relatively high temporal resolutions. Most EIT image reconstruction algorithms do not explicitly account for the temporal constraints on the measurements or physiological processes under investigation. Instead, algorithms typically assume both that the conductivity distribution does not change during the acquisition of each EIT data frame, and that frames can be reconstructed independently, without consideration of the correlation between images. A failure to account for these temporal effects will result in aliasing-related artefacts in images. Several methods have been proposed to compensate for these effects, including interpolation of raw data, and reconstruction algorithms using Kalman and temporal filtering. However, no systematic work has been performed to understand the severity of the temporal artefacts nor the extent to which algorithms can account for them. We seek to address this need by developing a temporal comparison framework and figures of merit to assess the ability of reconstruction algorithms to account for temporal effects. Using this approach, we compare combinations of three reconstruction algorithms using three EIT data frame types: perfect, realistic and interpolated. The results show that, without accounting for temporal effects, artefacts are present in images for dynamic conductivity contrasts at frequencies 10-20 times slower than the frame rate. The proposed methods show some improvements in reducing these artefacts.","authors":["Hervé Gagnon","Bartłomiej Grychtol","Andy Adler"],"meta":["May 2015Physiological Measurement 36(6):1093-1107","DOI:10.1088/0967-3334/36/6/1093","SourcePubMed"],"references":["258697728_Fast_Adaptive_3-D_Nonstationary_Electrical_Impedance_Tomography_Based_on_Reduced-Order_Modeling","224835940_Whither_lung_EIT_Where_are_we_where_do_we_want_to_go_and_what_do_we_need_to_get_there","26262005_GREIT_A_unified_approach_to_2D_linear_EIT_reconstruction_of_lung_images","13723308_A_Kalman_filter_approach_to_track_fast_impedance_changes_in_electrical_impedance_tomography","7145271_Dynamic_electrical_impedance_imaging_of_a_chest_phantom_using_the_Kalman_filter","236967359_The_effect_of_serial_data_collection_on_the_accuracy_of_electrical_impedance_tomography_images","228332343_NOSER_An_algorithm_for_solving_the_inverse_conductivity_problem","221757829_A_portable_instrument_for_high-speed_brain_function_imaging_FEITER","8918800_Electrical_Impedance_Tomography_Using_the_Extended_Kalman_Filter","7145270_Objective_selection_of_hyperparameter_for_EIT","6173814_Temporal_image_reconstruction_in_electrical_impedance_tomography","5635623_Electrical_impedance_tomography_Regularized_imaging_and_contrast_detection"]}