{"id":"277301495_A_Model_for_Photovoltaic_Module_Optimisation","abstract":"Electricity generation from fossil fuels for general use is posed with problems such as greenhouse gas (GHG) emissions, environmental threats and energy crisis. However, renewable energies have become the best possible alternatives to fossil fuel, in terms of generating electricity, and they have lower impact on the environment. Photovoltaic (PV) technology is the fastest growing renewable energy technology but it’s very expensive and not as efficient compared to traditional energy conversion systems. In this paper, we introduce an optimisation model to ensure efficient use of photovoltaic modules. We build a one diode model using blocks from the MATLAB/Simulink library. Simulations were carried out for varying irradiance intensity from 400Wm-2 to 1000 Wm-2. We process the simulations data in Matlab and the results is that the irradiance incident on the module directly affects the current supplied by the module, and this in turn affects its Fill Factor and efficiency. There exist also a relationship between the series resistor of the PV module and the Maximum Power delivered, and we obtain a mathematical expression linking the series resistor and the intensity of the irradiance incident.","authors":["Nerissa Edem Lawrencia Anku","D. Adu-Gyamfi","Kankam Okatakyie Adu","Augustine Takyi"],"meta":["May 2015","DOI:10.5923/j.jmea.20150502.02"],"references":["291807762_Modeling_and_simulation_of_Egyptsat-1_satellite_system_powered_by_photovoltaic_module","276043589_Prospects_of_Renewable_Energy_in_Semi-Arid_Region","267566386_A_Review_on_Optimization_Modeling_of_Energy_Systems_Planning_and_GHG_Emission_Mitigation_under_Uncertainty","261712981_Analysis_and_Investigation_of_a_Two-Diode_Solar_Cell_Using_MATLABSimulink","258913169_MATLABSimulink_Based_Modelling_of_Solar_Photovoltaic_Cell","245367582_Comparison_of_Photovoltaic_Module_Performance_Measurements","280741186_Modeling_of_Solar_Irradiance_and_Cells","269750598_Modeling_and_Simulation_of_Solar_Photovoltaic_module_using_MatlabSimulink","264045757_Artificial_Neural_Network_Approach_for_More_Accurate_Solar_Cell_Electrical_Circuit_Model","239405513_A_modelling_method_for_building-integrated_photovoltaic_power_supply"]}