{"id":"277340377_On_being_'Systematic'_in_Literature_Reviews_in_IS","abstract":"General guidelines for conducting literature reviews often do not address the question of literature searches and dealing with a potentially large number of identified sources. These issues are specifically addressed by so-called systematic literature reviews (SLRs) that propose a strict protocol for the search and appraisal of literature. Moreover, SLRs are claimed to be a ‘standardized method’ for literature reviews that is replicable, transparent, objective, unbiased and rigorous, and thus superior to other approaches for conducting literature reviews. These are significant and consequential claims that – despite increasing adoption of SLRs – remained largely unnoticed in the information systems (IS) literature. The objective of this debate is to draw attention of the IS community to SLR’s claims, to question their justification and reveal potential risks of their adoption. This is achieved by first examining the origins of SLR and the prescribed SLR process and then by critically assessing their claims and implications. In this debate, we show that SLRs are applicable and useful for a very specific kind of literature review, a meta study that identifies and summarizes evidence from earlier research. We also demonstrate that the claims that SLRs provide superior quality are not justified. More importantly, we argue that SLR as a general approach to conducting literature reviews is highly questionable, concealing significant perils. The paper cautions that SLR could undermine critical engagement with literature and what it means to be scholarly in academic work.","authors":["Sebastian K. Boell","Dubravka Cecez-Kecmanovic"],"meta":["June 2015Journal of Information Technology 30(2)","DOI:10.1057/jit.2014.26"],"references":["321152206_The_Intellectual_Advancement_of_Human-Computer_Interaction_Research_A_Critical_Assessment_of_the_MIS_Literature_1990-2008","308050235_Reconstructing_the_Giant_On_the_Importance_of_Rigour_in_Documenting_the_Literature_Search_Process","302924724_Guidelines_for_performing_Systematic_Literature_Reviews_in_Software_Engineering","348867485_Getting_a_PhD_An_Action_Plan_to_Help_Manage_Your_Research_Your_Supervisor_and_Your_Project","344629982_Telling_a_Research_Story_Writing_a_Literature_Review","325000670_What's_Under_Construction_Here_Social_Action_Materiality_and_Power_in_Constructivist_Studies_of_Technology_and_Organizing","321610943_WITTGENSTEIN_LANGUAGE_AND_INFORMATION_Back_to_the_Rough_Ground","312984568_Perceived_usefulness_perceived_ease_and_user_acceptance_of_information_technology","312892068_Working_papers_on_information_systems_A_guide_to_conducting_a_systematic_literature_review_of_information_systems_research","309311435_What_constitutes_a_theoretical_contribution"]}