{"id":"277345043_News_Images_on_Instagram_The_paradox_of_authenticity_in_hyperreal_photo_reportage","abstract":"This article examines the extent to which the online photo-sharing service Instagram assists professional and citizen photojournalists in the performative construction of a hyperreality in accordance with Baudrillard’s theory. Based on a visual analysis of the Instagram photo feeds of six citizen photojournalists and six professional photojournalists, this research aims to identify the various simulations and discourses used by professional and citizen photojournalists alike to stage their photographs and to characterise the differences demarcating the professional-amateur divide. It also examines how the interaction between technology, photojournalistic practices and subjectivity stimulates the mediations and negotiations that condition the construction of this hyperreality. The study demonstrates that by producing, uploading, sharing, commenting upon and promoting these altered photo reportages, the Instagram community inadvertently creates a hyperreal depiction of the world that challenges both, the sense of authenticity characteristic of citizen journalism and amateur photography, as well as the realism to which professional photojournalism has historically subscribed. Moreover, it argues that in order to create their images, Instagram photojournalists use a series of aesthetic conventions and performative discourses that correspond to their roles as either amateurs or professionals. Nevertheless, each group tries to simulate the aforementioned conventions and discourses of the other in an attempt to get closer either to the sense of amateurish authenticity or to professional neatness. As a result, this paradoxical interaction has the potential to transform today’s visual imagery by means of a simulated reality that needs further explanation.","authors":["Eddy Borges-Rey"],"meta":["April 2015Digital Journalism 3(4):1-23","DOI:10.1080/21670811.2015.1034526"],"references":["292651696_Digital_journalism","273598706_Citizen_camera-witnessing_Embodied_political_dissent_in_the_age_of_'mediated_mass_self-communication'","263568075_Iphoneography_as_an_emergent_art_world","263481255_Re-mediation_inter-mediation_trans-mediation","258140436_Misfortunes_memories_and_sunsets_Non-professional_images_in_Dutch_news_media","241648479_When_Citizen_Photojournalism_Sets_the_News_Agenda_Neda_Agha_Soltan_as_a_Web_20_Icon_of_Post-election_Unrest_in_Iran","316159893_Photojournalism_A_Social_Semiotic_Approach","290289633_Witnessing_in_crisis_Photo-reportage_of_terror_attacks_in_Boston_and_London","271941520_Comparing_the_Ethics_of_Citizen_Photojournalists_and_Professional_Photojournalists_A_Coorientational_Study","271935808_Proximity_As_A_Journalistic_Keyword_In_The_Digital_Era","267629213_Blurry_and_Centered_or_Clear_and_Balanced","263567985_War_on_Instagram_Framing_conflict_photojournalism_with_mobile_photography_apps","256031141_Creation_and_Control_in_the_Photographic_Process_iPhones_and_the_Emerging_Fifth_Moment_of_Photography","248925615_On_Having_Been_There_Eyewitnessing_as_a_Journalistic_Key_Word"]}