{"id":"277323278_Robots_that_can_adapt_like_animals","abstract":"As robots leave the controlled environments of factories to autonomously function in more complex, natural environments, they will have to respond to the inevitable fact that they will become damaged. However, while animals can quickly adapt to a wide variety of injuries, current robots cannot “think outside the box” to find a compensatory behavior when damaged: they are limited to their pre-specified selfsensing abilities, can diagnose only anticipated failure modes, and require a pre-programmed contingency plan for every type of potential damage, an impracticality for complex robots. Here we introduce an intelligent trial and error algorithm that allows robots to adapt to damage in less than two minutes, without requiring self-diagnosis or pre-specified contingency plans. Before deployment, a robot exploits a novel algorithm to create a detailed map of the space of high-performing behaviors: This map represents the robot’s intuitions about what behaviors it can perform and their value. If the robot is damaged, it uses these intuitions to guide a trial-and-error learning algorithm that conducts intelligent experiments to rapidly discover a compensatory behavior that works in spite of the damage. Experiments reveal successful adaptations for a legged robot injured in five different ways, including damaged, broken, and missing legs, and for a robotic arm with joints broken in 14 different ways. This new technique will enable more robust, effective, autonomous robots, and suggests principles that animals may use to adapt to injury.","authors":["Antoine Cully","Jeff Clune","Danesh Tarapore","Jean-Baptiste Mouret"],"meta":["May 2015Nature 521(7553):503-507","DOI:10.1038/nature14422","Project: Creadapt"],"references":["291053132_Evolving_Gaits_for_Physical_Robots_with_the_HyperNEAT_Generative_Encoding_The_Benefits_of_Simulation","275279502_Illuminating_search_spaces_by_mapping_elites","265574083_Design_and_analysis_of_computer_experiments_With_comments_and_a_rejoinder_by_the_authors","313191740_Spatial_variation_Stochastic_models_And_their_application_to_some_problems_in_forest_surveys_And_other_sampling_investigations","303269133_Gaussian_Processes_for_Machine_Learning","286013963_An_experimental_comparison_of_Bayesian_optimization_for_bipedal_locomotion","286013753_Bayesian_optimization_explains_human_active_search","284050884_The_locomotion_of_the_cockroach_Periplaneta_americana","263048161_Nonlinear_Programming_Sequential_Unconstrained_Minimization_Techniques","262306769_Ground_reaction_force_adaptations_to_tripedal_locomotion_in_dogs"]}