{"id":"277324885_Gaussian_Process_based_Subsumption_of_a_Parasitic_Control_Component","abstract":"Many existing control architectures assume that the main control system being designed is the only controller that governs a system's actuators. However, with the increasing availability of off-the shelf controls packages, the number of internal unadjustable control systems is increasing. Some of these control systems may behave in parasitic way by enforcing a rigid set of behaviors that could disrupt a desired system behavior. We present a control architecture that can subsume parasitic control behavior through iteratively shaping the main control command with an intelligent feed-forward term. Our architecture requires very little prior knowledge about the subsystem whose behavior is to be subsumed, rather it relies on online learned sparsified predictive Gaussian Process (GP) models. We provide rigorous quantifiable bounds relating the sparsification of the GP to the accuracy in estimating and subsuming the parasitic subsystem. The presented subsumption architecture is realized using a variant of D-Type iterative learning control (ILC) and is validated through a series of flight tests on a Parrot AR Drone 2.0 quadrotor where the quadrotor's sonar based altitude control loop's behavior of maintaining a fixed altitude over ground surfaces is subsumed through a main controller via a feed-forward term.","authors":["Allan Max Axelrod","Hassan A. Kingravi","Girish Chowdhary"],"meta":["June 2015Proceedings of the American Control Conference 2015","DOI:10.1109/ACC.2015.7171173","Conference: American Control Conference"],"references":["268469466_Adaptive-Optimal_Control_of_Constrained_Nonlinear_Uncertain_Dynamical_Systems_using_Concurrent_Learning_Model_Predictive_Control","268469393_Optimizing_Reference_Commands_for_Concurrent_Learning_Adaptive-Optimal_Control_of_Uncertain_Dynamical_Systems","265127962_Sensor_Noise_Rejection","262196034_Survey_on_stochastic_iterative_learning_control","317019305_Bibliographical_review_on_reconfigurable_fault-tolerant_control_systems","303269133_Gaussian_Processes_for_Machine_Learning","303138182_ROS_An_open-source_Robot_Operating_System","271456301_The_Navigation_and_Control_Technology_Inside_the_ARDrone_Micro_UAV","268489974_Adaptive_Control_Design_and_Analysis","261431299_Learning_swing-free_trajectories_for_UAVs_with_a_suspended_load"]}