{"id":"277338798_The_eco-cognitive_model_of_abduction_Apagoge_now_Naturalizing_the_logic_of_abduction","abstract":"Abduction (, in ancient Greek, often translated with “leading away” or “reduction”) is a procedure in which something that lacks classical explanatory epistemic virtue can be accepted because it has virtue of another kind: [15] contend (GW-Schema) that abduction presents an ignorance-preserving or (ignorance-mitigating) character. From this perspective abductive reasoning is a response to an ignorance-problem; through abduction the basic ignorance – that does not have to be considered a total “ignorance” – is neither solved nor left intact. Abductive reasoning is an ignorance-preserving accommodation of the problem at hand. Is abduction really ignorance-preserving? To better answer this question I will introduce (and take advantage of) an eco-cognitive model (EC-Model) of abduction. It will be illustrated that through abduction, knowledge can be enhanced, even when abduction is not considered an inference to the best explanation in the classical sense of the expression, that is an inference necessarily characterized by an empirical evaluation phase, or an inductive phase, as Peirce called it. To further deepen the eco-cognitive character of abduction a simple genealogy of logic is provided: Aristotle clearly states that in syllogistic theory local/environmental cognitive factors – external to that peculiar inferential process, for example regarding users/reasoners, are given up. Indeed, to define syllogism Aristotle first of all insists that all syllogisms are valid and contends that the necessity of this kind of reasoning is related to the circumstance that “no further term from outside is needed”, in sum syllogism is the fruit of a kind of eco-cognitive immunization. At the same time Aristotle presents a seminal perspective on abduction: the second part of the article considers the famous passage in the chapter B25 of Prior Analytics concerning (“leading away”), also studied by Peirce. I contend that some of the current well-known distinctive characters of abductive cognition are already expressed, which are in tune with the EC-Model. By providing an illustration of the role of the method of analysis and of the middle terms in Plato's dialectic argumentation, considered as related to the diorismic/poristic process in ancient geometry – also, later on, emphasized by Proclus – I maintain that it is just this intellectual heritage which informs Aristotle' chapter B25 on . Even if, in general, Aristotle seems to sterilize, thanks to the invention of syllogistic theory, every “dialectic” background of reasoning, nevertheless in chapter B25 he is still pointing to the fundamental inferential role in reasoning of those externalities that substantiate the process of “leading away” (). Hence, we can gain a new positive perspective about the “constitutive” eco-cognitive character of abduction, just thanks to Aristotle himself. Finally, the paper presents an excursus on Aristotle's enthymemes from signs, disregarded by Peirce, but extremely important to stress the Aristotelian treatment of what I have called selective abduction. A forthcoming companion paper ([35]) will further deepen the EC-Model of abduction stressing stricter logical aspects: the first result will be that, contrarily to the classical logical view, relevance and plausibility in abductive reasoning have to be relativized and so the epistemologically embarrassing concepts of irrelevance and implausibility exculpated: they are not always offensive to reason.","authors":["Lorenzo Magnani"],"meta":["May 2015Journal of Applied Logic 13(3)","DOI:10.1016/j.jal.2015.04.003"],"references":["284595682_Are_Heuristics_Knowledge-Enhancing_Abduction_Models_and_Fictions_in_Science","283844706_An_Argument_for_Ignorance-Based_Chance_Discovery","275283019_Is_abduction_ignorance-preserving_Conventions_models_and_fictions_in_science","270589635_Induction_in_Aristotle's_System_of_Scientific_Knowledge","269690423_Ancestor_Worship_in_The_Logic_of_Games_How_foundational_were_Aristotle's_contributions","263945124_Model-Based_Abductive_Resoning_in_Automated_Software_Testing","227278992_Why_Play_Logical_Games","227221675_Abduction_aiming_at_empirical_progress_or_eventruth_approximationleading_to_a_challenge_for_computational_modelling","220388430_Abductive_Logic_Programming","220245095_Surviving_Abduction","44243149_To_Prove_the_Evident_On_the_Inferential_Role_of_Euclidean_Diagrams","2288229_Seeking_Explanations_Abduction_in_Logic_Philosophy_of_Science_and_Artifical_Intelligence","324429374_Articulating_Reasons_An_Introduction_to_Inferentialism","291605551_The_Practical_Logic_of_Cognitive_Systems","291523904_Perceptual_judgments","284691060_The_evolution_of_Peirce's_concept_of_abduction","284634800_Peirce's_abductive_argument_and_the_enthymeme","283952442_Charles_S_Peirce's_Theory_of_Abduction_and_the_Aristotelian_Enthymeme_From_Signs","283614189_The_Euclidean_Diagram_1995","278692064_Scientific_Models_Are_Not_Fictions","275992798_Aristotle's_Abduction_The_Institution_of_Frontiers","269578971_The_Method_of_Analysis_Its_Geometrical_Origin_and_Its_General_Significance","269575356_Aristotle's_Earlier_Logic_second_revised_edition","268751343_Naturalizing_logic","265872688_Abductive_Cognition_The_Epistemological_and_Eco-Cognitive_Dimensions_of_Hypothetical_Reasoning","262088053_Understanding_Violence_The_Intertwining_of_Morality_Religion_and_Violence_A_Philosophical_Stance_by_Lorenzo_Magnani","259810904_Socratic_Epistemology_Explorations_of_Knowledge-Seeking_by_Questioning","257666650_Inference_to_the_best_explanation_coherence_and_other_explanatory_virtues","251496150_Recent_developments_in_abductive_logic","249569766_A_note_on_A_ristotelian_epagoge","248759572_Proof-analysis_and_Continuity","238860456_The_function_of_diorism_in_ancient_Greek_analysis","235625639_Logic_For_Problem_Solving","226409912_The_Fallacy_of_Fallacies","226146997_What_Was_Aristotle_Doing_in_His_Early_Logic_Anyway_A_Reply_to_Woods_and_Hansen","224982239_Historical_Perspectives_on_Peirce's_Logic_of_Science_a_history_of_science_2_vols_Edited_by_Carolyn_Eisele","223001659_Abduction-induction_generalization_processes_of_elementary_majors_on_figural_patterns_in_algebra","220607844_Proofs_pictures_and_Euclid","200027104_The_Essential_Peirce_Selected_Philosophical_Writings","200027102_The_Collected_Works_of_Charles_Sanders_Peirce","51247491_Perception_as_Abduction_Turning_Sensor_Data_Into_Meaningful_Representation","2401441_Ampliative_Adaptive_Logics_and_the_Foundation_of_Logic-Based_Approaches_to_Abduction"]}