{"id":"277434189_Viewing_and_reading_behaviour_in_a_virtual_environment","abstract":"Purpose\n– This article aims to focus on usage data in respect to full‐text downloads of journal articles, which is considered an important usage (satisfaction) metric by librarians and publishers. The purpose is to evaluate the evidence regarding full‐text viewing by pooling together data on the full‐text viewing of tens of thousands of users studied as part of a number of investigations of e‐journal databases conducted during the Virtual Scholar research programme.\n\nDesign/methodology/approach\n– The paper reviews the web logs of a number of electronic journal libraries including OhioLINK and ScienceDirect using Deep Log Analysis, which is a more sophisticated form of transactional log analysis. The frequency, characteristics and diversity of full‐text viewing are examined. The article also features an investigation into the time spent online viewing full‐text articles in order to get a clearer understanding of the significance of full‐text viewing, especially in regard to reading.\n\nFindings\n– The main findings are that there is a great deal of variety amongst scholars in their full‐text viewing habits and that a large proportion of views are very cursory in nature, although there is survey evidence to suggest that reading goes on offline.\n\nOriginality/value\n– This is the first time that full‐text viewing evidence is studied on such a large scale.","authors":["David Nicholas","Paul Huntington","Hamid R. Jamali","Ian Rowlands"],"meta":["May 2008Aslib Proceedings 60(3):185-198","DOI:10.1108/00012530810879079","Project: E-Journals"],"references":["250060934_How_usage_statistics_can_inform_national_negotiations_and_strategies","250060705_COUNTER_-_increasing_the_value_of_online_usage_statistics","248498831_Diversity_in_the_Information_Seeking_Behaviour_of_the_Virtual_Scholar_Institutional_Comparisons","235259887_E-measures_a_comprehensive_waste_of_time","233698564_What's_the_big_deal_and_why_is_it_a_bad_deal_for_universities","228365883_Open_access_in_context_A_user_study","220677179_User_diversity_As_demonstrated_by_deep_log_analysis","249359637_What's_the_use_The_value_of_e-resource_usage_statistics","236716287_For_Electronic_Journals_Total_Downloads_Can_Predict_Number_of_Users","223289106_A_new_finite_element_scheme_using_the_Lagrangian_framework_for_simulation_of_viscoelastic_fluid_flows"]}