{"id":"277475042_Object_Partitioning_Using_Local_Convexity","abstract":"The problem of how to arrive at an appropriate 3D-segmentation of a scene remains difficult. While current state-of-the-art methods continue to gradually improve in benchmark performance, they also grow more and more complex, for example by incorporating chains of classifiers, which require training on large manually annotated data-sets. As an alternative to this, we present a new, efficient learning-and model-free approach for the segmentation of 3D point clouds into object parts. The algorithm begins by decomposing the scene into an adjacency-graph of surface patches based on a voxel grid. Edges in the graph are then classified as either convex or concave using a novel combination of simple criteria which operate on the local geometry of these patches. This way the graph is divided into locally convex connected subgraphs, which – with high accuracy – represent object parts. Additionally, we propose a novel depth dependent voxel grid to deal with the decreasing point-density at far distances in the point clouds. This improves segmentation, allowing the use of fixed parameters for vastly different scenes. The algorithm is straightforward to implement and requires no training data, while nevertheless producing results that are comparable to state-of-the-art methods which incorporate high-level concepts involving classification, learning and model fitting.","authors":["Simon Christoph Stein","Markus Schoeler","Jeremie Papon","Florentin Wörgötter"],"meta":["June 2014","DOI:10.1109/CVPR.2014.46","Conference: IEEE Conference on Computer Vision and Pattern Recognition (CVPR)At: Columbus, OH, USA"],"references":["261353409_Segmentation_of_unknown_objects_in_indoor_environments","261263533_Voxel_Cloud_Connectivity_Segmentation_-_Supervoxels_for_Point_Clouds","260652060_Shape_Partitioning_by_Convexity","314100361_Indoor_Segmentation_and_Support_Inference_from_RGBD_Images","305651907_Interlacing_Self-Localization_Moving_Object_Tracking_and_Mapping_for_3D_Range_Sensors","262334030_Fast_and_Robust_Normal_Estimation_for_Point_Clouds_with_Sharp_Features","262222168_Indoor_Segmentation_and_Support_Inference_from_RGBD_Images","261432987_Object_discovery_in_3D_scenes_via_shape_analysis","261244794_Real-time_3D_segmentation_of_cluttered_scenes_for_robot_grasping","261227425_Perceptual_Organization_and_Recognition_of_Indoor_Scenes_from_RGB-D_Images"]}