{"id":"277562344_Recent_Advances_in_Industrial_Wireless_Sensor_Networks_Toward_Efficient_Management_in_IoT","abstract":"With the accelerated development of Internet-of-Things (IoT), wireless sensor networks (WSNs) are gaining importance in the continued advancement of information and communication technologies, and have been connected and integrated with the Internet in vast industrial applications. However, given the fact that most wireless sensor devices are resource constrained and operate on batteries, the communication overhead and power consumption are therefore important issues for WSNs design. In order to efficiently manage these wireless sensor devices in a unified manner, the industrial authorities should be able to provide a network infrastructure supporting various WSN applications and services that facilitate the management of sensor-equipped real-world entities. This paper presents an overview of industrial ecosystem, technical architecture, industrial device management standards, and our latest research activity in developing a WSN management system. The key approach to enable efficient and reliable management of WSN within such an infrastructure is a cross-layer design of lightweight and cloud-based RESTful Web service.","authors":["Zhengguo Sheng","Chinmaya Mahapatra","Chunsheng Zhu","Victor C. M. Leung"],"meta":["January 2015IEEE Access 3:622-637","DOI:10.1109/ACCESS.2015.2435000","Project: Energy Efficient devices and Architecture for the Internet of Things"],"references":["271725260_Surfing_the_Internet-of-Things_Lightweight_Access_and_Control_ofWireless_Sensor_Networks_Using_Industrial_Low_Power_Protocols","271514745_RPL_IPv6_Routing_Protocol_for_Low_power_and_Lossy_Networks","264589945_Research_Directions_for_the_Internet_of_Things","262290895_Connecting_and_Managing_M2M_Devices_in_the_Future_Internet","262201669_Research_of_single_sign-on_in_mobile_RFID_middleware_based_on_dynamic_tokens_and_WMMP","321616648_Problem_Solving_for_Wireless_Sensor_Networks","286663438_Toward_the_Internet_of_Things_application_and_management_A_practical_approach","276178671_Lightweight_Management_of_Resource_Constrained_Sensor_Devices_in_Internet-of-Things","264584402_Vita_A_Crowdsensing-Oriented_Mobile_Cyber-Physical_System","263392559_Multidimensional_Context-Aware_Social_Network_Architecture_for_Mobile_Crowdsensing"]}