{"id":"277577771_Analyzing_and_automatically_labelling_the_types_of_user_issues_that_are_raised_in_mobile_app_reviews","abstract":"Mobile app reviews by users contain a wealth of information on the issues that users are experiencing. For example, a review might contain a feature request, a bug report, and/or a privacy complaint. Developers, users and app store owners (e.g. Apple, Blackberry, Google, Microsoft) can benefit from a better understanding of these issues - developers can better understand users’ concerns, app store owners can spot anomalous apps, and users can compare similar apps to decide which ones to download or purchase. However, user reviews are not labelled, e.g. we do not know which types of issues are raised in a review. Hence, one must sift through potentially thousands of reviews with slang and abbreviations to understand the various types of issues. Moreover, the unstructured and informal nature of reviews complicates the automated labelling of such reviews. In this paper, we study the multi-labelled nature of reviews from 20 mobile apps in the Google Play Store and Apple App Store. We find that up to 30 % of the reviews raise various types of issues in a single review (e.g. a review might contain a feature request and a bug report). We then propose an approach that can automatically assign multiple labels to reviews based on the raised issues with a precision of 66 % and recall of 65 %. Finally, we apply our approach to address three proof-of-concept analytics use case scenarios: (i) we compare competing apps to assist developers and users, (ii) we provide an overview of 601,221 reviews from 12,000 apps in the Google Play Store to assist app store owners and developers and (iii) we detect anomalous apps in the Google Play Store to assist app store owners and users.","authors":["Stuart McIlroy","Nasir Ali","Hammad Khalid","Ahmed E. Hassan"],"meta":["March 2015Empirical Software Engineering 21(3)","DOI:10.1007/s10664-015-9375-7"],"references":["301632057_Meka_A_Multi-labelMulti-target_Extension_to_Weka","301428661_Prioritizing_the_devices_to_test_your_app_on_a_case_study_of_Android_game_apps","273859036_Multi-Label_Classification_An_Overview","270802875_What_Do_Mobile_App_Users_Complain_About","310589501_Analysis_of_user_comments_An_approach_for_software_requirements_evolution","291997126_Data_Mining_and_Knowledge_Discovery_Handbook","280113442_Mining_of_Massive_Datasets","271454998_Labeled_LDA","268398509_When_Should_Software_Firms_Commercialize_New_Products_Via_Freemium_Business_Models","266654056_Why_people_hate_your_app_Making_sense_of_user_feedback_in_a_mobile_app_store"]}