{"id":"277598076_A_Discrete_Bat_Algorithm_for_the_Community_Detection_Problem","abstract":"Community detection in networks has raised an important research topic in recent years. The problem of detecting communities can be modeled as an optimization problem where a quality objective function that captures the intuition of a community as a set of nodes with better internal connectivity than external connectivity is selected to be optimized. In this work the Bat algorithmwas used as an optimization algorithm to solve the community detection problem. Bat algorithm is a new Nature-inspired metaheuristic algorithm that proved its good performance in a variety of applications. However, the algorithm performance is influenced directly by the quality function used in the optimization process. Experiments on real life networks show the ability of the Bat algorithm to successfully discover an optimized community structure based on the quality function used and also demonstrate the limitations of the BA when applied to the community detection problem.","authors":["Eslam Hussein","Ahmed Hafez","Aboul Ella Hassanien","Aly Fahmy"],"meta":["June 2015","DOI:10.1007/978-3-319-19644-2_16","Conference: Hybrid Artificial Intelligent SystemsAt: Bilbao, SpainVolume: 9121","Project: Master Thesis \"Community Detection within Social Networks\""],"references":["266141318_Community_Detection_Algorithm_Based_on_Artificial_Fish_Swarm_Optimization","255971823_Bat_Algorithm_Literature_Review_and_Applications","248519014_An_Information_Flow_Model_for_Conflict_and_Fission_in_Small_Groups1","224173101_Visualization_of_large_time-varying_vector_data","301870398_Computing_communities_in_large_networks_using_random_walks_long_version","283598027_Learning_to_discover_social_circles_in_ego_networks","262298338_Testing_Community_Detection_Algorithms_A_Closer_Look_at_Datasets","260002961_Genetic_Algorithms_for_Multi-Objective_Community_Detection_in_Complex_Networks","232735635_Discovering_Social_Circles_in_Ego_Networks","221945992_Community_structure_in_social_and_biological_networks"]}