{"id":"277589616_A_review_on_user_interface_design_principles_to_increase_software_usability_for_users_with_less_computer_literacy","abstract":"This article presents a review on how software usability could be increased for users with less computer literacy. The literature was reviewed to extract user interface design principles by identifying the similar problems of this group of users. There are different groups of users with less computer literacy. However, based on the literature three groups of them need special attention from software designers. The first group is elderly users, as users with lack of computer background. The second group is children, as novice users and the third group is users with mental or physical disorders. Therefore, this study intends to focus on the mentioned groups, followed by a comparison between previous researches in the field, which reveals that some commonalities exist between the needs of these users. These commonalities were used to extract user interface design principles such as (a) reducing the number of features available at any given time, (b) avoiding using computer terms, (c) putting customization ability for font, color, size and (d) using appropriate graphical objects such as avatar or icon. Taking these principles into account can solve software usability problems and increase satisfaction of users with less computer literacy.","authors":["Ali Darejeh","Dalbir Singh"],"meta":["November 2013Journal of Computer Science 9(11):1443-1450","DOI:10.3844/jcssp.2013.1443.1450"],"references":["284481795_Web_accessibility_design_recommendations_for_people_with_cognitive_disabilities","251991190_User-interface_design_A_case_study_of_partially_sighted_children_in_Malaysia","251066088_Older_adults_computers_and_the_Internet_Future_directions","237006749_Age-specific_usability_issues_of_software_interfaces","236260921_Developmentally_situated_design_DSD_making_theoretical_knowledge_accessible_to_designers_of_children's_Technology","285838148_Usability_101_introduction_to_usability","262333710_HCI_and_the_older_population","251960844_Educational_software_adapted_to_children_with_disturbance_of_vision","239765619_A_structure_for_children-oriented_Human_Computer_Interaction","228778143_Low_vision_and_the_visual_interface_for_interactive_television"]}