{"id":"277597735_Let's_collaborate_but_i_will_be_the_first_author_Exploring_the_importance_of_the_first_authorship_for_is_researchers","abstract":"Collaboration among researchers is typically seen as the quintessence of academic excellence, leading to improvements in the research quality, capitalization on the diversity of perspectives and gains in productivity. Despite these benefits, many research teams find themselves torn by competition, antagonism and resentment. Desire to be the first author and resultant underperformance of non-first co-authors is often at the root of these conflicts. At the same time little is known about what motivates researchers in general and IS researchers in particular to engage as first authors. To fill this gap, this study uses survey methodology to explore the attitudes of IS researchers and their resulting behavior when it comes to authors order. Qualitative and quantitative evidence collected from 398 IS researchers is used to support our analysis. We find that researchers’ desire to be the first authors is mainly driven by such determinants as career aspirations, visibility, leadership and sense of ownership, and less so by the desire to satisfy their self-esteem and self-actualization needs. In addition, the value placed on being the first author appears to be the function of researchers’ career level, with Ph.D. students attaching significantly higher value to it than senior scholars.","authors":["Hanna Krasnova","Tyge-F. Kummer","Kerstin Schäfer","Natasha Veltri"],"meta":["June 2012","Conference: European Conference on Information SystemsAt: Barcelona, SpainVolume: 2012"],"references":["232546584_Reflections_on_Determining_Authorship_Credit_and_Authorship_Order_on_Faculty-Student_Collaborations","288232271_Maintenance_of_individual_visibility_in_publication_of_collaborative_research_by_psychologists","277392847_Incentives_Sorting_and_Productivity_along_the_Career_Evidence_from_a_Sample_of_Top_Economists","270135516_Only_if_I'm_first_author_Conflict_over_credit_in_management_scholarship","256558306_Data_management_and_data_analysis","248940210_An_Examination_of_Academic_Mentoring_Behaviors_and_New_Faculty_Members'_Satisfaction_with_Socialization_and_Tenure_and_Promotion_Processes","247781277_Determination_of_Authorship_Credit_in_Published_Dissertations","234022003_Work_And_Motivation","232518576_More_on_JCP_publication_Single_versus_multiple_authorship","223037277_Multiple_authorship_Issues_and_recommendations"]}