{"id":"277603578_A_Three-Stage_Approach_for_Segmenting_Degraded_Color_Images_Smoothing_Lifting_and_Thresholding_SLaT","abstract":"In this paper, we propose a SLaT (Smoothing, Lifting and Thresholding) method\nwith three stages for multiphase segmentation of color images corrupted by\ndifferent degradations: noise, information loss, and blur. At the first stage,\na convex variant of the Mumford-Shah model is applied to each channel to obtain\na smooth image. We show that the model has unique solution under the different\ndegradations. In order to properly handle the color information, the second\nstage is dimension lifting where we consider a new vector-valued image composed\nof the restored image and its transform in the secondary color space with\nadditional information. This ensures that even if the first color space has\nhighly correlated channels, we can still have enough information to give good\nsegmentation results. In the last stage, we apply multichannel thresholding to\nthe combined vector-valued image to find the segmentation. The number of phases\nis only required in the last stage, so users can choose or change it all\nwithout the need of solving the previous stages again. Experiments demonstrate\nthat our SLaT method gives excellent results in terms of segmentation quality\nand CPU time in comparison with other state-of-the-art segmentation methods.","authors":["Xiaohao Cai","Raymond Hon Fu Chan","Mila Nikolova","Tieyong Zeng"],"meta":["September 2017Journal of Scientific Computing 72(3)","DOI:10.1007/s10915-017-0402-2","SourcearXiv"],"references":["313208541_Boundary_detection_by_minimizing_functionals","271772745_A_GlobalLocal_Affinity_Graph_for_Image_Segmentation","314415795_A_convex_relaxation_approach_for_computing_minimal_partitions","310439326_A_review_of_statistical_approaches_to_level_set_segmentation_Integrating_color_texture_motion_and_shape","292793744_Random_walks_for_image_segmentation","292741720_The_split_Bregman_algorithm_for_L1_regularized_problems","292605751_Multiclass_Segmentation_by_Iterated_ROF_Thresholding","275024240_Fast_Partitioning_of_Vector-Valued_Images","269633959_The_Split_Bregman_method_for_L1-egularized_problems","268658265_Mumford_and_Shah_Model_and_Its_Applications_to_Image_Segmentation_and_Image_Restoration"]}