{"id":"277620299_Dynamic_Analysis_and_Control_of_Multi-Body_Manufacturing_Systems_Based_on_Newton-Euler_Formulation","abstract":"This paper presents the numerical dynamic analysis and control of multi-body manufacturing systems based on Newton-Euler formulation. The models of systems built with dynamical parameters are executed. The research uses Newton-Euler formulation application in mechanics calculations, where relations between contiguous bodies through joints as well as their constrained equations are considered. The kinematics and dynamics are both analyzed and acquired by practical applications. Numerical tools help to determine all dynamic characteristics of multi-body manufacturing systems such as displacements, velocities, accelerations and reaction forces of bodies and joints. Using the acquisition, the dynamic approach of multi-body manufacturing systems is developed then whole fundamentals for controller tuning are obtained. It leads to an effective solution for mechanical manufacturing system investigation. Numerical examples are also presented as the illustrations in this paper. The numerical results imply that numerical equations based on Newton-Euler algorithm are valuable in multi-body manufacturing system. It is an effective approach for solving whole mechatronic manufacturing systems including structures, kinematics, dynamics and control.","authors":["Yunn-Lin Hwang","Van-Thuan Truong"],"meta":["March 2015International Journal of Computational Methods 12(02):1550007","DOI:10.1142/S0219876215500073","Project: Dynamics"],"references":["278688207_Proposal_of_a_Method_to_Determine_Shock_Absorber_Conditions_on_a_Motor_Vehicle","251551614_Machine_tool_feed_drives","229549863_Decoupling_joint_and_elastic_accelerations_in_deformable_mechanical_systems_using_non-linear_recursive_formulations","223625894_Virtual_Machine_Tool","3272312_Practical_transfer_function_estimation_and_its_application_to_transformers","239399299_Computational_Dynamics_of_Multibody_Systems_History_Formalisms_and_Applications","235736338_On_the_Estimation_of_Transfer_Functions_Regularizations_and_Gaussian_Processes_-_Revisited","227694764_A_generalized_recursive_formulation_for_constrained_flexible_multibody_dynamics","222276236_A_New_Method_for_Simulation_of_Machining_Performance_by_Integrating_Finite_Element_and_Multi-body_Simulation_for_Machine_Tools"]}