{"id":"277603404_Variable_Metric_Inexact_Line-Search-Based_Methods_for_Nonsmooth_Optimization","abstract":"We develop a new proximal-gradient method for minimizing the sum of a\ndifferentiable, possibly nonconvex, function plus a convex, possibly non\ndifferentiable, function. The key features of the proposed method are the\ndefinition of a suitable descent direction, based on the proximal operator\nassociated to the convex part of the objective function, and an Armijo-like\nrule to determine the step size along this direction ensuring the sufficient\ndecrease of the objective function. In this frame, we especially address the\npossibility of adopting a metric which may change at each iteration and an\ninexact computation of the proximal point defining the descent direction. For\nthe more general nonconvex case, we prove that all limit points of the iterates\nsequence are stationary, while for convex objective functions we prove the\nconvergence of the whole sequence to a minimizer, under the assumption that a\nminimizer exists. In the latter case, assuming also that the gradient of the\nsmooth part of the objective function is Lipschitz, we also give a convergence\nrate estimate, showing the O(1/k) complexity with respect to the function\nvalues. We also discuss verifiable sufficient conditions for the inexact\nproximal point and we present the results of a numerical experience on a convex\ntotal variation based image restoration problem, showing that the proposed\napproach is competitive with another state-of-the-art method.","authors":["Silvia Bonettini","Ignace Loris","Federica Porta","Marco Prato"],"meta":["June 2015SIAM Journal on Optimization 26(2)","DOI:10.1137/15M1019325","SourcearXiv"],"references":["275670577_Splitting_Methods_with_Variable_Metric_for_Kurdyka-Lojasiewicz_Functions_and_General_Convergence_Rates","268743112_Variable_Metric_Forward-Backward_Algorithm_for_Minimizing_the_Sum_of_a_Differentiable_Function_and_a_Convex_Function","268248877_Introduction_to_optimization_Vvedenie_v_optimizatsiyu","256821709_Nonlinear_Programming","256365833_Accelerated_And_Inexact_Forward-Backward_Algorithms","281488455_New_convergence_results_for_the_scaled_gradient_projection_method","278828781_On_the_convergence_of_the_iterates_of_FISTA","270968498_On_some_steplength_approaches_for_proximal_algorithms","268245604_Convex_Analysis_in_General_Vector_Spaces","254222256_Scaling_techniques_for_gradient_projection-type_methods_in_astronomical_image_deblurring"]}