{"id":"277651727_Development_of_Collaborative_Learning_Using_Case-based_Learning_via_Cloud_Technology_and_Social_Media_for_Enhancing_Problem-solving_Skills_and_ICT_Literacy_within_Undergraduate_Students","abstract":"This study is conducted in terms of research and development aiming for developing collaborative learning using case-based learning via cloud technology and social media. The research process is divided into 2 phases: 1) the development of collaborative learning using case-based learning via cloud technology and social media, and 2) the affirmation of collaborative learning using case-based learning via cloud technology and social media. The research samples are five experts selected by purposive sampling. The research instruments are the model of collaborative learning using case-based learning via cloud technology and social media, and the evaluation of the model's appropriateness analyzed by means and standardized deviations statistically. The research result shows that: 1. There are four components consisted in the model which are 1) the principles of instruction model, 2) the objective of instruction model, 3) the instruction process which is divided into 2 stages: 3.1) the preparation process before actual instruction, and 3.2) the operation of instruction, and 4) evaluation and examination of data collection. 2. The five experts assessed the instruction model, and pointed out that the developed instruction model is highly appropriate. This shows that the developed instruction model can be used for enhancing problem-solving skills and ICT literacy, and improve the instruction as a whole effectively.","authors":["Jarumon Nookhong","Panita Wannapiroon"],"meta":["February 2015Procedia - Social and Behavioral Sciences 174:2096-2101","DOI:10.1016/j.sbspro.2015.02.007"],"references":["298334939_The_Social_Media_Affinity_Scale_Implications_For_Education","270848471_Enhancement_of_the_21st_Century_Skills_for_Thai_Higher_Education_by_Integration_of_ICT_in_Classroom","220095393_An_innovative_approach_for_promoting_information_exchanges_and_sharing_in_a_Web_20-based_learning_environment","236070046_Effect_of_case-based_learning_on_the_development_of_graduate_nurses'_problem-solving_ability","229146537_Case-based_learning_on_the_web","225660772_Designing_and_implementing_a_case-based_learning_environment_for_enhancing_ill-structured_problem_solving_Classroom_management_problems_for_prospective_teachers"]}