{"id":"277664694_Mouse_Tracking_for_Web_Marketing_Enhancing_User_Experience_in_Web_Application_Software_by_Measuring_Self-Efficacy_and_Hesitation_Levels","abstract":"Mouse tracking allows web developers to view the behaviour of actual users in their natural browsing environment. By tracking the mouse movements and clicks, designers can evaluate the usefulness and ease of use of their web applications in order to enhance user experience. In today's highly competitive web marketplace, mouse tracking can reveal significant benefits for web marketing issues, since it can be used to analyze user behavior, so as we developers can design web environments to attract and win over the user (web consumer). However, simple mouse tracking is not enough since user behavior in web is multifold and influenced by human factors such as gender, age, expectations, experience etc. Hence, mouse tracking should be used in compliance to human factor analysis and user behavioral (e.g. motivation, perceived ease of use, perceived usefulness, playfulness, etc) research. In this paper we address the role of two key human factors' derived behavioral attributes: self-efficacy and risk perception, and we analyze their influence on the user experience and user performance (i.e. the achievement of the desired task) while interacting with web software applications. We present the mouse tracking patterns that have been realized so far to measure these two attributes, and we conduct our own experiment by designing a prototype mouse tracking tool to measure user hesitation. Finally we discuss the contribution of this approach in the enhancement of user experience and in the broader web marketing area.","authors":["Katerina Tzafilkou","Nicolaos Protogeros","C.G. Yakinthos"],"meta":["January 2014","DOI:10.15556/IJSIM.01.04.005","Project: End User Development"],"references":["258846992_Perceived_Usefulness_Perceived_Ease_Of_Use_And_User_Accep","247727650_Development_and_Validity_of_the_Computer_Self-Efficacy_Scale","246467486_Influence_of_Self-Efficacy_on_Performance_in_a_Cognitive_Task","240278615_Factorial_Validity_of_a_Computer_Self-Efficacy_Scale_and_the_Impact_of_Computer_Training","239563461_Paradox_of_the_active_user_in_interfacing_thought_cognitive_aspects_of_human_computer_interaction","312984568_Perceived_usefulness_perceived_ease_and_user_acceptance_of_information_technology","280185016_Social_media_online_imagined_communities_and_communication_research","254005279_Accurate_measurements_of_pointing_performance_from_in_situ_observations","254005206_Mouse_tracking_Measuring_and_predicting_users'_experience_of_web-based_content","240174444_Computer_self_efficacy_and_gender_A_cross_cultural_study_of_Scotland_and_Romania"]}