{"id":"277632604_Formation_of_Professional-Mathematical_Competence_of_Students_in_the_Field_of_Technical_Training_Based_on_Interdisciplinary_Integration_of_Mathematics_and_Computer_Science","abstract":"The urgency of the problem under investigation is determined by the growing demand in the competent graduates in the field of technical training, who are ready to solve professional problems based on fundamental mathematical knowledge and practical skills, carrying out mathematical modeling of the studied processes and phenomena using mathematical application software packages. The article aims to study the theoretical and practical implementation of the methodic of the professional-mathematical competence forming of students in the field of technical training based on the integration of mathematics and computer science. The major approaches to the study of this problem are competence, integrative and activity to learning which let to identify trends in the development of professional qualities of the student’s personality through the integration of various activities by the decision of professionally-oriented tasks, taking into account individual characteristics and needs of the personality at every stage of vocational education. The formation of the professional-mathematical competence of students in the field of technical training through the integration of mathematics and computer science is considered as a target and as a learning process. Its backbone core in the forming structure of professionally-mathematical competence of students in the field of technical training stands out the mathematical modeling. The didactic object of the integration is the exploration and decision of professionally oriented integrative tasks. The materials of the article may be useful for university teachers who give lessons on professional-mathematics courses for students in the field of technical training. \n\nDOI: 10.5901/mjss.2015.v6n2s3p90","authors":["Лидия Васильева","Tatyana V. Kartuzova","Volokh Anatoliy","Nadezhda I. Merlina"],"meta":["March 2015Mediterranean Journal of Social Sciences 6(2)","DOI:10.5901/mjss.2015.v6n2s3p90"],"references":["225961802_Computer_technology_and_the_teaching_of_geometry"]}