{"id":"277723024_An_Improved_Upper_Bound_on_Maximal_Clique_Listing_via_Rectangular_Fast_Matrix_Multiplication","abstract":"The first output-sensitive algorithm for the Maximal Clique Listing problem was given by Tsukiyama et.al. in 1977. As any algorithm falling within the Reverse Search paradigm, it performs a DFS visit of a directed tree (the RS-tree) having the objects to be listed (i.e. maximal cliques) as its nodes. In a recursive implementation, the RS-tree corresponds to the recursion tree of the algorithm. The time delay is given by the cost of generating the next child of a node, and Tsukiyama showed it is O(mn). In 2004, Makino and Uno sharpened the time delay to O(n^ω) by generating all the children of a node in one single shot performed by computing a \\emph{square} fast matrix multiplication. In this paper, we further improve the asymptotics for the exploration of the same RS-tree by grouping the offsprings' computation even further. Our idea is to rely on rectangular fast matrix multiplication in order to compute all children of n^2 nodes in one shot. According to the current upper bounds on fast matrix multiplication, with this the time delay improves from O(n^2.3728639) to O(n^2.093362).","authors":["Carlo Comin","Romeo Rizzi"],"meta":["June 2015Algorithmica","DOI:10.1007/s00453-017-0402-5","SourcearXiv"],"references":["300576269_Fast_Matrix_Multiplication","257428613_Fast_Maximal_Cliques_Enumeration_in_Sparse_Graphs","230614297_The_maximum_clique_enumeration_problem_algorithms_applications_and_implementations","303802420_On_generating_all_maximal_independent_sets_Info","259983448_Powers_of_Tensors_and_Fast_Matrix_Multiplication","228712417_Two_General_Methods_to_Reduce_Delay_and_Change_of_Enumeration_Algorithms","222497318_Reverse_search_for_enumeration","222469204_On_generating_all_maximal_independent_sets","222436546_The_Worst-Case_Time_Complexity_for_Generating_All_Maximal_Cliques_and_Computational_Experiments","222112698_Faster_Algorithms_for_Rectangular_Matrix_Multiplication"]}