{"id":"277870377_Correlacion_entre_el_examen_de_admision_y_el_rendimiento_en_el_primer_ano_de_la_carrera_Ensenanza_de_la_Matematica_en_la_UNA","abstract":"Recibido 5 de noviembre, 2007 • Aprobado 15 de enero, 2008Resumen. Este artículo plantea la correlación entre el examen de admisión de la Universidad Nacional de Costa Rica, respecto al rendimiento de los estudiantes de primer ingreso a la carrera Bachillerato y Licenciatura en la Enseñanza de la Matemática, en los primeros dos cursos de la especialidad.En este análisis se consideran las variables: calificación en examen de admisión (total y por módulos), promedio de secundaria y rendimiento en los primeros dos cursos matemáticos de la carrera. Para determinar la relación entre las variables se utiliza el coeficiente de correlación de Pearson.Los resultados revelan que los módulos del examen de admisión presentan una baja correlación, con respecto al rendimiento en dichos cursos. Por esta razón, pareciera que el actual proceso de selección de estudiantes de nuevo ingreso a esa carrera, no está realizando una adecuada discriminación con respecto a las bases necesarias para garantizar el éxito.Abstract. This article analyzes the relationship between the admission exams from the Universidad Nacional de Costa Rica (UNA) and the performance of students during their first two courses of specialization in the field of Teaching Mathematics.In this analysis, the following variables were considered: individual result at the admission exam, average performance during high school and during the first two Mathematics courses of the career. To determine the relation between the variables, Pearson’s correlation coefficient was used.The results reveal that the different modules of the admission exams show a low correlation with the performance in both courses. Therefore, the research concluded that the current process of selection of students, based on an admission exam, is not a tool that can be considered adequate to detect the previous knowledge to guarantee the success in the university career","authors":["Edwin Chaves","Mario Castillo","Ronny Gamboa Araya"],"meta":["August 2008Revista Electrónica Educare 12(2)","DOI:10.15359/ree.12-2.4"],"references":["28059621_Validez_predictiva_del_Examen_de_Habilidades_y_Conocimientos_Basicos_EXHCOBA","231336531_SPSS_11_Guia_para_el_analisis_de_datos"]}