{"id":"277895445_Taming_Subgraph_Isomorphism_for_RDF_Query_Processing","abstract":"RDF data are used to model knowledge in various areas such as life sciences,\nSemantic Web, bioinformatics, and social graphs. The size of real RDF data\nreaches billions of triples. This calls for a framework for efficiently\nprocessing RDF data. The core function of processing RDF data is subgraph\npattern matching. There have been two completely different directions for\nsupporting efficient subgraph pattern matching. One direction is to develop\nspecialized RDF query processing engines exploiting the properties of RDF data\nfor the last decade, while the other direction is to develop efficient subgraph\nisomorphism algorithms for general, labeled graphs for over 30 years. Although\nboth directions have a similar goal (i.e., finding subgraphs in data graphs for\na given query graph), they have been independently researched without clear\nreason. We argue that a subgraph isomorphism algorithm can be easily modified\nto handle the graph homomorphism, which is the RDF pattern matching semantics,\nby just removing the injectivity constraint. In this paper, based on the\nstate-of-the-art subgraph isomorphism algorithm, we propose an in-memory\nsolution, TurboHOM++, which is tamed for the RDF processing, and we compare it\nwith the representative RDF processing engines for several RDF benchmarks in a\nserver machine where billions of triples can be loaded in memory. In order to\nspeed up TurboHOM++, we also provide a simple yet effective transformation and\na series of optimization techniques. Extensive experiments using several RDF\nbenchmarks show that TurboHOM++ consistently and significantly outperforms the\nrepresentative RDF engines. Specifically, TurboHOM++ outperforms its\ncompetitors by up to five orders of magnitude.","authors":["Jinha Kim","Hyungyu Shin","Wook-Shin Han","Sungpack Hong"],"meta":["June 2015Proceedings of the VLDB Endowment 8(11)","DOI:10.14778/2809974.2809985","SourcearXiv"],"references":["266656627_Morsel-driven_parallelism_A_NUMA-aware_query_evaluation_framework_for_the_many-core_age","262244020_Trinity_A_distributed_graph_engine_on_a_memory_cloud","290110321_Sesame_A_Generic_Architecture_for_Storing_and_Querying_RDF_and_RDF_Schema","289659538_Hexastore","280113431_Billion_Triples_Challenge_data_set","274343540_An_in-depth_comparison_of_subgraph_isomorphism_algorithms_in_graph_databases","269837853_Taming_verification_hardness","262241648_TripleBit_A_fast_and_compact_system_for_large_scale_RDF_data","262217075_A_distributed_graph_engine_for_web_scale_RDF_data","262172151_TurboISO_Towards_ultrafast_and_robust_subgraph_isomorphism_search_in_large_graph_databases"]}