{"id":"277806780_A_quarta_revolucao_educacional_a_mudanca_de_tempos_espacos_e_relacoes_na_escola_a_partir_do_uso_de_tecnologias_e_da_inclusao_social_The_fourth_educational_revolution_changes_of_time_space_and_relation","abstract":"Este artigo discute os movimentos de evolução da educação nos últimos séculos, buscando demonstrar como movimentos de democratização e universalização do acesso ao ensino promoveram a inclusão de todas as pessoas nos processos educativos. A escola, tal como a conhecemos, estruturada nos séculos XVIII e XIX sob princípios de exclusão e homogeneização, não parece estar dando conta das demandas de uma educação inclusiva, o que vem impactando as metas de qualidade do conhecimento almejadas pelas sociedades contemporâneas. Esse impasse vem demandando uma reinvenção da educação, que envolve transformações nos conteúdos, na forma e nas relações entre docentes e discentes dentro dos espaços educativos. Como exemplo de caminhos a serem seguidos para reinventar a educação, apresenta-se a estrutura de um curso de especialização que articula metodologias ativas de aprendizagem com novas e diversas Tecnologias de Informação e Comunicação e a preocupação com a ética pessoal e profissional.AbstractThis article discusses the evolution of education in recent centuries, trying to demonstrate how movements of democratization and universal access to education promoted the inclusion of all people in the educational processes. The school, as we know, structured in the eighteenth and nineteenth centuries on principles of exclusion and homogenization, there seems not to be catching on the demands of an inclusive education, which has been impacting the quality goals of knowledge desired by contemporary societies. This impasse has been demanding a re-invention of education, which involves changes in the content, form and relationships between teachers and students within the educational spaces. As an example of paths to be followed to re-invent education, is presented the structure of a specialization course which combines active learning methodologies with new and diverse Information Technology and Communication tools, and the concern for personal and professional ethics.","authors":["Ulisses F. Araújo"],"meta":["November 2010ETD - Educação Temática Digital 12(mar.)","DOI:10.20396/etd.v12i0.1202","Project: Teacher's training in active learning methodologies"],"references":["285118511_The_wisdom_of_practice_Managing_complexity_in_medicine_and_teaching","239052759_Student_Perceptions_of_Tutor_Effectiveness_in_a_Problem-Based_Surgery_Clerkship","220295437_Learner-Centered_Teaching_and_the_Use_of_Technology"]}