{"id":"277892098_Ontology-based_Geospatial_Data_Query_and_Integration","abstract":"Geospatial data sharing is an increasingly important subject as large amount of data is produced by variety of sources, stored in incompatible formats, and accessible through different GIS applications. Past efforts to enable sharing have produced standardized data format such as GML and data access protocols such as Web Feature Service (WFS). While these standards help enabling client applications to gain access to heterogeneous data stored in different formats from diverse sources, the usability of the access is limited due to the lack of data semantics encoded in the WFS feature types. Past research has used on-tology languages to describe the semantics of geospatial data but ontology-based queries cannot be applied directly to legacy data stored in databases or shape-files, or to feature data in WFS services. This paper presents a method to enable ontology query on spatial data available from WFS services and on data stored in databases. We do not create ontology instances explicitly and thus avoid the problems of data replication. Instead, user queries are rewritten to WFS getFea-ture requests and SQL queries to database. The method also has the benefits of being able to utilize existing tools of databases, WFS, and GML while enabling query based on ontology semantics.","authors":["Zhong-Ren Peng","Tian Zhao","Chuanrong Zhang","Mingzhen Wei"],"meta":["January 2008"],"references":["250016078_The_Roles_of_Web_Feature_and_Web_Map_Services_in_Real-time_Geospatial_Data_Sharing_for_Time-critical_Applications","239490591_D2RQ-Treating_non-RDF_databases_as_virtual_RDF_graphs","230745455_The_Description_Logic_Handbook_Theory_Implementation_and_Applications","228918292_GML-Based_Interoperable_Geographical_Databases","228672494_Geospatial_data_sharing_based_on_Geospatial_Semantic_Web_technologies","326341675_Query_Answering_for_OWL-DL_with_rules","319395635_The_Description_Logic_Handbook_Theory_Implementation_and_Applications","234769949_An_approach_for_service_oriented_discovery_and_retrieval_of_spatial_data","228771962_Geospatial_Ontology_Development_and_Semantic_Analytics","228057911_The_Semantic_Web"]}