{"id":"277801502_Why_is_Tanimoto_index_an_appropriate_choice_for_fingerprint-based_similarity_calculations","abstract":"Cheminformaticians are equipped with a very rich toolbox when carrying out molecular similarity calculations. A large number of molecular representations exist, and there are several methods (similarity and distance metrics) to quantify the similarity of molecular representations. In this work, eight well-known similarity/distance metrics are compared on a large dataset of molecular fingerprints with sum of ranking differences (SRD) and ANOVA analysis. The effects of molecular size, selection methods and data pretreatment methods on the outcome of the comparison are also assessed.\nA supplier database (https://mcule.com/) was used as the source of compounds for the similarity calculations in this study. A large number of datasets, each consisting of one hundred compounds, were compiled, molecular fingerprints were generated and similarity values between a randomly chosen reference compound and the rest were calculated for each dataset. Similarity metrics were compared based on their ranking of the compounds within one experiment (one dataset) using sum of ranking differences (SRD), while the results of the entire set of experiments were summarized on box and whisker plots. Finally, the effects of various factors (data pretreatment, molecule size, selection method) were evaluated with analysis of variance (ANOVA).\nThis study complements previous efforts to examine and rank various metrics for molecular similarity calculations. Here, however, an entirely general approach was taken to neglect any a priori knowledge on the compounds involved, as well as any bias introduced by examining only one or a few specific scenarios. The Tanimoto index, Dice index, Cosine coefficient and Soergel distance were identified to be the best (and in some sense equivalent) metrics for similarity calculations, i.e. these metrics could produce the rankings closest to the composite (average) ranking of the eight metrics. The similarity metrics derived from Euclidean and Manhattan distances are not recommended on their own, although their variability and diversity from other similarity metrics might be advantageous in certain cases (e.g. for data fusion). Conclusions are also drawn regarding the effects of molecule size, selection method and data pretreatment on the ranking behavior of the studied metrics. Graphical AbstractA visual summary of the comparison of similarity metrics with sum of ranking differences (SRD).","authors":["Dávid Bajusz","Anita Rácz","Károly Héberger"],"meta":["May 2015Journal of Cheminformatics 7(1)","DOI:10.1186/s13321-015-0069-3"],"references":["257883228_HttpMculecom_A_public_web_service_for_drug_discovery","264866258_Molecular_fingerprint_similarity_search_in_virtual_screening","259119689_Erratum_to_Method_and_model_comparison_by_sum_of_ranking_differences_in_cases_of_repeated_observations_ties_Chemom_Intell_Lab_Syst_127_2013_139-146","258038075_Molecular_Similarity_in_Medicinal_Chemistry","256705037_Benchmarking_of_Multivariate_Similarity_Measures_for_High-Content_Screening_Fingerprints_in_Phenotypic_Drug_Discovery","255698081_Method_and_Model_Comparison_by_Sum_of_Ranking_differences_in_Cases_of_Repeated_Observations_Ties","251342981_Similarity_and_Dissimilarity_A_Medicinal_Chemist's_View","250697379_Weighted_Superstructures_for_Chemical_Similarity_Searching","238118218_Sum_of_ranking_differences_compares_methods_or_models_fairly","234087462_Combination_of_Similarity_Rankings_Using_Data_Fusion"]}