{"id":"277940297_Enhancing_post-disaster_reconstruction_capacity_through_lifelong_learning_in_higher_education","abstract":"Purpose\n– Due to the complexities involved in disasters and due to the peculiar nature of post-disaster reconstruction, built environment professionals require continuous updating of their skills and knowledge to contribute effectively to disaster resilience. The purpose of this paper is to identify the ways in which higher education institutions (HEIs) can address this need through the provision of lifelong learning.\n\nDesign/methodology/approach\n– This paper is based on both a literature review and on empirical evidence obtained through interviews, a workshop and group validation.\n\nFindings\n– The challenges faced by HEIs in accommodating lifelong learning are presented. Furthermore, good practice guidelines are provided to enable HEIs to respond effectively to industry requirements; to provide lifelong learning via through-life studentship; to promote collaboration amongst HEIs, industries, professional bodies and communities, and to promote the adoption, diffusion and exploitation of the latest learning and teaching technologies.\n\nResearch limitations/implications\n– The empirical focus of the research is limited to three EU countries, namely UK, Lithuania and Estonia. This paper focuses on role of HEIs in enhancing the disaster risk reduction (DRR) capacity in the built environment, especially at the stage of post-disaster reconstruction.\n\nPractical implications\n– The recommendations provided on good practice suggest how HEIs can integrate disaster related knowledge into their curriculum faster than previously and how they are able to assist their educators and learners in building up their knowledge base on a continuous basis.\n\nSocial implications\n– Capacity building in enhancing DRR during the post-disaster reconstruction stage through the provision of lifelong learning will create social implications within the responsiveness of built environment professionals to cater for disaster resilience.\n\nOriginality/value\n– The appropriateness of lifelong learning as an approach to disaster management education is justified. The challenges HEIs face in accommodating lifelong learning and the recommendations on good practice guidelines in order to make the HEIs more responsive to educational needs are discussed.","authors":["Menaha Thayaparan","Mohan Siriwardena","Chamindi Malalgoda","Dilanthi Amaratunga"],"meta":["June 2015Disaster Prevention and Management 24(3):338-354","DOI:10.1108/DPM-11-2014-0239","Project: ASCENT"],"references":["301624536_Reforming_HEI_to_improve_skills_and_knowledge_on_disaster_resilience_among_construction_professionals","281222010_Introduction_The_need_for_built_-_in_resilience","275541320_The_Current_Landscape_of_Disaster_Resilience_Education_in_Europe","265409816_Lifelong_Learning_needs_for_Disaster_Management_Education_in_the_Built_Environment","261583486_Disaster_resilient_built_environment_role_of_lifelong_learning_and_the_implications_for_higher_education","235288612_Managing_disaster_knowledge_Identification_of_knowledge_factors_and_challenges","228544250_An_analysis_of_the_alliancing_procurement_method_for_reconstruction_following_an_earthquake","257342960_UNISDR_terminology_on_disaster_risk_reduction_United_Nations","240916957_Rethinking_Construction_The_Report_of_the_Construction_Task_Force","238669002_Reconstruction_management_and_post-disaster_low-cost_housing_the_case_for_social_reconstruction"]}