{"id":"277941134_Computer_science_research_the_top_100_institutions_in_India_and_in_the_world","abstract":"This paper aims to perform a detailed scientometric and text-based analysis of Computer Science (CS) research output of the 100 most productive institutions in India and in the world. The analytical characterization is based on research output data indexed in Scopus during the last 25 years period (1989-2013). Our computational analysis involves a two-dimensional approach involving the standard scientometric methodology and text-based analysis. The scientometric characterization aims to assess CS domain research output in leading Indian institutions vis-à-vis the leading world institutions and to bring out the similarities and differences among them. It involves analysis along traditional scientometric indicators such as total output, citation-based impact assessment, co-authorship patterns, international collaboration levels etc. The text-based characterization aims to identify the key research themes and their temporal trends for the two sets. The key contribution of the experimental work is that it’s an analytical characterization of its kind, which identifies characteristic similarities and differences in CS research landscape of Indian institutions vis-à-vis world institutions.","authors":["Vivek Kumar Singh","Ashraf Uddin","David Pinto"],"meta":["August 2015Scientometrics 104(2)","DOI:10.1007/s11192-015-1612-8"],"references":["273518306_A_Quantity-Quality_Composite_Ranking_of_Indian_Institutions_in_CS_Research","272123501_Scientometric_Analysis_of_Stem_cell_Research_A_comparative_study_of_India_and_other_countries","266160151_Measuring_research_output_and_collaboration_in_South_Asian_countries","257692196_The_collaboration_behaviors_of_scientists_in_Italy_A_field_level_analysis","257663339_Scientific_collaboration_in_biotechnology_The_case_of_the_northeast_region_in_Brazil","271995403_Mapping_the_Computer_Science_Research_in_SAARC_Countries","257692198_A_layered_framework_to_study_collaboration_as_a_form_of_knowledge_sharing_and_diffusion","257692188_Independent_research_of_China_in_Science_Citation_Index_Expanded_during_1980-2011","257663242_Researchers_profile_co-authorship_pattern_and_knowledge_organization_in_information_science_in_Brazil","257663175_Physics_publication_productivity_in_South_African_universities"]}