{"id":"277959219_Circulant_Temporal_Encoding_for_Video_Retrieval_and_Temporal_Alignment","abstract":"We address the problem of specific video event retrieval. Given a query video of a specific event, eg. a concert of Madonna, the goal is to retrieve other videos of the same event that temporally overlap with the query. \nOur approach encodes the frame descriptors of a video to jointly represent their appearance and temporal order. It exploits the properties of circulant matrices to efficiently compare the videos in the frequency domain. This offers a significant gain in complexity and accurately localizes the matching parts of videos. The descriptors can be compressed in the frequency domain with a product quantizer adapted to complex numbers. In this case, video retrieval is performed without decompressing the descriptors. \nThe second problem we consider is the temporal alignment of a set of videos. We exploit the matching confidence and an estimate of the temporal offset computed for all pairs of videos by our retrieval approach. Our robust algorithm aligns the videos on a global timeline by maximizing the set of temporally consistent matches. The global temporal alignment enables synchronous playback of the videos of a given scene.","authors":["Matthijs Douze","Jerome Revaud","Jakob Verbeek","Hervé Jégou"],"meta":["September 2016International Journal of Computer Vision 119(3)","DOI:10.1007/s11263-015-0875-0","SourcearXiv"],"references":["317083797_Hamming_Embedding_and_Weak_Geometric_Consistency_for_Large_Scale_Image_Search","284177735_TRECVID_2014_-_An_Overview_of_the_Goals_Tasks_Data_Evaluation_Mechanisms_and_Metrics","319770370_Three_things_everyone_should_know_to_improve_object_retrieval","316588757_A_Wavelet_Tour_of_Signal_Processing","316240097_Distinctive_Image_Features_from_Scale-Invariant_Keypoints","314734002_Unstructured_video-based_rendering_interactive_exploration_of_casually_captured_videos","313527089_Distinctive_image_features_from_scale-invariant_key_points","313077750_A_Survey_of_Image_Registration_Techniques","288990344_Exact_Acceleration_of_Linear_Object_Detectors","280940018_Pattern_Recognition_and_Machine_Learning"]}