{"id":"277944026_An_Extended_Pareto_Distribution","abstract":"For the first time, a new continuous distribution, called the generalized beta exponentiated Pareto type I (GBEP) [McDonald exponentiated Pareto] distribution, is defined and investigated. The new distribution contains as special sub-models some well-known and not known distributions, such as the generalized beta Pareto (GBP) [McDonald Pareto], the Kumaraswamy exponentiated Pareto (KEP), Kumaraswamy Pareto (KP), beta exponentiated Pareto (BEP), beta Pareto (BP), exponentiated Pareto (EP) and Pareto, among several others. Various structural properties of the new distribution are derived, including explicit expressions for the moments, moment generating function, incomplete moments, quantile function, mean deviations and Re´nyi entropy. Lorenz, Bonferroni and Zenga curves are derived. The method of maximum likelihood is proposed for estimating the model parameters. We obtain the observed information matrix. The usefulness of the new model is illustrated by means of two real data sets. We hope that this generalization may attract wider applications in reliability, biology and lifetime data analysis.","authors":["Mohamad Mead"],"meta":["December 2014Pakistan Journal of Statistics and Operation Research 10(4):313","DOI:10.18187/pjsor.v10i3.766"],"references":["307523271_THE_MC-DAGUM_DISTRIBUTION_AND_ITS_STATISTICAL_PROPERTIES_WITH_APPLICATIONS","279928019_Families_of_distributions_arising_from_distributions_of_order_statistics","270276326_McDonald_log-logistic_distribution_with_an_application_to_breast_cancer_data","269966486_The_Beta_Exponentiated_Pareto_Distribution_with_Application_to_Bladder_Cancer_Susceptibility","263801375_Upper-truncated_power_law_distributions","324333879_Table_of_Integrals_Series_and_Products","287609986_On_the_Properties_of_Beta-Gamma_Distribution","272535992_The_Kumaraswamy_Exponentiated_Pareto_Distribution","265331203_The_beta_generalized_Pareto_distribution","263677357_The_McDonald_Weibull_model"]}