{"id":"277987906_Automated_monitoring_of_coastal_aquifers_with_electrical_resistivity_tomography","abstract":"An Automated time-Lapse Electrical Resistivity Tomography (ALERT) system has been developed for the long-term monitoring of coastal aquifers. This ALERT system has been permanently installed in the River Andarax, Almeria, Spain to monitor and manage the impact of climatic change and land-use practice on the underlying Quaternary aquifer. An electrode array, nearly 1.6 km long, has been buried below the normally dry riverbed with electrode take-outs at regular intervals of 10 m. The maximum depth of investigation is about 160 m below ground level. An unmanned, permanent control station, in a secure location, allows the aquifer to be interrogated remotely from the BGS office in the UK. Volumetric geoelectric images of the subsurface can be obtained 'on demand' or at regular intervals; thereby eliminating the need for expensive repeat surveys. The entire process from data capture to image on the office PC is fully automated and seamless. The ALERT technology can provide early warning of potential threats to vulnerable water systems such as over-exploitation, rising sea levels, anthropogenic pollutants and seawater intrusion. The electrical images obtained (in space and time) are interpreted in terms of the hydrogeologic features including the seawater-freshwater interface. The timely detection and imaging of groundwater changes can help to regulate pumping and irrigation schemes.","authors":["Richard Ogilvy","Phil Meldrum","Oliver Kuras","Paul B. Wilkinson"],"meta":["October 2009Near Surface Geophysics 7(5)"],"references":["273682037_Characterization_of_seawater_intrusion_using_2D_electrical_imaging","271190903_Seepage_monitoring_in_an_earth_embankment_dam_by_repeated_resistivity_measurements","240842405_Monitoring_of_Leachate_Recirculation_in_a_Bioreactor_Landfill_by_2-D_Electrical_Resistivity_Imaging","274431503_A_structured_approach_to_the_use_of_near-surface_geophysics_in_long-term_monitoring","259674851_Low-cost_reservoir_tomographs_of_electrical_resistivity","253490108_Least-Squares_Deconvolution_of_Apparent_Resistivity_Pseudosections","249868245_Using_time-lapse_electrical_geophysics_to_monitor_subsurface_processes","240842380_Time-lapse_Monitoring_in_Single_Boreholes_Using_Electrical_Resistivity_Tomography","229557742_Practical_technique_for_3D_resistivity_surveys_and_data_inversion","227954484_Improved_strategies_for_the_automatic_selection_of_optimized_sets_of_electrical_resistivity_tomography_measurement_configurations"]}