{"id":"278092134_TRANSNATIONAL_SCHOOL_PARTNERSHIPS_SUPPORTED_BY_ICT_BENEFITS_FOR_LEARNING","abstract":"Education faces a continuous reform aimed to modernize the system as a whole and particularly the teaching and learning practices. The pressure for reforming education is sustained by the social changes, mainly determined by the technological progress. Pupils, teachers and parents' mobility, the economical and cultural globalization and the increasing use of information and communication technology (ICT) in almost all the aspects of everyday life are influencing the school transformation. In this context, the needs for communication and collaboration, for exchange of ideas and for harmonizing the education between countries are obvious. ICT-supported school partnerships are a suitable solution to transfer practices, to export education practices / models and to support mutual learning. An important European Action - eTwinning, part of Comenius - Lifelong Learning Programme proved its benefits for supporting school transformation and for influencing teaching and learning. This paper analyses the role of ICT-based partnerships for changing the school and the learning process, with a particular focus on eTwinning school projects. During the 5 years of implementing eTwinning in Romania, more than 8000 teachers from around 4000 schools, high schools and kindergartens were involved in over 10.000 partnerships with schools from Europe. At European level, more than 150.000 teachers joined this initiative and benefit from being part of a European teachers' community. eTwinning targets schools, teachers and pupils, and in a broader sense, the whole education system. But teachers are the main actors in making partnerships work. How prepared are they for initiating, managing and evaluating ICT-based partnerships? What type of competences do they need? What motivates them, what type of support is needed and from whom?","authors":["Luciana-Simona Velea"],"meta":["January 2012","DOI:10.5682/2066-026X-12-061","Conference: 8th International Scientific Conference eLearning and Software for"],"references":["255568940_Current_Issues_of_Digital_Education","255568935_Intel_Education_initiative_Focus_Romania","255568877_EDUCATION_STAFF_WORKING_IN_ELEARNING_ENVIRONMENTS_SKILLS_AND_COMPETENCES","228371531_SEI-A_PROJECT_BASED_ELEARNING_IMPLEMENTING_NATIONWIDE_ELEARNING_PROJECTS-A_GUARANTEE_OF_A_BETTER_FUTURE"]}