{"id":"278024524_A_Novel_Ant_Colony_Algorithm_for_Building_Neural_Network_Topologies","abstract":"A re-occurring challenge in applying feed-forward neural networks to a new dataset is the need to manually tune the neural network topology. If one’s attention is restricted to fully-connected three-layer networks, then there is only the need to manually tune the number of neurons in the single hidden layer. In this paper, we present a novel Ant Colony Optimization (ACO) algorithm that optimizes neural network topology for a given dataset. Our algorithm is not restricted to three-layer networks, and can produce topologies that contain multiple hidden layers, and topologies that do not have full connectivity between successive layers. Our algorithm uses Backward Error Propagation (BP) as a subroutine, but it is possible, in general, to use any neural network learning algorithm within our ACO approach instead. We describe all the elements necessary to tackle our learning problem using ACO, and experimentally compare the classification performance of the optimized topologies produced by our ACO algorithm with the standard fully-connected three-layer network topology most-commonly used in the literature.","authors":["Khalid Magdy Salama","Ashraf A. Abdelbar"],"meta":["September 2014","DOI:10.1007/978-3-319-09952-1_1","Conference: International Conference on Swarm IntelligenceAt: Brussels"],"references":["260621900_A_New_Sequential_Covering_Strategy_for_Inducing_Classification_Rules_With_Ant_Colony_Algorithms","257635858_Inducing_decision_trees_with_an_ant_colony_optimization_algorithm","257066881_Utilizing_multiple_pheromones_in_an_ant-based_algorithm_for_continuous-attribute_classification_rule_discovery","252320813_Ant_Colony_Optimization_for_Mixed-Variable_Optimization_Problems","230725654_Multiple_pheromone_types_and_other_extensions_to_the_AntMiner_classification_rule_discovery_algorithm","278185803_Extending_the_ABC-Miner_Bayesian_Classification_Algorithm","278024202_Ant_Colony_Algorithms_for_Constructing_Bayesian_Multi-net_Classifiers","257066914_Clustering-based_Bayesian_Multi-net_Classifier_Construction_with_Ant_Colony_Optimization","257066703_Learning_Bayesian_Network_Classifiers_Using_Ant_Colony_Optimization","222648962_A_colony_optimization_for_continuous_domains"]}