{"id":"278118071_Using_social_media_to_recruit_global_supply_chain_managers","abstract":"Purpose\n– The purpose of the paper is to investigate if, and to what degree, social media are used for the recruitment of global supply chain managers.\n\nDesign/methodology/approach\n– This is a conceptual paper that discusses how organizations should engage with social media platforms for effective recruitment of global supply chain managers.\n\nFindings\n– Findings are that organizations seeking to employ global supply chain managers, particularly those engaged in B2B activities, lag other industry sectors in adopting new ways of recruiting talent. Building on the findings, we present models of how organizations should move to adopt web-based technologies and the steps needed to engage fully in using social media to recruit global supply chain managers.\n\nResearch limitations/implications\n– Global supply chains (including logistics) lag other industry sectors in adopting social media networks for recruitment, and risk missing out on talent if the issues are not addressed. Serious consideration needs to be given, particularly by B2B but also by B2C businesses, in order to attract suitable employees. Employees’ and prospective employees’ expectations will increasingly revolve around the use of social media.\n\nOriginality/value\n– The research is original in that it investigates an emerging, contemporaneous issue that is of considerable importance in recruiting global supply chain managers. The research provides value by highlighting that in recruiting global supply chain managers, organizations have been slow to adopt new technologies, and recommends actions to remedy this.","authors":["Ron Fisher","Ruth Mcphail","Emily You","Maria Ash"],"meta":["September 2014International Journal of Physical Distribution & Logistics Management 44(8-9):635-645","DOI:10.1108/IJPDLM-07-2013-0179"],"references":["279893388_How_Large_US_Companies_Can_Use_Twitter_and_Other_Social_Media_to_Gain_Business_Value","258190136_LinkedIn_and_Facebook_in_Belgium_The_Influences_and_Biases_of_Social_Network_Sites_in_Recruitment_and_Selection_Procedures","257715570_Engaging_Young_Employees_Gen_Y_in_a_Social_Media_Dominated_World_-_Review_and_Retrospection","303206690_Using_social_network_sites_to_investigate_employees_in_the_hospitality_industry","289627083_Marketing_to_the_Social_Web_How_Digital_Customer_Communities_Build_Your_Business_Second_Edition","287710984_Analyzing_the_Social_Web","271560089_Using_social_networking_websites_as_a_selection_tool_The_role_of_selection_process_fairness_and_job_pursuit_intentions","264736332_Aligning_global_organizations'_human_capital_needs_and_global_supply-chain_strategies","257103444_Social_Media_Competitive_Analysis_and_Text_mining_A_Case_Study_in_the_Pizza_Industry","256923897_Facebook_and_personnel_selection_What's_the_big_deal"]}