{"id":"278195995_On_the_Formulation_of_Conceptual_Spaces_for_Land_Cover_Classification_Systems","abstract":"Cognitive approaches to knowledge representation improve man-machine communication, as they are close to human reasoning. Conceptual spaces have been proposed as one such knowledge formalization method. Our research investigates the theory of conceptual spaces as a methodology for implementing semantic reference systems. Conceptual spaces are spanned by quality dimensions. Concepts are represented as regions in n-dimensional spaces and instances as n-dimensional vectors. The land cover domain is chosen for applying this theory with the view to formulating a conceptual space from textual descriptions. Based on a land cover classification system and its descriptions, the methodology for extracting the quality dimensions is demonstrated and their measurement scales are discussed. The usefulness of formalizing a classification system as conceptual space is demonstrated in the process of semantically transforming instances from one classification system to another.","authors":["Alkyoni Baglatzi","Werner Kuhn"],"meta":["January 2013","DOI:10.1007/978-3-319-00615-4_10","Conference: 16th AGILE Conference on Geographic Information Science"],"references":["250016043_Rethinking_Levels_of_Measurement_for_Cartography","245584936_WonderWeb_Deliverable_D18_Ontology_Library","242393176_Mapping_Nominal_Values_to_Numbers_by_Data_Mining_Spectral_Properties_of_Leaves","238438154_Implementing_semantic_reference_systems","292760924_On_Confusing_'Measure'_with_'Measurement'_in_the_Methodology_of_Behavioral_Science","261779291_Determinables_as_Universals","261080001_Mapping_nominal_values_to_numbers_for_effective_visualization","250730246_The_art_and_science_of_mapping_Computing_geological_categories_from_field_data","243642012_The_1_km_resolution_global_data_set_needs_of_the_International_Geosphere_Biosphere_Programme","240674036_Leaf_phenology_as_an_optimal_strategy_for_carbon_gain_in_plants"]}