{"id":"278331931_MeSHLabeler_improving_the_accuracy_of_large-scale_MeSH_indexing_by_integrating_diverse_evidence","abstract":"Medical Subject Headings (MeSHs) are used by National Library of Medicine (NLM) to index almost all citations in MEDLINE, which greatly facilitates the applications of biomedical information retrieval and text mining. To reduce the time and financial cost of manual annotation, NLM has developed a software package, Medical Text Indexer (MTI), for assisting MeSH annotation, which uses k-nearest neighbors (KNN), pattern matching and indexing rules. Other types of information, such as prediction by MeSH classifiers (trained separately), can also be used for automatic MeSH annotation. However, existing methods cannot effectively integrate multiple evidence for MeSH annotation.\nWe propose a novel framework, MeSHLabeler, to integrate multiple evidence for accurate MeSH annotation by using 'learning to rank'. Evidence includes numerous predictions from MeSH classifiers, KNN, pattern matching, MTI and the correlation between different MeSH terms, etc. Each MeSH classifier is trained independently, and thus prediction scores from different classifiers are incomparable. To address this issue, we have developed an effective score normalization procedure to improve the prediction accuracy.\nMeSHLabeler won the first place in Task 2A of 2014 BioASQ challenge, achieving the Micro F-measure of 0.6248 for 9,040 citations provided by the BioASQ challenge. Note that this accuracy is around 9.15% higher than 0.5724, obtained by MTI.\nThe software is available upon request.\nzhusf@fudan.edu.cn.\n© The Author 2015. Published by Oxford University Press.","authors":["Ke Liu","Shengwen Peng","Junqiu Wu","Chengxiang Zhai"],"meta":["June 2015Bioinformatics 31(12):i339-i347","DOI:10.1093/bioinformatics/btv237","SourcePubMed"],"references":["289393652_Large-scale_semantic_indexing_of_biomedical_publications_at_BioASQ","284738553_Database_resources_of_the_National_Center_for_Biotechnology_Information","263813673_A_Review_On_Multi-Label_Learning_Algorithms","263639232_A_One-Size-Fits-All_Indexing_Method_Does_Not_Exist_Automatic_Selection_Based_on_Meta-Learning","307881957_LIBSVM_A_library_for_support_vector_machines","287856958_The_NLM_medical_text_indexer_system_for_indexing_biomedical_literature","281566791_Results_of_the_first_BioASQ_workshop","272623654_Libsvm","266140300_NCBI_at_the_2014_BioASQ_challenge_task_large-scale_biomedical_semantic_indexing_and_question_answering","260586635_Efficient_Semisupervised_MEDLINE_Document_Clustering_With_MeSH-Semantic_and_Global-Content_Constraints"]}