{"id":"278334053_Modelling_of_Columnar-to-Equiaxed_and_Equiaxed-to-Columnar_Transitions_in_Ingots_Using_a_Multiphase_Model","abstract":"We present a new method to handle a representative elementary volume (REV) with a mixture of columnar and equiaxed grains in ingot castings in the framework of an Eulerian volume averaged model. The multiscale model is based on a previously established fully equiaxed model. It consists of a three-phase (extra-granular liquid, intra-granular liquid and solid) grain-growth stage coupled with a two-phase (solid and liquid) macroscopic transport stage accounting for grain and nuclei movement.\nIn this context, we take into account the formation of a columnar structure and its development using a simplified front-tracking method. Columnar solidification is coupled with the growth of equiaxed grains ahead of the columnar front. The particularity of the model is the treatment of concurrent growth of mixed columnar and equiaxed structures only in the volumes that contain the columnar front. Everywhere else, the structure is considered either fully columnar or fully equiaxed. This feature allows for reasonable computational times even in industrial size castings, while describing the solutal and mechanical blocking phenomena responsible for the Columnar-to-Equiaxed Transition.\nAfter a validation of the model, we discuss the numerical results for a 6.2-ton industrial steel ingot by comparison with experimental measurements. Final maps for macrosegregation and grain structures size and morphology are analysed. Furthermore, we quantify the impact of nuclei formation through fragmentation along the columnar front on the result.\nAn attempt at predicting the occurrence of the Equiaxed-to-Columnar Transition in the later phases of the process is also made.","authors":["N Leriche","Combeau Hervé","Charles-Andre GANDIN","Miha Založnik"],"meta":["June 2015IOP Conference Series Materials Science and Engineering 84(1)","DOI:10.1088/1757-899X/84/1/012087"],"references":["272639298_Influence_of_Dendritic_Morphology_on_the_Calculation_of_Macrosegregation_in_Steel_Ingot","262055360_Simulation_of_macrosegregation_in_a_245-ton_steel_ingot_using_a_three-phase_mixed_columnar-equiaxed_model","257789029_Prediction_of_equiaxed_grain_structure_and_macrosegregation_in_an_industrial_steel_ingot_Comparison_with_experiment","227305011_The_influence_of_convection_during_solidification_on_fragmentation_of_the_mushy_zone_of_a_model_alloy","226962950_A_solutal_interaction_mechanism_for_the_columnar-to-equiaxed_transition_in_alloy_solidification_vol_34A_pg_1657_2003","225626990_Mechanical_Blocking_Mechanism_for_the_Columnar_to_Equiaxed_Transition","248373065_Dendritic_Growth_into_Under_Cooled_Alloy","236121240_Solute_Diffusion_Model_for_Equiaxed_Dendritic_Growth","230909961_Ensemble_averaged_multiphase_Eulerian_model_for_columnarequiaxed_solidification_of_a_binary_alloy_I_The_mathematical_model","226706129_The_development_of_macrostructure_in_ingots_of_increasing_size"]}