{"id":"278332478_Combinatorial_Topology_of_the_Standard_Chromatic_Subdivision_and_Weak_Symmetry_Breaking_for_Six_Processes","abstract":"In this paper we study a family of discrete configuration spaces, the\nso-called protocol complexes, which are of utmost importance in theoretical\ndistributed computing. Specifically, we consider questions of the existance of\ncompliant binary labelings on the vertices of iterated standard chromatic\nsubdivisions of an n-simplex. The existance of such labelings is equivalent to\nthe existance of distributed protocols solving Weak Symmetry Breaking task in\nthe standard computational model.\nAs a part of our formal model, we introduce function sb(n), defined for\nnatural numbers n, called the symmetry breaking function. From the geometric\npoint of view sb(n) denotes the minimal number of iterations of the standard\nchromatic subdivision of an (n-1)-simplex, which is needed for the compliant\nbinary labeling to exist. From the point of distributed computing, the function\nsb(n) measures the minimal number of rounds in a protocol solving the Weak\nSymmetry Breaking task.\nIn addition to the development of combinatorial topology, which is applicable\nin a broader context, our main contribution is the proof of new bounds for the\nfunction sb(n). Accordingly, the bulk of the paper is taken up by in-depth\nanalysis of the structure of adjacency graph on the set of n-simplices in\niterated standard chromatic subdivision of an n-simplex. On the algorithmic\nside, we provide the first distributed protocol solving Weak Symmetry Breaking\ntask in the layered immediate snapshot computational model for some number of\nprocesses.\nIt is well known, that the smallest number of processes for which Weak\nSymmetry Breaking task is solvable is 6. Based on our analysis, we are able to\nfind a very fast explicit protocol, solving the Weak Symmetry Breaking for 6\nprocesses using only 3 rounds. Furthermore, we show that no protocol can solve\nWeak Symmetry Breaking in fewer than 2 rounds.","authors":["Dmitry N. Kozlov"],"meta":["June 2015","DOI:10.1007/978-3-319-31580-5_7","SourcearXiv"],"references":["283471112_Structure_theory_of_flip_graphs_with_applications_to_Weak_Symmetry_Breaking","234819920_Shavit_N_The_Topological_Structure_of_Asynchronous_Computability_Journal_of_the_ACM_466_858-923","48418155_The_Universe_of_Symmetry_Breaking_Tasks","316807044_Algorithms_and_Computation_in_Mathematics","301817861_All_binomial_identities_are_orderable","286056649_Distributed_Computing_Through_Combinatorial_Topology","271158078_Impossibility_Results_for_Distributed_Computing","266523135_Combinatorial_Algebraic_Topology","263056993_Topology_of_the_immediate_snapshot_complexes","262353209_Counting-Based_Impossibility_Proofs_for_Renaming_and_Set_Agreement","261845590_Upper_bound_on_the_complexity_of_solving_hard_renaming","261700950_Witness_structures_and_immediate_snapshot_complexes","259010208_Weak_symmetry_breaking_and_abstract_simplex_paths","259010202_Topology_of_the_view_complex","258232527_Chromatic_subdivision_of_a_simplicial_complex","221540455_A_Non-topological_Proof_for_the_Impossibility_of_k-Set_Agreement","221343462_New_Combinatorial_Topology_Upper_and_Lower_Bounds_for_Renaming","220566782_New_combinatorial_topology_bounds_for_renaming_the_lower_bound"]}