{"id":"278300210_VIRTUAL_ENVIRONMENT_SIMULATOR_FOR_EDUCATIONAL_SAFETY_CROSSING","abstract":"In this paper we present a Virtual Environment Simulator for Educational Safety Crossing. The virtual simulation is developed specifically for educating young children from 1st to 4th grade. The simulator's main purpose is to build voluntary and involuntary habits in the children in range of situation, such as: correctly crossing a street on the pathway, abiding traffic lights rules, learning and abiding road signs, safely walking on the sidewalk, safely riding a bicycle, correctly waiting for the bus at a bus stop and so on. Furthermore, the system gives feedback on the child's position and movements. Finally, the platform evaluates the overall performance and grades the child. The virtual platform uses Microsoft's Kinect sensor for taking gesture input. It then transfers this gesture into an interaction within the virtual environment. There are two types of interactions / gestures – the directional movement of a 3D avatar and manipulation of the in-game menu. Software that used is C# and Unity game engine.","authors":["Stefan Stavrev","Todorka Terzieva"],"meta":["June 2015","DOI:10.13140/RG.2.1.3057.6808","Conference: Computer Science Education and Computer Science, Computer Science Education & Computer Science Research Journal: ISSN 1313-8624, Vol 11, 2015, pp. 92-98.At: Boston University, Boston, MA, USA","Project: PhD research"],"references":["267759121_Multilevel_Model_of_the_3D_Virtual_Environment_for_Crowd_Simulation_in_Buildings","262545606_Serious_Games_A_New_Paradigm_for_Education","259496289_History_and_comparative_study_of_modern_game_engines","286358305_Situated_Learning_in_Virtual_Worlds_and_Immersive_Simulations","243771574_Serious_games_Improving_public_policy_through_game-based_learning_and_simulation","222974852_The_use_of_'exploratory_learning'_for_supporting_immersive_learning_in_virtual_environments","41125153_Learning_with_Digital_Games_A_Practical_Guide_to_Engaging_Students_in_Higher_Education"]}