{"id":"278412223_Assessing_Sustainable_Behavior_and_its_Correlates_A_Measure_of_Pro-Ecological_Frugal_Altruistic_and_Equitable_Actions","abstract":"Measures of sustainable behavior (SB) usually include the self-report of activities aimed at the conservation of the natural environment. The sustainability notion explicitly incorporates both the satisfaction of human needs and the need of conserving the natural environment. Yet, the assessment of sustainable behaviors rarely considers the protection of the social environment as situation to investigate. In this paper, we propose the use of an instrument assessing SB, which includes the report of pro-ecological and frugal actions in addition to altruistic and equitable behaviors. The responses provided by 807 Mexican undergraduates to a questionnaire investigating those four instances of SB were processedwithin a structural equation model. Emotional (indignation due to environmental destruction, affinity towards diversity, happiness) and rational (intention to act) factors assumedly linked to sustainable behavior were also investigated. Significant interrelations among pro-ecological, frugal, altruistic and equitable behaviors resulted, suggesting the presence of a higher-order-factor that we identified as SB. This factor, in turn, significantly correlated with the rest of theinvestigated pro-environmental factors.","authors":["Cesar Tapia","Victor Corral-Verdugo","Blanca Fraijo-Sing","Fernanda Duron"],"meta":["February 2013Sustainability 5(2):711-723","DOI:10.3390/su5020711"],"references":["313392443_The_challenge_of_sustainable_lifestyles","298788717_Environmental_Psychology_from_spatial-physical_environment_to_sustainable_development","347260430_Alone_Together_How_Marriage_in_America_Is_Changing","313670280_Seeding_the_sustainable_economy","292553051_Garbage_and_Sewage_disposal_from_recreational_boats","288968346_Orientacion_a_la_sustentabilidad_como_determinante_de_los_estilos_de_vida_sustentables_un_estudio_con_una_muestra_mexicana","288258178_Determinantes_psicologicos_de_los_estilos_de_vida_sustentables","287522799_The_psychological_dimensions_of_sustainability","286230429_Happiness_and_sustainable_behavior","284627960_Water_use_and_management_in_the_light_of_sustainable_development_Social_representations_ideologies_and_practices_in_different_societal_contexts"]}