{"id":"278634765_A_study_on_human-human_interactions_for_common_frame_of_reference_development_within_Collaborative_virtual_environments","abstract":"Collaborative virtual environments are 3D spaces that allow multiple users to work together on a common task. To design such environments to support human-human interactions, it is important to study how people develop a common frame of reference during collaboration. The concept of common frame of reference is central to all collaborative activities. It allows partners to understand each other through a continuous exchange of information (explicit and implicit). The ultimate goal of this research is to facilitate and enrich the construction of common frame of reference to accommodate specific collaborative virtual environments characteristics. Indeed, the design elements related to the common frame of reference (i.e. communication modes, environment's construction and interactions) are essential for successful collaborative activity. Two experimental studies were conducted using different collaborative virtual environments conditions. The first study shows that adding fixed landmarks can improve the development of common frame of reference within an objects manipulation task. The second study shows that haptic communication can improve the construction of the common frame of reference in a technical gesture learning task. These results are used to provide recommendations for collaborative virtual environments design. It represents a first step towards the development of a standardized collaborative virtual environments design methodology.","authors":["Amine Chellali"],"meta":["December 2009"],"references":["342163499_Incident_case_reusing_in_telephone_traffic_control","333797334_Virtual_Environment-Assisted_Teleoperation","311898370_What_do_you_mean_by_collaborative_learning","303547455_Theories_and_methods_in_mediated_communication","297228975_GROUPWARE_-_SOME_ISSUES_AND_EXPERIENCES","288481083_Collective_activities_and_new_technologies","288218700_Virtual_environments_in_the_21st_century","288012402_Definition_et_voies_d'analyse_de_l'activite_collective_des_equipes_de_travail","285708013_Referentiel_operatif_commun_et_fiabilite","285432781_Why_do_users_like_video_Studies_of_multimedia-supported_collaboration"]}