{"id":"278618237_Preoccupations_et_agencements_dans_les_contextes_d'activite_domestique_Contribution_a_la_conception_de_situations_informatiques_diffuses_appropriables_et_energetiquement_efficaces","abstract":"https://tel.archives-ouvertes.fr/INRP/tel-01068697v1\nThis research aims at contributing to the design of ubiquitous computing environments enabling both energy efficiency and their appropriation by people in everyday life at home. To this end, from an activity-centered perspective, we empirically characterize a wide range of contexts of everyday life and build design principles and scenarios. This research is conducted with reference to the \" course-of-action \" framework (Theureau, 2003) and a situated/critical approach (Barad , 2007; Suchman , 2007) of the physical agencies composing collective action : the \" course of agencement (agency from physical arrangement)\". First, the joint specifics of ubicomp (e.g., networking scattered agents through time and space) and home arena (e.g., several people, rooms and floors) lead us to create a methodology of formal analysis and scenarios : the \" multi-scores \" layout. Second, we characterize the activity contexts of households living in homes with high energy consumption rates. Our results highlight the richness of the inhabitants' concerns, the significant dynamics of suspension/actualization over time, the simultaneity of multiple concerns underpinning expectations in daily life. We also characterize contexts of collective articulations, showing that family members engage in both similar and different concerns, oscillating between convergence and divergence at different timescales. Finally, we compare 85 \" agencements \" between families and their homes through time. Our results stress the types of perceptual and practical \" (im)possibilities \" that emerge between inhabitants, objects and physical spaces. These results feed our activity-centered design model. After presenting the guidelines and general principles of future arrangements of agency, we build collective scenarios of \" incidental/intentional interactions \" (Dix, 2002) between the future technical network and humans. We define some ways in which the future system must enable both action/appropriation and energy efficiency. Our work argues that it is possible and necessary to design the networks' energy efficiency while enabling humans to enact and appropriate their world.","authors":["Julien Guibourdenche"],"meta":["November 2013","Thesis for: Ph.D"],"references":[]}