{"id":"278645047_An_organizational_ontology_for_multiagent-based_Enterprise_Process_modeling_and_automation","abstract":"The work presented in this PhD thesis defines a new approach for the modeling and the conceptualization of enterprise business processes in the perspective of building intelligent assistance software tools to support these processes. The proposed approach defines an organizational ontology, named K-CRIO. Its description is based on the Ontology Web Language. To illustrate our work, an intelligent assistance system has been designed and implemented according to the result from the modeling and conceptualization of a specific business process with the K-CRIO Ontology. It is a web-based application that integrates and takes full advantage of multi-agent systems.The K-CRIO Ontology is an Ontology dedicated to the study of organizations and the analysis of business processes adopting an organizational point of view. Specifically, it is used to understand, analyze and reason about organizations and the processes they implement. The targeted organizations are those composed of entities involved throughout products' design and, to do so, following a defined business process. The range of this type of organizations is quite wide. We have thus limited our study to organizations that produce software as the final process goal, specifically IT enterprises delivering software products or services. In this context, the K-CRIO ontology could be used to model structure of the considered organizations and model human activities appearing in their business processes. This ontology could be used to support process assistance within the described organizations. More specifically, the ontology could provide means for reasoning, annotating resources, monitoring design processes, enabling searches and pro-actively proposing tips and proper content. In order to illustrate the usage of K-CRIO, we apply K-CRIO on two different processes: the Waterfall Model and the Scrum methodology. These examples are both classical software-development processes. Moreover, for Scrum, the famous agile software-development process widely used in software enterprises, we have designed and developed an intelligent assistance tool. This tool mainly helps Scrum Masters to make decision by monitoring Scrum project teams' activities within their various projects and collecting knowledge about these activities.","authors":["Yishuai Lin"],"meta":["September 2013"],"references":["297335246_A_model_for_the_structural_functional_and_deontic_specification_of_organizations_in_multiagent_systems","295204783_Scrum_Conceptualization_Using_K-CRIO_Ontology","285668548_Gene_ontology_Tool_for_the_unification_of_biology","326340691_Ontologies_are_Us_A_Unified_Model_of_Social_Networks_and_Semantics","321603903_Ontologies_for_Software_Engineering_and_Software_Technology","291320732_Multi-hierarchical_group_mobility_model_for_tactical_mobile_wireless_networks","287470973_Developing_Multi-agent_Systems_with_JADE","274074374_Enterprise_Modeling_and_Integration_Principles_and_Applications","272972959_A_Real-Time_Negotiation_Model_and_A_Multi-Agent_Sensor_Network_Implementation","265780327_Non-Functional_Requirements_in_Software_Engineering"]}