{"id":"278619241_An_axiomatic_approach_to_social_ranking_under_coalitional_power_relations","abstract":"In the literature of coalitional games, power indices have been widely used to assess the influence that a player has in situations where coalitions may be winning or losing. However, in many cases things are not so simple as that: in some practical situations, all that we know about coalitions is a relative comparison of strength. For instance, we know that a football team is stronger than another team, a political party is more reliable than another party, an evaluation committee is more representative than another one, and so on, but we are not able to determine which teams, parties, or committees share the characteristics to be winning (or loosing) in general. Still, in those situations we could be interested to rank single individuals according to their ability to influence the relative strength of coalitions. In this direction, we introduce a different coalitional framework where we analyse a new notion of ordinal power \"index\" or social ranking by associating to each total preorder on the set of all coalitions (representing the relative power of coalitions) a ranking over the player set. We study some properties for this class of social rankings, and we provide axiomatic characterizations of particular ones showing close affinities with the classical Banzhaf index of coalitional games.","authors":["Stefano Moretti"],"meta":["July 2013"],"references":["313124372_A_method_for_evaluating_the_distribution_of_power_in_a_committee_system","287377818_Ranking_sets_of_possibly_interacting_objects_using_shapley_extensions","248414237_Weighted_Voting_Doesn't_Work_A_Mathematical_Analysis","228108279_A_Method_of_Evaluating_Power_in_a_Committee_System","228108102_Values_of_Games_with_a_Priori_Unions","227442779_The_Power_of_a_Coalition","220838135_Preference_Representation_with_3-Points_Intervals","23546904_Coalition_formation_under_power_relations","5202061_Graphs_and_Cooperation_in_Games"]}