{"id":"278653001_Real-Time_Urban_Monitoring_in_Dublin_Using_Semantic_and_Stream_Technologies","abstract":"Several sources of information, from people, systems, things, are already available in most modern cities. Processing these continuous flows of information and capturing insight poses unique technical challenges that span from response time constraints to data heterogeneity, in terms of format and throughput. To tackle these problems, we focus on a novel prototype to ease real-time monitoring and decision-making processes for the City of Dublin with three main original technical aspects: (i) an extension to SPARQL to support efficient querying of heterogeneous streams; (ii) a query execution framework and runtime environment based on IBM InfoSphere Streams, a high-performance, industrial strength, stream processing engine; (iii) a hybrid RDFS reasoner, optimized for our stream processing execution framework. Our approach has been validated with real data collected on the field, as shown in our Dublin City video demonstration. Results indicate that real-time processing of city information streams based on semantic technologies is indeed not only possible, but also efficient, scalable and low-latency.","authors":["Simone Tallevi-Diotallevi","Spyros Kotoulas","Luca Foschini","Freddy Lecue"],"meta":["October 2013","DOI:10.1007/978-3-642-41338-4_12","Conference: International Semantic Web Conference"],"references":["268046806_Semantic_Management_of_Streaming_Data","257030063_SRBench_A_streaming_RDFSPARQL_benchmark","240615213_LinkedGeoData_A_Core_for_a_Web_of_Spatial_Open_Data","224260136_Practical_computer_vision_Example_techniques_and_challenges","224096640_It's_a_Streaming_World_Reasoning_upon_Rapidly_Changing_Information","313575536_Rete_A_fast_algorithm_for_the_many_patternmany_object_pattern_match_problem","269199859_TelegraphCQ","254061489_Linked_Open_Government_Data_Lessons_from_Datagovuk","251696247_WebPIE_A_Web-scale_Parallel_Inference_Engine_using_MapReduce_vol_10_pg_59_2012","222830276_LUBM_a_benchmark_for_OWL_knowledge_base_systems"]}