{"id":"278685461_Preconditioning_Linear_Least-Squares_Problems_by_Identifying_a_Basis_Matrix","abstract":"We study the solution of the linear least-squares problem minx ∥b−Ax∥2 where the matrix A ∈ IRm×n (m ≥ n) has rank n and is large and sparse. We assume that A is available as a matrix, not an operator. The preconditioning of this problem is difficult because the matrix A does not have the properties of differential problems that make standard preconditioners effective. Incomplete Cholesky techniques applied to the normal equations do not produce a well conditioned problem. We attempt to bypass the ill-conditioning by finding an n by n nonsingular submatrix B of A that reduces the Euclidean norm of AB^{−1}. We use B to precondition a symmetric quasi-definite linear system whose condition number is then independent of the condition number of A and has the same solution as the original least-squares problem. We illustrate the performance of our approach on some standard test problems and show it is competitive with other approaches.","authors":["Mario Arioli","Iain Duff"],"meta":["June 2015SIAM Journal on Scientific Computing 37(5)","DOI:10.1137/140975358","Report number: Technical Report-IRIT: RT-APO-15-2Affiliation: University o Toulouse-IRIT","Project: Iterative Solution of Symmetric Quasi-Definite Linear Systems (SIAM book)"],"references":["265543982_Preconditioners_for_least_squares_problems_by_LU_factorization","316792413_Polynomial_Based_Iteration_Methods_for_Symmetric_Linear_Systems","279393540_Polynomial_Based_Iteration_Methods_for_Symmetric_Linear_Systems","279349344_Polynomial_Based_Iteration_Methods_for_Symmetric_Linear_Systems","277536484_Algorithm_915_SuiteSparseQR","265369232_The_maximal-volume_concept_in_approximation_by_low-rank_matrices","251735015_How_to_Find_a_Good_Submatrix","250956355_Incomplete_Methods_for_Solving_AT_Ax_b","247688873_Symmetric_quasi-delunite_matrices","247598526_Sparse_least_squares_problems_by_conjugate_gradients_A_comparison_of_pre-conditioning_methods"]}