{"id":"278637918_Valkyrie_NASA's_First_bipedal_humanoid_robot","abstract":"In December 2013, 16 teams from around the world gathered at Homestead Speedway near Miami, FL to participate in the DARPA Robotics Challenge (DRC) Trials, an aggressive robotics competition partly inspired by the aftermath of the Fukushima Daiichi reactor incident. While the focus of the DRC Trials is to advance robotics for use in austere and inhospitable environments, the objectives of the DRC are to progress the areas of supervised autonomy and mobile manipulation for everyday robotics. NASA's Johnson Space Center led a team comprised of numerous partners to develop Valkyrie, NASA's first bipedal humanoid robot. Valkyrie is a 44 degree-of-freedom, series elastic actuator-based robot that draws upon over 18 years of humanoid robotics design heritage. Valkyrie's application intent is aimed at not only responding to events like Fukushima, but also advancing human spaceflight endeavors in extraterrestrial planetary settings. This paper presents a brief system overview, detailing Valkyrie's mechatronic subsystems, followed by a summarization of the inverse kinematics-based walking algorithm employed at the Trials. Next, the software and control architectures are highlighted along with a description of the operator interface tools. Finally, some closing remarks are given about the competition, and a vision of future work is provided.","authors":["Nicolaus Radford","Philip Strawser","Kimberly Hambuchen","Joshua S. Mehling"],"meta":["May 2015Journal of Field Robotics 32(3):397-419","DOI:10.1002/rob.21560","Projects: ValkyrieValkyrie"],"references":["284032107_Robot_Task_Commander_A_framework_and_IDE_for_robot_application_development","281377463_Localizing_Handle-Like_Grasp_Affordances_in_3D_Point_Clouds","279725850_Phase_Space_Planning_and_Robust_Control_for_Data-Driven_Locomotion_Behaviors","278664923_Intrinsically_Motivated_Affordance_Discovery_and_Modeling","341803103_Advanced_Robotics_Redundancy_and_Optimization","315007900_Design_and_Analysis_of_a_Tendon-Driven_Under-Actuated_Robotic_Hand","307534272_The_theory_of_affordances","286679906_Planar_multi-contact_bipedal_walking_using_hybrid_zero_dynamics","271549844_Sufficient_conditions_for_the_Lipschitz_continuity_of_QP-based_multi-objective_control_of_humanoid_robots","271487129_QccPack_an_open-source_software_library_for_quantization_compression_and_coding"]}