{"id":"278798443_An_Adaptive_Branching_Scheme_for_the_Branch_Prune_Algorithm_applied_to_Distance_Geometry","abstract":"The Molecular Distance Geometry Problem (MDGP) is the one of finding molecular conformations that satisfy a set of distance constraints obtained through experimental techniques such as Nuclear Magnetic Resonance (NMR). We consider a subclass of MDGP instances that can be discretized, where the search domain has the structure of a tree, which can be explored by using an interval Branch & Prune (iBP) algorithm. When all available distances are exact, all candidate positions for a given molecular conformation can be enumerated. This is however not possible in presence of interval distances, because a continuous subset of positions can actually be computed for some atoms. The focus of this work is on a new scheme for an adaptive generation of a discrete subset of candidate positions from this continuous subset. Our generated candidate positions do not only satisfy the distances employed in the discretization process, but also additional distances that might be available (the so-called pruning distances). Therefore, this new scheme is able to guide more efficiently the search in the feasible regions of the search domain. In this work, we motivate the development and formally introduce this new adaptive scheme. Presented computational experiments show that iBP, integrated with our new scheme, outperforms the standard iBP on a set of NMR-like instances.","authors":["Douglas Soares Gonçalves","Antonio Mucherino","Carlile Lavor"],"meta":["September 2014","DOI:10.15439/2014F92"],"references":["226921079_The_interval_Branch_Prune_Algorithm_for_the_Discretizable_Molecular_Distance_Geometry_Problem_with_Inexact_Distances","225202160_Discretization_Orders_for_Distance_Geometry_Problems","225162852_The_Discretizable_Distance_Geometry_Problem","224904730_Euclidean_Distance_Geometry_and_Applications","264824715_Discretization_Orders_for_Protein_Side_Chains","260074868_Discretization_Orders_and_Efficient_Computation_of_Cartesian_Coordinates_for_Distance_Geometry","241618931_Calculation_of_Cartesian_Coordinates_and_Their_Derivatives_from_Internal_Molecular_Coordinates","228568491_1_The_Discretizable_Molecular_Distance_Geometry_Problem"]}