{"id":"278763103_Context-based_Grouping_and_Recommendation_in_MANETs","abstract":"The authors propose in this chapter a context grouping mechanism for context distribution over MANETs. Context distribution is becoming a key aspect for successful context-aware applications in mobile and ubiquitous computing environments. Such applications need, for adaptation purposes, context information that is acquired by multiple context sensors distributed over the environment. Nevertheless, applications are not interested in all available context information. Context distribution mechanisms have to cope with the dynamicity that characterizes MANETs and also prevent context information from being delivered to nodes (and applications) that are not interested in it. The authors' grouping mechanism organizes the distribution of context information in groups whose definition is context based: each context group is defined based on a criteria set (e.g. the shared location and interest) and has a dissemination set, which controls the information that can be shared in the group. They propose a personalized and dynamic way of defining and joining groups by providing a lattice-based classification and recommendation mechanism that analyzes the interrelations between groups and users, and recommend new groups to users, based on the interests and preferences of the user.","authors":["Yves Vanrompay","Manuele Kirsch Pinheiro","Nesrine ben mustapha","Marie-Aude Aufaure"],"meta":["May 2013","DOI:10.4018/978-1-4666-4038-2.ch008","ISBN: 9781466640399"],"references":["236943394_Context-Aware_Recommender_Systems_a_service_oriented_approach","230627476_A_Survey_of_Context_Data_Distribution_for_Mobile_Ubiquitous_Systems","228654563_Context_retrieval_and_distribution_in_a_mobile_distributed_environment","225927498_A_Hybrid_Peer-to-Peer_Solution_for_Context_Distribution_in_Mobile_and_Ubiquitous_Environments","224695768_ISE02-6_Analysis_of_Peer-to-Peer_SIP_in_a_Distributed_Mobile_Middleware_System","301222357_Toward_the_next_generation_of_recommender_systems_A_survey_of_the_state-of-the-art_and_possible_extensions","278797538_Context-Aware_Adaptation_in_an_Ecology_of_Applications","252464962_Architecture_and_Methods_for_Flexible_Content_Management_in_Peer-to-Peer_Systems","225350607_Context_Grouping_Mechanism_for_Context_Distribution_in_Ubiquitous_Environments","224760518_An_Optimal_Basis_For_Efficient_Peer-To-Peer_Content_Distribution_Algorithms"]}