{"id":"278798156_The_Multi-Trip_Vehicle_Routing_Problem_with_Time_Windows_and_Release_Dates","abstract":"The MODUM project studies a distribution system based on city distribution centers (CDI) located around a city. Trucks with merchandise that has to be sent to customers arrive from main road axis called Doors. Then, they stop at CDI, where goods are unloaded. CDIs are located around the city center. Environmentally-friendly vehicles (called vans in the following) are used to accomplish final deliveries to customer locations. Delivery trips start from one CDI, visit assigned customers and end at one of the CDIs. Moreover, trips can end at parking points. The possibility of leaving vans at parking points will not be developed in this paper. CDIs are connected with a shuttle. The shuttle circularly goes from one CDI to another CDI, displacing merchandise. This allows to locate merchandise already in the CDI to a more convenient place for the final delivery. Moreover, carriers can deliver merchandise to the CDI they prefer. The shuttle service is carried out with a regular frequency during the working day. Outbound flows, starting with a pick-up at customer location, are considered as well into the system. However, deliveries and picks-up are treated separately and cannot be accomplished in the same trip. Vans have to drive into city centers through small roads, respecting size and weight limitations. They normally have a limited capacity and if they are electrical vehicles, their autonomy is limited as well. It is natural to allow vans to accomplish several trips during the working day. Moreover, with each client, is associated a time window (TW) during which service should be accomplished. Release dates on goods are taken into account. They represent the arrival of merchandise to the CDI.","authors":["Diego Cattaruzza","Nabil Absi","Dominique Feillet"],"meta":["July 2013Transportation Science 50(2)","DOI:10.1287/trsc.2015.0608"],"references":["271880689_Memetic_algorithms_and_memetic_computing_optimization_A_literature_review","260401175_The_Dynamic_Vehicle_Routing_Problem","258168991_Multi-period_vehicle_loading_with_stochastic_release_dates","257492797_A_New_Exact_Algorithm_to_Solve_the_Multi-Trip_Vehicle_Routing_Problem_with_Time_Windows_and_Limited_Duration","257196300_A_review_of_dynamic_vehicle_routing_problems","339310687_A_simple_and_effective_evolutionary_algorithm_for_the_vehicle_routing_problem","313706874_Adaptation_in_natural_and_artificial_systems","313505421_Completely_derandomized_self-adaptation_in_evolution_strategies","266722549_Handbook_on_scheduling_From_theory_to_applications","259928449_A_Hybrid_Genetic_Algorithm_for_Multidepot_and_Periodic_Vehicle_Routing_Problems"]}