{"id":"278732228_Chemical_computing_with_reaction-diffusion_processes","abstract":"Chemical reactions are responsible for information processing in living organisms. It is believed that the basic features of biological computing activity are reflected by a reaction-diffusion medium. We illustrate the ideas of chemical information processing considering the Belousov-Zhabotinsky (BZ) reaction and its photosensitive variant. The computational universality of information processing is demonstrated. For different methods of information coding constructions of the simplest signal processing devices are described. The function performed by a particular device is determined by the geometrical structure of oscillatory (or of excitable) and non-excitable regions of the medium. In a living organism, the brain is created as a self-grown structure of interacting nonlinear elements and reaches its functionality as the result of learning. We discuss whether such a strategy can be adopted for generation of chemical information processing devices. Recent studies have shown that lipid-covered droplets containing solution of reagents of BZ reaction can be transported by a flowing oil. Therefore, structures of droplets can be spontaneously formed at specific non-equilibrium conditions, for example forced by flows in a microfluidic reactor. We describe how to introduce information to a droplet structure, track the information flow inside it and optimize medium evolution to achieve the maximum reliability. Applications of droplet structures for classification tasks are discussed.\n© 2015 The Author(s) Published by the Royal Society. All rights reserved.","authors":["J. Gorecki","Konrad Gizynski","Jan Guzowski","J N Gorecka"],"meta":["July 2015Philosophical Transactions of The Royal Society A Mathematical Physical and Engineering Sciences 373(2046)","DOI:10.1098/rsta.2014.0219","SourcePubMed"],"references":["346816716_An_Introduction_to_Nonlinear_Chemical_Dynamics_Oscillations_Waves_Patterns_and_ChaosOscillations_Waves_Patterns_and_Chaos","344483338_Non-Standard_Computation_Molecular_Computation_-_Cellular_Automata_-_Evolutionary_Algorithms_-_Quantum_Computers","321564083_Natural_Computing_2nd_International_Workshop_on_Natural_Computing_Nagoya_Japan_December_2007_Proceedings","316698268_Reaction-Diffusion_Computers","313312181_The_Feynman_Lectures_on_Computation","304405348_On_computable_numbers_with_an_application_to_the_Entscheidungsproblem","291845543_Mechanism_and_mathematical_model_of_the_oscillating_bromate-ferroin-bromomalonic_acid_reaction","284026069_Information_processing_with_chemical_excitations_-_From_instant_machines_to_an_artificial_chemical_brain","268249833_Computing_with_cells_and_atoms_An_introduction_to_quantum_DNA_and_membrane_computing","266285777_Brain_dynamics_Synchronization_and_activity_patterns_in_pulse-coupled_neural_nets_with_delays_and_noise"]}