{"id":"278759313_Epistemological_Encounters_in_Multivocal_Settings","abstract":"Researchers usually work and evolve in the scientific frameworks in which they were trained, without questioning their epistemological foundations. However, this may be required when researchers coming from different disciplines and paradigms try to work together on the same object of study. This chapter reflects on epistemological encounters in a 5-year project of multidisciplinary collaborations in the analysis of interaction. We argue for maintaining diversity of epistemological traditions while either achieving complementarity within explanatory frameworks on different levels or maintaining productive tension. We then present the extent to which researchers in our project and a similar project encountered each other’s epistemologies when they compared their analyses of shared corpora. The majority of comparisons in various contexts led to engagement between epistemologies, and some of these epistemological encounters were productive and glitch free, others had difficulties, but still led to productivity, while still others led to missed opportunities and in one case to radicalizing incommensurable stances. A minority of comparisons in other contexts did not lead to engagement, but could either still be fruitful or not productive at all. In conclusion, we summarize the consequences of engaging with epistemologies through the comparisons researchers make of their analyses in multivocal contexts, showing how epistemological encounters can help to bridge between isolated traditions that work on similar objects of study.","authors":["Kristine Lund","Carolyn Penstein Rosé","Dan Suthers","Michael James Baker"],"meta":["November 2013","DOI:10.1007/978-1-4614-8960-3_34"],"references":["320324169_Socializing_Intelligence_through_academic_talk_and_dialogue","312694283_Social_Metacognition_Micro-Creativity_and_Justifications_Statistical_Discourse_Analysis_of_a_Mathematics_Classroom_Conversation","312693146_A_Multivocal_Process_Analysis_of_Social_Positioning_in_Study_Groups","312694352_Identifying_Pivotal_Contributions_for_Group_Progressive_Inquiry_in_a_Multimodal_Interaction_Environment","312694284_Application_of_Social_Network_Analysis_to_Collaborative_Problem_Solving_Discourse_An_Attempt_to_Capture_Dynamics_of_Collective_Knowledge_Advancement","312694282_Exploring_Pivotal_Moments_in_Students'_Knowledge_Building_Progress_Using_Participation_and_Discourse_Marker_Indicators_as_Heuristic_Guides","312694086_Focus-Based_Constructive_Interaction","312693145_Group_Scribbles-Supported_Collaborative_Learning_in_a_Primary_Grade_5_Science_Class","312693052_Socio-Dynamic_Latent_Semantic_Learner_Models","312692972_Learning_Fractions_Through_Folding_in_an_Elementary_Face-to-Face_Classroom"]}