{"id":"278701113_IFIP_Advances_in_Information_and_Communication_Technology","abstract":"This paper draws an analogy between developments in enterprise software and in capital goods manufacturing industry. Many branches of manufacturing industry, especially automotive industry, have grown in maturity by moving from craftsmanship to mass production. These industries subsequently move from mass production towards mass customization, introducing lean practices. Finally, full maturity is reached by increased servitization resulting in product-service systems (PSS). This paper analyzes the developments of enterprise information systems in the same terms. The paper shows that the enterprise software follows a similar pattern as capital goods manufacturing industries, with a few interesting differences. However, lean delivery of enterprise applications is still at the threshold of being practised. Lean delivery requires single versions of applications and delivery in multi-tenant mode. Combining lean delivery with large variety requires automated configuration of application systems components. This is enabled by software-as-a-service from the cloud. Enterprise software “from the cloud” is comparable to servitization in other branches of industry. It goes together with re-engineering enterprise software according to the SaaS paradigm.","authors":["Hans Wortmann","Hans Don","Jan Hasselman","Alex Wilbrink"],"meta":["January 2012","DOI:10.1007/978-3-642-33980-6_54","Conference: IFIP International Conference on Advances in Production Management Systems"],"references":["270574823_The_Synthesis_of_Variety_Developing_Product_Families","233192837_Representing_Function-Technology_Platform_based_on_the_Unified_Modeling_Language","223545851_The_role_of_the_customer_order_decoupling_point_in_production_and_supply_chain_management","220059378_Supporting_fine-grained_generative_model-driven_evolution","248029402_The_synthesis_of_variety_developing_product_families","247832608_Product_platform_life_cycles_A_multiple_case_study","245227172_Method_for_supporting_conflict_resolution_for_efficient_PSS_Development","242357754_The_Machine_That_Changed_The_World_The_Story_of_Lean_Production","238325009_Configuration_of_product-service_systems","229349146_Product-services_as_a_research_field_past_present_and_future_Reflections_from_a_decade_of_research","229124247_Intelligent_Product_Family_Descriptions_for_Business_Applications","222829268_Clarifying_the_concept_of_Product-Service_System","222704761_Managing_for_variety_in_the_order_acquisition_and_fulfilment_process_The_contribution_of_product_configuration_systems"]}