{"id":"278744171_Building_traceable_Event-B_models_from_requirements","abstract":"Bridging the gap between informal requirements and formal specifications is a key challenge in systems engineering. Constructing appropriate abstractions in formal models requires skill and managing the complexity of the relationships between requirements and formal models can be difficult. In this paper we present an approach that aims to address the twin challenges of finding appropriate abstractions and managing traceability between requirements and models. Our approach is based on the use of semi-formal structures to bridge the gap between requirements and Event-B models and retain traceability to requirements in Event-B models. In the stepwise refinement approach, design details are gradually introduced into formal models. Stepwise refinement allows each requirement to be introduced at the most appropriate stage in the development. Our approach makes use of the UML-B and Event Refinement Structures (ERS) approaches. UML-B provides UML graphical notation that enables the development of data structures for Event-B models, while the ERS approach provides a graphical notation to illustrate event refinement structures and assists in the organisation of refinement levels. The ERS approach also combines several constructor patterns to manage control flows in Event-B. The intent of this paper is to harness the benefits of the UML-B and ERS approaches to facilitate constructing Event-B models from requirements and provide traceability between requirements and Event-B models.","authors":["Eman Alkhammash","Michael Butler","Asieh Salehi Fathabadi","Corina Cîrstea"],"meta":["June 2015Science of Computer Programming 111","DOI:10.1016/j.scico.2015.06.002"],"references":["265064605_System_Modelling_Design_Using_Event-B","262311376_A_Systematic_Approach_to_Atomicity_Decomposition_in_Event-B","335501675_The_foundations_of_a_provably_secure_operating_system_PSOS","311474867_Experience_report_seL4_formally_verifying_a_high-performance_microkernel","299463663_An_approach_to_atomicity_decomposition_in_the_Event-B_formal_method","283629261_Design_and_Implementation_of_a_Tool_for_Specifying_Specification_in_SOFL","272663549_Continuous_Forming_Method_for_Three-dimensional_Surface_Parts_Based_on_the_Rolling_Process_Using_Bended_Roll","268869765_Formal_engineering_for_industrial_software_development_Using_the_SOFL_method","266035052_Generating_High-Level_Event-B_System_Models_from_KAOS_Requirements_Models","260735314_Control_Systems_Phenomena_and_Structuring_Functional_Requirement_Documents"]}