{"id":"278728696_Equidad_de_genero_en_la_Educacion_Superior","abstract":"Uno de los retos más importantes que enfrentan las Instituciones de Educación Superior (IES) en México, y las de casi todo el mundo, es el de erradicar la desigualdad de género que todavía se manifiesta y reproduce a su interior. Desde sus orígenes, las universidades han sido espacios históricamente desfavorables para las mujeres, quienes durante siglos ni siquiera tuvieron derecho a acceder a este nivel educativo. Por medio de exigencias y luchas continuas, a partir del siglo XIX, las mujeres lograron ingresar a la educación superior, incrementando de forma progresiva su presencia (Alvarado, 2004). Sin embargo, muchas desigualdades aún persisten; son notables en el ámbito de la profesión académica (nombramientos y promociones), en las evaluaciones y en el otorgamiento de reconocimientos, en el acceso y la permanencia por áreas y disciplinas, así como en ciertas regiones del país (García Guevara, 2004). Tampoco es posible olvidar que lamentable-mente existen situaciones de acoso, hostigamiento y violencia de género en las IES mexicanas.","authors":["Imanol Ordorika"],"meta":["June 2015Revista de la Educación Superior (RESU) XLIV (2)(174):7-17","DOI:10.1016/j.resu.2015.06.001","Project: Política y educación superior /Politics and higher education"],"references":["274719416_Cobertura_de_la_educacion_superior_en_Mexico","272820677_Intrusas_en_la_Universidad","28155494_Mujeres_en_la_alta_direccion_de_educacion_superior_Posibilidades_tensiones_y_nuevas_interrogantes","278000037_Una_mirada_a_la_presencia_de_las_mujeres_en_la_educacion_superior_en_Mexico","266372116_Prevencion_de_la_violencia_de_genero_en_las_universidades_Caracteristicas_de_las_buenas_practicas_dialogicas","237914734_Gender_Equity_in_University_Staffing","31758420_La_educacion_superior_femenina_en_el_Mexico_del_siglo_XIX_demanda_social_y_reto_gubernamental_L_Alvarado","31747857_Mujeres_academicas_el_caso_de_una_universidad_estatal_mexicana_P_Garcia_Guevara"]}