{"id":"278848453_Enhancing_Students'_Level_of_Geometric_Thinking_Through_Van_Hiele's_Phase-based_Learning","abstract":"The purpose of this study was to test the effectiveness of Van Hiele's phase-based learning on students' levels of geometric thinking. Quasi-experimental design was used in this study. The six-week study was conducted in a secondary schoolinvolving 94 students and two teachers. The students were divided into two groups, with 47 in a control group and the other 47 in a treatment group. Van Hiele's Geometry Test (VHGT) was given to both groups before and after the treatment. Ten students were randomly selected to further determine their initial and final levels of geometric thinking. Wilcoxon-t tests were conducted to test the developed hypotheses. The results showed that there was no significant difference between the initial levels of geometric thinking in both groups. However, the analysis showed significant difference between the final levels of geometric thinking in both groups. Furthermore, qualitative analysis revealed that, in initial levels of geometric thinking, the majority of students in both groups obtained the first Van Hiele levels with completeacquisition, a low acquisition of level two and no acquisition of level three. In the post interview, most of the students in the control group showed an increment of geometric thinking from level one to level two, but no one in this group achieved level three. In contrast, all the students in the treatment group showed a complete acquisition of Van Hiele level one and almost all of them indicated a complete acquisition of level two. As for level three, only one student did not achieve this level, whereas the rest showed a complete and high level of acquisition. This demonstrates that Van Hiele's phase-based learning can be applied in classrooms in order to help students achieve better level of geometric thinking.","authors":["Abdul Halim Abdullah","Effandi Zakaria"],"meta":["May 2013Indian Journal of Science and Technology 6(5):4432-4446","DOI:10.17485/ijst/2013/v6i5.13","Project: Geometric Thinking"],"references":["242287931_An_Alternative_Paradigm_to_Evaluate_the_Acquisition_of_the_van_Hiele_Levels","288915004_Learning_Geometry_in_a_Dynamic_Computer_Environment","272553314_Van_Hiele_Levels_and_Achievement_in_Writing_Geometry_Proofs","266090672_Elementary_and_Middle_School_Mathematics","255583968_Characterizing_the_van_Hiele_Levels_of_Development_in_Geometry","251769794_In-Service_Middle_and_High_School_Mathematics_Teachers_Geometric_Reasoning_Stages_and_Gender","251287472_The_Need_for_an_Inclusive_Framework_for_Students'_Thinking_in_School_Geometry","237709401_The_van_Hiele_Model_of_the_Development_of_Geometric_Thought","237600169_The_van_Hiele_Phases_of_Learning_in_studying_Cube_Dissection","234759280_Van_Hiele_Levels_of_Geometric_Thought_Revisited"]}