{"id":"278820157_Cascades_de_transducteurs_autour_de_la_reconnaissance_des_entites_nommees","abstract":"E. Cet article présente tout d'abord la cascade de transducteurs CasEN pour la reconnaissance des entités nommées. CasEN est implantée sous le logiciel CasSys de la plate-forme Unitex et est librement misè a disposition des utilisateurs sous licence LGPL-LR. Après une discussion sur la typologie des entités nommées qu'elle utilise et une description du fonction-nement de la cascade, nous rapportons sonévaluationson´sonévaluation sur le corpus Eslo 1 (corpus d'Orléans) et les performances qu'elle a montrées au cours de la campagne d'´ evaluation Ester 2. Nous présentons ensuite deux autres cascades qui utilisent le texté etiqueté par CasEN. Lapremì ere ajoute des informations sur les locuteurs de l'enquête sociolinguistique Eslo 1 et la seconde met en relation des entités nommées dans un corpus du journal Le Monde. ABSTRACT. This paper presents first the CasEN transducer cascade to recognize French Named Entities. CasEN is implemented with the CasSys software of the Unitex plateform and is put at user free disposal (LGPL-LR license). We discuss about Named Entity typology used and we describe the cascade, before reporting its evaluation from Eslo 1 corpus and evaluation campaign Ester 2 corpus. Second, we present two other cascades using a CasEN annotated text. The first cascade adds speaker information into the Eslo socio-linguitic survey and the second one links named entities in Le Monde newspaper corpus. MOTS-CL´CL´ ES : cascades de transducteurs, Entités nommées, CasSys, CasEN, Eslo 1, Ester 2.","authors":["Denis Maurel","Nathalie Friburger","Jean-Yves Antoine","Iris Eshkol"],"meta":["January 2011"],"references":["281049772_Cooperation_de_methodes_statistiques_et_symboliques_pour_l'adaptation_non-supervisee_d'un_systeme_d'etiquetage_en_entites_nommees","228636616_Classification_d'un_contenu_encyclopedique_en_vue_d'un_etiquetage_par_entites_nommees","323654284_Prolexbase_Un_dictionnaire_relationnel_multilingue_de_noms_propres_conception_implementation_et_mise_en_ligne","322743701_De_la_reconnaissance_de_formes_linguistiques_a_l'analyse_syntaxique","321241358_Les_Entitees_Nommees_de_la_linguistique_au_TAL_Statut_theorique_et_methodes_de_desambiguisation","281300360_Entrer_dans_l'anonymat_Etude_des_entites_denommantes_dans_un_corpus_oral","280638996_Who_are_you_you_who_speak_Transducer_cascades_for_information_retrieval","272718021_Le_nom_de_marque_deposee_nom_propre_nom_commun_et_terme","243755124_MUC7_Named_Entity_Task_Definition","237631125_Prolexbase_Un_dictionnaire_relationnel_multilingue_de_noms_propres"]}