{"id":"278969291_A_Neural_Conversational_Model","abstract":"Conversational modeling is an important task in natural language\nunderstanding and machine intelligence. Although previous approaches exist,\nthey are often restricted to specific domains (e.g., booking an airline ticket)\nand require hand-crafted rules. In this paper, we present a simple approach for\nthis task which uses the recently proposed sequence to sequence framework. Our\nmodel converses by predicting the next sentence given the previous sentence or\nsentences in a conversation. The strength of our model is that it can be\ntrained end-to-end and thus requires much fewer hand-crafted rules. We find\nthat this straightforward model can generate simple conversations given a large\nconversational training dataset. Our preliminary suggest that, despite\noptimizing the wrong objective function, the model is able to extract knowledge\nfrom both a domain specific dataset, and from a large, noisy, and general\ndomain dataset of movie subtitles. On a domain-specific IT helpdesk dataset,\nthe model can find a solution to a technical problem via conversations. On a\nnoisy open-domain movie transcript dataset, the model can perform simple forms\nof common sense reasoning. As expected, we also find that the lack of\nconsistency is a common failure mode of our model.","authors":["Oriol Vinyals","Quoc Le"],"meta":["June 2015","SourcearXiv"],"references":["307747289_Show_and_tell_A_neural_image_caption_generator","269280447_On_Using_Very_Large_Target_Vocabulary_for_Neural_Machine_Translation","265252627_Neural_Machine_Translation_by_Jointly_Learning_to_Align_and_Translate","13853244_Long_Short-term_Memory","2413241_A_Neural_Probabilistic_Language_Model","311469848_Recurrent_neural_network_based_language_model","299748594_Conversational_Agents","289758666_Recurrent_continuous_translation_models","280113549_Speech_and_Language_Processing","270878382_News_from_OPUS-A_Collection_of_Multilingual_Parallel_Corpora_with_Tools_and_Interfaces","269997813_Grammar_as_a_Foreign_Language","267627635_Addressing_the_Rare_Word_Problem_in_Neural_Machine_Translation","266458936_Statistical_Language_Models_Based_on_Neural_Networks","265554383_Sequence_to_Sequence_Learning_with_Neural_Networks","224982542_Computing_Machinery_and_Intelligence"]}