{"id":"279068659_Mining_Mid-level_Visual_Patterns_with_Deep_CNN_Activations","abstract":"The purpose of mid-level visual element discovery is to find clusters of\nimage patches that are both representative and discriminative. Here we study\nthis problem from the prospective of pattern mining while relying on the\nrecently popularized Convolutional Neural Networks (CNNs). We observe that a\nfully-connected CNN activation extracted from an image patch typically\npossesses two appealing properties that enable its seamless integration with\npattern mining techniques. The marriage between CNN activations and association\nrule mining, a well-known pattern mining technique in the literature, leads to\nfast and effective discovery of representative and discriminative patterns from\na huge number of image patches. When we retrieve and visualize image patches\nwith the same pattern, surprisingly, they are not only visually similar but\nalso semantically consistent, and thus give rise to a mid-level visual element\nin our work. Given the patterns and retrieved mid-level visual elements, we\npropose two methods to generate image feature representations for each. The\nfirst method is to use the patterns as codewords in a dictionary, similar to\nthe Bag-of-Visual-Words model, we compute a Bag-of-Patterns representation. The\nsecond one relies on the retrieved mid-level visual elements to construct a\nBag-of-Elements representation. We evaluate the two encoding methods on scene\nand object classification tasks, and demonstrate that our approach outperforms\nor matches recent works using CNN activations for these tasks.","authors":["Yao Shen Li","Lingqiao Liu","Chunhua Shen","Anton van den Hengel"],"meta":["February 2017International Journal of Computer Vision 121(3)","DOI:10.1007/s11263-016-0945-y","SourcearXiv"],"references":["319770352_Analyzing_the_Performance_of_Multilayer_Neural_Networks_for_Object_Recognition","319770242_Mid-level_Deep_Pattern_Mining","319770820_Histograms_of_Oriented_Gradients_for_Human_Detection","319770430_Rich_feature_hierarchies_for_accurate_object_detection_and_semantic_segmentation","319770363_Deep_Fisher_Networks_for_Large-Scale_Image_Classification","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","314727145_What_makes_Paris_look_like_Paris","313524716_Efficient_mining_of_frequent_and_distinctive_feature_configurations","311611264_Mining_Discriminative_Triplets_of_Patches_for_Fine-Grained_Classification","311610790_Compact_Bilinear_Pooling"]}