{"id":"279177017_Internet_of_Things_A_Survey_on_Enabling_Technologies_Protocols_and_Applications","abstract":"This paper provides an overview of the Internet of Things (IoT) with emphasis on enabling technologies, protocols, and application issues. The IoT is enabled by the latest developments in RFID, smart sensors, communication technologies, and Internet protocols. The basic premise is to have smart sensors collaborate directly without human involvement to deliver a new class of applications. The current revolution in Internet, mobile, and machine-to-machine (M2M) technologies can be seen as the first phase of the IoT. In the coming years, the IoT is expected to bridge diverse technologies to enable new applications by connecting physical objects together in support of intelligent decision making. This paper starts by providing a horizontal overview of the IoT. Then, we give an overview of some technical details that pertain to the IoT enabling technologies, protocols, and applications. Compared to other survey papers in the field, our objective is to provide a more thorough summary of the most relevant protocols and application issues to enable researchers and application developers to get up to speed quickly on how the different protocols fit together to deliver desired functionalities without having to go through RFCs and the standards specifications. We also provide an overview of some of the key IoT challenges presented in the recent literature and provide a summary of related research work. Moreover, we explore the relation between the IoT and other emerging technologies including big data analytics and cloud and fog computing. We also present the need for better horizontal integration among IoT services. Finally, we present detailed service use-cases to illustrate how the different protocols presented in the paper fit together to deliver desired IoT services.","authors":["Ala Al-Fuqaha","Mohsen Guizani","Mehdi Mohammadi","Mohammed Aledhari"],"meta":["November 2015IEEE Communications Surveys & Tutorials 17(4):Fourthquarter 2015","DOI:10.1109/COMST.2015.2444095"],"references":["307892108_Internet_of_Vehicles_From_intelligent_grid_to_autonomous_cars_and_vehicular_fogs","351396417_Park-A-Lot_An_Automated_Parking_Management_System","345951666_RFID_and_Auto-ID_in_Planning_and_Logistics_A_Practical_Guide_for_Military_UID_Applications","316675658_Building_the_Internet_of_Things_with_IPv6_and_MIPv6_The_Evolving_World_of_M2M_Communications","313761517_Autonomous_control_and_the_internet_of_things_Increasing_robustness_scalability_and_agility_in_logistic_networks","313420977_The_Internet_of_Things_How_the_Next_Evolution_of_the_Internet_is_Changing_Everything","311788565_An_IoT_architecture_for_things_from_industrial_environment","310476672_Scalable_adaptive_and_survivable_trust_management_for_community_of_interest_based_Internet_of_Things_systems","309201797_A_software_defined_networking_architecture_for_the_internet-of-things","305114166_Rpl_routing_protocol_in_advanced_metering_infrastructures_An_analysis_of_the_unreliability_problems"]}