{"id":"279160285_Revisiting_Warfarin_Dosing_Using_Machine_Learning_Techniques","abstract":"Determining the appropriate dosage of warfarin is an important yet challenging task. Several prediction models have been proposed to estimate a therapeutic dose for patients. The models are either clinical models which contain clinical and demographic variables or pharmacogenetic models which additionally contain the genetic variables. In this paper, a new methodology for warfarin dosing is proposed. The patients are initially classified into two classes. The first class contains patients who require doses of >30 mg/wk and the second class contains patients who require doses of ≤30 mg/wk. This phase is performed using relevance vector machines. In the second phase, the optimal dose for each patient is predicted by two clinical regression models that are customized for each class of patients. The prediction accuracy of the model was 11.6 in terms of root mean squared error (RMSE) and 8.4 in terms of mean absolute error (MAE). This was 15% and 5% lower than IWPC and Gage models (which are the most widely used models in practice), respectively, in terms of RMSE. In addition, the proposed model was compared with fixed-dose approach of 35 mg/wk, and the model proposed by Sharabiani et al. and its outperformance were proved in terms of both MAE and RMSE.","authors":["Ashkan Sharabiani","Adam Bress","Elnaz Douzali","Houshang Darabi"],"meta":["June 2015Computational and Mathematical Methods in Medicine 2015:1-9","DOI:10.1155/2015/560108"],"references":["263895930_A_Bayesian_Estimation_Framework_for_Pharmacogenomics_Driven_Warfarin_Dosing_A_Comparative_Study","262045007_A_Pharmacogenetic_versus_a_Clinical_Algorithm_for_Warfarin_Dosing","307175251_Induction_of_Decision_Trees","284390144_Introduction_to_the_logistic_regression_model","279421890_Support_Vector_Machines","273862512_A_Randomized_Trial_of_Genotype-Guided_Dosing_of_Warfarin","263321831_Warfarin_Pharmacogenetics_To_Genotype_or_Not_to_Genotype_That_Is_the_Question","263204867_Genotype-Guided_vs_Clinical_Dosing_of_Warfarin_and_Its_Analogues","262846581_Warfarin_pharmacogenetic_trials_Is_there_a_future_for_pharmacogenetic-_guided_dosing","261418726_Machine_learning_based_prediction_of_warfarin_optimal_dosing_for_African_American_patients"]}