{"id":"279160753_Using_K-Nearest_Neighbor_Classification_to_Diagnose_Abnormal_Lung_Sounds","abstract":"A reported 30% of people worldwide have abnormal lung sounds, including crackles, rhonchi, and wheezes. To date, the traditional stethoscope remains the most popular tool used by physicians to diagnose such abnormal lung sounds, however, many problems arise with the use of a stethoscope, including the effects of environmental noise, the inability to record and store lung sounds for follow-up or tracking, and the physician's subjective diagnostic experience. This study has developed a digital stethoscope to help physicians overcome these problems when diagnosing abnormal lung sounds. In this digital system, mel-frequency cepstral coefficients (MFCCs) were used to extract the features of lung sounds, and then the K-means algorithm was used for feature clustering, to reduce the amount of data for computation. Finally, the K-nearest neighbor method was used to classify the lung sounds. The proposed system can also be used for home care: if the percentage of abnormal lung sound frames is > 30% of the whole test signal, the system can automatically warn the user to visit a physician for diagnosis. We also used bend sensors together with an amplification circuit, Bluetooth, and a microcontroller to implement a respiration detector. The respiratory signal extracted by the bend sensors can be transmitted to the computer via Bluetooth to calculate the respiratory cycle, for real-time assessment. If an abnormal status is detected, the device will warn the user automatically. Experimental results indicated that the error in respiratory cycles between measured and actual values was only 6.8%, illustrating the potential of our detector for home care applications.","authors":["Chin-Hsing Chen","Wen-Tzeng Huang","Tan-Hsu Tan","Cheng-Chun Chang"],"meta":["June 2015Sensors 15(6):13132-13158","DOI:10.3390/s150613132"],"references":["258493830_Noise_Reduction_of_Speech_Signal_using_Wavelet_Transform_with_Modified_Universal_Threshold","13912120_Respiratory_Sounds_Advances_Beyond_the_Stethoscope","4097275_Respiratory_sounds_classification_using_Gaussian_mixture_models","224245920_Discrimination_between_healthy_subjects_and_patients_with_pulmonary_emphysema_by_detection_of_abnormal_respiration","222695091_Data_Clustering_50_Years_Beyond_K-Means","51295581_Real-time_adaptive_canceling_of_ambient_noise_in_lung_sound_measurement","49628559_Acoustics_Based_Assessment_of_Respiratory_Diseases_using_GMM_Classification","45630487_An_Automated_Computerized_Auscultation_and_Diagnostic_System_for_Pulmonary_Diseases","26679632_Performance_evaluation_and_enhancement_of_lung_sound_recognition_system_in_two_real_noisy_environments","6122677_Design_of_a_DSP-based_instrument_for_real-time_classification_of_pulmonary_sounds"]}