{"id":"279191261_Extending_Levy_search_theory_from_one_to_higher_dimensions_Levy_walking_favours_the_blind","abstract":"A diverse range of organisms, including T cells, E. coli, honeybees, sharks, turtles, bony fish, jellyfish, wandering albatrosses and even human hunter–gatherers have movement patterns that can be approximated by Lévy walks (LW; sometimes called Lévy flights in the biological and ecological literature). These observations lend support to the ‘Lévy flight foraging hypothesis’ which asserts that natural selection should have led to adaptations for Lévy flight foraging, because Lévy flights can optimize search efficiencies. The hypothesis stems from a rigorous theory of one-dimensional searching and from simulation data for two-dimensional searching. The potential effectiveness of three-dimensional Lévy searches has not been examined but is central to a proper understanding of marine predators and T cells which have provided the most compelling empirical evidence for LW. Here I extend Lévy search theory from one to three dimensions. The new theory predicts that three-dimensional Lévy searching can be advantageous but only when targets are large compared with the perceptual range of the searchers, i.e. only when foragers are effectively blind and need to come into contact with a target to establish its presence. This may explain why effective blindness is a common factor among three-dimensional Lévy walkers.","authors":["Andy Reynolds"],"meta":["June 2015Proceedings of The Royal Society A Mathematical Physical and Engineering Sciences 471(2179)","DOI:10.1098/rspa.2015.0123"],"references":["287728117_High_activity_and_Levy_searches_jellyfish_can_search_the_water_column_like_fish","275359437_Experimental_evidence_for_inherent_Levy_search_behaviour_in_foraging_animals","271596798_Optimal_Levy-flight_foraging_in_a_finite_landscape","263934112_Hierarchical_random_walks_in_trace_fossils_and_the_origin_of_optimal_search_behavior","260874755_Mussels_realize_Weierstrassian_Levy_walks_as_composite_correlated_random_walks","259456777_Evidence_of_Levy_walk_foraging_patterns_in_human_hunter-gatherers","312983149_Foraging_success_of_biological_Levy_flights_recorded_in_situ","274371002_Liberating_Levy_walk_research_from_the_shackles_of_optimal_foraging","262782367_Optimal_foraging_strategies_Levy_walks_balance_searching_and_patch_exploitation_under_a_very_broad_range_of_conditions","256482456_Does_the_Australian_desert_ant_Melophorus_bagoti_approximate_a_Levy_search_by_an_intrinsic_bi-modal_walk"]}