{"id":"279190719_Scaling_up_learning_design_impact_of_learning_design_activities_on_LMS_behavior_and_performance_Conference_Item_Scaling_up_learning_design_impact_of_learning_design_activities_on_LMS_behavior_and_perf","abstract":"Annie.Bryan@open.ac.uk ABSTRACT While substantial progress has been made in terms of predictive modeling in the Learning Analytics Knowledge (LAK) community, one element that is often ignored is the role of learning design. Learning design establishes the objectives and pedagogical plans which can be evaluated against the outcomes captured through learning analytics. However, no empirical study is available linking learning designs of a substantial number of courses with usage of Learning Management Systems (LMS) and learning performance. Using cluster-and correlation analyses, in this study we compared how 87 modules were designed, and how this impacted (static and dynamic) LMS behavior and learning performance. Our findings indicate that academics seem to design modules with an \" invisible \" blueprint in their mind. Our cluster analyses yielded four distinctive learning design patterns: constructivist, assessment-driven, balanced-variety and social constructivist modules. More importantly, learning design activities strongly influenced how students were engaging online. Finally, learning design activities seem to have an impact on learning performance, in particular when modules rely on assimilative activities. Our findings indicate that learning analytics researchers need to be aware of the impact of learning design on LMS data over time, and subsequent academic performance.","authors":["Bart Rienties","Lisette Toetenel","Annie Bryan"],"meta":["February 2015","DOI:10.1145/2723576.2723600","Conference: 5th Learning Analytics Knowledge ConferenceAt: Poughkeepsie"],"references":["273203136_In_search_for_the_most_informative_data_for_feedback_generation_Learning_Analytics_in_a_data-rich_context","272177799_Why_Minimal_Guidance_During_Instruction_Does_Not_Work_An_Analysis_of_the_Failure_of_Constructivist_Discovery_Problem-Based_Experiential_and_Inquiry-Based_Teaching","255632613_Aligning_Assessment_with_Long-Term_Learning","274753225_Is_There_an_Optimal_Design_for_On-Line_MBA_Courses","269166938_Mind_in_Society","263286618_'Time_is_not_enough'_Workload_in_higher_education_A_student_perspective","262141101_Multivariate_Data_Analysis_5th_Ed","259920989_Multivariate_Data_Analysis_5","259895355_Analyzing_the_students'_behavior_and_relevant_topics_in_virtual_learning_communities","257454864_Approaches_to_studying_across_the_adult_life_span_Evidence_from_distance_education"]}