{"id":"279262086_More_feasible_programs_from_non-constructive_proofs_by_the_Light_Monotone_Dialectica_interpretation","abstract":"This thesis presents a new optimization of Gödel's Dialectica interpretation for the extraction of more efficient exact realizers from (classical) arithmetical and even analytical proofs. The \"light\" variant of Dialectica also combines and even more smoothly with Kohlenbach's \"monotone\" optimization of Gödel's functional interpretation for the extraction of more efficient majorants and bounds from (classical)monotonic proofs. Light Dialectica is obtained by adapting Berger's \"uniform\" or \"non-computational\" quantifiers. Moreover, its presentation is given in Natural Deduction style, as an improvement of Jørgensen's recent adaptation of pure Gödel's Dialectica. A number of concrete examples are treated on the computer by means of the novel technique. The machine comparison with the more established program-synthesis technique of refined A-translation shows a very good performance of Light Dialectica, which is outperformed only in the case of Dickson's Lemma. Also the theory of synthesis of feasible, poly-time computable programs is developed for the new extraction technique. Two pre-existent frameworks due to Cook-Urquhart-Ferreira and respectively Kohlenbach are crossbreeded for this purpose into a \"poly-time bounded Analysis\". The theoretical result is promising, yet practical examples are to be found for the difference with the pure Kohlenbach's \"polynomially bounded Analysis\".","authors":["Dan Hernest"],"meta":["December 2006"],"references":["257826707_The_Warshall_Algorithm_and_Dickson's_Lemma_Two_Examples_of_Realistic_Program_Extraction","312986265_An_Algorithmic_Interpretation_of_Classical_Natural_Deduction","284687049_Der_Minimalkalkul_ein_reduzierter_intuitionistischer_Formalismus","268739211_Zur_intuitionistischen_Arithmetik_und_Zahlentheorie","266329601_Interpretability_and_fragments_of_arithmetic","266058030_Complexity_of_proofs_and_their_transformations_in_axiomatic_theories_Transl_by_Alexander_Bochman_from_an_orig_Russ_manuscript_Transl_ed_by_David_Louvish","265435474_On_n-quantifier_Induction","264922323_Bounds_extracted_by_Kreisel_from_ineffective_proofs","251185692_Some_Logical_Metatheorems_with_Applications_in_Functional_Analysis","250663872_Lower_bounds_for_increasing_complexity_of_derivations_after_cut_elimination","248601271_Lower_Bounds_on_Herbrand's_Theorem","248600036_Interpretation_fonctionelle_et_elimination_des_coupures_de_l'arithmetique_d'ordre_superieur","247695588_Systems_of_second_order_arithmetic_with_restricted_induction_I","245368894_An_upper_bound_for_reduction_sequences_in_the_typed_l-calculus","244462165_Finding_computational_content_in_classical_proofs"]}