{"id":"279277101_A_study_of_the_use_of_games_and_gamification_to_enhance_student_engagement_experience_and_achievement_on_a_theory-based_course_of_an_undergraduate_media_degree","abstract":"This article details the research findings of a study investigating the effectiveness of a learning and teaching project that involved the use of games to aid in student learning on a media theory module taught on a undergraduate Media Studies degree in a British university. Critical and social theory often presents a significant problem for students (Campbell, 1997) and this is no different for media students (Buckingham, 2003). A learning and teaching project was carried out in which a range of game activities were used to teach media theory. Research was then conducted to explore the effectiveness of the game techniques. The article is divided into four parts: section one provides a brief discussion of the problems of teaching theory, how it has been taught and an overview of the learning and teaching project. Section two examines the idea of gamification and its use in education and how games and gamification were used to teach on the module and section three describes the research methods used to evaluate the learning and teaching project. In section four the results of the research are noted and discussed.","authors":["Marcus Leaning"],"meta":["June 2015Journal of Media Practice 16(2):1-16","DOI:10.1080/14682753.2015.1041807"],"references":["321606572_Learning_Strategies_and_Learning_Styles","318309162_Cultural_Education_A_Revised_Program","290272372_Teaching_Literary_Theory_to_Undergraduates_What_Have_We_Learned","287577847_MediaTheory_Thinking_about_Media_and_Communications","284240181_College_instructors'_implicit_theories_about_teaching_skills_and_their_relationship_to_professional_development_choices","281091675_Experiences_of_Promoting_Student_Engagement_through_Game-Oriented_Learning_Framework","275627840_Instructional_Technology_Foundations","263488529_Teaching_beliefs_and_practice_institutional_context_and_the_uptake_of_Web-based_technology","262455712_Learning_To_Teach_in_Higher_Education","262358663_The_effect_of_virtual_achievements_on_student_engagement"]}