{"id":"279274470_Energy_Efficiency_in_Wireless_Networks_via_Fractional_Programming_Theory","abstract":"This monograph presents a unified framework for energy efficiency maximization in wireless networks via fractional programming theory. The definition of energy efficiency is introduced, with reference to single-user and multi-user wireless networks, and it is observed how the problem of resource allocation for energy efficiency optimization is naturally cast as a fractional program. An extensive review of the state-of-the-art in energy efficiency optimization by fractional programming is provided, with reference to centralized and distributed resource allocation schemes. A solid background on fractional programming theory is provided. The key-notion of generalized concavity is presented and its strong connection with fractional functions described. A taxonomy of fractional problems is introduced, and for each class of fractional problem, general solution algorithms are described, discussing their complexity and convergence properties. The described theoretical and algorithmic framework is applied to solve energy efficiency maximization problems in practical wireless networks. A general system and signal model is developed which encompasses many relevant special cases, such as one-hop and two-hop heterogeneous networks, multi-cell networks, small-cell networks, deviceto- device systems, cognitive radio systems, and hardware-impaired networks, wherein multiple-antennas and multiple subcarriers are (possibly) employed. Energy-efficient resource allocation algorithms are developed, considering both centralized, cooperative schemes, as well as distributed approaches for self-organizing networks. Finally, some remarks on future lines of research are given, stating some open problems that remain to be studied. It is shown how the described framework is general enough to be extended in these directions, proving useful in tackling future challenges that may arise in the design of energy-efficient future wireless networks.","authors":["Alessio Zappone","Eduard Jorswieck"],"meta":["January 2015Foundations and Trends® in Communications and Information Theory 11(3-4):185-396","DOI:10.1561/0100000088"],"references":["339504437_Random_Matrix_Theory_and_Wireless_Communications","324396684_Game_Theory","291752367_Subcarrier_and_power_allocation_in_OFDM-based_cognitive_radio_networks","285415585_Energy-efficiency_resource_allocation_of_very_large_multi-user_MIMO_systems","285006810_Energy_Efficiency_and_Interference_Neutralization_in_Two-Hop_MIMO_Interference_Channels","284776723_Cognitive_radio_Brain-empowered_wireless_communications_selected_areas_in_communications","284573604_Monotonic_Optimization_in_Communication_and_Networking_Systems","283141341_Competitive_energy-aware_resource_allocation_in_two-hop_multiple-antenna_interference_networks","281547431_Generalized_Nash_equilibrium_problems","278768710_Game_Theory_and_Learning_for_Wireless_Networks_Fundamentals_and_Applications"]}