{"id":"279273274_Causality_and_Properties","abstract":"It is events, rather then objects or properties, that are usually taken by philosophers to be the terms of the causal relationship. But an event typically consists of a change in the properties or relationships of one or more objects, the latter being what Jaegwon Kim has called the “constituent objects” of the event.1 And when one event causes another, this will be in part because of the properties possessed by their constituent objects. Suppose, for example, that a man takes a pill and, as a result, breaks out into a rash. Here the cause and effect are, respectively, the taking of the pill and the breaking out into a rash. Why did the first event cause the second? Well, the pill was penicillin, and the man was allergic to penicillin. No doubt one could want to know more — for example, about the biochemistry of allergies in general and this one in particular. But there is a good sense in which what has been said already explains why the one event caused the other. Here the pill and the man are the constituent objects of the cause event, and the man is the constituent object of the effect event. Following Kim we can also speak of events as having “constituent properties” and “constituent times”. In this case the constituent property of the cause event is the relation expressed by the verb ‘takes’, while the constituent property of the effect event is expressed by the predicate ‘breaks out into a rash’. The constituent times of the events are their times of occurrence. Specifying the constituent objects and properties of the cause and effect will tell us what these events consisted in, and together with a specification of their constituent times will serve to identify them; but it will not, typically, explain why the one brought about the other. We explain this by mentioning certain properties of their constituent objects. Given that the pill was penicillin, and that the man was allergic to penicillin, the taking of the pill by the man was certain, or at any rate very likely, to result in an allergic response like a rash. To take another example, suppose a branch is blown against a window and breaks it. Here the constituent objects include the branch and the window, and the causal relationship holds because of, among other things, the massiveness of the one and the fragility of the other.","authors":["Sydney Shoemaker"],"meta":["January 1980","DOI:10.1007/978-94-017-3528-5_7","In book: Time and Cause (pp.109-135)"],"references":["288876029_The_Origin_of_Forms_and_Qualities","281453454_A_Treatise_of_Human_Nature","279403815_Naming_And_Necessity","275728805_Causation_Nomic_Subsumption_And_The_Concept_Of_Event","274199552_On_the_New_Riddle_of_Induction","270301085_Causal_Relations","265012834_An_Essay_Concerning_Humane_Understanding","200026806_An_Essay_Concerning_Human_Understanding"]}