{"id":"279293965_On_the_Power_of_Accepting_Networks_of_Evolutionary_Processors_with_Special_Topologies_and_Random_Context_Filters","abstract":"In this paper, we approach the problem of accepting all recursively enumerable languages by accepting networks of evolutionary processors (ANEPs, for short) with a fixed architecture. More precisely, we show that every recursively enumerable language can be accepted by an ANEP with an underlying graph in the form of a star with 13 nodes or by an ANEP with an underlying grid with 13 x 4 = 52 nodes as well as by ANEPs having underlying graphs in the form of a chain, a ring, or a wheel with 29 nodes each. In all these cases, the size and form as well as the general working strategy of the constructed networks do not depend on the accepted language; only the rewriting rules and the filters associated to each node of the networks depend on this language. Noteworthy is also the fact that the filtering process is implemented using random context conditions only. Our results answer problems which were left open in a paper published by J. Dassow and F. Manea at the conference on Descriptional Complexity of Formal Systems (DCFS) 2010 and improve a result published by B. Truthe at the conference on Non-Classical Models of Automata and Applications (NCMA) 2013.","authors":["Jürgen Dassow","Florin Manea","Bianca Truthe"],"meta":["January 2015Fundamenta Informaticae 136(1-2):1-35","DOI:10.3233/FI-2015-1142"],"references":["226458187_Networks_of_evolutionary_processors","221582171_Solving_NP-Complete_Problems_With_Networks_of_Evolutionary_Processors","247538411_Size_and_Structure_of_Universal_Turing_Machines_Using_Tag_Systems","228546182_Networks_of_Evolutionary_Word_and_Picture_Processors_A_Survey","225201003_Small_universal_accepting_hybrid_networks_of_evolutionary_processors","224678305_On_the_time_complexity_of_2-tag_systems_and_small_universal_Turing_machines","220248671_The_role_of_evolutionary_operations_in_accepting_hybrid_networks_of_evolutionary_processors","220246936_Classes_of_Languages_and_Linear-Bounded_Automata","220153925_On_the_size_of_computationally_complete_hybrid_networks_of_evolutionary_processors","220153895_Small_Universal_Turing_Machines"]}