{"id":"279232953_Probabilistic_Frechet_means_for_time_varying_persistence_diagrams","abstract":"In order to use persistence diagrams as a true statistical tool, it would be very useful to have a good notion of mean and variance for a set of diagrams. In [23], Mileyko and his collaborators made the first study of the properties of the Fréchet mean in (Dp, Wp), the space of persistence diagrams equipped with the p-th Wasserstein metric. In particular, they showed that the Fréchet mean of a finite set of diagrams always exists, but is not necessarily unique. The means of a continuously-varying set of diagrams do not themselves (necessarily) vary continuously, which presents obvious problems when trying to extend the Fréchet mean definition to the realm of time-varying persistence diagrams, better known as vineyards. We fix this problem by altering the original definition of Fréchet mean so that it now becomes a probability measure on the set of persistence diagrams; in a nutshell, the mean of a set of diagrams will be a weighted sum of atomic measures, where each atom is itself a persistence diagram determined using a perturbation of the input diagrams. This definition gives for each N a map (Dp)N→ℙ(Dp). We show that this map is Hölder continuous on finite diagrams and thus can be used to build a useful statistic on vineyards. © 2015, Institute of Mathematical Statistics. All rights reserved.","authors":["Elizabeth Munch","Katharine Felicity Turner","Paul Bendich","Sayan Mukherjee"],"meta":["January 2015Electronic Journal of Statistics 9:1173-1204","DOI:10.1214/15-EJS1030"],"references":["281813841_SW1PerS_Sliding_windows_and_1-persistence_scoring_discovering_periodicity_in_gene_expression_time_series_data","253646104_Means_and_medians_of_sets_of_persistence_diagrams","251232706_Sliding_Windows_and_Persistence_An_Application_of_Topological_Methods_to_Signal_Analysis","314819144_Morse-smale_complexes_for_piecewise_linear_3-manifolds","284046320_Algorithm_for_The_Assignment_and_Transportation_Problems","281418901_Convergence_Rates_for_Persistence_Diagram_Estimation_in_Topological_Data_Analysis","279715251_Exploring_Equilibria_in_Stochastic_Delay_Differential_Equations_Using_Persistent_Homology","279715089_Stability_Determination_in_Turning_Using_Persistent_Homology_and_Time_Series_Analysis","269996320_Persistent_homology_-_A_survey","265426020_Algorithms_for_the_Assignment_and_Transportation_Problems"]}