{"id":"279254597_RPL_Mobility_Support_for_Point-to-Point_Traffic_Flows_towards_Mobile_Nodes","abstract":"The \" routing protocol for low-power and lossy networks \" (RPL) from the IETF ROLL working group is a widely used standard to support routing in wireless sensor networks (WSNs). Although the RPL protocol was originally designed with static topologies in mind, recently a number of extensions have been proposed to support traffic flows from mobile nodes towards a static gateway. However, this paper demonstrates that these solutions do not support traffic flows going the other direction, for example, from the gateway towards mobile devices. To remedy this, the paper first analyses the problems that prevent reliable traffic flows towards mobile devices when using RPL. Afterwards, a new mechanism to improve downward route updating is proposed. Our new approach minimizes the probability of connectivity loss by ensuring that the internal state of the static network remains consistent. Our solution is implemented and evaluated using both simulation tools and experimental facilities and it is shown that it improves the end-to-end packet delivery ratio to mobile nodes from 20–30% up to 80% while reducing the overall RPL signalling overhead without the use of location information.","authors":["David Carels","Eli De Poorter","Ingrid Moerman","Piet Demeester"],"meta":["June 2015International Journal of Distributed Sensor Networks 2015(6)","DOI:10.1155/2015/470349"],"references":["278629000_Energy-based_routing_metric_for_RPL","271514745_RPL_IPv6_Routing_Protocol_for_Low_power_and_Lossy_Networks","271458153_Co-RPL_RPL_routing_for_mobile_low_power_wireless_sensor_networks_using_Corona_mechanism","269269317_Mobility_Enhanced_RPL_for_Wireless_Sensor_Networks","261478607_On_link_estimation_in_dense_RPL_deployments","261400522_Stability_and_Efficiency_of_RPL_under_Realistic_Conditions_in_Wireless_Sensor_Networks","258388365_A_Comprehensive_Evaluation_of_RPL_under_Mobility","292802751_Building_automation_routing_requirements_in_low-power_and_lossy_networks","278680788_Integrating_Mobility_in_RPL","271514764_RFC_5673_Industrial_Routing_Requirements_in_Low-Power_and_Lossy_Networks"]}