{"id":"279225880_Mining_Symptom-Herb_Patterns_from_Patient_Records_Using_Tripartite_Graph","abstract":"Unlike the western medical approach where a drug is prescribed against specific symptoms of patients, traditional Chinese medicine (TCM) treatment has a unique step, which is called syndrome differentiation (SD). It is argued that SD is considered as patient classification because prior to the selection of the most appropriate formula from a set of relevant formulae for personalization, a practitioner has to label a patient belonging to a particular class (syndrome) first. Hence, to detect the patterns between herbs and symptoms via syndrome is a challenging problem; finding these patterns can help prepare a prescription that contributes to the efficacy of a treatment. In order to highlight this unique triangular relationship of symptom, syndrome, and herb, we propose a novel three-step mining approach. It first starts with the construction of a heterogeneous tripartite information network, which carries richer information. The second step is to systematically extract path-based topological features from this tripartite network. Finally, an unsupervised method is used to learn the best parameters associated with different features in deciding the symptom-herb relationships. Experiments have been carried out on four real-world patient records (Insomnia, Diabetes, Infertility, and Tourette syndrome) with comprehensive measurements. Interesting and insightful experimental results are noted and discussed.","authors":["Jinpeng Chen","Josiah Poon","Simon K Poon","Ling Xu"],"meta":["June 2015Evidence-based Complementary and Alternative Medicine 2015(1):1-14","DOI:10.1155/2015/435085"],"references":["261272045_Drug-drug_interaction_analysis_using_heterogeneous_biological_information_network","326340691_Ontologies_are_Us_A_Unified_Model_of_Social_Networks_and_Semantics","291130896_Data_mining_based_approach_to_preprocessing_TCM_data_set","283617653_Emergence_of_Scaling_in_Random_Networks","283617410_Emergence_of_Scaling_in_Random_Networks","271556199_Discovering_causal_patterns_in_TCM_clinical_prescription_data_using_set-theoretic_approach","270523783_Recommending_interesting_landmarks_in_photo_sharing_sites","269308786_Tag_Co-occurrence_Relationship_Prediction_in_Heterogeneous_Information_Networks","262365419_MedRank_discovering_influential_medical_treatments_from_literature_by_information_network_analysis","261081959_Data_mining_on_prescription_herbal_pairs_and_pattern_identification_of_pulmonary_tuberculosis_cases"]}