{"id":"279307724_Multiobjective_Triclustering_of_Time-Series_Transcriptome_Data_Reveals_Key_Genes_of_Biological_Processes","abstract":"Exploratory analysis of multi-dimensional high-throughput datasets, such as microarray gene expression time series, may be instrumental in understanding the genetic programs underlying numerous biological processes. In such datasets, variations in the gene expression profiles are usually observed across replicates and time points. Thus mining the temporal expression patterns in such multi-dimensional datasets may not only provide insights into the key biological processes governing organs to grow and develop but also facilitate the understanding of the underlying complex gene regulatory circuits.\nIn this work we have developed an evolutionary multi-objective optimization for our previously introduced triclustering algorithm δ-TRIMAX. Its aim is to make optimal use of δ-TRIMAX in extracting groups of co-expressed genes from time series gene expression data, or from any 3D gene expression dataset, by adding the powerful capabilities of an evolutionary algorithm to retrieve overlapping triclusters. We have compared the performance of our newly developed algorithm, EMOA- δ-TRIMAX, with that of other existing triclustering approaches using four artificial dataset and three real-life datasets. Moreover, we have analyzed the results of our algorithm on one of these real-life datasets monitoring the differentiation of human induced pluripotent stem cells (hiPSC) into mature cardiomyocytes. For each group of co-expressed genes belonging to one tricluster, we identified key genes by computing their membership values within the tricluster. It turned out that to a very high percentage, these key genes were significantly enriched in Gene Ontology categories or KEGG pathways that fitted very well to the biological context of cardiomyocytes differentiation.\nEMOA- δ-TRIMAX has proven instrumental in identifying groups of genes in transcriptomic data sets that represent the functional categories constituting the biological process under study. The executable file can be found at http://www.bioinf.med.uni-goettingen.de/fileadmin/download/EMOA-delta-TRIMAX.tar.gz .","authors":["Anirban Bhar","Martin Haubrock","Anirban Mukhopadhyay","Edgar Wingender"],"meta":["June 2015BMC Bioinformatics 16(1):200","DOI:10.1186/s12859-015-0635-8","SourcePubMed"],"references":["258768377_Hippo_signaling_impedes_adult_heart_regeneration","255716220_Mining_Quasi-Bicliques_from_HIV-1-Human_Protein_Interaction_Network_A_Multiobjective_Biclustering_Approach","255694759_MicroRNA_Expression_Changes_during_Interferon-Beta_Treatment_in_the_Peripheral_Blood_of_Multiple_Sclerosis_Patients","240307078_Induced_Pluripotent_Stem_Cell-Derived_Cardiac_Progenitors_Differentiate_to_Cardiomyocytes_and_Form_Biosynthetic_Tissues","236073688_Coexpression_and_coregulation_analysis_of_time-series_gene_expression_data_in_estrogen-induced_breast_cancer_cell","279338677_The_TRANSFAC_system_on_gene_expression_regulation","261588607_The_Proof_and_Measurement_of_Association_Between_Two_Things","247742629_Methodology_Review_Clustering_Methods","244504294_Systematic_discovery_of_regulatory_motifs_in_human_promoters_and_3","237756639_How_To_Use_GOstats_Testing_Gene_Lists_for_GO_Term_Association"]}