{"id":"279309678_Bisimulation_and_expressivity_for_conditional_belief_degrees_of_belief_and_safe_belief","abstract":"Plausibility models are Kripke models that agents use to reason about\nknowledge and belief, both of themselves and of each other. Such models are\nused to interpret the notions of conditional belief, degrees of belief, and\nsafe belief. The logic of conditional belief contains that modality and also\nthe knowledge modality, and similarly for the logic of degrees of belief and\nthe logic of safe belief. With respect to these logics, plausibility models may\ncontain too much information. A proper notion of bisimulation is required that\ncharacterises them. We define that notion of bisimulation and prove the\nrequired characterisations: on the class of image-finite and preimage-finite\nmodels (with respect to the plausibility relation), two pointed Kripke models\nare modally equivalent in either of the three logics, if and only if they are\nbisimilar. As a result, the information content of such a model can be\nsimilarly expressed in the logic of conditional belief, or the logic of degrees\nof belief, or that of safe belief. This, we found a surprising result. Still,\nthat does not mean that the logics are equally expressive: the logics of\nconditional and degrees of belief are incomparable, the logics of degrees of\nbelief and safe belief are incomparable, while the logic of safe belief is more\nexpressive than the logic of conditional belief. In view of the result on\nbisimulation characterisation, this is an equally surprising result. We hope\nour insights may contribute to the growing community of formal epistemology and\non the relation between qualitative and quantitative modelling.","authors":["Mikkel Birkegaard Andersen","Thomas Bolander","Hans van Ditmarsch","Martin Holm Jensen"],"meta":["July 2017Synthese 194(7)","DOI:10.1007/s11229-016-1060-x","SourcearXiv"],"references":["270752615_On_the_definability_of_simulation_and_bisimulation_in_epistemic_logic","258048357_Don't_Plan_for_the_Unexpected_Planning_Based_on_Plausibility_Models","258048269_Conditional_Epistemic_Planning","258048268_Bisimulation_for_Single-Agent_Plausibility_Models","254273435_Epistemic_planning_for_singleand_multi-agent_systems","284041064_One_is_a_lonely_number_On_the_logic_of_communication","262165039_Multi-agent_epistemic_explanatory_diagnosis_via_reasoning_about_actions","259810884_Dynamic_Epistemic_Logic","259810774_Logical_Dynamics_of_Information_and_Interaction","258083717_Defeasible_Modalities"]}