{"id":"279303934_Risk_of_Recurrent_Stillbirth_Systematic_Review_and_Meta-Analysis","abstract":"To determine the risk of recurrent stillbirth.\nSystematic review and meta-analysis of cohort and case-control studies.\nEmbase, Medline, Cochrane Library, PubMed, CINAHL, and Scopus searched systematically with no restrictions on date, publication, or language to identify relevant studies. Supplementary efforts included searching relevant internet resources as well as hand searching the reference lists of included studies. Where published information was unclear or inadequate, corresponding authors were contacted for more information.\nCohort and case-control studies from high income countries were potentially eligible if they investigated the association between stillbirth in an initial pregnancy and risk of stillbirth in a subsequent pregnancy. Stillbirth was defined as fetal death occurring at more than 20 weeks' gestation or a birth weight of at least 400 g. Two reviewers independently screened titles to identify eligible studies based on inclusion and exclusion criteria agreed a priori, extracted data, and assessed the methodological quality using scoring criteria from the critical appraisal skills programme. Random effects meta-analyses were used to combine the results of the included studies. Subgroup analysis was performed on studies that examined unexplained stillbirth.\n13 cohort studies and three case-control studies met the inclusion criteria and were included in the meta-analysis. Data were available on 3 412 079 women with pregnancies beyond 20 weeks duration, of who 3 387 538 (99.3%) had had a previous live birth and 24 541 (0.7%) a stillbirth. A total of 14 283 stillbirths occurred in subsequent pregnancies, 606/24 541 (2.5%) in women with a history of stillbirth and 13 677/3 387 538 (0.4%) among women with no such history (pooled odds ratio 4.83, 95% confidence interval 3.77 to 6.18). 12 studies specifically assessed the risk of stillbirth in second pregnancies. Compared with women who had a live birth in their first pregnancy, those who experienced a stillbirth were almost five times more likely to experience a stillbirth in their second pregnancy (odds ratio 4.77, 95% confidence interval 3.70 to 6.15). The pooled odds ratio using the adjusted effect measures from the primary studies was 3.38 (95% confidence interval 2.61 to 4.38). Four studies examined the risk of recurrent unexplained stillbirth. Methodological differences between these studies precluded pooling the results.\nThe risk of stillbirth in subsequent pregnancies is higher in women who experience a stillbirth in their first pregnancy. This increased risk remained after adjusted analysis. Evidence surrounding the recurrence risk of unexplained stillbirth remains controversial.\n© Lamont et al 2015.","authors":["Kathleen Lamont","Neil W Scott","Gareth T Jones","Sohinee Bhattacharya"],"meta":["June 2015BMJ Clinical Research 350(jun23 3):h3080","DOI:10.1136/bmj.h3080","SourcePubMed"],"references":["261770333_Trends_and_recurrence_of_stillbirths_in_NSW","261744324_Maternal_Body_Mass_Index_and_the_Risk_of_Fetal_Death_Stillbirth_and_Infant_Death","236301570_Meta-analysis_of_Observational_Studies_in_EpidemiologyA_Proposal_for_Reporting","233379762_Association_Between_Stillbirth_and_Risk_Factors_Known_at_Pregnancy_Confirmation","221850838_Stillbirth_Risk_in_a_Second_Pregnancy","236276581_Subsequent_pregnancy_after_stillbirth_Obstetrical_and_medical_risks","232810662_Subsequent_pregnancy_outcome_after_previous_foetal_death","51054888_National_regional_and_worldwide_estimates_of_stillbirth_rates_in_2009_with_trends_since_1995_A_systematic_analysis","51054887_Major_Risk_Factors_for_Stillbirth_in_High-Income_Countries_A_Systematic_Review_and_Meta-Analysis_EDITORIAL_COMMENT","51054878_Stillbirths_The_way_forward_in_high-income_countries"]}