{"id":"279431811_Hippocampal_Formation","abstract":"This chapter focuses on the functional organization of the human hippocampal formation. It first discusses the gross anatomy of the hippocampal formation. The gross anatomical features of the hippocampal formation are taking on increasing importance as landmarks in neuroimaging studies. The chapter also deals with the cytoarchitetonic organization of the hippocampus with a comparison to the rodent and nonhuman primate. Next section deals with the connectivity of the hippocampal formation. Furthermore, the chapter presents an overview of normal development of the human hippocampal formation, followed by the discussion of pathological conditions that have a direct impact on human hippocampal formation. It necessarily provides an overview of this area because there has been an extensive research, both at the basic and clinical levels, dealing with topics such as Alzheimer's disease and the hippocampus. Finally, the last section surveys the results obtained with modern neuroimaging techniques and how they have influenced thinking about the function of the hippocampal formation.","authors":["Ricardo Insausti","David Amaral"],"meta":["December 2004","DOI:10.1016/B978-012547626-3/50024-7","In book: The Human Nervous System (pp.871-914)"],"references":["324231567_Profound_Loss_of_Layer_II_Entorhinal_Cortex_Neurons_Occurs_in_Very_Mild_Alzheimer's_Disease","324118578_Human_amnesia_and_the_medial_temporal_region_enduring_memory_impairment_following_a_bilateral_lesion_limited_to_field_CA1_of_the_hippocampus","321570241_Excitatory_Amino_Acids_and_Epilepsy","319528380_Prenatal_development_of_nicotinamide_adenine_dinucleotide_phosphate-diaphorase_activity_in_the_human_hippocampal_formation","316267266_Memory_consolidation_and_the_hippocampus_Further_evidence_from_studies_of_autobiographical_memory_in_semantic_dementia_and_frontal_variant_frontotemporal_dementia","313752448_Allocortex","313650174_Hypoxia_and_vascular_disorders_of_the_cerebral_nervous_system","313301907_The_limbic_region_I_The_septohippocampal_system","313063557_Sobre_un_ganglio_especial_de_la_corteza_esfeno-occipital","312468044_Memory_and_the_medial_temporal_regions_of_the_brain"]}