{"id":"279450553_A_Review_of_Skew_Detection_Techniques_for_Document","abstract":"Skew detection and correction of documents is a problematic step in document image analysis. Many methods have been proposed by researchers for estimating the angle at which a document image is rotated (document skew) in binary image documents. Therefore, this paper aims to evaluate the most frequently skew detection techniques cited in the literature which are (i) Projection Profile Analysis (PP), (ii) Hough Transform (HT) and (iii) Nearest Neighbour (NN). This study points out the weaknesses and the strengths of each method and compares the performance of these methods in term of speed and accuracy. The evaluation result shows that in term of speed, the NN technique achieves the fastest time. However, NN performs poorly for the accuracy estimation. PP gives the best angle estimation even though it takes the longest time to execute. Hence, this finding can be used as the basis evaluation review for image analysis researchers in improving the existing technique of skew detection and recommend algorithm with a better accuracy in a shorter time.","authors":["Arwa Mahmoud AL-Khatatneh","Sakinah Ali Pitchay","Musab Kasim Al-qudah"],"meta":["March 2015","DOI:10.1109/UKSim.2015.73","Conference: 17th UKSIM-AMSS International Conference on Modelling and SimulationAt: Cambridge University, UK"],"references":["265300502_Robust_Skew_Estimation_of_Handwritten_and_Printed_Documents_Based_on_Grayvalue_Images","258496495_The_Evaluation_of_the_Initial_Skew_Rate_for_Printed_Text","252067153_Modified_Approach_of_Hough_Transform_for_Skew_Detection_and_Correction_in_Documented_Images","269272777_Document_image_skew_detection_and_correction_method_based_on_extreme_points","268414358_A_Fast_High_Precision_Algorithm_for_the_Estimation_of_Skew_Angle_Using_Moments","252232483_Measuring_document_image_skew_and_orientation","245337705_An_experimental_system_for_office_document_handling_and_text_recognition","243768461_Detection_of_linear_oblique_structures_and_skew_scan_in_digitized_documents","237471333_Skew_Detection_Technique_for_Binary_Document_Images_based_on_Hough_Transform","223081609_Hagita_N_Automatic_entry_system_for_printed_documents_Pattern_Recognit_2311_1141-1154"]}