{"id":"279458743_The_Multi-strand_Graph_for_a_PTZ_Tracker","abstract":"High-resolution images can be used to resolve matching ambiguities between\ntrajectory fragments (tracklets), which is one of the main challenges in\nmultiple target tracking. A PTZ camera, which can pan, tilt and zoom, is a\npowerful and efficient tool that offers both close-up views and wide area\ncoverage on demand. The wide-area view makes it possible to track many targets\nwhile the close-up view allows individuals to be identified from\nhigh-resolution images of their faces. A central component of a PTZ tracking\nsystem is a scheduling algorithm that determines which target to zoom in on.\nIn this paper we study this scheduling problem from a theoretical\nperspective, where the high resolution images are also used for tracklet\nmatching. We propose a novel data structure, the Multi-Strand Tracking Graph\n(MSG), which represents the set of tracklets computed by a tracker and the\npossible associations between them. The MSG allows efficient scheduling as well\nas resolving -- directly or by elimination -- matching ambiguities between\ntracklets. The main feature of the MSG is the auxiliary data saved in each\nvertex, which allows efficient computation while avoiding time-consuming graph\ntraversal. Synthetic data simulations are used to evaluate our scheduling\nalgorithm and to demonstrate its superiority over a na\\\"ive one.","authors":["Shachaf Melman","Yael Moses","Gérard G. Medioni","Yinghao Cai"],"meta":["May 2018Journal of Mathematical Imaging and Vision 60(3)","DOI:10.1007/s10851-017-0774-9","SourcearXiv"],"references":["346028195_Persistent_people_tracking_and_face_capture_using_a_PTZ_camera","304469323_Dynamic_camera_scheduling_for_visual_surveillance_in_crowded_scenes_using_Markov_random_fields","286537548_Tracking_Interacting_Objects_Optimally_Using_Integer_Programming","274637376_Distributed_Constrained_Optimization_for_Bayesian_Opportunistic_Visual_Sensing","270824029_Three_hypothesis_algorithm_with_occlusion_reasoning_for_multiple_people_tracking","262368514_Decision-theoretic_approach_to_maximizing_observation_of_multiple_targets_in_multi-camera_surveillance","311609320_Robust_Real-Time_3D_Tracking_of_Multiple_Objects_with_Similar_Appearances","286562002_Towards_a_practical_PTZ_face_detection_and_tracking_system","274968411_Non-myopic_information_theoretic_sensor_management_of_a_single_pan-tilt-zoom_camera_for_multiple_object_detection_and_tracking","261200441_An_online_learned_CRF_model_for_multi-target_tracking"]}