{"id":"279553954_Assessing_the_Mendeley_readership_of_social_sciences_and_humanities_research","abstract":"There is some evidence that counting the readers of an article in the social reference site, Mendeley, may help to capture the research impact of the article, but the extent to which this is true for different scientific fields is unknown. This study compares Mendeley readership counts with citation counts for different social sciences and humanities disciplines. Mendeley usage data is also used as a novel way to discover patterns of information flow between scientific subjects. The overall correlation between Mendeley readership counts and citations for the social sciences was higher than for the humanities. Low and medium correlations between Mendeley readership and citation counts in all the investigated disciplines suggest that these measures reflect different aspects of research impact. The information flow findings indicate that most users of social sciences and humanities papers are from within the same discipline but some less obvious relationships between scientific disciplines were also discovered. Thus, Mendeley readership can complement citation metrics in many disciplines to help measure broader research impact and to uncover relationships between scholarly disciplines from the reader's perspective.","authors":["Ehsan Mohammadi","Mike Thelwall"],"meta":["January 2013"],"references":["286021836_Correction_Can_Tweets_Predict_Citations_Metrics_of_Social_Impact_Based_on_Twitter_and_Correlation_with_Traditional_Metrics_of_Scientific_Impact","257662983_Validating_Online_Reference_Managers_for_Scholarly_Impact_Measurement","254115559_Measuring_researchers'_use_of_scholarly_information_through_social_bookmarking_data_A_case_study_of_BibSonomy","323424582_Statistical_power_analysis_for_the_behavioral_sciences","290165117_The_historical_evolution_of_interdisciplinarity_1900-2008","287840556_The_tuition_of_American_planning_from_dependency_toward_self-reliance","280820693_Boundary_crossing_in_research_literatures_as_a_means_of_interdisciplinary_information_transfer","260282747_Altmetrics_A_Manifesto","257663088_Journal_impact_evaluation_A_webometric_perspective","255245755_Positional_Effects_on_Citation_and_Readership_in_arXiv"]}