{"id":"279541652_A_hybrid_CPMP_approach_to_supply_chain_modelling_optimization_and_analysis","abstract":"The paper presents a concept and implementation of a novel hybrid approach to the modelling, optimization and analysis of the supply chain problems. Two environments, mathematical programming (MP) and constraint programming (CP), in which constraints are treated in different ways and different methods are implemented, were combined to use the strengths of both. This integration and hybridization, complemented with an adequate transformation of the problem, facilitates a significant reduction of the combinatorial problem. The whole process takes place at the implementation layer, which makes it possible to use the structure of the problem being solved, implementation environments and the very data. The superiority of the proposed approach over the classical scheme is proved by considerably shorter search time and example-illustrated wide-ranging possibility of expanding the decision and/or optimization models through the introduction of new logical constraints, frequently encountered in practice. The proposed approach is particularly important for the decision models with an objective function and many discrete decision variables added up in multiple constraints. The presented approach will be compared with classical mathematical programming on the same data sets.","authors":["Paweł Sitek"],"meta":["September 2014","DOI:10.15439/2014F89","Conference: Federated Conference on Computer Science and Information Systems (FedCSIS), 2014","Project: A hybrid approach to modeling and solving problems"],"references":["284225903_Sustainability_in_the_Supply_Chain_Analysing_the_Enablers","261149082_Cost-efficient_synthesis_of_multiprocessor_heterogeneous_systems","259900686_Developing_Agile_Supply_Chains_-_System_Model_Algorithms_Applications","286716935_Investigating_Organizational_Characteristics_for_Sustainable_Supply_Chain_Planning_Under_Fuzziness","278657047_A_Hybrid_Approach_to_the_Two-Echelon_Capacitated_Vehicle_Routing_Problem_2E-CVRP","274311445_Scheduling_a_Single_Mobile_Robot_Incorporated_into_Production_Environment","267098219_A_decision_support_tool_for_project_portfolio_management_with_imprecise_data","266674963_A_Declarative_Approach_to_New_Product_Development_in_the_Automotive_Industry","266539802_Branch-and-Infer_a_Framework_for_Combining_CP_and_IP","261212718_A_hybrid_approach_to_modeling_and_optimization_for_supply_chain_management_with_multimodal_transport"]}