{"id":"279581021_A_hybridized_genetic_algorithm_to_solve_parallel_machine_scheduling_problems_with_sequence_dependent_setups","abstract":"Reducing setups in a single machine scheduling problem with sequence dependent setups is an NP-hard problem for most performance measures. Adding factors such as release times, process times, due dates, weights, and parallel machines further complicates the problem. Therefore, heuristics are often used to solve parallel machine problems. Genetic Algorithms (GA's) are widely used for scheduling problems. In this paper, test problems are characterized by the following factors, 1) range of weights, 2) range of due dates, 3) percentage of jobs ready at the beginning, and 4) ratio of average processing times to average setup times. A GA is used to assign jobs to machines and then a dispatching rule is used to schedule the individual machines. This approach is compared with commonly used strategies and shows better results in most test cases. Three performance measures of scheduling, makespan, total weighted completion time, and total weighted tardiness, are studied.","authors":["J.W. Fowler","Shwu-Min Horng","Jeffery K. Cochran"],"meta":["September 2003The International Journal of Industrial Engineering: Theory, Applications and Practice 10(3):232-243"],"references":["239062653_Heuristic_to_minimize_the_total_weighted_tardiness_with_sequence-dependent_setups","313706874_Adaptation_in_natural_and_artificial_systems","283996103_Genetic_Algorithms_In_Search_Optimization_and_Machine_Learning","256616361_Scheduling_in_a_manufacturing_shop_with_sequence-dependent_setups","247076294_Optimization_of_PCB_Component_Placement_using_Genetic_Algorithms","243657415_Convergence_properties_of_canonical_genetic_algorithms","242932924_The_Airline_Crew_Scheduling_Problem_A_Survey","242916349_Job_shop_scheduling_with_separable_sequence-dependent_setups","242436179_Fundamentals_of_Queing_Theory","229879062_Global_Job_Shop_Scheduling_with_a_Genetic_Algorithm"]}