{"id":"279588493_How_does_student_ability_and_self-efficacy_affect_the_usage_of_computer_technology","abstract":"The main aim of this research was to find out the self-efficacy level among participant students and analyze their beliefs. This study showed that male students are more confident comparing to female student, similar to research of Bimer (2000), the computer usage has been known as biased toward the interests and fashion of men, this research also showed that females are not as confident as men are to computers. Awoleye & Siyanbola (2005), Bimer (2000), indicated that computers have some gendered attributes that favor man in some way so that men are more likely to use computers and they are more confident. Therefore it can be said that many studies has been support the gender factor in self-efficacy, but this research also showed that this changes are more likely to be depend on the complexity of the task and the year of computer usage of the particular student as Busch(1995) has been found the similar results. Similar to the study of Compeau, and Higging (1995), it is found that self-efficacy shapes the individuals beliefs and behaviors as well. It is not surprising to find out that students have different computer levels and this affects their self-efficacy. Also some students have advance computer knowledge, therefore they complain about the level of the computer courses offered to them. In addition to this it can be said that students with different computer skills shows different self-efficacy levels as well.","authors":["A. Işman","G.E. Çelikli"],"meta":["January 2009Turkish Online Journal of Educational Technology 8(1):33-38"],"references":["228608321_An_Assessment_of_Basic_Computer_Proficiency_Among_Active_Internet_Users_Test_Construction_Calibration_Antecedents_and_Consequences","256106136_Task_self-efficacy_and_task_interest_as_a_function_of_performance_on_a_gender-neutral_task","249900786_Improving_Learning_Strategies_with_Computer-based_Education","227878948_Attitudes_toward_computers_Construct_validation_and_relations_to_computer_use","223616130_The_effects_of_mathematics_on_math_self-efficacy_and_task_interest"]}