{"id":"279555284_Educational_usages_of_online_games_the_example_of_language_learning_Usages_educatifs_des_jeux_en_ligne_L'exemple_de_l'apprentissage_des_langues","abstract":"Online games can be particularly well adapted for use as learning tools in certain disciplines which require time and repetition. Indeed, they offer interactions with others, simulation of concrete situations, actions put into context and involvement in community life, encouraging people to remain within a game space over a period of time and to accept to face difficulties, even if they are repetitive. The application of online games in education and language learning, which is a learning process that requires time and interactions, has therefore been developed over the last few years. This article presents the most significant of these online games in the specific field of learning French as a foreign language. It underlines that most applications are limited through their parsimonious use of the potential of network technology: the low use of images and video, little or no interaction between players, over-explicit learning objectives cancelling out playful elements, teaching methods based on closed exercises etc. The article also presents a contrasting concept with a massively multiplayer online role-playing game for learning languages, for which Zon (Michigan State University) and Theleme (Strasbourg University/CNRS/Almedia) are the pioneering examples using simultaneously all the scope of online games: interactivity, immersion, simulation and playfulness. However, interest for these games raises questions linked with conflicts of the models they give rise to: learning models, actor-learner and actor-teacher models, underlying social models (systems of values). There is therefore a gap between the theoretical interest and the practical success which these games encounter on the market.","authors":["Laurence Schmoll"],"meta":["January 2011Revue des sciences sociales de la France de l'Est"],"references":["284043820_Le_lecteur_modele_des_concepteurs_de_sites_Internet_pedagogiques","283846831_DU_JEU_VIDEO_AU_SERIOUS_GAME_Approches_culturelle_pragmatique_et_formelle","313133376_How_are_digital_games_used_in_schools","283759653_Approche_interactionnelle_taches_de_la_vie_reelle_et_didactique_invisible_sur_le_web_20_pour_plus_d'authenticite_et_moins_de_simulation","283759650_Le_projet_Babelweb_-_Approche_interactionnelle_et_didactique_invisible_sur_le_web_20","254908981_Homo_ludens_Proeve_eener_bepaling_van_het_spel-element_der_cultuur","27620997_Communautes_de_joueurs_et_mondes_persistants"]}