{"id":"279517873_Node_Density_Estimation_in_VANETs_Using_Received_Signal_Power","abstract":"Accurately estimating node density in Vehicular Ad hoc Networks, VANETs, is a challenging and crucial task. Various approaches exist, yet none takes advantage of physical layer parameters in a distributed fashion. This paper describes a framework that allows individual nodes to estimate the node density of their surrounding network independent of beacon messages and other infrastructurebased information. The proposal relies on three factors: 1) a discrete event simulator to estimate the average number of nodes transmitting simultaneously; 2) a realistic channel model for VANETs environment; and 3) a node density estimation technique. This work provides every vehicle on the road with two equations indicating the relation between 1) received signal strength versus simultaneously transmitting nodes, and 2) simultaneously transmitting nodes versus node density. Access to these equations enables individual nodes to estimate their real-time surrounding node density. The system is designed to work for the most complicated scenarios where nodes have no information about the topology of the network and, accordingly, the results indicate that the system is reasonably reliable and accurate. The outcome of this work has various applications and can be used for any protocol that is affected by node density.","authors":["Golnar Khomami","Prakash Veeraraghavan","Fernando Perez Fontan"],"meta":["June 2015Radioengineering 24(2):489-498","DOI:10.13164/re.2015.0489","Project: Real-Time Estimation of Neighbouring Node Density in Chaotic VANET Environments"],"references":["226936734_Impact_of_the_radio_channel_modelling_on_the_performance_of_VANET_communication_protocols","224368372_Evaluation_of_a_Neighbor-based_Vehicle_Density_Estimation_Scheme","224290764_An_Infrastructure-Free_Traffic_Information_System_for_Vehicular_Networks","221703295_A_Measurement_Based_Shadow_Fading_Model_for_Vehicle-to-Vehicle_Network_Simulations","220926567_The_Broadcast_Storm_Problem_in_a_Mobile_ad_hoc_Network","258223005_Modelling_the_Wireless_Propagation_Channel_A_Simulation_Approach_with_MATLAB","238650920_802_11_Wireless_Networks_The_Definitive_Guide","238007440_Store-Carry-Forward_Message_Dissemination_in_Vehicular_Ad-Hoc_Networks_with_Local_Density_Estimation","224237937_Cooperative_Intelligent_Transport_Systems_59-GHz_Field_Trials","224093580_A_Survey_on_Vehicle-to-Vehicle_Propagation_Channels"]}