{"id":"279632608_Optimal_Transport_for_Domain_Adaptation","abstract":"Domain adaptation from one data space (or domain) to another is one of the\nmost challenging tasks of modern data analytics. If the adaptation is done\ncorrectly, models built on a specific data space become more robust when\nconfronted to data depicting the same semantic concepts (the classes), but\nobserved by another observation system with its own specificities. Among the\nmany strategies proposed to adapt a domain to another, finding a common\nrepresentation has shown excellent properties: by finding a common\nrepresentation for both domains, a single classifier can be effective in both\nand use labelled samples from the source domain to predict the unlabelled\nsamples of the target domain. In this paper, we propose a regularized\nunsupervised optimal transportation model to perform the alignment of the\nrepresentations in the source and target domains. We learn a transportation\nplan matching both PDFs, which constrains labelled samples in the source domain\nto remain close during transport. This way, we exploit at the same time the few\nlabeled information in the source and the unlabelled distributions observed in\nboth domains. Experiments in toy and challenging real visual adaptation\nexamples show the interest of the method, that consistently outperforms state\nof the art approaches.","authors":["Nicolas Courty","Rémi Flamary","Devis Tuia","Alain Rakotomamonjy"],"meta":["July 2015IEEE Transactions on Pattern Analysis and Machine Intelligence PP(99)","DOI:10.1109/TPAMI.2016.2615921","SourcearXiv"],"references":["308671528_Multitemporal_classification_without_new_labels_A_solution_with_optimal_transport","294256695_Kernel_Manifold_Alignment_for_Domain_Adaptation","286753091_Covariate_shift_in_Hilbert_space_A_solution_via_surrogate_kernels","319770357_DeCAF_A_Deep_Convolutional_Activation_Feature_for_Generic_Visual_Recognition","318779943_Displacement_Interpolation_Using_Lagrangian_Mass_Transport","314236653_Progress_in_Nonlinear_Differential_Equations_and_Their_Applications","313107373_Direct_importance_estimation_with_model_selection_and_its_application_to_covariate_shift_adaptation","312913129_On_the_translocation_of_masses","310752944_Frustratingly_easy_domain_adaptation","288385210_Wasserstein_propagation_for_semi-supervised_learning"]}