{"id":"279632796_Approximate_Span_Programs","abstract":"Span programs are a model of computation that have been used to design quantum algorithms, mainly in the query model. It is known that for any decision problem, there exists a span program that leads to an algorithm with optimal quantum query complexity, however finding such an algorithm is generally challenging. We consider new ways of designing quantum algorithms using span programs. We show how any span program that decides a function f can also be used to decide “threshold” versions of the function f, or more generally, approximate a quantity called the span program witness size, which is some property of the input related to f. We achieve these results by relaxing the requirement that 1-inputs hit some target exactly in the span program, which could potentially make design of span programs significantly easier. In addition, we give an exposition of span program structure, which increases the general understanding of this important model. One implication of this is alternative algorithms for estimating the witness size when the phase gap of a certain unitary can be lower bounded. We show how to lower bound this phase gap in certain cases. As an application, we give the first upper bounds in the adjacency query model on the quantum time complexity of estimating the effective resistance between s and t, Rs,t(G). For this problem we obtain O~(1ε3/2nRs,t(G)), using O(log n) space. In addition, when μ is a lower bound on λ2(G) , by our phase gap lower bound, we can obtain an upper bound of O~(1εnRs,t(G)/μ) for estimating effective resistance, also using O(log n) space. © 2018, Springer Science+Business Media, LLC, part of Springer Nature.","authors":["Tsuyoshi Ito","Stacey Jeffery"],"meta":["June 2019Algorithmica 81(1969)","DOI:10.1007/s00453-018-0527-1","SourcearXiv"],"references":["239761510_Span_Programs_for_Functions_with_Constant-Sized_1-certificates","227140153_The_Electrical_Resistance_Of_A_Graph_Captures_Its_Commute_And_Cover_Times","344774923_Random_Walks_and_Electric_Networks","324767808_Markov_Chains_and_Mixing_Times","313565837_Random_Walks_and_Electric_Networks","311611804_Span-program-based_quantum_algorithm_for_evaluating_formulas","301857732_Quantum_Lower_Bounds_by_Polynomials","262346128_Time-Efficient_Quantum_Walks_for_3-Distinctness","258345410_Quantum_algorithms_for_approximating_the_effective_resistances_of_electrical_networks","257459606_A_Survey_of_Quantum_Property_Testing","224919456_Learning-Graph-Based_Quantum_Algorithm_for_k-Distinctness","224266341_Quantum_Query_Complexity_of_State_Conversion","221677406_Span_Programs_and_Quantum_Algorithms_for_st-Connectivity_and_Claw_Detection","221580449_On_Span_Programs","220617297_Strengths_and_Weakness_of_Quantum_Computing"]}