{"id":"279632763_Improved_Purely_Additive_Fault-Tolerant_Spanners","abstract":"Let G be an unweighted n-node undirected graph. A β-additive spanner of G is a spanning subgraph H of G such that distances in H are stretched at most by an additive term β w.r.t. the corresponding distances in G. A natural research goal related with spanners is that of designing sparse spanners with low stretch.\nIn this paper, we focus on fault-tolerant additive spanners, namely additive spanners which are able to preserve their additive stretch even when one edge fails. We are able to improve all known such spanners, in terms of either sparsity or stretch. In particular, we consider the sparsest known spanners with stretch 6, 28, and 38, and reduce the stretch to 4, 10, and 14, respectively (while keeping the same sparsity).\nOur results are based on two different constructions. On one hand, we show how to augment (by adding a small number of edges) a fault-tolerant additive sourcewise spanner (that approximately preserves distances only from a given set of source nodes) into one such spanner that preserves all pairwise distances. On the other hand, we show how to augment some known fault-tolerant additive spanners, based on clustering techniques. This way we decrease the additive stretch without any asymptotic increase in their size. We also obtain improved fault-tolerant additive spanners for the case of one vertex failure, and for the case of f edge failures.","authors":["Davide Bilò","Fabrizio Grandoni","Luciano Gualà","Stefano Leucci"],"meta":["July 2015Lecture Notes in Computer Science 9294","DOI:10.1007/978-3-662-48350-3_15","SourcearXiv"],"references":["264497911_Vertex_Fault_Tolerant_Additive_Spanners","263619867_Fault-Tolerant_Approximate_Shortest-Path_Trees","263390493_Fault_Tolerant_Approximate_BFS_Structures","235794655_On_Resilient_Graph_Spanners","301724431_On_Resilient_Graph_Spanners","286169692_New_Additive_Spanners","284776498_Some_recent_progress_on_extremal_problems_in_graph_theory","284684743_Extremal_problems_in_graph_theory","266961815_Fault_Tolerant_Additive_Spanners","261211957_Improved_Distance_Sensitivity_Oracles_via_Fast_Single-Source_Replacement_Paths"]}