{"id":"279633396_Characterization_of_Logic_Program_Revision_as_an_Extension_of_Propositional_Revision","abstract":"We address the problem of belief revision of logic programs (LPs), i.e., how to incorporate to a LP P a new LP Q. Based on the structure of SE interpretations, Delgrande et al. (2008. Proc. of the 11th International Conference on Principles of Knowledge Representation and Reasoning (KR’08), 411–421; 2013b. Proc. of the 12th International Conference on Logic Programming and Nonmonotonic Reasoning (LPNMR’13), 264–276) adapted the well-known AGM framework (Alchourro ́n et al. 1985. Journal of Symbolic Logic 50, 2, 510–530) to LP revision. They identified the rational behavior of LP revision and introduced some specific operators. In this paper, a constructive characterization of all rational LP revision operators is given in terms of orderings over propositional interpretations with some further conditions specific to SE interpretations. It provides an intuitive, complete procedure for the construction of all rational LP revision operators and makes easier the comprehension of their semantic and computational properties. We give a particular consideration to LPs of very general form, i.e., the generalized logic programs (GLPs). We show that every rational GLP revision operator is derived from a propositional revision operator satisfying the original AGM postulates. Interestingly, the further conditions specific to GLP revision are independent from the propositional revision operator on which a GLP revision operator is based. Taking advantage of our characterization result, we embed the GLP revision operators into structures of Boolean lattices, that allow us to bring to light some potential weaknesses in the adapted AGM postulates. To illustrate our claim, we introduce and characterize axiomatically two specific classes of (rational) GLP revision operators which arguably have a drastic behavior. We additionally consider two more restricted forms of LPs, i.e., the disjunctive logic programs (DLPs) and the normal logic programs (NLPs) and adapt our characterization result to disjunctive logic program and normal logic program revision operators.","authors":["Nicolas Schwind","Katsumi Inoue"],"meta":["January 2016Theory and Practice of Logic Programming 16(1):111-138","DOI:10.1017/S1471068415000101","SourcearXiv"],"references":["259224048_A_Model-Theoretic_Approach_to_Belief_Change_in_Answer_Set_Programming","257471619_Characterization_Theorems_for_Revision_of_Logic_Programs","318899851_Strongly_Equivalent_Logic_Programs","316128365_A_preference-based_framework_for_updating_logic_programs","267422363_Robust_Equivalence_Models_for_Semantic_Updates_of_Answer-Set_Programs","239061396_Computational_Complexity_Addison-Wesley","238951554_The_Rise_and_Fall_of_Semantic_Rule_Updates_Based_on_SE-Models","236628854_Computational_Complexity","223035375_Negation_as_failure_in_the_head","222232245_Propositional_knowledge_base_revision_and_minimal_change","221393429_Belief_Revision_of_Logic_Programs_under_Answer_Set_Semantics","221306822_A_Preference-Based_Framework_for_Updating_Logic_Programs","220838551_On_Semantic_Update_Operators_for_Answer-Set_Programs","221602914_Investigations_into_a_Theory_of_Knowledge_Base_Revision","220993253_Nonmonotonic_Reasoning_by_Minimal_Belief_Revision"]}