{"id":"279731963_Sequential_Insertion_Heuristic_with_Adaptive_Bee_Colony_Optimisation_Algorithm_for_Vehicle_Routing_Problem_with_Time_Windows","abstract":"This paper presents a bee colony optimisation (BCO) algorithm to tackle the vehicle routing problem with time window (VRPTW). The VRPTW involves recovering an ideal set of routes for a fleet of vehicles serving a defined number of customers. The BCO algorithm is a population-based algorithm that mimics the social communication patterns of honeybees in solving problems. The performance of the BCO algorithm is dependent on its parameters, so the online (self-adaptive) parameter tuning strategy is used to improve its effectiveness and robustness. Compared with the basic BCO, the adaptive BCO performs better. Diversification is crucial to the performance of the population-based algorithm, but the initial population in the BCO algorithm is generated using a greedy heuristic, which has insufficient diversification. Therefore the ways in which the sequential insertion heuristic (SIH) for the initial population drives the population toward improved solutions are examined. Experimental comparisons indicate that the proposed adaptive BCO-SIH algorithm works well across all instances and is able to obtain 11 best results in comparison with the best-known results in the literature when tested on Solomon's 56 VRPTW 100 customer instances. Also, a statistical test shows that there is a significant difference between the results.","authors":["Sana Jawarneh","Salwani Abdullah"],"meta":["July 2015PLoS ONE 10(7):e0130224","DOI:10.1371/journal.pone.0130224","SourcePubMed"],"references":["315498822_Verteilt-parallele_Metaheuristiken_zur_Tourenplanung","314796386_On_the_influence_of_GVR_in_vehicle_routing","313072904_Classical_heuristics_for_the_capacitated_VRP","312579013_Using_constraint_programming_and_local_search_methods_to_solve_vehicle_routing_problems","309107061_A_PSO_approach_for_solving_VRPTW_with_real_case_study","304168423_Stochastic_vehicle_routing_problemsStochastic_Vehicle_Routing_Problems","284884608_Bee_system_Modeling_combinatorial_optimization_transportation_engineering_problems_by_swarm_intelligence","283406764_The_vehicle_routing_problem","280757985_2-path_cuts_for_the_vehicle_routing_problem_with_time_windows","268615298_Sequential_Simulated_Annealing_for_the_Vehicle_Routing_Problem_with_Time_Windows"]}