{"id":"279838097_Storychastics_a_Bayesian_network_architecture_for_combined_user_modeling_sensor_fusion_and_computational_storytelling_for_interactive_spaces","abstract":"This thesis presents a mathematical framework for real-time sensor-driven stochastic modeling of story and user-story interaction, which I call sto(ry)chastics. Almost all sensor-driven interactive entertainment, art, and architecture installations today rely on one-to-one mappings between content and participant's actions to tell a story. These mappings chain small subsets of scripted content, and do not attempt to understand the public's intention or desires during interaction, and therefore are rigid, ad hoc, prone to error, and lack depth in communication of meaning and expressive power. Sto(ry)chastics uses graphical probabilistic modeling of story fragments and participant input, gathered from sensors, to tell a story to the user, as a function of people's estimated intentions and desires during interaction. Using a Bayesian network approach for combined modeling of users, sensors, and story, sto(ry)chastics, as opposed to traditional systems based on one- to-one mappings, is flexible, reconfigurable, adaptive, context-sensitive, robust, accessible, and able to explain its choices. To illustrate sto(ry)chastics, this thesis describes the museum wearable, which orchestrates an audiovisual narration as a function of the visitor's interests and physical path in the museum. The museum wearable is a lightweight and small computer that people carry inside a shoulder pack. It offers an audiovisual augmentation of the surrounding environment using a small eye-piece display attached to conventional headphones. The wearable prototype described in this document relies on a custom-designed","authors":["Flavia Sparacino"],"meta":["June 2005Lecture Notes in Computer Science 2864","DOI:10.1007/978-3-540-39653-6_5","Conference: 5th International Conference on Ubiquitous ComputingVolume: 2864"],"references":["225403325_An_Interactive_Computer_Vision_System_DyPERS_Dynamic_Personal_Enhanced_Reality_System","224101913_Media_in_performance_Interactive_spaces_for_dance_theater_circus_and_museum_exhibits","221240775_A_Touring_Machine_Prototyping_3D_Mobile_Augmented_Reality_Systems_for_Exploring_the_Urban_Environment","2296109_Towards_a_Bayesian_Model_for_Keyhole_Plan_Recognition_in_Large_Domains","314755915_Decision_Estimation_and_Classification","256476485_Maximum-likelihood_estimation_from_incomplete_data_via_the_EM_algorithm_with_discussion","240442536_The_Museum_Wearable_real-time_sensor-driven_understanding_of_visitors'_interests_for_personalized_visually-augmented_museum_experiences","221995817_Maximum_Likelihood_from_Incomplete_Data_Via_EM_Algorithm","221607992_Intelligent_Software","216301244_Probabilistic_Reasoning_in_Intelligent_Systems_Networks_Of_Plausible_Inference","2933684_Learning_Graphical_Models","2417508_Probabilistic_Frame-Based_Systems"]}