{"id":"279835215_Improved_Algorithms_for_Vertex_Cover_with_Hard_Capacities_on_Multigraphs_and_Hypergraphs","abstract":"In this paper, we consider the minimum unweighted Vertex Cover problem with Hard Capacity constraints (VCHC) on multigraphs and hypergraphs. Given a graph, the objective of VCHC is to find a smallest multiset of vertices that cover all edges, under the constraints that each vertex can only cover a limited number of incident edges, and the number of available copies of each vertex is bounded. This problem generalizes the classical unweighted vertex cover problem. Here we restrict our attention to unweighted instances, since the weighted version of VCHC is as hard as the set cover problem, as shown by Chuzhoy and Naor (FOCS 2002).\nWe obtain improved approximation algorithms for VCHC on multigraphs and hypergraphs. This problem has first been studied by Saha and Khuller (ICALP 2012). They proposed a 38-approximation for multigraphs, and a max {6 f, 65}-approximation for hypergraphs, where f is the size of the largest hyperedge. In this paper, we significantly improve these approximation ratios to 1 + 2/√3 < 2.155 and 2 f respectively. In the case of multigraphs, our approximation ratio is very close to the longstanding bound of 2 for the classical vertex cover problem. Our algorithms consist of a two-step process, each based on rounding an appropriate linear program. In particular, for multigraphs, the analysis in the second step relies on identifying a matching structure within any extreme point solution.\nFurthermore, we consider the partial VCHC problem in which one only needs to cover all but ℓ edges. We propose a generic reduction from partial VCHC on f-hypergraphs to VCHC on (f + 1)-hypergraphs, with a small loss in the approximation factor. In particular, we present a (2f + 2)(1 + ∊)-approximation algorithm for partial VCHC on f-hypergraphs.","authors":["Wang-Chi Cheung","Michel X. Goemans","Sam Chiu-Wai Wong"],"meta":["January 2015","DOI:10.1137/1.9781611973402.124"],"references":["225808701_Approximation_of_Partial_Capacitated_Vertex_Cover","225102282_Massaging_a_linear_programming_solution_to_give_a_2-approximation_for_a_generalization_of_the_vertex_cover_problem","262394007_Covering_Problems_with_Hard_Capacities","223729659_Approximation_algorithms_for_partial_covering_problems","222726456_Vertex_cover_might_be_hard_to_approximate_to_within","222438201_Even_S_A_linear_time_approximation_algorithm_for_the_weighted_vertex_cover_problem_Journal_of_Algorithms_2_198-203","220897686_An_Improved_Approximation_Algorithm_for_Vertex_Cover_with_Hard_Capacities","220779296_Capacitated_vertex_covering_with_applications"]}