{"id":"279849138_Title_Seshat_The_Global_History_Databank","abstract":"The vast amount of knowledge about past human societies has not been systematically organized and, therefore, remains inaccessible for empirically testing theories about cultural evolution and historical dynamics. For example, what evolutionary mechanisms were involved in the transition from the small-scale, uncentralized societies, in which humans lived 10,000 years ago, to the large-scale societies with an extensive division of labor, great differentials in wealth and power, and elaborate governance structures of today? Why do modern states sometimes fail to meet the basic needs of their populations? Why do economies decline, or fail to grow? In this\narticle, we describe the structure and uses of a massive databank of historical and archaeological information, Seshat: The Global History Databank. The data that we are currently entering in Seshat will allow us and others to test theories explaining how modern societies evolved from ancestral ones, and why modern societies vary so much in their capacity to satisfy their members’ basic human needs.","authors":["Peter Turchin","Rob Brennan","Thomas Currie","Kevin Feeney"],"meta":["July 2015","DOI:10.21237/C7CLIO6127917","Project: Seshat: Global History Databank"],"references":["292002787_Phylogenetic_models_of_language_change_three_new_questions","352347106_Warfare_and_the_Evolution_of_Social_Complexity_A_Multilevel-Selection_Approach","350994688_Religion_in_Human_Evolution_From_the_Paleolithic_to_the_Axial_Age","319394785_RDF_11_Primer","300587956_The_Puzzle_of_Human_Ultrasociality","300587866_The_Cultural_Evolution_of_Technology","297252273_Religion_in_the_emergence_of_civilization_Catalhoyok_as_a_case_study","292115061_Studies_in_the_Logic_of_Explanation","286710610_The_Sources_of_Social_Power_A_history_of_power_from_the_beginning_to_AD_1760","286030922_How_chiefs_became_kings_Divine_kingship_and_the_rise_of_archaic_states_in_ancient_Hawai'i"]}