{"id":"279982487_Trust_Mechanism_for_Enforcing_Compliance_to_Secondary_Data_Use_Contracts","abstract":"In many research and business domains, there are efforts to develop systems that aggregate user data gathered by various data sources. This approach involves secondary sharing of user data and potentially benefits the user in terms of improved personalization and better experience. However, concerns regarding privacy arise when sharing user data with unknown third parties. These concerns can be alleviated at two stages: i) ensuring selective control of the applications to share user data with, and ii) monitoring and penalizing errant data consumers who violate the terms of their contractual agreement and potentially abuse user data. This paper addresses the second stage of data use contract enforcement. We propose a trust management mechanism for monitoring data consumers' compliance to the contractual agreements for which data was shared with them. The trust mechanism is based on user complaints about suspected privacy violations and is able to identify the data consumers who are responsible. The framework penalizes the data consumer found guilty of violating its data use agreement by decreasing its trust value. This makes the data consumer less likely to be selected to receive user data, and limits its participation in the user data marketplace, forcing it to pay a higher price for purchase of user data.","authors":["Zeinab Noorian","Johnson Iyilade","Mohsen Mohkami","Julita Vassileva"],"meta":["October 2014","DOI:10.1109/TrustCom.2014.66","Conference: TRUSTCom'2014At: Beijing"],"references":["314928335_A_market_for_unbiased_private_data_Paying_individuals_according_to_their_privacy_attitudes","224872270_A_Market_for_Unbiased_Private_Data_Paying_Individuals_According_to_Their_Privacy_Attitudes","224178669_On_monitoring_information_flow_of_outsourced_data","320976320_Ubiquitous_User_Modeling","314801274_Managing_trust_in_a_peer-2-peer_information_system","291957094_A_Framework_for_Privacy-Aware_User_Data_Trading","277283013_Inducing_polynomial_equations_for_regression","254059527_Ensuring_Distributed_Accountability_for_Data_Sharing_in_the_Cloud","233862889_Ubiquitous_User_Modeling","222412837_A_Survey_of_Trust_and_Reputation_Systems_for_Online_Service_Provision"]}