{"id":"279956781_Random_Forests_for_Industrial_Device_Functioning_Diagnostics_UsingWireless_Sensor_Networks","abstract":"In this paper, random forests are proposed for operating devices diagnostics in the presence of a variable number of features. In various contexts, like large or difficult-to-access monitored areas, wired sensor networks providing features to achieve diagnostics are either very costly to use or totally impossible to spread out. Using a wireless sensor network can solve this problem, but this latter is more subjected to flaws. Furthermore, the networks’ topology often changes, leading to a variability in quality of coverage in the targeted area. Diagnostics at the sink level must take into consideration that both the number and the quality of the provided features are not constant, and that some politics like scheduling or data aggregation may be developed across the network. The aim of this article is (1) to show that random forests are relevant in this context, due to their flexibility and robustness, and (2) to provide first examples of use of this method for diagnostics based on data provided by a wireless sensor network.","authors":["Wiem Elghazel","Jacques M. Bahi","Ahmad Farhat","Christophe Guyeux"],"meta":["March 2015IEEE Aerospace Conference Proceedings 2015","DOI:10.1109/AERO.2015.7119275","Conference: IEEE Aerospace ConferenceAt: Big Sky, Montana, USAVolume: 36"],"references":["224229255_Nonlinear_Relation_Mining_for_Maintenance_Prediction","278058858_Diversity_and_Integration_of_Rotating_Machine_Health_Monitoring_Methods","259518756_An_integrated_framework_for_online_diagnostic_and_prognostic_health_monitoring_using_a_multistate_deterioration_process","258304769_Machine_Learning_Volume_45_Number_1_-_SpringerLink","248256880_Using_Adaptive_Bagging_to_Debias_Regressions","244498683_Experiment_With_a_New_Boosting_Algorithm","226270700_Bagging_Predictors","222676613_Challenges_in_the_Industrial_Applications_of_Fault_Diagnostic_Systems","222283704_Mining_data_with_random_forests_A_survey_and_results_of_new_tests","220816134_A_Brief_Introduction_to_Boosting"]}