{"id":"279928616_Interoperability_as_a_Key_Concept_for_the_Control_and_Evolution_of_the_System_of_Systems_SoS","abstract":"A coalition of enterprises wanting to collaborate, and more generally a Collaborative Network of Organizations (CNO), can conceptually be assimilated as a System of Systems (SoS) presenting a number of characteristics to respect all over its life cycle. Interoperability is one of these characteristics (both functional and non-functional), which is from our point of view, essential in order to guarantee the control of the SoS, its behavior and the fulfillment of its mission(s). Moreover, it ensures the reaction of the SoS to deal with some risky situations and with potential local or global deficits during its functioning. In this paper, we propose to determine the relation between the current level of interoperability of the SoS and its functioning whatever may be its situation. A matrix shows how this relation evolves taking into account several characteristics of the SoS, particularly its capacity to respect interoperability requirements (Compatibility, Interoperation, Autonomy and Reversibility) and the so-called analysis perspectives of the SoS: Performance, Integrity and Stability. This relation is requested in order to permit and to guide SoS behavioral simulation currently in development. Thus, a set of indicators is derived and formalized.","authors":["Stéphane Billaud","Nicolas Daclin","Chapurlat Vincent"],"meta":["June 2015Lecture Notes in Business Information Processing 213","DOI:10.1007/978-3-662-47157-9_5","Conference: International Workshop on Enterprise Interoperability (IWEI 2015)"],"references":["265923135_The_Interoperability_Score","262331526_On_the_challenges_of_self-Adaptation_in_systems_of_systems","261178941_Collaborative_Networks_A_Mechanism_for_Enterprise_Agility_and_Resilience","242487006_Measuring_System_Interoperability_An_i-Score_Improvement","240319008_The_Levels_of_Conceptual_Interoperability_Model","237132093_System_of_Systems_Interoperability_SOSI_Final_Report","304750276_Architecting_Principles_for_Systems-of-Systems","292367591_System_of_Systems_Engineering_Innovations_for_the_21st_Century","286267792_Collaborative_Networked_Organizations_as_System_of_Systems_A_Model-Based_Engineering_Approach","264292731_Architecting_Principles_for_System_of_Systems"]}