{"id":"279957910_Sums_of_Independent_Random_Variables","abstract":"I. Probability Distributions and Characteristic Functions.- 1. Random variables and probability distributions.- 2. Characteristic functions.- 3. Inversion formulae.- 4. The convergence of sequences of distributions and characteristic functions.- 5. Supplement.- II. Infinitely Divisible Distributions.- 1. Definition and elementary properties of infinitely divisible distributions.- 2. Canonical representation of infinitely divisible characteristic functions.- 3. An auxiliary theorem.- 4. Supplement.- III. Some Inequalities for the Distribution of Sums of Independent Random Variables.- 1. Concentration functions.- 2. Inequalities for the concentration functions of sums of independent random variables.- 3. Inequalities for the distribution of the maximum of sums of independent random variables.- 4. Exponential estimates for the distributions of sums of independent random variables.- 5. Supplement.- IV. Theorems on Convergence to Infinitely Divisible Distributions.- 1. Infinitely divisible distributions as limits of the distributions of sums of independent random variables.- 2. Conditions for convergence to a given infinitely divisible distribution.- 3. Limit distributions of class L and stable distributions.- 4. The central limit theorem.- 5. Supplement.- V. Estimates of the Distance Between the Distribution of a Sum of Independent Random Variables and the Normal Distribution.- 1. Estimating the nearness of functions of bounded variation by the nearness of their Fourier-Stieltjes transforms.- 2. The Esseen and Berry-Esseen inequalities.- 3. Generalizations of Esseen's inequality.- 4. Non-uniform estimates.- 5. Supplement.- VI. Asymptotic Expansions in the Central Limit Theorem.- 1. Formal construction of the expansions.- 2 Auxiliary propositions.- 3. Asymptotic expansions of the distribution function of a sum of independent identically distributed random variables.- 4. Asymptotic expansions of the distribution function of a sum of independent non-identically distributed random variables, and of the derivatives of this function.- 5. Supplement.- VII. Local Limit Theorems.- 1. Local limit theorems for lattice distributions.- 2. Local limit theorems for densities.- 3. Asymptotic expansions in local limit theorems.- 4. Supplement.- VIII. Probabilities of Large Deviations.- 1. Introduction.- 2. Asymptotic relations connected with Cramer's series.- 3. Necessary and sufficient conditions for normal convergence in power zones.- 4. Supplement.- IX. Laws of Large Numbers.- 1. The weak law of large numbers.- 2. Convergence of series of independent random variables.- 3. The strong law of large numbers.- 4. Convergence rates in the laws of large numbers.- 5. Supplement.- X. The Law of the Iterated Logarithm.- 1. Kolmogorov's theorem.- 2. Generalization of Kolmogorov's theorem.- 3. The central limit theorem and the law of the iterated logarithm.- 4. Supplement.- Notes on Sources in the Literature.- References.- Subject Indes.- Table of Symbols and Abbreviations.","authors":["Valentin V. Petrov"],"meta":["January 1975","DOI:10.1007/978-3-642-65809-9","ISBN: 978-3-642-65811-2"],"references":["38366630_Some_Approximations_to_the_Binomial_Distribution_Function"]}