{"id":"279997528_Addressing_the_Challenges_of_Requirements_Ambiguity_A_Review_of_Empirical_Literature","abstract":"Ambiguity in natural language requirements has long been recognized as an inevitable challenge in requirements engineering (RE). Various initiatives have been taken by RE researchers to address the challenges of ambiguity. In this paper the results of a mapping study are presented that focus on the application of Natural Language Processing (NLP) techniques for addressing ambiguity in requirements. Systematic review of the literature resulted in 174 studies on the subject published during 1995 to 2015, and out of these only 28 are empirically evaluated studies that were selected. From of the resulting set of papers, 81% have focused on detecting ambiguity; whereas 4% and 5% are focusing on reducing and removing ambiguity respectively. Addressing syntactic, semantic, and lexical ambiguities has attracted more attention than other types. In spite of all the research efforts, there is a lack of empirical evaluation of NLP tools and techniques for addressing ambiguity in requirements. The results have pointed out some gaps in empirical results and have raised questions the designing of an analytical framework for research in this field.","authors":["Muneera Bano"],"meta":["August 2015","DOI:10.13140/RG.2.1.3110.7681","Conference: 5th International Workshop on Empirical Requirements Engineering (EmpiRE 2015), August 24, 2015, Ottawa, ON, Canada"],"references":["302924724_Guidelines_for_performing_Systematic_Literature_Reviews_in_Software_Engineering","286669049_The_DODT_tool_applied_to_sub-sea_software","271207013_Systematic_reviews_in_requirements_engineering_A_tertiary_study","265467851_Pragmatic_Ambiguity_Detection_in_Natural_Language_Requirements","336573400_Systematic_Mapping_Studies_in_Software_Engineering","317577513_Automatic_Detection_of_Nocuous_Ambiguities_in_Natural_Language_Requirements","288485563_Identifying_and_classifying_ambiguity_for_regulatory_requirements","283114592_Documenting_requirements_specifications_using_natural_language_requirements_boilerplates","278700228_Engineering_and_Managing_Software_Requirements","262361878_The_Design_of_SREE_-_A_Prototype_Potential_Ambiguity_Finder_for_Requirements_Specifications_and_Lessons_Learned"]}