{"id":"279968595_Measuring_centrality_by_a_generalization_of_degree","abstract":"Network analysis has emerged as a key technique in communication studies,\neconomics, geography, history and sociology, among others. A fundamental issue\nis how to identify key nodes in a network, for which purpose a number of\ncentrality measures have been developed. This paper proposes a new parametric\nfamily of centrality measures called generalized degree. It is based on the\nidea that a relationship to a more interconnected node contributes to\ncentrality in a greater extent than a connection to a less central one.\nGeneralized degree improves on degree by redistributing its sum over the\nnetwork with the consideration of the global structure. Application of the\nmeasure is supported by a set of basic properties. A sufficient condition is\ngiven for generalized degree to be rank monotonic, excluding counter-intuitive\nchanges in the centrality ranking after certain modifications of the network.\nThe measure has a graph interpretation and can be calculated iteratively.\nGeneralized degree is recommended to apply besides degree since it preserves\nmost favorable attributes of degree, but better reflects the role of the nodes\nin the network and has an increased ability to distinguish between their\nimportance.","authors":["Laszlo Csato"],"meta":["December 2017Central European Journal of Operations Research 25(4)","DOI:10.1007/s10100-016-0439-6","SourcearXiv"],"references":["331307250_Social_and_Economic_Networks","300635219_Beta_Current_Flow_Centrality_for_Weighted_Networks","284096539_Axioms_for_centrality_scoring_with_principal_eigenvectors","271110864_A_graph_interpretation_of_the_least_squares_ranking_method","316727874_Local_and_consistent_centrality_measures_in_parameterized_networks","304374264_Centrality_in_social_networks_Conceptual_clarification","275967437_Matrix_Analysis_and_Applied_Linear_Algebra","275967213_Matrix_Analysis_and_Applied_Linear_Algebra_Book_and_Solutions_Manual","271526599_Uber_die_Abgrenzung_der_Eigenwerte_einer_Matrix","268308623_Matrix_analysis_and_applied_linear_algebra_incl_CD-ROM_and_solutions_manual"]}