{"id":"279961699_Numerical_calculation_of_listener-specific_head-related_transfer_functions_and_sound_localization_Microphone_model_and_mesh_discretization","abstract":"Head-related transfer functions (HRTFs) can be numerically calculated by applying the boundary element method on the geometry of a listener&apos;s head and pinnae. The calculation results are defined by geometrical, numerical, and acoustical parameters like the microphone used in acoustic measurements. The scope of this study was to estimate requirements on the size and position of the microphone\nmodel and on the discretization of the boundary geometry as triangular polygon mesh for accurate sound localization. The evaluation involved the analysis of localization errors predicted by a sagittal-plane localization model, the comparison of equivalent head radii estimated by a time-of-arrival model, and the analysis of actual localization errors obtained in a sound-localization experiment. While the average edge length (AEL) of the mesh had a negligible effect on localization performance in the lateral dimension, the localization performance in sagittal planes, however, degraded for larger AELs with the geometrical error as dominant factor. A microphone position at an arbitrary position at the entrance of the ear canal, a microphone size of 1 mm radius, and a mesh with 1 mm AEL yielded a localization performance similar to or better than observed with acoustically measured HRTFs.","authors":["Harald Ziegelwanger","Piotr Majdak","Wolfgang Kreuzer"],"meta":["July 2015The Journal of the Acoustical Society of America 138(1):208-222","DOI:10.1121/1.4922518"],"references":["262226422_Estimation_of_the_low-frequency_components_of_the_head-related_transfer_functions_of_animals_from_photographs","262055754_Acoustic_and_non-acoustic_factors_in_modeling_listener-specific_performance_of_sagittal-plane_sound_localization","260643922_Modeling_the_direction-continuous_time-of-arrival_in_head-related_transfer_functions","298090215_Contribution_of_spectral_cues_to_human_sound_localization","295103061_Calculation_of_listener-specific_head-related_transfer_functions_Effect_of_mesh_quality","279713719_Head-related_transfer_functions_of_human_subjects","272385687_Inter-Laboratory_Round_Robin_HRTF_Measurement_Comparison","266985068_A_formulation_of_the_fast_multipole_boundary_element_method_FMBEM_for_acoustic_radiation_and_scattering_from_three-dimensional_structures","262928627_A_comparative_study_of_Interaural_Time_Delay_estimation_methods","261262808_Evaluation_of_Methods_for_Optical_3-D_Scanning_of_Human_Pinnas"]}