{"id":"279907795_Face-to-Face_Versus_Threaded_Discussions_The_Role_of_Time_and_Higher-Order_Thinking","abstract":"This study compares the experiences of students in face-to-face (in class) discussions with threaded discussions and also evaluates the threaded discussions for evidence of higher-order thinking. Students were enrolled in graduate-level classes that used both modes (face-to-face and online) for course-related discussions; their end-of-course evaluations of both experiences were grouped for analysis and themes constructed based on their comments. Themes included the \"expansion of time,\" \"experience of time,\" \"quality of the discussion,\" \"needs of the student,\" and \"faculty expertise.\" While there are advantages to holding discussions in either setting, students most frequently noted that using threaded discussions increased the amount of time they spent on class objectives and that they appreciated the extra time for reflection on course issues. The face-to-face format also had value as a result of its immediacy and energy, and some students found one mode a better \"fit\" with their preferred learning mode. The analysis of higher-order thinking was based on a content analysis of the threaded discussions only. Each posting was coded as one of the four cognitive-processing categories described by Garrison and colleagues [1]: 18% were triggering questions, 51% were exploration, 22% were integration, and 7% resolution. A fifth category - social - was appropriate for 3% of the responses and only 12% of the postings included a writing error. This framework provides some support for the assertion that higher-order thinking can and does occur in online discussions; strategies for increasing the number of responses in the integration and resolution categories are discussed.","authors":["Katrina Meyer"],"meta":["September 2003Journal of Asynchronous Learning Network 7(3):55-65","DOI:10.24059/olj.v7i3.1845"],"references":["323471497_Integrating_the_Web_and_the_teaching_of_technology_Cases_across_two_universities","249728401_How_Instructor_Immediacy_Behaviors_Affect_Student_Satisfaction_and_Learning_in_Web-Based_Courses","245816834_Critical_Thinking_Cognitive_Presence_and_Computer_Conferencing_in_Distance_Education","228766210_Beyond_Student_Perceptions_Issues_of_Interaction_Presence_and_Performance_in_an_Online_Course","228714854_Exploring_collaborative_online_learning","324365629_Metaphors_We_Live_by","267398234_A_content_analysis_method_to_measure_critical_thinking_in_face-to-face_and_computer_supported_group_learning_A_content_analysis_method_to_measure_critical_thinking_in_face-to-face_and_computer_support","243771266_Building_Learning_Communities_in_Cyberspace","238996863_Software_Design_and_the_Future_of_the_Virtual_ClassroomR","238746274_Lessons_from_the_Cyberspace_Classroom_The_Realities_of_Online_Teaching","238396929_Social_Presence_as_a_Predictor_of_Satisfaction_Within_a_Computer-Mediated_Conferencing_Environment","228605892_Online_Education_to_Develop_Complex_Reasoning_Skills_in_Organic_Chemistry","228590396_How_do_online_students_differ_from_lecture_students","220468700_Small_Pieces_Loosely_Joined_A_Unified_Theory_of_the_Web"]}