{"id":"279936430_Learning_Basic_Programming_Concepts_By_Creating_Games_With_Scratch_Programming_Environment","abstract":"A number of researchers have documented several difficulties faced by learners of basic programming concepts. Among the suggested pedagogical solutions to overcome these difficulties is the use of serious games inthe learning process. In fact, these games are more likely to boost the motivation of students and allow them to develop their knowledge efficiently. Our studyfocuses on evaluating such usage and the resulting students’ motivation towards programming. We’ve made students create simple games using the Scratch game environment in order for them to learn programming basics. The experiment was conducted with a group of 69 high school science major students. This group of students was arbitrarily chosen and divided into three sub-groups. With the first sub-groupwe experimented with our pedagogical method based on the creation of simple games using Scratch environment. With the other sub-groups we used a conventional method based on Pascal programming language. Twosurveys were distributed at the beginning and at the end of the experimentation in order to identify the programming level of students, their gaming habits, their motivation and interest for programming in the future. The analysis of the surveysshows that using an environment for learning programming such as Scratch highly motivate students and empower them to pursue their studies in programming. In fact, when learners were asked about their desire to continue their studies in programming, 65% of students who have experienced with Scratch environment consider continuing their studies in programming whereas only 10.3% of students who used a standard programming environment showed some interest.","authors":["Ibrahim Ouahbi","Fatiha Kaddari","Hassane Darhmaoui","Abdelrhani Elachqar"],"meta":["June 2015Procedia - Social and Behavioral Sciences 191:1479-1482","DOI:10.1016/j.sbspro.2015.04.224"],"references":["246829736_Minds_in_Play_Computer_Game_Design_As_A_Context_for_Children's_Learning","228659969_Experimental_evaluation_of_teaching_recursion_in_a_video_game","221538859_Exploring_Factors_that_Influence_Computer_Science_Introductory_Course_Students_to_Persist_in_the_Major","221514864_Storytelling_Alice_motivates_middle_school_girls_to_learn_computer_programming","277773347_Using_Scratch_as_game-based_learning_tool_to_reduce_learning_anxiety_in_programming_course","277374591_Lowering_the_barriers_to_programming","248642237_On_Novice_Loop_Boundaries_and_Range_Conceptions","238113555_Developing_games_and_simulations_for_today_and_tomorrow's_tech_savvy_youth","230785193_Observations_on_student_misconceptions_--_A_case_study_of_the_Build-Heap_Algorithm","228414070_Expressing_computer_science_concepts_through_Kodu_game_lab"]}