{"id":"279999016_Current_issues_and_open_questions_in_cognitive_load_research","abstract":"The previous chapters have outlined the theoretical background, basic assumptions, and some key applications of Cognitive Load Theory (CLT) in its current state of development. The fundamental idea underlying CLT is that instructional design decisions should be informed by the architecture of the human cognitive system. CLT can therefore be described as a cognitive theory of instructional design. CLT has been very influential in educational research since the 1980s. It has inspired a growing number of research studies aimed at deriving empirically based guidelines for instructional design. Moreover, at its present stage of development, CLT is arguably one of the most influential instructional design theories. However, the extant research on cognitive load raises questions about the assumptions underlying CLT, some of which have not been consistently supported by the empirical data, suggesting the need to update the theory by incorporating recent empirical findings on cognition and learning (Schnotz & Kirschner, 2007). The first goal of this chapter is to summarize the theoretical developments of CLT and highlight some of its strengths and limitations. An additional contribution of CLT research includes efforts to develop practical, valid, and reliable measures of its main construct: cognitive load. However, as suggested in Chapter 9, the existing body of cognitive load research fails to exhibit methodological consistency regarding cognitive load measurement and lacks appropriate methods to measure other relevant constructs, such as the different load types proposed by the theory (DeLeeuw & Mayer, 2008).","authors":["Roland Brünken","Jan L. Plass","R. Moreno"],"meta":["January 2010","DOI:10.1017/CBO9780511844744.014","Project: Rethinking Cognitive Load Theory"],"references":["220473914_Design_Factors_for_Effective_Science_Simulations_Representation_of_Information","289797413_Guiding_Students'_Attention_During_Example_Study_by_Showing_the_Model's_Eye_Movements","249860878_When_worked_examples_don't_work_Is_cognitive_load_theory_at_an_Impasse","237932510_Lernen_mit_Texten_und_Bildern_Der_Anteil_akustisch-sensorischer_Information_am_Zustandekommen_des_Modalitatseffekts","233031254_Learning_from_animated_classroom_exemplars_The_case_for_guiding_student_teachers'_observations_with_metacognitive_prompts","225880184_The_function_of_annotations_in_the_comprehension_of_scientific_texts_Cognitive_load_effects_and_the_impact_of_verbal_ability","223327278_The_impact_of_intrinsic_cognitive_load_on_the_effectiveness_of_graphical_help_for_coherence_formation"]}