{"id":"280060455_Attitude_of_Ayurveda_doctors_toward_the_impact_of_health_information_technology","abstract":"Health information technology (HIT) equips healthcare professionals with the required information and tools for making quality decisions in patient care, but it is always advisable to assess their attitude before its actual implementation.\nTo assess the attitude of Ayurvedic doctors toward the impact of HIT.\nA cross-sectional survey was carried out among 140 doctors of an Ayurvedic center of Southern India. A validated questionnaire consisting of 18 questions based on a 5-point Likert scale was administered to the participants after receiving their due consent.\nAbout 75-80% of the respondents concurred that the HIT application, such as electronic health record, has the potentials to reduce the duplication of documentation work, is easy and has an instant processing and real-time access to patient information. They also felt the need of such application to report the patient data to local and national health institutions. A total of 85% of them mentioned that these applications can make the collection and accessibility of patient data much easier compared with paper-based records, whereas 87.4% of them claimed telemedicine as a platform for multidisciplinary collaborative research and patient care.\nEven though most of the respondents agreed about the role of HIT in improving the quality of health care, there were many who held no opinion about HIT, including privacy and security of patient data. The need of proper awareness and training program is identified to make them aware about the HIT and its application in patient care, education and research.","authors":["Rajesh Kumar Sinha","Soumya R Shetty"],"meta":["April 2015Journal of Ayurveda and integrative medicine 6(2):89-94","DOI:10.4103/0975-9476.146559","SourcePubMed"],"references":["269886551_Ayur_informatics_Need_of_the_hour","49769650_The_Impact_of_Health_Information_Technology_on_Work_Process_and_Patient_Care_in_Labor_and_Delivery","24248240_The_Effect_of_Computerized_Physician_Order_Entry_on_Medication_Prescription_Errors_and_Clinical_Outcome_in_Pediatric_and_Intensive_Care_A_Systematic_Review","313309267_Telemedicine_versus_face_to_face_patient_care_effects_on_professional_practice_and_health_care_outcomes","299290252_Improving_Health_Connecting_People_The_Role_of_ICTs_in_the_Health_Sector_of_Developing_Countries_-_A_Framework_Paper","265526629_Role_of_Information_Technology_in_Ayurveda_in_the_Digital_Age","251233055_Telemedicine_patient_demand_cost_containment_drive_growth_Joining_the_trend_may_not_be_as_expensive_or_time-consuming_as_you_think_experts_say","242484029_Health_Information_Technology_Benefits_and_Problems","50304505_The_Benefits_Of_Health_Information_Technology_A_Review_Of_The_Recent_Literature_Shows_Predominantly_Positive_Results","24355592_The_Impact_of_Computerized_Provider_Order_Entry_Systems_on_Inpatient_Clinical_Workflow_A_Literature_Review"]}