{"id":"280070019_Analyzing_Industrial_Architectural_Models_by_Simulation_and_Model-Checking","abstract":"The software architecture of any automotive system has to be decided well in advance of production, so it is very desirable to assess its quality in order to obtain quick indications of errors at early design phases. In this paper, we present a constellation of analysis techniques for architectural models described in EAST-ADL. The methods are complementary in terms of covering EAST-ADL model analysis against a rich set of requirements, and in terms of the varying degree of confidence in the provided guarantees. Based on the needs of the current modeldriven development in a chosen automotive context, we propose three analysis techniques of EAST-ADL architectural models, in an attempt to tackle some of the exposed design needs: simulation of EAST-ADL functions in Simulink, model-checking EAST-ADL models with timed automata semantics, and statistical model-checking in UPPAAL, applied on an automatically generated network of timed automata. An industrial Brake-by-Wire prototype is the case study on which we show the potential of simulating EAST-ADL models in Simulink, model-checking downscale EAST-ADL models, as well statistical model-checking of full model versions, in order to tame verification scalability problems","authors":["Raluca Marinescu","Henrik Kaijser","Marius Mikučionis","Cristina Cerschi Seceleanu"],"meta":["April 2015Communications in Computer and Information Science 476:189-205","DOI:10.1007/978-3-319-17581-2_13","Conference: International Workshop on Formal Techniques for Safety-Critical Systems"],"references":["290850088_On_Integrating_EAST-ADL_and_UPPAAL_for_Embedded_System_Architecture_Verification","273617611_A_methodology_for_formal_analysis_and_verification_of_EAST-ADL_models","273313894_A_Model-Based_Testing_Framework_for_Automotive_Embedded_Systems","261039301_ViTAL_A_Verification_Tool_for_EAST-ADL_Models_using_UPPAAL_PORT","339482230_ViTAL_A_Verification_Tool_for_EAST-ADL_Models_Using_UPPAAL_PORT","325892501_EAST-ADL_An_architecture_description_language_for_automotive_software-intensive_systems","262238357_Schedulability_of_Herschel-Planck_Revisited_Using_Statistical_Model_Checking","255700176_EAST-ADL_An_Architecture_Description_Language_for_Automotive_Software-Intensive_Systems","236157223_A_Tutorial_on_Uppaal_40","227075945_Timed_Automata"]}