{"id":"280015375_ABSORBING_AND_ERGODIC_DISCRETIZED_TWO-ACTION_LEARNING_AUTOMATA","abstract":"A learning automaton is a machine that interacts with a random environment and that simultaneously learns the optimal action that the environment offers to it. Learning automata with variable structure are considered. Such automata are completely defined by a set of probability updating rules. Contrary to all the variable-structure stochastic automata (VSSA) discussed in the literature, which update the probabilities in such a way that an action probability can take any real value in the interval left bracket 0,1 right bracket , the probability space is discretized so as to permit the action probability to assume one of a finite number of distinct values in left bracket 0,1 right bracket . The discretized automaton is termed linear or nonlinear depending on whether the subintervals of left bracket 0,1 right bracket are of equal length. It is proven that 1) discretized two-action linear reward-inaction automata are absorbing and epsilon -optimal in all environments; 2) discretized two-action linear inaction-penalty automata are ergodic and expedient in all environments; 3) discretized two-action linear inaction-penalty learning automata with artificially created absorbing barriers are epsilon -optimal in all random environments; and 4) there exist nonlinear discretized reward-inaction automata that are epsilon -optimal in all random environments. The maximum advantage gained by rendering any finite-state discretized automaton nonlinear has also been derived.","authors":["B.John Oommen"],"meta":["March 1986IEEE Transactions on Systems Man and Cybernetics 16(2):282-293"],"references":["285301892_Finite_learning_automata","264581646_Learning_Automata_Processing_Ergodicity_of_the_Mean_The_Two-Action_Case","247580895_Some_Classes_of_Multi-Input_Automata","38364489_Learning_with_Finite_Memory","3115834_Application_of_Learning_Automata_to_Telephone_Traffic_Routing_and_Control","3114976_On_the_Behavior_of_a_Learning_Automaton_in_a_Changing_Environment_with_Application_to_Telephone_Traffic_Routing"]}