{"id":"280042537_Retinal_Vasculature_Segmentation_in_Smartphone_Ophthalmoscope_Images","abstract":"Retinal imaging system assists ophthalmologists to diagnose the diseases and to monitor the treatment processes. Conventionally, fundus retinal images are obtained from expensive systems like fluorescein angiography and fundus photography but these systems are large tabletop units and can only be handled by trained technicians. Hence, this study reports a low cost, compact and user friendly smartphone oph-thalmoscope to perform indirect ophthalmoscopy. By using this system, initial and periodic screening of retina (both center and periphery regions) becomes easier. Traditionally, reti-nal diseases are diagnosed by manual observations of images and it is a time consuming process. So, automatic retinal disease diagnosing systems are introduced by extracting the essential features of the retina. One of the essential features of the retina is the blood vessels as its morphological changes helps in diagnosing the retinal diseases like diabetic retinopa-thy. Hence, in this study blood vessels are extracted from smartphone ophthalmoscope (SO) images to develop an automatic retinal disease analysing systems for ophthalmologists. The image acquired from this system contains unwanted information and it is removed by using k-means algorithm. The resulting images might be affected by noises and it is removed by using total variation filtering technique. Filtered image is then enhanced to detect the blood vessels by applying the bottom hat morphological transformation. Finally, the enhanced images are used to segment the blood vessels using level set method. The performance of the retinal vasculature segmenta-tion algorithm is compared and analyzed on DRIVE database of retinal images and on smartphone retinal images using the measures like sensitivity, specificity and accuracy level.","authors":["S Saranya","K I Ramachandran","Dr Ashish Sharma"],"meta":["July 2015","DOI:10.1007/978-3-319-19452-3_18","Conference: 7th WACBE World Congress on BioengineeringAt: Sungapore","Project: Recent Innovations in Ophthalmology (Book)"],"references":["269910617_3D_Printed_Smartphone_Indirect_Lens_Adapter_for_Rapid_High_Quality_Retinal_Imaging","258148408_Simple_Inexpensive_Technique_for_High-Quality_Smartphone_Fundus_Photography_in_Human_and_Animal_Eyes","228340127_Analysis_of_Foveal_Avascular_Zone_in_Color_Fundus_Image_for_Grading_of_Diabetic_Retinopathy","269176435_Comparison_of_Smartphone_Ophthalmoscopy_With_Slit-Lamp_Biomicroscopy_for_Grading_Diabetic_Retinopathy","237020528_Infected_Fruit_Part_Detection_using_K-Means_Clustering_Segmentation_Technique","224641355_Total_Variation-Based_Image_Deconvolution_a_Majorization-Minimization_Approach","220502157_Active_Contours_without_Edges","5601946_Active_Contour_Without_Edges"]}