{"id":"280124452_The_Contribution_of_Missense_Mutations_in_Core_and_Rim_Residues_of_Protein-Protein_Interfaces_to_Human_Disease","abstract":"Missense mutations at protein-protein interaction (PPIs) sites, called interfaces, are important contributors to human disease. Interfaces are non-uniform surface areas characterized by two main regions, 'core' and 'rim', which differ in terms of evolutionary conservation and physico-chemical properties. Moreover, within interfaces, only a small subset of residues ('hot spots') is crucial for the binding free energy of the protein-protein complex. We performed a large-scale structural analysis of human single amino acid variations (SAVs) and demonstrated that disease-causing mutations are preferentially located within the interface core, as opposed to the rim (p< 0.01). In contrast, the interface rim is significantly enriched in polymorphisms, similar to the remaining non-interacting surface. Energetic hot spots tend to be enriched in disease-causing mutations compared to non-hot spots (p=0.05), regardless of their occurrence in core or rim residues. For individual amino acids, the frequency of substitution into a polymorphism or disease-causing mutation differed to other amino acids and was related to its structural location, as was the type of physico-chemical change introduced by the SAV. In conclusion, this study demonstrated the different distribution and properties of disease-causing SAVs and polymorphisms within different structural regions and in relation to the energetic contribution of amino acid in protein-protein interfaces, thus highlighting the importance of a structural system biology approach for predicting the effect of SAVs.\nCopyright © 2015. Published by Elsevier Ltd.","authors":["Alessia David","Michael J.E. Sternberg"],"meta":["July 2015Journal of Molecular Biology 427(17)","DOI:10.1016/j.jmb.2015.07.004","SourcePubMed"],"references":["277524691_Identification_of_mutations_associated_with_peroxisome-to-mitochondrion_mistargeting_of_alanineglyoxylate_aminotransferase_in_primary_hyperoxaluria_type_1","263810282_Activities_at_the_Universal_Protein_Resource_UniProt","262191106_SuSPect_Enhanced_Prediction_of_Single_Amino_Acid_Variant_SAV_Phenotype_Using_Network_Features","260365864_Activities_at_the_Universal_Protein_Resource_UniProt","259879409_Deriving_a_Mutation_Index_of_Carcinogenicity_Using_Protein_Structure_and_Protein_Interfaces","283409225_Basic_principles_of_protein-protein_interaction_chapter_1","281594915_The_UniProt_Consortium_Activities_at_the_Universal_Protein_Resource_UniProt","272423587_On_Human_Disease-Causing_Amino_Acid_Variants_Statistical_Study_of_Sequence_and_Structural_Patterns","272077114_Structural_and_Physico-Chemical_Effects_of_Disease_and_Non-Disease_nsSNPs_on_Proteins","260608538_Elucidating_Common_Structural_Features_of_Human_Pathogenic_Variations_Using_Large-Scale_Atomic-Resolution_Protein_Networks"]}