{"id":"280123664_Automatic_classification_of_diseases_from_free-text_death_certificates_for_real-time_surveillance","abstract":"Death certificates provide an invaluable source for mortality statistics which can be used for surveillance and early warnings of increases in disease activity and to support the development and monitoring of prevention or response strategies. However, their value can be realised only if accurate, quantitative data can be extracted from death certificates, an aim hampered by both the volume and variable nature of certificates written in natural language. This study aims to develop a set of machine learning and rule-based methods to automatically classify death certificates according to four high impact diseases of interest: diabetes, influenza, pneumonia and HIV.\nTwo classification methods are presented: i) a machine learning approach, where detailed features (terms, term n-grams and SNOMED CT concepts) are extracted from death certificates and used to train a set of supervised machine learning models (Support Vector Machines); and ii) a set of keyword-matching rules. These methods were used to identify the presence of diabetes, influenza, pneumonia and HIV in a death certificate. An empirical evaluation was conducted using 340,142 death certificates, divided between training and test sets, covering deaths from 2000-2007 in New South Wales, Australia. Precision and recall (positive predictive value and sensitivity) were used as evaluation measures, with F-measure providing a single, overall measure of effectiveness. A detailed error analysis was performed on classification errors.\nClassification of diabetes, influenza, pneumonia and HIV was highly accurate (F-measure 0.96). More fine-grained ICD-10 classification effectiveness was more variable but still high (F-measure 0.80). The error analysis revealed that word variations as well as certain word combinations adversely affected classification. In addition, anomalies in the ground truth likely led to an underestimation of the effectiveness.\nThe high accuracy and low cost of the classification methods allow for an effective means for automatic and real-time surveillance of diabetes, influenza, pneumonia and HIV deaths. In addition, the methods are generally applicable to other diseases of interest and to other sources of medical free-text besides death certificates.","authors":["Bevan Koopman","Sarvnaz Karimi","Anthony Nguyen","Rhydwyn Mcguire"],"meta":["July 2015BMC Medical Informatics and Decision Making 15(1):53","DOI:10.1186/s12911-015-0174-2","SourcePubMed","Project: Automatic classification of diseases from free-text death certificates for real-time surveillance"],"references":["265970854_Accuracy_of_automatic_syndromic_classification_of_coded_emergency_department_diagnoses_in_identifying_mental_health-related_presentations_for_public_health_surveillance","237071357_Classification_of_Cancer-related_Death_Certificates_using_Machine_Learning","224925063_Identification_of_pneumonia_and_influenza_deaths_using_the_Death_Certificate_Pipeline","220017784_Data_Mining_Practical_Machine_Learning_Tools_and_Techniques","51813567_Public_Health_Surveillance_and_Knowing_About_Health_in_the_Context_of_Growing_Sources_of_Health_Data","24305429_Prospective_surveillance_of_excess_mortality_due_to_influenza_in_New_South_Wales_feasibility_and_statistical_approach","322715583_Data_Mining_practical_machine_learning_tools_and_techniques","321053786_CLASSIFICATION_OF_CANCER-RELATED_DEATH_CERTIFICATES_USING_MACHINE_LEARNING","221900847_Data_Mining_Practical_Machine_Learning_Tools_And_Techniques","51621500_Automatic_extraction_of_cancer_characteristics_from_free-text_pathology_reports_for_cancer_notifications"]}