{"id":"280144622_Scrum_in_software_engineering_courses_An_outline_of_the_literature","abstract":"This paper provides an outline of existing literature dealing with teaching Scrum in software engineering courses. The search of studies in the Scopus database revealed 23 papers that were identified as primary studies relevant to our research. These studies are classified by their main topic and their main results are presented. All studies stress that the teaching of Scrum should not be limited to traditional lectures, but some practical experience should be provided in order to strengthen comprehension and achieve deep learning. For this reason, the use of Scrum in capstone (or similar) projects requiring students to work in teams is the most widely adopted strategy, described in 7 studies. Four studies describe the use of simulation games as an alternative to practical project work (and even traditional lectures). Teaching Scrum through a capstone course provides a suitable environment for in-depth analyses of students’ perceptions of typical Scrum practices (discussed in 4 studies), but also opens some pedagogical issues, such as the assessment of individual performance and consideration of students’ learning styles (3 studies). The remaining studies describe general experience and recommendations, the development of teaching aids, and the combination of Scrum with other process models.","authors":["Viljan Mahnic"],"meta":["January 2015Global Journal of Engineering Education 17(2):77-83"],"references":["312470401_Learningteaching_styles_in_engineering_education","302924724_Guidelines_for_performing_Systematic_Literature_Reviews_in_Software_Engineering","266656779_Teaching_students_scrum_using_LEGO_blocks","263503966_Quantitative_Assessment_with_Using_Ticket_Driven_Development_for_Teaching_Scrum_Framework","344540526_Working_Towards_the_Student_Scrum_Developing_Agile_Android_Applications","282723956_Assessing_teamwork_in_a_software_engineering_capstone_course","279312471_Plasticine_Scrum_An_Alternative_Solution_for_Simulating_Scrum_Software_Development","277534606_SCRUMIA-An_educational_game_for_teaching_SCRUM_in_computing_courses","266307326_Teaching_User_Stories_within_the_Scope_of_a_Software_Engineering_Capstone_Course_Analysis_of_Students'_Opinions","261563462_Are_learning_styles_useful_indicators_to_discover_how_students_use_Scrum_for_the_first_time"]}