{"id":"280104852_Multi-degree_Bounds_on_the_Betti_Numbers_of_Real_Varieties_and_Semi-algebraic_Sets_and_Applications","abstract":"We prove new bounds on the Betti numbers of real varieties and semi-algebraic\nsets that have a more refined dependence on the degrees of the polynomials\ndefining them than results known before. Our method also unifies several\ndifferent types of results under a single framework, such as bounds depending\non the total degrees, on multi-degrees, as well as in the case of quadratic and\npartially quadratic polynomials. The bounds we present in the case of partially\nquadratic polynomials offer a significant improvement over what was previously\nknown, particularly in the case when the description of the set is given by\nboth polynomials with bounded total degree and others that are partially\nquadratic.\nWe give several applications of our results, including a generalization of\nthe polynomial partitioning theorem due to Guth and Katz, which has become a\nvery important tool in discrete geometry in the multi-degree setting, and give\nan application of this result proving a theorem that interpolates between two\ndifferent kinds of partitions of the plane. This result has potential\napplication in discrete geometry.\nFinally, we extend a result of Basu and Barone on bounding the number of\nconnected components of real varieties defined by two polynomials of differing\ndegrees to the sum of all Betti numbers, thus making progress on an open\nproblem posed in their paper -- on extending their bounds on the number of\nconnected components to higher Betti numbers as well.","authors":["Saugata Basu","Anthony Rizzie"],"meta":["April 2018Discrete & Computational Geometry 59(2)","DOI:10.1007/s00454-017-9944-1","SourcearXiv"],"references":["284078433_Polynomial_Partitioning_on_Varieties_of_Codimension_Two_and_Point-Hypersurface_Incidences_in_Four_Dimensions","344884188_Sur_L'Homologie_des_Varietes_Algebriques_Reelles","344473437_On_the_Betti_numbers_of_sign_conditions","329527804_3264_and_all_that_A_second_course_in_algebraic_geometry","321516067_Algorithms_in_Real_Algebraic_Geometry","314747369_Improved_bounds_for_incidences_between_points_and_circles","290161446_Homology_of_intersections_of_real_quadrics'_Sov_Math_Dokl_37_1988_493-496_translated_in_Sov","285306634_Newton_polyhedra_and_Bezout's_theorem","268715685_Introduction_to_Homotopy_Theory","267671020_Geometrie_algebrique_reelle_Real_algebraic_geometry","265373640_Betti_Numbers_of_Semialgebraic_and_Sub-Pfaffian_Sets","267662666_Computation_of_the_Euler_characteristic_of_intersections_of_real_quadrics","266003854_Sur_l'homologie_des_varietes_algebriques_reelles","265511949_Deciding_positivity_of_multisymmetric_polynomials","265386006_Algorithms_in_Real_Algebraic_Geometry_A_Survey"]}