{"id":"280104674_Energy_Efficient_Mobile_Cloud_Computing_Powered_by_Wireless_Energy_Transfer","abstract":"Achieving long battery lives or even self sustainability has been a long\nstanding challenge for designing mobile devices. This paper presents a novel\nsolution that seamlessly integrates two technologies, mobile cloud computing\nand microwave power transfer (MPT), to enable computation in passive\nlow-complexity devices such as sensors and wearable computing devices.\nSpecifically, considering a single-user system, a base station (BS) either\ntransfers power to or offloads computation from a mobile to the cloud; the\nmobile uses harvested energy to compute given data either locally or by\noffloading. A framework for energy efficient computing is proposed that\ncomprises a set of policies for controlling CPU cycles for the mode of local\ncomputing, time division between MPT and offloading for the other mode of\noffloading, and mode selection. Given the CPU-cycle statistics information and\nchannel state information (CSI), the policies aim at maximizing the probability\nof successfully computing given data, called computing probability, under the\nenergy harvesting and deadline constraints. The policy optimization is\ntranslated into the equivalent problems of minimizing the mobile energy\nconsumption for local computing and maximizing the mobile energy savings for\noffloading which are solved using convex optimization theory. The structures of\nthe resultant policies are characterized in closed form. Furthermore, given\nnon-causal CSI, the said analytical framework is further developed to support\ncomputation load allocation over multiple channel realizations, which further\nincreases computing probability. Last, simulation demonstrates the feasibility\nof wirelessly powered mobile cloud computing and the gain of its optimal\ncontrol.","authors":["Changsheng You","Kaibin Huang","Hyukjin Chae"],"meta":["July 2015IEEE Journal on Selected Areas in Communications 34(5)","DOI:10.1109/JSAC.2016.2545382","SourcearXiv"],"references":["272661831_Sensor_Mania_The_Internet_of_Things_Wearable_Computing_Objective_Metrics_and_the_Quantified_Self_20","266661133_COSMOS_computation_offloading_as_a_service_for_mobile_devices","264673637_Wireless_Powered_Communication_Opportunities_and_Challenges","261044991_Wireless_Information_and_Power_Transfer_Energy_Efficiency_Optimization_in_OFDMA_Systems","297816577_Cloud_computing_for_mobile_users_Can_offloading_computation_save_energy","278316240_Wireless_Power_Transfer_via_Radiowaves","273259885_Offloading_in_Mobile_Cloudlet_Systems_with_Intermittent_Connectivity","270222158_Joint_Optimization_of_Radio_and_Computational_Resources_for_Multicell_Mobile-Edge_Computing","264790612_Cutting_Last_Wires_for_Mobile_Communication_by_Microwave_Power_Transfer","260656455_Migrate_or_not_Exploiting_dynamic_task_migration_in_mobile_cloud_computing_systems","257625980_A_Survey_of_Computation_Offloading_for_Mobile_Systems","241630442_ThinkAir_Dynamic_resource_allocation_and_parallel_execution_in_the_cloud_for_mobile_code_offloading","260514005_Energy-Optimal_Mobile_Cloud_Computing_under_Stochastic_Wireless_Channel","258649127_Design_of_a_High-Efficiency_245-GHz_Rectenna_for_Low-Input-Power_Energy_Harvesting","241638737_A_Dynamic_Offloading_Algorithm_for_Mobile_Computing"]}