{"id":"280220061_The_spatial_biology_of_transcription_and_translation_in_rapidly_growing_Escherichia_coli","abstract":"Single-molecule fluorescence provides high resolution spatial distributions of ribosomes and RNA polymerase (RNAP) in live, rapidly growing E. coli. Ribosomes are more strongly segregated from the nucleoids (chromosomal DNA) than previous widefield fluorescence studies suggested. While most transcription may be co-translational, the evidence indicates that most translation occurs on free mRNA copies that have diffused from the nucleoids to a ribosome-rich region. Analysis of time-resolved images of the nucleoid spatial distribution after treatment with the transcription-halting drug rifampicin and the translation-halting drug chloramphenicol shows that both drugs cause nucleoid contraction on the 0-3 min timescale. This is consistent with the transertion hypothesis. We suggest that the longer-term (20-30 min) nucleoid expansion after Rif treatment arises from conversion of 70S-polysomes to 30S and 50S subunits, which readily penetrate the nucleoids. Monte Carlo simulations of a polymer bead model built to mimic the chromosomal DNA and ribosomes (either 70S-polysomes or 30S and 50S subunits) explain spatial segregation or mixing of ribosomes and nucleoids in terms of excluded volume and entropic effects alone. A comprehensive model of the transcription-translation-transertion system incorporates this new information about the spatial organization of the E. coli cytoplasm. We propose that transertion, which radially expands the nucleoids, is essential for recycling of 30S and 50S subunits from ribosome-rich regions back into the nucleoids. There they initiate co-transcriptional translation, which is an important mechanism for maintaining RNAP forward progress and protecting the nascent mRNA chain. Segregation of 70S-polysomes from the nucleoid may facilitate rapid growth by shortening the search time for ribosomes to find free mRNA concentrated outside the nucleoid and the search time for RNAP concentrated within the nucleoid to find transcription initiation sites.","authors":["Somenath Bakshi","Heejun Choi","James Carl Weisshaar"],"meta":["July 2015Frontiers in Microbiology 6:636","DOI:10.3389/fmicb.2015.00636","SourcePubMed"],"references":["264202225_Single-particle_tracking_reveals_that_free_ribosomal_subunits_are_not_excluded_from_the_Escherichia_coli_nucleoid","262928875_Non-perturbative_Imaging_of_Nucleoid_Morphology_in_Live_Bacterial_Cells_during_Antimicrobial_Peptide_Attack","259607632_The_multifork_Escherichia_coli_chromosome_is_a_self-duplicating_and_self-segregating_thermodynamic_ring_polymer_Genes_Development_2014","313215251_Modulation_of_chemical_composition_and_other_parameters_of_the_cell_by_growth_rate","269282977_RNA_localization_in_bacteria","266562012_New_approaches_to_understanding_the_spatial_organization_of_bacterial_genomes","266025648_Time-dependent_Effects_of_Transcription-_and_Translation-halting_Drugs_on_the_Spatial_Distributions_of_the_E_coli_Chromosome_and_Ribosomes","263856169_Simulating_the_Entropic_Collapse_of_Coarse-Grained_Chromosomes","259446868_Partitioning_of_RNA_Polymerase_Activity_in_Live_Escherichia_coli_from_Analysis_of_Single-Molecule_Diffusive_Trajectories","258044528_High-Resolution_Mapping_of_the_Spatial_Organization_of_a_Bacterial_Chromosome"]}