{"id":"280295804_Women's_Representation_in_Science_Predicts_National_Gender-Science_Stereotypes_Evidence_From_66_Nations","abstract":"In the past 40 years, the proportion of women in science courses and careers has dramatically increased in some nations but not in others. Our research investigated how national differences in women's science participation related to gender-science stereotypes that associate science with men more than women. Data from ϳ350,000 participants in 66 nations indicated that higher female enrollment in tertiary science education (community college or above) related to weaker explicit and implicit national gender-science stereotypes. Higher female employment in the researcher workforce related to weaker explicit, but not implicit, gender-science stereotypes. These relationships remained after controlling for many theoretically relevant covariates. Even nations with high overall gender equity (e.g., the Netherlands) had strong gender-science stereotypes if men dominated science fields specifically. In addition, the relationship between women's educational enrollment in science and implicit gender-science stereotypes was stronger for college-educated participants than participants without college education. Implications for instructional practices and educational policies are discussed.","authors":["David Miller","Alice H Eagly","Marcia C Linn"],"meta":["October 2014The Japanese Journal of Educational Psychology 107(3)","DOI:10.1037/edu0000005"],"references":["309718282_Dual-Process_Theories_of_the_Social_Mind","286363969_False-positive_psychology_Undisclosed_flexibility_in_data_collection_and_analysis_allows_presenting_anything_as_significant","285179532_Social_role_theory","320596143_Introduction_to_meta-analysis","319615374_Portrayals_of_Female_Scientists_in_the_Mass_Media","313077007_Are_high_school_chemistry_textbooks_gender_fair","303065535_Harvesting_implicit_group_attitudes_and_beliefs_from_a_demonstration_website","285923967_Science_learning_and_instruction_Taking_advantage_of_technology_to_promote_knowledge_integration","279959407_Biosocial_Construction_of_Sex_Differences_and_Similarities_in_Behavior","279800614_Understanding_and_Using_the_Implicit_Association_Test_I_An_Improved_Scoring_Algorithm"]}