{"id":"280217861_Mesure_de_cylindricite_de_tres_haute_exactitude_developpement_d'une_nouvelle_machine_de_reference","abstract":"The “Laboratoire Commun de Métrologie LNE-CNAM (LCM)” seeks to improve the measurement of primary\npressure standards done using pressure balances, to an order of 10-6 relative uncertainty. Therefore, it is appropriate to back-up these\npressure balances with a measurement of the topology of the piston-cylinder devices used on these balances. Cylindricity measurement\nis also found in many industrial applications such as the measurement of standards used for the calibration of measuring machines.\nThis research project, conducted in collaboration with SAS GEOMNIA under a CIFRE agreement, has a main objet to develop a new\nultra-high precision machine for cylinders form measurement. We pushes with this project the leading edge of the cylinders form\nmeasurement area; we propose indeed a technological leap which leads to reduce the uncertainty associated to cylindricity errors up to\n10 nm in a cylindrical working volume of 350 mm diameter rand 150 mm height. Form measurement is usually done using a\nmeasurement probe moved about the surface to be measured with high precision guiding systems. Nonetheless, these guiding systems\nare not precise enough to offer the low uncertainty required even when error correction techniques are used. This is because the\nprecision of the guides is limited by their low repeatability. To meet this uncertainty level, we propose an approach based on the\n“dissociated metrological structure” concept. The measurement consists of comparing the artifact’s form with the form of a cylindrical\nreference which should have perfect form stability. However, the mapping form deviation of this cylindrical reference needs to be\nidentified at the same level of uncertainty referred.\nThe present work exposes a detailed analysis of the existing measuring machines and their limitations. Consequently, an\noptimized machine architecture is proposed in order to overcome the present limitations. The proposed machine architecture takes into\naccount the \"secondary\" error terms relative to the probes positions and second order effects in order to satisfy the level of accuracy\nsought. A complete calibration procedure of the machine has been elaborated based on the error separation methods; it allows the\nseparation of the form errors of each of the reference cylinder and a qualification cylindrical part simultaneously measured. This\nprocedure does not present any accuracy limitations and has been experimentally verified. An analysis of the effects related to the\nmeasurement of cylindrical artifacts using capacitive sensors has also been investigated. These experiments have led to the\ndevelopment of in-situ calibration strategies using laser interferometers integrated in the machine. Thus, the metrological traceability\nof the measurements is guaranteed. Two test benches have been developed to characterize the error sources that influence the\nmeasurement and to validate the calibration procedures of the probes used. The detailed design of the instrument synthesizes all the\nconceptual thoughts about the architecture, the calibration and the displacement measurement of the capacitive probes. This work has\nresulted in the development of this new reference instrument; its design, installation and adjustment are detailed.","authors":["Alain Vissiere"],"meta":["December 2013","DOI:10.13140/RG.2.1.2031.9840"],"references":["280216730_Evaluation_of_the_capacitive_displacement_measurements_in_mechanical_metrology_with_cylindrical_artefacts","280216729_Experimental_evaluation_of_the_dissociated_metrological_technique_DMT_for_the_geometrical_measurement_in_metrological_applications","259562166_Contribution_a_l'evaluation_des_angles_-_conception_realisation_et_validation_d'un_plateau_pivotant_de_tres_haute_precision_-_vers_une_reference_nationale","259306887_A_primary_roundness_measuring_machine","355600849_Mesures_sans_contact_-_Methodes_magnetiques_et_capacitives","308594952_Fundamental_principles_of_engineering_nanometrology","301243967_Foundations_of_Ultra-Precision_Mechanism_Design","284793634_Design_and_construction_of_an_84_inches_diamond_turning_machine","269207211_Caracterisation_metrologique_d'une_nouvelle_reference_de_pression_relative_dans_le_domaine_15_a_50_MPa","263561830_Realization_and_calibration_of_the_Isara_400_ultra-precision_CMM"]}