{"id":"280310869_Understanding_Black_Male_Mathematics_High_Achievers_from_the_Inside_Out_Internal_Risk_and_Protective_Factors_in_High_School","abstract":"The gendered and racialized narrative of Black male adolescents in urban spaces is one often fraught with deficit-based assumptions and presupposi- tions about their abilities, competencies, and proclivities with regard to schooling in general and mathematics in particular. Yet despite these conventional beliefs, compounded by the dearth of Black male representation in many STEM-related careers, there remain Black male adolescents who, during their high school years, nevertheless achieve a high degree of mathematical success. This study endeavors to unpack the internal, interrelated processes and strategies through which a cohort of 13 high-achieving, Black male high school students develop positive mathe- matical, social, racial, and gendered identities. Drawing on narrative analysis, we utilized semi-structured interviews to identify and explore how internal protective and risk factors operated in their lives. Results identify not only several coping strategies, beliefs, practices, and habits that foster positive mathematical identity trajectories for our respondents, but also several internal challenges that Black male adolescents must successfully negotiate both in- and out-of-school throughout the attainment process. We also discuss how these findings relate to in-school practices that might promote and sustain Black male achievement in high school mathematics.","authors":["Ebony McGee","Francis Pearman"],"meta":["October 2014The Urban Review 46(3):1-28","DOI:10.1007/s11256-014-0317-2"],"references":["356337021_Researching_Race_in_Mathematics_Education","290161592_Mathematics_as_gatekeeper_Power_and_privilege_in_the_production_of_knowledge","280609709_Racial-Ethnic_Identity_Academic_Achievement_and_African_American_Males_A_Review_of_Literature","275504558_Risk_and_Protective_Factors_in_Mathematically_Talented_Black_Male_Students_Snapshots_From_Kindergarten_Through_Eighth_Grade","348866892_Soul_Babies_Black_Popular_Culture_and_the_Post-Soul_Aesthetic","346111823_Preparing_the_Way_A_Qualitative_Study_of_High-Achieving_African_American_Males_and_the_Role_of_the_Family","311509060_Just_what_is_critical_race_theory_and_what's_it_doing_in_a_nice_field_like_education","289320188_Cool_posing_on_campus_A_qualitative_study_of_masculinities_and_gender_expression_among_black_men_at_a_private_research_institution","276216328_Performing_Masculinity_Adolescent_African_American_Boys'_Response_to_Gender_Scripting","275675024_Soul_Babies_Black_Popular_Culture_and_the_Post-Soul_Aesthetic"]}