{"id":"280317234_Mobile_Phones_as_Ubiquitous_Social_and_Environmental_Geo-Sensors","abstract":"Mobile and sensor-rich devices such as today's smartphones are increasingly leveraged as ubiquitous mobile geo-sensors that are able to sense their immediate surroundings on site in high spatial and temporal detail. Using those devices, the activity or mobility behavior of mobile phone users is being “sensed” since they leave behind digital traces of their whereabouts when using the mobile network—voluntarily or not. Additionally, people themselves can act as human sensors by providing subjective, geo-referenced “observations” in the form of individual perceptions of, e.g., the weather, thereby complementing calibrated measurements from technical geo-sensor networks. Together with other user-generated and increasingly geo-referenced data and information from a variety of Web 2.0 and social media platforms, this results in vast volumes of geo-data that digitally reflect the dynamics of human behavior (e.g., mobility in urban spaces) and environmental phenomena (e.g., the weather). In this article, the authors provide an overview of recent literature, influencing scholars, and future research directions in the context of using mobile phones for social and environmental geo-sensing in order to provide additional insights into the space-time behavior of the underlying geographic phenomena.","authors":["Günther Sagl","Bernd Resch"],"meta":["January 2015","DOI:10.4018/978-1-4666-8239-9.ch098","Publisher: IGI Global"],"references":["271880540_Understanding_individual_mobility_patterns_from_urban_sensing_data_A_mobile_phone_trace_example","321605886_Crowdsourcing_Geographic_Knowledge_Volunteered_Geographic_Information_VGI_in_Theory_and_Practice","321596380_Environmental_Health_Impacts_of_Transport_and_Mobility","313570691_The_Digital_Earth_Understanding_our_planet_in_the_21st_century","307855241_NeoGeography_and_the_nature_of_geographic_expertise","285345988_Gerhard_The_role_of_advanced_sensing_in_smart_cities","285268018_Quantifying_urban_attractiveness_from_the_distribution_and_density_of_digital_footprints","281077685_Citizen_science_Enabling_participatory_urbanism","278146287_Mobile_Phones_as_Traffic_Probes_Practices_Prospects_and_Issues","275035425_Migration_in_the_context_of_vulnerability_and_adaptation_to_climate_change_Insights_from_analogues"]}