{"id":"280330282_Noisy_Rumor_Spreading_and_Plurality_Consensus","abstract":"Error-correcting codes are efficient methods for handling \\emph{noisy}\ncommunication channels in the context of technological networks. However, such\nelaborate methods differ a lot from the unsophisticated way biological entities\nare supposed to communicate. Yet, it has been recently shown by Feinerman,\nHaeupler, and Korman {[}PODC 2014{]} that complex coordination tasks such as\n\\emph{rumor spreading} and \\emph{majority consensus} can plausibly be achieved\nin biological systems subject to noisy communication channels, where every\nmessage transferred through a channel remains intact with small probability\n$\\frac{1}{2}+\\epsilon$, without using coding techniques. This result is a\nconsiderable step towards a better understanding of the way biological entities\nmay cooperate. It has been nevertheless be established only in the case of\n2-valued \\emph{opinions}: rumor spreading aims at broadcasting a single-bit\nopinion to all nodes, and majority consensus aims at leading all nodes to adopt\nthe single-bit opinion that was initially present in the system with (relative)\nmajority. In this paper, we extend this previous work to $k$-valued opinions,\nfor any $k\\geq2$.\nOur extension requires to address a series of important issues, some\nconceptual, others technical. We had to entirely revisit the notion of noise,\nfor handling channels carrying $k$-\\emph{valued} messages. In fact, we\nprecisely characterize the type of noise patterns for which plurality consensus\nis solvable. Also, a key result employed in the bivalued case by Feinerman et\nal. is an estimate of the probability of observing the most frequent opinion\nfrom observing the mode of a small sample. We generalize this result to the\nmultivalued case by providing a new analytical proof for the bivalued case that\nis amenable to be extended, by induction, and that is of independent interest.","authors":["Pierre Fraigniaud","Emanuele Natale"],"meta":["August 2019Distributed Computing 32(6014)","DOI:10.1007/s00446-018-0335-5","SourcearXiv"],"references":["310737137_Simple_dynamics_for_plurality_consensus","336941721_Beeping_a_Maximal_Independent_Set","322215969_Space-Optimal_Majority_in_Population_Protocols","322049428_Limits_for_Rumor_Spreading_in_stochastic_populations","318576322_Brief_Announcement_Rapid_Asynchronous_Plurality_Consensus","312413193_Minimizing_Message_Size_in_Stochastic_Communication_Patterns_Fast_Self-Stabilizing_Protocols_with_3_bits","305674922_A_Polylogarithmic_Gossip_Algorithm_for_Plurality_Consensus","301854638_Plurality_Consensus_via_Shuffling_Lessons_Learned_from_Load_Balancing","300175420_Fast_and_Exact_Majority_in_Population_Protocols","299752985_A_Remark_on_Stirling's_Formula"]}