{"id":"280330333_Decision_Maker_based_on_Atomic_Switches","abstract":"We propose a simple model for an atomic switch-based decision maker (ASDM),\nand show that, as long as its total volume of precipitated Ag atoms is\nconserved when coupled with suitable operations, an atomic switch system\nprovides a sophisticated \"decision-making\" capability that is known to be one\nof the most important intellectual abilities in human beings. We considered the\nmulti-armed bandit problem (MAB); the problem of finding, as accurately and\nquickly as possible, the most profitable option from a set of options that\ngives stochastic rewards. These decisions are made as dictated by each volume\nof precipitated Ag atoms, which is moved in a manner similar to the\nfluctuations of a rigid body in a tug-of-war game. The \"tug-of-war (TOW)\ndynamics\" of the ASDM exhibits higher efficiency than conventional MAB solvers.\nWe show analytical calculations that validate the statistical reasons for the\nASDM dynamics to produce such high performance, despite its simplicity. These\nresults imply that various physical systems, in which some conservation law\nholds, can be used to implement efficient \"decision-making objects.\" Efficient\nMAB solvers are useful for many practical applications, because MAB abstracts a\nvariety of decision-making problems in real- world situations where an\nefficient trial-and-error is required. The proposed scheme will introduce a new\nphysics-based analog computing paradigm, which will include such things as\n\"intelligent nano devices\" and \"intelligent information networks\" based on\nself-detection and self-judgment.","authors":["Song-Ju Kim","Tohru Tsuruoka","Tsuyoshi Hasegawa","Masakazu Aono"],"meta":["July 2015","DOI:10.3934/matersci.2016.1.245","SourcearXiv"],"references":["281036033_Single-photon_decision_maker","275055434_Harnessing_Natural_Fluctuations_Analogue_Computer_for_Efficient_Socially_Maximal_Decision_Making","272359176_Decision_Maker_using_Coupled_Incompressible-Fluid_Cylinders","270443256_Amoeba-inspired_algorithm_for_cognitive_medium_access","269877142_Efficient_Decision-Making_by_Volume-Conserving_Physical_Object","267039524_Decision_making_based_on_optical_excitation_transfer_via_near-field_interactions_between_quantum_dots","255715069_ERRATUM_Decision_Maker_based_on_Nanoscale_Photo-excitation_Transfer","303101292_Bandit_processes_and_dynamic_allocation_indices_J_Roy_Stat_Soc_B","272161307_Reinforcement_Learning_An_Introduction","259513559_Amoeba-Inspired_Tug-of-War_Algorithms_for_Exploration-Exploitation_Dilemma_in_Extended_Bandit_Problem"]}