{"id":"280446977_MONTO_A_Machine_-Readable_Ontology_for_Teaching_Word_Problems_in_Mathematics","abstract":"The Indian National Curriculum Framework has as one of its objectives the development of mathematical\nthinking and problem solving ability. However, recent studies conducted in Indian metros have expressed\nconcern about students’ mathematics learning. Except in some private coaching academies, regular classroom teaching does not include problem solving in mathematics, but is limited to mere practice exercises and drills of known exercises. For describing mathematical thinking, Schoenfeld gave a framework containing four components: resources, heuristics, controls and beliefs. Beginning in childhood we develop an ontology for the ideas we learn, and this ontology evolves as we continue learning. Ontologies used for teaching need to incorporate elements of mathematical thinking popularized by problem solving experts. So teaching that makes use of such ontologies of problems, problem solving strategies, and tasks would be beneficial to students. In this paper we identify the gaps in the literature on teaching problem solving, and discuss how and why ontologies can be used for teaching problem solving in mathematics at the high school level. As a proof of concept, we describe the method by which an ontology named MONTO has been created for teaching problem solving in mathematics, and give examples of its use. We describe the MONTO ontology and compare it with some other teaching ontologies described in the literature. We developed and evaluated the MONTO ontology for Surface Area and Volume (3D Solids) problems taught as part of the national curriculum in India, and the results obtained were satisfactory: MONTO was found to be 94% robust against unseen problems in different curricula for the same domain.","authors":["Aparna Lalingkar","Chandrashekar Ramanathan","Srinivasan Ramani"],"meta":["July 2015Educational Technology & Society 18(3):197-213"],"references":["301677206_Development_of_Children's_Problem-Solving_Ability_in_Arithmetic","289963462_Learning_to_think_mathematically_Problem_solving_metacognition_and_sense_making_in_mathematics","343611971_The_Development_of_Addition_and_Subtraction_Problem-Solving_Skills","320858471_Ontology-based_smart_learning_environment_for_teaching_word_problems_in_mathematics","319393676_ActiveMath_A_generic_and_adaptive_web-base_learning_environment","311100273_Comparison_of_Ontology_Editors","292317405_Addition_and_subtraction_A_cognitive_perspective_pp","287260234_Learning_to_solve_problems_A_handbook_for_designing_problem-solving_learning_environments","285980221_Reading_and_reasoning_skills_for_math_problem_solvers","285158664_A_Translation_Approach_to_Formal_Ontologies","270960085_Problem_Perception_and_Knowledge_Structure_in_Expert_and_Novice_Mathematical_Problem_Solvers","268688872_Ontology-based_Smart_Learning_Environment_for_Teaching_Word_Problems_in_Mathematics","274812028_'Problem-Solving'_Or_Problem_Solving","270960128_Rules_of_the_Mind","266525757_Mathematical_discovery_On_understanding_learning_and_teaching_problem_solving_Vol_II"]}