{"id":"280490924_Mobile_self-checkout_systems_in_the_FMCG_retail_sector_A_comparison_analysis","abstract":"New business models are emerging in the FMCG retail sector due to the wide diffusion of digital technologies; innovative tools-such as Pervasive Retailing Information Systems-are wide spreading all over the world aiming to increase customer loyalty and retailer performance. Furthermore, the recent mass diffusion of mobile technologies is also contributing to modify customer satisfaction towards the shopping process. In this context, new generations of self-service systems – i.e. mobile Self-Checkout Systems (mSCSs)-are becoming widely adopted by FMCG (Fast Moving Consumer Goods) retail companies: the aim is to both speed up the customer-shopping trip and increase customer satisfaction. A mSCS is a self-checkout system based on mobile technology. Traditionally, self-checkout systems have been applied to speed up the customer purchase process; impacts on retailer performance could also be evaluated in order to optimize labor force at store level. The paper proposes a comparison analysis about the application of different types of mSCSs at FMCG retail stores: the study will focus on analyzing quantitatively impacts on time based metrics both from the customer and the retailer points of view. The study will be helpful for practitioners in designing their own mSCS; furthermore, a structured model for evaluating potential impacts of innovative technologies at the retail sector as a result. Finally, a discrete-event simulation model has been developed to quantitatively compare different mSCSs in a case study.","authors":["Serena Andriulo","Valerio Elia","Maria Grazia Gnoni"],"meta":["January 2014International Journal of RF Technologies Research and Applications 6(4):207-224","DOI:10.3233/RFT-150067"],"references":["267367472_The_Determinants_and_Outcomes_of_Using_Self-Checkout_Systems_in_Supermarket_Customers_An_Exploratory_Study_in_Australia","266186358_A_scenario_analysis_for_evaluating_RFID_investments_in_pallet_management","260197997_Pervasiveness_of_RFID_technology_A_survey_based_on_case_studies_analysis","292751664_A_new_tipping_point","288995483_A_mobile_commercial_system_for_membership-based_stores_using_mobile_RFID_readers","286956416_Consumers'_intention_to_use_self-scanning_technology_The_role_of_technology_readiness_and_perceptions_toward_self-service_technology","265118174_The_Future_of_Shopping","262926345_Foreword_Special_Issue_on_Retail_Operations","260042168_Why_do_Customers_Use_Self-Service_Information_Technologies_in_Retail_The_Mediating_Effect_of_Perceived_Service_Quality","259139296_Supermarket_self-checkout_service_quality_customer_satisfaction_and_loyalty_Empirical_evidence_from_an_emerging_market"]}