{"id":"280586321_Multiple_Orderings_of_Events_in_Disease_Progression","abstract":"The event-based model constructs a discrete picture of disease progression from cross-sectional data sets, with each event corresponding to a new biomarker becoming abnormal. However, it relies on the assumption that all subjects follow a single event sequence. This is a major simplification for sporadic disease data sets, which are highly heterogeneous, include distinct subgroups, and contain significant proportions of outliers. In this work we relax this assumption by considering two extensions to the event-based model: a generalised Mallows model, which allows subjects to deviate from the main event sequence, and a Dirichlet process mixture of generalised Mallows models, which models clusters of subjects that follow different event sequences, each of which has a corresponding variance. We develop a Gibbs sampling technique to infer the parameters of the two models from multi-modal biomarker data sets. We apply our technique to data from the Alzheimer's Disease Neuroimaging Initiative to determine the sequence in which brain regions become abnormal in sporadic Alzheimer's disease, as well as the heterogeneity of that sequence in the cohort. We find that the generalised Mallows model estimates a larger variation in the event sequence across subjects than the original event-based model. Fitting a Dirichlet process model detects three subgroups of the population with different event sequences. The Gibbs sampler additionally provides an estimate of the uncertainty in each of the model parameters, for example an individual's latent disease stage and cluster assignment. The distributions and mixtures of sequences that this new family of models introduces offer better characterisation of disease progression of heterogeneous populations, new insight into disease mechanisms, and have the potential for enhanced disease stratification and differential diagnosis.","authors":["Alexandra L Young","Neil P. Oxtoby","Jonathan Huang","Razvan Marinescu"],"meta":["July 2015Information Processing in Medical Imaging: Proceedings of the ... Conference 24:711-22","DOI:10.1007/978-3-319-19992-4_56","SourcePubMed","Conference: International Conference on Information Processing in Medical Imaging"],"references":["291035233_Hypothetical_model_of_dynamic_biomarkers_of_the_Alzheimer's_pathological_cascade","264633325_A_data-driven_model_of_biomarker_changes_in_sporadic_Alzheimer's_disease","234048979_Geodesic_Information_Flows","284632620_Probabilistic_event_cascades_for_Alzheimer's_disease","283632740_Estimation_and_clustering_with_infinite_rankings","265545380_Distance_Based_Ranking_Models","259446803_Biomarker_Modeling_of_Alzheimer's_Disease","235904968_Amyloid_B_deposition_neurodegeneration_and_cognitive_decline_in_sporadic_Alzheimer's_Disease_a_prospective_cohort_study","234697769_Tracking_pathophysiological_processes_in_Alzheimer's_disease_an_updated_hypothetical_model_of_dynamic_biomarkers","221781469_An_event-based_model_for_disease_progression_and_its_application_in_familial_Alzheimer's_disease_and_Huntington's_disease"]}