{"id":"280500892_Twenty_Security_Considerations_for_Cloud-Supported_Internet_of_Things","abstract":"To realise the broad vision of pervasive computing, underpinned by the \" Internet of Things \" (IoT), it is essential to break down application and technology-based silos and support broad connectivity and data sharing; the cloud being a natural enabler. Work in IoT tends towards the subsystem, often focusing on particular technical concerns or application domains, before offloading data to the cloud. As such, there has been little regard given to the security, privacy and personal safety risks that arise beyond these subsystems; that is, from the wide-scale, cross-platform openness that cloud services bring to IoT. In this paper we focus on security considerations for IoT from the perspectives of cloud tenants, end-users and cloud providers, in the context of wide-scale IoT proliferation, working across the range of IoT technologies (be they things or entire IoT subsystems). Our contribution is to analyse the current state of cloud-supported IoT to make explicit the security considerations that require further work.","authors":["Jatinder Singh","Thomas Pasquier","Jean Bacon","Hajoon Ko"],"meta":["June 2016IEEE Internet of Things Journal 269 - 284(3):3","DOI:10.1109/JIOT.2015.2460333","Project: CloudSafetyNet: End-to-end application security in the cloud explores the use of Information Flow Control to achieve greater security in cloud computing."],"references":["312136806_Trusted_Platform_Module","311793099_Identity_Authentication_and_Capability_Based_Access_Control_IACAC_for_the_Internet_of_Things","311344281_A_survey_on_security_issues_in_service_delivery_models_of_cloud_computing","309201112_The_case_for_VM-based_cloudlets_in_mobile_computing","305364825_Policy_legal_and_regulatory_implications_of_a_Europe-only_cloud","304929258_3-D_Data_Management_Controlling_Data_Volume_Velocity_and_Variety","304848476_Scalable_Attestation_A_Step_toward_Secure_and_Trusted_Clouds","299678173_DDoS_Attack_and_Defence_in_Cloud","291784762_Automatic_Data_Protection_Certificates_for_Cloud-Services_based_on_Secure_Logging","286993931_Trustworthy_geographically_fenced_hybrid_clouds_big_ideas_paper"]}