{"id":"280560418_Teaching_Children_to_Attribute_Second-order_False_Beliefs_A_Training_Study_with_Feedback","abstract":"There are several training studies that showed that it is possible to teach preschool children to pass first-order false belief tasks. However, the literature is missing analogous training effects for school-age children with respect to second-order false belief tasks. We focused on the role of feedback in the development of second-order false belief reasoning in two different conditions in 5- to 6-year-old children: (i) feedback with explanation, (ii) feedback without explanation. Children’s performance improved in both conditions. We argue that children who cannot yet pass the second-order false belief task reason about the false belief questions based on the reasoning strategy that they most frequently use in daily life (i.e. first-order or zero-order theory of mind). Moreover, we argue that children can revise their wrong reasoning strategy and change to the correct second-order reasoning strategy based on repeated exposure to the feedback “Correct/Wrong” together with the correct answer.","authors":["Burcu Arslan","Rineke Verbrugge","Niels A Taatgen","Bart Hollebrandse"],"meta":["July 2015","Conference: COGSCI 2015At: Pasadena, California, USA","Project: Cognitive systems in interaction: Logical and computational models of higher-order social cognition"],"references":["279236477_Package_Lme4_Linear_Mixed-Effects_Models_Using_Eigen_and_S4","244994248_Modeling_Developmental_Transitions_in_Reasoning_about_False_Beliefs_of_Others","232554053_Preschoolers_Can_Attribute_Second-Order_Beliefs","232003352_Does_a_chimpanzee_have_a_theory_of_mind","229959839_Theory_of_mind_Is_training_contagious","227652325_Training_Theory_of_Mind_and_Executive_Control_A_Tool_for_Improving_School_Achievement","316360101_lme4_Linear_mixed-effects_models_using_Eigen_and_S4","262816269_Promoting_theory_of_mind_during_middle_childhood_A_training_program","247344477_A_Reevaluation_of_Working_Memory_Capacity_in_Children","239051366_Does_the_chimpanzee_have_a_Theory_of_Mind"]}