{"id":"280537744_Perceptual_and_affective_mechanisms_in_facial_expression_recognition_An_integrative_review","abstract":"Facial expressions of emotion involve a physical component of morphological changes in a face and an affective component conveying information about the expresser's internal feelings. It remains unresolved how much recognition and discrimination of expressions rely on the perception of morphological patterns or the processing of affective content. This review of research on the role of visual and emotional factors in expression recognition reached three major conclusions. First, behavioral, neurophysiological, and computational measures indicate that basic expressions are reliably recognized and discriminated from one another, albeit the effect may be inflated by the use of prototypical expression stimuli and forced-choice responses. Second, affective content along the dimensions of valence and arousal is extracted early from facial expressions, although this coarse affective representation contributes minimally to categorical recognition of specific expressions. Third, the physical configuration and visual saliency of facial features contribute significantly to expression recognition, with \"emotionless\" computational models being able to reproduce some of the basic phenomena demonstrated in human observers. We conclude that facial expression recognition, as it has been investigated in conventional laboratory tasks, depends to a greater extent on perceptual than affective information and mechanisms.","authors":["Manuel G Calvo","Lauri Nummenmaa"],"meta":["July 2015Cognition and Emotion 30(6):1-26","DOI:10.1080/02699931.2015.1049124","SourcePubMed"],"references":["325671474_Core_Affect_and_the_Psychological_Construction_of_Emotion","304662834_Recognition_Thresholds_for_Static_and_Dynamic_Emotional_Faces","291218875_The_role_of_the_human_amygdala_in_perception_and_attention","288616098_On_Perceiving_Facial_Expressions_The_Role_of_Culture_and_Context","287238244_Neurocomputational_Models_of_Face_Processing","285854995_The_Karolinska_Directed_Emotional_Faces_-_KDEF_CD_ROM_from_Department_of_Clinical_Neuroscience_Psychology_section","284387911_Facial_expressions_of_emotion","281496154_Emotional_networks_in_the_brain","280941642_Brain_Signatures_of_Perceiving_a_Smile_Time_Course_and_Source_Localization","275668448_Discrete_Neural_Signatures_of_Basic_Emotions"]}