{"id":"280571773_Individual_differences_predict_sensitivity_to_the_uncanny_valley","abstract":"It can be creepy to notice that something human-looking is not real. But can sensitivity to this phenomenon, known as the uncanny valley, be predicted from superficially unrelated traits? Based on results from at least 489 participants, this study examines the relation between nine theoretically motivated trait indices and uncanny valley sensitivity, operationalized as increased eerie ratings and decreased warmth ratings for androids presented in videos. Animal Reminder Sensitivity, Neuroticism, its Anxiety facet, and Religious Fundamentalism significantly predicted uncanny valley sensitivity. In addition, Concern over Mistakes and Personal Distress significantly predicted android eerie ratings but not warmth. The structural equation model indicated that Religious Fundamentalism operates indirectly, through robot-related attitudes, to heighten uncanny valley sensitivity, while Animal Reminder Sensitivity increases eerie ratings directly. These results suggest that the uncanny valley phenomenon may operate through both sociocultural constructions and biological adaptations for threat avoidance, such as the fear and disgust systems. Trait indices that predict uncanny valley sensitivity warrant investigation by experimental methods to explicate the processes underlying the uncanny valley phenomenon.","authors":["Karl F. MacDorman","Steven O. Entezari"],"meta":["September 2015Interaction Studies 16(2):141-172","DOI:10.1075/is.16.2.01mac"],"references":["313162532_The_dimensions_of_perfectionism","313105125_Fear_and_anxiety_Clinical_evolutionary_and_cognitive_perspectives","312549509_Valley'_effect_and_related_psychological_phenomena","310793602_The_human_likeness_dimension_of_the_uncanny_valley_hypothesis_Behavioral_and_functional_MRI_findings_Front_Hum","310054660_Disgust","309032267_Cutoff_criteria_for_fit_indexes_in_covariance_structure_analysis_Conventional_criteria_versus_new_alternatives","304998830_Measuring_individual_differences_in_empathy_Evidence_for_multidimensional_approach","292240643_Final_Fantasy_or_the_Incredibles_Ultra-realistic_animation_aesthetic_engagement_and_the_uncanny_valley","289963614_Applications_of_structural_equation_modeling_in_marketing_and_consumer_research_A_review","289963069_Applications_of_structural_equation_modeling_in_marketing_and_consumer_research_A_review"]}