{"id":"280589999_Condorcet_Domains_Median_Graphs_and_the_Single_Crossing_Property","abstract":"Condorcet domains are sets of linear orders with the property that, whenever\nthe preferences of all voters belong to this set, the majority relation has no\ncycles. We observe that, without loss of generality, such domain can be assumed\nto be closed in the sense that it contains the majority relation of every\nprofile with an odd number of individuals whose preferences belong to this\ndomain.\nWe show that every closed Condorcet domain is naturally endowed with the\nstructure of a median graph and that, conversely, every median graph is\nassociated with a closed Condorcet domain (which may not be a unique one). The\nsubclass of those Condorcet domains that correspond to linear graphs (chains)\nare exactly the preference domains with the classical single crossing property.\nAs a corollary, we obtain that the domains with the so-called `representative\nvoter property' (with the exception of a 4-cycle) are the single crossing\ndomains.\nMaximality of a Condorcet domain imposes additional restrictions on the\nunderlying median graph. We prove that among all trees only the chains can\ninduce maximal Condorcet domains, and we characterize the single crossing\ndomains that in fact do correspond to maximal Condorcet domains.\nFinally, using Nehring's and Puppe's (2007) characterization of monotone\nArrowian aggregation, our analysis yields a rich class of strategy-proof social\nchoice functions on any closed Condorcet domain.","authors":["Clemens Puppe","Arkadii M. Slinko"],"meta":["February 2019Economic Theory 67(1)","DOI:10.1007/s00199-017-1084-6","SourcearXiv"],"references":["285254994_Median_Graphs_Characterizations_Location_Theory_and_Related_Structures","281611336_A_Helly_theorem_in_weakly_modular_space","324470397_Mathematical_Models_in_the_Social_Sciences","324356152_Essai_sur_l'application_de_l'analyse_a_la_probabilite_des_decisions","313522102_A_consistent_extension_of_Condorcet's_election_principle","277334541_Generalizing_the_Single-Crossing_Property_on_Lines_and_Trees_to_Intermediate_Preferences_on_Median_Graphs","276275927_Mathematics_Without_Numbers","276275613_Essai_sur_l'Application_de_L'Analyse_a_la_Probabilite_des_Decisions_Rendues_a_la_Pluraliste_des_Voix_Paris","275706861_Social_Choice_and_Individual_Values","272770474_Axioms_of_Cooperative_Decision_Making"]}