{"id":"280538385_Discrete_Wasserstein_Barycenters_Optimal_Transport_for_Discrete_Data","abstract":"Wasserstein barycenters correspond to optimal solutions of transport problems\nfor several marginals, and as such are at the core of applications ranging from\neconomics to statistics and computer science. The corresponding theory for data\nin the form of continuous probability measures is well-developed. However,\nexact computations in this setting are tractable in only a small number of\nspecialized cases. On the other hand, in many applications of economics, data\nis given as a set of probability measures with finite support; in other\nsituations, continuous data is discretized to allow for the use of\nstate-of-the-art heuristics.\nSuch a discrete input format allows us to study the properties and\ncomputation of barycenters from the point of view of polyhedral theory. In\ndoing so, we are able to mirror some of the best properties of barycenters for\nthe continuous setting and obtain several remarkable differences: barycenters\nfor discrete data have a provably sparse finite support and do not split mass\nin their optimal transport maps. We illustrate the results of the discrete\nbarycenter theory with some proof-of-concept computations of exact barycenters,\nhighlighting the observed properties in an economic toy example.","authors":["Ethan Anderes","Steffen Borgwardt","Jacob Miller"],"meta":["October 2016Mathematical Methods of Operations Research 84(2)","DOI:10.1007/s00186-016-0549-x","SourcearXiv"],"references":["279232953_Probabilistic_Frechet_means_for_time_varying_persistence_diagrams","268227425_Numerical_methods_for_matching_for_teams_and_Wasserstein_barycenters","267983125_Julia_A_Fresh_Approach_to_Numerical_Computing","265009248_On_the_Strictly_Complementary_Slackness_Relation_in_Linear_Programming","233871700_Consistent_estimation_of_a_population_barycenter_in_the_Wassersteinspace","286806209_Optimal_maps_for_the_multidimensional_Monge-Kantorovich_problem","269030119_The_Monge-Kantorovich_Mass_Transference_Problem_and_Its_Stochastic_Applications","259151410_Computing_in_Operations_Research_Using_Julia","257836724_Fast_Computation_of_Wasserstein_Barycenters","239230352_Topics_in_Optimal_Transportation_Theory"]}