{"id":"280554743_Object-Oriented_Design_and_Programming_An_Investigation_of_Novices'_Conceptions_on_Objects_and_Classes","abstract":"The Object-Oriented Programming (OOP) technique is nowadays the most popular programming technique among tertiary education institutions. However, learning OOP is a cognitively demanding task for undergraduate students. Several difficulties and misconceptions have been recorded in the literature for both OOP concepts and languages, mainly Java. This article focuses on reviewing and advancing research on the most fundamental OOP concepts, namely, the concepts of “object” and “class” and their role during program execution. The results of a long-term investigation on the subject are presented, focusing on a study exploring undergraduate students’ conceptions on “objects” and “classes.” The study advances related research on categories of conceptions on “objects” and “classes” by providing quantitative results, in addition to qualitative results, regarding the frequency of the recorded conceptions. Nearly half the students seem to comprehend the modeling and static/dynamic aspects of the concepts “object” and “class.” Implications for achieving a deep conceptual understanding of text, action, and modeling aspects of these fundamental concepts are also discussed. Information regarding the programming environments utilized in the course and key features of the applied teaching approach are presented, in order to facilitate both a better understanding of the context and a better employment of the results of the presented study. Finally, proposals for enhancing the contribution of this and similar studies are made.","authors":["Stelios Xinogalos"],"meta":["July 2015ACM Transactions on Computing Education 15(3):Article No. 13","DOI:10.1145/2700519"],"references":["311463394_The_hands-on_activities_of_the_programming_microworld_objectKarel","259998496_Notional_Machines_and_Introductory_Programming_Education","258011388_Programming_Techniques_and_Environments_in_a_Technology_Management_Department","256528416_The_Hands-on_Activities_of_the_Programming_Microworld_objectKarel","256528153_Using_Hands-on_Activities_for_Motivating_Students_with_OOP_Concepts_Before_They_Are_Asked_to_Implement_Them","312915607_My_program_is_correct_but_it_doesn't_run_A_preliminary_investigation_of_novice_programmers'_problems","271452975_Partonomy_and_taxonomy_in_object-oriented_thinking","269200997_Enhancing_the_Explanatory_Power_of_Usability_Heuristics","266631434_Object-Oriented_Programming_-_What_do_Students_Think_of_Objects_and_Classes","250888371_Holistic_approach_to_learning_and_teaching_introductory_object-oriented_programming"]}