{"id":"280695744_Spin_and_Wind_Directions_I_Identifying_Entanglement_in_Nature_and_Cognition","abstract":"We performed a cognitive experiment in which we asked the participants to\npick a pair of directions they considered as the 'preferred good example of two\ndifferent wind directions'. The results of the experiment reveal that the\n'Clauser Horne Shimony Holt' (CHSH) form of Bell inequalities is violated. The\nviolation is significant and, amazingly enough, numerically almost equal to the\nviolation of the CHSH inequality in coincidence spin measurements on a compound\nsystem of two quantum particles in an entangled spin state. Hence, it seems as\nif the human mind selects probabilistically on wind directions and their\ndifference in the same way as Stern-Gerlach apparata select probabilistically\non spin directions and their difference. As in the quantum case, our violation\nreveals that entanglement systematically occurs in human cognition, and that\nnon-classical probabilistic structures of a quantum type are needed in the\nmodeling of cognitive processes. We support this result by presenting a quantum\ntheoretical model in Hilbert space, which exactly reproduces the collected data\nand further illustrates the analogies between quantum and cognitive entities.","authors":["Diederik Aerts","Sandro Sozzo"],"meta":["June 2018Foundations of Science 23(2)","DOI:10.1007/s10699-017-9528-9","SourcearXiv","Project: Identifying quantum structures in cognition and decision-making under uncertainty"],"references":["317356403_Spin_and_Wind_Directions_II_A_Bell_State_Quantum_Model","281144824_On_Contextuality_in_Behavioral_Data","275279950_The_Extended_Bloch_Representation_of_Quantum_Mechanics_Explaining_Superposition_Interference_and_Entanglement","267454471_The_Quantum_Nature_of_Identity_in_Human_Thought_Bose-Einstein_Statistics_for_Conceptual_Indistinguishability","323130140_On_the_Einstein_Podolsky_Rosen_paradox","285942923_Quantum_Models_of_Cognition_and_Decision","283274861_Loophole-free_Bell_inequality_violation_using_electron_spins_separated_by_13_kilometres","277023655_A_New_Fundamental_Evidence_of_Non-Classical_Structure_in_the_Combination_of_Natural_Concepts","270287393_Quantum_Structure_in_Cognition_and_the_Foundations_of_Human_Reasoning","264634868_Context_effects_produced_by_question_orders_reveal_quantum_nature_of_human_judgments"]}