{"id":"280647696_Experimental_analysis_of_an_asymmetrical_three-roll_bending_process","abstract":"The asymmetrical three-roll bending process is commonly used to manufacture cylindrical and conical sections from flat plates. The roll bending forces, the residual stresses, and the required roll bending power are influenced by material properties and process parameters, such as yield stress, plate thickness, curvature, and conicity for a truncated cone. In the present paper, an analytical model is developed to predict roll bending force, residual stresses, and power of roll bending process. To verify the developed model, asymmetrical three-roll bending experiments are performed. The results given by analytical model are in agreement with the experimental results. The analytical model has shown that an increase of the yield stress of material, or plate thickness or conicity requires more roll bending forces, roll bending power during roll bending process and results in residual stresses in the final shape. On other hand, an increase of the radius of bent shape requires less roll bending forces, less roll bending power, and results in less residual stresses in the final shape. Geometric verification of bent shapes has shown that when the yield stress, the thickness, or the conicity of the bent shape increases, the bent shape has less geometric defects. On the contrary, it was found that when the radius of curvature increases, the final shape has more geometric defects.","authors":["Jamel Salem","Henri Champliaud","Zhengkun Feng","Thien-My Dao"],"meta":["August 2015The International Journal of Advanced Manufacturing Technology 83(9-12)","DOI:10.1007/s00170-015-7678-x","Project: A hybrid hopfield neural networks based simulation approach for optimisation of manufacturing group scheduling"],"references":["313067661_PLATE_BENDING_THREE_ROLLS_AND_FOUR_ROLLS_COMPARED","286157249_Heat-assisted_roll-bending_process_dynamic_simulation","256203138_Simulation_of_pyramid_type_three-roll_bending_process","248252981_FEM_dynamic_simulation_and_analysis_of_the_roll-bending_process_for_forming_a_conical_tube","245096199_Theoretical_analysis_and_experimental_study_to_support_the_development_of_a_more_valuable_roll-bending_process","245095887_Continuous_four-roll_plate_bending_A_production_process_for_the_manufacture_of_single_seamed_tubes_of_large_and_medium_diameters","223438924_An_experimental_study_on_the_examination_of_springback_of_sheet_metals_with_several_thicknesses_and_properties_in_bending_dies","220674441_Modeling_and_simulation_of_asymmetrical_three-roll_bending_process","220674327_Numerical_study_of_non-kinematical_conical_bending_with_cylindrical_rolls"]}