{"id":"280695502_A_Three-Threshold_Learning_Rule_Approaches_the_Maximal_Capacity_of_Recurrent_Neural_Networks","abstract":"Understanding the theoretical foundations of how memories are encoded and\nretrieved in neural populations is a central challenge in neuroscience. A\npopular theoretical scenario for modeling memory function is the attractor\nneural network scenario, whose prototype is the Hopfield model. The model has a\npoor storage capacity, compared with the capacity achieved with perceptron\nlearning algorithms. Here, by transforming the perceptron learning rule, we\npresent an online learning rule for a recurrent neural network that achieves\nnear-maximal storage capacity without an explicit supervisory error signal,\nrelying only upon locally accessible information. The fully-connected network\nconsists of excitatory binary neurons with plastic recurrent connections and\nnon-plastic inhibitory feedback stabilizing the network dynamics; the memory\npatterns are presented online as strong afferent currents, producing a bimodal\ndistribution for the neuron synaptic inputs. Synapses corresponding to active\ninputs are modified as a function of the value of the local fields with respect\nto three thresholds. Above the highest threshold, and below the lowest\nthreshold, no plasticity occurs. In between these two thresholds,\npotentiation/depression occurs when the local field is above/below an\nintermediate threshold. We simulated and analyzed a network of binary neurons\nimplementing this rule and measured its storage capacity for different sizes of\nthe basins of attraction. The storage capacity obtained through numerical\nsimulations is shown to be close to the value predicted by analytical\ncalculations. We also measured the dependence of capacity on the strength of\nexternal inputs. Finally, we quantified the statistics of the resulting\nsynaptic connectivity matrix, and found that both the fraction of zero weight\nsynapses and the degree of symmetry of the weight matrix increase with the\nnumber of stored patterns.","authors":["Alireza Alemi","Carlo Baldassi","Nicolas Brunel","Riccardo Zecchina"],"meta":["August 2015PLoS Computational Biology 11(8)","DOI:10.1371/journal.pcbi.1004439","SourcearXiv"],"references":["313176595_Mnemonic_coding_of_visual_space_in_the_monkeys_dorsolateral_prefrontal_cortex","283617646_Storing_Infinite_Numbers_of_Patterns_in_a_Spin-Glass_Model_of_Neural_Networks","324110517_Theory_for_the_development_of_neuron_selectivity_orientation_specificity_and_binocular_interaction_in_visual_cortex","322050995_Priming-Induced_Shift_in_Synaptic_Plasticity_in_the_Rat_Hippocampus","304461206_A_theory_of_cerebellar_cortex","292215395_Neural_networks_and_physical_systems_with_emergent_collective_computational_abilities","283617666_Neuronal_correlate_of_visual_associative_long-term_memory_in_the_primate_temporal_cortex","283617626_Neural_networks_with_nonlinear_synapses_and_a_static_noise","283617623_Slow_stochastic_Hebbian_learning_of_classes_of_stimuli_in_a_recurrent_neural_network","283617404_Model_of_global_spontaneous_activity_and_local_structured_activity_during_delay_periods_in_the_cerebral_cortex"]}