{"id":"280646513_Signature-Free_Asynchronous_Binary_Byzantine_Consensus_with_tn3_On_Messages_and_O1_Expected_Time","abstract":"This article is on broadcast and agreement in asynchronous message-passing systems made up of n processes, and where up to t processes may have a Byzantine Behavior. Its first contribution is a powerful, yet simple, all-to-all broadcast communication abstraction suited to binary values. This abstraction, which copes with up to t < n/3 Byzantine processes, allows each process to broadcast a binary value, and obtain a set of values such that (1) no value broadcast only by Byzantine processes can belong to the set of a correct process, and (2) if the set obtained by a correct process contains a single value v, then the set obtained by any correct process contains v.\nThe second contribution of this article is a new round-based asynchronous consensus algorithm that copes with up to t < n/3 Byzantine processes. This algorithm is based on the previous binary broadcast abstraction and a weak common coin. In addition to being signature-free and optimal with respect to the value of t, this consensus algorithm has several noteworthy properties: the expected number of rounds to decide is constant; each round is composed of a constant number of communication steps and involves O(n2) messages; each message is composed of a round number plus a constant number of bits. Moreover, the algorithm tolerates message reordering by the adversary (i.e., the Byzantine processes).","authors":["Achour Mostéfaoui","Moumen Hamouma","Michel Raynal"],"meta":["December 2015Journal of the ACM 62(4)","DOI:10.1145/2785953"],"references":["300251139_Signature-free_Asynchronous_Byzantine_Systems_From_Multivalued_to_Binary_Consensus_with_tn3_On_Messages_and_Constant_Time","266659538_Signature-Free_Asynchronous_Byzantine_Consensus_with_tn3_and_On_Messages","321557576_Security_Protocols_8th_International_Workshop_Cambridge_UK_April_3-5_2000_Revised_Papers","312866070_On_the_Reduction_of_Atomic_Broadcast_to_Consensus_with_Byzantine_Faults","301742308_Signature-free_asynchronous_Byzantine_systems_from_multivalued_to_binary_consensus_with_tn3_On_messages_and_constant_time","277518584_From_Consensus_to_Atomic_Broadcast_Time-Free_Byzantine-Resistant_Protocols_without_Signatures","277296348_Distributed_Algorithms","274465929_Breaking_the_O_n_2_bit_barrier","267187282_Concurrent_Programming_Algorithms_Principles_and_Foundations","266958504_Proofs_from_THE_BOOK_Transl_from_the_English_by_Nicolas_Puech_3rd_ed"]}