{"id":"280684062_Proposta_de_uma_nova_aplicacao_como_instrumento_psicopedagogica_na_escola_o_LABGG_Laboratorio_GeoGebra","abstract":"Este artigo apresenta uma proposta usando o software GeoGebra, como instrumento\npsicopedagógico para o ensino nas escolas e universidades, com vista a promover a\naprendizagem significativa. As organizações escolares e os educadores têm vivenciado\num conjunto de desafios relativos ao processo ensino aprendizagem, em face do\nincremento, neste terceiro milênio, das novas tecnologias digitais, tais como:\nplaystation, internet, MP3, MP4, tablet, celulares de alta complexidade e demais\ntecnologias que movimentam e transformam o dia-a-dia empírico e científico dos\ncontextos educativos, mediante as redes sociais, as quais abarcam os mais diversos\nsetores da educação formal, não-formal e informal. Assim, evidencia-se uma\npreocupação pedagógica no que tange aos procedimentos de ensino aprendizagem. O\nestudo, por conseguinte, apresenta uma proposta de criação de um laboratório\nGeoGebra (LABGG) de ensino e aprendizagem, com vistas a uma intervenção\npsicopedagógica na abordagem construtivista. A proposta objetiva ser implementada e\nimplantada em contextos educativos diversificados nas organizações escolares formais e\nnão-formais, agregadas em núcleos, por meio do LABGG. A proposta se consolida no\npressuposto de que este software educativo promove ao aluno motivação e interesse\npelo ensino-aprendizagem da matemática e estatística, uma vez que os aprendizes\nparticipam das práticas educativas em sessões de laboratório.","authors":["Eimard Gomes Antunes Nascimento"],"meta":["November 2012","DOI:10.13140/RG.2.1.4098.0321","Conference: Conferencia Latinoamericana de GeoGebraAt: Montevideu, UruguayVolume: ISSN 2301-0185","Project: LABGG - LABORATÓRIO NO GEOGEBRA"],"references":["277233386_A_APRENDIZAGEM_DA_MATEMATICA_EM_AMBINETES_INFORMATIZADOS","226720932_Computer_Mediated_Learning_An_Example_of_an_Approach","49303773_Pedagogia_del_Oprimido"]}