{"id":"280732723_Creative_and_Computational_Thinking_in_the_Context_of_New_Literacies_Working_with_Teachers_to_Scaffold_Complex_Technology-Mediated_Approaches_to_Teaching_and_Learning","abstract":"For too long, creativity in schools has been almost solely associated with art, music, and writing classes. Now, creative thinking skills are increasingly emphasized across the disciplines. At the same time, technological progress has brought about calls for the integration of new literacies and computational thinking to prepare students as problem solvers and critical thinkers. However, in teaching and learning, all three perspectives most often manifest in isolation. We believe this is to the detriment of both educators and students alike.\n\nIn this paper, we develop an argument for the use of new literacies and computational thinking to promote creative thinking. First, we explore the various elements that comprise computational thinking, while demonstrating their overlap with the theoretical constructs of creative thinking. Second, we identify the design decisions that guided our plan for integrating all three perspectives in a sequence of educational technology courses designed for in-service teachers. Finally, we provide examples of the classroom activities that best facilitated creative thinking, and address how we achieved them.","authors":["Mike Deschryver","Aman Yadav"],"meta":["January 2015Journal of Information Technology for Teacher Education 23(3):411-431"],"references":["289834568_Rethinking_Technology_Creativity_in_the_21st_Century_Of_Art_Algorithms","281745474_IDEO's_culture_of_helping","281455017_On_Learning_to_Subvert_Signs_Literacy_Technology_and_the_TPACK_Framework","274309848_Computational_Thinking","329669657_Creative_People_Schools_of_Curious_Delight","318494467_Explaining_Creativity_The_Science_of_Human_Innovation","304716276_Learning_through_failure_The_strategy_of_small_losses","297184560_Structure_and_improvisation_in_creative_teaching","286056469_Pedagogic_Potentials_of_Multimodal_Literacy","275299831_Focus_on_Technology_Enhancing_Instruction_and_Communication_With_Twitter"]}