{"id":"280797591_Chaines_de_reference_et_variations_selon_le_genre","abstract":"Si les travaux portant sur la caractérisation globale des genres (cf. notamment les travaux d’Adam et Combettes pour le français ou de Biber & Conrad pour l’anglais notamment) s’accordent pour reconnaître que les expressions référentielles, tant au plan qualitatif (i.e. des catégories grammaticales représentées (noms et pronoms)) que quantitatif (leur présence plus ou moins forte ou la répartition entre noms vs pronoms), jouent, parmi d’autres traits linguistiques, un rôle important dans l’identification et la caractérisation des genres discursifs, ils ne prennent pas pour autant en compte l’agencement systématique de ces expressions référentielles et leur contribution à la composition des chaînes de référence (CR). Pourtant, certaines études ont démontré que le paramètre du genre d’occurrence des CR en conditionne la composition. C’est ce que nous illustrerons à partir d’un double corpus de textes non narratifs et sans personnage dominant, constitué de recettes de cuisine et d’introduction de textes encyclopédiques consacrés à la présentation de villes. Y est étudiée la composition des CR sur la base des nombre et catégorie des expressions référentielles, de leur coefficient de stabilité, de la longueur et de la portée des chaînes et la distance inter-maillonnaire.","authors":["Catherine Schnedecker"],"meta":["September 2014Langages 195(3):23","DOI:10.3917/lang.195.0023"],"references":["281659357_Vers_des_moteurs_de_recherche_intelligents_un_outil_de_detection_automatique_de_themes_Methode_basee_sur_l'identification_automatique_des_chaines_de_reference","250289214_Les_chaines_de_reference_dans_les_portraits_journalistiques_elements_de_description","250284006_Types_de_textes_ou_genres_de_discours_Comment_classer_les_textes_qui_disent_de_et_comment_faire","291161924_Register_Genre_and_Style","281802491_La_notion_de_saillance_problemes_definitoires_et_avatars","274809603_Language_Comprehension_as_Structure_Building","271249057_Topic_Continuity_in_Discourse_A_Quantitative_Cross-Language_Study","250284351_Essai_de_typologie_des_substituts_diaphoriques_Supports_d'une_anaphore_etou_d'une_cataphore","250283356_Linguistique_de_corpus_genres_textuels_temps_et_personnes","237577622_Entre_conseil_et_consigne_les_genres_de_l'incitation_a_l'action"]}