{"id":"280772877_Spatial_Search_by_Quantum_Walk_is_Optimal_for_Almost_all_Graphs","abstract":"The problem of finding a marked node in a graph can be solved by the spatial search algorithm based on continuous-time quantum walks (CTQW). However, this algorithm is known to run in optimal time only for a handful of graphs. In this work, we prove that for Erd\\\"os-Renyi random graphs, i.e.\\ graphs of $n$ vertices where each edge exists with probability $p$, search by CTQW is \\textit{almost surely} optimal as long as $p\\geq \\log^{3/2}(n)/n$. Consequently, we show that quantum spatial search is in fact optimal for \\emph{almost all} graphs, meaning that the fraction of graphs of $n$ vertices for which this optimality holds tends to one in the asymptotic limit. We obtain this result by proving that search is optimal on graphs where the ratio between the second largest and the largest eigenvalue is bounded by a constant smaller than 1. Finally, we show that we can extend our results on search to establish high fidelity quantum communication between two arbitrary nodes of a random network of interacting qubits, namely to perform quantum state transfer, as well as entanglement generation. Our work shows that quantum information tasks typically designed for structured systems retain performance in very disordered structures.","authors":["Shantanav Chakraborty","Leonardo Novo","Andris Ambainis","Yasser Omar"],"meta":["March 2016Physical Review Letters 116(10):100501","DOI:10.1103/PhysRevLett.116.100501","SourcearXiv"],"references":["269997921_Systematic_Dimensionality_Reduction_for_Quantum_Walks_Optimal_Spatial_Search_and_Transport_on_Non-Regular_Graphs","265966958_Connectivity_is_a_Poor_Indicator_of_Fast_Quantum_Search","260679735_Global_Symmetry_is_Unnecessary_for_Fast_Quantum_Search","258083843_Community_Detection_in_Quantum_Complex_Networks","237068815_Geometrical_effects_on_energy_transfer_in_disordered_open_quantum_systems","313609388_On_the_evolution_of_random_graphs","286097895_Random_Graphs","266927074_Graphical_enumeration_methods","264920260_Networks_An_Introduction","237005349_On_Random_Graphs"]}