{"id":"280757583_Highly_optimized_tolerance_A_mechanism_for_power_laws_in_designed_systems","abstract":"We introduce a mechanism for generating power law distributions, referred to as highly optimized tolerance (HOT), which is motivated by biological organisms and advanced engineering technologies. Our focus is on systems which are optimized, either through natural selection or engineering design, to provide robust performance despite uncertain environments. We suggest that power laws in these systems are due to tradeoffs between yield, cost of resources, and tolerance to risks. These tradeoffs lead to highly optimized designs that allow for occasional large events. We investigate the mechanism in the context of percolation and sand pile models in order to emphasize the sharp contrasts between HOT and self-organized criticality (SOC), which has been widely suggested as the origin for power laws in complex systems. Like SOC, HOT produces power laws. However, compared to SOC, HOT states exist for densities which are higher than the critical density, and the power laws are not restricted to special values of the density. The characteristic features of HOT systems include: (1) high efficiency, performance, and robustness to designed-for uncertainties; (2) hypersensitivity to design flaws and unanticipated perturbations; (3) nongeneric, specialized, structured configurations; and (4) power laws. The first three of these are in contrast to the traditional hallmarks of criticality, and are obtained by simply adding the element of design to percolation and sand pile models, which completely changes their characteristics.","authors":["J.M. Carlson","John Doyle"],"meta":["July 1999Physical review A, Atomic, molecular, and optical physics 60(2):1412-1427"],"references":["242879793_Ecology_Be_diverse_be_predictable","223130325_The_Fractal_Geometry_of_Nature","37694134_Complexity_Life_at_the_Edge_of_Chaos","21598791_Neurotoxicity_of_levodopa_on_catecholamine-rich_neurons","13327950_Fluctuations_in_self-organizing_systems"]}