{"id":"280752049_Execution_of_Heterogeneous_Models_for_Thermal_Analysis_with_a_Multi-view_Approach","abstract":"To deal with the high complexity of embedded systems, engineers rely on high-level heterogeneous models that combine functional and non-functional aspects, hardware/software artifacts, structural and behavioral descriptions. PRISMSYS is a system-level multi-view modeling framework, which provides a means to specify functional and non-functional aspects in interrelated views. Each concern/view is addressed separately with a dedicated set of models and correspondence rules, maintaining the semantic consistency between those different views. The behavioral specification mixes UML state machines with equational models defined as SYSML parametric diagrams. To supply a complete non-functional property-aware simulation environment, it is mandatory to formalize 1) the execution semantics of the UML state machines, 2) the SYSML parametric diagrams and 3) the coordination between them. This is achieved by using CCSL, the Clock Constraint Specification Language, to provide an event-based semantics for each model and their coordination. The proposed co-simulation framework combines TIMESQUARE, a discrete event simulator for CCSL, and Scilab, a tool for numerical computation. The framework is illustrated on a CPU thermal manager case study with a joint simulation of both its functional and non-functional models.","authors":["Amani Khecharem","Carlos Gomez","Julien Deantoni","Frédéric Mallet"],"meta":["October 2014","DOI:10.1109/FDL.2014.7119366","Conference: International Forum on Specification and Design LanguagesAt: Munich, Germany"],"references":["288492321_Cheddar_A_Flexible_Real_Time_Scheduling_Framework","281599022_Component-based_Modeling_of_Heterogeneous_Real-time_Systems_in_BIP","281159522_ECL_the_Event_Constraint_Language_an_Extension_of_OCL_with_Events","257721040_Hybrid_MARTE_statecharts","243788169_HotSpot_A_compact_thermal_modeling_methodology_for_early-stage_VLSI_design","321621256_Thermal_and_Power_Management_of_Integrated_Circuits","285402499_OMG_Systems_Modeling_Language_OMG_SysML_Tutorial","262371102_Zelus_A_Synchronous_Language_with_ODEs","258885511_Power_consumption_analysis_using_multi-view_modeling","243786417_Modeling_Embedded_Systems_and_SoCs-Concurrency_and_Time_in_Models_of_Computation"]}