{"id":"280812830_Je_veux_dire_est-il_toujours_une_marque_de_reformulation","abstract":"À travers l'examen des corpus choisis pour l'étude , on a pu fonder l'hypothèse qu'il y avait plusieurs sortes de je veux dire ; après avoir d'abord présenté les propriétés syntaxiques spécifiques des différents types, on cherchera à démontrer que les statuts syntaxiques permettent de projeter des valeurs discriminant je veux dire, aussi sur le plan pragmatique. \nDeux statuts syntaxiques de je veux dire qui ont été repérés, verbes « Recteurs Faibles » (Blanche Benveniste, 1989), et « Parenthèses » (la construction est un noyau qui semble s'insérer « librement » dans l'énoncé), semblent fournir la même valeur pragmatique : on peut les paraphraser par autrement dit, c'est-à-dire, je reprends... :\nL2 ouais ben ça te fait un charme je veux dire [= autrement dit/ c'est-à-dire] quelqu'un qui a un accent c'est quelque part c'est un peu un charme + (Corpaix. 1Accent) RECTEUR FAIBLE\n+ et cet élément était encore euh je veux dire [= je reprends] était un peu + délimité + par des sculptures qui étaient faites sur des fûts de + d'essence des gros fûts + (CRFP. PRI-BEL-1) PARENTHESE\nUn dernier type, assimilable à une Particule Discursive, ne peut plus être paraphrasé par autrement dit, je reprends etc. mais serait plutôt proche du I say anglais, comme dans its a good guy I say :\nmais on était d'accord sur une seule chose c'est qu'on déteste ce monde et cette société où tout le monde doit être d'accord on ne sait même pas sur quoi je veux dire [= ?] (Corpaix. MasquePC) PARTICULE DISCURSIVE (PDI)\nLes résultats, qui doivent être vérifiés sur d'autres corpus, ont montré que les valeurs pragmatiques sont prévisibles : reformulation ou valeurs instructionnelles hétérogènes, elles correspondent à certains fonctionnements syntaxiques précis. \n\nRéférences \nBlanche-Benveniste, C., (1989): Constructions verbales «en incise» et rection faible des verbes. In: Recherches sur le français parlé 9, 53-73.\nBlanche-Benveniste, C., et al, (1990), Le Français Parlé, Etudes Grammaticales, Paris : CNRS Editions","authors":["Teston-Bonnard Sandra"],"meta":["January 2008"],"references":[]}