{"id":"280852609_Improving_Key_Recovery_to_784_and_799_Rounds_of_Trivium_Using_Optimized_Cube_Attacks","abstract":"Dinur and Shamir have described cube attacks at EUROCRYPT ’09 and they have shown how efficient they are on the stream cipher Trivium up to 767 rounds. These attacks have been extended to distinguishers but since this seminal work, no better results on the complexity of key recovery attacks on Trivium have been presented. It appears that the time complexity to compute cubes is expensive and the discovery of linear superpoly also requires the computation of many cubes. In this paper, we increase the number of attacked initialization rounds by improving the time complexity of computing cube and we show attacks that go beyond this bound. We were able to find linear superpoly up to 784 rounds, which leads to an attack requiring \\(2^{39}\\) queries. Using quadratic superpoly, we were also able to provide another attack up to 799 rounds which complexity is \\(2^{40}\\) queries and \\(2^{62}\\) for the exhaustive search part. To achieve such results, we find a way to reduce the density of the polynomials, we look for quadratic relations and we extensively use the Moebius transform to speed up computations for various purposes.","authors":["Pierre-Alain Fouque","Thomas Vannet"],"meta":["March 2013","DOI:10.1007/978-3-662-43933-3_26","Conference: International Workshop on Fast Software Encryption"],"references":["225134981_Testing_Low-Degree_Polynomials_over_GF2","220333772_The_Cube_Attack_on_Stream_Cipher_Trivium_and_Quadraticity_Tests","220333050_Breaking_ONEFIVIUM_by_AIDA_an_Algebraic_IV_Differential_Attack","268719984_Algorithmic_Cryptanalysis","225925972_Cube_Attacks_on_Tweakable_Black_Box_Polynomials","221327032_Conditional_Differential_Cryptanalysis_of_NLFSR-Based_Cryptosystems","220942351_Breaking_Grain-128_with_Dynamic_Cube_Attacks","220905129_Trivium_A_Stream_Cipher_Construction_Inspired_by_Block_Cipher_Design_Principles","220333456_Cube_Attacks_on_Tweakable_Black_Box_Polynomials","45929491_The_Complexity_of_Testing_Monomials_in_Multivariate_Polynomials"]}