{"id":"280852131_Describing_and_Generating_Solutions_for_the_EDF_Unit_Commitment_Problem_with_the_ModelSeeker","abstract":"We present an application to extract and solve constraint models from sample solutions of the Unit Commitment Problem of EDF, which computes the power output for each power plant in France as a 48 hour time series. Our aim is to describe and automatically generate the plant-specific model constraints common to the optimal solutions obtained over multiple days. The proposed system generates specific domains for each variable (i.e., time slot), binary constraints between consecutive time slots, and global constraints with functional dependencies over the entire time series. We employ time series clustering techniques for finding stronger constraints and we identify plant-specific time intervals, for which we add additional global constraints. A custom search routine and the generated models allow us to produce solutions corresponding to many overlapping global constraints. Our tool is based on the ModelSeeker [4], but specializes and extends that system for this specific application domain. Results indicate that useful models can be generated with this process.","authors":["Nicolas Beldiceanu","Georgiana Ifrim","Arnaud Lenoir","Helmut Simonis"],"meta":["September 2013","DOI:10.1007/978-3-642-40627-0_54","Conference: International Conference on Principles and Practice of Constraint Programming","Project: Energy Efficiency Applications"],"references":["263047826_The_short-term_electricity_production_management_problem_at_EDF","257551775_On_the_Reification_of_Global_Constraints","221633262_Deriving_Filtering_Algorithms_from_Constraint_Checkers","221353466_Modeling_the_Regular_Constraint_with_Integer_Programming","221112513_A_SAT-Based_Version_Space_Algorithm_for_Acquiring_Constraint_Satisfaction_Problems","281328397_Building_global_constraint_models_from_positive_examples","271560127_A_MIQCP_formulation_to_solve_the_unit_commitment_problem_for_large-scale_power_systems","262241189_A_Model_Seeker_Extracting_Global_Constraint_Models_From_Positive_Examples","251283327_Latest_Improvements_of_EDF_Midterm_Power_Generation_Management","242358078_The_Elements_Of_Statistical_Learning"]}