{"id":"280947821_Distance_mean-regular_graphs","abstract":"We introduce the concept of distance mean-regular graph, which can be seen as a generalization of both vertex-transitive and distance-regular graphs. Let Γ be a graph with vertex set V , diameter D, adjacency matrix A, and adjacency algebra A. Then, Γ is distance mean-regular when, for a given u ∈ V , the averages of the intersection numbers p h ij (u, v) = |Γ i (u) ∩ Γ j (v)| (number of vertices at distance i from u and distance j from v) computed over all vertices v at a given distance h ∈ {0, 1,. .. , D} from u, do not depend on u. In this work we study some properties and characterizations of these graphs. For instance, it is shown that a distance mean-regular graph is always distance degree-regular, and we give a condition for the converse to be also true. Some algebraic and spectral properties of distance mean-regular graphs are also investigated. We show that, for distance mean regular-graphs, the role of the distance matrices of distance-regular graphs is played for the so-called distance mean-regular matrices. These matrices are computed from a sequence of orthogonal polynomials evaluated at the adjacency matrix of Γ and, hence, they generate a subalgebra of A. Some other algebras associated to distance mean-regular graphs are also characterized.","authors":["Víctor Diego","Miquel Angel Fiol"],"meta":["July 2017Designs Codes and Cryptography","DOI:10.1007/s10623-016-0208-5"],"references":["267338803_Distance-regular_graphs","265439384_Interlacing_eigenvalues_and_graphs","261672889_Some_Spectral_and_Quasi-Spectral_Characterizations_of_Distance-Regular_Graphs","327606600_Algebraic_Combinatorics","275501784_Distance_Regular_Graphs","266214121_Intersection_matrices_for_linear_graphs","262984338_Some_Spectral_and_Quasi-Spectral_Characterizations_of_Distance-Regular_Graphs","245241899_Algebraic_Combinatorics_Chapman_and_Hall","239059934_Algebraic_Combinatorics_I_Association_Schemes","233932988_Distance-Regular_Graphs","233932955_Spectra_of_Graphs","228740252_Some_families_of_orthogonal_polynomials_of_a_discrete_variable_and_their_applications_to_graphs_and_codes_Electron","225098747_Eigenvalue_interlacing_and_weight_parameters_of_graphs","225045779_Pseudo-distance-regularised_graphs_are_distance-regular_or_distance-biregular","221932947_Algebraic_Graph_Theory"]}