{"id":"280933037_The_Role_Of_Citation_Context_In_Predicting_Long-Term_Citation_Profiles_An_Experimental_Study_Based_On_A_Massive_Bibliographic_Text_Dataset","abstract":"The impact and significance of a scientific publication is measured mostly by the number of citations it accumulates over the years. Early prediction of the citation profile of research articles is a significant as well as challenging problem. In this paper, we argue that features gathered from the citation contexts of the research papers can be very relevant for citation prediction. Analyzing a massive dataset of nearly 1.5 million computer science articles and more than 26 million citation contexts, we show that average countX (number of times a paper is cited within the same article) and average citeWords (number of words within the citation context) discriminate between various citation ranges as well as citation categories. We use these features in a stratified learning framework for future citation prediction. Experimental results show that the proposed model significantly outperforms the existing citation prediction models by a margin of 8-10% on an average under various experimental settings. Specifically, the features derived from the citation context help in predicting long-term citation behavior.","authors":["Mayank Singh","Vikas Patidar","Suhansanu Kumar","Tanmoy Chakraborty"],"meta":["October 2015","DOI:10.1145/2806416.2806566","Conference: 24th ACM Conference on Information and Knowledge Management (CIKM)At: Melbourne, Australia"],"references":["274012408_On_the_Categorization_of_Scientific_Citation_Profiles_in_Computer_Science","257350831_Quantifying_Long-Term_Scientific_Impact","308048640_Thirteen_ways_to_look_at_the_correlation_coefficient","297262926_An_R-squared_measure_of_goodness_of_fit_for_some_common_nonlinear_regression_models","290013230_Predictive_ranking_of_computer_scientists_using_CiteSeer_data","286508344_Citation_Prediction_in_Heterogeneous_Bibliographic_Networks","284723640_Predicting_Citation_Counts_for_Academic_Literature_Using_Graph_Pattern_Mining","274645046_The_Child_is_Father_of_the_Man_Foresee_the_Success_at_the_Early_Stage","270271383_Towards_a_Stratified_Learning_Approach_to_Predict_Future_Citation_Counts","254006037_To_better_stand_on_the_shoulder_of_giants"]}