{"id":"280989685_Extraction_automatique_et_types_de_nEologismes_Une_nEcessaire_clarification","abstract":"It is commonly assumed to be more difficult to extract semantic than formal neologisms. This assumption is however only partly true. It turns out that the facts are more complex, the main reason being the tendency to oversimplify the criteria of identification, whereby any \"new\" meaning of an existing form is ipso facto taken to be a semantic neologism. The first step in identification should be to make sure that lexical units extracted as semantic neologisms are indeed neologisms, and thereby to rule out changes in meaning resulting from what Meillet (1905-1906) called the discontinuity of the transmission of language, as well as catachresis, so-called figurative usages which have long been lexicalised. It is also necessary to be sure that those genuine neologisms which are extracted are indeed of a semantic nature and not attributable to other matrices. This means that the following categories should be excluded: formal homonymy, purely syntactic neologism, lexicalisation of noun or verb phrases, changes in set phrases... Genuine semantic neologisms are either syntactico-semantic innovations (conversion, combinatory changes) or figurative usages (various types of metaphors, metonymies or other figures of speech, with or without antonomasia). Distortion in selecting arguments by predicates, changes in status (actualizing a predicate.) are just so many ways which according to object class theory make it possible to identify semantic neology, but (semi-)automatic extraction still poses several types of problems.","authors":["Jean-François Sablayrolles"],"meta":["January 2012","DOI:10.15122/isbn.978-2-8124-4l47-9.p.0037"],"references":["280954752_Neologismes_dictionnaires_et_informatique","324556614_Les_palimpsestes_verbaux_des_revelateurs_culturels_remarquables_mais_peu_remarques","302012658_Neologie_et_dictionnaires_comme_corpus_d'exclusion","301587925_Neologisme_homonymique_neologisme_polysemique_et_evolution_de_sens_Pour_une_restriction_de_la_neologie_semantique","287150531_Etiquetage_semantique_des_textes_etats_des_lieux_elements_de_modelisation","287149518_Les_predicats_partages_entre_categorisation_et_inference_lexicale","281694319_La_notion_d'emploi_dans_le_traitement_automatique","269428541_Precis_de_semantique_francaise","250283948_Introduction_aux_classes_d'objets","239667427_Classes_d'objets_et_description_des_verbes"]}