{"id":"280945591_Flipping_a_College_Calculus_Course_A_Case_Study","abstract":"As online videos have become more easily available and more attractive to the new generation of students, and as new student-learning approaches tend to have more technology integration, the flipped classroom model has become very popular. The purpose of this study was to understand college students’ views on flipped courses and investigate how the flipping affects their achievement in mathematics. We also studied how college students prepared for flipped classroom sections. Finally, college students’ views were analyzed to see what they think about flipping in terms of benefits and preparation. Participants were 96 college students consisting of mostly freshmen & sophomores. We utilized descriptive statistics and paired t-test to analyze the data. Descriptive statistics revealed that participants preferred watching flip class videos (44%) over reading the sections from the textbook (17%) for preparation. Dependent t-test results showed that there is a statistically significant difference between students’ average quiz scores from non-flipped sections and flipped sections. Students achieved significantly higher quiz scores in flipped sections than non-flipped ones. Overall, most of the students (83%) stated that flipped-taught lessons prepared them better.","authors":["Alpaslan Sahin","Baki Cavlazoglu","Yunus E. Zeytuncu"],"meta":["June 2015Educational Technology & Society 18(3):142-152"],"references":["294280631_Why_University_Students_Don't_Read_What_Professors_Can_Do_To_Increase_Compliance","264860703_Case_Studies_and_the_Flipped_Classroom","260201119_Flipping_the_classroom_to_explore_active_learning_in_a_large_undergraduate_course","254359801_Scaffolded_Inquiry-Based_Instruction_with_Technology_A_Signature_Pedagogy_for_STEM_Education","235676133_Evaluating_the_Use_of_Problem-Based_Video_Podcasts_to_Teach_Mathematics_in_Higher_Education","345924291_Flipping_The_Classroom_To_Explore_Active_Learning_In_A_Large_Undergraduate_Course","313744503_Academically_Adrift_Limited_Learning_on_College_Campuses","285683322_Upside_down_and_inside_out_Flip_your_classroom_to_improve_student_learning","284943864_Flipping_your_classroom","266868120_Classifying_K-12_Blended_learning"]}