{"id":"280969915_On_the_advantages_of_using_relative_phase_Toffolis_with_an_application_to_multiple_control_Toffoli_optimization","abstract":"Various implementations of the Toffoli gate up to a relative phase have been\nknown for years. The advantage over regular Toffoli gate is their smaller\ncircuit size. However, their use has been often limited to a demonstration of\nquantum control in designs such as those where the Toffoli gate is being\napplied last or otherwise for some specific reasons the relative phase does not\nmatter. It has been furthermore believed by many that the relative phase\ndeviations would prevent the relative phase Toffolis from being very helpful in\npractical large-scale designs.\nIn this paper, we report three circuit identities that provide the means for\nreplacing multiple control Toffoli gates with their simpler relative phase\nimplementations, up to a selectable unitary on certain qubits, and without\nchanging the overall functionality. We illustrate the advantage via applying\nthose identities to the optimization of the known circuits implementing\nmultiple control Toffoli gates, and report the reductions in the CNOT-count,\nT-count, as well as the number of ancillae used. We suggest that a further\nstudy of the relative phase Toffoli implementations and their use may yield\nother optimizations.","authors":["Dmitri Maslov"],"meta":["August 2015","DOI:10.1103/PhysRevA.93.022311","SourcearXiv"],"references":["3226294_Quantum_Circuit_Simplification_and_Level_Compaction","2201176_Elementary_gates_for_quantum_computation","2191910_The_simplified_Toffoli_gate_implementation_by_Margolus_is_optimal","292136813_Universal_quantum_computation_with_ideal_Clifford_gates_and_noisy_ancillas","235892141_Polynomial-Time_T-Depth_Optimization_of_CliffordT_Circuits_Via_Matroid_Partitioning","235885711_Superconducting_Circuits_for_Quantum_Information_An_Outlook","235885710_Scaling_the_Ion_Trap_Quantum_Processor","231582352_Quantum_circuits_of_T-depth_one","2203372_Quantum_Computation_with_Ions_in_Thermal_Motion","2192340_Universal_quantum_computation_with_ideal_Clifford_gates_and_noisy_ancillas"]}