{"id":"281084430_Predicting_Grades","abstract":"To increase efficacy in traditional classroom courses as well as in Massive\nOpen Online Courses (MOOCs), automated systems supporting the instructor are\nneeded. One important problem is to automatically detect students that are\ngoing to do poorly in a course early enough to be able to take remedial\nactions. Existing grade prediction systems focus on maximizing the accuracy of\nthe prediction while overseeing the importance of issuing timely and\npersonalized predictions. This paper proposes an algorithm that predicts the\nfinal grade of each student in a class. It issues a prediction for each student\nindividually, when the expected accuracy of the prediction is sufficient. The\nalgorithm learns online what is the optimal prediction and time to issue a\nprediction based on past history of students' performance in a course. We\nderive a confidence estimate for the prediction accuracy and demonstrate the\nperformance of our algorithm on a dataset obtained based on the performance of\napproximately 700 UCLA undergraduate students who have taken an introductory\ndigital signal processing over the past 7 years. We demonstrate that for 85% of\nthe students we can predict with 76% accuracy whether they are going do well or\npoorly in the class after the 4th course week. Using data obtained from a pilot\ncourse, our methodology suggests that it is effective to perform early in-class\nassessments such as quizzes, which result in timely performance prediction for\neach student, thereby enabling timely interventions by the instructor (at the\nstudent or class level) when necessary.","authors":["Yannick Meier","Jie Xu","Onur Atan","Mihaela van der Schaar"],"meta":["August 2015IEEE Transactions on Signal Processing 64(4)","DOI:10.1109/TSP.2015.2496278","SourcearXiv","Project: use of waste marble additives in asphalt mixtures"],"references":["284379318_Classification_via_clustering_for_predicting_final_marks_based_on_student_participation_in_forums","262982382_Lq_Sparsity_Penalized_Linear_Regression_With_Cyclic_Descent","256349328_A_promising_classification_method_for_predicting_distance_students'_performance","313657280_Data_mining_algorithms_to_classify_students","308845579_MOOC_performance_prediction_via_clickstream_data_and_social_learning_networks","308808338_eTutor_Online_learning_for_personalized_education","268155708_Incentive_Design_in_Peer_Review_Rating_and_Repeated_Endogenous_Matching","266913198_eTutor_Online_Learning_for_Personalized_Education","260466566_Nearest-Neighbor_Distributed_Learning_by_Ordered_Transmissions","257171482_Predicting_student_academic_performance_in_an_engineering_dynamics_course_A_comparison_of_four_types_of_predictive_mathematical_models"]}