{"id":"281084615_Exact_Algorithms_for_Linear_Matrix_Inequalities","abstract":"Let $A(x) = A_0 + x_1 A_1+ \\cdots +x_nA_n$ be a linear matrix, or pencil,\ngenerated by given symmetric matrices A0, A1, ... An of size m with rational\nentries. The set of real vectors x such that the pencil is positive\nsemidefinite is a convex semi-algebraic set called spectrahedron, described by\na linear matrix inequality (LMI). We design an exact algorithm that, up to\ngenericity assumptions on the input matrices, computes an exact algebraic\nrepresentation of at least one point in the spectrahedron, or decides that it\nis empty. The algorithm does not assume the existence of an interior point, and\nthe computed point minimizes the rank of the pencil on the spectrahedron. The\ndegree d of the algebraic representation of the point coincides experimentally\nwith the algebraic degree of a generic semidefinite program associated to the\npencil. We provide explicit bounds for the complexity of our algorithm, proving\nthat the maximum number of arithmetic operations that are performed is\nessentially quadratic in a multilinear Bezout bound of d. When the size m of\nthe pencil is fixed, such a bound, and hence the complexity, is polynomial in\nn, the number of variables. We conclude by providing results of experiments\nshowing practical improvements with respect to state-of-the-art computer\nalgebra algorithms.","authors":["Didier Henrion","Simone Naldi","Mohab Safey El Din"],"meta":["August 2015SIAM Journal on Optimization 26(4)","DOI:10.1137/15M1036543","SourcearXiv"],"references":["278969296_Real_root_finding_for_low_rank_linear_matrices","321516067_Algorithms_in_Real_Algebraic_Geometry","311536774_A_polyhedral_method_for_solving_sparse_polynomial_systems","309701573_A_Nearly_Optimal_Algorithm_for_Deciding_Connectivity_Queries_in_Smooth_and_Bounded_Real_Algebraic_Sets","308353423_Linear_matrix_inequalities_in_system_and_control_theory","305387411_Semidefinite_optimization","301866772_Semidefinite_geometry_of_the_numerical_range","285688992_Semidefinite_programming","282519383_An_OleftsqrtnLright_wide_neighborhood_interior-point_algorithm_for_semidefinite_optimization","278659142_Stability_and_Stabilization_of_Linear_Systems_With_Saturating_Actuators"]}