{"id":"281065987_Logic-Based_Modeling_Approaches_for_Qualitative_and_Hybrid_Reasoning_in_Dynamic_Spatial_Systems","abstract":"Autonomous agents that operate as components of dynamic spatial systems are becoming increasingly popular and mainstream. Applications can be found in consumer robotics, in road, rail, and air transportation, manufacturing, and military operations. Unfortunately, the approaches to modeling and analyzing the behavior of dynamic spatial systems are just as diverse as these application domains. In this article, we discuss reasoning approaches for the medium-term control of autonomous agents in dynamic spatial systems, which requires a sufficiently detailed description of the agent’s behavior and environment but may still be conducted in a qualitative manner. We survey logic-based qualitative and hybrid modeling and commonsense reasoning approaches with respect to their features for describing and analyzing dynamic spatial systems in general, and the actions of autonomous agents operating therein in particular. We introduce a conceptual reference model, which summarizes the current understanding of the characteristics of dynamic spatial systems based on a catalog of evaluation criteria derived from the model. We assess the modeling features provided by logic-based qualitative commonsense and hybrid approaches for projection, planning, simulation, and verification of dynamic spatial systems. We provide a comparative summary of the modeling features, discuss lessons learned, and introduce a research roadmap for integrating different approaches of dynamic spatial system analysis to achieve coverage of all required features.","authors":["Stefan Mitsch","André Platzer","Werner Retschitzegger","Wieland Schwinger"],"meta":["August 2015ACM Computing Surveys 48(1)","DOI:10.1145/2764901"],"references":["312747215_A_Hierarchy_of_Proof_Rules_for_Checking_Differential_Invariance_of_Algebraic_Sets","306425325_ModelPlex_Verified_Runtime_Validation_of_Verified_Cyber-Physical_System_Models","336941993_Double-Crossing_Decidability_and_Computational_Complexity_of_a_Qualitative_Calculus_for_Navigation","331926653_Principles_of_Robot_Motion_Theory_Algorithms_and_Implementation","329645603_Knowledge_in_Action_Logical_Foundations_for_Specifying_and_Implementing_Dynamical_Systems","321525659_First-Order_Modal_Logic","315498811_Event-Triggered_and_Time-Triggered_Control_Paradigms","315496455_Duration_Calculus","312461679_Using_orientation_information_for_qualitative_spatial_reasoning_theories_and_methods_of_spatio-temporal_reasoning_in_geographic_space","312435057_Situations_and_Attitudes"]}