{"id":"281062801_A_Type-2_Fuzzy_Logic_Recommendation_System_for_Adaptive_Teaching","abstract":"E-learning platforms facilitate the interaction between students and instructors while mitigating temporal or spatial constraints. Nevertheless, such platforms require measuring the degree of students' engagement with the delivered course content and teaching style. Such information is highly valuable for evaluating the quality of the teaching and altering the teaching delivery style in massively crowded online learning platforms. When the number of learners is high, it is essential to attain overall engagement and feedback, yet doing so is highly challenging due to the high levels of uncertainties related to students and the learning context. To handle these uncertainties more robustly, we present a method based on type-2 fuzzy logic utilizing visual RGB-D features, including head pose direction and facial expressions captured from Kinect v2, a low-cost but robust 3D camera, to measure the engagement degree of students in both remote and on-site education. This system augments another self-learning type-2 fuzzy logic system that helps teachers with recommendations of how to adaptively vary their teaching methods to suit the level of students and enhance their instruction delivery. This proposed dynamic e-learning environment integrates both on-site and distance students as well as teachers who instruct both groups of students. The rules are learned from the students' and teachers' learning/teaching behaviors, and the system is continuously updated to give the teacher the ability to adapt the delivery approach to varied learners' engagement levels. The efficiency of the proposed system has been tested through various real-world experiments in the University of Essex iClassroom among a group of thirty students and six teachers. These experiments demonstrate the capabilities-compared to type-1 fuzzy systems and non-adaptive systems-of the proposed interval type-2 fuzzy logic-based system to handle the uncertainties and improve average learners' motivations to engage during learning.","authors":["Khalid Almohammadi","Hani Hagras","Bo Yao","Abdulkareem Alzahrani"],"meta":["February 2017Soft Computing 21(4):965-979","DOI:10.1007/s00500-015-1826-y","Project: CPIT100 iTutor: Computer Skills Unit - Faculty of Computing and Information Technology - King Abdulaziz University"],"references":["287889365_Adaptive_Educational_Systems","266461437_Towards_Sensor-Free_Affect_Detection_in_Cognitive_Tutor_Algebra","262215461_An_Interval_Type-2_Fuzzy_Logic_Based_System_for_Customised_Knowledge_Delivery_within_Pervasive_E-Learning_Platforms","286723646_What_pre-service_teachers_need_to_know_to_be_effective_at_values-based_education","286585338_An_interval_type-2_fuzzy_logic_based_system_with_user_engagement_feedback_for_customized_knowledge_delivery_within_intelligent_E-learning_platforms","273296974_Physiological_Responses_to_Events_during_Training_Use_of_Skin_Conductance_to_Inform_Future_Adaptive_Learning_Systems","269829894_Beyond_marks_New_tools_to_visualise_student_engagement_via_social_networks","269295352_Analysis_and_modeling_of_next_speaking_start_timing_based_on_gaze_behavior_in_multi-party_meetings","266657570_iShadow_Design_of_a_Wearable_Real-Time_Mobile_Gaze_Tracker","264477172_E-Learning_and_the_Science_of_Instruction_Proven_Guidelines_for_Consumers_and_Designers_of_Multimedia_Learning"]}