{"id":"281014547_Sampling_interpolation_and_detection_Applications_in_satellite_imaging","abstract":"This thesis deals with a few of the many issues that arise in the design of a complete computer vision system, from sampling and interpolation, to feature detection and interpretation. The main motivation for addressing these topics was provided by the French center of space studies (CNES), and the design of earth observation satellites, as well as photogrammetry applications and video-surveillance applications at Cognitech Inc.during the final stages of this work, but most subjects are treated with sufficient generality to be of interest for other computer vision systems. In a first part we perform a comparative study of different sampling systems on, a regular grid, which can be either square or hexagonal. We do so by means of an effective resolution measure, which allows to determine the mean amount of useful information contained in each pixel, once the noise and aliasing effects have been discarded. This resolution measure is used to improve the zoom and restoration methods based on total variation minimization. Next the comparative study is continued by analyzing to what an extent each sampling system allows to undo the perturbations of the sampling grid due to the satellite micro-vibrations during image acquisition. After a review of the theoretical limits of this reconstruction problem, we compare the performance of available reconstruction methods with a new one, which is better adapted to the sampling conditions of CNES's systems. In a second part we address the interpolation of digital terrain modelsin two partocular cases: the interpolation of level curves, and of those regions where a stereo-pair correlation method failed to provide a reliable height information. We study the links of classical methods used in the geoscience literature, such as Kriging and geodesic distance, with the AMLE method, and we propose and extension of the axiomatic interpolation theory leading to the latter. Finally, an experimental evaluation allows us to conclude that a new combination of Kriging and AMLE provides in general better interpolations for terrain models. At last we consider the automatic detection of alignments and their vanishing points in digital images. Since they can be used both for constructing elevation models in urban areas, and for solving photogrammetry and camera calibration problems. Our approach is based on Gestalt theory and its computational implementation recently proposed by Desolneux-Moisan-Morel using the Helmholtz principle. The result is a parameterless vanishing point detector which doesn't require any a priori information about the image or the camera calibration parameters.","authors":["Andrés Almansa"],"meta":["December 2002"],"references":[]}