{"id":"281081141_Real-Time_Patient-Specific_ECG_Classification_by_1D_Convolutional_Neural_Networks","abstract":"This paper presents a fast and accurate patient-specific electrocardiogram (ECG) classification and monitoring system.\nAn adaptive implementation of 1D Convolutional Neural Networks (CNNs) is inherently used to fuse the two major blocks of the ECG classification into a single learning body: feature extraction and classification. Therefore, for each patient an individual and simple CNN will be trained by using relatively small common and patient-specific training data, and thus such a patient-specific feature extraction ability can further improve the classification performance. Since this also negates the necessity to extract hand-crafted manual features, once a dedicated CNN is trained for a particular patient, it can solely be used to classify possibly long ECG data stream in a fast and accurate manner or alternatively, such a solution can conveniently be used for real-time ECG monitoring and early alert system on a light-weight wearable device.\nThe results over the MIT-BIH arrhythmia benchmark database demonstrate that the proposed solution achieves a superior classification performance than most of the state-of-the-art methods for the detection of ventricular ectopic beats (VEB) and supraventricular ectopic beats (SVEB).\nBesides the speed and computational efficiency achieved, once a dedicated CNN is trained for an individual patient, it can solely be used to classify his/her long ECG records such as Holter registers in a fast and accurate manner.\nDue to its simple and parameter invariant nature, the proposed system is highly generic and thus applicable to any ECG dataset.","authors":["Serkan Kiranyaz","Turker Ince","Moncef Gabbouj"],"meta":["August 2015IEEE transactions on bio-medical engineering 63(3)","DOI:10.1109/TBME.2015.2468589","SourcePubMed","Project: We are now working on machine learning and pattern recognition for big media data analytics."],"references":["255992272_Multidimensional_Particle_Swarm_Optimization_for_Machine_Learning_and_Pattern_Recognition","225301440_An_Automatic_Patient-Adapted_ECG_Heartbeat_Classifier_Allowing_Expert_Assistance","224381387_A_Generic_and_Robust_System_for_Automated_Patient-Specific_Classification_of_ECG_Signals","224218413_Optimization_of_ECG_Classification_by_Means_of_Feature_Selection","221080312_Evaluation_of_Pooling_Operations_in_Convolutional_Architectures_for_Object_Recognition","288024040_Automatic_classification_of_heartbeats_using_ECG_morphology_heartbeat_intervals_features","267960550_ImageNet_Classification_with_Deep_Convolutional_Neural_Networks","252205649_Advanced_pattern_recognition","230675350_Receptive_Fields_of_Single_Neurons_in_the_Cat's_Striate_Cortex","224075015_Using_a_translation-invariant_neural_network_to_diagnose_heart_arrhythmia"]}