{"id":"281061165_Ampelographic_and_genetic_characterization_of_an_initial_Israeli_grapevine_germplasm_collection","abstract":"The Holy Land has a long history of winemaking, widely mentioned in ancient scripts. The Muslim occupation of this region, starting in the 7th century initiated a wine consumption prohibition, resulting in the abandonment of most wine varieties. The renewing of Israeli wine industry in the 19 th century was based on international cultivars. Between the years 2011-2014 we conducted a country-wide survey towards the collection and assessment of an Israeli grapevine germplasm collection, including for the first time Vitis vinifera L. subsp. sylvestris (Gmelin) Hegi accessions. The collected population consists of 148 accessions which revealed 61 different genetic profiles when analysed at 9 SSR loci. Ten genotypes consistently matched the profiles of some Israeli and Palestinian accessions reported in previous studies. The phylogenetic analysis showed how the V. vinifera subsp. sylvestris accessions, all collected in the north of Israel around water sources, are well distinguished from the V. vinifera subsp. sativa group. Based on ampelographic evaluation we concluded that most V. vinifera L. subsp. sativa accessions have characteristics of the proles Orientalis. We believe that by our efforts of collecting and assessing these populations, an array of new-old grapevine varieties suited for quality wine production would be offered, reconnecting the Israeli wine industry to its historical origins. K e y w o r d s : Indigenous varieties; Vitis vinifera L. sub-sp. sylvestris; microsatellite markers.","authors":["Elyashiv Drori","O Rahimi","Yakov Henig","Silvia Lorenzi"],"meta":["January 2015Vitis -Geilweilerhof- 54:107-110","Project: local israely grapevined varieties"],"references":["259956747_Molecular_Identification_and_Genetic_Relationships_of_Palestinian_Grapevine_Cultivars","239744842_A_catalogue_of_wild_relatives_of_cultivated_plants_native_to_Europe","236051481_Genetic_diversity_and_population_structure_assessed_by_SSR_and_SNP_markers_in_a_large_germplasm_collection_of_grape","229572214_Microsatellite_genotyping_of_cultivars_of_the_Holy_Land_grapevine_Vitis_vinifera_ssp_sativa_Vitaceae","224806232_The_European_Vitis_Database_wwweu-vitisde_-_a_technical_innovation_through_an_online_uploading_and_interactive_modification_system"]}