{"id":"281065044_Sketching_Designs_Using_the_Five_Design-Sheet_Methodology","abstract":"Sketching designs has been shown to be a useful way of planning and considering alternative solutions. The use of lo-fidelity prototyping, especially paper-based sketching, can save time, money and converge to better solutions more quickly. However, this design process is often viewed to be too informal. Consequently users do not know how to manage their thoughts and ideas (to first think divergently, to then finally converge on a suitable solution). We present the Five Design Sheet (FdS) methodology. The methodology enables users to create information visualization interfaces through lo-fidelity methods. Users sketch and plan their ideas, helping them express different possibilities, think through these ideas to consider their potential effectiveness as solutions to the task (sheet 1); they create three principle designs (sheets 2,3 and 4); before converging on a final realization design that can then be implemented (sheet 5). In this article, we present (i) a review of the use of sketching as a planning method for visualization and the benefits of sketching, (ii) a detailed description of the Five Design Sheet (FdS) methodology, and (iii) an evaluation of the FdS using the System Usability Scale, along with a case-study of its use in industry and experience of its use in teaching.","authors":["Jonathan C. Roberts","Chris James Headleand","Panagiotis D. Ritsos"],"meta":["October 2015IEEE Transactions on Visualization and Computer Graphics PP:1-1","DOI:10.1109/TVCG.2015.2467271"],"references":["319394819_SUS_--_a_quick_and_dirty_usability_scale","280493648_An_Exploratory_Study_of_Data_Sketching_for_Visual_Representation","336571816_Sketching_Sketching_Outlines_of_a_Collaborative_Design_Method","292359099_Information_visualization_An_introduction_third_edition","290778745_Novel_Visual_Metaphors_for_Multivariate_Networks","275940939_Semiology_of_Graphics","273947524_Interaction_Design_Beyond_Human-Computer_Interaction","273397914_Design_Activity_Framework_for_Visualization_Design","269359525_Sketch-based_interactive_visualization_a_survey","266316578_Information_Visualization_Second_Edition_Perception_for_Design_Interactive_Technologies"]}