{"id":"281050326_Tools_and_Methods_for_Efficiently_Designing_Serious_Games","abstract":"Serious games are pedagogical multimedia products made to help learners develop specific competencies. Their use has proven to be promising in many domains, but is at present restricted by the time consuming and costly nature of the developing process. When developing Serious Games (SGs) for academic purposes, not only is there a budgetary challenge, but there is also the challenge of integrating enough educational value without sacrificing the fun characteristics. In this article, we detail the designing process of a SG and enumerate the various actors who have to collaborate: project manager, cognitive specialist, domain experts, storyboard writer, artistic director, pedagogical expert, programmers. To help them work together and communicate in an efficient way, we first propose a step by step engineering method that helps the actors collaborate in an efficient and structured way. Each member of the designing team is assigned a set of tasks. Then, we propose authoring tools that can be used to carry out these tasks. They offer the possibility of simultaneously viewing various dimensions of the SG scenario: target knowledge, storyline, learning scenario, fun characteristics. When the authors connect to the platform, each of them is provided with a customized selection of dimensions presented with more or less detail. When interacting with one dimension, the other dimensions react and modify themselves automatically in a synchronized manner. In particular, we present a number of elearning tools, that have been adapted for SG design and that allow us to specify the target competencies that have to be learned and build the pedagogical learning scenario. The SG authors will also have access to sample SGs and resources to provide them with inspiration for using fun characteristics to captivate the learners and carry them through the learning process. In response to the need felt by many SG authors to store and share their experience, we present a number of tools to help the authors store, find and integrate reusable software components into their SGs.","authors":["Iza Marfisi-Schottman","Sébastien George","Franck Tarpin-Bernard"],"meta":["January 2010"],"references":["288265464_MISA_A_knowledge-based_method_for_the_engineering_of_learning_systems","228726617_Student's_Problem_Appropriation_in_an_Epidemiology_Game"]}