{"id":"281102035_Evaluer_les_usages_didactiques_d'un_serious_game_a_partir_de_l'analyse_de_l'action_conjointe_le_cas_MecageniusR","abstract":"This article focuses on how a mechanical engineering serious game Mecagenius® is used by teachers in a high school and in a higher education institute of technology (IUT). To account of it we make a bottom-up analysis of the didactic transposition by means of analytical descriptors related to teacher and students’ didactical joint action. We first present the theoretical framework and the research method, then we illustrate how Mecagenius® is used by teachers through short extracts borrowed from two case studies. The findings highlight the contrasting forms of artifact integration into teachers’ usual teaching practices. The conclusion discusses the contribution of this study for understanding the potential uses of serious games in ordinary teaching.\n\nRésumé en français : Cet article s’intéresse à la manière dont un serious game de génie mécanique est utilisé par des enseignants en lycée et en IUT. Il s’appuie sur une analyse ascendante de la transposition didactique et mobilise les descripteurs de l’action didactique conjointe professeur-élèves. \nNous présentons le cadre théorique et la méthode mis en oeuvre pour rendre compte des usages didactiques que font les enseignants de cet artéfact informatique que nous exemplifions à partir de courts extraits tirés de deux études de cas. Les résultats mettent en lumière des formes contrastées d'intégration de Mecagenius® à la pratique usuelle des enseignants. La conclusion pointe les apports de cette étude dont la visée est de rendre intelligible les usages possibles des serious games en situation didactique ordinaire.","authors":["Galaup Michel","Chantal Amade-Escot"],"meta":["October 2014Sciences et Technologies de l Information et de la Communication pour l Éducation et la Formation 21(21)","DOI:10.3406/stice.2014.1108","Project: Mecagenius: a serious game le learn and teach Mecanical engineering"],"references":["277241915_Une_relecture_des_phenomenes_transpositifs_a_la_lumiere_de_la_didactique_comparee","47654020_Le_milieu_didactique_d'une_etude_empirique_en_contexte_difficile_a_une_reflexion_sur_le_concept","291710118_C'ontributions_a_une_theorie_du_dispositif","278728203_Usage_d'un_jeu_serieux_dans_l'enseignement_secondaire_modelisation_comportementale_et_epistemique_de_l'apprenant_Jeux_serieux_revolution_pedagogique_ou_effet_de_mode","276934705_Le_contrat_didactique_Le_milieu","267854205_La_theorie_des_situations_didactiques","246677993_Les_Hommes_et_les_Technologies_Approche_Cognitive_des_Instruments_Contemporains","242362936_Fondements_et_methodes_de_la_didactique_des_mathematiques","224043878_Falsification_and_the_Methodology_of_Scientific_Research_Programme","220040348_A_Systemic-Constructivist_Approach_to_the_Facilitation_and_Debriefing_of_Simulations_and_Games"]}