{"id":"281105022_Process_Mining_in_the_Education_Domain","abstract":"Given the ever changing needs of the job\nmarkets, education and training centers are increasingly held\naccountable for student success. Therefore, education and\ntraining centers have to focus on ways to streamline their\noffers and educational processes in order to achieve the highest\nlevel of quality in curriculum contents and managerial\ndecisions. Educational process mining is an emerging field in\nthe educational data mining (EDM) discipline, concerned with\ndeveloping methods to better understand students’ learning\nhabits and the factors influencing their performance. It aims,\nparticularly, at discovering, analyzing, and providing a visual\nrepresentation of complete educational processes. In this\npaper, in continuity of the work presented in [1], we investigate\nfurther the potential, challenges and feasibility of the\neducational process mining in the field of professional\ntrainings. First, we focus on the mining and the analysis of\nsocial networks, from educational event logs, between courses\nunits, resources or training providers. Second, we propose a\nclustering approach to decompose educational processes\nfollowing key performance indicators. We have experimented\nthis approach using the ProM Framework.","authors":["Hicheur Awatef","Billel GUENI","Mehdi Fhima","Andrew CAIRNS"],"meta":["February 2015","Conference: International Journal on Advances in Intelligent SystemsAt: International Journal on Advances in Intelligent Systems, vol 8 no 1 & 2, year 2015Volume: vol 8 no 1 & 2"],"references":["281104719_Using_Semantic_Lifting_for_Improving_Educational_Process_Models_Discovery_and_Analysis","271441601_Finding_Suitable_Activity_Clusters_for_Decomposed_Process_Discovery","267726456_Towards_Custom-Designed_Professional_Training_Contents_and_Curriculums_through_Educational_Process_Mining","261351894_Wanna_improve_process_mining_results","324322693_Multivariate_Observations","324286003_Finding_Groups_in_Data_An_Introduction_to_Cluster_Analysis","289747271_Visualizing_Large_Business_Process_Models_Challenges_Techniques_Applications","270350037_Cluster_Dissection_and_Analysis_Theory_Fortran_Programs_Examples","270349405_Multivariate_Observations","260355884_Data_Mining_in_Education"]}