{"id":"281195082_Patient-Specific_Biomechanical_Modeling_for_Guidance_During_Minimally-Invasive_Hepatic_Surgery","abstract":"During the minimally-invasive liver surgery, only the partial surface view of the liver is usually provided to the surgeon via the laparoscopic camera. Therefore, it is necessary to estimate the actual position of the internal structures such as tumors and vessels from the pre-operative images. Nevertheless, such task can be highly challenging since during the intervention, the abdominal organs undergo important deformations due to the pneumoperitoneum, respiratory and cardiac motion and the interaction with the surgical tools. Therefore, a reliable automatic system for intra-operative guidance requires fast and reliable registration of the pre- and intra-operative data. In this paper we present a complete pipeline for the registration of pre-operative patient-specific image data to the sparse and incomplete intra-operative data. While the intra-operative data is represented by a point cloud extracted from the stereo-endoscopic images, the pre-operative data is used to reconstruct a biomechanical model which is necessary for accurate estimation of the position of the internal structures, considering the actual deformations. This model takes into account the patient-specific liver anatomy composed of parenchyma, vascularization and capsule, and is enriched with anatomical boundary conditions transferred from an atlas. The registration process employs the iterative closest point technique together with a penalty-based method. We perform a quantitative assessment based on the evaluation of the target registration error on synthetic data as well as a qualitative assessment on real patient data. We demonstrate that the proposed registration method provides good results in terms of both accuracy and robustness w.r.t. the quality of the intra-operative data.","authors":["Rosalie Plantefeve","Igor Peterlik","Nazim Haouchine","Stéphane Cotin"],"meta":["August 2015Annals of Biomedical Engineering 44(1)","DOI:10.1007/s10439-015-1419-z","SourcePubMed"],"references":["280852493_Automatic_Alignment_of_Pre_and_Intraoperative_Data_Using_Anatomical_Landmarks_for_Augmented_Laparoscopic_Liver_Surgery","279258266_Towards_an_Accurate_Tracking_of_Liver_Tumors_for_Augmented_Reality_in_Robotic_Assisted_Surgery","273161668_Impact_of_Soft_Tissue_Heterogeneity_on_Augmented_Reality_for_Liver_Surgery","269282816_Atlas-Based_Transfer_of_Boundary_Conditions_for_Biomechanical_Simulation","267841453_Intraoperative_surface_reconstruction_and_biomechanical_modeling_for_soft_tissue_registration","266006712_Patient_Specific_Biomechanical_Modeling_of_Hepatic_Vasculature_for_Augmented_Reality_Surgery","319770513_Pyramidal_implementation_of_the_lucas_kanade_feature_tracker_description_of_the_algorithm","286007436_Augmented_Reality","267871756_Physics-based_shape_matching_for_intraoperative_image_guidance","263699692_Pose-Independent_Surface_Matching_for_Intra-Operative_Soft-Tissue_Marker-Less_Registration"]}