{"id":"281111643_ECAR_Study_of_Undergraduate_Students_and_Information_Technology_2014","abstract":"For the 2014 student techology use study, ECAR collaborated with 213 institutions to collect responses from 75,306 undergraduate students about their technology experiences.\n\nKey Findings\nSelected findings are below. See the report for a comprehensive list.\n\nTechnology is embedded into students’ lives, and students are generally inclined to use and to have favorable attitudes toward technology. However, technology has only a moderate influence on students’ active involvement in particular courses or as a connector with other students and faculty.\nStudents’ academic use of technology is widespread but not deep. They are particularly interested in expanding the use of a few specific technologies.\nMany students use mobile devices for academic purposes. Their in-class use is more likely when instructors encourage such use; however, both faculty and students are concerned about their potential for distraction.\nMore students than ever have experienced a digital learning environment. The majority say they learn best with a blend of online and face-to-face work.\nMost students support institutional use of their data to advise them on academic progress in courses and programs. Many of the analytic functions students seek already exist in contemporary LMSs.","authors":["Eden Dahlstrom","Jacqueline Bichsel"],"meta":["October 2014","DOI:10.13140/RG.2.1.3030.7040","Affiliation: EDUCAUSE"],"references":["281111565_The_Current_Ecosystem_of_Learning_Management_Systems_in_Higher_Education_Student_Faculty_and_IT_Perspectives","257983603_Digital_Distractions_in_the_Classroom_Student_Classroom_Use_of_Digital_Devices_for_Non-Class_Related_Purposes","289380830_The_myth_of_the_tech-savvy_student_The_role_of_media_educators_in_a_web_20_world","285088568_Connecting_the_dots_to_the_future_of_technology_in_higher_education","261839238_The_Pen_Is_Mightier_Than_the_Keyboard_Advantages_of_Longhand_Over_Laptop_Note_Taking","232481564_Rhyme_and_Reason_Analyses_of_Dual_Retrieval_Cues"]}