{"id":"281276761_Automated_analysis_of_free_speech_predicts_psychosis_onset_in_high-risk_youths","abstract":"Background/objectives: \nPsychiatry lacks the objective clinical tests routinely used in other specializations. Novel computerized methods to characterize complex behaviors such as speech could be used to identify and predict psychiatric illness in individuals.\n\nAims: \nIn this proof-of-principle study, our aim was to test automated speech analyses combined with Machine Learning to predict later psychosis onset in youths at clinical high-risk (CHR) for psychosis.\n\nMethods: \nThirty-four CHR youths (11 females) had baseline interviews and were assessed quarterly for up to 2.5 years; five transitioned to psychosis. Using automated analysis, transcripts of interviews were evaluated for semantic and syntactic features predicting later psychosis onset. Speech features were fed into a convex hull classification algorithm with leave-one-subject-out cross-validation to assess their predictive value for psychosis outcome. The canonical correlation between the speech features and prodromal symptom ratings was computed.\n\nResults: \nDerived speech features included a Latent Semantic Analysis measure of semantic coherence and two syntactic markers of speech complexity: maximum phrase length and use of determiners (e.g., which). These speech features predicted later psychosis development with 100% accuracy, outperforming classification from clinical interviews. Speech features were significantly correlated with prodromal symptoms.\n\nConclusions: \nFindings support the utility of automated speech analysis to measure subtle, clinically relevant mental state changes in emergent psychosis. Recent developments in computer science, including natural language processing, could provide the foundation for future development of objective clinical tests for psychiatry.","authors":["Gillinder Bedi","Facundo Carrillo","Guillermo A Cecchi","Diego Fernández Slezak"],"meta":["September 2015npj Schizophrenia 1(1):15030","DOI:10.1038/npjschz.2015.30"],"references":["265255185_The_Subjective_Experience_of_Youths_at_Clinical_High_Risk_for_Psychosis_A_Qualitative_Study","261326036_A_Window_into_the_Intoxicated_Mind_Speech_as_an_Index_of_Psychoactive_Drug_Effects","260063133_Predicting_the_Risk_of_Suicide_by_Analyzing_the_Text_of_Clinical_Notes","236063008_Latent_semantic_variables_are_associated_with_formal_thought_disorder_and_adaptive_behavior_in_older_inpatients_with_schizophrenia","230762113_Thought_disorder_in_mid-childhood_as_a_predictor_of_adulthood_diagnostic_outcome_Findings_from_the_New_York_High-Risk_Project","266027181_Symptom_trajectories_and_psychosis_onset_in_a_clinical_high-risk_cohort_The_relevance_of_subthreshold_thought_disorder","258251006_Twenty-five_years_of_progress_the_view_from_NIMH_and_NINDS","236005996_Latent_semantic_variables_are_associated_with_formal_thought_disorder_and_adaptive_behavior_in_older_inpatients_with_schizophrenia","233644810_Phenomenological_Research_in_Schizophrenia_From_Philosophical_Anthropology_to_Empirical_Science","225068214_Youth_mental_health_reform_and_early_intervention_Encouraging_early_signs"]}