{"id":"281254707_Learning_and_Teaching_Style_Models_in_Pedagogical_Design_of_Electronic_Educational_Environment_of_the_University","abstract":"Education system of Russia is undergoing significant changes due to the need to overcome the contradictions between the traditional pace of learning and teaching and the ever-increasing flow of new knowledge. The development of e-learning poses new demands on the organization and improvement of the quality of learning and teaching process. The article discusses issues about the pedagogical design of electronic educational environment of the university. The description of the main learning and teaching style models (Gregorc’s Mind Style Model, Kolb’s Experiential Learning Theory, the VARK Model, the Felder-Silverman Learning and Teaching Styles Model), ways of designing individual learning pathways based on the models are represented. The criteria for the design of a pedagogical scenario for each learning and teaching style are defined and described. A scheme of the pedagogical scenario of electronic educational environment based on the Anthony Gregorc’s model is introduced; the results of experimental testing carried out with the students of the Applied Mathematics and Informatics Department to determine the effect of pedagogical scenario on improving the quality of students’ training in university are presented. \n\nDOI: 10.5901/mjss.2015.v6n3s7p281","authors":["Vera Toktarova","Aleksandra A. Panturova"],"meta":["June 2015Mediterranean Journal of Social Sciences 6(3)","DOI:10.5901/mjss.2015.v6n3s7p281"],"references":["309120076_Learning_and_teaching_styles_in_engineering_education_Engr","276158857_Pedagogical_Management_of_Learning_Activities_of_Students_in_the_Electronic_Educational_Environment_of_the_University_A_Differentiated_Approach","235701029_Experiential_Learning_Experience_As_The_Source_Of_Learning_And_Development","239982711_Experience_as_the_Source_of_Learning_and_Development","228604140_I'm_different_not_dumb_Modes_of_presentation_VARK_in_the_tertiary_classroom"]}