{"id":"281292701_On_Distributed_Virtual_Network_Embedding_with_Guarantees","abstract":"To provide wide-area network services, resources from different infrastructure providers are needed. Leveraging the consensus-based resource allocation literature, we propose a general distributed auction mechanism for the (NP-hard) virtual network (VNET) embedding problem. Under reasonable assumptions on the bidding scheme, the proposed mechanism is proven to converge, and it is shown that the solutions guarantee a worst-case efficiency of (1-(1/e)) relative to the optimal node embedding, or VNET embedding if virtual links are mapped to exactly one physical link. This bound is optimal, that is, no better polynomial-time approximation algorithm exists, unless {\\rm P}={\\rm NP} . Using extensive simulations, we confirm superior convergence properties and resource utilization when compared to existing distributed VNET embedding solutions, and we show how by appropriate policy design, our mechanism can be instantiated to accommodate the embedding goals of different service and infrastructure providers, resulting in an attractive and flexible resource allocation solution.","authors":["Flavio Esposito"],"meta":["November 2014IEEE/ACM Transactions on Networking","DOI:10.1109/TNET.2014.2375826."],"references":["293640843_VINEA_An_Architecture_for_Virtual_Network_Embedding_Policy_Programmability","260837021_A_Decomposition-based_Architecture_for_Distributed_Virtual_Network_Embedding","259266509_Slice_Embedding_Solutions_for_Distributed_Service_Architectures","244409966_Resource_Allocation_in_Federated_Distributed_Computing_Infrastructures","277296348_Distributed_Algorithms","261122014_Network_aware_resource_allocation_in_distributed_clouds","259741171_Allowing_Non-Submodular_Score_Functions_in_Distributed_Task_Allocation","257650271_Approximation_Algorithms_for_NP-Hard_Problems","245954051_Distributed_Algorithms_Chapter_6_7","244409568_Computational_Resource_Exchanges_for_Distributed_Resource_Allocation"]}