{"id":"281286234_Estimating_the_reproducibility_of_psychological_science","abstract":"Reproducibility is a defining feature of science, but the extent to which it characterizes current research is unknown. We conducted replications of 100 experimental and correlational studies published in three psychology journals using high-powered designs and original materials when available. Replication effects were half the magnitude of original effects, representing a substantial decline. Ninety-seven percent of original studies had statistically significant results. Thirty-six percent of replications had statistically significant results; 47% of original effect sizes were in the 95% confidence interval of the replication effect size; 39% of effects were subjectively rated to have replicated the original result; and if no bias in original results is assumed, combining original and replication results left 68% with statistically significant effects. Correlational tests suggest that replication success was better predicted by the strength of original evidence than by characteristics of the original and replication teams.","authors":["Alexander A. Aarts","Joanna E. Anderson","Christopher J. Anderson","Peter Attridge"],"meta":["August 2015Science 349(6251)","DOI:10.1126/science.aac4716","Projects: Replication ScienceEstimating the Reproducibility of Psychological ScienceThe Reproducibility ProjectEstimating the Reproducibility of Psychological Science"],"references":["286363969_False-positive_psychology_Undisclosed_flexibility_in_data_collection_and_analysis_allows_presenting_anything_as_significant","279302015_Promoting_an_Open_Research_Culture","274485475_Continuously_Cumulating_Meta-Analysis_and_Replicability","263922067_Registered_Reports_A_Method_to_Increase_the_Credibility_of_Published_Results","308353453_Small_telescope_detectability_and_the_evaluation_of_replication_results","292115061_Studies_in_the_Logic_of_Explanation","277515353_Editors'_Introduction_to_the_Special_Section_on_Replicability_in_Psychological_Science_A_Crisis_of_Confidence","274086011_Small_Telescopes","261033162_Publication_and_Other_Reporting_Biases_in_Cognitive_Sciences_Detection_Prevalence_and_Prevention","259771737_Reproducibility"]}