{"id":"281294308_USABILIDADE_NA_WEB_O_USUARIO_COMO_AGENTE-FACILITADOR_NO_DESENVOLVIMENTO_DE_INTERFACES_DE_HOME_PAGES","abstract":"Resumo A internet, através da web, vem conquistando uma significativa parcela de usuários, o que se leva a considerar como vêm sendo trabalhadas as questões ergonômicas e de usabilidade nesse meio. No Brasil, ainda é pequeno o número de estudos que estão sendo publicados como resultados de pesquisas, no que diz respeito à usabilidade da interação humano­computador, em que projetistas e desenvolvedores de sistemas informatizados pouco utilizam os parâmetros ergonômicos para projetos e testes de avaliação de usabilidade de interfaces. Pior do que não se atentar a estas questões é deixar de lado um dos fatores mais importantes deste processo: o usuário. É nele que se deve fixar. Ele é a resposta para muitas perguntas que ainda pairam sobre o assunto web. Pode ser considerado um grande colaborador, desde que seja convidado para participar do desenvolvimento e do crescimento desta nova área. Afinal, a web, a internet e os sites, foram e são projetados para ele. Deixe­se então que os mesmos apontem seus \" modelos mentais \" de como deve funcionar esse setor informático, através da organização das informações, facilitando a comunicação entre ele e a máquina. Fixando­se no usuário, a pesquisa tece considerações e aponta a técnica de Card Sorting como uma das que pode auxiliar na busca pelos \" modelos mentais \" dos usuários, reorganizando informações e criando novas taxonomias de forma que lhe façam mais sentido. Considerando a home page a página inicial dos sites e o primeiro contato dos usuários com os mesmos e com o mundo da internet, utilizou­a como foco da pesquisa, enquanto interface gráfica. Abstract The internet, through the web, has gained a great number of users which leads us to consider how the usability and the ergonomic issues have been worked on this field. In Brazil, the number of studies released as results of researches is still small concerning the usability of human­computer interaction, in which projectors and information systems developers do not use the ergonomic parameters for the 1 Mestre em Desenho Industrial, LEI­PPGDI­FAAC­UNESP, dmacario@faac.unesp.br; 2 Livre Docente em Desenho Industrial, LEI­PPGDI­FAAC­UNESP, placido@faac.unesp.br;","authors":["Daniela Macário Custódio","Plácido da Silva"],"meta":["January 2007"],"references":["279537769_Ergodesign_e_Arquitetura_de_Informacao_Trabalhando_com_o_Usuario","275273481_Ergonomia_projeto_e_producao","261834017_As_tecnologias_da_inteligencia_o_futuro_do_pensamento_na_era_da_informatica","242363089_Web_Navigation_Designing_the_User_Experience","230786758_Card_Sorting_How_many_users_to_test","230786743_Card_sorting_a_definitive_guide"]}