{"id":"281278326_Empirical_Data_and_Analysis_of_Defects_in_Operating_Systems_Kernels","abstract":"Kernel defects in operating systems make up around 40% of the overall defects based on data collected over more than 14 years for three successive operating system releases. The study shows that the time it takes each OS release to stabilize increases despite the reusability of the code and the experience gained by programmers in developing previous releases. Many of the defect categories observed in one release show up in subsequent releases, although one expects that the old fixes, batches, and corrections would contribute to a cleaner newer release. The data presented in this paper shows time dependent defect arrival rate, which helps a better planning and utilization of resources in order to improve the overall productivity. The total number of defects analyzed in this paper is 11,000 defects distributed over three subsequent releases of the same software system. The observation period of the defects is large enough to encompass the period where the system stability is observed. The rise in the defect rate from one release to another suggests that productivity enhancement continues to be a concern for critical SW systems components such as the OS kernel.","authors":["Mohammad Malkawi"],"meta":["November 2014","Conference: 24th IBIMA Conference Milan, Italy 6-7 November 2014At: Milan, Italy"],"references":["265315753_Applied_Reliability","247573088_Software's_Chronic_Crisis","220957942_Analysis_of_Failure_and_Recovery_Rates_in_a_Wireless_Telecommunications_System","4131928_Simple_plots_for_monitoring_the_field_reliability_of_repairable_systems","267221472_NonStop_Availability_in_a_ClientServer_Environment","227632037_Measuring_system_and_software_reliability_using_automated_data_collection_process","221596066_Analysis_and_implementation_of_software_rejuvenation_in_cluster_systems","221303395_Why_Do_Internet_Services_Fail_and_What_Can_Be_Done_About_It","220498325_Proactive_management_of_software_aging","220071512_Effect_of_System_Workload_on_Operating_System_Reliability_A_Study_on_IBM_3081"]}