{"id":"281207273_Stepwise_Formal_Modelling_and_Reasoning_of_Insulin_Infusion_Pump_Requirements","abstract":"An insulin infusion pump (IIP) is a critical software-intensive medical device that infuses insulin satisfying patient needs under safety and timing constraints that are appropriate for the treatment of diabetes. This device is used by millions of people around the world. The USA Food and Drug Administration (FDA) has reported several recalls in which IIP failures were responsible for a large number of serious illnesses and deaths. The failures responsible for this harm to people who are dependent on external insulin were caused by the introduction of hardware or software design errors during the system development process. This paper presents an incremental proof-based development of an IIP. We use the Event-B modelling language to formalize the given system requirements. Further, the Rodin proof tools are used to verify the correctness of functional behaviour, internal consistency checking with respect to safety properties, invariants and events.","authors":["Neeraj Kumar Singh","Hao Wang","Mark Stephen Lawford","Tom Maibaum"],"meta":["July 2015Lecture Notes in Computer Science 9185:387-398","DOI:10.1007/978-3-319-21070-4_39","Conference: International Conference on Digital Human Modeling and Applications in Health, Safety, Ergonomics and Risk Management"],"references":["303969621_Safety-Assured_Development_of_the_GPCA_Infusion_Pump_Software","295075602_Model-Based_Development_of_the_Generic_PCA_Infusion_Pump_User_Interface_Prototype_in_PVS","266676249_Formalizing_the_Glucose_Homeostasis_Mechanism","266676194_Insulin_Pump_Software_Certification","316738908_Using_Event-B_for_Critical_Device_Software_Systems","279365223_Using_Event-B_for_Critical_Device_Software_Systems","279365088_Using_Event-B_for_Critical_Device_Software_Systems","279345187_Using_Event-B_for_Critical_Device_Software_Systems","262390734_An_Event-B_Approach_to_Timing_Issues_Applied_to_the_Generic_Insulin_Infusion_Pump","262333493_Patient_safety"]}