{"id":"281214279_A_contribuicao_da_organizacao_e_da_visualizacao_da_informacao_para_os_sistemas_de_recuperacao_de_informacao","abstract":"p> Introdução: Apresenta resultados de pesquisa sobre a produção científica registrada em Ciência da Informação, a partir de dados empíricos obtidos em pesquisa bibliométrica sobre um corpus da literatura da área no Brasil, produzido por grupo de pesquisadores representativos, no período de 1993 a 2013, destacando as relações apresentadas no processo de consagração e de legitimação e cotejando-as com os aspectos teóricos relativos aos processos de produção e reprodução na literatura científica, assim como à distinção atribuída pela comunidade a pesquisadores e instituições.\n\nObjetivo : Analisa, partindo de configurações bibliométricas, as características e as relações que essa produção apresenta e como se destacam seus componentes.\n\nMetodologia : Identifica os artigos científicos dos 15 pesquisadores com a produção mais expressiva no período de 1993 a 2013, partindo de um levantamento bibliométrico dos periódicos vigentes, indexados na Base de Dados Referenciais de Artigos de Periódicos de Ciência da Informação (Brapci). Analisa os artigos científicos, identificando seus temas e relacionando seus autores às instituições e às posições que representam, para posterior organização numa planilha eletrônica, geradora dos gráficos utilizados. Com a mesma estratégia, incorpora a filiação dos autores e suas posições como pesquisadores junto ao CNPq. Completa a identificação com a busca de informações sobre a situação da pós-graduação em CI no Brasil e das posições dos grupos de pesquisa e dos pesquisadores para uma visualização sincrônica do contexto.\n\nResultados: Destaca que um terço dos autores faz parte do rol de pesquisadores do CNPq e que as instituições de maior destaque na área da CI, cujos programas são os mais antigos e contam com doutorado, abrigam a maioria dos pesquisadores CNPq.\nConclusões : Observa que a legitimação e a distinção decorrem do tempo de poder, ou seja, da permanência em situação capaz de organizar e estruturar condições de produção mais estáveis e, portanto, com melhores oportunidades de sucesso. As reflexões sobre os três aspectos críticos do processo de pesquisa científica, a produção, a reprodução e a distinção, apresentam singularidades que ilustram as convergências para a concretude do processo legitimador das instâncias de consagração na comunidade de experiências desse campo de produção científica.","authors":["Jessica Monique de Lira Vieira","Fabio Assis Pinho"],"meta":["June 2015Informação & Informação 20(1):110","DOI:10.5433/1981-8920.2015v20n1p110"],"references":["304519321_Taxonomia_como_elemento_estruturante_em_portais_corporativos","277734548_Sistemas_de_Organizacao_do_Conhecimento_na_visao_da_Ciencia_da_Informacao","277262536_Recursos_de_formulacao_e_visualizacao_de_indicadores_para_apoiar_processos_de_gestao_educacional_em_IESs","269944802_Influencias_ergonomicas_en_la_Visualizacion_de_Informacion","267418212_Uma_Introducao_a_Engenharia_de_Ontologias_no_contexto_da_Web_Semantica","267403645_Visualizacao_de_Informacoes_-_Uma_Abordagem_Pratica","222778633_Educacao_e_bibliotecas_digitais","329931718_The_Intellectual_Foundation_of_Information_Organization","295925748_Information_science_an_interdisciplinary_approach","237024553_REPRESENTACAO_DO_CONHECIMENTO_NA_PERSPECTIVA_DA_CIENCIA_DA_INFORMACAO_EM_TEMPO_E_ESPACO_DIGITAIS"]}