{"id":"281255461_Early_draft_Simulation_self-extinction_and_philosophy_in_the_service_of_human_civilization","abstract":"(SEE LINKED RESEARCH BELOW TO DOWNLOAD ARTICLE AS PUBLISHED IN JOURNAL) Nick Bostrom's recently patched \" simulation argument \" (Bostrom, 2003, Bostrom and Kulczycki, 2011) purports to demonstrate the probability that we \" live \" now in an \" ancestor simulation \" – that is as a simulation of a period prior to that in which a civilization more advanced than our own – \" post-human \"-becomes able to simulate such a state of affairs as ours. As such simulations under consideration resemble \"brains in vats\" (BIVs) and may appear open to similar objections, the paper begins by reviewing objections to BIV type proposals, specifically those due a presumed mad envatter. In counter example, we explore the motivating rationale behind current work in the development of psychologically realistic social simulations. Further concerns about rendering human cognition in a computational medium are confronted through review of current dynamic systems models of cognitive agency. In these models, aspects of the human condition are reproduced that may in other forms be considered incomputable, i.e. political voice, predictive planning and consciousness. The paper then argues that simulations afford a unique potential to secure a post-human future, and may be necessary for a pre-post-human civilization like our own to achieve and to maintain a post-human situation. Long-standing philosophical interest in tools of this nature for Aristotle's \" statesman \" and more recently for E.O. Wilson in the 1990s is observed. Self-extinction level threats from State and individual levels of organization are compared, and a likely dependence on large-scale psychologically realistic simulations to get past self-extinction level threats is projected. In the end, Bostrom's basic argument for the conviction that we exist now in a simulation is reaffirmed.","authors":["Jeffrey White"],"meta":["May 2016AI & SOCIETY 31(2)","DOI:10.1007/s00146-015-0620-9"],"references":["288696371_A_general_theory_of_moral_agency_grounding_computational_implementations_The_ACTWith_model","288462085_An_information_processing_model_of_psychopathy_and_anti-social_personality_disorders_integrating_neural_and_psychological_accounts_towards_the_assay_of_social_implications_of_psychopathic_agents","277545476_Models_of_Moral_Cognition","345780149_Exploring_Robotic_Minds_Actions_Symbols_and_Consciousness_as_Self-Organizing_Dynamic_Phenomena","329649326_Between_Facts_and_Norms_Contributions_to_a_Discourse_Theory_of_Law_and_Democracy","311830981_Conclusions_Actions_Symbols_and_Consciousness_as_Self-Organizing_Dynamic_Phenomena","306218007_his_Reason_Truth_and_History","292581915_Cognition_and_multi-agent_interaction_From_cognitive_modeling_to_social_simulation","291245756_Adam_Smith_on_Morality_and_Self-Interest","281273810_The_Better_Angels_of_Our_Nature_Why_Violence_Has_Declined","275794261_Brave_New_World_Revisited","274479859_Between_Facts_and_Norms_Contributions_to_a_Discourse_Theory_of_Law_and_Democracy","274151402_A_patch_for_the_Simulation_Argument","273081015_Direct_Realism_and_the_Brain-in-a-Vat_Argument","272746319_The_brothers_Karamazov_a_novel_in_four_parts_with_epilogue"]}