{"id":"281242948_Optimal_coordination_of_Directional_Overcurrent_Relays_using_hybrid_CSA-FFA_method","abstract":"The optimal coordination of Directional Overcurrent Relays (DOCRs) is a nonlinear and non-convex optimization problem integrating large number of constraints. In this paper, the hybrid Cuckoo Search Algorithm (CSA) - Firefly Algorithm (FFA) approach is implemented to solve coordination problem of DOCRs. The Artificial Intelligence (AI) based method such as FFA searches large solution space with large deviation in results with different number of simulations. Also it is not assured that result given by FFA is global best. To solve this problem, the preliminary optimal value of Time Multiplier Setting (TMS) and pickup current (Ip) are determined using CSA. The values of these variables are used in FFA as upper bounds which reduce the solution space and give a global optimal solution with very minimum deviation. The obtained results using proposed method are compared with hybrid Genetic Algorithm-Nonlinear Programming (GA-NLP) as well as with conventional CSA and FFA methods. The outcome demonstrates that the proposed method can obtain realizable and global best solution with minimum deviation in results and improved computational efficiency for this complex problem.","authors":["Vipul N Rajput","Kartik Pandya","Kevin Joshi"],"meta":["June 2015","DOI:10.1109/ECTICon.2015.7207044","Conference: 12th International Conference on Electrical Engineering/Electronics, Computer, Telecommunications and Information Technology (ECTI-CON), 2015At: Hua Hin, Cha-am, Thailand"],"references":["255971821_Firefly_Algorithm_Recent_Advances_and_Applications","241638955_Coordination_of_Directional_Overcurrent_Relays_Using_Seeker_Algorithm","235979489_Bat_Algorithm_Firefly_Algorithm_and_Cuckoo_Search","303258036_Cuckoo_search_and_firefly_algorithm_Overview_and_analysis_cuckoo_search_and_firefly_algorithm","291154154_Computer_representation_of_overcurrent_relay_characteristics","263172100_Cuckoo_Search_and_Firefly_Algorithm_Theory_and_Applications","260606756_Optimal_coordination_of_directional_over-current_relays_using_informative_differential_evolution_algorithm","259097515_Coordination_of_directional_overcurrent_relays_using_opposition_based_chaotic_differential_evolution_algorithm","257873788_An_Analytic_Approach_for_Optimal_Coordination_of_Overcurrent_Relays","256970663_Optimal_coordination_of_directional_over-current_relays_using_Teaching_Learning-Based_Optimization_TLBO_algorithm"]}