{"id":"281298896_Towards_Fully_Reflective_Environments","abstract":"Modern development environments promote live programming (LP) mechanisms because it enhances the development experience by providing instantaneous feedback and interaction with live objects. LP is typically supported with advanced reflective techniques within dynamic languages. These languages run on top of Virtual Machines (VMs) that are built in a static manner so that most of their components are bound at compile time. As a consequence, VM developers are forced to work using the traditional edit-compile-run cycle, even when they are designing LP-supporting environments. In this paper we explore the idea of bringing LP techniques to the VM domain for improving their observability, evolution and adaptability at run-time. We define the notion of fully reflective execution environments (EEs), systems that provide reflection not only at the application level but also at the level of the VM. We characterize such systems, propose a design, and present Mate v1, a prototypical implementation. Based on our prototype, we analyze the feasibility and applicability of incorporating reflective capabilities into different parts of EEs. Furthermore, the evaluation demonstrates the opportunities such reflective capabilities provide for unanticipated dynamic adaptation scenarios, benefiting thus, a wider range of users.","authors":["Guido Chari","Diego Garbervetsky","Stefan Marr","Stéphane Ducasse"],"meta":["October 2015","DOI:10.1145/2814228.2814241","Conference: Onward! 2015At: Pittsburgh, PA, USA","Project: Reflective Execution Environments"],"references":["281050353_Benzo_Reflective_Glue_for_Low-level_Programming","275654155_Zero-Overhead_Metaprogramming_Reflection_and_Metaobject_Protocols_Fast_and_without_Compromises","262324669_An_Analysis_of_Language-Level_Support_for_Self-Adaptive_Software","262170315_One_VM_to_rule_them_all","261959964_Delegation_Proxies_The_Power_of_Propagation","330265230_The_Art_of_the_Metaobject_Protocol","312998869_VMKit_A_substrate_for_managed_runtime_environments","278412143_VMKit","269132322_Flexible_object_layouts","267857088_The_Impact_of_Meta-Tracing_on_VM_Design_and_Implementation","254041570_Object-centric_debugging","258629352_Maxine_An_Approachable_Virtual_Machine_For_and_In_Java","254007119_Bootstrapping_a_self-hosted_research_virtual_machine_for_JavaScript_An_experience_report","254006689_Fine-grained_modularity_and_reuse_of_virtual_machine_components","245493962_The_Art_of_the_Metaobject_Protocol"]}