{"id":"281310970_Resolution_doubling_with_a_reduced_number_of_image_acquisitions","abstract":"Structured illumination technique enhances the lateral resolution by projecting non-uniform intensity patterns on a sample. In a typical implementation, three lateral phase shifts (0, 2π/3, 4π/3) are needed for each orientation of the sinusoidal pattern, and 3 different orientations are needed to double the bandwidth isotopically in the Fourier domain. To this end, 9 incoherent images are needed in the acquisition process. In this paper, we discuss an imaging strategy for the structured illumination technique and demonstrate the use of a modified incoherent Fourier ptychographic procedure for reducing the number of acquisitions. In the first implementation, we used complementary sinusoidal patterns for sample illumination. We show that, the number of lateral phase shifts can be reduced from 3 to 2 for each orientation of the sinusoidal pattern and the total number of image acquisitions can be reduced to 6 with 3 orientations. In the second implementation, we further reduce the number of image acquisitions to 4. We also show that, the resolution-doubled image can be recovered even with unknown phases of the sinusoidal patterns. We validate the proposed imaging procedure with non-fluorescence samples. The reported approach may shorten the acquisition time of super-resolution imaging and reduce phototoxicity of biological samples.","authors":["Siyuan Dong","Jun Liao","Kaikai Guo","Liheng Bian"],"meta":["August 2015Biomedical Optics Express 6(8):2946-52","DOI:10.1364/BOE.6.002946","SourcePubMed","Project: Whole Slide Imaging (WSI)"],"references":["270895978_Resolution_enhancement_in_nonlinear_scanning_microscopy_through_post-detection_digital_computation","270515492_Incoherent_Fourier_ptychographic_photography_using_structured_light","267449150_Lattice_Light_Sheet_Microscopy_Imaging_Molecules_to_Embryos_at_High_Spatiotemporal_Resolution","266677080_Speckle_correlation_resolution_enhancement_of_wide-field_fluorescence_imaging","260206053_Corrigendum_Wide-field_high-resolution_Fourier_ptychographic_microscopy","241697927_Fluorescent_microscopy_beyond_diffraction_limits_using_speckle_illumination_and_joint_support_recovery","235927623_Super-resolution_by_confocal_fluorescent_microscopy","275102481_Superresolved_imaging_based_on_wavelength_multiplexing_of_projected_unknown_speckle_patterns","264991470_High-resolution_fluorescence_imaging_via_pattern-illuminated_Fourier_ptychography","262951636_Resolving_a_misconception_about_structured_illumination"]}