{"id":"281319887_Sistemas_de_Informacion_en_Salud_Integrando_Datos_Clinicos_en_Diferentes_Escenarios_y_Usuarios","abstract":"Despite the technological advances of recent decades and the many documented benefits, the implementation of information and communication technologies (ICT) in health remains a major challenge for healthcare organizations. Looking to contribute to the analysis of multiple variables involved at the time of achieving successful implementation, we apply a socio-technical model to analyze the experience of computerization of the clinical layer in the Italian Hospital of Buenos Aires. The conceptual framework applied consists of eight interconnected dimensions that allow the review of different aspects to consider at the time of design, development, implementation, use and evaluation of the application of ICT. Considering the evolution of our project, we divided it into three stages, so that each of the dimensions is analyzed in each of the stages. The socio-technical model applied resulted in an appropriate tool for assessing our implementation of ICT in health, allowing us the analysis of the eight dimensions, including retrospectively. Applying this analysis to each of the stages of the evolution of our institutional project we were able to show that by taking into account all aspects together, its execution was facilitated and allowed us to identify areas for improvement.","authors":["Fernando Plazzotta","Daniel Luna","Fernán González Bernaldo de Quirós"],"meta":["May 2015Revista Peruana de Medicina Experimental y Salud Publica 32(2):343","DOI:10.17843/rpmesp.2015.322.1630","Projects: Proyecto Itálica - Hospital Italiano de Buenos AiresProyecto Itálica - Hospital Italiano de Buenos Aires"],"references":["281099733_Electronic_Health_Record_System_Contingency_Plan_Coordination_A_Strategy_for_Continuity_of_Care_Considering_Users'_Needs","265989918_Especialistas_en_Informatica_Medica_10_anos_de_experiencia_de_un_porgrama_de_residencias_medicas_en_Sudamerica","265093261_Integrating_Personalized_Health_Information_from_MedlinePlus_in_a_Patient_Portal","265093200_The_expectations_of_nurses_about_the_implementation_of_a_Barcoded_Medication_Administration_System_a_qualitative_study","260779643_Implementacion_de_un_sistema_de_mensajeria_electronica_HL7_para_la_integracion_de_un_sistema_multiplataforma","256931845_Barriers_for_Adopting_Electronic_Health_Records_EHRs_by_Physicians","255694067_Predictive_Variables_of_the_Use_of_Personal_Health_Record_The_Hospital_Italiano_de_Buenos_Aires_Study","255694065_Developing_and_Implementing_an_Interoperable_Document-based_Electronic_Health_Record","276942181_Effect_of_Clinical_Decision-Support_Systems","238074700_Implementacion_de_una_Historia_Clinica_Electronica_Ambulatoria_El_Proyecto_Italica"]}