{"id":"281396646_Generative_and_accumulative_recursion_made_fun_for_beginners","abstract":"In a programming classroom for beginners, a delicate balance must be struck between teaching the design, implementation, and testing fundamentals of programming and the need for students to find their first programming course enjoyable. A course that focuses solely on the fundamentals is not likely to nourish the excitement a student may have for Computer Science. A course that focuses solely in making programming fun is not likely to have students walk away with a solid grasp of the fundamentals. A very successful approach to strike this balance uses functional video games to motivate the need to learn principles of program design and Computer Science in a context that is of interest and fun for most students. Such an approach has successfully engaged students to learn design and implementation principles using primitive data, finite compound data, structural recursion for compound data of arbitrary size, and abstraction. This article explores how to use a functional video game approach to engage beginning students in problem solving that employs generative and accumulative recursion while at the same time reinforcing the lessons on structural recursion and abstraction. In addition to these two new forms of recursion, beginning students are also introduced to depth-first searching, breadth-first searching, heuristic-based searching, and the use of randomness. The article uses the N-puzzle problem to illustrate how all these topics are seamlessly addressed in the beginners classroom while keeping student enthusiasm high as evidenced by student feedback.","authors":["Marco T. Morazán"],"meta":["August 2015Computer Languages Systems & Structures 44","DOI:10.1016/j.cl.2015.08.001"],"references":["221536957_Conceptual_models_and_cognitive_learning_styles_in_teaching_recursion","221335551_Functional_Video_Games_in_the_CS1_Classroom","220427011_What_Else_Should_CS_Educators_Know","2541140_Using_Visualization_To_Teach_Novices_Recursion","2363546_DrScheme_A_Programming_Environment_for_Scheme","305262808_Viewpoint_Ruminations_on_Computer_Science_Curricula","287627604_Gender_and_Computers_Understanding_the_Digital_Divide","283771484_Recursion_vs_Iteration_An_Empirical_Study_of_Comprehension_Revisited","266657981_The_Canny_Skipper_-_A_Puzzle_For_Demonstrating_Data_Structures_And_Recursion","246393956_How_to_Design_Programs_An_Introduction_to_Computing_and_Programming","234827465_Explaining_recursion_to_the_unsophisticated","224061093_Pedagogical_Possibilities_for_the_N-Puzzle_Problem","221936221_Artificial_Intelligence_A_Modern_Approach","220694695_Artificial_intelligence_2_ed"]}