{"id":"281374001_Real-Time_QoS_Routing_Protocols_in_Wireless_Multimedia_Sensor_Networks_Study_and_Analysis","abstract":"Many routing protocols have been proposed for wireless sensor networks. These routing protocols are almost based on energy efficiency. However, the recent advances in of complementary metal-oxide semiconductor (CMOS) camera and small microphones have led to the development of Wireless Multimedia sensor networks (WMSN) as a class of wireless sensor networks which pose additional challenges. The transmission of imaging and video data needs routing protocol with both energy efficiency and Quality of Service (QoS) characteristics in order to guarantee the efficient use of the sensor nodes and effective access to the collected data. Also, with integration of real time applications in the Wireless Senor Networks (WSNs), the use of QoS routing protocols is not only becoming a significant topic but is also gaining the attention of researches. In designing an efficient QoS routing protocol, the reliability and guarantee of end-to-end delay are critical events while conserving energy. Thus, considerable research has been proposed for designing energy efficient and robust QoS routing protocols. In this paper, we present a state of the art research work based on QoS routing protocols for Wireless Multimedia sensor networks (WMSN) that have already been proposed. This paper categorizes the QoS routing protocols into probabilistic and deterministic protocols. In addition, both categories are classified into soft and hard real time protocols by highlighting the QoS issues including limitations and features of each protocol. Furthermore, we have compared the performance of known routing protocols using network simulator-2 (NS2). This paper also focuses on the design challenges and future research directions as well as highlights the characteristics of each QoS routing protocol.","authors":["Adwan Alanazi","Khaled Elleithy"],"meta":["August 2015Sensors 15(8):22209-22233","DOI:10.3390/s150922209"],"references":["279178558_Modular_Energy_Efficient_and_Robust_Paradigms_for_Disaster-Recovery_Process_over_Wireless_Sensor_Networks","273585347_Quality_of_Service_QoS_Provisions_in_Wireless_Sensor_Networks_and_Related_Challenges","267561614_QoS_Based_and_Energy_Aware_Multi-Path_Hierarchical_Routing_Algorithm_in_WSNs","260921832_Pheromone_Termite_PT_Model_to_Provide_Robust_Routing_over_Wireless_Sensor_Networks","301201303_Trade-Off_Between_Performance_and_Energy_Consumption_in_Wireless_Sensor_Networks","283656404_QoS-based_routing_protocol_with_load_balancing_for_wireless_multimedia_sensor_networks_using_genetic_algorithm","276515690_Quality-of-Service_Routing_Protocol_for_Wireless_Sensor_Networks","262320800_Lightweight_routing_with_dynamic_interests_in_wireless_sensor_and_actor_networks","262207543_Real-time_routing_in_wireless_sensor_Networks_A_potential_field_Approach","261491004_Hierarchical_adaptive_balanced_energy_efficient_routing_protocol_HABRP_for_heterogeneous_wireless_sensor_networks"]}