{"id":"281307379_A_Fuzzy_Logic-Based_Clustering_Algorithm_for_WSN_to_Extend_the_Network_Lifetime","abstract":"Wireless sensor network (WSN) brings a new paradigm of real-time embedded systems with limited computation, communication, memory, and energy resources that are being used for huge range of applications where the traditional infrastructure-based network is mostly infeasible. The sensor nodes are densely deployed in a hostile environment to monitor, detect, and analyze the physical phenomenon and consume considerable amount of energy while transmitting the information. It is impractical and sometimes impossible to replace the battery and to maintain longer network life time. So, there is a limitation on the lifetime of the battery power and energy conservation is a challenging issue. Appropriate cluster head (CH) election is one such issue, which can reduce the energy consumption dramatically. Low energy adaptive clustering hierarchy (LEACH) is the most famous hierarchical routing protocol, where the CH is elected in rotation basis based on a probabilistic threshold value and only CHs are allowed to send the information to the base station (BS). But in this approach, a super-CH (SCH) is elected among the CHs who can only send the information to the mobile BS by choosing suitable fuzzy descriptors, such as remaining battery power, mobility of BS, and centrality of the clusters. Fuzzy inference engine (Mamdani's rule) is used to elect the chance to be the SCH. The results have been derived from NS-2 simulator and show that the proposed protocol performs better than the LEACH protocol in terms of the first node dies, half node alive, better stability, and better lifetime.","authors":["Padmalaya Nayak","D. Anurag"],"meta":["January 2015IEEE Sensors Journal 16(1):1-1","DOI:10.1109/JSEN.2015.2472970","Project: Minimization of Energy Consumption for Wireless Sensor Network using Fuzzy Clustering Algorithm"],"references":["276203969_Fuzzy-based_Leader_Selection_for_Topology_Controlled_PEGASIS_Protocol_for_Lifetime_Enhancement_in_Wireless_Sensor_Network","257640276_An_energy-aware_distributed_clustering_protocol_in_wireless_sensor_networks_using_fuzzy_logic","312108843_Energy-efficient_communication_protocol_for_wireless_microsensor_networks","283043755_F-MCHEL_fuzzy_based_master_cluster_head_election_leach_protocol_in_wireless_sensor_network","266176281_Improving_on_LEACH_Protocol_of_Wireless_Sensor_Networks_Using_Fuzzy_Logic","224310633_CHEF_Cluster_Head_Election_mechanism_using_Fuzzy_logic_in_Wireless_Sensor_Networks","224250340_A_Moving_Base_Station_Strategy_Using_Fuzzy_Logic_for_Lifetime_Enhancement_in_Wireless_Sensor_Network","224219852_HERFA_Hybrid_Energy_Efficient_Routing_using_a_Fuzzy_Method_in_Wireless_Sensor_Networks","222702366_A_Survey_on_Routing_Protocols_for_Wireless_Sensor_Networks","222193242_An_Experiment_in_Linguistic_Synthesis_with_a_Fuzzy_Logic_Controller"]}