{"id":"281312571_Quantifying_and_reducing_model-form_uncertainties_in_Reynolds_averaged_Navier-Stokes_equations_A_data-driven_physics-informed_Bayesian_approach","abstract":"Despite their well-known limitations, Reynolds-Averaged Navier–Stokes (RANS) models are still the workhorse tools for turbulent flow simulations in today's engineering analysis, design and optimization. While the predictive capability of RANS models depends on many factors, for many practical flows the turbulence models are by far the largest source of uncertainty. As RANS models are used in the design and safety evaluation of many mission-critical systems such as airplanes and nuclear power plants, quantifying their model-form uncertainties has significant implications in enabling risk-informed decision-making. In this work we develop a data-driven, physics-informed Bayesian framework for quantifying model-form uncertainties in RANS simulations. Uncertainties are introduced directly to the Reynolds stresses and are represented with compact parameterization accounting for empirical prior knowledge and physical constraints (e.g., realizability, smoothness, and symmetry). An iterative ensemble Kalman method is used to assimilate the prior knowledge and observation data in a Bayesian framework, and to propagate them to posterior distributions of velocities and other Quantities of Interest (QoIs). We use two representative cases, the flow over periodic hills and the flow in a square duct, to evaluate the performance of the proposed framework. Both cases are challenging for standard RANS turbulence models. Simulation results suggest that, even with very sparse observations, the obtained posterior mean velocities and other QoIs have significantly better agreement with the benchmark data compared to the baseline results. At most locations the posterior distribution adequately captures the true model error within the developed model form uncertainty bounds. The framework is a major improvement over existing black-box, physics-neutral methods for model-form uncertainty quantification, where prior knowledge and details of the models are not exploited. This approach has potential implications in many fields in which the governing equations are well understood but the model uncertainty comes from unresolved physical processes.","authors":["Heng Xiao","Jinlong Wu","Jian-Xun Wang","Rui Sun"],"meta":["August 2016Journal of Computational Physics 324:115-136","DOI:10.1016/j.jcp.2016.07.038","SourcearXiv","Project: Physics-informed, data driven framework for model-form uncertainty estimation and reduction in RANS simulations"],"references":["301717737_Using_field_inversion_to_quantify_functional_errors_in_turbulence_closures","283117807_A_Bayesian_Calibration-Prediction_Method_for_Reducing_Model-Form_Uncertainties_with_Application_in_RANS_Simulations","278156450_Learning_about_physical_parameters_The_importance_of_model_discrepancy","273776405_Saltelli_A_Stark_PB_Becker_W_and_Stano_P_2015_Climate_Models_As_Economic_Guides_Scientific_Challenge_or_Quixotic_Quest_Soon_to_appear_in_the_Spring_2015_volume_of_Issues_in_Science_and_Technology_wwwi","313136016_Orthonormal_bases_of_compactly_supported_wavelets","301924937_Data_Assimilation_The_Ensemble_Kalman_Filter","290987433_Orthonormal_bases_of_compactly_supported_wavelets_Comm_Pure_and_Appl","285599740_A_selection_of_test_cases_for_the_validation_of_large-eddy_simulations_of_turbulent_flows","284607191_A_numerical_study_of_the_turbulent_flow_past_an_isolated_airfoil_with_trailing_edge_separation","283712213_A_paradigm_for_data-driven_predictive_modeling_using_field_inversion_and_machine_learning"]}