{"id":"281319260_Phytochemical_screening_and_in_vitro_antimicrobial_activity_of_Tridax_procumbens_L","abstract":"Background: Tridax procumbens has an eminent identity as medicine in traditional Ayurveda practices for variety of disorders. Several pharmacological activities like anti-diabetic, anti-inflammatory, anti-cancer, hepatoprotective, bloods clotting etc are associated with it. Objective: Phytochemical screening and antimicrobial activity of acetone and methanolic extracts of Tridax procumbens L. and its blood clotting activity. Method: The phytochemical screening and antibacterial activity of the acetone and methanolic extracts of plant parts was determined by using agar well diffusion assay on both gram positive and gram negative bacteria. Results: Extracts showed considerably good antibacterial activity against gram positive and gram negative bacteria such as Staphylococcus aureus, Bacillus subtilis, Bacillus cereus, E. coli and serettia marsescens. The qualitative phytochemical analysis of powdered extracts show presence of phytoconstituents as tannins, alkaloids, saponins, flavonoids, phenols steroids, anthocyanins, proteins, amino acids and carbohydrate. Aqueous extract of leaves showed the enhanced blood clotting activity in its presence. Conclusion: Crude extracts showed significant antimicrobial activity and aqueous leaves extract showed enhanced blood clotting activity which can be used for therapeutic purpose which is need of the hour.","authors":["Sowmya Babu","Sanjivani B. Gajdhane","Pramod Jyotiram Kasabe","Prashant Bhagwat"],"meta":["June 2015","Project: Phytomedicines"],"references":["295605882_ANTIBACTERIAL_POTENTIAL_OF_TRIDAX_PROCUMBENS_L_AGAINST_HUMAN_PATHOGENS","282657692_Evaluation_of_anti-cancer_activity_of_Tridax_Procumbens_flower_extracts_on_PC_3_cell_lines","264436745_Nutritional_elemental_analysis_and_antioxidant_activity_of_Garden_cress_Lepidium_Sativum_L_seeds","264436611_Evaluation_of_medicinal_and_nutritional_components_from_the_Eleagnus_conferta_fruit","257746653_Phytochemical_and_antibacterial_studies_of_leaves_of_Tridax_procumbens_L","279760234_Phytochemical_constituents_of_some_selected_medicinal_plants","272580675_Antibacterial_activity_of_some_powdered_herbal_preparations_marketed_in_Kaduna_metropolis","267844698_Preliminary_Phytochemical_Screening_and_Antipyretic_Activity_of_Carissa_Spinarum_Root_Extract","247917694_Hemostatic_activity_of_the_leaves_of_Tridax_procumbens_Linn","237748649_Antibacterial_Activity_of_Important_Medicinal_Plants_on_Human_Pathogenic_Bacteria-a_Comparative_Analysis"]}