{"id":"281487982_Parameter-Invariant_Design_of_Medical_Alarms","abstract":"The recent explosion of low-power low-cost communication, sensing, and actuation technologies has ignited the automation of medical diagnostics and care in the form of medical cyber physical systems (MCPS). MCPS are poised to revolutionize patient care by providing smarter alarm systems, clinical decision support, advanced diagnostics, minimally invasive surgical care, improved patient drug delivery, and safety and performance guarantees. With the MCPS revolution emerges a new era in medical alarm systems, where measurements gathered via multiple devices are fused to provide early detection of critical conditions. The alarms generated by these next generation monitors can be exploited by MCPS to further improve performance, reliability, and safety.\nCurrently, there exist several approaches to designing medical monitors ranging from simple sensor thresholding techniques to more complex machine learning approaches. While all the current design approaches have different strengths and weaknesses, their performance degrades when underlying models contain unknown parameters and training data is scarce. Under this scenario, an alternative approach that performs well is the parameter-invariant detector, which utilizes sufficient statistics that are invariant to unknown parameters to achieve a constant false alarm rate across different systems. Parameter-invariant detectors have been successfully applied in other cyber physical systems (CPS) applications with structured dynamics and unknown parameters such as networked systems, smart buildings, and smart grids; most recently, the parameter-invariant approach has been recently extended to medical alarms in the form of a critical shunt detector for infants undergoing a lung lobectomy. The clinical success of this case study application of the parameter-invariant approach is paving the way for a range of other medical monitors.\nIn this tutorial, we present a design methodology for medical parameter-invariant monitors. We begin by providing a motivational review of currently employed medical alarm techniques, followed by the introduction of the parameter-invariant design approach. Finally, we present a case study example to demonstrate the design of a parameter-invariant alarm for critical shunt detection in infants during surgical procedures.","authors":["James Weimer","Radoslav Ivanov","Alexander Roederer","Sanjian Chen"],"meta":["October 2015IEEE Design and Test 32(5):9-16","DOI:10.1109/MDAT.2015.2451083"],"references":["261468677_A_cyber-physical_system_approach_to_artificial_pancreas_design","224253419_Cyber-Physical_Modeling_of_Implantable_Cardiac_Medical_Devices","220565847_Anomaly_Detection_A_Survey","7809513_Fewer_but_better_auditory_alarms_will_improve_patient_safety","316362800_Introduction_to_Modeling_in_Physiology_and_Medicine","299401510_Prediction_of_Critical_Pulmonary_Shunts_in_Infants","280940018_Pattern_Recognition_and_Machine_Learning","279958125_Teubner_Studienbucher_Chemie","233807015_Statistical_Signal_Processing","223126027_A_Survey_of_Design_Methods_for_Failure_Detection_in_Dynamic_System","221995544_Pattern_Recognition_and_Machine_Learning","6784034_Temporal_abstraction_in_intelligent_clinical_data_analysis_A_survey"]}