{"id":"281431283_Combination_of_contrast_limited_adaptive_histogram_equalisation_and_discrete_wavelet_transform_for_image_enhancement","abstract":"Image enhancement has an important role in image processing applications. Contrast limited adaptive histogram equalisation (CLAHE) is an effective algorithm to enhance the local details of an image. However, it faces the contrast overstretching and noise enhancement problems. To solve these problems, this study presents a novel image enhancement method, named CLAHE-discrete wavelet transform (DWT), which combines the CLAHE with DWT. The new method includes three main steps: First, the original image is decomposed into low-frequency and high-frequency components by DWT. Then, the authors enhance the low-frequency coefficients using CLAHE and keep the high-frequency coefficients unchanged to limit noise enhancement. This is because the high-frequency component corresponds to the detail information and contains most noises of original image. Finally, reconstruct the image by taking inverse DWT of the new coefficients. To alleviate over-enhancement, the reconstructed and original images are averaged using an originally proposed weighting factor. The weighting operation can control the enhancement levels of regions with different luminances in original image adaptively. This is important because bright parts of image are usually needless to be enhanced in comparison with the dark parts. Extensive experiments show that this method performs well in detail preservation and noise suppression.","authors":["Zhao Wei","Wang Jun","Sun Zebin","Lidong Huang"],"meta":["June 2015Image Processing, IET 9(10)","DOI:10.1049/iet-ipr.2015.0150"],"references":["260088957_Multi-kernel_based_adaptive_interpolation_for_image_super-resolution_Multimedia_Tools_Appl_1-23","257627532_Multi-kernel_based_adaptive_interpolation_for_image_super-resolution","224348948_Flattest_histogram_specification_with_accurate_brightness_preservation","278860756_'Contrast_Enhancement_Using_Brightness_Preserving_Bi_Histogram_Equalization'","276405113_Entropy_maximisation_histogram_modification_scheme_for_image_enhancement","271439313_Fast_Local_Laplacian_Filters","260501209_Image_enhancement_using_background_brightness_preserving_histogram_equalisation","260501204_Acoustic_targets_feature_extraction_method_based_on_manifold_learning","233396215_Efficient_Contrast_Enhancement_Using_Adaptive_Gamma_Correction_With_Weighting_Distribution","224436813_A_Histogram_Modification_Framework_and_Its_Application_for_Image_Contrast_Enhancement"]}