{"id":"281403885_Stylized_Facts_as_an_Instrument_for_Literature_Review_and_Cumulative_Information_Systems_Research","abstract":"The accumulation of scientific knowledge is an important objective of information systems (IS) research. Although different review approaches exist in the continuum between narrative reviews and meta-analyses, most reviews in IS are narrative or descriptive — with all related drawbacks concerning objectivity and reliability — because available underlying sources in IS do typically not fulfil the requirements of formal approaches such as meta-analyses. To discuss how cumulative IS research can be effectively advanced using a more formalized approach fitting the current situation in IS research, in this paper, we point out the potential of stylized facts (SFs). SFs are interesting, sometimes counterintuitive patterns in empirical data that focus on the most relevant aspects of observable phenomena by abstracting from details (stylization). SFs originate from the field of economics and have been successfully used in different fields of research for years. In this paper, we discuss their potential and challenges for literature reviews in IS. We supplement our argumentation with an application example reporting our experience with SFs. Because SFs show considerable potential for cumulative research, they seem to be a promising instrument for literature reviews and especially for theory development in IS.","authors":["Constantin Houy","Peter Fettke","Peter Loos"],"meta":["August 2015Communications of the Association for Information Systems 37(1):225-256","DOI:10.17705/1CAIS.03710"],"references":["346450361_Wissenschaftliche_Erkenntnis_Eine_ideengeschichtliche_Einfuhrung_in_die_Wissenschaftstheorie_2_Auflage","315431914_The_New_Stylized_Facts_About_Income_and_Subjective_Well-Being","314896276_A_Queueing_Theory_Description_of_Fat-Tailed_Price_Returns_in_Imperfect_Financial_Markets","313046043_The_Bullwhip_Effect_in_Supply_Chains","312984568_Perceived_usefulness_perceived_ease_and_user_acceptance_of_information_technology","309311435_What_constitutes_a_theoretical_contribution","308128093_Ansatze_der_Informationsmodellierung_und_ihre_betriebswirtschaftliche_Bedeutung_Eine_Untersuchung_der_Modellierungspraxis_in_Deutschland","290454109_Meta-Analytic_Procedures_for_Social_Science_Research","289936154_Capital_Accumulation_and_Economic_Growth","287961667_Modellierung_uberbetrieblicher_behandlungsprozesse_durch_objekt-petrinetze"]}