{"id":"281412919_Personalised_Learning_Materials_Based_on_Dyslexia_Types_Ontological_Approach","abstract":"In recent years, e-learning systems have played an increasingly important role in higher education and, in particular, in enhancing learning experiences for individuals who have learning difficulties. However, it appears that many of the people involved in the development and implementation of e-learning tools overlook the needs of dyslexic students. As such, these students lack access to the resources on offer to other students and this leads to a disability divide. In order for educational initiatives to be effective, learning experiences need to be tailored to the individual needs of each student and the materials and tools employed should be aligned with the student's needs, capabilities and learning objectives. The objective of this research was to propose an ontology that will facilitate the development of learning methods and technologies that are aligned with dyslexia types and symptoms. The paper commences with a discussion of domain ontology and examines how learning objectives that take into consideration a student's capabilities and needs can be matched with appropriate assistive technology in order to deliver effective e-learning experiences and educational resources that can be consistently employed. The ontology employed within this study was developed using Ontology Web Language (OWL), an information processing system that allows applications to handle both the content and the presentation of the information available on the web. Two characteristics were employed within this research to describe each resource: dyslexia type and the features of assistive technologies that were deemed to be most appropriate for educational experiences targeted at each dyslexia type.","authors":["Aisha Alsobhi","Nawaz Khan","Harjinder Rahanu"],"meta":["December 2015Procedia Computer Science 60(1):113-121","DOI:10.1016/j.procs.2015.08.110"],"references":["312470401_Learningteaching_styles_in_engineering_education","308807038_Dyslexia_adaptive_e-learning_system_based_on_multi-layer_architecture","243772462_Ontology_Development_101_A_Guide_to_Creating_Your_First_Ontology","329486797_Integrating_adaptive_and_intelligent_techniques_into_a_web-based_environment_for_active_learning","271551618_An_evaluation_of_accessibility_of_e-learning_for_dyslexic_students","267209653_Toward_Linking_Dyslexia_Types_and_Symptoms_to_the_Available_Assistive_Technologies","262378110_User_Requirements_for_Adult_Learners_with_Special_Needs_in_Accessible_Lifelong_Learning","246779736_Mathematics_for_Dyslexics_A_Teaching_Handbook","237416322_Individual_Styles_In_Learning_To_Spell_Improving_Spelling_In_Children_With_Literacy_Difficulties_And_All_Children_In_Mainstream_Schools","229444050_The_effectiveness_of_teaching_strategies_for_students_with_dyslexia_based_on_their_preferred_learning_styles"]}