{"id":"281438978_Support_Vector_Machines_for_Classification_of_Geometric_Primitives_in_Point_Clouds","abstract":"Classification of point clouds by different types of geometric primitives is an essential part in the reconstruction process of CAD geometry. We use support vector machines (SVM) to label patches in point clouds with the class labels tori, ellipsoids, spheres, cones, cylinders or planes. For the classification, features based on different geometric properties like point normals, angles, and principal curvatures are used. These geometric features are estimated in the local neighborhood of a point of the point cloud. Computing these geometric features for a random subset of the point cloud yields a feature distribution. Different features are combined for achieving best classification results. To minimize the time consuming training phase of SVMs, the geometric features are first evaluated using linear discriminant analysis (LDA).\nLDA and SVM are machine learning approaches that require an initial training phase to allow for a subsequent automatic classification of a new data set. For the training phase point clouds are generated using a simulation of a laser scanning device. Additional noise based on an laser scanner error model is added to the point clouds. The resulting LDA and SVM classifiers are then used to classify geometric primitives in simulated and real laser scanned point clouds. Compared to other approaches, where all known features are used for classification, we explicitly compare novel against known geometric features to prove their effectiveness.","authors":["Manuel Caputo","Klaus Denker","Matthias O. Franz","Pascal Laube"],"meta":["January 2015","DOI:10.1007/978-3-319-22804-4_7","Conference: 8th International Conference on Curves and SurfacesAt: ParisVolume: LNCS 9213"],"references":["231512914_Efficient_manifold_learning_for_3D_model_retrieval_by_using_clustering-based_training_sample_reduction","224136139_Shape-based_recognition_of_3D_point_clouds_in_urban_environments","284929031_The_Development_of_a_Model_for_Christian_Team_Based_Learning","261495651_Evaluation_of_3D_feature_descriptors_for_classification_of_surface_geometries_in_point_clouds","261353694_Robust_descriptors_for_3D_point_clouds_using_Geometric_and_Photometric_Local_Feature","261262777_On-line_Reconstruction_of_CAD_Geometry","248590871_An_introduction_to_sup_-_port_vector_machines_and_other_kernel_-_based_methods","246764408_Marching_Cubes_A_High_Resolution_3d_Surface_Construction_Algorithm","241404587_Persistent_Point_Feature_Histograms_for_3D_Point_Clouds","222433165_Three-dimensional_point_cloud_recognition_via_distributions_of_geometric_distances"]}