{"id":"281471777_Parameterization_of_the_functional-structural_RATP_model_for_apple_trees_Application_to_simulate_photosynthesis_and_transpiration_of_fruiting_branches","abstract":"Temporal and spatial variations of photosynthesis and transpiration are particularly important when considering vegetative growth and fruit variability in fruit trees. Spatial variation of physiological processes depends on light distribution, which in turn depends on the relative position of main branches and geometry of their foliage. The general aim of this research was to investigate the capacity of RATP (radiation absorption, transpiration, photosynthesis) functional-structural model to adequately simulate the within-tree behavior of fruiting branches at an intra-hourly step-time. This paper presents the parameterization of this model on the apple tree, comparing two cultivars, and some first attempts at running the model. The experiments were carried out at INRA experimental station, Melgueil (France). Eight-years-old Fuji and Braeburn apple trees were studied. Aerial systems were described and digitized considering both topology and geometry of the tree constituents. Photosynthesis and stomatal conductance responses to different environmental conditions (light radiation (PAR), leaf temperature (Tl), VPD (Vapor Pressure Deficit) and CO2 concentration) were analyzed at a leaf level. As Jmax (maximal electron transport rate) and Vcmax (maximal carboxylation rate of Rubisco) did not reveal any significant difference between cultivars, unique values plotted against nitrogen content per unit leaf area (Na) were implemented in Farquhar’s biochemical model of photosynthesis. Rd (diurnal respiration) values appeared somewhat different between cultivars. Responses of stomatal conductance to environmental factors (PAR, Tl and VPD) were determined to parameterize the stomatal conductance model of Jarvis. Our results demonstrated the necessity of a cultivar-specific parameterization of this model, especially for gsmax values and gs responses to VPD. For RATP model running, leaf Na was inferred from integrated light interception in each discretized canopy volume (voxel). Experimental observations, that were carried out at the branch scale were used to assess model simulations: total branch sap flow and CO2 exchange were measured by means of heat balance methods and branch bags, respectively. RATP model parameterized in this way made it possible to simulate transpiration and photosynthesis in concordance with experimental measurements. The potential use of RATP model is discussed","authors":["Catherine Massonnet","Jean Luc Regnard","Evelyne Costes","Herve Sinoquet"],"meta":["June 2004Acta Horticulturae 707(707)","DOI:10.17660/ActaHortic.2006.707.9"],"references":["283869613_Integrating_apple_tree_aerial_and_root_architecture_in_a_structure_-_Function_approach","266140109_THE_VERTICAL_AXIS_AND_SOLAXE_SYSTEMS_IN_FRANCE","240498558_Une_methode_de_mesure_du_debit_de_seve_brute_dans_de_petits_arbres_par_bilan_de_chaleur","230039958_Reponses_of_apple_leaf_stomata_to_environmental_factors","223598643_Stomatal_responses_to_drought_of_mature_trees_and_seedlings_of_two_co-occurring_Mediterranean_oaks","43919063_Components_of_functional-structural_tree_models","10842460_Influence_of_canopy_light_environment_and_nitrogen_availability_on_leaf_photosynthetic_characteristics_and_photosynthetic_nitrogen-use_efficiency_of_field-grown_nectarine_trees","286584126_CO2_assimilation_in_relation_to_nitrogen_in_apple_leaves","227514421_RATP_A_model_for_simulating_the_spatial_distribution_of_radiation_absorption_transpiration_and_photosynthesis_within_canopies_Application_to_an_isolated_tree_crown","10842461_Spatial_distribution_of_leaf_dry_weight_per_area_and_leaf_nitrogen_content_in_relation_to_local_radiation_regime_within_an_isolated_tree_crown"]}