{"id":"281467531_Visual_Analysis_and_Dissemination_of_Scientific_Literature_Collections_with_SurVis","abstract":"Bibliographic data such as collections of scientific articles and citation networks have been studied extensively in information visualization and visual analytics research. Powerful systems have been built to support various types of bibliographic analysis, but they require some training and cannot be used to disseminate the insights gained. In contrast, we focused on developing a more accessible visual analytics system, called SurVis, that is ready to disseminate a carefully surveyed literature collection. The authors of a survey may use our Web-based system to structure and analyze their literature database. Later, readers of the survey can obtain an overview, quickly retrieve specific publications, and reproduce or extend the original bibliographic analysis. Our system employs a set of selectors that enable users to filter and browse the literature collection as well as to control interactive visualizations. The versatile selector concept includes selectors for textual search, filtering by keywords and meta-information, selection and clustering of similar publications, and following citation links. Agreement to the selector is represented by word-sized sparkline visualizations seamlessly integrated into the user interface. Based on an analysis of the analytical reasoning process, we derived requirements for the system. We developed the system in a formative way involving other researchers writing literature surveys. A questionnaire study with 14 visual analytics experts confirms that SurVis meets the initially formulated requirements.","authors":["Fabian Beck","Sebastian Koch","Daniel Weiskopf"],"meta":["November 2015IEEE Transactions on Visualization and Computer Graphics 22(1):1-1","DOI:10.1109/TVCG.2015.2467757","Project: Vis-Text Interaction"],"references":["280878061_The_State_of_the_Art_in_Visualizing_Group_Structures_in_Graphs","279034734_Visualization_of_eye_tracking_data","271373921_A_Quasi-Systematic_Review_on_Software_Visualization_Approaches_for_Software_Reuse","322880937_VisIRR_A_Visual_Analytics_System_for_Information_Retrieval_and_Recommendation_for_Large-Scale_Document_Data","308732830_Rethinking_User_Interfaces_for_Feature_Location","307513199_Visualizing_High-Dimensional_Data_Advances_in_the_Past_Decade","303783093_Visualizing_sets_and_set-typed_data_State-of-the-art_and_future_challenges","282524324_CiteRivers_Visual_Analytics_of_Citation_Patterns","281244803_Text_visualization_techniques_Taxonomy_visual_survey_and_community_insights","279406707_TileBars"]}