{"id":"281461046_Credit_Card_Fraud_Detection_and_Concept-Drift_Adaptation_with_Delayed_Supervised_Information","abstract":"Most fraud-detection systems (FDSs) monitor streams of credit card transactions by means of classifiers returning alerts for the riskiest payments. Fraud detection is notably a challenging problem because of concept drift (i.e. customers' habits evolve) and class unbalance (i.e. genuine transactions far outnumber frauds). Also, FDSs differ from conventional classification because, in a first phase, only a small set of supervised samples is provided by human investigators who have time to assess only a reduced number of alerts. Labels of the vast majority of transactions are made available only several days later, when customers have possibly reported unauthorized transactions. The delay in obtaining accurate labels and the interaction between alerts and supervised information have to be carefully taken into consideration when learning in a concept-drifting environment. In this paper we address a realistic fraud-detection setting and we show that investigator's feedbacks and delayed labels have to be handled separately. We design two FDSs on the basis of an ensemble and a sliding-window approach and we show that the winning strategy consists in training two separate classifiers (on feedbacks and delayed labels, respectively), and then aggregating the outcomes. Experiments on large dataset of real-world transactions show that the alert precision, which is the primary concern of investigators, can be substantially improved by the proposed approach.","authors":["Andrea Dal Pozzolo","Giacomo Boracchi","Olivier Caelen","Cesare Alippi"],"meta":["July 2015","DOI:10.1109/IJCNN.2015.7280527","Conference: IJCNNAt: Killarney, Ireland","Project: Fraud detection with machine learning"],"references":["302557906_A_Comprehensive_Survey_of_Data_Mining-based_Fraud_Detection_Research","272486572_Using_HDDT_to_Avoid_Instances_Propagation_in_Unbalanced_and_Evolving_Data_Streams","261961254_A_Survey_on_Concept_Drift_Adaptation","260837261_Learned_lessons_in_credit_card_fraud_detection_from_a_practitioner_perspective","313501942_A_streaming_ensemble_algorithm_SEA_for_large-scale_classification","288906520_Random_forests","271548303_An_adaptive_profile_based_fraud_detection_framework_for_handling_concept_drift","262851327_Incremental_Learning_from_Noisy_Data","260353786_Just-In-Time_Classifiers_for_Recurrent_Concepts","258304769_Machine_Learning_Volume_45_Number_1_-_SpringerLink"]}