{"id":"281488227_Group_Frames_With_Few_Distinct_Inner_Products_and_Low_Coherence","abstract":"Frame theory has been a popular subject in the design of structured signals and codes in recent years, with applications ranging from the design of measurement matrices in compressive sensing, to spherical codes for data compression and data transmission, to spacetime codes for MIMO communications, and to measurement operators in quantum sensing. High-performance codes usually arise from designing frames whose elements have mutually low coherence. Building off the original “group frame” design of Slepian which has since been elaborated in the works of Vale and Waldron, we present several new frame constructions based on cyclic and generalized dihedral groups. Slepian’s original construction was based on the premise that group structure allows one to reduce the number of distinct inner pairwise inner products in a frame with elements from to . All of our constructions further utilize the group structure to produce tight frames with even fewer distinct inner product values between the frame elements. When is prime, for example, we use cyclic groups to construct -dimensional frame vectors with at most distinct inner products. We use this behavior to bound the coherence of our frames via arguments based on the frame potential, and derive even tighter bounds from combinatorial and algebraic arguments using the group structure alone. In certain cases, we recover well-known Welch bound achieving frames. In cases where the Welch bound has not been achieved, and is not known to be achievable, we obtain frames wi- h close to Welch bound performance.","authors":["Matthew Thill","Babak Hassibi"],"meta":["October 2015IEEE Transactions on Signal Processing 63(19):5222-5237","DOI:10.1109/TSP.2015.2450195"],"references":["282000204_Low-Coherence_Frames_From_Group_Fourier_Matrices","280445306_Packing_Lines_Planes_etc_Packings_in_Grassmannian_Space","347572977_Groups_Representations_and_Physics","325478406_An_introduction_to_finite_tight_frames","286651686_Frames_group_codes_and_subgroups_of_ZpZsup","268616086_Cyclic_Hadamard_Difference_Sets_-_Constructions_and_Applications","266255967_Tight_informationally_complete_quantum_measurements","265669140_Groups_Representations_and_Physics","261312149_Frames_From_Groups_Generalized_Bounds_And_Dihedral_Groups","261121948_On_frames_from_abelian_group_codes"]}