{"id":"281537631_Reinventing_Your_Business_Model","abstract":"Why is it so difficult for established companies to pull off the new growth that business model innovation can bring? Here's why: They don't understand their current business model well enough to know if it would suit a new opportunity or hinder it, and they don't know how to build a new model when they need it. Drawing on their vast knowledge of disruptive innovation and experience in helping established companies capture game-changing opportunities, consultant Johnson, Harvard Business School professor Christensen, and SAP co-CEO Kagermann set out the tools that executives need to do both. Successful companies already operate according to a business model that can be broken down into four elements: a customer value proposition that fulfills an important job for the customer in a better way than competitors' offerings do; a profit formula that lays out how the company makes money delivering the value proposition; and the key resources and key processes needed to deliver that proposition. Game-changing opportunities deliver radically new customer value propositions: They fulfill a job to be done in a dramatically better way (as P&G did with its Swiffer mops), solve a problem that's never been solved before (as Apple did with its iPod and iTunes electronic entertainment delivery system), or serve an entirely unaddressed customer base (as Tata Motors is doing with its Nano - the $2,500 car aimed at Indian families who use scooters to get around). Capitalizing on such opportunities doesn't always require a new business model: P&G, for instance, didn't need a new one to lever-age its product innovation strengths to develop the Swiffer. A new model is often needed, however, to leverage a new technology (as in Apple's case); is generally required when the opportunity addresses an entirely new group of customers (as with the Nano); and is surely in order when an established company needs to fend off a successful disruptor (as the Nano's competitors may now need to do).","authors":["Mark W. Johnson","C.C. Christensen","Henning Kagermann"],"meta":["December 2008Harvard Business Review 87(12):52-60"],"references":[]}