{"id":"281530842_Optimal_Path_Discovery_Problem_with_Homogeneous_Knowledge","abstract":"In this work we study the Optimal Path Discovery (OPD) problem. That is: given a complete graph G = (V, E), a function F : 2 E → [0, ∞) that assigns a positive value to each sub set of E, two nodes s and t in V , and a positive hidden value f (e) for each edge e ∈ E, discover a path P * between s and t that optimizes the value of F (P *). The issue is that the edge values f (·) are hidden. Hence, any algorithm that aims to solve the problem needs to uncover the value of some edges to discover an optimal path. The goal then is to discover an optimal path by means of uncovering the least possible amount of edge values. This problem is an extension of the well known Shortest Path Discovery problem in which f (e) represents the length of e ∈ E, and F (P) computes the length of P. In this paper, we present a study of the OPD problem in a setting in which homogeneous information with respect to the values f (e) is given beforehand. As a measure to evaluate the performance of an algorithm, we first study the maximum number of queries asked by an algorithm in any instance of size |V | = n. We see that this measure does not differentiate correctly algorithms according to their performance. Therefore, we introduce the query ratio, the ratio between the number of uncovered edge values and the least number of edge values required to solve the problem, as a new measure to evaluate algorithms that solve the OPD problem. When an input of size |V | = n is considered , we prove a lower bound of 1 + 4/n − 8/n 2 on the query ratio of any algorithm that solves the OPD problem. As well, we present an algorithm that solves the problem and we prove that its query ratio is equal to 2 − 1/(n − 1). Finally, we implement different algorithms and evaluate their query ratio experimentally.","authors":["Christopher Thraves-Caro","Josu Doncel","O. Brun"],"meta":["February 2020Theory of Computing Systems 64(1)","DOI:10.1007/s00224-019-09928-w"],"references":["293010581_Big_Data_for_Autonomic_Intercontinental_Overlays","312980063_On_a_routing_problem","289871472_Efficient_single_frontier_bidirectional_search","285369432_Query-Competitive_Algorithms_for_Cheapest_Set_Problems_under_Uncertainty","265374157_On_a_Routing_Problem","242562037_A_Note_on_Two_Problems_in_Connexion_with_Graphs","242476059_BIDIRECTIONAL_AND_HEURISTIC_SEARCH_IN_PATH_PROBLEMS","238799612_A_Formal_Basis_for_the_Heuristic_Determination_of_Minimum_Cost_Paths","234818783_Optimal_Path-Finding_Algorithms","228057848_A_Bidirectional_Shortest-path_Algorithm_with_Good_Average_Case_Behavior"]}