{"id":"281511455_Technology_in_postgraduate_medical_education_a_dynamic_influence_on_learning_Table_1","abstract":"The influence of technology in medical workplace learning is explored by focusing on three uses: m-learning (notably apps), simulation and social media. Smartphones with point-of-care tools (such as textbooks, drug guides and medical calculators) can support workplace learning and doctors' decision-making. Simulations can help develop technical skills and team interactions, and 'in situ' simulations improve the match between the virtual and the real. Social media (wikis, blogs, networking, YouTube) heralds a more participatory and collaborative approach to knowledge development. These uses of technology are related to Kolb's learning cycle and Eraut's intentions of informal learning. Contentions and controversies with these technologies exist. There is a problem with the terminology commonly adopted to describe the use of technology to enhance learning. Using learning technology in the workplace changes the interaction with others and raises issues of professionalism and etiquette. Lack of regulation makes assessment of app quality a challenge. Distraction and dependency are charges levelled at smartphone use in the workplace and these need further research. Unless addressed, these and other challenges will impede the benefits that technology may bring to postgraduate medical education.\nPublished by the BMJ Publishing Group Limited. For permission to use (where not already granted under a licence) please go to http://group.bmj.com/group/rights-licensing/permissions.","authors":["Alison Bullock","Katie Webb"],"meta":["September 2015Postgraduate Medical Journal 91(1081)","DOI:10.1136/postgradmedj-2014-132809","SourcePubMed"],"references":["304552704_On_Two_Metaphors_for_Learning_and_the_Dangers_of_Choosing_Just_One","279300914_Doctors_and_the_Etiquette_of_Mobile_Device_Use_in_Trauma_and_Orthopedics","275101283_How_a_mobile_app_supports_the_learning_and_practice_of_newly_qualified_doctors_in_the_UK_An_intervention_study","311706630_Technology-enhanced_Learning","292251983_Understanding_Medical_Education_Evidence_Theory_and_Practice","281562288_Discipline_and_Punish_The_Birth_of_Prison","277960887_Foucault's_toolbox_critical_insights_for_education_and_technology_researchers","271625576_Teacher_professionalization_in_the_age_of_social_networking_sites","269418528_What's_the_matter_with_'technology-enhanced_learning'","267745536_Use_of_Social_Media_in_Dental_Schools_Pluses_Perils_and_Pitfalls_from_a_Legal_Perspective"]}