{"id":"281534709_Extracting_Proofs_from_Tabled_Proof_Search","abstract":"We consider the problem of model checking specifications involving co-inductive definitions such as are available for bisimulation. A proof search approach to model checking with such specifications often involves state exploration. We consider four different tabling strategies that can minimize such exploration significantly. In general, tabling involves storing previously proved subgoals and reusing (instead of reproving) them in proof search. In the case of co-inductive proof search, tables allow a limited form of loop checking, which is often necessary for, say, checking bisimulation of non-terminating processes. We enhance the notion of tabled proof search by allowing a limited deduction from tabled entries when performing table lookup. The main problem with this enhanced tabling method is that it is generally unsound when co-inductive definitions are involved and when tabled entries contain unproved entries. We design a proof system with tables and show that by managing tabled entries carefully, one would still be able to obtain a sound proof system. That is, we show how one can extract a post-fixed point from a tabled proof for a co-inductive goal. We then apply this idea to the technique of bisimulation ''up-to'' commonly used in process algebra.","authors":["Dale Miller","Alwen Tiu"],"meta":["September 2013","DOI:10.1007/978-3-319-03545-1_13","Conference: International Conference on Certified Programs and Proofs"],"references":["221558237_Incorporating_Tables_into_Proofs","220985840_Coinductive_Logic_Programming","319394434_Higher-Order_Logic_Programming","289823516_A_Generic_Cyclic_Theorem_Prover","269009462_Programming_with_Higher-Order_Logic","265371850_Enhancements_of_the_bisimulation_proof_method","264847971_Checking_NFA_Equivalence_with_Bisimulations_up_to_Congruence","222399683_Encoding_transition_systems_in_sequent_calculus","221298811_A_CLP_proof_method_for_timed_automata","220700882_The_Problem_of_Weak_Bisimulation_up_to''"]}