{"id":"281576656_Multimodal_Data_Fusion_Using_Source_Separation_Two_Effective_Models_Based_on_ICA_and_IVA_and_Their_Properties","abstract":"Fusion of information from multiple sets of data in order to extract a set of features that are most useful and relevant for the given task is inherent to many problems we deal with today. Since, usually, very little is known about the actual interaction among the data sets, it is highly desirable to minimize the underlying assumptions. This has been the main reason for the growing importance of data-driven methods, and in particular of independent component analysis (ICA) as it provides useful decompositions with a simple generative model and using only the assumption of statistical independence. A recent extension of ICA, independent vector analysis (IVA), generalizes ICA to multiple data sets by exploiting the statistical dependence across the data sets, and hence, as we discuss in this paper, provides an attractive solution to fusion of data from multiple data sets along with ICA. In this paper, we focus on two multivariate solutions for multimodal data fusion that let multiple modalities fully interact for the estimation of underlying features that jointly report on all modalities. One solution is the joint ICA model that has found wide application in medical imaging, and the second one is the transposed IVA model introduced here as a generalization of an approach based on multiset canonical correlation analysis. In the discussion, we emphasize the role of diversity in the decompositions achieved by these two models, and present their properties and implementation details to enable the user make informed decisions on the selection of a model along with its associated parameters. Discussions are supported by simulation results to help highlight the main issues in the implementation of these methods.","authors":["Tulay Adali","Yuri Levin-Schwartz","Vince Calhoun"],"meta":["September 2015Proceedings of the IEEE 103(9):1478-1493","DOI:10.1109/JPROC.2015.2461624"],"references":["299346751_Independent_vector_analysis_for_SSVEP_signal_enhancement","282744075_Multidataset_independent_subspace_analysis_extends_independent_vector_analysis","281465747_Determining_The_Number_Of_Correlated_Signals_Between_Two_Data_Sets_Using_PCA-CCA_When_Sample_Support_Is_Extremely_Small","316189639_Blind_identification_and_separation_of_complex-valued_signals","297015178_CANONICAL_ANALYSIS_OF_SEVERAL_SETS_OF_VARIABLES","292567834_Adaptive_Signal_Processing_Next_Generation_Solutions","287467488_Incorporating_higher_dimensionality_in_joint_decomposition_of_EEG_and_fMRI","285330650_Equivariant_adaptive_source_separation","281763248_Independent_vector_analysis_for_SSVEP_signal_enhancement","281195868_Multimodal_Data_Fusion_Using_Source_Separation_Application_to_Medical_Imaging"]}