{"id":"281520956_Dynamic_reconfiguration_of_frontal_brain_networks_during_executive_cognition_in_humans","abstract":"The brain is an inherently dynamic system, and executive cognition requires dynamically reconfiguring, highly evolving networks of brain regions that interact in complex and transient communication patterns. However, a precise characterization of these reconfiguration processes during cognitive function in humans remains elusive. Here, we use a series of techniques developed in the field of \"dynamic network neuroscience\" to investigate the dynamics of functional brain networks in 344 healthy subjects during a working-memory challenge (the \"n-back\" task). In contrast to a control condition, in which dynamic changes in cortical networks were spread evenly across systems, the effortful working-memory condition was characterized by a reconfiguration of frontoparietal and frontotemporal networks. This reconfiguration, which characterizes \"network flexibility,\" employs transient and heterogeneous connectivity between frontal systems, which we refer to as \"integration.\" Frontal integration predicted neuropsychological measures requiring working memory and executive cognition, suggesting that dynamic network reconfiguration between frontal systems supports those functions. Our results characterize dynamic reconfiguration of large-scale distributed neural circuits during executive cognition in humans and have implications for understanding impaired cognitive function in disorders affecting connectivity, such as schizophrenia or dementia.","authors":["Urs Braun","Axel Schäfer","Henrik Walter","Susanne Erk"],"meta":["August 2015Proceedings of the National Academy of Sciences 112(37)","DOI:10.1073/pnas.1422487112","SourcePubMed","Project: Transdiagnostic neurocognitive biomarkers for the major psychoses (IntegraMent SP4)"],"references":["297997015_Task-Based_Core-Periphery_Organization_of_Human_Brain_Dynamics_vol_10_e1003617_2014","274087989_Cognitive_Network_Neuroscience","265391378_Quantifying_the_Reconfiguration_of_Intrinsic_Networks_during_Working_Memory","308468866_Exploring_the_central_executive","287649681_Towards_a_cognitive_theory_of_consciousness_basic_evidence_and_a_workspace_framework","281785186_On_spurious_and_real_fluctuations_of_dynamic_functional_connectivity_during_rest","279899421_Dissociating_aspects_of_verbal_working_memory_within_the_human_frontal_lobe_Further_evidence_for_a_'process-specific'_model_of_lateral_frontal_organization","277683566_Evolvability","265861998_Erratum_to_On_spurious_and_real_fluctuations_of_dynamic_functional_connectivity_during_rest","263323801_Why_network_neuroscience_Compelling_evidence_and_current_frontiers_Comment_on_Understanding_brain_networks_and_brain_organization_by_Luiz_Pessoa"]}