{"id":"281517176_Non-adaptive_plasticity_potentiates_rapid_adaptive_evolution_of_gene_expression_in_nature","abstract":"Phenotypic plasticity is the capacity for an individual genotype to produce different phenotypes in response to environmental variation. Most traits are plastic, but the degree to which plasticity is adaptive or non-adaptive depends on whether environmentally induced phenotypes are closer or further away from the local optimum. Existing theories make conflicting predictions about whether plasticity constrains or facilitates adaptive evolution. Debate persists because few empirical studies have tested the relationship between initial plasticity and subsequent adaptive evolution in natural populations. Here we show that the direction of plasticity in gene expression is generally opposite to the direction of adaptive evolution. We experimentally transplanted Trinidadian guppies (Poecilia reticulata) adapted to living with cichlid predators to cichlid-free streams, and tested for evolutionary divergence in brain gene expression patterns after three to four generations. We find 135 transcripts that evolved parallel changes in expression within the replicated introduction populations. These changes are in the same direction exhibited in a native cichlid-free population, suggesting rapid adaptive evolution. We find 89% of these transcripts exhibited non-adaptive plastic changes in expression when the source population was reared in the absence of predators, as they are in the opposite direction to the evolved changes. By contrast, the remaining transcripts exhibiting adaptive plasticity show reduced population divergence. Furthermore, the most plastic transcripts in the source population evolved reduced plasticity in the introduction populations, suggesting strong selection against non-adaptive plasticity. These results support models predicting that adaptive plasticity constrains evolution, whereas non-adaptive plasticity potentiates evolution by increasing the strength of directional selection. The role of non-adaptive plasticity in evolution has received relatively little attention; however, our results suggest that it may be an important mechanism that predicts evolutionary responses to new environments.","authors":["Cameron K Ghalambor","Kim L Hoke","Emily W Ruell","Eva K Fischer"],"meta":["September 2015Nature 525(7569)","DOI:10.1038/nature15256","SourcePubMed"],"references":["268877970_The_Evolution_and_Adaptive_Potential_of_Transcriptional_Variation_in_Sticklebacks-Signatures_of_Selection_and_Widespread_Heritability","265557882_Plasticity_predicts_evolution_in_a_marine_alga","317499828_WHEN_DOES_EVOLUTION_BY_NATURAL_SELECTION_PREVENT_EXTINCTION","317314560_THE_IMPACT_OF_PREDATION_ON_LIFE_HISTORY_EVOLUTION_IN_TRINIDADIAN_GUPPIES_GENETIC_BASIS_OF_OBSERVED_LIFE_HISTORY_PATTERNS","311534771_A_scaling_normalization_method_for_differential_expression_analysis_of_RNA-seq_data","284610607_The_role_of_phenotypic_plasticity_in_driving_genetic","270359931_The_Impact_of_Predation_on_Life_History_Evolution_in_Trinidadian_Guppies_Genetic_Basis_of_Observed_Life_History_Patterns","267641253_Locally_adapted_traits_maintained_in_the_face_of_high_gene_flow","263330295_Rates_of_evolution_on_the_time_SCALE_of_the_evolutionary_process","258304934_When_does_Evolution_by_Natural_Selection_Prevent_Extinction"]}