{"id":"281527564_Correlates_of_Academic_Procrastination_and_Mathematics_Achievement_of_University_Undergraduate_Students","abstract":"Procrastination is now a common phenomenon among students particularly those at the higher level. And this is doing more harm to their academic achievement than good. Therefore, this study examined the correlates between academic procrastination and mathematics achievement among the university mathematics undergraduate students. The study used a total sample of 150 part 3 and 4 students in the department of mathematics and mathematics education students in the university of Ibadan and university of Lagos, Nigeria. The 35 items academic procrastination scale developed and validated by Tuckman (1991) was used for the collection of data, in conjunction with the subjects GPA scores till date in mathematics. Findings indicates that: a significant correlation was found in the academic procrastination and academic achievement of the subjects in mathematics, significant difference also exists in the levels of procrastination and mathematics achievement of the subjects, with low procrastinators performing better than the moderate and the high procrastinators. Results further reveals the subjects procrastinate the same way irrespective of their gender. Implications of procrastination on academic achievement of students at all levels generally and some effective ways of remediation of procrastination were suggested.","authors":["Mojeed Kolawole Akinsola","Adedeji Tella"],"meta":["November 2007Eurasia Journal of Mathematics, Science and Technology Education 3(4):363-370","DOI:10.12973/ejmste/75415"],"references":["276354353_Affective_Responses_Before_and_After_Fraudulent_Excuses_by_Academic_Procrastinators","276295216_Methods_of_Procrastination_and_their_Relation_to_Self-Control_and_Self-Reinforcement_An_Exploratory_Study","232562755_Decisional_procrastination_Examining_personality_correlates","256271709_Correlates_of_academic_procrastination","254340755_Situational_and_Personal_Determinants_of_Academic_Procrastination","247728109_Effects_of_Ability_High_School_Achievement_and_Procrastinatory_Behavior_on_College_Performance","247166083_Procrastination_as_revenge_Do_people_report_using_delays_as_a_strategy_for_vengeance"]}