{"id":"281504117_Connected_Filtering_on_Tree-Based_Shape-Spaces","abstract":"Connected filters are well-known for their good contour preservation property. A popular implementation strategy relies on tree-based image representations: for example, one can compute an attribute characterizing the connected component represented by each node of the tree and keep only the nodes for which the attribute is sufficiently high. This operation can be seen as a thresholding of the tree, seen as a graph whose nodes are weighted by the attribute. Rather than being satisfied with a mere thresholding, we propose to expand on this idea, and to apply connected filters on this latest graph. Consequently, the filtering is performed not in the space of the image, but in the space of shapes built from the image. Such a processing of shape-space filtering is a generalization of the existing tree-based connected operators. Indeed, the framework includes the classical existing connected operators by attributes. It also allows us to propose a class of novel connected operators from the leveling family, based on non-increasing attributes. Finally, we also propose a new class of connected operators that we call morphological shapings. Some illustrations and quantitative evaluations demonstrate the usefulness and robustness of the proposed shape-space filters.","authors":["Yongchao Xu","Thierry Géraud","Laurent Najman"],"meta":["September 2015IEEE Transactions on Pattern Analysis and Machine Intelligence 38(6)","DOI:10.1109/TPAMI.2015.2441070"],"references":["282172578_Hierarchies_and_shape-space_for_PET_image_segmentation","276073578_Directed_Connected_Operators_Asymmetric_Hierarchies_for_Image_Filtering_and_Segmentation","267933374_Tree-Based_Morse_Regions_A_Topological_Approach_to_Local_Feature_Detection","267432075_Two_Applications_of_Shape-Based_Morphology_Blood_Vessels_Segmentation_and_a_Generalization_of_Constrained_Connectivity","292575741_Scale-space_analysis_for_the_characterisation_of_retinal_blood_vessels","281015690_Tree-based_shape_spaces_definition_and_applications_in_image_processing_and_computer_vision","274801291_Image_Analysis_Using_Mathematical_Morphology","271828097_Image_Analysis_and_Mathematical_Morphology_Vol_1","267476611_Optimal_transportation_networks_Models_and_theory","267073557_Geometric_Description_of_Images_as_Topographic_Maps"]}