{"id":"281607996_Facilitating_systematic_reviews_data_extraction_and_meta-analysis_with_the_metagear_package_for_R","abstract":"1. The R package ecosystem is rich in tools for the statistics of meta-analysis. However, there are few resources available to facilitate research synthesis as a whole.2. Here I present the metagear package for R. It is a comprehensive, multifunctional toolbox with capabilities aimed to cover much of the research synthesis taxonomy: from applying a systematic review approach to objectively assemble and screen the literature, to extracting data from studies, and to finally summarize and analyze these data with the statistics of meta-analysis.3. Current functionalities of metagear include: an abstract screener GUI to efficiently sieve bibliographic information from large numbers of candidate studies; tools to assign screening effort across multiple collaborators/reviewers and to assess inter-reviewer reliability using kappa statistics; PDF downloader to automate the retrieval of journal articles from online databases; automated data extractions from scatter-plots, box-plots, and bar-plots; PRISMA flow diagrams; simple imputation tools to fill gaps in incomplete or missing study parameters; generation of random effects sizes for Hedges’ d, log response ratio, odds ratio, and correlation coefficients for Monte Carlo experiments; covariance equations for modeling dependencies among multiple effect sizes (e.g., with a common control, phylogenetic correlations); and finally summaries that replicate analyses and outputs from widely used but no longer updated meta-analysis software.4. Research synthesis practices are vital to many disciplines in the sciences, including ecology and evolutionary biology, and metagear aims to enrich the scope, quality, and reproducibility of what can be achieved with the systematic review and meta-analysis of research outcomes.This article is protected by copyright. All rights reserved.","authors":["Marc J. Lajeunesse"],"meta":["September 2016Methods in Ecology and Evolution 7(3):323-330","DOI:10.1111/2041-210X.12472"],"references":["321248903_Five_Steps_to_Conducting_a_Systematic_Review","311166802_OpenMEE_Intuitive_open-source_software_for_meta-analysis_in_ecology_and_evolutionary_biology","298483607_Power_statistics_for_meta-analysis_Tests_for_mean_effects_and_homogeneity","298002407_Software_for_statistical_meta-analysis","293078622_Recovering_missing_or_partial_data_from_studies_A_survey_of_conversions_and_imputations_for_meta-analysis","292255341_Phylogenetic_nonindependence_and_meta-analysis","342183905_A_Coefficient_of_Agreement_for_Nominal_Scales","295659010_Statistical_models_for_the_meta-analysis_of_nonindependent_data","284531959_Statistical_Methods_for_Meta-Analysis","283550903_Quantifying_heterogeneity_in_a_metaanalysis"]}