{"id":"281672625_The_highs_and_lows_of_dispersal_How_connectivity_and_initial_population_size_jointly_shape_establishment_dynamics_in_discrete_landscapes","abstract":"Identifying the main factors driving introduced populations to establishment is a major challenge of invasion biology. Due to their small initial size, introduced populations are most vulnerable to extinction because of demographic stochasticity or Allee effects. While an increase in initial population size is known to increase establishment success, much remains to be understood regarding its interplay with connectivity in spatially structured environments. In order to better understand how demographic mechanisms interact at such spatial scale, we developed a stochastic model of population dynamics in discrete space to investigate the effect of connectivity and initial population size on establishment. The predictions derived from the model were then tested using experimental introductions of an insect parasitoid (Trichogramma chilonis) in spatially structured laboratory microcosms. Both theoretical and experimental results demonstrated that the connectivity of the introduction site had 1) a deleterious effect in the first generation when the introduced population was small and 2) a beneficial impact brought about by metapopulation effects in the subsequent generations. Interestingly, populations displayed a weakly pushed invasion pattern promoting early establishment, which was mainly underpinned by dispersal stochasticity and the discrete nature of the landscape. These results shed light on the critical influence of landscape connectivity on establishment dynamics.This article is protected by copyright. All rights reserved.","authors":["Thibaut Morel-Journel","Pierre Girod","Ludovic Mailleret","Alexandra Auguste"],"meta":["June 2016Oikos 125(6)","DOI:10.1111/oik.02718","Project: Introduction strategies of organisms in a spatially structured environment"],"references":["280801051_Biological_Control_with_Trichogramma_Advances_Successes_and_Potential_of_Their_Use","316360101_lme4_Linear_mixed-effects_models_using_Eigen_and_S4","313600989_Ecology_genetics_and_evolution_of_metapopulations","286335777_Stochastic_population_dynamics_in_ecology_and_conservation_Oxford_University_Press","279236921_Multimodel_Inference_understanding_AIC_and_BIC_in_Model_Selection","278690855_Density-dependent_dispersal_and_the_speed_of_range_expansions","272614277_Allee_Effects_in_Ecology_and_Conservation","270357065_Connectivity_Is_a_Vital_Element_of_Landscape_Structure","267988772_Stochastic_Population_Models_in_Ecology_and_Conservation","263316243_The_spatio-temporal_dynamics_of_neutral_genetic_diversity","259456765_Emerging_predictable_features_of_replicated_biological_invasion_fronts","256669208_Predicting_post-release_establishment_using_data_from_multiple_reintroductions","249140608_Dispersal_Population_Growth_and_the_Allee_Effect_Dynamics_of_the_House_Finch_Invasion_of_Eastern_North_America","257769523_Allee_effects_aggregation_and_invasion_success","247413818_Risks_of_Population_Extinction_from_Demographic_and_Environmental_Stochasticity_and_Random_Catastrophes"]}