{"id":"281650037_Klink-2_Integrating_Multiple_Web_Sources_to_Generate_Semantic_Topic_Networks","abstract":"The amount of scholarly data available on the web is steadily increasing, enabling different types of analytics which can provide important insights into the research activity. In order to make sense of and explore this large-scale body of knowledge we need an accurate, comprehensive and up-to-date ontology of research topics. Unfortunately, human crafted classifications do not satisfy these criteria, as they evolve too slowly and tend to be too coarse-grained. Current automated methods for generating ontologies of research areas also present a number of limitations, such as: i) they do not consider the rich amount of indirect statistical and semantic relationships, which can help to understand the relation between two topics – e.g., the fact that two research areas are associated with a similar set of venues or technologies; ii) they do not distinguish between different kinds of hierarchical relationships; and iii) they are not able to handle effectively ambiguous topics characterized by a noisy set of relationships. In this paper we present Klink-2, a novel approach which improves on our earlier work on automatic generation of semantic topic networks and addresses the aforementioned limitations by taking advantage of a variety of knowledge sources available on the web. In particular, Klink-2 analyses networks of research entities (including papers, authors, venues, and technologies) to infer three kinds of semantic relationships between topics. It also identifies ambiguous keywords (e.g., \" ontology \") and separates them into the appropriate distinct topics – e.g., \" ontology/philosophy \" vs. \" ontology/semantic web \". Our experimental evaluation shows that the ability of Klink-2 to integrate a high number of data sources and to generate topics with accurate contextual meaning yields significant improvements over other algorithms in terms of both precision and recall.","authors":["Francesco Osborne","Enrico Motta"],"meta":["October 2015","DOI:10.1007/978-3-319-25007-6_24","Conference: ISWC 2015"],"references":["266056212_Mining_Semantic_Relations_between_Research_Areas","262725201_Identifying_Diachronic_Topic-Based_Research_Communities_by_Clustering_Shared_Research_Trajectories","259332469_Exploring_Scholarly_Data_with_Rexplore","247936736_Exploring_Your_Research_Sprinkling_some_Saron_on_Semantic_Web_Dog_Food","312719806_Inferring_Semantic_Relations_by_User_Feedback","299699960_Crowdsourcing_Ontology_Verification","289155681_Crowdsourcing_ontology_verification","262157385_Latent_Dirichlet_Allocation","256792000_FaBiO_and_CiTO_Ontologies_for_describing_bibliographic_resources_and_citations","243706405_Construction_of_a_Regional_Ontology_from_Text_and_its_Use_within_a_Documentary_System"]}