{"id":"281748849_Critical_questions_for_big_data_Provocations_for_a_cultural_technological_and_scholarly_phenomenon","abstract":"The era of Big Data has begun. Computer scientists, physicists, economists, mathematicians, political scientists, bio-informaticists, sociologists, and other scholars are clamouring for access to the massive quantities of information produced by and about people, things, and their interactions. Significant questions emerge. Will large-scale search data help us create better tools, services, and public goods? Or will it usher in a new wave of privacy incursions and invasive marketing? Will data analytics help us understand online communities and political movements? Or will it be used to track protesters and suppress speech? Will it transform how we study human communication and culture, or narrow the palette of research options and alter what 'research' means? Given the rise of Big Data as a socio-technical phenomenon, we argue that it is necessary to critically interrogate its assumptions and biases. In this article, we offer six provocations to spark conversations about the issues of Big Data: a cultural, technological, and scholarly phenomenon that rests on the interplay of technology, analysis, and mythology that provokes extensive utopian and dystopian rhetoric.","authors":["danah boyd","Kate Crawford"],"meta":["January 2012Informacios Tarsadalom 15(2):662-679"],"references":["275696835_Women_Writing_Culture","299032701_Graphs_maps_trees_-_Abstract_models_for_literary_history_-_2","297371008_From_methodology_to_rhetoric","297370856_Tarde's_idea_of_quantification","293108461_Trending_The_Promises_and_the_Challenges_of_Big_Social_Data","289970707_Examining_Tuskegee_The_Infamous_Syphilis_Study_and_Its_Legacy","289644952_Ethical_imperialism_Institutional_review_boards_and_the_social_sciences_1965-2009","281562823_Ethical_decision-making_and_Internet_research_Recommendations_from_the_AoIR_ethics_working_committee","274345717_To_Dwell_among_Friends_Personal_Networks_in_Town_and_City","267219408_Consuming_Anthropology"]}