{"id":"281714025_Dr_Scratch_Automatic_Analysis_of_Scratch_Projects_to_Assess_and_Foster_Computational_Thinking","abstract":"One of the barriers to entry of computer programming in schools is the lack of tools that support educators in the assessment of student projects. In order to amend this situation this paper presents Dr. Scratch, a web application that allows teachers and students to automatically analyze projects coded in Scratch, the most used programming language in primary and secondary education worldwide, to check if they have been properly programmed, learn from their mistakes and get feedback to improve their code and develop their Computational Thinking (CT) skills. One of the goals of Dr. Scratch, besides supporting teachers in the evaluation tasks, is to act as a stimulus to encourage students to keep on improving their programming skills. Aiming to check its effectiveness regarding this objective, workshops with students in the range from 10 to 14 years were run in 8 schools, in which over 100 learners analyzed one of their Scratch projects with Dr. Scratch, read the information displayed as feedback by Dr. Scratch, and tried to improve their projects using the guidelines and tips offered by the tool. Our results show that at the end of the workshop, students increased their CT score and, consequently, improved their coding skills.","authors":["Jesús Moreno-León","Gregorio Robles","Marcos Román-González"],"meta":["September 2015"],"references":["290391277_COMPUTATIONAL_THINKING_TEST_DESIGN_GUIDELINES_AND_CONTENT_VALIDATION","283118935_Automatic_Detection_of_Bad_Programming_Habits_in_Scratch_A_Preliminary_Study","283118749_Computer_programming_as_an_educational_tool_in_the_English_classroom_a_preliminary_study","283041226_Automatic_detection_of_bad_programming_habits_in_scratch_A_preliminary_study","274377900_Computational_Thinking","274309848_Computational_Thinking","298972479_Learning_Computer_Science_Concepts_with_Scratch","289103667_Evaluation_of_computer_games_developed_by_primary_school_children_to_gauge_understanding_of_programming_concepts","275484990_Gender_and_programming","266562898_Review_on_teaching_and_learning_of_computational_thinking_through_programming_What_is_next_for_K-12"]}