{"id":"281768572_Discovering_governing_equations_from_data_Sparse_identification_of_nonlinear_dynamical_systems","abstract":"The ability to discover physical laws and governing equations from data is\none of humankind's greatest intellectual achievements. A quantitative\nunderstanding of dynamic constraints and balances in nature has facilitated\nrapid development of knowledge and enabled advanced technological achievements,\nincluding aircraft, combustion engines, satellites, and electrical power. In\nthis work, we combine sparsity-promoting techniques and machine learning with\nnonlinear dynamical systems to discover governing physical equations from\nmeasurement data. The only assumption about the structure of the model is that\nthere are only a few important terms that govern the dynamics, so that the\nequations are sparse in the space of possible functions; this assumption holds\nfor many physical systems. In particular, we use sparse regression to determine\nthe fewest terms in the dynamic governing equations required to accurately\nrepresent the data. The resulting models are parsimonious, balancing model\ncomplexity with descriptive ability while avoiding overfitting. We demonstrate\nthe algorithm on a wide range of problems, from simple canonical systems,\nincluding linear and nonlinear oscillators and the chaotic Lorenz system, to\nthe fluid vortex shedding behind an obstacle. The fluid example illustrates the\nability of this method to discover the underlying dynamics of a system that\ntook experts in the community nearly 30 years to resolve. We also show that\nthis method generalizes to parameterized, time-varying, or externally forced\nsystems.","authors":["Steven L. Brunton","Joshua L. Proctor","J. Nathan Kutz"],"meta":["September 2015Proceedings of the National Academy of Sciences 113(15):3932–3937","DOI:10.1073/pnas.1517384113","SourcearXiv"],"references":["290807854_Dynamic_mode_decomposition_of_numerical_and_experimental_data","286324210_Exploiting_sparsity_and_equation-free_architectures_in_complex_systems","316807152_Applied_Mathematical_Sciences","313508668_Compressive_sensing","310830574_Nonlinear_Oscillations_Dynamical_Systems_and_Bifurcations_of_Vector_Fields","304824205_Regression_Shrinkage_and_Selection_via_the_LASSO","300228039_Building_Predictive_Models_via_Feature_Synthesis","291797026_Deterministic_non-periodic_flow","285599545_Introduction_to_Mechanics_and_Symmetry","285599381_Introduction_to_Mechanics_and_Symmetry"]}