{"id":"281895532_The_Word_Problem_for_Omega-Terms_over_the_Trotter-Weil_Hierarchy","abstract":"Two-variable first-order logic FO2 received a lot of attention during the\nlast few years. Over finite words, there is a tight connection between the\nquantifier alternation hierarchy inside FO2 and a hierarchy of finite monoids:\nthe Trotter-Weil Hierarchy. The various ways of climbing up this hierarchy\ninclude Mal'cev products, deterministic and co-deterministic concatenation as\nwell as identities of omega-terms. We show that the word problem for\nomega-terms over each level of the Trotter-Weil Hierarchy is decidable; this\nmeans, for every variety V of the hierarchy and every identity u=v of\nomega-terms, one can decide whether all monoids in V satisfy u=v. More\nprecisely, for every fixed variety V, the problem is solvable in\nnondeterministic logarithmic space (NL). In addition, we give deterministic\npolynomial time algorithms which are more efficient than straightforward\ntranslations of the NL-algorithms. From a language perspective, the word\nproblem for omega-terms is the following: For every language variety V in the\nTrotter-Weil Hierarchy and every language variety W given by an identity of\nomega-terms, one can decide whether V is contained in W. This includes the case\nwhere V is some level of the FO2 quantifier alternation hierarchy. As an\napplication of our results, we show that the separation problems for the\nso-called corners of the Trotter-Weil Hierarchy are decidable.","authors":["Manfred Kufleitner","Jan Philipp Wächter"],"meta":["April 2018Theory of Computing Systems 62(3)","DOI:10.1007/s00224-017-9763-z","SourcearXiv"],"references":["265889081_Normal_forms_for_free_aperiodic_semigroups","257657214_Ehrenfeucht-Fraisse_Games_on_Omega-Terms","344485184_Varieties_of_Formal_Languages","285354751_Homomorphisms_and_semilocal_theory","283926055_Diamonds_are_forever_The_variety_DA","268492136_Finite_Semigroups_and_Universal_Algebra","266433584_Finite_Automata_Formal_Logic_and_Circuit_Complexity","260194322_Separating_Regular_Languages_with_First-Order_Logic","251563064_The_word_problem_for_o_-terms_over_DA","246194182_Finite_semigroups_an_introduction_to_a_unified_theory_of_pseudovarieties","243090469_Varieties_of_Bands_Revisited","242529690_Automata_Languages_and_Machines","242415832_An_algorithm_for_testing_the_equivalence_of_finite_automata","238244343_Implicit_operations_on_finite_J-trivial_semigroups_and_a_conjecture_of_I_Simon","236326036_Separating_Regular_Languages_by_Piecewise_Testable_and_Unambiguous_Languages"]}