{"id":"281821313_Initiation_of_Antiretroviral_Therapy_in_Early_Asymptomatic_HIV_Infection","abstract":"Background: \nData from randomized trials are lacking on the benefits and risks of initiating antiretroviral therapy in patients with asymptomatic human immunodeficiency virus (HIV) infection who have a CD4+ count of more than 350 cells per cubic millimeter.\n\nMethods: \nWe randomly assigned HIV-positive adults who had a CD4+ count of more than 500 cells per cubic millimeter to start antiretroviral therapy immediately (immediate-initiation group) or to defer it until the CD4+ count decreased to 350 cells per cubic millimeter or until the development of the acquired immunodeficiency syndrome (AIDS) or another condition that dictated the use of antiretroviral therapy (deferred-initiation group). The primary composite end point was any serious AIDS-related event, serious non-AIDS-related event, or death from any cause.\n\nResults: \nA total of 4685 patients were followed for a mean of 3.0 years. At study entry, the median HIV viral load was 12,759 copies per milliliter, and the median CD4+ count was 651 cells per cubic millimeter. On May 15, 2015, on the basis of an interim analysis, the data and safety monitoring board determined that the study question had been answered and recommended that patients in the deferred-initiation group be offered antiretroviral therapy. The primary end point occurred in 42 patients in the immediate-initiation group (1.8%; 0.60 events per 100 person-years), as compared with 96 patients in the deferred-initiation group (4.1%; 1.38 events per 100 person-years), for a hazard ratio of 0.43 (95% confidence interval [CI], 0.30 to 0.62; P<0.001). Hazard ratios for serious AIDS-related and serious non-AIDS-related events were 0.28 (95% CI, 0.15 to 0.50; P<0.001) and 0.61 (95% CI, 0.38 to 0.97; P=0.04), respectively. More than two thirds of the primary end points (68%) occurred in patients with a CD4+ count of more than 500 cells per cubic millimeter. The risks of a grade 4 event were similar in the two groups, as were the risks of unscheduled hospital admissions.\n\nConclusions: \nThe initiation of antiretroviral therapy in HIV-positive adults with a CD4+ count of more than 500 cells per cubic millimeter provided net benefits over starting such therapy in patients after the CD4+ count had declined to 350 cells per cubic millimeter. (Funded by the National Institute of Allergy and Infectious Diseases and others; START ClinicalTrials.gov number, NCT00867048.).","authors":["Jens D Lundgren","Abdel G Babiker","Fred Gordin","Sean Emery"],"meta":["August 2015New England Journal of Medicine 373(9):795-807","DOI:10.1056/NEJMoa1506816","Project: START - a RCT defining WTS ART"],"references":["278395094_The_Incidence_of_AIDS-Defining_Illnesses_at_a_Current_CD4_Count_200_Cellsmu_L_in_the_Post-Combination_Antiretroviral_Therapy_Era","327412013_Inferior_Clinical_Outcome_of_the_CD4_Cell_Count-Guided_Antiretroviral_Treatment_Interruption_Strategy_in_the_SMART_Study_Role_of_CD4_Cell_Counts_and_HIV_RNA_Levels_during_Follow-up","327412012_Major_clinical_outcomes_in_antiretroviral_therapy_ART-naive_participants_and_in_those_not_receiving_ART_at_baseline_in_the_SMART_Study","320516663_Reporting_and_Evaluation_of_HIV-Related_Clinical_Endpoints_in_Two_Multicenter_International_Clinical_Trials","295856026_Combination_antiretroviral_therapy_and_the_risk_of_myocardial_infarction","282622125_Comparative_eff_ectiveness_of_immediate_antiretroviral_therapy_versus_CD4-based_initiation_in_HIV-positive_individuals_in_high-income_countries_Observational_cohort_study","281547938_Why_START_Reflections_that_led_to_the_conduct_of_this_large_long-term_strategic_HIV_trial","279546908_When_to_Initiate_Combined_Antiretroviral_Therapy_to_Reduce_Mortality_and_AIDS-Defining_Illness_in_HIV-Infected_Persons_in_Developed_Countries_An_Observational_Study","279016138_Health_benefits_costs_and_cost-effectiveness_of_earlier_eligibility_for_adult_antiretroviral_therapy_and_expanded_treatment_coverage_a_combined_analysis_of_12_mathematical_models","278713224_Timing_of_HAART_Initiation_and_Clinical_Outcomes_in_Human_Immunodeficiency_Virus_Type_1_Seroconverters"]}