{"id":"281818865_Automatic_Deception_Detection_Methods_for_Finding_Fake_News","abstract":"This research surveys the current state-of-the-art technologies that are instrumental in the adoption and development of fake news detection. \" Fake news detection \" is defined as the task of categorizing news along a continuum of veracity, with an associated measure of certainty. Veracity is compromised by the occurrence of intentional deceptions. The nature of online news publication has changed, such that traditional fact checking and vetting from potential deception is impossible against the flood arising from content generators, as well as various formats and genres. The paper provides a typology of several varieties of veracity assessment methods emerging from two major categories – linguistic cue approaches (with machine learning), and network analysis approaches. We see promise in an innovative hybrid approach that combines linguistic cue and machine learning, with network-based behavioral data. Although designing a fake news detector is not a straightforward problem, we propose operational guidelines for a feasible fake news detecting system.","authors":["Nadia Conroy","Victoria Rubin","Yimin Chen"],"meta":["October 2015","Conference: ASIS&T2015At: St. Louis, MO, USA","Project: Deception Detection. Satirical (fake) news recognition."],"references":["281818866_News_in_an_Online_World_The_Need_for_an_Automatic_Crap_Detector","281818851_Deception_Detection_for_News_Three_Types_of_Fakes","278327496_And_That's_A_Fact_Distinguishing_Factual_and_Emotional_Argumentation_in_Online_Dialogue","274043898_Information_Extraction_Using_Discourse_Analysis_from_Newswires","270571080_Towards_News_Verification_Deception_Detection_Methods_for_News_Discourse","265018073_Linguistic_Traces_of_a_Scientific_Fraud_The_Case_of_Diederik_Stapel","260292446_Twitter_Deception_and_Influence_Issues_of_Identity_Slacktivism_and_Puppetry","290078110_Negative_Deceptive_Opinion_Spam","271177354_An_Improving_Deception_Detection_Method_in_Computer-Mediated_Communication","263732236_Truth_and_Deception_at_the_Rhetorical_Structure_Level"]}