{"id":"281835622_Anomaly_detection_and_privacy_preservation_in_cloud-centric_Internet_of_Things","abstract":"Internet of Things (IoT) concept provides a number of opportunities to improve our daily lives while also creating a potential risk of increasing the vulnerability of personal information to security and privacy breaches. Data collected from IoT is usually offloaded to the Cloud which may further leave data prone to a variety of attacks if security and privacy issues are not handled properly. Anomaly detection has been one of the widely adopted security measures in wired and wireless networks. However, it is not straight forward to apply most of the anomaly detection techniques to IoT and cloud. One of the main challenges is deriving outlier features from the vast volume of data pumped from IoT to the cloud. Other challenges include the large number of sources generating data, heterogeneous connectivity and traffic patterns of IoT devices, cloud services being offered at geographically remote places and causing IoT data to be stored in different countries with different legislations. This paper, for the first time, presents the challenges and opportunities in anomaly detection for IoT and cloud. It first introduces the prominent features and application fields of IoT and Cloud, then discusses security and privacy risks to personal information and finally focuses on solutions from anomaly detection perspective.","authors":["Ismail Butun","Burak Kantarci","Melike Erol Kantarci"],"meta":["June 2015","DOI:10.1109/ICCW.2015.7247572","Conference: IEEE International Conference on Communications (ICC), 2015At: London, UKVolume: pp. 2610 - 2615"],"references":["271658599_The_internet_of_things_A_survey","269309218_A_scalable_distributed_architecture_towards_unifying_IoT_applications","265129513_Big_Data_computing_and_clouds_Trends_and_future_directions","261422509_Cloud_computing_for_Internet_of_Things_sensing_based_applications","256181993_A_Survey_of_Mobile_Cloud_Computing_Application_Models","320164737_Cloud_Computing_Principles_and_Paradigms","311344281_A_survey_on_security_issues_in_service_delivery_models_of_cloud_computing","284677266_A_Survey_on_Security_Issues_in_Service_Delivery_Models_of_Cloud_Computing","284004823_Cooperative_Intrusion_Detection_in_Wireless_Sensor_Networks","260352093_Hierarchical_Trust_Management_for_Wireless_Sensor_Networks_and_its_Applications_to_Trust-Based_Routing_and_Intrusion_Detection"]}