{"id":"281809961_New_fractional_error_bounds_for_polynomial_systems_with_applications_to_Hlderian_stability_in_optimization_and_spectral_theory_of_tensors","abstract":"In this paper we derive new fractional error bounds for polynomial systems with exponents explicitly determined by the dimension of the underlying space and the number/degree of the involved polynomials. Our major result extends the existing error bounds from the system involving only a single polynomial to a general polynomial system and do not require any regularity assumptions. In this way we resolve, in particular, some open questions posed in the literature. The developed techniques are largely based on variational analysis and generalized differentiation, which allow us to establish, e.g., a nonsmooth extension of the seminal Łojasiewicz’s gradient inequality to maxima of polynomials with explicitly determined exponents. Our major applications concern quantitative Hölderian stability of solution maps for parameterized polynomial optimization problems and nonlinear complementarity systems with polynomial data as well as high-order semismooth properties of the eigenvalues of symmetric tensors. © 2014, Springer-Verlag Berlin Heidelberg and Mathematical Optimization Society.","authors":["G. Y. Li","B. S. Mordukhovich","Tien-Son Pham"],"meta":["November 2015Mathematical Programming 153(2)","DOI:10.1007/s10107-014-0806-9"],"references":["344906460_Convex_Analysis_in_General_Vector_Spaces","312652907_Complete_characterization_of_openness_metric_regularity_and_Lipschitzian_properties_of_multifunctions","302198161_Generalized_equations_and_their_solutions_Part_I_Basic_theory","285943755_An_effective_lojasiewicz_inequality_for_real","278524530_Error_bounds_in_mathematical_programming","278055988_Global_Lojasiewicz-type_inequality_for_non-degenerate_polynomial_maps","272653604_Refractivity_of_Potassium_Bromide_for_Visible_Wavelengths1","268245604_Convex_Analysis_in_General_Vector_Spaces","267005481_Global_Holderian_Error_Bound_for_Nondegenerate_Polynomials","266955693_Separation_of_real_algebraic_sets_and_the_Lojasiewicz_exponent"]}