{"id":"281855538_A_Medical_Decision_Support_System_for_ENT_Disease_Diagnosis_using_Artificial_Neural_Networks","abstract":"Ear, nose and throat (ENT) diseases are one of the most common diseases in the world, where the quality of life of patients decreased if they have any of these diseases. Diagnosing ENT diseases are the most challenging for ENT doctors to diagnose, because they all have many similar symptoms and signs. So there is always a high chance of misdiagnosis. And so to prevent this, we should increase the accuracy of the diagnosis of these diseases. The aim of this paper is to develop a decision support system to predict the diagnosis of common ENT diseases in patients. We have developed a Medical Decision Support System (MDSS) for the diagnosis of three ENT diseases using Artificial Neural Network (ANN), these three diseases are: chronic infection rhinosinusitis, Otitis external and Pharyngitis. We used a Multilayer Perceptron (MLP) feed-forward neural network in developing the system. The input layer includes thirty eight variables, while the output layer contains one neuron which presents one type of the three ENT diseases. An iterative process is used to determine the number of hidden layers and the number of neurons in each one, and to train the system we used a Resilient back propagation algorithm (Rprop). For the systems we used multiple experiments models have been completed with different activation functions such as, Linear Activation Function (LF), Hyperbolic Tangent Sigmoid Activation Function (TANH) and Log-Sigmoid Activation Function. Particularly, 10-fold cross validation schemes are used to access the generalization of the proposed system. The experiment results have obtained 95.41% classification accuracy for correct diagnosis in our system. The data had been taken from 240 patients whom according to their medical records all were suffering from three ENT diseases, which were treated managed at the ENT clinics at Jordan University Hospital (JUH).","authors":["Samaa Farhan","Mohammad Aref Alshraideh","Tareq Mahafza"],"meta":["September 2015"],"references":["313892515_A_Novel_Approach_for_Determining_the_Optimal_Number_of_Hidden_Layer_Neurons_for_FNN's_and_Its_Application_in_Data_Mining","286984617_A_novel_approach_for_determining_the_optimal_number_of_hidden_layer_neurons_for_FNN's_and_its_application_in_data_mining","277009445_AUTOMATED_TOOL_FOR_THE_EXTRACTION_OF_HEALTHY_SINUS_AREA","273724739_ENTDEx_ENT_Diagnosis_Expert_System_Using_Bayesian_Networks","272832321_An_introduction_to_neural_networks","344498071_Computational_Intelligence_Paradigms_Theory_Applications_using_MATLAB","319770279_From_Machine_Learning_to_Machine_Reasoning","312188083_Artificial_neural_networks","288996626_A_Software_system_for_diagnosis_and_classification_of_deafness","284039107_Data_splitting"]}