{"id":"281802312_Nom_propre_et_chaines_de_reference","abstract":"La notion de \"chaîne de référence\" est relativement récente. Née du souci informatique de donner aux machines les moyens d'interpréter la référence sur du long terme et en continu, elle est \"entrée\" en linguistique par le biais de questionnements ayant trait à l'expression de la référence et de la structuration textuelle. D'un point de vue référentiel, les chaînes de référence rendent compte du fait que la plupart des textes évoquent des individus de façon constante mais au moyen d'expressions référentielles aussi diversifiées que les noms propres, pronoms et groupes nominaux plus ou moins variés. Comment repérer sous une telle diversité formelle, la constance référentielle ? C'est une des questions auxquelles tente de répondre cet ouvrage en proposant une étude systématique, fondée sur des exemples attestés et fabriqués, des chaînes de référence, dans le but de les délimiter -concrètement mais aussi théoriquement - d'en déterminer les modes de composition les plus typiques ainsi que la structure. Dans ce système référentiel, le nom propre apparaît comme une \"expression-phare\". D'une part, il est comme l'ont démontré les psycholinguistes, un 'attracteur cognitif' puissant, qui sert à hiérarchiser les référent d'un texte. D'autre part, le nom propre manifeste de réelles aptitudes structurantes qui opèrent à d'autres niveaux de l'organisation textuelle que le strict plan référentiel comme à celui de la phrase, par exemple, dont on l'a longtemps tenu à l'écart. Mais il rencontre aussi des unités structurelles marquées, entre autres, par le découpage paragraphique ou par des connecteurs sur lesquels il exerce également son influence sémantique. Comment se régulent ces interactions entre les chaînes de référence et les unités phrastiques, interphrastiques et discursives ? Quelle part y prend le nom propre ? C'est à quoi ce travail propose des éléments de réponse.","authors":["Catherine Schnedecker"],"meta":["January 1997"],"references":[]}