{"id":"281886731_A_History_of_Metaheuristics","abstract":"This chapter describes the history of metaheuristics in five distinct periods, starting long before the first use of the term and ending a long time in the future.\n\nThe field of metaheuristics has undergone several paradigm shifts, that have changed the way researchers look upon the development of heuristic methods. Most notably, there has been a shift from the method-centric period, in which metaheuristics were thought of as algorithms, to the framework-centric period, in which researchers think of metaheuristics as more general high-level frameworks, i.e., consistent collections of concepts and ideas that offer guidelines on how to go about solving an optimization problem heuristically.\nTremendous progress has been made in the development of heuristics over the years. Optimization problems that seemed intractable only a few decades ago can now be efficiently solved. Nevertheless, there is still much room for evolution in the research field, an evolution that will allow it to move into the scientific period. In this period, we will see more structured knowledge generation that will benefit both researchers and practitioners.\n\nUnfortunately, a significant fraction of the research community has deluded itself into thinking that scientific progress can be made by resorting to ever more outlandish metaphors as the basis for so-called “novel” methods. Even though considerable damage to the research field will have been inflicted by the time these ideas have been stamped out, there is no doubt that science will ultimately prevail.","authors":["Kenneth Sörensen","Marc Sevaux","Fred Glover"],"meta":["February 2015","Projects: MetaheuristicsMetaheuristics"],"references":["239577648_Learning_by_Analogy_Formulating_and_Generalizing_Plans_from_Past_Experience","238085345_FUTURE_PATHS_FOR_INTEGER_PROGRAMMING_AND_LINKS_TO_AR_TIFI_CIAL_INTELLI_G_EN_CE","313629838_A_template_for_scatter_search_and_path_relinking","292215395_Neural_networks_and_physical_systems_with_emergent_collective_computational_abilities","283996103_Genetic_Algorithms_In_Search_Optimization_and_Machine_Learning","258948784_How_to_Solve_It_A_New_Aspect_of_Mathematical_Method","257153506_Variable_neighborhood_search_for_location_routing","247442902_Introduction_To_Algorithms","243779034_Adaptation_in_Natural_and_Arti_cial_Systems","240348295_Threshold_Accepting_A_General_Purpose_Algorithm_Appearing_Superior_to_Simulated_Annealing"]}