{"id":"281815238_Thermal_Signal_Analysis_for_Breast_Cancer_Risk_Verification","abstract":"Breast cancer is the second most common cancer in the world. Currently, there are no effective methods to prevent this disease. However, early diagnosis increases chances of remission. Breast thermography is an option to be considered in screening strategies. This paper proposes a new dynamic breast thermography analysis technique in order to identify patients at risk for breast cancer. Thermal signals from patients of the Antonio Pedro University Hospital (HUAP), available at the Mastology Database for Research with Infrared Image - DMR-IR were used to validate the study. First, each patient's images are registered. Then, the breast region is divided into subregions of 3x3 pixels and the average temperature from each of these regions is observed in all images of the same patient. Features of the thermal signals of such subregions are calculated. Then, the k-means algorithm is applied over feature vectors building two clusters. Silhouette index, Davies-Bouldin index and Calinski-Harabasz index are applied to evaluate the clustering. The test results showed that the methodology presented in this paper is able to identify patients with breast cancer. Classification techniques have been applied on the index values and 90.90% hit rate has been achieved.","authors":["Lincoln F Silva","Giomar Oliver Sequeiros Olivera","Maria Lúcia O Santos","Cristina A. P. Fontes"],"meta":["August 2015Studies in Health Technology and Informatics 216:746-50"],"references":["305195276_Time-Frequency_Analysis_of_Skin_Temperature_in_a_Patient_with_a_Surface_Tumor_Monitored_with_Infrared_Imaging","281296535_Thermal_Signal_Analysis_for_Breast_Cancer_Risk_Verification","272274878_A_New_Database_for_Breast_Research_with_Infrared_Image","262608460_Wavelet-based_multifractal_analysis_of_dynamic_infrared_thermograms_to_assist_in_early_breast_cancer_diagnosis","260709778_Multifractal_analysis_of_dynamic_infrared_imaging_of_breast_cancer","305200442_Identification_of_breast_cancer_using_analysis_of_thermal_signals_by_nonlinear_dynamics_methods","303836466_A_dendrite_method_for_cluster_analysis","285260230_Transformation_Functions","257189507_Biomedical_Signal_and_Image_Processing","251924118_Image_processing_for_early_diagnosis_of_breast_cancer_using_infrared_images"]}