{"id":"281889470_Development_of_configurations_for_lookup_table-based_Embryonics_using_graphic_mapping_A_case_study","abstract":"This article presents the development of configurations for bio-inspired self-healing cellular arrays known as Embryonics (embryonic electronics). In the Embryonics design, the configurations are employed to define the functionality and connections of each cell. However, developing configurations of the Embryonics is a time-consuming and challenging work due to lack of effective tools. In this article, an approach is proposed to develop configurations using graphic mapping, which also optimizes the length of configurations for the Embryonics. Using metric embedding, the problem of configurations is exactly formulated to binary quadratic assignment problem and routing problem with constraint of the Embryonics architecture. Since binary quadratic assignment problem is nondeterministic polynomial-time hard, a genetic algorithm is used to tackle this problem for achieving high-quality placement. Due to the limitation of communication bandwidth, how to resolve congestion is also an important issue. An improved ant colony algorithm is presented to realize routing of the Embryonics based on the result of placement. Configurations of the Embryonics are formed according to the result of placement and routing. Experimental result on a 4 × 4 multiplier demonstrates that developing configurations for lookup table-based Embryonics using graphic mapping can lower the difficulty of the Embryonics design and optimize placement and routing of Embryonics. © SAGE Publications Ltd, unless otherwise noted. Manuscript content on this site is licensed under Creative Commons Licenses.","authors":["Qingqi Zhuo","Yanling Qian","Yue Li","Nantian Wang"],"meta":["July 2015Advances in Mechanical Engineering 7(7)","DOI:10.1177/1687814015592538"],"references":["308953674_Ant_Colony_Optimization","316546604_Graph_drawing_by_high-dimensional_embedding","288920767_New_optimization_techniques_in_engineering","284382099_P-complete_approximation_problem","261081399_Analytical_placement_for_heterogeneous_FPGAs","260655572_Self-Repairing_Digital_System_With_Unified_Recovery_Process_Inspired_by_Endocrine_Cellular_Communication","260655393_Novel_Bio-Inspired_Approach_for_Fault-Tolerant_VLSI_Systems","252020928_UNITRONICS_A_novel_bio-inspired_fault_tolerant_cellular_system","234799288_Lectures_on_Discrete_Geometry","230660829_Ant_Colony_Optimization_Artificial_Ants_as_a_Computational_Intelligence_Technique"]}