{"id":"281923592_On_the_Choice_of_Kernel_and_Labelled_Data_in_Semi-supervised_Learning_Methods","abstract":"Semi-supervised learning methods constitute a category of machine learning methods which use labelled points together with unlabelled data to tune the classifier. The main idea of the semi-supervised methods is based on an assumption that the classification function should change smoothly over a similarity graph, which represents relations among data points. This idea can be expressed using kernels on graphs such as graph Laplacian. Different semi-supervised learning methods have different kernels which reflect how the underlying similarity graph influences the classification results. In the present work, we analyse a general family of semi-supervised methods, provide insights about the differences among the methods and give recommendations for the choice of the kernel parameters and labelled points. In particular, it appears that it is preferable to choose a kernel based on the properties of the labelled points. We illustrate our general theoretical conclusions with an analytically tractable characteristic example, clustered preferential attachment model and classification of content in P2P networks.","authors":["K. E. Avrachenkov","Paulo Gonçalves","Marina Sokol"],"meta":["December 2013","DOI:10.1007/978-3-319-03536-9_5","Conference: International Workshop on Algorithms and Models for the Web-Graph"],"references":["261379301_Classification_of_Content_and_Users_in_BitTorrent_by_Semi-supervised_Learning_Methods","221346148_Spectral_clustering_and_transductive_learning_with_multiple_views","220907283_Semi-Supervised_Learning_Based_on_Semiparametric_Regularization","302217822_Prerequisites_From_Analysis","284528176_Finite_Markov_Chains","284106969_Scholkopf_B_learning_with_local_and_global_vonsistency","230887855_Markov_Decision_Processes_Discrete_Stochastic_Dynamic_Programming","221023758_Topic-sensitive_PageRank","220696326_Introduction_to_Semi-Supervised_Learning","220465565_Using_PageRank_to_Locally_Partition_a_Graph"]}