{"id":"281959046_Revisiting_metadiscourse_Conceptual_and_methodological_issues_concerning_signalling_nouns","abstract":"The concept of metadiscourse – the ways in which writers and speakers interact through their use of language with readers and listeners (also referred to as metalanguage and metapragmatics) – has received considerable attention in applied linguistics in recent years, particularly in the study of academic discourse. Conceptualised within the applied linguistics context of developing optimal descriptions of genres as a basis for a genre-based pedagogy, this article first reviews some of the different approaches to metadiscourse, highlighting how the concept is construed in different ways by different researchers. The article then discusses a number of problematic issues in metadiscourse research: metadiscourse as textual or interpersonal; the size of the linguistic unit in metadiscourse research; the multi-functionality of metadiscourse items; and the issue of representativeness in corpus research on metadiscourse. The second part of the article focuses on the concept of signalling nouns (SNs) (abstract nouns which carry particular pragmatic meanings in discourse), a feature of discourse not usually included under the rubric of metadiscourse. It is argued, however, that SNs represent an important resource for making writers’ (or speakers’) intended meanings clear. In this second part of the article, a first section introduces the notion of SN and a second section discusses how SNs might be incorporated into a model of metadiscourse. A final section of the paper concludes with a summary and some comments on pedagogic application.","authors":["John Flowerdew"],"meta":["March 2015Iberica 29(29):15-34"],"references":["293105677_Integrated_and_fragmented_worlds_EAP_materials_and_corpus_linguistics","282406263_Metadiscourse_Diverse_and_Divided_Perspectives","43647797_Notes_On_The_Role_Of_Metapragmatic_Awareness_In_Language_Use","344045940_Corpus_Linguistics_at_Work","332862629_Notes_on_the_role_of_metapragmatic_awareness_in_language_use","291748917_The_transformational_model_of_language_structure","290496733_Signalling_nouns_in_English_A_corpus-based_discourse_approach","272159434_How_to_Do_Things_with_Words","268344429_Understanding_Metadiscoursal_Use_Lessons_from_a_Local'_Corpus_of_Learner_Academic_Writing","259412713_Action_content_and_identity_in_applied_genre_analysis_for_ESP","249930633_Nouns_in_search_of_a_context_a_study_of_nouns_with_both_open-_and_closed-system_characteristics","249738714_Metadiscourse_in_Persuasive_Writing_A_Study_of_Texts_Written_by_American_and_Finnish_University_Students","247584914_Some_Exploratory_Discourse_on_Metadiscourse","245078078_A_Speech_Act_Theory_of_Metadiscourse","243653192_Variation_Across_Speech_and_Writing","236023857_How_to_Do_Things_with_Words","233634919_Register-Specificity_of_Signalling_Nouns_in_Discourse","216831511_Style_Ten_lessons_in_clarity_and_grace","200025845_How_to_Do_Things_with_Words","48517046_Talking_With_Readers_Metadiscourse_As_Rhetorical_Act"]}