{"id":"281936479_The_Role_of_Google_Scholar_in_Evidence_Reviews_and_Its_Applicability_to_Grey_Literature_Searching","abstract":"Google Scholar (GS), a commonly used web-based academic search engine, catalogues between 2 and 100 million records of both academic and grey literature (articles not formally published by commercial academic publishers). Google Scholar collates results from across the internet and is free to use. As a result it has received considerable attention as a method for searching for literature, particularly in searches for grey literature, as required by systematic reviews. The reliance on GS as a standalone resource has been greatly debated, however, and its efficacy in grey literature searching has not yet been investigated. Using systematic review case studies from environmental science, we investigated the utility of GS in systematic reviews and in searches for grey literature. Our findings show that GS results contain moderate amounts of grey literature, with the majority found on average at page 80. We also found that, when searched for specifically, the majority of literature identified using Web of Science was also found using GS. However, our findings showed moderate/poor overlap in results when similar search strings were used in Web of Science and GS (10–67%), and that GS missed some important literature in five of six case studies. Furthermore, a general GS search failed to find any grey literature from a case study that involved manual searching of organisations' websites. If used in systematic reviews for grey literature, we recommend that searches of article titles focus on the first 200 to 300 results. We conclude that whilst Google Scholar can find much grey literature and specific, known studies, it should not be used alone for systematic review searches. Rather, it forms a powerful addition to other traditional search methods. In addition, we advocate the use of tools to transparently document and catalogue GS search results to maintain high levels of transparency and the ability to be updated, critical to systematic reviews.","authors":["Neal R Haddaway","Alexandra Mary Collins","Deborah Coughlin","Stuart Kirk"],"meta":["October 2015PLoS ONE 10(9)","DOI:10.1371/journal.pone.0138237","Project: Systematic review and systematic map methodology"],"references":["337832357_The_Production_of_Quick_Scoping_Reviews_and_Rapid_Evidence_Assessments_A_How_to_Guide_Joint_Water_Evidence_Group","321001179_Which_components_or_attributes_of_biodiversity_influence_which_dimensions_of_poverty","282658358_The_Use_of_Web-scraping_Software_in_Searching_for_Grey_Literature","278730323_Investigating_the_effects_of_mobile_bottom_fishing_on_benthic_biota_A_systematic_review_protocol","273126451_What_are_the_impacts_of_reindeercaribou_Rangifer_tarandus_L_on_arctic_and_alpine_vegetation_A_systematic_review","270822891_What_are_'Integrated_Landscape_Approaches'_and_how_effectively_have_they_been_implemented_in_the_tropics_A_systematic_map_protocol","270049238_What_are_the_socio-economic_impacts_of_genetically_modified_crops_worldwide_A_systematic_map_protocol","262228930_The_Number_of_Scholarly_Documents_on_the_Public_Web","261994744_Which_components_or_attributes_of_biodiversity_influence_which_dimensions_of_poverty","281116730_Shades_of_grey_Two_forms_of_grey_literature_important_for_reviews_in_conservation"]}