{"id":"281905214_Combination_of_Noninvasive_Approaches_for_General_Assessment_of_Induction_Motors","abstract":"There exists no single quantity able to diagnose all possible failures taking place in induction motors. Currents and vibrations monitoring are rather common in the industry, but each of these quantities alone can only detect some specific failures. Moreover, even for the specific faults that a quantity is supposed to detect, many problems may rise. As a consequence, a reliable and general diagnosis system cannot rely on a single quantity. On the other hand, it would be desirable to rely on quantities that can be measured in a noninvasive way, which is a crucial requirement in many industrial applications. This paper proposes a twofold method to detect electromechanical failures in induction motors. The method relies on analysis of currents (steady state + transient) combined with analysis of infrared data captured by using appropriate cameras. Each of these noninvasive techniques may provide complementary information that may be very useful to diagnose an enough wide range of failures. In the present paper, the detection of three illustrative faults is analyzed: broken rotor bars, cooling system problems and bearing failures. The results show the potential of the methodology that may be particularly suitable for large, expensive motors, where the prevention of eventual failures justifies the costs of such system, due to the catastrophic implications that these unexpected faults may have.","authors":["M.J. Picazo-Rodenas","J.A. Antonino-Daviu","Vicente Climente Alarcon","R. Royo"],"meta":["May 2015IEEE Transactions on Industry Applications 51(3):2172 - 2180","DOI:10.1109/TIA.2014.2382880"],"references":["268629839_Reliable_Detection_of_Induction_Motor_Rotor_Faults_Under_the_Rotor_Axial_Air_Duct_Influence","263285256_Trends_in_Fault_Diagnosis_for_Electrical_Machines_A_Review_of_Diagnostic_Techniques","261461156_New_techniques_to_simulate_and_diagnose_stator_winding_faults_in_low_voltage_induction_motors","261461149_A_novel_approach_to_detect_short_circuits_in_low_voltage_induction_motor_by_stray_flux_measurement","309563730_Recent_developments_of_induction_motor_drives_fault_diagnosis_using_AI_techniques","294598001_VIBRATION_AND_STRAY_FLUX_MONITORING_FOR_UNBALANCED_SUPPLY_AND_INTER-TURN_WINDING_FAULT_DIAGNOSIS_IN_INDUCTION_MOTORS","275422354_Shaft_Alignment_Handbook","273346523_Evaluation_of_the_Influence_of_Rotor_Magnetic_Anisotropy_on_Condition_Monitoring_of_Two-Pole_Induction_Motors","267327382_Detection_of_Broken_Outer-Cage_Bars_for_Double-Cage_Induction_Motors_Under_the_Startup_Transient","261342444_Electric_machines_diagnosis_techniques_via_transient_current_analysis"]}