{"id":"281995171_Emotion_in_Painting_and_Art_Installations","abstract":"Paintings are static 2-dimensional images with limited narrative means. on the basis of a critical analysis of the relevant laboratory scaling studies, museum studies, and neuroaesthetic work, the article reaches a negative conclusion about most paintings' ability to engage sufficiently with general viewers' associative-memory systems, so as to lead to identification and empathy, and induce fundamental psychobiological emotions. In contrast, designers of art installations can draw on subtle combinations of several classes of stimulus properties with psychological significance subsumable under the classical concept of the sublime (physical grandeur, rarity, an association with beauty and with biologically significant outcomes), so that some installations may induce the peak aesthetic emotional response, aesthetic awe-as defined in Aesthetic Trinity Theory (Konecni, 2005, 2011), along with the states of being moved and physiological thrills. The approach also involves an analytical skepticism about emotivism, defined as a culturological proclivity for unnecessary insertion of emotion into accounts of mental life and behavior, especially in the arts. Implications for the role of emotion theory in empirical aesthetics are examined.","authors":["Vladimir J. Konečni"],"meta":["August 2015The American Journal of Psychology 128(3):305-322","DOI:10.5406/amerjpsyc.128.3.0305"],"references":["298417128_Constraints_on_Manipulations_of_Emotions_by_Music_A_Critique_of_Tom_Cochrane's_Assumptions","288252400_The_aesthetic_trinity_Awe_being_moved_thrills","324355447_Aesthetics_and_Psychobiology","313561402_Autonomic_specificity_and_emotion","313002667_Pain_fear_and_anger_in_hypertensives_and_normotensives","298656341_The_associative_sublime_Gerard_Kames_Alison_and_Stewart","293142687_The_Influence_of_Affect_on_Music_Choice","287349994_Composers'_creative_process_The_role_of_life-events_emotion_and_reason","286014329_Deeper_than_Reason_Emotion_and_Its_Role_in_Literature_Music_and_Art","285797377_Action_recognition_in_the_premotor_cortex"]}