{"id":"282077079_Map_of_science_with_topic_modeling_Comparison_of_unsupervised_learning_and_human-assigned_subject_classification","abstract":"The delineation of coordinates is fundamental for the cartography of science, and accurate and credible classification of scientific knowledge presents a persistent challenge in this regard. We present a map of Finnish science based on unsupervised-learning classification, and discuss the advantages and disadvantages of this approach vis-à-vis those generated by human reasoning. We conclude that from theoretical and practical perspectives there exist several challenges for human reasoning-based classification frameworks of scientific knowledge, as they typically try to fit new-to-the-world knowledge into historical models of scientific knowledge, and cannot easily be deployed for new large-scale data sets. Automated classification schemes, in contrast, generate classification models only from the available text corpus, thereby identifying credibly novel bodies of knowledge. They also lend themselves to versatile large-scale data analysis, and enable a range of Big Data possibilities. However, we also argue that it is neither possible nor fruitful to declare one or another method a superior approach in terms of realism to classify scientific knowledge, and we believe that the merits of each approach are dependent on the practical objectives of analysis.","authors":["Arho Suominen","Hannes Toivanen"],"meta":["October 2015Journal of the Association for Information Science and Technology 67(10):n/a-n/a","DOI:10.1002/asi.23596"],"references":["269809845_Clustering_scientific_documents_with_topic_modeling","268771798_Epistemic_integration_of_the_European_Research_Area_The_shifting_geography_of_the_knowledge_base_of_Finnish_research_1995-2010","311532789_Latent_dirichlet_allocation","298808449_Atlas_of_Science_Visualizing_What_We_Know","294697232_Proceedings_of_the_23rd_International_Conference_on_Phys","291173875_ACM_SIGIR_2008_-_31st_Annual_International_ACM_SIGIR_Conference_on_Research_and_Development_in_Information_Retrieval_Proceedings_Preface_from_the_general_co-chairs","285969195_Text_mining_Classification_clustering_and_applications","284852123_Topic_Models","280113623_The_Text_Mining_Handbook_Advanced_Approaches_in_Analyzing_Unstructured_Data","271935452_A_topic_model_approach_to_measuring_interdisciplinarity_at_the_National_Science_Foundation"]}