{"id":"282000525_Unit-sphere_games","abstract":"This paper introduces a class of games, called unit-sphere games, where\nstrategies are real vectors with unit 2-norms (or, on a unit-sphere). As a\nresult, they can no longer be interpreted as probability distributions over\nactions, but rather be thought of as allocations of one unit of resource to\nactions and the multiplicative payoff effect on each action is proportional to\nsquare-root of the amount of resource allocated to that action. The new\ndefinition generates a number of interesting consequences. We first\ncharacterize sufficient and necessary conditions under which a two-player\nunit-sphere game has a Nash equilibrium. The characterization effectively\nreduces solving a unit-sphere game to finding all eigenvalues and eigenvectors\nof the product of individual payoff matrices. For any unit-sphere game with\nnon-negative payoff matrices, there always exists a unique Nash equilibrium;\nfurthermore, the unique equilibrium is efficiently reachable via Cournot\nadjustment. In addition, we show that any equilibrium in positive unit-sphere\ngames corresponds to approximate equilibria in the corresponding normal-form\ngames. Analogous but weaker results are extended to positive n-player\nunit-sphere games.","authors":["Pingzhong Tang","Hanrui Zhang"],"meta":["November 2017International Journal of Game Theory 46(4)","DOI:10.1007/s00182-017-0565-y","SourcearXiv"],"references":["263418998_On_the_limiting_probability_distribution_of_a_transition_probability_tensor","256805397_Some_variational_principles_for_Z-eigenvalues_of_nonnegative_tensors","228234113_Location_Location_Location_An_Analysis_of_Profitability_of_Position_in_Online_Advertising_Markets","227350498_Customer_Satisfaction_Incentives","300924415_SYMMETRIC_NONNEGATIVE_MATRICES","283752626_Incentive_Problems_in_Performance-Based_Online_Advertising_Pricing_Cost_per_Click_vs_Cost_per_Action","244976285_Praktische_Verfahren_der_Gleichungsauflosung","243134336_Settling_the_Complexity_of_2Player_Nash-Equilibrium","232021870_Sorensen_DC_Numerical_methods_for_large_eigenvalue_problems_Acta_Numerica_11_519-584","225235868_When_the_Players_Are_Not_Expectation_Maximizers"]}