{"id":"282067345_Ancestral_gene_synteny_reconstruction_improves_extant_species_scaffolding","abstract":"We exploit the methodological similarity between ancestral genome reconstruction and extant genome scaffolding. We present a method, called ARt-DeCo that constructs neighborhood relationships between genes or contigs, in both ancestral and extant genomes, in a phylogenetic context. It is able to handle dozens of complete genomes, including genes with complex histories, by using gene phylogenies reconciled with a species tree, that is, annotated with speciation, duplication and loss events. Reconstructed ancestral or extant synteny comes with a support computed from an exhaustive exploration of the solution space. We compare our method with a previously published one that follows the same goal on a small number of genomes with universal unicopy genes. Then we test it on the whole Ensembl database, by proposing partial ancestral genome structures, as well as a more complete scaffolding for many partially assembled genomes on 69 eukaryote species. We carefully analyze a couple of extant adjacencies proposed by our method, and show that they are indeed real links in the extant genomes, that were missing in the current assembly. On a reduced data set of 39 eutherian mammals, we estimate the precision and sensitivity of ARt-DeCo by simulating a fragmentation in some well assembled genomes, and measure how many adjacencies are recovered. We find a very high precision, while the sensitivity depends on the quality of the data and on the proximity of closely related genomes.","authors":["Yoann Anselmetti","Vincent Berry","Cedric Chauve","Annie Chateau"],"meta":["October 2015BMC Genomics 16(Suppl 10)","DOI:10.1186/1471-2164-16-S10-S11","Project: Joint scaffolding of extant and ancestral genomes"],"references":["281299037_Efficient_gene_tree_correction_guided_by_species_and_synteny_evolution","280595966_Moments_of_genome_evolution_by_Double_Cut-and-Join","278759928_Evolution_of_Genes_Neighborhood_within_Reconciled_Phylogenies_An_Ensemble_Approach","278619849_Genome_evolution_aware_gene_trees","273788337_Assessing_the_robustness_of_parsimonious_predictions_for_gene_neighborhoods_from_reconciled_phylogenies","270655334_What_is_the_difference_between_the_breakpoint_graph_and_the_de_Bruijn_graph","292783731_Scaffolding_of_Ancient_Contigs_and_Ancestral_Reconstruction_in_a_Phylogenetic_Framework","289629213_SOAPdenovo2_an_empirically_improved_memory-efficient_short-read_de_novo_assembler_vol_1_18_2012","274967434_Joint_Inference_of_Genome_Structure_and_Content_in_Heterogeneous_Tumor_Samples","274261060_Scaffold_assembly_based_on_genome_rearrangement_analysis"]}