{"id":"282003672_Computer_science_in_Eastern_Europe_1989-2014_A_bibliometric_study","abstract":"Purpose: This paper studies the development of research in computer science in 15 Eastern European countries following the breaching of the Berlin Wall in 1989.\nDesign/methodology/approach: We conducted a bibliometric analysis of 82,121 computer science publications indexed in the Web of Science database and investigated publication, citation, and collaboration patterns of the individual countries.\nFindings: Poland has been the most productive country, followed by Russia, the Czech Republic, Romania, Hungary, and Slovenia. Publication rates have increased substantially over the period, but this has not been accompanied by a corresponding increase in the quality of the publications. Hungary and Slovenia are the most influential countries in terms of citations per paper. Artificial Intelligence is the most frequently occurring computer science subject category, with Interdisciplinary Applications the category with the greatest impact. USA, Germany, UK, France, and Canada are the most frequently collaborating Western nations, and papers published in collaboration with USA authors accrue the most citations.\nOriginality/value: This is the first ever bibliometric study of the whole post-communist Eastern European computer science research as indexed in the Web of Science.","authors":["Dalibor Fiala","Peter Willett"],"meta":["September 2015Aslib Journal of Information Management 67(5):526-541","DOI:10.1108/AJIM-02-2015-0027","Project: Modern informetric methods for the evaluation of scientific research"],"references":["271659662_Publications_from_Serbia_in_the_Science_Citation_Index_Expanded_a_bibliometric_analysis","263297773_Are_There_Global_Shifts_in_World_Science_Base_Analysis_of_Catching_Up_and_Falling_Behind_of_World_Regions","259239696_How_have_the_Eastern_European_countries_of_the_former_Warsaw_Pact_developed_since_1990_A_bibliometric_study","339988072_Floating_search_methods_in_feature_selection","318392855_Cluster_Analysis","313145413_Hierarchical_grouping_to_optimize_an_obiective_function","269663452_Factors_affecting_bibliometric_indicators_of_scientific_quality","268733259_Ward_JHHierarchical_grouping_to_optimize_an_objective_function_J_Am_Stat_Assoc_58301_236-244","258140631_The_development_of_computer_science_research_in_the_People's_Republic_of_China_2000-2009_A_bibliometric_study","257662998_The_development_trends_of_science_in_the_CIS_countries_on_the_basis_of_some_scientometric_indicators"]}