{"id":"282055016_An_Analysis_of_the_SURF_Method","abstract":"The SURF method (Speeded Up Robust Features) is a fast and robust algorithm for local, similarity invariant representation and comparison of images. Similarly to many other local descriptor-based approaches, interest points of a given image are defined as salient features from a scale-invariant representation. Such a multiple-scale analysis is provided by the convolution of the initial image with discrete kernels at several scales (box filters). The second step consists in building orientation invariant descriptors, by using local gradient statistics (intensity and orientation). The main interest of the SURF approach lies in its fast computation of operators using box filters, thus enabling real-time applications such as tracking and object recognition. The SURF framework described in this paper is based on the PhD thesis of H. Bay [ETH Zurich, 2009], and more specifically on the paper co-written by H. Bay, A. Ess, T. Tuytelaars and L. Van Gool [Computer Vision and Image Understanding, 110 (2008), pp. 346–359]. An implementation is proposed and used to illustrate the approach for image matching. A short comparison with a state-of-the-art approach is also presented, the SIFT algorithm of D. Lowe [International Journal of Computer Vision, 60 (2004), pp. 91–110], with which SURF shares a lot in common.","authors":["Edouard Oyallon","Julien Rabin"],"meta":["July 2015Image Processing On Line 5:176-218","DOI:10.5201/ipol.2015.69"],"references":["283754272_Anatomy_of_the_SIFT_method","274410731_ASIFT_An_Algorithm_for_Fully_Affine_Invariant_Comparison","272643636_ASurvey_of_Gaussian_Convolution_Algorithms","232747391_Automatic_Homographic_Registration_of_a_Pair_of_Images_with_A_Contrario_Elimination_of_Outliers","319770516_A_combined_corner_and_edge_detector","316588757_A_Wavelet_Tour_of_Signal_Processing","292796591_Learning_OpenCV_Computer_vision_with_OpenCV_library","268733104_Speeded-up_robust_features_SURF","255571428_Notes_on_the_OpenSURF_Library","224375161_A_contrario_matching_of_SIFT-like_descriptors"]}