{"id":"282017068_MOOCs_A_Systematic_Study_of_the_Published_Literature_2008-2012","abstract":"Massive open online courses (MOOCs) are a recent addition to the range of online learning options. Since 2008, MOOCs have been run by a variety of public and elite universities, especially in North America. Many academics have taken interest in MOOCs recognising the potential to deliver education around the globe on an unprecedented scale; some of these academics are taking a research-oriented perspective and academic papers describing their research are starting to appear in the traditional media of peer reviewed publications. This paper presents a systematic review of the published MOOC literature (2008-2012): Forty-five peer reviewed papers are identified through journals, database searches, searching the Web, and chaining from known sources to form the base for this review. We believe this is the first effort to systematically review literature relating to MOOCs, a fairly recent but massively popular phenomenon with a global reach. The review categorises the literature into eight different areas of interest, introductory, concept, case studies, educational theory, technology, participant focussed, provider focussed, and other, while also providing quantitative analysis of publications according to publication type, year of publication, and contributors. Future research directions guided by gaps in the literature are explored.","authors":["Tharindu R. Liyanagunawardena","Andrew Adams","Shirley Ann Williams"],"meta":["January 2014International Review of Research in Open and Distance Learning 3(3):5-16","DOI:10.19173/irrodl.v14i3.1455"],"references":["330726947_Lessons_Learned_from_Participating_in_a_Connectivist_Massive_Online_Open_Course_MOOC","286690038_Making_Sense_of_MOOCs_Musings_in_a_Maze_of_Myth_Paradox_and_Possibility","285750999_New_dimensions_to_self-directed_learning_in_an_open_networked_learning_environment","279463022_Troubleshooting_MOOCs_The_Case_of_a_Massive_Open_Online_Course_at_a_College_of_Education","277060958_The_Technological_Dimension_of_a_Massive_Open_Online_Course_The_Case_of_the_CCK08_Course_Tools","270050225_Research_ethics_in_emerging_forms_of_online_learning_Issues_arising_from_a_hypothetical_study_on_a_MOOC","267453244_MOOCs_a_Systematic_Study_of_the_Published_Literature_2008-2012","267246518_A_Brief_Guide_to_Understanding_MOOCs","274177376_Using_Information_Expertise_to_Enhance_Massive_Open_Online_Courses","267025519_Disruptive_Pedagogies_and_Technologies_in_Universities"]}