{"id":"282178504_Average-energy_games","abstract":"Two-player quantitative zero-sum games provide a natural framework to synthesize controllers with performance guarantees for reactive systems within an uncontrollable environment. Classical settings include mean-payoff games, where the objective is to optimize the long-run average gain per action, and energy games, where the system has to avoid running out of energy. \n\nWe study average-energy games, where the goal is to optimize the long-run average of the accumulated energy. We show that this objective arises naturally in several applications, and that it yields interesting connections with previous concepts in the literature. We prove that deciding the winner in such games is in NP inter coNP and at least as hard as solving mean-payoff games, and we establish that memoryless strategies suffice to win. We also consider the case where the system has to minimize the average-energy while maintaining the accumulated energy within predefined bounds at all times: this corresponds to operating with a finite-capacity storage for energy. We give results for one-player and two-player games, and establish complexity bounds and memory requirements.","authors":["Patricia Bouyer","Nicolas Markey","Mickael Randour","Kim G. Larsen"],"meta":["September 2015","DOI:10.4204/EPTCS.193.1","Conference: GandALF 2015 - 6th International Symposium on Games, Automata, Logics and Formal VerificationVolume: EPTCS 193"],"references":["305383370_Average-energy_games","260295445_Minimizing_Running_Costs_in_Consumption_Systems","321610844_Automata_Logics_and_Infinite_Games_A_Guide_to_Current_Research","281805022_Markov_decision_processes_and_stochastic_games_with_total_effective_payoff","272116671_Looking_at_Mean-Payoff_and_Total-Payoff_through_Windows","266066629_Competitive_Markov_Decision_Processes","262309564_Optimal_Bounds_for_Multiweighted_and_Parametrised_Energy_Games","261369028_First_Cycle_Games","242597597_A_characterization_of_the_minimum_cycle_mean_in_a_digraph","234005350_Quantitative_Timed_Simulation_Functions_and_Refinement_Metrics_for_TimedSystems_Full_Version"]}