{"id":"282153342_Navigating_a_social_world_with_robot_partners_A_quantitative_cartography_of_the_Uncanny_Valley","abstract":"Android robots are entering human social life. However, human-robot interactions may be complicated by a hypothetical Uncanny Valley (UV) in which imperfect human-likeness provokes dislike. Previous investigations using unnaturally blended images reported inconsistent UV effects. We demonstrate an UV in subjects' explicit ratings of likability for a large, objectively chosen sample of 80 real-world robot faces and a complementary controlled set of edited faces. An \"investment game\" showed that the UV penetrated even more deeply to influence subjects' implicit decisions concerning robots' social trustworthiness, and that these fundamental social decisions depend on subtle cues of facial expression that are also used to judge humans. Preliminary evidence suggests category confusion may occur in the UV but does not mediate the likability effect. These findings suggest that while classic elements of human social psychology govern human-robot social interaction, robust UV effects pose a formidable android-specific problem.","authors":["Maya B Mathur","David B Reichling"],"meta":["September 2015Cognition 146:22-32","DOI:10.1016/j.cognition.2015.09.008"],"references":["275526513_A_review_of_empirical_evidence_on_different_uncanny_valley_hypotheses_Support_for_perceptual_mismatch_as_one_road_to_the_valley_of_eeriness","272887576_Trust_in_Automation_Integrating_Empirical_Evidence_on_Factors_That_Influence_Trust","326080785_Behavioral_game_theory_Experiments_in_strategic_interaction","318587513_Trust_and_trustworthiness","313313813_Speech_and_language_advances_in_basic_research_and_practice_Vol_10_New","306353320_Trust_in_automation_Integrating_empirical_evidence_on_factors_that_influence_trust","302295976_Categorical_Perception_Issues_Methods_Findings","286970426_Trust_and_Trustworthiness","272247854_Reputations_in_Repeated_Games","270372386_Intentionality--An_Essay_in_the_Philosophy_of_Mind"]}