{"id":"282177454_Theory_of_3-rotation_symmetric_cubic_Boolean_functions","abstract":"Rotation symmetric Boolean functions have been extensively studied in the\nlast 15 years or so because of their importance in cryptography and coding theory. Until\nrecently, very little was known about such basic questions as when two such functions are\naffine equivalent. This question in important in applications, because almost all important\nproperties of Boolean functions (such as Hamming weight, nonlinearity, etc.) are affine\ninvariants, so when searching a set for functions with useful properties, it suffices to consider\njust one function in each equivalence class. This can greatly reduce computation time. Even\nfor quadratic functions, the analysis of affine equivalence was only completed in 2009. The\nmuch more complicated case of cubic functions was completed in the special case of affine\nequivalence under permutations for monomial rotation symmetric functions in two papers\nfrom 2011 and 2014. There has also been recent progress for some special cases for\nfunctions of degree >3${> 3}$. In 2007 it was found that functions satisfying a new notion of\nk-rotation symmetry for k > 1 (where the case k = 1 is ordinary rotation symmetry)\nwere of substantial interest in cryptography and coding theory. Since then several researchers\nhave used these functions for k = 2 and 3 to study such topics as construction of bent\nfunctions, nonlinearity and covering radii of various codes. In this paper we develop a detailed\ntheory for the monomial 3-rotation symmetric cubic functions, extending earlier work for\nthe case k = 2 of these functions.","authors":["Thomas W. Cusick","Younhwan Cheon"],"meta":["March 2015Journal of Mathematical Cryptology 9(1):45-62","DOI:10.1515/jmc-2014-0017"],"references":["280685632_Affine_equivalence_for_rotation_symmetric_Boolean_functions_with_pk_variables","275674253_Permutation_equivalence_of_cubic_rotation_symmetric_Boolean_functions","271658528_Theory_of_2-rotation_symmetric_cubic_Boolean_functions","266981674_Recursive_weights_for_some_Boolean_functions","257770229_Equivalence_classes_for_cubic_rotation_symmetric_functions","257770216_Weights_of_Boolean_cubic_monomial_rotation_symmetric_functions","280858877_Affine_equivalence_of_quartic_homogeneous_rotation_symmetric_Boolean_functions","267078413_Cryptographic_Boolean_Functions_and_Applications","263391451_A_secondary_construction_and_a_transformation_on_rotation_symmetric_functions_and_their_action_on_bent_and_semi-bent_functions","256720792_Results_on_rotation-symmetric_S-boxes"]}