{"id":"282160682_Differential_Evolution_with_Multi-Population_Based_Ensemble_of_Mutation_Strategies","abstract":"Differential evolution (DE) is among the most efficient evolutionary algorithms (EAs) for global optimization and now widely applied to solve diverse real-world applications. As the most appropriate configuration of DE to efficiently solve different optimization problems can be significantly different, an appropriate combination of multiple strategies into one DE variant attracts increasing attention recently. In this study, we propose a multi-population based approach to realize an ensemble of multiple strategies, thereby resulting in a new DE variant named multi-population ensemble DE (MPEDE) which simultaneously consists of three mutation strategies, i.e., “current-to-pbest/1” and “current-to-rand/1” and “rand/1”. There are three equally sized smaller indicator subpopulations and one much larger reward subpopulation. Each constituent mutation strategy has one indicator subpopulation. After every certain number of generations, the current best performing mutation strategy will be determined according to the ratios between fitness improvements and consumed function evaluations. Then the reward subpopulation will be allocated to the determined best performing mutation strategy dynamically. As a result, better mutation strategies obtain more computational resources in an adaptive manner during the evolution. The control parameters of each mutation strategy are adapted independently as well. Extensive experiments on the suit of CEC 2005 benchmark functions and comprehensive comparisons with several other efficient DE variants show the competitive performance of the proposed MPEDE.","authors":["Guohua Wu","Rammohan Mallipeddi","Ponnuthurai N. Suganthan","Rui Wang"],"meta":["September 2015Information Sciences","DOI:10.1016/j.ins.2015.09.009"],"references":["284060675_Critical_values_for_the_control_parameters_of_differential_evolution_algorithms","281678872_A_Variable_Reduction_Strategy_for_Evolutionary_Algorithms_Handling_Equality_Constraints","312472606_Success-History_based_parameter_adaptation_for_differential_evolution","304425270_Differential_Evolution_-_A_Simple_and_Efficient_Heuristic_for_global_Optimization_over_Continuous_Spaces","282404231_A_Multioperator_Search_Strategy_Based_on_Cheap_Surrogate_Models_for_Evolutionary_Optimization","280590763_Differential_Evolution_With_an_Individual-Dependent_Mechanism","276414276_Multi-population_differential_evolution_with_balanced_ensemble_of_mutation_strategies_for_large-scale_global_optimization","272846207_Preference-inspired_co-evolutionary_algorithms_using_weight_vectors","271617953_Empirical_investigations_into_the_exponential_crossover_of_differential_evolutions","271561743_Feature_subset_selection_using_differential_evolution_and_a_wheel_based_search_strategy"]}