{"id":"282247583_CustusX_an_open-source_research_platform_for_image-guided_therapy","abstract":"Purpose: \nCustusX is an image-guided therapy (IGT) research platform dedicated to intraoperative navigation and ultrasound imaging. In this paper, we present CustusX as a robust, accurate, and extensible platform with full access to data and algorithms and show examples of application in technological and clinical IGT research.\n\nMethods: \nCustusX has been developed continuously for more than 15 years based on requirements from clinical and technological researchers within the framework of a well-defined software quality process. The platform was designed as a layered architecture with plugins based on the CTK/OSGi framework, a superbuild that manages dependencies and features supporting the IGT workflow. We describe the use of the system in several different clinical settings and characterize major aspects of the system such as accuracy, frame rate, and latency.\n\nResults: \nThe validation experiments show a navigation system accuracy of [Formula: see text]1.1 mm, a frame rate of 20 fps, and latency of 285 ms for a typical setup. The current platform is extensible, user-friendly and has a streamlined architecture and quality process. CustusX has successfully been used for IGT research in neurosurgery, laparoscopic surgery, vascular surgery, and bronchoscopy.\n\nConclusions: \nCustusX is now a mature research platform for intraoperative navigation and ultrasound imaging and is ready for use by the IGT research community. CustusX is open-source and freely available at http://www.custusx.org .","authors":["Christian Askeland","OleVegard Solberg","Janne Beate Lervik Bakeng","Ingerid Reinertsen"],"meta":["September 2015International Journal of Computer Assisted Radiology and Surgery 11(4):1-15","DOI:10.1007/s11548-015-1292-0","Projects: Navigated bronchoscopyNavigated bronchoscopy"],"references":["324017848_The_ITK_Software_Guide","280224590_Accuracy_of_electromagnetic_tracking_in_navigated_bronchoscopy_with_a_prototype_field_generator_in_an_interventional_OR_setting","274725831_Versatile_robotic_probe_calibration_for_position_tracking_in_ultrasound_imaging","263708601_Navigated_Bronchoscopy_A_Technical_Review","262381386_PLUS_Open-Source_Toolkit_for_Ultrasound-Guided_Intervention_Systems","261328846_Intra-operative_correction_of_brain-shift","292796591_Learning_OpenCV_Computer_vision_with_OpenCV_library","262277978_PNG_The_Definitive_Guide","261325688_Automatic_registration_of_CT_images_to_patient_during_the_initial_phase_of_bronchoscopy_A_clinical_pilot_study","260527358_Nonrigid_Registration_of_Ultrasound_and_MRI_Using_Contextual_Conditioned_Mutual_Information"]}