{"id":"282213018_Neologismes_de_sens_contribution_a_leur_caracterisation_dans_un_corpus_autour_du_theme_de_la_crise_financiere","abstract":"De nombreux domaines comme la recherche d'information, la linguistique ou le traitement automatique des langues recourent à des ressources lexicales. Dans le contexte de la nécessaire mise à jour de telles ressources, cet article examine une méthodologie de détection et de qualification des néologismes de sens dans la lignée des travaux de (Bauer ; Renouf, 2000) et (Picton, 2009) notamment. Fondée sur l'exploitation d'un corpus d'étude constitué autour du thème de la crise financière de fin 2008, l'étude présentée s'intéresse plus précisément aux noms bouclier, tempête, tsunami et aux adjectifs pourri, toxique et financier. La méthodologie proposée repose sur une exploration des réseaux de cooccurrents d'ordre 2 obtenus à partir des séquences nom- adjectif contenant les cibles lexicales. Elle hiérarchise l'information apportée par les cooccurrents et l'articule avec le ou les sens délivré(s) par une ressource lexicale sous forme de traits sémantiques. Les cooccurrents sont sélectionnés à l'aide du logiciel Termostat (Drouin ; Paquier ; Ménard, 2006), sur un critère de spécificité dans le corpus financier par rapport à un corpus de référence. Les traits sémantiques sont puisés automatiquement dans un dictionnaire de langue, le Trésor de la Langue Française informatisé. Les cooccurrents et les traits sémantiques sont comparés à partir de classes manuelles interprétées comme des facettes sémantiques. L'approche, partiellement automatisée et complétée par une analyse manuelle des résultats, cherche à faire émerger des éléments associés au nouveau sens des lexies retenues ainsi que les liens avec les sens préexistants.","authors":["Coralie Reutenauer","Evelyne Jacquey","Sandrine Ollinger"],"meta":["December 2011"],"references":["242087759_Extraction_semi-automatique_des_neologismes_dans_la_terminologie_du_terrorisme","228794699_Acquisition_des_termes_simples_fondee_sur_les_pivots_lexicaux_specialises","32221045_Morphology-based_Enhancement_of_a_French_SIMPLE_Lexicon","281385591_Annotation_semantique_profilage_textuel_et_lexical","240510905_Draft_Contextual_Clues_to_Word-Meaning"]}