{"id":"282294494_Cloud_Computing_Based_e-Learning_Opportunities_and_Challenges_for_Tertiary_Institutions_in_Nigeria","abstract":"With the significant advances in Information and Communications Technologies (ICTs), teaching and learning styles are changing fast and learning environments are greatly been influenced and transformed. E-learning is one such innovation and relates to the use of electronic mechanisms to support learning process, which is growing in popularity and becoming a powerful trend for the immense benefits it offers to learning environments. However, deploying and managing e-learning systems require huge investments in IT and many educational institutions cannot afford the cost. Cloud computing, a recent shift in computing paradigm which is envisioned to be the next generation architecture of IT industry, promotes the delivery of powerful computing resources as a service. We give an overview of the concepts and structure of cloud computing and its potential value as a platform for e-learning. Despite being in their early stages of development, we nonetheless argue their confluence will provide access to and enabling environment for delivery of effective and quality knowledge.","authors":["Akilu Rilwan","Salisu Mamman Abdulrahman"],"meta":["September 2015","DOI:10.17706/ijeeee.2015.5.3.144-152"],"references":["348335311_The_role_of_e-learning_advantages_and_disadvantages_of_its_adoption_in_higher_education","276354593_Towards_Cloud_Adoption_in_Africa_The_Case_of_Nigeria","275538696_Information_and_Communication_Technology_ICT_in_Higher_Education_Advantages_Disadvantages_Conveniences_and_Limitations_of_Applying_E-learning_to_Agricultural_Students_in_Iran","274176914_A_Perspective_on_E-learning_and_Cloud_Computing","264420945_Cloud_Computing_Based_E-Learning_System","309347630_Introduction_to_cloud_computing","292438171_E-learning_and_distance_education_in_Nigeria","284286682_Using_cloud_computing_in_e-learning_systems","271589475_DRAFT_Cloud_Computing_Synopsis_and_Recommendations","266483344_E-learning_based_on_Cloud_Computing"]}