{"id":"282248121_Finding_Desirable_Objects_under_Group_Categorical_Preferences","abstract":"Considering a group of users, each specifying individual preferences over categorical attributes, the problem of determining a set of objects that are objectively preferable by all users is challenging on two levels. First, we need to determine the preferable objects based on the categorical preferences for each user, and second we need to reconcile possible conflicts among users' preferences. A naıve solution would first assign degrees of match between each user and each object, by taking into account all categorical attributes, and then for each object combine these matching degrees across users to compute the total score of an object. Such an approach, however, performs two series of aggregation, among categorical attributes and then across users, which completely obscure and blur individual preferences. Our solution, instead of combining individual matching degrees, is to directly operate on categorical attributes, and define an objective Pareto-based aggregation for group preferences. Building on our interpretation, we tackle two distinct but relevant problems: finding the Pareto-optimal objects, and objectively ranking objects with respect to the group preferences. To increase the efficiency when dealing with categorical attributes, we introduce an elegant transformation of categorical attribute values into numerical values, which exhibits certain nice properties and allows us to use well-known index structures to accelerate the solutions to the two problems. In fact, experiments on real and synthetic data show that our index-based techniques are an order of magnitude faster than baseline approaches, scaling up to millions of objects and thousands of users.","authors":["Nikos Bikakis","Karim Benouaret","Dimitris Sacharidis"],"meta":["October 2016Knowledge and Information Systems","DOI:10.1007/s10115-015-0886-8"],"references":["262791517_A_Study_on_External_Memory_Scan-Based_Skyline_Algorithms","314794846_Flytrap_intelligent_group_music_recommendation","313708771_The_R-tree_An_efficient_and_robust_access_method_for_points_and_rectangles","301222357_Toward_the_next_generation_of_recommender_systems_A_survey_of_the_state-of-the-art_and_possible_extensions","290187731_Sequential_music_recommendations_for_groups_by_balancing_user_satisfaction","285983578_On_Skyline_Queries_and_How_to_Choose_from_Pareto_Sets","276275718_Social_Choice_and_the_Mathematics_of_Manipulation","275706861_Social_Choice_and_Individual_Values","272030574_Dhillon_IS_Parallel_matrix_factorization_for_recommender_systems","262397140_Worst-Case_IO-Efficient_Skyline_Algorithms","259763774_Reconciling_Multiple_Categorical_Preferences_with_Double_Pareto-Based_Aggregation","262281972_Skyline_operator_on_anti-correlated_distributions","259634223_Bounded_matrix_factorization_for_recommender_system","257391708_Recommender_systems_survey","256721046_Interactive_skyline_queries"]}