{"id":"282339130_Adaptive_and_Energy_Efficient_Walking_in_a_Hexapod_Robot_Under_Neuromechanical_Control_and_Sensorimotor_Learning","abstract":"The control of multi-legged animal walking is a neuromechanical process, and to achieve this in an adaptive and energy efficient way is a difficult and challenging problem. This is due to the fact that this process needs in real time 1) to coordinate very many degrees of freedom of jointed legs, 2) to generate the proper leg stiffness (i.e., compliance), and 3) to determine joint angles that give rise to particular positions at the endpoints of the legs. To tackle this problem for a robotic application, here we present a neuromechanical controller coupled with sensorimotor learning. The controller consists of a modular neural network (MNN) for coordinating 18 joints and several virtual agonist-antagonist muscle mechanisms (VAAMs) for variable compliant joint motions. In addition, sensorimo-tor learning, including forward models and dual-rate learning processes, is introduced for predicting foot force feedback and for online tuning the VAAMs' stiffness parameters. The control and learning mechanisms enable the hexapod robot AMOS to achieve variable compliant walking that accommodates different gaits and surfaces. As a consequence, AMOS can perform more energy efficient walking, compared to other small legged robots. In addition, this study also shows that the tight combination of neural control with tunable muscle-like functions, guided by sensory feedback and coupled with sensorimotor learning, is a way forward to better understand and solve adaptive coordination problems in multi-legged locomotion.","authors":["Xiaofeng Xiong","Florentin Wörgötter","Poramate Manoonpong"],"meta":["September 2015IEEE transactions on systems, man, and cybernetics. Part B, Cybernetics: a publication of the IEEE Systems, Man, and Cybernetics Society PP(99)","DOI:10.1109/TCYB.2015.2479237"],"references":["277931591_Towards_versatile_legged_robots_through_active_impedance_control","314871915_The_mechanics_of_running_How_does_stiffness_couple_with_speed","290467562_The_LpzRobots_Simulator","283458371_Central_pattern_generators_for_locomotion_control_in_animals_and_robots_a_review","281668329_Principles_of_Animal_Locomotion","278712717_Biomechanics_and_Neural_Control_of_Posture_and_Movement","278702678_Musculoskeletal_Dynamics_in_Rhythmic_Systems_A_Comparative_Approach_to_Legged_Locomotion","277508527_RHex_A_Simple_and_Highly_Mobile_Hexapod_Robot","274599380_Virtual_Model_Control_An_Intuitive_Approach_for_Bipedal_Locomotion","269261943_BigDog_the_Rough-Terrain_Quadruped_Robot"]}