{"id":"282304110_Measuring_Opinion_Credibility_in_Twitter","abstract":"Today thousands of people in Hong Kong are protesting an election reform that would essentially mandate Beijing approval of candidates for Hong Kong’s chief executive. Many people such as Hong Kong citizen, government staff, journalists and news channels express information and their opinions about Hong Kong Revolution over social media. In that event, we don’t know whose opinions are strong or credential. Therefore when we take the information from opinion content, the identifier of an author may help to determine credibility. The opinions of specialists and recognized experts are more likely to be credential and to reflect a significant viewpoint. For that reason, we propose a new method to define the credibility of sentiment polarity based on their expertise or background knowledge and apply on Twitter: social media. Hence we identify the credibility of tweets polarity for a particular topic, we add weight of authors according to their expert knowledge. We classify tweets sentiment polarity using machine learning technique: Support Vector machine (SVM) and we combine it with weight of authors’ background knowledge based on author’s profile, twitter List feature and their tweets behavior for a given topic and then show the result as the percentage of credibility on their positive or negative views.","authors":["Mya Thandar","Sasiporn Usanavasin"],"meta":["January 2015Advances in Intelligent Systems and Computing 361:205-214","DOI:10.1007/978-3-319-19024-2_21"],"references":["270980322_Feature_based_Summarization_of_Customers'_Reviews_of_Online_Products","239811601_Inferring_Who-is-Who_in_the_Twitter_Social_Network","221654582_Mining_and_summarizing_customer_reviews","221520147_Twitterrank_Finding_Topic-Sensitive_Influential_Twitterers","220746311_Twitter_as_a_Corpus_for_Sentiment_Analysis_and_Opinion_Mining","270877892_Expert_Finding_for_Microblog_Misinformation_Identification","269332365_Sentiment_analysis_in_twitter_using_machine_learning_techniques","262401159_High_Precision_Credibility_Analysis_of_Information_on_Twitter","261281141_Opinion_Mining_on_Social_Media_Data","228523135_Twitter_sentiment_classification_using_distant_supervision","221520061_Identifying_Topical_Authorities_in_Microblogs","2518534_Thumbs_up_Sentiment_Classification_Using_Machine_Learning_Techniques"]}