{"id":"282397694_Fostering_sustained_idea_improvement_with_principle-based_knowledge_building_analytic_tools","abstract":"The purpose of this study is to explore the use of principle-based analytic tools to improve community knowledge building in a class of Grade 5/6 students. A flexible design framework was used to engage students in use of three analytic tools - a Vocabulary Analyzer, a Social Network Tool, and a Semantic Overlap Tool. These tools are built into Knowledge Forum technology so principle-based assessment is integral to knowledge work. The primary source of data was discourse generated by students in Knowledge Forum over a school semester (approximately four months). Findings based on a mixed-methods analysis reveal principle-based knowledge building analytic tools to be effective in increasing the frequency with which key terms are used by individuals, in their own productive vocabulary as well as in the shared community space, thus creating a more discursively connected community. Results additionally show a shift from problem generation and breadth of inquiry to increased self-assessment, reflection, and depth of inquiry; also, students report significant ways in which knowledge building analytic tools can increase knowledge building capacity.","authors":["Huang-Yao Hong","Marlene Scardamalia","Richard Messina","Chew-Lee Teo"],"meta":["August 2015Computers & Education 89","DOI:10.1016/j.compedu.2015.08.012"],"references":["288914107_Improving_Tag-Clouds_as_Visual_Information_Retrieval_Interfaces","281753730_Group-level_formative_feedback_and_metadiscourse","313475155_Guided_Discovery_in_a_Community_of_Learners","313219938_An_exploration_of_rotating_leadership_in_a_knowledge_building_community","313219642_Computer_support_intentional_learning_environment","313219577_Fostering_communities_of_learners_and_knowledge_building_An_interrupted_dialogue","313177302_Introduction_to_instructional_systems","312939545_Learning_remembering_and_understanding","300950215_Understanding_how_students_perceive_the_role_of_ideas_for_their_knowledge_work_in_a_knowledge-building_environment","297184560_Structure_and_improvisation_in_creative_teaching"]}