{"id":"282348516_The_third_comprehensive_survey_on_scheduling_problems_with_setup_timescosts","abstract":"Scheduling involving setup times/costs plays an important role in today's modern manufacturing and service environments for the delivery of reliable products on time. The setup process is not a value added factor, and hence, setup times/costs need to be explicitly considered while scheduling decisions are made in order to increase productivity, eliminate waste, improve resource utilization, and meet deadlines. However, the vast majority of existing scheduling literature, more than 90 percent, ignores this fact. The interest in scheduling problems where setup times/costs are explicitly considered began in the mid-1960s and the interest has been increasing even though not at an anticipated level. The first comprehensive review paper (Allahverdi et al., 1999) on scheduling problems with setup times/costs was in 1999 covering about 200 papers, from mid-1960s to mid-1988, while the second comprehensive review paper (Allahverdi et al., 2008) covered about 300 papers which were published from mid-1998 to mid-2006. This paper is the third comprehensive survey paper which provides an extensive review of about 500 papers that have appeared since the mid-2006 to the end of 2014, including static, dynamic, deterministic, and stochastic environments. This review paper classifies scheduling problems based on shop environments as single machine, parallel machine, flowshop, job shop, or open shop. It further classifies the problems as family and non-family as well as sequence-dependent and sequence-independent setup times/costs. Given that so many papers have been published in a relatively short period of time, different researchers have addressed the same problem independently, by even using the same methodology. Throughout the survey paper, the independently addressed problems are identified, and need for comparing these results is emphasized. Moreover, based on performance measures shop and setup times/costs environments, the less studied problems have been identified and the need to address these problems is specified. The current survey paper, along with those of Allahverdi et al. (1999, 2008), is an up to date survey of scheduling problems involving static, dynamic, deterministic, and stochastic problems for different shop environments with setup times/costs since the first research on the topic appeared in the mid-1960s.","authors":["Ali Allahverdi"],"meta":["October 2015European Journal of Operational Research 377(2):345-378","DOI:10.1016/j.ejor.2015.04.004"],"references":["332972181_ANALYSIS_OF_MIXED_INTEGER_PROGRAMMING_FORMULATIONS_FOR_SINGLE_MACHINE_SCHEDULING_PROBLEMS_WITH_SEQUENCE_DEPENDENT_SETUP_TIMES_AND_RELEASE_DATES","320356406_Minimising_maximum_tardiness_in_assembly_flowshops_with_setup_times","290606774_C_Ozgur_and_L_Bai_Hierarchical_Composition_Heuristic_for_Asymmetric_Sequence_Dependent_Single_Machine_Scheduling_Problems_Operations_Management_Research_Vol_3No_1_pp_98-106_MarchJune_2010","301475414_A_New_Branch-And-Bound_Algorithm_for_the_Unrelated_Parallel_Machine_Scheduling_Problem_with_Sequence-Dependent_Setup_Times","301249956_Two-Stage_Assembly_Scheduling_Problem_to_Minimize_Total_Tardiness_with_Setup_Times","299207902_Two-machine_flowshop_scheduling_problem_to_minimize_maximum_lateness_with_bounded_setup_and_processing_times","299103518_Bicriteria_scheduling_problem_on_parallel_machine","298949565_Creating_a_Mathematical_Model_for_Scheduling_the_Entrance_Sequence_of_Products_in_Sewing_Cells","295278140_Metaheuristics_for_Solving_a_Hybrid_Flexible_Flowshop_Problem_with_Sequence-Dependent_Setup_Times","289874447_Study_of_The_Cytotoxicity_of_The_Nitinol_Surface_with_The_Anodic_Treatment"]}