{"id":"282345535_Harmony_Search_Algorithm_for_Word_Sense_Disambiguation","abstract":"Word Sense Disambiguation (WSD) is the task of determining which sense of an ambiguous word (word with multiple meanings) is chosen in a particular use of that word, by considering its context. A sentence is considered ambiguous if it contains ambiguous word(s). Practically, any sentence that has been classified as ambiguous usually has multiple interpretations, but just one of them presents the correct interpretation. We propose an unsupervised method that exploits knowledge based approaches for word sense disambiguation using Harmony Search Algorithm (HSA) based on a Stanford dependencies generator (HSDG). The role of the dependency generator is to parse sentences to obtain their dependency relations. Whereas, the goal of using the HSA is to maximize the overall semantic similarity of the set of parsed words. HSA invokes a combination of semantic similarity and relatedness measurements, i.e., Jiang and Conrath (jcn) and an adapted Lesk algorithm, to perform the HSA fitness function. Our proposed method was experimented on benchmark datasets, which yielded results comparable to the state-of-the-art WSD methods. In order to evaluate the effectiveness of the dependency generator, we perform the same methodology without the parser, but with a window of words. The empirical results demonstrate that the proposed method is able to produce effective solutions for most instances of the datasets used.","authors":["Saad Abed","Sabrina Tiun","Nazlia Omar"],"meta":["September 2015PLoS ONE 10(9):e0136614","DOI:10.1371/journal.pone.0136614"],"references":["290730335_Feature_Words_Selection_for_Knowledge-based_Word_Sense_Disambiguation_with_Syntactic_Parsing","257512917_Word_sense_disambiguation_as_a_traveling_salesman_problem","235979455_Nature-Inspired_Metaheuristic_Algorithms","235344265_Ant_Colony_Algorithm_for_the_Unsupervised_Word_Sense_Disambiguation_of_Texts_Comparison_and_Evaluation","230876766_A_semantic_concordance","230876634_English_Tasks_All-Words_and_Verb_Lexical_Sample","305083440_Combining_local_context_and_WordNet_similarity_for_word_sense_identification","268184342_A_Genetic_Algorithm_Using_Semantic_Relations_for_Word_Sense_Disambiguation","243781549_The_thesaurus_in_syntax_and_semantics","230876769_The_Interaction_of_Knowledge_Sources_in_Word_Sense_Disambiguation"]}