{"id":"282310242_Matrix_Theory_for_Minimal_Trellises","abstract":"Trellises provide a graphical representation for the row space of a matrix.\nThe product construction of Kschischang and Sorokine builds minimal\nconventional trellises from matrices in minimal span form. Koetter and Vardy\nshowed that minimal tail-biting trellises can be obtained by applying the\nproduct construction to submatrices of a characteristic matrix.\nWe introduce the unique reduced minimal span form of a matrix and we obtain\nan expression for the unique reduced characteristic matrix. Among new\nproperties of characteristic matrices we prove that characteristic matrices are\nin duality if and only if they have orthogonal column spaces, and that the\ntranspose of a characteristic matrix is again a characteristic matrix if and\nonly if the characteristic matrix is reduced. These properties have clear\ninterpretations for the unwrapped unit memory convolutional code of a\ntail-biting trellis, they explain the duality for the class of Koetter and\nVardy trellises, and they give a natural relation between the characteristic\nmatrix based Koetter-Vardy construction and the displacement matrix based\nNori-Shankar construction.\nFor a pair of reduced characteristic matrices in duality, one is\nlexicographically first in a forward direction and the other is\nlexicographically first in the reverse direction. This confirms a conjecture by\nKoetter and Vardy after taking into account the different directions for the\nlexicographical ordering.","authors":["Iwan M. Duursma"],"meta":["November 2019Designs Codes and Cryptography 87(5)","DOI:10.1007/s10623-019-00627-8","SourcearXiv"],"references":["237817679_Unifying_Views_of_Tail-Biting_Trellises_for_Linear_Block_Codes","317836640_Linear_Algebraic_Groups","268710160_Brauer_factorization_and_solution_of_systems_of_linear_algebraic_equations","266313942_Bruhat_decomposition_and_solution_of_sparse_linear_algebraic_systems","260393502_On_the_Algebraic_Structure_of_Linear_Tail-Biting_Trellises","245402619_Bruhat_decomposition_and_solution_of_sparse_linear_algebraic_systems","243777741_Trellis_structure_of_codes","239785440_Delta_sets_for_divisors_supported_in_two_points","224213229_Linear_Tail-Biting_Trellises_Characteristic_Generators_and_the_BCJR-Construction","224213226_Minimal_Realizations_of_Linear_Systems_The_Shortest_Basis_Approach","224213222_Two-Point_Coordinate_Rings_for_GK-Curves","220683438_The_Structure_of_Tail-Biting_Trellises_Minimality_and_Basic_Principles","220681289_Codes_on_graphs_Normal_realizations","48192034_Characteristic_Generators_and_Dualization_for_Tail-Biting_Trellises","45894242_Distance_bounds_for_algebraic_geometric_codes"]}