{"id":"282356955_Visual_Metaphors_for_Semantic_Cultural_Heritage","abstract":"During the last decade, cultural heritage has moved toward the encoding of information in semantic format. Ontolo-gies make the description of artworks clearer, unambiguous and often self-explanatory, with advantages in terms of interoper-ability. The use of ontologies also lends itself to visualization techniques that leverage the structure of semantic relations to bridge the gap between the complexity of data and the need for immediate, simplified access. In the domain of cultural heritage, the current shift toward semantic encoding opens the way to the creation of interfaces that allow the users to orientate themselves easily in media repositories through a visual representation of their properties and relationships. In order to illustrate this approach, we describe a case study in ontologies and visualization for cultural heritage, Labyrinth. In Labyrinth, the user is immersed in a 3D labyrinth where turning points and paths represent a set of cultural artifacts and the semantic relations holding among them.","authors":["Rossana Damiano","Vincenzo Lombardo","Antonio Lieto"],"meta":["June 2015","DOI:10.4108/icst.intetain.2015.259506","Conference: INTETAIN 2015, 7th International Conference on Intelligent Technologies for Interactive Entertainment","Project: Labyrinth"],"references":["287119257_Lexical_Mediation_for_Ontology-Based_Annotation_of_Multimedia","286012778_Ontology-Based_Visualisation_of_Cultural_Heritage","282233834_Coupling_conceptual_modeling_and_rules_for_the_annotation_of_dramatic_media","271553134_ArtifactVis2_Managing_real-time_archaeological_data_in_immersive_3D_environments","306939383_The_magical_number_seven_plus_or_minus_two_Some_limits_on_our_capacity_to_process_information","290082849_Building_Narrative_Connections_among_Media_Objects_in_Cultural_Heritage_Repositories","290042150_Search_or_browse_Casual_information_access_to_a_cultural_heritage_collection","289923259_Ontological_Representation_of_Narratives_A_Case_Study_on_Stories_and_Actions","274180173_Myths_and_Folktales","273108010_Through_the_Labyrinth_Designs_and_Meanings_over_5000_Years"]}