{"id":"282426709_A_Uniform_Approach_for_Synthesizing_Property-Enforcing_Supervisors_for_Partially-Observed_Discrete-Event_Systems","abstract":"The problem under consideration in this paper is that of enforcement by supervisory control of a given property on a partially-observed discrete-event system. We present a general methodology that is applicable to a large class of properties previously studied (individually) in the literature. These properties include, but are not restricted to, safety, diagnosability, opacity, detectability, anonymity and attractability. When the given system does not satisfy the considered property, the objective is to synthesize a supervisor that restricts the system’s behavior and provably enforces the given property; moreover, it is required that this supervisor be maximally permissive. We consider the general case where the system’s events are partitioned into observable and unobservable events, and controllable and uncontrollable events, and we do not make any assumptions about these two partitions; in particular, we do not assume that all controllable events are observable. Our uniform approach first maps the considered property to a suitably-defined information state for the partially-observed system and then develops a supervisor synthesis methodology based on a finite bipartite transition system that embeds all reachable information states and all admissible supervisory control strategies. This transition system is called the All Enforcement Structure (or AES). We present an algorithm for the construction of the AES and discuss its properties. Then we use the AES to develop a synthesis algorithm that constructs a supervisor that is provably property enforcing and maximally permissive. We illustrate the application of our uniform approach to the enforcement of the above-mentioned properties","authors":["Xiang Yin","Stephane Lafortune"],"meta":["August 2016IEEE Transactions on Automatic Control 61(8):2140-2154","DOI:10.1109/TAC.2015.2484359"],"references":["319434005_Supervisory_Control_of_Discrete-Event_Systems_v20170901","307594039_A_new_approach_for_enforcing_opacity_via_supervisory_control_for_partially-observed_discrete-event_systems","282556740_Synthesis_of_Maximally_Permissive_Supervisors_for_Partially-Observed_Discrete-Event_Systems","278714004_Supervisory_Control_of_Discrete-Event_Systems","271952544_Enforcing_Opacity_of_Regular_Predicates_on_Modal_Transition_Systems","271640261_Enforcement_and_Validation_at_runtime_of_Various_Notions_of_Opacity","324692519_Supervisory_control_of_concurrent_systems_A_petri_net_structural_approach","288688798_A_General_Approach_for_Synthesis_of_Supervisors_for_Partially-Observed_Discrete-Event_Systems","284332229_k-Anonymity_A_Model_for_Protecting_Privacy","269259156_Enforcing_Opacity_of_Regular_Predicates_on_Modal_Transition_Systems"]}