{"id":"282427253_On_transparent_law_good_legislation_and_accessibility_to_legal_information_Towards_an_integrated_legal_information_system","abstract":"This paper connects to Jon Bing’s great vision of an integrated national legal information system. The intention of this paper is to variegate Bing’s vision of an integrated information system by shifting the focus to the lay users, thus to those, who are subject to the law. The modified vision is an integrated information system that supports intelligible access to law for the citizens. This presupposes however an unambiguous and transparent legal system. Accordingly, it is also stressed that intelligent legal knowledge engineering has high potential to increase precision and rationality in law, and hence safeguard the predictability of law and legal certainty. The central hypothesis is that putting the person who is subject to the law at the centre provides more rational reason to aim for the greatest possible precision of law by exploiting the means and technologies of our time than to uphold strategic vagueness. On this basis, the paper proposes the development of a basic set of controllable and justiciable basic legal drafting standards on EU and on national level, and promotes a transparency by design approach for legal knowledge engineering in order to enhance precision, integrity, comprehensibility and accessibility of law. Similarly to Jon Bing’s vision, this modified vision of an integrated legal information systems is, most probably, also likely to remain unfulfilled. However, what would science be without visions and (science) fictions?","authors":["Doris Liebwald"],"meta":["September 2015Artificial Intelligence and Law 23(3)","DOI:10.1007/s10506-015-9172-z"],"references":["344497795_Vagueness_in_Law","336736672_Rechtstext_und_Textarbeit","332862794_Interfacing_between_different_legal_systems_using_the_examples_of_N-Lex_and_EUR-Lex","321500477_The_Law_as_a_System_of_Signs","306257532_A_Theory_of_Legal_Argumentation_The_Theory_of_Rational_Discourse_as_Theory_of_Legal_Justification","299564475_Elemente_einer_Rechtssetzungslehre_3_Aufl","298087149_Crosswalking_EUR-Lex","297297839_A_Matter_of_Principle","275930578_Semiotics_and_Legal_Theory","274940090_A_Matter_of_Principle","274938781_The_Law_as_a_System_of_Signs","274301549_Value_Vagueness_and_Verifiability","272159434_How_to_Do_Things_with_Words","269462586_Verstandlichkeit_und_Bestimmtheit_-_Zwei_Welten","261658751_Wahrheit_und_Methode"]}