{"id":"282437975_Analytical_formulas_for_the_performance_scaling_of_quantum_processors_with_a_large_number_of_defective_gates","abstract":"Removing a single logical gate from a classical information processor renders this processor useless. This is not so for a quantum information processor. A large number of quantum gates may be removed without significantly affecting the processor's performance. In this paper, focusing on the quantum Fourier transform (QFT) and quantum adder, we show even more: Even if most of its gates are eliminated and the remaining gates are selected from a randomly generated set, the QFT, one of the most useful quantum processors, and the quantum adder, one of the most basic building blocks of a universal quantum computer, still operate with satisfactory success probability, comparable to that of a quantum computer constructed with perfect gates. We support these conclusions by first laying out a general analytical framework and then deriving analytical scaling relations, which are in excellent agreement with our numerical simulations. The demonstrated robustness of the QFT and quantum adder, to the point where randomly generated quantum gates take the place of the exact gates, is an important boon for the construction of quantum computers, since it shows that stringent gate error tolerances do not have to be met to obtain satisfactory performance of the corresponding quantum processors. Our analytical techniques are powerful enough to generate asymptotic scaling laws for any gate defect model of quantum information processors and we illustrate this point by explicitly computing asymptotic analytical scaling formulas for several other defect models as well.","authors":["Yunseong Nam","R. Blümel"],"meta":["October 2015Physical review A, Atomic, molecular, and optical physics 92(4)","DOI:10.1103/PhysRevA.92.042301"],"references":["277349959_Characterization_of_how_dissipation_and_dephasing_errors_accumulate_in_quantum_computers","276324496_Structural_stability_of_the_quantum_Fourier_transform","270751831_Robustness_of_the_quantum_Fourier_transform_with_respect_to_static_gate_defects","266747867_Quantifying_the_quantum_gate_fidelity_of_single-atom_spin_qubits_in_silicon_by_randomized_benchmarking","266576725_Experimental_Realization_of_Universal_Geometric_Quantum_Gates_with_Solid-State_Spins","263773867_An_addressable_quantum_dot_qubit_with_fault-tolerant_control_fidelity","261837868_Superconducting_quantum_circuits_at_the_surface_code_threshold_for_fault_tolerance","261016236_Robustness_and_performance_scaling_of_a_quantum_computer_with_respect_to_a_class_of_static_defects","260439303_Storing_quantum_information_for_30_seconds_in_a_nanoelectronic_device","282814290_Qubit_Metrology_of_Ultralow_Phase_Noise_Using_Randomized_Benchmarking"]}