{"id":"282437509_Automation_of_service-based_security-aware_business_processes_in_the_Cloud","abstract":"The use of business process standards to model and execute business needs is growing rapidly. In addition, Service-oriented Computing has been adopted to realize business processes, which basically consists of executing the process activities using services available in the Internet. In this context, the importance of security is apparent, because sensitive data sent over the Internet may be accessed by unauthorized third-parties. To prevent security problems, users may associate security requirements that must be enforced in essential tasks of the business process. This fact leads to the need of automation, because both functional and security requirements should be modeled, at high-level, and enforced, at execution level. This work proposes a cloud-based solution named BPA-Sec4Cloud that supports all phases of the security-aware business process automation, from its modeling to its deployment. The use of a cloud-based solution facilitates the deployment process because all needed resources are available in the cloud and ready to be used. In addition, the cloud is also used as a platform in order to provide specific services, such as translators, to support the automation process. In order to evaluate the BPA-Sec4Cloud, the solution was compared against existing solutions through the use of metrics related to the quality of generated artifacts.","authors":["Fernando Antonio Aires Lins","Julio C. Damasceno","Robson Wagner Albuquerque de Medeiros","Erica Teixeira Gomes Sousa"],"meta":["September 2016Computing 98(9)","DOI:10.1007/s00607-015-0476-3","Project: Sec-MoSC"],"references":["317600797_An_approach_for_reasoning_and_refining_non-functional_requirements","302738885_Enforcement_of_security_requirements_for_a_business_model","289712675_An_Extension_of_Business_Process_Model_and_Notation_for_Security_Risk_Management","268352537_Security_Requirements_Engineering_Support_for_Security-Annotated_Business_Processes","265206816_Security_Requirements_Engineering_for_Secure_Business_Processes","290368397_Modeling_Security_Requirements_in_Service_Based_Business_Processes","289715797_A_Security_Pattern-Driven_Approach_toward_the_Automation_of_Risk_Treatment_in_Business_Processes","272535965_Integrating_Security_Aspects_into_Business_Process_Models","271589473_The_NIST_definition_of_cloud_computing","262215927_An_aspect-oriented_framework_for_specification_and_enforcement_of_non-functional_concerns_in_WS-BPEL"]}