{"id":"282499637_Association_Discovery_in_Two-View_Data","abstract":"Two-view datasets are datasets whose attributes are naturally split into two sets, each providing a different view on the same set of objects. We introduce the task of finding small and non-redundant sets of associations that describe how the two views are related. To achieve this, we propose a novel approach in which sets of rules are used to translate one view to the other and vice versa. Our models, dubbed translation tables, contain both unidirectional and bidirectional rules that span both views and provide lossless translation from either of the views to the opposite view. To be able to evaluate different translation tables and perform model selection, we present a score based on the Minimum Description Length (MDL) principle. Next, we introduce three TRANSLATOR algorithms to find good models according to this score. The first algorithm is parameter-free and iteratively adds the rule that improves compression most. The other two algorithms use heuristics to achieve better trade-offs between runtime and compression. The empirical evaluation on real-world data demonstrates that only modest numbers of associations are needed to characterize the two-view structure present in the data, while the obtained translation rules are easily interpretable and provide insight into the data.","authors":["Matthijs van Leeuwen","Esther Galbrun"],"meta":["December 2015IEEE Transactions on Knowledge and Data Engineering 27(12):1-1","DOI:10.1109/TKDE.2015.2453159"],"references":["307174918_Mining_association_rules_between_sets_of_items_in_large_databases","257618291_Discovering_Significant_Patterns","227458453_The_Minimum_Description_Length_Principle","226372616_Mining_Non-Redundant_Association_Rules","310490008_From_black_and_white_to_full_color_extending_redescription_mining_outside_the_Boolean_world","288007115_A_Theoretical_Framework_for_Exploratory_Data_Mining_Recent_Insights_and_Challenges_Ahead","276944007_Clustering_high-dimensional_data","264886625_When_Pattern_met_Subspace_Cluster_-_a_Relationship_Story","254462997_The_Long_and_the_Short_of_It_Summarising_Event_Sequences_with_Serial_Episodes","235949419_Mining_Top-K_High_Utility_Itemsets"]}