{"id":"282476884_Impact_of_image-based_motion_correction_on_dopamine_D3D2_receptor_occupancy-comparison_of_groupwise_and_frame-by-frame_registration_approaches","abstract":"Image registration algorithms are frequently used to align the reconstructed brain PET frames to remove subject head motion. However, in occupancy studies, this is a challenging task where competitive binding of a drug can further reduce the available signal for registration. The purpose of this study is to evaluate two kinds of algorithms—a conventional frame-by-frame (FBF) registration and a recently introduced groupwise image registration (GIR), for motion correction of a dopamine D3/D2 receptor occupancy study.\nThe FBF method co-registers all the PET frames to a common reference based on normalised mutual information as the spatial similarity. The GIR method incorporates a pharmacokinetic model and conducts motion correction by maximising a likelihood function iteratively on tracer kinetics and subject motion. Data from eight healthy volunteers scanned with [11C]-(+)-PHNO pre- and post-administration of a range of doses of the D3 antagonist GSK618334 were used to compare the motion correction performance.\nThe groupwise registration achieved improved motion correction results, both by visual inspection of the dynamic PET data and by the reduction of the variability in the outcome measures, and required no additional steps to exclude unsuccessfully realigned PET data for occupancy modelling as compared to frame-by-frame registration. Furthermore, for the groupwise method, the resultant binding potential estimates had reduced variation and bias for individual scans and improved half maximal effective concentration (EC 50 ) estimates were obtained for the study as a whole.\nThese results indicate that the groupwise registration approach can provide improved motion correction of dynamic brain PET data as compared to frame-by-frame registration approaches for receptor occupancy studies.","authors":["Jieqing Jiao","Graham E Searle","Julia A Schnabel","Roger N Gunn"],"meta":["July 2015EJNMMI Physics 2(1):15","DOI:10.1186/s40658-015-0117-0"],"references":["261996792_Serotonin_2A_Receptor_Agonist_Binding_in_the_Human_Brain_with_11_CCimbi-36","224925160_Heterogeneity_of_Cholinergic_Denervation_in_Parkinson's_Disease_without_Dementia","221829474_Methods_for_Motion_Correction_Evaluation_Using_F-18-FDG_Human_Brain_Scans_on_a_High-Resolution_PET_Scanner","285797806_Interaction_between_serotonin_transporter_and_dopamine_D2D3_receptor_radioligand_measures_is_associated_with_harm_avoidant_symptoms_in_anorexia_and_bulimia_nervosa","260127915_A_Generalised_Spatio-Temporal_Registration_Framework_for_Dynamic_PET_Data_Application_to_Neuroreceptor_Imaging","256330908_Spatio-temporal_pharmacokinetic_model_based_registration_of_4D_PET_neuroimaging_data","233838765_Mathematical_Modelling_of_11C--PHNO_Human_Competition_Studies","233423275_Interaction_between_serotonin_transporter_and_dopamine_D2D3_receptor_radioligand_measures_is_associated_with_harm_avoidant_symptoms_in_anorexia_and_bulimia_nervosa","230763531_Ab_amyloid_deposition_in_Parkinson_disease_patients_at_risk_for_development_of_dementia","45092101_Imaging_dopamine_receptors_in_humans_with_11C--PHNO_Dissection_of_D3_signal_and_anatomy"]}