{"id":"282482802_JiTTree_A_Just-in-Time_Compiled_Sparse_GPU_Volume_Data_Structure","abstract":"Sparse volume data structures enable the efficient representation of large but sparse volumes in GPU memory for computation and visualization. However, the choice of a specific data structure for a given data set depends on several factors, such as the memory budget, the sparsity of the data, and data access patterns. In general, there is no single optimal sparse data structure, but a set of several candidates with individual strengths and drawbacks. One solution to this problem are hybrid data structures which locally adapt themselves to the sparsity. However, they typically suffer from increased traversal overhead which limits their utility in many applications. This paper presents JiTTree, a novel sparse hybrid volume data structure that uses just-in-time compilation to overcome these problems. By combining multiple sparse data structures and reducing traversal overhead we leverage their individual advantages. We demonstrate that hybrid data structures adapt well to a large range of data sets. They are especially superior to other sparse data structures for data sets that locally vary in sparsity. Possible optimization criteria are memory, performance and a combination thereof. Through just-in-time (JIT) compilation, JiTTree reduces the traversal overhead of the resulting optimal data structure. As a result, our hybrid volume data structure enables efficient computations on the GPU, while being superior in terms of memory usage when compared to non-hybrid data structures.","authors":["Matthias Labschutz","Stefan Bruckner","Eduard Gröller","Markus Hadwiger"],"meta":["November 2015IEEE Transactions on Visualization and Computer Graphics 22(1):1-1","DOI:10.1109/TVCG.2015.2467331"],"references":["298070408_GPU_data_structures_for_graphics_and_vision","238582946_Machine_learning_an_Artificial_Intelligence_approach_Volume_2","344037642_Optimizing_data_structures_in_high-level_programs_new_directions_for_extensible_compilers_based_on_staging","285088093_Spatial_data_structures_Modern_Database_Systems_The_Object_Model","277679289_Delite","262403911_Optimizing_Data_Structures_in_High-Level_Programs_New_Directions_for_Extensible_Compilers_based_on_Staging","260582954_Interactive_Volume_Exploration_of_Petascale_Microscopy_Data_Streams_Using_a_Visualization-Driven_Virtual_Memory_Approach","246530557_Introduction_to_Spatial_Data_Structures","242678487_A_Computer_Oriented_Geodetic_Data_Base_and_a_New_Technique_in_File_Sequencing","242442445_Spatial_data_structures_quadtrees"]}