{"id":"282499901_Diversifying_the_picture_of_explanations_in_biological_sciences_ways_of_combining_topology_with_mechanisms","abstract":"Besides mechanistic explanations of phenomena, which have been seriously investigated in the last decade, biology and ecology also include explanations that pinpoint specific mathematical properties as explanatory of the explanandum under focus. Among these structural explanations, one finds topological explanations, and recent science pervasively relies on them. This reliance is especially due to the necessity to model large sets of data with no practical possibility to track the proper activities of all the numerous entities. The paper first defines topological explanations and then explains why topological explanations and mechanisms are different in principle. Then it shows that they are pervasive both in the study of networks—whose importance has been increasingly acknowledged at each level of the biological hierarchy—and in contexts where the notion of selective neutrality is crucial; this allows me to capture the difference between mechanisms and topological explanations in terms of practical modelling practices. The rest of the paper investigates how in practice mechanisms and topologies are combined. They may be articulated in theoretical structures and explanatory strategies, first through a relation of constraint, second in interlevel theories (Sect. 3), or they may condition each other (Sect. 4). Finally, I explore how a particular model can integrate mechanistic informations, by focusing on the recent practice of merging networks in ecology and its consequences upon multiscale modelling (Sect. 5).","authors":["Philippe Huneman"],"meta":["July 2015Synthese 195(1)","DOI:10.1007/s11229-015-0808-z"],"references":["330861549_The_Shape_of_Life_Genes_Development_and_the_Evolution_of_Animal_Form","320181690_La_connaissance_de_la_vie","320181465_The_origins_of_order_self-organization_and_selection_in_evolution","317333932_PERSPECTIVE_A_CRITIQUE_OF_SEWALL_WRIGHT'S_SHIFTING_BALANCE_THEORY_OF_EVOLUTION","313079347_The_chemical_basis_of_morphogenesis","289194341_What_are_gene_regulatory_networks","286004317_Explaining_the_Brain","284835893_Quantitative_Methods_for_Ecological_Network_Analysis_and_Its_Application_to_Coastal_Ecosystems","281095398_The_Chemical_Basis_of_Morphogenesis","280891324_Darwinism's_Struggle_for_Survival_Heredity_and_the_Hypothesis_of_Natural_Selection"]}