{"id":"282426261_A_Radiance_Cache_Method_for_Highly_Glossy_Surfaces","abstract":"Radiance caching methods have proven to be efficient for global illumination. Their goal is to compute precisely illumination values (incident radiance or irradiance) at a reasonable number of points lying on the scene surfaces. These points, called records, are stored in a cache used for estimating illumination at other points in the scene. Unfortunately, with records lying on glossy surfaces, the irradiance value alone is not sufficient to evaluate the reflected radiance; each record should also store the incident radiance for all incident directions. Memory storage can be reduced with projection techniques using spherical harmonics or other basis functions. These techniques provide good results for low shininess BRDFs. However, they get impractical for shininess of even moderate value, since the number of projection coefficients increases drastically. In this paper, we propose a new radiance caching method that handles highly glossy surfaces while requiring a low memory storage. Each cache record stores a coarse representation of the incident illumination thanks to a new data structure, called Equivalent Area light Sources, capable of handling fuzzy mirror surfaces. In addition, our method proposes a new simplification of the interpolation process, since it avoids the need for expressing and evaluating complex gradients.","authors":["Mahmoud Omidvar","Mickaël Ribardière","Samuel Carré","Daniel Meneveaux"],"meta":["October 2016The Visual Computer 32(10)","DOI:10.1007/s00371-015-1159-y"],"references":["220852986_Making_Radiance_and_Irradiance_Caching_Practical_Adaptive_Caching_and_Neighbor_Clamping","296945493_A_Vector_Approach_for_Global_Illumination_in_Ray_Tracing","279401877_Lightcuts","277679342_genBRDF","263374750_Pre-convolved_Radiance_Caching","262314068_Practical_Hessian-Based_Error_Control_for_Irradiance_Caching","262275553_A_Practical_Algorithm_for_Rendering_Interreflections_with_All-Frequency_BRDFs","261846185_An_Adaptive_Method_for_Indirect_Illumination_Using_Light_Vectors","245667991_Clear_A_Ray_Tracing_Solution_for_Di_use_Interreflection","238727640_Robust_Monte_Carlo_Methods_for_Light_Transport_Simulation"]}