{"id":"282455252_Primary_care_physicians'_perspectives_on_computer-based_health_risk_assessment_tools_for_chronic_diseases_A_mixed_methods_study","abstract":"Background: \nHealth risk assessment tools compute an individual's risk of developing a disease. Routine use of such tools by primary care physicians (PCPs) is potentially useful in chronic disease prevention. We sought physicians' awareness and perceptions of the usefulness, usability and feasibility of performing assessments with computer-based risk assessment tools in primary care settings.\n\nMethods: \nFocus groups and usability testing with a computer-based risk assessment tool were conducted with PCPs from both university-affiliated and community-based practices. Analysis was derived from grounded theory methodology.\n\nResults: \nPCPs (n = 30) were aware of several risk assessment tools although only select tools were used routinely. The decision to use a tool depended on how use impacted practice workflow and whether the tool had credibility. Participants felt that embedding tools in the electronic medical records (EMRs) system might allow for health information from the medical record to auto-populate into the tool. User comprehension of risk could also be improved with computer-based interfaces that present risk in different formats.\n\nConclusions: \nIn this study, PCPs chose to use certain tools more regularly because of usability and credibility. Despite there being differences in the particular tools a clinical practice used, there was general appreciation for the usefulness of tools for different clinical situations. Participants characterised particular features of an ideal tool, feeling strongly that embedding risk assessment tools in the EMR would maximise accessibility and use of the tool for chronic disease management. However, appropriate practice workflow integration and features that facilitate patient understanding at point-of-care are also essential.","authors":["Teja Voruganti","Mary Ann O'Brien","Sharon E. Straus","John R Mclaughlin"],"meta":["September 2015Journal of Innovation in Health Informatics 22(3):333-339","DOI:10.14236/jhi.v22i3.153"],"references":["263742263_Inaccurate_Risk_Perceptions_and_Individualized_Risk_Estimates_by_Patients_with_Type_2_Diabetes","260089917_Effectiveness_of_the_Heart_Age_tool_for_improving_modifiable_cardiovascular_risk_factors_in_a_Southern_European_population_A_randomized_trial","249731235_Naturalistic_Inquiry_and_the_Saturation_Concept_A_Research_Note","249674934_A_Description_of_Think_Aloud_Method_and_Protocol_Analysis","233957407_What_is_needed_to_implement_a_computer-assisted_health_risk_assessment_tool_An_exploratory_concept_mapping_study","221688911_Family_Physicians'_Perceptions_and_Use_of_Electronic_Clinical_Decision_Support_During_the_First_Year_of_Implementation","51175012_Risk_Assessment_Tools_for_Identifying_Individuals_at_Risk_of_Developing_Type_2_Diabetes","51078366_Studying_Technology_Use_as_Social_Practice_The_Untapped_Potential_of_Ethnography","236206676_Risk_assessment_tools_to_identify_women_with_increased_risk_of_osteoporotic_fracture_Complexity_or_simplicity_A_systematic_review","234131612_Methodological_triangulation_An_approach_to_understanding_data"]}