{"id":"282534082_A_resource-efficient_multimedia_encryption_scheme_for_embedded_video_sensing_system_based_on_unmanned_aircraft","abstract":"Battery-powered unmanned aerial vehicle based video sensing system is more cost-saving and energy-saving than traditional aircraft based systems. However, high-volume real-time sensing data is more vulnerable in unmanned system than that in manned system. Meanwhile, the computation and energy resources in such system are very limited, which restricts the use of complex encryption process on video data. Therefore, how to achieve confidentiality of video data under limited resources efficiently needs to be addressed. Firstly, resources constraints with their development trends in video sensing system are studied. Secondly, an information-utility-value-oriented resource-efficient encryption optimization model under resources constraints is given. Thirdly, based on this model, a video-compression-independent speed-adjustable lightweight encryption scheme with its improved version is proposed. Fourthly, a DSP and ARM based embedded secure video sensing system is designed, and the proposed encryption scheme has been implemented in it. In addition, theoretical analyses based on information theory and experimental analyses on throughputs show that the proposed encryption schemes can meet the real-time requirements of system under the tight resources constraints.","authors":["Chen Xiao","Lifeng Wang","Mengjiao Zhu"],"meta":["July 2015Journal of Network and Computer Applications 10","DOI:10.1016/j.jnca.2015.06.021"],"references":["286768860_Chaos_Based_Joint_Compression_and_Encryption_Framework_for_End-to-End_Communication_Systems","270762996_A_Survey_on_Joint_Compression_and_Encryption_Techniques_for_Video_Data","267947054_Cyber-Physical-Social_Based_Security_Architecture_for_Future_Internet_of_Things","283409224_Intelligence_oriented_comprehensive_information_theory","283313523_A_Survey_on_Joint_Compression_and_Encryption_Techniques_for_Video_Data","275998684_A_Hierarchical_Security_Model_for_Multimedia_Big_Data","264791163_Security_in_the_integration_of_low-power_Wireless_Sensor_Networks_with_the_Internet_A_survey","258584755_The_Security_Mechanism_for_Internet_of_Things_Networks","257627246_Puzzle_-_An_efficient_compression_independent_video_encryption_algorithm","247589158_Recent_Contributions_to_The_Mathematical_Theory_of_Communication"]}