{"id":"282574384_Aprender_a_programar_'apps'_como_enriquecimiento_curricular_en_alumnado_de_alta_capacidad","abstract":"INTRODUCCIÓN. En la sociedad actual, la programación informática se está constituyendo como una competencia básica que permite participar eficazmente en un mundo repleto de objetos digitales. En este contexto, nos preguntamos sobre la posibilidad y deseabilidad de aprender a programar aplicaciones (“apps”) para dispositivos móviles como enriquecimiento curricular en alumnado de alta capacidad. Tras la exploración inicial del problema, se fundamenta una triple hipótesis: a) aprender a programar “apps” es adecuado para alumnado de alta capacidad,dado que existe correspondencia entre las demandas de la tarea y las características cognitivas,creativas y de personalidad de los más capaces; b) es viable, dado que pueden establecerse metodologías didácticas a distancia y soportadas tecnológicamente, a través de cursos en línea y en abierto con tutorización esporádica, que se adaptan a su estilo de aprendizaje; c) es relevante,dado que les permite generar un producto final de creciente uso, utilidad y valoración social,y que potencialmente puede ser puesto a disposición de inmensas audiencias reales y globales.MÉTODO. Para el contraste de las anteriores hipótesis, se realiza una revisión sistemática con los siguientes criterios: artículos académicos publicados en revistas científicas en el periodo 2000-2013, en lengua inglesa o española, y catalogados en alguna de las bases de datos siguientes: ERIC, PsycINFO y EconLit; con arreglo al booleano de búsqueda: TX gift* AND TX program*AND TX (comput* OR tablet*). RESULTADOS. Se obtienen 67 referencias, de cuyo análisis se deriva que la hipótesis de viabilidad es objeto de contraste en el 62,7% de los artículos, seguida de la hipótesis de adecuación (44,8%) y de relevancia (19,4%). DISCUSIÓN. Se evidencia que la programación de “apps” supondría un enriquecimiento curricular significativo y completo para los alumnos más capaces, pues implicaría profundizar respectivamente en el contenido, en el proceso y en el producto de su aprendizaje.","authors":["Marcos Román-González"],"meta":["October 2014Bordón Revista de Pedagogía 66(4):135-155","DOI:10.13042/Bordon.2014.66401"],"references":["307782465_The_schoolwide_enrichment_model_a_comprehensive_plan_for_the_development_of_talents_and_giftedness","287710338_To_learn_from_teachers_at_school_ideal_teacher_or_e-learning_applications_from_the_perspectives_of_gifted_students","318369493_Online_Learning_for_Gifted_Students_from_the_Parents'_Perspectives","298098593_The_Right_Fit_for_Henry","294621244_Shaking_up_expectations_the_OCLS_shake_it_app","290619011_Gifted_Adolescents'_Talent_Development_through_Distance_Learning","290029849_Textbook_preferences_The_possibilities_of_individualized_learning_in_social_studies_with_an_individualized_textbook","286254753_From_Bits_and_Bytes_to_C_and_Web_Sites_What_is_Computer_Talent_Made_of","284662570_Scratch_Multimedia_Programming_Environment_for_Young_Gifted_Learners","277992678_Technology_An_Introduction_to_Using_Spreadsheets_to_Increase_the_Sophistication_of_Student_Projects"]}