{"id":"282540931_Institutions_and_axioms_an_extension_and_update_of_service-dominant_logic","abstract":"Service-dominant logic continues its evolution, facilitated by an active community of scholars throughout the world. Along its evolutionary path, there has been increased recognition of the need for a crisper and more precise delineation of the foundational premises and specification of the axioms of S-D logic. It also has become apparent that a limitation of the current foundational premises/axioms is the absence of a clearly articulated specification of the mechanisms of (often massive-scale) coordination and cooperation involved in the cocreation of value through markets and, more broadly, in society. This is especially important because markets are even more about cooperation than about the competition that is more frequently discussed. To alleviate this limitation and facilitate a better understanding of cooperation (and coordination), an eleventh foundational premise (fifth axiom) is introduced, focusing on the role of institutions and institutional arrangements in systems of value cocreation: service ecosystems. Literature on institutions across multiple social disciplines, including marketing, is briefly reviewed and offered as further support for this fifth axiom.","authors":["Stephen L. Vargo","Robert Lusch"],"meta":["July 2015Journal of the Academy of Marketing Science 44(1)","DOI:10.1007/s11747-015-0456-3"],"references":["348102219_Models_of_ManModels_of_Man_Social_and_Rational_Mathematical_Essays_on_Rational_Human_Behavior_in_a_Social_Setting","346644124_Institutional_Change_and_American_Economic_Growth","344486690_Outline_of_a_Theory_of_Practice","343800617_The_Co-Creation_Paradigm","336972630_Understanding_Institutional_Diversity","329445901_Understanding_Institutional_Designs_within_Marketing_Value_Systems","329256669_Interdependency_Contracting_and_Relational_Behavior_in_Marketing_Channels","329255676_Do_Norms_Matter_in_Marketing_Relationships","329053584_Distribution_Channels_as_Political_Economies_A_Framework_for_Comparative_Analysis","328709895_General_Theories_and_the_Fundamental_Explananda_of_Marketing"]}