{"id":"282547363_The_bibliometric_analysis_of_scholarly_production_How_great_is_the_impact","abstract":"Bibliometric methods or \"analysis\" are now firmly established as scientific specialties and are an integral part of research evaluation methodology especially within the scientific and applied fields. The methods are used increasingly when studying various aspects of science and also in the way institutions and universities are ranked worldwide. A sufficient number of studies have been completed, and with the resulting literature, it is now possible to analyse the bibliometric method by using its own methodology. The bibliometric literature in this study, which was extracted from Web of Science, is divided into two parts using a method comparable to the method of Jonkers et al. (Characteristics of bibliometrics articles in library and information sciences (LIS) and other journals, pp. 449-551, 2012: The publications either lie within the Information and Library Science (ILS) category or within the non-ILS category which includes more applied, \"subject\" based studies. The impact in the different groupings is judged by means of citation analysis using normalized data and an almost linear increase can be observed from 1994 onwards in the non-ILS category. The implication for the dissemination and use of the bibliometric methods in the different contexts is discussed. A keyword analysis identifies the most popular subjects covered by bibliometric analysis, and multidisciplinary articles are shown to have the highest impact. A noticeable shift is observed in those countries which contribute to the pool of bibliometric analysis, as well as a self-perpetuating effect in giving and taking references.","authors":["Ole Ellegaard","Johan A. Wallin"],"meta":["July 2015Scientometrics 105(3)","DOI:10.1007/s11192-015-1645-z"],"references":["303214441_Gephi_An_Open_Source_Software_for_Exploring_and_Manipulating_Networks","275335177_The_Leiden_Manifesto_for_research_metrics","267226789_Characteristics_of_Bibliometrics_Articles_in_Library_and_Information_Sciences_LIS_and_other_Journals","259588932_Global_Cardiovascular_Research_Output_Citations_and_Collaborations_A_Time-Trend_Bibliometric_Analysis_1999-2008","280895340_Visualizing_a_discipline_An_author_co-citation_analysis_of_information_science_1972-1995","278932685_Corpus_relevance_through_co-word_analysis_An_application_to_plant_proteins","263732883_Nanocatalysis_A_bibliometric_analysis","263198292_The_life_sciences_in_German-Chinese_cooperation_An_institutional-level_co-publication_analysis","260357094_Sixty_years_of_citation_analysis_studies_in_the_humanities_1951-2010","260356906_The_Bibliometric_Bandwagon_Characteristics_of_Bibliometric_Articles_Outside_the_Field_Literature"]}