{"id":"282553743_Self-adaptive_trust_management_based_on_game_theory_in_fuzzy_large-scale_networks","abstract":"Trust management plays an important role in ensuring and predicting the behaviors of nodes in networks. Most of the current trust management strategies adopt the average method to calculate nodes’ trust incomes and focus on two criteria (direct trust and recommendation). These strategies fail to consider the uncertainty in fuzzy and dynamic networks, and cannot effectively manage the low quality of information. In this paper, a novel trust management based on fuzzy logic and game theory by considering the uncertainty is established, which is appropriate for many different wireless networks (i.e., cognitive radio networks, social networking services, ad hoc networks, wireless mesh networks, and so on). First, we propose a multi-criteria fuzzy decision-making model to predict trust in the fuzzy and complex environment. Then a trust updating process based on game theory and evolutionary learning is designed. This process can self-adaptively adjust the trust evolution considering the dynamic of networks. Finally, two illustrative examples are provided to verify the proposed model. Compared to the traditional trust measurement method, the simulation results show that the proposed model has better adaptability and accuracy in fuzzy large-scale networks. More important, the proposed model achieves more significant performance gains over the traditional model.","authors":["He Fang","Li Xu","Xinyi Huang"],"meta":["August 2015Soft Computing 21(4)","DOI:10.1007/s00500-015-1821-3"],"references":["273319064_A_novel_multivariate_fuzzy_time_series_based_forecasting_algorithm_incorporating_the_effect_of_clustering_on_prediction","273194769_Multi-criteria_decision-making_methods_based_on_the_Hausdorff_distance_of_hesitant_fuzzy_linguistic_numbersDOI_101007s00500-015-1609-5","270584559_Smart_Cloud_Storage_Service_Selection_Based_on_Fuzzy_Logic_Theory_of_Evidence_and_Game_Theory","270099504_Fuzzy_measure_identification_for_Criteria_Coalitions_based_on_Linguistic_Information","264045459_A_Fuzzy_Logic-Based_System_for_the_Automation_of_Human_Behavior_Recognition_Using_Machine_Vision_in_Intelligent_Environments","288869566_Is_there_a_need_for_fuzzy_logic","277499410_Wright-Fisher_multi-strategy_trust_evolution_model_with_white_noise_for_Internetware","266736618_Analysis_on_the_Acceptance_of_Global_Trust_Management_for_Unwanted_Traffic_Control_based_on_Game_Theory","263893131_TruSMS_A_trustworthy_SMS_spam_control_system_based_on_trust_management","263694570_Opportunistic_channel_allocation_decision_making_in_cognitive_radio_communications"]}