{"id":"282524329_A_bibliometric_analysis_of_the_Turkish_software_engineering_research_community","abstract":"This paper presents a bibliometric analysis of the Turkish software engineering (SE) community (researchers and institutions). The bibliometric analysis has been conducted based on the number of papers published in the software-engineering-related venues and indexed in the Scopus academic search engine until year 2014. According to the bibliometric analysis, the top-ranked institution is Middle East Technical University, and the top-ranked scholar is Ayşe Başar Bener (formerly with Boğaziçi University and now with Ryerson University in Canada). The analysis reveals other important findings and presents a set of implications for the Turkish SE community and stakeholders (e.g., funding agencies and decision makers) such as the followings: (1) Turkey produces only about 0.49 % of the world-wide SE knowledge, as measured by the number of papers in Scopus, which is very negligible unfortunately. To take a more active role in the global SE community, the Turkish SE community has to increase their outputs. (2) We notice a lack of diversity in the general SE spectrum, e.g., we noticed very little focus on requirements engineering, software maintenance and evolution, and architecture. This denotes the need to further diversification in SE research topics in Turkey. (3) In total, 89 papers in the pool (30.8 % of the total) are internationally-authored SE papers. Having a good level of international collaborations is a good sign for the Turkish SE community. The highest international collaborations have been with researchers from United States, Canada and Netherlands. (4) In general, the involvement of industry in SE search is low. All stakeholders (e.g., government, industry and academia) should aim at increasing the level of industry-academia collaboration in the Turkish SE community, (5) Citation to Turkish SE papers, in general, are significantly lower than a set of three representative pools of SE papers. This is an area of concern which needs further investigation, and (6) In general, there is a need to increase both the quantity and quality of the Turkish SE papers, in the global stage. The approach we use in this study could be replicated in other countries to provide insights and trends about the SE research performance in other countries.","authors":["Vahid Garousi"],"meta":["August 2015Scientometrics 105(1)","DOI:10.1007/s11192-015-1663-x","Project: Bibliometrics in Software Engineering"],"references":["290318191_UML-Driven_Software_Performance_Engineering_A_Systematic_Mapping_and_Trend_Analysis","266278788_A_Bibliometrics_Analysis_of_Canadian_Electrical_and_Computer_Engineering_Institutions_1996-2006_Based_on_IEEE_Journal_Publications","265657085_The_41_View_Model_of_Industri-Academia_Collaboration","263915083_Development_of_scientific_software_A_systematic_mapping_a_bibliometrics_study_and_a_paper_repository","263805238_A_bibliometricgeographic_assessment_of_40_years_of_software_engineering_research_1969-2009","323431523_SOFTWARE_ENGINEERING_IS_ENGINEERING","322715583_Data_Mining_practical_machine_learning_tools_and_techniques","273597034_Bibliometric_analysis_of_tourism_and_hospitality_related_articles_published_in_Turkey","262566601_Data_Mining_Practical_Machine_Learning_Tools_and_Techniques_Third_Edition","261453178_Empirical_software_engineering_research_with_industry_Top_10_challenges"]}