{"id":"282534348_Automatic_Reconstruction_of_Parametric_Building_Models_from_Indoor_Point_Clouds","abstract":"We present an automatic approach for the reconstruction of parametric 3D building models from indoor point clouds. While recently developed methods in this domain focus on mere local surface reconstructions which enable e.g. efficient visualization, our approach aims for a volumetric, parametric building model that additionally incorporates contextual information such as global wall connectivity. In contrast to pure surface reconstructions, our representation thereby allows more comprehensive use: first, it enables efficient high-level editing operations in terms of e.g. wall removal or room reshaping which always result in a topologically consistent representation. Second, it enables easy taking of measurements like e.g. determining wall thickness or room areas. These properties render our reconstruction method especially beneficial to architects or engineers for planning renovation or retrofitting. Following the idea of previous approaches, the reconstruction task is cast as a labeling problem which is solved by an energy minimization. This global optimization approach allows for the reconstruction of wall elements shared between rooms while simultaneously maintaining plausible connectivity between all wall elements. An automatic prior segmentation of the point clouds into rooms and outside area filters large-scale outliers and yields priors for the definition of labeling costs for the energy minimization. The reconstructed model is further enriched by detected doors and windows. We demonstrate the applicability and reconstruction power of our new approach on a variety of complex real-world datasets requiring little or no parameter adjustment.","authors":["Sebastian Ochmann","Richard Vock","Raoul Wessel","Reinhard Klein"],"meta":["July 2015Computers & Graphics 54","DOI:10.1016/j.cag.2015.07.008"],"references":["289742178_Automatic_generation_of_structural_building_descriptions_from_3D_point_cloud_scans","275960895_RAPTER_Rebuilding_Man-made_Scenes_with_Regular_Arrangements_of_Planes","264057392_Automatic_Room_Detection_and_Reconstruction_in_Cluttered_Indoor_Environments_with_Complex_Room_Layouts","262371313_Reconstructing_Complex_Indoor_Environments_with_Arbitrary_Wall_Orientations","314585405_Multistory_Floor_Plan_Generation_and_Room_Labeling_of_Building_Interiors_from_Laser_Range_Data","307881957_LIBSVM_A_library_for_support_vector_machines","286973036_Floor_plan_generation_and_room_labeling_of_indoor_environments_from_Laser_range_data","281328471_Indoor_Scene_Reconstruction_using_Primitive-driven_Space_Partitioning_and_Graph-cut","273176762_Fast_Automated_Scalable_Generation_of_Textured_3D_Models_of_Indoor_Environments","272623654_Libsvm"]}