{"id":"282546426_Energy_Efficient_Clustering_Protocol_Using_Fuzzy_Logic_for_Heterogeneous_WSNs","abstract":"In this paper, we propose a multilevel heterogeneous network model characterized by a parameter, called model parameter that helps the model defining a network of 0-level, 1-level, 2-level, 3-level, and 4-level heterogeneity. We consider the hybrid energy efficient distributed (HEED) clustering protocol to estimate the network lifetime and accordingly name it as HEEDML (HEED MultiLevel). Depending on the heterogeneity, its variants have been named as HEEDML-0, HEEDML-1, HEEDML-2, HEEDML-3, and HEEDML-4 for 0-level, 1-level, 2-level, 3-level, and 4-level heterogeneity. The HEEDML-0 is the original HEED. The model parameter also determines the numbers of nodes of each type. We use the same parameters as in the HEED to decide the cluster heads: residual energy and node density. We also consider fuzzy implementation of the HEEDML. The HEEDML-1, HEEDML-2 HEEDML-3, and HEEDML-4 increase network lifetime by 39.61, 117.38, 182.69, and 223.7 %, corresponding to the increase in the network energy as 9.2, 17.40, 21.80, and 24 %, with respect to the HEEDML-0. The fuzzy implementation further increases the network lifetime. The HEEDML-FL-0, HEEDML-FL-1, HEEDML-FL-2, HEEDML-FL-3, and HEEDML-FL-4 increase the network lifetime by 193.84, 270.31, 375.84, 448.33, and 589.07 %, corresponding to the same increase in network energy as that for HEEDML (all levels) with respect to that of the HEEDML-0. The HEEDML-FL-0 increases the network lifetime by 193.84 % with respect to the original HEED without increasing the network energy. The packet delivery, total energy consumption, throughput, average delay, and traffic load have better results.","authors":["Samayveer Singh","Satish Chand","Bijendra Kumar"],"meta":["July 2015Wireless Personal Communications 86(2)","DOI:10.1007/s11277-015-2939-4"],"references":["272854913_3-Level_Heterogeneity_Model_for_Wireless_Sensor_Networks","271436674_A_Heterogeneous_Network_Model_for_Prolonging_Lifetime_in_3-D_WSNs","270527142_hetADEEPS_ADEEPS_for_Heterogeneous_Wireless_Sensor_Networks","263428335_Heterogeneous_HEED_Protocol_for_Wireless_Sensor_Networks","261478587_BHCDA_Bandwidth_efficient_heterogeneity_aware_cluster_based_data_aggregation_for_Wireless_Sensor_Network","312108843_Energy-efficient_communication_protocol_for_wireless_microsensor_networks","291987625_Distributed_energy-efficient_clustering_algorithm_for_heterogeneous_wireless_sensor_networks","285480574_PEGASIS_Power-efficient_gathering_in_sensor_information_systems","264822265_Distributed_stable_cluster_head_election_DSCHE_protocol_for_heterogeneous_wireless_sensor_networks","261355675_APTEEN_a_hybrid_protocol_for_efficient_routing_and_comprehensive_information_retrieval_in_wireless"]}