{"id":"282583209_Stress_in_the_Absence_of_Morphological_Conditioning_An_Experimental_Investigation_of_Stress_in_Greek_Acronyms","abstract":"Greek is a morphology-dependent stress system, where stress is lexically specified for a number of individual morphemes (e.g., roots and suffixes). In the absence of lexically encoded stress, a default stress emerges. Most theoretical analyses of Greek stress that assume antepenultimate stress to represent the default (e.g., Malikouti-Drachman & Drachman 1989; Ralli & Touratzidis 1992; Revithiadou 1999) are not independently confirmed by experimental studies (e.g., Protopapas et al. 2006; Apostolouda 2012; Topintzi & Kainada 2012; Revithiadou & Lengeris in press). Here, we explore the nature of the default stress in Greek with regard to acronyms, given their lack of overt morphology and fixed stress pattern, with a goal of exploring how stress patterns are shaped when morphological information (encapsulated in the inflectional ending) is suppressed. For this purpose, we conducted two production (reading aloud) experiments, which revealed, for our consultants, first, an almost complete lack of antepenultimate stress and, second, a split between penultimate and final stress dependent on acronym length, the type of the final segment and the syllable type of the penultimate syllable. We found two predominant correspondences: (a) consonant-final acronyms and end stress and (b) vowel-final acronyms and the inflected word the vowel represents, the effect being that stress patterns for acronyms are linked to the inflected words they represent only if enough morphonological information about the acronym's segments is available to create familiarity effects. Otherwise, we find a tendency for speakers to prefer stress at stem edges. © 2015","authors":["Despina Papadopoulou","Anthi Revithiadou","Kalomoira Nikolou"],"meta":["January 2015Journal of Greek Linguistics 15(2):187-234","DOI:10.1163/15699846-01502003"],"references":["277874388_Plain_Morphology_and_Expressive_Morphology","274908899_Parasitic_Metrification_in_the_Modern_Hebrew_Stress_System","256279278_Some_notes_on_the_structure_of_acronyms","231965041_Dominance_effects_as_transderivational_anti-faithfulness","313011335_Greek_word_accent","313009952_Stress_in_Greek","285247094_Chapter_7_Colored_turbid_accents_and_containment_A_case_study_from_lexical_stress","284825748_Booij_Geert_The_Grammar_of_Words_An_Introduction_to_Linguistic_Morphology","271800789_On_Stress_and_Accent_in_Indo-European","265725950_Phonological_default_in_the_lexical_stress_system_of_Russian_Evidence_from_noun_declension","248129504_Towards_a_reconstruction_of_the_Indo-European_accent","240419744_Modern_Greek_accent_and_faithfulness_constraints_in_OT","228685947_Lexical_Exceptions_in_Stress_Systems_Arguments_from_Early_Language_Acquisition_and_Adult_Speech_Perception","227516518_Lexical_and_default_stress_assignment_in_reading_Greek"]}