{"id":"282612183_Collaborer_oui_mais_comment","abstract":"Dans leur introduction, M. Boudjaoui et B. Bourassa posent une question qui est au centre de cet ouvrage : qu’est-ce qu’une recherche collaborative ? Pour participer au débat qu’ils ont engagé, nous allons prendre appui sur une activité de recherche dont les résultats ont été publiés récemment et à laquelle nous avons participé (Leclercq et Varga, 2010). Cette recherche appelée Pratiques Collaboratives Distribuées d’Apprentissage sur Internet (PCDAI) visait à étudier l’impact des technologies numériques sur des activités de formation. Pour cela, il a fallu mettre en place un dispositif de recherche capable d’organiser la rencontre entre des technologies disponibles et des activités de formation. Dans cette contribution, nous nous efforcerons de dégager – à partir de cette expérience singulière –, les conditions qui prévalent à l’exercice d’une « recherche collaborative ». Nous entendons par là une recherche dans laquelle des acteurs aux horizons et aux perspectives différentes mettent en commun leurs compétences et travaillent ensemble sur un même projet pour innover. Nous constaterons que cette acception est apparentée à celle dont se réclament les travaux nord américains sur lesquels la plupart des textes de cet ouvrage prennent appui, mais qu’elle s’en écarte aussi, ouvrant une perspective de dialogue entre des paradigmes différents.","authors":["Gilles Leclercq","Renata Varga"],"meta":["January 2012","In book: Des recherches collaboratives en sciences humaines et sociales : enjeux, modalités et limites (pp.77-95)Edition: Québec, Presses de l'Université LavalEditors: B. Bourassa et M. Boudjaoui"],"references":["36380886_Utilite_utilisabilite_acceptabilite_interpreter_les_relations_entre_trois_dimensions_de_l'evaluation_des_EIAH","305389454_Institutional_Ecology_'Translations'_and_Boundary_Objects_Amateurs_and_Professionals_in_Berkeley's_Museum_of_Vertebrate_Zoology","281186245_L'activite_en_dialogue_entretiens_sur_l'activite_humaine_II","262008066_Institutional_Ecology_Translations'_and_Boundary_Objects_Amateurs_and_Professionals_in_Berkeley's_Museum_of_Vertebrate_Zoology_1907-39","235255598_Les_objets_intermediaires_dans_les_reseaux_de_cooperation_scientifique_Contribution_a_la_prise_en_compte_des_objets_dans_les_dynamiques_sociales"]}