{"id":"282687755_Formation_of_Professional_Competences_of_Primary_Education_Profile_Students_While_the_Studying_Process_at_the_University","abstract":"The relevance of this research is due to new approaches to higher vocational education, to the training of bachelors, specialists, students of primary education: from getting reproductive knowledge which is aimed to frontal forms of work with students, it is necessary a student-oriented approach, based on the ideas of personality-based semantic development priorities, regional experience personality, pedagogical support of individuality. The purpose of the article is to study and develop the science-based methods of professional competences formation among the undergraduate students of “Primary Education” profile, based on personality-centered approach, understanding the value of professional self-realization by students. A leading method of this problem study is a pedagogical experiment (ascertainment, formation and control stages) as well as the method of expert estimations, statistical processing of the quantitative results of the study. The main results of the research are the formation technique of professional competences of undergraduate students, based on personality-centered approach; the definition of the concept “professional-pedagogical competence”. Model of a student-centered approach to teaching professionals of primary education is characterized by the relationship of the motivational, organizational-planning, content-activity, reflexive-evaluation, communication-organizational components. Their severity degree determines the levels of students’ professional competencies (low, medium, high). Materials of this article may be useful for teachers of higher educational institutions by the application of this methodology of professional and pedagogical competences’ formation of students in the educational process at the University. © 2015, Canadian Center of Science and Education. All rights reserved.","authors":["Lera A. Kamalova"],"meta":["January 2015Review of European Studies 7(1):94-100","DOI:10.5539/res.v7n1p94"],"references":["265416221_The_Problems_of_Language_Personality_Formation_in_Russia_the_Analysis_of_Language_Processes_and_Pedagogical_Technologies","291288017_Paradigm_of_future_primary_school_teachers'_vocational_training","289318460_Multi-dimentional_classification_of_types_and_forms_of_corporate_education","287001229_Tutoring_of_pedagogical_activity_and_new_ideology_of_teacher_training_in_the_higher_education_institution","18482371_Testing_for_Competence_Rather_Than_Intelligence"]}