{"id":"282691810_Duality_of_codes_supported_on_regular_lattices_with_an_application_to_enumerative_combinatorics","abstract":"We construct a family of weight functions on finite abelian groups that yield\ninvertible MacWilliams identities for additive codes. The weights are obtained\ncomposing a suitable support map with the rank function of a graded lattice\nthat satisfies certain regularity properties. We express the Krawtchouk\ncoefficients of the corresponding MacWilliams transformation in terms of the\ncombinatorial invariants of the underlying lattice, and show that the most\nrelevant weight functions studied in coding theory belong, up to equivalence,\nto the class that we introduce. In particular, we compute some classical\nKrawtchouk coefficients employing a simple combinatorial method. Our approach\nalso allows to systematically construct weight functions that endow the\nunderlying group with a metric space structure. We establish a Singleton-like\nbound for additive codes, and call optimal the codes that attain the bound.\nThen we prove that the dual of an optimal code is optimal, and that the weight\ndistribution of an optimal code is completely determined by three fundamental\nparameters. Finally, we apply MacWilliams identities for the rank weight to\nenumerative combinatorics problems, computing the number of matrices of given\nrank over a finite field that satisfy certain linear conditions.","authors":["Alberto Ravagnani"],"meta":["September 2018Designs Codes and Cryptography 86(1)","DOI:10.1007/s10623-017-0436-3","SourcearXiv"],"references":["324629446_Orthogonal_Matrices_Over_Finite_Fields","316519164_Codes_over_Z_and_association_schemes","303679528_Orthogonal_matrices_over_finite_fields_Amer","276132492_Rank-metric_codes_and_their_duality_theory","267174562_Orthogonal_Matrices_Over_Finite_Fields","266916728_Transforms_and_Groups","265918080_Codes_and_association_schemes_Basic_properties_of_association_schemes_relevant_to_coding","265458700_Introduction_to_Coding_Theory","258819283_Fourier-Reflexive_Partitions_and_MacWilliams_Identities_for_Additive_Codes","248847589_On_Fourier_-_invariant_partitions_of_nite_abelian_groups_and_the_MacWilliams_identity_for_group_codes"]}