{"id":"282692413_Optimal_Fronthaul_Compression_for_Synchronization_in_the_Uplink_of_Cloud_Radio_Access_Networks","abstract":"A key problem in the design of cloud radio access networks (CRANs) is that of\ndevising effective baseband compression strategies for transmission on the\nfronthaul links connecting a remote radio head (RRH) to the managing central\nunit (CU). Most theoretical works on the subject implicitly assume that the\nRRHs, and hence the CU, are able to perfectly recover time synchronization from\nthe baseband signals received in the uplink, and focus on the compression of\nthe data fields. This paper instead dose not assume a priori synchronization of\nRRHs and CU, and considers the problem of fronthaul compression design at the\nRRHs with the aim of enhancing the performance of time and phase\nsynchronization at the CU. The problem is tackled by analyzing the impact of\nthe synchronization error on the performance of the link and by adopting\ninformation and estimationtheoretic performance metrics such as the\nrate-distortion function and the Cramer-Rao bound (CRB). The proposed algorithm\nis based on the Charnes-Cooper transformation and on the Difference of Convex\n(DC) approach, and is shown via numerical results to outperform conventional\nsolutions.","authors":["Eunhye Heo","Osvaldo Simeone","Hyuncheol Park"],"meta":["January 2017EURASIP Journal on Wireless Communications and Networking 2017(1)","DOI:10.1186/s13638-017-0804-8","SourcearXiv"],"references":["273706693_Cloud_RAN_for_Mobile_Networks-A_Technology_Overview","268424531_Downlink_macro-diversity_with_limited_backhaul_capacity","260343272_Shannon_Meets_Nyquist_Capacity_of_Sampled_Gaussian_Channels","339503042_Toeplitz_and_Circulant_Matrices_A_Review","281157593_On_the_Road_Towards_Green_Radio","273397094_Fronthaul_Compression_for_Cloud_Radio_Access_Networks_Signal_processing_advances_inspired_by_network_information_theory","266908024_Network_Information_Theory","264199200_Optimized_Backhaul_Compression_for_Uplink_Cloud_Radio_Access_Network","261522475_Baseband_signal_compression_in_wireless_base_stations","260657438_Compressed_Transport_of_Baseband_Signals_in_Radio_Access_Networks"]}