{"id":"282692690_MToS_a_Tree_of_Shapes_for_Multivariate_Images","abstract":"The topographic map of a gray-level image, also called tree of shapes, provides a high-level hierarchical representation of the image contents. This representation, invariant to contrast changes and to contrast inversion, has been proved very useful to achieve many image processing and pattern recognition tasks. Its definition relies on the total ordering of pixel values, so this representation does not exist for color images, or more generally, multivariate images. Common workarounds, such as marginal processing, or imposing a total order on data, are not satisfactory and yield many problems. This paper presents a method to build a tree-based representation of multivariate images, which features marginally the same properties of the gray-level tree of shapes. Briefly put, we do not impose an arbitrary ordering on values, but we only rely on the inclusion relationship between shapes in the image definition domain. The interest of having a contrast invariant and self-dual representation of multivariate image is illustrated through several applications (filtering, segmentation, and object recognition) on different types of data: color natural images, document images, satellite hyperspectral imaging, multimodal medical imaging, and videos.","authors":["Edwin Carlinet","Thierry Géraud"],"meta":["December 2015IEEE Transactions on Image Processing 24(12):5330-5342","DOI:10.1109/TIP.2015.2480599"],"references":["286569210_Speckle_spot_detection_in_ultrasound_images_Application_to_speckle_reduction_and_speckle_tracking","284182690_ICDAR2015_competition_on_smartphone_document_capture_and_OCR_SmartDoc","279830690_Efficient_Computation_of_Attributes_and_Saliency_Maps_on_Tree-Based_Image_Representations","312116180_Nonlocal_and_multivariate_mathematical_morphology","286572556_A_comparison_of_self-dual_attribute_profiles_based_on_different_filter_rules_for_classification","285689840_A_Morphological_Tree_of_Shapes_for_Color_Images","284895853_A_Color_Tree_of_Shapes_with_Illustrations_on_Filtering_Simplification_and_Segmentation","283097987_Getting_a_morphological_tree_of_shapes_for_multivariate_images_Paths_traps_and_pitfalls","282795726_A_first_parallel_algorithm_to_compute_the_morphological_tree_of_shapes_of_nD_images","282712657_Image_editing_using_level_set_trees"]}