{"id":"282672152_Impacts_of_anthropogenic_noise_on_marine_life_Publication_patterns_new_discoveries_and_future_directions_in_research_and_management","abstract":"Anthropogenic underwater noise is now recognized as a worldwide problem, and recent studies have shown a broad range of negative effects in a variety of taxa. Underwater noise from shipping is increasingly recognized as a significant and pervasive pollutant with the potential to impact marine ecosystems on a global scale. We reviewed six regional case studies as examples of recent research and management activities relating to ocean noise in a variety of taxonomic groups, locations, and approaches. However, as no six projects could ever cover all taxa, sites and noise sources, a brief bibliometric analysis places these case studies into the broader historical and topical context of the peer-reviewed ocean noise literature as a whole. The case studies highlighted emerging knowledge of impacts, including the ways that non-injurious effects can still accumulate at the population level, and detailed approaches to guide ocean noise management. They build a compelling case that a number of anthropogenic noise types can affect a variety of marine taxa. Meanwhile, the bibliometric analyses revealed an increasing diversity of ocean noise topics covered and journal outlets since the 1940s. This could be seen in terms of both the expansion of the literature from more physical interests to ecological impacts of noise, management and policy, and consideration of a widening range of taxa. However, if our scientific knowledge base is ever to get ahead of the curve of rapid industrialization of the ocean, we are going to have to identify naïve populations and relatively pristine seas, and construct mechanistic models, so that we can predict impacts before they occur, and guide effective mitigation for the most vulnerable populations.","authors":["Rob Williams","Andrew J Wright","Erin Ashe","Louise K Blight"],"meta":["October 2015Ocean & Coastal Management 115:17-24","DOI:10.1016/j.ocecoaman.2015.05.021","Projects: The impacts of underwater noise on cetaceansImpacts of anthropogenic noise and other disturbances on non-human animals"],"references":["284888499_Beyond_a_Simple_Effect_Variable_and_Changing_Responses_to_Anthropogenic_Noise","284888115_Aiming_for_Progress_in_Understanding_Underwater_Noise_Impact_on_Fish_Complementary_Need_for_Indoor_and_Outdoor_Studies","269936077_Measuring_acoustic_habitats","268821566_Quantifying_the_effect_of_boat_disturbance_on_bottlenose_dolphin_foraging_activity","266376497_In_Situ_Mortality_Experiments_with_Juvenile_Sea_Bass_Dicentrarchus_labrax_in_Relation_to_Impulsive_Sound_Levels_Caused_by_Pile_Driving_of_Windmill_Foundations","266138157_Chronic_playback_of_boat_noise_does_not_impact_hatching_success_or_post-hatching_larval_growth_and_survival_in_a_cichlid_fish","280697715_Calculating_limits_to_the_allowable_human-caused_mortality_of_cetaceans_and_pinnipeds","264872687_Structure_and_dynamics_of_the_Gulf_of_Maine_humpback_whale_population","264547020_Anthropogenic_noise_compromises_antipredator_behaviour_in_European_eels","264348308_Marine_mammals_and_ocean_noise_Future_directions_and_information_needs_with_respect_to_science_policy_and_law_in_Canada"]}