{"id":"282764710_Casual_Video_Games_as_Training_Tools_for_Attentional_Processes_in_Everyday_Life","abstract":"Three experiments examined the attentional components of the popular match-3 casual video game, Bejeweled Blitz (BJB). Attentionally demanding, BJB is highly popular among adults, particularly those in middle and later adulthood. In experiment 1, 54 older adults (Mage = 70.57) and 33 younger adults (Mage = 19.82) played 20 rounds of BJB, and completed online tasks measuring reaction time, simple visual search, and conjunction visual search. Prior experience significantly predicted BJB scores for younger adults, but for older adults, both prior experience and simple visual search task scores predicted BJB performance. Experiment 2 tested whether BJB practice alone would result in a carryover benefit to a visual search task in a sample of 58 young adults (Mage = 19.57) who completed 0, 10, or 30 rounds of BJB followed by a BJB-like visual search task with targets present or absent. Reaction times were significantly faster for participants who completed 30 but not 10 rounds of BJB compared with the search task only. This benefit was evident when targets were both present and absent, suggesting that playing BJB improves not only target detection, but also the ability to quit search effectively. Experiment 3 tested whether the attentional benefit in experiment 2 would apply to non-BJB stimuli. The results revealed a similar numerical but not significant trend. Taken together, the findings suggest there are benefits of casual video game playing to attention and relevant everyday skills, and that these games may have potential value as training tools.","authors":["Michael Stroud","Susan Krauss Whitbourne"],"meta":["October 2015Cyberpsychology, Behavior, and Social Networking 18(11)","DOI:10.1089/cyber.2015.0316"],"references":["275028737_A_randomized_controlled_trial_of_brain_training_with_non-action_video_games_in_older_adults_Results_of_the_3-month_follow-up","259768041_Cognitive_training_with_casual_video_games_Points_to_consider","228091955_Video_Games_and_Spatial_Cognition","227707178_Brain_Plasticity_Through_the_Life_Span_Learning_to_Learn_and_Action_Video_Games","51724496_Using_the_Dual-Target_Cost_to_Explore_the_Nature_of_Search_Target_Representations","46168990_Use_it_or_Lose_it_WII_Brain_Exercise_Practice_and_Reading_for_Domain_Knowledge","268296252_Why_is_it_Difficult_to_Search_for_Two_Colors_at_Once_How_Eye_Movements_Can_Reveal_the_Nature_of_Representations_During_Multi-target_Visual_Search","256098190_Reasons_for_Playing_Casual_Video_Games_and_Perceived_Benefits_Among_Adults_18_to_80_Years_Old","230843779_Attitudes_of_older_adults_toward_shooter_video_games_An_initial_study_to_select_an_acceptable_game_for_training_visual_processing","223795473_Do_individual_differences_in_speed_reflect_global_or_local_differences_in_mental_abilities"]}