{"id":"282726981_Phase_Transitions_in_Random_Dyadic_Tilings_and_Rectangular_Dissections","abstract":"We study rectangular dissections of an n × n lattice region into rectangles of area n, where n = 2k for an even integer k. We show that there is a natural edge-flipping Markov chain that connects the state space. A similar edge-flipping chain is also known to connect the state space when restricted to dyadic tilings, where each rectangle is required to have the form R = [s2u, (s + 1)2u] × [t2v, (t+1)2u], where s, t, u and v are nonnegative integers. The mixing time of these chains is open. We consider a weighted version of these Markov chains where, given a parameter λ > 0, we would like to generate each rectangular dissection (or dyadic tiling) a with probability proportional to λ|σ|, where |σ| is the total edge length. We show there is a phase transition in the dyadic setting: when λ < 1, the edge-flipping chain mixes in time O (n2 logn), and when λ > 1, the mixing time is exp (ω (n2)). Simulations suggest that the chain converges quickly when λ = 1, but this case remains open. The behavior for general rectangular dissections is more subtle, and even establishing ergodicity of the chain requires a careful inductive argument. As in the dyadic case, we show that the edge-flipping Markov chain for rectangular dissections requires exponential time when λ > 1. Surprisingly, the chain also requires exponential time when λ < 1, which we show using a different argument. Simulations suggest that the chain converges quickly at the isolated point λ = 1. Copyright","authors":["Sarah Cannon","Sarah Miracle","Dana Randall"],"meta":["October 2015","DOI:10.1137/1.9781611973730.104","Conference: SODA 2015"],"references":["233281516_Random_Lattice_Triangulations_Structure_and_Algorithms","220345221_Random_Dyadic_Tilings_of_the_Unit_Square","51917224_The_Phase_Transition_for_Dyadic_Tilings","3635366_Markov_chain_algorithms_for_planar_lattice_structures_SIAM","2309004_Analyzing_Glauber_Dynamics_by_Comparison_of_Markov_Chains","251295786_Alternating-Sign_Matrices_and_Domino_Tilings_Part_I","220190713_Dissecting_a_square_into_rectangles_of_equal_area","3698337_Mapping_from_sequence-pair_to_rectangular_dissection","2512387_Conformal_Invariance_of_Domino_Tiling","2098235_Mixing_times_of_Lozenge_tiling_and_card_shuffling_Markov_chains"]}