{"id":"282795111_Non-stationary_resonance_dynamics_of_a_nonlinear_sonic_vacuum_with_grounding_supports","abstract":"In a recent work [L.I. Manevitch, A.F.Vakakis, Nonlinear oscillatory acoustic vacuum, SIAM Journal of Applied Mathematics 74(6) (2014), 1742-1762] it was shown that a periodic chain of linearly coupled particles performing low-energy in-plane transverse oscillations behaves as a strongly nonlinear sonic vacuum (with corresponding speed of sound equal to zero). In this work we consider the grounded version of this system by coupling each particle to the ground through lateral springs in order to study the effect of the grounding stiffness on the strongly nonlinear dynamics. In that context we consider the simplest possible such system consisting of two coupled particles and present analytical and numerical studies of the non-stationary planar dynamics. The most significant limiting case corresponding to predominant low energy transversal excitations is considered by taking into account leading order geometric nonlinearities. Then we show that the grounded system behaves as a nonlinear sonic vacuum due to the purely cubic stiffness nonlinearities in the governing equations of motion and the complete absence of any linear stiffness terms. Under certain assumptions the nonlinear normal modes (i.e., the time-periodic nonlinear oscillations) in the configuration space of this system coincide with those of the corresponding linear one, so they obey the same orthogonality relations. Moreover, we analytically find that there are two transitions in the dynamics of this system, with the parameter governing these transitions being the relation between the lateral (grounding) and the interchain stiffnesses. The first transition concerns a bifurcation of one of the nonlinear normal modes (NNMs), whereas the second provides conditions for intense energy transfers and mixing between the NNMs. The drastic effects of these bifurcations on the non-stationary resonant dynamics are discussed. Specifically, the second transition relates to strongly non-stationary dynamics, and signifies the transition from intense energy exchanges between different particles of the system to energy localization on one of the particles. Both of these regimes, as well as transitions between them are adequately described in the frameworks of the new concept of Limiting Phase Trajectories (LPTs) corresponding to maximum possible energy exchanges between the oscillators. Hence, a further example is provided by a particle chain where geometric nonlinearities lead to the realization of a sonic vacuum.","authors":["I. P. Kikot’","L. I. Manevitch","Alexander F. Vakakis"],"meta":["November 2015Journal of Sound and Vibration 357:349-364","DOI:10.1016/j.jsv.2015.07.026"],"references":["49750774_Limiting_phase_trajectories_and_the_origin_of_energy_localization_in_nonlinear_oscillatory_chains","7175435_Tunability_of_solitary_wave_properties_in_one-dimensional_strongly_nonlinear_phononic_crystals","287657296_Nonlinear_normal_modes_in_vibration_theory","279400787_Complex_Representation_of_Dynamics_of_Coupled_Nonlinear_Oscillators","277679693_Nonlinear_Oscillatory_Acoustic_Vacuum","274874434_Dynamics_of_a_Linear_Oscillator_Coupled_to_a_Bistable_Light_Attachment_Numerical_Study","268764508_On_Nonlinear_Vibrations_of_Systems_with_Many_Degrees_of_Freedom","265530532_Normal_Modes_and_Localization_in_Nonlinear_Systems","260967449_On_intense_energy_exchange_and_localization_in_periodic_FPU_dimer_chains","258658179_Dynamics_of_an_Eccentric_Rotational_Nonlinear_Energy_Sink","245143182_The_calculation_of_strongly_non-linear_systems_close_to_vibration_impact_systems","243311638_Solitary_waves_in_the_granular_chain","232384847_Non-smooth_approximations_of_the_limiting_phase_trajectories_for_the_Duffing_oscillator_near_11_resonance","226234926_New_approach_to_beating_phenomenon_in_coupled_nonlinear_oscillatory_chains","225851432_Limiting_phase_trajectories_and_energy_exchange_between_anharmonic_oscillator_and_external_force"]}