{"id":"282708783_The_challenge_of_implementing_reverselogistics_in_social_improvement_The_possibility_of_expanding_sovereignty_food_in_developing_communities","abstract":"Hunger is a growing global phenomenon that needs access to more food andimproved distribution capabilities. The developing countries, suffer the scourge of multicausal origin, whose main symptom is a logistical problem of distribution. So the UN hassubmitted a hunger map in order to act more effectively. And other agencies such as FAOstudy the subject permanently. Moreover, about a third of the food produced in the worldannually for human consumption is lost or wasted. This also means the waste of nonrenewableresources and loss of value in the supply chain, capital dissipation ultimatelyincompatible with sustainable development in today's global community. Food Banks areentities that play the role of bridge between the companies that make the acquisition offood and people with dietary needs. These, redistribute food that is not marketable butstill fit for consumption. As logistics is a discipline that involves mental and behavioralchange perfectly adaptable and applicable to all activities of daily life, there is a growingneed to implement comprehensive logistic models, involving the supply chains ofcompanies. The flow of these must be planned intelligently and with such a strategy,which is the maximum utilization, resulting in the improvement of the environment, bothfrom the point of view of waste and environmental impact as the food itself. Themechanisms of reverse logistics, applied within the Corporate Social Responsibility in the private field, could facilitate donations of products returned by customers for variousreasons and these be leveraged to alleviate hunger. This implies a logistical ethics basedchallenge in solving problems such as hunger, because it is not enough to feed thepopulation; we must nurture them properly, so that people realize their full potential toenable them to access to education, in pursuit of personal and social autonomy. Apply theconcepts of reverse logistics, to social level, business, governmental and assistantsorganizations of socially disadvantaged, allows social improvement. A case of successfulexperience in the implementation of reverse logistics is the Food Bank of Mendoza,Argentina, which is presented as a case study.","authors":["M. Maldonado","S. Moya"],"meta":["April 2013"],"references":["288534731_Warehousing_management_Return_to_sender","237216363_Reverse_Logistics_Process_Reengineering_Improving_Customer_Service_Quality"]}