{"id":"282763469_Quality_versus_quantity_in_scientific_impact","abstract":"Citation metrics are becoming pervasive in the quantitative evaluation of scholars, journals, and institutions. Hiring, promotion, and funding decisions increasingly rely on a variety of impact metrics that cannot disentangle quality from quantity of scientific output, and are biased by factors such as discipline and academic age. Biases affecting the evaluation of single papers are compounded when one aggregates citation-based metrics across an entire publication record. It is not trivial to compare the quality of two scholars that during their careers have published at different rates, in different disciplines, and in different periods of time. Here we evaluate a method based on the generation of a statistical baseline specifically tailored on the academic profile of each researcher. We demonstrate the effectiveness of the approach in decoupling the roles of quantity and quality of publications to explain how a certain level of impact is achieved. The method can be extended to simultaneously suppress any source of bias. As an illustration, we use it to capture the quality of the work of Nobel laureates irrespective of number of publications, academic age, and discipline, even when traditional metrics indicate low impact in absolute terms. The procedure is flexible enough to allow for the evaluation of, and fair comparison among, arbitrary collections of papers - scholar publication records, journals, and institutions; in fact, it extends a similar technique that was previously applied to the ranking of research units and countries in specific disciplines (Crespo, Ortuño-Ortí, & Ruiz-Castillo, 2012). We further apply the methodology to almost a million scholars and over six thousand journals to measure the impact that cannot be explained by the volume of publications alone.","authors":["Jasleen Kaur","Emilio Ferrara","Filippo Menczer","Alessandro Flammini"],"meta":["October 2015Journal of Informetrics 9(4):800-808","DOI:10.1016/j.joi.2015.07.008"],"references":["301233136_Diffusion_of_scientific_credits_and_the_ranking_of_scientists","236946558_Universality_of_scholarly_impact_metrics","236921379_Impact_Factor_Distortions","234143280_Social_Dynamics_of_Science","277334799_Defining_and_identifying_Sleeping_Beauties_in_science","271867831_The_Academic_Ranking_of_World_Universities","269558077_Statistics_of_Extremes","267456052_The_skewness_of_scientific_productivity","257663393_Analysis_of_bibliometric_indicators_for_individual_scholars_in_a_large_data_set","242376725_EDITORIAL_To_share_the_fame_in_a_fair_way_hm_modifies_h_for_multi-authored_manuscripts","233950141_The_Possible_Role_of_Resource_Requirements_and_Academic_Career-Choice_Risk_on_Gender_Differences_in_Publication_Rate_and_Impact","233419450_The_Citation_Merit_of_Scientific_Publications","232248204_Flows_of_Research_Manuscripts_Among_Scientific_Journals_Reveal_Hidden_Submission_Patterns","223961082_A_Reverse_Engineering_Approach_to_the_Suppression_of_Citation_Biases_Reveals_Universal_Properties_of_Citation_Distributions","222580921_Towards_a_new_crown_indicator_Some_theoretical_considerations"]}