{"id":"282776656_Prior's_tonk_notions_of_logic_and_levels_of_inconsistency_vindicating_the_pluralistic_unity_of_science_in_the_light_of_categorical_logical_positivism","abstract":"There are still on-going debates on what exactly is wrong with Prior’s pathological “tonk.” In this article I argue, on the basis of categorical inferentialism, that (i) two notions of inconsistency ought to be distinguished in an appropriate account of tonk; (ii) logic with tonk is inconsistent as the theory of propositions, and it is due to the fallacy of equivocation; (iii) in contrast to this diagnosis of the Prior’s tonk problem, nothing is actually wrong with tonk if logic is viewed as the theory of proofs rather than propositions, and tonk perfectly makes sense in terms of the identity of proofs. Indeed, there is fully complete semantics of proofs for tonk, which allows us to link the Prior’s old philosophical idea with contemporary issues at the interface of categorical logic, computer science, and quantum physics, and thereby to expose commonalities between the laws of Reason and the laws of Nature, which are what logic and physics are respectively about. I conclude the article by articulating the ideas of categorical logical positivism and pluralistic unified science as its goal, including the unification of realist and antirealist conceptions of meaning by virtue of the categorical logical basis of metaphysics.","authors":["Yoshihiro Maruyama"],"meta":["November 2016Synthese 193(11)","DOI:10.1007/s11229-015-0932-9"],"references":["300332570_Categorical_Harmony_and_Paradoxes_in_Proof-Theoretic_Semantics","334006564_Articulating_Reasons_An_Introduction_to_Inferentialism","324429374_Articulating_Reasons_An_Introduction_to_Inferentialism","319394252_Introduction_to_Higher-Order_Categorical_Logic","265424019_An_Introduction_to_Higher_Order_Categorical_Logic","257669959_Proof-Theoretic_Semantics_Self-Contradiction_and_the_Format_of_Deductive_Reasoning","247935517_Paraconsistent_Logic","243765437_Advances_in_Linear_Logic","243698981_The_correspondence_between_cut-elimination_and_normalization_II","229750289_Adjointness_in_Foundations","31407899_Tonk_Plonk_and_Plink","227022348_What's_Wrong_with_Tonk","225831834_Introduction_to_Categories_and_Categorical_Logic","31469046_The_Runabout_Inference-Ticket","1745898_Categorical_Quantum_Mechanics"]}