{"id":"282819660_CAMED_An_innovative_communication_tool_in_teaching_engineering_drawing","abstract":"Technical drawing is an important basic communication tool in engineering drawing. Besides student ability, teaching strategy also plays a prominent role in enhancing student's learning. This paper aims to discuss students and teachers perception on an innovative teaching method? of engineering drawing subject at secondary school level. The strategy employs Computer Animated Module for Engineering Drawing (CAMED) which was developed based on constructivism and cognitive load learning theories. Furthermore the effectiveness of the module on student's achievement, conceptual understanding and problem solving skills is also discussed. A quasi experimental method was employed on 110 students in the treatment group and 109 students for control group respectively. There were five teachers involved in giving feedback on the module. The result revealed that both students and teachers have very positive view on this innovative way of teaching and learning. In addition, the results also show better achievement, understanding of the concepts and knowledge on problem solving among treatment group students as compared to the control group. It indicates that the application of animation is an effective way to help teacher's teaching and enhancing student's learning. Therefore it is suggested that more of such module should be developed for other topics.","authors":["Lilia Halim","R.M. Yasin","A. Ishar"],"meta":["February 2012WSEAS Transactions on Information Science and Applications 9(2):58-67"],"references":["289416879_The_development_and_evaluation_of_thermodynamics_multimedia_software_for_post_secondary_engineering_students","277433812_Using_Demonstration_Assessments_to_Improve_Learning","227959236_The_effect_of_animation_on_comprehension_and_interest","225115576_Learning_Using_Dynamic_and_Static_Visualizations_Students'_Comprehension_Prior_Knowledge_and_Conceptual_Status_of_a_Biotechnological_Method","220428111_Empirical_comparisons_of_animation_and_narration_in_requirements_validation"]}