{"id":"282829924_Joint_Power_Control_and_Rate_Adaptation_for_Video_Streaming_in_Wireless_Networks_With_Time-Varying_Interference","abstract":"This paper considers a cross-layer optimization framework for video streaming in multi-node wireless networks\nwith time-varying interference environment. We develop a distributed joint power control and rate adaptation framework that exploits the time diversity of the wireless channels, satisfies the hard delay constraints associated to video applications, and respects a certain fairness criterion among the nodes. The proposed framework performs power allocation at the PHY/MAC layers to achieve a certain target SINR such that the difference\nbetween the arrival and the departure rates at the queues is very small, and performs video rate adaptation at the video coding layer (upper layer) according to the nodes’ demanded video quality, their channel conditions, and a given fairness criterion. A main challenge here is that the adaptation of the video rate and the power control are not performed at the same time scale. We deal with this issue and model the power and the rate variations of the nodes as linear stochastic dynamic equations, and formulate a risk-sensitive control problem that\ncaptures the hard delay constraints of the video services, and the fairness criterion for resources utilization. We provide optimal solution to this control problem, and illustrate the performance of our framework through simulations.","authors":["Ayaz Ahmad","Naveed UL Hassan","Mohamad Assaad","Hamidou Tembine"],"meta":["September 2015IEEE Transactions on Vehicular Technology 65(8)","DOI:10.1109/TVT.2015.2480785"],"references":["304559304_Statistical_Power_Sum_Analysis_for_Nonidentically_Distributed_Correlated_Lognormal_Signals","316823963_Principles_of_Mobile_Communication","281769688_Cross-Layer_Framework_for_QoS_Support_in_Wireless_Multimedia_Sensor_Networks","275061355_Resource_Allocation_and_Performance_Analysis_for_Multiuser_Video_Transmission_Over_Doubly_Selective_Channels","273393505_Video_Transmission_Over_Lossy_Wireless_Networks_A_Cross-Layer_Perspective","261417594_Dependency-aware_quality-differentiated_wireless_video_multicast","261378870_Cross-layer_scheduling_for_multi-quality_video_streaming_in_cellular_wireless_networks","260635484_Energy-Spectrum_Efficiency_Tradeoff_for_Video_Streaming_over_Mobile_Ad_Hoc_Networks","260353106_Jointly_Optimal_Rate_Control_and_Relay_Selection_for_Cooperative_Wireless_Video_Streaming","260353002_Distortion-Aware_Scalable_Video_Streaming_to_Multinetwork_Clients"]}