{"id":"282815017_Structure_of_triadic_relations_in_multiplex_networks","abstract":"Recent advances in the study of networked systems have highlighted that our interconnected world is composed of networks that are coupled to each other through different 'layers' that each represent one of many possible subsystems or types of interactions. Nevertheless, it is traditional to aggregate multilayer networks into a single weighted network in order to take advantage of existing tools. This is admittedly convenient, but it is also extremely problematic, as important information can be lost as a result. It is therefore important to develop multilayer generalizations of network concepts. In this paper, we analyze triadic relations and generalize the idea of transitivity to multiplex networks. By focusing on triadic relations, which yield the simplest type of transitivity, we generalize the concept and computation of clustering coefficients to multiplex networks. We show how the layered structure of such networks introduces a new degree of freedom that has a fundamental effect on transitivity. We compute multiplex clustering coefficients for several real multiplex networks and illustrate why one must take great care when generalizing standard network concepts to multiplex networks. We also derive analytical expressions for our clustering coefficients for ensemble averages of networks in a family of random multiplex networks. Our analysis illustrates that social networks have a strong tendency to promote redundancy by closing triads at every layer and that they thereby have a different type of multiplex transitivity from transportation networks, which do not exhibit such a tendency. These insights are invisible if one only studies aggregated networks. © 2015 IOP Publishing Ltd and Deutsche Physikalische Gesellschaft.","authors":["Emanuele Cozzo","Mikko Kivelä","Manlio De Domenico","Albert Solé-Ribalta"],"meta":["July 2015New Journal of Physics 17(7):073029","DOI:10.1088/1367-2630/17/7/073029"],"references":["275359239_Ranking_in_interconnected_multilayer_networks_reveals_versatile_nodes","270730281_Multiplexity_in_Adult_Friendships","267874024_Anatomy_and_efficiency_of_urban_multimodal_mobility","262939868_Navigability_of_interconnected_networks_under_random_failures","261732150_Structural_measures_for_multiplex_networks","258351349_Multiplex_PageRank","257460322_Dynamical_Interplay_between_Awareness_and_Epidemic_Spreading_in_Multiplex_Networks","268817412_The_Structure_and_Dynamics_of_Multilayer_Networks","264920260_Networks_An_Introduction","263908479_HYPERSTRUCTURES_A_NEW_APPROACH_TO_COMPLEX_SYSTEMS"]}