{"id":"282893445_Enhancing_the_measurement_of_information_technology_IT_business_alignment_and_its_influence_on_company_performance","abstract":"Studies for over 30 years have consistently indicated that enterprise-level Business-Information Technology (IT) alignment is a pervasive problem. While significant progress has been made to understand alignment, research on IT alignment is still plagued by several problems. First, most alignment models approach alignment as a static relationship in contrast to analyzing the scope and variance of activities through which the alignment is (or can be) attained. Second, most alignment models are not founded on strong theoretical foundations. Third, because of their static view, these models do not guide how organizations can improve alignment. This study addresses these weaknesses using a capability-based lens. It formulates and operationalizes a formative construct rooted in the theory of dynamic capabilities and defines the scope and nature of activities that contribute to alignment. The construct identifies six dimensions promoting alignment: (1) IT-Business Communications ; (2) Use of Value Analytics; (3) Approaches to Collaborative Governance; (4) Nature of the affiliation/partnership; (5) Scope of IT initiatives; and (6) Development of IT Skills. The construct measures are validated in terms of their dimensionality, item pool sampling, and the nomological and predictive validity. The research uses Partial Least Squares (PLS) to statistically validate the construct using a dataset covering over 3000 global participants including nearly 400 Fortune 1000 companies. All construct dimensions contribute significantly to the level of alignment and the construct shows strong nomological and predictive validity by demonstrating a statistically significant impact on firm performance. Scholars can leverage this research to explore additional activity-based constructs of IT-business alignment.","authors":["Jerry N. Luftman","Kalle Lyytinen","Tal ben Zvi"],"meta":["September 2015Journal of Information Technology 32(1)","DOI:10.1057/jit.2015.23"],"references":["311644620_Structural_equation_modeling_and_regression_guidelines_for_research_practice","344922519_An_Introduction_to_Structural_Equation_Modeling_SEM_and_the_Partial_Least_Squares_PLS_Methodology","341930125_Dynamic_capabilities_what_are_they","319332302_Dynamic_capabilities_what_are_they","303919046_Principles_and_Practice_of_Structural_Equation_Modeling","302561367_The_Concept_of_Fit_in_Strategy_Research_Toward_Verbal_and_Statistical_Correspondence","297622131_Dynamic_Capabilities_What_are_they","288254859_Multivariate_data_analysis_Prentice_Hall","286121220_The_Stable_Roe_Portfolio_An_Alternative_Equity_Index_Strategy_Based_on_Common_Sense_Security_Analysis","285831640_Interweaving_business-driven_IT_strategy_and_execution_Four_foundation_factors"]}