{"id":"282844327_On_1-Laplacian_Elliptic_Equations_Modeling_Magnetic_Resonance_Image_Rician_Denoising","abstract":"Modeling magnitude Magnetic Resonance Images (MRI) rician denoising in a\nBayesian or generalized Tikhonov framework using Total Variation (TV) leads\nnaturally to the consideration of nonlinear elliptic equations. These involve\nthe so called $1$-Laplacian operator and special care is needed to properly\nformulate the problem. The rician statistics of the data are introduced through\na singular equation with a reaction term defined in terms of modified first\norder Bessel functions. An existence theory is provided here together with\nother qualitative properties of the solutions. Remarkably, each positive global\nminimum of the associated functional is one of such solutions. Moreover, we\ndirectly solve this non--smooth non--convex minimization problem using a\nconvergent Proximal Point Algorithm. Numerical results based on synthetic and\nreal MRI demonstrate a better performance of the proposed method when compared\nto previous TV based models for rician denoising which regularize or convexify\nthe problem. Finally, an application on real Diffusion Tensor Images, a\nstrongly affected by rician noise MRI modality, is presented and discussed.","authors":["Adrian Martin","Emanuele Schiavi","S. Segura de León"],"meta":["February 2017Journal of Mathematical Imaging and Vision 57(2)","DOI:10.1007/s10851-016-0675-3","SourcearXiv"],"references":["277075718_Iterated_Rician_Denoising","320387192_A_Treatise_on_the_Theory_of_Bessel_Functions","312771295_Image_quality_assessment_From_error_visibility_to_structural_similarity","301822646_The_Split_Bregman_method_for_L1_regularized_problems","278282637_An_algorithm_for_total_variation_minimization_and_applications","269633959_The_Split_Bregman_method_for_L1-egularized_problems","269577973_A_Convex_Variational_Model_for_Restoring_Blurred_Images_with_Large_Rician_Noise","268309601_From_p-Laplace_to_mean_curvature_operator_and_related_questions","267707400_A_pointwise_characterization_of_the_subdifferential_of_the_total_variation_functional","266705915_Minimal_Surfaces_and_Functions_of_Bounded_Variation"]}