{"id":"282816896_The_Virtual_University","abstract":"The 'virtual university' is becoming a commonplace idea or trope. In this book, we aim to explore both the concept and the practice of the 'virtual university'. Our exploration will be a critical one, hence the insertion of the question mark into our title—the 'virtual university?'. Here, at the outset of our discussion, it will be useful to signal two particularly significant issues that must be addressed. The first concerns the importance of distinguishing between futurological predictions about the 'virtual university', on the one hand, and the more complex situation of what is actually happening in higher education, on the other. We need, that is to say, to separate the myths and ideologies that are proliferating about the 'university of the future' from changing realities and practices in actual universities now, in the present. The second issue concerns the problem of the narrow and restrictive technological bias that distinguishes most accounts of the 'virtual university'. The basic assumption is that the 'virtual university' is the outcome and consequence of a new technological revolution, and that we may start and end our discussion of contemporary transformations in higher education with the question of new digital or virtual technologies. A principal aim of this volume is to counter the futurological and technological biases in the debate on the meaning and significance of the 'virtual university'. The contributors to this collection are all concerned with the contemporary realities of change in universities in different parts of the world. And they all go beyond technological reductionism, in order to address the broader economic , social, and political dynamics that have been bringing about change in","authors":["Kevin Robins","Frank Webster"],"meta":["January 2003"],"references":["313795266_Mass_Higher_Education","328569379_Podcast_as_a_Learning_Media_in_Higher_Education","283631489_New_accountabilities_Anthropological_studies_in_audit_ethics_and_the_academy","274553420_The_Closing_of_the_American_Mind_How_Higher_Education_Has_Failed_Democracy_and_Impoverished_the_Souls_of_Today's_Students","274183774_The_Postmodern_Condition_A_Report_on_Knowledge","273087454_Higher_Education_Revisited","271086843_Cultivating_Humanity_A_Classical_Defense_of_Reform_in_Liberal_Education","270738631_The_University_in_Ruins","265710395_'The_University'_Is_Theory_Universities_Are_Facts","249004725_The_Decline_of_Donnish_Dominion"]}