{"id":"282836533_Challenges_Face_Arab_Students_in_Writing_Well-Developed_Paragraphs_in_English","abstract":"This study aimed to investigate problems facing Palestinian Arab students from Israel who are majoring in teaching English as a Foreign Language (EFL) in developing well-written paragraphs in English. They usually transfer the stylistic features of their first language, Arabic to the target language, English. For example, they tend to write long sentences with coordinating conjunctions (Al-Khatib, 2001), repeat themselves and argue through presentation and elaboration (Almehmadi, 2013), and often talk around the topic and repeat phrases before stating the main points (Alsamadani, 2010). The data had been accumulated for the last fourteen years include samples of 205 students, which show similar repeated types of mistakes and errors made by the participants of the first year writing course. The accumulated data show that students face many problems in writing good topic as well as concluding sentences, supporting details by adding examples and reasons and using discourse markers appropriately. To help these learners write good samples of paragraphs in English, a variety of approaches such as contrastive analysis, error analysis, and the process approach have been employed. The findings indicated that by the end of their first school year, most of them succeed in writing topic and concluding sentences. However, (1) providing supporting details including examples and reasons is not fully mastered; (2) the style of English is not completely acquired: Some students continue transferring the style of Arabic writing; and (3) developing a cohesive paragraph using the right coordinators and transition words still needs a lot of practice.","authors":["Ruwaida Abu Rass"],"meta":["September 2015English Language Teaching 8(10)","DOI:10.5539/elt.v8n10p49"],"references":["313007356_Instructed_second_language_acquisition_Introduction","311854673_The_Effect_of_EFL_Learners'_Mother_Tongue_on_their_Writings_in_English_An_Error_Analysis_Study","310796961_Researching_Types_and_Causes_of_Errors_in_Arabic_Speakers'_Writing","266291409_Students'_Problems_with_Cohesion_and_Coherence_in_EFL_Essay_Writing_in_Egypt_Different_Perspectives","261961111_Collocation_errors_made_by_Arab_learners_of_English","302445195_Presentation_as_proof_the_language_of_Arabic_rhetoric","287583981_The_development_of_second_and_foreign_language_learning_through_classroom_interaction","287484835_The_relationship_between_Saudi_EFL_students'_writing_competence_L1_writing_proficiency_and_self-regulation","272849239_Routledge_Encyclopedia_of_Language_Teaching_and_Learning","266416024_Use_of_Discourse_Markers_in_the_Composition_Writings_of_Arab_EFL_Learners"]}