{"id":"282865562_Wait-Free_Gathering_Without_Chirality","abstract":"We consider the problem of gathering n autonomous robots that evolve in a 2-dimensional Euclidian space at a single location, not known beforehand. We suppose the robots operate in the semi-synchronous Look-Compute-Move model and are anonymous, oblivious, and disoriented.\nWhen robots are capable of strong multiplicity detection (that is, sensing the number of robots at a given location) and the initial configuration is not bivalent, the problem is known to be deterministically solvable for n > 2 robots. When an arbitrary number f < n of robots may crash, recent results achieve deterministic gathering of correct robots in the classical model, assuming robots agree on a global common chirality (that is all robots have the same notion of left and right), leaving open the necessity of this assumption.\nIn this paper, we answer negatively to this question. Our approach is constructive: we present a deterministic gathering algorithm that admits an arbitrary number of crashes and gathers all correct robots even if they do not have a common chirality.","authors":["Bramas Quentin","Sebastien Tixeuil"],"meta":["July 2015","DOI:10.1007/978-3-319-25258-2_22","Conference: International Colloquium on Structural Information and Communication Complexity"],"references":["220617481_Fault-Tolerant_Gathering_Algorithms_for_Autonomous_Mobile_Robots","51952362_The_Gathering_Problem_for_Two_Oblivious_Robots_with_Unreliable_Compasses","314613164_Fault-Tolerant_Gathering_of_Asynchronous_Oblivious_Mobile_Robots_under_One-Axis_Agreement","284069266_Fault-tolerant_gathering_of_asynchronous_oblivious_mobile_robots_under_one-axis_agreement","274281447_Distributed_Computing_by_Oblivious_Mobile_Robots","262604422_Impossibility_of_Gathering_a_Certification","261245274_Gathering_of_Mobile_Robots_Tolerating_Multiple_Crash_Faults","257144796_Self-stabilizing_gathering_with_strong_multiplicity_detection","220616615_Distributed_Anonymous_Mobile_Robots_Formation_of_Geometric_Patterns"]}