{"id":"282923201_State_policy_couple_dynamics_in_evolutionary_games","abstract":"Standard Evolutionary Game framework is a useful tool to study large interacting systems and to understand the strategic behavior of individuals in such complex systems. Adding an individual state to model local feature of each player in this context, allows one to study a wider range of problems in various application areas as networking, biology, etc. In this paper, we introduce such an extension of evolutionary game framework and particularly, we focus on the dynamical aspects of this system. Precisely, we study the coupled dynamics of the strategies and the individual states inside a population of interacting individuals. We consider here a two strategies evolutionary game. We first obtain a system of combined dynamics and we show that the rest-points of this system are equilibria of our evolutionary game with individual state. Second, by assuming two different time scales between states and strategy dynamics, we can compute explicitly the equilibria. Then, by transforming our evolutionary game with individual states into a standard evolutionary game, we obtain an equilibrium which is equivalent, in terms of occupation measure, to the previous one. All our results are illustrated with numerical results.","authors":["Ilaria Brunetti","Yezekael Hayel","Eitan Altman"],"meta":["July 2015Proceedings of the American Control Conference 2015:1758-1763","DOI:10.1109/ACC.2015.7170987"],"references":["315483217_A_Stochastic_Evolutionary_Game_of_Energy_Management_in_a_Distributed_Aloha_Network","267665580_Evolutionary_Game_Dynamics","267078790_Stochastic_approximation_A_dynamical_systems_viewpoint","265438572_Singular_perturbation_methods_in_control_Analysis_and_design","258864484_The_Logic_of_Animal_Conflict","243767969_Evolutionary_Stable_Strategies_and_Game_Dynamics","236034691_Evolutionary_Stochastic_Games","224311515_A_Stochastic_Evolutionary_Game_of_Energy_Management_in_a_Distributed_Aloha_Network","224113744_Markov_Decision_Evolutionary_Games","24058389_Evolutionary_Selection_Dynamics_in_Games_Convergence_and_Limit_Properties","23744356_A_Survey_of_Models_of_Network_Formation_Stability_and_Efficiency","22605678_A_Note_on_Evolutionary_Stable_Strategies_and_Game_Dynamics"]}