{"id":"282944892_PDBe_Improved_accessibility_of_macromolecular_structure_data_from_PDB_and_EMDB","abstract":"The Protein Data Bank in Europe (http://pdbe.org) accepts and annotates depositions of macromolecular structure data in the PDB and EMDB archives and enriches, integrates\nand disseminates structural information in a variety of ways. The PDBe website has been redesigned based on an analysis of\nuser requirements, and now offers intuitive access to improved and value-added macromolecular structure information. Unique\nvalue-added information includes lists of reviews and research articles that cite or mention PDB entries as well as access\nto figures and legends from full-text open-access publications that describe PDB entries. A powerful new query system not\nonly shows all the PDB entries that match a given query, but also shows the ‘best structures’ for a given macromolecule, ligand\ncomplex or sequence family using data-quality information from the wwPDB validation reports. A PDBe RESTful API has been developed\nto provide unified access to macromolecular structure data available in the PDB and EMDB archives as well as value-added annotations,\ne.g. regarding structure quality and up-to-date cross-reference information from the SIFTS resource. Taken together, these\nnew developments facilitate unified access to macromolecular structure data in an intuitive way for non-expert users and support\nexpert users in analysing macromolecular structure data.","authors":["Sameer Velankar","Glen van Ginkel","Younes Alhroub","Gary M Battle"],"meta":["October 2015Nucleic Acids Research 44(Database issue)","DOI:10.1093/nar/gkv1047"],"references":["278390854_UniProt_A_hub_for_protein_information","269414418_Achievements_and_challenges_in_structural_bioinformatics_and_computational_biophysics","268881281_The_InterPro_protein_families_database_The_classification_resource_after_15_years","268873185_The_RCSB_Protein_Data_Bank_Views_of_structural_biology_for_basic_and_applied_research_and_education","313137884_Pfam_the_protein_families_database","292000646_UniProt_A_hub_for_protein_information","291765296_UCSF_Chimera-A_visualization_system_for_exploratory_research_and_analysis","286435192_The_Worldwide_Protein_Data_Bank","284421180_LIGPLOT_A_program_to_generate_schematic_diagrams_of_protein-ligand_interactions","281260801_Advances_in_ComputationalStructure-Based_Drug_Design_and_Application_in_Drug_Discovery"]}