{"id":"282963924_A_survey_on_the_use_of_topic_models_when_mining_software_repositories","abstract":"Researchers in software engineering have attempted to improve software development by mining and analyzing software repositories. Since the majority of the software engineering data is unstructured, researchers have applied Information Retrieval (IR) techniques to help software development. The recent advances of IR, especially statistical topic models, have helped make sense of unstructured data in software repositories even more. However, even though there are hundreds of studies on applying topic models to software repositories, there is no study that shows how the models are used in the software engineering research community, and which software engineering tasks are being supported through topic models. Moreover, since the performance of these topic models is directly related to the model parameters and usage, knowing how researchers use the topic models may also help future studies make optimal use of such models. Thus, we surveyed 167 articles from the software engineering literature that make use of topic models. We find that i) most studies centre around a limited number of software engineering tasks; ii) most studies use only basic topic models; iii) and researchers usually treat topic models as black boxes without fully exploring their underlying assumptions and parameter values. Our paper provides a starting point for new researchers who are interested in using topic models, and may help new researchers and practitioners determine how to best apply topic models to a particular software engineering task.","authors":["Tse-Hsun Peter Chen","Stephen W. Thomas","Ahmed E. Hassan"],"meta":["September 2015Empirical Software Engineering 21(5)","DOI:10.1007/s10664-015-9402-8"],"references":["324359976_Understanding_the_Limiting_Factors_of_Topic_Modeling_via_Posterior_Contraction_Analysis","316921877_Where_should_the_bugs_be_fixed_More_accurate_information_retrieval-based_bug_localization_based_on_bug_reports","336573400_Systematic_Mapping_Studies_in_Software_Engineering","316921797_Where_should_the_bugs_be_fixed-more_accurate_information_retrieval-based_bug_localization_based_on_bug_reports","313632165_Advancing_candidate_link_generation_for_requirements_tracing_The_study_of_methods","312210566_Principal_Component_Analysis","310589501_Analysis_of_user_comments_An_approach_for_software_requirements_evolution","308161218_Introduction_to_information_retrieval_chapt","303802749_Indexing_by_Latent_Semantic_Analysis","301704904_On_the_naturalness_of_software"]}