{"id":"282952325_Parallel_Low-Complexity_Lossless_Coding_of_Three-Dimensional_Medical_Images","abstract":"Digital medical images are becoming even more widespread and used in a large variety of applications. Such images are often stored in local repositories and need to be transmitted/received over the network. Therefore, data compression is an essential mechanism to adopt for improving the transmission time, as well as to optimize the required storage space. However, due to the clinical relevance of such data, lossless techniques are almost ever preferred, given that in such context it is not tolerated any loss of data. In this work, starting from the Medical Images Lossless Compression (MILC) algorithm, which enables the efficient coding of three-dimensional medical images achieving results comparable with the other state-of-art algorithms, we propose Parallel MILC, a fully parallelized version of that algorithm, which provides some attractive features with respect to MILC, especially in terms of execution speedup and scalability. In detail, we propose a novel design and implementation for the MILC algorithm, which is able to exploit the power and the capabilities of the parallel computing paradigm. It is important to point out that Parallel MILC can be executed on several heterogeneous device types supporting OpenCL (i.e. CPU, GPU, FPGA, etc.). The preliminary test results show a significant performance speedup of Parallel MILC compared to MILC. Consequently, the novel algorithm we propose provides MILC with strong scalability properties and complete transparency with respect the underlying hardware.","authors":["Raffaele Pizzolante","Aniello Castiglione","Bruno Carpentieri","Alfredo De Santis"],"meta":["January 2015","DOI:10.1109/NBiS.2014.107"],"references":["265976764_Visualization_Band_Ordering_and_Compression_of_Hyperspectral_Images","47636665_OpenCL_A_Parallel_Programming_Standard_for_Heterogeneous_Computing_Systems","261495914_Lossless_low-complexity_compression_of_three-dimensional_volumetric_medical_images_via_linear_prediction","261481946_A_Secure_Low_Complexity_Approach_for_Compression_and_Transmission_of_3-D_Medical_Images","220689967_Handbook_of_Data_Compression_5_ed","3946220_PPM_One_step_to_practicality","2985781_Lossless_Compression_of_Continuous-Tone_Images"]}