{"id":"283042129_Using_Social_Networks_Facebook_Usage_at_the_Riau_College_Students","abstract":"According to the official report release by facebook through the site http://www.checkfacebook.com/, as of March 1, 2013, the number of facebook users in Indonesia is 47.165.080 million. In terms of the age, the composition of the majority of facebook users is dominated by age 18-24 years with the number of users is 20.197.820 million (42,82%) of total users, where this age is the age of the students in the college. With the number of users is increasing from year to year and it is dominated by age students, encourage the researchers to conduct an empirical study on the use of facebook among students. The purposes of this study is to analyze and explore the use of facebook among students; why, how much, and how students use facebook and the potential educational value of facebook. Researchers release online survey that consists of 30 questions in a questionnaire. A total of 329 respondents from 2 colleges in Riau has given feedback. Finding shows that most of the students have a facebook account before entering the college (95.14%) and spend time less than 1hours per day (45.59%) and logged onto the facebook site several times per day. Furthermore, facebook provides positive benefits in an educational environment, particularly, simplify in information sharing as well as file sharing within the group.","authors":["Erlin Erlin","Triyani Arita Fitri","Susandri Susandri"],"meta":["December 2015Procedia Computer Science 59:559-566","DOI:10.1016/j.procs.2015.07.543"],"references":["262219701_Review_Students'_and_teachers'_use_of_Facebook","284756950_Explaining_why_young_adults_use_MySpace_and_Facebook_through_uses_and_gratifications_theory","265210265_Privicy_in_Social_Networks_An_Analysis_of_Facebook","262570866_Facebook_as_a_method_to_promote_a_mindset_of_continual_learning_in_an_ambulatory_care_pharmacy_elective_course","260027305_Analysis_of_the_psychological_traits_Facebook_usage_and_Facebook_addiction_model_of_Taiwanese_university_students","250894511_Using_Online_Social_Networking_for_Teaching_and_Learning_Facebook_Use_at_the_University_of_Cape_Town","220030167_The_relationship_between_frequency_of_Facebook_use_participation_in_Facebook_activities_and_student_engagement"]}