{"id":"283028563_Diagnosis_of_Cardiovascular_Diseases_with_Bayesian_Classifiers","abstract":"Cardiovascular disease or atherosclerosis is any disease affecting the cardiovascular system. They include coronary heart disease, raised blood pressure, cerebrovascular disease, peripheral artery disease, rheumatic heart disease, congenital heart disease and heart failure. They are treated by cardiologists, thoracic surgeons, vascular surgeons, neurologists and interventional radiologists. The diagnosis is an important yet complicated task that needs to be done accurately and efficiently. The automation of this system is very much needed to help the physicians to do better diagnosis and treatment. Computer aided diagnosis systems are widely discussed as classification problems. The objective is to reduce the number of false decisions and increase the true ones. In this study, we evaluate the performance of Bayesian classifier (BN) in predicting the risk of cardiovascular disease. Bayesian networks are selected as they are able to produce probability estimates rather than predictions. These estimates allow predictions to be ranked and their expected costs to be minimized. The major advantage of BN is the ability to represent and hence understand knowledge. The cardiovascular dataset is provided by University of California, Irvine (UCI) machine learning repository. It consists of 303 instances of heart disease data each having 76 variables including the predicted class one. This study evaluates two Bayesian network classifiers; Tree Augmented Naïve Bayes and the Markov Blanket Estimation and their prediction accuracies are benchmarked against the Support Vector Machine. The experimental results show that Bayesian networks with Markov blanket estimation has a superior performance on the diagnosis of cardiovascular diseases with classification accuracy of MBE model is 97.92% of test samples, while TAN and SVM models have 88.54 and 70.83% respectively.","authors":["Mahmoud Fakhr","Alaa Elsayad"],"meta":["February 2015Journal of Computer Science 11(2):274-282","DOI:10.3844/jcssp.2015.274.282","Project: Design and Development of Optical Device for Blind People"],"references":["283455342_Diagnosis_of_Cardiovascular_Diseases_by_Boosted_Neural_Networks","322715583_Data_Mining_practical_machine_learning_tools_and_techniques","313992648_Cardiology_in_Family_Practice","313852703_Heart_Disease_Diagnosis_and_Therapy","297926126_Essential_Cardiology_Principles_and_Practice","286329577_Encyclopedia_of_Heart_Diseases","267940233_MEDICAL_DIAGNOSIS_USING_GA","262984790_Predictive_Analysis_for_the_Diagnosis_of_Coronary_Artery_Disease_using_Association_Rule_Mining","261744266_A_New_Data_Preparation_Method_Based_on_Clustering_Algorithms_for_Diagnosis_Systems_of_Heart_and_Diabetes_Diseases","257927252_Analysis_of_Bayesian_classifier_accuracy"]}