{"id":"283005097_On_some_operations_and_density_of_m-polar_fuzzy_graphs","abstract":"The theoretical concepts of graphs are highly utilized by computer science applications, social sciences, medical sciences, etc. Especially in computer science such as data mining, image segmentation, clustering, image capturing, networking, etc. Fuzzy graphs, bipolar fuzzy graphs and recently developed m-polar fuzzy graphs are growing research topics as these are the generalizations of graphs (crisp). In this paper, three new operations, viz. direct product, semi-strong product and strong product are\ndefined on m-polar fuzzy graphs. It is proved that any of the products of m-polar fuzzy graphs are again an m-polar fuzzy graph. Sufficient conditions are established for each one of them to be strong and proved that strong product of two complete m-polar fuzzy graphs is complete. If any of the products of two m-polar fuzzy graphs G1 and G2 are strong, then it is shown that at least G1 or G2 must be strong. Moreover,\nthe density of an m-polar fuzzy graph is defined and studied the notion of balanced m-polar fuzzy graph and established necessary and sufficient conditions for the preceding products of two m-polar fuzzy balanced graphs to be balanced. Finally, the concept of product m-polar fuzzy graph is introduced and shown that every product m-polar fuzzy graph is an m-polar fuzzy graph. Some operations like union, direct product,\nring sum are defined to construct new product m-polar fuzzy graphs.","authors":["Ganesh Ghorai","Madhumangal Pal"],"meta":["October 2015Pacific Science Review A Natural Science and Engineering 17(1):14-22","DOI:10.1016/j.psra.2015.12.001","Project: Fuzzy graph"],"references":["314375949_Complete_fuzzy_graphs","283088924_Certain_Types_of_Product_Bipolar_Fuzzy_Graphs","278965084_Bipolar_Fuzzy_Graphs_with_Categorical_Properties","273176661_Fuzzy_Planar_Graphs","272027873_Complement_and_Isomorphism_on_Bipolar_Fuzzy_Graphs","285264036_Fuzzy_Graphs_Fuzzy_Sets_and_their_Applications","283157319_Bipolar_fuzzy_graphs","276849299_A_study_on_bipolar_fuzzy_graphs","264994797_Complement_of_a_fuzzy_graph","256721451_Notes_on_Bipolar_fuzzy_graphs","254399182_On_Regular_Fuzzy_Graphs","236943605_Fuzzy_Tolerance_Graphs","236943557_Fuzzy_Threshold_Graphs","236943359_Fuzzy_k_-Competition_Graphs_and_p_-Competition_Fuzzy_Graphs","242793996_On_automorphisms_of_fuzzy_graphs"]}