{"id":"283096704_Flipped_Classroom_Strategies_for_CS_Education","abstract":"The basic principles of a flipped classroom teaching method are to deliver content outside of the class and to move active learning into the classroom. There are many strategies for delivering the content online, such as having instructors prepare online lectures, wrapping the course around a MOOC, and curating online videos from various sources. There are also many strategies for including active learning in the classroom that go beyond providing programming labs, and can include various forms of peer instruction. In this paper we describe our experiences flipping four different computer science classes across multiple semesters over two years. This breadth of experience with classroom flipping has enabled us to compare strategies and approaches and develop an understanding of which approaches appear to work under which circumstances. We discuss how we structured out-of-class preparatory work, how we created or sourced online videos, how we used active learning activities in-class to scaffold skills development and identify students' misconceptions, and how we structured teams for in class activities. This paper contributes a set of flexible strategies to consider for provision of curricular content out-of-class, structuring students' preparatory work, applying active learning of skills and concepts, and leveraging social interaction and peer instruction for CS education. We present the impact of our approaches based upon leading indicators of course evaluations and student surveys. We discuss lessons learned and students' responses to our strategies.","authors":["Mary Lou Maher","Celine Latulipe","Heather Richter Lipford","A. Rorrer"],"meta":["February 2015","DOI:10.1145/2676723.2677252","Project: Social & Active Learning"],"references":["262238651_The_inverted-lecture_model_A_case_study_in_computer_architecture","262171514_Exploring_hypotheses_about_media_comptation","237579402_Using_Technology-Based_Methods_to_Foster_Learning_in_Large_Lecture_Classes_Evidence_for_the_Pedagogic_Value_of_Clickers","227450483_Inverting_the_Classroom_A_Gateway_to_Creating_an_Inclusive_Learning_Environment","290487601_Wrapping_a_MOOC_Student_perceptions_of_an_experiment_in_blended_learning","265409306_Toward_Solving_the_High_Enrollment_Low_Engagement_Dilemma_A_Case_Study_in_Introductory_Business","262351371_The_inverted_classroom_and_the_CS_curriculum","249669675_Creating_Active_Learning_in_the_Classroom_A_Systematic_Approach","242399416_Inside_Out_A_Computer_Science_Course_Gets_a_Makeover","224088630_Flipping_the_Work_Design_in_an_industrial_engineering_course"]}