{"id":"283043319_On_Termination_of_Polynomial_Programs_with_Equality_Conditions","abstract":"We investigate the termination problem of a family of multi-path polynomial programs (MPPs), in which all assignments to program variables are polynomials, and test conditions of loops and conditional statements are polynomial equalities. We show that the set of non-terminating inputs (NTI) of such a program is algorithmically computable, thus leading to the decidability of its termination. To the best of our knowledge, the considered family of MPPs is hitherto the largest one for which termination is decidable. We present an explicit recursive function which is essentially Ackermannian, to compute the maximal length of ascending chains of polynomial ideals under a control function, and thereby obtain a complete answer to the questions raised by Seidenberg. This maximal length facilitates a precise complexity analysis of our algorithms for computing the NTI and deciding termination of MPPs. We extend our method to programs with polynomial guarded commands and show how an incomplete procedure for MPPs with inequality guards can be obtained. An application of our techniques to invariant generation of polynomial programs is further presented.","authors":["Yangjia Li","Naijun Zhan","Mingshuai Chen","Hui Lu"],"meta":["September 2020","SourcearXiv"],"references":["345715731_On_linear_recurrence_sequences_and_loop_termination","311769997_Deciding_Conditional_Termination","304405348_On_computable_numbers_with_an_application_to_the_Entscheidungsproblem","289760818_Generating_invariants_for_non-linear_loops_by_linear_algebraic_methods","288890412_Reverse_Mathematical_Bounds_for_the_Termination_Theorem","284409425_Uber_eine_Schlussweise_aus_dem_Endlichen_ins_Unendliche","281718964_Discovering_non-terminating_inputs_for_multi-path_polynomial_programs","274521455_Introduction_to_Commutative_Algebra","266517179_Length_of_Polynomial_Ascending_Chains_and_Primitive_Recursiveness","264956314_A_Decision_Method_for_Elementary_Algebra_and_Geometry"]}