{"id":"283171329_Implementation_of_Pre-defined_Potential_Scope_Reductions_in_Projects","abstract":"The paper maps the use of reduction lists in major railway investment projects. The reduction lists consist of scope reductions that are not desirable, but that can be implemented in large Norwegian governmental investments if there is a risk of cost overrun. This study analyzes volume and characteristics of actual implementation of the potential scope reductions of railway projects. The study is based on major Norwegian railway investments finished during the last 10 years. Information about use of reduction lists is obtained from direct contact with project managers. We have data for seven rail projects, and detailed information for one of them. Five of the projects had reduction lists established in the front-end phase. Three of the projects did implement reductions listed on the reduction lists, but none implemented the full reduction list. Findings indicate that the reduction lists have limited use as an active tool for controlling costs, because the saved amounts are small compared to the total budget for the projects. Contingencies appear to be a stronger tool for cost control than reduction lists. The findings are of interest related to cost control of investment projects, both in railways and other sectors.","authors":["Nils O.E. Olsson"],"meta":["December 2015Procedia Computer Science 64:387-394","DOI:10.1016/j.procs.2015.08.503"],"references":["263747176_How_Inaccurate_Are_Demand_Forecasts_in_Public_Works_Projects_The_Case_of_Transportation","311773757_New_approach_for_the_assessment_of_high-speed_rail_projects_and_how_to_contain_cost_overruns_Lessons_from_the_eva-tren_project","292650316_COST_REDUCTION_IDEAS_FOR_AN_LNG_PROJECT","282174145_Value_management_and_innovation_A_historical_perspective_and_review_of_the_evidence","274267258_Value_Engineering_Results_in_Successful_Precast_Railroad_Bridge_Solution","269142500_Port_of_Tacoma_Engineering_Estimate_Validations_on_Large_Projects","245557852_PART_4_Rail_Transit_New_Vehicle_Options_for_Lower-Cost_Rail_Mobility_Using_Diesel_or_Dual-Powered_Light_Rail_Cars_as_a_Transfer_of_Technology","245390522_Value_engineering_for_railway_construction_projects_Cost_driver_analysis","245282587_Holistic_Appraisal_of_Value_Engineering_in_Construction_in_United_States","238192338_Value_engineering_Part_1"]}