{"id":"283109084_Facebook_friends_subjective_well-being_social_support_and_personality","abstract":"Offline social capital in the form of interpersonal networks is known to be associated with subjective well-being (SWB). In two studies run in the US (N = 153) and Germany (N = 187), we initially investigated whether the size of an individual's Facebook social network was associated with SWB and perceived social support. Objectively measured Facebook network size was positively associated with several measures of both self- and informant rated SWB but not with perceived social support. More pertinent to the present research, we next investigated whether the observed associations between network size and SWB were, in fact, an artifact of personality - trait Extraversion in particular. Indeed, self- and informant-rated Extraversion was associated with both Facebook social network size and with self- and informant-rated SWB. Importantly, controlling for Extraversion rendered the associations between Facebook social network size and SWB weak and statistically insignificant. We discuss the importance of social relationships on Facebook for well-being, as well as the implications of our results for research on the relationship between SWB, social network size, and personality.","authors":["Jan-Erik Lönnqvist","Fenne grosse Deters"],"meta":["February 2016Computers in Human Behavior 55:113-120","DOI:10.1016/j.chb.2015.09.002"],"references":["302871165_Social_Psychology_as_History","286363969_False-positive_psychology_Undisclosed_flexibility_in_data_collection_and_analysis_allows_presenting_anything_as_significant","312624955_Beyond_money_Toward_and_economy_of_well-being","303399900_Measuring_the_functional_components_of_social_support","285867982_Satisfaction_with_life_scale","284944006_Recent_Developments_in_Network_Measurement","281364508_Beyond_Money","279796507_Common_Method_Biases_in_Behavioral_Research_A_Critical_Review_of_the_Literature_and_Recommended_Remedies","277515353_Editors'_Introduction_to_the_Special_Section_on_Replicability_in_Psychological_Science_A_Crisis_of_Confidence","277453338_The_Remarkable_Changes_in_the_Science_of_Subjective_Well-Being"]}