{"id":"283189571_Performance_and_scalability_of_indexed_subgraph_query_processing_methods","abstract":"Graph data management systems have become very popular as graphs are the natural data model for many applications. One of the main problems addressed by these systems is subgraph query processing; i.e., given a query graph, return all graphs that contain the query. The naive method for processing such queries is to perform a subgraph isomorphism test against each graph in the dataset. This obviously does not scale, as subgraph isomorphism is NP-Complete. Thus, many indexing methods have been proposed to reduce the number of candidate graphs that have to underpass the subgraph isomorphism test. In this paper, we identify a set of key factors-parameters, that in uence the performance of related methods: namely, the number of nodes per graph, the graph density, the number of distinct labels, the number of graphs in the dataset, and the query graph size. We then conduct comprehensive and systematic experiments that analyze the sensitivity of the various methods on the values of the key parameters. Our aims are twofold: first to derive conclusions about the algorithms' relative performance, and, second, to stress-test all algorithms, deriving insights as to their scalability, and highlight how both performance and scalability depend on the above factors. We choose six wellestablished indexing methods, namely Grapes, CT-Index, GraphGrepSX, gIndex, Tree+Δ, and gCode, as representative approaches of the overall design space, including the most recent and best performing methods. We report on their index construction time and index size, and on query processing performance in terms of time and false positive ratio. We employ both real and synthetic datasets. Specifically, four real datasets of different characteristics are used: AIDS, PDBS, PCM, and PPI. In addition, we generate a large number of synthetic graph datasets, empowering us to systematically study the algorithms' performance and scalability versus the aforementioned key parameters.","authors":["Foteini Katsarou","Nikos Ntarmos","Peter Triantafillou"],"meta":["August 2015Proceedings of the VLDB Endowment 8(12):1566-1577","DOI:10.14778/2824032.2824054","Project: Subgraph Querying with Parallel Use of Query Rewritings and Alternative Algorithms"],"references":["258117703_GRAPES_A_Software_for_Parallel_Searching_on_Biological_Graphs_Targeting_Multi-Core_Architectures","228370522_Feature-based_similarity_search_in_graph_structures","225075167_Efficient_Subgraph_Matching_on_Billion_Node_Graphs","284568450_iGraph","269837853_Taming_verification_hardness","262251116_Mining_and_indexing_graphs_for_supergraph_search","257457511_Lindex_A_lattice-based_index_for_graph_databases","224237577_CT-index_Fingerprint-based_graph_indexing_combining_cycles_and_trees","221615094_CP-index_On_the_efficient_indexing_of_large_graphs","221336200_Enhancing_Graph_Database_Indexing_by_Suffix_Tree_Structure"]}