{"id":"283125194_PVFMM_A_Parallel_Kernel_Independent_FMM_for_Particle_and_Volume_Potentials","abstract":"We describe our implementation of a parallel fast multipole method for evaluating potentials for discrete and continuous source distributions. The first requires summation over the source points and the second requiring integration over a continuous source density. Both problems require\n\n(\nN\n2\n) complexity when computed directly; however, can be accelerated to\n\n(\nN\n) time using FMM. In our PVFMM software library, we use kernel independent FMM and this allows us to compute potentials for a wide range of elliptic kernels. Our method is high order, adaptive and scalable. In this paper, we discuss several algorithmic improvements and performance optimizations including cache locality, vectorization, shared memory parallelism and use of coprocessors. Our distributed memory implementation uses space-filling curve for partitioning data and a hypercube communication scheme. We present convergence results for Laplace, Stokes and Helmholtz (low wavenumber) kernels for both particle and volume FMM. We measure efficiency of our method in terms of CPU cycles per unknown for different accuracies and different kernels. We also demonstrate scalability of our implementation up to several thousand processor cores on the Stampede platform at the Texas Advanced Computing Center.","authors":["Dhairya Malhotra","George Biros"],"meta":["September 2015Communications in Computational Physics 18(3):808-830","DOI:10.4208/cicp.020215.150515sw"],"references":["274895303_A_Volume_Integral_Equation_Stokes_Solver_for_Problems_with_Variable_Coefficients","256445262_A_free-space_adaptive_FMM-Based_PDE_solver_in_three_dimensions","232623558_Petascale_Direct_Numerical_Simulation_of_Blood_Flow_on_200K_Cores_and_Heterogeneous_Architectures","228657156_42_TFlops_hierarchical_N-body_simulations_on_GPUs_with_applications_in_both_astrophysics_and_turbulence","306243619_Algorithm_967_A_Distributed-Memory_Fast_Multipole_Method_for_Volume_Potentials","298958374_A_fast_solution_method_for_three-dimensional_many-particle_problems_of_linear_elasticity","258230549_A_fast_directional_algorithm_for_high_frequency_acoustic_scattering_in_two_dimensions","242913874_A_Generalized_Fast_Multipole_Method_for_Nonoscillatory_Kernels","238979320_A_Fast_Adaptive_Multipole_Algorithm_for_Particle_Simulations","229963651_Fast_solution_method_for_three-dimensional_Stokesian_many-particle_problems"]}