{"id":"283181216_Properties_of_Gauss_Digitized_Shapes_and_Digital_Surface_Integration","abstract":"This paper presents new topological and geometric properties of Gauss digitizations of Euclidean shapes, most of them holding in arbitrary dimension d. We focus on r-regular shapes sampled by Gauss digitization at gridstep h. The digitized boundary is shown to be close to the Euclidean boundary in the Hausdorff sense, the minimum distance (Formula presented.) being achieved by the projection map (Formula presented.) induced by the Euclidean distance. Although it is known that Gauss digitized boundaries may not be manifold when (Formula presented.), we show that non-manifoldness may only occur in places where the normal vector is almost aligned with some digitization axis, and the limit angle decreases with h. We then have a closer look at the projection of the digitized boundary onto the continuous boundary by (Formula presented.). We show that the size of its non-injective part tends to zero with h. This leads us to study the classical digital surface integration scheme, which allocates a measure to each surface element that is proportional to the cosine of the angle between an estimated normal vector and the trivial surface element normal vector. We show that digital integration is convergent whenever the normal estimator is multigrid convergent, and we explicit the convergence speed. Since convergent estimators are now available in the literature, digital integration provides a convergent measure for digitized objects.","authors":["Jacques-Olivier Lachaud","Boris Thibert"],"meta":["August 2015Journal of Mathematical Imaging and Vision 54(2)","DOI:10.1007/s10851-015-0595-7","Project: Digital calculus, geometric measure theory, and applications"],"references":["275048745_Digital_Geometry","268743083_Topological_Repairing_of_3D_Digital_Images","267105028_Voronoi-Based_Geometry_Estimator_for_3D_Digital_Surfaces","263101600_Preserving_Topology_by_a_Digitization_Process","262425231_Integral_Based_Curvature_Estimators_in_Digital_Geometry","262195732_Multigrid_Convergent_Principal_Curvature_Estimators_in_Digital_Geometry","316794441_Geometric_Measure_Theory","274801291_Image_Analysis_Using_Mathematical_Morphology","267075448_Generalized_Curvatures","264960216_Image_analysis_and_mathematical_morphology_English_version_rev_by_Noel_Cressie"]}