{"id":"283193415_A_comparative_analysis_of_energy_conservation_approaches_in_hybrid_wireless_sensor_networks_data_collection_protocols","abstract":"Wireless sensor network (WSN) has become part of human life as it is used in several applications including healthcare, environment and agricultural, public safety, military, transportation as well as in the industry. In spite of its usefulness, it is challenging to maintain long-term operations due to limited battery life. Several energy efficient protocols have been designed to prolong the network lifetime. The integration of mobility technology with the conventional static sensor network, described as hybrid WSN, promises a new solution that balances energy consumption among sensor nodes and extends the network lifetime. To the best of our knowledge, there has not been as yet an evaluation of the energy-efficiency of the data collection approaches in terms of the energy conservation techniques adopted. In this paper, the architecture of data collection approaches in WSN is discussed. Then, we propose and discuss a taxonomy of types of data collection in WSN. We further present and discuss in details a thematic taxonomy of energy conservation techniques adopted in the various hybrid WSN data collection approaches. Consequently, we compare the different energy conservation approaches that minimize energy consumption in hybrid WSN, highlighting their pros and cons. In conclusion, we point out open research challenges and future directions in the field.","authors":["Gaddafi Abdul-Salaam","Hanan Abdullah","Hossein Anisi","Abdullah Gani"],"meta":["January 2016Telecommunication Systems 61(1)","DOI:10.1007/s11235-015-0092-8"],"references":["329319574_Clustering_in_Wireless_Sensor_Networks","286338017_Energy_optimization_in_cluster_based_wireless_sensor_networks","284122848_Distributed_communication-aware_coverage_control_by_mobile_sensor_networks","277897579_An_Energy-Efficient_and_Relay_Hop_Bounded_Mobile_Data_Gathering_Algorithm_in_Wireless_Sensor_Networks","275066178_An_Energy-Efficient_Data_Collection_Method_for_Wireless_Multimedia_Sensor_Networks","289545155_A_Mobile_Sink_Based_Uneven_Clustering_Algorithm_for_Wireless_Sensor_Networks","287623492_Network_lifetime_maximization_for_time-sensitive_data_gathering_in_wireless_sensor_networks_with_a_mobile_sink","280568415_Tag-based_Cooperative_Data_Gathering_and_Energy_Recharging_in_Wide_Area_RFID_Sensor_Networks","278708325_A_Comparative_Analysis_of_Energy-Efficient_Routing_Protocols_in_Wireless_Sensor_Networks","275483044_Mobile_Sensor_Networks"]}