{"id":"283118148_Quantum_Differential_and_Linear_Cryptanalysis","abstract":"Quantum computers, that may become available one day, will impact many\nscientific fields. Cryptography is certainly one of them since many asymmetric\nprimitives would become insecure against an adversary with quantum\ncapabilities. Cryptographers are already anticipating this threat by proposing\nand studying a number of potentially quantum-safe alternatives for those\nprimitives. On the other hand, the situation of symmetric primitives which seem\nless vulnerable against quantum computing, has received much less attention.\nWe need to prepare symmetric cryptography for the eventual arrival of the\npost-quantum world, as it is done with other cryptography branches.\nCryptanalysis and security analysis are the only proper way to evaluate the\nsecurity of symmetric primitives: our trust in specific ciphers relies on their\nability to resist all known cryptanalysis tools. This requires a proper\ninvestigation of the toolkit of quantum cryptanalysis, that might include\nradically new attacks. This toolkit has not been much developed so far. In this\npaper, we study how some of the main cryptanalytic attacks behave in the\npost-quantum world. More specifically, we consider here quantum versions of\ndifferential and linear cryptanalysis.\nWhile running Grover's search algorithm on a quantum computer brings a\nquadratic speedup for brute-force attacks, we show that the situation is more\nsubtle when considering specific cryptanalysis techniques. In particular, we\ngive the quantum version of various classes of differential and linear attacks\nand show that the best attacks in the classical world do not necessarily lead\nto the best quantum ones. Some non-intuitive examples of application on ciphers\nLAC and KLEIN are provided.","authors":["Marc Kaplan","Gaëtan Leurent","Anthony Leverrier","María Naya-Plasencia"],"meta":["October 2015","DOI:10.13154/tosc.v2016.i1.71-94","SourcearXiv"],"references":["281356799_Cryptanalysis_of_KLEIN_full_version","280821144_Polynomial-Time_Algorithms_for_Prime_Factorization_and_Discrete_Logarithms_on_a_Quantum_Computer","279258122_Cryptanalysis_of_KLEIN","278815907_Differential_Forgery_Attack_against_LAC","267133533_Quantum-Secure_Message_Authentication_Codes","266560500_Quantum_attacks_against_iterated_block_ciphers","261247598_Security_on_the_quantum-type_Even-Mansour_cipher","255904253_Quantum_Mechanics_Helps_in_Searching_for_a_Needle_in_a_Haystack","237082797_A_note_on_quantum_related-key_attacks","231582268_Nested_Quantum_Walks_with_Quantum_Data_Structures"]}