{"id":"283170856_Swine-Vet_A_Web-based_Expert_System_of_Swine_Disease_Diagnosis","abstract":"A web-based expert system of swine disease diagnosis was developed for swine farmers and animal husbandmen. Our expert system was divided into three steps. First step was disease screening. We established the novel model of knowledge representation for inference using swine's gender and age range which defined by the veterinarian. Second step was disease diagnosis using the symptoms. To make a diagnosis using symptoms which are accurate and efficient, we established the novel model of uncertain knowledge representation for inference using determination of significant weight of each symptom which defined by the veterinarian and using the certainty factor of occurred symptom, the value was assigned by user. Third step was the disease diagnosis using swine necropsy lesion. We established the novel model of knowledge representation for inference using major lesion group which defined by the veterinarian for confirmation of morbidness. From the results of diagnosis by our expert system compare with veterinarian, we found that it could disease screening accurately for 97.50%, could diagnose by symptom accurately for 92.48% and could diagnose by lesion accurately for 95.62%. And the results of evaluation of satisfaction with Likert-scale by the swine farmers and animal husbandmen were 4.7 and 4.5 respectively.","authors":["Chutchada Nusai","Sirisak Cheechang","Somkid Chaiphech","Goragot Thanimkan"],"meta":["December 2015Procedia Computer Science 63:366-375","DOI:10.1016/j.procs.2015.08.355"],"references":["267855216_Lameness_in_Dairy_Cows_using_a_Fuzzy-Logic_Based_Expert_System-Part_I_Prediction_of_the_Occurrence_of_Lameness_in_Dairy_Cows_using_a_Fuzzy-Logic_Based_Expert_System_-_Part_I","290518270_Development_of_expert_system_program_for_pre-diagnosis_of_important_Swine_gastrointestinal_diseases_in_Thailand","241170673_The_Expert_System_of_Cow_Disease_Diagnosis_Basing_on_the_Uncertainty_Evidence_Illation","223754681_Fish-Expert_A_web-based_expert_system_for_fish_disease_diagnosis","223746425_Improving_the_automated_monitoring_of_dairy_cows_by_integrating_various_data_acquisition_systems","222115404_Pig-Vet_Web-based_expert_system_for_pig_disease_diagnosis"]}