{"id":"283258786_Gaming_in_Second_Life_via_Scratch4SL_Engaging_High_School_Students_in_Programming_Courses","abstract":"While pedagogical and technological affordances of three-dimensional (3D) multi-user virtual worlds in various educational disciplines are largely well-known, a study about their effect on high school students’ engagement in introductory programming courses is still lacking. This case study presents students’ opinions about their participation in a 3D multi-user game-like environment, by harnessing Second Life in combination with the two-dimensional (2D) programming environment of Scratch4SL. Following a blended instructional format (face-to-face in a computer laboratory and supplementary online courses), fifty-six (56) students utilizing Scratch4SL participated in this study, with a view to reduce the “steep learning curve” created during their first-time entrance into Second Life. This study identifies Papert’s theory of Constructionism as a potentially appropriate theoretical foundation for the development of an instructional framework, in order to assist students to coordinate and manage learning materials with other teammates, using their computational thinking skills in collaborative problem-based programming tasks. The study findings based on a mixed-method research (a close-ended questionnaire and an open-ended interview) indicated the effectiveness of this “constructionist-oriented” instructional process for students’ engagement to acquire or empower social, cognitive, higher-order and computational thinking skills. Educational implications and recommendations for future research are also discussed.","authors":["Nikolaos Pellas","Efstratios Peroutseas"],"meta":["November 2016Journal of Educational Computing Research 54(1):108-143","DOI:10.1177/0735633115612785","Project: Virtual Worlds in STEM education"],"references":["288980986_The_Additive_Value_of_Multimodal_Features_for_Predicting_Engagement_Frustration_and_Learning_during_Tutoring","282603860_Computational_thinking_in_compulsory_education_Towards_an_agenda_for_research_and_practice","274309848_Computational_Thinking","286008636_A_study_of_cooperative_computer_programming_learning_behavior_and_its_influence_on_learning_performance","280696811_Mixing_Qualitative_and_Quantitative_Methods_Triangulation_in_Action","279910364_The_Auxiliary_Role_of_Information_Technology_in_Teaching_Enhancing_Programming_Course_Using_Alice","278672713_A_new_way_of_teaching_programming_skills_to_K-12_students_Codeorg","277374591_Lowering_the_barriers_to_programming","274636298_An_empirical_evaluation_of_the_User_Engagement_Scale_UES_in_online_news_environments","272391677_Programming_assistance_tools_to_support_the_learning_of_IT_programming_in_South_African_secondary_schools"]}