{"id":"283280030_Dynamic_Hierarchical_Reactive_Controller_Synthesis","abstract":"In the formal approach to reactive controller synthesis, a symbolic\ncontroller for a possibly hybrid system is obtained by algorithmically\ncomputing a winning strategy in a two-player game graph. Such game-solving\nalgorithms scale poorly as the size of the game graph increases. However, in\nmany applications, the game graph has a natural hierarchical structure which\nhas, so far, not been exploited.\nIn this paper, we propose local games on hierarchical graphs as a modeling\nformalism which decomposes a large-scale reactive synthesis problem in two\ndimensions. First, the construction of a hierarchical game graph introduces\nabstraction layers, where each layer is again a two-player game graph. Second,\nevery such layer is decomposed into multiple local game graphs, each\ncorresponding to a node in the higher level game graph. We propose a technique\nto calculate winning strategies for such sets of local game graphs over\nhierarchies that allows for dynamic specification changes and revisions at each\nstep of the play. We show that this synthesis is sound under natural\nassumptions.\nWe illustrate our results through an example controlling an autonomous robot\nin a known, multistory building with adversarial environment.","authors":["Anne-Kathrin Schmuck","Rupak Majumdar"],"meta":["June 2017Discrete Event Dynamic Systems 27(2)","DOI:10.1007/s10626-017-0239-8","SourcearXiv"],"references":["299773629_Hierarchical_Hybrid_Planning_in_a_Mobile_Service_Robot","279632503_Assume-Admissible_Synthesis","270394677_Formal_Verification_of_Maneuver_Automata_for_Parameterized_Motion_Primitives","341922538_Reactive_sampling-based_path_planning_with_temporal_logic_specifications","309589113_Cooperative_Reactive_Synthesis","286561447_Combined_task_and_motion_planning_through_an_extensible_planner-independent_interface_layer","271549745_Optimal_control_of_non-deterministic_systems_for_a_computationally_efficient_fragment_of_temporal_logic","267173791_Modular_Synthesis_with_Open_Components","264122910_How_to_Handle_Assumptions_in_Synthesis","262255861_Environment-Friendly_Safety"]}