{"id":"283266768_Hardware_Design_and_Implementation_of_a_Wavelet_De-Noising_Procedure_for_Medical_Signal_Preprocessing","abstract":"In this paper, a discrete wavelet transform (DWT) based de-noising with its applications into the noise reduction for medical signal preprocessing is introduced. This work focuses on the hardware realization of a real-time wavelet de-noising procedure. The proposed de-noising circuit mainly consists of three modules: a DWT, a thresholding, and an inverse DWT (IDWT) modular circuits. We also proposed a novel adaptive thresholding scheme and incorporated it into our wavelet de-noising procedure. Performance was then evaluated on both the architectural designs of the software and. In addition, the de-noising circuit was also implemented by downloading the Verilog codes to a field programmable gate array (FPGA) based platform so that its ability in noise reduction may be further validated in actual practice. Simulation experiment results produced by applying a set of simulated noise-contaminated electrocardiogram (ECG) signals into the de-noising circuit showed that the circuit could not only desirably meet the requirement of real-time processing, but also achieve satisfactory performance for noise reduction, while the sharp features of the ECG signals can be well preserved. The proposed de-noising circuit was further synthesized using the Synopsys Design Compiler with an Artisan Taiwan Semiconductor Manufacturing Company (TSMC, Hsinchu, Taiwan) 40 nm standard cell library. The integrated circuit (IC) synthesis simulation results showed that the proposed design can achieve a clock frequency of 200 MHz and the power consumption was only 17.4 mW, when operated at 200 MHz.","authors":["Szi-Wen Chen","Yuan-Ho Chen"],"meta":["October 2015Sensors 15(10):26396-26414","DOI:10.3390/s151026396"],"references":["270000974_Wavelet-Based_Regularization_for_Robust_Microwave_Imaging_in_Medical_Applications","268437358_ECG_Signal_Denoising_Using_Wavelet_Thresholding_Techniques_in_Human_Stress_Assessment","267377834_An_efficient_VLSI_architecture_and_FPGA_implementation_of_high-speed_and_low_power_2-D_DWT_for_97_wavelet_filter","262191439_Design_Development_and_Testing_of_a_Low-Cost_sEMG_System_and_Its_Use_in_Recording_Muscle_Activity_in_Human_Gait","313061242_A_theory_for_multiresolution_signal_decomposition_The_wavelet_representation","303517502_Multifrequency_Channel_Decompositions_of_Images_and_Wavelet_Models","282984924_Denoising_of_ECG_signals_using_dual_tree_complex_wavelet_transform","262155649_Memory_efficient_and_low_power_VLSI_architecture_for_2-D_lifting_based_DWT_with_dual_data_scan_technique","257690617_Denoising_of_ECG_signals_based_on_noise_reduction_algorithms_in_EMD_and_wavelet_domains","248540894_A_Theory_of_Multiresolution_Signal_Decomposition_The_Wavelet_Representation"]}