{"id":"283257349_Fast_and_Scalable_Lasso_via_Stochastic_Frank-Wolfe_Methods_with_a_Convergence_Guarantee","abstract":"Frank-Wolfe (FW) algorithms have been often proposed over the last few years as efficient solvers for a variety of optimization problems arising in the field of Machine Learning. The ability to work with cheap projection-free iterations and the incremental nature of the method make FW a very effective choice for many large-scale problems where computing a sparse model is desirable. In this paper, we present a high-performance implementation of the FW method tailored to solve large-scale Lasso regression problems, based on a randomized iteration, and prove that the convergence guarantees of the standard FW method are preserved in the stochastic setting. We show experimentally that our algorithm outperforms several existing state of the art methods, including the Coordinate Descent algorithm by Friedman et al. (one of the fastest known Lasso solvers), on several benchmark datasets with a very large number of features, without sacrificing the accuracy of the model. Our results illustrate that the algorithm is able to generate the complete regularization path on problems of size up to four million variables in less than one minute.","authors":["Emanuele Frandi","Ricardo Nanculef","Stefano Lodi","Claudio Sartori"],"meta":["September 2016Machine Learning","DOI:10.1007/s10994-016-5578-4","Project: Frank-Wolfe algorithms for machine learning"],"references":["277334598_Stochastic_Block_Coordinate_Frank-Wolfe_Algorithm_for_Large-Scale_Biological_Network_Alignment","329652278_Learning_with_Kernels_Support_Vector_Machines_Regularization_Optimization_and_Beyond","313446488_Ridge_regression_Biased_estimation_for_nonorthogonal_problems","312432923_Regularization_and_Variable_Selection_via_the_Elastic_Nets","308841182_A_PARTAN-accelerated_Frank-Wolfe_algorithm_for_large-scale_SVM_classification","307881957_LIBSVM_A_library_for_support_vector_machines","304824205_Regression_Shrinkage_and_Selection_via_the_LASSO","283257375_High_Level_High_Performance_Computing_for_Multitask_Learning_of_Time-varying_Models","279243677_Efficient_Lasso_Training_from_a_Geometrical_Perspective","272825857_UCI_Machine_Learning_Repository"]}