{"id":"283355604_An_experimental_study_of_spatiotemporally_resolved_heat_transfer_in_thin_liquid-film_flows_falling_over_an_inclined_heated_foil","abstract":"This paper describes the development of an experimental technique that combines simultaneous planar laser-induced fluorescence (PLIF) and infrared (IR) thermography imaging, and its application to the measurement of unsteady and conjugate heat-transfer in harmonically forced, thin liquid-film flows falling under the action of gravity over an inclined electrically heated-foil substrate. Quantitative, spatiotemporally resolved and simultaneously conducted measurements are reported of the film thickness, film free-surface temperature, solid–liquid substrate interface temperature, and local/instantaneous heat flux exchanged with the heated substrate. Based on this information, local and instantaneous heat-transfer coefficients (HTCs) are recovered. Results concerning the local and instantaneous HTC and how this is correlated with the local and instantaneous film thickness suggest considerable heat-transfer enhancement relative to steady-flow predictions in the thinner film regions. This behaviour is attributed to a number of unsteady/mixing transport processes within the wavy films that are not captured by laminar, steady-flow analysis. The Nusselt number Nu increases with the Reynolds number Re; at low Re values the mean Nu number corresponds to 2.5, in agreement with the steady-flow theory, while at higher Re, both the Nu number and the HTC exhibit significantly enhanced values. Evidence that the HTC becomes decoupled from the film thickness for the upper range of observed film thicknesses is also presented. Finally, smaller film thickness fluctuation intensities were associated with higher HTC fluctuation intensities, while the amplitude of the wall temperature fluctuations was almost proportional to the amplitude of the HTC fluctuations.","authors":["Christos N. Markides","Richard Mathie","Alexandros Charogiannis"],"meta":["October 2015International Journal of Heat and Mass Transfer","DOI:10.1016/j.ijheatmasstransfer.2015.10.062","Project: Harnessing unsteady phase-change heat exchange in high-performance concentrated solar power systems"],"references":["279460435_A_simultaneous_planar_laser-induced_fluorescence_particle_image_velocimetry_and_particle_tracking_velocimetry_technique_for_the_investigation_of_thin_liquid-film_flows","270646411_Phase_diagram_for_the_onset_of_circulating_waves_and_flow_reversal_in_inclined_falling_films","265129554_An_Experimental_Characterization_of_Liquid_Films_in_Downwards_Co-Current_Gas-Liquid_Annular_Flow_by_Particle_Image_and_Tracking_Velocimetry","280995260_Die_OberflachenKondensation_des_Wasserdamfes","273663565_Disturbance_wave_development_in_two-phase_gas-liquid_upwards_vertical_annular_flow","271614085_Horizontal_liquid-liquid_flow_characteristics_at_low_superficial_velocities_using_laser-induced_fluorescence","267579002_Numerical_Simulations_of_Hydrodynamics_and_Heat_Transfer_in_Wavy_Falling_Liquid_Films_on_Vertical_and_Inclined_Walls","267578666_Flow_Patterns_and_Heat_Transfer_in_Thin_Liquid_Films_on_Walls_With_Straight_Meandering_and_Zigzag_Mini-Grooves","267494811_Heat_Transfer_and_Evaporation_of_Falling_Liquid_Films_on_Surfaces_With_Advanced_Three-Dimensional_Periodic_Structures_Experiments_and_Numerical_Simulations","266987864_Falling_Liquid_Films"]}