{"id":"283349073_FUTURISTIC_BUSINESS_STUDIES_CURRICULUM_A_FRAMEWORK","abstract":"The future has captivated many people, from astrologers to trendsetters.However, it is rarely\nexplicitly studied in the school setting. While businesses frequently develop five-year plans\nand government departments look to the immediate future, educational institutions have been\nslow to adopt forward look in foci in their curricula. The high global youth unemployment\nrate and the gap in mismatch between students of business education and the demands from\nbusiness sectors trigger a need to relook at an applied curriculum, the Business Studies. A\nrealistic and practical curriculum will assists in job creation and increase employability. This\npaper is an exploration of the need for education to be more futures-oriented and of ways in\nwhich established futures concepts and methodologies can be incorporated as part of a futures\nperspective across curriculum. This paper also proposes the usage of theoretical and\nconceptual frameworks in designing a futuristic Business Studies curriculum to prepare Form\n6 students for future business environment as an example. The prototype of the curriculum\nfocused on future business needs, content, skills and values, emphasising validity and\npracticality. The developmental research approach (DDR), comprising „needs analysis‟,\n„design‟, and „evaluation‟ phases, was used to build the prototype. The frameworks and the\ndevelopmental research approach were found suitable to develop an acceptable curriculum\nfor the future.\nKeywords: futuristic curriculum, framework, Business Studies, developmental research\napproach.","authors":["Saedah Siraj","Wye Mei Chiew"],"meta":["May 2015","Conference: 6th International Conference ON Educational Technology Adi Buana (ICETA 6)At: Surabaya, Indonesia"],"references":["295149407_Ten_forces_driving_business_eutures","235701029_Experiential_Learning_Experience_As_The_Source_Of_Learning_And_Development","228969664_Development_of_integrated_learning_in_business_curriculum","280213716_A_vision_for_business_schools","269976288_Potential_Growth_in_Emerging_Asia","268745264_Frames_of_Mind_The_Theory_of_Multiple_Intelligences","265086460_How_to_Design_and_Evaluate_Research_in_Education","255607391_Business_Graduate_Competencies_Employers'_Views_on_Importance_and_Performance","239982711_Experience_as_the_Source_of_Learning_and_Development","234655664_Curriculum_Consonance_in_United_States_History_Classrooms"]}