{"id":"283321689_The_Challenges_and_the_Opportunities_of_Teaching_the_Introductory_Computer_Programming_Course_Case_Study","abstract":"Teaching practical courses has always constituted burdens on colleges offering non-technical degrees. One of these courses is computer programming, especially in degrees like computer science, information systems and software engineering. In such programs, students are expected to take between 2-5 computer programming courses. Success ratio in the ﬁrst course is usually low. Why is it low and how this ratio can be increased is discussed in this paper. This is carried out in the context of an introductory computer programming course at the college of computer engineering and sciences (CCES) at Prince Sattam Bin Abdulaziz University in Kingdom of Saudi Arabia. This study also relies on the teaching experience of the authors in different countries including -for around ten years: UK, USA, Sudan, Jordan and Kingdom of Saudi Arabia. To ﬁgure out problems and solutions for teaching introductory computer programming course, then interviews with selected instructors who teach such course at the college are conducted. Also, a questionnaire has been designed and distributed to students. The results of the analysis for both the interviews and the questionnaire have been used along with the results of similar studies to recommend solutions of problems occur in such course. As questionnaire shows, most students think that giving the whole course in the lab will be much better and also they prefer not to work alone. These and other recommendations presented in this study are especially appropriate for similar institutions in the Middle-East and Gulf area.","authors":["Mohamed Osman Ali Hegazi","Mohammad Alhawarat"],"meta":["October 2015","DOI:10.1109/ECONF.2015.61","Conference: Fifth International Conference on e-Learning: Cognitively informed technologyAt: Manama, Kingdom of Bahrain"],"references":["280576672_Causal_attributions_of_success_and_failure_made_by_undergraduate_students_in_an_introductory-level_computer_programming_course","272852888_A_Methodology_for_Teaching_Computer_Programming_first_year_students'_perspective","263737674_Novice_Students_and_Computer_Programming_Toward_Constructivist_Pedagogy","260979995_Success_in_Introductory_Programming_What_Works","251812193_How_to_teach_programming_languages_to_novice_students_Lecturing_or_not","228356652_PPIG_2004_Factors_Affecting_Course_Outcomes_in_Introductory_Programming","221538309_Introductory_programming_criterion-referencing_and_bloom","319393897_Taxonomy_of_educational_objectives_The_classification_of_educational_goals_Handbook_I_cognitive_domain","266657039_Failure_rates_in_introductory_programming_revisited","247699111_Taxonomy_of_Educational_Objectives_The_Classification_of_Educational_Objectives"]}