{"id":"283348079_Curriculum_Analysis_of_CS_Departments_Based_on_CS2013_by_Simplified_Supervised_LDA","abstract":"The curricula higher educational institutions offer is a key asset in enabling them to systematically educate their students. \nWe have been developing a curriculum analysis method that can help to find out differences among curricula.\nOn the basis of \"Computing Science Curricula CS2013\", a report released by the ACM and IEEE Computer Society, we applied our method to analyzing 10 computer science (CS) related curricula offered by CS departments of universities in the United States.\nUsing the method enables us to compare courses across universities.\nThrough an analysis of course syllabi distribution, we found that CS2013 uniformly covered a wide area of computer science.\nSome universities emphasized human factors, while others attached greater importance to theoretical ones.\nWe also found that some CS departments offered not only a CS curriculum but also an electrical engineering one, and those departments showed a tendency to have more \"Architecture and Organization (AR)\" related curricula.\nFurthermore, we found that even though \"Information Assurance and Security (IAS)\" has not yet become a very popular field, some universities are already offering IAS related courses.","authors":["Takayuki Sekiya","Yoshitatsu Matsuda","Kazunori Yamaguchi"],"meta":["March 2015","DOI:10.1145/2723576.2723594","Conference: Fifth International Conference on Learning Analytics And Knowledge (LAK'15)"],"references":["262354328_Techniques_for_data-driven_curriculum_analysis","257714749_Machine_Learning-based_Syllabus_Classification_toward_Automatic_Organization_of_Issue-oriented_Interdisciplinary_Curricula","228798898_Automatic_Syllabus_Classification_using_Support_Vector_Machines","221620547_Latent_Dirichlet_Allocation","221363125_Simultaneous_image_classification_and_annotation","308953944_Simultaneous_image_classification_and_annotation","273109551_Understanding_Curriculum_An_Introduction_to_the_Study_of_Historical_and_Contemporary_Curriculum_Discourses","258991781_A_Comparison_of_the_Core_Aspects_of_the_ACMIEEE_Computer_Science_Curriculum_2013_Strawman_Report_with_the_Specified_Core_of_CC2001_and_CS2008_Review","224599467_Textual_Information_and_Correspondence_Analysis_in_Curriculum_Analysis","224143900_Development_of_a_curriculum_analysis_tool"]}