{"id":"283493643_SimPhy_Phylogenomic_Simulation_of_Gene_Locus_and_Species_Trees","abstract":"We present a fast and flexible software package -SimPhy- for the simulation of multiple gene families evolving under incomplete lineage sorting, gene duplication and loss, horizontal gene transfer -all three potentially leading to species-tree/gene-tree discordance- and gene conversion. SimPhy implements a hierarchical phylogenetic model in which the evolution of species, locus and gene trees is governed by global and local parameters (e.g., genome-wide, species-specific, locus-specific), that can be fixed or be sampled from a priori statistical distributions. SimPhy also incorporates comprehensive models of substitution rate variation among lineages (uncorrelated relaxed clocks) and the capability of simulating partitioned nucleotide, codon and protein multilocus sequence alignments under a plethora of substitution models using the program INDELible. We validate SimPhy's output using theoretical expectations and other programs, and show that it scales extremely well with complex models and/or large trees, being an order of magnitude faster than the most similar program (DLCoal-Sim). In addition, we demonstrate how SimPhy can be useful to understand interactions among different evolutionary processes, conducting a simulation study to characterize the systematic overestimation of the duplication time when using standard reconciliation methods. SimPhy is available at https://github.com/adamallo/SimPhy, where users can find the source code, pre-compiled executables, a detailed manual and example cases.","authors":["Diego Mallo","Leonardo De Oliveira Martins","David Posada"],"meta":["November 2015Systematic Biology 65(2)","DOI:10.1093/sysbio/syv082"],"references":["308319762_ALF--a_simulation_framework_for_genome_evolution","278331707_ASTRAL-II_Coalescent-based_species_tree_estimation_with_many_hundreds_of_taxa_and_thousands_of_genes","271022815_Scrm_Efficiently_simulating_long_sequences_using_the_approximated_coalescent_with_recombination","269722644_Weighted_Statistical_Binning_Enabling_Statistically_Consistent_Genome-Scale_Phylogenetic_Analyses","267749446_A_Bayesian_Supertree_Model_for_Genome-Wide_Species_Tree_Reconstruction","315297297_Estimation_of_Species_Trees","311556592_A_maximum_pseudo-likelihood_approach_for_estimating_species_trees_under_the_coalescent_model","277413250_Monte_Carlo_Strategies_for_Selecting_Parameter_Values_in_Simulation_Experiments","272593588_Fitting_the_Gene_Lineage_into_its_Species_Lineage_a_Parsimony_Strategy_Illustrated_by_Cladograms_Constructed_from_Globin_Sequences","267755835_Evaluating_Summary_Methods_for_Multilocus_Species_Tree_Estimation_in_the_Presence_of_Incomplete_Lineage_Sorting"]}