{"id":"283452909_'RehabMasterTM'_A_Pervasive_RehabilitationPlatform_for_Stroke_Patients_and_TheirCaregivers","abstract":"Rehabilitating post-stroke patients needs an ongoing treatment for a long time, and in particular, making them to perseveringly engage into the treatment is key to success. In practice, such an approach has been widely applied in the institutionalized environments (e.g., hospitals), but less successful when the patients return to home, which entails the importance of pervasive health. We provide a comprehensive source of studies regarding serious games for stroke patients. It covers, in part, edutainment issues for motivating them to further engage into the exercises at home; and mostly at the same time for how a serious game platform can be integrated into the institutionalized medical treatments in the current work practices in Korea. In particular, we are much interested in sharing our design experiences from the implementation to installation of such platform in the patient’s home and across the institutions, under the umbrella project called the ‘Ubiquitous Health Korea’ project. We try to introduce the multifaceted approach (e.g., HCI design issues, team treatment issues, organizational issues, and even political issues) about how to provide a healthcare service design in Korea as a practical case study.","authors":["Kyoungwon Seo","Hokyoung Ryu","Jieun Kim","Seong Ho Jang"],"meta":["July 2014","DOI:10.1007/978-1-4471-6413-5_6","In book: Pervasive Health , Human–Computer Interaction SeriesPublisher: Springer-Verlag London","Project: RehabMaster™: Serious game design for elderly rehabilitation"],"references":["348362845_The_Complementary_Role_of_Representations_in_Design_Creativity_Sketches_and_Models","282777848_Evidence_based_design_for_healthcare","265375880_From_Computer_Innovation_to_Human_Integration_Current_Trends_and_Challenges_for_Pervasive_Health_Technologies","323877523_Virtual_Rehabilitation_-_Benefits_and_Challenges","318838070_Technologies_for_Active_Aging","313517725_The_Social_Organization_of_Distributed_Cognition","300820627_A_New_Methodology_CON-INFO_for_Context-Based_Development_of_a_Mobile_User_Interface_in_Healthcare_Applications","300820383_The_Ongoing_Development_of_a_Multimedia_Gaming_Module_to_Aid_Speech_Language_and_Communication","281051801_Pervasive_Health_Knowledge_Management","272160066_Cognition_and_Reality"]}