{"id":"283438766_Integration_of_Smart_City_and_Lifecycle_Concepts_for_Enhanced_Large-Scale_Event_Management","abstract":"Hosting large-scale events is the dream of many cities around the world, however challenging. Hosting a large-scale event is a complex project that requires careful planning, precise implementation, interactive operation, and successful closure of all activities, with the involvement of all relevant organizations, authorities and stakeholders. Therefore, event organizers pay their utmost attention to the improvement of every aspect of Event Management. Application of smart city concepts can address the complexity of service provisioning during large-scale events, through better efficiency, higher quality, and real-time decision-making capabilities. Lifecycle management concepts can improve the whole event management cycle across different phases. This paper proposes combining Smart City and Lifecycle concepts to improve vertical service provisioning and horizontal integration between different sectors, across different phases while creating a suitable platform for information and knowledge sharing within the same event and with other similar events. This research aims to reach a more holistic smart event experience.","authors":["Ahmed Hefnawy","Abdelaziz Bouras","Chantal Cherifi"],"meta":["October 2015","DOI:10.1007/978-3-319-33111-9_62","Conference: IFIP PLM’15 International ConferenceAt: Doha"],"references":["277330220_Scientific_and_Practical_Understandings_of_Smart_Cities","265118906_Standardized_framework_for_integrating_domain-specific_applications_into_the_IoT","264814281_Product_lifecycle_management_-_From_its_history_to_its_new_role","264564074_Universal_Messaging_Standards_for_the_IoT_From_a_Lifecycle_Management_Perspective","261047391_Developing_a_Smart_City_Model_that_Ensures_the_Optimum_Utilization_of_Existing_Resources_in_Cities_of_All_Sizes","258390180_Defining_Product_Lifecycle_Management_A_Journey_across_Features_Definitions_and_Concepts","254051893_Understanding_Smart_Cities_An_Integrative_Framework","268692270_P2P_Data_synchronization_for_product_lifecycle_management","261279762_M2M_Communications_for_Smart_City_An_Event-Based_Architecture"]}