{"id":"283502576_NET-Computer_Internet_Computer_Architecture_and_its_Application_in_E-Commerce","abstract":"Research in Intelligent Agents has yielded interesting results, some of which have been translated into commercial ventures. Intelligent Agents are executable software components that represent the user, perform tasks on behalf of the user and when the task terminates, the Agents send the result to the user. Intelligent Agents are best suited for the Internet: a collection of computers connected together in a worldwide computer network. Swarm and HYDRA computer architectures for Agents' execution were developed at the University of Surrey, UK in the 90s. The objective of the research was to develop a software-based computer architecture on which Agents execution could be explored. The combination of Intelligent Agents and HYDRA computer architecture gave rise to a new computer concept: the NET-Computer in which the computing resources reside on the Internet. The Internet computers form the hardware and software resources, and the user is provided with a simple interface to access the Internet and run user tasks. The Agents autonomously roam the Internet (NET-Computer) executing the tasks. A growing segment of the Internet is E-Commerce for online shopping for products and services. The Internet computing resources provide a marketplace for product suppliers and consumers alike. Consumers are looking for suppliers selling products and services, while suppliers are looking for buyers. Searching the vast amount of information available on the Internet causes a great deal of problems for both consumers and suppliers. Intelligent Agents executing on the NET-Computer can surf through the Internet and select specific information of interest to the user. The simulation results show that Intelligent Agents executing HYDRA computer architecture could be applied in E-Commerce.","authors":["Marcel Ohanga Odhiambo","Patrice Umenne"],"meta":["June 2012Engineering, Technology and Applied Science Research 2(2012):302-309","DOI:10.48084/etasr.145","Project: Modelling Computer Networks"],"references":["283514821_Application_of_Intelligent_Agents_in_E-Commerce","283514718_NET-COMPUTER_Internet_Computer_Architecture_Based_on_Intelligent_Agents","283489741_HYDRA_Parallel_and_Distributed_Swarm_Computer_Architecture","277293588_An_Overview_of_the_WAVE_Language_and_System_for_Distributed_Processing_in_Open_Networks","243636443_Telescript_Technology_Scenes_from_the_Electronic_Marketplace","240918705_What_cloud_computing_really_means","238740526_Telescript_technology_The_foundation_for_the_electronic_marketplace","238181344_An_introduction_to_the_TACOMA_distributed_system","234816589_Telescript_technology_mobile_agents","228606582_Agent_Tcl_A_transportable_agent_system"]}