{"id":"283563970_Deformation-Driven_Topology-Varying_3D_Shape_Correspondence","abstract":"We present a deformation-driven approach to topology-varying 3D shape correspondence. In this paradigm, the best correspondence between two shapes is the one that results in a minimal-energy, possibly topology-varying, deformation that transforms one shape to conform to the other while respecting the correspondence. Our deformation model, called GeoTopo transform, allows both geometric and topological operations such as part split, duplication, and merging, leading to fine-grained and piecewise continuous correspondence results. The key ingredient of our correspondence scheme is a deformation energy that penalizes geometric distortion, encourages structure preservation, and simultaneously allows topology changes. This is accomplished by connecting shape parts using structural rods, which behave similarly to virtual springs but simultaneously allow the encoding of energies arising from geometric, structural, and topological shape variations. Driven by the combined deformation energy, an optimal shape correspondence is obtained via a pruned beam search. We demonstrate our deformation-driven correspondence scheme on extensive sets of man-made models with rich geometric and topological variation and compare the results to state-of-the-art approaches.","authors":["Ibraheem Alhashim","Kai Xu","Yixin Zhuang","Junjie Cao"],"meta":["October 2015ACM Transactions on Graphics 34(6):1-13","DOI:10.1145/2816795.2818088","Projects: correspondenceGeometry model generation"],"references":["275482867_Relating_Shapes_via_Geometric_Symmetries_and_Regularities","273208420_Learning_Part-based_Templates_from_Large_Collections_of_3D_Shapes","266659397_Structure-Aware_Shape_Processing","326942507_The_image_processing_handbook_Seventh_edition","314785122_Pattern-aware_shape_deformation_using_sliding_dockers","314751929_Fit_and_diverse_set_evolution_for_inspiring_3D_shape_galleries","277679352_iWIRES","273188481_Shape_Segmentation_by_Approximate_Convexity_Analysis","269079907_Unsupervised_Co-Segmentation_of_a_Set_of_Shapes_via_Descriptor-Space_Spectral_Clustering","269079903_Unsupervised_co-segmentation_of_a_set_of_shapes_via_descriptor-space_spectral_clustering"]}