{"id":"283570702_A_Lealdade_do_Estudante_baseada_na_Qualidade_do_Relacionamento_uma_analise_em_Instituicoes_de_Ensino_Superior","abstract":"The objective of this research is to verify the propensity to the students’ loyalty on higher\neducation institutions. The relationship marketing is shown essential to the educational\ninstitutions and students’ relations. This focus takes the organizations to develop relationships\nthat eventually address to the retention and the loyalty. Studies about students' retention there\nare being worked a long time ago, highlights to “Model of Student Integration”, by Tinto\n(1975, 1993), as main exponent. Even so, the students’ loyalty has not still been a lot studied,\nexcept for the “RQSL Model”, by Hennig-Thurau, Langer and Hansen (2001), that\naccomplishes a “bridge” between the Tinto’s interactionist vision of the students’ retention\nand the basic aspects of the consumer’s loyalty. The study accomplished the research with\n352 students of the business administration college, in three higher education institutions in\nCampinas region, São Paulo state, Brazil. The analysis of the data was made through the\ndescriptive statistics and of the Multiple Lineal Regression analysis. The results evidenced\nthat there is propensity of the students to loyalty to yours higher education institutions. Of the\n11 hypotheses of the study, 9 were confirmed, strengthening the relationships proposals\namong the variables. In relation to the constructs that influenced the student loyalty, they\nstood out: Perceived Quality, Satisfaction, Emotional Commitment and Trust, responsible for\n46% of the data variability. Starting from these results, several academic and managerial\nimplications were discussed, demonstrating that the student loyalty is placed as important\nstrategic objective to the higher education institutions.","authors":["Fabio Bergamo"],"meta":["November 2008","DOI:10.13140/RG.2.1.2691.2728","Thesis for: Master of Business AdministrationAdvisor: Antonio Carlos Giuliani"],"references":["329820691_A_Dynamic_Process_Model_of_Service_Quality_From_Expectations_to_Behavioral_Intentions","356823308_Social_Exchange_Theory_in_a_World_of_Transient_Fact","329821972_Developing_Buyer-Seller_Relationships","329637819_Ethical_and_Legal_Foundations_of_Relational_Marketing_Exchanges","329447538_Marketing_in_the_Network_Economy","329447179_Whence_Consumer_Loyalty","329445977_Models_of_Consumer_Satisfaction_Formation_An_Extension","329265498_Relationship_Quality_in_Services_Selling_An_Interpersonal_Influence_Perspective","329264375_Brand_Loyalty_Vs_Repeat_Purchasing_Behavior","329264186_The_American_Customer_Satisfaction_Index_Nature_Purpose_and_Findings"]}