{"id":"283523837_Focusing_Teaching_on_Students_Examining_Student_Perceptions_of_Learning_Strategies","abstract":"This study examined undergraduate and graduate students’ perceptions of the impact of in-class learning activities, out-of-class learning activities, and instructional materials on their learning. Using survey methodology, students anonymously assessed their perceptions of in-class activities, out-of-class activities, and instructional materials as most impactful, helpful, and enjoyable to their learning. Undergraduate college students found Jeopardy games, PowerPoint slides, and checking for understanding/review questions to be most helpful, while 50% often perceived Jeopardy games, Poll Everywhere, videos, and PowerPoint slides as enjoyable active learning strategies. Graduate students perceived small groups, out-of-class writing assignments, and Lino as most helpful to their learning. Additionally, an analysis of student comments about why these strategies were impactful, helpful, and enjoyable revealed 4 themes: fun, learning collaboratively, challenging but helpful, and variety in how students learn. Creating a learner-centered environment that is engaging as well as enjoyable for students positively impacts perceptions of students’ learning, which should encourage teachers to adopt this approach in their own college classrooms. Copyright © National Association for Kinesiology in Higher Education (NAKHE).","authors":["Angela Lumpkin","Rebecca M. Achen","Regan K. Dodd"],"meta":["October 2015Quest -Illinois- National Association for Physical Education in Higher Education- 67(4):352-366","DOI:10.1080/00336297.2015.1082143"],"references":["272525971_Investigating_Marketing_Students'_Perceptions_of_Active_Learning_and_Social_Collaboration_in_Blogs","254338915_Powerpoint_and_Pedagogy_Maintaining_Student_Interest_in_University_Lectures","254075865_Impact_of_the_provision_and_timing_of_instructor-provided_notes_on_university_students'_learning","240699478_Student_Perceptions_of_Active_Learning_in_a_Large_Cross-Disciplinary_Classroom","314709883_Powerpoint_and_Pedagogy_Maintaining_Student_Interest_in_University_Lectures","312455025_Clickers_promote_learning_in_all_kinds_of_classes-small_and_large_graduate_and_undergraduate_lecture_and_lab","303364797_Relationships_between_the_perceived_value_of_instructional_techniques_and_academic_motivation","254338947_Assessing_Student_Perceptions_of_the_Benefits_of_Discussions_in_Small-Group_Large-Class_and_Online_Learning_Contexts","254075914_The_power_of_in-class_debates","236954764_Students'_experiences_of_active_engagement_through_cooperative_learning_activities"]}