{"id":"283541686_An_Efficient_Approach_to_Short-Term_Load_Forecasting_at_the_Distribution_Level","abstract":"Short-term load forecasting at the distribution level predicts the load of substations, feeders, transformers, and possibly customers from half an hour to one week ahead. Effective forecasting is important for the planning and operation of distribution systems. The problem, however, is difficult in view of complicated load features, the large number of distribution-level nodes, and possible switching operations. In this paper, a new forecasting approach within the hierarchical structure is presented to solve these difficulties. Load of the root node at any user-defined subtree is first forecast by a wavelet neural network with appropriate inputs. Child nodes categorized as “regular” and “irregular” based on load pattern similarities are then forecast separately. Load of a regular child node is simply forecast as the proportion from the parent node load forecast while the load of an irregular child node is forecast by an individual neural network model. Switching operation detection and follow-up adjustments are also performed to capture abnormal changes and improve the forecasting accuracy. This new approach captures load characteristics of nodes at different levels, takes advantage of pattern similarities between a parent node and its child nodes, detects abnormalities, and provides high quality forecasts as demonstrated by two practical datasets.","authors":["Xiaorong Sun","Peter B. Luh","Kwok Cheung","Wei Guan"],"meta":["October 2015Power Systems, IEEE Transactions on 31(4):1-12","DOI:10.1109/TPWRS.2015.2489679"],"references":["263128736_Improving_the_Accuracy_of_Bus_Load_Forecasting_by_a_Two-Stage_Bad_Data_Identification_Method","261722458_Time-Series_Data_Mining","261398843_Advanced_Load_Forecast_with_hierarchical_forecasting_capability","322276702_Kalman_filtering_and_neural_networks","308263678_Dimensionality_reduction_for_fast_similarity_search_in_large_time_series_databases","302668345_Method_for_integrating_individual_load_forecasts_into_a_composite_load_forecast_to_present_a_comprehensive_synchronized_and_harmonized_load_forecast","286299385_Distribution_System_Modeling_and_Analysis","268688502_Estimation_with_Applications_to_Tracking_and_Navigation_Theory_Algorithms_and_Software","267441851_Spatial_Load_Forecasting_With_Communication_Failure_Using_Time-Forward_Kriging","261090939_Short-Term_Load_Forecast_Error_Distributions_and_Implications_for_Renewable_Integration_Studies"]}