{"id":"283528332_Helping_Teachers_Create_a_Dynamic_Learning_Environment_Using_Pen-based_Technology","abstract":"There is evidence that Pen-based Technologies (PBTs) can facilitate radical changes that would make it possible to address problems typically associated with lecture-based pedagogical models. In the context of universitylevel Computer Science studies, there is widespread consensus that PBTs-and tablet PCs, in particular-are tools that have great potential for encouraging interaction in the classroom and promoting a far more dynamic learning environment. In view off the complexity of these types of technology and their explosive evolution, it would be advisable to assist teachers who wish to utilize them by developing strategies based on a conceptualization of their educational capabilities. With this objective in mind, this article analyzes the use of concept maps as tools for modeling both the instructional domain and the PBTs domain. To validate the proposed approach, a number of workshops were conducted, in which professors of Engineering were given a presentation on the educational capabilities of these technologies and then had the opportunity to experiment with tablet PCs and other digital ink devices. Participants completed a prequestionnaire at the start of the workshop; its questions were generated from a generic concept map for the instructional domain, and its purpose was to list each professor's instructional requirements. Next, recommendations for use were developed, based on the PBTs concept map, and converted to the questions on a post-questionnaire completed at the end of the workshop, on which the teachers indicated the degree to which they agreed with the recommendations. More than 70 professors from different departments participated in these workshops, and their overall evaluation was quite favorable.©Common Ground, José-Vicente Benlloch-Dualde, Félix Buendía-García, Juan-Carlos Cano, Sara Blanc, Lenin-Guillermo Lemus-Zúñiga.","authors":["J.-V. Benlloch-Dualde","Félix Buendía-García","Juan-Carlos Cano","Sara Blanc"],"meta":["January 2013International Journal of Technologies in Learning 19(2):106-120","DOI:10.18848/2327-0144/CGP/v19i02/49090","Project: Active learning programs"],"references":["283250874_Supporting_the_Generation_of_Guidelines_for_Online_Courses"]}