{"id":"283595158_Programming_Trainings_and_Informatics_Teaching_Through_Online_Contests","abstract":"Promoting computer science though programming is widespread all around the world. However, there are not always enough human resources to support trainings and teaching of programming. At the same time, online programming contests have also spread and are getting accessible to people at large. This paper is about how it is possible to use online programming contests to build trainings and to support the teaching of programming. The paper first reviews how programming contests can be classified. It then proposes classification criteria and applies them to a selection of existing online programming contests. Based on that classification criteria and review, the paper discusses how such contests can be used to build programming trainings and also to support teaching. Finally, the paper presents an online platform that allows people to create a contestant profile to compare them to other users of the platform and to discuss about the contests they took part in. All this work aims at increasing the motivation of people when learning to program and at promoting computer science among young people, with limited human resources and using online social connections between people.","authors":["Sébastien Combéfis","J. Wautelet"],"meta":["July 2014"],"references":["289805286_Type_of_questions_-_The_case_of_computer_science","268293471_The_Role_of_Contests_in_Changing_Informatics_Education_A_Local_View","266882704_Computer_Science_Unplugged_school_students_doing_real_computing_without_computers","230822093_Teaching_Programming_and_Algorithm_Design_with_Pythia_a_Web-Based_Learning_Platform","230707623_Quick_Introduction_to_Programming_with_an_Integrated_Code_Editor_Automatic_Assessment_and_Visual_Debugging_Tool_--_Work_in_Progress","228924746_Belgian_Olympiads_in_Informatics_The_Story_of_Launching_a_National_Contest","220613338_Computer_science_A_language_of_technology","220396184_Computer_Science_Contests_for_Secondary_School_Students_Approaches_to_Classification","283400077_Pushing_the_boundary_of_programming_contests","267250402_Competition-style_programming_problems_for_Computer_Science_Unplugged_activities"]}