{"id":"283576177_De_novo_Identification_of_replication-timing_domains_in_the_human_genome_by_deep_learning","abstract":"Motivation: \nThe de novo identification of the initiation and termination zones-regions that replicate earlier or later than their upstream and downstream neighbours, respectively-remains a key challenge in DNA replication.\n\nResults: \nBuilding on advances in deep learning, we developed a novel hybrid architecture combining a pre-trained, deep neural network and a hidden Markov model (DNN-HMM) for the de novo identification of replication domains using replication timing profiles. Our results demonstrate that DNN-HMM can significantly outperform strong, discriminatively trained Gaussian mixture model-HMM (GMM-HMM) systems and other six reported methods that can be applied to this challenge. We applied our trained DNN-HMM to identify distinct replication domain types, namely the early replication domain (ERD), the down transition zone (DTZ), the late replication domain (LRD) and the up transition zone (UTZ), using newly replicated DNA sequencing (Repli-Seq) data across 15 human cells. A subsequent integrative analysis revealed that these replication domains harbour unique genomic and epigenetic patterns, transcriptional activity and higher-order chromosomal structure. Our findings support the 'replication-domain' model, which states (1) that ERDs and LRDs, connected by UTZs and DTZs, are spatially compartmentalized structural and functional units of higher-order chromosomal structure, (2) that the adjacent DTZ-UTZ pairs form chromatin loops and (3) that intra-interactions within ERDs and LRDs tend to be short-range and long-range, respectively. Our model reveals an important chromatin organizational principle of the human genome and represents a critical step towards understanding the mechanisms regulating replication timing.\n\nAvailability and implementation: \nOur DNN-HMM method and three additional algorithms can be freely accessed at https://github.com/wenjiegroup/DNN-HMM The replication domain regions identified in this study are available in GEO under the accession ID GSE53984.\n\nContact: \nshuwj@bmi.ac.cn or boxc@bmi.ac.cn\n\nSupplementary information: \nSupplementary data are available at Bioinformatics online.","authors":["Feng Liu","Chao Ren","Hao Li","Ping-Kun Zhou"],"meta":["November 2015Bioinformatics 32(5)","DOI:10.1093/bioinformatics/btv643"],"references":["290899211_Discovery_and_Characterization_of_Chromatin_States_for_Systematic_Annotation_of_the_Human_Genome","269768042_RNA_splicing_The_human_splicing_code_reveals_new_insights_into_the_genetic_determinants_of_disease","268788340_Topologically-associating_domains_are_stable_units_of_replication-timing_regulation","263130506_Deep_learning_of_the_tissue-regulated_splicing_code","240308775_Representation_Learning_A_Review_and_New_Perspectives","230671542_DNA_replication_timing_and_selection_shape_the_landscape_of_nucleotide_variation_in_cancer_genomes","221869893_ChromHMM_Automating_chromatin-state_discovery_and_characterization","270051434_Identification_and_Analysis_of_Functional_Elements_in_1_of_The_Human_Genome_by_The_ENCODE_Pilot_Project","230832535_Aberrant_DNA_replication_in_cancer","224226885_Context-Dependent_Pre-Trained_Deep_Neural_Networks_for_Large-Vocabulary_Speech_Recognition"]}