{"id":"283502700_Incremental_Learning_of_NCM_Forests_for_Large-Scale_Image_Classification","abstract":"In recent years, large image data sets such as “ImageNet”, “TinyImages” or ever-growing social networks like “Flickr” have emerged, posing new challenges to image classification that were not apparent in smaller image sets. In particular, the efficient handling of dynamically growing data sets, where not only the amount of training images, but also the number of classes increases over time, is a relatively unexplored problem. To remedy this, we introduce Nearest Class Mean Forests (NCMF), a variant of Random Forests where the decision nodes are based on nearest class mean (NCM) classification. NCMFs not only outperform conventional random forests, but are also well suited for integrating new classes. To this end, we propose and compare several approaches to incorporate data from new classes, so as to seamlessly extend the previously trained forest instead of retraining them from scratch. In our experiments, we show that NCMFs trained on small data sets with 10 classes can be extended to large data sets with 1000 classes without significant loss of accuracy compared to training from scratch on the full data.","authors":["Marko Ristin","Matthieu Guillaumin","Juergen Gall","Luc Van Gool"],"meta":["June 2014","DOI:10.1109/CVPR.2014.467","Conference: The IEEE Conference on Computer Vision and Pattern Recognition (CVPR)"],"references":["265295439_ImageNet_Large_Scale_Visual_Recognition_Challenge","261121664_Interactive_object_detection","259882036_Towards_Good_Practice_in_Large-Scale_Learning_for_Image_Classification","234739284_Random_Sampling_with_a_Reservoir","312656299_Image_classification_using_random_forests_and_ferns","261121847_Hedging_your_bets_Optimizing_accuracy-specificity_trade-offs_in_large_scale_visual_recognition","261121784_Large-scale_knowledge_transfer_for_object_localization_in_ImageNet","258304769_Machine_Learning_Volume_45_Number_1_-_SpringerLink","256837352_Distance-Based_Image_Classification_Generalizing_to_New_Classes_at_Near-Zero_Cost","224297784_Adaptive_Vocabulary_Forests_br_Dynamic_Indexing_and_Category_Learning"]}