{"id":"283619686_Network_comparison_using_directed_graphlets","abstract":"With recent advances in high-throughput cell biology the amount of cellular\nbiological data has grown drastically. Such data is often modeled as graphs\n(also called networks) and studying them can lead to new insights into\nmolecule-level organization. A possible way to understand their structure is by\nanalysing the smaller components that constitute them, namely network motifs\nand graphlets. Graphlets are particularly well suited to compare networks and\nto assess their level of similarity but are almost always used as small\nundirected graphs of up to five nodes, thus limiting their applicability in\ndirected networks. However, a large set of interesting biological networks such\nas metabolic, cell signaling or transcriptional regulatory networks are\nintrinsically directional, and using metrics that ignore edge direction may\ngravely hinder information extraction. The applicability of graphlets is\nextended to directed networks by considering the edge direction of the\ngraphlets. We tested our approach on a set of directed biological networks and\nverified that they were correctly grouped by type using directed graphlets.\nHowever, enumerating all graphlets in a large network is a computationally\ndemanding task. Our implementation addresses this concern by using a\nstate-of-the-art data structure, the g-trie, which is able to greatly reduce\nthe necessary computation. We compared our tool, gtrieScanner, to other\nstate-of-the art methods and verified that it is the fastest general tool for\ngraphlet counting.","authors":["David Aparício","Pedro Ribeiro","Fernando M. A. Silva"],"meta":["November 2015","SourcearXiv"],"references":["304000701_Exploring_the_structure_and_function_of_temporal_networks_with_dynamic_graphlets","274092909_Proper_Evaluation_of_Alignment-Free_Network_Comparison_Methods","265733642_Predicting_disease_associations_via_biological_network_analysis","265213129_Identification_of_Important_Nodes_in_Directed_Biological_Networks_A_Network_Motif_Approach","259934574_Motif_Mining_in_Weighted_Networks","259809686_GR-Align_Fast_and_Flexible_Alignment_of_Protein_3D_Structures_Using_Graphlet_Degree_Similarity","287270618_Discovering_Colored_Network_Motifs","285472809_Network_motifs_in_the_transcriptional_regulation_network_of_Escherichiacoli","282265117_Biological_network_comparison_using_graphlet_degree_distribution","269577621_Exploring_the_structure_and_function_of_temporal_networks_with_dynamic_graphlets"]}