{"id":"283613261_Becoming_a_translator_An_introduction_to_the_theory_and_practice_of_translation_Third_edition","abstract":"Fusing theory with advice and information about the practicalities of translating, Becoming a Translator is the essential resource for novice and practicing translators. The book explains how the market works, helps translators learn how to translate faster and more accurately, as well as providing invaluable advice and tips about how to deal with potential problems, such as stress. The third edition has been revised and updated throughout, offering: Extensive up-to-date information about new translation technologies. Discussions of the emerging \"sociological\" and \"activist\" turns in translation studies. New exercises and examples. Updated further reading sections. a website containing a teacher's guide, the chapter 'The Translator as Learner' and additional resources for translators. Offering suggestions for discussion, activities, and hints for the teaching of translation, the third edition of Becoming a Translator remains invaluable for students and teachers of Translation Studies, as well as those working in the field of translation.","authors":["Douglas Robinson"],"meta":["July 2012","DOI:10.4324/9780203425961"],"references":["271179083_Translation_as_a_Transaction_Cost","329303491_Translating_Women","328852617_Lexicography_terminology_and_translation_Text-based_studies_in_honour_of_Ingrid_Meyer","326844361_Translation_today_Trends_and_perspectives","297316821_Death_in_Translation","277276667_Has_Computerization_Changed_Translation","275978712_Translation_Theory_Today_A_Call_for_Transfer_Theory","274268733_Mapping_the_field_Sociological_perspectives_on_translation","271752400_Translation_and_Political_Engagement","261662687_Some_Thoughts_on_Translation_Imagination_and_Unacademic_Activity","261652782_Translation_as_Performance_Three_Notes","249107744_Gender_and_the_Metaphorics_of_Translation","248451129_Metapragmatics_and_its_discontents","27224961_Habitus_field_and_discourse_Interpreting_as_a_socially_situated_activity"]}