{"id":"283680366_When_Children_Teach_a_Robot_to_Write_An_Autonomous_Teachable_Humanoid_Which_Uses_Simulated_Handwriting","abstract":"This article presents a novel robotic partner which children can teach handwriting. The system relies on the learning by teaching paradigm to build an interaction, so as to stimulate meta-cognition, empathy and increased self-esteem in the child user. We hypothesise that use of a humanoid robot in such a system could not just engage an unmotivated student, but could also present the opportunity for children to experience physically-induced benefits encountered during human-led handwriting interventions, such as motor mimicry. By leveraging simulated handwriting on a synchronised tablet display, a NAO humanoid robot with limited fine motor capabilities has been configured as a suitably embodied handwriting partner. Statistical shape models derived from principal component analysis of a dataset of adult-written letter trajectories allow the robot to draw purposefully deformed letters. By incorporating feedback from user demonstrations, the system is then able to learn the optimal parameters for the appropriate shape models. Preliminary in situ studies have been conducted with primary school classes to obtain insight into children's use of the novel system. Children aged 6-8 successfully engaged with the robot and improved its writing to a level which they were satisfied with. The validation of the interaction represents a significant step towards an innovative use for robotics which addresses a widespread and socially meaningful challenge in education.","authors":["Deanna Hood","Séverin Lemaignan","Pierre Dillenbourg"],"meta":["March 2015","DOI:10.1145/2696454.2696479"],"references":["236272973_The_Physical_Presence_of_a_Robot_Tutor_Increases_Cognitive_Learning_Gains","232567260_Treatment_of_handwriting_problems_in_beginning_writers_Transfer_from_handwriting_to_composition","232431135_Peer-assisted_learning_interventions_with_elementary_school_students_A_meta-analytic_review","288961126_A_brief_introduction_to_statistical_shape_analysis","270717893_Handwriting_Error_Patterns_of_Children_with_Mild_Motor_Difficulties","266888203_Children_Teach_a_Care-Receiving_Robot_to_Promote_Their_Learning_Field_Experiments_in_a_Classroom_for_Vocabulary_Learning","261271311_A_method_of_motion_reproduction_for_calligraphy_education","261048536_Tf_The_transform_library","258140928_Learning_to_select_and_generalize_striking_movements_in_robot_table_tennis","237775271_A_Brief_Introduction_to_Statistical_Shape_Analysis"]}