{"id":"283638950_An_Algorithm_for_the_Segmentation_of_Highly_Abnormal_Hearts_Using_a_Generic_Statistical_Shape_Model","abstract":"Statistical shape models (SSMs) have been widely employed in cardiac image segmentation. However, in conditions that induce severe shape abnormality and remodeling, such as in the case of pulmonary hypertension (PH) or hypertrophic cardiomyopathy (HCM), a single SSM is rarely capable of capturing the anatomical variability in the extremes of the distribution. This work presents a new algorithm for the segmentation of severely abnormal hearts. The algorithm is highly flexible, as it does not require a priori knowledge of the involved pathology or any specific parameter tuning to be applied to the cardiac image under analysis. The fundamental idea is to approximate the gross effect of the abnormality with a virtual remodeling transformation between the patient-specific geometry and the average shape of the reference model (e.g., average normal morphology). To define this mapping, a set of landmark points are automatically identified during boundary point search, by estimating the reliability of the candidate points. With the obtained transformation, the feature points extracted from the patient image volume are then projected onto the space of the reference SSM, where the model is used to effectively constrain and guide the segmentation process. The extracted shape in the reference space is finally propagated back to the original image of the abnormal heart to obtain the final segmentation. Detailed validation with patients diagnosed with PH and HCM shows the robustness and flexibility of the technique for the segmentation of highly abnormal hearts of different pathologies.","authors":["Xènia Albà","Marco Pereanez","Corne Hoogendoorn","Andrew J Swift"],"meta":["November 2015IEEE Transactions on Medical Imaging 35(3)","DOI:10.1109/TMI.2015.2497906"],"references":["269284471_Rapid_D-Affine_Biventricular_Cardiac_Function_with_Polar_Prediction","312756085_Reusability_of_Statistical_Shape_Models_for_the_Segmentation_of_Severely_Abnormal_Hearts","291154059_Principal_warps_Thin-plate_splines_and_the_decomposition_of_deformations","282059577_A_review_of_segmentation_methods_in_short_axis_cardiac_MR_images","281569161_Cardiac_MR_Assessment_of_Right_Ventricular_Function_in_Acquired_Heart_Disease_Factors_of_Variability","267737919_Multi-atlas_Spectral_PatchMatch_Application_to_Cardiac_Image_Segmentation","267456302_Right_Ventricle_Segmentation_From_Cardiac_MRI_A_Collation_Study","265967684_Multi-Atlas_Segmentation_with_Augmented_Features_for_Cardiac_MR_Images","263049053_A_Framework_for_the_Merging_of_Pre-Existing_and_Correspondenceless_3D_Statistical_Shape_Models","262165974_Multi-atlas_Propagation_Whole_Heart_Segmentation_from_MRI_and_CTA_Using_a_Local_Normalised_Correlation_Coefficient_Criterion"]}