{"id":"283755229_Stability_Analysis_of_a_Quarantined_Epidemic_Model_with_Latent_and_Breaking-Out_over_the_Internet","abstract":"In this paper, a new epidemic model, known as the SLBQRS model, is proposed in a computer network with Latent and Breaking-out periods of a virus in its life cycle. Furthermore, an infected computer will be referred to as latent or breaking-out depending on whether all viruses staying in it are in their respective latent periods or at least one virus staying in it is in its breaking-out period. In the real world there exists no infected computer at all that has no infectivity. A breaking-out computer can get treated with a higher probability, because it usually suffers from a marked performance degradation or even breaks down, which can be perceived evidently by the user. The quarantine is a method of isolating the most infected nodes from the network and reduce the spreading virus till they get recovered. The qualitative properties of this model are investigated. The result shows that the dynamic behavior of the model is determined by a threshold R 0. Specially, virus-free equilibrium is globally asymptotically stable if R 0 ≤ 1. Next, the sensitivity analysis of R 0 to six system parameters is also analyzed. On this basis, a collection of strategies are advised for eradicating viruses spreading across the Internet effectively. Threshold R 0 , equilibrium and their stability are discussed in terms of the Jacobian of the system. Numerical methods and MATLAB are employed to solve and simulate the system of equations developed and analysis of the model gives remarkable exposure.","authors":["Munna Kumar","Bimal Kumar Mishra","T. C. Panda"],"meta":["July 2015","DOI:10.14257/ijhit.2015.8.7.12"],"references":["258388476_An_SLBRS_Model_with_Vertical_Transmission_of_Computer_Virus_over_the_Internet","258386615_Propagation_Behavior_of_Virus_Codes_in_the_Situation_That_Infected_Computers_Are_Connected_to_the_Internet_with_Positive_Probability","258382874_Towards_the_Epidemiological_Modeling_of_Computer_Viruses","223458007_SEIRS_epidemic_model_with_delay_for_transmission_of_malicious_objects_in_computer_network","257591144_A_computer_virus_model_with_graded_cure_rates","257591026_A_novel_computer_virus_model_and_its_dynamics","251627224_Delayed_computer_virus_propagation_model_and_its_dynamics","241683757_A_novel_computer_virus_propagation_model_and_its_dynamics","235899026_Fuzzy_epidemic_model_for_the_transmission_of_worms_in_computer_network","223929513_Stability_analysis_of_a_SEIQV_epidemic_model_for_rapid_spreading_worms"]}