{"id":"283780932_Supporting_Student_Learning_in_Computer_Science_Education_via_the_Adaptive_Learning_Environment_ALMA","abstract":"This study presents the ALMA environment (Adaptive Learning Models from texts and Activities). ALMA supports the processes of learning and assessment via: (1) texts differing in local and global cohesion for students with low, medium, and high background knowledge; (2) activities corresponding to different levels of comprehension which prompt the student to practically implement different text-reading strategies, with the recommended activity sequence adapted to the student’s learning style; (3) an overall framework for informing, guiding, and supporting students in performing the activities; and; (4) individualized support and guidance according to student specific characteristics. ALMA also, supports students in distance learning or in blended learning in which students are submitted to face-to-face learning supported by computer technology. The adaptive techniques provided via ALMA are: (a) adaptive presentation and (b) adaptive navigation. Digital learning material, in accordance with the text comprehension model described by Kintsch, was introduced into the ALMA environment. This material can be exploited in either distance or blended learning.","authors":["Alexandra Gasparinatou","Maria Grigoriadou"],"meta":["October 2015Systems 3(4):237-263","DOI:10.3390/systems3040237"],"references":["314419537_An_Adaptive_Feedback_Framework_to_Support_Reflection_Guiding_and_Tutoring","255582052_Scaffolding_Deep_Comprehension_Strategies_Through_PointQuery_AutoTutor_and_iSTART","254338739_The_Kolb_Model_Modified_for_Classroom_Activities","302350603_Experiential_Learning_Spaces","286826391_Learning_from_Texts_in_Computer_Science","285111599_When_is_reading_just_as_effective_as_one-on-one_interactive_human_tutoring","284503687_The_weave_of_motivation_and_self-regulated_learning","279430639_Exploring_Information_About_Concepts_by_Asking_Questions","267831544_The_impact_of_different_learning_styles_on_learners'_studying_preferences_in_the_domain_of_computer_local_networks","262889832_Exploring_the_effect_of_background_knowledge_and_text_cohesion_on_learning_from_texts_in_computer_science"]}