{"id":"283749931_Deep_Learning_Face_Representation_from_Predicting_10000_Classes","abstract":"This paper proposes to learn a set of high-level feature representations through deep learning, referred to as Deep hidden IDentity features (DeepID), for face verification. We argue that DeepID can be effectively learned through challenging multi-class face identification tasks, whilst they can be generalized to other tasks (such as verification) and new identities unseen in the training set. Moreover, the generalization capability of DeepID increases as more face classes are to be predicted at training. DeepID features are taken from the last hidden layer neuron activations of deep convolutional networks (ConvNets). When learned as classifiers to recognize about 10, 000 face identities in the training set and configured to keep reducing the neuron numbers along the feature extraction hierarchy, these deep ConvNets gradually form compact identity-related features in the top layers with only a small number of hidden neurons. The proposed features are extracted from various face regions to form complementary and over-complete representations. Any state-of-the-art classifiers can be learned based on these high-level representations for face verification. 97:45% verification accuracy on LFW is achieved with only weakly aligned faces.","authors":["Yi Sun","Xiaogang Wang","Xiaoou Tang"],"meta":["September 2014","DOI:10.1109/CVPR.2014.244"],"references":["270283023_Signature_Verification_using_a_Siamese_Time_Delay_Neural_Network","319770626_Multi-column_Deep_Neural_Networks_for_Image_Classification","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","309553422_Deep_Gaussian_Processes","269250424_Fisher_Vector_Faces_in_the_Wild","267960550_ImageNet_Classification_with_Deep_Convolutional_Neural_Networks","266341964_Tom-vs-Pete_Classifiers_and_Identity-Preserving_Alignment_for_Face_Verification","263564119_DeepFace_Closing_the_Gap_to_Human-Level_Performance_in_Face_Verification","262405245_Deep_nonlinear_metric_learning_with_independent_subspace_analysis_for_face_verification","262399390_A_Practical_Transfer_Learning_Algorithm_for_Face_Verification"]}