{"id":"283772956_Algorithmic_and_logical_thinking_development_Base_of_programming_skills","abstract":"This paper is based on rich experience gained in the area of computer science education and it could serve as an inspirational material directed to all educators developing students' algorithmic thinking and programming skills. The foundation a developer gains at the beginning of his/her career plays a crucial role. An essential part of studies at faculties preparing students in the area of computer science is the development of student's ability to think algorithmically. Students must be able to create various algorithms solving given problems starting with easy ones and consecutively increase their algorithmic knowledge and shifts during studies till the level where they deeply understand much more complex algorithms. The aim of this paper is to introduce our approach that has proven to be successful in the optimization of teaching and learning a subject developing algorithmic thinking of beginners. This is followed by a discussion of the benefits of puzzles and logical games, solved within subjects, dealing with graph algorithms and enabling further development of students' algorithmic thinking as well as logical thinking and imagination, i.e. skills needed for deeper understanding more complex algorithms.","authors":["Eva Milková","A. Hùlková"],"meta":["February 2013"],"references":["228846683_Constructing_knowledge_in_graph_theory_and_combinatorial_optimization","228697082_Multimedia_applications_and_their_benefit_for_teaching_and_learning_at_universities","215443909_Programovaci_jazyk_pro_podporu_vyuky_algoritmu","4266183_Algorithms_The_Base_of_Programming_Skills","290674035_BFS_tree_and_x-y_shortest_paths_tree","284517059_Multimedia_Tools_for_the_Development_of_Algorithmic_Thinking","262176683_Designing_test_engine_for_computer-aided_software_testing_tools","221440492_Complexity_of_the_Game_of_Sprouts","47640811_Algoritmy_zakladni_konstrukce_v_prikladech_a_jejich_vizualizace"]}