{"id":"283897669_Research_characteristics_and_status_on_social_media_in_China_A_bibliometric_and_co-word_analysis","abstract":"This study aims to map the intellectual structure of social media research in China from 2006 to 2013. Bibliometric and co-word analysis were employed to reveal the characteristics and status on social media research in China. Data was collected from China Academic Journals Full-text Database during the period of 2006–2013. In bibliometric analysis, descriptors of years, themes, subjects, institutions and authors were applied to obtain the research characteristics of social media. In co-word analysis, hierarchical cluster analysis, strategic diagram and social network analysis were adopted. Main results show that, a total of 3178 CSSCI papers on social media have risen yearly and exponentially. The most and distinctive themes were microblog, blog, virtual community and social networking site. The most common subject was News and media, followed by Library, information and digital library, Computer software and application. Wuhan University, Renmin University of China and Nanjing University ranked the top three on the most publications. And the distribution of number of authors with different publications obeys power-law distribution. Moreover, the number of keyword frequency obeys power-law distribution. The core keywords include social media, traditional media, Internet, dissemination and user. There are ten research directions on social media in China, some of which are highly correlated. Generally, the relatively dispersive distribution of research topics suggests the imbalanced development on social media research in China. Some hot topics are well-developed and tend to be mature, a few topics have a great potential for further development, and many other topics are marginal and immature.","authors":["Chunmei Gan","Weijun Wang"],"meta":["August 2015Scientometrics 105(2)","DOI:10.1007/s11192-015-1723-2"],"references":["283073224_Measuring_the_Degree_of_Corporate_Social_Media_Use","260528413_Focus_on_China_The_Current_Status_of_Entrepreneurship_Research_in_China","257663222_Social_media-based_systems_An_emerging_area_of_information_systems_research_and_practice","227413605_Social_Media_Get_Serious_Understanding_the_Functional_Building_Blocks_of_Social_Media","222403703_Users_of_the_World_Unite_The_Challenges_and_Opportunities_of_Social_Media","259356299_Smart_CDSS_integration_of_Social_Media_and_Interaction_Engine_SMIE_in_healthcare_for_chronic_disease_patients","257663408_A_co-word_analysis_of_library_and_information_science_in_China","257662989_A_co-word_analysis_of_digital_library_field_in_China","257252942_The_role_of_social_media_in_higher_education_classes_real_and_virtual_-_A_literature_review","222513668_Bibliometric_Cartography_of_Information_Retrieval_Research_by_Using_Co-Word_Analysis"]}