{"id":"283833263_Universitelerde_web_sitelerinin_kurumsal_iletisim_amacli_kullanimi_devlet_ve_vakif_universitelerinin_web_siteleri_uzerine_karsilastirmali_bir_analiz_Usage_of_the_web_sites_with_the_purpose_of_corporat","abstract":"Internet, which is the most important factor of the information age, provides the ability to reach information without any dependence on time and space. These abilities bring the responsibility for the institutions to inform targeted groups in the most correct and fastest way by their websites. Nowadays, the institutions are taking the freedom of the informed by the target groups into account and inform in the most detailed way about their organizational structure, products and services of their websites. Especially the universities which have a huge target groups could find the opportunity to advertise and inform about their selves. The making use of the institutional web sites in an effective way provides an addition advantage for their image. In this study, we care about the importance of the web sites for the presentation of the universities, and we made a comparative analyze between Turkish state and Turkish foundation universities about the use of the web sites. According to the scoring index created, in the criteria of accessibility, navigability, actuality, visibility of the presentation properties, was observed to be superior state universities. On delivery of the another criterion in the presentation properties, foundation universities is more good than others. Websites of the universities included in the study, were able to collect equal scores criteria of participation and campaigning of the funciton properties. It was seen superiority of state universities in the criterion of information / data flow and superiority of foundation universities in the criterion of communication net. In the study, content analysis method is based on and, state universities are relatively determined efficient use of the websites more than foundation universities in the context of corporate communication and presentation","authors":["Halil İbrahim Koç"],"meta":["October 2015Gümüşhane Üniversitesi İletişim Fakültesi Elektronik Dergisi 3(2)","DOI:10.19145/guifd.86451"],"references":["281900640_SIYASI_PARTILERIN_SIYASAL_ILETISIM_ARACI_OLARAK_WEB_SAYFALARINI_KULLANIMI","242733857_Karsilastirmali_Bir_Yaklasimla_Kamu_Yonetimi_ve_Ozel_Sektorde_Halkla_Iliskiler","318283754_Halkla_Iliskiler_Nedir_9_Baski","263385809_Organization_of_Corporate_Web_Pages_Publics_and_Functions","222174484_The_World_Wide_Web_as_a_public_relations_medium_The_use_of_research_planning_and_evaluation_in_Web_site_development"]}