{"id":"283853877_Considering_Context_in_the_Design_of_Intelligent_Systems_Current_Practices_and_Suggestions_for_Improvement","abstract":"Ubiquitous sensing allows systems to exploit almost any kind of context, and enables the design of intelligent systems that are aware of their context and adapt their behavior accordingly. As such systems have a number of properties, which distinguish them from traditional systems, their design requires a new approach to requirements engineering and to product development. While existing contributions concentrate on individual aspects in the design process, there is a lack of a holistic perspective on the design of intelligent systems. Considering the entire design process, would allow for the creation of better functioning designs, as has been demonstrated in various fields of system design. Furthermore, little is known about how people design intelligent systems. A deep understanding about design practices is, though, a prerequisite for coming up with systematic improvements. The contribution of this paper is twofold: First, based on interviews, we analyze the design processes undertaken by designers, and present five underlying process archetypes. We focus on how designers identify, select, and consider context across the entire design process. Second, we propose an improved design process for intelligent systems that aims at supporting system designers in their design task in order to serve an organization's, and/or users’ needs.","authors":["Christine Bauer","Anind K. Dey"],"meta":["February 2016Journal of Systems and Software 112:26-47","DOI:10.1016/j.jss.2015.10.041","Project: Contextualization and context-adaptivity"],"references":["278798270_Unified_and_Conceptual_Context_Analysis_in_Ubiquitous_Environments","274074382_Towards_a_Better_Understanding_of_Context_and_Context-Awareness","317953485_Case_study_research_design_and_methods","314207577_Mobile_Customer_Relationship_Management_mCRM","313730983_The_computer_for_the_21st_century","291577009_Consumer_Health_Informatics_and_Personal_Health_Records","291246069_Intelligent_Tools_for_Reducing_Medication_Dispensing_and_Administration_Error","284543783_Software_Engineering_Economics","280940018_Pattern_Recognition_and_Machine_Learning","278699051_Towards_a_Better_Understanding_of_Context_and_Context-Awareness"]}