{"id":"283876676_Fractional_hedonic_games_Individual_and_group_stability","abstract":"Coalition formation provides a versatile framework for analyzing cooperative behavior in multi-agent systems. In particular, hedonic coalition formation has gained considerable attention in the literature. An interesting class of hedonic games recently introduced by Aziz et al. [3] are fractional hedonic games. In these games, the utility an agent assigns to a coalition is his average valuation for the members of his coalition. Three common notions of stability in hedonic games are core stability, Nash stability, and individual stability. For each of these notions we show that stable partitions may fail to exist in fractional hedonic games. For core stable partitions this holds even when all players only have symmetric zero/one valuations (\"mutual friendship\"). We then leverage these counter-examples to show that deciding the existence of stable partitions (and therefore also computing stable partitions) is NP-hard for all considered stability notions. Moreover, we show that checking whether the valuation functions of a fractional hedonic game induce strict preferences over coalitions is coNP-complete. Copyright © 2015, International Foundation for Autonomous Agents and Multiagent Systems (www.ifaamas.org). All rights reserved.","authors":["Florian Brandl","F. Brandt","Martin Strobel"],"meta":["January 2015"],"references":["286314532_Fractional_Hedonic_Games","281886722_Nash_Stability_in_Fractional_Hedonic_Games","262165361_On_the_complexity_of_variations_of_equal_sum_subsets","262161927_On_defining_and_computing_communities","257000959_Two_hardness_results_for_core_stability_in_hedonic_coalition_formation_games","256997571_Woeginger_G_A_hardness_result_for_core_stability_in_additive_hedonic_games_Math_Soc_Sci_652_101-104","233871373_Core_Stability_in_Hedonic_Coalition_Formation","230818214_Dynamic_Models_of_Segregation","228057735_Computers_And_Intractability_A_Guide_to_the_Theory_of_NP-Completeness","226708433_Computing_Stable_Outcomes_in_Hedonic_Games"]}