{"id":"283806394_La_teoria_de_la_comunicacion_de_Marshall_McLuhan_el_butronero","abstract":"En este trabajo se discuten las implicaciones metodológicas derivadas de frases célebres de Marshall McLuhan, como “No tengo una teoría de la comunicación” y “No utilizo teorías en mi trabajo”. En ausencia de una teoría, la otra manera de trabajar es con la técnica investigativa y de observación: primero que todo, la evidencia; luego, mucho después, la teoría (si es que para ese momento, en efecto, es necesaria). Sin una teoría como guía, artistas y poetas influyeron a McLuhan en el desarrollo de aquellas herramientas analíticas y conceptuales en las cuales se basó para examinar el medio y la comunicación. Para este procedimiento, inició tomando un problema y ahondando en él con un paquete de herramientas en busca de algún elemento para abrir las puertas hacia el esclarecimiento. Su herramienta principal de análisis fue la crítica práctica, la cual veía como una especie de navaja suiza que trabajaba de manera incisiva en todas las artes y las diferentes áreas de la cultura, desde las más intelectuales hasta las más simples. El argumento que surge del análisis de las técnicas investigativas de McLuhan es que muchos de los enigmas de los medios y la cultura moderna se entienden con mayor eficacia con la investigación que trasciende los límites que impone tratar de presentar un argumento en favor o en contra de una teoría particular. Si se inicia por la teoría, se inicia con la respuesta; si se inicia por la observación, se inicia con los interrogantes.","authors":["Eric McLuhan"],"meta":["November 2015Palabra Clave 18(4):977-1007","DOI:10.5294/pacla.2015.18.4.2"],"references":["302429718_An_Introduction_for_my_Plays","271148796_The_Bias_of_Communication","270366372_The_Western_Canon_The_Books_and_School_of_the_Ages","270177640_The_Literary_Essays_of_Ezra_Pound","252206758_Black_Holes_and_Baby_Universes_and_Other_Essays","248065723_The_Western_Canon_The_Books_and_School_of_the_Ages","49476809_Advancement_of_learning_novum_or_ganum_New_Atlantis","31739487_Understanding_Media_The_Extensions_of_Man_M_McLuhan"]}