{"id":"283878600_A_19TOPS_and_564GOPSW_heterogeneous_multicore_SoC_with_color-based_object_classification_accelerator_for_image-recognition_applications","abstract":"Image recognition technologies have gained prominence in a variety of fields, such as automotive and surveillance, with dedicated image-recognition ICs being developed recently [1-2]. Image recognition ICs for an advanced driver assistance system (ADAS) have also been proposed [3]. However, future ADAS applications must support greater numbers of real-time recognition processes simultaneously, with higher detection rates and lower false-positive rates. For instance, adaptive cruise control (ACC), an application of ADAS, comprises many image recognition processes, such as pedestrian detection (PD), vehicle detection (VD), general obstacle detection (GOD), lane detection (LD), traffic light recognition (TLR), and traffic sign recognition (TSR). ACC also requires high detection accuracy to prevent unnecessary braking or acceleration. To satisfy these requirements, we have developed an SoC with two 4-core processor clusters and 14 hard-wired accelerators. It is designed to realize the six recognition processes (PD, VD, GOD, LD, TLR, and TSR) for ACC and automatic high beam (AHB) for headlight control. It achieves 1.9TOPS peak performance in 3.37W. This low power consumption enables the SoC to operate with passive cooling in a high-temperature automotive environment.","authors":["Jun Tanabe","Sano Toru","Yutaka Yamada","Tomoki Watanabe"],"meta":["March 2015","DOI:10.1109/ISSCC.2015.7063059"],"references":["273396606_A_122_TOPS_and_152_mWMHz_Augmented_Reality_Multicore_Processor_With_Neural_Network_NoC_for_HMD_Applications","271430419_A_122TOPS_and_152mWMHz_augmented_reality_multi-core_processor_with_neural_network_NoC_for_HMD_applications","261500100_A_646GOPSW_multi-classifier_many-core_processor_with_cortex-like_architecture_for_super-resolution_recognition","254023882_A_464GOPS_620GOPSW_heterogeneous_multi-core_SoC_for_image-recognition_applications","225144423_Object_Classification_Using_Heterogeneous_Co-occurrence_Features","221411660_Co-occurrence_Histograms_of_Oriented_Gradients_for_Pedestrian_Detection"]}