{"id":"283887872_Approximate_Radix-8_Booth_Multipliers_for_Low-Power_and_High-Performance_Operation","abstract":"The Booth multiplier has been widely used for high performance signed multiplication by encoding and thereby reducing the number of partial products. A multiplier using the radix-4 (or modified Booth) algorithm is very efficient due to the ease of partial product generation, whereas the radix-8 Booth multiplier is slow due to the complexity of generating the odd multiples of the multiplicand. In this paper, this issue is alleviated by the application of approximate designs. An approximate 2-bit adder is deliberately designed for calculating the sum of 1× and 2× of a binary number. This adder requires a small area, a low power and a short critical path delay. Subsequently, the 2-bit adder is employed to implement the less significant section of a recoding adder for generating the triple multiplicand with no carry propagation. In the pursuit of a trade-off between accuracy and power consumption, two signed 16× 16 bit approximate radix-8 Booth multipliers are designed using the approximate recoding adder with and without the truncation of a number of less significant bits in the partial products. The proposed approximate multipliers are faster and more power efficient than the accurate Booth multiplier. The multiplier with 15-bit truncation achieves the best overall performance in terms of hardware and accuracy when compared to other approximate Booth multiplier designs. Finally, the approximate multipliers are applied to the design of a low-pass FIR filter and they show better performance than other approximate Booth multipliers.","authors":["Honglan Jiang","Jie Han","Fei Qiao","Fabrizio Lombardi"],"meta":["January 2015IEEE Transactions on Computers 65(8):1-1","DOI:10.1109/TC.2015.2493547"],"references":["300630607_A_Comparative_Review_and_Evaluation_of_Approximate_Adders","273394839_Design_and_Analysis_of_Approximate_Compressors_for_Multiplication","228977063_A_Radix-8_Multiplier_Unit_Design_for_Specific_Purpose","309309616_A_low-power_high-performance_approximate_multiplier_with_configurable_partial_error_recovery","271431180_High_accuracy_approximate_multiplier_with_error_correction","269311164_A_low-power_high-performance_approximate_multiplier_with_configurable_partial_error_recovery","261378723_Approximate_computing_An_emerging_paradigm_for_energy-efficient_design","260585402_New_Metrics_for_the_Reliability_of_Approximate_and_Probabilistic_Adders","252056747_Area-Effective_and_Power-Efficient_Fixed-Width_Booth_Multipliers_Using_Generalized_Probabilistic_Estimation_Bias","224662143_A_fast_hybrid_multiplier_combining_Booth_and_WallaceDadda_algorithms"]}