{"id":"283843661_No-reference_visual_quality_assessment_for_image_inpainting","abstract":"Inpainting has received a lot of attention in recent years and quality assessment is an important task to evaluate different image reconstruction approaches. In many cases inpainting methods introduce a blur in sharp transitions in image and image contours in the recovery of large areas with missing pixels and often fail to recover curvy boundary edges. Quantitative metrics of inpainting results currently do not exist and researchers use human comparisons to evaluate their methodologies and techniques. Most objective quality assessment methods rely on a reference image, which is often not available in inpainting applications. Usually researchers use subjective quality assessment by human observers. It is difficult and time consuming procedure. This paper focuses on a machine learning approach for no-reference visual quality assessment for image inpainting based on the human visual property. Our method is based on observation that Local Binary Patterns well describe local structural information of the image. We use a support vector regression learned on assessed by human images to predict perceived quality of inpainted images. We demonstrate how our predicted quality value correlates with qualitative opinion in a human observer study. Results are shown on a human-scored dataset for different inpainting methods.","authors":["Viacheslav Voronin","V.A. Frantc","V.I. Marchuk","Alexander Sherstobitov"],"meta":["March 2015","DOI:10.1117/12.2076507"],"references":["313213859_Perceptual_quality_assessment_for_color_image_inpainting","267726078_MACHINE_LEARNING_SOLUTIONS_FOR_OBJECTIVE_VISUAL_QUALITY_ASSESSMENT","256094562_Perceptual_Quality_Assessment_for_Color_Image_Inpainting","238183352_An_Image_Inpainting_Technique_Based_on_the_Fast_Marching_Method","221678002_TID2008_-_A_Database_for_Evaluation_of_Full-Reference_Visual_Quality_Assessment_Metrics","221364530_Saliency_Detection_A_Spectral_Residual_Approach","269321811_Machine_learning_approach_for_objective_inpainting_quality_assessment","228569223_Visual_salience_metrics_for_image_inpainting","224254806_Learning_a_Blind_Measure_of_Perceptual_Image_Quality","221123007_Eye_tracking_based_perceptual_image_inpainting_quality_analysis"]}