{"id":"283864390_Student_performance_improvement_using_interactive_textbooks_A_three-university_cross-semester_analysis","abstract":"We conducted studies to determine whether introducing an interactive textbook into introductory STEM (science, technology, engineering, math) courses can improve student grades. An interactive textbook has substantially less text than a traditional textbook, instead having numerous embedded question sets designed for learning and not quizzing, numerous animations of key concepts, and some built-in tools. The studies included four introductory computer-programming courses at three research universities: C++ at Univ. of Michigan, C/C++ at Univ. of Arizona, and MATLAB at Univ. of California at Davis. For each, two course offerings were compared, the first using a static textbook or static web resources, and the second using an interactive textbook. Most other course features remained the same between offerings, including the teacher and the semester offering (e.g., Spring semester), or were very similar; differences are noted. We analyzed final course grades and performance on specific course items using nonparametric analysis with conservative Bonferroni adjustment for multiple tests. Across all courses involving 1,945 students, course grades improved by 0.28 points on a 0-4 point scale (p-value < 0.001), or 1/4 letter grade, from static to interactive textbook. More importantly, students in the lower quartile of the course improved by 0.38 points (p-value < 0.001), or 1/3 letter grade. Exam scores improved by 13.6% (p-value < 0.001) and project scores by 7.4% (p-value < 0.001) from static to interactive textbooks. 98% of the students subscribed to the interactive textbook and completed at least some activities on the interactive textbook. The average student completed 87% of the assigned activities in the interactive textbook.","authors":["A.D. Edgcomb","Frank Vahid","R. Lysecky","A. Knoesen"],"meta":["January 2015"],"references":["261854838_How_we_teach_impacts_student_learning_Peer_instruction_vs_lecture_in_CS0","3050342_New_approach_to_interactive_tutorial_software_for_engineering_education","3050115_Interactive_Software_for_Undergraduate_Electromagnetics"]}