{"id":"283979975_Designing_digital_fabrication_learning_environments_for_Bildung_Implications_from_ten_years_of_physical_computing_workshops","abstract":"The first programmable bricks appeared about 30 years ago, and attributed to constructionist hands-on learning. With the upcoming of FabLab initiatives and the maker movement, learning activities with digital fabrication technologies have now gained importance and spread over the world. Educational concepts that contribute not only to acquisition of skills but also to Bildung (i.e. deep and sustainable learning) are demanded more than ever.For more than a decade, we have designed, conducted and evaluated constructionist learning environments for digital fabrication with physical computing material focusing on children. In the course of our research, we identified core ideas to facilitate Bildung that are summarized as be-greifbarkeit (being 'graspable'), imagineering and self-efficacy. In this article, we elucidate these principles and show how they occur and can be facilitated in learning environments for digital fabrication with programmable construction kits. By further applying the ideas to novel production technologies, we identify challenges and give implications for integrated educational and technology designs for young people that take into account the unique qualities of digital fabrication technologies for Bildung.","authors":["Eva-Sophie Katterfeldt","Nadine Dittert","Heidi Schelhowe"],"meta":["September 2015International Journal of Child-Computer Interaction 5","DOI:10.1016/j.ijcci.2015.08.001"],"references":["281495128_Digital_Fabrication_and_'Making'_in_Education_The_The_Democratization_of_Invention","276849083_A_Low-Cost_and_Simple_Arduino-Based_Educational_Robotics_Kit","350260192_DIGITAL_REALITIES_PHYSICAL_ACTION_AND_DEEP_LEARNING_FABLABS_AS_EDUCATIONAL_ENVIRONMENTS","345403119_The_Aesthetics_of_Imagination_in_Design","318494168_Epistemological_Pluralism_Styles_and_Voices_within_the_Computer_Culture","316823281_Self-efficacy_the_exercise_of_control","288832190_What_Can_Residential_Research-Based_Universities_Learn_about_their_Core_Competencies_from_MOOCs_Massive_Open_Online_Course","288030545_Origins_and_guiding_principles_of_the_Computer_Clubhouse","272142606_TechSportiv_Technologiekonstruktion_Ein_Gegenstand-mit-dem-man-denkt_fur_menschliche_Bewegung","268146666_TechSportiv_-_Constructing_Objects-To-Think-With_for_Physical_Education"]}