{"id":"283912710_Clustering_and_Mixing_Times_for_Segregation_Models_on_Z_2","abstract":"The Schelling segregation model attempts to explain possible causes of racial segregation in cities. Schelling considered residents of two types, where everyone prefers that the majority of his or her neighbors are of the same type. He showed through simulations that even mild preferences of this type can lead to segregation if residents move whenever they are not happy with their local environments. We generalize the Schelling model to include a broad class of bias functions determining individuals happiness or desire to move, called the General Influence Model. We show that for any influence function in this class, the dynamics will be rapidly mixing and cities will be integrated (i.e., there will not be clustering) if the racial bias is sufficiently low. Next we show complementary results for two broad classes of influence functions: Increasing Bias Functions (IBF), where an individual's likelihood of moving increases each time someone of the same color leaves (this does not include Schelling's threshold models), and Threshold Bias Functions (TBF) with the threshold exceeding one half, reminiscent of the model Schelling originally proposed. For both classes (IBF and TBF), we show that when the bias is sufficiently high, the dynamics take exponential time to mix and we will have segregation and a large \"ghetto\" will form. Copyright","authors":["Prateek Bhakta","Sarah Miracle","Dana Randall"],"meta":["January 2014","DOI:10.1137/1.9781611973402.24","In book: Proceedings of the Twenty-Fifth Annual ACM-SIAM Symposium on Discrete Algorithms (pp.327-340)"],"references":["220780388_Sampling_Biased_Lattice_Configurations_using_Exponential_Metrics","6648612_A_Physical_Analogue_of_the_Schelling_Model","228525909_Computing_the_complexity_for_Schelling_segregation_models","225435563_Mean_Field_Analysis_of_Low-Dimensional_Systems","225159864_Rigorous_Analysis_Of_Discontinuous_Phase_Transitions_Via_Mean-Field_Bounds","46453993_Dynamic_Models_of_Residential_Segregation_An_Analytical_Solution","2178047_Ising_Schelling_and_Self-Organising_Segregation"]}