{"id":"283971854_Cache_Locality-Centric_Parallel_String_Matching_on_Many-Core_Accelerator_Chips","abstract":"Aho-Corasick (AC) algorithm is a multiple patterns string matching algorithm commonly used in computer and network security and bioinformatics, among many others. In order to meet the highly demanding computational requirements imposed on these applications, achieving high performance for the AC algorithm is crucial. In this paper, we present a high performance parallelization of the AC on the many-core accelerator chips such as the Graphic Processing Unit (GPU) from Nvidia and the Intel Xeon Phi. Our parallelization approach significantly improves the cache locality of the AC by partitioning a given set of string patterns into multiple smaller sets of patterns in a space-efficient way. Using the multiple pattern sets, intensive pattern matching operations are concurrently conducted with respect to the whole input text data. Compared with the previous approaches where the input data is partitioned amongst multiple threads instead of partitioning the pattern set, our approach significantly improves the performance. Experimental results show that our approach leads up to 2.73 times speedup on the Nvidia K20 GPU and 2.00 times speedup on the Intel Xeon Phi compared with the previous approach. Our parallel implementation delivers up to 693 Gbps throughput performance on the K20.","authors":["Nhat-Phuong Tran","Myungho Lee","Hoon Choi"],"meta":["October 2015Scientific Programming 2015:1-20","DOI:10.1155/2015/937694"],"references":["262400182_Analysis_of_multithreaded_architectures_for_parallel_computing","260328953_GPU-to-GPU_and_host-to-host_multipattern_string_matching_on_a_GPU","224445131_Evaluating_GPUs_for_network_packet_signature_matching","221505513_Highly_compressed_multi-pattern_string_matching_on_the_cell_broadband_engine","221427568_Gnort_High_Performance_Network_Intrusion_Detection_Using_Graphics_Processors","261339212_Performance_Optimization_of_Aho-Corasick_Algorithm_on_a_GPU","260358427_Robust_and_Scalable_String_Pattern_Matching_for_Deep_Packet_Inspection_on_Multicore_Processors","228769672_Optimizing_pattern_matching_for_intrusion_detection","224159560_Accelerating_DNA_analysis_applications_on_GPU_clusters","221151099_Efficient_pattern_matching_on_GPUs_for_intrusion_detection_systems"]}