{"id":"283986729_Going_Deeper_in_Facial_Expression_Recognition_using_Deep_Neural_Networks","abstract":"Automated Facial Expression Recognition (FER) has remained a challenging and\ninteresting problem. Despite efforts made in developing various methods for\nFER, existing approaches traditionally lack generalizability when applied to\nunseen images or those that are captured in wild setting. Most of the existing\napproaches are based on engineered features (e.g. HOG, LBPH, and Gabor) where\nthe classifier's hyperparameters are tuned to give best recognition accuracies\nacross a single database, or a small collection of similar databases.\nNevertheless, the results are not significant when they are applied to novel\ndata. This paper proposes a deep neural network architecture to address the FER\nproblem across multiple well-known standard face datasets. Specifically, our\nnetwork consists of two convolutional layers each followed by max pooling and\nthen four Inception layers. The network is a single component architecture that\ntakes registered facial images as the input and classifies them into either of\nthe six basic or the neutral expressions. We conducted comprehensive\nexperiments on seven publically available facial expression databases, viz.\nMultiPIE, MMI, CK+, DISFA, FERA, SFEW, and FER2013. The results of proposed\narchitecture are comparable to or better than the state-of-the-art methods and\nbetter than traditional convolutional neural networks and in both accuracy and\ntraining time.","authors":["Ali Mollahosseini","David Chan","Mohammad H Mahoor"],"meta":["November 2015","SourcearXiv"],"references":["284476436_EBear_An_expressive_Bear-Like_robot","283532814_ExpressionBot_An_Emotive_Lifelike_Robotic_Face_for_Face-to-Face_Communication","271855676_DeepID3_Face_Recognition_with_Very_Deep_Neural_Networks","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","312831093_Deeply_Learning_Deformable_Facial_Action_Parts_Model_for_Dynamic_Expression_Analysis","299574766_Cascade_of_Tasks_for_Facial_Expression_Analysis","286794765_Dropout_A_Simple_Way_to_Prevent_Neural_Networks_from_Overfitting","286299355_Combining_Multiple_Kernel_Methods_on_Riemannian_Manifold_for_Emotion_Recognition_in_the_Wild","276113061_Facial_expression_recognition_using_lp-norm_MKL_multiclass-SVM","273393167_Intra-Class_Variation_Reduction_Using_Training_Expression_Images_for_Sparse_Representation_Based_Facial_Expression_Recognition"]}