{"id":"284076639_Synchrony_and_Reciprocity_Key_Mechanisms_for_Social_Companion_Robots_in_Therapy_and_Care","abstract":"Studies and concepts for social companion robots in therapy and care exist, however, they often lack the integration of convincing behavioral and social key mechanisms which enable a positive and successfull interaction experience. In this article we argue that synchrony and reciprocity are two key mechanisms of human interaction which affect both in the behavioral level (movements) and in the social level (relationships). Given that both a change in movement behavior and social behavior are an objective in the contexts of aging-in-place, neurocognitive and neurophysical rehabilitation, and depression, these key mechanisms should also be included in the interaction with social companion robots in therapy and care. We give an overview on the two concepts ranging from a social neuroscience over a behavioral towards a sociological perspective and argue that both concepts affect each other and are up to now only marginally applied in human–robot interaction. To support this claim, we provide a survey on existing social companion robots for aging-in-place (pet robots and household robots), neurocognitive impairments (autism and dementia), neurophysical impairments (brain injury, cerebral palsy, and Parkinson’s disease), and depression. We emphasize to what extend synchrony and reciprocity are already included into the respective applications. Finally, based on the survey and the previous argumentation on the importance of synchrony and reciprocity, we provide a discussion about potential future steps for the inclusion of these concepts to social companion robots in therapy and care.","authors":["Tamara Lorenz","Astrid Weiss","Sandra Hirche"],"meta":["January 2016International Journal of Social Robotics 8(1)","DOI:10.1007/s12369-015-0325-8"],"references":["313210316_'Dynamics_of_interpersonal_coordination_'","305509741_KASPAR_-_A_Minimally_Expressive_Humanoid_Robot_for_Human-Robot_Interaction_Research","301233048_Cross_recurrence_quantification_of_coupled_oscillators","289581848_Humanoid_Social_Robots_in_the_Rehabilitation_of_Children_with_Cerebral_Palsy","289506675_Exploring_Requirements_and_Alternative_Pet_Robots_for_Robot_Assisted_Therapy_with_Older_Adults_with_Dementia","330985501_What_are_implicit_measures_and_why_are_we_using_them","321607648_Coordination_Neural_Behavioral_and_Social_Dynamics","312612264_Sociality_of_objects","309211926_The_role_of_prediction_in_social_neuroscience","306201411_Alzheimer's_Disease_Facts_and_Figures"]}