{"id":"284014093_Reconfiguration_analysis_of_a_4-RUU_parallel_manipulator","abstract":"This paper deals with the characterization of the operation modes of the 4-RUU parallel manipulator with an algebraic approach, namely the Study's kinematic mapping of the Euclidean group SE(3). As the 4-RUU parallel manipulator is an over-constrained manipulator, it can be decomposed into two 2-RUU parallel manipulators. The manipulators are described by a set of constraint equations and the primary decomposition is computed. By combining the results of primary decomposition from two 2-RUU parallel manipulators, it reveals that the 4-RUU parallel manipulator has two Schönflies modes (4-dof) and one lower dimension operation mode (2-dof). The singularity conditions are obtained by deriving the determinant of the Jacobian matrix of the constraint equations with respect to the Study parameters in each operation mode. It is shown that there exist singular configurations in which the manipulators may switch from one operation mode to another operation mode. All the singular configurations are mapped onto the joint space, i.e., the actuated joint angles, and are geometrically interpreted. Eventually, the 4-RUU parallel manipulator may switch from the 1st Schönflies mode to the 2nd Schönflies mode, or vice versa, via the 2-dof third mode that contains self-motions.","authors":["Latifah Nurahmi","Stéphane Caro","Philippe Wenger","Josef Schadlbauer"],"meta":["October 2015Mechanism and Machine Theory 96","DOI:10.1016/j.mechmachtheory.2015.09.004"],"references":["288640961_Operation_Modes_and_Self-motions_of_a_2-RUU_Parallel_Manipulator","281417839_Singularity_Analysis_of_the_4-RUU_Parallel_Manipulator_using_Grassmann-Cayley_Algebra","277550278_Isoconstrained_Parallel_Generators_of_Schoenflies_Motion","275383649_Mobility_Change_in_Two_Types_of_Metamorphic_Parallel_Mechanisms","275378625_Unified_Kinematics_and_Singularity_Analysis_of_a_Metamorphic_Parallel_Mechanism_With_Bifurcated_Motion","294758389_Four-DOF_PPPR_parallel_mechanisms","294708732_Virtual-Chain_Approach_for_the_Type_Synthesis_of_Parallel_Mechanisms","288635347_Kinematic_analysis_of_the_TSAI_3-UPU_parallel_manipulator_using_algebraic_methods","278703894_Advances_in_Robot_Kinematics","278638332_Recent_Advances_in_Robot_Kinematics"]}