{"id":"284068926_Real-time_adaptive_multi-robot_exploration_with_application_to_underwater_map_construction","abstract":"This paper deals with the problem of autonomous exploration of unknown areas using teams of Autonomous X Vehicles (AXVs)—with X standing for Aerial, Underwater or Sea-surface—where the AXVs have to autonomously navigate themselves so as to construct an accurate map of the unknown area. Such a problem can be transformed into a dynamic optimization problem which, however, is NP-complete and thus infeasible to be solved. A usual attempt is to relax this problem by employing greedy (optimal one-step-ahead) solutions which may end-up quite problematic. In this paper, we first show that optimal one-step-ahead exploration schemes that are based on a transformed optimization criterion can lead to highly efficient solutions to the multi-AXV exploration. Such a transformed optimization criterion is constructed using both theoretical analysis and experimental investigations and attempts to minimize the “disturbing” effect of deadlocks and nonlinearities to the overall exploration scheme. As, however, optimal one-step-ahead solutions to the transformed optimization criterion cannot be practically obtained using conventional optimization schemes, the second step in our approach is to combine the use of the transformed optimization criterion with the cognitive adaptive optimization (CAO): CAO is a practicably feasible computational methodology which adaptively provides an accurate approximation of the optimal one-step-ahead solutions. The combination of the transformed optimization criterion with CAO results in a multi-AXV exploration scheme which is both practically implementable and provides with quite efficient solutions as it is shown both by theoretical analysis and, most importantly, by extensive simulation experiments and real-life underwater sea-floor mapping experiments in the Leixes port, Portugal.","authors":["Athanasios Kapoutsis","Savvas A. Chatzichristofis","Lefteris Doitsidis","João Borges de Sousa"],"meta":["August 2016Autonomous Robots 40(6)","DOI:10.1007/s10514-015-9510-8","Project: NOPTILUS"],"references":["276087550_A_Distributed_Algorithm_for_Cooperative_3D_Exploration_under_Communication_Constraints","275607696_Model-Based_Simulation_System_for_Planning_Numerical_Controlled_Multi-Axis_3D_Surface_Scanning_Machine","261194834_Distributed_multi-robot_coverage_using_micro_aerial_vehicles","258027445_A_Multi-Objective_Exploration_Strategy_for_Mobile_Robots_Under_Operational_Constraints","320893265_Exploring_Unknown_Environments_with_Mobile_Robots_using_Coverage_Maps","319770507_On_sequential_simulation-based_methods_for_Bayesian_filtering","277442734_Adaptive_Mobile_Robot_Navigation_and_Mapping","261385477_The_potential_of_Unmanned_Aerial_Vehicle_UAV_for_civilian_and_mapping_application","261229763_Advances_in_underwater_mapping_and_their_application_potential_for_Safety_Security_and_Rescue_Robotics_SSRR","254098821_Multi-robot_three-dimensional_coverage_of_unknown_areas"]}