{"id":"284032107_Robot_Task_Commander_A_framework_and_IDE_for_robot_application_development","abstract":"This paper introduces the Robot Task Commander (RTC) framework for defining, developing, and deploying robot application software for use in different run-time contexts. RTC was created by NASA-JSC in conjunction with General Motors for use with the Robonaut-2 and Valkyrie humanoid robot platforms. RTC provides a robot programming syntax and an IDE appropriate for use by experts and non-experts for implementation and execution. An expert developer can implement a new application with a combination of scripts, called process nodes, and state machines that set the control mode of the robot. A non-expert developer can assemble process nodes and controller state machines into novel hierarchical applications using a visual programming language (VPL). This VPL also allows developers to interface with other RTC applications or with third-party software packages using a variety of network transport mechanisms (ROS, TCP, shared memory, etc.). RTC represents an advantage over other robot programming frameworks by providing multiple levels of flexibility for development. The efficacy of RTC is demonstrated through examples of sophisticated behaviors, such as programming the Valkyrie robot to grab objects and turn a valve.","authors":["Stephen Hart","John D. Yamokoski","Duy Dinh","Brian Wightman"],"meta":["October 2014","DOI:10.1109/IROS.2014.6942761","Conference: IEEE/RSJ Conference on Intelligent Robotics and SystemsAt: Chicago, IL. USA"],"references":["278664923_Intrinsically_Motivated_Affordance_Discovery_and_Modeling","255034460_A_Formal_Denition_of_Object-Action_Complexes_and_Examples_at_Dierent_Levels_of_the_Processing_Hierarchy","248380634_The_BRICS_Component_Model_A_Model-Based_Development_Paradigm_for_Complex_Robotics_Software_Systems","228648665_The_iCub_humanoid_robot_An_open_platform_for_research_in_embodied_cognition","228551480_The_Control_Basis_API-A_Layered_Software_Architecture_for_Autonomous_Robot_Learning","303138182_ROS_An_open-source_Robot_Operating_System","272709709_OPRoS_A_new_component-based_robot_software_platform","261415878_ROS_commander_ROSCo_Behavior_creation_for_home_robots","247421051_ROBOLAB_Intuitive_robotic_programming_software_to_support_lifelong_learning","233881999_ROS_an_open-source_Robot_Operating_System"]}