{"id":"284171903_PANTHER_version_10_Expanded_protein_families_and_functions_and_analysis_tools","abstract":"PANTHER (Protein Analysis THrough Evolutionary Relationships, http://pantherdb.org) is a widely used online resource for comprehensive protein evolutionary and functional classification, and includes tools\nfor large-scale biological data analysis. Recent development has been focused in three main areas: genome coverage, functional\ninformation (‘annotation’) coverage and accuracy, and improved genomic data analysis tools. The latest version of PANTHER,\n10.0, includes almost 5000 new protein families (for a total of over 12 000 families), each with a reference phylogenetic\ntree including protein-coding genes from 104 fully sequenced genomes spanning all kingdoms of life. Phylogenetic trees now\ninclude inference of horizontal transfer events in addition to speciation and gene duplication events. Functional annotations\nare regularly updated using the models generated by the Gene Ontology Phylogenetic Annotation Project. For the data analysis\ntools, PANTHER has expanded the number of different ‘functional annotation sets’ available for functional enrichment testing,\nallowing analyses to access all Gene Ontology annotations—updated monthly from the Gene Ontology database—in addition to the annotations that have been inferred\nthrough evolutionary relationships. The Prowler (data browser) has been updated to enable users to more efficiently browse\nthe entire database, and to create custom gene lists using the multiple axes of classification in PANTHER.","authors":["Hel Mi","Sandika Poudel","Anushya Muruganujan","John T Casagrande"],"meta":["November 2015Nucleic Acids Research 44(D1)","DOI:10.1093/nar/gkv1194"],"references":["284738553_Database_resources_of_the_National_Center_for_Biotechnology_Information","278398316_Database_resources_of_the_National_Center_for_Biotechnology_Information_Nucleic_Acids_Res_2014_42_D7_D17_101093nargkt1146","278390854_UniProt_A_hub_for_protein_information","250919768_Large-scale_gene_function_analysis_with_the_PANTHER_classification_system","239947766_A_daily-updated_tree_of_sequenced_life_as_a_reference_for_genome_research","233799070_Mi_H_Muruganujan_A_Thomas_PDPANTHER_in_2013_modeling_the_evolution_of_gene_function_and_other_gene_attributes_in_the_context_of_phylogenetic_trees_Nucleic_Acids_Res_41_D377-D386","309255788_UniProt_a_hub_for_protein_information","300622246_Evolutionary_Concept_in_Genetics_and_Genomics","297917249_PANTHER_a_library_of_protein_families_and_subfamilies_indexed_by_function","292000646_UniProt_A_hub_for_protein_information"]}