{"id":"284113088_Tracking_Students'_Cognitive_Processes_During_Program_Debugging-An_Eye-Movement_Approach","abstract":"This study explores students' cognitive processes while debugging programs by using an eye tracker. Students' eye movements during debugging were recorded by an eye tracker to investigate whether and how high- and low-performance students act differently during debugging. Thirty-eight computer science undergraduates were asked to debug two C programs. The path of students' gaze while following program codes was subjected to sequential analysis to reveal significant sequences of areas examined. These significant gaze path sequences were then compared to those of students with different debugging performances. The results show that, when debugging, high-performance students traced programs in a more logical manner, whereas low-performance students tended to stick to a line-by-line sequence and were unable to quickly derive the program's higher-level logic. Low-performance students also often jumped directly to certain suspected statements to find bugs, without following the program's logic. They also often needed to trace back to prior statements to recall information, and spent more time on manual computation. Based on the research results, adaptive instructional strategies and materials can be developed for students of different performance levels, to improve associated cognitive activities during debugging, which can foster learning during debugging and programming.","authors":["Yu-Tzu Lin","Cheng-Chih Wu","Yu-Chi Lin","Ting-Yun Hou"],"meta":["October 2015IEEE Transactions on Education","DOI:10.1109/TE.2015.2487341"],"references":["264574138_Eye_Tracking_in_Computing_Education","261213444_Eye_Gaze_and_Mouse_Cursor_Relationship_in_a_Debugging_Task","313754047_Eye_tracking_technology_for_learning_and_education","301476421_Eye_Movements_in_Code_Reading_Relaxing_the_Linear_Order","284236292_Working_memory_short-term_memory_and_general_fluid_intelligence_A_latent_variable_approach","281103464_Eye_tracking_in_computing_education_NOVA_The_University_of_Newcastle's_Digital_Repository","270397847_The_influences_of_a_two-tier_test_strategy_on_student_learning_A_lag_sequential_analysis_approach","269504038_Observing_Interaction_An_Introduction_to_Sequential_Analysis","266656076_Improving_automated_source_code_summarization_via_an_eye-tracking_study_of_programmers","262358088_An_Eye-tracking_Study_Assessing_the_Comprehension_of_C_and_Python_Source_Code"]}