{"id":"284162881_RECAST_Telling_apart_social_and_random_relationships_in_dynamic_networks","abstract":"Abstract When constructing a social network from interactions among people (e.g., phone calls, encounters), a crucial task is to define the threshold that separates social from random (or casual) relationships. The ability to accurately identify social relationships becomes essential to applications that rely on a precise description of human routines, such as recommendation systems, forwarding strategies and opportunistic dissemination protocols. We thus propose a strategy to analyze users’ interactions in dynamic networks where entities act according to their interests and activity dynamics. Our strategy, named Random rElationship ClASsifier sTrategy (RECAST), allows classifying users interactions, separating random ties from social ones. To that end, RECAST observes how the real system differs from an equivalent one where entities’ decisions are completely random. We evaluate the effectiveness of the RECAST classification on five real-world user contact datasets collected in diverse networking contexts. Our analysis unveils significant differences among the dynamics of users’ wireless interactions in the datasets, which we leverage to unveil the impact of social ties on opportunistic routing. We show that, for such specific purpose, the relationships inferred by RECAST are more relevant than, e.g., self-declared friendships on Facebook.","authors":["Pedro O.S. Vaz de Melo","Aline Carneiro Viana","Marco Fiore","Katia Jaffres-Runser"],"meta":["May 2015Performance Evaluation 87:19 - 36","DOI:10.1016/j.peva.2015.01.005"],"references":["264046262_Lecture_Notes_in_Computer_Science","230662406_Opportunistic_routing_based_on_daily_routines","313609388_On_the_evolution_of_random_graphs","284674055_On_the_Evolution_of_Random_Graphs","283617653_Emergence_of_Scaling_in_Random_Networks","280691995_The_Social_Brain_Hypothesis","253555835_Social_Network_Data_Analytics","247877512_The_familiar_stranger_An_aspect_of_urban_anonymity","243779167_The_Social_Brain_Hypothesis","227673009_A_General_Theory_of_Bibliometric_and_Other_Cumulative_Advantage_Processes"]}