{"id":"284178854_Digital_game-based_learning_Still_restless_after_all_these_years","abstract":"Nearly a decade ago, I wrote an article for EDUCAUSE Review about digital game-based learning (DGBL) and the challenges it faced.1 I suggested that once proponents of DGBL were successful in convincing people that games could play a role in education, they would be unprepared to pro- vide practical guidance for implementing DGBL. Just as when the person shouting to be heard at a party is suddenly the center of attention at the moment there is a lull in the conversation, we DGBL proponents had everyone’s attention—but not much to say. In the article I also suggested that our sometimes overzealous defense of videogames (hereafter often referred to as “digital games”) ran the risk of overselling the benefits (and underreporting the challenges) of using digital games in formal education.\nGame-Based\nAfter All\nDigital Game-Based Learning: Still Restless, After All These Years\nDigital games, I said then and still believe today, are effective as embodi- ments of effective learning theories that can promote higher-order outcomes. Our inability to provide guidance in doing so a decade ago was ceding the DGBL front to digital games as tools for making didactic, instructivist learning (i.e., lectures) more “engaging.” DGBL, I suggested, was effective not as a means for making learning “fun” or for “trick- ing” students into learning; DGBL was effective because it supported power- ful learning strategies such as situated learning, authentic environments, and optimized challenge and support (scaffolding). What was needed was a renewed focus on (1) research about why DGBL is effective and (2) guidance on how, when, for whom, and under what conditions to integrate digital games into formal education.\nI was not the only one with these ideas, but my timing and the venue com- bined to reach many people. That 2006 article has been cited more than 1,000 times since then.2 Yet though these ideas continue to resonate with many people, much has changed in terms of research, practice, and to some extent, my own beliefs about the future of DGBL.","authors":["Richard Van Eck"],"meta":["January 2015","Project: DGBL, Digital Natives, 2006–2015"],"references":["313010134_Review_of_research_on_computer_games","304413085_COTS_in_the_classroom_A_teacher's_guide_to_integrating_commercial_off-the-shelf_COTS_games","287716440_Aligning_Problem_Solving_and_Gameplay_A_Model_for_Future_Research_and_Design","286926796_What_can_we_learn_from_violent_videogames","273459393_Gameplay_and_problem_solving_A_model_for_research_and_design","256743509_Does_Gamification_Work_-_A_Literature_Review_of_Empirical_Studies_on_Gamification","242513283_Digital_Game_Based_LEARNING_It's_Not_Just_the_Digital_Natives_Who_Are_Restless","232747166_Measuring_and_Supporting_Learning_in_Games_Stealth_Assessment","245968667_Problem-Based_Learning_A_Review_of_Literature_on_Its_Outcomes_and_Implementation_Issues","227573774_Intrinsic_Motivation"]}