{"id":"284178898_A_Competitive_Divide-and-Conquer_Algorithm_for_Unconstrained_Large_Scale_Black-Box_Optimization","abstract":"This article proposes a competitive divide-and-conquer algorithm for solving large-scale black-box optimization problems for which there are thousands of decision variables and the algebraic models of the problems are unavailable. We focus on problems that are partially additively separable, since this type of problem can be further decomposed into a number of smaller independent subproblems. The proposed algorithm addresses two important issues in solving large-scale black-box optimization: (1) the identification of the independent subproblems without explicitly knowing the formula of the objective function and (2) the optimization of the identified black-box subproblems. First, a Global Differential Grouping (GDG) method is proposed to identify the independent subproblems. Then, a variant of the Covariance Matrix Adaptation Evolution Strategy (CMA-ES) is adopted to solve the subproblems resulting from its rotation invariance property. GDG and CMA-ES work together under the cooperative co-evolution framework. The resultant algorithm, named CC-GDG-CMAES, is then evaluated on the CEC'2010 large-scale global optimization (LSGO) benchmark functions, which have a thousand decision variables and black-box objective functions. The experimental results show that, on most test functions evaluated in this study, GDG manages to obtain an ideal partition of the index set of the decision variables, and CC-GDG-CMAES outperforms the state-of-the-art results. Moreover, the competitive performance of the well-known CMA-ES is extended from low-dimensional to high-dimensional black-box problems.","authors":["Yi Mei","Xin Yao","Xiaodong Li","Mohammmad Nabi Omidvar"],"meta":["February 2015ACM Transactions on Mathematical Software 42(2)","DOI:10.1145/2791291","Project: Divide and Conquer Large Scale Optimisation"],"references":["279952972_Effective_decomposition_of_large-scale_separable_continuous_functions_for_cooperative_co-evolutionary_algorithms","321620474_Towards_a_New_Evolutionary_Computation_Advances_in_the_Estimation_of_Distribution_Algorithms","313758667_A_new_optimizer_using_particle_swarm_theory","313189460_Direct_search_solution_of_numerical_and_statistical_problems","313108693_Acooperative_coevolutionary_approach_to_function_optimization","304425270_Differential_Evolution_-_A_Simple_and_Efficient_Heuristic_for_global_Optimization_over_Continuous_Spaces","302970924_A_Simplex_Method_for_Function_Minimization","281935229_Cognitive_Science_An_Introduction_to_the_Study_of_Mind","277376778_Algorithm_851","274869757_Handbook_of_Parametric_and_Nonparametric_Statistical_Procedures"]}