{"id":"284160088_The_Effects_of_Student_Employment_on_Academic_Performance_in_Tatarstan_Higher_Education_Institutions","abstract":"Today, combining academic study with employment is typical for a wide range of students. There are many reasons why students choose to work, from the need to integrate into the job market to the desire to fill spare time. The present article investigates how various study and work combinations affect the academic performance of students in their final years in Tatarstan higher education institutions. The article examines the first set of results produced by longitudinal studies commenced in 2009 by the Institute of Education, NRU HSE (National Research University, Higher School of Economics). Two factors - work schedule and correspondence between the type of work and the future profession - are used to identify five types of study and work combinations. Various combinations reveal different levels of academic performance, different plans for the future, and somewhat different reasons for having entered an institution of higher education. Regression analysis of the data showed that only one type of study and work combination - non-professional fulltime employment - has a negative effect on academic performance. Other strategies of student employment showed no statistically significant effect on academic performance. All other conditions being equal, professionally employed students perform better than their non-professionally employed counterparts, and sometimes even better than those who do not work at all. The article concludes that the optimal strategy for students is to combine study with professional part-time employment. In this case, work becomes an additional source of knowledge and skills, as well as a motivation to learn.","authors":["Diana Yanbarisova"],"meta":["June 2015Russian Education & Society 57(6):459-482","DOI:10.1080/10609393.2015.1096138"],"references":["263555966_Engineering_students'_experiences_of_transition_from_study_to_work","234605864_Graduates'_Employment_and_the_Discourse_of_Employability_A_Critical_Analysis","226673612_University_studies_as_a_side_job_Causes_and_consequences_of_massive_student_employment_in_Estonia","6290064_Grit_Perseverance_and_Passion_for_Long-Term_Goals","247672921_Self-Report_Predictors","233085640_School_students'_part-time_work_Understanding_what_they_do","232972205_The_work-study_relationship_Experiences_of_full-time_university_students_undertaking_part-time_employment","225838892_UK_Institutional_Responses_to_Undergraduates'_Term-Time_Working","225248856_Limitations_of_using_students'_self-reports_of_academic_development_as_proxies_for_traditional_achievement_measures","223927513_When_Earning_is_Beneficial_for_Learning_The_Relation_of_Employment_and_Leisure_Activities_to_Academic_Outcomes","222669782_Working_while_enrolled_in_a_university_Does_it_pay","222154152_Using_self-report_and_parental-_report_survey_data_to_assess_past_and_present_academic_achievement_of_adults_and_children","30529847_The_Corrosion_of_Character_The_Personal_Consequences_of_Work_in_the_New_Capitalism","24043385_Paid_part-time_employment_and_academic_performance_of_undergraduate_nursing_students"]}