{"id":"284123152_New_perspectives_for_didactical_engineering_an_example_for_the_development_of_a_resource_for_teaching_decimal_number_system","abstract":"Many studies have shown the difficulties of learning and teaching the decimal number system for whole numbers. In the case of numbers bigger than one hundred, complexity is partly due to the multitude of possible relationships between units. This study was aimed to develop conditions of a resource which can help teachers to enhance their teaching of this concept, and learners to overcome some of its difficulties. “Didactical engineering for development” is a methodology that consists in cycles of conception of a resource and experiment with teachers, with a comparison of the a priori and a posteriori analysis. Overall choices for the design of the resource are described and the two main tasks designed with the support of a fundamental situation too. The type of collaboration between teachers and researchers evolves during the cycles of experiments in order to reach the conditions outside the research context. The analysis serve both to study how ordinary teachers appropriate the proposals made in the resource and to identify what is essential to disseminate to teachers. The results show how the situations can potentially help students to learn place value concepts, but they also indicate some resistance from the teachers when dealing with the decimal (base ten) principle of the numeration system. This is related to the influence of manipulative in teaching place value and to some characteristics of regular teaching practices. These results indicate the limitations of a resource in changing teachers’ practices, and they show that further teacher training about the decimal principle of the number system is needed.","authors":["Frédérick Tempier"],"meta":["April 2016Journal of Mathematics Teacher Education 19(2)","DOI:10.1007/s10857-015-9333-8","Project: Ingénierie didactique de développement d'une ressource pour enseigner la numération des entiers à l'école primaire"],"references":["301636381_La_numeration_decimale_de_position_a_l'ecole_primaire_Une_ingenierie_didactique_pour_le_developpement_d'une_ressource_Presentation_de_these","301622721_Une_etude_des_programmes_et_manuels_sur_la_numeration_decimale_au_CE2","346337473_Teaching_Place_Value_and_Double-Column_Addition","338552453_Knowing_and_Teaching_Elementary_Mathematics_Teachers'_Understanding_of_Fundamental_Mathematics_in_China_and_the_United_States","312491021_Une_analyse_conceptuelle_de_la_numeration_de_position_au_primaire","305325487_Des_savoirs_transparents_dans_le_travail_des_professeurs_a_l'ecole_primaire","304375981_Relations_entre_grandeurs_nombres_et_operations_dans_les_mathematiques_de_l'ecole_primaire_au_20e_siecle_theories_et_ecologie","285874610_Parts_Wholes_and_Place_Value_A_Developmental_View","281345602_Design-based_research_An_emerging_paradigm_for_educational_inquiry","281328242_Didactical_design_in_mathematics_education","277308299_DIDACTIC_ENGINEERING_AS_DESIGN-BASED_RESEARCH_IN_MATHEMATICS_EDUCATION","270321282_Children's_Conceptual_Structures_for_Multidigit_Numbers_and_Methods_of_Multidigit_Addition_and_Subtraction","268631106_Elementary_and_middle_school_mathematics_Teaching_developmentally","267768113_NOTES_ON_THE_OBSERVATION_OF_CLASSROOM_PRACTICES","265714013_Knowing_and_teaching_elementary_mathematics_teacher's_understanding_of_fundamental_mathematics_in_China_and_the_United_States"]}