{"id":"284136830_The_Role_of_Smart_Data_in_Smart_Home_Health_Monitoring_Case","abstract":"The smart data continuum refers to a series of increasingly semantically expressive definitions for data elements. With increased semantics we can achieve semantic interoperability, i.e., the ability of computer systems to exchange data with unambiguous and shared meaning. In context of smart homes it offers advanced connectivity of devices, systems, and services that goes beyond machine-to-machine communications. In order to achieve semantic interoperability in smart homes we have developed Smart Home Ontology, which gives semantics for the data that are exchanged by the systems and devices in a smart home. From technology point of view, we have studied the combination of cloud computing and Internet of Things as they enable ubiquitous sensing services and powerful processing of sensing data streams beyond the capability of individual “things”, thus stimulating innovations in both fields. Further, we will show how the principles of the Linked Data allow the integration of Smart Home data with other data sources, and thus increases the usability of Smart Home data. In particular we have restricted on health monitoring data.","authors":["Juha Puustjärvi","Leena Puustjärvi"],"meta":["December 2015Procedia Computer Science 69:143-151","DOI:10.1016/j.procs.2015.10.015"],"references":["287678284_Developing_a_data_infrastructure_for_patient-centered_telemedicine","271348497_Personal_Health_Book_A_Cloud-Based_Tool_for_Patient_Centered_Healthcare","258283126_Practising_cloud-based_telemedicine_in_developing_countries","248003837_The_semantic_web_A_guide_to_the_future_of_XML","234784830_Towards_the_Semantic_Web_Ontology-Driven_Knowledge_Management","220689185_Service-Oriented_Computing_Semantics_Processes_Agents","215863729_A_Semantic_Web_primer","12872068_Telemedicine_and_Telepharmacy_Current_Status_and_Future_Implications","8588681_How_is_patient-centred_care_understood_by_the_clinical_managerial_and_lay_stakeholders_responsible_for_promoting_this_agenda","7252032_Integrated_telemedicine_applications_and_services_for_oncological_positron_emission_tomography"]}