{"id":"284277327_Handwriting_or_Typewriting_The_Influence_of_Penor_Keyboard-Based_Writing_Training_on_Reading_and_Writing_Performance_in_Preschool_Children","abstract":"Digital writing devices associated with the use of computers, tablet PCs, or mobile phones are increasingly replacing writing by hand. It is, however, controversially discussed how writing modes influence reading and writing performance in children at the start of literacy. On the one hand, the easiness of typing on digital devices may accelerate reading and writing in young children, who have less developed sensory-motor skills. On the other hand, the meaningful coupling between action and perception during handwriting, which establishes sensory-motor memory traces, could facilitate written language acquisition. In order to decide between these theoretical alternatives, for the present study, we developed an intense training program for preschool children attending the German kindergarten with 16 training sessions. Using closely matched letter learning games, eight letters of the German alphabet were trained either by handwriting with a pen on a sheet of paper or by typing on a computer keyboard. Letter recognition, naming, and writing performance as well as word reading and writing performance were assessed. Results did not indicate a superiority of typing training over handwriting training in any of these tasks. In contrast, handwriting training was superior to typing training in word writing, and, as a tendency, in word reading. The results of our study, therefore, support theories of action-perception coupling assuming a facilitatory influence of sensory-motor representations established during handwriting on reading and writing.","authors":["Markus Kiefer","Stefanie Schuler","Carmen Hofmann","Natalie M Trumpp"],"meta":["December 2015Advances in Cognitive Psychology 11(4):136-146","DOI:10.5709/acp-0178-7","Project: Writing education: The influence of writing technology on writing and reading performance in children"],"references":["271938066_A_Tablet_Computer_for_Young_Children_Exploring_its_Viability_for_Early_Childhood_Education","264447887_Digital_Writing_and_Diversity_The_Effects_of_School_Laptop_Programs_on_Literacy_Processes_and_Outcomes","261401731_When_Action_Observation_Facilitates_Visual_Perception_Activation_in_Visuo-Motor_Areas_Contributes_to_Object_Recognition","260487239_The_write_way_to_spell_Printing_vs_typing_effects_on_orthographic_learning","332249882_Digital_ingenious_With_the_end_of_the_chalk_period_thinking_falls_by_the_wayside","273749401_Kognitive_sprachliche_mathematische_und_sozial-emotionale_Kompetenzen_als_Pradiktoren_spaterer_schulischer_Leistungen_Konnen_die_Leistungen_eines_Kindes_in_den_IDS_dessen_Schulleistungen_drei_Jahre_sp","271880412_Embodiment_theory_and_education_The_foundations_of_cognition_in_perception_and_action","270343805_Mobile_and_Interactive_Media_Use_by_Young_Children_The_Good_the_Bad_and_the_Unknown","266316724_Philosophy_in_The_Flesh_The_Embodied_Mind_And_Its_Challenge_To_Western_Thought","258166087_Early_Spelling_Acquisition_Does_Writing_Really_Beat_the_Computer"]}