{"id":"284246761_Checking_Interval_Properties_of_Computations","abstract":"Model checking is a powerful method widely explored in formal verification. Given a model of a system, e.g., a Kripke structure, and a formula specifying its expected behaviour, one can verify whether the system meets the behaviour by checking the formula against the model. Classically, system behaviour is expressed by a formula of a temporal logic, such as LTL and the like. These logics are “point-wise” interpreted, as they describe how the system evolves state-by-state. However, there are relevant properties, such as those constraining the temporal relations between pairs of temporally extended events or involving temporal aggregations, which are inherently “interval-based”, and thus asking for an interval temporal logic. In this paper, we give a formalization of the model checking problem in an interval logic setting. First, we provide an interpretation of formulas of Halpern and Shoham’s interval temporal logic HS over finite Kripke structures, which allows one to check interval properties of computations. Then, we prove that the model checking problem for HS against finite Kripke structures is decidable by a suitable small model theorem, and we provide a lower bound to its computational complexity.","authors":["Alberto Molinari","Angelo Montanari","Aniello Murano","Giuseppe Perelli"],"meta":["October 2016Acta Informatica 53(6-8)","DOI:10.1007/s00236-015-0250-1"],"references":["284044719_AUTOMATA-THEORETIC_APPROACH_TO_AUTOMATIC_PROGRAM_VERIFICATION","265677382_Interval_Temporal_Logics_a_Journey","313798826_Checking_interval_properties_of_computations","286554432_Decidability_of_model_checking_multi-agent_systems_against_a_class_of_EHS_specifications","283925025_Maintaining_Knowledge_about_Temporal_Intervals","267004817_Computational_Complexity","262272871_Model_Checking","262160719_An_epistemic_Halpern-Shoham_logic","261960753_The_Undecidability_of_the_Logic_of_Subintervals","242700803_Executable_Temporal_Logic_for_Interactive_Systems"]}