{"id":"284296699_New_Possibilities_for_Project_Management_Theory_A_Critical_Engagement","abstract":"This paper provides avenues for a broader engagement with the conceptual considerations of projects and project management with the aim of creating new possibilities for thinking about, researching, and developing our understanding of the field as practiced. Attention is drawn to the legacy of conventional but deeply rooted mainstream approaches to studying projects and project management, and implications of the specific underpinning intellectual tradition for recommendations proposed to organisational members as best practice project management. The identified concerns and limitations are discussed in the context of project management evolution where taken-for-granted advantages of project management as a disciplined effective methodology and its popularity are reexamined. The paper sheds light on a variety of voices from both scholarly and practitioner communities that have attempted to respond to this paradox and move the field forward. Taking issue with conventional labels of project success or failure, and drawing attention to alternative theoretical and methodological propositions, the argument turns toward critical management studies, outlining the implications of this intellectual tradition for studies of projects, project management, project performance, and individual skills and competencies to cope with social arrangements labelled “projects.”","authors":["Svetlana Cicmil","Damian Edward Hodgson"],"meta":["August 2006Project Management Journal 37(3):111-122","DOI:10.1177/875697280603700311","Project: Critical studies of project-based work"],"references":["312287423_Projects_and_prisons","312242297_Are_projects_real_The_PMBOK_and_the_legitimation_of_project_management_knowledge","311787997_Making_projects_critical_An_introduction","350683860_Neo-Industrial_Organising_Renewal_by_Action_and_Knowledge_Formation_in_a_Project-intensive_Economy","349755717_The_Rise_of_Professionalism","330695774_The_System_of_Professions_An_Essay_on_the_Division_of_Expert_Labor","324372256_Making_Sense_of_Management_A_Critical_Introduction","315191121_The_System_of_Professions_An_Essay_on_the_Division_of_Expert_Labor","313093127_Assessing_and_building_on_the_underlying_theory_of_Project_Management_in_the_light_of_badly_over-run_projects","311785288_An_Actor_Network_Theory_perspective_on_IT_projects"]}