{"id":"284259110_Security_Awareness_and_Adoption_of_Security_Controls_by_Smartphone_Users","abstract":"Growth in smartphone functionality and adoption makes such devices tempting targets for criminals. The device, but to a greater extent the information it contains, presents a valuable target for attack. It is therefore critical for smartphone users to take precautionary measures against threats, which may come from potential criminals or negligence by the user. Measures include awareness of vulnerabilities and threats as well as adoption of security controls. This study adds to the body of knowledge in this area by empirically exploring these measures. Using a survey approach an analysis of 510 respondents examines security awareness and adoption of security controls. Previous studies claim that smartphone users do not possess good security awareness, which was mostly not the case in our sample. We report on perceived efficacy and adoption of authentication and anti-theft controls, finding several correlations with smartphone OS, language, and gender. We propose that user education using a simple, non-technical design is key to encourage security awareness and adoption of security controls, especially in emerging markets.","authors":["Fayyaadh Parker","Jacques Ophoff","Ross Karia","Jean-Paul W Van Belle"],"meta":["November 2015","DOI:10.1109/InfoSec.2015.7435513","Conference: Second International Conference on Information Security and Cyber Forensics (InfoSec2015)At: Cape Town, South Africa"],"references":["283830968_Exploring_the_Adoption_of_Physical_Security_Controls_in_Smartphones","279634771_On_the_efficacy_of_smartphone_security_A_critical_analysis_of_modifications_in_business_students'_practices_over_time","270502010_Measuring_Information_Security_Awareness_of_Indonesian_Smartphone_Users","269197012_The_Privacy_and_Security_Behaviors_of_Smartphone_App_Developers","268182647_Curbing_Android_Permission_Creep","265766779_Research_Of_Security_Threats_In_The_Use_Of_Modern_Terminal_Devices","275947036_Exploring_end-user_smartphone_security_awareness_within_a_South_African_context","271547454_Quantifying_smartphone_vulnerabilities","265361621_Smartphone_promising_battlefield_for_hackers","260584194_Smartphone_Security_Challenges"]}