{"id":"284243179_A_statistical_trust_system_in_wireless_mesh_networks","abstract":"Most trust and reputation solutions in wireless mesh networks (WMNs) rely on the intrusion detection system (IDS) Watchdog. Nevertheless, Watchdog does not consider packet loss on wireless links and may generate false positives. Consequently, a node that suffers from packet loss on one of its links may be accused wrongly, by Watchdog, of misbehaving. To deal with this issue, we propose in this paper a novel trust system which considers packet loss of links. Our trust system is based on a statistical detection method (SDM) implemented on each node of the network. Firstly, the SDM, via CUSUM test, analyzes the behavior of the packets loss in order to detect a dropping attack. Secondly, the SDM, through the Kolmogorov-Smirnov test, compares the behavior of the total packets loss with that of the control packets in order to identify the attack type. Our system allows every WMN’s node to assign to each of its neighbors, a trust value which reflects its real behavior. We have validated the proposed SDM method via extensive simulations on ns2 and have compared our trust system with an existing solution. The results display that our SDM solution offers better performance.","authors":["Rida Khatoun","Youcef Begriche","Dromard Juliette","Lyes Khoukhi"],"meta":["November 2015annals of telecommunications - annales des télécommunications 71(5-6)","DOI:10.1007/s12243-015-0488-1"],"references":["306091801_A_Distributed_Trust_and_Reputation_Framework_for_Mobile_Ad_Hoc_Networks","273255483_An_efficient_admission_control_model_based_on_dynamic_link_scheduling_in_wireless_mesh_networks","324311202_Introduction_to_Statistical_Quality_Control","314814898_Ariadne_a_secure_on-demand_routing_protocol_for_ad_hoc_networks","314768515_Introduction_to_Statistical_Quality_Control","314310246_Introduction_to_Statistical_Quality_Control","312986781_Secure_on-demand_routing_protocol_for_ad_hoc_networks","271551866_A_dynamic_trust_updating_model_based_on_multiple_constraints_in_wireless_mesh_networks","266270183_Introduction_to_Statistical_Quality_Control_Second_Edition","261490570_A_Watchdog_extension_scheme_considering_packet_loss_for_a_reputation_system_in_wireless_mesh_network"]}