{"id":"284282093_Auditory_distance_perception_in_humans_a_review_of_cues_development_neuronal_bases_and_effects_of_sensory_loss","abstract":"Auditory distance perception plays a major role in spatial awareness, enabling location of objects and avoidance of obstacles in the environment. However, it remains under-researched relative to studies of the directional aspect of sound localization. This review focuses on the following four aspects of auditory distance perception: cue processing, development, consequences of visual and auditory loss, and neurological bases. The several auditory distance cues vary in their effective ranges in peripersonal and extrapersonal space. The primary cues are sound level, reverberation, and frequency. Nonperceptual factors, including the importance of the auditory event to the listener, also can affect perceived distance. Basic internal representations of auditory distance emerge at approximately 6 months of age in humans. Although visual information plays an important role in calibrating auditory space, sensorimotor contingencies can be used for calibration when vision is unavailable. Blind individuals often manifest supranormal abilities to judge relative distance but show a deficit in absolute distance judgments. Following hearing loss, the use of auditory level as a distance cue remains robust, while the reverberation cue becomes less effective. Previous studies have not found evidence that hearing-aid processing affects perceived auditory distance. Studies investigating the brain areas involved in processing different acoustic distance cues are described. Finally, suggestions are given for further research on auditory distance perception, including broader investigation of how background noise and multiple sound sources affect perceived auditory distance for those with sensory loss.","authors":["Andrew Kolarik","Brian C J Moore","Pavel Zahorik","Silvia Cirstea"],"meta":["November 2015Attention Perception & Psychophysics 78(2)","DOI:10.3758/s13414-015-1015-1","Project: The effect of partial and full visual impairment on auditory distance perception"],"references":["286539455_Dwelling_insulation_as_prior_information_in_auditory_distance_perception_of_moving_trains","281273968_Evolutionary_Psychology_and_the_Emotions_and_Their_Relationship_to_Internal_Regulatory_Variables","280558737_An_Auditory_Illusion_of_Proximity_of_the_Source_Induced_by_Sonic_Crystals","279236661_Echolocation_Reconsidered_Using_Spatial_Variations_in_the_Ambient_Sound_Field_to_Guide_Locomotion","274397643_The_cocktail-party_problem_revisited_early_processing_and_selection_of_multi-talker_speech","314351109_Effects_of_Interpersonal_Distance_on_Children's_Vocal_Intensity","313608948_Recovery_of_neonatal_head_turning_to_decreased_sound_pressure_level","284063753_Die_horbaren_Stufen_des_Raumeindrucks_bei_Musik","281663607_Cochlear_Hearing_Loss_Physiological_Psychological_and_Technical_Issues_Second_Edition","275511433_Sound_Localization_By_Human_Listeners"]}