{"id":"284352854_Identification_of_programmers_from_typing_patterns","abstract":"Being able to identify the user of a computer solely based on their typing patterns can lead to improvements in plagiarism detection, provide new opportunities for authentication, and enable novel guidance methods in tutoring systems. However, at the same time, if such identification is possible, new privacy and ethical concerns arise. In our work, we explore methods for identifying individuals from typing data captured by a programming environment as these individuals are learning to program. We compare the identification accuracy of automatically generated user profiles, ranging from the average amount of time that a user needs between keystrokes to the amount of time that it takes for the user to press specific pairs of keys, digraphs. We also explore the effect of data quantity and different acceptance thresholds on the identification accuracy, and analyze how the accuracy changes when identifying individuals across courses. Our results show that, while the identification accuracy varies depending on data quantity and the method, identification of users based on their programming data is possible. These results indicate that there is potential in using this method, for example, in identification of students taking exams, and that such data has privacy concerns that should be addressed.","authors":["Krista Longi","Juho Leinonen","Henrik Nygren","Joni Salmi"],"meta":["November 2015","DOI:10.1145/2828959.2828960","Conference: Koli Calling '15"],"references":["287069640_Analysis_of_source_code_snapshot_granularity_levels","261420085_An_investigation_of_keystroke_and_stylometry_traits_for_authenticating_online_test_takers","256819056_Behavioral_Biometric_Verification_of_Student_Identity_in_Online_Course_Assessment_and_Authentication_of_Authors_in_Literary_Works","303102579_Keyboard_apparatus_for_personal_identification_IBM_Tech","271451927_Cheating_and_plagiarism","269546452_When_Old_Technologies_Were_New","268803968_How_Novices_Tackle_Their_First_Lines_of_Code_in_an_IDE_Analysis_of_Programming_Session_Traces","262238390_Scaffolding_students'_learning_using_test_my_code","262153396_Free_vs_transcribed_text_for_keystroke-dynamics_evaluations","261848875_An_open_platform_for_managing_short_programming_exercises"]}