{"id":"284358714_Prevalencia_bayesiana_y_niveles_de_burnout_en_enfermeria_de_urgencias_Una_revision_sistematica","abstract":"Este trabajo tiene como objetivos conocer los niveles de burnout, estimar la prevalencia del trastorno así como analizar las relaciones entre algunos factores de riesgo y el síndrome en profesionales de enfermería que trabajan en servicios de urgencias. Se ha realizado una revisión sistemática de estudios primarios cuantitativos que midiesen el síndrome de burnout en enfermeros del servicio de urgencias. La búsqueda se realizó en octubre de 2014 en las siguientes bases: CINAHL, CUIDEN, IBECS, LILACS, Pubmed, Proquest, Psycinfo, Scielo, Scopus y la Biblioteca Cochrane. Siguiendo los criterios de inclusión y exclusión se obtuvo una muestra final de 27 estudios. Se han encontrado mayoritariamente niveles medios y altos en la dimensión cansancio emocional. En la dimensión despersonalización los valores han sido principalmente de nivel intermedio aunque también se han encontrado estudios que informan de niveles altos. En la dimensión realización personal no existe consenso en la literatura revisada sobre un nivel más prevalente. Variables como el género, el turno de trabajo y la carga horaria, entre otras, son factores de riesgo de burnout. Los trabajos revisados informan de niveles intermedios y altos en todas las dimensiones del burnout y concluyen que la prevalencia de burnout en enfermeros de servicios de urgencias es alta. Algunos factores de riesgo sociodemográficos, como edad y sexo, otros laborales como antigüedad en la profesión y servicio, y alguno psicológico, como ansiedad, juegan un papel importante por su relación con el burnout.","authors":["Luis Albendin","Jose Luis Gómez Urquiza","Guillermo Cañadas-De la Fuente","Gustavo R. Cañadas"],"meta":["November 2015Revista Latinoamericana de Psicología 48(2)","DOI:10.1016/j.rlp.2015.05.004"],"references":["317453929_Burnout_syndrome_in_the_nursing_team_of_a_teaching_hospital","279923825_Risk_Factors_And_Prevalence_Of_Burnout_Syndrome_In_The_Nursing_Profession","279921503_Evidence_for_factorial_validity_of_Maslach_Burnout_Inventory_and_burnout_levels_among_health_workers","273623299_Variaveis_de_Burnout_em_profissionais_de_uma_Unidade_de_Emergencia_hospitalar","273331621_Psychometric_properties_and_scales_of_the_Granada_Burnout_Questionnaire_applied_to_nurses","270288356_Preferred_Reporting_Items_for_Systematic_Review_and_Meta-Analysis_Protocols_PRISMA-P_2015_statement","289963661_Statistical_methods_in_psychology_journals_Guidelines_and_explanations","288665416_Assessment_of_occupational_stress_and_burnout_in_prehospital_emergency_services","270494783_Preditores_da_Sindrome_de_Burnout_em_enfermeiros_de_servicos_de_urgencia_pre-hospitalar","268578702_Determinants_and_prevalence_of_burnout_in_emergency_nurses_A_systematic_review_of_25_years_of_research"]}