{"id":"284386886_LiDAR_Segmentation_using_Suitable_Seed_Points_for_3D_Building_Extraction","abstract":"Effective building detection and roof reconstruction has an influential demand over the remote sensing research community. In this paper, we present a new automatic LiDAR point cloud segmentation method using suitable seed points for building detection and roof plane extraction. Firstly, the LiDAR point cloud is separated into \"ground\" and \"non-ground\" points based on the analysis of DEM with a height threshold. Each of the non-ground point is marked as coplanar or non-coplanar based on a coplanarity analysis. Commencing from the maximum LiDAR point height towards the minimum, all the LiDAR points on each height level are extracted and separated into several groups based on 2D distance. From each group, lines are extracted and a coplanar point which is the nearest to the midpoint of each line is considered as a seed point. This seed point and its neighbouring points are utilised to generate the plane equation. The plane is grown in a region growing fashion until no new points can be added. A robust rule-based tree removal method is applied subsequently to remove planar segments on trees. Four different rules are applied in this method. Finally, the boundary of each object is extracted from the segmented LiDAR point cloud. The method is evaluated with six different data sets consisting hilly and densely vegetated areas. The experimental results indicate that the proposed method offers a high building detection and roof plane extraction rates while compared to a recently proposed method.","authors":["Sm Abdullah","Mohammad Awrangjeb","G. Lu"],"meta":["August 2014","DOI:10.5194/isprsarchives-XL-3-1-2014"],"references":["286969644_Building_detection_from_multispectral_imagery_and_lidar_data_employing_a_threshold-free_evaluation_system","275579469_Generation_of_Complex_Polyhedral_Building_Models_by_Integrating_Stereo-Aerial_Imagery_and_Lidar_Data","274676932_Rule-based_segmentation_of_LIDAR_point_cloud_for_automatic_extraction_of_building_roof_planes","274239969_A_Split-and-Merge_Technique_for_Automated_Reconstruction_of_Roof_Planes","273280298_Building_Detection_in_Complex_Scenes_Thorough_Effective_Separation_of_Buildings_from_Trees","267429253_Segmentation_of_LiDAR_point_clouds_for_building_extraction","264655501_A_Multi-Resolution_Hybrid_Approach_for_Building_Model_Reconstruction_from_Lidar_Data","309776556_Automated_segmentation_of_LiDAR_point_clouds_for_building_rooftop_extraction","270558936_DEM_Generation_and_Building_Detection_from_Lidar_Data","266219044_Morphology-based_Building_Detection_from_Airborne_Lidar_Data"]}