{"id":"284364850_The_Use_of_Virtual_Project_Teams_for_Project_Management_in_Jordanian_Corporations","abstract":"Jordanian companies need virtual project teams that can use advanced technology to solve\nproblems and make specialist multi perspective decisions when working across different and\ndistance location. The main mission of the team is to make decisions through interdependent\nspecialists and perspectives. In terms of its use and application, the virtual project team is a\ndifficult challenge for Jordan corporations. This study aims to explore such applications and to\ndetect which factors face virtual project teams in the Jordanian situation. The author focused on\nhow to explore and gain a deeper understanding from a virtual team’s perspective, and team\nmembers’ opinions of the factors in the organization that support or hinder the mission. More\nspecifically, this research sought to discover precisely which factors in an organization support\nvirtual project teams, and how they can develop a support system which enables their work in\nan Arab environment. The main objective was to identify the effects of all factors on the\nefficiency of virtual teams. The research used empirical case studies from three Jordanian\ncorporations in the communication sector which operate in a high-tech environment, and used\nsurveys to collect data. Structured interviews with both management and team members during\nthe study discovered that the use of virtual teams within Jordanian companies is still limited, and\ndetected that the main factors which hinder their development in many corporations is the level\nof trust in the ability of virtual teams, together with the high level of centralized decision making\nin Jordanian corporations. Additionally, communication and coordination affect the execution of\nwork processes and methods for virtual teams, together with a general weakness which exists\nin terms of infrastructure, resources and technology within the corporation, which then impacts\non the efficiency of virtual team work.","authors":["Belal Hashem Alnsour"],"meta":["September 2014Eurasian Journal of Business and Management 2(2):50-60","DOI:10.15604/ejbm.2014.02.02.004"],"references":["263556739_The_mediating_effect_of_knowledge_sharing_on_the_relationship_between_trust_and_virtual_team_effectiveness","243461614_Nature_of_virtual_teams_A_summary_of_their_advantages_and_disadvantages","267854693_MANAGING_VIRTUAL_PROJECT_TEAMS","263555904_Information_support_technologies_of_integrated_production_planning_and_control_for_OEM_driven_networked_manufacturing","259384943_Utilization_of_life-cycle_analysis_to_evaluate_sustainability_rating_systems_for_construction_projects_with_a_case_study_on_Qatar_Sustainability_Assessment_System_QSAS","247626732_Project_communication_in_a_strategic_internal_perspective","247616001_Consulting_for_virtual_excellence_Virtual_teamwork_as_a_task_for_consultants","244127809_Investigation_of_the_sponsor's_role_in_project_closing","242345645_Global_virtual_teams_What_impacts_their_design_and_performance","241944359_Development_of_project_management_systems"]}