{"id":"284462851_The_curvelet_transform_for_image_denoising","abstract":"We describe approximate digital implementations of two new mathematical transforms, namely. the ridgelet transform [2] and the curvelet transform [6], [5]. Our implementations offer exact reconstruction, stability against perturbations, ease of implementation, and low computational complexity. A central tool is Fourier-domain computation of an approximate digital Radon transform. We introduce a very simple interpolation in Fourier space which takes Cartesian samples and yields samples on a rectopolar grid, which is a pseudo-polar sampling set based on a concentric squares geometry. Despite the crudeness of our interpolation, the visual performance is surprisingly good. Our ridgelet transform applies to the Radon transform a special overcomplete wavelet pyramid whose wavelets have compact support in the frequency domain. Our curvelet transform uses our ridgelet transform as a component step, and implements curvelet subbands using a filter bank of a trous wavelet filters. Our philosophy throughout is that transforms should be overcomplete, rather than critically sampled. We apply these digital transforms to the denoising of some standard images embedded in white noise. In the tests reported here, simple thresholding of the curvelet coefficients is very competitive with \"state of the art\" techniques based on wavelets, including thresholding of decimated or undecimated wavelet transforms and also including tree-based Bayesian posterior mean methods. Moreover, the curvelet reconstructions exhibit higher perceptual quality than wavelet-based reconstructions, offering visually sharper images and, in particular, higher quality recovery of edges and of faint linear and curvilinear features. Existing theory for curvelet and ridgelet transforms suggests that these new approaches can outperform wavelet methods in certain image reconstruction problems. The empirical results reported here are in encouraging agreement.","authors":["Jean-Luc Starck","Emmanuel J. Candès","D. L. Donoho"],"meta":["June 2002IEEE Transactions on Image Processing 11(6):670-684"],"references":["247085886_Orthonormal_Ridgelets_and_Linear_Singularities","224274199_Iterative_inversion_of_the_Radon_transform_using_image-adaptive_wavelet_constraints","38348478_Wedgelets_Nearly-Minimax_Estimation_of_Edges","3886324_Orthonormal_finite_ridgelet_transform_for_image_compression","3325153_A_new_entropy_measure_based_on_the_wavelet_transform_and_noise_modeling","3315408_Wavelet_localization_of_the_Radon_transform","3077959_Shiftable_multiscale_transforms","2993873_Digital_Reconstruction_of_Multidimensional_Signal_from_Their_Projection","222495033_Harmonic_Analysis_of_Neural_Networks","222449221_Multiscale_entropy_filtering","3728950_Iterative_inversion_of_the_Radon_transform_using_image-adaptivewavelet_constraints","3566609_On_the_use_of_wavelets_in_inverting_the_Radon_transform","3316803_Wavelet-Based_Statistical_Signal_Processing_Using_Hidden_Markov_Models_IEEE_Trans_Signal_Processing_46_886-902","2627434_Digital_Curvelet_Transform_Strategy_Implementation_and_Experiments"]}