{"id":"284476537_sense2vec_-_A_Fast_and_Accurate_Method_for_Word_Sense_Disambiguation_In_Neural_Word_Embeddings","abstract":"Neural word representations have proven useful in Natural Language Processing\n(NLP) tasks due to their ability to efficiently model complex semantic and\nsyntactic word relationships. However, most techniques model only one\nrepresentation per word, despite the fact that a single word can have multiple\nmeanings or \"senses\". Some techniques model words by using multiple vectors\nthat are clustered based on context. However, recent neural approaches rarely\nfocus on the application to a consuming NLP algorithm. Furthermore, the\ntraining process of recent word-sense models is expensive relative to\nsingle-sense embedding processes. This paper presents a novel approach which\naddresses these concerns by modeling multiple embeddings for each word based on\nsupervised disambiguation, which provides a fast and accurate way for a\nconsuming NLP model to select a sense-disambiguated embedding. We demonstrate\nthat these embeddings can disambiguate both contrastive senses such as nominal\nand verbal senses as well as nuanced senses such as sarcasm. We further\nevaluate Part-of-Speech disambiguated embeddings on neural dependency parsing,\nyielding a greater than 8% average error reduction in unlabeled attachment\nscores across 6 languages.","authors":["Andrew Trask","Phil Michalak","John Liu"],"meta":["November 2015","SourcearXiv"],"references":["283824558_Improving_Distributed_Representation_of_Word_Sense_via_WordNet_Gloss_Composition_and_Context_Clustering","281812760_TwoToo_Simple_Adaptations_of_Word2Vec_for_Syntax_Problems","281607724_Character-level_Convolutional_Networks_for_Text_Classification","319770369_Distributed_Representations_of_Words_and_Phrases_and_their_Compositionality","299487682_A_Fast_and_Accurate_Dependency_Parser_using_Neural_Networks","277958885_Modeling_Order_in_Neural_Word_Embeddings_at_Scale","275588492_Efficient_Non-parametric_Estimation_of_Multiple_Embeddings_per_Word_in_Vector_Space","273312152_Bringing_Machine_Learning_and_Compositional_Semantics_Together","267939581_A_Probabilistic_Model_for_Semantic_Word_Vectors","266913087_POLYGLOT-NER_Massive_Multilingual_Named_Entity_Recognition"]}