{"id":"284504706_Submodular_Maximization_with_Cardinality_Constraints","abstract":"We consider the problem of maximizing a (non-monotone) submodular function subject to a cardinality constraint. In addition to capturing well-known combinatorial optimization problems, e.g., Max-k-Coverage and Max-Bisection, this problem has applications in other more practical settings such as natural language processing, information retrieval, and machine learning. In this work we present improved approximations for two variants of the cardinality constraint for non-monotone functions. When at most k elements can be chosen, we improve the current best 1/e - o(1) approximation to a factor that is in the range [1/e + 0.004, 1/2], achieving a tight approximation of 1/2 - o(1) for k = n/2 and breaking the 1/e barrier for all values of k. When exactly k elements must be chosen, our algorithms improve the current best 1/4 - o(1) approximation to a factor that is in the range [0.356, 1/2], again achieving a tight approximation of 1/2 - o(1) for k = n/2. Additionally, some of the algorithms we provide are very fast with time complexities of O(nk), as opposed to previous known algorithms which are continuous in nature, and thus, too slow for applications in the practical settings mentioned above.Our algorithms are based on two new techniques. First, we present a simple randomized greedy approach where in each step a random element is chosen from a set of \"reasonably good\" elements. This approach might be considered a natural substitute for the greedy algorithm of Nemhauser, Wolsey and Fisher [45], as it retains the same tight guarantee of 1 - 1/e for monotone objectives and the same time complexity of 0(nk), while giving an approximation of 1/e for general non-monotone objectives (while the greedy algorithm of Nemhauser et. al. fails to provide any constant guarantee). Second, we extend the double greedy technique, which achieves a tight 1/2 approximation for unconstrained submodular maximization, to the continuous setting. This allows us to manipulate the natural rates by which elements change, thus bounding the total number of elements chosen. Copyright","authors":["Niv Buchbinder","Moran Feldman","Joseph (Seffi) Naor","Roy Schwartz"],"meta":["January 2014","DOI:10.1137/1.9781611973402.106","In book: Proceedings of the Twenty-Fifth Annual ACM-SIAM Symposium on Discrete Algorithms (pp.1433-1452)"],"references":["228720638_Gadgets_Approximation_and_Linear_Programming","224775648_A_Tight_Combinatorial_Algorithm_for_Submodular_Maximization_Subject_to_a_Matroid_Constraint","238836027_Best_Algorithms_for_Approximating_the_Maximum_of_a_Submodular_Set_Function","228057732_Improved_approximation_algorithms_for_MAX_k-CUT_and_MAX_BISECTION","225537087_An_Approximation_Algorithm_for_Hypergraph_Max_k-Cut_with_Given_Sizes_of_Parts","225246148_An_analysis_of_approximations_for_maximizing_submodular_set_functions-II","224904838_Better_Balance_by_Being_Biased_A_08776-Approximation_for_Max_Bisection","224678314_Approximation_algorithms_for_allocation_problems_Improving_the_factor_of_1_-_1e","222551950_Approximation_Algorithms_for_Maximization_Problems_Arising_in_Graph_Partitioning","222306805_An_0828-approximation_algorithm_for_the_uncapacitated_facility_location_problem","220779129_Tight_Approximation_Algorithms_for_Maximum_General_Assignment_Problems","220617718_A_Polynomial_Time_Approximation_Scheme_for_the_Multiple_Knapsack_Problem","220532958_A_05-approximation_algorithm_for_MAX_DICUT_with_given_sizes_of_parts","45928450_Submodular_Maximization_by_Simulated_Annealing","2618309_Approximation_Algorithms_for_Maximum_Coverage_and_Max_Cut_with_Given_Sizes_of_Parts"]}