{"id":"284676003_Exploring_students_acceptance_of_e-learning_using_Technology_Acceptance_Model_in_Jordanian_universities","abstract":"Today’s rapid changing world highlights the influence and impact of technology in all aspects of learning life. Higher Education institutions in developed Western countries believe that these developments offer rich opportunities to embed technological innovations within the learning environment. This places developing countries, striving to be equally competitive in international markets, under tremendous pressure to similarly embed appropriate blends of technologies within their learning and curriculum approaches, and consequently enhance and innovate their learning experiences. Although many universities across the world have incorporated internet-based learning systems, the success of their implementation requires an extensive understanding of the end user acceptance process. Learning using technology has become a popular approach within higher education institutions due to the continuous growth of Internet innovations and technologies. Therefore, this paper focuses on the investigation of students, who attempt to successfully adopt e-learning systems at universities in Jordan. The conceptual research framework of e-learning adoption, which is used in the analysis, is based on the technology acceptance model. The study also provides an indicator of students’ acceptance of e-learning as well as identifying the important factors that would contribute to its successful use. The outcomes will enrich the understanding of students’ acceptance of e-learning and will assist in its continuing implementation at Jordanian Universities.","authors":["Amer Al-Adwan","Ahmad Samed Al-Adwan","Jo Smedly"],"meta":["April 2013The International Journal of Education and Development using Information and Communication Technology 9(2):4-18"],"references":["303750301_Using_the_technology_acceptance_model_to_explain_how_attitudes_determine_Internet_usage_The_role_of_perceived_access_barriers_and_demographics","285952439_Understanding_technology_Acceptance_in_pre-service_teachers_A_structural-equation_modeling_approach","285914163_Applying_the_technology_acceptance_model_and_flow_theory_to_online_e-learning_users'_acceptance_behavior","283327884_Validating_a_Model_to_Measure_the_Brand_Loyalty_of_Fast_Moving_Consumer_Goods","272942607_Implementing_e-learning_in_the_Jordanian_Higher_Education_System_Factors_affecting_impact","312368182_Use_acceptance_of_information_technology_Toward_a_unified_view","309254394_Psychometric_Theory","304534338_Understanding_Attitudes_and_Predicting_Social_Behavior","294687012_An_empirical_study_of_learning_object_acceptance_in_multimedia_learning_environment","292056054_Evaluating_the_intention_to_use_technology_among_student_teachers_A_structural_equation_modeling_approach"]}