{"id":"284698107_The_Geography_of_Innovation_Regional_Innovation_Systems","abstract":"The process of knowledge production exhibits a very distinctive geography. This article argues that this geography is fundamental, not incidental, to the innovation process itself: that one simply cannot understand innovation properly if one does not appreciate the central role of spatial proximity and concentration in this process. The goal of this article is to demonstrate why this is true, and to examine how innovation systems at the subnational scale play a key part in producing and reproducing this uneven geography over time. This article addresses four key issues. First, it looks at the reason why location matters when it comes to innovative activity. Second, it turns to examine regional innovation systems, and the role played by them in generating and circulating new knowledge leading to innovation. Third, the article considers the relationship between regional systems of innovation and institutional frameworks at the national level. Finally, the relationship between local and global knowledge flows is examined.","authors":["Björn Asheim","Meric S. Gertler"],"meta":["January 2009","DOI:10.1093/oxfordhb/9780199286805.003.0011"],"references":["5212781_Comment_on_Kenney_and_von_Burg_'Technology_Entrepreneuship_and_Path_Dependence_Industrial_Clustering_in_Silicon_Valley_and_Route_128'","284514427_Regionale_innovasjonssystem_-_En_sosialt_og_territorielt_forankret_teknologipolitikk","271689133_Economic_Evolution_of_National_Systems","240738994_Geographies_of_production_Growth_regimes_in_spatial_perspective_1_-_Innovation_institutions_and_social_systems","233590435_Learning_Regions_as_Development_Coalitions_Partnership_as_Governance_in_European_Workfare_States","229039982_Where_Science_Comes_to_Life_University_Bioscience_Commercial_Spin-offs_and_Regional_Economic_Development","222794974_Along_the_road_R_D_society_and_space","23541955_Innovative_Networks_and_the_Technopolis_Phenomenon_The_Case_of_Sophia-Antipolis"]}