{"id":"284766798_Adaptive_Multi-Resource_Allocation_for_Cloudlet-Based_Mobile_Cloud_Computing_System","abstract":"Mobile cloud computing utilizing cloudlet is an emerging technology to improve the quality of mobile services. In this paper, to better overcome the main bottlenecks of the computation capability of cloudlet and the wireless bandwidth between mobile devices and cloudlet, we consider the multi-resource allocation problem for the cloudlet environment with resource-intensive and latency-sensitive mobile applications. The proposed multi-resource allocation strategy enhances the quality of mobile cloud service, in terms of the system throughput (the number of admitted mobile applications) and the service latency. We formulate the resource allocation model as a semi-Markov decision process under the average cost criterion, and solve the optimization problem using linear programming technology. Through maximizing the long-term reward while meeting the system requirements of the request blocking probability and service time latency, an optimal resource allocation policy is calculated. From simulation results, it is indicated that the system adaptively adjusts the allocation policy about how much resource to allocate and whether to utilize the distant cloud according to the traffic of mobile service requests and the availability of the resource in the system. Our algorithm outperforms greedy admission control over a broad range of environments.","authors":["Yanchen Liu","Myung Lee","Yanyan Zheng"],"meta":["October 2016IEEE Transactions on Mobile Computing 15(10):1536-1233","DOI:10.1109/TMC.2015.2504091"],"references":["284452203_Security-Aware_Resource_Allocation_for_Mobile_Cloud_Computing_Systems","277575715_Structural_Characterisation_of_Asphaltenes_during_Residue_Hydrotreatment_with_Light_Cycle_Oil_as_an_Additive","270882441_An_Adaptive_Resource_Allocation_Algorithm_for_Partitioned_Services_in_Mobile_Cloud_Computing","262300965_An_Effective_Dynamic_Programming_Offloading_Algorithm_in_Mobile_Cloud_Computing_System","319591767_Model_Formulation","314048314_Semi-Markov_Processes","309201112_The_case_for_VM-based_cloudlets_in_mobile_computing","308540479_An_Adaptive_Resource_Allocation_Algorithm_for_Partitioned_Services_in_Mobile_Cloud_Computing","297816577_Cloud_computing_for_mobile_users_Can_offloading_computation_save_energy","262311339_COMET_code_offload_by_migrating_execution_transparently"]}