{"id":"284710455_Feature_Selection_and_Predictors_of_Falls_with_Foot_Force_Sensors_Using_KNN-Based_Algorithms","abstract":"The aging process may lead to the degradation of lower extremity function in the elderly population, which can restrict their daily quality of life and gradually increase the fall risk. We aimed to determine whether objective measures of physical function could predict subsequent falls. Ground reaction force (GRF) data, which was quantified by sample entropy, was collected by foot force sensors. Thirty eight subjects (23 fallers and 15 non-fallers) participated in functional movement tests, including walking and sit-to-stand (STS). A feature selection algorithm was used to select relevant features to classify the elderly into two groups: at risk and not at risk of falling down, for three KNN-based classifiers: local mean-based k-nearest neighbor (LMKNN), pseudo nearest neighbor (PNN), local mean pseudo nearest neighbor (LMPNN) classification. We compared classification performances, and achieved the best results with LMPNN, with sensitivity, specificity and accuracy all 100%. Moreover, a subset of GRFs was significantly different between the two groups via Wilcoxon rank sum test, which is compatible with the classification results. This method could potentially be used by non-experts to monitor balance and the risk of falling down in the elderly population.","authors":["Shengyun Liang","Yunkun Ning","Huiqi Li","Lei Wang"],"meta":["November 2015Sensors 15(11):29393-29407","DOI:10.3390/s151129393"],"references":["287467259_Contributions_of_Lower-Limb_Muscle_Power_in_Gait_of_People_Without_Impairments","281812012_Identification_of_Foot_Pathologies_Based_on_Plantar_Pressure_Asymmetry","263295850_Detecting_Falls_with_Wearable_Sensors_Using_Machine_Learning_Techniques","260004588_Is_the_Timed_Up_and_Go_test_a_useful_predictor_of_risk_of_falls_in_community_dwelling_older_adults_A_systematic_review_and_meta-_analysis","257646832_Sample_entropy_characteristics_of_movement_for_four_foot_types_based_on_plantar_centre_of_pressure_during_stance_phase","282707871_Nearest_Neighbor_Pattern_Classification","268804839_Is_the_Timed_Up_and_Go_test_a_useful_predictor_of_risk_of_falls_in_community_dwelling_older_adults_A_systematic_review_and_meta-analysis","266320558_Improved_pseudo_nearest_neighbor_classification","263282786_Can_sit-to-stand_lower_limb_muscle_power_predict_fall_status","254052255_An_Enhanced_Fall_Detection_Approach_Based_on_Cost_Sensitivity_Analysis"]}