{"id":"284890929_Research_methods_and_reporting_preferred_reporting_items_for_systematic_reviews_and_meta-analyses_the_PRISMA_statement","abstract":"Systematic reviews and meta-analyses have become increasingly important in health care. Clinicians read them to keep up to date with their field [1],[2], and they are often used as a starting point for developing clinical practice guidelines. Granting agencies may require a systematic review to ensure there is justification for further research [3], and some health care journals are moving in this direction [4]. As with all research, the value of a systematic review depends on what was done, what was found, and the clarity of reporting. As with other publications, the reporting quality of systematic reviews varies, limiting readers' ability to assess the strengths and weaknesses of those reviews.\n\nSeveral early studies evaluated the quality of review reports. In 1987, Mulrow examined 50 review articles published in four leading medical journals in 1985 and 1986 and found that none met all eight explicit scientific criteria, such as a quality assessment of included studies [5]. In 1987, Sacks and colleagues [6] evaluated the adequacy of reporting of 83 meta-analyses on 23 characteristics in six domains. Reporting was generally poor; between one and 14 characteristics were adequately reported (mean = 7.7; standard deviation = 2.7). A 1996 update of this study found little improvement [7].\n\nIn 1996, to address the suboptimal reporting of meta-analyses, an international group developed a guidance called the QUOROM Statement (QUality Of Reporting Of Meta-analyses), which focused on the reporting of meta-analyses of randomized controlled trials [8]. In this article, we summarize a revision of these guidelines, renamed PRISMA (Preferred Reporting Items for Systematic reviews and Meta-Analyses), which have been updated to address several conceptual and practical advances in the science of systematic reviews (Box 1).\n\nBox 1: Conceptual Issues in the Evolution from QUOROM to PRISMA\nCompleting a Systematic Review Is an Iterative Process\nThe conduct of a systematic review depends heavily on the scope and quality of included studies: thus systematic reviewers may need to modify their original review protocol during its conduct. Any systematic review reporting guideline should recommend that such changes can be reported and explained without suggesting that they are inappropriate. The PRISMA Statement (Items 5, 11, 16, and 23) acknowledges this iterative process. Aside from Cochrane reviews, all of which should have a protocol, only about 10% of systematic reviewers report working from a protocol [22]. Without a protocol that is publicly accessible, it is difficult to judge between appropriate and inappropriate modifications.","authors":["David Moher","Alessandro Liberati","Jennifer Tetzlaff","Douglas Altman"],"meta":["July 2009PLoS Medicine 339(4):332-339","DOI:10.1371/journal.pmed.1000097"],"references":["291408428_Strengthening_the_Reporting_of_Observational_Studies_in_Epidemiology_STROBE_Explanation_and_Elaboration","281071595_The_PRISMA_Statement_for_Reporting_Systematic_Reviews_and_Meta-Analyses_of_Studies_That_Evaluate_Health_Care_Interventions_Explanation_and_Elaboration","315804329_Improving_the_quality_of_reports_of_meta-analyses_of_randomised_controlled_trials_the_QUOROM_statement_Quality_of_Reporting_of_Meta-analyses","313638404_Publication_bias_Recognizing_the_problem_understanding_its_origins_and_scope_and_preventing_harm","309901458_Standards_for_Reporting_of_Diagnostic_Accuracy_The_STARD_statement_for_reporting_studies_of_diagnostic_accuracy_Explanation_and_elaboration","287760812_GRADE_An_emerging_consensus_on_rating_quality_of_evidence_and_strength_of_recommendations","285247332_The_STARD_Statement_for_Reporting_Studies_of_Diagnostic_Accuracy_Explanation_and_Elaboration","284756615_Systematic_reviews_of_evaluations_of_diagnostic_and_screening_tests","284413678_The_PRISMA_Statement_for_Reporting_Systematic_Reviews_and_Meta-Analyses_of_Studies_That_Evaluate_Health_Care_Interventions_Explanation_and_Elaboration","277512585_Users'_guides_to_the_medical_literature_VI_How_to_use_an_overview_Evidence-Based_Medicine_Working_Group"]}