{"id":"284806731_The_World_in_the_Data","abstract":"The paper compares Ladyman and Ross's version of naturalized metaphysics, Rainforest Realism, with the comprehensive scientific metaphysics recently articulated by a physicist, David Deutsch. Major similarities of the two positions are described and discussed, illustrating the relevance of metaphysics to science. However, a failure of consistent naturalism on Deutsch's part is also identified and criticized: Deutsch promotes the Everettian multiverse interpretation of quantum physics on the basis of a philosophical commitment to classical determinism. Deutsch also fails to appreciate that a broadly realistic attitude to physical theory does not require denying that some important scientific achievements involve using models and their elements as instruments. Both of these errors are traced to an overly strict dichotomy between pure formalism and empirically interpreted content. In quantum mechanics, Bohr's version of the Copenhagen interpretation fails to be a fully fledged 'interpretation' according to currently dominant philosophical opinion. Ladyman and Ross criticize this opinion. The deep structure of the world is arguably not mathematical but statistical, and there is no such thing as 'purely formal statistics'. The principles of statistics are generalizations of recurrent patterns found in data; and such structuring of data is the core business of both science and its metaphysical unification. Contrary to Deutsch's claims, Enlightenment optimism about the capacity for limitless expansion of knowledge is compatible with the hypothesis that the world is irreducibly and fundamentally stochastic. Among great philosophers, C. S. Peirce anticipated this hypothesis. Ladyman and Ross's metaphysics can be re-described in terms of it, as follows: the world is the totality of non-redundant statistics, not of things.","authors":["James Ladyman","Don Ross"],"meta":["January 2013","DOI:10.1093/acprof:oso/9780199696499.003.0006","In book: Scientific Metaphysics (pp.108-150)"],"references":["303592329_Ontic_Structural_Realism_and_Modality","322487154_Metaphor_Meaning_and_Cognition","321606921_Bohmian_Mechanics_and_Quantum_Theory_An_Appraisal","313707024_Science_Metaphysics_and_Structural_Realism","304404191_On_the_method_of_isolation_in_economics","297876070_Many_Worlds_Everett_Quantum_Theory_and_Reality","297257060_Identification_of_causal_effects_using_instrumental_variables_-_Reply","290038750_Wandering_Significance_An_Essay_on_Conceptual_Behaviour","288292995_Apart_from_Universes","286002054_Elementary_quantum_metaphysic"]}