{"id":"284900718_Image_Encryption_Using_Koblitz's_Encoding_and_New_Mapping_Method_Based_on_Elliptic_Curve_Random_Number_Generator","abstract":"Elliptic Curve Cryptography (ECC) has attractive advantages compared\nto other public-key cryptosystems that motivated cryptographers for using\nit. ECC offers equal security for a smaller key sizes, thereby reducing processing\noverhead, making it ideal for small devices, key agreement protocols and digital\nsignature applications. Images are data types that occasionally include secret information,\nsuch as faces, places and signatures. Encryption scheme is a technique\nto protect images secrecy by encrypting them before transmission over public networks\nand unsecured channels. In this paper, we proposed an image encryption\nscheme which is based on computational operations (Add, Double, Multiply) on\npoints that lie on a predefined elliptic curve (EC). For any ECC-based encryption\nscheme, converting a message (image pixel) to a coordinate on an affine curve is\na mandatory prerequisite. The proposed image encryption scheme utilizes, both,\nthe Koblitz’s encoding method and the novel proposed mapping method to convert\npixels of a plainimage into coordinates of the predefined EC-points. Then,\naddition of the resulting points with the points resulting from the Chaos-Driven\nElliptic Curve Pseudo-random Number Generator (C-D ECPRNG) is considered\nfor completion of the image encryption process. Discussing Koblitz’s encoding\nmethod, creating the mapping table, the converting process and the encryption\nitself are given in detail along with their implementation. Finally, drawing ECpoints\nis done to show changes in the distribution of points in each case.","authors":["Omar Reyad","Zbigniew Adam Kotulski"],"meta":["November 2015","DOI:10.1007/978-3-319-26404-2","Conference: 8th International Conference on Multimedia Communications, Services and Security, Kraków, PolandAt: Kraków, PolandVolume: 566"],"references":["304992962_Image_Encryption_using_Chaos-Driven_Elliptic_Curve_Pseudo-Random_Number_Generators","289894907_ECC-Based_Image_Encryption_Using_Code_Computing","278962935_Image_Encryption_Using_Chaos-Driven_Elliptic_Curve_Pseudo-random_Number_Generators","268217517_Statistical_Analysis_of_the_Chaos-Driven_Elliptic_Curve_Pseudo-random_Number_Generators","268076685_On_Pseudo-Random_Number_Generators_Using_Elliptic_Curves_and_Chaotic_Systems","267061283_Pseudorandom_number_generators_from_elliptic_curves","316072195_Elliptic_Curve_Cryptosystems","275344598_Ergodic_Theory","266954227_The_Arithmetic_of_Elliptic_Curves","266182191_Permutation_based_Image_Encryption_Technique"]}