{"id":"285042546_StreptomeDB_20_-_An_extended_resource_of_natural_products_produced_by_streptomycetes","abstract":"Over the last decades, the genus Streptomyces has stirred huge interest in the scientific community as a source of bioactive compounds. The majority of all known antibiotics\nis isolated from these bacterial strains, as well as a variety of other drugs such as antitumor agents, immunosuppressants\nand antifungals. To the best of our knowledge, StreptomeDB was the first database focusing on compounds produced by streptomycetes.\nThe new version presented herein represents a major step forward: its content has been increased to over 4000 compounds and\nmore than 2500 host organisms. In addition, we have extended the background information and included hundreds of new manually\ncurated references to literature. The latest update features a unique scaffold-based navigation system, which enables the\nexploration of the chemical diversity of StreptomeDB on a structural basis. We have included a phylogenetic tree, based on\n16S rRNA sequences, which comprises more than two-thirds of the included host organisms. It enables visualizing the frequency,\nappearance, and persistence of compounds and scaffolds in an evolutionary context. Additionally, we have included predicted\nMS- and NMR-spectra of thousands of compounds for assignment of experimental data. The database is freely accessible via http://www.pharmaceutical-bioinformatics.org/streptomedb.","authors":["Dennis Klementz","Kersten Döring","Xavier Lucas","Kiran Kumar Telukunta"],"meta":["November 2015Nucleic Acids Research 44(D1):gkv1319","DOI:10.1093/nar/gkv1319"],"references":["281110148_Minimum_Information_about_a_Biosynthetic_Gene_cluster","280388761_The_effects_of_some_avermectins_on_bovine_carbonic_anhydrase_enzyme","280093715_Commentary_Toward_a_new_focus_in_antibiotic_and_drug_discovery_from_the_Streptomyces_arsenal","320258551_BLAST_architecture_and_applications","302342160_BLAST_architecture_and_applications","292374508_Database_resources_of_the_National_Center_for_Biotechnology_Information","286195113_BLAST_plus_architecture_and_applications","280969277_A_Rationale_for_Age-Adapted_Immunosuppression_in_Organ_Transplantation","280536079_Natural_products_as_biofuels_and_bio-based_chemicals_fatty_acids_and_isoprenoids","279728224_Role_of_Open_Source_Tools_and_Resources_in_Virtual_Screening_for_Drug_Discovery"]}