{"id":"285056707_Agile_Values_and_Their_Implementation_in_Practice","abstract":"Today agile approaches are often used for the development of digital products. Since their development in the 90s, Agile Methodologies, such as Scrum and Extreme Programming, have evolved. Team collaboration is strongly influenced by the values and principles of the Agile Manifesto. The values and principles described in the Agile Manifesto support the optimization of the development process. In this article, the current operation is analyzed in Agile Product Development Processes. Both, the cooperation in the project team and the understanding of the roles and tasks will be analyzed. The results are set in relation to the best practices of Agile Methodologies. A quantitative questionnaire related to best practices in Agile Product Development was developed. The study was carried out with 175 interdisciplinary participants from the IT industry. For the evaluation of the results, 93 participants were included who have expertise in the subject area Agile Methodologies. On one hand, it is shown that the collaborative development of product-related ideas brings benefits. On the other hand, it is investigated which effect a good understanding of the product has on decisions made during the implementation. Furthermore, the skillset of product managers, the use of pair programming, and the advantages of cross-functional teams are analyzed.","authors":["Eva-Maria Schön","M.J. Escalona","Jörg Thomaschewski"],"meta":["January 2015International Journal of Interactive Multimedia and Artificial Intelligence 3(5):61-66","DOI:10.9781/ijimai.2015.358","Project: MEGUS- Guided Mechanism in early phases for software improvement (TIN2013-46928-C3-3-R)"],"references":["306482222_Forschungsmethoden_und_Evaluation_fur_Human-_und_Sozialwissenschaftler","265915092_Social_Networks_as_Learning_Environments_for_Higher_Education","264556102_Menschzentriertes_Vorgehensmodell_fur_einen_agilen_Produktentwicklungsprozess","313713566_The_new_new_product_development_game","292765298_Sketching_User_Experience_Getting_the_Design_Right_and_the_Right_Design","290487121_Scrum_development_process","263849049_Extreme_Programming_Explained_Embrace_Change","262235371_User_stories_don't_help_users_Introducing_persona_stories","254004045_What_Agile_Teams_Think_of_Agile_Principles","248656667_Agile_project_management_with_SCRUM"]}