{"id":"285070096_Strategic_E-Tourism_Alternatives_for_Destinations","abstract":"Destinations face the already well known problem of a proper positioning in the electronic market place. This includes, besides other issues, mainly the problem of a sustainable business model and booking support. In this paper the Austrian case is described, which is somehow special since Austria was once a leader in e-tourism, both w.r.t. to academic as well to industrial achievements. However, this has changed over the last years. This change was also recognized by major stakeholders, leading to a study to (a) analyse the current situation, and (b) to identify strategic alternatives as future options. These strategic alternatives were based on the results of a status quo analysis of the national and international e-tourism situation, including a website analysis of national and international tourism organisations, interviews with representatives of Austrian organisations and an analysis of IT trends relevant to the tourism industry. The paper describes the results of these analyses, specifies the problem and, finally, presents the identified alternatives. Regarding the latter, the focus is on the description of a so-called “open service platform”, which contains means to support cooperation, online distribution, innovation as well as research.","authors":["María del Carmen Calatrava Moreno","Gernot Hörhager","Rainer Schuster","H. Werthner"],"meta":["December 2015","DOI:10.1007/978-3-319-14343-9_30"],"references":["243772913_Information_Technology_and_Tourism_A_Challenging_Relation","228604200_A_Websites_Analysis_of_European_Tourism_Organizations","222696021_Progress_in_Information_Technology_and_Tourism_Management_20_Years_on_and_10_Years_After_the_Internet-The_State_of_eTourism_Research","291287345_E-destinations_Global_Best_Practice_in_Tourism_Technologies_and_Applications","220425044_Technology_strategy_and_management_-_The_puzzle_of_Apple","220420334_Technology_strategy_and_managementThe_evolution_of_platform_thinking"]}