{"id":"285120337_Introduction_Sections_of_Research_Articles_with_High_and_Low_Citation_Indices","abstract":"Citation index for publication is one of the sought-after criteria for university ranking and\nit contributes to significant merits in an academician’s performance evaluation. Citation\nindices are systematically generated to indicate the number of times a paper is cited by other\nwriters. As such, it is deemed to be more neutral and unprejudiced in determining the value\nof the research articles. In view of the importance of citation index, this study compares the\nstrategies used in presenting research work in the introductory sections of highly cited research\narticles and those that have never been cited. In order to be cited, the introduction section of\nthe research article must be able to capture the interest of readers, which includes editors,\nreviewers, and the research community. Otherwise, readers may choose to read or cite other\narticles. Given the importance and complexity of an article, the introduction section is deemed\nto be the most challenging section to write by many scientific writers. Therefore, this paper\ncompares the presentation of the introduction sections of Computer Science research articles\nin highly cited articles and those that have never been cited. A total of 127 research articles\npublished in Scopus-indexed journals written by academicians from Malaysian universities\nwere analysed using move analysis. The scheme for move analysis is derived from the CARS\nmodel (Swales, 2004). Apart from promoting the findings obtained in the research work, this\nstudy also suggests that the highly cited research articles have higher percentages of strategy\nrealisation compared to research articles that have low citation.","authors":["Ina Suryani","Aizan Yaacob","Noor Hashima Abd Aziz"],"meta":["May 2015Pertanika Journal of Social Science and Humanities 23(4):1139-1152","Project: Covid-19, Edisi Khas 2020, PENDETA, Journal of Malay Language,  Education and Literature"],"references":["290767199_4_Rhetorical_moves_in_biochemistry_research_articles","289269972_The_research_imperative_in_the_evolving_environment_of_public_universities_in_Malaysia","286109571_Wordlists_Analysis_Specialised_Language_Categories","280764562_Comparison_on_the_Rhetorical_Promotional_Strategies_used_in_Performing_Art_and_Visual_Art_Research_Articles","268293082_Exploring_Sub-Disciplinary_Variations_and_Generic_Structure_of_Applied_Linguistics_Research_Article_Introductions_Using_CARS_Model","258566312_Rhetorical_Structures_in_Academic_Research_Writing_by_Non-_Native_Writers","281082405_Reconciling_efforts_to_understand_engineering_intellect_Research_articles_from_linguistic_perspective","268007986_The_Impact_of_E-Journals_on_the_Malaysian_Scholarly_Community","265143370_Writing_Scientific_Research_Articles_in_Thai_and_English_Similarities_and_Differences","257603813_The_purpose_of_this_study_is_to_Connecting_lexical_bundles_and_moves_in_research_article_introductions"]}