{"id":"285207867_Checkpointing_in_Failure_Recovery_in_Computing_and_Data_Transmission","abstract":"A task with ideal execution time T such as the execution of a computer program or the transmission of a file on a data link may fail. A number of protocols for failure recovery have been suggested and analyzed, in particular RESUME, REPLACE and RESTART. We consider here RESTART with particular emphasis on checkpointing where the task is split into K subtasks by inserting K − 1 checkpoints. If a failure occurs between two checkpoints, the task needs to be restarted from the last checkpoint only. Various models are considered: the task may have a fixed (T ≡ t) or a random length, and the spacing of checkpoints may be equidistant, non-equidistant or random. The emphasis here is on tail asymptotics for the total task time X in the same vein as the study of Asmussen et al.[5] on simple RESTART. For a fixed task length (T ≡ t) and certain types of failure mechanism, for example Poisson, the conclusion of the study is clear and not unexpected: the essential thing to control for minimizing large delays is making the maximal distance between checkpoints as small as possible. For random unbounded task length, it is seen that the effect of checkpointing is limited in the sense that the tail of X remains power-like as for simple RESTART (K = 1).","authors":["Søren Asmussen","Lester Lipsky","Stephen Thompson"],"meta":["June 2014","DOI:10.1007/978-3-319-08219-6_18","Conference: International Conference on Analytical and Stochastic Modeling Techniques and Applications"],"references":["324932789_An_Introduction_to_Probability_Theory_and_its_Applications","305982422_Importance_Sampling_for_Failure_Probabilities_in_Computing_and_Data_Transmission","305972864_Checkpointing_for_the_RESTART_problem_in_Markov_networks","298025872_ON_MODELLING_THE_PERFORMANCE_AND_RELIABILITY_OF_MULTIMODE_COMPUTER_SYSTEMS","284742933_The_Completion_Time_of_Programs_on_Processors_Subject_to_Failure_and_Repair","275624150_An_Introduction_to_Probability_Theory_and_Its_Applications","275619177_An_Introduction_To_Probability_Theory_And_Its_Applications","271512884_Stopped_Random_Walks","270255219_Applied_Probability_and_Queues","268827810_The_equivalence_of_the_uniform_renewal_theorems_and_their_criteria"]}