{"id":"285270869_An_Analysis_of_the_Factors_Affecting_Keypoint_Stability_in_Scale-Space","abstract":"The most popular image matching algorithm SIFT, introduced by D. Lowe a\ndecade ago, has proven to be sufficiently scale invariant to be used in\nnumerous applications. In practice, however, scale invariance may be weakened\nby various sources of error inherent to the SIFT implementation affecting the\nstability and accuracy of keypoint detection. The density of the sampling of\nthe Gaussian scale-space and the level of blur in the input image are two of\nthese sources. This article presents a numerical analysis of their impact on\nthe extracted keypoints stability. Such an analysis has both methodological and\npractical implications, on how to compare feature detectors and on how to\nimprove SIFT. We show that even with a significantly oversampled scale-space\nnumerical errors prevent from achieving perfect stability. Usual strategies to\nfilter out unstable detections are shown to be inefficient. We also prove that\nthe effect of the error in the assumption on the initial blur is asymmetric and\nthat the method is strongly degraded in presence of aliasing or without a\ncorrect assumption on the camera blur.","authors":["Ives Rey-Otero","Jean-Michel Morel","Mauricio Delbracio"],"meta":["November 2016Journal of Mathematical Imaging and Vision 56(3)","DOI:10.1007/s10851-016-0657-5","SourcearXiv"],"references":["292943489_Computing_an_Exact_Gaussian_Scale-Space","283754272_Anatomy_of_the_SIFT_method","279396794_Scale-Space_Theory_in_Computer_Vision","265543099_Non-parametric_Sub-pixel_Local_Point_Spread_Function_Estimation","319770432_Evaluating_color_descriptors_for_object_and_scene_recognition","313527089_Distinctive_image_features_from_scale-invariant_key_points","313522833_PCA-SIFT_A_more_distinctive_representation_for_local_image_descriptors","279354845_Scale-Space_Theory_in_Computer_Vision","275057952_SURF_Speeded_up_robust_features","272622794_An_analysis_of_scale-space_sampling_in_SIFT"]}