{"id":"285236009_A_Methodological_Framework_for_Teaching_Evaluating_and_Informing_NIME_Design_with_a_Focus_on_Expressiveness_and_Mapping","abstract":"The maturation process of the NIME field has brought a growing interest in teaching the design and implementation of Digital Music Instruments (DMIs) as well as in finding objective evaluation methods to assess the suitability of these outcomes. In this paper we propose a methodology for teaching NIME design and a set of tools meant to inform the design process. This approach has been applied in a master course focused on the exploration of expressiveness and on the role of the mapping component in the NIME creation chain, through hands-on and self-reflective approach based on a restrictive setup consisting of smart-phones and the Pd programming language. Working Groups were formed, and a 2-step DMI design process was applied, including 2 performance stages. The evaluation tools assessed both System and Performance aspects of each project, according to Listeners' impressions after each performance. Listeners' previous music knowledge was also considered. Through this methodology, students with different backgrounds were able to effectively engage in the NIME design processes, developing working DMI prototypes according to the demanded requirements; the assessment tools proved to be consistent for evaluating NIMEs systems and performances, and the fact of informing the design processes with the outcome of the evaluation, showed a traceable progress in the students' outcomes.","authors":["Sergi Jordà","Sebastian Mealla"],"meta":["January 2014","Conference: Proceedings of the International Conference on New Interfaces for Musical Expression (NIME)At: London, UK"],"references":["262173831_Creating_New_Interfaces_for_Musical_Expression","254214306_Longitudinal_Evaluation_of_the_Integration_of_Digital_Musical_Instruments_into_Existing_Compositional_Work_Processes","243784414_Some_remarks_on_musical_instrument_design_at_STEIM","318494464_Pure_data_another_integrated_computer_music_environment","270819325_Trends_in_Gestural_Control_of_Music_CD-ROM","270819294_Digital_Lutherie_Crafting_musical_computers_for_new_musics'_performance_and_improvisation","270056518_Interactive_Composing_An_Overview","265311188_Real-time_Human_Interaction_with_Supervised_Learning_Algorithms_for_Music_Composition_and_Performance","259410491_Digital_Musical_Interactions_Performer-system_relationships_and_their_perception_by_spectators","243784404_Evaluation_of_Input_Devices_for_Musical_Expression_Borrowing_Tools_from_HCI"]}