{"id":"285383680_Towards_more_targeted_recommendations_in_folksonomies","abstract":"Recommender systems are now popular both commercially as well as within the research community, where many approaches have been suggested for providing recommendations. Folksonomies’ users are sharing items (e.g., movies, books, and bookmarks) by annotating them with freely chosen tags. Within the Web 2.0 age, users become the core of the system since they are both the contributors and the creators of the information. In this respect, it is of paramount importance to match their needs for providing a more targeted recommendation. In this paper, we consider a new dimension in a folksonomy classically composed of three dimensions <users,tags,resources> and propose an approach to group users with close interests through quadratic concepts. Then, we use such structures in order to propose our personalized recommendation system of users, tags, and resources. We carried out extensive experiments on two real-life datasets, i.e., MovieLens and BookCrossing which highlight good results in terms of precision and recall as well as a promising social evaluation. Moreover, we study some of the key assessment metrics namely coverage, diversity, adaptivity, serendipity, and scalability. Finally, we conduct a user study as a valuable complement to our evaluation in order to get further insights.","authors":["Mohamed Nader Jelassi","Sadok Ben Ben Yahia","Engelbert Mephu Nguifo"],"meta":["November 2015Social Network Analysis and Mining 5(1)","DOI:10.1007/s13278-015-0307-8"],"references":["287952027_Comparative_recommender_system_evaluation_Benchmarking_recommendation_frameworks","262324395_Scalable_Mining_of_Frequent_Tri-concepts_from_Folksonomies","262242587_A_personalized_recommender_system_based_on_users'_information_in_folksonomies","259087487_A_Personalised_Recommendation_System_for_Context-Aware_Suggestions","326340691_Ontologies_are_Us_A_Unified_Model_of_Social_Networks_and_Semantics","301222514_Modern_Information_Retrieval","290060080_Learning_from_User_Interactions_for_Recommending_Content_in_Social_Media","272956487_Who_tags_what","265111680_USER_PROFILING_BASED_ON_FOLKSONOMY_INFORMATION_IN_WEB_20_FOR_PERSONALISED_RECOMMENDER_SYSTEMS","261961547_Facing_the_cold_start_problem_in_recommender_systems"]}