{"id":"285347759_On_the_Impossibility_of_Basing_Oblivious_Transfer_and_Bit_Commitment_on_Weakened_Security_Assumptions","abstract":"We consider the problem of basing Oblivious Transfer (OT)\nand Bit Commitment (BC), with information theoretic security, on seemingly weaker primitives.We introduce a general model for describing such primitives, called Weak Generic Transfer (WGT). This model includes as important special cases Weak Oblivious Transfer (WOT), where both\nthe sender and receiver may learn too much about the other party's input, and a new, more realistic model of noisy channels, called unfair noisy channels. An unfair noisy channel has a known range of possible noise levels; protocols must work for any level within this range against adversaries who know the actual noise level. We give a precise characterization for when one can base OT on WOT. When the deviation of the WOT from the ideal is above a certain threshold, we show that no information-theoretic reductions from OT (even against passive adversaries) and BC exist; when the deviation is below this threshold, we give a reduction from OT (and hence BC) that is information-theoretically secure against active adversaries.\nFor unfair noisy channels we show a similar threshold phenomenon for bit commitment. If the upper bound on the noise is above a threshold (given as function of the lower bound) then no information-theoretic reduction from OT (even against passive adversaries) or BC exist; when it is below this threshold we give a reduction from BC. As a partial result, we give\na reduction from OT to UNC for smaller noise intervals.","authors":["Ivan B. Damgård","Joe Kilian","Louis Salvail"],"meta":["January 1999Lecture Notes in Computer Science 1592(37):56-73","DOI:10.7146/brics.v5i37.19442"],"references":["285347664_Efficient_cryptographic_protocols_based_on_noisy_channels","225131138_Equivalence_Between_Two_Flavours_of_Oblivious_Transfers","225128191_Perfect_Zero-Knowledge_Arguments_for_NPUsing_Any_One-Way_Permutation","221347892_Verifiable_Disclosure_of_Secrets_and_Applications_Abstract","221347890_Oblivious_Transfers_and_Privacy_Amplification","220431215_Proofs_that_Yield_Nothing_But_Their_Validity_for_All_Languages_in_NP_Have_Zero-Knowledge_Proof_Systems","3498806_Achieving_oblivious_transfer_using_weakened_security_assumptions","3079140_Oblivious_Transfers_and_Intersecting_Codes","3078866_Generalized_Privacy_Amplification","2590077_Construction_of_a_Pseudo-Random_Generator_From_Any_One-Way_Function","242697671_Secret_key_agreement_by_public_discussion","222457947_Universal_classes_of_hash_functions","221590167_A_General_Completeness_Theorem_for_Two-Party_Games","220574988_Universal_Classes_of_Hash_Functions","3078257_Secret_key_agreement_by_public_discussion","2325688_On_the_Foundations_of_Oblivious_Transfer"]}