{"id":"285358562_Studying_Gender_Bias_in_Physics_Grading_The_role_of_teaching_experience_and_country","abstract":"The existence of gender-STEM (science, technology, engineering, and mathematics) stereotypes has been repeatedly documented. This article examines physics teachers’ gender bias in grading and the influence of teaching experience in Switzerland, Austria, and Germany. In a 2 × 2 between-subjects design, with years of teaching experience included as moderating variable, physics teachers (N = 780) from Switzerland, Austria, and Germany graded a fictive student's answer to a physics test question. While the answer was exactly the same for each teacher, only the student's gender and specialization in languages vs. science were manipulated. Specialization was included to gauge the relative strength of potential gender bias effects. Multiple group regression analyses, with the grade that was awarded as the dependent variable, revealed only partial cross-border generalizability of the effect pattern. While the overall results in fact indicated the existence of a consistent and clear gender bias against girls in the first part of physics teachers’ careers that disappeared with increasing teaching experience for Swiss teachers, Austrian teachers, and German female teachers, German male teachers showed no gender bias effects at all. The results are discussed regarding their relevance for educational practice and research.","authors":["Sarah Hofer"],"meta":["November 2015International Journal of Science Education 37(17):2879-2905","DOI:10.1080/09500693.2015.1114190"],"references":["323792750_Enhancing_Physics_Learning_With_Cognitively_Activating_Instruction_A_Quasi-Experimental_Classroom_Intervention_Study","319949850_The_test_of_basic_Mechanics_Conceptual_Understanding_bMCU_using_Rasch_analysis_to_develop_and_evaluate_an_efficient_multiple_choice_test_on_Newton's_mechanics","291034939_Implicit_theories_of_mathematics_and_physics_teachers_on_gender-specific_giftedness_and_motivation","280295804_Women's_Representation_in_Science_Predicts_National_Gender-Science_Stereotypes_Evidence_From_66_Nations","278971791_MCKAYJOAN_VERSUS_MCKAYJOHN_-_DO_GENDER_STEREOTYPES_BIAS_EVALUATIONS","277682249_A_Continuum_of_Impression_Formation_from_Category-Based_to_Individuating_Processes_Influences_of_Information_and_Motivation_on_Attention_and_Interpretation","277502892_Reducing_the_gender_gap_in_the_physics_classroom","274410257_Leistungsbeurteilungen_von_Schulkindern","273134799_Estimating_the_Dimension_of_a_Model","271665610_What's_in_a_name_Experiments_with_blind_marking_in_A-level_examinations"]}