{"id":"285490703_Objects_Worlds_and_Students_Virtual_Interaction_in_Education","abstract":"The main aim of this study is to form a complete taxonomy of the types of interactions that relate to the use of a virtual world for engaging learning experiences, when blended and hybrid learning methods are to be used. In order to investigate this topic more accurately and effectively, we distinguish four dimensions of interactions based on the context in which these occur, and the involved parts: in-world and in-class, user-to-user and user-to-world interactions. In order to conduct investigation into this topic and form a view of the interactions as clear as possible, we observed a cohort of 15 undergraduate Computer Science students while using an OpenSim-based institutionally hosted virtual world. Moreover, we ran a survey where 50 students were asked to indicate their opinion and feelings about their in-world experience. The results of our study highlight that educators and instructors need to plan their in-world learning activities very carefully and with a focus on interactions if engaging activities are what they want to offer their students. Additionally, it seems that student interactions with the content of the virtual world and the in-class student-to-student interactions, have stronger impact on students’ engagement when hybrid methods are used.","authors":["Athanasios Christopoulos","Marc Conrad","Mitul Shukla"],"meta":["September 2014Education Research International 2014(4)","DOI:10.1155/2014/318317"],"references":["272164429_Towards_a_framework_for_the_design_of_mixed_reality_immersive_education_spaces","268041441_Learners'_Experience_of_Presence_in_Virtual_Worlds","267218572_Learner_immersion_engagement_in_the_3D_virtual_world_Principles_emerging_from_the_DELVE_project","266347691_The_Avatar_as_a_Knowledge_Worker_How_Immersive_3D_Virtual_Environments_may_Foster_Knowledge_Acquisition","266079881_An_Alternative_to_Reality","261027588_End-user_programming_deconstrutionalism_for_collaborative_mixed_reality_laboratory_co-creative_activities","258513937_Maintaining_Context_in_a_Changing_Virtual_World_-_Educators'_Perspectives_for_OpenSim_and_Second_Life","258513934_Immersion_in_Virtual_Worlds_-_But_not_Second_Life","347784146_Virtual_Worlds_in_Health_Care_Higher_Education","338950489_Of_mice_or_men_-_The_avatar_in_the_virtualscape"]}