{"id":"285597379_Underwater_Photogrammetry_and_Object_Modeling_A_Case_Study_of_Xlendi_Wreck_in_Malta","abstract":"In this paper we present a photogrammetry-based approach for deep-sea underwater surveys conducted from a submarine and guided by knowledge-representation combined with a logical approach (ontology). Two major issues are discussed in this paper. The first concerns deep-sea surveys using photogrammetry from a submarine. Here the goal was to obtain a set of images that completely covered the selected site. Subsequently and based on these images, a low-resolution 3D model is obtained in real-time, followed by a very high-resolution model produced back in the laboratory. The second issue involves the extraction of known artefacts present on the site. This aspect of the research is based on an a priori representation of the knowledge involved using systematic reasoning. Two parallel processes were developed to represent the photogrammetric process used for surveying as well as for identifying archaeological artefacts visible on the sea floor. Mapping involved the use of the CIDOC-CRM system (International Committee for Documentation (CIDOC)—Conceptual Reference Model)—This is a system that has been previously utilised to in the heritage sector and is largely available to the established scientific community. The proposed theoretical representation is based on procedural attachment; moreover, a strong link is maintained between the ontological description of the modelled concepts and the Java programming language which permitted 3D structure estimation and modelling based on a set of oriented images. A very recently discovered shipwreck acted as a testing ground for this project; the Xelendi Phoenician shipwreck, found off the Maltese coast, is probably the oldest known shipwreck in the western Mediterranean. The approach presented in this paper was developed in the scope of the GROPLAN project (Généralisation du Relevé, avec Ontologies et Photogrammétrie, pour l'Archéologie Navale et Sous-marine). Financed by the French National Research Agency (ANR) for four years, this project associates two French research laboratories, an industrial partner, the University of Malta, and Texas A & M University.","authors":["Pierre Drap","Djamel Djamal Merad","Bilal Hijazi","Lamia Gaoua"],"meta":["December 2015Sensors 15(12):30351-30384","DOI:10.3390/s151229802","Project: Phoenician Shipwreck Project"],"references":["281649272_Quality_management_of_3D_cultural_heritage_replicas_with_CIDOC-CRM","274210766_Partial_3d-object_retrieval_using_level_curves","260845627_Underwater_Photogrammetry_for_Archaeology_What_Will_Be_the_Next_Step","248386151_Fusion_reversible_Application_a_l'information_l'archeologique","316083270_Systeme_de_prise_d'images_permettant_l'odometrie_en_temps_reel_et_la_realisation_d'un_modele_tridimensionnel","298618657_Ask_Not_What_Your_Text_Can_do_For_You_Ask_What_You_Can_do_For_Your_Text_a_Dictionary's_perspective","277683949_SBA","262965924_The_Geometry_of_Multiple_Images_The_Laws_that_Govern_the_Formation_of_Multiple_Images_of_a_Scene_and_Some_of_Their_Applications","256192995_Principles_of_Archaeological_Stratigraphy","251489897_A_new_approach_for_the_bundle_adjustment_problem_with_fixed_constraints_in_stereo_vision","248386110_Fusion_de_connaissances_Applications_aux_releves_photogrammetriques_de_fouilles_archeologiques_sous-marines","238693892_Design_of_a_Computer-based_Frame_to_Store_Manage_and_Divulge_Information_from_Underwater_Archaeological_Excavations_the_Pepper_Wreck_Case","236155248_Methodology_for_CIDOC_CRM_based_data_integration_with_spatial_data","230510026_Preliminay_report_on_recording_methods_used_for_the_investigation_of_merchant_shipwrecks_at_Jutholmen_and_Alvsnabben_in_1973-74","229822576_Recording_Techniques_used_during_the_excavation_of_the_Batavia"]}