{"id":"285569166_Antecedentes_a_transicao_de_carreira_dos_profissionais_de_Tecnologia_da_Informacao","abstract":"RESUMO Na pesquisa aqui relatada, investigou-se a migração dos profissionais de Tecnologia da Informação (TI) para outras áreas funcionais, fenômeno denominado turnaway, por meio da identificação dos antecedentes associados à intenção dos profissionais de TI em abandonar essa área. Para atingir esse objetivo, realizou-se uma pesquisa explanatória, operacionalizada por meio de uma revisão bibliográfica, visando à proposição de um modelo estrutural que explicasse tal fenômeno, assim como à elaboração das respectivas hipóteses de pesquisa associadas à transição de carreira do profissional de TI. Em seguida, por meio de investigação empírica operacionalizada via web-survey e aplicação de técnicas estatísticas multivariadas de modelagem de equações estruturais, testaram-se o modelo proposto e as hipóteses elencadas. Como resultado, foram suportados como antecedentes estatisticamente significantes da transição de carreira do profissional de TI para outras áreas funcionais: exaustão com o trabalho na área de TI, insatisfação com a área de TI em geral, necessidade de adquirir novas experiências profissionais para se manter atrativo ao mercado de trabalho, necessidade de crescimento profissional, assim como prévia e consciente capacitação e desenvolvimento gerenciais. Ao final, foram apresentadas as implicações gerenciais oriundas deste trabalho e as limitações da pesquisa.","authors":["Ursula Barreto Mangia","Luiz Antonio Joia"],"meta":["December 2015Revista de Administração 50(4):541-560","DOI:10.5700/rausp1218"],"references":["313752737_Marketing_Scales_Handbook_-_Vol_9_sample","307658160_Proposicao_de_um_modelo_exploratorio_dos_fatores_relevantes_para_o_desempenho_profissional_do_CIO_brasileiro","280319055_Cultura_Organizacional_e_Estrategia_de_Mudancas_-_Recolocando_Questoes_No_Cenario_Atual","270436458_Profissionais_e_profissionalizacao_em_Tecnologia_da_Informacao_indicativos_de_controversias_e_conflitos","323424582_Statistical_power_analysis_for_the_behavioral_sciences","313604424_Evaluating_Structural_Equation_Models_with_Unobservable_Variables_and_Measurement_Error","313049536_A_three_complement_conceptualization_of_organizational_commitment","304373193_Analise_multivariada_de_dados","292753074_DP_career_paths","276168462_Transformative_Leadership_for_Engineering_in_a_Time_of_Complexity"]}