{"id":"285698707_AUC_A_misleading_measure_of_the_performance_of_predictive_distribution_models","abstract":"The area under the receiver operating characteristic (ROC) curve, known as the AUC, is currently considered to be the standard method to assess the accuracy of predictive distribution models. It avoids the supposed subjectivity in the threshold selection process, when continuous probability derived scores are converted to a binary presence–absence variable, by summarizing overall model performance over all possible thresholds. In this manuscript we review some of the features of this measure and bring into question its reliability as a comparative measure of accuracy between model results. We do not recommend using AUC for five reasons: (1) it ignores the predicted probability values and the goodness-of-fit of the model; (2) it summarises the test performance over regions of the ROC space in which one would rarely operate; (3) it weights omission and commission errors equally; (4) it does not give information about the spatial distribution of model errors; and, most importantly, (5) the total extent to which models are carried out highly influences the rate of well-predicted absences and the AUC scores.","authors":["Jorge Lobo","A. Jiménez-Valverde","Raimundo Real"],"meta":["January 2008"],"references":["261174651_Sources_sinks_and_population_regulation","319536867_A_COMPARISON_OF_GOODNESS-OF-FIT_TESTS_FOR_THE_LOGISTIC_REGRESSION_MODEL","299319669_Receiver_operating_characteristic_methodology","289766440_Applied_Logistic_Regression","283942163_A_comparison_of_goodness-of-fit_tests_for_the_logistic_regression_model","283410159_Stepwise_logistic_regression_Applied_logistic_regression","279430177_Butterfly_Metapopulation_Dynamics","274220216_Species_Diversity_in_Ecological_Communities_Historical_and_Geographical_Perspectives","261672209_Pulliam_HR_On_the_relationship_between_niche_and_distribution_Ecol_Lett_3_349-361","259951757_Hanski_I_Metapopulation_dynamics_Nature_396_41-49"]}