{"id":"285761031_Enactive_Cognitive_Science_Part_2_Methods_Insights_and_Potential","abstract":"Purpose: This, the second part of a two-part paper, describes how the concerns of enactive cognitive science have been realized in actual research: methodological issues, proposed explanatory mechanisms and models, some of the potential as both a theoretical and applied science, and several of the major open research questions. Findings: Despite some skepticism about \"mechanisms\" in constructivist literature, enactive cognitive science attempts to develop cognitive formalisms and models. Such techniques as feedback loops, self-organization, autocatalytic networks, and dynamical systems modeling are used to develop alternatives to cognitivist models. A number of technical similarities are starting to emerge in the different models being proposed. Research Implications: The need to resolve the interplay between autonomy and coupling with the environment suggests the need for further technical research. And the reintroduction of first-person concerns into cognitive science raises some questions of method, particularly with regard to the relationship between first-person experience, neuroscience, and methods of description, analsysis, and explanation. Results to date suggest that insights from enactive cognitive science could lead to innovations in the design of artifacts. Keywords: embodiment, mechanisms, dynamical systems modeling, puposive systems, autonomy, coupling, inter-subjectivity, morphogenesis, neurophenomenology.","authors":["Kevin McGee"],"meta":["March 2006Constructivist Foundations 1(2):73-82"],"references":["10718468_From_autopoiesis_to_neurophenomenology_Francisco_Varela's_exploration_of_the_biophysics_of_being","281095398_The_Chemical_Basis_of_Morphogenesis","248622584_Behavior_Purpose_and_Teleology","247271943_The_organ_of_form_towards_a_theory_of_biological_shape","230752664_Constructive_memory","222480342_What_Are_Plans_for","222299809_Embodied_Cognition_A_Field_Guide","222299490_Dynamical_Approaches_to_Cognitive_Science","49748002_Mirror_Neurons_and_the_Simulation_Theory_of_Mind-Reading","11648357_Radical_Embodiment_Neural_Dynamics_and_Consciousness","2865604_Embodied_Artificial_Intelligence"]}