{"id":"285746921_Improving_Protein_Fold_Recognition_by_Deep_Learning_Networks","abstract":"For accurate recognition of protein folds, a deep learning network method (DN-Fold) was developed to predict if a given query-template protein pair belongs to the same structural fold. The input used stemmed from the protein sequence and structural features extracted from the protein pair. We evaluated the performance of DN-Fold along with 18 different methods on Lindahl's benchmark dataset and on a large benchmark set extracted from SCOP 1.75 consisting of about one million protein pairs, at three different levels of fold recognition (i.e., protein family, superfamily, and fold) depending on the evolutionary distance between protein sequences. The correct recognition rate of ensembled DN-Fold for Top 1 predictions is 84.5%, 61.5%, and 33.6% and for Top 5 is 91.2%, 76.5%, and 60.7% at family, superfamily, and fold levels, respectively. We also evaluated the performance of single DN-Fold (DN-FoldS), which showed the comparable results at the level of family and superfamily, compared to ensemble DN-Fold. Finally, we extended the binary classification problem of fold recognition to real-value regression task, which also show a promising performance. DN-Fold is freely available through a web server at http://iris.rnet.Missouri.edu/dnfold.","authors":["Taeho Jo","Jie Hou","Jesse Eickholt","Jianlin Cheng"],"meta":["December 2015Scientific Reports 5(1):17573","DOI:10.1038/srep17573","Project: Protein structure prediction"],"references":["267729105_Improving_protein_fold_recognition_by_random_forest","257645351_A_study_and_benchmark_of_DNcon_A_method_for_protein_residue-residue_contact_prediction_using_deep_networks","345939135_Homology_Modeling_of_an_Algal_Membrane_Protein_Heterosigma_Akashiwo_Na-ATPase","310441413_The_Universal_Protein_Resource_UniProt_in_2010","309186321_A_practical_guide_to_training_restricted_boltzmann_machinesJ","304109482_Training_products_of_experts_by_minimizing_contrastive_divergence","272746011_A_Practical_Guide_to_Training_Restricted_Boltzmann_Machines_Version_1","270903100_The_Protein_Data_Bank","260948477_Protein_folding_structure_prediction_and_design","259782363_The_Universal_Protein_Resource_UniProt_2009"]}