{"id":"285716059_The_Added_Value_of_Argumentation","abstract":"We discuss the value of argumentation in reaching agreements, based on its capability for dealing with conflicts and uncertainty. Logic-based models of argumentation have recently emerged as a key topic within Artificial Intelligence. Key reasons for the success of these models is that they are akin to human models of reasoning and debate, and their generalisation to frameworks for modelling dialogues. They therefore have the potential for bridging between human and machine reasoning in the presence of uncertainty and conflict. We provide an overview of a number of examples that bear witness to this potential, and that illustrate the added value of argumentation. These examples amount to methods and techniques for argumentation to aid machine reasoning (e.g. in the form of machine learning and belief functions) on the one hand and methods and techniques for argumentation to aid human reasoning (e.g. for various forms of decision making and deliberation and for the Web) on the other. We also identify a number of open challenges if this potential is to be realised, and in particular the need for benchmark libraries.","authors":["Sanjay Modgil","Francesca Toni","Floris Bex","Ivan Bratko"],"meta":["January 2013","DOI:10.1007/978-94-007-5583-3_21"],"references":["284037673_The_Carneades_argumentation_framework","267723556_Uniform_Argumentation_Frameworks","321605741_Visualizing_Argumentation_Software_Tools_for_Collaborative_and_Educational_Sense-Making","316898379_Argumentation_30_How_Semantic_Web_Technologies_Can_Improve_Argumentation_Modeling_in_Web_20_Environments","307936026_Large-scale_sentiment_analysis_for_news_and_blogs","300578853_Decision_Support_for_Practical_Reasoning","289735878_Argumentation_dialogues_for_two-agent_conflict_resolution","287229058_Agent_strategies_for_ABA-based_information-seeking_and_inquiry_dialogues","285798240_Mechanism_design_for_argumentation-based_persuasion","285432624_On_the_acceptability_of_arguments_and_its_fundamental_role_in_nonmonotonic_reasoning_and_logic_programming"]}