{"id":"285883763_Blooms_Taxonomy-_Application_in_Exam_Papers_Assessment","abstract":"Testing the students' cognitive level is the prime objective of any assessment system. However, it is perhaps necessary to review and introduce steps in the examination paper design to ensure that the student is tested for the different cognitive levels of learning. Blooms Taxonomy named after Benjamin Bloom classifies the different layers of learning processes that a student goes through when the learning objectives are set for them in a teaching program. In an educational environment where an array of programs and modules are taught by different teachers with differing learning objectives, the consistency of assessment across all modules also become a major task. Essentially, this is the prevailing learning and teaching atmosphere in Caledonian College of Engineering, Sultanate of Oman. This paper explores the elements of Blooms Taxonomy in examination assessment system in this college. Further, the methodology adopted by the assessment office of the College, in testing the students' cognition levels (applying Blooms Taxonomy principles) and the questions for mapping the cognitive levels are illustrated. It is also felt that the application of Blooms Taxonomy system has enabled the teachers to set examination papers that are well balanced, testing the different cognitive skills without a tilt towards a tough or easy paper perception.","authors":["Ilango Sivaraman","Dinesh Krishna"],"meta":["January 2015"],"references":["201381640_Critical_Thinking_in_the_Management_Classroom_Bloom's_Taxonomy_as_a_Learning_Tool","289192571_Learning_to_teach_'Assessment_for_learning'_in_higher_education","263926510_Assessment_for_Learning_in_Higher_Education","245104165_A_Taxonomy_for_Learning_Teaching_and_Assessing_A_revision_of_Bloom''s_Taxonomy_of_Educational_Objec","237570561_BEST_PRACTICES_FOR_DESIGNING_AND_GRADING_EXAMS","44828922_A_Taxonomy_for_Learning_Teaching_and_Assessing_a_Revision_of_Bloom's_Taxonomy_of_Educational_Objectives","5205698_Assessment_of_Learning_Outcomes_in_Higher_Education_a_Comparative_Review_of_Selected_Practices"]}