{"id":"285955706_Domain_knowledge_search_behaviour_and_search_effectiveness_of_engineering_and_science_students_An_exploratory_study","abstract":"Introduction. This study sought to answer three questions: 1) Would the level of domain knowledge significantly affect the user's search behavior? 2) Would the level of domain knowledge significantly affect search effectiveness, and 3).What would be the relationship between search behaviour and search effectiveness? \nMethod. Participants were asked to rate their familiarity with 200 thesaurus terms to measure their level of domain knowledge. They also searched on three assigned topics using the COMPENDEX database. Data were collected through pre- and post-search questionnaires, thesaurus term rating form, computer logs, and search session printouts. \nAnalysis. Twenty-two engineering and science students' data were analysed both quantitatively and qualitatively. Quantitative analysis included both descriptive statistics and statistical testing, while the qualitative analysis was on the use of terms in queries. \nResults. As the level of domain knowledge increases, the user tends to do more searches and to use more terms in queries. However, the search effectiveness remained the same for all participants. \nConclusion. The level of domain knowledge seems to have an effect on search behaviour, but not on search effectiveness, and search behaviour does not seem to be related to search effectiveness. The findings are limited by the small sample size and need to be confirmed in further studies.","authors":["Xiangmin Zhang","H.G.B. Anghelescu","Xiao-Jun Yuan"],"meta":["January 2005Information Research 10(2)"],"references":["228801580_Modelling_the_Information_Seeking_Patterns_of_Engineers_and_Research_Scientists_in_An_Industrial_Environment","284612452_Cognitive_research_in_information_science_Implications_for_design","242183336_End-users_searching_the_online_catalogue_The_influence_of_domain_and_system_knowledge_on_search_patterns","223819744_Expanding_end-users'_query_statements_for_free_text_searching_with_a_search-aid_thesaurus","223000364_A_thesaural_model_of_information_retrieval","222938177_All_users_of_information_retrieval_systems_are_not_created_equal_An_exploration_into_individual_differences","220432776_The_Effects_of_Domain_Knowledge_on_Search_Tactic_Formulation"]}