{"id":"285933688_Computer_Security_and_Cryptography","abstract":"Gain the skills and knowledge needed to create effective data security systems This book updates readers with all the tools, techniques, and concepts needed to understand and implement data security systems. It presents a wide range of topics for a thorough understanding of the factors that affect the efficiency of secrecy, authentication, and digital signature schema. Most importantly, readers gain hands-on experience in cryptanalysis and learn how to create effective cryptographic systems. The author contributed to the design and analysis of the Data Encryption Standard (DES), a widely used symmetric-key encryption algorithm. His recommendations are based on firsthand experience of what does and does not work. Thorough in its coverage, the book starts with a discussion of the history of cryptography, including a description of the basic encryption systems and many of the cipher systems used in the twentieth century. The author then discusses the theory of symmetric- and public-key cryptography. Readers not only discover what cryptography can do to protect sensitive data, but also learn the practical limitations of the technology. The book ends with two chapters that explore a wide range of cryptography applications. Three basic types of chapters are featured to facilitate learning: • Chapters that develop technical skills • Chapters that describe a cryptosystem and present a method of analysis • Chapters that describe a cryptosystem, present a method of analysis, and provide problems to test your grasp of the material and your ability to implement practical solutions With consumers becoming increasingly wary of identity theft and companies struggling to develop safe, secure systems, this book is essential reading for professionals in e-commerce and information technology. Written by a professor who teaches cryptography, it is also ideal for students.","authors":["A.G. Konheim"],"meta":["May 2006","DOI:10.1002/0470083980"],"references":["284987288_A_simple_and_effective_public-key_cryptosystem","266939443_A_cryptanalytic_attack_on_the_Lu-Lee_public-key_cryptosystem","243762980_Generators_for_Certain_Alternating_Groups_with_Applications_to_Cryptography","243500074_A_New_Kind_of_Cipher_That_Would_Take_Millions_of_Years_to_Break","242929413_Some_design_criteria_for_feistel-cipher_key_schedules","233257839_A_weak_privacy_protocol_using_the_RSA_crypto_algorithm","232855200_Lucifer_a_cryptographic_algorithm","228803333_Polynomials_in_the_Nation's_Service_Using_Algebra_to_Design_the_Advanced_Encryption_Standard","227335950_Instant_Ciphertext-Only_Cryptanalysis_of_GSM_Encrypted_Communication","224333317_How_Polish_Mathematicians_Broke_the_Enigma_Cipher","222489279_Improving_the_strict_avalanche_characteristics_of_cryptographic_functions","221348472_On_Matsui's_Linear_Cryptanalysis","220446509_TRASEC_National_Security_System_for_EFTs_in_Belgium","220424760_A_High_Security_Log-in_Procedure","220376541_Influence_of_US_Cryptologic_Organizations_on_the_digital_computer_industry","3401265_Modified_Lu-Lee_cryptosystem"]}