{"id":"285924053_Preparing_teachers_to_integrate_Web_20_in_school_practice_Toward_a_framework_for_Pedagogy_20","abstract":"Web 2.0 has captured the interest and the imagination of both educators and researchers while it is expected to exert a significant impact on instruction and learning, in the context of the 21st century education. Hailed as an open collaborative learning space, many questions remain unanswered regarding the appropriate teacher preparation and the pedagogical impact of using Web 2.0 tools in the classroom practice. Do teachers feel comfortable and ready to adopt educational Web 2.0? What are their beliefs and perceptions regarding the educational potential of Web 2.0? What are the educational and contextual issues that determine teachers' challenges and decisions to use Web 2.0 in their classroom practice? This paper addresses the questions above by presenting the design and the implementation of a development program aiming to prepare teachers to make meaningful and purposeful use of Web 2.0 tools in their classroom. The model of technological pedagogical content knowledge and the authentic learning approach were the guiding principles that largely influenced the Web 2.0 pedagogical framework, which was designed and applied in this particular teacher preparation program. The program findings were encouraging as far as the participants' perceptions and beliefs towards educational Web 2.0 and the expected outcomes for the students. Implications and recommendations are drawn in relation to the use of the proposed Web 2.0 pedagogical framework to guide teachers' development and the effective implementation of Web 2.0 tools in the classroom to maximize benefits and enhance students' learning.","authors":["Athanassios Jimoyiannis","Panagiotis Tsiotakis","Dimitris Roussinos","Anastasia Siorenta"],"meta":["May 2013Australasian Journal of Educational Technology 29(2):248-267","DOI:10.14742/ajet.157","Project: Web 2.0 in Education"],"references":["285664581_Understanding_student_perceptions_and_motivation_towards_academic_blogs_An_exploratory_study","283779360_Personalised_and_self_regulated_learning_in_the_Web_20_era_International_exemplars_of_innovative_pedagogy_using_social_software","295173854_The_impact_of_blogging_on_Hong_Kong_primary_school_students'_bilingual_reading_literacy","289589400_Evaluating_the_impact_of_educational_technology_professional_development_upon_adoption_of_Web_20_tools_in_teaching","281468586_A_seismic_shift_in_epistemology","281164958_Teachers'_views_on_factors_affecting_effective_integration_of_information_technology_in_the_classroom_Developmental_scenery","279641075_Learning_about_problem_based_learning_Student_teachers_integrating_technology_pedagogy_and_content_knowledge","276935722_What_is_Web_20_Design_patterns_and_business_models_for_the_next_generation_of_software","269844058_Preparing_for_the_Real_Web_Generation","269166938_Mind_in_Society"]}