{"id":"285935974_The_flipped_classroom_A_survey_of_the_research","abstract":"Recent advances in technology and in ideology have unlocked entirely new directions for education research. Mounting pressure from increasing tuition costs and free, online course offerings is opening discussion and catalyzing change in the physical classroom. The flipped classroom is at the center of this discussion. The flipped classroom is a new pedagogical method, which employs asynchronous video lectures and practice problems as homework, and active, group-based problem solving activities in the classroom. It represents a unique combination of learning theories once thought to be incompatible-active, problem-based learning activities founded upon a constructivist ideology and instructional lectures derived from direct instruction methods founded upon behaviorist principles. This paper provides a comprehensive survey of prior and ongoing research of the flipped classroom. Studies are characterized on several dimensions. Among others, these include the type of in-class and out-of-class activities, the measures used to evaluate the study, and methodological characteristics for each study. Results of this survey show that most studies conducted to date explore student perceptions and use single-group study designs. Reports of student perceptions of the flipped classroom are somewhat mixed, but are generally positive overall. Students tend to prefer in-person lectures to video lectures, but prefer interactive classroom activities over lectures. Anecdotal evidence suggests that student learning is improved for the flipped compared to traditional classroom. However, there is very little work investigating student learning outcomes objectively. We recommend for future work studies investigating of objective learning outcomes using controlled experimental or quasi-experimental designs. We also recommend that researchers carefully consider the theoretical framework used to guide the design of in-class activities.","authors":["J.L. Bishop","Matthew Verleger"],"meta":["January 2013"],"references":["309120076_Learning_and_teaching_styles_in_engineering_education_Engr","307794022_Rich_environments_for_active_learning_a_definition","345927831_Applying_FlipInverted_Classroom_Model_In_Electrical_Engineering_To_Establish_Life_Long_Learning","345924291_Flipping_The_Classroom_To_Explore_Active_Learning_In_A_Large_Undergraduate_Course","344835926_Learning_MATLAB_in_the_Inverted_Classroom","344536696_Incorporating_Screencasts_into_Chemical_Engineering_Courses","344532353_Technology_Enabled_Support_Modules_For_The_Inverted_Entrepreneurial_Classroom","312971776_Introduction_to_peer_Assisted_learning","312438478_Remixing_chemistry_class_Two_Colorado_teachers_make_vodcasts_of_their_lectures_to_free_up_class_time_for_hands-on_activities","311532771_Rich_environments_for_active_learning_a_definition"]}