{"id":"285929806_Fundamentals_of_Knowledge_Organization","abstract":"This article is organized in 10 sections: (1) Knowledge Organization (KO) is a wide interdisciplinary field, much broader than Library and Information Science (LIS). (2) Inside LIS there have been many different approaches and traditions of KO with little mutual influence. These traditions have to a large extent been defined by new technology, for which reason the theoretical integration and underpinning has not been well considered. The most important technology-driven traditions are: a) Manual indexing and classification in libraries and reference works, b) Documentation and scientific communication, c) Information storage and retrieval by computers, d) Citation based KO and e) Full text, hypertext and Internet based approaches. These traditions taken together define very much the special LIS focus on KO. For KO as a field of research it is important to establish a fruitful theoretical frame of reference for this overall field. This paper provides some suggestions. (3) One important theoretical distinction to consider is the one between social and intellectual forms of KO. Social forms of KO are related to professional training, disciplines and social groups while intellectual organization is related to concepts and theories in the fields to be organized. (4) The social perspective includes in addition the systems of genres and documents as well as the social system of knowledge producers, knowledge intermediaries and knowledge users. (5) This social system of documents, genres and agents makes available a very complicated structure of potential subject access points (SAPs), which may be used in information retrieval (IR). The basic aim of research in KO is to develop knowledge on how to optimise this system of SAPs and its utilization in IR. (6) SAPs may be seen as signs, and their production and use may be understood from a social semiotic point of view. (7) The concept of paradigms is also helpful because different groups and interests tend to be organized according to a paradigm and to develop different criteria of relevance, and thus different criteria of likeliness in KO. (8) The basic unit in KO is the semantic relation between two concepts, and such relations are embedded in theories. (9) In classification like things are grouped together, but what is considered similar is not a trivial question. (10) The paper concludes with the considering of methods for KO. Basically the methods of any field are connected with epistemological theories. This is also the case with KO. The existing methods as described in the literature of KO fit into a classification of basic epistemological views. The debate about the methods of KO at the deepest level therefore implies an epistemological discussion.","authors":["Birger Hjørland"],"meta":["January 2003Knowledge Organization 30(2):87-111"],"references":["313590021_Questioning_the_univocity_ideal_The_difference_between_socio-cognitive_Terminology_and_traditional_Terminology","279467085_The_Classification_of_Psychology_A_Case_Study_in_the_Classification_of_a_Knowledge_Field","277826702_Book_review_of_Wallerstein_I_et_al_1996_Open_the_Social_Sciences_report_of_the_Gulbenkian_Commission_on_the_Restructuring_of_the_Social_Sciences_Stanford_Calif_Stanford_University_Press","324937048_The_Structure_of_Scientific_Revolutions","318473653_International_Encyclopedia_of_the_Social_Sciences_Quotations_Volume_19","313771107_The_social_construction_of_knowledge_organization_The_case_of_Melvil_Dewey","313389448_Paradigms_in_the_social_sciences","303284037_Ethics_in_information_science","291216210_Book_Review_of_Brian_Ellis_Truth_and_Objectivity_and_Paul_Horwich_Truth","284819882_Issues_of_pragmaticism"]}