{"id":"285936115_Incorporating_anchored_learning_in_a_C_Intelligent_Tutoring_System","abstract":"Learning programming is known to be difficult. One possible reason why students fail programming is related to the fact that traditional learning in the classroom places more emphasis on lecturing the material instead of applying the material to a real application. For some students, this teaching model may not catch their interest. As a result they may not give their best effort to understand the material given. Seeing how the knowledge can be applied to real life problems can increase student interest in learning. As a consequence, this will increase their effort to learn. Anchored learning that applies knowledge to solve real life problems may be the key to improving student performance. In anchored learning, it is necessary to provide resources that can be accessed by the student as they learn. These resources can be provided by creating an Intelligent Tutoring System (ITS) that can support the student when they need help or experience a problem. Unfortunately, there is no ITS developed for the programming domain that has incorporated anchored learning in its teaching system. Having an ITS that supports anchored learning will not only be able to help the student learn programming effectively but will also make the learning process more enjoyable. This research tries to help students learn C# programming using an anchored learning ITS named CSTutor. Role playing is used in CSTutor to present a real world situation where they develop their skills. A knowledge base using First Order Logic is used to represent the student's code and to give feedback and assistance accordingly.","authors":["Budi Hartanto","Jim Reye"],"meta":["January 2013"],"references":["2632627_Rich_Environments_for_Active_Learning_a_Definition","290628811_The_PHP_Intelligent_Tutoring_System","260790396_Developmental_Process_Model_for_the_Java_Intelligent_Tutoring_System","227963425_Using_video-based_anchored_instruction_to_enhance_learning_Taiwan's_experience"]}