{"id":"285935932_Composing_Goal_and_Scenario_Models_with_the_Aspect-Oriented_User_Requirements_Notation_Based_on_Syntax_and_Semantics","abstract":"The Aspect-oriented User Requirements Notation (AoURN) combines goal-oriented, scenario-based, and aspect-oriented concepts into a framework for requirements engineering activities. AoURN's approach to composition takes the structure of AoURN's goal and scenario notations into account. Composition is hence tailored to these two notations to balance reusability of the aspect specification and the amount of duplication it requires. Furthermore, the composition mechanism of AoURN supports advanced interleaved composition rules in addition to the traditional before, after, and around composition rules. Interleaved composition allows two scenarios to be combined without losing sight of the overall behavior of each individual scenario. Finally, AoURN employs an enhanced composition mechanism based on semantic equivalences in each of its two sub-notations. The enhanced composition mechanism ensures that a certain class of refactoring operations may be performed on an AoURN model without interfering with the desired aspect composition. An example based on a common case study illustrates the usage of interleaved and semantics-based composition for AoURN's scenario model. © Springer-Verlag Berlin Heidelberg 2013. All rights are reserved.","authors":["Gunter Mussbacher","Daniel Amyot","Jon Whittle"],"meta":["November 2013","DOI:10.1007/978-3-642-38640-4_5"],"references":["228647247_A_Model-driven_Pointcut_Language_for_More_Robust_Pointcuts","228572451_Aspect_Interference_and_Composition_in_the_Motorola_Aspect-Oriented_Modeling_Weaver","221595592_An_Aspectual_Use-Case_Driven_Approach","221496246_Joinpoint_Inference_from_Behavioral_Specification_to_Implementation","221223768_Refactoring-Safe_Modeling_of_Aspect-Oriented_Scenarios","221030062_Towards_a_Taxonomy_of_Syntactic_and_Semantic_Matching_Mechanisms_for_Aspect-Oriented_Modeling","290313392_Aspect-oriented_user_requirements_notation","238652578_Aspect-Oriented_Software_Development_with_Use_Cases","228598592_PCDiff_Attacking_the_fragile_pointcut_problem","228542323_Inducing_evolution-robust_pointcuts"]}