{"id":"286038623_Cognitive_Architectures_Game_Playing_And_Human_Evolution","abstract":"INTRODUCTION Game playing is an excellent domain for researching interactive behaviors because any time the outcomes of the interactions between people are associated with payoffs the situation can be cast as a game. Because it is usually possible to use game theory (von Neumann & Morgenstern, 1944) to calculate the optimal strategy, game theory has often been used as a framework for understanding game-playing behavior in terms of optimal and sub-optimal playing. That is, players who do not play according to the optimal game theory strategy are understood in terms of how they deviate from it. In this chapter we explore whether or not this is the right approach for understanding human game-playing behavior, and present a different perspective, based on cognitive modeling. Optimal game theory models have been shown to be predictive of competitive strategies used by some animals (see Pool, 1995 for a review), leading to the argument that the process of evolution acts as a genetic algorithm for producing optimal or near-optimal competitive behaviors. However, game theory models have not been very successful in predicting human behavior (Pool, 1995). In fact, psychological testing indicates that, from a game theory perspective, humans do not have the necessary cognitive skills to be good players. © Cambridge University Press 2006 and Cambridge University Press, 2009.","authors":["Robert West","Christian Lebiere","Dan J. Bothell"],"meta":["December 2005","DOI:10.1017/CBO9780511610721.006"],"references":["228732247_Choice_and_learning_under_uncertainty_A_case_study_in_baseball_batting","17214243_The_role_of_runs_in_probability_learning","17120109_A_model_of_learning_for_simple_repeating_binary_patterns","284867565_A_memory-based_account_of_the_prisoner's_dilemma_and_other_22_games","254284044_Research_and_Theory_on_the_Learning_of_Probabilities","225657937_Use_of_markov-encoded_sequential_information_in_numerical_signal_detection","34036423_Effect_of_first-order_conditional_probability_in_a_two-choice_learning_situation","19814826_On_probabilistic_categorization_The_Markovian_observer","15313672_Putting_game_theory_to_the_test","9410723_A_Brief_Survey_of_Variables_That_Influence_Random-Generation"]}