{"id":"286056649_Distributed_Computing_Through_Combinatorial_Topology","abstract":"Distributed Computing Through Combinatorial Topology describes techniques for analyzing distributed algorithms based on award winning combinatorial topology research. The authors present a solid theoretical foundation relevant to many real systems reliant on parallelism with unpredictable delays, such as multicore microprocessors, wireless networks, distributed systems, and Internet protocols. Today, a new student or researcher must assemble a collection of scattered conference publications, which are typically terse and commonly use different notations and terminologies. This book provides a self-contained explanation of the mathematics to readers with computer science backgrounds, as well as explaining computer science concepts to readers with backgrounds in applied mathematics. The first section presents mathematical notions and models, including message passing and shared-memory systems, failures, and timing models. The next section presents core concepts in two chapters each: first, proving a simple result that lends itself to examples and pictures that will build up readers' intuition; then generalizing the concept to prove a more sophisticated result. The overall result weaves together and develops the basic concepts of the field, presenting them in a gradual and intuitively appealing way. The book's final section discusses advanced topics typically found in a graduate-level course for those who wish to explore further.","authors":["Maurice Herlihy","D. Kozlov","Sergio Rajsbaum"],"meta":["December 2013"],"references":["226671405_Objects_shared_by_Byzantine_processes_Extended_abstract","222653876_An_Axiomatic_Approach_to_Computing_the_Connectivity_of_Synchronous_and_Asynchronous_Systems","221540559_Recursion_in_Distributed_Computing","221233643_Subconsensus_Tasks_Renaming_Is_Weaker_Than_Set_Agreement","220980416_Iterated_Shared_Memory_Models","29633361_The_Combined_Power_of_Conditions_and_Information_on_Failures_to_Solve_Asynchronous_Set_Agreement","2809054_Computable_Obstructions_To_Wait-Free_Computability","2673894_Algebraic_Spans","2099755_Branched_Coverings_Triangulations_and_3-Manifolds","262253013_Multidimensional_approximate_agreement_in_Byzantine_asynchronous_systems","258232527_Chromatic_subdivision_of_a_simplicial_complex","222457853_Wait-free_algorithms_for_fast_long-lived_renaming","220566957_Simulating_Authenticated_Broadcasts_to_Derive_Simple_Fault-Tolerant_Algorithms","220131298_Francez_N_Decomposition_of_Distributed_Programs_into_Communication-Closed_Layers_Sci_Comput_Program_23_155-173"]}