{"id":"286014466_New_perspective_to_educational_technology_Interdisciplinary_cooperation_an_example_of_faculties_of_education_and_engineering","abstract":"During the phase of developing new technologies and models to be used in education and for their integration, not only the technical studies and research but also the human factor which is a significant factor for the education system should be taken into consideration. Hence, a reflection concerning the answer to the question of \"To what extent should the interdisciplinary studies complement each other?\" should be made. The purpose of this research is to reflect on the importance of interdisciplinary cooperation between Faculties of Engineering and Education. The study was carried out during 2007-2008 academic year. Total 57 academicians of vaious universities of Turkey were participated in the study (22 of them were selected from Faculties of Engineering and 35 of them were selected from Faculties of Education). Survey method is employed and a likert type questionnaire which inclued open-ended questions, was used as data collection tool in the study. The data analyzed by calculating mean scores of responses. Findings illustrate that cooperation between two Faculties and its share in increasing the quality of current education is essential for interdisciplinary cooperation. In addition, the significance of combining theoretical information with implementation and evaluating the outputs of these practices has been emphasized in the study. It is suggested that both disciplines should go hand in hand paving the way for educational and technological innovations.","authors":["Hasan KARAL","Tuğba Bahçekapili"],"meta":["January 2010Turkish Online Journal of Educational Technology 9(1):132-142"],"references":["267822291_Computer_Assisted_Vocabulary_Learning_Design_and_evaluation","221652090_Wizard-of-Oz_test_of_ARTUR_-_A_computer-based_speech_training_system_with_articulation_correction","220208617_Designing_the_user_interface_of_the_computer-based_speech_training_system_ARTUR_based_on_early_user_tests","26492434_How_and_Why_to_Teach_Interdisciplinary_Research_Practice","26492430_Breaking_the_Rule_of_Discipline_in_Interdisciplinarity_Redefining_Professors_Students_and_Staff_as_Faculty","288963232_Assessing_MRI_measurements_Effects_of_sustenation_gravitation_and_coarticulation","263150723_Haptics-Augmented_Simple-Machine_Educational_Tools","249929069_Constructivism_Technology_and_the_Future_of_Classroom_Learning","3687657_Design_of_speech_illumina_mentor_SIM_for_teaching_speech_to_the_hearing_impaired"]}