{"id":"286046566_Traffigram_Distortion_for_clarification_via_isochronal_cartography","abstract":"Most geographic maps visually represent physical distance; however, travel time can in some cases be more important than distance because it directly indicates availability. The technique of creating maps from temporal data is known as isochronal cartography, and is a form of distortion for clarification. In an isochronal map, congestion expands areas, while ideal travel conditions make the map shrink in comparison to the actual distance scale of a traditional map. Although there have been many applications of this technique, detailed user studies of its efficacy remain scarce, and there are conflicting views on its practical value. To attempt to settle this issue, we utilized a usercentered design process to determine which features of isochronal cartography might be most usable in practice. We developed an interactive cartographic visualization system, Traffigram, that features a novel combination of efficient isochronal map algorithms and an interface designed to give map users a quick and seamless experience while preserving geospatial integrity and aesthetics. We validated our design choices with multiple usability studies. We present our results and discuss implications for design.","authors":["Ray Hong","Yea-Seul Kim","Jong-Chul Yoon","Cecilia R. Aragon"],"meta":["April 2014","DOI:10.1145/2556288.2557224"],"references":["308694153_Using_cartograms_to_explore_temporal_data_Do_they_work","260582977_Adaptive_Composite_Map_Projections","318889816_Automatic_Generation_of_Destination_Maps","270203152_Spline_Models_for_Observational_Data","261860732_Time-Space_Maps_from_Triangulations","246763729_Maps_and_car-tograms_of_the_2004_us_presidential_election_results","245577265_Automating_the_Design_of_Graphical_Presenta-tions_of_Relational_Data","242562037_A_Note_on_Two_Problems_in_Connexion_with_Graphs","238067921_A_GENERALIZED_SOLUTION_OF_TIME-SPACE_MAPPING","236736850_Spline_Models_of_Observational_Data"]}