{"id":"286135126_Promoting_Student_Engagement_in_the_Classroom","abstract":"Background/Context: Much progress has been made toward a greater understanding of student engagement and its role in promoting a host of desirable outcomes, including academic outcomes such as higher achievement and reduced dropout, as well as various well-being and life outcomes. Nonetheless, disengagement in our schools is widespread. This may be due in part to a lack in the student engagement literature of a broad conceptual framework for understanding how students are engaged at the classroom level, and the ways in which teachers may play an active role in promoting student engagement. Purpose: The present work seeks to summarize and synthesize the literature on student engagement, providing both a greater appreciation of its importance as well as a context for how it might be better understood at the classroom level. It considers how the primary elements of the classroom environment-the student, the teacher, and the content-interact to affect engagement, and proposes a conceptual framework (based on a previously established model of classroom instruction and learning) for understanding how student engagement may be promoted in the classroom. Research Design: This study combines a review of the extant research on the structure and correlates of student engagement, with elements of an analytic essay addressing how selected literature on motivation and classroom instruction may be brought to bear on the understanding and promotion of student engagement in the classroom. Conclusions/Recommendations: This article offers a variety of research-based practical suggestions for how the proposed conceptual model-which focuses on student-teacher relationships, the relevance of the content to the students, and teachers' pedagogical and curricular competence-might be applied in classroom settings.","authors":["Matthew Joseph","Russell J. Quaglia","Michael Corso","Dawn E. Haywood"],"meta":["April 2014Teachers College Record 116(4)"],"references":["281981101_Teacher_Support_and_Adolescents'_Subjective_Well-Being_A_Mixed-Methods_Investigation","281345525_Motivational_Beliefs_Values_and_Goals","304860437_Multimedia_Learning_Second_Edition","303282603_Withdrawing_From_School","299032284_The_effects_of_family_school_and_classroom_ecologies_on_changes_in_children's_social_competence_and_emotional_and_behavioral_problems_in_first_grade","297263487_Academic_success_among_students_at_risk_for_school_failure","288895075_Higher-order_thinking_and_prospects_for_classroom_thoughtfulness","288416594_Rethinking_the_Effects_of_Classroom_Activity_Structure_on_the_Engagement_of_Low-_Achieving_Students","288384731_Students'_multiple_worlds_An_anthropological_approach_to_understanding_students'_engagement_with_school","282204033_Classroom_Learning_and_Motivation_Clarifying_and_Expanding_Goal_Theory"]}