{"id":"286109890_Visual_analytics_towards_big_data","abstract":"Visual analytics is an important method used in big data analysis. The aim of big data visual analytics is to take advantage of human's cognitive abilities in visualizing information while utilizing computer's capability in automatic analysis. By combining the advantages of both human and computers, along with interactive analysis methods and interaction techniques, big data visual analytics can help people to understand the information, knowledge and wisdom behind big data directly and effectively. This article emphasizes on the cognition, visualization and human computer interaction. It first analyzes the basic theories, including cognition theory, information theory, interaction theory and user interface theory. Based on the analysis, the paper discusses the information visualization techniques used in mainstream applications of big data, such as text visualization techniques, network visualization techniques, spatio-temporal visualization techniques and multi-dimensional visualization techniques. In addition, it reviews the interaction techniques supporting visual analytics, including interface metaphors and interaction components, multi-scale/multi-focus/multi-facet interaction techniques, and natural interaction techniques faced on Post-WIMP. Finally, it discusses the bottleneck problems and technical challenges of big data visual analytics. © Copyright 2014, Institute of Software, the Chinese Academy of Science. All Rights Reserved.","authors":["L. Ren","Yi Du","S. Ma","X.-L. Zhang"],"meta":["September 2014","DOI:10.13328/j.cnki.jos.004645"],"references":["346961202_Low-Level_Components_of_Analytic_Activity_in_Information_Visualization","319482059_The_grammar_of_graphics","313719246_On_the_semantics_of_interactive_visualizations","313579212_Hierarchical_aggregation_for_information_visualization_Overview_techniques_and_design_guidelines","313523553_DOITrees_revisited_Scalable_space-constrained_visualization_of_hierarchical_data","311593879_Geobrowsing_Creative_thinking_and_knowledge_discovery_using_geographic_visualization","308376248_Interactive_dynamics_for_visual_analysis","291961114_Ubiquitous_human-computer_interaction_in_cloud_manufacturing","290672009_Fisheye_view_for_visualization_of_large_tree_by_packing_nested_circles","289196432_DaisyVA_An_intelligent_interactive_visualization_platform_for_visual_analysis_of_multi-facet_information","277007765_Mastering_The_Information_Age_-_Solving_Problems_with_Visual_Analytics","288428435_Typical_characteristics_technologies_and_applications_of_cloud_manufacturing","285119834_The_evolution_of_big_data_as_a_research_and_scientific_topic_Overview_of_the_literature","281766567_Treemap_visualization","274233333_Information_visualization_and_visual_analytics_challenges_and_opportunities"]}