{"id":"286127445_Performance_improvement_of_least-recently-used_policy_in_web_proxy_cache_replacement_using_supervised_machine_learning","abstract":"Web proxy caching is one of the most successful solutions for improving the performance of Web-based systems. In Web proxy caching, Least-Recently-Used (LRU) policy is the most common proxy cache replacement policy, which is widely used in Web proxy cache management. However, LRU are not efficient enough andb may suffer from cache pollution with unwanted Web objects. Therefore, in this paper, LRU policy is enhanced using popular supervised machine learning techniques such as a support vector machine (SVM), a naïve Bayes classifier (NB) and a decision tree (C4.5). SVM, NB and C4.5 are trained from Web proxy logs files to predict the class of objects that would be re-visited. More significantly, the trained SVM, NB and C4.5 classifiers are intelligently incorporated with the traditional LRU algorithm to present three novel intelligent Web proxy caching approaches, namely SVM-LRU, NB-LRU and C4.5-LRU. In the proposed intelligent LRU approaches, unwanted objects classified by machine learning classifier are placed in the middle of the cache stack used, so these objects are efficiently removed at an early stage to make space for new incoming Web objects. The simulation results demonstrated that the average improvement ratios of hit ratio achieved by SVM-LRU, NB-LRU and C4.5-LRU over LRU increased by 30.15%, 32.60% and 31.05 % respectively, while the average improvement ratios of byte hit ratio increased by 32.43%, 69.56% and 28.41%, respectively.","authors":["Waqar Ali","Shamsuddin Sulaiman","N. Ahmad"],"meta":["March 2014International Journal of Advances in Soft Computing and its Applications 6(1)"],"references":["220870484_Intelligent_Client-Side_Web_Caching_Scheme_Based_on_Least_Recently_Used_Algorithm_and_Neuro-Fuzzy_System","220534694_World_Wide_Wait_A_Study_of_Internet_Scalability_and_Cache-Based_Approaches_to_Alleviate_It","3283040_Web_cache_replacement_policies_A_pragmatic_approach","290158761_A_fuzzy_algorithm_for_web_caching","258188092_A_Quantitative_Study_of_Web_Cache_Replacement_Strategies_Using_Simulation","223929585_A_sequential_feature_extraction_approach_for_Nave_Bayes_classification_of_microarray_data","220392830_Chinese_text_classification_by_the_Naive_Bayes_Classifier_and_the_associative_classifier_with_multiple_confidence_threshold_values","3998302_WebTraff_a_GUI_for_Web_proxy_cache_workload_modeling_and_analysis","3419276_Logistic_regression_in_an_adaptive_Web_cache"]}