{"id":"286114299_Use_of_internet_for_academic_purposes_among_students_in_Malaysian_institutions_of_higher_education","abstract":"Students in institutions of higher learning should take advantage of information available on the Internet in their coursework. The Internet is also utilised for social and other non-academic functions. Hence, it is desirable, for students to strike a balance in the time spent online for academic and non-academic purposes. In this study, the durations spent on the Internet for academic and non-academic purposes were investigated based on a survey on 1675 students randomly selected from five different fields of study, viz. social sciences, sciences, engineering, agriculture and computer sciences. On average, the participants accessed the Internet 4.48 hours per day. There were also significant differences in the time spent using the Internet among students in different fields of study, with computer science students spending more time online (5.61 hours per day) than the others. In terms of Internet use for academic purposes, students in social sciences, agriculture and computer sciences scored the highest. In an analysis involving all the students in this study, the total time on the Internet was found to be weakly correlated with the time spent online specifically for academic purposes. For social science students, a low but significant positive correlation existed between the overall time spent online and the time spent on the Internet for academic research. In a similar analysis carried out for science students, a negative low correlation was observed. In the fields of agriculture, engineering and computer sciences, however, no correlation was found between Internet access duration and the use of the Internet for academic purposes. The very low correlations encountered above, even though statistically significant, showed that students who spent more time on the Internet did not make much greater use of it for academic purposes as compared with students who used the Internet less.","authors":["Ahmad fauzi Mohd Ayub","W.H.W. Hamid","M.H. Nawawi"],"meta":["January 2014Turkish Online Journal of Educational Technology 13(1):232-241"],"references":["235311011_Use_of_the_internet_and_traditional_media_among_young_people","26496797_University_of_Botswana_Undergraduates_Uses_of_the_InternetImplications_on_Academic_Performance","23188055_University_Students'_Internet_Use_and_Its_Relationships_with_Academic_Performance_Interpersonal_Relationships_Psychosocial_Adjustment_and_Self-Evaluation","318774172_A_survey_of_internet_access_and_usage_among_undergraduates_in_an_african_university","313553943_Use_of_Internet_by_undergraduate_students_of_PDA_College_of_Engineering_Gulbarga","281308858_The_relationships_between_computer_and_information_technology_use_selected_learning_and_personal_development_outcomes_and_other_college_experiences","265527250_Academic_Use_of_Internet_among_Undergraduate_Students_A_Preliminary_Case_Study_in_a_Malaysian_University","257252916_Internet_addiction_among_adolescents_in_Lebanon","238398173_Addressing_the_'Seven_Principles_for_Good_Practice_in_Undergraduate_Education'_with_Internet-enhanced_Education","227906648_Proposing_a_framework_to_assess_Internet_usage_in_university_education_An_empirical_investigation_from_a_student's_perspective","223424214_Youth_and_the_Internet_Uses_and_practices_in_the_home","11811148_Internet_Use_Among_College_Students_An_Exploratory_Study"]}