{"id":"286187562_Flow_separation_in_falling_liquid_films","abstract":"Despite the use of liquid films in a wide variety of technical applications involving heat and mass transfer (e.g. nuclear reactors, cooling towers and gas turbines), where they often play an important role, the underlying momentum and heat transport processes within these thin liquid layers remain to be fully elucidated. In particular, this applies to the influence that surface waves, developing due to the film's natural instability, exert on the mentioned processes. In this context, it has been suggested by several experimental and numerical observations that momentum and heat transfer in the capillary wave region (which precedes large surface waves) undergo drastic variations. Indeed, some results have indicated the occurrence of upward flow (i.e. opposed to the gravitational acceleration) in this region. Moreover, evidence of a large increase in wall-side and interfacial transfer coefficients has also been noted. Recently, the authors have established that flow separation takes place in the capillary wave region of 2- and 3-dimensional laminar falling liquid films, partially explaining the above mentioned observations. They showed that the strong change in curvature of the liquid-gas interface in this region causes an adverse pressure gradient (due to the action of surface tension forces) sufficiently large to induce flow detachment from the wall. In the present paper, an in-depth experimental and numerical investigation of this phenomenon in terms of its kinematics and governing dynamics as well as its effect on heat transfer for two different 2-dimensional flow conditions is presented. Experimentally, velocity measurements (using Laser Doppler Velocimetry and Particle Image Velocimetry) and film thickness measurements (using a Confocal Chromatic Imaging technique) were performed in a specifically designed optical test setup. On the numerical side, simulations of the full Navier-Stokes equations as well as the energy equation using the Volume of Fluid (VOF) method were performed. In addition to these investigations, the numerical simulation of a 3-dimensional vertically falling water film, for flow conditions studied in a previous experimental contribution to the literature, was performed. Based on these data, the characteristics of capillary flow separation in the presence of 3-dimensional surface waves were studied. Results show that flow separation takes place in several areas of the resulting complex 3-dimensional capillary wave region, developing multiple separation zones in the shape of vortex tubes. In addition, spanwise flow and an associated eddy induced by the same governing mechanism are shown to occur in this region. This could explain the strong intensification of transfer to 3-dimensional liquid films.","authors":["Georg F. Dietze","Reinhold Kneer"],"meta":["August 2011Frontiers in Heat and Mass Transfer 2(3)","DOI:10.5098/hmt.v2.3.3001"],"references":["267581772_Capillary_Flow_Separation_in_2-_and_3-Dimensional_Laminar_Falling_Liquid_Films","259081872_Experimental_and_Numerical_Investigations_on_Wavy_Films","284757967_Wave_flow_of_thin_layers_of_a_viscous_fluid_i_the_free_flow","281962780_Wave_Effects_on_the_Transport_to_Falling_Laminar_Liquid_Films","281000692_Stromung_und_Warmeubergang_bei_Rieselfilmen","274414403_Wave_Flow_of_Liquid_Films","266987864_Falling_Liquid_Films","259669111_Optimal_Regimes_of_Heat-Mass_Transfer_in_a_Falling_Film","258078228_Traveling_Waves_on_Vertical_Films_Numerical_Analysis_Using_the_Finite_Element_Method","253599080_Quasi-confocal_extended_field_surface_sensing"]}