{"id":"286270780_Judgment_Under_Uncertainty_Heuristics_and_Biases","abstract":"Many decisions are based on beliefs concerning the likelihood of uncertain events such as the outcome of an election, the guilt of a defendant, or the future value of the dollar. Occasionally, beliefs concerning uncertain events are expressed in numerical form as odds or subjective probabilities. In general, the heuristics are quite useful, but sometimes they lead to severe and systematic errors. The subjective assessment of probability resembles the subjective assessment of physical quantities such as distance or size. These judgments are all based on data of limited validity, which are processed according to heuristic rules. However, the reliance on this rule leads to systematic errors in the estimation of distance. This chapter describes three heuristics that are employed in making judgments under uncertainty. The first is representativeness, which is usually employed when people are asked to judge the probability that an object or event belongs to a class or event. The second is the availability of instances or scenarios, which is often employed when people are asked to assess the frequency of a class or the plausibility of a particular development, and the third is adjustment from an anchor, which is usually employed in numerical prediction when a relevant value is available.","authors":["Amos Tversky","Daniel Kahneman"],"meta":["January 1982Science 185(4157):38-55","DOI:10.1017/CBO9780511809477.002"],"references":["239064614_On_the_Subjective_Probability_of_Compound_Events","258430576_Perceived_frequency_of_concrete_and_abstract_words","243770566_Belief_in_the_law_of_small_numbers","242637734_The_Concept_of_Probability_in_Psychological_Experiments","223160974_Comparison_of_Bayesian_and_Regression_Approaches_to_the_Study_of_Information_Processing_Judgment","209410239_On_the_Psychology_of_Prediction","209410222_Availability_A_Heuristic_for_Judging_Frequency_and_Probability","18308417_Genesis_of_popular_but_erroneous_psychodiagnostic_observations","18271244_The_Illusory_Correlation_as_an_Obstacle_to_the_Use_of_Valid_Psychodiagnostic_Signs"]}