{"id":"286283441_MuSCa_A_Multiscale_Characterization_Framework_for_Complex_Distributed_Systems","abstract":"Nowadays, complex systems are distributed over several levels of Information and Communications Technology (ICT) infrastructures. They may involve very small devices such as sensors and RFID, but also powerful systems such as Cloud computers and knowledge bases, as well as intermediate devices such as smartphones and personal computers. These systems are sometimes referred to as multiscale systems. The word 'multiscale' may qualify various distributed systems according to different viewpoints such as their geographic dispersion, the networks they are deployed on, or their users' organizations. For one entity of the multiscale system, communication technologies, non-functional properties (for persistence or security purpose) or architectures to be favored may vary from one scale to another. Moreover, ad hoc architecture of such complex systems are costly and non-sustainable. In this paper, we propose a scale-awareness framework, called MuSCa. This framework includes a characterization process based on the concepts of viewpoints, dimensions and scales. These concepts constitute the core of a dedicated metamodel. The proposed framework allows multiscale software designers to share a taxonomy for qualifying their own system. At system design time, the result of such a qualification is a model from which the framework produces scale-awareness artifacts. As an illustration of this model-driven approach, we show how multiscale probes are generated to provide multiscale components with an embedded scale-awareness ability.","authors":["Sam Rottenberg","Sébastien Leriche","Chantal Taconet","Claire Lecocq"],"meta":["October 2014","DOI:10.15439/2014F131"],"references":["257797665_Challenges_in_very_large_distributed_systems","220491094_Emergent_Middleware_Tackling_the_Interoperability_Problem","220411196_Mobile_Computing_the_Next_Decade","3940329_Towards_a_precise_definition_of_the_OMGMDA_framework","262236049_Building_ubiquitous_QoC-aware_applications_through_model-driven_software_engineering","222001027_Towards_the_Model_Driven_Development_of_context-aware_pervasive_systems","220841663_DASIMA_A_flexible_management_middleware_in_multi-scale_contexts","2953915_Scalable_Secure_and_Highly_Available_Distributed_File_Access"]}