{"id":"286376123_Two-Stage_Supervised_Learning-Based_Method_to_Detect_Screams_and_Cries_in_Urban_Environments","abstract":"Smartphones can enable monitoring signs of distress as a human goes about his daily routine. Motivated by this possibility of 24x7 distress detection, we investigate detection of screaming and crying in urban environments, which we categorize into the contexts of indoors (home and office), outdoors, human conversation, large human gatherings, machinery, and audio from multimedia devices. Prior works are often restricted to specific environments or controlled settings. We propose a novel two-stage supervised learning based method, with tunable decision parameters for each stage, to achieve a desired true distress (scream and cry) detection rate (DR) and false alarm rate (FAR). We observe that the choice of the parameters is a function of the signal-to-noise ratio (SNR) of the distress signal, which is the ratio of the power of the distress signal to the power of the context audio. In the absence of SNR information, we show that a simple SNR estimation scheme performs well. Alternately, we show how the decision parameters can be selected based on the context estimated by the method. We show the results of testing the proposal over hundred hours of audio data recorded by the smartphones of ten volunteers as they went about their daily routines. Achieved performance is exemplified by a DR of 93.16% and a FAR of 4.76% at a SNR of 20 dB. The corresponding values for a SNR of 10 dB are 84.13% and 4.77%. Finally, we compare with, which also deals with audio event detection in noisy environments.","authors":["Anil Sharma","Sanjit Kaul"],"meta":["January 2015IEEE/ACM Transactions on Audio, Speech, and Language Processing 24(2):1-1","DOI:10.1109/TASLP.2015.2506264"],"references":["281885813_In-home_detection_of_distress_calls_The_case_of_aged_users","312469285_Machine_learning_an_algorithmic_perspective","307881957_LIBSVM_A_library_for_support_vector_machines","307747498_Musical_Instrument_Timbres_Classification_with_Spectral_Features","304425264_A_Tutorial_on_Support_Vector_Machines_for_Pattern_Recognition","289044101_Audio-visual_signal_processing_in_a_multimodal_assisted_living_environment","287325062_Support_vector_machines_and_self-organizing_maps_for_the_recognition_of_sound_events_in_urban_soundscapes","285787258_Audio_context_recognition_in_variable_mobile_environments_from_short_segments_using_speaker_and_language_recognizers","272623654_Libsvm","272361459_A_Target_Guided_Subband_Filter_for_Acoustic_Event_Detection_in_Noisy_Environments_Using_Wavelet_Packets"]}