{"id":"286355502_EEG_and_the_newborn","abstract":"Despite the evolution of new technologies for assessing neonatal brain function, electroencephalography (EEG) remains a powerful tool for neurological diagnosis and prognosis in neonates. It is considered the gold standard for distinguishing epileptic seizures from non-epileptic paroxysmal events and for detecting subclinical seizure activity in high-risk babies. In those babies severely ill, EEG is even more efficient as predictive test than the neurological examination. The prognostic value of neonatal EEG has been long recognized in term as well as in preterm infants. Background patterns, more that patterns of ictal discharges, correlate significantly with the long-term outcome. Although most abnormalities on the neonatal EEG are nonspecific, certain patterns can be highly suggestive for diagnosis. Prognostic value can be increased by obtaining early recordings, possibly within the first 48 hr of life, prolonged recordings to include samples of different activity states, and serial EEGs at short intervals to assess rapid changes that are likely to occur in high-risk infants. It is important to distinguish neonatal seizures from neonatal-onset epilepsies and epilepsy syndromes. Both benign and malignant neonatal epilepsy syndromes exist. While benign familial neonatal seizures represents a neonatal syndrome with benign outcome, early myoclonic encephalopathy and Ohtahara syndrome are the earliest form of age-dependent severe epilepsy syndromes. Early myoclonic encephalopathy and Ohtahara syndrome are both characterized by the presence of a burst-suppression EEG pattern. This pattern is usually associated with a poor prognosis and is considered the electroencephalographic correlate of a complete disconnection within the thalamocortical systems. Migrating partial seizures in infancy is a newly recognized epilepsy syndrome whose onset can be in the neonatal period. It is characterized by multifocal intractable seizures associated with psychomotor impairment. No etiology has been found so far. Different drugs currently used in neonatal intensive care unit, especially if in the toxic range, can alter the EEG background. Those effects need to be taken in account in the interpretation of neonatal EEG.","authors":["Maria Roberta Cilio"],"meta":["January 2009Journal of pediatric neurology: JPN 7(1):25-43","DOI:10.3233/JPN-2009-0272"],"references":["313051146_Selective_vulnerability_of_neuronal_subpopulations_during_ontogeny_reflects_discrete_molecular_events_associated_with_normal_brain_development","306197563_Electroencephalography_of_the_newborn","298227330_Seizure-associated_brain_injury_in_term_newborns_with_perinatal_asphyxia_-_Reply","293302946_Clinical_diagnosis_and_management_of_neonatal_seizures","289750813_Revised_terminology_and_concepts_for_the_classification_of_epileptic_seizures_and_epilepsies_Report_of_the_Commission_on_Classification_and_Terminology_of_the_International_League_against_Epilepsy","285766946_Severe_neonatal_epilepsies_with_suppression-burst_pattern","285739278_Moderate_Hypothermia_to_Treat_Perinatal_Asphyxial_Encephalopathy","282755487_Electroencephalography_of_the_Newborn_Normal_Features","282102820_Clinical_and_electroencephalographical_classification_of_epileptic_seizures","278208203_Hypothermia_for_neonates_with_hypoxic-ischemic_encephalopathy_-_Reply"]}