{"id":"286350836_A_new_ray_tracing_technique_for_crosshole_radar_traveltime_tomography_based_on_multistencils_fast_marching_method_and_the_steepest_descend_method","abstract":"We presented a new ray tracing technique which is applicable for crosshole radar traveltime tomography. The new algorithm divides the ray tracing process into two steps: First the wavefront propagation times of all grid points in a velocity field are calculated using the multistencils fast marching method (MSFM), and then the ray tracing paths having the minimum traveltime can be easily obtained by following the steepest gradient direction from the receiver to the transmitter. In contrast to traditional fast marching method (FMM) and higher accuracy fast marching method (HAFMM), MSFM algorithm calculates traveltimes using two stencils at the same time, and the information in diagonal direction can be included, thus the calculation accuracy and efficiency can be improved greatly. In order to verify the accuracy and efficiency of the new ray tracing method, we test the proposed scheme on two synthetic velocity models where the exact solutions can be calculated, and we compared our results with the one obtained by a FMM based and a HAFMM based steepest descend ray tracing methods. This comparison indicated that the suggested ray tracing technique can achieve much better results both on accuracy and efficiency compared to the FMM based and the HAFMM based steepest descend ray tracing methods.","authors":["Xinxin Qu","Sixin Liu","Fei Wang"],"meta":["December 2014","DOI:10.1109/ICGPR.2014.6970475"],"references":["220411893_Computational_Study_of_Fast_Methods_for_the_Eikonal_Equation","215755725_Finite-difference_calculation_of_traveltimes_in_3D","2852935_Fast_Sweeping_Algorithms_for_a_Class_of_Hamilton--Jacobi_Equations","277429591_Finite-difference_solution_of_the_eikonal_equation_along_expanding_wavefonts","242913700_An_cal_ON_Level_Set_Method_for_Eikonal_Equations","229872025_Seismic_ray_tracing_using_linear_travel_time_interpolation","228077948_Shortest_path_calculation_of_seismic_ray","222820531_ON_Implementation_of_the_Fast_Marching_Algorithm","215755769_Upwind_finite-difference_calculation_of_traveltimes","215755436_A_fast_algorithm_for_two-point_ray_tracing","11742606_A_Marching_Level_Set_Method_for_Monotonically_Advancing_Fronts","6211241_MultiStencils_Fast_Marching_Methods_A_Highly_Accurate_Solution_to_the_Eikonal_Equation_on_Cartesian_Domains","2581299_Fast_Marching_Methods"]}