{"id":"286456650_Play_to_Pay_Adolescent_Video_Game_Play_STEM_Choice","abstract":"PurposeThis study provides empirical support for a link between video game play and likelihood to major in a STEM field.\nDesign/methodology/approachUsing the National Longitudinal Study of Adolescent Health (Add Health), this study investigates whether adolescents who play video games are more likely than those who do not to choose a STEM field major in college, and if other characteristics explain this relationship.\nFindingsResults from a nested series of logistic regression models show that – compared to those who do not play video games in adolescence – teens who play video games are 70% more likely to major in a STEM field when they attend college.\nResearch limitations/implicationsThe Add Health dataset allows for empirical verification of the link between video game play and STEM major choice, but it is dated. Future research should use more recent data. Factors such as gaming platform and game genre are likely to be key variables in future research.\nPractical implicationsThis finding lends support for including video game play as a potential factor in future studies on college major choice, and offers further empirical support for utilizing video games as a potential gateway into STEM.\nOriginality/valueGoing beyond previous research, this study finds that playing commercial video games may be one entry point to STEM fields, and implies that it is important to understand the impact of games that millions of young people play.","authors":["Amanda Turner"],"meta":["November 2014","DOI:10.1108/S2050-206020140000008018","In book: Communication and Information Technologies Annual (Studies in Media and Communications, Volume 8) (pp.55-71)Publisher: Emerald Group Publishing LimitedEditors: Laura Robinson, Shelia R. Cotten, Jeremy Shulz"],"references":["258137455_Of_Mods_and_Modders","255648002_Women_video_gaming_and_learning_Beyond_stereotypes","225648613_Mom_Let_Me_Play_More_Computer_Games_They_Improve_My_Mental_Rotation_Skills","222094719_Violent_Video_Games_as_Exemplary_Teachers_A_Conceptual_Analysis","222077308_Effect_of_video_game_practice_on_spatial_skills_in_girls_and_boys","23716386_Video_games_A_route_to_large-scale_STEM_education","5949257_Playing_an_Action_Video_Game_Reduces_Gender_Differences_in_Spatial_Cognition","248963512_The_Story_of_Phoenix_Quest_How_girls_respond_to_a_prototype_language_and_mathematics_computer_game","242513310_Software_Design_as_a_Learning_Environment","240280895_Gender_Simulation_and_Gaming_Research_Review_and_Redirections"]}