{"id":"286490640_Human_Visual_System-Based_Fundus_Image_Quality_Assessment_of_Portable_Fundus_Camera_Photographs","abstract":"Telemedicine and the medical \"big data\" era in ophthalmology highlight the use of non-mydriatic ocular fundus photography, which has given rise to indispensable applications of portable fundus cameras. However, in the case of portable fundus photography, non-mydriatic image quality is more vulnerable to distortions, such as uneven illumination, colour distortion, blur, and low contrast. Such distortions are called generic quality distortions. This paper proposes an algorithm capable of selecting images of fair generic quality that would be especially useful to assist inexperienced individuals in collecting meaningful and interpretable data with consistency. The algorithm is based on three characteristics of the human visual system - multi-channel sensation, just noticeable blur, and the contrast sensitivity function to detect illumination and colour distortion, blur, and low contrast distortion, respectively. A total of 536 retinal images, 280 from proprietary databases and 256 from public databases, were graded independently by one senior and two junior ophthalmologists, such that three partial measures of quality and generic overall quality were classified into two categories. Binary classification was implemented by the support vector machine and the decision tree, and receiver operating characteristic (ROC) curves were obtained and plotted to analyse the performance of the proposed algorithm. The experimental results revealed that the generic overall quality classification achieved a sensitivity of 87.45% at a specificity of 91.66%, with an area under the ROC curve of 0.9452, indicating the value of applying the algorithm, which is based on the human vision system, to assess the image quality of non-mydriatic photography, especially for low-cost ophthalmological telemedicine applications.","authors":["Shaoze Wang","Kai Jin","Haitong Lu","ChuMing Cheng"],"meta":["December 2015IEEE Transactions on Medical Imaging 35(4):1-1","DOI:10.1109/TMI.2015.2506902","Project: Computer-aided diagnosis of retinal diseases"],"references":["281096527_Improving_the_blind_restoration_of_retinal_images_by_means_of_point-spread-function_estimation_assessment","270662293_Telemedicine_for_detecting_diabetic_retinopathy_A_systematic_review_and_meta-analysis","312538118_Support-vector_networks","284697644_Statistical_pattern_recognition_A_review","280724685_Contrast_sensitivity_function_calibration_based_on_image_quality_prediction","271513141_Support_Vector_Networks","268289872_kernlab_-_A_Kernel_Methods_Package","261520356_Identification_of_suitable_fundus_images_using_automated_quality_assessment_methods","260252572_Automated_detection_of_exudates_and_macula_for_grading_of_diabetic_macular_edema","259045011_Computer-aided_diagnosis_of_diabetic_retinopathy_A_review"]}