{"id":"286453775_Underwater_noise_modelling_for_environmental_impact_assessment","abstract":"Assessment of underwater noise is increasingly required by regulators of development projects in marine and freshwater habitats, and noise pollution can be a constraining factor in the consenting process. Noise levels arising from the proposed activity are modelled and the potential impact on species of interest within the affected area is then evaluated. Although there is considerable uncertainty in the relationship between noise levels and impacts on aquatic species, the science underlying noise modelling is well understood. Nevertheless, many EIAs do not reflect best practice, and stakeholders and decision makers in the EIA process are often unfamiliar with the concepts and terminology that are integral to interpreting noise exposure predictions. In this paper, we review the process of underwater noise modelling and explore the factors affecting predictions of noise exposure. Finally, we illustrate the consequences of errors and uncertainties in noise modelling, and discuss future research needs to reduce uncertainty in noise assessments.","authors":["Adrian Farcas","Paul M. Thompson","Nathan D Merchant"],"meta":["December 2015Environmental Impact Assessment Review 57:114-122","DOI:10.1016/j.eiar.2015.11.012"],"references":["284463826_Do_marine_mammals_experience_stress_related_to_anthropogenic_noise","282672152_Impacts_of_anthropogenic_noise_on_marine_life_Publication_patterns_new_discoveries_and_future_directions_in_research_and_management","269936077_Measuring_acoustic_habitats","312851456_UNDERWATER_ACOUSTIC_MODELING_TECHNIQUES","290999114_The_average_field_in_an_underwater_sound_channel","288521038_Finite-element_ray_tracing","285161868_A_gem_of_the_road_coral_court","278711387_Fundamentals_of_Shallow_Water_Acoustics","278661258_Fundamentals_of_Shallow_Water_Acoustics","273780665_Towards_a_complete_physically_based_forecast_model_for_underwater_noise_related_to_impact_pile_driving"]}