{"id":"286464812_Foundational_Proof_Certificates","abstract":"Consider a world where exporting proof evidence into a well defined,universal, and permanent format is taken as \"feature zero\" forcomputational logic systems. In such a world, provers willcommunicate and share theorems and proofs; libraries will archive andorganize proofs; and marketplaces of proofs would be open to anyprover that admits checkable proof objects. In that world, proofcheckers will be the new gatekeepers: they will be entrusted with thetask of checking that claimed proof evidence elaborates into a formalproof.Logicians and proof theorists have worked on defining notions of proofthat are not based on technology and do not have version numbersattached to them. There are many such proof systems in theliterature: Hilbert-Frege proofs, Gentzen's sequent calculus proofs,Prawitz's natural deduction proofs, etc. Each of these proof systemshave been given precise syntax and meaning. While such well studiedproof descriptions exist, a quick review of the current state ofautomated and interactive theorem provers reveals that provers seldomoutput their \"proof evidence\" using such proof systems. While thereis a lot of interest in having provers share and trust each other'sproofs most of that work has been based on building bridges betweentwo specific provers: a change in the version number of one prover cancause that bridge to collapse.The ProofCert project has as one of its goals the development of aflexible framework for defining the semantics of a wide range of proofevidence in such a way that provers would define the meaning of theirown proof evidence and trusted proof checkers would be able tointerpret that meaning and check its formal correctness. To achievethis goal, we must first be able to separate proof evidence from itsprovenance and then provide a formal and clear framework for definingthe semantics of proof evidence. The ProofCert project is focused onthe problem of checking formal proof: there is no assumption made thatsuch formal proofs are actually readable by humans.","authors":["Dale Miller"],"meta":["January 2015"],"references":[]}