{"id":"286593079_Feature_selection_using_Artificial_Bee_Colony_for_cardiovascular_disease_classification","abstract":"Machine learning techniques are widely used in medical decision support systems. Medical diagnosis helps to obtain different features representing the different variations of the disease. With the help of different diagnostic procedures, it is likely to have relevant, irrelevant and redundant features to represent a disease. Redundant features contribute to the wrong classification of the disease. Therefore, removing the redundant features reduces the size of the data and computation complexity. Identifying a good feature subset for effective classification is a non-trivial task. This requires an exhaustive search over the sample space of the dataset. The main objective of this paper is to use a metaheuristic algorithm to determine the optimal feature subset with improved classification accuracy in cardiovascular disease diagnosis. Swarm intelligence based Artificial Bee Colony (ABC) algorithm is used to find the best features in the disease identification. To evaluate the fitness of ABC, Support Vector Machine (SVM) classification is used. The performance of the proposed algorithm is validated against the Cleveland Heart disease dataset taken from the UCI machine learning repository. The experimental results show that, ABC-SVM performs better than Feature selection with reverse ranking. The results also show that, the proposed method obtained good classification accuracy with only seven features.","authors":["B. Subanya","Rajalaxmi R R"],"meta":["February 2014","DOI:10.1109/ECS.2014.6892729","Conference: 2014 International Conference on Electronics and Communication Systems (ICECS)"],"references":["257725126_A_Novel_Feature_Selection_Algorithm_using_Particle_Swarm_Optimization_for_Cancer_Microarray_Data","298980088_Toward_integrating_feature_selection_algorithms_for_classification_and_clustering","257636196_Modified_binary_PSO_for_feature_selection_using_SVM_applied_to_mortality_prediction_of_septic_patients","257405045_Feature_selection_for_medical_diagnosis_Evaluation_for_cardiovascular_diseases","257404202_Computational_intelligence_for_heart_disease_diagnosis_A_medical_knowledge_driven_approach","257352337_Reducing_bioinformatics_data_dimension_with_ABC-kNN","241901910_Support_Vector_Machine_Based_Arrhythmia_Classification_Using_Reduced_Features","229106969_Mr2PSO_A_maximum_relevance_minimum_redundancy_feature_selection_method_based_on_swarm_intelligence_for_support_vector_machine_classification","224453277_Large-scale_attribute_selection_using_wrappers","222544028_Parameter_determination_of_support_vector_machine_and_feature_selection_using_simulated_annealing_approach","220321001_Effective_Wrapper-Filter_hybridization_through_GRASP_Schemata","41656190_Margin-Maximizing_Feature_Elimination_Methods_for_Linear_and_Nonlinear_Kernel-Based_Discriminant_Functions"]}