{"id":"286588859_Grouping_in_collaborative_e-learning_environment_based_on_interaction_among_students","abstract":"Collaborative learning is an online classroom can take the form of conversation between the whole classes or within smaller groups. Moodle (Modular Object-Oriented Dynamic Learning Environment) is a free and open source e-learning software platform, also known as a Learning Management System, or Virtual Learning Environment (VLE). As a web-based tool, Moodle offers the possible way to deliver courses which include an enormous variety of information sources - links to multimedia, websites and image - which are hard to deliver in a traditional teaching atmosphere. The converse (chat) activity module in moodle allows participants to encompass a realtime synchronous discussion in a moodle course. A teacher can organize users into groups within the course or within particular activities. This paper aims in efficient group formation of learners in a collaborative learning environment so that every individual in the group is benefitted. As a testing platform tenth standard Tamil text book is incorporated in to moodle. In this paper K-NN clustering algorithm is used to improve the group performance. This algorithm achieves good performance in terms of balancing the knowledge level among all the students.","authors":["Jagadish D."],"meta":["December 2014","DOI:10.1109/ICRTIT.2014.6996170"],"references":["236964337_Developing_A_Learner-Centered_Criteria_to_Assessing_Group_Activities_in_Blended_Learning_Environments","228419214_Emergence_of_the_Most_Knowledgeable_Other_MKO_Social_network_analysis_of_chat_and_bulletin_board_conversations_in_a_CSCL_system","224211714_Omega_Network_An_adaptive_approach_to_social_learning","279440713_A_fuzzy_decision-making_of_the_individual_learning_strategies_based_on_their_e-learning_sequence_records","265913975_Cluster_head_selection_using_fuzzy_logic_and_chaotic_based_genetic_algorithm_in_wireless_sensor_network","261430677_Design_of_an_online_learning_platform_with_Moodle","261423620_Ascertaining_the_More_Knowledgeable_Other_among_peers_in_collaborative_e-learning_environment","259688395_Group_Formation_in_eLearning-enabled_Online_Social_Networks","242698206_Forming_Homogeneous_Heterogeneous_and_Mixed_Groups_of_Learners","224673858_Collaborative_Learning_in_E-Learning_based_on_Multi-Agent_Systems"]}