{"id":"286595440_Energy_consumption_optimization_for_software_defined_networks_considering_dynamic_traffic","abstract":"Today's networking hardware (e.g. switches, routers) is typically running 24/7, regardless of the traffic volume. This is because in current networks, the controlling and data forwarding functions are embedded in the same devices, and all L2/L3 network protocols are designed to work in a distributed manner. Therefore, network devices must be switched on all the time to handle the traffic. This consequently results in very high global energy consumption of communication networks. Software Defined Networking was recently introduced as a new networking paradigm, in which the control plane is physically separated from the forwarding plane and moved to a globally-aware software controller. As a consequence, traffic can be monitored in real time and rerouted very fast regarding certain objectives such as load balancing or QoS enhancement. Accordingly, it opens new opportunities to improve the overall network performance in general and the energy efficiency in particular. This paper proposes an approach that reconfigures the network in order to reduce the energy consumption, based on the current traffic load. Our main idea is to switch on a minimum amount of necessary switches/routers and links to carry the traffic. We first formulate the problem as a mixed integer linear programming (MILP) problem and further present a heuristic method, so called Strategic Greedy Heuristic, with four different strategies, to solve the problem for large networks. We have carried out extensive simulations for a typical campus network and arbitrary mesh networks with realistic traffic information and energy consumption, to prove the potential energy saving of the proposed approach. The results showed that we can save up to 45% of the energy consumption at nighttime.","authors":["Adam Markiewicz","Phuong Nga Tran","Andreas Timm-Giel"],"meta":["October 2014","DOI:10.1109/CloudNet.2014.6968985","Conference: 2014 IEEE 3rd International Conference on Cloud Networking (CloudNet)"],"references":["260514929_Improving_Network_Management_with_Software_Defined_Networking","233976015_Worldwide_electricity_consumption_of_communication_networks","224453052_Worldwide_energy_needs_for_ICT_The_rise_of_power-aware_networking","221164553_DCell_A_scalable_and_fault-tolerant_network_structure_for_data_centers","221164487_BCube_A_High_Performance_Server-centric_Network_Architecture_for_Modular_Data_Centers","221164263_Energy-aware_routing_in_data_center_network","220831932_ElasticTree_Saving_Energy_in_Data_Center_Networks","319477505_HERO_Hierarchical_Energy_Optimization_for_Data_Center_Networks","313038610_A_scalable_commodity_data_center_network_architecture","312751575_Elastictree_Saving_energy_in_data_center_networks","285897917_B4_Experience_with_a_globally-deployed_software_defined_WAN","262364586_B4_Experience_with_a_Globally-Deployed_Software_Defined_WAN","261457456_Energy_models_driven_green_routing_for_data_centers","254031705_CARPO_Correlation-aware_power_optimization_in_data_center_networks","221198997_A_Power_Benchmarking_Framework_for_Network_Devices","221164412_A_scalable_commodity_data_center_network_architecture"]}