{"id":"286523564_Navigating_in_the_Cayley_graph_of_SL_2mathbb_F_p_S_L_2_F_p_and_applications_to_hashing","abstract":"Cayley hash functions are based on a simple idea of using a pair of (semi)group elements, A and B, to hash the 0 and 1 bit, respectively, and then to hash an arbitrary bit string in the natural way, by using multiplication of elements in the (semi)group. In this paper, we focus on hashing with \\(2 \\times 2\\) matrices over \\(\\mathbb {F}_p\\). Since there are many known pairs of \\(2 \\times 2\\) matrices over \\(\\mathbb {Z}\\) that generate a free monoid, this yields numerous pairs of matrices over \\(\\mathbb {F}_p\\), for a sufficiently large prime p, that are candidates for collision-resistant hashing. However, this trick has a flip side, and lifting matrix entries to \\(\\mathbb {Z}\\) may facilitate finding a collision. This “lifting attack” was successfully used by Tillich and Zémor in the special case where two matrices A and B generate (as a monoid) the whole monoid \\(SL_2(\\mathbb {Z}_+)\\). However, in this paper we show that the situation with other, “similar”, pairs of matrices from \\(SL_2(\\mathbb {Z})\\) is different, and the “lifting attack” can (in some cases) produce collisions in the group generated by A and B, but not in the positive monoid. Therefore, we argue that for these pairs of matrices, there are no known attacks at this time that would affect security of the corresponding hash functions. We also give explicit lower bounds on the length of collisions for hash functions corresponding to some particular pairs of matrices from \\(SL_2(\\mathbb {F}_p)\\).","authors":["Lisa Bromberg","Vladimir Shpilrain","Alina Vdovina"],"meta":["December 2015Semigroup Forum 94(2)","DOI:10.1007/s00233-015-9766-5"],"references":["283185516_text_SL_2_SL_2_homomorphic_hash_functions_worst_case_to_average_case_reduction_and_short_collision_search","279262111_Analysis_of_cryptographic_hash_functions","329322984_Handbook_of_Applied_Cryptography","285368375_A_property_of_a_representation_of_a_free_group","269114419_Rubik's_for_Cryptographers","265995303_Discrete_groups_expanding_graphs_and_invariant_measures_With_an_appendix_by_Jonathan_D_Rogawski_Reprint_of_the_1994_original","265542044_Word_Processing_in_Groups","245942755_Discrete_Groups_Expanding_Graphs_and_Invariant_Measures","243116729_Uniform_expansion_bounds_for_Cayley_graphs_of_SL_2_p","242351880_Navigating_the_Cayley_graph_of_SL2Fp"]}