{"id":"286540261_Ubiquitous_learning_analytics_in_the_real-world_language_learning","abstract":"This paper describes a method of the visualization and analysis for mining useful learning logs from numerous learning experiences that learners have accumulated in the real world as the ubiquitous learning logs. Ubiquitous Learning Log (ULL) is defined as a digital record of what learners have learned in the daily life using ubiquitous technologies. It allows learners to log their learning experiences with photos, audios, videos, location, RFID tag and sensor data, and to share and reuse ULL with others. By constructing real-world corpora which comprise of accumulated ULLs with information such as what, when, where, and how learners have learned in the real world and by analyzing them, we can support learners to learn more effectively. The proposed system will predict their future learning opportunities including their learning patterns and trends by analyzing their past ULLs. The prediction is made possible both by network analysis based on ULL information such as learners, knowledge, place and time and by learners' self-analysis using time-map. By predicting what they tend to learn next in their learning paths, it provides them with more learning opportunities. Accumulated data are so big and the relationships among the data are so complicated that it is difficult to grasp how closely the ULLs are related each other. Therefore, this paper proposes a system to help learners to grasp relationships among learners, knowledge, place and time, using network graphs and network analysis.","authors":["Kousuke Mouri","Hiroaki Ogata"],"meta":["December 2015Smart Learning Environments 2(1)","DOI:10.1186/s40561-015-0023-x"],"references":["299599476_LEARNING_LOG_NAVIGATOR_SUPPORTING_TASK-BASED_LEARNING_USING_UBIQUITOUS_LEARNING_LOGS","286722005_Supporting_Real-world_Language_Learning_Based_on_Ubiquitous_Learning_Analytics","286716750_Visualization_for_Analyzing_Ubiquitous_Learning_Logs","286248373_Definition_framework_and_research_issues_of_smart_learning_environments_-_a_context-aware_ubiquitous_learning_perspective","281608666_Seamless_flipped_learning-_A_mobile_technologyenhanced_flipped_classroom_with_effective_learning_strategies","279902711_Criteria_Strategies_and_Research_Issues_of_Context-Aware_Ubiquitous_Learning","266644368_An_NFC_E-Learning_Platform_for_Interactive_and_Ubiquitous_Learning","285956479_Ubiquitous_Learning_Project_Using_Life-logging_Technology_in_Japan","284382103_Efficient_and_high_quality_force-directed_graph_drawing","275133423_'Storyline'_A_task-based_approach_for_the_young_learner_classroom"]}