{"id":"286612372_Algorithms_for_the_shapley_and_myerson_values_in_graph-restricted_games","abstract":"Graph-restricted games, first introduced by Myerson [20], model naturally-occurring scenarios where coordination between any two agents within a coalition is only possible if there is a communication channel(a path) between them. Two fundamental solution concepts that were proposed for such a game are the Shapley value and the Myerson value. While an algorithm has been proposed to compute the Shapley value in arbitrary graph-restricted games, no such general-purpose algorithm has yet been developed for the Myerson value. Our aim in this paper is to develop a more efficient algorithm for computing the Shapley value, and to develop a general-purpose algorithm for computing the Myerson value, in graph-restricted games. Since the computation of either value involves visiting all connected induced subgraphs of the graph underlying the game, we start by developing an algorithm dedicated for this purpose, and show that it is faster that the fastest available one in the literature. This algorithm is then used as the cornerstone upon which we build two algorithms. The first is designed to compute the Shapley value, and is shown to be more efficient than the state of the art. The second is the first dedicated algorithm to compute the Myerson value in arbitrary graphs. Copyright © 2014, International Foundation for Autonomous Agents and Multiagent Systems (www.ifaamas.org). All rights reserved.","authors":["O. Skibski","Tomasz Michalak","Talal Rahwan","M. Wooldridge"],"meta":["January 2014"],"references":["297505339_The_Zagreb_indices_30_years_after","280136936_The_Zagreb_Indices_30_Years_After","265973966_Optimization_and_Stability_in_Games_with_Restricted_Interactions","262277099_Computational_Analysis_of_Connectivity_Games_with_Applications_to_the_Investigation_of_Terrorist_Networks","312940435_2001_Statistical_mechanics_of_complex_networksJ","284289939_A_Value_for_n-Person_Games","267724017_On_Coalition_Formation_with_Sparse_Synergies","262163574_Analysis_of_two_existing_and_one_new_dynamic_programming_algorithm_for_the_generation_of_optimal_bushy_join_trees_without_cross_products","257196613_Cooperative_game_theoretic_centrality_analysis_of_terrorist_networks_The_cases_of_Jemaah_Islamiyah_and_Al_Qaeda","251803769_Social_Network_Analysis_as_an_Approach_to_Combat_Terrorism_Past_Present_and_Future_Research"]}