{"id":"286601964_Comparison_and_Optimization_of_Graphical_Methods_of_Moldboard_Plough_Bottom_Design_Using_Computational_Simulation","abstract":"The objective of this study was to computational analysis and comparison of a new graphical method of moldboard plough bottom design with previous graphical methods. Results show that the new method made the design and manufacturing process of plough bottom simpler. Also, this method decreased the weight of the bottom up to 7.3% due to the reduction of the overdesigned surface of it up to 273.5 cm 2. Therefore, based on this developed method, the price and magnitude of energy consumption of the moldboard plough decreases due to reduce of the weight of bottom and its friction with soil. Also, a three dimensional model of the new designed bottom was designed using CATIA V5R16. Then, computational simulation of the bottom was carried out by ABAQUS V6.9 utilizing the finite element method. Interactions between the bottom and the test soil (sandy loam) were applied to the simulation using a distributed load applied to the surface of moldboard and share. This distributed load was obtained from interpolation among 14 point forces measured from field tests using piezo-resistive transducers located on the working surface of the bottom. The load distribution was then derived by using spatial interpolation. Results show that this new designed bottom can easily withstand the applied stresses and displacements during plowing process. Results obtained from this study are suitable for the manufacturers of moldboard plough specially those who wish to use the finite element method to improve their products.","authors":["Hamed Shahmirzae Jeshvaghani","Salman Khaksar","Haghani Dehkordi","Mahmood Farouzandeh Samani"],"meta":["September 2013Journal of American Science 99(66):414-420"],"references":["273735000_Moldboard_plow_performance_in_a_clay_soil_Simulations_and_experiment","269337728_Optimizing_design_parameters_of_a_mouldboard_plough","290799991_An_analytical_method_for_identifying_and_designing_a_moldboard_plow_surface","275576731_Acquisition_and_Processing_of_Soil_Reaction_Forces_on_Tillage_Tools","270611273_Soil_Reactions_from_Laboratory_Studies_with_an_Inclined_Blade","270611203_Determining_Components_of_Soil-Metal_Sliding_Resistance","264950542_Stresses_and_displacements_in_a_semidigger_mouldboard_and_a_ploughshare","256275223_The_determination_of_plough_draught-Part_II_the_measurement_and_prediction_of_plough_draught_for_two_mouldboard_shapes_in_three_soil_series","251211819_Complex_differential_geometry","248562359_The_use_of_three_dimensional_computer_graphics_to_design_mouldboard_plough_surfaces"]}