{"id":"286669049_The_DODT_tool_applied_to_sub-sea_software","abstract":"Using natural language is still a common form of writing software requirements. Tools and techniques to improve the quality of natural language requirements may give better results than attempts to convince industry to use something else. We have combined natural language requirements with tool support using boilerplates and domain ontologies, enabling detection of ambiguities and incompleteness in requirements. This paper reports on a case study where requirement analysts used the developed tool to analyse requirements for a safety-critical control system. The experience showed that people were able to use the tool to develop a domain ontology and apply boilerplates to describe requirements in a structured way, yielding requirements readable for humans and analysable for the tool. The tool support improved the quality of requirements by reducing ambiguities and inconsistent use of terminology, removing redundant requirements, and improving partial and unclear requirements.","authors":["Tor Stålhane","Tormod Wien"],"meta":["August 2014","DOI:10.1109/RE.2014.6912293","Conference: 2014 IEEE 22nd International Requirements Engineering Conference (RE)","Project: Cost-efficient methods and processes for safety relevant embedded systems - CESAR"],"references":["237460652_Quality_Evaluation_of_Software_Requirements_Specifications","236235723_Towards_Ontology-Driven_Requirements_Engineering","230800292_Evolving_a_Software_Requeriments_Ontology","228909488_The_Use_of_Ontologies_in_Requirements_Engineering","225109885_Ontology-Driven_Guidance_for_Requirements_Elicitation","224240011_DODT_Increasing_requirements_formalism_using_domain_ontologies_for_improved_embedded_systems_development","224195362_Big_Ears_The_Return_of_Easy_Approach_to_Requirements_Engineering","286621896_CESAR_-_Cost-efficient_Methods_and_Processes_for_Safety-relevant_Embedded_Systems","269198960_Real-time_specification_patterns","254039731_An_ontology_for_software_requirements_modelling"]}