{"id":"286679595_Realtime_tracking_and_grasping_of_a_moving_object_from_range_video","abstract":"In this paper we present an automated system that is able to track and grasp a moving object within the workspace of a manipulator using range images acquired with a Microsoft Kinect sensor. Realtime tracking is achieved by a geometric particle filter on the affine group. Based on the tracked output, the pose of a 7-DoF WAM robotic arm is continuously updated using dynamic motor primitives until a distance measure between the tracked object and the gripper mounted on the arm is below a threshold. Then, it closes its three fingers and grasps the object. The tracker works in realtime and is robust to noise and partial occlusions. Using only the depth data makes our tracker independent of texture which is one of the key design goals in our approach. An experimental evaluation is provided along with a comparison of the proposed tracker with state-of-the-art approaches, including the OpenNI-tracker. The developed system is integrated with ROS and made available as part of IRI's ROS stack.","authors":["Farzad Husain","Adria Colome","Babette Dellen","Guillem Alenyà"],"meta":["May 2014Proceedings - IEEE International Conference on Robotics and Automation","DOI:10.1109/ICRA.2014.6907234","Conference: 2014 IEEE International Conference on Robotics and Automation (ICRA)"],"references":["281298137_Joint_segmentation_and_tracking_of_object_surfaces_in_depth_movies_along_humanrobot_manipulations","278627603_2D_12_Visual_Servoing","261490774_A_position_based_visual_tracking_system_for_a_7_DOF_robot_manipulator_using_a_Kinect_camera","261353721_Redundant_inverse_kinematics_Experimental_comparative_review_and_two_enhancements","233410058_Dynamical_Movement_Primitives_Learning_Attractor_Models_for_Motor_Behaviors","230600780_Closed-Form_Solution_of_Absolute_Orientation_Using_Unit_Quaternions","225192167_Grasping_of_Static_and_Moving_Objects_Using_a_Vision-Based_Control_Approach","224721878_A_Real-time_Stereo_Visual_Servoing_for_Moving_Object_Grasping_Based_Parallel_Algorithms","261124285_Frequency_response_experiments_of_3-D_pose_full-tracking_visual_servoing_with_eye-vergence_hand-eye_robot_system","260145899_Robotics_Modelling_Planning_and_Control"]}