{"id":"286679854_Experimental_verification_of_an_approach_for_disturbance_estimation_and_compensation_on_a_simulated_biped_during_perturbed_stance","abstract":"Human shows remarkable skills in reactive balancing control on unknown disturbances while standing and walking. Though current bipedal robots can walk, run and step obstacles, they normally perform in a well-controlled environment. Unexpected perturbations can cause the tumbling of bipedal robots when they possess limited capability of rejecting disturbances. Studies upon neurology and psychophysics of human stance attempt to trace how the human deals with external disturbances. This paper introduces a methodology for disturbances estimation and compensation (DEC) for bipedal robot during standing. Previous psychophysical studies of human self-motion perception indicate that humans estimate and compensate disturbances as follows: firstly, multi-sensory inputs are fused to provide explicit measures and then the estimations of the external disturbances are performed based on them. Then, the estimations are fed into a local feedback control loop, compensating the disturbances. Thus, an approach of disturbance estimation and compensation is developed according to the psychophysical aspects of human. Various experiments, for instance, standing on a rotating plate with varying frequency and amplitudes and continuous external contact forces upon the torso of a bipedal robot, are implemented. Through analyzing and verifying the experimental results on a simulated biped, one can state that the DEC approach successfully serves the bipedal robot during perturbed stance.","authors":["Jie Zhao","Qi Liu","Steffen Schütz","Karsten Berns"],"meta":["May 2014Proceedings - IEEE International Conference on Robotics and Automation","DOI:10.1109/ICRA.2014.6907604","Conference: 2014 IEEE International Conference on Robotics and Automation (ICRA)","Project: H2R Project"],"references":["267954415_Human-like_Control_of_Dynamically_Walking_Bipedal_Robots","224199768_Ground_reaction_force_control_at_each_foot_A_momentum-based_humanoid_balance_controller_for_non-level_and_non-stationary_ground","220103478_Disturbance_rejection_by_online_ZMP_compensation","257523754_Clinical_disorders_of_balance_posture_and_gait","224705535_Disturbance_Rejection_for_Biped_Humanoids","222545282_A_neurological_view_on_reactive_human_stance_control","220396518_A_Disturbance_Rejection_Measure_for_Limit_Cycle_Walkers_The_Gait_Sensitivity_Norm","36808228_Vertigo_its_multisensory_syndromes","26727435_Vestibular_humanoid_postural_control","21680222_Ankle_stiffness_of_standing_humans_in_response_to_imperceptible_perturbation_Reflex_and_task-dependent_components"]}