{"id":"28674282_CiteSpace_II_Detecting_and_visualizing_emerging_trends_and_transient_patterns_in_scientific_literature","abstract":"This article describes the latest development of a generic approach to detecting and visualizing emerging trends and transient patterns in scientific literature. The work makes substantial theoretical and methodological contributions to progressive knowledge domain visualization. A specialty is conceptualized and visualized as a time-variant duality between two fundamental concepts in information science – research fronts and intellectual bases. A research front is defined as an emergent and transient grouping of concepts and underlying research issues. The intellectual base of a research front is its citation and co-citation footprint in scientific literature – an evolving network of scientific publications cited by research front concepts. Kleinberg’s burst detection algorithm is adapted to identify emergent research front concepts. Freeman’s betweenness centrality metric is used to highlight potential pivotal points of paradigm shift over time. Two complementary visualization views are designed and implemented: cluster views and time-zone views. The contributions of the approach are: 1) the nature of an intellectual base is algorithmically and temporally identified by emergent research-front terms, 2) the value of a co-citation cluster is explicitly interpreted in terms of research front concepts and 3) visually prominent and algorithmically detected pivotal points substantially reduce the complexity of a visualized network. The modeling and visualization process is implemented in CiteSpace II, a Java application, and applied to the analysis of two research fields: mass extinction (1981-2004) and terrorism (1990-2003). Prominent trends and pivotal points in visualized networks were verified in collaboration with domain experts, who are the authors of pivotal-point articles. Practical implications of the work are discussed. A number of challenges and opportunities for future studies are identified.\nDimensions ID: pub.1001131784","authors":["Chaomei Chen"],"meta":["February 2006Journal of the American Society for Information Science and Technology 57(3):359-377","DOI:10.1002/asi.20317"],"references":["284668257_Linkage_Between_Basic_Research_Literature_and_Patents","265372476_Pathfinder_Associative_Networks_Studies_in_Knowledge_Organization","260282738_Mapping_Changes_in_Science_and_Technology_Bibliometric_Co-Occurrence_Analysis_of_the_RD_Literature","275446163_Impact_Event_at_the_Permian-Triassic_Boundary_Evidence_from_Extraterrestrial_Noble_Gases_in_Fullerenes","269992536_Networks_of_Scientific_Papers","269956245_The_threat_of_biological_weapons_Prophylaxis_and_mitigation_of_psychological_and_social_consequences","260742959_Self-Organized_Criticality","253520053_Why_some_papers_have_long_citation_lifetimes","252545569_T_rex_and_the_Crater_of_Doom","249721810_The_Structure_of_Scientific_Literatures_II_Toward_a_Macro_and_Microstructure_for_Science","248697157_Anoxia_as_a_cause_of_the_PermianTriassic_mass_extinction_facies_evidence_from_northern_Italy_and_the_western_United_States","248540892_A_Theoretical_Analysis_of_Transnational_Terrorism","248390464_The_Strength_of_Weak_Ties","247916683_The_intellectual_base_and_research_fronts_of_JASIS_1986-1990","244959541_A_national_survey_of_stress_reac-tions_after_the_September_11"]}