{"id":"286707454_Embedded_Image_Coding_using_Zerotrees_of_Wavelet_Coefficients","abstract":"The embedded *erotree wavelet algorithm (EZVV) is :s simple, yet remarkably effective, image compression algo{reversed not sign}rithm, having the property thai the bits in the bit stream are generated in order of Importance, yielding a fully embedded code- The embedded code represents a sequence of binary de{reversed not sign}cisions that distinguish an image from Ihe \"null\" image. Using an embedded coding algorithm, an encoder can terminate Ihe encoding at any point thereby allowing a target rate or target distortion metric to he met exactly. Also, given a bit slream, the decoder can cease decoding at any point in Ihe hit stream and still produce exactly the same image that would have been encoded at the bit rate corresponding tn the truncated hit stream. In addition to producing a fully embedded bit slream, EZW consistenlly produces compression results that are com{reversed not sign}petitive with virtually all known compression algorithms on standard test images. Yet this performance is achieved with a technique that requires absolutely no training, no pre-slored lables or codebooks, and requires no prior knowledge of the image source. The EZW algorithm is based on four key concepts: 1) a dis{reversed not sign}crete wavelet transform or hierarchical subband decomposi{reversed not sign}tion, 2) prediction of the absence of significant information across scales by exploiting Ihe self-similarity inherent in im{reversed not sign}ages, .1) entropy-coded successive-approximation quantization, and 4} universal lossless data compression which is achieved via adaptive arithmetic coding.","authors":["Jerome M. Shapiro"],"meta":["January 2009","DOI:10.1016/B978-155860651-7/50096-6"],"references":["243623710_titleOrthogonal_Pyramid_Transforms_For_Image_Codingtitle","3321142_Wavelets_and_Signal_Processing","3077981_Entropy-Based_Algorithms_for_Best_Basis_Selection","246360966_HDTV_coding_using_a_nonrectangular_subband_decomposition","224733267_The_Laplacian_Pyramid_as_a_Compact_Image_Code","216027273_Orthogonal_Bases_of_Compactly_Supported_Wavelets","5556373_Image_compression_using_the_2-D_wavelet_transform","3077656_The_wavelet_transform_time-frequency_localization_and_signal_analysis"]}