{"id":"286723460_A_survey_on_scheduling_and_load_balancing_techniques_in_cloud_computing_environment","abstract":"Now-a-days cloud computing is the most emerging technology due to its elasticity of resource provisioning and the pay-as-you-go pricing model which enables users to pay only according to their need. As cloud can be accessed anytime and anywhere through commodity hardware only its demand is increasing day by day. So it must provide high performance gain to the user and at the same time must be beneficial for the Cloud Service Provider (CSP). To achieve this goal many challenges have to be faced. Load balancing is one of them which helps the CSP to meet the QoS requirements of the users and at the same time maximize his profit by optimum use of the resources. To balance the load in cloud the resources and workloads must be scheduled in an efficient manner. A variety of scheduling algorithms are used by load balancers to determine which backend server to send a request to. The selected server allocates resources and schedules the job dynamically on some virtual machine (VM) located on the same physical machine. It is also the responsibility of the provider to dynamically reallocate or migrate the VM across physical machines for workload consolidation and to avoid over utilization or under utilization of resources. In this paper, we have discussed different algorithms proposed to resolve the issue of load balancing and task scheduling in Cloud Computing. We have mentioned some of their shortcomings for further development. VM migration issues involved in load balancing are also described briefly.","authors":["Subhadra Shaw","A. K. Singh"],"meta":["September 2014","DOI:10.1109/ICCCT.2014.7001474","Conference: 2014 International Conference on Computer and Communication Technology (ICCCT)"],"references":["326508266_Load_Balancing_On_Cloud_Data_Centres","324988941_Analysis_of_Load_Balancing_Techniques_in_Cloud_Computing","271482427_A_novel_approach_for_load_balancing_in_cloud_data_center","269331831_Load_balancing_in_cloud_based_on_live_migration_of_virtual_machines","311368797_A_survey_of_load_balancing_in_cloud_computing_Challenges_and_algorithms","290760097_A_Comparison_of_Four_Popular_Heuristics_for_Load_Balancing_of_Virtual_Machines_in_Cloud_Computing","284128912_COMPARATIVE_STUDY_OF_SCHEDULING_AL-GROTIHMS_IN_CLOUD_COMPUTING","271589529_The_NIST_definition_of_cloud_computing_Draft","271557288_Double_threshold_energy_aware_load_balancing_in_cloud_computing","271425731_Optimal_load_balancing_in_cloud_computing_by_efficient_utilization_of_virtual_machines"]}