{"id":"286794765_Dropout_A_Simple_Way_to_Prevent_Neural_Networks_from_Overfitting","abstract":"Deep neural nets with a large number of parameters are very powerful machine learning systems. However, overfitting is a serious problem in such networks. Large networks are also slow to use, making it difficult to deal with overfitting by combining the predictions of many different large neural nets at test time. Dropout is a technique for addressing this problem. The key idea is to randomly drop units (along with their connections) from the neural network during training. This prevents units from co-adapting too much. During training, dropout samples from an exponential number of different \"thinned\" networks. At test time, it is easy to approximate the effect of averaging the predictions of all these thinned networks by simply using a single unthinned network that has smaller weights. This significantly reduces overfitting and gives major improvements over other regularization methods. We show that dropout improves the performance of neural networks on supervised learning tasks in vision, speech recognition, document classification and computational biology, obtaining state-of-the-art results on many benchmark data sets. © 2014 Nitish Srivastava, Geoffrey Hinton, Alex Krizhevsky, Ilya Sutskever and Ruslan Salakhutdinov.","authors":["Nitish Srivastava","Geoffrey Hinton","Alex Krizhevsky","Ilya Sutskever"],"meta":["June 2014Journal of Machine Learning Research 15(1):1929-1958"],"references":["281764031_Learning_with_marginalized_corrupted_features","246546737_Dropout_Training_as_Adaptive_Regularization","235639035_Maxout_Networks","227716504_Marginalized_Denoising_Autoencoders_for_Domain_Adaptation","221620570_Phone_Recognition_with_the_Mean-Covariance_Restricted_Boltzmann_Machine","221346269_Extracting_and_composing_robust_features_with_denoising_autoencoders","220016377_High-dimensional_signature_compression_for_large-scale_image_classification","41040261_Sex_mixability_and_modularity","221345874_Nightmare_at_test_time_robust_learning_by_feature_deletion","216792879_Backpropagation_Applied_to_Handwritten_Zip_Code_Recognition","210303561_Learning_to_Classify_with_Missing_and_Corrupted_Features","51535082_Bayesian_prediction_of_tissue-regulated_splicing_using_RNA_sequence_and_cellular_context","7017915_A_Fast_Learning_Algorithm_for_Deep_Belief_Nets","6912170_Reducing_the_Dimensionality_of_Data_with_Neural_Networks"]}