{"id":"286869313_Procrastination's_relation_with_fear_of_failure_competence_expectancy_and_intrinsic_motivation","abstract":"The present challenging social and economic development requires the young generation to be competitive. As such procrastination is seen as a problem that has adverse effects on them. Thus, this research aimed to look at procrastination in students. A set of questionnaires was distributed to 126 students for data collection. Data were then analyzed with t-test to see the difference between the variables in relation to gender and ethnicity. Pearson correlation was used to test the relationship between the variables. Results from the t-test showed no significant differences in all variables among subjects of different gender. However, for ethnicity t-test showed a significant difference in competence expectancy, intrinsic motivation, and fear of failure. Meanwhile there were significant negative correlations between procrastination and competence expectancy and intrinsic motivation. Also, there was a positive significant correlation between procrastination and fear of failure. In conclusion, findings showed that procrastination could be mainly related to fear of failure which can be lessened by their competence expectancy and their intrinsic motivation.","authors":["Fatimah Omar","Lukman Zm","Rozainee Khairudin","Wan Shahrazad Wan Sulaiman"],"meta":["October 2011Pertanika Journal of Social Science and Humanities 19:123-127","Project: Social Work / Social Studies"],"references":["271617614_Analysis_of_procrastination_among_university_students","279645091_The_Impact_of_Online_Graduate_Students'_Motivation_and_Self_Regulation_on_Academic_Procrastination","234582904_Using_Tests_as_an_Incentive_to_Motivate_Procrastinators_to_Study","229645629_Procrastinators_and_fear_of_failure_An_exploration_of_reasons_for_procrastination","229509092_Procrastination_conscientiousness_anxiety_and_goals_Exploring_the_measurement_and_correlates_of_procrastination_among_school-aged_children","223219593_Personality_and_chronic_procrastination_by_university_students_during_an_academic_examination_period","222177811_Parenting_and_procrastination_Gender_differences_in_the_relations_between_procrastination_parenting_style_and_self-worth_in_early_adolescence"]}