{"id":"286849557_Using_blended_creative_teaching_Improving_a_teacher_education_course_on_designing_materials_for_young_children","abstract":"This study combined traditional classroom teaching methods and blogs with blended creative teaching as a new teaching method for the course Design and Applications of Teaching Aids for Young Children. It aimed to improve the shortcomings of the traditional teaching approach by incorporating the Asking, Thinking, Doing, and Evaluation (ATDE) teaching model and encouraging interactions between teacher and students. The purpose of this study was to examine the effectiveness of using blogs in blended creative teaching while also exploring the ideal blended creative teaching model, work completion rates, patent applications (as the teaching outcome), and learning attitudes of students. The research subjects were 46 second year students from the department of early childhood education in a vocational high school. Data were collected from qualitative teaching materials, teaching logs, learning logs, blog applications, and quantitative survey questionnaire. The results showed that the ideal blended creative teaching model can be implemented over six stages. Additionally, creative techniques can help teachers generate ideas on teaching material design and facilitate patent applications. Furthermore, the results of the survey indicate that students possessed positive feedback and affirmation toward the blended creative teaching model. Finally, blog teaching can help enhance interactions between teachers and students and among peers, thus improving the effectiveness of learning.","authors":["Shi-Jer Lou","Nai-Ci Chen","Huei-Yin Tsai","T. Kuo-Hung"],"meta":["July 2012Australasian Journal of Educational Technology 28(5):776-792","DOI:10.14742/ajet.816"],"references":["281665489_Blogging_in_a_teaching_skills_course_for_pre-service_teachers_of_English_as_a_second_language","200773284_Peer_Feedback_Through_Blogs_Student_and_teacher_perceptions_in_an_advanced_German_class","3230235_Learning_With_Weblogs_Enhancing_Cognitive_and_Social_Knowledge_Construction","287598773_Adoption_of_blogging_by_a_Chinese_language_composition_class_in_a_vocational_high_school_in_Taiwan","286323187_Using_blogging_to_promote_clinical_reasoning_and_metacognition_in_undergraduate_physiotherapy_fieldwork_programs","279573933_Blended_learning_using_video-based_blogs_Public_speaking_for_English_as_a_second_language_students","277200187_Online_collaboration_and_offline_interaction_between_students_using_asynchronous_tools_in_blended_learning","230526594_Use_of_peer_feedback_to_enhance_elementary_students'_writing_through_blogging","228010680_Gender_differences_in_usage_satisfaction_self-efficacy_and_performance_of_blogging","223496194_Users'_attitudes_toward_Web-based_collaborative_learning_systems_for_knowledge_management"]}