{"id":"286873961_The_TangibleK_robotics_program_Applied_computational_thinking_for_young_children","abstract":"This article describes the TangibleK robotics program for young children. Based on over a decade of research, this program is grounded on the belief that teaching children about the human-made world, the realm of technology and engineering, is as important as teaching them about the natural world, numbers, and letters. The TangibleK program uses robotics as a tool to engage children in developing computational thinking and learning about the engineering design process. It includes a research-based, developmentally appropriate robotics kit that children can use to make robots and program their behaviors. The curriculum has been piloted in kindergarten classrooms and in summer camps and lab settings. The author presents the theoretical framework that informs TangibleK and the \"powerful ideas\" from computer science and robotics on which the curriculum is based, linking them to other disciplinary areas and developmental characteristics of early childhood. The article concludes with a description of classroom pedagogy and activities, along with assessment tools used to evaluate learning outcomes.","authors":["Marina U. Bers"],"meta":["September 2010Early Childhood Research and Practice 12(2)"],"references":["289737276_A_new_age_in_tangible_computational_interfaces_for_learning_2010","255632182_The_Future_of_Educational_Computing_ResearchThe_Case_of_Computer_Programming","2861445_Robotic_Design_Studio_Exploring_the_Big_Ideas_of_Engineering_In_a_Liberal_Arts_Environment","264341161_A_Review_of_the_NAE_Report_Engineering_in_K-12_Education","256619991_First_the_look_and_then_the_sound_Creating_conversations_at_circle_time","242192662_The_Role_of_New_Technologies_to_Foster_Positive_Youth_Development","233616845_Kindergarten_Robotics_Using_Robotics_to_Motivate_Math_Science_and_Engineering_Literacy_in_Elementary_School","232489646_Epistemological_Pluralism_and_the_Revaluation_of_the_Concrete","224101918_What's_the_big_idea_Toward_a_pedagogy_of_idea_power","41201985_How_Young_Children_Learn_to_Program_With_Sensor_Action_and_Logic_Blocks"]}