{"id":"286926318_Les_nouveaux_etudiants_d'hier_a_aujourd'hui","abstract":"Caractériser les étudiants d'aujourd’hui est une entreprise complexe tant leurs profils, leurs expériences et leurs parcours d'études se révèlent diversifiés. L’hétérogénéité de la population, plus ou moins marquée selon les filières, s'est accrue dans la dernière décennie, notamment avec l'arrivée des nouveaux bacheliers professionnels, l'essor des étudiants étrangers et le développement du travail salarié, rendant la socialisation et l'affiliation aux normes d'études plus complexes. Ces populations étudiantes composites, tant dans leurs caractéristiques socio-démographiques que dans leurs projets, se sont définitivement éloignées de la figure idéale du bachelier « à l’heure », ayant intégré une filière choisie.\nL'entrée dans le supérieur, synonyme de ruptures plus ou moins fortes pour les étudiants selon les types d'études, s'accompagne la plupart du temps de l'apprentissage d'un autre rythme et du développement de pratiques d'études plus autonomes. Dans quelle mesure leurs parcours sont-ils réellement subis ? Les projets formulés en amont sont-ils un gage d'investissement dans les études ? Leurs compétences numériques facilitent-elles cette transition vers du travail autonome ? La qualité d'un cours, selon eux, est-elle liée à une méthode pédagogique plutôt qu'à une autre ?\nCes questionnements, au coeur de ce Dossier de veille, nourrissent une réflexion plus globale sur les expériences d'études, basée sur une exploration de la littérature scientifique récente, essentiellement française. Il s'agit en creux d'examiner les conditions de vie et d'études les plus propices à la réussite étudiante et de mettre au jour les décalages potentiels entre étudiants et enseignants en termes d’attentes et de pratiques.\n\nCe Dossier est réalisé à l'occasion d'une conférence de consensus organisée conjointement par l’Institut français de l’Éducation (ENS de Lyon) et la Direction générale de l’enseignement supérieur et de l’insertion professionnelle (Ministère de l’Éducation nationale, de l’Enseignement supérieur et de la Recherche), à Paris les 16 et 17/12/2015, sur le thème « Réussite et échec dans l’enseignement supérieur ».","authors":["Laure Endrizzi","Florence Sibut"],"meta":["December 2015","DOI:10.13140/RG.2.1.3144.0726","Report number: 106Affiliation: IFÉ, ENS de Lyon"],"references":["282001624_Le_developpement_de_competences_en_milieu_professionnel","281111643_ECAR_Study_of_Undergraduate_Students_and_Information_Technology_2014","277890757_L'universite_un_espace_de_regulation_L'abandon_dans_les_1ers_cycles_a_l'aune_de_la_socialisation_universitaire","277884759_La_motivation_aux_etudes_et_les_dispositifs_de_formation_une_comparaison_dispositif_alternance_et_dispositif_classique","301586116_Classes_preparatoires_La_fabrique_d'une_jeunesse_dominante","291401130_Student_Engagement_Bridging_Research_and_Practice_to_Improve_the_Quality_of_Undergraduate_Education","283244574_Introduction_Tous_dans_le_superieur","280848301_La_reussite_a_l'universite","280748895_Les_nouveaux_etudiants_Un_groupe_social_en_mutation","277246419_Digital_Learners_in_Higher_Education_Generation_is_Not_the_Issue"]}