{"id":"286991182_An_innovative_research_on_the_usage_of_Facebook_in_the_higher_education_context_of_Hong_Kong","abstract":"Teaching and learning is undergoing a dramatic change due to the advancement in telecommunication and IT. Increasingly, online learning platform is playing an important role higher education. The maturity of Internet and emergence of various cloud services catalyse the development of these platforms and student learning behaviour. An example is Facebook, online social network sites, which changes the interaction, communication and interrelation of students and their daily life. There is a growing trend that people participate in Facebook. Given there is discussion forum provided by online learning platforms, students get used to communicate on Facebook. The phenomenon enables teachers to think whether Facebook can be incorporated in teaching so as to facilitate student learning. Past research on online social network sites evidence that there are a number of benefits including the improved student participation, social relationship, interaction, communication and facilitation. However, seldom studies try to consolidate these benefits and examine simultaneously against the overall learning motivation. This study attempts to develop a model of student motivation in learning with four Face book benefits: (1) Interaction, (2) Communication, (3) Social relationship, (4) Participation. The students of the School of Continuing and Professional Studies (SCS), The Chinese University of Hong Kong (CUHK), studying Hi-Diploma Programme, are invited to participate in this study. A survey was conducted to examine how these Facebook benefits relate to student motivation in learning. The results revealed that Interrelationship, Communication, Social relationship, and Participation influence significantly on student learning motivation. The results show teachers how Facebook benefits improve student learning motivation. The study also tries to explore some demographic trend in related to student Facebook usage.","authors":["Louis Lam"],"meta":["October 2012Electronic Journal of e-Learning 10(4):378-386"],"references":["221023146_Visualising_student_tracking_data_to_support_instructors_in_web-based_distance_education","294746457_Bridging_the_generation_gap","290631311_Prerequisites_for_interactive_learning_in_distance_education_Perspectives_from_Swedish_students","243462963_Developing_a_pedagogy_The_role_of_the_tutor_in_enabling_student_learning_through_the_Use_of_a_wiki"]}