{"id":"286907487_Primal_Heuristics_for_Branch_and_Price_The_Assets_of_Diving_Methods","abstract":"Math heuristics have become an essential component in mixed integer programming (MIP) solvers. Extending generic MIP heuristics, our study outlines generic procedures to build primal solutions in the context of a Branch-and-Price approach and reports on their performance. Rounding the linear relaxation solution of the Dantzig-Wolfe reformulation, which is typically tighter than that of the original compact formulation, sometimes produces better solutions than state-of-the-art specialised heuristics as revealed by our nu- merical experiments. We focus on the so-called diving methods and their combination with diversification-intensification paradigms such as Limited Discrepancy Search, sub-MIPing, relaxation induced neighbourhood search, local branching, and strong branching. The dynamic generation of variables inherent to a column generation approach requires specific adaptation of heuristic paradigms. Our contribution lies in proposing simple strategies to get around these technical issues. Our numerical results on Generalized Assignment, Cutting Stock, and Vertex Coloring problems sets new benchmarks, highlighting the performance of diving heuristics as generic procedures in a column generation context.","authors":["Ruslan Sadykov","François Vanderbeck","Artur Pessoa","Issam Tahiri"],"meta":["April 2019Informs Journal on Computing Forthcoming","DOI:10.1287/ijoc.2018.0822"],"references":["286912411_The_prominence_of_stabilization_techniques_in_column_generation_the_case_of_freight_transportation","281530998_Integer_programming_column_generation_strategies_for_the_cutting_stock_problem_and_its_variants","274697037_A_Branch-and-Price-and-Cut_approach_for_Sustainable_Crop_Rotation_Planning","269696464_Automation_and_Combination_of_Linear-Programming_Based_Stabilization_Techniques_in_Column_Generation","315036468_An_Exact_Algorithm_for_Parallel_Machine_Scheduling_with_Conflicts","301742582_Bin_Packing_and_Cutting_Stock_Problems_Mathematical_Models_and_Exact_Algorithms","286126582_Fragment-based_planning_using_column_generation","285030482_Column_generation-based_heuristics_for_vehicle_routing_problem_with_soft_time_windows","281701645_The_discrete_time_window_assignment_vehicle_routing_problem","270850329_A_New_Algorithm_for_the_Maximum-Weight_Clique_Problem"]}