{"id":"286930645_From_D2D_to_Ds2D_Prolonging_the_Battery_Life_of_Mobile_Devices_via_Ds2D_Communications","abstract":"Emerging device centric systems (DCS) such as device-to-device (D2D)\ncommunications are considered as a standard part of future mobile\nnetworks, where operators/consumers involve the devices in direct\ncommunication to improve the cellular system throughput, latency,\nfairness, and energy efficiency. However, battery life of mobile\ndevices involved in such communications is crucial for 5G smartphone\nusers to explore the emerging applications in DCS. It is\nanticipated that the owners of 5G-enabled smartphones use their\ndevices more extensively to talk, text, email, and surf the Web\nmore often than do customers with 4G smartphones or traditional\nhandsets, which puts a significantly higher demand on the battery\nlife. Smartphones are currently equipped with multiple radio\ninterfaces that enable them to access different types of wireless\nnetworks including LTE-direct and Wi-Fi-direct, besides cellular networks. Such a capability is not well explored within the context of DCS. This article proposes a new scheme to support the emerging features in DCS where a D2D-enabled mobile device (sink device or a file/content requester) aggregates the radio resources of multiple mobile devices (source devices or\nfile/content providers) via its multiple radio interfaces such that the scheme is referred to as devices-to-device (Ds2D) communications. Ds2D communication scheme ensures an optimal packet split among the source mobile devices to improve the file/content transfer latency (FTL), energy efficiency, and battery life. Simulation results demonstrate that the proposed optimal packet split scheme among multiple source devices participating in Ds2D communication scheme guarantees an improvement in mobile battery life over wide range of data rate levels in comparison with the random packet split strategy and traditional D2D communication paradigm between the sink and source\nmobile devices.","authors":["Muhammad Zeeshan Shakir","Muhammad Ismail","Xianbin Wang","Khalid A. Qaraqe"],"meta":["March 2017IEEE Wireless Communications 24(4)","DOI:10.1109/MWC.2017.1600348","Project: Green Heterogeneous Networks"],"references":["291827854_Efficient_Selection_of_Source_Devices_and_Radio_Interfaces_for_Green_Ds2D_Communications","270683821_Mobile_Cloud_Computing_Mobile_Battery_Augmentation_Techniques_A_Survey","260711070_Performance_Analysis_of_Device-to-Device_Communications_with_Dynamic_Interference_Using_Stochastic_Petri_Nets","260670859_A_Survey_of_Energy-Efficient_Wireless_Communications","260020054_Game_Theoretic_D2D_Content_Dissemination_in_4G_Cellular_Networks","259044596_Five_Disruptive_Technology_Directions_for_5G","321615077_Energy_Efficient_Smart_Phones_for_5G_Networks","309140371_Joint_Mode_Selection_and_Resource_Allocation_for_Relay-Based_D2D_Communications","283533416_Device-centric_radio_access_virtualization_for_5G_networks","260654608_Solving_the_data_overload_Device-to-device_bearer_control_architecture_for_cellular_data_offloading"]}