{"id":"286921407_Topic_modeling_and_hypergraph_mining_to_analyze_the_EGC_conference_history","abstract":"Each year the EGC conference gathers researchers and practitioners from the knowledge discovery and management domain to present their latest advances. This year's edition features an open challenge that encourages participants to leverage the EGC rich anthology which spans from 2004 to 2015. The ultimate goal is to highlight the dynamics of the conference history and to try to get a glimpse of the coming years. In this context, we first describe our methodology for inferring latent topics that pervade this corpus using non-negative matrix factorization. Based on the discovered topics and other properties of the articles (e.g., authors, affiliations) we shed light on interesting facts on both the topical and collaborative structures of the EGC society. Secondly, we employ a hypergraph itemset extraction process to discover existent but latent relations between authors or between topics. We also propose topic-author and author-author recommendations with a content-based approach. Lastly, we describe a Web interface for browsing this collection of articles complemented with the discovered knowledge.","authors":["Adrien Guille","Edmundo-Pavel Soriano-Morales","Ciprian-Octavian Truică"],"meta":["January 2016","Conference: EGC '16","Projects: Topic ModelingText Analytics"],"references":["261714465_How_Many_Topics_Stability_Analysis_for_Topic_Models","257547220_Coupling_an_annotated_corpus_and_a_lexicon_for_state-of-the-art_POS_tagging","221620547_Latent_Dirichlet_Allocation","220765974_A_Hypergraph-based_Method_for_Discovering_Semantically_Associated_Itemsets","46419827_The_Lefff_a_freely_available_and_large-coverage_morphological_and_syntactic_lexicon_for_French","3297672_Random-Walk_Computation_of_Similarities_between_Nodes_of_a_Graph_with_Application_to_Collaborative_Recommendation","262157385_Latent_Dirichlet_Allocation","234794211_Recommender_Systems_Handbook","220895601_On_Finding_the_Natural_Number_of_Topics_with_Latent_Dirichlet_Allocation_Some_Observations","220556931_Email_Surveillance_Using_Non-negative_Matrix_Factorization"]}