{"id":"287062415_Multi-pattern_string_matching_algorithms_comparison_for_intrusion_detection_system","abstract":"Computer networks are developing exponentially and running at high speeds. With the increasing number of Internet users, computers have become the preferred target for complex attacks that require complex analyses to be detected. The Intrusion detection system (IDS) is created and turned into an important part of any modern network to protect the network from attacks. The IDS relies on string matching algorithms to identify network attacks, but these string matching algorithms consume a considerable amount of IDS processing time, thereby slows down the IDS performance. A new algorithm that can overcome the weakness of the IDS needs to be developed. Improving the multi-pattern matching algorithm ensure that an IDS can work properly and the limitations can be overcome. In this paper, we perform a comparison between our three multi-pattern matching algorithms; MP-KR, MPHQS and MPH-BMH with their corresponding original algorithms Kr, QS and BMH respectively. The experiments show that MPH-QS performs best among the proposed algorithms, followed by MPH-BMH, and MP-KR is the slowest. MPH-QS detects a large number of signature patterns in short time compared to other two algorithms. This finding can prove that the multi-pattern matching algorithms are more efficient in high-speed networks.","authors":["Awsan A. Hasan","Nur'Aini Abdul Rashid","Atheer Akram Abdulrazzaq"],"meta":["December 2014AIP Conference Proceedings 1635(1):27-34","DOI:10.1063/1.4903558"],"references":["220693416_Handbook_of_Exact_String_Matching_Algorithms","290575997_A_Fast_Regular_Expressions_Matching_Algorithm_for_NIDS","224334031_In-Depth_Packet_Inspection_Using_a_Hierarchical_Pattern_Matching_Algorithm","224105400_DTRAB_Combating_Against_Attacks_on_Encrypted_Protocols_Through_Traffic-Feature_Analysis","224103840_Efficient_randomized_pattern-matching_algorithms","220504247_The_dark_side_of_the_Internet_Attacks_costs_and_responses","220424762_A_Very_Fast_Substring_Search_Algorithm","220213867_Accelerating_the_bit-split_string_matching_algorithm_using_Bloom_filters","2927759_Software---Practice_And_Experience"]}