{"id":"287044763_Runtime_enforcement_of_timed_properties_revisited","abstract":"Runtime enforcement is a powerful technique to ensure that a running system satisfies some desired properties. Using an enforcement monitor, an (untrustworthy) input execution (in the form of a sequence of events) is modified into an output sequence that complies with a property. Over the last decade, runtime enforcement has been mainly studied in the context of untimed properties. This paper deals with runtime enforcement of timed properties by revisiting the foundations of runtime enforcement when time between events matters. We propose a new enforcement paradigm where enforcement mechanisms are time retardants: to produce a correct output sequence, additional delays are introduced between the events of the input sequence. We consider runtime enforcement of any regular timed property defined by a timed automaton. We prove the correctness of enforcement mechanisms and prove that they enjoy two usually expected features, revisited here in the context of timed properties. The first one is soundness meaning that the output sequences (eventually) satisfy the required property. The second one is transparency, meaning that input sequences are modified in a minimal way. We also introduce two new features, (i) physical constraints that describe how a time retardant is physically constrained when delaying a sequence of timed events, and (ii) optimality, meaning that output sequences are produced as soon as possible. To facilitate the adoption and implementation of enforcement mechanisms, we describe them at several complementary abstraction levels. Our enforcement mechanisms have been implemented and our experimental results demonstrate the feasibility of runtime enforcement in a timed context and the effectiveness of the mechanisms.","authors":["Srinivas Pinisetty","Yliès Falcone","Thierry Jeron","Hervé Marchand"],"meta":["November 2014Formal Methods in System Design 45(3):381-422","DOI:10.1007/s10703-014-0215-y","Project: VACSIM"],"references":["314217952_Algorithms_for_monitoring_real-time_properties","280752020_Runtime_Enforcement_of_Parametric_Timed_Properties_with_Practical_Applications","266416629_Runtime_Enforcement_of_Regular_Timed_Properties","265498215_Quantified_Event_Automata_Towards_Expressive_and_Efficient_Runtime_Monitors","312998514_Enforceable_security_policies","271900356_Do_you_really_mean_what_you_actually_enforced","271475607_Runtime_Enforcement_of_Parametric_Timed_Properties_with_Practical_Applications","267121681_Enforceable_Security_Policies_Revisited","262389077_Algorithms_for_Monitoring_Real-Time_Properties","226490812_Parametric_Trace_Slicing_and_Monitoring"]}