{"id":"287132656_Tetranormalization_impacts_on_CSR_practices_Impacts_de_la_Tetranormalisation_sur_les_pratiques_de_RSE","abstract":"The uninterrupted proliferation of standards has led the founders of the ISEOR since 2002 to start a vast program of researches developed by an international network open baptized \"Tetranormalization\" (Savall and Zardet, 2005). If companies are under pressure from the accounting and financial standards (IAS-IFRS) standards in world trade (OMC), social standards (SA 8000), and standards quality-safety-environment (ISO 9001, OHSAS 18001, ISO 14001) it is clear that these four poles of standards lead them to answer the expectations and aspirations disproportionate and incompatible for their stakeholders. This article proposes to examine the impact of Tetranormalization on CSR practices. Thus, with the continuous development of standards in all sectors and in all areas of business activity, Frederick Winslow Taylor would it back with the Standardized Organization of Work (SOW)? How to integrate in management of the multiple and contradictory standards? The standards relate-they prejudice to the CSR? To address the problematic, CSR appears to be a strong framework for reflection about these various issues.\nKey-words: Standards, Tetranormalization, CSR, ISO 26000.\n\nLa prolifération incessante des normes a conduit les fondateurs de l’ISEOR depuis 2002 d’entamer un vaste programme de recherches développées par un réseau international ouvert baptisé \"Tétranormalisation\" (Savall et Zardet, 2005). Si les entreprises subissent des pressions émanant des normes comptables et financières (IAS-IFRS), des normes du commerce mondial (OMC), des normes sociales (SA 8000), et des normes qualité-sécurité-environnement (ISO 9001, OHSAS 18001, ISO 14001) force est de constater que ces quatre pôles de normes les conduisent à répondre aux attentes et aspirations disproportionnées et incompatibles de leurs parties prenantes. Cet article propose de questionner l’impact de la Tétranormalisation sur les pratiques de RSE. Ainsi, avec ce développement continu des normes dans tous les secteurs d’activité et dans tous les compartiments de l’activité des entreprises, Frederick Winslow Taylor serait-il de retour avec l’Organisation Normalisée du Travail (ONT)? Comment intégrer en management des normes multiples et contradictoires? Les normes portent-elles préjudice à la RSE? Pour se pencher sur la problématique, la RSE semble être un fort cadre de réflexion sur ces différentes questions.\nMots-clés : Normes, Tétranormalisation, RSE, ISO 26000.","authors":["Rachid El Hila","Hassane Amaazoul"],"meta":["October 2013Recherches en Sciences de Gestion 96(3):199","DOI:10.3917/resg.096.0199","Project: \"CSR and Financial Performance\" \"RSE et Performance Financière\""],"references":["282441223_Corporate_social_responsibility_Evolution_of_a_definitional_construct","251012504_La_RSE_est-elle_une_question_de_convention","227350273_L'utilisation_strategique_des_instances_de_normalisation_environnementale","4883660_The_Pyramid_of_Corporate_Social_Responsibility_Toward_the_Moral_Management_of_Organizational_Stakeholders","349423564_Analyse_economique_des_approches_volontaires_de_regulation_de_l'environnement","290457566_Mythes_et_realites_de_l'entreprise_responsable","45703984_Quelques_reflexions_sur_le_management_responsable_le_developpement_durable_et_la_responsabilite_sociale_de_l'entreprise","41220726_Responsabilite_sociale_d'entreprise"]}