{"id":"287157070_Sources_and_Levels_of_Foreign_Language_Speaking_Anxiety_of_English_as_a_Foreign_Language_University_Students_with_regard_to_Language_Proficiency_and_Gender","abstract":"Although foreign language anxiety is a widely explored subject in the area of English as a Foreign Language (EFL), studies that focus on the speaking anxiety in EFL, as well as the gender and language proficiency level–anxiety relationship, are rare. The present study investigates the phenomenon in an EFL context and analyzes the levels of EFL students’ speaking anxiety and the sources that make them anxious. It also explores whether there is any relationship between anxiety and students’ language proficiency level and gender. Data were gathered from 196 Turkish and Turkish Cypriot students through questionnaires (Foreign Language Classroom Anxiety Scale), as well as through semi-structured interviews with 10 students who participated in the questionnaires. The findings indicated that the students generally had low level of speaking anxiety, although students with a higher level of language proficiency had a higher level of anxiety compared with that for students with a lower level of language proficiency. No statistically meaningful difference was observed with regard to students’ gender and anxiety levels. Factors that caused anxiety—such as difficulty in pronunciation, being asked immediate questions by the teacher, not understanding the question asked by the teacher—not found in the current literature also emerged from the present study. Implications for teacher education are also discussed.","authors":["Emre Debreli","Seren Demirkan"],"meta":["December 2015International Journal of English Language Education 4(1):49","DOI:10.5296/ijele.v4i1.8715","Project: foreign language speaking anxiety"],"references":["292991923_Speaking_anxiety_among_Turkish_EFL_learners_The_case_at_a_state_university","256495249_English_Language_Learning_Anxiety_among_Foreign_Language_Learners_in_the_Philippines","242251008_Foreign_Language_Learning_Anxiety_in_Japanese_EFL_University_Classes_Causes_Coping_and_Locus_of_Control","313527838_Language_anxiety_in_men_and_women_Dealing_with_gender_difference_in_the_language_classroom","288268268_New_directions_in_language_anxiety_research","287771104_Educational_psychology","284908113_Competitiveness_and_anxiety_in_adult_second_language_learning_Looking_at_and_Through_the_Diary_Studies","284673750_Mood_and_the_regulation_of_information_processing_and_behavior","277815337_Designing_and_Conducting_Mixed_Method_Research","252665506_Potential_Sources_of_Anxiety_for_Japanese_Learners_of_English_Preliminary_Case_Interviews_with_Five_Japanese_College_Students_in_the_US"]}