{"id":"287148546_Reinforcing_the_applicability_of_multi-model_environments_for_software_process_improvement_using_knowledge_management","abstract":"Nowadays software development organizations look for tools and methods that help them maintain their competitiveness. A key approach for organizations in order to achieve this competitiveness is a successful implementation of software process improvement (SPI). Unfortunately, most of the times, software process improvement involves a path full of obstacles due to the lack of knowledge for choosing the right implementation. The most common and critical problem consists of the selection and application of the right reference model for guiding this implementation. As an effort for helping organizations in the selection of the right implementation of improvements, multi-model environments arised enabling the use of best practices from different reference models. Multi-model approach facilitates the improvement task in order to achieve the organization's business goals. In this context, effective integration of models and standards can play a crucial role in the implementation of multi-model environments as reference support tool. Nevertheless the use of multi-model approaches presents difficulties related to the lack of knowledge of how to manage the amount of information and the correct integration of different models and standards. In this sense, knowledge management technologies have proven to be highly promising support for knowledge sharing and system integration. This work presents an ontological framework based on a multi-model approach, which facilitates and supports the SPI for small and medium companies for a life cycle process improvement. Life cycle process improvement pursues the necessary actions in a deliberate, structured and methodical manner, required in each stage of the life cycle of software development, capable for improving process to current organization needs. Finally, a case study is presented in order to show the performance of the framework.","authors":["Jezreel Mejia","Edrisi Muñoz","Mirna Muñoz"],"meta":["December 2015Science of Computer Programming 121","DOI:10.1016/j.scico.2015.12.002"],"references":["231241932_Towards_an_ontology_for_global_software_development","230585369_A_Practical_Guide_To_Building_OWL_Ontologies_Using_The_Prot'eg'e-OWL_Plugin_and_CO-ODE_Tools","228571459_An_OWL_ontology_for_representing_the_CMMI-SW_model","224315358_An_Ontology_for_CMMI-ACQ_Model","221466630_Business_and_Enterprise_Ontology_Management_with_SymOntoX","220630334_An_Empirical_Analysis_of_the_Relationship_Between_IT_Training_Sources_and_IT_Value","220619700_An_ontology_for_the_harmonization_of_multiple_standards_and_models","220344667_Defining_Software_process_model_constraints_with_rules_using_OWL_and_SWRL","3077089_How_Do_Organizations_Learn_Lessons_From_Projects-And_Do_They","276835505_A_Methodology_for_Establishing_Multi-Model_Environments_in_Order_to_Improve_Organizational_Software_Processes","244437488_A_Translation_Approach_to_Portable_Ontology_Specifications","235720353_A_Translational_Approach_to_Portable_Ontologies","227575546_Methodology_for_process_improvement_through_basic_components_and_focusing_on_the_resistance_to_change","224197795_Building_process_definition_with_ontology_background","220508155_Applying_Ontology-Based_Models_for_Supporting_Integrated_Software_Development_and_IT_Service_Management_Processes","31686350_Introduction_to_the_team_software_process_WS_Humphrey","3248111_Quality_time_-_Six_sigma_for_software"]}