{"id":"287125890_Emotion_Recognition_using_ECG_Signals_with_Local_Pattern_Description_Methods","abstract":"We designed a healthcare system that focuses on emotional aspects to cope with negative emotions in daily life. Our emotional healthcare system integrates emotion recognition based on facial expressions and ECG signals to identify user emotions to provide appropriate services. Recognizing emotions from facial expressions is sometimes difficult to correctly recognize them when users hide their emotions from their appearance. To solve this, emotion recognition using ECG signals is applied because they cannot be controlled by humans, since they are directly affected by mental states including emotions. This paper focuses on emotion recognition using ECG signals. To recognize emotions from them, we adapted the local binary pattern (LBP) and local ternary pattern (LTP) which are favorable local pattern description methods for emotion recognition by facial expressions. We evaluated the LBP and LTP performances. Our results indicate that they effectively extracted ECG features with high accuracy. In real-time evaluation, we experimentally evaluated its efficiency and effectiveness for recognizing negative emotions. Our results show that the real-time emotion recognition from ECG signal is beneficial and efficient enough for emotional healthcare system to analyze negative emotions to provide assistance.","authors":["Somchanok Tivatansakul","Michiko Ohkura"],"meta":["December 2015International Journal of Affective Engineering 15(2)","DOI:10.5057/ijae.IJAE-D-15-00036"],"references":["301411471_The_design_implementation_and_evaluation_of_a_relaxation_service_with_facial_emotion_detection","293651093_Content_Evaluation_of_Exciting_Feeling_by_Using_Biosignals","287118939_Emotional_healthcare_system_Emotion_detection_by_facial_expressions_using_Japanese_database","267723566_MEASUREMENT_OF_WAKUWAKU_FEELING_GENERATED_BY_INTERACTIVE_SYSTEMS_USING_BIOLOGICAL_SIGNALS","263662705_Classification_and_feature_selection_techniques_in_data_mining","315081820_Relationship_between_Kawaii_Feeling_and_Biological_Signals","286704738_Emotion_recognition_based_on_ecg_signals_for_service_robots_in_the_intelligent_space_during_daily_life","281327990_Enhanced_Local_Texture_Feature_Sets_for_Face_Recognition_Under_Difficult_Lighting_Conditions","271314926_Healthcare_System_Focusing_on_Emotional_Aspect_using_Augmented_Reality","267490835_Study_on_Driver_Distraction_Indexes_Using_Biological_Signals_Applying_Assessment_of_Information_Display"]}