{"id":"287249747_The_readwrite_protocol_complex_is_collapsible","abstract":"The celebrated \\emph{asynchronous computability theorem} provides a\ncharacterization of the class of decision tasks that can be solved in a\nwait-free manner by asynchronous processes that communicate by writing and\ntaking atomic snapshots of a shared memory. Several variations of the model\nhave been proposed (immediate snapshots and iterated immediate snapshots), all\nequivalent for wait-free solution of decision tasks, in spite of the fact that\nthe protocol complexes that arise from the different models are structurally\ndistinct. The topological and combinatorial properties of these snapshot\nprotocol complexes have been studied in detail, providing explanations for why\nthe asynchronous computability theorem holds in all the models.\nIn reality concurrent systems do not provide processes with snapshot\noperations. Instead, snapshots are implemented (by a wait-free protocol) using\noperations that write and read individual shared memory locations. Thus,\nread/write protocols are also computationally equivalent to snapshot protocols.\nHowever, the structure of the read/write protocol complex has not been studied.\nIn this paper we show that the read/write iterated protocol complex is\ncollapsible (and hence contractible). Furthermore, we show that a distributed\nprotocol that wait-free implements atomic snapshots in effect is performing the\ncollapses.","authors":["Fernando Andrés Benavides Agredo","Sergio Rajsbaum"],"meta":["December 2015","SourcearXiv"],"references":["234819920_Shavit_N_The_Topological_Structure_of_Asynchronous_Computability_Journal_of_the_ACM_466_858-923","290912781_Iterated_Chromatic_Subdivisions_are_Collapsible","286056649_Distributed_Computing_Through_Combinatorial_Topology","268164714_Simplicial_Complexes_of_Graphs","263056993_Topology_of_the_immediate_snapshot_complexes","259010202_Topology_of_the_view_complex","258232527_Chromatic_subdivision_of_a_simplicial_complex","254463127_Simulations_and_reductions_for_colorless_tasks","239583375_Memory_requirements_for_agreement_among_unreliable_asynchronous_processes","238244159_Impossibility_of_distribute_ommit_with_one_faulty_process"]}