{"id":"287248450_An_adaptive_web-based_intelligent_tutoring_using_mastery_learning_and_logistic_regression_techniques","abstract":"In this paper, we present an Adaptive Web-Based Intelligent Tutoring System using Mastery Learning, Logistic Regression and rule-based Techniques. To create a model for analysis programming skills in each level as specified in the curriculum, Logistic Regression approach was used to predict the probability of pass or the probability of fail of student enrolling in a JAVA Programming Language Course. According to the level of student knowledge, the main function of the system is the ability to automatically adapt and change content by the ability of the learner and also to organize learning contents in order to suit with the learner until he/she can have in terms of required skills. The experimental results showed that rule-based and Logistic Regression approaches can help student learning and reduce time consuming. To evaluate the preliminary prototype system, Black Box Testing and questionnaires were used to measure system performance and user satisfaction respectively. The results were satisfactory as followed: Means for teacher and students were 4.15 and 4.23, and standard deviations were 0.64 and 0.71.","authors":["Kunyanuth Kularbphettong"],"meta":["August 2014Journal of Theoretical and Applied Information Technology 66(1):31-35"],"references":["227594178_Mastery_learning_and_assessment_Implications_for_students_and_teachers_in_an_era_of_high-stakes_testing","222545795_Expert_tutoring_system_for_teaching_computer_programming_languages","337472411_A_framework_of_Intelligent_Tutorial_System_to_incorporate_adaptive_learning_and_assess_the_relative_performance_of_adaptive_learning_system_over_general_classroom_learning","280787816_A_Model_of_Adaptive_e-learning_Hypermedia_System_based_on_Thinking_and_Learning_Styles","257404791_Design_and_development_of_an_innovative_individualized_adaptive_and_intelligent_e-learning_system_for_teaching-learning_of_probability_unit_Details_of_UZWEBMAT","257403578_Student_modeling_and_assessment_in_intelligent_tutoring_of_software_patterns","221185253_ACTIVEMATH_An_intelligent_tutoring_system_for_mathematics","220298519_A_web-based_Bayesian_intelligent_tutoring_system_for_computer_programming"]}