{"id":"287238284_Exploratory_Study_on_Alignment_Between_IT_and_Business_Strategies","abstract":"Interaction and linkages between business and information technology (IT) strategies remain a primary concern among executives. This study aims to gain an in depth understanding of how companies achieve alignment and the policy framework that underlies the efforts, particularly those that are associated with the most dominant factor that contributes to the establishment of strategic alignment, namely IT infrastructure flexibility. For that purpose, the study explored four companies engaged in the field of oil, electricity, and communication by adopting interpretive case study. Data were gathered using triangulation methods via field interviews, artifacts, document analysis, as well as direct observation. The textual data were elaborated by an intentional analysis in order to guide the study in exploring the phenomenon. The study identified elements that reflect IT infrastructure flexibilities namely connectivity, compatibility, modularity, IT staff knowledge and skills, and integration. Those elements cover both technical and behavioral dimensions of a company's components that need to be included in the consideration during the planning phase.","authors":["Wahyuni Reksoatmodjo","Jogiyanto Hartono","Achmad Djunaedi","Hargo Utomo"],"meta":["May 2012Gadjah Mada International Journal of Business 14(2):139-162","DOI:10.22146/gamaijb.5441"],"references":["313175850_Strategic_information_systems_alignment","307633573_Introduction_The_discipline_and_practice_of_qualitative_research","302363661_Gaining_Strategic_Alignment","292445580_Strategic_information_systems_alignment","285805869_Alignment_of_business_strategy_and_it_strategy_A_case_study_of_a_fortune_50_financial_services_comany","284817922_The_Impact_of_Information_Technology_Infrastructure_Flexibility_on_Strategic_Alignment_and_Applications_Implementation","284696476_Ways_of_knowing","279890600_Measuring_the_Flexibility_of_Information_Technology_Infrastructure_Exploratory_Analysis_of_a_Construct","262172049_An_Integrated_Framework_for_Strategic_Information_Systems_Planning_and_Development","262142507_How_Information_Gives_You_Competitive_Advantage"]}