{"id":"287250708_SharesSkew_An_Algorithm_to_Handle_Skew_for_Joins_in_MapReduce","abstract":"In this paper we offer an algorithm which computes the multiway join efficiently in MapReduce even when the data is skewed. Handling skew is one of the major challenges in query processing and computing joins is both important and costly. When data is huge distributed computational platforms must be used. The algorithm Shares for computing multiway joins in MapReduce has been shown to be efficient in various scenarios. It optimizes on the communication cost which is the amount of data that is transferred from the mappers to the reducers. However it does not handle skew. Our algorithm distributes Heavy Hitter (HH) valued records separately by using an adaptation of the Shares algorithm to achieve minimum communication cost. HH values of an attribute is decided by our algorithm and depends on the sizes of the relations (or the part of the relations with HH) and how these sizes interrelate with each other. Unlike other recent algorithms for computing multiway joins in MapReduce, which put a constraint on the number of reducers used, our algorithm puts a constraint on the size (number of tuples) of each reducer. We argue that this choice results in even distribution of the data to the reducers. Furthermore, we investigate a family of multiway joins for which a simpler variant of our algorithm can handle skew. We offer closed forms for computing the parameters of our algorithm for chain and symmetric joins.","authors":["Foto Afrati","Nikos Stasinopoulos","Jeffrey Ullman","Angelos Vassilakopoulos"],"meta":["June 2018Information Systems 77(September 2018):129-150","DOI:10.1016/j.is.2018.06.005","SourcearXiv"],"references":["266972058_GYM_A_Multiround_Join_Algorithm_In_MapReduce","262348273_Worst-case_Optimal_Join_Algorithms","262218295_Minimal_MapReduce_algorithms","261029561_alpha_k-Minimal_Sorting_and_Skew_Join_in_MPI_and_MapReduce","259624951_Skew_in_Parallel_Query_Processing","257748810_Skew_Strikes_Back_New_Developments_in_the_Theory_of_Join_Algorithms","285108978_Mechanical_properties_of_two_kinds_of_new_cold-formed_flange-closed_welded_section_members","266657585_Beyond_worst-case_analysis_for_joins_with_Minesweeper","266656578_Major_technical_advancements_in_Apache_Hive","260707483_Optimizing_Multiway_Joins_in_a_Map-Reduce_Environment"]}