{"id":"287241140_Influence_of_heterogeneous_crystallization_conditions_of_aluminum_alloy_on_its_plastic_properties","abstract":"Purpose: Determination of the influence of gas-dynamic treatment and inoculation of the metal with TiCN ultradisperse powders on its mechanical properties and formation of porosity in shaped casting of SC51A (AK5M) alloy solidified in the chill mold during implementation of the corresponding complex technology. Methodology: Experimental thermographic studies using HA thermocouples were held. The temperature field of the casting was plotted. For the hardware determination of the components in the alloy under study, we employed the photoelectric spectral method of elements mass fraction measurement, a method of indirect measurements. The standard procedure of Brinell hardness test was applied to the samples of the cast metal. The mechanical properties, namely tensile strength at room temperature σB (MPa) and elongation δ (%) were determined according to the State Standard (GOST 1497-84) by means of the Tensile Strength Test Machine FM1000 with the samples of 10 mm diameter cut from the body of casting. To simulate the SC51A (AK5M) aluminum alloy shaped casting solidification process we employed the Polygon system of computer modeling of casting processes (SCM CP). Findings: The effect of implementation of the combined technology of aluminum alloy refinement with TiCN ultrafine modifier and gas-dynamic treatment on the mechanical properties of shaped casting metal solidified in the chill has been determined. Originality: For the first time, we suggest the possibility and define conditions of the combined action of ultrafine modifier inoculation and gas-dynamic treatment on the solidifying SC51A (AK5M) alloy. Practical value: Technological modes of the combined action on the melt during crystallization in the \"supporting tip of conveyor bar\" chill mold that weighted 1.1 kg made of SC51A (AK5M) alloy have been developed.","authors":["Yu.V. Dotsenko","V.Yu. Selivorstov","T.V. Selivorstova","N.V. Dotsenko"],"meta":["January 2015"],"references":[]}