{"id":"287247383_Reductionism_emergence_and_levels_of_reality_The_importance_of_being_borderline","abstract":"Scientists have always attempted to explain the world in terms of a few unifying principles. In the fifth century B.C. Democritus boldly claimed that reality is simply a collection of indivisible and eternal parts or atoms. Over the centuries his doctrine has remained a landmark, and much progress in physics is due to its distinction between subjective perception and objective reality. This book discusses theory reduction in physics, which states that the whole is nothing more than the sum of its parts: the properties of things are directly determined by their constituent parts. Reductionism deals with the relation between different theories that address different levels of reality, and uses extrapolations to apply that relation in different sciences. Reality shows a complex structure of connections, and the dream of a unified interpretation of all phenomena in several simple laws continues to attract anyone with genuine philosophical and scientific interests. If the most radical reductionist point of view is correct, the relationship between disciplines is strictly inclusive: chemistry becomes physics, biology becomes chemistry, and so on. Eventually, only one science, indeed just a single theory, would survive, with all others merging in the Theory of Everything. Is the current coexistence of different sciences a mere historical venture which will end when the Theory of Everything has been established? Can there be a unified description of nature? Rather than an analysis of full reductionism, this book focuses on aspects of theory reduction in physics and stimulates reflection on related questions: is there any evidence of actual reduction? Are the examples used in the philosophy of science too simplistic? What has been endangered by the search for (the) ultimate truth? Has the dream of reductionist reason created any monsters? Is big science one such monster? What is the point of embedding science Y within science X, if predictions cannot be made on that basis?. © Springer International Publishing Switzerland 2014. All rights are reserved.","authors":["Sergio Chibbaro","Lamberto Rondoni","Angelo Vulpiani"],"meta":["March 2014","DOI:10.1007/978-3-319-06361-4","ISBN: 978-3-319-06360-7"],"references":["247553746_Book_Review_What_Makes_Biology_Unique_Considerations_for_the_Autonomy_of_a_Scientific_Discipline","230988243_Transport_properties_of_chaotic_and_non-chaotic_many_particle_systems","51909956_Emergence_Reduction_and_Supervenience_A_Varied_Landscape","36444602_Contextual_Emergence_in_the_Description_of_Properties","36443866_Emergence_in_exact_natural_science","36443855_Determinism_Is_Ontic_Determinability_is_Epistemic","266828495_Le_mecanisme_et_l'experience","259222275_Statistical_mechanics_Euler's_equation_and_Jupiter's_Red_Spot","252648722_Quantum_Chemical_Models_Nobel_lecture","248441564_Why_is_the_physical_world_so_comprehensible","248233371_Unperformed_experiments_have_no_results","248186016_Types_of_Inter-Theoretic_Reduction","246906989_Multiscale_Modeling_and_Computation","243489792_''On_recognizing_'law_without_law'_''_Oersted_Medal_Response_at_the_joint_APS-AAPT_Meeting_New_York_25_January_1983","239571901_Birds_and_Frogs","231460854_Must_a_Molecule_Have_a_Shape","229807904_Recent_Thinking_about_the_Nature_of_the_Physical_World_It_from_Bit","228053550_Science_of_Chaos_or_Chaos_in_Science","227644803_Does_the_Argument_from_Realization_Generalize_Responses_to_Kim","226192128_Determinism_and_predictability","222448688_Can_the_maximum_entropy_principle_be_explained_as_a_consistency_requirement","28645718_Algorithmic_Randomness_in_Empirical_Data","13392031_Instability_of_tunneling_and_the_concept_of_molecular_structure_in_Quantum_Mechanics_The_case_of_pyramidal_molecules_and_the_enantiomer_problem","12240138_Quantum_algorithmic_integrability_The_metaphor_of_classical_polygonal_billiards","2172972_Ground_Control_to_Niels_Bohr_Exploring_Outer_Space_with_Atomic_Physics"]}