{"id":"287203843_Genome-wide_identification_and_characterization_of_transcription_start_sites_and_promoters_in_the_tunicate_Ciona_intestinalis","abstract":"The tunicate Ciona intestinalis, an invertebrate chordate, has recently emerged as a powerful model organism for gene regulation analysis. However, few studies have been conducted to identify and characterize its transcription start sites (TSSs) and promoters at the genome-wide level. Here, using TSS-seq, we identified TSSs at the genome-wide scale and characterized promoters in C. intestinalis. Specifically, we identified TSS clusters (TSCs), high-density regions of TSS-seq tags, each of which appears to originate from an identical promoter. TSCs were found not only at known TSSs but also in other regions, suggesting the existence of many unknown transcription units in the genome. We also identified candidate promoters of 79 ribosomal protein (RP) genes, each of which had the major TSS in a polypyrimidine tract and showed a sharp TSS distribution like human RP gene promoters. Ciona RP gene promoters, however, did not appear to have typical TATA boxes, unlike human RP gene promoters. In Ciona non-RP promoters, two pyrimidine-purine dinucleotides, CA and TA, were frequently used as TSSs. Despite the absence of CpG islands, Ciona TATA-less promoters showed low expression specificity like CpG-associated human TATA-less promoters. By using TSS-seq, we also predicted trans-spliced gene TSSs and found that their downstream regions had higher G+T content than those of non-trans-spliced gene TSSs. Furthermore, we identified many putative alternative promoters, some of which were regulated in a tissue-specific manner. Our results provide valuable information about TSSs and promoter characteristics in C. intestinalis and will be helpful in future analysis of transcriptional regulation in chordates.","authors":["Rui Yokomori","Kotaro Shimai","Koki Nishitsuji","Yutaka Suzuki"],"meta":["December 2015Genome Research 26(1)","DOI:10.1101/gr.184648.114"],"references":["281473421_Tunicates_and_not_cephalochordates_are_the_closest_living_relatives_of_vertebrates","269768057_Trans-Splicing_and_Operons_in_Metazoans_Translational_Control_in_Maternally_Regulated_Development_and_Recovery_from_Growth_Arrest","263396428_TRF2_but_not_TBP_mediates_the_transcription_of_ribosomal_protein_genes","261402026_A_promoter-level_mammalian_expression_atlas","256334184_Study_of_Cis-regulatory_Elements_in_the_Ascidian_Ciona_intestinalis","320538332_Genome_structure_functional_genomics_and_proteomics_in_ascidians","317349337_CpG_islands_and_the_regulation_of_transcription","287280723_Genome_Structure_Functional_Genomics_and_Proteomics_in_Ascidians","261107564_A_promoter-level_mammalian_expression_atlas","247790705_Blat-the_BLAST-like_alignment_tool"]}