{"id":"287218879_Research_Article_OPWUM_Opportunistic_MAC_Protocol_Leveraging_Wake-Up_Receivers_in_WSNs","abstract":"Opportunistic forwarding has emerged as a promising technique to address the problem of unreliable links typical in wireless sensor networks and improve energy efficiency by exploiting multiuser diversity. Timer-based solutions, such as timer-based contention, form promising schemes to allow opportunistic next hop relay selection. However, they can incur significant idle listening and thus reduce the lifetime of the network. To tackle this problem, we propose to exploit emerging wake-up receiver technologies that have the potential to considerably reduce the power consumption of wireless communications. A careful design of MAC protocols is required to efficiently employ these new devices. In this work, we propose Opportunistic Wake-Up MAC (OPWUM), a novel multihop MAC protocol using timer-based contention. It enables the opportunistic selection of the best receiver among its neighboring nodes according to a given metric (e.g., the remaining energy), without requiring any knowledge about them. Moreover, OPWUM exploits emerging wake-up receivers to drastically reduce nodes power consumption. Through analytical study and exhaustive networks simulations, we show the effectiveness of OPWUM compared to the current state-of-the-art protocols using timer-based contention.","authors":["Faycal Ait Aoudia","Matthieu Gautier","Olivier Berder"],"meta":["December 2015Journal of Sensors 2016(4)","DOI:10.1155/2016/6263719"],"references":["289090000_An_ultra_low_power_high_sensitivity_wake-up_radio_receiver_with_addressing_capability","282762587_Survey_on_Opportunistic_Routing_in_Multihop_Wireless_Networks","277211152_Implantable_body_sensor_network_MAC_protocols_using_wake-up_radio_-_Evaluation_in_animal_tissue","269165065_Beyond_Duty_Cycling_Wake-up_Radio_with_Selective_Awakenings_for_Long-lived_Wireless_Sensing_Systems","266654890_Ultra_Low_Power_Asynchronous_MAC_Protocol_using_Wake-Up_Radio_for_Energy_Neutral_Wireless_Sensor_Networks","262388731_GreenCastalia_An_energy-harvesting-enabled_framework_for_the_Castalia_simulator","274308474_Has_Time_Come_to_Switch_from_Duty-Cycled_MAC_Protocols_to_Wake-up_Radio_for_Wireless_Sensor_Networks","267060315_Game_Theory_in_Wireless_Sensor_Networks","263094104_QoS_Aware_Geographic_Opportunistic_Routing_in_Wireless_Sensor_Networks","261859928_Analytic_comparison_of_wake-up_receivers_for_WSNs_and_benefits_over_the_wake-on_radio_scheme"]}