{"id":"287208708_The_research_activity_of_the_current_faculty_of_the_Greek_chemical_engineering_departments_a_bibliometric_study_in_national_and_international_context","abstract":"The object of the present study is the evaluation of the research quality of the three Greek chemical engineering departments (Athens, Thessaloniki, Patras) by means of several advanced bibliometric indices calculated separately for each academic using a twofold approach, namely in department and academic rank level. This allows the ranking of the studied departments, but also sheds light on the distribution of the research activity among the various ranks. In addition, to assess the research profile and background of the current faculty of the Greek chemical engineering departments in International context their research output is compared with that of Massachusetts chemical engineering department, Massachusetts Institute of Technology (MIT). Dependency of the bibliometric indices on seniority is also investigated, conducting the bibliometric analysis using a common time basis for all academics, i.e., research performance during the last decade. Available data are also used to investigate the temporal progress of the research productivity. Finally, gender distribution among the academics of the various ranks is also studied to explore the gender balance in research. In general, bibliometrics demonstrate that Patras department host academics of better quality, with higher scientific activity over the last decade, but superiority of MIT department against the Greek departments is also evident. Results also indicate that no common standards in hiring/promotion of academics are established between the departments. The negative impact of the European socio-economic crisis on the research productivity is also highlighted, while the university system suffers from unequal gender distribution with pronounced male dominance.","authors":["Nikolaos A. Kazakis"],"meta":["January 2015Scientometrics 103:229-250","DOI:10.1007/s11192-014-1523-0"],"references":["316253940_Social_Media_and_Higher_Education_-_An_International_Perspective","262536254_Bibliometric_evaluation_of_the_research_performance_of_the_Greek_civil_engineering_departments_in_National_and_European_context","257937996_On_the_evaluation_of_the_Quality_of_Research_in_Greek_HEIs_using_Bibliometric_Indices","257663173_Career_prospects_for_female_university_researchers_have_not_improved","242915905_Research_output_evaluation_of_two_University_Departments_in_Greece_with_the_use_of_bibliometric_indicators","237292494_Evaluating_Greek_Departments_of_Computer_ScienceEngineering_using_Bibliometric_Indices","237149507_Evaluating_the_research_performance_of_the_Greek_medical_schools_using_bibliometrics","236681057_Evaluation_of_ninety-three_major_Greek_university_departments_using_Google_Scholar","272561843_Blackburn_RT_Behymer_CE_Hall_DE_Research_note_correlates_of_faculty_publications","257663184_Are_more_senior_academics_really_more_research_productive_than_junior_academics_Evidence_from_Australian_law_schools"]}