{"id":"287382991_Agile_The_good_the_hype_and_the_ugly","abstract":"Are you attracted by the promises of agile methods but put off by the fanaticism of many agile texts? Would you like to know which agile techniques work, which ones do not matter much, and which ones will harm your projects? Then you need Agile!: the first exhaustive, objective review of agile principles, techniques and tools. Agile methods are one of the most important developments in software over the past decades, but also a surprising mix of the best and the worst. Until now every project and developer had to sort out the good ideas from the bad by themselves. This book spares you the pain. It offers both a thorough descriptive presentation of agile techniques and a perceptive analysis of their benefits and limitations. Agile! serves first as a primer on agile development: one chapter each introduces agile principles, roles, managerial practices, technical practices and artifacts. A separate chapter analyzes the four major agile methods: Extreme Programming, Lean Software, Scrum and Crystal. The accompanying critical analysis explains what you should retain and discard from agile ideas. It is based on Meyer's thorough understanding of software engineering, and his extensive personal experience of programming and project management. He highlights the limitations of agile methods as well as their truly brilliant contributions - even those to which their own authors do not do full justice. Three important chapters precede the core discussion of agile ideas: an overview, serving as a concentrate of the entire book; a dissection of the intellectual devices used by agile authors; and a review of classical software engineering techniques, such as requirements analysis and lifecycle models, which agile methods criticize. The final chapters describe the precautions that a company should take during a transition to agile development and present an overall assessment of agile ideas. This is the first book to discuss agile methods, beyond the brouhaha, in the general context of modern software engineering. It is a key resource for projects that want to combine the best of established results and agile innovations. © Springer International Publishing Switzerland 2014. All rights are reserved.","authors":["Bertrand Meyer"],"meta":["February 2014","DOI:10.1007/978-3-319-05155-0","ISBN: 978-3-319-05154-3"],"references":["260649064_A_Rational_Design_Process_How_and_Why_to_Fake_it","224587384_Programs_That_Test_Themselves","2955526_Agile_software_development_The_people_factor","279584537_Iterative_Enhancement_A_Practical_Technique_for_Software_Development","234027919_Agile_Maturity_Model_Oxymoron_or_the_Next_Level_of_Understanding","220423717_Design_and_Code_Reviews_in_the_Age_of_the_Internet","220376687_Two_controlled_experiments_concerning_the_comparison_of_pair_programming_to_peer_review","2954362_Plea_for_lean_software","2531047_Experimental_Evaluation_of_Pair_Programming"]}