{"id":"287393586_A_Set_of_Best_Practices_to_Design_Face-to-face_Teaching_Sessions_for_Technology-centered_University-level_Computing_Courses","abstract":"Since more than a decade, all kinds of businesses and organisations are intensively exploring enterprise-level information systems to better integrate their business processes, information flows and people. Consequently, the industry demands for technically skilled, but also “business-savvy” IT professionals are permanently growing. To meet this need, more and more computing education programs try to incorporate enterprise-level information systems into their curricula. While there is some computing education research done to investigate the need for this new type of IT-business professional and to analyse general implications for higher education, only very few research works or practice papers exist which report on concrete attempts to design and deliver higher education computing courses which intensively use enterprise-level systems. In this paper, the author reports on a series of experiences made within the Bachelor of Science (Information Systems Management) degree program offered by the School of Information Systems (SIS) at the Singapore Management University (SMU). The primary focus of this paper is put on establishing a working set of best practices for the design of an effective structure of the face-to-face teaching sessions for courses which use enterprise-level systems and applications in their curricula. While this paper is principally based on education experiences made within the frame of an Information Systems program, the best practices presented in this paper are equally applicable to any other computing education field or even to the engineering education in general.","authors":["Ilse Baumgartner"],"meta":["October 2014","DOI:10.3991/ijep.v4i4.4000"],"references":["271272527_Twelve_Tips_for_Successfully_Integrating_Enterprise_Systems_Across_the_Curriculum","234634728_Enterprise_Systems_ES_Software_in_Business_School_Curriculum--Evaluation_of_Design_and_Delivery","228894135_Enterprise_integration_in_business_education_Design_and_outcomes_of_a_capstone_ERP-based_undergraduate_e-business_management_course","303285902_An_innovative_framework_of_integrating_erp_into_is_2010_model_curriculum","292872725_Teaching_enterprise_systems_curriculum_in_developing_countries","292781803_Second_wave_ERP_education","289725599_Teaching_ERP_systems_Results_of_a_survey_at_researchoriented_universities_and_universities_of_applied_sciences_in_Germany","285745734_A_twelve-step_multiple_course_approach_to_teaching_enterprise_resource_planning","237842824_Enterprise_Systems_Education_in_the_21st_Century","229889905_Knowledge_Management_ERP_Curriculum_DesignMapping_Theory_and_Development_Tools"]}