{"id":"287360572_Single_web_camera_robust_interactive_eye-gaze_tracking_method","abstract":"Eye-gaze tracking is an aspect of human-computer interaction still growing in popularity,. Tracking human gaze point can help control user interfaces and may help evaluate graphical user interfaces. At the same time professional eye-trackers are very expensive and thus unavailable for most of user interface researchers and small companies. The paper presents very effective, low cost, computer vision based, interactive eye-gaze tracking method. On contrary to other authors results the method achieves very high precision (about 1.5 deg horizontally and 2.5 deg vertically) at 20 fps performance, exploiting a simple HD web camera with reasonable environment restrictions. The paper describes the algorithms used in the eye-gaze tracking method and results of experimental tests, both static absolute point of interest estimation, and dynamic functional gaze controlled cursor steering.","authors":["Adam Wojciechowski","Krzysztof Fornalczyk"],"meta":["December 2015Bulletin of the Polish Academy of Sciences, Technical Sciences 63(4):879 - 886","DOI:10.1515/bpasts-2015-0100","Project: Appearance and psychophysiological features analysis for human-computer interaction"],"references":["285976764_Hand's_poses_recognition_as_a_mean_of_communication_with_natural_user_interfaces","267970188_Biometric_speech_signal_processing_in_a_system_with_digital_signal_processor","261704605_Real-time_motion_tracking_using_optical_flow_on_multiple_GPUs","313557672_Models_for_Gaze_Tracking_Systems","313041861_View-dependent_simplification_of_arbitrary_polygonal_environments","302937305_A_Threshold_Selection_Method_from_Gray-Level_Histogram","284593187_A_Gaze-Responsive_Self-Disclosing_Display_Human_Factors_in_Comp_Syst","284072860_Bidirectional_Image_Thresholding_Algorithm_Using_Combined_Edge_Detection_And_P-tile_Algorithms","279982461_Consumer_Eye_Movement_Patterns_on_Yellow_Pages_Advertising","267195926_Implementation_of_Polish_speech_synthesis_for_the_BOSS_system"]}