{"id":"287329867_M-learning_in_Nigerian_higher_education_An_experimental_study_with_Edmodo","abstract":"Social media technologies have recently gained remarkable popularity in the education sector. Recent research indicated that students rely on social media for educational purposes like social networking, chatting, and knowledge sharing. With social media aiding learning experiences, m-learning is anticipated to improve the application of social media. In the paper, we investigated the preference of social media tools and mobile devices for learning, their benefits and effectiveness, and how they can possibly improve learning process in Nigeria. Furthermore, we evaluated learning experiences of\nstudents using Edmodo social media-based learning environment in a Nigerian university. We used a mixed method research approach, where the data was triangulated from two questionnaires and students’ interviews. Data gathered after the course shows that students learning response was improved. Students were eager to use mobile devices for accessing social media sites, thus\nproviding experimental evidence of the place of social media in m-learning","authors":["Solomon Sunday Oyelere","Vasileios Paliktzoglou","Jarkko Suhonen"],"meta":["January 2016International Journal of Social Media and Interactive Learning Environments 4(1):43-62","DOI:10.1504/IJSMILE.2016.075055","Project: Developing mobile learning application for ICT/Programming"],"references":["310506533_Multidisciplinary_methods_in_educational_technology_research_and_development","284773009_Facing_the_facebook","281818363_Exploring_the_Roles_of_Social_Participation_in_Mobile_Social_Media_Learning_A_Social_Network_Analysis","275908791_Interactive_Youth_New_Citizenship_between_Social_Networks_and_School_Settings","317953655_Designing_and_conducting_mixed_methods_research","307981795_Qualitative_Interviewing_The_Art_of_Hearing_Data","283519628_Exploring_the_Roles_of_Social_Participation_in_Mobile_Social_Media_Learning_A_Social_Network_Analysis","280696811_Mixing_Qualitative_and_Quantitative_Methods_Triangulation_in_Action","279553713_Students'_attitudes_and_perceptions_towards_the_effectiveness_of_mobile_learning_in_King_Saud_University_Saudi_Arabia","277815337_Designing_and_Conducting_Mixed_Method_Research"]}