{"id":"287352161_Metodos_para_Captura_de_Licoes_Aprendidas_Em_Direcao_a_Melhoria_Continua_na_Gestao_de_Projetos","abstract":"Em um mercado competitivo e em constante evolução a gestão efetiva da informação e a transferência de conhecimento são aspectos estratégicos para as empresas. A fim de melhorar os processos de gestão de projetos, as empresas têm adotado metodologias e frameworks, como alternativas que permitam maximizar a taxa de sucesso no desenvolvimento dos projetos. Como uma extensão da gestão de projetos, o processo de captura e análise de lições aprendidas é um método eficiente e efetivo de gestão da informação e transferência de conhecimento, adquiridos durante a execução de um projeto, permitindo que a organização aprimore seus processos, reduza custos e gere valor ao negócio. Cada projeto executado fornece uma base de conhecimento importante que pode ser utilizada como diferencial competitivo pela empresa. Este artigo teórico apresenta uma revisita e análise dos principais métodos para captura de lições aprendidas em projetos propostos nas últimas décadas. A análise foi realizada a partir de critérios comuns a maior parte dos métodos. Os resultados incluem recomendações para promover o aprendizado sistemático em projetos e a implementação exitosa da gestão de lições aprendidas.","authors":["Giuliana Veronese"],"meta":["April 2014Revista de Gestão e Projetos 05(01):71-83","DOI:10.5585/gep.v5i1.250"],"references":["263809646_Using_microblogging_for_lessons_learned_in_information_systems_projects","262174776_Licoes_Aprendidas_Agregando_Valor_ao_Gerenciamento_de_Projetos","326115813_Journaling_A_Learning_Tool_for_Project_Management_Training_and_Team-building","317953505_Situated_learning_Legitimate_peripheral_participation","284791316_Post-project_appraisals_pay","284659256_An_Assessment_of_Post-Project_Reviews","284108428_A_systems_approach_to_project_evaluation","276094929_Learning-Based_Project_Reviews_Observations_and_Lessons_Learned_from_the_Kennedy_Space_Center","269573049_The_Fifth_Discipline_The_Art_And_Practice_of_the_Learning_Organization","269572900_The_Fifth_Discipline_-_The_Art_Practice_of_The_Learning_Organization"]}