{"id":"287477459_Labeling_of_Human_Motion_Based_on_CBGA_and_Probabilistic_Model","abstract":"In this paper, we present a novel method for the labeling of human motion which uses Constraint-Based Genetic Algorithm (CBGA) to optimize the probabilistic model of body features and construct the set of conditional independence relations among the body features by a fitness function. The approach also allows the user to add custom rules to produce valid candidate solutions to achieve more accurate results with constraint-based genetic operators. Specifically, we design the fitness function using a probability model based on the decomposable triangle model(DTM), which is learned through the EM algorithm with the minimum description length (MDL) principle and CBGA algorithm to characterize the stochastic and dynamic relations of articulated human motions. We also extend these results to learning the probabilistic structure of human body to improve the labeling results, the handling of missing body parts, the integration of multi-frame information and the accuracy rates. Finally, we analyze the performance of our proposed approach and show that it outperforms most of the current state of the art methods on a set of motion captured walking, running and dancing sequences in terms of quality and robustness.","authors":["Fuyuan Hu","Hau San Wong"],"meta":["January 2013International Journal on Smart Sensing and Intelligent Systems 6(2):583-609","DOI:10.21307/ijssis-2017-556"],"references":["278329461_An_Unsupervised_Learning_and_Statistical_Approach_for_Vietnamese_Word_Recognition_and_Segmentation","232656824_Human_Motion_Synthesis_from_3D_Video","228574619_Multi-Target_Multi-Sensor_Tracking_Based_On_Quality-Of-Information_And_Formal_Bayesian_Frameworks","228569078_Positioning_accuracy_and_multi-target_separation_with_a_human_tracking_system_using_near_field_imaging","224136059_Correlated_Probabilistic_Trajectories_for_Pedestrian_Motion_Detection","313550520_Motion_texture_A_two-level_statistical_model_for_character_motion_synthesis","261422389_A_Vision-Based_Real_time_Motion_Synthesis_System","254198346_Learning_Bayesian_Network_Structures_by_searching_the_best_orderordering_with_genetic_algorithms","227992567_Elements_of_Information_Theory","223069707_Monocular_Perception_of_Biological_Motion_in_Johansson_Displays"]}