{"id":"287484835_The_relationship_between_Saudi_EFL_students'_writing_competence_L1_writing_proficiency_and_self-regulation","abstract":"This study investigated whether Saudi EFL students' writing competence was related to their Arabic writing proficiency. The study also examined the possible relationship between Saudi students' first language (Arabic) and second language (English) writing competence and their self-regulatory abilities. Participants included 35 college-level students majoring in English at Umm Al-Qura University. The participants wrote English and Arabic argumentative essays on the same topic during two separate sessions. In addition, participants filled out the Metacognitive Awareness Inventory (Schraw & Dennison, 1994) to provide information about their self-regulation abilities. The writing tasks were scored by a group of EFL university teachers using the ESL Composition Profile (Jacobs et al., 1981). The collected data were used to compare and contrast the participants' writing competence in Arabic and English. The data were also used to test the correlation between students' self-regulation abilities (their knowledge of cognition and regulation of cognition) and their overall writing competence in both languages. Data analysis revealed a strong correlation between participants' L1 (Arabic) writing proficiency and their L2 (English) writing competence. The study also revealed that Saudi students who scored high in L1/L2 writing had high self-regulation abilities.","authors":["Hashem Alsamadani"],"meta":["September 2010European Journal of Social Sciences 16(1):53-63"],"references":["265116092_Research_Paper_Writing_Strategies_of_Professional_Japanese_EFL_Writers_TESL_Canada_Journal_131_17-27","260354366_Reading-Writing_Relationships_in_First_and_Second_Language","248545446_Explanatory_variables_for_Japanese_students'_expository_writing_in_English_An_exploratory_study","233058221_Changes_in_readers'_and_writers'_metacognitive_knowledge_Some_observations","222685368_Understanding_changes_in_elementary_Mandarin_students'_L1_and_L2_writing"]}