{"id":"287440454_Machine_translation_Its_scope_and_limits","abstract":"Machine Translation is the author's comprehensive view of machine translation (MT) from the perspective of a participant in its history and development. The text considers MT as a fundamental part of Artificial Intelligence and the ultimate test-bed for all computational linguistics, covering historical and contemporary systems in Europe, the US and Japan. The author describes and contrasts a range of approaches to MT's challenges and problems, and shows the evolution of conflicting approaches to MT towards some kind of skeptical consensus on future progress. The volume includes historic papers, updated with commentaries detailing their significance both at the time of their writing and now. The book concludes with a discussion of the most recent developments in the field and prospects for the future, which have been much changed by the arrival of the World Wide Web. Anyone interested in the progress of science and technology, particularly computer scientists and students, will find this a fascinating exploration of MT technology. Yorick Wilks is a Professor of Computer Science at the University of Sheffield, where he directs the Institute for Language, Speech and Hearing. He received his M.A. and Ph.D. (1968) from Pembroke College, Cambridge. He has also taught or researched at Stanford, Edinburgh, Geneva, Essex and New Mexico State Universities. His interests are artificial intelligence and the computer processing of language, knowledge and belief. He is a Fellow of the European and American Societies for Artificial Intelligence, a Fellow of the EPSRC College of Computing and a member of the UK Computing Research Council. Wilks was awarded the Antonio Zampolli prize by the European Language Resources Association in 2008. This prize is given to individuals whose work lies within the areas of Language Resources and Language Technology Evaluation with acknowledged contributions to their advancements. He was also the recipient of an ACL Life Achievement Award at the 46th Annual Meeting of the Association for Computational Linguistics in 2008. © Springer Science+Business Media LLC 2009. All rights reserved.","authors":["Yorick Wilks"],"meta":["January 2009","DOI:10.1007/978-0-387-72774-5"],"references":["221101644_Constraint_Grammar_As_A_Framework_For_Parsing_Running_Text","220605124_CYC_A_midterm_report","220426292_An_Intelligent_Analyzer_and_Understander_of_English","220355264_EUROTRA_a_multilingual_system_under_development","267838994_An_Experiment_in_Evaluating_the_Quality_of_Translations","246559569_Isomorphic_grammars_and_their_use_in_the_ROSETTA_translation_system''in_M","242439023_The_use_of_machine-readable_dictionaries_in_sublanguage_analysis","239540646_Constructing_contextually_organized_lexical_semantic_knowledge-bases","234773054_Extracting_Semantic_Hierarchies_from_a_Large_On-line_Dictionary","230876164_Semantic_Axiom_Number_One","226995716_Symmetric_rules_for_translation_of_English_and_Chinese","226525892_The_psychological_reality_of_word_senses","225315537_Form_and_Content_in_Semantics","222536342_Natural_language_information_retrieval_Progress_report","221486691_Bilingual_corpus_cleaning_focusing_on_translation_literality","220662622_The_Present_Status_of_Automatic_Translation_of_Languages","220419073_The_Proper_Place_of_Men_and_Machines_in_Language_Translation","220418911_Semantic_analysis_in_XTRA_an_English_-_Chinese_machine_translation_system","30868047_An_Overview_of_KRL_a_Knowledge_Representation_Language"]}