{"id":"287410662_English_Presentation_Skills_of_Thai_Graduate_Students","abstract":"This study addresses the English Presentation skills of graduate students and explores the ways to improve their skills. A cross-sectional research survey study was conducted among 26 students of the Master of Arts Program in English for Careers at Thammasat University, Thailand. The results showed that there are some statistically significant difference between English presentation skills of the students who studied Effective Presentations (the CR 752 students) and those who did not (the non-CR 752 students). The respondents suggested that the CR 752 students should improve their delivery most, while the non-CR 752 students should improve their organization/content and delivery most. It can be concluded from the findings that Effective Presentations (CR 752) should be a required course for all graduates studying in the Master Program in English for Careers. Students who take this course will develop their presentation skills which are viewed as professional competence required by employers. The respondents also thought that other graduate programs should also provide Effective Presentations course for their students.","authors":["Thitibhada Sukitkanaporn","Supakorn Phoocharoensil"],"meta":["February 2014English Language Teaching 7(3):91-102","DOI:10.5539/elt.v7n3p91"],"references":["314709883_Powerpoint_and_Pedagogy_Maintaining_Student_Interest_in_University_Lectures","313188789_Motivating_students_through_awareness_of_the_natural_correlation_between_college_learning_and_corporate_work_settings","291888021_Knowledge_Flows_within_Multinational_Corporations","286347401_An_examination_of_practitioners'_and_academicians'_views_on_the_content_of_the_accounting_curriculum","286042743_Teaching_English_as_a_Global_Language_in_Smart_Classrooms_with_PowerPoint_Presentation","285987394_Project_knowledge_management_A_cross-cultural_perspective","284558391_Interpersonal_Communication_in_the_Workplace_A_Largely_Unexplored_Region","279609153_Coding_Distinctions_and_Repetition_Effects_in_Memory","279417360_Powerpoint_Pedagogy","275636058_Writing_in_the_Real_World_Making_the_Transition_from_School_to_Work"]}