{"id":"287427505_An_Investigation_of_Distance_Education_in_North_American_Research_Literature_Using_Co-word_Analysis","abstract":"The field of distance education is composed of a multiplicity of topics leading to a vast array of research literature. However, the research does not provide a chronological picture of the topics it addresses, making it difficult to develop an overview of the evolution and trends in the literature. To address this issue, a co-word analysis was performed on the abstracts of research articles found in two prominent North American research journals (N = 517), the American Journal of Distance Education and the Journal of Distance Education, between 1987 and 2005. The analysis yielded underlying trends and themes for three different periods (pre-Web, emerging Web, and maturing Web). Additionally, similarity index analyses were conducted across time periods. The pre-Web era was characterized by the need for quality and development. The emerging Web era was characterized by the development of theory. The maturing Web era was characterized by interaction and the use of tools for communication. The results demonstrate that the North American distance education research literature is characterized by having few consistent and focused lines of inquiry. Conclusions are provided.","authors":["Albert D. Ritzhaupt","Michelle Stewart","Patryce Smith","Ann E. Barron"],"meta":["March 2010International Review of Research in Open and Distance Learning 11(1):37-60","DOI:10.19173/irrodl.v11i1.763"],"references":["285632015_Recommendations_for_creating_and_maintaining_effective_networked_learning_communities_A_review_of_the_literature","277434382_The_Foundations_of_Distance_Education","275998310_Mapping_the_Dynamics_of_Science_and_Technology_Sociology_of_Science_in_the_Real_World","272176868_Finding_Groups_in_Data_An_Introduction_to_Cluster_Analysis","269858127_Distance_Education_The_Foundations_of_Effective_Practice","262487609_Toward_a_Theory_of_Independent_Learning_and_Teaching","257033737_Mapping_the_Dynamics_of_Science_and_Technology","253034556_An_Exploration_of_Themes_and_Trends_in_Information-Related_Education_Using_Computer-Aided_Content_Analysis","249722020_Creativity_and_Conformity_in_Science_Titles_Keywords_and_Co-word_Analysis","248940746_Trends_in_research_and_practice_An_examination_of_the_American_journal_of_distance_education_1987_to_1995"]}