{"id":"287405371_Society_of_things_An_alternative_vision_of_Internet_of_things","abstract":"The purpose of this paper is to yield insight into the nature of relations between things within the Internet of things (IoT) paradigm and to build the principles that can potentially be used for progressing from IoT into communities of things (CoT). This study engages in rhetorical analysis—a qualitative research technique designed to yield non-quantitative data and to build a strong theoretical foundation for future studies in the field of IoT. It reveals that things can be perceived as beings within the communication networks; IoT can be organized into CoT; and various models of communities can be generated depending on desired outcomes. The findings require empirical implementation of the proposed principles for creating CoT. The direction indicated in this study will help solve a number of technical challenges that IoT faces nowadays, from architecture and communication to privacy and security. Viewing things as beings will encourage a wide-ranging discussion of the applications of social science theories to IoT. This study is a call for building bridges between the social sciences and information technology.","authors":["Gulnara Karimova","Amir Shirkhanbeik","Claudia Alvares"],"meta":["December 2015Cogent Social Sciences 1(1):1115654","DOI:10.1080/23311886.2015.1115654"],"references":["275544448_From_the_Sociology_of_Things_to_the_Internet_of_Things","247932817_The_Myth_of_the_Madding_Crowd","228315437_Virtual_Internet_Communities_and_Commercial_Success_Individual_and_Community-Level_Theory_Grounded_in_the_Atypical_Case_of_TimeZonecom","222571757_The_Internet_of_Things_A_Survey","317836852_The_Sociology_of_Community_Connections","313555162_Power_and_resources_in_an_organizational_community","267454881_The_Internet_of_Things_vision_Key_features_applications_and_open_issues","266498029_The_Different_Drum_Community_Making_and_Peace","232545384_Rediscovering_the_Social_Group_A_Self-Categorization_Theory","31692375_Group_psychology_and_the_analysis_of_the_ego_S_Freud_introd_de_F_Alexander_tr_por_James_Strachey"]}