{"id":"287598642_EFL_learners'_use_of_blogging_for_developing_writing_skills_and_enhancing_attitudes_towards_English_learning_An_exploratory_study","abstract":"Weblog - personal online, web-based publications - are being extensively used on the Internet of late, and research tapping in their significance and effectiveness is growing by leaps and bounds. This study examined the use of a blog in an intermediate level EFL college writing class and its effect upon students as well as its effect on developing positive attitudes towards writing compared with oral presentation traditions of writing instruction. The researcher employed a triangulated research approach, involving an experimental research method and a descriptive research design to examine these effects of blogging on writing proficiency and attitudes. Fourth-year students of the English Department (n = 25 for the experimental group, and 25 for the control group), College of Languages and Translation, King Khalid University in Abha, enrolled in the English 217 (Writing IV) class during the Second Semester 2010 and their instructor comprised subjects for this investigation. The findings indicated that the students perceived Weblog as a tool for the development of their English, in terms of their writing proficiency and attitudes towards writing. The students also viewed Weblog as giving an opportunity and freedom for self-expression in English, writing for both a local and global audience, creating active, interactive social exchanges in blogs, and maintaining an interactive relationship with a real time readership. Overall, students have had positive attitudes towards Weblog use. These findings suggest that Weblogs can provide learning motivation and opportunities for authorship and readership, as well as the development of writing skills in college writing syllabi.","authors":["Abdelaziz Fageeh"],"meta":["February 2011Journal of Language and Literature 2(1):31-48"],"references":["233232396_The_Role_of_Asynchronous_Computer_Mediated_Communication_on_Enhancing_Cultural_Awareness","279549373_The_impact_of_power_distance_on_email_acceptance_Evidence_from_the_PRC","229974018_Reform_in_statistical_education","229349658_Reconsidering_usage_of_blogging_in_preservice_teacher_education_courses","222654834_Datagogies_Writing_Spaces_and_the_Age_of_Peer_Production","215795740_Undergraduates'_metacognitive_knowledge_about_the_psychological_effects_of_different_kinds_of_computer-supported_instructional_tools","8050261_The_Potential_Use_of_Blogs_in_Nursing_Education","7336579_Podcasting_and_MP3_Players_Emerging_Education_Technologies"]}