{"id":"287512822_Normalization_of_Mendeley_reader_counts_for_impact_assessment","abstract":"A different number of citations can be expected for publications appearing in different subject categories and publication years. For this reason, the citation-based normalized indicator Mean Normalized Citation Score (MNCS) is used in bibliometrics. Mendeley is one of the most important sources of altmetrics data. Mendeley reader counts reflect the impact of publications in terms of readership. Since a significant influence of publication year and discipline has also been observed in the case of Mendeley reader counts, reader impact should not be estimated without normalization. In this study, all articles and reviews of the Web of Science core collection with a publication year of 2012 (and a DOI) are used to normalize their Mendeley reader counts. A new indicator that determines the normalized reader impact is obtained –the Mean Normalized Reader Score (MNRS) – and compared with the MNCS. The MNRS enables us to compare the impact a paper has had on Mendeley across subject categories and publication years. Comparisons on the journal and university level show that the MNRS and MNCS correlate larger for 9601 journals than for 76 German universities.","authors":["Robin Haunschild","Lutz Bornmann"],"meta":["February 2016Journal of Informetrics 10(1):62-73","DOI:10.1016/j.joi.2015.11.003"],"references":["317300557_The_Metric_Tide_Report_of_the_Independent_Review_of_the_Role_of_Metrics_in_Research_Assessment_and_Management","279402178_The_Metric_Tide_Report_of_the_Independent_Review_of_the_Role_of_Metrics_in_Research_Assessment_and_Management","275670007_Networks_of_reader_and_country_status_An_analysis_of_Mendeley_reader_statistics","273955648_Characterizing_Social_Media_Metrics_of_Scholarly_Papers_The_Effect_of_Document_Properties_and_Collaboration_Patterns","271919328_Using_altmetrics_for_assessing_research_impact_in_the_humanities","353636403_A_Look_at_Altmetrics_and_Its_Growing_Significance_to_Research_Libraries","321877961_Citation_Analysis_in_Research_Evaluation","285867517_Altmetrics","282924761_National_research_impact_indicators_from_Mendeley_readers","271140592_Field-normalized_citation_impact_indicators_and_the_choice_of_an_appropriate_counting_method"]}