{"id":"287533978_Development_of_the_online_student_attendance_monitoring_system_SAMS_based_on_QR-codes_and_mobile_devices","abstract":"This paper thus outlines the development of an online student attendance monitoring system (named SAMSTM) based on QR codes and mobile devices. This design was chosen due to its simplicity and cost-effectiveness. The only equipment required by the user (lecturers and students) is a mobile internet device such as a tablet computer or a smartphone. This is deemed reasonable due to the wide availability and high ownership of such devices today. The system is currently in an early prototyping phase to show a working proof of its concept. This paper describes the overall architecture as well as the flow of its implementation in the class room. The method of surveying the effectiveness and user feedback of the system is also discussed. The main advantage of the system is a more accurate and quicker method of recording and monitoring student attendance. With this system, it will be quantitatively easier to discern the students based on their diligence in attending classes, and thus also predict their performance due to the correlation between attendance and academic performance. We found positive feedback for the system in the design phase with some parties interested in commercialization. This encouragement motivates the deployment of the system in a number of trials which will be useful for further development and wider application.","authors":["Ashrani Aizzuddin Abd. Rahni","Nasharuddin Zainal","M.F. Zainal Adna","N.E. Othman"],"meta":["May 2015"],"references":["326493967_Biometric-based_Attendance_System_LASU_Epe_Campus_as_Case_Study","315706580_Development_of_a_Radio_Frequency_Identification_Based_Attendance_Management_Application_With_A_Pictorial_Database_Framework","283667043_Integrated_System_for_Monitoring_and_Recognizing_Students_During_Class_Session","271603278_Should_we_bother_improving_students'_attendance_at_seminars","266173812_Why_do_Students_still_Bother_Coming_to_Lectures_When_Everything_is_Available_Online","262698726_Speech_biometric_based_attendance_system","229586131_The_Relationship_Between_Undergraduate_Attendance_and_Performance_Revisited_Alignment_of_Student_and_Instructor_Goals","355482504_Benefits_of_Using_Tested_Attendance_System_to_Enhance_Student_Attendance_and_Achievement_in_Higher_Education_Article_Info","272662367_Examining_Factors_Affecting_Classroom_Attendance_and_Performance","228751698_Hyke_A_Low-cost_Remote_Attendance_Tracking_System_for_Developing_Regions"]}