{"id":"287534256_Intelligent_guidance_parking_system_using_modified_dijkstra's_algorithm","abstract":"Parking system is one of the main important facilities that should have in any infrastructure or building especially for the place of interest and place of people’s attraction. The best parking system is the system that provides customers the ease of finding the available spaces, user friendly and less time consuming. This paper presents the intelligent parking system which apply Dijkstra’s algorithm in finding the shortest path. The proposed intelligent parking guidance system is a system that assigns the nearest vacant bay to drivers with necessary direction printed on the ticket so that drivers are able to find the 'best' lot with the minimum amount of time. The system will automatically check for the nearest empty lot and reserve the lot for the user so that the next user will not get the same lot again. Software and hardware implementations have been carried out. Few electronic components such as PICs, IR sensors, push buttons, LEDs, LCDs, counters, comparators, and servo motors have been used to realize the system. Personal computer and DAQ cards are used to communicate and interface with the monitor to display the GUI which has been developed using Lab View. It will also present the real time simulation of the parking system and validate any information regarding the parking status.","authors":["Haslina Jaafar","M.H. Zabidi","Azura che soh","T.P. Hoong"],"meta":["October 2014"],"references":["256453165_Algorithm_for_shortest_path_search_in_Geographic_Information_Systems_by_using_reduced_graphs","224694489_Design_considerations_for_a_wireless_sensor_network_for_locating_parking_spaces","220830632_SIAPAS_A_Case_Study_on_the_Use_of_a_GPS-Based_Parking_System","4347655_PGS_Parking_Guidance_System_based_on_wireless_sensor_network","290262868_Applied_research_on_improved_Dijkstra_algorithm_to_the_optimal_vehicle_path_selection_in_emergency_command","262354975_A_Dijkstra's_algorithm_shortest_path_assignment_using_the_Google_Maps_API_poster_session","261424949_A_model_of_software_system_for_parking_using_search_algorithms","261351608_Intelligent_Parking_System_for_Car_Parking_Guidance_and_Damage_Notification","251932918_Design_of_Parking_Guidance_System_based_on_Embedded_Internet_Access_Technology","247442902_Introduction_To_Algorithms","242562037_A_Note_on_Two_Problems_in_Connexion_with_Graphs"]}