{"id":"287541526_Language_typology_and_syntactic_description_Second_edition_Volume_II_Complex_constructions","abstract":"This unique three-volume 2007 survey brings together a team of leading scholars to explore the syntactic and morphological structures of the world's languages. Clearly organized and broad-ranging, it covers topics such as parts-of-speech, passives, complementation, relative clauses, adverbial clauses, inflectional morphology, tense, aspect, mood, and diexis. The contributors look at the major ways that these notions are realized, and provide informative sketches of them at work in a range of languages. Each volume is accessibly written and clearly explains each new concept introduced. Although the volumes can be read independently, together they provide an indispensable reference work for all linguists and fieldworkers interested in cross-linguistic generalizations. Most of the chapters in the second edition are substantially revised or completely new - some on topics not covered by the first edition. Volume II covers co-ordination, complementation, noun phrase structure, relative clauses, adverbial clauses, discourse structure, and sentences as combinations of clauses. © Cambridge University Press 2007 and Cambridge University Press, 2010.","authors":["T. Shopen"],"meta":["January 2007","DOI:10.1017/CBO9780511619434"],"references":["245019134_A_Quantitative_Perspective_on_the_Grammaticization_of_Epistemic_Parentheticals_in_English","241321311_The_Noun_Phrase_Accessibility_Hierarchy_Reinterpreted_Subject_Primacy_or_the_Absolutive_Hypothesis","230876457_The_Relevance_of_Repair_to_Syntax-for-Conversation","303837236_Negation_in_English","292703095_Chuave_medial_verbs","290126952_Syntactic_amalgams","277370895_Agreement_Controllers_and_Tzotzil_Comitatives","271784012_Constraints_on_the_Distribution_of_NP_Clauses","271783909_Conjunction_Reduction_Gapping_and_Right-Node_Raising","271213504_Givenness_Contrastiveness_Definiteness_Subjects_Topics_and_Point_of_View","249110752_Trique_Clause_and_Sentence_A_Study_in_Contrast_Variation_and_Distribution","248457278_Western_Bukidnon_Manobo_sentence_structure","247663444_Studies_in_irreversible_binomials"]}