{"id":"287502584_L'envol_vers_le_Cloud_un_phenomene_de_maturations_multiples","abstract":"Cloud Computing is more and more described as the new paradigm of modern computing. In this article, our goal is to understand the mechanisms that lead to the decision to implement a cloud computing solution in organizations. This research adopts a qualitative methodology, based on the analysis of open and semi-structured interviews with people directly involved in the decision process of Cloud Computing implementation. Various trades and sectors are represented, amongst others we interviewed people working in consulting firms, software publishing companies and inside IT management departments of several businesses (which vary in size). This paper has several main contributions. First, the core category that emerged is the concept of multiple maturations. This multiple-maturation concept is seen as a process leading (or not) to an implementation decision. Second, this maturation process emerged at four different levels, as is evidenced by the identification of four different types of maturity : the organizational maturity, the security maturity, the maturity of the cloud solution, and the maturity of the legal environment. Third, our data also suggests that the decision to implement Cloud Computing at the organizational level is related to a broader pressure of the competitive environment and a pressure from users through the consumerization phenomenon. These contributions enrich the existing literature by emphasizing the fact that maturations are multiple and have their own configurations.","authors":["Grégoire Tiers","Gaetan Mourmant","Aurelie Leclercq-Vandelannoitte"],"meta":["January 2013Systèmes d'Information et Management 18(4):7","DOI:10.3917/sim.134.0007"],"references":["314912183_The_'Third_Hand'_IT-Enabled_Competitive_Advantage_in_Turbulence_Through_Improvisational_Capabilities","313394771_Preparing_for_the_Future_Understanding_the_Seven_Capabilities_of_Cloud_Computing","312985464_Building_theories_from_case_study_research","312984568_Perceived_usefulness_perceived_ease_and_user_acceptance_of_information_technology","309546996_If_We_Build_It_They_Will_Come_Designing_Information_Systems_That_People_Want_to_Use","304620857_Above_the_clouds_A_berkeley_view_of_cloud_computing","293431811_What_every_CEO_needs_to_know_about_the_cloud","291775790_Moving_to_the_Cloud_Corporation_How_to_face_the_challenges_and_harness_the_potential_of_cloud_computing","286274120_Fundamentals_of_qualitative_data_analysis","282064682_Options_in_inter-organizational_systems_integration","267027138_Analysis_of_Dissatisfiers_That_Inhibit_Cloud_Computing_Adoption_Across_Multiple_Customer_Segments","265307973_On_An_Ontological_View_Of_Cloud_Computing","277632894_Defining_a_Set_of_Metrics_to_Evaluate_the_Potential_Disruptiveness_of_a_Technology","263462006_Computing_in_the_Cloud","262775137_Why_end-users_move_to_the_cloud_A_migration-theoretic_analysis"]}