{"id":"287691678_Personalized_web_search_methods_-_A_complete_review","abstract":"Internet's foremost information retrieval service is the World Wide Web. It serves as a platform for retrieving variety of information that are associated with research, education, marketing, sports, games, politics, Finance, etc. The utter volume of information growth leads to the information overload on the Internet. Search engines are the collection of programs that facilitates information retrieval from the Internet. Even though the search engines do a good job of retrieving content from the Internet, users often feel disoriented about the result retrieved. Hence, no matter who the user of the search engine is, if the same query is provided as input to the search engine, the results returned will be exactly the same. The need to provide users with information tailored to their needs led to the development of various information personalization techniques. Personalization aims to provide users with what they need either by asking explicitly or implicitly. Web Personalization is conventionally defined as the process of tailoring web pages to satisfy the individual user needs by adapting different approaches. Several personalized web search models were developed based on web link structure, web contents, user queries, user profiles, browsing history etc. A Personalized Web Search has various levels of effectiveness for different users, queries, contexts etc. Personalized search has been a most important research area and many techniques have been developed and tested, still many issues and challenges are yet to be explored. This paper concentrates on the analysis, comparison and application of many personalized web search approaches that are being widely used today.Hence the motivation of this survey is directed towards to understand the web personalization processes, benefits, limitations and future trends.","authors":["J. Jayanthi","Sandeep Rathi"],"meta":["April 2014Journal of Theoretical and Applied Information Technology 62(3):685-697"],"references":["252199244_Fuzzy_Linguistic_Query-based_User_Profile_Learning_by_Multiobjective_Genetic_Algorithms","221023784_CubeSVD_A_novel_approach_to_personalized_Web_search","221021989_Adaptive_Web_search_based_on_user_profile_constructed_without_any_effort_from_users","220465604_Criteria_for_Cluster-Based_Personalized_Search","220072990_Evaluating_the_Effectiveness_of_Personalized_Web_Search","3297248_Personalized_Web_Search_For_Improving_Retrieval_Effectiveness","3297239_Domain-Specific_Web_Search_with_Keyword_Spices","2939563_A_Hybrid_Web_Personalization_Model_Based_on_Site_Connectivity","2487502_Discovery_and_Evaluation_of_Aggregate_Usage_Profiles_for_Web_Personalization","276240325_Personalized_Web_Search_Using_Clickthrough_Data_and_Web_Page_Rating","260230257_Accessibility_of_Information_on_the_Web","229622623_Machine_Literature_Searching_VIII_Operational_Criteria_for_Designing_Information_Retrieval_Systems","221509090_Dynamic_Adaptation_Strategies_for_Long-Term_and_Short-Term_User_Profile_to_Personalize_Search","221466831_Web_Search_Personalization_Via_Social_Bookmarking_and_Tagging","220814067_Mining_User_Dwell_Time_for_Personalized_Web_Search_Re-Ranking","220211626_Preserving_user's_privacy_in_web_search_engines"]}