{"id":"287644170_An_Automated_Approach_for_Assisting_the_Design_of_Configurable_Process_Models","abstract":"With the intention of design by reuse, configurable process models provide a way to model variability in reference models that need to be configured according to specific needs. The design of configurable process models is a well known complex and error-prone task. Thus, many approaches have been proposed to automate their design by merging existing process models into configurable reference models. However, the complexity introduced by such approaches remains an open issue. The designer ends up with one model that integrates a family of process variants making the process design and update a complex task. In this work, we propose to assist the design of config-urable process models with configurable process fragments. Concretely, we present an algorithm for extracting, clustering and merging process fragments around a particular activity to construct a configurable fragment. The approach has been implemented as an extension of the Signavio Process Editor and evaluated against a large collection of process models. Experimental results show that our approach is efficient and produces comprehensible configurable fragments.","authors":["Nour Assy","Chan N. Nguyen","Walid Gaaloul"],"meta":["November 2015IEEE Transactions on Services Computing 8(6)","DOI:10.1109/TSC.2015.2477815"],"references":["288943912_Mining_Configurable_Process_Models_from_Collections_of_Event_Logs","271374732_WordNetSimilarity","261059264_Assisting_Business_Process_Design_with_Configurable_Process_Fragments","260390804_Increasing_Recall_of_Process_Model_Matching_by_Improved_Activity_Label_Matching","321617600_Data_Compression_The_Complete_Reference","305114055_Graph_matching_algorithms_for_business_process_model_similarity_search","284653201_An_efficient_method_applicable_to_the_search_for_similarities_in_the_amino_acid_sequences_of_two_proteins","280113549_Speech_and_Language_Processing","266030000_Assisting_Business_Process_Design_by_Activity_Neighborhood_Context_Matching","242563984_Introduction_to_Computational_Biology"]}