{"id":"287771630_HIV-1_subtype_characteristics_of_infected_persons_living_in_southwestern_Greece","abstract":"Background: \nThe rapid replication rate of HIV-1, coupled with a high mutation rate and recombination, is the underlying force driving its genetic diversity. In the infected individual, a population of highly related but nonidentical strains exists. At the population level, multiple subtypes often cocirculate, leading to the generation of intersubtype recombinant forms. As a result, the geographic distribution of subtypes and recombinant forms is complex and uneven. Genetic subtyping of HIV-1 isolates has been shown to be helpful for understanding the genetic evolution, the worldwide spread of the virus, and the evaluation of drug resistance.\n\nMaterials and methods: \nWe determined the genetic heterogeneity of HIV-1 group M in southwestern Greece. Protease and partial reverse-transcriptase sequences were generated from 150 HIV-1-infected individuals attending the Division of Infectious Diseases of Patras University Hospital, Greece, from 2006 to 2012, and analyzed using online subtyping tools and phylogenetic methods.\n\nResults: \nThe majority of the infected individuals were male (77%). HIV-1 subtype A1 was responsible for 51.3% of infections, followed by subtypes B (34%), G (4%), F1 (2%), and the circulating recombinant forms 02_AG (2.7%), 14_BG (1.3%), 35_AD (1.3%), and 01_AE (0.7%). Additionally, we identified three cases with a recombinant B/CRF02_AG strain (2%) and one with a recombinant G/GRF_AG strain. Sexual transmission was responsible for 96.3% of cases. Heterosexual transmission was responsible for 70.2% of subtype-A1 infections, whereas subtype B was transmitted by men who have sex with men in 75.5% of cases. Protease substitutions I13V, E35D, M36I, R57K, H69K, and L89M, which serve as drug-resistance support mutations in subtype B, were present in the majority of subtype-A1 sequences of the population.\n\nConclusion: \nHIV-1 infection in southwestern Greece is sexually transmitted and highly heterogeneous. Subtype A1 has surpassed subtype B, and is the most prevalent strain. In the population studied, subtype A1 exhibited certain polymorphisms in the protease region, which may serve as drug-resistance support mutations in subtype B.","authors":["Nikolaos Davanos","George Panos","Charalambos A. Gogos","Mouzaki Athanasia"],"meta":["December 2015HIV/AIDS - Research and Palliative Care 7(Issue 1):277-283","DOI:10.2147/HIV.S90755","Project: HIV Medicine"],"references":["245065871_A_Simple_Method_for_Estimating_and_Testing_Minimum-Evolution_Trees","221895254_Comparative_analysis_of_drug_resistance_among_B_and_the_most_prevalent_Non-B_HIV_type_1_subtypes_C_F_and_CRF02_AG_in_Italy","215733471_HIV-1_Nomenclature_Proposal","51716237_Improved_Virological_Outcome_in_White_Patients_Infected_With_HIV-1_Non-B_Subtypes_Compared_to_Subtype_B","317316010_CONFIDENCE_LIMITS_ON_PHYLOGENIES_AN_APPROACH_USING_THE_BOOTSTRAP","286215327_The_Neighbor-Joining_Method_A_New_Method_for_Reconstructing_Phylogenetic_Trees","271205503_Molecular_Evolution_and_Phylogenetics","235950749_Confidence_Limits_on_Phylogenies_An_Approach_Using_the_Bootstrap","232159818_HIV-1_diversity_in_France_1996-1998","232007473_Effect_of_HIV-1_subtype_on_virological_and_immunological_response_to_cART_Evidence_for_a_more_rapid_viral_suppression_for_subtype_A_than_subtype_B_infected_Greek_individuals"]}