{"id":"287730157_Analysis_of_the_British_Columbia_Water_Quality_Index_for_Watershed_Managers_a_Case_Study_of_Two_Small_Watersheds","abstract":"The use of indices in ecosystem management is attractive because it allows for the representation of a complex set of information on ecosystem variables in a simple fashion. Recently the British Columbia Ministry of Environment, Lands and Parks developed the British Columbia Water Quality Index (BCWQI). As this index is currently being considered as the basis for other provincial indices and a national water quality index, the character of the BCWQI needs to be carefully considered. This study evaluates the performance of the BCWQI and assesses how useful and appropriate it is as a management tool at the watershed level. For this purpose the index is used to express the results of two sampling programs, one by the British Columbia Ministry of Environment, Lands and Parks, and the other by the Westwater Research Centre, of two relatively small watersheds in the Greater Vancouver area; the Brunette River watershed, heavily impacted by urbanization, and the Salmon River watershed on the urban-rural fringe. For both watersheds the intended use is the protection of aquatic life and only those water quality objectives are considered. The results indicate that the BCWQI is extremely sensitive to sampling design and highly dependent on the specific application of water quality objectives. A comparison is made with another type of index in widespread use in North America: the National Sanitation Foundation Water Quality Index (NSFWQI). This index appears promising for stream stewardship grounds because of its simplicity and ease of use. For watershed managers, an alternative to the BCWQI is suggested, based on exceedance factors for individual objectives. This Simple Water Quality Index (SWQI) recognizes the importance of objectives that are specific to a particular water body, but overcomes some of the limitations of the BCWQI. A presentation format is suggested for objective exceedance factors, with a clear indication of exactly which objectives were included - without this, the final numerical index value is meaningless. This study suggests that the BCWQI in its current form has serious limitations for comparing water bodies and for establishing management priorities. If local watershed managers use the BCWQI in guiding efforts to protect aquatic resources, they should consider these limitations carefully.","authors":["Paul A. Zandbergen","Ken J. Hall"],"meta":["November 1998Water Quality Research Journal of Canada 33(4):519-549","DOI:10.2166/wqrj.1998.030"],"references":["293767320_Development_Needs_for_Canada's_National_Water_Quality_Guidelines","279565404_Hydrocarbon_Pollution_in_the_Brunette_River_Watershed"]}