{"id":"287717013_Lessons_Learned_Through_Massive_Open_Online_Courses","abstract":"Despite being a relatively modern educational phenomenon, massive open online courses (MOOCs) are garnering considerable attention in the media, with universities in particular paying heed to these courses because of the opportunity they present.\nBroadly speaking, MOOCs are an extension of current long-distance learning courses, and pave the way for new business models that include elements of open education, separating the concepts of teaching and assessment.\nKey considerations for the deployment of a MOOC at an educational institution are the course’s value proposition, the implementation of an adequate technological platform, the choice of a teaching model to ensure learning, care in maintaining the quality of the course material, recognition of learning acquired by students, and a sustainable business model.\nThe proliferation of courses run by prestigious institutions offering high-quality open learning material is giving rise to the “universalisation” of knowledge; a scenario in which institutions with lesser repute will increasingly encounter difficulties to compete. Granting students a pivotal role in the education process, and welcoming their influence on the design and orientation of course contents as well as the way educators adapt learning approaches, may represent a valid strategy in the quest for differentiation in a highly competitive environment.","authors":["Monica Lopez Sieben","Marta Peris-Ortiz","Jaime Alonso Gómez"],"meta":["February 2014","DOI:10.1007/978-3-319-04825-3_2"],"references":["265297666_MOOCs_and_Open_Education_Implications_for_Higher_Education","44075539_Models_for_Sustainable_Open_Educational_Resources","265183154_Common_Wisdom_Peer_Production_of_Educational_Materials","262395700_Are_the_Costs_of_'Free'_Too_High_in_Online_Education","262389882_Evaluating_a_Startup_Venture","262273580_Reflections_on_Stanford's_MOOCs","253151485_What_Makes_an_Open_Education_Program_Sustainable_The_Case_of_Connexions","31771138_The_Wealth_of_Networks_How_Social_Production_Transforms_Markets_and_Freedom_Y_Benkler"]}