{"id":"287853877_A_Polynomial-Time_Approximation_Scheme_for_The_Airplane_Refueling_Problem","abstract":"We study the airplane refueling problem which was introduced by the\nphysicists Gamow and Stern in their classical book Puzzle-Math (1958). Sticking\nto the original story behind this problem, suppose we have to deliver a bomb in\nsome distant point of the globe, the distance being much greater than the range\nof any individual airplane at our disposal. Therefore, the only feasible option\nto carry out this mission is to better utilize our fleet via mid-air refueling.\nStarting with several airplanes that can refuel one another, and gradually drop\nout of the flight until the single plane carrying the bomb reaches the target,\nhow would you plan the refueling policy?\nThe main contribution of Gamow and Stern was to provide a complete\ncharacterization of the optimal refueling policy for the special case of\nidentical airplanes. In spite of their elegant and easy-to-analyze solution,\nthe computational complexity of the general airplane refueling problem, with\narbitrary tank volumes and consumption rates, has remained widely open ever\nsince, as recently pointed out by Woeginger (Open Problems in Scheduling,\nDagstuhl 2010, page 24). To our knowledge, other than a logarithmic\napproximation, which can be attributed to folklore, it is not entirely obvious\neven if constant-factor performance guarantees are within reach.\nIn this paper, we propose a polynomial-time approximation scheme for the\nairplane refueling problem in its utmost generality. Our approach builds on a\nnovel combination of ideas related to parametric pruning, efficient guessing\ntricks, reductions to well-structured instances of generalized assignment, and\nadditional insight into how LP-rounding algorithms in this context actually\nwork. We complement this result by presenting a fast and easy-to-implement\nalgorithm that approximates the optimal refueling policy to within a constant\nfactor.","authors":["Iftah Gamzu","Danny Segev"],"meta":["February 2019Journal of Scheduling 22(5)","DOI:10.1007/s10951-018-0569-x","SourcearXiv","Project: A Polynomial-Time Approximation Scheme for The Airplane Refueling Problem"],"references":["346355345_Non-preemptive_buffer_management_for_latency_sensitive_packets","311586086_A_Primal-Dual_Approximation_Algorithm_for_Min-Sum_Single-Machine_Scheduling_Problems","262403418_Dual_Techniques_for_Scheduling_on_a_Machine_with_Varying_Speed","323156322_The_Pure_Theory_of_Elevators","311864933_A_New_Approach_to_Online_Scheduling_Approximating_the_Optimal_Competitive_Ratio","279719249_Epistemic_Logic_and_Information_Update","276194867_The_Generalised_Gamow-Stern_Problem","262327365_Cake_Cutting_Not_Just_Child's_Play","260604849_How_Unsplittable-Flow-Covering_Helps_Scheduling_with_Job-Dependent_Cost_Functions","249645479_Polynomial_time_approximation_schemes_for_the_traveling_repairman_and_other_minimum_latency_problems"]}