{"id":"287967265_Nonrepetitive_and_pattern-free_colorings_of_the_plane","abstract":"A classic result of Thue states that using 3 symbols one can construct an infinite nonrepetitive sequence, that is, a sequence without two identical adjacent blocks. In this paper, we present Thue-type results concerning coloring of the Euclidean plane, related to the famous Hadwiger–Nelson problem. This old problem asks for the chromatic number of the unit distance graph of the plane, the infinite graph with the set of vertices of R2 and edges between points at distance 1.\nWe solve a problem posed by Grytczuk (2008) by showing that any coloring of the unit distance graph of R2 in which the sequence of colors of every simple path is nonrepetitive needs more than countable number of colors. Grytczuk, Kosiński and Zmarz (2016) introduced a relaxation of this problem, by restricting the nonrepetitiveness condition to a certain class of paths. Let a path in the unit distance graph of R2 be called line path if it consists of collinear points. A coloring of R2 is line nonrepetitive if the sequence of colors on every line path is nonrepetitive. We present a line nonrepetitive 18-coloring of R2, which improves the result of Grytczuk, Kosiński and Zmarz with 36 colors. Furthermore, we construct a line nonrepetitive coloring, which additionally avoids palindromes and uses 32 colors.\nWe also consider a natural generalization of this problem to other patterns. We say that a pattern q (finite sequence over a set of variables E) occurs in a sequence w (over an alphabet A) if there exists a substitution f from E to the set of nonempty sequences over A such that f(q) is a block in w. A sequence wavoids a pattern q if q does not occur in w. For a pattern q, a coloring of R2 is called line p-free if the sequence of colors on every line path avoids q. We present a 9-coloring of R2 which is line ααα-free and line αβαβ-free at once. Moreover, we give a non-constructive result for a class of patterns. Namely, let q be a pattern with no variable occurring exactly once or satisfying ℓ⩾2d, where ℓ is the length of q and d is the number of variables in q. Then there exists a line q-free coloring of R2 using a finite number of colors. In fact, this result holds even if (instead of taking into account only line paths) we consider all sequences of points in R2 with consecutive distances in some fixed interval [a,b] and without any pair of vertices at distance smaller than a fixed ε>0.","authors":["Przemysław Wenus","Krzysztof Węsek"],"meta":["May 2016European Journal of Combinatorics 54:21-34","DOI:10.1016/j.ejc.2015.12.002"],"references":["279069689_Nonrepetitive_colorings_of_line_arrangements","257641482_On_the_Chromatic_Numbers_of_R2R2_and_R3R3_with_Intervals_of_Forbidden_Distances","251256338_-Unit_Distance_Graphs","239060289_Uber_die_gegenseitige_Lage_gleicher_Teile_gewisser_Zeichenreihen","227786622_Nonrepetitive_Colorings_of_Graphs","226125073_Chromatic_Number_of_the_Plane_Its_Relatives_History_Problems_and_Results_An_Essay_in_11_Parts","223807745_Non-repetitive_colorings_of_infinite_sets","223411008_Pattern_avoidance_on_graphs","222765630_Thue_type_problems_for_graphs","222668281_The_origins_of_combinatorics_on_words","222519954_Repetitions_in_strings_Algorithms_and_combinatorics","220152037_Multidimensional_Unrepetitive_Configurations","220151487_Last_cases_of_Dejean's_conjecture","45850306_A_proof_of_Dejean's_conjecture"]}