{"id":"287998154_Time_sensitive_blog_retrieval_using_temporal_properties_of_queries","abstract":"Blogs are one of the main user-generated contents on the web and are growing in number rapidly. The characteristics of blogs require the development of specialized search methods which are tuned for the blogosphere. In this paper, we focus on blog retrieval, which aims at ranking blogs with respect to their recurrent relevance to a user’s topic. Although different blog retrieval algorithms have already been proposed, few of them have considered temporal properties of the input queries. Therefore, we propose an efficient\napproach to improving relevant blog retrieval using temporal property of queries. First, time sensitivity of each query is automatically computed for different time intervals based on an initially retrieved set of relevant posts. Then a temporal score is calculated for each blog and finally all blogs are ranked based on their temporal and content relevancy with regard to the input query. Experimental analysis and comparison of the proposed method are carried out using a standard dataset with 45 diverse queries.\nOur experimental results demonstrate that, using different measurement criteria, our proposed method outperforms other blog retrieval methods.","authors":["Mohammad Sadegh Zahedi","Abolfazl Aleahmad","Maseud Rahgozar","Farhad Oroumchian"],"meta":["December 2015Journal of Information Science 43(1)","DOI:10.1177/0165551515618589"],"references":["290482914_Politics_in_weblogs_A_safe_space_for_protest","288059125_IrBlogs_A_standard_collection_for_studying_Persian_bloggers","269629028_Blog_Feed_Search_in_Persian_Blogosphere","326534844_Hamshahri_A_standard_Persian_text_collection","314819081_Time-based_language_models","294194650_Journal_of_the_American_Society_for_Information_Science_and_Technology_In_this_Issue","290546790_The_Blog_Ranking_Algorithm_Using_Analysis_of_Both_Blog_Influence_and_Characteristics_of_Blog_Posts","283229862_A_Topic-Oriented_Information_Retrieval_Algorithm_in_the_Blogosphere","278681757_Lecture_Notes_in_Electrical_Engineering","271630407_Identifying_top_news_stories_based_on_their_popularity_in_the_blogosphere"]}