{"id":"287938340_Critical_Thinking_in_Asynchronous_Online_Discussion_An_Investigation_of_Student_Facilitation_Techniques","abstract":"Background: In the last decade, asynchronous online discussion forums have become a primary focus of many educational researchers. Some advocates believed that the process of typing out messages in itself can promote in-depth critical thinking skills. Nevertheless, empirical research has not provided much support for this claim in natural settings. In fact, many previous studies have found that students do not necessary exhibit in-depth critical thinking in online discussions. Aims: To investigate the types of facilitation techniques exhibited by student facilitators, and how these techniques might influence in-depth levels of critical thinking in asynchronous online discussion forums. Sample: Participants of the study were ten education major students at an Asia-Pacific university. Method: An exploratory qualitative case study methodology was employed. Data were collected from the students' online discussion postings and interviews. The top 30% of discussion forums in terms of the most number of in-depth critical thinking incidences were first identified. Next, the bottom 30% forums were identified as the lower-level critical thinking group. Results: In the case of the top 30% forums, showing appreciation, questioning, expressing agreements, and providing opinions or explanations were among the most prevalent facilitation techniques used, while in the case of the bottom 30% forums, the most common facilitation techniques merely included showing acknowledgement or appreciation and inviting feedback or comments. Conclusion: The findings suggest that student facilitators should perhaps focus on three facilitation techniques, specifically questioning, expressing agreements, and providing opinions or explanations to foster in-depth level of critical thinking. The findings also suggest that it may serve student facilitators well to employ a variety of facilitation techniques rather than just utilise a few preferred ones in order to achieve higher levels of critical thinking.","authors":["S.C.R. Lim","Wing Sum Cheung","Khe Foon Hew"],"meta":["May 2011New Horizons in Education 59(1):52-65"],"references":["288005150_In_search_of_the_Chinese_in_all_the_wrong_places","283924827_Evaluating_the_participation_and_quality_of_thinking_of_pre-service_teachers_in_an_asynchronous_online_discussion_environment_Part_1","317953648_Naturalistic_inquiry","317953471_Qualitative_Research_and_Case_Study_Applications_In_Education","281508182_Using_asynchronous_online_discussions_in_primary_school_project_work","279888402_Online_discussion_and_critical_thinking_skills_A_case_study_in_a_Singapore_secondary_school","275009210_Critical_Thinking_What_Every_Person_Needs_To_Survive_in_a_Changing_World","273313944_Naturalistic_Inquiry_Sage","272204632_Factors_Affecting_Learners'_Satisfaction_on_the_Use_of_Asynchronous_Online_Discussion_in_a_Hypermedia_Design_Environment","271625206_Research_to_Practice_Online"]}