{"id":"288019754_Utilizacion_del_conocimiento_tacito_por_proveedores_de_atencion_a_la_salud_materna_mapeo_sistematico_de_la_literatura","abstract":"Introducción: La búsqueda de respuestas eficaces para fortalecer la atención a la salud materna ha incluido diversas fuentes de evidencia para apoyar la toma de decisiones. En este trabajo presentamos un mapeo sistemático de la utilización del conocimiento tácito de los actores involucrados en la atención de la salud materna reportada en la literatura científica.\nMétodo: Mapeo sistemático de artículos científicos publicados en inglés y español entre 1971 y 2014 siguiendo las recomendaciones de Preferred Reporting Items for Systematic Reviews and Meta-analyses guidelines.\nResultados: Treinta de 793 artículos cumplen los criterios de inclusión. El 60% procede de países de ingresos altos y la población más estudiada fue el personal de salud (66,7%). Encontramos un predominio (62%) de metodologías cualitativas. Se generaron cuatro categorías sobre el uso del conocimiento tácito: propuestas para mejorar la organización del sistema de atención a la salud materna (30%), y la atención que se les brinda a lo largo del continuo de embarazo, parto y puerperio (26,7%); determinación de la percepción y el nivel de competencias profesionales del personal de salud (26.7%); e interacciones del conocimiento tácito y el conocimiento explícito en la toma de decisiones clínicas (16,7%).\nConclusiones: Este mapeo muestra que el conocimiento tácito es un enfoque de investigación emergente, innovador y versátil, con mayores avances en los países de ingresos altos, y que encierra interesantes posibilidades de utilización como evidencia para mejorar las intervenciones en salud materna, especialmente en los países de ingresos medios y bajos, donde se requiere fortalecerlo.","authors":["Emmanuel Calderón Espinosa","Víctor Becerril-Montekio","Jacqueline Elizabeth Alcalde-Rabanal","Luis García Bello"],"meta":["December 2015Gaceta Sanitaria 30(2)","DOI:10.1016/j.gaceta.2015.11.004"],"references":["313615274_Methods_of_systematic_reviews_and_meta-analysis_preferred_reporting_items_for_systematic_reviews_and_meta-analyses_the_PRISMA_statement","273413172_Accommodation_set_in_a_university_hospital_postpartum_depression_in_nurses'_perspective","272544917_Substance-misusing_women_Stigma_in_the_maternity_setting","262515605_Problemas_del_sistema_de_salud_en_estados_de_Mexico_con_alta_incidencia_de_mortalidad_materna","262475128_Mapeo_de_problemas_para_la_atencion_a_la_salud_materna_por_actores_estatales_y_federales","283724931_A_Dynamic_Theory_of_Organizational_Knowledge_Creation","283378930_The_Tacit_Dimension","279528330_Harvey_N_Holmes_C_2012_Nominal_group_technique_NGT_An_effective_method_of_obtaining_group_consensus_International_Journal_of_Nursing_Practice_182_188-194","272918333_Moher_D_Liberati_A_Tetzlaff_J_Altman_DG_Group_PPreferred_reporting_items_for_systematic_reviews_and_meta-analyses_the_PRISMA_statement_BMJ_339_b2535","272472227_Critical_incident_analysis_of_the_effect_of_self-efficacy_on_coping_strategies_in_labour"]}