{"id":"288081146_Doing_action_research_in_English_language_teaching_A_guide_for_practitioners","abstract":"This hands-on, practical guide for ESL/EFL teachers and teacher educators outlines, for those who are new to doing action research, what it is and how it works. Straightforward and reader friendly, it introduces the concepts and offers a step-by-step guide to going through an action research process, including illustrations drawn widely from international contexts. Specifically, the text addresses: Action research and how it differs from other forms of research. The steps involved in developing an action research project. Ways of developing a research focus. Methods of data collection. Approaches to data analysis. Making sense of action research for further classroom action. Each chapter includes a variety of pedagogical activities: Pre-Reading questions ask readers to consider what they already know about the topic. Reflection Points invite readers to think about/discuss what they have read. Action points ask readers to carry out action-research tasks based on what they have read. Classroom Voices illustrate aspects of action research from teachers internationally. Summary Points provide a synopsis of the main points in the chapter. Bringing the 'how-to' and the 'what' together, Doing Action Research in English Language Teaching is the perfect text for BATESOL and MATESOL courses in which action research is the focus or a required component.","authors":["Anne Burns"],"meta":["December 2009","DOI:10.4324/9780203863466"],"references":["290922376_Other_countries'_literacies_What_US_educators_can_learn_from_Mexican_schools","288446094_Self-assessment_of_second_language_ability_The_role_of_response_effects","285190103_Student_self-evaluation_-_What_do_we_know","270479313_Working_towards_common_understandings_Collaborative_interaction_in_staffroom_stories","249252583_Self-assessment_of_language_learning_in_formal_settings","237367384_To_be_or_have_not_been_Learning_language_tenses_through_drama","227786305_Developing_Principles_for_Practitioner_Research_The_Case_of_Exploratory_Practice","227700600_Focus_on_Form_and_Meaning_Perspectives_of_Developing_Teachers_and_Action-Based_Research","31066537_Integrating_grammar_in_adult_TESOL_classrooms"]}