{"id":"288068673_Chaos_bifurcations_self-organization_Dynamical_extensions_of_neurological_positivism_ecological_psychology","abstract":"Neurological positivism regards phenomenology, brain, behavior, and environment as a holistic unity. Their complex interaction over time can be regarded as a complex dynamical system, which we might call mind. Attractors and other features of dynamical systems can represent processes of the mind. 'Insensitivity to initial conditions' suggests that the similar patterns made by different trajectories obeying the same invariant properties of a chaotic attractor and can be considered equivalent to represent such a given process of the mind. Degree of awareness is related to the magnitude of attractors. Jumps in magnitude (plosive bifurcations) result in saltatory jumps in awareness. The attractors of the mind may also undergo subtle bifurcations among various stable fixed, periodic, and chaotic possibilities. Ontogeny and phylogeny emphasize irreversibility of sequences of such bifurcations. Conscious control and effort can be invested in self-organizational control of such bifurcations which empowers the growth potential of individuals and societies. The power of the dynamical systems approach to provide both an easily communicable visual geometric language and a metamodeling strategy for the science and practice of psychology is providing support for the metaparidigm shift currently under way in psychology. The dynamical approach has implications for the evolution toward a better balance between unification and diversity in psychology, for gaining additional perspective on the free will issue, and for an increasing sensitivity to the humanist mission of psychology.","authors":["frederick d Abraham"],"meta":["January 1996Dynamical Psychology"],"references":["351642730_Dynamics_Bifurcation_Self-Organization_Chaos_Mind_Conflict_Insensitivity_to_Initial_Conditions_Time_Unification_Diversity_Free_Will_and_Social_Responsibility","311693094_Fractal_modelling_of_real_world_images","306222105_The_sphinx_and_the_rainbowBrain_Mind_and_future_vision","300059457_Chaotic_Attractors_in_a_Model_of_Neocortex_Dimensionalities_of_Olfactory_Bulb_Surface_Potentials_Are_Spatially_Uniform_and_Event_Related","292898170_Jungian_thought_and_dynamical_systems_A_new_science_of_archetypal_psychology","292892034_The_evolution_of_number_Self-reflection_and_the_archetype_of_order","291802860_Towards_a_Developmental_Science","290838318_THE_DYNAMICS_OF_CREATIVITY_THE_COURAGE_TO_BE","290380518_Morphogenetic_dynamics_in_the_analytic_relationship","290348605_Archetypes_as_strange_attractors"]}