{"id":"28804740_FRBR_-_Requisitos_Funcionais_para_Registros_Bibliograficos_um_estudo_no_catalogo_da_Rede_Bibliodata","abstract":"In the context of library studies and Information Science, descriptive representation a serie of specialist meetings trying to establish standards to bibliographic description. Originated by one of international meetings, FRBR - Functional Requirements for Bibliographic Records, published by International Federation of Library Association and Institutions IFLA in 1998, it started a new interpretation of the bibliographic records was introduced, reorganizing their elements and presenting concepts and definitions of entities, attributes and relationships. The study became reflexes of the model FRBR in an electronic catalog, on-line, nationwide, through the examination of bibliographic records in format Machine Readable Cataloging – MARC, in order to systematize the relationship between the elements. Using appropriate literature and characteristics regarding potentials to realize the study, had been selected registers according to Catálogo Coletivo da Rede Bibliodata (Bibliodata Network Public Collection Catalog), and characterizing a study case. To illustrated the reflex of the model on the records, was used the conversional tool, FRBR Display Tool, from Library of Congress (LC), and besides the use of auxiliary tools when was made necessary. In order to complete the study, a few issues encountered in the literature were brought back as a manner to reach the goal of systematizing the relationships, given the relative failure of the tool under this aspect. Analytics stages comprise sample registers, notoriously descriptive and of the register converted in document that contains register model. In this phase, that is impossible to discuss every case, some tipical cases for each type of entitle purpose in FRBR. The results conducting to a necessity of register normalization and it is suggested tags MARC linking a better visualization of the model. Absence of discussions due to the use of models and international standards is considering as a potential trouble and there are paths indicated for the ways of future researches that would be realize, and one contribution to construct theorist corpus of the area.","authors":["Fernanda Passini Moreno"],"meta":["January 2006"],"references":[]}