{"id":"288040534_Embedded_multi-spectral_image_processing_for_real-time_medical_application","abstract":"The newly introduced Kubelka-Munk Genetic Algorithm (KMGA) is a promising technique for the assessment of skin lesions from multi-spectral images. Using five skin parameter maps such as concentration or epidermis/dermis thickness, this method combines the Kubelka-Munk light-tissue interaction model and Genetic Algorithm optimization process to produce a quantitative measure of cutaneous tissue. Up to the present, variant improved KMGA implementations have been successfully realized using the recent parallel computing techniques. However, all these achievements are based on the multi-core CPUs. This results in a quite high cost and low practicability for the hardware equipment of the clinical system. Fortunately, Embedded Systems (ES) applications have made great progress in recent years, and many highly effective image processing devices, such as DSPs (Digital Signal Processor) and FPGAs (Field Programmable Gate Array), have been made available to engineers at a very convenient price. Nevertheless, today’s embedded devices have as well the advantages of high speed, high embedability, low power consumption and more flexibility, etc. Thus, we focus our researches on the embedded KMGA application development. In this paper, we realize the CPU-to-FPGA transplantation of KMGA within a special High-Level Synthesis (HLS) SW/HW Co-design framework. Moreover, several optimizations are made on the algorithm and source code to improve the performances of the final implementation. Compared with CPUs, intensive experiments demonstrate that the proposed approaches can effectively improve the performances of KMGA method both in terms of efficiency and accuracy.","authors":["Chao Li","Souleymane Balla-Arabe","Fan Yang"],"meta":["December 2015Journal of Systems Architecture 64","DOI:10.1016/j.sysarc.2015.12.002"],"references":["284176010_A_Generalized_Hopfield_Network_for_Nonsmooth_Constrained_Convex_Optimization_Lie_Derivative_Approach","282844986_A_HardwareSoftware_Approach_for_Database_Query_Acceleration_with_FPGAs","273898509_Design_and_evaluation_of_a_Parallel_and_Optimized_Light-Tissue_Interaction_based_method_for_fast_skin_lesion_assessment","282539105_An_FPGA_implementation_for_real-time_edge_detection","281532929_Development_of_an_imaging_system_dedicated_to_the_acquisition_analysis_and_multispectral_characterisation_of_skin_lesion","277005638_IoTs_Enable_Active_Contour_Modeling_Based_Energy_Efficient_and_Thermal_Aware_Object_Tracking_on_FPGA","273792516_Identifying_the_spectral_responses_of_several_plant_species_under_CO2_leakage_and_waterlogging_stresses","272017753_Sequential_Large_Multipliers_on_FPGAs","262312302_Optimization_schemes_and_performance_evaluation_of_Smith-Waterman_algorithm_on_CPU_GPU_and_FPGA","261588108_FPGA_Prototyping_of_Emerging_Manycore_Architectures_for_Parallel_Programming_Research_using_Formic_Boards"]}