{"id":"288170804_Integrating_Technology_in_the_Classroom","abstract":"This study was intended to examine the extent to which elementary education teachers integrate into their teaching the technology available to them and if their decision to integrate technology was influenced by their level of education, years of teaching, or grade level taught. As technology has become a primary source of communication, it is not clear the extent to which students are being trained to use and implement technology. Despite the fact that many homes have computers, personal computers cannot be the answer to training students for the workplace. This responsibility falls on the shoulders of public education. The study sample included 55 certified teachers in grades K-3 in three schools. The ages of the participants ranged from 22 to 70. This research utilized an online survey to collect the data. Descriptive and inferential statistics were used to analyze the data. In specific the researchers used the mean and standard deviation, and Paired-Samples t test. The data shows that there were statistically significant differences between the teachers' years of experience and the frequency of using available software and the frequency of using the computer labs at the. 05 level (t = 2.585, df = 30) (t = 3.773, df = 30) respectively. In addition, there were statistically significant difference between the teachers' education level and the frequency of using the computer labs at the. 05 level (t = 2.719, df = 30). Finally, the grade level taught was also statistically significant with the frequency of using the computer labs at the. 05 level (t = 3.478, df = 30). © Common Ground, Megan Vonesh, Rebecca Rulis, Adel Al-Bataineh, All Rights Reserved.","authors":["Megan Vonesh","Rebecca Rulis","Adel Al-Bataineh"],"meta":["January 2011Ubiquitous Learning: An International Journal 3(2):163-174","DOI:10.18848/1835-9795/CGP/v03i02/40269"],"references":["255566574_Factors_That_Influence_Elementary_Teachers_Use_of_Computers"]}