{"id":"288383753_Lower_bounds_for_matrix_product_in_bounded_depth_circuits_with_arbitrary_gates","abstract":"We prove superlinear lower bounds for the number of edges in constant depth circuits with n inputs and up to n outputs. Our lower bounds are proved for all types of constant depth circuits, e.g., constant depth arithmetic circuits and constant depth Boolean circuits with arbitrary gates. The bounds apply for several explicit functions and, most importantly, for matrix product. In particular, we obtain the following results: 1. We show that the number of edges in any constant depth arithmetic circuit for matrix product (over any field) is superlinear in m2 (where m × m is the size of each matrix). That is, the lower bound is superlinear in the number of input variables. Moreover, if the circuit is bilinear, the result applies also for the case in which the circuit gets any product of two linear functions for free. 2. We show that the number of edges in any constant depth arithmetic circuit for the trace of the product of three matrices (over fields with characteristic O) is superlinear in m2. (Note that the trace is a single-output function.) 3. We give explicit examples for n Boolean functions f1,⋯,fn, such that any constant depth Boolean circuit with arbitrary gates for f1,⋯,fn has a superlinear number of edges. The lower bound is also proved for circuits with arbitrary gates over any finite field. The bound applies for matrix product over finite fields as well as for several other explicit functions.","authors":["R. Raz","A. Sphlika"],"meta":["February 2003SIAM Journal on Computing 32(2):488-513","DOI:10.1137/S009753970138462X"],"references":["2769212_A_Lower_Bound_for_Matrix_Multiplication","242807208_-Formulae_on_Finite_Structures","234148610_Algebraic_Complexity_Theory","227150482_Gaussian_elimination_is_not_optimal","226382029_Communication_in_bounded_depth_circuits","226375948_Lower_bounds_on_the_size_of_bounded_depth_circuits_over_a_complete_basis_with_logical_addition","226371574_Die_Berechnungskomplexitt_von_elementarsymmetrischen_Funktionen_und_von_Interpolationskoeffizienten","223124770_The_complexity_of_partial_derivatives","220616464_Size--Depth_Tradeoffs_for_Threshold_Circuits"]}