{"id":"288359497_ISO_9000_Outside_the_Iron_Cage","abstract":"Adopted by an increasing number of organizations around the world, the ISO 9000 standards have become a growing concern for more and more managers who are often compelled to adopt this system without really knowing its requirements and implications for employees. Though the effects of this standard on quality management and on performance improvement have been widely debated, there is little knowledge of how the managers and employees who are asked to implement and maintain it perceive the ISO 9000 standards or resist its use. This study will thus attempt to analyze this perception and resistance with regard to both the standard and the certification process. So as to avoid the traditional and idealised view of this standard, whose commercial stakes often give rise to uncritical statements, almost 50 interviews were conducted outside of the workplace. The results of these interviews revealed highly contrasting attitudes that were frequently critical of the ISO 9000 system, which was often given only superficial support. A qualitative analysis of the data allowed us to identify three types of respondents. They were grouped according to their opinions and attitudes about the implementation of this standard. The three groups were ceremonial integrators, quality enthusiasts and dissidents. Although the \"quality enthusiasts\" discourse often reflects managers' \"rhetoric of success\" described by Zbaracki (1998) about the implementation of total quality programs, this rhetoric is not shared by the other respondent categories. Hence, this research project contributes to a better understanding of how institutional pressures, which create \"isomorphic\" organizations by leading them to adopt identical management models, are reinterpreted, renegotiated, and modified within organizations. The proposed typology casts doubt on the mechanistic, consensual, and monolithic view of the ISO 9000 system that underlies most of the work on this theme. In particular, this study demonstrates the relevance of adopting both the institutionalist and critical approaches in efforts to explain the respondents' opinions. In so doing, the personnel's support for the ISO 9000 system and the certification process can then be analyzed from different angles. This certification process would ultimately appear to be a rite of passage that gives rise to various strategies that depend on the respondents' category and their support for the standard.","authors":["Olivier Boiral"],"meta":["November 2003Organization Science 14(6):720-737+754"],"references":["240689817_Approaches_to_the_Iron_CageReconstructing_the_Bars_of_Weber's_Metaphor","289804813_It_seems_to_fill_my_head_with_ideas_A_few_thoughts_on_postmodernism_TQM_and_BPR","258703433_The_Power_of_Obedience","240238254_The_state_of_quality_management_in_the_Irish_manufacturing_industry","238317628_It_is_not_what_you_achieve_it_is_the_way_you_achieve_it","235300231_Saudi_companies_attitude_toward_iso_9000_quality_standards_An_empirical_examination","13134564_Implementation_of_ISO_9000_in_the_healthcare_sector_a_case_study","4883969_ISO9000_The_new_strategic_consideration"]}