{"id":"288480385_Tweakable_parallel_OFB_mode_of_operation_with_delayed_thread_synchronization","abstract":"Introduction of various cryptographic modes of operation is induced with noted imperfections of symmetric block algorithms. Design of some cryptographic modes of operation has already been exploited as an idea for parallelization of certain algorithms execution. To the best of our knowledge, there is no evidence in the available literature that output feedback (OFB) mode, which is used in satellite communications, has ever been parallelized. In this paper, we consider the performance of a convenient mode of operation, which performs tweakable parallel encryption using xor encrypt xor (XEX) and xor encrypt (XE) constructions in OFB like mode. We make use of an idea similar to the XTS-AES in order to create two parallel tweakable block ciphers. The first of them is designed using XEX construction, while the second is based on XE construction. Each cipher uses two threads to produce corresponding keystreams. Keystreams are first merged with each other and then used in modified tweakable parallel OFB mode of operation. As a proof of the concept, we have implemented a Java application in which these parallel solutions are applied to collect empirical data. The results obtained show that under certain conditions tweakable parallel OFB modes using XEX and XE constructions can achieve performance accelerations up to 10% and to 20%, respectively.","authors":["Boris Damjanovic","Dejan Simić"],"meta":["December 2015Security and Communication Networks 9(10):n/a-n/a","DOI:10.1002/sec.1404"],"references":["277088743_Survey_and_benchmark_of_lightweight_block_ciphers_for_MSP430_16-bit_microcontroller","265556562_Right_translated_AES_gray_S-boxes","321599713_Satellite_Communication_Systems_Design","268886582_User's_guide_to_cryptography_and_standards","266656992_Automated_analysis_of_multithreaded_programs_for_performance_modeling","260844296_Introduction","260408437_Energy_efficiency_of_encryption_schemes_applied_to_wireless_sensor_networks","251998846_A_novel_error-tolerant_method_in_AES_for_satellite_images","242550250_Recommendation_for_Block_Cipher_Modes_of_Operation_The_XTS-AES_Mode_for_Confidentiality_on_Storage_Devices","242494127_Handbook_of_Applied_Cryptography","224561575_Design_of_a_parallel_AES_for_graphics_hardware_using_the_CUDA_framework","240026737_Handbook_of_Applied_CryptographyL_Chapter_6","235183820_Recommendation_for_Block_Cipher_Modes_of_Operation_Methods_and_Techniques","234781915_Digital_communication_systems_design","226186861_Block_Cipher_Modes_of_Operation_from_a_Hardware_Implementation_Perspective"]}