{"id":"288404651_Integrating_computational_thinking_with_K-12_science_education_A_theoretical_framework","abstract":"Computational thinking (CT) draws on concepts that are fundamental to computing and computer science, however, as an approach, it includes practices, such as problem representation, abstraction, decomposition, simulation, verification, and prediction that are also central to modelling, reasoning, and problem solving in many scientific and mathematical disciplines. Recently, arguments have been made in favour of integrating programming and CT with K-12 curricula. In this paper, we present a theoretical investigation of key issues that need to be considered for integrating CT with K-12 science. We identify the synergies between programming and CT on one hand, and scientific expertise on the other. We then present a critical review of literature on educational computing, and propose a set of guidelines for designing learning environments in science that can jointly foster the development of computational thinking with scientific expertise. Finally, we describe the design of a learning environment that supports CT through modelling and simulation to help middle school students learn physics and biology.","authors":["Pratim Sengupta","John Siler Kinnebrew","Gautam Biswas","Douglas Burton Clark"],"meta":["January 2012","Project: Computational Thinking and Modeling in K12 STEM"],"references":["313056846_Students'_transition_from_an_engineering_model_to_a_science_model_of_experimentation","281345564_Expert_and_Novice_Performance_in_Solving_Physics_Problems","274377900_Computational_Thinking","274309848_Computational_Thinking","321300499_The_Cambridge_handbook_of_the_learning_sciences_second_edition","303970457_Learning_Progressions_in_Science_An_Evidence-Based_Approach_to_Reform","285089562_Abstraction_Re-Presentation_and_Reflection_An_Interpretation_of_Experience_and_Piaget's_Approach","283625616_Establishing_the_norms_of_scientific_argumentation_in_classrooms","279933427_Learning-for-Use_A_Framework_for_the_Design_of_Technology-Supported_Inquiry_Activities","272177975_Complex_Systems_in_Education_Scientific_and_Educational_Importance_and_Implications_for_the_Learning_Sciences"]}