{"id":"288591680_Optimisation_of_Breakwaters_Design_to_Protect_Offshore_Terminal_Area","abstract":"This paper addresses an optimisation problemof the design of detached breakwaters planned at offshore terminals. The approach aims to minimize the cost of the protection struc-ture where the wave height in the terminal area is consid-ered to be the main constraint. A genetic algorithm is used to solve the problem where the fitness function consists of the objective function penalised by the constraint function, both of themun-dimensioned. The coordinates of the nodes of the breakwater are considered to be the variables of op-timisation. The initial population is randomly generated in a way to have two segments breakwater. The hydrody-namicmodel used to calculate the fitness of each individual within the population is based on mild-slop equation. An extended and modified mild-slope equation is used to take dissipation and rapid change bathymetry parameters into consideration together with random multi-frequency inci-dent wave. The results are taken after attending a steady state of the fitness function.","authors":["Hassan Diab","Pascal Lafon","Rafic Younes"],"meta":["January 2014","DOI:10.2316/P.2014.820-023"],"references":["227609582_Shape_optimization_of_geotextile_tubes_for_sandy_beach_protection","285178943_The_dissipation_of_wave_energy_by_bottom_friction","256198181_Computation_of_Combined_Refraction-Diffraction","247330265_Random_Seas_and_Design_of_Maritime_Structures","245216188_Minimization_of_wave_forces_on_an_array_of_floating_bodies_-_The_inverse_hydrodynamic_interaction_theory","237201491_Optimization_of_coastal_structures_Application_on_detached_breakwaters_in_ports","236847125_Extended_refraction-diffraction_equation_for_surface_waves","233515277_Design_optimization_of_floating_breakwaters_with_an_interdisciplinary_fluid-solid_structural_problem","231787284_The_modified_mild-slope_equation","223415632_Hydrodynamic_shape_optimization_of_large_offshore_structures"]}