{"id":"288596827_The_Solar_Dynamics_Observatory_SDO","abstract":"The Solar Dynamics Observatory (SDO) was launched on 11 February 2010 at 15:23 UT from Kennedy Space Center aboard an Atlas V 401 (AV-021) launch vehicle. A series of apogee-motor firings lifted SDO from an initial geosynchronous transfer orbit into a circular geosynchronous orbit inclined by 28° about the longitude of the SDO-dedicated ground station in New Mexico. SDO began returning science data on 1 May 2010. SDO is the first space-weather mission in NASA's Living With a Star (LWS) Program. SDO's main goal is to understand, driving toward a predictive capability, those solar variations that influence life on Earth and humanity's technological systems. The SDO science investigations will determine how the Sun's magnetic field is generated and structured, how this stored magnetic energy is released into the heliosphere and geospace as the solar wind, energetic particles, and variations in the solar irradiance. Insights gained from SDO investigations will also lead to an increased understanding of the role that solar variability plays in changes in Earth's atmospheric chemistry and climate. The SDO mission includes three scientific investigations (the Atmospheric Imaging Assembly (AIA), Extreme Ultraviolet Variability Experiment (EVE), and Helioseismic and Magnetic Imager (HMI)), a spacecraft bus, and a dedicated ground station to handle the telemetry. The Goddard Space Flight Center built and will operate the spacecraft during its planned five-year mission life; this includes: commanding the spacecraft, receiving the science data, and forwarding that data to the science teams. The science investigations teams at Stanford University, Lockheed Martin Solar Astrophysics Laboratory (LMSAL), and University of Colorado Laboratory for Atmospheric and Space Physics (LASP) will process, analyze, distribute, and archive the science data. We will describe the building of SDO and the science that it will provide to NASA. © Springer Science+Business Media B.V. 2012. All rights reserved.","authors":["William Dean Pesnell","Barbara J. Thompson","Phillip Clyde Chamberlin"],"meta":["November 2012Solar Physics 275:3-15","DOI:10.1007/978-1-4614-3673-7_2"],"references":["260259296_Solar_EUV_Experiment_SEE_Mission_overview_and_first_results","257664311_Design_and_Ground_Calibration_of_the_Helioseismic_and_Magnetic_Imager_HMI_Instrument_on_the_Solar_Dynamics_Observatory_SDO","231142737_New_Solar_Extreme-ultraviolet_Irradiance_Observations_during_Flares","225217521_Extreme_Ultraviolet_Variability_Experiment_EVE_on_the_Solar_Dynamics_Observatory_SDO_Overview_of_Science_Objectives_Instrument_Design_Data_Products_and_Model_Developments","225194195_The_Atmospheric_Imaging_Assembly_AIA_on_the_Solar_Dynamics_Observatory_SDO","45623737_Definition_of_the_Flexible_Image_Transport_System_FITS_version_30","258496828_Long-range_magnetic_couplings_between_solar_flares_and_coronal_mass_ejections_observed_by_SDO_and_STEREO","226125713_Data_Analysis_with_the_SolarSoft_System","8207374_Unusual_activity_of_the_Sun_during_recent_decades_compared_to_the_previous_11000_years"]}