{"id":"288591094_Is_the_universe_a_vast_consciousness-created_virtual_reality_simulation","abstract":"Two luminaries of 20th century astrophysics were Sir James Jeans and Sir Arthur Eddington. Both took seriously the view that there is more to reality than the physical universe and more to consciousness than simply brain activity. In his Science and the Unseen World (1929) Eddington speculated about a spiritual world and that \"conscious is not wholly, nor even primarily a device for receiving sense impressions.\" Jeans also speculated on the existence of a universal mind and a non-mechanical reality, writing in his The Mysterious Universe (1932) \"the universe begins to look more like a great thought than like a great machine.\" In his book QED Feynman discusses the situation of photons being partially transmitted and partially reflected by a sheet of glass: reflection amounting to four percent. In other words one out of every 25 photons will be reflected on average, and this holds true even for a \"one at a time\" flux. The four percent cannot be explained by statistical differences of the photons (they are identical) nor by random variations in the glass. Something is \"telling\" every 25th photon on average that it should be reflected back instead of being transmitted. Other quantum experiments lead to similar paradoxes. To explain how a single photon in the two-slit experiment can \"know\" whether there is one slit or two, Hawking and Mlodonow write: In the double-slit experiment Feynman's ideas mean the particles take paths that thread through the first slit, back out though the second slit, and then through the first again; paths that visit the restaurant that serves that great curried shrimp, and then circle Jupiter a few times before heading home; even paths that go across the universe and back. This, in Feynman's view, explains how the particle acquires the information about which slits are open. It is hard to imagine a more absurd physical explanation. We can think of no way to hardwire the behavior of photons in the glass reflection or the two-slit experiments into a physical law. On the other hand, writing a software algorithm that would yield the desired result is really simple. A digital reality whose laws are software is an idea that has started to gain traction in large part thanks to an influential paper in Philosophical Quarterly by Oxford professor Nick Bostrom. Writing in the New York Times John Tierney had this to say: Until I talked to Nick Bostrom, a philosopher at Oxford University it never occurred to me that our universe might be somebody else's hobby. But now it seems quite possible. In fact, if you accept a pretty reasonable assumption of Dr. Bostrom's, it is almost a mathematical certainty that we are living in someone else's computer simulation. An alternate view (and more optimistic view) is that there exists a great consciousness whose mind is the hardware, and whose thoughts are the software creating a virtual universe in which we as beings of consciousness live.","authors":["B. Haisch"],"meta":["January 2014Cosmos and History 10(1):48-60"],"references":["227792745_Are_We_Living_in_a_Computer_Simulation"]}