{"id":"288604251_Robots_and_Cultural_Heritage_New_Museum_Experiences","abstract":"The introduction of new technologies to enhance the visiting museum experience is not a novelty. A large variety of interactive systems are nowadays available, including virtual tours, which makes cultural heritage accessible remotely. The theme of increase in accessibility and attractiveness has lately been faced with the employment of the service robotics, covering various types of applications. Regrettably, many of robotics solutions appear less successful in terms of utility and usability. On the basis of this awareness, a design for a new robotic solution for cultural heritage has been proposed. The project, developed at the royal residence of Racconigi Castle, consists of a telepresence robot designed as a tool to explore inaccessible areas of the heritage. The employed robot, called Virgil, was expressly designed for the project. The control of the robot is entrusted to the museum guides in order to enhance their work and enrich the cultural storytelling.","authors":["Maria Luce Lupetti","Claudio Germak","Luca Giuliano","Miguel Kaoug Efrain"],"meta":["December 2015Journal of Science and Technology of the Arts 7(2):47-57","DOI:10.7559/citarj.v7i2.158","Project: Virgil, a robot for Cultural Heritage."],"references":["301742448_Fly4SmartCity_A_cloud_robotics_service_for_smart_city_applications","283019961_TaraScope_Controlling_Remote_Telescopes_Through_Tangible_Interaction","281099050_From_the_management_of_cultural_heritage_to_the_governance_of_cultural_heritage_system","275027745_Sliding_Autonomy_in_Cloud_Robotics_Services_for_Smart_City_Applications","262838288_Usability_evaluation_of_visualization_technologies_for_virtual_museums_interfaces","254462013_Sketches_by_Paul_the_robot","270914017_Wanted_Collaborative_intelligence","265737646_Museum_management_Emotional_value_and_community_engagement","242076699_THE_ROLE_OF_THE_TOUR_GUIDE_IN_TRANSFERRING_CULTURAL_UNDERSTANDING","233881999_ROS_an_open-source_Robot_Operating_System"]}