{"id":"288628543_An_electronic_database_of_speech_sound_levels","abstract":"In early 1970's, the U.S. Environmental Protection Agency sponsored a research program involving speech sound levels in various noise environments. Bolt, Beranek and Newman (BB&N) conducted this research program under contract. Among other tasks, BB&N measured speech sound levels under controlled conditions from subjects using five categories of speech effort. In 1977, a summary report of the research program was prepared. This report was supported by a companion data supplement containing a statistical analysis of sound pressure levels measured at one meter from 97 individual subjects in an anechoic chamber. The data were obtained from a one-third-octave-band real-time analyzer, processed by a mini-computer, and then printed in the form of 482 cumulative statistical distributions. The 140,000 sound pressure levels in this printed data supplement have now been converted to an electronic database to create a convenient and efficient resource for the acoustical community. The data can be used for many purposes, including the prediction of speech privacy for a variety of speech efforts. This paper summarizes the contents of the database and discusses its possible applications.","authors":["A. Nash"],"meta":["January 2014"],"references":["292766149_Masking_of_pure_tones_and_speech","272529616_Comfortable_effort_level_An_experimental_variable","253357269_Limits_of_Direct_Speech_Communication_in_Noise","243509389_The_relative_loudness_of_third-octave_bands_of_speech","243494902_Intelligibility_of_Peak-Clipped_Speech_at_High_Noise_Levels","239643264_Exploration_of_Pressure_Field_Around_the_Human_Head_During_Speech","232418078_The_Intelligibility_of_Interrupted_Speech","200045157_Factors_Governing_the_Intelligibility_of_Speech_Sounds","19973498_Distribution_of_short-term_rms_levels_in_conversational_speech","19536577_Derivation_of_primary_parameters_and_procedures_for_use_in_speech_intelligibility_predictions","19482583_Representations_of_the_Long-Term_Spectra_of_Speech"]}