{"id":"288749471_Case_Based_Reasoning_Case_Representation_Methodologies","abstract":"Case Based Reasoning (CBR) is an important technique in artificial intelligence, which has been applied to various kinds of problems in a wide range of domains. Selecting case representation formalism is critical for the proper operation of the overall CBR system. In this paper, we survey and evaluate all of the existing case representation methodologies. Moreover, the case retrieval and future challenges for effective CBR are explained. Case representation methods are grouped in to knowledge-intensive approaches and traditional approaches. The first group overweight the second one. The first methods depend on ontology and enhance all CBR processes including case representation, retrieval, storage, and adaptation. By using a proposed set of qualitative metrics, the existing methods based on ontology for case representation are studied and evaluated in details. All these systems have limitations. No approach exceeds 53% of the specified metrics. The results of the survey explain the current limitations of CBR systems. It shows that ontology usage in case representation needs improvements to achieve semantic representation and semantic retrieval in CBR system.","authors":["Shaker El-Sappagh","Mohammed Elmogy"],"meta":["November 2015International Journal of Advanced Computer Science and Applications 6(11):192-208","DOI:10.14569/IJACSA.2015.061126"],"references":["265206200_Integration_of_Case-Based_and_Ontology-Based_Reasoning_for_the_Intelligent_Reuse_of_Project-Related_Knowledge","262407434_Knowledge-based_decision_support_in_oil_well_drilling_Combining_general_and_case-specific_knowledge_for_problem_solving","323919776_Induction_of_Similarity_Measures_and_Medical_Diagnosis_Support_Rules_through_Separable_Linear_Data_Transformations","313198231_Retrieving_Adaptable_Cases_The_Role_of_Adaptation_Knowledge_in_Case_Retrieval","290104598_Evolutionary_case_based_design","264907112_Fuzzy_Knowledge_Management_for_the_Semantic_Web","262398874_A_new_similarity_measure_in_formal_concept_analysis_for_case-based_reasoning","261076902_Case_studies_on_the_clinical_applications_using_case-based_reasoning","259007010_RespiDiag_A_Case-Based_Reasoning_System_for_the_Diagnosis_of_Chronic_Obstructive_Pulmonary_Disease","257405090_Reprint_of_Length_of_stay_prediction_for_clinical_treatment_process_using_temporal_similarity"]}