{"id":"288891841_Quality_assurance_in_higher_education_A_review_of_literature","abstract":"The aim of this paper is to present a general view and a brief literature review of the main aspects related to quality assurance in global higher education. It provides an overview of accreditation as a mechanism to ensure quality in higher education, examines models of QA, and explores the concept of quality. In addition, this paper provides a review of research on the effectiveness of quality assurance practices, with a particular focus on student involvement with quality assurance. In reviewing the concept of quality assurance itself, the author noted there is a need for a common framework for a quality assurance model; however, there is no agreement as to a QA definition or a QA model. Furthermore, although quality is the utmost significant concern for accrediting bodies, accreditation structures are decentralized and complex at both the regional and international level. Another challenge identified revolves around the concerns of faculty members and other stakeholders, such as students, about the QA process. Given that students are at the center of higher education, and invest time and money in the system, the author concludes involving them could improve QA processes.\n\nDOI: 10.18870/hlrc.v5i4.257","authors":["Tricia Ryan"],"meta":["December 2015Higher Learning Research Communications 5(4)","DOI:10.18870/hlrc.v5i4.257"],"references":["312862699_European_Quality_Assurance-A_European_Higher_Education_Area_Success_Story_Overview_Paper","286934903_The_European_Higher_Education_Area_Between_Critical_Reflections_and_Future_Policies","284217681_Definitions_of_Quality_in_Higher_Education_A_Synthesis_of_the_Literature","269974340_Identifying_Predictors_of_Student_Satisfaction_and_Student_Motivation_in_the_Framework_of_Assuring_Quality_in_the_Delivery_of_Higher_Education_Services","318517973_Leaving_College_Rethinking_the_Causes_and_Cures_of_Student_Attrition","291831942_Improving_Higher_Education_Total_Quality_Care","283254256_Blogging_in_higher_education","275273798_Beliefs_Regarding_Faculty_Participation_in_Peer_Reviews_of_Online_Courses","272178025_The_Delphi_Method_II_Structure_of_Experiments","271921764_International_accreditation_as_global_position_taking_an_empirical_exploration_of_US_accreditation_in_Mexico"]}