{"id":"288855597_A_Proposal_for_Local_k_Values_for_k-Nearest_Neighbor_Rule","abstract":"The k-nearest neighbor (k-NN) classifier is one of the most widely used methods of classification due to several interesting features, including good generalization and easy implementation. Although simple, it is usually able to match and even outperform more sophisticated and complex methods. One of the problems with this approach is fixing the appropriate value of k. Although a good value might be obtained using cross validation, it is unlikely that the same value could be optimal for the whole space spanned by the training set. It is evident that different regions of the feature space would require different values of k due to the different distributions of prototypes. The situation of a query instance in the center of a class is very different from the situation of a query instance near the boundary between two classes. In this brief, we present a simple yet powerful approach to setting a local value of k. We associate a potentially different k to every prototype and obtain the best value of k by optimizing a criterion consisting of the local and global effects of the different k values in the neighborhood of the prototype. The proposed method has a fast training stage and the same complexity as the standard k-NN approach at the testing stage. The experiments show that this simple approach can significantly outperform the standard k-NN rule for both standard and class-imbalanced problems in a large set of different problems.","authors":["Nicolás García-Pedrajas","Juan Antonio Romero","Gonzalo Cerruela"],"meta":["December 2015IEEE Transactions on Neural Networks and Learning Systems 28(2):1-6","DOI:10.1109/TNNLS.2015.2506821"],"references":["319877813_Face_Recognition_by_Elastic_Bunch_Graph_Matching","236234718_A_Simple_Locally_Adaptive_Nearest_Neighbor_Rule_With_Application_To_Pollution_Forecasting","220773945_Non-parametric_Nearest_Neighbor_with_Local_Adaptation","2528210_Shape_Matching_and_Object_Recognition_Using_Shape_Contexts","272825857_UCI_Machine_Learning_Repository","251620871_A_novel_two-level_nearest_neighbor_classification_algorithm_using_an_adaptive_distance_metric","228532864_Neighborhood_size_selection_in_the_k-nearest-neighbor_rule_using_statistical_confidence","221161705_Improving_Nearest_Neighbor_Rule_with_a_Simple_Adaptive_Distance_Measure","220320196_Statistical_Comparisons_of_Classifiers_over_Multiple_Data_Sets","220118973_A_lot_of_randomness_is_hiding_in_accuracy","4038346_Fast_pose_estimation_with_Parameter-Sensitive_Hashing","3115579_Asymptotic_Properties_of_Nearest_Neighbor_Rules_Using_Edited_Data","2473667_Locally_Adaptive_Nearest_Neighbor_Algorithms"]}