{"id":"288835347_Open_data_for_informal_settlements_Toward_a_user_s_guide_for_urban_managers_and_planners","abstract":"Informal settlements exist in a legally contested space and the quality of – and access to – information about them has been historically limited. The open data movement promises to address this gap by offering alternative sources for information and free or low cost analytical platforms. However, in order to use open data effectively, urban managers and planners need guidance to navigate these new data sources, software, and server platforms, as well as acquire the necessary skills. In this paper, we begin to address these issues by developing a framework that organizes the sprawling and rapidly evolving world of open urban data. Our framework includes three broad categories (1) inputs and resources, (2) activities and outputs, and (3) outcomes. We then identify and describe the key subcomponents under each, and list the prominent products and resources available to urban managers and planners. For example, under inputs and resources, we discuss open urban data sources such as Open Street Maps, cyberinfrastructure for web hosting, application deployment, and data processing, and open source software that can be used to analyze and visualize collected or derived data. We also identify the key resources available to planners for training and discuss the complementary opportunities presented by conventional datasets such as census and open urban data. Finally, using examples from ongoing activities in Mumbai, we show how open data resources can be useful for understanding urbanization and better integrating informal settlements into formal urban management and planning processes. We suggest that urban managers and planners working in informal settlements should take greater advantage of open data resources in order to both better address current challenges as well as for shaping a better future for the communities they serve.","authors":["Arnab Chakraborty","Bev Wilson","Saket Sarraf","Arnab Jana"],"meta":["December 2015Journal of Urban Management 4(2):74–91","DOI:10.1016/j.jum.2015.12.001"],"references":["339246977_Automatic_detection_of_language_impairment","287661684_Security_of_tenure_in_Indian_cities","283169668_Modeling_and_Visualizing_Regular_Human_Mobility_Patterns_with_Uncertainty_An_Example_Using_Twitter_Data","282487456_Disembodied_voices_embodied_places_Mobile_technology_enabling_discourse_and_interpreting_place","274264183_Understanding_urban_China_with_open_data","326307591_From_Stories_to_Evidence_How_Mining_Data_Can_Promote_Innovation_in_the_Nonprofit_Sector","312596137_Big_data_The_next_frontier_for_innovation_competition_and_productivity","298925657_Collaborative_Software_Development_Using_R-Forge_Special_invited_paper_on_The_Future_of_R","280559463_Mumbai_slums_since_independence_Evaluating_the_policy_outcomes","275060058_The_pitfalls_of_regional_delineations_in_land_use_modeling_Implications_for_Mumbai_region_and_its_planners"]}