{"id":"288966801_Diagnosis_of_Breast_Cancer_using_a_Combination_of_Genetic_Algorithm_and_Artificial_Neural_Network_in_Medical_Infrared_Thermal_Imaging","abstract":"Introduction: This study is an effort to diagnose breast cancer by processing the quantitative and qualitative information obtained from medical infrared imaging. The medical infrared imaging is free from any harmful radiation and it is one of the best advantages of the proposed method. By analyzing this information, the best diagnostic parameters among the available parameters are selected and its sensitivity and precision in cancer diagnosis is improved by utilizing genetic algorithm and artificial neural network. Materials and Methods: In this research, the necessary information is obtained from thermal imaging of 200 people, and 8 diagnostic parameters are extracted from these images by the research team. Then these 8 parameters are used as input of our proposed combinatorial model which is formed using artificial neural network and genetic algorithm. Results: Our results have revealed that comparison of the breast areas; thermal pattern and kurtosis are the most important parameters in breast cancer diagnosis from proposed medical infrared imaging. The proposed combinatorial model with a 50% sensitivity, 75% specificity and, 70% accuracy shows good precision in cancer diagnosis. Conclusion: The main goal of this article is to describe the capability of infrared imaging in preliminary diagnosis of breast cancer. This method is beneficial to patients with and without symptoms. The results indicate that the proposed combinatorial model produces optimum and efficacious parameters in comparison to other parameters and can improve the capability and power of globalizing the artificial neural network. This will help physicians in more accurate diagnosis of this type of cancer.","authors":["Hossein Ghayoumi zadeh","Javad Haddadnia","Maryam Hashemian","Kazem Hassanpour"],"meta":["January 2012Iranian Journal of Medical Physics 9(4):265-274","DOI:10.22038/ijmp.2013.470","Project: Breast Cancer Diagnosis Based On Thermal Image Processing"],"references":["348743453_Breast_Cancer_Detection_Using_Thermal_Infrared_Images","258045528_Diagnosis_of_Breast_Cancer_and_Clustering_Technique_using_Thermal_Indicators_Exposed_by_Infrared_Images","258029418_Distinguish_breast_cancer_based_on_thermal_features_in_infrared_images","230696309_Mammography_and_Ultrasonography_Reports_Compared_with_Tissue_Diagnosis_-_An_Evidence_Based_Study_in_Iran_2010","262493961_Early_breast_cancer_detection_practices_health_beliefs_and_cancer_worries_in_Jewish_and_Arab_women","256367660_Medical_images_formation_perception_and_measurement_Leeds_England_13-15_April_1976","251924118_Image_processing_for_early_diagnosis_of_breast_cancer_using_infrared_images","232530353_Tackling_cancer_burden_in_the_Middle_East_Qatar_as_an_example","225909053_Thermal_Infrared_Imaging_in_Early_Breast_Cancer_Detection","224720003_Breast_Cancer_Classification_Using_Statistical_Features_and_Fuzzy_Classification_of_Thermograms"]}