{"id":"289076909_Phonetic_Analysis_of_Lexical_Stress_in_Sindhi","abstract":"Investigation of acoustic correlates of lexical stress tests the hypothesis that lexical stress modifies acoustic properties of sounds in Sindhi. The experiment was carefully designed in order to examine the phonetic exponents of lexical stress. The analysis is based on the voice samples of recorded 10 Sindhi word stress pairs, and they were similar however, they just differ in terms of assignment of primary stress. A total 2000 voice samples (10×10×20=2000) were analyzed in a fixed carrier phrase. The data consists of Sindhi stressed and unstressed vowels /i, ɪ, e, ɛ, ə, ɑ, ɔ, o, ʊ/ and u/, from ten native speakers of Utradi (Northern) dialect recorded on Praat speech processing tool, and a high quality microphone. Four parameters were considered for an acoustic analysis of lexical stress i.e., duration, fundamental frequency (F0), vowel quality (F1-F2) and the stop closure. The acoustic examination of the voice samples provides evidence for higher frequency of stressed vowels and lower frequency for unstressed vowels relatively. In addition, the data analysis reveals that there were statistically significant differences in the values of short and long vowels referencing to the stressed and unstressed syllables. Similarly, the frequency values of the duration and stop closure of stressed vowels were also greater than the unstressed, while F0 and F1-F2 values were higher in stressed and lower in unstressed vowels which explicitly provides a strong evidence that phonetic correlates of lexical stress in Sindhi.","authors":["Dr Abdul Malik Abbasi"],"meta":["December 2015"],"references":["259810776_PRAAT_Doing_phonetics_by_computer_Version_5351","230876262_Spectrographic_Study_of_Vowel_Reduction","293084437_Spectrographic_Study_of_Vowel_Reduction","269424052_A_Course_in_Phonetics","245553046_Auditory_Representations_in_Phonology","243773207_Experiments_in_the_Perception_of_Stress","241069878_A_Phonological_and_Phonetic_Study_of_Word-Level_Stress_in_Chickasaw","232576382_Duration_and_Intensity_as_Physical_Correlates_of_Linguistic_Stress","230876232_A_Course_in_Phonetics","229101059_Voice_and_Speech_Processing"]}