{"id":"289184866_The_Role_of_Situational_Cues_in_Signaling_and_Maintaining_Stereotype_Threat","abstract":"This chapter focuses on how stereotype threat is produced and sustained through threatening situational cues in an environment-such as its organization, features, and physical characteristics-that suggest the possible mistreatment or devaluation of stigmatized individuals. First, we illustrate how threatening situational cues engender a vigilance process whereby stigmatized individuals direct attention toward additional cues to determine the value and meaning of their social identity in a setting. We review how both explicit and subtle situational cues elicit stereotype threat, particularly among racial minorities in academic settings and women in science, technology, engineering, and math (STEM) domains. We propose that the meaning people assign to those cues ultimately affects whether they will become vulnerable to-or protected against-stereotype threat. Further, we suggest that situational cues are meaningful to the extent that they elicit identity-related concerns, such as concerns for belonging, institutional fairness, or of being marginalized in a setting. Finally, we explore how \"identity-safe\" cues in a setting can eliminate stereotype threat by reducing identity threat concerns and signaling to stigmatized individuals that their social identity will not be a liability to their outcomes. Understanding how situational cues trigger and diffuse identity threat offers hope for changing the dynamics of social identity threat and ultimately points toward a new wave of identity threat research-investigating the interactive and contextual nature of identitysafe cues to create environments that are welcoming and comfortable for all groups.","authors":["Mary C. Murphy","Valerie Jones Taylor"],"meta":["January 2012","DOI:10.1093/acprof:oso/9780199732449.003.0002"],"references":["247721077_Preserving_positive_identities_Public_and_private_regard_for_one's_ingroup_and_susceptibility_to_stereotype_threat","229358304_The_many_faces_of_stereotype_threat_Group-_and_self-threat","23807719_Targets_as_Perceivers_How_People_Determine_When_They_Will_Be_Negatively_Stereotyped","6950137_The_Difference_Isn't_Black_and_White_Stereotype_Threat_and_the_Race_Gap_on_Raven's_Advanced_Progressive_Matrices","291977549_Colorblindness_as_a_barrier_to_inclusion_Assimilation_and_nonimmigrant_minorities","242788053_Stereotype_threat_as_validity_threat_The_anxiety-sex-threat_interaction","233512546_You're_Just_Saying_That_Because_I'm_a_Woman_Stigma_Consciousness_and_Attributions_to_Discrimination","30052835_Improving_performance_expectancies_in_Stereotypic_domains_Task_relevance_and_the_reduction_of_stereotype_threat","6904513_Distinguishing_stereotype_threat_from_priming_effects_On_the_role_of_the_social_self_and_threat-based_concerns"]}