{"id":"289112326_Pulse_of_climate_change_in_Indian_Sundarbans_A_myth_or_reality","abstract":"Climate change is being experienced intensely in the mangrove dominated deltaic complex of Indian Sundarbans. Deglaciation of Gangotri glacier in the Himalayan range and several anthropogenic influences has accelerated the phenomenon since last two decades. Four indicators (surface water temperature, salinity, dissolved oxygen, and transparency) considered in the present study exhibited significant correlations with global warming and caused considerable alteration of hydrological parameters over a period of 27 years. Owing to varied geographical features in the western and eastern sectors of the deltaic complex, the foot prints of climate change were perceived in different pattern and scale. The surface water temperature showed increasing trend in both sectors (6.14% and 6.12% rise in western and eastern sectors respectively). The transparency reduced by 25% in both western and eastern sectors. This may be the effect of increased erosion, anthropogenic activities and silt contribution by the River Ganges. The salinity and dissolved oxygen exhibited contradictory trends in the western and eastern sectors, which may be attributed to deglaciation process in the Himalayan range. The blockage of the major rivers in the eastern Indian Sundarbans by heavy silt and solid wastes from the adjacent city of Kolkata posed serious problems to the island dwellers by way of increasing salinity and decreased dissolved oxygen. Documentation of stenohaline phytoplankton species in upstream regions of eastern Indian Sundarbans (secondary source) confirmed the intrusion of sea water from Bay of Bengal. Such intrusion has serious adverse effect on the livelihood of the local people.","authors":["Abhijit Mitra","Kakoli Banerjee","K. Sengupta","Avijit Gangopadhyay"],"meta":["January 2009National Academy Science Letters 32(1):1-7"],"references":["290306701_The_northwest_coast_of_the_Bay_of_Bengal_and_Deltaic_Sundarbans","229508697_Channel_and_Floodplain_Response_to_recent_abrupt_climate_change_the_Tyne_Basin_Northern_England","11672607_Climate_change_How_fast_are_sea_levels_rising"]}