{"id":"289269972_The_research_imperative_in_the_evolving_environment_of_public_universities_in_Malaysia","abstract":"The importance of original scholarship as proposed by Humboldt has shaped the research mission in universities worldwide. Universities in Malaysia which are the pivotal organisations of a knowledge society are mandated to fulfill the aspiration of the government for Malaysia to be a regional and international education hub. To meet this challenge, organised research has become an imperative in Malaysian universities. This study examines the factors impacting educational convergence and the Malaysian universities' adoptive response to this convergence at multiple levels: transnational, national and within the universities. We analysed both the standard-setting macro structures and the micro adoptive mechanisms, processes and agents which contribute to shaping the discursive space of research in Malaysian public universities. The theoretical framework preferred for the synthesised analysis draws on the neo-institutionalist theory (Meyer and Ramirez, 2000), self-referencing the social system theory (Luhmann, 1982) and the externalisation thesis (Schriewer, 2003). The neo-institutionalist theory helps explain the exogenous structural forces and general trends and the two latter theories examine the contextual, that is, the social, cultural, historical, political and economic factors which help to understand the idiosyncratic trajectories, processes and meanings of the responses of Malaysian public universities to the international research imperative. The data was collected through interviews with local academics from five public universities. The themes which emerged from the data were: (i) the role of the global and local convergence and divergence in the shaping of the research mission of public universities; (ii) the research policies and their unintended consequences; (iii) discipline differentials in the research output; (iv) innovative research in the service of the community; and (v) the bind of bias - problems of publication. It is hoped that the dialectic theoretical framework and the multilevel analysis will contribute towards an understanding of the research culture in Malaysian universities and advance research discourse in Malaysia.","authors":["P.K. Hukam Singh","Thavamalar Thuraisingam","Vikneswaran Nair","Maya Khemlani David"],"meta":["January 2013SEARCH (Malaysia) 5(1):1-18"],"references":["227768329_Contrasting_Perspectives_on_the_Relationship_Between_Teaching_and_Research","225732810_Understanding_educational_transfer_Theoretical_perspectives_and_conceptual_frameworks","224892275_Changing_Patterns_of_Publication_Productivity_Accumulative_Advantage_or_Institutional_Isomorphism","278524300_The_Politics_of_Educational_Borrowing_Reopening_the_Case_of_Achimota_in_British_Ghana","264226501_The_Challenge_of_Academic_Publishing_A_Hong_Kong_Perspective","248545251_Shaping_Chinese_novice_scientists'_manuscripts_for_publication","226348944_Research_and_teaching_at_a_research_university","223368346_Seeking_acceptance_in_an_English-only_research_world","223311791_Scholarly_writers_who_use_English_as_an_Additional_Language_What_can_Goffman's_Stigma_tell_us","222306092_Writing_for_scholarly_publication_in_English_The_case_of_Hong_Kong_Journal_of_Second_Language_Writing_82_123-145"]}