{"id":"289378321_Becoming_Interdisciplinary_An_Introduction_to_Interdisciplinary_Studies_3rd_Ed","abstract":"Becoming Interdisciplinary introduces students to interdisciplinary studies and is useful for students seeking a better understanding both of interdisciplinary studies and of themselves. Theoretically informed, it is primarily written for undergraduates in an extremely readable style. First-year graduate students interested in pursuing interdisciplinary and transdisciplinary research will also find it helpful. Now available, the purpose of the revised and expanded Third Edition of Becoming Interdisciplinary is to introduce students to the foundations of interdisciplinary studies so that they can better understand both interdisciplinarity and transdisciplinarity as well as improve how they communicate what they are to others. \n\nStudents will begin to learn how to answer the following questions:\n\nWhat are interdisciplinary studies?\n\nWhat are the ways students can communicate effectively their interdisciplinary, integrative or transdisciplinary programs of study?\n\nWhat are the advantages and disadvantages of pursuing an interdisciplinary education?\n\nHow can interdisciplinary studies help students better attain their professional goals?\n\nPart One Understanding Interdisciplinary Studies\n\n1. Introduction\n2. What Is Interdisciplinarity? Some Essential Definitions\n3. Metaphors for Interdisciplinary Studies\n4. Taxonomy of Interdisciplinary Studies\n5. History of Interdisciplinarity\n6. Skills and “Characteristics” of Interdisciplinarians\n\nPart Two Toolkit for Communicating Interdisciplinary Studies\n\n7. Debating Interdisciplinary Studies\n8. Identifying Your Personal, Academic, and Professional Interests and Goals\n9. Linking Personal Worldviews to Disciplinary Perspectives\n10. Describing Your Interdisciplinary Degree\n11. Telling Your Story as an Interdisciplinarian\n12. Creating and Presenting Portfolios\n13. Reflecting with Online Portfolios\n\nSpecial Features of this book include all of the following:\n\nDefinitions of key terms by leading scholars of interdisciplinary studies\n\nA toolkit for communicating one’s interdisciplinary program of study\n\nA background history of how interdisciplinary studies programs emerged\n\nA discussion of leading advantages and disadvantages of interdisciplinary studies\n\nA brief overview of leading and emergent currents of transdisciplinarity\n\nNumerous experiential learning class activities, such as a metaphor top-ten list and a class “trial” on interdisciplinary studies, and the following major assignments: intellectual autobiography, autobiographical maps, disciplinary research, research on disciplinary practitioners, reflection exercises, and student portfolios\n\nReadings in interdisciplinary studies selected to increase understanding\n\nDiscussion questions for most readings designed to help students pick out main points of reading\n\nInclusion of actual student work as examples for class activities and assignments","authors":["Tanya Augsburg"],"meta":["January 2016","Edition: 3Publisher: Kendall HuntISBN: Print: 9781465289841 Electronic Delivery EBOOK: 9781465290144"],"references":[]}