{"id":"289490842_Review_of_Literature_on_Fathers'_Recognition","abstract":"In recent years, fathers’ participation in child-rearing has been called for in Japan. There is every indication that fathers are taking upon themselves this task. However, it is said that many fathers are puzzled over this challenging fathering role and feel stressed when they are unable to engage with childcare directly. It is believed that recognition of being a father is a major factor behind this. In this study, we searched the literature in Japan and abroad regarding fatherhood recognition and examined what is important in developing a father consciousness. With “father,” “recognition,” “attitude,” “paternity,” “childcare,” and “childcare satisfaction” as keywords, we searched the literature dating as far back as 2001, using medical journals in Japan, and Scopus and CINAHL in other countries. We obtained 27 documents from the Japanese journals (including three technical treatises) and 34 documents from the English publications and classified them into the five categories:1) father figure, 2) childcare participation of father, 3) recognition of the couple’s marriage in the involvement of the husband, 4) role of father and 5) formation of father consciousness. Besides, 20 items were extracted as sub-categories. This study suggested that to foster fatherhood recognition or father consciousness, it was important to increase the intimacy between husband and wife, provide educational support, and establish a social and work environment that is friendly to paternal involvement in child-rearing.","authors":["Kiyomi DECKER","Akiko MARUYAMA"],"meta":["January 2015JOURNAL OF THE JAPANESE ASSOCIATION OF RURAL MEDICINE 64(4):718-724","DOI:10.2185/jjrm.64.718"],"references":["225086685_Fathers_Online_Learning_About_Fatherhood_Through_the_Internet","224853351_Choosing_Fatherhood_How_Teens_in_the_Justice_System_Embrace_or_Reject_a_Father_Identity","50999729_Heading_Into_Fatherhood-Nervously_Support_for_Fathering_From_Online_Dads","233536528_Preparing_fathers_for_the_transition_to_parenthood_Recommendations_for_the_content_of_antenatal_education"]}