{"id":"289406953_A_Unified_Framework_for_Compositional_Fitting_of_Active_Appearance_Models","abstract":"Active Appearance Models (AAMs) are one of the most popular and\nwell-established techniques for modeling deformable objects in computer vision.\nIn this paper, we study the problem of fitting AAMs using Compositional\nGradient Descent (CGD) algorithms. We present a unified and complete view of\nthese algorithms and classify them with respect to three main characteristics:\ni) cost function; ii) type of composition; and iii) optimization method.\nFurthermore, we extend the previous view by: a) proposing a novel Bayesian cost\nfunction that can be interpreted as a general probabilistic formulation of the\nwell-known project-out loss; b) introducing two new types of composition,\nasymmetric and bidirectional, that combine the gradients of both image and\nappearance model to derive better conver- gent and more robust CGD algorithms;\nand c) providing new valuable insights into existent CGD algorithms by\nreinterpreting them as direct applications of the Schur complement and the\nWiberg method. Finally, in order to encourage open research and facilitate\nfuture comparisons with our work, we make the implementa- tion of the\nalgorithms studied in this paper publicly available as part of the Menpo\nProject.","authors":["Joan Alabort-i-Medina","Stefanos Zafeiriou"],"meta":["January 2017International Journal of Computer Vision 121(1)","DOI:10.1007/s11263-016-0916-3","SourcearXiv"],"references":["283130839_Fast_Newton_active_appearance_models","279955482_Menpo_A_Comprehensive_Platform_for_Parametric_Image_Alignment_and_Visual_Deformable_Models","276208180_Feature-Based_Lucas-Kanade_and_Active_Appearance_Models","319770820_Histograms_of_Oriented_Gradients_for_Human_Detection","314408260_On_compositional_Image_Alignment_with_an_application_to_Active_Appearance_Models","304469163_Unifying_holistic_and_Parts-Based_Deformable_Model_fitting","288507924_Project-Out_Cascaded_Regression_with_an_application_to_face_alignment","286594856_Bayesian_Active_Appearance_Models","285953747_Gauss-Newton_Deformable_Part_Models_for_Face_Alignment_In-the-Wild","277639242_Rationalizing_Efficient_Compositional_Image_Alignment_The_Constant_Jacobian_Gauss-Newton_Optimization_Algorithm"]}