{"id":"289464112_Problem_Solving_-_LargeSmall_HardEasy_ConsciousNonconscious_Problem-SpaceProblem-Solver_The_Issue_of_Dichotomization","abstract":"The chapters in this volume, together and separately, make a convincing case that problem solving is an extraordinarily broad, perhaps all-encompassing, and somewhat daunting domain. In dealing with the challenges presented by the breadth of the domain, they virtually all follow a broadly similar strategy that is hinted at in the title of this chapter. Each chapter implements this strategy differently, but when taken together, the chapters provide an illuminating approach to this difficult subject. The breadth of issues that affect problem solving is revealed by the range of chapter topics, which includes motivation, creativity, emotion, transfer of knowledge, language parsing, intellectual ability, expertise, and many more topics or issues involved in the study of problem solving. The range is daunting, but the collection of chapters nonetheless forms a book that coheres and brings together a vast collection of findings and theories that illuminate this central aspect of our thinking. The breadth arises from the fact that problem solving is essentially synonymous with thinking, and thinking is in one manner or another affected by virtually all of the equipment a person brings to bear on a problem, as well as the full range of environmental influences that define the problem, its problem space, and its solution. Despite this incredible breadth and the resultant different foci of the chapters, the authors present a number of common themes or perspectives that help bring coherence to the volume.","authors":["Kenneth Kotovsky"],"meta":["June 2003","DOI:10.1017/CBO9780511615771.013"],"references":["232541388_Feeling_of_Knowing_in_Memory_and_Problem_Solving","9510534_Human_Acquisition_of_Concepts_For_Sequential_Patterns","272088622_Sciences_of_The_Artificial","258128228_Unconscious_Insights","254224085_On_the_Relationship_Between_Task_Performance_and_Associated_Verbalisable_Knowledge","232575520_Why_Are_Some_Problems_Hard_Evidence_from_Tower_of_Hanoi","232504735_Implicit_Learning_in_Problem_Solving_The_Role_of_Working_Memory_Capacity","232466586_Factorial_Studies_of_Intelligence","223921659_What_Makes_Some_Problems_Really_Hard_Explorations_in_the_Problem_Space_and_Difficulty","223140136_Empirical_tests_of_a_theory_of_human_acquisition_of_concepts_for_sequential_patterns"]}