{"id":"289555278_How_the_machine_'thinks_Understanding_opacity_in_machine_learning_algorithms","abstract":"This article considers the issue of opacity as a problem for socially consequential mechanisms of classification and ranking, such as spam filters, credit card fraud detection, search engines, news trends, market segmentation and advertising, insurance or loan qualification, and credit scoring. These mechanisms of classification all frequently rely on computational algorithms, and in many cases on machine learning algorithms to do this work. In this article, I draw a distinction between three forms of opacity: (1) opacity as intentional corporate or state secrecy, (2) opacity as technical illiteracy, and (3) an opacity that arises from the characteristics of machine learning algorithms and the scale required to apply them usefully. The analysis in this article gets inside the algorithms themselves. I cite existing literatures in computer science, known industry practices (as they are publicly presented), and do some testing and manipulation of code as a form of lightweight code audit. I argue that recognizing the distinct forms of opacity that may be coming into play in a given application is a key to determining which of a variety of technical and non-technical solutions could help to prevent harm.","authors":["Jenna Burrell"],"meta":["January 2016Big Data & Society 3(1)","DOI:10.1177/2053951715622512"],"references":["346624964_The_Black_Box_Society_The_Secret_Algorithms_That_Control_Money_and_Information","331748540_The_Digital_Reproduction_of_Inequality","330332396_Spam_A_Shadow_History_of_the_Internet","329647956_Digital_Dead_End_Fighting_for_Social_Justice_in_the_Information_Age","323983704_Big_Data's_Disparate_Impact","318265141_Classification_situations_Life-chances_in_the_Neoliberal_Era","309043557_The_Relevance_of_Algorithms","290334907_Turing_maturing","286575597_Invisible_Users_Youth_in_the_Internet_Cafes_of_Urban_Ghana","282670710_Seeing_the_Sort_The_Aesthetic_and_Industrial_Defense_of_The_Algorithm"]}