{"id":"289573356_Application_of_word_co-occurrence_analysis_method_in_mapping_of_the_scientific_fields_case_study_the_field_of_Informetrics","abstract":"Purpose\n– The purpose of this article is to investigate the use of word co-occurrence analysis method in mapping of the scientific fields with emphasis on the field of Informetrics.\n\nDesign/methodology/approach\n– This is an applied study using scientometrics, co-word analysis and network analysis and its steps are summarised as follows: collecting the data related to the Informetrics field indexed in Web of Science (WOS) database, refining and standardising the keywords of the extracted articles from WOS and preparing a selected list of these keywords, drawing the word co-occurrence map in the Informetrics field and analysing of results.\n\nFindings\n– Based on the resulted maps the concepts such as information science, library, bibliometric analysis, innovation and text mining are the most widely used topics in the field of Informetrics. The co-word occurrence maps drawn at different periods show the changes and stabilities in the concepts related to the field of Informetrics. A number of topics such as “bibliometric analysis” are present in all years, whereas others such as “innovation” have disappeared. New topics emerge as a recombination of existing topics and in interaction with new (technological) developments.\n\nOriginality/value\n– The results of these analytical studies can be used as a guide for determining research priorities in the scientific fields, and also for planning and management in academic institutions.","authors":["Mehri Sedighi"],"meta":["February 2016Library Review 65(1/2):52-64","DOI:10.1108/LR-07-2015-0075"],"references":["272641661_Analysis_Of_Hotspots_In_The_Field_Of_Domestic_Knowledge_Discovery_Based_On_Co-Word_Analysis_Method","257663155_Doctoral_Dissertations_of_Library_and_Information_Science_in_China_A_Co-word_Analysis","313502007_Mapping_the_intellectual_structure_of_scientometrics_a_co-word_analysis_of_the_journal_Scientometrics_2005-2010","313047599_Mapping_of_science_by_combined_co-citation_and_word_analysis_i_Structural_aspects","281222460_Software_engineering_as_seen_through_its_research_literature_A_study_in_co-word_analysis","278395899_Mapping_the_intellectual_structure_of_scientometrics_a_co-word_analysis_of_the_journal_Scientometrics_2005-2010","275998310_Mapping_the_Dynamics_of_Science_and_Technology_Sociology_of_Science_in_the_Real_World","269657812_The_Social_Function_of_Science","257663408_A_co-word_analysis_of_library_and_information_science_in_China","257033425_Historical_scientometrics_Mapping_over_70_years_of_biological_safety_research_with_coword_analysis"]}