{"id":"289529742_A_Survey_on_Feature_Drift_Adaptation","abstract":"Mining data streams is of the utmost importance due to its appearance in many real-world situations, such as: sensor networks, stock market analysis and computer networks intrusion detection systems. Data streams are, by definition, potentially unbounded sequences of data that arrive intermittently at rapid rates. Extracting useful knowledge from data streams embeds virtually all problems from conventional data mining with the addition of single-pass real-time processing within limited time and memory space. Additionally, due to its ephemeral nature, it is expected that streams undergo changes in its data distribution denominated concept drifts. In this work, we focus on one specific kind of concept drift that has not been extensively addressed in the literature, namely feature drift. A feature drift happens when changes occur in the set of features, such that a subset of features become, or cease to be, relevant to the learning problem. Specifically, changes in the relevance of features directly imply modifications in the decision boundary to be learned, thus the learner must detect and adapt to according to it. Timely detection and recover from feature drifts is a challenging task that can be modeled after a dynamic feature selection problem. In this paper we survey existing work on dynamic feature selection for data streams that acts either implicitly or explicitly. We conclude that there is a need for future research in this area, which we highlight as future research directions.","authors":["Jean Paul Barddal","Heitor Murilo Gomes","Fabrício Enembreck"],"meta":["November 2015","DOI:10.1109/ICTAI.2015.150","Conference: 2015 IEEE 27th International Conference on Tools with Artificial Intelligence (ICTAI)At: Vietri Sul Mare, Italy"],"references":["299056991_Incremental_Rule_Learning_and_Border_Examples_Selection_from_Numerical_Data_Streams","281274483_SNCStream_a_social_network-based_data_stream_clustering_algorithm","278705754_Lecture_Notes_in_Computer_Science","269776374_A_Survey_on_Data_Stream_Clustering_and_Classification","346063577_Learning_Decision_Lists","316600283_Data_Mining_Concepts_and_Techniques","313528811_Duplicate_detection_in_click_streams","303206384_Data_Mining_Concepts_and_Techniques","303132448_Outlier_detection_for_temporal_data","269305355_Feature_Selection_Algorithm_for_Improving_the_Performance_of_Classification_A_Survey"]}