{"id":"289587443_Absolute_Trust_Algorithm_for_Aggregation_of_Trust_in_Peer-to-_Peer_Networks","abstract":"To mitigate the attacks by malicious peers and to motivate the peers to share\nthe resources in peer-to-peer networks, several reputation systems have been\nproposed in the past. In most of them, the peers evaluate other peers based on\ntheir past interactions and then aggregate this information in the whole\nnetwork. However such an aggregation process requires approximations in order\nto converge at some global consensus. It may not be the true reflection of past\nbehavior of the peers. Moreover such type of aggregation gives only the\nrelative ranking of peers without any absolute evaluation of their past. This\nis more significant when all the peers responding to a query, are malicious. In\nsuch a situation, we can only know that who is better among them without\nknowing their rank in the whole network. In this paper, we are proposing a new\nalgorithm which accounts for the past behavior of the peers and will estimate\nthe absolute value of the trust of peers. Consequently, we can suitably\nidentify them as a good peers or malicious peers. Our algorithm converges at\nsome global consensus much faster by choosing suitable parameters. Because of\nits absolute nature it will equally load all the peers in network. It will also\nreduce the inauthentic download in the network which was not possible in\nexisting algorithms.","authors":["Sateesh Awasthi","Yatindra Singh"],"meta":["January 2016IEEE Transactions on Dependable and Secure Computing PP(99)","DOI:10.1109/TDSC.2020.2977641","SourcearXiv"],"references":["260586977_SORT_A_Self-ORganizing_Trust_Model_for_Peer-to-peer_Systems","240426917_Zipf's_Law_and_the_Internet","228057545_Chord_A_scalable_peer-to-peer_lookup_protocol_for_Internet_applications","314801274_Managing_trust_in_a_peer-2-peer_information_system","268676579_Matrices_Theory_and_applications","260357584_PowerTrust_A_Robust_and_Scalable_Reputation_System_for_Trusted_Peer-to-Peer_Computing","248829924_Chord_a_scalable_peer_-_to_-_peer_lookup_service_for_internet_applica_-_tions","244277937_Peertrust_Supporting_reputation_-based_trust_in_peer-to-peer_communities","242443041_Non-Negative_Matrices_and_Markov_Chains","232657017_Scalable_Feedback_Aggregating_SFA_Overlay_for_Large-Scale_P2P_Trust_Management"]}