{"id":"289568810_Toward_Social-Semantic_Recommender_Systems","abstract":"In this article, we consider the basic problem in recommender systems that consists in identifying a set of users to whom a given item is to be recommended. In practice recommender systems are run against huge sets of users, and the problem is then to avoid scanning the whole user set in order to produce the recommendation list. In order to cope with problem, we consider that users are connected through a social network and that a taxonomy over the items has been defined. These two kinds of information, respectively called social and semantic information, are combined in our approach in order to compute recommendation lists by visiting a limited part of the social network. In doing so, our contribution is to propose recommendation algorithms that outperform existing approaches, while producing recommendation lists of similar accuracy. In our experiments, we use two real data sets to test our algorithms, namely Amazon.com and Movie-Lens data sets, and we compare our algorithms with the standard item-based collaborative filtering and hybrid recommendation algorithms. Our results show a satisfying accuracy values and a very significant improvement of performance, by exploring a small part of the graph instead of exploring all the graph as the classical searching methods do.","authors":["Dalia Sulieman","Maria Malek","Kadima Hubert","Dominique Laurent"],"meta":["December 2016International Journal of Information Systems and Social Change 7(1):1-30","DOI:10.4018/IJISSC.2016010101"],"references":["263377228_Hybrid_Recommender_Systems_Survey_and_Experiments","314828665_A_graph-based_recommender_system_for_digital_library","314818849_Graph-based_ranking_algorithms_for_e-mail_expertise_analysis","308953917_Amazon_com_recommendations_Item-to-item_collaborative_filtering","304374264_Centrality_in_social_networks_Conceptual_clarification","301222357_Toward_the_next_generation_of_recommender_systems_A_survey_of_the_state-of-the-art_and_possible_extensions","293639805_Race_School_Integration_and_Friendship_Segregation_in_America","280566512_Networks_An_Introduction","280113639_Hybrid_Web_Recommender_Systems","278797623_Exploiting_Semantic_and_Social_Information_in_Recommendation_Algorithms"]}