{"id":"289529654_A_Complexity_Science_perspective_on_Human_Mobility","abstract":"Fueled by big data collected by a wide range of high-throughput tools and technologies, a new wave of data-driven, interdisciplinary science has rapidly proliferated during the past decade, impacting a wide array of disciplines, from physics and computer science to cell biology and economics. In particular, the ICTs are inundating us with huge amounts of information about human activities, offering access to observing and measuring human behavior at an unprecedented level of detail. These large-scale data sets, offering objective description of human activity patterns, have started to reshape, and are expected to fundamentally alter, our discussions on quantifying and understanding human behavior. An impressive shift has been witnessed in statistical physics and complex system theory since the beginning of the new millennium, when the possibility of analyzing large data sets of human activities and social interactions boosted a renewed interest in the study of human mobility on one side, and of social networks on the other side. The understanding of how objects move, and humans in particular, is a longstanding challenge in the natural sciences, since the seminal observations by Robert Brown in the nineteenth century, but it has attracted particular interest in recent years, due to the data availability and to the relevance of the topic in various domains, from urban planning and virus spreading to emergency response.","authors":["Fosca Giannotti","Luca Pappalardo","Dino Pedreschi","Dashun Wang"],"meta":["October 2013","DOI:10.1017/CBO9781139128926.016","In book: Mobility Data: Modeling, Management, and Understanding (pp.297-314)Chapter: 15Publisher: Cambridge PressEditors: Chiara Renso, Stefano Spaccapietra, Esteban Zimányi"],"references":["221568307_Bridging_the_gap_between_physical_location_and_online_social_networks","220144630_Human_mobility_models_for_opportunistic_networks","49673985_Inferring_social_ties_from_geographic_coincidences","47278344_Modelling_the_scaling_properties_of_human_mobility","41486426_Limits_of_Predictability_in_Human_Mobility","283617410_Emergence_of_Scaling_in_Random_Networks","221654258_Friendship_and_Mobility_User_Movement_In_Location-Based_Social_Networks","216634741_The_Small_World_Problem","51992864_The_Strength_of_Weak_Ties","13660517_Collective_Dynamics_of_Small_World_Networks"]}