{"id":"289556927_On_Visualizing_Mixed-Type_Data_A_Joint_Metric_Approach_to_Profile_Construction_and_Outlier_Detection","abstract":"Survey data are usually of mixed type (quantitative, multistate categorical, and/or binary variables). Multidimensional scaling (MDS) is one of the most extended methodologies to visualize the profile structure of the data. Since the past 60s, MDS methods have been introduced in the literature, initially in publications in the psychometrics area. Nevertheless, sensitivity and robustness of MDS configurations have been topics scarcely addressed in the specialized literature. In this work, we are interested in the construction of robust profiles for mixed-type data using a proper MDS configuration. To this end, we propose to compare different MDS configurations (coming from different metrics) through a combination of sensitivity and robust analysis. In particular, as an alternative to classical Gower’s metric, we propose a robust joint metric combining different distance matrices, avoiding redundant information, via related metric scaling. The search for robustness and identification of outliers is done through a distance-based procedure related to geometric variability notions. In this sense, we propose a statistic for detecting multivariate outliers in the context of mixed-type data and evaluate its performance through a simulation study. Finally, we apply these techniques to a real data set provided by the largest humanitarian organization involved in social programs in Spain, where we are able to find in a robust way the most relevant factors defining the profiles of people that were under risk of being socially excluded in the beginning of the 2008 economic crisis.","authors":["Aurea Grane","Rosario Romera"],"meta":["January 2018Sociological Methods & Research 47(2):207-239","DOI:10.1177/0049124115621334"],"references":["324286003_Finding_Groups_in_Data_An_Introduction_to_Cluster_Analysis","312879591_Some_distance_properties_of_latent_root_and_vector_methods_used_in_multivariate_data_analysis","293143148_A_Survey_of_Sampling_from_Contaminated_Distributions_In_Contributions_to_Probability_and_Statistics","280294982_Chapter_25_Visualizing_Categorical_Data_with_Related_Metric_Scaling","272176868_Finding_Groups_in_Data_An_Introduction_to_Cluster_Analysis","270349089_Nonlinear_Multivariate_Analysis","270236622_Methods_for_Statistical_Data_Analysis_of_Multivariate_Observations","268619981_Distance_analysis_in_discrimination_and_classification_using_both_continuous_and_categorical_variables","266224006_Diversity_Its_measurement_decomposition_apportionment_and_analysis","264960376_A_Survey_of_Sampling_from_Contaminated_Distributions"]}