{"id":"289678199_Ict_training_courses_for_teacher_professional_development_in_jordan","abstract":"Information and Communication Technology (ICT) is increasingly having pervasive role and presence in the educational milieu as it continues to shape all aspects of our lives. Numerous reform projects have been in place aiming to infuse ICT across education systems. Teachers are widely believed to be the key agents of any educational change. Accordingly, the Jordanian Ministry of Education adopted several ICT training courses aiming to prepare teachers to integrate ICT effectively across the curriculum. The current study focuses on the conduct and effectiveness of ICT training courses within the Jordanian education system. Interviews, questionnaires, direct classroom observations, and field-notes of classroom practices were used for data collection. The findings suggest that ICT professional development courses for teacher were helping them to improve their ICT skills and knowledge. However, other finding highlighted problems regarding the conduct and the nature of these courses including timing and modes of training, follow-up, teacher's belief, school culture, workload, and motivation, appeared to impact the effectiveness of training courses.","authors":["Atef Abuhmaid"],"meta":["October 2011Turkish Online Journal of Educational Technology 10(4):195-210"],"references":["317953655_Designing_and_conducting_mixed_methods_research","317953471_Qualitative_Research_and_Case_Study_Applications_In_Education","313361608_School_improvement_through_information_and_communications_technology_Limitations_and_possibilities","307981791_Qualitative_evaluation_method","294164027_Creating_a_professional_development_plan","292543740_Change_Forces_With_A_Vengeance","288069260_Turning_Teachers_on_to_Computers","285850074_What_Social_Cognitive_Factors_Influence_Faculty_Members'_Use_of_Computers_for_Teaching_A_Literature_Review","273313944_Naturalistic_Inquiry_Sage","271672238_Superintendent_Conceptions_of_Institutional_Conditions_That_Impact_Teacher_Technology_Integration"]}