{"id":"289633501_What_should_majority_decision_mean","abstract":"“The legitimating force of the majority rule is so pervasive that we often do not notice it and rarely do we question it: We usually take it for granted.” So begins a recent article that goes on to state that majority rule “is much too powerful to make it vulnerable to a philosophical challenge.” It is our contention that majority rule as practiced has all too often failed to make the choice wished by the majority of voters (or members of a jury) in sometimes crucially important circumstances. Granted this fact - for which evidence is provided - there is no other course than to challenge the current philosophical view of what constitutes a majority decision and to propose a more solid alternative. But what exactly is it? What is (to use an equivalent expression more congenial to this book) a “majority decision”? Majority rule or decision should be, we believe, the answer to a specific, operationally pertinent question with which more than 50 percent of a jury or electorate can and does agree. The question posed is absolutely essential. Every democratic country and institution pretends to elect its representatives by a majority “principle,” though the precise rules by which it does so vary. The rules or methods of voting that are used differ in two ways: (1) how voters express their opinions - the inputs; and (2) how the various opinions are amalgamated into a collective judgment - the output, the numbers that measure the candidates “standing” and determine their order of finish, with the victor the first in the order. Every one of the methods is meant to be - and is commonly referred to being - a “majority decision.”","authors":["Michel Louis Balinski","Rida Laraki"],"meta":["January 2013","DOI:10.1017/CBO9781107286160.006"],"references":["6336103_A_Theory_of_Measuring_Electing_and_Ranking","288924762_Llull's_writings_on_electoral_systems","287006144_Approval_voting_evaluation_voting_An_experiment_during_the_2012_French_presidential_election","225367131_A_Nail-Biting_Election","24090949_On_The_Robustness_of_Majority_Rule","24064330_Analyzing_a_Nail-Biting_Election","7146734_The_Fairest_Vote_of_all"]}