{"id":"289607740_ASCII_based_GUI_system_for_Arabic_scripted_languages_A_case_of_Urdu","abstract":"From its advent, computer science is facing language-based problems; as English is considered being the most widely used communication language. Arabic Scripted Languages (ASLs) including Urdu have been considered less in this aspect. To rectify this problem, it is decided to build up the idea of interface designing for Arabic Scripted Language (ASL). All the algorithms and methods are used to develop a Graphical User Interface (GUI) for Urdu language, which belongs to the family of ASLs. This work presents a novel idea of designing an ASL interface for desktop application e.g., databases, applied for Urdu language. American Standard Code for Information Interchange (ASCII) codes been used for mapping the keystrokes to the Urdu character's images using Phonetic keyboard styles. Four fonts are created. The Urdu characters contained in these fonts are mapped through ASCII codes. The main goal achieved is to develop algorithm for Urdu desktop controls, which are the primary entity for its interface designing. Proposed algorithm facilitates the ordinary user to work in any ASL applications. Two implementations of the proposed method have been applied in this paper. This work presents a set of methods for new researchers to investigate these techniques for further improvement and for other ASLs.","authors":["Bacha Rehman","Zahid Halim","Mustaq Ahmad"],"meta":["July 2014International Arab Journal of Information Technology 11(4):329-337","Project: Novel Methodologies for Urdu Interface Design and Speech Recognition"],"references":["262164787_Benchmark_Database_and_GUI_Environment_for_Printed_Arabic_Text_Recognition_Research","245033301_A_Brief_History_of_Human_Computer_Interaction_Technology","224242074_Urdu_as_interface_design_language_-_A_novel_approach","224100165_Improving_Nastalique_specific_pre-recognition_process_for_Urdu_OCR","224090002_Lexical_functional_grammar_for_Urdu_modal_verbs","26556550_Converting_Standard_HTML_Input_Controls_to_Urdu","4084677_ASCII_based_transcription_systems_for_languages_with_the_Arabic_script_The_case_of_Persian","240033656_How_open_is_open_enough","224677982_A_Survey_of_Automatic_Urdu_Language_Processing","221615246_Concept_search_in_Urdu"]}