{"id":"289641785_Multiple_use_confidence_regions_in_multivariate_calibration","abstract":"The problem of multivariate calibration is considered in the setup where a normally distributed response variable is related to an explanatory variable through a multivariate linear model. The variance covariance matrix of the response variable is assumed to be a multiple of the identity matrix. The calibration data, that is, data obtained on the response variable corresponding to known values of the explanatory variable, are to be used for the construction of confidence regions for unknown values of the explanatory variable. The calibration problem addressed in this article deals with the construction of multiple use confidence regions; that is, the calibration data will be used repeatedly in order to construct a sequence of confidence regions for a sequence of unknown values of the explanatory variable. Such a procedure is characterized using two coverage probabilities, say 1 - α and 1 - β. Given that the confidence regions are constructed using the same calibration data, the proportion of confidence regions that include the true values of the corresponding parameters is to be at least 1 - β. The probability that the calibration data will provide 100(1 - β)% coverage is to be at least 1 - α. A multiple use confidence region is constructed using a pivot statistic that is a natural choice. The procedure is then generalized to linear models where the explanatory variable enters the model nonlinearly, such as in a polynomial regression model. The computational aspects and the practical implementation of our confidence region are illustrated in detail using two examples.","authors":["T. Mathew","W. Zha"],"meta":["September 1997Journal of the American Statistical Association 92(439):1141-1150","DOI:10.1080/01621459.1997.10474070"],"references":["263111972_Simultaneous_Tolerance_Intervals_for_the_Linear_Regression_Model","254332859_A_Quick_and_Easy_Multiple-Use_Calibration-Curve_Procedure","38360264_Confidence_Regions_in_Multivariate_Calibration","288855103_Constant-Width_Calibration_Intervals_for_Linear_Regression","269668650_Measuring_Marathon_Courses_An_Application_of_Statistical_Calibration_Theory","266725085_Interval_Estimates_in_the_Spectroscopic_Calibration_Problem","265671618_Statistical_Calibration_A_Review","254332992_Calibration_and_Simultaneous_Tolerance_Intervals_for_Regression","254332971_Errors-in-Variables_Estimation_in_Multivariate_Calibration","254332344_An_Implementation_of_the_Scheffe_Approach_to_Calibration_Using_Spline_Functions_Illustrated_by_a_Pressure-Volume_Calibration","38385235_A_Statistical_Theory_of_Calibration","38357522_An_Exact_Confidence_Region_in_Multivariate_Calibration","38348765_Conservative_confidence_regions_in_multivariate_calibration","17135808_Unlimited_Simultaneous_Discrimination_Intervals_in_Regression","16797011_Estimating_Fetal_Age_by_Ultrasound_Measurements_An_Example_of_Multivariate_Calibration"]}