{"id":"289772133_Analytical_modeling_of_heterogeneous_cellular_networks_Geometry_coverage_and_capacity","abstract":"This self-contained introduction shows how stochastic geometry techniques can be used for studying the behaviour of heterogeneous cellular networks (HCNs). The unified treatment of analytic results and approaches, collected for the first time in a single volume, includes the mathematical tools and techniques used to derive them. A single canonical problem formulation encompassing the analytic derivation of Signal to Interference plus Noise Ratio (SINR) distribution in the most widely-used deployment scenarios is presented, together with applications to systems based on the 3GPP-LTE standard, and with implications of these analyses on the design of HCNs. An outline of the different releases of the LTE standard and the features relevant to HCNs is also provided. A valuable reference for industry practitioners looking to improve the speed and efficiency of their network design and optimization workflow, and for graduate students and researchers seeking tractable analytical results for performance metrics in wireless HCNs.","authors":["Sayandev Mukherjee"],"meta":["January 2011","DOI:10.1017/CBO9781107279674"],"references":["261129804_Coverage_and_ergodic_rate_in_K-tier_downlink_heterogeneous_cellular_networks","224675613_A_Recursive_Algorithm_for_Gamma_Mixture_Models","224585428_Distributional_Properties_of_Euclidean_Distances_in_Wireless_Networks_Involving_Road_Systems","51937563_Downlink_Capacity_and_Base_Station_Density_in_Cellular_Networks","41448754_New_formulas_around_Laplace_transforms_of_quadratic_forms_for_general_Gaussian_sequences","224226914_Asymptotic_Analysis_of_Proportionally_Fair_Scheduling_in_Rayleigh_Fading","224175375_A_New_Statistical_Model_of_the_Complex_Nakagami-m_Fading_Gain","224167920_Investigating_the_Gaussian_Convergence_of_the_Distribution_of_the_Aggregate_Interference_Power_in_Large_Wireless_Networks","46888722_Tessellations"]}