{"id":"289712675_An_Extension_of_Business_Process_Model_and_Notation_for_Security_Risk_Management","abstract":"Business process modelling is one of the major aspects in the modern information system development. Recently business process model and notation (BPMN) has become a standard technique to support this activity. Typically the BPMN notations are used to understand enterprise's business processes. However, limited work exists regarding how security concerns are addressed during the management of the business processes. This is a problem, since both business processes and security should be understood in parallel to support a development of the secure information systems. In the previous work we have analysed BPMN with respect to the domain model of the IS security risk management (ISSRM) and showed how the language constructs could be aligned to the concepts of the ISSRM domain model. In this paper the authors propose the BPMN extensions for security risk management based on the BPMN alignment to the ISSRM concepts. We illustrate how the extended BPMN could express assets, risks and risk treatment on few running examples related to the Internet store regarding the asset confdentiality, integrity and availability. Our proposal would allow system analysts to understand how to develop security requirements to secure important assets defned through business processes. The paper opens the possibility for business and security model interoperability and the model transformation between several modelling approaches (if these both are aligned to the ISSRM domain model).","authors":["Olga Altuhhova","Raimundas Matulevičius","Naved Ahmed"],"meta":["October 2013International Journal of Information System Modeling and Design 4(4):93-113","DOI:10.4018/ijismd.2013100105"],"references":["267559037_Syntactic_and_Semantic_Extensions_to_Secure_Tropos_to_Support_Security_Risk_Management","265914679_Towards_SecureBPMN_-_Aligning_BPMN_with_the_Information_Assurance_and_Security_Domain","265206816_Security_Requirements_Engineering_for_Secure_Business_Processes","264890432_Towards_Definition_of_Secure_Business_Processes","262326060_Aligning_Mal-activity_Diagrams_and_Security_Risk_Management_for_Security_Requirements_Definitions","254860778_Risk_and_Business_Goal_Based_Security_Requirement_and_Countermeasure_Prioritization","250797780_Model-Based_Security_Analysis_in_Seven_Steps_-_a_Guided_Tour_to_the_CORAS_Method","288170514_Towards_Security_Risk-Oriented_Misuse_Cases","272536055_Eliciting_Security_Requirements_from_the_Business_Processes_Using_Security_Risk-Oriented_Patterns","259517239_Securing_Business_Processes_using_Security_Risk-oriented_Patterns"]}