{"id":"289770166_Guide_to_Advanced_Empirical_Software_Engineering","abstract":"Empirical studies have become an integral element of software engineering research and practice. This unique text/reference includes chapters from some of the top international empirical software engineering researchers and focuses on the practical knowledge necessary for conducting, reporting and using empirical methods in software engineering. Part 1, 'Research Methods and Techniques', examines the proper use of various strategies for collecting and analysing data, and the uses for which those strategies are most appropriate. Part 2, 'Practical Foundations', provides a discussion of several important global issues that need to be considered from the very beginning of research planning. Finally, 'Knowledge Creation' offers insight on using a set of disparate studies to provide useful decision support. Topics and features: Offers information across a range of techniques, methods, and qualitative and quantitative issues, providing a toolkit for the reader that is applicable across the diversity of software development contexts Presents reference material with concrete software engineering examples Provides guidance on how to design, conduct, analyse, interpret and report empirical studies, taking into account the common difficulties and challenges encountered in the field Arms researchers with the information necessary to avoid fundamental risks Tackles appropriate techniques for addressing disparate studies - ensuring the relevance of empirical software engineering, and showing its practical impact Describes methods that are less often used in the field, providing less conventional but still rigorous and useful ways of collecting data Supplies detailed information on topics (such as surveys) that often contain methodological errors This broad-ranging, practical guide will prove an invaluable and useful reference for practising software engineers and researchers. In addition, it will be suitable for graduate students studying empirical methods in software development.","authors":["F. Shull","Janice Singer","Dag I. K. Sjøberg"],"meta":["January 2008","DOI:10.1007/978-1-84800-044-5","ISBN: 978-1-84800-043-8"],"references":["221553940_Ensemble_of_missing_data_techniques_to_improve_software_prediction_accuracy","243048897_Nonparametric_Estimation_of_The_Survival_Distribution_in_Censored_Data","221554956_Conceptual_Simplicity_Meets_Organizational_Complexity_Case_Study_of_a_Corporate_Metrics_Program","221440409_Empirical_estimates_of_software_availability_of_deployed_systems","4105019_An_evaluation_of_k-nearest_neighbour_imputation_using_Likert_data"]}