{"id":"289726586_L'integration_d'instruments_informatiques_dans_l'enseignement_Une_approche_par_les_techniques","abstract":"The use of graphical and symbolic facilities in the teaching and learning of algebra and calculus will soon be a reality. Authors who write about the introduction of these instruments often claim that new technology is able to redress the imbalance between skill-dominated conceptions of school mathematics in favour of understanding. More recently some have stressed that 'experimental mathematics' traditionally the reserve of mathematical research may be incorporated into the teaching and learning of mathematics. This paper looks into these two ideas and shows that they conceal an essential dimension: techniques play an important role in mathematical activity, intermediate between tasks and theories. This paper draws on research studies on the introduction of symbolic systems on computers and calculators and considers 'new' techniques that accompany new technological instruments, their role in conceptualising and their links with 'usual' paper/pencil techniques, as a key to analyse the role of technology in education. This view implies non obvious tasks for the teacher in the introduction of technology: the design of praxcologies adapted to new instrumental settings and everyday action on students' techniques.","authors":["Jean-Baptiste Lagrange"],"meta":["July 2000Educational Studies in Mathematics 43(1):1-30"],"references":["337648301_Complex_calculators_in_the_classroom_theoretical_and_practical_reflections_on_teaching_pre-calculus","228769070_Evolucion_de_la_didactica_de_las_matematicas_como_disciplina_cientifica","331762285_The_Research_Agenda_in_Algebra_A_Curriculum_Development_Perspective","331747996_The_Research_Agenda_Conference_on_Algebra_Background_and_Issues","292702896_L'analyse_des_pratiques_enseignantes_en_theorie_anthropologique_du_didactique","276935465_La_transposition_didactique","246750187_Making_Sense_of_Experimental_Mathematics","243776627_Resequencing_skills_and_concepts_in_applied_calculus_using_the_computer_as_tool_Journal_for_Research_in_Mathematics_Education_19_3-25","240069432_Jeu_de_Cadres_et_Dialectique_Outil-objet","234700255_Techniques_and_Concepts_in_Pre-calculus_Using_CAS_A_Two_Year_Classroom_Experiment_with_the_TI-92"]}