{"id":"289814513_Social_Belonging_and_the_Motivation_and_Intellectual_Achievement_of_Negatively_Stereotyped_Students","abstract":"An important consequence of negative stereotypes that impugn non-Asian ethnic minorities' intellectual ability and women's mathematical ability is to convey to the targets of these stereotypes that they are not seen as individuals, that they may not be fully valued or respected-that they may not belong-in academic settings. In this chapter, we review research demonstrating that people who contend with numeric underrepresentation and with negative stereotypes in mainstream academic and professional arenas are vigilant for cues that could communicate they do not belong or are not fully included in these settings. When encountered, such cues can undermine people's sense of belonging, motivation, and achievement. Further, this chapter reviews effective remedies-strategies to buttress students' sense of social belonging in academic environments. These strategies aim to forestall negative attributions for social events in school-to lead students to see social adversity as normal and nondiagnostic of a lack of belonging. As tested in randomized intervention field experiments, variants of this intervention have improved school outcomes among black college students, black middle school students, and female engineering students, even over long periods of time. A 1- hour-long social-belonging intervention delivered in students' freshman year improved black students' college grades from sophomore through senior year, and reduced the achievement gap between black and white students over this period by 52%. Implications for psychological process, for stereotype threat, and for efforts to ameliorate social inequality are discussed.","authors":["Gregory M. Walton","Priyanka B. Carr"],"meta":["January 2012","DOI:10.1093/acprof:oso/9780199732449.003.0006"],"references":["279426957_Improving_the_Academic_Performance_of_College_Students_with_Brief_Attributional_Interventions","226519029_Effects_of_Salient_Multiple_Identities_on_Women's_Performance_Under_Mathematics_Stereotype_Threat"]}