{"id":"289826564_But_I'm_Not_Good_at_Math_The_Changing_Salience_of_Mathematical_Self-Concept_in_Shaping_Women's_and_Men's_STEM_Aspirations","abstract":"Math self-concept (MSC) is considered an important predictor of the pursuit of science, technology, engineering and math (STEM) fields. Women's underrepresentation in the STEM fields is often attributed to their consistently lower ratings on MSC relative to men. Research in this area typically considers STEM in the aggregate and does not account for variations in MSC that may exist between STEM fields. Further, existing research has not explored whether MSC is an equally important predictor of STEM pursuit for women and men. This paper uses a national sample of male and female entering college students over the past four decades to address how MSC varies across STEM majors over time, and to assess the changing salience of MSC as a predictor of STEM major selection in five fields: biological sciences, computer science, engineering, math/statistics, and physical sciences. Results reveal a pervasive gender gap in MSC in nearly all fields, but also a great deal of variation in MSC among the STEM fields. In addition, the salience of MSC in predicting STEM major selection has generally become weaker over time for women (but not for men). Ultimately, this suggests that women's lower math confidence has become a less powerful explanation for their underrepresentation in STEM fields.","authors":["Linda J. Sax","M. Allison Kanny","Tiffani Riggers-Piehl","Hannah Whang"],"meta":["December 2015Research in Higher Education 56(8):813-842","DOI:10.1007/s11162-015-9375-x"],"references":["306145850_Social_cognitive_career_theory","303257953_Social_cognitive_career_theory","332640002_Occupational_Choice_An_Approach_to_a_General_Theory","318780323_Rising_above_the_gathering_storm_revisited_Rapidly_approaching_category_5","316823281_Self-efficacy_the_exercise_of_control","314719872_Effects_of_single-sex_and_coeducational_schools_A_response_to_Lee_and_Bryk","313570385_Circumscription_and_compromise_a_developmental_theory_of_occupational_aspirations","310750355_Expectancy-value_theory_of_achievement_motivation","297199579_GLOBAL_SELF-ESTEEM_-_ITS_RELATION_TO_SPECIFIC_FACETS_OF_SELF-CONCEPT_AND_THEIR_IMPORTANCE","292937643_Science_technology_engineering_and_mathematics_STEM_education_A_primer"]}