{"id":"289805286_Type_of_questions_-_The_case_of_computer_science","abstract":"In this paper, I explore and discuss the variety of types of questions that can be used by computer science educators in different teaching situations and processes: in classroom lessons, in the computer lab, as homework, or in tests. The use of various types of questions offers many advantages, both for learners and for the teaching process. Twelve different types of question are discussed. Each is presented by its classification title, a short description of the specific type of question, a concrete example or an example pattern, and a short pedagogical discussion that includes remarks on cognitive aspects. Three general types of questions are presented and discussed: combination questions, narrative questions, and closed questions. These types of questions relate to \"programming-like\" assignments since they are the most common subject encountered in the teaching of computer science (Java is used as the implementation language). However, as discussed here in brief, most of the question types are also suitable for most other contents in the teaching of computer science.","authors":["Noa Ragonis"],"meta":["January 2012","Project: Computer Science Education"],"references":["230751877_Bloom's_taxonomy_for_CS_assessment","224088695_Relationship_between_examination_questions_and_bloom's_taxonomy","314796621_Question_types_in_digital_reference_an_evaluation_of_question_taxonomies","314796218_The_novice_programmers'_syndrome_of_design-by-keyword","275507958_Experiences_with_marmoset","259703192_Information_problem_solving_by_experts_and_novices_Analysis_of_a_complex_cognitive_skill","255570709_Research_and_Design_of_Test_Question_Database_Management_System_Based_on_the_Three-Tier_Structure","242286304_A_role-based_analysis_model_for_the_evaluation_of_novices'_programming_knowledge_development","235465787_A_Taxonomy_for_Learning_Teaching_and_Assessing_A_Revision_of_Bloom's_Taxonomy_of_Educational_Objectives","221538366_Evaluating_programming_ability_in_an_introductory_computer_science_course"]}