{"id":"289885567_Assistive_technology_use_and_abandonment_among_college_students_with_disabilities","abstract":"The use of assistive technology by college students with disabilities is a necessary tool to enhance their academic success. Many individuals with disabilities, however, discontinue use of their technology. Discontinuance represents a waste of functional abilities and a disadvantage to college students with disabilities. The purpose of this study was to report the rate of use and abandonment of assistive technology among college students with disabilities. Fifty-three college students with various disabilities participated in a survey on assistive technology device use and abandonment across the domains of home, school, recreation, leisure, hearing, vision, and mobility. Results showed that a total of 51 devices were abandoned across all domains. School was the domain with the highest rate of use and the second highest rate of abandonment. The mobility domain represented the second largest number of devices used and the largest number of devices abandoned. These findings demonstrate that college students are using assistive technology devices for school and mobility. However, they are also abandoning them at a high rate.","authors":["M.L. Riemer-Reiss","Robbyn Wacker"],"meta":["December 1999International Electronic Journal for Leadership in Learning 3"],"references":["292805772_Assistive_Technology_in_Rehabilitation","258166107_Assistive_Technology_and_Adults_with_Learning_Disabilities_A_Blueprint_for_Exploration_and_Advancement","249346715_Computers_assistive_devices_and_augmentative_communication_aids_Technology_for_social_inclusion","233148288_Special_Facilities_and_Services_for_University_Students_with_Mobility_Impairment_A_Demographic_Study_USA","21669070_Job_roles_of_assistive_technology_service_providers_in_the_United_States","13146818_Consumer_Participation_in_Identifying_Research_and_Development_Priorities_for_Power_Wheelchair_Input_Devices_and_Controllers"]}