{"id":"289991565_Digital_Literacy_Learning_System_for_Indonesian_Citizen","abstract":"Today, Indonesian citizen experience a fast changing lifestyle related to information and communication technology (ICT) utility, such as gadget and internet. The ease of information and knowledge retrieval to support learning process comes with problems to be taken care of such as information overload, negative content, netiquette negligence, and gadget addiction. Meanwhile, Indonesia will face an upcoming challenge in the economic sector, Free Trade Area of the Asia-Pacific (FTAAP) in 2020. An initiative for economic integration uses ICT as economic hub to promote every sector growth in economy. A concept explored in this research context to answers those problems mentioned above and to overcome the upcoming challenge is improving quality of Indonesian human resources through digital literacy education. This paper discusses a learning system model dedicated to deliver digital literacy education to the Indonesian citizen. Objectives of this research are increasing awareness towards digital literacy concept and preparing citizen to be digitally literate and competent using ICT to support their learning process, doing their work more effective and efficient, and preparing Indonesian young generation to become qualified workforce competing in FTAAP 2020, furthermore international work competition. This paper delivers analysis for learning system model as a result from the initial research of research series about digital literacy education in Indonesia. Resulting model justified by sets of detailed scenario about how this model works.","authors":["Amalia Rahmah"],"meta":["December 2015Procedia Computer Science 72:94-101","DOI:10.1016/j.procs.2015.12.109","Project: Digital Literacy"],"references":["257719836_Data_Information_Knowledge_Wisdom_and_Meta-Synthesis_of_Wisdom-Comment_on_Wisdom_Global_and_Wisdom_Cities","228381038_Bloom's_Digital_Taxonomy","201168946_Design_Science_in_Information_Systems_Research","7131259_Understanding_knowledge_effects_on_attitude-behavior_consistency_The_role_of_relevance_complexity_and_amount_of_knowledge","257171162_Can_we_teach_digital_natives_digital_literacy","32938321_DigEuLit_-_a_European_Framework_for_Digital_Literacy_a_Progress_Report"]}