{"id":"290189993_The_Impact_of_Stock_Market_Performance_upon_Economic_Growth","abstract":"The main purpose of this study was to explore the causal link between stock market performance and economic growth in terms of a simple theoretical and empirical literature framework. Researchers hold diverse opinions regarding the importance of stock markets playing a significant role in economic growth processes by performing the following functions: improving liquidity, aggregating and mobilising capital, observing managers and exerting corporate control, providing risk-pooling and sharing services including investment levels. The growing theoretical literature argues that stock markets are crucially linked to economic growth. The findings suggest a positive relationship between efficient stock markets and economic growth, both in short run and long run and there is evidence of an indirect transmission mechanism through the effect of stock market development on investment. They are seen as providing a service that boosts economic growth. The results are consistent with the theoretical and empirical predictions.","authors":["Najeb Masoud"],"meta":["December 2013International Journal of Economics and Financial Issues 3(4):788-798","Project: Corporate Social Responsibility and Company Performance: An Empirical Analysis of Jordanian Companies Listed on Amman Stock Exchange"],"references":["327426817_A_General_Equilibrium_Approach_To_Monetary_Theory","324340913_Money_in_a_Theory_of_Finance","298571842_Financial_Aspects_of_Economic_Development","284061601_Bank-based_and_market-based_financial_systems_Cross-country_comparisons","274939368_Financial_Structure_and_Development","274933998_The_Stock_Market","270319290_Investment_Analysis_and_Management","270205416_Money_in_a_Theory_of_Finance","261905508_International_Securities_and_Capital_Markets","227469692_Stock_and_Bond_Issues_and_Capital_Markets_in_Less_Developed_Countries_Emissions_d'actions_et_d'obligations_et_marchACs_des_capitaux_dans_les_pays_peu_dACveloppACs_Las_emisiones_de_acciones_y_bonos_y_l"]}