{"id":"290195501_AIRBORNE_HYPERSPECTRAL_SCANNER_AHS_MAPPING_CAPACITY_SIMULATION_FOR_THE_DONANA_BIOLOGICAL_RESERVE_SCRUBLANDS","abstract":"Spatial patterns of vegetation species abundance is required for flora conservation strategies of natural areas. Hyperspectral imagery is an increasingly relevant tool for vegetation mapping although results obtained are very dependent on species spectral differences and sensor characteristics. Throughout the Stabilized Sands of Doñana Biological Reserve, (Doñana National Park, SW Spain), three scrubland communities are distributed according to groundwater level variations which are determined by dune topography. The Airborne Hyperspectral Scanner (AHS) is a VIS to TIR 80 band line-scanner that is going to be applied for mapping the shrub species pattern of this eolian ecosystem. The spectral similarity among species and broad reflectance ranges due to intra-species variations of Leaf Area Index (LAI) are important drawbacks encountered for the mapping effort. In this work the AHS capacity to discriminate these two factors is assessed using field spectrometry and Plant Area Index (PAI) measurements. An analysis of the field reflectance spectra of all species presented showed low spectral separability at intra-community level, and for the most representative species (Erica scoparia, Halimium halimifolium, Rosmarinus officinalis, Ulex australis and Stauracanthus genistoides) the last two species show the minimum reflectance variability due to PAI ranges. Both drawbacks were analysed in terms of Noise Equivalent Difference Radiance (NEdL) of an AHS flight line, and the conclusion is that AHS discrimination values for scrub species at a specific flight conditions consider, show a high mapping capacity among communities but medium capacity for intra-community level","authors":["Marcos Jiménez Michavila","R. Díaz-Delgadob","P. Vaughana","Angela De Santis"],"meta":["March 2007","Conference: 10th Intl. Symposium on Physical Measurements and Signatures in Remote SensingAt: Davos, Switzerland"],"references":["263445176_Mapping_Chaparral_in_the_Santa_Monica_Mountains_Using_Multiple_Endmember_Spectral_Mixture_Models","260055130_Performance_Requirements_for_Airborne_Imaging_Spectrometers","51997204_Leaf_Area_Index_of_Boreal_Forests_Theory_Techniques_and_Measurements","303172811_Measuring_biological_diversity_Measuring_biological_diversity","263759519_Biophysical_and_Biochemical_Sources_of_Variability_in_Canopy_Reflectance","260051846_Spectral_characterization_of_Australian_arid_zone_plants","223954101_Simulation_of_hyperspectral_and_directional_radiance_images_using_coupled_biophysical_and_atmospheric_radiative_transfer_models"]}