{"id":"290180954_IMU_Preintegration_on_Manifold_for_Efficient_Visual-Inertial_Maximum-a-Posteriori_Estimation","abstract":"Recent results in monocular visual-inertial navigation (VIN) have shown that optimization-based approaches outperform filtering methods in terms of accuracy due to their capability to relinearize past states. However, the improvement comes at the cost of increased computational complexity. In this paper, we address this issue by preintegrating inertial measurements between selected keyframes. The preintegration allows us to accurately summarize hundreds of inertial measurements into a single relative motion constraint. Our first contribution is a preintegration theory that properly addresses the manifold structure of the rotation group and carefully deals with uncertainty propagation. The measurements are integrated in a local frame, which eliminates the need to repeat the integration when the linearization point changes while leaving the opportunity for belated bias corrections. The second contribution is to show that the preintegrated IMU model can be seamlessly integrated in a visual-inertial pipeline under the unifying framework of factor graphs. This enables the use of a structureless model for visual measurements, further accelerating the computation. The third contribution is an extensive evaluation of our monocular VIN pipeline: experimental results confirm that our system is very fast and demonstrates superior accuracy with respect to competitive state-of-the-art filtering and optimization algorithms, including off-the-shelf systems such as Google Tango","authors":["Christian Forster","Luca Carlone","Frank Dellaert","Davide Scaramuzza"],"meta":["January 2015"],"references":["314578434_IMU_Preintegration_on_Manifold_for_Efficient_Visual-Inertial_Maximum-a-Posteriori_Estimation","289074415_Mining_Structure_Fragments_for_Smart_Bundle_Adjustment","319770298_A_Mathematical_Introduction_to_Robotic_Manipulation","304048096_Autonomous_Navigation_in_Complex_Indoor_and_Outdoor_Environments_with_Micro_Aerial_Vehicles","303968951_Camera_Trajectory_Estimation_using_Inertial_Sensor_Measurements_and_Structure_fom_Motion_Results","303123869_Parallel_tracking_and_mapping_for_small_AR_workspaces","286679991_C-KLAM_Constrained_keyframe-based_localization_and_mapping","284035616_Hamiltonian_and_gradient_flows_algorithms_and_control_Vol_3_Fields_Institute_Communications","283760484_Asynchronous_Adaptive_Conditioning_for_Visual-Inertial_SLAM","278651096_Stochastic_Models_Information_Theory_and_Lie_Groups_Volume_2"]}