{"id":"290211565_Private_algorithms_for_the_protected_in_social_network_search","abstract":"Motivated by tensions between data privacy for individual citizens and societal priorities such as counterterrorism and the containment of infectious disease, we introduce a computational model that distinguishes between parties for whom privacy is explicitly protected, and those for whom it is not (the targeted subpopulation). The goal is the development of algorithms that can effectively identify and take action upon members of the targeted subpopulation in a way that minimally compromises the privacy of the protected, while simultaneously limiting the expense of distinguishing members of the two groups via costly mechanisms such as surveillance, background checks, or medical testing. Within this framework, we provide provably privacy-preserving algorithms for targeted search in social networks. These algorithms are natural variants of common graph search methods, and ensure privacy for the protected by the careful injection of noise in the prioritization of potential targets. We validate the utility of our algorithms with extensive computational experiments on two large-scale social network datasets.","authors":["Michael Kearns","Aaron Roth","Zhiwei Steven Wu","Grigory Yaroslavtsev"],"meta":["January 2016Proceedings of the National Academy of Sciences 113(4):201510612","DOI:10.1073/pnas.1510612113"],"references":["275588217_Heterogeneous_Differential_Privacy","261054244_Coupled-Worlds_Privacy_Exploiting_Adversarial_Uncertainty_in_Statistical_Data_Privacy","230715954_Differentially_Private_Data_Analysis_of_Social_Networks_via_RestrictedSensitivity","225124717_Calibrating_Noise_to_Sensitivity_in_Private_Data_Analysis","220764838_Accurate_Estimation_of_the_Degree_Distribution_of_Private_Networks","308061191_The_Algorithmic_Foundations_of_Differential_Privacy","267191347_The_Algorithmic_Foundations_of_Differential_Privacy","262284573_Analyzing_Graphs_with_Node_Differential_Privacy","259298330_Blowfish_Privacy_Tuning_Privacy-Utility_Trade-offs_using_Policies","229157402_Mechanism_Design_in_Large_Games_Incentives_and_Privacy","228186062_A_Taxonomy_of_Privacy"]}