{"id":"290328469_Multi-threshold_wavelet_packet_de-noising_method_and_its_application_in_deformation_analysis","abstract":"In the field of deformation monitoring, the traditional wavelet de-noising method retains only the low frequency of useful information. It is easy to get rid of intermediate frequency and high frequency useful information. The wavelet packet analysis is a new kind of wavelet analysis method developed in recent years, which is a more subtle de-noising method for considering useful information of the various bands. The key of the wavelet packet de-noising is to select the appropriate threshold criteria and to process the wavelet packet decomposition coefficients by the threshold, but the researches using traditional wavelet packet de-noising method are not sufficient. This article is for the lack of traditional wavelet and wavelet packet analysis. According to the distribution of different signals and their noise, wavelet packet decomposition coefficients are arranged by the frequency order, and segmented in accordance with information type, to select the appropriate threshold criteria for each band and to perform threshold processing. It is the method of wavelet packet de-noising with multi-threshold criteria based on frequency order. The results show that this method can effectively remove the noise of each band through theoretical analysis and practical applications. The de-noising ability of this method is better than the other methods such as traditional wavelet de-noising or wavelet packet de-noising. Studies have shown that this method can preserve the useful information from the de-noising signal after de-noising when the sampling frequency is low. Therefore, it can be widely used in the field of high-precision deformation monitoring.","authors":["Zhetao Zhang","Jianjun Zhu","Cuilin Kuang","Cui Zhou"],"meta":["January 2014Acta Geodaetica et Cartographica Sinica 43(1):13-20","DOI:10.13485/j.cnki.11-2089.2014.0003"],"references":["297828025_Wavelet-based_analysis_technique_for_the_monitoring_of_tall_structure_under_normal_loading_using_GPS","293674965_Frequency-order_of_wavelet_packet","292698686_Kalman_filtering_model_of_dynamic_deformation_based_on_wavelet_analysis","289971120_GPS_INS_integrated_navigation_by_adaptive_filtering_based_on_wavelet_threshold_de-noising","289638778_Measurement_of_wind-induced_vibration_of_tall_buildings_using_GPS_and_wavelet_application","289302455_Feature_extraction_of_structure_natural_vibration_and_multipath_separation_based_on_wavelet_packet_decomposition","288859493_A_novel_method_for_reducing_noises_in_GPS_deformation_monitoring_system","288118601_A_hybrid_indicator_for_determining_the_best_decomposition_scale_of_wavelet_denoising","224677148_A_New_Thresholding_Method_in_Wavelet_Packet_Analysis_for_Image_De-noising"]}