{"id":"290395773_UniRef_Clusters_A_comprehensive_and_scalable_alternative_for_improving_sequence_similarity_searches","abstract":"Motivation: \nUniRef databases provide full-scale clustering of UniProtKB sequences and are utilized for a broad range of applications, particularly similarity-based functional annotation. Non-redundancy and intra-cluster homogeneity in UniRef were recently improved by adding a sequence length overlap threshold. Our hypothesis is that these improvements would enhance the speed and sensitivity of similarity searches and improve the consistency of annotation within clusters.\n\nResults: \nIntra-cluster molecular function consistency was examined by analysis of Gene Ontology terms. Results show that UniRef clusters bring together proteins of identical molecular function in more than 97% of the clusters, implying that clusters are useful for annotation and can also be used to detect annotation inconsistencies. To examine coverage in similarity results, BLASTP searches against UniRef50 followed by expansion of the hit lists with cluster members demonstrated advantages compared with searches against UniProtKB sequences; the searches are concise (∼7 times shorter hit list before expansion), faster (∼6 times) and more sensitive in detection of remote similarities (>96% recall at e-value <0.0001). Our results support the use of UniRef clusters as a comprehensive and scalable alternative to native sequence databases for similarity searches and reinforces its reliability for use in functional annotation.","authors":["Baris E Suzek","Yuqi Wang","Hongzhan Huang","Peter B Mcgarvey"],"meta":["March 2015Bioinformatics 31(6):926","DOI:10.1093/bioinformatics/btu739"],"references":["273590255_Basic_local_alignment_search_tool_BLAST","264352775_Genome_Sequence_of_the_Nematode_C_elegans_A_Platform_for_Investigating_BiologyThe_C_elegans_Sequencing_ConsortiumScience19982825396201220189851916","235778377_Increasing_Sequence_Search_Sensitivity_with_Transitive_Alignments","235747916_Update_on_activities_at_the_Universal_Protein_Resource_UniProt_in_2013UniProtConsortiumNucleic_Acids_Res201341D43D47353109423161681","235620664_VIROME_A_standard_operating_procedure_for_analysis_of_viral_metagenome_sequences","225293455_SIFT_web_Server_Predicting_Effects_of_Amino_acid_Substitutions_on_Proteins","224868902_Accurate_multiple_sequence_alignment_of_transmembrane_proteins_with_PSI-Coffee","321094874_Update_on_activities_at_the_Universal_Protein_Resource_UniProt_in_2013","259782363_The_Universal_Protein_Resource_UniProt_2009","222475256_The_Use_of_Receiver_Operating_Characteristic_ROC_Analysis_to_Evaluate_Sequence_Matching"]}