{"id":"290478437_Virtual_reality_training_system_for_maintenance_and_operation_of_high-voltage_overhead_power_lines","abstract":"The maintenance of high-voltage overhead power lines involves high-risk procedures; the accidents involving live lines maintenance can be lethal. This paper presents the architecture and main features of a novel non-immersive virtual reality training system for maintenance of high-voltage overhead power lines. The general aim of this work was to provide electric utilities a suitable workforce training system to train and to certify operators working in complex and unsafe environments. The developed system has three components: the virtual warehouse, interactive 3D environments, and a learning management system. The workforce training system consists of thirty-one maintenance maneuvers, including the application of different techniques and equipment designed for various structures. Additionally, the system, using 3D animations, illustrates the safety conditions required before starting the maintenance procedures. To fit the worker’s different skill levels, the system has three operation modes: learning, practice, and evaluation, which can be accessed according to the trainee’s level of knowledge. The system is currently used to train thousands of overhead power lines operators of an electric utility in Mexico. The system has demonstrated to be a cost-effective tool for transferring skills and knowledge to new workers while reducing the time and money invested in their training.","authors":["Andres Ayala","Galvan Israel","Gustavo Arroyo-Figueroa","Miguel Pérez-Ramírez"],"meta":["March 2016Virtual Reality 20(1)","DOI:10.1007/s10055-015-0280-6","Project: Virtual Reality"],"references":["313561081_Realidad_Virtual_Un_panorama_general","254584465_Using_Virtual_Reality_to_Enhance_Electrical_Safety_and_Design_in_the_Built_Environment","291737466_Comparison_of_video_trainer_and_virtual_reality_training_systems_on_acquisition_of_laparoscopic_skills","286181288_Vocational_education_research","269347545_Virtual_Reality_Training_Improves_Operating_Room_Performance_Results_of_a_Randomized_Double-Blinded_Study","267545183_Underground_cables_in_transmission_networks","261582891_Transfer_of_training_from_virtual_reality","261095477_Military_war_games_edutainment","254033056_Teleoperation_system_with_virtual_reality_based_on_stereo_vision","252027574_Interactive_3D_virtual_environments_for_industrial_operation_training_and_maintenance"]}