{"id":"290438719_Five_design_principles_for_crowdsourced_policymaking_Assessing_the_case_of_crowdsourced_off-road_traffic_law_in_Finland","abstract":"This article reports a pioneering case study of a crowdsourced law-reform process in Finland. In the crowdsourcing experiment, the public was invited to contribute to the law-reform process by sharing their knowledge and ideas for a better policy. This article introduces a normative design framework of five principles for crowdsourced policymaking: inclusiveness, accountability, transparency, modularity, and synthesis. Inclusiveness, accountability,\nand transparency are overarching principles for crowdsourced policymaking. Modularity and synthesis support these overarching principles and are instrumental in achieving the main goals of crowdsourced policymaking, namely, an efficient search for knowledge and democratic deliberation among the participants. These principles apply to both the design of the process and the medium that the process takes place in, i.e., the technology facilitating crowdsourcing. This article analyzes the design of the crowdsourced off-road traffic law experiment in Finland using the five principles described above and provides a future research agenda for examining design aspects in crowdsourced policymaking.","authors":["Tanja Aitamurto"],"meta":["January 2015"],"references":["316659681_How_to_Harvest_Collective_Wisdom_for_Complex_Problems_An_Introduction_to_the_MIT_Deliberatorium","291074594_Crowdsourced_Off-Road_Traffic_Law_Experiment_In_Finland_Report_about_idea_crowdsourcing_and_evaluation","321605741_Visualizing_Argumentation_Software_Tools_for_Collaborative_and_Educational_Sense-Making","320085054_Accountability_Technologies_Tools_for_Asking_Hard_Questions","313561468_Theory_and_Practice_The_Mediating_Discourse","288620805_Why_Deliberative_Democracy","287780788_Democratic_Reason_Politics_Collective_Intelligence_and_the_Rule_of_the_Many","285941666_Democracy_and_Knowledge_Innovation_and_Learning_in_Classical_Athens","284853854_Open_government_and_open_society","268518931_Mass_Communication_Research_Methods"]}