{"id":"290496770_The_challenges_of_human_factors_for_implementation_of_information_systems_in_the_healthcare","abstract":"Healthcare Information Systems (HIS) play an important roles in helping to coordinate activities across units within hospitals through fast access to patients' electronic records. HIS is an initiative taken by Malaysian government to resolve several issues such as increasing number of patients who are in needs of treatment, increasing waiting time for receiving medication etc. HIS adoption is increasing globally, including Malaysia. Malaysia begin to adopt HIS in 1999 which covers both clinical and non-clinical information system. Since its introduction, hospitals are facing with various challenges to achieve objective of its adoption. Understanding factors that detain the success of HIS implementation is a central concern of Healthcare Informatics. Among others, human factors or HIS users (medical practitioners) is one of the issues that important to be considered as they play a significant role in influencing the HIS adoption in hospitals. Human factors are essential in identifying human constraint and needs when interacting with the system for improving work effectiveness and productivity. Any issue encounters by medical practitioners need to be identified earlier to avoid failure of use once the system is launched. Failure of interaction effectively between human and technology might lead to medical errors. Thus, the aim of this study is to provide a review of challenges associated with human factor through the adoption of information system in hospital and to suggest strategies to tackle or minimize issues associated with human factors. Based on the term \"Hospital Information System\", \"Electronic Health Record\", and \"human factor\", articles were retrieved from electronic journal databases using a systematic search techniques. Some inclusive and exclusive criteria such as year of publication, writing language etc. were applied. Based on study, there are constraints on human factors with the adoption of information system in hospital. This paper provides view on human-related issues that are important to be addressed in the implementation of information system.","authors":["N.F.A. Aziz","Noor Azizah Mohamadali"],"meta":["January 2015"],"references":["308350408_Implementation_of_Total_Hospital_Information_System_THIS_In_Malaysian_Public_Hospitals_Challenges_and_Future_Prospects","305386291_Implementation_differences_of_Hospital_Information_System_HIS_in_Malaysian_public_hospitals","273126580_Exploring_Potential_Factors_in_Total_Hospital_Information_System_Adoption","272419853_Implementation_of_E-Health_Record_Systems_and_E-Medical_Record_Systems_in_China","278652765_Assimilation_of_Healthcare_Information_Systems_HIS_An_Analysis_and_Critique","42610789_An_Agenda_For_Action_On_Global_E-Health"]}