{"id":"290496627_Generic_assessment_rubrics_for_computer_programming_courses","abstract":"In programming, one problem can usually be solved using different logics and constructs but still producing the same output. Sometimes students get marked down inappropriately if their solutions do not follow the answer scheme. In addition, lab exercises and programming assignments are not necessary graded by the instructors but most of the time by the teaching assistants or lab demonstrators. This results in grading inconsistencies in terms of the marks awarded when the same solution is being graded by different person. To address this issue, a set of assessment rubric is necessary in order to provide flexibility for critical and creative solutions among students as well as to improve grading consistencies among instructors and teaching assistants or demonstrators. This paper reports the development of assessment rubric for each domain in computer programming courses; cognitive, psychomotor, and affective. The rubrics were then implemented for one academic semester consisting of 14 weeks. An interrater reliability analysis based on Kappa statistic was performed to determine the consistency in using the rubrics among instructors The weighted kappa is 0.810, therefore, the strength of agreement or the reliability of the rubric can be considered to be ‘very good’. This indicates that the scoring categories in the rubrics are well-defined and the differences between the score categories are clear.","authors":["Aida Mustapha","Noor Azah Samsudin","Nureize Arbaiy","Rozlini Mohamed"],"meta":["January 2016"],"references":["285955599_Analyzing_the_Impact_of_Using_Interactive_Animations_in_Teaching","271941377_Assessing_Business_Students'_Research_Skills_for_the_Capstone_Project_in_the_Strategic_Management_Course","264224326_Understanding_Student_Differences","292840695_Refining_a_critical_thinking_rubric_for_engineering","280808621_When_Is_an_Illustration_Worth_Ten_Thousand_Words","280796759_Systematic_Thinking_Fostered_by_Illustrations_in_Scientific_Text","262864714_Information_Literacy_Skills_as_a_Critical_Thinking_Framework_in_the_Undergraduate_Engineering_Curriculum","261017376_The_Use_of_Interactive_Computer_Animations_Based_on_POE_as_a_Presentation_Tool_in_Primary_Science_Teaching","260042400_Data_advance_preparation_factors_affecting_results_of_sequence_rule_analysis_in_web_log_mining","255644296_Using_Cognitive-based_Dynamic_Representations_to_Diagnose_Students'_Conceptions_of_the_Characteristics_of_Matter"]}