{"id":"290584131_Pedagogical_reception_of_information_and_communication_technology_in_education","abstract":"The authors start with a generally accepted belief that education is one of the most important factors of society's development, then that its adjustment to changes that follow today's information age is indisputable and significant. In this regard, in this paper it is pointed to the social expectations for as rapid as possible modernization of education, using the potential of information and communication technology on one hand, in order to provide successful transition from industrial to modern age of information and, on the other hand, to the fact that this potential in education is not used in an adequate way. In this paper, we analyze some of the key reasons of insufficient and inadequate integration of information and communication technology (ICT) into education, which includes: unrealistic expectations that introduction of technology into the classroom and training students and teachers \"about the technology \"will result in innovation of pedagogical practice and improvement of the quality of education processes, ignoring pedagogical knowledge about education system functioning, principles of introducing the innovations into education and their sustainability, as well as weaknesses that result from inadequate preparation of teachers for the application of ICT in teaching. Based on meta-analysis of the results of empirical studies of the effects of previous approaches to the introduction of ICT in education (strategies of education policy and programmes of technological education of teachers), the authors reach the conclusion that qualitative progress from techno centric towards reflexive, innovative and creative use of technology in education can be expected only with the implementation of the new generation of models of ICT literacy development of teachers, which integrate the components of pedagogical, disciplinary and technological knowledge into a new dimension of professional competence of teachers.","authors":["Jelena Djermanov","Svetlana Kostovic","Marijana Kosanovic","Branislav Egic"],"meta":["January 2011Technics Technologies Education Management 6(4):1110-1120","Project: \"Digital Media Technology and Educational-Social Changes“, supported by Ministry of Science of the Republic of Serbia / project no. III 47020/2011-2015."],"references":["249797960_Professional_Development_in_Integrating_Technology_Into_Teaching_and_Learning_Knowns_Unknowns_and_Ways_to_Pursue_Better_Questions_and_Answers","240801881_High_Access_and_Low_Use_of_Technologies_in_High_School_Classrooms_Explaining_an_Apparent_Paradox","235316599_Digital_Natives_Digital_Immigrants_Part_1","222159166_Implications_of_missed_opportunities_for_learning_and_assessment_in_design_and_technology_education"]}