{"id":"290583322_6LoWPAN_The_Wireless_Embedded_Internet","abstract":"\"It is stunningly thorough and takes readers meticulously through the design, con?guration and operation of IPv6-based, low-power, potentially mobile radio-based networking.\" Vint Cerf, Vice President and Chief Internet Evangelist, Google This book provides a complete overview of IPv6 over Low Power Wireless Area Network (6LoWPAN) technology In this book, the authors provide an overview of the 6LoWPAN family of standards, architecture, and related wireless and Internet technology. Starting with an overview of the IPv6 'Internet of Things', readers are offered an insight into how these technologies fit together into a complete architecture. The 6LoWPAN format and related standards are then covered in detail. In addition, the authors discuss the building and operation of 6LoWPAN networks, including bootstrapping, routing, security, Internet ingration, mobility and application protocols. Furthermore, implementation aspects of 6LoWPAN are covered. Key Features: Demonstrates how the 6LoWPAN standard makes the latest Internet protocols available to even the most minimal embedded devices over low-rate wireless networks Provides an overview of the 6LoWPAN standard, architecture and related wireless and Internet technology, and explains the 6LoWPAN protocol format in detail Details operational topics such as bootstrapping, routing, security, Internet integration, mobility and application protocols Written by expert authors with vast experience in the field (industrial and academic) Includes an accompanying website containing tutorial slides, course material and open-source code with examples (http://6lowpan.net ) 6LoWPAN: The Wireless Embedded Internet is an invaluable reference for professionals working in fields such as telecommunications, control, and embedded systems. Advanced students and teachers in electrical engineering, information technology and computer science will also find this book useful.","authors":["Z. Shelby","Carsten Bormann"],"meta":["October 2009","DOI:10.1002/9780470686218"],"references":["296945127_MOBILE_Inter-Networking_With_IPv6","273022634_Six_sense_Internet_protocol","3334866_Beyond_folklore_Observations_on_fragmented_traffic"]}