{"id":"290509244_Routing_Optimization_Under_Uncertainty","abstract":"We consider a class of routing optimization problems under uncertainty in which all decisions are made before the uncertainty is realized. The objective is to obtain optimal routing solutions that would, as much as possible, adhere to a set of specified requirements after the uncertainty is realized. These problems include finding an optimal routing solution to meet the soft time window requirements at a subset of nodes when the travel time is uncertain, and sending multiple capacitated vehicles to different nodes to meet the customers' uncertain demands. We introduce a precise mathematical framework for defining and solving such routing problems. In particular, we propose a new decision criterion, called the Requirements Violation (RV) Index, which quantifies the risk associated with the violation of requirements taking into account both the frequency of violations and their magnitudes whenever they occur. The criterion can handle instances when probability distributions are known, and ambiguity when distributions are partially characterized through descriptive statistics such as moments. We develop practically efficient algorithms involving Benders decomposition to find the exact optimal routing solution in which the RV Index criterion is minimized, and we give numerical results from several computational studies that show the attractive performance of the solutions.","authors":["Patrick Jaillet","Jin Qi","Melvyn Sim"],"meta":["January 2016Operations Research 64(1)","DOI:10.1287/opre.2015.1462"],"references":["225134339_Sim_M_Robust_discrete_optimization_and_network_flows_Math_Prog_98_49-71","285381949_Control_of_a_System_Described_by_a_Two-Dimensional_Quartic_Equation_under_Conjugation_Conditions","226672465_The_traveling_salesman_problem_on_a_graph_and_some_related_integer_polyhedra","225178256_Stochastic_Shortest_Paths_Via_Quasi-convex_Maximization","220082400_Stochastic_Shortest_Path_Problem_with_Delay_Excess_Penalty","3427954_Truck_Route_Planning_in_Nonstationary_Stochastic_Networks_With_Time_Windows_at_Customer_Locations"]}