{"id":"290629516_Democratic_Authority_A_Philosophical_Framework","abstract":"Democracy is not naturally plausible. Why turn such important matters over to masses of people who have no expertise? Many theories of democracy answer by appealing to the intrinsic value of democratic procedure, leaving aside whether it makes good decisions. InDemocratic Authority, David Estlund offers a groundbreaking alternative based on the idea that democratic authority and legitimacy must depend partly on democracy's tendency to make good decisions.Just as with verdicts in jury trials, Estlund argues, the authority and legitimacy of a political decision does not depend on the particular decision being good or correct. But the \"epistemic value\" of the procedure--the degree to which it can generally be accepted as tending toward a good decision--is nevertheless crucial. Yet if good decisions were all that mattered, one might wonder why those who know best shouldn't simply rule.Estlund's theory--which he calls \"epistemic proceduralism\"--avoids epistocracy, or the rule of those who know. He argues that while some few people probably do know best, this can be used in political justification only if their expertise is acceptable from all reasonable points of view. If we seek the best epistemic arrangement in this respect, it will be recognizably democratic--with laws and policies actually authorized by the people subject to them.","authors":["David Estlund"],"meta":["August 2009"],"references":["251365350_Jeremy_Waldron_on_Law_and_Disagreement","303184089_Freedoms_and_needs","273239097_Democracy_Without_Preference","231786879_Political_Quality","230445209_The_DemocracyContractualism_Analogy","230228809_Defending_the_Purely_Instrumental_Account_of_Democratic_Legitimacy","228399408_The_Persuasiveness_of_Democratic_Majorities","21738764_What_do_parents_know_about_vitamins","13432217_What_do_parents_know_about_lead_poisoning_The_Chicago_Lead_Knowledge_Test_Pediatric_Practice_Research_Group"]}