{"id":"290633313_Joint_audio_source_separation_and_dereverberation_based_on_multichannel_factorial_hidden_Markov_model","abstract":"This paper proposes a unified approach for jointly solving underdetermined source separation, audio event detection and dereverberation of convolutive mixtures. For monaural source separation, one successful approach involves applying non-negative matrix factorization (NMF) to the magnitude spectrogram of a mixture signal, interpreted as a non-negative matrix. Several attempts have recently been made to extend this approach to a multichannel case in order to utilize the spatial correlation of the multichannel inputs as an additional clue for source separation. The multichannel NMF assumes that an observed signal is a mixture of a limited number of source signals each of which has a static power spectral density scaled by a time-varying amplitude. We have previously proposed an extension of this approach, in which the variations over time of the spectral density and the total power of each source is modeled by a hidden Markov model (HMM). This has allowed us to solve source activity detection and source separation simultaneously through model parameter inference. While this method was based on an anechoic mixing model, the aim of this paper is to further extend the above approach to deal with reverberation by incorporating an echoic mixing model into the generative model of observed signals. Through an experiment of underdetermined source separation under reverberant conditions, we confirmed that the proposed method provided a 9.61 dB improvement compared with the conventional method in terms of the signal-to-interference ratio.","authors":["Takuya Higuchi","Hirokazu Kameoka"],"meta":["November 2014","DOI:10.1109/MLSP.2014.6958927"],"references":["224586165_Multichannel_Nonnegative_Matrix_Factorization_in_Convolutive_Mixtures_for_Audio_Source_Separation","23250940_Nonnegative_Matrix_Factorization_with_the_Itakura-Saito_Divergence_With_Application_to_Music_Analysis","12752937_Learning_the_Parts_of_Objects_by_Non-Negative_Matrix_Factorization","4068518_Non-negative_matrix_factorization_for_polyphonic_music_transcription","3457620_Performance_measurement_in_blind_audio_source_separation","313429207_Acoustical_sound_database_in_real_environments_for_sound_scene_understanding_and_hands-free_speech_recognition","290630237_A_unified_approach_for_underdetermined_blind_signal_separation_and_source_activity_detection_by_multichannel_factorial_hidden_Markov_models","239938723_Efficient_Algorithms_for_Multichannel_Extensions_of_Itakura-Saito_Nonnegative_Matrix_Factorization","237067978_Independent_Component_Analysis","221487896_Data_collection_in_real_acoustical_environments_for_sound_scene_understanding_and_hands-free_speech_recognition","4333446_Blind_speech_dereverberation_with_multi-channel_linear_prediction_based_on_short_time_Fourier_transform_representation"]}