{"id":"290797416_From_complex_questionnaire_and_interviewing_data_to_intelligent_Bayesian_Network_models_for_medical_decision_support","abstract":"Objectives: \n(1) To develop a rigorous and repeatable method for building effective Bayesian network (BN) models for medical decision support from complex, unstructured and incomplete patient questionnaires and interviews that inevitably contain examples of repetitive, redundant and contradictory responses; (2) To exploit expert knowledge in the BN development since further data acquisition is usually not possible; (3) To ensure the BN model can be used for interventional analysis; (4) To demonstrate why using data alone to learn the model structure and parameters is often unsatisfactory even when extensive data is available.\n\nMethod: \nThe method is based on applying a range of recent BN developments targeted at helping experts build BNs given limited data. While most of the components of the method are based on established work, its novelty is that it provides a rigorous consolidated and generalised framework that addresses the whole life-cycle of BN model development. The method is based on two original and recent validated BN models in forensic psychiatry, known as DSVM-MSS and DSVM-P.\n\nResults: \nWhen employed with the same datasets, the DSVM-MSS demonstrated competitive to superior predictive performance (AUC scores 0.708 and 0.797) against the state-of-the-art (AUC scores ranging from 0.527 to 0.705), and the DSVM-P demonstrated superior predictive performance (cross-validated AUC score of 0.78) against the state-of-the-art (AUC scores ranging from 0.665 to 0.717). More importantly, the resulting models go beyond improving predictive accuracy and into usefulness for risk management purposes through intervention, and enhanced decision support in terms of answering complex clinical questions that are based on unobserved evidence.\n\nConclusions: \nThis development process is applicable to any application domain which involves large-scale decision analysis based on such complex information, rather than based on data with hard facts, and in conjunction with the incorporation of expert knowledge for decision support via intervention. The novelty extends to challenging the decision scientists to reason about building models based on what information is really required for inference, rather than based on what data is available and hence, forces decision scientists to use available data in a much smarter way.","authors":["Anthony C. Constantinou","Norman Elliott Fenton","William Marsh","Łukasz Radliński"],"meta":["January 2016Artificial Intelligence in Medicine 67","DOI:10.1016/j.artmed.2016.01.002","Project: BAYES-KNOWLEDGE"],"references":["303462361_An_Empirical_Study_of_Bayesian_Network_Parameter_Learning_with_Monotonic_Influence_Constraints","283264418_Causal_inference_for_violence_risk_management_and_decision_support_in_Forensic_Psychiatry","281689260_Value_of_Information_Analysis_for_Interventional_and_Counterfactual_Bayesian_Networks_in_Forensic_Medical_Sciences","329654602_Causation_Prediction_and_Search","324628605_Statistical_Analysis_with_Missing_Data","316998939_HCR-20V3_Assessing_risk_for_violence","288517246_Knowledge_Extraction_of_Consumers'_Attitude_and_Behavior_A_Case_Study_of_Private_Medical_Insurance_Policy_in_Japan","287180824_Bayesian_Networks_and_Decision_Graphs","285340534_An_Overview_of_the_Bayesian_Approach","280939882_An_introduction_to_Bayesian_networks"]}