{"id":"290753884_Portable_Cloud_Computing_System_A_System_which_Makes_Everywhere_an_ICT_Enhanced_Classroom","abstract":"A \"Portable Cloud Computing System (Portable Cloud)\" is discussed. This system is a portable system that can turn any room into an ICT-enhanced classroom or an ICT-enhanced meeting-room. The Portable Cloud is a carrying case, which contains Wi-Fi access points, a network switch, and a server cluster. The server cluster includes a NAPT (Network Address Port Translation) router, a DHCP server, a captive portal, and application servers. The Wi-Fi access points, the NAPT router, the captive portal and the DHCP server make the space where the Portable Cloud is located, Internet accessible. The application servers contains applications such like \"Distributed Web Screen Share (DWSS)\", \"Slide Plus\", and \"OwnCloud\". The DWSS is a web application which transmits a live screen image of a PC to a large number of Web clients. Slide Plus is an interactive live slide presentation tool for a large audience with Web clients. OwnCloud is open source software by owncloud.com. This software enables file sharing among students and teachers similar to that found in Dropbox. We are using the Portable Cloud for our seminar class, meetings of grass-root groups, and academic conferences. We can't imagine holding our seminar class without the Portable Cloud.","authors":["Takashi Yamanoue","Kentaro Oda","Soshi Tetaka","Koichi Shimozono"],"meta":["November 2014","DOI:10.1145/2661172.2661198"],"references":["292183861_Capturing_malicious_bots_using_a_beneficial_bot_and_wiki","288484828_A_Technique_to_Assign_an_Appropriate_Server_to_a_Client_for_a_CDN_Consists_of_Servers_at_the_Global_Internet_and_Hierarchical_Private_Networks","262211762_Bring_your_own_computers_project_in_Kyushu_university","236629599_A_Malicious_Bot_Capturing_System_using_a_Beneficial_Bot_and_Wiki","221670081_Information_and_Communication_Technology_Infrastructure_and_Management_for_Collaboration_with_Regional_Universities_and_Colleges","221468456_The_care_and_feeding_of_a_Moodle_campus","221468121_Supporting_clickers_on_campus_and_the_faculty_who_use_them"]}