{"id":"290989646_Military_Applications_of_Location_Analysis","abstract":"Over time, the decision-making\nneeds of military\ncommanders have had a strong influence upon the development of the field of operations research and analytic problem solving. The challenge of correctly positioning military units and resources within a geographical setting has vexed commanders and their staffs for thousands of years. However, it is only in the last 70 years that optimization methods have developed to the point where analysts can apply them to accomplish such goals. Along the way toward solving these narrowly defined military-focused problems, the advancement of the field has benefitted as generalizable techniques are extended beyond their origins to countless non-military applications. For example, military analysts first solved complex problems regarding routes for convoys of ships, code breaking, and materiel allocation mathematically during World War II ultimately leading to the development of linear and mathematical programming techniques by wartime scientists. Location analysis knowledge was similarly benefitted by the war, as commanders required the ability to spatially position munitions to destroy a target and covering a search area to find the enemy. The benefit is reciprocal however, as military strategy and planning since World War II have literally been redefined by the operations research field’s ability to solve larger and more complex problems.","authors":["John Bell","Stanley E. Griffis"],"meta":["September 2015","DOI:10.1007/978-3-319-20282-2_17","In book: Applications of Location Analysis (pp.403-433)Chapter: 17Publisher: Springer International PublishingEditors: H.A. Eiselt and, V. Marianov"],"references":["298928669_A_genetic_algorithm_applied_to_planning_search_paths_in_complicated_environments","324712908_Defendens_Imperium_Romanum_A_Classical_Problem_in_Military_Strategy","313674816_Optimum_Locations_of_Switching_Centers_and_the_Absolute_Centers_and_Medians_of_a_Graph","313428190_Location-allocation_problems","312580792_The_Location_of_Emergency_Service_Facilities","280743478_The_Maximal_Covering_Location_Problem","277877213_Modeling_the_Pre-Positioning_of_Air_Force_Precision_Guided_Munitions","274852230_Logistics_in_the_National_Defense","274084715_Supporting_Air_and_Space_Expeditionary_Forces_Analysis_of_Combat_Support_Basing_Options","274084508_Evaluation_of_Options_for_Overseas_Combat_Support_Basing"]}