{"id":"290905050_Accelerating_Rabin_Karp_on_a_Graphics_Processing_Unit_GPU_using_Compute_Unified_Device_Architecture_CUDA","abstract":"String matching or pattern matching algorithms are used in various applications. They are used to find the occurrences of a pattern in a given text or a pool of strings. They are widely used in text editors in computing machines, database queries, bio-informatics, chem-informatics, search engines and many more applications. String matching algorithms can be of two ways: single pattern matching and multiple pattern matching. Rabin Karp is a string searching algorithm that can act in both ways. Since these algorithms are working on large pool of data, achieving higher throughput on the implementation of the algorithm has always been a major concern. Parallel implementation of such algorithms can achieve the concerned objective. Parallelism could be achieved easily with the rapid development of GPU architectures. In this research, Rabin Karp algorithm is implemented in CUDA C. We have compared CUDA implementation of this algorithm against both its serial CPU implementation and parallel Pthread implementation on multi-core CPUs. Eventually, using the empirical results, we could conclude that the CUDA C implementation of Rabin Karp on the GPU can achieve much high throughput for a large pool of data in string matching.","authors":["Nayomi Dayarathne","Roshan Ragel"],"meta":["March 2014","DOI:10.1109/ICIAFS.2014.7069589"],"references":["251566047_State_of_the_Art_for_String_Analysis_and_Pattern_Search_Using_CPU_and_GPU_Based_Programming","290901055_The_GPU-based_high-performance_pattern-matching_algorithm_for_intrusion_detection","268005335_Rabin-Karp_String_Matching_Using_Cilk","252064153_String_Matching_Algorithms_and_their_Applicability_in_various_Applications","242600316_RB-Matcher_String_Matching_Technique","224960000_A_Fast_String_Searching_Algorithm","224210602_Accelerating_String_Matching_Using_Multi-Threaded_Algorithm_on_GPU","224163948_Hardware_accelerators_for_biocomputing_A_survey","224103840_Efficient_randomized_pattern-matching_algorithms","220618247_Fast_Pattern_Matching_in_Strings"]}