{"id":"290973532_Two_Simulated_Annealing_Optimization_Schemas_for_Rational_Bezier_Curve_Fitting_in_the_Presence_of_Noise","abstract":"Fitting curves to noisy data points is a difficult problem arising in many scientific and industrial domains. Although polynomial functions are usually applied to this task, there are many shapes that cannot be properly fitted by using this approach. In this paper, we tackle this issue by using rational Bézier curves. This is a very difficult problem that requires computing four different sets of unknowns (data parameters, poles, weights, and the curve degree) strongly related to each other in a highly nonlinear way. This leads to a difficult continuous nonlinear optimization problem. In this paper, we propose two simulated annealing schemas (the all-in-one schema and the sequential schema) to determine the data parameterization and the weights of the poles of the fitting curve. These schemas are combined with least-squares minimization and the Bayesian Information Criterion to calculate the poles and the optimal degree of the best fitting Bézier rational curve, respectively. We apply our methods to a benchmark of three carefully chosen examples of 2D and 3D noisy data points. Our experimental results show that this methodology (particularly, the sequential schema) outperforms previous polynomial-based approaches for our data fitting problem, even in the presence of noise of low-medium intensity.","authors":["Andrés Iglesias","Akemi Galvez","Carlos Loucera"],"meta":["January 2016Mathematical Problems in Engineering 2016(4):1-17","DOI:10.1155/2016/8241275","Project: Free-form Curve and Surface Reconstruction Through Simulated Annealing-based Metaheuristic Techniques"],"references":["275540914_A_Review_on_Approaches_for_Handling_Bezier_Curves_in_CAD_for_Manufacturing","263549497_Cuckoo_Search_with_Levy_Flights_for_Weighted_Bayesian_Energy_Functional_Optimization_in_Global-Support_Curve_Data_Fitting","258394889_Firefly_Algorithm_for_Explicit_B-Spline_Curve_Fitting_to_Data_Points","286594688_Simulated_Annealing_Algorithm_for_Bezier_Curve_Approximation","286423374_Parameter_Optimization_for_Bezier_Curve_Fitting_Based_on_Genetic_Algorithm","285979918_A_survey_of_simulated_annealing_as_a_tool_for_single_and_multiobjective_optimization","273134799_Estimating_the_Dimension_of_a_Model","267572856_Elitist_clonal_selection_algorithm_for_optimal_choice_of_free_knots_in_B-spline_data_fitting","265834039_Shape_Interrogation_for_Computer_Aided_Design_and_Manufacturing","257635654_A_new_iterative_mutually_coupled_hybrid_GA-PSO_approach_for_curve_fitting_in_manufacturing"]}