{"id":"291073252_GRASP_with_Path_Relinking_for_the_Two-Echelon_Vehicle_Routing_Problem","abstract":"We propose a meta-heuristic based on greedy randomized adaptive search procedure (GRASP) combined with path relinking to address the two-echelon vehicle routing problem (2E-VRP), an extension of the capacitated vehicle routing problem (CVRP) in which the delivery from a single depot to customers is achieved by routing and consolidating the freight through intermediate depots called satellites. The problem is treated by separating the depot-to-satellite transfer and the satellite-to-customer delivery, and iteratively solving the two resulting routing subproblems, while adjusting the satellite workloads that link them. The meta-heuristic scheme consists of applying a GRASP and a local search (LS) procedures in sequence. Then, the resulting solution is linked to an elite solution by means of a path relinking procedure. To escape from infeasible solutions, which are quite common in this kind of problem, a feasibility search (FS) procedure is applied within path relinking. Extensive computational results on instances with up to 50 customers and 5 satellites show that the meta-heuristic is able to improve literature results, both in efficiency and accuracy.","authors":["Teodor Gabriel Crainic","Simona Mancini","Guido Perboli","Roberto Tadei"],"meta":["January 2013","DOI:10.1007/978-1-4614-6322-1_7","In book: Advances in Metaheuristics (pp.113-125)","Project: City Logistics"],"references":["257715512_Impact_of_Generalized_Travel_Costs_on_Satellite_Location_in_the_Two-Echelon_Vehicle_Routing_Problem","239060357_Fundamentals_of_Scatter_Search_and_Path_Relinking","228937506_The_Two-Echelon_Capacitated_Vehicle_Routing_Problem_Models_and_Math-Based_Heuristics","228831945_Clustering-Based_Heuristics_for_the_Two-Echelon_Vehicle_Routing_Problem","228346477_Tabu_Search","265303019_Handbook_of_Metaheuristics","257492689_The_two-echelon_vehicle_routing_problem","251423098_GRASP_with_Path-Relinking_Recent_Advances_and_Applications","227543616_An_annotated_bibliography_of_GRASP-Part_II_Applications","227494452_An_annotated_bibliography_of_GRASP_-_Part_I_algorithms"]}