{"id":"291029506_On_the_Performance_of_Relay_Aided_Millimeter_Wave_Networks","abstract":"In this paper, we investigate the potential benefits of deploying relays in outdoor millimeter-wave (mmWave) networks. We study the coverage probability from sources to a destination for such systems aided by relays. The sources and the relays are modeled as independent homogeneous Poisson point processes (PPPs). We present a relay modeling technique for mmWave networks considering blockages and compute the density of active relays that aid the transmission. Two relay selection techniques are discussed, namely best path selection and best relay selection. For the first technique, we provide a closed form expression for end-to-end signal-to-noise ratio (SNR) and compute the best random relay path in a mmWave network using order statistics. Moreover, the maximum end-to-end SNR of random relay paths is investigated asymptotically by using extreme value theory. For the second technique, we provide a closed form expression for the best relay node having the maximum path gain. Finally, we analyze the coverage probability and transmission capacity of the network and validate them with simulation results. Our results show that deploying relays in mmWave networks can increase the coverage probability and transmission capacity of such systems.","authors":["Sudip Biswas","Satyanarayana Vuppala","Jiang Xue","T. Ratnarajah"],"meta":["January 2015IEEE Journal of Selected Topics in Signal Processing 10(3):1-1","DOI:10.1109/JSTSP.2015.2509951"],"references":["264579132_Millimeter-Wave_Enhanced_Local_Area_Systems_A_High-Data-Rate_Approach_for_Future_Wireless_Networks","282835054_Performance_Analysis_for_Multi-Way_Relaying_in_Rician_Fading_Channels","281992784_Performance_Evaluation_of_Relay-aided_Cellular_Networks_Using_Stochastic_Geometry","273171333_End-to-End_Error_Probability_and_Diversity_Analysis_of_AF-Based_Dual-Hop_Cooperative_Relaying_in_a_Poisson_Field_of_Interferers_at_the_Destination","271481097_73_GHz_millimeter_wave_propagation_measurements_for_outdoor_urban_mobile_and_backhaul_communications_in_New_York_City","269500323_Extreme_Value_Theory_in_Engineering","269328638_Stochastic_geometry_analysis_of_achievable_transmission_capacity_for_relay-assisted_Device-to-Device_networks","269302492_Path_loss_models_for_5G_millimeter_wave_propagation_channels_in_urban_microcells","269116103_Performance_Analysis_of_mmWave_Ad_Hoc_Networks","268863379_Order_Statistics"]}