{"id":"291011552_Students'_Attitude_Towards_Self-Study_A_Case_of_College_Study_Programmes_in_Social_Sciences","abstract":"In recent years, the significance of quality in higher education has been emphasised, with special emphasis placed on the opinion of students. The present paper analyses the attitude of college students towards self-study assignments as a factor essential for the development of generic competences, presently related to the widely discussed educational paradigms, such as student-oriented learning, metacognitive study strategies, and holistic personality development. The changes in the educational paradigms and recent fundamental and applied research reveal the importance of student independent work in the study process and the development of abilities necessary for learning, the enhancing of motivation, and the promotion of reflection and critical thinking. A new attitude towards the development of student thinking and the enhancing of their activity has been formed. Students‘ generic abilities necessary for independent work and relevant for the solution of the problems arising in their professional activity in the future (monitoring, organisation, communication, work in a team, etc.), as well as their learning motivation, are different. Student selfstudy activity is a major integral part of college studies, and it has to be appropriately organised, monitored, assessed, and provided with the most important sources of information and technologies. The research aim is to identify the views of college students on self-study assignments in the process of implementation of study programmes in social sciences. The analysis of the outcomes of the student survey and of the research of other authors is expected to lead to the identification of the weaknesses in the organisation of self-study activities and to contribute to the forecasting of the improvement trends and the development of generic competences that integrate individual knowledge, abilities, and attitudes into a whole and and consciously channel them in the chosen direction.","authors":["Jūratė Klizaitė","Renata Arlauskienė"],"meta":["December 2015Applied Research In Health And Social Sciences: Interface And Interaction 12(1)","DOI:10.1515/arhss-2015-0002"],"references":["325755544_SAVARANKISKAS_DARBAS_AUKSTOJOJE_MOKYKLOJE_SOCIALINIO_PEDAGOGO_VADYBINIU_KOMPETENCIJU_UGDYMO_POZIURIU_STUDENTU_NUOMONE","291256737_Savimoka_ir_savarankiskas_mokymasis_aukstojoje_mokykloje_kritine_diskurso_analize","254340920_Exploring_the_combined_relationships_of_student_and_teacher_factors_on_learning_approaches_and_self-directed_learning_readiness_at_a_Malaysian_university","233219278_Reconceptualising_Assessment_Feedback_A_Key_to_Improving_Student_Learning","233165178_Students'_approaches_to_learning_and_their_performance_in_the_Extended_Project_pilot"]}