{"id":"291009703_From_Print_to_Digital_Implications_for_Dictionary_Policy_and_Lexicographic_Conventions","abstract":"Editorial policies and lexicographic conventions have evolved over hundreds of years. They developed at a time when dictionaries were printed books of finite dimensions-as they have been for almost the whole of their history. In many cases, styles which we take for granted as \"natural\" features of dictionaries are in reality expedients designed to compress maxi-mum information into the limited space available. A simple example is the kind of \"recursive\" defi-nition found in many English dictionaries where a nominalization (such as assimilation) is defined in terms of the related verb (\"the act of assimilating or state of being assimilated\"), and the user is required to make a second look-up (to the base word). Is this an ideal solution, or was it favoured simply as a less space-intensive alternative to a self-sufficient explanation? As dictionaries gradually migrate from print to digital media, space constraints disappear. Some problems simply evaporate. To give a trivial example, the need for abbreviations, tildes and the like no longer exists (though a surprising number of dictionaries maintain these conventions even in their digital versions). So the question arises whether we need to revisit, and re-evaluate, the entire range of editorial policies and conventions in the light of changed circumstances. This paper looks at some familiar editorial and presentational conventions, and considers which are no longer appropriate in the digital medium-and what new policies might replace them.","authors":["Michael Rundell"],"meta":["November 2015Lexikos 25","DOI:10.5788/25-1-1301"],"references":["267246601_Dutch_Lexicography_in_Progress_the_Algemeen_Nederlands_Woordenboek_ANW","265252068_User-generated_content_UGC_in_online_English_dictionaries","228771720_Lexicography_Printing_Technology_and_the_Spread_of_Renaissance_Culture_Spread_of_Renaissance_Culture","49249801_Space_restrictions_in_paper_and_electronic_dictionaries_and_their_implications_for_the_design_of_production_dictionaries","309256797_Lexical_Analysis_Norms_and_Exploitations","286690103_Article_Structures_Moving_from_Printed_to_e-Dictionaries","273501193_Cognitive_Semantics_and_the_Lexicon","270414457_Javanese-English_Dictionary","269858637_Cassell's_English_Dictionary","267718561_The_Dictionary-Making_Process_More_than_One_Way_to_Skin_a_Cat_Why_Full-Sentence_Definitions_Have_not_Been_Universally_Adopted"]}