{"id":"291016526_A_Multi-Objective_Optimization_Scheduling_Method_Based_on_the_Ant_Colony_Algorithm_in_Cloud_Computing","abstract":"For task-scheduling problems in cloud computing, a multi-objective optimization method is proposed here. First, with an aim toward the biodiversity of resources and tasks in cloud computing, we propose a resource cost model that defines the demand of tasks on resources with more details. This model reflects the relationship between the user’s resource costs and the budget costs. A multi-objective optimization scheduling method has been proposed based on this resource cost model. This method considers the makespan and the user’s budget costs as constraints of the optimization problem, achieving multi-objective optimization of both performance and cost. An improved ant colony algorithm has been proposed to solve this problem. Two constraint functions were used to evaluate and provide feedback regarding the performance and budget cost. These two constraint functions made the algorithm adjust the quality of the solution in a timely manner based on feedback in order to achieve the optimal solution. Some simulation experiments were designed to evaluate this method’s performance using four metrics: 1) the makespan; 2) cost; 3) deadline violation rate; and 4) resource utilization. Experimental results show that based on these four metrics, a multi-objective optimization method is better than other similar methods, especially as it increased 56.6% in the best case scenario.","authors":["Liyun Zuo","Lei Shu","Shoubin Dong","Chunsheng Zhu"],"meta":["December 2015IEEE Access 3:1-1","DOI:10.1109/ACCESS.2015.2508940"],"references":["286583281_An_hybrid_bio-inspired_task_scheduling_algorithm_in_cloud_environment","273632751_A_Multi-Objective_Task_Scheduling_Algorithm_for_Heterogeneous_Multi-cloud_Environment","326857186_Research_on_Cloud_Computing_Task_Scheduling_Based_on_Improved_Ant_Colony_Algorithm","286651240_Scheduling_Workflow_in_Cloud_Computing_Based_on_Ant_Colony_Optimization_Algorithm","283695038_Deadline-guaranteed_scheduling_algorithm_with_improved_resource_utilization_for_cloud_computing","282709908_Job_Scheduling_for_Cloud_Computing_Integrated_with_Wireless_Sensor_Network","278830173_A_Cloud_Resource_Evaluation_Model_Based_on_Entropy_Optimization_and_Ant_Colony_Clustering","278657964_An_Improved_Min-Min_Algorithm_in_Cloud_Computing","276368902_A_Heuristic_Clustering-Based_Task_Deployment_Approach_for_Load_Balancing_Using_Bayes_Theorem_in_Cloud_Environment","273572723_A_Nearly_Optimal_Packet_Scheduling_Algorithm_for_Input_Queued_Switches_with_Deadline_Guarantees"]}