{"id":"291099419_Efficient_Pairings_and_ECC_for_Embedded_Systems","abstract":"The research on pairing-based cryptography brought forth a wide range of protocols interesting for future embedded applications. One significant obstacle for the widespread deployment of pairing-based cryptography are its tremendous hardware and software requirements. In this paper we present three side-channel protected hardware/software designs for pairing-based cryptography yet small and practically fast: our plain ARM Cortex-M0+-based design computes a pairing in less than one second. The utilization of a multiply-accumulate instruction-set extension or a light-weight drop-in hardware accelerator that is placed between CPU and data memory improves runtime up to six times. With a 10.1 kGE large drop-in module and a 49 kGE large platform, our design is one of the smallest pairing designs available. Its very practical runtime of 162 ms for one pairing on a 254-bit BN curve and its reusability for other elliptic-curve based crypto systems offer a great solution for every microprocessor-based embedded application.","authors":["Thomas Unterluggauer","Erich Wenger"],"meta":["September 2014","DOI:10.1007/978-3-662-44709-3_17","Conference: International Workshop on Cryptographic Hardware and Embedded Systems"],"references":["265827913_81632_Shades_of_Elliptic_Curve_Cryptography_on_Embedded_Processors","261859628_Hardware_Architectures_for_MSP430-Based_Wireless_Sensor_Nodes_Performing_Elliptic_Curve_Cryptography","257803299_Efficient_software_implementation_of_public-key_cryptography_on_sensor_networks_using_the_MSP430X_microcontroller","255564408_Efficient_Implementation_of_Bilinear_Pairings_on_ARM_Processors","274573556_Software_Implementation_of_an_Attribute-Based_Encryption_Scheme","266860952_Faster_Hashing_to_mathbb_G_2","265527793_Leakage-Resilient_ElGamal","262250482_Integer_Variable_CH---Based_Ate_Pairing","262174895_NEON_Implementation_of_an_Attribute-Based_Encryption_Scheme","243119758_Modular_Multiplication_Without_Trial_Division"]}