{"id":"291156673_Twenty_five_years_of_training_and_education_in_ICT_Design_for_All_and_Assistive_Technology","abstract":"Over the last twenty to twenty-five years 'Design for All' principles and practices including Assistive Technologies have been collected into formal and informal courses which have been used to train designers of Information and Communication products and systems. The aim of this paper is to describe the relevant changes occurring in training and education in the design and use of technology. The development of courses and materials has been supported by a number of EU funded initiatives including HEART, DAN, IDCnet and Design for All@eInclusion. In addition there have been individual responses to the demands for training courses in higher education and we include five case studies from around Europe: Greece, Austria, Czech Republic, Norway and UK. These show what can be achieved and act as beacons for continuing progress. EU and national initiatives to support digital inclusion are trying to address the needs of all those who are subject to social disadvantage as a consequence of age and disability as well as other factors such as low educational achievement, poverty and living in remote rural areas. Applying Design for All principles offers the opportunity of designing systems that are better matched to the existing needs of those who are technologically disadvantaged. However progress towards developing more specialist courses or more fully integrated Design for All principles in mainstream technology courses remains slow. The latest initiatives include the development of a curriculum for professional training and this offers an important alternative educational route, adding knowledge of Design for All to those with established technical skills.","authors":["Gill Whitney","Suzette Keith","Christian Bühler","Sue Hewer"],"meta":["September 2011Technology and Disability 23(3):163-170","DOI:10.3233/TAD-2011-0324"],"references":["7673624_E-learning_for_assistive_technology_professionals_-_A_review_of_the_TELEMATE_project"]}