{"id":"291246389_Modeling_Diffusion_of_Tabletop_for_Collaborative_Learning_Using_Interactive_Science_Lab_Simulations","abstract":"Within the context of Roger’s Diffusion of Innovation theory we propose a pedagogical framework for attributes that can significantly affect student adoption of collaborative learning environment like multi-user, multi-touch tabletop. We investigated the learning outcomes of secondary school students in India collaboratively using OLabs on a tabletop (EG1 = 30) vs. individually using at desktops (EG2 = 92). We analyzed the nature of communication, touch and non-touch gesture actions, position around the tabletop, focus group interviews, and pre and post test scores. Using Bass model the study also accounts for the inter influence of related group of potential adopter teachers who are likely to exert positive influence on students. The results revealed that learning outcomes on tabletop are strongly associated with innovation attributes like Relative Advantage, Compatibility, Ease of Use, Perceived Enjoyment, Perceived usefulness and Teachers support. Overall students expressed much more positive attitude to adopt tabletop technology for learning vs. desktop. We find that the mean group performance gain is significant with collaboration using tabletop and significantly greater than the group using desktops. We also find that the group interactions with the tabletop area significant factor that contributes to the group’s average performance gain. However, the total time spent in while using the tabletop is surprisingly not a significant factor in the performance gain. Our findings contribute to the design of new pedagogical models for science learning that maximizes the collaborative learning potential of tabletops.","authors":["Raghu Raman","Prema Nedungadi","Maneesha Vinodini Ramesh"],"meta":["February 2014","DOI:10.1007/978-3-319-04483-5_34","Conference: International Conference on Distributed Computing and Internet Technology","Project: Virtual Simulations - OLabs, VLab, MedSIM, VLCAP"],"references":["224175739_Effectiveness_of_adaptive_learning_with_interactive_animations_and_simulations","305720251_A_New_Product_Growth_Model_for_Consumer_Durables","288151872_Evolution_Diffusion_of_Innovations","267922562_The_Diffusion_of_Innovations","235362849_A_Diffusion_of_Innovations","233013864_Stochastic_evolution_of_a_nonlinear_model_of_diffusion_of_information","227447610_A_New_Product_Growth_for_Model_Consumer_Durables","221308413_Teaching_table_A_tangible_mentor_for_pre-k_math_education","221238470_Quadratic_Manipulating_algebraic_expressions_on_an_interactive_tabletop","220694510_Diffusion_of_innovations_5_ed"]}