{"id":"2913929_Lucas-Kanade_20_Years_on_A_Unifying_Framework","abstract":"Since the Lucas-Kanade algorithm was proposed in 1981 image alignment has become one of the most widely used techniques in computer vision. Applications range from optical flow, tracking, and layered motion, to mosaic construction, medical image registration, and face coding. Numerous algorithms have been proposed and a variety of extensions have been made to the original formulation. We present an overview of image alignment, describing most of the algorithms in a consistent framework. We concentrate on the inverse compositional algorithm, an efficient algorithm that we recently proposed. We examine which of the extensions to the Lucas-Kanade algorithm can be used with the inverse compositional algorithm without any significant loss of efficiency, and which cannot. In this paper, the fourth and final part in the series, we cover the addition of priors on the parameters. We first consider the addition of priors on the warp parameters. We show that priors can be added with minimal extra cost to all of the algorithms in Parts 1--3. Next we consider the addition of priors on both the warp and appearance parameters. Image alignment with appearance variation was covered in Part 3. For each algorithm in Part 3, we describe whether priors can be placed on the appearance parameters or not, and if so what the cost is.","authors":["Simon Baker","Ralph Gross","Iain Matthews"],"meta":["March 2004International Journal of Computer Vision 56(3)","DOI:10.1023/B:VISI.0000011205.11775.fd"],"references":["3193099_Fast_reliable_head_tracking_under_varying_illumination_An_approach_based_on_registration_of_texture-mapped_3D_models","3192899_Belhumeur_PN_Efficient_region_tracking_with_parametric_models_of_geometry_and_illumination_IEEE_Trans_on_PAMI_2010_1025-1039","2455132_Fast_Image-Based_Tracking_by_Selective_Pixel_Integration","2352288_EigenTracking_Robust_Matching_and_Tracking_of_Articulated_Objects_Using_a_View-Based_Representation","262233141_Active_Blobs","262163115_Active_Appearance_Models","228083880_An_Iterative_Image_Registration_Technique_with_an_Application_toStereo_Vision","221304269_Hierarchical_Model-Based_Motion_Estimation","220691042_Practical_Optimization","220659797_Panoramic_Image_Mosaics","11877731_Consistent_image_registration","3940658_Equivalence_and_efficiency_of_image_alignment_algorithms","3703136_Projective_registration_with_difference_decomposition","3193436_Limits_on_Super-Resolution_and_How_to_Break_Them","2818170_Stereo_Matching_with_Transparency_and_Matting"]}