{"id":"291394452_Analysis_Of_Naac_Accreditation_System_Using_Abcd_Framework","abstract":"p>National Assessment and Accreditation Council (NAAC) is an autonomous institution under University Grants Commission (UGC) of India, established in the year 1994. It has been entrusted with the responsibility of Assessment and Accreditation of Colleges and\nUniversities in India for the promotion of quality of teaching-learning and research. Towards this mission, NAAC has been engaged in redesigning its on-going methodologies of Assessment and Accreditation, based on its own field experience, its shared knowledge with other International Quality Assurance Agencies and the quality imperatives in the changing context of worldwide higher education scenario. The mandate of NAAC as reflected in its vision statement is making quality assurance an integral part of the functioning of Higher Education Institutions (HEIs). The accreditation framework of NAAC is based on five core values which include (i) Contributing to National Development, (ii) Fostering Global Competencies among students, (iii) Inculcating a Value System among Students, (iv) Promoting the Use of Technology, (v) Quest for Excellence. These five core values form the foundation for assessment of institutions that volunteer for accreditation by NAAC. The seven criteria identified by NAAC which serve as the basis for assessment of HEIs are (1) Curricular Aspects, (2) Teaching-Learning and Evaluation, (3) Research, Consultancy, and Extension, (4) Infrastructure and Learning Resources, (5) Student Support and Progression, (6)\nGovernance, Leadership and Management, and (7) Innovations & Best Practices. In this paper, we have analyzed NAAC Accreditation Criteria using our recently developed analyzing framework for business models, operational concepts and functional systems called ABCD technique. The various factors affecting these were found out using focus group method and the constituent critical elements under each factor. The results supported the use of ABCD analyzing technique to a system performance evaluation.</p","authors":["Sreeramana Aithal"],"meta":["January 2016","DOI:10.5281/zenodo.154272"],"references":["309483151_A_New_ABCD_Technique_to_Analyze_Business_Models_Concepts","284181887_BLACK_OCEAN_STRATEGY_-_A_PROBE_INTO_A_NEW_TYPE_OF_STRATEGY_USED_FOR_ORGANIZATIONAL_SUCCESS","284181550_Application_of_ABCD_Analysis_Model_for_Black_Ocean_Strategy","281524781_Relevance_of_On-line_Office_Administration_through_Working_from_Home_in_Future_Education_System","281524771_AN_EMPIRICAL_STUDY_ON_WORKING_FROM_HOME_A_POPULAR_E-BUSINESS_MODEL"]}