{"id":"291335863_La_Ingenieria_de_Software_en_Mexico_Hacia_la_consolidacion_del_primer_programa_de_Licenciatura","abstract":"En este trabajo se presentan brevemente los antecedentes de la Ingeniería de Software como disciplina profesional, así como de los primeros programas curriculares en el mundo. Se describe en detalle el desarrollo del primer programa educativo de nivel licenciatura ofertado en México; se comentan sus antecedentes, indicadores de oferta, demanda, aprobación, deserción, egreso y titulación, así como el desempeño de sus estudiantes en los exámenes (EXANI II y EGELISOFT) del CENEVAL. Finalmente se hace una reflexión por parte de los autores, sobre las acciones que se vislumbra necesarias para la consolidación de dicho programa educativo, luego de haber transitado durante una década de existencia. This paper briefly discusses the history of Software Engineering as a professional discipline and the first curricular programs in the world. The development of undergraduate education program first offered in Mexico is described in detail; background, indicators of supply, demand, approval, desertion and graduation as well as student performance on CENEVAL-tests (EXANI II and EGEL-ISOFT) are presented. Finally a reflection by the authors about the actions that are considered necessary for the consolidation of the educational program, a decade of existence.","authors":["Raúl Antonio Aguilar Vera","Julio César Díaz-Mendoza"],"meta":["December 2015Tecnología Educativa Revista CONAIC 2(2):6-17","DOI:10.32671/terc.v2i2.155"],"references":["221537081_The_road_less_traveled_A_baccalaureate_degree_in_software_engineering","28099878_La_Eficiencia_Terminal_en_Programas_de_Licenciatura_y_su_Relacion_con_la_Calidad_Educativa","321600750_Software_Engineering_Education_The_Educational_Needs_of_the_Software_Community","262249551_The_Software_Engineering_First_Degree_at_Imperial_College_London","240249482_Software_Engineering_Techniques_Report_on_a_conference_sponsored_by_the_NATO_Science_Committee","238720532_Report_on_a_conference_sponsored_by_the_NATO_Science_Committee","238719080_Software_ensineerlng_education_the_educational_needs_of_the_software_community","228613676_Asking_and_answering_questions_about_the_causes_of_software_behaviors","226342551_The_first_decade_of_an_undergraduate_degree_programme_in_software_engineering","220300573_Forging_a_Discipline_An_Outline_History_of_software_Engineering_Education","3331325_A_Brief_History_of_Software_Engineering"]}