{"id":"291302522_k-nearest_neighbor_algorithm_for_improving_accuracy_in_clutter_based_location_estimation_of_wireless_nodes","abstract":"This research is focusing on the precise location estimation of mobile node by using k - nearest neighbor algorithm (k-NN). It is based on our previous research findings in which we divided the geographical area into thirteen clutters/terrains based on the behavior of radio waves. We calculated the point-to-point distance from the antennas to mobile node by using receive signal strength and available signal strength information. A C# prototype was developed by using WiFi (IEEE 802.11 b/g standard) to record data points in different clutters at every 2 meter distance. We derived Clutter based Enhanced Error Rate Table (CERT) for precision. Although CERT minimizes errors due to the atmospheric considerations but in highly attenuated clutters the error rate was still high. The k-NN algorithm is used to minimize the error ranging from 1-3 meters to 0.4-1.2 meter only, depending on the clutter we are dealing with. Current research is divided into three steps. First we calculate the P2P distance in all different clutters by using available signal strength and receive signal strength at five different time intervals (t 0 - t 4). In step 2 we construct three triangles at random by using the data gathered in step 1 and calculate mean value of predicted locations. Finally based on locations calculated in step 2 we apply the k-NN algorithm to minimize error in the estimated location. Results show that the k-NN can produce from 217% - 289% better results compare to the famous triangulation method. The purpose of this research is to reduce errors in order to achieve estimated position near to accurate.","authors":["Muhammad Alam","M. S. Mazliham","Patrice Boursier","Shahrulniza Musa"],"meta":["January 2011Malaysian Journal of Computer Science 24(3):146-159"],"references":["238723242_Study_of_propagation_loss_prediction_in_forest_environment","225677338_A_Novel_GPS-free_Method_for_Mobile_Unit_Global_Positioning_in_Outdoor_Wireless_Environments","220321725_Relative_Location_Estimation_in_Wireless_Sensor_Networks","220232217_A_Probabilistic_Approach_to_WLAN_User_Location_Estimation","220805039_Predicted_and_Corrected_Location_Estimation_of_Mobile_Nodes_Based_on_the_Combination_of_Kalman_Filter_and_the_Bayesian_Decision_Theory","220205371_Insider_Attack_Attribution_Using_Signal_Strength-based_Hyperbolic_Location_Estimation","3153971_Estimating_position_and_velocity_of_mobiles_in_a_cellular_radio_network"]}