{"id":"291353897_Schedule_robustness_analysis_with_the_help_of_attainable_sets_in_continuous_flow_problem_under_capacity_disruptions","abstract":"Continuous flow scheduling problems have their place in many industries such as gas, oil, chemicals, glass and fluids production as well as production of granular goods and steel details. The disruptions in processing capacities may result in schedule performance decrease. In this paper, we develop a new method for robustness analysis of those schedules that are formulated in continuous time in the state-space domain. The developed method is based on attainable sets (ASs) that allow computing a form to represent the states and performance of schedules in regard to different capacity degradation levels. Having such a form, it becomes possible to estimate the schedule robustness. The technical development and approximation of ASs are presented. A robustness index is developed on the basis of the minimax regret approach, and it can be used for decision-makers regarding the trade-off ‘performance vs. robustness’. As such, it becomes possible to compare maximal possible profits in situations without disruptions and realistic profits subject to some robustness investments and costs of protection against disruptions. With the presented results, it becomes possible to obtain ASs for interval data with no a priori information about perturbation impacts, i.e. for non-stationary perturbations. ASs permit to consider perturbations and schedule performances as time functions. Perturbation functions may be set up for different uncertainty scenarios, including interval perturbations.","authors":["Dmitry Ivanov","Alexandre Dolgui","Boris vladimirovich Sokolov","Frank Werner"],"meta":["January 2016International Journal of Production Research","DOI:10.1080/00207543.2015.1129467","Projects: Dynamic scheduling in Industry 4.0 and digital supply chain systemsSupply chain design resilience assessment with structure dynamics considerations"],"references":["272374076_A_decomposition_based_solution_algorithm_for_U-type_assembly_line_balancing_with_interval_data","271101269_A_dynamic_model_and_an_algorithm_for_short-term_supply_chain_scheduling_in_the_smart_factory_industry_40","260349326_Universal_Sequencing_on_an_Unreliable_Machine","258769905_Robust_balancing_of_straight_assembly_lines_with_interval_task_times","257651324_Supply_Chain_Engineering_Useful_Methods_and_Techniques","280790238_Min-Max_and_Min-Max_regret_approaches_to_minimum_cost_tools_selection","269280793_Flexible_job_shop_with_continuous_material_flow","262168646_The_robustness_of_scheduling_policies_in_multi-product_manufacturing_systems_with_sequence-dependent_setup_times_and_finite_buffers","261647357_Maximum_principle-based_methods_for_production_scheduling_with_partially_sequence-dependent_setups","260356752_An_index_for_operational_flexibility_in_chemical_process_design_Part_I_Formulation_and_theory"]}