{"id":"291305137_Social_Media_and_Disasters_Current_Uses_Future_Options_and_Policy_Considerations","abstract":"The development of new technologies that have emerged since the mid-1990s has led to Internet-based applications known as \"social media\" that enable people to interact and share information through media that were non-existent or widely unavailable 15 years ago. Examples of social media include blogs, chat rooms, discussion forums, wikis, YouTube Channels, LinkedIn, Facebook, and Twitter. Social media can be accessed by computer, tablets, smart and cellular phones, and mobile phone text messaging (SMS). In the last five years social media have played an increasing role in emergencies and disasters. Social media sites rank as the fourth most popular source to access emergency information. They have been used by individuals and communities to warn others of unsafe areas or situations, inform friends and family that someone is safe, and raise funds for disaster relief. Facebook supports numerous emergency-related organizations, including Information Systems for Crisis Response and Management (ISCRAM), The Humanitarian Free and Open Source Software (FOSS) Project, as well as numerous universities with disaster-related programs. The use of social media for emergencies and disasters may be conceptualized as two broad categories. First, social media can be used somewhat passively to disseminate information and receive user feedback via incoming messages, wall posts, and polls. To date, this is how most emergency management organizations, including the Federal Emergency Management Agency (FEMA), use social media. A second approach involves the systematic use of social media as an emergency management tool. Systematic usage might include using the medium to conduct emergency communications and issue warnings; using social media to receive victim requests for assistance; monitoring user activities to establish situational awareness; and using uploaded images to create damage estimates, among others. Many of these applications remain speculative, while other uses are still in their infancy. Consequently, most emergency management organizations have confined their use of social media to the dissemination of information. However, recent stories and reports describing how a wide range of international, state, and local organizations have successfully used social media during emergencies and disasters have spurred congressional interest and discussion concerning how social media might be used to improve federal response and recovery capabilities. This report summarizes how social media have been used by emergency management officials and agencies. It also examines the potential benefits, as well as the implications, of using social media in the context of emergencies and disasters.","authors":["B.R. Lindsay"],"meta":["January 2012"],"references":[]}