{"id":"291457415_Artificial_Neural_Network-Based_Speech_Recognition_Using_Dwt_Analysis_Applied_On_Isolated_Words_From_Oriental_Languages","abstract":"Speech recognition is an emerging research area having its focus on human computer interactions (HCI) and expert systems. Analyzing speech signals are often tricky for processing, due to the non-stationary nature of audio signals. The work in this paper presents a system for speaker independent speech recognition, which is tested on isolated words from three oriental languages, i.e., Urdu, Persian, and Pashto. The proposed approach combines discrete wavelet transform (DWT) and feed-forward artificial neural network (FFANN) for the purpose of speech recognition. DWT is used for feature extraction and the FFANN is utilized for the classification purpose. The task of isolated word recognition is accomplished with speech signal capturing, creating a code bank of speech samples, and then by applying pre-processing techniques. For classifying a wave sample, four layered FFANN model is used with resilient back-propagation (Rprop). The proposed system yields high accuracy for two and five classes. For db-8 level-5 DWT filter 98.40%, 95.73%, and 95.20% accuracy rate is achieved with 10, 15, and 20 classes, respectively. Haar level-5 DWT filter shows 97.20%, 94.40%, and 91% accuracy ratefor 10, 15, and 20 classes, respectively. The proposed system is also compared with a baseline method where it shows better performance. The proposed system can be utilized as a communication interface to computing and mobile devices for low literacy regions.","authors":["Bacha Rehman","Zahid Halim","Ghulam Abbas","Tufail Muhammad"],"meta":["September 2015Malaysian Journal of Computer Science 28(3):242-262","DOI:10.22452/mjcs.vol28no3.5","Project: Novel Methodologies for Urdu Interface Design and Speech Recognition"],"references":["289607740_ASCII_based_GUI_system_for_Arabic_scripted_languages_A_case_of_Urdu","276454791_Google_Public_Libraries_and_the_Deep_Web","276248376_Beyond_the_hype_Big_data_concepts_methods_and_analytics","320045707_Fuzzy-Membership_Based_Writer_Identification_from_Handwritten_Devnagari_Script","319770184_Speech_Recognition_With_Deep_Recurrent_Neural_Networks","280796081_Education_System_to_Learn_the_Skills_of_Management_Decision-Making_by_Using_Business_Simulator_with_Speech_Recognition_Technology","279270160_WIT_Weka_interface_translator","278681351_MFCC-DTW_Algorithm_for_Speech_Recognition_in_an_Intelligent_Wheelchair","277783844_AI_Ethics_Science_Fiction_Meets_Technological_Reality","274265829_A_Kinect-Based_Sign_Language_Hand_Gesture_Recognition_System_for_Hearing-_and_Speech-Impaired_A_Pilot_Study_of_Pakistani_Sign_Language"]}