{"id":"291517437_A_novel_LabVIEW-Based_Multi-Channel_Non-Invasive_Abdominal_Maternal-Fetal_Electrocardiogram_Signal_Generator","abstract":"This paper describes the design, construction, and testing of a multi-channel fetal electrocardiogram (fECG) signal generator based on LabVIEW. Special attention is paid to the fetal heart development in relation to the fetus' anatomy, physiology, and pathology. The non-invasive signal generator enables many parameters to be set, including fetal heart rate (FHR), maternal heart rate (MHR), gestational age (GA), fECG interferences (biological and technical artifacts), as well as other fECG signal characteristics. Furthermore, based on the change in the FHR and in the T wave-to-QRS complex ratio (T/QRS), the generator enables manifestations of hypoxic states (hypoxemia, hypoxia, and asphyxia) to be monitored while complying with clinical recommendations for classifications in cardiotocography (CTG) and fECG ST segment analysis (STAN). The generator can also produce synthetic signals with defined properties for 6 input leads (4 abdominal and 2 thoracic). Such signals are well suited to the testing of new and existing methods of fECG processing and are effective in suppressing maternal ECG while non-invasively monitoring abdominal fECG. They may also contribute to the development of a new diagnostic method, which may be referred to as non-invasive trans-abdominal CTG + STAN. The functional prototype is based on virtual instrumentation using the LabVIEW developmental environment and its associated data acquisition measurement cards (DAQmx). The generator also makes it possible to create synthetic signals and measure actual fetal and maternal ECGs by means of bioelectrodes.","authors":["Radek Martinek","Michal Kelnar","Petr Koudelka","Jan Vaňuš"],"meta":["January 2016Physiological Measurement 37(2):238-256","DOI:10.1088/0967-3334/37/2/238","Project: Advances in Fetal Monitoring"],"references":["298191915_Adaptive_Noise_Suppression_in_Voice_Communication_using_a_Neuro-Fuzzy_Inference_System","289883783_Refining_the_Diagnostic_Quality_of_the_Abdominal_Fetal_Electrocardiogram_using_the_Techniques_of_Artificial_Intelligence","283839606_Enhanced_Processing_and_Analysis_of_Multi-Channel_Non-Invasive_Abdominal_Foetal_ECG_Signals_During_Labor_and_Delivery","283523828_Virtual_Simulator_for_the_Generation_of_Patho-Physiological_Foetal_ECGs_During_the_Prenatal_Period","314943512_Electronic_Fetal_Heart_Rate_Monitoring_and_Its_Relationship_to_Neonatal_and_Infant_Mortality_in_the_United_States","312530775_Fetal_electrocardiogram_ECG_for_fetal_monitoring_during_labour_Reviews","306204663_PhysioBank_PhysioToolkit_and_PhysioNet_Components_of_a_new_research_resource_for_complex_physiologic_signals","305351920_Fetal_heart_rate_monitoring_Fourth_edition","297479847_ECG_signal_processing_classification_and_interpretation_A_comprehensive_framework_of_computational_intelligence","284887448_Adaptive_Filter_Design_for_Extraction_of_Fetus_ECG_Signal"]}