{"id":"291696663_Using_Games_to_Help_Novices_Embrace_Programming_From_Elementary_to_Higher_Education","abstract":"Learning programming is difficult and it presents a great challenge for both students and teachers. The goal is to increase success rate for novice programmers. Students lose their confidence and motivation when they encounter difficulties such as programming environment, language syntax knowledge, problem understanding and debugging. Programming languages are artificial and require high level of abstraction, which is not easy for young students. It is also common knowledge that many adults have more difficulties with learning programming than children. In order to make the difference, we introduced game making course for university undergraduate novice programmers and examined the effect of making games on attitude and motivation for elementary and high school children as well. The objective of using games in this context is to make students learn something serious and difficult like programming while doing something fun like making and playing games. Teachers with a strong understanding of the subject matter they teach are more likely to produce successful students.","authors":["Sasa Mladenovic","Divna Krpan","Monika Mladenović"],"meta":["January 2016International Journal of Engineering Education 32(1):521-531","Project: Artificial Intelligence in COMplex Problem solvIng and LEarning – AI COMPILE"],"references":["305319947_Instructional_Theory_and_Technology_for_the_New_Paradigm_of_Education_160","284626221_Third_generation_educational_use_of_computer_games","274377900_Computational_Thinking","274309848_Computational_Thinking","270606116_Programming_by_choice","315361281_THE_BEST_AND_THE_REST_REVISITING_THE_NORM_OF_NORMALITY_OF_INDIVIDUAL_PERFORMANCE","313573526_Is_it_Age_or_IT_First_Steps_Toward_Understanding_the_Net_Generation","291874399_Gaming_goes_academic","289103667_Evaluation_of_computer_games_developed_by_primary_school_children_to_gauge_understanding_of_programming_concepts","286006347_The_New_Division_of_Labor_How_Computers_Are_Creating_the_Next_Job_Market"]}