{"id":"291777847_When_Teams_Go_Crazy_An_Environment_to_Experience_Group_Dynamics_in_Software_Project_Management_Courses","abstract":"Software development consists to a large extend of human-based processes with continuously increasing demands regarding interdisciplinary team work. Understanding the dynamics of software teams can be seen as highly important to successful project execution. Hence, for future project managers, knowledge about non-technical processes in teams is significant. In this paper, we present a course unit that provides an environment in which students can learn and experience the impact of group dynamics on project performance and quality. The course unit uses the Tuckman model as theoretical framework, and borrows from controlled experiments to organize and implement its practical parts in which students then experience the effects of, e.g., time pressure, resource bottlenecks, staff turnover, loss of key personnel, and other stress factors. We provide a detailed design of the course unit to allow for implementation in further software project management courses. Furthermore, we provide experiences obtained from two instances of this unit conducted in Munich and Karlskrona with 36 graduate students. We observed students building awareness of stress factors and developing counter measures to reduce impact of those factors. Moreover, students experienced what problems occur when teams work under stress and how to form a performing team despite exceptional situations.","authors":["Marco Kuhrmann","Jürgen Münch"],"meta":["May 2016","DOI:10.1145/2889160.2889194","Conference: 38th International Conference on Software Engineering (ICSE 2015), SEETAt: Austin, TX, USA"],"references":["277018260_Extending_Survivability_Models_for_Global_Software_Development_with_Media_Synchronicity_Theory","274587020_Extending_Survivability_Models_for_Global_Software_Development_with_Media_Synchronicity_Theory","271443166_Performance_Alignment_Work_How_Software_Developers_Experience_the_Continuous_Adaptation_of_Team_Performance_in_Lean_and_Agile_Environments","260323113_Building_Blocks_for_Continuous_Experimentation","259356610_Teaching_Software_Process_Modeling","256846735_Creating_Minimum_Viable_Products_in_Industry-Academia_Collaborations","256471371_A_Practical_Approach_to_Align_Research_with_Master's_Level_Courses","279355975_Experimentation_in_Software_Engineering","273317336_On_the_Effects_of_Programming_and_Testing_Skills_on_External_Quality_and_Productivity_in_a_Test-Driven_Development_Context","271455117_Distributed_development"]}