{"id":"291775220_Sub-millisecond_coincidence_detection_in_active_dendritic_trees","abstract":"Simulations of a morphologically reconstructed cortical pyramidal cell suggest that the long, thin, distal dendrites of such a cell may be ideally suited for nonlinear coincidence-detection at time-scales much faster than the membrane time-constant. In the presence of dendritic sodium spiking conductances, such hypothetical computations might occur by two distinct mechanisms. In one mechanism, fast excitatory synaptic currents inside a thin dendrite create strong local depolarizations, whose repolarization—resulting from charge equalization—can be 100-fold faster than the membrane time-constant; two such potentials in exact coincidence might initiate a dendritic spike. In the alternate mechanism, dendritic sodium spikes which do not fire the soma nonetheless create somatic voltage pulses of millisecond width and a few millivolts amplitude. The soma may fire upon the exact coincidence of several of these dendritic spikes, while their strong delayed-rectifier currents prevent the soma from temporally summating them. The average firing rate of a compartmental simulation of this reconstructed cell can be highly sensitive to the precise (submillisecond) arrangement of its inputs; in one simulation, a subtle reorganization of the temporal and spatial distribution of synaptic events can determine whether the cell fires continuously at 200 Hz or not at all.\n\nThe two cellular properties postulated to create this behavior—fast, strong synaptic currents and spiking conductances in the distal dendrites—are at least consistent with physiological recordings of somatic potentials from single and coincident synaptic events; further measurements are proposed. The amplitudes and decays of these simulated fast EPSPs and dendritic spikes can be quantitatively predicted by approximations based on dendritic properties, intracellular resistance, and transmembrane conductance, without invoking any free parameters. These expressions both illustrate the dominant biophysical mechanisms of these very transient events and also allow extrapolation of the simulation results to nearby parameter ranges without requiring further simulation. The possibility that cortical cells perform temporally precise computations on single spikes touches many issues in cortical processing: computational speed, spiking variability, population coding, pairwise cell correlations, multiplexed information transmission, and the functional role of the dendritic tree.","authors":["William R. Softky"],"meta":["January 1994Neuroscience 58(1)"],"references":[]}