{"id":"291826788_Compositional_schedulability_analysis_of_real-time_actor-based_systems","abstract":"We present an extension of the actor model with real-time, including deadlines associated with messages, and explicit application-level scheduling policies, e.g.,“earliest deadline first” which can be associated with individual actors. Schedulability analysis in this setting amounts to checking whether, given a scheduling policy for each actor, every task is processed within its designated deadline. To check schedulability, we introduce a compositional automata-theoretic approach, based on maximal use of model checking combined with testing. Behavioral interfaces define what an actor expects from the environment, and the deadlines for messages given these assumptions. We use model checking to verify that actors match their behavioral interfaces. We extend timed automata refinement with the notion of deadlines and use it to define compatibility of actor environments with the behavioral interfaces. Model checking of compatibility is computationally hard, so we propose a special testing process. We show that the analyses are decidable and automate the process using the Uppaal model checker.","authors":["Mohammad Mahdi Jaghoori","Frank de Boer","Delphine Longuet","Tom Chothia"],"meta":["June 2017Acta Informatica 54(4):1-36","DOI:10.1007/s00236-015-0254-x"],"references":["313531263_Symbolic_model-checking_for_real-time_systems","291153847_Test_cases_generation_for_nondeterministic_real-time_systems","241623425_Programming_and_deployment_of_active_objects_with_application-level_scheduling","227277129_Mechanical_verification_of_the_IEEE_1394a_root_contention_protocol_using_Uppaal2k","290767793_Networks_of_Real-Time_Actors","261847548_Composing_Real-Time_Concurrent_Objects_Refinement_Compatibility_and_Schedulability","246357308_Hard_Real-Time_Computing_Systems_Predictable_Scheduling_Algorithms_and_Applications_-_Second_Edition_Springer_2005","238680363_Hard_Real-Time_Computing_Systems","234827934_Actor-oriented_programming_for_wireless_sensor_networks","227075945_Timed_Automata"]}