{"id":"291833530_R-Storm_Resource-Aware_Scheduling_in_Storm","abstract":"The era of big data has led to the emergence of new systems for real-time distributed stream processing, e.g., Apache Storm is one of the most popular stream processing systems in industry today. However, Storm, like many other stream processing systems lacks an intelligent scheduling mechanism. The default round-robin scheduling currently deployed in Storm disregards resource demands and availability, and can therefore be inecient at times. We present R-Storm (Resource-Aware Storm), a system that implements resource-aware scheduling within Storm. R-Storm is designed to increase overall throughput by maximizing resource utilization while minimizing network latency. When scheduling tasks, R-Storm can satisfy both soft and hard resource constraints as well as minimizing network distance between components that communicate with each other. We evaluate R-Storm on set of micro-benchmark Storm applications as well as Storm applications used in production at Yahoo! Inc. From our experimental results we conclude that R-Storm achieves 30-47% higher throughput and 69-350% better CPU utilization than default Storm for the micro-benchmarks. For the Yahoo! Storm applications, R-Storm outperforms default Storm by around 50% based on overall throughput. We also demonstrate that R-Storm performs much better when scheduling multiple Storm applications than default Storm.","authors":["Boyang Peng","Mohammad Hosseini","Zhihao Hong","Reza Farivar"],"meta":["December 2015","DOI:10.1145/2814576.2814808","Conference: ACM Middleware '15 Proceedings of the 16th ACM Annual Middleware ConferenceAt: Vancouver, Canada"],"references":["273928300_Coordinated_Bandwidth_Adaptations_for_Distributed_3D_Tele-Immersive_Systems","262425060_Energy-Efficient_3D_Texture_Streaming_for_Mobile_Games","262170048_Energy-budget-compliant_adaptive_3D_texture_streaming_in_mobile_games","237100892_Adaptive_Online_Scheduling_in_Storm","306548354_Dryad_Distributed_data-parallel_programs_from_sequential_building_blocks","300590156_Twitter_Heron","277683205_Dryad","271472932_Multidimensional_OFDMA_Scheduling_in_a_Wireless_Network_with_Relay_Nodes","227447203_Dynamic_Programming_and_Strong_Bounds_for_the_0-1_Knapsack_Problem","227443475_A_Branch_Search_Algorithm_for_the_Knapsack_Problem"]}