{"id":"291801654_Folding_DNA_to_create_nanoscale_shapes_and_patterns","abstract":"‘Bottom-up fabrication’, which exploits the intrinsic properties of atoms and molecules to direct their self-organization, is widely used to make relatively simple nanostructures. A key goal for this approach is to create nanostructures of high complexity, matching that routinely achieved by ‘top-down’ methods. The self-assembly of DNA molecules provides an attractive route towards this goal. Here I describe a simple method for folding long, single-stranded DNA molecules into arbitrary two-dimensional shapes. The design for a desired shape is made by raster-filling the shape with a 7-kilobase single-stranded scaffold and by choosing over 200 short oligonucleotide ‘staple strands’ to hold the scaffold in place. Once synthesized and mixed, the staple and scaffold strands self-assemble in a single step. The resulting DNA structures are roughly 100 nm in diameter and approximate desired shapes such as squares, disks and five-pointed stars with a spatial resolution of 6 nm. Because each oligonucleotide can serve as a 6-nm pixel, the structures can be programmed to bear complex patterns such as words and images on their surfaces. Finally, individual DNA structures can be programmed to form larger assemblies, including extended periodic lattices and a hexamer of triangles (which constitutes a 30-megadalton molecular complex).","authors":["Paul Wilhelm Karl Rothemund"],"meta":["March 2006Nature 440(7082)"],"references":["244489845_Eigler_D_M_Schweizer_E_K_Positioning_single_atoms_with_a_scanning_tunneling_microscope_Nature_344_524-526","234904227_Controlled_manipulation_of_nanoparticles_with_an_atomic_force_microscope","232761628_Selective_assembly_on_a_surface_of_supramolecular_aggregates_with_controlled_size_and_shape","231437032_Construction_of_a_DNA-Truncated_Octahedron","230922323_Nucleic_Acid_Nanostructures_Bottom-Up_Control_of_Geometry_on_the_Nanoscale","229008715_DNA-Templated_Self-Assembly_of_Metallic_Nanocomponent_Arrays_on_a_Surface","51290175_Nucleic_Acid_Junctions_and_Lattices","21194197_Molecular_Self-Assembly_and_Nanochemistry_a_Chemical_Strategy_for_the_Synthesis_of_Nanostructures","21139270_Synthesis_From_DNA_of_a_Molecule_with_the_Connectivity_of_a_Cube","14738600_DNA_Double-Crossover_Molecules"]}