{"id":"291951693_Multi-Modal_Perception_for_Selective_Rendering","abstract":"A major challenge in generating high-fidelity virtual environments (VEs) is to be able to provide realism at interactive rates. The high-fidelity simulation of light and sound is still unachievable in real time as such physical accuracy is very computationally demanding. Only recently has visual perception been used in high-fidelity rendering to improve performance by a series of novel exploitations; to render parts of the scene that are not currently being attended to by the viewer at a much lower quality without the difference being perceived. This paper investigates the effect spatialized directional sound has on the visual attention of a user towards rendered images. These perceptual artefacts are utilized in selective rendering pipelines via the use of multi-modal maps. The multi-modal maps are tested through psychophysical experiments to examine their applicability to selective rendering algorithms, with a series of fixed cost rendering functions, and are found to perform significantly better than only using image saliency maps that are naively applied to multi-modal VEs.","authors":["Carlo Harvey","Kurt Debattista","Thomas Bashford-Rogers","Alan Chalmers"],"meta":["January 2016Computer Graphics Forum 36(1):172-183","DOI:10.1111/cgf.12793"],"references":["281842011_Attention_An_information_design_perspective","256090338_Prioritising_signals_for_selective_real-time_audio_processing","249009697_Acoustic_Rendering_and_Auditory-Visual_Cross-Modal_Perception_and_Interaction","243763434_The_Psychophysics_of_Human_Sound_Localization","239856883_An_auditory_model_for_the_detection_of_perceptual_onsets_and_beat_tracking_in_singing","320196719_Parallel_progressive_photon_mapping_on_GPUs","265414258_On_the_Method_of_Paired_Comparisons","263931867_C-LOD_Context-aware_Material_Level-of-Detail_applied_to_Mobile_Graphics","254002999_Perception_in_graphics_visualization_virtual_environments_and_animation","252810200_Engineering_Observations_from_Spatiovelocity_and_Spatiotemporal_Visual_Models"]}