{"id":"291960162_Research_on_network_fixed_point_theory_based_on_the_correlation_of_nodes","abstract":"Power laws are ubiquitous in the complex communication networks of today. Network nodes are correlated. According to the correlation, network fixed point theory is proposed and analyzed. Banach fixed point theory was used to explain the operation of networks. In this way, the validity of network fixed point theory is proved. The iterative node sequences of Markov-like chains are generated by algorithms of routing. Communication network can be considered as a space formed by the node sequences. Based on the correlation of nodes, the more nodes in the sequence, the more accurately reflected the searching object node. The property makes location finding and data mining more accurate in communication. The object node mapped from the source node by some routing rule corresponds to Banach fixed point. The fixed point in network space is the object node. The physical character of network fixed point theory will be highly evident, when the network can provide ubiquitous connection for users. The reason is that when the network scale becomes greater, the colony action of nodes is more obvious, and network fixed point theory can show its physical character better. It has great significant theoretical and practical meaning for the organic and dynamic characters and congestion analysis of complex traffic communication network.","authors":["H. Liu","J. Zhang"],"meta":["April 2007Acta Physica Sinica -Chinese Edition- 56(4):1952-1957"],"references":["11398218_Carlson_J_M_Doyle_J_Highly_optimized_tolerance_a_mechanism_for_power_laws_in_designed_systems_Phys_Rev_E_Stat_Phys_Plasmas_Fluids_Relat_Interdiscip_Topics_60_1412-1427","257219320_Phase_transition_in_a_computer_network_model","240973969_Multiscale_Total_Lagrangian_Formulation_for_Modeling_Dislocation-Induced_Plastic_Deformation_in_Polycrystalline_Materials","222550713_Dynamic_phase_transition_observed_in_the_Internet_traffic_flow","222458842_On_Choosing_a_Task_Assignment_Policy_for_a_Distributed_Server_System","3334437_Self-Similarity_Through_High-Variability_Statistical_Analysis_of_Ethernet_LAN_Traffic_at_the_Source_Level","2548134_Performance_of_Data_Networks_With_Random_Links","1827666_Statistical_Mechanics_Of_Complex_Networks"]}