{"id":"291945846_Ha_Futuro_para_as_Bibliotecas_de_Pesquisa_no_Ambiente_de_eScience","abstract":"Diante das profundas transformações que a pesquisa científica vem passando nas últimas décadas, uma discussão se faz necessária no âmbito da comunidade biblioteconômica e de pesquisa: como as bibliotecas poderão se reposicionar diante dessas mudanças globais, especialmente, as decorrentes do novo paradigma científico pautado na geração, uso e compartilhamento intensivo de dados. Nesta direção, o presente artigo tem como objetivo discutir as possíveis respostas para o que se pode esperar do futuro das bibliotecas de pesquisa no ambiente da eScience. Para tal, o estudo divide-se em duas partes. Na primeira, tomando como metodologia a literatura da área, discute as principais forças que impactam as bibliotecas de pesquisa desencadeadas pelo avanço das tecnologias digitais, como a emergência de um novo modo de fazer ciência, as mudanças no padrão de publicação acadêmica e de comunicação científica, a disponibilização de informações livres e de qualidade na Web e o surgimento de novos concorrentes para biblioteca no fornecimento de informações para a pesquisa. Na segunda parte, o artigo analisa os elementos que devem ser pensados na proposição de um novo modelo de biblioteca de pesquisa inserida nos novos ambientes virtuais de pesquisa. Conclui que, mesmo diante das mudanças que se configuram neste momento significarem para os bibliotecários o fim de alguns ciclos seculares, elas abrem também inúmeras oportunidades para a renovação das bibliotecas de pesquisa colocando-as num patamar mais elevado no mundo da ciência contemporânea.","authors":["Luana Sales","Luís Fernando Sayão"],"meta":["December 2016"],"references":["277234378_Modelos_de_coste_para_la_preservacion_de_los_datos_cientificos_en_la_e-ciencia","273438379_The_Data_Conservancy_Instance_Infrastructure_and_Organizational_Services_for_Research_Data_Curation","267042219_Academic_Library_e-Sciencee-Research_and_Data_Services_in_a_Broader_Context","263618733_Dados_abertos_de_pesquisa_ampliando_o_conceito_de_acesso_livre","263261432_A_New_A_New_Value_Equation_Challenge_The_Emergence_of_eResearch_and_Roles_for_Research_Libraries","44449739_Afinal_o_que_e_biblioteca_digital","263752157_Research_libraries_in_a_modern_environment","250868462_Cyberinfrastructure_Data_and_Libraries_Part_2_Libraries_and_the_Data_Challenge_Roles_and_Actions_for_Libraries","250868461_Cyberinfrastructure_Data_and_Libraries_Part_1_A_Cyberinfrastructure_Primer_for_Librarians","245572956_Cyberscholarship_High_Performance_Computing_Meets_Digital_Libraries"]}