{"id":"291949591_Information_management_model_for_competencies_and_learning_outcomes_in_an_educational_context","abstract":"The Bologna Process opened the door to the globalization of higher education, by creating a unified architecture that enhances the potential of higher education and encourages increasing and continuous interconnection among different higher education strategies in the world, and particularly in Europe. This paper introduces and describes an innovative model for a thorough, organized and systematic analysis of the educational context ̶ MICRA (model for identifying and classifying Competencies and Learning Outcomes), based on the official documents of the Course Units (syllabus and assessment components). The MICRA model was validated by means of a case study. Competencies and Learning Outcomes were identified in the Computer Science Course Units of the Accounting and Business Administration degree at the Institute of Accounting and Administration of Porto (ISCAP/IPP). We are aware that the adoption of this model by different institutions will contribute to the interoperability of learning outcomes, thus enhancing the mobility of teachers and students in the EHEA (European Higher Education Area) and third countries.","authors":["Maria José Angélico Gonçalves","Álvaro Rocha","Manuel Pérez Cota"],"meta":["December 2016Information Systems Frontiers 18(6)","DOI:10.1007/s10796-016-9623-4","Project: Immersive Education"],"references":["330647372_MSIS_2006_Model_Curriculum_and_Guidelines_for_Graduate_Degree_Programs_in_Information_Systems","228941636_Using_a_computing_ontology_as_a_foundation_for_curriculum_development'","44824604_Research_Methods_in_Education","277178195_Pratica_pedagogica_e_cidadania_uma_interpretacao_critica_baseada_na_ideia_de_competencia","270960149_Research_Methods_In_Education","263927756_Tuning_Educational_Structures_in_Europe","221536700_The_computing_ontology_project_the_computing_education_application","220017639_Content_Analysis_An_Introduction_To_Its_Methodology","200465328_Case_Study_Research_Design_Methods"]}