{"id":"291952482_Team-taught_versus_individually_taught_undergraduate_education_a_qualitative_study_of_student_experiences_and_preferences","abstract":"Team teaching is becoming more common in undergraduate programmes of study although the relative merits to the more traditional individually taught courses have not been determined for best practice. For this study, 15 final-year undergraduate computer science students were interviewed to gain insight into their learning experiences. A thematic analysis of the interview data identified the perceived advantages and disadvantages of each mode of teaching. The advantages of individually taught courses included: consistency of content delivery and advice, familiarity with the lecturer’s teaching style and better continuity of the subject content. The disadvantage of individually taught modules included missing knowledge, compared to a team approach. Advantages of team-taught modules included: greater insight into a topic delivered by multiple team members. Disadvantages included: content overlap, conflicting messages relating to assessment, team members not taking ownership of their roles and responsibilities and a belief that overall team failure is worse than individual failure to deliver a module well. The results revealed that individually taught modules were generally preferred to team-taught modules. A set of best practice recommendations are proposed to address the challenges when delivering team-taught teaching and become more student focused.","authors":["Arthur G. Money","Jane Coughlan"],"meta":["December 2016Higher Education 72(6)","DOI:10.1007/s10734-015-9976-5"],"references":["313157845_Content_and_thematic_analysis","285698410_Quality_in_qualitative_research","279187451_Doing_Qualitative_Research_A_Handbook","277495922_The_Many_Faces_of_Collaborative_Planning_and_Teaching","313437854_Constructive_controvercy_The_educative_power_of_intellectual_conflict","311574015_Research_Methods_for_Business","284695967_Research_Methods_for_Clinical_and_Health_Psychology","276935479_Corporate_Strategy","274560328_Addressing_Diverse_Needs_through","272160038_Learning_and_Awareness"]}