{"id":"291939338_Synthesis_of_crystals_with_a_programmable_kinetic_barrier_to_nucleation","abstract":"A central goal of chemistry is to fabricate supramolecular structures of defined function and composition. In biology, control of supramolecular synthesis is often achieved through precise control over nucleation and growth processes: A seed molecule initiates growth of a structure, but this growth is kinetically inhibited in the seed's absence. Here we show how such control can be systematically designed into self-assembling structures made of DNA tiles. These structures, \"zig-zag ribbons,\" are designed to have a fixed width but can grow arbitrarily long. Under slightly supersaturated conditions, theory predicts that elongation is always favorable but that nucleation rates decrease exponentially with increasing width. We confirm experimentally that although ribbons of different widths have similar thermodynamics, nucleation rates decrease for wider ribbons. It is therefore possible to program the nucleation rate by choosing a ribbon width. The presence of a seed molecule, a stabilized version of the presumed critical nucleus, removes the kinetic barrier to nucleation of a ribbon. Thus, we demonstrate the ability to grow supramolecular structures from rationally designed seeds, while suppressing spurious nucleation. Control over DNA tile nucleation allows for proper initiation of algorithmic crystal growth, which could lead to the high-yield synthesis of micrometer-scale structures with complex programmed features. More generally, this work shows how a self-assembly subroutine can be initiated.","authors":["Rebecca Schulman","Erik Winfree"],"meta":["September 2007"],"references":["51296064_Microtubule_nucleation_by_-Tubulin-containing_rings_in_the_centrosome","7237731_Rothemund_PWK_Folding_DNA_to_create_nanoscale_shapes_and_patterns_Nature_440_297-302","13578425_Design_and_Self-Assembly_of_Two-Dimensional_DNA_Crystals","6246026_Paradigms_for_computational_nucleic_acid_design"]}