{"id":"292075221_Diagnosis_of_Acute_Coronary_Syndrome_with_a_Support_Vector_Machine","abstract":"Acute coronary syndrome (ACS) is a serious condition arising from an imbalance of supply and demand to meet myocardium’s metabolic needs. Patients typically present with retrosternal chest pain radiating to neck and left arm. Electrocardiography (ECG) and laboratory tests are used indiagnosis. However in emergency departments, there are some difficulties for physicians to decide whether hospitalizing, following up or discharging the patient. The aim of the study is to diagnose ACS and helping the physician with his decisionto discharge or to hospitalizevia machine learning techniques such as support vector machine (SVM) by using patient data including age, sex, risk factors, and cardiac enzymes (CK-MB, Troponin I) of patients presenting to emergency department with chest pain. Clinical, laboratory, and imaging data of 228 patients presenting to emergency department with chest pain were reviewedand the performance of support vector machine. Four different methods (Support vector machine (SVM), Artificial neural network (ANN), Naïve Bayes and Logistic Regression) were tested and the results of SVM which has the highest accuracy is reported. Among 228 patients aged 19 to 91 years who were included in the study, 99 (43.4 %) were qualified as ACS, while 129 (56.5 %) had no ACS. The classification model using SVM attained a 99.13 % classification success. The present study showed a 99.13 % classification success for ACS diagnosis attained by Support Vector Machine. This study showed that machine learning techniques may help emergency department staff make decisions by rapidly producing relevant data.","authors":["Göksu Bozdereli Berikol","Oktay Yildiz","Ismail Turkay Ozcan"],"meta":["January 2016Journal of Medical Systems 40(4)","DOI:10.1007/s10916-016-0432-6"],"references":["344077996_2020_ESC_Guidelines_for_the_management_of_acute_coronary_syndromes_in_patients_presenting_without_persistent_ST-segment_elevation","311469386_Heart_disease_and_stroke_statistics-2015_update_a_report_from_the_American_Heart_Association","306104576_Cardiovascular_disease_in_Europe_Epidemiological_update_2016","304955469_2015_ESC_Guidelines_for_the_management_of_acute_coronary_syndromes_in_patients_presenting_without_persistent_ST-segment_elevation","340256725_A_tutorial_on_support_vector_regression","321596166_Support_Vector_Machines_for_Pattern_Classification","314065400_Acute_Coronary_Syndrome","311959225_Automated_support_vector_regression","306177494_2014_AHAACC_Guideline_for_the_Management_of_Patients_With_Non-ST-Elevation_Acute_Coronary_Syndromes_A_Report_of_the_American_College_of_CardiologyAmerican_Heart_Association_Task_Force_on_Practice_Guid","303018781_Heart_Disease_and_Stroke_Statistics-2015_Update_A_Report_from_the_American_Heart_Association"]}