{"id":"292074357_Factors_Affecting_ICT_Adoption_among_Distance_Education_Students_based_on_the_Technology_Acceptance_Model-A_Case_Study_at_a_Distance_Education_University_in_Iran","abstract":"The incorporation of Information and Communication Technologies (ICT) into education systems is an active program and movement in education that illustrates modern education and enables an all-encompassing presence in the third millennium; however, prior to applying ICT, the factors affecting the adoption and use of these technologies should be carefully investigated. The present study was conducted to examine the factors affecting ICT adoption among distance education students based on the Technology Acceptance Model. The present descriptive survey was conducted in a statistical population consisting of all the distance education students residing in Isfahan, Iran, in 2013, 281 of who were selected as the sample population through simple random sampling. The data collection tool used was a researcher-made questionnaire designed based on field studies and using the questionnaires used in studies conducted by Nair (2012), Alanazy (2006) and Wikins (2008). The items in each section were designed based on the constructs and factors forming the Technology Acceptance Model examined in this study. Descriptive and inferential statistics were used to analyze the data in SPSS-21 and LISREL. The results of the analysis showed significant relationships between perceived usefulness and ease of ICT use and the attitude toward the use of these technologies, between the attitude toward ICT use and the decision to use ICT, and also between the decision to use ICT and its actual use.","authors":["Negin Barat Dastjerdi"],"meta":["January 2016International Education Studies 9(2):73","DOI:10.5539/ies.v9n2p73"],"references":["289013293_A_conceptual_model_of_technology_and_E-services_acceptance_among_universities'_students_Case_study_Ferdowsi_University_of_Mashhad","286183611_Factors_determining_Adoption_of_Information_Technology_by_Vocational_Agricultural_Teachers_Using_Technology_Acceptance_Model_TAM_in_Kermanshah_Province","251497817_Applying_the_Technology_Acceptance_Model_to_the_introduction_of_healthcare_information_systems","41487652_Factors_Influencing_Acceptance_of_Electronic_Health_Records_in_Hospitals"]}