{"id":"292146346_PARADE_A_Cycle-Accurate_Full-System_Simulation_Platform_for_Accelerator-Rich_Architectural_Design_and_Exploration","abstract":"The power wall and utilization wall in today’s processors have led to a focus on accelerator-rich architecture, which will include a sea of accelerators that can achieve orders-of-magnitude performance and energy gains. The emerging accelerator-rich architecture is still in its early stage, and many design issues, such as the efficient accelerator resource management and communication between accelerators and CPU cores, remain unclear. Therefore, a research platform that can enable those design explorations will be extremely useful. This paper presents the first cycle-accurate full-system simulation Platform for Accelerator-Rich Architectural Design and Exploration (PARADE). PARADE can automatically generate dedicated or composable accelerator simulation modules, simulate the global accelerator management, a coherent cache/scratchpad with shared memory, and a customizable network-on-chip—all at cycle- level. In addition, PARADE provides visualization support to assist architects with design space exploration. Finally, a few case studies are conducted to confirm that PARADE can enable various system-level design space explorations in the accelerator-rich architecture.","authors":["Jason Cong","Zhenman Fang","Michael Gill","Glenn Reinman"],"meta":["November 2015","DOI:10.1109/ICCAD.2015.7372595","Conference: IEEE/ACM 2015 International Conference On Computer Aided Design"],"references":["311474948_LINQits_big_data_on_little_clients","285621547_Dark_silicon_and_the_end_of_multicore_scaling_SIGARCH_Comput","278714386_High-Level_Synthesis","271455545_Aladdin_A_pre-RTL_power-performance_accelerator_simulator_enabling_large_design_space_exploration_of_customized_architectures","270697899_Architecture_Support_for_Domain-Specific_Accelerator-Rich_CMPs","269302215_Simulating_DRAM_controllers_for_future_system_architecture_exploration","269049169_Thin_servers_with_smart_pipes","262407377_LINQits_Big_data_on_little_clients","262295742_Meet_the_walkers_Accelerating_index_traversals_for_in-memory_databases","262213364_Thin_servers_with_smart_pipes_Designing_SoC_accelerators_for_memcached"]}