{"id":"292186628_Performance_of_a_digital_transmitter_leakage_LMS-based_cancellation_algorithm_for_multi-standard_radio-frequency_transceivers","abstract":"This paper deals with a joint estimation algorithm that is dedicated to digital compensation of transmitter leakage pollution in frequency division duplexing transceivers. These transceivers are affected by transmitter to receiver signal leakage. Combined with the nonlinearity of amplifying components in the receiver path, the baseband signal received can be severely polluted by a baseband polluting term. This term is based on the square modulus of the transmitted signal, and it depends on the equivalent transmitter leakage channel which models leakages and the receiver path. Here, we consider a nonconvolutive, time-varying channel that is modeled by a time-varying complex gain and the presence of a fractional delay, modeling the propagation effects into the receiver. The complex gain is a sum of two components, a constant term that models static effects, and a first-order autoregressive model that approximates the time variation of the transmitter leakage channel. We focus here on a fully digital approach, using digital signal processing techniques and knowledge of the transmitted samples to mitigate the pollution. We first express the asymptotic performance of a transmitter leakage gain estimator piloted by a reference-based least-mean-square (LMS) approach in the synchronized case, and then we derive the influence of the fractional delay. We show that, in practice, the fractional delay cannot be neglected, and we propose a joint estimation of the fractional delay and the transmitter leakage gain to perform digital compensation. The proposed method is adaptive, recursive and online, and it has low complexity. This algorithm, that is developed for a flat transmitter leakage channel case, is seen to be robust in a typical selective channel simulation case, and more suitable than a classic multi-tap LMS scheme proposed in the literature.","authors":["Robin Gerzaguet","L. Ros","Fabrice Belvèze","Jean-Marc Brossier"],"meta":["January 2016Digital Signal Processing 51","DOI:10.1016/j.dsp.2016.01.009"],"references":["282751124_Joint_estimation_of_complex_gain_and_fractional_delay_for_Tx_leakage_compensation_in_FDD_transceivers","261166589_Modeling_and_dynamic_cancellation_of_TX-RX_leakage_in_FDD_transceivers","224575291_On_the_performance_of_OFDM_in_zero-IF_receivers_impaired_by_Tx_leakage","299846062_Synchronization_Techniques_for_Digital_Receivers","264086389_On_the_performance_of_digital_adaptive_spur_cancellation_for_multi-standard_radio_frequency_transceivers","261432473_A_new_TX_leakage-suppression_technique_for_an_RFID_receiver_using_a_dead-zone_amplifier","258256148_Digital_compensation_of_transmitter_leakage_in_FDD_zero-IF_receivers","254010756_An_Attenuation_Improvement_Technology_for_Ladder_SAWFBAR_Filters_and_Duplexers_Employing_Cancellation_Circuit","235664622_LMS_based_cancellation_of_second-order_TX_intermodulation_products_in_homodyne_receivers","235663900_The_influence_of_DC_offsets_on_the_digital_cancellation_of_second-order_TX_intermodulation_distortions_in_homodyne_receivers"]}