{"id":"292252868_LTE_the_UMTS_long_term_evolution_from_theory_to_practice","abstract":"Where this book is exceptional is that the reader will not just learn how LTE works but why it works. Adrian Scrase, ETSI Vice-President, International Partnership Projects. LTE - The UMTS Long Term Evolution: From Theory to Practice provides the reader with a comprehensive system-level understanding of LTE, built on explanations of the theories which underlie it. The book is the product of a collaborative effort of key experts representing a wide range of companies actively participating in the development of LTE, as well as academia. This gives the book a broad, balanced and reliable perspective on this important technology. Lucid yet thorough, the book devotes particular effort to explaining the theoretical concepts in an accessible way, while retaining scientific rigour. It highlights practical implications and draws comparisons with the well-known WCDMA/HSPA standards. The authors not only pay special attention to the physical layer, giving insight into the fundamental concepts of OFDMA, SC-FDMA and MIMO, but also cover the higher protocol layers and system architecture to enable the reader to gain an overall understanding of the system. Key Features: Draws on the breadth of experience of a wide range of key experts from both industry and academia, giving the book a balanced and broad perspective on LTE. Provides a detailed description and analysis of the complete LTE system, especially the ground-breaking new physical layer. Offers a solid treatment of the underlying advances in fundamental communications and information theory on which LTE is based. Addresses practical issues and implementation challenges related to the deployment of LTE as a cellular system. Includes an accompanying website containing a complete list of acronyms related to LTE, with a brief description of each (http://www.wiley.com/go/sesia_theumts). This book is an invaluable reference for all research and development engineers involved in LTE implementation, as well as graduate and PhD students in wireless communications. Network operators, service providers and R and D managers will also find this book insightful.","authors":["M. Sesia","M. Toufik","Matthew Baker"],"meta":["January 2009","DOI:10.1002/9780470742891"],"references":[]}