{"id":"292241955_Urbanization_and_the_Transition_from_Agrarian_to_Industrial_Society","abstract":"One of the defining issues in the transition from agrarian to industrial society is the role played by urbanization in the creation of industrial modernity. The approach to this issue deriving from 'urban history' consists of intensive case study research focused on particular urban places. A second approach, inspired by traditions in geography, demography, and planning, focuses on systems of cities and the role of such systems in promoting and reflecting the process of economic development. Practitioners of this approach insist that urban history should be a history of urbanization that transcends the experiences of individual urban communities. This essay is a comparison and critique of models developed by theorists from this second group. The comparison focuses on how four broad themes - trade, production, population, and state-building - function as prime movers of urbanization and economic modernization. The results of this comparison suggest that population movements play a decisive role in urban development and the transition to industrial modernity but these population shifts are best understood in conjunction with the impacts of trade patterns, production activities, and state-building.","authors":["Gary Fields"],"meta":["January 1999Berkeley Planning Journal 13(1):102-128","DOI:10.5070/BP313113032"],"references":["324323003_The_Classical_Theory_of_Economic_Growth","324308360_European_Urbanization_1500-1800","303990494_The_Making_of_Urban_Europe_1000-1994","274816800_Motionless_History","274206219_The_Brenner_Debate_Agrarian_Class_Structure_and_Economic_Development_in_Pre-Industrial_Europe","264479062_Agrarian_class_structure_and_economic_development_in_pre-industrial_Europe","260280316_Method_in_Social_Science","247683018_Toward_the_Modern_Economy_Early_Industry_in_Europe_1500-1800","240298706_The_Economy_of_Europe_in_an_Age_of_Crisis","44549966_Medieval_cities_their_origins_and_the_revival_of_trade_Henri_Pirenne"]}