{"id":"292319130_Extramuros_making_music_in_a_browser-based_language-neutral_collaborative_live_coding_environment","abstract":"The extramuros software was developed to explore live coding and network music, bringing live coding musicians together around shared text buffers. Originally developed to support a globally distributed live coding ensemble, the extramuros software has found additional application in projecting laptop orchestra performances to remote sites, in zero-installation workshop and performance settings, and in facilitating the efficient display of code by an ensemble. As the software works by connecting shared text buffers to audio programming languages through specific network connections augmented by pipes, it is a language-neutral approach. This paper describes the overall architecture of the extramuros system, relating that architecture to perennial network music concerns for bandwidth, security, and synchronization. Examples of early use in workshops, rehearsals and performances by laptop orchestras and other small telematic ensembles are discussed, leading to a concluding discussion of directions for future work.","authors":["David Ogborn","Eldad Tsabary","Ian Jarvis","Alexandra Cárdenas"],"meta":["July 2015","DOI:10.5281/zenodo.19349","Conference: First International Conference on Live Coding (ICLC2015)At: Leeds, UK"],"references":["237722905_PLOrk_The_Princeton_Laptop_Orchestra_Year_One","228915414_Network_Musics_Play_Engagement_and_the_Democratization_of_Performance","228894331_Playing_the_network_the_use_of_time_delays_as_musical_devices","270056710_Music_for_an_Interactive_Network_of_Microcomputers","263165017_Free_as_in_BEER_Some_Explorations_into_Structured_Improvisation_Using_Networked_Live-Coding_Systems","261134964_Tidal_-_Pattern_Language_for_the_Live_Coding_of_Music","259418693_Syneme_Live","259418692_Tele-Media_and_Instrument_Making","259418690_Composing_for_a_Networked_Pulse-Based_Laptop_Orchestra","221038685_Distributed_collective_practices_in_collaborative_music_performance"]}