{"id":"292449186_Game_semantics_for_probabilistic_modal_m-calculi","abstract":"The probabilistic (or quantitative) modal μ-calculus is a fixed-point logic designed\nfor expressing properties of probabilistic labeled transition systems (PLTS’s).\nTwo semantics have been studied for this logic, both assigning to every process\nstate a value in the interval [0, 1] representing the probability that the property\nexpressed by the formula holds at the state. One semantics is denotational and\nthe other is a game semantics, specified in terms of two-player stochastic games.\nThe two semantics have been proved to coincide on all finite PLTS’s. A first\ncontribution of the thesis is to extend this coincidence result to arbitrary PLTS’s.\nA shortcoming of the probabilistic μ-calculus is the lack of expressiveness required\nto encode other important temporal logics for PLTS’s such as Probabilistic\nComputation Tree Logic (PCTL). To address this limitation, we extend the logic\nwith a new pair of operators: independent product and coproduct, and we show\nthat the resulting logic can encode the qualitative fragment of PCTL. Moreover,\na further extension of the logic, with the operation of truncated sum and its dual,\nis expressive enough to encode full PCTL.\nA major contribution of the thesis is the definition of appropriate game semantics\nfor these extended probabilistic μ-calculi. This relies on the definition\nof a new class of games, called tree games, which generalize standard 2-player\nstochastic games. In tree games, a play can be split into concurrent subplays\nwhich continue their evolution independently. Surprisingly, this simple device\nsupports the encoding of the whole class of imperfect-information games known\nas Blackwell games. Moreover, interesting open problems in game theory, such as\nqualitative determinacy for 2-player stochastic parity games, can be reformulated\nas determinacy problems for suitable classes of tree games. Our main technical\nresult about tree games is a proof of determinacy for 2-player stochastic metaparity\ngames, which is the class of tree games that we use to give game semantics\nto the extended probabilistic μ-calculi. In order to cope with measure-theoretic\ntechnicalities, the proof is carried out in ZFC set theory extended with Martin’s\nAxiom at the first uncountable cardinal (MAℵ1).\nThe final result of the thesis shows that the game semantics of the extended\nlogics coincides with the denotational semantics, for arbitrary PLTS’s. However,\nin contrast to the earlier coincidence result, which is proved in ZFC, the proof of\ncoincidence for the extended calculi is once again carried out in ZFC +MAℵ1 .","authors":["Matteo Mio"],"meta":["June 2012"],"references":[]}