{"id":"2925800_Toward_the_Semantic_Geospatial_Web","abstract":"that currently available methods for finding and using information on the web are often insufficient. In order to move the Web from a data repository to an information resource, a totally new way of organizing information is needed. The advent of the Semantic Web promises better retrieval methods by incorporating the data's semantics and exploiting the semantics during the search process. Such a development needs special attention from the geospatial perspective so that the particularities of geospatial meaning are captured appropriately. The creation the Semantic Geospatial Web needs the development multiple spatial and terminological ontologies, each with a formal semantics; the representation of those semantics such that they are available both to machines for processing and to people for understanding; and the processing of geospatial queries against these ontologies and the evaluation of the retrieval results based on the match between the semantics of the expressed information need and the available semantics of the information resources and search systems. This will lead to a new framework for geospatial information retrieval based on the semantics of spatial and terminological ontologies. By explicitly representing the role of semantics in different components of the information retrieval process (people, interfaces, search systems, and information resources), the Semantic Geospatial Web will enable users to retrieve more precisely the data they need, based on the semantics associated with these data.","authors":["Max J Egenhofer"],"meta":["October 2002","DOI:10.1145/585147.585148"],"references":["227513853_Using_Ontologies_for_Integrated_Geographic_Information_Systems","225561063_Assessing_Semantic_Similarities_among_Geospatial_Feature_Class_Definitions","321591847_On_Object-Oriented_Database_Systems","251852107_Treatment_of_Duplicates_in_the_Alexandria_Digital_Library_Gazetteer","239666710_Interoperating_Geographic_Information_Systems","235625251_Object-Oriented_Databases_The_Notation_and_the_Issues","228057911_The_Semantic_Web","221607262_GeoVSM_An_Integrated_Retrieval_Model_for_Geographic_Information","221557477_Object-Oriented_Database_Systems_The_Notion_and_the_Issue","31764457_The_Organization_of_Information_AG_Taylor"]}