{"id":"292523940_Image_Processing_and_Jump_Regression_Analysis","abstract":"Recent statistical tools developed to estimate jump curves and surfaces have broad applications, specifically in the area of image processing. Often, significant differences in technical terminologies make communication between the disciplines of image processing and jump regression analysis difficult. In easy-to-understand language, Image Processing and Jump Regression Analysis builds a bridge between the worlds of computer graphics and statistics by addressing both the connections and the differences between these two disciplines. The author provides a systematic analysis of the methodology behind nonparametric jump regression analysis by outlining procedures that are easy to use, simple to compute, and have proven statistical theory behind them. Key topics include: Conventional smoothing procedures Estimation of jump regression curves Estimation of jump location curves of regression surfaces Jump-preserving surface reconstruction based on local smoothing Edge detection in image processing Edge-preserving image restoration With mathematical proofs kept to a minimum, this book is uniquely accessible to a broad readership. It may be used as a primary text in nonparametric regression analysis and image processing as well as a reference guide for academicians and industry professionals focused on image processing or curve/surface estimation.","authors":["Peihua Qiu"],"meta":["January 2005","DOI:10.1002/0471733156","Projects: Edge Detection and Image DenoisingJump Regression Analysis"],"references":["227650115_Modeling_Daily_and_Subdaily_Cycles_in_Rat_Sleep_Data","293061046_Shewhart_charts_and_serially_recorded_data","288923574_Nonparametric_estimation_of_jump_surface","266352827_Approximating_the_distribution_of_maximum_likelihood_contour_estimators_in_two-region_images","258566054_The_Design_of_Cusum_Quality-Control_Charts","254333009_Analysis_of_CUSUM_and_Other_Markov-Type_Control_Schemes_by_Using_Empirical_Distributions","254286812_Robustness_of_the_Likelihood_Ratio_Test_for_a_Change_in_Simple_Linear_Regression","241736126_Maximal_Correlation_and_Adaptive_Splines","241679631_Nonparametric_estimation_of_functions_with_jump_discontinuities","233444331_A_One-Point_Plot_Equivalent_to_the_Shewhart_Chart_with_Western_Electric_Rules","232925620_Automatic_bandwidth_selection_for_modified_M-smoother","3192821_Computing_joint_distributions_of_2D_moving_median_filters_with_applications_to_detection_of_edges"]}