{"id":"292671735_Quantitative_nanoscale_imaging_of_orientational_order_in_biological_filaments_by_polarized_superresolution_microscopy","abstract":"Essential cellular functions as diverse as genome maintenance and tissue morphogenesis rely on the dynamic organization of filamentous assemblies. For example, the precise structural organization of DNA filaments has profound consequences on all DNA-mediated processes including gene expression, whereas control over the precise spatial arrangement of cytoskeletal protein filaments is key for mechanical force generation driving animal tissue morphogenesis. Polarized fluorescence is currently used to extract structural organization of fluorescently labeled biological filaments by determining the orientation of fluorescent labels, however with a strong drawback: polarized fluorescence imaging is indeed spatially limited by optical diffraction, and is thus unable to discriminate between the intrinsic orientational mobility of the fluorophore labels and the real structural disorder of the labeled biomolecules. Here, we demonstrate that quantitative single-molecule polarized detection in biological filament assemblies allows not only to correct for the rotational flexibility of the label but also to image orientational order of filaments at the nanoscale using superresolution capabilities. The method is based on polarized direct stochastic optical reconstruction microscopy, using dedicated optical scheme and image analysis to determine both molecular localization and orientation with high precision. We apply this method to double-stranded DNA in vitro and microtubules and actin stress fibers in whole cells.","authors":["Cesar Valades","Haitham Ahmed Shaban","Alla Kress","Nicolas Bertaux"],"meta":["February 2016Proceedings of the National Academy of Sciences 113(7):201516811","DOI:10.1073/pnas.1516811113","Project: treatment for biology"],"references":["278393668_Tracing_the_past_of_a_quantum_particle","285892402_Imaging_molecular_order_in_cell_membranes_by_polarization-resolved_fluorescence_microscopy","278706586_Imaging_Molecular_Order_in_Cell_Membranes_by_Polarization-Resolved_Fluorescence_Microscopy","277446565_Dual-view_microscopy_with_a_single_camera_real-time_imaging_of_molecular_orientations_and_calcium","273473385_Determining_the_Rotational_Mobility_of_a_Single_Molecule_from_a_Single_Image_A_Numerical_Study","267742914_Septins_promote_stress_fiber-mediated_maturation_of_focal_adhesions_and_renal_epithelial_motility","262533906_Stresses_at_the_Cell_Surface_during_Animal_Cell_Morphogenesis","260841711_Septins_promote_F-actin_ring_formation_by_crosslinking_actin_filaments_into_curved_bundles","259537008_The_Role_of_Molecular_Dipole_Orientation_in_Single-Molecule_Fluorescence_Microscopy_and_Implications_for_Super-Resolution_Imaging","254825989_Integrating_single-molecule_visualization_and_DNA_micromanipulation"]}