{"id":"292672963_A_Study_of_Cyber_Security_Awareness_in_Educational_Environment_in_the_Middle_East","abstract":"Information security awareness can play an important role in facing cyber-attacks by intruders. The main goal of this paper is to analyse the information security awareness among academic staff, researchers, undergraduate students and employee within educational environments in the Middle East in an attempt to understand the level of awareness of information security, the associated risks and overall impact on the institutions. The results reveal that the participants do not have the requisite knowledge and understanding of the importance of information security principles and their practical application in their day-to-day work. This situation can however be corrected through comprehensive awareness and training programs as well as adopting all the necessary safety measures at all levels of the institution to ensure that the students, academic staff and employees are trustworthy, technology savvy and keep their data safe. Without such training programs and awareness, there will be negative consequences on IT systems and their application usage, as well as on users’ personal security now and in the future. From the weaknesses identified in this survey, some essential recommendations are put forward to remedy the situation.","authors":["Samaher Al-Janabi","Ibrahim AlShourbaji"],"meta":["February 2016Journal of Information & Knowledge Management 15(1):1650007","DOI:10.1142/S0219649216500076"],"references":["320637891_Securing_the_Information_and_Communications_Technology_Global_Supply_Chain_from_Exploitation_Developing_a_Strategy_for_Education_Training_and_Awareness","307916903_The_Need_for_Effective_Information_Security_Awareness","267928527_A_Novel_Methodology_towards_a_Trusted_Environment_in_Mashup_Web_Applications","318747889_Significance_of_Information_Security_Awareness_in_the_Higher_Education_Sector","313552042_CSI_computer_crime_and_security_survey","288372556_SETNRA_An_agent-based_secure_payment_protocol_for_mobile_commerce","275453601_Human_Factors_in_Information_Security_Methods","263449655_The_Cyber_Attack_on_Saudi_Aramco","263245515_Recommendations_for_information_security_awareness_training_for_college_students","263103781_Managing_Employee_Compliance_with_Information_Security_Policies_The_Critical_Role_of_Top_Management_and_Organizational_Culture"]}