{"id":"292669733_Analysis_Of_Question_Papers_In_Engineering_Courses_With_Respect_To_Hots_Higher_Order_Thinking_Skills","abstract":"It is generally perceived that a substantial number of engineering faculty are still unaware of alternative educational methods, and many who are aware of them choose not to incorporate them into their approach to teaching. There are several likely reasons for this inertia, aside from the inevitable human resistance to change. The primary focus of imparting information is restricted to fulfilling the course requirements and, the upcoming term end examination. It is imperative to adopt a change from teaching to learning paradigm engaging the students in Higher Order Thinking Skills. Knowledge and technological advancements are changing the role of engineering and engineering faculty in the society. Engineering Education reforms need to focus on inductive teaching and stimulated learning. Students should be taught critical thinking skills and creative thinking skills to keep pace with the rapidly changing engineering profession. This paper reports the study done to test and explore the faculty awareness of Bloom’s Taxonomy of Educational Objectives in the cognitive domain and Higher Order Thinking Skills (HOTS) and to evaluate question papers set by engineering faculty with respect to HOTS as proposed by Bloom’s Taxonomy. Various active learning strategies to enhance critical thinking skills and creative thinking skills of the students are recommended for use by the faculty in their interactions with the students.","authors":["Sowmya Narayanan","M. Adithan"],"meta":["June 2015American Journal of Engineering Education (AJEE) 6(1):1","DOI:10.19030/ajee.v6i1.9247"],"references":["220017716_Inductive_Teaching_and_Learning_Methods_Definitions_Comparisons_and_Research_Bases","345929572_Analysis_Of_Body_Of_Knowledge_In_Civil_Engineering","289745568_The_impact_of_critical_thinking_instruction_on_minority_engineering_students_at_a_public_urban_higher_education_institution","280152162_Engineering_for_a_Changing_World_-_A_Roadmap_to_the_Future_of_Engineering_Practice_Research_and_Education_Flexner","247151978_Engineering_for_a_Changing_World_A_Roadmap_to_the_Future_of_Engineering_Practice_Research_and_Education","245104165_A_Taxonomy_for_Learning_Teaching_and_Assessing_A_revision_of_Bloom''s_Taxonomy_of_Educational_Objec","201381658_From_Teaching_to_Learning_-_A_New_Paradigm_For_Undergraduate_Education","44828922_A_Taxonomy_for_Learning_Teaching_and_Assessing_a_Revision_of_Bloom's_Taxonomy_of_Educational_Objectives"]}