{"id":"292883843_The_multimedia_principle","abstract":"This chapter provides an overview of the multimedia principle, which refers to the finding that learning with words and pictures is more effective than learning with words alone. Although the multimedia principle initially was synthesized from research focused on text combined with (static or animated) illustrations, currently the term refers more broadly to learning supported by varied forms of visual and verbal content when presented in combination. The multimedia principle provides a rationale for research investigating the optimal design of multimedia learning materials, as well as the ways in which learning strategies and learner processing can combine with multimedia materials to result in specific outcomes. That is, the multimedia principle provides a context for research that examines when, how, why, and under what conditions the multimedia principle applies. This chapter summarizes basic findings on how the multimedia principle operates across different forms of multimedia representations, methods of learner interaction/generation, and levels of learner prior knowledge. Implications for cognitive theory and instructional design are discussed, as are future directions for multimedia research. As new learner-centered technologies become increasingly common, a key challenge will be to understand how the multimedia principle operates within digital environments that provide immersive and highly adaptable experiences. As technology advances, opportunities to embed multimedia content in broader contexts and to develop personalized multimedia content will push the boundaries of the multimedia principle.","authors":["Kirsten Butcher"],"meta":["January 2014","DOI:10.1017/CBO9781139547369.010"],"references":["263922822_Using_Student_Interactions_to_Foster_Rule-Diagram_Mapping_During_Problem_Solving_in_an_Intelligent_Tutoring_System","254464757_Improving_searcher_models_using_mouse_cursor_activity","247502275_Relative_Importance_of_Domain_Knowledge_and_Overall_Aptitude_on_Acquisition_of_Domain-Related_Information"]}