{"id":"292869605_Social_Internet_of_Vehicles_for_Smart_Cities","abstract":"Digital devices are becoming increasingly ubiquitous and interconnected. Their evolution to intelligent parts of a digital ecosystem creates novel applications with so far unresolved security issues. A particular example is a vehicle. As vehicles evolve from simple means of transportation to smart entities with new sensing and communication capabilities, they become active members of a smart city. The Internet of Vehicles (IoV) consists of vehicles that communicate with each other and with public networks through V2V (vehicle-to-vehicle), V2I (vehicle-to-infrastructure) and V2P (vehicle-to-pedestrian) interactions, which enables both the collection and the real-time sharing of critical information about the condition on the road network. The Social Internet of Things (SIoT) introduces social relationships among objects, creating a social network where the participants are not humans, but intelligent objects. In this article, we explore the concept of the Social Internet of Vehicles (SIoV), a network that enables social interactions both among vehicles and among drivers. We discuss technologies and components of the SIoV, possible applications and issues of security, privacy and trust that are likely to arise.","authors":["Leandros Maglaras","Ali H. Al-Bayatti","Ying He","Isabel Wagner"],"meta":["February 2016Journal of Sensor and Actuator Networks 5(1)","DOI:10.3390/jsan5010003"],"references":["283103613_Privacy_assessment_in_vehicular_networks_using_simulation","281970595_Workload_Model_Based_Dynamic_Adaptation_of_Social_Internet_of_Vehicles","313524157_Digital_cities_Technologies_experiences_and_future_perspectives","308873554_Optimal_roadside_unit_placement_with_location_privacy_enhancement_in_vehicular_social_network","308833257_Detection_of_impersonation_attack_in_VANETs_using_BUCK_Filter_and_VANET_Content_Fragile_Watermarking_VCFW","304411424_The_Dynamics_of_Vehicular_Networks_in_Large-Scale_Urban_Environments","300329164_Social-Based_Routing_for_Vehicular_Ad_Hoc_Networks_in_Fixed-Route_Transportation_Scenarios","284126355_Mix-zones_for_location_privacy_in_vehicular_networks","283106599_ReViV_Selective_rebroadcast_mechanism_for_video_streaming_over_VANET","282420389_Accurate_lateral_positioning_from_map_data_and_road_marking_detection"]}