{"id":"292937634_STEM_attrition_College_students'_paths_into_and_out_of_STEM_fields","abstract":"Producing sufficient numbers of graduates who are prepared for science, technology, engineering, and mathematics (STEM) occupations has become a national priority in the United States. To attain this goal, some policymakers have targeted reducing STEM attrition in college, arguing that retaining more students in STEM fields in college is a low-cost, fast way to produce the STEM professionals that the nation needs (President's Council of Advisors on Science and Technology [PCAST] 2012). Within this context, this Statistical Analysis Report (SAR) presents an examination of students' attrition from STEM fields over the course of 6 years in college using data from the 2004/09 Beginning Postsecondary Students Longitudinal Study (BPS:04/09) and the associated 2009 Postsecondary Education Transcript Study (PETS:09). In this SAR, the term STEM attrition refers to enrollment choices that result in potential STEM graduates (i.e., undergraduates who declare a STEM major) moving away from STEM fields by switching majors to non-STEM fields or leaving postsecondary education before earning a degree or certificate.1 The purpose of this study is to gain a better understanding of this attrition by: • determining rates of attrition from STEM and non-STEM fields; • identifying characteristics of students who leave STEM fields; • comparing the STEM coursetaking and performance of STEM leavers and persisters; and • examining the strength of various factors' associations with STEM attrition. Data from a cohort of students who started their postsecondary education in a bachelor's or associate's degree program in the 2003-04 academic year were used to examine students' movement into and out of STEM fields over the subsequent 6 years through 2009. Analyses were performed separately for beginning bachelor's and associate's degree students. For brevity, these two groups are frequently referred to as bachelor's or associate's degree students in this study. Selected findings from this SAR are described below.","authors":["X. Chen"],"meta":["January 2014"],"references":["263196545_Tracking_Financial_Aid_and_Persistence_of_Women_Minority_and_Needy_Students_in_Science_Engineering_and_Mathematics","234753041_Academic_success_for_STEM_and_non-STEM","234744050_An_Analysis_of_the_High_Attrition_Rates_among_First_Year_College_Science_Math_and_Engineering_Majors","228669018_Factors_Associated_With_Persistence_in_Science_and_Engineering_Majors_An_Exploratory_Study_Using_Classification_Trees_and_Random_Forests"]}