{"id":"292930986_La_dimension_social_de_los_videojuegos_online_de_las_comunidades_de_jugadores_a_los_e-sports","abstract":"Los avances experimentados por las TIC han provocado cambios en la forma de entender y consumir los medios de comunicación. Los videojuegos no han sido ajenos a estos cambios. Al crecimiento exponencial de su uso y de su relevancia, se unen nuevas estructuras sociales marcadas por la red. Las comunidades activas de jugadores conectados a través de Internet modifican la concepción del usuario de videojuegos en solitario y la forma de consumir este producto de ocio electrónico. Un ejemplo de esa evolución del consumo de videojuegos es el que suponen los deportes electrónicos o e-sports. Dicho fenómeno propone una transición de los videojuegos entendidos como entretenimiento a su concepción como evento social, espectáculo y, en última instancia, competición profesional. Este trabajo ofrece un acercamiento a los cambios que han experimentado los hábitos de consumo de videojuegos desde la popularización de Internet y la web 2.0, centrándose en la influencia que estos ejercen sobre las comunidades de jugadores. El análisis de la bibliografía temática existente permite establecer las pautas de esa evolución y avanzar futuras líneas de investigación. Finalmente, se constata la relación existente entre la dimensión social de los videojuegos y la cultura participativa, fijando la mirada de futuras líneas de investigación construidas alrededor del fenómeno de los deportes electrónicos.","authors":["José Agustín Carrillo Vera"],"meta":["March 2015"],"references":["233489327_The_social_side_of_gaming_How_playing_online_computer_games_creates_online_and_offline_social_support","221541601_Massively_Multi-user_Online_Games_The_Emergence_of_Effective_Collaborative_Activities_for_Learning","27593377_Videojuegos_El_desafio_de_un_nuevo_medio_a_la_Comunicacion_Social","277263519_El_juego_interactivo_el_primer_medio_de_masas_de_la_era_electronica","277260191_La_convergencia_de_los_videojuegos_online_y_los_mundos_virtuales_situacion_actual_y_efectos_sobre_los_usuarios","273946888_Raising_the_Stakes_E-Sports_and_the_Professionalization_of_Computer_Gaming","258173665_Signs_of_meta-change_in_second_modernity_The_growth_of_e-sport_and_the_World_Cyber_Games","220495683_The_effects_of_collective_MMORPG_Massively_Multiplayer_Online_Role-Playing_Games_play_on_gamers'_online_and_offline_social_capital"]}