{"id":"292979738_Towards_Annotating_Potential_Incoherences_in_BioPortal_Mappings","abstract":"BioPortal is a repository for biomedical ontologies that also includes mappings between them from various sources. Considered as a whole, these mappings may cause logical errors, due to incompatibilities between the ontologies or even erroneous mappings.\nWe have performed an automatic evaluation of BioPortal mappings between 19 ontology pairs using the mapping repair systems of LogMap and AgreementMakerLight. We found logical errors in 11 of these pairs, which on average involved 22% of the mappings between each pair. Furthermore, we conducted a manual evaluation of the repair results to identify the actual sources of error, verifying that erroneous mappings were behind over 60% of the repairs.\nGiven the results of our analysis, we believe that annotating BioPortal mappings with information about their logical conflicts with other mappings would improve their usability for semantic web applications and facilitate the identification of erroneous mappings. In future work, we aim to collaborate with BioPortal developers in extending BioPortal with these annotations.","authors":["Daniel Faria","Ernesto Jiménez-Ruiz","Catia Pesquita","Emanuel Santos"],"meta":["October 2014","DOI:10.1007/978-3-319-11915-1_2","Conference: International Semantic Web Conference (ISWC)"],"references":["287522101_Evaluating_mapping_repair_systems_with_large_biomedical_ontologies","286532961_Large-scale_interactive_ontology_matching_Algorithms_and_implementation","285668548_Gene_ontology_Tool_for_the_unification_of_biology","265606885_BioPortal_as_a_Dataset_of_Linked_Biomedical_Ontologies_and_Terminologies_in_RDF","326338123_The_National_Cancer_Institute's_Thesaurus_and_Ontology","309282698_Debugging_and_semantic_clarification_by_pinpointing","289458252_To_repair_or_not_to_repair_Reconciling_correctness_and_coherence_in_ontology_reference_alignments","286023400_Ontology_matching_Second_edition","265519365_The_AgreementMakerLight_Ontology_Matching_System","261180225_Ontology_Matching"]}