{"id":"293012167_Three-Dimensional_Gene_Map_of_Cancer_Cell_Types_Structural_Entropy_Minimisation_Principle_for_Defining_Tumour_Subtypes","abstract":"In this study, we propose a method for constructing cell sample networks from gene expression profiles, and a structural entropy minimisation principle for detecting natural structure of networks and for identifying cancer cell subtypes. Our method establishes a three-dimensional gene map of cancer cell types and subtypes. The identified subtypes are defined by a unique gene expression pattern, and a three-dimensional gene map is established by defining the unique gene expression pattern for each identified subtype for cancers, including acute leukaemia, lymphoma, multi-tissue, lung cancer and healthy tissue. Our three-dimensional gene map demonstrates that a true tumour type may be divided into subtypes, each defined by a unique gene expression pattern. Clinical data analyses demonstrate that most cell samples of an identified subtype share similar survival times, survival indicators and International Prognostic Index (IPI) scores and indicate that distinct subtypes identified by our algorithms exhibit different overall survival times, survival ratios and IPI scores. Our three-dimensional gene map establishes a high-definition, one-to-one map between the biologically and medically meaningful tumour subtypes and the gene expression patterns, and identifies remarkable cells that form singleton submodules.","authors":["Angsheng Li","Xianchen Yin","Yicheng Pan"],"meta":["February 2016Scientific Reports 6(1):20412","DOI:10.1038/srep20412"],"references":["283877567_HomophylyKinship_Model_Naturally_Evolving_Networks","262927915_Quantitative_implementation_of_the_endogenous_molecular_-_cellular_network_hypothesis_in_hepatocellular_carcinoma","313366372_Finding_and_evaluating_community_structure_in_networks_Phys","311344563_Finding_community_structure_in_very_large_networks","287823327_Multiclass_cancer_diagnosis_using_tumor_gene_expression_signatures","276465677_Discovering_natural_communities_in_networks","272077920_Endogenous_Molecular-Cellular_Hierarchical_Modeling_of_Prostate_Carcinogenesis_Uncovers_Robust_Structure","263015305_Multiclass_cancer_classification_based_on_gene_expression_comparison","246863174_Molecular_Classification_of_Cancer_Cla_ss_Discovery_and_Class_Prediction_by_Gene_Expression","245666152_Classification_of_human_lung_carcinomas_by_mRNA_expression_profiling_reveals_distinct_adenocarcinoma"]}