{"id":"293098210_Leveraging_Scratch4SL_and_Second_Life_to_motivate_high_school_students'_participation_in_introductory_programming_courses_Findings_from_a_case_study","abstract":"Students in secondary education strive hard enough to understand basic programming concepts. With all that is known regarding the benefits of programming, little is the published evidence showing how high school students can learn basic programming concepts following innovative instructional formats correctly with the respect to gain/enhance their computational thinking skills. This distinction has caused lack of their motivation and interest in Computer Science courses. This case study presents the opinions of twenty-eight (n = 28) high school students who participated voluntarily in a 3D-game-like environment created in Second Life. This environment was combined with the 2D programming environment of Scratch4SL for the implementation of programming concepts (i.e. sequence and concurrent programming commands) in a blended instructional format. An instructional framework based on Papert's theory of Constructionism to assist students how to coordinate or manage better the learning material in collaborative practice-based learning activities is also proposed. By conducting a mixed-method research, before and after finishing several learning tasks, students’ participation in focus group (qualitative data) and their motivation based on their experiences (quantitative data) are measured. Findings indicated that an instructional design framework based on Constructionism for acquiring or empowering students’ social, cognitive, higher order and computational thinking skills is meaningful. Educational implications and recommendations for future research are also discussed.","authors":["Nikolaos Pellas","Efstratios Peroutseas"],"meta":["March 2018New Review in Hypermedia and Multimedia 23(1):51-79","DOI:10.1080/13614568.2016.1152314"],"references":["314117343_Comparing_Social_Virtual_Worlds_for_Educational_Purposes","307838690_Problem-based_learning_spanning_real_and_virtual_words_a_case_study_in_Second_Life","298716348_Effects_of_annotations_and_homework_on_learning_achievement_An_empirical_study_of_scratch_programming_pedagogy","283258786_Gaming_in_Second_Life_via_Scratch4SL_Engaging_High_School_Students_in_Programming_Courses","266915051_Exploring_Interrelationships_among_High_School_Students'_Engagement_Factors_in_Introductory_Programming_Courses_via_a_3D_Multi-user_Serious_Game_Created_in_Open_Sim","266653559_The_social_turn_in_K-12_programming_Moving_from_computational_thinking_to_computational_participation","277374591_Lowering_the_barriers_to_programming","267725008_Improving_the_Programming_Experience_of_High_School_Students_by_Means_of_Virtual_Worlds","267301980_Using_Virtual_World_Platform_for_Language_and_Critical_Thinking_Skills_Learning_and_Practice","266742384_Mapping_students'_ideas_to_understand_learning_in_a_collaborative_programming_environment"]}