{"id":"293010581_Big_Data_for_Autonomic_Intercontinental_Overlays","abstract":"This paper uses big data and machine learning for the real-time management of Internet scale quality-of-service (QoS) route optimisation with an overlay network. Based on the collection of data sampled every 2 min over a large number of source-destinations pairs, we show that intercontinental Internet protocol (IP) paths are far from optimal with respect to QoS metrics such as end-to-end round-trip delay. We, therefore, develop a machine learning-based scheme that exploits large scale data collected from communicating node pairs in a multihop overlay network that uses IP between the overlay nodes, and selects paths that provide substantially better QoS than IP. Inspired from cognitive packet network protocol, it uses random neural networks with reinforcement learning based on the massive data that is collected, to select intermediate overlay hops. The routing scheme is illustrated on a 20-node intercontinental overlay network that collects some 2× 10-6 measurements per week, and makes scalable distributed routing decisions. Experimental results show that this approach improves QoS significantly and efficiently.","authors":["O. Brun","Lan Wang","Erol Gelenbe"],"meta":["March 2016IEEE Journal on Selected Areas in Communications 34(3):1-1","DOI:10.1109/JSAC.2016.2525518"],"references":["280773061_Design_Patterns_for_Self_Adaptive_Systems_Engineering","264564150_Cognitive_Packet_Network_for_Bilateral_Asymmetric_Connections","260083521_Network_Management_Challenges_in_Software-Defined_Networks","257313280_Large_scale_simulation_for_human_evacuation_and_rescue","314831911_An_end-to-end_approach_to_globally_scalable_programmable_networking","313421758_A_flexible_IP_active_networks_architecture","289245202_Energy-Aware_Routing_in_the_Cognitive_Packet_Network","277286357_End-to-end_routing_behavior_in_the_Internet","266426859_Reward_punishment_and_internal_expectation_for_training_the_random_neural_network_with_reinforcement","238626166_Reinforcement_Learning_An_Intro"]}