{"id":"293014541_Characterization_of_stationary_states_in_random_walks_with_stochastic_resetting","abstract":"It is known that introducing a stochastic resetting in a random-walk process can lead to the emergence of a stationary state. Here we study this point from a general perspective through the derivation and analysis of mesoscopic (continuous-time random walk) equations for both jump and velocity models with stochastic resetting. In the case of jump models it is shown that stationary states emerge for any shape of the waiting-time and jump length distributions. The existence of such state entails the saturation of the mean square displacement to an universal value that depends on the second moment of the jump distribution and the resetting probability. The transient dynamics towards the stationary state depends on how the waiting time probability density function decays with time. If the moments of the jump distribution are finite then the tail of the stationary distributions is universally exponential, but for Lévy flights these tails decay as a power law whose exponent coincides with that from the jump distribution. For velocity models we observe that the stationary state emerges only if the distribution of flight durations has finite moments of lower order; otherwise, as occurs for Lévy walks, the stationary state does not exist, and the mean square displacement grows ballistically or superdiffusively, depending on the specific shape of the distribution of movement durations.","authors":["Vicenç Méndez","Daniel Campos"],"meta":["February 2016PHYSICAL REVIEW E 93(2)","DOI:10.1103/PhysRevE.93.022106"],"references":["265414909_First_Order_Transition_for_the_Optimal_Search_Time_of_Levy_Flights_with_Resetting","261714436_Diffusion_with_resetting_in_arbitrary_spatial_dimension","258038388_Reorientation_patterns_in_central-place_foraging_Internal_clocks_and_klinokinesis","235627572_Monotonic_continuous-time_random_walks_with_drift_and_stochastic_reset_events","51153050_Diffusion_with_Stochastic_Resetting","49751224_Search_in_unknown_random_environments","282000371_Phase_transitions_in_optimal_search_times_How_random_walkers_should_combine_resetting_and_flight_scales","272845390_Dynamical_transition_in_the_temporal_relaxation_of_stochastic_processes_under_resetting","235551326_Fractional_diffusion_and_Lvy_stable_processes","50948809_Intermittent_search_strategies","5498447_Tracing_information_flow_on_a_global_scale_using_Internet_chain-letter_data"]}