{"id":"293162479_Self-categorization_theory","abstract":"This PDF has been generated from SAGE Knowledge. Please note that the pagination of the online version will vary from the pagination of the print book. Self-Categorization Theory Abstract The focus of this chapter is self-categorization theory (SCT). SCT is a theory of the nature of the self that recognizes that perceivers are both individuals and group member, explains how and when people will define themselves as individual and group entities and its implications, and examines the impact of this variability in self-perception ('I' to 'we') for understandings of mind and behaviour. As a result, it has generated a range of distinctive subtheories, hypotheses and findings across a range of significant areas in social psychology. This chapter outlines central steps in the theory's development, its unique contribution and the impact of its ideas with specific details provided in the areas of social influence (more recently, leadership and power) and individuality (e.g. personal self, personal self-perception, personal self-beliefs). In the final section, the way SCT can be applied to better understand and solve a range of social issues is highlighted. A specific example is provided of how core SCT ideas are being implemented in secondary schools with the aim of improving school outcomes (e.g. learning, bullying, wellbeing). It is our view that through an understanding of SCT (and related work) it is possible to appreciate the important and distinctive contribution of social psychology to other areas of psychology and cognate fields.","authors":["J.C. Turner","Katherine J Reynolds"],"meta":["January 2012","DOI:10.4135/9781446249222.n46"],"references":["303609801_Social_Identity_Theory_and_the_Organization","297514453_PERSONALITY_AND_SOCIAL_PSYCHOLOG_Y_BULLETIN_Haslam_et_al_SOCIAL_IDENTITY_AND_STEREOTYPE_CONSENSUS_Social_Identity_Salience_and_the_Emergence_of_Stereotype_Consensus","287749048_The_social_identity_perspective_tomorrow_Opportunities_and_avenues_for_advance","335635142_Identity_Confers_Power_The_New_View_of_Leadership_in_Social_Psychology","313708093_'The_analysis_of_social_influence'","303637211_Social_identity_organizations_and_leadership","292738098_Psychology_in_organizations_The_social_identity_approach","290844075_Self-categorization_principles_underlying_majority_and_minority_influence","286621885_The_New_Psychology_of_Leadership_Identity_Influence_and_Power","285861707_Social_identity_personality_and_the_self-concept_A_self-categorization_perspective"]}