{"id":"293194628_Ask-Elle_an_Adaptable_Programming_Tutor_for_Haskell_Giving_Automated_Feedback","abstract":"Ask-Elle is a tutor for learning the higher-order, strongly-typed functional programming language Haskell. It supports the stepwise development of Haskell programs by verifying the correctness of incomplete programs, and by providing hints. Programming exercises are added to Ask-Elle by providing a task description for the exercise, one or more model solutions, and properties that a solution should satisfy. The properties and model solutions can be annotated with feedback messages, and the amount of flexibility that is allowed in student solutions can be adjusted. The main contribution of our work is the design of a tutor that combines (1) the incremental development of different solutions in various forms to a programming exercise with (2) automated feedback and (3) teacher-specified programming exercises, solutions, and properties. The main functionality is obtained by means of strategy-based model tracing and property-based testing. We have tested the feasibility of our approach in several experiments, in which we analyse both intermediate and final student solutions to programming exercises, amongst others.","authors":["Alex Gerdes","Bastiaan Heeren","Johan Jeuring","L. Thomas van Binsbergen"],"meta":["February 2016International Journal of Artificial Intelligence in Education 27(1)","DOI:10.1007/s40593-015-0080-x"],"references":["290056391_A_Review_of_AI-Supported_Tutoring_Approaches_for_Learning_Programming","289786371_Model_solutions_and_properties_for_diagnosing_student_programs_in_Ask-Elle","287091866_Strategy-based_feedback_in_a_programming_tutor","273632023_Towards_a_Classification_for_Programming_Exercises","321525690_Cognitive_Load_Theory","318494165_The_Haskell_School_of_Expression-Learning_Functional_Programming_Through_Multimedia","316858624_Computer_Science_Curricula_2013_Curriculum_Guidelines_for_Undergraduate_Degree_Programs_in_Computer_Science","300790455_Creating_Data-Driven_Feedback_for_Novices_in_Goal-Driven_Programming_Projects","290672807_Automating_Hint_Generation_with_Solution_Space_Path_Construction","278647688_Cognitive_Load_Theory"]}