{"id":"293808400_Indicators_Development_for_Accreditation_of_Teacher_Education_Programs_in_Thailand","abstract":"This study investigated the perception of faculty members and public officers about the indicators for accreditation of teacher education programs. The purpose of this study was to identify the indicators for accreditation of teacher education programs in Thailand. A total of 145 administrators and faculties of the higher education institutions in Thailand (HEIs) and staffs of Office of the Higher Education Commission (OHEC) participated in this study. Online survey questionnaire was used to collect the data which was described the important indicators using for accreditation of teacher education programs in Thailand. The accreditation indicators of teacher education programs consisted of 5 domains, namely, institutional context, program design, program delivery, program outcomes and quality assurance. As the result for confirmatory factor analysis (CFA), it was found that for accreditation of teacher education programs factor structure was showed the acceptable fit to the data (χ2=2.93, df= 3, p= 0.40, CFI= 1.00, RMSEA= 0.00 RMR= 0.005). Findings of this study could be used in accreditation of teacher education programs in Thailand in the future.","authors":["Chanicha Chaiyaphumthanachok","Kamonwan Tangdhanakanond","Siridej Sujiva"],"meta":["February 2016Procedia - Social and Behavioral Sciences 217:430-434","DOI:10.1016/j.sbspro.2016.02.008"],"references":["268179463_A_GLANCE_AT_STANDARD_DEVELOPMENT_STUDIES_AND_ACCREDITATION_PROCESS_AS_SUSTAINING_TOOLS_FOR_QUALITY_IN_TEACHER_EDUCATION_IN_TURKEY","309032267_Cutoff_criteria_for_fit_indexes_in_covariance_structure_analysis_Conventional_criteria_versus_new_alternatives","273959362_Is_the_Asian_quality_assurance_system_for_higher_education_going_glonacal_Assessing_the_impact_of_three_types_of_program_accreditation_on_Taiwanese_universities","233251021_The_Power_of_Accreditation_Views_of_Academics","229795639_Common_Standards_for_Programme_Evaluations_and_Accreditation","228079281_Cutoff_Criteria_for_Fit_Indexes_in_Covariance_Structure_Analysis_Conventional_Criteria_Versus_New_Alternatives"]}