{"id":"293816223_Climbing_Up_the_Leaderboard_An_Empirical_Study_of_Applying_Gamification_Techniques_to_a_Computer_Programming_Class","abstract":"Conventional taught learning practices often experience difficulties in keeping students motivated and engaged. Video games, however, are very successful at sustaining high levels of motivation and engagement through a set of tasks for hours without apparent loss of focus. In addition, gamers solve complex problems within a gaming environment without feeling fatigue or frustration, as they would typically do with a comparable learning task. Based on this notion, the academic community is keen on exploring methods that can deliver deep learner engagement and has shown increased interest in adopting gamification – the integration of gaming elements, mechanics, and frameworks into non-game situations and scenarios – as a means to increase student engagement and improve information retention. Its effectiveness when applied to education has been debatable though, as attempts have generally been restricted to one-dimensional approaches such as transposing a trivial reward system onto existing teaching materials and/or assessments. Nevertheless, a gamified, multi-dimensional, problem-based learning approach can yield improved results even when applied to a very complex and traditionally dry task like the teaching of computer programming, as shown in this paper. The presented quasi-experimental study used a combination of instructor feedback, real time sequence of scored quizzes, and live coding to deliver a fully interactive learning experience. More specifically, the “Kahoot!” Classroom Response System (CRS), the classroom version of the TV game show “Who Wants To Be A Millionaire?”, and Codecademy’s interactive platform formed the basis for a learning model which was applied to an entry-level Python programming course. Students were thus allowed to experience multiple interlocking methods similar to those commonly found in a top quality game experience. To assess gamification’s impact on learning, empirical data from the gamified group were compared to those from a control group who was taught through a traditional learning approach, similar to the one which had been used during previous cohorts. Despite this being a relatively small-scale study, the results and findings for a number of key metrics, including attendance, downloading of course material, and final grades, were encouraging and proved that the gamified approach was motivating and enriching for both students and instructors.","authors":["Panagiotis Fotaris","Theodoros Mastoras","Richard Leinfellner","Yasmine Rosunally"],"meta":["May 2016Electronic Journal of e-Learning 14(2):95-110","Project: Gamification for learning"],"references":["345959032_Gamification-based_e-learning_Platform_for_Computer_Programming_Education","289790603_Visualisation_and_Gamification_of_e-Learning_and_Programming_Education","284733933_Student_Response_clicker_Systems_Preferences_of_biomedical_physiology_students_in_asian_classes","339856562_The_Multiplayer_Classroom_Designing_Coursework_as_a_Game","289963904_Intrinsic_and_extrinsic_motivations_Classic_definitions_and_new_directions","289963001_Intrinsic_and_Extrinsic_Motivations_Classic_Definition_and_New_Directions","285136243_The_change-up_in_lectures","281049797_A_Framework_for_Pedagogical_Evaluation_of_Virtual_Learning_Environments","272177743_Innovations_in_Education_Training_International_Note_-_taking_A_critical_review_Note-taking_A_critical_review","271787795_Digital_Game-Based_Learning"]}