{"id":"293965750_Multiculturalism_and_Creativity_Effects_of_Cultural_Context_Bicultural_Identity_and_Ideational_Fluency","abstract":"Today’s diverse society often includes culturally rich environments that contain cues pertaining to more than one culture. These cultural cues can shape cognitive processes, such as creativity. Recent evidence shows that bicultural experience enhances creativity, and that for culture-related domains, this effect is particularly evident among biculturals who blend their two cultural identities. The present study tested whether enhanced creativity among more blended biculturals was due to increased idea generation (i.e., ideational fluency). Moreover, the authors tested whether these effects generalized to noncultural domains, which may indicate that bicultural experience enhances creativity in broader arenas. One hundred seventy-seven Chinese\nAmericans completed a creativity task in either a monocultural or bicultural context (manipulated via Chinese or American symbols or both). Greater bicultural identity blendedness predicted domain-general creativity in bicultural but not in monocultural contexts, and this was mediated by ideational fluency. Implications for enhancing creativity in our diverse society are discussed.","authors":["Carmel Saad","Rodica Ioana Damian","Veronica Benet","Wesley Moons"],"meta":["May 2013Social Psychological and Personality Science 4(3):369-375"],"references":["264409805_Is_Originality_in_the_Eye_of_the_Beholder_Comparison_of_Scoring_Techniques_in_the_Assessment_of_Divergent_Thinking","247723656_Negotiating_BiculturalismCultural_Frame_Switching_in_Biculturals_with_Oppositional_Versus_Compatible_Cultural_Identities","318494175_The_nature_of_human_intelligence","314115125_Creative_cognition_Theory_research_and_applications","280757382_Immigration_Acculturation_and_Adaptation","274911801_Multiple_Regression_Testing_and_Interpreting_Interactions","264466831_Effects_of_Novel_Conceptual_Combination_on_Creativity","262083068_Managing_Cultural_Diversity_Implications_for_Organizational_Competitiveness","247726922_The_Effects_of_Scoring_Formulas_on_the_Discriminant_Validity_of_Tests_of_Divergent_Thinking","247670902_Lead_Article_-_Immigration_Acculturation_and_Adaptation"]}