{"id":"294087753_Maximum_Growth_Potential_and_Periods_of_Resource_Limitation_in_Apple_Tree","abstract":"Knowledge of seasonal maximum potential growth rates are important for assessing periods of resource limitations in fruit tree species. In this study we assessed the periods of resource limitation for vegetative (current year stems, and woody biomass) and reproductive (fruit) organs of a major agricultural crop: the apple tree. This was done by comparing relative growth rates of individual organs in trees with reduced competition for resources to trees grown under standard field conditions. Special attention was dedicated to disentangling patterns and values of maximum potential growth for each organ type. The period of resource limitation for vegetative growth was much longer than in another fruit tree species (peach): from late May until harvest. Two periods of resource limitation were highlighted for fruit: from the beginning of the season until mid-June, and about one month prior to harvest. By investigating the variability in individual organs growth we identified substantial differences in relative growth rates among different shoot categories (proleptic and epicormic) and within each group of monitored organs. Qualitatively different and more accurate values of growth rates for vegetative organs, compared to the use of the simple compartmental means, were estimated. Detailed, source-sink based tree growth models, commonly in need of fine parameter tuning, are expected to benefit from the results produced by these analyses.","authors":["Francesco Reyes","Theodore M Dejong","Pietro Franceschi","Massimo Tagliavini"],"meta":["February 2016Frontiers in Plant Science 7(128)","DOI:10.3389/fpls.2016.00233"],"references":["305083189_Carbohydrate_Reserves_Translocation_and_Storage_in_Woody_Plant_Roots","324284686_The_Biometry_of_Plant_Growth","310748075_World_production_trade_consumption_and_economic_outlook_for_apples","298729338_Effects_of_Thinning_Blossom_and_Fruitlets_on_Growth_and_Cropping_of_Sunset_Apple","290241748_Using_organ_growth_potentials_to_identify_physiological_and_horticultural_limitations_to_yield","286347440_Relationships_between_stem_length_leaf_area_stem_weight_and_accumulated_growing_degree-days_in_apple_shoots","284761999_The_Influence_of_Shoot_Competition_on_Fruit_Retention_and_Cropping_of_Apple_Trees","284399661_Information_Theory_and_an_Extension_of_the_Maximum_Likelihood_Principle","284230134_Regulatory_aspects_of_alternate_bearing_in_fruit_trees","281203455_Aspects_of_carbon_supply_and_demand_in_apple_fruits"]}