{"id":"294090802_Even_Einstein_Struggled_Effects_of_Learning_About_Great_Scientists'_Struggles_on_High_School_Students'_Motivation_to_Learn_Science","abstract":"Students’ beliefs that success in science depends on exceptional talent negatively impact their motivation to learn. For example, such beliefs have been shown to be a major factor steering students away from taking science and math courses in high school and college. In the present study, we tested a novel story-based instruction that models how scientists achieve through failures and struggles. We designed this instruction to challenge this belief, thereby improving science learning in classroom settings. A demographically diverse group of 402 9th and 10th grade students read 1 of 3 types of stories about eminent scientists that described how the scientists (a) struggled intellectually (e.g., made mistakes in investigating scientific problems, and overcame the mistakes through effort), (b) struggled in their personal life (e.g., suffered family poverty and lack of parental support but overcame it), or (c) made great discoveries (a control condition, similar to the instructional material that appears in many science textbooks, that did not describe any struggles). Results showed that participation in either of the struggle story conditions improved science learning postintervention, relative to that of students in the control condition. Additionally, the effect of our intervention was more pronounced for low-performing students. Moreover, far more students in either of the struggle story conditions felt connected to the stories and scientists than did students in the control condition. The use of struggle stories provides a promising and implementable instructional approach that can improve student motivation and academic performance in science and perhaps other subjects as well.","authors":["Xiaodong Lin Siegler","Janet N. Ahn","Jondou Chen","Anny Fang"],"meta":["February 2016Journal of Educational Psychology 108(3)","DOI:10.1037/edu0000092"],"references":["325671636_Motivation_by_positive_or_negative_role_models_Regulatory_focus_determines_who_will_best_inspire_us","317617472_The_Nature_of_Human_Values","303170843_The_Evolution_of_Social_Cognitive_Theory","288467056_Social_Learning_Theory","286304742_Personal_Background_Knowledge_Influences_Cross-Cultural_Understanding","286137721_Stability_and_malleability_in_the_self-concept_in_the_perception_of_others","285723655_Self-theories_and_motivation_Students'_beliefs_about_intelligence","284273085_Increasing_the_salience_of_one's_best_selves_can_undermine_inspiration_by_outstanding_role_models","281453155_Mindset_The_New_Psychology_of_Success","281345455_'An_experiment_is_when_you_try_it_and_see_if_it_works'_A_study_of_grade_7_students'_understanding_of_the_construction_of_scientific_knowledge"]}