{"id":"294109314_In-process_sensing_in_selective_laser_melting_SLM_additive_manufacturing","abstract":"Additive manufacturing and specifically metal selective laser melting (SLM) processes are rapidly being industrialized. In order for this technology to see more widespread use as a production modality, especially in heavily regulated industries such as aerospace and medical device manufacturing, there is a need for robust process monitoring and control capabilities to be developed that reduce process variation and ensure quality. The current state of the art of such process monitoring technology is reviewed in this paper. The SLM process itself presents significant challenges as over 50 different process input variables impact the characteristics of the finished part. Understanding the impact of feed powder characteristics remains a challenge. Though many powder characterization techniques have been developed, there is a need for standardization of methods most relevant to additive manufacturing. In-process sensing technologies have primarily focused on monitoring melt pool signatures, either from a Lagrangian reference frame that follows the focal point of the laser or from a fixed Eulerian reference frame. Correlations between process measurements, process parameter settings, and quality metrics to date have been primarily qualitative. Some simple, first-generation process control strategies have also been demonstrated based on these measures. There remains a need for connecting process measurements to process models to enable robust model-based control.","authors":["Thomas G. Spears","Scott Gold"],"meta":["December 2016","DOI:10.1186/s40192-016-0045-4"],"references":["279622279_Error_detection_in_laser_beam_melting_systems_by_high_resolution_imaging","279617679_Additive_Manufacturing_by_Direct_Metal_Deposition","306284269_High_Density_Selective_Laser_Melting_of_Waspaloy","296885082_Properties_of_metal_powders_for_additive_manufacturing_A_review_of_the_state_of_the_art_of_metal_powder_property_testing","293148464_The_dawn_of_the_smart_factory","287263896_Laser_material_processing_Fourth_edition","284944001_Laser_weld_quality_monitoring","284690675_A_method_of_assigning_numerical_and_percentage_values_to_the_degree_of_roundness_of_sand_grains","284592966_Atmospheric_control_during_direct_selective_laser_sintering_of_stainless_steel_314S_powder","283363200_Roadmap_for_additive_manufacturing_identifying_the_future_of_freeform_processing"]}