{"id":"294276739_A_Partial_Carry-Save_On-the-Fly_Correction_Multispeculative_Multiplier","abstract":"Functional Units that are designed to receive inputs and produce outputs using a non-redundant format typically exhibit an inferior performance. In order to overcome this limitation, the carry-save and partial carry-save formats have been proposed. Both approaches are very suitable when implementing addition trees. Nevertheless, if there are multiplications in the datapath, the inputs to the multiplier must be reduced to a non-redundant form, to avoid applying the distributive property. In this paper we present a multiplier able to receive two numbers in partial carry-save format, and produce a result in partial carry-save format as well. This is done by modifying the Booth encoder and leveraging the generate and propagate group signals that are available because of the partial carry-save format. Hence, this can allow to fully implement datapaths without additional penalty cycles due to reductions to non-redundant forms. Experiments show that our proposed multiplier has 15 percent shorter delay with respect to a conventional Booth radix-4 multiplier. Moreover, when combining it with partial carry-save adders it is possible to reduce 36 percent execution time on average for several benchmarks, achieving a 32.7 percent reduction in the Energy Delay Product at the same time.","authors":["Alberto Del Barrio","Román Hermida","Seda Memik"],"meta":["November 2016IEEE Transactions on Computers 65(11):1-1","DOI:10.1109/TC.2016.2529626","Project: Efficient heterogeneous computing: from the processor to the datacenter"],"references":["264049931_Improving_circuit_performance_with_multispeculative_additive_trees_in_high-level_synthesis","262329483_Ultra-Low-Power_Adder_Stage_Design_for_Exascale_Floating_Point_Units","261341522_Modeling_and_synthesis_of_quality-energy_optimal_approximate_adders","261284672_Exploring_the_energy_efficiency_of_Multispeculative_Adders","281262407_High-Performance_Low-Power_Carry_Speculative_Addition_With_Variable_Latency","273394020_High_Speed_Speculative_Multipliers_Based_on_Speculative_Carry-Save_Tree","261340182_Dynamic_AC-scheduling_for_hardware_cores_with_unknown_and_uncertain_information","261189752_An_Optimized_Modified_Booth_Recoder_for_Efficient_Design_of_the_Add-Multiply_Operator","261108193_Scheduling_Independent_Liveness_Analysis_for_Register_Binding_in_High_Level_Synthesis","260585619_Multioperand_Redundant_Adders_on_FPGAs"]}