{"id":"294430193_Generalized_simulation_relations_with_applications_in_automata_theory","abstract":"Finite-state automata are a central computational model in computer science, with\nnumerous and diverse applications. In one such application, viz. model-checking, automata\nover infinite words play a central rˆole. In this thesis, we concentrate on B¨uchi automata\n(BA), which are arguably the simplest finite-state model recognizing languages\nof infinite words. Two algorithmic problems are paramount in the theory of automata:\nlanguage inclusion and automata minimization. They are both PSPACE-complete, thus\nunder standard complexity-theoretic assumptions no deterministic algorithm with worst\ncase polynomial time can be expected. In this thesis, we develop techniques to tackle\nthese problems.\nIn automata minimization, one seeks the smallest automaton recognizing a given\nlanguage (“small” means with few states). Despite PSPACE-hardness of minimization,\nthe size of an automaton can often be reduced substantially by means of quotienting.\nIn quotienting, states deemed equivalent according to a given equivalence are merged\ntogether; if this merging operation preserves the language, then the equivalence is\nsaid to be Good for Quotienting (GFQ). In general, quotienting cannot achieve exact\nminimization, but, in practice, it can still offer a very good reduction in size. The central\ntopic of this thesis is the design of GFQ equivalences for B¨uchi automata.\nA particularly successful approach to the design of GFQ equivalences is based on\nsimulation relations. Simulation relations are a powerful tool to compare the local\nbehavior of automata. The main contribution of this thesis is to generalize simulations,\nby relaxing locality in three perpendicular ways: by fixing the input word in advance\n(fixed-word simulations, Ch. 3), by allowing jumps (jumping simulations, Ch. 4), and by\nusing multiple pebbles (multipebble simulations for alternating BA, Ch. 5). In each case,\nwe show that our generalized simulations induce GFQ equivalences. For fixed-word\nsimulation, we argue that it is the coarsest GFQ simulation implying language inclusion,\nby showing that it subsumes a natural hierarchy of GFQ multipebble simulations.\nFrom a theoretical perspective, our study significantly extends the theory of simulations\nfor BA; relaxing locality is a general principle, and it may find useful applications\noutside automata theory. From a practical perspective, we obtain GFQ equivalences\ncoarser than previously possible. This yields smaller quotient automata, which is beneficial\nin applications. Finally, we show how simulation relations have recently been\napplied to significantly optimize exact (exponential) language inclusion algorithms\n(Ch. 6), thus extending their practical applicability.","authors":["Lorenzo Clemente"],"meta":["June 2012"],"references":[]}