{"id":"294727858_Understanding_Positivity_Within_Dynamic_Team_Interactions_A_Statistical_Discourse_Analysis","abstract":"Positivity has been heralded for its individual benefits. However, how \npositivity dynamically unfolds within the temporal flow of team interactions \nremains unclear. This is an important oversight, as positivity can be key to \nteam problem solving and performance. In this study, we examine how team \nmicro-processes affect the likelihood of positivity occurring within dynamic \nteam interactions. In doing so, we build on and expand previous work \non individual positivity and integrate theory on temporal team processes, \ninteraction rituals, and team problem solving. We analyze 43,139 utterances \nduring the meetings of 43 problem-solving teams in two organizations. First, \nwe find that the observed overall frequency of positivity behavior in a team \nis positively related to managerial ratings of team performance. Second, \nusing statistical discourse analysis, we show that solution-focused behavior and previous positivity within the team interaction process increase the likelihood of subsequent positivity expressions, whereas positivity is less likely after problem-focused behavior. Dynamic speaker switches moderate these effects, such that interaction instances involving more speakers increase the facilitating effects of solutions and earlier positivity for subsequent positivity within team interactions. We discuss the theoretical and managerial \nimplications of micro-level team positivity and its performance benefits.","authors":["Nale Lehmann-Willenbrock","Ming Ming Chiu","Zhike Lei","Simone Kauffeld"],"meta":["February 2016Group & Organization Management 42(1)","DOI:10.1177/1059601116628720","Project: Team and Leadership"],"references":["289964033_Confidence_Limits_for_the_Indirect_Effect_Distribution_of_the_Product_and_Resampling_Methods","288262904_Emotional_climate_Social_structure_and_emotional_dynamics","282815830_Dynamic_affect_in_team_meetings_An_interpersonal_construct_embedded_in_dynamic_interaction_processes","282815588_Social_dynamics_at_work_Meetings_as_a_gateway","281704911_When_Interaction_Flows_An_Exploration_of_Collective_Creative_Processes_on_a_Collaborative_Governance_Board","280087917_Positive_Is_Usually_Good_Negative_Is_Not_Always_Bad_The_Effects_of_Group_Affect_on_Social_Integration_and_Task_Performance","278404327_Social_dynamics_at_work_Meetings_as_a_gateway","321500541_Econometric_Model_Selection_A_New_Approach","284432763_Looking_Back_and_Glimpsing_Forward_The_Broaden-and-Build_Theory_of_Positive_Emotions_as_Applied_to_Organizations","279972306_Objective_Self-Awareness"]}