{"id":"294775501_Using_Virtual_Machine_Allocation_Policies_to_Defend_against_Co-Resident_Attacks_in_Cloud_Computing","abstract":"Cloud computing enables users to consume various IT resources in an on-demand manner, and with low management overhead. However, customers can face new security risks when they use cloud computing platforms. In this paper, we focus on one such threat − the co-resident attack, where malicious users build side channels and extract private information from virtual machines co-located on the same server. Previous works mainly attempt to address the problem by eliminating side channels. However, most of these methods are not suitable for immediate deployment due to the required modifications to current cloud platforms. We choose to solve the problem from a different perspective, by studying how to improve the virtual machine allocation policy, so that it is difficult for attackers to co-locate with their targets. Specifically, we (1) define security metrics for assessing the attack; (2) model these metrics, and compare the difficulty of achieving co-residence under three commonly used policies; (3) design a new policy that not only mitigates the threat of attack, but also satisfies the requirements for workload balance and low power consumption; and (4) implement, test, and prove the effectiveness of the policy on the popular open-source platform OpenStack.","authors":["Yi Han","Jeffrey Chan","Tansu Alpcan","Christopher Leckie"],"meta":["May 2015IEEE Transactions on Dependable and Secure Computing 14(99)","DOI:10.1109/TDSC.2015.2429132"],"references":["269328446_Virtual_machine_allocation_policies_against_co-resident_attacks_in_cloud_computing","268688672_Live_migration_of_virtual_machines","268167421_Security_Games_for_Virtual_Machine_Allocation_in_Cloud_Computing","268064005_Towards_an_understanding_of_oversubscription_in_cloud","266591923_Incentive_Compatible_Moving_Target_Defense_against_VM-Colocation_Attacks_in_Clouds","266587907_Improving_Cloud_Survivability_through_Dependency_based_Virtual_Machine_Placement","291028468_Detecting_Malicious_Co-resident_Virtual_Machines_Indulging_in_Load-Based_Attacks","289087629_Co-Location-Resistant_Clouds","274432001_Detecting_VMs_Co-residency_in_Cloud_Using_Cache-based_Side_Channel_Attacks","266653029_Detecting_co-residency_with_active_traffic_analysis_techniques"]}