{"id":"295086076_SMART_on_FHIR_A_standards-based_interoperable_apps_platform_for_electronic_health_records","abstract":"Objective: \nIn early 2010, Harvard Medical School and Boston Children's Hospital began an interoperability project with the distinctive goal of developing a platform to enable medical applications to be written once and run unmodified across different healthcare IT systems. The project was called Substitutable Medical Applications and Reusable Technologies (SMART).\n\nMethods: \nWe adopted contemporary web standards for application programming interface transport, authorization, and user interface, and standard medical terminologies for coded data. In our initial design, we created our own openly licensed clinical data models to enforce consistency and simplicity. During the second half of 2013, we updated SMART to take advantage of the clinical data models and the application-programming interface described in a new, openly licensed Health Level Seven draft standard called Fast Health Interoperability Resources (FHIR). Signaling our adoption of the emerging FHIR standard, we called the new platform SMART on FHIR.\n\nResults: \nWe introduced the SMART on FHIR platform with a demonstration that included several commercial healthcare IT vendors and app developers showcasing prototypes at the Health Information Management Systems Society conference in February 2014. This established the feasibility of SMART on FHIR, while highlighting the need for commonly accepted pragmatic constraints on the base FHIR specification.\n\nConclusion: \nIn this paper, we describe the creation of SMART on FHIR, relate the experience of the vendors and developers who built SMART on FHIR prototypes, and discuss some challenges in going from early industry prototyping to industry-wide production use.","authors":["Joshua C. Mandel","David A. Kreda","Kenneth D Mandl","Isaac Kohane"],"meta":["February 2016Journal of the American Medical Informatics Association 23(5):ocv189","DOI:10.1093/jamia/ocv189"],"references":["263475812_Are_Meaningful_Use_Stage_2_certified_EHRs_ready_for_interoperability_Findings_from_the_SMART_C-CDA_Collaborative","261351945_HL7_FHIR_An_agile_and_RESTful_approach_to_healthcare_information_exchange","221715949_The_SMART_Platform_Early_experience_enabling_substitutable_applications_for_electronic_health_records","26803725_Archetype-Based_Knowledge_Management_for_Semantic_Interoperability_of_Electronic_Health_Records","6688396_HL7_RIM_an_incoherent_standard","239761730_Everest_a_framework_for_developing_HL7v3_applications","24234699_No_Small_Change_for_the_Health_Information_Economy","2238045_Hypertext_transfer_protocol--HTTP11"]}