{"id":"295192292_A_novel_collaborative_optimization_algorithm_in_solving_complex_optimization_problems","abstract":"To overcome the deficiencies of weak local search ability in genetic algorithms (GA) and slow global convergence speed in ant colony optimization (ACO) algorithm in solving complex optimization problems, the chaotic optimization method, multi-population collaborative strategy and adaptive control parameters are introduced into the GA and ACO algorithm to propose a genetic and ant colony adaptive collaborative optimization (MGACACO) algorithm for solving complex optimization problems. The proposed MGACACO algorithm makes use of the exploration capability of GA and stochastic capability of ACO algorithm. In the proposed MGACACO algorithm, the multi-population strategy is used to realize the information exchange and cooperation among the various populations. The chaotic optimization method is used to overcome long search time, avoid falling into the local extremum and improve the search accuracy. The adaptive control parameters is used to make relatively uniform pheromone distribution, effectively solve the contradiction between expanding search and finding optimal solution. The collaborative strategy is used to dynamically balance the global ability and local search ability, and improve the convergence speed. Finally, various scale TSP are selected to verify the effectiveness of the proposed MGACACO algorithm. The experiment results show that the proposed MGACACO algorithm can avoid falling into the local extremum, and takes on better search precision and faster convergence speed.","authors":["Wu Deng","Huimin Zhao","Li Zou","Guangyu Li"],"meta":["August 2017Soft Computing 21(15)","DOI:10.1007/s00500-016-2071-8","Project: Algorithm"],"references":["276133856_Efficient_Motion_and_Disparity_Estimation_Optimization_for_Low_Complexity_Multiview_Video_Coding","262513253_A_review_of_three_decades_of_research_on_some_combinatorial_optimization_problems","313706874_Adaptation_in_natural_and_artificial_systems","273754326_Hybridizing_ant_colony_optimization_with_firefly_algorithm_for_unconstrained_optimization_problems","273400874_A_New_Hybrid_Method_Based_on_Particle_Swarm_Optimization_Ant_Colony_Optimization_and_3-OPT_Algorithms_for_Travelling_Salesman_Problem","271854467_A_hybrid_genetic_and_imperialist_competitive_algorithm_for_green_vendor_managed_inventory_of_multi-item_multi-constraint_EOQ_model_under_shortage","270007421_A_review_of_chaos-based_firefly_algorithms_Perspectives_and_research_challenges","268750915_A_rapid_learning_algorithm_for_vehicle_classification","265295959_Ant_Colony_Extended_Experiments_on_the_Travelling_Salesman_Problem","263534936_Behaviour_of_pseudo-random_and_chaotic_sources_of_stochasticity_in_nature-inspired_optimization_methods"]}