{"id":"295120696_Modelling_the_microstructure_and_the_viscoelastic_behaviour_of_carbon_black_filled_rubber_materials_from_3D_simulations","abstract":"Volume fraction and spatial repartition of fillers impact the physical properties of rubber. Extended percolating networks of nano-sized fillers significantly modify the macroscopic mechanical properties of rubbers. Random models that describe the multiscale microstructure of rubber and efficient Fourier-based numerical algorithms are combined to predict the material’s mechanical properties. From TEM image analysis, various types of multiscale models were proposed and validated, accounting for the non-homogeneous distribution of fillers: in the present work, aggregates are located outside of an exclusion polymer simulated by two families of random models. The first model generates the exclusion polymer by a Boolean model of spheres. In the second model, the exclusion polymer is a mosaic model built from a Johnson-Mehl tessellation. Here the exclusion polymer and the polymer containing the filler show a similar morphology, contrary to the Boolean model. Aggregates are then described as the intersection of a Boolean model of spheres and of the complementary of the exclusion polymer. Carbon black particles are simulated by a Cox model of spheres in the aggregates. The models rely on a limited number of parameters fitted from experimental covariance and cumulative granulometry. The influence of the model parameters on percolation properties of the models is studied numerically from 3D simulations. Finally, a novel Fourier-based algorithm is proposed to estimate the viscoelastic properties of linear heterogeneous media, in the harmonic regime. The method is compared to analytical results and to a different, time-discretized FFT scheme. As shown in this work, the proposed numerical method is efficient for computing the viscoelastic response of microstructures containing rubbers and fillers.","authors":["Bruno Figliuzzi","Dominique Jeulin","Matthieu Faessel","François Willot"],"meta":["January 2016"],"references":["314076999_Introduction_aux_Marches_Aleatoires","305978989_Random_tessellations_in_Rd","305977186_Random_Johnson-Mehl_tessellations","302970924_A_Simplex_Method_for_Function_Minimization","288884933_Multi-scale_simulation_of_random_spheres_aggregates_-_Application_to_nanocomposites","287525628_Micro-structural_finite_element_modelling_of_the_stiffness_of_filled_elastomers_The_effect_of_filler_number_shape_and_position_in_the_rubber_matrix","285747323_3D_modeling_and_simulation_of_micro-_To_macroscopic_deformation_behavior_of_filled_rubber","284690009_Morphological_analysis_of_carbon-polymer_composite_materials_from_thick_sections","273478746_Numerical_modeling_of_the_thermal_expansion_of_an_energetic_material","270222197_Fourier-based_schemes_for_computing_the_mechanical_response_of_composites_with_accurate_local_fields"]}