{"id":"295121922_Big_Continuous_Data_Dealing_with_Velocity_by_Composing_Event_Streams","abstract":"The rate at which we produce data is growing steadily, thus creating even larger streams of continuously evolving data. Online news, micro-blogs, search queries are just a few examples of these continuous streams of user activities. The value of these streams relies in their freshness and relatedness to on-going events. Modern applications consuming these streams need to extract behaviour patterns that can be obtained by aggregating and mining statically and dynamically huge event histories. An event is the notification that a happening of interest has occurred. Event streams must be combined or aggregated to produce more meaningful information. By combining and aggregating them either from multiple producers, or from a single one during a given period of time, a limited set of events describing meaningful situations may be notified to consumers. Event streams with their volume and continuous production cope mainly with two of the characteristics given to Big Data by the 5V’s model: volume & velocity. Techniques such as complex pattern detection, event correlation, event aggregation, event mining and stream processing, have been used for composing events. Nevertheless, to the best of our knowledge, few approaches integrate different composition techniques (online and post-mortem) for dealing with Big Data velocity. This chapter gives an analytical overview of event stream processing and composition approaches: complex event languages, services and event querying systems on distributed logs. Our analysis underlines the challenges introduced by Big Data velocity and volume and use them as reference for identifying the scope and limitations of results stemming from different disciplines: networks, distributed systems, stream databases, event composition services, and data mining on traces.","authors":["Genoveva vargas solar","Javier A. Espinosa-Oviedo","José Luis Zechinelli Martini"],"meta":["February 2016","DOI:10.1007/978-3-319-27763-9_1","Edition: Big Data Concepts, Theories, and ApplicationsPublisher: SpringerEditor: Shui Yu, Song GuoISBN: 978-3-319-27761-5","Project: CONCERNS, SWANS"],"references":["295134268_Big_Data_Management_Challenges_Approaches_Tools_and_their_limitations","305258038_Event_Specification_in_an_Active_Object-Oriented_Database","305257866_Continuous_Queries_Over_Append-Only_Databases","277679296_Urban_Computing","274479822_Big_Data_and_Its_Technical_Challenges","262167161_SAMOA_A_platform_for_mining_big_data_streams","260624127_IBM_Streams_Processing_Language_Analyzing_Big_Data_in_motion","249777185_SNOOP_EVENT_SPECIFICATION_FORMALIZATION_ALGORITHMS_AND_IMPLEMENTATION_USING_INTERVAL-BASED_SEMANTICS","234827724_Sentinel_an_object-oriented_DBMS_with_event-based_rules","227279341_The_Power_of_Events_An_Introduction_to_Complex_Event_Processing_in_Distributed_Enterprise_Systems"]}