{"id":"295242167_Multi-target_regression_via_input_space_expansion_treating_targets_as_inputs","abstract":"In many practical applications of supervised learning the task involves the prediction of multiple target variables from a common set of input variables. When the prediction targets are binary the task is called multi-label classification, while when the targets are continuous the task is called multi-target regression. In both tasks, target variables often exhibit statistical dependencies and exploiting them in order to improve predictive accuracy is a core challenge. A family of multi-label classification methods address this challenge by building a separate model for each target on an expanded input space where other targets are treated as additional input variables. Despite the success of these methods in the multi-label classification domain, their applicability and effectiveness in multi-target regression has not been studied until now. In this paper, we introduce two new methods for multi-target regression, called stacked single-target and ensemble of regressor chains, by adapting two popular multi-label classification methods of this family. Furthermore, we highlight an inherent problem of these methods—a discrepancy of the values of the additional input variables between training and prediction—and develop extensions that use out-of-sample estimates of the target variables during training in order to tackle this problem. The results of an extensive experimental evaluation carried out on a large and diverse collection of datasets show that, when the discrepancy is appropriately mitigated, the proposed methods attain consistent improvements over the independent regressions baseline. Moreover, two versions of Ensemble of Regression Chains perform significantly better than four state-of-the-art methods including regularization-based multi-task learning methods and a multi-objective random forest approach.","authors":["Eleftherios Spyromitros-Xioufis","Grigorios Tsoumakas","William Groves","I. Vlahavas"],"meta":["July 2016Machine Learning 104(1)","DOI:10.1007/s10994-016-5546-z","Project: multi-target classification/regression methods"],"references":["309185766_Support_vector_regression_machines","339503049_Kernels_for_Vector-Valued_Functions_A_Review","327606791_Classification_And_Regression_Trees","313651940_Multi-Task_Gaussian_process_prediction","313446488_Ridge_regression_Biased_estimation_for_nonorthogonal_problems","313418906_Bayes_optimal_multilabel_classification_via_probabilistic_classifier_chains","312735676_A_Deep_Interpretation_of_Classifier_Chains","312445547_Support_vector_regression_machines","309563249_The_supervised_learning_no-free-lunch_theorems","302365878_Combining_Instance-Based_Learning_and_Logistic_Regression_for_Multilabel_Classification"]}