{"id":"295217225_An_Analysis_of_MOOC_Discussion_Forum_Interactions_from_the_Most_Active_Users","abstract":"Many massive open online courses (MOOCs) offer mainly video-based lectures, which limits the opportunity for interactions and communications among students and instructors. Thus, the discussion forums of MOOC become indispensable in providing a platform for facilitating interactions and communications. In this research, discussion forum users who continually and actively participate in the forum discussions throughout the course are identified. We then employ different measures for evaluating whether those active users have more influence on overall forum activities. We further analyze forum votes, both positive and negative, on posts and comments to verify if active users make positive contributions to the course conversations. Based the result of analysis, users who constantly participate in forum discussions are identified as statistically more influential users, and these users also produce a positive effect on the discussions. Implications for MOOC student engagement and retention are discussed.","authors":["Jian-Syuan Wong","Barton K. Pursel","Anna Divinsky","Bernard J. Jansen"],"meta":["March 2015","DOI:10.1007/978-3-319-16268-3_58","Conference: International Conference on Social Computing, Behavioral-Cultural Modeling, and Prediction"],"references":["264080975_Sentiment_analysis_in_MOOC_discussion_forums_What_does_it_tell_us","250889477_Building_Learning_Communities_in_Online_Courses_The_Importance_of_Interaction","235886638_Blogs_and_Forums_as_Communication_and_Learning_Tools_in_a_MOOC","225242296_Interaction_and_cognitive_engagement_An_analysis_of_four_asynchronous_online_discussions","220374740_Asynchronous_Discussion_Forums_Success_Factors_Outcomes_Assessments_and_Limitations","306178805_Sentiment_analysis_in_MOOC_discussion_forums_What_does_it_tell_us","262360775_Monitoring_MOOCs_Which_information_sources_do_instructors_value","262316314_MOOCs_and_the_funnel_of_participation","262160757_Superposter_behavior_in_MOOC_forums","227828698_'Seeing'_the_Learning_Community_An_Exploration_of_the_Development_of_a_Resource_for_Monitoring_Online_Student_Networking"]}