{"id":"295395520_Community_detection_in_social_networks","abstract":"The expansion of the web and emergence of a large number of social networking sites (SNS) have empowered users to easily interconnect on a shared platform. A social network can be represented by a graph consisting of a set of nodes and edges connecting these nodes. The nodes represent the individuals/entities, and the edges correspond to the interactions among them. The tendency of people with similar tastes, choices, and preferences to get associated in a social network leads to the formation of virtual clusters or communities. Detection of these communities can be beneficial for numerous applications such as finding a common research area in collaboration networks, finding a set of likeminded users for marketing and recommendations, and finding protein interaction networks in biological networks. A large number of community-detection algorithms have been proposed and applied to several domains in the literature. This paper presents a survey of the existing algorithms and approaches for the detection of communities in social networks. We also discuss some of the applications of community detection. For further resources related to this article, please visit the WIREs website.","authors":["Punam Bedi","Chhavi Sharma"],"meta":["February 2016Wiley Interdisciplinary Reviews: Data Mining and Knowledge Discovery 6(3):n/a-n/a","DOI:10.1002/widm.1178"],"references":["281958913_Overlapping_Community_Detection_by_Local_Community_Expansion","280301698_Community_detection_in_dynamic_social_networks_A_game-theoretic_approach","311532789_Latent_dirichlet_allocation","303802749_Indexing_by_Latent_Semantic_Analysis","302341887_An_efficient_heuristic_procedure_for_structure_graphs","295549761_An_Improved_Collaborative_Filtering_Recommendation_Algorithm_Based_on_Community_Detection_in_Social_Networks","283617653_Emergence_of_Scaling_in_Random_Networks","283617410_Emergence_of_Scaling_in_Random_Networks","278699954_Survey_on_Social_Community_Detection","278692132_Community_Detection_Based_on_an_Improved_Modularity"]}