{"id":"2954408_Multimedia_Pedagogues_Interactive_Systems_for_Teaching_and_Learning","abstract":"Multimedia learning environments, or pedagogues, may well revolutionize education as students participate in the educational process through intelligent simulation, dynamic links, and multimedia composition and creation. Multimedia technologies will challenge teachers to instruct dynamically and students to learn actively. The authors believe that this approach will motivate students to want to learn, and free teachers to spend additional time providing individual attention and guidance. To accomplish this, the active learning environment must let users adjust the database parameters to their individual needs. The multimedia system must be able to reason about user actions and respond immediately. To do so, the system must have detailed knowledge about the environment. The authors present case studies of educational multimedia systems already in use, including simulations, tutors, document creation and collaboration, and explanatory systems. For example, the Cardiac Tutor, a knowledge-based simulation for teaching cardiac resuscitation. provides spoken advice, emergency room sounds, and graphic indications of ECG trace, blood gases, and vital signs for senior medical students at the University of Massachusetts. Some technological barriers must be overcome before more effective multimedia tools can be developed. The authors suggest several ways. They discuss the benefits of knowledge- and network-based multimedia systems, and the challenges that must be faced to realize their potential in active learning environments. They also call for effective authoring tools that can evaluate student responses and track student activities. As these technologies mature, multimedia pedagogues will help motivate a shift in education toward active, hands-on learning.","authors":["Beverly Park Woolf","Wendy Hall"],"meta":["June 1995Computer 28(5):74-80","DOI:10.1109/2.384121","SourceIEEE Xplore"],"references":["243764432_Apprenticeship_Training_in_the_Workplace_Computer-Coached_Practice_Environment_as_a_New_Form_of_Apprenticeship","220424875_Intelligent_Interactive_Video_Simulation_of_a_Code_Inspection","275485449_DVI---a_digital_multimedia_technology","242677054_Multimedia_computing_Case_studies_from_MIT_Project_Athena","222222380_Hypermedia_Link_Services_and_Their_Application_to_Multimedia_Information_Management","221604860_Steps_from_Explanation_Planning_to_Model_Construction_Dialogues","221604855_Using_Live_Information''_in_a_Multimedia_Framework","220419716_DVI_-_A_Digital_Multimedia_Technology","37533493_Multimedia_Teaching_with_Microcosm-HiDES_Viceroy_Mountbatten_and_the_Partition_of_India","19625108_Interactive_videodisc_to_teach_combat_trauma_life_support","3338277_Active_Learning_through_Multimedia","3338273_Ending_the_Tyranny_of_the_Button"]}