{"id":"295660366_Introduction_to_Continuum_Mechanics","abstract":"Continuum Mechanics is a branch of physical mechanics that describes the macroscopic mechanical behavior of solid or fluid materials considered to be continuously distributed. It is fundamental to the fields of civil, mechanical, chemical and bioengineering. This time-tested text has been used for over 35 years to introduce junior and senior-level undergraduate engineering students, as well as graduate students, to the basic principles of continuum mechanics and their applications to real engineering problems. The text begins with a detailed presentation of the coordinate invariant quantity, the tensor, introduced as a linear transformation. This is then followed by the formulation of the kinematics of deformation, large as well as very small, the description of stresses and the basic laws of continuum mechanics. As applications of these laws, the behaviors of certain material idealizations (models) including the elastic, viscous and viscoelastic materials, are presented.This new edition offers expanded coverage of the subject matter both in terms of details and contents, providing greater flexibility for either a one or two-semester course in either continuum mechanics or elasticity. Although this current edition has expanded the coverage of the subject matter, it nevertheless uses the same approach as that in the earlier editions - that one can cover advanced topics in an elementary way that go from simple to complex, using a wealth of illustrative examples and problems. It is, and will remain, one of the most accessible textbooks on this challenging engineering subject. Significantly expanded coverage of elasticity in Chapter 5, including solutions of some 3-D problems based on the fundamental potential functions approach.New section at the end of Chapter 4 devoted to the integral formulation of the field equationsSeven new appendices appear at the end of the relevant chapters to help make each chapter more self-containedExpanded and improved problem sets providing both intellectual challenges and engineering applications.","authors":["D. Rubin","E. Krempl"],"meta":["January 2010","DOI:10.1016/B978-0-7506-8560-3.X0001-1"],"references":[]}