{"id":"295795809_ReIOS_Reflective_Architecting_in_the_Internet_of_Objects","abstract":"Self-adaptive systems are modern applications in which the running software system should be able to react on its own, by dynamically adapting its behavior, for sustaining a required set of qualities of service, and dynamic changes in the context or in user requirements. They are typically involved in Future Internet development such as the Internet of things where interoperability, flexibility, and adaptability are key requirements. Convergence of contents, services, things and networks seems to be the cornerstone to fullfil these requirements. We propose a reflective approach to provide a common abstraction for automating the deployment of component based applications in the Internet of Things environment. The proposed framework allows the design of heterogeneous, distributed, and adaptive applications built on the component based software engineering paradigm. The framework considers a metamodel instantiated in a Rest middleware properly modified for allowing different implementations by using reflective design patterns. We are currently working to refine the framework metamodel and to validate it in several implementation domains.","authors":["Marina Mongiello","Gennaro Boggia","Eugenio Di Sciascio"],"meta":["February 2016","DOI:10.5220/0005800603840389","Conference: 4th International Conference on Model-driven Engineering and Software Development (Modelsward 2016) -At: Rome"],"references":["281966323_Adaptive_Architectural_Model_for_Future_Internet_Applications","277138410_An_efficient_resource_naming_for_enabling_constrained_devices_in_SmartM2M_architecture","267987911_In_Search_of_an_Internet_of_Things_Service_Architecture_REST_or_WS-_A_Developers'_Perspective","307686883_Formal_modeling_self-adaptive_service-oriented_applications","307686716_Modeling_and_Analyzing_MAPE-K_Feedback_Loops_for_Self-Adaptation","303281772_Software_engineering_for_self-adaptive_systems_A_second_research_roadmap","301978062_Rule-Based_Modeling_and_Static_Analysis_of_Self-adaptive_Systems_by_Graph_Transformation","274638466_Adaptive_Services_for_the_Future_Internet_JUCS_Special_Issue","271551497_CHOREOS_Large_scale_choreographies_for_the_future_internet","267625658_COLT_Collaborative_Delivery_of_lightweight_IoT_Applications"]}