{"id":"295813222_Design_and_Implementation_of_Iris_Recognition_Based_Attendance_Management_System","abstract":"In the entire globe any educational organization is concerned in relation to the attendance of individuals because this has an effect on their overall performances. In conventional method attendance of students are taken by calling student names or signing on paper which is extremely time overwhelming. To eliminate this problem one of the solutions is a biometric-based attendance system that can automatically capture students' attendance by recognizing their iris. Iris recognition is regarded as one of the most reliable, accurate and efficient biometric identification system due to the inner characteristics of iris, such as uniqueness, immovability and time invariance. The aim of this paper is to design and implement an iris recognition based attendance management system with the latest facilities at an accessible price to think about the financial situation of the large figure of developing countries. The paper includes two parts, hardware and software. The hardware part is responsible to capture images and run required program whereas the software part is responsible for accusation, processing, iris localizing, adjusting, matching and storing data; send the attendance report to the predefined E-mail address. Finally, the system detects, calculates, stores, and transmits the results by performing the MATLAB program.","authors":["Amena Khatun","A.K.M Fazlul Haque","Sabbir Ahmed","Mohammad Mahfujur Rahman"],"meta":["May 2015","DOI:10.1109/ICEEICT.2015.7307458","Conference: ICEEICT, IEEE"],"references":["274044043_Biometric_Iris_Recognition_Based_on_Hybrid_Technique","232590902_A_Design_and_Implementation_of_a_Wireless_Iris_Recognition_Attendance_Management_System","45267149_Improving_Iris_Recognition_Accuracy_By_Score_Based_Fusion_Method","4376330_A_review_of_iris_recognition_algorithms","261284119_Architecture_for_Automated_Student_Attendance","220659911_Statistical_Richness_of_Visual_Phase_Information_Update_on_Recognizing_Persons_by_Iris_Patterns","11837977_Epigenetic_randomness_complexity_and_singularity_of_human_iris_patterns","3308604_How_Iris_Recognition_Works"]}