{"id":"295898572_Listening_The_Ignored_Skill_in_EFL_Context","abstract":"Listening is clearly the weakest skill of EFL students who encounter different kinds of listening problems. It is the most underestimated skill in EFL context, though. This study seeks to examine the listening problems faced by a group of first year university students whose English proficiency level is elementary. 50 EFL students from three different classes were voluntarily selected for the study. The data was gathered by means of a questionnaire and an interview. The results of the study showed some problematic issues in that the EFL students find it difficult to understand the listening text when speakers speak with varied and unfamiliar accents. Besides, they are not able to comprehend the meanings of words which are not pronounced clearly. Furthermore, they are not able to quickly remember the words or phrases they have just heard. Either in high school or university education process, listening skill was a pain in the necks of the EFL students who participated in the study. Finding out EFL students' listening comprehension problems may help EFL teachers assist students improve their listening comprehension skills. As a result, students develop their listening competency. The results of the study may also be beneficial for the researchers having interest in listening skill.","authors":["Ömer Gökhan Ulum"],"meta":["May 2015"],"references":["276792173_Iranian_EFL_Students'_Listening_Comprehension_Problems","267206092_A_Questionnaire_of_Beliefs_on_English_Language_Listening_Comprehension_Problems_Development_and_Validation","314531652_Barriers_to_Academic_Listening_Research_Perspective","288899328_Approaches_to_teaching_listening_in_the_language_classroom","265999462_Using_Authentic_Aural_Materials_to_Develop_Listening_Comprehension_in_the_EFL_Classroom","259786347_EFL_Learners'_Listening_Comprehension_and_Awareness_of_Metacognitive_Strategies_How_Are_They_Related","254939098_What_factors_affect_Japanese_EFL_learners'_listening_comprehension","249252428_Facilitating_Second_Lnaguage_Listening_Comprehension_Acquiring_Successful_Strategies","234613052_A_Study_of_EFL_Listening_Comprehension_Strategies"]}