{"id":"295908595_Toward_a_Real_Time_View-invariant_3D_Action_Recognition","abstract":"In this paper we propose a novel human action recognition method, robust to viewpoint variation, which combines skeleton-and depth-based action recognition approaches. For this matter, we first build several base classifiers, to independently predict the action performed by a subject. Then, two efficient combination strategies , that take into account skeleton accuracy and human body orientation, are proposed. The first is based on fuzzy switcher where the second uses a combination between fuzzy switcher and aggregation. Moreover, we introduce a new algorithm for the estimation of human body orientation. To perform the test we have created a new Multiview 3D Action public dataset with three viewpoint angles (30°,0°,-30°). The experimental results show that an efficient combination strategy of base classifiers improves the accuracy and the computational efficiency for human action recognition.","authors":["Hammouche Mounir","Enjie Ghorbel","Anthony Fleury","Sebastien Ambellouis"],"meta":["February 2016","DOI:10.5220/0005843607450754","Conference: International Joint Conference on Computer Vision, Imaging and Computer Graphics Theory and ApplicationsAt: Roma","Projects: Human action recognitionAction recognition using RGB-D sensors"],"references":["264862848_HOPC_Histogram_of_Oriented_Principal_Components_of_3D_Pointclouds_for_Action_Recognition","313571387_Support_vector_machine_ensemble_with_bagging","289958714_A_Joint_Evaluation_of_Dictionary_Learning_and_Feature_Encoding_for_Action_Recognition","288989718_Robust_3D_Action_Recognition_with_Random_Occupancy_Patterns","287448648_Comparing_Fuzzy_Logic_and_Fuzzy_C-Means_FCM_on_summarizing_indonesian_language_document","283126419_Estimation_of_Human_Orientation_using_Coaxial_RGB-Depth_Images","276211631_A_Survey_on_Truth_Discovery","266081869_Histogram_of_Oriented_Principal_Components_for_Cross-View_Action_Recognition","262400368_Knowing_What_to_Believe_when_you_already_know_something","262212408_Recognizing_actions_using_depth_motion_maps-based_histograms_of_oriented_gradients"]}