{"id":"296396310_A_Complex-Network_Perspective_on_Alexander's_Wholeness","abstract":"The wholeness, conceived and developed by Christopher Alexander, is what exists to some degree or other in space and matter, and can be described by precise mathematical language. However, it remains somehow mysterious and elusive, and therefore hard to grasp. This paper develops a complex network perspective on the wholeness to better understand the nature of order or beauty for sustainable design. I bring together a set of complexity-science subjects such as complex networks, fractal geometry, and in particular underlying scaling hierarchy derived by head/tail breaks – a classification scheme and a visualization tool for data with a heavy-tailed distribution, in order to make Alexander’s profound thoughts more accessible to design practitioners and complexity-science researchers. Through several case studies (some of which Alexander studied), I demonstrate that the complex-network perspective helps reduce the mystery of wholeness and brings new insights to Alexander’s thoughts on the concept of wholeness or objective beauty that exists in fine and deep structure. The complex-network perspective enables us to see things in their wholeness, and to better understand how the kind of structural beauty emerges from local actions guided by the 15 fundamental properties, and by differentiation and adaptation processes. The wholeness goes beyond current complex network theory towards design or creation of living structures. \n\nKEYWORDS: Theory of centers, living geometry, Christopher Alexander, head/tail breaks, and structural beauty","authors":["Bin Jiang"],"meta":["February 2016Physica A: Statistical Mechanics and its Applications 463:475-484","DOI:10.1016/j.physa.2016.07.038","Project: ALEXANDER: Automated generation of living structure for biophilic urban design"],"references":["282272777_A_City_Is_a_Complex_Network","272159333_Wholeness_as_a_Hierarchical_Graph_to_Capture_the_Nature_of_Space","271771290_Defining_Least_Community_as_a_Homogeneous_Group_in_Complex_Networks","306204494_A_City_is_Not_a_Tree_Part_I","303131868_A_city_is_not_a_tree","288954323_Discovering_Nested_Communities","283617410_Emergence_of_Scaling_in_Random_Networks","280566512_Networks_An_Introduction","274926261_Human_Behaviour_and_the_Principle_of_Least-Effort","274801741_Central_Places_in_Southern_Germany"]}