{"id":"296478421_Peer_Review_Social_Network_PeRSoN_in_open_source_projects","abstract":"Software peer review is regarded as one of the most important approaches to preserving software quality. Due to the distributed collaborations in Open Source Software (OSS) development, the review techniques and processes conducted in OSS environment differ from the traditional review method that based on formal face-to-face meetings. Unlike other related works, this study investigates peer review processes of OSS projects from the social perspective: communication and interaction in peer review by using social network analysis (SNA). Moreover, the relationship between peer review contributors and their activities is studied. We propose an approach to evaluating contributors’ activeness and social relationship using SNA named Peer Review Social Network (PeRSoN). We evaluate our approach by empirical case study, 326,286 review comments and 1,745 contributors from three representative industrial OSS projects have been extracted and analyzed. The results indicate that the social network structure influences the realistic activeness of contributors significantly. Based on the results, we suggest our approach can support project leaders in assigning review tasks, appointing reviewers and other activities to improve current software processes.","authors":["Xin Yang","Norihiro Yoshida","Raula Gaikovina Kula","Hajimu Iida"],"meta":["March 2016IEICE Transactions on Information and Systems E99.D(3):661-670","DOI:10.1587/transinf.2015EDP7261"],"references":["283442347_Social_Network_Analysis_in_Open_Source_Software_Peer_Review","266081587_ReDA_A_Web-based_Visualization_Tool_for_Analyzing_Modern_Code_Review_Dataset","262328269_Convergent_contemporary_software_peer_review_practices","261501912_Reducing_human_effort_and_improving_quality_in_peer_code_reviews_using_automatic_static_analysis_and_reviewer_recommendation","256477239_Who_Does_What_during_a_Code_Review_Datasets_of_OSS_Peer_Review_Repositories","304374264_Centrality_in_social_networks_Conceptual_clarification","292218038_The_social_structure_of_Free_and_Open_Source_software_development","277664949_The_Cathedral_and_Bazaar","259952295_Nonparametric_Statistical_Methods","256459693_Who_Does_What_during_a_Code_Review_Datasets_of_OSS_Peer_Review_Repositories"]}