{"id":"296467453_Run-Time_Monitoring_of_Timing_Constraints_A_Survey_of_Methods_and_Tools","abstract":"Despite the availability of static analysis methods to achieve a correct-by-construction design for different systems in terms of timing behavior, violations of timing constraints can still occur at run-time due to different reasons. The aim of monitoring of system performance with respect to the timing constraints is to detect the violations of timing specifications, or to predict them based on the current system performance data. Considerable work has been dedicated to suggesting efficient performance monitoring approaches during the past years. This paper presents a survey and classification of those approaches in order to help researchers gain a better view over different methods and developments in monitoring of timing behavior of systems. Classifications of the mentioned approaches are given based on different items that are seen as important in developing a monitoring system, i.e. the use of additional hardware, the data collection approach, etc. Moreover, a description of how these different methods work is presented in this paper along with the advantages and downsides of each of them.","authors":["Nima Asadi","Mehrdad Saadatmand","Mikael Sjödin"],"meta":["October 2013","Conference: The Eighth International Conference on Software Engineering Advances (ICSEA)"],"references":["236237028_Monitoring_Capabilities_of_Schedulers_in_Model-Driven_Development_of_Real-Time_Systems","234807585_The_worst-case_execution_time_problem-Overview_of_methods_and_survey_of_tools","222693344_Java-MaC_a_Run-time_Assurance_Tool_for_Java_Programs","285500700_An_overview_of_the_PASM_parallel_processing_system","262320221_A_Specificational_Approach_to_High_Level_Program_Monitoring_and_Measuring","250868929_Performance_monitoring_and_evaluation_of_large_embedded_systems","242487967_What_is_predictability_for_real-time_system","242393792_Monitoring_Testing_and_Debugging_of_Distributed_Real-Time_Systems","239744471_A_bibliography_of_parallel_debuggers","227719211_Monitoring_and_debugging_distributed_realtime_programs"]}