{"id":"296585097_Thermographic_particle_velocimetry_TPV_for_simultaneous_interfacial_temperature_and_velocity_measurements","abstract":"We present an experimental technique, that we refer to as ‘thermographic particle velocimetry’ (TPV), which is capable of the simultaneous measurement of two-dimensional (2-D) surface temperature and velocity at the interface of multiphase flows. The development of the technique has been motivated by the need to study gravity-driven liquid-film flows over inclined heated substrates, however, the same measurement principle can be applied for the recovery of 2-D temperature- and velocity-field information at the interface of any flow with a sufficient density gradient between two fluid phases. The proposed technique relies on a single infrared (IR) imager and is based on the employment of highly reflective (here, silver-coated) particles which, when suspended near or at the interface, can be distinguished from the surrounding fluid domain due to their different emissivity. Image processing steps used to recover the temperature and velocity distributions include the decomposition of each original raw IR image into separate thermal and particle images, the application of perspective distortion corrections and spatial calibration, and finally the implementation of standard particle velocimetry algorithms. This procedure is demonstrated by application of the technique to a heated and stirred flow in an open container. In addition, two validation experiments are presented, one dedicated to the measurement of interfacial temperature and one to the measurement of interfacial velocity. The deviations between the results generated from TPV and those from accompanying conventional techniques do not exceed the errors associated with the latter.","authors":["Alexandros Charogiannis","Ivan Zadrazil","Christos N. Markides"],"meta":["February 2016International Journal of Heat and Mass Transfer 97(9):589-595","DOI:10.1016/j.ijheatmasstransfer.2016.02.050","Project: Harnessing unsteady phase-change heat exchange in high-performance concentrated solar power systems"],"references":["283355604_An_experimental_study_of_spatiotemporally_resolved_heat_transfer_in_thin_liquid-film_flows_falling_over_an_inclined_heated_foil","279460435_A_simultaneous_planar_laser-induced_fluorescence_particle_image_velocimetry_and_particle_tracking_velocimetry_technique_for_the_investigation_of_thin_liquid-film_flows","275390613_Thermal_Imaging_Study_of_the_Liquid_Film_Flowing_on_Vertical_Surface_With_Local_Heat_Source","273000475_Experimental_investigation_of_thermal_structures_in_regular_three-dimensional_falling_films","271635882_Characteristics_of_horizontal_liquid-liquid_flows_in_a_circular_pipe_using_simultaneous_high-speed_laser-induced_fluorescence_and_particle_velocimetry","270646411_Phase_diagram_for_the_onset_of_circulating_waves_and_flow_reversal_in_inclined_falling_films","301065205_Marangoni_Effects_on_Wave_Structure_and_Liquid_Film_Breakdown_along_a_Heated_Vertical_Tube","284757967_Wave_flow_of_thin_layers_of_a_viscous_fluid_i_the_free_flow","271614085_Horizontal_liquid-liquid_flow_characteristics_at_low_superficial_velocities_using_laser-induced_fluorescence","270752875_Falling_Film_of_Ionic_Liquid-Water_Binary_Solutions_on_a_Uniformly_Heated_Vertical_Wall"]}