{"id":"296694789_How_to_assess_the_benefits_of_connected_vehicles_A_simulation_framework_for_the_design_of_cooperative_traffic_management_strategies","abstract":"Advances in Information and Communication Technologies (ICT) allow the transportation community to foresee dramatic improvements for the incoming years in terms of a more efficient, environmental friendly and safe traffic management. In that context, new ITS paradigms like Cooperative Systems (C-ITS) enable an efficient traffic state estimation and traffic control. C-ITS refers to three levels of cooperation between vehicles and infrastructure: (i) equipped vehicles with Advanced Driver Assistance Systems (ADAS) adjusting their motion to surrounding traffic conditions; (ii) information exchange with the infrastructure; (iii) vehicle-to-vehicle communication. Therefore, C-ITS makes it possible to go a step further in providing real time information and tailored control strategies to specific drivers. As a response to an expected increasing penetration rate of these systems, traffic managers and researchers have to come up with new methodologies that override the classic methods of traffic modeling and control. In this paper, we discuss some potentialities of C-ITS for traffic management with the methodological issues following the expansion of such systems. Cooperative traffic models are introduced into an open-source traffic simulator. The resulting simulation framework is robust and able to assess potential benefits of cooperative traffic control strategies in different traffic configurations.","authors":["Maxime Guériau","Romain Billot","Nour-Eddin El Faouzi","julien monteil"],"meta":["April 2016Transportation Research Part C Emerging Technologies 67","DOI:10.1016/j.trc.2016.01.020"],"references":["268791615_SiLEA14_a_novel_atypical_LEA_protein_confers_abiotic_stress_resistance_in_foxtail_millet","265743187_ARCHISIM_A_behavioral_multi-actors_traffic_simulation_model_for_the_study_of_a_traffic_system_including_ITS_aspects","264503645_Linear_and_Weakly_Nonlinear_Stability_Analyses_of_Cooperative_Car-Following_Models","263110836_Calibration_Estimation_and_Sampling_Issues_of_Car-Following_Parameters","290315688_Hierarchical_control_strategies_for_energy_management_of_connected_hybrid_electric_vehicles_in_urban_roads","276309653_Graceful_Degradation_of_Cooperative_Adaptive_Cruise_Control","273254457_Cooperative_Highway_Traffic","272745437_A_network_level_connectivity_robustness_measure_for_connected_vehicle_environments","269329525_Dynamic_data_driven_event_reconstruction_for_traffic_simulation_using_sequential_Monte_Carlo_methods","265326358_Traffic_dynamics_and_simulation_Data_models_and_applications_of_traffic_flow_dynamics"]}