{"id":"296685703_Displaying_Updates_in_Logic","abstract":"We generalize the language of substructural logics interpreted over the ternary relational semantics and introduce a logic called update logic. This is motivated by our intention to capture within the logical framework of substructural logics various logic-based formalisms dealing with common sense reasoning and logical dynamics. This initiative is based on the key observation that an update can be represented abstractly by the ternary relation of the substructural framework. Thus, we introduce three triples of connectives that are interconnected by means of cyclic permutations. The usual fusion, implication and co-implication connectives form one of these triples. We define a proper display calculus for update logic that generalizes the display calculus for modal logic. We do not resort to structural connectives for truth constants and we show how we can obtain our display rules using Gaggle Theory. We prove the soundness and strong completeness of our display calculus via a Henkin-style construction. Using correspondence results from substructural logics, we also obtain sound and complete display calculi for a wide variety of classical and substructural logics. Then, we define dual substructural connectives and we provide a display calculus for update logic extended with these dual connectives. Finally, we focus on the specific case of bi-intuitionistic logic for which we provide a novel sound and strongly complete display calculus. In a companion article (Aucher, 2016, J. Logic Comput.), we provide a sequent calculus for update logic that generalizes the non-associative Lambek calculus and a sequent calculus for dynamic epistemic logic that extends this sequent calculus for update logic. © The Author, 2016. Published by Oxford University Press. All rights reserved.","authors":["Guillaume Aucher"],"meta":["March 2016Journal of Logic and Computation 26(6):exw001","DOI:10.1093/logcom/exw001"],"references":["323707969_The_Mathematics_of_Sentence_Structure","319394122_Exploring_Logical_Dynamics","319393758_Situations_and_Attitudes","316327144_Introduction_to_Mathematical_Logic","312435057_Situations_and_Attitudes","304787456_Interpreting_and_Applying_Proof_Theories_for_Modal_Logic","301677903_Relevant_logics_the_Blackwell_guide_to_philosophi-cal_logic","297662429_Dynamic_Epistemic_Logic_in_Update_Logic","287010706_Conditional_logic","281597134_When_Conditional_Logic_and_Belief_Revision_Meet_Substructural_Logics"]}