{"id":"296633585_Comparative_analysis_of_relevance_feedback_methods_based_on_two_user_studies","abstract":"Rigorous analysis of user interest in web documents is essential for the development of recommender systems. This paper investigates the relationship between the implicit parameters and user explicit rating during their search and reading tasks. The objective of this paper is therefore three-fold: firstly, the paper identifies the implicit parameters which are statistically correlated with the user explicit rating through user study 1. These parameters are used to develop a predictive model which can be used to represent users’ perceived relevance of documents. Secondly, it investigates the reliability and validity of the predictive model by comparing it with eye gaze during a reading task through user study 2. Our findings suggest that there is no significant difference between the predictive model based on implicit indicators and eye gaze within the context examined. Thirdly, we measured the consistency of user explicit rating in both studies and found significant consistency in user explicit rating of document relevance and interest level which further validates the predictive model. We envisage that the results presented in this paper can help to develop recommender and personalised systems for recommending documents to users based on their previous interaction with the system.","authors":["Akuma Stephen","Rahat Iqbal","Chrisina Jayne","Faiyaz Doctor"],"meta":["July 2016Computers in Human Behavior 60:138-146","DOI:10.1016/j.chb.2016.02.064","Project: Implicit Feedback System for the Recommendation of Relevant Web Documents"],"references":["328912847_8_Modeling_User_Preferences_in_Recommender_Systems_A_Classification_Framework_for_Explicit_and_Implicit_User_Feedback","282008716_Adaptive_Information_Retrieval_System_Based_on_Fuzzy_Profiling","276420770_Implicit_Predictive_Indicators_Mouse_Activity_and_Dwell_Time","276231774_Investigating_the_Effect_of_Implicit_Browsing_Behaviour_on_Students'_Performance_in_a_Task_Specific_Context","273513985_Profile-Based_Summarisation_for_Web_Site_Navigation","271604250_User_Interest_Modeling_and_Self-Adaptive_Update_Using_Relevance_Feedback_Technology","286992533_Beyond_clicks_Dwell_time_for_personalization","283829138_Design_implications_for_task-specific_search_utilities_for_retrieval_and_re-engineering_of_code","277541342_Attentive_documents","272962528_Creating_recommendations_on_electronic_books_A_collaborative_learning_implicit_approach"]}