{"id":"296634089_D-BRAIN_Anatomically_accurate_simulated_diffusion_MRI_brain_data","abstract":"Diffusion Weighted (DW) MRI allows for the non-invasive study of water diffusion inside living tissues. As such, it is useful for the investigation of human brain white matter (WM) connectivity in vivo through fiber tractography (FT) algorithms. Many DW-MRI tailored restoration techniques and FT algorithms have been developed. However, it is not clear how accurately these methods reproduce the WM bundle characteristics in real-world conditions, such as in the presence of noise, partial volume effect, and a limited spatial and angular resolution. The difficulty lies in the lack of a realistic brain phantom on the one hand, and a sufficiently accurate way of modeling the acquisition-related degradation on the other. This paper proposes a software phantom that approximates a human brain to a high degree of realism and that can incorporate complex brain-like structural features. We refer to it as a Diffusion BRAIN (D-BRAIN) phantom. Also, we propose an accurate model of a (DW) MRI acquisition protocol to allow for validation of methods in realistic conditions with data imperfections. The phantom model simulates anatomical and diffusion properties for multiple brain tissue components, and can serve as a ground-truth to evaluate FT algorithms, among others. The simulation of the acquisition process allows one to include noise, partial volume effects, and limited spatial and angular resolution in the images. In this way, the effect of image artifacts on, for instance, fiber tractography can be investigated with great detail. The proposed framework enables reliable and quantitative evaluation of DW-MR image processing and FT algorithms at the level of large-scale WM structures. The effect of noise levels and other data characteristics on cortico-cortical connectivity and tractography-based grey matter parcellation can be investigated as well.","authors":["Daniele Perrone","Ben Jeurissen","Jan Aelterman","Timo Roine"],"meta":["March 2016PLoS ONE 11(3):e0149778","DOI:10.1371/journal.pone.0149778","Project: Quantitative diffusion MRI"],"references":["284309139_ExploreDTI_A_graphical_toolbox_for_processing_analyzing_and_visualizing_diffusion_MR_data","321567391_Computational_Diffusion_MRI_and_Brain_Connectivity_MICCAI_Workshops_Nagoya_Japan_September_22nd_2013","306146249_Structural_network_alterations_and_neurological_dysfunction_in_cerebral_amyloid_angiopathy","303198056_Imagerie_de_diffusion_in-vivo_par_resonance_magnetique_nucleaire","292528048_Dendrites","287280718_Short_stories_about_small_brains","286157807_RNA_targeting_trafficking_and_translation_in_dendrites","285641884_Improved_probabilistic_streamlines_tractography_by_2nd_order_integration_over_fibre_orientation_distributions","279753737_The_effect_of_Gibbs_ringing_artifacts_on_measures_derived_from_diffusion_MRI","269719154_The_impact_of_gradient_strength_on_in_vivo_diffusion_MRI_estimates_of_axon_diameter"]}