{"id":"296703553_Online_collaboration_for_English_learners_Implementing_and_international_project_with_Edmodo","abstract":"Since the global emergence of the Internet in the late 80s, the world has changed. Communication, business, relationships, work and ways of socializing have been greatly influenced by this change and so has education (Kongchan, 2013). Twenty-first century students have been referred to as digital natives (Prensky, 2001; Warschauer, 2011), as they were born to a world where the Internet and its associated technological tools are abundant, sometimes almost taken for granted, and regarded as commonplace. Prensky (2001) suggests that these learners are seen as “native speakers” of the digital language of computers, video games, and the Internet. For this reason, these learners acquire knowledge in ways which cannot be compared with the non-digital era learning styles. Therefore, there is an urgent need for educators to adapt their teaching approaches and resources to the new digital natives (Guth & Helm, 2010). \n\nDigital tools and collaborative projects have been widely used in language learning contexts, particularly in English as a Second Language (ESL) programs (Cummins & Early, 2010; Darvin & Norton, 2014; Galante, 2014; Lotherington & Jenson, 2011; Toohey, Dageneis & Schulze, 2012). In a study conducted by the British Council, 69% of learners all over the world seem to believe that they learn better when “socializing informally” (Kongchan, 2013, p. 2). Given that digital tools offer extensive opportunities for social interactions, as well as relationships between people (Jones & Hafner, 2012), integrating digital tools in a language learning environment has great potential to facilitate language development, as well as address digital natives’ needs. In addition, considering the crucial role of language in social interactions (Guth & Helm, 2010), digital tools seem to provide ESL learners an opportunity to explore linguistic and cultural diversity by interacting with ESL students in other geographical locations using English as the language for communication. \n\nIn this article, we explain the rationale for choosing Edmodo for our international online collaboration project. We also describe how it aligns well with sociocultural theory (henceforth SCT) to promote language learning through social interactions. We then outline three practical steps to implement the project. Examples of the role of the teacher and students as well as samples of interactions are also provided.","authors":["Angelica Galante","Daniela Coelho","Ana Luisa Pires"],"meta":["February 2016"],"references":["304233063_Second_Language_Learners_Making_Video_in_Three_Contexts","280734184_Developing_EAL_Learners'_Intercultural_Sensitivity_Through_a_Digital_Literacy_Project","262142564_Transnational_Identity_and_Migrant_Language_Learners_The_Promise_of_Digital_Storytelling","324972087_Sociocultural_Theory_in_Second_Language_Education_An_Introduction_through_Narratives","283637360_Social_networking_for_language_learners_Creating_meaningful_output_with_Web_20_tools","265268711_Pensamento_e_Linguagem","264233210_Understanding_Digital_Literacies_A_Practical_Introduction","249821767_Child's_Talk_Learning_to_Use_Language","244443789_Teaching_and_Assessing_Intercultural_Communicative_Competence","237182112_Sociocultural_Theory_and_the_Genesis_of_Second_Language_Development"]}