{"id":"296847071_Initialization_in_Scratch_Seeking_Knowledge_Transfer","abstract":"With the growing movement to use visual block-based languages (VBBLs) in elementary and middle school classrooms, questions arise about the learning outcomes of such activities. While some schools are content to use VBBLs to spark interest and motivation for the future pursuit of computing, others are asking, Does this early exposure produce knowledge that transfers to traditional text-based languages (TBLs)? If transfer is a goal, then a corollary is, How do we design the transition to maximize the transfer? This paper focuses on initialization of state and variables, exploring the differences between Scratch and two TBLs: C and Java. Based on observations of 9-12 year old students in a VBBL curriculum, we identify four pieces of knowledge that are critical for C and Java but are not nearly as obvious in Scratch, including whether, when, and how to perform initialization. We conclude with suggestions for instruction and development environment that may improve transfer.","authors":["Diana Franklin","Charlotte Hill","Hilary Dwyer","Alexandria K. Hansen"],"meta":["March 2016","DOI:10.1145/2839509.2844569","Conference: SIGCSE","Project: DEPICT: Developing Elementary (learning) Progressions to Integrate Computational Thinking"],"references":["288950089_Design-based_research_and_technology-enhanced_learning_systems","275274983_Floors_and_Flexibility_Designing_a_Programming_Environment_for_4th-6th_Grade_Classrooms","265797241_New_frameworks_for_studying_and_assessing_the_development_of_computational_thinking","317953561_Mind_in_society_The_development_of_higher_psychological_processes","311473376_Unlocking_the_clubhouse_women_in_computing","298972479_Learning_Computer_Science_Concepts_with_Scratch","276555166_From_Scratch_to_Real_Programming","275156985_Implications_of_Complexity_for_Research_on_Learning_Progressions","269031203_Making_the_connection","262404862_Modeling_the_learning_progressions_of_computational_thinking_of_primary_grade_students"]}