{"id":"297047581_Theorema_20_Computer-Assisted_Natural-Style_Mathematics","abstract":"The Theorema project aims at the development of a computer assistant for the working mathematician. Support should be given throughout all phases of mathematical activity, from introducing new mathematical concepts by definitions or axioms, through first (computational) experiments, the formulation of theorems, their justification by an exact proof, the application of a theorem as an algorithm, to the dissemination of the results in form of a mathematical publication, the build up of bigger libraries of certified mathematical content and the like. This ambitious project is exactly along the lines of the QED manifesto issued in 1994 (see e.g. http://www.cs.ru.nl/~freek/qed/qed.html) and it was initiated in the mid-1990s by Bruno Buchberger. The Theorema system is a computer implementation of the ideas behind the Theorema project. One focus lies on the natural style of system input (in form of definitions, theorems, algorithms, etc.), system output (mainly in form of mathematical proofs) and user interaction. Another focus is theory exploration, i.e. the development of large consistent mathematical theories in a formal frame, in contrast to just proving single isolated theorems. When using the Theorema system, a user should not have to follow a certain style of mathematics enforced by the system (e.g. basing all of mathematics on set theory or certain variants of type theory), rather should the system support the user in her preferred avor of doing math. The new implementation of the system, which we refer to as Theorema 2.0, is open-source and available through GitHub.","authors":["Bruno Buchberger","Tudor Jebelean","Temur Kutsia","Alexander Maletzky"],"meta":["January 2016Journal of Formalized Reasoning 9(1):149-185","DOI:10.6092/issn.1972-5787/4568"],"references":["268444340_The_Leo-III_Project","255712230_Solving_Reasoning_and_Programming_in_Common_Logic","249902034_CREACOMP_Experimental_formal_mathematics_for_the_classroom","293561285_Lecture_Notes_in_Computer_Science_including_subseries_Lecture_Notes_in_Artificial_Intelligence_and_Lecture_Notes_Preface","268887028_Interactive_theorem_proving_and_program_development_Coq'Art_the_calculus_of_inductive_constructions_Foreword_by_Gerard_Huet_and_Christine_Paulin-Mohring","268751323_Synthesis_of_list_algorithms_by_mechanical_proving","268013101_Dense_sphere_packings_A_blueprint_for_formal_proofs","267987594_Sound_and_Complete_Verification_Condition_Generator_for_Functional_Recursive_Programs","261335932_The_Flexiformalist_Manifesto","248273865_Using_meta-variables_for_natural_deduction_in_Theo-rema"]}