{"id":"297120710_ANALYSIS_OF_RESEARCH_PROPOSALS_AND_CHALLENGES_FACED_BY_POSTGRADUATE_TRAINEES_IN_INTERNAL_MEDICINE_AND_ALLIED_DISCIPLINES_DURING_FELLOWSHIP_TRAINING_PROGRAMME","abstract":"Objectives: To analyze the research proposals and challenges faced by postgraduate fellowship trainees in internal medicine & allied disciplines when writing a proposal.\n\nMethods: The study was undertaken at the Department of Medicine, Lady Reading Hospital Peshawar, from October 2013 to December 2014. This qualitative grounded theory approach analyzed proposals of 32 postgraduate students of internal medicine. Later, we triangulated our results with a focus group discussion amongst 10 postgraduate students who had completed their synopses.\n\nResults: The number of attempts needed for correction of different components of synopses was 2-11 times amongst 32 proposals evaluated. The challenges found were related to; research methodology, formulating research questions or hypothesis, setting the background / introduction section, proforma making for data collection, objectives and references writing. About one third of the students found difficulties when writing an appropriate proposal title for their dissertation. From the focus group discussion, a total of six codes emerged after thematic analysis, which were later grouped under four categories. Three themes were deducted from these categories and were related to supervisors, College of Physicians and Surgeons (CPSP) and students.\n\nConclusion: Most of the students had issues in preparing synopses, mainly due to lack of supervisor’s and CPSP support. The student-as-researcher needs the support of supervisor, and / or a mentor. Therefore, CPSP needs to consider the organization of more workshops and the creation of research facilitation centers in each hospital to help the students complete their synopses and dissertations.","authors":["Usman Mahboob","Farooq Ahmed"],"meta":["October 2016Khyber Medical University Journal 8(1)"],"references":["324135965_Common_Mistakes_Committed_and_Challenges_Faced_in_Research_Proposal_Writing_by_University_of_Zambia_Postgraduate_Students","10859926_Central_challenges_facing_the_national_clinical_research_enterprise","281027779_The_mentoring_role_in_undergraduate_research_projects","267859982_Peer_Mentors_in_Undergraduates'_Research_Proposal_Writing_in_Taiwan","261102929_Training_Mentors_of_Clinical_and_Translational_Research_Scholars_A_Randomized_Controlled_Trial","258639035_Impact_of_mentoring_medical_students_on_scholarly_productivity","235681628_Mentor_Networks_in_Academic_Medicine_Moving_Beyond_a_Dyadic_Conception_of_Mentoring_for_Junior_Faculty_Researchers","233948525_Writing_your_dissertation_Where_to_start"]}