{"id":"297224053_LifeCLEF_2015_Multimedia_Life_Species_Identification_Challenges","abstract":"Using multimedia identification tools is considered as one of the most promising solutions to help bridging the taxonomic gap and build accurate knowledge of the identity, the geographic distribution and the evolution of living species. Large and structured communities of nature observers (e.g. eBird, Xeno-canto, Tela Botanica, etc.) as well as big monitoring equipments have actually started to produce outstanding collections of multimedia records. Unfortunately, the performance of the state-of-the-art analysis techniques on such data is still not well understood and is far from reaching the real world’s requirements. The LifeCLEF lab proposes to evaluate these challenges around 3 tasks related to multimedia information retrieval and fine-grained classification problems in 3 living worlds. Each task is based on large and real-world data and the measured challenges are defined in collaboration with biologists and environmental stakeholders in order to reflect realistic usage scenarios. This paper presents more particularly the 2015 edition of LifeCLEF. For each of the three tasks, we report the methodology and the data sets as well as the raw results and the main outcomes.","authors":["Alexis Joly","Hervé Goëau","Concetto Spampinato","Pierre Bonnet"],"meta":["September 2015Lecture Notes in Computer Science","DOI:10.1007/978-3-319-24027-5_46","Conference: CLEF 2015 Proceedings","Projects: Xeno-cantoAutomated recognition of bird song recordings"],"references":["338423032_Improved_Automatic_Bird_Identification_through_Decision_Tree_based_Feature_Selection_and_Bagging","308867640_Subset_feature_learning_for_fine-grained_category_classification","305196650_Going_deeper_with_convolutions","303802098_LifeCLEF_plant_identification_task_2014","289531483_Sabanci-Okan_System_in_LifeCLEF_2015_Plant_Identification_Competition","281387413_Visual-based_plant_species_identification_from_crowdsourced_data","280953416_A_comparative_study_of_fine-grained_classification_methods_in_the_context_of_the_LifeCLEF_plant_identification_challenge_2015","280953357_LifeCLEF_Plant_Identification_Task_2015","280953263_Shared_nearest_neighbors_match_kernel_for_bird_songs_identification_-LifeCLEF_2015_challenge","280940018_Pattern_Recognition_and_Machine_Learning"]}