{"id":"297501492_Handbook_of_Granular_Computing","abstract":"Although the notion is a relatively recent one, the notions and principles of Granular Computing (GrC) have appeared in a different guise in many related fields including granularity in Artificial Intelligence, interval computing, cluster analysis, quotient space theory and many others. Recent years have witnessed a renewed and expanding interest in the topic as it begins to play a key role in bioinformatics, e-commerce, machine learning, security, data mining and wireless mobile computing when it comes to the issues of effectiveness, robustness and uncertainty. The Handbook of Granular Computing offers a comprehensive reference source for the granular computing community, edited by and with contributions from leading experts in the field. Includes chapters covering the foundations of granular computing, interval analysis and fuzzy set theory; hybrid methods and models of granular computing; and applications and case studies. Divided into 5 sections: Preliminaries, Fundamentals, Methodology and Algorithms, Development of Hybrid Models and Applications and Case Studies. Presents the flow of ideas in a systematic, well-organized manner, starting with the concepts and motivation and proceeding to detailed design that materializes in specific algorithms, applications and case studies. Provides the reader with a self-contained reference that includes all pre-requisite knowledge, augmented with step-by-step explanations of more advanced concepts. The Handbook of Granular Computing represents a significant and valuable contribution to the literature and will appeal to a broad audience including researchers, students and practitioners in the fields of Computational Intelligence, pattern recognition, fuzzy sets and neural networks, system modelling, operations research and bioinformatics.","authors":["W. Pedrycz","Andrzej Skowron","Vladik Kreinovich"],"meta":["July 2008","DOI:10.1002/9780470724163"],"references":[]}