{"id":"297618421_Representing_membership_functions_as_points_in_high-dimensional_spaces_for_fuzzy_interpolation_and_extrapolation","abstract":"This paper introduces a new approach for fuzzy interpolation and extrapolation of sparse rule base comprising of membership functions with finite number of characteristic points. The approach calls for representing membership functions as points in high-dimensional Cartesian spaces using the locations of their characteristic points as coordinates. Hence, a fuzzy rule base can be viewed as a set of mappings between the antecedent and consequent spaces and the interpolation and extrapolation problem becomes searching for an image in the consequent space upon given an antecedent observation. Analysis of well-defined membership functions can also be readily incorporated with the approach. Furthermore, the Cartesian representation enables separation between membership functions to be quantitatively measured by the Euclidean distance between their representing points, thereby allowing the interpolation and extrapolation problems to be treated using various scaling equations. The present approach divides observations into two groups. Observations within the antecedent spanning set contain the same geometric properties as the given antecedents. Interpolation and extrapolation can be conducted based on the given rules using a weighted-sum-averaging formula. On the other hand, observations lying outside the antecedent spanning set contain new geometric properties beyond those of the given rules. Heuristic reasoning must therefore be applied. In this case, a two-step approach with certain flexibility to accommodate additional criteria and design objectives is formulated.","authors":["Y Yam","Laszlo T. Koczy"],"meta":["December 2000IEEE Transactions on Fuzzy Systems 8(6):761-772"],"references":["3335794_Reduction_of_Fuzzy_Rule_Base_via_Singular_Value_Decomposition","250893301_Fuzziness_vs_Probability","220554155_Approximate_reasoning_by_linear_rule_interpolation_and_general_approximation","3335727_Andrews_JE_Combinatorial_rule_explosion_eliminated_by_a_fuzzy_rule_configuration_IEEE_Trans_Fuzzy_Syst_61_1-11"]}