{"id":"297677866_Fall_detection_and_activity_identification_using_wearable_and_hand-held_devices","abstract":"Human motion data captured from wearable devices such as smart watches can be utilized for activity recognition and emergency event detection, especially in the case of elderly or disabled people living independently in their homes. The output of such sensors is streams of physical activity data that require real-time recognition, especially in emergency situations. This paper presents a novel application that utilizes the low-cost Pebble Smart Watch together with an Android device (i.e. a smart phone) and allows the efficient capturing, transmission, storage and processing of such motion data. The paper includes the technical details of the stream data capturing and processing methodology, along with a comparison of the major algorithms used for the classification of physical activity type (i.e Mild, Moderate, Intense and Sleep). An initial evaluation of the achieved accuracy in recognizing activity type, calculating the energy consumption and detecting falls, is also included and the corresponding results are discussed. The reported results are quite promising and can enable the development of intelligent systems, capable of analyzing human behavior and triggering alarms related to human activity in addition to fall detection.","authors":["Ilias Maglogiannis","Charalampos Ioannou","Panayiotis Tsanakas"],"meta":["March 2016Integrated Computer Aided Engineering 23(2):161-172","DOI:10.3233/ICA-150509"],"references":["263015474_Fusion_of_Smartphone_Motion_Sensors_for_Physical_Activity_Recognition","241624206_Activity_classification_using_a_single_wrist-worn_accelerometer","278195162_Motion_estimation_and_segmentation_in_depth_and_intensity_videos","262292182_A_low-cost_3D_human_interface_device_using_GPU-based_optical_flow_algorithms","257351867_A_Survey_on_Fall_Detection_Principles_and_Approaches","246516811_Intille_Activity_recognition_from_user-annotated_acceleration_data","232044422_Relationship_between_lower-extremity_joint_torque_and_the_risk_for_falls_in_a_group_of_community_dwelling_older_adults","224583830_Development_of_a_portable_activity_detector_for_daily_activity_recognition","221757400_Design_of_an_unobtrusive_wireless_sensor_network_for_nighttime_falls_detection","221757021_Statistical_data_mining_of_streaming_motion_data_for_fall_detection_in_assistive_environments"]}