{"id":"297654327_An_analysis_of_the_non-preemptive_mixed-criticality_match-up_scheduling_problem","abstract":"Many applications have a mixed-criticality nature. They contain tasks with a different criticality, meaning that a task with a lower criticality can be skipped if a task with a higher criticality needs more time to be executed. This paper deals with a mixed-criticality scheduling problem where each task has a criticality given by a positive integer number. The exact processing time of the task is not known. Instead, we use different upper bounds of the processing time for different criticality levels of the schedule. A schedule with different criticality levels is generated off-line, but its on-line execution switches among the criticality levels depending on the actual values of the processing times. The advantage is that after the transient prolongation of a higher criticality task, the system is able to match up with the schedule on a lower criticality level. While using this model, we achieve significant schedule efficiency (assuming that the prolongation of the higher criticality task rarely occurs), and at the same time, we are able to grant a sufficient amount of time to higher criticality tasks (in such cases, some of the lower criticality tasks may be skipped). This paper shows a motivation for the non-preemptive mixed-criticality match-up scheduling problem arising from the area of the communication protocols. Using a polynomial reduction from the 3-partition problem, we prove the problem to be \\(\\mathcal {NP}\\)-hard in the strong sense even when the release dates and deadlines are dropped and only two criticality levels are considered.","authors":["Zdeněk Hanzálek","Tomáš Tunys","Premysl Sucha"],"meta":["October 2016Journal of Scheduling 19(5)","DOI:10.1007/s10951-016-0468-y"],"references":["258222788_Robust_Optimization","257596740_Erratum_to_A_survey_on_offline_scheduling_with_rejection","316806308_Scheduling_Computer_and_Manufacturing_Processes","275060177_Dataflow_Formalisation_of_Real-Time_Streaming_Applications_on_a_Composable_and_Predictable_Multi-Processor_SOC","270763566_Metaheuristics_for_a_scheduling_problem_with_rejection_and_tardiness_penalties","257596821_Online_scheduling_with_preemption_or_non-completion_penalties","242506265_Complexity_of_Machine_Scheduling_Problems","238836469_Technical_Note--Convex_Programming_with_Set-Inclusive_Constraints_and_Applications_to_Inexact_Linear_Programming","222820631_Modular_software_architecture_for_flexible_reservation_mechanisms_on_heterogeneous","222728342_Steiner_G_A_Survey_of_Scheduling_with_Controllable_Processing_Times_Discrete_Applied_Mathematics_15513_1643-1666","220366519_Parallel_machine_match-up_scheduling_with_manufacturing_cost_considerations","220366501_A_robust_approach_for_the_single_machine_scheduling_problem","221298328_Certification-Cognizant_Time-Triggered_Scheduling_of_Mixed-Criticality_Systems","220289941_Order_acceptance_and_scheduling_A_taxonomy_and_review","220266985_Towards_the_Design_of_Certifiable_Mixed-criticality_Systems"]}