{"id":"297656557_The_Deluge_of_Spurious_Correlations_in_Big_Data","abstract":"Very large databases are a major opportunity for science and data analytics is a remarkable new field of investigation in computer science. The effectiveness of these tools is used to support a “philosophy” against the scientific method as developed throughout history. According to this view, computer-discovered correlations should replace understanding and guide prediction and action. Consequently, there will be no need to give scientific meaning to phenomena, by proposing, say, causal relations, since regularities in very large databases are enough: “with enough data, the numbers speak for themselves”. The “end of science” is proclaimed. Using classical results from ergodic theory, Ramsey theory and algorithmic information theory, we show that this “philosophy” is wrong. For example, we prove that very large databases have to contain arbitrary correlations. These correlations appear only due to the size, not the nature, of data. They can be found in “randomly” generated, large enough databases, which—as we will prove—implies that most correlations are spurious. Too much information tends to behave like very little information. The scientific method can be enriched by computer mining in immense databases, but not replaced by it.","authors":["Cristian S. Calude","Giuseppe Longo"],"meta":["September 2017Foundations of Science 22(3)","DOI:10.1007/s10699-016-9489-4","Project: special issue of Progress in Biophysics and Molecular Biology, 2016  “Principles for a theory of organisms”"],"references":["336563386_Introduction_to_Data_Science","284798112_Classical_quantum_and_biological_randomness_as_relative_unpredictability","327765809_An_introduction_to_chaotic_dynamical_systems_Second_Edition","319393392_Computability_Theory","316238255_La_dette_publique_et_comment_s'en_debarrasser_Desendetter_les_Etats_europeens_sans_compromettre_la_croissance_c'est_possible","314400243_Science_and_Civilisation_in_China","312759665_Reductionism_Emergence_and_Levels_of_Reality","310809268_Algorithmically_Random_Universal_Algebras","310809179_Cognition_and_Complexity","287247383_Reductionism_emergence_and_levels_of_reality_The_importance_of_being_borderline"]}