{"id":"297656149_Not_so_global_A_bibliometric_look_at_engineering_education_research","abstract":"It has been suggested that Engineering Education Research (EER) is going global. If this were the case we would assume that the research of EER scholars in different parts of the globe would be informed by literature describing prior work within and beyond their home country/region. The authors set out to test this hypothesis by applying citation analysis to research presented in four publication venues: the annual conferences organised by ASEE (American Society of Engineering Education) and SEFI (European Society of Engineering Education) and two archival journals published by these two societies: Journal of Engineering Education (JEE) and European Journal of Engineering Education (EJEE). Our findings from the analysis of 4321 publications show that citations in ASEE conferences are dominated by sources with US affiliations, whereas the SEFI data show that while US sources are frequently cited, European and other authors are also well represented. With regard to the journals JEE and EJEE, a similar pattern is observed. These results suggest that, in citation terms, European EER is relatively global but US EER is not. The authors conclude by suggesting that if the EER community is to aspire to quality scholarship, there needs to be debate around how such issues can be tackled.","authors":["Bill Williams","Phillip C. Wankat","Pedro Neto"],"meta":["March 2016European Journal of Engineering Education 43(2):1-11","DOI:10.1080/03043797.2016.1153043"],"references":["344835913_Is_the_Engineering_Education_Community_Becoming_More_Interdisciplinary","264343839_Is_Engineering_Education_Research_Global_The_Answer_May_Surprise_You","299848961_Enhancing_engineering_Higher_education_outputs_of_the_National_HE_STEM_Programme","290571727_Mapping_Global_Trends_in_Engineering_Education_Research_2005-2008","288253039_Transatlantic_citation_patterns_in_educational_psychology","272623512_The_World's_Most_Influential_Scientific_Minds_2014","271878404_A_Hybrid_Imagination_Science_and_Technology_in_Cultural_Perspective","266564105_Results_of_the_JEE_Readership_Survey","264864104_Working_in_separate_silos_What_citation_patterns_reveal_about_higher_education_research_internationally","264800113_Anatomy_of_Scholarly_Collaboration_in_Engineering_Education_A_Big-Data_Bibliometric_Analysis"]}