{"id":"297720991_Benders_decomposition_without_separability_A_computational_study_for_capacitated_facility_location_problems","abstract":"Benders is one of the most famous decomposition tools for Mathematical Programming, and it is the method of choice e.g., in Mixed-Integer Stochastic Programming. Its hallmark is the capability of decomposing certain types of models into smaller subproblems, each of which can be solved individually to produce local information (notably, cutting planes) to be exploited by a centralized “master” problem. As its name suggests, the power of the technique comes essentially from the decomposition effect, i.e., the separability of the problem into a master problem and several smaller subproblems. In this paper we address the question of whether the Benders approach can be useful even without separability of the subproblem, i.e., when its application yields a single subproblem of the same size as the original problem. In particular, we focus on the capacitated facility location problem, in two variants: the classical linear case, and a “congested” case where the objective function contains convex but non-separable quadratic terms. We show how to embed the Benders approach within a modern branch-and-cut mixed-integer programming solver, addressing explicitly all the ingredients that are instrumental for its success. In particular, we discuss some computational aspects that are related to the negative effects derived from the lack of separability. Extensive computational results on various classes of instances from the literature are reported, with a comparison with the state-of-the-art exact and heuristic algorithms. The outcome is that a clever but simple implementation of the Benders approach can be very effective even without separability, as its performance is comparable and sometimes even better than that of the most effective and sophisticated algorithms proposed in the previous literature.","authors":["Matteo Fischetti","Ivana Ljubic","Markus Sinnl"],"meta":["March 2016European Journal of Operational Research 253(3)","DOI:10.1016/j.ejor.2016.03.002"],"references":["304187587_Redesigning_Benders_Decomposition_for_Large-Scale_Facility_Location","265668231_Accelerating_Benders_Decomposition_Algorithmic_Enhancement_and_Model_Selection_Criteria","235333501_Kernel_search_for_the_capacitated_facility_location_problem","300914049_Fixed-Charge_Facility_Location_Problems","262356512_A_Simple_but_Usually_Fast_Branch-and-Bound_Algorithm_for_the_Capacitated_Facility_Location_Problem","242931924_A_Cross_Decomposition_Algorithm_for_Capacitated_Facility_Location","241013364_An_interior-point_Benders_based_branch-and-cut_algorithm_for_mixed_integer_programs","236736809_Partitioning_Procedures_for_Solving_Mixed-Variable_Programming_Problems","233382649_Profit_Maximizing_Distributed_Service_System_Design_with_Congestion_and_Elastic_Demand","230873058_The_Cutting-Plane_Method_for_Solving_Convex_Programs"]}