{"id":"297721040_Computer_science_CS_in_the_compulsory_education_curriculum_Implications_for_future_research","abstract":"The subject of computer science (CS) and computer science education (CSE) has relatively recently arisen as a subject for inclusion within the compulsory school curriculum. Up to this present time, a major focus of technologies in the school curriculum has in many countries been on applications of existing technologies into subject practice (both software such as office applications, and hardware such as robots and sensors). Through uses of these applications, information and communications technologies (ICT) have focused on activities to support subject and topic learning (across wide age and subject ranges). Very recently, discussions for including computers in the curriculum have shifted to a much greater focus on computing and CS, more concerned with uses of and development of programming, together with fundamental principles of problem-solving and creativity. This paper takes a policy analysis approach; it considers evidence of current implementation of CSE in school curricula, the six main arguments for wider-scale introduction of the subject, the implications for researchers, schools, teachers and learners, the state of current discussions in a range of countries, and evidence of outcomes of CSE in compulsory curricula. The paper concludes by raising key questions for the future from a policy analysis perspective.","authors":["Don Passey"],"meta":["March 2017Education and Information Technologies 22(2)","DOI:10.1007/s10639-016-9475-z"],"references":["288686350_A_Black_Swan_in_a_Sea_of_White_Noise_Using_Technology-Enhanced_Learning_to_Afford_Educational_Inclusivity_for_Learners_with_Asperger's_Syndrome","282860020_DIGCOMP_a_Framework_for_Developing_and_Understanding_Digital_Competence_in_Europe","282603860_Computational_thinking_in_compulsory_education_Towards_an_agenda_for_research_and_practice","299427644_Computer_clubs_for_girls_an_initiative_in_search_of_the_right_problem","286654595_Early_Uses_of_Computers_in_Schools_in_the_United_Kingdom_Shaping_Factors_and_Influencing_Directions","281964846_Reflections_on_the_History_of_Computers_in_Education","281037725_Computers_and_Creativity","280751478_Constructionism_research_reports_and_essays_1985-1990","268050653_Preparing_Women_for_Dead-End_Jobs_Vocational_Education_and_Training_VET_for_Information_and_Communication_Technology_ICT_Jobs","266562898_Review_on_teaching_and_learning_of_computational_thinking_through_programming_What_is_next_for_K-12"]}