{"id":"297727740_A_binary_PSO_approach_to_mine_high-utility_itemsets","abstract":"High-utility itemset mining (HUIM) is a critical issue in recent years since it can be used to reveal the profitable products by considering both the quantity and profit factors instead of frequent itemset mining (FIM) or association-rule mining (ARM). Several algorithms have been presented to mine high-utility itemsets (HUIs) and most of them have to handle the exponential search space for discovering HUIs when the number of distinct items and the size of database are very large. In the past, a heuristic HUPE\\( _\\mathrm{umu}\\)-GRAM algorithm was proposed to mine HUIs based on genetic algorithm (GA). For the evolutionary computation (EC) techniques of particle swarm optimization (PSO), it only requires fewer parameters compared to the GA-based approaches. Since the traditional PSO mechanism is used to handle the continuous problem, in this paper, the discrete PSO is adopted to encode the particles as the binary variables. An efficient PSO-based algorithm, namely HUIM-BPSO, is proposed to efficiently find HUIs. The designed HUIM-BPSO algorithm finds the high-transaction-weighted utilization 1-itemsets (1-HTWUIs) as the size of the particles based on transaction-weighted utility (TWU) model, which can greatly reduce the combinational problem in evolution process. The sigmoid function is adopted in the updating process of the particles for the designed HUIM-BPSO algorithm. An OR/NOR-tree structure is further developed to reduce the invalid combinations for discovering HUIs. Substantial experiments on real-life datasets show that the proposed algorithm outperforms the other heuristic algorithms for mining HUIs in terms of execution time, number of discovered HUIs, and convergence.","authors":["Chun-Wei Jerry Lin","Lu Yang","Philippe Fournier Viger","Tzung-Pei Hong"],"meta":["September 2017Soft Computing 21(17)","DOI:10.1007/s00500-016-2106-1"],"references":["311490335_FOSHU_faster_on-shelf_high_utility_itemset_mining_--_with_or_without_negative_unit_profit","307614061_EFIM_a_fast_and_memory_efficient_algorithm_for_high-utility_itemset_mining","301369703_Mining_High-Utility_Itemsets_with_Multiple_Minimum_Utility_Thresholds","300141470_EFIM_A_Highly_Efficient_Algorithm_for_High-Utility_Itemset_Mining","313749844_Particle_swarm_optimization","313706874_Adaptation_in_natural_and_artificial_systems","313606073_A_discrete_binary_version_of_particle_swarm_algorithm","304425270_Differential_Evolution_-_A_Simple_and_Efficient_Heuristic_for_global_Optimization_over_Continuous_Spaces","285431056_A_Swarm-Based_Approach_to_Mine_High-Utility_Itemsets","278392315_Mining_top-k_high_utility_patterns_over_data_streams","270762616_Novel_Concise_Representations_of_High_Utility_Itemsets_Using_Generator_Patterns","272008392_An_adaptive_particle_swarm_optimization_method_based_on_clustering","271924163_FRPSO_Fletcher-Reeves_based_particle_swarm_optimization_for_multimodal_function_optimization","271910826_A_particle_swarm_inspired_cuckoo_search_algorithm_for_real_parameter_optimization","271738131_A_fast_particle_swarm_optimization_for_clustering"]}