{"id":"297776844_WHO_Child_Growth_Standards_based_on_lengthheight_weight_and_age","abstract":"Aim: To describe the methods used to construct the WHO Child Growth Standards based on length/height, weight and age, and to present resulting growth charts. Methods: The WHO Child Growth Standards were derived from an international sample of healthy breastfed infants and young children raised in environments that do not constrain growth. Rigorous methods of data collection and standardized procedures across study sites yielded very high-quality data. The generation of the standards followed methodical, state-of-the-art statistical methodologies. The Box-Cox power exponential (BCPE) method, with curve smoothing by cubic splines, was used to construct the curves. The BCPE accommodates various kinds of distributions, from normal to skewed or kurtotic, as necessary. A set of diagnostic tools was used to detect possible biases in estimated percentiles or z-score curves. Results: There was wide variability in the degrees of freedom required for the cubic splines to achieve the best model. Except for length/height-for-age, which followed a normal distribution, all other standards needed to model skewness but not kurtosis. Length-for-age and height-for-age standards were constructed by fitting a unique model that reflected the 0.7-cm average difference between these two measurements. The concordance between smoothed percentile curves and empirical percentiles was excellent and free of bias. Percentiles and z-score curves for boys and girls aged 0-60 mo were generated for weight-for-age, length/height-for-age, weight-for-length/h eight (45 to 110 cm and 65 to 120 cm, respectively) and body mass index-for-age. Conclusion: The WHO Child Growth Standards depict normal growth under optimal environmental conditions and can be used to assess children everywhere, regardless of ethnicity, socio-economic status and type of feeding.","authors":["M de Onis","R Martorell","C Garza","Anna Lartey"],"meta":["April 2006Acta Paediatrica 95:76-85","DOI:10.1080/08035320500495548"],"references":["297531338_Assessment_of_differences_in_linear_growth_among_populations_in_the_WHO_Multicentre_Growth_Reference_Study","10980474_Genetic_Structure_of_Human_Populations","227689113_Generalized_additive_models_for_location_scale_and_shape_with_discussion","227671556_A_method_for_estimating_age-specific_reference_intervals_'normal_ranges'_based_on_fractional_polynomials_and_exponential_transformation","21636714_Smoothing_Reference_Centile_Curves_The_LMS_Method_and_Penalized_Likelihood","8361812_Smooth_centile_curves_for_skew_and_kurtotic_data_modelled_using_the_Box-Cox_power_exponential_distribution","8259718_Factors_associated_with_unconstrained_growth_among_affluent_Ghanaian_children","7899204_Overweight_in_Children_and_Adolescents_Pathophysiology_Consequences_Prevention_and_Treatment","7617405_Construction_of_the_World_Health_Organization_child_growth_standards_Selection_of_methods_for_attained_growth_curves","3027229_A_New_Look_At_The_Statistical_Model_Identification"]}