{"id":"297743021_Congestion_Induced_by_the_Structure_of_Multiplex_Networks","abstract":"Multiplex networks are representations of multilayer interconnected complex networks where the nodes are the same at every layer. They turn out to be good abstractions of the intricate connectivity of multimodal transportation networks, among other types of complex systems. One of the most important critical phenomena arising in such networks is the emergence of congestion in transportation flows. Here, we prove analytically that the structure of multiplex networks can induce congestion for flows that otherwise would be decongested if the individual layers were not interconnected. We provide explicit equations for the onset of congestion and approximations that allow us to compute this onset from individual descriptors of the individual layers. The observed cooperative phenomenon is reminiscent of Braess’ paradox in which adding extra capacity to a network when the moving entities selfishly choose their route can in some cases reduce overall performance. Similarly, in the multiplex structure, the efficiency in transportation can unbalance the transportation loads resulting in unexpected congestion.","authors":["Albert Solé-Ribalta","Sergio Gomez","Alex Arenas"],"meta":["March 2016Physical Review Letters 116(10)","DOI:10.1103/PhysRevLett.116.108701"],"references":["281514039_Erratum_Topological_data_analysis_of_contagion_maps_for_examining_spreading_processes_on_networks","281394903_Multiplex_networks_in_metropolitan_areas_Generic_features_and_local_effects","275359239_Ranking_in_interconnected_multilayer_networks_reveals_versatile_nodes","266677133_A_typology_of_street_patterns","266659876_Centrality_rankings_in_multiplex_networks","262939868_Navigability_of_interconnected_networks_under_random_failures","259529047_Traffic_congestion_in_interconnected_complex_networks","258850753_Modeling_the_Polycentric_Transition_of_Cities","258424428_Centrality_in_Interconnected_Multilayer_Networks","268817412_The_Structure_and_Dynamics_of_Multilayer_Networks"]}