{"id":"297713912_Visualizing_structural_inverted_pyramids_in_English_news_discourse_across_levels","abstract":"Drawing on an analogy between discourse and syntactic trees, this paper chooses 359 Wall Street Journal articles with multiple paragraphs from the Rhetorical Structure Theory (RST) Discourse Treebank, and converts each discourse tree into three additional dependency ones, at discourse, paragraph and sentence levels, with exclusively elementary discourse units of clauses, sentences and paragraphs, respectively. It empirically tests and visually presents the genre-specific “summary+details” or “inverted pyramid” structuring of news discourse. It further extends the idea of inverted pyramid structuring to the paragraph and sentence levels. It proves that the body of the report also has a similar schematic top-down installment organization with macro-propositions on top. It also visually and statistically presents the rhetorical structures at sentence level, which differ to some extent from grammatical structures. Operated in line with the compositionality criterion and hierarchy principle of RST, the converted trees provide unique analytical advantages and constitute new research prospects.","authors":["Hongxin Zhang","Haitao Liu"],"meta":["March 2016Text & Talk - An Interdisciplinary Journal of Language Discourse Communication Studies 36(1):89-110","DOI:10.1515/text-2016-0005","Project: Discourse Dependency Relations based on RST Analysis"],"references":["307443397_Coherence_relations_in_academic_spoken_discourse","349860776_News_Analysis_Case_Studies_of_international_and_National_News_in_the_Press","346483571_Building_Coherence_and_Cohesion_Task-oriented_dialogue_in_English_and_Spanish","319394243_From_Discourse_to_Logic_Introduction_to_Model-Theoretic_Semantics_of_Natural_Language_Formal_Logic_and_Discourse_Representation_Theory","313727195_Television_news_as_narrative","306255716_Dependency_Grammar_from_theory_to_practice","299602816_Automatic_Texts_Summarization_Current_State_of_the_Art","294702261_The_frequency_and_placement_of_topic_sentences_in_expository_prose","286157303_The_alignment_of_generic_discourse_units_in_news_stories","278315936_Automatic_Text_Summarization"]}