{"id":"297761064_A_survey_on_soft_subspace_clustering","abstract":"Subspace clustering (SC) is a promising technology involving clusters that are identified based on their association with subspaces in high-dimensional spaces. SC can be classi- fied into hard subspace clustering (HSC) and soft subspace clustering (SSC). While HSC algorithms have been studied extensively and are well accepted by the scientific commu- nity, SSC algorithms are relatively new. However, as they are said to be more adaptable than their HSC counterparts, SSC algorithms have been attracting more attention in recent years. A comprehensive survey of existing SSC algorithms and recent developments in the field are presented in this paper. SSC algorithms have been systematically classified into three main categories: conventional SSC (CSSC), independent SSC (ISSC), and extended SSC (XSSC). The characteristics of these algorithms are highlighted and potential future devel- opments in the area of SSC are discussed. Through a comprehensive review of SSC, this paper aims to provide readers with a clear profile of existing SSC methods and to foster the development of more effective clustering technologies and significant research in this area.","authors":["Zhaohong Deng","Kup-Sze Choi","Yizhang Jiang","Jun Wang"],"meta":["June 2016Information Sciences 348:84-106"],"references":["290606140_Distinct_types_of_diffuse_large_B-cell_lymphoma_identified_by_gene_expression_profiling","279752374_Multiple-kernel_based_soft_subspace_fuzzy_clustering","272164990_Clustering_Objects_on_Subsets_of_Attributes","312098565_Fuzzy_Clustering_with_Weighting_of_Data_Variables","283116711_Soft_Subspace_Clustering_of_Categorical_Data_with_Probabilistic_Distance","282495577_A_novel_soft_subspace_clustering_algorithm_with_noise_detection_for_high_dimensional_datasets","281080920_Entropy-based_subspace_clustering_for_mining_numerical_data","277982184_Subspace_clustering_with_automatic_feature_grouping","270277317_Projective_Clustering_Ensembles","270053112_Subspace_clustering_using_affinity_propagation"]}