{"id":"297725624_A_Shoulder_Surfing_Resistant_Graphical_Authentication_System","abstract":"Authentication based on passwords is used largely in applications for computer security and privacy. However, human actions such as choosing bad passwords and inputting passwords in an insecure way are regarded as ”the weakest link” in the authentication chain. Rather than arbitrary alphanumeric strings, users tend to choose passwords either short or meaningful for easy memorization. With web applications and mobile apps piling up, people can access these applications anytime and anywhere with various devices. This evolution brings great convenience but also increases the probability of exposing passwords to shoulder surfing attacks. Attackers can observe directly or use external recording devices to collect users’ credentials. To overcome this problem, we proposed a novel authentication system PassMatrix, based on graphical passwords to resist shoulder surfing attacks. With a one-time valid login indicator and circulative horizontal and vertical bars covering the entire scope of pass-images, PassMatrix offers no hint for attackers to figure out or narrow down the password even they conduct multiple camera-based attacks. We also implemented a PassMatrix prototype on Android and carried out real user experiments to evaluate its memorability and usability. From the experimental result, the proposed system achieves better resistance to shoulder surfing attacks while maintaining usability.","authors":["Hung-Min Sun","S. M. Chen","Jyh-haw Yeh","Chia-Yun Cheng"],"meta":["March 2016IEEE Transactions on Dependable and Secure Computing PP(99):1-1","DOI:10.1109/TDSC.2016.2539942"],"references":["287965239_Graphical_Password-Based_User_Authentication_With_Free-Form_Doodles","262640739_Now_you_see_me_now_you_don't-_Protecting_smartphone_authentication_from_shoulder_surfers","261000726_The_DooDB_Graphical_Password_Database_Data_Analysis_and_Benchmark_Results","251861105_FakePointer_An_Authentication_Scheme_for_Improving_Security_against_Peeping_Attacks_Using_Video_Cameras","262343165_Covert_Attentional_Shoulder_Surfing_Human_Adversaries_Are_More_Powerful_Than_Expected","262320725_The_Domino_Effect_of_Password_Reuse","261959803_Graphical_Password_Authentication_Cloud_Securing_Scheme","245587678_Biometrics_Getting_Back_to_Business","243742470_Picture_superiority_e_ect","232629868_A_Stroke-Based_Textual_Password_Authentication_Scheme"]}