{"id":"297891315_Virtually_Athletes_Where_eSports_Fit_Within_the_Definition_of_Sport","abstract":"Electronic sports, cybersports, gaming, competitive computer gaming, and virtual sports are all synonyms for the term eSports. Regardless of the term used, eSports is now becoming more accepted as a sport and gamers are being identified as athletes within society today. eSports has even infiltrated higher education in the form of an intercollegiate athletic sport, as two university athletic departments have made eSports an official varsity sport where scholarships are provided to collegiate eSports athletes. Thus, the intertwining of eSports and university athletics brings into question whether eSports should be considered sport by broader society. This article provides a brief history of eSports, a further developed definition of eSports, and a comparison of eSports to traditional philosophical and sociological definitions of sport. The purpose of this article is to provoke thought on the academically accepted definitions of sport and debate whether eSports should be considered a sport. Attention will be given to the following components of sport: play, organization, competition, skill, physicality, broad following, and institutionalization.","authors":["Seth E. Jenny","R. Douglas Manning","Margaret Keiper","Tracy Olrich"],"meta":["March 2016Quest -Illinois- National Association for Physical Education in Higher Education- 69(1):1-18","DOI:10.1080/00336297.2016.1144517"],"references":["293019595_An_exploration_of_motives_in_sport_video_gaming","276072834_A_meta-analysis_of_active_video_games_on_health_outcomes_among_children_and_adolescents_A_meta-analysis_of_active_video_games","274634639_Effects_of_active_video_games_on_physiological_and_psychological_outcomes_among_children_and_adolescents_A_meta-analysis","263754771_Video_Game_Training_Enhances_Cognition_of_Older_Adults_A_Meta-Analytic_Study","259499201_Tracing_the_Trajectory_of_Skill_Learning_With_a_Very_Large_Sample_of_Online_Game_Players","279550667_Diversity_and_Higher_Education_Theory_and_Impact_on_Educational_Outcomes","275735358_Sport_in_Society_Issues_and_Controversies","274474091_What_Is_Sport","264463645_The_Impact_of_Active_Video_Gaming_on_Weight_in_Youth_A_Meta-Analysis","260619873_For_and_against_Debate_Online_Newspapers"]}