{"id":"297895048_Participation_of_rural_Zimbabwean_female_students_in_mathematics_The_influence_of_perception","abstract":"The study was premised on the influence of perceptions on the participation of Ordinary Level rural African Zimbabwean female students in mathematics. Qualitative research design grounded in the interpretive paradigm was employed. Eighteen Ordinary Level female students and six teachers purposively selected from three rural co-educational secondary schools participated in the study. Data were generated through lesson observations and semi-structured question type interview guide. Findings revealed that rural female students perceived mathematics as a difficult subject, masculine and irrelevant to their future aspirations. Participants outlined that their perceptions were rooted in the prevailing cultural belief that mathematics is a masculine subject and negative stereotypes about girls’ maths abilities. Further findings indicate that female students’ participation in mathematics was highly influenced by their perception towards the subject. These perceptions result in the development of a general negative attitude to the subject that caused fewer female students to participate in mathematics in large numbers. We recommended parents and teachers to work hard to eliminate the negative gender and cultural stereotypes in order to enhance female students’ confidence in mathematics abilities. Schools should employ female mathematics teachers and expose female students to female role models who have succeeded in life in order to encourage more participation of female students in mathematics. Schools are made responsible for smoothing out difficulties generated by the prevailing culture. There is a gap in knowledge base pertaining to the Zimbabwean rural girls’ participation in Mathematics.","authors":["Anna Gudyanga","Victor Mandizvidza","Ephias Gudyanga","Kris Gritter"],"meta":["December 2016Cogent Education 3(1):1156836","DOI:10.1080/2331186X.2016.1156836"],"references":["316838614_Zimbabwean_female_participation_in_physics_The_influence_of_identity_formation_on_perception_and_participation","276328281_Analysis_of_Variance_for_Parental_Demographic_Variables_to_Students'_Total_Attitudes_toward_Secondary_Education_Science_Teaching_and_Learning","345850812_The_Truth_that_Never_Hurts","329987757_Whose_Science_Whose_Knowledge_Thinking_from_Women's_Lives","319620241_Critical_success_factors_for_effective_knowledge_sharing_Integrating_intra-organizational_communication_and_KM_tools","310513642_Dimensionalizing_Cultures_The_Hofstede_Model_in_Context","297727415_Causes_Of_Poor_Performance_Of_Ordinary_Level_Pupils_In_Mathematics_In_Rural_Secondary_Schools_In_Nkayi_District_Learner's_Attributions","289277674_Research_methods_Third_edition","285739465_Qualitative_Methods_for_Health_Research","277003299_Mathematics_teaching_and_learning"]}