{"id":"297908121_From_Tarski_to_Descartes_Formalization_of_the_Arithmetization_of_Euclidean_Geometry","abstract":"This paper describes the formalization of the arithmetization of Euclidean geometry in the Coq proof assistant.\nAs a basis for this work, Tarski’s system of geometry was chosen for its well-known metamathematical properties.\nThis work completes our formalization of the two-dimensional results contained in part one of Metamathematische Methoden in der Geometrie.\nWe define the arithmetic operations geometrically and prove that they verify the properties of an ordered field.\nThen, we introduce cartesian coordinates, and provide an algebraic characterization of the main geometric predicates.\nIn order to prove the characterization of the segment congruence relation, we provide a synthetic formal proof of two crucial theorems in geometry, namely the intercept and Pythagoras' theorems.\nThe arithmetization of geometry justifies the use the algebraic automated deduction methods in geometry.\nWe give an example of the use this formalization by deriving from Tarski's system of geometry a formal proof of theorems of nine points using Gröbner basis.","authors":["Pierre Boutry","Gabriel Braun","Julien Narboux"],"meta":["March 2016","DOI:10.29007/k47p","Conference: SCSS 2016 The 7th International Symposium on Symbolic Computation in Software Science","Project: GeoCoq"],"references":["304350412_Finding_Proofs_in_Tarskian_Geometry","283034401_A_reflexive_tactic_for_automated_generation_of_proofs_of_incidence_to_an_affine_variety","280618934_Parallel_postulates_and_decidability_of_intersection_of_lines_a_mechanized_study_within_Tarski's_system_of_geometry","280046405_Towards_A_Certified_Version_of_the_Encyclopedia_of_Triangle_Centers","279754457_Formalizing_complex_plane_geometry","278775998_The_Area_Method_a_Recapitulation","277353909_Automated_Theorem_Proving_in_GeoGebra_Current_Achievements","272388041_Tarski_Geometry_Axioms","299257292_Formalizing_Hilbert's_Grundlagen_in_IsabelleIsar","273940256_Geometry_a_Metric_Approach_with_Models"]}