{"id":"298091381_The_Innovation_and_Promise_of_STEM-Oriented_Cybersecurity_Charter_Schools_in_Urban_Minority_Communities_in_the_United_States_as_a_Tool_to_Create_a_Critical_Business_Workforce","abstract":"This text is an on-going study to provide current information regarding developing underrepresented student populations through STEM specific Charter schools to fulfill pipeline shortages. Current findings show that African Americans are underrepresented in high paying Science, Technology, Engineering, and Mathematics (STEM) fields, especially in cybersecurity. The U.S. pipeline of minority students studying STEM falls short in producing the next generation of cybersecurity professionals; thus, a salient need exists to design, pilot, and test a program to grow the minority student pipeline in the cybersecurity field. The charter school movement is one of the fastest growing education reforms with the ability to make a dramatic impact in the U.S. and internationally. Because charter schools often organize around a mission, theme, or curricular and enjoy freedoms, in organizational structure, mission, and academic program, with all held to high standards, this text proposes cybersecurity charter schools to fill technology voids. This organizational structure, mission, and academic programming, will enable students to become immersed in hands-on, real world applications allowing for experiential learning, which can develop students with cybersecurity expertise, technical knowledge, and skills, and competencies needed to take and pass cybersecurity and information security related certification assessments.","authors":["Darrell Norman Burrell","Aikyna Finch","Janet Simmons","Sharon L Burton"],"meta":["January 2015","DOI:10.4018/978-1-4666-8345-7.ch015","In book: New Threats and Countermeasures in Digital Crime and Cyber Terrorism (pp.271-285)"],"references":["326756977_An_Exploration_of_the_Cybersecurity_Workforce_Shortage","258278779_An_Analysis_of_the_Growth_Emergence_and_Development_of_Leaders_and_Leadership_Philosophies_of_Charter_Schools_in_the_United_States","249794781_The_Role_of_Shared_Values_and_Vision_in_Creating_Professional_Learning_Communities","249121008_The_Influence_of_Founder_Type_on_Charter_School_Structures_and_Operations","270667101_Organizational_Structures_and_Perceived_Cultures_of_Community-Charter_Schools_in_Ohio","261061789_Beyond_Learning_By_Doing_Theoretical_Currents_of_Experiential_Education","247524137_Children_with_Special_Needs_and_School_Choice_Five_Stories","245649566_Charter_Schools_Creating_Hope_and_Opportunity_for_American_Education","242457703_Apples_to_Apples_An_Evaluation_of_Charter_Schools_Serving_General_Student_Populations","240801429_Charter_Schools_Another_Top-Down_Innovation"]}