{"id":"29811997_Rich_environments_for_active_learning_in_action_Problem-based_learning","abstract":"Rich Environments for Active Learning (REALs) are comprehensive instructional systems that are consistent with constructivist theories. They promote study and investigation within authentic contexts; encourage the growth of student responsibility, initiative, decision making and intentional learning; cultivate collaboration among students and teachers; utilize dynamic, interdisciplinary, generative learning activities that promote higher‐order thinking processes to help students develop rich and complex knowledge structures; and assess student progress in content and learning‐to‐learn within authentic contexts using realistic tasks and performances. Problem‐Based Learning (PBL) is an instructional methodology that can be used to create REALs. PBL's student‐centred approach engages students in a continuous collaborative process of building and reshaping understanding as a natural consequence of their experiences and interactions within learning environments that authentically reflect the world around them. In this way, PBL and REALs are a response to teacher‐centred educational practices that promote the development of inert knowledge, such as conventional teacher‐to‐student knowledge dissemination activities. In this article, we compare existing assumptions underlying teacher‐directed educational practice with new assumptions that promote problem solving and higher‐level thinking by putting students at the centre of learning activities. We also examine the theoretical foundation that supports these new assumptions and the need for REALs. Finally, we describe each REAL characteristic and provide supporting examples of REALs in action using PBL","authors":["Scott Grabinger","Joanna C. Dunlap","Judith A. Duffield"],"meta":["July 1997Research in Learning Technology 5(2)","DOI:10.1080/0968776970050202"],"references":["307794022_Rich_environments_for_active_learning_a_definition","321603834_Educational_Innovation_in_Economics_and_Business_Administration_The_Case_of_Problem-Based_Learning","313737754_Cognitive_Apprenticeship_Making_Thinking_Visible","313573264_Theory_into_practice_How_do_we_link_Instructional_Technology_Past_Present_and_Future","313570138_Rich_environments_for_active_learning","303270804_Cognitive_apprenticeship_Teaching_the_crafts_of_reading_writing_mathematics","303151043_The_Aims_of_Education","300021482_Designing_Learning_Environments_That_Support_Thinking_The_Jasper_Series_as_a_Case_Study","285970744_Motivation_project-based_learning_Sustaining_the_doing_supporting_the_learning","271429465_Cognitive_Apprenticeship_Teaching_the_Craft_of_Reading_Writing_and_Mathematics"]}