{"id":"298208505_Recursive_Newton-Euler_formulation_for_flexible_dynamic_manufacturing_analysis_of_open-loop_robotic_systems","abstract":"The main objective of this paper is to develop a recursive formulation for the flexible dynamic manufacturing analysis of open-loop robotic systems. The nonlinear generalized Newton-Euler equations are used for flexible bodies that undergo large translational and rotational displacements. These equations are formulated in terms of a set of time invariant scalars, vectors and matrices that depend on the spatial coordinates as well as the assumed displacement fields. These time invariant quantities represent the dynamic manufacturing couplings between the rigid body motion and elastic deformation. This formulation applies recursive procedures with the generalized Newton-Euler equations for flexible bodies to obtain a large, loosely coupled system equation describing motion in flexible manufacturing systems. The techniques used to solve the system equations can be implemented in any computer system. The algorithms presented in this investigation are illustrated using cylindrical joints for open-loop robotic systems, which can be easily extended to revolute, slider and rigid joints. The recursive Newton-Euler formulation developed in this paper is demonstrated with a robotic system using cylindrical mechanical joints.","authors":["Yunn-Lin Hwang"],"meta":["June 2006The International Journal of Advanced Manufacturing Technology 29(5):598-604","DOI:10.1007/s00170-005-2530-3"],"references":["242923691_Dynamic_Coupling_Between_the_Joint_and_Elastic_Coordinates_in_Flexible_Mechanism_Systems","313123761_On-line_computational_scheme_for_mechanical_manipulators","275077665_Analysis_of_the_Time-Dependence_of_Multi-Freedom_Mechanical_Systems_in_Relative_Coordinates","270030644_Dynamic_of_a_cantilever_bean_attached_to_a_moving_base","266518006_Dynamics_of_Flexible_Bodies_Using_Generalized_Newton-Euler_Equations","258140413_Recursive_Lagrangian_Dynamics_of_Flexible_Manipulator_Arms","245514006_On_the_Dynamic_Analysis_and_Behavior_of_Industrial_Robotic_Manipulators_With_Elastic_Members","243765411_Robotics_Mechanics_and_Control","239583507_On-Line_Computation_Scheme_for_Mechanical_Manipulators","239065881_Dynamics_of_Articulated_Open-Chain_Active_Mechanisms"]}