{"id":"298329017_The_Myers-Briggs_Type_Indicator_As_A_Tool_To_Facilitate_Learning_Outcomes_For_Team_Building_In_The_Classroom","abstract":"Globalization and domestic competition are forcing businesses to rethink the human resources utilization process, and one method for considering again this challenge is creating a team culture. One key to this process for human resources development is the understanding of how to create the most successful teams. The use of the Myers-Briggs Type Indicator (MBTI) is a tool often used by business to achieve the goals of building work teams. College business majors must be introduced to the MBTI and to the dynamics of team building as a measurable skill necessary for their work environment. This research focuses on college classes in business communications, the directed study of the MBTI, and the heterogeneous mix of type in teams necessary for high learning outcomes. Specific pedagogical directions are provided for two team-building projects in writing, research, and oral presentation to small groups, thus meeting multiple course objectives.","authors":["Priscilla Berry","Cindy Wood","Barry Thornton"],"meta":["August 2011College Teaching Methods & Styles Journal (CTMS) 3(4):13","DOI:10.19030/ctms.v3i4.5582","Project: The Myers-Briggs Type Indicator As A Tool To Facilitate Learning Outcomes For Team Building In The Classroom"],"references":["258138159_The_Relationship_between_Work-Team_Personality_Composition_and_the_Job_Performance_of_Teams","245298619_Understanding_Psychological_Type_to_Improve_Project_Team_Performance","238335480_Using_Experiential_Learning_Theory_and_the_Myers-Briggs_Type_Indicator_in_Teaching_Business_Communication","275714345_MBTI_Manual_A_Guide_to_the_Development_and_Use_of_the_Myers-Briggs_Type_Indicator","239389747_Team_Effectiveness_and_Individual_Myers-Briggs_Personality_Dimensions","222970463_What_is_Person-Environment_Congruence_Supplementary_Versus_Complementary_Models_of_Fit","201382052_A_Guide_to_the_Development_and_Use_of_the_Myers-Briggs_Type_Indicator"]}