{"id":"2985446_Gradient-Based_Learning_Applied_to_Document_Recognition","abstract":"Multilayer neural networks trained with the back-propagation\nalgorithm constitute the best example of a successful gradient based\nlearning technique. Given an appropriate network architecture,\ngradient-based learning algorithms can be used to synthesize a complex\ndecision surface that can classify high-dimensional patterns, such as\nhandwritten characters, with minimal preprocessing. This paper reviews\nvarious methods applied to handwritten character recognition and\ncompares them on a standard handwritten digit recognition task.\nConvolutional neural networks, which are specifically designed to deal\nwith the variability of 2D shapes, are shown to outperform all other\ntechniques. Real-life document recognition systems are composed of\nmultiple modules including field extraction, segmentation recognition,\nand language modeling. A new learning paradigm, called graph transformer\nnetworks (GTN), allows such multimodule systems to be trained globally\nusing gradient-based methods so as to minimize an overall performance\nmeasure. Two systems for online handwriting recognition are described.\nExperiments demonstrate the advantage of global training, and the\nflexibility of graph transformer networks. A graph transformer network\nfor reading a bank cheque is also described. It uses convolutional\nneural network character recognizers combined with global training\ntechniques to provide record accuracy on business and personal cheques.\nIt is deployed commercially and reads several million cheques per day","authors":["Yann Lecun","Leon Bottou","Y. Bengio","Patrick Haffner"],"meta":["December 1998Proceedings of the IEEE 86(11):2278 - 2324","DOI:10.1109/5.726791","SourceIEEE Xplore"],"references":["270283023_Signature_Verification_using_a_Siamese_Time_Delay_Neural_Network","313173689_Comparison_of_learning_algorithms_for_handwritten_digit_recognition","309630116_Parallel_distributed_processing_explorations_in_the_microstructure_of_cognition","285058764_Receptive_fields_binocular_interaction_and_functional_architecture_in_the_cat's_visual_cortex","279351140_Learning_Process_in_an_Asymmetric_Threshold_Network","272832134_The_Strength_of_Weak_Learnability","268645196_Adaptation_and_Learning_in_Automatic_Systems","261001961_Numerical_Recipes_in_C-The_Art_of_Scientific_Computing","256651264_Numerical_Recipes_The_art_of_scientific_computing","256622736_Statistical_pattern_recognition_with_neural_networks","248848344_Pattern_Classification_and_Scene_Analysis","248208758_Une_Approche_th'eorique_de_l''Apprentissage_Connexionniste_Applications_a_la_Reconnaissance_de_la","247355083_Recognition_of_cursive_script_amounts_on_postal_checks","247089825_Overview_and_synthesis_of_on-line_cursive_handwriting_recognition_techniques","246928376_Neural_Classifiers_Useful_for_Speech_Recognition"]}