{"id":"298712531_Experiences_of_Using_Automated_Assessment_in_Computer_Science_Courses","abstract":"In this paper we discuss the use of automated assessment in a variety of computer science courses that have been taught at Israel Academic College by the authors. The course assignments were assessed entirely automatically using Checkpoint, a web-based automated assessment framework. The assignments all used free-text questions (where the students type in their own answers). Stu-dents were allowed to correct errors based on feedback provided by the system and resubmit their answers. A total of 141 students were surveyed to assess their opinions of this approach, and we analysed their responses. Analysis of the questionnaire showed a low correlation between ques-tions, indicating the statistical independence of the individual questions. As a whole, student feedback on using Checkpoint was very positive, emphasizing the benefits of multiple attempts, impartial marking, and a quick turnaround time for submissions. Many students said that Check-point gave them confidence in learning and motivation to practise. Students also said that the de-tailed feedback that Checkpoint generated when their programs failed helped them understand their mistakes and how to correct them.","authors":["John English","Tammy English"],"meta":["January 2015Journal of Information Technology Education: Innovations in Practice 14(1):237-254","DOI:10.28945/2304"],"references":["320656374_Automatic_Grading_of_Spreadsheet_and_Database_Skills","234816057_Making_program_grading_easier_But_not_totally_automatic","225935337_The_CourseMarker_CBA_System_Improvements_over_Ceilidh","220808515_The_backwash_effect_on_SQL_skills_grading","314722340_The_evaluation_of_electronic_marking_of_examinations","311473853_Evaluating_students'_programs_using_automated_assessment_a_case_study","266334012_Gifted_Students'_Individual_Differences_in_Computer-Based_C_Programming_Course","228328446_A_Survey_of_Automated_Assessment_Approaches_for_Programming_Assignments","221537476_Grading_student_programs_using_ASSYST","220808132_RoboProf_and_an_introductory_computer_programming_course"]}