{"id":"298797180_RAGE_Architecture_for_Reusable_Serious_Gaming_Technology_Components","abstract":"For seizing the potential of serious games, the RAGE project—funded by the Horizon-2020 Programme of the European Commission—will make available an interoperable set of advanced technology components (software assets) that support game studios at serious game development. This paper describes the overall software architecture and design conditions that are needed for the easy integration and reuse of such software assets in existing game platforms. Based on the component-based software engineering paradigm the RAGE architecture takes into account the portability of assets to different operating systems, different programming languages, and different game engines. It avoids dependencies on external software frameworks and minimises code that may hinder integration with game engine code. Furthermore it relies on a limited set of standard software patterns and well-established coding practices. The RAGE architecture has been successfully validated by implementing and testing basic software assets in four major programming languages (C#, C++, Java, and TypeScript/JavaScript, resp.). Demonstrator implementation of asset integration with an existing game engine was created and validated. The presented RAGE architecture paves the way for large scale development and application of cross-engine reusable software assets for enhancing the quality and diversity of serious gaming.","authors":["Wim van der Vegt","Wim Westera","Enkhbold Nyamsuren","Atanas Georgiev"],"meta":["March 2016International Journal of Computer Games Technology 2016(3):1-10","DOI:10.1155/2016/5680526","Projects: RAGE projectRealising an Applied Gaming Ecosystem (RAGE)"],"references":["305298757_Towards_a_Service-Oriented_Architecture_Framework_for_Educational_Serious_Games","304360234_What_Serious_Game_Studios_Want_from_ICT_Research_Identifying_Developers'_Needs","281189607_Games_are_motivating_arenAt_they_Disputing_the_arguments_for_digital_game-based_learning","268816327_A_case_study_on_Service-Oriented_Architecture_for_Serious_Games","257440621_Digital_Games_for_Empowerment_and_Inclusion_DGEI_The_Potential_of_Digital_Games_for_Empowerment_and_Social_Inclusion_of_Groups_at_Risk_of_Social_and_Economic_Exclusion_Evidence_and_Opportunity_for_Pol","259685995_Mapping_learning_and_game_mechanics_for_serious_games_analysis_Mapping_learning_and_game_mechanics","246773467_Mastering_Enterprise_JavaBeans_and_the_Java_2_Platform","235079405_Technical_Concepts_of_Component-Based_Software_Engineering_Volume_2","234570941_Development_and_Use_of_the_ARCS_Model_of_Motivational_Design","233178572_First_principles_of_motivation_to_learn_and_e3-learning"]}