{"id":"298797849_What_Do_Stroke_Patients_Look_for_in_Game-Based_Rehabilitation_A_Survey_Study","abstract":"Stroke is one of the most common causes of physical disability, and early, intensive, and repetitive rehabilitation exercises are crucial to the recovery of stroke survivors. Unfortunately, research shows that only one third of stroke patients actually perform recommended exercises at home, because of the repetitive and mundane nature of conventional rehabilitation exercises. Thus, to motivate stroke survivors to engage in monotonous rehabilitation is a significant issue in the therapy process.\nGame-based rehabilitation systems have the potential to encourage patients continuing rehabilitation exercises at home. However, these systems are still rarely adopted at patients’ places. Discovering and eliminating the obstacles in promoting game-based rehabilitation at home is therefore essential.\nFor this purpose, we conducted a study to collect and analyze the opinions and expectations of stroke patients and clinical therapists. The study is composed of 2 parts: Rehab-preference survey – interviews to both patients and therapists to understand the current practices, challenges, and expectations on game-based rehabilitation systems; and Rehab-compatibility survey – a gaming experiment with therapists to elaborate what commercial games are compatible with rehabilitation. The study is conducted with 30 outpatients with stroke and 19 occupational therapists from 2 rehabilitation centers in Taiwan.\nOur surveys show that game-based rehabilitation systems can turn the rehabilitation exercises more appealing and provide personalized motivation for various stroke patients. Patients prefer to perform rehabilitation exercises with more diverse and fun games, and need cost-effective rehabilitation systems, which are often built on commodity hardware. Our study also sheds light on incorporating the existing design-for-fun games into rehabilitation system. We envision the results are helpful in developing a platform which enables rehab-compatible (i.e., existing, appropriately selected) games to be operated on commodity hardware and brings cost-effective rehabilitation systems to more and more patients’ home for long-term recovery.","authors":["Ya-Xuan Hung","Pei-Chen Huang","Kuan-Ta Chen","Woei-Chyn Chu"],"meta":["March 2016Medicine 95(11):e3032","DOI:10.1097/MD.0000000000003032"],"references":["278793854_Rehab-let_Touchscreen_tablet_for_self-training_impaired_dexterity_post_stroke_Study_protocol_for_a_pilot_randomized_controlled_trial","275411342_Virtual_Reality_Video_Games_to_Promote_Movement_Recovery_in_Stroke_Rehabilitation_A_Guide_for_Clinicians","261841516_Design_Parameters_in_Multimodal_Games_for_Rehabilitation","309309390_American_heart_association_statistics_C_stroke_statistics_S_heart_disease_and_stroke_statistics_-_2010_update_a_report_from_the_American_heart_association","270909542_Effectiveness_of_commercial_video_gaming_on_fine_motor_control_in_chronic_stroke_within_community-level_rehabilitation","270834711_Rehab_Games_as_Components_of_Workflow_A_Case_Study","270702626_Stroke_Patient_Rehabilitation_A_Pilot_Study_of_an_Android-Based_Game","266085923_Effect_of_Virtual_Reality-Based_Rehabilitation_on_Upper-Extremity_Function_in_Patients_with_Brain_Tumor_Controlled_Trial","265551676_Designing_motivational_games_for_stroke_rehabilitation","263775688_iPad_Technology_for_Home_Rehabilitation_after_Stroke_iHOME_A_Proof-of-Concept_Randomized_Trial"]}