{"id":"298706338_The_Management_of_Russian_Universities_on_the_Basis_of_International_Education_Quality_Standards","abstract":"The relevance of the study due to the fact that quality is the most important factor of sustainable development of the national economy, its integration into the world economy. The establishment of effective quality systems focused on the introduction of modern technologies and management methods is the key to a sustainable position of the organization on the market of goods and services. In this regard, this article aims to disclose the concept of quality and quality management of education as one of the most urgent at the present stage of development and for the Russian higher school. The purpose of this article is to analyze theoretical and practical approaches to the problem of effective management of the activities of Russian universities on the basis of international systems of assessing the quality of educational institutions management. The leading attitude to the study of this problem is systemic and structural-functional approaches to address the issue of quality management of higher education in the international context of the development of educational systems. The study is due to the high pace of expansion of higher education, as well as the need to increase the cost both from the state and from the business community and the consumers of educational services. The article presents the modern technologies of evaluation by universities quality of their research and educational activities and identified ways of improving the methods of quality management. The positive component of this approach is that its implementation is maintained as the continuity of the Russian tradition of education and expanding the set of positions to best meet the needs of modern society and standards. Article content is useful to the subjects of the modernization of management processes of modern higher education in the conditions of transformation of the Russian education.","authors":["R. I. Zinurova","Svetlana S.  Berman","Andrey R. Tuzikov","Elvira B.  Gayazova"],"meta":["April 2016International Review of Management and Marketing 6(2):204-211"],"references":["277631744_A_Model_of_Technical_University_Students'_Creative-Project_Activities'_Systemic_Commitment_to_Their_Self-Development_and_the_Experimental_Verification_of_Its_Effectiveness","271288065_Social_Change_With_Respect_to_Culture_and_Original_Nature","262944944_Transforming_Higher_Education_in_Whose_Image_Exploring_the_Concept_of_the_'World-Class'_University_in_Europe_and_Asia","240799272_Characteristics_of_the_Social_Demand_for_Two-Level_Professional_Training"]}