{"id":"298705815_Causes_and_Consequences_of_Polarization","abstract":"Rarely these days does a news cycle pass without new stories of political dysfunction in Washington, D.C. Reports of stalemates, fiscal cliffs, and failed grand bargains have begun to erode the public confidence in the ability of our representative institutions to govern effectively. In May 2013, only one American in six approved of the way Congress has handled its job. Sadly, that level of support was a major improvement from the previous summer, when wrangling over the usually routine matter of raising the debt ceiling drove congressional approval down to 10%. The most common diagnoses of Washington's ailments center on the emergence of excessive partisanship and deep ideological divisions among political elites and officeholders. In short, “polarization” is to blame. Consequently, the reform-minded have taken up the mantle of reducing polarization or mitigating its effects. In recent years, proposals for electoral reform to change electoral districting, primary elections, and campaign finance have been presented as panaceas. Other reformers have focused on changing legislative procedures such as those related to the filibuster, appropriations, and confirmation process to limit the opportunities for polarization to undermine government. Although there has been intense public discussion about the causes of polarization, its consequences, and possible cures, social science research has only recently begun to help shape those discussions. The intent of this chapter is to provide a more evidence-based foundation for these debates. PRELIMINARIES The academic study on partisanship and polarization is based on a combination of qualitative and quantitative research. Noteworthy qualitative accounts, which often combine historical research and participant observation, include Rohde (1991), Sinclair (2006), Hacker and Pierson (2006), and Mann and Ornstein (2012). The starting point for many quantitative studies of polarization is the robust observation of rising partisan differences in roll-call voting behavior in Congress. The bipartisan coalitions of the 1950s and 1960s have given way to the party-line voting of the twenty-first century. Although these trends are apparent in simple descriptive statistics about partisan divisions on roll calls, political scientists have developed more refined measures of partisan voting differences.","authors":["Michael J. Barber","Nolan McCarty"],"meta":["January 2015","DOI:10.1017/CBO9781316091906.002","In book: Solutions to Political Polarization in America (pp.15-58)"],"references":["297477636_The_policy_effects_of_political_polarization","275264485_Issue_Conflict_Among_Party_Leaders_and_Followers","270250686_Advice_and_Consent_Senate_Responses_to_Executive_Branch_Nominations_1885-_1996","256020922_The_Consequences_of_Broader_Media_Choice_Evidence_from_the_Expansion_of_Fox_News","228153554_Where_You_Sit_is_Where_You_Stand_The_Impact_of_Seating_Proximity_on_Legislative_Cue-Taking"]}