{"id":"298853209_A_Revised_Version_of_the_Computer_Literacy_Inventory","abstract":"The INCOBI-R is a revised version of an established paper-pencil based instrument for the assessment of computer knowledge (procedural and declarative), computer anxiety, and computer related attitudes (cf. Richter, Naumann & Groeben, 2001). The measurement of computer-related attitudes is based on 8 attitude scales differentiated along the lines of the evaluative perspective on computer technology (personal experience vs. consequences for society), domains of computer use ( learning and work vs. entertainment and communication), and valence (positive vs. negative). To investigate construct and criterion validity of the INCOBI-R, a sample of 444 university students completed the instrument. All scales proved to be internally consistent. In terms of construct validity, the more closely related the constructs were, the higher were their intercorrelations. The items of the computer knowledge scales could be shown to fit the 1PL model (Rasch model). Additionally, a two-dimensional model discriminating procedural and declarative computer knowledge fitted the knowledge data better than a one-dimensional model. A series of nested confirmatory factor analysis models for the attitude scales corroborated that each scale tackles a different component of computer related attitudes. In terms of criterion validity, the scales of the INCOBI-R had meaningful relationships with measures of actual computer use. Reliability estimates and covariance structure of the INCOBI-R scales could be replicated with an independent sample of 87 students.","authors":["Tobias Richter","Johannes Naumann","Holger Horz"],"meta":["January 2010Zeitschrift für Pädagogische Psychologie 24(1):23-37","DOI:10.1024/1010-0652/a000002"],"references":["260321346_Das_Inventar_zur_Computerbildung_INCOBI_Ein_Instrument_zur_Erfassung_von_Computer_Literacy_und_computerbezogenen_Einstellungen_bei_Studierenden_der_Geistes-und_Sozialwissenschaften","297120907_Tests_for_comparing_elements_of_a_correlation_matrix","289963400_Intelligenz_Wissen_und_Problemlosen_Kognitive_Voraussetzungen_fur_erfolgreiches_Handeln_bei_computersimulierten_Problemen","283312640_Bildungsprozesse_im_Lebenslauf_-_Grundzuge_der_zukunftigen_Bildungspanelstudie_fur_die_Bundesrepublik_Deutschland","283060493_Vertrautheit_mit_dem_Computer","279869347_Introspection_Attitude_Change_and_Attitude-Behavior_Consistency_The_Disruptive_Effects_of_Explaining_Why_We_Feel_the_Way_We_Do","277237399_Unterschiede_zwischen_kognitionsbasierten_und_affektbasierten_Einstellungen","274911801_Multiple_Regression_Testing_and_Interpreting_Interactions","266936515_The_Comparison_of_Regression_Variables","262187496_ConQuest_Version_2_Generalised_Item_Response_Modelling_Software"]}