{"id":"298806912_Correlates_of_Success_in_Introductory_Programming_A_Study_with_Middle_School_Students","abstract":"The demand for computing professionals in the workplace has led to increased attention to computer science education, and introductory computer science courses have been introduced at different levels of education. This study investigated the relationship between gender, academic performance in non-programming subjects, and programming learning performance among middle school students with no prior programming experience who took an introductory programming course. We found that girls performed as well as or even better than boys in introductory programming among high-ability Chinese middle school students. However, we found that, instead of gender, students’ performance differences in programming were better explained by their academic performance in non-programming subjects. Students’ math ability was strongly related to their programming performance, and their English ability was the best predictor of their success in introductory programming for these Chinese students. Findings confirm previous studies that have shown a relationship between students’ math ability and performance in learning to program, but the relationship between English ability and introductory programming was unexpected. While this relationship may be specific to students whose first language is not English, aspects of native language may pose hidden barriers that might affect all students’ success in introductory programming.","authors":["Yizhou Qian","James D. Lehman"],"meta":["March 2016Journal of Education and Learning 5(2):73","DOI:10.5539/jel.v5n2p73"],"references":["270397806_Closing_the_gender_gap_in_an_introductory_programming_course","266657122_A_historical_examination_of_the_social_factors_affecting_female_participation_in_computing","291578456_Women_catch_up","281038162_Georgia_Computes_An_Intervention_in_a_US_State_with_Formal_and_Informal_Education_in_a_Policy_Context","277374591_Lowering_the_barriers_to_programming","271744411_The_Gender_Gap_in_Math_Its_Possible_Origins_in_Neighborhood_Effects","264543793_Restart_The_Resurgence_of_Computer_Science_in_UK_Schools","262328072_New_CS1_pedagogies_and_curriculum_the_same_success_factors","262294706_Online_python_tutor_Embeddable_web-based_program_visualization_for_cs_education","262153437_Increasing_women's_participation_in_computing_at_Harvey_Mudd_College"]}