{"id":"298876907_The_nonstochastic_multiarmed_bandit_problem","abstract":"In the multiarmed bandit problem, a gambler must decide which arm of K non-identical slot machines to play in a sequence of trials so as to maximize his reward. This classical problem has received much attention because of the simple model it provides of the trade-off between exploration (trying out each arm to find the best one) and exploitation (playing the arm believed to give the best payoff). Past solutions for the bandit problem have almost always relied on assumptions about the statistics of the slot machines. In this work, we make no statistical assumptions whatsoever about the nature of the process generating the payoffs of the slot machines. We give a solution to the bandit problem in which an adversary, rather than a well-behaved stochastic process, has complete control over the payoffs. In a sequence of T plays, we prove that the per-round payo of our algorithm approaches that of the best arm at the rate O(T-1/2). We show by a matching lower bound that this is the best possible. We also prove that our algorithm approaches the per-round payo of any set of strategies at a similar rate: if the best strategy is chosen from a pool of N strategies, then our algorithm approaches the per-round payo of the strategy at the rate O((log N)T-1/2(-1/2)). Finally, we apply our results to the problem of playing an unknown repeated matrix game. We show that our algorithm approaches the minimax payo of the unknown game at the rate O(T-1/2).","authors":["Peter Auer","Nicolò Cesa-Bianchi","Y Freund","RE Schapire"],"meta":["January 2003SIAM Journal on Computing 32(1):48-77"],"references":["220430859_How_to_use_expert_advice","239292007_Asymptotically_efficient_adaptive_allocation_rules1","226580748_On_repeated_games_with_incomplete_information_played_by_non-Bayesian_players","225182709_Multi-Armed_bandit_problem_revisited","225070191_A_Decision-Theoretic_Generalization_of_On-Line_Learning_and_an_Application_to_Boosting","222556058_A_General_Class_of_Adaptive_Strategies","222506413_Regret_in_the_On-Line_Decision_Problem","222502121_Consistency_and_Cautious_Fictitious_Play","222496661_Adaptive_Game_Playing_Using_Multiplicative_Weights","201976486_Some_Aspects_of_the_Sequential_Design_of_Experiments","38364897_On_Pseudo-Games","4896390_A_Simple_Adaptive_Procedure_Leading_to_Correlated_Equilibrium","2803045_The_Weighted_Majority_Algorithm"]}