{"id":"298898561_Core_entrepreneurial_competencies_and_their_interdependencies_insights_from_a_study_of_Irish_and_Iranian_entrepreneurs_university_students_and_academics","abstract":"The purpose of this paper is to advance our understanding of core entrepreneurial competencies and their interdependencies. Developing entrepreneurial competencies is increasingly seen as important to foster entrepreneurship. Studies to date have highlighted different entrepreneurial competencies in the context of different sectors, regions and countries. However, there has been a lack of consensus in relation to the perceived relative importance of core entrepreneurial competences and their interdependencies among students, academic and entrepreneurs. Our paper focuses on two key questions: first, what are the core entrepreneurial competencies that need to be developed in educational contexts? Second, what are the interdependencies between these entrepreneurial competencies that need to be developed in educational contexts? Using a collective intelligence methodology a comparative study of Iran and Ireland was undertaken that involved three stakeholder groups of students, academics and entrepreneurs. This methodology was used to identify, rank, and structure entrepreneurial competencies considered important for university students. The results of the study indicated that productive thinking, motivation, interpersonal skills and leadership are core entrepreneurial competences that need to be developed in educational contexts. Findings also highlight critical interdependencies between entrepreneurial competencies and the relative influence of different competencies across groups and regions. We outline the implications of our findings for designing a curriculum for improving students’ entrepreneurial competencies.","authors":["Morteza RezaeiZadeh","Michael J Hogan","John O'Reilly","James A Cunningham"],"meta":["March 2017International Entrepreneurship and Management Journal 13(1)","DOI:10.1007/s11365-016-0390-y"],"references":["311729890_The_effects_of_identification_by_the_entrepreneur_to_the_firm_versus_to_the_process","340333532_Determination_of_Hierarchical_Networks_of_Instructional_Units_Using_the_Interpretive_structural_Modeling_Method","325001944_Risk_Taking_Propensity_of_Entrepreneurs","324986022_A_Multidimensional_Model_of_Venture_Growth","319164373_Effects_of_Religious_Beliefs_on_Tendency_towards_New_Business_Venture","313742678_A_multistage_influence_model_of_barriers_to_group_problem_solving","313727827_The_decision_makers","313640916_The_Contributions_and_Disconnections_Between_Writing_a_Business_Plan_and_The_Start-up_Process_for_Incubator_Technology_Entrepreneurs","313427730_Founder_Competence_the_Environment_and_Venture_Performance","311718454_Entrepreneurship_and_Economic_Development","311573708_Organizational_Size_Company_Type_and_Position_Effects_on_the_Perceived_Importance_of_Oral_and_Written_Communication_Skills","306939383_The_magical_number_seven_plus_or_minus_two_Some_limits_on_our_capacity_to_process_information","303411539_An_Introduction_to_Systems_Science","303202036_Why_the_lean_start-up_changes_everything","292715945_Creating_the_Corporate_Future"]}