{"id":"298911541_Towards_a_methodology_to_formulate_sustainable_diets_for_livestock_accounting_for_environmental_impact_in_diet_formulation","abstract":"The objective of this study was to develop a novel methodology that enables pig diets to be formulated explicitly for environmental impact objectives using a Life Cycle Assessment (LCA) approach. To achieve this, the following methodological issues had to be addressed: (1) account for environmental impacts caused by both ingredient choice and nutrient excretion, (2) formulate diets for multiple environmental impact objectives and (3) allow flexibility to identify the optimal nutritional composition for each environmental impact objective. An LCA model based on Canadian pig farms was integrated into a diet formulation tool to compare the use of different ingredients in Eastern and Western Canada. By allowing the feed energy content to vary, it was possible to identify the optimum energy density for different environmental impact objectives, while accounting for the expected effect of energy density on feed intake. A least-cost diet was compared with diets formulated to minimise the following objectives: non-renewable resource use, acidification potential, eutrophication potential, global warming potential and a combined environmental impact score (using these four categories). The resulting environmental impacts were compared using parallel Monte Carlo simulations to account for shared uncertainty. When optimising diets to minimise a single environmental impact category, reductions in the said category were observed in all cases. However, this was at the expense of increasing the impact in other categories and higher dietary costs. The methodology can identify nutritional strategies to minimise environmental impacts, such as increasing the nutritional density of the diets, compared with the least-cost formulation.","authors":["Stephen Mackenzie","Ilkka Leinonen","Neil Ferguson","Ilias Kyriazakis"],"meta":["March 2016The British journal of nutrition -1(10):1-15","DOI:10.1017/S0007114516000763"],"references":["304952251_Accounting_for_uncertainty_in_the_quantification_of_the_environmental_impacts_of_Canadian_pig_farming_systems","313662391_Manure_management_in_Canada","313604835_Life_cycle_assessment_An_operational_guide_to_ISO_standards","312487940_Diet_formulation","312487772_Multi-criteria_decision_analysis_of_feed_formulation_for_laying_hens","311949717_Minimizing_Environmental_Impacts_of_Livestock_Production_Using_Diet_Optimization_Models","292538513_2006_IPCC_Guidelines_for_National_Greenhouse_Gas_Inventories_Volume_4_Agriculture_forestry_and_other_land_use","289148560_The_influence_of_dietary_energy_on_feed_efficiency_in_grow-finish_swine","288917940_Can_the_environmental_impact_of_pig_systems_be_reduced_by_utilising_co-products_as_feed","286481080_Modelling_the_effects_of_thermal_environment_and_dietary_composition_on_pig_performance_Model_testing_and_evaluation"]}