{"id":"298926792_Combined_2D_3D_tracking_of_surgical_instruments_for_minimally_invasive_and_robotic_assisted_surgery","abstract":"Purpose Computer assisted interventions for enhanced minimally invasive surgery (MIS) require tracking of the surgical instruments. Instrument tracking is a challenging problem in both conventional and robotic assisted MIS but vision-based approaches are a promising solution with minimal hardware integration requirements. However, vision-based methods suffer from drift and in the case of occlusions, shadows and fast motion they can be subject to complete tracking failure. \nMethods In this paper we develop a 2D tracker based on a Generalized Hough Transform using SIFT features which can both handle complex environmental changes as well as recover from tracking failure. We use this to initialize a 3D tracker at each frame which enables us to recover 3D instrument pose over long sequences and even during occlusions.\nResults We quantitatively validate our method in 2D and 3D with ex-vivo data collected from a DVRK controller as well as providing qualitative validation on robotic assisted in-vivo data.\nConclusions We demonstrate from our extended sequences that our method pro- vides drift-free robust and accurate tracking. Our occlusion based sequences additionally demonstrate that our method can recover from occlusion based failure. In both cases we show an improvement over using 3D tracking alone suggesting that combining 2D and 3D tracking is a promising solution to challenges in surgical instrument tracking.","authors":["Xiaofei Du","Max Allan","Alessio Dore","Sebastien Ourselin"],"meta":["July 2016International Journal of Computer Assisted Radiology and Surgery 11(6)","DOI:10.1007/s11548-016-1393-4","Project: Instrument tracking"],"references":["290766476_2D-3D_Pose_Tracking_of_Rigid_Instruments_in_Minimally_Invasive_Surgery","286672454_An_open-source_research_kit_for_the_da_VinciR_Surgical_System","283641391_Image_Based_Surgical_Instrument_Pose_Estimation_with_Multi-class_Labelling_and_Optical_Flow","271551248_PixelTrack_A_Fast_Adaptive_Algorithm_for_Tracking_Non-rigid_Objects","313527089_Distinctive_image_features_from_scale-invariant_key_points","300150781_Image-based_tracking_of_the_suturing_needle_during_laparoscopic_interventions","282545365_Detecting_Surgical_Tools_by_Modelling_Local_Appearance_and_Global_Shape","269338816_Fast_Part-Based_Classification_for_Instrument_Detection_in_Minimally_Invasive_Surgery","269299944_Consensus-based_matching_and_tracking_of_keypoints_for_object_tracking","262369919_Exploiting_the_Circulant_Structure_of_Tracking-by-Detection_with_Kernels"]}