{"id":"299049767_Verification_of_Temporal-Causal_Network_Models_by_Mathematical_Analysis","abstract":"Usually dynamic properties of models can be analysed by conducting simulation experiments. But sometimes, as a kind of prediction properties can also be found by calculations in a mathematical manner, without performing simulations. Examples of properties that can be explored in such a manner are:\nwhether some values for the variables exist for which no change occurs (stationary points or equilibria), and how such values may depend on the values of the parameters of the model and/or the initial values for the variables\nwhether certain variables in the model converge to some limit value (equilibria) and how this may depend on the values of the parameters of the model and/or the initial values for the variables\nwhether or not certain variables will show monotonically increasing or decreasing values over time (monotonicity)\nhow fast a convergence to a limit value takes place (convergence speed)\nwhether situations occur in which no convergence takes place but in the end a specific sequence of values is repeated all the time (limit cycle)\nSuch properties found in an analytic mathematical manner can be used for verification of the model by checking them for the values observed in simulation experiments. If one of these properties is not fulfilled, then there will be some error in the implementation of the model. In this paper some methods to analyse such properties of dynamical models will be described and illustrated for the Hebbian learning model, and for dynamic connection strengths in social networks. The properties analysed by the methods discussed cover equilibria, increasing or decreasing trends, recurring patterns (limit cycles), and speed of convergence to equilibria.","authors":["Jan Treur"],"meta":["April 2016Vietnam Journal of Computer Science 3(4)","DOI:10.1007/s40595-016-0067-z","Project: Mathematical Analysis of Emergent Network Behaviour in Relation to the Network's Structure"],"references":["289193241_Dynamic_Modeling_Based_on_a_Temporal-Causal_Network_Modeling_Approach","261180028_Modelling_and_Analysis_of_Social_Contagion_in_Dynamic_Networks","258229910_The_dynamical_systems_approach_to_differential_equations","284146246_Memoire_sur_les_courbes_definies_par_une_equation_differentielle_and_Sur_les_courbes_definies_par_les_equations_differentielles","264957347_Memoire_sur_les_courbes_definies_par_une_equation_differentielle","264954859_The_Qualitative_Theory_of_Ordinary_Differential_Equations","252332842_New_Methods_of_Celestial_Mechanics","246047720_The_Elements_of_Physical_Biology","242554268_The_Organization_of_Behavior","225817281_Sur_les_courbes_definies_par_des_equations_differentielles"]}