{"id":"2991722_High-Resolution_Frequency-Wavenumber_Spectrum_Analysis","abstract":"The output of an array of sansors is considered to be a homogeneous random field. In this case there is a spectral representation for this field, similar to that for stationary random processes, which consists of a superposition of traveling waves. The frequency-wavenumber power spectral density provides the mean-square value for the amplitudes of these waves and is of considerable importance in the analysis of propagating waves by means of an array of sensors. The conventional method of frequency-wavenumber power spectral density estimation uses a fixed-wavenumber window and its resolution is determined essentially by the beam pattern of the array of sensors. A high-resolution method of estimation is introduced which employs a wavenumber window whose shape changes and is a function of the wavenumber at which an estimate is obtained. It is shown that the wavenumber resolution of this method is considerably better than that of the conventional method. Application of these results is given to seismic data obtained from the large aperture seismic array located in eastern Montana. In addition, the application of the high-resolution method to other areas, such as radar, sonar, and radio astronomy, is indicated.","authors":["J. Capon"],"meta":["September 1969Proceedings of the IEEE 57(8):1408 - 1418","DOI:10.1109/PROC.1969.7278","SourceIEEE Xplore"],"references":["6071551_Microseisms_Mode_Structure_and_Sources","313679326_Direction_of_approach_of_Rayleigh_waves_and_related_problems_Part_I","292136378_Observations_of_multiple_seismic_events","277699168_The_Measurement_of_Power_Spectra_from_the_Point_of_View_of_Communications_Engineering_-_Part_II","270756685_An_Introduction_to_the_Theory_of_Stationary_Random_Functions","238703616_An_Introduction_to_the_Theory_of_Stationary_Random_Functions_Englewood_Cliffs","6102656_Radio_Interferometry_at_One-Thousandth_Second_of_Arc","2989894_Multidimensional_Maximum-Likelihood_Processing_of_a_Large_Aperture_Seismic_Array","2989038_Principles_of_an_experimental_Large_Aperture_Seismic_Array_LASA"]}