{"id":"299134867_Selecting_Sensors_in_Biological_Fractional-Order_Systems","abstract":"In this paper, we focus on sensor selection, i.e., determine the minimum number of state variables that need to be measured, to monitor the evolution of the entire biological system, i.e., all the state variables, when modeled by discrete-time fractional-order systems (DTFOS) that are subject to modeling errors, process and measurement noise. These systems are particularly relevant when modeling of spatiotemporal dynamics of processes in which the impact of long-range memory cannot be properly modeled by multivariate auto-regressive integrative moving-average models. Therefore, DTFOS enable a unified state-space framework to model the evolution of several biological (e.g., stem cell growth and bacteria evolution) and physiological signals (e.g., electroencephalogram and electromyogram). Therefore, in this paper, we focus on the solution to four different (yet related) problems of sensor selection for DTFOS, that are motivated by constraints on the data acquisition that are enforced by the detrimental impact of the sensing mechanisms to the biological system, the cost of performing the measurements with the current sensing technology, or spatial constraints that limit the numbe","authors":["Vasileios Tzoumas","Yuankun Xue","Sergio Pequito","Paul Bogdan"],"meta":["January 2017IEEE Transactions on Control of Network Systems PP(99)","DOI:10.1109/TCNS.2018.2809959"],"references":["317133345_The_robust_minimal_controllability_problem","318988779_Reliable_Multi-Fractal_Characterization_of_Weighted_Complex_Networks_Algorithms_and_Implications","318334563_Scheduling_nonlinear_sensors_for_stochastic_process_estimation","315914529_Constructing_compact_causal_mathematical_models_for_complex_dynamics","313691182_Minimum_number_of_sensors_to_ensure_observability_of_physiological_systems_A_case_study","312114608_Near-optimal_sensor_scheduling_for_batch_state_estimation_Complexity_algorithms_and_limits","304938425_Fractional_Dynamics_Recent_Advances","301232370_A_Spatio-Temporal_Fractal_Model_for_a_CPS_Approach_to_Brain-Machine-Body_Interfaces","300414238_Sensor_selection_for_optimal_filtering_of_linear_dynamical_systems_Complexity_and_approximation","292251882_Fractional_Dynamics_and_Control"]}