{"id":"299222200_The_pandora's_box_of_citation_analysis_Measuring_scientific_excellence_-_The_last_evil","abstract":"This paper presents an overview of advanced bibliometric methods for objective and transparent assessment of strengths and weaknesses in research performance, and monitoring of scientific developments. In the first application, we focus on the detailed analysis of research performance from an international comparative perspective. This type of analysis can be applied at different levels of aggregation, but the institutional level is particularly crucial in the \"search for excellence.\" We demonstrate that our recently developed indicators are very informative, despite the often poor but nonetheless dogged objections raised by opponents of bibliometric analysis. We conclude that advanced bibliometric methods are, particularly at the level of research groups (e.g., university departments and institutes) an indispensable element alongside peer review in the research evaluation process. In the second application, monitoring of scientific (basic and applied) developments, recent advances in bibliometric mapping techniques show promise. They are unique instruments to discover patterns of scientific communication, processes of knowledge dissemination, and the structural dynamics of scientific developments. We discuss \"bibliometric cartography\" briefly and indicate its potential for unraveling multidisciplinary developments and interfaces between science and technology. This is important, as we know that the multidisciplinary crossroads of basic and applied scientific fields are often the loci of discovery and technological innovation. We present recent, practical examples. Advanced bibliometric methods have now come to a stage of providing excitement instead of \"just easy data.\" They are becoming, in addition to their intrinsic value for the study of science and technology, a more and more important branch of information technology.","authors":["Ton van Raan"],"meta":["January 2000"],"references":["242916087_'New_Bibliometric_Tools_for_the_Assessment_of_National_Research_Performance_Database_Description_Overview_of_Indicators_and_First_Applications'","14577313_Impact_factors_can_mislead","222505582_Comparative_analysis_of_a_set_of_bibliometric_indicators_and_central_peer_review_criteria_Evaluation_of_condensed_matter_physics_in_the_Netherlands"]}