{"id":"299365263_Project-based_learning_to_promote_high_order_thinking_and_problem_solving_skills_in_geotechnical_courses","abstract":"In today’s society engineer professionals play a crucial role in tackling challenges such as climate change or economic constraints, in order to promote economical development and increase of quality of life ensuring principles like sustainability or safety. It is fundamental to prepare the future engineers to these and future challenges. According to the literature, traditional engineering educational strategies used to prepare the future engineers (lectures, lab experiences and homework) have two main drawbacks. Firstly, they inadequately prepare engineering students to engage in collaborative partnerships (essential for the practicing engineer) and, secondly, they promote passive learning and contribute to a compartmentalized curriculum. As such, the traditional deductive learning may not adequately prepare students for their innovative and flexible role as future engineers. An alternative approach is the use of non-traditional learning strategies, as in the case study hereby presented. Active learning strategies, namely project-based learning, were used to contribute to enhancing problem solving and higher order thinking skills of the graduates in Civil Engineering program of University of Aveiro, Portugal. Seizing the opportunity created by the Bologna process, two complementary courses on Geotechnical subjects (Soil Mechanics I and II) have been redesigned. The non-traditional strategies implemented include project-based learning using cooperative and collaborative models, put into practice since 2007/2008. The learning strategies referred are described and discussed. Their contribution to the development of problem solving and high order thinking skills of students is pointed out. Several strategies used to promote acceptance by students are put forward. The models were assessed using three strategies: students’ feedback during the semester; academic performance; questionnaires at the end of the semester. The evolution of the students’ response to these models is discussed using data collected in the courses. The models have been adapted to overcome some of the difficulties faced during their implementation.","authors":["Margarida Pinho Lopes","Joaquim Macedo"],"meta":["January 2014","Project: Project- and problem-based learning in engineering education"],"references":["245291513_A_Model_for_Instructional_Design","241740232_Creating_high_challengehigh_support_academic_environments_through_constructive_alignment_Student_outcomes","233019999_Is_attending_lectures_still_relevant_in_engineering_education","232613589_Student-centredness_The_link_between_transforming_students_and_transforming_ourselves","263502215_Environments_for_fostering_effective_critical_thinking_in_geotechnical_engineering_education_Geo-EFFECTs","263502149_Incorporating_learning_outcomes_into_an_introductory_geotechnical_engineering_course","260868272_Some_reflections_on_the_use_of_a_cooperative_learning_model_in_Soil_Mechanics_courses","235465787_A_Taxonomy_for_Learning_Teaching_and_Assessing_A_Revision_of_Bloom's_Taxonomy_of_Educational_Objectives","235407022_Project-based_Engineering_Design_Education_A_Malaysian_Case","233286107_Creativity_and_inspiration_for_problem_solving_in_engineering_education","233148556_Cooperative_learning_in_a_Soil_Mechanics_course_at_undergraduate_level"]}