{"id":"299346352_Improving_gross_anatomy_learning_using_reciprocal_peer_teaching","abstract":"The use of cadavers in human anatomy teaching requires adequate number of anatomy instructors who can provide close supervision of the students. Most medical schools are facing challenges of lack of trained individuals to teach anatomy. Innovative techniques are therefore needed to impart adequate and relevant anatomical knowledge and skills. This study was conducted in order to evaluate the traditional teaching method and reciprocal peer teaching (RPT) method during anatomy dissection.\nDebriefing surveys were administered to the 227 first year medical students regarding merits, demerits and impact of both RPT and Traditional teaching experiences on student’s preparedness prior to dissection, professionalism and communication skills. Out of this, 159 (70 %) completed the survey on traditional method while 148 (65.2 %) completed survey on RPT method. An observation tool for anatomy faculty was used to assess collaboration, professionalism and teaching skills among students. Student’s scores on examinations done before introduction of RPT were compared with examinations scores after introduction of RPT.\nOur results show that the mean performance of students on objective examinations was significantly higher after introduction of RPT compared to the performance before introduction of RPT [63.7 ± 11.4 versus 58.6 ± 10, mean difference 5.1; 95 % CI = 4.0–6.3; p-value < 0.0001]. Students with low performance prior to RPT benefited more in terms of examination performance compared to those who had higher performance [Mean difference 7.6; p-value < 0.0001]. Regarding student’s opinions on traditional method versus RPT, 83 % of students either agreed or strongly agreed that they were more likely to read the dissection manual before the RPT dissection session compared to 35 % for the traditional method. Over 85 % of respondents reported that RPT improved their confidence and ability to present information to peers and faculty compared to 38 % for the tradition method. The majority of faculty reported that the learning environment of the dissection groups was very active learning during RPT sessions and that professionalism was observed by most students during discussions.\nIntroduction of RPT in our anatomy dissection laboratory was generally beneficial to both students and faculty. Both objective (student performance) and subjective data indicate that RPT improved student’s performance and had a positive learning experience impact. Our future plan is to continue RPT practice and continually evaluate the RPT protocol.","authors":["Mange Manyama","Renae E Stafford","Erick J Mazyala","Antony Lukanima"],"meta":["March 2016BMC Medical Education 16(1)","DOI:10.1186/s12909-016-0617-1","Project: Medical education"],"references":["315766674_RECIPROCAL_PEER_TEACHING_AN_INNOVATIVE_METHOD_TO_LEARN_GROSS_ANATOMY","282337882_A_Little_Healthy_Competition_Using_mixed_methods_to_pilot_a_team-based_digital_game_for_boosting_medical_student_engagement_with_anatomy_and_histology_content","277227262_Perception_to_cadaver_dissection_and_views_on_Anatomy_as_a_subject_between_two_pioneer_cohorts_in_a_Kenyan_Medical_School","316597030_Learning_together_to_work_together_for_health_Report_of_a_WHO_Study_Group_on_Multiprofessional_Education_of_Health_Personnel_The_Team_Approach","312388789_Peer_tutoring_Putting_it_to_the_test","312368277_Perceived_Usefulness_of_Reciprocal_Peer_Teaching_Among_Doctor_of_Physical_Therapy_Students_in_the_Gross_Anatomy_Laboratory","296902514_Survey_of_gross_anatomy_courses_in_the_United_States_and_Canada","282311170_Do_collaborative_practical_tests_encourage_student-centered_active_learning_of_gross_anatomy","277717678_Student_Perceptions_of_Independent_Versus_Facilitated_Small_Group_Learning_Approaches_to_Compressed_Medical_Anatomy_Education","273444502_Where's_The_Learning_In_Service-Learning"]}