{"id":"299338625_The_Relative_Disagreement_Model_of_Opinion_Dynamics_Where_Do_Extremists_Come_From","abstract":"In this paper we introduce a novel model that can account for the spread of extreme opinions in a human population as a purely local, selforganising process. Our starting point is the well-known and influential Relative Agreement (RA) model of opinion dynamics introduced by Deffuant et al. (2002). The RA model explores the dynamics of opinions in populations that are initially seeded with some number of “extremist” individuals, who hold opinions at the far ends of a continuous spectrum of opinions represented in the abstract RA model as a real value in the range [-1.0, +1.0]; but where the majority of the individuals in the population are, at the outset, “moderates”, holding opinions closer to the central mid-range value of 0.0. Various researchers have demonstrated that the RA model generates opinion dynamics in which the influence of the extremists on the moderates leads, over time, to the distribution of opinion values in the population converging to attractor states that can be qualitatively characterised as one of either uni-polar and bi-polar extremes, or reversion to the centre (“central convergence”). However, a major weakness of the RA model is that it pre-supposes the existence of extremist individuals, and hence says nothing to answer the question of “where do extremists come from?” In this paper, we introduce the Relative Disagreement (RD) model, in which extremist individual arise spontaneously and can then exert influence over moderates, forming large groups of polar extremists, via an entirely internal, self-organisation process. We demonstrate that the RD model can readily exhibit the uni-polar, bi-polar, and central-convergence attractors that characterise the dynamics of the RA model, and hence this is the first paper to describe an opinion dynamic model in which extremist positions can spontaneously arise and spread in a population via a self-organising process where opinion-influencing interactions between any two individuals are characterised not only by the extent to which they agree, but also by the extent to which they disagree.","authors":["Michael Meadows","Dave Cliff"],"meta":["January 2014","DOI:10.1007/978-3-642-54140-7_6","Conference: International Workshop on Self-Organizing Systems"],"references":["245657880_Choice_Shift_and_Group_Polarisation","235737446_Mixing_Beliefs_Among_Interacting_Agents","45853684_Studies_of_opinion_stability_for_small_dynamic_networks_with_opportunistic_agents","37927205_A_Discrete_Nonlinear_and_Non-Autonomous_Model_of_Consensus_Formation","11314133_Growing_Scale-Free_Networks_with_Small_World_Behavior","5500332_Consensus_formation_on_adaptive_networks","5140497_Comparing_Extremism_Propagation_Patterns_in_Continuous_Opinion_Models","5140360_Opinion_Dynamics_and_Bounded_Confidence_Models_Analysis_and_Simulation","1898302_Continuous_Opinion_Dynamics_under_Bounded_Confidence_A_Survey","286914092_Reexamining_the_Relative_Agreement_Model_of_Opinion_Dynamics","248126722_Towards_Consensus_Some_Convergence_Theorems_on_Repeated_Averaging","222298398_The_role_of_network_topology_on_extremism_propagation_with_the_Relative_Agreement_opinion_dynamics"]}