{"id":"299401814_Fog_Computing_May_Help_to_Save_Energy_in_Cloud_Computing","abstract":"Tiny computers located in end-user premises are becoming popular as local servers for Internet of Things (IoT) and Fog computing services. These highly distributed servers that can host and distribute content and applications in a peer-to-peer (P2P) fashion are known as nano data centers (nDCs). Despite the growing popularity of nano servers, their energy consumption is not well-investigated. To study energy consumption of nDCs, we propose and use flow-based and time-based energy consumption models for shared and unshared network equipment, respectively. To apply and validate these models, a set of measurements and experiments are performed to compare energy consumption of a service provided by nDCs and centralized data centers (DCs). A number of findings emerge from our study, including the factors in the system design that allow nDCs to consume less energy than its centralized counterpart. These include the type of access network attached to nano servers and nano server's time utilization (the ratio of the idle time to active time). Additionally, the type of applications running on nDCs and factors such as number of downloads, number of updates, and amount of preloaded copies of data influence the energy cost. Our results reveal that number of hops between a user and content has little impact on the total energy consumption compared to the above-mentioned factors. We show that nano servers in Fog computing can complement centralized DCs to serve certain applications, mostly IoT applications for which the source of data is in end-user premises, and lead to energy saving if the applications (or a part of them) are off-loadable from centralized DCs and run on nDCs.","authors":["Fatemeh Jalali","Kerry Hinton","Robert S. Ayre","Tansu Alpcan"],"meta":["May 2016IEEE Journal on Selected Areas in Communications 34(5):1-1","DOI:10.1109/JSAC.2016.2545559"],"references":["275159422_Energy_consumption_modelling_of_optical_networks","271424990_Energy_Consumption_of_Photo_Sharing_in_Online_Social_Networks","261264269_Energy_consumption_of_interactive_cloud-based_document_processing_applications","260753114_Fog_Computing_A_Platform_for_Internet_of_Things_and_Analytics_Flavio_Bonomi_Rodolfo_Milito_Preethi_Natarajan_and_Jiang_Zhu_N_Bessis_and_C_Dobre_eds_Big_Data_and_Internet_of_Things_169_A_Roadmap_for_Sm","251886785_Architectures_for_Energy-Efficient_IPTV_Networks","224224695_Toward_Energy-Efficient_Content_Dissemination","224170417_Green_Cloud_Computing_Balancing_Energy_in_Processing_Storage_and_Transport","224169872_Energy_trade-offs_among_content_delivery_architectures","308355487_Energy_efficiency_analysis_of_the_reference_systems_areas_of_improvements_and_target_breakdown","261117276_Estimating_the_Energy_Consumption_for_Packet_Processing_Storage_and_Switching_in_Optical-IP_Routers"]}