{"id":"299402429_EL_PROFESOR_COMO_FUENTE_DE_MOTIVACION_DE_LOS_ESTUDIANTES_HABLANDO_DEL_QUE_Y_DEL_POR_QUE_DEL_APRENDIZAJE_DE_LOS_ESTUDIANTES","abstract":"RESUMEN: En este artículo se discutirá cómo los profesores, directores, consejeros escolares y otros profesionales de la educación pueden mejorar la cantidad y la calidad de la motivación de los estudiantes, trabajando en el “qué” los motiva (metas de logro académico, por ejemplo) y en el “por qué” (razones) ellos luchan por alcanzar estas metas. Con base en la Teoría de las Metas de Logro y en la Teoría de la Autodeterminación, se discutirán las diferencias en la calidad de la motivación de los estudiantes y se explicará por qué los profesores deben crear un ambiente de aprendizaje que promueva formas óptimas de motivación.\nABSTRACT: In this article we will discuss how teachers, principals, student counselors, and other professionals in education, can enhance the quantity and the quality of students' motivation by affecting what students are motivated for (i.e., their academic achievement goals) and the reasons why they strive to reach those goals. Based on Achievement goal theory and on Selfdetermination theory we will discuss these qualitative differences in students' motivation and we will explain why teachers should create a learning environment that fosters these more optimal types of motivation.","authors":["Willy Lens","Lennia Matos","Maarten Vansteenkiste"],"meta":["December 2008Revista Digital de Investigación en Docencia Universitaria 4(2):9","DOI:10.19083/ridu.4.9"],"references":["237231750_Intrinsic_Versus_Extrinsic_Goal_Contents_in_Self-Determination_Theory_Another_Look_at_the_Quality_of_Academic_Motivation","233643579_Achievement_Goals_Learning_Strategies_and_Language_Achievement_among_Peruvian_High_School_Students","232488663_Less_Is_Sometimes_More_Goal_Content_Matters","11946306_Self-Determination_Theory_and_the_Facilitation_of_Intrinsic_Motivation_Social_Development_and_Well-Being","289963573_The_relation_between_goal_orientation_and_students_motivational_beliefs_and_self-regulated_learning","247434297_A_2_2_achievement_goal_framework","28359731_Intrinsic_versus_extrinsic_goal_promotion_and_autonomy_support_versus_control_Facilitating_performance_persistence_socially_adaptive_functioning_and_well-being","12564355_Goal_Theory_Motivation_and_School_Achievement_An_Integrative_Review","12167519_Academic_Self-Handicapping_and_Achievement_Goals_A_Further_Examination"]}