{"id":"299437094_Un_apercu_sur_l'enseignement_de_l'informatique_au_Maroc_Necessite_d'une_reforme_des_curricula_An_overview_of_teaching_informatics_in_Morocco_The_need_for_a_curriculum_reform","abstract":"Ces dernières années, plusieurs chercheurs, groupes de travail et associations (Diethelm et al. 2013; Baudé 2013a; Furber 2012; Seehorn et al. 2011) ont lancé des appels d’alerte sur la nécessité d’accorder une grande attention à l’informatique en tant que matière obligatoire dans les différents cycles d’enseignement. La tendance actuelle est d’enseigner la pensée informatique et la résolution des problèmes dès le cycle primaire. Ainsi l’informatique est de plus en plus perçue comme une discipline scolaire au même niveau que les mathématiques, les sciences de la vie et de la terre, la chimie et la physique. Cet article montre l’importance de l’informatique comme composante fondamentale de l’éducation citoyenne et essaye de dresser un aperçu sur l’état de l’enseignement de cette discipline au Maroc. A la fin, et à la lumière des expériences sur l’enseignement de l’informatique menées dans quelques pays tel que l’Angleterre, les Etats Unis, la France, le Japon, la Pologne et la Tunisie, nous présentons des suggestions pour d’éventuelles réformes de l’enseignement de l’informatique au Maroc. \n\nIn recent years, many researchers, study groups and associations (Diethelm et al. 2013; Baudé 2013; Furber 2012; Seehorn et al. 2011) launched alerting calls to make the teaching of informatics as a subject and make it mandatory at all educational levels. The current mainstream is to start teaching computational thinking and problem solving as early as the primary school. In fact, informatics is increasingly seen as an academic discipline similar to other subjects like mathematics, earth and life sciences, chemistry, and physics. This article underlines the importance of computer science as an essential component of civic education. We then make a critical overview about the state of informatics education in Morocco. At the end we present a number of suggestions for any eventual reforms related to the subject in light of what’s been adopted in few countries like England, the United States, France, Japan, Poland and Tunisia.","authors":["Ibrahim Ouahbi","Hassane Darhmaoui","Fatiha Kaddari","Abdellah Bemmouna"],"meta":["March 2016"],"references":["279936430_Learning_Basic_Programming_Concepts_By_Creating_Games_With_Scratch_Programming_Environment","276481963_Comparative_Study_of_the_IT_TeachingLearning_in_School_Contexts_Lebanese_and_Moroccan","263733166_DISTANCE_LEARNING_INITIATIVE_FOR_TEACHERS_TRAINING_IN_MOROCCO_THE_ITQANE_E-LEARNING_PROJECT","263279986_Serious_Games_for_teaching_combined_basic_programming_and_English_communication_for_non-science_major_students","260984282_CITI_Experience_in_introducing_ICT_into_Middle_School_education_in_Morocco","343381487_La_science_informatique_doit_etre_enseignee_des_le_secondaire_au_meme_titre_que_la_physique_ou_la_biologie_Des_analyses_convergentes","311471279_Toward_a_K-12_computer_science_curriculum","298216998_The_new_course_of_study_and_a_prospect_of_information_studies_education_in_Japan","280812431_Le_concours_Castor_un_outil_de_promotion_de_l'enseignement_d'informatique","278631476_L'utilisation_pedagogique_de_l'informatique_a_l'ecole_entre_volontarisme_de_praticiens_et_rigueur_des_sciences_de_l'education_Ebauche_d'une_archeologie_des_idees_pedagogiques_a_partir_des_discours"]}