{"id":"299411968_An_Efficient_Similarity_Digests_Database_Lookup_-_A_Logarithmic_Divide_Conquer_Approach","abstract":"Investigating seized devices within digital forensics represents a challenging task due to the increasing amount of data. Common procedures utilize automated file identification, which reduces the amount of data an investigator has to examine manually. In the past years the research field of approximate matching arises to detect similar data. However, if n denotes the number of similarity digests in a database, then the lookup for a single similarity digest is of complexity of O(n). This paper presents a concept to extend existing approximate matching algorithms, which reduces the lookup complexity from O(n) to O(log(n)). Our proposed approach is based on the well-known divide and conquer paradigm and builds a Bloom filter-based tree data structure in order to enable an efficient lookup of similarity digests. Further, it is demonstrated that the presented technique is highly scalable operating a trade-off between storage requirements and computational efficiency. We perform a theoretical assessment based on recently published results and reasonable magnitudes of input data, and show that the complexity reduction achieved by the proposed technique yields a 220-fold acceleration of look-up costs.","authors":["Frank Breitinger","Christian Rathgeb","Harald Baier"],"meta":["September 2014","DOI:10.15394/jdfsl.2014.1178"],"references":["267456463_On_the_database_lookup_problem_of_approximate_matching","259164859_FRASH_A_framework_to_test_algorithms_of_similarity_hashing","251702903_An_evaluation_of_forensic_similarity_hashes","222430237_Kornblum_J_Identifying_Almost_Identical_Files_using_Context_Triggered_Piecewise_Hashing_Digital_Investigation_3suppl_91-97","222424534_Multi-resolution_similarity_hashing","292841260_Towards_a_Process_Model_for_Hash_Functions_in_Digital_Forensics","288702317_Managing_Terabyte-Scale_Investigations_with_Similarity_Digests","273033070_Evaluating_detection_error_trade-offs_for_bytewise_approximate_matching_algorithms","268741777_Similarity_Preserving_Hashing_Eligible_Properties_and_a_New_Algorithm_MRSH-v2","259164872_F2S2_Fast_forensic_similarity_search_through_indexing_piecewise_hash_signatures"]}