{"id":"299468769_Cine_europeo_en_lenguas_de_naciones_sin_estado_y_pequenas_naciones","abstract":"Introdución. A recente incorporación ao dominio da reflexión académica dunha denominación diversa: cinema de pequenas nacións, identitario, en linguas minoritarias/minorizadas. A reconceptualización do termo cinema nacional, síntoma da multiplicidade de prácticas de linguas aínda sobreviventes. E unha abordaxe da política comunitaria en dúas vertentes: lingüística e cinematográfica, serán os nosos asuntos. Metodoloxía. Isto último emprázanos nas accións relativas á VO e VOS e na difícil transformación política de asuntos culturais, identitarios e ideolóxicos, fraguados en extensos períodos, que exceden a constitución da Unión. A súa abordaxe política na Carta Europea das Linguas Rexionais ou Minoritarias,ou nunha Comunicación da Comisión de Cultura e Educación ao Parlamento, é sempre escasa e paradoxal. Resultados e Discusión. Finalmente, acométense as condicións de confrontación da política comunitaria, con políticas recentes a pé de territorio, concretamente, os casos de Galiza, Gales e Finlandia.","authors":["Marta Pérez Pereiro","Margarita Ledo","Antía López-Gómez"],"meta":["March 2016Revista Latina de Comunicacion Social 71(71):309-331","DOI:10.4185/RLCS-2016-1097","Project: eDCINEMA: Towards the European Digital Space. The role of small cinemas in original version"],"references":["324365266_Quebec_National_Cinema","323321990_Imagined_communities_reflections_on_the_origin_and_spread_of_nationalism","319484375_Third-World_Literature_in_the_Era_of_Multinational_Capitalism","319484001_Kafka_Por_una_literatura_menor","297154783_The_cinema_of_small_nations","279970468_Third_World_Literature_in_the_Era_of_Multinational_Capital","274537946_The_Concept_of_National_Cinema","274123344_Introduction_-_Le_cinema_europeen_et_les_langues","272145156_A_transnational_history_of_Finnish_cinema_-_rethinking_the_study_of_a_small_nation_cinema","271287724_ImpersoNations_National_Cinema_Historical_Imaginaries_and_New_Cinema_Europe"]}