{"id":"299482327_Solving_conformal_contacts_using_multi-Hertzian_techniques","abstract":"Recently, publications aiming at wheel–rail contact surveys let readers think that multi-Hertzian methods present severe drawbacks with respect to ‘virtual penetration’ methods. These surveys criticise multi-Hertzian solutions mainly because presenting ‘larger contacts overlaps’ and ‘frequent secondary contacts near the border of the first contact’, both obvious geometric possibilities of which the practical occurrence and eventual inconvenience would remain purely theoretical unless established over definite methods demonstrating poor practical results. Recent surveys all quote Piotrowski–Chollet 2005 survey of wheel–rail contact models that attempted to illustrate defective multi-Hertzian techniques by concentrating on the method initiated by Sauvage in the 1990s and further developed by Pascal. The 2005 paper not only gives no evidence of practical inconveniences of Sauvage’s method but also confuses static geometric contact overlaps with the dynamical overlapping of forces. In reality it mixes Sauvage method up with a quite different technique. Thus a clarification is now necessary by reminding what the proper Sauvage technique really is and by showing some of its practical successful applications. The present paper, focusing on determination of normal contact forces in conformal situations, intends to explain clearly the advantages of the unequivocal localisation of secondary ellipses in that multi-Hertzian method which has been developed in INRETS VOCO codes in the 1990s and successfully used by SNCF and ALSTOM in the INRETS-SNCF code, VOCODYM, and later in Pascal’s online calculation of railway elastic contacts code. It proved its effectiveness for studying freight wagons derailments as well as rail wear and head-check, unrounded wheels wear, high-speed lines’ deformations or TGV comfort. While simulating American ACELA trainsets’ behaviour on the US North-East Corridor tracks, prior to actual tests, as part of the commercial contract. It has been also a major tool for bringing back together French and American Safety Standards.","authors":["Jean-Pierre Pascal","Brahim Soua"],"meta":["March 2016Vehicle System Dynamics 54(6):1-30","DOI:10.1080/00423114.2016.1161201"],"references":["292695535_On_Efficient_Modelling_of_Wheel-Rail_Contact_in_Vehicle_Dynamics_Simulation","282976464_Non-Elliptic_Wheel-Rail_Contact_Modelling_in_Vehicle_Dynamics_Simulation","282976398_An_alternative_to_FASTSIM_for_tangential_solution_of_the_wheel-rail_contact","282646699_Reliability_of_High_Speed_Dynamical_Derailment_Simulations","267488365_Coupling_OCREC_Contact_Code_With_ADAMS_Simulations_of_One_Coach_at_130mph","267486956_The_Rigid-Multi-Hertzian_Method_as_Applied_to_Conformal_Contacts","313562074_Uber_die_Beruhrung_fester_elastischer_Korper_und_uber_die_Harte_in","301322422_Finite_element_study_of_wheel-rail_conformal_rolling_contact","284501866_A_fast_approximate_method_to_calculate_normal_load_at_contact_between_wheel_and_rail_and_creep_forces_during_rolling","269351902_Solving_conformal_wheel-rail_rolling_contact_problems","266961249_A_novel_method_to_model_wheel-rail_normal_contact_in_vehicle_dynamics_simulation","263530632_Rotational_equations_usable_for_railway_wheelsets","261676014_The_VOCO_multi-body_software_in_the_context_of_real-time_simulation","261857985_Parametres_caracteristiques_du_contact_rouerail","254906673_On_the_rolling_contact_of_two_elastic_bodies_in_presence_of_dry_friction"]}