{"id":"299576640_An_interdisciplinary_exploration_of_collegiate_internships","abstract":"Purpose\n– Collegiate internships play an important role in the development of professionals. They provide students the opportunity to experience real world expectations embedded within actual vocational environments under the support of their collegiate faculty. Although there are a number of common reasons why internships are utilized in each academic area, the requirements for the experiences are substantially different across disciplines and level of coursework. The purpose of this paper is to explore some of the commonalities and differences that exist for internships across collegiate academic disciplines at both the undergraduate and graduate levels, and identify their salience for programs from an interdisciplinary perspective.\n\nDesign/methodology/approach\n– For this conceptual piece, the authors took an introspective qualitative look at both programs and compared and contrasted them based on internally available documentation and information. Although this was theoretical in nature, the authors utilized materials available for certification and accreditation purposes for each of their programs. Multiple data sources were stakeholder interviews and conversations, site visits/observations, and site artifacts/documents.\n\nFindings\n– The authors found a great deal of both similarity and dissimilarity across programs, and these findings were utilized as grounds for programmatic introspection, evaluation, accreditation, and certification to better understand how stakeholder voice is involved in the processes. Table I provides an overview of items identified, and will serve as a guide for the remainder of this paper.\n\nOriginality/value\n– An inclusive awareness will consider the voices of the student, university, employer, and other stakeholders, including co-workers and employers that currently do not offer internships. Given the rising cost of tuition and the wealth of competition in the market, the pressure is on for institutions of higher education to up the ante when it comes to providing quality experiential learning opportunities. The next step should focus on defining expectations and tailoring each internship program, and for that to be accomplished, all stakeholders must be “all in.”","authors":["Jeffrey Hoyle","Mark Edward Deschaine"],"meta":["April 2016Education and Training 58(4):372-389","DOI:10.1108/ET-10-2015-0098"],"references":["303475691_Exploring_Stakeholder_Relationships_in_a_University_Internship_Program_A_Qualitative_Study","286606545_A_stakeholder_framework_for_designing_and_directing_effective_marketing_internships","325004095_Determinants_of_Internship_Effectiveness_An_Exploratory_Model","324998707_Making_the_Most_of_an_Internship_An_Empirical_Study_of_Internship_Satisfaction","324299825_Distinction_A_Social_Critique_of_the_Judgement_of_Taste","318517973_Leaving_College_Rethinking_the_Causes_and_Cures_of_Student_Attrition","292452708_Some_thoughts_on_the_development_of_stakeholder_theory","284690811_What_to_do_when_stakeholders_matter_a_guide_to_stakeholder_identification_and_analysis_techniques","281790714_Making_the_Most_of_an_Internship_An_Empirical_Study_of_Internship_Satisfaction","281027375_Learners_as_information_processors_Legacies_and_limitations_of_educational_psychology's_second_metaphor"]}