{"id":"299530159_El_Aprendizaje_como_Propiedad_Emergente_en_los_Sistemas_Regionales_de_Innovacion","abstract":"The knowledge systemic interactions among heterogeneous agents of a Regional Innovation System (RIS) are crucial in the creation of new and recombinant technological knowledge and its transformation into innovations. From this approach, the access to the external knowledge, the internal learning and the research effort are essential inputs for the creation of new knowledge. This paper analyzes learning as a phenomenon emerging from the evolution and interactions of agents, adopting the Complex Adaptive Systems perspective. As a result, not only the types of learning present in the RIS are identified, but it is also proposed a conceptual model of collective learning for its subsequent simulation and validation. Finally, the importance of addressing the dynamics that represent behavioral patterns of collective character among RIS agents is emphasized, allowing us to differentiate appropriate policies and strategies for a better system performance. Resumen Las interacciones sistémicas de conocimiento entre los agentes heterogéneos de un sistema regional de innovación (SRI) son cruciales en la generación de conocimiento tecnológico nuevo y recombinante y su transformación en innovaciones. Desde esta perspectiva, el acceso al conocimiento externo, el aprendizaje interno y la investigación son insumos indispensables para la generación de nuevo conocimiento. El presente trabajo analiza el aprendizaje como fenómeno emergente a partir de la evolución e interacción de agentes bajo la perspectiva de los sistemas complejos adaptativos. Como resultado, no solo se identifican los tipos de aprendizaje presentes en los SRI, sino que se propone un modelo conceptual de aprendizaje colectivo para su posterior simulación y validación. Finalmente, se enfatiza la importancia de abordar las dinámicas que representan patrones de comportamiento de carácter colectivo entre los agentes de un SRI, permitiendo así diferenciar políticas y estrategias adecuadas para un mejor desempeño del sistema. Palabras clave: Sistema regional de innovación, aprendizaje colectivo, sistemas complejos adaptativos.","authors":["Santiago Quintero","Jorge Robledo Velásquez"],"meta":["October 2013","Conference: XV Congreso Latino-Iberoamericano de Gestión Tecnológica","Project: Learning in regional innovation systems: An agent-based model"],"references":["284698107_The_Geography_of_Innovation_Regional_Innovation_Systems","251730042_Innovation_by_co-evolution_in_natural_resource_industries_The_Norwegian_experience","251503520_Modeling_the_relative_efficiency_of_national_innovation_systems","237357182_The_Economy_as_an_Evolving_Complex_System_II","295672226_Innovation_Networks_-_New_Approaches_in_Modelling_and_Analysing","291812268_Le_organizzazioni_ad_alta_intensita_relazionale_Riflessioni_sui_processi_di_learning_by_interacting_nelle_aree_ad_alta_concentrazione_di_imprese","289934512_'Learning'_and_the_Accumulation_of_Industrial_Technological_Capacity_in_Developing_Countries","266652245_Personal_Knowledge_Management_and_M-learning_in_the_Learning_Society","254886709_Networks_and_network_resources_in_technological_innovation_systems_Towards_a_conceptual_framework_for_system_building","247402974_Responding_to_Hypercompetition_The_Structure_and_Processes_of_a_Regional_Learning_Network_Organization"]}