{"id":"299539344_New_Perspectives_on_the_Charging_Mechanisms_of_Supercapacitors","abstract":"Supercapacitors (or electric double-layer capacitors) are high power energy storage devices that store charge at the interface between porous carbon electrodes and an electrolyte solution. These devices are already employed in heavy electric vehicles and electronic devices, and can complement batteries in a more sustainable future. Their widespread application could be facilitated by the development of devices that can store more energy, without compromising their fast charging and discharging times. In situ characterization methods and computational modeling techniques have recently been developed to study the molecular mechanisms of charge storage, with the hope that better devices can be rationally designed. In this perspective article, we bring together recent findings from a range of experimental and computational studies to give a detailed picture of the charging mechanisms of supercapacitors. Nuclear magnetic resonance experiments and molecular dynamics simulations have revealed that the electrode pores contain a considerable number of ions in the absence of an applied charging potential. Experiments and computer simulations have shown that different charging mechanisms can then operate when a potential is applied, going beyond the traditional view of charging by counter-ion adsorption. It is shown that charging almost always involves ion exchange (swapping of co-ions for counter-ions), and rarely occurs by counter-ion adsorption alone. We introduce a charging mechanism parameter that quantifies the mechanism and allows comparisons between different systems. The mechanism is found to depend strongly on the polarization of the electrode, and the choice of the electrolyte and electrode materials. In light of these advances we identify new directions for supercapacitor research. Further experimental and computational work is needed to explain the factors that control supercapacitor charging mechanisms, and to establish the links between mechanisms and performance. Increased understanding and control of charging mechanisms should lead to new strategies for developing next generation supercapacitors with improved performances.","authors":["Alexander C. Forse","Céline Merlet","John M Griffin","Clare P Grey"],"meta":["March 2016Journal of the American Chemical Society 138(18)","DOI:10.1021/jacs.6b02115"],"references":["283951344_Pressing_a_Spring_What_Does_It_Take_to_Maximize_the_Energy_Storage_in_Nanoporous_Supercapacitors","282397653_TiC-carbide_derived_carbon_electrolyte_adsorption_study_by_ways_of_X-ray_scattering_analysis","295396349_Understanding_the_different_discharging_steps_of_supercapacitors_Influence_of_potential_and_solvation","286243250_Complementary_Effects_of_Pore_Accessibility_and_De-Coordination_on_the_Capacitance_of_Nanoporous_Carbon_Electrochemical_Supercapacitors","286220069_The_Importance_of_Ion_Packing_on_the_Dynamics_of_Ionic_Liquids_during_Micropore_Charging","285585312_Dehydration_of_Ions_in_Voltage-Gated_Carbon_Nanopores_Observed_by_in_Situ_NMR","283267742_Title_On_the_energetics_of_ions_in_carbon_and_gold_nanotubes","283181337_Toward_Low-Cost_Grid_Scale_Energy_Storage_Supercapacitors_Based_on_Up-Cycled_Industrial_Mill_Scale_Waste","282316993_New_Insights_into_the_Structure_of_Nanoporous_Carbons_from_NMR_Raman_and_Pair_Distribution_Function_Analysis","282037570_Confinement_Desolvation_And_Electrosorption_Effects_on_the_Diffusion_of_Ions_in_Nanoporous_Carbon_Electrodes"]}