{"id":"299520547_The_teachers'_role_in_developing_opening_and_nurturing_an_inclusive_STEM-focused_school","abstract":"Background\nThis study is about teachers’ collective activity during the development and initial year of a STEM-focused school in the U.S. The target school of this study was inclusive, as it sought admission of students from varying backgrounds and levels of ability. Drawing from narrative inquiry and case study methodologies, we examine the collective work of the teachers in the target school from six months prior to school start-up through the end of the first year. We focus on visioning, collaboration, and curriculum development in our analysis of the teachers’ collective work.\nResults\nWe analyze the collective sense-making activity of the teaching staff regarding key facets of the start-up process. While the teachers received a variety of supports, including time and resources for collaborating, there was a lack of specific support for the conceptualization and creation of multi-disciplinary, STEM-focused projects. The risk-taking and collaborative actions of the teachers led to three specific instructional approaches that were continuously adjusted to respond to the evolving vision of the STEM-focused school. The teachers also solicited the needs and interests of their students and utilized these in curricular design and instruction, which promoted student buy-in and participation. By the end of the school year, a common vision for STEM-focused, project-based learning was emerging, but not solidified.\nConclusions\nOur study confirms the power of doing and risk taking in teacher development, particularly in the ways in which teacher collaboration advanced curriculum and instruction in this STEM-focused school context. The intellectual supports that teachers require in this context are numerous and must be carefully identified and nurtured, and the subsequent teacher activity must be monitored as contextual shifts occur and sources of pressure (e.g., external learning standards) become relevant. The teachers’ role is a complex mixture of learner, risk-taker, inquirer, curriculum designer, negotiator, collaborator, and teacher. Instructional and curricular supports require substantial time to synthesize and eventually enact, and more than a few months prior to school start-up are necessary to fully engage and prepare teachers for the collective task of visioning, collaborating, and planning the curriculum and instruction of an innovative school.","authors":["David Slavit","Tamara D. Holmlund","Kristin Lesseig"],"meta":["March 2016International Journal of STEM Education 3(1)","DOI:10.1186/s40594-016-0040-5","Project: Leadership in STEM Education Implementation"],"references":["301915640_Modeling_Successful_STEM_High_Schools_in_the_United_States_An_Ecology_Framework","328255259_The_STEM_Initiative_Constraints_and_Challenges","320032626_Engaging_in_Narrative_Inquiry","317953561_Mind_in_society_The_development_of_higher_psychological_processes","317953505_Situated_learning_Legitimate_peripheral_participation","317953357_The_discovery_of_grounded_theory","309109591_STEM_integration_in_K-12_education_status_prospects_and_an_agenda_for_research","292518348_The_STEM_initiative_Constraints_and_challenges","286516337_Narrative_Inquiry","279941252_Seven_essentials_for_project-based_learning"]}