{"id":"299593667_The_variants_of_the_Bees_Algorithm_BA_a_survey","abstract":"The Bees Algorithm (BA) is a bee swarm intelligence-based metaheuristic algorithm that is inspired by the natural behavior of honeybees when foraging for food. BA can be divided into four parts: parameter tuning, initialization, local search, and global search. Since its invention, several studies have sought to enhance the performance of BA by improving some of its parts. Thus, more than one version of the algorithm has been proposed. However, upon searching for the basic version of BA in the literature, unclear and contradictory information can be found. By reviewing the literature and conducting some experiments on a set of standard benchmark functions, three main implementations of the algorithm that researchers should be aware of while working on improving the BA are uncovered. These implementations are Basic BA, Shrinking-based BA and Standard BA. Shrinking-based BA employs a shrinking procedure, and Standard BA uses a site abandonment approach in addition to the shrinking procedure. Thus, various implementations of the shrinking and site-abandonment procedures are explored and incorporated into BA to constitute different BA implementations. This paper proposes a framework of the main implementations of BA, including Basic BA and Standard BA, to give a clear picture of these implementations and the relationships among them. Additionally, the experiments show no significant differences among most of the shrinking implementations. Furthermore, this paper reviews the improvements to BA, which are improvements in the parameter tuning, population initialization, local search and global search. It is hoped that this paper will provide researchers who are working on improving the BA with valuable references and guidance.","authors":["Wasim Abdulqawi Hussein","Shahnorbanun Sahran","Siti Norul Huda Sheikh Abdullah"],"meta":["January 2017Artificial Intelligence Review 47(1)","DOI:10.1007/s10462-016-9476-8"],"references":["321849894_Fuzzy_Selection_of_Local_Search_Sites_in_the_Bees_Algorithm","320613434_BSA_A_Hybrid_Bees'_Simulated_Annealing_Algorithm_To_Solve_Optimization_NP-Complete_Problems","283998435_Particle_swarm_optimization_with_crossover_a_review_and_empirical_analysis","313749844_Particle_swarm_optimization","313151683_Test_functions_for_optimization_needs","312173012_MEMORY_BASED_BEES_ALGORITHM_WITH_LEVY_-FLIGHTS_FOR_MULTILEVEL_IMAGE_THRESHOLDING","303034147_A_guide_to_implementing_tabu_search","298724991_A_fast_scheme_for_multilevel_thresholding_based_on_a_modified_Bees_Algorithm","285295019_Multi-objective_optimisation_using_the_Bees_algorithm","284763990_A_survey_Algorithm_simulating_bee_swarm_intelligence"]}