{"id":"299566399_Mapping_optimization_problems_to_quantum_annealing_with_application_to_fault_diagnosis","abstract":"Current quantum annealing (QA) hardware suffers from practical limitations such as finite temperature, sparse connectivity, small qubit numbers, and control error. We propose new algorithms for mapping boolean constraint satisfaction problems (CSPs) onto QA hardware mitigating these limitations. In particular we develop a new embedding algorithm for mapping a CSP onto a hardware Ising model with a fixed sparse set of interactions, and propose two new decomposition algorithms for solving problems too large to map directly into hardware. The mapping technique is locally-structured, as hardware compatible Ising models are generated for each problem constraint, and variables appearing in different constraints are chained together using ferromagnetic couplings. In contrast, global embedding techniques generate a hardware independent Ising model for all the constraints, and then use a minor-embedding algorithm to generate a hardware compatible Ising model. We give an example of a class of CSPs for which the scaling performance of D-Wave's QA hardware using the local mapping technique is significantly better than global embedding. We validate the approach by applying D-Wave's hardware to circuit-based fault-diagnosis. For circuits that embed directly, we find that the hardware is typically able to find all solutions from a min-fault diagnosis set of size N using 1000N samples, using an annealing rate that is 25 times faster than a leading SAT-based sampling method. Further, we apply decomposition algorithms to find min-cardinality faults for circuits that are up to 5 times larger than can be solved directly on current hardware.","authors":["Zhengbing Bian","Fabián A. Chudak","Robert Israel","Brad Lackey"],"meta":["April 2016Frontiers in Physics 3","DOI:10.3389/fict.2016.00014"],"references":["303812168_Global_Warming_Temperature_Estimation_in_Annealers","283335820_Estimation_of_effective_temperatures_in_a_quantum_annealer_and_its_impact_in_sampling_applications_A_case_study_towards_deep_learning_applications","306029593_Estimation_of_effective_temperatures_in_quantum_annealers_for_sampling_applications_A_case_study_with_possible_applications_in_deep_learning","300349133_Constructing_SAT_Filters_with_a_Quantum_Annealer","299341370_Formalized_Quantum_Model_for_Solving_the_Eigenfunctions","287469368_Maximum_satisfiability_using_core-guided_MaxSAT_resolution","286554082_A_Novel_SAT-Based_Approach_to_Model_Based_Diagnosis","283556226_Simulation_of_quantum_algorithms_for_classification_of_their_complexity","283556012_Algebraic_models_of_transitions_between_mixed_entangled_states_and_specific_eigenvalues_of_systems_with_two_or_three_levels","282685388_Analysis_of_the_complexity_of_the_formalized_circuits_of_Raychev"]}