{"id":"299547210_Factores_asociados_al_rendimiento_en_las_Pruebas_Saber_Pro_en_estudiantes_de_Ingenieria_Civil_en_universidades_colombianas","abstract":"p>Introducción: Las pruebas académicas Saber Pro son de carácter oficial y obligatoriamente forman parte con otros procesos y acciones, de un conjunto de instrumentos que el Gobierno Nacional de Colombia dispone para evaluar la calidad del servicio educativo del sector oficial y privado; también son utilizadas como fuente de selección para convocatorias en becas de posgrado y/o selección de personal en distintas empresas. Materiales y Métodos: En este proyecto se analizaron los resultados de la pruebas Saber Pro 2010 de los estudiantes de últimos semestres de Ingeniería Civil a nivel nacional para determinar los factores que influyen en los puntajes obtenidos. Se estudiaron diferentes variables, cualitativas como cuantitativas, asociadas al puntaje obtenido mediante métodos estadísticos como las tablas de contingencia y el análisis de correspondencia simple y múltiple. Resultados y Discusión: La prueba Ji-cuadrado respalda la independencia de las variables trabaja (p=0,858) y título (p=0,433) en asociación con la variable puntaje, señalando que ni el título de bachiller obtenido por el estudiante, ni si el individuo trabaja o no, tienen relación con los resultados que obtiene en la pruebas. Por el contrario para las variables género (p=0,000), tipo (p=0,000), educación padre (p=0,000), educación madre (p=0,000) y estrato (p=0,000), se concluye que sí juegan algún papel en los resultados. Conclusiones: El análisis de correspondencias para los estudiantes permite concluir que los puntajes superiores a la media se asocian con estudiantes del género masculino, que estudian Ingeniería Civil en instituciones públicas, tienen padres con estudios universitarios y viven en los estratos sociales 4, 5 ó 6. Por otro lado es importante formular nuevos estudios donde se analicen otras variables que puedan explicar los resultados y la implementación de otros modelos estadísticos como: el análisis por discriminantes, análisis por componentes principales y análisis por regresión logística.\n\n</p","authors":["Wolfang Alexander Osma Castellanos","Adrian Mojica","Tulia Esther Rivera"],"meta":["December 2014Innovaciencia 2(1):22","DOI:10.15649/2346075X.234"],"references":["40944325_Analisis_de_Datos_Multivariantes"]}