{"id":"299585125_Flipped_Learning_en_la_formacion_del_profesorado_de_secundaria_y_bachillerato_Formacion_para_el_cambio","abstract":"El modelo Flipped Learning está ofreciendo resultados positivos en su aplicación. Existen algunas investigaciones empíricas sobre los resultados que el modelo ofrece en la mejora de la motivación o el rendimiento de estudiantes. Su implantación, permite la incorporación de metodologías activas, consiguiendo hacer más extensivo los modelos centrados en el aprendizaje y en el desarrollo de competencias. Sin embargo, el desconocimiento y la falta de tiempo hacen que el profesorado continúe utilizando en el aula métodos tradicionales. Por ello, la formación inicial del profesorado se convierte en un instrumento esencial para el cambio, ofreciendo al profesor mayor seguridad y conocimiento. El objetivo de este artículo es evaluar cuantitativa y cualitativamente la implantación del modelo flipped en la asignatura “Aprendizaje y desarrollo de la personalidad” del Máster de Formación del Profesorado de Secundaria y Bachillerato. Analizamos los resultados académicos y la percepción que el alumnado ha tenido sobre el modelo, tanto en su aprendizaje como en su utilidad como futuros docentes. La recogida de información se ha realizado tras cada tarea de evaluación, el ejercicio final, y las respuestas de los estudiantes a un cuestionario. Los resultados coinciden con otras investigaciones llevadas a cabo y presentadas en este documento.","authors":["Deborah Martin R.","Raúl Santiago Campión"],"meta":["February 2016Contextos Educativos Revista de Educación","DOI:10.18172/con.2854","Project: flipped classroom. competencia digital docente."],"references":["299584811_Metodologias_Inductivas_El_desafio_de_ensenar_mediante_el_cuestionamiento_y_los_retos","259326029_El_aula_inversa_cambiando_la_respuesta_a_las_necesidades_de_los_estudiantes","242705214_Assessment_and_Teaching_of_21st_Century_Skills","224088630_Flipping_the_Work_Design_in_an_industrial_engineering_course","31853145_Ensenar_en_la_universidad_el_EEES_como_reto_para_la_educacion_superior_J_Rue","28109757_La_evaluacion_de_competencias_complejas_la_practica_del_portafolio"]}