{"id":"299572828_The_Cambridge_Structural_Database","abstract":"The Cambridge Structural Database (CSD) contains a complete record of all published organic and metal–organic small-molecule crystal structures. The database has been in operation for over 50 years and continues to be the primary means of sharing structural chemistry data and knowledge across disciplines. As well as structures that are made public to support scientific articles, it includes many structures published directly as CSD Communications. All structures are processed both computationally and by expert structural chemistry editors prior to entering the database. A key component of this processing is the reliable association of the chemical identity of the structure studied with the experimental data. This important step helps ensure that data is widely discoverable and readily reusable. Content is further enriched through selective inclusion of additional experimental data. Entries are available to anyone through free CSD community web services. Linking services developed and maintained by the CCDC, combined with the use of standard identifiers, facilitate discovery from other resources. Data can also be accessed through CCDC and third party software applications and through an application programming interface.","authors":["Colin R. Groom","Ian J Bruno","Matthew P. Lightfoot","Suzanna C. Ward"],"meta":["April 2016Acta Crystallographica Section B: Structural Science 72(2):171-179","DOI:10.1107/S2052520616003954"],"references":["319514261_Molecular_Complexes","305445023_Post-Disaster_Supply_Chain_Interdependent_Critical_Infrastructure_System_Restoration_A_Review_of_Data_Necessary_and_Available_for_Modeling","284921199_On_Bridging_Data_Centers_and_Publishers_The_Data-Literature_Interlinking_Service","277979228_The_IUPAC_International_Chemical_Identifier","273350698_Three-dimensional_electron_diffraction_as_a_complementary_technique_to_powder_X-ray_diffraction_for_phase_identification_and_structure_solution_of_powders","270598079_Crystal_structure_refinement_with_SHELXL","288021202_Specification_of_the_Crystallographic_Information_File_format_version_20","285396354_Molecular_Structure_and_Coordinate_Systems","279067900_Outcome_of_the_First_wwPDB_HybridIntegrative_Methods_Task_Force_Workshop","270903100_The_Protein_Data_Bank"]}