{"id":"299648847_ACE-BOC_Dual-frequency_Constant_Envelope_Multiplexing_for_Satellite_Navigation","abstract":"In the signal design of new generation global navigation satellite systems, there is a strong demand for multiplexing multiple binary spreading signals on two adjacent frequencies into an integrated signal with a constant envelope. In this paper, a dual-frequency constant envelope multiplexing (DCEM) technique with high-design flexibility based on subcarrier waveform reconstruction, named asymmetric constant envelope binary offset carrier (ACE-BOC), is presented. This multiplexing technique can be seen as a generalized alternate BOC. It can combine four or fewer independent, bipolar, direct sequence spread spectrum signals onto two sidebands of a spectrum-split integrated signal, where each sideband consists of two or fewer signals with arbitrary power ratio modulated onto the quadrature components. The design principle, diversified generation methods of ACE-BOC signals, as well as the characteristics in both time and frequency domains are investigated. Multiplexing efficiency and receiving performance of this signal are also analyzed. Analysis with typical examples shows that, for both transmitters and receivers, ACE-BOC signals have multiple processing forms. Compared with existing DCEM methods, ACE-BOC has much higher design flexibility in the number of signal components, power ratio among components, hardware complexity of both transmitters and receivers, and spectrum compatibility. Such high-level design flexibility provides system designers great room in signal scheme optimization for varied navigation applications in the future.","authors":["Zheng Yao","Jiayi Zhang","Minguan Lu"],"meta":["February 2016IEEE Transactions on Aerospace and Electronic Systems 52(1):466-485","DOI:10.1109/TAES.2015.140607","Projects: New Generation GNSS Signal DesignDual-frequency Modulation and Multiplexing Joint Design Method for GNSS SignalsGNSS signal design"],"references":["308934968_Orthogonality-based_Constant_Envelope_Multiplexing","297275220_Time-Multiplexed_Offset-Carrier_QPSK_for_GNSS","280037483_AltBOC_for_Dummies_or_Everything_You_Always_Wanted_to_Know_About_AltBOC","278746259_Interplex_modulation_for_navigation_systems_at_the_L1_band","278662182_ACED_Multiplexing_and_Its_Application_on_BeiDou_B2_Band","266139450_Constant_envelope_combination_for_components_on_different_carrier_frequencies_with_unequal_power_allocation","266139383_Comparative_analysis_of_dual-frequency_constant_envelop_multiplexing_techniques_for_ARNS_band","266139382_Applications_and_low-complex_implementations_of_ACE-BOC_multiplexing","266139369_Design_Implementation_and_Performance_Analysis_of_ACE-BOC_Modulation","299718284_Analysis_for_Cross_Correlation_in_Multiplexing"]}