{"id":"299680544_Context-Based_Development_of_Experience_Bases","abstract":"The experience of experts relies on the process of decision-making jointly with the progressive elaboration of a context-specific model. However, context modeling generally stays implicit because only the result of the decision-making process matters. Modeling context within a decision-making process supposes a uniform representation of knowledge, reasoning and contexts. In the Contextual-Graphs formalism, a decision-making episode is represented as a contextual graph where each path represents a practice developed by actors for making this decision in a specific working context. By incremental accumulation of the practices developed by experts, a contextual graph becomes an experience base with the decision-making process. Such an experience base may be used by humans for training future experts how to behave in the different ways to make a decision according to the variants of the working context. An intelligent assistant system exploiting such an experience base will be able to propose a more effective support to users than previous knowledge-based systems. This work is realized in the framework of a project in medicine for supporting experts in breast cancer diagnosis.","authors":["Patrick Brézillon"],"meta":["October 2013","DOI:10.1007/978-3-642-40972-1_7","Conference: International and Interdisciplinary Conference on Modeling and Using Context"],"references":["287554761_A_Context-Centered_Architecture_for_Intelligent_Assistant_Systems","265538787_Explaining_for_Contextualizing_and_Contextualizing_for_Explaining","230758376_Context_Modeling_Context_as_a_Dressing_of_a_Focus","221032416_Context_Modeling_Task_Model_and_Practice_Model","281660342_Logique_du_fonctionnement_et_logique_de_l'utilisation","259512027_Modelisation_informatisee_des_etapes_d'un_examen_anatomocytopathologique_graphes_contextuels","245981783_Dynamic_Memory_A_Theory_of_Learning_in_Computers_and_People","225070260_Cooperative_problem_solving_and_explanation","222820869_From_case-based_reasoning_to_traces-based_reasoning","222398592_Simulating_activities_Relating_motives_deliberation_and_attentive_coordination"]}