{"id":"299656049_Ecological_and_evolutionary_influences_on_body_size_and_shape_in_the_Galapagos_marine_iguana_Amblyrhynchus_cristatus","abstract":"Oceanic islands are often inhabited by endemic species that have undergone substantial morphological evolutionary change due to processes of multiple colonizations from various source populations, dispersal, and local adaptation. Galápagos marine iguanas are an example of an island endemic exhibiting high morphological diversity, including substantial body size variation among populations and sexes, but the causes and magnitude of this variation are not well understood. We obtained morphological measurements from marine iguanas throughout their distribution range. These data were combined with genetic and local environmental data from each population to investigate the effects of evolutionary history and environmental conditions on body size and shape variation and sexual dimorphism. Our results indicate that body size and shape are highly variable among populations. Sea surface temperature and island perimeter, but not evolutionary history as depicted by phylogeographic patterns in this species, explain variation in body size among populations. Conversely, evolutionary history, but not environmental parameters or island size, was found to influence variation in body shape among populations. Finally, in all populations except one, we found strong sexual dimorphism in body size and shape in which males are larger, with higher heads than females, while females have longer heads than males. Differences among populations suggest that plasticity and/or genetic adaptation may shape body size and shape variation in marine iguanas. This study will help target future investigations to address the contribution of plasticity versus genetic adaptation on size and shape variation in marine iguanas.","authors":["Ylenia Chiari","Scott Glaberman","P. Tarroso","Adalgisa Caccone"],"meta":["July 2016Oecologia 181(3)","DOI:10.1007/s00442-016-3618-1"],"references":["317333860_BODY_SIZE_AND_SEXUAL_SIZE_DIMORPHISM_IN_MARINE_IGUANAS_FLUCTUATE_AS_A_RESULT_OF_OPPOSING_NATURAL_AND_SEXUAL_SELECTION_AN_ISLAND_COMPARISON","277780935_Hybridization_masks_speciation_in_the_evolutionary_history_of_the_Galapagos_marine_iguana","274334603_Sex_Identification_through_Cloacal_Probing_in_Juvenile_Marine_Iguanas_Amblyrhynchus_cristatus","318393770_R_A_Language_and_Environment_for_Statistical_Computing","312104746_The_Temperature-Size_Rule_in_Ectotherms_May_a_General_Explanation_Exist_after_All","309456818_The_challenge_of_island_faunas","288700927_The_relevance_of_morphology_for_habitat_use_and_locomotion_in_two_species_of_wall_lizards","285591922_Exploring_the_combined_role_of_eustasy_and_oceanic_island_subsidence_in_shaping_biodiversity_on_the_Galapagos","279573929_Size_temperature_and_fitness_Three_rules","274015857_Team_RDCR_A_Language_And_Environment_For_Statistical_Computing_R_Foundation_for_Statistical_Computing_Vienna_Austria"]}