{"id":"299648721_Motivational_Strategies_and_EFL_Teachers'_Perceptions_A_Saudi_Survey","abstract":"The present study is only the second one of this kind in the Saudi context. As a first stage of the study, 117 EFL teachers with varying demographic characteristics (age, qualifications, teaching experience and the like) rated 55 motivational micro strategies on 5-point scales, which were then grouped into 10 macro strategies in accordance with previous research. Since the present study is a modified replication of previous studies, the expectation that the ranking of strategies in the Saudi context will match to a degree the rankings found by researchers elsewhere in the world was borne out - four of the macro strategies that came out in the top five scales in this study were ranked in the top five scales in three other studies conducted by Dörnyei and Csizér (1998) in Hungary, Cheng and Dörnyei (2007) in Taiwan, and Alrabai (2010) in Saudi Arabia. The order in which the macro strategies were ranked in the present research differed from the ranking order found previously, including Alrabai’s (2010) in the Saudi context. Unlike in any previous research, however, when inferential statistical analyses were applied on the collected data, statistically significant differences in the ranking order of the macro strategies emerged as a function of the respondents’ qualifications and length of teaching experience. The results may have implications for teacher training and the research design of future investigations into the effects of the motivational strategies deployed by teachers on student motivation and FL achievement.","authors":["Saleh Alqahtani"],"meta":["April 2016Theory and Practice in Language Studies 6(4):663","DOI:10.17507/tpls.0604.02"],"references":["335310685_The_Future_of_Teaching_English_in_Saudi_Arabia","346643592_Group_Dynamics_in_the_Language_Classroom","344904097_Motivational_Strategies_in_the_Language_Classroom","324594510_First_Language_Use_in_Second_and_Foreign_Language_Learning","287302097_Motivating_students_to_learn_Third_edition","286208871_Motivation_in_second_language_learning","286048168_Psychology_for_Language_Teachers","285207303_The_psychology_of_the_language_learner_Individual_differences_in_second_language_acquisition","274830707_Attitudes_and_Motivation_in_Second-Language_Learning","263588307_Language_Learning_Motivation_Expanding_The_Theoretical_Framework"]}