{"id":"299612436_An_Overview_of_Melanoma_Detection_in_Dermoscopy_Images_Using_Image_Processing_and_Machine_Learning","abstract":"The incidence of malignant melanoma continues to increase worldwide. This cancer can strike at any age; it is one of the leading causes of loss of life in young persons. Since this cancer is visible on the skin, it is potentially detectable at a very early stage when it is curable. New developments have converged to make fully automatic early melanoma detection a real possibility. First, the advent of dermoscopy has enabled a dramatic boost in clinical diagnostic ability to the point that melanoma can be detected in the clinic at the very earliest stages. The global adoption of this technology has allowed accumulation of large collections of dermoscopy images of melanomas and benign lesions validated by histopathology. The development of advanced technologies in the areas of image processing and machine learning have given us the ability to allow distinction of malignant melanoma from the many benign mimics that require no biopsy. These new technologies should allow not only earlier detection of melanoma, but also reduction of the large number of needless and costly biopsy procedures. Although some of the new systems reported for these technologies have shown promise in preliminary trials, widespread implementation must await further technical progress in accuracy and reproducibility. In this paper, we provide an overview of computerized detection of melanoma in dermoscopy images. First, we discuss the various aspects of lesion segmentation. Then, we provide a brief overview of clinical feature segmentation. Finally, we discuss the classification stage where machine learning algorithms are applied to the attributes generated from the segmented features to predict the existence of melanoma.","authors":["Nabin Kumar Mishra","M. Emre Celebi"],"meta":["January 2016","Project: ISBI Challenge: Skin Lesion Analysis Toward Melanoma Detection"],"references":["300467916_PH2_A_Public_Database_for_the_Analysis_of_Dermoscopic_Images","300467789_Accurate_and_Scalable_System_for_Automatic_Detection_of_Malignant_Melanoma","301107819_Computerised_Diagnosis_of_Skin_Cancer_Using_Neural_Networks","300467948_Global_Pattern_Classification_in_Dermoscopic_Images","300467947_A_Bioinspired_Color_Representation_for_Dermoscopy_Image_Analysis","300467946_Comparison_of_Image_Processing_Techniques_for_Reticular_Pattern_Recognition_in_Melanoma_Detection","300467859_Where's_the_Lesion_Variability_in_Human_and_Automated_Segmentation_of_Dermoscopy_Images_of_Melanocytic_Skin_Lesions","284755010_Improved_Skin_Lesion_Diagnostics_for_General_Practice_by_Computer-Aided_Diagnostics","283324066_Application-Driven_No-Reference_Quality_Assessment_for_Dermoscopy_Images_With_Multiple_Distortions","283167914_An_ensemble_classification_approach_for_melanoma_diagnosis"]}