{"id":"29974300_Agregation_et_routage_de_trafic_dans_les_reseaux_WDM_multi-couches","abstract":"High-performance transport networks are expected to support applications with various types of traffic, e.g., permanent, scheduled, bursty, and noisy traffic flows. Since high-performance networks usually employ optical network infrastructures, and since most applications require sub-wavelength bandwidth, several streams are usually groomed on the same wavelength. It is therefore important that such networks are designed in an optimal way in terms of cost while efficiently supporting these types of traffic. This thesis deals with the design and analysis of optical networks allowing for traffic engineering including grooming and rerouting functionalities. Both deterministic and random traffic scenarios are considered. As a first step, optimal as well as accurate heuristic approaches are developed for network design and operation under deterministic traffic conditions. As a second step, under random traffic conditions, the dynamic routing and grooming problem is considered subject to the availability of free network resources. Several algorithms are developed to facilitate this provisioning problem. At last, rerouting techniques are addressed. We investigate different rerouting strategies and their implementation in order to enhance network efficiency under specific traffic scenarios. Part I Introduction 1 Introduction 1.1 Introduction 1.2 Traffic Grooming 1.3 Reconfiguration Techniques 1.3.1 Logical Topology Reconfiguration 1.3.2 Rerouting 1.4 Motivation 1.5 Thesis Overview 2 Operator’s Network Evolution 2.1 Introduction 2.2 Multi-layer Recovery Approaches 2.2.1 Single-layer Recovery Schemes in Multi-layer Networks 2.2.2 Static Multi-layer Recovery Scheme 2.2.3 Dynamic Multi-layer Recovery Scheme 2.3 Quality of Transmission Aware Networks 2.3.1 Effects of Transmission Impairments on RWA 2.3.2 All-optical Impairment-Aware Routing 2.3.3 Translucent Network Design Part II Traffic Grooming and Rerouting in Multi-layer WDM Network 3 Backbone Traffic Characterization 3.1 Introduction 3.2 Background 3.3 Data Measurement and Analysis 3.4 Traffic Modeling 3.4.1 Scheduled Demands (SxDs) 3.4.2 Random and semi-Random Demands (RxDs/sRxDs) 3.5 Traffic Metrics 3.6 Traffic Sets 4 Nodal Architecture 4.1 Overview 4.2 Node Architecture 4.2.1 Optical Nodes 4.2.2 Electrical Nodes 4.2.3 Wavelength Converters 4.2.4 Signaling Protocol 4.3 Adopted Node Architecture 4.4 Auxiliary Graph Model 5 Routing and Grooming of Scheduled Demands (SxD) 5.1 Introduction 5.2 Grooming 5.3 Description of the Problem 5.4 Mathematical Formulation 5.4.1 Network Cost Computation in the Case of SLDs 5.4.2 Network Cost Computation in the Case of SEDs 5.4.3 Resource Sharing between SLDs and SEDs 5.4.4 Lower Bound on the Network Cost in the Case of SEDs 5.5 The Linear Programming Approach 5.5.1 Mathematical ILP Formulation of the SLDs’ Routing Problem assuming K-shortest Path Pre-computation 5.5.2 General Mathematical ILP Formulation of the SLDs’ Routing Problem 5.5.3 Mathematical ILP Formulation of the SEDs’ Routing and Grooming Problem assuming K-shortest Path Pre-computation 5.6 The Heuristic Approach 5.6.1 Simulated Annealing Algorithm for SLD and SED Routing 5.6.2 Iterative Greedy Algorithm for SED Grooming 5.7 Simulation Results and Analysis 5.7.1 SLD Routing: ILP vs SA 5.7.2 SLD Routing under Limited Number of Wavelengths per Fiber: ILP vs SA 5.7.3 SED Routing: ILP vs SA 5.7.4 SED Grooming: Various Approaches 5.7.5 Resource Sharing between SLDs and SEDs 5.7.6 Evolution over Time of the Heuristic Approaches 5.7.7 Impact of the SED Routing Solution on the Grooming Procedure 5.7.8 Impact of the Size of the T_list (Parameters: L1 and L2) on the IG Algorithm 5.7.9 Impact of the Number of Iterations (Parameter: N1) on the IG Algorithm 6 Routing and Grooming of Random Demands (sRxD/RxD) 6.1 Network Over-dimensioning 6.2 Traffic Engineering 6.3 Weight Assignment in the Case of sRLDs 6.3.1 Weight Assigned to ‘a’ and ‘d’ edges 6.3.2 Weight Assigned to ‘b’ and ‘e’ edges 6.3.3 Weight Assigned to ‘c’ and ‘f ’ edges 6.3.4 Weight Assigned to ‘g’ and ‘h’ edges 6.3.5 Weight Assigned to ‘o’ edges 6.3.6 Weight Assigned to ‘i’ edges 6.4 Weight Assignment in the Case of sREDs 6.4.1 Weight Assigned to ‘a’ and ‘d’ edges 6.4.2 Weight Assigned to ‘b’ and ‘e’ edges 6.4.3 Weight Assigned to ‘c’ and ‘f ’ edges 6.4.4 Weight Assigned to ‘g’ and ‘h’ edges 6.4.5 Weight Assigned to ‘o’ edges 6.4.6 Weight Assigned to ‘i’ edges 6.5 Weight Assignment in the Case of RLDs 6.6 Weight Assignment in the Case of REDs 6.7 Additional Issues 6.8 Simulation Results and Analysis 6.8.1 Network Dimensioning using the Dijkstra Algorithm 6.8.2 Traffic Engineering using the Dijkstra Algorithm 7 Rerouting Strategies 7.1 Path Adjusting Rerouting (PAR) Algorithm 7.1.1 Traditional Rerouting Algorithm 7.1.2 Extension to the Unidirectional Case 7.1.3 Extension to the Path Adjusting Case 7.1.4 The Resulting Path Adjusting Rerouting (PAR) Algorithm 7.2 Time Limited Resource Reservation (TLRR) Algorithm 7.2.1 Motivation 7.2.2 Principle 7.2.3 Additional Issues 7.3 Simulation Results and Analysis 7.3.1 Performance of the PAR Algorithm 7.3.2 Performance of the TLRR Algorith 8 Conclusions Part III End Matter A Grids and Grid Networks A.1 General Attributes of Grid Networks A.1.1 Abstraction and Virtualization A.1.2 Resource Sharing A.1.3 Programmability and Flexibility A.1.4 Scalability A.2 Types of Grids A.3 A Large-scale Grid Solution for Biological and Physical Cross-Site Simulations B Network Coding B.1 Origin of Network Coding B.2 Two Restricted Problems B.2.1 Multicast Problem B.2.2 k-Pairs Communication Problem B.3 From Information Theory to Network Coding B.3.1 Information Theory B.3.2 Steiner Tree Packing B.3.3 Multicommodity Flow C Radio Over Fiber Technology C.1 Advantages of ROF Systems C.1.1 Low Attenuation Loss C.1.2 Large Bandwidth C.1.3 Easy Installation and Maintenance C.1.4 Reduced Power Consumption C.2 Application of Radio Over Fiber Technology C.2.1 Mobile Communications C.2.2 Mobile Broadband Systems C.2.3 Wireless Local Area Networks","authors":["Elias Doumith"],"meta":["January 2007"],"references":["224628221_Network_Nodes_Dimensioning_assuming_Electrical_Traffic_Grooming_in_an_Hybrid_OXCEXC_WDM_Network","221286475_Traffic_Routing_in_a_Multi-Layer_Optical_Network_Considering_Rerouting_and_Grooming_Strategies","4240858_From_Network_Planning_to_Traffic_Engineering_for_Optical_VPN_and_Multi-Granular_Random_Demands","4182221_Traffic_engineering_for_virtual_private_networks_and_random_traffic_demands_in_WDM_optical_core_networks"]}