{"id":"299752611_Topological_design_of_telecommunication_networks_Nodes_and_links_localization_under_demand_constraints","abstract":"The paper addresses the classical network optimization problem consisting in realizing the assumed set of demands in a given network with a given list of potential nodes' and links' locations and with the objective function reflecting the cost of the actual links' capacities as well as the fixed cost of installing nodes and links. We assume that the network nodes are composed of two disjoint sets: the set of access nodes and the set of transit nodes. The access (end) nodes only generate demands and do not transit the end-to-end flows realizing the demands while the transit nodes do not generate demands and do transit the end-to-end flows. The selection of the actually installed transit nodes and of the links interconnecting all the network nodes is the major subject of optimization. Although similar problems have been considered in the past, also in the context of the road traffic, it is the authors' conviction that there is still a lot of room for improvement as far as solution methods are concerned. In the paper we overview the existing problem formulations and solution methods. We also propose our own approaches, based both on original ideas and on improvements of the existing ones. The effectiveness of the solutions is illustrated by means of a numerical study.","authors":["Michal Pioro","Alpár Jüttner","János Harmatos","Aron Szentesi"],"meta":["December 2001","DOI:10.1016/S1388-3437(01)80157-8"],"references":["242356629_A_Dual-Based_Procedure_for_Uncapacitated_Facility_Location","227970811_Network_synthesis_and_optimum_network_design_problems_Model_solution_methods_and_applications","227701752_The_Complexity_of_the_Network_Design_Problem","227443937_A_Computational_Approach_To_the_Selection_of_An_Optimal_Network","220145229_Solving_multicommodity_integral_flow_problems_by_simulated_allocation","23540147_Optimal_Network_Problem_A_Branch-and-Bound_Algorithm","4939388_Solving_Capacitated_Clustering_Problems","3872368_Planning_of_tree-topology_UMTS_terrestrial_access_networks"]}