{"id":"299868616_Tracing_Software_Developers'_Eyes_and_Interactions_for_Change_Tasks","abstract":"What are software developers doing during a change task? While an answer to this question opens countless opportunities to support developers in their work, only little is known about developers' detailed navigation behavior for realistic change tasks. Most empirical studies on developers performing change tasks are limited to very small code snippets or are limited by the granularity or the detail of the data collected for the study. In our research, we try to overcome these limitations by combining user interaction monitoring with very fine granular eye-tracking data that is automatically linked to the underlying source code entities in the IDE. In a study with 12 professional and 10 student developers working on three change tasks from an open source system, we used our approach to investigate the detailed navigation of developers for realistic change tasks. The results of our study show, amongst others, that the eye tracking data does indeed capture different aspects than user interaction data and that developers focus on only small parts of methods that are often related by data flow. We discuss our findings and their implications for better developer tool support.","authors":["Katja Kevic","Braden M. Walters","Timothy R. Shaffer","Bonita Sharif"],"meta":["August 2015","DOI:10.1145/2786805.2786864","Conference: the 2015 10th Joint Meeting"],"references":["299909485_iTrace_enabling_eye_tracking_on_software_artifacts_within_the_IDE_to_support_software_engineering_tasks","278747629_Stuck_and_Frustrated_or_In_Flow_and_Happy_Sensing_Developers'_Emotions_and_Progress","266657780_Capturing_software_traceability_links_from_developers'_eye_gazes","266656196_Understanding_understanding_source_code_with_functional_magnetic_resonance_imaging","308843715_A_Field_Study_on_Fostering_Structural_Navigation_with_Prodet","283684725_ECLIPSE","278747531_Interruptibility_of_Software_Developers_and_its_Prediction_Using_Psycho-Physiological_Sensors","278747524_Developers'_code_context_models_for_change_tasks","266657931_Mining_StackOverflow_to_turn_the_IDE_into_a_self-confident_programming_prompter","266656268_Using_psycho-physiological_measures_to_assess_task_difficulty_in_software_development"]}