{"id":"299864598_Concept_Hierarchy_Extraction_from_Textbooks","abstract":"Concept hierarchies have been useful tools for presenting and organizing knowledge. With the rapid growth in the number of online knowledge resources, automatic concept hierarchy extraction is increasingly attractive. Here, we focus on concept extraction from textbooks based on the knowledge in Wikipedia. Given a book, we extract important concepts in each book chapter using Wikipedia as a resource and from this construct a concept hierarchy for that book. We define local and global features that capture both the local relatedness and global coherence embedded in that textbook. In order to evaluate the proposed features and extracted concept hierarchies, we manually construct concept hierarchies for three well used textbooks by labeling important concepts for each book chapter. Experiments show that our proposed local and global features achieve better performance than using only keyphrases to construct the concept hierarchies. Moreover, we observe that incorporating global features can improve the concept ranking precision and reaffirms the global coherence in the book.","authors":["Shuting Wang","C. Lee Giles","Chen Liang","Zhaohui Wu"],"meta":["September 2015","DOI:10.1145/2682571.2797062","Conference: the 2015 ACM Symposium"],"references":["263545266_Encouraging_Knowledge_Sharing_Using_Web_20_Technologies_In_Higher_Education_A_Survey","299864597_BBookX","287953553_SimSeerX_A_similar_document_search_engine","282922106_Generating_reading_orders_over_document_collections","281907841_Concept_Graph_Learning_from_Educational_Data","262326604_Can_back-of-the-book_indexes_be_automatically_created","261346732_Table_of_Contents_Recognition_and_Extraction_for_Heterogeneous_Book_Documents","260326814_Automatic_Ontology-Based_Knowledge_Extraction_from_Web_Documents","260325044_Automatic_Generation_of_the_Domain_Module_from_Electronic_Textbooks_Method_and_Validation","258138650_Conceptual_Graph_Analysis_Knowledge_Acquisition_for_Instructional_System_Design"]}