{"id":"299909728_GR1_synthesis_for_LTL_specification_patterns","abstract":"Reactive synthesis is an automated procedure to obtain a correct-by-construction reactive system from its temporal logic specification. Two of the main challenges in bringing reactive synthesis to software engineering practice are its very high worst-case complexity -- for linear temporal logic (LTL) it is double exponential in the length of the formula, and the difficulty of writing declarative specifications using basic LTL operators. To address the first challenge, Piterman et al. have suggested the General Reactivity of Rank 1 (GR(1)) fragment of LTL, which has an efficient polynomial time symbolic synthesis algorithm. To address the second challenge, Dwyer et al. have identified 55 LTL specification patterns, which are common in industrial specifications and make writing specifications easier. In this work we show that almost all of the 55 LTL specification patterns identified by Dwyer et al. can be expressed as assumptions and guarantees in the GR(1) fragment of LTL. Specifically, we present an automated, sound and complete translation of the patterns to the GR(1) form, which effectively results in an efficient reactive synthesis procedure for any specification that is written using the patterns. We have validated the correctness of the catalog of GR(1) templates we have created. The work is implemented in our reactive synthesis environment. It provides positive, promising evidence, for the potential feasibility of using reactive synthesis in practice.","authors":["Shahar Maoz","Jan Oliver Ringert"],"meta":["August 2015","DOI:10.1145/2786805.2786824","Conference: ESEC/SIGSOFT FSE 2015"],"references":["292694074_Synthesizing_a_Lego_Forklift_Controller_in_GR1_A_Case_Study","275280118_Permissive_Controller_Synthesis_for_Probabilistic_Systems","325252650_Automata_Theory_and_Model_Checking","313053394_PROPEL_An_approach_supporting_property_elucidation","285607353_Assume-Guarantee_Scenarios_Semantics_and_Synthesis","272414613_Aligning_Qualitative_Real-Time_and_Probabilistic_Property_Specification_Patterns_Using_a_Structured_English_Grammar","269198960_Real-time_specification_patterns","268522988_OCLR_A_More_Expressive_Pattern-Based_Temporal_Extension_of_OCL","262296599_Acacia_a_tool_for_LTL_synthesis","262212194_Synthesizing_nonanomalous_event-based_controllers_for_liveness_goals"]}