{"id":"300037085_Toward_a_Policy_of_Destruction_Buffaloes_Law_and_the_Market_1803-83","abstract":"When the United States purchased the Louisiana Territory from France in 1803, it acquired an abundance of natural resources that would help fuel American economic expansion for the rest of the nineteenth century. The fertile soil of the tallgrass prairie would support one of the most productive agricultural regimes in the United States. Lumberers would cut longleaf, shortleaf, loblolly, and slash pine from the west bank of the Mississippi River between New Orleans and St. Louis. Miners would discover deposits of gold and lead in Colorado, Montana, and South Dakota.1 Yet the most prominent resource of the Louisiana Territory in the nineteenth century was located in the semiarid shortgrass Plains west of the hundredth meridian. The 30 million buffaloes found on the High Plains in 1803 would prompt one western historian to call the acquisition of the Louisiana Territory, \"the single largest purchase of livestock in history. \"2 Yet eighty years after the Louisiana Purchase, the bison of the Great Plains had been nearly eliminated.","authors":["Andrew Isenberg"],"meta":["January 1992"],"references":["324293119_The_Elusive_Republic_Political_Economy_in_Jeffersonian_America","284956815_An_Overview_of_American_Land_Policy","275707583_The_Great_Buffalo_Hunt","274905295_The_Winning_of_the_West_The_Expansion_of_the_Western_Sioux_in_the_Eighteenth_and_Nineteenth_Centuries","272920081_Ecology_and_Cultural_Continuity_as_Contributing_Factors_in_the_Social_Organization_of_the_Plains_Indians","271242153_The_Cheyenne_in_Plains_Indian_Trade_Relations_1795-1840","269879279_The_Life_and_Letters_of_Washington_Allston","50323967_On_the_Origin_of_Species_by_Means_of_Natural_Selection_or_the_Preservation_of_Favoured_Races_in_the_Struggle_for_Life","36101008_The_effects_of_white_contact_upon_Blackfoot_culture_with_special_reference_to_the_role_of_the_fur_trade","11721755_the_Influence_of_Epidemics_on_the_Indian_Populations_and_Cultures_of_Texas"]}