{"id":"300079868_The_Shoulder_Surfing_Resistant_Graphical_Password_Authentication_Technique","abstract":"Nowadays computer as well as information security is the most significant challenge. Authorized users should access the system or information. Authorization can’t occur without authentication. For this authentication various techniques are available. Among them the most popular and easy is the password technique. Password ensures that computer or information can be accessed by those who have been granted right to view or access them. Traditional password technique is a textual password which is also called alphanumeric password. But these textual passwords are easy to crack through various types of attack. So to overcome these vulnerabilities, a graphical password technique is introduced. As name suggests in this technique images (pictures) are used as a password instead of text. Also psychological study says that human can easily remember images than text. So according to this fact, graphical passwords are easy to remember and difficult to guess. But because of graphic nature, nearly all the graphical password techniques are vulnerable to shoulder surfing attack. So here, a new graphical password authentication technique is proposed which is resistant to shoulder surfing and also other types of possible attacks to some extent. It is a combination of recognition and recall based approach. It can be useful for smart held devices like smart phones, PDA, iPod, iPhone etc.","authors":["Aakansha S. Gokhale","Vijaya S. Waghmare"],"meta":["December 2016Procedia Computer Science 79(4):875-884","DOI:10.1016/j.procs.2016.03.091"],"references":["224114058_Design_and_Analysis_of_a_Graphical_Password_Scheme","221046286_Graphical_Passwords_A_Survey","272374447_A_Technique_for_Sharing_a_Digital_Image","260299716_Digital_Image_Sharing_by_Diverse_Image_Media","245558372_Authenticating_Mobile_Device_Users_Through_Image_Selection","232529243_Why_are_Pictures_Easier_to_Recall_than_Words","232483886_An_experimental_study_of_memory","228830228_The_Design_and_Analysis_of_Graphical_Passwords","223666118_Recognition_memory_for_words_sentences_and_pictures","223526631_PassPoints_Design_and_longitudinal_evaluation_of_a_graphical_password_system"]}