{"id":"300005547_Pre-service_Teachers'_Perceptions_and_Awareness_toward_Serious_Games_in_the_Classroom_-_Case_of_Morocco","abstract":"We conducted a study on the perception towards videogames among pre-service teachers in three Regional Teachers' Training Centers in Morocco (Centres Régionaux des Métiers de l'Education et de la Formation (CRMEF)). 180 pre-service teachers responded to our primary general survey which mainly focused on their perceptions and attitudes towards the integration of video games in the classroom. We then conducted two training and sensitization sessions with 40 of these trainees on how to make and integrate games in the classroom. We centered our training sessions on the use of the SCRATCH tool which is an open source environment facilitating videogame creation. At the end of these training sessions, we conducted another survey to measure the evolution of their perceptions towards educational video games. This comparative study showed a considerable progress and a better awareness of these pre-service teachers about the potential of serious games in the classroom. All participants appreciated Scratch and its potential as a learning environment. They highlighted the importance of including serious games in class and their need for extra training on the subject. Two of these pre-service teachers, lately adopted this innovative approach and implemented it in their final projects. They have developed and successfully experimented one mathematics lesson using the serious game “Timez ATTACK” with grade three students.","authors":["Ibrahim Ouahbi","Hassane Darhmaoui","Fatiha Kaddari","Abdelrhani Elachqar"],"meta":["March 2016","DOI:10.1109/CGiV.2016.89","Conference: 13th International Conference Computer Graphics, Imaging and Visualization (CGIV16)"],"references":["307703980_Teaching_Pre-Service_Teachers_to_Integrate_Serious_Games_in_the_Primary_Education_Curriculum","279936430_Learning_Basic_Programming_Concepts_By_Creating_Games_With_Scratch_Programming_Environment","279059111_Vers_un_enseignement_de_la_programmation_compatible_avec_la_culture_videoludique_des_eleves_au_Maroc","268347194_Preservice_Teachers'_Awareness_of_Digital_Game-Supported_Learning","263279986_Serious_Games_for_teaching_combined_basic_programming_and_English_communication_for_non-science_major_students","258568152_Learner_Collaboration_in_Digital_Game_Making_An_Emerging_Trend","285637737_Good_video_games_and_good_learning","261303032_How_Computer_Games_Help_Children_Learn","259220170_Enhancing_teachers'_ICT_capacity_for_the_21st_century_learning_environment_Three_cases_of_teacher_education_in_Korea","257171523_Acceptance_of_game-based_learning_by_secondary_school_teachers"]}