{"id":"300132934_Dynamic_Analysis_to_Support_Program_Development_with_the_Textually_Aligned_Property_for_OpenSHMEM_Collectives","abstract":"The development of correct high performance computing applications is challenged by software defects that result from parallel programming. We present an automatic tool that provides novel correctness capabilities for application developers of OpenSHMEM applications. These applications follow a Single Program Multiple Data (SPMD) model of parallel programming. A strict form of SPMD programming requires that certain types of operations are textually aligned, i.e., they need to be called from the same source code line in every process. This paper proposes and demonstrates run-time checks that assert such behavior for OpenSHMEM collective communication calls. The resulting tool helps to check program consistency in an automatic and scalable fashion. We introduce the types of checks that we cover and include strict checks that help application developers to detect deviations from expected program behavior. Further, we discuss how we can utilize a parallel tool infrastructure to achieve a scalable and maintainable implementation for these checks. Finally, we discuss an extension of our checks towards further types of OpenSHMEM operations.","authors":["Andreas Knüpfer","Tobias Hilbrich","Joachim Protze","Joseph Schuchart"],"meta":["December 2015","DOI:10.1007/978-3-319-26428-8_7","Conference: Workshop on OpenSHMEM and Related Technologies"],"references":["221497007_Enforcing_Textual_Alignment_of_Collectives_Using_Dynamic_Checks","220457198_A_Portable_Method_for_Finding_User_Errors_in_the_Usage_of_MPI_Collective_Operations","4222111_MRNet_A_Software-Based_MulticastReduction_Network_for_Scalable_Tools","258859418_Runtime_MPI_Collective_Checking_with_Tree-Based_Overlay_Networks","236209884_GTI_A_Generic_Tools_Infrastructure_for_Event-Based_Tools_in_Parallel_Systems","221643665_Barrier_matching_for_programs_with_textually_unaligned_barriers","221597556_Order_Preserving_Event_Aggregation_in_TBONs","221596882_Verifying_collective_MPI_calls","220105573_Titanium_A_High-performance_Java_Dialect","2842696_An_API_for_runtime_code_patching"]}