{"id":"300141913_Improving_Model_Quality_Through_Foundational_Ontologies_Two_Contrasting_Approaches_to_the_Representation_of_Roles","abstract":"Several foundational ontologies have been developed recently. We examine two of these from the point of view of their quality in representing temporal changes, focusing on the example of roles. We discuss how these are modelled in two foundational ontologies: the Unified Foundational Ontology and the BORO foundational ontology. These exhibit two different approaches, endurantist and perdurantist respectively. We illustrate the differences using a running example in the university student domain, wherein one individual is not only a registered student but also, for part of this period, was elected the President of the Student Union. The metaphysical choices made by UFO and BORO lead to different representations of roles. Two key differences which affect the way roles are modelled are exemplified in this paper: (1) different criteria of identity and (2) differences in the way individual objects extend over time and possible worlds. These differences impact upon the quality of the models produced in terms of their respective explanatory power. The UFO model concentrates on the notion of validity in “all possible worlds” and is unable to accurately represent the way particulars are extended in time. The perdurantist approach is best able to describe temporal changes wherein roles are spatio-temporal extents of individuals.","authors":["Sergio de Cesare","Brian Henderson-Sellers","Chris Partridge","Mark Lycett"],"meta":["October 2015","DOI:10.1007/978-3-319-25747-1_30","Conference: International Conference on Conceptual Modeling"],"references":["271525997_On_the_Need_for_Identity_in_Ontology-Based_Conceptual_Modelling_Keynote_Speech","257232807_Ptolemaic_Metamodelling_The_Need_for_a_Paradigm_Shift","255644776_Note_A_couple_of_meta-ontological_choices_for_ontological_architectures","328247403_Universals_An_Opinionated_Introduction","313750421_The_unreality_of_time","288469059_Re-engineering_Data_with_4D_Ontologies_and_Graph_Databases","284806392_Guidelines_for_Developing_Ontological_Architectures_in_Modelling_and_Simulation","274417340_Four-Dimensionalism","250501693_A_Formal_Ontology_of_Properties_Preliminary_Version","234797263_Business_objects_re-engineering_for_re-use"]}