{"id":"300128374_RGMDV_An_approach_to_requirements_gathering_and_the_management_of_data_virtualization_projects","abstract":"Data virtualization (DV) refers to a set of data stores that enable users to query, access, and manipulate data in a unified, abstracted, and encapsulated manner regardless of data location. Apart from reducing data movement, this system provides a unified, abstracted, real-time, and encapsulated view of information for query purposes. Through its provision of live, virtual data in a timely manner, the DV technique can overcome the obstacles faced by organizations and companies as a result of using other data integration techniques. The systematic planning for the period that precedes DV deployment enables organizations to avoid many challenges related to manageability, usability, data quality, and performance. DV requirements are among the most significant and challenging aspects of a DV project. In this study, an approach has been developed to gather and manage the requirements of a DV design model as an initial step in developing such projects. Expert methods are reviewed to validate and evaluate the proposed approach in terms of usability and related components; the results of this review demonstrate that the applied approaches benefit DV development projects.","authors":["Ayad Hameed Mousa","Norshuhada Shiratuddin","Muhamad Shahbani Abu Bakar"],"meta":["December 2015","DOI:10.1063/1.4937043","Conference: INNOVATION AND ANALYTICS CONFERENCE AND EXHIBITION (IACE 2015): Proceedings of the 2nd Innovation and Analytics Conference & Exhibition","Project: Data Virtualization Project"],"references":["222678920_The_use_of_theatre_in_requirements_gathering_and_usability_studies","220480872_Business_process_management_with_the_user_requirements_notation","44939455_Process-Centric_Business_Intelligence","292888398_Data_Warehousing_Fundamentals_for_it_Professionals_Second_Edition","235252765_Strategy_without_intelligence_intelligence_without_strategy","230699307_CB4-03_An_Eye_on_the_Future_A_Review_of_Data_Virtualization_Techniques_to_Improve_Research_Analytics","226987818_Architecture_for_Virtualization_in_Data_Warehouse","226013770_Stochastic_Response_of_Offshore_Structures_via_Statistical_Cubicization","221607450_Identification_of_Potential_Requirements_of_Master_Data_Management_under_Cloud_Computing"]}