{"id":"300115203_Does_Outreach_Impact_Choices_of_Major_for_Underrepresented_Undergraduate_Students","abstract":"Over the last decade, there has been a concerted effort to bring more diverse voices to the technology field, with much of this being done through outreach activities to girls and boys. Unfortunately, data demonstrating the long-term impact of outreach activities remains rare. To contribute to knowledge on the longitudinal effect of outreach programs, we used a quantitative methodology that followed a descriptive design approach to explore the impact of participation in outreach activities on the choice of undergraduate major. Of those surveyed, 45.3% of the 770 respondents recalled participating in these activities. The results indicate that these activities had a more positive impact on Asians and more negative impact on Hispanics. Blacks/African Americans were more likely to voluntarily participate in outreach activities than Hispanics, and whites were more likely to feel that they were a welcome part of the group than non-whites. The results also may indicate that when outreach programs are available in earlier grades, they are not reaching non-white participants to the same extent as white participants.","authors":["Monica M. McGill","Adrienne Decker","Amber Settle"],"meta":["July 2015","DOI:10.1145/2787622.2787711","Conference: the eleventh annual International Conference"],"references":["321248903_Five_Steps_to_Conducting_a_Systematic_Review","300943222_Testing_Statistical_Hypotheses","298972479_Learning_Computer_Science_Concepts_with_Scratch","292702372_Survey_Questionnaire_Construction","281038162_Georgia_Computes_An_Intervention_in_a_US_State_with_Formal_and_Informal_Education_in_a_Policy_Context","271453012_Increasing_diversity_in_k-12_computer_science","271452017_Young_women_in_computing","271429461_Educational_Research_Planning_Planning_Conducting_and_Evaluating_Quantitative_and_Qualitative_Research","269946132_Testing_Statistical_Hypotheses","269226587_Apps_for_social_justice"]}