{"id":"300253595_Introducing_a_New_Computer_Science_Curriculum_for_All_School_Levels_in_Poland","abstract":"The first regular informatics lessons in schools in Poland were organised in the second half of the 1960’. Some of them were devoted to programming a mainframe computer (in Wrocław) and some to theoretical models of computers and computations (in Warsaw). Then, for more than last 30 years of formal informatics education in Poland we have been very successful in keeping informatics (as computer science) as a stand-alone subject and in shaping its curriculum according to high standards of the discipline. In this paper, in Section 1 we first discuss terminology related to computers in education and then report on early history of informatics education in Poland. In Section 2, the present curriculum of informatics subjects is described in details together with some comments on using computational thinking in its implementation. Then, as the main contribution of this paper we introduce in Section 3 a new computer science curriculum for all school levels in Poland. To this end, the existing curricula of informatics subjects have been remodeled, extended (e.g. by adding programming to each level), and unified according to the five Unified aims of learning computing. The new curriculum benefits very much from our prior curricula and experience. Finally we discuss some implementation details, supporting activities, and the road map for a successful introduction of the curriculum to all schools.","authors":["Maciej Syslo","Anna Beata Kwiatkowska"],"meta":["September 2015","DOI:10.1007/978-3-319-25396-1_13","Conference: International Conference on Informatics in Schools: Situation, Evolution, and Perspectives"],"references":["301429277_Playing_with_computing_at_a_children's_university","290975658_The_First_25_Years_of_Computers_in_Education_in_Poland_1965_-_1990","274377900_Computational_Thinking","274309848_Computational_Thinking","262300168_Computational_Thinking_and_Practice_-_A_Generic_Approach_to_Computing_in_Danish_High_Schools","262168697_Informatics_for_all_high_school_students_A_computational_thinking_approach","254462492_Infusing_computational_thinking_into_the_middle-_and_high-school_curriculum","291411606_Considerations_for_the_Design_of_Computing_Curricula","276441911_Reaching_a_Broader_Population_of_Students_through_Unplugged_Activities","262395214_Education_Establishing_a_Nationwide_CS_Curriculum_in_New_Zealand_High_Schools"]}