{"id":"300250350_Modeling_the_Effects_of_Personality_on_Team_Formation_in_Self-assembly_Teams","abstract":"Optimizing the performance of teams in modern organizations is an important managerial function, and particularly so in contexts where new teams must continually be formed voluntarily, such as with software development, crowd-sourcing platforms, and even the formation of scientific collaborative teams. In many such cases, team performance is significantly influenced by the makeup of participant personalities and temperaments and goes beyond the analysis of individual skills. In this study, we present a team-assemblage model that is primarily influenced by knowledge of the past performance of team members and their personalities. Our goal is to provide a model, which can be parameterized for specific organizational contexts, for policy makers and managers to assess potential teams formed in dynamic circumstances. To provide real-world validation for our approach, we extracted data from the Python Enhancement Proposal (PEP) process, which involves the repeated self-assembly of software teams from a common pool of developers. We then used agent-based simulation to enact our model with PEP data to predict team grouping formation and resulting team performances.","authors":["Mehdi Farhangian","Martin K. Purvis","Maryam Purvis","Bastin Tony Roy Savarimuthu"],"meta":["October 2015","DOI:10.1007/978-3-319-25524-8_36","Conference: International Conference on Principles and Practice of Multi-Agent Systems"],"references":["334273747_Data_mining_applied_to_agent_based_simulation","287788122_Data_mining_applied_to_agent_based_simulation","258138159_The_Relationship_between_Work-Team_Personality_Composition_and_the_Job_Performance_of_Teams","248114259_Top_Management_Team_Demography_and_Corporate_Change","246699633_Linguistic_inquiry_and_word_count_LIWC","313679184_Top_Management_Team_Demography_and_Corporate_Strategic_Change","285837929_NEO-PI-R_professional_manual_Revised_NEO_personality_and_NEO_Five-Factor_Inventory_NEO-FFI_Odessa_FL_psychological_assessment_resources","285713481_Revised_NEO_personality_inventory_NEO_PI-R_and_NEO_five-factor_inventory_Odessa_Florida_FL","247737771_Strategic_Planning_OpennessThe_Role_of_Top_Team_Demography","246786627_MBTI_Manual_a_guide_to_the_development_and_use_of_the_Myers-Briggs_type_indicator"]}