{"id":"300484305_Interaction_Proxemics_Combining_Physical_Spaces_for_Seamless_Gesture_Interaction","abstract":"Touch and gesture input have become popular for display interaction. While applications usually focus on one particular input technology, we set out to adjust the interaction modality based on the proximity of users to the screen. Therefore, we built a system which combines technology-transparent interaction spaces across 4 interaction zones: touch, fine-grained, general, and coarse gestures. In a user study, participants performed a pointing task within and across these zones. Results show that zone transitions are most feasible up to 2m from the screen. Hence, applications can map functionality across different interaction zones, thereby providing additional interaction dimensions and decreasing the complexity of the gesture set. We collected subjective feedback and present a user-defined gesture set for performing a series of standard tasks across different interaction zones. Seamless transition between these spaces is essential to create a consistent interaction experience; finally, we discuss characteristics of systems that take into account user proxemics as input modality.","authors":["Tilman Dingler","Markus Funk","Florian Alt"],"meta":["June 2015","DOI:10.1145/2757710.2757722","Conference: the 4th International Symposium"],"references":["265375169_Situated_Interaction_with_Ambient_Information_Facilitating_Awareness_and_Communication_in_Ubiquitous_Work_Environments","262409530_IllumiRoom_peripheral_projected_illusions_for_interactive_experiences","262285046_P-LAYERS_--_A_Layered_Framework_Addressing_the_Multifaceted_Issues_Facing_Community-Supporting_Public_Display_Deployments","262212768_Interaction_techniques_for_creating_and_exchanging_content_with_public_displays","257526311_IllumiRoom_Peripheral_Projected_Illusions_for_Interactive_Experiences","301389567_MirrorTouch","299782296_The_Natural_User_Interface","278763149_Le_geste_canal_de_communication_hommemachine_la_communication_instrumentale","270388956_Pervasive_Displays_Understanding_the_Future_of_Digital_Signage","246661621_Le_geste_canal_de_communication_hommemachine"]}