{"id":"300468724_An_Algebraic_Geometric_Approach_to_Multidimensional_Words","abstract":"We apply linear algebra and algebraic geometry to study infinite multidimensional words of low pattern complexity. By low complexity we mean that for some finite shape, the number of distinct sub-patterns of that shape that occur in the word is not more than the size of the shape. We are interested in discovering global regularities and structures that are enforced by such low complexity assumption. We express the word as a multivariate formal power series over integers. We first observe that the low pattern complexity assumption implies that there is a non-zero polynomial whose formal product with the power series is zero. We call such polynomials the annihilators of the word. The annihilators form an ideal, and using Hilbert’s Nullstellensatz we construct annihilators of simple form. In particular, we prove a decomposition of the word as a sum of finitely many periodic power series. We consider in more details a particular interesting example of a low complexity word whose periodic decomposition contains necessarily components with infinitely many distinct coefficients. We briefly discuss applications of our technique in the Nivat’s conjecture and the periodic tiling problem. The results reported here have been first discussed in a paper that we presented at ICALP 2015.","authors":["Jarkko Kari","Michal Szabados"],"meta":["September 2015","DOI:10.1007/978-3-319-23021-4_3","Conference: International Conference on Algebraic Informatics"],"references":["226317960_Tiling_the_line_with_translates_of_one_tile","3785003_Algorithms_to_tile_the_infinite_grid_with_finite_clusters","288416470_Hedlund_Symbolic_dynamics_I_II_Amer","282518384_Nonexpansive_mathbb_Z2-subdynamics_and_Nivat's_Conjecture","282402927_An_Algebraic_Geometric_Approach_to_Nivat's_Conjecture","271578939_Periodicity_and_local_complexity","243963773_Complexity_of_short_rectangles_and_periodicity","230641324_An_Introduction_to_Symbolic_Dynamics_and_Coding","225142748_On_translating_one_polyomino_to_tile_the_plane","222696285_On_a_conjecture_on_bidimensional_words","222616650_The_rectangle_complexity_of_functions_on_two-dimensional_lattices","222035087_The_complexity_of_functions_on_lattices","220150647_Periodicity_and_local_complexity"]}