{"id":"300408875_Tunisian_Arabic_aeb_Wordnet_Current_State_and_Future_Extensions","abstract":"Nowadays, Internet communication and especially informal Internet communication such as social networks, blogs, etc. is directing politic, economic, financial and social environments all over the world. Consequently, Internet monitoring is taking more and more scale particularly in Tunisia suffering from unsteadiness since the politic revolution in 2011. In a Tunisian context, Internet communication is characterized by the increasing use of aeb language (i.e. an Arabic dialect called Tunisian Arabic). Therefore, Tunisian Internet monitoring needs primarily aeb language processing tools, especially an aeb lexicon. However, few aeb lexicon were developed seen the lack of written resources. Some of these lexicons are created from Arabic lexicons. They cover aeb lexicon originally Arabic and ignore the large borrowed aeb lexicon. Others are build using the informal Web. In fact, they need a rigorous linguistic verification, correction and validation. In this case, we suggest building a standard, large and robust Wordnet taking in charge phonetic. Our Wordnet is created by the expand approach used for EuroWordnet building as in [12], based on the bilingual English-Tunisian Arabic dictionary Peace corps dictionary prepared by the linguists: R. Ben abdelkader, A. Ayed and A. Naouar [13], and the last version of Princeton Wordnet PWN 3.1. Moreover, it is modelized according to ISO-LMF by a switable Wordnet-LMF model for aeb language. In this paper, we present aeb wordnet building approach, describe its current state and propose extensions.","authors":["Nadia Karmani BM","Hsan Soussou","Adel M. Alimi"],"meta":["April 2015","DOI:10.1109/ACLing.2015.7","Conference: 2015 First International Conference on Arabic Computational Linguistics (ACLing)","Project: aebWordNet"],"references":["301404328_Tunisian_dialect_Wordnet_creation_and_enrichment_using_web_resources_and_other_Wordnets","281821565_Tunisian_Arabic_Corpus_A_written_corpus_of_an_unwritten_language","257547335_Erratum_to_On_the_evaluation_and_improvement_of_Arabic_WordNet_coverage_and_usability","228636500_Building_a_wordnet_for_arabic","221101803_Standardizing_Wordnets_in_the_ISO_Standard_LMF_Wordnet-LMF_for_GermaNet","51935085_Building_Ontologies_To_Understand_Spoken_Tunisian_Dialect","313038781_Pluringuisme_et_diglossie_en_Tunisie","313037456_Morphological_analysis_of_tunisian_dialect","312094492_Building_a_standardized_Wordnet_in_the_ISO_LMF_for_aeb_language","261378700_Bootstrapping_a_WordNet_for_an_Arabic_dialect_from_other_WordNets_and_dictionary_resources","260718984_LMF_Lexical_Markup_Framework","242608481_EuroWordNet_a_multilingual_database_with_lexical_semantic_networks","234692926_Peace_Corps_English-Tunisian_Arabic_Dictionary","200044309_WordNet_A_Lexical_Database_for_English","36349632_The_Arabic_dialect_of_Susa_Tunisia"]}