{"id":"300400171_De_Nugis_Groebnerialium_4","abstract":"It is well-known that each effective associative ring with identity is endowed with a Buchberger Theory, id est a notion of Gröbner bases and related algorithms. This note is a sort of Do-It-Yourself manual for setting a Gröbner bases approach to such a ring.\nThe extension of Buchberger Theory and Algorithm from the classical case of polynomial rings over a field to the case of (non necessarily commutative) monoid rings over a (non necessarily free) monoid and a principal ideal ring was immediately performed by a series of milestone papers: Zacharias' approach to canonical forms, Spear's theorem which extends Buchberger Theory to each effectively given rings, Möller's reformulation of Buchberger Algorithm in terms of lifting.\nSince the universal property of the free monoid ring Q := Z\\ Z over Z and the monoid Z of all words over the alphabet Z grants that each ring with identity A can be presented as a quotient A=Q I of a free monoid ring Q modulo a bilateral ideal I ⊂ Q, in order to impose a Buchberger Theory over any effective associative ring it is sufficient to reformulate it in filtration-valuation terms and apply the results quoted above; in particular Zacharias canonical forms allow to effectively present A and its elements, Spear's theorem describes how Q imposes its Z-filtration on A and a direct application of Möller's lifting theorem to such filtration allows to characterize the required S-polynomials.","authors":["Ferdinando Mora"],"meta":["June 2015","DOI:10.1145/2755996.2756640","Conference: the 2015 ACM"],"references":["247434376_Canonical_Bases_Relations_with_Standard_Bases_Finiteness_Conditions_and_Application_to_Tame_Automorphisms","222556986_Computational_ideal_theory_in_finitely_generated_extension_rings","332759035_Zacharias_representation_of_effective_associative_rings","323743048_A_Canonical_Basis_for_the_Ideals_of_a_Polynomial_Domain","266227070_A_Canonical_Basis_for_the_Ideals_of_a_Polynomial_Domain","257914283_Sur_les_systemes_d'equations_aux_derivees_partielles","248834906_Die_Berechnung_von_Syzygien_mit_dem_verallgemeinerten_Weierstra_-_schen_Divisionssatz","247498577_Seven_variations_on_standard_bases","245253010_Algorithmic_Methods_in_Non-Commutative_Algebra","240808879_IDEAL_BASES_AND_VALUATION_RINGS","222275619_Non-commutative_Grobner_bases_in_algebras_of_solvable_type","222264055_On_the_construction_of_Grobner_bases_using_syzygies","221564509_Computing_Grobner_Bases_in_Monoid_and_Group_Rings","220162037_The_Ideal_Membership_Problem_in_Non-Commutative_Polynomial_Rings","220161228_Valuations_and_Filtrations","23827461_A_constructive_approach_to_commutative_ring_theory"]}