{"id":"300409178_Inviwo_-_An_extensible_multi-purpose_visualization_framework","abstract":"To enable visualization research impacting other scientific domains, the availability of easy-to-use visualization frameworks is essential. Nevertheless, an easy-to-use system also has to be adapted to the capabilities of modern hardware architectures, as only this allows for realizing interactive visualizations. With this trade-off in mind, we have designed and realized the cross-platform Inviwo (Interactive Visualization Workshop) visualization framework, that supports both interactive visualization research as well as efficient visualization application development and deployment. In this poster we give an overview of the architecture behind Inviwo, and show how its design enables us and other researchers to realize their visualization ideas efficiently. Inviwo consists of a modern and lightweight, graphics independent core, which is extended by optional modules that encapsulate visualization algorithms, well-known utility libraries and commonly used parallel-processing APIs (such as OpenGL and OpenCL). The core enables a simplistic structure for creating bridges between the different modules regarding data transfer across architecture and devices with an easy-to-use screen graph and minimalistic programming. Making the base structures in a modern way while providing intuitive methods of extending the functionality and creating modules based on other modules, we hope that Inviwo can help the visualization community to perform research through a rapid-prototyping design and GUI, while at the same time allowing users to take advantage of the results implemented in the system in any way they desire later on. Inviwo is publicly available at www.inviwo.org, and can be used freely by anyone under a permissive free software license (Simplified BSD).","authors":["Erik Sunden","Peter Steneteg","Sathish Kottravel","Daniel Jönsson"],"meta":["October 2015","DOI:10.1109/SciVis.2015.7429514","Conference: 2015 IEEE Scientific Visualization Conference (SciVis)","Project: Seeing Organ Function"],"references":["278300814_Coverage-Based_Opacity_Estimation_for_Interactive_Depth_of_Field_in_Molecular_Visualization","269202228_The_design_and_implementation_of_an_object-oriented_toolkit_for_3D_graphics_and_visualization","231043318_Software_Infrastructure_for_exploratory_visualization_and_data_analysis_Past_present_and_future_-_art_no_012100","225186718_A_Survey_of_Visualization_Pipelines","221212794_VisTrails_Visualization_meets_data_management","262392361_Voreen_A_Rapid-Prototyping_Environment_for_Ray-Casting-Based_Volume_Visualizations","220518281_Scientific_Storytelling_Using_Visualization","14457131_VMD_Visual_molecular_dynamics","4188148_A_Contract-Based_System_for_Large_Data_Visualization"]}