{"id":"300546247_Inferring_Executable_Models_from_Formalized_Experimental_Evidence","abstract":"Executable symbolic models have been successfully used to analyze networks of biological reactions. However, the process of building an executable model from published experimental findings is still carried out manually. The process is very time consuming and requires expert knowledge. As a first step in addressing this problem, this paper introduces an automated method for deriving executable models from formalized experimental findings called datums. We identify the relevant data in a collection of datums. We then translate the information contained in datums to logical assertions. Together with a logical theory formalizing the interpretation of datums, these assertions are used to infer a knowledge base of reaction rules. These rules can then be assembled into executable models semi-automatically using the Pathway Logic system. We applied our technique to the experimental evidence relevant to Hras activation in response to Egf available in our datum knowledge base. When compared to the Pathway Logic model (curated manually from the same datums by an expert), our model makes most of the same predictions regarding reachability and knockouts. Missing information is due to missing assertions that require reasoning about the effects of mutations and background knowledge to generate. This is being addressed in ongoing work.","authors":["Vivek Nigam","Robin Donaldson","Merrill Knapp","Tim McCarthy"],"meta":["September 2015","DOI:10.1007/978-3-319-23401-4_9","Conference: International Conference on Computational Methods in Systems Biology"],"references":["263520722_Building_Executable_Biological_Pathway_Models_Automatically_from_BioPAX","259457124_Perturbation_Biology_Inferring_Signaling_Networks_in_Cellular_Systems","258856869_Pathway_Commons_at_Virtual_Cell_Use_of_pathway_data_for_mathematical_modeling","235740196_JAKSTAT_signalling_-_an_executable_model_assembled_from_molecule-centred_modules_demonstrating_a_module-oriented_database_concept_for_systems_and_synthetic_biology","234831120_The_DLV_System_for_Knowledge_Representation_and_Reasoning","230742138_Bayesian_Inference_of_Signaling_Network_Topology_in_a_Cancer_Cell_Line","225543557_Inferring_Biological_Signal_Transduction_Networks_via_Transitive_Reductions_of_Directed_Graphs","46221313_Inference_of_Signal_Transduction_Networks_from_Double_Causal_Evidence","225711540_Symbolic_Systems_Biology","222459436_Conditioned_Rewriting_Logic_as_a_United_Model_of_Concurrency","220986674_Logic_Programs_with_Classical_Negation","220687826_Multiple_Representations_of_Biological_Processes","5856382_Executable_cell_biology"]}