{"id":"300576269_Fast_Matrix_Multiplication","abstract":"Until a few years ago, the fastest known matrix multiplication algorithm, due to Coppersmith and Winograd (1990), ran in time O(n2.3755). Recently, a surge of activity by Stothers, Vassilevska-Williams, and Le~Gall has led to an improved algorithm running in time O(n2.3729). These algorithms are obtained by analyzing higher and higher tensor powers of a certain identity of Coppersmith and Winograd. We show that this exact approach cannot result in an algorithm with running time O(n2.3725), and identify a wide class of variants of this approach which cannot result in an algorithm with running time $O(n^{2.3078}); in particular, this approach cannot prove the conjecture that for every ε > 0, two n x n matrices can be multiplied in time O(n2+ε).\nWe describe a new framework extending the original laser method, which is the method underlying the previously mentioned algorithms. Our framework accommodates the algorithms by Coppersmith and Winograd, Stothers, Vassilevska-Williams and Le~Gall. We obtain our main result by analyzing this framework. The framework also explains why taking tensor powers of the Coppersmith--Winograd identity results in faster algorithms.","authors":["Andris Ambainis","Yuval Filmus","Francois Le Gall"],"meta":["June 2015","DOI:10.1145/2746539.2746554","Conference: the Forty-Seventh Annual ACM"],"references":["342571583_Tensor_rank_is_NP-complete","309535089_Fast_matrix_multiplication_using_coherent_configurations","284758788_Vermeidung_von_Divisionen","268380665_Breaking_the_Coppersmith-Winograd_barrier","262289301_Multiplying_matrices_faster_than_Coppersmith-Winograd","259983448_Powers_of_Tensors_and_Fast_Matrix_Multiplication","259431864_Improved_bound_for_complexity_of_matrix_multiplication","247383407_Relative_bilinear_complexity_and_matrix_multiplication","243110163_Vermeidung_von_Divisionen","242376919_On_Minimizing_the_Number_of_Multiplications_Necessary_for_Matrix_Multiplication"]}