{"id":"300779865_On_Determinisation_of_Good-for-Games_Automata","abstract":"In this work we study Good-For-Games (GFG) automata over \\(\\omega \\)-words: non-deterministic automata where the non-determinism can be resolved by a strategy depending only on the prefix of the \\(\\omega \\)-word read so far. These automata retain some advantages of determinism: they can be composed with games and trees in a sound way, and inclusion \\(\\mathrm {L} (\\mathcal {A})\\supseteq \\mathrm {L} (\\mathcal {B})\\) can be reduced to a parity game over \\(\\mathcal {A} \\times \\mathcal {B} \\) if \\(\\mathcal {A} \\) is GFG. Therefore, they could be used to some advantage in verification, for instance as solutions to the synthesis problem.\nThe main results of this work answer the question whether parity GFG automata actually present an improvement in terms of state-complexity (the number of states) compared to the deterministic ones. We show that a frontier lies between the Büchi condition, where GFG automata can be determinised with only quadratic blow-up in state-complexity; and the co-Büchi condition, where GFG automata can be exponentially smaller than any deterministic automaton for the same language. We also study the complexity of deciding whether a given automaton is GFG.","authors":["Denis Kuperberg","Michał Skrzypczak"],"meta":["July 2015","DOI:10.1007/978-3-662-47666-6_24","Conference: International Colloquium on Automata, Languages, and Programming","Project: Good-for-Games"],"references":["262287322_Nondeterminism_in_the_Presence_of_a_Diverse_or_Unknown_Future","312603299_Tree_automata_mu-calculus_and_determinacy","268651079_Automata_on_infinite_objects_and_Church's_problem","267433048_Forms_of_Determinism_for_Automata","267146419_Are_Good-for-Games_Automata_Good_for_Probabilistic_Model_Checking","254640205_Solving_Sequential_Conditions_by_Finite_State_Strategies","225530597_Monadic_Second_Order_Logic_on_Tree-Like_Structures","222117900_An_automata_theoretic_decision_procedure_for_the_propositional_mu-calculus","221557895_Solving_Games_Without_Determinization","221442769_Faster_Solutions_of_Rabin_and_Streett_Games"]}