{"id":"300790909_Wireless_Autonomous_Robot_Evacuation_from_Equilateral_Triangles_and_Squares","abstract":"Consider an equilateral triangle or square with sides of length \\(1\\). A number of robots starting at the same location on the perimeter or in the interior of the triangle or square are required to evacuate from an exit which is located at an unknown location on its perimeter. At any time the robots can move at identical speed equal to \\(1\\), and they can cooperate by communicating with each other wirelessly. Thus, if a robot finds the exit it can broadcast “exit found” to the remaining robots which then move in a straight line segment towards the exit to evacuate. Our task is to design robot trajectories that minimize the evacuation time of the robots, i.e., the time the last robot evacuates from the exit. Designing such optimal algorithms turns out to be a very demanding problem and even the case of equilateral triangles turns out to be challenging.\nWe design optimal evacuation trajectories (algorithms) for two robots in the case of equilateral triangles for any starting position and for squares for starting positions on the perimeter. It is shown that for an equilateral triangle, three or more robots starting on the perimeter cannot achieve better evacuation time than two robots, while there exist interior starting points from which three robots evacuate faster than two robots. For the square, three or more robots starting at one of the corners cannot achieve better evacuation time than two robots, but there exist points on the perimeter of the square such that three robots starting from such a point evacuate faster than two robots starting from this same point. In addition, in either the equilateral triangle or the square it can be shown that a simple algorithm is asymptotically optimal (in the number \\(k\\) of robots, as \\(k \\rightarrow \\infty \\)), provided that the robots start at the centre of the corresponding domain.","authors":["Jurek Czyzowicz","E. Kranakis","D. Krizanc","L. Narayanan"],"meta":["June 2015","DOI:10.1007/978-3-319-19662-6_13","Conference: International Conference on Ad-Hoc Networks and Wireless"],"references":["228768181_Search_and_Pursuit-evasion_in_Mobile_Robotics","220430785_How_to_Learn_an_Unknown_Environment_I_The_Rectilinear_Case","46581330_Evacuation_of_Rectilinear_Polygons","30529942_The_Theory_of_Search_Games_and_Rendezvous","2445696_Exploring_Unknown_Environments_with_Obstacles","300008139_Evacuating_Robots_via_Unknown_Exit_in_a_Disk","278681129_Group_Search_on_the_Line","271218992_Evacuating_Robots_from_a_Disk_Using_Face-to-Face_Communication","268861721_Chases_and_Escapes_The_Mathematics_of_Pursuit_and_Evasion","242375978_Theory_of_Optimal_Search","239761962_Optimal_Movement_of_Mobile_Sensors_for_Barrier_Coverage_of_a_Planar_Region_Extended_Abstract","229651096_An_alternative_solution_to_the_lost_at_sea_problem","227859256_The_Game_of_Cops_and_Robbers_on_Graphs","224773205_Frontier-based_exploration_using_multiple_robots","221335451_Optimal_Movement_of_Mobile_Sensors_for_Barrier_Coverage_of_a_Planar_Region","220617078_The_Polygon_Exploration_Problem","3510360_How_to_learn_an_unknown_environment","2309083_On-Line_Search_in_a_Simple_Polygon"]}