{"id":"300896060_Mining_High_Utility_Itemsets_in_Big_Data","abstract":"In recent years, extensive studies have been conducted on high utility itemsets (HUI) mining with wide applications. However, most of them assume that data are stored in centralized databases with a single machine performing the mining tasks. Consequently, existing algorithms cannot be applied to the big data environments, where data are often distributed and too large to be dealt with by a single machine. To address this issue, we propose a new framework for mining high utility itemsets in big data. A novel algorithm named PHUI-Growth (Parallel mining High Utility Itemsets by pattern-Growth) is proposed for parallel mining HUIs on Hadoop platform, which inherits several nice properties of Hadoop, including easy deployment, fault recovery, low communication overheads and high scalability. Moreover, it adopts the MapReduce architecture to partition the whole mining tasks into smaller independent subtasks and uses Hadoop distributed file system to manage distributed data so that it allows to parallel discover HUIs from distributed data across multiple commodity computers in a reliable, fault tolerance manner. Experimental results on both synthetic and real datasets show that PHUI-Growth has high performance on large-scale datasets and outperforms state-of-the-art non-parallel type of HUI mining algorithms.","authors":["Ying Chun Lin","Cheng-Wei Wu","Vincent S. Tseng"],"meta":["May 2015","DOI:10.1007/978-3-319-18032-8_51","Conference: Pacific-Asia Conference on Knowledge Discovery and Data Mining"],"references":["262369808_Mining_high_utility_itemsets_without_candidate_generation","262273728_Bifet_A_Mining_Big_Data_Current_Status_and_Forecast_to_the_Future_SIGKDD_Explorations_142_1-5","221020150_Parallel_Method_for_Mining_High_Utility_Itemsets_from_Vertically_Partitioned_Distributed_Databases","44326491_MOA_massive_online_analysis","312449512_Mining_Frequent_Patterns_without_Candidate_Generation","261040777_Direct_Discovery_of_High_Utility_Itemsets_without_Candidate_Generation","235949400_Efficient_Algorithms_for_Mining_High_Utility_Itemsets_from_Transactional_Databases","228344500_A_fast_high_utility_itemsets_mining_algorithm","224384927_Efficient_Tree_Structures_for_High_Utility_Pattern_Mining_in_Incremental_Databases","222552897_Isolated_items_discarding_strategy_for_discovering_high_utility_itemsets","221214987_Mining_Frequent_Patterns_Without_Candidate_Generation","2460430_Fast_Algorithms_for_Mining_Association_Rules"]}