{"id":"300918005_Scratch_A_Way_to_Logo_and_Python","abstract":"There is concern amongst teachers about how to support all pupils in making the transition from popular graphical languages like Scratch to text-based languages like Python. In a new subject, not taught widely before at both primary and secondary education in England, there is inevitably a lack of tuned-in pedagogical expertise. In this paper, the authors address the transition process by exploring established pedagogy in Computer Science, and other subjects including Mathematics, Science and Languages, and by sharing and testing their findings with pupils and teachers in the classroom. Teaching the fundamentals of programming is well served by applying sequential solutions in both graphical and text-based languages. This practitioner action research paper focuses on scaffolding support for pupils when making the transition from graphical to text-based languages. In an approach which uses graphical languages in conjunction with, not in place of, text-based programming languages, the authors discuss ways to tackle the difficulties presented to pupils by text-based languages, and propose a tested strategy for teachers to enable pupils to undertake the transition successfully.","authors":["Mark Dorling","Dave White"],"meta":["February 2015","DOI:10.1145/2676723.2677256","Conference: the 46th ACM Technical SymposiumAt: http://ispython.com/wp/wp-content/uploads/2014/11/Asigsce16_titled.pdf"],"references":["299450690_Computational_thinking_the_developing_definition","274377900_Computational_Thinking","274309848_Computational_Thinking","234803601_A_CS0_course_using_Scratch","228343198_An_Australasian_study_of_reading_and_comprehension_skills_in_novice_programmers_using_the_bloom_and_SOLO_taxonomies","220426817_Scratch_Programming_for_All","298972479_Learning_Computer_Science_Concepts_with_Scratch","278358129_Starting_from_scratch","277374591_Lowering_the_barriers_to_programming","242393297_Learning_to_Program_with_Alice","239062196_Learning_to_Program_with_Alice_Prentice-Hall","221209623_Learning_computer_science_concepts_with_Scratch","215900261_Lowering_the_barriers_to_programming_A_taxonomy_of_programming_environments_and_languages_for_novice_programmers"]}