{"id":"300902976_Rhetorical_Structure_Analysis_of_the_Indonesian_Research_Articles","abstract":"This thesis discusses rhetorical features of Indonesian research articles (RAs) in three disciplinary areas: Economics, Education and Psychology. These were written by Indonesian speakers and published mainly in university-based scientific journals. The main focus of this thesis is on the examination of the patterns of communicative purposes or ‘Moves’ and their subsequent elements or ‘Steps’ of the introduction sections of these articles. The analyses include the examination of communicative purposes and persuasive values of the texts, linguistic resources used to materialise the communicative purposes and persuasions, and the cultural factors (ie. norms, beliefs and values) and scientific practices and academic writing conventions underlying the specific rhetorical features. ¶ This study found that the macro rhetorical structure of the Indonesian RAs (ie. the Introduction, Methods, Results and Discussion or IMRD pattern) is relatively similar to that of the English RAs except that, unlike in English RAs, the conclusion and suggestion section in the Indonesian RAs have a separate section. However, the communicative purposes and persuasions in the introduction sections in the two groups of the RAs (English and Indonesian) are relatively different. Differences are also found in the way that rhetorical works use the linguistic resources to materialise the communicative purposes and persuasions in the introduction sections of the two groups of RAs. Some of the rhetorical differences are because of the differences in the research practices and scientific writing conventions in Indonesian and in English speaking countries, while others are because of cultural differences reflected in the two languages. ¶ The pedagogical implication of this study is that the Indonesian RA genre needs to be explicitly taught to Indonesian students, particularly university students in order to give them more access to the content of Indonesian research, and to develop skills needed by Indonesian researchers and research writers. For this purpose, an appropriate approach needs to be developed; that is to teach the generic features of Indonesian RAs such as those in social sciences written in Bahasa Indonesia or Indonesian.","authors":["Safnil"],"meta":["June 2000"],"references":["336553612_Prediktor_Sikap_Permisif_terhadap_Hubungan_Seks_Sebelum_Menikah","307830828_Sumber-sumber_Stres_Kerja_Guru","307763147_Hubungan_Persepsi_Klien_tentang_Konseling_dan_Ketrampilan_Komunikasi_Konselor_dalam_Konseling_dengan_Pengungkapan_Diri_Klien","346644499_Text_Role_and_Context_Developing_Academic_Literacies","346543452_A_Rhetoric_for_Research_in_Sciences_and_Technologies","319604457_PENGARUH_MANAJAEMEN_INTERPERSONAL_KELOMPOK_EFEKTIF_OBJEKTIF_MIKEO_TERHADAP_PRODUKTIVITAS_KERJA_KARYAWAN_PERUSAHAAN_DI_JAWA_TIMUR","313649566_Rhetoric","313555603_Genre_how_far_can_we_should_we_go","313549556_Pragmatic_and_Macrothematic_Patterns_in_Science_and_Popular_Science_A_Diachronic_Study_of_Articles_from_Three_Fields","312601288_Evaluation_and_organization_in_a_sample_of_written_academic_discourse"]}