{"id":"301198969_A_Heuristic_Self-Adaptive_Medium_Access_Control_for_Resource_Constrained_WBAN_Systems","abstract":"This paper presents a heuristic-based approach to self-adapt and reconfigure the wake-up schedule of the nodes in wireless body area networks (WBAN). A latency-energy optimized traffic-aware dynamic medium access control (MAC) protocol is presented. The protocol is based on an adaptive algorithm that allows the sensor nodes to adapt their wake-up and sleep patterns efficiently in static and dynamic traffic variations. The heuristicapproach helps to characterize the algorithmic parameters withan objective to investigate the behavior of the convergence patterns of the WBAN nodes in a non-linear system. An open-loop form is developed by keeping the wake-up interval (Iwu) fixed followed by the closed-loop adaptive system which updates theIwuon every wake-up instant. An exhaustive search is conducted for different initial wake-up interval values which show that (on average) the algorithm parameters behave monotonically in openloop systems, whereas a decaying function in closed-loop form.Various performance metrics such as energy consumption, packet delay, packet delivery ratio (PDR), and convergence speed (for eaching a steady state) are evaluated. It is observed that the convergence time varies from8secto72secunder fixed packet transmission rate, whereas, the algorithm re-converges (within8sec) whenever the transmission rate changes.","authors":["Muhammad Mahtab Alam","Elyes Ben Hamida","Olivier Berder","Daniel Menard"],"meta":["February 2016IEEE Access 2016(4):1287-1300","DOI:10.1109/ACCESS.2016.2539299","Project: CROW2 : Critical and Rescue Operations using Wearable Wireless sensors networks"],"references":["308735666_Performance_evaluation_of_IEEE_802156_MAC_for_Wearable_Body_Sensor_Networks_using_a_Space-Time_dependent_radio_link_model","301485226_Joint_Throughput_and_Channel_Aware_TCA_Dynamic_Scheduling_Algorithm_for_Emerging_Wearable_Applications","281015298_Power-Aware_Adaptive_Techniques_for_Wireless_Sensor_Networks","280081636_Strategies_for_Optimal_MAC_Parameters_Tuning_in_IEEE_802156_Wearable_Wireless_Sensor_Networks","273394880_Communication_challenges_in_high-density_deployments_of_wearable_wireless_devices","264232770_Wearable_Body-to-Body_Networks_for_Critical_and_Rescue_Operations_-_The_CROW_Project","309032447_RI-MAC_A_receiver-initiated_asynchronous_duty_cycle_MAC_protocol_for_dynamic_traffic_loads_in_wireless_sensor_networks","299982491_Role_of_Wireless_Sensor_Networks_in_Emerging_Communication_Technologies_A_Review","283535990_Phenomenal_Augmented_Reality_Advancing_technology_for_the_future_of_humanity","264983795_A_Survey_on_Wireless_Body_Area_Networks_Technologies_and_Design_Challenges"]}