{"id":"301220445_How_Revisions_to_Mathematical_Visuals_Affect_Cognition_Evidence_from_Eye_Tracking","abstract":"accepted). Revising visuals based on instructional design principles: Effects on cognitive load and learning. ABSTRACT Mathematics curricula are frequently rich with visuals, but these visuals are often not designed for optimal use of students' limited cognitive resources. The authors of this study revised the visuals in a mathematics lesson based on instructional design principles. The purpose of this study is to examine the effects of these revised visuals on students' cognitive load, cognitive processing, learning, and interest. Middle-school students (N = 62) read a lesson on early algebra with original or revised visuals while their eye movements were recorded. Students in the low prior knowledge group had less cognitive load and cognitive processing with the revised lesson than the original lesson. However, the reverse was true for students in the middle prior knowledge group. There were no effects of the revisions on learning. The findings are discussed in the context of the expertise reversal effect as well as the cognitive theory of multimedia learning and cognitive load theory.","authors":["Virginia Clinton-Lisell","Jennifer L Cooper","Joseph Michaelis","Martha W. Alibali"],"meta":["September 2016","DOI:10.4018/978-1-5225-1005-5.ch010","In book: Eye-tracking technology applications in educational researchPublisher: IGI GlobalEditors: C. Was, F.J. Sansosti, B.J. Morris"],"references":["300641291_An_Eye-Tracking_Analysis_of_Spatial_Contiguity_Effect_in_Educational_Animations","283557767_When_less_is_more_Research_and_theory_insights_about_instruction_for_complex_learning","321525690_Cognitive_Load_Theory","304860437_Multimedia_Learning_Second_Edition","297559034_Cognitive_load_theory","287807075_Signaling_text-picture_relations_in_multimedia_learning_A_comprehensive_meta-analysis","285940307_Tracking_eye_movements_when_solving_geometry_problems_with_handwriting_devices","284971556_Multimedia_learning_and_games","280808621_When_Is_an_Illustration_Worth_Ten_Thousand_Words","280799108_Signaling_as_a_cognitive_guide_in_multimedia_learning"]}