{"id":"301287046_HOUGH-TRANSFORM_AND_EXTENDED_RANSAC_ALGORITHMS_FOR_AUTOMATIC_DETECTION_OF_3D_BUILDING_ROOF_PLANES_FROM_LIDAR_DATA","abstract":"Airborne laser scanner technique is broadly the most appropriate way to acquire rapidly and with high density 3D data over a city. Once the 3D Lidar data are available, the next task is the automatic data processing, with major aim to construct 3D building models. Among the numerous automatic reconstruction methods, the techniques allowing the detection of 3D building roof planes are of crucial importance. Three main methods arise from the literature: region growing, Hough-transform and Random Sample Consensus (RANSAC) paradigm. Since region growing algorithms are sometimes not very transparent and not homogenously applied, this paper focuses only on the Hough-transform and the RANSAC algorithm. Their principles, their pseudocode - rarely detailed in the related literature - as well as their complete analyses are presented in this paper. An analytic comparison of both algorithms, in terms of processing time and sensitivity to cloud characteristics, shows that despite the limitation encountered in both methods, RANSAC algorithm is still more efficient than the first one. Under other advantages, its processing time is negligible even when the input data size is very large. On the other hand, Hough-transform is very sensitive to the segmentation parameters values. Therefore, RANSAC algorithm has been chosen and extended to exceed its limitations. Its major limitation is that it searches to detect the best mathematical plane among 3D building point cloud even if this plane does not always represent a roof plane. So the proposed extension allows harmonizing the mathematical aspect of the algorithm with the geometry of a roof. At last, it is shown that the extended approach provides very satisfying results, even in the case of very weak point density and for different levels of building complexity. Therefore, once the roof planes are successfully detected, the automatic building modelling can be carried out.","authors":["Fayez Tarsha-Kurdi"],"meta":["September 2007"],"references":["228776350_Automatic_3D_building_reconstruction_from_airborne_laser_scanning_and_cadastral_data_using_Hough_transform","228610502_3D_building_model_reconstruction_from_point_clouds_and_ground_plans","228605367_Building_reconstruction_and_visualization_from_LIDAR_data","228601687_Automatic_3D_Building_Reconstruction_Using_Plane-Roof_Structures","224623236_A_Comparison_of_Line_Extraction_Algorithms_using_2D_Laser_Rangefinder_for_Indoor_Mobile_Robotics","220654533_Complete_Classification_of_Raw_LiDAR_Data_and_3D_Reconstruction_of_Buildings","252252777_Digital_Image_Processing_Using_Matlab","236519005_Method_and_Means_for_Recognizing_Complex_Patterns","228422302_Efficient_Hough_transform_for_automatic_detection_of_cylinders_in_point_clouds","222479074_Two_Algorithms_for_Extracting_Building_Models_from_Raw_Laser_Altimetry_Data","220473977_A_comparison_of_line_extraction_algorithms_using_2D_range_data_for_indoor_mobile_robotics","4254359_Joint_combination_of_point_cloud_and_DSM_for_3D_building_reconstruction_using_airborne_laser_scanner_data","215458581_Random_Sample_Consensus_A_Paradigm_for_Model_Fitting_with_Applications_To_Image_Analysis_and_Automated_Cartography","3350734_Application_of_the_generalised_Hough_transform_to_corner_detection","3209119_Automatic_Generation_of_High-Quality_Building_Models_from_Lidar_Data"]}