{"id":"301237469_Computing_in_the_curriculum_Challenges_and_strategies_from_a_teacher's_perspective","abstract":"Computing is being introduced into the curriculum in many countries. Teachers’ perspectives enable us to discover what challenges this presents, and also the strategies teachers claim to be using successfully in teaching the subject across primary and secondary education. The study described in this paper was carried out in the UK in 2014 where teachers were preparing for the mandatory inclusion of Computing into the curriculum. A survey was conducted of over 300 teachers who were currently teaching Computing to elicit their perspectives on challenges and strategies. From the analysis of the data, extrinsic and intrinsic challenges were identified for both teachers and students. In addition, a variety of pedagogical strategies were recommended by teachers from their own practice. In categorising approaches taken by teaching to support students five key themes emerged: unplugged type activities, contextualisation of tasks, collaborative learning, developing computational thinking, and scaffolding programming tasks. Further investigation could support whether these strategies can alleviate the challenges of teaching and learning of Computing for students and teachers. In particular developing student resilience in Computing is seen as a challenge while not many strategies are suggested. The results of this study will be useful for teachers who are new to the teaching of Computing.","authors":["Sue Sentance","Andrew Csizmadia"],"meta":["March 2017Education and Information Technologies 22(2)","DOI:10.1007/s10639-016-9482-0","Projects: Pedagogy and CS Education in SchoolsPedagogy and CS Education in Schools"],"references":["327302966_Computational_thinking_-_a_guide_for_teachers","288404651_Integrating_computational_thinking_with_K-12_science_education_A_theoretical_framework","274377900_Computational_Thinking","274309848_Computational_Thinking","272007146_Teacher_Technology_Change_How_Knowledge_Beliefs_and_Culture_Intersect","266882704_Computer_Science_Unplugged_school_students_doing_real_computing_without_computers","321512261_Those_who_Understand_Knowledge_Growth_in_Teaching","292759591_Curriculum_Perspectives_An_Introduction","288957532_Qualitative_content_analysis_Forum_Qualitative_Social_Research_Theories_Methods_Applications","266655059_Adoption_of_new_computer_science_high_school_standards_by_New_Zealand_teachers"]}