{"id":"301335208_Regular_Queries_on_Graph_Databases","abstract":"Graph databases are currently one of the most popular paradigms for storing data. One of the key conceptual differences between graph and relational databases is the focus on navigational queries that ask whether some nodes are connected by paths satisfying certain restrictions. This focus has driven the definition of several different query languages and the subsequent study of their fundamental properties. We define the graph query language of Regular Queries, which is a natural extension of unions of conjunctive 2-way regular path queries (UC2RPQs) and unions of conjunctive nested 2-way regular path queries (UCN2RPQs). Regular queries allow expressing complex regular patterns between nodes. We formalize regular queries as nonrecursive Datalog programs extended with the transitive closure of binary predicates. This language has been previously considered, but its algorithmic properties are not well understood. Our main contribution is to show elementary tight bounds for the containment problem for regular queries. Specifically, we show that this problem is 2Expspace-complete. For all extensions of regular queries known to date, the containment problem turns out to be non-elementary. Together with the fact that evaluating regular queries is not harder than evaluating UCN2RPQs, our results show that regular queries achieve a good balance between expressiveness and complexity, and constitute a well-behaved class that deserves further investigation.","authors":["Juan Reutter","Miguel Romero","Moshe Vardi"],"meta":["July 2017Theory of Computing Systems 61(1)","DOI:10.1007/s00224-016-9676-2"],"references":["318526911_Links_and_Paths_through_Life_Sciences_Data_Sources","305801558_Semantic_Acyclicity_on_Graph_Databases","304015294_Relative_expressive_power_of_navigational_querying_on_graphs_using_transitive_closure","312631543_Optimal_implementation_of_conjunctive_queries_in_relational_data_bases","305263241_Incomplete_information_and_dependencies_in_relational_databases","305263111_A_graphical_query_language_supporting_recursion","286182771_Containment_of_data_graph_queries","282651656_Reasonable_Highly_Expressive_Query_Languages","282379065_Regular_Path_Queries_in_Lightweight_Description_Logics_Complexity_and_Algorithms","282312102_Navigational_queries_based_on_frontier-guarded_datalog_Preliminary_results","281018220_A_Expressive_Languages_for_Path_Queries_over_Graph-Structured_Data","280852684_How_to_Best_Nest_Regular_Path_Queries","268394417_Relative_Expressiveness_of_Nested_Regular_Expressions","266653831_TriAL_for_RDF_Adapting_graph_query_languages_for_RDF_data","266653731_Querying_graph_databases"]}