{"id":"301351734_The_phonology_of_sign_languages","abstract":"Compared to spoken language phonology, the field of sign language phonology is a young one, having begun in the 1960s together with research into sign languages generally. Before this point, linguists often dismissed the academic study of sign languages as manual representations of spoken languages (e.g., Bloomfield, 1933) or as iconic wholes lacking any internal structure. However, since Stokoe’s (1960) seminal work, sign language linguists have demonstrated that, as with spoken languages, sign languages have sub-lexical structure that is systematically organised and constrained. In addition though, sign languages also stand in stark contrast to spoken languages because they are produced in the visual-gestural modality and therefore the articulators involved in phonological organisation are extremely different. Within this chapter, we provide an introduction to the field of sign language phonology and a selective overview of contributions to date. We also highlight key areas that have attracted much debate amongst sign language linguists such as the development of phonological models, the effect of modality on phonology, and the relationship between sign language and gesture. Towards the end of our chapter, we describe new contributions to the field which have the potential to further illuminate our understanding of sign language phonology in the future. Our description will be centred around two unrelated sign languages: American Sign Language (ASL) and British Sign Language (BSL), though many of the patterns here have been described for other sign languages as well. This chapter’s concluding note emphasises that in order to understand phonology, one must consider sign languages.","authors":["jordan Fenlon","Diane Brentari","Kearsy Cormier"],"meta":["April 2017","In book: Routledge Handbook of Phonological Theory.Publisher: RoutledgeEditors: Anna Bosch"],"references":["284557631_Do_signers_gesture","271841192_Perceptual_Categorization_of_Handling_Handshapes_in_British_Sign_Language","318494274_Auditory_Scene_Analysis_The_Perceptual_Organization_of_Sound","316232643_Categorical_versus_gradient_properties_of_handling_handshapes_in_British_Sign_Language_BSL_Evidence_from_handling_handshape_perception_and_production_by_deaf_BSL_signers_and_hearing_speakers","311585788_Are_dynamic_features_required_in_signs","306203109_Native_and_foreign_vocabulary_in_American_Sign_Language_A_lexicon_with_multiple_origins","291161883_The_Syntax_of_American_Sign_Language_Functional_Categories_and_Hierarchical_Structure","285787841_Perspectives_on_Classifier_Constructions_in_Sign_Languages","270152619_The_Computer_and_the_Mind_An_Introduction_to_Cognitive_Science","269877460_Cognitive_Cultural_and_Linguistic_Sources_of_a_Handshape_Distinction_Expressing_Agentivity"]}