{"id":"301304974_Uso_del_avatar_en_el_proceso_de_ensenanza-aprendizaje_sobre_las_aplicaciones_de_las_derivadas_Avatar_use_in_the_process_of_learning_on_applications_of_derivatives","abstract":"Today, universities in Mexico are implementing various educational projects aimed at improving the teaching-learning process. For this reason, teachers are living in an era characterized by the improvement of their knowledge, skills and attitudes in pedagogical and technological areas. In fact, these higher level educational institutions are promoting the construction and use of various computer applications in order to develop skills in students. Under this scenario, the teacher in charge of the subject \"Basic Mathematics for Business\" has decided to use the latest technology to improve the conditions prevailing in the classroom through the creation of the System for Teaching and Learning of Mathematics (STLM), which proposes the use of the avatar and usability as a means to facilitate the assimilation and reuse of knowledge of the derivatives. STLM architecture consists of the web interface and adaptation, questionnaire and audiovisual content modules. Also, this research evaluates the impact of this system on a university located in the south of the Federal District, Mexico by the quantitative approach. This study uses a sample of 45 students using the STLM during the classroom course 2015-2, which are analyzed by descriptive statistics and ANOVA. Finally, this research proposes a technological alternative to the educational process in the area of mathematics.","authors":["Ricardo Adán Salas Rueda","José De Jesús Vázquez Estupiñán","José Luis Lugo García"],"meta":["March 2016","DOI:10.15198/seeci.2016.39.72-88"],"references":["279035817_Young_Learners'_Objectives_Related_to_Multimedia_Use_and_Homework_Completion","258933124_Medios_Digitales_en_Ecuador_Perpectivas_de_futuro","39707142_Using_avatars_and_virtual_environments_in_learning_What_do_they_have_to_offer","333878814_Un_estudio_sobre_cambios_planificados_en_la_ensenanza_universitaria_origen_y_desarrollo_de_las_innovaciones_educativas_A_study_of_planned_changes_in_university_instruction_Origins_and_development_of_e","286304665_An_empathic_avatar_in_a_computer-aided_learning_program_to_encourage_and_persuade_learners","272911130_Use_of_Multimedia_as_a_New_Educational_Technology_Tool-A_Study","272647307_Mundos_virtuales_y_avatares_como_nuevas_formas_educativas"]}