{"id":"301377094_Students_Want_to_Create_Apps","abstract":"Computational Thinking (CT) is recognised as one of the fundamental skills of all graduates. Nevertheless, some issues can emerge when trying to introduce CT into schools; for example, teachers might not be willing to add topics to their intensive syllabi. Therefore, out-of-school venues such as summer schools can be considered a great opportunity for exposure to CT. Moreover, summer schools allow students to meet first hand researchers and help them pursue their interest far from the regular school climate. High school students in general are very curious for the creation of mobile apps; however, most of them get discouraged because they perceive this activity as a very difficult task. Here we describe the MobileDev summer school, a one-week training and hands-on experience in current topics of software development for mobile devices. The curiosity of the students for developing mobile apps is used to introduce and train CT via programming mobile applications through exercises (also with \"pen and paper'\") of increasing difficulty. The school was repeated twice at our university and was targeted to a reduced class of students concluding the third and the fourth year of high school. Participants were in total 19 and coming from different types of schools. This paper describes the structure of MobileDev and discusses the results to provide directions for further research.","authors":["Ilenia Fronza","Nabil El Ioini","Luis Corral"],"meta":["September 2015","DOI:10.1145/2808006.2808033","Conference: the 16th Annual Conference"],"references":["354582893_THE_ASSESSMENT_OF_MOBILE_COMPUTATIONAL_THINKING","274377900_Computational_Thinking","274309848_Computational_Thinking","265797241_New_frameworks_for_studying_and_assessing_the_development_of_computational_thinking","258134754_Computational_Thinking_in_K-12_A_Review_of_the_State_of_the_Field","254462492_Infusing_computational_thinking_into_the_middle-_and_high-school_curriculum","254006849_The_fairy_performance_assessment_Measuring_computational_thinking_in_middle_school","247924673_Bringing_computational_thinking_to_K-12_what_is_Involved_and_what_is_the_role_of_the_computer_science_education_community","312940415_Computational_Thinking_Teacher_Resources","273298470_Democratizing_Computing_with_APP_Inventor"]}