{"id":"301313915_Topic_discovery_and_future_trend_forecasting_for_texts","abstract":"Finding topics from a collection of documents, such as research publications, patents, and technical reports, is helpful for summarizing large scale text collections and the world wide web. It can also help forecast topic trends in the future. This can be beneficial for many applications, such as modeling the evolution of the direction of research and forecasting future trends of the IT industry. In this paper, we propose using association analysis and ensemble forecasting to automatically discover topics from a set of text documents and forecast their evolving trend in a near future. In order to discover meaningful topics, we collect publications from a particular research area, data mining and machine learning, as our data domain. An association analysis process is applied to the collected data to first identify a set of topics, followed by a temporal correlation analysis to help discover correlations between topics, and identify a network of topics and communities. After that, an ensemble forecasting approach is proposed to predict the popularity of research topics in the future. Our experiments and validations on data with 9 years of publication records validate the effectiveness of the proposed design.","authors":["Jose L. Hurtado","Ankur Agarwal","Xingquan Zhu"],"meta":["April 2016Journal of Big Data 3(1)","DOI:10.1186/s40537-016-0039-2"],"references":["322715583_Data_Mining_practical_machine_learning_tools_and_techniques","313385761_Data_Mining_Practical_Machine_Learning_Tools_and_Techniques","303802749_Indexing_by_Latent_Semantic_Analysis","303100964_Probabilistic_topic_models_Handb_Latent_Semant","301416077_Topic_Discovery_and_Future_Trend_Prediction_Using_Association_Analysis_and_Ensemble_Forecasting","301407437_Who_wrote_this_paper_Learning_for_authorship_de-identification_using_stylometric_featuress","299840437_Graph-Based_Methods_for_Clustering_Topics_of_Interest_in_Twitter","271436871_Topics_over_time","262288745_Intuitive_Topic_Discovery_by_Incorporating_Word-Pair's_Connection_Into_LDA","262157385_Latent_Dirichlet_Allocation"]}