{"id":"301331448_An_Efficient_User_Verification_System_Using_Angle-Based_Mouse_Movement_Biometrics","abstract":"Biometric authentication verifies a user based on its inherent, unique characteristics - who you are. In addition to physiological biometrics, behavioral biometrics has proven very useful in authenticating a user. Mouse dynamics, with their unique patterns of mouse movements, is one such behavioral biometric. In this article, we present a user verification system using mouse dynamics, which is transparent to users and can be naturally applied for continuous reauthentication. The key feature of our system lies in using much more fine-grained (point-by-point) angle-based metrics of mouse movements for user verification. These new metrics are relatively unique from person to person and independent of a computing platform. Moreover, we utilize support vector machines (SVMs) for quick and accurate classification. Our technique is robust across different operating platforms, and no specialized hardware is required. The efficacy of our approach is validated through a series of experiments, which are based on three sets of user mouse movement data collected in controllable environments and in the field. Our experimental results show that the proposed system can verify a user in an accurate and timely manner, with minor induced system overhead.","authors":["Nan Zheng","Aaron Paloski","Haining Wang"],"meta":["April 2016ACM Transactions on Information and System Security 18(3):1-27","DOI:10.1145/2893185"],"references":["260925814_A_behavioral_biometric_system_based_on_human-computer_interaction","239443670_Biometric_Authentication_Revisited_Understanding_the_Impact_of_Wolves_in_Sheep's_Clothing","307881957_LIBSVM_A_library_for_support_vector_machines","285278428_Text_Categorization_with_Support_Vector_Machines_Learning_with_Many_Relevant_Features","278651717_The_Nature_of_Statistical_Learning_Theory","261243179_Continuous_authentication_for_mouse_dynamics_A_pattern-growth_approach","260299622_User_Authentication_Through_Mouse_Dynamics","243763580_The_Nature_Of_Statistical_Learning_Theory","239546749_Statistical_Learning_Theory","234809096_Biometric_Systems_Technology_Design_and_Performance_Evaluation"]}