{"id":"301375892_Automatic_Extraction_of_Data_from_Bar_Charts","abstract":"Scientific charts are an effective tool to visualize numerical data trends. They appear in a wide range of contexts, from experimental results in scientific papers to statistical analyses in business reports. The abundance of scientific charts in the web has made it inevitable for search engines to include them as indexed content. However, the queries based on only the textual data used to tag the images can limit query results. Many studies exist to address the extraction of data from scientific diagrams in order to improve search results. In our approach to achieving this goal, we attempt to enhance the semantic labeling of the charts by using the original data values that these charts were designed to represent. In this paper, we describe a method to extract data values from a specific class of charts, bar charts. The extraction process is fully automated using image processing and text recognition techniques combined with various heuristics derived from the graphical properties of bar charts. The extracted information can be used to enrich the indexing content for bar charts and improve search results. We evaluate the effectiveness of our method on bar charts drawn from the web as well as charts embedded in digital documents.","authors":["Rabah A. Al-Zaidy","C. Lee Giles"],"meta":["October 2015","DOI:10.1145/2815833.2816956","Conference: the Knowledge Capture Conference"],"references":["220924978_Getting_Computers_to_See_Information_Graphics_So_Users_Do_Not_Have_to","220877301_ReVision_Automated_classification_analysis_and_redesign_of_chart_images","305865259_DiagramFlyer_A_Search_Engine_for_Data-Driven_Diagrams","257851159_Text_detection_in_chart_images","220998323_Model-Based_Chart_Image_Recognition","220924228_Automatic_extraction_of_table_metadata_from_digital_documents","220181207_A_Robust_Algorithm_for_Text_String_Separation_from_Mixed_TextGraphics_Images","4214813_Associating_text_and_graphics_for_scientific_chart_understanding"]}