{"id":"301340622_Physical_Computation_A_Mechanistic_Account","abstract":"This book articulates and defends a mechanistic account of concrete, or physical, computation. A physical system is a computing system just in case it is a mechanism one of whose functions is to manipulate vehicles based solely on differences between different portions of the vehicles according to a rule defined over the vehicles. Six desiderata to be satisfied by an account of concrete computation are set out: 1) objectivity; 2) explanation; 3) the right things compute; 4) the wrong things don’t compute; 5) miscomputation is explained; and 6) taxonomy. The book discusses previous accounts of computation and argues that the mechanistic account satisfies the desiderata better than competing accounts. Many kinds of computation are explicated, such as digital vs. analog, serial vs. parallel, neural network computation, program-controlled computation, and more. The book argues that computation does not entail representation or information processing although information processing entails computation. Pancomputationalism, according to which every physical system is computational, is rejected as trivial insofar as true; false insofar as nontrivial. A modest version of the physical Church-Turing thesis, according to which any function that is physically computable is computable by Turing machines, is defended. A hypercomputer is a system that yields the values of a Turing-uncomputable function. If a genuine hypercomputer were physically constructible and reliable, it would refute the modest Physical Church-Turing Thesis. Proposed counterexamples to the Physical Church-Turing thesis are still far from falsifying it, however, because they have not been shown to be physically constructible and reliable.","authors":["Gualtiero Piccinini"],"meta":["August 2015","DOI:10.1093/acprof:oso/9780199658855.001.0001","Publisher: Oxford University PressEditor: Peter MomtchiloffISBN: 9780199658855"],"references":[]}