{"id":"301428628_SAFEWAPI_web_API_misuse_detector_for_web_applications","abstract":"The evolution of Web 2.0 technologies makes web applications prevalent in various platforms including mobile devices and smart TVs. While one of the driving technologies of web applications is JavaScript, the extremely dynamic features of JavaScript make it very difficult to define and detect errors in JavaScript applications. The problem becomes more important and complicated for JavaScript web applications which may lead to severe security vulnerabilities. To help developers write safe JavaScript web applications using vendor-specific Web APIs, vendors specify their APIs often in Web IDL, which enables both API writers and users to communicate better by understanding the expected behaviors of the Web APIs. In this paper, we present SAFEWAPI, a tool to analyze Web APIs and JavaScript web applications that use the Web APIs and to detect possible misuses of Web APIs by the web applications. Even though the JavaScript language semantics allows to call a function defined with some parameters without any arguments, platform developers may require application writers to provide the exact number of arguments. Because the library functions in Web APIs expose their intended semantics clearly to web application developers unlike pure JavaScript functions, we can detect wrong uses of Web APIs precisely. For representative misuses of Web APIs defined by software quality assurance engineers, our SAFEWAPI detects such misuses in real-world JavaScript web applications.","authors":["SungGyeong Bae","Hyunghun Cho","Inho Lim","Sukyoung Ryu"],"meta":["November 2014","DOI:10.1145/2635868.2635916","Conference: the 22nd ACM SIGSOFT International Symposium"],"references":["261464432_An_Empirical_Study_of_Client-Side_JavaScript_Bugs","221496463_Recency_Types_for_Analyzing_Scripting_Languages","221477533_Type_Analysis_for_JavaScript","221477302_Interprocedural_Analysis_with_Lazy_Propagation","213879151_Towards_Type_Inference_for_JavaScript","262153381_ADsafety_Type-Based_Verification_of_JavaScript_Sandboxing","221631843_Isolating_JavaScript_with_Filters_Rewriting_and_Wrappers","221022144_Using_static_analysis_for_AJAX_intrusion_detection","220751815_Staged_Information_Flow_for_JavaScript","220713548_Object_Capabilities_and_Isolation_of_Untrusted_Web_Applications"]}