{"id":"301444121_Creating_Corpora_for_Computational_Research_in_Arab-Andalusian_Music","abstract":"Research corpora are fundamental for the computational study of music. The design criteria with which to create them is a research task in itself. These corpora need to be well suited for the specific research problems to be addressed. Since these research problems are also shaped by musical, cultural and other specific aspects of the music traditions to be studied, the research corpora should take these specificities into account. In this paper we address the problems of creating corpora for computational research on Arab-Andalusian music, considering several relevant criteria for creating such corpora. We focus on the problems raised during the annotation process of the corpora, specifically the language issues surrounding this art music tradition. Following the criteria, we created a research corpus consisting of audio recordings with their corresponding metadata, lyrics and music scores. So far we have gathered 338 recordings from 3 different Arab-Andalusian music schools of Morocco, covering most of the musical modes, rhythms and forms of this art music tradition. The Arab-Andalusian corpus is accessible to the research community from a central online repository. Moreover, the audio recordings of this corpora are freely available through the Internet Archive repository. The Arab-Andalusian corpus can be used to generate test datasets, which can be used as ground truth to test several computational research tasks.","authors":["Mohamed Sordo","Amin Chaachoo","Xavier Serra"],"meta":["September 2014","DOI:10.1145/2660168.2660182","Conference: the 1st International Workshop"],"references":["220816874_Arabic_Diacritization_through_Full_Morphological_Tagging","220723656_The_Million_Song_Dataset","220723199_A_Multicultural_Approach_in_Music_Information_Research","289422008_Creating_research_corpora_for_the_computational_study_of_music_The_case_of_the_CompMusic_project","281328191_Towards_a_better_Definition_of_Annotated_MIR_Corpora","272785879_Corpora_for_Music_Information_Research_in_Indian_Art_Music","266316509_The_World's_Writing_Systems","262214207_Dunya_A_System_for_Browsing_Audio_Music_Collections_Exploiting_Cultural_Context","242571443_Developing_Linguistic_Corpora_a_Guide_to_Good_Practice","220873450_Maximum_Entropy_Based_Restoration_of_Arabic_Diacritics","2537525_Designing_a_Speech_Corpus_for_Instance-based_Spoken_Language_Generation"]}