{"id":"301463457_Usability_and_Usage_of_Interactive_Features_in_an_Online_Ebook_for_CS_Teachers","abstract":"There are too few secondary school computing teachers to meet international needs for growing secondary school computing education. Our group has created an ebook to help prepare secondary teachers to teach the programming and big data concepts in the new AP Computer Science Principles course. The ebook was designed using principles from educational psychology, specifically worked examples and cognitive load. The ebook interleaves worked examples and interactive practice activities, which we believe will lead to more efficient and effective learning than more typical approaches to learning programming. This paper reports the results from initial studies of our ebook. First, we conducted a usability study comparing three different ebook platforms. Next, we conducted a study of teacher use of the ebook. Ten teachers worked through the first eight chapters of the ebook at their own pace. Five of the ten teachers completed the first eight chapters which is a 50% completion rate. Significantly, teachers who used more of the interactive features in the ebook did better on the post-tests and reported higher confidence in their ability to teach the material than teachers who used few of the interactive features.","authors":["Barbara Ericson","Steven Moore","Briana B. Morrison","Mark Guzdial"],"meta":["November 2015","DOI:10.1145/2818314.2818335","Conference: the Workshop in Primary and Secondary Computing Education"],"references":["284097727_Making_things_hard_on_yourself_but_in_a_good_way_Creating_desirable_difficulties_to_enhance_learning","266653459_CS_principles_development_and_evolution_of_a_course_and_a_community","262405861_Towards_a_conceptualization_of_pedagogical_content_knowledge_for_computer_science","262393281_How_video_production_affects_student_engagement_An_empirical_study_of_MOOC_videos","344532674_Effectiveness_of_Online_Textbooks_vs_Interactive_Web-Native_Content","308167244_Retention_and_intention_in_massive_open_online_courses_In_depth","301429173_Preparing_teachers_is_different_than_preparing_software_developers","290676634_Effectiveness_of_online_textbooks_vs_Interactive_web-native_content","279039485_Meeting_Student_and_Teacher_Needs_in_Computing_Education","262402170_Developing_a_highly_interactive_ebook_for_CS_instruction"]}