{"id":"301429315_The_network_of_teaching_excellence_in_computer_science_and_master_teachers","abstract":"The current focus on computer science in the school curriculum in many countries has led to concerns about how teachers will manage this change and rise to the challenge of the new curriculum. In-service teachers have a need for professional development in computer science, both to develop their subject knowledge and their pedagogical skills.\nComputing at School (CAS) has established a professional development programme called the Network of Teaching Excellence in Computer Science (NoE) to support the Computing curriculum changes in England. This programme use a model of training \"Master Teachers\", who are teachers with expertise in computer science as well as skills to impart this to other teachers; this model focuses on local, face-to-face, peer-to-peer delivery. Master Teachers run professional development sessions in their own schools at low cost, and offer support to their local community of teachers. The vision is that any teacher who needs to develop their skills in computer science has access to a particular individual with expertise who can support them. This paper describes the impact of the first full year of this programme on the computer science subject knowledge of teachers who have worked with Master Teachers.","authors":["Sue Sentance","Simon Humphreys","Mark Dorling"],"meta":["November 2014","DOI:10.1145/2670757.2670789","Conference: the 9th Workshop in Primary and Secondary Computing Education","Project: Professional Development for Computing teachers"],"references":["279636501_QDA_Miner_32_with_WordStat_and_Simstat_Distinguishing_features_and_functions","320780742_Models_of_Continuing_Professional_Development_A_framework_for_analysis","313395750_Computing_at_school_an_emergent_community_of_practice_for_a_re-emergent_subject","288957532_Qualitative_content_analysis_Forum_Qualitative_Social_Research_Theories_Methods_Applications","280083135_Computer_Science_at_School_CS_Teacher_Education_-_Koli_Working-group_report_on_CS_at_School","274998933_What_Works_in_Professional_Development","270697856_Building_a_Virtual_Community_of_Practice_for_K-12_CS_Teachers","269033725_A_model_for_high_school_computer_science_education","266655059_Adoption_of_new_computer_science_high_school_standards_by_New_Zealand_teachers","264543793_Restart_The_Resurgence_of_Computer_Science_in_UK_Schools"]}