{"id":"301444822_Detection_of_Top-K_Central_Nodes_in_Social_Networks_A_Compressive_Sensing_Approach","abstract":"In analysing the structural organization of a social network, identifying important nodes has been a fundamental problem. The concept of network centrality deals with the assessment of the relative importance of a particular node within the network. Most of the traditional network centrality definitions have a high computational cost and require full knowledge of network topological structure. On the one hand, in many applications we are only interested in detecting the top-k central nodes of the network with the largest values considering a specific centrality metric. On the other hand, it is not feasible to efficiently identify central nodes in a large real-world social network via calculation of centrality values for all nodes. As a result, recent years have witnessed increased attention toward the challenging problem of detecting top k central nodes in social networks with high accuracy and without full knowledge of network topology. To this end, we in this paper present a compressive sensing approach, called CS-TopCent, to efficiently identify such central nodes as a sparsity specification of social networks. Extensive simulation results demonstrate that our method would converge to an accurate solution for a wide range of social networks.","authors":["Hamidreza Mahyar"],"meta":["August 2015","DOI:10.1145/2808797.2808811","Conference: the 2015 IEEE/ACM International Conference"],"references":["262916325_On_the_Local_Approximations_of_Node_Centrality_in_Internet_Router-Level_Topologies","261341847_UCS-WN_An_unbiased_compressive_sensing_framework_for_weighted_networks","260340466_Evaluation_of_node_importance_in_complex_networks","258442198_Practical_Characterization_of_Large_Networks_Using_Neighborhood_Information","257801174_Identifying_high_betweenness_centrality_nodes_in_large_social_networks","329475599_Regression_Shrinkage_and_Selection_Via_the_Lasso","304824205_Regression_Shrinkage_and_Selection_via_the_LASSO","261312131_UCS-NT_An_unbiased_compressive_sensing_framework_for_Network_Tomography","261011327_Ranking_the_spreading_influence_in_complex_networks","257218570_Identifying_all-around_nodes_for_spreading_dynamics_in_complex_networks"]}