{"id":"301462083_Gaze_vs_Mouse_A_Fast_and_Accurate_Gaze-Only_Click_Alternative","abstract":"\" Eye gaze tracking is a promising input method which is gradually finding its way into the mainstream. An obvious question to arise is whether it can be used for point-and-click tasks, as an alternative for mouse or touch. Pointing with gaze is both fast and natural, although its accuracy is limited. There are still technical challenges with gaze tracking, as well as inherent physiological limitations. Furthermore, providing an alternative to clicking is challenging.\nWe are considering use cases where input based purely on gaze is desired, and the click targets are discrete user interface (UI) elements which are too small to be reliably resolved by gaze alone, e.g., links in hypertext. We present Actigaze, a new gaze-only click alternative which is fast and accurate for this scenario. A clickable user interface element is selected by dwelling on one of a set of confirm buttons, based on two main design contributions: First, the confirm buttons stay on fixed positions with easily distinguishable visual identifiers such as colors, enabling procedural learning of the confirm button position. Secondly, UI elements are associated with confirm buttons through the visual identifiers in a way which minimizes the likelihood of inadvertent clicks. We evaluate two variants of the proposed click alternative, comparing them against the mouse and another gaze-only click alternative.","authors":["Christof Lutteroth","Moiz Penkar","Gerald Weber"],"meta":["November 2015","DOI:10.1145/2807442.2807461","Conference: the 28th Annual ACM Symposium"],"references":["319394819_SUS_--_a_quick_and_dirty_usability_scale","300545066_Eyes_and_Keys_An_Evaluation_of_Click_Alternatives_Combining_Gaze_and_Keyboard","299697853_Eyes_Only_Navigating_Hypertext_with_Gaze","262244059_Designing_for_the_eye_Design_parameters_for_dwell_in_gaze_interaction","298976884_On_Object_Selection_in_Gaze_Controlled_Environments","262292287_Pursuit_calibration_Making_gaze_calibration_less_tedious_and_more_flexible","246111301_Evaluation_of_Eye_Gaze_Interaction_Techniques","242673856_Selection_By_Looking_A_Novel_Computer_Interface_And_Its_Application_To_Psychological_Research","234820692_An_evaluation_of_an_eye_tracker_as_a_device_for_computer_input2","229880515_A_System_for_Web_Browsing_by_Eye-Gaze_Input"]}