{"id":"301422420_Using_App_inventor_history_as_a_gateway_to_engage_African_American_students_in_computer_science","abstract":"Unlike enrollment in undergraduate computer science degree programs, there are no gender or ethnic imbalances in K-12 enrollment. While such disparities are seen at particular schools, such disparities do not exist in disciplinary courses such as history, math, or science where all students are required to take these courses. This paper discusses an approach to broaden minority participation in computing through the integration of Computer Science (CS) into a history course. This poster proposes an alignment between computational thinking and historical thinking that makes history courses an attractive fit for CS integration. It also presents results from the pilot study of a project-based cross-disciplinary curriculum using MIT App inventor that leverages students' interests in mobile technology to facilitate the creation of historical mobile apps. This curricular approach is built on a theoretical framework rooted in Constructivist and Constructionist learning where students construct and produce knowledge, artifacts, and technology rather than consume them. Our initial results suggest that students were engaged in the material and were enthusiastic about the creation of their mobile app.","authors":["Yerika Jimenez","Christina Gardner-McCune"],"meta":["August 2015","DOI:10.1109/RESPECT.2015.7296512","Conference: 2015 Research in Equity and Sustained Participation in Engineering, Computing, and Technology (RESPECT)","Project: WATCH - CT and Historical Thinking"],"references":["270170608_Diaspora_Literacy_and_Consciousness_in_the_Struggle_Against_Miseducation_in_the_Black_Community","247924673_Bringing_computational_thinking_to_K-12_what_is_Involved_and_what_is_the_role_of_the_computer_science_education_community","347493881_Interpreting_National_History_Race_Identity_and_Pedagogy_in_Classrooms_and_Communities","324373353_Mindstorms_Children_Computers_and_Powerful_Ideas","275789985_Lies_My_Teacher_Told_Me_Everything_Your_American_History_Textbook_Got_Wrong","261717049_Re-discovering_and_re-creating_African_American_historical_accounts_through_mobile_apps_The_role_of_mobile_technology_in_history_education","30874242_Pianos_Not_Stereos_Creating_Computational_Construction_Kits"]}