{"id":"301444833_Does_the_choice_of_the_first_programming_language_influence_students'_grades","abstract":"There are many factors and concerns surrounding the choice of the first programming language to be taught in ICT studies, both didactical and pedagogical, as well as business and technology-driven. After reviewing the currently predominant programming paradigms adopted in introductory programming courses and describing our approach based on decades of teaching practice, we present our recent experience in changing the first programming language from Modula-2 to Java. The question we focus on is whether there are any significant differences in student success between the most recent generation taught in Java, and previous Modula-2 generations. Statistical analysis of collected scores and grades can provide insight into the effects of the change of language since there were not many other factors distinguishing the generations. Comparisons involving two non-parametric statistical tests showed that there are no statistically significant differences between the considered generations with respect to success in passing the exam. This result suggests that the choice of the introductory programming language does not matter if we use students' performance as the criterion of suitability.","authors":["Mirjana Ivanovic","Zoran Budimac","Milos Radovanovic","Miloš Savić"],"meta":["June 2015","DOI:10.1145/2812428.2812448","Conference: the 16th International Conference"],"references":["265630430_The_role_of_programming_paradigms_in_the_first_programming_courses","253318562_Choosing_the_Best_Programming_Language","220145812_Why_Java_is_notmy_favorite_first-course_language","260829004_First_Programming_Language_-_Never-ending_Story","38367882_On_a_Test_of_Whether_one_of_Two_Random_Variables_is_Stochastically_Larger_than_the_Other","38367783_On_the_Kolmogorov-Smirnov_Limit_Theorems_for_Empirical_Distributions","38367658_Errata_On_the_Kolmogorov-Smirnov_Limit_Theorems_for_Empirical_Distributions"]}