{"id":"301452851_Culturally_Responsive_Making_with_American_Indian_Girls_Bridging_the_Identity_Gap_in_Crafting_and_Computing_with_Electronic_Textiles","abstract":"The Maker Movement has been successful in refocusing attention on the value of hand work, but heritage craft practices remain noticeably absent. We argue that combining heritage craft practices, like those found in many American Indian communities throughout the United States, with maker practices presents an opportunity to examine a rich, if contentious space, where different cultural systems come together. Further, we argue that the combination of heritage crafts, maker practices, and computing provides an opportunity to address the \"identity gap\" experienced by many girls and individuals from non-dominant communities, who struggle with taking on the identity of a \"scientist.\" In this paper, we focus on the experiences of twenty-six American Indian girls (12--14 years-old) who participated in a three week, culturally responsive e-textiles unit as part of their Native Studies class at a tribally-controlled charter school located just outside of Phoenix, Arizona. In order to understand if the combination of a tangible design element with computing and cultural knowledge would be a promising activity for attracting American Indian girls to computing, our analysis focused on students' initial engagement with e-textiles materials and activities, their agency in designing and making e-textiles artifacts, and the ways in which e-textile artifacts fostered connections across home and school spaces.","authors":["Kristin Searle","Yasmin B. Kafai"],"meta":["April 2015","DOI:10.1145/2807565.2807707","Conference: the Third Conference"],"references":["314412057_Ethnocomputing_with_Native_American_Design","279741759_Indigenous_Knowledges_and_the_Story_of_the_Bean","264473018_Saving_Face_While_Geeking_Out_Video_Game_Testing_as_a_Justification_for_Learning_Computer_Science","262345969_Beyond_access_Broadening_participation_in_high_school_computer_science","262314073_Toward_Culturally_Responsive_Computing_Education","305389454_Institutional_Ecology_'Translations'_and_Boundary_Objects_Amateurs_and_Professionals_in_Berkeley's_Museum_of_Vertebrate_Zoology","289830043_Functional_aesthetics_for_learning_Creative_tensions_in_youth_e-textile_designs","283973733_Ka_ulana_'ana_i_ka_piko_In_Weaving_You_Begin_at_the_Center_Perspectives_from_a_Culturally_Specific_Approach_to_Art_Education","274426728_Unlocking_the_clubhouse","274104484_Weaving_New_Worlds_Southeastern_Cherokee_Women_and_Their_Basketry"]}