{"id":"301509396_Kurumsal_Iletisim_Araci_Olarak_Web_Bilisim_Sistemlerinin_Kullanilabilirliginde_Teknoloji_Kabulu_Hastane_Web_Sitelerine_Yonelik_Bir_Arastirma","abstract":"New communication technologies have brought new developments in the corporate communication field that is seen as one of the management functions. Web based information systems have been used for corporate communication purposes and corporate web sites have been used not only for advertisement but also for services that enables interactivity. Usability of web based applications is defined as a quality factor that is as important as reliability and security. The easiness and difficulties that users experienced when they use the application, show the success or failure of these systems. In this study, a research is conducted to determine the effects of users’ acceptance and use of Internet technologies on their evaluation about hospital web sites’ usability, within the developed model. The relationship between Unified Theory of Acceptance and Use of Technology (UTAUT) factors and Website Analysis and Measurement Inventory (WAMMI) factors are evaluated within the model. The survey included demographic questions (5 questions), questions regarding use of hospital web sites, WAMMI scale, and UTAUT scale. The results reveals a direct relationship between usability and control, learnability, effectiveness and efficiency, satisfaction factors and usability of web sites. The results also show that users’ acceptance of Internet effects their perception of web sites’ usability at a low level. Users’ attitudes about Internet, qualifications and skills for using Internet should be considered while evaluating usability of corporate web sites.\nKey Words: Technology acceptance, usability, hospital web sites, corporate communication.","authors":["Basak Mendi","Erhan Akyazı"],"meta":["April 2016Gümüşhane Üniversitesi İletişim Fakültesi Elektronik Dergisi 4(1)","DOI:10.19145/guifd.75416"],"references":["341371613_Development_of_Web_Corporate_Communications_Function_by_Official_Web_Sites_and_Value_Added_Ranking_Case_of_Croatia","241674621_Revisiting_strategic_communication's_past_to_understand_the_present_Examining_the_direction_and_nature_of_communication_on_Fortune_500_and_Philanthropy_400_web_sites","323205839_Knowledge_Management_in_Practice","321197896_Structural_equation_modeling_with_LISREL_PRELIS_and_SIMPLIS_Basic_concepts_applications_and_programming","305373564_Istatistik_Tutum_Olcegi_Icin_Uygulanan_Faktor_Analizi_ve_Asamali_Kumeleme_Analizi_Sonuclarinin_Karsilastirilmasi","287100920_Management_in_the_1980's","280188778_Corporate_Communications_Theory_and_Practice","278125517_Hospital_Web_sites_Promise_and_progress","276935555_Visual_Design_for_the_Modern_Web","248528128_The_influence_of_customer_use_of_corporate_websites_Corporate_social_responsibility_trust_and_word-of-mouth_communication"]}