{"id":"301515897_Abstract_Algebraic_Logic_-_An_Introductory_Textbook","abstract":"Abstract algebraic logic is the more general and abstract side of algebraic logic, the branch of mathematics that studies the connections between logics and their algebra-based semantics. This emerging subfield of mathematical logic is increasingly becoming an indispensable tool to approach the algebraic study of any (mainly sentential) logic in a systematic way.\n\nThis book takes a bottom-up approach and guides readers, by means of successive steps of generalization and abstraction, to meet more and more complicated algebra-based semantics. An entire chapter is devoted to Blok and Pigozzi's theory of algebraizable logics, proving the main theorems and incorporating later developments by other scholars. After a chapter on the basics of the classical theory of matrices, one chapter is devoted to an in-depth exposition of the semantics of generalized matrices. Two more avanced chapters provide introductions to the two hierachies that organize the logical landscape according to the criteria of abstract algebraic logic, the Leibniz hierarchy and the Frege hierarchy. Dozens of examples of particular logics are presented and classified.\n\nThe book is addressed to mathematicians and logicians with little or no previous exposure to algebraic logic. Some acquaintance with non-classical logics is desirable. The book is written with students (or beginners in the field) in mind, and combines a textbook style in its main sections, including more than 400 carefully graded exercises, with a survey style in the discussion of newer research directions. The book includes some historical notes and numerous bibliographic references.","authors":["Josep Maria Font"],"meta":["April 2016","Publisher: College PublicationsISBN: 978-1-84890-207-7"],"references":["303696613_The_semantic_isomorphism_theorem_in_abstract_algebraic_logic","351584317_On_the_Algebraization_of_Some_Gentzen_Systems1","324394136_Recherches_sur_la_Theorie_Generale_des_Systemes_Formels","324311389_Algebraic_Logic","320089875_On_the_Leibniz_congruences","319395171_Handbook_of_Philosophical_Logic","313559887_Characterization_of_the_reduced_matrices_for_the_-fragment_of_classical_logic","312632187_Intuitionistic_logic","309158378_Paraconsistent_Logic_Consistency_Contradiction_and_Negation","304610384_Compatibility_operators_in_abstract_algebraic_logic"]}