{"id":"301508542_A_multivariate_nonlinear_mixed_effects_model_for_longitudinal_image_analysis_Application_to_amyloid_imaging","abstract":"It is important to characterize the temporal trajectories of disease-related biomarkers in order to monitor progression and identify potential points of intervention. This is especially important for neurodegenerative diseases, as therapeutic intervention is most likely to be effective in the preclinical disease stages prior to significant neuronal damage. Longitudinal neuroimaging allows for the measurement of structural, functional, and metabolic integrity of the brain over time at the level of voxels. However, commonly used longitudinal analysis approaches, such as linear mixed effects models, do not account for the fact that individuals enter a study at various disease stages and progress at different rates, and generally consider each voxelwise measure independently. We propose a multivariate nonlinear mixed effects model for estimating the trajectories of voxelwise neuroimaging biomarkers from longitudinal data that accounts for such differences across individuals. The method involves the prediction of a progression score for each visit based on a collective analysis of voxelwise biomarker data within an expectation-maximization framework that efficiently handles large amounts of measurements and variable number of visits per individual, and accounts for spatial correlations among voxels. This score allows individuals with similar progressions to be aligned and analyzed together, which enables the construction of a trajectory of brain changes as a function of an underlying progression or disease stage. Application of our method to studying images of beta-amyloid deposition, a hallmark of preclinical Alzheimer's disease, suggests that precuneus is the earliest cortical region to accumulate amyloid. The proposed method can be applied to other types of longitudinal imaging data, including metabolism, blood flow, tau, and structural imaging-derived measures.","authors":["Murat Bilgel","Jerry Prince","Dean F Wong","Susan M. Resnick"],"meta":["April 2016NeuroImage 134","DOI:10.1016/j.neuroimage.2016.04.001"],"references":["301571714_Learning_Biomarker_Models_for_Progression_Estimation_of_Alzheimer's_Disease","284137964_Individual_estimates_of_age_at_detectable_amyloid_onset_for_risk_factor_assessment","280587321_A_Mixed-Effects_Model_with_Time_Reparametrization_for_Longitudinal_Univariate_Manifold-Valued_Data","280587235_Temporal_Trajectory_and_Progression_Score_Estimation_from_Voxelwise_Longitudinal_Imaging_Measures_Application_to_Amyloid_Imaging","280242931_Estimating_Anatomical_Trajectories_with_Bayesian_Mixed-Effects_Modeling","279753649_Deformation_field_correction_for_spatial_normalization_of_PET_images","312977847_Neuropahological_staging_of_Alzheimer-related_changes","284688338_Neuropathological_stageing_of_Alzheimer-related_neurofibrillary_changes","280587232_Multi-stage_Biomarker_Models_for_Progression_Estimation_in_Alzheimer's_Disease","279384022_Linear_Model_with_Fixed_Effects_and_Correlated_Errors"]}