{"id":"301599296_Raising_the_Odds_of_Success_The_Current_State_of_Experimentation_in_Product_Development","abstract":"Context: An experiment-driven approach to software product and service development is gaining increasing attention as a way to channel limited resources to the efficient creation of customer value. In this approach, software capabilities are developed incrementally and validated in continuous experiments with stakeholders such as customers and users. The experiments provide factual feedback for guiding subsequent development.\nObjective: This paper explores the state of the practice of experimentation in the software industry. It also identifies the key challenges and success factors that practitioners associate with the approach.\nMethod: A qualitative survey based on semi-structured interviews and thematic coding analysis was conducted. Ten Finnish software development companies, represented by thirteen interviewees, participated in the study.\nResults: The study found that although the principles of continuous experimentation resonated with industry practitioners, the state of the practice is not yet mature. In particular, experimentation is rarely systematic and continuous. Key challenges relate to changing the organizational culture, accelerating the development cycle speed, and finding the right measures for customer value and product success. Success factors include a supportive organizational culture, deep customer and domain knowledge, and the availability of the relevant skills and tools to conduct experiments.\nConclusions: It is concluded that the major issues in moving towards continuous experimentation are on an organizational level; most significant technical challenges have been solved. An evolutionary approach is proposed as a way to transition towards experiment-driven development.","authors":["Eveliina Lindgren","Jürgen Münch"],"meta":["April 2016Information and Software Technology 77","DOI:10.1016/j.infsof.2016.04.008"],"references":["303131534_Climbing_the_stairway_to_heaven_-_A_mulitiple-case_study_exploring_barriers_in_the_transition_from_agile_development_towards_continuous_deployment_of_software","295251406_Towards_Data-Driven_Product_Development_A_Multiple_Case_Study_on_Post-Deployment_Data_Usage_in_Software-Intensive_Embedded_Systems","295148515_From_Opinions_to_Data-Driven_Software_RD_A_Multi-case_Study_on_How_to_Close_the_'Open_Loop'_Problem","290920159_Towards_Customer-Centric_Software_Development_A_Multiple-Case_Study","287383715_Post-deployment_Data_Collection_in_Software-Intensive_Embedded_Products","317953648_Naturalistic_inquiry","308191336_Low_Ceremony_Processes_for_Short_Lifecycle_Projects","303237740_Managing_Food_Price_Inflation_in_Pakistan","303231914_Analysis_of_qualitative_surveys","303122181_GQMStrategies_A_comprehensive_methodology_for_aligning_business_strategies_with_software_measurement"]}