{"id":"301563575_Human-Robot_Interaction_Status_and_Challenges","abstract":"Objective: \nThe current status of human-robot interaction (HRI) is reviewed, and key current research challenges for the human factors community are described.\n\nBackground: \nRobots have evolved from continuous human-controlled master-slave servomechanisms for handling nuclear waste to a broad range of robots incorporating artificial intelligence for many applications and under human supervisory control.\n\nMethods: \nThis mini-review describes HRI developments in four application areas and what are the challenges for human factors research.\n\nResults: \nIn addition to a plethora of research papers, evidence of success is manifest in live demonstrations of robot capability under various forms of human control.\n\nConclusions: \nHRI is a rapidly evolving field. Specialized robots under human teleoperation have proven successful in hazardous environments and medical application, as have specialized telerobots under human supervisory control for space and repetitive industrial tasks. Research in areas of self-driving cars, intimate collaboration with humans in manipulation tasks, human control of humanoid robots for hazardous environments, and social interaction with robots is at initial stages. The efficacy of humanoid general-purpose robots has yet to be proven.\n\nApplications: \nHRI is now applied in almost all robot tasks, including manufacturing, space, aviation, undersea, surgery, rehabilitation, agriculture, education, package fetch and delivery, policing, and military operations.","authors":["Thomas B. Sheridan"],"meta":["April 2016Human Factors The Journal of the Human Factors and Ergonomics Society 58(4)","DOI:10.1177/0018720816644364"],"references":["257307139_Training_a_Robot_via_Human_Feedback_A_Case_Study","236324869_Ethical_Principles_For_Socially_Assistive_Robotics","225916883_Search_and_Rescue_Robotics","325681128_Trust_in_automation_Designing_for_appropriate_reliance","271041318_A_Socially_Assistive_Robot_Exercise_Coach_for_the_Elderly","267622294_A_Review_of_the_Exoskeleton_and_Human_Augmentation_Technology","262408795_Making_Adaptive_Cruise_Control_ACC_Limits_Visible","261415851_Safety_issues_in_human-robot_interactions","260623757_On_the_Human-Machine_Interaction_of_Unmanned_Aerial_System_Mission_Specialists","224582500_Supervisory_control_of_remote_manipulation"]}