{"id":"301562754_Reading_Emotions_From_Faces_in_Two_Indigenous_Societies","abstract":"That all humans recognize certain specific emotions from their facial expression-the Universality Thesis-is a pillar of research, theory, and application in the psychology of emotion. Its most rigorous test occurs in indigenous societies with limited contact with external cultural influences, but such tests are scarce. Here we report 2 such tests. Study 1 was of children and adolescents (N = 68; aged 6-16 years) of the Trobriand Islands (Papua New Guinea, South Pacific) with a Western control group from Spain (N = 113, of similar ages). Study 2 was of children and adolescents (N = 36; same age range) of Matemo Island (Mozambique, Africa). In both studies, participants were shown an array of prototypical facial expressions and asked to point to the person feeling a specific emotion: happiness, fear, anger, disgust, or sadness. The Spanish control group matched faces to emotions as predicted by the Universality Thesis: matching was seen on 83% to 100% of trials. For the indigenous societies, in both studies, the Universality Thesis was moderately supported for happiness: smiles were matched to happiness on 58% and 56% of trials, respectively. For other emotions, however, results were even more modest: 7% to 46% in the Trobriand Islands and 22% to 53% in Matemo Island. These results were robust across age, gender, static versus dynamic display of the facial expressions, and between- versus within-subjects design. (PsycINFO Database Record","authors":["Carlos Crivelli","Sergio Jarillo","James A Russell","José-Miguel Fernandez-Dols"],"meta":["April 2016Journal of Experimental Psychology General 145(7)","DOI:10.1037/xge0000172"],"references":["350442415_Culture_and_the_Expression_of_Emotion","344472410_Spontaneous_facial_behavior_during_intense_emotional_episodes_Artistic_truth_and_optical_truth","329648187_Who's_Asking_Native_Science_Western_Science_and_Science_Education","325671474_Core_Affect_and_the_Psychological_Construction_of_Emotion","312893386_Universals_and_cultural_differences_in_facial_expressions_of_emotion","312879599_The_expression_of_the_emotions_in_man_and_animals","312470224_Estimating_the_reproducibility_of_psychological_science","309314997_Applied_Logistic_Regression","292520704_Nonverbal_communication_Science_and_applications","292188919_What_Scientists_Who_Study_Emotion_Agree_About"]}