{"id":"301534693_Magnitude_knowledge_The_common_core_of_numerical_development","abstract":"The integrated theory of numerical development posits that a central theme of numerical development from infancy to adulthood is progressive broadening of the types and ranges of numbers whose magnitudes are accurately represented. The process includes four overlapping trends: (1) representing increasingly precisely the magnitudes of non-symbolic numbers, (2) connecting small symbolic numbers to their non-symbolic referents, (3) extending understanding from smaller to larger whole numbers, and (4) accurately representing the magnitudes of rational numbers. The present review identifies substantial commonalities, as well as differences, in these four aspects of numerical development. With both whole and rational numbers, numerical magnitude knowledge is concurrently correlated with, longitudinally predictive of, and causally related to multiple aspects of mathematical understanding, including arithmetic and overall math achievement. Moreover, interventions focused on increasing numerical magnitude knowledge often generalize to other aspects of mathematics. The cognitive processes of association and analogy seem to play especially large roles in this development. Thus, acquisition of numerical magnitude knowledge can be seen as the common core of numerical development. Acquisition of increasingly precise representations of the magnitudes of an increasing range of numbers is a unifying theme of numerical development from infancy to adulthood. The acquisitions involve representing increasingly precisely the magnitudes of non-symbolic numbers, connecting small symbolic numbers to their non-symbolic referents, extending understanding from smaller to larger whole numbers, and accurately representing the magnitudes of rational numbers. The precision of children's knowledge of numerical magnitudes is correlated with, predictive of, and causally related to a variety of important outcomes, including arithmetic learning.","authors":["Robert Siegler"],"meta":["May 2016Developmental Science 19(3):341-361","DOI:10.1111/desc.12395"],"references":["344484869_The_Origin_of_Concepts","343757196_Mathematics_Skills_of_17-Year-Olds_in_the_United_States_1978_to_2004","317719814_Number-space_mapping_in_the_newborn_chick_resembles_humans'_mental_number_line","316936258_Developing_conceptual_understanding_and_procedural_skill_in_mathematics_An_iterative_process","313117027_A_Study_of_History","311711183_Space_time_and_number_in_the_brain_searching_for_the_foundations_of_mathematical_thought","303463440_Effects_of_Intervention_to_Improve_At-Risk_Fourth_Graders'_Understanding_Calculations_and_Word_Problems_with_Fractions","302568109_Chapter_6_On_the_Relation_between_Numerical_and_Non-Numerical_Magnitudes","298016784_Space_Time_and_Number_in_the_Brain","295078659_Categories_of_Large_Numbers_in_Line_Estimation"]}