{"id":"301581272_Conditions_for_the_Effectiveness_of_Multiple_Visual_Representations_in_Enhancing_STEM_Learning","abstract":"Visual representations play a critical role in enhancing science, technology, engineering, and mathematics (STEM) learning. Educational psychology research shows that adding visual representations to text can enhance students’ learning of content knowledge, compared to text-only. But should students learn with a single type of visual representation or with multiple different types of visual representations? This article addresses this question from the perspective of the representation dilemma, namely that students often learn content they do not yet understand from representations they do not yet understand. To benefit from visual representations, students therefore need representational competencies, that is, knowledge about how visual representations depict information about the content. This article reviews literature on representational competencies involved in students’ learning of content knowledge. Building on this review, this article analyzes how the number of visual representations affects the role these representational competencies play during students’ learning of content knowledge. To this end, the article compares two common scenarios: text plus a single type of visual representations (T+SV) and text plus multiple types of visual representations (T+MV). The comparison yields seven hypotheses that describe under which conditions T+MV scenarios are more effective than T+SV scenarios. Finally, the article reviews empirical evidence for each hypothesis and discusses open questions about the representation dilemma.","authors":["Martina A. Rau"],"meta":["December 2017Educational Psychology Review 29(4)","DOI:10.1007/s10648-016-9365-3"],"references":["312688996_Program_visualization_and_explanation_for_novice_C_programmers","321599261_Metacognition_in_Learning_and_Instruction_Theory_Research_and_Practice","321300499_The_Cambridge_handbook_of_the_learning_sciences_second_edition","317953505_Situated_learning_Legitimate_peripheral_participation","316361272_Cognitive_apprenticeship","311485010_Learning_in_activity","309563549_Metacognition","305113653_Individual_differences_in_spatial_abilities","304861043_Cambridge_Handbook_of_Multimedia_Learning_Second_Edition","304860437_Multimedia_Learning_Second_Edition","304824777_Scaffolding","303270804_Cognitive_apprenticeship_Teaching_the_crafts_of_reading_writing_mathematics","303164747_Rational_and_fractional_numbers_From_quotient_fields_to_recursive_understanding","300214911_Properties_of_Mediated_Action","299663549_Experts'_Views_on_Translation_Across_Multiple_External_Representations_in_Acquiring_Biological_Knowledge_About_Ecology_Genetics_and_Evolution"]}