{"id":"301569608_Study_of_TCM_clinical_records_based_on_LSA_and_LDA_SHTDT_model","abstract":"Description of syndromes and symptoms in traditional Chinese medicine are extremely complicated. The method utilized to diagnose a patient’s syndrome more efficiently is the primary aim of clinical health care workers. In the present study, two models were presented concerning this issue. The first is the latent semantic analysis (LSA)-based semantic classification model, which is employed when the classification and words used to depict these classfications have been confirmed. The second is the symptom-herb-therapies-diagnosis topic (SHTDT), which is employed when the classification has not been confirmed or described. The experimental results showed that this method was successful, and symptoms can be diagnosed to a certain extent. The experimental results indicated that the topic feature reflected patient characteristics and the topic structure was obtained, which was clinically significant. The experimental results showed that when provided with a patient’s symptoms, the model can be used to predict the theme and diagnose the disease, and administer appropriate drugs and treatments. Additionally, the SHTDT model prediction results did not yield completely accurate results because this prediction is equivalent to multi-label prediction, whereby the drugs, treatment and diagnosis are considered as labels. In conclusion, diagnosis, and the drug and treatment administered are based on human factors.","authors":["Fan Lin","Zhihong Zhang","Shu-Fu Lin","Jia-Song Zeng"],"meta":["April 2016Experimental and Therapeutic Medicine 12(1)","DOI:10.3892/etm.2016.3285"],"references":["234817432_HHMM-based_Chinese_lexical_analyzer_ICTCLAS","293259338_Fuzzy_method_to_learn_text_classifier_from_labeled_and_unlabeled_examples","284167032_Discovering_treatment_pattern_in_Traditional_Chinese_Medicine_clinical_cases_by_exploiting_supervised_topic_model_and_domain_knowledge","252018882_Research_on_the_text_clustering_algorithm_based_on_latent_semantic_analysis_and_optimization","251913261_Fault_diagnosis_method_based_on_LSA_and_SVM","251823903_Kernel_Method_for_Building_Fuzzy_Classifiers","245569053_Topic_analysis_based_on_LDA_model","240410049_Web_Ontology_Language_Overview_W3C_Recommendation","232655300_A_junk_mail_filtering_method_based_on_LSA_and_FSVM","232638313_A_Latent_Semantic_Analysis_Based_Method_of_Getting_the_Category_Attribute_of_Words"]}