{"id":"301596547_Learning_from_imbalanced_data_Open_challenges_and_future_directions","abstract":"Despite more than two decades of continuous development learning from imbalanced data is still a focus of intense research. Starting as a problem of skewed distributions of binary tasks, this topic evolved way beyond this conception. With the expansion of machine learning and data mining, combined with the arrival of big data era, we have gained a deeper insight into the nature of imbalanced learning, while at the same time facing new emerging challenges. Data-level and algorithm-level methods are constantly being improved and hybrid approaches gain increasing popularity. Recent trends focus on analyzing not only the disproportion between classes, but also other difficulties embedded in the nature of data. New real-life problems motivate researchers to focus on computationally efficient, adaptive and real-time methods. This paper aims at discussing open issues and challenges that need to be addressed to further develop the field of imbalanced learning. Seven vital areas of research in this topic are identified, covering the full spectrum of learning from imbalanced data: classification, regression, clustering, data streams, big data analytics and applications, e.g., in social media and computer vision. This paper provides a discussion and suggestions concerning lines of future research for each of them.","authors":["Bartosz Krawczyk"],"meta":["April 2016Progress in Artificial Intelligence 5(4)","DOI:10.1007/s13748-016-0094-0"],"references":["314197823_Cost-Sensitive_Neural_Network_with_ROC-Based_Moving_Threshold_for_Imbalanced_Classification","309968331_Machine_learning_from_imbalanced_data_sets_101","308806181_Compounds_Activity_Prediction_in_Large_Imbalanced_Datasets_with_Substructural_Relations_Fingerprint_and_EEM","303214204_Effective_detection_of_sophisticated_online_banking_fraud_on_extremely_imbalanced_data","299687949_Classifier_Hybridization","298918864_Ordering-Based_Pruning_for_Improving_the_Performance_of_Ensembles_of_Classifiers_in_the_Framework_of_Imbalanced_Datasets","298855294_CLASSIFICATION_OF_IMBALANCED_DATA_A_REVIEW","298725139_Analyzing_the_oversampling_of_different_classes_and_types_of_examples_in_multi-class_imbalanced_datasets","296850013_Data_Preprocessing_in_Data_Mining","292016731_Learning_with_imbalanced_data_sets_101"]}