{"id":"301631709_On_the_first_Zagreb_index_and_multiplicative_Zagreb_coindices_of_graphs","abstract":"For a (molecular) graph G with vertex set V (G) and edge set E(G), the first Zagreb index of G is defined as (formula presented) where dG(vi) is the degree of vertex vi in G. Recently Xu et al. introduced two graphical invariants and (formula presented) named as first multiplicative Zagreb coindex and second multiplicative Zagreb coindex, respectively. The Narumi-Katayama index of a graph G, denoted by NK(G), is equal to the product of the degrees of the vertices of G, that is, NK(G) = (Formula present) The irregularity index t(G) of G is defined as the number of distinct terms in the degree sequence of G. In this paper, we give some lower and upper bounds on the first Zagreb index M1(G) of graphs and trees in terms of number of vertices, irregularity index, maximum degree, and characterize the extremal graphs. Moreover, we obtain some lower and upper bounds on the (first and second) multiplicative Zagreb coindices of graphs and characterize the extremal graphs. Finally, we present some relations between first Zagreb index and NarumiKatayama index, and (first and second) multiplicative Zagreb index and coindices of graphs.","authors":["Kinkar Das","Nihat Akgunes","Muge Togan","Aysun Yurttas Gunes"],"meta":["January 2016Analele Stiintifice ale Universitatii Ovidius Constanta, Seria Matematica 24(1):153-176","DOI:10.1515/auom-2016-0008"],"references":["267988588_On_the_multiplicative_Zagreb_coindex_of_graphs","257869730_The_multiplicative_Zagreb_indices_of_graph_operations","288260088_Comparison_between_Zagreb_indices_and_Zagreb_coindices","286955795_On_comparing_Zagreb_indices_of_graphs","276219045_Comparison_Between_Geometric-arithmetic_Indices","271512783_Graph_Theory_and_Applications","268071040_Multiplicative_Versions_of_First_Zagreb_Index","268028777_The_relationship_between_the_eccentric_connectivity_index_and_Zagreb_indices","267141066_On_Geometric-Arithmetic_Index_of_Graphs","265769535_On_Comparing_Zagreb_Indices_of_Graphs"]}