{"id":"301650504_Fake_News_or_Truth_Using_Satirical_Cues_to_Detect_Potentially_Misleading_News","abstract":"Satire is an attractive subject in deception detection research: it is a type of deception that intentionally incorporates cues revealing its own deceptiveness. Whereas other types of fabrications aim to instill a false sense of truth in the reader, a successful satirical hoax must eventually be exposed as a jest. This paper provides a conceptual overview of satire and humor, elaborating and illustrating the unique features of satirical news, which mimics the format and style of journalistic reporting. Satirical news stories were carefully matched and examined in contrast with their legitimate news counterparts in 12 contemporary news topics in 4 domains (civics, science, business, and “soft” news). Building on previous work in satire detection, we proposed an SVM-based algorithm, enriched with 5 predictive features (Absurdity, Humor, Grammar, Negative Affect, and Punctuation) and tested their combinations on 360 news articles. Our best predicting feature combination (Absurdity, Grammar and Punctuation) detects satirical news with a 90% precision and 84% recall (F-score=87%). Our work in algorithmically identifying satirical news pieces can aid in minimizing the potential deceptive impact of satire. [Note: The associated dataset of the Satirical and Legitimate News, S-n-L News DB 2015-2016, is available via http://victoriarubin.fims.uwo.ca/news-verification/ . The set is password-protected to avoid automated harvesting. Please feel free to request the password, if you are interested.]","authors":["Victoria Rubin","Nadia Conroy","Yimin Chen","Sarah Cornwell"],"meta":["June 2016","DOI:10.18653/v1/W16-0802","Conference: NAACL-CADD2016: Workshop on Computational Approaches to Deception Detection at the 15th Annual Conference of the North American Chapter of the Associ-ation for Computational Linguistics: Human Language Technologies (NAACL-CADD2016)At: San Diego, California","Project: Deception Detection. Satirical (fake) news recognition."],"references":["285206383_On_the_reception_and_detection_of_pseudo-profound_bullshit","282124505_The_Development_and_Psychometric_Properties_of_LIWC2015","281818866_News_in_an_Online_World_The_Need_for_an_Automatic_Crap_Detector","281818851_Deception_Detection_for_News_Three_Types_of_Fakes","271444562_Discerning_truth_from_deception_Human_judgments_automation_efforts","267767120_University_graduates_with_lower_levels_of_literacy_and_numeracy_skills","323321938_The_anatomy_of_satire","304651525_Satire","277967556_Satire_and_definition","271995836_Teaching_and_Learning_with_Humor","260800679_Collective_attention_in_the_age_of_misinformation","259548255_Satire_and_the_limits_of_literary_theories","263732236_Truth_and_Deception_at_the_Rhetorical_Structure_Level","262946207_Authorial_intentions_in_understanding_satirical_texts","257763667_Deception_Traits_in_Psychological_Interviewing"]}