{"id":"301609496_Real-time_management_of_berth_allocation_with_stochastic_arrival_and_handling_times","abstract":"In this research we study the berth allocation problem (BAP) in real time as disruptions occur. In practice, the actual arrival times and handling times of the vessels deviate from their expected or estimated values, which can disrupt the original berthing plan and possibly make it infeasible. We consider a given baseline berthing schedule, and solve the BAP on a rolling planning horizon with the objective to minimize the total realized cost of the updated berthing schedule, as the actual arrival and handling time data is revealed in real time. The uncertainty in the data is modeled by making appropriate assumptions about the probability distributions of the uncertain parameters based on past data. We present an optimization-based recovery algorithm based on set partitioning and a smart greedy algorithm to reassign vessels in the event of disruption. Our research problem derives from the real-world issues faced by the Saqr port, Ras Al Khaimah, UAE, where the berthing plans are regularly disrupted owing to a high degree of uncertainty in information. A simulation study is carried out to assess the solution performance and efficiency of the proposed algorithms, in which the baseline schedule is the solution of the deterministic BAP without accounting for any uncertainty. Results indicate that the proposed reactive approaches can significantly reduce the total realized cost of berthing the vessels as compared to the ongoing practice at the port.","authors":["Nitish Umang","Michel Bierlaire","Alan Erera"],"meta":["February 2017Journal of Scheduling 20(1)","DOI:10.1007/s10951-016-0480-2","Project: Seaport Logistics"],"references":["232908332_Disruption_recovery_model_for_berth_and_quay_crane_scheduling_in_container_terminals","228684804_Robust_Convex_Optimization","312737420_Convex_programming_with_set-inclusive_constraints_and_application_to_inexact_LP","279827932_Robust_Discrete_Optimization","268892444_Applications_of_Stochastic_Programming","263047752_Stochastic_Linear_Programming_Models_Theory_and_Computation","263047674_Introduction_to_Stochastic_Dynamic_Programming","257177475_A_bi-objective_model_for_robust_berth_allocation_scheduling","238836469_Technical_Note--Convex_Programming_with_Set-Inclusive_Constraints_and_Applications_to_Inexact_Linear_Programming","229657252_Efficient_planning_of_berth_allocation_for_container_terminals_in_Asia","227272318_Robust_cyclic_berth_planning_of_container_vessels","225838442_Berth_management_in_container_terminal_The_template_design_problem","225493172_Container_terminal_operation_and_operations_research_-_A_classification_and_literature_review","228533450_Exact_and_Heuristic_Methods_to_Solve_the_Berth_Allocation_Problem_in_Bulk_Ports","227427354_Models_for_the_discrete_berth_allocation_problem_A_computational_comparison"]}