{"id":"301644912_A_survey_on_bug_prioritization","abstract":"Daily large number of bug reports are received in large open and close source bug tracking systems. Dealing with these reports manually utilizes time and resources which leads to delaying the resolution of important bugs. As an important process in software maintenance, bug triaging process carefully analyze these bug reports to determine, for example, whether the bugs are duplicate or unique, important or unimportant, and who will resolve them. Assigning bug reports based on their priority or importance may play an important role in enhancing the bug triaging process. The accurate and timely prioritization and hence resolution of these bug reports not only improves the quality of software maintenance task but also provides the basis to keep particular software alive. In the past decade, various studies have been conducted to prioritize bug reports using data mining techniques like classification, information retrieval and clustering that can overcome incorrect prioritization. Due to their popularity and importance, we survey the automated bug prioritization processes in a systematic way. In particular, this paper gives a small theoretical study for bug reports to motivate the necessity for work on bug prioritization. The existing work on bug prioritization and some possible problems in working with bug prioritization are summarized.","authors":["Jamal Uddin","Rozaida Ghazali","Mustafa Mat Deris","Rashid Naseem"],"meta":["February 2017Artificial Intelligence Review 47(2)","DOI:10.1007/s10462-016-9478-6"],"references":["302924724_Guidelines_for_performing_Systematic_Literature_Reviews_in_Software_Engineering","271551495_An_empirical_study_of_bug_report_field_reassignment","304954408_Advances_in_Intelligent_Systems_and_Computing_Preface","288244743_A_novel_clustering_approach_Artificial_bee_colony_ABC_algorithm","286584439_Automatic_bug_labeling_using_semantic_information_from_LSI","278646210_Reducing_the_effort_of_bug_report_triage","271730346_A_survey_on_bug-report_analysis","271551496_An_empirical_study_of_long_lived_bugs","270960159_Program_understanding_behavior_during_corrective_maintenance_of_large-scale_software","269310393_A_bug_Mining_tool_to_identify_and_analyze_security_bugs_using_Naive_Bayes_and_TF-IDF_A_Comparative_Analysis"]}