{"id":"301644273_Instagrammatics_and_digital_methods_Studying_visual_social_media_from_selfies_and_GIFs_to_memes_and_emoji","abstract":"Visual content is a critical component of everyday social media, on platforms explicitly framed around the visual (Instagram and Vine), on those offering a mix of text and images in myriad forms (Facebook, Twitter, and Tumblr), and in apps and profiles where visual presentation and provision of information are important considerations. However, despite being so prominent in forms such as selfies, looping media, infographics, memes, online videos, and more, sociocultural research into the visual as a central component of online communication has lagged behind the analysis of popular, predominantly text-driven social media. This paper underlines the increasing importance of visual elements to digital, social, and mobile media within everyday life, addressing the significant research gap in methods for tracking, analysing, and understanding visual social media as both image-based and intertextual content. In this paper, we build on our previous methodological considerations of Instagram in isolation to examine further questions, challenges, and benefits of studying visual social media more broadly, including methodological and ethical considerations. Our discussion is intended as a rallying cry and provocation for further research into visual (and textual and mixed) social media content, practices, and cultures, mindful of both the specificities of each form, but also, and importantly, the ongoing dialogues and interrelations between them as communication forms.","authors":["Tim Highfield","Tama Leaver"],"meta":["January 2016Communication Research and Practice 2(1):47-62","DOI:10.1080/22041451.2016.1155332"],"references":["330334198_This_Is_Why_We_Can't_Have_Nice_Things_Mapping_the_Relationship_between_Online_Trolling_and_Mainstream_Culture","320046581_In_full_view_Involuntary_porn_and_the_postfeminist_rhetoric_of_choice","315185542_On_Photography","313580465_IntagLam_Instagram_as_a_repository_of_taste_a_burgeoning_marketplace_a_war_of_eyeballs","304987041_In_Full_View_Involuntary_Porn_and_the_Postfeminist_Rhetoric_of_Choice","303428941_Hashtag_as_hybrid_forum_The_case_of_agchatoz","299848035_When_the_Going_Gets_Tough","298465919_Sexting_Selfies_and_Self-Harm_Young_People_Social_Media_and_the_Performance_of_Self-Development","289618566_Selfies_Sexts_and_Sneaky_Hats_Young_People's_Understandings_of_Gendered_Practices_of_Self-Representation","289618508_Virtual_Lactivism_Breastfeeding_Selfies_and_the_Performance_of_Motherhood"]}