{"id":"301649334_The_Experiment_Factory_Standardizing_Behavioral_Experiments","abstract":"The administration of behavioral and experimental paradigms for psychology research is hindered by lack of a coordinated effort to develop and deploy standardized paradigms. While several frameworks (de Leeuw (2015); McDonnell et al. (2012); Mason and Suri (2011); Lange et al. (2015)) have provided infrastructure and methods for individual research groups to develop paradigms, missing is a coordinated effort to develop paradigms linked with a system to easily deploy them. This disorganization leads to redundancy in development, divergent implementations of conceptually identical tasks, disorganized and error-prone code lacking documentation, and difficulty in replication. The ongoing reproducibility crisis in psychology and neuroscience research (Baker (2015); Open Science Collaboration (2015)) highlights the urgency of this challenge: reproducible research in behavioral psychology is conditional on deployment of equivalent experiments. A large, accessible repository of experiments for researchers to develop collaboratively is most efficiently accomplished through an open source framework. Here we present the Experiment Factory, an open source framework for the development and deployment of web-based experiments. The modular infrastructure includes experiments, virtual machines for local or cloud deployment, and an application to drive these components and provide developers with functions and tools for further extension. We release this infrastructure with a deployment (http://www.expfactory.org) that researchers are currently using to run a set of over 80 standardized web-based experiments on Amazon Mechanical Turk. By providing open source tools for both deployment and development, this novel infrastructure holds promise to bring reproducibility to the administration of experiments, and accelerate scientific progress by providing a shared community resource of psychological paradigms.","authors":["Vanessa V Sochat","Ian Eisenberg","Ayse Zeynep Enkavi","Jamie Li"],"meta":["April 2016Frontiers in Psychology 7(17):1-9","DOI:10.3389/fpsyg.2016.00610","Project: Science of behavior change"],"references":["295120817_Investigating_variation_in_replicability","281358655_Correction_Just_Another_Tool_for_Online_Studies_JATOS_An_Easy_Solution_for_Setup_and_Management_of_Web_Servers_Supporting_Online_Studies","281286234_Estimating_the_reproducibility_of_psychological_science","280837314_Conducting_perception_research_over_the_Internet_A_tutorial_review","280556512_The_Average_Laboratory_Samples_a_Population_of_7300_Amazon_Mechanical_Turk_Workers","312470224_Estimating_the_reproducibility_of_psychological_science","296625211_Brain_training_Memory_games","295120540_Estimating_the_reproducibility_of_psychological_science","282450967_Over_Half_of_Psychology_Studies_Fail_Reproducibility_Test","261221973_jsPsych_A_JavaScript_library_for_creating_behavioral_experiments_in_a_Web_browser"]}