{"id":"301609591_RNA_folding_with_hard_and_soft_constraints","abstract":"Background\nA large class of RNA secondary structure prediction programs uses an elaborate energy model grounded in extensive thermodynamic measurements and exact dynamic programming algorithms. External experimental evidence can be in principle be incorporated by means of hard constraints that restrict the search space or by means of soft constraints that distort the energy model. In particular recent advances in coupling chemical and enzymatic probing with sequencing techniques but also comparative approaches provide an increasing amount of experimental data to be combined with secondary structure prediction.\n\nResults\nResponding to the increasing needs for a versatile and user-friendly inclusion of external evidence into diverse flavors of RNA secondary structure prediction tools we implemented a generic layer of constraint handling into the ViennaRNA Package. It makes explicit use of the conceptual separation of the “folding grammar” defining the search space and the actual energy evaluation, which allows constraints to be interleaved in a natural way between recursion steps and evaluation of the standard energy function.\n\nConclusions\nThe extension of the ViennaRNA Package provides a generic way to include diverse types of constraints into RNA folding algorithms. The computational overhead incurred is negligible in practice. A wide variety of application scenarios can be accommodated by the new framework, including the incorporation of structure probing data, non-standard base pairs and chemical modifications, as well as structure-dependent ligand binding.\n\nElectronic supplementary material\nThe online version of this article (doi:10.1186/s13015-016-0070-z) contains supplementary material, which is available to authorized users.","authors":["Ronny Lorenz","Ivo L Hofacker","Peter F. Stadler"],"meta":["April 2016Algorithms for Molecular Biology 11(1)","DOI:10.1186/s13015-016-0070-z"],"references":["293682967_Post-transcriptional_nucleotide_modification_and_alternative_folding_of_RNA","282317411_SHAPE_directed_RNA_folding","275828436_SHAPE_directed_RNA_folding","274317655_Design_criteria_for_synthetic_riboswitches_acting_on_transcription","261986383_The_Trouble_with_Long-Range_Base_Pairs_in_RNA_Folding","326018976_PROSPECTS_FOR_RIBOZYME_DISCOVERY_AND_ANALYSIS","315587385_A_discipline_of_dynamic_programming_over_sequence_data","288691230_Thermodynamics_of_RNA-RNA_binding","262844353_Computational_Analysis_of_Conserved_RNA_Secondary_Structure_in_Transcriptomes_and_Genomes","262266635_Insights_into_RNA_structure_and_function_from_genome-wide_studies"]}