{"id":"301645872_On_Staying_Grounded_and_Avoiding_Quixotic_Dead_Ends","abstract":"The 15 articles in this special issue on The Representation of Concepts illustrate the rich variety of theoretical positions and supporting research that characterize the area. Although much agreement exists among contributors, much disagreement exists as well, especially about the roles of grounding and abstraction in conceptual processing. I first review theoretical approaches raised in these articles that I believe are Quixotic dead ends, namely, approaches that are principled and inspired but likely to fail. In the process, I review various theories of amodal symbols, their distortions of grounded theories, and fallacies in the evidence used to support them. Incorporating further contributions across articles, I then sketch a theoretical approach that I believe is likely to be successful, which includes grounding, abstraction, flexibility, explaining classic conceptual phenomena, and making contact with real-world situations. This account further proposes that (1) a key element of grounding is neural reuse, (2) abstraction takes the forms of multimodal compression, distilled abstraction, and distributed linguistic representation (but not amodal symbols), and (3) flexible context-dependent representations are a hallmark of conceptual processing.","authors":["Lawrence W. Barsalou"],"meta":["April 2016Psychonomic Bulletin & Review 23(4)","DOI:10.3758/s13423-016-1028-3"],"references":["303952003_Only_time_will_tell_-_why_temporal_information_is_essential_for_our_neuroscientific_understanding_of_semantics","333034219_Flexible_foundations_of_abstract_thought_A_review_and_a_theory","329650509_Semantic_Cognition_A_Parallel_Distributed_Processing_Approach","325370885_Concepts_Core_Readings","324352933_The_Ecological_Approach_to_Visual_Perception","324299753_Origins_of_the_Modern_Mind_Three_Stages_in_the_Evolution_of_Culture_and_Cognition","303891122_For_a_cognitive_neuroscience_of_concepts_Moving_beyond_the_grounding_issue","303891034_Is_there_an_exemplar_theory_of_concepts","303891033_Linking_somatic_and_symbolic_representation_in_semantic_memory_the_dynamic_multilevel_reactivation_framework","303890947_The_amodal_brain_and_the_offloading_hypothesis"]}