{"id":"301737190_The_Ontology_for_Biomedical_Investigations","abstract":"The Ontology for Biomedical Investigations (OBI) is an ontology that provides terms with precisely defined meanings to describe all aspects of how investigations in the biological and medical domains are conducted. OBI re-uses ontologies that provide a representation of biomedical knowledge from the Open Biological and Biomedical Ontologies (OBO) project and adds the ability to describe how this knowledge was derived. We here describe the state of OBI and several applications that are using it, such as adding semantic expressivity to existing databases, building data entry forms, and enabling interoperability between knowledge resources. OBI covers all phases of the investigation process, such as planning, execution and reporting. It represents information and material entities that participate in these processes, as well as roles and functions. Prior to OBI, it was not possible to use a single internally consistent resource that could be applied to multiple types of experiments for these applications. OBI has made this possible by creating terms for entities involved in biological and medical investigations and by importing parts of other biomedical ontologies such as GO, Chemical Entities of Biological Interest (ChEBI) and Phenotype Attribute and Trait Ontology (PATO) without altering their meaning. OBI is being used in a wide range of projects covering genomics, multi-omics, immunology, and catalogs of services. OBI has also spawned other ontologies (Information Artifact Ontology) and methods for importing parts of ontologies (Minimum information to reference an external ontology term (MIREOT)). The OBI project is an open cross-disciplinary collaborative effort, encompassing multiple research communities from around the globe. To date, OBI has created 2366 classes and 40 relations along with textual and formal definitions. The OBI Consortium maintains a web resource (http://obi-ontology.org) providing details on the people, policies, and issues being addressed in association with OBI. The current release of OBI is available at http://purl.obolibrary.org/obo/obi.owl.","authors":["Anita Bandrowski","Ryan R. Brinkman","Mathias Brochhausen","Matthew H Brush"],"meta":["April 2016PLoS ONE 11(4):e0154556","DOI:10.1371/journal.pone.0154556","Project: Evidence and Conclusion Ontology"],"references":["346692394_MIREOT_The_minimum_information_to_reference_an_external_ontology_term","315247112_MIREOT_the_Minimum_Information_to_Reference_an_External_Ontology_Term","305376646_Database_resources_of_the_National_Center_for_Biotechnology_Information","285668548_Gene_ontology_Tool_for_the_unification_of_biology","280968233_A_Framework_for_Global_Collaborative_Data_Management_for_Malaria_Research","326338097_Pellet_A_Practical_OWL-DL_Reasoner","310794013_Hermit_A_highly-efficient_owl_reasoner","297624094_The_Functional_Genomics_Experiment_model_FuGE_an_extensible_framework_for_standards_in_functional_genomics","286172290_The_minimum_information_to_reference_an_external_ontology_term","273217029_Bio-GraphIIn_a_graph-based_integrative_and_semantically-enabled_repository_for_life_science_experimental_data"]}