{"id":"301778391_Distributed_Software_Development_with_One_Hand_Tied_Behind_the_Back_A_Course_Unit_to_Experience_the_Role_of_Communication_in_GSD","abstract":"Software development consists to a large extent of human-based processes with continuously increasing demands regarding interdisciplinary team work. Understanding the dynamics of software teams can be seen as highly important to successful project execution. Hence, for future project managers, knowledge about non-technical processes in teams is significant. In this paper, we present a course unit that provides an environment in which students can learn and experience the role of different communication patterns in distributed agile software development. In particular, students gain awareness about the importance of communication by experiencing the impact of limitations of communication channels and the effects on collaboration and team performance. The course unit presented uses the controlled experiment instrument to provide the basic organization of a small software project carried out in virtual teams. We provide a detailed design of the course unit to allow for implementation in further courses. Furthermore, we provide experiences obtained from implementing this course unit with 16 graduate students. We observed students struggling with technical aspects and team coordination in general, while not realizing the importance of communication channels (or their absence). Furthermore, we could show the students that lacking communication protocols impact team coordination and performance regardless of the communication channels used.","authors":["Marco Kuhrmann","Jürgen Münch"],"meta":["August 2016","DOI:10.1109/ICGSEW.2016.13","Conference: 1st Workshop on Global Software Engineering Education (in conjunction with ICGSE'2016)At: Irvine, Organe County, CA, USA"],"references":["291777847_When_Teams_Go_Crazy_An_Environment_to_Experience_Group_Dynamics_in_Software_Project_Management_Courses","288857152_Global_Software_Engineering_An_Industry_Perspective","259356610_Teaching_Software_Process_Modeling","259346588_A_Platform_for_Teaching_Applied_Distributed_Software_Development_The_Ongoing_Journey_of_the_Helsinki_Software_Factory","256471371_A_Practical_Approach_to_Align_Research_with_Master's_Level_Courses","279355975_Experimentation_in_Software_Engineering","261418968_Near-Synchronicity_and_Distance_Instant_Messaging_as_a_Medium_for_Global_Software_Engineering","261412134_Activity_Theory_Applied_to_Global_Software_Engineering_Theoretical_Foundations_and_Implications_for_Tool_Builders","224574428_Factors_Affecting_Audio_and_Text-Based_Communication_Media_Choice_in_Global_Software_Development_Projects","224332877_Experiences_of_Instant_Messaging_in_Global_Software_Development_Projects_A_Multiple_Case_Study"]}