{"id":"301716078_Multi-Path_Link_Embedding_for_Survivability_in_Virtual_Networks","abstract":"Internet applications are deployed on the same network infrastructure, yet they have diverse performance and functional requirements. The Internet was not originally designed to support the diversity of current applications. Network virtualization enables heterogeneous applications and network architectures to coexist without interference on the same infrastructure. Embedding a virtual network (VN) into a physical network is a fundamental problem in network virtualization. A VN embedding that aims to survive physical (e.g., link) failures is known as the survivable VN embedding (SVNE). A key challenge in the SVNE problem is to ensure VN survivability with minimal resource redundancy. To address this challenge, we propose survivability in multi-path link embedding (SiMPLE). By exploiting path diversity in the physical network, SiMPLE provides guaranteed VN survivability against single link failure while incurring minimal resource redundancy. In case of multiple arbitrary link failures, SiMPLE provides maximal survivability to the VNs. We formulate this problem as an integer linear program and implement it using GNU linear programming kit. We propose a greedy proactive approach to solve larger instances of the problem in case of single link failures. In presence of more than one link failures, we propose a greedy reactive algorithm as an extension to the previous one, which opportunistically recovers the lost bandwidth in the VNs. Simulation results show that SiMPLE outperforms full backup and shared backup schemes for SVNE, and produces near-optimal results.","authors":["Md Mashrur Alam Khan","Nashid Shahriar","Reaz Ahmed","R. Boutaba"],"meta":["April 2016IEEE Transactions on Network and Service Management 13(2):253 - 266","DOI:10.1109/TNSM.2016.2558598"],"references":["287489984_SiMPLE_Survivability_in_multi-path_link_embedding","269298284_Venice_Reliable_virtual_data_center_embedding_in_clouds","313038610_A_scalable_commodity_data_center_network_architecture","307631671_The_pagerank_citation_ranking_Bringing_order_to_the_web","306217986_Volley_Automated_data_placement_for_geo-distributed_cloud_services","303151321_Network_virtualization_in_multi-tenant_datacenters","282632864_Opportunistic_Resilience_Embedding_ORE_Toward_Cost-efficient_Resilient_Virtual_Networks","269300749_A_Survivable_Virtual_Network_Embedding_scheme_based_on_load_balancing_and_reconfiguration","265663926_An_algorithm_for_finding_shortest_routes_from_all_source_nodes_to_a_given_destination_in_general_networks","264085712_Dynamic_recovery_for_survivable_virtual_network_embedding"]}