{"id":"301773289_Heterogeneous_facility_location_without_money","abstract":"The study of the facility location problem in the presence of self-interested agents has recently emerged as the benchmark problem in the research on mechanism design without money. In the setting studied in the literature so far, agents are single-parameter in that their type is a single number encoding their position on a real line. We here initiate a more realistic model for several real-life scenarios. Specifically, we propose and analyze heterogeneous facility location without money, a novel model wherein: (i) we have multiple heterogeneous (i.e., serving different purposes) facilities, (ii) agents' locations are disclosed to the mechanism and (iii) agents bid for the set of facilities they are interested in (as opposed to bidding for their position on the network).We study the heterogeneous facility location problem under two different objective functions, namely: social cost (i.e., sum of all agents' costs) and maximum cost. For either objective function, we study the approximation ratio of both deterministic and randomized truthful algorithms under the simplifying assumption that the underlying network topology is a line. For the social cost objective function, we devise an (n-1)-approximate deterministic truthful mechanism and prove a constant approximation lower bound. Furthermore, we devise an optimal and truthful (in expectation) randomized algorithm. As regards the maximum cost objective function, we propose a 3-approximate deterministic strategyproof algorithm, and prove a 3/2 approximation lower bound for deterministic strategyproof mechanisms. Furthermore, we propose a 3/2-approximate randomized strategyproof algorithm and prove a 4/3 approximation lower bound for randomized strategyproof algorithms.","authors":["Paolo Serafino","Carmine Ventre"],"meta":["April 2016Theoretical Computer Science 636","DOI:10.1016/j.tcs.2016.04.033","Project: Heterogeneous Facility Location without Money"],"references":["283886361_The_Power_of_Verification_for_Greedy_Mechanism_Design","271825999_Truthful_Mechanisms_without_Money_for_Non-utilitarian_Heterogeneous_Facility_Location","271013387_Truthful_mechanisms_for_the_location_of_different_facilities","267390246_Heterogeneous_Facility_Location_without_Money_on_the_Line","257246600_Combinatorial_Auctions_Without_Money","254005952_Mechanism_design_on_discrete_lines_and_cycles","228115487_On_the_Power_of_Deterministic_Mechanisms_for_Facility_Location_Games","307519427_Strategyproof_Facility_Location_for_Concave_Cost_Functions","226038155_On_Strategy-Proofness_and_Single_Peakedness","222403517_Strategy-proof_Location_on_a_Network","221445084_Approximate_Mechanism_Design_without_Money","221445055_Optimal_collusion-resistant_mechanisms_with_verification","221444906_Asymptotically_optimal_strategy-proof_mechanisms_for_two-facility_games","221256571_Scheduling_Without_Payments","220853232_Winner-Imposing_Strategyproof_Mechanisms_for_Multiple_Facility_Location_Games","220853203_Tighter_Bounds_for_Facility_Games","220770010_Combinatorial_Auctions_with_Verification_Are_Tractable","220442825_Strategyproof_Approximation_of_the_Minimax_on_Networks","45912408_Approximately_Optimal_Mechanism_Design_via_Differential_Privacy"]}