{"id":"301778461_Structural_Similarities_of_Economies_for_Innovation_and_Competitiveness_-_A_Decision_Tree_Based_Approach","abstract":"The purpose of this article is to classify countries according to their stage of competitive advantage (factor-driven, efficiency-driven, innovation-driven) by using an expert survey on entrepreneurship and innovation. For this purpose, machine learning tools were used. The algorithm used to create a decision tree is the exhaustive CHAID algorithm. This classification not only identifies how countries of similar competitive advantages are structurally similar, but also shows the experts survey in a reduced-dimensional space for further analyses. Even though there is heterogeneity amongst countries belonging to the same category, the structural similarities are associated with infrastructure, legislature and financing and support possibilities for entrepreneurs. This analysis provides additional information to data on the ease of doing business relevant for FDI decisions as well as for macroeconomic policymaking. This paper is unique in combining a powerful method to derive decision rules, with a new perspective on competitive advantages and innovativeness of economies. The results help to understand the competitive advantages of economies.\n\nKeywords: Entrepreneurship; Competition; Innovation; Decision Tree Analysis\n\nJEL codes: O38, O10, C44","authors":["Burak Erkut"],"meta":["May 2016","DOI:10.18559/SOEP.2016.5.6"],"references":["287065185_Comparing_subjective_and_objective_indicators_to_describe_the_national_entrepreneurial_context_The_Global_Entrepreneurship_Monitor_and_the_Global_Competitiveness_Index_contributions","254416507_The_Global_Entrepreneurship_Monitor_GEM_and_Its_Impact_on_Entrepreneurship_Research","316692974_Handbook_of_Statistical_Analysis_and_Data_Mining_Applications","313134420_The_Competitive_Advantage_of_Nations","309395385_Handbook_of_Statistical_Analysis_and_Data_Mining_Applications","299463692_Modelling_patient_length_of_stay_in_public_hospitals_in_Mexico","281596015_Dressing_the_emperor_The_fabric_of_entrepreneurship_policy","271517443_The_Competitive_Advantage_Of_Nations","245722067_Competition_as_a_Discovery_Procedure","242396122_Data_mining_concepts_and_techniques_morgan_kaufmann"]}