{"id":"301709111_Optimal_pavement_maintenance_programs_based_on_a_hybrid_Greedy_Randomized_Adaptive_Search_Procedure_Algorithm","abstract":"Insufficient investment in the public sector together with inefficient maintenance infrastructure programs lead to high economic costs in the long term. Thus, infrastructure managers need practical tools to maximize the Long-Term Effectiveness (LTE) of maintenance programs. This paper describes an optimization tool based on a hybrid Greedy Randomized Adaptive Search Procedure (GRASP) considering Threshold Accepting (TA) with relaxed constraints. This tool facilitates the design of optimal maintenance programs subject to budgetary and technical restrictions, exploring the effect of different budgetary scenarios on the overall network condition. The optimization tool is applied to a case study demonstrating its efficiency to analyze real data. Optimized maintenance programs are shown to yield LTE 40% higher than the traditional programs based on a reactive strategy. To extend the results obtained in this case study, a set of simulated scenarios, based on the range of values found in the real example, are also optimized. This analysis concludes that this optimization algorithm enhances the allocation of maintenance funds over the one obtained under a traditional reactive strategy. The sensitivity analysis of a range of budgetary scenarios indicates that the funding level in the early years is a driving factor of the LTE of optimal maintenance programs.","authors":["Victor Yepes","Cristina Torres-Machi","Alondra Chamorro","Eugenio Pellicer"],"meta":["May 2016Journal of Civil Engineering and Management 22(4):540-550","DOI:10.3846/13923730.2015.1120770","Project: Optimización y toma de decisiones en carreteras"],"references":["271539138_Current_models_and_practices_of_economic_and_environmental_evaluation_for_sustainable_network-level_pavement_management","270981184_Evaluation_of_Attempts_for_Efficient_Road_Maintenance_-_Knowledge_Compilation","267276284_Estimating_future_bidding_performance_of_competitor_bidders_in_capped_tenders","263257910_Calibration_and_Validation_of_Condition_Indicator_for_Managing_Urban_Pavement_Networks","261753578_An_Iterative_Approach_for_the_Optimization_of_Pavement_Maintenance_Management_at_the_Network_Level","261643048_Research_and_evaluation_of_ruts_in_the_asphalt_pavement_on_Lithuanian_highways","285670660_Heuristic_Optimization_Model_for_Infrastructure_Asset_Management","281700783_Optimized_Maintenance_Standards_for_Unpaved_Road_Networks_Based_on_Cost-Effectiveness_Analysis","273370219_Risk-Based_Approach_for_Optimum_Maintenance_of_Bridges_under_Traffic_and_Earthquake_Loads","263254278_Validation_and_Implementation_of_Ontario_Canada_Network-Level_Distress_Guidelines_and_Condition_Rating"]}