{"id":"301761619_Social_enterprise_Gender_gap_and_economic_development","abstract":"Companies created by women represent a substantial part of entrepreneurship. While men outnumber women in entrepreneurship rates, the gender gap decreases in the case of social enterprises. This may be explained by the fact that roles and stereotypes that influence women's behavior will lead to significantly identify with the values promulgated by social enterprises. This greater involvement in social activities leads women to become an essential player for promoting such needed initiatives given the impossibility for public institutions to address all social problems. Therefore in this paper, firstly, we study the gender gap in social and commercial entrepreneurship, distinguishing between enterprises with less than 42 months of activity and those consolidated in the market. Secondly, and aware of the variability of data between countries, a study is conducted using a sample of 48 countries grouped according to their level of development. The results confirm what is stated in the literature, the gender gap is reduced in the case of social entrepreneurship and it is also shown that female participation in social enterprises is influenced by the level of development of the country. These results lead us to highlight the importance of variables such as culture or social norms when explaining female behavior.","authors":["Catalina Nicolás Martínez","Alicia Rubio Bañón"],"meta":["April 2016European Journal of Management and Business Economics 25(2)","DOI:10.1016/j.redeen.2015.11.001"],"references":["287065185_Comparing_subjective_and_objective_indicators_to_describe_the_national_entrepreneurial_context_The_Global_Entrepreneurship_Monitor_and_the_Global_Competitiveness_Index_contributions","269111658_Regulations_and_Entrepreneurship_Evidence_from_Developed_and_Developing_Countries","268217305_Culture_and_Entrepreneurship_The_Case_of_Latin_America","256903363_Are_women_more_likely_to_pursue_social_and_environmental_entrepreneurship","255697975_Condicionantes_del_Entorno_y_Emprendimiento_Femenino_Un_Estudio_Cuantitativo_en_Espana","249677300_Gender_and_the_Nonprofit_Sector","246547927_Designing_a_Global_Standardized_Methodology_for_Measuring_Social_Entrepreneurship_Activity_The_Global_Entrepreneurship_Monitor_Social_Entrepreneurship_Study","263727722_Immigration_education_and_entrepreneurship_in_developed_countries","247500341_Sex_Differences_in_Social_Behavior_A_Social-Role_Interpretation","238752509_Motivation_leadership_and_organization_Do_American_theories_apply_abroad"]}