{"id":"301779181_SUPERVISED_MACHINE_LEARNING_APPROACHES_A_SURVEY","abstract":"One of the core objectives of machine learning is to instruct computers to use data or past experience to solve a given problem. A good number of successful applications of machine learning exist already, including classifier to be trained on email messages to learn in order to distinguish between spam and non-spam messages, systems that analyze past sales data to predict customer buying behavior, fraud detection etc. Machine learning can be applied as association analysis through Supervised learning, Unsupervised learning and Reinforcement Learning but in this study we will focus on strength and weakness of supervised learning classification algorithms. The goal of supervised learning is to build a concise model of the distribution of class labels in terms of predictor features. The resulting classifier is then used to assign class labels to the testing instances where the values of the predictor features are known, but the value of the class label is unknown. We are optimistic that this study will help new researchers to guiding new research areas and to compare the effectiveness and impuissance of supervised learning algorithms.","authors":["Muhammad Iqbal","Zhu Yan"],"meta":["April 2015International Journal of Soft Computing 5(3):946-952","DOI:10.21917/ijsc.2015.0133"],"references":["272666514_Decision_Tree_and_Naive_Bayes_Algorithm_for_Classification_and_Generation_of_Actionable_Knowledge_for_Direct_Marketing","267964435_Outlier_Detection_Applications_And_Techniques","266225209_Large_Scale_Distributed_Deep_Networks","321607377_Lazy_Learning","287762956_Deep_learning_with_COTS_HPC_systems","286230756_Classification_and_Regression_Trees_The_Wadsworth_Statistics_and_Probability_Series","275270590_CART_Classification_and_Regression_Trees","267960550_ImageNet_Classification_with_Deep_Convolutional_Neural_Networks","267093650_Bayesian_Networks_A_Practical_Guide_to_Applications","267004513_Foundations_of_Machine_Learning"]}