{"id":"301703474_Rethinking_therapeutic_strategies_in_cancer_Wars_fields_anomalies_and_monsters","abstract":"This article argues that the excessive focus on cancer as an insidious living defect that needs to be destroyed has obscured the fact that cancer develops inside human beings. Therefore, in order to contribute to debates about new cancer therapies, we argue that it is important to gain a broader understanding of what cancer is and how it might be otherwise. First, in order to reframe the debate, we utilize Pierre Bourdieu’s field analysis in order to gain a stronger understanding of the structure of the (sub)field of cancer research. In doing so, we are able to see that those in a dominant position in the field, with high levels of scientific capital at their disposal, are in the strongest position to determine the type of research that is carried out and, more significantly, how cancer is perceived. Field analysis enables us to gain a greater understanding of the complex interplay between the field of science (and, more specifically, the subfield of cancer research) and broader sources of power. Second, we draw attention to new possible ways of understanding cancer in its evolutionary context. One of the problems facing cancer research is the narrow time frame within which cancer is perceived: the lives of cancer cells are considered from the moment the cells initially change. In contrast, the approach put forward here requires a different way of thinking: we take a longer view and consider cancer as a living entity, with cancer perceived as anomalous rather than abnormal. Third, we theorize the possibility of therapeutic strategies that might involve the redirection (rather than the eradication) of cancer cells. This approach also necessitates new ways of perceiving cancer.","authors":["Simon Stewart","Cyril Rauch"],"meta":["November 2016Social Theory & Health 14(4)","DOI:10.1057/sth.2016.4"],"references":["313093539_A_Sociology_of_Culture_Taste_and_Value","323321962_The_Enigma_of_Capital_And_the_Crises_of_Capitalism","323321776_A_Brief_History_of_Neoliberalism","319484051_The_Field_of_Cultural_Production","317128320_An_Invitation_of_Reflexive_Sociology","316238755_An_Invitation_to_Reflexive_Sociology","313444031_Normal_genetically_mosaic_mice_produced_from_malignant_teratocarcinoma_cells","313429490_The_specificity_of_the_scientific_field_and_the_social_conditions_of_the_progres_of_reason","312368301_Proton_channels_and_exchangers_in_cancer","307149641_The_forms_of_capital","292944055_Echoes_of_the_embryo_Using_the_developmental_biology_toolkit_to_study_cancer","297161864_Erratum_to_Microenvironmental_acidosis_in_carcinogenesis_and_metastases_new_strategies_in_prevention_and_therapy_Cancer_Metastasis_Rev_101007s10555-014-9531-3","296944544_The_Enigma_of_Capital_and_the_Crisis_This_Time","289505603_Science_of_Science_and_Reflexivity","285376612_The_Forms_of_Capital"]}