{"id":"301839500_TensorFlow_Large-Scale_Machine_Learning_on_Heterogeneous_Distributed_Systems","abstract":"TensorFlow is an interface for expressing machine learning algorithms, and an implementation for executing such algorithms. A computation expressed using TensorFlow can be executed with little or no change on a wide variety of heterogeneous systems, ranging from mobile devices such as phones and tablets up to large-scale distributed systems of hundreds of machines and thousands of computational devices such as GPU cards. The system is flexible and can be used to express a wide variety of algorithms, including training and inference algorithms for deep neural network models, and it has been used for conducting research and for deploying machine learning systems into production across more than a dozen areas of computer science and other fields, including speech recognition, computer vision, robotics, information retrieval, natural language processing, geographic information extraction, and computational drug discovery. This paper describes the TensorFlow interface and an implementation of that interface that we have built at Google. The TensorFlow API and a reference implementation were released as an open-source package under the Apache 2.0 license in November, 2015 and are available at www.tensorflow.org.","authors":["Martín Abadi","Ashish Agarwal","Paul Barham","Eugene Brevdo"],"meta":["March 2016"],"references":["305196650_Going_deeper_with_convolutions","319770465_Sequence_to_Sequence_Learning_with_Neural_Networks","319770439_Efficient_Estimation_of_Word_Representations_in_Vector_Space","306209959_Project_adam_Building_an_efficient_and_scalable_deep_learning_training_system","304533937_Learning_representations_by_back_propagating_errors_Cogn","303256841_Theano_a_CPU_and_GPU_math_expression_compiler","291286882_DeViSE_A_deep_visual-semantic_embedding_model","286594438_Large-Scale_Video_Classification_with_Convolutional_Neural_Networks","283780337_Pedestrian_detection_with_a_Large-Field-Of-View_deep_network","281952292_Large-scale_cluster_management_at_Google_with_Borg"]}