{"id":"301855504_The_Schutzenberger_product_for_syntactic_spaces","abstract":"Starting from Boolean algebras of languages closed under quotients and using duality theoretic insights, we derive the notion of Boolean spaces with internal monoids as recognisers for arbitrary formal languages of finite words over finite alphabets. This leads to a setting that is well-suited for applying existing tools from Stone duality as applied in semantics. The main focus of the paper is the development of topo-algebraic constructions pertinent to the treatment of languages given by logic formulas. In particular, using the standard semantic view of quantification as projection, we derive a notion of Sch\\\"utzenberger product for Boolean spaces with internal monoids. This makes heavy use of the Vietoris construction, and its dual functor, which is central to the coalgebraic treatment of classical modal logic. We show that the unary Sch\\\"utzenberger product for spaces, when applied to a recogniser for the language associated to a formula with a free first-order variable, yields a recogniser for the language of all models of the corresponding existentially quantified formula. Further, we generalise global and local versions of the theorems of Sch\\\"utzenberger and Reutenauer characterising the languages recognised by the binary Sch\\\"utzenberger product. Finally, we provide an equational characterisation of Boolean algebras obtained by local Sch\\\"utzenberger product with the one element space based on an Egli-Milner type condition on generalised factorisations of ultrafilters on words.","authors":["Mai Gehrke","Daniela Petrisan","Luca Reggio"],"meta":["March 2016"],"references":["282997240_Using_Duality_in_Circuit_Complexity","281431824_Ultrafilters_on_words_for_a_fragment_of_logic","271218746_Varieties_of_Languages_in_a_Category","321338293_Topologies_on_spaces_of_subsets","314669407_Using_Duality_in_Circuit_Complexity","267112175_Algebra_in_the_Stone-Cech_compactification_Theory_and_applications_2nd_revised_and_extended_ed","266433584_Finite_Automata_Formal_Logic_and_Circuit_Complexity","262233701_Algebra-Coalgebra_Duality_in_Brzozowski's_Minimization_Algorithm","256476900_Stone_duality_topological_algebra_and_recognition","242650242_The_Theory_of_Representations_for_Boolean_Algebras"]}