{"id":"301896214_Application_of_Deep_Convolutional_Neural_Networks_for_Detecting_Extreme_Weather_in_Climate_Datasets","abstract":"Detecting extreme events in large datasets is a major challenge in climate science research. Current algorithms for extreme event detection are build upon human expertise in defining events based on subjective thresholds of relevant physical variables. Often, multiple competing methods produce vastly different results on the same dataset. Accurate characterization of extreme events in climate simulations and observational data archives is critical for understanding the trends and potential impacts of such events in a climate change content. This study presents the first application of Deep Learning techniques as alternative methodology for climate extreme events detection. Deep neural networks are able to learn high-level representations of a broad class of patterns from labeled data. In this work, we developed deep Convolutional Neural Network (CNN) classification system and demonstrated the usefulness of Deep Learning technique for tackling climate pattern detection problems. Coupled with Bayesian based hyper-parameter optimization scheme, our deep CNN system achieves 89\\%-99\\% of accuracy in detecting extreme events (Tropical Cyclones, Atmospheric Rivers and Weather Fronts","authors":["Yunjie Liu","Evan Racah","Mr Prabhat","Joaquin Correa"],"meta":["May 2016","Project: MANTISSA"],"references":["305196650_Going_deeper_with_convolutions","281939486_TECA_Petascale_Pattern_Recognition_for_Climate_Science","278413880_Convolutional_LSTM_Network_A_Machine_Learning_Approach_for_Precipitation_Nowcasting","272522140_Scalable_Bayesian_Optimization_Using_Deep_Neural_Networks","319770465_Sequence_to_Sequence_Learning_with_Neural_Networks","319770430_Rich_feature_hierarchies_for_accurate_object_detection_and_semantic_segmentation","319770184_Speech_Recognition_With_Deep_Recurrent_Neural_Networks","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","304533937_Learning_representations_by_back_propagating_errors_Cogn","281674616_Tropical_cyclogenesis_in_wind_shear_Climatological_relationships_and_physical_processes"]}