{"id":"301843129_Improved_Cryptanalysis_of_Rank_Metric_Schemes_Based_on_Gabidulin_Codes","abstract":"We prove that any variant of the GPT cryptosystem which uses a right column scrambler over the extension field as advocated by the works of Gabidulin et al. with the goal to resist to Overbeck's structural attack are actually still vulnerable to that attack. We show that by applying the Frobenius operator appropriately on the public key, it is possible to build a Gabidulin code having the same dimension as the original secret Gabidulin code but with a lower length. In particular, the code obtained by this way correct less errors than the secret one but its error correction capabilities are beyond the number of errors added by a sender, and consequently an attacker is able to decrypt any ciphertext with this degraded Gabidulin code. We also considered the case where an isometric transformation is applied in conjunction with a right column scrambler which has its entries in the extension field. We proved that this protection is useless both in terms of performance and security. Consequently, our results show that all the existing techniques aiming to hide the inherent algebraic structure of Gabidulin codes have failed.","authors":["Ayoub Otmani","Hervé Talé Kalachi","Sélestin Ndjeya"],"meta":["September 2018Designs Codes and Cryptography 86(5)","DOI:10.1007/s10623-017-0434-5"],"references":["283531644_Extension_of_Overbeck's_Attack_for_Gabidulin_Based_Cryptosystems","234801344_Ideals_over_a_Non-Commutative_Ring_and_their_Application_in_Cryptology","234060058_On_the_Complexity_of_the_Rank_Syndrome_Decoding_Problem","224578898_On_improving_security_of_GPT_cryptosystems","306117475_Considerations_for_rank-based_cryptosystems","280821144_Polynomial-Time_Algorithms_for_Prime_Factorization_and_Discrete_Logarithms_on_a_Quantum_Computer","257641664_Modified_GPT_PKC_with_right_scrambler","237129063_A_public_k_e_y_system_based_on_algebraic_coding_theory","225997042_Structural_Attacks_for_Public_Key_Cryptosystems_based_on_Gabidulin_Codes","225672331_A_New_Structural_Attack_for_GPT_and_Variants"]}