{"id":"301896026_Communication_Cost_for_Updating_Linear_Functions_When_Message_Updates_are_Sparse_Connections_to_Maximally_Recoverable_Codes","abstract":"We consider a communication problem in which an update of the source message needs to be conveyed to one or more distant receivers that are interested in maintaining specific linear functions of the source message. The setting is one in which the updates are sparse in nature, and where neither the source nor the receiver(s) is aware of the exact {\\em difference vector}, but only know the amount of sparsity that is present in the difference-vector. Under this setting, we are interested in devising linear encoding and decoding schemes that minimize the communication cost involved. We show that the optimal solution to this problem is closely related to the notion of maximally recoverable codes (MRCs), which were originally introduced in the context of coding for storage systems. In the context of storage, MRCs guarantee optimal erasure protection when the system is partially constrained to have local parity relations among the storage nodes. In our problem, we show that optimal solutions exist if and only if MRCs of certain kind (identified by the desired linear functions) exist. We consider point-to-point and broadcast versions of the problem, and identify connections to MRCs under both these settings.","authors":["Prakash Narayana Moorthy","Muriel Médard"],"meta":["May 2016IEEE Transactions on Information Theory 64(12)","DOI:10.1109/TIT.2018.2865750"],"references":["279864728_Weight_Enumerators_and_Higher_Support_Weights_of_Maximally_Recoverable_Codes","273005528_File_Updates_Under_RandomArbitrary_Insertions_And_Deletions","265386013_Synchronizing_Edits_in_Distributed_Storage_Networks","263352461_STAIR_Codes_A_General_Family_of_Erasure_Codes_for_Tolerating_Device_and_Sector_Failures","308836509_On_partial_maximally-recoverable_and_maximally-recoverable_codes","308832992_Sector-disk_codes_and_partial_MDS_codes_with_up_to_three_global_parities","305875066_Synchronizing_edits_in_distributed_storage_networks","273564385_Locally_Repairable_Codes","271532186_On_Partial_Maximally-Recoverable_and_Maximally-Recoverable_Codes","271466525_Partial_MDS_PMDS_and_Sector-Disk_SD_codes_that_tolerate_the_erasure_of_two_random_sectors"]}