{"id":"301835644_Distributed_Algorithms_for_Computation_of_Centrality_Measures_in_Complex_Networks","abstract":"This paper is concerned with distributed computation of several commonly used centrality measures in complex networks. In particular, we propose deterministic algorithms, which converge in finite time, for the distributed computation of the degree, closeness and betweenness centrality measures in directed graphs. Regarding eigenvector centrality, we consider the PageRank problem as its typical variant, and design distributed randomized algorithms to compute PageRank for both fixed and time-varying graphs. A key feature of the proposed algorithms is that they do not require to know the network size, which can be simultaneously estimated at every node, and that they are clock-free. To address the PageRank problem of time-varying graphs, we introduce the novel concept of persistent graph, which eliminates the effect of spamming nodes. Moreover, we prove that these algorithms converge almost surely and in the sense of $L^p$. Finally, the effectiveness of the proposed algorithms is illustrated via extensive simulations using a classical benchmark.","authors":["Keyou You","Roberto Tempo","Li Qiu"],"meta":["July 2015"],"references":["277028714_Distributed_Randomized_PageRank_Algorithm_Based_on_Stochastic_Approximation","271462630_Distributed_computation_of_node_and_edge_betweenness_on_tree_graphs","268061986_Distributed_estimation_of_diameter_radius_and_eccentricities_in_anonymous_networks","323725486_Randomized_algorithms_for_analysis_and_control_of_uncertain_systems_With_applications","280566512_Networks_An_Introduction","278871259_Special_Issue_on_Distributed_Computing_and_Networking_Preface","278402203_A_Distributed_Newton_Method_for_Network_Utility_Maximization-I_Algorithm","275981329_Convergence_of_Probability_Measures","269031298_Distributed_Estimation_of_Diameter_Radius_and_Eccentricities_in_Anonymous_Networks","268617371_Discrete-Time_Markov_Jump_Linear_Systems"]}