{"id":"301837010_The_Conditional_Lucas_Kanade_Algorithm","abstract":"The Lucas & Kanade (LK) algorithm is the method of choice for efficient dense image and object alignment. The approach is efficient as it attempts to model the connection between appearance and geometric displacement through a linear relationship that assumes independence across pixel coordinates. A drawback of the approach, however, is its generative nature. Specifically, its performance is tightly coupled with how well the linear model can synthesize appearance from geometric displacement, even though the alignment task itself is associated with the inverse problem. In this paper, we present a new approach, referred to as the Conditional LK algorithm, which: (i) directly learns linear models that predict geometric displacement as a function of appearance, and (ii) employs a novel strategy for ensuring that the generative pixel independence assumption can still be taken advantage of. We demonstrate that our approach exhibits superior performance to classical generative forms of the LK algorithm. Furthermore, we demonstrate its comparable performance to state-of-the-art methods such as the Supervised Descent Method with substantially less training examples, as well as the unique ability to \"swap\" geometric warp functions without having to retrain from scratch. Finally, from a theoretical perspective, our approach hints at possible redundancies that exist in current state-of-the-art methods for alignment that could be leveraged in vision systems of the future.","authors":["Chen-Hsuan Lin","Rui Zhu","Simon Lucey"],"meta":["March 2016"],"references":["300937010_Bit-Planes_Dense_Subpixel_Alignment_of_Binary_Descriptors","276208180_Feature-Based_Lucas-Kanade_and_Active_Appearance_Models","262071173_Supervised_Descent_Method_for_Solving_Nonlinear_Least_Squares_Problems_in_Computer_Vision","240446286_Multi-PIE","316240097_Distinctive_Image_Features_from_Scale-Invariant_Keypoints","304469237_Global_supervised_descent_method","294285621_In_Defense_of_Gradient-Based_Alignment_on_Densely_Sampled_Sparse_Features","281327886_Histograms_of_Oriented_Gradients_for_Human_Detection","279827221_Discriminative_generative_and_imitative_learning","261479309_Supervised_Descent_Method_and_Its_Applications_to_Face_Alignment"]}