{"id":"301827317_Jabba_Hybrid_error_correction_for_long_sequencing_reads","abstract":"Background\nThird generation sequencing platforms produce longer reads with higher error rates than second generation technologies. While the improved read length can provide useful information for downstream analysis, underlying algorithms are challenged by the high error rate. Error correction methods in which accurate short reads are used to correct noisy long reads appear to be attractive to generate high-quality long reads. Methods that align short reads to long reads do not optimally use the information contained in the second generation data, and suffer from large runtimes. Recently, a new hybrid error correcting method has been proposed, where the second generation data is first assembled into a de Bruijn graph, on which the long reads are then aligned.\n\nResults\nIn this context we present Jabba, a hybrid method to correct long third generation reads by mapping them on a corrected de Bruijn graph that was constructed from second generation data. Unique to our method is the use of a pseudo alignment approach with a seed-and-extend methodology, using maximal exact matches (MEMs) as seeds. In addition to benchmark results, certain theoretical results concerning the possibilities and limitations of the use of MEMs in the context of third generation reads are presented.\n\nConclusion\nJabba produces highly reliable corrected reads: almost all corrected reads align to the reference, and these alignments have a very high identity. Many of the aligned reads are error-free. Additionally, Jabba corrects reads using a very low amount of CPU time. From this we conclude that pseudo alignment with MEMs is a fast and reliable method to map long highly erroneous sequences on a de Bruijn graph.","authors":["Giles Miclotte","Mahdi Heydari","Piet Demeester","Stephane Rombauts"],"meta":["May 2016Algorithms for Molecular Biology 11(1)","DOI:10.1186/s13015-016-0075-7"],"references":["280103451_Karect_Accurate_Correction_of_Substitution_Insertion_and_Deletion_Errors_for_Next-generation_Sequencing_Data","276360302_A_long_fragment_aligner_called_ALFALFA","273325414_SHREC_A_short-read_error_correction_method","269767012_An_improved_genome_of_the_model_marine_alga_Ostreococcus_tauri_unfolds_by_assessing_Illumina_de_novo_assemblies","265135001_LoRDEC_Accurate_and_efficient_long_read_error_correction","263860723_Proovread_Large-scale_high-accuracy_PacBio_correction_through_iterative_short_read_consensus","263054859_Blue_Correcting_sequencing_errors_using_consensus_and_context","290108737_Efficient_Local_Alignment_Discovery_amongst_Noisy_Long_Reads","277143688_Assembling_Large_Genomes_with_Single-Molecule_Sequencing_and_Locality_Sensitive_Hashing","265503608_The_surprising_predictability_of_long_runs"]}