{"id":"301854694_Enhanced_X-ray-phase-contrast-tomography_brings_new_clarity_to_the_2000-year-old_'voice'_of_Epicurean_philosopher_Philodemus","abstract":"A collection of more than 1800 carbonized Greek and Latin papyri, discovered in the Roman Villa dei Papiri at Herculaneum in the middle of 18th century, is the unique classical library survived from antiquity. These ancient-Herculaneum-papyri were charred during 79 A.D. Vesuvius eruption, a circumstance which providentially preserved them until now. This magnificent collection contains valuable work by Greek philosophers, such as Epicurus, Chrysippus and Philodemus, in particular an impressive amount of extensive treatises by Philodemus of Gadara, an Epicurean philosopher of the 1st century BC. The aim of the present study is to read extended and hitherto unknown portions of text hidden inside carbonized-Herculaneum-papyri using enhanced X-ray-phase-contrast-tomography (XPCT) non-destructive technique and a new set of numerical algorithms for virtual-unrolling. This paper documents our success in revealing the largest portion of Greek text ever detected so far inside unopened scrolls, with unprecedented spatial resolution and contrast, all without damaging these precious historical manuscripts. Parts of texts have been decoded and the 'voice' of Epicurean philosopher Philodemus is brought back again after 2000 years from rolled-up carbonized Herculaneum-papyri.","authors":["Inna Bukreeva","Alberto Mittone","Alberto Bravin","Festa Giulia"],"meta":["June 2016Scientific Reports 6(1):27227","DOI:10.1038/srep27227"],"references":["283150713_Structural_analysis_of_hierarchically_organized_zeolites","272680484_The_Villa_of_the_Papyri_at_Herculaneum_Archaeology_Reception_and_Digital_Reconstruction_Sozomena_1_Berlin_De_Gruyter_2010","271333714_Revealing_letters_in_rolled_Herculaneum_papyri_by_X-ray_phase-contrast_imaging","233878899_X-ray_phase-contrast_imaging_From_pre-clinical_applications_towards_clinics","224436197_Phase_contrast_hard_x-ray_microscopy_with_submicron_resolution","215659053_A_GPU-Based_Architecture_for_Real-Time_Data_Assessment_at_Synchrotron_Experiments","51231142_ANKAphase_Software_for_single-distance_phase_retrieval_from_inline_X-ray_phase-contrast_radiographs","262233069_Virtual_unrolling_and_information_recovery_from_scanned_scrolled_historical_documents","223881307_Phase_retrieval_using_coherent_imaging_systems_with_linear_transfer_functions","4193875_Opaque_document_imaging_building_images_of_inaccessible_texts"]}