{"id":"301856837_Local_cascades_induced_global_contagion_How_heterogeneous_thresholds_exogenous_effects_and_unconcerned_behaviour_govern_online_adoption_spreading","abstract":"Adoption of innovations, products or online services is commonly interpreted as a spreading process driven to large extent by social influence and conditioned by the needs and capacities of individuals. To model this process one usually introduces behavioural threshold mechanisms, which can give rise to the evolution of global cascades if the system satisfies a set of conditions. However, these models do not address temporal aspects of the emerging cascades, which in real systems may evolve through various pathways ranging from slow to rapid patterns. Here we fill this gap through the analysis and modelling of product adoption in the world's largest voice over internet service, the social network of Skype. We provide empirical evidence about the heterogeneous distribution of fractional behavioural thresholds, which appears to be independent of the degree of adopting egos. We show that the structure of real-world adoption clusters is radically different from previous theoretical expectations, since vulnerable adoptions --induced by a single adopting neighbour-- appear to be important only locally, while spontaneous adopters arriving at a constant rate and the involvement of unconcerned individuals govern the global emergence of social spreading.","authors":["Márton Karsai","Gerardo Iñiguez","Riivo Kikas","Kimmo Kaski"],"meta":["January 2016Scientific Reports 6(1)","DOI:10.1038/srep27178"],"references":["308062589_The_Dynamics_of_Viral_Marketing","280912356_Trend-driven_information_cascades_on_random_networks","277722976_The_Impact_of_Heterogeneous_Thresholds_on_Social_Contagion_with_Multiple_Initiators","277603776_Kinetics_of_Social_Contagion","321246119_A_simple_model_of_global_cascades_on_random_networks","305720251_A_New_Product_Growth_Model_for_Consumer_Durables","288945826_Divergence_measures_based_on_the_Shannon_entropy","282789102_Journal_of_Complex_Networks_Quo_Vadis","280566512_Networks_An_Introduction","274799723_Diffusion_of_Innovations"]}