{"id":"301856754_Feature_Selection_A_Data_Perspective","abstract":"Feature selection, as a data preprocessing strategy, has been proven to be effective and efficient in preparing high-dimensional data for data mining and machine learning problems. The objectives of feature selection include: building simpler and more comprehensible models, improving data mining performance, and preparing clean, understandable data. The recent proliferation of big data has presented some substantial challenges and opportunities of feature selection algorithms. In this survey, we provide a comprehensive and structured overview of recent advances in feature selection research. Motivated by current challenges and opportunities in the big data age, we revisit feature selection research from a data perspective, and review representative feature selection algorithms for generic data, structured data, heterogeneous data and streaming data. Methodologically, to emphasize the differences and similarities of most existing feature selection algorithms for generic data, we generally categorize them into four groups: similarity based, information theoretical based, sparse learning based and statistical based methods. Finally, to facilitate and promote the research in this community, we also present a open-source feature selection repository that consists of most of the popular feature selection algorithms (http://featureselection.asu.edu/). At the end of this survey, we also have a discussion about some open problems and challenges that need to be paid more attention in future research.","authors":["Jundong Li","Kewei Cheng","Suhang Wang","Fred Morstatter"],"meta":["January 2016ACM Computing Surveys 50(6)","DOI:10.1145/3136625"],"references":["335437448_Structured_Graph_Optimization_for_Unsupervised_Feature_Selection","329475599_Regression_Shrinkage_and_Selection_Via_the_Lasso","328255413_Feature_Selection_with_Unsupervised_Consensus_Guidance","327767128_Statistical_Learning_with_Sparsity_The_Lasso_and_Generalizations","321892203_A_Randomized_Approach_for_Crowdsourcing_in_the_Presence_of_Multiple_Views","318139181_The_interpretation_of_population_structure_by_F-statistics_with_special_regard_to_systems_of_mating","313659887_1-norm_support_vector_machines","313469564_Robust_Multi-View_Feature_Selection","313453500_Toward_Time-Evolving_Feature_Selection_on_Dynamic_Networks","312538118_Support-vector_networks"]}