{"id":"301879687_Building_Machines_That_Learn_and_Think_Like_People","abstract":"Recent progress in artificial intelligence (AI) has renewed interest in building systems that learn and think like people. Many advances have come from using deep neural networks trained end-to-end in tasks such as object recognition, video games, and board games, achieving performance that equals or even beats humans in some respects. Despite their biological inspiration and performance achievements, these systems differ from human intelligence in crucial ways. We review progress in cognitive science suggesting that truly human-like learning and thinking machines will have to reach beyond current engineering trends in both what they learn, and how they learn it. Specifically, we argue that these machines should (a) build causal models of the world that support explanation and understanding, rather than merely solving pattern recognition problems; (b) ground learning in intuitive theories of physics and psychology, to support and enrich the knowledge that is learned; and (c) harness compositionality and learning-to-learn to rapidly acquire and generalize knowledge to new tasks and situations. We suggest concrete challenges and promising routes towards these goals that can combine the strengths of recent neural network advances with more structured cognitive models.","authors":["Brenden M. Lake","Tomer Ullman","Joshua B. Tenenbaum","Samuel J. Gershman"],"meta":["April 2016Behavioral and Brain Sciences arXiv","DOI:10.1017/S0140525X16001837"],"references":["345774309_Why_Only_Us_Language_and_Evolution","334585057_A_Framework_For_Representing_Knowledge","332087361_The_Algebraic_Mind_Integrating_Connectionism_and_Cognitive_Science","329650509_Semantic_Cognition_A_Parallel_Distributed_Processing_Approach","325671960_Causal_knowledge_and_categories_The_effects_of_causal_beliefs_on_categorization_induction_and_similarity","324110517_Theory_for_the_development_of_neuron_selectivity_orientation_specificity_and_binocular_interaction_in_visual_cortex","319770626_Multi-column_Deep_Neural_Networks_for_Image_Classification","319770416_DRAW_A_Recurrent_Neural_Network_For_Image_Generation","319770357_DeCAF_A_Deep_Convolutional_Activation_Feature_for_Generic_Visual_Recognition","319770249_Deep_Visual-Semantic_Alignments_for_Generating_Image_Descriptions"]}