{"id":"301878650_Classifying_Developers_into_Core_and_Peripheral_An_Empirical_Study_on_Count_and_Network_Metrics","abstract":"Knowledge about the roles developers play in a software project is crucial to understanding the project's collaborative dynamics. Developers are often classified according to the dichotomy of core and peripheral roles. Typically, operationalizations based on simple counts of developer activities (e.g., number of commits) are used for this purpose, but there is concern regarding their validity and ability to elicit meaningful insights. To shed light on this issue, we investigate whether commonly used operationalizations of core--peripheral roles produce consistent results, and we validate them with respect to developers' perceptions by surveying 166 developers. Improving over the state of the art, we propose a relational perspective on developer roles, using developer networks to model the organizational structure, and by examining core--peripheral roles in terms of developers' positions and stability within the organizational structure. In a study of 10 substantial open-source projects, we found that the existing and our proposed core--peripheral operationalizations are largely consistent and valid. Furthermore, we demonstrate that a relational perspective can reveal further meaningful insights, such as that core developers exhibit high positional stability, upper positions in the hierarchy, and high levels of coordination with other core developers.","authors":["Mitchell Joblin","Sven Apel","Claus Hunsen","Wolfgang Mauerer"],"meta":["April 2016"],"references":["283247247_Evolutionary_Trends_of_Developer_Coordination_A_Network_Approach","265787800_Identification_of_core-periphery_structure_in_networks","262222053_Characterizing_Key_Developers_A_Case_Study_with_Apache_Ant","326710867_Hierarchical_organization_in_complex_networks","314814272_Evolution_patterns_of_open-source_software_systems_and_communities","308823779_From_Developer_Networks_to_Verified_Communities_A_Fine-Grained_Approach","280940018_Pattern_Recognition_and_Machine_Learning","277664949_The_Cathedral_and_Bazaar","261718081_The_Effect_of_Governance_on_Global_Software_Development_An_Empirical_Research_in_Transactive_Memory_Systems","260648757_Coordination_Breakdowns_and_Their_Impact_on_Development_Productivity_and_Software_Failures"]}