{"id":"301818290_Deep_Edge_Guided_Recurrent_Residual_Learning_for_Image_Super-Resolution","abstract":"In this work, we consider the image super-resolution (SR) problem. The main challenge of image SR is to recover high-frequency details of a low-resolution (LR) image that are important for human perception. To address this essentially ill-posed problem, we introduce a Deep Edge Guided REcurrent rEsidual~(DEGREE) network to progressively recover the high-frequency details. Different from most of existing methods that aim at predicting high-resolution (HR) images directly, DEGREE investigates an alternative route to recover the difference between a pair of LR and HR images by recurrent residual learning. DEGREE further augments the SR process with edge-preserving capability, namely the LR image and its edge map can jointly infer the sharp edge details of the HR image during the recurrent recovery process. To speed up its training convergence rate, by-pass connections across multiple layers of DEGREE are constructed. In addition, we offer an understanding on DEGREE from the view-point of sub-band frequency decomposition on image signal and experimentally demonstrate how DEGREE can recover different frequency bands separately. Extensive experiments on three benchmark datasets clearly demonstrate the superiority of DEGREE over well-established baselines and DEGREE also provides new state-of-the-arts on these datasets.","authors":["Wenhan Yang","Jiashi Feng","Jianchao Yang","Fang Zhao"],"meta":["April 2016IEEE Transactions on Image Processing PP(99)","DOI:10.1109/TIP.2017.2750403"],"references":["304372494_Joint_sub-band_based_neighbor_embedding_for_image_super-resolution","319770198_Learning_a_Deep_Convolutional_Network_for_Image_Super-Resolution","312830456_Super-Resolution_Using_Sub-Band_Self-Similarity","312771295_Image_quality_assessment_From_error_visibility_to_structural_similarity","311611431_Deeply-Recursive_Convolutional_Network_for_Image_Super-Resolution","311610731_Accurate_Image_Super-Resolution_Using_Very_Deep_Convolutional_Networks","300412657_Deep_Networks_for_Image_Super-Resolution_with_Sparse_Prior","288640908_A_Adjusted_Anchored_Neighborhood_Regression_for_Fast_Super-Resolution","286680078_Sub-band_Energy_Constraints_for_Self-Similarity_Based_Super-resolution","286512696_Deep_Residual_Learning_for_Image_Recognition"]}