{"id":"301898216_Science_Concierge_A_Fast_Content-Based_Recommendation_System_for_Scientific_Publications","abstract":"Finding relevant publications or presentations matters to scientists who have to cope with exponentially increasing numbers of published papers. Algorithms help with this task, analogous to the ones used for music, movie, or product recommendations. However, we know little about the performance of these algorithms with scholarly material. Here, we develop an algorithm, and an accompanying Python library, that implements a recommendation system based on the content of voted relevant and irrelevant articles. The algorithm has as design principles the ability to rapidly adapt to new content, provide near-real time suggestions, and be open source. We tested the library on 15K posters from the Society of Neuroscience Conference 2015. We viewed human curated topics assignments as inducing a noisy similarity metric and optimized our algorithm to produce a similarity metric that maximally correlated with the human one. We show that our algorithm significantly outperformed suggestions based on keywords. The work presented here promises to make the exploration of scholarly material faster and more accurate.","authors":["Titipat Achakulvisut","Daniel E Acuna","Tulakan Ruangrong","Konrad Kording"],"meta":["April 2016PLoS ONE 11(7)","DOI:10.1371/journal.pone.0158423"],"references":["284576917_Glove_Global_Vectors_for_Word_Representation","271769882_An_Empirical_Evaluation_of_Models_of_Text_Document_Similarity","271528914_High-Reproducibility_and_High-Accuracy_Method_for_Automated_Topic_Classification","267853685_Comparison_of_Human_and_Latent_Semantic_Analysis_LSA_Judgements_of_Pairwise_Document_Similarities_for_a_News_Corpus","319770439_Efficient_Estimation_of_Word_Representations_in_Vector_Space","312637017_Babel_A_Platform_for_Facilitating_Research_in_Scholarly_Article_Discovery","308161218_Introduction_to_information_retrieval_chapt","280940018_Pattern_Recognition_and_Machine_Learning","276935841_Introduction_to_Information_Retrieval","265582018_Parallel_Collaborative_Filtering_for_Streaming_Data"]}