{"id":"301876630_Disease_dynamics_in_a_stochastic_network_game_A_little_empathy_goes_a_long_way_in_averting_outbreaks","abstract":"Individuals change their behavior during an epidemic in response to whether they and/or those they interact with are healthy or sick. Healthy individuals are concerned about contracting a disease from their sick contacts and may utilize protective measures. Sick individuals may be concerned with spreading the disease to their healthy contacts and adopt preemptive measures. Yet, in practice both protective and preemptive changes in behavior come with costs. This paper proposes a stochastic network disease game model that captures the self-interests of individuals during the spread of a susceptible-infected-susceptible (SIS) disease where individuals react to current risk of disease spread, and their reactions together with the current state of the disease stochastically determine the next stage of the disease. We show that there is a critical level of concern, i.e., empathy, by the sick individuals above which disease is eradicated fast. Furthermore, we find that if the network and disease parameters are above the epidemic threshold, the risk averse behavior by the healthy individuals cannot eradicate the disease without the preemptive measures of the sick individuals. This imbalance in the role played by the response of the infected versus the susceptible individuals in disease eradication affords critical policy insights.","authors":["Ceyhun Eksin","Jeff Shamma","Joshua Weitz"],"meta":["March 2017Scientific Reports 7(1)","DOI:10.1038/srep44122"],"references":["280537968_Coupled_disease-behavior_dynamics_on_complex_networks_A_review","273152947_A_Few_Bad_Apples_A_Model_of_Disease_Influenced_Agent_Behaviour_in_a_Heterogeneous_Contact_Environment","268790752_Strategies_for_containing_Ebola_in_West_Africa","331302639_Modeling_Infectious_Diseases_in_Humans_and_Animals","304233497_Epidemic_spread_over_networks_with_agent_awareness_and_social_distancing","283617653_Emergence_of_Scaling_in_Random_Networks","283617410_Emergence_of_Scaling_in_Random_Networks","280566512_Networks_An_Introduction","275667090_Game_theory_of_pre-emptive_vaccination_before_bioterrorism_or_accidental_release_of_smallpox","272247854_Reputations_in_Repeated_Games"]}