{"id":"301838453_Graphlet_characteristics_in_directed_networks","abstract":"A number of network structural characteristics have recently been the subject of particularly intense research, including degree distributions, community structure, and various measures of vertex centrality, to mention only a few. Vertices may have attributes associated with them; for example, properties of proteins in protein-protein interaction networks, users' social network profiles, or authors' publication histories in co-authorship networks. In a network, two vertices might be considered similar if they have similar attributes (features, properties), or they can be considered similar based solely on the network structure. Similarity of this type is called structural similarity, to distinguish it from properties similarity, social similarity, textual similarity, functional similarity or other similarity types found in networks. Here we focus on the similarity problem by computing (1) for each vertex a vector of structural features, called signature vector, based on the number of graphlets associated with the vertex, and (2) for the network its graphlet correlation matrix, measuring graphlets dependencies and hence revealing unknown organizational principles of the network. We found that real-world networks generally have very different structural characteristics resulting in different graphlet correlation matrices. In particular, the graphlet correlation matrix of the brain effective network is computed for 40 healthy subjects and common (present in more than 70 percent subjects) dependencies are raveled. Thus, negative correlations are found for 2-node graphlets and 3-node graphlets that are wedges and positive correlations are found only for 3-node graphlets that are triangles. Graphlets characteristics in directed networks could further significantly increase our understanding of real-world networks.","authors":["Igor Trpevski","Tamara Dimitrova","Tommy Boshkovski","Nikola Stikov"],"meta":["March 2016Scientific Reports 6(1)","DOI:10.1038/srep37057"],"references":["305717922_Computation_of_Graphlet_Orbits_for_Nodes_and_Edges_in_Sparse_Graphs","303326956_Functional_networks_of_motor_inhibition_in_conversion_disorder_patients_and_feigning_subjects","298800647_Unmasking_Latent_Inhibitory_Connections_in_Human_Cortex_to_Reveal_Dormant_Cortical_Memories","314818914_SimRank_a_measure_of_structural-context_similarity","305037467_Higher-order_organization_of_complex_networks","303818468_The_strength_of_weak_ties_A_network_theory_revisited'","299375242_Different_functional_connectivity_and_network_topology_in_behavioral_variant_of_frontotemporal_dementia_and_Alzheimer's_disease_An_EEG_study","287467663_Modeling_Connectivity_in_Health_and_Disease_Examples_from_the_Motor_System","283617653_Emergence_of_Scaling_in_Random_Networks","282265117_Biological_network_comparison_using_graphlet_degree_distribution"]}