{"id":"301817829_Forward-backward_quasi-Newton_methods_for_nonsmooth_optimization_problems","abstract":"The forward-backward splitting method (FBS) for minimizing a nonsmooth composite function can be interpreted as a (variable-metric) gradient method over a continuously differentiable function which we call forward-backward envelope (FBE). This allows to extend algorithms for smooth unconstrained optimization and apply them to nonsmooth (possibly constrained) problems. Since the FBE and its gradient can be computed by simply evaluating forward-backward steps, the resulting methods rely on the very same black-box oracle as FBS. We propose an algorithmic scheme that enjoys the same global convergence properties of FBS when the problem is convex, or when the objective function possesses the Kurdyka-{\\L}ojasiewicz property at its critical points. Moreover, when using quasi-Newton directions the proposed method achieves superlinear convergence provided that usual second-order sufficiency conditions on the FBE hold at the limit point of the generated sequence. Such conditions translate into milder requirements on the original function involving generalized second-order differentiability. We show that BFGS fits our framework and that the limited-memory variant L-BFGS is well suited for large-scale problems, greatly outperforming FBS or its accelerated version in practice. The analysis of superlinear convergence is based on an extension of the Dennis and Mor\\'e theorem for the proposed algorithmic scheme.","authors":["Lorenzo Stella","Andreas Themelis","Panagiotis Patrinos"],"meta":["July 2017Computational Optimization and Applications 67(6)","DOI:10.1007/s10589-017-9912-y"],"references":["301818955_Further_properties_of_the_forward-backward_envelope_with_applications_to_difference-of-convex_programming","321620224_Numerical_Optimization","315573860_Convex_Analysis_and_Monotone_Operator_Theory_in_Hilbert_Spaces","313876742_Proximiteet_dualite_dans_un_espace_hilbertien","312690325_Proximal_splitting_methods_in_signal_processing","309698218_1983_Numerical_methods_for_unconstrained_optimization_and_nonlinear_equations_Prentice-Hall","299553727_Practical_inexact_proximal_quasi-Newton_method_with_global_complexity_analysis","297212576_1ST-ORDER_AND_2ND-ORDER_EPI-DIFFERENTIABILITY_IN_NONLINEAR-PROGRAMMING","297123726_Updating_Quasi-Newton_Matrices_with_Limited_Storage","290055230_Proximal_Newton-type_methods_for_convex_optimization"]}