{"id":"301844565_The_expanding_search_ratio_of_a_graph","abstract":"We study the problem of searching for a hidden target in an environment that is modeled by\nan edge-weighted graph. Most of the previous work on this problem considers the pathwise cost\nformulation, in which the cost incurred by the searcher is the overall time to locate the target,\nassuming that the searcher moves at unit speed. More recent work introduced the setting of\nexpanding search in which the searcher incurs cost only upon visiting previously unexplored areas\nof the graph. Such a paradigm is useful in modeling problems in which the cost of re-exploration\nis negligible (such as coal mining).\nIn our work we study algorithmic and computational issues of expanding search, for a variety\nof search environments including general graphs, trees and star-like graphs. In particular, we\nrely on the deterministic and randomized search ratio as the performance measures of search\nstrategies, which were originally introduced by Koutsoupias and Papadimitriou [ICALP 1996]\nin the context of pathwise search. The search ratio is essentially the best competitive ratio\namong all possible strategies. Our main objective is to explore how the transition from pathwise\nto expanding search affects the competitive analysis, which has applications to optimization\nproblems beyond the strict boundaries of search problems.","authors":["Spyros Angelopoulos","Christoph Dürr","Thomas Lidbetter"],"meta":["February 2016Discrete Applied Mathematics 260(2)","DOI:10.1016/j.dam.2019.01.039"],"references":["275588124_Further_Connections_Between_Contract-Scheduling_and_Ray-Searching_Problems","285320254_Online_searching","275064283_An_Optimal_Search","272590948_Search_games_on_a_network_with_travelling_and_search_costs","270913229_Searching_on_a_line_A_complete_characterization_of_the_optimal_solution","261529653_Search_games_on_networks_with_travelling_and_search_costs_and_with_arbitrary_searcher_starting_points","257285777_Searching_in_the_Plane","255785859_Mining_Coal_or_Finding_Terrorists_The_Expanding_Search_Paradigm","255785773_Search_Games_with_Multiple_Hidden_Objects","243788123_An_improved_approximation_algorithm_for_the_minimum_latency_problem"]}