{"id":"301844270_Shortest_Path_Embeddings_of_Graphs_on_Surfaces","abstract":"The classical theorem of F\\'{a}ry states that every planar graph can be represented by an embedding in which every edge is represented by a straight line segment. We consider generalizations of F\\'{a}ry's theorem to surfaces equipped with Riemannian metrics. In this setting, we require that every edge is drawn as a shortest path between its two endpoints and we call an embedding with this property a shortest path embedding. The main question addressed in this paper is whether given a closed surface S, there exists a Riemannian metric for which every topologically embeddable graph admits a shortest path embedding. This question is also motivated by various problems regarding crossing numbers on surfaces. We observe that the round metrics on the sphere and the projective plane have this property. We provide flat metrics on the torus and the Klein bottle which also have this property. Then we show that for the unit square flat metric on the Klein bottle there exists a graph without shortest path embeddings. We show, moreover, that for large g, there exist graphs G embeddable into the orientable surface of genus g, such that with large probability a random hyperbolic metric does not admit a shortest path embedding of G, where the probability measure is proportional to the Weil-Petersson volume on moduli space. Finally, we construct a hyperbolic metric on every orientable surface S of genus g, such that every graph embeddable into S can be embedded so that every edge is a concatenation of at most O(g) shortest paths.","authors":["Alfredo Hubard","Vojtěch Kaluža","Arnaud de Mesmay","Martin Tancer"],"meta":["December 2017Discrete & Computational Geometry 58(4)","DOI:10.1007/s00454-017-9898-3"],"references":["284024042_The_irreducible_triangulations_of_the_torus","344808504_A_Primer_on_Mapping_Class_Groups","316800490_Foundations_of_Hyperbolic_Manifolds","303499030_Untangling_two_systems_of_noncrossing_curves","285354578_Comment_rendre_geodesique_une_triangulation_d'une_surface","268071789_The_Graph_Crossing_Number_and_its_Variants_A_Survey","267135924_Inversive_Geometry","267126301_Handbook_of_Graph_Drawing_and_Visualization","265158364_A_primer_on_mapping_class_groups_PMS-49","264862510_Discrete_Systolic_Inequalities_and_Decompositions_of_Triangulated_Surfaces","260039404_Embeddability_in_the_3-sphere_is_decidable","254206489_Filling_Riemannian_Manifolds","248390470_Algebraic_Topology","246525962_Introduction_to_Circle_Packing","246156075_Extremals_of_determinants_of_Laplacians"]}