{"id":"301818702_Minimally_complex_ion_traps_as_modules_for_quantum_communication_and_computing","abstract":"Optically linked ion traps are promising as components of network-based quantum technologies, including communication systems and modular computers. Experimental results achieved to date indicate that the fidelity of operations within each ion trap module will be far higher than the fidelity of operations involving the links; fortunately internal storage and processing can effectively upgrade the links through the process of purification. Here we perform the most detailed analysis to date on this purification task, using a protocol which is balanced to maximise fidelity while minimising the device complexity and the time cost of the process. Moreover we 'compile down' the quantum circuit to device-level operations including cooling and shutting events. We find that a linear trap with only five ions (two of one species, three of another) can support our protocol while incorporating desirable features such as 'global control', i.e. laser control pulses need only target an entire zone rather than differentiating one ion from its neighbour. To evaluate the capabilities of such a module we consider its use both as a universal communications node for quantum key distribution, and as the basic repeating unit of a quantum computer. For the latter case we evaluate the threshold for fault tolerant quantum computing using the surface code, finding acceptable fidelities for the 'raw' entangling link as low as 83% (or under 75% if an additional ion is available).","authors":["Ramil Nigmatullin","Christopher J. Ballance","Niel de Beaudrap","Simon C. Benjamin"],"meta":["April 2016New Journal of Physics 18(10)","DOI:10.1088/1367-2630/18/10/103028"],"references":["305821843_Demonstration_of_a_small_programmable_quantum_computer_with_atomic_qubits","304767129_Scalable_ion-photon_quantum_interface_based_on_integrated_diffractive_mirrors","301875001_Robust_Quantum-Network_Memory_Using_Decoherence-Protected_Subspaces_of_Nuclear_Spins","301855123_Observation_of_Quantum_Fingerprinting_Beating_the_Classical_Limit","301816809_Robust_Concurrent_Remote_Entanglement_Between_Two_Superconducting_Qubits","305889363_High-Fidelity_Quantum_Logic_Gates_Using_Trapped-Ion_Hyperfine_Qubits","301879398_High-Fidelity_Universal_Gate_Set_for_9Be_Ion_Qubits","301848227_Co-Designing_a_Scalable_Quantum_Computer_with_Trapped_Atomic_Ions","292136813_Universal_quantum_computation_with_ideal_Clifford_gates_and_noisy_ancillas","287250200_Laser-driven_quantum_logic_gates_with_precision_beyond_the_fault-tolerant_threshold"]}