{"id":"301817892_Index_Modulation_Techniques_for_5G_Wireless_Networks","abstract":"The increasing demand for higher data rates, better quality of service, fully mobile and connected wireless networks lead the researchers to seek new solutions beyond 4G wireless systems. It is anticipated that 5G wireless networks, which are expected to be introduced around 2020, will achieve ten times higher spectral and energy efficiency than current 4G wireless networks and will support data rates up to 10 Gbps for low mobility users. The ambitious goals set for 5G wireless networks require dramatic changes in the design of different layers for next generation communications systems. Massive multiple-input multiple-output (MIMO) systems, filter bank multi-carrier (FBMC) modulation, relaying technologies, and millimeter-wave communications have been considered as some of the strong candidates for the physical layer design of 5G networks. In this article, we shed light on the potential and implementation of index modulation (IM) techniques for MIMO and multi-carrier communications systems which are expected to be two of the key technologies for 5G systems. Specifically, we focus on two promising applications of IM: spatial modulation (SM) and orthogonal frequency division multiplexing with IM (OFDM-IM), and we discuss the recent advances and future research directions in IM technologies towards spectral and energy-efficient 5G wireless networks.","authors":["Ertugrul Basar"],"meta":["April 2016IEEE Communications Magazine 54(7)","DOI:10.1109/MCOM.2016.7509396"],"references":["284209265_On_the_Achievable_Rate_of_OFDM_with_Index_Modulation","275385691_Quadrature_Spatial_Modulation","270633281_Design_Guidelines_for_Spatial_Modulation","283538344_Massive_but_few_active_MIMO","281608031_Multiple-Input_Multiple-Output_OFDM_with_Index_Modulation","279458793_Generalized_Space_and_Frequency_Index_Modulation","279226028_Distributed_Spatial_Modulation_A_Cooperative_Diversity_Protocol_for_Half--Duplex_Relay--Aided_Wireless_Networks","278807196_Enhanced_Spatial_Modulation_with_Multiple_Constellations_and_Two_Active_Antennas","277935161_Generalization_of_Orthogonal_Frequency_Division_Multiplexing_With_Index_Modulation","274078314_Multi-user_spatial_modulation_MIMO"]}