{"id":"301937636_Falls_Among_Persons_Aged_65_Years_With_and_Without_Severe_Vision_Impairment_-_United_States_2014","abstract":"In 2014, an estimated 2.8 million persons aged ≥65 years in the United States reported severe vision impairment* defined as being blind or having severe difficulty seeing, even with eyeglasses. Good vision is important for maintaining balance as well as for identifying low-contrast hazards, estimating distances, and discerning spatial relationships. Conversely, having poor vision increases the risk for falls (1,2). Falls among older adults are common and can cause serious injuries, disabilities, and premature death (1,3). To date, no state-level investigations have examined the annual prevalence of falls among persons with and without severe vision impairment. CDC analyzed data from the 2014 Behavioral Risk Factor Surveillance System (BRFSS) to estimate the state-specific annual prevalence of falls among persons aged ≥65 years with and without self-reported severe vision impairment. Overall, 46.7% of persons with, and 27.7% of older adults without, self-reported severe vision impairment reported having fallen during the previous year. The state-specific annual prevalence of falls among persons aged ≥65 years with severe vision impairment ranged from 30.8% (Hawaii) to 59.1% (California). In contrast, the prevalence of falls among persons aged ≥65 years without severe vision impairment ranged from 20.4% (Hawaii) to 32.4% (Alaska). Developing fall-prevention interventions intended for persons with severe vision impairment will help states manage the impact of vision impairment and falls on health care resources, and can inform state-specific fall prevention initiatives.","authors":["John Crews","Chiu-Fung Chou","Judy A. Stevens","Jinan Saaddine"],"meta":["May 2016MMWR. Morbidity and mortality weekly report 65(17):433-437","DOI:10.15585/mmwr.mm6517a2"],"references":["267788895_Falls-Prevention_Interventions_for_Persons_Who_Are_Blind_or_Visually_Impaired","237058576_Efficacy_of_falls_prevention_interventions_protocol_for_a_systematic_review_and_network_meta-analysis","234089947_Epidemiology_of_falls_and_osteoporotic_fractures_A_systematic_review","24403329_Making_Diabetes_Education_Accessible_For_People_With_Visual_Impairment","7579997_Randomised_controlled_trial_of_prevention_of_falls_in_people_aged_or_75_with_severe_visual_impairment_the_VIP_trial","6775746_The_Costs_of_Fatal_and_Non-Fatal_Falls_among_Older_Adults","257220704_Vision_and_falls_A_multidisciplinary_review_of_the_contributions_of_visual_impairment_to_falls_among_older_adults","47383810_Vision_and_Falls_in_Older_People_Risk_Factors_and_Intervention_Strategies","14037503_Chronic_Medical_Conditions_and_Risk_of_Fall_Injury_Events_at_Home_in_Older_Adults"]}