{"id":"301917637_A_reference_architecture_for_Farm_Software_Ecosystems","abstract":"Smart farming is a management style that includes smart monitoring, planning and control of agricultural processes. This management style requires the use of a wide variety of software and hardware systems from multiple vendors. Adoption of smart farming is hampered because of a poor interoperability and data exchange between ICT components hindering integration. Software Ecosystems is a recent emerging concept in software engineering that addresses these integration challenges. Currently, several Software Ecosystems for farming are emerging. To guide and accelerate these developments, this paper provides a reference architecture for Farm Software Ecosystems. This reference architecture should be used to map, assess design and implement Farm Software Ecosystems. A key feature of this architecture is a particular configuration approach to connect ICT components developed by multiple vendors in a meaningful, feasible and coherent way. The reference architecture is evaluated by verification of the design with the requirements and by mapping two existing Farm Software Ecosystems using the Farm Software Ecosystem Reference Architecture. This mapping showed that the reference architecture provides insight into Farm Software Ecosystems as it can describe similarities and differences. A main conclusion is that the two existing Farm Software Ecosystems can improve configuration of different ICT components. Future research is needed to enhance configuration in Farm Software Ecosystems.","authors":["Jan Willem Kruize","Sjaak Wolfert","Huub Scholten","Cor Verdouw"],"meta":["July 2016Computers and Electronics in Agriculture 125:12-28","DOI:10.1016/j.compag.2016.04.011"],"references":["271457007_Integrating_ICT_Applications_for_Farm_Business_Collaboration_Processes_Using_FI_Space","269273137_A_Future_Internet_Collaboration_Platform_for_Safe_and_Healthy_Food_from_Farm_to_Fork","268189737_Towards_Software_Mass_Customization_for_Business_Collaboration","259510931_A_cloud-based_Farm_Management_System_Architecture_and_implementation","306154155_How_Smart_Connected_Products_are_Transforming_Companies","295240351_Software_Ecosystem_Roles_Classification","292551547_How_Smart_Connected_Products_Are_Transforming_Companies","288867295_Clopenness_of_systems_The_interwoven_nature_of_ecosystems","277675545_Aspects_of_Precision_Agriculture","266515390_ICT_in_Precision_Agriculture_-_diffusion_of_technology_An_overview_of_Precision_Agriculture"]}