{"id":"301917150_Modified_Grey_Wolf_Optimizer_for_Global_Engineering_Optimization","abstract":"Nature-inspired algorithms are becoming popular among researchers due to their simplicity and flexibility. The nature-inspired metaheuristic algorithms are analysed in terms of their key features like their diversity and adaptation, exploration and exploitation, and attractions and diffusion mechanisms. The success and challenges concerning these algorithms are based on their parameter tuning and parameter control. A comparatively new algorithm motivated by the social hierarchy and hunting behavior of grey wolves is Grey Wolf Optimizer (GWO), which is a very successful algorithm for solving real mechanical and optical engineering problems. In the original GWO, half of the iterations are devoted to exploration and the other half are dedicated to exploitation, overlooking the impact of right balance between these two to guarantee an accurate approximation of global optimum. To overcome this shortcoming, a modified GWO (mGWO) is proposed, which focuses on proper balance between exploration and exploitation that leads to an optimal performance of the algorithm. Simulations based on benchmark problems and WSN clustering problem demonstrate the effectiveness, efficiency, and stability of mGWO compared with the basic GWO and some well-known algorithms.","authors":["Nitin Mittal","Urvinder Singh","Balwinder Singh Sohi"],"meta":["January 2016Applied Computational Intelligence and Soft Computing 2016(4598):1-16","DOI:10.1155/2016/7950348"],"references":["285396106_A_novel_hybrid_PSO-GWO_approach_for_unit_commitment_problem","282922904_Time_Series_Forecasting_of_Energy_Commodity_using_Grey_Wolf_Optimizer","314229463_A_parallel_GWO_technique_for_aligning_multiple_molecular_sequences","312907789_Ant_system_Optimization_by_a_colony_of_cooperating_agents","312549295_A_new_evolutionary_based_routing_protocol_for_clustered_heterogeneous_wireless_sensor_networks","304425270_Differential_Evolution_-_A_Simple_and_Efficient_Heuristic_for_global_Optimization_over_Continuous_Spaces","300473879_A_Communication_Strategy_for_Paralleling_Grey_Wolf_Optimizer","295611877_A_Secure_Visual_Secret_Share_VSS_Creation_Scheme_in_Visual_Cryptography_using_Elliptic_Curve_Cryptography_with_Optimization_Technique","285237745_DE-a_simple_and_efficient_heuristic_for_global_optimization_over_continuous_space","284221906_An_optimizing_method_based_on_autonomous_animate_Fish_swarm_algorithm"]}