{"id":"301907915_Vaginal_progesterone_decreases_preterm_birth_34_weeks_of_gestation_in_women_with_a_singleton_gestation_and_a_short_cervix_an_updated_meta-analysis_including_data_from_the_opptimum_study_vaginal_proges","abstract":"Objective\nTo evaluate the efficacy of vaginal progesterone administration for preventing preterm birth and perinatal morbidity and mortality in asymptomatic women with a singleton gestation and a midâ trimester sonographic cervical length (CL)â â ¤â 25â mm.Methods\nThis was an updated systematic review and metaâ analysis of randomized controlled trials comparing the use of vaginal progesterone to placebo/no treatment in women with a singleton gestation and a midâ trimester sonographic CL â ¤â 25â mm. Electronic databases, from their inception to May 2016, bibliographies and conference proceedings were searched. The primary outcome measure was preterm birth â ¤â 34â weeks of gestation or fetal death. Two reviewers independently selected studies, assessed the risk of bias and extracted the data. Pooled relative risks (RRs) with 95% confidence intervals (CI) were calculated.ResultsFive trials involving 974 women were included. A metaâ analysis, including data from the OPPTIMUM study, showed that vaginal progesterone significantly decreased the risk of preterm birthâ â ¤â 34â weeks of gestation or fetal death compared to placebo (18.1% vs 27.5%; RR, 0.66 (95%â CI, 0.52â 0.83); Pâ =â 0.0005; five studies; 974 women). Metaâ analyses of data from four trials (723 women) showed that vaginal progesterone administration was associated with a statistically significant reduction in the risk of preterm birth occurring at <â 28 toâ <â 36 gestational weeks (RRs from 0.51 to 0.79), respiratory distress syndrome (RR, 0.47 (95%â CI, 0.27â 0.81)), composite neonatal morbidity and mortality (RR, 0.59 (95%â CI, 0.38â 0.91)), birth weightâ <â 1500â g (RR, 0.52 (95%â CI, 0.34â 0.81)) and admission to the neonatal intensive care unit (RR, 0.67 (95%â CI, 0.50â 0.91)). There were no significant differences in neurodevelopmental outcomes at 2â years of age between the vaginal progesterone and placebo groups.Conclusion\nThis updated systematic review and metaâ analysis reaffirms that vaginal progesterone reduces the risk of preterm birth and neonatal morbidity and mortality in women with a singleton gestation and a midâ trimester CL â ¤â 25â mm, without any deleterious effects on neurodevelopmental outcome. Clinicians should continue to perform universal transvaginal CL screening at 18â 24â weeks of gestation in women with a singleton gestation and to offer vaginal progesterone to those with a CL â ¤â 25â mm. Published 2016. This article is a U.S. Government work and is in the public domain in the USA.This article has been selected for Journal Club. Click here to view slides and discussion points.","authors":["Roberto Romero","Kypros Nicolaides","Agustin Conde-Agudelo","John M. O'brien"],"meta":["April 2016Ultrasound in Obstetrics and Gynecology 48(3)","DOI:10.1002/uog.15953","Project: Vaginal Progesterone"],"references":["336209946_Cochrane_Handbook_for_Systematic_Reviews_of_Interventions","304249778_Vaginal_progesterone_on_the_prevention_of_preterm_birth_and_neonatal_complications_in_high_risk_women_A_randomized_placebo-controlled_double-blind_study","350240943_Analysing_data_and_undertaking_meta-analyses","315268140_Preterm_Birth_3_An_Overview_of_Mortality_and_Sequelae_of_Preterm_Birth_From_Infancy_to_Adulthood","312466423_Chapter_8_assessing_risk_of_bias_in_included_studies","311212637_Prevention_of_Preterm_Birth_With_Vaginal_Progesterone_or_17-Alpha-Hydroxyprogesterone_Caproate_A_Critical_Examination_of_Efficacy_and_Safety","309235599_Preterm_birth_Causes_Consequences_and_prevention","308935503_Progesterone_for_Prevention_of_Preterm_Birth_-_Evidence-based_Indications","305433176_Cost-effectiveness_of_risk-based_screening_for_cervical_length_to_prevent_preterm_birth","298812131_17_Alpha-hydroxyprogesterone_caproate_for_preterm_prevention_Issues_in_subgroup_analysis"]}