{"id":"301930535_A_New_Method_for_Mining_High_Average_Utility_Itemsets","abstract":"Data mining is one of exciting fields in recent years. Its purpose is to discover useful information and knowledge from large databases for business decisions and other areas. One engineering topic of data mining is utility mining which discovers high-utility itemsets. An itemset in traditional utility mining considers individual profits and quantities of items in transactions regardless of its length. The average-utility measure is then proposed. This measure is the total utility of an itemset divided by the number of items. Several mining algorithms were also proposed for mining high average-utility itemsets (HAUIs) from a transactional database. However, the number of generated candidates is very large since an itemset is not a HAUI, but itemsets generated from it and others can be HAUIs. Some effective approaches have been proposed to prune candidates and save time. This paper proposes a new method to mine HAUI from transaction databases. The advantage of this method is to reduce candidates efficiently by using HAUI-Tree. A new itemset structure is also developed to improve the speed of calculating the values of itemsets and optimize the memory usage.","authors":["Tien Lu","Bay Vo","Hien Nguyen","Tzung-Pei Hong"],"meta":["November 2014","DOI:10.1007/978-3-662-45237-0_5","Conference: IFIP International Conference on Computer Information Systems and Industrial Management"],"references":["220963766_A_Novel_Algorithm_for_Mining_High_Utility_Itemsets","303206384_Data_Mining_Concepts_and_Techniques","263884951_Efficiently_mining_high_average-utility_itemsets_with_an_improved_upper-bound_strategy","257404653_A_new_method_for_mining_Frequent_Weighted_Itemsets_based_on_WIT-trees","242396122_Data_mining_concepts_and_techniques_morgan_kaufmann","224130534_Mining_High_Transaction-Weighted_Utility_Itemsets","220895396_A_Two-Phase_Algorithm_for_Fast_Discovery_of_High_Utility_Itemsets","220688795_Data_Mining_Concepts_and_Techniques","220588221_A_Projection-Based_Approach_for_Discovering_High_Average-Utility_Itemsets","220385241_High_Utility_Itemsets_Mining","220218388_An_effective_tree_structure_for_mining_high_utility_itemsets","220218119_Effective_utility_mining_with_the_measure_of_average_utility","220204712_HUC-Prune_An_efficient_candidate_pruning_technique_to_mine_high_utility_patterns"]}