{"id":"302069754_Weight-sensitive_stress_and_acoustic_correlates_of_disyllabic_words_in_Marathi","abstract":"Little of the literature on Marathi phonology addresses stress, and none of it systematically. The tentative accounts that do exist are contradictory in their descriptions (Pandharipande 1997, Dhongde and Wali 2009). Moreover, there is no research on the acoustic correlates of Marathi stress. To address this gap, this study investigates word-level stress and the acoustic correlates of stress in disyllabic words in Modern Standard Marathi. Since weight criteria vary across languages (Hayes 1995, Gordon 2004), the main goals are to determine what constitutes heavy syllables and whether or not long vowels behave like heavy vowels with two moras (µµ). Three main hypotheses are tested: (H1) stress is weight-sensitive, (H2) Marathi follows the Latin weight system (Gordon 2002) with CVX heavy, and (H3) when syllables have the same weight the left-most syllable bears stress. The study tests these hypotheses using auditory and spectrographic analyses of recordings from two native Marathi speakers. Results confirm all three hypotheses: H1: Marathi has weight-sensitive stress, H2: it follows the Latin weight distinction and, H3: the first syllable is stressed when syllable weight is equal. Preliminary acoustic results indicate that pitch, F1, and F2 are slightly higher in stressed syllables than in unstressed syllables.","authors":["Esther Le Grezause"],"meta":["April 2016The Journal of the Acoustical Society of America 139(4):2217-2217","DOI:10.1121/1.4950636"],"references":["26833734_Effects_of_Speaking_Rate_and_Vowel_Length_on_Formant_Frequency_Displacement_in_Japanese","300820640_The_role_of_onsets_in_primary_and_secondary_stress_patterns","265765169_Onsets_contribute_to_syllable_weight_Statistical_evidence_from_stress_and_meter","262272670_Indian_Language_Screen_Readers_and_Syllable_Based_Festival_Text-to-Speech_Synthesis_System","239657850_Universal_phonetics_and_the_organization_of_grammars","236699617_A_Phonetically_Driven_Account_of_Syllable_Weight","231743872_The_fundamentals_of_particle_phonology","229267172_A_cross-linguistic_investigation_of_cues_to_vowel_length_perception","227053524_A_Perceptually-Driven_Account_of_Onset-Sensitive_Stress","37693366_Metrical_Stress_Theory_Principles_and_Case_Studies","35255652_Syllable_weight_phonetics_phonology_and_typology"]}