{"id":"302394308_Kundenorientierte_Produktentwicklung_in_der_Automobilindustrie","abstract":"Die Umsetzung von Innovationen in marktgängige Neuprodukte sichert nachhaltig den wirtschaftlichen Erfolg und die Existenz des Unternehmens und trägt so zu dessen Werterhöhung bei. Von 100 Entwicklungsprojekten führen jedoch lediglich zehn zu einem nachhaltigen und dauerhaften Markterfolg. Diese Tatsache steht in einem strikten Gegensatz zu der frühzeitig empirisch belegten Bedeutung von F&E für das Unternehmenswachstum.1 Peters und Waterman definierten bereits zu Beginn der 80er Jahre die „Nähe zum Kunden“ als einen wesentlichen unternehmerischen Erfolgsfaktor auf der Suche nach Spitzenleistungen und Innovationen.2 Letztendlich entscheidet allein der Kunde durch seine Kaufentscheidung über Erfolg und Misserfolg des Unternehmens am Markt. Angesichts der zunehmenden Heterogenität der Nachfrageprofile auf dem PKW-Markt und dem entsprechend notwendigen Customizing besteht ein hoher Anspruch, die Leistungsbündel auf den jeweiligen Kunden zuzuschneiden. Gleichzeitig besteht ein zunehmender Handlungsdruck zur Verkürzung der Time-to-Market. Untersuchungen in der Automobilindustrie zeigen, dass eine Verlängerung der Entwicklungszeit um sechs Monate zu Erlösschmälerungen von ca. 30% führen, während eine Erhöhung der Entwicklungskosten lediglich 5% Erlöseinbußen nach sich zieht.3","authors":["Horst Wildemann"],"meta":["January 2004","DOI:10.1007/978-3-663-10862-7_17","In book: Nachhaltiges Innovationsmanagement (pp.381-408)"],"references":["237927373_Identifying_Industrial_New_Product_Success_Project_NewProd","338874943_Quality_Function_Deployment_and_PR","317617472_The_Nature_of_Human_Values","313094010_Laddering_theory_method_analysis_and_interpretation","302119242_Marketing-Management_im_Umbruch","296079422_Unternehmensentwicklung_-_Methoden_fur_eine_nachhaltige_profitable_unternehmensfuhrung","260407602_Consumer_behaviour_and_marketing_strategy_-_European_edition","245781331_Consumer_Behavior_Marketing_Strategy","243763907_Principles_of_Marketing_Management","241278362_The_Nature_of_Human_Values","225083761_The_Marketing_Concept_What_It_Is_and_What_It_Is_Not","36841836_Marketing_Management","36148649_Kundennahe_von_Industrieguterunternehmen_Konzeption_-_Erfolgsauswirkungen_-_Determinanten","35664103_Qualitative_Marktforschung_Methoden_Einsatzmoglichkeiten_und_Beurteilungskriterien"]}