{"id":"302410340_Investigating_Factors_Influencing_Students'_Intention_to_Dropout_Computer_Science_Studies","abstract":"Research in the area of Computer Science (CS) education, has focused on identifying the reasons that students do not finish their studies in CS. Although there is increasing demand for CS professionals, there is not enough knowledge to explain the high dropout rates in CS education. This study aims to empirically examine how students' intention to complete their studies (retention) in CS is affected by variables playing a key role in higher education. By identifying which variables contribute to dropout in CS studies, we will be able to focus on how to improve aspects related with them in order to reduce dropout rates. To do so we identified the following variables: Year of studies, Gender, Age, Students' Effort, Absence from Classes, Expected Grade point average (GPA), and Current GPA, and tested their effect on retention, based on the responses collected from 241 CS student. Year of studies and Effort have positive effects on students' intention to finish their studies in CS. Interestingly, the expected GPA has a negative effect on students' intentions to finish their studies. The findings contribute to theory and practice, as they offer CS educators and policy makers insights that may aid towards increased student retention and reduced dropout rates.","authors":["Ilias Pappas","Michail Giannakos","Letizia Jaccheri"],"meta":["July 2016","DOI:10.1145/2899415.2899455","Conference: 21st Annual Conference on Innovation and Technology in Computer Science Education (ITiCSE)At: Arequipa, Peru","Project: Excited - Centre for Excellent IT Education"],"references":["282687118_Results_of_a_large-scale_multi-institutional_study_of_undergraduate_retention_in_computing","271830679_Investigating_teachers'_confidence_on_technological_pedagogical_and_content_knowledge_an_initial_validation_of_TPACK_scales_in_K-12_computing_education_context","264677710_Factors_That_Influence_Persistence_in_Science_and_Engineering_Career_Aspirations","262325208_Educational_technology_approach_toward_learning_analytics_relationship_between_student_online_behavior_and_learning_performance_in_higher_education","316858624_Computer_Science_Curricula_2013_Curriculum_Guidelines_for_Undergraduate_Degree_Programs_in_Computer_Science","312940406_Computer_Science_Curricula_2013_Curriculum_Guidelines_for_Undergraduate_Degree_Programs_in_Computer_Science","298971004_Factors_that_influence_persistence_in_science_and_engineering_career_aspirations","290616879_Just_Get_Over_It_or_Just_Get_On_with_It_Retaining_Women_in_Undergraduate_Computing","274969735_Student_perceptions_of_computer_science","272178159_Persistence_Engagement_and_Migration_in_Engineering_Programs"]}