{"id":"302473621_Decentralised_LTL_Monitoring","abstract":"Users wanting to monitor distributed or component-based systems often perceive them as monolithic systems which, seen from the outside, exhibit a uniform behaviour as opposed to many components displaying many local behaviours that together constitute the system’s global behaviour. This level of abstraction is often reasonable, hiding implementation details from users who may want to specify the system’s global behaviour in terms of a linear-time temporal logic (LTL) formula. However, the problem that arises then is how such a specification can actually be monitored in a distributed system that has no central data collection point, where all the components’ local behaviours are observable. In this case, the LTL specification needs to be decomposed into sub-formulae which, in turn, need to be distributed amongst the components’ locally attached monitors, each of which sees only a distinct part of the global behaviour. The main contribution of this paper is an algorithm for distributing and monitoring LTL formulae, such that satisfaction or violation of specifications can be detected by local monitors alone. We present an implementation and show that our algorithm introduces only a negligible delay in detecting satisfaction/violation of a specification. Moreover, our practical results show that the communication overhead introduced by the local monitors is generally lower than the number of messages that would need to be sent to a central data collection point. Furthermore, our experiments strengthen the argument that the algorithm performs well in a wide range of different application contexts, given by different system/communication topologies and/or system event distributions over time.","authors":["Andreas Bauer","Yliès Falcone"],"meta":["April 2016Formal Methods in System Design 48(1-2)","DOI:10.1007/s10703-016-0253-8"],"references":["274713779_Analysis_of_Deterministic_Ethernet_Scheduling_for_the_Industrial_Internet_of_Things","234785237_The_complexity_of_propositional_linear_temporal_logics_Journal_of_the_ACM_JACM_323_733-749","228543408_New_results_on_decentralized_diagnosis_of_discrete-event_systems","227050141_Rewriting-Based_Techniques_for_Runtime_Verification","226896066_Timing_analysis_of_the_FlexRay_communication_protocol","225702634_Runtime_Verification_with_the_RV_System","225504549_Generating_Optimal_Linear_Temporal_Logic_Monitors_by_Coinduction","261552618_Runtime_Verification_-_First_International_Conference_RV_2010_St_Julians_Malta_November_1-4_2010_Proceedings","260231612_Efficient_and_Generalized_Decentralized_Monitoring_of_Regular_Languages","243786417_Modeling_Embedded_Systems_and_SoCs-Concurrency_and_Time_in_Models_of_Computation"]}