{"id":"302564087_Optimization_and_parallelization_of_the_boundary_element_method_for_the_wave_equation_in_time_domain","abstract":"La méthode des éléments frontières pour l’équation des ondes (BEM) est utilisée en acoustique eten électromagnétisme pour simuler la propagation d’une onde avec une discrétisation en temps(TD). Elle permet d’obtenir un résultat pour plusieurs fréquences à partir d’une seule résolution.Dans cette thèse, nous nous intéressons à l’implémentation efficace d’un simulateur TD-BEM sousdifférents angles. Nous décrivons le contexte de notre étude et la formulation utilisée qui s’exprimesous la forme d’un système linéaire composé de plusieurs matrices d’interactions/convolutions.Ce système est naturellement calculé en utilisant l’opérateur matrice/vecteur creux (SpMV). Nousavons travaillé sur la limite du SpMV en étudiant la permutation des matrices et le comportementde notre implémentation aidé par la vectorisation sur CPU et avec une approche par bloc surGPU. Nous montrons que cet opérateur n’est pas approprié pour notre problème et nous proposonsde changer l’ordre de calcul afin d’obtenir une matrice avec une structure particulière.Cette nouvelle structure est appelée une matrice tranche et se calcule à l’aide d’un opérateur spécifique.Nous décrivons des implémentations optimisées sur architectures modernes du calculhaute-performance. Le simulateur résultant est parallélisé avec une approche hybride (mémoirespartagées/distribuées) sur des noeuds hétérogènes, et se base sur une nouvelle heuristique pouréquilibrer le travail entre les processeurs. Cette approche matricielle a une complexité quadratiquesi bien que nous avons étudié son accélération par la méthode des multipoles rapides (FMM). Nousavons tout d’abord travaillé sur la parallélisation de l’algorithme de la FMM en utilisant différentsparadigmes et nous montrons comment les moteurs d’exécution sont adaptés pour relâcher le potentielde la FMM. Enfin, nous présentons des résultats préliminaires d’un simulateur TD-BEMaccéléré par FMM .","authors":["Bérenger Bramas"],"meta":["February 2016"],"references":["283303486_Multifrontal_QR_Factorization_for_Multicore_Architectures_over_Runtime_Systems","283125194_PVFMM_A_Parallel_Kernel_Independent_FMM_for_Particle_and_Volume_Potentials","278627083_OptiDis_Toward_fast_anisotropic_DD_based_on_Stroh_formalism","269116245_Head-to-head_domain_walls_in_one-dimensional_nanostructures_an_extended_phase_diagram_ranging_from_strips_to_cylindrical_wires","306107098_Numerical_Methods_for_Engineers_Fourth_Edition","280991160_PaRSEC_A_programming_paradigm_exploiting_heterogeneity_for_enhancing_scalability","277286213_MUMPS_MUltifrontal_Massively_Parallel_Solver_Version_20","277116769_Algorithmique_hierarchique_parallele_haute_performance_pour_les_problemes_a_N-corps","269053488_An_efficient_solution_of_time_domain_boundary_integral_equations_for_acoustic_scattering_and_its_acceleration_by_Graphics_Processing_Units","267414357_Equation_des_Ondes_en_Acoustique_Acceleration_des_Potentiels_Retardes_par_la_Methode_Multipole_Temporelle"]}