{"id":"302583805_Geometric_Dominating_Set_and_Set_Cover_via_Local_Search","abstract":"In this paper, we study two classic optimization problems: minimum geometric dominating set and set cover. Both the problems have been studied for different types of objects for a long time. These problems become APX-hard when the objects are axis-parallel rectangles, ellipses, $\\alpha$-fat objects of constant description complexity, and convex polygons. On the other hand, PTAS (polynomial time approximation scheme) is known for them when the objects are disks or unit squares. Surprisingly, PTAS was unknown even for arbitrary squares. For homothetic set of convex objects, an $O(k^4)$ approximation algorithm is known for dominating set problem, where $k$ is the number of corners in a convex object. On the other hand, QPTAS (quasi polynomial time approximation scheme) is known very recently for the covering problem when the objects are pseudodisks. For both problems obtaining a PTAS remains open for a large class of objects. For the dominating set problems, we prove that the popular local search algorithm leads to an $(1+\\varepsilon)$ approximation when objects are homothetic set of convex objects (which includes arbitrary squares, $k$-regular polygons, translated and scaled copies of a convex set etc.) in $n^{O(1/\\varepsilon^2)}$ time. On the other hand, the same technique leads to a PTAS for geometric covering problem when the objects are convex pseudodisks (which includes disks, unit height rectangles, homothetic convex objects etc.). As a consequence, we obtain an easy to implement approximation algorithm for both problems for a large class of objects, significantly improving the best known approximation guarantees.","authors":["Minati De","Abhiruk Lahiri"],"meta":["May 2016"],"references":["272521629_A_PTAS_for_the_Weighted_Unit_Disk_Cover_Problem","267553084_On_the_Approximability_of_NP-complete_Optimization_Problems","285602799_Approximation_Algorithms_for_Polynomial-Expansion_and_Low-Density_Graphs","283800746_Quasi-Polynomial_Time_Approximation_Scheme_for_Weighted_Geometric_Set_Cover_on_Pseudodisks_and_Halfspaces","281471780_Settling_the_APX-Hardness_Status_for_Geometric_Set_Cover","270312812_Linear_Topological_Spaces","266396655_The_Unreasonable_Success_of_Local_Search_Geometric_Optimization","259135781_Exact_algorithms_and_APX-hardness_results_for_geometric_packing_and_covering_problems","254852858_Optimization_and_approximation_on_systems_of_geometric_objects","249645448_A_QPTAS_for_Maximum_Weight_Independent_Set_of_Polygons_with_Polylogarithmically_Many_Vertices"]}