{"id":"302589689_Additive_manufacturing_and_sustainability_an_exploratory_study_of_the_advantages_and_challenges","abstract":"The emergence of advanced manufacturing technologies, coupled with consumer demands for more customised products and services, are causing shifts in the scale and distribution of manufacturing. In this paper, consideration is given to the role of one such advanced manufacturing process technology: additive manufacturing. The consequences of adopting this novel production technology on industrial sustainability are not well understood and this exploratory study draws on publically available data to provide insights into the impacts of additive manufacturing on sustainability. Benefits are found to exist across the product and material life cycles through product and process redesign, improvements to material input processing, make-to-order component and product manufacturing, and closing the loop. As an immature technology, there are substantial challenges to these benefits being realised at each stage of the life cycle. This paper summarises these advantages and challenges, and discusses the implications of additive manufacturing on sustainability in terms of the sources of innovation, business models, and the configuration of value chains.","authors":["Simon Ford","Mélanie Despeisse"],"meta":["May 2016Journal of Cleaner Production 137","DOI:10.1016/j.jclepro.2016.04.150","Project: Bit by Bit: Capturing the value from the digital fabrication 'revolution'"],"references":["305389640_Clio_and_the_economics_of_QWERTY","281575388_Innovation_Lessons_From_3-D_Printing","280254137_The_Role_of_Additive_Manufacturing_in_Improving_Resource_Efficiency_and_Sustainability","312939305_A_conceptual_framework_for_describing_the_phenomonon_of_new_venture_creation","303990580_Cradle_to_Cradle_Remaking_the_Way_We_Make_Things","289986936_Additive_manufacturing_in_aerospace_Examples_and_research_outlook","285469931_The_effects_of_high-frequency_vibrations_in_grinding","284389044_Exploration_and_Exploitation_in_Organizational_Learning","279291624_Sustainability_Characterization_for_Additive_Manufacturing","277435006_Direct_Digital_Manufacturing_Definition_Evolution_and_Sustainability_Implications"]}