{"id":"302869294_Virtual_Metrology_Laboratory_for_e-Learning","abstract":"Understanding geometrical specifications is becoming more and more difficult due to the latest developments in ISO GPS (Geometrical Product Specification) Standards, and at the same time, students’ learning habits are evolving and theoretical courses on standardized specifications are not attractive. Metrology laboratory work is much more appealing and highlights the difficulties encountered in interpreting specifications and the inherent method uncertainties. Nevertheless, metrology activities require an expensive metrology laboratory equipped with CMMs. In order to carry out real hands-on experiments, Bordeaux University is designing a virtual laboratory framework. It is integrated into Moodle (an L.M.S., Learning Management System) as a new activity to establish a link with other Moodle learning activities (courses, tests, etc.) and to ensure student tracking. A first prototype of the virtual laboratory is dedicated to dimensional and geometrical metrology with simulated traditional measuring devices (gauge, micrometer, dial indicator, etc.) and Coordinate Measuring Machines. Measurement simulation is in a three-dimensional environment and is based on models of parts with dimensions, orientation, position and form errors (skin model shapes) and on models of measuring devices with measurement uncertainties.","authors":["Alex Ballu","Xingyu Yan","A. Blanchard","T. Clet"],"meta":["December 2016Procedia CIRP 43:148-153","DOI:10.1016/j.procir.2016.02.110"],"references":["275670929_Geometric_Product_Specification_of_Gears_The_GeoSpelling_Perspective","263739381_Improving_biotech_education_through_gamified_laboratory_simulations","294423099_Virtual_Laboratories_for_Education_in_Science_Technology_and_Engineering_a_Review","283003762_Using_animations_to_support_the_understanding_of_Geometrical_Tolerancing_concepts","279867520_Skin_Model_Shapes_Offering_New_Potentials_for_Modelling_Product_Shape_Variability","267490399_Using_Morphing_Techniques_in_Early_Variation_Analysis","264652573_Development_of_a_Virtual_Winder_for_Computer-Aided_Education_Using_Virtools","260133527_Discrete_shape_modeling_for_skin_model_representation","258717055_Remote_Laboratories_for_Optical_Metrology_From_the_Lab_to_the_Cloud","230107932_Interactive_dimensional_calibration_via_Internet"]}