{"id":"302869845_Medoid-based_clustering_using_ant_colony_optimization","abstract":"The application of ACO-based algorithms in data mining has been growing over the last few years, and several supervised and unsupervised learning algorithms have been developed using this bio-inspired approach. Most recent works about unsupervised learning have focused on clustering, showing the potential of ACO-based techniques. However, there are still clustering areas that are almost unexplored using these techniques, such as medoid-based clustering. Medoid-based clustering methods are helpful—compared to classical centroid-based techniques—when centroids cannot be easily defined. This paper proposes two medoid-based ACO clustering algorithms, where the only information needed is the distance between data: one algorithm that uses an ACO procedure to determine an optimal medoid set (METACOC algorithm) and another algorithm that uses an automatic selection of the number of clusters (METACOC-K algorithm). The proposed algorithms are compared against classical clustering approaches using synthetic and real-world datasets.","authors":["Héctor D Menéndez","Fernando Esteban Barril Otero","David Camacho"],"meta":["June 2016Swarm Intelligence 10(2)","DOI:10.1007/s11721-016-0122-5","Project: Bioinspired Algorithms in Complex Ephemeral Environments (EphemeCH)"],"references":["273064443_Ant-based_Clustering_Algorithms_A_Brief_Survey","243777819_Clustering_by_Means_of_Medoids","329651410_Ant_Colony_Optimization","324286003_Finding_Groups_in_Data_An_Introduction_to_Cluster_Analysis","322715583_Data_Mining_practical_machine_learning_tools_and_techniques","286604839_A_Co-Evolutionary_Multi-Objective_approach_for_a_K-adaptive_graph-based_clustering_algorithm","269318418_A_spectral_image_clustering_algorithm_based_on_ant_colony_optimization","260269814_A_genetic_graph-based_approach_for_partitional_clustering","257682723_Extracting_behavioural_models_from_2010_FIFA_world_cup","236341345_Artificial_ants_for_automatic_classification"]}