{"id":"302883994_The_Learning_Preferences_of_Digital_Learners_in_K-12_Schools_in_China","abstract":"Students grown up with digital technology and Internet are called digital natives or net generation. All others, who grew up without so much immersion with digital technologies are called digital immigrants. Researchers held different ideas on whether a new generation of learners existed. One of the foci of the debate is on the appropriateness of using age as the criteria to divide 'Digital native' and 'Digital immigrants'. In order to reconcile the debate, the term 'Digital learner' was used in this paper, with the hypothesis that the time length for using technology could be used as the criteria for dividing digital learners. It is also noticed that there were few studies focused on the learning preferences of today's learners in Chinese context. In order to understand learners' learning preference and test our hypothesis, a Large-Scale survey with 44470 participants and 7 focus group interviews were conducted with 28 participants. Results showed NetizenYears that indicated the number of years passed since he/she first time got online could be used as the criteria of digital learners. Digital learners could be labeled as 1-NetizenYear digital learners, 2-NetzizenYears digital learners, and so on, and Non-Digital learners are those with 0 NetizenYear. Results revealed that Non-Digital learners and digital learners had significantly different Internet use patterns. More positive attitudes to Internet, more active participation online and more tendency to Internet addiction were found for digital learners with increasing NetizenYears. The gap between digital learner's preferred learning approach and teaching methods in classroom was discussed. The paper concludes with a discussion on using the time length of using technology as the criteria for digital learners.","authors":["Junfeng Yang","Ronghuai Huang","Dr Kinshuk"],"meta":["April 2016Eurasia Journal of Mathematics, Science and Technology Education 12(4):1047-1064","DOI:10.12973/eurasia.2016.1254a"],"references":["292807651_Beyond_the_Net_Generation_Debate_A_Comparison_of_Digital_Learners_in_Face-to-Face_and_Virtual_Universities","287248663_The_'Digital_Natives'_Debate_An_Investigation_of_the_Digital_Propensities_of_University_Students","281631128_Learning_preferences_of_clinical_students_A_study_in_a_Malaysian_medical_college","279552001_Meeting_the_Digital_Natives_Understanding_the_acceptance_of_technology_in_classrooms","275963209_Digital_Natives_And_Digital_Immigrants_Towards_A_Model_Of_Digital_Fluency","265168763_The_Framework_and_Method_for_Understanding_the_New_Generation_of_Learners","292819554_Mastering_Multitasking","285057631_Grown_up_digital_How_the_net_generation_is_changing_the_world","283559906_The_New_Shape_of_the_Student","274836682_Digital_Natives_Exploring_the_Diversity_of_Young_People's_Experience_with_Technology","262333142_Do_studies_level_and_age_matter_in_learning_and_social_relationship_in_the_assessment_of_web_30_A_case_study_for_'digital_natives'_in_Spain","259806194_Internet_use_and_addiction_among_Finnish_Adolescents_15-19years","257252881_The_effect_of_Internet_use_on_adolescents'_lifestyles_A_national_survey","257171683_The_digital_natives_as_learners_Technology_use_patterns_and_approaches_to_learning","257171525_An_initial_development_and_validation_of_a_Digital_Natives_Assessment_Scale_DNAS"]}