{"id":"302869744_Fast_adaptive_switching_technique_of_impulsive_noise_removal_in_color_images","abstract":"In the paper, a family of switching filters designed for the impulsive noise removal in color images is analyzed. The framework of the proposed denoising techniques is based on the concept of cumulated distances between the processed pixel and its neighbors. To increase the filtering efficiency, a robust scheme, in which the sum of distances to only the most similar pixels of the neighborhood serves as a measure of impulsiveness, was elaborated. As this trimmed measure is dependent on the image local structure, an adaptive mechanism was also incorporated. Additionally, a very fast design, which enables image denoising in practical applications, is proposed and the choice of the filter output, which is used to replace the noisy pixels, is discussed. The described family of filters was evaluated on a large set of natural test images and compared with the state-of-the-art restoration methods. The analysis of the achieved results shows that the novel filters outperform the existing techniques in terms of both denoising accuracy and computational complexity. In this way, the proposed techniques can be recommended for the application in various image and video enhancement tasks.","authors":["Łukasz Maliński","Bogdan Smolka"],"meta":["August 2019Journal of Real-Time Image Processing 16(4)","DOI:10.1007/s11554-016-0599-6"],"references":["334560121_ON_EFFICIENT_IMPLEMENTATIONS_OF_MEDIAN_FILTERS_IN_THEORY_AND_IN_PRACTICE","282641853_Fast_averaging_peer_group_filter_for_the_impulsive_noise_removal_in_color_images","280116744_Towards_a_Full-Reference_Quality_Assessment_for_Color_Images_Using_Directional_Statistics","348556872_REMOVAL_OF_GAUSSIAN_AND_IMPULSE_NOISE_IN_THE_COLOUR_IMAGE_PROGRESSION_WITH_FUZZY_FILTERS","320147795_An_Efficient_Adaptive_Weighted_Switching_Median_Filter_for_Removing_High_Density_Impulse_Noise","312771295_Image_quality_assessment_From_error_visibility_to_structural_similarity","311913547_Impulsive_Noise_Filters_for_Colour_Images","287739289_Image_Noise_Models","286169132_Robustified_vector_median_filter","284692147_Nonlinear_Vector_Filtering_for_Impulsive_Noise_Removal_from_Color_Images"]}