{"id":"302869229_Analyzing_public_sentiments_online_Combining_human-_and_computer-based_content_analysis","abstract":"Recent technological developments have created novel opportunities for analyzing and identifying patterns in large volumes of digital content. However, many content analysis tools require researchers to choose between the validity of human-based coding and the ability to analyze large volumes of content through computer-based techniques. This study argues for the use of supervised content analysis tools that capitalize on the strengths of human- and computer-based coding for assessing opinion expression. We begin by outlining the key methodological issues surrounding content analysis as performed by human coders and existing computational algorithms. After reviewing the most popular analytic approaches, we introduce an alternative, hybrid method that is aimed at improving reliability, validity, and efficiency when analyzing social media content. To demonstrate the usefulness of this method, we track nuclear energy- and nanotechnology-related opinion expression on Twitter surrounding the Fukushima Daiichi accident to examine the extent to which the volume and tone of tweets shift in directions consistent with the expected external influence of the event. Our analysis revealed substantial shifts in both the volume and tone of nuclear power-related tweets that were consistent with our expectations following the disaster event. Conversely, there was decidedly more stability in the volume and tone of tweets for our comparison issue. These analyses provide an empirical demonstration of how the presented hybrid method can analyze defined communication sentiment and topics from large-scale social media data sets. The implications for communication scholars are discussed.","authors":["Leona Yi-Fan Su","Michael A. Cacciatore","Xuan Liang","Dominique Brossard"],"meta":["May 2016Information Communication and Society 20(3):1-22","DOI:10.1080/1369118X.2016.1182197"],"references":["312411253_Network_analysis_of_message_content","281748849_Critical_questions_for_big_data_Provocations_for_a_cultural_technological_and_scholarly_phenomenon","289629796_Discovering_Consumer_Insight_from_Twitter_via_Sentiment_Analysis","285100140_A_survey_of_opinion_mining_and_sentiment_analysis","280292047_Mining_Social_Media_A_Brief_Introduction","277718038_Every_Tweet_Counts_How_Sentiment_Analysis_of_Social_Media_Can_Improve_Our_Knowledge_of_Citizens'_Political_Preferences_with_an_Application_to_Italy_and_France","277469471_Frame_Mapping_and_Analysis_of_News_Coverage_of_Contentious_Issues","275992399_The_Measurement_of_Communication_Processes_Galileo_Theory_and_Method","275371833_Reliability_in_Content_Analysis_Some_Common_Misconceptions_and_Recommendations","274050000_Figuring_Out_Fukushima_An_Initial_Look_at_Functions_and_Content_of_US_Twitter_Commentary_About_Nuclear_Risk"]}