{"id":"302973578_Time-Series_Constraints_Improvements_and_Application_in_CP_and_MIP_Contexts","abstract":"A checker for a constraint on a variable sequence can often be compactly specified by an automaton, possibly with accumulators, that consumes the sequence of values taken by the variables; such an automaton can also be used to decompose its specified constraint into a conjunction of logical constraints. The inference achieved by this decomposition in a CP solver can be boosted by automatically generated implied constraints on the accumulators, provided the latter are updated in the automaton transitions by linear expressions. Automata with non-linear accumulator updates can be automatically synthesised for a large family of time-series constraints. In this paper, we describe and evaluate extensions to those techniques. First, we improve the automaton synthesis to generate automata with fewer accumulators. Second, we decompose a constraint specified by an automaton with accumulators into a conjunction of linear inequalities, for use by a MIP solver. Third, we generalise the implied constraint generation to cover the entire family of time-series constraints. The newly synthesised automata for time-series constraints outperform the old ones, for both the CP and MIP decompositions, and the generated implied constraints boost the inference, again for both the CP and MIP decompositions. We evaluate CP and MIP solvers on a prototypical application modelled using time-series constraints.","authors":["Ekaterina Arafailova","Nicolas Beldiceanu","Rémi Douence","Pierre Flener"],"meta":["May 2016","DOI:10.1007/978-3-319-33954-2_2","Conference: International Conference on AI and OR Techniques in Constriant Programming for Combinatorial Optimization Problems"],"references":["257142486_Propagating_Regular_Counting_Constraints","221633262_Deriving_Filtering_Algorithms_from_Constraint_Checkers","221477280_Constraint-Based_Linear-Relations_Analysis","221353466_Modeling_the_Regular_Constraint_with_Integer_Programming","221266811_An_Open-Ended_Finite_Domain_Constraint_Solver","220202404_Reformulation_of_Global_Constraints_Based_on_Constraints_Checkers","321524915_Transductions_and_Context-Free_Languages","281299324_Using_finite_transducers_for_describing_and_synthesising_structural_time-series_constraints","247334612_Rational_Transductions_and_Context-Free_Languages","221633333_A_Regular_Language_Membership_Constraint_for_Finite_Sequences_of_Variables","44485972_Model_building_in_mathematical_programming_H_P_Williams","29629758_A_Cost-Regular_Based_Hybrid_Column_Generation_Approach"]}