{"id":"302919495_Software-Defined_Industrial_Internet_of_Things_in_the_Context_of_Industry_40","abstract":"In recent years, there have been great advances in industrial Internet of Things (IIoT) and its related domains, such as industrial wireless networks (IWNs), big data, and cloud computing. These emerging technologies will bring great opportunities for promoting industrial upgrades and even allow the introduction of the fourth industrial revolution, namely, Industry 4.0. In the context of Industry 4.0, all kinds of intelligent equipment (e.g., industrial robots) supported by wired or wireless networks are widely adopted, and both real-time and delayed signals coexist. Therefore, based on the advancement of software-defined networks technology, we propose a new concept for industrial environments by introducing software-defined IIoT in order to make the network more flexible. In this paper, we analyze the IIoT architecture, including physical layer, IWNs, industrial cloud, and smart terminals, and describe the information interaction among different devices. Then, we propose a software-defined IIoT architecture to manage physical devices and provide an interface for information exchange. Subsequently, we discuss the prominent problems and possible solutions for software-defined IIoT. Finally, we select an intelligent manufacturing environment as an assessment test bed, and implement the basic experimental analysis. This paper will open a new research direction of IIoT and accelerate the implementation of Industry 4.0.","authors":["Jiafu Wan","Shenglong Tang","Zhaogang Shu","Di Li"],"meta":["October 2016IEEE Sensors Journal 16(20):1-1","DOI:10.1109/JSEN.2016.2565621","Project: Software-Defined Industrial Internet of Things"],"references":["291385881_Implementing_Smart_Factory_of_Industrie_40_An_Outlook","290496571_Software-Defined_Mobile_Networks_Security","290477553_Security_in_Software-Defined_Networking_Threats_and_Countermeasures","310055033_Security_in_software_defined_networks_A_survey","309201797_A_software_defined_networking_architecture_for_the_internet-of-things","290509714_IDoctor_Personalized_and_professionalized_medical_recommendations_based_on_hybrid_matrix_factorization","289504267_Towards_Smart_Factory_for_Industry_40_A_Self-organized_Multi-agent_System_with_Big_Data_Based_Feedback_and_Coordination","288904293_Software_defined_healthcare_networks","288889011_QoE-Driven_Spectrum_Assignment_for_5G_Wireless_Networks_using_SDR","287631379_Cloud_Manufacturing_Service_System_for_Industrial-Cluster-Oriented_Application"]}