{"id":"302919813_A_first_order_hyperbolic_framework_for_large_strain_computational_solid_dynamics_An_upwind_cell_centred_Total_Lagrangian_scheme","abstract":"This paper builds on recent work developed by the authors for the numerical analysis of large strain\nsolid dynamics, by introducing an upwind cell centred hexahedral Finite Volume framework implemented within the open source code OpenFOAM [http://www.openfoam.com/http://www.openfoam.com/]. In Lee, Gil and Bonet [1], a first order hyperbolic system of conservation laws was introduced in terms of the linear momentum and the deformation gradient tensor of the system, leading to excellent behaviour in two dimensional bending dominated nearly incompressible scenarios. The main aim of this paper is the extension of this algorithm into three dimensions, its tailor-made implementation into OpenFOAM and the enhancement of the formulation with three key novelties. First, the introduction of two different strategies in order to ensure the satisfaction of the underlying involutions of the system, that is, that the deformation gradient tensor must be curl-free throughout the deformation process. Second, the use of a discrete angular momentum projection algorithm and a monolithic Total Variation Diminishing Runge-Kutta time integrator combined in order to guarantee the conservation of angular momentum. Third, and for comparison purposes, an adapted Total Lagrangian version of the Hyperelastic-GLACE nodal scheme of Kluth and Despres [2] is presented. A series of challenging numerical examples are examined in order to assess the robustness and accuracy of the proposed algorithm, benchmarking it against an ample spectrum of alternative numerical strategies developed by the authors in recent publications.","authors":["Jibran Haider","Chun Hean Lee","Antonio Javier Gil","Javier Bonet"],"meta":["May 2016International Journal for Numerical Methods in Engineering 109(3)","DOI:10.1002/nme.5293"],"references":["311851804_A_high-order_stabilised_ALE_finite_element_formulation_for_the_Euler_equations_on_deformable_domains","288251665_Hp-Finite_element_solution_of_coupled_stationary_magnetohydrodynamics_problems_including_magnetostrictive_effects","284360653_A_first_order_hyperbolic_framework_for_large_strain_computational_solid_dynamics_Part_II_Total_Lagrangian_compressible_nearly_incompressible_and_truly_incompressible_elasticity","344485081_Finite_Element_Methods_for_Flow_Problems","303335339_One-sided_difference_approximations_for_nonlinear_conservation_laws","291420426_On_a_tensor_cross_product_based_formulation_of_large_strain_solid_mechanics","286168203_Numerical_Computation_of_Internal_and_External_Flows_The_Fundamentals_of_Computational_Fluid_Dynamics","285340062_Introduction_and_Preliminaries","283757397_Performance_Evaluation_of_the_Selective_Smoothed_Finite_Element_Methods_Using_Tetrahedral_Elements_with_DeviatoricHydrostatic_Split_in_Large_Deformation_Analysis","282404378_A_simple_stable_and_accurate_tetrahedral_finite_element_for_transient_nearly_and_fully_incompressible_solid_dynamics_A_dynamic_variational_multiscale_approach"]}