{"id":"302924724_Guidelines_for_performing_Systematic_Literature_Reviews_in_Software_Engineering","abstract":"The objective of this report is to propose comprehensive guidelines for systematic literature reviews appropriate for software engineering researchers, including PhD students. A systematic literature review is a means of evaluating and interpreting all available research relevant to a particular research question, topic area, or phenomenon of interest. \nSystematic reviews aim to present a fair evaluation of a research topic by using a trustworthy, rigorous, and auditable methodology. The guidelines presented in this report were derived from three existing guidelines used by medical researchers, two books produced by researchers with social science backgrounds and discussions with researchers from other disciplines who are involved\nin evidence-based practice. The guidelines have been adapted to reflect the specific problems of software engineering research.\nThe guidelines cover three phases of a systematic literature review: planning the review, conducting the review and reporting the review. They provide a relatively high level description. They do not consider the impact of the research questions on the review procedures, nor do they specify in detail the mechanisms needed to perform meta-analysis.","authors":["Barbara Kitchenham","Stuart M. Charters"],"meta":["January 2007"],"references":["228756057_Procedures_for_Performing_Systematic_Reviews","222555385_Lessons_from_applying_the_systematic_literature_review_process_within_the_software_engineering_domain_J_Syst_Softw","331926233_Systematic_reviews_to_support_evidence-based_medicine","280645955_Systematic_Reviews_in_the_Social_Sciences_A_Practical_Guide","246137624_Experimental_and_Quasi-Experimental_Designs_For_Generalized_Causal_Inference","245968408_Does_blinding_of_readers_affect_the_results_of_meta-analysis","242259770_A_Systematic_Review_of_Cross_vs_Within_Company_Cost_Estimation_Studies","222677405_Experiences_using_systematic_review_guidelines","222537419_Jorgensen_M_A_Review_of_Studies_on_Expert_Estimation_of_Software_Development_Effort_Journal_of_Systems_and_Software_70_37-60","222516376_Forecasting_of_software_development_work_effort_Evidence_on_expert_judgement_and_formal_models"]}