{"id":"302922517_Breaking_Good_Accounting_for_Fragility_of_Genomic_Regions_in_Rearrangement_Distance_Estimation","abstract":"Models of evolution by genome rearrangements are prone to two types of flaws: one is to ignore the diversity of susceptibility\nto breakage across genomic regions, the other is to suppose that susceptibility values are given. Without necessarily supposing\ntheir precise localization, we call “solid” the regions that are improbably broken by rearrangements and “fragile” the regions\noutside solid ones. We propose a model of evolution by inversions where breakage probabilities vary across fragile regions\nand over time. It contains as a particular case the uniform breakage model on the nucleotidic sequence, where breakage probabilities\nare proportional to fragile region lengths. This is very different from the frequently used pseudo-uniform model where all\nfragile regions have the same probability to break. Estimations of rearrangement distances based on the pseudo-uniform model\ncompletely fail on simulations with the truly uniform model. On pairs of amniote genomes, we show that identifying coding\ngenes with solid regions yields incoherent distance estimations, especially with the pseudo-uniform model, and to a lesser\nextent with the truly uniform model. This incoherence is solved when we co-estimate the number of fragile regions with the\nrearrangement distance. The estimated number of fragile regions is surprisingly small, suggesting that a minority of regions\nare recurrently used by rearrangements. Estimations for several pairs of genomes at different divergence times are in agreement\nwith a slowly evolvable co-localization of active genomic regions in the cell.","authors":["Priscila Biller","Laurent Guéguen","Carole Knibbe","Eric Tannier"],"meta":["May 2016Genome Biology and Evolution 8(5):evw083","DOI:10.1093/gbe/evw083"],"references":["317426127_Estimation_of_the_true_evolutionary_distance_under_the_fragile_breakage_model","308319762_ALF--a_simulation_framework_for_genome_evolution","280865426_Getting_the_genome_in_shape_The_formation_of_loops_domains_and_compartments","280595966_Moments_of_genome_evolution_by_Double_Cut-and-Join","313609388_On_the_evolution_of_random_graphs","308729427_Estimation_of_the_True_Evolutionary_Distance_under_the_Fragile_Breakage_Model","305973273_The_equilibrium_distribution_for_a_generalized_Sankoff-Ferretti_model_accurately_predicts_chromosome_size_distributions_in_a_wide_variety_of_species","303946840_Comparative_Genomics_on_Artificial_Life","300540887_Models_and_Algorithms_for_Genome_Rearrangement_with_Positional_Constraints","284674055_On_the_Evolution_of_Random_Graphs"]}