{"id":"302919660_Optimal_Workload_Allocation_in_Fog-Cloud_Computing_Towards_Balanced_Delay_and_Power_Consumption","abstract":"Mobile users typically have high demand on localized and location-based information services. To always retrieve the localized data from the remote cloud, however, tends to be inefficient, which motivates fog computing. The fog computing, also known as edge computing, extends cloud computing by deploying localized computing facilities at the premise of users, which pre-stores cloud data and distributes to mobile users with fast-rate local connections. As such, fog computing introduces an intermediate fog layer between mobile users and cloud, and complements cloud computing towards low-latency high-rate services to mobile users. In this fundamental framework, it is important to study the interplay and cooperation between the edge (fog) and the core (cloud). In this paper, the tradeoff between power consumption and transmission delay in the fog-cloud computing system is investigated. We formulate a work-load allocation problem which suggests the optimal workload allocations between fog and cloud towards the minimal power consumption with the constrained service delay. The problem is then tackled using an approximate approach by decomposing the primal problem into three subproblems of corresponding subsystems, which can be respectively solved. Finally, based on simulations and numerical results, we show that by sacrificing modest computation resources to save communication bandwidth and reduce transmission latency, fog computing can significantly improve the performance of cloud computing.","authors":["Ruilong Deng","Rongxing Lu","Chengzhe Lai","Tom Hao Luan"],"meta":["January 2016IEEE Internet of Things Journal","DOI:10.1109/JIOT.2016.2565516"],"references":["308871837_Fog_Computing_Architecture_to_Enable_Consumer_Centric_Internet_of_Things_Services","303015409_Maximizing_Network_Utility_of_Rechargeable_Sensor_Networks_With_Spatiotemporally_Coupled_Constraints","301579823_Joint_Channel_Access_and_Sampling_Rate_Control_in_Energy_Harvesting_Cognitive_Radio_Sensor_Networks","300490582_A_Survey_of_Fog_Computing_Concepts_Applications_and_Issues","299597450_Security_and_Privacy_Issues_of_Fog_Computing_A_Survey","328654718_Analysis_of_Queues_Methods_and_Applications","308823581_Migration-aware_virtual_machine_placement_for_cloud_data_centers","305092397_Towards_power_consumption-delay_tradeoff_by_workload_allocation_in_cloud-fog_computing","291018810_Toward_secure_large-scale_machine-to-machine_comm_unications_in_3GPP_networks_chall_enges_and_solutions","285866820_The_Fog_Computing_Paradigm_Scenarios_and_Security_Issues"]}