{"id":"302946294_Retrieval_of_Brain_Tumors_by_Adaptive_Spatial_Pooling_and_Fisher_Vector_Representation","abstract":"Content-based image retrieval (CBIR) techniques have currently gained increasing popularity in the medical field because they can use numerous and valuable archived images to support clinical decisions. In this paper, we concentrate on developing a CBIR system for retrieving brain tumors in T1-weighted contrast-enhanced MRI images. Specifically, when the user roughly outlines the tumor region of a query image, brain tumor images in the database of the same pathological type are expected to be returned. We propose a novel feature extraction framework to improve the retrieval performance. The proposed framework consists of three steps. First, we augment the tumor region and use the augmented tumor region as the region of interest to incorporate informative contextual information. Second, the augmented tumor region is split into subregions by an adaptive spatial division method based on intensity orders; within each subregion, we extract raw image patches as local features. Third, we apply the Fisher kernel framework to aggregate the local features of each subregion into a respective single vector representation and concatenate these per-subregion vector representations to obtain an image-level signature. After feature extraction, a closed-form metric learning algorithm is applied to measure the similarity between the query image and database images. Extensive experiments are conducted on a large dataset of 3604 images with three types of brain tumors, namely, meningiomas, gliomas, and pituitary tumors. The mean average precision can reach 94.68%. Experimental results demonstrate the power of the proposed algorithm against some related state-of-the-art methods on the same dataset.","authors":["Jun Cheng","Wei Yang","Meiyan Huang","Wei Huang"],"meta":["May 2016PLoS ONE 11(6)","DOI:10.1371/journal.pone.0157112"],"references":["302341151_Textural_Features_for_Image_Classification","267746120_Computer-Aided_Diagnosis_of_Mammographic_Masses_Using_Scalable_Image_Retrieval","263315179_Content-Based_Image_Retrieval_Using_Spatial_Layout_Information_in_Brain_Tumor_T1-Weighted_Contrast-Enhanced_MRI_Images","254036760_Regionspecific_bag-of-visual-words_representations_for_retrieving_brain_tumors_in_contrast-enhanced_MRI","244480712_3D_brain_tumor_segmentation_in_multimodal_MR_images_based_on_learning_population-_and_patient-specific_feature_sets","233931858_Retrieval_of_Brain_Tumors_with_Region-Specific_Bag-of-Visual-Words_Representations_in_Contrast-Enhanced_MRI_Images","312451756_Improving_the_fisher_kernel_for_large-scale_image_classification","282896156_Online_Multi-Modal_Distance_Metric_Learning_with_Application_to_Image_Retrieval","264499164_Sparse_Representation_Based_Fisher_Discrimination_Dictionary_Learning_for_Image_Classification","263813716_Learning_Local_Feature_Descriptors_Using_Convex_Optimisation"]}