{"id":"302930620_Topic-based_Software_Defect_Explanation","abstract":"Researchers continue to propose metrics using measurable aspects of software systems to understand software quality. However, these metrics largely ignore the functionality, i.e., the conceptual concerns, of software systems. Such concerns are the technical concepts that reflect the system’s business logic. For instance, while lines of code may be a good general measure for defects, a large file responsible for simple I/O tasks is likely to have fewer defects than a small file responsible for complicated compiler implementation details. In this paper, we study the effect of concerns on software quality. We use a statistical topic modeling approach to approximate software concerns as topics (related words in source code). We propose various metrics using these topics to help explain the file defect-proneness. Case studies on multiple versions of Firefox, Eclipse, Mylyn, and NetBeans show that (i) some topics are more defect-prone than others; (ii) defect-prone topics tend to remain so over time; (iii) our topic-based metrics provide additional explanatory power for software quality over existing structural and historical metrics; and (iv) our topic-based cohesion metric outperforms state-of-the-art topic-based cohesion and coupling metrics in terms of defect explanatory power, while being simpler to implement and more intuitive to interpret.","authors":["Tse-Hsun Peter Chen","Weiyi Shang","Meiyappan Nagappan","Ahmed E. Hassan"],"meta":["May 2016Journal of Systems and Software","DOI:10.1016/j.jss.2016.05.015"],"references":["322796785_Studying_software_logging_using_topic_models","282963924_A_survey_on_the_use_of_topic_models_when_mining_software_repositories","314040826_The_Kluwer_International_Series_in_Engineering_and_Computer_Science","280020151_Cohesion_measure_for_object-oriented_classes","279384963_Principal_Component_Analysis_and_Factor_Analysis","279236921_Multimodel_Inference_understanding_AIC_and_BIC_in_Model_Selection","276935841_Introduction_to_Information_Retrieval","272992814_Racial_differences_in_perception_of_healthy_body_weight_in_midlife_women","270845530_Using_heuristics_to_estimate_an_appropriate_number_of_latent_topics_in_source_code_analysis","267464409_Factor_Analysis_An_Applied_Approach"]}