{"id":"302978476_Organising_LTL_Monitors_over_Distributed_Systems_with_a_Global_Clock","abstract":"Users wanting to monitor distributed systems often prefer to abstract away the architecture of the system by directly specifying correctness properties on the global system behaviour. To support this abstraction, a compilation of the properties would not only involve the typical choice of monitoring algorithm, but also the organisation of submonitors across the component network. Existing approaches, considered in the context of LTL properties over distributed systems with a global clock, include the so-called orchestration and migration approaches. In the orchestration approach, a central monitor receives the events from all subsystems. In the migration approach, LTL formulae transfer themselves across subsystems to gather local information. We propose a third way of organising submonitors: choreography, where monitors are organised as a tree across the distributed system, and each child feeds intermediate results to its parent. We formalise choreography-based decentralised monitoring by showing how to synthesise a network from an LTL formula, and give a decentralised monitoring algorithm working on top of an LTL network. We prove the algorithm correct and implement it in a benchmark tool. We also report on an empirical investigation comparing these three approaches on several concerns of decentralised monitoring: the delay in reaching a verdict due to communication latency, the number and size of the messages exchanged, and the number of execution steps required to reach the verdict.","authors":["Christian Colombo","Yliès Falcone"],"meta":["October 2016Formal Methods in System Design 49(1)","DOI:10.1007/s10703-016-0251-x"],"references":["318272811_A_tutorial_on_runtime_verification","302473621_Decentralised_LTL_Monitoring","278816173_Organising_LTL_Monitors_over_Distributed_Systems_with_a_Global_Clock","257468439_Introduction_to_the_special_section_on_runtime_verification","256097354_Sampling-based_Decentralized_Monitoring_for_Networked_Embedded_Systems","287310820_A_framework_for_high-assurance_quasi-synchronous_systems","260231612_Efficient_and_Generalized_Decentralized_Monitoring_of_Regular_Languages","247293159_PSL_Model_Checking_and_Run-time_Veriflcation_via_Testers_Technical_Report_TR2006-881","237128841_The_Temporal_Logic_of_Reactive_and_Concurrent_Systems_Safety","234788679_Computer_Systems_Reliable_full-duplex_file_transmission_over_half-duplex_telephone_line","232642527_Advanced_Automata_Minimization","227050141_Rewriting-Based_Techniques_for_Runtime_Verification","226896066_Timing_analysis_of_the_FlexRay_communication_protocol","225504549_Generating_Optimal_Linear_Temporal_Logic_Monitors_by_Coinduction","226563160_On_the_Merits_of_Temporal_Testers"]}