{"id":"303099418_Using_biometrics_to_predict_code_quality_online","abstract":"Finding and fixing code quality concerns, such as defects or poor understandability of code, decreases software development and evolution costs. A common industrial practice to identify code quality concerns early on are code reviews. While code reviews help to identify problems early on, they also impose costs on development and only take place after a code change is already completed. The goal of our research is to automatically identify code quality concerns while a developer is making a change to the code. By using biometrics, such as heart rate variability, we aim to determine the difficulty a developer experiences working on a part of the code as well as identify and help to fix code quality concerns before they are even committed to the repository.\nIn a field study with ten professional developers over a two-week period we investigated the use of biometrics to determine code quality concerns. Our results show that biometrics are indeed able to predict quality concerns of parts of the code while a developer is working on, improving upon a naive classifier by more than 26% and outperforming classifiers based on more traditional metrics. In a second study with five professional developers from a different country and company, we found evidence that some of our findings from our initial study can be replicated. Overall, the results from the presented studies suggest that biometrics have the potential to predict code quality concerns online and thus lower development and evolution costs.","authors":["Sebastian C. Müller","Thomas Fritz"],"meta":["May 2016","DOI:10.1145/2884781.2884803","Conference: the 38th International Conference"],"references":["308735251_Characteristics_of_Useful_Code_Reviews_An_Empirical_Study_at_Microsoft","308731065_Real-Time_Monitoring_of_Neural_State_in_Assessing_and_Improving_Software_Developers'_Productivity","299868616_Tracing_Software_Developers'_Eyes_and_Interactions_for_Change_Tasks","285678572_Electrodermal_Activity_EDA_-_State-of-the-art_measurement_and_techniques_for_parapsychological_purposes","283483245_The_Role_of_Serious_Games_in_Robot_Exoskeleton-Assisted_Rehabilitation_of_Stroke_Patients","342183905_A_Coefficient_of_Agreement_for_Nominal_Scales","321525690_Cognitive_Load_Theory","316921873_Predicting_defective_software_components_from_code_complexity_measures","288906520_Random_forests","284543783_Software_Engineering_Economics"]}