{"id":"303091360_A_Repair_of_Workflow_Models_Based_on_Mirroring_Matrices","abstract":"Process models can be discovered from event logs and conformance checking techniques can be used to detect and diagnose the differences between observed and modeled behaviors. Some existing conformance checking techniques have been used for repairing a process model, but there are also many techniques can uncover these differences efficiently. So we can use these techniques to repair a process model. In this paper we research the problem of repairing the workflow models w.r.t. the corresponding real process has been changed and the change is adding new activities. To solve this problem, a mirroring matrix is presented based on the variant of footprints and parallel programs. The mirroring matrix is a uniform standard to compare an original model with a complete event log gained from the corresponding real process. Based on this information, the differences between a model and a log can be found. We suggest four algorithms that make model repair realized. Finally, the effectiveness and correctness of the proposed techniques are illustrated via contrastive experiments and analysis.","authors":["Yanan Sun","Yuyue Du","Maozhen Li"],"meta":["August 2017International Journal of Parallel Programming 45(4)","DOI:10.1007/s10766-016-0438-1"],"references":["344474026_Process_Discovery_using_Integer_Linear_Programming","273953161_Neurite_a_Finite_Difference_Large_Scale_Parallel_Program_for_the_Simulation_of_Electrical_Signal_Propagation_in_Neurites_under_Mechanical_Loading","262297483_A_Distributed_Dataflow_Model_for_Task-Uncoordinated_Parallel_Program_Execution","260354257_Dealing_With_Concept_Drifts_in_Process_Mining","291297849_Performance_equivalent_analysis_of_workflow_systems","286986704_Modeling_real-time_cooperative_systems_with_workflow_nets","286204428_Application_of_Petri_nets_to_bioinformatics","285842809_Petri_Nets_Properties_Analysis_and_Applications","283271513_A_Task-uncoordinated_Distributed_Dataflow_Model_for_Scalable_High_Performance_Parallel_Program_Execution","242348466_Model_Repair_-_Aligning_Process_Models_to_Reality"]}