{"id":"303098520_RMLEditor_A_Graph-based_Mapping_Editor_for_Linked_Data_Mappings","abstract":"Although several tools have been implemented to generate Linked Data from raw data, users still need to be aware of the underlying technologies and Linked Data principles to use them. Mapping languages enable to detach the mapping definitions from the implementation that executes them. However, no thorough research has been conducted on how to facilitate the editing of mappings. We propose the RMLEditor, a visual graph-based user interface, which allows users to easily define the mappings that deliver the RDF representation of the corresponding raw data. Neither knowledge of the underlying mapping language nor the used technologies is required. The RMLEditor aims to facilitate the editing of mappings, and thereby lowers the barriers to create Linked Data. The RMLEditor is developed for use by data specialists who are partners of (i) a companies-driven pilot and (ii) a community group. The current version of the RMLEditor was validated: participants indicate that it is adequate for its purpose and the graph-based approach enables users to conceive the linked nature of the data.","authors":["Pieter Heyvaert","Anastasia Dimou","Aron-Levi Herregodts","Ruben Verborgh"],"meta":["May 2016","DOI:10.1007/978-3-319-34129-3_43","Conference: The Semantic Web -- Latest Advances and New Domains (ESWC 2016)"],"references":["319394819_SUS_--_a_quick_and_dirty_usability_scale","300897674_Sheet2RDF_a_Flexible_and_Dynamic_Spreadsheet_ImportLifting_Framework_for_RDF","291166378_Towards_a_Uniform_User_Interface_for_Editing_Mapping_Definitions","268297633_Software_Architecture_Scenario_and_Patterns","318741055_The_Use_of_Think-aloud_Methods_in_Qualitative_Research_An_Introduction_to_Think-aloud_Methods","305993242_DataOps_Seamless_End-to-End_Anything-to-RDF_Data_Integration","293814540_How_to_Best_Find_a_Partner_An_Evaluation_of_Editing_Approaches_to_Construct_R2RML_Mappings","288972186_The_Use_of_Think-aloud_Methods_in_Qualitative_Research_An_Introduction_to_Think-aloud_Methods","265918378_Re-using_cool_URIs_Entity_reconciliation_against_LOD_hubs","264274087_RML_A_Generic_Language_for_Integrated_RDF_Mappings_of_Heterogeneous_Data"]}