{"id":"303085079_Procedural_Modeling_in_3D_GIS_Environment","abstract":"3D space registration and visualization has become an imperative need in order to optimally reflect all complex cases of rapid urbanization of property rights and restrictions. Besides, current technological advances as well as the availability of sophisticated software packages (proprietary or open source) call for 3D modeling especially in the GIS domain. Within this context, GIS community's present demands concerning the third dimension are discussed, while a variety of 3D modeling techniques is presented, with special emphasis on procedural modeling. Procedural modeling refers to a variety of techniques for the algorithmic generation of detailed 3D models and composite facade textures from sets of rules which are called grammars. In this paper procedural modeling is employed via CityEngine software focusing on the 3D visualization of the National Technical University of Athens (NTUA) campus' three-dimensional model, rendering a higher detail on the School of Rural and Surveying Engineering (SRSE). This algorithmic modeling concept is based on the principle that all real world buildings are defined by rules, since repetitive patterns and hierarchical components describe their geometry. The detailed geometries of the model derived from the application of CGA (Computer Generated Architecture) shape grammars on selected footprints, and the process resulted in a final 3D model, optimally describing the built environment and proved to be a good practice example of 3D visualization.","authors":["Eva Tsiliakou","Tassos Labropoulos","Efi Dimopoulou"],"meta":["July 2014","DOI:10.4018/ij3dim.2014070102"],"references":["292602298_Legal_aspects_of_3D_property_rights_restrictions_and_responsibilities_in_Greece_and_Cyprus","276021038_Semi-Automatic_Modelling_of_Building_Facades_with_Shape_Grammars_using_Historic_Building_Information_Modelling","257055069_Visualization_requirements_for_3D_cadastral_systems","237443110_CityGML_-_Interoperable_access_to_3D_city_models","235759641_Standards_for_Exchange_and_Storage_of_3D_Information_Challenges_and_Opportunities_for_Emergency_Response","221329330_'Shape_Grammars_and_the_Generative_Specification_of_Painting_and_Sculpture'","220183823_Procedural_Modeling_of_Buildings","47504041_Instant_Architecture","28579025_Urban_information_model_for_city_planning","255968959_5D_Modeling_--_applications_and_advantages","220720591_Procedural_Modeling_of_Cities","220696460_3D_Geo-Information_Sciences","27346493_UML_modelling_from_a_2D_to_a_3D_Cadastre"]}