{"id":"303182709_An_Exploratory_Qualitative_and_Quantitative_Study_into_the_Effectiveness_of_Digital_Games_as_a_Tool_to_Enhance_the_Learning_of_Introductory_Programming","abstract":"This study presents the details of an initial study that is conducted to identify the features and characteristics of using games to improve the ability of students to code. The objective of this study is to examine the quality of a game meant for learning programming concepts. Participants in the exploratory study were 42 students from a local higher education institution. Subjective data were collected with pre-and post-use questionnaires whereas objective data was gathered with interviews, observations and in the form of in-game progress. The analysis of collected data uncovered: (1) to what extent students with different background knowledge differ in their perception of programming and attitudes towards using games for educational purposes, and (2) which quality is relevant for the assessment of games designed for learning programming. All students are neutral in their past programming experience and neutral receptive towards programming prior to the digital game workshop. After the workshop, they feel the digital game has enhanced their understanding in basic programming concepts (60.9% of first semester students and 57.9% of second semester students) and ability to conceptualize the solution to a particular problem (69.6% of first semester students and 73.7% of second semester students). Moreover, the digital game has helped to improve their perceptions on programming and dispel their negative thoughts on programming.","authors":["Seng Yue Wong","Wong Lai Wan"],"meta":["March 2016","DOI:10.20533/ijds.2040.2570.2016.0136"],"references":["286013546_The_construction_of_an_online_competitive_game-based_learning_system_for_junior_high_school_students","279936430_Learning_Basic_Programming_Concepts_By_Creating_Games_With_Scratch_Programming_Environment","279186536_Can_educational_video_games_increase_high_school_students'_interest_in_theatre","275543017_Usability_and_User_Satisfaction_of_Hardware-Software_Interfacing_Visualization_Kit_for_Novice_Learning_Programming","271545214_Principles_of_a_debugging-first_puzzle_game_for_computing_education","284886595_The_girl_game_company_Engaging_latina_girls_in_information_technology","278672713_A_new_way_of_teaching_programming_skills_to_K-12_students_Codeorg","273400769_Cognitive_abilities_digital_games_and_arithmetic_performance_enhancement_A_study_comparing_the_effects_of_a_math_game_and_paper_exercises","271728118_Effects_of_Using_Alice_and_Scratch_in_an_Introductory_Programming_Course_for_Corrective_Instruction","268694994_Learning_economics_concepts_through_game-play_An_experiment"]}