{"id":"303182560_A_numerical_model_for_pressure_drop_and_flow_distribution_in_a_solar_collector_with_U-connected_absorber_pipes","abstract":"This study presents a numerical model calculating the pressure drop and flow distribution in a solar collector with U-type harp configuration in isothermal conditions. The flow maldistribution in the absorber pipes, caused by the different hydraulic resistances, was considered to evaluate the pressure drop across the collector. The model was developed in Matlab and is based on correlations found in literature for both friction losses and local losses, and was compared in terms of overall pressure drop against experimental measurements carried out on an Arcon Sunmark HT 35/10 solar collector at different flow rates and temperatures for water and water/propylene glycol mixture. For collector pressure drops higher than 1.4 kPa, the relative difference between the model and measurements was within 5% for water and 7% for water/propylene glycol mixture. For lower pressure drops the relative difference increased, but remained within the accuracy of the differential pressure sensor. The flow distribution was mainly affected by the flow regime in the manifolds. Turbulent regime throughout the manifolds entailed a more uniform distribution across the absorber pipes compared to laminar regime. The comparison between calculated flow distributions and results from previous literature showed a good agreement.","authors":["Federico Bava","Simon Furbo"],"meta":["September 2016Solar Energy 134:264-272","DOI:10.1016/j.solener.2016.05.012","Project: Development of detailed simulation models of large solar collector fields for district heating applications"],"references":["283875143_CONJUGATE_HEAT_TRANSFER_AND_FLOW_DISTRIBUTION_IN_AN_ASSEMBLY_OF_MANIFOLDED_FINNED_TUBES","282482577_Using_water_for_heat_storage_in_thermal_energy_storage_TES_systems","281179749_VISCOSITY_OF_LIQUID_WATER_IN_THE_RANGE_minus_8_degree_C_TO_150_degree_C","256334586_Analysis_and_performance_of_flat-plate_solar_collector_arrays","250072890_Turbulent_Flow_in_Pipes_with_Particular_Reference_to_the_Transition_Region_Between_Smooth_and_Rough_Pipe_Laws","245170245_Flow_distribution_in_a_solar_collector_panel_with_horizontally_inclined_absorber_strips","245169538_Flow_distribution_in_manifolded_solar_collectors_with_negligible_buoyancy_effects","245169286_Flow_distribution_in_solar_collectors_with_laminar_flow_conditions","245168962_The_effect_of_nonuniform_fluid_flow_distribution_on_the_thermal_performance_of_solar_collector","243384455_Viscosity_of_liquid_water_in_the_range_-8AC_to_150AC","236382433_Simple_and_Explicit_Formulas_for_the_Friction_Factor_in_Turbulent_Pipe_Flow","229003915_Friction_factor_correlations_for_laminar_transition_and_turbulent_flow_in_smooth_pipes"]}