{"id":"303182244_Evaluating_transit_operator_efficiency_An_enhanced_DEA_model_with_constrained_fuzzy-AHP_cones","abstract":"This study addresses efforts to comb the Analytic Hierarchy Process (AHP) with Data Envelopment Analysis (DEA) to deliver a robust enhanced DEA model for transit operator efficiency assessment. The proposed model is designed to better capture inherent preferences information over input and output indicators by adding constraint cones to the conventional DEA model. A revised fuzzy AHP model is employed to generate cones, where the proposed model features the integration of the fuzzy logic with a hierarchical AHP structure to: 1) normalize the scales of different evaluation indicators, 2) construct the matrix of pair-wise comparisons with fuzzy set, and 3) optimize the weight of each criterion with a non-linear programming model. With introduction of cone-based constraints, the new system offers accounting advantages in the interaction among indicators when evaluating the performance of transit operators. To illustrate the applicability of the proposed approach, a real case in Nanjing City, the capital of China’s Jiangsu Province, has been selected to assess the efficiencies of seven bus companies based on 2009 and 2010 datasets. A comparison between conventional DEA and enhanced DEA was also conducted to clarify the new system’s superiority. Results reveal that the proposed model is more applicable in evaluating transit operator’s efficiency thus encouraging a boarder range of applications.","authors":["Xin Li","Yue Liu","Yaojun Wang","Zhigang Gao"],"meta":["May 2016Journal of Traffic and Transportation Engineering (English Edition) 3(3)","DOI:10.1016/j.jtte.2016.05.004"],"references":["272717027_Perspectives_of_the_Operational_Performance_of_Public_Transportation_Agencies_with_Data_Envelopment_Analysis_Technique","257728093_A_method_of_SVM_with_Normalization_in_Intrusion_Detection","312458957_A_Procedure_for_Ranking_Efficient_Units_in_Data_Envelopment_Analysis","292805348_Fuzzy_comprehensive_evaluation_model_based_on_improved_analytic_hierarchy_process","291848771_Generic_objectives_for_evaluation_of_intermodal_passenger_transfer_facilities","271581847_A_multi-dimensional_framework_for_evaluating_the_transit_service_performance","268865164_Quantitative_models_for_performance_evaluation_and_benchmarking_Data_development_analysis_with_spreadsheets_and_DEA_Excel_solver_With_CD-ROM","267763606_Measuring_managerial_efficiency_in_non-life_insurance_companies_An_application_of_two-stage_data_envelopment_analysis","262222013_The_Analytic_Hierarchy_Process","258121772_Effect_of_SOD_and_NaHCO3_on_the_vascular_hyporeactivity_of_rats_after_severe_hemorrhagic_shock"]}