{"id":"303123623_Pattern_and_semantic_analysis_to_improve_unsupervised_techniques_for_opinion_target_identification","abstract":"This research employs patterns and semantic analysis to improve the existing unsupervised opinion targets extraction technique. Two steps are employed to identify opinion targets: candidate selection and opinion targets selection. For candidate selection; a combined lexical based syntactic pattern is identified. For opinion targets selection, a hybrid approach that combines the existing likelihood ratio test technique with semantic based relatedness is proposed. The existing approach basically extracts frequently observed targets in text. However, analysis shows that not all target features occur frequently in the texts. Hence the hybrid technique is proposed to extract both frequent and infrequent targets. The proposed algorithm employs incremental approach to improve the performance of existing unsupervised mining of features by extracting infrequent features through semantic relatedness with frequent features based on lexical dictionary. Empirical results show that the hybrid technique with combined patterns outperforms the existing techniques.","authors":["Khairullah Khan","Ashraf Ullah","Baharum Baharudin"],"meta":["January 2016"],"references":["286996868_Automatic_categorization_of_fanatic_text_using_random_forests","260305033_Enhanced_SenticNet_with_Affective_Labels_for_Concept-Based_Opinion_Mining","260249953_Mining_Opinion_Targets_from_Text_Documents_A_Review","286495597_Time_heuristics_ranking_approach_for_recommended_queries_using_search_engine_query_logs","286022539_Collecting_evaluative_expressions_for_opinion_extraction","265481233_Tourism-Related_Opinion_Detection_and_Tourist-Attraction_Target_Identification","260333216_Using_Objective_Words_in_SentiWordNet_to_Improve_Word-of-Mouth_Sentiment_Classification","260305031_New_Avenues_in_Opinion_Mining_and_Sentiment_Analysis","233824576_Analysis_of_syntactic_patterns_for_identification_of_features_from_unstructured_reviews","233413130_Extracting_and_Grounding_Context-Aware_Sentiment_Lexicons"]}