{"id":"303171133_Intelligent_fault_diagnosis_and_prognosis_for_engineering_systems_Methods_and_case_studies","abstract":"PREFACE. ACKNOWLEDGMENTS. PROLOGUE. 1 INTRODUCTION. 1.1 Historical Perspective. 1.2 Diagnostic and Prognostic System Requirements. 1.3 Designing in Fault Diagnostic and Prognostic Systems. 1.4 Diagnostic and Prognostic Functional Layers. 1.5 Preface to Book Chapters. 1.6 References. 2 SYSTEMS APPROACH TO CBM/PHM. 2.1 Introduction. 2.2 Trade Studies. 2.3 Failure Modes and Effects Criticality Analysis (FMECA). 2.4 System CBM Test-Plan Design. 2.5 Performance Assessment. 2.6 CBM/PHM Impact on Maintenance and Operations: Case Studies. 2.7 CBM/PHM in Control and Contingency Management. 2.8 References. 3 SENSORS AND SENSING STRATEGIES. 3.1 Introduction. 3.2 Sensors. 3.3 Sensor Placement. 3.4 Wireless Sensor Networks. 3.5 Smart Sensors. 3.6 References. 4 SIGNAL PROCESSING AND DATABASE MANAGEMENT SYSTEMS. 4.1 Introduction. 4.2 Signal Processing in CBM/PHM. 4.3 Signal Preprocessing. 4.4 Signal Processing. 4.5 Vibration Monitoring and Data Analysis. 4.6 Real-Time Image Feature Extraction and Defect/Fault Classification. 4.7 The Virtual Sensor. 4.8 Fusion or Integration Technologies. 4.9 Usage-Pattern Tracking. 4.10 Database Management Methods. 4.11 References. 5 FAULT DIAGNOSIS. 5.1 Introduction. 5.2 The Diagnostic Framework. 5.3 Historical Data Diagnostic Methods. 5.4 Data-Driven Fault Classification and Decision Making. 5.5 Dynamic Systems Modeling. 5.6 Physical Model-Based Methods. 5.7 Model-Based Reasoning. 5.8 Case-Based Reasoning (CBR). 5.9 Other Methods for Fault Diagnosis. 5.10 A Diagnostic Framework for Electrical/Electronic Systems. 5.11 Case Study: Vibration-Based Fault Detection and Diagnosis for Engine Bearings. 5.12 References. 6 FAULT PROGNOSIS. 6.1 Introduction. 6.2 Model-Based Prognosis Techniques. 6.3 Probability-Based Prognosis Techniques. 6.4 Data-Driven Prediction Techniques. 6.5 Case Studies. 6.6 References. 7 FAULT DIAGNOSIS AND PROGNOSIS PERFORMANCE METRICS. 7.1 Introduction. 7.2 CBM/PHM Requirements Definition. 7.3 Feature-Evaluation Metrics. 7.4 Fault Diagnosis Performance Metrics. 7.5 Prognosis Performance Metrics. 7.6 Diagnosis and Prognosis Effectiveness Metrics. 7.7 Complexity/Cost-Benefit Analysis of CBM/PHM Systems. 7.8 References. 8 LOGISTICS: SUPPORT OF THE SYSTEM IN OPERATION. 8.1 Introduction. 8.2 Product-Support Architecture, Knowledge Base, and Methods for CBM. 8.3 Product Support without CBM. 8.4 Product Support with CBM. 8.5 Maintenance Scheduling Strategies. 8.6 A Simple Example. 8.7 References. APPENDIX. INDEX.","authors":["George Vachtsevanos","F.L. Lewis","M. Roemer","Andrew Hess"],"meta":["January 2006","DOI:10.1002/9780470117842"],"references":["284844321_A_Heuristic_Approach_to_Reinforcement_Learning_Control_Systems"]}