{"id":"303273439_Spectrum_and_Infrastructure_Sharing_in_Millimeter_Wave_Cellular_Networks_An_Economic_Perspective","abstract":"The licensing model for millimeter wave bands has been the subject of considerable debate, with some industry players advocating for unlicensed use and others for traditional geographic area exclusive use licenses. Meanwhile, the massive bandwidth, highly directional antennas, high penetration loss and susceptibility to shadowing in these bands suggest certain advantages to spectrum and infrastructure sharing. However, even when sharing is technically beneficial (as recent research in this area suggests that it is), it may not be profitable. In this paper, both the technical and economic implications of resource sharing in millimeter wave networks are studied. Millimeter wave service is considered in the economic framework of a network good, where consumers' utility depends on the size of the network, and the strategic decisions of consumers and service providers are connected to detailed network simulations. The results suggest that \"open\" deployments of neutral small cells that serve subscribers of any service provider encourage market entry by making it easier for networks to reach critical mass, more than \"open\" (unlicensed) spectrum would. The conditions under which competitive service providers would prefer to share resources or not are also described.","authors":["Fraida Fund","Shahram Shahsavari","Shivendra S. Panwar","Elza Erkip"],"meta":["May 2016","Project: Economic perspectives of spectrum and infrastructure sharing in mmwave and microwave cellular networks"],"references":["301839353_Resource_Sharing_in_5G_mmWave_Cellular_Networks","286134832_On_the_Feasibility_of_Sharing_Spectrum_Licenses_in_mmWave_Cellular_Systems","274966990_A_Sharing-_and_Competition-Aware_Framework_for_Cellular_Network_Evolution_Planning","301854806_Spectrum_Pooling_in_MmWave_Networks_Opportunities_Challenges_and_Enablers","293605734_Infrastructure_and_Spectrum_Sharing_Trade-offs_in_Mobile_Networks","283793836_On_5G_radio_access_architecture_and_technology_Industry_Perspectives","283692273_'The_economics_of_networks'","277672824_Coordination_context-based_spectrum_sharing_for_5G_millimeter-wave_networks","276844844_State-of-the-Art_Business_Performance_Evaluation_of_the_Advanced_Wireless_Heterogeneous_Networks_to_be_Deployed_for_the_TERA_Age","276396842_A_Two-Level_Temporal_Fair_Scheduler_for_Multi-Cell_Wireless_Networks"]}