{"id":"303276436_Successful_IT_governance_in_SMES_An_application_of_the_Technology-Organisation-Environment_theory","abstract":"Background: Small and medium-sized enterprises (SMEs) are the bedrock of most economies\nof the world. Due to global competition, SMEs are making significant investments in\ninformation technology (IT) to improve their business processes. However, a study of extant\nliterature on the subject of IT governance in SMEs has highlighted the fact that the\nimplementation of structural controls to enable effective IT governance is often difficult,\nresulting in project failures and loss of income.\nObjectives: This paper seeks to examine ways by which SMEs can successfully adapt a suitable\nIT governance framework to manage its IT investments.\nMethod: A content analysis of extant literature was done in this paper. The Technology–\nOrganisation–Environment theory forms the theoretical basis of the proposed key pillars for\nan SME to evaluate its capability to embark on an IT governance initiative in order to obtain\nthe desired results.\nResults: From the content analysis of relevant literature, the paper proposed three key pillars\nwhich should be in place before an SME adapts any IT governance framework to manage its\nIT investments. The key pillars are considered an important link between strategic IT\ngovernance plans and measurable successful outcomes.\nConclusion: It was concluded that an SME would be better positioned for successful IT\ngovernance if it were to conduct a careful analysis of the components of these key pillars\nbefore embarking on the implementation of any IT governance framework.","authors":["Stephen Flowerday"],"meta":["May 2016SA Journal of Information Management 18(1):1-8","DOI:10.4102/sajim.v18i1.696"],"references":["261725955_Content_Analysis_as_a_Research_Tool_for_Marketing_Management_and_Development_Strategies_in_Tourism","257996501_Perceived_Effectiveness_of_Information_Technology_Governance_Initiatives_Among_IT_Practitioners","239591699_Firms_Patterns_of_e-Business_Adoption_Evidence_for_the_European_Union27","345990639_The_Economics_and_Management_of_Small_Business_An_International_Perspective","308926748_Designing_Qualitative_Research","276091857_Does_a_Technology-Driven_Organization's_Culture_Influence_the_Trust_Employees_Have_in_Their_Managers","272566756_Qualitative_Data_Analysis_A_Methods_Sourcebook","263749428_Perceived_Risk_and_Organizational_Commitment_The_Moderating_Role_of_Organizational_Trust","262163604_Towards_a_framework_for_decision_making_regarding_IT_adoption","252631221_Information_Systems_-_Creativity_and_Innovation_in_Small_and_Medium-Sized_Enterprises"]}