{"id":"303296728_Sustainability_Design_in_Requirements_Engineering_State_of_Practice","abstract":"Sustainability is now a major concern in society, but there is little understanding of how it is perceived by software engineering professionals and how sustainability design can become an embedded part of software engineering process. This paper presents the results of a qualitative study exploring requirements engineering practitioners' perceptions and attitudes towards sustainability. It identifies obstacles and mitigation strategies regarding the application of sustainability design principles in daily work life. The results of this study reveal several factors that can prevent sustainability design from becoming a first class citizen in software engineering: software practitioners tend to have a narrow understanding of the concept of sustainability; organizations show limited awareness of its potential opportunities and benefits; and the norms in the discipline are not conducive to sustainable outcomes. These findings suggest the need for focused efforts in sustainability education, but also a need to rethink professional norms and practices.","authors":["Ruzanna Chitchyan","Christoph Becker","Stefanie Betz","Leticia Duboc"],"meta":["May 2016","DOI:10.1145/2889160.2889217","Conference: the 38th International Conference","Project: Sustainability Design"],"references":["308868573_Sustainability_Design_and_Software_The_Karlskrona_Manifesto","281558264_Evidencing_Sustainability_Design_through_Examples","267453342_The_Karlskrona_manifesto_for_sustainability_design","329654446_Engineering_a_Safer_World_Systems_Thinking_Applied_to_Safety","308825429_Why_Good_Developers_Write_Bad_Code_An_Observational_Case_Study_of_the_Impacts_of_Organizational_Factors_on_Software_Quality","299915371_The_Future_of_Software_Engineering_SEIP_Keynote","290334298_Qualitative_data_An_introduction_to_coding_and_analysis","283754563_Requirements_The_Key_to_Sustainability","271453106_Beyond_computer_science","267542530_The_Karlskrona_manifesto_for_sustainability_design"]}