{"id":"303295077_Models_and_algorithms_for_genome_rearrangement_with_positional_constraints","abstract":"Background\nTraditionally, the merit of a rearrangement scenario between two gene orders has been measured based on a parsimony criteria alone; two scenarios with the same number of rearrangements are considered equally good. In this paper, we acknowledge that each rearrangement has a certain likelihood of occurring based on biological constraints, e.g. physical proximity of the DNA segments implicated or repetitive sequences.\n\nResults\nWe propose optimization problems with the objective of maximizing overall likelihood, by weighting the rearrangements. We study a binary weight function suitable to the representation of sets of genome positions that are most likely to have swapped adjacencies. We give a polynomial-time algorithm for the problem of finding a minimum weight double cut and join scenario among all minimum length scenarios. In the process we solve an optimization problem on colored noncrossing partitions, which is a generalization of the Maximum Independent Set problem on circle graphs.\n\nConclusions\nWe introduce a model for weighting genome rearrangements and show that under simple yet reasonable conditions, a fundamental distance can be computed in polynomial time. This is achieved by solving a generalization of the Maximum Independent Set problem on circle graphs. Several variants of the problem are also mentioned.","authors":["Krister M. Swenson","Pijus Simonaitis","Mathieu Blanchette"],"meta":["May 2016Algorithms for Molecular Biology 11(1)","DOI:10.1186/s13015-016-0065-9"],"references":["259192818_The_Exemplar_Breakpoint_Distance_for_Non-trivial_Genomes_Cannot_Be_Approximated","257870075_Medians_seek_the_corners_and_other_conjectures","236031813_Combinatorics_of_Genome_Rearrangements","230609731_On_pairwise_distances_and_median_score_of_three_genomes_under_DCJ","331865689_Improved_bounds_on_sorting_by_length-weighted_reversals","286157856_Approximation_algorithms_for_sorting_by_signed_short_reversals","258044528_High-Resolution_Mapping_of_the_Spatial_Organization_of_a_Bacterial_Chromosome","231586595_Genomic_sorting_with_length-weighted_reversals","229457467_Algorithms_for_a_Maximum_Clique_and_A_Maximum_Independent_Set_of_a_Circle_Graph","229436229_ANGES_reconstructing_ANcestral_GEnomeS_maps"]}