{"id":"303294459_Fundamental_Matrix_of_a_Stereo_Pair_with_A_Contrario_Elimination_of_Outliers","abstract":"In a stereo image pair, the fundamental matrix encodes the rigidity constraint of the scene. It combines the internal parameters of both cameras (which can be the same) and their relative position and orientation. It associates to image points in one view the so-called epipolar line in the other view, which is the locus of projection of the same 3D point, whose particular position on the straight line is determined by its depth. Reducing the correspondence search to a 1D line instead of the 2D image is a large benefit enabling the computation of the dense 3D scene. The estimation of the matrix depends on at least seven pairs of corresponding points in the images. The algorithm discarding outliers presented here is a variant of the classical RANSAC (RANdom SAmple Consensus) based on a contrario methodology and proposed first by Moisan and Stival in 2004 under the name ORSA. The distinguishing feature of this algorithm compared to other RANSAC variants is that the measure of validity of a set of point pairs is not its sheer number, but a combination of this number and the geometric precision of the points. Source Code The open-source code is available at the IPOL the web page of this article 1. Most of the code is shared with the companion article by the same authors [12] dealing with a contrario estimation of a homography. This emphasizes the generality of the methodology and its simple specialization to different geometric problems.","authors":["Lionel Moisan","Pierre Moulon","Pascal Monasse"],"meta":["May 2016Image Processing On Line 5:89-113","DOI:10.5201/ipol.2016.147"],"references":["283754272_Anatomy_of_the_SIFT_method","274120914_Quasi-Euclidean_Epipolar_Rectification","267153297_A_New_A_Contrario_Approach_for_the_Robust_Determination_of_the_Fundamental_Matrix","240308787_USAC_A_Universal_Framework_for_Random_Sample_Consensus","234044400_Adaptive_Structure_from_Motion_with_a_Contrario_Model_Estimation","232747391_Automatic_Homographic_Registration_of_a_Pair_of_Images_with_A_Contrario_Elimination_of_Outliers","313527089_Distinctive_image_features_from_scale-invariant_key_points","267663982_From_Gestalt_Theory_to_Image_Analysis_A_Probabilistic_Approach","239549281_A_Computer_Alorithm_for_Reconstructing_a_Scene_from_Two_Projections","226172180_Rank_Conditions_on_the_Multiple-View_Matrix"]}