{"id":"303239675_Bebras_-_a_Sustainable_Community_Building_Model_for_the_Concept_Based_Learning_of_Informatics_and_Computational_Thinking","abstract":"As an international informatics contest, or challenge, Bebras has started the second decade of its existence. The contest attracts more and more countries every year, recently there have been over 40 participating countries. From a single contest-focused annual event Bebras developed to a multifunctional challenge and an activities-based educational community building model. This paper aims to introduce the Bebras model using ten years of observations in implementing the contest in different countries. The model is essentially based on democratic and inclusive education values. Systematic literature review of research papers concerning Bebras activities has made an integral background for this model. The model is represented both at international and national levels and consists of several components where the development of Bebras tasks has taken a very significant role. Reasoning on innovated learning informatics and strengthening computational thinking by utilising carefully selected informatics concepts is discussed as well.","authors":["Valentina Dagiene","Gabrielė Stupurienė"],"meta":["May 2016Informatics in Education 15(1):25-44","DOI:10.15388/infedu.2016.02","Project: Bebras - International challenge on Informatics and CT"],"references":["312222095_Introducing_computational_thinking_through_a_contest_on_informatics_Problem-solving_and_gender_issues","305084487_Programming_in_Slovak_Primary_Schools","300253780_Computing_at_School_in_Sweden_-_Experiences_from_Introducing_Computer_Science_within_Existing_Subjects","300253595_Introducing_a_New_Computer_Science_Curriculum_for_All_School_Levels_in_Poland","301463456_Bebras_Contest_for_Blind_Pupils","300481277_How_Challenging_are_Bebras_Tasks","300253699_A_Snapshot_of_the_First_Implementation_of_Bebras_International_Informatics_Contest_in_Turkey","300253696_Olympiad_in_Computer_Science_and_Discrete_Mathematics","299861897_Bebras_Informatics_Contest_Criteria_for_Good_Tasks_Revised","298216879_Introducing_topics_from_informatics_into_primary_school_curricula"]}