{"id":"303395221_Data_Sets_Replicas_Placements_Strategy_from_Cost-Effective_View_in_the_Cloud","abstract":"Replication technology is commonly used to improve data availability and reduce data access latency in the cloud storage system by providing users with different replicas of the same service. Most current approaches largely focus on system performance improvement, neglecting management cost in deciding replicas number and their store places, which cause great financial burden for cloud users because the cost for replicas storage and consistency maintenance may lead to high overhead with the number of new replicas increased in a pay-as-you-go paradigm. In this paper, towards achieving the approximate minimum data sets management cost benchmark in a practical manner, we propose a replicas placements strategy from cost-effective view with the premise that system performance meets requirements. Firstly, we design data sets management cost models, including storage cost and transfer cost. Secondly, we use the access frequency and the average response time to decide which data set should be replicated. Then, the method of calculating replicas’ number and their store places with minimum management cost is proposed based on location problem graph. Both the theoretical analysis and simulations have shown that the proposed strategy offers the benefits of lower management cost with fewer replicas.","authors":["Xiuguo Wu"],"meta":["January 2016Scientific Programming 2016(11):1-13","DOI:10.1155/2016/1496714"],"references":["225903228_Data_Management_in_an_International_Data_Grid_Project","224309475_Secure_Data_Objects_Replication_in_Data_Grid","224257067_A_Local-Optimisation_Based_Strategy_for_Cost-Effective_Datasets_Storage_of_Scientific_Applications_in_the_Cloud","277844517_A_New_Cost-effective_Technique_for_QoS_Support_in_Clusters","261313212_Classic_Replication_Techniques_on_the_Cloud","251634503_Method_for_replica_creation_in_data_grids_based_on_complex_networks","245477431_Using_OptorSim_to_efficiently_simulate_replica_placement_strategies","223881906_An_Integrated_Model_of_Facility_Location_and_Transportation_Network_Design","222410212_Cloud_Computing_and_Emerging_IT_Platforms_Vision_Hype_and_Reality_for_Delivering_Computing_as_the_5th_Utility","222243414_Job_scheduling_and_data_replication_on_data_grids"]}