{"id":"303348210_English_for_Academic_Purposes","abstract":"What Is EAP? English for academic purposes (EAP) has emerged out of the broader fi eld of English for specifi c purposes (ESP), defi ned by its focus on teaching English specifi cally to facilitate learners' study or research through the medium of English (Flowerdew & Peacock, 2001, p. 8; Hyland & Hamp-Lyons, 2002, p. 1). EAP is differentiated from ESP by this focus on academic contexts, but among the applied linguistics and English language teaching fi elds more widely the view of EAP as a sub-discipline within ESP still holds. Indeed, both these views are valid, as the histories of ESP and EAP do not distinguish between a view of them as parent to child, or as sister fi elds. It is not unusual to fi nd articles with an EAP focus in the pages of the English for Specifi c Purposes Journal, but EAP work also appears in all the applied linguistics and English language teaching (ELT) journals from time to time. Differentiation depends more on the interests and concerns of the researcher than on the kind of data being discussed. In the \" Aims and Scope \" statement of the Journal of English for Academic Purposes (JEAP), published in the frontmatter of every issue and on the website (www.elsevier.com/ locate/JEAP), Hyland and Hamp-Lyons defi ne the scope of EAP as \" the linguistic, sociolinguistic and psycholinguistic description of English as it occurs in the contexts of academic study and scholarly exchange itself \". Similarly, it is possible, indeed reasonable, to view EAP as a branch within education, or at least within language education: this is a view I hold myself. EAP teachers take pride in their expertise in classroom teaching, their responsiveness to students' needs through curriculum planning and materials development, through individualization of support to students and through context-aware educational management. But EAP is an eclectic and pragmatic discipline: a wide range of linguistic, applied linguistic and educational topics can be considered from the perspective of English for academic purposes, or drawn in methodologically to inform EAP. These include classroom language, teaching methodology, teacher education, assessment of language, needs analysis, materials development and evaluation, discourse analysis, acquisition studies in EAP contexts, research writing and speaking at all academic levels, the sociopolitics of English in academic uses and language plan-ning—and this list is sure to be incomplete.","authors":["Liz Hamp-Lyons"],"meta":["January 2011","DOI:10.1017/CBO9780511667206.019","In book: Handbook of Research on Second Language Learning and Teaching (pp.89-105)Chapter: 6Publisher: Routledge/Taylor & FrancisEditors: E.Hinkel"],"references":["322077137_The_British_Academic_Spoken_English_BASE_Corpus_Project","346644499_Text_Role_and_Context_Developing_Academic_Literacies","345850175_English_in_Today's_Research_World_A_Writing_Guide","331912515_Academic_Listening_Strategies_A_Guide_to_Understanding_Lectures","324804074_Other_Floors_Other_Voices_A_textography_of_a_small_university_building_second_20th_anniversary_edition","324319773_Language_as_Discourse_Perspectives_for_Language_Teaching","324315345_Ways_with_Words_Language_Life_and_Work_in_Communities_and_Classrooms","324306533_An_Introduction_to_Functional_Grammar","321748762_Contrastive_Rhetoric_Cross-Cultural_Aspects_of_Second-Language_Writing","313440096_Teaching_classroom_and_authentic_genres_Initiating_students_into_academic_cultures_and_discourses"]}