{"id":"303367001_Analysis_of_Network_Clustering_Algorithms_and_Cluster_Quality_Metrics_at_Scale","abstract":"Overview\nNotions of community quality underlie the clustering of networks. While studies surrounding network clustering are increasingly common, a precise understanding of the realtionship between different cluster quality metrics is unknown. In this paper, we examine the relationship between stand-alone cluster quality metrics and information recovery metrics through a rigorous analysis of four widely-used network clustering algorithms—Louvain, Infomap, label propagation, and smart local moving. We consider the stand-alone quality metrics of modularity, conductance, and coverage, and we consider the information recovery metrics of adjusted Rand score, normalized mutual information, and a variant of normalized mutual information used in previous work. Our study includes both synthetic graphs and empirical data sets of sizes varying from 1,000 to 1,000,000 nodes.\n\nCluster Quality Metrics\nWe find significant differences among the results of the different cluster quality metrics. For example, clustering algorithms can return a value of 0.4 out of 1 on modularity but score 0 out of 1 on information recovery. We find conductance, though imperfect, to be the stand-alone quality metric that best indicates performance on the information recovery metrics. Additionally, our study shows that the variant of normalized mutual information used in previous work cannot be assumed to differ only slightly from traditional normalized mutual information.\n\nNetwork Clustering Algorithms\nSmart local moving is the overall best performing algorithm in our study, but discrepancies between cluster evaluation metrics prevent us from declaring it an absolutely superior algorithm. Interestingly, Louvain performed better than Infomap in nearly all the tests in our study, contradicting the results of previous work in which Infomap was superior to Louvain. We find that although label propagation performs poorly when clusters are less clearly defined, it scales efficiently and accurately to large graphs with well-defined clusters.","authors":["Scott Emmons","Stephen G. Kobourov","Mike Gallant","Katy Borner"],"meta":["May 2016PLoS ONE 11(7)","DOI:10.1371/journal.pone.0159161"],"references":["303214441_Gephi_An_Open_Source_Software_for_Exploring_and_Manipulating_Networks","353316930_Proceedings_of_the_First_International_Conference_on_Information_Technology_and_Knowledge_Management","322471811_On_optimal_and_data-based_histograms","313366372_Finding_and_evaluating_community_structure_in_networks_Phys","303834386_CHIMERA_Top-down_model_for_hierarchical_overlapping_and_directed_cluster_structures_in_directed_and_weighted_complex_networks","283738615_Resolution_limit_in_community_detection","283531736_Efficient_community_detection_of_network_flows_for_varying_Markov_times_and_bipartite_networks","280939909_Graph_Clustering","280795209_Violin_Plots_A_Box_Plot-Density_Trace_Synergism","273394778_Error_Bars_Considered_Harmful_Exploring_Alternate_Encodings_for_Mean_and_Error"]}