{"id":"303380702_On_the_Properties_of_Non-Media_Digital_Watermarking_A_Review_of_State_of_the_Art_Techniques","abstract":"Over the last 25 years, there has been much work on multimedia digital watermarking. In this domain, the primary limitation to watermark strength has been in its visibility. For multimedia watermarks, invisibility is defined in human terms (that is, in terms of human sensory limitations). In this paper, we review recent developments in the non-media applications of data watermarking, which have emerged over the last decade as an exciting new sub-domain. Since by definition, the intended receiver should be able to detect the watermark, we have to redefine invisibility in an acceptable way that is often application-specific and thus cannot be easily generalized. In particular, this is true when the data is not intended to be directly consumed by humans. For example, a loose definition of robustness might be in terms of the resilience of a watermark against normal host data operations, and of invisibility as resilience of the data interpretation against change introduced by the watermark. In our paper, we classify the data in terms of data mining rules on complex types of data such as time-series, symbolic sequences, data streams and so forth. We emphasize the challenges involved in non-media watermarking in terms of common watermarking properties including invisibility, capacity, robustness, and security. With the aid of a few examples of watermarking applications, we demonstrate these distinctions and we look at the latest research in this regard to make our argument clear and more meaningful. As the last aim, we look at the new challenges of digital watermarking that have arisen with the evolution of big data.","authors":["Arezou Soltanipanah","Ron G. van Schyndel","Timos Sellis","Elisa Bertino"],"meta":["May 2016IEEE Access 4:1-1","DOI:10.1109/ACCESS.2016.2570812"],"references":["339504614_Channel_Coding_in_the_Presence_of_Side_Information","319762340_Hello_World_Introducing_Spatial_Data","314824567_SIA_secure_information_aggregation_in_sensor_networks","307836461_The_First_50_Years_of_Electronic_Watermarking","303206384_Data_Mining_Concepts_and_Techniques","302800549_Systems_and_methods_for_metadata_embedding_in_streaming_medical_data","301417649_Towards_Graph_Watermarks","301377425_Encoding_numbers_into_reducible_permutation_graphs_using_heap-ordered_trees","300576010_Rights_Protection_for_Trajectory_Streams","286352409_A_Survey_of_Watermarking_Security","286199959_Mean_squared_error_Love_it_or_leave_it_A_new_look_at_Signal_Fidelity_Measures","282527341_Hiding_data_in_compressive_sensed_measurements_A_conditionally_reversible_data_hiding_scheme_for_compressively_sensed_measurements","282032217_In_the_Shadows_we_Trust_A_Secure_Aggregation_Tolerant_Watermark_for_Data_Streams","281167978_Quantization_index_modulation_A_class_of_provably_good_methods_for_digital_watermarking_and_information_embedding","279450010_In_the_shadows_we_trust_A_secure_aggregation_tolerant_watermark_for_data_streams"]}