{"id":"303397810_3D_Printing_in_the_Laboratory_Maximize_Time_and_Funds_with_Customized_and_Open-Source_Labware","abstract":"3D printing, also known as additive manufacturing, is the computer-guided process of fabricating physical objects by depositing successive layers of material. It has transformed manufacturing across virtually every industry, bringing about incredible advances in research and medicine. The rapidly growing consumer market now includes convenient and affordable “desktop” 3D printers. These are being used in the laboratory to create custom 3D-printed equipment, and a growing community of designers are contributing open-source, cost-effective innovations that can be used by both professionals and enthusiasts. User stories from investigators at the National Institutes of Health and the biomedical research community demonstrate the power of 3D printing to save valuable time and funding. While adoption of 3D printing has been slow in the biosciences to date, the potential is vast. The market predicts that within several years, 3D printers could be commonplace within the home; with so many practical uses for 3D printing, we anticipate that the technology will also play an increasingly important role in the laboratory.","authors":["Meghan Coakley McCarthy","Darrell Hurt"],"meta":["May 2016Journal of the Association for Laboratory Automation 21(4)","DOI:10.1177/2211068216649578","Project: 3D Printing for Bioscientific and Medical Research and Visualization"],"references":["282454528_Open_source_and_DIY_hardware_for_DNA_nanotechnology_labs","281361072_Return_on_investment_for_open_source_scientific_hardware_development","280869161_Open-Source_Photometric_System_for_Enzymatic_Nitrate_Quantification","273129530_The_NIH_3D_Print_Exchange_A_Public_Resource_for_Bioscientific_and_Biomedical_3D_Prints","266949889_Visual_Perception_in_the_Brain_of_a_Jumping_Spider","265735004_Open-Source_Syringe_Pump_Library","236252679_Open-Source_Colorimeter","320874505_SECOND_INDUSTRIAL_REVOLUTION","282362097_Three-Dimensional_Modeling_May_Improve_Surgical_Education_and_Clinical_Practice","274801219_The_Third_Industrial_Revolution"]}