{"id":"303318727_Global_Research_on_Artificial_Intelligence_from_1990-2014_Spatially-Explicit_Bibliometric_Analysis","abstract":"In this article, we conducted the evaluation of artificial intelligence research from 1990–2014 by using bibliometric analysis. We introduced spatial analysis and social network analysis as geographic information retrieval methods for spatially-explicit bibliometric analysis. This study is based on the analysis of data obtained from database of the Science Citation Index Expanded (SCI-Expanded) and Conference Proceedings Citation Index-Science (CPCI-S). Our results revealed scientific outputs, subject categories and main journals, author productivity and geographic distribution, international productivity and collaboration, and hot issues and research trends. The growth of article outputs in artificial intelligence research has exploded since the 1990s, along with increasing collaboration, reference, and citations. Computer science and engineering were the most frequently-used subject categories in artificial intelligence studies. The top twenty productive authors are distributed in countries with a high investment of research and development. The United States has the highest number of top research institutions in artificial intelligence, producing most single-country and collaborative articles. Although there is more and more collaboration among institutions, cooperation, especially international ones, are not highly prevalent in artificial intelligence research as expected. The keyword analysis revealed interesting research preferences, confirmed that methods, models, and application are in the central position of artificial intelligence. Further, we found interesting related keywords with high co-occurrence frequencies, which have helped identify new models and application areas in recent years. Bibliometric analysis results from our study will greatly facilitate the understanding of the progress and trends in artificial intelligence, in particular, for those researchers interested in domain-specific AI-driven problem-solving. This will be of great assistance for the applications of AI in alternative fields in general and geographic information science, in particular.","authors":["Jiqiang Niu","Wenwu Tang","Feng Xu","Xiaoyan Zhou"],"meta":["May 2016International Journal of Geo-Information 5(5):66","DOI:10.3390/ijgi5050066"],"references":["282637784_Application_of_artificial_bee_colony_algorithm_on_surface_wave_data","281751452_Global_trends_in_soil_monitoring_research_from_1999-2013_a_bibliometric_analysis","318780341_Geographic_information_systems_and_science_Today_and_tomorrow","312596137_Big_data_The_next_frontier_for_innovation_competition_and_productivity","302539368_ChemInform_Abstract_ARTIFICIAL_INTELLIGENCE_APPROACH_TO_STRUCTURE-ACTIVITY_STUDIES_COMPUTER_AUTOMATED_STRUCTURE_EVALUATION_OF_BIOLOGICAL_ACTIVITY_OF_ORGANIC_MOLECULES","297482408_The_underpublishing_of_science_and_technology_results","282638670_PS-ABC_A_Hybrid_Algorithm_Based_on_Particle_Swarm_and_Artificial_Bee_Colony_for_High-dimensional_Optimization_Problems","282620589_Modelling_of_compressive_strength_of_geopolymer_paste_mortar_and_concrete_by_optimized_support_vector_machine","282564187_Dynamic_analysis_of_soil-structure_interaction_using_the_neural_networks_and_the_support_vector_machines","281277148_Data-driven_input_variable_selection_for_rainfall-runoff_modeling_using_binary-coded_particle_swarm_optimization_and_Extreme_Learning_Machines"]}