{"id":"303496669_Finding_All_Maximal_Cliques_in_Very_Large_Social_Networks","abstract":"The detection of communities in social networks is a challenging task. A rigorous way to model communities considers maximal cliques, that is, maximal subgraphs in which each pair of nodes is connected by an edge. State-of-the-art strategies for finding maximal cliques in very large networks decompose the network in blocks and then perform a distributed computation. These approaches exhibit a trade-off between efficiency and completeness: decreasing the size of the blocks has been shown to improve efficiency but some cliques may remain undetected since high-degree nodes, also called hubs, may not fit with all their neighborhood into a small block. In this paper, we present a distributed approach that, by suitably handling hub nodes, is able to detect maximal cliques in large networks meeting both completeness and efficiency. The approach relies on a two-level decomposition process. The first level aims at recursively identifying and isolating tractable portions of the network. The second level further decomposes the tractable portions into small blocks. We demonstrate that this process is able to correctly detect all maximal cliques, provided that the sparsity of the network is bounded, as it is the case of real-world social networks. An extensive campaign of experiments confirms the effectiveness, efficiency, and scalability of our solution and shows that, if hub nodes were neglected, significant cliques would be undetected.","authors":["Alessio Conte","Roberto De Virgilio","Antonio Maccioni","Maurizio Patrignani"],"meta":["March 2016","DOI:10.5441/002/edbt.2016.18","Conference: EDBT 2016At: Bordeaux, France"],"references":["261959423_Fast_maximum_clique_algorithms_for_large_graphs","261849774_Large_scale_cohesive_subgraphs_discovery_for_social_network_visual_analysis","313061622_Finding_all_cliques_of_an_undirected_graph_algorithm_457","300590376_Efficient_Enumeration_of_Maximal_k-Plexes","288271487_Enumerating_all_connected_maximal_common_subgraphs_in_two_graphs","283188421_Distributed_Maximal_Clique_Computation_and_Management","273475688_High_quality_scalable_and_parallel_community_detection_for_large_real_graphs","266656598_Local_search_of_communities_in_large_graphs","262392280_PowerGraph_Distributed_graph-parallel_computation_on_natural_graphs","262356540_Sharding_social_networks"]}