{"id":"303497391_Big_Data_Classification_Using_the_SVM_Classifiers_with_the_Modified_Particle_Swarm_Optimization_and_the_SVM_Ensembles","abstract":"The problem with development of the support vector machine (SVM) classifiers using modified particle swarm optimization (PSO) algorithm and their ensembles has been considered. Solving this problem would allow fulfilling the high-precision data classification, especially Big Data classification, with the acceptable time expenditures. The modified PSO algorithm conducts a simultaneous search of the type of kernel functions, the parameters of the kernel function and the value of the regularization parameter for the SVM classifier. The idea of particles' «regeneration» served as the basis for the modified PSO algorithm. In the implementation of this algorithm, some particles change the type of their kernel function to the one which corresponds to the particle with the best value of the classification accuracy. The offered PSO algorithm allows reducing the time expenditures for the developed SVM classifiers, which is very important for Big Data classification problem. In most cases such SVM classifier provides the high quality of data classification. In exceptional cases the SVM ensembles based on the decorrelation maximization algorithm for the different strategies of the decision-making on the data classification and the majority vote rule can be used. Also, the two-level SVM classifier has been offered. This classifier works as the group of the SVM classifiers at the first level and as the SVM classifier on the base of the modified PSO algorithm at the second level. The results of experimental studies confirm the efficiency of the offered approaches for Big Data classification.","authors":["Liliya Demidova","Evgeny V. Nikulchev","Yulia Sokolova"],"meta":["May 2016International Journal of Advanced Computer Science and Applications 9(5)","DOI:10.14569/IJACSA.2016.070541"],"references":["299434117_Development_of_the_SVM_classifier_ensemble_for_the_classification_accuracy_increase","292964445_Modification_of_Particle_Swarm_Algorithm_for_the_Problem_of_the_SVM_Classifier_Development","292964291_Training_Set_Forming_for_SVM_Algorithm_with_Use_of_the_Fuzzy_Clustering_Algorithms_Ensemble_on_Base_of_Cluster_Tags_Vectors_Similarity_Matrices","292540027_The_SVM_Classifier_based_On_The_Modified_Particle_Swarm_Optimization","327515347_Particle_Swarm_Optimisation_Classical_and_Quantum_Perspectives","316475649_Application_of_Parallel_Particle_Swarm_Optimize_Support_Vector_Machine_Model_Based_on_Hadoop_Framework_in_the_Analysis_of_Railway_Passenger_Flow_Data_in_China","309106034_Particle_Swarm_Optimization","299673049_Support_Vector_Machines_on_Large_Data_Sets_Simple_Parallel_Approaches","299399244_A_Map_Reduce_based_Support_Vector_Machine_for_Big_Data_Classification","287303068_Bio-inspired_credit_risk_analysis_Computational_intelligence_with_support_vector_machines"]}