{"id":"303479107_A_unified_approach_for_Gathering_and_Exclusive_Searching_on_rings_under_weak_assumptions","abstract":"Consider a set of mobile robots placed on distinct nodes of a discrete, anonymous, and bidirectional ring. Asynchronously, each robot takes a snapshot of the ring, determining the size of the ring and which nodes are either occupied by robots or empty. Based on the observed configuration, it decides whether to move to one of its adjacent nodes or not. In the first case, it performs the computed move, eventually. This model of computation is known as Look-Compute-Move. The computation depends on the required task. In this paper, we solve both the well-known Gathering and Exclusive Searching tasks. In the former problem, all robots must simultaneously occupy the same node, eventually. In the latter problem, the aim is to clear all edges of the graph. An edge is cleared if it is traversed by a robot or if both its endpoints are occupied. We consider the exclusive searching where it must be ensured that two robots never occupy the same node. Moreover, since the robots are oblivious, the clearing is perpetual, i.e., the ring is cleared infinitely often. In the literature, most contributions are restricted to a subset of initial configurations. Here, we design two different algorithms and provide a characterization of the initial configurations that permit the resolution of the problems under very weak assumptions. More precisely, we provide a full characterization (except for few pathological cases) of the initial configurations for which gathering can be solved. The algorithm relies on the necessary assumption of the local-weak multiplicity detection. This means that during the Look phase a robot detects also whether the node it occupies is occupied by other robots, without acquiring the exact number. For the exclusive searching, we characterize all (except for few pathological cases) aperiodic configurations from which the problem is feasible. We also provide some impossibility results for the case of periodic configurations.","authors":["Gianlorenzo D’Angelo","Alfredo Navarra","Nicolas Nisse"],"meta":["February 2017Distributed Computing 30(1)","DOI:10.1007/s00446-016-0274-y"],"references":["271737803_Computing_on_Rings_by_Oblivious_Robots_A_Unified_Approach_for_Different_Tasks","315115248_Exclusive_Graph_Searching","308383584_Gathering_of_oblivious_robots_on_infinite_grids_with_minimum_traveled_distance","304022567_About_Ungatherability_of_Oblivious_and_Asynchronous_Robots_on_Anonymous_Rings","303912038_Gathering_Despite_Mischief","286485398_Gathering_and_Exclusive_Searching_on_Rings_under_Minimal_Assumptions","281885351_Gathering_Asynchronous_and_Oblivious_Robots_on_Basic_Graph_Topologies_Under_the_Look-Compute-Move_Model","279264101_Robot_Searching_and_Gathering_on_Rings_under_Minimal_Assumptions","274281447_Distributed_Computing_by_Oblivious_Mobile_Robots","271629959_Gathering_on_rings_under_the_Look-Compute-Move_model","267482656_Exclusive_Graph_Searching","268243721_Instantaneous_actions_vs_full_asynchronicity_Controlling_and_coordinating_a_set_of_autonomous_mobile_robots","265884676_Distributed_Computing_by_Mobile_Robots_Gathering","263737260_Gathering_of_robots_on_anonymous_grids_and_trees_without_multiplicity_detection","261861106_How_to_Gather_Asynchronous_Oblivious_Robots_on_Anonymous_Rings"]}