{"id":"303478662_Weighting_order_and_disorder_on_complexity_measures","abstract":"The initial ideas regarding measuring complexity appeared in computer science, with the concept of computational algorithms. As a consequence, the equivalence between algorithm complexity and informational entropy was shown. Attempting to connect these abstract formalisms to natural phenomena, described by Thermodynamics, the maximum disorder of a system would correspond to maximum complexity, a fact incoherent with the intuitive ideas of natural complexity. Considering that natural complexity resides in the half path between order and disorder, López-Ruiz, Mancini and Calbet proposed a definition for complexity, which is referred as LMC measure. Shiner, Davison and Landsberg, by slightly changing the definition of LMC, proposed the SDL measure. However, there are some situations where complexity is more associated to order than to disorder and vice-versa. Here, a computational study concerning weighting order and disorder in LMC and SDL measures is presented, by using a binomial probability distribution as reference, showing the qualitative equivalence between them and how the weight changes complexity.","authors":["J.R.C. Piqueira"],"meta":["May 2016Journal of Taibah University for Science 11(2)","DOI:10.1016/j.jtusci.2016.05.003","Project: Bifurcations in PLL networks"],"references":["283432583_A_comparison_of_LMC_and_SDL_complexity_measures_on_binomial_distributions","265530942_Disorder_and_complexity_measures_for_the_stability_of_the_daily_solar_radiative_regime","255981009_Information_and_Self-Organization","247338816_Complexity_in_Plant_Communities_the_Notion_and_Quantification","245729413_Complex_Systems_Chaos_and_Beyond_A_Constructive_Approach_with_Applications_in_Life_Sciences","242665615_Three_approaches_to_the_definition_of_the_concept_'quantity_of_information","235726179_Basic_Probability_Theory","231091081_Self-Organization_and_Information","229118092_Measuring_complexity_in_three-trophic_level_systems","224043975_Self-Organization_in_Nonequilibrium_Systems"]}