{"id":"303430512_Gamification_in_E-Learning_Introducing_Gamified_Design_Elements_into_E-Learning_Systems","abstract":"Gamification is the usage of game mechanics, dynamics, aesthetics and game thinking in non-game systems. Its main objective is to increase user's motivation, experience and engagement. For the same reason, it has started to penetrate in e-learning systems. However, when using gamified design elements in e-learning, we must consider various types of learners. In the phases of analysis and design of such elements, the cooperation of education, technology, pedagogy, design and finance experts is required. This paper discusses the development phases of introducing gamification into e-learning systems, various gamification design elements and their suitability for usage in e-learning systems. Several gamified design elements are found suited for e-learning (including points, badges, trophies, customization, leader boards, levels, progress tracking, challenges, feedback, social engagement loops and the freedom to fail). Advices for the usage of each of those elements in e-learning systems are also provided in this study. Based on those advises and the identified phases of introducing gamification info e-learning systems, we conducted an experimental study to investigate the effectiveness of gamification of an informatics online course. Results showed that students enrolled in the gamified version of the online module achieved greater learning success. Positive results encourage us to investigate the gamification of online learning content for other topics and courses. We also encourage more research on the influence of specific gamified design elements on learner's motivation and engagement.","authors":["Daniel Strmečki","Andrija Bernik","Danijel Radosevic"],"meta":["December 2015Journal of Computer Science 11(12):1108-1117","DOI:10.3844/jcssp.2015.1108.1117","Project: Gamification"],"references":["282599647_The_Model_for_Introduction_of_Gamification_into_E-learning_in_Higher_Education","266853048_Play_As_You_Learn_Gamification_as_a_Technique_for_Motivating_Learners","265789392_Gamification_for_Engaging_Computer_Science_Students_in_Learning_Activities_A_Case_Study","265386636_Didactics_20_A_Pedagogical_Analysis_of_Gamification_Theory_from_a_Comparative_Perspective_with_a_Special_View_to_the_Components_of_Learning","316807278_Intrinsic_Motivation_and_Self-Determination_in_Human_Behavior","312009381_Universal_design_for_learning","301411666_Gamification_framework_model_based_on_social_engagement_in_e-learning_20","277131377_Gameful_Approaches_for_Computer_Science_Education_From_Gamification_to_Alternate_Reality_Games","273947281_The_gamification_of_learning_and_instruction_Game-based_methods_and_strategies_for_training_and_education_San_Francisco_CA_Pfeiffer","265877898_Raising_engagement_in_e-learning_through_gamification"]}