{"id":"303423941_Robust_Multilingual_Named_Entity_Recognition_with_Shallow_Semi-Supervised_Features","abstract":"We present a multilingual Named Entity Recognition approach based on a robust and general set of features across languages and datasets. Our system combines shallow local information with clustering semi-supervised features induced on large amounts of unlabeled text. Understanding via empirical experimentation how to effectively combine various types of clustering features allows us to seamlessly export our system to other datasets and languages. The result is a simple but highly competitive system which obtains state of the art results across five languages and twelve datasets. The results are reported on standard shared task evaluation data such as CoNLL for English, Spanish and Dutch. Furthermore, and despite the lack of linguistically motivated features, we also report best results for languages such as Basque and German. In addition, we demonstrate that our method also obtains very competitive results even when the amount of supervised data is cut by half, alleviating the dependency on manually annotated data. Finally, the results show that our emphasis on clustering features is crucial to develop robust out-of-domain models. The system and models are freely available to facilitate its use and guarantee the reproducibility of results.","authors":["Rodrigo Agerri","German Rigau"],"meta":["May 2016Artificial Intelligence 238:63-82","DOI:10.1016/j.artint.2016.05.003"],"references":["301446182_SemEval-2015_Task_4_TimeLine_Cross-Document_Event_Ordering","285730671_Semantic_relations_between_events_and_their_time_locations_and_participants_for_event_coreference_resolution","271630264_Fine-grained_Dutch_named_entity_recognition","267689896_Evaluating_DBpedia_Spotlight_for_the_TAC-KBP_Entity_Linking_Task","305622270_Sentiment_Analysis_and_Opinion_Mining","284833060_SemEval-2014_Task_4_Aspect_Based_Sentiment_Analysis","278670441_Moses","272685898_MUC-7_Information_Extraction_Task_Definition","270878060_Name-aware_Machine_Translation","269762971_Sentiment_Analysis_and_Opinion_Mining"]}