{"id":"303409114_Interactive_3D_object_recognition_pipeline_on_mobile_GPGPU_computing_platforms_using_low-cost_RGB-D_sensors","abstract":"In this work, we propose the implementation of a 3D object recognition system which will be optimized to operate under demanding time constraints. The system must be robust so that objects can be recognized properly in poor light conditions and cluttered scenes with significant levels of occlusion.\n\nAn important requirement must be met: the system must exhibit a reasonable performance running on a low power consumption mobile GPU computing platform (NVIDIA Jetson TK1) so that it can be integrated in mobile robotics systems, ambient intelligence or ambient assisted living applications. The acquisition system is based on the use of color and depth (RGB-D) data streams provided by low-cost 3D sensors like Microsoft Kinect or PrimeSense Carmine.\n\nThe resulting system is able to recognize objects in a scene in less than 7 seconds, offering an interactive frame rate and thus allowing its deployment on a mobile robotic platform. Because of that, the system has many possible applications, ranging from mobile robot navigation and semantic scene labeling to human-computer interaction (HCI) systems based on visual information.","authors":["Alberto Garcia-Garcia","Sergio Orts","José García Rodríguez","Miguel Cazorla"],"meta":["March 2018Journal of Real-Time Image Processing Accepted(3)","DOI:10.1007/s11554-016-0607-x","Project: SIRMAVED: Desarrollo de un sistema integral robótico de monitorización e interacción para personas con daño cerebral adquirido y dependientes."],"references":["261324406_3D_Object_Recognition_in_Cluttered_Scenes_with_Local_Surface_Features_A_Survey","329645598_2D_Object_Detection_and_Recognition_Models_Algorithms_and_Networks","313730987_Method_for_registration_of_3D_shapes","306548793_Efficient_organized_point_cloud_segmentation_with_connected_components","281884868_Towards_true_3D_object_recognition","277496495_Three-dimensional_object_recognition","266378625_Scalable_Nearest_Neighbor_Algorithms_for_High_Dimensional_Data","262168085_Object_modeling_by_registration_of_multiple_range_images","261861965_A_Global_Hypotheses_Verification_Method_for_3D_Object_Recognition","260710306_Tutorial_Point_Cloud_Library_Three-Dimensional_Object_Recognition_and_6_DOF_Pose_Estimation"]}