{"id":"303471272_Microstructure_Informed_Tractography_Pitfalls_and_Open_Challenges","abstract":"One of the major limitations of diffusion MRI tractography is that the fiber tracts recovered by existing algorithms are not truly quantitative. Local techniques for estimating more quantitative features of the tissue microstructure exist, but their combination with tractography has always been considered intractable. Recent advances in local and global modeling made it possible to fill this gap and a number of promising techniques for microstructure informed tractography have been suggested, opening new and exciting perspectives for the quantification of brain connectivity. The ease-of-use of the proposed solutions made it very attractive for researchers to include such advanced methods in their analyses; however, this apparent simplicity should not hide some critical open questions raised by the complexity of these very high-dimensional problems, otherwise some fundamental issues may be pushed into the background. The aim of this article is to raise awareness in the diffusion MRI community, notably researchers working on brain connectivity, about some potential pitfalls and modeling choices that make the interpretation of the outcomes from these novel techniques rather cumbersome. Through a series of experiments on synthetic and real data, we illustrate practical situations where erroneous and severely biased conclusions may be drawn about the connectivity if these pitfalls are overlooked, like the presence of partial/missing/duplicate fibers or the critical importance of the diffusion model adopted. Microstructure informed tractography is a young but very promising technology, and by acknowledging its current limitations as done in this paper, we hope our observations will trigger further research in this direction and new ideas for truly quantitative and biologically meaningful analyses of the connectivity.","authors":["Alessandro Daducci","Alessandro Dal Palú","Maxime Descoteaux","Jean-Philippe Thiran"],"meta":["May 2016Frontiers in Neuroscience 10(8):247","DOI:10.3389/fnins.2016.00247"],"references":["280835881_Global_tractography_of_multi-shell_diffusion-weighted_imaging_data_using_a_multi-tissue_model","280587327_AxTract_Microstructure-Driven_Tractography_Based_on_the_Ensemble_Average_Propagator","268724245_Global_Tractography_with_Embedded_Anatomical_Priors_for_Quantitative_Connectivity_Analysis","267810257_Anatomical_accuracy_of_brain_connections_derived_from_diffusion_MRI_tractography_is_inherently_limited","265418847_Evaluation_and_statistical_inference_for_human_connectomes","283294091_Measuring_macroscopic_brain_connections_in_vivo","280006580_SIFT2_Enabling_dense_quantitative_assessment_of_brain_white_matter_connectivity_using_streamlines_tractography","269634058_Robust_Uncertainty_Principles_Exact_Signal_Frequency_Information","266975324_MesoFT_Unifying_Diffusion_Modelling_and_Fiber_Tracking","266794685_Accelerated_Microstructure_Imaging_via_Convex_Optimization_AMICO_from_diffusion_MRI_data"]}