{"id":"303464618_Using_avatars_to_tailor_ideation_process_to_innovation_strategy","abstract":"To face innovation challenges of the twenty-first century, companies should learn from proven successful strategies and draw on technological evolutions as well. Our proposal consists in aligning ideation to innovation strategies through the use of avatars in a virtual world. On the basis of the Persona method and the Proteus effect, we design avatars’ appearance so as to implement a Need-seeker or a Technology-driver innovation strategy. To test the effectiveness of this avatar-mediated innovation tool, we conducted an experiment in a French company. Two groups of highly qualified employees from the innovation department had to find applications for smart windows in public transportation. Both groups experienced immersion in a virtual transportation situation: one group embodied avatars resembling Inventors, whereas the other group embodied Personas representing users of public transportation. As expected, avatars’ appearance proved to influence the creative production: the Inventor condition led to a techno-centered ideation profile, oriented toward technological solutions, while the Persona condition led to more user-centered, needs-oriented ideas. Consistently, Inventors’ production tended to be better evaluated through industrial criteria and Personas’ production tended to be better evaluated by transportation users. We discuss the use of avatar-mediated creativity as a strategic tool for companies seeking to innovate.","authors":["Stéphanie Buisine","Jérôme Guegan","Jessy Barré","Frederic Segonds"],"meta":["August 2016Cognition Technology and Work 18(3)","DOI:10.1007/s10111-016-0378-y","Project: CREATIVENESS (LCPI GROUP)"],"references":["277682193_Self-Perception_Theory","270140677_Generating_prospective_scenarios_of_use_in_innovation_projects","264706644_The_Priming_Effects_of_Virtual_Environments_on_Interpersonal_Perceptions_and_Behaviors","262494338_La_methode_des_personas_principes_interets_et_limites","329653050_Democratizing_Innovation","305175411_Enhancing_Collective_Creative_Design_An_Exploratory_Study_on_the_Influence_of_Static_and_Dynamic_Personas_in_a_Virtual_Environment","298724400_Avatar-mediated_creativity_When_embodying_inventors_makes_engineers_more_creative","285647303_The_effects_of_personas_on_creative_codesign_of_work_equipment_an_exploratory_study_in_a_real_setting","284978438_Self-perception","278653133_Virtual_Personas_A_Case_Study_on_Truck_Cabin_Design"]}