{"id":"303497515_Efficient_Tree_Construction_for_Multiscale_Image_Representation_and_Processing","abstract":"With the continuous growth of sensor performances, image analysis and processing algorithms have to cope with larger and larger data volumes. Besides, the informative components of an image might not be the pixels themselves, but rather the objects they belong to. This has led to a wide range of successful multiscale techniques in image analysis and computer vision. Hierarchical representations are thus of first importance, and require efficient algorithms to be computed in order to address real-life applications. Among these hierarchical models, we focus on morphological trees (e.g., min/max-tree, tree of shape, binary partition tree, α-tree) that come with interesting properties and already led to appropriate techniques for image processing and analysis, with a growing interest from the image processing community. More precisely, we build upon two recent algorithms for efficient α-tree computation and introduce several improvements to achieve higher performance. We also discuss the impact of the data structure underlying the tree representation, and provide for the sake of illustration several applications where efficient multiscale image representation leads to fast but accurate techniques, e.g., in remote sensing image analysis or video segmentation.","authors":["Jiří Havel","François Merciol","Sébastien Lefèvre"],"meta":["August 2019Journal of Real-Time Image Processing 16(3)","DOI:10.1007/s11554-016-0604-0"],"references":["320822345_Hyperspectral_image_classification_from_multiscale_description_with_constrained_connectivity_and_metric_learning","317083797_Hamming_Embedding_and_Weak_Geometric_Consistency_for_Large_Scale_Image_Search","281886168_Hyperspectral_image_representation_through_alpha-trees","281328944_Hierarchical_Image_Representation_Simplification_Driven_by_Region_Complexity","278798234_Hyperspectral_image_classification_from_multiscale_description_with_constrained_connectivity_and_metric_learning","272643503_Interactive_Segmentation_Based_on_Component-trees","319770255_Hamming_embedding_and_weak_geometric_consistency_for_large_scale_image_search","292739269_The_DGPF-test_on_digital_airborne_camera_evaluation-overview_and_test_design","287388331_VabCut_A_video_extension_of_GrabCut_for_unsupervised_video_foreground_object_segmentation","269076739_Anamorphoses_and_function_lattices"]}