{"id":"303479231_'Hypernudge'_Big_Data_as_a_mode_of_regulation_by_design","abstract":"This paper draws on regulatory governance scholarship to argue that the analytic phenomenon currently known as ‘Big Data’ can be understood as a mode of ‘design-based’ regulation. Although Big Data decision-making technologies can take the form of automated decision-making systems, this paper focuses on algorithmic decision-guidance techniques. By highlighting correlations between data items that would not otherwise be observable, these techniques are being used to shape the informational choice context in which individual decision-making occurs, with the aim of channelling attention and decision-making in directions preferred by the ‘choice architect’. By relying upon the use of ‘nudge’ – a particular form of choice architecture that alters people’s behaviour in a predictable way without forbidding any options or significantly changing their economic incentives, these techniques constitute a ‘soft’ form of design-based control. But, unlike the static Nudges popularised by Thaler and Sunstein [(2008). Nudge. London: Penguin Books] such as placing the salad in front of the lasagne to encourage healthy eating, Big Data analytic nudges are extremely powerful and potent due to their networked, continuously updated, dynamic and pervasive nature (hence ‘hypernudge’). I adopt a liberal, rights-based critique of these techniques, contrasting liberal theoretical accounts with selective insights from science and technology studies (STS) and surveillance studies on the other. I argue that concerns about the legitimacy of these techniques are not satisfactorily resolved through reliance on individual notice and consent, touching upon the troubling implications for democracy and human flourishing if Big Data analytic techniques driven by commercial self-interest continue their onward march unchecked by effective and legitimate constraints.","authors":["Karen Yeung"],"meta":["May 2016Information Communication and Society 20(1):1-19","DOI:10.1080/1369118X.2016.1186713"],"references":["292327114_Two_Cheers_for_Corporate_Experimentation_The_AB_Illusion_and_the_Virtues_of_Data-Driven_Innovation","346624964_The_Black_Box_Society_The_Secret_Algorithms_That_Control_Money_and_Information","345259684_The_Moral_Limits_of_the_Criminal_Law_Volume_3_Harm_to_Self","315361198_Learning_from_Regulatory_Disasters","314911875_Constructing_and_Contesting_Legitimacy_and_Accountability_in_Polycentric_Regulatory_Regimes","314469713_Interview_on_the_Black_Box_Society","313788959_Of_Men_and_Mice_Should_the_EU_Data_Protection_Authorities'_Reaction_to_Google's_New_Privacy_Policy_Raise_Concern_for_the_Future_of_the_Purpose_Limitation_Principle","313539272_Pricing_Services_Online_Economics_of","313306037_Two_Concepts_of_Liberty","303625055_The_Forms_and_Limits_of_Choice_Architecture"]}