{"id":"303448829_Inductive_Bias_of_Deep_Convolutional_Networks_through_Pooling_Geometry","abstract":"Our formal understanding of the inductive bias that drives the success of convolutional networks on computer vision tasks is limited. In particular, it is unclear what makes hypotheses spaces born from convolution and pooling operations so suitable for natural images. In this paper we study the ability of convolutional arithmetic circuits to model correlations among regions of their input. Correlations are formalized through the notion of separation rank, which for a given input partition, measures how far a function is from being separable. We show that a polynomially sized deep network supports exponentially high separation ranks for certain input partitions, while being limited to polynomial separation ranks for others. The network's pooling geometry effectively determines which input partitions are favored, thus serves as a means for controlling the inductive bias. Contiguous pooling windows as commonly employed in practice favor interleaved partitions over coarse ones, orienting the inductive bias towards the statistics of natural images. In addition to analyzing deep networks, we show that shallow ones support only linear separation ranks, and by this gain insight into the benefit of functions brought forth by depth - they are able to efficiently model strong correlation under favored partitions of the input.","authors":["Nadav Cohen","Amnon Shashua"],"meta":["May 2016"],"references":["322539221_Notes_on_the_number_of_linear_regions_of_deep_neural_networks","305196650_Going_deeper_with_convolutions","301841654_Learning_Real_and_Boolean_Functions_When_Is_Deep_Better_Than_Shallow","281895600_On_the_Expressive_Power_of_Deep_Learning_A_Tensor_Analysis","281285245_The_Zero_Set_of_a_Polynomial","319769990_I-theory_on_depth_vs_width_hierarchical_function_composition","311609041_Deep_Residual_Learning_for_Image_Recognition","287250773_The_Power_of_Depth_for_Feedforward_Neural_Networks","286512696_Deep_Residual_Learning_for_Image_Recognition","282403870_Representation_Benefits_of_Deep_Feedforward_Networks"]}