{"id":"303406320_Robotics_for_All_Ages_A_Standard_Robotics_Curriculum_for_K-16","abstract":"The introduction of robotics in science, technology, engineering, and math (STEM) education is quickly becoming a very polarizing topic. As a discipline, robotics research is tackling new and challenging problems that resonate with public perception and also provide exciting and fun opportunities to see science in action. The exposure of students at various levels to robotics is controversial since many view it as a fad, and others rightly indicate that there is still a need for coherent analysis of robotics in the classroom to assess the impact on education and engagement. In this work, we argue that for robotics to be effectively incorporated into the educational pipeline, there is a need for a comprehensive robotics curriculum. Such a curriculum should be designed to be intentionally flexible; however, its development would enable principled study in a variety of learning environments and over the long term. We propose the nature of the standard curriculum and present recommendations on how it can be practically applied. Our aim in the long term is to provide resources that will elevate robotics education. The existence of these resources will advance the current level of understanding from anecdotal and short-lived inquiry so that robotics education can be evidence-based and sustainable.","authors":["Carlotta Berry","Sekou L Remy","Tamara Elaine Rogers"],"meta":["May 2016IEEE Robotics & Automation Magazine 23(2):1-1","DOI:10.1109/MRA.2016.2534240","Project: mobile robotics education, human-robot interfaces"],"references":["307833614_History_and_educational_potential_of_LEGO_Mindstorms_NXT","290953860_Effective_practices_in_robotics_education","226696409_Children_robotics_and_education","4077094_Formal_measures_of_learning_in_a_secondary_school_mobile_robotics_course","289737418_Enriching_K-12_science_and_mathematics_education_using_LEGOs","288451323_Educating_Generation_'Y'_in_robotics","283895348_RoboCupJunior_for_promoting_STEM_education_21st_century_skills_and_technological_advancement_through_robotics_competition","228858659_Robotics_education_for_all_ages","3978435_Meeting_educational_objectives_and_outcomes_through_robotics_education","3344594_Competing_for_a_robotics_education"]}