{"id":"303555631_Vision-based_haptic_feedback_for_capsule_endoscopy_navigation_a_proof_of_concept","abstract":"In this paper, a vision-based haptic feedback system has been proposed with the aim to assist the movement of an endoscopic device during capsule endoscopy (CE) procedures. We present a general system architecture consisting of three modules responsible for vision, haptic guidance and control of movements. The vision module generates 3D local maps as well as local navigation trajectory for endoluminal navigation. The haptic guidance module consists of a haptic device that allows the user to control the movement of the capsule along the generated path. The haptics module also helps the operator by transforming the 3D maps and the relative paths into a guiding virtual force. Measuring the current relative distance between the user input and the maps boundaries, the haptic guidance module will check if the user is moving away or toward the colonic walls and will generate a feedback force with the aim to assist the operator during the navigation procedure. The user will also sense an attractive virtual feedback force toward the generated path that will help the user in the navigation. Finally, the movement control module is the interface between the haptics module and the chosen manipulator. The final goal is to develop a complete active CE robotic platform with haptic feedback in order to enhance safety, to reduce cost (using the same system as a training simulator as well as real endoscopic platform) and to help the operator during the navigation by combining all 3D local maps into a full 3D reconstructed colon.","authors":["Marco Mura","Yasmeen Kheil","Gastone Ciuti","Marco Visentini-Scarzanella"],"meta":["June 2016Journal of Micro-Bio Robotics 11(1)","DOI:10.1007/s12213-016-0090-2"],"references":["320405093_Modeling_and_Operating_Robotic_Environments_Using_GazeboROS","282777027_Intuitive_Control_of_Self-Propelled_Microjets_with_Haptic_Feedback","281146579_Magnetically_driven_medical_devices_A_review","280832038_Electromagnetic_Control_System_for_Capsule_Navigation_Novel_Concept_for_Magnetic_Capsule_Maneuvering_and_Preliminary_Study","280490754_Vision_and_Inertial-Based_Image_Mapping_for_Capsule_Endoscopy","279888689_Optimal_RANSAC-Towards_a_Repeatable_Algorithm_for_Finding_the_Optimal_Set","274071779_A_New_Concept_for_Magnetic_Capsule_Colonoscopy_Based_on_an_Electromagnetic_System","271823237_ORB-SLAM_a_versatile_and_accurate_monocular_SLAM_system","308855101_Large-scale_direct_SLAM_with_stereo_cameras","303138182_ROS_An_open-source_Robot_Operating_System"]}