{"id":"303545443_Influence_Activation_Model_A_New_Perspective_in_Social_Influence_Analysis_and_Social_Network_Evolution","abstract":"What drives the propensity for the social network dynamics? Social influence is believed to drive both off-line and on-line human behavior, however it has not been considered as a driver of social network evolution. Our analysis suggest that, while the network structure affects the spread of influence in social networks, the network is in turn shaped by social influence activity (i.e., the process of social influence wherein one person's attitudes and behaviors affect another's). To that end, we develop a novel model of network evolution where the dynamics of network follow the mechanism of influence propagation, which are not captured by the existing network evolution models. Our experiments confirm the predictions of our model and demonstrate the important role that social influence can play in the process of network evolution. As well exploring the reason of social network evolution, different genres of social influence have been spotted having different effects on the network dynamics. These findings and methods are essential to both our understanding of the mechanisms that drive network evolution and our knowledge of the role of social influence in shaping the network structure.","authors":["Yang Yang","Nitesh V Chawla","Ryan N. Lichtenwalter","Dong Yuxiao"],"meta":["May 2016"],"references":["257553299_Scalable_influence_maximization_for_independent_cascade_model_in_large-scale_social_networks","255716248_Social_Influence_Bias_A_Randomized_Experiment","254008836_Vertex_collocation_profiles_Subgraph_counting_for_link_analysis_and_prediction","235712376_The_Role_of_Information_Diffusion_in_the_Evolution_of_Social_Networks","230841621_Popularity_versus_Similarity_in_Growing_Networks","283617653_Emergence_of_Scaling_in_Random_Networks","278258708_Link_Prediction_Fair_and_Effective_Evaluation","262154866_Social_influence_locality_for_modeling_retweeting_behaviors","246106899_Eva_Tardos_Maximizing_the_spread_of_influence_through_a_social_network","232519899_Transitivity_in_Structural_Models_of_Small_Groups"]}