{"id":"303540711_Phonation_types_in_Marathi_An_acoustic_investigation","abstract":"This dissertation presents a comprehensive instrumental acoustic analysis of phonation type distinctions in Marathi, an Indic language with numerous breathy voiced sonorants and obstruents. Important new facts about breathy voiced sonorants, which are crosslinguistically rare, are established: male and female speakers cue breathy phonation in sonorants differently, there are an abundance of trading relations, and--critically--phonation type distinctions are not cued as well by sonorants as by obstruents. Ten native speakers (five male, five female) were recorded producing Marathi words embedded in a carrier sentence. Tokens included plain and breathy voiced stops, affricates, nasals, laterals, rhotics, and approximants before the vowels [a] and [e]. Measures reported for consonants and subsequent vowels include duration, F0, Cepstral Peak Prominence (CPP), and corrected H1-H2*, H1-A1*, H1-A2*, and H1-A3* values. As expected, breathy voice is associated with decreased CPP and increased spectral values. A strong gender difference is revealed: low-frequency measures like H1-H2* cue breathy phonation more reliably in male speech, while CPP--which provides information about the aspiration noise included in the signal--is a more reliable cue in female speech. Trading relations are also reported: time and again, where one cue is weak or absent another cue is strong or present, underscoring the importance of including both genders and multiple vowel contexts when testing phonation type differences. Overall, the cues that are present for obstruents are not necessarily mirrored by sonorants. These findings are interpreted with reference to Dispersion Theory (Flemming 1995; Liljencrants & Lindblom 1972; Lindblom 1986, 1990). While various incarnations of Dispersion Theory focus on different aspects of perceptual and auditory distinctiveness, a basic claim is that one requirement for phonological contrasts is that they must be perceptually distinct: contrasts that are subject to great confusability are phonologically disfavored. The proposal, then, is that the typology of breathy voiced sonorants is due in part to the fact that they are not well differentiated acoustically. Breathy voiced sonorants are crosslinguistically rare because they do not make for strong phonemic contrasts.","authors":["Kelly Berkson"],"meta":["May 2013","Thesis for: PhDAdvisor: Allard Jongman, Jie Zhang","Project: Breathy Sonorants in Marathi"],"references":["349552543_From_Speech_Physiology_to_Linguistic_Phonetics","307466235_Sonorancy_and_geminacy","285454331_Speaker_variation_and_phonation_type_in_Tsonga_nasals","285330937_Glottal_source_and_excitation_analysis","284879078_Nasalization_aspiration_and_murmur_in_Gujarati","284757447_Voice_source_variation","284071309_Phonetic_analysis_of_breathy_murmured_vowels_in_Gujarati","279938255_Phonetic_Structures_in_Jalapa_Mazatec","270178735_The_Indo-Aryan_Languages","268201093_The_Phonetics_and_Phonology_of_Glottal_Manner_Features","261666875_Consonants_in_ChanganaTsonga","259803043_The_phonetics_of_contrastive_phonation_in_Gujarati","259410785_The_acoustic_consequences_of_phonation_and_tone_interactions_in_Jalapa_Mazatec","259810925_Analyzing_Linguistic_Data_A_Practical_Introduction_to_Statistics_Using_R","256935568_The_first_and_second_harmonics_should_not_be_used_to_measure_breathiness_in_male_and_female_voices"]}