{"id":"303545807_Emergent_a_novel_data-set_for_stance_classification","abstract":"We present Emergent, a novel dataset derived from a digital journalism project for rumour debunking. The dataset contains 300 rumoured claims and 2,595 associated news articles, collected and labelled by journalists with an estimation of their veracity (true, false or unverified). Each associated article is summarized into a headline and labelled to indicate whether its stance is for, against, or observing the claim, where observing indicates that the article merely repeats the claim. Thus, Emergent provides a real-world data source for a variety of natural language processing tasks in the context of fact-checking. Further to presenting the dataset, we address the task of determining the article headline stance with respect to the claim. For this purpose we use a logistic regression classifier and develop features that examine the headline and its agreement with the claim. The accuracy achieved was 73% which is 26% higher than the one achieved by the Excitement Open Platform (Magnini et al., 2014).","authors":["William Ferreira","Andreas Vlachos"],"meta":["March 2016","DOI:10.18653/v1/N16-1138","Conference: The 15th Annual Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies"],"references":["301800740_Detecting_Check-worthy_Factual_Claims_in_Presidential_Debates","301446051_Identification_and_Verification_of_Simple_Claims_about_Statistical_Properties","301405022_Fact_Checking_Task_definition_and_dataset_construction","282778248_Real-time_Rumor_Debunking_on_Twitter","319770439_Efficient_Estimation_of_Word_Representations_in_Vector_Space","305067383_Enquiring_Minds_Early_Detection_of_Rumors_in_Social_Media_from_Enquiry_Posts","301446053_Classifying_Tweet_Level_Judgements_of_Rumours_in_Social_Media","301404379_PPDB_20_Better_paraphrase_ranking_fine-grained_entailment_relations_word_embeddings_and_style_classification","284046320_Algorithm_for_The_Assignment_and_Transportation_Problems","281227635_A_large_annotated_corpus_for_learning_natural_language_inference"]}