{"id":"303589833_Environmentally_friendly_practices_of_oil_palm_cultivators","abstract":"Since the 1960s, Federal Land Development Authority (FELDA) has been focused on cultivator’s development in the rural vicinity in Malaysia. However, recent study mentioned that cultivators are mostly responsible for environmental pollution, deforestation, bureaucratic barriers, etc., whereas it directly affects the community as well as the Gross National Income. The study is to measure mainly the environmental awareness and friendly practices among the cultivators. It has been collected through questionnaire survey and interviews on 50 smallholders from FELDA Pahang State in Malaysia. To analyze and draw the inferences of primary data, this study uses the descriptive statistics, spider diagram to test the hypothesis. The result indicates that the summit of the supported smallholders has zero and negative knowledge and consciousness towards environment consistent at that location that is in keeping with best agricultural practices where as other schemes were not scrutinized in the study.","authors":["Halima Begum","Siwar Chamhuri","Ah Choy Er","A S A Ferdous Alam"],"meta":["March 2016International Journal of ADVANCED AND APPLIED SCIENCES 3(2):15‐19","Project: Title: Environmental Sustainability of oil palm cultivation and palm oil milling in Malaysia; Project Code: EP-2014-0014"],"references":["309187240_Sustainability_of_Oil_Palm_Settler's","289249371_Smallholder's_Practices_towards_Environment_Sustainability","286454977_Economic_Sustainability_of_Oil_Palm_Cultivations_Smallholders_Perspective","286279157_Oil_Palm_Smallholders_and_Its_Sustainability_Practices_in_Malaysia","283806624_Smallholder's_Practices_Towards_Environment_Sustainability","281275048_Malaysian_oil_palm_industry_Prospect_and_problem","330162252_Evaluating_methodology_in_international_studies","265520261_Swimming_Upstream_Local_Indonesian_Production_Networks_in_Globalized_Palm_Oil_Production","254249267_'Forum_on_Global_Land_Grabbing_Challenges_Posed_by_the_New_Wave_of_Farmland_Investment'","229319063_Strategic_research_education_and_policy_goals_for_seed_science_and_crop_improvement"]}