{"id":"303515566_Improvements_in_the_StArt_tool_to_better_support_the_systematic_review_process","abstract":"Context: Systematic Review (SR) is a methodology used to find and aggregate relevant existing evidence about a specific research topic of interest. It can be very time-consuming depending on the number of gathered studies that need to be analyzed by researchers. One of the relevant tools found in the literature and preliminarily evaluated by researchers of SRs is StArt, which supports the whole SR process. It has been downloaded by users from more than twenty countries. Objective: To present new features available in StArt to support SR activities. Method: Based on users' feedback and the literature, new features were implemented and are available in the tool, like the SCAS strategy, snowballing techniques, the frequency of keywords and a word cloud for search string refining, collaboration among reviewers, and the StArt online community. Results: The new features, according to users' positive feedback, make the tool more robust to support the conduct of SRs. Conclusion: StArt is a tool that has been continuously developed such that new features are often available to improve the support for the SR process. The StArt online community can improve the interaction among users, facilitating the identification of improvements and new useful features.","authors":["Sandra Fabbri","Cleiton Silva","Elis Hernandes","Fábio Octaviano"],"meta":["June 2016","DOI:10.1145/2915970.2916013","Conference: the 20th International Conference"],"references":["302924724_Guidelines_for_performing_Systematic_Literature_Reviews_in_Software_Engineering","282942019_Semi-automatic_selection_of_primary_studies_in_systematic_literature_reviews_is_it_reasonable","266202949_Tools_to_Support_Systematic_Reviews_in_Software_Engineering_A_Feature_Analysis","261245543_Tools_to_Support_Systematic_Literature_Reviews_in_Software_Engineering_A_Mapping_Study","4083466_Evidence-based_software_engineering","275156960_Guidelines_for_conducting_systematic_mapping_studies_in_software_engineering_An_update","266658918_Guidelines_for_snowballing_in_systematic_literature_studies_and_a_replication_in_software_engineering","259137324_A_systematic_review_of_systematic_review_process_research_in_software_engineering"]}