{"id":"303506098_A_modelling_framework_for_the_study_of_Spatial_Data_Infrastructures_applied_to_coastal_management_and_planning","abstract":"The continuous development of Spatial Data Infrastructures (SDI) provides a favourable context for environmental management and planning. However, it appears that the actual contribution of SDIs should also depend on the correlation between users’ expectations and the services delivered to them. Several studies have addressed some organizational, methodological and technological aspects of the development of SDIs. However, only a few studies have, to the best of our knowledge, studied SDI use at large. This article introduces a methodological approach oriented towards the study of the relationship between SDIs and the users interacting with them as part of their professional practices. Our study is applied to coastal zone management and planning in France. This approach combines structural and data flow modelling. The former is based on Social Network Analysis (SNA) and the latter on Data Flow Diagrams (DFD). This modelling approach has been applied to an online questionnaire and semi-structured interviews. The results identify the SDIs, geographical data flows and institutional levels implied in French coastal zone management and planning.","authors":["Jade Georis-Creuseveau","Christophe Claramunt","Françoise Gourmelon"],"meta":["May 2016International Journal of Geographical Information Science 31(1):1-17","DOI:10.1080/13658816.2016.1188929"],"references":["259922042_Spatial_Education_for_Different_User_Groups_as_a_Prerequisite_for_Creating_a_Spatially_Enabled_Society_and_Leveraging_SDI","255661802_SDI_Effectiveness_from_the_User_Perspective","329279740_GIS_for_coastal_zone_management","312836360_Data_Flow_Diagram","304374264_Centrality_in_social_networks_Conceptual_clarification","300706038_Social_Network_Analysis_of_the_SDI_in_Flanders","285775770_Geographic_information_systems_and_science_3e","283617653_Emergence_of_Scaling_in_Random_Networks","253430302_Structured_Design_Fundamentals_of_a_Discipline_of_Computer_Program_and_Systems_Design","249397368_GIS_for_coastal_zone_management"]}