{"id":"303508650_Reliability_of_the_Knee_Smartphone-Application_Goniometer_in_the_Acute_Orthopedic_Setting","abstract":"The standard goniometer (SG) is the most commonly used tool to assess range of motion (ROM) in patients with knee restrictions. Several medical applications have been designed to measure joint ROM. Little data are available on their reliability in the postoperative clinical setting. The purpose of this study was to assess whether a smartphone accelerometer-based knee goniometer application (App) is as reliable as the SG to measure knee ROM in clinical settings. A total of 60 subjects were included in this cross-sectional reliability trial. Overall, 20 healthy subjects (HS) and 20 acute postoperative patients (PO) underwent three active and three passive measurements in knee flexion and extension, using the SG and the smartphone knee goniometer App. To determine the fatigability of postoperative patients, a third group of 20 patients underwent a single active measurement in knee flexion and extension (PO1). Measurements were performed by three clinicians. For intraobserver reliability, mean intraclass correlation coefficient (ICC) values were higher for the App in all circumstances (overall mean SG 0.85, App 0.91), indicating an excellent correlation. For interobserver reliability, the highest ICC scores were in the PO1 group, with the App more consistent than the SG in all movements. Interobserver reliability was lower in the PO group versus PO1. Interobserver reliability was better for active ROM than for passive measurements. The overall concordance coefficient was very good to excellent with active measurements (range, 0.60-0.97). In conclusion, the App is a reliable tool for use in acute orthopedic care and offers better intra- and interobserver correlation scores for a single active measurement.\nThieme Medical Publishers 333 Seventh Avenue, New York, NY 10001, USA.","authors":["Luís Carlos Pereira","Sylvia Rwakabayiza","Estelle Lécureux (Martin)","Brigitte Jolles"],"meta":["May 2016The Journal of Knee Surgery 30(3)","DOI:10.1055/s-0036-1584184"],"references":[]}