{"id":"303550976_Embedded_Implementation_of_VHR_Satellite_Image_Segmentation","abstract":"Processing and analysis of Very High Resolution (VHR) satellite images provide a mass of crucial information, which can be used for urban planning, security issues or environmental monitoring. However, they are computationally expensive and, thus, time consuming, while some of the applications, such as natural disaster monitoring and prevention, require high efficiency performance. Fortunately, parallel computing techniques and embedded systems have made great progress in recent years, and a series of massively parallel image processing devices, such as digital signal processors or Field Programmable Gate Arrays (FPGAs), have been made available to engineers at a very convenient price and demonstrate significant advantages in terms of running-cost, embeddability, power consumption flexibility, etc. In this work, we designed a texture region segmentation method for very high resolution satellite images by using the level set algorithm and the multi-kernel theory in a high-abstraction C environment and realize its register-transfer level implementation with the help of a new proposed high-level synthesis-based design flow. The evaluation experiments demonstrate that the proposed design can produce high quality image segmentation with a significant running-cost advantage.","authors":["Chao Li","Souleymane Balla-Arabe","Dominique Ginhac","Fan Yang"],"meta":["May 2016Sensors 16(6):771","DOI:10.3390/s16060771"],"references":["304425201_Lattice_Boltzmann_Model_for_the_Incompressible_Navier-Stokes_Equation","288686645_Moving_Object_Detection_on_a_Vehicle_Mounted_Back-Up_Camera","288040534_Embedded_multi-spectral_image_processing_for_real-time_medical_application","287202338_Smart_Capture_Modules_for_Direct_Sensor-to-FPGA_Interfaces","283266768_Hardware_Design_and_Implementation_of_a_Wavelet_De-Noising_Procedure_for_Medical_Signal_Preprocessing","282148862_Fuzzy_selecting_local_region_level_set_algorithm","281522651_Efficient_Implementation_of_a_Symbol_Timing_Estimator_for_Broadband_PLC","290767087_A_Study_on_the_Impact_of_Compiler_Optimizations_on_High-Level_Synthesis","284653608_Snakes_Active_Contour_Models","283101356_Can_high-level_synthesis_compete_against_a_hand-written_code_in_the_cryptographic_domain_A_case_study"]}