{"id":"303563287_Estimation_of_Blood_Oxygen_Content_Using_Context-Aware_Filtering","abstract":"In this paper we address the problem of estimating the blood oxygen concentration in children during surgery.Currently, the oxygen content can only be measured through invasive means such as drawing blood from the patient. In this work, we attempt to perform estimation by only using other non-invasive measurements (e.g., fraction of oxygen in inspired air, volume of inspired air) collected during surgery. Although models mapping these measurements to blood oxygen content contain multiple parameters that vary widely across patients, the non-invasive measurements can be used to provide binary information about whether the oxygen concentration is rising or dropping. This information can then be incorporated in a context-aware filter that is used to combine regular continuous measurements with discrete detection events in order to improve estimation. We evaluate the filter using real-patient data collected over the last decade at the Children’s Hospital of Philadelphia and show that it is a promising approach for the estimation of unobservable physiological variables.","authors":["Radoslav Ivanov","Nikolay Atanasov","James Weimer","Miroslav Pajic"],"meta":["April 2016","DOI:10.1109/ICCPS.2016.7479102","Conference: 2016 ACM/IEEE 7th International Conference on Cyber-Physical Systems (ICCPS)"],"references":["304233564_Robust_Estimation_Using_Context-Aware_Filtering","301463802_Semantic_Localization_Via_the_Matrix_Permanent","299401510_Prediction_of_Critical_Pulmonary_Shunts_in_Infants","288205485_Respiratory_Physiology","281487982_Parameter-Invariant_Design_of_Medical_Alarms","274263557_Negative_Information_for_Occlusion_Reasoning_in_Dynamic_Extended_Multiobject_Tracking","267847452_Learning_individual_and_population_level_traits_from_clinical_temporal_data","265426449_Statistical_Multisource-Multitarget_Information_Fusion","260658223_Fusion_of_Spatially_Referring_Natural_Language_Statements_with_Random_Set_Theoretic_Likelihoods","259298507_Bayesian_Multi-categorical_Soft_Data_Fusion_for_Human-Robot_Collaboration"]}