{"id":"303657108_TensorFlow_A_system_for_large-scale_machine_learning","abstract":"TensorFlow is a machine learning system that operates at large scale and in heterogeneous environments. TensorFlow uses dataflow graphs to represent computation, shared state, and the operations that mutate that state. It maps the nodes of a dataflow graph across many machines in a cluster, and within a machine across multiple computational devices, including multicore CPUs, general-purpose GPUs, and custom designed ASICs known as Tensor Processing Units (TPUs). This architecture gives flexibility to the application developer: whereas in previous \"parameter server\" designs the management of shared state is built into the system, TensorFlow enables developers to experiment with novel optimizations and training algorithms. TensorFlow supports a variety of applications, with particularly strong support for training and inference on deep neural networks. Several Google services use TensorFlow in production, we have released it as an open-source project, and it has become widely used for machine learning research. In this paper, we describe the TensorFlow dataflow model in contrast to existing systems, and demonstrate the compelling performance that TensorFlow achieves for several real-world applications.","authors":["Martín Abadi","Paul Barham","Jianmin Chen","Zhifeng Chen"],"meta":["May 2016"],"references":["305196650_Going_deeper_with_convolutions","319770465_Sequence_to_Sequence_Learning_with_Neural_Networks","319770439_Efficient_Estimation_of_Word_Representations_in_Vector_Space","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","319769811_Fast_Algorithms_for_Convolutional_Neural_Networks","311610318_Fast_Algorithms_for_Convolutional_Neural_Networks","311474948_LINQits_big_data_on_little_clients","308575069_Incremental_iterative_data_processing_with_timely_dataflow","307799813_Toward_accelerating_deep_learning_at_scale_using_specialized_hardware_in_the_datacenter","306209959_Project_adam_Building_an_efficient_and_scalable_deep_learning_training_system"]}