{"id":"303796966_The_Orthology_Ontology_Development_and_applications","abstract":"Background: \nComputational comparative analysis of multiple genomes provides valuable opportunities to biomedical research. In particular, orthology analysis can play a central role in comparative genomics; it guides establishing evolutionary relations among genes of organisms and allows functional inference of gene products. However, the wide variations in current orthology databases necessitate the research toward the shareability of the content that is generated by different tools and stored in different structures. Exchanging the content with other research communities requires making the meaning of the content explicit.\n\nDescription: \nThe need for a common ontology has led to the creation of the Orthology Ontology (ORTH) following the best practices in ontology construction. Here, we describe our model and major entities of the ontology that is implemented in the Web Ontology Language (OWL), followed by the assessment of the quality of the ontology and the application of the ORTH to existing orthology datasets. This shareable ontology enables the possibility to develop Linked Orthology Datasets and a meta-predictor of orthology through standardization for the representation of orthology databases. The ORTH is freely available in OWL format to all users at http://purl.org/net/orth .\n\nConclusions: \nThe Orthology Ontology can serve as a framework for the semantic standardization of orthology content and it will contribute to a better exploitation of orthology resources in biomedical research. The results demonstrate the feasibility of developing shareable datasets using this ontology. Further applications will maximize the usefulness of this ontology.","authors":["Jesualdo Tomas Fernandez-Breis","Hirokazu Chiba","María del Carmen Legaz-García","Ikuo Uchiyama"],"meta":["June 2016Journal of Biomedical Semantics 7(1)","DOI:10.1186/s13326-016-0077-x"],"references":["303823716_Towards_the_semantic_standardization_of_orthology_content","289404127_OGG_a_Biological_Ontology_for_Representing_Genes_and_Genomes_in_Specific_Organisms","285665382_OQuaRE_A_SQuaRE-based_approach_for_evaluating_the_quality_of_ontologies","275251971_Construction_of_an_Ortholog_Database_Using_the_Semantic_Web_Technology_for_Integrative_Analysis_of_Genomic_Data","268873223_OMIMorg_Online_Mendelian_Inheritance_in_Man_OMIMR_an_Online_catalog_of_human_genes_and_genetic_disorders","268450548_The_OMA_orthology_database_in_2015_Function_predictions_better_plant_support_synteny_view_and_other_improvements","268392278_MBGD_update_2015_Microbial_genome_database_for_flexible_ortholog_analysis_utilizing_a_diverse_set_of_genomic_data","289794085_Translational_research_combining_orthologous_genes_and_human_diseases_with_the_OGOLOD_dataset","285623865_OOPS_OntOlogy_Pitfall_Scanner_An_on-line_tool_for_ontology_evaluation","277473248_Online_Mendelian_Inheritance_in_Man_OMIM_a_knowledgebase_of_human_genes_and_genetic_disorders"]}