{"id":"303763663_A_combined_method_for_the_analysis_and_assessment_of_risks_and_industrial_safety","abstract":"Risk can be defined as the probability that an existing hazard could turn into an accident. It can be evaluated through the potential losses in the manufacturing process or the harmful level of accidents with an impact on human health, caused by unpredictable technical events. Romanian authorities have not found yet a nationwide method for evaluating the risks in the establishments that fall under the scope of the SEVESO Directive. Starting from the potential risk that an accident might occur in the establishments where dangerous substances are used in the processing activities, with serious consequences for both the establishments themselves and their immediate surroundings, it is necessary that a combined, complex method be found in order to consider the appropriate protective/intervention measures/actions for limiting and eliminating the consequences of potential major accidents. After the implementation of the EU legislation, in Bacau County, there were identified five operators in 2015 that fall under the scope of SEVESO II Directive as presenting major-accident risks, and six exposed to minor risks - the establishments being located nearby highly vulnerable populated areas. For these establishments, risk analyses must be done in order to prevent technological accidents and manage emergencies (accidents have already occurred at some of the establishments). The results of these analyses could be used to inform, instruct, and prepare the population to act adequately in case of accidents. These aspects led us towards the decision to study the already existing risk and industrial safety assessment methods in order to develop a new method that will meet the requirements of the Romanian establishments that use dangerous substances. This paper proposes a new risk assessment method to establish the risks associated to the use of dangerous substances in manufacturing processes. It is based on a combination of the strengths of the already existing risk assessment methods at the international level. It is aimed at determining, both quantitatively and qualitatively, the risk or safety level for the installations/technologies used in the manufacturing process, which can lead to major accidents with serious consequences for man and environment. The most common risk assessment methods currently used are: Mosar, Aramis, Checklist, Octave, and Mehari methods. By combining the strong points of these methods, this paper proposes a new risk assessment method called CARMIS/DS: Combined Analysis Risk Method and Industries Security/Dangerous Soubstances. © 2016, Gh. Asachi Technical University of Iasi. All rights reserved.","authors":["Daniel-Catalin Felegeanu","Paraschiv G.","Panainte Mirela","Mircea Horubet"],"meta":["April 2016Environmental Engineering and Management Journal 15(3):553-562","DOI:10.30638/eemj.2016.060"],"references":["304034338_Seveso_Disaster_and_the_European_Seveso_Directives"]}