{"id":"303755164_Initial_and_Eventual_Software_Quality_Relating_to_Continuous_Integration_in_GitHub","abstract":"The constant demand for new features and bug fixes are forcing software projects to shorten cycles and deliver updates ever faster, while sustaining software quality. The availability of inexpensive, virtualized, cloud-computing has helped shorten schedules, by enabling continuous integration (CI) on demand. Platforms like GitHub support CI in-the-cloud. In projects using CI, a user submitting a pull request triggers a CI step. Besides speeding up build and test, this fortuitously creates voluminous archives of build and test successes and failures. CI is a relatively new phenomenon, and these archives allow a detailed study of CI. How many problems are exposed? Where do they occur? What factors affect CI failures? Does the \"initial quality\" as ascertained by CI predict how many bugs will later appear (\"eventual quality\") in the code? In this paper, we undertake a large-scale, fine resolution study of these records, to better understand CI processes, the nature, and predictors of CI failures, and the relationship of CI failures to the eventual quality of the code. We find that: a) CI failures appear to be concentrated in a few files, just like normal bugs; b) CI failures are not very highly correlated with eventual failures; c) The use of CI in a pull request doesn't necessarily mean the code in that request is of good quality.","authors":["Yue Yu","Bogdan Vasilescu","Huaimin Wang","Vladimir Filkov"],"meta":["June 2016","Project: Continuous Integration"],"references":["291206543_Wait_for_It_Determinants_of_Pull_Request_Evaluation_Latency_on_GitHub","291187145_Quality_and_productivity_outcomes_relating_to_continuous_integration_in_GitHub","291140377_Reviewer_Recommendation_for_Pull-Requests_in_GitHub_What_Can_We_Learn_from_Code_Review_and_Bug_Assignment","281827244_Open_Source-Style_Collaborative_Development_Practices_in_Commercial_Projects_Using_GitHub","279043219_Work_Practices_and_Challenges_in_Pull-Based_Development_The_Integrator's_Perspective","276162927_An_empirical_study_of_the_impact_of_modern_code_review_practices_on_software_quality","267868165_Continuous_Integration_in_a_Social-Coding_World_Empirical_Evidence_from_GitHub","352524385_Statistics_at_Square_One","304381459_PROC_An_open-source_package_for_R_and_S_plus_to_analyze_and_compare_ROC_curves","279355975_Experimentation_in_Software_Engineering"]}