{"id":"303792583_Computational_Thinking_The_Skill_Set_of_the_21st_Century","abstract":"Computational thinking is a relatively new term, and is the topic of much discussion in the educational realm today. Research shows that computational thinking is a highly valuable skill that is becoming a topic of increasing interest among computational education researchers, as well as computer scientists. The reason for this is due to the significant benefits associated with it in terms of problem solving. This review begins with an introduction to computational thinking as a term, and gives some characteristics surrounding the skill set. We then examine the benefits and advantages of computational thinking in general, and areas in which it may be applied. We also explore the importance of computational thinking in education and teaching practice, specifically at years 1-13, and note areas in which this is currently being implemented. We also search for the use of computational thinking in Kaupapa Māori, again noting current work in this area. Finally, we make recommendations for the inclusion of computational thinking as a core topic in primary and secondary education.","authors":["Mahsa Mohaghegh","Michael Mccauley"],"meta":["June 2016"],"references":["274309848_Computational_Thinking","266882704_Computer_Science_Unplugged_school_students_doing_real_computing_without_computers","265797241_New_frameworks_for_studying_and_assessing_the_development_of_computational_thinking","247924673_Bringing_computational_thinking_to_K-12_what_is_Involved_and_what_is_the_role_of_the_computer_science_education_community","234812396_Education_Paving_the_way_for_computational_thinking","23142610_Computational_thinking_and_thinking_about_computing","265286561_Computational_Thinking_is_Pervasive","221536859_CS4HS_an_outreach_program_for_high_school_CS_teachers","220693857_Algorithm_design_Foundations_analysis_and_Internet_examples","26508546_Article_2_-_Maori_students_in_science_Hope_for_the_future"]}