{"id":"303758068_A_Review_on_the_Study_and_Analysis_of_Big_Data_using_Data_Mining_Techniques","abstract":"Big Data is an emerging concept that describes innovative techniques and technologies to analyze large volume of complex datasets that are exponentially generated from various sources and with various rates. Data mining techniques are providing great aid in the area of Big Data analytics, since dealing with Big Data are big challenges for the applications. Big Data analytics is the ability of extracting useful information from such huge datasets. This paper presents a literature review that include the importance, challenges and applications of Big Data in various fields and the different approaches used for Big Data Analysis using Data Mining techniques. The findings of this review give relevant information to the researchers about the main trends in research and analysis of Big Data using different analysis domains.","authors":["Anupama Jha","Meenu Dave","Dr. Supriya Madan"],"meta":["January 2016International Journal of Latest Trends in Engineering and Technology 6(3):94-102","Project: Gahi, Youssef, MouhcineGuennoun, and Hussein T. Mouftah. \"Big Data Analytics: Security and privacy  challenges.\"  [2] Mehmood, Abid, et al. \"Protection of big data privacy.\" Computers and Communication (ISCC), 2016 IEEE Symposium on. IEEE, 2016."],"references":["311558422_Big_Data_Analysis_Challenges_and_Solutions","303165833_Mining_big_data_Current_status_and_forecast_to_the_future","291818112_International_Journal_of_Parallel_Implementation_of_Big_Data_Pre-Processing_Algorithms_for_Sentiment_Analysis_of_Social_Networking_Data","282479004_Data_Mining_for_the_Internet_of_Things_Literature_Review_and_Challenges","268278329_Big_Data_Analaytics_A_Literature_review_analysis","262273728_Bifet_A_Mining_Big_Data_Current_Status_and_Forecast_to_the_Future_SIGKDD_Explorations_142_1-5","261564002_Big_Data_-_Solutions_for_RDBMS_Problems_-_A_Survey","312596137_Big_data_The_next_frontier_for_innovation_competition_and_productivity","263813729_Toward_Scalable_Systems_for_Big_Data_Analytics_A_Technology_Tutorial","261456895_Big_data_A_review"]}