{"id":"303708247_A_review_of_volunteered_geographic_information_quality_assessment_methods","abstract":"With the ubiquity of advanced web technologies and location-sensing hand held devices, citizens regardless of their knowledge or expertise, are able to produce spatial information. This phenomenon is known as volunteered geographic information (VGI). During the past decade VGI has been used as a data source supporting a wide range of services, such as environmental monitoring, events reporting, human movement analysis, disaster management, etc. However, these volunteer-contributed data also come with varying quality. Reasons for this are: data is produced by heterogeneous contributors, using various technologies and tools, having different level of details and precision, serving heterogeneous purposes, and a lack of gatekeepers. Crowd-sourcing, social, and geographic approaches have been proposed and later followed to develop appropriate methods to assess the quality measures and indicators of VGI. In this article, we review various quality measures and indicators for selected types of VGI and existing quality assessment methods. As an outcome, the article presents a classification of VGI with current methods utilized to assess the quality of selected types of VGI. Through these findings, we introduce data mining as an additional approach for quality handling in VGI.","authors":["Hansi Senaratne","Amin Mobasheri","Ahmed Loai Ali","Capineri Cristina"],"meta":["May 2016International Journal of Geographical Information Science 31(1)","DOI:10.1080/13658816.2016.1189556","Projects: CAP4Access - Collective Awareness Platforms for Improving Accessibility in European Cities & RegionsVisual Analysis of Movement and Event Data in Spatiotemporal Context"],"references":["348729499_Assessing_the_Accuracy_of_'Crowdsourced'_Data_and_its_Integration_with_Official_Spatial_Data_sets","305513094_Moving_on_Twitter_using_episodic_hotspot_and_drift_analysis_to_detect_and_characterise_spatial_trajectories","302617884_Discovering_points_of_interest_from_users_map_annotations","316594935_Automotive_Quality_Systems_Handbook","312437702_Selecting_quality_Twitter_content_for_events","301982714_Using_Semantic_Techology_for_Consistency_Checking_of_Road_Signs","301977391_Improving_Volunteered_Geographic_Information_Quality_Using_a_Tag_Recommender_System_The_Case_of_OpenStreetMap","301439630_Ambiguity_and_plausibility","291957782_Topological_Consistent_Generalization_of_OpenStreetMap","291008934_Consistent_Handling_of_Linear_Features_in_Polyline_Simplification"]}