{"id":"303789723_Exploring_media_literacy_and_computational_thinking_A_game_maker_curriculum_study","abstract":"While advances in game-based learning are already transforming educative practices globally, with tech giants like Microsoft, Apple and Google taking notice and investing in educational game initiatives, there is a concurrent and critically important development that focuses on ‘game construction’ pedagogy as a vehicle for enhancing computational literacy in middle and high school students. Essentially, game construction-based curriculum takes the central question “do children learn from playing games” to the next stage by asking “(what) can children learn from constructing games?” Founded on Seymour Papert’s constructionist learning model, and developed over nearly two decades, there is compelling evidence that game construction can increase student confidence and build their capacity towards ongoing computing science involvement and other STEM subjects. Our study adds to the growing body of literature on school-based game construction through comprehensive empirical methodology and evidence-based guidelines for curriculum design. There is still debate as to the utility of different software tools for game construction, models of scaffolding knowledge, and evaluation of learning outcomes and knowledge transfer. In this paper, we present a study we conducted in a classroom environment with three groups of grade 6 students (60+ students) using Game Maker to construct their own games. Based on a quantitative analysis and a qualitative discussion we organize results around several core themes that speak to the field of inquiry: levels of computational literacy based on pre- and post-tests; gender-based attitutdes to computing science and programming based on a pre- and post-survey; and the relationship between existing media literacy and performance in programming as part of the game construction curriculum. Significant results include some gender differences in attitudes towards computers and programming with boys demonstrating slightly higher confidence and performance. We discuss the complex reasons potentially contributing to that, particulaly against a diverse ecology of overal media use, gameplay experience and access to technology at home. Finally, we theorize game construction as an educational tool that directly engages foundational literacy and numeracy, and connects to wider STEM-oriented learning objectives in ways that can benefit both boys and girls in the classroom.","authors":["Jo Jenson","Milena Droumeva"],"meta":["January 2016"],"references":["267819576_Collective_Information_Literacy_in_Massively_Multiplayer_Online_Games","262350755_Computational_Thinking_in_Elementary_and_Secondary_Teacher_Education","254006849_The_fairy_performance_assessment_Measuring_computational_thinking_in_middle_school","249909626_From_SuperGoo_to_Scratch_Exploring_creative_digital_media_production_in_informal_learning","242269755_Playing_and_Making_Games_for_Learning","228951777_In_and_out_of_control_Learning_games_differently","225396021_Games_and_Immersive_Participatory_Simulations_for_Science_Education_An_Emerging_Type_of_Curricula","221537897_Measuring_high_school_students'_attitudes_toward_computing","221217295_Her_Own_Boss_Gender_and_the_Pursuit_of_Incompetent_Play","220420371_Computational_thinking","220140195_Computer_games_created_by_middle_school_girls_Can_they_be_used_to_measure_understanding_of_computer_science_concepts","41181994_Evidence-centered_Design_of_Epistemic_Games_Measurement_Principles_for_Complex_Learning_Environments","30524159_Internet_literacy_Young_people's_negotiation_of_new_online_opportunities","301429317_Should_your_8-year-old_learn_coding","285177809_Semiotic_Social_Spaces_and_Affinity_Spaces","284322163_Computer_games_and_learning_Digital_game-based_learning","266562898_Review_on_teaching_and_learning_of_computational_thinking_through_programming_What_is_next_for_K-12","252401574_Gaming_Literacies_A_Game_Design_Study_in_Action","242618627_The_Children's_Machine_Rethinking_School_in_the_Age_of_the_Computer","240793119_Computer_Programming_in_Middle_School_How_Pairs_Respond_to_Challenges","238374519_What_Video_Games_Have_to_Teach_Us_About_Learning_and_Literacy","225893528_Seriously_Considering_Play_Designing_Interactive_Learning_Environments_Based_on_the_Blending_of_Microworlds_Simulations_and_Games","224088907_Examining_science_and_engineering_students'_attitudes_toward_computer_science","222450088_Cognitive_objectives_in_a_LOGO_debugging_curriculum","222400176_Computer-game_Construction_A_Gender-neutral_Attractor_to_Computing_Science"]}