{"id":"303779009_A_Fitting_Model_for_Feature_Selection_With_Fuzzy_Rough_Sets","abstract":"Fuzzy rough set is an important rough set model used for feature selection. It uses the fuzzy rough dependency as a criterion for feature selection. However, this model can merely maintain a maximal dependency function. It does not fit a given data set well and cannot ideally describe the differences in sample classification. Therefore, in this study, we introduce a new model for handling this problem. First, we define the fuzzy decision of a sample using the concept of fuzzy neighborhood. Then, a parame- terized fuzzy relation is introduced to characterize the fuzzy information granules, using which the fuzzy lower and upper approximations of a decision are reconstructed and a new fuzzy rough set model is introduced. This can guarantee that the membership degree of a sample to its own category reaches the maximal value. Furthermore, this approach can fit a given data set and effectively prevents samples from being misclassified. Finally, we define the significance measure of a candidate attr- ibute and design a greedy forward algorithm for feature selection. Twelve data sets selected from public data sources are used to compare the proposed algorithm with certain existing algorithms, and the experimental results show that the proposed reduction algorithm is more effective than classical fuzzy rough sets, especially for those data sets for which different categories exhibit a large degree of overlap.","authors":["Changzhong Wang","Yali Qi","Mingwen Shao","Qinghua Hu"],"meta":["June 2016IEEE Transactions on Fuzzy Systems PP(99):1-1","DOI:10.1109/TFUZZ.2016.2574918"],"references":["276481617_Determining_decision_makers'_weights_in_group_ranking_a_granular_computing_method","271997924_Fast_randomized_algorithm_with_restart_strategy_for_minimal_test_cost_feature_selection","298980088_Toward_integrating_feature_selection_algorithms_for_classification_and_clustering","284040545_A_branch_and_bound_algorithm_for_feature_subset_selection","271951342_Feature_and_instance_reduction_for_PNN_classifiers_based_on_fuzzy_rough_sets","271914153_Uncertainty_measures_in_rough_algebra_with_applications_to_rough_logic","271743310_Attribute_reductions_in_object-oriented_concept_lattices","271631743_An_incremental_approach_to_attribute_reduction_of_dynamic_set-valued_information_systems","270722909_A_Novel_Approach_to_Building_a_Robust_Fuzzy_Rough_Classifier","266398094_On_the_union_and_intersection_operations_of_rough_sets_based_on_various_approximation_spaces"]}