{"id":"303794014_Automatic_extraction_of_building_roof_planes_from_airborne_lidar_data_applying_an_extended_3d_randomized_hough_transform","abstract":"This study aims to extract automatically building roof planes from airborne LIDAR data applying an extended 3D Randomized Hough Transform (RHT). The proposed methodology consists of three main steps, namely detection of building points, plane detection and refinement. For the detection of the building points, the vegetative areas are first segmented from the scene content and the bare earth is extracted afterwards. The automatic plane detection of each building is performed applying extensions of the RHT associated with additional constraint criteria during the random selection of the 3 points aiming at the optimum adaptation to the building rooftops as well as using a simple design of the accumulator that efficiently detects the prominent planes. The refinement of the plane detection is conducted based on the relationship between neighbouring planes, the locality of the point and the use of additional information. An indicative experimental comparison to verify the advantages of the extended RHT compared to the 3D Standard Hough Transform (SHT) is implemented as well as the sensitivity of the proposed extensions and accumulator design is examined in the view of quality and computational time compared to the default RHT. Further, a comparison between the extended RHT and the RANSAC is carried out. The plane detection results illustrate the potential of the proposed extended RHT in terms of robustness and efficiency for several applications.","authors":["Evangelos Maltezos","Charalabos Ioannidis"],"meta":["June 2016","DOI:10.5194/isprs-annals-III-3-209-2016"],"references":["314751936_Sub-Surface_Growing_and_Boundary_Generalization_for_3D_Building_Reconstruction","301287046_HOUGH-TRANSFORM_AND_EXTENDED_RANSAC_ALGORITHMS_FOR_AUTOMATIC_DETECTION_OF_3D_BUILDING_ROOF_PLANES_FROM_LIDAR_DATA","290812094_Recognizing_structure_in_laser_scanning_point_clouds","282577419_Automatic_detection_of_building_points_from_LIDAR_and_Dense_Image_Matching_point_clouds","276458701_LOD_Generation_for_Urban_Scenes","276021578_Quality_analysis_on_RANSAC-based_roof_facets_extraction_from_airborne_LIDAR_data","275960895_RAPTER_Rebuilding_Man-made_Scenes_with_Regular_Arrangements_of_Planes","274677147_Automated_modeling_of_3d_building_roofs_using_image_and_LIDAR_data","274676932_Rule-based_segmentation_of_LIDAR_point_cloud_for_automatic_extraction_of_building_roof_planes","274675881_Point_Cloud_Segmentation_for_Urban_Scene_Classification"]}