{"id":"303738913_miLBP_a_robust_and_fast_modality-independent_3D_LBP_for_multimodal_deformable_registration","abstract":"Purpose: \nComputer-assisted intervention often depends on multimodal deformable registration to provide complementary information. However, multimodal deformable registration remains a challenging task.\n\nMethods: \nThis paper introduces a novel robust and fast modality-independent 3D binary descriptor, called miLBP, which integrates the principle of local self-similarity with a form of local binary pattern and can robustly extract the similar geometry features from 3D volumes across different modalities. miLBP is a bit string that can be computed by simply thresholding the voxel distance. Furthermore, the descriptor similarity can be evaluated efficiently using the Hamming distance.\n\nResults: \nmiLBP was compared to vector-valued self-similarity context (SSC) in artificial image and clinical settings. The results show that miLBP is more robust than SSC in extracting local geometry features across modalities and achieved higher registration accuracy in different registration scenarios. Furthermore, in the most challenging registration between preoperative magnetic resonance imaging and intra-operative ultrasound images, our approach significantly outperforms the state-of-the-art methods in terms of both accuracy ([Formula: see text]) and speed (29.2 s for one case).\n\nConclusions: \nRegistration performance and speed indicate that miLBP has the potential of being applied to the time-sensitive intra-operative computer-assisted intervention.","authors":["Dongsheng Jiang","Yonghong Shi","Demin Yao","Manning Wang"],"meta":["June 2016International Journal of Computer Assisted Radiology and Surgery 11(6)","DOI:10.1007/s11548-016-1407-2"],"references":["260127827_Global_Registration_of_Ultrasound_to_MRI_Using_the_LC2_Metric_for_Enabling_Neurosurgical_Guidance","260127659_Lecture_Notes_in_Computer_Science","259624830_Comparative_Evaluation_of_Binary_Features","236228168_Guided_Image_Filtering","235895897_MRF-Based_Deformable_Registration_and_Ventilation_Estimation_of_Lung_CT","312896266_Automatic_non-linear_MRI-ultrasound_registration_for_the_correction_of_intra-operative_brain_deformations","271425097_Acoustic_feature_extraction_by_statistics_based_local_binary_pattern_for_environmental_sound_classification","262539840_Automatic_ultrasound-MRI_registration_for_neurosurgery_using_the_2D_and_3D_LC2_Metric","262346871_Fast_and_Robust_Registration_Based_on_Gradient_Orientations_Case_Study_Matching_Intra-operative_Ultrasound_to_Pre-operative_MRI_in_Neurosurgery","260527358_Nonrigid_Registration_of_Ultrasound_and_MRI_Using_Contextual_Conditioned_Mutual_Information"]}