{"id":"303773489_Applications_of_supervised_learning_techniques_on_undergraduate_admissions_data","abstract":"In making undergraduate admissions decisions, colleges and universities must take a large amount of data into consideration for each applicant. Surprisingly, there is almost no work reported in the literature for a systematic, automated use of the wealth of data gathered by an institution over the years; such a system could guide admissions offices in targeting applicants so that their yield (the applicants who enroll) is maximized by effectively distributing resources (counselors' time and energy) across applicants.\nWe discuss the use of supervised learning techniques, namely perceptrons and support vector machines, in predicting admission decisions and enrollment based on historical applicant data. We show through experimental results that a classifier, trained and validated on previous years' data, can identify with reasonable accuracy (1) those applicants that the admissions office is likely to accept (based on historical decisions made by the admissions office), and (2) of the accepted applicants, those ones that are likely to enroll at the institution. Additionally, the results from our feature selection experiments can inform admissions offices of the significance of applicant features relative to acceptance and enrollment, thus aiding the office in future data collection and decision making.","authors":["Thomas Lux","Randall Pittman","Maya Shende","Anil M. Shende"],"meta":["May 2016","DOI:10.1145/2903150.2911717","Conference: the ACM International Conference"],"references":["328250333_Machine_Learning_An_Algorithmic_Perspective","320663833_Early_Prediction_of_Student_Success_Mining_Students_Enrolment_Data","312469285_Machine_learning_an_algorithmic_perspective","283667552_GRADE_Machine_Learning_Support_for_Graduate_Admissions","243771827_On_selecting_features_for_pattern_classifier","229041761_Early_Prediction_of_Student_Success_Mining_Students_Enrolment_Data","226887520_Statistical_models_for_college_admission_and_enrollment_A_case_study_for_a_selective_liberal_arts_college","223457886_A_comparative_analysis_of_machine_learning_techniques_for_student_retention_management","223343225_An_expert_system_approach_to_graduate_school_admission_decisions_and_academic_performance_prediction","221675867_Comparison_of_the_Predicted_and_Observed_Secondary_Structure_of_T4_Phage_Lysozime"]}