{"id":"303748038_Urdu_language_processing_a_survey","abstract":"Extensive work has been done on different activities of natural language processing for Western languages as compared to its Eastern counterparts particularly South Asian Languages. Western languages are termed as resource-rich languages. Core linguistic resources e.g. corpora, WordNet, dictionaries, gazetteers and associated tools being developed for Western languages are customarily available. Most South Asian Languages are low resource languages e.g. Urdu is a South Asian Language, which is among the widely spoken languages of sub-continent. Due to resources scarcity not enough work has been conducted for Urdu. The core objective of this paper is to present a survey regarding different linguistic resources that exist for Urdu language processing, to highlight different tasks in Urdu language processing and to discuss different state of the art available techniques. Conclusively, this paper attempts to describe in detail the recent increase in interest and progress made in Urdu language processing research. Initially, the available datasets for Urdu language are discussed. Characteristic, resource sharing between Hindi and Urdu, orthography, and morphology of Urdu language are provided. The aspects of the pre-processing activities such as stop words removal, Diacritics removal, Normalization and Stemming are illustrated. A review of state of the art research for the tasks such as Tokenization, Sentence Boundary Detection, Part of Speech tagging, Named Entity Recognition, Parsing and development of WordNet tasks are discussed. In addition, impact of ULP on application areas, such as, Information Retrieval, Classification and plagiarism detection is investigated. Finally, open issues and future directions for this new and dynamic area of research are provided. The goal of this paper is to organize the ULP work in a way that it can provide a platform for ULP research activities in future.","authors":["Ali Daud","Wahab Khan","Dunren Che"],"meta":["March 2017Artificial Intelligence Review 47(3)","DOI:10.1007/s10462-016-9482-x","Project: Urdu Language Processing"],"references":["303969201_Controlling_Complexity_in_Part-of-Speech_Induction","273127103_Design_Development_of_Rule_Based_Inflectional_and_Derivational_Urdu_Stemmer_'Usal'","270878719_Adaptive_Parser-Centric_Text_Normalization","348864263_XML_Made_Simple","336389896_Challenges_in_Urdu_Stemming_A_Progress_Report","289787837_Challenges_of_Urdu_Named_Entity_Recognition_A_Scarce_Resourced_Language","282377247_An_Artificial_Neural_Network_Approach_for_Sentence_Boundary_Disambiguation_in_Urdu_Language_Text","281506103_Comparison_of_Hindi_and_Urdu_in_computational_context","270878422_Rule_Based_Urdu_Stemmer","270877776_Named_Entity_Recognition_System_for_Urdu"]}