{"id":"30385314_Teaching_Research_Method_Using_a_Student-Centred_Approach_Critical_Reflections_on_Practice","abstract":"This article presents a reflective case study analysis of an attempt to enhance student learning through the introduction of student-centred teaching methods in a masters-level social research methods subject. The introduction of a range of specific techniques, including case study teaching, problem based learning, groupwork, role-play and simulation, is reflected upon. The article concludes that the re-orientation of the curriculum toward student-centredness in this case had a positive effect on student performance, learning experience and subject evaluation. In particular, the use of student-centred techniques facilitated a strong social context for learning, and provided students with a common experiential framework from which to explore the technical aspects of the curriculum. However, the analysis also found that students continued to place value on more formal teaching methods, and that the value of student-centred techniques in this case rested in the way in which they were integrated with more didactic teaching practice.","authors":["Jo Barraket"],"meta":["April 2005","DOI:10.53761/1.2.2.3"],"references":["280315330_Action_Research_An_Educational_Leader's_Guide_to_School_Improvement","243784496_First_Year_on_Campus_Diversity_in_the_Initial_Experiences_of_Australian_Undergraduates","314820513_Can_research_methods_ever_be_interesting","270359749_Learner-Centered_Teaching_Five_Key_Changes_to_Practice","270113229_How_College_Affects_Students_Findings_and_Insights_From_Twenty_Years_of_Research","257139102_Teaching_for_Effective_Learning_in_Higher_Education","249807743_Students'_Perceptions_of_Constructivist_Learning_in_a_Community_College_American_History_11_Survey_Course","249037993_Constructivist_Learning_Experiences_for_Social_Studies_Education","246664194_Learner-Centered_Teaching_Five_Key_Changes_to_Practice","242329165_Collaborative_Learning_Higher_Education_Interdependence_and_the_Authority_of_Knowledge"]}