{"id":"303893960_BS-ACEBOC_a_generalized_low-complexity_dual-frequency_constant-envelope_multiplexing_modulation_for_GNSS","abstract":"In order to satisfy the need for combining signals in a constant-envelope modulation, we propose a new dual-frequency constant-envelope modulation (DCEM), called asymmetric constant-envelope binary offset carrier multiplexing modulation with bipolar subcarrier (BS-ACEBOC). It can combine up to four signal components from two separate sidebands with low complexity and an arbitrary power ratio between signal components. We briefly introduce the design principles and address the construction method of the BS-ACEBOC. The high flexibility of the proposed method is proven, and several special cases for practical applications are presented. The complexity comparison for the signal generation shows that the computational requirements of BS-ACEBOC are significantly lower than that of other DCEMs. Finally, the performance of BS-ACEBOC is analyzed. With low complexity and high flexibility, BS-ACEBOC is a promising solution for signal design of global navigation satellite systems including Beidou Phase III.","authors":["Fu Guo","Zheng Yao","Minguan Lu"],"meta":["April 2017GPS Solutions 21(2):561–575","DOI:10.1007/s10291-016-0547-8","Projects: New Generation GNSS Signal DesignDual-frequency Modulation and Multiplexing Joint Design Method for GNSS Signals"],"references":["297275220_Time-Multiplexed_Offset-Carrier_QPSK_for_GNSS","280037483_AltBOC_for_Dummies_or_Everything_You_Always_Wanted_to_Know_About_AltBOC","266139450_Constant_envelope_combination_for_components_on_different_carrier_frequencies_with_unequal_power_allocation","260538726_Dual-frequency_constant_envelope_multiplex_with_non-equal_power_allocation_for_GNSS","260510646_Time-multiplexed_offset-carrier_QPSK_for_GNSS_IEEE_Trans_Aerosp_Electron_Syst","225936210_Analysis_of_Galileo_E5_and_E5ab_code_tracking","225670060_TD-AltBOC_a_new_COMPASS_B2_modulation","224731001_Interplex--An_Efficient_Multichannel_PSKPM_Telemetry_System","224320876_Study_of_signal_combining_methodologies_for_future_GPS_flexible_navigation_payload_Part_II"]}