{"id":"303813756_PROGRAMMING_EDUCATION_AND_NEW_APPROACHES_AROUND_THE_WORLD_AND_IN_TURKEY_DUNYADA_VE_TURKIYE'DE_PROGRAMLAMA_EGITIMI_VE_YENI_YAKLASIMLAR","abstract":"With the rapid changes taking place in technology, information and communication technologies began to be used more in educational environments. Since these technologies became a part of our lives, production of new software in this area has become a necessity. It is essential to provide programming education starting from an early age in order to meet this need and to raise a productive and creative generation. Programming education will help to meet the need for trained personnel in the software field and create a more productive generation. In addition, programming skills will enable younger students to develop positive attitudes towards school and courses, and will encourage them to perform research. Programming education will also promote problem-solving, quantitative thinking, spatial and analytical thinking skills of students. The purpose of this study is to introduce innovative approaches and practices that emerged in the programming field, by shedding light on the current state of the programming education around the world and specifically in Turkey. In this context, projects, activities and programming training organized around the world and in Turkey were investigated in this study. Additionally, the programming tools designed for individuals and children who want to learn programming are also discussed. Finally, suggestions for programming education in Turkey are presented.\n\nBilişim teknolojilerinde yaşanan hızlı değişim ile birlikte bu teknolojiler eğitim ortamlarında daha fazla kullanılmaya başlanmıştır. Bu teknolojilerin hayatımızın bir parçası haline gelmesi bu alanda yeni yazılımların üretilmesini bir ihtiyaç haline getirmiştir. Bu ihtiyacı karşılayabilmek, üretken ve yaratıcı bir nesil yetiştirebilmek için bireylere erken yaştan itibaren programlama eğitimi verilmesi gerekmektedir. Programlama eğitimi sayesinde üretken bir nesil yetişirken yazılım alanında yetişmiş eleman ihtiyacı da giderilmiş olacaktır. Ayrıca programlama becerisi küçük yaştaki öğrencilerin okula ve derse karşı olumlu tutum geliştirmelerini sağlayarak, onları araştırma yapmaya sevk edecektir. Programlama öğrenen öğrencilerin problem çözme, sayısal düşünme, uzamsal ve analitik düşünme becerileri gelişmektedir. Bu araştırmanın amacı, programlama eğitiminin dünyada ve ülkemizdeki mevcut durumuna bir bakış açısı getirerek bu alanda ortaya çıkan yenilikçi yaklaşım ve uygulamaların tanıtılmasıdır. Bu bağlamda çalışmada Dünyada ve Türkiye'de düzenlenen proje, etkinlik ve programlama eğitimleri incelenmiştir. Ayrıca programlamayı öğrenmek isteyen bireylere ve çocuklara yönelik tasarlanan programlama araçlarına yer verilmiştir. Son olarak ülkemizdeki programlama eğitimine yönelik öneriler sunulmuştur.","authors":["Veysel Demirer","Nurcan Sak"],"meta":["April 2016"],"references":["289078830_Bilgi_toplumu_okullaridotlessnda_programlama_egitimi_gereksinimi"]}