{"id":"303819060_Zukunftsszenarien_autonomer_Fahrzeuge_-_Nutzungsorientierte_Gestaltung_eines_individuell_abrufbaren_Personentransportsystems","abstract":"Eine Attraktivitätssteigerung des Öffentlichen Personenverkehrs kann erreicht werden, indem die „traditionellen Großgefäße für die Massen von gestern“ stärker den Ansprüchen heutiger Kunden nach Individualisierung und Flexibilisierung entsprechen. Individuell abrufbare Transportsysteme, wie Quartiersbussysteme, ermöglichen eine Anpassung des Verkehrsmitteleinsatzes an den tatsächlichen Bedarf der Nutzer. Die voranschreitende Fahrzeugautomatisierung wird in Zukunft Fahren ermöglichen, das eine weitere Flexibilisierung des Quartiersbussystems verspricht. In der zunehmenden Verfügbarkeit von Smartphones und der dafür benötigten digitalen Infrastruktur besteht das Potenzial, die Fahrgäste bei der Organisation ihrer individuellen Reiseketten durch die Bereitstellung von Echtzeitinformation zu unterstützen. Das vorliegende Forschungsvorhaben setzt sich daher zum Ziel, mithilfe einer nutzungsorientierten Gestaltung des innovativen Personentransportsystems die Akzeptanz der zukünftigen Fahrgäste für das System zu erhöhen und somit die anschließende erfolgreiche Nutzung zu gewährleisten. Die nutzungszentrierte Gestaltung umfasst verschiedene Methoden, wie Aufgabenanalysen, das Requirements Engineering und die Persona-Methode. Hervorzuheben ist die zentrale Rolle der Bürgerbeteiligung in Form von Fokusgruppen, Befragungen, sowie Partizipation im Gestaltungsprozess und Test-Nutzung. Die unterschiedlichen Methoden werden in einem Vorgehen integriert, das die Entwicklung des Systems von der Systemdefinition bis zur Systemeinführung umfasst. Erste Ergebnisse der Arbeit sind die Entwicklung einer Funktionsarchitektur, die in einem Labordemonstrator realisiert wurde und anschließend in einer Verkehrssimulation angewendet werden wird. Dieser Beitrag zeigt auf, wie die nutzungsorientierte Gestaltung eines individuell abrufbaren Transportsystems am Beispiel von Quartiersbussen gelingen kann. Weiterhin wird aufgezeigt wie, durch ein transdisziplinäres Vorgehen das bestehende Vorgehen weiterentwickelt werden kann, um den Erfolg der Gestaltung des Personentransportsystems weiter zu steigern.","authors":["Alexandra König","Alexander Brandies","Lars Schnieder","Jipp Meike"],"meta":["March 2016","Conference: 5. interdisziplinärer Workshop kognitive SystemeAt: BochumVolume: 5"],"references":["303516983_Nutzerorientierter_Entwurf_innovativer_Mobilitatskonzepte_fur_urbane_Raume","303480868_Autonomous_Mobility-on-Demand_Systems_for_Future_Urban_Mobility","300136622_Implementierung_eines_selbstfahrenden_und_individuell_abrufbaren_Personentransportsystems","290368471_Der_Benutzungsfragebogen_ISONORM_924110_Ergebnisse_zur_Reliabilitat_und_Validitat","283774823_Transdisciplinarity_at_the_crossroads","277197991_Simulation_based_planning_processes_for_the_integration_of_inductively_charged_vehicles_into_public_transportation_services","286286487_Meeting_the_Challenges_of_Individual_Passenger_Information_with_Personas","284042808_79_Prozent_der_Deutschen_online_-_Zuwachs_bei_mobiler_Internetnutzung_und_Bewegtbild","266321843_The_Psychology_of_Human-Computer_Interaction","251269185_Mit_dem_OPNV_in_die_Zukunft"]}