{"id":"303801378_On_the_Interest_of_Opportunistic_Anycast_Scheduling_for_Wireless_Low_Power_Lossy_Networks","abstract":"Low-Power and Lossy Networks (LLNs) aim at integrating smart objects into the Internet of Things. ieee 802.15.4 -TSCH is currently a promising standard for the link layer: it schedules the transmissions and implements slow channel hopping to improve the reliability while the routing layer focuses on constructing distributed routes for a small collection of destinations (i.e. convergecast). We propose an efficient scheduling policy to exploit an opportunistic feature of the MAC layer: a single transmission is received by a collection of next hops which decides opportunistically which one will forward the packet. We consider the problem of the optimal scheduling policy for reliability and energy efficiency with considering such opportunistic forwarding at the MAC and routing layers. The simulation results demonstrate the effectiveness of the proposed policy: by effectively selecting the set of parents (i.e. next hops) and carefully considering the channel quality, the energy consumption per packet is reduced. Besides, we also improve the reliability: the network can also use unreliable radio links, where only one of the next hops receives the packet to forward. This scheduling policy may be typically implemented in the Path Computation Engine of ieee 802.15.4 e-TSCH.","authors":["Thong Huynh","Fabrice Theoleyre","won-Joo Hwang"],"meta":["June 2016Computer Communications 104","DOI:10.1016/j.comcom.2016.06.001","Projects: On Performance Improvement of IEEE 802.15.4 TSCHIndustrial Internet of Things"],"references":["271514745_RPL_IPv6_Routing_Protocol_for_Low_power_and_Lossy_Networks","269339004_End-to-End_Reliability-Aware_Scheduling_for_Wireless_Sensor_Networks","303802420_On_generating_all_maximal_independent_sets_Info","276882781_Using_IEEE_802154e_Time-Slotted_Channel_Hopping_TSCH_in_the_Internet_of_Things_IoT_Problem_Statement","273730354_Hypergraph-based_data_link_layer_scheduling_for_reliable_packet_delivery_in_wireless_sensing_and_control_networks_with_end-to-end_delay_constraints","266257773_Approximate_Dynamic_Programming_Solving_the_Curses_of_Dimensionality","262294081_Exploiting_long-range_opportunistic_links_to_improve_delivery_delay_and_energy_consumption_in_Wireless_Sensor_Networks","261855305_TALENT_Temporal_adaptive_link_estimator_with_no_training","261490948_Adaptive_scheduling_for_multicasting_hard_deadline_constrained_prioritized_data_via_network_coding","261246079_Decentralized_Traffic_Aware_Scheduling_for_multi-hop_Low_power_Lossy_Networks_in_the_Internet_of_Things"]}