{"id":"303883169_Activities_planning_and_resource_assignment_on_multi-place_hospital_system_Exact_and_approach_methods_adapted_from_the_bin_packing_problem","abstract":"In France, the Hospital Community of Territory (HCT) has been defined since the settlement of the pricing by activity (T2A) in 2004, and the new governance. This new community allows the pooling of the hospital resources between any places in the same territory. It aims at increasing the continuity of healthcare. A medical exam needs human resources and one material resource, both of them compatible with the exam. Human resources are supposed available all the time. In this paper, material resources are the critical resources. The objective is to create a decision support tool which plans the exams on each material resource. Some constraints have to be respected: compatibilities between exams and resources, resources opentime. We propose a mathematical model. It deals with an exams planning taking into account the assignment of material resources in the community over a given horizon planning. The problem is solved in an exact way and with approach methods applying bin packing heuristics and single solution based metaheuristics. Experimentation tackles with randomly generated instances.","authors":["Michel Gourgand","Nathalie Grangeon","Nathalie Klement"],"meta":["March 2014","Conference: 7th International Conference on Health Informatics","Project: Planning activities and resources assignment in the hospital context"],"references":["45928078_A_Dense_Hierarchy_of_Sublinear_Time_Approximation_Schemes_for_BinPacking","243765402_Simulated_Annealing_Theory_and_Applications_D_Reidel_Publishing_Company","228057735_Computers_And_Intractability_A_Guide_to_the_Theory_of_NP-Completeness","224877317_Equation_of_State_Calculations_by_Fast_Computing_Machines","221704646_Approximation_algorithms_for_bin_packing_A_survey","220695890_Computers_and_Intracdtability_A_Guide_to_the_Theory_of_NP-Completeness","200622065_Equation_of_State_Calculations_by_Fast_Computing_Machines","200622046_Simulated_Annealing_Theory_and_Applications_Mathematics_and_Its_Applications","2405214_Using_LibGA_to_Develop_Genetic_Algorithms_for_Solving_Combinatorial_Optimization_Problems"]}