{"id":"303848621_Security_Issues_in_Service_Model_of_Cloud_Computing_Environment","abstract":"Cloud computing is becoming increasingly fashionable in distributed computing environment. Processing and Data storage use cloud environment is becoming a movement universal. Software as a Service (SaaS) has on many business applications as well as in our day to day life, we can simply say that this disruptive technology. Cloud computing can be seen since Internet-based computing, in which shared resources, software, and information are made available to devices on demand. It allows resources towards leveraged on per-use basis. It diminishes cost and complexity of service providers by means of assets and operational costs. It allows users to access applications tenuously. On behalf of user, this construct directs cloud service provider to feel software updates and cost of servers etc. For both, cloud providers and consumers; availability, integrity, authenticity, confidentiality, and privacy are important concern. Infrastructure as a Service (IaaS) serves as base layer for many other release models and Platform-as-a-Service (PaaS) clouds. Security of PaaS clouds is considered from multiple perspective including access control, service continuity and privacy while protecting together the service provider and the user. Security problems of PaaS clouds are explored and classified. In this paper we are going to some major security issues of current cloud computing environments.","authors":["B. Hari Krishna","Kiran Sk","Govindarajan Murali","R. Pradeep Kumar Reddy"],"meta":["December 2016Procedia Computer Science 87:246-251","DOI:10.1016/j.procs.2016.05.156"],"references":["227135877_Towards_Analyzing_Data_Security_Risks_in_Cloud_Computing_Environments","224216989_Social_Impact_of_Privacy_in_Cloud_Computing","224202015_Security_and_Privacy_Challenges_in_Cloud_Computing_Environments","220422375_A_View_of_Cloud_Computing","311344281_A_survey_on_security_issues_in_service_delivery_models_of_cloud_computing","271589529_The_NIST_definition_of_cloud_computing_Draft","224217000_Privacy_Security_and_Trust_Issues_Arising_from_Cloud_Computing","224175545_A_Practical_Approach_to_Improve_the_Data_Privacy_of_Virtual_Machines","222675501_Kavitha_V_A_Survey_on_Security_Issues_in_Service_Delivery_Models_of_Cloud_Computing_Journal_of_Network_and_Computer_Application_341_1-11","222410212_Cloud_Computing_and_Emerging_IT_Platforms_Vision_Hype_and_Reality_for_Delivering_Computing_as_the_5th_Utility","222305358_Building_a_High-Performance_Programmable_Secure_Coprocessor","221158439_R2D_Extracting_Relational_Structure_from_RDF_Stores","4276086_A_Transformation_from_RDF_Documents_and_Schemas_to_Relational_Databases"]}