{"id":"303890279_Learning_Analytics_and_Digital_Badges_Potential_Impact_on_Student_Retention_in_Higher_Education","abstract":"Learning analytics and digital badges are emerging research fields in educational science. They both show promise for enhancing student retention in higher education, where withdrawals prior to degree completion remain at about 30 % in Organisation for Economic Cooperation and Development member countries. This integrative review provides an overview of the theoretical literature as well as current practices and experience with learning analytics and digital badges in higher education with regard to their potential impact on student retention to enhance students’ first-year experience. Learning analytics involves measuring and analyzing dynamic student data in order to gain insight into students’ learning processes and optimize learning and teaching. One purpose of learning analytics is to construct predictive models to identify students who risk failing a course and thus are more likely to drop out of higher education. Personalized feedback provides students with information about academic support services, helping them to improve their skills and therefore be successful in higher education. Digital badges are symbols for certifying knowledge, skills, and competencies on web-based platforms. The intention is to encourage student persistence by motivating them, recognizing their generic skills, signaling their achievements, and capturing their learning paths. This article proposes a model that synthesizes learning analytics, digital badges, and generic skills such as academic competencies. The main idea is that generic skills can be represented as digital badges, which can be used for learning analytics algorithms to predict student success and to provide students with personalized feedback for improvement. Moreover, this model may serve as a platform for discussion and further research on learning analytics and digital badges to increase student retention in higher education.","authors":["Dana-Kristin Mah"],"meta":["October 2016Technology, Knowledge and Learning 21(3)","DOI:10.1007/s10758-016-9286-8"],"references":["311573785_Unraveling_the_Digital_Literacy_Paradox_How_Higher_Education_Fails_at_the_Fourth_Literacy","307842715_Developing_a_Code_of_Practice_for_Learning_Analytics","305488618_What_Counts_As_Learning_Open_Digital_Badges_for_New_Opportunities","304621516_Student_Perceptions_of_Digital_Badges_as_Recognition_of_Achievement_and_Engagement_in_Co-curricular_Activities","304614611_Development_and_Implementation_of_Digital_Badges_for_Learning_Science_Technologly_Engineering_and_Math_STEM_Practices_in_Secondary_Contexts_A_Pedagogical_Approach_with_Empirical_Evidence","318517973_Leaving_College_Rethinking_the_Causes_and_Cures_of_Student_Attrition","313657280_Data_mining_algorithms_to_classify_students","305166663_Dropout_from_Higher_Education_A_Theoretical_Synthesis_of_Recent_Research","304621461_Applied_Gamification_Creating_Reward_Systems_for_Organizational_Professional_Development","304621361_Badging_Platforms_A_Scenario-Based_Comparison_of_Features_and_Uses","304614610_Implementing_Digital_Badges_in_Australia_The_Importance_of_Institutional_Context","304614603_Passport_to_Designing_Developing_and_Issuing_Digital_Instructional_Badges","304039283_Foundation_of_Digital_Badges_and_Micro-Credentials_Demonstrating_and_Recognizing_Knowledge_and_Competencies","301600444_Guest_Editorial_Ethics_and_Privacy_in_Learning_Analytics","301600380_Ethics_and_Privacy_as_Enablers_of_Learning_Analytics"]}