{"id":"303835466_Approximation_of_knapsack_problems_with_conflict_and_forcing_graphs","abstract":"We study the classical 0–1 knapsack problem with additional restrictions on pairs of items. A conflict constraint states that from a certain pair of items at most one item can be contained in a feasible solution. Reversing this condition, we obtain a forcing constraint stating that at least one of the two items must be included in the knapsack. A natural way for representing these constraints is the use of conflict (resp. forcing) graphs. By modifying a recent result of Lokstanov et al. (Proceedings of the 25th annual ACM-SIAM symposium on discrete algorithms, SODA, pp 570–581, 2014) we derive a fairly complicated FPTAS for the knapsack problem on weakly chordal conflict graphs. Next, we show that the techniques of modular decompositions and clique separators, widely used in the literature for solving the independent set problem on special graph classes, can be applied to the knapsack problem with conflict graphs. In particular, we can show that every positive approximation result for the atoms of prime graphs arising from such a decomposition carries over to the original graph. We point out a number of structural results from the literature which can be used to show the existence of an FPTAS for several graph classes characterized by the exclusion of certain induced subgraphs. Finally, a PTAS for the knapsack problem with H-minor free conflict graph is derived. This includes planar graphs and, more general, graphs of bounded genus. The PTAS is obtained by expanding a general result of Demaine et al. (Proceedings of 46th annual IEEE symposium on foundations of computer science, FOCS 2005, pp 637–646, 2005). The knapsack problem with forcing graphs can be transformed into a minimization knapsack problem with conflict graphs. It follows immediately that all our FPTAS results of the current and a previous paper carry over from conflict graphs to forcing graphs. In contrast, the forcing graph variant is already inapproximable on planar graphs.","authors":["Ulrich Pferschy","Joachim Schauer"],"meta":["May 2017Journal of Combinatorial Optimization 33(4)","DOI:10.1007/s10878-016-0035-7"],"references":["295253334_A_Fast_Large_Neighborhood_Search_for_Disjunctively_Constrained_Knapsack_Problems","283006489_A_hybrid_guided_neighborhood_search_for_the_disjunctively_constrained_knapsack_problem","313726837_Combinatorial_optimization_of_graphs_of_bounded_treewidth","303724552_Addendum_to_Maximum_Weight_Independent_Sets_in_Hole-_and_Co-chair-free_Graphs","285296502_Independent_Set_in_P_5_-Free_Graphs_in_Polynomial_Time","279947289_Treewidth_and_minimum_fill-in_Grouping_the_minimal_separators","273917759_Efficiently_decomposing_recognizing_and_triangulating_hole-free_graphs_without_diamonds","268613715_A_Method_for_Solving_Certain_Graph_Recognition_and_Optimization_Problems_with_Applications_to_Perfect_Graphs","257585869_The_maximum_flow_problem_with_disjunctive_constraints","257153577_The_minimum_cost_perfect_matching_problem_with_conflict_pair_constraints"]}