{"id":"303841196_The_Logic_of_Public_Announcements_Common_Knowledge_and_Private_Suspicions","abstract":"This paper presents a logical system in which various group-level epistemic actions are incorporated into the object language. That is, we consider the standard modeling of knowledge among a set of agents by multi-modal Kripke structures. One might want to consider actions that take place, such as announcements to groups privately, announcements with suspicious outsiders, etc. In our system, such actions correspond to additional modalities in the object language. That is, we do not add machinery on top of models (as in Fagin et al., Reasoning about knowledge. MIT, Cambridge, 1995), but we reify aspects of the machinery in the logical language. Special cases of our logic have been considered in Plaza (Logics of public communications. In: Proceedings of the 4th international symposium on methodologies for intelligent systems, Charlotte, 1989), Gerbrandy (Dynamic epistemic logic. In: Moss LS, et al (eds) Logic, language, and information, vol 2. CSLI Publications, Stanford University, 1999a; Bisimulations on planet Kripke. Ph.D. dissertation, University of Amsterdam, 1999b), and Gerbrandy and Groeneveld (J Logic Lang Inf 6:147–169, 1997). The latter group of papers introduce a language in which one can faithfully represent all of the reasoning in examples such as the Muddy Children scenario. In that paper we find operators for updating worlds via announcements to groups of agents who are isolated from all others. We advance this by considering many more actions, and by using a more general semantics. Our logic contains the infinitary operators used in the standard modeling of common knowledge. We present a sound and complete logical system for the logic, and we study its expressive power.","authors":["Alexandru Baltag","Lawrence S. Moss","Sławomir Solecki"],"meta":["January 2016","DOI:10.1007/978-3-319-20451-2_38","In book: Readings in Formal Epistemology (pp.773-812)"],"references":["265100757_From_Hypersets_to_Kripke_Models_in_Logics_of_Announcements","254853660_Bisimulations_on_Planet_Kripke","220607963_Logics_of_Public_Communications","220441261_Reasoning_about_Information_Change","23573527_Reasoning_About_Knowledge","2811314_Dynamic_Epistemic_Logic","256554868_An_elementary_proof_of_the_completeness_of_PDL","239060897_Two_generalizations_of_the_recursive_path_ordering","222474776_The_complexity_of_reasoning_about_knowledge_and_time_I_Lower_bounds","222455633_Orderings_for_term-rewriting_systems","222207254_Termination_orderings_for_associative-commutative_rewriting_systems","2843938_Proof-Theoretic_Analysis_of_Termination_Proofs"]}