{"id":"303848496_Possible_and_certain_keys_for_SQL","abstract":"Driven by the dominance of the relational model and the requirements of modern applications, we revisit the fundamental notion of a key in relational databases with NULL. In SQL, primary key columns are NOT NULL, and UNIQUE constraints guarantee uniqueness only for tuples without NULL. We investigate the notions of possible and certain keys, which are keys that hold in some or all possible worlds that originate from an SQL table, respectively. Possible keys coincide with UNIQUE, thus providing a semantics for their syntactic definition in the SQL standard. Certain keys extend primary keys to include NULL columns and can uniquely identify entities whenever feasible, while primary keys may not. In addition to basic characterization, axiomatization, discovery, and extremal combinatorics problems, we investigate the existence and construction of Armstrong tables, and describe an indexing scheme for enforcing certain keys. Our experiments show that certain keys with NULLs occur in real-world data, and related computational problems can be solved efficiently. Certain keys are therefore semantically well founded and able to meet Codd’s entity integrity rule while handling high volumes of incomplete data from different formats.","authors":["Henning Köhler","Uwe Leck","Sebastian Link","Xiaofang Zhou"],"meta":["August 2016The VLDB Journal 25(4)","DOI:10.1007/s00778-016-0430-9"],"references":["282462866_Possible_and_certain_SQL_keys","346671445_Sperner_Theory","316879328_SQL_Schema_Design_Foundations_Normal_Forms_and_Normalization","305263241_Incomplete_information_and_dependencies_in_relational_databases","301418023_Inclusion_Dependencies_Reloaded","300621460_The_Data_Complexity_of_Consistent_Query_Answering_for_Self-Join-Free_Conjunctive_Queries_Under_Primary_Key_Constraints","300142627_SQL_Data_Profiling_of_Foreign_Keys","297725160_On_the_finite_and_general_implication_problems_of_independence_atoms_and_keys","290634784_Logical_Foundations_of_Possibilistic_Keys","283005006_Probabilistic_Keys_for_Data_Quality_Management","280621042_Capturing_Relational_Schemas_and_Functional_Dependencies_in_RDFS","277561530_Profiling_relational_data_a_survey","281047698_An_Average_Study_of_Hypergraphs_and_their_minimal_transversals","271462251_Data_quality_The_other_face_of_Big_Data","266656487_Complete_Yet_Practical_Search_for_Minimal_Query_Reformulations_Under_Constraints"]}