{"id":"303880587_Development_of_a_New_Backdrivable_Actuator_for_Haptic_Interfaces_and_Collaborative_Robots","abstract":"Industrial robots are most often position controlled and insensitive to external forces. In many robotic applications, however, such as teleoperation, haptics for virtual reality, and collaborative robotics, a close cooperation between humans and robots is required. For such applications, force sensing and control capabilities are required for stable interactions with the operator and environment. The robots must also be backdrivable, i.e., the robot must be able to follow user's induced movements with the least possible resistance. High force efficiency is also desirable. These requirements are different from the design drivers of traditional industrial robots and call for specific actuators and reducers. Many such devices were proposed in the literature. However, they suffer from several drawbacks, offering either a limited reduction ratio or being complex and bulky. This paper introduces a novel solution to this problem. A new differential cable drive reducer is presented. It is backdrivable, has a high efficiency, and a potentially infinite reduction ratio. A prototype actuator using such a reducer has been developed and integrated on a test bench. The experimental characterization of its performance confirms its theoretical advantages.","authors":["Florian Gosselin","Fabien Ferlay","Alexandre Janot"],"meta":["June 2016Actuators 5(2)","DOI:10.3390/act5020017"],"references":["281125950_A_Balance_Feedback_Human_Machine_Interface_for_Humanoid_Teleoperation_in_Dynamic_Tasks","254054526_Experimental_Joint_Stiffness_Identification_Depending_on_Measurements_Availability","308804892_A_Balance_Feedback_Human_Machine_Interface_for_humanoid_teleoperation_in_dynamic_tasks","305657926_Hardware_devices_of_force_feedback_interfaces","305657758_Control_of_a_Force_Feedback_Interface","273393569_The_Body_Extender_A_Full-Body_Exoskeleton_for_the_Transport_and_Handling_of_Heavy_Loads","263127426_Ergonomic_contribution_of_ABLE_exoskeleton_in_automotive_industry","257343611_Haptic_systems_for_training_sensorimotor_skills_A_use_case_in_surgery","252201933_Force_reflecting_hand_controller","251720823_Projet_Surgicobot_robot_d'assistance_a_la_chirurgie_du_rachis"]}