{"id":"303887715_Building_Up_STEM_An_Analysis_of_Teacher-Developed_Engineering_Design-Based_STEM_Integration_Curricular_Materials","abstract":"Improving K–12 Science, Technology, Engineering, and Mathematics (STEM) education has a priority on numerous education reforms in the United States. To that end, developing and sustaining quality programs that focus on integrated STEM education is critical for educators. Successful implementation of any STEM program is related to the curriculum materials used. Educators increasingly recognize the challenge of finding quality curriculum materials for integrated STEM education. In this study, 48 teachers participated in a year-long professional development program on STEM integration, and they designed 20 new engineering design-based STEM curriculum units. Each STEM curriculum unit includes an engineering challenge in which students develop technologies to solve the challenge; each unit also integrates grade level appropriate mathematics (data analysis and measurement) and one of the three science content areas: life science, physical science, or earth science. A total of 20 STEM integration units were assessed using the STEM Integration Curriculum Assessment (STEM-ICA) tool. Comparisons among the STEM units showed that the context or the engineering activities in physical science focused STEM units were more engaging and motivating comparing to the authentic contexts used in life science and earth science focused STEM units. Moreover, mathematics integration and communicating mathematics, science, and engineering thinking were not found to strongly contribute to the overall quality of the STEM units. Implications for designing effective professional development on integrated STEM education will be discussed.","authors":["S. Selcen Guzey","Tamara J. Moore","Michael Harwell"],"meta":["June 2016Journal of Pre-College Engineering Education Research (J-PEER) 6(1)","DOI:10.7771/2157-9288.1129"],"references":["273458545_Implementation_and_integration_of_engineering_in_K-12_STEM_education"]}