{"id":"303969758_High-Precision_Forward_Modeling_of_Large-Scale_Structure_An_open-source_approach_with_Halotools","abstract":"We present the first stable release of Halotools (v0.2), a community-driven Python package designed to build and test models of the galaxy-halo connection. Halotools provides a modular platform for creating mock universes of galaxies starting from a catalog of dark matter halos obtained from a cosmological simulation. The package supports many of the common forms used to describe galaxy-halo models: the halo occupation distribution (HOD), the conditional luminosity function (CLF), abundance matching, and alternatives to these models that include effects such as environmental quenching or variable galaxy assembly bias. Satellite galaxies can be modeled to live in subhalos, or to follow custom number density profiles within their halos, including spatial and/or velocity bias with respect to the dark matter profile. The package has an optimized toolkit to make mock observations on a synthetic galaxy population, including galaxy clustering, galaxy-galaxy lensing, galaxy group identification, RSD multipoles, void statistics, pairwise velocities and others, allowing direct comparison to observations. Halotools is object-oriented, enabling complex models to be built from a set of simple, interchangeable components, including those of your own creation. Halotools has an automated testing suite and is exhaustively documented on http://halotools.readthedocs.io, which includes quickstart guides, source code notes and a large collection of tutorials. The documentation is effectively an online textbook on how to build and study empirical models of galaxy formation with Python.","authors":["Andrew P. Hearin","Duncan Alan Campbell","Erik Jon Tollerud","Peter S. Behroozi"],"meta":["June 2016The Astronomical Journal 154(5)","DOI:10.3847/1538-3881/aa859f"],"references":["280970208_The_Mira-Titan_Universe_Precision_Predictions_for_Dark_Energy_Surveys","264936785_CLASS_The_cosmology_large_angular_scale_surveyor","258052465_The_Dark_Side_of_Galaxy_Color_evidence_from_new_SDSS_measurements_of_galaxy_clustering_and_lensing","255909531_Evolution_of_the_Stellar-to-Dark_Matter_Relation_Separating_Star-Forming_and_Passive_Galaxies_from_z1_to_0","251566730_Astropy_A_Community_Python_Package_for_Astronomy","249228986_Efficient_Computation_of_Cosmic_Microwave_Background_Anisotropies_in_Closed_Friedmann-Robertson-Walker_Models","264048989_A_Universal_Model_for_Halo_Concentrations","261672997_A_25_measurement_of_the_growth_rate_from_small-scale_redshift_space_clustering_of_SDSS-III_CMASS_galaxies","253249050_Mass_Function_Predictions_Beyond_LambdaCDM","244958236_A_Line-of-Sight_Integration_Approach_to_Cosmic_Microwave_Background_Anisotropies"]}