{"id":"303956464_PSS_Design_Considering_Feedback_from_the_Entire_Product-service_Lifecycle_and_Social_Media","abstract":"In the globally competitive market landscape, companies, in order to remain sustainable, must shift their focus towards constantly improving their PSS offerings by incorporating lean thinking approaches. PSS are complex, dynamic, and multi-dimensional systems, which are supported by appropriate infrastructure and networks. At the same time, PSS require robust engineering methods and tools for their design, which allow multi-dimensional exchange of knowledge between the designers and the relevant stakeholders across the value chain. Currently, enabling technologies such as Cloud technology, social media and networking, knowledge management, and context sensitivity present new possibilities to enhance the knowledge exchange and the collaborative process of PSS design. These technologies allow the gathering and analysis of big volumes of data from scattered heterogeneous IT systems and, at the same time, allow PSS design improvements by processing the experiences of the business customers, consumers, designers, shop-floor, and provide feedback to the design phase. However, a number of challenges are encountered during the gathering, visualization, monitoring, and assessment of related data, such as the lack of context sensitivity. Simultaneously, PSS evaluation approaches are still immature and there is limited work that correlates the impact of the entire PSS lifecycle with the performance assessment of the PSS design. The present work includes a review of the aforementioned technologies from academic, market, and industrial perspectives. Based on an extensive literature review and on constructive discussions with three European SMEs, several barriers and limitations of adopting the aforementioned technologies in practice are identified. Finally, a conceptual eco-innovative framework for lean PSS design is presented, explaining how these technologies could be combined for the improvements of PSS design and evaluation procedures.","authors":["Dimitris Mourtzis","Sophia Fotia","Marta Gamito","Rui Neves-Silva"],"meta":["December 2016Procedia CIRP 47:156-161","DOI:10.1016/j.procir.2016.03.092","Project: DIVERSITY"],"references":["306071426_Classification_and_Mapping_of_PSS_Evaluation_Approaches","304777303_Generic_Self-Learning_Context_Sensitive_Solution_for_Adaptive_Manufacturing_and_Decision_Making_Systems","300518735_An_Evaluation_Scheme_for_Product-Service_System_Models_with_a_Lifecycle_Consideration_from_Customer's_Perspective","295402769_Optimal_Machining_Parameter_Selection_Based_on_Real-Time_Machine_Monitoring_Using_IEC_61499_Function_Blocks_for_Use_in_a_Cloud_Manufacturing_Environment_A_Case_Study_for_Face_Milling","294890426_Classification_and_Mapping_of_PSS_Evaluation_Approaches","294890156_Cloud-based_Cyber_physical_systems_and_Quality_of_Services","289497248_Challenges_and_future_perspectives_for_the_life_cycle_of_manufacturing_networks_in_the_mass_customisation_era","281115948_Performance_Indicators_for_the_Evaluation_of_Product-Service_Systems_Design_A_Review","298431401_Cloud_manufacturing_service_platform_for_small_and_medium_enterprises","276378153_Cloud-Based_Platform_for_Optimal_Machining_Parameter_Selection_Based_on_Function_Blocks_and_Real-Time_Monitoring"]}