{"id":"303943002_A_Framework_for_Computational_Thinking_Based_on_a_Systematic_Research_Review","abstract":"Computational Thinking (CT) has become popular in recent years and has been recognised as an essential skill for all, as members of the digital age. Many researchers have tried to define CT and have conducted studies about this topic. However, CT literature is at an early stage of maturity, and is far from either explaining what CT is, or how to teach and assess this skill. In the light of this state of affairs, the purpose of this study is to examine the purpose, target population, theoretical basis, definition, scope, type and employed research design of selected papers in the literature that have focused on computational thinking, and to provide a framework about the notion, scope and elements of CT. In order to reveal the literature and create the framework for computational thinking, an inductive qualitative content analysis was conducted on 125 papers about CT, selected according to pre-defined criteria from six different databases and digital libraries. According to the results, the main topics covered in the papers composed of activities (computerised or unplugged) that promote CT in the curriculum. The targeted population of the papers was mainly K-12. Gamed-based learning and constructivism were the main theories covered as the basis for CT papers. Most of the papers were written for academic conferences and mainly composed of personal views about CT. The study also identified the most commonly used words in the definitions and scope of CT, which in turn formed the framework of CT. The findings obtained in this study may not only be useful in the exploration of research topics in CT and the identification of CT in the literature, but also support those who need guidance for developing tasks or programs about computational thinking and informatics.","authors":["Filiz Kalelioglu","Yasemin Gulbahar","Volkan Kukul"],"meta":["May 2016"],"references":["303239675_Bebras_-_a_Sustainable_Community_Building_Model_for_the_Concept_Based_Learning_of_Informatics_and_Computational_Thinking","289492690_RaBit_EscAPE_a_board_game_for_computational_thinking","274309848_Computational_Thinking","273772180_Computational_Thinking_in_K-9_Education","301413053_Embedded_standards-based_digital_gaming_assessments_Pilot_study_with_teachers","288484782_Computational_Thinking_Code_Complexity_and_Prior_Experience_in_a_Videogame-Building_Assignment","286873961_The_TangibleK_robotics_program_Applied_computational_thinking_for_young_children","286704874_Teaching_mode_reform_and_exploration_on_the_University_Computer_Basic_based_on_Computational_thinking_training_in_Network_Environment","282748526_Integrating_computational_thinking_across_the_K-8_curriculum","266562898_Review_on_teaching_and_learning_of_computational_thinking_through_programming_What_is_next_for_K-12"]}