{"id":"303921824_Community_Structure_in_Industrial_SAT_Instances","abstract":"Modern SAT solvers have experienced a remarkable progress on solving industrial instances. Most of the techniques have been developed after an intensive experimental process. It is believed that these techniques exploit the underlying structure of industrial instances. However, there are few works trying to exactly characterize the main features of this structure. The research community on complex networks has developed techniques of analysis and algorithms to study real-world graphs that can be used by the SAT community. Recently, there have been some attempts to analyze the structure of industrial SAT instances in terms of complex networks, with the aim of explaining the success of SAT solving techniques, and possibly improving them. In this paper, inspired by the results on complex networks, we study the community structure, or modularity, of industrial SAT instances. In a graph with clear community structure, or high modularity, we can find a partition of its nodes into communities such that most edges connect variables of the same community. In our analysis, we represent SAT instances as graphs, and we show that most application benchmarks are characterized by a high modularity. On the contrary, random SAT instances are closer to the classical Erd\\\"os-R\\'enyi random graph model, where no structure can be observed. We also analyze how this structure evolves by the effects of the execution of the SAT solver. We detect that new clauses learnt by the solver during the search contribute to destroy the original community structure of the formula. This partially explains the distinct performance of SAT solvers on random and industrial SAT instances.","authors":["Carlos Ansótegui","Maria Luisa Bonet","Jesús Giráldez-Cru","Jordi Levy"],"meta":["June 2016Journal of Artificial Intelligence Research 66","DOI:10.1613/jair.1.11741"],"references":["303370779_Structure-Preserving_Instance_Generation","300349278_Using_Community_Structure_to_Detect_Relevant_Learnt_Clauses","281317160_SATGraf_Visualizing_the_Evolution_of_SAT_Formula_Structure_in_Solvers","277325988_A_Modularity-based_Random_SAT_Instances_Generator","311344563_Finding_community_structure_in_very_large_networks","303846486_Generating_SAT_instances_with_community_structure","286195972_Constraint_Processing","284411763_An_extensible_SAT-solver","276211380_Exploiting_Resolution-Based_Representations_for_MaxSAT_Solving","266966129_Community_Branching_for_Parallel_Portfolio_SAT_Solvers"]}