{"id":"303939858_An_Effective_Approach_to_Enhancing_Compiler_Error_Messages","abstract":"One of the many challenges novice programmers face from the time they write their first program is inadequate compiler error messages. These messages report details on errors the programmer has made and are the only feedback the programmer gets from the compiler. For students they play a particularly essential role as students often have little experience to draw upon, leaving compiler error messages as their primary guidance on error correction. However these messages are frequently inadequate, presenting a barrier to progress and are often a source of discouragement. We have designed and implemented an editor that provides enhanced compiler error messages and conducted a controlled empirical study with CS1 students learning Java. We find a reduced frequency of overall errors and errors per student. We also identify eight frequent compiler error messages for which enhancement has a statistically significant effect. Finally we find a reduced number of repeated errors. These findings indicate fewer students struggling with compiler error messages.","authors":["Brett A Becker"],"meta":["March 2016","DOI:10.1145/2839509.2844584","Conference: 47th ACM Technical Symposium on Computer Science Education (SIGCSE 2016)At: Memphis Tennessee"],"references":["308890128_An_Exploration_of_the_Effects_of_Enhanced_Compiler_Error_Messages_for_Computer_Programming_Novices","283765943_37_Million_Compilations_Investigating_Novice_Programming_Mistakes_in_Large-Scale_Student_Data","280314826_Meaningful_Categorisation_of_Novice_Programmer_Errors","266657038_Enhancing_syntax_error_messages_appears_ineffectual","265199005_An_Exploration_of_Novice_Compilation_Behaviour_in_BlueJ","261133938_Blackbox_A_Large_Scale_Repository_of_Novice_Programmers'_Activity","254004572_Mind_your_language_On_novices'interactions_with_error_messages","265757295_SNOOPIE_DEVELOPMENT_OF_A_LEARNING_SUPPORT_TOOL_FOR_NOVICE_PROGRAMMERS_WITHIN_A_CONCEPTUAL_FRAMEWORK","262321546_BlueFix_Using_Crowd-Sourced_Feedback_to_Support_Programming_Students_in_Error_Diagnosis_and_Repair","262256894_An_Empirical_Investigation_into_Programming_Language_Syntax"]}