{"id":"303999642_Novel_application_of_a_quantitative_spatial_comparison_tool_to_species_distribution_data","abstract":"Comparing geographically referenced maps has become an important aspect of spatial ecology (e.g. assessing change in distribution over time). Whilst humans are adept at recognising and extracting structure from maps (i.e. identifying spatial patterns), quantifying these structures can be difficult. Here, we show how the Structural Similarity (SSIM) index, a spatial comparison method adapted from techniques developed in computer science to determine the quality of image compression, can be used to extract additional information from spatial ecological data. We enhance the SSIM index to incorporate uncertainty from the underlying spatial models, and provide a software algorithm to correct for internal edge effects so that loss of spatial information from the map comparison is limited. The SSIM index uses a spatially-local window to calculate statistics based on local mean, variance, and covariance between the maps being compared. A number of statistics can be calculated using the SSIM index, ranging from a single summary statistic to quantify similarities between two maps, to maps of similarities in mean, variance, and covariance that can provide additional insight into underlying biological processes. We demonstrate the applicability of the SSIM approach using a case study of sperm whales in the Mediterranean Sea and identify areas where local-scale differences in space-use between groups and singleton whales occur. We show how novel insights into spatial structure can be extracted, which could not be obtained by visual inspection or cell-by-cell subtraction. As an approach, SSIM is applicable to a broad range of spatial ecological data, providing a novel, implementable tool for map comparison.","authors":["Esther Jones","Luke Rendell","Enrico Pirotta","Jed A. Long"],"meta":["November 2016Ecological Indicators 70:67-76","DOI:10.1016/j.ecolind.2016.05.051"],"references":["307855254_How_maps_work_Representation_Visualization_Design","291823262_Effects_of_changing_scale_on_landscape_pattern_analysis_scaling_relations","278413047_Using_ecological_models_to_assess_ecosystem_status_in_support_of_the_European_Marine_Strategy_Framework_Directive","312771295_Image_quality_assessment_From_error_visibility_to_structural_similarity","308748921_Spatial_analysis_a_guide_for_ecologists","299269998_Environmental_niche_equivalency_versus_conservatism_quantitative_approaches_to_niche_evolution_vol_62_pg_2868_2008","285999067_Spatial_Analysis_A_Guide_for_Ecologist","283688530_The_sperm_whale_Social_females_and_roving_males","279565375_Local_measures_of_spatial_association","273474454_Resource_selection_modeling_reveals_potential_conflicts_involving_reintroduced_lions_in_Tembe_Elephant_Park_South_Africa","260306746_Assessing_Quality_of_Spatial_Models_Using_the_Structural_Similarity_Index_and_Posterior_Predictive_Checks","259652500_Status_and_Ecological_Effects_of_the_World's_Largest_Carnivores","273052505_Spatial_Autocorrelation_A_Review_of_Existing_and_New_Measures_with_Applications","263511061_Uncertainty_associated_with_survey_design_in_Species_Distribution_Models","262012144_Landscape_metrics_as_indicators_of_coastal_morphology_A_multi-scale_approach"]}