{"id":"303992986_Optimization_Methods_for_Large-Scale_Machine_Learning","abstract":"This paper provides a review and commentary on the past, present, and future of numerical optimization algorithms in the context of machine learning applications. Through case studies on text classification and the training of deep neural networks, we discuss how optimization problems arise in machine learning and what makes them challenging. A major theme of our study is that large-scale machine learning represents a distinctive setting in which the stochastic gradient (SG) method has traditionally played a central role while conventional gradient-based nonlinear optimization techniques typically falter. Based on this viewpoint, we present a comprehensive theory of a straightforward, yet versatile SG algorithm, discuss its practical behavior, and highlight opportunities for designing algorithms with improved performance. This leads to a discussion about the next generation of optimization methods for large-scale machine learning, including an investigation of two main streams of research on techniques that diminish noise in the stochastic directions and methods that make use of second-order derivative approximations.","authors":["Léon Bottou","Frank E. Curtis","Jorge Nocedal"],"meta":["June 2016SIAM Review 60(2)","DOI:10.1137/16M1080173"],"references":["319770239_Identifying_and_attacking_the_saddle_point_problem_in_high-dimensional_non-convex_optimization","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","313501588_Accelerating_stochastic_gradient_descent_using_predictive_variance_reduction","313060232_Learning_Internal_Representations_by_Error_Propagation","313001335_De-noising_by_soft_thresholding","312973075_The_tradeoffs_of_large_scale_learning","312628419_On_automatic_differentiation","312538118_Support-vector_networks","311609041_Deep_Residual_Learning_for_Image_Recognition","309698218_1983_Numerical_methods_for_unconstrained_optimization_and_nonlinear_equations_Prentice-Hall"]}