{"id":"303907275_Graph_isomorphism_in_quasipolynomial_time_extended_abstract","abstract":"We show that the Graph Isomorphism (GI) problem and the more general problems of String Isomorphism (SI) andCoset Intersection (CI) can be solved in quasipolynomial(exp((logn)O(1))) time. The best previous bound for GI was exp(O( √n log n)), where n is the number of vertices (Luks, 1983); for the other two problems, the bound was similar, exp(O~(√ n)), where n is the size of the permutation domain (Babai, 1983). Following the approach of Luks’s seminal 1980/82 paper, the problem we actually address is SI. This problem takes two strings of length n and a permutation group G of degree n (the “ambient group”) as input (G is given by a list of generators) and asks whether or not one of the strings can be transformed into the other by some element of G. Luks’s divide-and-conquer algorithm for SI proceeds by recursion on the ambient group. We build on Luks’s framework and attack the obstructions to efficient Luks recurrence via an interplay between local and global symmetry. We construct group theoretic “local certificates” to certify the presence or absence of local symmetry, aggregate the negative certificates to canonical k-ary relations where k = O(log n), and employ combinatorial canonical partitioning techniques to split the k-ary relational structure for efficient divide-and- conquer. We show that in a well–defined sense, Johnson graphs are the only obstructions to effective canonical partitioning. The central element of the algorithm is the “local certificates” routine which is based on a new group theoretic result, the “Unaffected stabilizers lemma,” that allows us to construct global automorphisms out of local information.","authors":["László Babai"],"meta":["June 2016","DOI:10.1145/2897518.2897542","Conference: the 48th Annual ACM SIGACT Symposium"],"references":["316799358_Graduate_Texts_in_Mathematics","259657745_Hardness_of_Robust_Graph_Isomorphism_Lasserre_Gaps_and_Asymmetry_of_Random_Graphs","247372464_A_reduction_of_a_Graph_to_a_Canonical_Form_and_an_Algebra_Arising_during_this_Reduction_in_Russian","222741910_On_the_orders_of_doubly_transitive_permutation_groups_elementary_estimates","220530479_Isomorphism_Testing_Perspective_and_Open_Problems"]}