{"id":"303956210_Bayesian_Networks-based_Association_Rules_and_Knowledge_Reuse_in_Maintenance_Decision-Making_of_Industrial_Product-Service_Systems","abstract":"Equipment manufacturing firms nowadays increasingly provide Industrial Product-Service Systems (IPS2) to improve productivity and service capacity, particularly in the current age of big data. Vast amounts of data are collected using database management systems from areas of product design, manufacturing, marketing, fault detection and maintenance service of IPS2. An urgent challenge in context of IPS2 is how to form reusable knowledge taking advantage of these data records for the sake of guiding subsequent maintenance decision-making. To handle this issue, data mining technology has been used in knowledge acquisition from different databases. However, it needs further investigation how to represent and reuse knowledge mining from these databases in IPS2 in relation to maintenance decision-making. Given this observation, this study first presents association rules in the form of Bayesian Networks that are mined from different databases of IPS2 and can be used to represent knowledge acquired. It then establishes a knowledge reuse framework based on Bayesian inference, which is used to support related decision-making in maintenance operations. Lastly, the proposed methodology is applied to a real-world case in an agricultural equipment manufacturing enterprise. The experimental results using real-time data sets illustrate the effectiveness of the proposed methodology in handling maintenance decision-making associated with related fault phenomena.","authors":["Shasha Xiao","Yaoguang Hu","Jialin Han","Rui Zhou"],"meta":["December 2016Procedia CIRP 47:198-203","DOI:10.1016/j.procir.2016.03.046","Project: Research on maintenance service network designing and service scheduling oriented dynamic moving and geographically distributed machinery"],"references":["262447807_Ontology_Issues_and_Applications_Guest_Editors'_Introduction","220838550_Exploiting_Association_and_Correlation_Rules_-_Parameters_for_Improving_the_K2_Algorithm","316600283_Data_Mining_Concepts_and_Techniques","284886316_Fusion_Propagation_and_Structuring_in_Belief_Networks","260114732_Generating_Knowledge_in_Maintenance_from_Experience_Feedback","257798807_A_data_mining_model_to_identify_inefficient_maintenance_activities","257479714_An_Agent-Based_Knowledge_Discovery_from_Databases_applied_in_Healthcare_domain","252012405_The_research_of_data_mining_in_AHM_technology_based_on_association_rule","221900819_Discovering_Knowledge_in_Data_An_Introduction_to_Data_Mining","220688045_Experience_Management_Foundations_Development_Methodology_and_Internet-Based_Applications"]}