{"id":"303989046_Utilisation_de_l'environnement_WIMS_dans_l'enseignement_des_mathematiques_au_secondaire_Probleme_de_formation_et_de_perception_de_l'utilite","abstract":"http://www.adjectif.net/spip/spip.php?article412\n\nABSTRACT: Nowadays, in order to render a student much more active and to improve his knowledge in mathematics in order to be an independent learner, teachers are encouraged to include educative software such as WIMS in theirs pedagogic works and activities. Our studies or investigation are aimed at discovering if the lack of adequate formation and the low level of understanding of this software (WIMS), somehow affects the teaching of mathematics in the various colleges of Cameroon (precisely Yaoundé for a start), which constitute a wider handicap. After haven had collaborative training sessions, from distant places, with three (03) promotions of teachers on field formed, our analysis of the different results do incite us to keep watch and be prudent and attentive, if we intend to implement such collaborative methods to or with various groups of teachers, through online computerized software, there permitting the growth in the actions of various tutors.\n\nKEYWORDS : Collaborative studies, pedagogic practices, behavior, students profile\n\nRÉSUMÉ: De nos jours, pour rendre l'apprenant plus actif et accroître son niveau en mathématiques tout en développant des modes d'apprentissage en situation d'autonomie, les enseignants sont encouragés à intégrer les logiciels éducatifs comme WIMS dans leurs tâches pédagogiques. Notre étude consiste à voir si le manque de formation adéquate et la faible perception de l'utilité de l'environnement WIMS dans l'enseignement des mathématiques par les enseignants des lycées au Cameroun (précisément à Yaoundé pour un début) constitue l'un des handicaps pour une utilisation motivante et efficace de cet outil logiciel dans les pratiques pédagogiques. Après examen de sessions collaboratives à distance au travers de trois premières promotions d'enseignants de terrains formés, notre analyse des résultats nous incite à rester prudents quand il est envisagé d'appliquer ce modèle collaboratif à des cohortes nombreuses en utilisant des outils informatiques en ligne permettant de démultiplier l'action des tuteurs.","authors":["Louis Pascal Nono Tchatouo","kouakep tchaptchie yannick"],"meta":["December 2016"],"references":["242085520_L'analyse_inductive_generale_Description_d'une_demarche_visant_a_donner_un_sens_a_des_donnees_brutes","36380409_La_technologie_au_service_de_pratiques_d'apprentissage_differenciees_la_plateforme_WIMS_utilisation_en_premier_cycle_universitaire","32231361_Analyse_de_fichiers_de_traces_d'etudiants_aspects_didactiques","36379788_Wims_un_serveur_interactif_d'exercices_de_Mathematiques"]}