{"id":"303914163_Academy_of_Management_Journal_1958-2014_a_citation_analysis","abstract":"This paper provides a citation network analysis of publications from the Academy of Management Journal, one of the key US-based journals in the field of Management. Our analysis covers all publications in the journal from 1958–2014. This represents the entire history of the journal until the arbitrary cut-off point of our study. The paper analyses the most published authors, most cited articles, most cited authors, top institutions, and the nationalities of authors that are most represented in the journal. 2304 articles containing 114,550 references were taken from the primary data source, the Web of Science™. An analysis of 114,550 citations was carried out using the Web of Science™ online analytics tool and Excel®. Gephi™, a data visualisation and manipulation software, was used to provide a visual representation of the citation networks. Results indicate that the most published authors within AMJ throughout the journal’s history are Ivancevich, Golembiewski and Hambrick. The three most cited authors within AMJ are Pfeffer, Porter and Thompson. The single most cited article is Pfeffer and Salancik’s 1978 article The external control of organizations: a resource dependence perspective. A keyword analysis revealed that the most important terms used in the journal’s history were ‘Performance’, ‘Organization’ and ‘Work’. Results from this paper extend our previous citation analyses of key journals in the discipline of Higher Education to a new discipline—the field of Management. The paper provides evidence of how visual analyses can help to represent the citation “geography” of a journal over time.","authors":["Angelito Calma","Martin Davies"],"meta":["June 2016Scientometrics 108(2)","DOI:10.1007/s11192-016-1998-y","Project: Discipline-geography through citation analysis"],"references":["285111997_Using_network_analysis_to_explore_co-occurrence_patterns_in_soil_microbial_communities","267214006_Studies_in_Higher_Education_1976-2013_A_Retrospective_using_Citation_Network_Analysis","262283958_Looking_at_the_gap_between_social_psychological_and_psychodynamic_perspectives_on_group_dynamics_historically","321598540_Simulating_Knowledge_Dynamics_in_Innovation_Networks","303914028_Research_methodologies_and_publication_trends_in_manufacturing_strategy_A_content_analysis_based_literature_review","295859996_Simulating_Knowledge_Dynamics_in_Innovation_Networks","276883871_Research_methodologies_and_publication_trends_in_manufacturing_strategy","274693503_The_Intellectual_Link_Between_Management_Research_and_Popularization_Media_A_Bibliometric_Analysis_of_the_Harvard_Business_Review","267513173_General_cargo_and_containership_emergent_routes_A_complex_networks_description","263245340_To_what_extent_do_articles_published_in_other_than_top_journals_have_impact_on_marketing"]}