{"id":"304025554_Finite_element_analysis_of_the_frictional_wheel-rail_rolling_contact_using_explicit_and_implicit_methods","abstract":"A three-dimensional finite element rolling contact model between wheel and rail with increased spin effect is developed in this paper to study the normal and the tangential contact problems, as well as the creep force characteristics in elasticity and in elasto-plasticity. Three finite element analyses using the explicit and the implicit integration scheme are employed and the finite element solution is compared to the solution of the CONTACT software in elasticity. The elastic solution with the implicit methods is sensitive to the energy dissipation related to the time increment size. The optimum time increment size is found as a compromise between computational efficiency and calculation accuracy. The numerical results show a good agreement between the finite element methods and CONTACT for the normal and the tangential contact solution. The initial slopes of the creep force characteristics in the longitudinal and the lateral direction from the implicit solution are slightly lower than the results from CONTACT. When the elasto-plastic material behavior is applied, the maximum contact pressure and the von Mises stresses are reduced for both explicit and implicit methods and the plastic deformation occurs in all the contact area. The contact patch becomes egg shaped instead of the elliptic and the area of stick zone area increases. In addition, the initial slopes of the creepage-creep force curves are reduced by 15% in the longitudinal direction and by 13% in the lateral direction.","authors":["Moncef Toumi","Hugues Chollet","Honoré Yin"],"meta":["June 2016Wear 366","DOI:10.1016/j.wear.2016.06.008","Project: CERVIFER"],"references":["261715204_Numerical_modeling_of_measured_railway_creep_versus_creep-force_curves_with_CONTACT","259507592_Third_body_layer_-_Experimental_results_and_a_model_describing_its_influence_on_the_traction_coefficient","252393945_Contact_of_Nonspherical_Elastic_Bodies_Transmitting_Tangential_Forces","251502272_Three-dimensional_elastic-plastic_stress_analysis_of_wheel-rail_rolling_contact","248325167_Assessment_of_methods_for_calculating_contact_pressure_in_wheel-railswitch_contact","243679558_On_the_Action_of_a_Locomotive_Driving_Wheel","241077867_The_solution_of_frictional_wheel-rail_rolling_contact_with_a_3D_transient_finite_element_model_Validation_and_error_analysis","240298925_The_Effect_of_a_Tangential_Contact_Force_Upon_the_Rolling_Motion_of_an_Elastic_Sphere_on_a_Plane","232911061_A_Fast_Algorithm_for_the_Simplified_Theory_of_Rolling_Contact","227661765_Improved_Numerical_Dissipation_for_Time_Integration_Algorithms_in_Structural_Dynamics","226135084_Oberdie_Partiellen_Differengleichurgen_der_Mathematishen_Physik","224104832_On_the_Partial_Difference_Equations_of_Mathematical_Physics"]}