{"id":"304006011_Assessing_Intercultural_Competence_in_Higher_Education_Existing_Research_and_Future_Directions","abstract":"The modern wave of globalization has created a demand for increased intercultural competence (ICC) in college graduates who will soon enter the 21st-century workforce. Despite the wide attention to the concepts and assessment of ICC, few assessments meet the standards for a next-generation assessment in areas of construct clarity, innovative item types, response processes, and validity evidence. The objectives of this report are to identify current conceptualizations of ICC, review existing assessments and their validity evidence, propose a new framework for a next-generation ICC assessment, and discuss key assessment considerations. To summarize, we found the current state of the literature to be murky in terms of the clarity of the ICC construct. Definitions of the construct vary considerably as to whether it is a trait, skill, or performance outcome. In addition, current measurements of ICC overly rely on self-report methods, which have a number of flaws that result in less than optimal assessment. In this paper, we propose a new framework based on a model of the social thinking process developed by Grossman and colleagues that describes the knowledge, skills, and abilities that promote success in complex social situations. From this social process model, as well as Earley and Peterson's definition of ICC (a person's capability to gather, interpret, and act upon these radically different cues to function effectively across cultural settings or in a multicultural situation), three stages are developed: approach, analyze, and act. Guided by this framework, we discuss assessment considerations such as innovative task types and multiple response formats to help translate the framework to an assessment of ICC.","authors":["Richard L. Griffith","Leah Wolfeld","Brigitte K. Armon","Joseph A. Rios"],"meta":["June 2016ETS Research Report Series 2016(2)","DOI:10.1002/ets2.12112"],"references":["301667539_What's_your_CQ_A_thought_leadership_exploration_of_cultural_intelligence_in_contemporary_institutions_of_higher_learning","290192472_Forced-Choice_Five_Factor_Markers_personality_questionnaire","325698209_Use_of_situational_judgment_tests_to_predict_job_performance_A_clarification_of_the_literature","319336550_Cross-Cultural_Adaptability_Inventory","317953621_Towards_Ethnorelativism_A_Developmental_Model_of_Intercultural_Sensitivity","313559817_The_development_of_a_new_instrument_of_intercultural_communication_competence","313381103_Competence_training_for_medical_students_in_Austria_Dorli_Kahr-Gottlieb","307812283_Intercultural_Communication_Competence_A_Synthesis","303250146_Research_methods_in_psychology","290298226_An_evaluation_of_the_effect_of_response_formats_on_data_quality_in_web_surveys"]}