{"id":"304020544_How_Do_Students_'Really'_Interact_with_Virtual_Worlds_-_The_Influence_of_Proper_Induction_for_Virtual_Interactions","abstract":"Our ongoing research focuses on the ways that interactions affect learner engagement with a virtual world and, consequently, the educational activities that take place within it when a hybrid learning approach is used. It aims to form a complete taxonomy of the types of interactions that can lead to the development of engaging and interactive learning experiences. In this paper, we examine the impact that the orientation (induction) process has on learner engagement by observing a cohort of postgraduate students while using an OpenSim-based institutionally hosted virtual world. The results of our study highlight that educators and instructors need to plan their in-world learning activities very carefully and with a focus on interactions if engaging activities are what they want to offer their students. Additionally, it seems that student interactions with the content of the virtual world and the in-class student-to-student interactions have stronger impact on student engagement when hybrid methods are used. We confirm and further enhance our hypothesis investigating student feelings and thoughts about the interaction taking place within a virtual world when that is used in higher education.","authors":["Athanasios Christopoulos","Marc Conrad","Mitul Shukla"],"meta":["January 2016","DOI:10.5220/0005755700430054","Conference: 8th International Conference on Computer Supported Education"],"references":["266347691_The_Avatar_as_a_Knowledge_Worker_How_Immersive_3D_Virtual_Environments_may_Foster_Knowledge_Acquisition","261647197_A_Platform_for_Teaching_Logic_Programming_Using_Virtual_Worlds","261522296_Second_life_is_not_an_island","261027588_End-user_programming_deconstrutionalism_for_collaborative_mixed_reality_laboratory_co-creative_activities","258513919_Views_of_Educators_on_Immersion_in_Virtual_Worlds_from_Second_Life_to_OpenSim","257765038_A_case_study_inside_virtual_worlds_Use_of_analytics_for_immersive_spaces","252980570_Learning_in_Technology_Reconceptualizing_Immersive_Environments","338950489_Of_mice_or_men_-_The_avatar_in_the_virtualscape","271831938_Research_Methods_in_Education","251979867_Study_on_building_a_3D_interactive_virtual_learning_environment_based_on_OpenSim_platform"]}