{"id":"304017360_Development_and_validations_of_a_deformable_registration_algorithm_for_medical_images_Applications_to_brain_breast_and_prostate_studies","abstract":"This dissertation presents work on deformable registration of medical images. Deformable registration is a fundamental problem in medical image computing, and is central in analytic methods for understanding population trends of imaging phenotypes, for measuring longitudinal change, for fusing multi-modality information, and for capturing structure-function correlations. ^ Despite over 20 years of extensive research and technology innovations, two limitations still exist in the literature of image registration, which are central in this dissertation. The first one is the ambiguity in determining anatomical correspondences between images. This is caused by the fact that most registration methods match images based on image intensities. However, intensity alone does not necessarily represent the anatomical or geometric context in the images. The second challenge is the problem of missing correspondences. This arises from the presence of pathologies in images, whose correspondences are not present in the images of healthy subjects. Moreover, many registration methods are fine-tuned to a particular problem, thereby losing generality. The proposed work contributes towards overcoming these limitations. It reduces ambiguity by matching voxels based on their geometric contexts instead of intensities alone. It handles missing correspondences by a newly developed mutual-saliency metric, which automatically identifies the regions having difficulty finding correspondences in the other image, and reduces their negative impact. The proposed method is designed in a general way in that it does not rely on any task-specific annotations of tissue, structure or feature points. ^ Extensive experiments are presented to demonstrate generality, accuracy and robustness, which are the key properties of the proposed method. Experiments involve images of various organs (brain, breast, heart) in various registration settings (cross-subject, longitudinal) on various public and in-house datasets, and include quantitative comparisons with many state-of-the-art methods. ^ To demonstrate the wide application of the proposed method in clinical and research studies, five topics utilizing the proposed method are presented. They are examples of population studies, longitudinal studies, and atlas-based segmentations. ^ The proposed method is fully-implemented, extensively-tested and publicly-released to meet the growing needs of many large-scale clinical and academic studies.","authors":["Yangming Ou"],"meta":["January 2012"],"references":[]}