{"id":"304009364_Qualitative_dynamics_semantics_for_SBGN_process_description","abstract":"Background\nQualitative dynamics semantics provide a coarse-grain modeling of networks dynamics by abstracting away kinetic parameters. They allow to capture general features of systems dynamics, such as attractors or reachability properties, for which scalable analyses exist. The Systems Biology Graphical Notation Process Description language (SBGN-PD) has become a standard to represent reaction networks. However, no qualitative dynamics semantics taking into account all the main features available in SBGN-PD had been proposed so far. ResultsWe propose two qualitative dynamics semantics for SBGN-PD reaction networks, namely the general semantics and the stories semantics, that we formalize using asynchronous automata networks. While the general semantics extends standard Boolean semantics of reaction networks by taking into account all the main features of SBGN-PD, the stories semantics allows to model several molecules of a network by a unique variable. The obtained qualitative models can be checked against dynamical properties and therefore validated with respect to biological knowledge. We apply our framework to reason on the qualitative dynamics of a large network (more than 200 nodes) modeling the regulation of the cell cycle by RB/E2F. Conclusion\nThe proposed semantics provide a direct formalization of SBGN-PD networks in dynamical qualitative models that can be further analyzed using standard tools for discrete models. The dynamics in stories semantics have a lower dimension than the general one and prune multiple behaviors (which can be considered as spurious) by enforcing the mutual exclusiveness between the activity of different nodes of a same story. Overall, the qualitative semantics for SBGN-PD allow to capture efficiently important dynamical features of reaction network models and can be exploited to further refine them.","authors":["Adrien Rougny","Christine Froidevaux","Laurence Calzone","Loïc Paulevé"],"meta":["December 2016BMC Systems Biology 10(1)","DOI:10.1186/s12918-016-0285-0"],"references":["281567384_Characterization_of_Reachable_Attractors_Using_Petri_Net_Unfoldings","279256940_Formal_Methods_for_Modeling_Biological_Regulatory_Networks","272188226_Integrative_Analysis_of_Metabolic_Models_-_from_Structure_to_Dynamics","270565283_Model_Checking_to_Assess_T-Helper_Cell_Plasticity","321595464_Unfoldings_A_Partial-Order_Approach_to_Model_Checking","300549164_Model-Based_Investigation_of_the_Effect_of_the_Cell_Cycle_on_the_Circadian_Clock_Through_Transcription_Inhibition_During_Mitosis","288233308_Boolean_formalisation_of_genetic_control_circuits","285842809_Petri_Nets_Properties_Analysis_and_Applications","281578022_Comprehensive_pathway_map_of_epidermal_growth_factor_receptor_signaling","273524887_Component_identification_in_biochemical_pathways"]}