{"id":"304023708_Un_modele_formel_de_jeux_serieux_de_type_etude_de_cas_pour_l'enseignement_superieur_le_modele_DISCO","abstract":"Cet article propose un modèle formel de jeux sérieux utilisable et compréhensible par les enseignants du supérieur. Depuis quelques années ces derniers sont confrontés à de multiples évolutions de leur métierdues à des facteurs divers : nouvelles générations d’étudiants connectés, apparition des MOOC ou encore usage des jeux sérieux. Ces derniers ont fait l’objet de nombreux appels d’offres ou d’appels à projets dans l’enseignement supérieur, mais leur usage est restreint en dehors des pionniers toujours en quête de renouveau. De fait, les outils facilitant leur création et leur usage manquent, en particulier à destination des enseignants. Cet article présente une famille de jeux sérieux de type études de cas conçus de manière empirique. Pour dépasser cet aspect empirique, nous extrayons un modèle formel de jeux sérieux et une méthodologie impliquant fortement les enseignants au processus de création. Nous souhaitons ainsi améliorer à la fois l’étape de conception mais aussi l’usage des jeux sérieux produits par les enseignants et leurs étudiants. Ce modèle, baptisé DISCO, sera la base d’un travail suivi d’une démarche expérimentale prenant en compte le contexte de travail des enseignants et dont les premiers jalons sont donnés ici.","authors":["Mathieu Vermeulen"],"meta":["June 2016","Conference: RJC-EIAH'2016At: Montpellier"],"references":["283846831_DU_JEU_VIDEO_AU_SERIOUS_GAME_Approches_culturelle_pragmatique_et_formelle","279224718_De_l'industrialisation_a_l'innovation_pedagogique_avec_une_chaine_editoriale","279213568_LES_ECSPER_RETOUR_D'EXPERIENCE_D'UNE_ETUDE_DE_CAS_DE_TYPE_SERIOUS_GAME_EN_GESTION_DE_PROJET","274665131_Demarche_centree_utilisateur_pour_une_ingenierie_de_langages_de_modelisation_de_qualite","271354870_Jeux_serieux_et_pedagogie_universitaire_de_la_conception_a_l'evaluation_des_apprentissages","271202761_Implementation_de_patrons_de_conception_pour_l'adaptation_des_parcours_pedago-ludiques_dans_les_jeux_serieux","282061732_Designed-Based_Research_and_Technology_Enhanced_Learning_Environments","281566127_Modeles_pour_la_conception_de_Learning_Role-Playing_Games_en_formation_professionnelle","281049878_Learning_Role-Playing_Games_methodologie_et_formalisme_de_description_pour_l'assistance_a_la_conception_-_Premiers_resultats_d'experimentation","275317542_Casing_Casemethod_Methods"]}