{"id":"304034459_Age-Related_Reduction_of_Recovery_Sleep_and_Arousal_Threshold_in_Drosophila","abstract":"Study objectives: \nPhysiological studies show that aging affects both sleep quality and quantity in humans, and sleep complaints increase with age. Along with knowledge about the negative effects of poor sleep on health, understanding the enigmatic relationship between sleep and aging is important. Because human sleep is similar to Drosophila (fruit fly) sleep in many ways, we addressed the effects of aging on sleep in this model organism.\n\nMethods: \nBaseline sleep was recorded in five different Drosophila genotypes raised at either 21°C or 25°C. The amount of sleep recovered was then investigated after a nighttime of sleep deprivation (12 h) and after chronic sleep deprivation (3 h every night for multiple nights). Finally, the effects of aging on arousal, namely, sensitivity to neuronal and mechanical stimuli, were studied.\n\nResults: \nWe show that fly sleep is affected by age in a manner similar to that of humans and other mammals. Not only do older flies of several genotypes have more fragmented sleep and reduced total sleep time compared to young flies, but older flies also fail to recover as much sleep after sleep deprivation. This suggests either lower sleep homeostasis and/or a failure to properly recover sleep. Older flies also show a decreased arousal threshold, i.e., an increased response to neuronal and mechanical wake-promoting stimuli. The reduced threshold may either reflect or cause the reduced recovery sleep of older flies compared to young flies after sleep deprivation.\n\nConclusions: \nFurther studies are certainly needed, but we suggest that the lower homeostatic sleep drive of older flies causes their decreased arousal threshold.","authors":["Julie Vienne","Ryanne Spann","Frank Guo","Michael Rosbash"],"meta":["June 2016Sleep 39(08)","DOI:10.5665/sleep.6032"],"references":["318990562_PDF_neuron_firing_phase-shifts_key_circadian_activity_neurons_in_Drosophila","261291676_Lowered_Insulin_Signalling_Ameliorates_Age-Related_Sleep_Fragmentation_in_Drosophila","259395936_Aging_in_Mice_Reduces_the_Ability_to_Sustain_SleepWake_States","248112721_Tononi_G_Correlates_of_sleep_and_waking_in_Drosophila_melanogaster","236604171_Cross-Translational_Studies_in_Human_and_Drosophila_Identify_Markers_of_Sleep_Loss","234161341_Measurement_of_Lifespan_in_Drosophila_melanogaster","225026923_Effect_of_age_on_the_sleep_EEG_Slow-wave_activity_and_spindle_frequency_activity_in_young_and_middle-aged_men","259825679_Aging_induced_endoplasmic_reticulum_stress_alters_sleep_and_sleep_homeostasis","236225028_A_Dynamic_Deep_Sleep_Stage_in_Drosophila","215721668_GAL4_System_in_Drosophila_A_Fly_Geneticist's_Swiss_Army_Knife"]}