{"id":"304000701_Exploring_the_structure_and_function_of_temporal_networks_with_dynamic_graphlets","abstract":"Motivation: With increasing availability of temporal real-world networks, how to efficiently study these data? One can model a temporal network as a single aggregate static network, or as a series of time-specific snapshots, each being an aggregate static network over the corresponding time window. Then, one can use established methods for static analysis on the resulting aggregate network(s), but losing in the process valuable temporal information either completely, or at the interface between different snapshots, respectively. Here, we develop a novel approach for studying a temporal network more explicitly, by capturing inter-snapshot relationships.\n\nResults: We base our methodology on well-established graphlets (subgraphs), which have been proven in numerous contexts in static network research. We develop new theory to allow for graphlet-based analyses of temporal networks. Our new notion of dynamic graphlets is different from existing dynamic network approaches that are based on temporal motifs (statistically significant subgraphs). The latter have limitations: their results depend on the choice of a null network model that is required to evaluate the significance of a subgraph, and choosing a good null model is non-trivial. Our dynamic graphlets overcome the limitations of the temporal motifs. Also, when we aim to characterize the structure and function of an entire temporal network or of individual nodes, our dynamic graphlets outperform the static graphlets. Clearly, accounting for temporal information helps. We apply dynamic graphlets to temporal age-specific molecular network data to deepen our limited knowledge about human aging.\n\nAvailability and implementation: http://www.nd.edu/∼cone/DG.\n\nContact: ude.dn@oknelimt\n\nSupplementary information: Supplementary data are available at Bioinformatics online.","authors":["Y. Hulovatyy","H. Chen","T. Milenković"],"meta":["June 2016Bioinformatics 32(15):btw310","DOI:10.1093/bioinformatics/btw310"],"references":[]}