{"id":"304134579_Hardness_of_approximating_the_minimum_distance_of_a_linear_code","abstract":"We show that the minimum distance of a linear code (or equivalently, the weight of the lightest codeword) is not approximable to within any constant factor in random polynomial time (RP), unless NP equals RP. Under the stronger assumption that NP is not contained in RQP (random quasi-polynomial time), we show that the minimum distance is not approximable to within the factor 2log(1-ε)n, for any ε>0, where n denotes the block length of the code. Our results hold for codes over every finite field, including the special case of binary codes. In the process we show that the nearest codeword problem is hard to solve even under the promise that the number of errors is (a constant factor) smaller than the distance of the code. This is a particularly meaningful version of the nearest codeword problem. Our results strengthen (though using stronger assumptions) a previous result of A. Vardy (1997) who showed that the minimum distance is NP-hard to compute exactly. Our results are obtained by adapting proofs of analogous results for integer lattices due to M. Ajtai (1998) and D. Micciancio (1998). A critical component in the adaptation is our use of linear codes that perform better than random (linear) codes","authors":["Ilya Dumer","D. Micciancio","M. Sudan"],"meta":["January 1999Foundations of Computer Science, 1975., 16th Annual Symposium on","DOI:10.1109/SFFCS.1999.814620"],"references":["291049932_Hardness_of_Approximations_in_Approximation_Algorithms_for_NP-Hard_Problems","268715921_A_remark_on_algebraic_geometric_codes","266991555_Handbook_of_Theoretical_Computer_Science_Vol_A_Algorithms_and_Complexity","266920593_Algebraic-geometric_codes_Transl_from_the_Russian","265587304_Theory_and_Practice_of_Error_Control_Codes","255663727_A_Catalog_of_Complexity_Classes","251351298_Clique_is_hard_to_approximate_within","247930627_The_shortest_vector_problem_in_L_2_is_NP_-hard_for_randomized_reductions_extended_abstract","246998208_On_codes_exceeding_the_Gilbert_bound","242371333_The_Theory_of_Error_Correcting_Codes"]}