{"id":"304117102_The_basic_principles_of_research_in_neuroeducation_studies","abstract":"The present paper assembles contributions from the areas of education, psychology, cognitive science, and of course, neuroeducation itself to introduce the basic principles of research in the field of neuroeducation studies. It is particularly important, as such it is a useful way to justify researchers about what neuroeducation as a speci fi c domain do that no other fi eld can do as well or cannot do at all. Based on the literature reviewed, neuroeducational research can be understood as an interdisciplinary endeavor to develop an insightful understanding and holistic picture of problems related to learning and education. It thus epistemologically is based on an integrated methodological pluralism paradigm. This requires researchers to understand multiple methods and methodologies and employ as they formulate their own research projects. Researchers have a critical role to play in providing systematic evidence and conclusions that are scientifically valid and reliable and educationally relevant and usable. One significant implication of this argument is the need to strengthen the quality of the research component in graduate programs of the field and train interested researchers in the identification and formulation of relevant research questions.","authors":["Ali Nouri"],"meta":["June 2016International Journal of Cognitive Research in Science Engineering and Education 4(1):59-66","DOI:10.5937/IJCRSEE1601059N","Project: Delphi Panel on Mind, Brain, and Education (Educational Neuroscience; Neuroeducation)"],"references":["279577891_In_Search_of_Brain-Based_Education","265258185_Practical_strategies_for_enhancing_interdisciplinary_collaboration_in_neuroeducational_studies","265258093_Defining_the_Boundaries_for_Neuroeducation_as_a_Field_of_Study","265110383_Educational_neuroscience_Neuroethical_considerations","263073444_The_Biologizing_of_Cognition_Development_and_Education_Approach_with_Cautious_Enthusiasm","300590318_The_Practical_and_Ethical_Concerns_of_Using_Neuroscience_to_Teach_Young_Children_and_Help_Them_Self-Regulate","286037613_From_brain_scan_to_lesson_plan","263308566_Educational_Neuroethics_A_Contribution_From_Empirical_Research","262967848_Neuroethics_Defining_the_Issues_in_Theory_Practice_and_Policy","260786270_Forging_a_new_path_for_Educational_Neuroscience_An_international_young-researcher_perspective_on_combining_neuroscience_and_educational_practices"]}