{"id":"304188212_Physical_characterization_of_unfilled_and_nanofilled_dental_resins_Static_versus_dynamic_mechanical_properties","abstract":"Objective: \nThe aim of this study was to evaluate the mechanical properties of dental resins and dental nanocomposites by means of 3-point bending, 4-point bending and piston-on-three ball biaxial static tests and also to investigate their dynamic mechanical properties. The obtained results from the static 3-point bending test also were compared with the corresponding mode in DMTA.\n\nMethods: \nThe hydrophilic surface of the inorganic OX-50 particles was treated with γ-MPS and the resulting silanized OX-50 was characterized using FTIR and TGA. The test specimens with a specified shape and dimensions for each type of flexural static and dynamic tests were prepared for Bis-GMA/TEGDMA (70/30wt%/wt%) and the corresponding nanocomposite containing 50wt% of silanized OX-50. The specimens were stored in distilled water at 37°C for 24h prior to the mechanical tests and then they were subjected to different types of static mode and also to dynamic mode of flexural test. The effect of test speed, type of the test and the presence of silanized nano-particles were investigated for specimens under static flexural tests. The results were then statistically analyzed and compared using one-way ANOVA and the Tukey's post hoc test (significance level=0.05). Fractured surfaces were observed by means of scanning electron microscopy. Finite element analyses were also performed to compare the static tests. On the other hand, the effect of frequency, temperature and the presence of silanized nano particles on the viscoelastic properties were investigated for dynamic mechanical tests.\n\nResults: \nThe grafting of γ-MPS onto the OX-50 nano particles was confirmed. The results of 3-point bending and 4-point bending uniaxial and biaxial flexural tests of resin and composite showed the highest strength values for biaxial test specimens and the lowest strength value for 4-point bending specimens in accordance with finite element analysis results. Also, an increasing trend was observed for flexural strength of all resin samples with increasing the test speed up a critical speed which decreased beyond it. The nanocomposite specimens showed higher modulus and lower tanδ than the unfilled resin. The storage modulus measured in the dynamic tests approached the static elastic modulus values with decreasing the frequency.\n\nSignificance: \nDifferent static and dynamic test methods are used to evaluate the mechanical properties of dental resins and composites. This study provides an insight into the tests and presents more details on the effect of test conditions.","authors":["Parisa Saen","Mohammad Atai","Azizollah Nodehi","Laleh Solhi"],"meta":["June 2016Dental materials: official publication of the Academy of Dental Materials 32(8)","DOI:10.1016/j.dental.2016.06.001"],"references":["257442005_Synthesis_of_dental_resins_using_diatomite_and_nano-sized_SiO2_and_TiO2","329684815_Mechanical_properties_of_polymers_and_composites_second_edition_revised_and_expanded","264474958_Effect_of_Hydrogen_Bonds_on_Structures_and_Glass_Transition_Temperatures_of_Maleimide-Isobutene_Alternating_Copolymers_Molecular_Dynamics_Simulation_Study","263703114_Effects_of_Strain_Rate_on_Tensile_Strength_of_Steel_Specimens_of_HAZs_with_Stress_Concentrations","257653806_Surface_modification_of_inorganic_nanoparticles_for_development_of_organic-inorganic_nanocomposites-A_review","248453140_Fractography_of_Borosilicate_Glass_Tested_in_Three-_and_Four-Point_Bending","248250633_Prediction_of_tensile_yield_strength_of_rigid_inorganic_particulate_filled_thermoplastic_composites","245981988_Dynamic_Mechanical_Analysis_A_Practical_Introduction","239708408_New_developments_of_polymer_dental_composites","231690803_Analysis_of_the_glass_transition_temperature_of_miscible_polymer_blends"]}