{"id":"304141929_Uma_Visao_Tutorial_dos_Modelos_de_Alocacao_de_Banda_BAM_-_Bandwidth_Allocation_Models_como_Mecanismo_de_Provisionamento_de_Recursos_em_Redes_IPMPLSDS-TE","abstract":"Bandwidth Allocation Models (BAMs) were initially conceived as a support element defining rules and\nlimits for resource allocation (bandwidth) for Traffic Classes (TCs) in IP/MPLS/DS-TE networks. BAMs evolved on its basic purpose to deploy rules and limits for TC resources focusing on IP networks. As such, distinct BAM models and solutions were developed such as MAM (Maximum Allocation Model), RDM (Russian Dolls Model), AllocTCSharing e GBAM (Generalized BAM). Another important, relevant and interesting aspect of BAM evolution is its ability to be applied on new contexts like optical networks resource allocation, cloud computing resource provisioning and support to neutrality evaluation in telephony networks. Beyond that, BAMs have been applied and researched as a basic tool and support to optimization, reconfiguration and deployment of management systems with autonomic characteristics. Considering then this large scope and research interest involved, this paper presents a tutorial vision of the BAMs focusing specifically on resource provisioning for IP/MPLS/DS-TE networks. The paper presents sequentially the concepts around BAM, starting from basic IP needs and following with MPLS, DS-TE and Traffic Engineering related aspects. Following that, the most relevant BAMs are introduced and discussed. Finally, a simulation is presented exploring the dynamic switching of BAM models towards parameters reconfiguration and optimization like utilization, preemption and blocking among others.","authors":["Joberto S B Martins","Romildo Martins da Silva Bezerra","Gilvan Durães","Rafael Freitas Reale"],"meta":["December 2015","Project: RePAF- A Dynamic and Autonomic Resource Allocation Framework for MPLS, Elastic Optical Networks (EON), Network Function Virtualization (NFV) and IoT"],"references":["308849815_G-BAM_A_Generalized_Bandwidth_Allocation_Model_for_IPMPLSDS-TE_Networks","276197054_A_Bandwidth_Allocation_Model_Provisioning_Framework_with_Autonomic_Characteristics","267624967_Analysis_of_Bandwidth_Allocation_Models_Reconfiguration_Impacts","262415723_A_Preliminary_Evaluation_of_Bandwidth_Allocation_Model_Dynamic_Switching","261451978_Routing_in_DS-TE_Networks_with_an_Opportunistic_Bandwidth_Allocation_Model","247437757_Russian_Dolls_Bandwidth_Constraints_Model_for_Diff-Serv-aware_MPLS_Traffic_Engineering","247395337_Requirements_for_Traffic_Engineering_over_MPLS","247395336_Requirements_for_tra_c_engineering_over_MPLS","247289681_Protocol_extensions_for_support_of_Diff-Serv-aware_MPLS_Traffic_Engineering","243768417_RSVP-TE_extensions_to_RSVP_for_LSP_tunnels"]}