{"id":"304185837_Health_Sciences_Students'_Self-Assessment_of_Information_and_Communication_Technology_Skills_and_Attitude_Toward_e-Learning","abstract":"Background: \nIn medical education, information and communication technology (ICT) knowledge and skills have become a necessity and an integral part of preparing tomorrow's doctors to be sufficiently competent to use informatics resources effectively and efficiently for the best practice of medicine.\n\nObjective: \nThis research aimed to study the literacy of the preprofessional students in ICT before and after taking the basic informatics course at the Health Sciences Center at Kuwait University, to understand their potential and their attitudes toward using ICT, including e-learning.\n\nMethods: \nA validated questionnaire was used to collect data from 200 students in 2 stages: before and after the informatics course on the preprofessional program. In addition, the tutors' observational assessments of the students' achievements during the informatics course were obtained.\n\nResults: \nThe response rate of students before the course was 85.5% (171/200) and after was 77% (154/200). Of 200 students, 85% were female, and 15% were male. This disproportional representation of genders was due to the fact that 85% of registered students were female. Approximately 59% (101/171) of the students assessed themselves before the course as computer literate; afterward, this increased to 70.1% (108/154). Students who were still computer illiterate (29.2%; 45/154) mostly used the excuse of a lack of time (60%; 27/45). In generic ICT skills, the highest levels were for word processing, email, and Web browsing, whereas the lowest levels were for spreadsheets and database. In specific ICT skills, most respondents were reported low levels for statistical package use and Web page design. The results found that there was a significant improvement between students' general ICT skills before and after the course. The results showed that there were significant improvement between how frequently students were using Medline (P<.001), Google Scholar (P<.001), and Cochrane Library (P<.001) before and after the informatics course. Furthermore, most of the students who completed the course (72.8%; 110/151) chose the learning management system as the most useful e-learning tool. The results of the tutors' assessments confirmed the obvious improvement in most of the students' skills in using ICT.\n\nConclusions: \nThe ICT knowledge and skills of the students before the course seemed insufficient, and the magnitude of the improvements that were acquired throughout the informatics course was obvious in most of the students' performance. However, the findings reveal that more practice was required. The attitudes of most of the students toward the potential of e-learning were considered positive, although the potential of Web-based learning in medical training was not well known among the students.","authors":["Ali Buabbas","Hamza Mohammad Hassan Al-Shawaf","Abdullah Almajran"],"meta":["June 2016JMIR Medical Education 2(1):e9","DOI:10.2196/mededu.5606"],"references":["330634195_The_Impact_of_E-Learning_in_Medical_Education","323414170_The_Emerging_Role_of_Computer_Literacy_in_Improving_the_Performance_of_Dental_Students","323413923_Evaluation_of_information_and_communication_technology_knowledge_among_undergraduate_dental_students_in_Iran","305322649_Information_and_communication_technology_skills_and_resource_utilization_preclinical_versus_clinical_medical_students_in_a_resource-limited_African_setting","283791349_Faculty_of_medicine_students'_attitudes_towards_electronic_learning_and_their_opinion_for_an_example_of_distance_learning_application","282536171_Assessing_Students'_Perception_of_E-Learning_in_Blended_Environment_An_Experimental_Study","282358037_Digital_Literacy_in_the_Medical_Curriculum_A_Course_With_Social_Media_Tools_and_Gamification","273950948_Beyond_Computer_Literacy_Technology_Integration_and_Curriculum_Transformation","290221321_Utilization_of_electronic_scientific_information_resources_among_undergraduate_dental_students_in_Kingdom_of_Saudi_Arabia","287697176_Investigating_the_Role_of_ICT_in_the_Educational_System_of_Iran_from_the_Perspective_of_Teachers_and_Students_A_Case_Study_Islamic_Azad_University_District_2"]}