{"id":"304187587_Redesigning_Benders_Decomposition_for_Large-Scale_Facility_Location","abstract":"The uncapacitated facility location (UFL) problem is one of the most famous and most studied problems in the operations research literature. Given a set of potential facility locations and a set of customers, the goal is to find a subset of facility locations to open and to allocate each customer to open facilities so that the facility opening plus customer allocation costs are minimized. In our setting, for each customer the allocation cost is assumed to be a linear or separable convex quadratic function. Motivated by recent UFL applications in business analytics, we revise approaches that work on a projected decision space and hence are intrinsically more scalable for large-scale input data. Our working hypothesis is that many of the exact (decomposition) approaches that were proposed decades ago and discarded soon after need to be redesigned to take advantage of the new hardware and software technologies. To this end, we “thin out” the classical models from the literature and use (generalized) Benders cuts to replace a huge number of allocation variables by a small number of continuous variables that model the customer allocation cost directly. Our results show that Benders decomposition allows for a significant boost in the performance of a mixed-integer programming solver. We report the optimal solution of a large set of previously unsolved benchmark instances widely used in the available literature. In particular, dramatic speedups are achieved for UFL problems with separable quadratic allocation costs, which turn out to be much easier than their linear counterparts when our approach is used.","authors":["Matteo Fischetti","Ivana Ljubic","Markus Sinnl"],"meta":["June 2016Management Science 63(7)","DOI:10.1287/mnsc.2016.2461"],"references":["274294760_An_Outer-Inner_Approximation_for_Separable_Mixed-Integer_Nonlinear_Programs","268001843_Proximity_Search_for_0-1_Mixed-Integer_Convex_Programming","299370581_A_capacitated_competitive_facility_location_problem","283280577_CBLIB_2014_a_benchmark_library_for_conic_mixed-integer_and_continuous_optimization","282924683_Metaheuristic_applications_on_discrete_facility_location_problems_a_survey","278724434_International_Series_in_Operations_Research_Management_Science","277334799_Defining_and_identifying_Sleeping_Beauties_in_science","272015683_An_exact_cooperative_method_for_the_uncapacitated_facility_location_problem","271442631_Algorithms_for_the_continuous_nonlinear_resource_allocation_problem-New_implementations_and_numerical_studies","268645053_The_Traveling_Salesman_Problem_A_Computational_Study"]}