{"id":"304114535_Safety_and_efficacy_of_pardoprunox_for_patients_with_Parkinson's_disease_A_meta-analysis","abstract":"Objective:The aim of this meta-analysis is to synthesize evidence from published randomized controlled trials (RCTs) about the safety and efficacy of Pardoprunox for Patients with Parkinson’s disease.\n\nBackground: Pardoprunox is a partial dopamine agonist and full 5HT-1A agonist that showed promising antiParkinsonian effects in preclinical studies and has been evaluated as a monotherapy and adjuvant\ntherapy for Parkinson’s disease.\n\nMethods: We searched PubMed for RCTs assessing the efficacy of pardoprunox against placebo. Records were screened for eligibility and data were extracted and analyzed. Changes in unified Parkinson’s disease rating scale (UPDRS) part II and part III, and clinical global impression scales (CGI-S and CGI-I) were pooled as mean difference (MD) between pardoprunox and placebo groups. Adverse events were pooled as risk ratios (RRs) in a meta-analysis model. Heterogeneity was measured by Chi-square and I-square tests.\n\nResults: Four RCTs with a total of 885 patients (pardoprunox n=5422, and placebo n=5412) were pooled in the final analysis. Pardoprunox was superior to placebo in all efficacy measures (UPDRS III motor: MD 23.25, 95% CI [24.23 to 22.26]; UPDRS II: MD 21.08, 95% CI [21.51 to 20.64]; CGI-I MD 20.66, 95% CI [20.87 to 20.45]; and CGI-S MD 20.24, 95% CI [20.39 to 20.10]). For all measures, no significant heterogeneity was found\n(Chi-square P>0.1 and I2=50%). Nineteen adverse events were pooled in the final analysis. Of them, 13 adverse events were significantly higher in pardoprunox group than placebo group (hallucinations RR\n12.69, P<0.0001; orthostatic hypotension RR 4.42, P50.006; nausea RR 4.25, P<0.0001; dizziness RR 3.89, P<0.0001; somnolence RR 3.88, P<0.0001; paraesthesia RR 3.62, P50.0001; vomiting RR 2.88, P<0.0001; increased blood pressure RR 2.79, P50.004; upper abdominal pain RR 2.76, P50.008; diarrhea RR 2.56, P50.05; insomnia RR 2.39, P<0.0001; anxiety RR 2.04, P50.04; and headache RR 1.69,\nP50.007).\n\nConclusions: Pardoprunox achieved significant improvements in UPDRS III, UPDRS II, CGI-I, and CGI-S scores. However, due to its action on 5HT-1A receptors, the higher incidence of adverse events, especially hallucination, orthostatic hypotension, nausea, and dizziness might limit its clinical use. We recommend the further evaluation of pardoprunox with other drug combinations to reduce its adverse events.","authors":["N. Elsagheer","Hussien Ahmed H Abdelgawad","Attia Mohamed Ibrahim Attia","Kamal Awad"],"meta":["June 2016Movement Disorders 31(S2):S645","DOI:10.1002/mds.26688"],"references":[]}