{"id":"304233564_Robust_Estimation_Using_Context-Aware_Filtering","abstract":"This paper presents the context-aware filter, an estimation technique that incorporates context measurements, in addition to the regular continuous measurements. Context measurements provide binary information about the system’s context which is not directly encoded in the state; examples include a robot detecting a nearby building using image processing or a medical device alarming that a vital sign has exceeded a predefined threshold. These measurements can only be received from certain states and can therefore be modeled as a function of the system’s current state. We focus on two classes of functions describing the probability of context detection given the current state; these functions capture a wide variety of detections that may occur in practice. We derive the corresponding context-aware filters, a Gaussian Mixture filter and another closed-form filter with a posterior distribution whose moments are derived in the paper. Finally, we evaluate the performance of both classes of functions through simulation of an unmanned ground vehicle.","authors":["Radoslav Ivanov","Nikolay Atanasov","Miroslav Pajic","George J. Pappas"],"meta":["September 2015","DOI:10.1109/ALLERTON.2015.7447058","Conference: 2015 53rd Annual Allerton Conference on Communication, Control, and Computing (Allerton)"],"references":["303969835_Robust_Localization_Using_Context-Aware_Filtering","301463802_Semantic_Localization_Via_the_Matrix_Permanent","273057488_Nonlinear_Gaussian_Filtering_Theory_Algorithms_and_Applications","303269133_Gaussian_Processes_for_Machine_Learning","299401510_Prediction_of_Critical_Pulmonary_Shunts_in_Infants","284528413_Multinomial_Probit_The_Theory_and_its_Application_to_Demand_Forecasting","274729790_Real-time_monocular_object_SLAM","272392523_Context-Aware_Data_Processing_to_Enhance_Quality_of_Measurements_in_Wireless_Health_Systems_An_Application_to_MET_Calculation_of_Exergaming_Actions","271543200_Nonparametric_belief_propagation","266096710_Semantic_Mapping_with_Mobile_Robots"]}