{"id":"304246064_Joint_compression_and_encryption_of_visual_data_using_orthogonal_parametric_transforms","abstract":"In this paper, we introduce a novel method of joint compression and encryption of visual data. In the proposed approach the compression stage is based on block quantization while the encryption uses fast parametric orthogonal transforms of arbitrary forms in combination with a novel scheme of intra-block mixing of data vectors. Theoretical analysis of the method indicates no impact of encryption stage on the effectiveness of block quantization with an additional step of first order entropy coding. Moreover, a series of experimental studies involving natural images and JPEG lossy compression standard were performed. Here, the obtained results indicate a high level of visual content concealment with only a small reduction of compression performance. An additional analysis of security allows to state that the proposed method is resistant to cryptanalytic attacks known for visual data encryption schemes including the most efficient NZCA attack. The proposed method can be also characterized by high computational efficiency and feasibility of hardware realizations.","authors":["Dariusz Puchala","Mykhaylo Yatsymirskyy"],"meta":["June 2016Bulletin of the Polish Academy of Sciences, Technical Sciences 64(2):373-382","DOI:10.1515/bpasts-2016-0042"],"references":["261429152_Image_securing_based_chaotic_encryption_coupled_with_DCT_robust_watermarking","261313919_A_lossless_digital_encryption_system_for_multimedia_using_orthogonal_transforms","281689927_Discrete_Cosine_Transform","277585557_Parametrized_Orthogonal_Transforms_For_Data_Encryption","270578636_Fast_Parametrized_Biorthogonal_Transforms_with_Normalized_Basis_Vectors","270578632_Fast_Parametrized_Biorthogonal_Transforms","270544072_Bitstream-Based_JPEG_Encryption_in_Real-time","267009055_Mathematical_Theory_of_Connecting_Networks_and_Telephone_Traffic","265372477_Probability_and_Statistics","261458845_A_joint_watermarking_and_encryption_scheme_for_DCT_based_codecs"]}