{"id":"304291500_Towards_a_requirements_traceability_reference_model_for_Product_Service_Systems","abstract":"Differentiation opportunities for providers of traditional products and services are declining due to increasing global competition. As a result, companies are transforming into solution providers offering integrated bundles of products and services, so called Product Service Systems (PSS). The development of PSS requires intense collaboration of different disciplines (e.g. mechanical, software or service engineering) to produce a solution that fits the customers' needs. However, each discipline relies on specific engineering models, produces heterogeneous artifacts and uses different languages to describe them. For successful integration of the different PSS components, developers need a joint system model that allows understanding interdependencies and tracing the evolution of artifacts. In this context traceability is of utmost importance since requirements are specified solutions independent across different disciplines. Our research addresses this challenge by proposing a corresponding reference model. Based on a literature analysis, modeling workshops with experts in various engineering disciplines have been conducted. Integrating the insights from literature and workshops, a reference model has been iteratively developed and evaluated. This model contributes to research on cross-domain traceability of requirements and other artifacts. From a practical perspective, the reference model can be used to develop tools supporting collaborative PSS engineering and improving cross-disciplinary understanding.","authors":["Thomas Wolfenstetter","Simon Bründl","Kathrin Fuller","Markus Böhm"],"meta":["October 2015","DOI:10.1109/IESM.2015.7380307","Conference: 2015 International Conference on Industrial Engineering and Systems Management (IESM)","Project: Requirements Traceability for Product Service Systems"],"references":["265643198_Software_traceability_Trends_and_future_directions","258885244_Improving_Requirements_Engineering_by_Artefact_Orientation","257455386_A_requirements_data_model_for_product_service_systems","256484048_State-of-the-art_in_product-service_systems_Proc_IMechE_Part_B_J_Eng_Manuf","255654361_Software_Traceability_A_Roadmap","221178687_Towards_a_Taxonomy_of_Requirements_for_Hybrid_Products","215569474_A_Meta_Model_for_Artefact-Orientation_Fundamentals_and_Lessons_Learned_in_Requirements_Engineering","287039360_Concept_for_an_integration-framework_to_enable_the_crossdisciplinary_development_of_product-service_systems","282739243_Supporting_the_cross-disciplinary_development_of_product-service_systems_through_model_transformations","261450145_The_quest_for_Ubiquity_A_roadmap_for_software_and_systems_traceability_research","245167504_Product-Service_Systems_reviewing_achievements_and_refining_the_research_agenda","227852519_Eight_Types_of_Product-Service_System_Eight_Ways_to_Sustainability_Experiences_from_Suspronet_Business_Strategy_and_the_Environment_13_246_-_260","222829268_Clarifying_the_concept_of_Product-Service_System","40969289_The_12_different_ways_for_companies_to_innovate","3188133_Toward_Reference_Models_for_Requirements_Traceability"]}