{"id":"304250558_E-Flux2_and_SPOT_Validated_Methods_for_Inferring_Intracellular_Metabolic_Flux_Distributions_from_Transcriptomic_Data","abstract":"Background: \nSeveral methods have been developed to predict system-wide and condition-specific intracellular metabolic fluxes by integrating transcriptomic data with genome-scale metabolic models. While powerful in many settings, existing methods have several shortcomings, and it is unclear which method has the best accuracy in general because of limited validation against experimentally measured intracellular fluxes.\n\nResults: \nWe present a general optimization strategy for inferring intracellular metabolic flux distributions from transcriptomic data coupled with genome-scale metabolic reconstructions. It consists of two different template models called DC (determined carbon source model) and AC (all possible carbon sources model) and two different new methods called E-Flux2 (E-Flux method combined with minimization of l2 norm) and SPOT (Simplified Pearson cOrrelation with Transcriptomic data), which can be chosen and combined depending on the availability of knowledge on carbon source or objective function. This enables us to simulate a broad range of experimental conditions. We examined E. coli and S. cerevisiae as representative prokaryotic and eukaryotic microorganisms respectively. The predictive accuracy of our algorithm was validated by calculating the uncentered Pearson correlation between predicted fluxes and measured fluxes. To this end, we compiled 20 experimental conditions (11 in E. coli and 9 in S. cerevisiae), of transcriptome measurements coupled with corresponding central carbon metabolism intracellular flux measurements determined by 13C metabolic flux analysis (13C-MFA), which is the largest dataset assembled to date for the purpose of validating inference methods for predicting intracellular fluxes. In both organisms, our method achieves an average correlation coefficient ranging from 0.59 to 0.87, outperforming a representative sample of competing methods. Easy-to-use implementations of E-Flux2 and SPOT are available as part of the open-source package MOST (http://most.ccib.rutgers.edu/).\n\nConclusion: \nOur method represents a significant advance over existing methods for inferring intracellular metabolic flux from transcriptomic data. It not only achieves higher accuracy, but it also combines into a single method a number of other desirable characteristics including applicability to a wide range of experimental conditions, production of a unique solution, fast running time, and the availability of a user-friendly implementation.","authors":["Min Kyung Kim","Anatoliy Lane","James J Kelley","Desmond S. Lun"],"meta":["June 2016PLoS ONE 11(6):e0157101","DOI:10.1371/journal.pone.0157101"],"references":["274424890_COBRA_Toolbox_20","268281672_Prediction_of_Metabolic_Flux_Distribution_from_Gene_Expression_Data_Based_on_the_Flux_Minimization_Principle","265296290_Methods_for_integration_of_transcriptomic_data_in_genome-scale_metabolic_models","313558237_MAANOVA_A_software_package_for_the_analysis_of_spotted_cDNA_microarray_experiments","311508825_A_comprehensive_genome-scale_reconstruction_of_Escherichia_coli_metabolism","311508690_A_genome-scale_metabolic_reconstruction_for_Escherichia_coli_K-12_MG1655_that_accounts_for_1260_ORFs_and_thermodynamic_information","286781355_Metabolic_fux_analysis_of_hybrid-oma_cells_in_different_culture_media_using_mass_balances","283679863_Exploration_Normalization_and_Summaries_of_High_Density_Oligonucleotide_Array_Probe_Level_Data","281609723_The_biomass_objective_funcion","272186193_MOST_A_software_environment_for_constraint-based_metabolic_modeling_and_strain_design","263355690_What_mRNA_Abundances_Can_Tell_us_about_Metabolism","261881545_Systematic_Evaluation_of_Methods_for_Integration_of_Transcriptomic_Data_into_Constraint-Based_Models_of_Metabolism","260840956_Recent_advances_in_the_Reconstruction_of_metabolic_models_and_integration_of_omicsdata","258503405_Application_of_Metabolic_Flux_Analysis_to_Plants","245759142_Convex_Analysis_and_Optimization"]}