{"id":"304250296_Early_role_of_vascular_dysregulation_on_late-onset_Alzheimer's_disease_based_on_multifactorial_data-driven_analysis","abstract":"Multifactorial mechanisms underlying late-onset Alzheimer's disease (LOAD) are poorly characterized from an integrative perspective. Here spatiotemporal alterations in brain amyloid-β deposition, metabolism, vascular, functional activity at rest, structural properties, cognitive integrity and peripheral proteins levels are characterized in relation to LOAD progression. We analyse over 7,700 brain images and tens of plasma and cerebrospinal fluid biomarkers from the Alzheimer's Disease Neuroimaging Initiative (ADNI). Through a multifactorial data-driven analysis, we obtain dynamic LOAD-abnormality indices for all biomarkers, and a tentative temporal ordering of disease progression. Imaging results suggest that intra-brain vascular dysregulation is an early pathological event during disease development. Cognitive decline is noticeable from initial LOAD stages, suggesting early memory deficit associated with the primary disease factors. High abnormality levels are also observed for specific proteins associated with the vascular system's integrity. Although still subjected to the sensitivity of the algorithms and biomarkers employed, our results might contribute to the development of preventive therapeutic interventions.","authors":["Y Iturria-Medina","Roberto C Sotero","P.J. Toussaint","J.M. Mateos-Pérez"],"meta":["June 2016Nature Communications 7(1):11934","DOI:10.1038/ncomms11934"],"references":["291035233_Hypothetical_model_of_dynamic_biomarkers_of_the_Alzheimer's_pathological_cascade","277893753_On_the_Central_Role_of_Brain_Connectivity_in_Neurodegenerative_Disease_Progression","277010878_DPARSF_a_Matlab_toolbox_for_pipeline_data_analysis_of_resting-state_fMRI","312703942_The_brain's_default_network_Anatomy_function_and_relevance_to_disease","312210614_Neurovascular_pathways_to_neurodegeneration_in_Alzheimer's_disease_and_other_disorders","291228375_Brain_Drain","285068049_Mitochondria_amyloid_beta_and_Alzheimer's_disease","284975476_Cerebral_Vascular_System","284688127_A_nonparametric_method_for_automatic_correction_of_intensity_nonuniformity_in_MRI_data_I","271537928_Blood-Brain_Barrier_Breakdown_in_the_Aging_Human_Hippocampus"]}