{"id":"304268856_Modernizing_Quantum_Annealing_using_Local_Searches","abstract":"I describe how real quantum annealers may be used to perform local (in state space) searches around specified states, rather than the global searches traditionally implemented in the quantum annealing algorithm. Such protocols will have numerous advantages over simple quantum annealing. By using such searches the effect of problem mis-specification can be reduced, as only energy differences between the searched states will be relevant. The quantum annealing algorithm is an analogue of simulated annealing, a classical numerical technique which is now obsolete. Hence, I explore two strategies to use an annealer in a way which takes advantage of modern classical optimization algorithms. Furthermore, I show how sequential calls to quantum annealers can be used to construct analogues of population annealing and parallel tempering which use quantum searches as subroutines.The techniques given here can be applied not only to optimization, but also to sampling. I examine the feasibility of these protocols on real devices and note that implementing such protocols should require minimal if any change to the current design of the flux qubit-based annealers by D-Wave Systems Inc.","authors":["Nicholas Chancellor"],"meta":["June 2016New Journal of Physics 19(2)","DOI:10.1088/1367-2630/aa59c4","Project: continuous time hybrid computation"],"references":["303490381_Experimental_Freezing_of_mid-Evolution_Fluctuations_with_a_Programmable_Annealer","289584806_Computational_multiqubit_tunnelling_in_programmable_quantum_annealers","286301759_What_is_the_Computational_Value_of_Finite_Range_Tunneling","283335335_Understanding_Quantum_Tunneling_through_Quantum_Monte_Carlo_Simulations","283117837_Application_of_Quantum_Annealing_to_Training_of_Deep_Neural_Networks","281262389_Adiabaticity_in_open_quantum_systems","281262363_Population_Annealing_Theory_and_Application_in_Spin_Glasses","297446354_Quantum_physics","283658925_Quantum_Annealing_via_Environment-Mediated_Quantum_Diffusion","282919956_Adiabatic_quantum_computing_for_finding_low-peak-sidelobe_codes"]}