{"id":"304371214_Energy-efficient_fuzzy_logic_cluster_head_selection_in_wireless_sensor_networks","abstract":"WSNs are characterized by limited energy constraints. This characteristic poses considerable challenge on design of routing protocols. Therefore, many designers and researchers focus on architectures and algorithms that allow energy-efficient operation of WSNs. One of the popular algorithms in this regard is clustering algorithm. Thus, there are many routing protocols based on clustering algorithm has been proposed for WSNs, the functionality of these protocols is divided into cluster heads (CHs) selection and cluster formation. However, CHs selection is one of the very important problems in routing protocols applications and can drastically impact the network lifespan thereby energy conservation task for WSNs. In this paper, we propose a new routing approach called Energy-efficient fuzzy logic cluster head (EEFL-CH); it is an improvement of LEACH protocol. The goal of this approach is to decrease energy consumption in terms of network lifetime extension using three fuzzy parameters. These parameters are residual energy, expected efficiency, and closeness to base station. Simulation results show that EEFL-CH approach has the better result as compared with LEACH and LEACH-ERE routing protocols.","authors":["El Alami Hassan","Abdellah Najid"],"meta":["March 2016","DOI:10.1109/IT4OD.2016.7479300","Conference: 2016 International Conference on Information Technology for Organizations Development (IT4OD)","Project: Smart Energy Management and Throughput Maximization: A New Routing Protocol for WSNs"],"references":["309413843_SEFP_A_new_routing_approach_using_fuzzy_logic_for_clustered_heterogeneous_wireless_sensor_networks","222534027_Wireless_Sensor_Networks_A_Survey","266176281_Improving_on_LEACH_Protocol_of_Wireless_Sensor_Networks_Using_Fuzzy_Logic","265161068_Railway_security_through_the_use_of_wireless_sensor_networks_based_on_fuzzy_logic","260513839_Fuzzy-Logic-Based_Clustering_Approach_for_Wireless_Sensor_Networks_Using_Energy_Predication","242612523_Energy-efficient_routing_protocols_for_wireless_microsensor_networks","236183230_Wireless_Communications_Principles_and_Practice_2nd_Edition","230888000_Introduction_to_fuzzy_logic_using_MATLAB","224310633_CHEF_Cluster_Head_Election_mechanism_using_Fuzzy_logic_in_Wireless_Sensor_Networks","220693664_Wireless_communications_principle_and_practice"]}