{"id":"304339244_Comparison_of_Convenience_Sampling_and_Purposive_Sampling","abstract":"This article studied and compared the two nonprobability sampling techniques namely, Convenience Sampling and Purposive Sampling. Convenience Sampling and Purposive Sampling are Nonprobability Sampling Techniques that a researcher uses to choose a sample of subjects/units from a population. Although, Nonprobability sampling has a lot of limitations due to the subjective nature in choosing the sample and thus it is not good representative of the population, but it is useful especially when randomization is impossible like when the population is very large. It can be useful when the researcher has limited resources, time and workforce. It can also be used when the research does not aim to generate results that will be used to create generalizations pertaining to the entire population. Therefore, there is a need to use nonprobability sampling techniques. The aim of this study is to compare among the two nonrandom sampling techniques in order to know whether one technique is better or useful than the other. Different articles were reviewed to compare between Convenience Sampling and Purposive Sampling and it is concluded that the choice of the techniques (Convenience Sampling and Purposive Sampling) depends on the nature and type of the research.","authors":["Ilker Etikan"],"meta":["January 2016American Journal of Theoretical and Applied Statistics 5(1):1","DOI:10.11648/j.ajtas.20160501.11"],"references":["258315317_Purposeful_Sampling_for_Qualitative_Data_Collection_and_Analysis_in_Mixed_Method_Implementation_Research","308119180_Research_Methods_The_Basics","303920871_Second_Language_Research_Methodology_and_Design","286048230_The_Research_Manual_Design_and_Statistics_for_Applied_Linguistics","285632539_Purposive_sampling_as_a_tool_for_informant_selection","277815337_Designing_and_Conducting_Mixed_Method_Research","272792288_Research_methods_in_applied_linguistics","271655332_The_problem_of_ngor_in_qualitative_research","264270343_Research_Methods_in_Applied_Linguistics","262883696_A_Comparison_of_Convenience_Sampling_and_Purposive_Sampling"]}