{"id":"304331515_A_Survey_of_Bioinformatics_Database_and_Software_Usage_through_Mining_the_Literature","abstract":"Computer-based resources are central to much, if not most, biological and medical research. However, while there is an ever expanding choice of bioinformatics resources to use, described within the biomedical literature, little work to date has provided an evaluation of the full range of availability or levels of usage of database and software resources. Here we use text mining to process the PubMed Central full-text corpus, identifying mentions of databases or software within the scientific literature. We provide an audit of the resources contained within the biomedical literature, and a comparison of their relative usage, both over time and between the sub-disciplines of bioinformatics, biology and medicine. We find that trends in resource usage differs between these domains. The bioinformatics literature emphasises novel resource development, while database and software usage within biology and medicine is more stable and conservative. Many resources are only mentioned in the bioinformatics literature, with a relatively small number making it out into general biology, and fewer still into the medical literature. In addition, many resources are seeing a steady decline in their usage (e.g., BLAST, SWISS-PROT), though some are instead seeing rapid growth (e.g., the GO, R). We find a striking imbalance in resource usage with the top 5% of resource names (133 names) accounting for 47% of total usage, and over 70% of resources extracted being only mentioned once each. While these results highlight the dynamic and creative nature of bioinformatics research they raise questions about software reuse, choice and the sharing of bioinformatics practice. Is it acceptable that so many resources are apparently never reused? Finally, our work is a step towards automated extraction of scientific method from text. We make the dataset generated by our study available under the CC0 license here: http://dx.doi.org/10.6084/m9.figshare.1281371.","authors":["Geraint James Duck","Goran Nenadic","Michele Filannino","Andy Brass"],"meta":["June 2016PLoS ONE 11(6):e0157989","DOI:10.1371/journal.pone.0157989"],"references":["289488811_Resource_Disambiguator_for_the_Web_Extracting_Biomedical_Resources_and_Their_Citations_from_the_Scientific_Literature","279426995_Ambiguity_and_variability_of_database_and_software_names_in_bioinformatics","265093023_Extracting_patterns_of_database_and_software_usage_from_the_bioinformatics_literature","261796378_Ambiguity_and_Variability_of_Database_and_Software_Names_in_Bioinformatics","256465128_Software_Engineering_as_Instrumentation_for_the_Long_Tail_of_Scientific_Software","239525631_BioNerDS_Exploring_bioinformatics'_database_and_software_use_through_literature_mining","227397601_BADREX_In_situ_expansion_and_coreference_of_biomedical_abbreviationsusing_dynamic_regular_expressions","279550906_How_companies_become_platform_leaders","276364280_Software_in_the_scientific_literature_Problems_with_seeing_finding_and_using_software_mentioned_in_the_biology_literature","262293932_Incentives_and_integration_in_scientific_software_production"]}