{"id":"304412750_Automatic_Indonesia's_questions_classification_based_on_bloom's_taxonomy_using_Natural_Language_Processing_a_preliminary_study","abstract":"Identification of students' cognitive ability should be done to know students' understanding towards what have been taught. The identification result will be the benchmark to choose the basis of assessment. The identification process of cognitive ability can be done by giving questions in certain difficulties levels. The appropriateness of difficulty levels can be made based on bloom taxonomy introduced by Benjamin Bloom in 1956 and revised by Lorin Anderson Krathwohl in 1994. There are 6 levels in bloom taxonomy, namely remembering, understanding, applying, analyzing, evaluating and creating. However, the questions classification process based on bloom taxonomy is not easy when it is done manually. Classification process needs long time if there are many questions items. Besides, the different perception in classification make manual classification process is varied from one to another. This research suggests a method that produces automation classification of Indonesian language question items based on new bloom taxonomy levels. The method includes indentifying the question items' characteristic of nature language used. The identification is done based on lexical feature extraction and syntactic feature extraction. The features extraction output is classified by using algorithm of Support Vector Machine (SVM). The dataset used for the test is the question items from many lessons in elementary school. This research showed that the method suggested can be used to classify Indonesian language question items well.","authors":["Selvia Ferdiana Kusuma","Daniel Siahaan","Umi Laili Yuhana"],"meta":["November 2015","DOI:10.1109/ICITSI.2015.7437696","Conference: 2015 International Conference on Information Technology Systems and Innovation (ICITSI)"],"references":["282918840_Exam_questions_classification_based_on_Bloom's_taxonomy_cognitive_level_using_classifiers_combination","266497754_Indonesian_Parsing_using_Collins's_Parser","259463287_Automatic_Classification_of_Questions_into_Bloom's_Cognitive_Levels_using_Support_Vector_Machines","257716775_Automated_Analysis_of_Exam_Questions_According_to_Bloom's_Taxonomy","251956701_An_improved_method_of_keywords_extraction_based_on_short_technology_text","233960006_Bengali_Question_Classification_Towards_Developing_QA_System","313836915_Pemanfaatan_Algoritma_Porter_Stemmer_Untuk_Bahasa_Indonesia_Dalam_Proses_Klasifikasi_Jenis_Buku","282200550_A_review_in_feature_extraction_approach_in_question_classification_using_Support_Vector_Machine","276124909_Intelligent_Classification_of_Learner's_Cognitive_Domain_using_Bayes_Net_Naive_Bayes_and_J48_Utilizing_Bloom's_Taxonomy-based_Serious_Game","261388652_A_rule-based_approach_in_Bloom's_Taxonomy_question_classification_through_natural_language_processing"]}