{"id":"304469415_Enhancing_Accountability_and_Trust_in_Distributed_Ledgers","abstract":"Permisionless decentralized ledgers (\"blockchains\") such as the one underlying the cryptocurrency Bitcoin allow anonymous participants to maintain the ledger, while avoiding control or \"censorship\" by any single entity. In contrast, permissioned decentralized ledgers exploit real-world trust and accountability, allowing only explicitly authorized parties to maintain the ledger. Permissioned ledgers support more flexible governance and a wider choice of consensus mechanisms. Both kinds of decentralized ledgers may be susceptible to manipulation by participants who favor some transactions over others. The real-world accountability underlying permissioned ledgers provides an opportunity to impose fairness constraints that can be enforced by penalizing violators after-the- fact. To date, however, this opportunity has not been fully exploited, unnecessarily leaving participants latitude to manipulate outcomes undetectably. This paper draws attention to this issue, and proposes design principles to make such manipulation more difficult, as well as specific mechanisms to make it easier to detect when violations occur.","authors":["Maurice Herlihy","Mark Moir"],"meta":["June 2016"],"references":["265727614_Overview_of_Emerging_Non-volatile_Memory_Technologies","260107766_On_Subversive_Miner_Strategies_and_Block_Withholding_Attack_in_Bitcoin_Digital_Currency","258224002_Majority_Is_Not_Enough_Bitcoin_Mining_Is_Vulnerable","234794330_The_case_for_Byzantine_fault_detection","306304642_Hawk_The_Blockchain_Model_of_Cryptography_and_Privacy-Preserving_Smart_Contracts","278048301_Enigma_Decentralized_Computation_Platform_with_Guaranteed_Privacy","262161175_Authenticated_Data_Structures_Generically","242254280_Secure_and_Efficient_Asynchronous_Broadcast_Protocols_Extended_Abstract","228645495_The_role_of_accountability_in_dependable_distributed_systems","228640975_Bitcoin_A_Peer-to-Peer_Electronic_Cash_System"]}