{"id":"304405357_Student_performance_and_Learning_Outcomes_in_Higher_Education_Institutions","abstract":"In higher education, learning outcomes are the specifications of what a student should learn and demonstrate, on successful completion of the course or the programme. It can also be seen as the desired outcome of the learning process in terms of acquisition of the skills and knowledge. They are embedded in the curriculum. Achieving learning outcomes needs specific experiences to be provided to the students and evaluation of their attainment. A programme without stated learning objectives and outcomes that are not evaluated or assessed gets neglected in implementation. Hence all the stated learning outcomes must be part of the evaluation protocol of the programme. Student assessment provides an indication of the areas where learning has happened and where it has to be improved upon. In this paper, we have analysed the strategies followed by Srinivas Institute of Management Studies, Mangalore for student performance. Issues like the clearly stated learning outcomes of the college and the details on how the students and staff are made aware of these, institutional efforts to monitor and communicate the progress and performance of students throughout the duration of the course/programme, and the analysis of the students results/achievements to see the differences if any, patterns of achievement across the programmes/courses offered, structure of the teaching, learning and assessment strategies of the institution to facilitate the achievement of the intended learning outcomes, and the measures/initiatives taken up by the institution to enhance the social and economic relevance of the courses offered are discussed. The institutions effort to collect and analyse data on student learning outcomes and use it for planning and overcoming barriers of learning, institution and individual teachers use assessment/evaluation as an indicator for evaluating student performance, achievement of learning objectives and planning, and other relevant information regarding teaching-learning and evaluation are also discussed","authors":["Sreeramana Aithal"],"meta":["June 2016","Project: Higher Education System"],"references":["325217765_Learning_Through_Team_Centric_Exercise_Key_Point_Pedagogy-An_Effective_Learning_Model_for_Slow_Learners_in_Social_Work_Higher_Education_Training","309609132_The_Study_Of_New_National_Institutional_Ranking_System_Using_Abcd_Framework","309608958_Innovations_In_Experimental_Learning_-_A_Study_Of_World_Top_Business_Schools","309608853_Innovations_In_Student_Centric_Learning_-_A_Study_Of_Top_Business_Schools_In_India","309608851_How_To_Increase_Research_Productivity_In_Higher_Educational_Institutions_-Sims_Model","309483799_Impact_of_On-line_Education_on_Higher_Education_System","309483043_Enhancement_of_Graduate_attributes_in_Higher_Education_Institutions_through_Stage_Models","309482596_Strategic_Planning_in_Higher_Education_Institutions_A_Case_Study_of_SIMS_-_VISION_2025","303748309_Analysis_Of_Choice_Based_Credit_System_In_Higher_Education","303139746_How_to_Increase_Research_Productivity_in_Higher_Educational_Institutions_-SIMS_Model"]}