{"id":"304417678_Uncovering_the_Small_Community_Structure_in_Large_Networks_A_Local_Spectral_Approach","abstract":"Large graphs arise in a number of contexts and understanding their structure and extracting information from them is an important research area. Early algorithms on mining communities have focused on the global structure, and often run in time functional to the size of the entire graph. Nowadays, as we often explore networks with billions of vertices and find communities of size hundreds, it is crucial to shift our attention from macroscopic structure to microscopic structure when dealing with large networks. A growing body of work has been adopting local expansion methods in order to identify the community from a few exemplary seed members. %Very few approaches can systematically demonstrate both high efficiency and effectiveness that significantly stands out amongst the divergent approaches in finding communities.\nIn this paper, we propose a novel approach for finding overlapping communities called LEMON (Local Expansion via Minimum One Norm). Different from PageRank-like diffusion methods, LEMON finds the community by seeking a sparse vector in the span of the local spectra such that the seeds are in its support. We show that LEMON can achieve the highest detection accuracy among state-of-the-art proposals. The running time depends on the size of the community rather than that of the entire graph. The algorithm is easy to implement, and is highly parallelizable.\nMoreover, given that networks are not all similar in nature, a comprehensive analysis on how the local expansion approach is suited for uncovering communities in different networks is still lacking. We thoroughly evaluate our approach using both synthetic and real-world datasets across different domains, and analyze the empirical variations when applying our method to inherently different networks in practice. In addition, the heuristics on how the quality and quantity of the seed set would affect the performance are provided.","authors":["Yixuan Li","Kun He","David Bindel","John E. Hopcroft"],"meta":["September 2015","DOI:10.1145/2736277.2741676","Conference: 24th International Conference of World Wide Web (WWW2015)At: Florence, Italy","Project: Social Networks"],"references":["231012391_A_Markov_random_walk_under_constraint_for_discovering_overlapping_communities_in_complex_networks","225098636_DEMON_a_Local-First_Discovery_Method_for_Overlapping_Communities","266660244_Community_membership_identification_from_small_seed_sets","262411165_Overlapping_community_detection_using_seed_set_expansion","262370641_A_Separability_Framework_for_Analyzing_Community_Structure","262319902_A_Critical_Point_for_Random_Graphs_with_a_Given_Degree_Sequence","260799807_Heat_kernel_based_community_detection","236455824_Semi-Supervised_Eigenvectors_for_Large-Scale_Locally-Biased_Learning","225069657_Defining_and_Evaluating_Network_Communities_Based_on_Ground-Truth","221996566_On_Spectral_Clustering_Analysis_and_an_Algorithm"]}