{"id":"304493000_A_General_Account_of_Coinduction_Up-To","abstract":"Bisimulation up-to enhances the coinductive proof method for bisimilarity, providing efficient proof techniques for checking properties of different kinds of systems. We prove the soundness of such techniques in a fibrational setting, building on the seminal work of Hermida and Jacobs. This allows us to systematically obtain up-to techniques not only for bisimilarity but for a large class of coinductive predicates modeled as coalgebras. The fact that bisimulations up to context can be safely used in any language specified by GSOS rules can also be seen as an instance of our framework, using the well-known observation by Turi and Plotkin that such languages form bialgebras. In the second part of the paper, we provide a new categorical treatment of weak bisimilarity on labeled transition systems and we prove the soundness of up-to context for weak bisimulations of systems specified by cool rule formats, as defined by Bloom to ensure congruence of weak bisimilarity. The weak transition systems obtained from such cool rules give rise to lax bialgebras, rather than to bialgebras. Hence, to reach our goal, we extend the categorical framework developed in the first part to an ordered setting.","authors":["Filippo Bonchi","Daniela Petrişan","Damien Pous","Jurriaan Rot"],"meta":["March 2017Acta Informatica 54(2)","DOI:10.1007/s00236-016-0271-4"],"references":["261404622_Coalgebraic_Weak_Bisimulation_from_Recursive_Equations_over_Monads","325768457_Introduction_to_coalgebra_Towards_mathematics_of_states_and_observation","287962151_Fibrations_and_Yoneda's_lemma_in_a_2-category","286487882_Enhanced_coalgebraic_bisimulation","277239980_Investigations_into_Algebra_and_Topology_over_Nominal_Sets","267759865_Behavioural_equivalences_for_coalgebras_with_unobservable_moves","265779242_Nominal_sets_Names_and_symmetry_in_computer_science","265371850_Enhancements_of_the_bisimulation_proof_method","265113211_Introduction_to_Bisimulation_and_Coinduction","262273915_Complete_Lattices_and_Up-To_Techniques","260340851_Positive_Fragments_of_Coalgebraic_Logics","259162983_Coinductive_Predicates_and_Final_Sequences_in_a_Fibration","261165150_Turing_Machines_with_Atoms","259914753_Coinduction_up_to_in_a_fibrational_setting","259360338_Generalised_Coinduction"]}