{"id":"304428606_Asymmetries_of_Knowledge_Mediated_Ethnography_and_ICT_for_Development","abstract":"Over the last few decades the Internet, World Wide Web, cyberspace and so forth have emerged as crucial cultural and political arenas, and thus of increasing relevance as objects and areas of ethnographic inquiry. The paper argues that the ethnographical entry-point for studying such technologically mediated arenas creates specific effects of ‘path-dependence ‘and attendant asymmetries of knowledge. Globally distributed networks of organizations, collaborating on issues relating to information- and communication technologies for development (ICT4Dev) provides context for the argument. Three sources of knowledge asymmetries are identified: limited presence, partial information and uncertain connections. Athough mediated ethnographies invariably create asymmetries of knowledge they also thrive on these asymmetries. This is because they also replicate features of the field itself: asymmetries of knowledge likewise characterize and influence the activities of globally distributed networks. In conjunction, the three sources of asymmetry create a predicament of mutual opacity as a condition of knowledge making in ICT4Dev networks as well as for the ethnographer. Focusing on the consequences of these asymmetries, the paper argues that mediated ethnography has central contributions to make in a) analyzing the specific formats of the social that emerges from globally distributed organizations and networks and b) bringing to light some alternative stories about what might be done with ICT4Dev.","authors":["Casper Bruun Jensen"],"meta":["April 2010Methodological Innovations Online 5(1):72-85","DOI:10.4256/mio.2010.0011"],"references":["270899766_Global_Assemblages_Technology_Politics_and_Ethics_As_Anthropological_Problems","239551594_Myths_of_Digital_Technology_in_Africa_Leapfrogging_Development","324645168_The_Stages_of_Economic_Growth_A_Non-Communist_Manifesto","273033401_Globalisation_ICTs_and_the_New_Imperialism_Perspectives_on_Africa_in_the_Global_Electronic_Village_GEV","272746013_Re-Assembling_the_Social_An_Introduction_to_Actor_Network_Theory","269515861_The_Devil_and_Commodity_Fetishism_in_South_America","263464495_Virtual_Ethnography","253210962_The_Stages_of_Economic_Growth_A_Non-Communist_Manifesto","248881826_Infrastructural_Fractals_Revisiting_the_Micro-Macro_Distinction_in_Social_Theory","247864583_The_Eighteenth_Brumaire_of_Louis_Bonaparte"]}