{"id":"304462342_Horton_Tables_Fast_Hash_Tables_for_In-Memory_Data-Intensive_Computing","abstract":"Hash tables are important data structures that lie at the heart of important applications such as key-value stores and relational databases. Typically bucketized cuckoo hash tables (BCHTs) are used because they provide high-throughput lookups and load factors that exceed 95%. Unfortunately, this performance comes at the cost of reduced memory access efficiency. Positive lookups (key is in the table) and negative lookups (where it is not) on average access 1.5 and 2.0 buckets, respectively, which results in 50 to 100% more table-containing cache lines to be accessed than should be minimally necessary. To reduce these surplus accesses, this paper presents the Horton table, a revamped BCHT that reduces the expected cost of positive and negative lookups to fewer than 1.18 and 1.06 buckets, respectively, while still achieving load factors of 95%. The key innovation is remap entries, small in-bucket records that allow (1) more elements to be hashed using a single, primary hash function , (2) items that overflow buckets to be tracked and rehashed with one of many alternate functions while maintaining a worst-case lookup cost of 2 buckets, and (3) shortening the vast majority of negative searches to 1 bucket access. With these advancements, Horton tables outperform BCHTs by 17% to 89%.","authors":["Alex Breslow","Dong Ping Zhang","Joseph L Greathouse","Nuwan Jayasena"],"meta":["June 2016","Conference: 2016 USENIX Annual Technical Conference (USENIX ATC 16)At: Denver, Colorado"],"references":["318780127_Real-Time_Parallel_Hashing_on_the_GPU","310829534_Coherent_parallel_hashing","305864905_IntelR_Xeon_Phi_coprocessor_codename_Knights_Corner","303753625_Coherency_Sensitive_Hashing","300590619_Rethinking_SIMD_Vectorization_for_In-Memory_Databases","300409093_Stadium_Hashing_Scalable_and_Flexible_Hashing_on_GPUs","290653939_Mega-KV_A_case_for_GPUs_to_maximize_the_throughput_of_in-memory_key-value_stores","284722536_MemcachedGPU_Scaling-up_Scale-out_Key-value_Stores","276465267_Improving_main_memory_hash_joins_on_Intel_Xeon_Phi_processors","266657190_Algorithmic_improvements_for_fast_concurrent_Cuckoo_hashing"]}