{"id":"304493850_RemoveDEBRIS_An_in-orbit_active_debris_removal_demonstration_mission","abstract":"Since the beginning of the space era, a significant amount of debris has progressively been generated. Most of the objects launched into space are still orbiting the Earth and today these objects represent a threat as the presence of space debris incurs risk of collision and damage to operational satellites. A credible solution has emerged over the recent years: actively removing debris objects by capturing them and disposing of them.\nThis paper provides an update to the mission baseline and concept of operations of the EC FP7 RemoveDEBRIS mission drawing on the expertise of some of Europe's most prominent space institutions in order to demonstrate key active debris remove (ADR) technologies in a low-cost ambitious manner. The mission will consist of a microsatellite platform (chaser) that ejects 2 CubeSats (targets). These targets will assist with a range of strategically important ADR technology demonstrations including net capture, harpoon capture and vision-based navigation using a standard camera and LiDAR. The chaser will also host a drag sail for orbital lifetime reduction.\nThe mission baseline has been revised to take into account feedback from international and national space policy providers in terms of risk and compliance and a suitable launch option is selected. A launch in 2017 is targeted. The RemoveDEBRIS mission aims to be one of the world's first in-orbit demonstrations of key technologies for active debris removal and is a vital prerequisite to achieving the ultimate goal of a cleaner Earth orbital environment.","authors":["Jason L. Forshaw","Guglielmo Aglietti","Nimal Navarathinam","Haval Kadhem"],"meta":["June 2016Acta Astronautica 127","DOI:10.1016/j.actaastro.2016.06.018"],"references":["351269077_RemoveDEBRIS_-_Mission_Analysis_for_a_Low-Cost_Active_Debris_Removal_Demonstration","235798992_Space_Debris_Removal_with_an_Ion_Beam_Shepherd_Satellite_target-plasma_interaction","261353979_Tracking_complex_targets_for_space_rendezvous_and_debris_removal_applications","260456354_Compliance_of_disposal_orbits_with_the_French_Space_Operations_Act_The_Good_Practices_and_the_STELA_tool","228513853_Long_term_orbit_propagation_techniques_developed_in_the_frame_of_the_French_space_act"]}