{"id":"304590233_Algebraic_foundations_for_qualitative_calculi_and_networks","abstract":"A qualitative representation $\\phi$ is like an ordinary representation of a relation algebra, but instead of requiring $(a; b)^\\phi = a^\\phi | b^\\phi$, as we do for ordinary representations, we only require that $c^\\phi\\supseteq a^\\phi | b^\\phi \\iff c\\geq a ; b$, for each $c$ in the algebra. A constraint network is qualitatively satisfiable if its nodes can be mapped to elements of a qualitative representation, preserving the constraints. If a constraint network is satisfiable then it is clearly qualitatively satisfiable, but the converse can fail. However, for a wide range of relation algebras including the point algebra, the Allen Interval Algebra, RCC8 and many others, a network is satisfiable if and only if it is qualitatively satisfiable. Unlike ordinary composition, the weak composition arising from qualitative representations need not be associative, so we can generalise by considering network satisfaction problems over non-associative algebras. We prove that computationally, qualitative representations have many advantages over ordinary representations: whereas many finite relation algebras have only infinite representations, every finite qualitatively representable algebra has a finite qualitative representation; the representability problem for (the atom structures of) finite non-associative algebras is NP-complete; the network satisfaction problem over a finite qualitatively representable algebra is always in NP; the validity of equations over qualitative representations is co-NP-complete. On the other hand we prove that there is no finite axiomatisation of the class of qualitatively representable algebras.","authors":["Robin Hirsch","Marcel Jackson","Tomasz Kowalski","Todd Niven"],"meta":["June 2016Theoretical Computer Science 768","DOI:10.1016/j.tcs.2019.02.033","Project: Boolean Algebras with Operators"],"references":["247590685_Some_Varieties_Containing_Relation_Algebras","227006918_Necessary_subalgebras_of_simple_nonintegral_semiassociative_relation_algebras","226767820_Combinatorial_aspects_of_relations","271898381_A_survey_of_qualitative_spatial_representations","269835604_Boolean_Algebras_with_Operators","265493961_On_the_Scope_of_Qualitative_Constraint_Calculi","243779915_Boolean_Algebras_with_Operators_Part_I","228057735_Computers_And_Intractability_A_Guide_to_the_Theory_of_NP-Completeness","222681756_A_relation_-_Algebraic_approach_to_the_region_connection_calculus","222555568_Relation_algebras_from_cylindric_algebras_II","221393453_A_Spatial_Logic_based_on_Regions_and_Connection","222523273_RCC8_binary_constraint_network_can_be_consistently_extended","221600758_Categorical_Methods_in_Qualitative_Reasoning_The_Case_for_Weak_Representations","221419423_What_Is_a_Qualitative_Calculus_A_General_Framework","220695890_Computers_and_Intracdtability_A_Guide_to_the_Theory_of_NP-Completeness"]}