{"id":"304525642_Grating_lobe_and_Sidelobe_Suppression_using_Multi-Objective_Optimization_Techniques","abstract":"The range resolution of RADAR signal depends on the bandwidth of the signal. Linear Frequency Modulation (LFM) signal is used in RADAR because of its good range resolution. The range resolution can be further improved by introducing a frequency step between consecutive LFM pulses. The resultant signal is known as Stepped Frequency Pulse Train (SFPT). When the product of pulse duration and frequency step become more than one, the Autocorrelation Function (ACF) of SFPT shows ambiguous peaks, known as grating lobes. These grating lobes along with sidelobes present in the vicinity of the mainlobe are not desirable. In literatures, there are analytical methods available to find the parameter of SFPT for completely nullify or suppress these grating lobes to a desired level but not much attention is given to sidelobes. In this paper, we use a Multi-Objective Optimization Technique (Multi-Objective Particle Swarm Optimization (MOPSO)) to find the optimized parameter of SFPT. The problem was formulated by taking the objective of minimization of grating lobe and minimization of peak sidelobe. The efficacy of the proposed method is shown through exhaustive simulation results.","authors":["Vinod Kumar","Ajit Kumar Sahoo"],"meta":["April 2015","DOI:10.1109/ICCSP.2015.7322879","Conference: Communications and Signal Processing (ICCSP), 2015 International Conference onAt: Melmaruvathur"],"references":["224346841_Grating_Lobes_Suppression_in_Stepped-Frequency_Pulse_Train","4146689_Suppression_of_grating_lobes_in_stepped-frequency_train","3418784_Handling_Multiple_Objectives_With_Particle_Swarm_Optimization","3003600_Nullifying_ACF_grating_lobes_in_stepped-frequency_train_of_LFM_pulses","271510443_Radar_Signals","251664070_A_multiobjective_optimization_approach_to_determine_the_parameters_of_stepped_frequency_pulse_train","3946123_Nonlinear_synthetic_wideband_waveforms","3493594_Frequency-jumped_burst_waveforms_with_stretch_processing","3418687_A_fast_and_elitist_multiobjective_genetic_algorithm_NSGA-II","2526557_A_fast_and_elitist_multi-objective_genetic_algorithm_NSGAII"]}