{"id":"304582625_A_fly's_view_of_neuronal_remodeling","abstract":"Developmental neuronal remodeling is a crucial step in sculpting the final and mature brain connectivity in both vertebrates and invertebrates. Remodeling includes degenerative events, such as neurite pruning, that may be followed by regeneration to form novel connections during normal development. Drosophila provides an excellent model to study both steps of remodeling since its nervous system undergoes massive and stereotypic remodeling during metamorphosis. Although pruning has been widely studied, our knowledge of the molecular and cellular mechanisms is far from complete. Our understanding of the processes underlying regrowth is even more fragmentary. In this review, we discuss recent progress by focusing on three groups of neurons that undergo stereotypic pruning and regrowth during metamorphosis, the mushroom body γ neurons, the dendritic arborization neurons and the crustacean cardioactive peptide peptidergic neurons. By comparing and contrasting the mechanisms involved in remodeling of these three neuronal types, we highlight the common themes and differences as well as raise key questions for future investigation in the field. WIREs Dev Biol 2016, 5:618–635. doi: 10.1002/wdev.241\nFor further resources related to this article, please visit the WIREs website","authors":["Shiri P Yaniv","Oren Schuldiner"],"meta":["June 2016Wiley Interdisciplinary Reviews: Developmental Biology 5(5)","DOI:10.1002/wdev.241"],"references":["281372637_Long_term_ex_vivo_culturing_of_Drosophila_brain_as_a_method_to_live_image_pupal_brains_Insights_into_the_cellular_mechanisms_of_neuronal_remodeling","277561150_Contrasting_developmental_axon_regrowth_and_neurite_sprouting_of_Drosophila_mushroom_body_neurons_reveals_shared_and_unique_molecular_mechanisms_Sprouting_Assay_of_Primary_Fly_Neurons","275360335_Hippocampal_Pruning_as_a_New_Theory_of_Schizophrenia_Etiopathogenesis","274642780_The_over-pruning_hypothesis_of_autism","273953582_An_ESCRT_module_is_required_for_neuron_pruning","292073725_Schizophrenia_risk_from_complex_variation_of_complement_component_4","290481462_Nitric_Oxide_as_a_Switching_Mechanism_Between_Axon_Degeneration_and_Regrowth_During_Developmental_Remodeling","283747712_Developmental_Axon_Pruning_Requires_Destabilization_of_Cell_Adhesion_by_JNK_Signaling","281337859_Dendritic_Remodeling_Lessons_from_Invertebrate_Model_Systems","279112462_Regressive_events_in_neurogenesis"]}