{"id":"304555556_Klout_Score_Measuring_Influence_Across_Multiple_Social_Networks","abstract":"In this work, we present the Klout Score, an influence scoring system that\nassigns scores to 750 million users across 9 different social networks on a\ndaily basis. We propose a hierarchical framework for generating an influence\nscore for each user, by incorporating information for the user from multiple\nnetworks and communities. Over 3600 features that capture signals of\ninfluential interactions are aggregated across multiple dimensions for each\nuser. The features are scalably generated by processing over 45 billion\ninteractions from social networks every day, as well as by incorporating\nfactors that indicate real world influence. Supervised models trained from\nlabeled data determine the weights for features, and the final Klout Score is\nobtained by hierarchically combining communities and networks. We validate the\ncorrectness of the score by showing that users with higher scores are able to\nspread information more effectively in a network. Finally, we use several\ncomparisons to other ranking systems to show that highly influential and\nrecognizable users across different domains have high Klout scores.","authors":["Adithya Rao","Nemanja Spasojevic","Zhisheng Li","Trevor Dsouza"],"meta":["October 2015","DOI:10.1109/BigData.2015.7364017","Conference: 2015 IEEE International Conference on Big Data (Big Data)"],"references":["277959435_When-To-Post_on_Social_Networks","266660344_LASTA_Large_scale_topic_assignment_on_multiple_social_networks","221520230_Identifying_the_influential_bloggers_in_a_community_WSDM_'08","221520147_Twitterrank_Finding_Topic-Sensitive_Influential_Twitterers","276465179_Online_topic-aware_inuence_maximization","257252944_How_much_Klout_do_you_have_A_test_of_system_generated_cues_on_source_credibility","221653366_Social_influence_analysis_in_large-scale_networks","221653337_Efficient_influence_maximization_in_social_networks","220876100_Modelling_Influence_in_a_Social_Network_Metrics_and_Evaluation","220876063_Discovering_Influence_in_Communication_Networks_Using_Dynamic_Graph_Analysis","220866465_Measuring_influence_on_Twitter","2477877_Maximizing_the_Spread_of_Influence_through_a_Social_Network"]}