{"id":"304568148_Factores_de_riesgo_y_niveles_de_burnout_en_enfermeras_de_atencion_primaria_una_revision_sistematica","abstract":"Objetivo: Conocer los factores de riesgo y los niveles de burnout en enfermeras de atención primaria.\nMetodología: Se realizó una revisión sistemática.\nFuentes de datos: Se consultaron CINAHL, CUIDEN, LILACS, Pubmed, ProQuest, ScienceDirect y Scopus. Las ecuaciones de búsqueda fueron: «burnout AND community health nursing» y «burnout AND primary care nursing». La búsqueda se realizó en octubre del 2015.\nSelección de estudios: La muestra final fue de n = 12. Se incluyeron estudios primarios cuantitativos que utilizasen el Maslach Burnout Inventory para evaluar el burnout en enfermeras de atención primaria, sin restricción por fecha de publicación.\nExtracción de datos: Las principales variables fueron la media y desviación típica de las 3 dimensiones del burnout, las prevalencias de niveles bajos, medios y altos de cada dimensión, y los factores sociodemográficos, laborales y psicológicos que potencialmente influyen en su desarrollo.\nResultados: Los estudios muestran prevalencias de cansancio emocional alto, por lo general, entre el 23 y el 31%. Las prevalencias de despersonalización alta y realización personal baja muestran heterogeneidad, variando entre el 8-32 y el 4-92% de la muestra respectivamente. Los estudios informan de que las enfermeras con mayor edad, mayor antigüedad laboral, ansiedad y depresión, entre otras variables, presentan mayores niveles de burnout, mientras que aquellas con mayor sueldo, satisfacción laboral alta, apoyo de la organización y buen autoconcepto lo padecen menos.\nConclusión: El cansancio emocional alto es la principal dimensión del burnout afectada en la enfermería de atención primaria. En despersonalización y realización personal existe heterogeneidad. Debe prevenirse el burnout en estos profesionales potenciando los factores protectores y vigilando su aparición en los que presenten factores de riesgo.","authors":["Jose Luis Gómez Urquiza","Carolina Monsalve","Concepcion San Luis","Rafael Fernández-Castillo"],"meta":["June 2016Atención Primaria 49(2)","DOI:10.1016/j.aprim.2016.05.004"],"references":["304564323_Guia_de_lectura_critica_de_estudios_observacionales_en_epidemiologia","304564097_Prevalencia_bayesiana_y_niveles_de_burnout_en_enfermeria_de_urgencias_Una_revision_sistematica_Bayesian_prevalence_and_burnout_levels_in_emergency_nurses_A_systematic_review","284358714_Prevalencia_bayesiana_y_niveles_de_burnout_en_enfermeria_de_urgencias_Una_revision_sistematica","281507853_The_Impact_of_Healthcare_Workers_Job_Environment_on_Their_Mental-emotional_Health_Coping_Strategies_The_Case_of_a_Local_General_Hospital","279923825_Risk_Factors_And_Prevalence_Of_Burnout_Syndrome_In_The_Nursing_Profession","279910902_Which_Aspects_of_Professional_Commitment_Can_Effectively_Retain_Nurses_in_the_Nursing_Profession","301591954_Prevalence_Risk_Factors_and_Levels_of_Burnout_Among_Oncology_Nurses_A_Systematic_Review","288191692_Prevalencia_del_Sindrome_de_Burnout_en_enfermeras_de_hospitalizacion_y_Atencion_Primaria","284272073_Influencia_de_los_turnos_de_trabajo_y_las_guardias_nocturnas_en_la_aparicion_del_Sindrome_de_Burnout_en_medicos_y_enfermeras","280120212_Effect_of_professional_self-concept_on_burnout_among_community_health_nurses_in_Chengdu_China_The_mediator_role_of_organisational_commitment"]}