{"id":"304611383_The_power_of_recourse_for_online_MST_and_TSP","abstract":"We consider online versions of the minimum spanning tree (MST) problem and the traveling salesman problem (TSP) where recourse is allowed. The nodes of an unknown graph with metric edge cost appear one by one and must be connected in such a way that the resulting tree or tour has low cost. In the standard online setting, with irrevocable decisions, no algorithm can guarantee a constant-competitive ratio. In our model we allow recourse actions by giving a limited budget of edge rearrangements per iteration. It has been an open question for more than 20 years whether an online algorithm equipped with a constant (amortized) budget can guarantee constant-approximate solutions. As our main result, we answer this question affrmatively in an amortized setting. We introduce an algorithm that maintains a nearly optimal tree when given a constant amortized budget. Unlike in classical TSP variants, the standard double-tree and shortcutting approach does not give constant guarantees in the online setting. We propose a nontrivial robust shortcutting technique that allows translation of online MST results into TSP results at the loss of small factors. © 2016 Nicole Megow, Martin Skutella, José Verschae, Andreas Wiese.","authors":["Nicole Megow","Martin Skutella","José Verschae","Andreas Wiese"],"meta":["January 2016SIAM Journal on Computing 45(3):859-880","DOI:10.1137/130917703"],"references":["262370843_The_power_of_recourse_for_online_MST_and_TSP","238832128_Algorithms_for_the_On-Line_Travelling_Salesman_1","313136089_Routing_of_multipoint_connections","305527675_The_power_of_deferral_Maintaining_a_constant-competitive_steiner_tree_online","268645053_The_Traveling_Salesman_Problem_A_Computational_Study","265453391_The_traveling_salesman_problem_Bibliography","263047674_Introduction_to_Stochastic_Dynamic_Programming","259478263_Online_Steiner_Tree_with_Deletions","247009847_On-line_algorithms_for_Steiner_tree_problems","235067784_Worst-Case_Analysis_of_a_New_Heuristic_for_the_Traveling_Salesman_Problem"]}