{"id":"304620784_Assessment_and_Feedback_in_the_Final-Year_Engineering_Project","abstract":"The final-year project (FYP) is considered to be one of the most important learning experiences in an engineering undergraduate education. It is mandated by engineering accreditation bodies worldwide as a compulsory module in the engineering curriculum. For most fresh graduate engineers, their final-year project experience will be the most vivid of all their recent memories when they recall their engineering education experience. This is due to the immense challenge the students face by undertaking for the very first time an individual, highly complex, open-ended research work with tight deadlines to meet and high expectations to attain on their own, albeit under the guidance of their supervisors. As such the FYPs’ delivery and assessment process offer strategic opportunities for engineering educators to add value to an undergraduate engineer’s training provided that it is designed and implemented with a clear intent. This paper documents the assessment approach adopted by School of Engineering, Taylor’s University, for the FYP module which is divided into the FYP1 and FYP2 modules covering two semesters. This assessment process is distinct from the practices at many other equivalent institutions in that it has as much as 6 assessment components for each module, assessors other than the supervisor contribute the bulk of the marks, timely feedback from assessors to students is fully integrated into the assessment process to facilitate learning and students are required to participate in a research conference which is also made into one of the assessment components. For this undergraduate conference, the students’ FYP research papers are reviewed by external reviewers from other universities and assessed and awarded marks by them. A detailed description of each assessment component followed by an evaluation of how each assessment component adds value to the students’ learning for both the FYP1 and FYP2 modules is discussed.","authors":["Douglas Tong","Siow Chun Lim"],"meta":["January 2016","DOI:10.1007/978-981-10-0908-2_12","In book: Assessment for Learning Within and Beyond the Classroom (pp.125-136)"],"references":["299850225_Final_Year_Engineering_Project_and_Its_Contribution_to_Holistic_Education","285750862_Using_rubrics_to_promote_thinking_and_learning","266233473_Undergraduate_Computer_Science_Projects_in_UK_What_is_the_point","258163823_A_Systematic_Approach_to_the_Pedagogic_Design_of_Final_Year_Projects_Learning_Outcomes_Supervision_and_Assessment","255823514_A_blueprint_for_an_integrated_project_based_learning_framework_in_engineering_education_A_case_study_at_Taylor's_University","249037732_Rubric-Referenced_Self-Assessment_and_Self-Efficacy_for_Writing","292009517_Recommendations_for_developing_classroom_performance_assessments_and_scoring_rubrics","288863319_An_overview_on_transformative_learning","277135367_Work_In_progress_use_of_social_software_for_final_year_project_supervision_at_a_campus_based_university","259078375_Promotion_Of_Final_Year_Capstone_Projects"]}