{"id":"304668936_De-anonymizing_Social_Networks_and_Inferring_Private_Attributes_Using_Knowledge_Graphs","abstract":"Social network data is widely shared, transferred and published for research purposes and business interests, but it has raised much concern on users' privacy. Even though users' identity information is always removed, attackers can still de-anonymize users with the help of auxiliary information. To protect against de-anonymization attack, various privacy protection techniques for social networks have been proposed. However, most existing approaches assume specific and restrict network structure as background knowledge and ignore semantic level prior belief of attackers, which are not always realistic in practice and do not apply to arbitrary privacy scenarios. Moreover, the privacy inference attack in the presence of semantic background knowledge is barely investigated. To address these shortcomings, in this work, we introduce knowledge graphs to explicitly express arbitrary prior belief of the attacker for any individual user. The processes of de-anonymization and privacy inference are accordingly formulated based on knowledge graphs. Our experiment on data of real social networks shows that knowledge graphs can strengthen de-anonymization and inference attacks, and thus increase the risk of privacy disclosure. This suggests the validity of knowledge graphs as a general effective model of attackers' background knowledge for social network privacy preservation. Index Terms—Social network data publishing, attack and privacy preservation, knowledge graph.","authors":["Jianwei Qian","Xiang-Yang Li","Chunhong Zhang","Linlin Chen"],"meta":["December 2016","DOI:10.1109/INFOCOM.2016.7524578","Conference: IEEE INFOCOM","Project: Social Network De-Anonymization and Privacy Inference with Knowledge Graph Model"],"references":["304670616_Graph-Based_Privacy-Preserving_Data_Publication","304415312_A_Differentially_Private_Selective_Aggregation_Scheme_for_Online_User_Behavior_Analysis","300416292_A_Differentially_Private_Selective_Aggregation_Scheme_for_Online_User_Behavior_Analysis","312447989_Venkitasubramaniam_ldiversity_Privacy_beyond_k-anonymity","304007758_L-diversity_Privacy_beyond_k-AnonymityJ","301402242_Predicting_the_influencers_on_wireless_subscriber_churn","300925103_On_Your_Social_Network_De-anonymizablity_Quantification_and_Large_Scale_Evaluation_with_Seed_Knowledge","290962656_Structure_Based_Data_De-Anonymization_of_Social_Networks_and_Mobility_Traces","290767110_Knowledge_Graph_Identification","289060674_Community-Enhanced_De-anonymization_of_Online_Social_Networks"]}