{"id":"304789248_A_fast_marching_algorithm_for_the_factored_eikonal_equation","abstract":"The eikonal equation is instrumental in many applications in several fields ranging from computer vision to geoscience. This equation can be efficiently solved using the iterative Fast Sweeping (FS) methods and the direct Fast Marching (FM) methods. However, when used for a point source, the original eikonal equation is known to yield inaccurate numerical solutions, because of a singularity at the source. In this case, the factored eikonal equation is often preferred, and is known to yield a more accurate numerical solution. One application that requires the solution of the eikonal equation for point sources is travel time tomography. This inverse problem may be formulated using the eikonal equation as a forward problem. While this problem has been solved using FS in the past, the more recent choice for applying it involves FM methods because of the efficiency in which sensitivities can be obtained using them. However, while several FS methods are available for solving the factored equation, the FM method is available only for the original eikonal equation. \nIn this paper we develop a Fast Marching algorithm for the factored eikonal equation, using both first and second order finite-difference schemes. Our algorithm follows the same lines as the original FM algorithm and requires the same computational effort. In addition, we show how to obtain sensitivities using this FM method and apply travel time tomography, formulated as an inverse factored eikonal equation. Numerical results in two and three dimensions show that our algorithm solves the factored eikonal equation efficiently, and demonstrate the achieved accuracy for computing the travel time. We also demonstrate a recovery of a 2D and 3D heterogeneous medium by travel time tomography using the eikonal equation for forward modelling and inversion by Gauss-Newton.","authors":["Eran Treister","Eldad Haber"],"meta":["November 2016Journal of Computational Physics 324:210–225","DOI:10.1016/j.jcp.2016.08.012"],"references":["304350922_jInv--a_Flexible_Julia_Package_for_PDE_Parameter_Estimation","278622843_Accurate_3-D_finite_difference_computation_of_traveltimes_in_strongly_heterogeneous_media","274519131_First-arrival_traveltime_tomography_based_on_the_adjoint-state_method","270887869_First_Arrival_Traveltime_Tomography_Using_the_Fast_Marching_Method_and_the_Adjoint_State_Technique","268636544_High-Order_Factorization_Based_High-Order_Hybrid_Fast_Sweeping_Methods_for_Point-Source_Eikonal_Equations","258787673_Automatic_traveltime_picking_using_instantaneous_traveltime","285891007_Efficient_algorithms_for_globally_optimal_trajectories","275173290_Viscosity_Solutions_of_Hamilton-Jacobi_Equations_in_Banach_Spaces","268455226_First-break_traveltime_tomography_with_the_double-square-root_eikonal_equation","261726065_Fast_Huygens_sweeping_methods_for_Helmholtz_equations_in_inhomogeneous_media_in_the_high_frequency_regime"]}