{"id":"304758073_LSTM-based_Encoder-Decoder_for_Multi-sensor_Anomaly_Detection","abstract":"Mechanical devices such as engines, vehicles, aircrafts, etc., are typically instrumented with numerous sensors to capture the behavior and health of the machine. However, there are often external factors or variables which are not captured by sensors leading to time-series which are inherently unpredictable. For instance, manual controls and/or unmonitored environmental conditions or load may lead to inherently unpredictable time-series. Detecting anomalies in such scenarios becomes challenging using standard approaches based on mathematical models that rely on stationarity, or prediction models that utilize prediction errors to detect anomalies. We propose a Long Short Term Memory Networks based Encoder-Decoder scheme for Anomaly Detection (EncDec-AD) that learns to reconstruct 'normal' time-series behavior, and thereafter uses reconstruction error to detect anomalies. We experiment with three publicly available quasi predictable time-series datasets: power demand, space shuttle, and ECG, and two real-world engine datasets with both predictive and unpredictable behavior. We show that EncDec-AD is robust and can detect anomalies from predictable, unpredictable, periodic, aperiodic, and quasi-periodic time-series. Further, we show that EncDec-AD is able to detect anomalies from short time-series (length as small as 30) as well as long time-series (length as large as 500).","authors":["Pankaj Malhotra","Anusha Ramakrishnan","Gaurangi Anand","Lovekesh Vig"],"meta":["July 2016","Projects: Time Series Anomaly DetectionSensor analytics"],"references":["308852664_Anomaly_detection_in_ECG_time_signals_via_deep_long_short-term_memory_networks","304782562_Long_Short_Term_Memory_Networks_for_Anomaly_Detection_in_Time_Series","301896349_ODE_-_Augmented_Training_Improves_Anomaly_Detection_in_Sensor_Data_from_Machines","312210566_Principal_Component_Analysis","288492549_Anomaly_Detection_Using_Autoencoders_with_Nonlinear_Dimensionality_Reduction","278048447_Scheduled_Sampling_for_Sequence_Prediction_with_Recurrent_Neural_Networks","277722709_A_Hierarchical_Neural_Autoencoder_for_Paragraphs_and_Documents","269997813_Grammar_as_a_Foreign_Language","269935079_Adam_A_Method_for_Stochastic_Optimization","269503706_Detection_of_Abrupt_Changes_Theory_and_Application"]}