{"id":"304789093_Full_Waveform_Inversion_Guided_by_Travel_Time_Tomography","abstract":"Full waveform inversion (FWI) is a process in which seismic numerical simulations\nare fit to observed data by changing the wave velocity model of the medium under investigation. The problem is non-linear, and therefore optimization techniques have been used to find a reasonable solution to the problem. The main problem in fitting the data is the lack of low spatial frequencies. This deficiency often leads to a local minimum and to non-plausible solutions. In this work we explore how to obtain low frequency information for FWI. Our approach involves augmenting FWI with travel time tomography, which has low-frequency features. By jointly inverting these two problems we enrich FWI with information that can replace low frequency data. In addition, we use high order regularization, in a preliminary inversion stage, to prevent high frequency features from polluting our model in the initial stages of the reconstruction. This regularization also promotes the non-dominant low-frequency modes that exist in the FWI sensitivity. By applying a joint FWI and travel time inversion we are able to obtain a smooth model than can later be used to recover a good approximation for the true model. A second contribution of this paper involves the acceleration of the main computational bottleneck in FWI--the solution of the Helmholtz equation. We show that the solution time can be reduced by solving the equation for multiple right hand sides using block multigrid preconditioned Krylov methods.","authors":["Eran Treister","Eldad Haber"],"meta":["October 2017SIAM Journal on Scientific Computing 39(5):S587-S609","DOI:10.1137/16M1082718"],"references":["304789248_A_fast_marching_algorithm_for_the_factored_eikonal_equation","304350922_jInv--a_Flexible_Julia_Package_for_PDE_Parameter_Estimation","276235077_Non-Galerkin_Multigrid_Based_on_Sparsified_Smoothed_Aggregation","274729926_A_penalty_method_for_PDE-constrained_optimization_in_inverse_problems","312456680_A_flexible_inner-outer_preconditioned_GMRES_algorithm","303854627_A_Flexible_inner-outer_preconditionned_GMRES_Algorithm","299909761_Joint_traveltime_and_waveform_envelope_inversion_for_near-surface_imaging","295874118_Measuring_the_misfit_between_seismograms_using_an_optimal_transport_distance_Application_to_full_waveform_inversion","281084104_Complex_Additive_Geometric_Multilevel_Solvers_for_Helmholtz_Equations_on_Spacetrees","274518781_Simultaneous_inversion_of_full_data_bandwidth_by_tomographic_full-waveform_inversion"]}