{"id":"304762619_Reference_Architecture_Representation_by_an_Ontology_for_Healthcare_Information_Systems_Software_Product_Line","abstract":"Software Product Lines (SPL) are based on assets reuse for software development and claim to reduce costs and time to market, while increasing the quality of derived products, guaranteeing the SPL evolution. SPL is now a well known approach in academic and industrial practices. The specification of the SPL domain knowledge or SPL area, is crucial to design a reusable and evolutionary Reference Architecture (RA), being RA one of the major SPL artifacts; the concrete software products members of the SPL family in the specific domain, will be derived from this RA. On the other hand, ontologies, representing hierarchically organized knowledge, have been used to specify and verify consistency of the SPL domain knowledge. The goal of this work is to present an ontology, called HIS-RA Ontology, to specify the knowledge imbedded into RA for the Healthcare Information Systems Healthcare Information Systems (HIS) domain, called HIS-RA, which has been defined in previous works, and was specified as a non-directed connected graph (P, R), where P are the components or nodes and R the edges or connectors relating components. HIS-RA has been built by a bottom-up process using the knowledge on existing market products. The HIS-RA Ontology can be used to derive consistency rules for the\nconstruction of valid architectural configurations or feasible solutions (FS), for concrete products, constructed by instantiating HIS-RA. Quality requirements that the HIS-RA functionalities or core of common components must fulfil, are considered in order to guarantee the global quality of concrete products. The design of a semiautomatic FS derivation process using the HIS-RA Ontology presented here and its support tool, is an on-going work.","authors":["Francisca Losavio","Oscar Ordaz"],"meta":["May 2016","Conference: SCTC 2016 - IV Simposio Científico y Tecnológico en ComputaciónAt: Escuela de Computación Facultad de Ciencias, Universidad Central de Venezuela, Caracas, Venezuela"],"references":["304763529_Quality-based_Heuristic_for_Optimal_Product_Derivation_in_Software_Product_Lines_Quality-based_Optimal_Product_Derivation_in_SPL","303165430_Building_a_security_reference_architecture_for_cloud_systems","287269160_Enterprise_architecture_at_work_Modelling_communication_and_analysis","285752337_A_Framework_for_Information_Systems_Architecture","283230691_Quality-based_bottom-up_design_of_reference_architecture_applied_to_Healthcare_Integrated_Information_Systems","275771587_On_the_Use_of_Ontology_for_Dynamic_Reconfiguring_Software_Product_Line_Products","272786788_Refactoring_Graph_for_Reference_Architecture_Design_Process","268206484_Extension_de_OWL-S_avec_les_Standards_de_Qualite","280305168_Enterprise_Architecture_at_Work_Modelling_Communication_and_Analysis","268656105_Requirements_engineering_Foundations_principles_and_techniques"]}