{"id":"304762438_Quality-Based_Bottom-up_Design_of_Reference_Architecture_applied_to_Healthcare_Integrated_Information_Systems_Qualty-Based_RA_Design","abstract":"Software Product Line (SPL) is a set of software-intensive systems, sharing a common, managed set of features that satisfy the specific needs of a particular market segment or domain. Reference Architecture (RA) is the main asset shared by all SPL products; it covers commonality and variability of the SPL family of products or systems and it is used as a template to produce new products. We propose a semi-automatic bottom-up refactoring process to build RA considering the logic view (static aspects) of architectures of existing products in a domain, represented by a connected graph or valid architectural configuration. A candidate architecture (CA) is obtained automatically and manually completed by introducing new variants to satisfy quality properties. RA is finally built by grouping into variation points CA variants accomplishing similar tasks. We consider functional and non-functional variability modeling of components and connectors. The quality properties to be satisfied are specified by the ISO/IEC 25010 quality model, using scenarios of available architectural solutions for each quality property that can be traced to the original component requiring it; our approach combines quality standards with goal-oriented techniques to consider non-functional variability, which is still an open research issue in SPL. The complete RA design process is applied to the domain of Integrated Healthcare Information Systems. Keywords—software product line, reference architecture, bottom-up design, non-functional requirements, quality model.","authors":["Francisca Losavio","Oscar Ordaz","Victor Esteller"],"meta":["May 2014","Conference: RCIS 2015 - Research Challenges in Information SystemsAt: Athenes - Greece"],"references":["272786788_Refactoring_Graph_for_Reference_Architecture_Design_Process","261156335_Graph_Modelling_of_a_Refactoring_Process_for_Product_Line_Architecture_Design","260810929_FreeLibre_Open_Source_Software_in_Health_Care_A_Review","249704579_Attribute-based_techniques_to_evaluate_architectural_styles_Case_study_for_interactive_systems","238381956_A_41_View_Model_of_Software_Architecture","235088008_The_Architecture_Based_Design_Method","258967720_PointCounterpoint","251879798_Applied_Software_Architecture","237035414_Crystal_Clear_The_Unified_Software_Development_Process","224001291_Software_Architecture_Perspectives_on_an_Emerging_Discipline"]}