{"id":"304708318_Caracteristicas_Socioeconomicas_y_Rendimiento_Academico_El_Caso_de_una_Universidad_Argentina","abstract":"El objetivo de la investigación es determinar mediante regresiones estadísticas las relaciones entre las características socioeconómicas de los alumnos de las carreras de grado de la Universidad Nacional del Nordeste (UNNE, Argentina) y sus resultados académicos, y compararlos con los hallazgos de estudios similares efectuados en otras universidades nacionales. Se encuentra evidencia contundente de que las variables de Nivel Socioeconómico (NSE) son significativas para explicar las diferencias de rendimiento académico entre los alumnos de las facultades analizadas. Las variables que se han utilizado como indicadores de NSE elevado han presentado una correlación positiva, y las variables que se emplearon como indicadores de NSE más bajo han presentado una correlación negativa. Las variables sexo femenino, edad, estado civil casado y situación laboral inactiva están asociadas a un mejor rendimiento académico, mientras que las variables cantidad de hijos del estudiante, situación laboral ocupado, situación laboral desocupado, ausencia de cobertura médica y beneficiario de planes sociales están relacionadas a menores desempeños académicos. En materia de género, el hallazgo más relevante se manifiesta en los resultados de las estudiantes mujeres con hijos: su rendimiento es notoriamente inferior al de los estudiantes hombres con hijos.","authors":["Carlos Cristóbal Coschiza","Juan Martín Fernández","Guillermo Gapel Redcozub","Marcelo E. Nievas"],"meta":["July 2016Revista Iberoamericana sobre Calidad, Eficacia y Cambio en Educación 14.3(2016)","DOI:10.15366/reice2016.14.3.003"],"references":["326678112_Maestro_aula_y_aprendizaje_en_America_Latina_Los_datos_del_SERCE","317478126_La_desigualdad_de_resultados_educativos_aportes_a_la_teoria_desde_la_investigacion_sobre_eficacia_escolar","268045328_Do_Peers_Affect_Student_Achievement","303197102_Introductory_Econometrics_A_Modern_Approach","285497399_Synthesis_of_educational_productivity_research","271735224_Influences_on_Academic_Achievement_A_Comparison_of_Results_from_Uganda_and_More_Industrialized_Societies","271685789_Influences_on_Academic_Achievement_Across_High_and_Low_Income_Countries_A_Re-Analysis_of_IEA_Data","267821706_Escuelas_ricas_para_los_pobres_La_discriminacion_social_en_la_educacion_primaria_argentina_sus_efectos_en_los_aprendizajes_y_propuestas_para_superarla","262555552_Condicionantes_socioeconomicos_para_la_aprobacion_de_la_primera_asignatura_de_la_carrera_de_Medicina","262512084_Factores_asociados_al_rendimiento_academico_en_estudiantes_universitarios_desde_el_nivel_socioeconomico_Un_estudio_en_la_Universidad_de_Costa_Rica"]}