{"id":"304878189_The_effect_of_EBM_process_parameters_upon_surface_roughness","abstract":"Purpose\n\nThe surface roughness of products manufactured using the additive manufacturing (AM) technology of electron beam melting (EBM) has a special characteristic. Different product applications can demand rougher or finer surface structure, so the purpose of this study is to investigate the process parameters of EBM to find out how they affect surface roughness.\n\nDesign/methodology/approach\n\nEBM uses metal powder to manufacture metal parts. A design of experiment plan was used to describe the effects of the process parameters on the average surface roughness of vertical surfaces.\n\nFindings\n\nThe most important electron beam setting for surface roughness, according to this study, is a combination of “speed and current” in the contours. The second most important parameter is “contour offset”. The interaction between the “number of contours” and “contour offset” also appears to be important, as it shows a much higher probability of being active than any other interaction. The results show that the “line offset” is not important when using contours.\n\nResearch limitations/implications\n\nThis study examined “contour offset”, “number of contours”, “speed in combination with current” and “line offset”, which are process parameters controlling the electron beam.\n\nPractical implications\n\nThe surface properties could have an impact on the product’s performance. A reduction in surface processing will not only save time and money but also reduce the environmental impact.\n\nOriginality/value\n\nSurface properties are important for many products. New themes containing process parameters have to be developed when introducing new materials to EBM manufacturing. During this process, it is very important to understand how the electron beam affects the melt pool.","authors":["Rebecca Klingvall EK","Lars-Erik Rännar","Mikael Bäckstöm","Peter Carlsson"],"meta":["April 2016Rapid Prototyping Journal 22(3):495-503","DOI:10.1108/RPJ-10-2013-0102"],"references":["229438894_Effect_of_process_parameters_settings_and_thickness_on_surface_roughness_of_EBM_produced_Ti-6Al-4V","6702442_The_role_of_whole_blood_in_thrombin_generation_in_contact_with_various_titanium_surfaces","266205612_Characterization_and_comparison_of_materials_produced_by_Electron_Beam_Melting_EBM_of_two_different_Ti-6Al-4V_powder_fractions","244114801_Efficient_cooling_with_tool_inserts_manufactured_by_electron_beam_melting","243463198_Top_surface_and_side_roughness_of_Inconel_625_Parts_processed_using_selective_laser_melting","240676902_Mechanisms_Involved_in_Osteoblast_Response_to_Implant_Surface_Morphology","226488269_Metallic_Biomaterials_in_Skeletal_Repair","222829235_Direct_fabrication_through_electron_beam_melting_technology_of_custom_cranial_implants_designed_in_a_PHANToM-based_haptic_environment","26725872_Effects_of_titanium_surface_topography_on_bone_integration_A_systematic_review","13800667_Effects_of_surface_roughness_of_titanium_implants_on_bone_remodelling_of_femur_in_rabbits","12844350_Titanium_Is_a_Highly_Thrombogenic_Biomaterial_Possible_Implications_for_Osteogenesis"]}