{"id":"304808403_Les_ecrits_d'eleves_un_corpus_de_reference_pour_le_francais_contemporain","abstract":"La situation d’apprentissage de l’écriture et les difficultés qu’elle révèle mettent au jour des zones de la langue qui apparaissent caractéristiques et délicates à maîtriser chez les scripteurs débutants. Ce constat nous a conduits à constituer une base de données d’écrits d’élèves en vue d’explorer systématiquement les différentes composantes du français qui résistent ou qui évoluent dans le processus d’acquisition de l’écriture. Notre communication retrace, dans un premier temps, les problèmes spécifiques posés par ce type de corpus, en particulier pour ce qui concerne le protocole de transcription et d’annotation. Les écarts à la norme des apprentis scripteurs doivent en effet faire l’objet d’annotations spécifiques pour que les éléments verbaux soient lemmatisés correctement. Dans une deuxième partie, nous exposons deux types d’investigations menées dans ce corpus à propos de la ponctuation blanche : i) les espaces et blancs de textes ; ii ) la segmentation de mots. Il s’agit de montrer comment le corpus que nous constituons, à travers les conventions d’annotation qui ont été construites, permet de repérer des éléments caractéristiques de la manière dont les élèves délimitent et ponctuent leurs écrits, mais aussi d’observer comment cette ponctuation blanche évolue pour en extraire des indications propres à accompagner ou renouveler les apprentissages induits.","authors":["David Jacques","Claire Doquet"],"meta":["January 2016SHS Web of Conferences 27(2):11001","DOI:10.1051/shsconf/20162711001","Project: Écriture scolaire et universitaire : Corpus, Analyses Linguistiques"],"references":["272439466_Les_explications_metagraphiques_appliquees_aux_premieres_ecritures_enfantines","277590923_Principes_et_conventions_de_l'edition_diplomatique","274751856_Quelques_elements_d'une_theorie_de_la_ponctuation_blanche_-par_la_poesie_contemporaine","272651578_La_double_hybridation_de_l'unite_lexicale","272434939_Manuscrits_de_travail_et_linguistique_de_la_production_ecrite","266293296_Prolegomenes_a_une_theorie_du_langage","250284651_Une_approche_psycholinguistique_de_la_ponctuation_Etude_en_production_et_en_comprehension","250284538_Pour_une_graphematique_autonome","250284525_La_ponctuation","250284087_Une_photo_deux_textes_trois_manuscrits_L'archivage_linguistique_d'un_geste_d'ecriture_identifiant"]}