{"id":"304812511_Modified_Quadrant-Based_Routing_Algorithm_for_3D_Torus_Network-on-Chip_Architecture","abstract":"Due to high performance demands of the consumer electronics and processing systems, like servers, the number of cores is increasing on System-on-Chip (SoC). Network-on-Chip (NoC) is suitable approach for reducing the communication bottleneck of multicore System-on-Chip. With the integration of 3D IC technology, the 3D Network-on-Chip design enhances the execution rate and decreases power utilization by replacing long flat interconnects with short vertical ones. New compact architectures are possible by arranging the cores in three-dimensions. Optimized routing algorithms can provide higher execution speed along with reduced energy consumption. In this paper an efficient routing algorithm for 3D Torus topology architecture is proposed. A modified quadrant-based routing algorithm for 3D torus NoC architecture is proposed which is primarily based on division of space into different quadrants and also adopting a path which encounters least hops to connect to the destination node. The proposed algorithm is compared with other 3D routing algorithms like XYZ dimension order routing and the simulated results shows that the proposed algorithm has least latency.","authors":["Abdul Quaiyum Ansari","Mohammad Rashid Ansari","Ayoub Mohammad"],"meta":["July 2016Perspectives in Science 8(C)","DOI:10.1016/j.pisc.2016.06.069"],"references":["300717495_Enabling_Vertical_Wormhole_Switching_in_3D_NoC-Bus_Hybrid_Systems","273887706_Advancement_in_Energy_Efficient_Routing_Algorithms_for_3-D_Network-on-Chip_Architecture","261141489_Path-Based_Partitioning_Methods_for_3D_Networks-on-Chip_with_Minimal_Adaptive_Routing","261128954_An_efficient_tree-based_topology_for_network-on-chip","261084687_Quadrant-based_XYZ_dimension_order_routing_algorithm_for_3-D_Asymmetric_Torus_Routing_Chip_ATRC","238625662_Principles_and_Practices_of_Interconnection_Network","304827076_Quadrant-based_XYZ_dimension_order_routing_algorithm_for_3-D_asymmetric_torus_routing_chip","304230798_Performance_evaluation_of_various_parameters_of_Network-on-Chip_NoC_for_different_topologies","282461972_Design_automation_for_application-specific_on-chip_interconnects_A_survey"]}