{"id":"304992921_Pathology_Informatics_Essentials_for_Residents_A_Flexible_Informatics_Curriculum_Linked_to_Accreditation_Council_for_Graduate_Medical_Education_Milestones","abstract":"Context: \n-Recognition of the importance of informatics to the practice of pathology has surged. Training residents in pathology informatics has been a daunting task for most residency programs in the United States because faculty often lacks experience and training resources. Nevertheless, developing resident competence in informatics is essential for the future of pathology as a specialty.\n\nObjective: \n-To develop and deliver a pathology informatics curriculum and instructional framework that guides pathology residency programs in training residents in critical pathology informatics knowledge and skills, and meets Accreditation Council for Graduate Medical Education Informatics Milestones.\n\nDesign: \n-The College of American Pathologists, Association of Pathology Chairs, and Association for Pathology Informatics formed a partnership and expert work group to identify critical pathology informatics training outcomes and to create a highly adaptable curriculum and instructional approach, supported by a multiyear change management strategy.\n\nResults: \n-Pathology Informatics Essentials for Residents (PIER) is a rigorous approach for educating all pathology residents in important pathology informatics knowledge and skills. PIER includes an instructional resource guide and toolkit for incorporating informatics training into residency programs that vary in needs, size, settings, and resources. PIER is available at http://www.apcprods.org/PIER (accessed April 6, 2016).\n\nConclusions: \n-PIER is an important contribution to informatics training in pathology residency programs. PIER introduces pathology trainees to broadly useful informatics concepts and tools that are relevant to practice. PIER provides residency program directors with a means to implement a standardized informatics training curriculum, to adapt the approach to local program needs, and to evaluate resident performance and progress over time.","authors":["Walter H. Henricks","Donald Karcher","James H. Harrison","John Sinard"],"meta":["July 2016Archives of Pathology & Laboratory Medicine 141(1)","DOI:10.5858/arpa.2016-0199-OA"],"references":["298918885_Computer-assisted_Pathology_Encoding_and_Reporting_System_CAPER_An_On-line_Computer_System_Developed_at_the_Massachusetts_General_Hospital","23655194_Core_Content_for_the_Subspecialty_of_Clinical_Informatics"]}