{"id":"304992308_The_Materials_Data_Facility_Data_Services_to_Advance_Materials_Science_Research","abstract":"With increasingly strict data management requirements from funding agencies and institutions, expanding focus on the challenges of research replicability, and growing data sizes and heterogeneity, new data needs are emerging in the materials community. The materials data facility (MDF) operates two cloud-hosted services, data publication and data discovery, with features to promote open data sharing, self-service data publication and curation, and encourage data reuse, layered with powerful data discovery tools. The data publication service simplifies the process of copying data to a secure storage location, assigning data a citable persistent identifier, and recording custom (e.g., material, technique, or instrument specific) and automatically-extracted metadata in a registry while the data discovery service will provide advanced search capabilities (e.g., faceting, free text range querying, and full text search) against the registered data and metadata. The MDF services empower individual researchers, research projects, and institutions to (I) publish research datasets, regardless of size, from local storage, institutional data stores, or cloud storage, without involvement of third-party publishers; (II) build, share, and enforce extensible domain-specific custom metadata schemas; (III) interact with published data and metadata via representational state transfer (REST) application program interfaces (APIs) to facilitate automation, analysis, and feedback; and (IV) access a data discovery model that allows researchers to search, interrogate, and eventually build on existing published data. We describe MDF’s design, current status, and future plans.","authors":["Ben Blaiszik","Kyle Chard","Jim Pruyne","Rachana Ananthakrishnan"],"meta":["July 2016JOM: the journal of the Minerals, Metals & Materials Society 68(8)","DOI:10.1007/s11837-016-2001-3"],"references":["283517329_Commentary_The_Materials_Project_A_materials_genome_approach_to_accelerating_materials_innovation","233870697_AFLOWLIBORG_A_distributed_materials_properties_repository_from_high-throughput_ab_initio_calculations","281229145_Materials_Data_Science_Current_Status_and_Future_Outlook","280395235_Strategy_for_Extensible_Evolving_Terminology_for_the_Materials_Genome_Initiative_Efforts","274644887_AiiDA_Automated_Interactive_Infrastructure_and_Database_for_Computational_Science","274236204_The_Materials_Genome_Initiative_One_year_on","273350063_Efficient_and_Secure_Transfer_Synchronization_and_Sharing_of_Big_Data","262265879_The_Materials_Genome_Initiative_the_interplay_of_experiment_theory_and_computation","258167395_Materials_Design_and_Discovery_with_High-Throughput_Density_Functional_Theory_The_Open_Quantum_Materials_Database_OQMD","242434755_Digital_Object_Identifier_DOI_System"]}