{"id":"304942589_Enterprise_architecture_development_and_implementation_in_public_sector_The_Malaysian_perspective","abstract":"Enterprise Architecture (EA) is gaining the attention from the public sector as a solution to improve the function of e-Government. However, public sector agencies are having difficulties with its development and implementation due to inflexibility and complexity of the agencies’ business function and information technology structures. The objective of this paper is to identify the challenges faced by the Malaysian public sector agencies that are in development and implementation phase of EA. In order to get the holistic perspective of EA development and implementation scenario in each organisation, a Balanced Scorecard (BSC) approach is applied. A multiple case study research approach is utilized to achieve this study objective. Data were collected through interviews with the agencies EA team, general observation during the EA workshops as well as review of EA related documents. The result shows there are twenty challenges identified which is consistent with other challenges stated in literature except for talent management issue. Thus, this provides a new insight on how the public sector should implement their EA as compared to any other organisation.","authors":["Nur Azaliah Abu Bakar","Nazri Kama","Harihoddin Selamat"],"meta":["June 2016"],"references":["265692209_Exploring_Enterprise_Architecture_Evaluation_Practices_The_Case_of_a_Large_University","263618866_The_Enterprise_and_Its_Architecture_Ontology_Challenges","313561912_Potential_Critical_Success_Factors_for_Enterprise_Architecture","300452040_Realization_of_Enterprise_Architecture_EA_Benefits","297364963_Systemic_Enterprise_Architecture_as_Future_Tackling_Complexity_in_Governments_in_the_Cusp_of_Change","281085900_Transforming_the_Balanced_Scorecard_From_Performance_Measurement_to_Strategic_Management_Part_II","276001165_Integration_and_Enterprise_Architecture_Challenges_in_E-Government","272566756_Qualitative_Data_Analysis_A_Methods_Sourcebook","272356254_An_Enterprise_Architecture_Mapping_Approach_for_Realizing_e-Government","262392156_A_Principles-Based_Enterprise_Architecture_Lessons_from_Texaco_and_Star_Enterprise"]}