{"id":"305081951_Software_Engineering_Education_in_Chile_-_Status_Report","abstract":"Although most computer science graduates develop their professional careers as software engineers, there are no academic program with a specific focus on software engineering in Chile. Considering ACM/IEEE Software Engineering 2014 Curriculum Guidelines as a starting point, we analyzed the curricula of the CS Engineering and CS Technology programs offered by the most traditional Chilean universities, in order to establish to what extent they address the knowledge areas included in that recommendation. We also gathered information about theoretical and/or practical approaches of their courses, their types of evaluations and temporality. The results of this status report indicate that most knowledge areas of the ACM/IEEE curricula are covered but not all with the same emphasis. Programs count on three or four mandatory software engineering courses, most of them have a practical approach, are evaluated through exams and projects and start between the seventh and eight semesters. These results let us learn that some knowledge areas are not emphasized as they deserve. For example, Software Quality or Software Process are skills that industry often requires but academia does not seem to take into account. Similarly, it might be necessary to have students learn about software engineering earlier during their career. Knowing the actual status, actions can be taken.","authors":["Maíra Marques Samary","Sergio F. Ochoa","M. Cecilia Bastarrica"],"meta":["July 2016","DOI:10.1145/2899415.2899459","Conference: the 2016 ACM Conference"],"references":["259487148_An_assessment_of_the_software_engineering_curriculum_in_Turkish_universities_IEEEACM_guidelines_perspective","316858624_Computer_Science_Curricula_2013_Curriculum_Guidelines_for_Undergraduate_Degree_Programs_in_Computer_Science","269306967_Enhancing_the_software_engineering_curriculums_A_case_study_of_the_Jordanian_Universities","252046683_An_investigation_of_undergraduate_software_engineering_curriculum_Iranian_universities_case_study"]}