{"id":"305036152_Which_Doctor_to_Trust_A_Recommender_System_for_Identifying_the_Right_Doctors","abstract":"Background: \nKey opinion leaders (KOLs) are people who can influence public opinion on a certain subject matter. In the field of medical and health informatics, it is critical to identify KOLs on various disease conditions. However, there have been very few studies on this topic.\n\nObjective: \nWe aimed to develop a recommender system for identifying KOLs for any specific disease with health care data mining.\n\nMethods: \nWe exploited an unsupervised aggregation approach for integrating various ranking features to identify doctors who have the potential to be KOLs on a range of diseases. We introduce the design, implementation, and deployment details of the recommender system. This system collects the professional footprints of doctors, such as papers in scientific journals, presentation activities, patient advocacy, and media exposure, and uses them as ranking features to identify KOLs.\n\nResults: \nWe collected the information of 2,381,750 doctors in China from 3,657,797 medical journal papers they published, together with their profiles, academic publications, and funding. The empirical results demonstrated that our system outperformed several benchmark systems by a significant margin. Moreover, we conducted a case study in a real-world system to verify the applicability of our proposed method.\n\nConclusions: \nOur results show that doctors' profiles and their academic publications are key data sources for identifying KOLs in the field of medical and health informatics. Moreover, we deployed the recommender system and applied the data service to a recommender system of the China-based Internet technology company NetEase. Patients can obtain authority ranking lists of doctors with this system on any given disease.","authors":["Li Guo","Bo Jin","Cuili Yao","Haoyu Yang"],"meta":["July 2016Journal of Medical Internet Research 18(7):e186","DOI:10.2196/jmir.6015"],"references":["270741859_Discovery_of_Ranking_Fraud_for_Mobile_Apps","261996822_pSCANNER_patient-centered_Scalable_National_Network_for_Effectiveness_Research","220812324_Active_Surveying_A_Probabilistic_Approach_for_Identifying_Key_Opinion_Leaders","308161218_Introduction_to_information_retrieval_chapt","301413262_Identification_of_Opinion_Leaders_Based_on_User_Clustering_and_Sentiment_Analysis","270963344_The_focus_on_bibliometrics_makes_papers_less_useful","269205106_Unifying_learning_to_rank_and_domain_adaptation","257746060_Barriers_to_innovation_in_the_medical_nutrition_industry_A_quantitative_key_opinion_leader_analysis","226486366_A_Survey_of_Models_and_Algorithms_for_Social_Influence_Analysis","220812258_Generalized_Cluster_Aggregation"]}