{"id":"305080534_Processing_skyline_queries_in_incomplete_distributed_databases","abstract":"Due to its great benefits over many database applications, skyline queries have received formidable concern in the last decades. Skyline queries attempt to assist users by identifying the set of data items which represents the best results that meet the conditions of a given query. Most of the existing skyline techniques concentrate on identifying skylines over a single relation. However, in distributed databases, the process of skyline queries required accessing multiple relations which might be located at different sites. Consequently, data items from these multiple relations need to be joined and thus transferring these data items from one site to another is unavoidable. Moreover, the previous techniques also assume that the values of dimensions for every data item are presented (complete) which is not always true as some values may be missing. In this paper, we proposed an approach for processing skyline queries in incomplete distributed databases. The approach derives skylines from multiple relations where dominated data items are removed before joining the relations to reduce the processing time and the network cost. The experimental results illustrate that our proposed approach outperforms the previous approaches in terms of processing time and network cost.","authors":["Ali Amer Alwan","Hamidah Ibrahim","Nur Izura Udzir","Fatimah Sidi"],"meta":["April 2017Journal of Intelligent Information Systems 48(2)","DOI:10.1007/s10844-016-0419-2","Project: An Efficient Model for Processing Skyline Queries in Incomplete and Uncertain Databases"],"references":["227119097_On_High_Dimensional_Skylines","221613248_SaLSa_Computing_the_skyline_without_scanning_the_whole_sky","221310231_Maximal_Vector_Computation_in_Large_Data_Sets","251112556_Multi-dimensional_top-k_dominating_queries","225407949_Efficient_mining_of_skyline_objects_in_subspaces_over_data_streams","221463766_A_Novel_Incremental_Maintenance_Algorithm_of_SkyCube","221311261_Efficient_Processing_of_Top-k_Dominating_Queries_on_Multi-Dimensional_Data","221310438_Shooting_Stars_in_the_Sky_An_Online_Algorithm_for_Skyline_Queries","221310241_Efficient_Progressive_Skyline_Computation","221310178_Catching_the_Best_Views_of_Skyline_A_Semantic_Approach_Based_on_Decisive_Subspaces","221214974_Continuous_monitoring_of_top-k_queries_over_sliding_windows","221214278_Finding_k-dominant_skylines_in_high_dimensional_space","221103600_BITPEER_continuous_subspace_skyline_computation_with_distributed_bitmap_indexes","220965261_FlexPref_A_Framework_for_Extensible_Preference_Evaluation_in_Database_Systems","220503248_Personalized_top-k_skyline_queries_in_high-dimensional_space"]}