{"id":"305081774_Lessons_Learned_on_Computer_Science_Teachers_Professional_Development","abstract":"This paper describes an introductory Computer Science (CS) Professional Development (PD) course for K-12 teachers in Argentina that integrates pedagogical content knowledge and teacher classroom practice. We analyzed teachers' learning of what CS entails and the implementation of inquirybased programming lessons in their schools. Based on pre and post teachers surveys and classroom observations, we found that most teachers learned about the CS object of study and about fundamental programming concepts such as conditionals, loops, variables, etc. Teachers were more likely to replicate the same activities they experienced during PD workshops in their classrooms than to produce their own. Teachers who had a previous background on CS provided in-depth explanations of CS concepts to their students while other teachers superficially introduced the content knowledge. We describe PD activities and characteristics that could explain teachers' learning and incorporation of programming lessons. Findings imply that a PD program that integrates pedagogical content knowledge and teachers classroom practice can effectively improve inquiry-based CS teaching, but may be insufficient preparation for teachers with no previous background on CS.","authors":["María Cecilia Martinez","Marcos Javier Gómez","Marco Moresi","Luciana Benotti"],"meta":["July 2016","DOI:10.1145/2899415.2899460","Conference: the 2016 ACM Conference"],"references":["317953623_Teacher_pedagogical_beliefs_The_final_frontier_in_our_quest_for_technology_integration","311644868_UNCDuino_A_Kit_for_Learning_to_Program_Robots_in_Python_and_C_Starting_from_Blocks","291373491_Representaciones_de_estudiantes_de_primaria_y_secundaria_sobre_las_Ciencias_de_la_Computacion_y_su_oficio","266657029_Engaging_high_school_students_using_Chatbots","254007497_Who_AM_I_understanding_high_school_computer_science_teachers'_professional_identity","237817648_What_Makes_Professional_Development_Effective_Results_From_a_National_Sample_of_Teachers","350952356_Who_am_I_understanding_high_school_computer_science_teachers'_professional_identity","271452202_Improving_secondary_CS_education","266655059_Adoption_of_new_computer_science_high_school_standards_by_New_Zealand_teachers","250750529_If_You_Build_Teachers_Will_Students_Come_The_Role_of_Teachers_in_Broadening_Computer_Science_Learning_for_Urban_Youth"]}