{"id":"305084487_Programming_in_Slovak_Primary_Schools","abstract":"In our paper, we want to present the conception of elementary programming in primary Informatics education in Slovakia and the process of its integration into ordinary classrooms. First, we will familiarize the reader with the tradition of so called ‘Informatics education’ in Slovakia and with the various stages of the process of its integration. We will formulate the learning objectives of the elementary informatics as a school subject in Slovakia (referring to and in compliance with [Blaho 2011]) and we will give reasons why we believe that it offers an important opportunity for developing informatics knowledge, computational thinking and problem solving skills. We will primarily focus on the presentation of our arguments why we consider programming (in the form rigorously respecting the age of the primary pupils) to be appropriate and productive constituent of learning already for this age group. Several recent research findings, presented by Ackermann [2012] and others support our position here. In the next chapter, we will present in detail the conception of elementary programming and how it is implemented in the continuing professional development (CPD) of primary teachers in Slovakia. We will examine which programming environments are being used, what kind of pedagogies and which specific learning objectives our teachers apply. We will list programming concepts and identify corresponding cognitive operations, which we find appropriate for primary pupils. Then we will present and analyze the CPD of our in-service teachers (and the position of programming in this process) which we have recently implemented in Slovakia. Another important element of our CPD strategy is the well-known Bebras contest (in Slovakia we name it ‘iBobor’ or ‘Informatics Beaver’). In the next chapter of our paper, we will apply qualitative educational inquiry methods to examine how our conception of elementary programming has really penetrated into primary classes in Slovakia. We are also interested in how it is being received by the teachers and pupils. Through interviews with the teachers we will identify different aspects of the whole process and main risk factors, which may complicate or hinder the implementation. In the final chapter, we will study the tendency to develop informatics and programming at the primary level in the context of various research projects presented in the academic research literature. We will compare various key findings of other research projects with our own experience.","authors":["Martina Kabátová","Ivan Kalas","Monika Tomcsanyiova"],"meta":["July 2016","DOI:10.15388/ioi.2016.09"],"references":["303239675_Bebras_-_a_Sustainable_Community_Building_Model_for_the_Concept_Based_Learning_of_Informatics_and_Computational_Thinking","299450690_Computational_thinking_the_developing_definition","276466451_Physical_Computing_and_its_Scope_-_Towards_a_Constructionist_Computer_Science_Curriculum_with_Physical_Computing","266655056_Designing_productive_gradations_of_tasks_in_primary_programming_education","254462492_Infusing_computational_thinking_into_the_middle-_and_high-school_curriculum","247924673_Bringing_computational_thinking_to_K-12_what_is_Involved_and_what_is_the_role_of_the_computer_science_education_community","234820368_The_Scratch_Programming_Language_and_Environment","319394383_How_to_Solve_it","262397303_Promoting_computational_thinking_with_programming","262187569_How_to_Solve_it"]}