{"id":"305076985_Process_Materials_Scientific_Data_for_Intelligent_Service_Using_a_Dataspace_Model","abstract":"Nowadays, materials scientific data come from lab experiments, simulations, individual archives, enterprise and internet in all scales and formats. The data flood has outpaced our capability to process, manage, analyze, and provide intelligent services. Extracting valuable information from the huge data ocean is necessary for improving the quality of domain services. The most acute information management challenges today stem from organizations relying on amounts of diverse, interrelated data sources, but having no way to manage the dataspaces in an integrated, user-demand driven and services convenient way. Thus, we proposed the model of Virtual DataSpace (VDS) in materials science field to organize multi-source and heterogeneous data resources and offer services on the data in place without losing context information. First, the concept and theoretical analysis are described for the model. Then the methods for construction of the model is proposed based on users’ interests. Furthermore, the dynamic evolution algorithm of VDS is analyzed using the user feedback mechanism. Finally, we showed its efficiency for intelligent, real-time, on-demand services in the field of materials engineering.","authors":["Yang Li","Changjun Hu"],"meta":["July 2016Data Science Journal 15(3)","DOI:10.5334/dsj-2016-007"],"references":["312449460_Analytics_over_large-scale_multidimensional_data_The_big_data_revolution","305076875_Process_Materials_Scientific_Data_for_Intelligent_Service_Using_a_Dataspace_Model","273353710_Big_data_The_future_of_biocuration","265427176_Active_Data_A_Programming_Model_for_Managing_Big_Data_Life_Cycle","326338097_Pellet_A_Practical_OWL-DL_Reasoner","302249687_Semantic_Processing_on_Big_Data","277349256_A_Virtual_Dataspaces_Model_for_large-scale_materials_scientific_data_access","269484164_Architecting_Big_Data_Challenges_Studies_and_Forecasts","261198673_DSDC_A_Domain_Scientific_Data_Cloud_Based_on_Virtual_Dataspaces","257686744_User_centric_dynamic_web_information_visualization"]}