{"id":"305140678_A_K-6_Computational_Thinking_Curriculum_Framework_Implications_for_Teacher_Knowledge","abstract":"Adding computer science as a separate school subject to the core K-6 curriculum is a complex issue with educational challenges. The authors herein address two of these challenges: (1) the design of the curriculum based on a generic computational thinking framework, and (2) the knowledge teachers need to teach the curriculum. The first issue is discussed within a perspective of designing an authentic computational thinking curriculum with a focus on real-world problems. The second issue is addressed within the framework of technological pedagogical content knowledge explicating in detail the body of knowledge that teachers need to have to be able to teach computational thinking in a K-6 environment. An example of how these ideas can be applied in practice is also given. While it is recognized there is a lack of adequate empirical evidence in terms of the effectiveness of the frameworks proposed herein, it is expected that our knowledge and research base will dramatically increase over the next several years, as more countries around the world add computer science as a separate school subject to their K-6 curriculum.","authors":["Charoula Angeli","Joke Voogt","Andrew Fluck","Mary Webb"],"meta":["January 2016"],"references":["305140594_Arguing_for_Computer_Science_in_the_School_Curriculum","299464834_How_can_the_teaching_of_programming_be_used_to_enhance_computational_thinking_skills","284550207_Computational_Thinking_in_Virtual_Learning_Environments","282603860_Computational_thinking_in_compulsory_education_Towards_an_agenda_for_research_and_practice","273313277_Teacher_design_knowledge_for_technology_enhanced_learning_an_ecological_framework_for_investigating_assets_and_needs","311471279_Toward_a_K-12_computer_science_curriculum","286245879_Computer_science_for_the_elementary_classroom","284205443_Creating_APR_CS_principles","270412592_Strengthening_TPACK_A_Broader_Notion_of_Context_and_the_Use_of_Teacher's_Narratives_to_Reveal_Knowledge_Construction","266992922_Guide_to_teaching_computer_science_An_activity-based_approach"]}