{"id":"305186613_Adversarial_examples_in_the_physical_world","abstract":"Most existing machine learning classifiers are highly vulnerable to adversarial examples. An adversarial example is a sample of input data which has been modified very slightly in a way that is intended to cause a machine learning classifier to misclassify it. In many cases, these modifications can be so subtle that a human observer does not even notice the modification at all, yet the classifier still makes a mistake. Adversarial examples pose security concerns because they could be used to perform an attack on machine learning systems, even if the adversary has no access to the underlying model. Up to now, all previous work have assumed a threat model in which the adversary can feed data directly into the machine learning classifier. This is not always the case for systems operating in the physical world, for example those which are using signals from cameras and other sensors as an input. This paper shows that even in such physical world scenarios, machine learning systems are vulnerable to adversarial examples. We demonstrate this by feeding adversarial images obtained from cell-phone camera to an ImageNet Inception classifier and measuring the classification accuracy of the system. We find that a large fraction of adversarial examples are classified incorrectly even when perceived through the camera.","authors":["Alexey Kurakin","Ian Goodfellow","Samy Bengio"],"meta":["July 2016"],"references":["309448167_Accessorize_to_a_Crime_Real_and_Stealthy_Attacks_on_State-of-the-Art_Face_Recognition","303490367_Transferability_in_Machine_Learning_from_Phenomena_to_Black-Box_Attacks_using_Adversarial_Samples","301875216_Practical_Black-Box_Attacks_against_Deep_Learning_Systems_using_Adversarial_Examples","272408120_Face_Recognition_on_Consumer_Devices_Reflections_on_Replay_Attacks","269935591_Explaining_and_Harnessing_Adversarial_Examples","265295439_ImageNet_Large_Scale_Visual_Recognition_Challenge","265252627_Neural_Machine_Translation_by_Jointly_Learning_to_Align_and_Translate","285648386_Rethinking_the_Inception_Architecture_for_Computer_Vision","267960550_ImageNet_Classification_with_Deep_Convolutional_Neural_Networks","265178583_Deep_Neural_Networks_for_Acoustic_Modeling_in_Speech_Recognition"]}