{"id":"305180735_On_Dynamic_Feature_Weighting_for_Feature_Drifting_Data_Streams","abstract":"The ubiquity of data streams has been encouraging the development of new incremental and adaptive learning algorithms. Data stream learners must be fast, memory-bounded, but mainly, tailored to adapt to possible changes in the data distribution, a phenomenon named concept drift. Recently, several works have shown the impact of a so far nearly neglected type of drift: feature drifts. Feature drifts occur whenever a subset of features becomes, or ceases to be, relevant to the learning task. In this paper we (i) provide insights into how the relevance of features can be tracked as a stream progresses according to information theoretical Symmetrical Uncertainty; and (ii) how it can be used to boost two learning schemes: Naive Bayesian and k-Nearest Neighbor. Furthermore, we investigate the usage of these two new dynamically weighted learners as prediction models in the leaves of the Hoeffding Adaptive Tree classifier. Results show improvements in accuracy (an average of 10.69% for k-Nearest Neighbor, 6.23% for Naive Bayes and 4.42% for Hoeffding Adaptive Trees) in both synthetic and real-world datasets at the expense of a bounded increase in both memory consumption and processing time.","authors":["Jean Paul Barddal","Heitor Murilo Gomes","Fabrício Enembreck","Bernhard Pfahringer"],"meta":["September 2016","DOI:10.1007/978-3-319-46227-1_9","Conference: European Conference on Machine Learning and Principles and Practice of Knowledge DiscoveryAt: Riva del Garda, Italy"],"references":["305083748_Advancing_feature_selection_research","301588023_Updating_Formulas_and_Algorithms_for_Computing_Entropy_and_Gini_Index_from_Time-Changing_Data_Streams","289529742_A_Survey_on_Feature_Drift_Adaptation","284716986_Analyzing_the_Impact_of_Feature_Drifts_in_Streaming_Learning","282240437_SAMOA_Scalable_advanced_massive_online_analysis","281274483_SNCStream_a_social_network-based_data_stream_clustering_algorithm","278705754_Lecture_Notes_in_Computer_Science","303132448_Outlier_detection_for_temporal_data","300760387_Data_Classification","282374038_All_Relevant_Feature_Selection_Methods_and_Applications"]}