{"id":"305218313_Interactive_sketching_of_urban_procedural_models","abstract":"3D modeling remains a notoriously difficult task for novices despite significant research effort to provide intuitive and automated systems. We tackle this problem by combining the strengths of two popular domains: sketch-based modeling and procedural modeling. On the one hand, sketch-based modeling exploits our ability to draw but requires detailed, unambiguous drawings to achieve complex models. On the other hand, procedural modeling automates the creation of precise and detailed geometry but requires the tedious definition and parameterization of procedural models. Our system uses a collection of simple procedural grammars, called snippets, as building blocks to turn sketches into realistic 3D models. We use a machine learning approach to solve the inverse problem of finding the procedural model that best explains a user sketch. We use non-photorealistic rendering to generate artificial data for training convolutional neural networks capable of quickly recognizing the procedural rule intended by a sketch and estimating its parameters. We integrate our algorithm in a coarse-to-fine urban modeling system that allows users to create rich buildings by successively sketching the building mass, roof, facades, windows, and ornaments. A user study shows that by using our approach non-expert users can generate complex buildings in just a few minutes.","authors":["Gen Nishida","Ignacio Garcia-Dorado","Daniel G. Aliaga","Bedrich Benes"],"meta":["July 2016ACM Transactions on Graphics 35(4):1-11","DOI:10.1145/2897824.2925951"],"references":["319770183_Imagenet_classification_with_deep_convolutional_neural_networks","318780036_Analytic_Drawing_of_3D_Scaffolds","308965179_The_informed_sampler_A_discriminative_approach_to_Bayesian_inference_in_generative_computer_vision_models","308843426_Sketch-based_3D_shape_retrieval_using_Convolutional_Neural_Networks","303597703_S_mart_C_anvas_Context-inferred_Interpretation_of_Sketches_for_Preparatory_Design_Studies","291248679_Teddy_a_sketching_interface_for_3D_freeform_design_in_ACM_SIGGRAPH_2007_courses","289767536_SKETCH","283889566_Controlling_Procedural_Modeling_Programs_with_Stochastically-Ordered_Sequential_Monte_Carlo","283889441_WorldBrush","282414800_Learning_visual_similarity_for_product_design_with_convolutional_neural_networks"]}