{"id":"305271485_Nonlinear_mathematical_modeling_of_seed_spacing_uniformity_of_a_pneumatic_planter_using_genetic_programming_and_image_processing","abstract":"The purpose of this research was to represent the new laboratory test procedure that could be applicable in the field condition. Therefore, the performance of a pneumatic planter was investigated under laboratory conditions for maize, castor, fababean, sorghum, sugar beet, watermelon and cucumber seeds. The effect of operational speed [(1) 2.5–4 km/h and (2) 6–8.5 km/h] and vacuum pressure was evaluated by examining the quality of feed index, precision in spacing (coefficient of variation), miss index and multiple index. The most perfect operating parameter values for maize, castor, sorghum and sugar beet seeds were obtained at the first level of operating speed and 4.0 kPa pressure; for watermelon seed: second level of speed and 4.5 kPa pressure; and for cucumber seed: first level of speed and 4.5 kPa pressure. Furthermore, in order to determine the relationship between most important operating parameters affecting the performance of the pneumatic metering device and seed physical properties, regression models were developed using genetic programming (GP) algorithm. According to the results, the developed model using GP encompasses all physical properties of seeds as well as operational parameters. The model strongly describes the effect of investigated factors on seed spacing uniformity with values of the coefficient of determination R\n2 of 0.938, RMSE of 3.01 and MAE of 3.362087. Furthermore, the associated P value of 2.9851e−17 represents that the model is statistically significant. Model obtained from GP approach not only has a higher value of the coefficient of determination compared to regression model but is able to present the relationship between two operating parameters affecting the performance of row crop pneumatic metering device and seed physical properties, as well.","authors":["Zahra Abdolahzare","Saman Abdanan Mehdizadeh"],"meta":["January 2018Neural Computing and Applications 29(2)","DOI:10.1007/s00521-016-2450-1"],"references":["347964644_Genetic_programing_and_non-linear_multiple_regression_techniques_to_predict_backbreak_in_blasting_operation","292712743_Effect_of_forward_speed_and_seed_spacing_on_seeding_uniformity_of_a_precision_vacuum_metering_unit_for_melon_and_cucumber_seeds","292763698_A_sensor_for_seed_flow_from_seed_metering_mechanisms","285804728_Alternative_Measures_of_Accuracy_in_Plant_Spacing_for_Planters_Using_Single_Seed_Metering","285530101_Seeding_Methods_Performance_for_Cereals_Rape_and_Beans","279937522_Some_physical_properties_of_white_lupin","275514951_Laboratory_and_field_testing_of_seed_spacing_uniformity_for_sugarbeet_planters","274503103_A_Hydropneumatic_Seeder_for_Primed_Seed","257616850_PH-Postharvest_Technology_Physical_Properties_of_Okra_Seed","256735205_PH-Postharvest_Technology_Performance_Analysis_of_an_Impeller_Husker_considering_the_Physical_and_Mechanical_Properties_of_Paddy_Rice","237681756_A_MACHINE_VISION_SYSTEM_FOR_EVALUATION_OF_PLANTER_SEED_SPATIAL_DISTRIBUTION","253803294_Photo-optical_sensor_system_for_rapid_evaluation_of_planter_seed_spacing_uniformity","253247910_Introduction_to_Space_Dynamics","245097573_Genetic_programming_based_formulation_of_rotation_capacity_of_wide_flange_beams","245097571_A_new_formulation_for_web_crippling_strength_of_cold-formed_steel_sheeting_using_genetic_programming"]}