{"id":"305280725_Contribuicoes_dos_Objetos_de_Aprendizagem_no_ensino_de_Fisica_para_o_desenvolvimento_do_Pensamento_Critico_e_da_Aprendizagem_Significativa","abstract":"Na sociedade contemporânea é cada vez mais importante e necessário que as pessoas tenham habilidades e desenvolvam competências para manusear os computadores e a Internet, que sejam capazes de pesquisar, questionar, que saibam realizar suas tarefas com criatividade e competência, que tenham iniciativa e sejam capazes de solucionar problemas. Essas capacidades são entendidas como habilidades de pensamento crítico que é também preconizado na Lei de Diretrizes e Bases (LDB, 1996) nº 9394/96, que aponta como uma das finalidades para o Ensino Médio, o desenvolvimento da autonomia intelectual e do pensamento crítico dos educandos. Os Parâmetros Curriculares Nacionais (PCNs), para atender a essa finalidade, sugerem que no Ensino de Física sejam abordadas questões próximas do mundo vivido pelos alunos. Entretanto, em muitos casos, o ensino de Física ainda se caracteriza pela transmissão de informações por meio de aulas expositivas-dialogadas, embasadas e suportadas pelo uso de livros didáticos; pelo excesso de atenção dada a exercícios repetitivos, cuja abordagem privilegia o uso de algoritmos matemáticos em detrimento da compreensão dos conceitos relacionados aos fenômenos físicos envolvidos. O uso do computador, no ensino, tem sido apontado como uma das possibilidades para a promoção do pensamento crítico e da aprendizagem significativa e uma das estratégias de seu uso consiste em trabalhar com materiais educacionais digitais construídos como Objetos de Aprendizagem (OA). Este trabalho investigou a contribuição do uso de Objetos de Aprendizagem no desenvolvimento do Pensamento Crítico (PC) e da Aprendizagem Significativa (AS). A pesquisa realizada incluiu o projeto e desenvolvimento de um conjunto de unidades de aprendizagem na área de Termodinâmica, usando OAs e foram elaboradas de acordo com a metodologia dos Três Momentos Pedagógicos (TMP), organizadas de acordo com a teoria ou ciclo de Kolb, desenvolvidas e testadas em turmas de 2ª série do Ensino Médio na disciplina de Física. A avaliação do desenvolvimento do pensamento crítico foi realizada usando indicadores de pensamento crítico nas manifestações dos estudantes. Verificou-se que os OAs interativos e contextualizados, inseridos no modelo metodológico dos TMP e organizados de acordo com o ciclo de Kolb, trabalhados numa perspectiva investigativa, permitiram desenvolver uma aprendizagem ativa, reflexiva e participativa, não apenas para resolver problemas escolares, mas também problemas cotidianos. Esse trabalho evidenciou a contribuição de OAs na formação de uma postura autônoma e crítica de contínua busca de conhecimentos, co-responsabilizando os estudantes pelos rumos, profundidade e significado de seu aprendizado, levando-os ao desenvolvimento do pensamento crítico e da aprendizagem significativa.","authors":["Ana Marli Bulegon"],"meta":["August 2011","Advisor: Liane Margarida Rockenbach Tarouco"],"references":["277738397_Analise_da_Aprendizagem_Significativa_em_Ambientes_de_Escrita_Colaborativa_Apoiada_por_Computador","267967917_Comunidades_virtuais_de_aprendizagem_novas_dinamicas_de_aprendizagem_exigem_novas_formas_de_avaliacao","267375713_MODELAGEM_COMPUTACIONAL_NO_ENSINO_DE_FISICA","254075067_Critical_Thinking_and_Self-Directed_Learning_in_Adult_Education_An_Analysis_of_Responsibility_and_Control_Issues","250984805_A_fisica_nas_series_iniciais_2_a_5_do_ensino_fundamental_desenvolvimento_e_aplicacao_de_um_programa_visando_a_qualificacao_de_professores","250026330_Quantitativo-Qualitativo_Oposicao_ou_Complementaridade","319393897_Taxonomy_of_educational_objectives_The_classification_of_educational_goals_Handbook_I_cognitive_domain","267398234_A_content_analysis_method_to_measure_critical_thinking_in_face-to-face_and_computer_supported_group_learning_A_content_analysis_method_to_measure_critical_thinking_in_face-to-face_and_computer_support","261834038_Ensino_de_Fisica_no_Brasil_Retrospectiva_e_Perspectivas","244433797_LEARNING_OBJECT_DESIGN_AND_SEQUENCING_THEORY","242762265_Experiential_Learning_Theory_Previous_Research_and_New_Directions","242365215_Fatores_que_afetam_a_performance_da_comunicacao_mediada_por_computador","243621042_Computers_in_the_Classroom_Mindtools_for_Critical_Thinking","242412088_Educational_Psychology_A_Cognitive_View","242403035_Taxonomy_of_educational_objectives_the_classification_of_educational_goals_handbook_i"]}