{"id":"305246688_Inverted_Linear_Quadtree_Efficient_Top_K_Spatial_Keyword_Search","abstract":"With advances in geo-positioning technologies and geo-location services, there are a rapidly growing amount of spatio-Textual objects collected in many applications such as location based services and social networks, in which an object is described by its spatial location and a set of keywords (terms). Consequently, the study of spatial keyword search which explores both location and textual description of the objects has attracted great attention from the commercial organizations and research communities. In the paper, we study two fundamental problems in the spatial keyword queries: Top k spatial keyword search (TOPK-SK), and batch top k spatial keyword search (BTOPK-SK). Given a set of spatio-Textual objects, a query location and a set of query keywords, the TOPK-SK retrieves the closest k objects each of which contains all keywords in the query. BTOPK-SK is the batch processing of sets of TOPK-SK queries. Based on the inverted index and the linear quadtree, we propose a novel index structure, called inverted linear quadtree (IL-Quadtree), which is carefully designed to exploit both spatial and keyword based pruning techniques to effectively reduce the search space. An efficient algorithm is then developed to tackle top k spatial keyword search. To further enhance the filtering capability of the signature of linear quadtree, we propose a partition based method. In addition, to deal with BTOPK-SK, we design a new computing paradigm which partition the queries into groups based on both spatial proximity and the textual relevance between queries. We show that the IL-Quadtree technique can also efficiently support BTOPK-SK. Comprehensive experiments on real and synthetic data clearly demonstrate the efficiency of our methods.","authors":["C. Zhang","Y. Zhang","W. Zhang","X. Lin"],"meta":["July 2016","DOI:10.1109/TKDE.2016.2530060"],"references":["284817340_Efficient_processing_of_top-k_spatial_keyword_queries","228533842_DESKS_Direction-aware_spatial_keyword_search","221615144_Text_vs_space_Efficient_geo-search_query_processing","221614107_Hybrid_index_structures_for_location-based_Web_search","221520182_Batch_Query_Processing_for_Web_Search_Engines","221207098_Efficient_and_Scalable_Method_for_Processing_Top-k_Spatial_Boolean_Queries","220421408_An_effective_way_to_represent_quadtrees","4330914_Keyword_Search_on_Spatial_Databases","312455651_Processing_spatial_keywordSK_queries_in_geographic_information_retrievalGIR_systems","305261908_Multiattribute_Hashing_Using_Gray_Codes","293111600_Diversified_spatial_keyword_search_on_road_networks","262346485_Spatial_keyword_query_processing_An_experimental_evaluation","262206702_Location-aware_publishsubscribe","262161275_Scalable_top-k_spatial_keyword_search","257457500_A_framework_for_efficient_spatial_web_object_retrieval","254005691_Top-k_spatial_keyword_queries_on_road_networks","242678487_A_Computer_Oriented_Geodetic_Data_Base_and_a_New_Technique_in_File_Sequencing","224250175_Joint_Top-K_Spatial_Keyword_Query_Processing","224171012_IR-Tree_An_Efficient_Index_for_Geographic_Document_Search","221471692_Lecture_Notes_in_Computer_Science","221214566_Location-aware_type_ahead_search_on_spatial_databases_Semantics_and_efficiency","220692379_A_Mathematical_Introduction_to_Logic","220538881_Efficient_Retrieval_of_the_Top-k_Most_Relevant_Spatial_Web_Objects","220225469_Distance_Browsing_in_Spatial_Databases"]}