{"id":"305258620_BDD-Based_Boolean_Functional_Synthesis","abstract":"Boolean functional synthesis is the process of automatically obtaining a constructive formalization from a declarative relation that is given as a Boolean formula. Recently, a framework was proposed for Boolean functional synthesis that is based on Craig Interpolation and in which Boolean functions are represented as And-Inverter Graphs (AIGs). In this work we adapt this framework to the setting of Binary Decision Diagrams (BDDs), a standard data structure for representation of Boolean functions. Our motivation in studying BDDs is their common usage in temporal synthesis, a fundamental technique for constructing control software/hardware from temporal specifications, in which Boolean synthesis is a basic step. Rather than using Craig Interpolation, our method relies on a technique called Self-Substitution, which can be easily implemented by using existing BDD operations. We also show that this yields a novel way to perform quantifier elimination for BDDs. In addition, we look at certain BDD structures called input-first, and propose a technique called TrimSubstitute, tailored specifically for such structures. Experiments on scalable benchmarks show that both Self-Substitution and TrimSubstitute scale well for benchmarks with good variable orders and significantly outperform current Boolean-synthesis techniques.","authors":["Dror Fried","Lucas M. Tabajara","Moshe Vardi"],"meta":["July 2016","DOI:10.1007/978-3-319-41540-6_22","Conference: International Conference on Computer Aided Verification"],"references":["306113728_Skolem_functions_for_factored_formulas","302367778_Symbolic_Techniques_in_Satisfiability_Solving","281262152_Skolem_Functions_for_Factored_Formulas","244903040_Search_vs_Symbolic_Techniques_in_Satisfiability_Solving","234827421_On_the_synthesis_of_a_reactive_module","287560698_Efficient_extraction_of_Skolem_functions_from_QRAT_proofs","280765005_Graph-based_algorithms_for_Boolean_function_manipulation","261037475_Quantifier_elimination_via_clause_redundancy","226084962_Symbolic_Bounded_Synthesis","224722818_Minimization_of_Boolean_relations"]}