{"id":"305228497_Understanding_the_purpose_of_higher_education_An_analysis_of_the_economic_and_social_benefits_for_completing_a_college_degree","abstract":"Higher education worldwide is facing unprecedented challenges - the dramatic rise of for-profit institutions, rapidly increasing expectations about what services colleges and universities should provide, and a complex society that demands college graduates with even more skills and capacities. To understand how higher education can effectively address these challenges, this paper investigates the public and private purpose of higher education and what it means for higher education's future. Utilizing Critical Interpretive Synthesis (CIS) and signaling theory, this research reviews the changing meanings of 'public' and 'private' in higher education from the perspective of (1) education providers and (2) undergraduate students. A comprehensive search of the literature selected 60 peer-reviewed journal articles and twenty-five books published between 2000 and 2016. Nine synthetic constructs of the goals were found and while there was some agreement between institutions and students on the economic and social benefits of higher education, the review was characterized by a significant misalignment. The findings suggest that student expectations for a college degree tends to be very instrumental and personal, while higher education purpose of undergraduate education tend towards highly ideal life-and society-changing consequences. This paper offers eight recommendations for policymakers to consider that address the growing misalignment gap between education providers and undergraduate students. The ultimate goal is to develop renovation or repurposing strategy across competing imperatives and to outline success measures to critically define, measure, and evaluate the achievement of specific goals and outcomes in hopes of resolving potential skills mismatch in a world of massive cataclysmic change.","authors":["Roy Y. Chan"],"meta":["January 2016"],"references":["346865455_American_Higher_Education_in_Crisis_What_Everyone_Needs_to_KnowRWhat_Everyone_Needs_to_KnowR","346826397_The_Fall_of_the_Faculty_The_Rise_of_the_All-Administrative_University_and_Why_It_MattersThe_Rise_of_the_All-Administrative_University_and_Why_It_Matters","344590007_The_Graduate_School_Mess_What_Caused_It_and_How_We_Can_Fix_it","344119738_For_the_University_Democracy_and_the_Future_of_the_Institution","343122295_Globalizing_Knowledge_Intellectuals_Universities_and_Publics_in_Transformation","331725955_Locus_of_Authority_The_Evolution_of_Faculty_Roles_in_the_Governance_of_Higher_Education","327964444_To_MOOC_or_not_to_MOOC_How_can_online_learning_help_to_build_the_future_of_higher_education","323322334_Is_College_Worth_It_A_Former_United_States_Secretary_of_Education_and_a_Liberal_Arts_Graduate_Expose_the_Broken_Promise_of_Higher_Education","323322182_Neoliberalism's_War_on_Higher_Education","320892098_Introduction_to_Preparing_Today's_Students_for_Tomorrow's_Jobs_in_Metropolitan_Americaem"]}