{"id":"305386157_A_Haar_Wavelet-Based_Perceptual_Similarity_Index_for_Image_Quality_Assessment","abstract":"In most practical situations, images and videos can neither be compressed nor transmitted without introducing distortions that will eventually be perceived by a human observer. Vice versa, most applications of image and video restoration techniques, such as inpainting or denoising, aim to enhance the quality of experience of human viewers. Correctly predicting the similarity of an image with an undistorted reference image, as subjectively experienced by a human viewer, can thus lead to significant improvements in any transmission, compression, or restoration system. This paper introduces the Haar wavelet-based perceptual similarity index (HaarPSI), a novel and easy-to-compute similarity measure for full reference image quality assessment. HaarPSI utilizes the coefficients obtained from a Haar wavelet decomposition to assess local similarities between two images, as well as the relative importance of image areas. The consistency of HaarPSI with human quality of experience was validated on four large benchmark databases containing several thousands of differently distorted images. On these databases, HaarPSI achieves higher correlations with human opinion scores than state-of-the-art full reference similarity measures like the structural similarity index (SSIM), the feature similarity index (FSIM), and the visual saliency-based index (VSI). Along with the simple computational structure and the short execution time, these promising experimental results suggest a high applicability of HaarPSI in real world tasks.","authors":["Rafael Reisenhofer","Sebastian Bosse","Gitta Kutyniok","Thomas Wiegand"],"meta":["February 2018Signal Processing Image Communication 61:33-43","DOI:10.1016/j.image.2017.11.001"],"references":["313136016_Orthonormal_bases_of_compactly_supported_wavelets","312759824_Perceptually_Optimized_Image_Rendering","311458059_Deep_Neural_Networks_for_No-Reference_and_Full-Reference_Image_Quality_Assessment","308823016_SOM_Semantic_obviousness_metric_for_image_quality_assessment","307516110_A_Deep_Neural_Network_for_Image_Quality_Assessment","301963806_Biorthogonal_bases_of_compactly_supported_wavelets","286813680_Convolutional_Neural_Networks_for_No-Reference_Image_Quality_Assessment","273621227_Cisco_Visual_Networking_Index_Forecast_adn_Methodology_2013_-_2018","271481035_Image_information_and_visual_quality","268733176_MATLAB_and_Octave_Functions_for_Computer_Vision_and_Image_Processing"]}