{"id":"305325484_L'emploi_des_cartes_cognitives_pour_la_formation_a_la_maitrise_de_l'information","abstract":"Il y a quelques décennies, l’éducation à la maîtrise informationnelle faisait déjà l’objet de formations qui étaient destinées à des spécialistes. Mais, avec l’avènement d’Internet et plus encore avec l’ère du Web 2.0, l’éducation à la maîtrise de l’information s’est affirmée comme une nécessité à tous les niveaux du cursus scolaire. Or, parmi les plus importants aspects de la maîtrise informationnelle, il y a la mise en forme de l’information. Proposer une mise en forme adéquate pour répondre à un besoin informationnel permet de mieux le comprendre, d’exprimer comment nous pouvons envisager sa résolution, planifier celle-ci, trier les résultats et fournir un document final adapté au profil du destinataire. Dans ce cadre, les présentations graphiques d’informations forment un groupe de solutions utilisées couramment pour assister l’usager dans la compréhension et la communication de données, d’informations ou de connaissances. Il y a ainsi intérêt à enseigner les aspects utilitaires de la visualisation d’information. De plus, dans une relation inverse, l’enseignant peut aussi exploiter les avantages des représentations graphiques dans le cadre de sa pratique, puisqu’enseigner c’est aussi tenter de combler un besoin informationnel.Dans ce chapitre, nous présentons un type particulier de cartographie : les cartes cognitives. Comme nous le verrons, ces cartes permettent d’enseigner plusieurs facettes de la maîtrise informationnelle. Notre objectif est de permettre au lecteur de mieux comprendre et appréhender ces cartes en prenant connaissance de la diversité de leurs pratiques. Nous commencerons ainsi par un inventaire non exhaustif de leurs avantages, caractéristiques et mises en œuvre. Puis, nous parcourrons plusieurs de leurs emplois dans le cadre plus particulier de la formation à la maîtrise de l’information. Nous présenterons, non seulement, certaines pratiques déjà étudiées, mais nous préciserons aussi les publics concernés en termes de structure d’enseignement et d’apprentissage.","authors":["Stéphane Goria","Colette Levassor"],"meta":["July 2015"],"references":[]}