{"id":"305355195_Yoga_as_a_Preventative_and_Treatment_for_Depression_Anxiety_and_Stress","abstract":"With the dual aims of better understanding the contribution of Yoga to positive mental health and exploring links between yogic philosophy and psychological theory, researchers at Deakin University in Melbourne, Australia, conducted a study on Yoga as a preventative and treatment for symptoms of mental illness. The Yoga classes were designed as a six-week program incorporating breathing techniques (prânâyâma) , exercises for strength, vitality, and flexibility (âsanas), guided relaxation (yoga-nidrâ) , and meditation. The aim of this process was to enhance self-awareness, encourage the perspective that emotional states are somewhat transient, and encourage a self-accepting and calm attitude through concentrating on synchronizing gentle movements and breathing. By developing calmness, selfacceptance, a balanced perspective, and enhanced concentration it was hypothesized that participants in the six-week Yoga program would strengthen their resistance to emotional distress. Psychometric testing was carried out to assess symptoms of stress, anxiety, and depression across three groups: regular Yoga practitioners, beginners entering the program, and people who did not practice Yoga, and these tests were re-administered after six weeks. In addition, a strong sense of intrinsic spiritual experience has been cited as a possible buffer to stress, anxiety, and depression and has been associated with decreased frequency of medical symptoms. All participants were therefore also assessed on their sense of intrinsic spirituality, but not on religious beliefs. At the end of six weeks, the Yoga beginners group showed lower average levels of symptoms of depression, anxiety, and stress than at commencement, but levels were stable for regular Yoga practitioners and people who did not practice Yoga. In addition, beginners showed growth in their self-reported level of intrinsic spiritual experience.\n<br /","authors":["Debra Campbell","Kathleen Moore"],"meta":["January 2004International Journal of Yoga Therapy 14(1)","DOI:10.17761/ijyt.14.1.t7427823p2478255"],"references":["232100413_The_Story_of_the_Adaptation_Syndrome","228079117_Stress_Appraisal_and_Coping","21354969_Effect_of_Buddhist_meditation_on_serum_cortisol_and_total_protein_levels_blood_pressure_pulse_rate_lung_volume_and_reaction_time"]}