{"id":"305392959_From_physical_to_biological_individuation","abstract":"In this paper, we insist on stressing the epistemic and metaphysical difference between individual and individuation, a distinction originally developed by Gilbert Simondon. Individuation occurs in complex physical systems by the coupling (R1) between the system and its outside conditions. As such the system is not well defined by its sole constituents. Let's characterize (R2) as follows: the system is not entirely defined by its structure at a given time because this structure will change and global emergent properties will appear, as in the paradigmatic example of phase transition. Thus physical individuation is defined both by the coupling of a physical system with its environment (R1) and by its diachronic dynamics taking place (R2). We interpret biological individuation as a second order one, i.e. as a recursive procedure through which physical individuation is also acting on \"its own theatre\". We represent this procedure like a mapping through which (R1R2) are applied to themselves, so that: RN = (R1R2)(N). We highlight the relation between this assumption and the concept of extended criticality developed by Bailly, Longo and Montévil.","authors":["Miquel paul antoine","Su-Young Hwang"],"meta":["July 2016Progress in Biophysics and Molecular Biology 122(1)","DOI:10.1016/j.pbiomolbio.2016.07.002"],"references":["285385609_In_search_of_principles_for_a_Theory_of_Organisms","262486903_Perspectives_on_Organisms_Biological_Time_Symmetries_and_Singularities","262486802_Biological_organisation_as_closure_of_constraints","304822037_Why_do_we_need_theories","275360136_Universality_complexity_and_the_praxis_of_biology_Two_case_studies","272837004_The_unforeseen_challenge_From_genotype-to-phenotype_in_cell_populations","268606077_Some_relational_cell_models_The_metabolism-repair_systems","262486701_Le_Normal_et_le_Pathologique","258998101_Processes_of_Life_Essays_in_the_Philosophy_of_Biology","252986397_Laws_and_Symmetry"]}