{"id":"305355740_Query-Aware_locality-sensitive_hashing_for_approximate_nearest_neighbor_search","abstract":"Locality-Sensitive Hashing (LSH) and its variants are the well-known indexing schemes for the c-Approximate Nearest Neighbor (c-ANN) search problem in high-dimensional Eu- clidean space. Traditionally, LSH functions are constructed in a query-oblivious manner in the sense that buckets are partitioned before any query arrives. However, objects closer to a query may be partitioned into diffierent buckets, which is undesirable. Due to the use of query-oblivious bucket parti- tion, the state-of-the-art LSH schemes for external memory, namely C2LSH and LSB-Forest, only work with approxima- tion ratio of integer c ≥ 2. In this paper, we introduce a novel concept of query-aware bucket partition which uses a given query as the \\anchor\" for bucket partition. Accordingly, a query-aware LSH func- tion is a random projection coupled with query-aware bucket partition, which removes random shift required by tradi- tional query-oblivious LSH functions. Notably, query-aware bucket partition can be easily implemented so that query performance is guaranteed. We propose a novel query-aware LSH scheme named QALSH for c-ANN search over exter- nal memory. Our theoretical studies show that QALSH enjoys a guarantee on query quality. The use of query- aware LSH function enables QALSH to work with any ap- proximation ratio c > 1. Extensive experiments show that QALSH outperforms C2LSH and LSB-Forest, especially in high-dimensional space. Speciffically, by using a ratio c < 2, QALSH can achieve much better query quality.","authors":["Q. Huang","Jianlin Feng","Y. Zhang","Q. Fang"],"meta":["January 2016","Project: Query-Aware Locality-Sensitive Hashing"],"references":["301840852_Extensions_of_Lipschitz_mappings_into_a_Hilbert_space","254006435_Locality-sensitive_hashing_scheme_based_on_dynamic_collision_counting","220225300_Efficient_and_Accurate_Nearest_Neighbor_and_Closest_Pair_Search_in_High-Dimensional_Space","319770399_Approximate_nearest_neighbors_towards_removing_the_curse_of_dimensionality","286894182_SK-LSH_An_efficient_index_structure_for_approximate_nearest_neighbor_search","280743570_SRS_Solving_c-approximate_nearest_neighbor_queries_in_high_dimensional_Euclidean_space_with_a_tiny_index","239536213_Foundations_Of_Multidimensional_And_Metric_Data_Structures","237077155_Beyond_Locality-Sensitive_Hashing","228343547_iDistance_An_Adaptive_B-tree_Based_Indexing_Method_for_Nearest_Neighbor_Search","221996154_Probability_Inequalities_For_Sums_of_Bounded_Random_Variables"]}