{"id":"305340106_Informatics_Concepts_and_Computational_Thinking_in_K-12_Education_A_Lithuanian_Perspective","abstract":"Informatics or Computer Science is important subject in nowadays school education. Informatics can be presented as a discipline for understanding technology in a deeper way – the understanding behind computer programs. Bringing Informatics to schools means preparing young people to be creators of information technology – not only to be users of technological devices. To achieve that, we need to introduce Informatics concepts to primary, basic (K-9) and secondary education (K-12). From the other side, we need to help people to solve problems by using technology and developing computational thinking in various areas. The paper presents a short overview of Informatics education at schools of Lithuania with focus on future modern Informatics and Information Technology curriculum for K-12 education. The importance of informal education of Informatics concepts and computational thinking through contests is discussed as well. Few examples of short tasks for understanding Informatics concepts and developing computational thinking skills are presented.","authors":["Valentina Dagiene","Gabrielė Stupurienė"],"meta":["July 2016Journal of Information Processing 24(4):732-739","DOI:10.2197/ipsjjip.24.732","Project: Bebras - International challenge on Informatics and CT"],"references":["312222095_Introducing_computational_thinking_through_a_contest_on_informatics_Problem-solving_and_gender_issues","300253595_Introducing_a_New_Computer_Science_Curriculum_for_All_School_Levels_in_Poland","283085019_Testing_Algorithmic_Skills_in_Traditional_and_Non-Traditional_Programming_Environments","274377900_Computational_Thinking","274309848_Computational_Thinking","264626324_Perspectives_and_Visions_of_Computer_Science_Education_in_Primary_and_Secondary_K-12_Schools","262168697_Informatics_for_all_high_school_students_A_computational_thinking_approach","254003364_COMPUTING_IN_SCHOOLS_-_CS_contests_for_students_why_and_how","292652178_From_digital_natives_to_digital_wisdom_Hopeful_essays_for_21st_century_learning","237148768_Informatics_in_the_French_Secondary_Curricula_Recent_Moves_and_Perspectives"]}