{"id":"305379001_A_Classification_and_Comparison_of_Credit_Assignment_Strategies_in_Multiobjective_Adaptive_Operator_Selection","abstract":"Adaptive operator selection (AOS) is a high-level controller for an optimization algorithm that monitors the performance of a set of operators with a credit assignment strategy and adaptively applies the high performing operators with an operator selection strategy. AOS can improve the overall performance of an optimization algorithm across a wide range of problems, and it has shown promise on single-objective problems where defining an appropriate credit assignment that assesses an operator's impact is relatively straightforward. However, there is currently a lack of AOS for multiobjective problems (MOP) because defining an appropriate credit assignment is nontrivial for MOPs. To identify and examine the main factors in effective credit assignment strategies, this paper proposes a classification that groups credit assignment strategies by the sets of solutions used to assess an operator's impact and by the fitness function used to compare those sets of solutions. Nine credit assignment strategies, which include five newly proposed ones, are compared experimentally on standard benchmarking problems. Results show that eight of the nine credit assignment strategies are effective in elevating the generality of a multiobjective evolutionary algorithm and outperforming a random operator selector. Index Terms—Adaptive operator selection, credit assignment, multiobjective optimization, multiobjective evolutionary algorithm .","authors":["Nozomi Hitomi","Daniel Selva"],"meta":["August 2017IEEE transactions on neural networks / a publication of the IEEE Neural Networks Council 21(2):294 - 314","DOI:10.1109/TEVC.2016.2602348"],"references":["283674705_Combining_Mutation_and_Recombination_to_Improve_a_Distributed_Model_of_Adaptive_Operator_Selection","304425270_Differential_Evolution_-_A_Simple_and_Efficient_Heuristic_for_global_Optimization_over_Continuous_Spaces","301975037_MOEAD-HH_A_Hyper-Heuristic_for_Multi-objective_Problems","301973666_Upper_Confidence_Bound_UCB_Algorithms_for_Adaptive_Operator_Selection_in_MOEAD","297846383_A_hyperheuristic_approach_to_scheduling_a_sales_summit","290109684_Relation_between_Neighborhood_Size_and_MOEAD_Performance_on_Many-Objective_Problems","288932175_Adaptive_Composite_Operator_Selection_and_Parameter_Control_for_Multiobjective_Evolutionary_Algorithm","284719460_Pareto_or_Non-Pareto_Bi-Criterion_Evolution_in_Multi-Objective_Optimization","281532313_Adaptive_Operator_Selection_for_Optimization","281339301_Pareto-_aggregation-_and_indicator-based_methods_in_many-objective_optimization"]}