{"id":"305418293_A_conceptual_framework_for_integrated_STEM_education","abstract":"The global urgency to improve STEM education may be driven by environmental and social impacts of the twenty-first century which in turn jeopardizes global security and economic stability. The complexity of these global factors reach beyond just helping students achieve high scores in math and science assessments. Friedman (The world is flat: A brief history of the twenty-first century, 2005) helped illustrate the complexity of a global society, and educators must help students prepare for this global shift. In response to these challenges, the USA experienced massive STEM educational reforms in the last two decades. In practice, STEM educators lack cohesive understanding of STEM education. Therefore, they could benefit from a STEM education conceptual framework. The process of integrating science, technology, engineering, and mathematics in authentic contexts can be as complex as the global challenges that demand a new generation of STEM experts. Educational researchers indicate that teachers struggle to make connections across the STEM disciplines. Consequently, students are often disinterested in science and math when they learn in an isolated and disjoined manner missing connections to crosscutting concepts and real-world applications. The following paper will operationalize STEM education key concepts and blend learning theories to build an integrated STEM education framework to assist in further researching integrated STEM education.","authors":["Todd R. Kelley","John Geoff Knowles"],"meta":["July 2016International Journal of STEM Education 3(1)","DOI:10.1186/s40594-016-0046-z","Project: Teachers & Researchers Advancing Integrated Lessons in STEM (TRAILS)"],"references":["296626399_STEM_education_K-12_perspectives_on_integration","321555404_Positioning_Technology_Education_in_the_Curriculum","317953505_Situated_learning_Legitimate_peripheral_participation","316823281_Self-efficacy_the_exercise_of_control","292044561_Closing_the_achievement_gap_from_an_international_perspective_Transforming_STEM_for_effective_education","286809319_Exploring_wind_power_Improving_mathematical_thinking_through_digital_fabrication","286200999_Advancing_STEM_education_A_2020_vision","285816998_Informed_design_A_contemporary_approach_to_design_pedagogy_as_the_core_process_in_technology","285174335_Report_to_the_President_Prepare_and_inspire_K-12_education_in_science_technology_engineering_and_math_STEM_for_America's_future","285026359_The_influence_of_a_two-year_professional_development_institute_on_teacher_self-efficacy_and_use_of_inquiry-based_instruction"]}