{"id":"305494885_The_flipped_classroom_for_active_effective_and_increased_learning_-_especially_for_low_achievers","abstract":"Higher education has been pressured to shift towards more flexible, effective, active, and student-centered teaching strategies that mitigate the limitations of traditional transmittal models of education. Lately, the flipped classroom model has been suggested to support this transition. However, research on the use of flipped classroom in higher education is in its infancy and little is known about student’s perceptions of learning through flipped classroom. This study examined students’ perceptions of flipped classroom education in a last year university course in research methods. A questionnaire was administered measuring students’ (n = 240) perceptions of flipped classroom in general, video as a learning tool, and Moodle (Learning Management System) as a supporting tool within the frame of a flipped classroom model. The results revealed that a large majority of the students had a positive attitude towards flipped classroom, the use of video and Moodle, and that a positive attitude towards flipped classroom was strongly correlated to perceptions of increased motivation, engagement, increased learning, and effective learning. Low achievers significantly reported more positively as compared to high achievers with regards to attitudes towards the use of video as a learning tool, perceived increased learning, and perceived more effective learning.","authors":["Jalal Nouri"],"meta":["August 2016","DOI:10.1186/s41239-016-0032-z","Project: Digital competency and 21st century skills"],"references":["296691410_Flipped_classroom_A_review_of_recent_literature","285935974_The_flipped_classroom_A_survey_of_the_research","344538008_The_Flipped_Classroom_A_Survey_of_the_Research","288347639_Flipping_the_college_spreadsheet_skills_classroom_Initial_empirical_results","288347407_Evaluation_of_a_flipped_classroom_in_an_undergraduate_business_course","287974407_The_evidence_for_'flipping_out'_A_systematic_review_of_the_flipped_classroom_in_nursing_education","284043564_Student_views_on_the_use_of_a_flipped_classroom_approach_Evidence_from_Australia","274267499_The_Flipped_Classroom_An_Opportunity_To_Engage_Millennial_Students_Through_Active_Learning_Strategies","269417989_Flipping_the_classroom_for_English_language_learners_to_foster_active_learning","266253006_Enhancing_Student_Engagement_Using_the_Flipped_Classroom"]}