{"id":"305426244_Boys'_Needlework_Understanding_Gendered_and_Indigenous_Perspectives_on_Computing_and_Crafting_with_Electronic_Textiles","abstract":"We draw attention to the intersection of race/ethnicity and gender in computing education by examining the experiences of ten American Indian boys (12-14 years old) who participated in introductory computing activities with electronic textiles. To date, the use of electronic textiles (e-textiles) materials in introductory computing activities have been shown to be particularly appealing to girls and women because they combine craft, circuitry, and computing. We hypothesized that e-textiles would be appealing to American Indian boys because of a strong community-based craft tradition linked to heritage cultural practices. In order to understand boys' perspectives on learning computing through making culturally-relevant e-textiles artifacts, we analyzed boys' completed artifacts as documented in photographs and code screenshots, their design practices as documented in daily field notes and video logs of classroom sessions, and their reflections from interviews guided by the following research questions: (1) How did American Indian boys initially engage with e-textiles materials? (2) How did boys' computational perspectives develop through the process of making and programming their own e-textiles artifacts? Our findings highlight the importance of connecting to larger community value systems as a context for doing computing, the importance of allowing space for youth to make decisions within the constraints of the design task, and the value of tangible e-textiles artifacts in providing linkages between home and school spaces. We connect our work to other efforts to engage racial and ethnic minority students in computing and discuss the implications of our work for computer science educators designing computing curricula for increasingly diverse groups of students, especially as pertains to the emerging field of culturally responsive computing.","authors":["Kristin Searle","Yasmin B. Kafai"],"meta":["August 2015","DOI:10.1145/2787622.2787724","Conference: International Conference on International Computing Education Research"],"references":["305427044_Youth_Technology_and_DIY_Developing_Participatory_Competencies_in_Creative_Media_Production","301452851_Culturally_Responsive_Making_with_American_Indian_Girls_Bridging_the_Identity_Gap_in_Crafting_and_Computing_with_Electronic_Textiles","350260363_SMALL_IDEAS_BIG_OPPORTUNITIES_FABLAB_AT_VIGYAN_ASHRAM_PABAL_INDIA","305389454_Institutional_Ecology_'Translations'_and_Boundary_Objects_Amateurs_and_Professionals_in_Berkeley's_Museum_of_Vertebrate_Zoology","305327431_Many_versions_of_masculine_an_exploration_of_boys'_identity_formation_through_digital_storytelling_in_an_afterschool_program","300727569_Hybrid_Practice_in_the_Kalahari","298972479_Learning_Computer_Science_Concepts_with_Scratch","292236058_Information_Technology_and_Indigenous_People","283973733_Ka_ulana_'ana_i_ka_piko_In_Weaving_You_Begin_at_the_Center_Perspectives_from_a_Culturally_Specific_Approach_to_Art_Education","282933026_Indigenous_Circuits_Navajo_Women_and_the_Racialization_of_Early_Electronic_Manufacture"]}