{"id":"305483497_SentiHealth_creating_health-related_sentiment_lexicon_using_hybrid_approach","abstract":"The exponential increase in the health-related online reviews has played a pivotal role in the development of sentiment analysis systems for extracting and analyzing user-generated health reviews about a drug or medication. The existing general purpose opinion lexicons, such as SentiWordNet has a limited coverage of health-related terms, creating problems for the development of health-based sentiment analysis applications. In this work, we present a hybrid approach to create health-related domain specific lexicon for the efficient classification and scoring of health-related users’ sentiments. The proposed approach is based on the bootstrapping modal, a dataset of health reviews, and corpus-based sentiment detection and scoring. In each of the iteration, vocabulary of the lexicon is updated automatically from an initial seed cache, irrelevant words are filtered, words are declared as medical or non-medical entries, and finally sentiment class and score is assigned to each of the word. The results obtained demonstrate the efficacy of the proposed technique.","authors":["Dr. Muhammad Zubair Asghar","Shakeel Ahmad","Maria Qasim","Rabail Zahra"],"meta":["December 2016SpringerPlus 5(1)","DOI:10.1186/s40064-016-2809-x"],"references":["328497676_Patient_20_Empowerment","285957033_Detection_and_scoring_of_Internet_Slangs_for_sentiment_analysis_using_SentiWordNet","284724207_Sentiment_Analysis_on_YouTube_A_Brief_Survey","284345037_A_Review_of_Text_Summarization","284344945_Context-Aware_Spelling_Corrector_for_Sentiment_Analysis","283318837_Subjectivity_lexicon_construction_for_mining_drug_reviews","283318830_Lexicon-Based_Sentiment_Analysis_in_the_Social_Web","283068376_A_Unified_Framework_for_Creating_Domain_Dependent_Polarity_Lexicons_from_User_Generated_Reviews","306284143_The_General_Inquirer_A_Computer_Approach_to_Content_Analysis","305622270_Sentiment_Analysis_and_Opinion_Mining"]}