{"id":"305451695_Comportamento_informacional_dos_discentes_deficientes_visuais_da_Universidade_Federal_da_Paraiba_-_UFPB","abstract":"p> Introdução: O processo de busca de informação relaciona-se com as necessidades do indivíduo e o modo como ele procura a informação necessária a suprir sua lacuna cognitiva, apreendendo informação e transformando-a em conhecimento, envolvendo habilidades intelectuais como a decodificação e interpretação, possibilitando estabelecer uma relação entre o conhecimento existente e o proveniente de novas informações.\n\nObjetivo: Analisar do comportamento informacional dos discentes deficientes visuais da Universidade Federal da Paraíba (UFPB), atendidos pelo Núcleo de Educação Especial (NEDESP).\n\nMetodologia: Trata-se de uma pesquisa de caráter descritivo com abordagem quanti-qualitativa. Utilizou-se como instrumento para coleta de dados um questionário aplicado com dez usuários deficientes visuais. O modelo de comportamento de busca da informação desenvolvido por David Ellis norteou a realização da pesquisa.\n\nResultados: Os apontamentos demonstram que as principais necessidades de busca de informação estão associadas às atividades acadêmicas, como seminários, provas e elaboração de artigos. No processo de busca, os discentes usam a internet como principal fonte de informação. A adequação da informação com a necessidade do usuário é realizada através da busca por fontes seguras, confiança nos amigos, filtragem das informações relevantes, disseminação da informação por várias pessoas e consolidação da informação. As maiores dificuldades encontradas são a falta de acessibilidade em sites na internet e a ausência de materiais disponíveis em braille .\nConclusões: É necessário adotar medidas corretivas, preventivas e assistivas, pela Universidade, para suprir as lacunas informacionais e adequação as reais necessidades dos deficientes visuais.","authors":["Francisca Ramalho","Hanna Hamad","Ítalo Guimarães"],"meta":["June 2016Informação & Informação 21(1):230","DOI:10.5433/1981-8920.2016v21n1p230"],"references":["275636156_Evolucao_teorico-metodologica_dos_estudos_de_comportamento_informacional_de_usuarios","270960171_Human_Information_Behavior","264879629_ABORDAGEM_INTERACIONISTA_DE_ESTUDOS_DE_USUARIOS_DA_INFORMACAO","249364883_On_User_Studies_and_Information_Needs","235802762_A_Comparison_of_the_Information_Seeking_Patterns_of_Researchers_in_the_Physical_and_Social_Sciences","30865388_O_pensamento_reflexivo_na_busca_e_no_uso_da_informacao_na_comunicacao_cientifica","267797462_Introducao_a_Tecnologia_Assistiva","264949751_Encyclopedia_of_Library_and_Information_Sciences","244447915_A_Behavioral_Model_For_Information_Retrieval_System_Design","239559518_NOVOS_PARADIGMAS_E_NOVOS_USUARIOS_DE_INFORMACAO"]}