{"id":"305459060_Soft_Data_and_Public_Policy_Can_Social_Media_Offer_Alternatives_to_Official_Statistics_in_Urban_Policymaking_Soft_Data_and_Public_Policy","abstract":"In recent years, decision makers have reported difficulties in the use of official statistics in public policy: excessively long publication delays, insufficient coverage of topics of interest, and the top-down process of data creation. The deluge of data available online represents a potential answer to these problems, with social media data in particular as a possible alternative to traditional data. In this article, we propose a definition of “Soft Data” to indicate data that are freely available on the Internet, and that are not controlled by a public administration but rather by public or private actors. The term Soft Data is not intended to replace those of “Big Data” and “Open Data,” but rather to highlight specific properties and research methods required to convert them into information of interest for decision makers. The analysis is based on a case study of Twitter data for urban policymaking carried out for a European research program aimed at enhancing the effectiveness of European cohesion policy. The article explores methodological issues and the possible impact of “Soft Data” on public policy, reporting on semistructured interviews carried out with nine European policymakers.","authors":["Marta Severo","Amel Feredj","Alberto Romele"],"meta":["July 2016Policy and Internet 8(3)","DOI:10.1002/poi3.127","Project: geomedia"],"references":["291321112_Handbook_Twitter_for_Research_2015_2016","283497244_NavigTweet_A_Visual_Tool_for_Influence-Based_Twitter_Browsing","282212098_Traces_numeriques_et_territoires","281748849_Critical_questions_for_big_data_Provocations_for_a_cultural_technological_and_scholarly_phenomenon","281558593_Big_Data_as_a_Source_for_Official_Statistics","317558148_Methodological_Issues_and_Challenges_in_the_Production_of_Official_Statistics_24th_Annual_Morris_Hansen_Lecture","296065097_Agenda_Editorial","284711971_Methodological_Issues_and_Challenges_in_the_Production_of_Official_StatisticsComments_on_Methodological_Issues_and_Challenges_in_the_Production_of_Official_StatisticsComments_on_Methodological_Issues_","284414819_Structural_layers_of_communication_on_Twitter","281748739_Mining_One_Percent_of_Twitter_Collections_Baselines_Sampling"]}