{"id":"305421730_Parallel_skyline_computation_for_frequent_queries_in_distributed_environment","abstract":"Skyline queries produce the tuples which are ‘promising’ on the dimensions of the user's interest. The popular datasets often get queried by the users where dimensions of the user queries often overlap. For such frequent, overlapping skyline queries, repeating computations on large datasets result into unacceptable response time. In the scenarios where, there exists a little deviation in the query dimensions than those of the popular dimensions, the re-use of the previous results can help in either avoiding or reducing the further computational costs. In this paper we focus exactly on this problem and aim at optimizing the response time of frequent and near to frequent skyline queries raised against the distributed datasets. We propose a novel, simple yet efficient algorithm namely the PQPSkyline which makes use of our previously proposed data structure called as ‘Query Profiler’. The centralized server receives the skyline queries and works for the allocation of the peers where the horizontal splits of the dataset are available and the peers work in parallel fashion. The experiments performed on the real life dataset demonstrate, effectiveness and scalability of the proposed algorithm.","authors":["R. D. Kulkarni","Bashirahamad Fardin Momin"],"meta":["March 2016","DOI:10.1109/ICCTICT.2016.7514610","Conference: 2016 International Conference on Computational Techniques in Information and Communication Technologies (ICCTICT)"],"references":["285651665_Skyline_Computation_for_Frequent_Queries_in_Update_Intensive_Environment","261106917_On_Skyline_Groups","225135968_AGiDS_A_Grid-Based_Strategy_for_Distributed_Skyline_Query_Processing","221613248_SaLSa_Computing_the_skyline_without_scanning_the_whole_sky","285671997_Efficient_Subgraph_Skyline_Search_Over_Large_Graphs","271425449_Continuous_fragmented_skylines_over_distributed_streams","262251574_Parallel_Computation_of_Skyline_Queries","232703413_Distributed_top-_k_query_processing_by_exploiting_skyline_summaries","224148855_Constrained_Skyline_Query_Processing_against_Distributed_Data_Sites","221550004_WC_Efficient_progressive_processing_of_skyline_queries_in_peer-to-peer_systems"]}