{"id":"305460638_Elastic-plastic_secondary_indeterminate_problem_for_thin-walled_pipe_through_the_inner-wall_loading_by_three-point_bending","abstract":"The inner-wall loading by three-point bending about thin-walled pipe is an elastic-plastic secondary indeterminate problem in the symmetrical three-roller setting round process. In this study, the shifting of the tangent point between the pipe and lower roller is ignored. The bilinear hardening material model is adopted, and the static equilibrium condition, physical relationship of elastic-plastic deformation, and deformation compatibility condition are taken into account. Based on the geometrical discrete idea, a semi-circular pipe is meshed equably into N micro-pipe-wall elements with same geometric parameters along the circumferential direction. Deformation characteristics of each element are calculated, and then the deformation history response of the whole pipe is resolved by the load increment method. The finite element model of static bending in three-roller setting round process is established by using the software package ABAQUS. The theoretical and simulated results show that the cross section of pipe has two positive bending regions and two reverse bending regions; the maximum bending curvature appears in the bottom section of pipe, the minimum bending curvature appears in the section corresponding to the tangent point of the pipe and lower roller. The quantitative relationships between the upper roller load, maximum(minimum) bending curvature and reduction are given. Finally, the reliability of theoretical calculation is proved by numerical simulation.","authors":["Yu Gaochao","Jun Zhao","Feiping Zhao"],"meta":["July 2016Mechanics Based Design of Structures and Machines 45(2):1-20","DOI:10.1080/15397734.2016.1180993","Project: Springback Characteristics of Reciprocating Bending for Stable metal Materials and Engineering Application"],"references":["296748462_Elastic-plastic_analysis_of_a_beam_with_one_degree_of_indeterminacy_under_an_even_load","290288968_A_fast_analytical_method_for_statically_indeterminate_problems_of_cable-beam_coupled_structures","284047929_A_new_extracting_formula_and_a_new_distinguishing_means_on_the_one_variable_cubic_equation","264734724_Field_monitoring_and_numerical_analysis_of_Tsing_Ma_Suspension_Bridge_temperature_behavior","263482982_Leak-before-break_and_plastic_collapse_behaviour_of_statically_indeterminate_pipe_system_with_circumferential_crack","260835740_A_Refined_Model_of_Three-roller_Elastoplastic_Asymmetrical_Pre-bending_of_Plate","260212826_Prediction_and_control_of_springback_in_setting_round_process_for_pipe-end_of_large_pipe","259161479_Bending_force_prediction_for_dynamic_roll-bending_during_3-roller_conical_bending_process","258846571_Analysis_of_Stress_and_Strain_in_the_Absolute_Nodal_Coordinate_Formulation","256380728_A_combined_ADINA_finite_difference_approach_with_substructuring_for_solving_seismically_induced_nonlinear_soil-structure_interaction_problems"]}