{"id":"305469665_Governing_Knowledge_Commons","abstract":"“Knowledge commons” describes the institutionalized community governance of the sharing and, in some cases, creation, of information, science, knowledge, data, and other types of intellectual and cultural resources. It is the subject of enormous recent interest and enthusiasm with respect to policymaking about innovation, creative production, and intellectual property. Taking that enthusiasm as its starting point, Governing Knowledge Commons argues that policymaking should be based on evidence and a deeper understanding of what makes commons institutions work. It offers a systematic way to study knowledge commons, borrowing and building on Elinor Ostrom’s Nobel Prize-winning research on natural resource commons. It proposes a framework for studying knowledge commons that is adapted to the unique attributes of knowledge and information, describing the framework in detail and explaining how to put it into context both with respect to commons research and with respect to innovation and information policy. Eleven detailed case studies apply and discuss the framework exploring knowledge commons across a wide variety of scientific and cultural domains.","authors":["Michael J. Madison","Brett M. Frischmann","Katherine J. Strandburg"],"meta":["September 2014","Publisher: Oxford University PressISBN: 9780199972036","Project: Knowledge Commons"],"references":["305507450_Environmental_Infrastructure_35_Ecology_Law_Quarterly_151_2008","290672062_Individual_creators_in_the_cultural_commons","345235833_Pushing_the_Envelope_The_American_Aircraft_Industry","344805180_Internet_Success_A_Study_of_Open-Source_Software_Commons","322091573_A_Politics_of_Intellectual_Property_Environmentalism_for_the_Net","305869042_The_American_Aircraft_Industry","297438973_DISCIPLINE_AND_NOURISH_ON_CONSTRUCTING_COMMONS","292289062_Congestion_externalities_and_extended_copyright_protection","290284282_Cultural_commons_A_new_perspective_on_the_production_and_evolution_of_cultures","281562570_The_Public_Domain_Enclosing_the_Commons_of_the_Mind"]}