{"id":"305458556_Methode_de_prevision_des_apports_par_fusion_nivale_appliquee_a_la_gestion_de_la_ressource_en_eau_en_montagne","abstract":"Water supply management is becoming more and more specific, especially in managing complex uses of mountain water reservoirs: hydroelectricity, agriculture or tourism. Those challenges imply to care about the reservoirs filling. Snow storage and melting represent a big part of the reservoirs storage from spring to summer. Our aim is to assess snow storage capacity and to forecast its melting timing. So as to develop such models, different sorts of data have been used: historical series of reservoirs provisions flows, hydrometeorological data from the valley power plant station, snow water equivalent simulated by Crocus, the Meteo France avalanche risk forecasting model. Crocus datasets are spatialized on the whole catchment using an appropriate digital elevation model. The use of this Crocus snow water equivalent data has been validated through analysis of its correlation with observed inflows. Indeed, snow melt water flows deduced from Crocus fit well with inflows from February to July. Thus, a snowmelt inflows forecasting model based on a conceptual degree-day method and initialized with Crocus data has been developed. It uses temperature and precipitation data to calculate the snow cover and the hydrological flows of mountains catchments. Historical meteorological data are employed to generate a hundred of artificial random new series in order to deliver a probabilistic flow forecast. These chosen data match to seasonal meteorological trends, provided by CNR forecasters. Also, uncertainties from model settlement have been introduced to perform the probabilistic forecast. The degree-day model, which presents 8 parameters, has been calibrated on 1994-2010 historical data and validated on years 2012 and 2013. This model was developed in 2011 on the Oule lake catchment. It has been used operationally since 2012 and operational feedbacks are hopeful. Indeed, results are good and forecasted meteorological trends help to get better forecasting. Forecasts for the years 2012 and 2013 are presented, since those years are of particular interest regarding water resource management, because of their, respectively, unusually dry and snowy climatology.","authors":["Etienne Dommanget","Benjamin Graff"],"meta":["June 2016La Houille Blanche 102(3):42-52","DOI:10.1051/lhb/2016030"],"references":["307814137_Estimating_degree_day_factors_from_MODIS_for_snowmelt_runoff_modeling","278392057_Estimating_degree-day_factors_from_MODIS_for_snowmelt_runoff_modeling","200472476_An_Energy_and_Mass_Model_of_Snow_Cover_Suitable_for_Operational_Avalanche_Forecasting","200472037_A_meteorogical_estimation_of_relevant_parameters_for_snow_models","44166538_Evolution_du_modele_hydrologique_MORDOR_modelisation_du_stock_nival_a_differentes_altitudes","341442059_Modelisation_precipitations_debit_sous_influence_nivale_Elaboration_d'un_module_neige_et_evaluation_sur_380_bassins_versants","319962154_A_meteorological_estimation_of_relevant_parameters_for_snow_models","239066515_Decomposition_of_the_Continuous_Ranked_Probability_Score_for_Ensemble_Prediction_Systems","200472505_A_numerical_model_to_simulate_snow-cover_stratigraphy_for_operational_avalanche_forecasting","32994323_Modeles_mathematiques_de_la_fusion_nivale_en_un_point"]}