{"id":"305522023_The_interplay_between_reflective_thinking_critical_thinking_self-monitoring_and_academic_achievement_in_higher_education","abstract":"The present study assessed the associations among higher-order thinking skills (reflective thinking, critical thinking) and self-monitoring that contribute to academic achievement among university students. The sample consisted of 196 Iranian university students (mean age = 22.05, SD = 3.06; 112 females; 75 males) who were administered three questionnaires. To gauge reflective thinking, the “Reflective Thinking Questionnaire” designed by Kember et al. (Assess Eval High Educ 25(4):380–395, 2000) was utilized. It includes 16 items measuring four types of reflective thinking (habitual action, understanding, reflection, and critical reflection). To assess critical thinking, the “Watson–Glaser Critical Thinking Appraisal”(2002) was utilized. It comprises 80 items and consists of 5 subtests (inference, recognizing unstated assumptions, deduction, interpretation, and evaluation). Self-monitoring was measured via 8 items of the self-regulation trait questionnaire designed by O’Neil and Herl (Paper presented at the annual meeting of the American Educational Research Association, San Diego, CA, 1998). The results demonstrated that critical thinking and all components of reflective thinking positively and significantly predicted achievement with habitual action having the lowest impact and reflection exhibiting the highest influence. Self-monitoring indirectly exerted a positive influence on achievement via understanding and reflection. It was also found that among the four subscales of reflective thinking, reflection and critical reflection predicted critical thinking positively and significantly. Self-monitoring had a positive and significant impact on critical thinking. It also significantly and positively influenced understanding as well as reflection.","authors":["Afsaneh Ghanizadeh"],"meta":["July 2017Higher Education 74(1)","DOI:10.1007/s10734-016-0031-y"],"references":["350323168_Enhancing_Critical_Thinking_Skills_Among_Authoritarian_Students","313633699_The_development_of_academic_self-efficacy","313620384_The_development_of_self-efficacy","306235454_Mind_Mapping_for_Critical_Thinking","289963470_The_role_of_motivation_in_promoting_and_sustaining_self-regulated_learning","289963087_The_role_of_motivation_in_promoting_and_sustaining_self-regulated_learning","289419446_Critical_thinking_Competency_standards_essential_for_the_cultivation_of_intellectual_skills_part_I","287304451_Critical_Thinking_An_Exploration_of_Theory_and_Practice","284477223_Examination_of_student_learning_approaches_reflective_thinking_and_epistemological_beliefs_A_latent_variables_approach","284408175_Critical_thinking_in_the_classroom","271880996_Prospective_Teacher's_Evaluations_in_Terms_of_Using_Reflective_Thinking_Skills_to_Solve_Problems","280751547_Attaining_self-regulation_A_social_cognitive_perspective","277681069_Attaining_Self-Regulation","273236440_Critical_ThinkingCritical_Teaching","272663493_EFL_Learners'_Self-regulation_Critical_Thinking_and_Language_Achievement"]}