{"id":"305504522_Journal_copyright_restrictions_and_actual_open_access_availability_a_study_of_articles_published_in_eight_top_information_systems_journals_2010-2014","abstract":"Most scholarly journals have explicit copyright restrictions for authors outlining how published articles, or earlier manuscript versions of such articles, may be distributed on the open web. Empirical research on the development of open access (OA) is still scarce and methodologically fragmented, and research on the relationship between journal copyright restrictions and actual free online availability is non-existent. In this study the free availability of articles published in eight top journals within the field of Information Systems (IS) is analyzed by observing the availability of all articles published in the journals during 2010–2014 (1515 articles in total) through the use of Google and Google Scholar. The web locations and document versions of retrieved articles for up to three OA copies per published article were categorized manually. The web findings were contrasted to journal copyright information and augmented with citation data for each article. Around 60 % of all published articles were found to have an OA copy available. The findings suggest that copyright restrictions weakly regulate actual author-side dissemination practice. The use of academic social networks (ASNs) for enabling online availability of research publications has grown increasingly popular, an avenue of research dissemination that most of the studied journal copyright agreements failed to explicitly accommodate.","authors":["Mikael Laakso","Juho Lindman"],"meta":["July 2016Scientometrics 109(2)","DOI:10.1007/s11192-016-2078-z"],"references":["294917288_Open_Access_Meets_Discoverability_Citations_to_Articles_Posted_to_Academiaedu","290731338_The_Open-Access_Movement_is_Not_Really_about_Open_Access","282328818_The_role_of_arXiv_RePEc_SSRN_and_PMC_in_formal_scholarly_communication","281078427_Open_Access_The_Whipping_Boy_for_Problems_in_Scholarly_Publishing","280303439_Open_access_and_sources_of_full-text_articles_in_Google_Scholar_in_different_subject_fields","330332126_Open_Access","324865225_The_Open-Access_Movement_is_Not_Really_about_Open_Access","303292682_Social-sciences_preprint_server_snapped_up_by_publishing_giant_Elsevier","301717796_Who's_downloading_pirated_papers_Everyone","283099241_Open_Access_A_Cause_but_not_the_Cause"]}