{"id":"305517096_Holes_stabilize_freely_falling_coins","abstract":"The free fall of heavy bodies in a viscous fluid medium is a problem of interest to many engineering and scientific disciplines, including the study of unpowered flight and seed dispersal. The falling behaviour of coins and thin discs in particular has been categorized into one of four distinct modes; steady, fluttering, chaotic or tumbling, depending on the moment of inertia and Reynolds number. This paper investigates, through a carefully designed experiment, the falling dynamics of thin discs with central holes. The effects of the central hole on the disc’s motion is characterized for a range of Reynolds number, moments of inertia and inner to outer diameter ratio. By increasing this ratio, that is, the hole size, the disc is found to transition from tumbling to chaotic then fluttering at values of the moment of inertia not predicted by the falling modes of whole discs. This transition from tumbling to fluttering with increased hole size is viewed as a stabilization process. Flow visualization of the wake behind annular discs shows the presence of a vortex ring at the disc’s outer edge, as in the case of whole discs, and an additional counter-rotating vortex ring at the disc’s inner edge. The inner vortex ring is responsible for stabilizing the disc’s falling motion. These findings have significant implications on the development of design principles for engineered robotic systems in free flight, and may shed light on the stability of gliding animals.","authors":["Lionel Vincent","W. Scott Shambaugh","Eva Kanso"],"meta":["August 2016Journal of Fluid Mechanics 801:250-259","DOI:10.1017/jfm.2016.432","Project: Passive flight and sedimentation in air and water"],"references":["280292169_PIVlab_-_Towards_User-friendly_Affordable_and_Accurate_Digital_Particle_Image_Velocimetry_in_MATLAB","262527680_A_theoretical_analysis_of_pitch_stability_during_gliding_in_flying_snakes","259211893_Coins_falling_in_water","258796263_Three_coins_in_a_fountain","258796256_Falling_styles_of_disks","232025616_Analysis_of_transitions_between_fluttering_tumbling_and_steady_descent_of_falling_cards","231996960_Planar_controlled_gliding_tumbling_and_descent","245378341_Vortex-Induced_Vibrations","241614557_Stokes_drag_on_a_flat_annular_ring","232022372_Falling_cards"]}