{"id":"305674072_Enhancing_Reliability_of_Vehicular_Participatory_Sensing_Network_A_Bayesian_Approach","abstract":"Participatory sensing (PS) is an emerging socio-technological paradigm in which citizens voluntarily participate and contribute to a distributed information system using applications installed in their hand-held devices. It can be found in a number of real-life applications, viz. traffic monitoring, air/sound pollution, garbage monitoring, social networking, commodity pricing, and so on. In these systems, information sensed by the user helps the peers in decision making. Present work considers vehicular participatory sensing systems, where registered user senses (perceives) the traffic incident and submits its report(s) to a PS application server. PS application server in turn, broadcasts those reports as alerts to its subscribers. To promote the participation, the PS systems used to have incentive schemes for the participants. However, a common problem in participatory sensing is the generation of false reports either due to wrong perception of an event or to maliciously increase the degree of participation to gain undue incentives. Such false reports make the usage of the PS system unreliable and vulnerable to the illusion attack. This work proposes a novel approach to make PS applications more reliable by identifying and filtering out the falsely reported event through automated confidence assignment based on a probabilistic model. Waze traffic alerts have been used as the dataset to validate the proposed filtering mechanism. Finally, simulation-based experiments and performance evaluation have been done to demonstrate that the proposed approach is relatively accurate.","authors":["Rajesh P Barnwal","Nirnay Ghosh","Soumya K. Ghosh","Sajal K. Das"],"meta":["May 2016","DOI:10.1109/SMARTCOMP.2016.7501689","Conference: 2016 IEEE International Conference on Smart Computing (SMARTCOMP)"],"references":["261432606_Fairness_and_social_welfare_in_incentivizing_participatory_sensing","260422119_ILR_Improving_Location_Reliability_in_Mobile_Crowd_Sensing","254464487_Crowdsourcing_to_smartphones_Incentive_mechanism_design_for_mobile_phone_sensing","228872449_LINK_Location_Verification_through_Immediate_Neighbors_Knowledge","305349487_Providing_privacy-aware_incentives_in_mobile_sensing_systems","301710921_A_probabilistic_approach_for_filtering_out_spam_reports_in_a_vehicular_participatory_sensing_system","286713825_FIDES_A_trust-based_framework_for_secure_user_incentivization_in_participatory_sensing","271454819_Providing_Privacy-Aware_Incentives_in_Mobile_Sensing_Systems","261463063_ARTSense_Anonymous_Reputation_and_Trust_in_Participatory_Sensing","261060371_Optimal_Incentive-driven_Design_of_Participatory_Sensing_Systems"]}