{"id":"305695923_Scalable_Daily_Human_Behavioral_Pattern_Mining_from_Multivariate_Temporal_Data","abstract":"This work introduces a set of scalable algorithms to identify patterns of human daily behaviors. These patterns are extracted from multivariate temporal data that have been collected from smartphones. We have exploited sensors that are available on these devices, and have identified frequent behavioral patterns with a temporal granularity, which has been inspired by the way individuals segment time into events. These patterns are helpful to both end-users and third parties who provide services based on this information. We have demonstrated our approach on two real-world datasets and showed that our pattern identification algorithms are scalable. This scalability makes analysis on resource constrained and small devices such as smartwatches feasible. Traditional data analysis systems are usually operated in a remote system outside the device. This is largely due to the lack of scalability originating from software and hardware restrictions of mobile/wearable devices. By analyzing the data on the device, the user has the control over the data, i.e. privacy, and the network costs will also be removed.","authors":["Reza Rawassizadeh","Elaheh Momeni","Chelsea Dobbins","Joobin Gharibshah"],"meta":["July 2016IEEE Transactions on Knowledge and Data Engineering 28(11):3098 - 3112","DOI:10.1109/TKDE.2016.2592527"],"references":["283569950_Lesson_Learned_from_Collecting_Quantified_Self_Information_via_Mobile_and_Wearable_Devices","282265209_SPMF_A_java_open-source_pattern_mining_library","281893477_Wearables_Has_the_Age_of_Smartwatches_Finally_Arrived","281550416_Clustering_of_Physical_Activities_for_Quantified_Self_and_mHealth_Applications","321516863_Time_Granularities_in_Databases_Data_Mining_and_Temporal_Reasoning","313203504_Reality_mining_Sensing_complex_social_systems","312449512_Mining_Frequent_Patterns_without_Candidate_Generation","303802749_Indexing_by_Latent_Semantic_Analysis","289311430_MobileMiner_Mining_your_frequent_patterns_on_your_phone","283925025_Maintaining_Knowledge_about_Temporal_Intervals"]}