{"id":"305618783_Single_Image_Super-Resolution_via_Locally_Regularized_Anchored_Neighborhood_Regression_and_Nonlocal_Means","abstract":"The goal of learning-based image super resolution (SR) is to generate a plausible and visually pleasing high-resolution (HR) image from a given low-resolution (LR) input. The SR problem is severely underconstrained, and it has to rely on examples or some strong image priors to reconstruct the missing HR image details. This paper addresses the problem of learning the mapping functions (i.e., projection matrices) between the LR and HR images based on a dictionary of LR and HR examples. Encouraged by recent developments in image prior modeling, where the state-of-the-art algorithms are formed with nonlocal self-similarity and local geometry priors, we seek an SR algorithm of similar nature that will incorporate these two priors into the learning from LR space to HR space. The nonlocal self-similarity prior takes advantage of the redundancy of similar patches in natural images, while the local geometry prior of the data space can be used to regularize the modeling of the nonlinear relationship between LR and HR spaces. Based on the above two considerations, we first apply the local geometry prior to regularize the patch representation, and then utilize the nonlocal means filter to improve the super-resolved outcome. Experimental results verify the effectiveness of the proposed algorithm compared with the state-of-the-art SR methods.","authors":["Junjun Jiang","Xiang Ma","Chen Chen","Tao Lu"],"meta":["January 2017IEEE Transactions on Multimedia 19(1):15--26","DOI:10.1109/TMM.2016.2599145","Project: Face image super-resolution via manifold learning"],"references":["305722906_SRLSP_A_Face_Image_Super-Resolution_Algorithm_Using_Smooth_Regression_with_Local_Structure_Prior","285433911_Locally_regularized_Anchored_Neighborhood_Regression_for_fast_Super-Resolution","312771295_Image_quality_assessment_From_error_visibility_to_structural_similarity","307895539_Super-resolution_through_neighbor_embedding","303982091_SERF_A_Simple_Effective_Robust_and_Fast_Image_Super-Resolver_from_Cascaded_Linear_Regression","303980723_Reference_Information_Based_Remote_Sensing_Image_Reconstruction_with_Generalized_Nonconvex_Low-Rank_Approximation","303866765_Noise_Robust_Position-Patch_based_Face_Super-Resolution_via_Tikhonov_Regularized_Neighbor_Representation","297597865_Weighted_Joint_Sparse_Representation_for_Removing_Mixed_Noise_in_Image","292680729_Infrared_and_visible_image_fusion_via_gradient_transfer_and_total_variation_minimization","286784019_Ill-posed_problems"]}