{"id":"305661794_Modeling_of_hydrophobic_cohesive_sediment_transport_in_the_Ells_River_Alberta_Canada","abstract":"Purpose\nIn this paper, a novel modeling approach is applied to assess the unique transport characteristics of hydrophobic (bitumen containing) cohesive sediment for the Ells River, AB, Canada. The modeling offers a new way of treating the transport and fate of fine sediment in rivers and points to the importance of including a sediment entrapment process in the modeling of the Ells River sediment dynamics.\n\nMaterials and methods\nThe modeling approach involves combining two existing models (RIVFLOC and MOBED). Using fine sediment transport parameters derived from laboratory flume experiments (e.g., settling velocity of sediment as a function of floc size and the critical shear stresses for deposition) and the calculated flow field from the MOBED model (using field survey data such as, cross-sectional geometry, river slope, grain size of bed material, and discharge), the RIVFLOC model is used to predict the transport characteristics (including entrapment) of the hydrophobic Ells River sediment.\n\nResults and discussion\nThe application of the connected RIVFLOC and MOBED models, demonstrated the unique hydrophobic sediment dynamics of the Ells River. The model showed no deposition (in the classical sense) of the hydrophobic sediment as the bed shear stresses, even at base flow, are well above the critical bed shear for deposition (flocculation is shown to occur, but its impact on settling is negligible given the high shear stresses). However, the model showed the possibility of fine sediment ingression into the river bed (interstitial voids) due to the entrapment process which is known to occur at bed shear stresses well above the critical shear stress for deposition.\n\nConclusions\nThe salient features of RIVFLOC and MOBED models and their applications for understanding the transport and fate of unique hydrophobic fine sediments are presented. The models are shown to be useful for the understanding and projection of flow characteristics and sediment dynamics (including entrapment), and will be of benefit for the adaptive management of riverine monitoring programs given various flow scenarios including extreme events and climate change.","authors":["Ian G. Droppo","B. G. Krishnappan"],"meta":["December 2016Journal of Soils and Sediments 16(12)","DOI:10.1007/s11368-016-1501-7","Project: Oil Sands Reclamation and microbial function"],"references":["294261057_Modelling_of_lateral_flow_distribution_in_compound_channels","286900985_Entrapment_of_fines_in_coarse_sediment_beds","281212448_The_role_of_gravel_channel_beds_on_the_particle_size_and_organic_matter_selectivity_of_transported_fine-grained_sediment_implications_for_sediment_fingerprinting_and_biogeochemical_flux_research","276554566_The_effect_of_coarse_gravel_on_cohesive_sediment_entrapment_in_an_annular_flume","349250788_River_Channel_Roughness","330903014_Further_results_on_the_deposition_of_cohesive_sediments","314606686_Further_Results_on_the_Deposition_of_Cohesive_Sediments","313163365_The_mechanics_of_aerosols","291980285_Resuspension_of_Deposited_Cohesive_Sediment_Beds","291423337_Microbial_Interactions_with_Naturally_Occurring_Hydrophobic_Sediments_Influence_on_Sediment_and_Associated_Contaminant_Mobility","269420529_Fine-sediment_dynamics_towards_an_improved_understanding_of_sediment_erosion_and_transport","270460217_Sediment_in_Streams_Sources_Biological_Effects_and_Control","267276169_Biostabilization_of_cohesive_sediments_Revisiting_the_role_of_abiotic_conditions_physiology_and_diversity_of_microbes_polymeric_secretion_and_biofilm_architecture","264651161_Flume-_and_field-based_evaluation_of_a_time-integrated_suspended_sediment_sampler_for_the_analysis_of_sediment_properties","256370084_Physical_aspect_of_flocculation_process-I_Fundamental_treatise"]}