{"id":"305695464_A_Survey_on_Domain-Specific_Modeling_and_Languages_in_Robotics","abstract":"The development of advanced robotic systems is challenging as expertise from multiple domains needs to be integrated conceptually and technically. Model-driven engineering promises an efficient and flexible approach for developing robotics applications that copes with this challenge. Domain-specific modeling allows to describe robotics concerns with concepts and notations closer to the respective problem domain. This raises the level of abstraction and results in models that are easier to understand and validate. Furthermore, model-driven engineering allows to increase the level of automation, e.g., through code generation, and to bridge the gap between modeling and implementation. The anticipated results are improved efficiency and quality of the robotics systems engineering process. Within this contribution, we survey the available literature on domain-specific modeling and languages that target core robotics concerns. In total 137 publications were identified that comply with a set of defined criteria, which we consider essential for contributions in this field. With the presented survey, we provide an overview on the state-of-the-art of domain-specific modeling approaches in robotics. The surveyed publications are investigated from the perspective of users and developers of model-based approaches in robotics along a set of quantitative and qualitative research questions. The presented quantitative analysis clearly indicates the rising popularity of applying domain-specific modeling approaches to robotics in the academic community. Beyond this statistical analysis, we map the selected publications to a defined set of robotics subdomains and introduce an extended classification scheme to allow a fine-grained mapping of publications addressing the architecture and programming of robotics systems. We map the surveyed publications to typical development phases in robotic systems engineering. The resulting classification tree shall serve as overview and reference for potential users. Furthermore, we analyze the surveyed contributions from a language engineering viewpoint and discuss aspects such as the methods and tools used for their implementation as well as their documentation status, platform integration, typical use cases and the evaluation strategies used for validation of the proposed approaches. Finally, we conclude with recommendations for discussion in the model-driven engineering and robotics community based on the insights gained in this survey.","authors":["Arne Nordmann","Nico Hochgeschwender","Dennis Wigand","Sebastian Wrede"],"meta":["July 2016Journal of Software Engineering for Robotics 7(1):75-99","Projects: CogIMon – Cognitive Interaction in MotionAMARSi"],"references":["353777649_Model-driven_engineering_for_mobile_robotic_systems_a_systematic_mapping_study","333255562_Robotics_API_object-oriented_software_development_for_industrial_robots","314582144_Correct_Software_Synthesis_for_Stable_Speed-Controlled_Robotic_Walking","301953072_Modelling_and_Analysis_of_a_Redundant_Mobile_Robot_Architecture_Using_AADL","301953068_A_Modeling_Framework_for_Software_Architecture_Specification_and_Validation","301953169_Fault_Avoidance_in_Development_of_Robot_Motion-Control_Software_by_Modeling_the_Computation","301953158_A_Component-Based_Meta-Model_and_Framework_in_the_Model_Driven_Toolchain_C-Forge","301953108_Towards_Rule-Based_Dynamic_Safety_Monitoring_for_Mobile_Robots","301953073_Applying_Simulation_and_a_Domain-Specific_Language_for_an_Adaptive_Action_Library","301953069_Control_and_Scheduling_Co-design_for_a_Simulated_Quadcopter_Robot_A_Model-Driven_Approach"]}