{"id":"305648390_Sketch-a-Net_A_Deep_Neural_Network_that_Beats_Humans","abstract":"We propose a deep learning approach to free-hand sketch recognition that achieves state-of-the-art performance, significantly surpassing that of humans. Our superior performance is a result of modelling and exploiting the unique characteristics of free-hand sketches, i.e., consisting of an ordered set of strokes but lacking visual cues such as colour and texture, being highly iconic and abstract, and exhibiting extremely large appearance variations due to different levels of abstraction and deformation. Specifically, our deep neural network, termed Sketch-a-Net has the following novel components: (i) we propose a network architecture designed for sketch rather than natural photo statistics. (ii) Two novel data augmentation strategies are developed which exploit the unique sketch-domain properties to modify and synthesise sketch training data at multiple abstraction levels. Based on this idea we are able to both significantly increase the volume and diversity of sketches for training, and address the challenge of varying levels of sketching detail commonplace in free-hand sketches. (iii) We explore different network ensemble fusion strategies, including a re-purposed joint Bayesian scheme, to further improve recognition performance. We show that state-of-the-art deep networks specifically engineered for photos of natural objects fail to perform well on sketch recognition, regardless whether they are trained using photos or sketches. Furthermore, through visualising the learned filters, we offer useful insights in to where the superior performance of our network comes from.","authors":["Qian Yu","Yongxin Yang","Feng Liu","Yi-Zhe Song"],"meta":["May 2017International Journal of Computer Vision 122(3)","DOI:10.1007/s11263-016-0932-3"],"references":["280305180_Sketch-a-Net_that_Beats_Humans","278242900_Sketch_Classification_and_Classification-driven_Analysis_Using_Fisher_Vectors","339504883_Computational_Support_for_Sketching_in_Design_A_Review","319770284_Edge_Boxes_Locating_Object_Proposals_from_Edges","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","314779249_How_do_humans_sketch_objects","310752533_Visualizing_and_understanding_convolutional_networks","308843426_Sketch-based_3D_shape_retrieval_using_Convolutional_Neural_Networks","282928002_Active_learning_for_sketch_recognition","273399906_Free-hand_Sketch_Recognition_by_Multi-Kernel_Feature_Learning","272422999_Sketch-based_Shape_Retrieval_using_Pyramid-of-Parts","267156066_Cross-Modal_Face_Matching_Beyond_Viewed_Sketches","264979485_Caffe_Convolutional_Architecture_for_Fast_Feature_Embedding","269250098_Sketch_Recognition_by_Ensemble_Matching_of_Structured_Features","265385906_Very_Deep_Convolutional_Networks_for_Large-Scale_Image_Recognition"]}