{"id":"305628701_Smart_cities_Concepts_architectures_research_opportunities","abstract":"BY 2030, THE world's population is projected to be 8.5 billion and increase to 9.7 billion by 2050 and 11.2 billion by 2100. Half of humanity today lives in cities. Many cities are experiencing exponential growth as people move from rural areas in search of better jobs and education. Consequently, cities' services and infrastructures are being stretched to their limits in terms of scalability, environment, and security as they adapt to support this population growth. Visionaries and planners are thus seeking a sustainable, post-carbon economy20 to improve energy efficiency and minimize carbon-emission levels. Along with cities' growth, innovative solutions are crucial for improving productivity (increasing operational efficiencies) and reducing management costs. A smart city is an ultra-modern urban area that addresses the needs of businesses, institutions, and especially citizens. Here we should differentiate between a smart city and smart urbanism. The objective of these concepts is the same-the life of citizens. The architects of ancient cities did not take into consideration long-Term scalability- housing accessibility, sustainable development, transport systems, and growth-and there is no scalable resource management that may be applied from one decade to another. Unfortunately, smart urbanism is not well represented in smart cities' development. Smart urbanism must also be considered as an aspect of a smart city, including information-communication technologies. In recent years, a significant increase in global energy consumption and the number of connected devices and other objects has led government and industrial institutions to deploy the smart city concept. Cities' demographic, economic, social, and environmental conditions are the major reasons for the dramatic increase in pollution, congestion, noise, crime, terrorist attacks, energy production, traffic accidents, and climate change. Cities today are the major contributors to the climate problem. They cover less than 2% of the Earth's surface yet consume 78% of the world's energy, producing more than 60% of all CO2 emissions (http://unhabitat.org/).","authors":["Rida Khatoun","Sherali Zeadally"],"meta":["July 2016Communications of the ACM 59(8):46-57","DOI:10.1145/2858789"],"references":["282603846_Wearable_Sensor-Based_Behavioral_Anomaly_Detection_in_Smart_Assisted_Living_Systems","277026227_Smart_cities_A_conjuncture_of_four_forces","268282716_Nanophotonics_Plasmoelectric_potentials_in_metal_nanostructures","266260663_Data_mining_and_linked_open_data_-_New_perspectives_for_data_analysis_in_environmental_research","301428530_Industrial_and_Business_Systems_for_Smart_Cities","279969752_Mobile_Agent-Based_Cross-Layer_Anomaly_Detection_in_Smart_Home_Sensor_Networks_Using_Fuzzy_Logic","276928531_Towards_an_effective_framework_for_building_smart_cities_Lessons_from_Seoul_and_San_Francisco","274479822_Big_Data_and_Its_Technical_Challenges","268157519_Remote_sensing_Big_Data_computing_challenges_and_opportunities","266968082_Probing_the_mechanisms_of_large_Purcell_enhancement_in_plasmonic_nanoantennas"]}