{"id":"305667533_Abstract_3952_Label-free_imaging_identification_of_WBCs_based_on_the_features_of_quantitative_phase_microscope_images_for_negative_selection_of_CTCs","abstract":"Background: Recent technological advances have enabled the reliable detection and characterization of circulating tumor cells (CTCs) in the blood of cancer patients. To quantify the amount of CTCs, various assays have been developed to facilitate the detection of epithelial cells in the blood by using cellular surface markers such as EpCAM and cytokeratins. However, recent studies have revealed the importance of CTCs undergoing epithelial-mesenchymal transition (EMT), which are difficult to detect by the conventional surface marker-based methods because those CTCs express low expression of epithelial markers. We previously reported a novel method for the identification of CTCs by removing WBCs from mononuclear cells in the blood, based on the features of Quantitative Phase Microscope Images (QPIs) of the cells obtained from machine-learning (AACR Annual Meeting 2015). Here, we report some progress of our study.\nMethods: We analyzed WBCs and cancer cell lines using Quantitative Phase Microscope (QPM) that can image optical path-length of living cells with a high resolution of 1nm without staining in non-cytotoxic way. At this time, QPIs were reconstructed from line scanned images of the cells flowing in a chamber. Obtained QPIs were analyzed by a computer vision application which automatically identifies an object in digital images based on the features extracted from the dataset we had developed by machine learning.\nResults: We imaged 325 WBCs obtained from healthy donors and 325 cell-line cells (from 5 cancer cell lines) with QPM. Then, we extracted certain features from the QPIs and used them as training images for machine learning. We employed 5-fold cross validation to create an algorithm to detect WBCs circulating in the blood. The algorithm successfully recognized WBCs among QPIs mixed in with WBCs and cancer cell lines. The ROC AUC value was 0.98, indicating that the algorithm was not a random selection. Furthermore, we successfully captured QPIs of the flowing cells, which makes it possible to sort living cells based on the algorithm we developed.\nConclusions: We successfully differentiated WBCs from cancer cell lines based on the features of QPIs. The object recognition method applying to QPIs of the cell is expected as a useful, non-cytotoxic, marker-free isolation of CTCs.\nCitation Format: Yusuke Ozaki, Hidenao Yamada, Hirotoshi Kikuchi, Tomohiro Murakami, Tomhiro Matsumoto, Toshiki Kawabata, Yoshihiro Hiramatsu, Manabu Ohta, Kinji Kamiya, Megumi Baba, Toyohiko Yamauchi, Kentaro Goto, Yukio Ueda, Shigetoshi Okazaki, Hiroyuki Konno. Label-free imaging identification of WBCs based on the features of quantitative phase microscope images for negative selection of CTCs. [abstract]. In: Proceedings of the 107th Annual Meeting of the American Association for Cancer Research; 2016 Apr 16-20; New Orleans, LA. Philadelphia (PA): AACR; Cancer Res 2016;76(14 Suppl):Abstract nr 3952.","authors":["Yusuke Ozaki","Hidenao Yamada","Hirotoshi Kikuchi","Tomohiro Murakami"],"meta":["July 2016Cancer Research 76(14 Supplement):3952-3952","DOI:10.1158/1538-7445.AM2016-3952"],"references":[]}