{"id":"305683287_Algorithmic_statistics_forty_years_later","abstract":"Algorithmic statistics has two different (and almost orthogonal) motivations. From the philosophical point of view, it tries to formalize how the statistics works and why some statistical models are better than others. After this notion of a \"good model\" is introduced, a natural question arises: it is possible that for some piece of data there is no good model? If yes, how often these bad (\"non-stochastic\") data appear \"in real life\"? Another, more technical motivation comes from algorithmic information theory. In this theory a notion of complexity of a finite object (=amount of information in this object) is introduced; it assigns to every object some number, called its algorithmic complexity (or Kolmogorov complexity). Algorithmic statistic provides a more fine-grained classification: for each finite object some curve is defined that characterizes its behavior. It turns out that several different definitions give (approximately) the same curve. In this survey we try to provide an exposition of the main results in the field (including full proofs for the most important ones), as well as some historical comments. We assume that the reader is familiar with the main notions of algorithmic information (Kolmogorov complexity) theory.","authors":["Nikolay Vereshchagin","Alexander Shen"],"meta":["July 2016","Project: Algorithmic statistics"],"references":["319393405_An_Introduction_to_Kolmogorov_Complexity_and_Its_Applications","305040438_The_concept_of_a_b-stochasticity_in_the_Kolmogorov_sense_and_its_properties","292334872_Computability_in_statistical_hypotheses_testing_and_characterizations_of_independence_and_directed_influences_in_time_series_using_Kolmogorov_complexity","287250284_Algorithmic_statistics_normal_objects_and_universal_models","282000522_Algorithmic_statistics_prediction_and_machine_learning","277290590_Does_Snooping_Help","259283556_Sophistication_as_Randomness_Deficiency","284985345_Kolmogorov_Complexity_Data_Compression_and_Inference","276370573_Algorithmic_Minimal_Sufficient_Statistics_a_New_Approach","256554744_On_the_relation_between_descriptional_complexity_and_algorithmic_probability"]}