{"id":"305680067_Unsupervised_Detection_and_Analysis_of_Changes_in_Everyday_Physical_Activity_Data","abstract":"Sensor-based time series data can be utilized to monitor changes in human behavior as a person makes a significant lifestyle change, such as progress toward a fitness goal. Recently, wearable sensors have increased in popularity as people aspire to be more conscientious of their physical health. Automatically detecting and tracking behavior changes from wearable sensor-collected physical activity data can provide a valuable monitoring and motivating tool. In this paper, we formalize the problem of unsupervised physical activity change detection and address the problem with our Physical Activity Change Detection (PACD) approach. PACD is a framework that detects changes between time periods, determines significance of the detected changes, and analyzes the nature of the changes. We compare the abilities of three change detection algorithms from the literature and one proposed algorithm to capture different types of changes as part of PACD. We illustrate and evaluate PACD on synthetic data and using Fitbit data collected from older adults who participated in a health intervention study. Results indicate PACD detects several changes in both datasets. The proposed change algorithms and analysis methods are useful data mining techniques for unsupervised, window-based change detection with potential to track users' physical activity and motivate progress toward their health goals.","authors":["Gina Sprint","Diane J. Cook","Maureen Schmitter-Edgecombe"],"meta":["July 2016Journal of Biomedical Informatics 63(6)","DOI:10.1016/j.jbi.2016.07.020"],"references":["281768945_Automated_Detection_of_Activity_Transitions_for_Prompting","271428470_Indoor_activity_monitoring_system_for_elderly_using_RFID_and_Fitbit_Flex_wristband","270790857_Sensor-Based_Activity_Recognition","266210428_Change_Detection_in_Streaming_Data_in_the_Era_of_Big_Data_Models_and_Issues","329476370_Controlling_the_False_Discovery_Rate_A_Practical_and_Powerful_Approach_to_Multiple_Testing","286822960_Change-point_detection_in_multivariate_time-series_data_by_Recurrence_Plot","282419274_Modeling_Patterns_of_Activities_using_Activity_Curves","281058573_Early_Warning_of_Acute_Decompensation_in_Heart_Failure_Patients_Using_a_Non-Contact_Measure_of_Stability_Index","274721881_Wearable_Monitoring_of_Physical_Functioning_and_Disability_Changes_Circadian_Rhythms_and_Sleep_Patterns_in_Nursing_Home_Residents","272928815_Exploratory_Data_Analysis"]}