{"id":"305659382_Dynamic_Bayesian_Network_for_semantic_place_classification_in_mobile_robotics","abstract":"In this paper, the problem of semantic place categorization in mobile robotics is addressed by considering a\ntime-based probabilistic approach called Dynamic Bayesian Mixture Model (DBMM), which is an improved variation of the Dynamic Bayesian Network (DBN). More specifically, multi-class semantic classification is performed by a DBMM composed of a mixture of heterogeneous base classifiers, using geometrical features computed from 2D laserscanner data, where the sensor is mounted on-board a moving robot operating indoors. Besides its capability to combine different probabilistic classifiers, the DBMM approach also incorporates time-based (dynamic) inferences in the form of previous class-conditional probabilities and priors. Extensive\nexperiments were carried out on publicly available benchmark datasets, highlighting the influence of the number\nof time-slices and the effect of additive smoothing on the classification performance of the proposed approach. Reported results, under different scenarios and conditions, show the effectiveness and competitive performance of the DBMM.","authors":["Cristiano Premebida","Diego R. Faria","Urbano J. Nunes"],"meta":["August 2016Autonomous Robots"],"references":["284077839_A_robust_loop-closure_method_for_visual_SLAM_in_unstructured_seafloor_environments","279289611_Applying_Probabilistic_Mixture_Models_to_Semantic_Place_Classification_in_Mobile_Robotics","266384921_Indoor_Place_Categorization_using_Co-Occurrences_of_LBPs_in_Gray_and_Depth_Images_from_RGB-D_Sensors","319207907_Pattern_Classification","312944154_Incremental_Learning_for_Place_Recognition_in_Dynamic_Environments","307174896_An_Empirical_Study_of_Smoothing_Techniques_for_Language_Modeling","290210752_Local_N-ary_Patterns_A_local_multi-modal_descriptor_for_place_categorization","278674617_ViDRILO_The_Visual_and_Depth_Robot_Indoor_Localization_with_Objects_information_dataset","270106548_Semantic_mapping_for_mobile_robotics_tasks_A_survey","265768258_Bayesian_Artificial_Intelligence"]}