{"id":"305637478_Que_son_los_generos_profesionales_Apuntes_teorico-metodologicos_para_el_estudio_del_discurso_profesional","abstract":"El estudio del discurso especializado ha priorizado los textos académicos productores de conocimiento científico que circulan en centros de investigación y educación superior (e.g., artículo de investigación). Esta preferencia puede deberse a las necesidades didáctico-pedagógicas de la lingüística aplicada: ayudar a la inserción de los estudiantes universitarios en las prácticas de lectura y escritura de los géneros relevantes para su formación (i.e., alfabetización académica). Sin embargo, los géneros utilizados en la formación académica suelen ser menos y distintos de los géneros que los graduados encuentran en sus campos profesionales de desarrollo. Existe, por tanto, un amplio abanico de géneros discursivos profesionales que han pasado en general desapercibidos para la lingüística aplicada pero cuyo estudio resulta urgente. De hecho, son pocas las investigaciones que aportan una definición explícita de discurso profesional. En este trabajo llevaremos a cabo un relevo bibliográfico sobre análisis del discurso profesional, propondremos una definición operativa con parámetros de ajuste que permita enmarcar su estudio diferenciado, brindaremos algunos apuntes teórico-metodológicos que orienten la investigación, y adelantaremos algunas de sus características distintivas a partir de nuestras investigaciones sobre el plan de negocios en el campo de la empresa. Creemos que saber más sobre los géneros profesionales no académicos puede ayudar a saber más sobre el discurso profesional en general. Definimos el discurso profesional como el conjunto de géneros que llevan a cabo los objetivos de las organizaciones donde circulan. Pueden clasificarse a partir de parámetros como el ámbito (académico/no académico), la formación (escolar/experto) y el modo (escrito/oral/multimodal). Son prácticas discursivas escolares y laborales dominantes estandarizadas y reguladas institucionalmente. Su estudio multidisciplinar debe integrar aspectos léxico-gramaticales, pragmático-estratégicos y socioculturales. Metodológicamente, resulta necesario el relevo etnográfico, la colaboración con escritores expertos, el análisis textual cualitativo y cuantitativo y la construcción de corpus representativos. En particular, el plan de negocios, género no académico, es ultradinámico, tecno-multimodal, multietapas, restringido, intratextual e inclusivo-asertivo.","authors":["Federico Navarro"],"meta":["February 2012","In book: Actas del IV Congreso Internacional de Letras “Transformaciones Culturales. Debates de la teoría, la crítica y la lingüística en el Bicentenario” (Buenos Aires, 22-27 noviembre de 2010) (pp.1294-1303)Publisher: Universidad de Buenos AiresEditors: A. Cristófalo, J. Ledesma"],"references":["295253963_Identificacion_de_Generos_Academicos_y_Generos_Profesionales_Principios_Teoricos_y_Propuesta_Metodologica","275034586_De_la_Universidad_al_mundo_laboral_Continuidad_y_contraste_entre_las_practicas_letradas_academicas_y_profesionales","273370374_Occluded_Genres_in_the_Academy_The_Case_of_the_Submission_Letter","255633964_La_lectura_y_la_escritura_de_generos_profesionales_en_EpFE","312451650_Professional_discourse_Towards_a_multi-dimensional_approach_and_shared_practice","299534750_Genre_relations_Mapping_culture","289131035_Teaching_Academic_Literacy_across_the_University_Curriculum_as_Institutional_Policy_The_case_of_the_Universidad_Nacional_de_General_Sarmiento_Argentina","284688877_Alfabetizacion_academica_Un_cambio_necesario_algunas_alternativas_posibles","256590156_Introduction","250371924_Aproximacion_al_analisis_de_los_discursos_profesionales"]}