{"id":"305644091_Analyzing_the_Ranking_Method_for_Fuzzy_Numbers_in_Fuzzy_Decision_Making_Based_on_the_Magnitude_Concepts","abstract":"Ranking fuzzy numbers is an important component in the decision-making process with the last few decades having seen a large number of ranking methods. Ezzati et al. (Expert Syst Appl 39:690–695, 2012) proposed a revised approach for ranking symmetric fuzzy numbers based on the magnitude concepts to overcome the shortcoming of Abbasbandy and Hajjari’s method. Despite its merits, some shortcomings associated with Ezzati et al.’s approach include: (1) it cannot consistently rank the fuzzy numbers and their images; (2) it cannot effectively rank symmetric fuzzy numbers; and (3) it cannot rank non-normal fuzzy numbers. This paper thus proposes a revised method to rank generalized and/or symmetric fuzzy numbers in parametric forms that can surmount these issues. In the proposed ranking method, a novel magnitude of fuzzy numbers is proposed. To differentiate the symmetric fuzzy numbers, the proposed ranking method takes into account the decision maker’s optimistic attitude of fuzzy numbers. We employ several comparative examples and an application to demonstrate the usages and advantages of the proposed ranking method. The results conclude that the proposed ranking method effectively resolves the issues with Ezzati et al.’s ranking method. Moreover, the proposed ranking method can differentiate different types of fuzzy numbers.","authors":["Vincent F. Yu","Luu Huu Van","Luu Quoc Dat","Ha Thi Xuan Chi"],"meta":["July 2016International Journal of Fuzzy Systems 19(5)","DOI:10.1007/s40815-016-0223-8"],"references":["299523645_A_Centroid-based_Ranking_Method_of_Trapezoidal_Intuitionistic_Fuzzy_Numbers_and_Its_Application_to_MCDM_Problems","267067828_Fuzzy_Set_Theory_-_and_Its_Applications","263469210_An_improved_ranking_method_for_fuzzy_numbers_based_on_the_centroid-index","263315739_Ordering_Alternatives_under_Fuzzy_Multiple_Criteria_Decision_Making_via_a_Fuzzy_Number_Dominance_Based_Ranking_Approach","317847437_Fuzzy_Set_Theory_-_and_Its_Applications","292950599_A_New_Method_to_Rank_Fuzzy_Numbers_Using_Dempster-Shafer_Theory_with_Fuzzy_Targets","279233940_Fuzzy_Set_Theory_And_Its_Applications","269981258_Ranking_triangle_and_trapezoidal_fuzzy_numbers_based_on_the_relative_preference_relation","259198276_An_improved_ranking_method_for_fuzzy_numbers_with_integral_values","255279343_Ranking_LR_fuzzy_number_based_on_deviation_degree"]}