{"id":"305646147_Automated_Detection_of_Malaria_Parasites_on_Thick_Blood_Smears_via_Mobile_Devices","abstract":"An estimated 214 million cases of malaria were detected in 2015, which caused approximately 438 000 deaths. Around 90% of those cases occurred in Africa, where the lack of access to malaria diagnosis is largely due to shortage of expertise and equipment. Thus, the importance to develop new tools that facilitate the rapid and easy diagnosis of malaria for areas with limited access to healthcare services cannot be overstated. This paper presents an image processing and analysis methodology using supervised classification to assess the presence of P.falciparum trophozoites and white blood cells in Giemsa stained thick blood smears. The main differential factor is the usage of microscopic images exclusively acquired with low cost and accessible tools such as smartphones, using a dataset of 194 images manually annotated by an experienced parasilogist. Using a SVM classifier and a total of 314 image features extracted for each candidate, the automatic detection of trophozoites detection achieved a sensitivity of 80.5% and a specificity of 93.8%, while the white blood cells achieved 98.2% of sensitivity and 72.1% specificity.","authors":["Luís Rosado","José Manuel Correia da Costa","Dirk Elias","Jaime S. Cardoso"],"meta":["December 2016Procedia Computer Science 90:138-144","DOI:10.1016/j.procs.2016.07.024"],"references":["298432524_A_Review_of_Automatic_Malaria_Parasites_Detection_and_Segmentation_in_Microscopic_Images","266146329_Automated_Blood_Smear_Analysis_for_Mobile_Malaria_Diagnosis","307881957_LIBSVM_A_library_for_support_vector_machines","284639120_Automated_Image_Analysis_Method_for_p-vivax_Malaria_Parasite_Detection_in_Thick_Film_Blood_Images","273169418_Portable_pathology_for_Africa","261354594_Malaria_parasite_identification_on_thick_blood_film_using_genetic_programming","260622503_Optimization_of_Segmentation_Algorithms_Through_Mean-Shift_Filtering_Preprocessing","228715647_LIBSVM_A_library_for_support_vector_machines","221757368_Detection_of_malaria_parasites_in_thick_blood_films","220798212_Detection_and_classification_device_for_malaria_parasites_in_thick-blood_films"]}