{"id":"305677048_A_Review_of_Kinetic_Modeling_Methodologies_for_Complex_Processes","abstract":"In this paper, kinetic modeling techniques for complex chemical processes are reviewed. After a brief historical overview of chemical kinetics, an overview is given of the theoretical background of kinetic modeling of elementary steps and of multistep reactions. Classic lumping techniques are introduced and analyzed. Two examples of lumped kinetic models (atmospheric gasoil hydrotreating and residue hydroprocessing) developed at IFP Energies nouvelles (IFPEN) are presented. The largest part of this review describes advanced kinetic modeling strategies, in which the molecular detail is retained, i.e. the reactions are represented between molecules or even subdivided into elementary steps. To be able to retain this molecular level throughout the kinetic model and the reactor simulations, several hurdles have to be cleared first: (i) the feedstock needs to be described in terms of molecules, (ii) large reaction networks need to be automatically generated, and (iii) a large number of rate equations with their rate parameters need to be derived. For these three obstacles, molecular reconstruction techniques, deterministic or stochastic network generation programs, and single-event micro-kinetics and/or linear free energy relationships have been applied at IFPEN, as illustrated by several examples of kinetic models for industrial refining processes.","authors":["Luís P. de Oliveira","Damien Hudebine","D. Guillaume","Jan J. Verstraete"],"meta":["May 2016Oil & Gas Science and Technology - Revue de l IFP 71(3):45","DOI:10.2516/ogst/2016011","Project: Kinetic Modeling"],"references":["347508696_Composition_and_Analysis_of_Heavy_Petroleum_Fractions","328701953_Molecular_Modeling_in_Heavy_Hydrocarbon_Conversions","314465104_Kinetic_model_based_on_a_molecular_description_for_catalytic_cracking_of_vacuum_gas_oil","311810954_Some_Problems_in_Chemical_Kinetics_and_Reactivity","303836270_Concepts_and_comparisons_in_multidimensional_separation","303754225_Application_of_Monte_Carlo_techniques_to_LCO_gas_oil_hydrotreating_Molecular_reconstruction_and_kinetic_modelling","301729763_Application_of_Monte_Carlo_techniques_to_LCO_gas_oil_hydrotreating_Molecular_reconstruction_and_kinetic_modelling","301065828_A_GENERAL_ANALYSIS_OF_LUMPING_IN_CHEMICAL_KINETICS","292609685_Kinetische_studie_van_de_katalytische_reforming_van_nafta_over_een_Pt-SnAlO_katalysator","289865535_Fundamental_Kinetic_Modeling_of_Complex_Processes"]}