{"id":"305783315_A_Branching-Process-Based_Method_to_Check_Soundness_of_Workflow_Systems","abstract":"Workflow nets (WF-nets) as a class of Petri nets are widely used to model and analyze workflow systems. Soundness is an important property of WF-nets, which guarantees that the systems are deadlock-and livelock-free and each task has a chance to be performed. Van der Aalst has proven that the soundness problem is decidable for WF-nets and we have also shown that it is PSPACE-complete for bounded ones. Since the definition of soundness is based on reachability and Van der Aalst has proven that a sound WF-net must be bounded, the soundness detection can be carried out via the reachability graph analysis. However, the state explosion problem is a big obstacle to this technique. The unfolding technique of Petri nets can effectively avoid/alleviate this problem. This paper proposes an algorithm to generate a finite prefix of the unfolding of a WF-net, called basic unfolding. Furthermore, a necessary and sufficient condition is proposed to decide soundness based on basic unfolding. In addition, some examples illustrate that the unfolding technique can save the storage space effectively.","authors":["Guanjun Liu","W. Reisig","Changjun Jiang","Mengchu Zhou"],"meta":["January 2016IEEE Access 4:1-1","DOI:10.1109/ACCESS.2016.2597061"],"references":["271795038_Recent_and_Simple_Algorithms_for_Petri_Nets","266860206_Understanding_Petri_nets_Modeling_techniques_analysis_methods_case_studies_Translated_from_the_German_by_the_author","262352296_The_theory_of_WSTS_the_case_of_complete_WSTS","313054736_Using_unfoldings_to_avoid_the_state_explosion_problem_in_the_verification_of_asynchronous_circuits","302282301_Symbolic_Model_Checking","285880149_Beyond_asymmetric_choice_A_note_on_some_extensions","285842809_Petri_Nets_Properties_Analysis_and_Applications","263968537_Recent_advances_in_unfolding_technique","263605648_Computer_and_Intractability_A_Guide_to_the_Theory_of_NP-Completeness","262277374_Complexity_of_the_Soundness_Problem_of_Workflow_Nets"]}