{"id":"305749294_Curricular_Influences_on_Female_Afterschool_Facilitators'_Computer_Science_Interests_and_Career_Choices","abstract":"Underrepresented populations such as women, African-Americans, and Latinos/as often come to STEM (science, technology, engineering, and mathematics) careers by less traditional paths than White and Asian males. To better understand how and why women might shift toward STEM, particularly computer science, careers, we investigated the education and career direction of afterschool facilitators, primarily women of color in their twenties and thirties, who taught Build IT, an afterschool computer science curriculum for middle school girls. Many of these women indicated that implementing Build IT had influenced their own interest in technology and computer science and in some cases had resulted in their intent to pursue technology and computer science education. We wanted to explore the role that teaching Build IT may have played in activating or reactivating interest in careers in computer science and to see whether in the years following implementation of Build IT, these women pursued STEM education and/or careers. We reached nine facilitators who implemented the program in 2011–12 or shortly after. Many indicated that while facilitating Build IT, they learned along with the participants, increasing their interest in and confidence with technology and computer science. Seven of the nine participants pursued further STEM or computer science learning or modified their career paths to include more of a STEM or computer science focus. Through interviews, we explored what aspects of Build IT influenced these facilitators’ interest and confidence in STEM and when relevant their pursuit of technology and computer science education and careers.","authors":["Melissa Koch","Torie Gorges"],"meta":["October 2016Journal of Science Education and Technology 25(5)","DOI:10.1007/s10956-016-9636-2"],"references":["309471804_Interest_and_the_Development_of_Pathways_to_Science","281345525_Motivational_Beliefs_Values_and_Goals","321275099_Research_design_qualitative_quantitative_and_mixed_methods_approaches","313390246_Basics_of_qualitative_research_Grounded_theory_procedures_and_techniques","311473376_Unlocking_the_clubhouse_women_in_computing","292488533_Removing_barriers_Women_in_academic_science_technology_engineering_and_mathematics","289814513_Social_Belonging_and_the_Motivation_and_Intellectual_Achievement_of_Negatively_Stereotyped_Students","288285257_Women_without_Class_Girls_Race_and_Identity","286403786_Investigating_STEM_support_and_persistence_among_teenage_African_American_and_Latina_girls_across_settings","283173845_The_Need_for_Computer_Science","280152636_Racial-Ethnic_Identity_Content_and_Consequences_for_African_American_Latino_and_Latina_Youths","272039710_Conceptualizing_the_curriculum_enactment_process_in_mathematics_education","281233726_Examining_the_Gender_Gap_in_IT_by_Race_Young_Adults'_Decisions_to_Pursue_an_IT_Career","276196873_Why_Students_Choose_STEM_Majors_Motivation_High_School_Learning_and_Postsecondary_Context_of_Support","273612994_Two_Brief_Interventions_to_Mitigate_a_Chilly_Climate_Transform_Women's_Experience_Relationships_and_Achievement_in_Engineering"]}