{"id":"305779171_Hiding_Individuals_and_Communities_in_a_Social_Network","abstract":"The Internet and social media have fueled enormous interest in social network analysis. New tools continue to be developed and used to analyse our personal connections, with particular emphasis on detecting communities or identifying key individuals in a social network. This raises privacy concerns that are likely to exacerbate in the future. With this in mind, we ask the question: Can individuals or groups actively manage their connections to evade social network analysis tools? By addressing this question, the general public may better protect their privacy, oppressed activist groups may better conceal their existence, and security agencies may better understand how terrorists escape detection. We first study how an individual can evade \"network centrality\" analysis without compromising his or her influence within the network. We prove that an optimal solution to this problem is hard to compute. Despite this hardness, we demonstrate that even a simple heuristic, whereby attention is restricted to the individual's immediate neighbourhood, can be surprisingly effective in practice. For instance, it could disguise Mohamed Atta's leading position within the WTC terrorist network, and that is by rewiring a strikingly-small number of connections. Next, we study how a community can increase the likelihood of being overlooked by community-detection algorithms. We propose a measure of concealment, expressing how well a community is hidden, and use it to demonstrate the effectiveness of a simple heuristic, whereby members of the community either \"unfriend\" certain other members, or \"befriend\" some non-members, in a coordinated effort to camouflage their community.","authors":["Marcin Waniek","Tomasz Michalak","Talal Rahwan","Michael J. Wooldridge"],"meta":["February 2018Nature Human Behaviour 2(2)","DOI:10.1038/s41562-017-0290-3"],"references":["311344563_Finding_community_structure_in_very_large_networks","304533565_Finding_community_structure_in_very_large_networksJ","304496880_Link_prediction_in_complex_networks_A_survey","304374264_Centrality_in_social_networks_Conceptual_clarification","301879085_New_Online_Ecology_of_Adversarial_Aggregates_ISIS_and_beyond","292261207_Privacy_big_data_and_the_public_good_Frameworks_for_engagement","290211565_Private_algorithms_for_the_protected_in_social_network_search","285023337_Destabilizing_Networks","283617653_Emergence_of_Scaling_in_Random_Networks","283617410_Emergence_of_Scaling_in_Random_Networks","283598027_Learning_to_discover_social_circles_in_ego_networks","279914124_A_Privacy_Preservation_Model_for_Health-Related_Social_Networking_Sites","279896083_A_Privacy_Preservation_Model_for_Health-Related_Social_Networking_Sites","278131139_Covert_social_movement_networks_and_the_secrecy-efficiency_trade_off_The_case_of_the_UK_suffragettes_1906-1914","275701095_Connecting_the_Dots"]}