{"id":"305775858_Theory_and_Applications_of_Computability","abstract":"Turing's famous 1936 paper introduced a formal definition of a computing machine, a Turing machine. This model led to both the development of actual computers and to computability theory, the study of what machines can and cannot compute. This book presents classical computability theory from Turing and Post to current results and methods, and their use in studying the information content of algebraic structures, models, and their relation to Peano arithmetic. The author presents the subject as an art to be practiced, and an art in the aesthetic sense of inherent beauty which all mathematicians recognize in their subject. \nPart I gives a thorough development of the foundations of computability, from the definition of Turing machines up to finite injury priority arguments. Key topics include relative computability, and computably enumerable sets, those which can be effectively listed but not necessarily effectively decided, such as the theorems of Peano arithmetic. Part II includes the study of computably open and closed sets of reals and basis and nonbasis theorems for effectively closed sets. Part III covers minimal Turing degrees. Part IV is an introduction to games and their use in proving theorems. Finally, Part V offers a short history of computability theory.\nThe author is a leading authority on the topic and he has taught the subject using the book content over decades, honing it according to experience and feedback from students, lecturers, and researchers around the world. Most chapters include exercises, and the material is carefully structured according to importance and difficulty. The book is suitable for advanced undergraduate and graduate students in computer science and mathematics and researchers engaged with computability and mathematical logic.","authors":["Robert I. Soare"],"meta":["January 2016","DOI:10.1007/978-3-642-31933-4","ISBN: 978-3-642-31932-7"],"references":["286589383_Computability_and_l-Definability","256510600_Reflections_on_Kurt_Godel_Hao_Wang_Cambridge_Mass_MIT_Press_1987_xxvi_336_pp_1295_2695_paper"]}