{"id":"305773717_AMELIORATION_DES_COMPETENCES_ARGUMENTATIVES_A_L'AIDE_D'UN_SYSTEME_TUTORIEL_EN_CLASSE_DE_MATHEMATIQUE_AU_SECONDAIRE","abstract":"Tutoring System for Improvement of Argumentative Competencies in High School Mathematics This article tries to show how secondary school pupils can improve their argument skills with the help of tutorial systems intended for learning geometry. After having established the conceptual framework at the intersection of mathematics teaching and computer environments for human learning, the article compares the heuristic and discursive features of some tutorial systems, including the systems developed by our research team. It then deals with the issue of the complementary nature of knowledge and skills in order to aim at a strategy for assessing argument skills based on relationships in the subject-environment system. The text particularly includes cognitive control, semiotic and situational structures associated with the development of argument skills in such environments. It also tackles the specific nature of reference knowledge, the decontextualization of learning, the instrumentation of resources, the idea of mathematical proof and the role of teaching agents. Résumé. Cet article vise à montrer comment l'élève de l'école secondaire peut améliorer ses compétences argumentatives à l'aide de systèmes tutoriels destinés à l'apprentissage de la géométrie. Après avoir situé le cadre conceptuel à l'intersection de la didactique des mathématiques et des environnements informatiques d'apprentissage humain, l'article compare les caractéristiques heuristiques et discursives de quelques systèmes tutoriels, dont les systèmes développés par notre équipe de recherche. Il traite ensuite la question de complémentarité entre connaissances et compétences pour se diriger vers une stratégie d'évaluation des compétences argumentatives sur la base des rapports du système sujet-milieu. Le texte intègre, en particulier, les structures de contrôle cognitif, sémiotique et situationnel associées au développement d'une compétence argumentative dans de tels environnements. Il aborde aussi la spécificité des connaissances de référence, la décontextualisation des apprentissages, l'instrumentation des ressources, l'idée de démonstration mathématique ainsi que le rôle d'agents didactiques.","authors":["Philippe R. Richard","Josep M. Fortuny"],"meta":["January 2007","Project: cK¢, a model to reason on learners' conceptions"],"references":["274699295_cK_Modele_de_connaissances_pour_le_calcul_de_situations_didactiques","239606265_STRATEGIE_ARGUMENTATIVE_ET_SYSTEME_TUTORIEL_POUR_L'APPRENTISSAGE_INTERACTIF_DE_LA_GEOMETRIE","226856258_Social_Interactions_and_Cognitive_Effects_in_Contexts_of_Area-Comparison_Problem_Solving","226369139_Some_didactical_and_Epistemological_Considerations_in_the_Design_of_Educational_Software_The_Cabri-euclide_Example","225996916_AgentGeom_A_multiagent_system_for_pedagogical_support_in_geometric_proof_problems","301103369_A_Cognitive_Analysis_of_Geometry_Proof_Focused_on_Intelligent_Tutoring_Systems","255656687_An_Open_Architecture_to_Improve_Mathematical_Competence_in_High_School","243676758_Reifying_implicit_planning_in_geometry_Guidelines_for_model-based_intelligent_tutoring_system_design","240431489_Mathematical_competencies_and_the_learning_of_mathematics_the_danish_KOM_project","226362055_Integration_of_Technology_in_the_Design_of_Geometry_Tasks_with_Cabri-Geometry"]}