{"id":"305779642_A_Comparative_Analysis_of_Community_Detection_Algorithms_on_Artificial_Networks","abstract":"Many community detection algorithms have been developed to uncover the mesoscopic properties of complex networks. However how good an algorithm is, in terms of accuracy and computing time, remains still open. Testing algorithms on real-world network has certain restrictions which made their insights potentially biased: the networks are usually small, and the underlying communities are not defined objectively. In this study, we employ the Lancichinetti-Fortunato-Radicchi benchmark graph to test eight state-of-the-art algorithms. We quantify the accuracy using complementary measures and algorithms' computing time. Based on simple network properties and the aforementioned results, we provide guidelines that help to choose the most adequate community detection algorithm for a given network. Moreover, these rules allow uncovering limitations in the use of specific algorithms given macroscopic network properties. Our contribution is threefold: firstly, we provide actual techniques to determine which is the most suited algorithm in most circumstances based on observable properties of the network under consideration. Secondly, we use the mixing parameter as an easily measurable indicator of finding the ranges of reliability of the different algorithms. Finally, we study the dependency with network size focusing on both the algorithm's predicting power and the effective computing time.","authors":["Zhao Yang","René Algesheimer","Claudio J. Tessone"],"meta":["August 2016Scientific Reports 6(1)","DOI:10.1038/srep30750"],"references":["344125515_Defining_and_evaluating_network_communities_based_on_ground-truth","319333726_Algorithms_for_graph_partitioning_on_the_planted_partition_model","311344563_Finding_community_structure_in_very_large_networks","304533565_Finding_community_structure_in_very_large_networksJ","304374264_Centrality_in_social_networks_Conceptual_clarification","299486075_Dynamics_On_and_Of_Complex_Networks_Volume_2","288913482_Community_Structure_Identification","288386766_Standardized_mutual_information_for_clustering_comparisons_One_step_further_in_adjustment_for_chance","283738615_Resolution_limit_in_community_detection","283617410_Emergence_of_Scaling_in_Random_Networks","280104768_Structure_and_inference_in_annotated_networks","271080443_A_revisit_to_evaluating_accuracy_of_community_detection_using_the_normalized_mutual_information","262841116_Community_detection_in_networks_Structural_communities_versus_ground_truth","265780611_Dynamics_on_and_of_complex_networks_Volume_2_Applications_to_time-varying_dynamical_systems","262319902_A_Critical_Point_for_Random_Graphs_with_a_Given_Degree_Sequence"]}