{"id":"305824563_DeepFruits_A_Fruit_Detection_System_Using_Deep_Neural_Networks","abstract":"This paper presents a novel approach to fruit detection using deep convolutional neural networks. The aim is to build an accurate, fast and reliable fruit detection system, which is a vital element of an autonomous agricultural robotic platform; it is a key element for fruit yield estimation and automated harvesting. Recent work in deep neural networks has led to the development of a state-of-the-art object detector termed Faster Region-based CNN (Faster R-CNN). We adapt this model, through transfer learning, for the task of fruit detection using imagery obtained from two modalities: colour (RGB) and Near-Infrared (NIR). Early and late fusion methods are explored for combining the multi-modal (RGB and NIR) information. This leads to a novel multi-modal Faster R-CNN model, which achieves state-of-the-art results compared to prior work with the F1 score, which takes into account both precision and recall performances improving from 0.807 to 0.838 for the detection of sweet pepper. In addition to improved accuracy, this approach is also much quicker to deploy for new fruits, as it requires bounding box annotation rather than pixel-level annotation (annotating bounding boxes is approximately an order of magnitude quicker to perform). The model is retrained to perform the detection of seven fruits, with the entire process taking four hours to annotate and train the new model per fruit.","authors":["Inkyu Sa","Zongyuan Ge","Feras Dayoub","Ben Upcroft"],"meta":["August 2016Sensors 16(8):1222","DOI:10.3390/s16081222","Project: Autonomous Sweet Pepper Harvester"],"references":["319770233_Deep_Learning_for_Detecting_Robotic_Grasps","305196650_Going_deeper_with_convolutions","319770820_Histograms_of_Oriented_Gradients_for_Human_Detection","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","319769911_Faster_R-CNN_Towards_Real-Time_Object_Detection_with_Region_Proposal_Networks","310752533_Visualizing_and_understanding_convolutional_networks","308862251_Multimodal_deep_learning_for_robust_RGB-D_object_recognition","303371730_Visual_Detection_of_Occluded_Crop_for_automated_harvesting","269375158_The_Pascal_Visual_Object_Classes_Challenge_A_Retrospective","265385906_Very_Deep_Convolutional_Networks_for_Large-Scale_Image_Recognition"]}