{"id":"305881429_Toward_an_Integration_of_Deep_Learning_and_Neuroscience","abstract":"Neuroscience has focused on the detailed implementation of computation, studying neural codes, dynamics and circuits. In machine learning, however, artificial neural networks tend to eschew precisely designed codes, dynamics or circuits in favor of brute force optimization of a cost function, often using simple and relatively uniform initial architectures. Two recent developments have emerged within machine learning that create an opportunity to connect these seemingly divergent perspectives. First, structured architectures are used, including dedicated systems for attention, recursion and various forms of short- and long-term memory storage. Second, cost functions and training procedures have become more complex and are varied across layers and over time. Here we think about the brain in terms of these ideas. We hypothesize that (1) the brain optimizes cost functions, (2) these cost functions are diverse and differ across brain locations and over development, and (3) optimization operates within a pre-structured architecture matched to the computational problems posed by behavior. Such a heterogeneously optimized system, enabled by a series of interacting cost functions, serves to make learning data-efficient and precisely targeted to the needs of the organism. We suggest directions by which neuroscience could seek to refine and test these hypotheses.","authors":["Adam H Marblestone","Greg Wayne","Konrad P. Kording"],"meta":["June 2016Frontiers in Computational Neuroscience 10(5)","DOI:10.3389/fncom.2016.00094"],"references":["332087361_The_Algebraic_Mind_Integrating_Connectionism_and_Cognitive_Science","330332337_Perceptrons_An_Introduction_to_Computational_Geometry","322808208_Temporal_Difference_Learning_and_TD-Gammon","319770429_Unsupervised_Learning_of_Visual_Structure_using_Predictive_Generative_Networks","319770319_Could_a_Neuroscientist_Understand_a_Microprocessor","319770257_Exact_solutions_to_the_nonlinear_dynamics_of_learning_in_deep_linear_neural_networks","319770248_Neural_Programmer_Inducing_Latent_Programs_with_Gradient_Descent","319770191_FitNets_Hints_for_Thin_Deep_Nets","319770124_Deep_Predictive_Coding_Networks_for_Video_Prediction_and_Unsupervised_Learning","319636385_Complex_Probabilistic_Inference_From_Cognition_to_Neural_Computation"]}