{"id":"305857650_Almost_all_trees_are_almost_graceful","abstract":"The Graceful Tree Conjecture of Rosa from 1967 asserts that the vertices of each tree T of order n can be injectively labelled by using the numbers {1,2,...,n} in such a way that the absolute differences induced on the edges are pairwise distinct. We prove the following relaxation of the conjecture for each c>0 and for all n>n_0(c). Suppose that (i) the maximum degree of T is bounded by O(n/log n), and (ii) the vertex labels are chosen from the set {1,2,..., (1+c)n}. Then there is an injective labelling of V(T) such that the absolute differences on the edges are pairwise distinct. In particular, asymptotically almost all trees on n vertices admit such a labelling. As a consequence, for any such tree T we can pack (2+2c)n-1 copies of T into the complete graph of order (2+2c)n-1 cyclically. This proves an approximate version of the Ringel-Kotzig conjecture (which asserts the existence of a cyclic packing of 2n-1 copies of any T into the complete graph of order 2n-1) for these trees. The proof proceeds by showing that a certain very natural randomized algorithm produces a desired labelling with high probability.","authors":["Anna Adamaszek","Peter Allen","Codrut Grosu","Jan Hladky"],"meta":["July 2020Random Structures and Algorithms 56(4)","DOI:10.1002/rsa.20906"],"references":["336185238_Packing_degenerate_graphs","323694588_Embedding_rainbow_trees_with_applications_to_graph_labelling_and_decomposition","305638557_Packing_trees_of_unbounded_degrees_in_random_graphs","288890271_Packing_spanning_graphs_from_separable_families","319321979_Wiley-Interscience_Series_in_Discrete_Mathematics_and_Optimization","305880868_Optimal_packings_of_bounded_degree_trees","301878306_Packing_minor-closed_families_of_graphs_into_complete_graphs","301648373_A_blow-up_lemma_for_approximate_decompositions","286503424_An_approximate_version_of_the_tree_packing_conjecture_via_random_embeddings","284744537_How_to_number_a_graph_in_Graph_Theory_and_Computing"]}