{"id":"305800450_Structural_Analysis_and_Design_of_Dynamic-Flow_Networks_Implications_in_the_Brain_Dynamics","abstract":"In this paper, we study dynamic-flow networks, i.e., networks described by a graph whose weights evolve according to linear differential equations. Further, these linear differential equations depend on the incidence relation of the edges in a node, and possibly nodal dynamics. Because some of these weights and their dependencies may not be accurately known, we extend the notion of structural controllability for dynamic-flow networks, and provide necessary and sufficient conditions for this to hold. Next, we show that the analysis of structural controllability in dynamic-flow networks can be reduced to that of a digraph which we refer to as meta digraph. In addition, we consider different actuation capabilities, i.e., we assume that both the nodes and edges in the dynamic-flow network can be actuated, and we explore the implications in terms of computational complexity when the minimum cost-placement of actuators is considered. The proposed framework can be used to identify actua-tion capabilities required to mitigate epileptic-brain dynamics. More precisely, the functional connectivity of mesoscale brain dynamics can be modeled as a dynamic-flow network by considering dynamic functional connectivity of the network. In the context of epilepsy, the modeling is motivated by new findings that show that the edges within seizure-generating areas are almost constant over time, whereas the edges outside these areas exhibit higher variability over time in human epileptic networks. In addition, implementable devices to control drug-resistant seizures by affecting the epileptic network has gained considerable attention as a viable treatment option. Subsequently, from a control-theoretic perspective, one can consider actuation to attenuate edge variability responsible for seizure-generation in the epileptic network. In particular, we address the following two scenarios: (i) current placement of electrical stimulators, and their probable capabilities; and (ii) determine the minimum cost placement with minimum actuation capabilities. The latter problem is motivated by the fact that some edges may correspond to more accessible (or less harmful) regions in the brain, whereas others might correspond to sensitive regions in the brain.","authors":["Sergio Pequito","Ankit Khambhati","George J. Pappas","Dragoslav D ˇ Siljak"],"meta":["July 2016","DOI:10.1109/ACC.2016.7526572","Conference: American Control Conference"],"references":["281395155_Minimum_Number_of_Probes_for_Brain_Dynamics_Observability","273472421_Minimum_Cost_Constrained_Input-Output_and_Control_Configuration_Co-Design_Problem_A_Structural_Systems_Approach","271463428_A_model_checking_framework_for_linear_time_invariant_switching_systems_using_structural_systems_analysis","263930224_Minimum_Cost_InputOutput_Selection_for_Large_Scale_Linear_Time-Invariant_Systems_A_Structured_Systems_Approach","256926210_A_Framework_for_Structural_InputOutput_and_Control_Configuration_Selection_in_Large-Scale_Systems","232697257_A_Structured_Systems_Approach_for_Optimal_Actuator-Sensor_Placement_inLinear_Time-Invariant_Systems","51968342_Controlling_edge_dynamics_in_complex_networks","301412186_Minimum_number_of_information_gatherers_to_ensure_full_observability_of_a_dynamic_social_network_A_structural_systems_approach","284122742_On_the_complexity_of_the_constrained_input_selection_problem_for_structural_linear_systems","284103465_Sparsest_Minimum_Multiple-Cost_Structural_Leader_Selection","280538101_Structural_Minimum_Controllability_Problem_for_Linear_Continuous-Time_Switching_Systems","270756127_On_the_Existence_of_Optimal_Controls","261207867_A_multimodal_platform_for_cloud-based_collaborative_research","261094206_Optimal_cost_actuatorsensor_placement_for_large_scale_linear_time-invariant_systems_A_structured_systems_approach","258496235_Control_of_Dynamic_Graphs","247442902_Introduction_To_Algorithms","236938733_Dynamic_functional_connectivity_Promise_issues_and_interpretations","228057735_Computers_And_Intractability_A_Guide_to_the_Theory_of_NP-Completeness","226373342_The_interchange_graph_of_a_finite_graph","222837874_Generic_properties_and_control_of_linear_structured_systems_A_survey","222712643_Complex_networks_Structure_and_dynamics","221933085_Introduction_To_Graph_Theory","51911557_Structural_Controllability_of_Switched_Linear_Systems"]}