{"id":"305801381_A_Novel_Approach_to_Achieve_the_Perfect_Security_through_AVK_over_Insecure_Communication_Channel","abstract":"To enhance the security level of the cryptosystem in shared encrypted data over the insecure channel; Automatic variable key (AVK) is a perfect mechanism as being experimented by many researchers. In AVK, after establishment of the secret key (through some IKE protocols, like IKEv2 or 2 PAKA or 3 PAKA, etc), the successive keys are generated that are variable in nature from session to session by using time variant key technique. In this work, it is shown that how AVK can provide higher security than fixed key from well-known plaintext attack (for example, brute force attack) and ciphertext only attack (for example, frequency attack etc) due to randomness of keys. In order to improve the level of randomness among the key set, a new method is proposed to generate keys where the randomness are achieved not only in terms of change in bits sequence but also flexible in size as well. Randomness of the key set is also compared with other related time variant key mechanisms to prove superiority.","authors":["Subhasish Banerjee","Manash Pratim Dutta","Chandan Bhunia"],"meta":["August 2016Journal of The Institution of Engineers (India) Series B 98(2)","DOI:10.1007/s40031-016-0264-2"],"references":["301720790_Generation_of_Automatic_Variable_Key_to_Make_Secure_Communication","289522580_Generation_of_Variable_Session_Keys_Based_on_Piggybacking_Strategy","283571440_Absolute_key_variation_technique_of_automatic_variable_key_in_cryptography","272010140_New_Techniques_for_Generating_of_Automatic_Variable_Key_in_Achieving_Perfect_Security","263578074_Generation_of_Automatic_Variable_Key_under_Various_Approaches_in_Cryptography_System","261851889_New_Approach_towards_Generation_of_Automatic_Variable_Key_to_Achieve_Perfect_Security","242101903_A_novel_approach_towards_realizing_optimum_data_transfer_and_Automatic_Variable_KeyAVK_in_cryptography","200034020_Communication_Theory_of_Secrecy_Systems","13988269_The_Mathematical_Theory_of_Communication"]}