{"id":"305909634_Ontology-Based_Deep_Restricted_Boltzmann_Machine","abstract":"Deep neural networks are known for their capabilities for automatic feature learning from data. For this reason, previous research has tended to interpret deep learning techniques as data-driven methods, while few advances have been made from knowledge-driven perspectives. We propose to design a semantic rich deep learning model from a knowledge driven perspective, by introducing formal semantics into deep learning process. We propose ontology-based deep restricted Boltzmann machine (OB-DRBM), in which we use ontology to guide architecture design of deep restricted Boltzmann machines (DRBM), as well as to assist in their training and validation processes. Our model learns a set of related semantic-rich data representations from both formal semantics and data distribution. Representations in this set correspond to concepts at various semantic levels in a domain ontology. We show that our model leads to an improved performance, when compared with conventional deep learning models in classification tasks.","authors":["Hao Wang","Dejing Dou","Daniel Lowd"],"meta":["September 2016","DOI:10.1007/978-3-319-44403-1_27","Conference: International Conference on Database and Expert Systems Applications"],"references":["307560165_Deep_neural_networks_are_easily_fooled_High_confidence_predictions_for_unrecognizable_images","326338097_Pellet_A_Practical_OWL-DL_Reasoner","319770439_Efficient_Estimation_of_Word_Representations_in_Vector_Space","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","319394978_Artificial_Intelligence_---_A_Modern_Approach","310752533_Visualizing_and_understanding_convolutional_networks","291295837_Reasoning_with_neural_tensor_networks_for_knowledge_base_completion","290109791_NewsWeeder_Learning_to_Filter_Netnews","287089358_Exploiting_ontology_structures_and_unlabeled_data_for_learning","286794765_Dropout_A_Simple_Way_to_Prevent_Neural_Networks_from_Overfitting"]}