{"id":"305922852_From_clinical_sample_to_complete_genome_Comparing_methods_for_the_extraction_of_HIV-1_RNA_for_high-throughput_deep_sequencing","abstract":"The BEEHIVE (Bridging the Evolution and Epidemiology of HIV in Europe) project aims to analyse nearly-complete viral genomes from >3000 HIV-1 infected Europeans using high-throughput deep sequencing techniques to investigate the virus genetic contribution to virulence. Following the development of a computational pipeline, including a new de novo assembler for RNA virus genomes, to generate larger contiguous sequences (contigs) from the abundance of short sequence reads that characterise the data, another area that determines genome sequencing success is the quality and quantity of the input RNA. A pilot experiment with 125 patient plasma samples was performed to investigate the optimal method for isolation of HIV-1 viral RNA for long amplicon genome sequencing. Manual isolation with the QIAamp Viral RNA Mini Kit (Qiagen) was superior over robotically extracted RNA using either the QIAcube robotic system, the mSample Preparation Systems RNA kit with automated extraction by the m2000sp system (Abbott Molecular), or the MagNA Pure 96 System in combination with the MagNA Pure 96 Instrument (Roche Diagnostics). We scored amplification of a set of four HIV-1 amplicons of ∼1.9, 3.6, 3.0 and 3.5kb, and subsequent recovery of near-complete viral genomes. Subsequently, 616 BEEHIVE patient samples were analysed to determine factors that influence successful amplification of the genome in four overlapping amplicons using the QIAamp Viral RNA Kit for viral RNA isolation. Both low plasma viral load and high sample age (stored before 1999) negatively influenced the amplification of viral amplicons >3kb. A plasma viral load of >100,000 copies/ml resulted in successful amplification of all four amplicons for 86% of the samples, this value dropped to only 46% for samples with viral loads of <20,000 copies/ml.","authors":["Marion Cornelissen","Astrid Gall","Monique Vink","Fokla Zorgdrager"],"meta":["August 2016Virus Research 239","DOI:10.1016/j.virusres.2016.08.004"],"references":["284711003_Utility_of_Metagenomic_Next-Generation_Sequencing_for_Characterization_of_HIV_and_Human_Pegivirus_Diversity","284131430_Quasispecies_Analyses_of_the_HIV-1_Near-full-length_Genome_With_Illumina_MiSeq","283492714_Dispersion_of_the_HIV-1_Epidemic_in_Men_Who_Have_Sex_with_Men_in_the_Netherlands_A_Combined_Mathematical_Model_and_Phylogenetic_Analysis","279533039_Disease_progression_despite_protective_HLA_expression_in_an_HIV-infected_transmission_pair","272944965_IVA_Accurate_de_novo_assembly_of_RNA_virus_genomes","264793109_COMET_Adaptive_context-based_modeling_for_ultrafast_HIV-1_subtype_identification","263506059_Full-length_haplotype_reconstruction_to_infer_the_structure_of_heterogeneous_virus_populations","260120580_Complete_Genome_Sequence_of_the_WHO_International_Standard_for_HIV-1_RNA_Determined_by_Deep_Sequencing","311605210_Complete_genome_sequence_of_the_WHO_International_Standard_for_HIV-1_RNA_determined_by_deep_sequencing","288002326_A_Pan-HIV_Strategy_for_Complete_Genome_Sequencing"]}