{"id":"305993734_A_general_framework_for_defining_and_extending_actual_causation_using_CP-logic","abstract":"A central problem in the field of causal modelling is to provide a suitable definition of actual causation, i.e., to define when one specific event caused another. Although current research contains many different definitions, it is pervaded with ambiguities and confusion. Our research has two main goals. First, we wish to provide a clear way to compare competing definitions, and improve upon them so that they can be applied to a more diverse range of instances, including non-deterministic ones. To achieve this we provide a general, abstract definition of actual causation, formulated in the context of the expressive language of CP-logic (Causal Probabilistic logic). We will then show that three recent definitions by Ned Hall (originally formulated for structural models) and a definition of our own (formulated for CP-logic directly) can be viewed and directly compared as instantiations of this abstract definition, which also allows them to deal with a broader range of examples. Second, our framework allows for improving on definitions of actual causation in another way, by incorporating the influence of normality. A recent paper by Halpern and Hitchcock draws on empirical research regarding people's causal judgements, to suggest a graded and context-sensitive notion of actual causation. We rephrase their approach into the probabilistic setting of our abstract definition, allowing us to improve it.","authors":["Sander Beckers","Joost Vennekens"],"meta":["October 2016International Journal of Approximate Reasoning 77(1):105-126","DOI:10.1016/j.ijar.2016.05.008"],"references":["303840151_A_Proposed_Probabilistic_Extension_of_the_Halpern_and_Pearl_Definition_of_'Actual_Cause'","283023738_Towards_a_General_Framework_for_Actual_Causation_Using_CP-logic","273157870_Combining_Probabilistic_Causal_and_Normative_Reasoning_in_CP-logic","313637433_Two_Concepts_of_Causation","298819582_Causation_and_responsibility","279974434_Causation","275836205_A_Modification_of_the_Halpern-Pearl_Definition_of_Causality","275697437_Causality_Models_Reasoning_and_Inference","265149091_Causation_and_Preemption","263920526_Norm_Theory_Comparing_Reality_to_Its_Alternatives"]}