{"id":"305998667_Dimensionnement_d'une_maquette_pour_l'investigation_du_morphing_electroactif_hybride_en_soufflerie_subsonique","abstract":"Le recours à la déformation de structures pour le contrôle actif d'écoulements, appelé morphing, est un axe de recherche actuel. L'approche originale du LAPLACE et de l'IMFT est orientée vers une utilisation couplée de différents matériaux électroactifs intégrés dans des actionneurs qui interagissent à différentes échelles spatiotemporelles du comportement aérodynamique de l'air autour d'un profil d'aile. Dans ce cadre, une étude porte sur un démonstrateur à échelle réduite d'une aile qui sera testé en soufflerie. Cette maquette est le précurseur d'un démonstrateur à plus grande échelle visant une application sur un avion commercial. Ce papier présente le dimensionnement du démonstrateur à échelle réduite. Le système de contrôle en cambrure activé par alliages à mémoire de forme puis le bord de fuite vibrant actionné par des matériaux piézoélectriques sont modélisés de manières analytique et numérique. Abstract: The use of deformable structures for active flow control, called morphing, is a current axis of research. The original approach of the LAPLACE and the IMFT laboratories is directed to a combined use of different electroactive materials. These materials are integrated in the actuators which interact at different spatial and temporal scales of the airflow behavior. Regarding this context, the study focuses on a small scale demonstrator of a wing made for wind tunnel experiments. This model is a precursor to a larger scale one that will be designed for commercial aircraft application. This paper presents the design of the small-scale demonstrator. The camber control system activated by shape memory alloys and the vibrating trailing edge actuated by piezoelectric materials are modeled both in analytical and numerical ways.","authors":["Gurvan Jodin","Johannes Scheller","K J Rizzo","Eric Duhayon"],"meta":["August 2015","Conference: 22ème congrès français de Mécanique [CFM2015]At: Lyon, France","Project: Electroactive hybrid morphing, application to Airbus A320 wings."],"references":["259484807_Piezoelectric_Multilayer_Beam_Bending_Actuators_Static_and_Dynamic_Behavior_and_Aspects_of_Sensor_Integration_ISBN_978-3-540-32641-0","228411238_A_Review_of_Morphing_Aircraft","286003426_Shape-memory_Alloys_Handbook","282307709_A_hybrid_morphing_NACA4412_airfoil_concept","270754638_Shape_Memory_Alloy_Based_Morphing_Aerostructures","261055157_Thermo-mechanical_coupling_in_Nitinol_Application_to_an_electro-morphing_plate","259127876_Variable_stiffness_material_and_structural_concepts_for_morphing_applications","245022535_Piezoelectric_Energy_Harvesting_from_Macro-Fiber_Composites_with_an_Application_to_Morphing-Wing_Aircrafts","231057194_Macro-Fiber_Composite_actuated_simply_supported_thin_airfoils"]}