{"id":"305908493_Categories_How_I_Learned_to_Stop_Worrying_and_Love_Two_Sorts","abstract":"RS-frames were introduced by Gehrke as relational semantics for substructural logics. They are two-sorted structures, based on RS-polarities with additional relations used to interpret modalities. We propose an intuitive, epistemic interpretation of RS-frames for modal logic, in terms of categorization systems and agents’ subjective interpretations of these systems. Categorization systems are a key to any decision-making process and are widely studied in the social and management sciences.\nA set of objects together with a set of properties and an incidence relation connecting objects with their properties forms a polarity which can be ‘pruned’ into an RS-polarity. Potential categories emerge as the Galois-stable sets of this polarity, just like the concepts of Formal Concept Analysis. An agent’s beliefs about objects and their properties (which might be partial) is modelled by a relation which gives rise to a normal modal operator expressing the agent’s beliefs about category membership. Fixed-points of the iterations of the belief modalities of all agents are used to model categories constructed through social interaction.","authors":["Willem Conradie","Sabine Frittella","Alessandra Palmigiano","Michele Piazzai"],"meta":["August 2016","DOI:10.1007/978-3-662-52921-8_10","Conference: Wollic 2016","Projects: The logics of categories, concepts, theories, and informational entropyunified correspondence"],"references":["309360141_The_producer-consumer_classification_gap_and_its_effects_on_music_festival_success","308572450_Order-dual_relational_semantics_for_non-distributive_propositional_logics","305988713_Unified_Correspondence_as_a_Proof-Theoretic_Tool","301837337_Constructive_Canonicity_of_Inductive_Inequalities","301837325_Sahlqvist_via_Translation","332384587_Algorithmic_correspondence_and_canonicity_for_non-distributive_logics","319395635_The_Description_Logic_Handbook_Theory_Implementation_and_Applications","318237628_Constructive_Canonicity_for_Lattice-Based_Fixed_Point_Logics","303841196_The_Logic_of_Public_Announcements_Common_Knowledge_and_Private_Suspicions","301846946_Sahlqvist_theory_for_impossible_worlds"]}