{"id":"306022451_Detection_of_Cardiovascular_Disease_Risk's_Level_for_Adults_Using_Naive_Bayes_Classifier","abstract":"Objectives: \nThe number of deaths caused by cardiovascular disease and stroke is predicted to reach 23.3 million in 2030. As a contribution to support prevention of this phenomenon, this paper proposes a mining model using a naïve Bayes classifier that could detect cardiovascular disease and identify its risk level for adults.\n\nMethods: \nThe process of designing the method began by identifying the knowledge related to the cardiovascular disease profile and the level of cardiovascular disease risk factors for adults based on the medical record, and designing a mining technique model using a naïve Bayes classifier. Evaluation of this research employed two methods: accuracy, sensitivity, and specificity calculation as well as an evaluation session with cardiologists and internists. The characteristics of cardiovascular disease are identified by its primary risk factors. Those factors are diabetes mellitus, the level of lipids in the blood, coronary artery function, and kidney function. Class labels were assigned according to the values of these factors: risk level 1, risk level 2 and risk level 3.\n\nResults: \nThe evaluation of the classifier performance (accuracy, sensitivity, and specificity) in this research showed that the proposed model predicted the class label of tuples correctly (above 80%). More than eighty percent of respondents (including cardiologists and internists) who participated in the evaluation session agree till strongly agreed that this research followed medical procedures and that the result can support medical analysis related to cardiovascular disease.\n\nConclusions: \nThe research showed that the proposed model achieves good performance for risk level detection of cardiovascular disease.","authors":["Eka Miranda","Edy Irwansyah","Alowisius Y. Amelga","Marco M. Maribondang"],"meta":["July 2016Healthcare Informatics Research 22(3):196","DOI:10.4258/hir.2016.22.3.196"],"references":["349548570_Heart_Disease_Prediction_using_Data_Mining_Techniques","314838379_Survey_on_Classification_Techniques_Used_in_Data_Mining_and_their_Recent_Advancements","295105747_Intelligence_System_for_Diagnosis_Level_of_Coronary_Heart_Disease_with_K-Star_Algorithm","285368726_Decision_Support_in_Heart_Disease_Prediction_System_using_Naive_Bayes","279966099_Cardiovascular_Health_Score_and_the_Risk_of_Cardiovascular_Diseases","264435148_Knowledge_Discovery_and_interactive_Data_Mining_in_Bioinformatics_-_State-of-the-Art_future_challenges_and_research_directions","312128865_A_novel_hybrid_framework_for_the_prediction_of_heart_disease","279150598_2014_AHAACC_Guideline_for_the_Management_of_Patients_With_Valvular_Heart_Disease_Executive_Summary_A_Report_of_the_American_College_of_CardiologyAmerican_Heart_Association_Task_Force_on_Practice_Guide","267800530_An_Effective_Retrieval_of_Medical_Records_using_Data_Mining_Techniques","265433058_Diagnosis_Of_Heart_Disease_Using_Datamining_Algorithm"]}