{"id":"306051907_Critical_analysis_of_Big_Data_challenges_and_analytical_methods","abstract":"Big Data (BD), with their potential to ascertain valued insights for enhanced decision-making process, have recently attracted substantial interest from both academics and practitioners. Big Data Analytics (BDA) is increasingly becoming a trending practice that many organizations are adopting with the purpose of constructing valuable information from BD. The analytics process, including the deployment and use of BDA tools, is seen by organizations as a tool to improve operational efficiency though it has strategic potential, drive new revenue streams and gain competitive advantages over business rivals. However, there are different types of analytic applications to consider. Therefore, prior to hasty use and buying costly BD tools, there is a need for organizations to first understand the BDA landscape. Given the significant nature of the BD and BDA, this paper presents a state-of-the-art review that presents a holistic view of the BD challenges and BDA methods theorized/proposed/employed by organizations to help others understand this landscape with the objective of making robust investment decisions. In doing so, systematically analysing and synthesizing the extant research published on BD and BDA area. More specifically, the authors seek to answer the following two principal questions: Q1 – What are the different types of BD challenges theorized/proposed/confronted by organizations? and Q2 – What are the different types of BDA methods theorized/proposed/employed to overcome BD challenges?. This systematic literature review (SLR) is carried out through observing and understanding the past trends and extant patterns/themes in the BDA research area, evaluating contributions, summarizing knowledge, thereby identifying limitations, implications and potential further research avenues to support the academic community in exploring research themes/patterns. Thus, to trace the implementation of BD strategies, a profiling method is employed to analyze articles (published in English-speaking peer-reviewed journals between 1996 and 2015) extracted from the Scopus database. The analysis presented in this paper has identified relevant BD research studies that have contributed both conceptually and empirically to the expansion and accrual of intellectual wealth to the BDA in technology and organizational resource management discipline.","authors":["Uthayasankar Sivarajah","Muhammad Mustafa Kamal","Zahir Irani","Vishanth Weerakkody"],"meta":["August 2016Journal of Business Research 70","DOI:10.1016/j.jbusres.2016.08.001"],"references":["303830113_Big_Data_and_supply_chain_management_a_review_and_bibliometric_analysis","302924724_Guidelines_for_performing_Systematic_Literature_Reviews_in_Software_Engineering","290754291_An_integration_adaptation_for_real-time_datawarehousing","289360732_Big_data_analytics_The_case_of_the_social_security_administration","306157862_Big_data_challenges","306157834_Big_data_privacy_issues_in_public_social_media","306157710_A_comparative_study_of_data_analysis_techniques","306157608_Data_Analytics_Hyped_Up_Aspirations_or_True_Potential","303216930_Big_Data_Reduction_Framework_for_Value_Creation_in_Sustainable_Enterprises","299443927_Big_data_analytics_in_logistics_and_supply_chain_management_Certain_Investigations_for_research_and_applications"]}