{"id":"306043224_Protective_Effects_of_Arginine_on_Saccharomyces_cerevisiae_Against_Ethanol_Stress","abstract":"Yeast cells are challenged by various environmental stresses in the process of industrial fermentation. As the currently main organism for bio-ethanol production, Saccharomyces cerevisiae suffers from ethanol stress. Some amino acids have been reported to be related to yeast tolerance to stresses. Here the relationship between arginine and yeast response to ethanol stress was investigated. Marked inhibitions of ethanol on cell growth, expression of genes involved in arginine biosynthesis and intracellular accumulation of arginine were observed. Furthermore, extracellular addition of arginine can abate the ethanol damage largely. To further confirm the protective effects of arginine on yeast cells, yeast strains with different levels of arginine content were constructed by overexpression of ARG4 involved in arginine biosynthesis or CAR1 encoding arginase. Intracellular arginine was increased by 18.9% or 13.1% respectively by overexpression of ARG4 or disruption of CAR1, which enhanced yeast tolerance to ethanol stress. Moreover, a 41.1% decrease of intracellular arginine was observed in CAR1 overexpressing strain, which made yeast cells keenly sensitive to ethanol. Further investigations indicated that arginine protected yeast cells from ethanol damage by maintaining the integrity of cell wall and cytoplasma membrane, stabilizing the morphology and function of organellae due to low ROS generation.","authors":["Yanfei Cheng","Zhaoli Du","Hui Zhu","Xuena Guo"],"meta":["August 2016Scientific Reports 6(1):31311","DOI:10.1038/srep31311"],"references":["256467009_Ultrastructural_changes_of_Saccharomyces_cerevisiae_in_response_to_ethanol_stress","256539385_Reactive_oxygen_species_production_induced_by_ethanol_in_Saccharomyces_cerevisiae_increases_because_of_a_dysfunctional_mitochondrial_iron-sulfur_cluster_assembly_system","251667553_Arginine_A_novel_compatible_solute_to_protect_Candida_glabrata_against_hyperosmotic_stress","246852782_Endocytosis_and_vacuolar_morphology_inSaccharomyces_cerevisiae_are_altered_in_response_to_ethanol_stress_or_heat_shock","244469936_Methods_in_Yeast_Genetics_A_Cold_Spring_Harbor_Course_Manual","233536985_The_flavoprotein_Tah18-dependent_NO_synthesis_confers_high-temperature_stress_tolerance_on_yeast_cells","225376311_Ethanol_reduces_mitochondrial_membrane_integrity_and_thereby_impacts_carbon_metabolism_of_Saccharomyces_cerevisiae","222436832_A_Saccharomyces_cerevisiae_genomic_plasmid_bank_based_on_a_centromere-containing_shuttle_vector","222165230_The_Yeast_Lysosome-like_Vacuole_Endpoint_and_Crossroads","200037138_Molecular_Cloning_A_Laboratory_Manual_3-Volume_Set"]}