{"id":"306074972_Do_item-writing_flaws_reduce_examinations_psychometric_quality","abstract":"Background\nThe psychometric characteristics of multiple-choice questions (MCQ) changed when taking into account their anatomical sites and the presence of item-writing flaws (IWF). The aim is to understand the impact of the anatomical sites and the presence of IWF in the psychometric qualities of the MCQ. Results800 Clinical Anatomy MCQ from eight examinations were classified as standard or flawed items and according to one of the eight anatomical sites. An item was classified as flawed if it violated at least one of the principles of item writing. The difficulty and discrimination indices of each item were obtained. 55.8 % of the MCQ were flawed items. The anatomical site of the items explained 6.2 and 3.2 % of the difficulty and discrimination parameters and the IWF explained 2.8 and 0.8 %, respectively. Conclusions\nThe impact of the IWF was heterogeneous, the Writing the Stem and Writing the Choices categories had a negative impact (higher difficulty and lower discrimination) while the other categories did not have any impact. The anatomical site effect was higher than IWF effect in the psychometric characteristics of the examination. When constructing MCQ, the focus should be in the topic/area of the items and only after in the presence of IWF.","authors":["João Pais","Artur O Silva","Bruno Guimarães","Ana Povo"],"meta":["August 2016BMC Research Notes 9(1):399","DOI:10.1186/s13104-016-2202-4"],"references":["258765524_Students'_perceptions_of_anatomy_across_the_undergraduate_problem-based_learning_medical_curriculum_A_phenomenographical_study","51162007_Post-examination_analysis_of_objective_tests","248940578_A_Review_of_Multiple-Choice_Item-Writing_Guidelines_for_Classroom_Assessment","234760190_Positive_and_Negative_Multiple_Choice_Items_How_Different_Are_They","234582935_An_Item-Level_Analysis_of_None_of_the_Above","233316247_A_Taxonomy_of_Multiple-Choice_Item-Writing_Rules","227596693_Blueprinting_for_assessment_of_health_care_professionals","44827295_Essentials_of_Educational_Measurement","38100516_Meta-Evaluation_in_Clinical_Anatomy_A_Practical_Application_of_Item_Response_Theory_in_Multiple_Choice_Examinations","23553868_The_frequency_of_item_writing_flaws_in_multiple-choice_questions_used_in_high_stakes_nursing_assessments"]}