{"id":"306022219_The_role_of_ICT_in_nursing_practice_An_integrative_literature_review_of_the_Swedish_context","abstract":"Background: \nThe Swedish healthcare system employs information and communication technologies (ICT) in nursing practice to meet quality-, security- and efficiency-related demands. Although ICT is integrated with nursing practices, nurses do not always feel that they are convenient to use it. We need to improve our knowledge of the role of ICT in healthcare environments and so we decided to complement existing experience of how ICT influences nursing practice.\n\nAim: \nThis study aimed to review and synthesise the available literature on the role of ICT in nursing practice in Swedish healthcare settings.\n\nMethod: \nTo consolidate previous studies based on diverse methodologies, an integrative literature review was carried out. Three databases were used to search for literature, 20 articles met the inclusion criteria.\n\nResults: \nThe literature review indicates that ICT integration into nursing practice is a complex process that impacts nurses' communication and relationships in patient care, working conditions, and professional identities and development. Nurses are found to express ambiguous views on ICT as a usable service in their everyday practice since it impacts both positively and negatively.\n\nDiscussion and conclusion: \nAlthough ICT cannot replace physical presence, it can be considered a complementary service that gives rise to improved patient care. However, nonverbal communication cues may be missed when ICT is used as mediating tool and ICT can be limiting because it is not always designed to meet nurse and patient needs. The meaning of an encounter appears to change when ICT is used in nursing practice, not only for patient relationships but also for interpersonal communication.","authors":["Cecilia Fagerström","Hanna Tuvesson","Lisa Axelsson","Lina Nilsson"],"meta":["August 2016Scandinavian Journal of Caring Sciences 31(3)","DOI:10.1111/scs.12370"],"references":["308161394_Preferred_Reporting_Items_for_Systematic_Reviews_and_Meta-Analyses_the_PRISMA_statement","281432611_Experiences_of_Healthcare_Professionals_to_the_Introduction_in_Sweden_of_a_Public_eHealth_Service_Patients'_Online_Access_to_their_Electronic_Health_Records","264866164_Facilitators_and_barriers_influencing_patient_safety_in_Swedish_hospitals_A_qualitative_study_of_nurses'_perceptions","277779781_Nurse_collaboration_in_community_and_psychiatric_care_A_Swedish_study","274427362_Evaluation_of_a_nursing_informatics_training_program_shows_significant_changes_in_nurses'_perception_of_their_knowledge_of_information_technology","273088439_The_Evolution_of_Definitions_for_Nursing_Informatics_A_Critical_Analysis_and_Revised_Definition","269882565_The_Nature_of_Theoretical_Thinking_in_Nursing","263704629_Relationship_Between_Work_Context_and_Adherence_to_a_Clinical_Practice_Guideline_for_Peripheral_Venous_Catheters_Among_Registered_Nurses_in_Pediatric_Care","263289415_Social_Challenges_When_Implementing_Information_Systems_in_Everyday_Work_in_a_Nursing_Context","259785319_Clinical_Governance_A_Guide_to_Implementation_for_Health_Care_Professionals"]}