{"id":"306048459_A_Framework_for_Evaluating_Skyline_Queries_over_Incomplete_Data","abstract":"Research interest in skyline queries has been significantly increased over the years, as skyline queries can be utilized in many contemporary applications, such as multi-criteria decision-making system, decision support system, recommendation system, data mining, and personalized systems. Skyline queries return data item that is not dominated by any other data items in all dimensions (attributes). Most of the existing skyline approaches assumed that database is complete and values are present during the skyline process. However, such assumption is not always to be true, particularly in a real world database where values of data item might not be available (missing) in one or more dimensions. Thus, the incompleteness of the data impacts negatively on skyline process due to losing the transitivity property which leads into the issue of cyclic dominance. Therefore, applying skyline technique directly on an incomplete database is prohibitive and might result into exhaustive pairwise comparison. This paper presents an approach that efficiently evaluates skyline queries in incomplete database. The approach aims at reducing the number of pairwise comparisons and shortens the searching space in identifying the skylines. Several experiments have been conducted to demonstrate that our approach outperforms the previous approach through producing a lower number of pairwise comparisons. Furthermore, the result also illustrates that our approach is scalable and efficient.","authors":["Yonis Gulzar","Ali Amer Alwan","Norsaremah Salleh","Imad Fakhri Al Shaikhli"],"meta":["August 2016Procedia Computer Science 94:191-198","DOI:10.1016/j.procs.2016.08.030","Project: An Efficient Model for Processing Skyline Queries in Incomplete and Uncertain Databases"],"references":["294288292_An_Efficient_Approach_for_Processing_Skyline_Queries_in_Incomplete_Multidimensional_Database","227119097_On_High_Dimensional_Skylines","221310231_Maximal_Vector_Computation_in_Large_Data_Sets","221214278_Finding_k-dominant_skylines_in_high_dimensional_space","314819465_An_optimal_and_progressive_algorithm_for_skyline_queries","261860819_Finding_skylines_for_incomplete_data","221311261_Efficient_Processing_of_Top-k_Dominating_Queries_on_Multi-Dimensional_Data","221310438_Shooting_Stars_in_the_Sky_An_Online_Algorithm_for_Skyline_Queries","221310241_Efficient_Progressive_Skyline_Computation","221103600_BITPEER_continuous_subspace_skyline_computation_with_distributed_bitmap_indexes"]}