{"id":"306033489_Propulsion_Theory_of_Flapping_Airfoils_Comparison_with_Computational_Fluid_Dynamics","abstract":"Note: This is a preprint version. The published version can be found at: http://arc.aiaa.org/doi/10.2514/6.2015-0257\n\nThe thrust, required power, and propulsive efficiency of a flapping airfoil as predicted by the well-known Theodorsen model are compared with solutions obtained from grid- resolved inviscid computational fluid dynamics. A straight-forward summary of Theodorsen’s flapping airfoil model is presented using updated terminology and symbols. This shows that both axial and normal reduced frequencies are of significant importance. The axial reduced frequency is based on the chord length and the normal reduced frequency is based on the plunging amplitude. Computational fluid dynamics solutions are presented over the range of both reduced frequencies typically encountered in the forward flight of birds. It is shown that computational results agree reasonably well with those predicted by Theodorsen’s model at low flapping frequencies. An alternate model is also developed, which shows that the time-dependent aerodynamic forces acting on a flapping airfoil can be related to two unknown Fourier coefficients. The computational results are correlated with algebraic relations for these Fourier coefficients, which can be used to predict the thrust, required power, and propulsive efficiency for airfoils with sinusoidal pitching and plunging motion.","authors":["Douglas Hunsaker","Warren F. Phillips"],"meta":["January 2015","DOI:10.2514/6.2015-0257","Conference: 53rd AIAA Aerospace Sciences Meeting"],"references":["275844503_Wing_Stiffness_on_Light_Flapping_Micro_Aerial_Vehicles","274409035_Testing_and_System_Identification_of_an_Ornithopter_in_Longitudinal_Flight","264119736_Discrete-vortex_method_with_novel_shedding_criterion_for_unsteady_airfoil_flows_with_intermittent_leading-edge_vortex_shedding","304716713_Modeling_the_unsteady_aerodynamic_forces_on_small-scale_wings","300078752_Power_requirements_for_large-amplitude_flapping_flight","286282070_General_theory_of_aerodynamic_instability_and_the_mechanism_of_flutter_NACA_Technical_Report_496_Aeronautics","285169487_Ein_Beitrag_zur_Erklaerung_des_Segelfluges","285119994_Die_Gesetze_des_Luftwiderstandes","278218393_Object-oriented_unsteady_vortex_lattice_method_for_flapping_flight","271742318_The_role_of_advance_ratio_and_aspect_ratio_in_determining_leading-edge_vortex_stability_for_flapping_flight"]}