{"id":"306042773_A_New_Technique_to_Manage_Big_Bioinformatics_Data_Using_Genetic_Algorithms","abstract":"The continuous growth of data, mainly the medical data at laboratories becomes very complex to use and to manage by using traditional ways. So, the researchers start studying genetic information field which increased in the past thirty years in bioinformatics domain (the computer science field, genetic biology field, and DNA). This growth of data becomes known as big bioinformatics data. Thus, efficient algorithms such as Genetic Algorithms are needed to deal with this big and vast amount of bioinformatics data in genetic laboratories. So the researchers proposed two models to manage the big bioinformatics data in addition to the traditional model. The first model by applying Genetic Algorithms before MapReduce, the second model by applying Genetic Algorithms after the MapReduce, and the original or the traditional model by applying only MapReduce without using Genetic Algorithms. The three models were implemented and evaluated using big bioinformatics data collected from the Duchenne Muscular Dystrophy (DMD) disorder. The researchers conclude that the second model is the best one among the three models in reducing the size of the data, in execution time, and in addition to the ability to manage and summarize big bioinformatics data. Finally by comparing the percentage errors of the second model with the first model and the traditional model, the researchers obtained the following results 1.136%, 10.227%, and 11.363% respectively. So the second model is the most accurate model with the less percentage error.","authors":["Huda Jalil","Mohammad Shkoukani","Suhail Sami"],"meta":["October 2016International Journal of Advanced Research in Artificial Intelligence 5(6)","DOI:10.14569/IJARAI.2016.050601"],"references":["299575966_Extract_Five_Categories_CPIVW_from_the_9V's_Characteristics_of_the_Big_Data","278734009_Big_Data_Analytics_in_Bioinformatics_Architectures_Techniques_Tools_and_Issues","220827177_Query_optimization_by_Genetic_Algorithms","216300585_Introduction_To_Evolutionary_Computing","25495624_Annual_Review_of_Genomics_and_Human_Genetics","284453323_Enhanced_Genetic_Algorithm_based_Task_Scheduling_in_Cloud_Computing","220691833_Introduction_to_Genetic_Algorithms","45885831_Introduction_to_Bioinformatics","13994169_Computer_science_and_biology-the_German_Conference_on_Bioinformatics_GCB'96","4347439_Microarray_Image_Converted_Database_-_Genetic_Algorithm_Application_in_Bioinformatics"]}