{"id":"306061740_Quality_frameworks_for_MOOCs","abstract":"The hype surrounding MOOCs has been tempered by scepticism about the quality of MOOCs. The possible flaws of MOOCs include the quality of the pedagogies employed, low completion rates and a failure to deliver on the promise of inclusive and equitable quality education for all. On the other hand, MOOCs that have given a boost to open and online education have become a symbol of a larger modernisation agenda for universities, and are perceived as tools for universities to improve the quality of blended and online education—both in degree education and Continuous Professional Development. MOOC provision is also much more open to external scrutiny as part of a stronger globalising higher education market. This has important consequences for quality frameworks and quality processes that go beyond the individual MOOC. In this context, different quality approaches are discussed including possible measures at different levels and the tension between product and process models. Two case studies are described: one at the institutional level (The Open University) and one at a MOOC platform level (FutureLearn) and how they intertwine is discussed. The importance of a national or international quality framework which carries with it a certification or label is illustrated with the OpenupEd Quality label. Both the label itself and its practical use are described in detail. The examples will illustrate that MOOCs require quality assurance processes tailored to e-learning and open education, embedded in institutional frameworks. The increasing unbundling of educational services may require additional quality processes.","authors":["Darco Jansen","Jon Rosewell","Karen Kear"],"meta":["January 2017","DOI:10.1007/978-3-662-52925-6_14","In book: Open Education: from OERs to MOOCs (pp.261-281)","Project: Support Centres for Open education and MOOCS in different Regions of Europe 2020 (SCORE2020, 2014-2016)"],"references":["308391574_Massive_open_online_course_completion_rates_revisited_Assessment_length_and_attrition","289957387_What_Questions_are_MOOCs_Asking_-_An_Evidence-Based_Investigation","286925442_The_OpenupEd_quality_label_Benchmarks_for_MOOCs","286924947_MOOCs_for_Opening_Up_Education_and_the_OpenupEd_initiative","286690038_Making_Sense_of_MOOCs_Musings_in_a_Maze_of_Myth_Paradox_and_Possibility","285747275_Comparing_MOOC_adoption_strategies_in_Europe_Results_from_the_HOME_project_survey","322028117_Massive_Open_Online_Courses","306061958_Intercreativity_and_Interculturality_in_the_Virtual_Learning_Environments_of_the_ECO_MOOC_Project","306061867_Designing_Massive_Open_Online_Learning_Processes_The_sMOOC_Pedagogical_Framework","292358502_Digital_Technology_and_the_Contemporary_University_Degrees_of_digitization"]}