{"id":"306086837_Parallel_search_paths_for_the_simplex_algorithm","abstract":"It is well known that the simplex method is inherently a sequential algorithm with little scope for parallelization. Even so, during the last decades several attempts were made to parallelize it since it is one of the most important algorithms for solving linear optimization problems. Such parallelization ideas mostly rely on iteration parallelism and overlapping. Since the simplex method goes through a series of basic solutions until it finds an optimal solution, each of them must be available before performing the next basis change. This phenomenon imposes a limit on the performance of the parallelized version of the simplex method which uses overlapping iterations. Another approach can be considered if we think about alternative paths on the n-dimensional simplex polyhedron. As the simplex method goes through the edges of this polyhedron it is generally true that the speed of convergence of the algorithm is not smooth. It depends on the actual part of the surface. If a parallel version of the simplex algorithm simultaneously goes on different paths on this surface a highly reliable algorithm can be constructed. There is no known dominating strategy for pivot selection. Therefore, one can try different pivot selection methods in parallel in order to guide the algorithm on different pathways. This approach can be used effectively with periodic synchronization on shared memory multi-core computing environments to speed up the solution algorithm and get around numerically and/or algorithmically difficult situations throughout the computations.","authors":["Péter Tar","Bálint Stágel","Istvan Maros"],"meta":["December 2017Central European Journal of Operations Research 25(4)","DOI:10.1007/s10100-016-0452-9"],"references":["324928984_The_Pannon_Optimizier_-_A_Linear_Programming_Solver_for_Research_Purposes","273327941_Parallelizing_the_dual_revised_simplex_method","265381590_Novel_update_techniques_for_the_revised_simplex_method","258698596_A_High_Performance_Dual_Revised_Simplex_Solver","242916524_ASYNPLEX_an_asynchronous_parallel_revised_simplex_algorithm","249875311_A_Distributed_Implementation_of_the_Simplex_Method","247956274_The_Product_Form_for_the_Inverse_in_the_Simplex_Method","245763392_Data-Parallel_Implementations_of_Dense_Simplex_Methods_on_the_Connection_Machine_CM2","242517595_An_Empirical_Evaluation_of_the_KORBXR_Algorithms_for_Military_Airlift_Applications","242502494_Electronic_Mail_Distribution_of_Linear_Programming_Test_Problems","226888717_Practical_anti-cycling_procedure_for_linearly_constrained_optimization","232634451_Efficient_decomposition_and_performance_of_parallel_PDE_FFT_Monte_Carlo_simulations_simplex_and_Sparse_solvers","228889680_Computational_Techniques_of_the_Simplex_Method","227359217_The_Elimination_form_of_the_Inverse_and_its_Application_to_Linear_Programming","227318418_A_parallelization_of_the_simplex_method"]}