{"id":"306072167_Efficient_Gene_Tree_Correction_Guided_by_Genome_Evolution","abstract":"Motivations: \nGene trees inferred solely from multiple alignments of homologous sequences often contain weakly supported and uncertain branches. Information for their full resolution may lie in the dependency between gene families and their genomic context. Integrative methods, using species tree information in addition to sequence information, often rely on a computationally intensive tree space search which forecloses an application to large genomic databases.\n\nResults: \nWe propose a new method, called ProfileNJ, that takes a gene tree with statistical supports on its branches, and corrects its weakly supported parts by using a combination of information from a species tree and a distance matrix. Its low running time enabled us to use it on the whole Ensembl Compara database, for which we propose an alternative, arguably more plausible set of gene trees. This allowed us to perform a genome-wide analysis of duplication and loss patterns on the history of 63 eukaryote species, and predict ancestral gene content and order for all ancestors along the phylogeny.\n\nAvailability: \nA web interface called RefineTree, including ProfileNJ as well as a other gene tree correction methods, which we also test on the Ensembl gene families, is available at: http://www-ens.iro.umontreal.ca/~adbit/polytomysolver.html. The code of ProfileNJ as well as the set of gene trees corrected by ProfileNJ from Ensembl Compara version 73 families are also made available.","authors":["Emmanuel Noutahi","Magali Semeria","Manuel Lafond","Jonathan Séguin"],"meta":["August 2016PLoS ONE 11(8)","DOI:10.1371/journal.pone.0159559"],"references":["275132798_Quantitative_Phyletics_and_the_Evolution_of_Anurans","265093022_Polytomy_refinement_for_the_correction_of_dubious_duplications_in_gene_trees","264640666_Big_Data_and_Other_Challenges_in_the_Quest_for_Orthologs","264630299_PhylDiag_Identifying_complex_synteny_blocks_that_include_tandem_duplications_using_phylogenetic_gene_trees","292800734_Duplication_Rearrangement_and_Reconciliation_A_Follow-Up_13_Years_Later","290466188_Reconciliation_with_Non-binary_Gene_Trees_Revisited","290013218_A_hybrid_micro-macroevolutionary_approach_to_gene_tree_reconstruction","286215327_The_Neighbor-Joining_Method_A_New_Method_for_Reconstructing_Phylogenetic_Trees","281251348_Models_and_Algorithms_for_Genome_Evolution","268315476_Phylogenetics"]}