{"id":"306074950_ECG_-_based_Atrial_Fibrillation_Detection_using_different_orderings_of_Conjugate_Symmetric_-_Complex_Hadamard_Transform","abstract":"Atrial Fibrillation (AF) is a classification of Cardiac disrhythmia is an arrhythmia in which the heartbeat is irregular, too fast, or too slow. Because of this erratically changing behavior, effective pumping of blood by the heart to other organs results in malfunctioning of them. Generally, AF is seen commonly in elder people who are suffering from heart failure. To effectively treat AF, automatic detection methods based on Electrocardiograph (ECG) monitoring is highly desirable. The objective of this study is to develop a novel algorithm able to detect atrial fibrillation episodes supervising a standard superficial ECG lead. In this discussion AF is detected by considering the MIT/BIH arrhythmia database. The features of this database is extracted by using the different orderings of Conjugate Symmetric – Complex Hadamard Transform (CS – CHT) namely Natural order, Paley order, Sequency order and Cal – Sal order as they are fast and can be implemented with less memory usage as compared with the previous techniques in literature. The results obtained are applied to Levenberg – Marquardt Neural Network (LM NN) classifier and the performances of these techniques were estimated in terms of sensitivity, specificity and overall detection accuracy on the datasets.","authors":["Ambika Annavarapu","Padmavathi Kora"],"meta":["August 2016International Journal of the Cardiovascular Academy 2(3)","DOI:10.1016/j.ijcac.2016.08.001"],"references":["288567366_Hybrid_Firefly_and_Particle_Swarm_Optimization_algorithm_for_the_detection_of_Bundle_Branch_Block","260240514_Automatic_online_detection_of_atrial_fibrillation_based_on_symbolic_dynamics_and_Shannon_entropy","224394981_Conjugate_Symmetric_Sequency-Ordered_Complex_Hadamard_Transform","224375463_Detection_of_Atrial_Fibrillation_Using_Model-based_ECG_Analysis","290906187_The_identifacation_model_of_visual_images_using_Berkeley_Wavelet_Pyramid_based_on_fMRI","275335009_Detection_of_Atrial_Fibrillation_using_Continuous_Wavelet_transform_and_Wavelet_Coherence","266567377_Automatic_Atrial_Fibrillation_Detection_Using_Autoregressive_Modeling","242800547_In_place_computation_of_the_Hadamard_transform_in_cal-sal_order","230622917_Atrial_Fibrillation_Detection_Using_an_iPhone_4S","222534469_Wavelet_transform_feature_extraction_from_human_PPG_ECG_and_EEG_signal_responses_to_ELF_PEMF_exposures_A_pilot_study"]}