{"id":"306056635_Embedded_Data_Representations","abstract":"We introduce embedded data representations, the use of visual and physical representations of data that are deeply integrated with the physical spaces, objects, and entities to which the data refers. Technologies like lightweight wireless displays, mixed reality hardware, and autonomous vehicles are making it increasingly easier to display data in-context. While researchers and artists have already begun to create embedded data representations, the benefits, trade-offs, and even the language necessary to describe and compare these approaches remain unexplored. In this paper, we formalize the notion of physical data referents – the real-world entities and spaces to which data corresponds – and examine the relationship between referents and the visual and physical representations of their data. We differentiate situated representations, which display data in proximity to data referents, and embedded representations, which display data so that it spatially coincides with data referents. Drawing on examples from visualization, ubiquitous computing, and art, we explore the role of spatial indirection, scale, and interaction for embedded representations. We also examine the tradeoffs between non-situated, situated, and embedded data displays, including both visualizations and physicalizations. Based on our observations, we identify a variety of design challenges for embedded data representation, and suggest opportunities for future research and applications.","authors":["Wesley Willett","Yvonne Jansen","Pierre Dragicevic"],"meta":["August 2016IEEE Transactions on Visualization and Computer Graphics 23(1):1-1","DOI:10.1109/TVCG.2016.2598608"],"references":["298397006_Investigating_the_Role_of_Situated_Public_Displays_and_Hyperlocal_Content_on_Place-Making","282651675_SmartTokens_Embedding_Motion_and_Grip_Sensing_in_Small_Tangible_Objects","314796376_Research_directions_in_situated_computing","313442329_Situated_Analytics","308811640_Using_augmented_reality_to_support_situated_analytics","302073755_Keynote_speaker_Visualization_analysis_and_design","301935400_Physikit_Data_Engagement_Through_Physical_Ambient_Visualizations_in_the_Home","301415683_3D_Collaboration_Method_over_HoloLens_and_Skype_End_Points","298902596_Spatial_Analytic_Interfaces_Spatial_User_Interfaces_for_In-Situ_Visual_Analytics","297620389_Interaction_and_introspection_with_tangible_augmented_objects"]}