{"id":"306062742_Adaptive_problem-solving_oriented_programming_learning_system","abstract":"Programming design sequence is one kind of problem-solving processes. It covers multiple cognitive levels of activities. In a typical programming design process, we must first recognize the nature of the problem, followed by analytical thinking and summarizing through logical reasoning to propose an algorithm. At last, translate the proposed algorithm to a formal programming language in order to solve the problem by using computer. However, most students are good at studying conceptual knowledge, and lack of logical analysis training. This study presents an adaptive problem-solving oriented programming learning system, which can classify learning problems in the learning process, and combine with case-based reasoning method to construction the best learning diagnostic model. When students construct learning knowledge through the proposed problem-solving process, the system will diagnose the learning difficulties of students according to the learning portfolios, and provide an adaptive real-time study guide mechanism for each specific student. In summary, the proposed system can encourage students to have a good manner and correct understanding in problem-solving, and help students develop professional programming abilities.","authors":["I-Ling Chung","Chang-Min Chou","cy Chang","Deng-Kai Li"],"meta":["May 2016","DOI:10.1109/ICASI.2016.7539851","Conference: 2016 International Conference on Applied System Innovation (ICASI)"],"references":["354490933_The_Autonomous_Learner_Model","290109443_Teaching_for_Transfer_of_Problem-Solving_Skills_to_Computer_Programming","289014501_Facilitating_Domain-General_Problem_Solving_Computers_Cognitive_Processes_and_Instruction","232507248_Using_Conceptual_Models_to_Teach_BASIC_Computer_Programming","223949643_Learning_computer_programming_through_dynamic_representation_of_computer_functioning_Evaluation_of_a_new_learning_package_for_Pascal","222656972_Assessing_creative_problem-solving_with_automated_text_grading","220108244_Models_and_Theories_of_Programming_Strategy","200085837_Learning_and_Teaching_Programming_A_Review_and_Discussion"]}