{"id":"306030258_Optimal_and_heuristic_algorithms_for_all-optical_group_multicast_in_resource-constrained_WDM_networks","abstract":"Given a sparse-splitting wavelength-division multiplexing network with no wavelength converter, we study a group multicast problem that is how to transmit a number of multicast streams from the video server to multiple destinations simultaneously. To avoid the situation that the wavelengths are used up by the first few requests, one wavelength is available for each multicast request. Hence, some of destinations may not be included in the multicast trees because of the lack of wavelengths. Our goal is to construct a number of light trees with conflict-free wavelengths for multiple requests so that the number of served clients is maximized. This problem is named as the revenue-maximized and delay-constrained group multicast routing problem. We first determine a set of multicast trees with the maximum number of served clients, then followed by the wavelength assignment to allocate the minimum number of wavelengths to the resulting trees. In this study, we propose two Integer Linear Programming ILP-based algorithms for determining the optimal solutions for the light-tree construction problem and the wavelength assignment problem, respectively. For large-scale networks, two heuristics are introduced to solve the light-tree construction problem approximately. A set of simulations are also provided for comparing performances of our algorithms against the other published methods. Copyright","authors":["Wen-Lin Yang","Chun‐Tao Yang","Yu‐Chung Huang"],"meta":["August 2016International Journal of Communication Systems 29(15)","DOI:10.1002/dac.3165"],"references":["270158871_Minimizing_Blocking_Probability_for_the_Multicast_Routing_and_Wavelength_Assignment_Problem_in_WDM_Networks_Exact_Solutions_and_Heuristic_Algorithms","264457079_A_review_of_routing_strategies_for_optical_burst_switched_networks","261759727_Multicast_Routing_in_WDM_Networks_without_Splitters","313136089_Routing_of_multipoint_connections","300408164_Heuristic_algorithms_for_efficient_allocation_of_multicast-capable_nodes_in_sparse-splitting_optical_networks","282453650_Multicast_Routing_Algorithms_for_Sparse_Splitting_Optical_Networks","274313644_Analysis_and_Efficient_Provisioning_of_Access_Networks_With_Correlated_and_Bursty_Arrivals","272015293_Splitting_minimization_a_novel_approach_for_multicasting_in_WDM_mesh_networks","264457084_A_cross-layer_optimization_for_maximum-revenue-based_multicast_in_multichannel_multiradio_wireless_mesh_networks","261331787_A_light-forest_approach_for_QoS_multicasting_in_WDM_networks"]}