{"id":"306025164_Approximation_of_the_parallel_machine_scheduling_problem_with_additional_unit_resources","abstract":"We consider the problem of minimizing the makespan of a schedule on m parallel machines of n jobs, where each job requires exactly one of s additional unit resources. This problem collapses to P∥Cmax if every job requires a different resource. It is therefore NP-hard even if we fix the number of machines to 2 and strongly NP-hard in general.\nAlthough very basic, its approximability is not known, and more general cases, such as scheduling with conflicts, are often not approximable. We give a (2−2m+1)-approximation algorithm for this problem, and show that when the deviation in jobs processing times is bounded by a ratio ρ, the same algorithm approximates the problem within a tight factor 1+ρ(m−1)n.\nThis problem appears in the design of download plans for Earth observation satellites, when scheduling the transfer of the acquired data to ground stations. Within this context, it may be required to process jobs by batches standing for the set of files related to a single observation. We show that there exists a (2−1m)-approximation algorithm respecting such batch sequences. Moreover, provided that the ratio ρ, between maximum and minimum processing times, is bounded by ⌊s−1m−1⌋, we show that the proposed algorithm approximates the optimal schedule within a factor 1+s−1n.","authors":["Emmanuel Hebrard","Marie-José Huguet","Nicolas Jozefowiez","Adrien Maillard"],"meta":["August 2016Discrete Applied Mathematics 215(2)","DOI:10.1016/j.dam.2016.07.003"],"references":["279866508_Satellite_Data_Download_Management_with_Uncertainty_about_the_Generated_Volumes","225150218_Scheduling_with_conflicts_Online_and_offline_algorithms","257196625_Parallel_machine_scheduling_with_additional_resources_Notation_classification_models_and_solution_methods","222465334_Scheduling_subject_to_resource_constraints_classification_and_complexity_preprint","220568795_Scheduling_problems_for_parallel_dedicated_machines_under_multiple_resource_constraints","220470628_Scheduling_jobs_on_identical_machines_with_agreement_graph","220090606_Scheduling_jobs_with_time-resource_tradeoff_via_nonlinear_programming","200031745_Strong_NP-Completeness_Results_Motivation_Examples_and_Implications"]}