{"id":"306075233_A_Survey_of_Serendipity_in_Recommender_Systems","abstract":"Recommender systems use past behaviors of users to suggest items. Most tend to offer items similar to the items that a target user has indicated as interesting. As a result, users become bored with obvious suggestions that they might have already discovered. To improve user satisfaction, recommender systems should offer serendipitous suggestions: items not only relevant and novel to the target user, but also significantly different from the items that the user has rated. However, the concept of serendipity is very subjective and serendipitous encounters are very rare in real-world scenarios, which makes serendipitous recommendations extremely difficult to study. To date, various definitions and evaluation metrics to measure serendipity have been proposed, and there is no wide consensus on which definition and evaluation metric to use. In this paper, we summarize most important approaches to serendipity in recommender systems, compare different definitions and formalizations of the concept, discuss serendipity-oriented recommendation algorithms and evaluation strategies to assess the algorithms, and provide future research directions based on the reviewed literature.","authors":["Denis Kotkov","Shuaiqiang Wang","Jari Veijalainen"],"meta":["August 2016Knowledge-Based Systems 111","DOI:10.1016/j.knosys.2016.08.014","Projects: MineSocMedMineSocMed"],"references":["301432391_I_like_to_explore_sometimes","294285848_Cross-Domain_Recommender_Systems","289544675_Tutorial_on_cross-domain_recommender_systems","285383680_Towards_more_targeted_recommendations_in_folksonomies","313363141_Discovery_Is_Never_By_Chance_Designing_for_UnSerendipity","302973713_Challenges_of_Serendipity_in_Recommender_Systems","301432240_Predicting_Online_Performance_of_News_Recommender_Systems_Through_Richer_Evaluation_Metrics","300791314_An_Unexpectedness-Augmented_Utility_Model_for_Making_Serendipitous_Recommendation","300031746_Islands_in_the_Stream","288578421_Visualizing_Basic_Words_Chosen_by_Latent_Dirichlet_Allocation_for_Serendipitous_Recommendation"]}