{"id":"306002251_Modified_artificial_bee_colony_for_the_vehicle_routing_problems_with_time_windows","abstract":"The natural behaviour of the honeybee has attracted the attention of researchers in recent years and several algorithms have been developed that mimic swarm behaviour to solve optimisation problems. This paper introduces an artificial bee colony (ABC) algorithm for the vehicle routing problem with time windows (VRPTW). A Modified ABC algorithm is proposed to improve the solution quality of the original ABC. The high exploration ability of the ABC slows-down its convergence speed, which may due to the mechanism used by scout bees in replacing abandoned (unimproved) solutions with new ones. In the Modified ABC a list of abandoned solutions is used by the scout bees to memorise the abandoned solutions, then the scout bees select a solution from the list based on roulette wheel selection and replace by a new solution with random routs selected from the best solution. The performance of the Modified ABC is evaluated on Solomon benchmark datasets and compared with the original ABC. The computational results demonstrate that the Modified ABC outperforms the original ABC also produce good solutions when compared with the best-known results in the literature. Computational investigations show that the proposed algorithm is a good and promising approach for the VRPTW.","authors":["Malek Ali Alzaqebah","Salwani Abdullah","Sana Jawarneh"],"meta":["August 2016SpringerPlus 5(1):1298","DOI:10.1186/s40064-016-2940-8"],"references":["279731963_Sequential_Insertion_Heuristic_with_Adaptive_Bee_Colony_Optimisation_Algorithm_for_Vehicle_Routing_Problem_with_Time_Windows","267202931_A_Survey_on_the_Vehicle_Routing_Problem_and_Its_Variants","257512309_A_comprehensive_survey_Artificial_bee_colony_ABC_algorithm_and_applications","314796386_On_the_influence_of_GVR_in_vehicle_routing","312579013_Using_constraint_programming_and_local_search_methods_to_solve_vehicle_routing_problems","309107061_A_PSO_approach_for_solving_VRPTW_with_real_case_study","291244674_Artificial_Bee_Colony_Algorithm_and_Its_Application_to_Generalized_Assignment_Problem","284562262_Artificial_bee_colony_algorithm_and_its_application_to_generalized_assignment_problem","268615298_Sequential_Simulated_Annealing_for_the_Vehicle_Routing_Problem_with_Time_Windows","255638348_An_Idea_Based_on_Honey_Bee_Swarm_for_Numerical_Optimization_Technical_Report_-_TR06"]}