{"id":"306104447_Not_Feeling_Good_in_STEM_Effects_of_Stereotype_Activation_and_Anticipated_Affect_on_Women's_Career_Aspirations","abstract":"Despite great efforts to increase women’s participation in science, technology, engineering, and math (STEM), relatively few women choose careers in these fields. We argue that women might expect to feel less good in contexts where unfavorable gender stereotypes are activated in their minds (e.g., by strong underrepresentation) and, consequently, are less likely to aspire to STEM careers. In two pilot studies (Ns = 28/61), we confirmed that undergraduate women expect more negative and less positive affect (i.e., generally (un)pleasant emotions) and a heightened sense of threat in a stereotype-activating, compared to a not stereotype-activating, test scenario. In Study 1 (N = 102), the scenario indirectly lowered college women’s STEM career aspiration (adjusted for preliminary domain identification) due to lower anticipated positive affect, but not to higher negative affect, in the stereotype-activating scenario. The scenario had no detrimental effect on college men’s anticipated affect or their career aspirations. In Study 2, 91 high school students reported anticipated affect and self-efficacy in different university majors and their intentions to choose the subject as a major. The more stereotypically male (in terms of gender distribution) the subject, the more negative and the less positive was young women’s, but not young men’s, anticipated affect. Only lower positive, but not higher negative, affect predicted low study intentions over and above self-efficacy. To increase women’s aspirations, their expected feelings in STEM deserve attention. One approach to foster positive affect might be to create less stereotypical STEM contexts.","authors":["Carolin Schuster","Sarah E. Martiny"],"meta":["January 2017Sex Roles 76(1-2)","DOI:10.1007/s11199-016-0665-3"],"references":["274258994_Distracted_by_the_Unthought_-_Suppression_and_Reappraisal_of_Mind_Wandering_under_Stereotype_Threat","271821400_The_Ironic_Costs_of_Performing_Well_Grades_Differentially_Predict_Male_and_Female_Dropout_From_Engineering","270705563_An_Underexamined_Inequality_Cultural_and_Psychological_Barriers_to_Men's_Engagement_With_Communal_Roles","259215223_Gender_and_STEM_in_Germany_Policies_Enhancing_Women's_Participation_in_Academia","258189201_Do_Female_and_Male_Role_Models_Who_Embody_STEM_Stereotypes_Hinder_Women's_Anticipated_Success_in_STEM","325670955_A_model_of_often_mixed_stereotype_content_Competence_and_warmth_respectively_follow_from_perceived_status_and_competition","297255231_THE_EARTH_IS_HIGHLY_SIGNIFICANTLY_ROUND_P-LESS-THAN0001","265354383_Personal_goals_life_meaning_and_virtue_Wellsprings_of_a_positive_life","259115113_Motivational_Pathways_to_STEM_Career_Choices_Using_Expectancy-Value_Perspective_to_Understand_Individual_and_Gender_Differences_in_STEM_Fields","258501690_The_New_Statistics"]}