{"id":"306187437_Beyond_a_Gaussian_Denoiser_Residual_Learning_of_Deep_CNN_for_Image_Denoising","abstract":"Discriminative model learning for image denoising has been recently attracting considerable attentions due to its favorable denoising performance. In this paper, we take one step forward by investigating the construction of feed-forward denoising convolutional neural networks (DnCNNs) to embrace the progress in very deep architecture, learning algorithm, and regularization method into image denoising. Specifically, residual learning and batch normalization are utilized to speed up the training process as well as boost the denoising performance. Different from the existing discriminative denoising models which usually train a specific model for additive white Gaussian noise (AWGN) at a certain noise level, our DnCNN model is able to handle Gaussian denoising with unknown noise level (i.e., blind Gaussian denoising). With the residual learning strategy, DnCNN implicitly removes the latent clean image in the hidden layers. This property motivates us to train a single DnCNN model to tackle with several general image denoising tasks such as Gaussian denoising, single image super-resolution and JPEG image deblocking. Our extensive experiments demonstrate that our DnCNN model can not only exhibit high effectiveness in several general image denoising tasks, but also be efficiently implemented by benefiting from GPU computing.","authors":["Kai Zhang","Wangmeng Zuo","Yunjin Chen","Deyu Meng"],"meta":["August 2016IEEE Transactions on Image Processing PP(99)","DOI:10.1109/TIP.2017.2662206","Project: Image enhancement and restoration"],"references":["305415448_Weighted_Nuclear_Norm_Minimization_and_Its_Applications_to_Low_Level_Vision","305196650_Going_deeper_with_convolutions","319770272_Delving_Deep_into_Rectifiers_Surpassing_Human-Level_Performance_on_ImageNet_Classification","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","311610731_Accurate_Image_Super-Resolution_Using_Very_Deep_Convolutional_Networks","311609041_Deep_Residual_Learning_for_Image_Recognition","310752071_Natural_image_denoising_with_convolutional_networks","308849578_Adaptive_residual_interpolation_for_color_image_demosaicking","305786352_Trainable_Nonlinear_Reaction_Diffusion_A_Flexible_Framework_for_Fast_and_Effective_Image_Restoration","304417592_MatConvNet_convolutional_neural_networks_for_MATLAB"]}