{"id":"306169389_Gourd_pyrography_art_simulating_based_on_non-photorealistic_rendering","abstract":"Non-photorealistic rendering (NPR) is a field in computer science which can create effective illustrations and appealing artistic imagery. Some researchers have proposed NPR methods to simulate different artistic illustrations. However, simulating the new art styles remains extremely challenging. National pyrography is a very famous artistic work in China, and few algorithms have been put forward to illustrate this style. Some exist rendering methods can not demonstrate the main characters of the real pyrography, and the rendering speed is time-consuming using texture synthesis technique. This paper proposes a non-photorealistic rendering technique that automatically generates a gourd pyrography style from a 2D photograph. Similar to the existing exemplar-based methods, an input natural image is regarded as the foreground image, and an input gourd image is taken as the background image. To avoid time-consuming methods like texture synthesis or analogy, this paper simulates character of real pyrography through image abstraction and enhancement from the foreground image. The foreground image will be deformed using equilateral triangle mesh to match the gourd image and mapped to this background image. Experimental results demonstrate the effectiveness of our methods in producing gourd pyrography stylistic illustrations. Meanwhile, the proposed method is simple, fast, and easy to implement.","authors":["Wenhua Qian","Dan Xu","Kun Yue","Zheng Guan"],"meta":["July 2017Multimedia Tools and Applications 76(13)","DOI:10.1007/s11042-016-3801-8"],"references":["276458836_BendFields_Regularized_Curvature_Fields_from_Rough_Concept_Sketches","313636347_Free-form_deformation_of_solid_geometric_models","313198033_Free-form_deformations_with_lattices_of_arbitrary_topology","311229546_Fast_local_Laplacian_filters_Theory_and_applications","300358616_Real-Time_Exemplar-Based_Face_Sketch_Synthesis","286872252_Simulation_for_pyrography_style_painting_based_on_texture_transfer","281950861_Fast_Local_Laplacian_Filters_Theory_and_Applications","269487458_Computer_system_simulation_for_gourd_pyrography_painting","261428673_2D_Shape_Manipulation_Using_Equilateral_Triangle_Mesh","254463015_Combining_sketch_and_tone_for_pencil_drawing_production","236228168_Guided_Image_Filtering","251043214_Chinese_Calligraphy_Creation_in_3D_Virtual_Environment_Chinese_Calligraphy_Creation_in_3D_Virtual_Environment","245929574_Digital_Processing_of_Biomedical_Images","239658943_Processing_of_RI-Angiocardiographic_Images","225876794_Region-Based_Fuzzy_Shock_Filter_with_Anisotropic_Diffusion_for_Adaptive_Image_Enhancement"]}