{"id":"306147932_Global_pervasive_and_ubiquitous_computing_during_2005-14","abstract":"The paper examines world publications output on ubiquitous & pervasive computing as indexed in Scopus database covering the period 2005-2014. The total world output in 10 years cumulated to 22328 publications, averaging to 9.88% annual growth and citation impact to 3.38 citations per paper. The distribution of world output on ubiquitous & pervasive computing is skewed. For instance, top 15 most productive countries accounted for 91.92% global share. The distribution is also skewed by subject. Computer science accounted for the largest publication share (86.53%). The paper provides scientometric profile of most productive top 20 organizations and most productive top 20 authors on a series of indicators including global publications share, global citation share, average productivity per author, citations per paper, h-index, and share of international collaborative papers during 2005-2014. The paper also reveals most productive top 20 journals on ubiquitous and pervasive computing during 2005-2014. India ranked 13th in its research output in this area. Its performance measured on various indicators has been the least: world share (2.56%), average citations per paper (1.41), relative citation rate (0.42), h-index (11), and highly cited papers (0). The paper suggests that India must evolve a research policy to realize its agenda of expanding economic competitiveness and transforming the country into a ubiquitous modern society in near future. © 2016, National Institute of Science Communication and Information Resources (NISCAIR). All rights reserved.","authors":["Surinder M Dhawan","Brij Mohan Gupta","Ritu Gupta"],"meta":["June 2016"],"references":["261524436_Trends_in_Ubiquitous_Multimedia_Computing","220670161_A_Historical_Review_and_Trend_Analysis_of_Ubiquitous_Computing_Research_Using_Bibliometric_Methodology_During_1993_to_2009","220364377_Visualizing_the_research_on_pervasive_and_ubiquitous_computing"]}