{"id":"306186572_Distributed_Learning_with_Regularized_Least_Squares","abstract":"We study distributed learning with the least squares regularization scheme in a reproducing kernel Hilbert space (RKHS). By a divide-and-conquer approach, the algorithm partitions a data set into disjoint data subsets, applies the least squares regularization scheme to each data subset to produce an output function, and then takes an average of the individual output functions as a final global estimator or predictor. We show with error bounds in expectation in both the $L^2$-metric and RKHS-metric that the global output function of this distributed learning is a good approximation to the algorithm processing the whole data in one single machine. Our error bounds are sharp and stated in a general setting without any eigenfunction assumption. The analysis is achieved by a novel second order decomposition of operator differences in our integral operator approach. Even for the classical least squares regularization scheme in the RKHS associated with a general kernel, we give the best learning rate in the literature.","authors":["Shaobo Lin","Xin Guo","Ding-Xuan Zhou"],"meta":["August 2016Journal of Machine Learning Research 18"],"references":["300052277_Learning_theory_of_randomized_Kaczmarz_algorithm","275478292_Regularization_schemes_for_minimum_error_entropy_principle","273394316_Big_Data_Opportunities_and_Challenges_Discussions_from_Data_Analytics_Perspectives_Discussion_Forum","316474881_Optimal_Learning_Rates_for_Localized_SVMs","309070947_Revisiting_the_Nystrom_method_for_improved_large-scale_machine_learning","283230557_Distributed_stochastic_optimization_and_learning","279421890_Support_Vector_Machines","271657944_Introduction_to_the_Peptide_Binding_Problem_of_Computational_Immunology_New_Results","266861994_Function_spaces_entropy_numbers_differential_operators_Paperback_reprint_of_the_hardback_edition_1996","262351084_Efficient_SVM_training_using_low-rank_kernel_representations"]}