{"id":"306270938_Big_data-driven_fuzzy_cognitive_map_for_prioritising_IT_service_procurement_in_the_public_sector","abstract":"The prevalence of big data is starting to spread across the public and private sectors however, an impediment to its widespread adoption orientates around a lack of appropriate big data analytics (BDA) and resulting skills to exploit the full potential of big data availability. In this paper, we propose a novel BDA to contribute towards this void, using a fuzzy cognitive map (FCM) approach that will enhance decision-making thus prioritising IT service procurement in the public sector. This is achieved through the development of decision models that capture the strengths of both data analytics and the established intuitive qualitative approach. By taking advantages of both data analytics and FCM, the proposed approach captures the strength of data-driven decision-making and intuitive model-driven decision modelling. This approach is then validated through a decision-making case regarding IT service procurement in public sector, which is the fundamental step of IT infrastructure supply for publics in a regional government in the Russia federation. The analysis result for the given decision-making problem is then evaluated by decision makers and e-government expertise to confirm the applicability of the proposed BDA. In doing so, demonstrating the value of this approach in contributing towards robust public decision-making regarding IT service procurement.","authors":["Youngseok Choi","Habin Lee","Zahir Irani"],"meta":["November 2018Annals of Operations Research 270(1-2)","DOI:10.1007/s10479-016-2281-6","Project: Policy Compass"],"references":["282546336_Introduction_to_the_special_issue_on_electronic_government_investment_in_communities_firms_technologies_and_infrastructure","316062769_Structure_of_decision_The_cognitive_maps_of_political_elites","304535150_Big_data_The_management_revolution","302981814_How_to_Use_Big_Data_to_Drive_Your_Supply_Chain","302022409_It's_Better_to_Not_Make_a_Big_Deal","301249134_The_role_of_Big_Data_in_explaining_disaster_resilience_in_supply_chains_for_sustainability","300927928_EXTENSIONS","297680870_Simulation_based_decision_support_systems_in_the_supply_chain_context","288941678_Are_you_ready_for_the_era_of_'big_data'","282530538_Decision_Support_Systems"]}