{"id":"306215398_The_relationship_between_self-esteem_and_academic_achievementmotivation_in_university_students","abstract":"Introduction: self-esteem is the strongest psychological factor in predicting learning performance and the most important factor in academic achievement of university students. Given the importance of self-esteem and its impact on students’ motivation to continue their education, the present study was conducted to examine the relationship between self-esteem and academic achievement motivation in students at Zahedan University of Medical Sciences. Methodology: the present descriptive-analytical study was conducted on 200 students at Zahedan University of Medical Sciences in 2015. Data collection was performed using a three-part questionnaire (demographic characteristics, Coopersmith Self-Esteem Inventory and Harter’s Academic Motivation Questionnaire). Then, using the SPSS-19 software, the collected data were analyzed through descriptive statistics, independent t-test, ANOVA, Pearson correlation and Chi-square tests. Results: regarding self-esteem, the results showed that 107 students were significantly below average, 73 students were average and 20 students were significantly above average. Significant relationships were also observed between selfesteem and intrinsic motivation (p<0.001) and between self-esteem and extrinsic motivation (p<0.001). Conclusion: the results of this study showed a significant relationship between self-esteem and academic achievement motivation in university students. © 2016, International Journal of Pharmacy and Technology. All rights reserved.","authors":["Arbabisarjou Azizollah","S. Zare","Mahnaz Shahrakipour","G. Ghoreishinia"],"meta":["June 2016"],"references":["316253728_Ethics_and_Social_Responsibility_in_Educational_Administration","290497242_Hospital's_ethical_climate_and_nurse's_desired_ethical_climate_in_Ali-ebn-Abitaleb_and_Khatam-al-Anbia_hospital_of_Zahedan_2015","267393912_Relationship_between_Managers'_Performance_and_Organizational_Health","290460690_Operating_room_staff_attitude_toward_the_ethical_climate_of_educational_hospitals","228803061_The_Role_of_Entrepreneurship_in_Building_Cultural_Competitiveness_in_Different_Organizational_Types","29806344_The_development_of_an_instrument_to_measure_intrapreneurship_Entrepreneurship_within_the_corporate_setting"]}