{"id":"306266196_The_Effect_of_Occupational_Gender_Stereotypes_on_Men's_Interest_in_Female-Dominated_Occupations","abstract":"A great deal of research has sought to explain women’s lower interest in male-dominated occupations, but relatively little attention has been given to explaining men’s disinterest in female-dominated occupations. Examining factors that affect men’s interest in female-dominated occupations has both theoretical and practical implications. Two factors hypothesized to alter the gender-stereotype salience of an occupation were examined: occupation titles and gender-stereotyped occupation descriptions. We hypothesized that men who reported higher levels of stereotypical feminine attributes would be more interested in feminine-stereotyped occupations. College-aged participants (N = 1001, 791 male) enrolled in an engineering, computer science, or physics course recorded their interest in occupations with or without a feminine title and described with either feminine or masculine stereotyped skills and attributes. Participants also reported the degree to which they held stereotypical feminine attributes. Results indicated that men showed greater interest in no-title occupations, especially when masculine characteristics were used in the description. For men, self-reported levels of feminine attributes were associated with interest in occupations with feminine descriptions, primarily in the no-title condition. Women expressed more interested than did men in the occupations, but unlike men, women were equally interested in occupations with feminine and masculine descriptions. Findings are consistent with the theories of precluded interest (Cheryan 2010) and circumscription and compromise (Gottfredson 1981). It is concluded that a key for attracting men to female-dominated vocations may be to provide opportunities for men to consider an occupation in ways that prevent or disrupt comparison to traditional stereotypic archetypes.","authors":["J. Andrew Forsman","Joan M Barth"],"meta":["April 2017Sex Roles 76(7-8)","DOI:10.1007/s11199-016-0673-3"],"references":["297790788_The_Influence_of_Romantic_Partners_on_Women_in_STEM_Majors","282479573_Are_You_Man_Enough_to_be_a_Nurse_The_Impact_of_Ambivalent_Sexism_and_Role_Congruity_on_Perceptions_of_Men_and_Women_in_Nursing_Advertisements","282433629_Gender_differences_in_STEM_undergraduates'_vocational_interests_People-thing_orientation_and_goal_affordances","313570385_Circumscription_and_compromise_a_developmental_theory_of_occupational_aspirations","288011378_Of_Men_Women_and_Motivation_A_Role_Congruity_Account","285350183_Men_in_female-dominated_fields_Trends_and_turnover","282895433_Untangling_Life_Goals_and_Occupational_Stereotypes_in_Men's_and_Women's_Career_Interest","281391273_Manning_Up","276086950_Men_in_Female-Dominated_Vocations_a_Rationale_for_Academic_Study_and_Introduction_to_the_Special_Issue","275998577_Sex_Differences_in_Social_Behavior_A_Social-Role_Interpretation","264866026_Evidence_for_the_Social_Role_Theory_of_stereotype_content_Observations_of_groups'_roles_shape_stereotypes","258153893_Cultural_Diversity_in_the_Workplace_The_State_of_the_Field","258143669_Gendered_educational_and_occupational_choices_Applying_the_Eccles_et_al_model_of_achievement-related_choices","254900106_Stereotypes_as_Dynamic_Constructs_Women_and_Men_of_the_Past_Present_and_Future","247770170_Occupational_Gender_Stereotypes_Is_the_Ratio_of_Women_to_Men_a_Powerful_Determinant"]}