{"id":"306276278_Solar_Farm_Suitability_Using_Geographic_Information_System_Fuzzy_Sets_and_Analytic_Hierarchy_Processes_Case_Study_of_Ulleung_Island_Korea","abstract":"Solar farm suitability in remote areas will involve a multi-criteria evaluation (MCE) process,particularly well suited for the geographic information system (GIS) environment. Photovoltaic (PV)solar farm criteria were evaluated for an island-based case region having complex topographic andregulatory criteria, along with high demand for low-carbon local electricity production: UlleungIsland, Korea. Constraint variables that identified areas forbidden to PV farm development wereconsolidated into a single binary constraint layer (e.g., environmental regulation, ecological protection,future land use). Six factor variables were selected as influential on-site suitability within thegeospatial database to seek out increased annual average power performance and reduced potentialinvestment costs, forming new criteria layers for site suitability: solar irradiation, sunshine hours,average temperature in summer, proximity to transmission line, proximity to roads, and slope. Eachfactor variable was normalized via a fuzzy membership function (FMF) and parameter setting basedon the local characteristics and criteria for a fixed axis PV system. Representative weighting ofthe relative importance for each factor variable was assigned via pairwise comparison completedby experts. A suitability index (SI) with six factor variables was derived using a weighted fuzzysummation method. Sensitivity analysis was conducted to assess four differentSIbased on thedevelopment scenarios (i.e., the combination of factors being considered). From the resulting map,three highly suitable regions were suggested and validated by comparison with satellite images toconfirm the candidate sites for solar farm development. The GIS-MCE method proposed can alsobe applicable widely to other PV solar farm site selection projects with appropriate adaption forlocal variables.","authors":["Jangwon Suh","Jeffrey R. S. Brownson"],"meta":["August 2016Energies 9(8):648","DOI:10.3390/en9080648"],"references":["294120045_Analysis_of_the_Potential_for_Use_of_Floating_Photovoltaic_Systems_on_Mine_Pit_Lakes_Case_Study_at_the_Ssangyong_Open-Pit_Limestone_Mine_in_Korea","281287312_An_automated_model_for_rooftop_PV_systems_assessment_in_ArcGIS_using_LIDAR","273862339_Best_Practices_Handbook_for_the_Collection_and_Use_of_Solar_Resource_Data_for_Solar_Energy_Applications","272943304_Temperature_Dependent_Power_Modeling_of_Photovoltaics","281854530_100_Electric_power_potential_of_PV_wind_power_and_biomass_energy_in_Awaji_island_Japan","277982214_Design_of_photovoltaic_systems_to_power_aerators_for_natural_purification_of_acid_mine_drainage","273159235_Regional_Scale_wind_farm_and_solar_farm_suitability_assessment_using_GIS-assisted_multi-criteria_evaluation","270831829_GIS-based_solar_farms_site_selection_using_analytic_hierarchy_process_AHP_in_Karapinar_region_KonyaTurkey","260255585_GIS-based_photovoltaic_solar_farms_site_selection_using_ELECTRE-TRI_Evaluating_the_case_for_Torre_Pacheco_Murcia_Southeast_of_Spain","259220407_Solar_Energy_Conversion_Systems"]}