{"id":"306226443_The_Topology_of_the_Cosmic_Web_in_Terms_of_Persistent_Betti_Numbers","abstract":"We introduce a multiscale topological description of the Megaparsec weblike cosmic matter distribution. Betti numbers and topological persistence offer a powerful means of describing the rich connectivity structure of the cosmic web and of its multiscale arrangement of matter and galaxies. Emanating from algebraic topology and Morse theory, Betti numbers and persistence diagrams represent an extension and deepening of the cosmologically familiar topological genus measure, and the related geometric Minkowski functionals. In addition to a description of the mathematical background, this study presents the computational procedure for computing Betti numbers and persistence diagrams for density field filtrations. The field may be computed starting from a discrete spatial distribution of galaxies or simulation particles. The main emphasis of this study concerns an extensive and systematic exploration of the imprint of different weblike morphologies and different levels of multiscale clustering in the corresponding computed Betti numbers and persistence diagrams. To this end, we use Voronoi clustering models as templates for a rich variety of weblike configurations, and the fractal-like Soneira-Peebles models exemplify a range of multiscale configurations. We have identified the clear imprint of cluster nodes, filaments, walls, and voids in persistence diagrams, along with that of the nested hierarchy of structures in multiscale point distributions. We conclude by outlining the potential of persistent topology for understanding the connectivity structure of the cosmic web, in large simulations of cosmic structure formation and in the challenging context of the observed galaxy distribution in large galaxy surveys.","authors":["Pratyush Pranav","Herbert Edelsbrunner","Rien van de Weygaert","Gert Vegter"],"meta":["August 2016Monthly Notices of the Royal Astronomical Society 465(4)","DOI:10.1093/mnras/stw2862","Projects: Topology of the Cosmic Microwave BackgroundTopology of the Cosmic mass distribution"],"references":["280773590_Felix_A_Topology_Based_Framework_for_Visual_Exploration_of_Cosmic_Filaments","267015636_Computational_Topology_An_Introduction","347329634_The_Large-Scale_Structure_of_the_Universe","318494472_Spatial_tessellations_concepts_and_applications_of_Voronoi_diagrams","313666913_Novi_Commentarii_Academiae_Petropolitanae","290216824_Froth_Across_the_Universe","285521096_Persistent_homology_-_a_survey","273734008_The_topology_of_the_large-scale_structure_of_the_universe","267121438_Geometry_and_Topology_for_Mesh_Generation","266656532_Gromov-Hausdorff_Approximation_of_Filamentary_Structures_Using_Reeb-Type_Graphs"]}