{"id":"306260678_Multifidelity_Optimization_using_Statistical_Surrogate_Modeling_for_Non-Hierarchical_Information_Sources","abstract":"Designing and optimizing complex systems often requires numerous evaluations of a quantity of interest. This is typically achieved by querying potentially expensive numerical models in an optimization process. To alleviate the cost of optimization, surrogate models can be used in lieu of the original model, as they are cheaper to evaluate. In addition, different information sources with varying fidelity, such as numerical models, experimental results or historical data may be available to estimate the quantity of interest. This work proposes a strategy to adaptively construct and exploit a multifidelity surrogate when multiple information sources of varying fidelity are available. One of the distinguishing features of the proposed approach is the relaxation of the common assumption of hierarchical relationships among information sources. This is achieved by endowing the surrogate representation with uncertainty functions that can vary across the design space; this uncertainty quantifies the fidelity of the underlying information source. The resulting multifidelity surrogate is used in an optimization setting to identify the next design to evaluate, as well as to select the information sources with which to perform the evaluation, based on information source evaluation cost and fidelity. For an aerodynamic design ex- ample, the proposed strategy leverages multifidelity information to reduce the number of evaluations of the expensive information source needed during the optimization.","authors":["Remi Lam","Douglas L. Allaire","Karen E. Willcox"],"meta":["January 2015","DOI:10.2514/6.2015-0143","Conference: 56th AIAA/ASCE/AHS/ASC Structures, Structural Dynamics, and Materials Conference"],"references":["259176817_A_Rational_Design_Approach_to_Gaussian_Process_Modeling_for_Variable_Fidelity_Models","248336865_Viscous-Inviscid_Analysis_of_Transonic_and_Low_Reynolds_Number_Airfoils","245430504_Multifidelity_Design_Optimization_of_Low-Boom_Supersonic_Jets","235994182_XFOIL_An_Analysis_and_Design_System_for_Low_Reynolds_Number_Airfoils","269786270_Wing_Optimization_Using_Design_of_Experiment_Response_Surface_and_Data_Fusion_Methods","265732272_Multifidelity_approaches_for_optimization_under_uncertainty","259176825_Multiresponse_Metamodeling_in_Simulation-Based_Design_Applications","258569156_Provably_Convergent_Multifidelity_Optimization_Algorithm_Not_Requiring_High-Fidelity_Derivatives","245992758_Elucient_global_optimization_of_expensive_black-box_functions","238592294_Trading_risk_and_performance_for_engineering_design_optimization_using_multifidelity_analyses"]}