{"id":"306373995_Realistic_Offloading_Scheme_for_Mobile_Cloud_Computing","abstract":"Nowadays, smartphone devices have become very important in our daily life. We carry them everywhere and anytime. This strong dependency has encouraged mobile application developers to develop a wide variety of mobile applications. However, the limitations of smartphone hardware, such as limited processing capacity and limited battery life have become a barrier in front of apps developers. On the other hand, cloud computing is changing the style of delivering IT services. Mobile cloud computing uses the cloud to overcome the mobile device limitations. Many works have been conducted to extend mobile capabilities by offloading intensive application codes to the cloud. However, they did not consider realistic data that dynamically changing in user environment such as processors load, battery level, network bandwidth, etc. in offloading decision. Therefore, this paper aims to propose a new approach that uses realistic data from the user real environment to decide at runtime whether to offload code or not. Our experimental results show that our approach reduces the execution time and battery consumption compared to other approaches that do not take into consideration mobile device condition data.","authors":["Hamid Jadad","Abderezak Touzene","Nasser Alzeidi","Khaled Day"],"meta":["August 2016Lecture Notes in Computer Science","DOI:10.1007/978-3-319-44215-0_7","Conference: 13th International Conference, MobiWIS 2016, Vienna, Austria, August 22-24, 2016, ProceedingsAt: Vienna, AustriaVolume: 9847"],"references":["286836678_Extending_Mobile_Device's_Battery_Life_by_Offloading_Computation_to_Cloud","280826513_A_Context_Sensitive_Offloading_Scheme_for_Mobile_Cloud_Computing_Service","265984996_CRYPTALL_System_to_encrypt_all_types_of_data","264624667_The_rise_of_Big_Data_on_cloud_computing_Review_and_open_research_issues","262116090_Cloud_Computing_Applications_for_Smart_Grid_A_Survey","278049542_Architectural_Tactics_for_Cyber-Foraging_Results_of_a_Systematic_Literature_Review","269304872_Computational_Offloading_or_Data_Binding_Bridging_the_Cloud_Infrastructure_to_the_Proximity_of_the_Mobile_User","269302626_A_semi-Markovian_decision_process_based_control_method_for_offloading_tasks_from_mobile_devices_to_the_cloud","260348529_COFA_Automatic_and_Dynamic_Code_Offload_for_Android","257013848_Mobile_Cloud_Computing_A_survey"]}