{"id":"306376872_Energy-Efficient_Cooperative_Network_Coding_With_Joint_Relay_Scheduling_and_Power_Allocation","abstract":"The energy efficiency (EE) of a multi-user multi-relay system with the maximum diversity network coding (MDNC) is studied. We explicitly find the connection among the outage probability, energy consumption and EE and formulate the maximizing EE problem under the outage probability constraints. Relay scheduling (RS) and power allocation (PA) are applied to schedule the relay states (transmitting, sleeping, \\emph{etc}) and optimize the transmitting power under the practical channel and power consumption models. Since the optimization problem is NP-hard, to reduce computational complexity, the outage probability is first tightly approximated to a log-convex form. Further, the EE is converted into a subtractive form based on the fractional programming. Then a convex mixed-integer nonlinear problem (MINLP) is eventually obtained. With a generalized outer approximation (GOA) algorithm, RS and PA are solved in an iterative manner. The Pareto-optimal curves between the EE and the target outage probability show the EE gains from PA and RS. Moreover, by comparing with the no network coding (NoNC) scenario, we conclude that with the same number of relays, MDNC can lead to EE gains. However, if RS is implemented, NoNC can outperform MDNC in terms of the EE when more relays are needed in the MDNC scheme.","authors":["Nan Qi","Ming Xiao","Theodoros Tsiftsis","Mikael Skoglund"],"meta":["August 2016IEEE Transactions on Communications 64(11)","DOI:10.1109/TCOMM.2016.2602830"],"references":["272676659_Is_Analog_Network_Coding_more_energy_efficient_than_TDMA","302552868_Nonlinear_and_Mixed-Integer_Optimization_Fundamentals_and_Applications","297608928_A_Joint_Relay-and-Antenna_Selection_Scheme_in_Energy_Harvesting_MIMO_Relay_Networks","296480684_Energy-Efficient_Relay_Selection_of_Cooperative_HARQ_Based_on_the_Number_of_Transmissions_Over_Rayleigh_Fading_Channels","286561763_Maximizing_energy_efficiency_in_analog_network_coding_based_two-way_relay-assisted_system","276906504_A_Joint_Antenna_and_Path_Selection_Technique_in_Single_Relay_Based_DF_Cooperative_MIMO_Networks","276405951_ANC-ERA_Random_Access_for_Analog_Network_Coding_in_Wireless_Networks","269328142_Outage_and_energy_efficiency_tradeoff_for_multi-flow_cooperative_communication_systems","264916129_Network_Coding_Theory","261420692_Energy_Minimization_in_Cooperative_Relay_Networks_with_Sleep_Modes"]}