{"id":"306381338_European_mobile_markets_and_the_doctrine_of_4_networks_good_3_networks_bad","abstract":"Purpose\nIn light of the recent European Commission decisions that clearly favour the maintenance of a four-network structure in European mobile markets, the purpose is to provide an empirical examination of the case for and against such a structure.\n\nDesign/methodology/approach\nA table of concentration ratios in 35 sample European markets is constructed and is followed by a detailed analysis of all relevant merger/takeover cases since 2012. These are then used to provide a general analysis of the desirability of further consolidation in the European mobile sector.\n\nFindings\nAlthough the relevant investigatory bodies claim to have made out a watertight case for the maintenance of existing structures, the paper explains why these claims should be met with some scepticism, especially in light of the development of “quad-play” in all markets.\n\nResearch limitations/implications\nWhen a decision is made on a market structure, it is pointless to pursue the “but what if?” alternatives any further. However, it should be possible in a few years’ time to assess whether the Commission’s predictions have come to pass.\n\nOriginality/value\nAs the UK decision has only just been delivered, the only commentary so far has had a narrow focus, whereas this paper seeks to provide useful and relevant background data about the structure of markets and technological developments.","authors":["Peter Curwen","Jason Whalley"],"meta":["August 2016Info 18(5):1-23","DOI:10.1108/info-05-2016-0021"],"references":["257162670_Incumbency_and_market_share_within_European_mobile_telecommunication_networks","235302320_Third_time_lucky_An_exploration_of_Hutchison_Whampoa's_involvement_in_the_mobile_telecommunications_industry","297735985_The_tangled_web_of_mobile_telecommunication_mergers_Hutchison_Whampoa_Telefonica_and_BT","280764635_The_ATTT-Mobile_USA_takeover_and_its_implications_for_consolidation_of_mobile_markets","276442855_The_licensing_of_mobile_operators_in_European_markets_and_the_consequences_of_new_entry_for_competition"]}