{"id":"306370590_The_graphical_security_system_by_using_CaRP","abstract":"Now a days, there are many security systems are used for different security purposes. The text based passwords are widely used for authentication in many internet applications. But the text password is insecure for a variety of reasons. For example, users tend to pick passwords that can be easily guessed. On the other hand, if a password is hard to guess, then it is often hard to remember. Due to this reasons, the graphical password is the one best alternative for text based password. In this paper Captcha technology with the graphical password is introduced which increases the security. Captcha is the Completely Automated Public Turing test which tells the Computers and Humans Apart. Captcha is an image or a program that protects websites from bots that is computer generated program. Here graphical password system is built on top of Captcha technology, which is named as Captcha as graphical passwords (CaRP). CaRP is the combination of both graphical password and Captcha. CaRP system takes the advantages of both Captcha and the graphical password. It avoids the many security problems altogether. The problems like as shoulder-surfing attacks, relay attacks, online guessing attacks, etc. CaRP also overcome the disadvantages of graphical password system. Image hotspot problem is the well-known problem in graphical password system that is avoided in CaRP system. CaRP offers reasonable security and the usability it appears to fit well with same practical applications for improving online security.","authors":["Pooja Jaiprakash Kulkarni","G. M. Malwatkar"],"meta":["October 2015","DOI:10.1109/ICESA.2015.7503319","Conference: 2015 International Conference on Energy Systems and Applications"],"references":["264292176_Captcha_as_Graphical_Passwords-A_New_Security_Primitive_Based_on_Hard_AI_Problems","221609266_Attacks_and_design_of_image_recognition_CAPTCHAs","220271810_Computers_beat_Humans_at_Single_Character_Recognition_in_Reading_based_Human_Interaction_Proofs_HIPs","220181213_On-line_and_off-line_handwriting_recognition_a_comprehensive_survey_IEEE_Trans_Pattern_Anal_Mach_Intell_T-PAMI","2904347_Securing_Passwords_Against_Dictionary_Attacks","225193580_Graphical_Password_Authentication_Using_Cued_Click_Points","224236782_Revisiting_Defenses_against_Large-Scale_Online_Password_Guessing_Attacks","221609837_Machine_learning_attacks_against_the_asirra_CAPTCHA","221609430_A_low-cost_attack_on_a_microsoft_CAPTCHA","221609049_Do_background_images_improve_draw_a_secret_graphical_passwords","221348053_CAPTCHA_using_hard_AI_problems_for_security","221260513_On_User_Choice_in_Graphical_Password_Schemes","220593683_On_countering_online_dictionary_attacks_with_login_histories_and_humans-in-the-loop","4238349_Cognitive_authentication_schemes_safe_against_spyware","4022942_Recognizing_objects_in_adversarial_clutter_breaking_a_visual_CAPTCHA","2858512_Telling_Humans_and_Computers_Apart_Automatically","2243582_D_ej_a_Vu_A_User_Study_Using_Images_for_Authentication"]}