{"id":"306376722_The_ground_truth_about_metadata_and_community_detection_in_networks","abstract":"Across many scientific domains, there is common need to automatically extract a simplified view or a coarse-graining of how a complex system's components interact. This general task is called community detection in networks and is analogous to searching for clusters in independent vector data. It is common to evaluate the performance of community detection algorithms by their ability to find so-called \\textit{ground truth} communities. This works well in synthetic networks with planted communities because such networks' links are formed explicitly based on the planted communities. However, there are no planted communities in real world networks. Instead, it is standard practice to treat some observed discrete-valued node attributes, or metadata, as ground truth. Here, we show that metadata are not the same as ground truth, and that treating them as such induces severe theoretical and practical problems. We prove that no algorithm can uniquely solve community detection, and we prove a general No Free Lunch theorem for community detection, which implies that no algorithm can perform better than any other across all inputs. However, node metadata still have value and a careful exploration of their relationship with network structure can yield insights of genuine worth. We illustrate this point by introducing two statistical techniques that can quantify the relationship between metadata and community structure for a broad class models. We demonstrate these techniques using both synthetic and real-world networks, and for multiple types of metadata and community structure.","authors":["Leto Peel","Daniel B. Larremore","Aaron Clauset"],"meta":["August 2016Science Advances 3(5)","DOI:10.1126/sciadv.1602548"],"references":["308107264_Detectability_of_small_communities_in_multilayer_and_temporal_networks_Eigenvector_localization_layer_aggregation_and_time_series_discretization","308043637_Network_Structure_Metadata_and_the_Prediction_of_Missing_Nodes_and_Annotations","305779642_A_Comparative_Analysis_of_Community_Detection_Algorithms_on_Artificial_Networks","301879506_Network_structure_metadata_and_the_prediction_of_missing_nodes","344526821_The_Collegial_Phenomenon","344125515_Defining_and_evaluating_network_communities_based_on_ground-truth","328376171_Communities_of_interest","326405073_Collegial_Phenomenon_The_Social_Mechanisms_of_Cooperation_Among_Peers_in_a_Corporate_Law_Partnership_Introduction","313742304_An_impossibility_theorem_for_clustering","308746835_Non-backtracking_Spectrum_of_Random_Graphs_Community_Detection_and_Non-regular_Ramanujan_Graphs"]}