{"id":"306362494_An_analysis_of_young_students'_thinking_when_completing_basic_coding_tasks_using_Scratch_Jnr_On_the_iPad_General_thinking_and_computational_work","abstract":"Recent government moves in many countries have seen coding included in school curricula, or promoted as part of computing, mathematics or science programmes. While these moves have generally been associated with a need to engage more young people in technology study, research has hinted at possible benefits from learning to program including fostering general thinking skills. However, little research has been carried out exploring these ideas. This study analysed data collected while 5- and 6-year-old students in a New Zealand primary school were using Scratch Jnr. to learn about basic shapes, as part of a numeracy topic. Analysis combined Brennan and Resnick's (2012) computational thinking skills framework and Krathwohl's (2002) revision of Bloom's Taxonomy to evaluate any role general thinking skills played in these students' coding work. Results suggest including basic coding in primary curricula provides teachers with an effective means of exercising their students' general and higher order thinking skills. They build on Brennan and Resnick's (2012) framework by including conceptualization as an important element in students' computational work and highlight the role of predictive thinking in debugging code. Findings support historical arguments that more needs to be done to investigate students' cognitive processes when undertaking computational work.","authors":["G. Falloon"],"meta":["August 2016Journal of Computer Assisted Learning 32(6)","DOI:10.1111/jcal.12155"],"references":["316988959_iPads_apps_and_student_thinking_skill_development","307981642_Supporting_future-oriented_learning_teaching_A_New_Zealand_perspective","272240026_What's_the_difference_Learning_collaboratively_using_iPads_in_conventional_classrooms","265797241_New_frameworks_for_studying_and_assessing_the_development_of_computational_thinking","307981788_Innovative_Learning_Environments","307981670_Schools_redesigned_Towards_innovative_learning_systems_educational_research_and_innovation","266562898_Review_on_teaching_and_learning_of_computational_thinking_through_programming_What_is_next_for_K-12","262404862_Modeling_the_learning_progressions_of_computational_thinking_of_primary_grade_students","262399549_Computational_thinking_in_educational_activities_An_evaluation_of_the_educational_game_Light-Bot","262397303_Promoting_computational_thinking_with_programming"]}