{"id":"306396228_Building_IS_Professionals_through_a_Real-World_Client_Project_in_a_Database_Application_Development_Course","abstract":"Information systems curricula are increasingly using active learning methodologies to help students learn through technology rather than just about technology. While one way to achieve this is through the assignment of semester-long projects, previous research suggests that real-world projects provide more meaningful experiences and prepare expected graduates for careers that will rely on both their technical and professional skills. Additionally, providing opportunities for both competition and collaboration spur the motivation of students while enabling them to practice the necessary professional skills employers are seeking. This paper reports on a database application development course, taught for the past three years, where the instructor has partnered with a different community business or nonprofit organization in need of an information system to convert existing spreadsheet data into a relational database for more accurate data entry and improved reporting. Student teams engage in both competition and collaboration through system development phases to deliver a database solution to an authentic client using Microsoft Access. As a result, students develop both technical and professional skills through this client project experience.","authors":["Rj Podeschi"],"meta":["November 2016Journal of Information Systems Education 14(6):34","Project: Building I.S. Professionals through a Real-World Client Project in a Database Application Development Course"],"references":["285848338_Learning_Through_Collaboration_and_Competition_Incorporating_Problem-Based_Learning_and_Competition-Based_Learning_in_a_Capstone_Course","265116597_A_Constructivist-Based_Approach_to_Teaching_Database_Analysis_and_Design","235701029_Experiential_Learning_Experience_As_The_Source_Of_Learning_And_Development","2337963_Database_Theory_In_Practice_Learning_From_Cooperative_Group_Projects","286939274_Educating_IT_Project_Managers_through_Project-Based_Learning_A_Working-Life_Perspective","233231186_Real-World_versus_Simulated_Projects_in_Database_Instruction","31597135_A_Constructivist_Approach_to_Information_Systems_Teaching_A_Case_Study_on_a_Design_Course_for_Advanced-Level_University_Students"]}