{"id":"306343010_Developing_soft_skills_also_known_as_pervasive_skills_Usefulness_of_an_educational_game","abstract":"Purpose\n\nThe purpose of this paper is to evaluate the usefulness of an educational game to develop soft skills (also known as pervasive skills), from the perspectives of three groups of role-players (student participants, student committee members and employer companies). The game was designed to provide students with the opportunity to develop soft skills and to determine whether students applied the pervasive skills required by the South African Institute of Chartered Accountants.\n\nDesign/methodology/approach\n\nAction research was conducted according to a parallel convergent mixed-method research design. Both qualitative and quantitative data were gathered using questionnaires and focus group interviews to determine the usefulness of the educational game.\n\nFindings\n\nAll three groups perceived the educational game to be effective in requiring students to apply the full spectrum of soft/pervasive skills. Although all the pervasive skills were perceived to be present in the game, teamwork, communication (listening and verbal) and time management skills were perceived to be most prominent, while written communication, professionalism and ethical awareness were found to be less prominent. Overall, this game can be recommended as an effective and innovative teaching method that can positively contribute to the pervasive skills development of accounting students.\n\nOriginality/value\n\nThe need to deliver well-rounded accounting graduates demonstrating core technical and soft skills (or pervasive skills and competencies) calls for new and innovative teaching methods. Accounting educators and programmes are continuously challenged regarding which methods to apply to meet these outcomes and substantiate their usefulness.","authors":["Herman Albertus Viviers","Jaco Fouche","Gerda Reitsma"],"meta":["August 2016","DOI:10.1108/MEDAR-07-2015-0045"],"references":["334717893_Student_perceptions_regarding_the_new_training_programme_for_chartered_accountants","334692032_Education_programmes'_responsibilities_regarding_pervasive_skills","330600538_Teaching_pervasive_skills_to_South_African_accounting_students","346014925_A_research-based_approach_to_generic_graduate_attributes_policy","321200812_A_Renewed_Call_for_Change_in_Accounting_Education_Practices","317953655_Designing_and_conducting_mixed_methods_research","313500727_Information_collection_Interviewing","312625970_Data_collection_strategies_in_mixed_methods_research","301263091_Food_Science_Education_Research_and_Professional_Development","298341798_Using_Collaborative_Learning_Exercises_To_Transfer_Pervasive_Skills_Some_South_African_Evidence"]}