{"id":"306389644_Research_Trends_in_Massive_Open_Online_Course_MOOC_Theses_and_Dissertations_Surfing_the_Tsunami_Wave","abstract":"Massive Open Online Courses (MOOCs) have attracted a great deal of attention by higher education and private enterprises. MOOCs have evolved considerably since their emergence in 2008, all the while given rise to academic discussions on MOOC impact, design and reach. In an effort to understand MOOCs more comprehensively, this study analyzes theses and dissertations (N = 51) related to MOOCs and published between 2008 and 2015, identifying research trends from these academic documents. Theses and dissertations within this research scope were gathered through a comprehensive search in multiple academic databases. For the purposes of the study, the research employed a systematic review approach. In order to reveal trends in research themes, emphasize theoretical/conceptual backgrounds, research designs and models, first a document analysis was used to collect data and this was followed by a content analysis. Our research findings indicate that MOOC research is generally derived from education, engineering and computer science, as well as information and communication technology related disciplines. Qualitative methodology linked to a case study research model is most common, and the theoretical/conceptual backgrounds are usually distance education related. Remarkably, nearly half of the studies didn’t benefit from any theoretical or conceptual perspectives. In sum, this study presents an evaluation regarding research trends derived from MOOC theses and dissertations, and provides directions for future MOOC research.","authors":["Aras Bozkurt","Nilgün Özdamar Keskin","Inge De Waard"],"meta":["August 2016Open Praxis 8(3)","DOI:10.5944/openpraxis.8.3.287"],"references":["335723712_Satisfaction_preferences_and_problems_of_a_MOOC_participants","303944897_Mapping_research_trends_from_35_years_of_publications_in_Distance_Education","296619400_A_Systematic_Analysis_and_Synthesis_of_the_Empirical_MOOC_Literature_Published_in_2013-2015","292185780_Research_Trends_in_Turkish_Distance_Education_A_Content_Analysis_of_Dissertations_1986-2014","284023691_Preparing_for_the_digital_university_a_review_of_the_history_and_current_state_of_distance_blended_and_online_learning","281369551_Meta-analysis_of_the_research_about_MOOC_during_2013-2014","292779771_'An_introduction_to_Systematic_Reviews'","287578722_Characteristics_of_massive_open_online_courses_MOOCS_A_research_review_2009-2012","284626319_Massive_open_online_courses_Innovation_in_education","280645955_Systematic_Reviews_in_the_Social_Sciences_A_Practical_Guide"]}