{"id":"306362965_Neuromelanin_Imaging_and_Dopaminergic_Loss_in_Parkinson's_Disease","abstract":"Parkinson's disease (PD) is a progressive neurodegenerative disorder in which the major pathologic substrate is a loss of dopaminergic neurons from the substantia nigra. Our main objective was to determine the correspondence between changes in the substantia nigra, evident in neuromelanin and iron sensitive magnetic resonance imaging (MRI), and dopaminergic striatal innervation loss in patients with PD. Eighteen patients and 18 healthy control subjects were included in the study. Using neuromelanin-MRI, we measured the volume of the substantia nigra and the contrast-to-noise-ratio between substantia nigra and a background region. The apparent transverse relaxation rate and magnetic susceptibility of the substantia nigra were calculated from dual-echo MRI. Striatal dopaminergic innervation was measured as density of dopamine transporter (DAT) by means of single-photon emission computed tomography and [123I] N-ω-fluoropropyl-2b-carbomethoxy-3b-(4-iodophenyl) tropane. Patients showed a reduced volume of the substantia nigra and contrast-to-noise-ratio and both positively correlated with the corresponding striatal DAT density. The apparent transverse relaxation rate and magnetic susceptibility values of the substantia nigra did not differ between patients and healthy controls. The best predictor of DAT reduction was the volume of the substantia nigra. Clinical and imaging correlations were also investigated for the locus coeruleus. Our results suggest that neuromelanin-MRI can be used for quantifying substantia nigra pathology in PD where it closely correlates with dopaminergic striatal innervation loss. Longitudinal studies should further explore the role of Neuromelanin-MRI as an imaging biomarker of PD, especially for subjects at risk of developing the disease.","authors":["Ioannis Ugo Isaias","Paula Trujillo Diaz","Paul Summers","Giorgio Marotta"],"meta":["August 2016Frontiers in Aging Neuroscience 8(179)","DOI:10.3389/fnagi.2016.00196"],"references":["279970138_Brain_iron_deposition_in_Parkinson's_disease_imaged_using_the_PRIME_magnetic_resonance_sequence","273779422_Histologic_Validation_of_Locus_Coeruleus_MRI_Contrast_in_Post-mortem_Tissue","273638794_Dorsolateral_nigral_hyperintensity_on_30T_susceptibility-weighted_imaging_in_neurodegenerative_Parkinsonism","273157146_A_Multicontrast_Approach_for_Comprehensive_Imaging_of_Substantia_Nigra","272747004_Quantifying_Brain_Iron_Deposition_in_Patients_with_Parkinson's_Disease_Using_Quantitative_Susceptibility_Mapping_R2_and_R2","272676673_Automated_Neuromelanin_Imaging_as_a_Diagnostic_Biomarker_for_Parkinson's_Disease","266748302_7_Tesla_Magnetic_Resonance_Imaging_A_Closer_Look_at_Substantia_Nigra_Anatomy_in_Parkinson's_Disease","265644709_The_role_of_iron_in_brain_ageing_and_neurodegenerative_disorders","264430571_Simultaneous_Imaging_of_Locus_Coeruleus_and_Substantia_Nigra_with_a_Quantitative_Neuromelanin_MRI_Approach","263323827_Imaging_insights_into_basal_ganglia_function_Parkinson's_disease_and_dystonia"]}