{"id":"306378094_ReNoVatE_Recovery_from_Node_Failure_in_Virtual_Network_Embedding","abstract":"Network virtualization (NV) has evolved as a key enabling technology for offering the next generation network services. Recently, it is being rolled out in data center networks as a means to provide bandwidth guarantees to cloud applications. With increasing deployments of virtual networks (VNs) in commercial-grade networks with commodity hardware, VNs need to tackle failures in the underlying substrate network. In this paper, we study the problem of recovering a batch of VNs affected by a substrate node failure. The combinatorial possibilities of alternate embeddings of the failed virtual nodes and links of the VNs makes the task of finding the most efficient recovery both non-trivial and intractable. Furthermore, any recovery approach ideally should not cause any service disruption for the unaffected parts of the VNs. We take into account these issues to design a recovery approach for maximizing recovery and minimizing the cost of recovery and network disruption. We provide an Integer Linear Programming (ILP) formulation of our recovery scheme. We also propose a fast and scalable heuristic algorithm to tackle the computational complexity of the ILP solution. Evaluation results demonstrate that our heuristic performs close to the optimal solution and outperforms the state-of-the-art algorithm.","authors":["Nashid Shahriar","Reaz Ahmed","Aimal Khan","Shihabur Rahman Chowdhury"],"meta":["October 2016","DOI:10.1109/CNSM.2016.7818396","Conference: 12th International Conference on Network and Service Management (CNSM 2016)","Project: Transport SDN Virtualization"],"references":["303695606_Dedicated_Protection_for_Survivable_Virtual_Network_Embedding","301716078_Multi-Path_Link_Embedding_for_Survivability_in_Virtual_Networks","297713786_Connectivity-aware_Virtual_Network_Embedding","287489984_SiMPLE_Survivability_in_multi-path_link_embedding","286321828_Protecting_virtual_networks_with_DRONE","269298284_Venice_Reliable_virtual_data_center_embedding_in_clouds","312535209_On_the_single-source_unsplittable_flow_problem","306217986_Volley_Automated_data_placement_for_geo-distributed_cloud_services","283751644_Efficient_joint_approaches_for_location-constrained_survivable_virtual_network_embedding","283435412_A_batch_approach_for_a_survivable_virtual_network_embedding_based_on_Monte-Carlo_Tree_Search"]}