{"id":"306302164_Operating_Monitoring_and_Fault_Types_Classification_for_Motors_through_Vibration_Signal","abstract":"An operating monitoring combined with fault types classification system for motors by vibration signal is proposed in this paper. The main purpose is to develop vibration detection as the core of the motor operating status analysis system, and uses international standards including both ISO 10816 and NEMA MG-1, together with spectrum analysis to assess the degree of risk in the operation state of different vibration characteristics. The proposed prototype was devised and verified through onsite experimentation. Four artificial types of faults are made based on the literature survey for the most common fault types of motors, including the turn-to-turn fault of a stator coil, rotor bar breaking, bearing outer race breakage, and eccentric misalignment. Comparing the results to commercial tools showed similar spectral characteristics. Moreover, the experimental results shows promising ability and feasibility for online detection of motor's abnormal operation which could greatly assist operation and maintenance personnel to reduce the probability of a major accident.","authors":["Jheng-Lun Jiang","Hong-Chan Chang","Cheng-Chien Kuo"],"meta":["July 2016","DOI:10.1109/IS3C.2016.26","Conference: 2016 International Symposium on Computer, Consumer and Control (IS3C)"],"references":["261420989_Neural_approach_for_bearing_fault_detection_in_three_phase_induction_motors","295368438_Research_on_feature_extraction_of_shaft_orbit_for_rotating_machine","286706096_An_approach_for_fault_detection_and_diagnosis_of_rotating_electrical_machine_using_vibration_signal_analysis","260721636_Runout_Tracking_in_Electric_Motors_Using_Self-Mixing_Interferometry","236023354_Early_Classification_of_Bearing_Faults_Using_Morphological_Operators_and_Fuzzy_Inference","224371134_Improved_Resolution_of_the_MCSA_Method_Via_Hilbert_Transform_Enabling_the_Diagnosis_of_Rotor_Asymmetries_at_Very_Low_Slip"]}