{"id":"306530843_Phase-amplitude_coupling_at_the_organism_level_The_amplitude_of_spontaneous_alpha_rhythm_fluctuations_varies_with_the_phase_of_the_infra-slow_gastric_basal_rhythm","abstract":"A fundamental feature of the temporal organization of neural activity is phase-amplitude coupling between brain rhythms at different frequencies, where the amplitude of a higher frequency varies according to the phase of a lower frequency. Here, we show that this rule extends to brain-organ interactions. We measured both the infra-slow (~0.05 Hz) rhythm intrinsically generated by the stomach – the gastric basal rhythm – using electrogastrography, and spontaneous brain dynamics with magnetoencephalography during resting-state with eyes open. We found significant phase-amplitude coupling between the infra-slow gastric phase and the amplitude of the cortical alpha rhythm (10-11 Hz), with gastric phase accounting for 8% of the variance of alpha rhythm amplitude fluctuations. Gastric-alpha coupling was localized to the right anterior insula, and bilaterally to occipito-parietal regions. Transfer entropy, a measure of directionality of information transfer, indicates that gastric-alpha coupling is due to an ascending influence from the stomach to both the right anterior insula and occipito-parietal regions. Our results show that phase-amplitude coupling so far only observed within the brain extends to brain-viscera interactions. They further reveal that the temporal structure of spontaneous brain activity depends not only on neuron and network properties endogenous to the brain, but also on the slow electrical rhythm generated by the stomach.","authors":["Craig Richter","Mariana Babo-Rebelo","Denis pierre Schwartz","Catherine Tallon-Baudry"],"meta":["August 2016NeuroImage 146","DOI:10.1016/j.neuroimage.2016.08.043"],"references":["308992545_Is_the_cardiac_monitoring_function_related_to_the_self_in_both_the_default_network_and_right_anterior_insula","305687807_Neural_Responses_to_Heartbeats_in_the_Default_Network_Encode_the_Self_in_Spontaneous_Thoughts","283617630_Gamma_40-100_Hz_oscillation_in_the_hippocampus_of_the_behaving_rat","283617403_Neural_Cross-Frequency_Coupling_Connecting_Architectures_Mechanisms_and_Functions","282772488_Brain_Networks_and_Cognitive_Architectures","272515039_Resting-State_Temporal_Synchronization_Networks_Emerge_from_Connectivity_Topology_and_Heterogeneity","272296277_The_Brain's_Resting-State_Activity_is_Shaped_by_Synchronized_Cross-Frequency_Coupling_of_Oscillatory_Neural_Activity","306550546_The_action_potentials_of_the_stomach","288932286_Directional_Patterns_of_Cross_Frequency_Phase_and_Amplitude_Coupling_Within_the_Resting_State_Mimic_Patterns_of_fMRI_Functional_Connectivity","276006764_The_pairwise_phase_consistency_A_bias-free_measure_of_rhythmic_neuronal_synchronization"]}