{"id":"306523690_ePedigree_Traceability_System_for_the_Agricultural_Food_Supply_Chain_to_Ensure_Consumer_Health","abstract":"Sustainability relies on the environmental, social and economical systems: the three pillars of sustainability. The social sustainability mostly advocates the people’s welfare, health, safety, and quality of life. In the agricultural food industry, the aspects of social sustainability, such as consumer health and safety have gained substantial attention due to the frequent cases of food-borne diseases. The food-borne diseases due to the food degradation, chemical contamination and adulteration of food products pose a serious threat to the consumer’s health, safety, and quality of life. To ensure the consumer’s health and safety, it is essential to develop an efficient system which can address these critical social issues in the food distribution networks. This research proposes an ePedigree (electronic pedigree) traceability system based on the integration of RFID and sensor technology for real-time monitoring of the agricultural food to prevent the distribution of hazardous and adulterated food products. The different aspects regarding implementation of the proposed system in food chains are analyzed and a feasible integrated solution is proposed. The performance of the proposed system is evaluated and finally, a comprehensive analysis of the proposed ePedigree system’s impact on the social sustainability in terms of consumer health and safety is presented.","authors":["Umar Farooq","Wu Tao","Ganjar Alfian","Yong-Shin Kang"],"meta":["August 2016Sustainability 8(9):839","DOI:10.3390/su8090839","Projects: Development of RFID / USN Fusion Sensor Type Indicator-based Food Quality Monitoring and Intelligent Food Distribution Management SystemAgricultural Research Center (ARC), Programe of Ministry of Agriculture, Food and Rural Affairs, Korea."],"references":["262470162_Integration_of_RFID_into_Wireless_Sensor_Networks_Architectures_Opportunities_and_Challenging_Problems","319127196_Wireless_Sensor_Network","313795302_Perishable_food_and_cold-chain_management","312453789_Food_fraud_and_Economically_motivated_adulteration_of_food_and_food_ingredients","312434583_Shifting_paradigms_for_sustainable_development_implications_for_management_theory_and_research","305253204_RFID_and_Sensor_Network_Automation_in_the_Food_Industry_Ensuring_Quality_and_Safety_through_Supply_Chain_Visibility","288218611_The_triple_bottom_line_for_21st_century_business","284509476_Refrigeration_and_freezing_technology","279297780_EPCIS_Event-Based_Traceability_in_Pharmaceutical_Supply_Chains_via_Automated_Generation_of_Linked_Pedigrees","271540414_A_study_on_RFIDUSN_based_e-pedigree_system_for_cold_chain_management"]}