{"id":"306929880_The_Impact_of_Services_on_Economic_Complexity_Service_Sophistication_as_Route_for_Economic_Growth","abstract":"Economic complexity reflects the amount of knowledge that is embedded in the productive structure of an economy. By combining tools from network science and econometrics, a robust and stable relationship between a country’s productive structure and its economic growth has been established. Here we report that not only goods but also services are important for predicting the rate at which countries will grow. By adopting a terminology which classifies manufactured goods and delivered services as products, we investigate the influence of services on the country’s productive structure. In particular, we provide evidence that complexity indices for services are in general higher than those for goods, which is reflected in a general tendency to rank countries with developed service sector higher than countries with economy centred on manufacturing of goods. By focusing on country dynamics based on experimental data, we investigate the impact of services on the economic complexity of countries measured in the product space (consisting of both goods and services). Importantly, we show that diversification of service exports and its sophistication can provide an additional route for economic growth in both developing and developed countries.","authors":["Viktor Stojkoski","Zoran Utkovski","Ljupco Kocarev"],"meta":["August 2016PLoS ONE 11(8):e0161633","DOI:10.1371/journal.pone.0161633","Project: Economic Complexity"],"references":["319245615_2016_International_Trade_Statistics_Yearbook","301836394_The_mathematics_of_non-linear_metrics_for_nested_networks","281576302_Measuring_economic_complexity_of_countries_and_products_which_metric_to_use","272190777_The_Heterogeneous_Dynamics_of_Economic_Complexity","266376764_On_the_convergence_of_the_Fitness-Complexity_Algorithm","259772045_Development_Time_to_leave_GDP_behind","330325934_The_Atlas_of_Economic_Complexity_Mapping_Paths_to_Prosperity","326953008_Introductory_Econometrics_for_Finance","324284522_The_Coming_of_Post-Industrial_Society_A_Venture_in_Social_Forecasting","274542628_The_Rise_of_the_Network_Society_The_Information_Age_Economy_Society_and_Culture_Vol_I"]}