{"id":"306920841_A_fractal_enterprise_model_and_its_application_for_business_development","abstract":"Paper is in open access: http://bit.ly/2c3RI8P\nThis paper suggests a new type of enterprise models called fractal enterprise models (FEM), with accompanying methodological support for their design. FEM shows interconnections between the business processes in an enterprise by connecting them to the assets they use and manage. Assets considered in the model could be tangible (buildings, heavy machinery, etc.) and intangible (employees, business process definitions, etc.). A FEM model is built by using two types of patterns called archetypes: a process-assets archetype that connects a process with assets used in it, and an asset-processes archetype that connects an asset with processes aimed to manage this asset (e.g., hiring people, or servicing machinery). Alternating these patterns creates a fractal structure that makes relationships between various parts of the enterprise explicit. FEM can be used for different purposes, including finding a majority of the processes in an enterprise and planning business change or radical transformation. Besides discussing FEM and areas of its usage, the paper presents results from a completed project in order to test the practical usefulness of FEM and its related methodological support.","authors":["Ilia Bider","Erik Perjons","Mturi Elias","Paul Johannesson"],"meta":["July 2017Software and Systems Modeling 16(3)","DOI:10.1007/s10270-016-0554-9","Project: Fractal Enterprise Model (FEM) and its usage in Practice"],"references":["305606957_Why_Business_Should_Take_Enterprise_Architecture_Seriously","300586571_Using_Fractal_Process-Asset_Model_to_Design_the_Process_Architecture_of_an_Enterprise_Experience_Report","284503626_A_design_science_research_methodology_for_information_systems_research","282506563_Untangling_the_Dynamic_Structure_of_an_Enterprise_by_Applying_a_Fractal_Approach_to_Business_Processes","321600676_Systems_Thinking_in_Europe","321519437_Fundamentals_of_Business_Process_Management","321502532_ARIS_-_Business_Process_Modeling","305598922_The_Fractal_Organization_Creating_Sustainable_Organizations_with_the_Viable_System_Model","286088443_Exploring_the_Relationship_between_Design_Science_Research_and_Innovation_A_Case_Study_of_Innovation_at_Chevron","284531776_Empirical_Model-Building_and_Response_Surfaces"]}