{"id":"306921069_HETEROGENEOUS_SENSOR_DATA_EXPLORATION_AND_SUSTAINABLE_DECLARATIVE_MONITORING_ARCHITECTURE_APPLICATION_TO_SMART_BUILDING","abstract":"Concerning energy consumption and monitoring architectures, our goal is to develop a sustainable declarative monitoring architecture for lower energy consumption taking into account the monitoring system itself. Our second is to develop theoretical and practical tools to model, explore and exploit heterogeneous data from various sources in order to understand a phenomenon like energy consumption of smart building vs inhabitants' social behaviours. We focus on a generic model for data acquisition campaigns based on the concept of generic sensor. The concept of generic sensor is centered on acquired data and on their inherent multi-dimensional structure, to support complex domain-specific or field-oriented analysis processes. We consider that a methodological breakthrough may pave the way to deep understanding of voluminous and heterogeneous scientific data sets. Our use case concerns energy efficiency of buildings to understand relationship between physical phenomena and user behaviors. The aim of this paper is to give a presentation of our methodology and results concerning architecture and user-centric tools.","authors":["Sylvie Servigne","Yann Gripay","Ozgun Pinarer","John Samuel"],"meta":["August 2016","DOI:10.5194/isprs-annals-III-4-W1-97-2016"],"references":["312908771_R_Laurini_Spatial_and_temporal_information_structuring_for_natural_risk_monitoring_In_GISPlanet'2005","281449696_Data_Science_Approach_for_a_Cross-disciplinary_Understanding_of_Urban_Phenomena_Application_to_Energy_Efficiency_of_Buildings","273859193_Managing_Sensor_Data_Uncertainty","267785708_Data_Aggregation_in_Wireless_Sensor_Network","262246778_Extending_Conceptual_Data_Model_for_Dynamic_Environment","256092056_The_SSN_Ontology_of_the_W3C_Semantic_Sensor_Network_Incubator_Group","326337841_The_SSN_Ontology_of_the_W3C_Semantic_Sensor_Network_Incubator_Group","312914843_Data_aggregation_in_wireless_sensor_network","312909031_A_cloud-based_platform_for_energy_and_maintenance_management","311640867_Toward_sensor_database_systems"]}