{"id":"307090366_Learning_to_Program_Gender_Differences_and_Interactive_Effects_of_Students'_Motivation_Goals_and_Self-Efficacy_on_Performance","abstract":"Previous research in computer science education has demon- strated the importance of motivation for success in introduc- tory programming. Theoretical constructs from self-regulated learning theory (SRL), which integrates several different types of metacognitive processes, as well as motivational constructs, have proved to be important predictors of success in most academic disciplines. These individual components of self- regulated learning (e.g., self-efficacy, metacognitive strate- gies) interact in complex ways to influence students’ affec- tive states and behaviors, which in turn influence learning outcomes. These elements have been previously examined individually in novice programmers, but we do not have a comprehensive understanding of how SRL constructs inter- act to influence learning to program. This paper reports on a study that examined the interaction of self-efficacy, intrinsic and extrinsic goal orientations, and metacognitive strategies and their impact on student performance in a CS1 course. We also report on significant gender differences in the relationships between SRL constructs and learning out- comes. We found that student performance had the ex- pected motivational and SRL precursors, but the interac- tions between these constructs revealed some unexpected relationships. Furthermore, we found that females’ self- efficacy had a different connection to programming perfor- mance than that of their male peers. Further research on success in introductory programming should take account of the unique and complex relationship between SRL and student success, as well as gender differences in these rela- tionships that are specific to CS.","authors":["Alex Lishinski","Aman Yadav","Jon Good","R.J. Enbody"],"meta":["September 2016","DOI:10.1145/2960310.2960329","Conference: International Computing Education ResearchAt: Melbourne, Australia"],"references":["305294381_The_role_of_metacognitive_skills_in_solving_object-oriented_programming_problems_a_case_study","298797306_Knowledge_Monitoring_Goal_Orientations_Self-Efficacy_And_Academic_Performance_A_Path_Analysis","296636556_Revision_of_achievement_goal_theory_Necessary_and_illuminating","292784248_Using_Machine_Learning_Techniques_to_Predict_Introductory_Programming_Performance","317953663_Self-Efficacy_Toward_a_Unifying_Theory_of_Behavioral_Change","311489317_How_Early_Does_the_CS_Gender_Gap_Emerge_A_Study_of_Collaborative_Problem_Solving_in_5th_Grade_Computer_Science","311488382_Impact_of_Student_Achievement_Goals_on_CS1_Outcomes","307090809_Cognitive_Affective_and_Dispositional_Components_of_Learning_Programming","289963573_The_relation_between_goal_orientation_and_students_motivational_beliefs_and_self-regulated_learning","289963043_The_relation_between_goal_orientation_and_students_motivational_beliefs_and_self-regulated_learning"]}