{"id":"307175665_How_to_Evaluate_Educational_Games_a_Systematic_Literature_Review","abstract":"Educational games have been used as an innovative instructional strategy in order to achieve learning more effectively. However, it is essential to systematically evaluate such games in order to obtain sound evidence on their impact. Thus, the objective of this article is to present the state of the art on how to systematically evaluate educational games. Therefore, we performed a systematic literature review with an initial sample of 21,291 articles from which 11 relevant articles have been identified, describing 7 approaches to systematically evaluate educational games. Based on these studies we analyze how the approaches are defined (quality factors, theoretical constructs), operationalized (research designs, data collection instruments, data analysis methods), how they have been developed (development methodology) and evaluated (evaluated aspects, number of applications & data points and data analysis methods). As a result, we can confirm that exist few approaches to systematically evaluate educational games. The majority of the approaches are developed in an ad-hoc manner, not providing an explicit definition of the study, its execution and data analysis. We also observed that among the few encountered approaches no clear pattern emerges on which quality factors to evaluate. This shows that there exists a need for research on the definition and operationalization of educational game evaluations in order to obtain more valid and uniform results.","authors":["Giani Petri","Christiane Gresse von Wangenheim"],"meta":["July 2016JOURNAL OF UNIVERSAL COMPUTER SCIENCE 22(7):992","Project: Evaluation of Educational Games for Computing Education"],"references":["325046233_Games_for_Teaching_Computing_in_Higher_Education_-_A_Systematic_Review","319393897_Taxonomy_of_educational_objectives_The_classification_of_educational_goals_Handbook_I_cognitive_domain","299492100_Games_for_Teaching_Computing_in_Higher_Education_-_A_Systematic_Review","292823913_The_Game_Performance_Assessment_Instrument_GPAI_Development_and_Preliminary_Validation","289905249_Do_alternative_instructional_approaches_result_in_different_game_performance_learning_outcomes_Authentic_assessment_in_varying_game_conditions","289346950_Development_of_a_general_framework_for_evaluating_games-based_learning","288638941_A_refined_evaluation_framework_for_games-based_learning","288631389_Towards_the_Development_of_a_Games-Based_Learning_Evaluation_Framework","286990038_Skills_training_versus_action_research_in-service_Impact_on_student_attitudes_to_self-evaluation","286612517_Introduction_to_Games-Based_Learning"]}