{"id":"307307534_DeepAD_Alzheimer's_Disease_Classification_via_Deep_Convolutional_Neural_Networks_using_MRI_and_fMRI","abstract":"To extract patterns from neuroimaging data, various statistical methods and machine learning algorithms have been explored for the diagnosis of Alzheimer’s disease among older adults in both clinical and research applications; however, distinguishing between Alzheimer’s and healthy brain data has been challenging in older adults (age > 75) due to highly similar patterns of brain atrophy and image intensities. Recently, cutting-edge deep learning technologies have rapidly expanded into numerous fields, including medical image analysis. This paper outlines state-of-the-art deep learning-based pipelines employed to distinguish Alzheimer’s magnetic resonance imaging (MRI) and functional MRI (fMRI) from normal healthy control data for a given age group. Using these pipelines, which were executed on a GPU-based high-performance computing platform, the data were strictly and carefully preprocessed. Next, scale- and shift-invariant low- to high-level features were obtained from a high volume of training images using convolutional neural network (CNN) architecture. In this study, fMRI data were used for the first time in deep learning applications for the purposes of medical image analysis and Alzheimer’s disease prediction. These proposed and implemented pipelines, which demonstrate a significant improvement in classification output over other studies, resulted in high and reproducible accuracy rates of 99.9% and 98.84% for the fMRI and MRI pipelines, respectively. Additionally, for clinical purposes, subject-level classification was performed, resulting in an average accuracy rate of 94.32% and 97.88% for the fMRI and MRI pipelines, respectively. Finally, a decision making algorithm designed for the subject-level classification improved the rate to 97.77% for fMRI and 100% for MRI pipelines.","authors":["Saman Sarraf","Danielle D. DeSouza","John A. E. Anderson","Ghassem Tofighi"],"meta":["August 2016","DOI:10.1101/070441"],"references":["305196650_Going_deeper_with_convolutions","301837631_Classification_of_Alzheimer's_Disease_using_fMRI_Data_and_Deep_Learning_Convolutional_Neural_Networks","301332111_The_Associative_Memory_Deficit_in_Aging_Is_Related_to_Reduced_Selectivity_of_Brain_Activity_during_Encoding","299934881_Functional_Brain_Imaging_A_Comprehensive_Survey","316240097_Distinctive_Image_Features_from_Scale-Invariant_Keypoints","311609041_Deep_Residual_Learning_for_Image_Recognition","308845624_Deep_neural_networks_for_anatomical_brain_segmentation","308815216_Object-Scene_Convolutional_Neural_Networks_for_event_recognition_in_images","304748302_Alzheimer's_Disease_Diagnostics_by_Adaptation_of_3D_Convolutional_Network","300330932_Deep_Learning_in_Diagnosis_of_Brain_Disorders"]}