{"id":"307305821_Random_Forest_for_Label_Ranking","abstract":"Label ranking aims to learn a mapping from instances to rankings over a finite number of predefined labels. Random forest is a powerful and one of the most successfully general-purpose machine learning algorithms of modern times. In the literature, there seems no research has yet been done in applying random forest to label ranking. In this paper, We present a powerful random forest label ranking method which uses random decision trees to retrieve nearest neighbors that are not only similar in the feature space but also in the ranking space. We have developed a novel two-step rank aggregation strategy to effectively aggregate neighboring rankings discovered by the random forest into a final predicted ranking. Compared with existing methods, the new random forest method has many advantages including its intrinsically scalable tree data structure, highly parallel-able computational architecture and much superior performances. We present extensive experimental results to demonstrate that our new method achieves the best predictive accuracy performances compared with state-of-the-art methods for datasets with complete ranking and datasets with only partial ranking information.","authors":["Yangming Zhou","Guoping Qiu"],"meta":["June 2018Expert Systems with Applications 112","DOI:10.1016/j.eswa.2018.06.036","Projects: Machine Learning and ApplicationsLabel Ranking"],"references":["322379470_Dyad_ranking_using_Plackett-Luce_models_based_on_joint_feature_representations","281715966_Dyad_Ranking_Using_a_Bilinear_Plackett-Luce_Model_Poster","276240631_A_Taxonomy_of_Label_Ranking_Algorithms","313199527_Spearman's_footrule_as_a_measure_of_disarray","312459200_Spearman's_Footrule_as_a_Measure_of_Disarray","307939281_Tackling_the_supervised_label_ranking_problem_by_bagging_weak_learners","303057852_Decision_forests_A_unified_framework_for_classification_regression_density_estimation_manifold_learning_and_semi-supervised_learning","300563007_Superset_Learning_Based_on_Generalized_Loss_Minimization","288906520_Random_forests","287474722_Comparison_of_ranking_procedures_in_pairwise_preference_learning"]}