{"id":"307473101_Why_Does_Deep_and_Cheap_Learning_Work_So_Well","abstract":"We show how the success of deep learning depends not only on mathematics but also on physics: although well-known mathematical theorems guarantee that neural networks can approximate arbitrary functions well, the class of functions of practical interest can be approximated through \"cheap learning\" with exponentially fewer parameters than generic ones, because they have simplifying properties tracing back to the laws of physics. The exceptional simplicity of physics-based functions hinges on properties such as symmetry, locality, compositionality and polynomial log-probability, and we explore how these properties translate into exceptionally simple neural networks approximating both natural phenomena such as images and abstract representations thereof such as drawings. We further argue that when the statistical process generating the data is of a certain hierarchical form prevalent in physics and machine-learning, a deep neural network can be more efficient than a shallow one. We formalize these claims using information theory and discuss the relation to renormalization group procedures. Various \"no-flattening theorems\" show when these efficient deep networks cannot be accurately approximated by shallow ones without efficiency loss - even for linear networks.","authors":["Henry W. Lin","Max Tegmark"],"meta":["September 2017Journal of Statistical Physics 168(6)","DOI:10.1007/s10955-017-1836-5"],"references":["301841654_Learning_Real_and_Boolean_Functions_When_Is_Deep_Better_Than_Shallow","346355165_Scaling_and_Renormalization_in_Statistical_Physics","319769990_I-theory_on_depth_vs_width_hierarchical_function_composition","309186321_A_practical_guide_to_training_restricted_boltzmann_machinesJ","306186507_Deep_vs_shallow_networks_An_approximation_theory_perspective","304018151_On_the_expressive_power_of_deep_neural_networks","303859227_Solving_the_Quantum_Many-Body_Problem_with_Artificial_Neural_Networks","303367178_Supervised_Learning_with_Quantum-Inspired_Tensor_Networks","292525996_Research_Priorities_for_Robust_and_Beneficial_Artificial_Intelligence","289733708_Do_deep_nets_really_need_to_be_deep","277411157_Deep_Learning","287250773_The_Power_of_Depth_for_Feedforward_Neural_Networks","282403870_Representation_Benefits_of_Deep_Feedforward_Networks","277170774_A_Line_of_Sight_Approach_to_Cosmic_Microwave_Background_Anisotropies","268247421_Scaling_and_renormalization_in_statistical_physics_Reprint_with_correct"]}