{"id":"307473228_Identification_of_milestone_papers_through_time-balanced_network_centrality","abstract":"Citations between scientific papers and related bibliometric indices, such as the $h$-index for authors and the impact factor for journals, are being increasingly used -- often in controversial ways -- as quantitative tools for research evaluation. Yet, a fundamental research question remains still open: to which extent do quantitative metrics capture the significance of scientific works? We analyze the network of citations among the $449,935$ papers published by the American Physical Society (APS) journals between $1893$ and $2009$, and focus on the comparison of metrics built on the citation count with network-based metrics. We contrast five article-level metrics with respect to the rankings that they assign to a set of fundamental papers, called Milestone Letters, carefully selected by the APS editors for \"making long-lived contributions to physics, either by announcing significant discoveries, or by initiating new areas of research\". A new metric, which combines PageRank centrality with the explicit requirement that paper score is not biased by paper age, outperforms the others in identifying the Milestone Letters short after they are published. The lack of time bias in the new metric makes it also possible to use it to compare papers of different age on the same scale. We find that network-based metrics generally identify the Milestone Letters better than metrics based on the citation count, which suggests that the structure of the citation network contains information that can be used to improve the ranking of scientific publications. The methods and results presented here are relevant for all evolving systems where network centrality metrics are applied, for example the World Wide Web and online social networks.","authors":["Manuel Sebastian Mariani","Matus Medo","Yi-Cheng Zhang"],"meta":["August 2016Journal of Informetrics 10(4)","DOI:10.1016/j.joi.2016.10.005","Project: Ranking of nodes in growing information systems"],"references":["315041727_Attention_Decay_in_Science","301233136_Diffusion_of_scientific_credits_and_the_ranking_of_scientists","282763469_Quality_versus_quantity_in_scientific_impact","282426900_A_century_of_physics","281576492_Identification_and_modeling_of_discoverers_in_online_social_systems","317415312_Advanced_engineering_mathematics","309078134_Assessing_the_relative_impacts_of_economic_journals_Journal_of_Economic_Literature","302916048_The_pressure_to_publish_pushes_down_quality","298723894_Evaluating_paper_and_author_ranking_algorithms_using_impact_and_contribution_awards","287419288_Ranking_scientific_publications_with_similarity-preferential_mechanism"]}