{"id":"307415722_Investigating_on_the_Methodology_Effect_When_Evaluating_Lucid_Dream","abstract":"Lucid dreaming (LD) is a state of consciousness in which the dreamer is aware that he or she is dreaming and can possibly control the content of his or her dream. To investigate the LD prevalence among different samples, researchers have used different types of methodologies. With regard to retrospective self-report questionnaire, two ways of proceeding seem to emerge. In one case, a definition of LD is given to participants (\" During LD, one is–while dreaming–aware of the fact that one is dreaming. It is possible to deliberately wake up, to control the dream action, or to observe passively the course of the dream with this awareness \"), while in the other instances, participants are presented separate questions targeting specific LD indicators (dream awareness and dream control). In the present study, we measured LD frequency in a sample of French student in order to investigate for possible disparities in LD frequency depending on the type of questionnaire as outlined above. Moreover, we also study links between the prevalence of LD as assessed, respectively, by each questionnaire with various factors such as Vividness of Mental Imagery and Parasomnia. Results revealed no significant difference between LD frequencies across questionnaires. For the questionnaire with definition (DefQuest), 81.05% of participants reported experience of LD once or more. Concerning the questionnaire based on LD indicators (AwarContQuest), 73.38% of participants reported having experienced LD once or more. However, with regard to the correlations analysis, links between LD prevalence and factors such as Vividness of Mental Imagery and Parasomnia, varied across questionnaires. This result is an argument suggesting that researchers should be careful when investigating links between LD and other factors. The type of methodology may influence findings on LD research. Further studies are needed to investigate on the methodology effect in LD research namely on the respective weight of awareness and control.","authors":["Nicolas Ribeiro","Yannick Gounden","Véronique Quaglino"],"meta":["September 2016Frontiers in Psychology 7(294):1306","DOI:10.3389/fpsyg.2016.01306","Project: Dreams, Memory and counsciousness"],"references":["306224339_New_perspectives_for_the_study_of_lucid_dreaming_From_brain_stimulation_to_philosophical_theories_of_self-consciousness","304884946_Lucid_dreaming_and_personality_in_childrenadolescents_and_adults_The_UK_library_study","297673538_Psychosis_and_the_Control_of_Lucid_Dreaming","285385641_Lucid_Dreaming_Frequency_and_Alarm_Clock_Snooze_Button_Use","304199461_Frequency_of_lucid_dreaming_in_a_representative_German_sample","304150833_Lucid_dreaming_incidence_A_quality_effects_meta-analysis_of_50_years_of_research","301274155_Motor_imagery_in_REM_sleep_increased_by_transcranial_direct_current_stimulation_of_the_left_motor_cortex_C3","294733754_The_borderlands_of_waking_Quantifying_the_transition_from_reflective_thought_to_hallucination_in_sleep_onset","288390955_Incidence_and_frequency_of_lucid_dreams_in_a_Swiss_junior_college_student_sample","286795748_Individual_Differences_Associated_with_Lucid_Dreaming"]}