{"id":"307578483_Pattern_recognition_with_materials_that_compute","abstract":"Driven by advances in materials and computer science, researchers are attempting to design systems where the computer and material are one and the same entity. Using theoretical and computational modeling, we design a hybrid material system that can autonomously transduce chemical, mechanical, and electrical energy to perform a computational task in a self-organized manner, without the need for external electrical power sources. Each unit in this system integrates a self-oscillating gel, which undergoes the Belousov-Zhabotinsky (BZ) reaction, with an overlaying piezoelectric (PZ) cantilever. The chemomechanical oscillations of the BZ gels deflect the PZ layer, which consequently generates a voltage across the material. When these BZ-PZ units are connected in series by electrical wires, the oscillations of these units become synchronized across the network, where the mode of synchronization depends on the polarity of the PZ. We show that the network of coupled, synchronizing BZ-PZ oscillators can perform pattern recognition. The \" stored \" patterns are set of polarities of the individual BZ-PZ units, and the \" input \" patterns are coded through the initial phase of the oscillations imposed on these units. The results of the modeling show that the input pattern closest to the stored pattern exhibits the fastest convergence time to stable synchronization behavior. In this way, networks of coupled BZ-PZ oscillators achieve pattern recognition. Further, we show that the convergence time to stable synchronization provides a robust measure of the degree of match between the input and stored patterns. Through these studies, we establish experimentally realizable design rules for creating \" materials that compute. \"","authors":["Yan Fang","Victor V. Yashin","S.P. Levitan","Anna Balazs"],"meta":["September 2016Science Advances 2(9):e1601114","DOI:10.1126/sciadv.1601114","Project: Sensing and Computing with Oscillating Chemical Reactions"],"references":["286488302_Non-Boolean_Associative_Processing_Circuits_System_Architecture_and_Algorithms","279305580_Achieving_synchronization_with_active_hybrid_materials_Coupling_self-oscillating_gels_and_piezoelectric_films","277962048_Modeling_the_entrainment_of_self-oscillating_gels_to_periodic_mechanical_deformation","276459205_Oscillator_Array_Models_for_Associative_Memory_and_Pattern_Recognition","273778713_Materials_science_Materials_that_couple_sensing_actuation_computation_and_communication","313561001_Materials_that_couple_sensing_actuation_computation_and_communication","292215395_Neural_networks_and_physical_systems_with_emergent_collective_computational_abilities","284749562_Coupled-Oscillator_Associative_Memory_Array_Operation_for_Pattern_Recognition","276851666_Conformal_piezoelectric_systems_for_clinical_and_experimental_characterization_of_soft_tissue_biomechanics","269007290_Mechatronics_Dynamics_of_Electromechanical_and_Piezoelectric_Systems","259484807_Piezoelectric_Multilayer_Beam_Bending_Actuators_Static_and_Dynamic_Behavior_and_Aspects_of_Sensor_Integration_ISBN_978-3-540-32641-0","255761372_Controlling_the_dynamic_behavior_of_heterogeneous_self-oscillating_gels","264269062_Mechanical_Resuscitation_of_Chemical_Oscillations_in_Belousov-Zhabotinsky_Gels","261086850_CMOS_supporting_circuitries_for_nano-oscillator-based_associative_memories","259426574_Giant_piezoelectricity_in_PMN-PT_thin_films_Beyond_PZT"]}