{"id":"307524437_JPEG_Quantization_Step_Estimation_and_Its_Applications_to_Digital_Image_Forensics","abstract":"The goal of the paper is to propose an accurate method for estimating quantization steps from an image that has been previously JPEG-compressed and stored in lossless format. The method is based on the combination of the quantization effect and the statistics of Discrete Cosine Transform (DCT) coefficient characterized by the statistical model that has been proposed in our previous works. The analysis of quantization effect is performed within a mathematical framework, which justifies the relation of local maxima of the number of integer quantized forward coefficients with the true quantization step. From the candidate set of the true quantization step given by the previous analysis, the statistical model of DCT coefficients is used to provide the optimal quantization step candidate. The proposed method can also be exploited to estimate the secondary quantization table in a double-JPEG compressed image stored in lossless format, and detect the presence of JPEG compression. Numerical experiments on large image databases with different image sizes and quality factors highlight the high accuracy of the proposed method.","authors":["Thanh Hai THAI","Rémi Cogranne","Florent Retraint","Doan Thi Ngoc Canh"],"meta":["August 2016IEEE Transactions on Information Forensics and Security PP(99):1-1","DOI:10.1109/TIFS.2016.2604208"],"references":["284015321_Camera_model_identification_based_on_the_generalized_noise_model_in_natural_images","277283835_Digital_Watermarking_Algorithms_and_Applications","272569158_Camera_model_identification_based_on_DCT_coefficient_statistics","302970924_A_Simplex_Method_for_Function_Minimization","277496116_Information_Forensics_An_Overview_of_the_First_Decade","273398284_An_Effective_Method_for_Detecting_Double_JPEG_Compression_With_the_Same_Quantization_Matrix","272748927_Statistical_Model_of_JPEG_Noises_and_Its_Application_in_Quantization_Step_Estimation","271463285_Steganalysis_of_Jsteg_algorithm_based_on_a_novel_statistical_model_of_quantized_DCT_coefficients","261443551_Statistical_Model_of_Quantized_DCT_Coefficients_Application_in_the_Steganalysis_of_Jsteg_Algorithm","261387555_Statistical_model_of_natural_images"]}