{"id":"307583770_Cro36WSD_A_Lexical_Sample_for_Croatian_Word_Sense_Disambiguation","abstract":"We introduce Cro36WSD, a freely-available medium-sized lexical sample for Croatian word sense disambiguation (WSD). Cro36WSD comprises 36 words: 12 adjectives, 12 nouns, and 12 verbs, balanced across both frequency bands and polysemy levels. We adopt the multi-label annotation scheme in the hope of lessening the drawbacks of discrete sense inventories and obtaining more realistic annotations from human experts. Sense-annotated data is collected through multiple annotation rounds to ensure high-quality annotations: with a 115 person-hours effort we reached an inter-annotator agreement score of 0.877. We analyze the obtained data and perform a correlation analysis between several relevant variables, including word frequency, number of senses, sense distribution skewness, average annotation time, and the observed inter-annotator agreement (IAA). Using the obtained data, we compile multi-and single-labeled dataset variants using different label aggregation schemes. Finally, we evaluate three different baseline WSD models on both dataset variants and report on the insights gained. We make both dataset variants freely available.","authors":["Domagoj Alagić","Jan Šnajder"],"meta":["May 2016","Conference: 10th edition of the Language Resources and Evaluation Conference (LREC 2016)At: Portorož, Slovenia"],"references":["301446165_SemEval-2015_Task_13_Multilingual_All-Words_Sense_Disambiguation_and_Entity_Linking","273859036_Multi-Label_Classification_An_Overview","270877800_New_Insights_from_Coarse_Word_Sense_Disambiguation_in_the_Crowd","257882504_Distributed_Representations_of_Words_and_Phrases_and_their_Compositionality","252252208_SemEval-2010_Task_17_All-words_Word_Sense_Disambiguation_on_a_Specific_Domain","319770369_Distributed_Representations_of_Words_and_Phrases_and_their_Compositionality","307881957_LIBSVM_A_library_for_support_vector_machines","301408994_bshrsrWaC_-_Web_Corpora_of_Bosnian_Croatian_and_Serbian","274375036_Rjecnik_hrvatskoga_jezika","243787227_The_English_all-words_task"]}