{"id":"307541057_A_computational_model_of_perceptual_expectation_effect_based_on_neural_coding_principles","abstract":"Abstract: Prior expectation aﬀects posterior perceptual experience. This contextual bias is called expectation eﬀect. Previous studies have observed two diﬀerent patterns of expectation eﬀect: contrast and assimilation. Contrast magniﬁes the perceived incongruity, and assimilation diminishes the incongruity. This study proposes a computational model that explains the conditions of contrast and assimilation based on neural coding principles. This model proposed that prediction error, uncertainty, and external noise aﬀected the expectation eﬀect. Computer simulations with the model show that the pattern of expectation eﬀect shifted from assimilation to contrast as the prediction error increased, uncertainty decreased the extent of the expectation eﬀect, and external noise increased the assimilation. We conducted an experiment on the size–weight illusion (SWI) as a case of the cross-modal expectation eﬀect and discussed correspondence with the simulation. We discovered conditions where the participants perceived bigger object to be heavier than smaller one, which contradicts to conventional SWI.\nPractical applications: Expectation eﬀect in sensory perception represents a perceptual bias caused by prior expectation, such as illusions and cross-modality. The computational model proposed in this study guides researchers and practitioners who investigate this bias in sensory studies to set a hypothesis with appropriate experimental factors. For example, the model suggests that prediction error can be used as a main factor to identify a condition at which assimilation switches over to contrast. The model provided how expectation uncertainty and noise of stimulus aﬀect the switchover point of prediction error and extent of expectation eﬀect. Uncertainty, which may diﬀer from person to person, can be used as a factor to explain personal diﬀerences in the extent of expectation eﬀect.","authors":["Hideyoshi Yanagisawa"],"meta":["August 2016Journal of Sensory Studies 31(5):430-439","DOI:10.1111/joss.12233","Project: Expectation effect in multi-sensory experience"],"references":["278965140_Effects_of_Visual_Expectation_on_Perceived_Tactile_Perception_An_Evaluation_Method_of_Surface_Texture_with_Expectation_Effect","277935052_Expectation_effect_of_perceptual_experience_in_sensory_modality_transitions_Modeling_with_information_theory","254759055_Beyond_Surprise_a_longitudinal_study_of_responses_to_visual_-_tactual_incongruities_in_products","254759048_Appraisal_Patterns_of_Emotions_in_Human-Product_Interaction","243712413_Possible_Principles_Underlying_the_Transformations_of_Sensory_Messages","233735967_Bayesian_Inference_with_Efficient_Neural_Population_Codes","329256588_A_Cognitive_Model_of_the_Antecedents_and_Consequences_of_Satisfaction_Decisions","235361505_A_Cognitive_Model_of_Antecedents_and_Consequences_of_Satisfaction_Decisions","235240358_A_Neural_Substrate_of_Prediction_and_Reward","232487404_Effect_of_Expectation_and_Disconfirmation_on_Postexposure_Product_Evaluations_An_Alternative_Interpretation"]}