{"id":"307569213_A_Study_of_Code_Design_Skills_in_Novice_Programmers_using_the_SOLO_taxonomy","abstract":"There is a wealth of literature dealing with the difficulties of novice programmers with basic programming constructs such as variables, assignment and conditionals. In this paper we extend the study to two other core CS1 topics: loops and vectors (represented as single dimensional arrays). By the end of their first semester of instruction, students are expected to have acquired both the ability to reproduce given syntactic structure and basic design skills that allow them to write small pieces of code that extend, modify or combine in new ways the basic programming constructs.\nThis work presents an evaluation framework that uses the SOLO taxonomy to assess programming questions' complexity. Our framework extends SOLO by using the term \"building block\" as an adaptable parameter that explicitly defines the student's ability to increasingly write more complex pieces of code. The granularity of a \"building block\" is determined by the amount of programming practice students have carried out up to that point.\nThe analysis of final exam answers using this framework allows us to quantify the progress made by one cohort of novice programmers in the mastery of basic design skills and to study correlations between mastery of these skills and overall course performance. Furthermore, we identify common errors that illustrate the challenges students face when trying to combine programming constructs in non-trivial ways","authors":["Cruz Izu","Amali Weerasinghe","Cheryl Pope"],"meta":["September 2016","DOI:10.1145/2960310.2960324","Conference: 2016 ACM Conference on International Computing Education Research (ICER '16)At: Melbourne","Project: Student-centered approaches to teaching programming courses"],"references":["267219426_EXPERT_BLIND_SPOT_1_Expert_Blind_Spot_Among_Pre-Service_Mathematics_and_Science_Teachers","266657024_Programming_Reading_writing_and_reversing","250185069_Expert_Blind_Spot_Among_Preservice_Teachers","235920619_Using_SOLO_taxonomy_to_explore_students'_mental_models_of_the_programming_variable_and_the_assignment_statement","283232519_SOLO_Taxonomy_for_Assessing_Novices'_Algorithmic_Design","279197778_Using_SOLO_to_Classify_the_Programming_Responses_of_Primary_Grade_Students","276398858_Students'_Understanding_of_Loops_and_Nested_Loops_in_Computer_Programming_An_APOS_Theory_Perspective","248642237_On_Novice_Loop_Boundaries_and_Range_Conceptions","247928701_Reviewing_CS1_exam_question_content","233315542_Investigating_and_improving_the_models_of_programming_concepts_held_by_novice_programmers"]}