{"id":"307554876_From_Playing_to_Programming_The_Effect_of_Video_Game_Play_on_Confidence_with_Computers_and_an_Interest_in_Computer_Science","abstract":"Research on the effects of playing video games has been limited by a preoccupation with possible negative repercussions. Nevertheless, research has shown that video games can have positive effects on young players' social lives. The existing body of research, however, has largely ignored the more computer-related aspects of video game play and its effects. This study provides empirical evidence to support theoretical arguments about the relationship between playing video games and computers. The type of scientific thinking encouraged by video games and the technological abilities needed to play video games is suggested to result in an increase in players' confidence with computers and interest in computer science. These potential relationships are examined using data from over 1,000 undergraduate students to empirically assess the relationship between video game play and: 1) confidence with computers, and 2) interest in computer science. The results indicate that game play is statistically significant as a predictor of confidence and interest. In comparison to the other predictors in the model, the strength of the effect from playing video games is relatively very strong. The findings suggest that exposure to video games as a recreational technology help inform players' abilities with nonrecreational technology and build an interest in technology in general.","authors":["Rebecca Sevin","Whitney DeCamp"],"meta":["August 2016Sociological Research Online 21(3)","DOI:10.5153/sro.4082"],"references":["271200349_Elements_of_Crafts_that_Enhance_Well-Being_Textile_Craft_Makers'_Describtions_of_Their_Leisure_Activity","270792578_Impersonal_Agencies_of_Communication_Comparing_the_Effects_of_Video_Games_and_Other_Risk_Factors_on_Violence","264473018_Saving_Face_While_Geeking_Out_Video_Game_Testing_as_a_Justification_for_Learning_Computer_Science","261768051_Supreme_Court_Decision_on_Violent_Video_Games_Was_Based_on_the_First_Amendment_Not_Scientific_Evidence","258184440_Leadership_in_Multiplayer_Online_Gaming_Environments","258182804_Our_Princess_Is_in_Another_Castle_A_Review_of_Trends_in_Serious_Gaming_for_Education","273946763_Essential_Facts_about_the_Computer_and_Video_Game_Industry","269859876_Healing_Through_Movement_The_Benefits_of_Belly_Dance_for_Gendered_Victimization","264396203_Effects_of_Action_Video_Game_Training_on_Visual_Working_Memory","261768050_Violent_Media_Games_and_Aggression-Is_It_Really_Time_for_a_Mea_Culpa"]}