{"id":"307569551_Rancang_Bangun_Keamanan_Web_Service_Dengan_Metode_Ws-Security","abstract":"Abstrak\n\nWeb service menggunakan teknologi XML dalam melakukan pertukaran data. Umumnya penggunaan web service terjadi pertukaran data ataupun informasi penting yang perlu dijaga keamanannya. Bentuk pengamanan yang diterapkan pada web services adalah dengan penggunaan teknik kriptografi kunci-publik. Adapun serangan dapat berupa pengintaian, perusakan maupun pencurian data. Salah satu cara penyelesaian terbaik adalah dengan membuat data tersebut tidak dapat dibaca orang lain. \n\nImplementasi yang telah dilakukan dengan menggunakan library keamanan akan memberikan kemudahan dalam membangun keamanan web service karena dengan dukungan library XMLSEC sebagai library pendukung dan library class_wss yang telah dibangun mampu mengatasi masalah keamanan pada jalur transport khususnya untuk otentikasi, otorisasi, dan konfidensialitas pesan SOAP request. Model WS-Security dengan menggunakan XML Signature, XML Encryption, serta Security Token yang memanfaatkan algoritma kriptografi RSA dengan panjang kunci 1024 bit mampu memberikan perlindungan terhadap transmisi data antara client dan server web service. Pengujian yang dilakukan pada web service dengan menerapkan model library class_wss sebagai keamanan web service yang dibangun memberikan hasil yang baik, yaitu pesan SOAP request terenkripsi dan mampu didekripsi dengan baik serta dapat tertandatangani dan dicek keasliannya.\n\nKata kunci— Keamanan Web Service, XML Signature, XML Encryption, Security Token.\n\nAbstract\n\nWeb service uses XML technology to exchange data in. Generally, the use of the web service exchanges data or important information that needs to be guarded security. Form of security is applied to web services is to use public-key cryptography techniques. The attack can be a reconnaissance, destruction or theft of data. One way the best solution is to create data that can not read anyone else, even if someone else managed to retrieve the data, he will not be able to read it.\n\nThe implementation was done by using the security library will provide facilities in developing a web security service for the library support XMLSEC as library supporters and library class_wss that have been built able to overcome the problem of security on the transport path, especially for authentication, authorization, and confidentiality request SOAP message. Model WS-Security using XML Signature, XML Encryption, and Security Token which utilizes the cryptographic algorithm RSA with 1024 bit key length to provide protection against transmission of data between client and server web service. Tests performed on the web service by implementing a security model class_wss library web service that is built to give good results, the SOAP request message is encrypted and decrypted with a good and able to sign and check their authenticity too.\nKeywords— Web Service Security, XML Signature, XML Encryption, Security Token","authors":["Ari Muzakir","Ahmad Ashari"],"meta":["January 2012","DOI:10.22146/ijccs.2035"],"references":["290936226_Web_service_security_method_to_SOA_development","221600288_Integrated_Security_Framework_for_Secure_Web_Services"]}