{"id":"307546407_An_Approach_to_Ontology_Integration_for_Ontology_Reuse","abstract":"In the last years, the large availability of data and schema models formalized through different languages has demanded effective and efficient methodologies to reuse such models. One of the most challenging problem consists in integrating different models in a global conceptualiza-tion of a specific knowledge or application domain. This is a hard task to accomplish due to ambiguities, inconsistencies and heterogeneities, at different levels, that could stand in the way. The ability to effectively and efficiently perform knowledge reuse is a crucial factor in knowledge management systems, and it also represents a potential solution to the problem of standardization of information and a viaticum towards the realization of the Semantic web. In this paper, an approach to ontology reuse based on heterogeneous matching techniques will be presented, in particular , we will show how the process of ontology construction will be improved and simplified, by automatizing the selection and the reuse of existing data models. The proposed approach will be applied to the food domain, specifically to the food production.","authors":["Enrico G. Caldarola","Antonio M. Rinaldi"],"meta":["July 2016","DOI:10.1109/IRI.2016.58","Conference: IEEE 17th International Conference on Information Reuse and IntegrationAt: Pittsburgh, Pennsylvania, USA"],"references":["282098488_An_Approach_to_Ontology_Integration_for_Ontology_Reuse_in_Knowledge_Based_Digital_Ecosystems","280229999_The_Knowledge_Reuse_in_an_Industrial_Scenario_A_Case_Study","279270822_Big_Data_A_Survey_The_New_Paradigms_Methodologies_and_Tools","262932557_A_multimedia_ontology_model_based_on_linguistic_properties_and_audio-visual_features","321614296_Ontology_Engineering_in_a_Networked_World","278825857_Ontology_Matching","277707253_The_Encyclopedia_of_Applied_Linguistics","261180225_Ontology_Matching","260324688_Ontology_Matching_State_of_the_Art_and_Future_Challenges","251333302_Schema_Matching_Based_on_Attribute_Values_and_Background_Ontology"]}