{"id":"307545285_Multi-scale_brain_networks","abstract":"The network architecture of the human brain has become a feature of increasing interest to the neuroscientific community, largely because of its potential to illuminate human cognition, its variation over development and aging, and its alteration in disease or injury. Traditional tools and approaches to study this architecture have largely focused on single scales -- of topology, time, and space. Expanding beyond this narrow view, we focus this review on pertinent questions and novel methodological advances for the multi-scale brain. We separate our exposition into content related to multi-scale topological structure, multi-scale temporal structure, and multi-scale spatial structure. In each case, we recount empirical evidence for such structures, survey network-based methodological approaches to reveal these structures, and outline current frontiers and open questions. Although predominantly peppered with examples from human neuroimaging, we hope that this account will offer an accessible guide to any neuroscientist aiming to measure, characterize, and understand the full richness of the brain's multiscale network structure -- irrespective of species, imaging modality, or spatial resolution.","authors":["Richard F Betzel","Danielle S Bassett"],"meta":["August 2016NeuroImage 160","DOI:10.1016/j.neuroimage.2016.11.006"],"references":["305888491_Rentian_scaling_for_the_measurement_of_optimal_embedding_of_complex_networks_into_physical_space","305881429_Toward_an_Integration_of_Deep_Learning_and_Neuroscience","303713568_Detection_of_functional_brain_network_reconfiguration_during_task-driven_cognitive_states","301846385_Mapping_Multiplex_Hubs_in_Human_Functional_Brain_Networks","301836958_Evolution_of_network_architecture_in_a_granular_material_under_compression","308042331_Stimulus_Dependent_Dynamic_Reorganization_of_the_Human_Face_Processing_Network","306435231_Functional_Network_Dynamics_of_the_Language_System","305789688_The_modular_organization_of_human_anatomical_brain_networks_Accounting_for_the_cost_of_wiring","305452313_A_multi-modal_parcellation_of_human_cerebral_cortex","304589290_Multilayer_motif_analysis_of_brain_networks"]}