{"id":"307638970_Awareness_of_Cloud_Storage_Forensics_among_the_Users_in_Malaysia_A_Survey","abstract":"Cloud storage services are widely getting acceptance and gaining popularity, since it is used mostly by companies and students in Malaysian higher learning institutions. While cloud storage services got popular within last two years, most of the people are still trying to adapt to this new technology and some people still does not fully understand what cloud storage services are. In this paper, the authors present the results and an analysis of survey conducted on the awareness and concerns of Malaysians about cloud storage services, and its forensics and security issues. Questionnaires were administered to two hundred fifty users of cloud storage in Malaysia and fifty to the public to get the responses of people, especially student concerning about the cloud storage services. The responses from participants revealed valuable information about the public awareness and knowledge on cloud services. Relevant areas that required improvements are also investigated and discussed in this paper.","authors":["Yee Say Keat","Babak Bashari Rad","Mohammad Ahmadi"],"meta":["September 2016","Conference: The Third International Conference on Digital Security and Forensics (DigitalSec2016)At: Asia Pacific University of Technology & Innovation (APU), Malaysia"],"references":["305416491_A_Security_Framework_for_Secure_Cloud_Computing_Environments","295082455_A_Framework_for_Security_Transparency_in_Cloud_Computing","293765050_A_Security_Framework_for_Secure_Cloud_Computing_Environments","276199301_Cloud_Computing_and_Security_Issues_in_the_Cloud","275281578_Data_privacy_law_an_international_perspective","315586210_A_Review_On_Security_Issues_In_Cloud_Computing","299641075_Public_Cloud_Secure_Group_Sharing_and_Accessing_in_Cloud_Computing","286873462_Augmenting_Mobile_Cloud_Computing_through_Enterprise_Architecture_A_Survey_Paper","277622401_Encrypted_Search","275058987_Cloud_forensics_Technical_challenges_solutions_and_comparative_analysis"]}