{"id":"307638707_A_review_about_Smart_Objects_Sensors_and_Actuators","abstract":"Smart Objects and the Internet of Things are two ideas which describe the future, walk together, and complement each other. Thus, the interconnection among objects can make them more intelligent or expand their intelligence to unsuspected limits. This could be achieved with a new network that interconnects each object around the world. However, to achieve this goal, the objects need a network that supports heterogeneous and ubiquitous objects, a network where exists more traffic among objects than among humans, but supporting for both types. For these reasons, both concepts are very close. Cities, houses, cars, machines, or any another object that can sense, respond, work, or make easier the lives of their owner. This is a part of the future, an immediate future. Notwithstanding, first of all, there are to resolve a series of problems. The most important problem is the heterogeneity of objects. This article is going to show a theoretical frame and the related work about Smart Object. The article will explain what are Smart Objects, doing emphasis in their difference with Not-Smart Objects. After, we will present one of the different object classification system, in our opinion, the most complete.","authors":["Cristian González García","Daniel Meana-Llorián","B. Cristina Pelayo García-Bustelo","Juan Manuel Cueva Lovelle"],"meta":["January 2017International Journal of Interactive Multimedia and Artificial Intelligence 4(3):7-10","DOI:10.9781/ijimai.2017.431","Project: MDE and IoT"],"references":["261338639_A_platform_to_collect_manage_and_share_heterogeneous_sensor_data","260252345_Midgar_Generation_of_heterogeneous_objects_interconnecting_applications_A_Domain_Specific_Language_proposal_for_Internet_of_Things_scenarios","252050606_Co-creating_the_Internet_of_Things_-_First_experiences_in_the_participatory_design_of_Intelligent_Products_with_Arduino","228360933_The_Internet_of_Things","224085209_Smart_Objects_as_Building_Blocks_for_the_Internet_of_Things","298501384_Intelligent_products_and_systems_Technology_theme_-_Final_report","269574791_Midgar_Domain-Specific_Language_to_Generate_Smart_Objects_for_an_Internet_of_Things_Platform","261131607_Ubiquitous_networking_application_Energy_saving_using_smart_objects_in_a_home","254061364_Controlling_Physical_Objects_via_the_Internet_using_the_Arduino_Platform_over_802154_Networks","222980270_Auto_ID_systems_and_intelligent_manufacturing_control"]}