{"id":"307623487_Can_blended_learning_and_the_flipped_classroom_improve_student_learning_and_satisfaction_in_Saudi_Arabia","abstract":"Objectives\nTo evaluate student academic performance and perception towards blended learning and flipped classrooms in comparison to traditional teaching.\n\nMethods\nThis study was conducted during the hematology block on year three students. Five lectures were delivered online only. Asynchronous discussion boards were created where students could interact with colleagues and instructors. A flipped classroom was introduced with application exercises. Summative assessment results were compared with previous year results as a historical control for statistical significance. Student feedback regarding their blended learning experience was collected.\n\nResults\nA total of 127 responses were obtained. Approximately 22.8% students felt all lectures should be delivered through didactic lecturing, while almost 35% felt that 20% of total lectures should be given online. Students expressed satisfaction with blended learning as a new and effective learning approach. The majority of students reported blended learning was helpful for exam preparation and concept clarification. However, a comparison of grades did not show a statistically significant increase in the academic performance of students taught via the blended learning method.\n\nConclusions\nLearning experiences can be enriched by adopting a blended method of instruction at various stages of undergraduate and postgraduate education. Our results suggest that blended learning, a relatively new concept in Saudi Arabia, shows promising results with higher student satisfaction. Flipped classrooms replace passive lecturing with active student-centered learning that enhances critical thinking and application, including information retention.","authors":["Muhamed Raihan Sajid","Abrar F. Laheji","Fayha Abothenain","Yezan Salam"],"meta":["September 2016International Journal of Medical Education 7:281-285","DOI:10.5116/ijme.57a7.83d4"],"references":["330634195_The_Impact_of_E-Learning_in_Medical_Education","307822431_Blended_learning_in_Saudi_universities_challenges_and_perspectives","279727089_Perception_of_MBBS_students_to_Flipped_class_roomapproach_in_neuroanatomy_module","260681289_Effects_of_a_blended_learning_approach_on_student_outcomes_in_a_graduate-level_public_health_course","259882378_Blended_learning_in_health_education_three_case_studies","259347511_Adopting_a_blended_learning_approach_to_teaching_Evidence_Based_Medicine_a_mixed_methods_study","306199862_The_flipped_classroom_a_course_design_to_foster_learning_and_engagement_in_health_professions_education","301234741_Research_Perspectives_and_Recommendations_on_Implementing_the_Flipped_Classroom","284563630_Assessment_of_learning_gains_in_a_flipped_biochemistry_classroom","284240795_Effectiveness_of_the_Surgery_Core_Clerkship_Flipped_Classroom_a_prospective_cohort_trial"]}