{"id":"307610390_Politicas_de_avaliacao_em_larga_escala_o_ENADE_interfere_na_gestao_dos_cursos","abstract":"O presente trabalho analisa como os gestores (coordenadores) dos cursos de graduacao avaliam o ENADE enquanto politica de avaliacao em larga escala e de que estrategias de gestao lancam mao para melhorar a avaliacao dos cursos. Os sujeitos da pesquisa foram os coordenadores de curso da URI - Campus de Frederico Westphalen/RS. No processo de investigacao utilizou-se a abordagem qualitativa. A partir dos referenciais teoricos e da coleta e analise dos dados, chegou-se a algumas conclusoes provisorias: a. grande parcela dos coordenadores entrevistados esta buscando novas possibilidades para qualificar os cursos, contudo, ainda sao tentativas isoladas e muito subjetivas; b. a preocupacao com resultados quantitativos e muito forte, sobrepondo-se aos processos qualitativos; c. o ENADE, como avaliacao em larga escala, nao esta conseguindo desencadear um processo profundo de discussao teorica, pois e trabalhado pela grande maioria dos cursos um semestre antes de realizarem o exame. Palavras-chave: Universidade e avaliacao. Avaliacao em larga escala. ENADE. Abstract Evaluation policies on a large scale: does ENADE interfere in the management of the courses? This paper analyzes how managers (coordinators) of graduation courses evaluate ENADE as a large-scale evaluation policy and which management strategies they employ to improve course evaluations. The research participants were course coordinators at URI - Frederico Westphalen/RS Campus. The investigation process was carried out through a qualitative approach. From the theoretical background and data collection and analysis, some interim findings are presented: a. great part of the coordinators interviewed is seeking new possibilities to qualify the courses, however, these are isolated and very subjective attempts; b. the concern with quantitative results is very strong, overcoming qualitative processes; c. ENADE, as a large-scale evaluation, has not been able to trigger a deep process of theoretical discussion, since it is worked in most courses only one semester before the exam is taken. Keywords: University and evaluation. Large-scale evaluation. ENADE. Resumen Politicas de evaluacion a gran escala: ?el ENADE interfiere en la gestion de los cursos? El presente trabajo analiza como los gestores (coordinadores) de los cursos de grado evaluan el ENADE como politica de evaluacion a gran escala y que estrategias de gestion son utilizadas para mejorar la evaluacion de los cursos. Los sujetos de la pesquisa fueron los coordinadores del curso de la URI - Campus de Frederico Westphalen/RS. En el proceso de investigacion se utilizo el abordaje cualitativo. A partir de referenciales teoricos y de la coleta y analisis de los datos, se llego a algunas conclusiones provisorias: a. gran parcela de los coordinadores entrevistados esta buscando nuevas posibilidades para calificar los cursos, entretanto, aun son intentos aislados y muy subjetivos; b. la preocupacion con resultados cuantitativos es muy fuerte, sobreponiendose a los procesos cualitativos; c. el ENADE, como evaluacion en gran escala, no consigue desarrollar un proceso profundo de discusiones teoricas, pues es trabajado por la gran mayoria de los cursos un semestre antes de que se realice el examen. Palabras clave: Universidad y evaluacion. Evaluacion en gran escala. ENADE.","authors":["Silvia Regina Canan","Vanessa Taís Eloy"],"meta":["September 2016","DOI:10.5212/PraxEduc.v.11i3.0006"],"references":[]}