{"id":"307612447_Sociopolitical_Participation_of_Kuwaiti_Women_in_the_Development_Process_Current_State_and_Challenges_Ahead","abstract":"This study explores the sociocultural status of Kuwaiti women and examines the obstacles that may hinder them from participating in socioeconomic development of Kuwait. The study analyzes the nature of legislative, political, sociocultural, and economic challenges faced by Kuwaiti women and suggests measures to overcome these obstacles to help women in attaining a prime role in the development process. The survey sample included 300 Kuwaiti citizens of both genders selected randomly from different social and professional backgrounds. Statistical analyses including mean values and covariance analysis revealed the awareness of gender-based differences in attitudes on the nature of constraints faced in moving toward the progress of Kuwaiti women. Discussed are social, economic, and knowledge-based constraints that restrain women from playing an active role in the socioeconomic development of Kuwait. Future directions include the acknowledgement of increased levels of education among Kuwaiti women and the available talent pool that will remain underutilized if women are not raised to leadership levels. Further research is needed on the scope and challenges in implementing strategies for the empowerment of women as a part of legislation.","authors":["Ali Z. Alzuabi"],"meta":["September 2016Journal of Social Service Research 42(5):1-14","DOI:10.1080/01488376.2016.1212775"],"references":["254946759_Women_and_education_in_Saudi_Arabia_Challenges_and_achievements","300258123_3_Mainstreaming_gender_equity_to_national_development_planning","298074664_The_Middle_East_and_North_Africa","286874588_Adaptive_Preferences_and_Women's_Empowerment","277521000_Ethnic_differences_in_women's_employment_the_changing_role_of_qualifications","263307689_The_influence_of_traditional_culture_on_attitudes_towards_work_among_Kuwaiti_women_employees_in_the_public_sector","249108295_Islamic_Feminism_and_Its_Discontents_Toward_a_Resolution_of_the_Debate","240257735_Attitudes_towards_women_who_work_in_Egypt","237775874_Obstacles_to_Women's_Participation_in_Parliament","5215822_Ethnic_differences_in_women's_employment_The_changing_role_of_qualifications"]}