{"id":"307787080_The_effects_of_ZrO2_nanoparticles_on_physical_and_mechanical_properties_of_high_strength_self_compacting_concrete","abstract":"In this work, strength assessments and coefficient of water absorption of high performance self compacting concrete containing different amounts of ZrO2 nanoparticles have been investigated. The results indicate that the strength and the resistance to water permeability of the specimens are improved by adding ZrO2 nanoparticles in the cement paste up to 4.0 wt. (%). ZrO2 nanoparticles, as a result of increased crystalline Ca(OH)2 amount especially at the early age of hydration, could accelerate C-S-H gel formation and hence increase the strength of the concrete specimens. In addition, ZrO2 nanoparticles are able to act as nanofillers and recover the pore structure of the specimens by decreasing harmful pores. Several empirical relationships have been presented to predict flexural and split tensile strength of the specimens by means of the corresponding compressive strength at a certain age of curing. Accelerated peak appearance in conduction calorimetry tests, more weight loss in thermogravimetric analysis and more rapid appearance of the peaks related to hydrated products in X-ray diffraction results, all indicate that ZrO2 nanoparticles could improve mechanical and physical properties of the concrete specimens.","authors":["Ali Nazari","Shadi Riahi"],"meta":["December 2010Materials Research 13(4)","DOI:10.1590/S1516-14392010000400019"],"references":["279902414_Workability_testing_and_performance_of_self-consolidating_concrete","313606456_Anchorage_and_cracking_behaviour_of_self-compacting_concrete","312716040_Standard_Test_Method_for_Splitting_Tensile_Strength_of_Cylindrical_Concrete_Specimens_Annual_Book_of_ASTM_Standards","303042074_Engineering_of_SiO2_nanoparticles_for_optimal_performance_in_nano_cement-based_materials","285129467_Improvement_the_mechanical_properties_of_the_concrete_by_using_TiO2_nanoparticles","284295965_Fracture_behaviour_of_self-compacting_concrete","284088958_Self-compacting_concrete_for_precast_concrete_products_in_Germany","284070900_Self-compacting_concrete-time_development_of_material_properties_and_bond_behaviour","284024600_Permeability_as_seen_by_the_researcher","280642073_ACI_defines_high-performance_concrete"]}