{"id":"307730089_Question_Classification_using_Semantic_Syntactic_and_Lexical_features","abstract":"Question classification is very important for question answering. This paper present our research work onquestion classification through machine learning approach. In order to train the learning model, wedesigned a rich set of features that are predictive of question categories. An important component ofquestion answering systems is question classification. The task of question classification is to predict theentity type of the answer of a natural language question. Question classification is typically done usingmachine learning techniques. Different lexical, syntactical and semantic features can be extracted from aquestion. In this work we combined lexical, syntactic and semantic features which improve the accuracy ofclassification. Furthermore, we adopted three different classifiers: Nearest Neighbors (NN), Naïve Bayes(NB), and Support Vector Machines (SVM) using two kinds of features: bag-of-words and bag-of n grams.Furthermore, we discovered that when we take SVM classifier and combine the semantic, syntactic, lexicalfeature we found that it will improve the accuracy of classification. We tested our proposed approaches onthe well-known UIUC dataset and succeeded to achieve a new record on the accuracy of classification onthis dataset.","authors":["Megha Mishra","Vishnu Kumar Mishra","H.R. Sharma"],"meta":["July 2013","DOI:10.5121/ijwest.2013.4304"],"references":["221159550_Priberam's_Question_Answering_System_in_a_Cross-Language_Environment","307881957_LIBSVM_A_library_for_support_vector_machines","269953350_WordNet_An_Electronic_Lexical_Database","238519090_Formalized_answer_extraction_technology_based_on_pattern_learning","238009031_Research_and_application_of_information_retrieval_techniques_in_Intelligent_Question_Answering_System","222395291_An_efficient_inverted_index_technique_for_XML_documents_using_RDBMS","221301165_Question_classification_with_log-linear_models","221299024_Question_classification_using_support_vector_machines","221151901_Question_Classification_by_Weighted_Combination_of_Lexical_Syntactic_and_Semantic_Features","221101716_Learning_Question_Classifiers"]}