{"id":"307746242_Urban_Form_and_Greenhouse_Gas_Emissions_Findings_Strategies_and_Design_Decision_Support_Technologies","abstract":"The research reported in this dissertation contains three complementary and overlapping parts:One, “findings”: It assesses the factors of urban morphology that contribute to increased rates of greenhouse gas emissions per capita, and the ways they interact. It finds a significant but underrepresented set of factors, distinct from but relating the factors at the individual building scale and the scale of regional transportation systems.Two, “strategies”: It assesses the methodologies by which such findings might be put to use in identifying and achieving reductions through changes in urban design, and proposes new strategies to do so using innovative forms of design decision support tools.Three, “design decision support tools”: It then proposes a specific new technology, namely a new class of open-source scenario-modelling tool, embodied in new prototype software. The tool utilizes a new kind of “federated” web-based wiki technology incorporating design pattern languages, which was developed in collaboration with the software engineer and wiki inventor Ward Cunningham.As part of this research, it has been necessary to examine fundamental methodological questions, and to account for limitations of current data as well as current significant gaps in research. In the process, this research has made a modest contribution to the state of knowledge about additional research needed.For me, this work has also highlighted the need for urgent and effective reforms to current “business as usual” practices. The need is all the more urgent given unprecedented rates of urbanisation – much of it sprawling and resource-inefficient – taking place in many parts of the world today.","authors":["Michael Mehaffy"],"meta":["November 2015","DOI:10.7480/abe.2015.14"],"references":["336569611_Choice_Architecture_and_Design_with_Intent","315284010_The_factors_of_urban_morphology_in_greenhouse_gas_emissions_A_research_overview","333516877_Towards_a_climate-friendly_built_environment","330365222_Environmental_correlates_of_walking_and_cycling_Findings_from_the_transportation_urban_design_and_planning_literatures","322977332_TRANSPORTATION_MODELING_LESSONS_FROM_THE_PAST_AND_TASKS_FOR_THE_FUTURE","320181465_The_origins_of_order_self-organization_and_selection_in_evolution","318494453_Metaphors_We_Live_By","313227627_Automotive_Life_Cycle_Assessment_Overview_Metrics_and_Examples","313203353_The_architecture_of_complexity","312330822_Open_Source_Software_and_the_Private-Collective_Innovation_Model_Issues_for_Organization_Science","303569381_Comparison_of_Household_Consumption_and_Regional_Production_Approaches_to_Assessing_Urban_Energy_Use_and_Implications_for_Policy","292951350_Perspectives_On_The_LEED_Leadership_In_Energy_And_Environmental_Design_System_As_A_Green_Certification_Standard","310457517_Engaging_the_Future_Forecasts_Scenarios_Plans_and_Projects","305553916_The_Death_and_Life_of_Great_American_Cities","303131868_A_city_is_not_a_tree"]}