{"id":"307862069_Assembly_sequence_optimization_using_a_Flower_Pollination_Algorithm-based_approach","abstract":"One of the important decisions in assembly process planning is determination of assembly sequence. Choice of the optimum sequence is made difficult due to various reasons. There are various precedence constraints and optimization criteria. Moreover, a product may be possible to assemble in many alternative ways following different sequences, thus making assembly sequence optimization a multi-modal optimization problem with multiple optimum solutions. It is necessary to generate as many unique optimum solutions as possible in order to allow the process planner to take a decision. Moreover, with increase in part count, the number of feasible sequences rises staggeringly, thereby making assembly sequence optimization laborious and time consuming. Most conventional mathematical algorithms are known to perform poorly when used to obtain multiple optimum solutions. On the other hand, soft computing based evolutionary optimization algorithms are good candidates for multi-modal optimization. Another challenge is to develop an algorithm that can automatically maintain diversity in the optimum solutions found over the generations (i.e. optimum solutions having the same fitness but unique). Keeping the above in mind, in the present paper, an intelligent assembly sequence optimization methodology based on application of flower pollination algorithm (FPA) has been developed to automatically generate multiple unique optimal assembly sequences, subject to various precedence constraints, based on minimisation of number of orientation changes and tool changes. Since in the present paper, FPA has been applied for the first time to a discrete optimization problem like assembly sequence optimization, the main challenge before us in applying FPA was the continuous nature of the original FPA. Therefore, modifications have been made by us in the rules for local and global pollination of FPA to make it suited for solving the given discrete optimization problem. In order to evaluate the performance of FPA, the results have been compared with two other well-known soft computing techniques namely, Genetic Algorithm (GA) and Ant Colony Optimization (ACO) and also with a recently published soft computing based algorithm, Improved Harmony Search (IHS). It was found that the novelty of the proposed FPA lies in its capability to find multiple unique optimum solutions in one single simulation run and capability to automatically maintain diversity in the optimum solutions found over the generations. On the other hand, in case of GA, ACO and IHS, it is not possible to maintain the diversity in multiple optimum solutions as the complete population finally converges to a few unique optimum solutions. Therefore, it can be concluded that FPA performs better in solving the given multi-modal optimization problem of assembly sequence optimization.","authors":["atul mishra","Sankha Deb"],"meta":["February 2019Journal of Intelligent Manufacturing 30(2)","DOI:10.1007/s10845-016-1261-7"],"references":["282427111_Assembly_sequence_planning_based_on_an_improved_harmony_search_algorithm","263174272_Flower_Pollination_Algorithm_Flower_Algorithm","348901841_Flower_Pollination_Algorithms","323783816_Handbook_of_Mathematical_Functions_with_Formulas_Graphs_and_Mathematical_Tables","319394494_Handbook_of_Mathematical_Functions_with_Formulas_Graphs_and_Mathematical_Tables","313769512_Chaotic_particle_swarm_optimization_for_assembly_sequence_planning","283813162_Energy_conservation_by_design_optimization_of_flywheel_using_Flower_Pollination_Algorithm","276841572_A_Biologically_Inspired_Modified_Flower_Pollination_Algorithm_for_Solving_Economic_Dispatch_Problems_in_Modern_Power_Systems","271657139_Research_on_a_kind_of_assembly_sequence_planning_based_on_immune_algorithm_and_particle_swarm_optimization_algorithm","260528463_Consensus_tree_method_for_generating_master_assembly_sequence"]}