{"id":"307840661_Understanding_Social_Media_Logic","abstract":"Over the past decade, social media platforms have penetrated deeply into the mech­anics of everyday life, affecting people's informal interactions, as well as institutional structures and professional routines. Far from being neutral platforms for everyone, social media have changed the conditions and rules of social interaction. In this article, we examine the intricate dynamic between social media platforms, mass media, users, and social institutions by calling attention to social media logic—the norms, strategies, mechanisms, and economies—underpin­ning its dynamics. This logic will be considered in light of what has been identified as mass me­dia logic, which has helped spread the media's powerful discourse outside its institutional boundaries. Theorizing social media logic, we identify four grounding principles—programmabil­ity, popularity, connectivity, and datafication—and argue that these principles become increas­ingly entangled with mass media logic. The logic of social media, rooted in these grounding principles and strategies, is gradually invading all areas of public life. Besides print news and broadcasting, it also affects law and order, social activism, politics, and so forth. Therefore, its sustaining logic and widespread dissemination deserve to be scrutinized in detail in order to better understand its impact in various domains. Concentrating on the tactics and strategies at work in social media logic, we reassess the constellation of power relationships in which social practices unfold, raising questions such as: How does social media logic modify or enhance ex­isting mass media logic? And how is this new media logic exported beyond the boundaries of (social or mass) media proper? The underlying principles, tactics, and strategies may be relat­ively simple to identify, but it is much harder to map the complex connections between plat­forms that distribute this logic: users that employ them, technologies that drive them, economic structures that scaffold them, and institutional bodies that incorporate them.","authors":["José Van Dijck","Thomas Poell"],"meta":["August 2013Media and Communication 1(1)","DOI:10.17645/mac.v1i1.70"],"references":["285098685_Ideology_Frame_Resonance_and_Participant_Mobilization","281562384_The_Relevance_of_Algorithms","344874328_Introduction_Opportunities_mobilizing_structures_and_framing_processes_-_toward_a_synthetic_comparative_perspective_on_social_movements","324339706_The_Volunteer_Subject","318471044_The_Big_Spin_Strategic_Communication_and_the_Transformation_of_Pluralist_Democracy","309234205_Government_by_spin_An_analysis_of_the_process","309043557_The_Relevance_of_Algorithms","288260568_Not_the_Twitter_election_The_dynamics_of_the_ausvotes_conversation_in_relation_to_the_Australian_media_ecology","283985962_The_Culture_of_Connectivity_A_Critical_History_of_Social_Media","279409730_The_refraction_chamber_Twitter_as_sphere_and_network"]}