{"id":"307886721_Article_original","abstract":"Apport des sciences cognitives à l'optimisation de l'interface entre le praticien et les nouvelles technologies en orthodontie The contribution of cognitive science to the optimization of the interface between the practitioner and new technology in orthodontic treatments M. Makaremi Spécialiste qualifié en orthopédie dento-faciale RÉSUMÉ Les nouvelles technologies numériques et digitales modifient en profondeur le rôle et l'identité du praticien dans l'orthodontie du XXI e siècle. Les performances issues des procédés de fabrication CAD/CAM (Computer-Aided Design/Computer-Aided Manufacturing) se substituent à la compétence technique du praticien, qui n'a plus besoin d'être l'artisan de l'outil thérapeutique sur mesure. La véritable valeur ajoutée du praticien se trouve alors dans la perception, la stratégie et l'ana-lyse cognitive qu'il fait de la situation clinique, et dans sa capacité à transmettre ces données au procédé de fabrication. Dans ce nouveau schéma thérapeutique, les ABSTRACT New digital and numeric technologies modify profoundly the role and the identity of the practitioner in the 21 st century orthodontic treatments. Performances issued from the CAD/CAM fabrication proceedings (Computer-Aided Design/Computer-aided Manufacturing) are substituting the technical competence of the practitioner , who no longer needs to be the craftsman of the made to measure therapeutic tool. The real additional value of the practitioner is found more in his perception , strategy and cognitive analysis that he is able to assess in the clinical situation and his capacity to pass on the information on to the fabrication process. In this RODF50_N3_00_160017.indd 1 RODF50_N3_00_160017.indd 1","authors":["Makaremi Masrour"],"meta":["July 2016Revue d Orthopédie Dento-Faciale 50(3)","DOI:10.1051/odf/2016017"],"references":["299418577_Dictionnaire_des_sciences_cognitives_arabic_translation","233838993_Lexical_fields_of_predictive_and_personalized_medicine","216792739_Efficient_Learning_of_Sparse_Representations_with_an_Energy-Based_Model","344896617_Plans_and_the_structure_of_behavior","287053114_A_dental_model_segmentation_algorithm_for_Invisalign_software","272746100_Aux_origines_des_sciences_cognitives","258954357_New_developments_in_cephalometrics","246240119_Nouveaux_developpements_en_IRM","242639238_Plans_and_the_structure_of_behavior","232553418_Plans_and_The_Structure_of_Behavior"]}