{"id":"307822863_An_Overview_of_Microsoft_Academic_Service_MAS_and_Applications","abstract":"In this paper we describe a new release of a Web scale entity graph that serves as the backbone of Microsoft Academic Service (MAS), a major production effort with a broadened scope to the namesake vertical search engine that has been publicly available since 2008 as a research prototype. At the core of MAS is a heterogeneous entity graph comprised of six types of entities that model the scholarly activities: field of study, author, institution, paper, venue, and event. In addition to obtaining these entities from the publisher feeds as in the previous effort, we in this version include data mining results from the Web index and an in-house knowledge base from Bing, a major commercial search engine. As a result of the Bing integration, the new MAS graph sees significant increase in size, with fresh information streaming in automatically following their discoveries by the search engine. In addition, the rich entity relations included in the knowledge base provide additional signals to disambiguate and enrich the entities within and beyond the academic domain. The number of papers indexed by MAS, for instance, has grown from low tens of millions to 83 million while maintaining an above 95% accuracy based on test data sets derived from academic activities at Microsoft Research. Based on the data set, we demonstrate two scenarios in this work: a knowledge driven, highly interactive dialog that seamlessly combines reactive search and proactive suggestion experience, and a proactive heterogeneous entity recommendation.","authors":["Arnab Sinha","Zhihong Shen","Yang Song","Hao Ma"],"meta":["May 2015","DOI:10.1145/2740908.2742839","Conference: the 24th International Conference"],"references":["260480555_Are_Elite_Journals_Declining","221299609_Recommending_citations_for_academic_papers","220466505_Real_Life_Information_Retrieval_A_Study_of_User_Queries_on_the_Web","200051070_Query_Recommendation_Using_Query_Logs_in_Search_Engines","266677265_Rise_of_the_Rest_The_Growing_Impact_of_Non-Elite_Journals","266660437_ClusCite_effective_citation_recommendation_by_information_network-based_clustering","266660245_Knowledge_vault_A_web-scale_approach_to_probabilistic_knowledge_fusion","221520039_Bing_dialog_model_intent_knowledge_and_user_interaction","220924403_Efficient_Topic-based_Unsupervised_Name_Disambiguation","220699025_Efficient_Name_Disambiguation_for_Large-Scale_Databases"]}