{"id":"307844881_Barriers_to_tacit_knowledge_retention_An_understanding_of_the_perceptions_of_the_knowledge_management_of_people_inside_and_outside_the_organisation","abstract":"Background: Knowledge loss causes challenges for organisations that wish to remain competitive. These organisations must identify the risks that could lead to knowledge loss and become aware of issues that affect knowledge retention.Objectives: The objective of this research was to identify tacit knowledge retention barriers that could cause knowledge loss in an organisation. The paper presents a framework for the assessment of the impact of these barriers and discusses the research findings in order to critique that framework.Method: A quantitative strategy was used to interpret the findings. The target population is information technology (IT) professionals in a government organisation. Interviews were conducted in order to produce a more context-sensitive interpretation of the findings. A quantitative research approach was used to ensure the findings would precisely reflect the target population.Results: The majority of respondents confirmed that career development requires professional development, training prospects and improves the employability of employees. The agreed result was that respondents seek autonomy, that is, the ability to make decisions. Job stress and burnout are experienced because of problems with in filling posts, and the competition between the private and public sectors for experienced IT employees.Conclusion: Certain determinants were found that affect barriers in knowledge management: organisational commitment, job satisfaction, job characteristics and talent management. These need to be measured to prevent barriers from occurring. Implications are drawn from the study; these provide a focus for further research to bridge some gaps in information technology that currently limit the widespread use of knowledge management.","authors":["Jacky Bessick","Visvanathan Naicker"],"meta":["July 2013SA Journal of Information Management 15(2)","DOI:10.4102/sajim.v15i2.556"],"references":["268385145_Retention_of_technical_professionals_-_a_reminder_for_engineering_and_technology_organisations","263599802_Knowledge_Management_Where_Did_it_Come_From_and_Where_Will_It_Go","247613394_Talent_management_Making_it_real","242489781_Knowledge_sharing_acts_as_a_significant_antecedent_to_organizational_commitment_in_a_Confucian_culture_A_quantitative_study_of_employees_in_the_Hong_Kong_ICT_industry","242025358_Knowledge_managements","344716019_Determinants_of_Organizational_Commitment_A_Study_of_Information_Technology_Professionals_in_Pakistan","254607059_Research_Methods_in_Everyday_Life_Blending_Qualitative_and_Quantitative_Approaches","251880197_The_Knowledge_Creating_Company","247610497_Fostering_talent_opportunity_Getting_past_first-base","242342008_Recruiting_and_retaining_scarce_information_technology_talent_A_focus_group_study"]}