{"id":"307838690_Problem-based_learning_spanning_real_and_virtual_words_a_case_study_in_Second_Life","abstract":"There is a growing use of immersive virtual environments for educational purposes. However, much of this activity is not yet documented in the public domain, or is descriptive rather than analytical. This paper presents a case study in which university students were tasked with building an interactive learning experience using Second Life as a platform. Both problem-based learning and constructionism acted as framing pedagogies for the task, with students working in teams to design and build a learning experience which could potentially meet the needs of a real client in innovative ways which might not be possible in real life. A process account of the experience is provided, which examines how the pedagogies and contexts (real and virtual) influence and enhance each other. The use of a virtual environment, combined with problem-based learning and constructionism, subtly changed the nature of the instructor–student relationship, allowed students to explore ‘problematic problems' in a motivating and relevant manner, provided students with greater ownership over their work, and allowed problems to be set which were flexible, but at the same time allowed for ease of assessment.","authors":["Judith Good","Kate Howland","Liz Thackray"],"meta":["December 2008Research in Learning Technology 16(3)","DOI:10.3402/rlt.v16i3.10895"],"references":["243783611_Problem-based_Learning_in_Higher_Education_Untold_Stories","312910795_Becoming_a_problem-based_tutor_Increasing_self-awareness_through_faculty_development","303990302_Overcoming_Barriers_to_Student_Understanding_Threshold_concepts_and_troublesome_knowledge","251371833_Threshold_Concepts_and_Troublesome_Knowledge","246227869_Foundations_of_Problem-Based_Learning","240192341_Problem-Based_Learning_in_Education_for_the_Professions","227828814_Disciplinary_differences_or_modes_of_curriculum_practice_Who_promised_to_deliver_what_in_problem-based_learning","19366265_A_Taxonomy_of_Problem-Based_Learning_Method"]}