{"id":"307894281_On_measuring_the_lattice_of_commonalities_among_several_linked_datasets","abstract":"A big number of datasets has been published according to the principles of Linked Data and this number keeps increasing. Although the ultimate objective is linking and integration, it is not currently evident how connected the current LOD cloud is. Measurements (and indexes) that\ninvolve more than two datasets are not available although they are important: (a) for obtaining complete information about one particular URI (or set of URIs) with provenance (b) for aiding dataset discovery and selection, (c) for assessing the connectivity between any set of datasets for quality checking and for monitoring their evolution over time, (d) for constructing visualizations that provide more informative overviews. Since it would be prohibitively expensive to perform all these measurements in a naive way, in this paper we introduce indexes (and their construction algorithms) that can speedup such tasks. In brief, we introduce (i) a namespace-based prefix index, (ii) a sameAs catalog for computing the symmetric and transitive closure of the owl:sameAs relationships encountered in the datasets, (iii) a semantics-aware element index (that exploits the afore mentioned indexes), and finally (iv) two lattice-based incremental algorithms for speeding up the computation of the intersection of URIs of any set of datasets. We discuss the speedup obtained by the introduced indexes and algorithms through comparative results and finally we report measurements about connectivity of the LOD cloud that have never been carried out so far.","authors":["Michalis Mountantonakis","Yannis Tzitzikas"],"meta":["August 2016Proceedings of the VLDB Endowment 9(12):1101-1112","DOI:10.14778/2994509.2994527","Project: Exploratory Search"],"references":["300338058_LOD_Lab_Experiments_at_LOD_Scale","297689938_Dataset_Recommendation_for_Data_Linking_An_Intensional_Approach","290450238_Processing_SPARQL_queries_over_distributed_RDF_graphs","284200058_Quality_assessment_for_Linked_Data_A_Survey","326474061_Searching_and_Browsing_Linked_Data_with_SWSE_The_Semantic_Web_Search_Engine","319395258_Describing_Linked_Datasets_with_the_VoID_Vocabulary","305451267_Quantifying_the_Connectivity_of_a_Semantic_Warehouse_and_Understanding_its_Evolution_over_Time","301856602_Exploration_and_Visualization_in_the_Web_of_Big_Linked_Data_A_Survey_of_the_State_of_the_Art","290767285_Adoption_of_the_Linked_Data_Best_Practices_in_Different_Topical_Domains","284570036_GConnect"]}