{"id":"307872626_Which_conception_of_political_equality_do_deliberative_mini-publics_promote","abstract":"In democratic political systems, political equality is often defined as an equality of opportunity for influence. But inequalities in resources and status affect the capacity of disadvantaged citizens to achieve an effective political equality. One common thread running through recent democratic innovations is the belief that appropriate institutional devices and procedures can alleviate the impact of background inequalities on the presence and voice of the disadvantaged within those designs. My objective is to achieve a clearer understanding of the conception of political equality that informs a specific subset of these designs: deliberative mini-publics. I focus firstly on the methods of participant selection advocated to secure equal presence. According to what principle is participation distributed? If it is according to the ‘equal probability’ principle, rather than ‘equal opportunity’, what difference does this make in terms of political equality? Secondly, achieving equality of voice is usually conceived in terms of equalising opportunities for influence among participants. How is this objective understood and what does this say about the underlying conception of political equality?","authors":["Dominique Leydet"],"meta":["September 2016European Journal of Political Theory 18(4)","DOI:10.1177/1474885116665600"],"references":["341073464_Stakeholder_and_Citizen_Roles_in_Public_Deliberation","316699816_The_Politics_of_Public_Deliberation_Citizen_Engagement_and_Interest_Advocacy","312902885_Democratic_innovations_designing_institutions_for_citizen_participation","303100082_Deliberative_polling_From_experiment_to_community_resource","301602672_Les_budgets_participatifs","300857816_Who_were_the_Participants","299364273_Defining_mini-publics","293816495_The_Participation_and_Recruitment_Challenge","292634957_Who_should_govern_who_governs_The_role_of_citizens_in_reforming_the_electoral_system","292566676_Descriptive_representation_in_the_British_Columbia_citizens'_assembly"]}