{"id":"307810633_Resilience_and_disaster_risk_reduction_an_etymological_journey","abstract":"This paper examines the development over historical time of the meaning and\nuses of the term resilience. The objective is to deepen our understanding of\nhow the term came to be adopted in disaster risk reduction and resolve some\nof the conflicts and controversies that have arisen when it has been used.\nThe paper traces the development of resilience through the sciences,\nhumanities, and legal and political spheres. It considers how mechanics\npassed the word to ecology and psychology, and how from there it was adopted\nby social research and sustainability science. As other authors have noted,\nas a concept, resilience involves some potentially serious conflicts or\ncontradictions, for example between stability and dynamism, or between\ndynamic equilibrium (homeostasis) and evolution. Moreover, although the\nresilience concept works quite well within the confines of general systems\ntheory, in situations in which a systems formulation inhibits rather than\nfosters explanation, a different interpretation of the term is warranted.\nThis may be the case for disaster risk reduction, which involves\ntransformation rather than preservation of the \"state of the system\". The\narticle concludes that the modern conception of resilience derives benefit\nfrom a rich history of meanings and applications, but that it is\ndangerous – or at least potentially disappointing – to read to much into the\nterm as a model and a paradigm.","authors":["D. E. Alexander"],"meta":["November 2013Natural Hazards and Earth System Sciences 13(11)","DOI:10.5194/nhess-13-2707-2013"],"references":["305199600_Conceptual_Pitfalls_and_Rangeland_Resilience","288546328_Beware_paradigm_creep_and_buzzword_mutation","323368944_The_Vulnerability_of_Cities_Natural_Disasters_and_Social_Resilience","318781311_Sustainability_and_community_resilience_The_holy_grail_of_hazards_planning","303836548_An_outline_of_General_Systems_Theory","303129190_Panic_during_earthquakes_and_its_urban_and_cultural_contexts","288604819_Vulnerability_Resilience_and_the_collapse_of_socieiy_A_review_of_models_and_possible_climatic_applications","287381813_The_Vulnerability_of_Cities_Natural_Disasters_and_Social_Resilience","285748201_Resilience_against_earthquakes_some_practical_suggestions_for_planners_and_managers","284850116_Some_Problems_of_Land_Tenure_in_Contemporary_Africa"]}