{"id":"307914137_Guiding_reinvention_of_conventional_tools_of_mathematical_logic_students'_reasoning_about_mathematical_disjunctions","abstract":"Motivated by the observation that formal logic answers questions students have not yet asked, we conducted exploratory teaching experiments with undergraduate students intended to guide their reinvention of truth-functional definitions for basic logical connectives. We intend to reframe the relationship between reasoning and logic by showing how logic emerges within students’ mathematical activity. This activity entails reflecting on and systematizing their own language use across diverse semantic content. We present categories of students’ untrained strategies for assessing the truth-values for mathematical disjunctions. Students’ initial reasoning heavily reflected content-specific and pragmatic factors in ways inconsistent with the norms and conventions of mathematical logic. Despite this, all student groups reinvented the standard truth-functional definition for simple disjunctions. We demonstrate how this learning depended upon particular forms of reasoning about logic. We also contrast various strategies for assessing quantified disjunctions and their different affordances in students’ mathematical activity.","authors":["Paul Christian Dawkins","John Paul Cook"],"meta":["March 2017Educational Studies in Mathematics 94(3)","DOI:10.1007/s10649-016-9722-7"],"references":["340473215_Distilling_Ideas","329651243_Human_Reasoning_and_Cognitive_Science","325671241_Conditionals_A_theory_of_meaning_pragmatics_and_inference","319394210_The_Psychology_of_Proof_Deductive_Reasoning_in_Human_Thinking","313142231_Logic_and_conversation","309186306_Logic_and_conversation","303165798_The_impact_of_'meaning'_on_students'_ability_to_negate_statements","300222876_On_student_understanding_of_AE_and_EA_quantification","288437027_The_role_of_prior_belief_in_reasoning","287266872_Hypothetical_Thinking_Dual_Processes_in_Reasoning_and_Judgement"]}