{"id":"307968826_Digital_mammographic_tumor_classification_using_transfer_learning_from_deep_convolutional_neural_networks","abstract":"Convolutional neural networks (CNNs) show potential for computer-aided diagnosis (CADx) by learning features directly from the image data instead of using analytically extracted features. However, CNNs are difficult to train from scratch for medical images due to small sample sizes and variations in tumor presentations. Instead, transfer learning can be used to extract tumor information from medical images via CNNs originally pretrained for nonmedical tasks, alleviating the need for large datasets. Our database includes 219 breast lesions (607 full-field digital mammographic images). We compared support vector machine classifiers based on the CNN-extracted image features and our prior computer-extracted tumor features in the task of distinguishing between benign and malignant breast lesions. Five-fold cross validation (by lesion) was conducted with the area under the receiver operating characteristic (ROC) curve as the performance metric. Results show that classifiers based on CNN-extracted features (with transfer learning) perform comparably to those using analytically extracted features [area under the ROC curve [Formula: see text]]. Further, the performance of ensemble classifiers based on both types was significantly better than that of either classifier type alone ([Formula: see text] versus 0.81, [Formula: see text]). We conclude that transfer learning can improve current CADx methods while also providing standalone classifiers without large datasets, facilitating machine-learning methods in radiomics and precision medicine.","authors":["Benjamin Q Huynh","Hui Li","Maryellen L. Giger"],"meta":["July 2016Journal of Medical Imaging 3(3):034501","DOI:10.1117/1.JMI.3.3.034501"],"references":["313484584_On_combining_classifiers","305196650_Going_deeper_with_convolutions","319770357_DeCAF_A_Deep_Convolutional_Activation_Feature_for_Generic_Visual_Recognition","319770291_Very_Deep_Convolutional_Networks_for_Large-Scale_Image_Recognition","319770276_CNN_Features_off-the-shelf_an_Astounding_Baseline_for_Recognition","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","312538118_Support-vector_networks","312145950_Mitosis_detection_in_breast_cancer_pathology_images_by_combining_handcrafted_and_convolutional_neural_network_features","308861743_A_comparative_study_for_chest_radiograph_image_retrieval_using_binary_texture_and_deep_learning_classification","305193512_Unregistered_Multiview_Mammogram_Analysis_with_Pre-trained_Deep_Learning_Models"]}