{"id":"307950618_Factors_contributing_to_the_psychological_well-being_for_Hong_Kong_Chinese_children_from_low-income_families_A_qualitative_study","abstract":"Background\nDespite compelling evidence demonstrating the negative impact of poverty and income disparity on children’s psychological well-being, there has been a lack of qualitative information which addresses its contributing factors. This study aimed to shed light on this area by comparing the experiences toward daily life between children living in low- and high-income families. MethodsA qualitative study using a phenomenological approach was conducted from May 2012 to January 2013. A random sample of 42 children aged 10–13, with 25 from low- and 17 from high-income families were asked to voluntarily response to a demographic sheet and undergo individual semi-structured interviews which lasted about 25–30 min. Content analysis was used to analyze the data. Approval for the study was obtained from the Institutional Review Board of the University of Hong Kong/Hospital Authority Hong Kong West Cluster (reference UW 12-237). ResultsThe findings of this study revealed that the living environment, physical health, social life and ability to function at school of children from low-income families are severely impaired. Conclusions\nIt fills a gap in the literature by showing how poverty and income disparity affect the daily lives of children from low-income families on different levels. Also, adopting a sedentary lifestyle and unhealthy eating habits are possible factors mediating the effects of poverty and income disparity on the psychological well-being of children from low-income families. It is vital for healthcare professionals going beyond their normal roles to give advice on healthy lifestyles and behaviors by building multidisciplinary partnerships with schools and the community. Additionally, healthcare professionals should also target on these two possible factors to develop and implement appropriate interventions for promoting the psychological well-being among children living in poverty.Trial registration NCT02877719. 19 August 2016 retrospectively registered","authors":["Ka Yan Ho","Ho Cheung William Li","Joyce Oi Kwan Chung","Ka Wai Katherine Lam"],"meta":["September 2016International Journal of Mental Health Systems 10(1)","DOI:10.1186/s13033-016-0088-0"],"references":["275974984_The_relationship_between_physical_activity_sedentary_behaviour_and_mental_health_in_Ghanaian_adolescent","245135889_Behavior_Health_and_Environmental_Stress_chapters_1_and_2","240284152_Self-Esteem_and_Socioeconomic_Status_A_Meta-Analytic_Review","233948571_The_Impact_of_Relative_Poverty_on_Norwegian_Adolescents'_Subjective_Health_A_Causal_Analysis_with_Propensity_Score_Matching","232519505_Life_task_participation_and_well-being_The_importance_of_taking_part_in_daily_life","347494263_Mental_Health_and_The_Built_Environment_More_Than_Bricks_And_Mortar","313647145_Early_childhood_mental_health_services_A_policy_and_systems_development_perspective","264461425_The_Effect_of_Poverty_and_Income_Disparity_on_the_Psychological_Well-Being_of_Hong_Kong_Children","243778829_Unhealthy_Societies_The_Afflictions_of_Inequality","229736277_The_Social_Costs_of_Child_Poverty_A_Systematic_Review_of_the_Qualitative_Evidence"]}