{"id":"307946572_Developing_Game-Based_Learning_Requirements_to_Increase_Female_Middle_School_Students_Interest_in_Computer_Science","abstract":"This paper presents work on the development of a Game-Based Learning (GBL) application’s requirements for female middle school students which teaches fundamental concepts of programming. Currently, there are not enough students who desire to pursue Science, Technology, Engineering, and Mathematic (STEM) career fields. Additionally, female are underrepresented in STEM fields, and increased female participation may help partially address this gap. GBL was used to encourage middle school student interest in STEM by allowing them to practice computer science concepts in engaging contexts outside the classroom. The game Sorceress of Seasons was built to teach fundamental programming concepts, and was based on six requirements specifically targeted at female middle school students. The game was tested with 15 middle school-aged students. Playing the game had a positive effect on students’ attitudes towards programming, with female students reporting a larger increase in computer science interest than males when compared with their previous attitudes. The results suggest that the game may be successful in increasing interest in STEM in these students. The requirements developed to guide the design of the game played a role in the game’s effectiveness, and may be useful when developing an educational tool targeting female STEM interest.","authors":["Desmond Bonner","Michael Dorneich"],"meta":["September 2016Proceedings of the Human Factors and Ergonomics Society Annual Meeting 60(1):380-384","DOI:10.1177/1541931213601086"],"references":["271510904_Internet_Gaming_Addiction_The_Case_of_Massively_Multiplayer_Online_Role-Playing_Games","264992984_Structural_Roles_in_Massively_Multiplayer_Online_Games_A_Case_Study_of_Guild_and_Raid_Leaders_in_World_of_Warcraft","257171522_The_effect_of_uncertainty_on_learning_in_game-like_environments","285981934_Increasing_middle_school_student_interest_in_STEM_careers_with_videos_of_scientists","271938158_Pair_Programming_in_Middle_School","271787795_Digital_Game-Based_Learning","262314863_Codespells_How_to_design_quests_to_teach_java_concepts","260584209_Increasing_Female_Participation_in_Computing_The_Harvey_Mudd_College_Story","259127229_Peer_Instruction_in_computing_The_value_of_instructor_intervention","259115113_Motivational_Pathways_to_STEM_Career_Choices_Using_Expectancy-Value_Perspective_to_Understand_Individual_and_Gender_Differences_in_STEM_Fields"]}