{"id":"307942866_Computational_Thinking_as_an_Emerging_Competence_Domain","abstract":"Computational thinking is a problem-solving skill set, which includes problem decomposition, algorithmic thinking, abstraction, and automation. Even though computational thinking draws upon concepts fundamental to computer science (CS), it has broad application to all disciplines. It has been suggested that computational thinking is an essential twenty-first century skill that should be added to every students’ analytical ability. In this chapter, we discuss key computational thinking ideas and how they relate to primary and secondary education. We present efforts in three countries – England, the Netherlands, and the United States – to embed computational thinking in the schools. Using the framework of competencies as cognitive dispositions, we further explore how to develop computational thinking competencies in children and youth. Specifically, we provide examples of how computational thinking would manifest in the primary and secondary education across the disciplines. We also discuss how computational thinking ideas are relevant to vocational education and training. In particular, we support the viewpoint of digital literacy as a key component of computational thinking and the need to incorporate it into vocational education and training. We also provide directions for future research on the role of computational thinking in primary, secondary, and vocational education. In summary, we argue that computational thinking is a broadly applicable competence domain, which is important for individuals to be successful in today’s technological society, to increase interest in information technology (IT), and to support inquiry in other disciplines.","authors":["Aman Yadav","Jon Good","Joke Voogt","Petra Fisser"],"meta":["January 2017","DOI:10.1007/978-3-319-41713-4_49","In book: Competence-based Vocational and Professional Education (pp.1051-1067)"],"references":["303668799_Computational_Thinking_for_All_Pedagogical_Approaches_to_Embedding_21st_Century_Problem_Solving_in_K-12_Classrooms","288404651_Integrating_computational_thinking_with_K-12_science_education_A_theoretical_framework","275206469_VET_workers'_problem-solving_skills_in_technology-rich_environments_European_approach","274309848_Computational_Thinking","265500399_VET_workers'_problem-solving_skills_in_technology-rich_environments_European_approach","262350755_Computational_Thinking_in_Elementary_and_Secondary_Teacher_Education","276364493_Education_and_working_life_VET_adults'_problem-solving_skills_in_technology-rich_environments","263937503_Assessment_of_Competencies","263259041_A_comparative_analysis_of_international_frameworks_for_21_st_century_competences_Implications_for_national_curriculum_policies","258948784_How_to_Solve_It_A_New_Aspect_of_Mathematical_Method"]}