{"id":"307950818_Wavefield_reconstruction_in_attenuating_media_A_checkpointing-assisted_reverse-forward_simulation_method","abstract":"Three-dimensional implementations of reverse time migration (RTM) and full-waveform inversion (FWI) require efficient schemes to access the incident field to apply the imaging condition of RTM or build the gradient of FWI. Wavefield reconstruction by reverse propagation using final snapshot and saved boundaries appears quite efficient but unstable in attenuating media, whereas the checkpointing strategy is a stable alternative at the expense of increased computational cost through repeated forward modeling. We have developed a checkpointing-assisted reverse-forward simulation (CARFS) method in the context of viscoacoustic wave propagation with a generalized Maxwell body. At each backward reconstruction step, the CARFS algorithm makes a smart decision between forward modeling using checkpoints and reverse propagation based on the minimum time-stepping cost and an energy measure. Numerical experiments demonstrated that the CARFS method allows accurate wavefield reconstruction using less timesteppings than optimal checkpointing, even if seismic attenuation is very strong. For RTM and FWI applications involving a huge number of independent sources and/ or applications on architectures with limited memory, CARFS will provide an efficient tool with adequate accuracy in practical implementation.","authors":["Pengliang Yang","Romain Brossier","Ludovic Métivier","Jean Virieux"],"meta":["November 2016Geophysics 81(6):R349-R362","DOI:10.1190/geo2016-0082.1"],"references":["308181575_Wavefield_compression_for_adjoint_methods_in_full-waveform_inversion","307832663_Linear_models_of_dissipation_whose_Q_is_almost_frequency_independent","305211040_Wavefield_reconstruction_by_interpolating_significantly_decimated_boundaries","301875572_Anelastic_sensitivity_kernels_with_parsimonious_storage_for_adjoint_tomography_and_full_waveform_inversion","281692918_Efficient_3-D_frequency-domain_mono-parameter_full-waveform_inversion_of_ocean-bottom_cable_data_application_to_Valhall_in_the_visco-acoustic_vertical_transverse_isotropic_approximation","315004399_Downsampling_Plus_Interpolation_for_Wavefield_Reconstruction_by_Reverse_Propagation","311822149_High_Performance_Parallel_IO","311508869_Velocity_dispersion_due_to_anelasticity","301397974_Using_the_effective_boundary_saving_strategy_in_GPU-based_RTM_programming","282493936_Five_ways_to_avoid_storing_source_wavefield_snapshots_in_2D_elastic_prestack_reverse_time_migration"]}