{"id":"307914211_Improving_the_Connectivity_of_Community_Detection-based_Hierarchical_Routing_Protocols_in_Large-scale_WSNs","abstract":"The recent growth in the use of wireless sensor networks (WSNs) in many applications leads to the raise of a core infrastructure for communication and data gathering in Cyber-Physical Systems (CPS). The communication strategy in most of the WSNs relies on hierarchical clustering routing protocols due to their ad hoc nature. In the bulk of the existing approaches some special nodes, named Cluster-Heads (CHs), have the task of assembling clusters and intermediate the communication between the cluster members and a central entity in the network, the Sink. Therefore, the overall efficiency of such protocols is highly dependent on the even distribution of CHs in the network. Recently, a community detection-based approach, named RLP, have shown interesting results with respect to the CH distribution and availability that potentially increases the overall WSN efficiency. Despite the better results of RLP regarding the literature, the adopted CH election algorithm may lead to a CH shortage throughout the network operation. In line with that, in this paper, we introduce an improved version of RLP, named HRLP. Our proposal includes a hybrid CH election algorithm which relies on a computationally cheap and distributed probabilistic-based CH recovery procedure to improve the network connectivity. Additionally, we provide a performance analysis of HRLP and its comparison to other protocols by considering a large-scale WSN scenario. The results evince the improvements achieved by the proposed strategy by means of the network connectivity and lifetime metrics.","authors":["Matheus A. de Paulo","Mariá C.V. Nascimento","Valério Rosset"],"meta":["December 2016Procedia Computer Science 96:521-530","DOI:10.1016/j.procs.2016.08.229","Project: Meta-heuristics for reliable communication in large scale wireless sensor and actuator networks"],"references":["329319574_Clustering_in_Wireless_Sensor_Networks","286839039_RLP_A_Community_Detection-Based_Routing_Protocol_for_Wireless_Sensor_Networks","222534027_Wireless_Sensor_Networks_A_Survey","27367046_Automatic_Decentralized_Clustering_for_Wireless_Sensor_Networks","260671137_Energy-Efficient_Routing_Protocols_in_Wireless_Sensor_Networks_A_Survey","224716224_Topology-based_Clusterhead_Candidate_Selection_in_Wireless_Ad-hoc_and_Sensor_Networks","224181762_A_reliable_clustering_algorithm_base_on_LEACH_protocol_in_wireless_mobile_sensor_networks","224071752_Energy-efficient_communication_protocol_for_wireless_sensor_networks","220566249_Topology_Control_in_Wireless_Ad_Hoc_and_Sensor_Networks","13660517_Collective_Dynamics_of_Small_World_Networks"]}