{"id":"308097722_Acoustics_of_Notre-Dame_cathedral_de_Paris","abstract":"Notre-Dame de Paris is amongst the most well-known worship spaces in the world. Its large volume, in combination with a relatively bare stone construction and marble floor, leads to rather long reverberation times. Despite the notoriety of this space, there are few examples of published data on the acoustical parameters of this space, and these data are often not in agreement. Archived measurement recordings from 1987 were recovered and found to include several balloon bursts. In 2015, a measurement session was carried out which included similar source-receiver pairs using both balloon bursts and swept sine stimuli. Comparisons between results from these two sessions show a significant decrease in reverberation time in the modern state. This change is attributed to the addition of carpet in several areas of the cathedral. A geometrical acoustics model of the cathedral was constructed and calibrated from the 2015 measurements. The effect of carpeting was investigated through simulations. Comparison of the 2015 room impulse responses measured over the course of the 1-hour measurement session also indicated a potential slowly time-variant system. This was attributed to small temperature changes within the cathedral. Correction of this variance using a recently developed method allowed for the averaging of repeated measurements, providing the correct value for the reverberation time estimation, an improved signal-to-noise ratio, and a quantification of the temperature changes. This paper presents the results of these measurements, providing a modern documentation of the acoustical parameters of this historic worship space.","authors":["Bart Postma","Brian F G Katz"],"meta":["September 2016","Conference: Intl. Cong. on Acoustics (ICA)At: Buenos Aires"],"references":["304035146_Virtual_Reality_Performance_Auralization_in_a_Calibrated_Model_of_Notre-Dame_Cathedral","49819084_Investigations_on_the_balloon_as_an_impulse_source","305079655_Correction_method_for_averaging_slowly_time-variant_room_impulse_response_measurements","282894528_Creation_and_calibration_method_of_acoustical_models_for_historic_virtual_reality_auralizations","243350008_A_method_for_correcting_the_reverberation_times_of_enclosures_as_a_function_of_humidity_and_temperature"]}