{"id":"308081454_The_Impact_of_Developmental_Coordination_Disorder_on_Educational_Achievement_in_Secondary_School","abstract":"Background\nDevelopmental Coordination Disorder (DCD) is a common condition which affects a child’s ability to perform everyday tasks. Affected children struggle at school and require additional educational support from an early age but research into educational achievement in adolescence is limited. Therefore, the aim of this work was to assess the educational attainment of children with DCD in secondary school and the effect of additional support on this.\n\nMethods\nData were obtained from the Avon Longitudinal Study of Parents and Children, a large longitudinal birth cohort enrolled in 1991–2. Cases of DCD were previously defined at 7 years, according to the DSM-IV, using tests of motor coordination, functional limitations on activities of daily living and appropriate exclusion criteria. The number of General Certificates of Secondary Education (GCSE) graded A*-C achieved and the Special Educational Needs (SEN) status of each child was obtained from linked educational data. Logistic regression was used to assess the association between DCD and GCSE attainment. Multivariate models were used to adjust for the effects of gender, IQ, socioeconomic status and SEN provision.\n\nResults\nA total of 5709 children previously assessed for DCD at 7 years had educational outcome data available. Children without DCD (n = 5610) attained a median of 7 GCSEs (IQR 3–9), with 70% achieving 5 or more GCSEs. Conversely, children with DCD (n = 99) attained a median of 1 GCSE (IQR 0–6), with 32% achieving 5 or more GCSEs. 60% of children with DCD had some level of SEN provision at school, compared to only 11% of controls. When compared to controls, the odds of a children with DCD achieving 5 or more GCSEs graded A*-C was 0.21 (95% CI: 0.14–0.32). After controlling for gender, IQ and socioeconomic status, these odds improved to 0.36 (95% CI: 0.18–0.70). After accounting for whether the children had any SEN provision at school, the odds improved further to 0.50 (95% CI: 0.24–1.04).\n\nDiscussion\nChildren with DCD do poorly in secondary school compared to their peers. It is a prevalent condition but a large proportion of those meeting the diagnostic criteria are not recognised as requiring SEN support. When additional support is provided, the outlook is somewhat improved but remains poor. The impact of DCD on secondary school education will impact upon future employment and education prospects, thus warranting further assessment. Improving awareness of and support strategies for these individuals remains an important problem which requires a multi-disciplinary approach.","authors":["Ian Harrowell","Linda I Hollén","R Lingam","Alan Emond"],"meta":["September 2016Journal of Epidemiology and Community Health 70(Suppl 1):A7.2-A7","DOI:10.1136/jech-2016-208064.2","Conference: Journal of Epidemiology and Community HealthAt: SUPP 1, A7-A8Volume: 70","Project: Psychosocial Impact of Developmental Coordination Disorder in Late Adolescence"],"references":[]}