{"id":"308040495_Modularity_Genes_Development_and_Evolution","abstract":"Modularity has emerged as a central concept for evolutionary biology, thereby providing the field with a theory of organismal structure and variation. This theory has reframed long-standing questions and serves as a unified conceptual framework for genetics, developmental biology, and multivariate evolution. Research programs in systems biology and quantitative genetics are bridging the gap between these fields. Although this synthesis is ongoing, some major themes have emerged, and empirical evidence for modularity has become abundant. In this review, we look at modularity from a historical perspective, highlighting its meaning at different levels of biological organization and the different methods that can be used to detect it. We then explore the relationship between quantitative genetic approaches to modularity and developmental genetic studies. We conclude by investigating the dynamic relationship between modularity and the adaptive landscape and how this relationship potentially shapes evolution and can help bridge the gap between micro- and macroevolution. Expected final online publication date for the Annual Review of Ecology, Evolution, and Systematics Volume 47 is November 01, 2016. Please see http://www.annualreviews.org/page/journal/pubdates for revised estimates.","authors":["Diogo Melo","Arthur Porto","James Cheverud","Gabriel Marroig"],"meta":["December 2016Annual Review of Ecology Evolution and Systematics 47(1)","DOI:10.1146/annurev-ecolsys-121415-032409"],"references":["317333787_STABILIZING_SELECTION_AND_THE_COMPARATIVE_ANALYSIS_OF_ADAPTATION","317386589_PHENOTYPIC_EVOLUTION_CONSTANT_COVARIANCES_AND_THE_MAINTENANCE_OF_ADDITIVE_VARIANCE","317335152_QUANTITATIVE_GENETIC_ANALYSIS_OF_MULTIVARIATE_EVOLUTION_APPLIED_TO_BRAINBODY_SIZE_ALLOMETRY","317334451_PHENOTYPIC_GENETIC_AND_ENVIRONMENTAL_MORPHOLOGICAL_INTEGRATION_IN_THE_CRANIUM","317334142_LONG-TERM_CORRELATED_RESPONSE_INTERPOPULATION_COVARIATION_AND_INTERSPECIFIC_ALLOMETRY","317315962_PREDICTING_MICROEVOLUTIONARY_RESPONSES_TO_DIRECTIONAL_SELECTION_ON_HERITABLE_VARIATION","317314925_Natural_selection_and_random_genetic_drift_in_phenotypic_evolution","317314713_A_COMPARATIVE_ANALYSIS_OF_MORPHOLOGICAL_VARIATION_PATTERNS_IN_THE_PAPIONINS","317313559_ADAPTIVE_RADIATION_ALONG_GENETIC_LINES_OF_LEAST_RESISTANCE","317285100_The_measurement_of_selection_on_correlated_characters"]}