{"id":"308096907_Aligning_Texts_and_Knowledge_Bases_with_Semantic_Sentence_Simplification","abstract":"Finding the natural language equivalent of structured data is both a challenging and promising task. In particular, an efficient alignment of knowledge bases with texts would benefit many applications, including natural language generation, information retrieval and text simplification. In this paper, we present an approach to build a dataset of triples aligned with equivalent sentences written in natural language. Our approach consists of three main steps. First, target sentences are annotated automatically with knowledge base (KB) concepts and instances. The triples linking these elements in the KB are extracted as candidate facts to be aligned with the annotated sentence. Second, we use textual mentions referring to the subject and object of these facts to simplify semantically the target sentence via crowdsourcing. Third, the sentences provided by different contributors are post-processed to keep only the most relevant simplifications for the alignment with KB facts. We test and present different processing methods, and share the constructed datasets in the public domain. These first datasets contain 1,050 sentences aligned with 1,885 triples. They can be used to train natural language generators as well as semantic or contextual text simplifiers.","authors":["Yassine Mrabet","Pavlos Vougiouklis","Halil Kilicoglu","Claire Gardent"],"meta":["September 2016","DOI:10.18653/v1/W16-3506","Conference: Proceedings of the 2nd International Workshop on Natural Language Generation and the Semantic WebAt: Edinburgh, UK","Project: WebNLG"],"references":["301836846_Generating_Text_from_Structured_Data_with_Application_to_the_Biography_Domain","280872897_Semantically_Conditioned_LSTM-based_Natural_Language_Generation_for_Spoken_Dialogue_Systems","270878110_The_KBGen_Challenge","233530390_The_First_Surface_Realisation_Shared_Task_Overview_and_Evaluation_Results","323885950_The_Unified_Medical_Language_System","268074396_Towards_Knowledge-driven_Annotation","262309348_Parsing_time_learning_to_interpret_time_expressions","228906634_SUMTIME-METEO_Parallel_corpus_of_naturally_occurring_forecast_texts_and_weather_data","224890849_The_Interaction_of_Domain_Knowledge_and_Linguistic_Structure_in_Natural_Language_Processing_Interpreting_Hypernymic_Propositions_in_Biomedical_Text","221345559_Learning_to_sportscast_A_test_of_grounded_language_acquisition"]}