{"id":"308036255_Paradigms_for_Parameterized_Enumeration","abstract":"The aim of the paper is to examine the computational complexity and algorithmics of enumeration, the task to output all solutions of a given problem, from the point of view of parameterized complexity. First, we define formally different notions of efficient enumeration in the context of parameterized complexity: FPT-enumeration and delayFPT. Second, we show how different algorithmic paradigms can be used in order to get parameter-efficient enumeration algorithms in a number of examples. These paradigms use well-known principles from the design of parameterized decision as well as enumeration techniques, like for instance kernelization and self-reducibility. The concept of kernelization, in particular, leads to a characterization of fixed-parameter tractable enumeration problems. Furthermore, we study the parameterized complexity of enumerating all models of Boolean formulas having weight at least k, where k is the parameter, in the famous Schaefer’s framework. We consider propositional formulas that are conjunctions of constraints taken from a fixed finite set Γ. Given such a formula and an integer k, we are interested in enumerating all the models of the formula that have weight at least k. We obtain a dichotomy classification and prove that, according to the properties of the constraint language Γ, either one can enumerate all such models in delayFPT, or no such delayFPT enumeration algorithm exists under some complexity-theoretic assumptions.","authors":["Nadia Creignou","Arne Meier","Julian-Steffen Müller","Johannes Schmidt"],"meta":["May 2017Theory of Computing Systems 60(4)","DOI:10.1007/s00224-016-9702-4"],"references":["237082668_Paradigms_for_Parameterized_Enumeration","225109592_On_Parameterized_Enumeration","316800486_Monographs_in_Computer_Science","268614150_Complexity_Classifications_of_Boolean_Constraint_Satisfaction_Problems","265502171_Fundamentals_of_Parameterized_Complexity","262409339_Backdoors_to_typical_case_complexity","257650163_Invitation_to_Fixed-Parameter_Algorithms","255651213_Enumeration_Algorithms_and_Complexity","238617307_Fixed-Parameter_Tractability","224483578_Frozen_Boolean_Partial_Co-clones","223072426_Parameterized_enumeration_transversals_and_imperfect_phylogeny_reconstruction","222569763_Machine-based_methods_in_parameterized_complexity_theory","222561079_Tight_lower_bounds_for_certain_parameterized_NP-hard_problems","222469204_On_generating_all_maximal_independent_sets","222450817_Planar_graph_coloring_is_not_self-reducible_assuming_P_NP"]}