{"id":"308048936_Discovering_different_kinds_of_smartphone_users_through_their_application_usage_behaviors","abstract":"Understanding smartphone users is fundamental for creating better smartphones, and improving the smartphone usage experience and generating generalizable and reproducible research. However, smartphone manufacturers and most of the mobile computing research community make a simplifying assumption that all smartphone users are similar or, at best, constitute a small number of user types, based on their behaviors. Manufacturers design phones for the broadest audience and hope they work for all users. Researchers mostly analyze data from smartphone-based user studies and report results without accounting for the many different groups of people that make up the user base of smartphones. In this work, we challenge these elementary characterizations of smartphone users and show evidence of the existence of a much more diverse set of users. We analyzed one month of application usage from 106,762 Android users and discovered 382 distinct types of users based on their application usage behaviors, using our own two-step clustering and feature ranking selection approach. Our results have profound implications on the reproducibility and reliability of mobile computing studies, design and development of applications, determination of which apps should be pre-installed on a smartphone and, in general, on the smartphone usage experience for different types of users.","authors":["Sha Zhao","Julian Andres Ramos Rojas","Jianrong Tao","Ziwen Jiang"],"meta":["September 2016","DOI:10.1145/2971648.2971696","Conference: The 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp 2016)"],"references":["304006654_Mining_User_Attributes_Using_Large-Scale_APP_Lists_of_Smartphones","289980075_A_Systematic_Assessment_of_Smartphone_Usage_Gaps","283503020_Diversity_in_Locked_and_Unlocked_Mobile_Device_Usage","280687220_Mining_User_Attributes_Using_Large-scale_APP_Lists_of_Smartphones","280096258_Revisitation_analysis_of_smartphone_app_use","321613810_Mobile_Computing_Applications_and_Services_Third_International_Conference_MobiCASE_2011_Los_Angeles_CA_USA_October_24-27_2011_Revised_Selected_Papers","311489354_Understanding_usage_states_on_mobile_devices","301417686_Characterizing_Smartphone_Usage_Patterns_from_Millions_of_Android_Users","301389486_ProactiveTasks","289311430_MobileMiner_Mining_your_frequent_patterns_on_your_phone"]}