{"id":"308039487_On_the_Expressive_Power_of_Sub-Propositional_Fragments_of_Modal_Logic","abstract":"Modal logic is a paradigm for several useful and applicable formal systems in computer science. It generally retains the low complexity of classical propositional logic, but notable exceptions exist in the domains of description, temporal, and spatial logic, where the most expressive formalisms have a very high complexity or are even undecidable. In search of computationally well-behaved fragments, clausal forms and other sub-propositional restrictions of temporal and description logics have been recently studied. This renewed interest on sub-propositional logics, which mainly focus on the complexity of the various fragments, raise natural questions on their the relative expressive power, which we try to answer here for the basic multi-modal logic Kn. We consider the Horn and the Krom restrictions, as well as the combined restriction (known as the core fragment) of modal logic, and, orthogonally, the fragments that emerge by disallowing boxes or diamonds from positive literals. We study the problem in a very general setting, to ease transferring our results to other meaningful cases.","authors":["Davide Bresolin","Emilio Muñoz-Velasco","Guido Sciavicco"],"meta":["September 2016","DOI:10.4204/EPTCS.226.7"],"references":["300018265_Sub-propositional_Fragments_of_the_Interval_Temporal_Logic_of_Allen's_Relations","258727505_A_Cookbook_for_Temporal_Conceptual_Data_Modelling_with_Description_Logics","240917995_The_Complexity_of_Clausal_Fragments_of_LTL","295955505_Tractable_interval_temporal_propositional_and_description_logics","268069576_Logical_foundations_of_proof_complexity_Reprint_of_the_2010_hardback_ed","242505022_Temporal_Logic_First_International_Conference_ICTL_'94_Bonn_Germany_July_11-14_1994_Proceedings","222483034_The_computational_complexity_of_the_satisfiability_of_modal_Horn_clauses_for_modal_propositional_logics","222147165_A_note_on_the_complexity_of_the_satisfiability_of_modal_Horn_clauses","221550991_Synthesis_of_Reactive1_Designs","220705972_On_the_Complexity_of_Fragments_of_Modal_Logics"]}