{"id":"308050578_Software_Startups_-_A_Research_Agenda","abstract":"Software startup companies develop innovative, software-intensive products within limited time frames and with few resources, searching for sustainable and scalable business models. Software startups are quite distinct from traditional mature software companies, but also from micro-, small-, and medium-sized enterprises, introducing new challenges relevant for software engineering research. This paper's research agenda focuses on software engineering in startups, identifying, in particular, 70+ research questions in the areas of supporting startup engineering activities, startup evolution models and patterns, ecosystems and innovation hubs, human aspects in software startups, applying startup concepts in non-startup environments, and methodologies and theories for startup research. We connect and motivate this research agenda with past studies in software startup research, while pointing out possible future directions. While all authors of this research agenda have their main background in Software Engineering or Computer Science, their interest in software startups broadens the perspective to the challenges, but also to the opportunities that emerge from multidisciplinary research. Our audience is therefore primarily software engineering researchers, even though we aim at stimulating collaborations and research that crosses disciplinary boundaries. We believe that with this research agenda we cover a wide spectrum of the software startup industry current needs.","authors":["Michael Unterkalmsteiner","Pekka Abrahamsson","Xiaofeng Wang","Anh Nguyen Duc"],"meta":["October 2016E-Informatica Software Engineering Journal 2016(1):89-124","DOI:10.5277/e-Inf160105","Projects: Software Startups and EntrepreneurshipAgile and Lean Project Management"],"references":["316582389_The_Cookbook_For_Successful_Internal_Startups","314584583_Towards_a_Software_Tool_Portal_to_Support_Startup_Process","308854365_The_Role_of_Design_Thinking_and_Physical_Prototyping_in_Social_Software_Engineering","308402214_Product_Market_Fit_Frameworks_for_Lean_Product_Development","306254446_Digital_Innovation_Management_Reinventing_Innovation_Management_Research_in_a_Digital_World","321610096_Innovation_Management_for_Technical_Products_Systematic_and_Integrated_Product_Development_and_Production_Planning","314580614_A_Conceptual_Framework_of_Lean_Startup_Enabled_Internal_Corporate_Venture","311464428_Three_patterns_for_user_involvement_in_startups","305196956_Ways_to_Cross_the_Rubicon_Pivoting_in_Software_Startups","304551476_Early_Product_Design_in_Startups_Towards_a_UX_Strategy"]}