{"id":"308080753_Rapid_Evolutionary_Rates_and_Unique_Genomic_Signatures_Discovered_in_the_First_Reference_Genome_for_the_Southern_Ocean_Salp_Salpa_thompsoni_Urochordata_Thaliacea","abstract":"A preliminary genome sequence has been assembled for the Southern Ocean salp, Salpa thompsoni (Urochordata, Thaliacea). Despite the ecological importance of this species in Antarctic pelagic food webs and its potential role as an indicator of changing Southern Ocean ecosystems in response to climate change, no genomic resources are available for S. thompsoni or any closely-related urochordate species. Using a multiple-platform, multiple-individual approach, we have produced a 318,767,936 bp genome sequence, covering more than 50% of the estimated 602 MB (±173 MB) genome size for S. thompsoni. Using a non-redundant set of predicted proteins, more than 50% (16,823) of sequences showed significant homology to known proteins and ~38% (12,151) of the total protein predictions were associated with Gene Ontology functional information. We have generated 109,958 SNP variant and 9,782 indel predictions for this species, serving as a resource for future phylogenomic and population genetic studies. Comparing the salp genome to available assemblies for four other urochordates, Botryllus schlosseri, Ciona intestinalis, Ciona savignyi and Oikopleura dioica, we found that S. thompsoni shares the previously-estimated rapid rates of evolution for these species. High mutation rates are thus independent of genome size, suggesting that rates of evolution >1.5 times that observed for vertebrates are a broad taxonomic characteristic of urochordates. Tests for positive selection implemented in PAML revealed a small number of genes with sites undergoing rapid evolution, including genes involved in ribosome biogenesis and metabolic and immune process that may be reflective of both adaptation to polar, planktonic environments as well as the complex life history of the salps. Finally, we performed an initial survey of small RNAs, revealing the presence of known, conserved miRNAs, as well as novel miRNA genes; unique piRNAs; and mature miRNA signatures for varying developmental stages. Collectively, these resources provide a genomic foundation supporting S. thompsoni as a model species for further examination of the exceptional rates and patterns of genomic evolution shown by urochordates. Additionally, genomic data will allow for the development of molecular indicators of key life history events and processes and afford new understandings and predictions of impacts of climate change on this key species of Antarctic pelagic ecosystems.","authors":["Nathaniel Kenneth Jue","Paola G. Batta-Lona","Sarah E Trusiak","Craig Obergfell"],"meta":["September 2016Genome Biology and Evolution 8(10):evw215","DOI:10.1093/gbe/evw215","Project: Salpa Thompsoni Genome"],"references":["322104170_The_genome_sequence_of_the_colonial_chordate_Botryllus_schlosseri","277490263_A_molecular_phylogeny_of_the_Thaliacea","274140764_Pyrosequencing_and_de_novo_assembly_of_Antarctic_krill_Euphausia_superba_transcriptome_to_study_the_adaptability_of_krill_to_climate_induced_environmental_changes","273951729_The_Expansion_of_Animal_MicroRNA_Families_Revisited","271131402_Comparative_Analysis_of_Transposable_Elements_Highlights_Mobilome_Diversity_and_Evolution_in_Vertebrates","313517342_Feeding_and_energetics_of_Thaliacea","311174848_Gene_finding_in_novel_genomes","306154486_Anatomy_of_Thaliacea","281316029_The_Draft_Genome_of_Ciona_intestinalis_Insights_into_Chordate_and_Vertebrate_Origins","268154746_Resolving_the_complexity_of_the_human_genome_using_single-molecule_sequencing","265558003_Ribosomal_DNA_copy_number_is_coupled_with_gene_expression_variation_and_mitochondrial_abundance_in_humans","263299443_Proximity_of_krill_and_salps_in_an_Antarctic_coastal_ecosystem_Evidence_from_penguin-mounted_cameras","261604179_Transcriptomic_Analysis_of_Petunia_hybrida_in_Response_to_Salt_Stress_Using_High_Throughput_RNA_Sequencing","261407004_Genome-wide_transcriptomic_responses_of_the_seagrasses_Zostera_marina_and_Nanozostera_noltii_under_a_simulated_heatwave_confirm_functional_types","260120776_Polar_Bears_Exhibit_Genome-Wide_Signatures_of_Bioenergetic_Adaptation_to_Life_in_the_Arctic_Environment"]}