{"id":"308013985_Industry_use_of_virtual_reality_in_product_design_and_manufacturing_a_survey","abstract":"In 1999, Fred Brooks, virtual reality pioneer and Professor of Computer Science at the University of North Carolina at Chapel Hill, published a seminal paper describing the current state of virtual reality (VR) technologies and applications (Brooks in IEEE Comput Graph Appl 19(6):16, 1999). Through his extensive survey of industry, Brooks concluded that virtual reality had finally arrived and “barely works”. His report included a variety of industries which leveraged these technologies to support industry-level innovation. Virtual reality was being employed to empower decision making in design, evaluation, and training processes across multiple disciplines. Over the past two decades, both industrial and academic communities have contributed to a large knowledge base on numerous virtual reality topics. Technical advances have enabled designers and engineers to explore and interact with data in increasingly natural ways. Sixteen years have passed since Brooks original survey. Where are we now? The research presented here seeks to describe the current state of the art of virtual reality as it is used as a decision-making tool in product design, particularly in engineering-focused businesses. To this end, a survey of industry was conducted over several months spanning fall 2014 and spring 2015. Data on virtual reality applications across a variety of industries was gathered through a series of on-site visits. In total, on-site visits with 18 companies using virtual reality were conducted as well as remote conference calls with two others. The authors interviewed 62 people across numerous companies from varying disciplines and perspectives. Success stories and existing challenges were highlighted. While virtual reality hardware has made considerable strides, unique attention was given to applications and the associated decisions that they support. Results suggest that virtual reality has arrived: it works! It is mature, stable, and, most importantly, usable. VR is actively being used in a number of industries to support decision making and enable innovation. Insights from this survey can be leveraged to help guide future research directions in virtual reality technology and applications.","authors":["Leif P. Berg","Judy M Vance"],"meta":["March 2017Virtual Reality 21(1)","DOI:10.1007/s10055-016-0293-9"],"references":["310238423_A_survey_of_CAD_and_virtual_reality_within_the_house_building_industry","267573498_Haptics_State_of_the_Art_Survey","266618819_Haptics_State_of_the_Art_Survey","251102885_Virtual_Reality_Aided_Design_A_survey_of_the_use_of_VR_in_automotive_industry","244450949_A_survey_of_tracking_technologies_for_virtual_en-vironments","242415577_A_survey_of_tracking_technology_for_virtual_environments","232650704_A_Survey_of_Large_High-Resolution_Display_Technologies_Techniques_and_Applications_PDF","228725664_Using_pinch_gloves_for_both_natural_and_abstract_interaction_techniques_in_virtual_environments","257512774_Vision_based_Hand_Gesture_Recognition_for_Human_Computer_Interaction_A_Survey","231513955_Understanding_Virtual_Reality-Interface_Application_and_Design","221402340_Effects_of_Travel_Technique_on_Cognition_in_Virtual_Environments","227630592_A_Survey_of_Haptic_Rendering_Techniques","223181168_Three-dimensional_menus_A_survey_and_taxonomy","222543433_A_Survey_of_Computer_Vision-Based_Human_Motion_Capture","222164670_Planning_optimal_paths_A_simple_assessment_of_survey_spatial_knowledge_in_virtual_environments"]}