{"id":"308087710_The_effectiveness_of_lane_departure_warning_systems-A_reduction_in_real-world_passenger_car_injury_crashes","abstract":"Objective\nThe objective of this study was to estimate the safety benefits of in vehicle Lane Departure Warning (LDW) and Lane Keeping Aid (LKA) systems in reducing relevant real-world passenger car injury crashes.\nMethods\nThe study used an induced exposure method, where LDW/LKA sensitive and non-sensitive crashes were compared for Volvo passenger cars equipped with and without LDW/LKA systems. These crashes were matched by car make, model, model year and technical equipment i.e. low speed Autonomous Emergency Braking (AEB) called City Safety (CS). The data was extracted from the Swedish Traffic Accident Data Acquisition database (STRADA) and consisted of 1853 driver injury crashes which involved 146 LDW equipped cars, 11 LKA equipped cars and 1696 cars without LDW/LKA systems.\nResults\nThe analysis showed a positive effect of the LDW/LKA systems in reducing lane departure crashes. The LDW/LKA systems were estimated to reduce head-on and single vehicle injury crashes on Swedish roads with speed limits between 70–120 km/h and with dry or wet road surfaces (i.e. not covered by ice or snow) by 53% with a lower limit of 11% (CI 95%). This reduction corresponded to a reduction of 30% with a lower limit of 6% (CI 95%) for all head-on and single vehicle driver injury crashes (including all speed limits and all road surface conditions).\nConclusions\nLDW/LKA systems were estimated to lower the driver injury risk in crash types that the systems are designed to prevent, i.e. head-on and single vehicle crashes. While these are important findings, they were based on a small dataset. Therefore, further research is desirable to evaluate the effectiveness of LDW/LKA systems under real-world conditions, and to differentiate the effectiveness between technical solutions (i.e. LDW and LKA) proposed by different manufacturers.","authors":["Simon Sternlund","Johan Strandroth","Matteo Rizzi","Anders Lie"],"meta":["September 2016Traffic Injury Prevention 18(2):00-00","DOI:10.1080/15389588.2016.1230672"],"references":["259768509_Comprehensive_Target_Populations_for_Current_Active_Safety_Systems_Using_National_Crash_Databases","259264058_From_15_to_90_ESC_penetration_in_new_cars_in_48_months_-_The_Sweedish_experience","7293159_The_Effectiveness_of_Electronic_Stability_Control_ESC_in_Reducing_Real_Life_Crashes_and_Injuries","275772651_Effectiveness_of_low_speed_autonomous_emergency_braking_in_real-world_rear-end_crashes","237775493_Antilock_Brake_Systems_and_Risk_of_Different_Types_of_Crashes_in_Traffic","221770293_The_effects_of_studded_tires_on_fatal_crashes_with_passenger_cars_and_the_benefits_of_electronic_stability_control_ESC_in_Swedish_winter_driving"]}