{"id":"308180932_LiveWSN_A_memory-efficient_energy-efficient_reprogrammable_and_fault-tolerant_platform_for_wireless_sensor_network","abstract":"Memory optimization, energy conservation, over-the-air reprogramming, and fault tolerance are the critical challenges for the proliferation of the wireless sensor network. To address these challenges, a new wireless sensor network platform termed LiveWSN is presented in this article. In LiveWSN, several new design concepts are implemented, such as the hierarchical shared-stack scheduling and the pre-linking native-code reprogramming. By doing so, the data memory cost of the LiveWSN scheduling system can be optimized by 25% if compared with that of the traditional multithreaded MANTIS OS. Moreover, the application reprogramming code size can be decreased by 72.6% if compared with that of the Contiki dynamic-linking reprogramming. In addition to the new design concepts, the new research approach which addresses the energy conservation and fault tolerance challenges by combining the software technique and the multi-core hardware technique is applied in LiveWSN. By means of the multi-core hardware infrastructure, the lifetime of the LiveWSN nodes can be prolonged by 34% if compared with the single-core Live node. Moreover, the fault-tolerant performance of the wireless sensor network node can be optimized significantly. With the above features, LiveWSN becomes memory efficient, energy efficient, reprogrammable, and fault tolerant, and it can run on the high resource-constrained nodes to execute the outdoor real-time wireless sensor network applications.","authors":["Xing Liu","Kun-Mean Hou","Christophe De Vaulx","Khalid EL GHOLAMI"],"meta":["September 2016International Journal of Distributed Sensor Networks 12(9)","DOI:10.1177/1550147716668068"],"references":["271921561_The_Internet_of_Things-A_survey_of_topics_and_trends","265242700_Wireless_Sensor_Network_A_Review_on_Data_Aggregation","304714552_LiveNode_LIMOS_versatile_embedded_wireless_sensor_node","278644972_Development_of_an_energy_efficient_robust_and_modular_multicore_wireless_sensor_network","270633296_Survey_on_the_Characterization_and_Classification_of_Wireless_Sensor_Network_Applications","260671137_Energy-Efficient_Routing_Protocols_in_Wireless_Sensor_Networks_A_Survey","260671121_A_Survey_on_Distributed_Topology_Control_Techniques_for_Extending_the_Lifetime_of_Battery_Powered_Wireless_Sensor_Networks","260029965_Topology_management_techniques_for_tolerating_node_failures_in_wireless_sensor_networks_A_survey","242608945_Why_threads_are_a_bad_idea_for_most_purposes","238003633_An_adaptive_CSMATDMA_hybrid_MAC_for_energy_and_throughput_improvement_of_wireless_sensor_networks"]}