{"id":"308129862_Becoming_Racially_Literate_About_Data_and_Data-Literate_About_Race_Data_Visualizations_in_the_Classroom_as_a_Site_of_Racial-Ideological_Micro-Contestations","abstract":"Data visualizations are now commonplace in the public media. The ability to interpret and create such visualizations, as a form of data literacy, is increasingly important for democratic participation. Yet, the cross-disciplinary knowledge and skills needed to produce and use data visualizations and to develop data literacy are not fluidly integrated into traditional K–12 subject areas. In this article, we nuance and complicate the push for data literacy in STEM reform efforts targeting youth of color. We explore a curricular reform project that integrated explicit attention to issues pertaining to the collection, analysis, interpretation, representation, visualization, and communication of data in an introductory computer science class. While the study of data in this unit emphasized viewing and approaching data in context, neither the teacher nor the students were supported in negotiating the racialized context of data that emerged in classroom discussions. To better understand these dynamics, we detail the construct of racial literacy and develop an interpretative framework of racial-ideological micro-contestations. Through an in-depth analysis of a classroom interaction using this framework, we explore how contestations about race can emerge when data visualizations from the public media are incorporated into STEM learning precisely because the contexts of data are often racialized. We argue that access to learning about data visualization, without a deep interrogation of race and power, can be counterproductive and that efforts to develop authentic data literacy require the concomitant development of racial literacy.","authors":["Thomas M Philip","Maria C. Olivares-Pasillas","Janet Rocha"],"meta":["October 2016Cognition and Instruction 34(4):361-388","DOI:10.1080/07370008.2016.1210418"],"references":["286938062_Teaching_Mathematics_for_Spatial_Justice_An_Investigation_of_the_Lottery","281453307_Color-Blind_Racism_and_Racial_Indifference_The_Role_of_Racial_Apathy_in_Facilitating_Enduring_Inequalities","279741828_Critical_Race_Theory_Racial_Microaggressions_and_Campus_Racial_Climate_for_Latinao_Undergraduates","323321869_The_Miner's_Canary_Enlisting_Race_Resisting_Power_Transforming_Democracy","322694601_Teaching_anti-bias_curriculum_in_teacher_preparation_programs_What_and_How","303433239_Deculturalization_and_the_struggle_for_equality_A_brief_history_of_the_education_of_dominated_cultures_in_the_United_States_Eighth_edition","289254963_Framing_intersectionality_An_introduction","287007273_Colormute_Race_Talk_Dilemmas_in_an_American_School","284539688_Garfinkel_and_Ethnomethodology","281453236_Racism_without_Racists_Color-Blind_Racism_and_the_Persistence_of_Racial_Inequality_in_the_USA"]}