{"id":"308152499_Photo-Realistic_Single_Image_Super-Resolution_Using_a_Generative_Adversarial_Network","abstract":"Despite the breakthroughs in accuracy and speed of single image super-resolution using faster and deeper convolutional neural networks, one central problem remains largely unsolved: how do we recover the finer texture details when we super-resolve at large upscaling factors? During image downsampling information is lost, making super-resolution a highly ill-posed inverse problem with a large set of possible solutions. The behavior of optimization-based super-resolution methods is therefore principally driven by the choice of objective function. Recent work has largely focussed on minimizing the mean squared reconstruction error (MSE). The resulting estimates have high peak signal-to-noise-ratio (PSNR), but they are often overly smoothed, lack high-frequency detail, making them perceptually unsatisfying. In this paper, we present super-resolution generative adversarial network (SRGAN). To our knowledge, it is the first framework capable of recovering photo-realistic natural images from 4 times downsampling. To achieve this, we propose a perceptual loss function which consists of an adversarial loss and a content loss. The adversarial loss pushes our solution to the natural image manifold using a discriminator network that is trained to differentiate between the super-resolved images and original photo-realistic images. In addition, we use a content loss function motivated by perceptual similarity instead of similarity in pixel space. Trained on 350K images using the perceptual loss function, our deep residual network was able to recover photo-realistic textures from heavily downsampled images on public benchmarks.","authors":["Christian Ledig","Lucas Theis","Ferenc Huszar","Jose Caballero"],"meta":["September 2016"],"references":["319770414_Identity_Mappings_in_Deep_Residual_Networks","319770291_Very_Deep_Convolutional_Networks_for_Large-Scale_Image_Recognition","319770234_Deep_multi-scale_video_prediction_beyond_mean_square_error","319770198_Learning_a_Deep_Convolutional_Network_for_Image_Super-Resolution","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","319770144_Unsupervised_Representation_Learning_with_Deep_Convolutional_Generative_Adversarial_Networks","312771295_Image_quality_assessment_From_error_visibility_to_structural_similarity","311611431_Deeply-Recursive_Convolutional_Network_for_Image_Super-Resolution","311609041_Deep_Residual_Learning_for_Image_Recognition","310752533_Visualizing_and_understanding_convolutional_networks"]}