{"id":"308112192_Formalizing_Neurath's_Ship_Approximate_Algorithms_for_Online_Causal_Learning","abstract":"Higher-level cognition depends on the ability to learn models of the world. We can characterize this at the computational level as a structure-learning problem with the goal of best identifying the prevailing causal relationships among a set of relata. However, the computational cost of performing exact Bayesian inference over causal models grows rapidly as the number of relata increases. This implies that the cognitive processes underlying causal learning must be substantially approximate. A powerful class of approximations that focuses on the sequential absorption of successive inputs is captured by the Neurath's ship metaphor in philosophy of science, where theory change is cast as a stochastic and gradual process shaped as much by people's limited willingness to abandon their current theory when considering alternatives as by the ground truth they hope to approach. Inspired by this metaphor and by algorithms for approximating Bayesian inference in machine learning, we propose an algorithmic-level model of causal structure learning under which learners represent only a single global hypothesis that they update locally as they gather evidence. We propose a related scheme for understanding how, under these limitations, learners choose informative interventions that manipulate the causal system to help elucidate its workings. We find support for our approach in the analysis of four experiments.","authors":["Neil Bramley","Peter Dayan","Thomas L. Griffiths","David Lagnado"],"meta":["September 2016Psychological Review 124(3):301-338","DOI:10.1037/rev0000061"],"references":["325841138_Beyond_Covariation_Cues_to_Causal_Structure","296629801_Clinical_psychologists'_theory-based_representations_of_mental_disorders_predict_their_diagnostic_reasoning_and_memory","332089429_Word_and_Object","324937048_The_Structure_of_Scientific_Revolutions","322276975_A_new_extension_of_the_Kalman_filter_to_nonlinear_systems","319395338_Protocol_Analysis","314734438_An_Introduction_to_Generalized_Linear_Models","312623183_A_new_extension_of_the_Kalman_filter_to_nonlinear_systems","300230893_Protocol_Statements","288429887_Causal_Models_How_People_Think_about_the_World_and_Its_Alternatives"]}