{"id":"30814668_The_CIDOC_CRM_an_Ontological_Approach_to_Schema_Heterogeneity","abstract":"The CIDOC Conceptual Reference Model (CRM), now ISO/CD21127, is a core ontology that aims at enabling information exchange and integration between heterogeneous sources of cultural heritage information, archives and libraries. It provides semantic definitions and clarifications needed to transform disparate, heterogeneous information sources into a coherent global resource, be it within a larger institution, in intranets or on the Internet. It is argued that such an ontology is property-centric, compact and highly generic, in contrast to terminological systems. The presentation will demonstrate how such a well-crafted core ontology can help to achieve a very high precision of schema integration at reasonable cost in a huge, diverse domain. It is further argued that such ontologies are widely reusable and adaptable to other domains which makes their development cost effective. @InProceedings{doerr:DSP:2005:35, author = {Martin Doerr}, title = {The CIDOC CRM, an Ontological Approach to Schema Heterogeneity}, booktitle = {Semantic Interoperability and Integration}, year = {2005}, editor = {Y. Kalfoglou and M. Schorlemmer and A. Sheth and S. Staab and M. Uschold}, number = {04391}, series = {Dagstuhl Seminar Proceedings}, ISSN = {1862-4405}, publisher = {Internationales Begegnungs- und Forschungszentrum f{\"u}r Informatik (IBFI), Schloss Dagstuhl, Germany}, address = {Dagstuhl, Germany}, URL = {http://drops.dagstuhl.de/opus/volltexte/2005/35}, annote = {Keywords: formal ontologies knowledge engineering semantic interoperability core ontology information integration heterogeneous information museums} }","authors":["Martin Doerr","Mapping and Translation"],"meta":[],"references":["240706441_Authority_Control_in_the_World_of_Metadata","47631265_Museum_Information_Systems_CIDOC_data_model_implementation_in_the_ArchTerra_project","42793195_Story_Fountain_Intelligent_support_for_Story_Research_And_Exploration","243770171_A_Grammar_of_Dublin_Core","220605375_The_CIDOC_Conceptual_Reference_Module_An_Ontological_Approach_to_Semantic_Interoperability_of_Metadata"]}