{"id":"308180877_Early_math_learning_with_tablet_PCs_The_role_of_action","abstract":"Context: The present study is about computer assisted learning (CAI) and how it facilitates early math learning in 4–6‑year‑old children. Aim: Trying to demonstrate how changes in estimation accuracy are a result of different behavioral or action organizations during playing with a numerical board game on a tablet PC. Settings and Design: A pre‑posttest design and a training intervention was used. Statistical Analysis Used: In order to measure childrens’ estimation accuracy (N = 179), the percent absolute error scores were calculated and compared in a pretest and a posttest. Further, each child’s best fitting linear function (R²lin) was computed in order to find out whether children handled numbers in a linear way. Materials and Methods: A number line estimation task with a 0‑10 interval was used in both the pretest and the posttest. For the intervention training, each child received a tablet computer and could play on a digital number line for four 15‑min sessions. Children’s hand and finger movements were manipulated during instruction in different conditions: Freely jumping or pointing. Results: Children’s estimation accuracy increased after playing with the digital number line. However, the way in which behavior was organized during the training period resulted in different accuracy performances. Conclusions: These results show that minor changes in the behavioral system can lead to significantly different learning gains and that numerical knowledge is embodied in the system the child mobilizes.","authors":["Peter J.N. Dejonckheere","Ad Smitsman","Annemie Desoete","Birgit Haeck"],"meta":["January 2015European Journal of Psychology and Educational Studies 2(3):79","DOI:10.4103/2395-2555.190477","Project: understanding atypical development"],"references":["264839982_Mathematical_Cognition_as_Embodied_Simulation","261230353_Action-based_Digital_Tools_Mathematics_Learning_in_6-year-old_Children","313757002_Socioeconomic_gradients_in_mathematical_ability_and_their_responsiveness_to_intervention_during_early_childhood","292609527_Inclusive_mathematics_education_the_value_of_a_computerized_look-ahead_approach_in_kindergarten_a_randomized_controlled_study","285212563_College_Student_Pathways_to_the_STEM_Disciplines","261140055_Number_line_estimation_from_kindergarten_to_grade_2_A_longitudinal_study","257889510_The_Effectiveness_of_a_2-year_Supplementary_Tutor-assisted_Computerized_Intervention_on_the_Reading_Development_of_Beginning_Readers_at_Risk_for_Reading_Difficulties_A_Randomized_Controlled_Trial","254110334_Perception_of_Number","252566769_Learning_in_Artificial_Environments_Embodiment_Embeddedness_and_Dynamic_Adaptation","241084263_Reducing_the_gap_in_numerical_knowledge_between_low-_and_high-income_preschoolers"]}