{"id":"308193884_Online_Human_Action_Detection_Using_Joint_Classification-Regression_Recurrent_Neural_Networks","abstract":"Human action recognition from well-segmented 3D skeleton data has been intensively studied and has been attracting an increasing attention. Online action detection goes one step further and is more challenging, which identifies the action type and localizes the action positions on the fly from the untrimmed stream data. In this paper, we study the problem of online action detection from streaming skeleton data. We propose a multi-task end-to-end Joint Classification-Regression Recurrent Neural Network to better explore the action type and temporal localization information. By employing a joint classification and regression optimization objective, this network is capable of automatically localizing the start and end points of actions more accurately. Specifically, by leveraging the merits of the deep Long Short-Term Memory (LSTM) subnetwork, the proposed model automatically captures the complex long-range temporal dynamics, which naturally avoids the typical sliding window design and thus ensures high computational efficiency. Furthermore, the subtask of regression optimization provides the ability to forecast the action prior to its occurrence. To evaluate our proposed model, we build a large streaming video dataset with annotations. Experimental results on our dataset and the public G3D dataset both demonstrate very promising performance of our scheme.","authors":["Yanghao Li","Cuiling Lan","Junliang Xing","Wenjun Zeng"],"meta":["October 2016","DOI:10.1007/978-3-319-46478-7_13","Conference: European Conference on Computer Vision","Project: Skeleton based Human Action Recognition"],"references":["319770438_Long-Term_Recurrent_Convolutional_Networks_for_Visual_Recognition_and_Description","308034527_Long-term_recurrent_convolutional_networks_for_visual_recognition_and_description","305315855_CUHKSIAT_submission_for_THUMOS15_action_recognition_challenge","301872310_Co-occurrence_Feature_Learning_for_Skeleton_based_Action_Recognition_using_Regularized_Deep_LSTM_Networks","313745907_Experiments_with_a_new_boosting_algorithm_machine_learning","310829309_Modeling_Spatial-Temporal_Clues_in_a_Hybrid_Deep_Learning_Framework_for_Video_Classification","308594286_Fast_action_proposals_for_human_action_detection_and_search","305867060_Hierarchical_recurrent_neural_network_for_skeleton_based_action_recognition","289587668_Space-Time_Representation_of_People_Based_on_3D_Skeletal_Data_A_Review","286594194_Accurate_Object_Detection_with_Joint_Classification-Regression_Random_Forests"]}