{"id":"308201701_Internet_of_Things_Security_Device_Authentication_and_Access_Control_A_Review","abstract":"The Internet of Things (IoT) is one of the emerging technologies that has grabbed the attention of researchers from academia and industry. The idea behind Internet of things is the interconnection of internet enabled things or devices to each other and to humans, to achieve some common goals. In near future IoT is expected to be seamlessly integrated into our environment and human will be wholly solely dependent on this technology for comfort and easy life style. Any security compromise of the system will directly affect human life. Therefore security and privacy of this technology is foremost important issue to resolve. In this paper we present a thorough study of security problems in IoT and classify possible cyber-attacks on each layer of IoT architecture. We also discuss challenges to traditional security solutions such as cryptographic solutions, authentication mechanisms and key management in IoT. Device authentication and access controls is an essential area of IoT security, which is not surveyed so far. We spent our efforts to bring the state of the art device authentication and access control techniques on a single paper.","authors":["Inayat Ali","Zahid Ullah"],"meta":["August 2016","Project: Internet of things"],"references":["280830876_Security_Analysis_and_proposal_of_new_Access_Control_model_in_the_Internet_of_Thing","308845651_Security_for_IoT_An_effective_DTLS_with_public_certificates","308818977_Securing_IoT_for_smart_home_system","308729654_A_Framework_of_Device_Authentication_Management_in_IoT_Environments","304296969_S-CBAC_A_secure_access_control_model_supporting_group_access_for_Internet_of_Things","304291173_3-level_secure_Kerberos_authentication_for_Smart_Home_Systems_using_IoT","301888287_That_'Internet_of_Things'_Thing","301881454_Code_injection_attacks_on_harvard-architecture_devices","286581112_Threshold_Cryptography-based_Group_Authentication_TCGA_scheme_for_the_Internet_of_Things_IoT","282984699_Threat-Based_Security_Analysis_for_the_Internet_of_Things"]}