{"id":"308272221_Digital_Humanitarians_Citizen_journalists_on_the_virtual_front_line_of_natural_and_human-caused_disasters","abstract":"Eyewitness user-generated content has dominated the study of citizen journalism in crisis and conflict zones. However, the convergence of online networked technologies, like social media, collaborative mapping and real-time information management, gives ordinary people the capacity to commit acts of journalism from afar. Networks of virtual volunteers act as digital humanitarians who rapidly assemble situational awareness at the onset of natural and human-caused disasters through crowdsourcing, data analysis and crisis mapping to aid on-the-ground emergency response. While they have been studied through the multi-disciplinary lens of information science, computation, geography and emergency management, digital humanitarians have received little attention in the journalism literature. This exploratory study contends that the knowledge-based content produced by these groups is citizen journalism akin to data-driven investigative news. Two case studies and a cross-case analysis consider this argument through digital humanitarian work of the Standby Task Force on the 2015 European refugee crisis and the 2016 earthquake in Ecuador. These and other emerging crisis/conflict zone examples suggest a broader perspective is needed on citizen journalism not bounded by eyewitness user-generated content. Future research directions to explore digital humanitarianism as a form of citizen journalism are also offered.","authors":["Wendy Norris"],"meta":["September 2016Journalism Practice 11(2-3):1-16","DOI:10.1080/17512786.2016.1228471"],"references":["308832997_Engineering_scale_up_in_humanitarian_innovations_missing_middle","301795166_Media_Sociology_and_the_Hierarchy_of_Influences_Model_A_levels-of-analysis_perspective_on_the_networked_public_sphere","297693701_The_Media_Work_of_Syrian_Diaspora_Activists_Brokering_Between_the_Protest_and_Mainstream_Media","297608117_The_New_Geography_of_Journalism_Research","290908702_The_Wealth_of_Networks","330327855_Crowdsourcing","308825529_Exploring_the_citizen-driven_response_to_crisis_in_cyberspace_risk_and_the_need_for_resilience","296475394_Data_hubris_Humanitarian_information_systems_and_the_mirage_of_technology","288622904_New_frames_on_crisis_Citizen_journalism_changing_the_dynamics_of_crisis_communication","285401858_The_limits_of_crisis_data_analytical_and_ethical_challenges_of_using_social_and_mobile_data_to_understand_disasters"]}