{"id":"308375530_From_the_NSF_The_National_Science_Foundations_Investments_in_Broadening_Participation_in_Science_Technology_Engineering_and_Mathematics_Education_through_Research_and_Capacity_Building","abstract":"The National Science Foundation (NSF) has a long history of investment in broadening participation (BP) in science, technology, engineering, and mathematics (STEM) education. A review of past NSF BP efforts provides insights into how the portfolio of programs and activities has evolved and the broad array of innovative strategies that has been used to increase the participation of groups underrepresented in STEM, including women, minorities, and persons with disabilities. While many are familiar with these long-standing programmatic efforts, BP is also a key component of NSF’s strategic plans, has been highlighted in National Science Board reports, and is the focus of ongoing outreach efforts. The majority of familiar BP programs, such as the Louis Stokes Alliances for Minority Participation (now 25 years old), are housed in the Directorate for Education and Human Resources. However, fellowship programs such as the Graduate Research Fellowships and Postdoctoral Research Fellowships under the Directorate for Biological Sciences (and parallel directorates in other STEM disciplines) are frequently used to address underrepresentation in STEM disciplines. The FY2016 and FY2017 budget requests incorporate funding for NSF INCLUDES, a new cross-agency BP initiative that will build on prior successes while addressing national BP challenges. NSF INCLUDES invites the use of innovative approaches for taking evidence- based best practices to scale, ushering in a new era in NSF BP advancement.","authors":["Sylvia M James","Susan Singer"],"meta":["September 2016CBE life sciences education 15(3)","DOI:10.1187/cbe.16-01-0059"],"references":["275246797_Achieving_Broader_Impacts_in_the_National_Science_Foundation_Division_of_Environmental_Biology","315856318_Barriers_and_Opportunities_for_2-year_and_4-year_STEM_Degrees","298869763_The_relationship_of_undergraduate_research_participation_to_graduate_and_professional_education_pursuit_An_empirical_study","282051953_National_Institutes_of_Health_address_the_science_of_diversity","265392767_Making_a_Difference_in_Science_Education_The_Impact_of_Undergraduate_Research_Programs","264799698_Women_Minorities_and_Persons_with_Disabilities_in_Science_and_Engineering_2011_NSF_11-309","258468732_Expanding_Underrepresented_Minority_Participation_America's_Science_and_Technology_Talent_at_the_Crossroads","237242672_High-impact_educational_practices_What_they_are_who_has_access_to_them_and_why_they_matter","236228541_Driven_by_Diversity","234609814_National_Science_Foundation_Annual_Report_1972"]}