{"id":"308390128_Unmasking_the_crowd_participants'_motivation_factors_expectations_and_profile_in_a_crowdsourced_law_reform","abstract":"This article examines the demographic characteristics, motivations, and expectations of participants in a crowdsourced off-road traffic law reform in Finland. We found that the participants were mainly educated, full-time working professional males with a strong interest in off-road traffic. Though a minority, the women participating in the process produced more ideas than the men. The crowd was motivated by a mix of intrinsic and extrinsic factors. Intrinsic motivations included fulfilling civic duty, affecting the law for sociotropic reasons, to deliberate with and learn from peers. Extrinsic motivations included changing the law for financial gain or other benefits. Participation in crowdsourced policy-making was an act of grassroots advocacy, whether to pursue one’s own interest or more altruistic goals, such as protecting nature. The motivations driving the participation were in part similar to those observed in traditional democratic processes, such as elections as well as other online collaborations such as crowdsourced journalism and citizen science. The crowds’ behavior was, however, paradoxical. They participated despite the fact that they did not expect that their contributions would affect the law.","authors":["Tanja Aitamurto","Hélène Landemore","Jorge Saldivar"],"meta":["September 2016Information Communication and Society 20(8):1-22","DOI:10.1080/1369118X.2016.1228993","Project: The 2012 Finnish experiment (in crowdsourced policy-making)"],"references":["316674547_Why_Do_People_Vote_An_Experiment_in_Rationality","291074594_Crowdsourced_Off-Road_Traffic_Law_Experiment_In_Finland_Report_about_idea_crowdsourcing_and_evaluation","290438719_Five_design_principles_for_crowdsourced_policymaking_Assessing_the_case_of_crowdsourced_off-road_traffic_law_in_Finland","290438387_Motivation_Factors_in_Crowdsourced_Journalism_Social_Impact_Social_Change_and_Peer_Learning","344752396_Smart_Citizens_Smarter_State_The_Technologies_of_Expertise_and_the_Future_of_Governing","325496702_Hang-a-rounds_and_true_believers_A_case_analysis_of_the_roles_and_motivational_factors_of_the_Star_Wreck_fans","316807278_Intrinsic_Motivation_and_Self-Determination_in_Human_Behavior","313561468_Theory_and_Practice_The_Mediating_Discourse","312902885_Democratic_innovations_designing_institutions_for_citizen_participation","289963904_Intrinsic_and_extrinsic_motivations_Classic_definitions_and_new_directions"]}