{"id":"308321518_Select-Additive_Learning_Improving_Cross-individual_Generalization_in_Multimodal_Sentiment_Analysis","abstract":"Multimodal sentiment analysis is drawing an increasing amount of attention these days. It enables mining of opinions in video reviews and surveys which are now available aplenty on online platforms like YouTube. However, the limited number of high-quality multimodal sentiment data samples may introduce the problem of the sentiment being dependent on the individual specific features in the dataset. This results in a lack of generalizability of the trained models for classification on larger online platforms. In this paper, we first examine the data and verify the existence of this dependence problem. Then we propose a Select-Additive Learning (SAL) procedure that improves the generalizability of trained discriminative neural networks. SAL is a two-phase learning method. In Selection phase, it selects the confounding learned representation. In Addition phase, it forces the classifier to discard confounded representations by adding Gaussian noise. In our experiments, we show how SAL improves the generalizability of state-of-the-art models. We increase prediction accuracy significantly in all three modalities (text, audio, video), as well as in their fusion. We show how SAL, even when trained on one dataset, achieves good accuracy across test datasets.","authors":["Haohan Wang","Aaksha Meghawat","Louis-Philippe Morency","Eric P. Xing"],"meta":["September 2016"],"references":["306093564_Dimensional_Sentiment_Analysis_Using_a_Regional_CNN-LSTM_Model","345827563_Micro-opinion_Sentiment_Intensity_Analysis_and_Summarization_in_Online_Videos","319770439_Efficient_Estimation_of_Word_Representations_in_Vector_Space","292652912_Generalized_linear_mixed_models_Estimation_and_inference","288822687_On_the_relevance_of_sequence_information_for_decoding_facial_expressions_of_pain_and_disgust_-_An_avatar_study","287114015_Sentiment_Analysis_of_Call_Centre_Audio_Conversations_using_Text_Classification","284039049_Recursive_deep_models_for_semantic_compositionality_over_a_sentiment_treebank","282912550_Magic_mirror_in_my_hand_what_is_the_sentiment_in_the_lens_An_action_unit_based_approach_for_mining_sentiments_from_multimedia_contents","282517768_Fusing_audio_visual_and_textual_clues_for_sentiment_analysis_from_multimodal_content","281487457_Importance_Weighted_Autoencoders"]}