{"id":"308308533_BrainNetCNN_Convolutional_Neural_Networks_for_Brain_Networks_Towards_Predicting_Neurodevelopment","abstract":"We propose BrainNetCNN, a convolutional neural network (CNN) framework to predict clinical neurodevelopmental outcomes from brain networks. In contrast to the spatially local convolutions done in traditional image-based CNNs, our BrainNetCNN is composed of novel edge-to-edge, edge-to-node and node-to-graph convolutional filters that leverage the topological locality of structural brain networks. We apply the BrainNetCNN framework to predict cognitive and motor developmental outcome scores from structural brain networks of infants born preterm. Diffusion tensor images (DTI) of preterm infants, acquired between 27 and 46 weeks gestational age, were used to construct a dataset of structural brain connectivity networks. We first demonstrate the predictive capabilities of BrainNetCNN on synthetic phantom networks with simulated injury patterns and added noise. BrainNetCNN outperforms a fully connected neural-network with the same number of model parameters on both phantoms with focal and diffuse injury patterns. We then apply our method to the task of joint prediction of Bayley-III cognitive and motor scores, assessed at 18 months of age, adjusted for prematurity. We show that our BrainNetCNN framework outperforms a variety of other methods on the same data. Furthermore, BrainNetCNN is able to identify an infant's post menstrual age to within about 2 weeks. Finally, we explore the high-level features learned by BrainNetCNN by visualizing the importance of each connection in the brain with respect to predicting the outcome scores. These findings are then discussed in the context of the anatomy and function of the developing preterm infant brain.","authors":["Jeremy Kawahara","Colin J Brown","Steven P Miller","Brian G Booth"],"meta":["September 2016NeuroImage 146","DOI:10.1016/j.neuroimage.2016.09.046","Project: Connectome analysis of preterm infants"],"references":["320258552_Circos_An_information_aesthetic_for_comparative_genomics","309457251_Structured_prediction_with_convolutional_neural_networks_for_multimodal_brain_tumor_segmentation","305726304_Local_Structure_Prediction_with_Convolutional_Neural_Networks_for_Multimodal_Brain_Tumor_Segmentation","283403600_Deep_Learning_of_Image_Features_from_Unlabeled_Data_for_Multiple_Sclerosis_Lesion_Segmentation","282199973_Prediction_of_Motor_Function_in_Very_Preterm_Infants_Using_Connectome_Features_and_Local_Synthetic_Instances","279068728_DeepOrgan_Multi-level_Deep_Convolutional_Networks_for_Automated_Pancreas_Segmentation","278734053_Deep_Convolutional_Networks_on_Graph-Structured_Data","291990287_Incidence_and_evolution_of_subependymal_and_intraventricular_hemorrhage_a_study_of_infants_with_birth_weights_less_than_1500_g","283448600_STEAM_-_Statistical_Template_Estimation_for_Abnormality_Mapping_a_Personalized_DTI_Analysis_Technique_with_Applications_to_the_Screening_of_Preterm_Infants","278047488_Evaluation_of_machine_learning_algorithms_for_treatment_outcome_prediction_in_patients_with_epilepsy_based_on_structural_connectome_data"]}