{"id":"308345778_Proyecto_TACCLE3_-_Coding","abstract":"Resumen— Como introducción a la sesión de Pensamiento Computacional del XVIII Simposio Internacional en Informática Educativa se presenta el proyecto europeo TACCLE3 Coding, que busca introducir la programación en los estudios de preuniversitarios con especial énfasis en la edad de 4-14 años Palabras clave—pensamiento computacional, programación en estudios pre-universitarios, TACCLE3 I. INTRODUCCIÓN Vivimos en una sociedad con cada vez más influencia de las tecnologías y en especial del software [1]. La Sociedad demanda profesionales para el sector tecnológico, lo que debe suponer un cambio en la estrategia en la educación a medio/largo plazo para conseguir profesionales con las competencias demandadas o que estén en condiciones, como poco, de comprender el mundo digital en el que trabajan y se relacionan [2]. Esto está llevando a que muchos gobiernos se estén planteando introducir la alfabetización digital desde edades tempranas, haciendo un especial hincapié en que se comprenda el lenguaje digital en lugar de que los niños se conviertan en meros usuarios de programas de ordenador, para lo que se está recurriendo a incluir la programación de aplicaciones software [3] y a estrategias basadas en el concepto de pensamiento computacional [4]. Desde la Universidad se debe ser consciente del reto que está demandando la Sociedad [6] y estar a la altura para ayudar y colaborar con los diferentes actores involucrados a incorporar de la manera más efectiva este tipo de compentencias, pero con miras a que se consoliden las denominadas competencias del Siglo XXI, esto es, el pensamiento crítico, la resolución de problemas, la colaboración, la comunicación y la creatividad [7-8]. Una de las iniciativas orientada a explorar cómo introducir la programación y el pensamiento computacional en la educación de niños y niñas de entre 4 y 14 años es el proyecto europeo Erasmus+ KA2 \" TACCLE3 – Coding \" (Ref. 2015-1-BE02-KA201-012307-http://www.taccle3.eu/). II. TACCLE3-CODING Este proyecto financiado en el Programa Erasmus+ quiere servir de apoyo a los docentes que quieren enseñar programación o utilizar técnicas de pensamiento computacional a niños y niñas de unas edades en el rango de 4-14 años aproximadamente. Los diferentes resultados derivados de este proyecto van orientados a que los docentes puedan acceder al conocimiento y a los recursos que necesiten para su actividad, que estarán accesibles en licencia Creative Commons en el portal web http://www.taccle3.eu/. También se impartirán cursos de formación específicos tanto para profesores en ejercicio como para futuros docentes. Se parte de la realidad europea en la que muchos de los gobiernos 3están introduciendo la programación como material esencial de los currículos oficiales. Esto ya es una realidad en algunos países, mientras que en otros están estudiando cómo llevarlo a cabo. Obviamente el nivel de detalle de cada currículo será diferente en cada país, o en cada comunidad autónoma como puede ser el caso español, pero existen elementos comunes en todos ellos, pudiéndose destacar la programación, las tecnologías de control y el pensamiento computacional. Fig. 1. Página principal del proyecto TACCLE3 – Coding. Fuente: http://www.taccle3.eu/ En la Figura 1 se puede apreciar la página principal del proyecto. A partir de ella se puede acceder a recursos de diferente tipo organizados en las categorías (ver Figura 2):","authors":["Francisco José García-Peñalvo"],"meta":["September 2016","In book: XVIII Simposio Internacional de Informática Educativa, SIIE 2016 (pp.187-189)Publisher: Ediciones Universidad de SalamancaEditors: F. J. García-Peñalvo, A. J. Mendes"],"references":["220420371_Computational_thinking","226284480_Defining_Twenty-First_Century_Skills"]}