{"id":"308320932_Citation_Analysis_with_Microsoft_Academic","abstract":"We explore if and how Microsoft Academic (MA) could be used for bibliometric analyses. First, we examine the Academic Knowledge API (AK API), an interface to access MA data, and compare it to Google Scholar (GS). Second, we perform a comparative citation analysis of researchers by normalizing data from MA and Scopus. We find that MA offers structured and rich metadata, which facilitates data retrieval, handling and processing. In addition, the AK API allows retrieving frequency distributions of citations. We consider these features to be a major advantage of MA over GS. However, we identify four main limitations regarding the available metadata. First, MA does not provide the document type of a publication. Second, the “fields of study” are dynamic, too specific and field hierarchies are incoherent. Third, some publications are assigned to incorrect years. Fourth, the metadata of some publications did not include all authors. Nevertheless, we show that an average-based indicator (i.e. the journal normalized citation score; JNCS) as well as a distribution-based indicator (i.e. percentile rank classes; PR classes) can be calculated with relative ease using MA. Hence, normalization of citation counts is feasible with MA. The citation analyses in MA and Scopus yield uniform results. The JNCS and the PR classes are similar in both databases, and, as a consequence, the evaluation of the researchers’ publication impact is congruent in MA and Scopus. Given the fast development in the last year, we postulate that MA has the potential to be used for full-fledged bibliometric analyses.","authors":["Sven E. Hug","Michael Ochsner","Martin Paul Brändle"],"meta":["January 2017Scientometrics 111(1):371–378","DOI:10.1007/s11192-017-2247-8","Project: Bibliometrics with Microsoft Academic"],"references":["311491690_WSDM_Cup_2016_Entity_Ranking_Challenge","310739030_Microsoft_Academic_is_the_phoenix_getting_wings","308745997_The_application_of_bibliometrics_to_research_evaluation_in_the_humanities_and_social_sciences_an_exploratory_study_using_normalized_Google_Scholar_data_for_the_publications_of_a_research_institute","303856491_Microsoft_Academic_Search_a_Phoenix_arisen_from_the_ashes","301926322_Quantifying_the_Diaspora_of_Knowledge_in_the_Last_Century","301841741_Simplified_Relative_Citation_Ratio_for_Static_Paper_Ranking_UFMGLATIN_at_WSDM_Cup_2016","268271559_Users_Narcissism_and_Control-Tracking_the_Impact_of_Scholarly_Publications_in_the_21_st_Century","307822863_An_Overview_of_Microsoft_Academic_Service_MAS_and_Applications","292947794_Using_Google_Scholar_in_research_evaluation_of_humanities_and_social_science_programs_A_comparison_with_Web_of_Science_data","281811082_The_application_of_bibliometrics_to_research_evaluation_in_the_humanities_and_social_sciences_An_exploratory_study_using_normalized_Google_Scholar_data_for_the_publications_of_a_research_institute"]}