{"id":"308304413_A_non-locking_composite_tetrahedron_element_for_the_combined_finite_discrete_element_method","abstract":"Purpose\nIn order to avoid the problem of volumetric locking often encountered when using constant strain tetrahedral finite elements, the purpose of this paper is to present a new composite tetrahedron element which is especially designed for the combined finite-discrete element method (FDEM).\n\nDesign/methodology/approach\nA ten-noded composite tetrahedral (COMPTet) finite element, composed of eight four-noded low order tetrahedrons, has been implemented based on Munjiza’s multiplicative decomposition approach. This approach naturally decomposes deformation into translation, rotation, plastic stretches, elastic stretches, volumetric stretches, shear stretches, etc. The problem of volumetric locking is avoided via a selective integration approach that allows for different constitutive components to be evaluated at different integration points.\n\nFindings\nA number of validation cases considering different loading and boundary conditions and different materials for the proposed element are presented. A practical application of the use of the COMPTet finite element is presented by quantitative comparison of numerical model results against simple theoretical estimates and results from acrylic fracturing experiments. All of these examples clearly show the capability of the composite element in eliminating volumetric locking.\n\nOriginality/value\nFor this tetrahedral element, the combination of “composite” and “low order sub-element” properties are good choices for FDEM dynamic fracture propagation simulations: in order to eliminate the volumetric locking, only the information from the sub-elements of the composite element are needed which is especially convenient for cases where re-meshing is necessary, and the low order sub-elements will enable robust contact interaction algorithms, which maintains both relatively high computational efficiency and accuracy.","authors":["Zhou Lei","Esteban Rougier","Earl E. Knight","Luke Frash"],"meta":["October 2016Engineering Computations 33(7)","DOI:10.1108/EC-09-2015-0268","Project: Fracture-permeability behavior of rock"],"references":["267640642_Fracture_development_around_deep_underground_excavations_Insights_from_FDEM_modeling","316216511_The_combined_finite-discrete_element_method","299164942_A_mixed-enhanced_formulation_for_tetrahedral_finite_elements","282442126_Smoothed_Finite_Element_Methods","277027368_Assessment_of_crack_initiation_and_propagation_in_rock_from_explosion-induced_stress_waves_and_gas_expansion_by_cross-hole_seismometry_and_FEM-DEM_method","276122969_Fracture-permeability_behavior_of_shale","268871238_Large_Strain_Finite_Element_Method_A_Practical_Course","264296063_Fracture_and_fragmentation_of_thin_shells_using_the_combined_finite-discrete_element_method","262490903_Validation_of_a_three-dimensional_Finite-Discrete_Element_Method_using_experimental_results_of_the_Split_Hopkinson_Pressure_Bar_test","255240175_The_Combined_Finite-Discrete_Element_Method_applied_to_the_Study_of_Rock_Fracturing_Behavior_in_3D"]}