{"id":"308313905_A_Descent_Lemma_Beyond_Lipschitz_Gradient_Continuity_First-Order_Methods_Revisited_and_Applications","abstract":"The proximal gradient and its variants is one of the most attractive first-order algorithm for minimizing the sum of two convex functions, with one being nonsmooth. However, it requires the differentiable part of the objective to have a Lipschitz continuous gradient, thus precluding its use in many applications. In this paper we introduce a framework which allows to circumvent the intricate question of Lipschitz continuity of gradients by using an elegant and easy to check convexity condition which captures the geometry of the constraints. This condition translates into a new descent lemma which in turn leads to a natural derivation of the proximal-gradient scheme with Bregman distances. We then identify a new notion of asymmetry measure for Bregman distances, which is central in determining the relevant step-size. These novelties allow to prove a global sublinear rate of convergence, and as a by-product, global pointwise convergence is obtained. This provides a new path to a broad spectrum of problems arising in key applications which were, until now, considered as out of reach via proximal gradient methods. We illustrate this potential by showing how our results can be applied to build new and simple schemes for Poisson inverse problems.","authors":["Jérôme Bolte","Heinz H. Bauschke","Marc Teboulle"],"meta":["July 2016Mathematics of Operations Research 42(2)","DOI:10.1287/moor.2016.0817"],"references":["267054708_On_the_Convergence_of_the_Proximal_Point_Algorithm_for_Convex_Minimization","265333961_A_Statistical_Model_for_Positron_Emission_Tomography","263048124_Convex_Analysis_and_Monotone_Operator_Theory_in_Hilbert_Space","315573860_Convex_Analysis_and_Monotone_Operator_Theory_in_Hilbert_Spaces","313876742_Proximiteet_dualite_dans_un_espace_hilbertien","304533564_Applications_of_the_method_of_multipliers_to_variational_inequalities","278762029_Signal_recovery_by_proximal_forwardC_backward_splitting","268163351_A_Gentle_Introduction_to_Optimization","267131054_Convex_optimization_in_signal_processing_and_communications","266062247_Rate_of_Convergence_Analysis_of_Decomposition_Methods_Based_on_the_Proximal_Method_of_Multipliers_for_Convex_Minimization"]}