{"id":"308457600_Organized_Complexity_Is_Big_History_a_Big_Computation","abstract":"The concept of \"logical depth\" introduced by Charles H. Bennett (1988) seems to capture, at least partially, the notion of organized complexity, so central in big history. More precisely, the increase in organized complexity refers here to the wealth, variety and intricacy of structures, and should not be confused with the increase of random complexity, formalized by Kolmogorov (1965). If Bennett is right in proposing to assimilate organized complexity with \"computational content\", then the fundamental cause of the increase of complexity in the universe is the existence of computing mechanisms with memory, and able to cumulatively create and preserve computational contents. In this view, the universe computes, remembers its calculations, and reuses them to conduct further computations. Evolutionary mechanisms are such forms of cumulative computation with memory and we owe them the organized complexity of life. Language, writing, culture, science and technology can also be analyzed as computation mechanisms generating, preserving and accelerating the increase in organized complexity. The main unifying theme for big history is the energy rate density, a metric based on thermodynamics. However useful, this metric does not provide much insight into the role that information and computation play in our universe. The concept of \"logical depth\" provides a new lens to examine the increase of organized complexity. We argue in this paper that organized complexity is a valid and useful way to make sense of big history. Additionally, logical depth has a rigorous formal definition in theoretical computer science that hints at a broader research program to quantify complexity in the universe.","authors":["Jean-Paul Delahaye","Clément Vidal"],"meta":["September 2016"],"references":["319393405_An_Introduction_to_Kolmogorov_Complexity_and_Its_Applications","299635804_Le_fil_de_la_vie_-_La_face_immaterielle_du_vivant","282182159_Approximations_of_Algorithmic_and_Structural_Complexity_Validate_Cognitive-behavioural_Experimental_Results","272682184_Cosmic_Evolution_The_Rise_of_Complexity_in_Nature","259283547_Robustness_of_Logical_Depth","345854707_The_Engine_of_Complexity_Evolution_as_Computation","316256485_Your_Digital_Afterlives","275742392_Sparks_of_Life_Darwinism_and_the_Victorian_Debates_over_Spontaneous_Generation","271406685_Ecosystem_Complexity_Through_the_Lens_of_Logical_Depth_Capturing_Ecosystem_Individuality","266013140_Complexity_depth_and_sophistication"]}