{"id":"308486431_To_be_human_nonetheless_remains_a_decision_Humanism_as_decisionism_in_contemporary_critical_political_theory","abstract":"This article suggests that humanism is a decisionism in contemporary critical political theory. Despite obvious and multiple differences, leading critical theorists like Giorgio Agamben, Slavoj Žižek, Eric Santner, and Jürgen Habermas, among others, share an investment in stabilizing the human being as a ground of the political. This stabilization of the human should concern political theorists, as this article argues, because it uncritically reproduces conceptual affinities between the notion of the human being and sovereign authority. By investing in the stability and centrality of the human being, these theorists perform what will be called, paraphrasing an often neglected argument by Carl Schmitt, a decision to be human. Contrary to conventional wisdom, I argue that Schmitt’s decisionism is not merely circumscribed to sovereignty’s juridico-political dimension, but that it also includes a peculiar commitment to God’s decision to become human in Christ. Against this decisionism as humanism, the article draws on Walter Benjamin, Roberto Esposito, and Jacques Derrida to propose an alternative politics that destabilizes humanity and sovereignty through the emergence of the animal, or what will be called melancholic lycanthropy.","authors":["Diego Hernan Rossello"],"meta":["November 2017Contemporary Political Theory 16(4)","DOI:10.1057/s41296-016-0070-2","Project: Political Lycanthropy: Towards Post-Human Agonistic Politics"],"references":["345633708_On_having_a_furry_soul_transpecies_identity_and_ontological_indeterminacy_in_Otherkin_subcultures","343802144_Philosophy_and_Melancholy_Benjamin's_Early_Reflections_on_Theater_and_Language","329653795_The_Monstrosity_of_Christ_Paradox_or_Dialectic","323320986_The_Republic","320181990_Simians_Cyborgs_and_Women_The_Reinvention_of_Nature","319484224_Rogues_Two_Essays_on_Reason","319484002_Speech_and_Phenomena_And_Other_Essays_on_Husserl's_Theory_of_Signs","319483764_Homo_Sacer_Sovereign_Power_and_Bare_Life","316970235_Christian_Human_Rights_An_Introduction","313275525_Woman's_nature_human_nature","313045012_Mourning_and_Melancholia","312977648_'Mourning_and_melancholia","301325944_The_standard_edition_of_the_complete_psychological_works_of_Sigmund_Freud","298621078_Melancholy_and_the_Act","298572515_Culture_and_melancholy_-_Introduction"]}