{"id":"308499063_It's_Computational_Thinking_Bebras_Tasks_in_the_Curriculum","abstract":"Bebras is an award-winning, international contest and challenge in informatics that has been running for 12 years in primary and secondary schools, with 50 countries now participating. From a single contest-focused annual event the Bebras developed to a multifunctional challenge; an activities-based educational community-building network has grown up where the development of Bebras tasks has taken a very significant role. Bebras tasks present a motivating way to introduce computer science concepts to students as well as developing computational thinking skills. Tasks are categorized in terms of the concepts being covered, and each task includes an explanation of how the task relates to informatics. In this paper we propose that Bebras tasks can be used within the school curriculum (whether it is called informatics, computer science, computing or information technology) to promote computational thinking and provide teaching materials. We give examples of Bebras tasks that could be incorporated into the curriculum, and make recommendations for schools wishing to develop children?s computational thinking skills.","authors":["Valentina Dagiene","Sue Sentance"],"meta":["October 2016","DOI:10.1007/978-3-319-46747-4_3","Conference: International Conference on Informatics in Schools: Situation, Evolution, and Perspectives","Projects: Bebras - International challenge on Informatics and CTBebras"],"references":["327302966_Computational_thinking_-_a_guide_for_teachers","312222095_Introducing_computational_thinking_through_a_contest_on_informatics_Problem-solving_and_gender_issues","303943002_A_Framework_for_Computational_Thinking_Based_on_a_Systematic_Research_Review","303239675_Bebras_-_a_Sustainable_Community_Building_Model_for_the_Concept_Based_Learning_of_Informatics_and_Computational_Thinking","300253595_Introducing_a_New_Computer_Science_Curriculum_for_All_School_Levels_in_Poland","299450690_Computational_thinking_the_developing_definition","291411712_Informatics_Education_based_on_Solving_Attractive_Tasks_through_a_Contest","300481277_How_Challenging_are_Bebras_Tasks","290947050_Concepts_in_K-9_Computer_Science_Education","290746984_Reasoning_on_Children's_Cognitive_Skills_in_an_Informatics_Contest_Findings_and_Discoveries_from_Finland_Lithuania_and_Sweden"]}