{"id":"308576953_Multi-Category_RFID_Estimation","abstract":"This paper concerns the practically important problem of multi-category radio frequency identification (RFID) estimation: given a set of RFID tags, we want to quickly and accurately estimate the number of tags in each category. However, almost all the existing RFID estimation protocols are dedicated to the estimation problem on a single set, regardless of tag categories. A feasible solution is to separately execute the existing estimation protocols on each category. The execution time of such a serial solution is proportional to the number of categories, and cannot satisfy the delay-stringent application scenarios. Simultaneous RIFD estimation over multiple categories is desirable, and hence, this paper proposes an approach called simultaneous estimation for multi-category RFID systems (SEM). SEM exploits the Manchester-coding mechanism, which is supported by the ISO 18000-6 RFID standard, to decode the combined signals, thereby simultaneously obtaining the reply status of tags from each category. As a result, multiple bit vectors are decoded from just one physical slotted frame. Built on our SEM, many existing excellent estimation protocols can be used to estimate the tag cardinality of each category in a simultaneous manner. To ensure the predefined accuracy, we calculate the variance of the estimate in one round, as well as the variance of the average estimate in multiple rounds. To find the optimal frame size, we propose an efficient binary search-based algorithm. To address significant variance in category sizes, we propose an adaptive partitioning (AP) strategy to group categories of similar sizes together and execute the estimation protocol for each group separately. Compared with the existing protocols, our approach is much faster, meanwhile satisfying the predefined estimation accuracy. For example, with 20 categories, the proposed SEM+AP is about seven times faster than prior estimation schemes. Moreover, our approach is the only one whose normalized estimation time (i.e., time per category) decreases as the number of categories increases.","authors":["Xiulong Liu","Keqiu Li","Alex X. Liu","Song Guo"],"meta":["September 2016IEEE/ACM Transactions on Networking PP(99):1-14","DOI:10.1109/TNET.2016.2594481","Project: IoT and Big Data enabled Approaches for Smart Cities"],"references":["311168646_RFID_Estimation_With_Blocker_Tags","305274740_Fast_Tracking_the_Population_of_Key_Tags_in_Large-Scale_Anonymous_RFID_Systems","292148941_RFID_Cardinality_Estimation_with_Blocker_Tags","325537848_Generalized_energy-efficient_algorithms_for_the_RFID_estimation_problem","319477457_P-MTI_Physical-Layer_Missing_Tag_Identification_via_Compressive_Sensing","312670830_Identifying_State-Free_Networked_Tags","311474067_Probabilistic_optimal_tree_hopping_for_RFID_identification","309639582_Identifying_State-Free_Networked_Tags","301464147_ShopMiner_Mining_Customer_Shopping_Behavior_in_Physical_Clothing_Stores_with_COTS_RFID_Devices","299866166_See_Through_Walls_with_COTS_RFID_System","283307980_Fast_RFID_grouping_protocols","285971055_An_Efficient_Protocol_for_RFID_Multigroup_Threshold-Based_Classification_Based_on_Sampling_and_Logical_Bitmap","278190741_Check_out_the_Rules_Towards_Time-Efficient_Rule_Checking_over_RFID_Tags","276242309_Perceiving_the_Slightest_Tag_Motion_beyond_Localization","273393622_Fast_and_accurate_estimation_of_RFID_tags"]}