{"id":"308573686_Big_Data_epistemology_and_causality_Knowledge_in_and_knowledge_out_in_EXPOsOMICS","abstract":"Recently, it has been argued that the use of Big Data transforms the sciences, making data-driven research possible and studying causality redundant. In this paper, I focus on the claim on causal knowledge by examining the Big Data project EXPOsOMICS, whose research is funded by the European Commission and considered capable of improving our understanding of the relation between exposure and disease. While EXPOsOMICS may seem the perfect exemplification of the data-driven view, I show how causal knowledge is necessary for the project, both as a source for handling complexity and as an output for meeting the project?s goals. Consequently, I argue that data-driven claims about causality are fundamentally flawed and causal knowledge should be considered a necessary aspect of Big Data science. In addition, I present the consequences of this result on other data-driven claims, concerning the role of theoretical considerations. I argue that the importance of causal knowledge and other kinds of theoretical engagement in EXPOsOMICS undermine theory-free accounts and suggest alternative ways of framing science based on Big Data.","authors":["Stefano Canali"],"meta":["September 2016Big Data & Society 3(2)","DOI:10.1177/2053951716669530"],"references":["295253316_What_makes_Big_Data_Big_Data_Exploring_the_ontological_characteristics_of_26_datasets","283420101_Nature's_Capacities_and_their_Measurement","315223717_Molecular_Epidemiology_and_Biomarkers_in_Etiologic_Cancer_Research_The_New_in_Light_of_the_Old","306143505_The_Causal_Nature_of_Modeling_with_Big_Data","303997726_Orienteering_Tools_Biomedical_Research_with_Ontologies","297260474_The_Oxford_Handbook_of_Causation","284575113_Big_Data_and_Information_Quality","282485814_Can_Big_Data_Solve_the_Fundamental_Problem_of_Causal_Inference","282485643_Big_Data_Causal_Inference_and_Formal_Theory_Contradictory_Trends_in_Political_Science","279733446_A_statistical_framework_to_model_the_meeting-in-the-middle_principle_using_metabolomic_data_application_to_hepatocellular_carcinoma_in_the_EPIC_study"]}