{"id":"308547358_Amelioration_de_la_traduction_automatique_d'un_corpus_annote","abstract":"RÉSUMÉ Dans cet article, nous présentons une méthode pour améliorer la traduction automatique d'un corpus annoté et porter ses annotations de l'anglais vers une langue cible. Il s'agit d'améliorer la méthode de (Nasiruddin et al., 2015) qui donnait de nombreux segments non traduits, des duplications et des désordres. Nous proposons un processus de pré-traitement du SemCor anglais, pour qu'il soit adapté au système de traduction automatique statistique utilisé, ainsi qu'un processus de post-traitement pour la sortie. Nous montrons une augmentation de 2,9 points en terme de score F1 sur une tâche de désambiguïsation lexicale ce qui prouve l'efficacité de notre méthode. ABSTRACT Improvement of the automatic translation of an annotated corpus In this article, we present a method to improve the automatic translation of an annotated corpus and transfer its annotations from English to any target language. The idea is to improve method of (Nasirud-din et al., 2015) which leads to many untranslated segments, duplications and disorders. We propose a pre-treatment process for the English SemCor, to adapt it to the statistical machine translation system, as well as a post-treatment process for the output of SMT. We show an increase of 2,9 points in terms of F1 score on a Word Sense Disambiguation task which proves the effectiveness of our method.","authors":["Marwa Hadj Salah","Hervé Blanchon","Mounir Zrigui","Didier Schwab"],"meta":["June 2016","Conference: 23ème Conférence sur le Traitement Automatique des Langues NaturellesAt: inalco, paris, France","Project: oreillodule: a real-time speech arabic translation system"],"references":["277283124_Creation_rapide_et_efficace_d'un_systeme_de_desambiguisation_lexicale_pour_une_langue_peu_dotee","256536702_The_LIG_English_to_French_Machine_Translation_System_for_IWSLT_2012","220874004_Moses_Open_Source_Toolkit_for_Statistical_Machine_Translation","285623211_A_Standard_Corpus_of_Edited_Present-Day_American_English","237247894_Design_of_the_Moses_Decoder_for_Statistical_Machine_Translation","200504309_TreeTagger_-_a_language_independent_part-of-speech_tagger","200044309_WordNet_A_Lexical_Database_for_English"]}