{"id":"308513683_Sensor_Fusion_and_Smart_Sensor_in_Sports_and_Biomedical_Applications","abstract":"The following work presents an overview of smart sensors and sensor fusion targeted at biomedical applications and sports areas. In this work, the integration of these areas is demonstrated, promoting a reflection about techniques and applications to collect, quantify and qualify some physical variables associated with the human body. These techniques are presented in various biomedical and sports applications, which cover areas related to diagnostics, rehabilitation, physical monitoring, and the development of performance in athletes, among others. Although some applications are described in only one of two fields of study (biomedicine and sports), it is very likely that the same application fits in both, with small peculiarities or adaptations. To illustrate the contemporaneity of applications, an analysis of specialized papers published in the last six years has been made. In this context, the main characteristic of this review is to present the largest quantity of relevant examples of sensor fusion and smart sensors focusing on their utilization and proposals, without deeply addressing one specific system or technique, to the detriment of the others.","authors":["José Jair Alves Mendes Júnior","Mario Elias Marinho Vieira","Marcelo Bissi Pires","Sergio L. Stevan Jr."],"meta":["September 2016Sensors 16(10):1569","DOI:10.3390/s16101569","Project: Sensor Fusion for performance monitoring in sports"],"references":["308823607_FreeWalker_a_smart_insole_for_longitudinal_gait_analysis","304576033_El_smart_sensor_glove_for_arthritis_rehabiliation","299372222_Wearable_Textile_Platform_for_Assessing_Stroke_Patient_Treatment_in_Daily_Life_Conditions","291339406_High_Accuracy_Resistance_to_Current_Circuit_Design_of_Resistive_Gas_Sensor_Interface_for_Biomedical_Applications","344040567_Sensors_in_Biomedical_Applications_Fundamentals_Technology_and_Applications","308845918_Fusing_Simultaneous_EEG_and_fMRI_Using_Functional_and_Anatomical_Information","308840545_Low-cost_dry_swimming_machine_using_Kinect_biomotion_capture","308814309_Laser_and_force_sensors_based_human_motion_intent_estimation_algorithm_for_walking-aid_robot","301411623_A_novel_approach_of_prosthetic_arm_control_using_computer_vision_biosignals_and_motion_capture","288485148_Human_gait_modeling_and_gait_analysis_based_on_Kinect"]}