{"id":"308530031_Passive_Guaranteed_Simulation_of_Analog_Audio_Circuits_A_Port-Hamiltonian_Approach","abstract":"We present a method that generates passive-guaranteed stable simulations of analog audio circuits from electronic schematics for real-time issues. On one hand, this method is based on a continuous-time power-balanced state-space representation structured into its energy-storing parts, dissipative parts, and external sources. On the other hand, a numerical scheme is especially designed to preserve this structure and the power balance. These state-space structures define the class of port-Hamiltonian systems. The derivation of this structured system associated with the electronic circuit is achieved by an automated analysis of the interconnection network combined with a dictionary of models for each elementary component. The numerical scheme is based on the combination of finite differences applied on the state (with respect to the time variable) and on the total energy (with respect to the state). This combination provides a discrete-time version of the power balance. This set of algorithms is valid for both the linear and nonlinear case. Finally, three applications of increasing complexities are given: a diode clipper, a common-emitter bipolar-junction transistor amplifier, and a wah pedal. The results are compared to offline simulations obtained from a popular circuit simulator.","authors":["Antoine Falaize","Thomas Hélie"],"meta":["September 2016","DOI:10.3390/app6100273","Project: PyPHS - a python framework for guaranteed-passive modeling and simulation of multi-physical systems"],"references":["299514713_An_Improved_and_Generalized_Diode_Clipper_Model_for_Wave_Digital_Filters","281947135_Energy-balanced_models_for_acoustic_and_audio_systems_a_port-Hamiltonian_approach","265543661_American_Options_A_Comparison_of_Numerical_Methods","246545898_Large_Scale_Physical_Modeling_Sound_Synthesis","281992919_Lyapunov_stability_analysis_of_the_Moog_Ladder_Filter_and_dissipativity_aspects_in_numerical_solutions","278817144_Simulation_of_an_analog_circuit_of_a_wah_pedal_a_port-Hamiltonian_approach","269277552_A_multidimensional_approach_to_Wave_Digital_Filters_with_multiple_nonlinearities","266510130_Introduction_to_mechanics_and_symmetry_a_basic_exposition_of_classical_mechanical_systems","265590564_Geometric_numerical_integration_Structure-preserving_algorithms_for_ordinary_differential_equations_2nd_ed","260697947_Automated_Physical_Modeling_of_Nonlinear_Audio_Circuits_for_Real-Time_Audio_Effects-Part_II_BJT_and_Vacuum_Tube_Examples"]}