{"id":"308532365_Computer-assisted_client_assessment_survey_for_mental_health_Patient_and_health_provider_perspectives","abstract":"Background\nThe worldwide rise in common mental disorders (CMDs) is posing challenges in the provision of and access to care, particularly for immigrant, refugee and racialized groups from low-income backgrounds. eHealth tools, such as the Interactive Computer-Assisted Client Assessment Survey (iCCAS) may reduce some barriers to access. iCCAS is a tablet-based, touch-screen self-assessment completed by clients while waiting to see their family physician (FP) or nurse practitioner (NP). In an academic-community initiative, iCCAS was made available in English and Spanish at a Community Health Centre in Toronto through a mixed-method trial.\n\nMethods\nThis paper reports the perspectives of clients in the iCCAS group (n = 74) collected through an exit survey, and the perspectives of 9 providers (four FP and five NP) gathered through qualitative interviews. Client acceptance of the tool was assessed for cognitive and technical dimensions of their experience. They rated twelve items for perceived Benefits and Barriers and four questions for the technical quality.\n\nResults\nMost clients reported that the iCCAS completion time was acceptable (94.5 %), the touch-screen was easy to use (97.3 %), and the instructions (93.2 %) and questions (94.6 %) were clear. Clients endorsed the tool’s Benefits, but were unsure about Barriers to information privacy and provider interaction (mean 4.1, 2.6 and 2.8, respectively on a five-point scale). Qualitative analysis of the provider interviews identified five themes: challenges in Assessing Mental Health Services, such as case complexity, time, language and stigma; the Tool’s Benefits, including non-intrusive prompting of clients to discuss mental health, and facilitation of providers’ assessment and care plans; the Tool’s Integration into everyday practice; Challenges for Use (e.g. time); and Promoting Integration Effectively, centered on the timing of screening, setting readiness, language diversity, and technological advances.\n\nConclusions\nParticipant clients and providers perceived iCCAS as an easy and useful tool for mental health assessments at the Community Health Centre and similar settings. The findings are anticipated to inform further work in this area.\n\nTrial registration\nClinicalTrials.gov; NCT02023957; Registered retrospectively 12 Dec. 2013","authors":["Manuela Ferrari","Farah Ahmad","Yogendra Shakya","Cliff Ledwos"],"meta":["September 2016BMC Health Services Research 16(1)","DOI:10.1186/s12913-016-1756-0","Project: iCCAS Project"],"references":["268283110_Adoption_Reach_Implementation_and_Maintenance_of_a_Behavioral_and_Mental_Health_Assessment_in_Primary_Care","268282375_Implementation_of_a_collaborative_care_model_for_the_treatment_of_depression_and_anxiety_in_a_community_health_center_Results_from_a_qualitative_case_study","311533250_Projections_of_global_mortality_and_burden_of_disease_from_2002_to_2030","297968832_eHealth_Solutions_for_Healthcare_Disparities","292585618_Projection_of_global_mortality_and_burden_of_disease_from_2002_to_2030","283859009_Improving_health_care_proxy_documentation_using_a_web-based_interview_through_a_patient_portal","272289298_Computer-Based_Interview_for_Screening_Blood_Donors_for_Risk_of_HIV_Transmission","263195452_The_PHQ-9_Validity_of_a_Brief_Depression_Severity_Measure","262265398_Refugees'_advice_to_physicians_How_to_ask_about_mental_health","256481453_eCHAT_for_Lifestyle_and_Mental_Health_Screening_in_Primary_Care"]}