{"id":"308647193_Using_an_innovative_assessment_approach_on_a_real-world_group_based_software_project","abstract":"Currently, there is a lack of practical, real-world projects on Computer Science (CS) courses at Maynooth University. Generally CS undergraduate modules are composed of 24 hours of lectures and 24 hours of labs where students learn theoretical concepts in the lectures and apply their understanding to practical lab-based exercises. The problem with this approach is that students do not gain any awareness of, or learn how to solve tasks that they are likely to encounter in a real-world industrial setting; nor do they gain experience of working as part of a team even though most software development positions involve team-based work. This paper reports on a web-based development module that incorporated a real-world group based project was re-designed and delivered. The module went well; however, assessing the work fairly was found to be difficult, especially where team members contributed at considerably varying levels was a challenge. Of particular concern was that some hard-working students were penalised by other students poor work and lazy students were rewarded because of more hard-working students work. This action research project will attempt to re-address how to assess this group-based work with a cohort of students. The goal of the research is to implement an innovative assessment structure, using peer-, self-, and co-assessment, for a group based real-world project, that is deemed fair and reasonable and provided a good learning environment.","authors":["Susan Bergin","Aidan Mooney"],"meta":["September 2016"],"references":["292672522_An_Examination_of_Using_Self-_Peer-_and_Teacher-Assessment_in_Higher_Education_A_Case_Study_in_Teacher_Education","266400601_Synergies_for_Better_Learning_An_International_Perspective_on_Evaluation_and_Assessment","255583992_Aligning_Teaching_for_Constructing_Learning","251620773_Enhancing_Student_Learning_through_Assessment","286143430_The_present_the_past_and_the_future_of_achievement_testing_and_performance_assessment","259079363_Becoming_Critical_Education_Knowledge_and_Action_Research","254657454_An_Overview_of_the_Methodological_Approach_of_Action_Research","249797832_Student_Self-Assessment_in_Higher_Education_A_Meta-Analysis","245175246_Action_Research_in_Education","244504362_Student_Peer_Assessment_in_Higher_Education_A_Meta-Analysis_Comparing_Peer_and_Teacher_Marks"]}