{"id":"308670834_Orchestrated_crime_The_high_yield_investment_fraud_ecosystem","abstract":"A High Yield Investment Program (HYIP) is an online ‘Ponzi scheme’, a fraudulent scheme in which unusually high returns are financed by new investors until the scheme collapses. An ecosystem of enabling and promoting entities facilitates the industrialisation of this type of investment fraud. Aggregators are paid to list active HYIPs and receive a referral fee for every investor they introduce to a HYIP. A specialist software house provides ‘kits’ for both HYIPs and aggregators, drastically lowering the barriers to entry for criminals, so much so that they have dominated the market for the past ten years. We find clear rules and incentives throughout the ecosystem, and we show that this fraud is considerably more ‘orchestrated’ than suggested in previous studies. By analysing the flow of money between the various parts of the ecosystem we have been able to provide an accurate estimate of overall turnover ($47 million in 2013), and also to show that the average HYIP made a profit of $8 000; successful aggregators had individual revenues in excess of $250 000; and the kit supplier had an annual revenue of at least $500 000 and potentially, under reasonable assumptions, twice that figure. By analysing over 100 000 discussion comments made on HYIP sites we find that investors showing interest in HYIPs are from many countries, but the largest group are from the USA. Our financial modelling shows that even if investors are aware of the true nature of the HYIPs – and invest early to maximise their receipts – they still incur, even on some favourable assumptions, a mean loss of 24% of their investment. Regulatory action is needed to tackle this fraud and this paper demonstrates that targeting the sale of kits for HYIPs and aggregators would be a key step towards disrupting the HYIP ecosystem, with the removal of the aggregator sites the next most important action that is needed.","authors":["Jens Neisius","Richard Clayton"],"meta":["September 2014","DOI:10.1109/ECRIME.2014.6963164","Conference: 2014 APWG Symposium on Electronic Crime Research (eCrime)"],"references":["228460025_The_Postmodern_Ponzi_Scheme_Empirical_Analysis_of_High-Yield_Investment_Programs","221609892_Dissecting_one_click_frauds","216757795_Measuring_and_analyzing_search-redirection_attacks_in_the_illicit_online_prescription_drug_trade","286746140_Automatic_Identification_of_Replicated_Criminal_Websites_Using_Combined_Clustering","266335132_How_much_did_shutting_down_McColo_help","220039149_On_the_Effects_of_Registrar-level_Intervention"]}