{"id":"308669780_Force-Amplifying_N-robot_Transport_System_Force-ANTS_for_cooperative_planar_manipulation_without_communication","abstract":"We propose the concept of a Force-Amplifying N-robot Transport System (Force-ANTS) to coordinate the manipulation forces from a group of robots in order to transport a heavy object in a planar environment. Our approach requires no explicit communication among robots. Instead, we prove that robots can use local measurements of the object?s motion at their attachment points as implicit information for force coordination. A leader (either a robot or human) can guide the whole group towards the destination by applying a relatively small force, whose effect is amplified by the follower robots as they align their forces with the leader?s. Two Force-ANTS implementations are introduced and analyzed, accounting for two different classes of object dynamics: small objects where kinetic friction dominates, and large objects where inertia and viscous friction dominate. Our approach can be used as a modular system for transporting heavy objects of various sizes in many real-life applications. Simulations with up to 1000 robots and experiments using four custom-built robots are conducted to validate our approach. We also conduct human?robot cooperation experiments where the human force is amplified by three follower robots.","authors":["Zijian Wang","Mac Schwager"],"meta":["September 2016The International Journal of Robotics Research 35(13)","DOI:10.1177/0278364916667473"],"references":["303886309_Kinematic_multi-robot_manipulation_with_no_communication_using_force_feedback","283842963_Pipelined_consensus_for_global_state_estimation_in_multi-agent_systems","283230759_Local_motion_planning_for_collaborative_multi-robot_manipulation_of_deformable_objects","282985075_Distributed_centroid_estimation_and_motion_controllers_for_collective_transport_by_multi-robot_systems","280575788_Ant_groups_optimally_amplify_the_effect_of_transiently_informed_individuals","314601010_Multi-robot_Manipulation_Without_Communication","309480185_Decentralized_Algorithm_for_Force_Distribution_With_Applications_to_Cooperative_Transport","304410999_Multi-robot_manipulation_with_no_communication_using_only_local_measurements","292215410_Consensus_problems_in_networks_of_agents_with_switching_topology_and_time-delays","283549583_AVERT_An_autonomous_multi-robot_system_for_vehicle_extraction_and_transportation"]}