{"id":"308718183_Business_Process_and_Information_Technology_Alignment_Construct_Conceptualization_Empirical_Illustration_and_Directions_for_Future_Research","abstract":"Since strategic alignment first rose to prominence with Henderson and Venkatraman's (1993) seminal paper, research has tended to focus on the extent of fit between IT and business strategy at the firm level. Although useful, a firm-level view of alignment could mask what firms are doing to realize intellectual alignment between business and IT strategy and whether their actions will likely succeed. In this study, we build on an emergent stream of research that considers alignment between IT and business strategy at the process level. Since research tends to view this form of alignment through the lens of IT support for business strategy, this perspective fails to account for how IT can enable the development of new business strategies. Accordingly, we conceptualize alignment between IT and business strategy at the process level using the lens of IT shortfall (a lack of IT support for business activities) and IT slack (having more IT than needed to support current business activities). Using data from matched surveys of IT and business executives at 317 U.S. and E.U. firms, we illustrate the value of this conceptualization and its process measures. Our results show that IT shortfall is negatively correlated with IT business value, while IT slack is positively correlated with IT business value. We further note that the existence of IT shortfall and IT slack depends on differences in firms' chosen business strategy and whether a process is critical or non-critical to that strategy's success.","authors":["Paul Tallon","Magno Queiroz","Tim Coltman","Rajeev Sharma"],"meta":["October 2016Journal of the Association for Information Systems 17(9):563-589","DOI:10.17705/1jais.00438"],"references":["311766005_The_Partial_Least_Squares_Approach_to_Structural_Equation_Modeling","324995746_Is_Slack_Good_or_Bad_for_Innovation","313604424_Evaluating_Structural_Equation_Models_with_Unobservable_Variables_and_Measurement_Error","312551435_Shaping_agility_through_digital_options_Reconceptualizing_the_role_of_information_technology_in_contemporary_firms","309254394_Psychometric_Theory","303580367_Dynamic_capabilities_and_strategic_management","303262420_Porter's_1980_Generic_Strategies_as_Determinants_of_Strategic_Group_Membership_and_Organizational_Performance","302561367_The_Concept_of_Fit_in_Strategy_Research_Toward_Verbal_and_Statistical_Correspondence","279986496_Configuring_Value_for_Competitive_Advantage_On_Chains_Shops_and_Networks","279796507_Common_Method_Biases_in_Behavioral_Research_A_Critical_Review_of_the_Literature_and_Recommended_Remedies"]}