{"id":"308746608_Design_of_Power-Efficient_Approximate_Multipliers_for_Approximate_Artificial_Neural_Networks","abstract":"Artificial neural networks (NN) have shown a significant promise in difficult tasks like image classification or speech recognition. Even well-optimized hardware implementations of digital NNs show significant power consumption. It is mainly due to non-uniform pipeline structures and inherent redundancy of numerous arithmetic operations that have to be performed to produce each single output vector. This paper provides a methodology for the design of well-optimized power-efficient NNs with a uniform structure suitable for hardware implementation. An error resilience analysis was performed in order to determine key constraints for the design of approximate multipliers that are employed in the resulting structure of NN. By means of a search based approximation method, approximate multipliers showing desired tradeoffs between the accuracy and implementation cost were created. Resulting approximate NNs, containing the approximate multipliers, were evaluated using standard benchmarks (MNIST dataset) and a real-world classification problem of Street-View House Numbers. Significant improvement in power efficiency was obtained in both cases with respect to regular NNs. In some cases, 91% power reduction of multiplication led to classification accuracy degradation of less than 2.80%. Moreover, the paper showed the capability of the back propagation learning algorithm to adapt with NNs containing the approximate multipliers.","authors":["Vojtech Mrazek","Syed Shakib Sarwar","Lukas Sekanina","Zdenek Vasicek"],"meta":["November 2016","DOI:10.1145/2966986.2967021","Conference: 2016 IEEE / ACM International Conference On Computer Aided Design (ICCAD'16)At: Austin, TX"],"references":["290194892_A_Survey_Of_Techniques_for_Approximate_Computing","284219754_Reduced-Precision_Strategies_for_Bounded_Memory_in_Deep_Neural_Nets","277562056_Evolutionary_Approach_to_Approximate_Digital_Circuits_Design","319770420_Semantic_Image_Segmentation_with_Deep_Convolutional_Nets_and_Fully_Connected_CRFs","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","301842974_Multiplier-less_Artificial_Neurons_Exploiting_Error_Resiliency_for_Energy-Efficient_Neural_Computing","301841158_Significance_Driven_Hybrid_8T-6T_SRAM_for_Energy-Efficient_Synaptic_Storage_in_Artificial_Neural_Networks","299670592_Cartesian_Genetic_Programming_on_the_GPU","289636954_Artificial_Neural_Network","284917389_ApproxANN_An_Approximate_Computing_Framework_for_Artificial_Neural_Network"]}