{"id":"308791131_A_Comparative_Study_of_Software_Inspection_Techniques_for_Quality_Perspective","abstract":"Software inspection is useful to detect the defects in any stage software development methodology especially in early stages. Inspection of software defects can improve the software product quality by decreasing rework cost and time from documents, code, and other deliverables. The objective of this study is to identify existing software inspection techniques which help practitioners and software engineers to improve the software quality and to compare them according to some quality attributes. Rather than proposing new techniques we focus on synthesize the existing approaches. A comparison of some approaches is conducted and analyzed which approach is more feasible for the detection of defects. The results of this study show that there are many formal and informal techniques available in literature related software inspection, it is difficult to say well to one of them, but our analysis focused on finding such techniques which cover maximum quality factors in an inspection. Software inspection is an umbrella activity of whole software development life cycle and we found different approaches and frameworks in software inspection which can full fill our desired parameters to improve software quality.","authors":["Asad Masood Qazi","Sidra Shahzadi","Mamoona Humayun"],"meta":["October 2016","DOI:10.5815/ijmecs.2016.10.02","Project: Software Testing Techniques"],"references":["274393679_Software_Inspection_in_Software_Industry-Pakistans_Perspective","260225759_Analyzing_the_Relationships_between_Inspections_and_Testing_to_Provide_a_Software_Testing_Focus","302373194_Introduction_to_Software_Quality","300705468_Software_Inspections_Capability_Maturity_Model_Integration","288146045_Software_Defects_Stay_Away_from_Them_Do_Inspections","284543783_Software_Engineering_Economics","262287628_Robust_and_Flexible_Software_Inspection_model_for_Software_Re-Engineering_Process_Abstraction_phase","261272915_A_Scenario-Based_Model_to_Improve_the_Quality_of_Software_Inspection_Process","261037688_Improving_Software_Quality_Using_a_Defect_Management-Oriented_DEMAO_Software_Inspection_Model","256991954_Evidence_of_software_inspection_on_feature_specification_for_software_product_lines"]}