{"id":"308855598_A_Bayesian_Approach_for_Selective_Image-Based_Rendering_Using_Superpixels","abstract":"Image-Based Rendering (IBR) algorithms generate high quality photo-realistic imagery without the burden of detailed modeling and expensive realistic rendering. Recent methods have different strengths and weaknesses, depending on 3D reconstruction quality and scene content. Each algorithm operates with a set of hypotheses about the scene and the novel views, resulting in different quality/speed trade-offs in different image regions. We present a principled approach to select the algorithm with the best quality/speed trade-off in each region. To do this, we propose a Bayesian approach, modeling the rendering quality, the rendering process and the validity of the assumptions of each algorithm. We then choose the algorithm to use with Maximum a Posteriori estimation. We demonstrate the utility of our approach on recent IBR algorithms which use over segmentation and are based on planar reprojection and shape-preserving warps respectively. Our algorithm selects the best rendering algorithm for each super pixel in a preprocessing step, at runtime our selective IBR uses this choice to achieve significant speedup at equivalent or better quality compared to previous algorithms.","authors":["Rodrigo Ortiz Cayon","Abdelaziz Djelouah","George Drettakis"],"meta":["October 2015","DOI:10.1109/3DV.2015.59","Conference: 2015 International Conference on 3D Vision (3DV)"],"references":["262354511_Depth_Synthesis_and_Local_Warps_for_Plausible_Image-Based_Navigation","262322286_Bayesian_View_Synthesis_and_Image-Based_Rendering_Principles","319770714_Photo_tourism_Exploring_photo_collections_in_3D","314734001_Ambient_point_clouds_for_view_interpolation","286683959_Fast_Approximate_Piecewise-Planar_Modeling_Based_on_Sparse_Structure-from-Motion_and_Superpixels","280940018_Pattern_Recognition_and_Machine_Learning","263338773_Silhouette-Aware_Warping_for_Image-Based_Rendering","262771911_Correspondence_and_Depth-Image_Based_Rendering_a_Hybrid_Approach_for_Free-Viewpoint_Video","262282605_Image-Based_Rendering_in_the_Gradient_Domain","261447449_Towards_Linear-Time_Incremental_Structure_from_Motion"]}