{"id":"308887990_THE_JOURNAL_OF_TEACHING_ENGLISH_FOR_SPECIFIC_AND_ACADEMIC_PURPOSES_THE_URGENT_EDUCATIONAL_SHIFT_FROM_GENERAL_ELT_TO_ESP_A_FOLLOW-UP_REACTION_TO_GLOBALIZATION_DYNAMICS_IN_ALBANIA","abstract":"English has indisputably been accredited as the Lingua Franca of conducting almost every human activity of political, economic, diplomatic, commercial, educational and cultural aspect. It is not in vacuum that English teaching has gained recognition and research interest since successful English language acquisition is directly dependent on the quality of English teaching programs designed by English Departments at Foreign Languages Faculties. Among other post-communist transitional societies, Albania has encountered the immediate need for qualified English teachers to accelerate the efficient teaching –learning process. As a follow-up measure this issue has resulted into critical reconsiderations of English Language departments at public universities as the major responsible actors to prepare qualified English teachers. However, despite reflections and investigations, I argue that the focus of such English university programs is mainly on the Teaching of General English instead of giving an emphatic priority to tailored track of English for Specific Purposes. I believe that the accelerating rhythm of globalization processes in its comprehensive spectrums – economic, political, educational, socio-cultural domains-calls for qualified ESP teachers equipped with the relevant knowledge to design and offer tailored ESP courses at university studies; the latter will be a key factor to helping learners acquire English mastery that better matches the competitive demands of international and global market pressures. The article shall not be limited only to identifying the gap between current university programs in Albania and the expectations stemming from globalization/regional transformational perspectives; instead, it will provide feasible recommendations towards equal accentuation of ESP versus the conventional ELT which by now holds the linguistic supremacy.","authors":["Mirela Dubali Alhasani"],"meta":["October 2016"],"references":["281345731_The_ESP_Teacher_Issues_Tasks_and_Challenges","23754863_FDI_Revisited_Empirical_Evidence_from_Transition_Economies_-_Case_of_Albania","310617997_Developing_Courses_in_English_for_Specific_Purposes","287475698_Ideas_and_Options_in_English_for_Specific_Purposes","28185068_Genre_analysis_A_key_to_a_theory_of_ESP"]}