{"id":"308828809_Brain_tumor_diagnosis_from_MRI_feature_analysis_-_A_comparative_study","abstract":"Brain tumors are due to abnormal growth of tissue in the brain. Magnetic resonance imaging (MRI) is currently an indispensable diagnostic imaging technique for the early detection of any abnormal changes in tissues and organs. Brain tumors are the most aggressive and devastating types of cancer and therefore, its correct identification at an early stage followed by treatment is its only cure. In this project, a comparative study of transform techniques namely Discrete Cosine Transform (DCT), Discrete Wavelet Transform (DWT) each separately combined with the Probabilistic Neural Network (PNN) is used for the classification of brain tumor. The system consists of three stages for the diagnosis of brain tumor. In the first stage, MR image is obtained and preprocessing is done to remove the noise and sharpen the image. In the second stage, DCT and DWT is used for feature extraction. In the third stage, Probabilistic Neural Network with Radial Basis Function distinguishes brains abnormality. Finally the performance of DCT and DWT in diagnosing the brain tumor is compared using the parameters such as sensitivity rate and precision rate.","authors":["Shobana G","Ranjith Balakrishnan"],"meta":["March 2015","DOI:10.1109/ICIIECS.2015.7193137","Conference: 2015 International Conference on Innovations in Information,Embedded and Communication Systems (ICIIECS)"],"references":["261348925_Graph-based_Detection_Segmentation_Characterization_of_Brain_Tumors","252022435_Image_classification_of_brain_MRI_using_support_vector_machine","220181138_Statistical_Pattern_Recognition_A_Review","297968545_Handbook_of_Medical_Image_Processing_and_Analysis","286756405_Pattern_Recognition_Neuroradiology","261418667_Image_classification_of_brain_MRI_using_support_vector_machine","225304623_Inroduction_to_Statistical_Pattern_Recognition","224224619_Probabilistic_Neural_Network_for_Brain_Tumor_Classification","220360902_Probabilistic_Neural_Networks_Neural_Networks_3109-118","7801364_High-Speed_Face_Recognition_Based_on_Discrete_Cosine_Transform_and_RBF_Neural_Networks","5793717_Improving_brain_tumor_characterization_on_MRI_by_probabilistic_neural_networks_on_non-linear_transformation_of_textural_features","3545260_Probabilistic_Neural_Networks_for_Classification_Mapping_or_Associative_Memory"]}