{"id":"308862099_An_enhanced_GPSR_routing_protocol_based_on_the_buffer_length_of_nodes_for_the_congestion_problem_in_VANETs","abstract":"Vehicular ad hoc networks technology is an important part of intelligent transportation system which has wide developmental and applied prospect. The routing protocol is a key technology of vehicular ad hoc networks and largely determines the performance of the vehicle network communication system. Vehicular ad hoc networks (VANETs) makes great requests to routing protocol due to several reasons: firstly, vehicle nodes moving into tubular mobile states which are limited in road. Then, nodes moves fast, network topology changes frequently, the relationship among nodes becomes unstable. Aiming at the network congestion problem exists in commonly used GPSR routing protocols of current vehicular ad hoc networks, this paper proposed an improved project of GPSR routing protocol which controls network congestion based on the buffer of nodes. Performance simulation for relevant parameters is tested on platform NS2. From the results of the analysis, the enhanced GPSR protocol in vehicle's environment has lower packet loss rate and less time delay than the traditional GPSR protocol.","authors":["Tianli Hu","Minghui Liwang","Lianfen Huang","Yuliang Tang"],"meta":["July 2015","DOI:10.1109/ICCSE.2015.7250281","Conference: 2015 10th International Conference on Computer Science & Education (ICCSE)"],"references":["37453668_TraNS_Realistic_joint_traffic_and_network_simulator_for_VANETs","321804086_Energy_Efficient_Routing_Algorithm_for_Wireless_Sensor_Networks_Supporting_Mobile_Sinks","264981529_A_survey_on_congestion_control_for_delay_and_disruption_tolerant_networks","224683711_A_Scalable_Quorum_Based_Location_Service_in_Ad_Hoc_and_Sensor_Networks","216545987_A_Set_of_Typical_Transport_Network_Scenarios_for_Network_Modelling","4310517_A_cross-layered_MAC_and_clustering_scheme_for_efficient_broadcast_in_VANETs","2327596_GPSR_Greedy_Perimeter_Stateless_Routing_for_Wireless_Networks"]}