{"id":"308870999_Advancing_research_on_engineering_design_using_e-Journal","abstract":"The potential of typical, handwritten engineering design journals to advance knowledge in engineering education is diminished by technical issues (e.g., readability and interpretability), writing lens (i.e., focus on the result not the process), and the ‘freshness’ of the events recorded. The authors argue that utilization of a novel online electronic-Journal (e-Journal) can overcome these challenges and open a new avenue to learn about students' self-regulation within the context of engineering design. Work is underway to develop a system fulfilling this need. The resulting e-Journal is designed concordant with the engineering design phases: Problem Definition, Conceptual Design, Preliminary Design, Detailed Design, and Design Communication. The e-Journal enables the act of going back and forth between phases to support the iterative nature of engineering design. The online nature of this e-Journal ensures data currency because students can report their activities concurrently with design activities or at their convenience. Analyzing rich recorded data will enable researchers to learn about student's activities in areas such as task interpretation, project planning and execution, monitoring efforts and design goals, and management of resources, time and teamwork as individuals and teams. Additional work will focus on the way the e-Journal is utilized within a two-part mechanical engineering capstone course and will analyze the obtained results after both parts conclude.","authors":["Andreas Febrian","Oenardi Lawanto","Matthew Cromwell"],"meta":["October 2015","DOI:10.1109/FIE.2015.7344191","Conference: 2015 IEEE Frontiers in Education Conference (FIE)"],"references":["318642508_Pattern_of_Task_Interpretation_and_Self-Regulated_Learning_Strategies_of_High_School_Students_and_College_Freshmen_during_an_Engineering_Design_Project","289336755_Task_Interpretation_Cognitive_and_Metacognitive_Strategies_of_Higher_and_Lower_Performers_in_an_Engineering_Design_Project_An_Exploratory_Study_of_College_Freshmen","265084438_Work_Breakdown_Structure_of_the_Project","259716696_Common_Elements_of_Capstone_Projects_in_the_World's_Top-ranked_Engineering_Universities","259330269_The_Debugger_a_programmer's_best_friend","239969203_Engineering_Design_A_Project-Based_Introduction","239030345_Engineering_Design-A_Synthesis_of_Views","233020373_An_Integrative_Undergraduate_Capstone_Course_on_the_Unconscious","26598106_The_relationship_between_goals_metacognition_and_academic_success"]}