{"id":"308825749_Bi-directional_signaling_strategies_for_dynamic_TDD_networks","abstract":"This paper investigates several bi-directional signaling strategies to facilitate decentralized beamformer design in a dynamic time division duplexing (TDD) system. A small-cell network with multi-antenna base stations and user terminals is considered, where the cells are operating either in uplink or downlink mode depending on the instantaneous traffic demand. Decentralized beamformer design is proposed to maximize the weighted sum rate of the network subjected to individual power constraints at BSs and user terminals. The weighted sum mean-squared error (MSE) minimization framework is used to decouple the optimization problem across the nodes, which enables decentralized iterative solution. Iterative algorithms are proposed with the different bi-directional signaling schemes embedded into the TDD frame structure. A detailed signaling flow of exchanging beamformer and channel information is described for each bi-directional signaling strategy. The proposed strategies are compared with the uncoordinated system while taking into account the signaling overhead.","authors":["Praneeth Jayasinghe","Antti Tölli","Matti Latva-aho"],"meta":["June 2015","DOI:10.1109/SPAWC.2015.7227096","Conference: 2015 IEEE 16th International Workshop on Signal Processing Advances in Wireless Communications (SPAWC)"],"references":["224359784_Weighted_sum-rate_maximization_using_weighted_MMSE_for_MIMO-BC_beamforming_design","3434055_Analysis_of_TDD_Cellular_Interference_Mitigation_Using_Busy-Bursts","285430129_Bi-directional_signaling_for_dynamic_TDD_with_decentralized_beamforming","264574682_Bi-Directional_Training_for_Adaptive_Beamforming_and_Power_Control_in_Interference_Networks","260670410_Trends_in_small_cell_enhancements_in_LTE_advanced","258794306_Effective_CSI_signaling_and_decentralized_beam_coordination_in_TDD_multi-cell_MIMO_systems","220735171_An_Iteratively_Weighted_MMSE_Approach_to_Distributed_Sum-Utility_Maximization_for_a_MIMO_Interfering_Broadcast_Channel","220129814_Comparison_of_decentralized_time_slot_allocation_strategies_for_asymmetric_traffic_in_TDD_systems"]}