{"id":"308841729_Decentralized_broadcast-based_scheduling_for_dense_multi-hop_TSCH_networks","abstract":"Wireless Sensor Networks (WSNs) are becoming more and more popular to support a wide range of Internet of Things (IoT) applications. Time-Slotted Channel Hopping (TSCH) is a technique to enable ultra reliable and ultra low-power wireless multi-hop networks. TSCH consist of a channel hopping scheme for sending link-layer frames in different time slots and frequencies in order to efficiently combat external interference and multi-path fading. The keystone of TSCH is the scheduling algorithm, which determines for every node at which opportunity (a combination of time slots and channels) it is allowed to send. However, current scheduling algorithms are not suited for dense deployments and have important scalability limitations. In this paper, we investigate TSCH's scheduling performance in dense deployments and show how the scheduling can be improved for such environments. We performed an extensive analysis of the scalability for different scheduling approaches showing the performance drops as the number of nodes increases. Moreover, we propose a novel De centralized Br oadcast-based S cheduling algorithm called DeBraS, based on selective broadcasting to inform nodes about each other's schedule. Through extensive simulations, we show that DeBraS is highly more scalable than centralized solutions and that it outperforms the current decentralized 6Tisch algorithms in up to 88.5% in terms of throughput for large network sizes.","authors":["Esteban Municio","Steven Latré"],"meta":["October 2016","DOI:10.1145/2980137.2980143","Conference: the Workshop"],"references":["304285486_Lessons_Learned_from_Large-scale_Dense_IEEE802154_Connectivity_Traces","281966008_Decentralized_Traffic_Aware_Scheduling_in_6TiSCH_Networks_Design_and_Experimental_Evaluation","280102169_Orchestra_Robust_Mesh_Networks_Through_Autonomously_Scheduled_TSCH","242653458_D-MSR_A_Distributed_Network_Management_Scheme_for_Real-Time_Monitoring_and_Process_Control_Applications_in_Wireless_Industrial_Automation","306062272_LLSF_Low_Latency_Scheduling_Function_for_6TiSCH_Networks","298712921_Distributed_PID-based_Scheduling_for_6TiSCH_Networks","283010947_A_queue-based_scheduling_algorithm_for_PCE-enabled_Industrial_Internet_of_Things_networks","281966049_On-the-Fly_Bandwidth_Reservation_for_6TiSCH_Wireless_Industrial_Networks","273397558_6TiSCH_deterministic_IP-enabled_industrial_Internet_of_Things","264615221_Label_switching_over_IEEE802154e_networks"]}