{"id":"308817206_Sonification_of_3D_body_movement_using_parameter_mapping_technique","abstract":"Most of instructions by trainers or therapists in body movements, such as walking, turning, rising arms or legs are mostly done through voice instructions or touches. This does not have much problem to normal people as they can see it at the same time. To follow these instructions without seeing it can cause confusion in terms of actions and directions. Unfortunately, there is no other option for people who are blind. Thus, this research will try to replace those voice and touches form of instructions into non-speech sound instructions. The method involves transforming 3-dimensional data of body movements (kinematics) into sounds. It is hoped by only listening to the sounds, a person should be able to follow the exact movements of the body of another person or instructor without any voice commands or instructions. The novel contribution of this research is to produce an effective and efficient sonification technique (converting the data into sound) to represent the actions and directions of the body movements in 3-dimensional space. The conversion approach to be used is Parameter Mapping, where the movement properties will be mapped to sound properties. The parameter mapping will involve at least 3 transformation processes - data, acoustics parameters and sound representations. The effectiveness and efficiency of this approach is depending on all of these transformation processes. This research will use Kinect (a device used to play game with Microsoft Xbox game console) as the live 3D movements input data stream. This device is intentionally used in this research, as it is readily available and cheap. Thus, the potential applications or products from this research later on can also use this device.","authors":["Ag Asri Ag Ibrahim","Alter Jimat Embug"],"meta":["November 2014","DOI:10.1109/ICIMU.2014.7066664","Conference: 2014 International Conference on Information Technology and Multimedia (ICIMU)"],"references":["303558586_The_sonification_of_EMG_data","302560118_Parameter_mapping_sonification","259308580_Evolution_of_Interactive_Audiobooks","255459522_Authoring_of_3D_virtual_auditory_Environments","242506719_Sonification_report_status_of_the_field_and_research_agenda_1997","228959879_TaDa_demonstrations_of_auditory_information_design","221494035_PhysioSonic_-_Evaluated_Movement_Sonification_as_Auditory_Feedback_in_Physiotherapy","221274400_Interactive_Audiobooks_Combining_Narratives_with_Game_Elements","221274178_Marketbuzz_Sonification_of_Real-Time_Financial_Data","221274168_A_Toolkit_for_Interactive_Sonification","221217529_Playing_Audio-only_Games_A_compendium_of_interacting_with_virtual_auditory_Worlds","317823554_CAITLIN_Implementation_of_a_Musical_Program_Auralisation_System_to_Study_the_Effects_on_Debugging_Tasks_as_Performed_by_Novice_Pascal_Programmers","270818609_Audification","265160217_Semiotics_for_Beginners","263964268_Auditory_Display_Sonification_Audification_and_Auditory_Interfaces","261643280_Constraints_on_the_search_for_visual_information_in_sport","246673425_Leaving_The_Screen-New_Perspectives_In_Audio-Only_Gaming","234829968_Presenting_information_in_sound","232615198_Reliability_of_Usability_Inspection_for_Sonification_Applications","222142100_Interactive_sonification_of_complex_data"]}