{"id":"308816061_Assessment_of_a_cooperative_training_course_using_faculty_course_assessment_report_in_an_ABET_accredited_engineering_technology_program","abstract":"The electrical and electronics engineering technology (EEET) associate degree program at Hafr Al-Batin Community College (HBCC) located in the Kingdom of Saudi Arabia (KSA) got accredited recently by the engineering technology accreditation commission (ETAC) of ABET. In this paper, we have described in detail our experiences of using the faculty course assessment report (FCAR) methodology for the direct and indirect assessment of both course learning outcomes (CLO's) and ABET student outcomes (SO's) supported by the cooperative (coop) training (EEET 290) course in the EEET unit at HBCC. Furthermore, the paper demonstrates how the student's evaluation by his supervisor is also taken into account while assessing both the EEET 290 CLO's and its respective ABET SO's using the FCAR tool. In addition, we have also analyzed the student's self-evaluation of his co-op training experience. Moreover, we have also compared the co-op training given to our students by Saudi Aramco, Saudi Electricity Company (SEC), and Saudi Telecom Company (STC). In this comparison, we have highlighted some strengths and weaknesses of the co-op training offered by these companies. Finally, the results of our analysis are used to propose actions for the continuous improvement of co-op training course in the EEET program at HBCC.","authors":["Mohammed Mujahid Ulla Faiz","Mubarak Saad Al-Mutairi"],"meta":["October 2015","DOI:10.1109/FIE.2015.7344403","Conference: 2015 IEEE Frontiers in Education Conference (FIE)"],"references":["308854356_Using_faculty_course_assessment_report_for_the_assessment_of_an_associate_degree_course_in_engineering_technology_program","344833373_Improving_Upon_Best_Practices_FCAR_20","281033975_Using_faculty_course_assessment_report_for_the_assessment_of_an_associate_degree_course_in_engineering_technology_program","247506237_Field_supervisors'_assessments_of_trainee_performance_Are_they_reliable_and_valid"]}