{"id":"308840675_GK-12_DISSECT_Incorporating_computational_thinking_with_K-12_science_without_computer_access","abstract":"Computational Thinking (CT) introduces computing concepts and demonstrates their usefulness in many other disciplines. CT principles such as algorithmic problem solving, abstraction, modeling and simulation, are integrated into existing STEM (Science, Technology, Engineering, Mathematics) curricula by DISSECT (DIScover SciEnce through Computational Thinking). By pairing a local K-12 teacher with a graduate fellow, DISSECT provides instruction and resources as instruments that are pertinent to each specific discipline. These skills in problem-solving and abstract reasoning are necessary for students to be able to compete in the modern and future job markets. DISSECT works to provide these skill-sets to students and classrooms that lack access to computers. The K-12 teachers and graduate fellows work together to develop modules that are capable of teaching CT concepts that are directly tied to their current curriculum while removing the need for access to computer systems. This paper will focus on the modules developed and executed in middle and high school classrooms, emphasizing the creative ways explored to operate in a computer-free environment discussing the strengths and weaknesses of different approaches, while qualitatively assessing student engagement, learning, and interaction which is gathered through teacher interviews, observations and informal talks with students.","authors":["R. Folk","Gregory Lee","Ashley Michalenko","Amanda Peel"],"meta":["October 2015","DOI:10.1109/FIE.2015.7344238","Conference: 2015 IEEE Frontiers in Education Conference (FIE)"],"references":["262350755_Computational_Thinking_in_Elementary_and_Secondary_Teacher_Education","259151640_Introducing_Discipline-Based_Computing_in_Undergraduate_Engineering_Education","343364402_Running_on_Empty_the_Failure_to_Teach_K--12_Computer_Science_in_the_Digital_Age","313123027_Computer_Science_and_Crime","279941252_Seven_essentials_for_project-based_learning"]}