{"id":"308810519_Density_Peaks_Clustering_Approach_for_Discovering_Demand_Hot_Spots_in_City-scale_Taxi_Fleet_Dataset","abstract":"In this paper, we introduce a variant of the density peaks clustering (DPC) approach for discovering demand hot spots from a low-frequency, low-quality taxi fleet operational dataset. From the literature, the DPC approach mainly uses density peaks as features to discover potential cluster centers, and this requires distances between all pairs of data points to be calculated. This implies that the DPC approach can only be applied to cases with relatively small numbers of data points. For the domain of urban taxi operations that we are interested in, we could have millions of demand points per day, and calculating all-pair distances between all demand points would be practically impossible, thus making DPC approach not applicable. To address this issue, we project all points to a density image and execute our variant of the DPC algorithm on the processed image. Experiment results show that our proposed DPC variant could get similar results as original DPC, yet with much shorter execution time and lower memory consumption. By running our DPC variant on a real-world dataset collected in Singapore, we show that there are indeed recurrent demand hot spots within the central business district that are not covered by the current taxi stand design. Our approach could be of use to both taxi fleet operator and traffic planners in guiding drivers and setting up taxi stands.","authors":["Dongchang Liu","Shih-Fen Cheng","Yiping Yang"],"meta":["September 2015","DOI:10.1109/ITSC.2015.297","Conference: 2015 IEEE 18th International Conference on Intelligent Transportation Systems - (ITSC 2015)"],"references":["228570535_Cluster_detection_in_point_event_data_having_tendency_towards_spatially_repetitive_events","224612162_A_Service_Choice_Model_for_Optimizing_Taxi_Service_Delivery","224378038_Image_Analysis_Using_Mathematical_Morphology","3297085_CLARANS_A_method_for_clustering_objects_for_spatial_data_mining","302937305_A_Threshold_Selection_Method_from_Gray-Level_Histogram","263476029_Machine_learning_Clustering_by_fast_search_and_find_of_density_peaks","225248456_Density-Based_Clustering_in_Spatial_Databases_The_Algorithm_GDBSCAN_and_Its_Applications","225246411_Mining_GPS_Traces_for_Map_Refinement","224258934_T-Drive_Enhancing_Driving_Directions_with_Taxi_Drivers'_Intelligence","223624491_CURE_An_efficient_clustering_algorithm_for_large_databases","221589412_Efficient_detection_of_motion_patterns_in_spatio-temporal_data_sets","3192442_Mean_Shift_Mode_Seeking_and_Clustering"]}