{"id":"308868573_Sustainability_Design_and_Software_The_Karlskrona_Manifesto","abstract":"Sustainability has emerged as a broad concern for society. Many engineering disciplines have been grappling with challenges in how we sustain technical, social and ecological systems. In the software engineering community, for example, maintainability has been a concern for a long time. But too often, these issues are treated in isolation from one another. Misperceptions among practitioners and research communities persist, rooted in a lack of coherent understanding of sustain- ability, and how it relates to software systems research and practice. This article presents a cross-disciplinary initiative to create a common ground and a point of reference for the global community of research and practice in software and sustainability, to be used for effectively communicating key issues, goals, values and principles of sustainability design for software-intensive systems. The centrepiece of this effort is the Karlskrona Manifesto for Sustainability Design, a vehicle for a much needed conversation about sustainability within and beyond the software community, and an articulation of the fundamental principles underpinning design choices that affect sustainability. We describe the motivation for developing this manifesto, including some considerations of the genre of the manifesto as well as the dynamics of its creation. We illustrate the collaborative reflective writing process and present the current edition of the manifesto itself. We assess immediate implications and applications of the articulated principles, compare these to current practice, and suggest future steps.","authors":["Christoph Becker","Ruzanna Chitchyan","Leticia Duboc","Steve Easterbrook"],"meta":["May 2015","DOI:10.1109/ICSE.2015.179","Conference: 2015 IEEE/ACM 37th IEEE International Conference on Software Engineering (ICSE)","Project: Sustainability Design"],"references":["346923480_Managing_for_Sustainable_Development_Impact","313185376_Sustainability_and_longevity_Two_sides_of_the_same_quality","303617265_Software_Sustainability_The_Modern_Tower_of_Babel","287435274_From_Computational_Thinking_to_Systems_Thinking_A_conceptual_toolkit_for_sustainability_computing","309900872_Sustainability_guidelines_for_long-living_software_systems","309282726_Sustainability_Human_Social_Economic_and_Environmental","303964178_Engineering_and_Sustainable_Development","298104786_Enter_the_triple_bottom_line","291082630_Poetry_of_the_Revolution_Marx_Manifestos_and_the_Avant-Gardes","288648360_Infusing_green_Requirements_engineering_for_green_in_and_through_software_systems"]}