{"id":"308836584_Teaching_research_and_practice_of_blended_leaning_model_based_on_computational_thinking","abstract":"With the wide use of computers, how to make students understand the special way of thinking of computer science and find the appropriate methods to solve problems in their own fields like computer scientists are the challenges for educators. This paper proposed a computational thinking model based on blended learning M ctbbl and a descending dimension method for problem-space transformation. The M ctbbl model analyzes and researches the application of computational thinking in computer science by the organic combination of computational thinking and blended learning in a life-cycle perspective. On one hand, the model can summarize the core concepts and important principles in computer science and extract the typical thoughts and general methods of solving problems; on the other hand, the model can implement the teaching and learning of computational thinking by means of blended learning. Based on the model, the teachers can teach the problem-solving process by using computer more intuitively and clearly and the students can understand the application of computer knowledge more easily and simply. The Mctbbl prolongs the study life cycle which takes preview as beginning, teacher-student discussion as body and practical application as core to ensure integrity, endurance and consistency of teaching.","authors":["Ying Li","Yu Liu","Pan Shu"],"meta":["October 2015","DOI:10.1109/FIE.2015.7344415","Conference: 2015 IEEE Frontiers in Education Conference (FIE)"],"references":["274377900_Computational_Thinking","261485132_Keynote_On_abstract_intelligence_and_brain_informatics_Mapping_the_cognitive_functions_onto_the_neural_architectures","23142610_Computational_thinking_and_thinking_about_computing","4336467_Computational_thinking_and_thinking_about_computing","277753519_Stories_Models_and_Examples_from_the_Upcoming_Handbook_of_Blended_Learning_Global_Perspectives_Local_Designs_Part_2","261458105_Improving_learning_of_computational_thinking_using_creative_thinking_exercises_in_CS-1_computer_science_courses","224362165_Managing_Quality_Improvement_of_Learning_in_a_Campus-Based_University_Actions_for_Blending_Monitoring_and_Tutoring_Traditional_Learning_Activities","224318872_A_Blended_Learning_Approach_to_Course_Design_and_Implementation","224206968_Integrating_Mathematical_Thinking_Abstract_Thinking_and_Computational_Thinking","221414933_Unifying_Study_on_Human_and_Web_Problem_Solving_A_Brain_Informatics_Perspective"]}