{"id":"308809892_Virtual_Network_Functions_Placement_and_Routing_Optimization","abstract":"Network Functions Virtualization (NFV) is incrementally deployed by Internet Service Providers (ISPs) in their carrier networks, by means of Virtual Network Function (VNF) chains, to address customers' demands. The motivation is the increasing manageability, reliability and performance of NFV systems, the gains in energy and space granted by virtualization, at a cost that becomes competitive with respect to legacy physical network function nodes.\nFrom a network optimization perspective, the routing of VNF chains across a carrier network implies key novelties making the VNF chain routing problem unique with respect to the state of the art: the bitrate of each demand flow can change along a VNF chain, the VNF processing latency and computing load can be a function of the demands traffic, VNFs can be shared among demands, etc. In this paper, we provide an NFV network model suitable for ISP operations. We define the generic VNF chain routing optimization problem and devise a mixed integer linear programming formulation. By extensive simulation on realistic ISP topologies, we draw conclusions on the trade-offs achievable between legacy Traffic Engineering (TE) ISP goals and novel combined TE-NFV goals.","authors":["Bernardetta Addis","Dallal Belabed","Mathieu Bouet","Stefano Secci"],"meta":["October 2015","DOI:10.1109/CloudNet.2015.7335301","Conference: 2015 IEEE 4th International Conference on Cloud Networking (CloudNet)"],"references":["309901007_VNF-P_A_model_for_efficient_placement_of_virtualized_network_functions","308835263_Cost-based_placement_of_vDPI_functions_in_NFV_infrastructures","268800292_VNF-P_A_Model_for_Efficient_Placement_of_Virtualized_Network_Functions","312551439_Design_and_evaluation_of_algorithms_for_mapping_and_scheduling_of_virtual_network_functions","312368663_A_novel_approach_to_virtual_networks_embedding_for_SDN_management_and_orchestration","278300102_Cost-based_placement_of_vDPI_functions_in_NFV_infrastructures","272590519_Network_Function_Placement_for_NFV_Chaining_in_PacketOptical_Datacenters","262877871_Specifying_and_Placing_Chains_of_Virtual_Network_Functions"]}