{"id":"308839285_A_novel_design_of_management_senior_project_for_engineering_students","abstract":"The senior project course for engineering students has a vital role in enhancing the “learn by practice” education engineering students in any university. The senior project course is, usually, a two semester course. This short time frame, poses challenges for both students and faculty. Students have to achieve the outcomes of the project to a certain extent and the faculty has to manage, follow up and evaluate efficiently the work of their students individually and by group. One common problem in senior project is the missing of the control during the visit of the students to a company for project preparation purpose. In this paper, we propose a new and efficient design of follow up for faculty to manage properly and evaluate effectively the individual progress of the students during the preparation of their senior projects and to avoid “free riders” situation. Our idea is based on the mobile technology to track the students' progress, meeting, and visiting industry and so on. The proposed idea is helpful to avoid free-riding students also provides instructors with solid evidence of the student progress.","authors":["Seifedine Kadry"],"meta":["March 2015","DOI:10.1109/EDUCON.2015.7096065","Conference: 2015 IEEE Global Engineering Education Conference (EDUCON)"],"references":["255589097_INTEGRATING_STUDENT_GROUPWORK_RATINGS_INTO_STUDENT_COURSE_GRADES","250343297_Peer_Assessment_A_Complementary_Instrument_to_Recognise_Individual_Contributions_in_IS_Student_Group_Projects","247753226_Social_Loafing_on_Group_ProjectsStructural_Antecedents_and_Effect_on_Student_Satisfaction","262209123_An_Assessment_model_for_large_project_courses","254462721_Capstone_project_Fair_just_and_accountable_assessment","248965970_Peer_Assessment_of_Contributions_to_a_Group_Project_A_comparison_of_holistic_and_category-based_approaches","247924737_Managing_mid-project_progress_reviews_A_model_for_formative_group_assessment_in_Capstone_projects","238398140_Peer_and_Self_Assessment_of_Group_Work_Developing_an_Effective_Response_to_Increased_Enrollment_in_a_Third_Year_Course_in_Microclimatology","220612736_Thinking_ISsues_the_three_p's_of_capstone_project_performance","3050180_Senior_Design_Project_Undergraduate_Thesis"]}