{"id":"308807733_On_the_Weighted_Quartet_Consensus_problem","abstract":"In phylogenetics, the consensus problem consists in summarizing a set of phylogenetic trees that all classify the same set of species into a single tree. Several definitions of consensus exist in the literature; in this paper we focus on the WEIGHTED QUARTET CONSENSUS problem, whose complexity status has remained open since it was posed in 2008. Here we show that the WEIGHTED QUARTET CONSENSUS problem is NP-hard, and provide several results on the approximability of the problem. Namely, we show that WEIGHTED QUARTET CONSENSUS admits a polynomial-time approximation scheme (PTAS) based on prior work of Jiang, Kearney and Li. The algorithm is unfortunately impractical, and so we also present an implementable 1/2-factor approximation algorithm. During the process, we propose a derandomization procedure of a previously known randomized 1/3-factor approximation, which guarantees that a tree that contains a third of any given multi-set of quartets can be found deterministically. We also investigate the fixed-parameter tractability of this problem.","authors":["Manuel Lafond","Céline Scornavacca"],"meta":["October 2016Theoretical Computer Science 769","DOI:10.1016/j.tcs.2018.10.005"],"references":["247699534_Taxonomic_Congruence_in_the_Lep-topodomorpha_Re-Examined","228822176_Quartet_Cleaning_Improved_Algorithms_and_Simulations","316519260_A_classification_of_consensus_methods_for_phylogenetics","313348988_A_Pseudo-Boolean_Solution_to_the_Maximum_Quartet_Consistency_Problem","244996728_A_practical_algorithm_for_recovering_the_best_supported_edges_in_an_evolutionary_tree","243780886_A_View_of_Some_Consensus_Methods_for_Trees","225738150_Minimum_Quartet_Inconsistency_Is_Fixed_Parameter_Tractable","222554869_Constructing_Optimal_Trees_from_Quartets","222446082_Cyclic_ordering_is_NP-complete","220617130_Inferring_a_Tree_from_Lowest_Common_Ancestors_with_an_Application_to_the_Optimization_of_Relational_Expressions"]}