{"id":"308862672_Predicting_EMI_induced_delay_errors_in_integrated_circuits_Sensitivity_to_the_velocity_saturation_index","abstract":"Integrated circuits (ICs) sometimes fail when their power supply is disrupted by external noise, such as might occur during an electrical fast transient (EFT). A delay model was proposed in [1] which can be used to predict the variations in the delays through logic circuits caused by electromagnetic induced noise in the power supply voltage. This model is relatively simple and requires few parameters, giving it the potential to be used even when the IC is a “black bos” and little information is available about the inner circuits. While design information might be approximated through testing, critical process characteristics may not be available which are needed for accurate results. The parameter of greatest concern is the velocity saturation index, since this parameter can exponentially increase the impact of power supply noise on delay. This paper describes an investigation of the sensitivity of the delay model in [1] to the velocity saturation index. Results indicate that the estimated delay, found while treating much of the circuit as a black box, is largely insensitive to the velocity saturation index. This result suggests that this model can be used effectively for prediction of electromagnetically-induced delay errors, even when limited process or circuit information is known.","authors":["Xu Gao","Chunchun Sui","Sameer Hemmady","Joey Rivera"],"meta":["May 2015","DOI:10.1109/APEMC.2015.7175398","Conference: 2015 Asia-Pacific Symposium on Electromagnetic Compatibility (APEMC)"],"references":["252050473_Modelling_electromagnetic_field_coupling_from_an_ESD_gun_to_an_IC","224218183_Modeling_of_the_immunity_of_ICs_to_EFTs","220525176_Impact_of_Supply_Voltage_Variations_on_Full_Adder_Delay_Analysis_and_Comparison","3423520_Impact_of_Power-Supply_Noise_on_Timing_in_High-Frequency_Microprocessors","3337872_Impact_of_Supply_Voltage_Variations_on_Full_Adder_Delay_Analysis_and_Comparison","3057667_Predicting_URF_Upset_of_MOSFET_Digital_IC's","2975809_Alpha-power_law_MOSFET_model_and_its_applications_to_CMOS_inverter_delay_and_other_formulas"]}