{"id":"308959657_Teaching_Computer_Programing_as_Knowledge_Transfer_Some_Impacts_on_Software_Engineering_Productivity","abstract":"Programming skills of software engineers that affect software development productivity are central to any of the computing disciplines. While literature focuses on how to teach novice programmers, the aim of this research is to show how to strengthen programming skills of programmers by effectively transferring knowledge to those who had bad experiences when learning computer programming or have not developed enough programming skills to get a productivity standard. Since software engineering is a knowledge-intensive application discipline, a knowledge transfer process is conducted to improve the productivity of computer programmers involved in software engineering projects. An ad-hoc methodology allowed to follow-up changes that revealed that improvements in the capability to absorb new external knowledge increases overall productivity of individuals in software development teams. This finding may be useful for software companies looking for increasing their productivity.","authors":["Orlando López-Cruz","Alejandro León Mora","Mauricio Sandoval-Parra","Diana Lizeth Espejo-Gavilán"],"meta":["October 2017","DOI:10.1007/978-3-319-48523-2_14","Conference: International Conference on Software Process Improvement","Project: Engineering Absorptive Capacity"],"references":["308849640_Teaching_computer_programming_Practices_difficulties_and_opportunities","288525740_Research_design_Qualitative_quantitative_and_mixed_methods_approaches","279394789_The_Science_of_Programming","279366430_The_Science_of_Programming","279353097_The_Science_of_Programming","279352964_The_Science_of_Programming","277294108_Knowledge_Management_in_Software_Engineering_-_A_State-of-the-Art_report","265689268_Knowledge_Transfer_in_pair_programmingAn_In-depth_Analysis","262584608_Investigacion_cualitativa_versus_cuantitativa_dicotomia_metodologica_o_ideologica","262493823_The_Art_of_Computer_Programming"]}