{"id":"308901511_Execution_framework_of_the_GEMOC_studio_tool_demo","abstract":"The development and evolution of an advanced modeling environment for a Domain-Specific Modeling Language (DSML) is a tedious task, which becomes recurrent with the increasing number of DSMLs involved in the development and management of complex software-intensive systems. Recent efforts in language workbenches result in advanced frameworks that automatically provide syntactic tooling such as advanced editors. However, defining the execution semantics of languages and their tooling remains mostly hand crafted. Similarly to editors that share code completion or syntax highlighting, the development of advanced debuggers, an-imators, and others execution analysis tools shares common facilities, which should be reused among various DSMLs. In this tool demonstration paper, we present the execution framework offered by the GEMOC studio, an Eclipse-based language and modeling workbench. The framework provides a generic interface to plug in different execution engines associated to their specific metalanguages used to define the discrete-event operational semantics of DSMLs. It also integrates generic runtime services that are shared among the approaches used to implement the execution semantics, such as graphical animation or omniscient debugging.","authors":["Erwan Bousse","Tanja Mayerhofer","Julien Deantoni","Benoit Combemale"],"meta":["October 2016","DOI:10.1145/2997364.2997384","Conference: 9th International Conference on Software Language Engineering (SLE'16)At: Amsterdam, Netherlands"],"references":["280736521_A_Generative_Approach_to_Define_Rich_Domain-Specific_Trace_Metamodels","280699642_Supporting_Efficient_and_Advanced_Omniscient_Debugging_for_xDSMLs","271135270_Towards_a_Meta-Language_for_the_Concurrency_Concern_in_DSLs","266652852_Xbase_Implementing_Domain-Specific_Languages_for_Java","258888406_xMOF_Executable_DSMLs_based_on_fUML","307538168_A_Behavioral_Coordination_Operator_Language_BCOoL","300013578_Formalizing_Execution_Semantics_of_UML_Profiles_with_fUML_Models","285635804_AToM3_A_Tool_for_Multi-Formalism_Modelling_and_Meta-Modelling_In_European_Conferences_on_Theory_And_Practice_of_Software_Engineering_ETAPS'02_Fundamental_Approaches_to_Software_Engineering_FASE","281967047_Melange_A_Meta-language_for_Modular_and_Reusable_Development_of_DSLs","264922482_Semantics_of_a_Foundational_Subset_for_Executable_UML_Models_FUML"]}