{"id":"308962698_The_Dynamic_Dispatch_Waves_Problem_for_Same-Day_Delivery","abstract":"We study same-day delivery systems by formulating the Dynamic Dispatch Waves Problem (DDWP), which models a distribution center where geographically located delivery orders realize dynamically throughout the day. At each decision epoch (wave), the system's operator chooses whether or not to dispatch a vehicle route loaded with orders ready for service, to minimize vehicle travel and penalties for unserved requests. This work extends the one-dimensional variant in Klapp et al. (2016) to any network topology. We formulate an arc-based integer programming model and design local search heuristics to solve the deterministic DDWP and use this variant to design an a priori solution determined only with information disclosed at the start of the operation, and provide three approaches to obtain dynamic policies from it. We design two sets of computational experiments with different settings of geography, size, information dynamism, and order timing variability. Our results suggest that our best dynamic policies can cut the average cost of an a priori policy by 9.1%, achieving a gap of 12.1%. The marginal value of dynamic policies is concentrated in improving order coverage and increases for instances with greater variability and information dynamism. We also analyze the tradeoff between two common SDD objectives: total cost minimization versus maximizing order coverage. We find structural differences in the solution's structure for the two cases, and empirically show marginally increasing sacrifices to be made in vehicle routing efficiency to increase request coverage.","authors":["Mathias Klapp","Alan Erera","Alejandro Toriello"],"meta":["October 2016European Journal of Operational Research 271(2)","DOI:10.1016/j.ejor.2018.05.032","Project: Dynamic Dispatch Planning"],"references":["322883995_Tour_Scheduling_and_Rostering_Wiley_Encyclopedia_of_Operations_Research_and_Management_Science","305433476_Preemptive_Depot_Returns_for_Dynamic_Same-Day_Delivery","282542065_The_Same-Day_Delivery_Problem_for_Online_Purchases","278798156_The_Multi-Trip_Vehicle_Routing_Problem_with_Time_Windows_and_Release_Dates","277311131_The_One-dimensional_Dynamic_Dispatch_Waves_Problem","319615437_Dynamic_Vehicle_Routing","319326719_The_Delivery_Dispatching_Problem_with_Time_Windows_for_Urban_Consolidation_Centers","303404602_The_One-Dimensional_Dynamic_Dispatch_Waves_Problem","282521299_Restocking-Based_Rollout_Policies_for_the_Vehicle_Routing_Problem_with_Stochastic_Demand_and_Duration_Limits","280680581_Complexity_of_routing_problems_with_release_dates"]}