{"id":"308956963_Graph_Edit_Distance_as_a_Quadratic_Assignment_Problem","abstract":"The Graph Edit Distance (GED) is a flexible measure of dissimilarity between graphs which arises in error-correcting graph matching. It is defined from an optimal sequence of edit operations (edit path) transforming one graph into another. Unfortunately, the exact computation of this measure is NP-hard. In the last decade, several approaches were proposed to approximate the GED in polynomial time, mainly by solving linear programming problems. Among them, the bipartite GED received much attention. It is deduced from a linear sum assignment of the nodes of the two graphs, which can be efficiently computed by Hungarian-type algorithms. However, edit operations on nodes and edges are not handled simultaneously, which limits the accuracy of the approximation. To overcome this limitation, we propose to extend the linear assignment model to a quadratic one. This is achieved through the definition of a family of edit paths induced by assignments between nodes. We formally show that the GED, restricted to the paths in this family, is equivalent to a quadratic assignment problem. Since this problem is NP-hard, we propose to compute an approximate solution by adapting two algorithms: Integer Projected Fixed Point method and Graduated Non Convexity and Concavity Procedure. Experiments show that the proposed approach is generally able to reach a more accurate approximation of the exact GED than the bipartite GED, with a computational cost that is still affordable for graphs of non trivial sizes.","authors":["Sébastien Bougleux","Luc Brun","Carletti Vincenzo","Pasquale Foggia"],"meta":["October 2016Pattern Recognition Letters 87","DOI:10.1016/j.patrec.2016.10.001"],"references":["288060118_A_Quadratic_Assignment_Formulation_of_the_Graph_Edit_Distance","284001917_A_First_Step_Towards_Exact_Graph_Edit_Distance_Using_Bipartite_Graph_Matching","276276829_VF2_Plus_An_Improved_version_of_VF2_for_Biological_Graphs","276276551_Approximate_Graph_Edit_Distance_Computation_Combining_Bipartite_Matching_and_Exact_Neighborhood_Substructure_Distance","273169802_Speeding_up_Fast_Bipartite_Graph_Matching_Through_a_New_Cost_Matrix","312045766_Graph_Edit_Distance_as_a_Quadratic_Program","307519303_Factorized_Graph_Matching","306036993_Advances_in_Computer_Vision_and_Pattern_Recognition","277132559_A_Graph_Database_Repository_and_Performance_Evaluation_Metrics_for_Graph_Edit_Distance","271714553_Estimating_Graph_Edit_Distance_Using_Lower_and_Upper_Bounds_of_Bipartite_Approximations"]}