{"id":"308975053_Primary_School_Pupils'_Attitudes_toward_Learning_Programming_through_Visual_Interactive_Environments","abstract":"New generations are using and playing with mobile and computer applications extensively. These applications are the outcomes of programming work that involves skills, such as computational and algorithmic thinking. Learning programming is not easy for students children. In recent years, academic institutions like the Massachusetts Institute of Technology (MIT) and hi-tech companies, such as Google and Khan Academy, have introduced online environments to facilitate the teaching and learning of programming. Most of these programming environments are web-based, and interactive and are supported with visual multimedia features. Therefore, they have become easy to use, very attractive and helpful for teaching children how to program and to develop their algorithmic and computational thinking skills. The proposed presentation will describe research that examined the teaching of a course to primary school children based on three on-line interactive environments: \"Plastelina\" for logic games, “Code with Anna and Elsa” via the Hour of Code project block-oriented programming environment, for block programming and \"Turtle Academy\" for textual programming in the Logo language. The current research included the development, implementation and evaluation of the course at an elementary school. In addition, it was aimed at investigating the pupils' attitudes toward the learning of computer programming, both before and after participation in the course. The results revealed that the pupils' attitudes towards programming remained positive also also after the participation in the course. It was also found that programming improved children's problemsolving\nskills.","authors":["Khaled Asad","Moanes H. Tibi","Jamal Raiyn"],"meta":["October 2016World Journal of Education 6(5)","DOI:10.5430/wje.v6n5p20"],"references":["305002021_Developing_a_Mathematics_Lesson_Plan_based_on_Visual_Learning_Technology","267250221_The_Impact_of_Alice_on_the_Attitudes_of_High_School_Students_Toward_Computing","253311061_ABriefing_on_Assessment_in_Problem-based_Learning","247740146_Relationships_Between_Game_Attributes_and_Learning_Outcomes_Review_and_Research_Proposals","221537139_Engaging_middle_school_teachers_and_students_with_Alice_in_a_diverse_set_of_subjects","345853746_The_Study_Skills_Handbook","345767697_Critical_Thinking_Skills_Developing_Effective_Analysis_and_Argument","287787044_Attitude_gender_and_achievement_in_computer_programming","234726879_Computational_Thinking_Patterns","228414070_Expressing_computer_science_concepts_through_Kodu_game_lab"]}