{"id":"308953674_Ant_Colony_Optimization","abstract":"Swarm intelligence is a relatively new approach to problem solving that takes inspiration from the social behaviors of insects and of other animals. In particular, ants have inspired a number of methods and techniques among which the most studied and the most successful is the general purpose optimization technique known as ant colony optimization. Ant colony optimization (ACO) takes inspiration from the foraging behavior of some ant species. These ants deposit pheromone on the ground in order to mark some favorable path that should be followed by other members of the colony. Ant colony optimization exploits a similar mechanism for solving optimization problems. From the early nineties, when the first ant colony optimization algorithm was proposed, ACO attracted the attention of increasing numbers of researchers and many successful applications are now available. Moreover, a substantial corpus of theoretical results is becoming available that provides useful guidelines to researchers and practitioners in further applications of ACO. The goal of this article is to introduce ant colony optimization and to survey its most notable applications","authors":["Marco Dorigo","Mauro Birattari","Thomas Stützle"],"meta":["December 2006IEEE Computational Intelligence Magazine 1(4):28-39","DOI:10.1109/MCI.2006.329691"],"references":["303210960_Parallel_ant_colony_optimization_for_the_traveling_salesman_problem","313708715_Collective_robotics_From_social_insects_to_robots","313706874_Adaptation_in_natural_and_artificial_systems","313432646_Probabilistic_Modeling_of_a_Bio-Inspired_Collective_Experiments_with_Real_Robots","313134734_ACO_for_continuous_and_mixed-variable_optimization","313095592_Ant-based_approach_to_the_knowledge_fusion_problem","313071572_A_new_ACO_model_integrating_evolutionary_computation_concepts_The_best-worst_ant_system","312988944_Ant-based_load_balancing_in_telecommunications_networks","312907789_Ant_system_Optimization_by_a_colony_of_cooperating_agents","312609500_New_ideas_for_applying_ant_colony_optimization_to_the_probabilistic_TSP"]}