{"id":"308904821_Global_regional_and_national_incidence_prevalence_and_years_lived_with_disability_for_310_diseases_and_injuries_1990-2015_a_systematic_analysis_for_the_Global_Burden_of_Disease_Study_2015","abstract":"Background: Non-fatal outcomes of disease and injury increasingly detract from the ability of the world's population to live in full health, a trend largely attributable to an epidemiological transition in many countries from causes affecting children, to non-communicable diseases (NCDs) more common in adults. For the Global Burden of Diseases, Injuries, and Risk Factors Study 2015 (GBD 2015), we estimated the incidence, prevalence, and years lived with disability for diseases and injuries at the global, regional, and national scale over the period of 1990 to 2015. \nMethods: We estimated incidence and prevalence by age, sex, cause, year, and geography with a wide range of updated and standardised analytical procedures. Improvements from GBD 2013 included the addition of new data sources, updates to literature reviews for 85 causes, and the identification and inclusion of additional studies published up to November, 2015, to expand the database used for estimation of non-fatal outcomes to 60 900 unique data sources. Prevalence and incidence by cause and sequelae were determined with DisMod-MR 2.1, an improved version of the DisMod-MR Bayesian meta-regression tool first developed for GBD 2010 and GBD 2013. For some causes, we used alternative modelling strategies where the complexity of the disease was not suited to DisMod-MR 2.1 or where incidence and prevalence needed to be determined from other data. For GBD 2015 we created a summary indicator that combines measures of income per capita, educational attainment, and fertility (the Socio-demographic Index [SDI]) and used it to compare observed patterns of health loss to the expected pattern for countries or locations with similar SDI scores. \nFindings: We generated 9·3 billion estimates from the various combinations of prevalence, incidence, and YLDs for causes, sequelae, and impairments by age, sex, geography, and year. In 2015, two causes had acute incidences in excess of 1 billion: upper respiratory infections (17·2 billion, 95% uncertainty interval [UI] 15·4–19·2 billion) and diarrhoeal diseases (2·39 billion, 2·30–2·50 billion). Eight causes of chronic disease and injury each affected more than 10% of the world's population in 2015: permanent caries, tension-type headache, iron-deficiency anaemia, age-related and other hearing loss, migraine, genital herpes, refraction and accommodation disorders, and ascariasis. The impairment that affected the greatest number of people in 2015 was anaemia, with 2·36 billion (2·35–2·37 billion) individuals affected. The second and third leading impairments by number of individuals affected were hearing loss and vision loss, respectively. Between 2005 and 2015, there was little change in the leading causes of years lived with disability (YLDs) on a global basis. NCDs accounted for 18 of the leading 20 causes of age-standardised YLDs on a global scale. Where rates were decreasing, the rate of decrease for YLDs was slower than that of years of life lost (YLLs) for nearly every cause included in our analysis. For low SDI geographies, Group 1 causes typically accounted for 20–30% of total disability, largely attributable to nutritional deficiencies, malaria, neglected tropical diseases, HIV/AIDS, and tuberculosis. Lower back and neck pain was the leading global cause of disability in 2015 in most countries. The leading cause was sense organ disorders in 22 countries in Asia and Africa and one in central Latin America; diabetes in four countries in Oceania; HIV/AIDS in three southern sub-Saharan African countries; collective violence and legal intervention in two north African and Middle Eastern countries; iron-deficiency anaemia in Somalia and Venezuela; depression in Uganda; onchoceriasis in Liberia; and other neglected tropical diseases in the Democratic Republic of the Congo. \nInterpretation: Ageing of the world's population is increasing the number of people living with sequelae of diseases and injuries. Shifts in the epidemiological profile driven by socioeconomic change also contribute to the continued increase in years lived with disability (YLDs) as well as the rate of increase in YLDs. Despite limitations imposed by gaps in data availability and the variable quality of the data available, the standardised and comprehensive approach of the GBD study provides opportunities to examine broad trends, compare those trends between countries or subnational geographies, benchmark against locations at similar stages of development, and gauge the strength or weakness of the estimates available.","authors":["Theo Vos","Christine Allen","Megha Arora","Ryan M. Barber"],"meta":["October 2016The Lancet 388(10053):1545-1602","DOI:10.1016/S0140-6736(16)31678-6","Projects: Global Burden of Disease StudiesB&MGF Accelerated Grant Proposal (OPP1132415)GLOBAL BURDEN OF DISEASEGlobal Burden of DiseaseGlobal Burden of DiseasePublic HealthGlobal Burden of Diseases StudyGlobal Burden of DiseaseGlobal Burden of DiseaseGlobal Burden of DiseaseGBD 2015GBD projectDiabetes and Global Burden of DiseaseGlobal Burden of Disease StudyGlobal Burden of Disease ProjectGBD 2015GBD 2015GBD 2013-2015 StudyGlobal Burden of DiseasesGlobal HealthGBD projectsGlobal Burden of DiseaseGlobal Burden of Disease NetworkItalian Global Burden of Disease Initiative"],"references":["323584946_Microcephaly_in_Infants_Pernambuco_State_Brazil_2015","319065931_Coverage_and_system_efficiencies_of_insecticide-treated_nets_in_Africa_from_2000_to_2017","308904659_Global_regional_and_national_life_expectancy_all-cause_mortality_and_cause-specific_mortality_for_249_causes_of_death_1980-2015_a_systematic_analysis_for_the_Global_Burden_of_Disease_Study_2015","308904579_Global_regional_and_national_comparative_risk_assessment_of_79_behavioural_environmental_and_occupational_and_metabolic_risks_or_clusters_of_risks_1990-2015_a_systematic_analysis_for_the_Global_Burden","303781804_Time_for_mental_health_to_come_out_of_the_shadows","314428768_Does_Age-Related_Decline_in_Ability_Correspond_with_Retirement_Age","304572991_Guidelines_for_Accurate_and_Transparent_Health_Estimates_Reporting_the_GATHER_statement","303009938_Addressing_the_burden_of_mental_neurological_and_substance_use_disorders_key_messages_from_Disease_Control_Priorities_vol_387_pg_1672_2016","301288252_Zika_Virus_and_Birth_Defects_-_Reviewing_the_Evidence_for_Causality","299988986_Educating_patients_about_the_benefits_of_physical_activity_and_exercise_for_their_hip_and_knee_osteoarthritis_Systematic_literature_review","299844725_Worldwide_trends_in_diabetes_since_1980_A_pooled_analysis_of_751_population-based_studies_with_44_million_participants","291390249_Two-year_results_of_disease_activity_score_DAS-remission-steered_treatment_strategies_aiming_at_drug-free_remission_in_early_arthritis_patients_the_IMPROVED-study","288001971_Differing_Methods_and_Definitions_Influence_DALY_estimates_Using_Population-Based_Data_to_Calculate_the_Burden_of_Convulsive_Epilepsy_in_Rural_South_Africa","295082531_Beyond_Ebola","290431474_Zika_Virus_in_the_Americas_-_Yet_Another_Arbovirus_Threat"]}