{"id":"309006949_Studying_student_differentiation_in_gamified_education_A_long-term_study","abstract":"Gamified learning is a novel concept that according to recent studies, can increase student activity and improve learning outcomes. However, little is known about how different students experience and are engaged by it. We present a long-term study which identified distinct behavioral and performance patterns in participants taking a gamified college course. Our study lasted for three years, during which we deployed three consecutive instances of the course, each featuring improvements based on student feedback from the previous instances. To understand how different students behaved in our gamified experience, according to their daily performance, we performed cluster analysis and assessed student engagement in the last year using a formal instrument. We then did a cluster-wise analysis using different performance and behavioral measures, to further assess and characterize every cluster. To wit, we identified six different student clusters, each featuring different behaviors and performance levels. However, only four were present in the last year, which differed in terms of engagement with the course. In this paper we carefully describe each student cluster, explain how they evolved, and derive meaningful design lessons.","authors":["Gabriel Barata","Sandra Gama","Joaquim Armando Pires Jorge","Daniel Gonçalves"],"meta":["October 2016Computers in Human Behavior 71","DOI:10.1016/j.chb.2016.08.049","Project: Gamification in Learning"],"references":["309050128_Engaging_Engineering_Students_with_Gamification","293173843_Comparison_of_the_various_clustering_algorithms_of_weka_tools","289655631_Increase_Physical_Fitness_and_Create_Health_Awareness_through_Exergames_and_Gamification","277963413_Gamification_for_smarter_learning_tales_from_the_trenches","273762802_Multiple_Paths_Same_Goal_Exploring_the_Motivational_Pathways_of_Two_Distinct_Game-Inspired_University_Course_Designs","318494438_Flow_the_psychology_of_optimal_experience","312624983_Handbook_of_educational_psychology","309050206_Virtual_worlds_in_large_enrollment_biology_and_geology_classes_significantly_improve_authentic_learning","282061732_Designed-Based_Research_and_Technology_Enhanced_Learning_Environments","273946893_For_the_Win_How_Game_Thinking_can_Revolutionize_your_Business"]}