{"id":"309041923_Graphlet-based_Characterization_of_Directed_Networks","abstract":"We are flooded with large-scale, dynamic, directed, networked data. Analyses requiring exact comparisons between networks are computationally intractable, so new methodologies are sought. To analyse directed networks, we extend graphlets (small induced sub-graphs) and their degrees to directed data. Using these directed graphlets, we generalise state-of-the-art network distance measures (RGF, GDDA and GCD) to directed networks and show their superiority for comparing directed networks. Also, we extend the canonical correlation analysis framework that enables uncovering the relationships between the wiring patterns around nodes in a directed network and their expert annotations. On directed World Trade Networks (WTNs), our methodology allows uncovering the core-broker-periphery structure of the WTN, predicting the economic attributes of a country, such as its gross domestic product, from its wiring patterns in the WTN for up-to ten years in the future. It does so by enabling us to track the dynamics of a country’s positioning in the WTN over years. On directed metabolic networks, our framework yields insights into preservation of enzyme function from the network wiring patterns rather than from sequence data. Overall, our methodology enables advanced\nanalyses of directed networked data from any area of science, allowing domain-specific interpretation of a directed network’s topology.","authors":["Anida Sarajlić","Noël Malod-Dognin","Ömer Nebil Yaveroğlu","Natasa Przulj"],"meta":["October 2016Scientific Reports 6(1):35098","DOI:10.1038/srep35098"],"references":["301838453_Graphlet_characteristics_in_directed_networks","285668548_Gene_ontology_Tool_for_the_unification_of_biology","314905096_The_Architecture_of_Globalization_A_Network_Approach_to_International_Economic_Integration","307932384_A_Reconsideration_of_the_Twentieth_Century","304577336_Extending_the_Applicability_of_Graphlets_to_Directed_Networks","287199437_Integrative_methods_for_analysing_big_data_in_precision_medicine","287179031_Toward_pathway_engineering_A_new_database_of_genetic_and_molecular_pathways","284781643_Social_Network_Analysis_Overview_of","284772170_Canonical_correlation_analysis","284528183_Regression_and_the_Moore-Penrose_Pseudoinverse"]}