{"id":"309001562_Facilitating_resource_sharing_and_selection_in_ubiquitous_multi-user_environments","abstract":"Mobile technologies have increased the interest of industry and academia in providing users with information and services anytime and anywhere. Some services are customized according to the users’ characteristics, attempting to create ubiquitous environments that enable such users to share and discover resources. However, research that addresses the creation of these environments is scant. In this article, we go further than single-user pervasive systems, by developing a support that manages shared resources in ubiquitous multi-user environments. Our contribution is a semantic matchmaking service capable of finding the most suitable resources that satisfy the users’ requirements. This service processes the users’ requests, their context, and the community participating in the resource sharing process, by respecting restrictions, the natural interaction among participants, and the changes that this interaction produces. We model the environment, shared resources, and users as dynamic entities that generate new information, which might affect the availability states of such resources. These states have been defined through the Contextual-Graphs formalism to incorporate new knowledge that can refine, extend, or customize such states, according to the users’ habits. Our matchmaking service has been deployed across the Computer Science Department of CINVESTAV-IPN research center, where it has been validated by means of several test cases.","authors":["Kimberly García","Sonia Mendoza","Dominique Decouchant","Patrick Brézillon"],"meta":["October 2018Information Systems Frontiers 20(5)","DOI:10.1007/s10796-016-9708-0"],"references":["299680544_Context-Based_Development_of_Experience_Bases","267979682_Service_Discovery_Acceleration_with_Hierarchical_Clustering","259478270_Satisfaction-based_Web_Service_Discovery_and_Selection_Scheme_utilizing_Vague_Sets_theory","319770458_Semantic_Web_Programming","318494191_RESTful_Web_Services","300791101_Non-invasive_optical_detection_of_hand_gestures","284834545_Engineering_of_web_services_for_internet_of_things_applications","284834519_Computationally_efficient_ontology_selection_in_software_requirement_planning","271408778_Collaborative_personal_profiling_for_web_service_ranking_and_recommendation","260324688_Ontology_Matching_State_of_the_Art_and_Future_Challenges","256502991_Constructing_CSCW_The_first_quarter_century","257574561_Personalized_Web_Feeds_Based_on_Ontology_Technologies","257574555_PadSpace_A_new_framework_for_the_service_federation_of_web_resources","257574494_Semantic-based_transaction_model_for_web_service","257458253_Resistance_Is_Futile_Reading_Science_Fiction_alongside_Ubiquitous_Computing"]}