{"id":"309086464_Measuring_computer_science_pedagogical_content_knowledge_An_exploratory_analysis_of_teaching_vignettes_to_measure_teacher_knowledge","abstract":"The initiatives to introduce Computer Science as a mandatory subject in K-12 in the U.S. (CSForAll), the U.K. (CAS), or Australia mean that thousands of new teachers will need to be trained both through inservice professional development and preservice teacher preparation. In order to examine the success of these efforts to train new computer science teachers requires computer science education researchers to evaluate the development of knowledge to teach computer science, i.e. pedagogical content knowledge. To date, we know little about how computer science pedagogical content knowledge looks like and how to assess it. This paper reports results from a qualitative analysis of computer science teachers' responses to teaching vignettes about students' understanding of programming constructs. The responses were evaluated using qualitative text analysis and commonalities are presented. In future research, the teachers' knowledge related to programming errors will be investigated on the basis of a survey developed from the answers of the presented study.","authors":["Aman Yadav","Marc Berges","Phil Sands","Jon Good"],"meta":["October 2016","DOI:10.1145/2978249.2978264","Conference: WiPCSEAt: Munster, Germany","Project: PD4CS: Leading the Way to CS10K: Assessing a Just-in-Time Professional Development Approach for Teacher Knowledge Growth in Computer Science"],"references":["281288958_Towards_a_Competency_Model_for_Teaching_Computer_Science","276078320_Development_of_a_Competency_Model_for_Computer_Science_Teachers_at_Secondary_School_Level","269966375_Using_Vignette_Testing_to_Measure_Student_Science_Teachers'_Professional_Competencies","341412627_What_the_student_does_Teaching_for_enhanced_learning","321512261_Those_who_Understand_Knowledge_Growth_in_Teaching","316801486_Guide_to_Teaching_Computer_Science","302944837_Misconceptions_and_attitudes_that_infere_with_learning_to_program","301429177_Students'_cognition","290478004_Qualitative_Content_Analysis_Theoretical_Background_and_Procedures","272178178_Unpacking_Pedagogical_Content_Knowledge_Conceptualizing_and_Measuring_Teachers'_Topic-Specific_Knowledge_of_Students"]}