{"id":"309008608_Model-Free_Closed-Loop_Stability_Analysis_A_Linear_Functional_Approach","abstract":"Performing a stability analysis during the design of any electronic circuit is critical to guarantee its correct operation. A closed-loop stability analysis can be performed by analyzing the impedance presented by the circuit at a well-chosen node without internal access to the simulator. If any of the poles of this impedance lie in the complex right half-plane, the circuit is unstable. The classic way to detect unstable poles is to fit a rational model on the impedance. In this paper, a projection-based method is proposed which splits the impedance into a stable and an unstable part by projecting on an orthogonal basis of stable and unstable functions. When the unstable part lies significantly above the interpolation error of the method, the circuit is considered unstable. Working with a projection provides one, at small cost, with a first appraisal of the unstable part of the system. Both small-signal and large-signal stability analysis can be performed with this projection-based method. In the small-signal case, a low-order rational approximation can be fit on the unstable part to find the location of the unstable poles.","authors":["Adam Cooman","Fabien Seyfert","Martine Olivi","Sylvain Chevillard"],"meta":["September 2017IEEE Transactions on Microwave Theory and Techniques 66(1):73-80","DOI:10.1109/TMTT.2017.2749222"],"references":["278630229_On_Transfer_Functions_Realizable_with_Active_Electronic_Components","265111004_Stability_Analysis_of_Microwave_Circuits","261267761_New_qualified_industrial_AlGaNGaN_HEMT_process_Power_performances_reliability_figures_of_merit","313364158_Low_Rank_Approximation_Algorithms_Implementation_Applications","311532382_Stability_analysis_and_demonstration_of_an_X-band_GaN_power_amplifier_MMIC","276212910_Check_the_Stability_Stability_Analysis_Methods_for_Microwave_Circuits","267080811_Robust_Pade_approximation_via_SVD","260333336_On_the_Convergence_of_the_Vector-Fitting_Algorithm","258657303_Experimental_Characterization_of_Stability_Margins_in_Microwave_Amplifiers","257528389_Algebraic_properties_of_robust_Pad'e_approximants"]}