{"id":"309011826_The_Use_of_Pilot_Models_to_Support_Flight_Simulation_The_Sky_is_the_Envelope","abstract":"The first attempts to develop pilot models started after the Second World War. This led in the sixties to a landmark publication by McRuer on Human Pilot Dynamics. While the first pilot models were based on visual information only as pilot input, the introduction of the 6DOF motion systems for flight simulation stimulated experimental research which broadened the understanding and further development of pilot models. Since, there is a direct relation between the application of pilot models and simulation. Pilot models were extended with descriptions of the visual, vestibular and the neuromuscular systems and are ready to be used for a wide range of applications. The paper discusses three applications of pilot models to support flight simulation: pre-experimental analysis, optimization of the cueing algorithm parameters, and analysis of pilot's control performance in the balked landing. The results of these analyses demonstrate that pilot models became mature and are ready to be used for analysis to support flight simulation.","authors":["Ruud Hosman"],"meta":["June 2009","Conference: Flight SimulationTowards the Edge of the EnvelopeAt: Royal Aeronautical Society, London"],"references":["317203055_Pilot's_Perception_and_Control_of_Aircraft_Motions","268556913_Development_of_a_Pilot_Model_for_the_Manual_Balked_Landing_Maneuver","268556544_Pre_and_Post_Pilot_Model_Analysis_Compared_to_Experimental_Simulator_Results","268556425_Revising_Civil_Simulator_Standards_-_An_Opportunity_for_Technological_Pull","268556382_Objective_Motion_Fidelity_Qualification_in_Flight_Training_Simulators","267303028_A_Cybernetic_Approach_To_Assess_Flight_Simulator_Fidelity","245432636_Integrated_Design_of_the_Motion_Cueing_System_for_a_Wright_Flyer_Simulator","305815156_Human_Pilot_Dynamics_in_Compensatory_Systems_Theory_Models_and_Experiments_with_Controlled_Element_and_Forcing_Function_Variations","302378278_Feedback_Control_Systems","264574304_A_Review_of_Quasi-Linear_Pilot_Models"]}