{"id":"309033238_Modeling_Skill_Combination_Patterns_for_Deeper_Knowledge_Tracing","abstract":"This paper explores the problem of modeling student knowledge in complex learning activities where multiple skills are required at the same time, such as in the programming domain. In such cases, it is not clear how the evidence of student performance translates to individual skills. As a result, traditional approaches to knowledge modeling, such as Knowledge Tracing (KT), which traces students' knowledge of each decomposed individual skill, might fall short. We argue that skill combinations might carry extra specific knowledge, and mastery should be asserted only when a student can fluently apply skills in combination with other skills in di↵erent contexts. We propose a data-driven framework to model skill combination patterns for tracing stu-dents' deeper knowledge. We automatically identify significant skill combinations from data and construct a conjunc-tive knowledge model with a hierarchical skill representation based on a Bayesian Network. We also propose a novel evaluation framework primarily focuses on the knowledge inference quality, since we argue that traditional prediction metrics no longer suce to di↵erentiate between shallow and deep knowledge modeling. Our experiments on datasets collected from two programming learning systems show that proposed model significantly increases mastery inference accuracy and tends to more reasonably distribute students' e↵orts comparing with traditional KT models and its non-hierarchical counterparts. Our work serves as a first step towards building skill application context sensitive model for modeling students' deep, robust learning.","authors":["Yun Huang","Julio Guerra","Peter Brusilovsky"],"meta":["January 2016","Conference: The 6th Intl. Workshop on Personalization Approaches in Learning Environments (PALE 2016) in the 24th Conf. on User Modeling, Adaptation and Personalization (UMAP 2016)"],"references":["305277457_Deeper_Knowledge_Tracing_by_Modeling_Skill_Application_Context_for_Better_Personalized_Learning","281214733_Your_model_is_predictive-_but_is_it_useful_Theoretical_and_Empirical_Considerations_of_a_New_Paradigm_for_Adaptive_Tutoring_Evaluation","281214731_General_Features_in_Knowledge_Tracing_to_Model_Multiple_Subskills_Temporal_Item_Response_Theory_and_Expert_Knowledge","281214594_A_Framework_for_Multifaceted_Evaluation_of_Student_Models","281207101_Discovering_Prerequisite_Structure_of_Skills_through_Probabilistic_Association_Rules_Mining","266502553_Automated_Student_Model_Improvement","259781445_JavaParser_A_Fine-Grain_Concept_Indexing_Tool_for_Java_Problems","284531961_Handbook_of_Modern_Item_Response_Theory","283254086_A_unified_5-dimensional_framework_for_student_models","265937130_Handbook_of_Modern_Item_Response_Theory"]}