{"id":"309021383_Why_are_some_STEM_fields_more_gender_balanced_than_others","abstract":"Women obtain more than half of U.S. undergraduate degrees in biology, chemistry, and mathematics, yet they earn less than 20% of computer science, engineering, and physics undergraduate degrees (National Science Foundation, 2014a). Gender differences in interest in computer science, engineering, and physics appear even before college. Why are women represented in some science, technology, engineering, and mathematics (STEM) fields more than others? We conduct a critical review of the most commonly cited factors explaining gender disparities in STEM participation and investigate whether these factors explain differential gender participation across STEM fields. Math performance and discrimination influence who enters STEM, but there is little evidence to date that these factors explain why women’s underrepresentation is relatively worse in some STEM fields. We introduce a model with three overarching factors to explain the larger gender gaps in participation in computer science, engineering, and physics than in biology, chemistry, and mathematics: (a) masculine cultures that signal a lower sense of belonging to women than men, (b) a lack of sufficient early experience with computer science, engineering, and physics, and (c) gender gaps in self-efficacy. Efforts to increase women’s participation in computer science, engineering, and physics may benefit from changing masculine cultures and providing students with early experiences that signal equally to both girls and boys that they belong and can succeed in these fields.","authors":["Sapna Cheryan","Sianna A. Ziegler","Amanda K. Montoya","Lily Jiang"],"meta":["October 2016Psychological Bulletin 143(1)","DOI:10.1037/bul0000052"],"references":["248981338_Girls'_biology_boys'_physics_Evidence_from_free-choice_science_learning_settings","242475010_Gender_Differences_in_the_High_School_and_Affective_Experiences_of_Introductory_College_Physics_Students","232601310_The_stereotyped_task_engagement_process_The_role_of_interest_and_achievement_motivation_Journal_of_Educational_Psychology_99_99-114","287797301_The_Subtle_Suspension_of_Backlash_A_Meta-Analysis_of_Penalties_for_Women's_Implicit_and_Explicit_Dominance_Behavior","226018087_Attributional_patterns_and_perceptions_of_math_and_science_among_fifth-grade_through_seventh-grade_girls_and_boys"]}