{"id":"309002447_Interval_Type_2_Fuzzy_Set_in_Fuzzy_Shortest_Path_Problem","abstract":"The shortest path problem (SPP) is one of the most important combinatorial optimization problems in graph theory due to its various applications. The uncertainty existing in the real world problems makes it difficult to determine the arc lengths exactly. The fuzzy set is one of the popular tools to represent and handle uncertainty in information due to incompleteness or inexactness. In most cases, the SPP in fuzzy graph, called the fuzzy shortest path problem (FSPP) uses type-1 fuzzy set (T1FS) as arc length. Uncertainty in the evaluation of membership degrees due to inexactness of human perception is not considered in T1FS. An interval type-2 fuzzy set (IT2FS) is able to tackle this uncertainty. In this paper, we use IT2FSs to represent the arc lengths of a fuzzy graph for FSPP. We call this problem an interval type-2 fuzzy shortest path problem (IT2FSPP). We describe the utility of IT2FSs as arc lengths and its application in different real world shortest path problems. Here, we propose an algorithm for IT2FSPP. In the proposed algorithm, we incorporate the uncertainty in Dijkstra’s algorithm for SPP using IT2FS as arc length. The path algebra corresponding to the proposed algorithm and the generalized algorithm based on the path algebra are also presented here. Numerical examples are used to illustrate the effectiveness of the proposed approach.","authors":["Arindam Dey","Anita Pal","Tandra Pal"],"meta":["October 2016","DOI:10.3390/math4040062","Project: Fuzzy shortest path problem."],"references":["301797728_A_study_of_granular_computing_in_the_agenda_of_growth_of_artificial_neural_networks","301794030_Rule_Based_Systems_A_Granular_Computing_Perspective","299654058_A_neurofuzzy_algorithm_for_learning_from_complex_granules","297755780_Evolving_granular_analytics_for_interval_time_series_forecasting","296475617_Semi-greedy_heuristics_for_feature_selection_with_test_cost_constraints","295688156_Granular_computing_as_a_basis_of_human-data_interaction_A_cognitive_cities_use_case","294283438_A_comparison_of_three_approaches_for_estimating_synthesizing_an_interval_type-2_fuzzy_set_model_of_a_linguistic_term_for_computing_with_words","292991155_DCC_A_framework_for_dynamic_granular_clustering","308306409_A_triarchic_theory_of_granular_computing","303444218_Multiple_criteria_decision_making"]}