{"id":"309022425_Applied_Machine_Learning_Forecasting_Heat_Load_in_District_Heating_System","abstract":"Forecasting energy consumption in buildings is a key step towards the realization of optimized energy production, distribution and consumption. This paper presents a data driven approach for analysis and forecast of aggregate space and water thermal load in buildings. The analysis and the forecast models are built using district heating data unobtrusively collected from ten residential and commercial buildings located in Skellefteå, Sweden. The load forecast models are generated using supervised machine learning techniques, namely, support vector machine, regression tree, feed forward neural network, and multiple linear regression. The model takes the outdoor temperature, historical values of heat load, time factor variables and physical parameters of district heating substations as its input. A performance comparison among the machine learning methods and identification of the importance of models input variables is carried out. The models are evaluated with varying forecast horizons of every hour from 1 up to 48 hours. Our results show that support vector machine, feed forward neural network and multiple linear regression are more suitable machine learning methods with lower performance errors than the regression tree. Support vector machine has the least normalized root mean square error of 0.07 for a forecast horizon of 24 hour.","authors":["Samuel O Idowu","Saguna Saguna","Christer Åhlund","Olov Schelén"],"meta":["October 2016Energy and Buildings 133","DOI:10.1016/j.enbuild.2016.09.068"],"references":["266340889_Online_Short-Term_Forecast_of_System_Heat_Load_in_District_Heating_Networks","261462071_Short-term_heat_load_forecasting_for_single_family_houses","310606656_Classification_and_regression_trees","309032004_Machine_learning_in_district_heating_system_energy_optimization","307881957_LIBSVM_A_library_for_support_vector_machines","281609255_A_method_for_computing_optimal_set-point_schedules_for_HVAC_systems","273460089_Black-box_modeling_of_residential_HVAC_system_and_comparison_of_grey-box_and_black-box_modeling_methods","271982228_An_Acoustic_Study_on_Focus_in_Chinese_The_Variation_of_Intensity","262364495_Application_of_wavelet_neural_network_on_thermal_load_forecasting","260648325_Management_and_Control_of_Domestic_Smart_Grid_Technology"]}