{"id":"309081880_IoT_Middleware_A_Survey_on_Issues_and_Enabling_Technologies","abstract":"The Internet of Things (IoT) provides the ability for human and computers to learn and interact from billions of things that include sensors, actuators, services, and other Internet connected objects. The realization of IoT systems will enable seamless integration of the cyber-world with our physical world and will fundamentally change and empower human interaction with the world. A key technology in the realization of IoT systems is middleware, which is usually described as a software system designed to be the intermediary between IoT devices and applications. In this paper, we first motivate the need for an IoT middleware via an IoT application designed for real-time prediction of blood alcohol content using smartwatch sensor data. This is then followed by a survey on the capabilities of the existing IoT middleware. We further conduct a thorough analysis of the challenges and the enabling technologies in developing an IoT middleware that embraces the heterogeneity of IoT devices and also supports the essential ingredients of composition, adaptability and security aspects of an IoT system.","authors":["Anne Ngu","Mario Gutierrez","Vangelis Metsis","Surya Nepal"],"meta":["October 2016IEEE Internet of Things Journal PP(99):1-1","DOI:10.1109/JIOT.2016.2615180"],"references":["308788452_A_security_survey_of_middleware_for_the_Internet_of_Things","299548352_Things_of_Interest_Recommendation_by_Leveraging_Heterogeneous_Relations_in_the_Internet_of_Things","286753251_ThingsNavi_Finding_Most-Related_Things_via_Multi-Dimensional_Modeling_of_Human-Thing_Interactions","284712954_The_Schema_Editor_of_OpenIoT_for_Semantic_Sensor_Networks","314616949_Real-Time_Prediction_of_Blood_Alcohol_Content_Using_Smartwatch_Sensor_Data","313603685_Communications_in_Computer_and_Information_Science_Preface","294288425_When_Things_Matter_A_Survey_on_Data-Centric_Internet_of_Things","290583322_6LoWPAN_The_Wireless_Embedded_Internet","290503780_Key_agreement_the_Algebraic_Eraser_and_lightweight_cryptography","285421670_The_Internet_of_Things_Has_a_Gateway_Problem"]}