{"id":"309147798_Adapting_to_the_Needs_of_the_Public_Health_Workforce_An_Integrated_Case-Based_Training_Program","abstract":"The goal of any public health education at the Masters level is to transmit knowledge and skills to meet current and future public health challenges. We suggest an innovative multi-modal approach to public health education using a case-based pedagogy combined with competency-based curriculum and a team-based approach to foster truly experiential learning. We describe each pedagogical approach in connection to the relevance of optimal methods for training public health professionals. Western University’s Schulich Interfaculty Masters of Public Health (MPH) program (ON, Canada) provides a unique interprofessional education through case-based learning and competency-based curriculum. This Masters program has attracted applicants from around the world to learn in a supportive interprofessional environment and to foster them as they become learners and leaders in public health changes. To our knowledge, we are the first condensed MPH program using integrated case-based pedagogy as our main pedagogical approach.","authors":["Shannon Sibbald","Mark R Speechley","Amardeep Thind"],"meta":["October 2016Frontiers in Public Health 4(1)","DOI:10.3389/fpubh.2016.00221"],"references":["275895134_Success_of_the_Undergraduate_Public_Health_at_Tulane_University","274753287_Ties_Leaders_And_Time_In_Teams_Strong_Inference_About_Network_Structure's_Effects_On_Team_Viability_And_Performance","271193882_Integrated_Teaching_Programme_Using_Case_Based_Learning","265494284_New_Era_for_Schools_and_Programs_of_Public_Health_in_Canada","344058604_Group_Dynamics_for_Teams_6th_Edition","333958211_Problem-based_learning_PBL","327144561_Core_Principles_Values_of_Effective_Team-Based_Health_Care","297545532_Multiprofessional_education_in_undergraduate_curricula_can_work","271751596_Chemists_in_British_Universities_A_Study_of_the_Reward_System_in_Science","260621717_Efficiency_vs_size_of_research_teams"]}