{"id":"309153433_Age-Related_Evolution_Patterns_in_Online_Handwriting","abstract":"Characterizing age from handwriting (HW) has important applications, as it is key to distinguishing normal HW evolution with age from abnormal HW change, potentially triggered by neurodegenerative decline. We propose, in this work, an original approach for online HW style characterization based on a two-level clustering scheme. The first level generates writer-independent word clusters from raw spatial-dynamic HW information. At the second level, each writer's words are converted into a Bag of Prototype Words that is augmented by an interword stability measure. This two-level HW style representation is input to an unsupervised learning technique, aiming at uncovering HW style categories and their correlation with age. To assess the effectiveness of our approach, we propose information theoretic measures to quantify the gain on age information from each clustering layer. We have carried out extensive experiments on a large public online HW database, augmented by HW samples acquired at Broca Hospital in Paris from people mostly between 60 and 85 years old. Unlike previous works claiming that there is only one pattern of HW change with age, our study reveals three major aging HW styles, one specific to aged people and the two others shared by other age groups.","authors":["Gabriel Marzinotto","José Carlos Rosales","Mounim A. El Yacoubi","Sonia Garcia-Salicetti"],"meta":["September 2016Computational and Mathematical Methods in Medicine 2016(6)","DOI:10.1155/2016/3246595","Projects: Glucose Prediciton for Diabetic PeopleBehavioral Data Analysis for Health AssessmentMulti-modal analysis of normal and pathological aging : A longitudinal study of handwriting,"],"references":["304382121_Uncovering_Major_Age-Related_Handwriting_Changes_by_Unsupervised_Learning","282152092_Age_Characterization_from_Online_Handwriting","265592404_Automatic_prediction_of_age_gender_and_nationality_in_offline_handwriting","259589194_The_lognormal_handwriter_Learning_performing_and_declining","323244053_Reprint_of_'Age-related_changes_in_executive_control_and_their_relationships_with_activity_performance_in_handwriting'","283224333_Age_and_Gender_Characterization_Through_a_Two_Layer_Clustering_of_Online_Handwriting","273337851_Handwriting_and_pre-frailty_in_the_Lausanne_cohort_65_Lc65_study","255403490_Digitizing_Tablet","236113363_Reprint_of_'Age-related_changes_in_executive_control_and_their_relationships_with_activity_performance_in_handwriting'","236091190_Age_Effects_on_Sensory-Processing_Abilities_and_Their_Impact_on_Handwriting"]}