{"id":"309145032_Examining_Informal_Learning_using_Mobile_Devices_in_the_Healthcare_Workplace_Examen_de_l'apprentissage_informel_par_l'utilisation_d'appareils_mobiles_dans_le_milieu_des_soins_de_sante","abstract":"The study of workplace learning and informal learning are not new to adult education and pedagogy. However, the use of mobile devices as learning tools for informal learning in the workplace is an understudied area. Using theories on informal learning and constructivism as a framework, this paper explores informal learning of registered nurses using mobile devices to meet their learning needs for continuing professional education, professional development, and continuing competence within the challenging healthcare workplace. In this mixed methods study, participants used their devices for self-directed informal learning with non-collaborative strategies/processes for evidence-based support, new procedures/treatments, professional development, patient/client teaching, and maintaining competency. Positive perceptions were articulated. Minimal differences were associated to the nurses’ age. However, workplace-related influences were relevant to the informal learning experiences with the mobile devices.\n\nL'étude de l'apprentissage en milieu de travail et de l’apprentissage informel n’est pas nouvelle dans le domaine de l'éducation des adultes et de la pédagogie. Cependant, l'utilisation d'appareils mobiles comme outils pour l'apprentissage informel en milieu de travail est un domaine peu étudié. En utilisant comme cadre d’analyse des théories de l'apprentissage informel et le constructivisme, cet article examine l'apprentissage informel des infirmières utilisant des appareils mobiles pour répondre à leurs besoins d'apprentissage en contexte de formation professionnelle continue, de perfectionnement professionnel et de maintien de leurs compétences dans le milieu difficile de la santé. Dans cette étude à méthodologies mixtes, les participants ont utilisé leurs appareils pour un apprentissage autodirigé informel à l’aide de stratégies et de processus non collaboratifs permettant un appui sur des données factuelles, pour produire de nouvelles procédures et traitements, pour leur perfectionnement professionnel, pour enseigner au patient ou au client et pour le maintien de leurs compétences. Des perceptions positives ont été formulées. Des différences minimes ont été associées à l'âge des infirmières. Cependant, les influences liées au milieu de travail étaient pertinentes pour les expériences d'apprentissage informel avec les appareils mobiles.","authors":["Dorothy (Willy) Fahlman"],"meta":["December 2013Canadian Journal of Learning and Technology / La revue canadienne de l’apprentissage et de la technologie 39(4)","DOI:10.21432/T2X59H"],"references":[]}