{"id":"309220593_Tracing_the_historical_origins_of_knowledge_management_issues_through_referenced_publication_years_spectroscopy_RPYS","abstract":"Purpose\n\nThis study, using a new method called Referenced Publication Years Spectroscopy (RPYS), aims to examine the most important historic works written in the area of knowledge management (KM).\n\nDesign/methodology/approach\n\nPreliminary data of this study have been extracted from Web of Science through scientometric methods. The references used in all the papers in the core journals in this field since 1980 to the end of 2014 were studied.\n\nFindings\n\nThe distribution of resources in the area of KM based on the publication year indicates that this field of study, during time intervals 1900 to 1980, has seen eight major mutations. A considerable influence of such fields as economics, business, social networks analysis, organizational learning and economic sociology on the realm of KM is evident. The association of Polanyi with the mutations of 1958, 1962 and 1967 suggests his obvious influence on the evolution of KM. The ratio of articles to books among the whole documents detected by RPYS was 2-13 which could direct us to the point that the channel for information transformation in KM is more focused on books than on articles.\n\nOriginality/value\n\nNone of the few studies done by scientometric methods in the realm of KM has been seen through the issue of the historical origins of this area. This piece of research, using a new scientometric method, can be considered the first study in which the origins of KM over time have been studied.","authors":["Ali Akbar Khasseh","Reza Mokhtarpour"],"meta":["November 2016Journal of Knowledge Management 20(6):1393-1404","DOI:10.1108/JKM-01-2016-0019"],"references":["287198790_Historical_Origins_of_Information_Behavior_Research_by_Reference_Publication_Year_Spectroscopy","277883137_MANAGEMENT_INFORMATION_SYSTEMS_ISSUES_CO-CITATION_ANALYSIS_OF_JOURNAL_ARTICLES","271285607_Study_on_Knowledge_Sharing_of_Community_of_Practice_Based_on_Social_Network_Perspective","347514471_The_Concept_of_Mind_Gilbert_Ryle_Hutchinson's_University_Library_London_1949_Pp_334_12s_6d","313140304_Organizational_learning_The_contributing_processes_and_literatures","303364166_Towards_a_model_of_organizations_as_interpretive_systems","283378930_The_Tacit_Dimension","276542478_Detecting_seminal_research_contributions_to_the_development_and_use_of_the_global_positioning_system_by_reference_publication_year_spectroscopy","276193201_Organizations_in_Action_Social_Science_Bases_of_Administrative_Theory","274736822_Compressing_multiple_scales_of_impact_detection_by_Reference_Publication_Year_Spectroscopy"]}