{"id":"309284574_Using_Software_in_Qualitative_Research_A_Step-by-Step_Guide","abstract":"In illustrating examples of software use in different contexts through three distinct case-study\nexamples we hope to paint a picture of some common aspects of analysis in the context of\nsoftware tools so that you can draw out ideas about what might be useful in your own particular\nresearch. We understand that your choice of software may be limited within the constraints of\nlocal provision, but our purpose is to enable ambitious yet secure use of any CAQDAS package and\nthe moulding of its functions to your needs, while also adding to your awareness of what other\ntools work well for particular contexts. We believe that a broad understanding of software packages\nother than the one you happen to be using will open up your thinking about your own work.\nAbove all, we see ourselves as ‘facilitators’ rather than ‘instructors’. The way we teach is\ninformed by the belief that you are the expert about your project and your needs. We can show\nyou tools, illustrate their benefits and caution against their potential limitations. We can make\nsuggestions about their suitability (or not) for different approaches to data analysis. But you need\nto decide whether to use software at all – and if so, then which package. If you decide not to use\nsoftware then you need to be able to justify this. If you decide to use software, you need to design\na strategy for doing so within the parameters of your broader methodological context, specific\nanalytic needs and any practical constraints within which you are working.\nWe hope this book will provide you with the context you need to frame your thinking about\nsoftware, to give you insights into the way particular tools might be useful at various moments,\nand to heighten your reflection about the relationship between technology and methodology.\nMore than anything else, we hope this book will inspire you to explore your data to greater\ndepths, to experiment with software tools and to develop systematic and creative ways of conducting\nrobust and well-evidenced analysis.","authors":["Christina Silver","Ann Lewins"],"meta":["May 2014","Edition: 2ndPublisher: SageISBN: ISBN 978–1-4462–4973-4 (pbk)","Project: Five-Level QDA"],"references":[]}