{"id":"309207591_Structured_Sparse_Subspace_Clustering_A_Joint_Affinity_Learning_and_Subspace_Clustering_Framework","abstract":"Subspace clustering refers to the problem of segmenting data drawn from a union of subspaces. State of the art approaches for solving this problem follow a two-stage approach. In the first step, an affinity matrix is learned from the data using sparse or low-rank minimization techniques. In the second step, the segmentation is found by applying spectral clustering to this affinity. While this approach has led to state-of-the-art results in many applications, it is sub-optimal because it does not exploit the fact that the affinity and the segmentation depend on each other. In this paper, we propose a joint optimization framework --- Structured Sparse Subspace Clustering (S$^3$C) --- for learning both the affinity and the segmentation. The proposed S$^3$C framework is based on expressing each data point as a structured sparse linear combination of all other data points, where the structure is induced by a norm that depends on the unknown segmentation. Moreover, we extend the proposed S$^3$C framework into Constrained Structured Sparse Subspace Clustering (CS$^3$C) in which available partial side-information is incorporated into the stage of learning the affinity. We show that both the structured sparse representation and the segmentation can be found via a combination of an alternating direction method of multipliers with spectral clustering. Experiments on a synthetic data set, the Extended Yale B data set, the Hopkins 155 motion segmentation database, and three cancer data sets demonstrate the effectiveness of our approach.","authors":["Chun-Guang Li","Chong You","René Vidal"],"meta":["April 2017IEEE Transactions on Image Processing 26(6):2988-3001","DOI:10.1109/TIP.2017.2691557"],"references":["316282839_Subspace_Clustering_by_Mixture_of_Gaussian_Regression","316267522_Interdisciplinary_Applied_Mathematics","313487833_A_tutorial_on_spectral_clustering","313423378_Sparse_manifold_clustering_and_embedding","312726431_Navigating_gene_expression_using_microarrays-a_technology_review","311609394_Scalable_Sparse_Subspace_Clustering_by_Orthogonal_Matching_Pursuit","311586443_Noisy_Subspace_Clustering_via_Matching_Pursuits","309424782_A_Theoretical_Analysis_of_Noisy_Sparse_Subspace_Clustering_on_Dimensionality-Reduced_Data","308278474_ell_0_l_0_-Sparse_Subspace_Clustering","308277885_Person_Re-Identification_by_Unsupervised_ell_1_l_1_Graph_Learning"]}