{"id":"309214524_Does_digital_competence_and_occupational_setting_influence_MOOC_participation_Evidence_from_a_cross-course_survey","abstract":"While MOOCs are recognized nowadays as a potential format for professional development and lifelong learning, little research has been conducted on the factors that influence MOOC participation of professionals and unemployed in MOOCs. Based on a framework developed earlier, we conducted a study, which focused on the influence of background variables such us digital competence, age, gender and educational level on MOOC participation. Occupational setting was considered as a moderator in the analysis of the impact of digital skills. Results of the study showed that MOOCs were an important tool for unemployed participants who were more likely to enroll in MOOCs than employed learners. MOOCs were also a way for workers who do not received employer support for other training activities to get professional development training. Results of the regression analysis showed that a person’s level of digital competence was an important predictor for enrolment in MOOCs and that specifically interaction skills were more important than information skills for participating in the MOOC context.","authors":["Jonatan Castaño-Muñoz","Karel Kreijns","Marco Kalz","Yves Punie"],"meta":["October 2016Journal of Computing in Higher Education 29(1)","DOI:10.1007/s12528-016-9123-z"],"references":["290475072_HarvardX_and_MITx_Two_Years_of_Open_Online_Courses_Fall_2012-Summer_2014","283119808_Who_takes_MOOCs","272477362_Supporting_Professional_Learning_in_a_Massive_Open_Online_Course","319030263_Persistence_Patterns_in_Massive_Open_Online_Courses_MOOCs","308383524_IRRODL_Volume_15_Number_5","298971853_Lifelong_Learning_and_Its_Support_with_New_Technologies","293479059_Persistence_Patterns_in_Massive_Open_Online_Courses_MOOCs","289066201_Introduction_to_Mediation_Moderation_and_Conditional_Process_Analysis_A_Regression-Based_Approach","272306848_The_MOOC_Phenomenon_Who_Takes_Massive_Open_Online_Courses_and_Why","263227940_Predicting_and_Changing_Behavior_The_Reasoned_Action_Approach"]}