{"id":"309220896_Users_Views_on_Others_-_Analysis_of_Confused_Relation-Based_Terms_in_Social_Network","abstract":"Nowadays, online social networks are used everywhere. Thus, areas such as social network analysis or recommender systems are currently very important. Roles related to relations between users, concerning influential, trusted or popular individuals are known to be crucial in these areas. While the significance of such roles is undeniable, the terms connected to these roles are not precisely specified and generally confused. In this article, we focus on the roles of users connected to terms trust, reputation, influence and popularity in the scope of social network analysis and social recommendations. We analyze existing works using these roles in order to compare and contrast their interpretations. We emphasize the most important features that the definitions of these notions should include and make the comparative analysis of the most often confused terms: trust vs reputation, and influence vs popularity. We also present the notions global classification concerning their abstract level, define the terms and distinguish them from one another.","authors":["Monika Ewa Rakoczy","Amel Bouzeghoub","Katarzyna Maria Wegrzyn-Wolska","Alda Lopes Gançarski"],"meta":["October 2016","DOI:10.1007/978-3-319-48472-3_9","Conference: OTM Confederated International Conferences \"On the Move to Meaningful Internet Systems\""],"references":["287034045_Improving_social_recommendations_by_applying_a_personalized_item_clustering_policy","277334489_Finding_Influential_Bloggers","262273676_Identification_of_influential_social_networkers","301432440_A_Probabilistic_Model_for_Using_Social_Networks_in_Personalized_Item_Recommendation","295562601_Computational_models_of_trust_and_reputation_in_online_social_networks","287378049_Social_media_mining_An_introduction","273397376_Are_the_Popular_Users_Always_Important_for_Information_Dissemination_in_Online_Social_Networks","269298228_AgeTrust_A_New_Temporal_Trust-Based_Collaborative_Filtering_Approach","262203262_Trust-aware_Recommender_Systems","261859019_Trust_based_recommendation_systems"]}