{"id":"309274130_Adaptive_fusion_of_biometric_and_biographic_information_for_identity_de-duplication","abstract":"Use of biometrics for person identification has increased tremendously over the past decade, e.g., in large scale national identification programs, for law enforcement and border control applications, and social welfare initiatives. For such large scale applications with a diverse target population, unimodal biometric systems, which use a single biometric trait (e.g., fingerprints), are inadequate due to their limited capacity. Multimodal biometric systems, which fuse multiple biometric traits (e.g., fingerprints and face), are required for large-scale identification applications, e.g., de-duplication where the goal is to ensure that the same person does not have two different official credentials (e.g., national ID card) based on different credentials. While multimodal biometric systems offer several advantages (e.g., improvement in recognition accuracy, decrease in failure to enroll rate), they require large enrollment and de-duplication times. This paper proposes an adaptive sequential framework to automatically determine which subset of biometric traits and biographic information is adequate for de-duplication of a given query. An analysis of this strategy is presented on a virtual multi-biometric database of 27,000 subjects (fingerprints from NIST SD14 dataset and face images from the PCSO dataset) along with biographic information sampled from the US census data. Experimental results, using three-fold cross-validation, show that without any loss in de-duplication accuracy, on average, for 63.18% (of a total of 27,000) of the queries, only fingerprint capture is adequate, for an additional 28.69% of queries, both fingerprint and face are required, and only 8.13% of the queries needed biographic information in addition to fingerprint and face.","authors":["Prem Sewak Sudhish","Anil K. Jain","Kai Cao"],"meta":["October 2016Pattern Recognition Letters 84","DOI:10.1016/j.patrec.2016.10.011"],"references":["260584640_Future_Trends_in_Biometric_Processing","224378047_Bootstrap_Techniques_for_Error_Estimation","220419649_Multibiometric_Systems","3297646_Duplicate_Record_Detection_A_Survey","273394311_Latent_Fingerprint_Matching_Performance_Gain_via_Feedback_from_Exemplar_Prints","220424167_A_Technique_for_Computer_Detection_and_Correction_of_Spelling_Errors","3454134_Adaptive_Name_Matching_in_Information_Integration"]}