{"id":"309296572_AMCloud_Toward_a_Secure_Autonomic_Mobile_Ad_Hoc_Cloud_Computing_System","abstract":"Cloud computing is a revolutionary paradigm to deliver computing resources, ranging from data storage/processing to software, as a service over the network, with the benefits of efficient resource utilization and improved manageability. The current popular cloud computing models encompass a cluster of expensive and dedicated machines to provide cloud computing services, incurring significant investment in capital outlay and ongoing costs. A more cost effective solution would be to exploit the capabilities of an ad hoc cloud which consists of a cloud of distributed and dynamically untapped local resources. The ad hoc cloud can be further classified into static and mobile clouds: an ad hoc static cloud harnesses the underutilized computing resources of general purpose machines, whereas an ad hoc mobile cloud harnesses the idle computing resources of mobile devices. However, the dynamic and distributed characteristics of ad hoc cloud introduce challenges in system management. In this article, we propose a generic em autonomic mobile cloud (AMCloud) management framework for automatic and efficient service/resource management of ad hoc cloud in both static and mobile modes. We then discuss in detail the possible security and privacy issues in ad hoc cloud computing. A general security architecture is developed to facilitate the study of prevention and defense approaches toward a secure autonomic cloud system. This article is expected to be useful for exploring future research activities to achieve an autonomic and secure ad hoc cloud computing system.","authors":["Devu M Shila","Wenlong Shen","Yu Cheng","Xiaohua Tian"],"meta":["October 2016IEEE Wireless Communications PP(99):2-9","DOI:10.1109/MWC.2016.1500119RP"],"references":["279160662_Enabling_Adaptive_High-Frame-Rate_Video_Streaming_in_Mobile_Cloud_Gaming_Applications","270793820_Uncertainty-Aware_Autonomic_Resource_Provisioning_for_Mobile_Cloud_Computing","270684607_CometCloud_Enabling_Software-Defined_Federations_for_End-to-End_Application_Workflows","266798619_Secure_Key_Establishment_for_Device-to-Device_Communications","262251377_Secure_cloud_computing_with_a_virtualized_network_infrastructure","220328028_Adaptation_of_Reputation_Management_Systems_to_Dynamic_Network_Conditions_in_Ad_Hoc_Networks","3282731_Securing_Ad_Hoc_Networks","274644822_A_Distributed_Secure_Outsourcing_Scheme_for_Solving_Linear_Algebraic_Equations_in_Ad_Hoc_Clouds","262283716_Security_and_privacy_for_storage_and_computation_in_cloud_computing","257013848_Mobile_Cloud_Computing_A_survey","224250177_Game-Theoretic_Analysis_of_Cooperation_Incentive_Strategies_in_Mobile_Ad_Hoc_Networks","220195477_A_Break_in_the_Clouds_Towards_a_Cloud_Definition","45903077_An_Approach_to_Ad_hoc_Cloud_Computing","3200334_Toward_an_Autonomic_Service_Management_Framework_A_Holistic_Vision_of_SOA_AON_and_Autonomic_Computing"]}