{"id":"309254724_Social_Networking_Data_Analysis_Tools_Challenges","abstract":"Online Social Network’s (OSN) considered a spark that burst the Big Data era. The unfolding of every event, breaking new or trend flows in real time inside OSN triggering a surge of opinionated networked content. An unprecedented scale of social relationships also diffuses across this vastly interconnected system affecting public behaviors and knowledge construction. Extracting intelligence from such data has becoming a quickly widening multidisciplinary area that demands the synergy of scientific tools and expertise. Key analysis practices include social network analysis, sentiment analysis, trend analysis and collaborative recommendation. Though, both their recent advent and the fact that science is still in the frontiers of processing human-generated data, provokes the need for an update and comprehensible taxonomy of the related research. In response to this chaotic emerging science of social data, this paper provides a sophisticated classification of state-of the-art frameworks considering the diversity of practices, methods and techniques. To the best of our knowledge, this is the first attempt that illustrated the entire spectrum of social data networking analysis and their associated frameworks. The survey demonstrates challenges and future directions with a focus on text mining and the promising avenue of computational intelligence.\n\nKeywords: Computational Intelligence, Sentiment analysis, Topic detection, Social Network Analysis, Collaborative Recommendation, Online Social Networks.","authors":["Anni Sapountzi","Kostas E. Psannis"],"meta":["October 2016Future Generation Computer Systems 86(04)","DOI:10.1016/j.future.2016.10.019"],"references":["327514453_Auditing_Defense_Against_XSS_Worms_in_Online_Social_Network-Based_Web_Applications","321940476_Software_for_Graph_Analysis_and_Visualization","315074708_A_Semantic_Approach_for_News_Recommendation","305343147_Visual_Cortex_Inspired_CNN_Model_for_Feature_Construction_in_Text_Analysis","305334406_SemEval-2016_Task_4_Sentiment_Analysis_in_Twitter","316637976_Analyzing_Social_Media_Networks_With_NodeXL","316238167_Guide_to_tools_for_social_media_web_analytics_and_insights","314050114_Introduction","309074560_Scoring_term_weighting_and_the_vector_space_model","304747384_Detecting_Events_in_Online_Social_Networks_Definitions_Trends_and_Challenges"]}