{"id":"309264091_Reliability_and_Energy_Efficiency_Enhancement_in_Wireless_Body_Area_Networks_for_E-Health","abstract":"Wireless Body Area Network (WBAN) is a technology that revolutionises our understanding of the future digitised healthcare systems. WBAN has unique challenges and features compared to other wireless sensor networks. In addition to battery power consumption, the vulnerability and the unpredicted channel behaviour make channel access a serious problem to solve. Time Division Multiple Access (TDMA) Medium Access Control (MAC) protocols can help in achieving a reliable and energy efficient WBAN. IEEE 802.15.4 provides TDMA based mechanisms to save energy consumption. However, both contention-free and inactive periods are static and do not consider channel status or nodes reliability requirements. Hence, this paper presents two IEEE 802.15.4 TDMA based techniques to improve WBAN reliability and energy efficiency. The first technique allows nodes to avoid channel deep fade by distributing adaptively their sleep period during their active period according to their channel status. Thereafter, in the second technique, nodes are dynamically allocated time slots according to their requirements, which depend on their link’s status. The proposed techniques are evaluated over various traffic rates and their performances are compared with the legacy IEEE 802.15.4 MAC. Results revealed that the proposed techniques have the potential in improving WBAN reliability while reducing energy consumption.","authors":["Marwa Salayma","Ahmed Yassin Al-Dubai","Imed Romdhani"],"meta":["November 2016","DOI:10.23919/FRUCT.2016.7892202","Conference: The 19th conference of the Open Innovations Association FRUCTAt: Jyväskylä, Finland"],"references":["276836080_Balancing_Long_Lifetime_and_Satisfying_Fairness_in_WBAN_Using_a_Constrained_Markov_Decision_Process","263164975_Research_Trends_in_Wireless_Body_Area_Networks_From_On-Body_to_Body-to-Body_Cooperation","259005723_Wireless_Body_Area_Networks_A_Survey","254463823_Impact_of_Wireless_Channel_Temporal_Variation_on_MAC_Design_for_Body_Area_Networks","242712090_ZigBeeIEEE_802154_Summary","238523850_CA-MAC_A_Hybrid_context-aware_MAC_protocol_for_wireless_body_area_networks","233828497_Variable_Scheduling_to_Mitigate_Channel_Losses_in_Energy-Efficient_Body_Area_Networks","260657286_Context_aware_and_channel-based_resource_allocation_for_wireless_body_area_networks","254059006_Challenges_in_Body_Area_Networks_for_Healthcare_The_MAC","254005146_Contention_vs_polling_A_study_in_body_area_networks_MAC_design"]}