{"id":"309263986_Tokenizer_Adapted_for_the_Nasa_Yuwe_Language","abstract":"In Colombia, ethnic and cultural diversity is conceived by the government to be a social right. Such diversity finds expression, among other ways, in a large number of indigenous languages, which have been kept alive for centuries. However, efforts toward conservation and preservation of these languages have generally fallen short. This is the case for the Nasa Yuwe language, spoken by the Nasa, or Páez, indigenous community, the status of which is endangered. Given such a predicament, the use of technology has been found to provide a strategic opportunity for adaptation, ownership, and development of Nasa Yuwe within the social and cultural environment of the Nasa people. The technology includes the use of computational techniques, which allow the exchange of information by means of IR activities. These encourage different, new possibilities for the Nasa people to be able to interact in Nasa Yuwe. It has therefore become necessary to adapt the stages of the IR process to this language. The current paper specifically presents a process for adapting a tokenizer to texts written in Nasa Yuwe. This involves making use of the precision-recall curve as an evaluation and comparison measure. The results presented allow appreciation of all stages in the process of adapting the standard tokenizer to produce the Nasa version, of the Nasa tokenizer and its results over texts written in Nasa Yuwe, and of the analysis of the precision-recall curve baseline in contrast to that of the Nasa tokenizer.","authors":["Luz Marina Sierra Martínez","Carlos Cobos","Juan Carlos Corrales"],"meta":["September 2016Computacion y Sistemas 20(3):355-364","DOI:10.13053/CyS-20-3-2455"],"references":["275035869_Building_a_Nasa_Yuwe_Language_Test_Collection","263556007_Monolingual_Document_Retrieval_for_European_Languages_Special_Issue_on_CLEF","249962298_Implementation_of_vector-space_online_document_retrieval_system_using_open_source_technology","302251237_Research_of_Information_Search_Engine_in_Forestry_Based_on_the_Lucene","301178717_Within-Language_Information_Retrieval","291603806_Linguistic_Processing_for_Speech_Synthesis","277981483_Exploring_and_exploiting_a_historical_corpus_for_Arabic","261023249_ARGOsearch_An_Information_Retrieval_System_Based_on_Text_Similarity_and_Extensible_Relevance_Criteria","257909659_Methods_and_algorithms_for_automatic_text_analysis","226570674_Light_Stemming_for_Arabic_Information_Retrieval"]}