{"id":"309207397_Shortcuts_to_quantum_network_routing","abstract":"A quantum network promises to enable long distance quantum communication, and assemble small quantum devices into a large quantum computing cluster. Each network node can thereby be seen as a small few qubit quantum computer. Qubits can be sent over direct physical links connecting nearby quantum nodes, or by means of teleportation over pre-established entanglement amongst distant network nodes. Such pre-shared entanglement effectively forms a shortcut - a virtual quantum link - which can be used exactly once. Here, we present an abstraction of a quantum network that allows ideas from computer science to be applied to the problem of routing qubits, and manage entanglement in the network. Specifically, we consider a scenario in which each quantum network node can create EPR pairs with its immediate neighbours over a physical connection, and perform entanglement swapping operations in order to create long distance virtual quantum links. We proceed to discuss the features unique to quantum networks, which call for the development of new routing techniques. As an example, we present two simple hierarchical routing schemes for a quantum network of N nodes for a ring and sphere topology. For these topologies we present efficient routing algorithms requiring O(log N) qubits to be stored at each network node, O(polylog N) time and space to perform routing decisions, and O(log N) timesteps to replenish the virtual quantum links in a model of entanglement generation.","authors":["Eddie Schoute","Laura Mancinska","Tanvirul Islam","Iordanis Kerenidis"],"meta":["October 2016"],"references":["303555840_Large-scale_quantum_networks_based_on_graphs","301875001_Robust_Quantum-Network_Memory_Using_Decoherence-Protected_Subspaces_of_Nuclear_Spins","319394683_Computer_networks","312685110_Quantum_cryptography_based_on_Bell's_theorem","308801656_Quantum_Fingerprinting","306116306_Quantum_capacities_for_entanglement_networks","305043725_Internet_protocol_specification","303750055_Aggregating_quantum_repeaters_for_the_quantum_internet","303545350_Quantum_Router_with_Network_Coding","296171686_Quantum_Entanglement_Percolation"]}