{"id":"309334016_Problemcase-based_learning_with_competition_introduced_in_severe_infection_education_an_exploratory_study","abstract":"Background\nProblem/case-based learning (PCBL) is one of the most commonly used educational methods in medical schools. AimTo further improve PCBL in clinical course of severe infection by introducing competition mode. Methods\nTwo classes of medical students were divided into two groups by class-based simple randomization and were taught the course of severe infection by PCBL. A team-based competition was introduced in the study group (n = 35) while not in the control group (n = 36). After the course, four closely associated references were recommended. All the students were notified about a group consultation on a similar case. In the final examination, a case with severe infection complicated with infectious shock was presented for the students to analyze and resolve listed questions. Their performances were qualitatively evaluated to justify the effectiveness of the competition-based PCBL. ResultsThe students in the study group were more active and initiative in case discussion and interaction, in referring to case-related articles and attending clinical group-consultation. They had better performance in the case analysis in the final examination. The typical case analysis test easily figured out more excellent students in the study group. Conclusions\nThe PCBL with competition mode introduced in is an effective approach to guide students to fully understand the clinical diagnoses and treatment of severe infection. It also prompts medical students’ initiative in referring to case-related articles and attending group-consultation, both of which are essential to equip medical students with sufficient competency for clinical practice.","authors":["Jian-Hua Lei","Yi-Jing Guo","Zi Chen","Yao-Yan Qiu"],"meta":["December 2016SpringerPlus 5(1)","DOI:10.1186/s40064-016-3532-3"],"references":["320945490_Case-Based_Learning_A_Formal_Approach_to_Generate_Health_Case_Studies_from_Electronic_Healthcare_Records","303929245_Comparison_of_the_problem_based_learning-driven_with_the_traditional_didactic-lecture-based_curricula","281342507_Problem_based_learning_PBL_vs_Case_based_curriculum_in_clinical_clerkship_Internal_Medicine_innovated_Curriculum_Student_prospective","277694243_Critical_Thinking_in_Graduate_Medical_Education","267340566_Case-Based_Learning_and_Simulation_Useful_Tools_to_Enhance_Nurses'_Education_Nonrandomized_Controlled_Trial","313667086_Problem-based_learning","301549553_Case-Based_Learning_A_Formal_Approach_to_Generate_Health_Case_Studies_from_Electronic_Healthcare_Records","296335700_Problem-Based_Learning_as_an_Effective_Learning_Tool_in_Community_Medicine_Initiative_in_a_Private_Medical_College_of_a_Developing_Country","293636642_A_randomized_controlled_trial_of_team-based_competition_to_increase_learner_participation_in_quality-improvement_education","292254140_Problem-based_learning_and_performance-based_testing_Effective_alternatives_for_undergraduate_surgical_education_and_assessment_of_student_performance"]}