{"id":"309333026_Sorted_self-similarity_for_multi-modal_image_registration","abstract":"In medical image analysis, registration of multimodal images has been challenging due to the complex intensity relationship between images. Classical multi-modal registration approaches evaluate the degree of the alignment by measuring the statistical dependency of the intensity values between images to be aligned. Employing statistical similarity measures, such as mutual information, is not promising in those cases with complex and spatially dependent intensity relations. A new similarity measure is proposed based on the assessing the similarity of pixels within an image, based on the idea that similar structures in an image are more probable to undergo similar intensity transformations. The most significant pixel similarity values are considered to transmit the most significant self-similarity information. The proposed method is employed in a framework to register different modalities of real brain scans and the performance of the method is compared to the conventional multi-modal registration approach. Quantitative evaluation of the method demonstrates the better registration accuracy in both rigid and non-rigid deformations.","authors":["Keyvan Kasiri","Paul Fieguth","David Clausi"],"meta":["August 2016Conference proceedings: ... Annual International Conference of the IEEE Engineering in Medicine and Biology Society. IEEE Engineering in Medicine and Biology Society. Conference 2016:1151-1154","DOI:10.1109/EMBC.2016.7590908","Conference: 2016 38th Annual International Conference of the IEEE Engineering in Medicine and Biology Society (EMBC)"],"references":["8055471_Non-rigid_image_registration_Theory_and_practice","6204125_Nonrigid_Image_Registration_Using_Conditional_Mutual_Information","4156453_A_non-local_algorithm_for_image_denoising","3221974_Deformation-based_mapping_of_volume_change_from_serial_brain_MRI_in_the_presence_of_local_tissue_contrast_change","3220949_Nonrigid_Registration_Using_Free-Form_Deformations_Application_to_Breast_MR_Images","307515841_Self-similarity_measure_for_multi-modal_image_registration","260527358_Nonrigid_Registration_of_Ultrasound_and_MRI_Using_Contextual_Conditioned_Mutual_Information","239665902_Non-rigid_registration_using_higher-order_mutual_information","234049039_Lecture_Notes_in_Computer_Science","227856606_MIND_Modality_Independent_Neighbourhood_Descriptor_for_Multi-Modal_Deformable_Registration","13414374_Multi-modal_volume_registration_by_maximization_of_mutual_information","5357912_Automatic_segmentation_of_the_prostate_in_3D_MR_images_by_atlas_matching_using_localized_mutual_information"]}