{"id":"309388104_Survey_on_Misbehavior_Detection_in_Cooperative_Intelligent_Transportation_Systems","abstract":"Cooperative Intelligent Transportation Systems (cITS) are a promising technology to enhance driving safety and efficiency. Vehicles communicate wirelessly with other vehicles and infrastructure, thereby creating a highly dynamic and heterogeneously managed ad-hoc network. It is these network properties that make it a challenging task to protect integrity of the data and guarantee its correctness. A major component is the problem that traditional security mechanisms like PKI-based asymmetric cryptography only exclude outsider attackers that do not possess key material. However, because attackers can be insiders within the network (i.e., possess valid key material), this approach cannot detect all possible attacks. In this survey, we present misbehavior detection mechanisms that can detect such insider attacks based on attacker behavior and information analysis. In contrast to well-known intrusion detection for classical IT systems, these misbehavior detection mechanisms analyze information semantics to detect attacks, which aligns better with highly application-tailored communication protocols foreseen for cITS. In our survey, we provide an extensive introduction to the cITS ecosystem and discuss shortcomings of PKI-based security. We derive and discuss a classification for misbehavior detection mechanisms, provide an in-depth overview of seminal papers on the topic, and highlight open issues and possible future research trends.","authors":["Rens Wouter van der Heijden","Stefan Dietzel","Tim Leinmüller","Frank Kargl"],"meta":["October 2016IEEE Communications Surveys & Tutorials 21(1)","DOI:10.1109/COMST.2018.2873088","Project: Maat - Misbehavior detection framework for CPS"],"references":["316530660_String_Stability_Analysis_of_Cooperative_Adaptive_Cruise_Control_under_Jamming_Attacks","315472658_A_Data_Traffic_Steering_Algorithm_for_IEEE_80211pLTE_Hybrid_Vehicular_Networks","315442997_MIMO_HetNet_IEEE_80211p_-_LTE_deployment_in_a_vehicular_urban_environment","315439003_A_Survey_of_Attacks_and_Detection_Mechanisms_on_Intelligent_Transportation_Systems_VANETs_and_IoV","313329204_Security_Privacy_and_Safety_Aspects_of_Civilian_Drones_A_Survey","321999326_A_data_trust_framework_for_VANETs_enabling_false_data_detection_and_secure_vehicle_tracking","319590333_Distributed_consensus-based_Sybil_nodes_detection_in_VANETs","317244549_Security_and_Privacy_in_Cyber-Physical_Systems_A_Survey_of_Surveys","315757464_A_Hierarchical_Detection_and_Response_System_to_Enhance_Security_Against_Lethal_Cyber-Attacks_in_UAV_Networks","313016541_VANET_Security_Challenges_and_Solutions_A_Survey"]}