{"id":"309375962_Player_Behavior_Modeling_for_Interactive_Storytelling_in_Games","abstract":"Video games add new dimensions to traditional storytelling by allowing players to change narratives through their own actions. In modern Role-Playing Games (RPGs), this is usually done by adopting branching storylines based on key choices presented to players at certain points of the game. However, such branching points are usually presented through specific dialog choices or predetermined actions, which reduces the player's sense of agency. Currently, both game industry and game consumers have great interest in new forms of interactive storytelling that may provide games with truly interactive stories, in which all in-game player's actions and behaviors can affect the development of the narrative. In this paper, we explore the combination of player modeling and narrative generation techniques. We propose a novel approach for interactive storytelling in games based on player behavior modeling, hierarchical task decomposition and nondeterministic planning. The proposed method is capable of generating dynamic and nondeterministic quests that are directly or indirectly affected by in-game player behavior, which is modeled in terms of the Big Five factors. The main objective of this paper is to present this method and to validate its precision and real-time performance on highly interactive game environments.","authors":["Edirlei Soares de Lima","Bruno Feijó","Antonio L. Furtado"],"meta":["September 2016","Conference: XV Brazilian Symposium on Computer Games and Digital Entertainment (SBGames 2016)At: São Paulo, Brazil"],"references":["286454232_Hierarchical_Generation_of_Dynamic_and_Nondeterministic_Quests_in_Games","266521217_Meta-synthesis_of_player_typologies","261498768_Games_as_personality_profiling_tools","247190693_Hearts_clubs_diamonds_spades_Players_who_suit_MUDs","291421753_Towards_a_system_of_customized_video_game_mechanics_based_on_player_personality_Relating_the_Big_Five_personality_traits_with_difficulty_adaptation","285710355_Automated_Planning_and_Player_Modeling_for_Interactive_Storytelling","280915654_A_survey_on_multi-output_regression","261280665_A_binary_classification_approach_for_automatic_preference_modeling_of_virtual_agents_in_Civilization_IV","257708505_Player_behavioural_modelling_for_video_games","247408295_Professional_Manual_of_the_Revised_NEO_Personality_Inventory_and_NEO_Five-Factor_Inventory"]}