{"id":"309393331_Monthly_Weather_Forecasting_through_ANN_Model_A_Case_Study_in_Barisal_Bangladesh","abstract":"Bangladesh demonstrates seasonal alterations with six seasons where natural calamities cause tragic death of lives and severe hazardous in Bangladesh regularly and frequently. It is difficult to predict the weather pattern because of non-linear characteristics of natural disaster and seasonal changes in the country. The conventional weather prediction models are conducting in a huge domain and high resolution in Bangladesh which is constraint to show reliable seasonal disaster predictions. The research uses a methodology that considers specific and significant weather parameters from meteorological data in MATLAB platform to train the ANN based model. This paper includes a case study on prediction of heavy rainfall in Barisal City of Bangladesh using the model of artificial neural network (ANN) for monthly basis reliable weather forecasting planning. The model has been tested with individual month's average rainfall percentage to obtain the confirmation of the model. The results based on mean square error function (MSE) confirm the reliability of model based on multilayer perceptions for weather forecasting with successful application. The results are compared with weather information of FORECA limited to validate the seasonal disaster prediction criteria. This paper is important for the preparedness of people about forthcoming disaster in Bangladesh.","authors":["S.M. Taohidul Islam","Sajal Saha","Ali Ahmed Evan","Nabonita Halder"],"meta":["June 2016IJARCCE 5(6):1-6","DOI:10.17148/IJARCCE.2016.5601"],"references":["283709207_On_the_Prediction_of_Average_Monsoon_Rainfall_in_Bangladesh_with_Artificial_Neural_Network","275541596_A_Fuzzy-neuro_based_Weather_Prediction_System_for_Bangladesh","260739937_A_rainfall_prediction_model_using_artificial_neural_network","229351763_Impact_of_costal_embankment_on_the_flash_flood_in_Bangladesh_A_case_study","332681457_Maximum_Daily_Rainfall_Simulation_by_using_Artificial_Neural_Network_Case_Study_Saravan-Iran","306548606_A_Survey_on_rainfall_prediction_using_Artificial_Neural_Network","274175234_Time_Series_ANN_Approach_for_Weather_Forecasting","258650332_A_Neural_Network_Approach_to_Estimate_Tropical_Cyclone_Heat_Potential_in_the_Indian_Ocean","238504119_Tropical_cyclone_track_forecasting_techniques_-_A_review","235304443_Disaster_in_Bangladesh_and_management_with_advanced_information_system"]}