{"id":"309320487_Isn't_it_scandal_if_not_fraud_if_scientists_feel_repugnant_when_requested_to_not_violate_the_scientific_method_for_acquire_theoretical_knowledge","abstract":"In case of scientific research for expanding the boundaries of scientific or theoretical knowledge, mankind led to believe that any Truth (backed by irrefutable proof and evidence) is ultimate and always triumphs over myths, beliefs, unproven theories or axiomatic assumptions. In other words, if the science is a religion, then the only God for the religion of science is the Truth. Any Truth (backed by irrefutable proof and evidence) always triumphs over evil (i.e. flawed myths, beliefs, prejudice, theories or axiomatic assumptions, if evidence can be produced to prove that they are flawed). Everyone in the 21st century led to believe that anyone can freely express, say or debate (without fear of personal attacks, being humiliated or persecution) (1) any scientific truth openly (as long as the Truth can be backed by irrefutable proof and evidence) or (2) falsify any accepter theory or concept to remove it from the BoK (Body of Knowledge) by openly demonstrating evidence. Unfortunately, this is not always true and many of us have been fooled. Many respected scientists publicly say Truth (if it backed by irrefutable proof and evidence) always triumphs, but the very respected scientists refuse to investigate the irrefutable proof and evidence (if it contradicts their myths and/or prejudice). Even if one politely requests them to back their myths and prejudice, many of them resort to personal attacks or humiliating snubbing. The situation in our beloved computer science (software) is so bad that young researchers are scared to openly support Truth or evidence that expose existing flawed myths or prejudice promoted by respected scientists, due of the fear of being ostracized and/or ruining career. Should we live in fear underground like criminals or organize resistance to over through existing regime of fake scientists? Isn’t it (i.e. derailing scientific or technological progress) a scandal, if not fraud against progress of mankind?","authors":["Raju Chiluvuri"],"meta":["October 2016","Project: My effort is targeted at transforming computer science into real hard science. I am searching for real scientists who would like to join me in this noble effort."],"references":[]}