{"id":"309303576_Open_Source_Laboratory_Sample_Rotator_Mixer_and_Shaker","abstract":"An open-source 3-D printable laboratory sample rotator mixer is developed here in two variants that allow users to opt for the level of functionality, cost saving and associated complexity needed in their laboratories. First, a laboratory sample rotator is designed and demonstrated that can be used for tumbling as well as gentle mixing of samples in a variety of tube sizes by mixing them horizontally, vertically, or any position in between. Changing the mixing angle is fast and convenient and requires no tools. This device is battery powered and can be easily transported to operate in various locations in a lab including desktops, benches, clean hoods, chemical hoods, cold rooms, glove boxes, incubators or biological hoods. Second, an on-board Arduino-based microcontroller is incorporated that adds the functionality of a laboratory sample shaker. These devices can be customized both mechanically and functionally as the user can simply select the operation mode on the switch or alter the code to perform custom experiments. The open source laboratory sample rotator mixer can be built by non-specialists for under US$30 and adding shaking functionality can be done for under $20 more. Thus, these open source devices are technically superior to the proprietary commercial equipment available on the market while saving over 90% of the costs.","authors":["Karankumar C. Dhankani","Joshua M Pearce"],"meta":["October 2016HardwareX 1(C)","DOI:10.1016/j.ohx.2016.07.001"],"references":["325410423_Strength_and_porosity_of_additively_manufactured_PLA_using_a_low_cost_3D_printing","307442756_Free_and_Open-Source_Automated_3-D_Microscope","290443648_Open-Source_3-D_Platform_for_Low-Cost_Scientific_Instrument_Ecosystem","290443484_Open-Source_Wax_RepRap_3-D_Printer_for_Rapid_Prototyping_Paper-Based_Microfluidics","283985639_The_Effects_of_PLA_Color_on_Material_Properties_of_3-D_Printed_Components","282454528_Open_source_and_DIY_hardware_for_DNA_nanotechnology_labs","282397422_Multi-material_additive_and_subtractive_prosumer_digital_fabrication_with_a_free_and_open-source_convertible_delta_RepRap_3-D_printer","309310783_A_low-cost_mirror_mount_control_system_for_optics_setups","291293162_3D_printing_and_humanity's_first_imperfect_replicator","285224842_Arduino_for_Robotics"]}