{"id":"309358763_SIP_and_SDP_based_content_adaptation_during_real-time_video_streaming_in_Future_Internets","abstract":"Future Internet technology supports content adaptation to improve the QoS / QoE in a heterogeneous environment. The adaptation process removes partial data to meet either receiver capability or network capability. The process of adaptation is efficient when it is performed in the network rather than in the sender side or receiver end. In-network adaptation is performed by intelligent intermediate devices, which implement Content Aware Network and Content Centric Network, to process the contents. The adaptation decision taking module requires prior knowledge about end devices, network capacity and content's meta-data to decide the extraction points. This paper proposes a model to signal the terminal, network and media capabilities with the intermediate devices. The proposed model reduces the number of messages exchanged between end devices, intermediate devices and media server during session creation. Additionally, this method proposes a way to signal network dynamics such as change in bandwidth and buffer space with the intermediate devices to improve the video quality with the available resources. The proposed session signaling scheme is developed by extending traditional Session Initiation Protocol and Session Description Protocol and tested for suitability using virtual networking environment.","authors":["Ramakrishna Mundugar","Karunakar A K"],"meta":["October 2017Multimedia Tools and Applications 76(20):1-21","DOI:10.1007/s11042-016-4017-7","Projects: DISTRO - Distributed 3D Object DesignMulticast Video Streaming over Software Defined Network"],"references":["311675974_Signaling_Media_Decoding_Dependency_in_the_Session_Description_Protocol_SDP","273391802_Adaptive_Multimedia_Streaming_in_Information-Centric_Networks","258375334_A_Semantic_Context_Exchange_Process_for_the_Federated_Management_of_the_Future_Internet","258374958_Federated_management_of_the_Future_Internet_Status_and_challenges","258374826_Federated_and_Autonomic_Management_of_Multimedia_Services","300243784_Design_of_Communication_Architecture_to_Support_Stream_Data_over_Content-centric_Networking","293149195_Introduction_to_MPEG-21","288805914_Using_In-Network_Adaptation_to_Tackle_Inefficiencies_Caused_by_DASH_in_Information-Centric_Networks","261232179_Efficient_personalized_scalable_video_adaptation_decision-taking_engine_based_on_MPEG-21","259520945_An_agent-based_approach_for_the_design_and_analysis_of_content_delivery_networks"]}