{"id":"309360141_The_producer-consumer_classification_gap_and_its_effects_on_music_festival_success","abstract":"Purpose\nProducers and consumers – who represent opposing sides of the market – have different frames of reference, which may result in differences in classification of the same products. The authors aim to demonstrate that “classification gaps” have a negative effect on the performance of products and that these effects play a role in different stages of consumers’ decision process.\n\nDesign/methodology/approach\nThe data collection consisted of three comprehensive parts covering production and consumption in the music festival market in The Netherlands. The first part focused on festival organizers who were asked to classify their own music festival in terms of musical genres. In total, 70 festival organizers agreed to participate. The second part measured the genre classification of 540 consumers. In the third part, the authors interviewed 1,554 potential visitors of music festivals in The Netherlands about their awareness of the festival and if they considered visiting or actually visited the festival.\n\nFindings\nThis paper provides empirical evidence that a classification gap between the production side and the consumption side of the market has negative effects on music festival performance. In addition, the authors found that this is in part because of lower activation of potential consumers in the marketplace.\n\nPractical implications\nAn important practical implication of this study is that – in general – producers should be aware that classification gaps can occur – even if they are sure about the classification of their products – and that this can have serious consequences. The category membership of products is often seen as a given, whereas it cannot be assumed that the classification perceived by different economic groups is the same – as demonstrated in this paper.\n\nOriginality/value\nThis paper demonstrates that a fundamental – but understudied – disconnect between the two opposing sides of the market (i.e. producers and consumers) regarding the classification of the same products can have negative effects on performance of these products.","authors":["Bram Kuijken","Mark A. A. M. Leenders","Nachoem M. Wijnberg","Gerda Gemser"],"meta":["September 2016European Journal of Marketing 50(9/10):1726-1745","DOI:10.1108/EJM-04-2015-0204"],"references":["328705390_Interactive_Home_Shopping_Consumer_Retailer_and_Manufacturer_Incentives_to_Participate_in_Electronic_Marketplaces","315716191_Generalizations_about_trust_in_marketing_channel_relationships_using_meta-analysis","282751113_The_Coevolution_of_Technologies_and_Categories_During_Industry_Emergence","329648042_The_Big_Book_of_Concepts","329450014_Customer-Oriented_Approaches_to_Identifying_Product-Markets","329448271_Sociocognitive_Dynamics_in_a_Product_Market","329445815_Development_and_Testing_of_a_Model_of_Consideration_Set_Composition","329261613_Memory_Factors_in_Consumer_Choice_A_Review","304444877_Choice_Set_Heterogeneity_and_The_Role_of_Advertising_An_Analysis_with_Micro_and_Macro_Data","289940355_Managing_Legitimacy_Strategic_and_Institutional_Approaches"]}