{"id":"309396821_Why_Gamification_Fails_in_Education_and_How_to_Make_It_Successful_Introducing_Nine_Gamification_Heuristics_Based_on_Self-Determination_Theory","abstract":"Gamification, a design technique that uses the motivational elements of games in other contexts, is increasingly looked at as a possible solution to the dropping levels of motivation observed in learners. However, previous research has presented mixed results as to the demonstration of whether gamification in education works or not. To better evaluate the potential of gamification, we argue that it is important to first focus on how gamification works. This chapter contributes to this discussion by asking three research questions, starting by specifying “What is gamification?” (Q1), to then revealing “How does gamification work?” (Q2). Looking at gamification from the perspective of Self-Determination Theory, we show that various types of motivation guide people’s behaviour differently, and point to the importance of basic psychological need satisfaction. Furthermore, the answers to our first two research questions will explain why adding game elements as external, meaningless regulations is likely to cause detrimental effects on learners’ intrinsic motivation. Finally, by cumulating these theory-informed in- sights, we address our last research question “How can gamification design be improved?” (Q3), and define 9 Gamification Heuristics that account for (the inter- play between) design, context and user characteristics. As such, this chapter forms a guide for researchers, educators, designers and software developers in fostering a promising future generation of gamified systems that resonates our plea for theory-driven design.","authors":["Rob van Roy","Bieke Zaman"],"meta":["March 2017","DOI:10.1007/978-3-319-51645-5_22","In book: Serious Games and Edutainment Applications 2 (pp.485 - 509)Chapter: 22Publisher: Springer-VerlagEditors: Minhua Ma, Andreas Oikonomou","Project: Gamification in Education"],"references":["309050128_Engaging_Engineering_Students_with_Gamification","301659476_Moving_Beyond_the_Effectiveness_of_Gamification_Workshop_paper","283211242_Studying_Gamification_The_Effect_of_Rewards_and_Incentives_on_Motivation","318494438_Flow_the_psychology_of_optimal_experience","312470462_Practical_appropriate_empirically-validated_guidelines_for_designing_educational_games","304193490_Self-Determination_Theory","293486698_The_Paradox_of_Choice","289963001_Intrinsic_and_Extrinsic_Motivations_Classic_Definition_and_New_Directions","288919431_On_the_Effectiveness_of_Game-like_and_Social_Approaches_in_Learning_Comparing_Educational_Gaming_Gamification_Social_Networking","287068595_Beyond_designing_for_motivation_The_importance_of_context_in_gamification"]}