{"id":"309384225_Theoretical_analysis_and_experimental_investigations_on_the_symmetrical_three-roller_setting_round_process","abstract":"In this paper, a series of problems about the three-roller setting round process are studied. The theoretical analysis of increasing the roundness by three-roller bending is carried out, which shows that every pipe-wall segment alternately experiences multiple times of reciprocating bending, then the process mechanism of the three-roller setting round process is elaborated upon. It is proven by the mathematical induction method that the difference of the initial curvature of each pipe-wall segment can be eliminated and unified by multiple times of reciprocating bending. The experimental results show that with the increase of the upper roller reduction and the decrease of the elastic area ratio, the residual ovality of the pipe decreases gradually. When the elastic area ratio reaches about 20 %, the residual ovality can be controlled at around 0.35 %, which is far less than the requirement of American Petroleum Institute (API) standard. The quantitative relationships between the reduction and the curvature variation and the elastic area ratio are established, so the prediction of the reduction can be realized. However, in order to get the pipe of high precision, it is necessary to greatly increase the tonnage of a three-roller setting round device, which is an aspect that the setting round equipment manufacturers and pipe manufacturers need to notice. In addition, the residual ovality has nothing to do with the initial ovality and has little relation with the lower roller spacing, and it mainly depends on the elastic area ratio and the reasonable process parameters.","authors":["Yu Gaochao","Jun Zhao","Ruixue Zhai","Rui Ma"],"meta":["January 2018The International Journal of Advanced Manufacturing Technology 94(1-4)","DOI:10.1007/s00170-016-9610-4","Project: Springback Characteristics of Reciprocating Bending for Stable metal Materials and Engineering Application"],"references":["303531162_Development_of_a_cold_stamping_process_for_forming_single-welded_elbows","289584189_A_mechanical_model_of_symmetrical_three-roller_setting_round_process_The_static_bending_stage","283752126_An_analysis_of_forces_during_three_roller_bending_process","280647696_Experimental_analysis_of_an_asymmetrical_three-roll_bending_process","278722212_Precise_compression_and_setting_round_by_mold_for_large_pipes","265388483_Numerical_study_on_the_X80_UOE_pipe_forming_process","264769365_Analysis_of_the_asymmetrical_roll_bending_process_through_dynamic_FE_simulations_and_experimental_study","260835740_A_Refined_Model_of_Three-roller_Elastoplastic_Asymmetrical_Pre-bending_of_Plate","260212826_Prediction_and_control_of_springback_in_setting_round_process_for_pipe-end_of_large_pipe","259161479_Bending_force_prediction_for_dynamic_roll-bending_during_3-roller_conical_bending_process","257337530_Analytical_modeling_and_numerical_simulation_for_three-roll_bending_forming_of_sheet_metal","238492803_Springback_equation_of_small_curvature_plane_bending","248253027_Analytical_and_empirical_modeling_of_top_roller_position_for_three-roller_cylindrical_bending_of_plates_and_its_experimental_verification","248252981_FEM_dynamic_simulation_and_analysis_of_the_roll-bending_process_for_forming_a_conical_tube","245151833_Effects_of_the_UOEUOC_pipe_manufacturing_processes_on_pipe_collapse_pressure"]}