{"id":"309383997_Undergraduate_Students'_Beliefs_about_Engineering_Problem_Solving","abstract":"Problem solving is considered to be a central activity of engineering practice. While some studies have shown how various beliefs affect students' abilities to solve problems, studies are needed that explicitly examine the beliefs and assumptions students bring to the problem-solving process. The purpose of this qualitative research was to describe students' engineering problem-solving processes and develop a conceptual model that illustrates students' beliefs about problem solving. Our research question was, What beliefs do students have about engineering problem solving? We analyzed data from retrospective semistructured interviews carried out after a problem-solving session. We interviewed nine engineering students about the processes they used to solve the problems and the assumptions and beliefs that guided their problem solving. We then used grounded theory to identify and analyze statements from the interviews and to develop a conceptual model of student beliefs. The resulting model has five major categories: the problem-solving process itself, the role of classroom problems, the role of workplace problems, personal characteristics that affect problem solving, and resources that assist problem solving. Students identify a sharp distinction between classroom problems and workplace problems. Our conceptual model provides an initial framework for understanding how students' beliefs affect their approaches to engineering problems. In contrast to stage models, our model shows that students' epistemic beliefs about problem solving are contextual. Future work is needed to understand the limits and extend the applicability of our model.","authors":["Nathan J. McNeill","Elliot P. Douglas","Mirka Koro","David J Therriault"],"meta":["October 2016Journal of Engineering Education 105(4):560-584","DOI:10.1002/jee.20150","Project: Engineering Problem Solving"],"references":["275657360_Engineering_Design_Processes_A_Comparison_of_Students_and_Expert_Practitioners","344543528_Examining_the_Experiences_and_Perceptions_of_First-Year_Engineering_Students","341439115_Protocol_Analysis_Verbal_Reports_as_Data","318494264_Protocol_Analysis_Verbal_Reports_as_Data","317953719_Radical_Constructivism_A_Way_of_Knowing_and_Learning","288663071_Promoting_second-year_engineering_student's_epistemic_beliefs_and_real-world_problem-solving_abilities_though_case-based_e-learning_resources","285907359_Toward_a_general_theory_of_expertise_Prospects_and_limits","285540078_The_Role_of_Working_Memory_in_Problem_Solving","278667863_The_Sage_Dictionary_of_Qualitative_Inquiry","278004331_A_Qualitative_Study_of_Teachers'_Beliefs_and_Principles"]}