{"id":"309431178_An_interpolation-free_two-dimensional_conservative_ale_scheme_over_adaptive_unstructured_grids_for_rotorcraft_aerodynamics","abstract":"This thesis present a novel method for compressible gasdynamics for two-dimensional rotorcrafts applications. The arbitrary Lagrangian-Eulerian formulation of the Euler equations is solved within the finite-volume framework over adaptive grids. The modifications to the topology of the grid, resulting from the adaptation step, are locally interpreted in terms of continuous deformation of the finite volumes built around the nodes. This allows to compute the flow variable over the new grid by simply integrating the arbitrary Lagrangian-Eulerian formulation of the Euler equations, without any\nexplicit interpolation step.\n\nThe new, adapted, grids are obtained resorting to a suitable mix of mesh deformation, edge-swapping, node insertion and removal. The adaptation procedure is driven by a sensor that depends on both the geometry/configuration of the domain, i.e. the position of the boundaries at a give time, and the solution, e.g. error estimators based on the gradient or the Hessian matrix. A fixed-point approach to the adaptation problem in the unsteady case has been adopted, by iterating until both grid and solution have converged at each timestep. Both steady and unsteady simulations over adaptive grids are presented that demonstrate the validity of the proposed approach.\n\nThe adaptive scheme outlined above is used to tackle typical two-dimensional problems for rotorcraft blade sections, where mesh adaptation is of primary importance to perform efficient unsteady computations while highlighting relevant flow features, such as shocks, wakes or vortices. The developed adaptive scheme is used to carry out high-resolution computations over three selected problems of interest for rotorcraft aerodynamics: an oscillating airfoil, an impulsively started airfoil and parallel blade-vortex interaction.\n\nThe material used to compile this thesis has been produced during the course of the Ph.D. research at Politecnico di Milano. Part of this material has been already published in refereed international journals [60, 74, 76] and presented at scientific conferences [89, 93, 59, 58, 91, 92, 75, 56, 151, 57, 77, 90].","authors":["Dario Isola"],"meta":["January 2012","DOI:10.13140/RG.2.2.10667.64808","Thesis for: Ph. D."],"references":["309589824_Transient_Spoiler_Aerodynamics_Using_a_Conservative_Adaptive-Grid_Ale_Scheme","309589822_A_Novel_Adaptive_ALE_Scheme_for_Accurate_Simulations_of_Compressible_Unsteady_Fluid_Dynamics","309589680_Arbitrary_Lagrangian_Eulerian_Formulation_for_Grids_with_Variable_Topology","316268240_Numerical_Methods_for_Conservation_Laws","314821677_Numerical_simulation_of_two-dimensional_blade-vortex_interactions_using_unstructured_adaptive_meshes","314820354_Finite_volume_discretization_aspects_for_viscous_flows_on_mixed_unstructured_grids","309589509_An_Edge-Based_ALE_Scheme_for_Adaptive_Dynamic_Meshes","307562147_A_difference_method_for_numerical_calculation_of_discontinuous_solutions_of_the_equations_of_hydrodynamics","305972072_The_Aeronautical_Research_Council","303350926_Multigrid_solution_of_monotone_second-order_discretizations_of_hyperbolic_conservation_laws","295552091_Numerical_vorticity_confinement_for_vortex-solid_body_interaction_problems","287950843_An_ALE_scheme_without_interpolation_for_moving_domain_with_adaptive_grids","281499862_Partitioned_procedures_for_the_transient_solution_of_coupled_aerostatic_problems_Part_II_energy_transfer_analysis_and_three-dimensional_applications","280852992_Construction_of_high_order_non-upwind_residual_distribution","279294811_Numerical_Simulation_of_Compressible_Vortical_Flows_Using_a_Conservative_Unstructured-Grid_Adaptive_Scheme"]}