{"id":"309460842_Cost_Efficiency_for_Economical_Mobile_Data_Traffic_Management_from_Users'_Perspective","abstract":"Explosive demand for wireless internet services has posed critical challenges for wireless network due to its limited capacity. To tackle this hurdle, wireless Internet service providers (WISPs) take the smart data pricing to manage data traffic loads. Meanwhile, from the users' perspective, it is also reasonable and desired to employ mobile data traffic management under the pricing policies of WISPs to improve the economic efficiency of data consumption. In this paper we introduce a concept of cost efficiency for user's mobile data management, defined as the ratio of user's mobile data consumption benefits and its expense. We propose an integrated cost-efficiency-based data traffic management scheme including long-term data demand planning, short-term data traffic pre-scheduling and real-time data traffic management. The real-time data traffic management algorithm is proposed to coordinate user's data consumption to tailor to the pre-scheduled data traffic profile. Numerical results demonstrate the effectiveness of cost efficiency framework in indicating and motivating mobile user's data consumption behavior. The proposed management scheme can effectively motivate the user to adjust its data consumption profile to obtain the optimal data consumption cost efficiency.","authors":["Jinghuan Ma","Lingyang Song","Yonghui Li"],"meta":["October 2016IEEE Transactions on Wireless Communications PP(99)","DOI:10.1109/TWC.2016.2623615"],"references":["262301982_What_will_5G_be","309437991_Cost_efficiency_Economical_mobile_data_traffic_pre-scheduling_in_user's_perspective","302464749_A_Model_of_General_Economic_Equilibrium","288393022_The_Volume_and_Value_of_Information","284651465_A_Model_of_General_Equilibrium","269298254_Time_dependent_pricing_in_wireless_data_networks_Flat-rate_vs_usage-based_schemes","265399398_Linear_Programming_with_a_Fractional_Objective_Function","260947197_Impact_of_Execution_Time_on_Adaptive_Wireless_Video_Scheduling","260710052_Incentivizing_Time-Shifting_of_Data_A_Survey_of_Time-Dependent_Pricing_for_Internet_Access","260654674_5G_on_the_Horizon_Key_Challenges_for_the_Radio-Access_Network"]}