{"id":"309483002_Value_uncaptured_perspective_for_sustainable_business_model_innovation","abstract":"Sustainability has become one of the key factors for long-term business success. Recent research and practice show that business model innovation is a promising approach for improving sustainability in manufacturing firms. To date business models have been examined mostly from the perspectives of value proposition, value capture, value creation and delivery. There is a need for a more comprehensive understanding of value in order to promote sustainability. This paper proposes value uncaptured as a new perspective for sustainable business model innovation, and develops four forms of value uncaptured: value surplus, value absence, value missed and value destroyed. This paper also proposes a framework of using value uncaptured for sustainable business model innovation. This framework has been validated in case studies in six product-service systems firms with advanced manufacturing technologies. The empirical studies identify 26 main sources of value uncaptured throughout the product life cycle. The findings show that (a) the new perspective of value uncaptured can help manufacturing firms understand the negative aspects of their business models; (b) the four forms and 26 sources can assist firms in identifying value uncaptured in a structured way; and (c) the identified value uncaptured can trigger the discovery of new value opportunities which lead to new business models with higher sustainable value. This paper extends the existing studies on business models from the perspectives of value proposition, capture, creation and delivery, to value uncaptured. The proposed framework has helped firms identify value opportunities that trigger the innovation of sustainable business models. Therefore, this paper contributes to both theory and practice in the field of sustainable business models innovation.","authors":["Miying Yang","Steve Evans","Doroteya Vladimirova","P. Rana"],"meta":["September 2016","DOI:10.17863/CAM.4227","Project: Business Models for Sustainable Industrial Systems "],"references":["302373697_Towards_a_Conceptual_Framework_of_'Business_Models_for_Sustainability'","280938794_Product_Service_System_PSS_Life_Cycle_Value_Analysis_for_Sustainability","280938780_Sustainable_value_analysis_tool_for_value_creation","320442725_SUSTAINABLE_VALUE_ANALYSIS_FOR_PRODUCT-SERVICE_SYSTEMS","314480277_Business_Model_Innovation_for_Sustainability","312985464_Building_theories_from_case_study_research","303959507_Product_service_systems_ecological_and_economic_basics","284570978_The_Case_for_Viewing_Business_Models_as_Abstractions_of_Strategy","284463358_Towards_a_theory_of_sustainable_product_service_systems","282350611_Additive_manufacturing_for_consumer-centric_business_models_Implications_for_supply_chains_in_consumer_goods_manufacturing"]}