{"id":"309417963_An_Outdoor_Mobile-Based_Assessment_Activity_Measuring_Students'_Motivation_and_Acceptance","abstract":"Mobile-devices are able to support a wide range of outdoor assessment activities. While there is a significant amount of research that investigates the acceptance of computer-based assessment from one side and the acceptance of mobile learning from the other, relatively few studies focus explicitly on the factors that influence the acceptance of Mobile-based Assessment. The current study implements a mobile-based outdoor educational activity in the city’s Botanic Gardens during an environmental education project. 50 secondary school students participated in a mobile-assisted assessment procedure using Quick Response (QR) - coding technology through their mobile devices. The study examines the impact of Perceived Mobility, Authentic Context and Interest/Enjoyment on students’ Perceived Usefulness, Perceived Ease of Use and Behavioral Intention to Use Mobile-based Assessment. Partial Least Squares (PLS) was used for the data analysis. Results show that Perceived Mobility, Authentic Context and Interest/Enjoyment, Perceived Usefulness and Perceived Ease of Use are all significant determinants of Behavioral Intention to Use mobile-based assessment. Furthermore, the study examines the impact of using mobile devices during the learning activity on students’ learning motivation. Implications for designing and implementing mobile-based assessment procedures are discussed.","authors":["Stavros Nikou","Anastasios A. Economides"],"meta":["October 2016International Journal of Interactive Mobile Technologies (iJIM) 10(4):11-17","DOI:10.3991/ijim.v10i4.5541"],"references":["318133937_Alternatives_in_Assessment_of_Achievements_Learning_Processes_and_Prior_Knowledge","288764536_A_Blended_Mobile_Learning_Environment_for_Museum_Learning","285686334_Using_Self-Efficacy_to_Assess_the_Readiness_of_Nursing_Educators_and_Students_for_Mobile_Learning","284339985_Factors_Influencing_Students'_Acceptance_of_M-Learning_An_Investigation_in_Higher_Education","283318450_The_effects_of_Perceived_Mobility_and_Satisfaction_on_the_adoption_of_Mobile-based_Assessment","316807278_Intrinsic_Motivation_and_Self-Determination_in_Human_Behavior","312984568_Perceived_usefulness_perceived_ease_and_user_acceptance_of_information_technology","291292212_The_importance_of_universal_psychological_needs_for_understanding_motivation_in_the_workplace","282701865_The_impact_of_paper-based_computer-based_and_mobile-based_self-assessment_on_students'_science_motivation_and_achievement","282631797_The_interplay_of_game_elements_with_psychometric_qualities_learning_and_enjoyment_in_game-based_assessment"]}