{"id":"309455513_Fast_Realistic_MRI_Simulations_Based_on_Generalized_Multi-Pool_Exchange_Tissue_Model","abstract":"We present MRiLab, a new comprehensive simulator for large-scale realistic MRI simulations on a regular PC equipped with a modern graphical processing unit (GPU). MRiLab combines realistic tissue modeling with numerical virtualization of an MRI system and scanning experiment to enable assessment of a broad range of MRI approaches including advanced quantitative MRI methods inferring microstructure on a sub-voxel level. A flexible representation of tissue microstructure is achieved in MRiLab by employing the generalized tissue model with multiple exchanging water and macromolecular proton pools rather than a system of independent proton isochromats typically used in previous simulators. The computational power needed for simulation of the biologically relevant tissue models in large 3D objects is gained using parallelized execution on GPU. Three simulated and one actual MRI experiments were performed to demonstrate the ability of the new simulator to accommodate a wide variety of voxel composition scenarios and demonstrate detrimental effects of simplified treatment of tissue micro-organization adapted in previous simulators. GPU execution allowed ~200x improvement in computational speed over standard CPU. As a cross-platform, open-source, extensible environment for customizing virtual MRI experiments, MRiLab streamlines the development of new MRI methods, especially those aiming to infer quantitatively tissue composition and microstructure.","authors":["Fang Liu","Julia V. Velikina","Walter F Block","Richard Kijowski"],"meta":["October 2016IEEE Transactions on Medical Imaging PP(99):1-1","DOI:10.1109/TMI.2016.2620961","Projects: Magnetic Resonance Imaging and Nuclear MedicineArtificial Intelligence for BioMedical ImagingArtificial Intelligence 4 Medical Imaging"],"references":["276147522_Rapid_multicomponent_relaxometry_in_steady_state_with_correction_of_magnetization_transfer_effects_Effects_of_MT_on_Multicomponent_T_2_Parameters","268302727_gagCEST_NOE_Assessment_of_Glycosaminoglycan_Concentration_in_Vivo","301250036_Inherited_and_acquired_disorders_of_myelin_The_underlying_myelin_pathology","292677708_Quantitative_magnetization_transfer_imaging_made_easy_with_q_MTL_ab_Software_for_data_simulation_analysis_and_visualization","283317383_SENSE_sensitivity_encoding_for_fast_mri","282608923_Multicomponent_T2_Analysis_of_Articular_Cartilage_With_Synovial_Fluid_Partial_Volume_Correction","280584902_Quantitative_MR_Imaging_of_Hepatic_Steatosis_Validation_in_Ex_Vivo_Human_Livers","273385432_Pulse_Sequence_Programming_in_a_Dynamic_Visual_Environment_SequenceTree","268234250_Removal_of_Cerebrospinal_Fluid_Partial_Volume_Effects_in_Quantitative_Magnetization_Transfer_Imaging_Using_a_Three-Pool_Model_with_a_Non-Exchanging_Water_Component","268156472_Graphical_programming_interface_A_development_environment_for_MRI_methods"]}