{"id":"309418614_Neural_Correlates_of_Moral_Sensitivity_and_Moral_Judgment_Associated_with_Brain_Circuitries_of_Selfhood_A_Meta-analysis","abstract":"The present study meta-analyzed 45 experiments with 959 subjects and 463 activation foci reported in 43 published articles that investigated the neural mechanism of moral functions by comparing neural activity between the moral-task and non-moral-task conditions with the Activation Likelihood Estimate method. The present study examined the common activation foci of morality-related task conditions. In addition, this study compared the neural correlates of moral sensibility with the neural correlates of moral judgment, which are the two functional components in the Neo-Kohlbergian model of moral functioning. The results showed that brain regions associated with the default mode network were significantly more active during morality-related task conditions than during non-morality task conditions. These brain regions were also commonly activated in both moral judgment and moral sensibility task conditions. In contrast, the right temporoparietal junction and supramarginal gyrus were found to be more active only during conditions of moral judgment. These findings suggest that the neural correlates of moral sensibility and moral judgment are perhaps commonly associated with brain circuitries of self-related psychological processes, but the neural correlates of those two functional components are distinguishable from each other.","authors":["Hyemin Han"],"meta":["June 2017Journal of Moral Education 46(2):97-113","DOI:10.1080/03057240.2016.1262834","Project: Purpose, Morality, Prosociality, and Positive Youth Development"],"references":["304249566_Neuroscientific_and_Social_Psychological_Investigation_on_Psychological_Effects_of_Stories_of_Moral_Exemplars","301891094_Attainable_and_Relevant_Moral_Exemplars_as_Powerful_Sources_for_Moral_Education_from_vantage_points_of_virtue_ethics_and_social_psychology","301614055_Are_Attainable_Exemplars_More_Effective_at_Promoting_Students'_Moral_Motivation","294728934_How_can_Neuroscience_contribute_to_Moral_Philosophy_Psychology_and_Education_based_on_Aristotelian_Virtue_Ethics","289175393_Influence_of_the_Cortical_Midline_Structures_on_Moral_Emotion_and_Motivation_in_Moral_Decision-Making","284543156_The_angular_gyrus_Multiple_functions_and_multiple_subdivisions","312703942_The_brain's_default_network_Anatomy_function_and_relevance_to_disease","292004471_Self-understanding_and_moral_development_in_childhood_and_adolescence","277708190_Social_Desirability_Bias","277703474_Questionnaire_Pre-Testing_Wiley_International_Encyclopedia_of_Marketing"]}