{"id":"309450255_Automatic_Repair_of_Real_Bugs_in_Java_A_Large-Scale_Experiment_on_the_Defects4J_Dataset","abstract":"Defects4J is a large, peer-reviewed, structured dataset of real-world Java bugs. Each bug in Defects4J comes with a test suite and at least one failing test case that triggers the bug. In this paper, we report on an experiment to explore the effectiveness of automatic test-suite based repair on Defects4J. The result of our experiment shows that the considered state-of-the-art repair methods can generate patches for 47 out of 224 bugs. However, those patches are only test-suite adequate, which means that they pass the test suite and may potentially be incorrect beyond the test-suite satisfaction correctness criterion. We have manually analyzed 84 different patches to assess their real correctness. In total, 9 real Java bugs can be correctly repaired with test-suite based repair. This analysis shows that test-suite based repair suffers from under-specified bugs, for which trivial or incorrect patches still pass the test suite. With respect to practical applicability, it takes on average 14.8 minutes to find a patch. The experiment was done on a scientific grid, totaling 17.6 days of computation time. All the repair systems and experimental results are publicly available on Github in order to facilitate future research on automatic repair.","authors":["Matias Martinez","Thomas Durieux","Romain Sommerard","Jifeng Xuan"],"meta":["August 2017Empirical Software Engineering 22(4)","DOI:10.1007/s10664-016-9470-4","Project: Automatic Program Repair"],"references":["305026872_ASTOR_a_program_repair_library_for_Java_demo","297777476_Nopol_Automatic_Repair_of_Conditional_Statement_Bugs_in_Java_Programs","288827327_An_Empirical_Study_on_Real_Bug_Fixes","304552841_DirectFix_Looking_for_Simple_Program_Repairs","304291925_Experience_report_How_do_techniques_programs_and_tests_impact_automated_program_repair","303099518_An_Analysis_of_the_Search_Spaces_for_Generate_and_Validate_Patch_Generation_Systems","301392318_Automatically_generated_patches_as_debugging_aids_A_human_study","301274054_Automatic_patch_generation_by_learning_correct_code","299909645_Staged_program_repair_with_condition_synthesis","299868538_Is_the_cure_worse_than_the_disease_overfitting_in_automated_program_repair"]}