{"id":"309401339_The_off-line_computer_system_for_design_of_the_hot_rolling_and_laminar_cooling_technology_for_steel_strips","abstract":"The objective of this work was development of the computer system VirtRoll, which allows designing of the arbitrary rolling line and performing numerical simulations using high efficiency hardware architectures. Selection of the mechanical, thermal, microstructural and phase transformation models, which allow decreasing the computing costs while the accuracy of simulations is maintained on the reasonable level, was one of the objectives of the paper. Thus, metamodel was applied in the mechanical part and a simple finite element approach was used in the thermal part of the hot rolling model. Simulations of microstructure evolution in hot rolling and phase transformations during the laminar cooling were based on modified Avrami equation. The system was designed in the client-server architecture, in which client part is in the form of the graphical interface. This interface allows to design of rolling line. The server part is composed of: i) controllers which prepare computing tasks, ii) middleware layer responsible for launching and monitoring of the computing tasks, iii) the layer of numerical computations. Deal.II library dedicated to solve partial differential equations was used for the time step adaptations. All these parts led to short computing times and additionally allowed parallel solution of the optimization tasks. Simulations of thermal-mechanical-microstructural phenomena were performed for the rolling-cooling sequence and the results allowed validation of the system. © 2016, Editorial Institution of Wrocaw Board of Scientific. All rights reserved.","authors":["Łukasz Rauch","Krzysztof Bzowski","R. Kuziak","Jacek Kitowski"],"meta":["January 2016"],"references":["271384584_Harnessing_Heterogeneous_Computational_Infrastructures_for_Studying_Metallurgical_Rolling_Processes","267340262_Conventional_and_Multiscale_Modeling_of_Microstructure_Evolution_During_Laminar_Cooling_of_DP_Steel_Strips","261994643_Massively_Scalable_Platform_for_Data_Farming_Supporting_Heterogeneous_Infrastructure","345676208_Hot_Rolling_of_Steel","316188947_Computational_Materials_Engineering_Achieving_High_Accuracy_and_Efficiency_in_Metals_Processing_Simulations","292393662_Microstructure_evolution_in_metal_forming_processes","288972442_A_mathematical_model_to_simulate_the_thermomechanical_processing_of_steel","288219334_Kraft_-_und_Arbeitsbedarf_bildsamer_Formgebungsverfahren","287637703_Physical_and_numerical_simulation_of_the_manufacturing_chain_for_the_DP_steel_strips","279550944_PHYSICAL_METALLURGY_OF_HOT_WORKING"]}