{"id":"309461287_Segregation_Landscape_A_New_View_on_the_Schelling_Segregation_Space","abstract":"Thomas C. Schelling showed that global aggregation may occur, even if it does not correspond to agent preferences; thus, to some extent his model supported the view that segregation is unavoidable, whatever the tolerance is. The segregation landscape approach proposed in this paper is seriously weakening this hypothesis; here, we radically change the perspective and propose using the landscape metaphor to represent emergent segregated communities. A segregation landscape is a mapping from situated individuals into an extra dimension that represents the degree of segregation of everyone. This paper uncovers how to interpret hills and valleys, and whether these interpretations are congruent with the intuitive notion of frontier. Such a representation allows us to describe both the static properties of a segregation space and their impact on how information propagates between segregated communities. In order to assess the explanatory power of the landscape metaphor, we devise agent-based simulations. First, we establish the link between the micro-level quantified by individual tolerance and the macro-structure represented by the landscape, then we show how “geographic” properties impact the dynamical behavior on such a population landscape.","authors":["Philippe Collard","Teodor Ghetiu"],"meta":["October 2016Complex Systems 25(3)","DOI:10.25088/ComplexSystems.25.3.169"],"references":["287396979_Emergence_of_Frontiers_in_Networked_Schelling_Segregationist_Models","281885178_How_to_Prevent_Intolerant_Agents_from_High_Segregation","255586490_Role_of_'Vision'_in_Neighbourhood_Racial_Segregation_A_Variant_of_the_Schelling_Segregation_Model","231807200_Is_the_cognitive_penetrability_criterion_invalidated_by_contemporary_physics","280686714_On_the_Complexities_of_Complex_Economic_Dynamics","280566512_Networks_An_Introduction","240157183_Operators_and_heuristic_search","232520108_Social_penetration_The_development_of_interpersonal_relationships","230818214_Dynamic_Models_of_Segregation","229580432_The_influence_of_a_geographical_barrier_on_the_balance_of_selection_and_migration"]}