{"id":"309452476_Review_of_MRI-based_Brain_Tumor_Image_Segmentation_Using_Deep_Learning_Methods","abstract":"Brain tumor segmentation is an important task in medical image processing. Early diagnosis of brain tumors plays an important role in improving treatment possibilities and increases the survival rate of the patients. Manual segmentation of the brain tumors for cancer diagnosis, from large amount of MRI images generated in clinical routine, is a difficult and time consuming task. There is a need for automatic brain tumor image segmentation. The purpose of this paper is to provide a review of MRI-based brain tumor segmentation methods. Recently, automatic segmentation using deep learning methods proved popular since these methods achieve the state-of-the-art results and can address this problem better than other methods. Deep learning methods can also enable efficient processing and objective evaluation of the large amounts of MRI-based image data. There are number of existing review papers, focusing on traditional methods for MRI-based brain tumor image segmentation. Different than others, in this paper, we focus on the recent trend of deep learning methods in this field. First, an introduction to brain tumors and methods for brain tumor segmentation is given. Then, the state-of-the-art algorithms with a focus on recent trend of deep learning methods are discussed. Finally, an assessment of the current state is presented and future developments to standardize MRI-based brain tumor segmentation methods into daily clinical routine are addressed.","authors":["Ali Işın","Cem Direkoglu","Melike Sah"],"meta":["December 2016Procedia Computer Science 102:317-324","DOI:10.1016/j.procs.2016.09.407","Project: Deep Learning for Medical Signal and Image Processing"],"references":["309457251_Structured_prediction_with_convolutional_neural_networks_for_multimodal_brain_tumor_segmentation","309456897_Brain_tumor_segmentation_with_deep_learning","321610236_Imaging_of_Brain_Tumors_with_Histological_Correlations","321576636_Imaging_of_Brain_Tumors_with_Histological_Correlations","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","309456849_Segmentation_of_brain_tumor_tissues_with_convolutional_neural_networks","309456686_Brain_tumor_segmentation_with_deep_neural_networks","306204701_Multi-modal_brain_tumor_segmentation_using_deep_convolutional_neural_networks","297608770_Brain_Tumor_Segmentation_Using_Convolutional_Neural_Networks_in_MRI_Images","283166048_Brain_tumour_classification_using_two-tier_classifier_with_adaptive_segmentation_technique"]}