{"id":"309551158_Multiactive_objects_and_their_applications","abstract":"In order to tackle the development of concurrent and distributed systems, the active object programming model provides a high-level abstraction to program concurrent behaviours. There exists already a variety of active object frameworks targeted at a large range of application domains: modelling, verification, efficient execution. However, among these frameworks, very few of them consider a multi-threaded execution of active objects. Introducing a controlled parallelism within active objects enables overcoming some of their limitations. In this paper, we present a complete framework around the multiactive object programming model. We present it through ProActive, the Java library that offers multiactive objects, and through MultiASP, the programming language that allows the formalisation of our developments. We then use multiactive objects to compile a cooperative active object language with different synchronisation primitives into our programming model. This paper also presents different use cases and the development support to illustrate the practical usability of our language. Formalisation of our work provides the programmer with guarantees on the behaviour of the multiactive object programming model and of the compiler.","authors":["Ludovic Henrio","Justine Rochas"],"meta":["October 2016Logical Methods in Computer Science 13(4)","DOI:10.23638/LMCS-13(4:12)2017"],"references":["260102636_Declarative_Scheduling_for_Active_Objects","228566933_Teaching_Material_For_A_Theory_of_Distributed_Objects","226402488_Ambient-Oriented_Programming_in_AmbientTalk","312775005_MapReduce_Simplified_data_processing_on_large_clusters","303513087_From_Modelling_to_Systematic_Deployment_of_Distributed_Active_Objects","276315092_A_framework_for_deadlock_detection_in_core_ABS","274407448_A_design_pattern_for_optimizations_in_data_intensive_applications_using_ABS_and_JAVA_8","264123666_Integrating_deployment_architectures_and_resource_consumption_in_timed_object-oriented_models","261960282_Location_Independent_Routing_in_Process_Network_Overlays","242405431_Featherweight_Java_A_minimal_core_calculus_for_Java_and_GJ"]}