{"id":"309543620_Penerapan_Kombinasi_Algoritma_Minhash_dan_Binary_Hamming_Distance_pada_Hybrid_Perekomendasi_Lagu","abstract":"Teknik yang biasanya digunakan untuk menghasilkan rekomendasi adalah content-based, social-based dan hybrid. Content-based dan social-based adalah teknik rekomendasi yang berdiri sendiri, sedangkan hybrid adalah kombinasi dari beberapa teknik rekomendasi, seperti kombinasi knowledge-based dan social-based pada aplikasi EntreeC dan kombinasi social-based dan content-based pada DailyLearner. Teknik hybrid menghasilkan rekomendasi yang lebih baik daripada teknik rekomendasi yang berdiri sendiri, seperti meningkatkan akurasi rekomendasi dan mempercepatan produksi rekomendasi. Akan tetapi, berdasarkan penelitian sebelumnya, hybrid social-based dan content-based yang diterapkan pada data lagu, tidak menghasilkan rekomendasi yang lebih baik. Oleh karena itu, pada penelitian ini kombinasi social-based dan content-based yang diterapkan pada data lagu akan dikombinasikan dengan strategi switching,mixed, dan cascade yang diharapkan mampu menghasilkan keluaran yang lebih baik. Hasil dari penelitian ini, hybrid yang menggunakan strategi switching, cascade, dan mixed mampu membuat rekomendasi yang nilai akurasinya melebihi rekomendasi yang dihasilkan social-based dan content-based murni pada data yang memiliki nilai sparsity 0.94. Hal ini dibuktikan dengan nilai rata-rata akurasi hybrid yang mencapai 0,48, nilai minhash 0,17 dan nilai hamming 0,42. Sedangkan untuk data yang memiliki nilai sparsity 0,96, algoritma ini nilai akurasinya dibawah algoritma binary hamming distance. Hal ini dibuktikan dengan nilai rata-rata akurasi hybrid 0,4, nilai minhash 0,06 dan nilai binary hamming distance 0,41.","authors":["Lutvi Satriyo Putro","Ristu Saptono","Rini Anggrainingsih"],"meta":["June 2013Jurnal Teknologi & Informasi ITSmart 2(1):36","DOI:10.20961/its.v2i1.618","Project: Recommender System in Everyday Life"],"references":["235357340_Empirical_Analysis_of_Predictive_Algorithm_for_Collaborative_Filtering","3296928_Finding_interesting_associations_without_support_pruning","301222357_Toward_the_next_generation_of_recommender_systems_A_survey_of_the_state-of-the-art_and_possible_extensions","267804821_Creating_a_Hybrid_Music_Recommendation_System_from_Content_and_Social-Based_Algorithms","252069018_Recommender_Systems_An_Introduction","241770642_Learning_binary_codes_for_collaborative_filtering","233754781_Support_vs_Confidence_in_Association_Rule_Algorithms"]}