{"id":"309502611_The_level_of_students'_employability_skills_department_automotive_engineering_education_state_University_of_Makassar","abstract":"This study aims to determine the level of employability skills of students Department of Automotive Engineering Education, State University of Makassar, which is viewed from the aspect of employability skills are the ability to: (1) work together, (2) solve the problem, (3) initiatives, (4) management capabilities, and (5) information technology. The research sample consisted of 69 students from class years 2012-2014 were randomly selected using random cluster sampling technique. Analysis of survey data using descriptive analysis techniques which include: average, standard deviation, and frequency distribution category. The results showed that the level of employability skills of students Department of Automotive Engineering Education, State University of Makassar not optimal. This is evident from the average score of each sub-variables: (1) work together amounted to 44.93% of the students were in the high category, (2) solve the problem only 46.38% were in the high category, (3) an initiative of 42.02% are in a high, (4) management capabilities 49.27% were in the high category, and (5) information technology and 40.58% of the students were in the high category. While the results of tests technical skills of students only 36.23% are in the category is quite high. Thus, the implementation and the development of learning-based employability skills within the Department of Automotive Engineering Education, State University of Makassar still need to be optimized in order to produce graduates with employability skills that synergize with hard skills optimally viewed from the aspect of cooperation, problem-solving, initiative, self-management, and information technology.","authors":["Darmawang","Haris Syafrudie","Tuwoso","Muhammad Yahya"],"meta":["October 2016","DOI:10.1063/1.4965783","Conference: PROCEEDINGS OF THE INTERNATIONAL MECHANICAL ENGINEERING AND ENGINEERING EDUCATION CONFERENCES (IMEEEC 2016)"],"references":["328460709_Relevansi_kompetensi_lulusan_Diploma_Tiga_teknik_sipil_di_dunia_kerja","328455999_Re-orientasi_keterampilan_kerja_lulusan_pendidikan_kejuruan","259484639_Technical_and_vocational_skills_depletion_in_Nigeria_and_the_need_for_policy_intervention","281978364_Vocational_education_and_training_programs_VET_An_Asian_perspective","228271239_Employability_and_Enterprise_Evidence_from_the_North_East","44832990_Generic_Cognitive_Abilities_in_Higher_Education_An_international_analysis_of_skills_sought_by_stakeholders","33939561_Graduates'_and_employers'_perceptions_of_entry-level_employability_skills_needed_by_Agriculture_Food_and_Natural_Resources_graduates_electronic_resource"]}