{"id":"309571319_Does_it_pay_to_study_abroad_Evidence_from_Poland","abstract":"Tertiary education has been perceived in Poland as a key determinant of success in the labour market, as clearly shown by the increase of the net enrolment ratio in tertiary education from 9.8% in 1990 up to 40.9% in 2009. However, as tertiary education becomes more and more popular, it does not signal skills as well as before. It seems that employers may treat students' participation in international exchange programs as a new signaling tool since according to them international students? skills ? both cognitive and non-cognitive ? are well above the average. On the other hand, students participating in exchange programs underline a positive impact of studying abroad on their personal development, i.e. on their general skills. Thus, from a theoretical point of view we may expect a positive correlation between studying abroad and wages, which follows from both signaling theory and human capital theory. On the average, 16% of European students report a positive impact of participation in Erasmus exchange program on their incomes, but interestingly, those from the CEE countries, including Polish students, report it much more often. The aim of this paper is to determine whether studying abroad for at least one semester has an impact on wages of higher education graduates in Poland. To answer this question, an extended Mincer wage equation was estimated using OLS on the basis of data from the nationwide tracer survey of Polish graduates conducted in 2007 (Graduate Tracer Study 2007). The hourly net wage rate in the first job after graduating from a higher education institution was the dependent variable in the wage equation. In order to reduce the selection bias, three groups of variables depicting students? abilities and skills were included in the model. The results of the analysis show that Polish students who completed at least one semester of studies abroad, enjoy a wage premium of 35% in their first workplace after graduation. Moreover, the wage premium is higher in case of graduates holding Bachelor?s degree (48%) than those with Master?s degree (26%).","authors":["Jacek Liwinski"],"meta":["September 2016","DOI:10.20472/EFC.2016.006.014","Conference: 6th Economics & Finance Conference, OECD Headquarters, Paris"],"references":["306079748_The_Wage_Premium_from_Parents'_Investments_in_the_Education_of_Their_Children_in_Poland","230647957_Are_Student_Exchange_Programs_Worth_It","312453274_Study_experience_abroad_Italian_graduate_characteristics_and_employment_outcomes","301824604_Which_mechanisms_explain_monetary_returns_to_international_student_mobility","281812611_The_Professional_Value_of_ERASMUS_Mobility_The_Impact_of_International_Experience_on_Former_Students'_and_on_Teachers'_Careers","269454117_Human_Capital_A_Theoretical_and_Empirical_Analysis_with_Special_Reference_to_Education","247477602_Sample_Selection_Bias_Specification_Error","37695473_Investment_in_Women's_Human_Capital","24107712_Child_Endowments_and_the_Quantity_and_Quality_of_Children","24092295_Job_Market_Signaling"]}