{"id":"309589113_Cooperative_Reactive_Synthesis","abstract":"A modern approach to engineering correct-by-construction systems is to synthesize them automatically from formal specifications. Oftentimes, a system can only satisfy its guarantees if certain environment assumptions hold, which motivates their inclusion in the system specification. Experience with modern synthesis approaches shows that synthesized systems tend to satisfy their specifications by actively working towards the violation of the assumptions rather than satisfying assumptions and guarantees together. Such uncooperative behavior is undesirable because it violates the aim of synthesis: the system should try to satisfy its guarantees and use the assumptions only when needed. Also, the assumptions often describe the valid behavior of other components in a bigger system, which should not be obstructed unnecessarily.\nIn this paper, we present a hierarchy of cooperation levels between system and environment. Each level describes how well the system enforces both the assumptions and guarantees. We show how to synthesize systems that achieve the highest possible cooperation level for a given specification in Linear Temporal Logic (LTL). The synthesized systems can also exploit cooperative environment behavior during operation to reach a higher cooperation level that is not enforceable by the system initially. The worst-case time complexity of our synthesis procedure is doubly-exponential, which matches the complexity of standard LTL synthesis.","authors":["Roderick Bloem","Rüdiger Ehlers","Robert Könighofer"],"meta":["October 2015","DOI:10.1007/978-3-319-24953-7_29","Conference: International Symposium on Automated Technology for Verification and Analysis"],"references":["258442527_Doomsday_Equilibria_for_Omega-Regular_Games","236118892_The_Complexity_of_Admissibility_in_Omega-Regular_Games","234827421_On_the_synthesis_of_a_reactive_module","225965996_A_Kleene-Schutzenberger_Theorem_for_Weighted_Timed_Automata","220995143_Admissibility_in_Infinite_Games","24304732_Better_Quality_in_Synthesis_through_Quantitative_Objectives","308106886_Synthesizing_cooperative_reactive_mission_plans","303969276_Alternating-Time_Temporal_Logic","279968093_Cooperative_Reactive_Synthesis","264122910_How_to_Handle_Assumptions_in_Synthesis","262257571_Formalizing_and_Reasoning_about_Quality","262161017_Monitoring_Realizability","261961208_Resilience_to_intermittent_assumption_violations_in_reactive_synthesis","259633676_Synthesizing_robust_systems","225259997_Admissible_Strategies_in_Infinite_Games_over_Graphs","223027116_Strategy_logic","220851957_Assume-Guarantee_Synthesis","45862765_Rational_Synthesis","2486024_Lecture_Notes_in_Computer_Science"]}