{"id":"309545412_Programming_Language_Natural_Language_Supporting_the_Diverse_Computational_Activities_of_Novice_Programmers","abstract":"Given the current focus on teaching computational concepts to all from an early age, combined with the growing trend to empower end users to become producers of technology rather than mere consumers, we consider the issue of “computational notation”. Specifically, where the goal is to help individuals develop their understanding of computation and/or use computation in real world settings, we question whether natural language might be a preferred notation to traditional programming languages, given its familiarity and ubiquity. We describe three empirical studies investigating the use of natural language for computation in which we found that although natural language provides support for understanding computational concepts, it introduces additional difficulties when used for coding. We distilled our findings into a set of design guidelines for novice programming environments which consider the ways in which different notations, including natural language, can best support the various activities that comprise programming. These guidelines were embodied in Flip, a bi-modal programming language used in conjunction with the Electron toolset, which allows young people to create their own commercial quality, narrative based role playing games. Two empirical studies on the use of Flip in three different real world contexts considered the extent to which the design guidelines support ease of use and an understanding of computation. The guidelines have potential to be of use both in analysing the use of natural language in existing novice programming environments, and in the design of new ones.","authors":["Judith Good","Kate Howland"],"meta":["October 2016Journal of Visual Languages & Computing 39(1)","DOI:10.1016/j.jvlc.2016.10.008"],"references":["301463521_Teaching_Computer_Science_to_5-7_year-olds_An_initial_study_with_Scratch_Cubelets_and_unplugged_computing","319394793_A_Small_Matter_of_Programming_Perspectives_on_End_User_Computing","318494166_A_Cognitive_Theory_of_Graphical_and_Linguistic_Reasoning_Logic_and_Implementation","304285780_Natural_language_and_programming_Designing_effective_environments_for_novices","304285779_Codechella_Multi-user_program_visualizations_for_real-time_tutoring_and_collaborative_learning","300489857_Pencil_code","300116168_Comparing_Textual_and_Block_Interfaces_in_a_Novice_Programming_Environment","299364602_Refining_an_understanding_of_computational_thinking","299159539_'Five_years_later'","295559025_Editorial_Computing_Education_in_K-12_Schools_from_a_Cross-National_Perspective"]}