{"id":"309573939_OFSEP_a_nationwide_cohort_of_people_with_multiple_sclerosis_Consensus_minimal_MRI_protocol","abstract":"Multiple sclerosis (MS) is most generally considered as a severe disease with high physical and mental risks of disability. Since the end of the 1990s, several high cost long-term disease-modifying treatments provided some clinical efficiency. However, patient's follow-up was needed for the detection and the assessment of their side-effects. The \"Observatoire français de la sclérose en plaques\" (OFSEP) project aims to improve the clinical, biological and imaging systematic longitudinal follow-up of patients. It should increase the quality, efficiency and safety of patients' care, with a unique opportunity of large scale, about 41,000 patients followed in 62 French centers using the European Database for Multiple Sclerosis (EDMUS) software. OFSEP is divided into three working groups (clinical, biological and imaging). The imaging working group defines standards for routine MRI follow-up in the whole cohort and contains three subgroups: acquisition, workflow, and data processing. A common and feasible brain and spinal cord acquisition protocol has been defined by the acquisition group, and accepted by the OFSEP steering and scientific committees. This protocol can be implemented in all French MRI centers. The major MRI manufacturers have agreed to provide the dedicated collection of sequences as an \"OFSEP box\" with every software upgrade or new MRI machine. The new OFSEP protocol will provide a unique opportunity to study a population-based collection of data from people with MS.","authors":["François Cotton","S. Kremer","Salem Hannoun","S. Vukusic"],"meta":["January 2015","Project: Magnetic Resonance Imaging in Multiple Sclerosis"],"references":["267932292_MS_Lesions_Are_Better_Detected_with_3D_T1_Gradient-Echo_Than_with_2D_T1_Spin-Echo_Gadolinium-Enhanced_Imaging_at_3T","233976558_Recommendations_to_improve_imaging_and_analysis_of_brain_lesion_load_and_atrophy_in_longitudinal_studies_of_multiple_sclerosis","312916044_Diagnostic_criteria_for_multiple_sclerosis_2005_revisions_to_the_McDonald_Criteria","297089977_McAlpine's_Multiple_Sclerosis_Fourth_Edition","296427139_Evaluation_of_modified_MRI_criteria_for_multiple_sclerosis_in_patients_with_clinically_isolated_syndromes","288264911_Comparison_of_visual_conspicuity_between_two_contrast-_enhanced_T1-weighted_sequences_in_the_detection_of_multiple_sclerosis_lesions_with_30T_MRI","285923904_McAlpine's_Multiple_Sclerosis","275017416_Multiple_Sclerosis","263282263_Low_signal_intensity_in_U-fiber_identified_by_susceptibility-weighted_imaging_in_two_cases_of_progressive_multifocal_leukoencephalopathy","236265770_Standardized_Magnetic_Resonance_Imaging_Acquisition_and_Reporting_in_Pediatric_Multiple_Sclerosis"]}