{"id":"309519112_The_topological_realization","abstract":"In this paper, I argue that the newly developed network approach in neu- roscience and biology provides a basis for formulating a unique type of realization, which I call topological realization. Some of its features and its relation to one of the dominant paradigms of realization and explanation in sciences, i.e. the mecha- nistic one, are already being discussed in the literature. But the detailed features of topological realization, its explanatory power and its relation to another prominent view of realization, namely the semantic one, have not yet been discussed. I argue that topological realization is distinct from mechanistic and semantic ones because the realization base in this framework is not based on local realisers, regardless of the scale (because the local vs global distinction can be applied at any scale) but on global realizers. In mechanistic approach, the realization base is always at the local level, in both ontic (Craver 2007, 2014) and epistemic accounts (Bechtel and Richardson 2010). The explanatory power of realization relation in mechanistic approach comes directly from the realization relation-either by showing how a model is mapped onto a mechanism, or by describing some ontic relations that are explanatory in themselves. Similarly, the semantic approach requires that concepts at different scales logically satisfy microphysical descriptions, which are at the local level. In topological frame- work the realization base can be found at different scales, but whatever the scale the realization base is global, within that scale, and not local. Furthermore, topological realization enables us to answer the “why” questions, which according to Polger 2010 make it explanatory. The explanatoriness of topological realization stems from under- standing mathematical consequences of different topologies, not from the mere fact that a system realizes them.","authors":["Daniel Kostic"],"meta":["January 2018Synthese 195(1)","DOI:10.1007/s11229-016-1248-0","Project: Philosophical foundations of topological explanations"],"references":["296330209_Realization_Metaphysical_and_Scientific_Perspectives","290465107_The_Ontic_Account_of_Scientific_Explanation","288700414_Mechanistic_and_topological_explanations_in_medicine_the_case_of_medical_genetics_and_network_medicine","284902796_A_resilient_low-frequency_small-world_human_brain_functional_network_with_highly_connected_association_cortical_hubs","344486964_Purple_Haze","329653912_Discovering_Complexity_Decomposition_and_Localization_as_Strategies_in_Scientific_Research","311270229_Network_and_multilayer_network_approaches_to_understanding_human_brain_dynamics","311260930_The_explanatory_power_of_network_models","286004317_Explaining_the_Brain","283617410_Emergence_of_Scaling_in_Random_Networks","282499901_Diversifying_the_picture_of_explanations_in_biological_sciences_ways_of_combining_topology_with_mechanisms","282367377_Controllability_of_structural_brain_networks","274741461_Network_Representation_and_Complex_Systems","280566512_Networks_An_Introduction","274412756_What_Makes_a_Scientific_Explanation_Distinctively_Mathematical"]}