{"id":"309663848_General_and_Fractional_Hypertree_Decompositions_Hard_and_Easy_Cases","abstract":"Hypertree decompositions, the more powerful generalized hypertree decompositions (GHDs), and the yet more general fractional hypertree decompositions (FHD) are hypergraph decomposition methods successfully used for answering conjunctive queries and for solving constraint satisfaction problems. Each hypergraph H has a width relative to each of these methods: its hypertree width hw(H), its generalized hypertree width ghw(H), and its fractional hypertree width fhw(H), respectively. While hw(H) $\\leq k$ can be checked in polynomial time, the complexity of checking whether fhw(H) $\\leq k$ holds for a fixed constant $k$ was unknown and was stated by Grohe and Marx (SODA 2006) as an important open problem. We settle this problem by proving that checking whether fhw(H) $\\leq k$ is NP-complete, even for $k=2$ and by same construction also the problem deciding whether ghw(H) $\\leq k$ is NP-complete for $k \\geq 2$. Hardness was previously known for $k \\geq 3$, whilst the case $k=2$ has remained open since 2001. After proving these hardness results, we investigate meaningful restrictions, for which checking for bounded ghw is easy. We study classes of hypergraphs that enjoy the bounded edge-intersection property (BIP) and the more general bounded multi-edge intersection property (BMIP). For such classes, for each constant $k$, checking whether ghw(H) $\\leq k$, and if so, computing a GHD of width $k$ of H is tractable and actually FPT. Finally we derive some approximability results for fhw. We consider classes of hypergraphs whose fhw is bounded by a constant $k$ and which also enjoy the BIP or MIP, or bounded VC-dimension. For each hypergraph in such a class, we are able to compute an FHD of width O($k$ log $k$) efficiently. A different restriction on classes of hypergraphs gives a linear approximation in PTime. Hypergraphs of bounded rank are a simple example of such a class.","authors":["Wolfgang Fischl","Georg Gottlob","Reinhard Pichler"],"meta":["November 2016"],"references":["305253105_How_Good_Are_Query_Optimizers_Really","272990057_Myhill-Nerode_Methods_for_Hypergraphs","266972058_GYM_A_Multiround_Join_Algorithm_In_MapReduce","304021434_FAQ_Questions_Asked_Frequently","304021079_EmptyHeaded_A_Relational_Engine_for_Graph_Processing","301845970_Old_Techniques_for_New_Join_Algorithms_A_Case_Study_in_RDF_Processing","300621536_Joins_via_Geometric_Resolutions","300590310_Design_and_Implementation_of_the_LogicBlox_System","294424399_SNRNeg_A_Social_Network_Enabled_Negotiation_Service","281128816_Hypertree-Width_and_Related_Hypergraph_Invariants"]}