{"id":"309663688_Phase_Coexistence_for_the_Hard-Core_Model_on_mathbb_Z2","abstract":"The hard-core model has attracted much attention across several disciplines, representing lattice gases in statistical physics and independent sets in discrete mathematics and computer science. On finite graphs, we are given a parameter λ, and an independent set I arises with probability proportional to λ | I | . On infinite graphs a Gibbs measure is defined as a suitable limit with the correct conditional probabilities, and we are interested in determining when this limit is unique and when there is phase coexistence, i.e. , existence of multiple Gibbs measures.\nIt has long been conjectured that on ℤ ² this model has a critical value λ c ≈ 3.796 with the property that if λ < λ c then it exhibits uniqueness of phase, while if λ > λ c then there is phase coexistence. Much of the work to date on this problem has focused on the regime of uniqueness, with the state of the art being recent work of Sinclair, Srivastava, Štefankovič and Yin showing that there is a unique Gibbs measure for all λ < 2.538. Here we explore the other direction and prove that there are multiple Gibbs measures for all λ > 5.3506. We also show that with the methods we are using we cannot hope to replace 5.3506 with anything below 4.8771.\nOur proof begins along the lines of the standard Peierls argument, but we add two innovations. First, following ideas of Kotecký and Randall, we construct an event that distinguishes two boundary conditions and always has long contours associated with it, obviating the need to accurately enumerate short contours. Second, we obtain improved bounds on the number of contours by relating them to a new class of self-avoiding walks on an oriented version of ℤ ² .","authors":["Antonio Blanca","Yuxuan Chen","David Galvin","Dana Randall"],"meta":["November 2016Combinatorics Probability and Computing 28(1)","DOI:10.1017/S0963548318000238"],"references":["305339038_Spatial_mixing_and_the_connective_constant_optimal_bounds","243778374_Torpid_mixing_of_some_MCMC_algorithms_in_statistical_physics","328870322_generatingfunctionology_Third_Edition","267441795_Gibbs_Measures_and_Phase_Transitions","266846027_The_description_of_a_random_field_by_means_of_conditional_probabilities_and_conditions_of_its_regularity","265333396_Gibbs_Measures_and_Phase_TransitionsBerlin_Walter_de_Gruyter","247043525_On_the_Number_of_Self-Avoiding_Walks","242956782_The_problem_of_uniqueness_of_a_Gibbs_random_eld_and_the_problem_of_phase_transition","239665626_Probability_theory_and_combinatorial_optimization","239398591_An_Inversion_Theorem_for_Cluster_Decompositions_of_Sequences_with_Distinguished_Subsequences"]}