{"id":"309654027_Spilling_breakers_in_shallow_water_Applications_to_Favre_waves_and_to_the_shoaling_and_breaking_of_solitary_waves","abstract":"A two-layer long-wave approximation of the homogeneous Euler equations for a free-surface flow evolving over mild slopes is derived. The upper layer is turbulent and is described by depth-averaged equations for the layer thickness, average fluid velocity and fluid turbulent energy. The lower layer is almost potential and can be described by Serre–Su–Gardner–Green–Naghdi equations (a second-order shallow water approximation with respect to the parameter $H/L$ , where $H$ is a characteristic water depth and $L$ is a characteristic wavelength). A simple model for vertical turbulent mixing is proposed governing the interaction between these layers. Stationary supercritical solutions to this model are first constructed, containing, in particular, a local turbulent subcritical zone at the forward slope of the wave. The non-stationary model was then numerically solved and compared with experimental data for the following two problems. The first one is the study of surface waves resulting from the interaction of a uniform free-surface flow with an immobile wall (the water hammer problem with a free surface). These waves are sometimes called ‘Favre waves’ in homage to Henry Favre and his contribution to the study of this phenomenon. When the Froude number is between 1 and approximately 1.3, an undular bore appears. The characteristics of the leading wave in an undular bore are in good agreement with experimental data by Favre ( Ondes de Translation dans les Canaux Découverts , 1935, Dunod) and Treske ( J. Hydraul Res. , vol. 32 (3), 1994, pp. 355–370). When the Froude number is between 1.3 and 1.4, the transition from an undular bore to a breaking (monotone) bore occurs. The shoaling and breaking of a solitary wave propagating in a long channel (300 m) of mild slope (1/60) was then studied. Good agreement with experimental data by Hsiao et al. ( Coast. Engng , vol. 55, 2008, pp. 975–988) for the wave profile evolution was found.","authors":["S. L. Gavrilyuk","V. Yu. Liapidevskii","Alexander Chesnokov"],"meta":["December 2016Journal of Fluid Mechanics 808:441-468","DOI:10.1017/jfm.2016.662"],"references":["271663447_Mixing_layer_under_a_free_surface","267454042_A_Kinematic_Conservation_Law_in_Free_Surface_Flow","265654283_Turbulent_interfacial_boundary_conditions_for_spilling_breakers","313148739_Sur_les_ondes_positives_de_translation_dans_les_canaux_et_sur_le_ressaut_ondule_de_faible_amplitude","284902974_Contribution_a_l'etude_des_ecoulements_permanents_et_variables_dans_les_canaux","281527912_Modelling_turbulence_generation_in_solitary_waves_on_shear_shallow_water_flows","280016635_AN_'ENTRAINING_PLUME'_MODEL_OF_A_SPILLING_BREAKER","263163737_Fully_nonlinear_long-waves_models_in_presence_of_vorticity","258796110_The_classical_hydraulic_jump_in_a_model_of_shear_shallow-water_flows","258661087_A_new_model_of_roll_waves_Comparison_with_Brock's_experiments"]}