{"id":"309615303_Integrating_Dynamic_Data_and_Sensors_with_Semantic_3D_City_Models_in_the_context_of_Smart_Cities","abstract":"Smart cities provide effective integration of human, physical and digital systems operating in the built environment. The advancements in city and landscape models, sensor web technologies, and simulation methods play a significant role in city analyses and improving quality of life of citizens and governance of cities. Semantic 3D city models can provide substantial benefits and can become a central information backbone for smart city infrastructures. However, current generation semantic 3D city models are static in nature and do not support dynamic properties and sensor observations. In this paper, we propose a new concept called Dynamizer allowing to represent highly dynamic data and providing a method for injecting dynamic variations of city object properties into the static representation. The approach also provides direct capability to model complex patterns based on statistics and general rules and also, real-time sensor observations. The concept is implemented as an Application Domain Extension for the CityGML standard. However, it could also be applied to other GML-based application schemas including the European INSPIRE data themes and national standards for topography and cadasters like the British Ordnance Survey Mastermap or the German cadaster standard ALKIS","authors":["Kanishk Chaturvedi","Thomas Heinrich Kolbe"],"meta":["October 2016","DOI:10.5194/isprs-annals-IV-2-W1-31-2016","Conference: 11th 3D Geoinfo ConferenceAt: Athens, GreeceVolume: ISPRS Annals of Photogrammetry, Remote Sensing and Spatial Information Sciences Volume IV-2/W1"],"references":["294894481_Opening_up_Smart_Cities_Citizen-Centric_Challenges_and_Opportunities_from_GIScience","281670019_A_literature_survey_on_smart_cities","226504520_Representing_and_Exchanging_3D_City_Models_with_CityGML","309226343_Managing_Versions_and_History_Within_Semantic_3D_City_Models_for_the_Next_Generation_of_CityGML","243784093_Building_Product_Models-Computer_Environments_Supporting_Design_and_Construction"]}