{"id":"309643916_A_new_enhanced_version_of_VLEACH_protocol_using_a_smart_path_selection","abstract":"Wireless technology becomes a fast developed research field in order to respond to our needs.\nIt has various applications such as health care, emergency situations, industrial applications and home\nautomation. It has several challenges like security and quality of service. Sensor node has a limited energy\nrelated to its tiny battery. Hence, energy efficiency is considered as an important challenge in Wireless\nSensor Networks (WSNs). This paper aims at describing the various routing categories and the different\nefficient routing protocols. Along with this, a new enhanced version of the VLEACH protocol based on\nselecting the routing path efficiently is also proposed in this paper. The efficient selection process is based on\nelecting the Cluster Heads (CHs) and the Vice-CH according to the highest residual energy. In addition, it\nuses a cooperative routing between the CHs and Vice-CHs in order to reduce the network energy\nconsumption. Implementation of Basic VLEACH and Proposed VLEACH is done using NS-2 Simulator.\nSimulation results show that the new scheme is more efficient than the original VLEACH protocol. This\nprotocol will increase the lifetime of sensor networks. So the proposed work can be applied in various WSNs\nwhich are deployed in remote areas and recharging of sensor nodes is an issue","authors":["Layla Aziz","Said Raghay","Hanane Aznaoui","Abdellah Jamali"],"meta":["February 2017International Journal of GEOMATE Vol. 12(Issue 30):pp. 28 -34","DOI:10.21660/2017.30.73420"],"references":["300409646_A_comparative_study_of_routing_protocols_in_WSN","282927333_Improvement_of_the_Wireless_Sensor_Network_Lifetime_using_LEACH_with_Vice-Cluster_Head","276929756_EE-LEACH_development_of_energy-efficient_LEACH_Protocol_for_data_gathering_in_WSN","304528799_A_ROBUST_HARMONY_SEARCH_ALGORITHM_BASED_MARKOV_MODEL_FOR_NODE_DEPLOYMENT_IN_HYBRID_WIRELESS_SENSOR_NETWORKS","304371012_A_new_approach_based_on_a_genetic_algorithm_and_an_agent_cluster_head_to_optimize_energy_in_Wireless_Sensor_Networks","281910874_An_approach_of_differential_capacitor_sensor_for_landslide_monitoring","281446953_Probabilistic_Density_Based_Adaptive_Clustering_Scheme_to_Improve_Network_Survivability_in_WSN","267396192_A_survey_and_performance_evaluation_of_decentralized_aggregation_schemes_for_autonomic_management","263662919_VLEACH_an_energy_efficient_communication_protocol_for_WSN","261478213_An_Extended_Vice-Cluster_Selection_Approach_to_Improve_V_Leach_Protocol_in_WSN"]}