{"id":"309625908_Architectural_heritage_knowledge_modelling_An_ontology-based_framework_for_conservation_process","abstract":"This paper presents an ontology-based model to support the representation and management of information and knowledge during investigation activities for the conservation of architectural heritage. Despite the significant impact of information and communications technology (ICT) on architectural heritage, current approaches to its use in this context are often conceived only to provide flexible and reusable tools and methodologies, thus proposing oversimplified procedures that are ultimately insufficient for a truly accurate conservation project. A few experiences recently have focused much attention on the specifics of conservation. Although they have generally been concerned with the specific activities and knowledge domains related to conservation processes (such as cataloguing or monument damage), the importance of dealing with them in an integrated way is often neglected. Hence, each step of the process – such as the preliminary phase of knowledge acquisition, the summaries, which facilitate the assessment of value, diagnostics, design, the construction phase, and maintenance – is treated in isolation from all the other activities. This lack of synergy often compromises the final result. In order to deal with the complexity of representing historical architecture, and its conservation process, this proposed model defines four main knowledge domains (artefact – lifecycle – architectural heritage investigation process – actors), in which all the knowledge related to each artefact is formalized through semantic networks, in terms of entities, properties and relationships. Specific reasoning and inference rules allow checking of the model for coherence, in order to reduce information discrepancies, inconsistencies and errors. The proposed model offers a high level of accuracy in its capacity for description and, at the same time, a broad versatility within representation modelling, allowing such a reliable representation of multiple issues that eventually it may be required for every historical building, depending on its features and state of conservation. Moreover, the versatility of the model provides a suitable representation even for the different nature of the investigation activities results – whether analytical or hermeneutical. Finally, the knowledgebase has been connected with a building information modelling environment, providing an effective integration between geometrical and non-geometrical information.","authors":["Marta Acierno","Stefano Cursi","Davide Simeone","Donatella Fiorani"],"meta":["November 2016Journal of Cultural Heritage","DOI:10.1016/j.culher.2016.09.010","Project: ontologies for conservation process"],"references":["308634697_Building_Information_Modeling_and_Heritage_Documentation","293090666_A_Meta_-_model_Agreement_for_Architectural_Heritage","286534560_Parametric_accuracy_Building_information_modeling_process_applied_to_the_cultural_heritage_preservation","266478147_Integrating_building_information_modelling_and_semantic_web_technologies_for_the_management_of_built_heritage_information","265088996_BHIM_-Built_Heritage_Information_Modelling","259873026_Semantic_Models_for_Architectural_Heritage_Documentation","259564220_Integration_of_Historic_Building_Information_Modeling_HBIM_and_3D_GIS_for_Recording_and_Managing_Cultural_Heritage_Sites","228498498_A_STAR_is_born_some_emerging_Semantic_Technologies_for_Archaeological_Resources","226398416_Ontologies_for_Cultural_Heritage","220041941_Ontologies_and_knowledge_bases_towards_a_terminological_clarification","260557726_A_diagnostic_ontological_model_for_damages_to_historical_constructions","244437488_A_Translation_Approach_to_Portable_Ontology_Specifications","220435409_Toward_an_alternative_notion_of_information_systems_ontologies_Information_engineering_as_a_hermeneutic_enterprise","2241034_Description_Logic_Framework_for_Information_Integration"]}