{"id":"309616413_Model_za_szdavane_na_obrazovatelen_softuer_prednaznacen_za_obucenie_na_komputrni_specialisti","abstract":"TITLE: \"A Model for Integration of Instructional Design in a University Course for Educational Software Design and Development, Taught to Computer Science Students\" \n\nABSTRACT: The paper presents a model for integration of Instructional design in teaching Educational Software Design and Development (ESDD) university course for students in Computer Science BSc programmes at the Faculty of Mathematics and Informatics (FMI) of Sofia University \" St. Kliment Ohridski \". It describes the general model for ESDD that combine Instructional Design (ID) and Software Design (SD) stages and components to produce a qualitative educational software products. The model is used in the elective course \" Design, Development and Evaluation of Educational Software \" at FMI.\nKey words: software design model, educational software, instructional design, software design. \n\nДокладът представя модел интегриращ дизайна на обучение в курса Проектиране, разработка и оценка на образователен софтуер (ПРООС) за студенти от бакалавърските програми Компютърни науки и Софтуерни технологии на Факултета по математика и информатика (ФМИ) на Софийски университет „Св. Климент Охридски“ (СУ). Той описва общия модел за Проектиране и разработка на образователен софтуер (ПРОС), който съчетава етапи и елементи на образователния дизайн и софтуерния дизайн за създаването на качествени образователни продукти. Този модел се прилага при обучението в изборният курс ПРООС във ФМИ. \nКлючови думи: модел за дизайн на образователен софтуер, образователен софтуер, образователен \nдизайн, софтуерен дизайн.","authors":["Temenuzhka Zafirova-Malcheva","Pencho Mihnev"],"meta":["November 2016"],"references":["279868192_A_General_Model_for_Educational_Software_Design_and_Development","350782312_Task_Analysis_Methods_for_Instructional_Design","292795039_Managing_the_development_of_large_software_systems_Dr_Winston_W_Rovce_introduction","270879796_Step_by_step_in_design_of_educational_software_for_children_with_special_educational_needs","240249302_Software_Engineering_a_Practioner''s_approach","222708202_Pedagogy_Embedded_in_Educational_Software_Design_Report_of_a_Case_Study"]}