{"id":"309765295_Computer_Science_and_Technology_and_Engineering_Education_A_Content_Analysis_of_Standards_and_Curricular_Resources","abstract":"Recently there has been overwhelming political and financial support to include computer science (CS) in K-12 school curricula across the United States. With such strong support for CS it has been questioned where the subject would be best situated in already crowded K-12 curricula. Some have proposed integrating it within secondary level technology and engineering (T&E) courses (Ernst & Clark, 2007, 2009; Wright, Rich, & Leatham, 2012) or using CS courses in place of T&E education classes (Maryland State Department of Education [MSDE], 2016). To better inform decisions regarding CS in T&E education, this study used a multiple comparative case study (Yin, 2014) to analyze the alignment of subconcepts from the K-12 CS Framework with benchmarks from the International Technology and Engineering Educators Association's (ITEEA) Standards for Technological Literacy (STL). Additionally, a content analysis was conducted to examine curricular resources that claimed to teach CS concepts while addressing components of the STL's designed world. The purpose of the study was to investigate similarities and differences among both the CS and T&E standards and to identify curricular resources that successfully addressed multiple STL while integrating CS concepts. The findings revealed that there was limited alignment between the computational thinking and programming-focused CS framework and the broader engineering design and technology systems-focused STL. However, some curricular resources successfully used CS concepts to address many standards from the designed world section of the STL. From these findings, implications and recommendations for integrating CS within T&E education were provided.","authors":["Tyler S. Love","Greg J. Strimel"],"meta":["July 2017The Journal of Technology Studies 42(2):76-88","DOI:10.21061/jots.v42i2.a.2","Projects: Computer Science in Technology and Engineering EducationAdvancing Excellence in P-12 Engineering Education (AEEE) Project"],"references":["308023433_The_orange_pi_Integrating_programming_through_electronic_technology","308023279_Better_practices_for_recruiting_TE_Teachers","317953485_Case_study_research_design_and_methods","305196205_Technology-Based_Content_through_Virtual_and_Physical_Modeling_A_National_Research_Study","282844943_Tools_and_methodologies_for_teaching_robotics_in_computer_science_engineering_studies","253706531_STEM-Based_Computational_Modeling_for_Technology_Education","239582464_A_model_curriculum_for_k-12_computer_science_report_of_the_acm_k-12_education_task_force_computer_science_curriculum_committee","234710022_Scientific_and_Technical_Visualization_in_Technology_Education","228814081_Clarifying_misconceptions_between_technology_education_and_educational_technology","200465328_Case_Study_Research_Design_Methods"]}