{"id":"309797724_Resilience_Design_Patterns_-_A_Structured_Approach_to_Resilience_at_Extreme_Scale_version_10","abstract":"In this document, we develop a structured approach to the management of HPC resilience based on the concept of resilience-based design patterns. A design pattern is a general repeatable solution to a commonly occurring problem. We identify the commonly occurring problems and solutions used to deal with faults, errors and failures in HPC systems. The catalog of resilience design patterns provides designers with reusable design elements. We define a design framework that enhances our understanding of the important constraints and opportunities for solutions deployed at various layers of the system stack. The framework may be used to establish mechanisms and interfaces to coordinate flexible fault management across hardware and software components. The framework also enables optimization of the cost-benefit trade-offs among performance, resilience, and power consumption. The overall goal of this work is to enable a systematic methodology for the design and evaluation of resilience technologies in extreme-scale HPC systems that keep scientific applications running to a correct solution in a timely and cost-efficient manner in spite of frequent faults, errors, and failures of various types.","authors":["Saurabh Hukerikar","Christian Engelmann"],"meta":["November 2016"],"references":["308912502_RedThreads_An_Interface_for_Application-Level_Fault_DetectionCorrection_Through_Adaptive_Redundant_Multithreading","302376355_Rolex_Resilience-Oriented_Language_Extensions_for_Extreme-Scale_Systems","262327648_Static_Analysis_and_Compiler_Design_for_Idempotent_Processing","307843371_McrEngine_A_Scalable_Checkpointing_System_Using_Data-Aware_Aggregation_and_Compression","307689808_Containment_Domains_A_Scalable_Efficient_and_Flexible_Resilience_Scheme_for_Exascale_Systems","278700531_Springer_Series_in_Reliability_Engineering","271500916_Fault-Tolerant_Matrix_Operations_On_Multiple_Processor_Systems_Using_Weighted_Checksums","263957024_A_Case_for_Soft_Error_Detection_and_Correction_in_Computational_Chemistry","261453420_An_algorithmic_approach_to_error_localization_and_partial_recomputation_for_low-overhead_fault_tolerance","261272360_Containment_domains_A_scalable_efficient_and_flexible_resilience_scheme_for_exascale_systems"]}