{"id":"309797742_Predicting_User_Roles_in_Social_Networks_Using_Transfer_Learning_with_Feature_Transformation","abstract":"How can we recognise social roles of people, given a completely unlabelled social network? We may train a role classification algorithm on another dataset, but then that dataset may have largely different values of its features, for instance, the degrees in the other network may be distributed in a completely different way than in the first network. Thus, a way to transfer the features of different networks to each other or to a common\nfeature space is needed. This type of setting is called transfer learning. In this paper, we present a transfer learning approach to network role classification based on feature transformations from each network’s local feature distribution to a global feature space. We implement our approach and show experiments on real-world networks of discussions on Wikipedia as well as online forums. We also show a concrete application of our approach to an enterprise use case, where we predict the user roles in ARIS Community, the online platform for customers of Software AG, the second-largest German software vendor. Evaluation results\nshow that our approach is suitable for transferring knowledge of user roles across networks.","authors":["Jun Sun","Jérôme Kunegis","Steffen Staab"],"meta":["November 2016","DOI:10.1109/ICDMW.2016.0026","Conference: IEEE ICDMW 2016At: Barcelona, Spain"],"references":["324603211_Wiki-Talk_Datasets","230766603_How_Many_Trees_in_a_Random_Forest","314714044_Approximation_Theorems_of_Mathematical_Statistics","307631671_The_pagerank_citation_ranking_Bringing_order_to_the_web","301233236_Clustering_and_preferential_attachment_in_growing_networks","265782914_Chapter_5_Advanced_centrality_concepts","261805632_Approximation_Theorems_of_Mathematical_Statistics","254464199_RolX_Structural_role_extraction_mining_in_large_graphs","246279109_Fuzzy_decision_making_in_the_classification_of_multisource_remote_sensing_data","244976285_Praktische_Verfahren_der_Gleichungsauflosung"]}