{"id":"309705249_Gender_interest_and_prior_experience_shape_opportunities_to_learn_programming_in_robotics_competitions","abstract":"Background\nRobotics competitions are increasingly popular and potentially provide an on-ramp to computer science, which is currently highly gender imbalanced. However, within competitive robotics teams, student participation in programming is not universal. This study gathered surveys from over 500 elementary, middle, and high school robotics competition participants to examine (1) whether programming involvement in these competitions is associated with motivation to pursue additional programming experiences and (2) whether opportunities to learn programming varied by gender, age, and competition type. ResultsResults showed a significant association of students’ programming involvement with their motivation to learn more programming. Interestingly, in the youngest groups/entry-level competitions, girls were heavily involved in programming. Unfortunately, in older/more advanced competitions, girls were generally less involved in programming, even after controlling for prior programming experience. These gendered effects were substantially explained by programming interest. Conclusions\nWhile robotics competition experiences may motivate students to learn more programming, gender gaps in programming involvement persist in these learning environments and appear to widen as students grow older and enter more advanced competitions. Therefore, addressing gender imbalances in programming will likely require greater attention to particular curricular and pedagogical characteristics of robotics competitions that support girls’ interest and involvement in programming.","authors":["Eben B Witherspoon","Christian D Schunn","Ross M Higashi","Emily Baehr"],"meta":["November 2016International Journal of STEM Education 3(1):18","DOI:10.1186/s40594-016-0052-1","Project: Changing Cultures in Robotics Classrooms"],"references":["284043695_Educational_robotics_Open_questions_and_new_challenges","344835867_The_Impact_of_Participation_in_VEX_Robotics_Competition_on_Middle_and_High_School_Students'_Interest_in_Pursuing_STEM_Studies_and_STEM-related_Careers","344543718_C-STEM_Girls_Computing_and_Robotics_Leadership_Camp","317953505_Situated_learning_Legitimate_peripheral_participation","311473376_Unlocking_the_clubhouse_women_in_computing","298890552_Overview_of_feminist_perspectives_on_the_ideology_of_science","291440949_Social_cognitive_theory","290954535_Introducing_K-12_teachers_to_LEGO_mindstorm_robotics_through_a_collaborative_online_professional_development_course","289963536_Sex_differences_in_intrinsic_aptitude_for_mathematics_and_science_A_critical_review","283895348_RoboCupJunior_for_promoting_STEM_education_21st_century_skills_and_technological_advancement_through_robotics_competition"]}