{"id":"309738462_OSMNX_New_Methods_for_Acquiring_Constructing_Analyzing_and_Visualizing_Complex_Street_Networks","abstract":"Urban scholars have studied street networks in various ways, but there are data availability and consistency limitations to the current urban planning/street network analysis literature. To address these challenges, this article presents OSMnx, a new tool to make the collection of data and creation and analysis of street networks simple, consistent, automatable and sound from the perspectives of graph theory, transportation, and urban design. OSMnx contributes five significant capabilities for researchers and practitioners: first, the automated downloading of political boundaries and building footprints; second, the tailored and automated downloading and constructing of street network data from OpenStreetMap; third, the algorithmic correction of network topology; fourth, the ability to save street networks to disk as shapefiles, GraphML, or SVG files; and fifth, the ability to analyze street networks, including calculating routes, projecting and visualizing networks, and calculating metric and topological measures. These measures include those common in urban design and transportation studies, as well as advanced measures of the structure and topology of the network. Finally, this article presents a simple case study using OSMnx to construct and analyze street networks in Portland, Oregon.","authors":["Geoff Boeing"],"meta":["July 2017Computers Environment and Urban Systems 65:126-139","DOI:10.1016/j.compenvurbsys.2017.05.004","Project: OSMnx: New Methods for Acquiring, Constructing, Analyzing, and Visualizing Complex Street Networks"],"references":["318231876_An_Introduction_to_the_Network_Weight_Matrix_Introduction_to_the_Network_Weight_Matrix","316736537_A_Multi-Scale_Analysis_of_27000_Urban_Street_Networks_Every_US_City_Town_Urbanized_Area_and_Zillow_Neighborhood","304211222_A_protocol_to_convert_spatial_polyline_data_to_network_formats_and_applications_to_world_urban_road_networks","282607430_Geographically_Modified_PageRank_Algorithms_Identifying_the_Spatial_Concentration_of_Human_Movement_in_a_Geospatial_Network","280500135_Do_Physicists_Have_Geography_Envy_And_What_Can_Geographers_Learn_from_It","280218425_Location_and_Agglomeration_The_Distribution_of_Retail_and_Food_Businesses_in_Dense_Urban_Environments","305313684_Navigating_the_Range_of_Statistical_Tools_for_Inferential_Network_Analysis_STATISTICAL_TOOLS_FOR_INFERENTIAL_NETWORK_ANALYSIS","304182363_Spatial_Network_Analysis","298552418_Network_analysis_-_Methodological_foundations_-_Introduction","280566512_Networks_An_Introduction"]}