{"id":"309709501_Where_is_the_Virtual_Self_Virtual_Worlds_and_the_Self_as_a_Cyborg","abstract":"In the context of widespread availability of digital technology as a means for interacting with others, it is useful to explore the extent to which participation in online environments, such as virtual worlds, reflect a transformation in the experience of self in society. One approach is to consider how self emerges from the context provided by the interactions that occur across and within physical and virtual environments, through capturing the experience of someone as they actively engage with a virtual world. This can be done employing Subjective Evidence-Based Ethnography (SEBE) methodologies. SEBE involves first-person audiovisual recording of experience with a subcam (a miniature video-camera worn at eye level), followed by a Replay Interview (RIW) using the recording to collect participant subjective experience. In this study, participants' usage of the virtual world Second Life has been recorded, capturing the inworld virtual activity and the physical world context in which it is framed. Inductive thematic analysis of the data arising from the usage sessions and the RIWs reveals a number of findings. There are several levels of interaction occurring between the virtual world user, their avatar, other users, the virtual world technology, and the physical environment. The experience of self that emerges is one in multiple locations, bridged by technological mediation, such that someone who uses virtual worlds becomes a form of cyborg.","authors":["Simon Evans"],"meta":["November 2016Annual Review of CyberTherapy and Telemedicine 14(1):51-57"],"references":["290227141_An_Integrated_Approach_to_Interactions_in_Cyberplaces_the_presentation_of_Self_in_blogs","279058732_Virtual_Selves_Research_Perspectives_Exploring_the_Role_and_Implications_for_Taking_the_Insider_Perspective_in_Virtual_Worlds_Research","270687128_Subjective_Evidence_Based_Ethnography_Method_and_Applications","237231008_The_Self_in_Cultural-Historical_Activity_Theory","332311482_Virtual_Selves_Research_Perspectives_Exploring_the_Role_and_Implications_for_Taking_the_Insider_Perspective_in_Virtual_Worlds_Research","326219374_Qualitative_Research_for_the_Information_Professional_A_practical_handbook","292506038_The_Virtual_Self_A_Contemporary_Sociology","244492523_Qualitative_Research_for_the_Information_Professional","240729401_Digital_Ethnography_An_Examination_of_the_Use_of_New_Technologies_for_Social_Research","238680290_Studying_context_a_comparison_of_activity_theory"]}