{"id":"309762308_Fuzzy_Rule_Based_Systems_for_Interpretable_Sentiment_Analysis","abstract":"Sentiment analysis, which is also known as opinion mining, aims to recognise the attitude or emotion of people through natural language processing, text analysis and computational linguistics. In recent years, many studies have focused on sentiment classification in the context of machine learning, e.g. to identify that a sentiment is positive or negative. In particular, the bag-of-words method has been popularly used to transform textual data into structured data, in order to enable the direct use of machine learning algorithms for sentiment classification. Through the bag-of-words method, each single term in a text document is turned into a single attribute to make up a structured data set, which results in high dimensionality of the data set and thus negative impact on the interpretability of computational models for sentiment analysis. This paper proposes the use of fuzzy rule based systems as computational models towards accurate and interpretable analysis of sentiments. The use of fuzzy logic is better aligned with the inherent uncertainty of language, while the \" white box \" characteristic of the rule based learning approaches leads to better interpretability of the results. The proposed approach is tested on four datasets containing movie reviews; the aim is to compare its performance in terms of accuracy with two other approaches for sentiment analysis that are known to perform very well. The results indicate that the fuzzy rule based approach performs marginally better than the well-known machine learning techniques, while reducing the computational complexity and increasing the interpretability.","authors":["Han Liu","Ella Haig"],"meta":["February 2017","DOI:10.1109/ICACI.2017.7974497","Conference: International Conference on Advanced Computational IntelligenceAt: Doha, Qatar"],"references":["310768726_Automatic_Detection_of_Cyberbullying_on_Social_Networks_based_on_Bullying_Features","309209114_Classification_of_Sentiment_of_Reviews_using_Supervised_Machine_Learning_Techniques","283089580_Interpretability_of_Computational_Models_for_Sentiment_Analysis","280712409_Rule_Based_Systems_for_Big_Data_A_Machine_Learning_Approach","272795387_Classification_of_Sentimental_Reviews_Using_Machine_Learning_Techniques","262410730_Advanced_modelling_of_complex_processes_by_fuzzy_networks","254051434_Using_Machine_Learning_to_Detect_Cyberbullying","307175251_Induction_of_Decision_Trees","284026466_Generating_fuzzy_rules_by_learning_from_examples","277934530_Fuzzy_logic-a_personal_perspective"]}