{"id":"309750219_Intertemporal_Pricing_Under_Minimax_Regret","abstract":"We consider the pricing problem faced by a monopolist who sells a product to a population of consumers over a finite time horizon. Customers' types differ along two dimensions: (i) their willingness-to-pay for the product and (ii) their arrival time during the selling season. We assume that the seller knows only the support of the customers' valuations and do not make any other distributional assumptions about customers' willingness-to-pay or arrival times.We consider a robust formulation of the seller's pricing problem that is based on the minimization of her worst-case regret. We consider two distinct cases of customers' purchasing behavior: myopic and strategic customers. For both of these cases, we characterize optimal price paths. For myopic customers, the regret is determined by the price at a critical time. Depending on the problem parameters, this critical time will be either the end of the selling season or it will be a time that equalizes the worst-case regret generated by undercharging customers and the worst-case regret generated by customers waiting for the price to fall. The optimal pricing strategy is not unique except at the critical time. For strategic consumers,we develop a robust mechanism design approach to compute an optimal policy. Depending on the problem parameters, the optimal policy might lead some consumers to wait until the end of the selling season and might price others out of the market. Under strategic customers, the optimal price equalizes the regrets generated by different customer types that arrive at the beginning of the selling season. We show that a seller that does not know if the customers are myopic should price as if they are strategic. We also show there is no benefit under myopic consumers to having a selling season longer than a certain uniform bound, but that the same is not true with strategic consumers.","authors":["René Caldentey","Ying Liu","Ilan Lobel"],"meta":["November 2016Operations Research 65(1)","DOI:10.1287/opre.2016.1548"],"references":["261331426_Dynamic_Mechanism_Design_A_Myersonian_Approach","5161709_Context_dependence_and_consistency_in_dynamic_choice_under_uncertainty_The_case_of_anticipated_regret","266708128_The_Theory_and_Practice_of_Revenue_Management","24092606_Inter-Temporal_Price_Discrimination"]}