{"id":"309705769_First-Cycle_Games","abstract":"First-cycle games (FCG) are played on a finite graph by two players who push a token along the edges until a vertex is repeated, and a simple cycle is formed. The winner is determined by some fixed property Y of the sequence of labels of the edges (or nodes) forming this cycle. These games are intimately connected with classic infinite-duration games such as parity and mean-payoff games. We initiate the study of FCGs in their own right, as well as formalise and investigate the connection between FCGs and certain infinite-duration games.\nWe establish that (for efficiently computable Y) the problem of solving FCGs is Pspace-complete; we show that the memory required to win FCGs is, in general, Θ(n)! (where n is the number of nodes in the graph); and we give a full characterisation of those properties Y for which all FCGs are memoryless determined.\nWe formalise the connection between FCGs and certain infinite-duration games and prove that strategies transfer between them. Using the machinery of FCGs, we provide a recipe that can be used to very easily deduce that many infinite-duration games, e.g., mean-payoff, parity, and energy games, are memoryless determined.","authors":["Benjamin Aminof","Sasha Rubin"],"meta":["November 2016Information and Computation 254(1–2)","DOI:10.1016/j.ic.2016.10.008"],"references":["235885316_Energy_Parity_Games","220994847_DAG-width_and_parity_games","220897038_Half-Positional_Determinacy_of_Infinite_Games","220701025_Games_Where_You_Can_Play_Optimally_Without_Any_Memory","220643239_Exploring_the_boundary_of_half-positionality","345829681_13_Infinite_Games_with_Perfect_Information","261369028_First_Cycle_Games","251232095_Alternating_Traps_in_Muller_and_Parity_Games","243722673_In_nite_games_with_perfect_information","226645887_Positional_strategies_for_mean_payoff_games","222785304_The_complexity_of_mean_payoff_games_on_graphs","220148647_Memoryless_determinacy_of_parity_and_mean_payoff_games_A_simple_proof"]}