{"id":"309797568_Delving_into_Transferable_Adversarial_Examples_and_Black-box_Attacks","abstract":"An intriguing property of deep neural networks is the existence of adversarial examples, which can transfer among different architectures. These transferable adversarial examples may severely hinder deep neural network-based applications. Previous works mostly study the transferability using small scale datasets. In this work, we are the first to conduct an extensive study of the transferability over large models and a large scale dataset, and we are also the first to study the transferability of targeted adversarial examples with their target labels. We study both non-targeted and targeted adversarial examples, and show that while transferable non-targeted adversarial examples are easy to find, targeted adversarial examples generated using existing approaches almost never transfer with their target labels. Therefore, we propose novel ensemble-based approaches to generating transferable adversarial examples. Using such approaches, we observe a large proportion of targeted adversarial examples that are able to transfer with their target labels for the first time. We also present some geometric studies to help understanding the transferable adversarial examples. Finally, we show that the adversarial examples generated using ensemble-based approaches can successfully attack Clarifai.com, which is a black-box image classification system.","authors":["Yanpei Liu","Xinyun Chen","Chang Liu","Dawn Song"],"meta":["November 2016"],"references":["309460742_Universal_adversarial_perturbations","305196650_Going_deeper_with_convolutions","303490367_Transferability_in_Machine_Learning_from_Phenomena_to_Black-Box_Attacks_using_Adversarial_Samples","301875216_Practical_Black-Box_Attacks_against_Deep_Learning_Systems_using_Adversarial_Examples","269935591_Explaining_and_Harnessing_Adversarial_Examples","306226844_Towards_Evaluating_the_Robustness_of_Neural_Networks","306218037_Learning_multiple_layers_of_features_from_tiny_images","286512696_Deep_Residual_Learning_for_Image_Recognition","269935079_Adam_A_Method_for_Stochastic_Optimization","265385906_Very_Deep_Convolutional_Networks_for_Large-Scale_Image_Recognition"]}