{"id":"309799617_Using_machine_learning_to_parse_breast_pathology_reports","abstract":"Purpose: \nExtracting information from electronic medical record is a time-consuming and expensive process when done manually. Rule-based and machine learning techniques are two approaches to solving this problem. In this study, we trained a machine learning model on pathology reports to extract pertinent tumor characteristics, which enabled us to create a large database of attribute searchable pathology reports. This database can be used to identify cohorts of patients with characteristics of interest.\n\nMethods: \nWe collected a total of 91,505 breast pathology reports from three Partners hospitals: Massachusetts General Hospital, Brigham and Women's Hospital, and Newton-Wellesley Hospital, covering the period from 1978 to 2016. We trained our system with annotations from two datasets, consisting of 6295 and 10,841 manually annotated reports. The system extracts 20 separate categories of information, including atypia types and various tumor characteristics such as receptors. We also report a learning curve analysis to show how much annotation our model needs to perform reasonably.\n\nResults: \nThe model accuracy was tested on 500 reports that did not overlap with the training set. The model achieved accuracy of 90% for correctly parsing all carcinoma and atypia categories for a given patient. The average accuracy for individual categories was 97%. Using this classifier, we created a database of 91,505 parsed pathology reports.\n\nConclusions: \nOur learning curve analysis shows that the model can achieve reasonable results even when trained on a few annotations. We developed a user-friendly interface to the database that allows physicians to easily identify patients with target characteristics and export the matching cohort. This model has the potential to reduce the effort required for analyzing large amounts of data from medical records, and to minimize the cost and time required to glean scientific insight from these data.","authors":["Adam Yala","Regina Barzilay","Laura Salama","Molly Griffin"],"meta":["January 2017Breast Cancer Research and Treatment 161(2)","DOI:10.1007/s10549-016-4035-1","Project: AI/NLP to parse pathology reports into structured useful data"],"references":["280060008_Validation_of_natural_language_processing_to_extract_breast_cancer_pathology_procedures_and_results","230764022_The_feasibility_of_using_natural_language_processing_to_extract_clinical_information_from_breast_pathology_reports","216591579_Information_Extraction_of_Multiple_Categories_from_Pathology_Reports","44901834_Symbolic_rule-based_classification_of_lung_cancer_stages_from_free-text_pathology_reports","301448970_Creating_a_rule_based_system_for_text_mining_of_Norwegian_breast_cancer_pathology_reports","289588685_Structured_pathology_reporting_for_cancer_from_free_text_Lung_cancer_case_study","243134514_BoosTexter_A_Boosting-based_System_for_Text_Categorization","241622397_Information_extraction_from_pathology_reports_in_a_hospital_setting","216591583_Text_mining_in_a_hospital_setting_information_extraction_from_pathology_reports","45283697_Pattern-based_information_extraction_from_pathology_reports_for_cancer_registration"]}