{"id":"309722038_Investigating_Foreign_Language_Speaking_Anxiety_within_the_EFL_Learner's_Interlanguage_System_The_Case_of_Iranian_Learners","abstract":"The present study is an attempt to investigate the status of the EFL learner's interlanguage system as dealt with foreign language (FL) speaking anxiety in the classroom. The objective of the study is first to specifically determine the extent to which Iranian EFL learners attribute their FL speaking anxiety to the constituents of their interlanguage system and second to indicate the related gender and level-based differences among the participants. To this end, the researcher divided the general notion of interlanguage system into its three main researchable constituents: interlanguage phonology, interlanguage grammar, and 'interlanguage meaning system' and then attempted to design a self-reporting questionnaire with a five Likert-type scale mainly on the basis of FLCAS developed by Horwitz, et. al. (1986). After analyzing the results, the findings indicated that the participants were more likely to attribute their most FL speaking anxiety experienced in the classroom to their interlanguage meaning system as compare with the other two subsets of their interlanguage system. In terms of the gender differences, the results suggested that the female participants were found to be more prone to experiencing FL speaking anxiety within the framework of their interlanguage system. With respect to level differences, the results demonstrated that gaining more FL knowledge may not necessarily lead to a substantial reduction in experiencing FL speaking anxiety, since more proficient participants were more subject to the anxiety-provoking factors within their interlanguage system than less proficient participants.","authors":["Masoud Mahmoodzadeh"],"meta":["May 2012Journal of Language Teaching and Research 3(3):466-476","DOI:10.4304/jltr.3.3.466-476"],"references":["339626408_Quiet_Apprehension_Reading_and_Classroom_Anxieties","313172357_Willingness_to_communicate_a_cognitive_view","303285076_STAI_manual_for_the_state-trait_anxiety_inventory","298935994_Anxiety_and_reading_comprehension_in_Spanish_as_a_foreign_language","288826177_Nonverbal_cues_Clues_to_the_detection_of_foreign_language_anxiety","284908113_Competitiveness_and_anxiety_in_adult_second_language_learning_Looking_at_and_Through_the_Diary_Studies","284777528_Willingness_to_communicate","284666525_Writing_apprehension_self-esteem_and_personality","284306210_Language_anxiety_From_theory_and_research_to_classroom_implications","283808631_A_Study_of_High_School_Students'_English_Learning_Anxiety"]}