{"id":"309730116_Multiple-Speaker_Localization_Based_on_Direct-Path_Features_and_Likelihood_Maximization_with_Spatial_Sparsity_Regularization","abstract":"This paper addresses the problem of multiple-speaker localization in noisy and reverberant environments, using binaural recordings of an acoustic scene. A Gaussian mixture model (GMM) is adopted, whose components correspond to all the possible candidate source locations defined on a grid. After optimizing the GMM-based objective function, given an observed set of binaural features, both the number of sources and their locations are estimated by selecting the GMM components with the largest priors. This is achieved by enforcing a sparse solution, thus favoring a small number of speakers with respect to the large number of initial candidate source locations. An entropy-based penalty term is added to the likelihood, thus imposing sparsity over the set of GMM priors. In addition, the direct-path relative transfer function (DP-RTF) is used to build robust binaural features. The DP-RTF, recently proposed for single-source localization, was shown to be robust to reverberations, since it encodes inter-channel information corresponding to the direct-path of sound propagation. In this paper, we extend the DP-RTF estimation to the case of multiple sources. In the short-time Fourier transform domain, a consistency test is proposed to check whether a set of consecutive frames is associated to the same source or not. Reliable DP-RTF features are selected from the frames that pass the consistency test to be used for source localization. Experiments carried out using both simulation data and real data gathered with a robotic head confirm the efficiency of the proposed multi-source localization method.","authors":["Xiaofei li","Laurent Girin","Sharon Gannot","Radu Horaud"],"meta":["November 2016IEEE/ACM Transactions on Audio, Speech, and Language Processing PP(99)","DOI:10.1109/taslp.2017.2740001"],"references":["308863917_Estimation_of_Relative_Transfer_Function_in_the_Presence_of_Stationary_Noise_Based_on_Segmental_Power_Spectral_Density_Matrix_Subtraction","308804407_Rectified_binaural_ratio_A_complex_T-distributed_feature_for_robust_sound_localization","305911215_Local_Relative_Transfer_Function_for_Sound_Source_Localization","322921358_Binaural_sound_localization","312288647_Rectified_binaural_ratio_A_complex_T-distributed_feature_for_robust_sound_localization","311758328_Reverberant_sound_localization_with_a_robot_head_based_on_direct-path_relative_transfer_function","309433629_Multi-speaker_DOA_estimation_in_reverberation_conditions_using_expectation-maximization","309207368_Semi-Supervised_Source_Localization_on_Multiple_Manifolds_With_Distributed_Microphones","305886576_Estimation_of_the_Direct-Path_Relative_Transfer_Function_for_Supervised_Sound-Source_Localization","297645912_Performance_analysis_of_the_covariance_subtraction_method_for_relative_transfer_function_estimation_and_comparison_to_the_covariance_whitening_method"]}