{"id":"309848750_A_Robust_Iterated_Extended_Kalman_Filter_for_Power_System_Dynamic_State_Estimation","abstract":"This paper develops a robust iterated extended Kalman filter based on the generalized maximum likelihood approach (termed GM-IEKF) for estimating power system state dynamics when subjected to disturbances. The proposed GM-IEKF dynamic state estimator is able to track system transients in a faster and more reliable way than the conventional extended Kalman filter (EKF) and the unscented Kalman filter (UKF) thanks to its batch-mode regression form and its robustness to innovation and observation outliers, even in position of leverage. Innovation outliers may be caused by impulsive noise in the dynamic state model while observation outliers may be due to large biases, cyber attacks, or temporary loss of communication links of PMUs. Good robustness and high statistical efficiency under Gaussian noise are achieved via the minimization of the Huber convex cost function of the standardized residuals. The latter is weighted via a function of robust distances of the two-time sequence of the predicted state and innovation vectors and calculated by means of the projection statistics. The state estimation error covariance matrix is derived using the total influence function, resulting in a robust state prediction in the next time step. Simulation results carried out on the IEEE 39-bus test system demonstrate the good performance of the GM-IEKF under Gaussian and non-Gaussian process and observation noise.","authors":["Junbo Zhao","Marcos Netto","Lamine Mili"],"meta":["July 2017Power Systems, IEEE Transactions on 32(4):3205-3216","DOI:10.1109/TPWRS.2016.2628344","Project: Development of Robust Dynamic State Estimator for Power System Monitoring and Control"],"references":["312944531_Robust_Dynamic_State_Estimator_to_Outliers_and_Cyber_Attacks","309790315_A_Multi-Step_Adaptive_Interpolation_Approach_to_Mitigating_the_Impact_of_Nonlinearity_on_Dynamic_State_Estimation","275968575_PMU_Based_Robust_Dynamic_State_Estimation_Method_for_Power_Systems","316115971_Derivative-Free_Kalman_Filtering_Based_Approaches_to_Dynamic_State_Estimation_for_Power_Systems_With_Unknown_Inputs","308845527_Capturing_real-time_power_system_dynamics_Opportunities_and_challenges","308536305_Dynamic_State_Estimation_Based_Protection_Status_and_Promise","302330808_On-Line_State_Estimation","299555163_Linear_Phasor_Estimator_Assisted_Dynamic_State_Estimation","279383941_Energy_Function_Analysis_for_Power_System_Stability","279366112_Energy_Function_Analysis_for_Power_System_Stability"]}