{"id":"309853011_EEG-based_neuroergonomics_for_3D_user_interfaces_opportunities_and_challenges","abstract":"Les interfaces utilisateurs 3D sont utilisees dans un nombre croissant d’applications, qui vont du divertissement au design industriel. Cependant, les tâches d’interaction 3D sont en general plus complexes pour les utilisateurs etant-donne qu’il est plus demandeur au niveau cognitif d’interagir avec un environnement en 3D que de percevoir et d’interagir avec un environnement en 2D. Ainsi, il est essentiel que nous puissions finement evaluer l’experience utilisateur, afin de proposer des interfaces faciles d’utilisation. Pour ce faire, une direction de recherche prometteuse est de mesurer l’etat interne des utilisateurs via l’acquisition de signaux cerebraux pendant l’interaction, en suivant une approche neuro­ergonomique. Combine a des methodes existantes, un tel outil peut etre utilise pour ameliorer la comprehension de l’experience utilisateur. Dans cet article, nous passons en revue le travail qui est mene dans ce domaine ; ce qui a deja ete accompli et les challenges qui se font jour. Nous decrivons comment une technique d’imagerie cerebrale mobile telle que l’electroencephalographie (EEG) permet des mesures continues qui ne perturbent pas l’interaction. Une evaluation des utilisateurs centree sur l’EEG peut donner un apercu de multiples dimensions de l’experience utilisateur, avec des taches d’interaction realistes ou des interfaces novatrices. Nous etudions quatre construits : la charge mentale, l’attention, la reconnaissance d’erreur et le confort visuel. A terme, ces metriques pourraient aider a soulager les utilisateurs lorsqu’ils interagissent avec des ordinateurs.","authors":["Jérémy Frey","Martin Hachet","Fabien Lotte"],"meta":["January 2016Le Travail Humain 80(1)","DOI:10.3917/th.801.0073"],"references":["312283185_Review_of_the_Use_of_Electroencephalography_as_an_Evaluation_Method_for_Human-Computer_Interaction","305084770_Leveraging_human-computer_interactions_and_social_presence_with_physiological_computing","290527551_Framework_for_Electroencephalography-based_Evaluation_of_User_Experience","283330597_Classifying_EEG_Signals_during_Stereoscopic_Visualization_to_Estimate_Visual_Comfort","277605013_Signal_Processing_Approaches_to_Minimize_or_Suppress_Calibration_Time_in_Oscillatory_Activity-Based_Brain-Computer_Interfaces","277334018_Estimating_Visual_Comfort_in_Stereoscopic_Displays_Using_Electroencephalography_A_Proof-of-Concept","305219626_Telling_more_than_we_can_know_Verbal_reports_on_mental_processes","286105138_BCI_Hardware_and_Software","281050145_A_Survey_of_Interaction_Techniques_for_Interactive_3D_Environments","266863830_Display_Technology_and_Ambient_Display_Technology_and_Ambient_Illumination_Influences_on_Visual_Illumination_Influences_on_Visual_Fatigue_at_VDT_Workstations_Fatigue_at_VDT_Workstations"]}