{"id":"309822984_Solving_vertex_coloring_problems_as_maximum_weight_stable_set_problems","abstract":"In Vertex Coloring Problems, one is required to assign a color to each vertex of an undirected graph in such a way that adjacent vertices receive different colors, and the objective is to minimize the cost of the used colors. In this work we solve four different coloring problems formulated as Maximum Weight Stable Set Problems on an associated graph. We exploit the transformation proposed by Cornaz and Jost (2008), where given a graph , an auxiliary graph is constructed, such that the family of all stable sets of is in one-to-one correspondence with the family of all feasible colorings of . The transformation in Cornaz and Jost (2008) was originally proposed for the classical Vertex Coloring and the Max-Coloring problems; we extend it to the Equitable Coloring Problem and the Bin Packing Problem with Conflicts. We discuss the relation between the Maximum Weight Stable formulation and a polynomial-size formulation for the VCP, proposed by Campêlo et al. (2008) and called the Representative formulation. We report extensive computational experiments on benchmark instances of the four problems, and compare the solution method with the state-of-the-art algorithms. By exploiting the proposed method, we largely outperform the state-of-the-art algorithm for the Max-coloring Problem, and we are able to solve, for the first time to proven optimality, 14 Max-coloring and 2 Equitable Coloring instances.","authors":["Denis Cornaz","Fabio Furini","Enrico Malaguti"],"meta":["September 2016Discrete Applied Mathematics 217(18)","DOI:10.1016/j.dam.2016.09.018"],"references":["257658033_Exact_weighted_vertex_coloring_via_branch-and-price","303405566_Lower_Bounding_Techniques_for_DSATUR-based_Branch_and_Bound","270850329_A_New_Algorithm_for_the_Maximum-Weight_Clique_Problem","268167798_The_Grouping_Genetic_Algorithm","262161320_A_Branch-and-Price_Algorithm_for_the_Bin_Packing_Problem_with_Conflicts","257786613_Maximum-Weight_Stable_Sets_and_Safe_Lower_Bounds_For_Graph_Coloring","257479869_Chromatic_Gallai_identities_operating_on_Lovasz_number","251515264_A_branch-and-cut_algorithm_for_the_equitable_coloring_problem_using_a_formulation_by_representatives","242401887_A_Graph_Coloring_Algorithm_for_Large_Scheduling_Problems","237077361_A_new_DSATUR-based_algorithm_for_the_Equitable_Coloring_Problem"]}