{"id":"309884420_A_Pedagogical_Module_Framework_to_Improve_Scaffolded_Active_Learning_in_Manufacturing_Engineering_Education","abstract":"Recent interest in improving pedagogical approaches in science, technology, engineering, and mathematics (STEM) fields has stimulated research at many universities. Several educational methodologies are reviewed in the context of manufacturing and through the lens of sustainability. It is found that there is a need to identify and understand the STEM educational challenges, and to assess the usefulness of existing methodologies using case-based analyses. In particular, this research aims to support student learning in manufacturing engineering through real-time process evaluations. A pedagogical framework is presented that can assist engineering educators in developing learning modules in support of this goal. The framework encompasses four steps: define the learning outcomes, create instructional resources, create active learning resources, and create a summative assessment mechanism. The framework emphasizes engagement of manufacturing engineering students in psychomotor learning, which remains a challenge due to the high cost of instructional laboratories. The framework is applied to develop a participatory pedagogy for manufacturing courses through the use of computer numerical control of manufacturing operations, and real-time monitoring, visualization, and data analysis of machine energy use. The framework is demonstrated for upper-level undergraduate and graduate manufacturing engineering courses at two universities (i.e., Computer-Aided Design and Manufacturing at Oregon State University and Precision Manufacturing at University of California, Berkeley). It is found that the framework can effectively support learning module development in manufacturing engineering education.","authors":["Amin Mirkouei","Raunak Bhinge","Chris D. McCoy","Karl R. Haapala"],"meta":["December 2016Procedia Manufacturing 5:1128-1142","DOI:10.1016/j.promfg.2016.08.088","Conference: Procedia Manufacturing - SME NAMRC","Project: Advanced Manufacturing Concepts"],"references":["340806614_Benchmarking_sustainable_engineering_education_Final_report","286418563_Real-Time_Energy_Prediction_for_a_Milling_Machine_Tool_Using_Sparse_Gaussian_Process_Regression","286418365_A_Generalized_Data-Driven_Energy_Prediction_Model_With_Uncertainty_for_a_Milling_Machine_Tool_Using_Gaussian_Process","281738651_An_intelligent_machine_monitoring_system_for_energy_prediction_using_a_Gaussian_Process_regression","271524319_Industrial_Internet_Pushing_the_boundaries_of_minds_and_machines","268291945_Emerging_Global_Trends_in_Advanced_Manufacturing","285747137_Energy_and_social_issues","284752251_German_Low_Fertility_Issue_and_Recently_Changing_Correspondence","275277878_Smart_Manufacturing","273596688_Case-based_analysis"]}