{"id":"309897059_Open_Source_Database_and_Website_to_Provide_Free_and_Open_Access_to_Inactive_US_Patents_in_the_Public_Domain","abstract":"Although theoretically the patent system is meant to bolster innovation, the current United States Patent and Trademark Office (USPTO) is cumbersome and involves a significant time investment to locate inactive patents less than 20 years old. This article reports on the development of an open source database to find these public domain ideas. First, a search strategy is explained. Then the operation and use of free and open source software are detailed to meet the needs of open hardware innovators. Finally, a case study is presented to demonstrate the utility of the approach with 3-D printing. The results showed how the Free Inactive Patent Search enables users to search using plain language text to find public domain concepts and then provides a hyperlinked list of ideas that takes users to the USPTO database for the patent for more information. All of the source code to operate the search and the website are open source themselves and provided in the public domain for free. In the case study on 3-D printing the time to identify public domain patents was cut by a factor of more than 1500. This tool has the potential for accelerating the development of open hardware technologies to create high value for the public.","authors":["Yuenyong Nilsiam","Joshua M Pearce"],"meta":["November 2016Inventions 1(4):24","DOI:10.3390/inventions1040024"],"references":["298905580_Financing_and_collaboration_on_research_and_development_for_nodding_syndrome","296622599_Innovation_Experiments_Researching_Technical_Advance_Knowledge_Production_and_the_Design_of_Supporting_Institutions","291375376_Global_value_chains_from_a_3D_printing_perspective","288841990_Do_Patent_Licensing_Demands_Mean_Innovation","332904542_How_Open_Source_Software_Works_'Free'_User-to-User_Assistance","315435437_The_Case_for_Weaker_Patents","298116269_The_intellectual_property_audit","291293162_3D_printing_and_humanity's_first_imperfect_replicator","286785421_Can_patents_deter_innovation","286218568_Open_source_Technology_and_policy"]}