{"id":"309895790_Sufficient_conditions_for_Hamiltonicity_in_multiswapped_networks","abstract":"OTIS networks are interconnection networks amenable to deployment as hybrid networks containing both electronic and optical links. Deficiencies as regards symmetry led to the subsequent formulation of biswapped networks which were later generalized to multiswapped networks so as to still enable optoelectronic implementation (as it happens, multiswapped networks also generalize previously studied hierarchical crossed cubes). Multiswapped networks of the form are known to possess good (graph-theoretic) properties as regards their use as (optoelectronic) interconnection networks (in distributed-memory multiprocessors) and in relation to those of the component networks and . Combinatorially they provide a hierarchical mechanism to define new networks from existing networks (so that the properties of the new network can be controlled in terms of the constituent networks). In this paper we prove that if and are Hamiltonian networks then the multiswapped network is also Hamiltonian. At the core of our proof is finding specially designed Hamiltonian cycles in 2-dimensional and heavily pruned 3-dimensional tori, irrespective of the actual networks and we happen to be working with. This lends credence to the role of tori as fundamental networks within the study of interconnection networks.","authors":["Iain Stewart"],"meta":["November 2016Journal of Parallel and Distributed Computing 101","DOI:10.1016/j.jpdc.2016.10.015"],"references":["275118503_Five-Round_Adaptive_Diagnosis_in_Hamiltonian_Networks","261108198_Fault-Tolerant_Routing_Algorithm_for_3D_NoC_Using_Hamiltonian_Path_Strategy","259516211_Searching_for_a_black_hole_in_interconnected_networks_using_mobile_agents_and_tokens","302476581_Vertex-disjoint_paths_in_DCell_networks","283984589_An_efficient_algorithm_to_construct_disjoint_path_covers_of_DCell_networks","275724081_Hamiltonian_Properties_of_DCell_Networks","268863546_Topological_Structure_and_Analysis_of_Interconnection_Networks","266660164_FireFly_A_Reconfigurable_Wireless_Data_Center_Fabric_Using_Free-Space_Optics","261490285_Optimizing_the_Energy_Efficiency_of_Message_Exchanging_for_Service_Distribution_in_Interoperable_Infrastructures","259509097_A_survey_on_architectures_and_energy_efficiency_in_Data_Center_Networks"]}