{"id":"309965556_Effect_of_a_long-chain_n-3_polyunsaturated_fatty_acid-enriched_diet_on_adipose_tissue_lipid_profiles_and_gene_expression_in_Holstein_dairy_cows","abstract":"The objective of this study was to determine whether fish oil supplement has an effect on adipose tissue lipid profiles and gene expression in postpartum dairy cows. Holstein cows were supplemented with either long-chain n-3 polyunsaturated fatty acid (PUFA; protected fish oil) or control PUFA (n-6; toasted soybeans) for 2 mo after calving (n = 23 per diet). These cows showed no difference in milk production or metabolic parameters, but exhibited a tendency toward a decrease in early embryo mortality rate after artificial insemination. We hypothesized that, in addition to this effect, modifications in adipose tissue (AT) gene expression and lipid profiles would occur in response to diet. Subcutaneous AT samples were thus collected from the dewlaps of n-3 and n-6 dairy cows at 1 mo antepartum, and 1 wk, 2 mo, and 5 mo postpartum for the analysis of lipids and gene expression. Lipid profiles were obtained by matrix-assisted laser desorption/ionization time-of-flight mass spectrometry in both positive and negative modes. We found 37 lipid species in the 200 to 1,200 m/z range, which differed between the n-3 and control groups, suggesting that the n-3 supplement affected the lipid composition through the enrichment of lipids integrating long-chain PUFA from fish oil sources: eicosapentaenoic and docosahexaenoic acid. Moreover, a decrease in triacylglycerolipids was observed in AT of n-3 supplemented cows. The expression of 44 genes involved in fatty acid metabolism and the adipokine system was assessed by real-time reverse-transcription PCR. Hierarchical clustering, according to either postpartum stage or diet, enabled us to group genes exhibiting similar kinetic properties during lactation or by those that varied in similar ways after n-3 supplementation, respectively. Among the genes exhibiting a dietary effect, FABP4, LIPE, CD36, and PLIN1 were overexpressed in n-3 AT samples compared with the control, suggesting an increase in lipolysis due to n-3 supplementation, which was reflected on lipolytic activity at the protein level (i.e., protein expression of fatty acid binding protein 4, phosphorylated perilipin 1, and phosphorylated hormone-sensitive lipase). This increase in lipolysis is relevant to the decrease in triglycerides observed in these samples. Gene expression analyses between n-3 and control AT samples also suggested that the n-3 diet could modulate the secretory functions of AT, possibly by affecting adipokine expression; however, this has to be confirmed at the protein level.","authors":["Sebastien Elis","Alice Desmarchais","Sandrine Freret","Virginie Maillard"],"meta":["December 2016Journal of Dairy Science 99(12):10109-10127","DOI:10.3168/jds.2016-11052","Project: N-3 PUFA effects on dairy cows reproduction"],"references":["284563674_Effect_of_a_long_chain_n-3_PUFA-enriched_diet_on_production_and_reproduction_variables_in_Holstein_dairy_cows","352471592_Primer3_on_the_WWW_for_General_Users_and_for_Biologist_Programmers","318393858_R_A_Language_and_Environment_for_Statistical_Computing","318393770_R_A_Language_and_Environment_for_Statistical_Computing","313674937_A_simple_method_for_the_isolation_and_purification_of_total_lipids_from_animal_tissue","303868925_Effect_of_pre-_and_post-partum_supplementation_with_lipid-encapsulated_conjugated_linoleic_acid_on_milk_yield_and_metabolic_status_in_multiparous_high-producing_dairy_cows","289701417_Eicosapentaenoic_acid_membrane_incorporation_impairs_ABCA1-dependent_cholesterol_efflux_via_a_protein_kinase_A_signaling_pathway_in_primary_human_macrophages","288490791_Erratum_Extremely_limited_synthesis_of_long-chain_polyunsaturates_in_adults_implications_for_their_dietary_essentiality_and_use_as_supplements","285028466_Cluster_analysis_and_display_of_genome-wide_expression_patterns","283360025_A_simple_method_for_the_isolation_and_purification_of_total_lipids_from_animal_Tissues"]}