{"id":"309961786_Effects_of_Field_Plate_on_the_Maximum_Temperature_and_Temperature_Distribution_for_GaN_HEMT_Devices","abstract":"Field plated GaN high electron mobility transistors (HEMTs) are widely preferred amongst other GaN HEMT devices because of their ability to regulate electric field at high power densities. When operated at high power densities, GaN HEMTs suffer significantly from the concentrated heating effects in a small region called hotspot located closer to the drain edge of the gate. Although; the stabilizing effect of field plate on the electrical field distribution in HEMTs is known by researchers, its effect on temperature distribution and the hotspot temperature is still not studied to a greater extend. For this purpose, finite element thermal modelling of devices with different sizes of field plates are performed using the joule heating distribution data obtained from 2D electrical simulations. Results obtained from such combined model show that the existence of a field plate changes the electrical field, therefore the heat generation distribution within device. Moreover; increasing the size of the field plate has an effect on the maximum temperature at the hotspot region. The results are used to analyze these effects and improve usage of field plates for high electron mobility transistors to obtain better temperature profiles.\nCopyright © 2016 by ASME Country-Specific Mortality and Growth Failure in Infancy and Yound Children and Association With Material Stature\nUse interactive graphics and maps to view and sort country-specific infant and early dhildhood mortality and growth failure data and their association with maternal","authors":["Dogacan Kara","Nazli Donmezer","Talha Furkan Canan","Ozlem A. Sen"],"meta":["July 2016","DOI:10.1115/HT2016-7367","Conference: ASME 2016 Heat Transfer Summer Conference collocated with the ASME 2016 Fluids Engineering Division Summer Meeting and the ASME 2016 14th International Conference on Nanochannels, Microchannels, and Minichannels","Project: GaN HEMT Work"],"references":["271891968_Effect_of_Field_Plate_on_the_RF_Performance_of_AlGaNGaN_HEMT_Devices","234944980_Determination_of_polarization_charge_density_on_interface_of_AlGaNGaN_heterostructure_by_electroreflectance","3075479_On_the_Substrate_Thermal_Optimization_in_SiC-Based_Backside-Mounted_High-Power_GaN_FETs","281766232_Study_of_the_power_performance_of_gaN_based_HEMTs_with_varying_field_plate_lengths","262417666_The_Impact_of_Noncontinuum_Thermal_Transport_on_the_Temperature_of_AlGaNGaN_HFETs","230981315_Electro-thermo-mechanical_modeling_of_GaN-based_HFETs_and_MOSHFETs","222731084_High-temperature_modeling_of_AlGaNGaN_HEMTs","4348277_Reliability_assessment_of_AlGaNGaN_HEMT_technology_on_SiC_for_48V_applications","3254584_Thermal_modeling_and_measurement_of_GaN-based_HFET_devices","3074659_AlGaNGaN_power_HFET_on_silicon_substrate_with_source-via_grounding_SVG_structure"]}