{"id":"309957405_Mesh_denoising_via_cascaded_normal_regression","abstract":"We present a data-driven approach for mesh denoising. Our key idea is to formulate the denoising process with cascaded non-linear regression functions and learn them from a set of noisy meshes and their ground-truth counterparts. Each regression function infers the normal of a denoised output mesh facet from geometry features extracted from its neighborhood facets on the input mesh and sends the result as the input of the next regression function. Specifically, we develop a filtered facet normal descriptor (FND) for modeling the geometry features around each facet on the noisy mesh and model a regression function with neural networks for mapping the FNDs to the facet normals of the denoised mesh. To handle meshes with different geometry features and reduce the training difficulty, we cluster the input mesh facets according to their FNDs and train neural networks for each cluster separately in an offline learning stage. At runtime, our method applies the learned cascaded regression functions to a noisy input mesh and reconstructs the denoised mesh from the output facet normals.\nOur method learns the non-linear denoising process from the training data and makes no specific assumptions about the noise distribution and geometry features in the input. The runtime denoising process is fully automatic for different input meshes. Our method can be easily adapted to meshes with arbitrary noise patterns by training a dedicated regression scheme with mesh data and the particular noise pattern. We evaluate our method on meshes with both synthetic and real scanned noise, and compare it to other mesh denoising algorithms. Results demonstrate that our method outperforms the state-of-the-art mesh denoising methods and successfully removes different kinds of noise for meshes with various geometry features.","authors":["Peng-Shuai Wang","Yang Liu","Xin Tong"],"meta":["November 2016ACM Transactions on Graphics 35(6):1-12","DOI:10.1145/2980179.2980232"],"references":["306125446_Deep_Learning_for_Robust_Normal_Estimation_in_Unstructured_Point_Clouds","283746681_A_Robust_Scheme_for_Feature-Preserving_Mesh_Denoising","314394519_Learning_3D_mesh_segmentation_and_labeling","308823615_Cascaded_hand_pose_regression","308818330_Face_alignment_using_cascade_Gaussian_process_regression_trees","302925609_Mesh_denoising_via_L0_minimization","285671424_Joint_Cascade_Face_Detection_and_Alignment","285635273_KinectFusion_real-time_3D_reconstruction_and_interaction_using_a_moving_depth_camera","283889397_A_Machine_Learning_Approach_for_Filtering_Monte_Carlo_Noise","282940705_Guided_Mesh_Normal_Filtering"]}