{"id":"309962492_Investigating_the_effect_of_learning_styles_in_a_blended_e-learning_system_An_extension_of_the_technology_acceptance_model_TAM","abstract":"p>This study assesses learner perceptions of a blended e-learning system (BELS) and the feasibility of accommodating educational hypermedia systems (EHSs) according to learning styles using a modified version of the technology acceptance model (TAM). Recently, Moodle has been adopted by an Iraqi university alongside face-to-face (F2F) classrooms to provide flexible learning and improve understanding. Based on TAM, individual differences and perceptions were explored in relationships between learner satisfaction and technology adoption. The model was extended to include e-learning self-efficacy, perceived satisfaction, and learning styles. Although other variables can be integrated, the proposed framework is to investigate the effect of learning styles in predicting satisfaction and BELS acceptance. A total of 210 undergraduate students voluntarily took part in the research. Data was gathered using a survey instrument and the Index of Learning Styles (ILS) Questionnaire. Partial least squares structural equation modelling (PLS-SEM) technique was used to examine the path associated between dependent and independent constructs. Unlike prior TAM literature, this research highlights the integration of perceived satisfaction and technology acceptance in accordance with psychological traits and learner beliefs. Overall, the model achieved an acceptable fit and successfully integrated intention to use (ITU) and perceived satisfaction (PS). However, psychological differences did not indicate positive impacts on learner satisfaction and e-learning adoption. </p","authors":["Ahmed Al-Azawei","Patrick joseph Parslow","Karsten Lundqvist"],"meta":["November 2016Australasian Journal of Educational Technology 33(2)","DOI:10.14742/ajet.2741"],"references":["231820255_A_cross-cultural_view_of_leaning_styles","230532428_Cross-Cultural_Differences_in_Learning_Styles_of_Elementary-Age_Students_From_Four_Ethnic_Backgrounds"]}