{"id":"310049227_Distributed_resource_allocation_in_federated_clouds","abstract":"Cloud computing is an emerging technology which relies on virtualization techniques to achieve the elasticity of shared resources for providing on-demand services. When the service demand increases, more resources are required to satisfy the service demand. Single cloud generally cannot provide unlimited services with limited physical resources; therefore, the federation of multiple clouds may be one possible solution. In such environment, different cloud providers may own different pricing and resource allocating strategies. Thus, how to select the most appropriate provider to host applications becomes an important issue for clients. However, as the requests of accessing distributed resources increase, the occurrences of competing the same resource may also increase. In this study, a Distributed Resource Allocation (DRA) approach is proposed to solve resource competition in the federated cloud environment. Each job is supposed to consist of one or more tasks, and the communication behavior between tasks could be profiled. The proposed approach groups tasks according to communication behavior to minimize communication overhead, and tries to allocate grouped tasks to achieve equilibrium when resource competition occurs. Experimental results show that the cloud provider could obtain more profits by outsourcing resources in the federated cloud with enough resources.","authors":["Yi-Hsuan Lee","Kuo-Chan Huang","Meng-Ru Shieh","Kuan-Chou Lai"],"meta":["July 2017The Journal of Supercomputing 73(7)","DOI:10.1007/s11227-016-1918-1"],"references":["275653100_Latency_based_Dynamic_Grouping_aware_Cloud_Scheduling","303773022_A_dynamic_resource_allocation_and_task_scheduling_strategy_with_uncertain_task_runtime_on_IaaS_clouds","283334018_DCloud_Deadline-Aware_Resource_Allocation_for_Cloud_Computing_Jobs","282515396_Beyond_Dominant_Resource_Fairness","271964005_Taiwan_UniCloud_A_Cloud_Testbed_with_Collaborative_Cloud_Services","271589473_The_NIST_definition_of_cloud_computing","269303099_Elastic_Allocator_An_Adaptive_Task_Scheduler_for_Streaming_Query_in_the_Cloud","269298234_Distributed_Scheduling_Approach_Based_on_Game_Theory_in_the_Federated_Cloud","265555663_Topology-Aware_Partial_Virtual_Cluster_Mapping_Algorithm_on_Shared_Distributed_Infrastructures","263406726_Cost-Driven_Pricing_An_Innovative_Approach_for_Managing_Supply_Chain_Costs","262409267_Latency_Based_Dynamic_Grouping_Aware_Cloud_Scheduling","261390588_A_Game_Theory_of_Cloud_Service_Deployment","260584196_IaaS_Cloud_Architecture_From_Virtualized_Datacenters_to_Federated_Cloud_Infrastructures","260501900_Cloud_computing_The_new_normal","260304902_Does_Game_Theory_Work"]}