{"id":"310060019_Does_single_blind_peer_review_hinder_newcomers","abstract":"Several fields of research are characterized by the coexistence of two different peer review modes to select quality contributions for scientific venues, namely double blind (DBR) and single blind (SBR) peer review. In\nthe first, the identities of both authors and reviewers are not known to each other, whereas in the latter the authors’ identities are visible since the start of the review process. The need to adopt either one of these modes has been object of scholarly debate, which has mostly focused on issues of fairness. Past work reported that SBR is potentially associated with biases related to the gender, nationality, and language of the authors, as well as the prestige and type of their institutions. Nevertheless, evidence is lacking on whether revealing the identities of the authors favors reputed authors and hinder newcomers, a bias with potentially important consequences in terms of knowledge production. Accordingly, we investigate whether and to what extent SBR, compared to a DBR, relates to a higher ration of reputed scholars, at the expense of\nnewcomers. This relation is pivotal for science, as past research provided evidence that newcomers support renovation and advances in a research field by introducing new and heterodox ideas and approaches, whereas inbreeding have serious detrimental effects on innovation and creativity. Our study explores the mentioned issues in the field of computer science, by exploiting a database that encompasses 21,535 research papers authored by 47,201 individuals and published in 71 among the 80 most impactful computer science conferences in 2014 and 2015. We found evidence that—other characteristics of the conferences taken in consideration—SBR indeed relates to a lower ration of contributions from newcomers to the venue and particularly newcomers that are otherwise experienced of publishing in other computer science conferences, suggesting the possible existence of ingroup-outgroup behaviors that may harm knowledge advancement in the long run.","authors":["Marco Seeber","Alberto Bacchelli"],"meta":["March 2017Scientometrics 113(1)","DOI:10.1007/s11192-017-2264-7","Project: Openess of higher education and research systems and organizations"],"references":["315083977_Shaping_Written_Knowledge_The_Genre_and_Activity_of_the_Experimental_Article_in_Science","344045872_Guardians_of_Science_Fairness_and_Reliability_of_Peer_Review","315199950_Graduate_Education_in_the_United_States","304011287_Cultural_Diversity's_Impact_On_Interaction_Process_and_Performance_Comparing_Homogeneous_and_Diverse_Task_Groups","303264228_Core_discussion_networks_of_Americans","303138138_Organizational_learning","301851624_The_effects_of_double-blind_versus_single-blind_reviewing_Experimental_evidence_from_the_American_Economic_Review","296614847_Impact_of_double_blind_reviewing_on_SIGMOD_publication_A_more_detail_analysis","294087239_Is_Three_Better_than_One_Simulating_the_Effect_of_Reviewer_Selection_and_Behavior_on_the_Quality_and_Efficiency_of_Peer_Review","292685859_The_Gatekeepers_of_Science_Some_Factors_Affecting_the_Selection_of_Articles_for_Scientific_Journals"]}