{"id":"310036014_Confidence_Analysis_for_Nuclear_Arms_Control_SMT_Abstractions_of_Bayesian_Belief_Networks","abstract":"How to reduce, in principle, arms in a verifiable manner that is trusted by two or more parties is a hard but important problem. Nations and organisations that wish to engage in such arms control verification activities need to be able to design procedures and control mechanisms that capture their trust assumptions and let them compute pertinent degrees of belief. Crucially, they also will need methods for reliably assessing their confidence in such computed degrees of belief in situations with little or no contextual data. We model an arms control verification scenario with what we call constrained Bayesian Belief Networks (cBBN). A cBBN represents a set of Bayesian Belief Networks by symbolically expressing uncertainty about probabilities and scenario-specific constraints that are not represented by a BBN. We show that this abstraction of BBNs can mitigate well against the lack of prior data. Specifically, we describe how cBBNs have faithful representations within a Satisfiability Modulo Theory (SMT) solver, and that these representations open up new ways of automatically assessing the confidence that we may have in the degrees of belief represented by cBBNs. Furthermore, we show how to perform symbolic sensitivity analyses of cBBNs, and how to compute global optima of under-specified probabilities of particular interest to decision making. SMT solving also enables us to assess the relative confidence we have in two cBBNs of the same scenario, where these models may share some information but express some aspects of the scenario at different levels of abstraction.","authors":["Paul Beaumont","Neil Evans","Michael Huth","Tom Plant"],"meta":["January 2016","DOI:10.1007/978-3-319-24174-6_27","Conference: ESORICS 2015At: ViennaVolume: Volume 9326 of the book series Lecture Notes in Computer Science (LNCS)"],"references":["266659142_Abstract_interpretation_past_present_and_future","262243502_A_robust_approach_to_addressing_human_adversaries_in_security_games","258222788_Robust_Optimization","229157543_Sensitivity_Analysis_in_Bayesian_Networks_From_Single_to_MultipleParameters","225142568_Z3_an_efficient_SMT_solver","224040040_Delta-Complete_Decision_Procedures_for_Satisfiability_over_the_Reals","221404943_When_do_Numbers_Really_Matter","221352826_Sensitivity_Analysis_of_Bayesian_Networks_Used_in_Forensic_Investigations","221234915_Fast_LCF-Style_Proof_Reconstruction_for_Z3","313073813_Local_Computations_with_Probabilities_on_Graphical_Structures_and_Their_Application_to_Expert_Systems","301991235_nZ_-_An_Optimizing_SMT_Solver","286436682_PEALT_An_Automated_Reasoning_Tool_for_Numerical_Aggregation_of_Trust_Evidence","265372150_Credal_networks","263139500_Risk_assessment_and_decision_analysis_with_Bayesian_networks","236944356_Risk_Assessment_and_Decision_Analysis_With_Bayesian_Networks","230596020_Local_Computations_With_Probabilities_on_Graphical_Structures_and_Their_Application_to_Expert_Systems","222400764_A_new_robust_optimization_approach_for_scheduling_under_uncertainty_I_Bounded_uncertainty","221471891_The_SMT-LIB_Initiative_and_the_Rise_of_SMT","221403040_CVC3","221135953_Evidence_and_Scenario_Sensitivities_in_Naive_Bayesian_Classifiers"]}