{"id":"310051144_A_comparison_of_US-based_and_Iraqi_English_research_article_abstracts_using_corpora","abstract":"This paper explores the linguistic characteristics of English research article (RA) abstracts published in the United States (U.S.) and those published in Iraq, written by Iraqi authors. Because of their brevity, well-established purpose, and explicit format requirements, RA abstracts are ideal for genre-based studies (Hyland, 2004; Swales & Feak, 2009a) and cross-linguistic analyses. Eight parallel sub-corpora were used in this study, comprised of RA abstracts in four disciplines (Agriculture, Nursing, Engineering, and Languages) from the U.S. and Iraq. Overall, the texts collected in the eight corpora were written during the period from 1995 to 2016 across a wide-range of publications and research approaches. This study follows Biber's (1988, 1995) multi-dimensional analytical (MDA) approach in comparing and contrasting these U.S.-based and Iraqi RA abstracts. Specifically, extracted dimensions of academic writing from Hardy and Römer's (2013) MDA of NS and NNS upper-level academic written texts from the Michigan Corpus of Upper-Level Student Papers (MICUSP) are utilized as primary points of comparison. Results suggest similarities and interesting differences in how U.S.-based and Iraqi writers structure their abstracts, specifically in (1) how information is packaged and shared, (2) the expression of procedural discourse in abstract writing, and (3) how directness and argumentation are articulated by writers.","authors":["Eric Friginal","Sabah Sleibi Mustafa"],"meta":["January 2017Journal of English for Academic Purposes 25:45-57","DOI:10.1016/j.jeap.2016.11.004"],"references":["310054907_Cultural_traces_on_the_rhetorical_organization_of_research_article_abstracts","288090336_Different_worlds_different_audiences_A_contrastive_analysis_of_research_article_abstracts","274178880_Douglas_Biber_UNIVERSITY_LANGUAGE_A_CORPUS-BASED_STUDY_OF_SPOKEN_AND_WRITTEN_REGISTERS","333378498_Thematic_progression_in_professional_and_popular_medical_texts","300464876_Different_worlds_different_audiences","300454378_Rhetorical_influences","290990778_Author_identity_in_economics_and_linguistics_abstracts","286784441_Register_Variation_A_Corpus_Approach","274100462_Sociolinguistics_Stability_and_consolidation","273927936_On_Abstract_Writing"]}