{"id":"310233743_Manifold_learning_and_maximum_likelihood_estimation_for_hyperbolic_network_embedding","abstract":"The Popularity-Similarity (PS) model sustains that clustering and hierarchy, properties common to most networks representing complex systems, are the result of an optimisation process in which nodes seek to form ties, not only with the most connected (popular) system components, but also with those that are similar to them. This model has a geometric interpretation in hyperbolic space, where distances between nodes abstract popularity-similarity trade-offs and the formation of scale-free and strongly clustered networks can be accurately described.\nCurrent methods for mapping networks to hyperbolic space are based on maximum likelihood estimations or manifold learning. The former approach is very accurate but slow; the latter improves efficiency at the cost of accuracy. Here, we analyse the strengths and limitations of both strategies and assess the advantages of combining them to efficiently embed big networks, allowing for their examination from a geometric perspective. Our evaluations in artificial and real networks support the idea that hyperbolic distance constraints play a significant role in the formation of edges between nodes. This means that challenging problems in network science, like link prediction or community detection, could be more easily addressed under this geometric framework.\n\nElectronic supplementary material\nThe online version of this article (doi:10.1007/s41109-016-0013-0) contains supplementary material, which is available to authorized users.","authors":["Gregorio Alanis-Lobato","Pablo Mier","Miguel Andrade"],"meta":["November 2016Applied Network Science 1(1)","DOI:10.1007/s41109-016-0013-0"],"references":["309564070_HIPPIE_v20_Enhancing_meaningfulness_and_reliability_of_protein-protein_interaction_networks","305624423_Efficient_embedding_of_complex_networks_to_hyperbolic_space_via_their_Laplacian","277334215_Generalized_Communities_in_Networks","272521234_Network_Geometry_Inference_using_Common_Neighbors","312129770_Distance_Distribution_between_Complex_Network_Nodes_in_Hyperbolic_Space","292673385_FastaHerder2_Four_Ways_to_Research_Protein_Function_and_Evolution_with_Clustering_and_Clustered_Databases","285599593_A_Global_Geometric_Framework_for_Nonlinear_Dimensionality_Reduction","283617653_Emergence_of_Scaling_in_Random_Networks","283617410_Emergence_of_Scaling_in_Random_Networks","257217049_Complex_Networks_on_Hyperbolic_Surfaces"]}