{"id":"310439009_Algunos_apuntes_sobre_la_digitalizacion_y_la_reconstruccion_virtual_del_Castro_de_San_Chuis_Allande_Asturias_Espana","abstract":"p>With the firm conviction that current archaeology needs to use all the tools that computer science provides, we have developed a project for digitising and structuring all the information gathered from the different excavation campaigns carried out in San Chuis hillfort (Allande, Asturias, Spain). In order to do it, we have developed the Spatial Data Infrastructure (SDI) of the hillfort, in order to proceed subsequently to its virtualization. To implement the SDI, we have reinstated the archaeological record in its original coordinates based on the information that we had. This restitution has allowed us to perform the spatial analysis of the elements of the record, to elaborate different plans of its distribution, not only campaigns but also types, and perform at the same time, a study of the densities. Likewise, we have developed a general database of the hillfort, in which, aside of including the detailed table of the elements of the record and their coordinates, also contains the descriptive table of the stratigraphic units (SU) and the descriptive table of the wall stratigraphic units (WSU). Finally, we have built an extensive planimetry and a web page in order to spread the information. With regard to the hillfort virtualization, we have developed two consistent models with two historical stages: the Iron Age and the Roman occupation. We have used Blender for its development.</p","authors":["Juana Molina Salido","Jesús F. Jordá Pardo"],"meta":["November 2016Virtual Archaeology Review 7(15):98","DOI:10.4995/var.2016.5866","Project: Del registro arqueológico a la reconstrucción virtual. Análisis urbanístico y microespacial de un poblado fortificado de la Edad del Hierro (castro de San Chuis, Allande, Asturias)"],"references":["323144695_El_castro_de_San_Chuis_Allande_Asturias_Espana_Ensayo_metodologico_para_la_integracion_y_digitalizacion_de_la_informacion_procedente_de_antiguas_excavaciones_arqueologicas","312341450_Discovering_San_Chuis_Hillfort_Northern_Spain_archaeometry_craft_technologies_and_social_interpretation","291271094_Anastilosis_Virtual_con_Blender_Las_Termas_del_Yacimiento_Villa_Romana_De_L'Albir_L'Alfas_Del_Pi_Alicante","275714671_Integracion_de_SIG_con_visualizacion_3D_interactiva_para_la_gestion_y_seguimiento_de_excavaciones_arqueologicas","236852992_Sistema_de_Informacion_para_Patrimonio_Historico","39566667_Patrimonio_Arqueologico_e_Infraestructucturas_de_Datos_Espaciales_la_IDE_de_Casa_Montero"]}