{"id":"310459636_Contributory_Role_of_Sex_Differences_in_the_Variations_of_Gustatory_Function","abstract":"Remarkable variability between males and females occurs for an array of taste-guided behaviors in both rodents and humans. Sex differences have been noted for taste preference, detection thresholds, and reactivity to taste stimuli. Manipulating sex hormones during early postnatal development or altering the amount of circulating estrogen in adulthood can dramatically alter the pattern of these behaviors. Receptors for sex hormones appear to be prominent in several nuclei associated with central gustatory pathways, indicating that steroid hormones may modulate central taste processing. Electro-physiological recordings from the rat brainstem suggest that taste-elicited activity to sweet stimuli is organized by hormones during early development, and activity during bitter stimulation is altered by circulating ovarian hormones. Sex differences in gustatory function appear to emerge at the level of the taste bud. Among ovariecto-mized rats, estradiol treatment decreases activity in the chorda tympani nerve during NaCl stimulation. Although there is no evidence that chorda tympani responses to NaCl differ between intact male and female rats, glosso-pharyngeal nerve responses are lower in intact females for both NaCl and sodium acetate. Responses in the glossopharyngeal nerve to citric acid stimulation are also higher in female rats relative to males. These findings suggest that, in addition to differential central modulation of taste input based on sex, taste information from the periphery varies between males and females. Although the extent of sex differences in taste processing and the underlying causal mechanisms require further clarification , it is clear that studying one sex alone provides an incomplete picture of gustatory function. V C 2016 Wiley Periodicals, Inc.","authors":["Louis J Martin","Suzanne I Sollars"],"meta":["January 2017Journal of Neuroscience Research 95(1-2):594-603","DOI:10.1002/jnr.23819"],"references":["327797779_Taste_reactivity_responses_in_rats_Influence_of_sex_and_the_estrous_cycle","321785693_17b-Estradiol_Acutely_Potentiates_Glutamatergic_Synaptic_Transmission_in_the_Hippocampus_through_Distinct_Mechanisms_in_Males_and_Females","304430521_Plasma_estrone_estradiol_estriol_progesterone_and_17-hydroxyprogesterone_in_human_pregnancy","299399215_Inflammatory_stimuli_acutely_modulate_peripheral_taste_function","296690468_17_-Estradiol_Acutely_Potentiates_Glutamatergic_Synaptic_Transmission_in_the_Hippocampus_through_Distinct_Mechanisms_in_Males_and_Females","296556872_Distribution_and_characterization_of_functional_amiloride-sensitive_sodium_channels_in_rat_tongue","292241645_Hormonal_control_of_calcium_ingestion_The_effects_of_neonatal_manipulations_of_the_gonadal_steroids_both_during_and_after_critical_stages_in_development_on_the_calcium_ingestion_of_male_and_female_rat","289122861_The_ingestion_of_calcium_in_female_and_male_rats","286360685_Gustatory_Pathways_in_Fish_and_Mammals","285594901_Individual_Differences_Among_Children_in_Sucrose_Detection_Thresholds_Relationship_With_Age_Gender_and_Bitter_Taste_Genotype"]}