{"id":"310462145_Quantum_walks_The_first_detected_passage_time_problem","abstract":"Even after decades of research the problem of first passage time statistics for quantum dynamics remains a challenging topic of fundamental and practical importance. Using a projective measurement approach, with a sampling time $\\tau$, we obtain the statistics of first detection events for quantum dynamics on a lattice, with the detector located at the origin. A quantum renewal equation for a first detection wave function, in terms of which the first detection probability can be calculated, is derived. This formula gives the relation between first detection statistics and the solution of the corresponding Schr\\\"odinger equation in the absence of measurement. We demonstrate our results with tight binding quantum walk models. We examine a closed system, i.e. a ring, and reveal the intricate influence of the sampling time $\\tau$ on the statistics of detection, discussing the quantum Zeno effect, half dark states, revivals and optimal detection. The initial condition modifies the statistics of a quantum walk on a finite ring in surprising ways. In some cases the average detection time is independent of the sampling time while in others the average exhibits multiple divergences as the sampling time is modified. For an unbounded one dimensional quantum walk the probability of first detection decays like $(\\mbox{time})^{(-3)}$ with superimposed oscillations, with exceptional behavior when the sampling period $\\tau$ times the tunnelling rate $\\gamma$ is a multiple of $\\pi/2$. The amplitude of the power law decay is suppressed as $\\tau\\to 0$ due to the Zeno effect. Our work presented here, is an extended version of Friedman et al. arXiv:1603.02046 [cond-mat.stat-mech], and it predicts rich physical behaviors compared with classical Brownian motion, for which the first passage probability density decays monotonically like $(\\mbox{time})^{-3/2}$, as elucidated by Schr\\\"odinger in $1915$.","authors":["Harel Friedman","David Kessler","Eli Barkai"],"meta":["November 2016PHYSICAL REVIEW E 95(3)","DOI:10.1103/PhysRevE.95.032141"],"references":["324383087_Aspects_and_Applications_of_the_Random_Walk","321419180_First-passage_phenomena_and_their_applications","316806810_The_Fundamental_Theorem_of_Algebra","306204723_The_Zeno's_paradox_in_quantum_theory","286817910_IA_Stegun_in_Handbook_of_Mathematical_Functions_Dover","285441778_The_Feynman_Lectures_on_Physics","284686479_Zur_Theorie_der_Fall-_und_Steigversuche_an_Teilchen_mit_Brownscher_Bewegung","268989549_1D_Tight-Binding_Models_Render_Quantum_First_Passage_Time_Speakable","265976310_Random_Walks_and_Random_Environments","260963225_Time_of_arrival_in_quantum_mechanics","258849401_Survival_of_Classical_and_Quantum_Particles_in_the_Presence_of_Traps","253617474_Tunneling_times_A_critical_review","237005395_A_Guide_to_First-Passage_Processes","235410329_Fundamental_of_Statistical_and_Thermal_Physics","223087825_Arrival_time_in_quantum_mechanics"]}