{"id":"310489012_Retrieval_of_Remote_Sensing_Images_with_Pattern_Spectra_Descriptors","abstract":"The rapidly increasing volume of visual Earth Observation data calls for effective content based image retrieval solutions, specifically tailored for their high spatial resolution and heterogeneous content. In this paper, we address this issue with a novel local implementation of the well-known morphological descriptors called pattern spectra. They are computationally efficient histogram-like structures describing the global distribution of arbitrarily defined attributes of connected image components. Besides employing pattern spectra for the first time in this context, our main contribution lies in their dense calculation, at a local scale, thus enabling their combination with sophisticated visual vocabulary strategies. The Merced Landuse/Landcover dataset has been used for comparing the proposed strategy against alternative global and local content description methods, where the introduced approach is shown to yield promising performances.","authors":["Petra Bosilj","Erchan Aptoula","Sébastien Lefèvre","Ewa Kijak"],"meta":["December 2016International Journal of Geo-Information 5(12)","DOI:10.3390/ijgi5120228","Projects: Morphological tools for image and region description - classification and retrievalImage indexing and retrieval with component trees"],"references":["308840572_Short_Local_Descriptors_from_2D_Connected_Pattern_Spectra","303239551_Local_2D_Pattern_Spectra_as_Connected_Region_Descriptors","301228368_Visual_descriptors_for_content-based_retrieval_of_remote_sensing_images","308161218_Introduction_to_information_retrieval_chapt","304531011_A_Three-Layered_Graph-Based_Learning_Approach_for_Remote_Sensing_Image_Retrieval","304288053_Remote_Sensing_Image_Retrieval_Based_on_Attribute_Profiles","300335529_Multipath_sparse_coding_for_scene_classification_in_very_high_resolution_satellite_imagery","290458532_Vector_Attribute_Profiles_for_Hyperspectral_Image_Classification","283921280_Visual_Pattern_Recognition_by_Moment_Invariants","282960167_High-resolution_remote-sensing_imagery_retrieval_using_sparse_features_by_auto-encoder"]}