{"id":"310479519_Gender_social_salience_and_social_performance_how_women_pursue_and_perform_in_social_ventures","abstract":"We investigate how women that start organizations contribute to the creation of social value in communities and society. We draw on theory from gender self-schemas and social identity theory to explain how women with a female gender-self schema have a natural inclination to create organizations with social goals and intentions in mind. We label these social goals and intentions as social salience and draw on goal theory and existing understandings on intentions to explain how the presence of a social salience in an organization is related to the social performance of their organization. Utilizing structural equation modeling, we show that gender positively influences social salience that subsequently has a positive relationship with the social performance of the organization. We also show that social salience fully mediates the relationship between gender and social performance implying that gender alone is not enough to explain the social performance of an organization. We conclude by highlighting the implications, contributions, and future research that result from our findings.","authors":["Jason Lortie","Gary J. Castrogiovanni","Kevin C Cox"],"meta":["January 2017Entrepreneurship and Regional Development 29(1-2):155-173","DOI:10.1080/08985626.2016.1255433","Project: Measuring Social Entrepreneurship"],"references":["338951564_The_Role_of_Personal_Values_in_Corporate_Social_Entrepreneurship","314568759_VENTURING_FOR_OTHERS_WITH_HEART_AND_HEAD_HOW_COMPASSION_ENCOURAGES_SOCIAL_ENTREPRENEURSHIP","313101101_The_role_of_social_and_human_capital_among_nascent_entrepreneurs","303609801_Social_Identity_Theory_and_the_Organization","330436273_The_Social_Identity_Theory_of_Intergroup_Behavior_Key_Readings","317953663_Self-Efficacy_Toward_a_Unifying_Theory_of_Behavioral_Change","313082521_Self-schemata_and_processing_information_about_the_self","312894519_The_dynamic_self-concept_A_social_psychological_perspective","312324063_Social_Entrepreneurship","303919046_Principles_and_Practice_of_Structural_Equation_Modeling"]}