{"id":"310460443_HTN_Planning_Approach_Using_Fully_Instantiated_Problems","abstract":"Many planning techniques have been developed to allow autonomous systems to act and make decisions based on their perceptions of the environment. Among these techniques, HTN (Hierarchical Task Network) planning is one of the most used in practice. Unlike classical approaches of planning. HTN operates by decomposing task into sub-tasks until each of these sub-tasks can be achieved an action. This hierarchical representation provide a richer representation of planning problems and allows to better guide the plan search and provides more knowledge to the underlying algorithms. In this paper, we propose a new approach of HTN planning in which, as in conventional planning, we instantiate all planning operators before starting the search process. This approach has proven its effectiveness in classical planning and is necessary for the development of effective heuristics and encoding planning problems in other formalism such as CSP or SAT. The instantiation is actually used by most modern planners but has never been applied in an HTN based planning framework. We present in this article a generic instantiation algorithm which implements many simplification techniques to reduce the process complexity inspired from those used in classical planning. Finally we present some results obtained from an experimentation on a range of problems used in the international planning competitions with a modified version of SHOP planner using fully instantiated problems.","authors":["Abdeldjalil Ramoul","Damien Pellier","Humbert Fiorino","Sylvie Pesty"],"meta":["November 2016","DOI:10.1109/ICTAI.2016.0027","Conference: International Conference on Tools in Artificial Intelligence","Project: HTN Planning"],"references":["282439405_Mixed-Initiative_Planning_and_Execution_for_Multiple_Drones_in_Search_and_Rescue_Missions","267079760_Merge-and-Shrink_Abstraction_A_Method_for_Generating_Lower_Bounds_in_Factored_State_Spaces","228936014_The_MMP_A_Mixed-Initiative_Mission_Planning_System_for_the_Multi-Aircraft_Domain","226427912_Constraint_satisfaction_techniques_in_planning_and_scheduling","338681718_Fast_Downward_Cedalion","272360451_HTN_planning_Overview_comparison_and_beyond","256660334_Planning_as_satisfiability_Heuristics","238756296_Project_Planning_Using_a_Hierarchic_Non-Linear_Planner","222488186_O-Plan_The_open_planning_architecture","222445519_Domain-independent_planning_Representation_and_plan_generation"]}