{"id":"310436603_Cell_signaling_as_a_probabilistic_computer","abstract":"Living organisms survive and multiply even though they have uncertain and incomplete information about their environment and imperfect models to predict the consequences of their actions. Bayesian models have been proposed to face this challenge. Indeed, Bayesian inference is a way to do optimal reasoning when only uncertain and incomplete information is available. Various perceptive, sensory-motor, and cognitive functions have been successfully modeled this way. However, the biological mechanisms allowing animals and humans to represent and to compute probability distributions are not known. It has been proposed that neurons and assemblies of neurons could be the appropriate scale to search for clues to probabilistic reasoning. In contrast, in this paper, we propose that interacting populations of macromolecules and diffusible messengers can perform probabilistic computation. This suggests that probabilistic reasoning, based on cellular signaling pathways, is a fundamental skill of living organisms available to the simplest unicellular organisms as well as the most complex brains.","authors":["David Colliaux","Pierre Bessiere","Jacques Droulez"],"meta":["November 2016International Journal of Approximate Reasoning 83(5727)","DOI:10.1016/j.ijar.2016.10.012"],"references":["275279965_Network_Plasticity_as_Bayesian_Inference","258639162_Stochastic_Computations_in_Cortical_Microcircuit_Models","256481602_Decisions_on_the_fly_in_cellular_sensory_systems","247257760_Probabilistic_Models_of_the_Brain_Perception_and_Neural_Function","331706714_A_blue-light-activated_adenylyl_cyclase_mediates_photoavoidance_in_Euglena_gracilis","325698205_Motion_illusions_as_optimal_percepts","321610723_Single-Channel_Recording","289429360_Message_passing_inference_with_chemical_reaction_networks","288255670_The_voltage_sensor_in_voltage-dependent_ion_channels","286115063_A_Control_Theoretic_Framework_for_the_Analysis_and_Design_of_Biological_Networks"]}