{"id":"310438218_Introducing_a_Clustering_Step_in_a_Consensus_Approach_for_the_Scoring_of_Protein-Protein_Docking_Models","abstract":"Correctly scoring protein-protein docking models to single out native-like ones is an open challenge. It is also an object of assessment in CAPRI (Critical Assessment of PRedicted Interactions), the community-wide blind docking experiment. We introduced in the field the first pure consensus method, CONSRANK, which ranks models based on their ability to match the most conserved contacts in the ensemble they belong to. In CAPRI, scorers are asked to evaluate a set of available models and select the top ten ones, based on their own scoring approach. Scorers’ performance is ranked based on the number of targets/interfaces for which they could provide at least one correct solution. In such terms, blind testing in CAPRI Round 30 (a joint prediction round with CASP11) has shown that critical cases for CONSRANK are represented by targets showing multiple interfaces or for which only a very small number of correct solutions are available. To address these challenging cases, CONSRANK has now been modified to include a contact-based clustering of the models as a preliminary step of the scoring process. We used an agglomerative hierarchical clustering based on the number of common inter-residue contacts within the models. Two criteria, with different thresholds, were explored in the cluster generation, setting either the number of common contacts or of total clusters. For each clustering approach, after selecting the top (most populated) ten clusters, CONSRANK was run on these clusters and the top-ranked model for each cluster was selected, in the limit of 10 models per target. We have applied our modified scoring approach, Clust-CONSRANK, to SCORE_SET, a set of CAPRI scoring models made recently available by CAPRI assessors, and to the subset of homodimeric targets in CAPRI Round 30 for which CONSRANK failed to include a correct solution within the ten selected models. Results show that, for the challenging cases, the clustering step typically enriches the ten top ranked models in native-like solutions. The best performing clustering approaches we tested indeed lead to more than double the number of cases for which at least one correct solution can be included within the top ten ranked models.","authors":["Edrisse Chermak","Renato De Donato","Marc Ferdinand Lensink","Andrea Petta"],"meta":["November 2016PLoS ONE 11(11)","DOI:10.1371/journal.pone.0166460"],"references":["301697674_Prediction_of_homo-_and_hetero-protein_complexes_by_protein_docking_and_template-based_modeling_a_CASP-CAPRI_experiment","281056634_The_D173G_mutation_in_ADAMTS-13_causes_a_severe_form_of_congenital_thrombotic_thrombocytopenic_purpura","280030137_Analysis_and_Ranking_of_Protein-Protein_Docking_Models_Using_Inter-Residue_Contacts_and_Inter-Molecular_Contact_Maps","269999117_CONSRANK_A_server_for_the_analysis_comparison_and_ranking_of_docking_models_based_on_inter-residue_contacts","297672764_Analysis_of_the_interface_variability_in_NMR_structure_ensembles_of_protein-protein_complexes","287624410_Fastcluster_Fast_Hierarchical_Agglomerative_Clustering_Routines_for_R_and_Python","285762546_The_PyMol_Molecular_Graphics_System","281138039_High-resolution_protein-protein_docking_by_global_optimization_Recent_advances_and_future_challenges","273889901_Exploring_the_potential_of_global_protein-protein_docking_An_overview_and_critical_assessment_of_current_programs_for_automatic_ab_initio_docking","268788863_Protein-Protein_Docking_From_Interaction_to_Interactome","264391970_Structural_Basis_for_the_Recognition_in_an_Idiotype-Anti-Idiotype_Antibody_Complex_Related_to_Celiac_Disease","263084857_MDcons_Intermolecular_contact_maps_as_a_tool_to_analyze_the_interface_of_protein_complexes_from_molecular_dynamics_trajectories","266948606_Molecular_Dynamics_Characterization_of_Five_Pathogenic_Factor_X_Mutants_Associated_to_Decreased_Catalytic_Activity","265211201_Score_set_A_CAPRI_benchmark_for_scoring_protein_complexes","260481833_Search_strategies_and_evaluation_in_protein-protein_docking_Principles_advances_and_challenges"]}