{"id":"310451800_E-eco_Performance-Aware_Energy-Efficient_Cloud_Data_Center_Orchestration","abstract":"The high energy consumption of data centers has been a recurring issue in recent research. In cloud environments, several techniques are being used that aim for energy efficiency, ranging from scaling the processors frequency, to the use of sleep states during idle periods and the consolidation of virtual machines. Although these techniques enable a reduction in power consumption, they usually impact application performance. In this paper, we present an orchestration of different energy-savings techniques in order to improve the trade-off between energy consumption and application performance. To this end, we implemented the Energy-Efficient Cloud Orchestrator - e-eco - a management system that acts along with the cloud load balancer deciding which technique to apply during execution. To evaluate e-eco, tests were carried out in a real environment using scale-out applications on a dynamic cloud infrastructure, taking into account transactions per second as a performance metric. In addition to the empirical experiments, we also analyzed the scalability of our approach with an enhanced version of the CloudSim simulator. Results of our evaluations demonstrated that e-eco is able to reduce energy consumption up to 25% compared to power-agnostic approaches at a cost of only 6% of extra SLA violations. When compared to existing power-aware approaches, e-eco achieved the best trade-off between performance and energy-savings. These results showed that our orchestration approach showed a better balance in regard to a more energy-efficient data center with smaller impact on application performance when compared with other works presented in the literature.","authors":["Fábio Diniz Rossi","Miguel Gomes Xavier","César A. F. De Rose","Rodrigo Neves Calheiros"],"meta":["November 2016Journal of Network and Computer Applications 78","DOI:10.1016/j.jnca.2016.10.024"],"references":["303045596_Modeling_and_simulation_of_global_and_sleep_states_in_ACPI-compliant_energy-efficient_cloud_environments","275833678_Non-Invasive_Estimation_of_Cloud_Applications_Performance_via_Hypervisor's_Operating_Systems_Counters","275833498_Evaluating_the_Trade-off_Between_DVFS_Energy-savings_and_Virtual_Networks_Performance","313004587_Optimal_online_deterministic_algorithms_and_adaptive_heuristics_for_energy_and_performance_efficient_dynamic_consolidation_of_virtual_machines_in_cloud_data_centers","311475119_Agile_efficient_virtualization_power_management_with_low-latency_server_power_states","283558601_Using_Trustworthy_Simulation_to_Engineer_Cloud_Schedulers","276505770_On_optimal_policies_for_energy-aware_servers","276263343_SuperCloud","276142242_Improving_Energy_Efficiency_for_Mobile_Media_Cloud_via_Virtual_Machine_Consolidation","274097270_Stochastic_modeling_of_dynamic_right-sizing_for_energy-efficiency_in_cloud_data_centers"]}