{"id":"310573403_Discriminative_Ocular_Artifact_Correction_for_Feature_Learning_in_EEG_Analysis","abstract":"Electrooculogram (EOG) artifact contamination is a common critical issue in general electroencephalogram (EEG) studies as well as in brain computer interface (BCI) research. It is especially challenging when dedicated EOG channels are unavailable or when there are very few EEG channels available for ICA-based ocular artifact removal. It is even more challenging to avoid loss of the signal of interest during the artifact correction process, where the signal of interest can be multiple magnitudes weaker than the artifact. To address these issues, we propose a novel discriminative ocular artifact correction approach for feature learning in EEG analysis.Without extra ocular movement measurements, the artifact is extracted from raw EEG data, which is totally automatic and requires no visual inspection of artifacts. Then, artifact correction is optimized jointly with feature extraction by maximizing oscillatory correlations between trials from the same class and minimizing them between trials from different classes. We evaluate this approach on a real world EEG data set comprising 68 subjects performing cognitive tasks. The results showed that the approach is capable of not only suppressing the artifact components but also improving the discriminative power of a classifier with statistical significance. We also demonstrate that the proposed method addresses the confounding issues induced by ocular movements in cognitive EEG study.","authors":["Xinyang Li","Cuntai Guan","Haihong Zhang","Kai Keng Ang"],"meta":["August 2017IEEE transactions on bio-medical engineering 64(8):1906-1913","DOI:10.1109/TBME.2016.2628958","Project: Brain-Computer Interface and Cognition"],"references":["282764479_Separable_Common_Spatio-Spectral_Patterns_for_Motor_Imagery_BCI_Systems","276535604_Brain-Computer_Interface_for_Neurorehabilitation_of_Upper_Limb_After_Stroke","271518652_Transient-Artifact_Reduction_Algorithm_TARA_Based_on_Sparse_Optimization","265968043_Adaptation_of_motor_imagery_EEG_classification_model_based_on_tensor_decomposition","264795287_Simultaneously_Optimizing_Spatial_Spectral_Features_Based_on_Mutual_Information_for_EEG_Classification","313737772_ADJUST_an_automatic_EEG_artifact_detector_based_on_the_joint_use_of_spatial_and_temporal_features","281174521_EEG_Source_Imaging_Enhances_the_Decoding_of_Complex_Right_Hand_Motor_Imagery_Tasks","272520794_Independent_Vector_Analysis_for_Gradient_Artifact_Removal_in_Concurrent_EEG-fMRI_Data","269295329_Subspace_denoising_of_EEG_artefacts_via_multivariate_EMD","262772023_Automatic_Identification_and_Removal_of_Ocular_Artifacts_in_EEG-Improved_Adaptive_Predictor_Filtering_for_Portable_Applications"]}