{"id":"310505690_RFID_Technologies_for_Internet_of_Things","abstract":"This book introduces applications of RFID on the Internet of things, under the emerging technologies for tag search, anonymous RFID authentication, and identification of networked tags. A new technique called filtering vector (a compact data structure that encodes tag IDs) is proposed to enable tag filtration, meeting the stringent delay requirements for real-world applications. Based on filtering vectors, a novel iterative tag search protocol is designed, which progressively improves the accuracy of search result and reduces the time of each iteration by using the information learned from the previous iterations. Moreover, the protocol is extended to work under noisy channel.\n\nThe authors also make a fundamental shift from the traditional design paradigm for anonymous RFID authentication by following an asymmetry design principle that pushes most complexity to the readers while leaving the tags as simple as possible. A novel technique is developed to dynamically generate random tokens on demand for authentication. The token-based authentication protocol only requires O(1) communication overhead and online computation overhead per authentication for both readers and tags.\n\nFinally, the authors investigate the problem of networked-tag identification. The traditional contention-based protocol design will incur too much energy overhead in multihop tag systems, and a reader-coordinated design that significantly serializes tag transmissions performs much better. In addition, a solution based on serial numbers is proposed to achieve load balancing, thereby reducing the worst-case energy cost among the tags.\n\nDesigned for researchers and professionals, this SpringerBrief will interest individuals who work in efficiency, security, and privacy. Advanced-level students focused on network design will also benefit from the content.","authors":["Min Chen","Shigang Chen"],"meta":["January 2016","DOI:10.1007/978-3-319-47355-0","ISBN: 978-3-319-47354-3"],"references":[]}