{"id":"310593347_Potential_of_combining_morphometry_and_ancient_DNA_information_to_investigate_grapevine_domestication","abstract":"The goal of this work was to explore the possibility (1) of carrying out both morphogeometric and archaeological DNA analyses on the same grape pips and (2) of comparing different molecular markers to reveal DNA variation, namely Simple Sequence Repeats (SSRs) and Single Nucleotide Polymorphisms (SNPs). We focused on waterlogged seeds originating from three Roman and one medieval archaeological sites in France. Our first results indicate that taking photographs of pips is not detrimental to the preservation of DNA, provided a specific protocol is respected. Regarding the genetic markers, obtaining reliable information in sufficient quantity proved very difficult using SSRs. SNPs have a much more interesting potential, providing greater success rates and reliability. Here in four archaeological pips we studied 842 SNPs, derived from known polymorphisms in several genes, including one gene related to sex. Phylogenies built using these genetic markers indicate that three pips from the Roman site of Gasquinoy are close to modern wild grapevines and/or the female group, while the only medieval pip from Colletière is hermaphrodite and close to the modern cultivated group. Morphogeometrical results are in agreement with these findings. We conclude that the combined use of SNP markers and morphogeometry is promising for deciphering the intricate history of grapevine domestication.","authors":["Roberto Bacilieri","Laurent Bouby","Isabel Figueiral","Caroline Schaal"],"meta":["May 2017Vegetation History and Archaeobotany 26(3):1-12","DOI:10.1007/s00334-016-0597-4"],"references":["328955232_Momocs_Outline_Analysis_Using_R","283202947_Genome_sequencing_of_the_extinct_Eurasian_wild_aurochs_Bos_primigenius_illuminates_the_phylogeography_and_evolution_of_cattle","272332405_Vers_une_approche_bio-archeologique_de_l'histoire_de_la_vigne_cultivee_et_de_la_viticulture_problematique_choix_methodologiques_et_premiers_resultats","271645564_The_origin_and_evolution_of_maize_in_the_Southwestern_United_States","311733074_Recent_advances_in_ancient_DNA_research_and_their_implications_for_archaeobotany","292328792_Identification_of_microsatellite_sequences_in_Vitis_riparia_and_their_applicability_for_genotyping_of_different_Vitis_species","287239757_Ancient_wine_The_search_for_the_origins_of_viniculture","275800129_Le_vin_de_l'Italie_romaine","273293103_Grape-pressings_from_northern_Greece_The_earliest_wine_in_the_Aegean","270292904_Recent_advances_in_ancient_DNA_research_and_their_implications_for_archaeobotany"]}