{"id":"310587799_A_statistical_framework_for_neuroimaging_data_analysis_based_on_mutual_information_estimated_via_a_Gaussian_copula","abstract":"We begin by reviewing the statistical framework of information theory as applicable to neuroimaging data analysis. A major factor hindering wider adoption of this framework in neuroimaging is the difficulty of estimating information theoretic quantities in practice. We present a novel estimation technique that combines the statistical theory of copulas with the closed form solution for the entropy of Gaussian variables. This results in a general, computationally efficient, flexible, and robust multivariate statistical framework that provides effect sizes on a common meaningful scale, allows for unified treatment of discrete, continuous, unidimensional and multidimensional variables, and enables direct comparisons of representations from behavioral and brain responses across any recording modality. We validate the use of this estimate as a statistical test within a neuroimaging context, considering both discrete stimulus classes and continuous stimulus features. We also present examples of analyses facilitated by these developments, including application of multivariate analyses to MEG planar magnetic field gradients, and pairwise temporal interactions in evoked EEG responses. We show the benefit of considering the instantaneous temporal derivative together with the raw values of M/EEG signals as a multivariate response, how we can separately quantify modulations of amplitude and direction for vector quantities, and how we can measure the emergence of novel information over time in evoked responses. Open-source Matlab and Python code implementing the new methods accompanies this article. Hum Brain Mapp, 2016. © 2016 The Authors Human Brain Mapping Published by Wiley Periodicals, Inc.","authors":["Robin A.A. Ince","Bruno L Giordano","Christoph Kayser","Guillaume A Rousselet"],"meta":["November 2016Human Brain Mapping 38(3)","DOI:10.1002/hbm.23471"],"references":["325054215_Space-by-time_decomposition_for_single-trial_decoding_of_MEEG_activity","301882972_Testing_the_Gaussian_Copula_Hypothesis_for_Financial_Assets_Dependences","299420824_Space-by-time_non-negative_matrix_factorization_for_single-trial_decoding_of_MEEG_activity","285782525_Tracing_the_Flow_of_Perceptual_Features_in_an_Algorithmic_Brain_Network","344713686_An_Introduction_to_the_Bootstrap","323395563_Analytical_estimates_of_limited_sampling_biases_in_different_information_measures","313659797_Biometry_The_principles_and_practice_of_statistics_in_biological_research_WH_Freeman_and_Company","286303634_Transfer_entropy_in_neuroscience","284399661_Information_Theory_and_an_Extension_of_the_Maximum_Likelihood_Principle","284382067_Representational_similarity_analysis-connecting_the_branches_of_systems_neuroscience_Front_Sys"]}