{"id":"310591339_Identifying_research_priorities_to_advance_climate_services","abstract":"Climate services involve the timely production, translation, and delivery of useful climate data, information, and knowledge for societal decision-making. They rely on a range of expertise and are underpinned by research in climate and related sciences, sectoral applications (e.g., agriculture, water, health, energy, disasters), and a number of social science fields, including political science, sociology, anthropology, and economics. Feedback and engagement between these research communities and the communities involved in developing and/or using climate services is thus critical, ensuring that climate services are built on the best available science and providing researchers with guidance regarding priority challenges in the development of climate services that should warrant their attention.\nThis paper reports the results of an international survey to gauge community perspective on research priorities for climate services, highlighting several areas in which respondents agree on the need for future work. The survey results indicate an overarching interest in research that can better connect climate information to users, particularly around the communication of climate information, the mapping of climate information needs, and the evaluation and prioritization of capacity building efforts. They also reveal significant interest in climate research to advance the skill of forecasts at subseasonal-to-seasonal scales – considered more broadly useful to decision makers than information at the end-of-century timescale – and to identify the drivers of extreme events. To support climate-related research, survey respondents underscore the need to continually develop and maintain the observational network.\nIn analyzing these results, the paper offers guidance to researchers and to other members of the climate services community that may find these priorities useful in directing their own work to address the challenges posed by climate variability and change.","authors":["Catherine Vaughan","Lawrence Buja","Andrew Kruczkiewicz","Lisa Goddard"],"meta":["November 2016Climate Services 4(C)","DOI:10.1016/j.cliser.2016.11.004"],"references":["310459256_THE_ENACTS_APPROACH_Transforming_climate_services_in_Africa_one_country_at_a_time_A_World_Policy_Paper","308748728_Data_Scarcity_or_low_Representativeness_What_hinders_accuracy_and_precision_of_spatial_interpolation_of_climate_data","303620429_The_Right_Stuff_Informing_Adaptation_to_Climate_Change_in_British_Local_Government","303618292_Communicating_uncertainty_in_seasonal_and_interannual_climate_forecasts_in_Europe","301239356_Co-exploratory_climate_risk_workshops_Experiences_from_urban_Africa","331920079_Knowledge_brokerage_designs_and_practices_in_four_european_climate_services_A_role_model_for_biodiversity_policies","316998152_Research_and_networks_for_decision_support_in_the_NOAA_Sectoral_Applications_Research_Program","310594664_World_Climate_Research_Programme_achievements_activities_and_challenges","310594285_Climate_information_in_decision-making_in_the_Greater_Horn_of_Africa_lessons_and_experiences","304781637_101016jgloenvcha201510004"]}