{"id":"310508459_A_Real-Time_Target_Tracking_Algorithm_for_a_Robotic_Flexible_Endoscopy_Platform","abstract":"Complex endoscopic interventions require a new generation of devices and instruments. A robotic platform for flexible endoscopy through telemanipulation was developed to meet this demand. The concept of telemanipulation allows the development of software for computer-aided surgery. Intelligent navigation such as automated target centralization could assist the endoscopist during procedures.\nA real-time algorithm was designed for tracking a target region that is of specific interest for the surgeon. Therefore, the physician needs to indicate the region to be tracked, which then will be centralized (locked). The goal of this research is to investigate the robustness and accuracy of the tracking algorithm during endoscopic interventions. The region of interest can be a polyp for polypectomy, Vater’s ampulla for Endoscopic Retrograde CholangioPancreatography (ERCP), Barrett’s epithelia for gastroscopic biopsy or any area in more complex procedures. The algorithm was tested in vitro on image sequences obtained during real endoscopic interventions.\nThe indicated area of interest could be tracked in all image sequences, with an accuracy of 91.6 % (Q1–Q3 77.7 %–99.0 %, intraclass correlation). The algorithm was robust against instruments or smoke in the field of view. Tracking was less robust against very large camera movements.\nThe developed target lock worked robustly, in real-time and was found to be accurate. Improvements include improving the robustness of the algorithm against motion blur and drift.","authors":["Nanda van der Stap","Luuk Voskuilen","Guido De Jong","Hendrikus J. M. Pullens"],"meta":["February 2016","DOI:10.1007/978-3-319-29965-5_8","Conference: International Workshop on Computer-Assisted and Robotic Endoscopy","Project: Image-based navigation of a robotized flexible endoscope"],"references":["271419393_Image-Based_Navigation_for_a_Robotized_Flexible_Endoscope","265734200_A_non-invasive_navigation_system_for_retargeting_gastroscopic_lesions","260432379_Pathological_Site_Retargeting_under_Tissue_Deformation_Using_Geometrical_Association_and_Tracking","225096269_Advanced_Technologies_for_Gastrointestinal_Endoscopy","224213578_Robotic_Assistance_to_Flexible_Endoscopy_by_Physiological-Motion_Tracking","51773520_Endoscopic_Video_Manifolds_for_Targeted_Optical_Biopsy","316240097_Distinctive_Image_Features_from_Scale-Invariant_Keypoints","268733104_Speeded-up_robust_features_SURF","261479993_Design_and_evaluation_of_robotic_steering_of_a_flexible_endoscope","261479990_The_use_of_the_focus_of_expansion_for_automated_steering_of_flexible_endoscopes","261272815_Dynamic_tracking_of_anatomical_object_for_a_steerable_endoscope","255701348_Robust_feature_tracking_for_endoscopic_pose_estimation_and_structure_recovery","247409789_On_the_use_of_the_intraclass_correlation_coefficient_in_the_testing_of_the_difference_of_certain_variance_ratios","200038910_Distinctive_Image_Features_from_Scale-Invariant_Keypoints","51923246_Re-localisation_of_a_biopsy_site_in_endoscopic_images_and_characterisation_of_its_uncertainty"]}