{"id":"310615519_Predicting_Judicial_Decisions_of_the_European_Court_of_Human_Rights_A_Natural_Language_Processing_Perspective","abstract":"Recent advances in Natural Language Processing and Machine Learning provide us with the tools to build predictive models that can be used to unveil patterns driving judicial decisions. This can be useful, for both lawyers and judges, as an assisting tool to rapidly identify cases and extract patterns which lead to certain decisions. This paper presents the first systematic study on predicting the outcome of cases tried by the European Court of Human Rights based solely on textual content. We formulate a binary classification task where the input of our classifiers is the textual content extracted from a case and the target output is the actual judgment as to whether there has been a violation of an article of the convention of human rights. Textual information is represented using contiguous word sequences, i.e., N-grams, and topics. Our models can predict the court's decisions with a strong accuracy (79% on average). Our empirical analysis indicates that the formal facts of a case are the most important predictive factor. This is consistent with the theory of legal realism suggesting that judicial decision-making is significantly affected by the stimulus of the facts. We also observe that the topical content of a case is another important feature in this classification task and explore this relationship further by conducting a qualitative analysis.","authors":["N. Aletras","Dimitrios Tsarapatsanis","D. Preoţiuc-Pietro","Vasileios Lampos"],"meta":["October 2016PeerJ Computer Science 2016(10)","DOI:10.7717/cs.93","Project: Machine learning for judicial decisions"],"references":["309399037_Predicting_judicial_decisions_of_the_European_Court_of_Human_Rights_a_Natural_Language_Processing_perspective","283316905_A_Pragmatic_Legal_Expert_System","330038078_The_puzzle_of_judicial_behavior","313487833_A_tutorial_on_spectral_clustering","303281421_Feature_ranking_using_linear_SVM","291295804_Prediction_and_Particularity","290317874_Human_Rights_Fact-Finding_The_European_Court_of_Human_Rights_at_a_Crossroads","289170123_Naturalizing_Jurisprudence_Essays_on_American_Legal_Realism_and_Naturalism_in_Legal_Philosophy","287949340_Langdell's_orthodoxy","286126814_Beyond_the_Formalist-Realist_Divide_The_Role_of_Politics_in_Judging"]}