{"id":"310665022_Web-Based_Antismoking_Advertising_to_Promote_Smoking_Cessation_A_Randomized_Controlled_Trial","abstract":"Background: \nAlthough hundreds of millions of dollars are spent each year on public health advertising, the advertisement content, design, and placement are usually developed by intuition rather than research.\n\nObjective: \nThe objective of our study was to develop a methodology for testing Web-based advertisements to promote smoking cessation.\n\nMethods: \nWe developed 10 advertisements that varied by their content (those that empower viewers to quit, help viewers to quit, or discuss the effects of smoking). We then conducted a series of Web-based randomized controlled trials that explored the effects of exposing users of Microsoft's Bing search engine to antismoking advertisements that differed by content, placement, or other characteristics. Finally, we followed users to explore whether they conducted subsequent searches for smoking cessation products or services.\n\nResults: \nThe advertisements were shown 710,106 times and clicked on 1167 times. In general, empowering advertisements had the greatest impact (hazard ratio [HR] 2.6, standard error [SE] 0.09 relative to nonempowering advertisements), but we observed significant variations by gender. For instance, we found that men exposed to smoking cessation advertisements were less likely than women to subsequently conduct smoking cessation searches (HR 0.2, SE 0.07), but that this likelihood increased 3.5 times in men exposed to advertisements containing empowering content. Women were more influenced by advertisements that emphasized the health effects of smoking. We also found that appearing at the top right of the page (HR 2.1, SE 0.07) or at the bottom rather than the top of a list (HR 1.1, SE 0.02) can improve smoking cessation advertisements' effectiveness in prompting future searches related to smoking cessation.\n\nConclusions: \nAdvertising should be targeted to different demographic groups in ways that are not always intuitive. Our study provides a method for testing the effectiveness of Web-based antismoking advertisements and demonstrates the importance of advertisements that are tailored according to specific demographics.","authors":["Elad Yom-Tov","Peter Muennig","Abdulrahman Sayed"],"meta":["November 2016Journal of Medical Internet Research 18(11):e306","DOI:10.2196/jmir.6563"],"references":["276065475_Information_is_in_the_eye_of_the_beholder_Seeking_information_on_the_MMR_vaccine_through_an_Internet_search_engine","271600287_Automatic_Identification_of_Web-Based_Risk_Markers_for_Health_Events","262813340_Experimental_Evidence_of_Massive-Scale_Emotional_Contagion_Through_Social_Networks","228058014_Pattern_Classification","345843081_Crowdsourced_Health_How_What_You_Do_on_the_Internet_Will_Improve_Medicine","285934826_The_Guide_to_Community_Preventive_Services_What_works_to_promote_health","271919867_Online_ads_and_offline_sales_Measuring_the_effect_of_retail_advertising_via_a_controlled_experiment_on_Yahoo","269411185_A_Cost-Effectiveness_Analysis_of_the_First_Federally_Funded_Antismoking_Campaign","221653329_Overlapping_Experiment_Infrastructure_More_Better_Faster_Experimentation","24241914_Infodemiology_and_Infoveillance_Framework_for_an_Emerging_Set_of_Public_Health_Informatics_Methods_to_Analyze_Search_Communication_and_Publication_Behavior_on_the_Internet"]}