{"id":"310604896_On_Discrete_Three_Parameter_Burr_Type_XII_and_Discrete_Lomax_Distributions_and_Their_Applications_to_Model_Count_Data_from_Medical_Science","abstract":"In this paper we propose a discrete analogue of three parameter Burr type XII distribution an discrete Lomax distribution as new discrete models using the general approach of discretization of continuous distribution. The models are plausible in modeling discrete data and exhibit both increasing and decreasing hazard rates. We shall first study some basic distributional and moment properties of these new distributions. Then, certain structural properties of the distributions such as their unimodality, hazard rate behaviors and the second rate of failure functions are discussed. Developing a discrete versions of three parameter Burr type XII and Lomax distributions would be helpful in modeling a discrete data which exhibits heavy tails and can be useful in medical science and other fields. The equivalence of discrete three parameter Burr type XII (DBD- XII) and continuous Burr type XII (BD-XII) distributions has been established and similarly characterization results have also been made to establish a direct link between the discrete Lomax distribution and its continuous counterpart. Various theorems relating a three parameter discrete Burr type XII distribution and discrete Lomax distribution with other statistical distributions have also been proved. Finally, the models are examined with an example data set originated from a study [1,2], data set of counts of cysts of kidneys using steroids and compared with the classical models.","authors":["Bilal Para","Jan T R"],"meta":["July 2016","DOI:10.15406/bbij.2016.04.00092","Project: statistical models in medical sciences"],"references":["297219895_DISCRETIZATION_OF_BURR-TYPE_III_DISTRIBUTION","314767955_Reliability_and_Life_Testing","302970924_A_Simplex_Method_for_Function_Minimization","273134799_Estimating_the_Dimension_of_a_Model","271196714_New_Look_at_Statistical-Model_Identification","250750607_A_discrete_inverse_Weibull_distribution_and_estimation_of_its_parameters","243044574_The_Discrete_Normal_Distribution","240924157_Discrete_Burr_and_discrete_Pareto_distributions","234416257_Reliability_in_Engineering_Design","224906709_A_Discrete_Analog_of_the_Generalized_Exponential_Distribution"]}