{"id":"310611303_Data_and_text_mining_techniques_for_classifying_Arabic_tweet_polarity","abstract":"Sentiment analysis is a new task related to text mining that extracts opinions from textual data and classifies them into positive, negative or neutral. The goal of this paper is to determine the effect of applying stemming and n-gram techniques for Arabic texts (tweets) on sentiment classification. This study also aims at investigating the impact of feature selection on the performance of the classifier. For this reason, three classifiers Support Vector Machines (SVM), Naïve Bayes, (NB), and K-nearest neighbor (KNN) are used. The obtained results showed that the best results of performance are obtained when applying a hybrid representation which includes tokens with character 3-grams. The experiment results also revealed that the use of feature selection technique improves significantly the accuracy of the three classifiers for the task of opinion classification. Regarding The classifiers, SVM outperforms the other classifiers when using all the features, while when selecting the most relevant features by the SVM feature selection technique, SVM and NB provided the best results. © 2016, Digital Information Research Foundation. All rights reserved.","authors":["Belgacem Brahimi","Mohamed Touahria","Abdelkamel A Kamel Tari"],"meta":["February 2016"],"references":["294090331_Sentiment_after_Translation_A_Case-Study_on_Arabic_Social_Media_Posts","273114850_Automatic_Arabic_text_categorization_A_comprehensive_comparative_study","267992816_A_Study_of_the_Effects_of_Preprocessing_Strategies_on_Sentiment_Analysis_for_Arabic_Text","262687538_Aara'_-_A_system_for_mining_the_polarity_of_Saudi_public_opinion_through_e-newspaper_comments","259133206_SAMAR_Subjectivity_and_sentiment_analysis_for_Arabic_social_media","256170367_Exploring_the_Effects_of_Word_Roots_for_Arabic_Sentiment_Analysis","252067921_The_Effect_of_Stemming_on_Arabic_Text_Classification_An_Empirical_Study","241185789_Machine_Translation_of_Arabic_Dialects","233859568_Sentence-Level_Arabic_Sentiment_Analysis","309208159_Unsupervised_Learning_of_Semantic_Orientation_from_a_Hundred-Billion-Word_Corpus"]}