{"id":"310606681_DESAFIOS_ENFRENTADOS_POR_ALUNOS_DO_PROEJA_NO_USO_DAS_TECNOLOGIAS_DA_INFORMACAO_E_COMUNICACAO_TIC","abstract":"RESUMO As Tecnologias de Informação e Comunicação (TIC) estão trazendo novos desafios pedagógicos no contexto da educação contemporânea, inserida na sociedade da informação. Podem aperfeiçoar a prática do educador e possibilitar maior interatividade e afetividade do aluno jovem ao adulto, transformando-o de passivo a ativo no processo ensino-aprendizagem. Entretanto, alguns impasses ainda condicionam a adoção prática de TIC em sala de aula, especialmente quando se trata de uma sala de aula tão diversa quanto à de um curso PROEJA. Este trabalho tem por objetivo realizar um diagnóstico da utilização de TIC por alunos do PROEJA, verificando os principais desafios encontrados, analisando possíveis causas e soluções. Utilizou-se o método de levantamento, por meio de questionário composto por questões fechadas e abertas, aplicadas aos alunos do curso Técnico em Cozinha na modalidade PROEJA. Ao todo, a população amostral contou com 50 participantes, que responderam ao questionário online durante a primeira quinzena de novembro de 2015. Palavras-chave: PROEJA; TIC; educação contemporânea. 1. Introdução Com a chegada dos microcomputadores pessoais a partir de 1980 ocorreu uma transformação na relação usuário/máquina: o que antes tinha sentido único, assim como acontecia com os televisores, transformou-se numa relação interativa (LOKCHIN, 2010). Segundo Lokchin (2010), essa transformação digital, que culminou com o surgimento do ciberespaço e da cibercultura, se deve à expansão da internet e ao crescente uso dos computadores pessoais. Dentro deste contexto plural e dinâmico da cibercultura o processo educativo formal também é influenciado, e por isso deve, segundo Sousa et al. (2011), reinventar-se caso queira sobreviver. Estudos atuais sobre o assunto (SOUSA et al., 2011; NETO e FRANCO, 2010) mencionam que os processos de ensino-aprendizagem vêm se diversificando em todos os níveis e modalidades de ensino. Isto inclui o Programa Nacional de Integração da 1 Mestre em Ciência da Computação 2 ²Mestre em Geografia 3 Instituto Federal Farroupilha","authors":["Aliane Loureiro Krassmann","Andressa Falcade","Alcionir Pazatto Almeida"],"meta":["November 2016"],"references":["312125489_Metodologia_da_Pesquisa_e_Elaboracao_de_Dissertacao","26357184_Novas_Praticas_de_Leitura_e_Escrita_Letramento_na_Cibercultura","273097347_Os_Professores_e_os_Desafios_Pedagogicos_Diante_das_Novas_Geracoes_Consideracoes_sobre_o_Presente_e_o_Futuro","200086112_A_Technique_for_Measurement_of_Attitudes"]}