{"id":"310794910_A_Quantum_of_Continuous_Simulated_Time","abstract":"In the context of discrete-event simulation, time resolution pertains to the time points at which events actually occur, whereas time precision constrains the time points at which events may possibly occur. Time precision is generally associated with the rounding of time values that takes place when a simulation is executed on a computer, yet here we study precision on a theoretical level. We find that while some models truly require a continuous representation of simulated time, a surprisingly diverse set of continuous-time models can be regarded as having an inherent level of time precision. We explore this concept by introducing the notion of an optimal time quantum, a simulation model property useful for establishing the set of durations which evenly divide all mathematically possible event times. A hierarchical method is presented for deriving the optimal time quantum from a model specification. The proposed theory complements past and ongoing research on simultaneity, time representation, and formal reasoning.","authors":["Rhys Goldstein","Simon Breslav","Azam Khan"],"meta":["April 2016","DOI:10.22360/SpringSim.2016.TMSDEVS.004","Conference: Symposium on Theory of Modeling and SimulationAt: Pasadena, CA, USA","Project: Systems Design and Simulation"],"references":["264937774_Constructive_Models_of_Discrete_and_Continuous_Physical_Phenomena","259345849_Gromacs_User_Manual_Version_46","243547056_Theory_of_Modeling_and_Simulation_Integrating_Discrete_Event_and_Continuous_Complex_Dynamic_Systems","311474540_The_threshold_of_event_simultaneity","288130493_A_journal_profiling_and_co-citation_study_of_SIMULATION_The_transactions_of_the_society_for_modeling_and_simulation_international","281890169_Superdense_time_trajectories_for_DEVS_simulation_models","269258494_A_data_type_for_discretized_time_representation_in_DEVS","263507286_A_Family_of_Simulation_Criteria_to_Guide_DEVS_Models_Validation_Rigorously_Systematically_and_Semi-Automatically","262346759_On_time_granularity_and_event_granularity_in_simulation_service_composition_WIP","258188130_Principles_of_Discrete_Event_System_Specification_model_verification"]}