{"id":"310741044_ICT_Teachers'_Acceptance_of_Scratch_as_Algorithm_Visualization_Software","abstract":"p>This study aims to investigate the acceptance of ICT teachers pertaining to the use of Scratch as an Algorithm Visualization (AV) software in terms of perceived ease of use and perceived usefulness. An embedded mixed method research design was used in the study, in which qualitative data were embedded in quantitative ones and used to explain the results. The data were collected from 214 pre-service ICT teachers studying in four large public universities. Data was gathered through a questionnaire adapted from David’s Technology Acceptance Survey (1989) and through open-ended questions. T-test and Pearson correlation, as well as descriptive statistics, were used to analyze quantitative data and constant analysis techniques were used to analyze qualitative data. Both kinds of data were mixed and are presented in the results section. The results show that pre-service ICT teachers mainly have positive and similar Scratch acceptance scores in terms of usefulness and ease of use. The factors explaining participants’ perceived usefulness are identified as visual interface (37%), pedagogy(36%), and computational thinking (27%). The majority of the participants also found Scratch to be easy to use. Pre-service ICT teachers explained that what makes AV software easy to use is color separation (40%), drag and drop (30%), and familiar interface (30%). Additionally, no significant difference between the acceptance scores of the participants was found in terms of gender, years of programming experience, programming background, and the high school they graduated from as indicators of programming experience. Results congruent with previous studies regarding Scratch were found by the current study.</p","authors":["Fatih Saltan","Mehmet Kara"],"meta":["November 2016Higher Education Studies 6(4):146","DOI:10.5539/hes.v6n4p146"],"references":["276342542_Undergraduate_Students'_Experiences_in_Programming_Difficulties_and_Obstacles","275542317_Learning_Programming_Problem_Solving_and_Gender_A_Longitudinal_Study","274309848_Computational_Thinking","265731642_Learning_to_communicate_computationally_with_Flip_A_bi-modal_programming_language_for_game_creation","262166570_Experiences_in_Computer_Science_Wonderland_A_Success_Story_with_Alice","343364402_Running_on_Empty_the_Failure_to_Teach_K--12_Computer_Science_in_the_Digital_Age","298972479_Learning_Computer_Science_Concepts_with_Scratch","277374591_Lowering_the_barriers_to_programming","272391677_Programming_assistance_tools_to_support_the_learning_of_IT_programming_in_South_African_secondary_schools","266562898_Review_on_teaching_and_learning_of_computational_thinking_through_programming_What_is_next_for_K-12"]}