{"id":"310788899_An_IoT_and_Wearable_Technology_Hackathon_for_Promoting_Careers_in_Computer_Science","abstract":"This paper explores the use of a constructivist 21st-century learning model to implement a week-long workshop, delivered as a \"hackathon,\" to encourage preuniversity teenagers to pursue careers in STEM, with a particular emphasis on computer science. For Irish preuniversity students, their experience of computing can vary from word processing to foundational programming, and while many schools are looking to introduce more ICT into the classroom, many students are left with a narrow view of what computer science is all about. Twenty-one students participated in the workshop and completed pre- and post-surveys, and a free word association exercise in the areas of computing and careers in computing. Analysis revealed that students' motivation to learn about the design process, programming, inputs and outputs, and wearable technology (wearables)/Internet of Things (IoT) increased following participation. There were also increases in confidence in inputs and outputs and wearables/IoT following participation, as well as changes in the computing word associations, with students associating computing more with computer programming terms rather than general terms such as the Internet. The findings suggest that the combination of a hackathon event and a model for 21st century learning can be effective in motivating and increasing the self-efficacy of preuniversity teenagers in a number of emerging technological contexts such as IoT and wearables.","authors":["Jake Rowan Byrne","Katriona O'Sullivan","Kevin Sullivan"],"meta":["November 2016IEEE Transactions on Education PP(99):1-9","DOI:10.1109/TE.2016.2626252","Project: Bridge21"],"references":["278849962_Making_Physical_and_Digital_Games_with_E-Textiles_A_Workshop_for_Youth_Making_Responsive_Wearable_Games_and_Controllers","321614284_Design_Thinking_Understand_-_Improve_-_Apply","319460462_Design_thinking_research","316164892_Design_thinking_research","304825113_Hackathons_as_an_Informal_Learning_Platform","303286373_Stimulating_and_maintaining_students'_interest_in_computer_science_using_the_hackathon_model","290985715_Science_technology_engineering_and_mathematics_STEM_education_Background_federal_policy_and_legislative_action","288926624_Comparing_frameworks_for_21st_century_skills","282876271_Utilizing_Wearable_Technologies_as_a_Pathway_to_STEM","281382227_Robotics_camps_clubs_and_competitions_Results_from_a_US_robotics_project"]}