{"id":"310742505_The_Sexual_Orientation_and_Gender_Presentation_of_Hijra_Kothi_and_Panthi_in_Mumbai_India","abstract":"Cultural categories related to sexuality and gender vary considerably cross-culturally. While Western cultures categorize people primarily in terms of sexual attractions (i.e., gay, straight, bisexual), many cultures distinguish between groups based on additional issues such as gender role presentation and position preference in anal sex (i.e., insertive/receptive). The current study gathered data on three categories of natal males in Mumbai, India-hijra, kothi, and panthi (N = 93). Hijra are androphilic (sexually attracted to adult men), typically sexually receptive, transgender, sometimes castrated, and live in fictive kinship networks that are hierarchically organized. Kothi are also androphilic, typically sexual receptive and relatively feminine but less so than hijra; unlike hijra, kothi are never castrated. Hijra and kothi were understood by some participants to be mutually compatible, and so three groups were identified-those endorsing hijra only (n = 11), kothi only (n = 22), and both hijra and kothi (n = 22). Panthi (n = 38) are the masculine insertive partners of hijra and kothi. Measures employed were self-report and viewing time measures of sexual attraction, sexual behavior and position preference, self-described masculinity/femininity, recalled childhood gender atypicality, gendered occupational preferences, and gender presentation milestones (i.e., wearing female clothes, castration). All hijra and kothi groups were found to be exclusively androphilic in viewing time and self-reported sexual attractions, and to be gender-atypical on all measures. Panthi were found to be relatively male-typical and to have a bisexual pattern of viewing time and self-reported sexual attractions. Kothi were found to be less extreme in their female typicality and to report less female gender presentation milestones than hijra or hijra/kothi. Most hijra and hijra/kothi and all kothi said that they were not castrated. Contrary to the manner in which they are socially defined, a third of panthi report having been receptive in anal sex, and a third of all hijra and kothi groups report having been insertive at some time.","authors":["Matthew Stief"],"meta":["January 2017Archives of Sexual Behavior 46(1)","DOI:10.1007/s10508-016-0886-0"],"references":["306130075_Recalled_Gendered_Behavior_in_Childhood_A_Comparison_of_Androphilic_Men_Gynephilic_Men_and_Androphilic_Women_in_Japan","301551770_The_Relationship_between_Adult_Occupational_Preferences_and_Childhood_Gender_Nonconformity_among_Samoan_Women_Men_and_Fa'afafine","291948022_Reconsidering_Male_Bisexuality_Sexual_Activity_Role_and_Sexual_Attraction_in_Samoan_Men_Who_Engage_in_Sexual_Interactions_With_Fa'afafine","347710819_The_Myth_of_the_Modern_Homosexual_Queer_History_and_the_Search_for_Cultural_Unity","323322132_The_history_of_sexuality_Volume_1_An_introduction","314505072_Third_sex_third_gender_beyond_sexual_dimorphism_in_culture_and_history","304353240_A_neural_circuit_encoding_sexual_preference_in_humans","289866233_The_Kothi_Wars","289098737_The_Kothi_Wars_AIDS_Cosmopolitanism_and_the_Morality_of_Classification","283324558_Sexual_arousal_The_correspondence_of_eyes_and_genitals","272181243_Viewing_Time_Measures_of_Sexual_Orientation_in_Samoan_Cisgender_Men_Who_Engage_in_Sexual_Interactions_with_Fa'afafine","276130503_Evolving_research_on_the_evolution_of_male_androphilia","274509233_Saint_Foucault_Towards_a_Gay_Hagiography","273047479_The_North_American_Berdache","271756146_The_Cultural_Psychiatric_and_Sexuality_Aspects_of_Hijras_in_India"]}