{"id":"310742877_IoT-based_Smart_Parking_System_for_Sporting_Event_Management","abstract":"By connecting devices, people, vehicles and infrastructures everywhere in a city, governments and their partners can improve community wellbeing and other economic and financial aspects (e.g., cost and energy savings). Nonetheless, smart cities are complex ecosystems that comprise many different stakeholders (network operators, managed service providers, logistic centers...) who must work together to provide the best services and unlock the commercial potential of the IoT. This is one of the major challenges that faces today's smart city movement, and more generally the IoT as a whole. Indeed, while new smart connected objects hit the market every day, they mostly feed \"vertical silos\" (e.g., vertical apps, siloed apps...) that are closed to the rest of the IoT, thus hampering developers to produce new added value across multiple platforms. Within this context, the contribution of this paper is twofold: (i) present the EU vision and ongoing activities to overcome the problem of vertical silos; (ii) introduce recent IoT standards used as part of a recent Horizon 2020 IoT project to address this problem. The implementation of those standards for enhanced sporting event management in a smart city/government context (FIFA World Cup 2022) is developed, presented, and evaluated as a proof-of-concept.","authors":["Sylvain Kubler","Jérémy Robert","Ahmed Hefnawy","Chantal Cherifi"],"meta":["November 2016","DOI:10.1145/2994374.2994390","Conference: the 13th International Conference"],"references":["292078398_IoT_for_Smart_City_Services_Lifecycle_Approach","279177017_Internet_of_Things_A_Survey_on_Enabling_Technologies_Protocols_and_Applications","278798179_Internet_of_Things_Applications_-_From_Research_and_Innovation_to_Market_Deployment","266560092_A_standardized_approach_to_deal_with_firewall_and_mobility_policies_in_the_IoT","314113641_Opportunity_to_Leverage_Information-as-an-Asset_in_the_IoT_--_The_Road_Ahead","306071715_Git4Voc_Collaborative_Vocabulary_Development_Based_on_Git","303920451_Git4Voc_Collaborative_Vocabulary_Development_Based_on_Git","283046928_Git4Voc_Git-Based_Versioning_for_Collaborative_Vocabulary_Development","277253884_The_Web_of_Things_Challenges_and_Opportunities","268692270_P2P_Data_synchronization_for_product_lifecycle_management"]}