{"id":"310737137_Simple_dynamics_for_plurality_consensus","abstract":"We study a plurality-consensus process in which each of n anonymous agents of a communication network initially supports a color chosen from the set [k]. Then, in every round, each agent can revise his color according to the colors currently held by a random sample of his neighbors. It is assumed that the initial color configuration exhibits a sufficiently large biass towards a fixed plurality color, that is, the number of nodes supporting the plurality color exceeds the number of nodes supporting any other color by s additional nodes. The goal is having the process to converge to the stable configuration in which all nodes support the initial plurality. We consider a basic model in which the network is a clique and the update rule (called here the 3-majority dynamics) of the process is the following: each agent looks at the colors of three random neighbors and then applies the majority rule (breaking ties uniformly). We prove that the process converges in time (Formula presented.) with high probability, provided that (Formula presented.). We then prove that our upper bound above is tight as long as (Formula presented.). This fact implies an exponential time-gap between the plurality-consensus process and the median process (see Doerr et al. in Proceedings of the 23rd annual ACM symposium on parallelism in algorithms and architectures (SPAA’11), pp 149–158. ACM, 2011). A natural question is whether looking at more (than three) random neighbors can significantly speed up the process. We provide a negative answer to this question: in particular, we show that samples of polylogarithmic size can speed up the process by a polylogarithmic factor only.","authors":["Luca Becchetti","Andrea Clementi","Emanuele Natale","Francesco Pasquale"],"meta":["August 2017Distributed Computing 30(4)","DOI:10.1007/s00446-016-0289-4"],"references":["304821918_Determining_majority_in_networks_with_local_interactions_and_very_small_local_memory","262029666_Determining_Majority_in_Networks_with_Local_Interactions_and_Very_Small_Local_Memory","340610217_Balls_and_bins_A_study_in_negative_dependence","330776091_Distributed_community_detection_in_dynamic_graphs","310912023_Reaching_consensus_on_social_networks","297472255_Distributed_probabilistic_polling_and_applications_to_proportionate_agreement","270007010_Global_majority_consensus_by_local_majority_polling_on_graphs_of_a_given_degree_sequence","267987625_Stabilizing_Consensus_With_the_Power_of_Two_Choices","266240257_Convergence_Speed_of_Binary_Interval_Consensus","263856092_Plurality_Consensus_in_the_Gossip_Model","237054307_Tight_Lower_Bound_on_the_Probability_of_a_Binomial_Exceeding_its_Expectation","260122573_Distributed_Multivalued_Consensus","235696977_Distributed_Community_Detection_in_Dynamic_Graphs","228115418_Majority_Dynamics_and_Aggregation_of_Information_in_Social_Networks","225685483_A_simple_population_protocol_for_fast_robust_approximate_majority"]}