{"id":"310795856_Distance_training_for_physics_teachers_in_education_sciences_flexible_and_efficient","abstract":"Continuous training courses for the teachers of the Minister of National Education are essential to update their disciplinary and pedagogical skills. However, teachers in Morocco rarely benefit from continuous training courses, especially in educational science. This lack is due to organizational constraints as well as temporary unavailability of teachers. In this paper, we propose distance learning, across the Moroccan Kingdom in educational science based on complete, intelligent and communicative e-Learning platform. The main objective of this distance learning is to provide teachers with solid, efficient and flexible training courses in educational sciences. Flexible, because our distance learning use some approaches that allow each teacher to preplan their learning activities and collaboration with other teachers. Efficient, because traditional training is done at each city and requires an important budget, while our distance learning is at the national level and without cost of the training courses (movement of both teachers and Supervisors, Indemnities of the supervisors, catering and also accommodation). The added value of our distance learning platform is to offer various advantages: First, updating their knowledge in physics science, Second helping teachers improve their methods and teaching strategy, Third sharing courses and new teaching strategies between the teachers, fourth encouraging teachers to educational research and also preparing teachers to become future scientists in education.","authors":["Khalid Mahdi","Chekour Mohammed","Mohamed Laafou"],"meta":["January 2014International Journal of Scientific and Engineering Research 5(1):77-80","Projects: Teaching physics between technology and pedagogyConception d'un support numérique d'aide pour l'enseignement des sciences physiques"],"references":["277147367_Tuteurs_en_ligne_quels_roles_quelle_formation","242666074_LE_TUTEUR_EN_LIGNE_QUELLES_CONDITIONS_D'EFFICACITE_DANS_UN_DISPOSITIF_D'APPRENTISSAGE_COLLABORATIF_A_DISTANCE","267370962_An_Opencast_Mobile_learning_Framework_for_Enhancing_Learning_in_Higher_Education","44828853_Apprentissage_collaboratif_a_distance_Pour_comprendre_et_concevoir_les_environnements_d'apprentissage_virtuels"]}