{"id":"310792373_Analyzing_students'_software_redesign_strategies","abstract":"The design of software is known to be difficult for novice computer scientists. In this paper, we focus on software redesign and on the refactoring necessary to implement a redesign. Redesigning an application aims to improve non-functional aspects such as extensibility, without changing the functionality. Redesign is a complex task, involving knowledge and skills from software design in general and the use of design patterns in particular. This study is part of an educational design research project aiming at developing scaffolding for students' software redesign activities in the form of procedural guidance. We investigated students' strategies and usage of concepts during a software redesign assignment using students' reports and team colllaboration recordings as data sources, thus focusing on the process instead of on the design results, in contrast with existing studies. We identified several difficulties that can serve as starting points for procedural guidance. For instance, students seem to avoid using a structured analysis method. Our findings indicate that students' activities were mainly directed towards the code rather than the design problem.","authors":["Sylvia Stuurman","H. Passier","Erik Barendsen"],"meta":["November 2016","DOI:10.1145/2999541.2999559","Conference: the 16th Koli Calling International Conference","Project: Education in Computer Science"],"references":["272586727_Metacognition_Cognitive_Monitoring_and_Mathematical_Performance","272177799_Why_Minimal_Guidance_During_Instruction_Does_Not_Work_An_Analysis_of_the_Failure_of_Constructivist_Discovery_Problem-Based_Experiential_and_Inquiry-Based_Teaching","249674934_A_Description_of_Think_Aloud_Method_and_Protocol_Analysis","344912814_Chapter_2_Design_Smells","344897144_Problem_Solving_Perspectives_from_Cognition_and_Neuroscience","313053489_Ten_Steps_to_Complex_Learning","311476591_Teaching_students_to_build_well_formed_object-oriented_methods_through_refactoring","301428111_What_do_software_design_students_understand_about_information_hiding","292703211_Students_Designing_Software_a_Multi-National_Multi-Institutional_Study","287046238_Refactoring_for_Software_Design_Smells_Managing_Technical_Debt"]}