{"id":"310748591_Study_of_Streptococcus_thermophilus_population_on_a_world-wide_and_historical_collection_by_a_new_MLST_scheme","abstract":"We analyzed 178 Streptococcus thermophilus strains isolated from diverse products, from around the world, over a 60-year period with a new multilocus sequence typing (MLST) scheme. This collection included isolates from two traditional cheese-making sites with different starter-use practices, in sampling campaigns carried out over a three years period. The nucleotide diversity of the S. thermophilus population was limited, but 116 sequence types (ST) were identified. Phylogenetic analysis of the concatenated sequences of the six housekeeping genes revealed the existence of groups confirmed by eBURST analysis. Deeper analyses performed on 25 strains by CRISPR and whole-genome analysis showed that phylogenies obtained by MLST and whole-genome analysis were in agreement but differed from that inferred by CRISPR analysis. Strains isolated from traditional products could cluster in specific groups indicating their origin, but also be mixed in groups containing industrial starter strains. In the traditional cheese-making sites, we found that S. thermophilus persisted on dairy equipment, but that occasionally added starter strains may become dominant. It underlined the impact of starter use that may reshape S. thermophilus populations including in traditional products. This new MLST scheme thus provides a framework for analyses of S. thermophilus populations and the management of its biodiversity.","authors":["Christine Delorme","Nicolas Legravet","Emmanuel Jamet","Caroline Hoarau"],"meta":["November 2016International Journal of Food Microbiology 242","DOI:10.1016/j.ijfoodmicro.2016.11.016","Project: Population diversity  in the salivarius group of Streptococci"],"references":["332786468_Antibacterial_Activity_of_Some_Lactic_Acid_Bacteria_Isolated_from_an_Algerian_Dairy_Product","304561699_Effects_of_probiotics_on_child_growth_A_systematic_review","303545784_Challenges_in_microbial_ecology_building_predictive_understanding_of_community_function_and_dynamics","299491585_Challenges_in_microbial_ecology_building_predictive_understanding_of_community_function_and_dynamics","284729039_Draft_Genome_Sequence_of_Streptococcus_thermophilus_C106_a_Dairy_Isolate_from_an_Artisanal_Cheese_Produced_in_the_Countryside_of_Ireland","311604710_Genome_sequences_of_Streptococcus_thermophilus_strains_MTH17CL396_and_M17PTZA496_from_fontina_an_Italian_PDO_cheese","310390641_Regulation_of_alpha-_and_beta-hemolysins_by_the_sar_locus_of_Staphylococcus_aureus","308098066_BLAST_Architecture_and_applications","305717746_Polymorphism_of_the_phosphoserine_phosphatase_gene_in_Streptococcus_thermophilus_and_its_potential_use_for_typing_and_monitoring_of_population_diversity","284762163_Interactive_Tree_Of_Live_iTOL_an_online_tool_for_phylogenetic_tree_display_and_annotation"]}