{"id":"310821393_Paradise_unplugged_identifying_barriers_for_female_participation_on_stack_overflow","abstract":"It is no secret that females engage less in programming fields than males. However, in online communities, such as Stack Overflow, this gender gap is even more extreme: only 5.8% of contributors are female. In this paper, we use a mixed-methods approach to identify contribution barriers females face in online communities. Through 22 semi-structured interviews with a spectrum of female users ranging from non-contributors to a top 100 ranked user of all time, we identified 14 barriers preventing them from contributing to Stack Overflow. We then conducted a survey with 1470 female and male developers to confirm which barriers are gender related or general problems for everyone. Females ranked five barriers significantly higher than males. A few of these include doubts in the level of expertise needed to contribute, feeling overwhelmed when competing with a large number of users, and limited awareness of site features. Still, there were other barriers that equally impacted all Stack Overflow users or affected particular groups, such as industry programmers. Finally, we describe several implications that may encourage increased participation in the Stack Overflow community across genders and other demographics.","authors":["Denae Ford","Justin Smith","Philip J. Guo","Chris Parnin"],"meta":["November 2016","DOI:10.1145/2950290.2950331","Conference: the 2016 24th ACM SIGSOFT International Symposium","Project: Increasing Stack Overflow Participation"],"references":["301466183_Homophily_and_the_Glass_Ceiling_Effect_in_Social_Networks","301442867_Intuition_vs_Truth_Evaluation_of_Common_Myths_about_StackOverflow_Posts","329476370_Controlling_the_False_Discovery_Rate_A_Practical_and_Powerful_Approach_to_Multiple_Testing","314913537_Community-Based_Production_of_Open_Source_Software_What_Do_We_Know_about_the_Developers_Who_Participate","313514598_Ways_women_lead","311473376_Unlocking_the_clubhouse_women_in_computing","308853457_One-Day_Flies_on_StackOverflow_-_Why_the_Vast_Majority_of_StackOverflow_Users_Only_Posts_Once","300918117_Mudslinging_and_Manners","300725383_The_Heart_Work_of_Wikipedia","299869125_Bespoke_tools_adapted_to_the_concepts_developers_know"]}