{"id":"310807767_Computational_thinking_Panorama_of_the_Americas","abstract":"Computers cause an impact in almost every single aspect of our lives, however, unfortunately, schools have not been able to keep up with this irreversible evolution. The simple use of technological apparatuses in the classroom does not guarantee the improvement of the learning process, however it can be the medium through which the students find the alternatives for the solution of complex problems. The Computational Thinking is an approach of teaching that uses a diverse range of techniques derived from computers for the resolution of these problems combined with the new competencies of the 21st century (critical thinking, collaboration, etc.). The adoption of the notion of Computing within the basic education schools is a concern in many countries, where the implementation occurs in a strict way. Admittedly, it grows the idea that the Computing discipline is very distinct from the computer classes and that the use of skills from Computing possesses educational (reflection and problem solving, the comprehension that the world is ingrained with the digital technology) and economic (high demand of professionals with good training) benefits. This article, through the vast bibliographic review, describes an international landscape of countries of all Americas, in order to contextualize the reader in respect to the adoption of Computational Thinking within the basic education schools.","authors":["Christian Puhlmann Brackmann","Dante Barone","Ana Casali","Rafael Marimon Boucinha"],"meta":["September 2016","DOI:10.1109/SIIE.2016.7751839","Conference: 2016 International Symposium on Computers in Education (SIIE)","Project: Computational Thinking Unplugged for Kids: Teaching computer science without the protagonist"],"references":["299666357_Proposta_de_Atividades_para_o_Desenvolvimento_do_Pensamento_Computacional_no_Ensino_Fundamental","292398919_Test_de_Pensamiento_Computacional_diseno_y_psicometria_general_Computational_Thinking_Test_design_general_psychometry","274377900_Computational_Thinking","242013419_Despertando_o_interesse_pela_Ciencia_da_Computacao_Praticas_na_Educacao_Basica","235793891_Teaching_Computational_Thinking_in_initial_series_An_analysis_of_the_confluence_among_mathematics_and_Computer_Sciences_in_elementary_education_and_its_implications_for_higher_education","220420371_Computational_thinking","324373353_Mindstorms_Children_Computers_and_Powerful_Ideas","271437444_Computational_Thinking_Possibilities_and_Challenges","228328529_Mindstorms_Children_Computers_and_Powerful_Ideas","29486913_Computer_Science_Unplugged_An_enrichment_and_extension_programme_for_primary-aged_children"]}