{"id":"310800753_Direct_on_Line_Starter_Motor_and_Reverse_System_in_Allen-Bradley_PLC","abstract":"Practically there is no point in leave usage of DOL and R-DOL circuits in stations that include different various types of motors due to its importance to start rotation and reverse direction of specific motors. Nevertheless, curry out of DOL and its reverse on synchronous and induction generally need much more works and efforts and it is not easy to implement in general commercial work stations or remote fields. On contrary, applied of DOL and R-DOL in PLC is proposed way to be applied and identify of its components on this work that regard as peripherals to PLC. Pico PLC will be employing to this purpose. Simplify of programming circuit written codes caused by ladder language and applied by software name's Picosoft version 6 for this project case. Many development countries began using PLC in its industrial field in a jiffy. In this article, there is a providing for simulation, circuit diagram and communication for DOL and R-DOL circuit by PLC and its result on board separately.","authors":["Ali Thaeer Hammid"],"meta":["November 2016","Project: Peripherals, Components, and Applications of Allen-Bradley PLC"],"references":["299865173_Applications_of_Tuning_Control_Actions_for_the_Efficient_Loadfrequency_Control_in_Steam_Turbine","298847618_Design_Remote_Power_Control_IO_Data_Acquisition_System_and_Control_on_Home_Automation","268504941_A_review_on_protective_relays'_developments_and_trends","44259795_Comparison_between_Direct-On-Line_Star-Delta_and_Auto-transformer_Induction_Motor_Starting_Method_in_terms_of_Power_Quality","304408959_Analysis_of_the_starting_transient_of_a_synchronous_reluctance_motor_for_direct-on-line_applications","297889210_A_review_on_the_applications_of_programmable_logic_controllers_PLCs","288039813_Application_of_PLC_as_a_Gateway_in_a_Network_of_Smart_Power_Transducers","282290963_On_PLCs_Control_Program_Hardware_Implementation_Selected_Problems_of_Mapping_and_Scheduling","44039758_Programmable_controllers_theory_and_implementation"]}