{"id":"310821835_An_Approach_to_Rule_Placement_in_Software-Defined_Networks","abstract":"Software-Defined Networks (SDN) is a trend of research in networks. Rule placement, a common operation for network administrators, has become more complicated due to the capacity limitation of devices in which the large number of rules are deployed. Prior works on rule placement mostly consider the influence on rule placement incurred by the rules in a single device. However, the position relationships between neighbor devices have influences on rule placement. Our basic idea is to classify the position relationships into two categories: the serial relationship and the parallel relationship, and we present a novel strategy for rule placement based on the two different position relationships. There are two challenges of implementing our strategies: to check whether a rule is contained by a rule set or not and to check whether a rule can be merged by other rules or not.To overcome the challenges, we propose a novel data structure called OPTree to represent the rules, which is convenient to check whether a rule is covered by other rules. We design the insertion algorithm and search algorithm for OPTree. Extensive experiments show that our approach can effectively reduce the number of rules while ensuring placed rules work. On the other hand, the experimental results also demonstrate that it is necessary to consider the position relationships between neighbor devices when placing rules.","authors":["li Wenjie","Zheng Qin","Hui Yin","Rui Li"],"meta":["November 2016","DOI:10.1145/2988287.2989170","Conference: the 19th ACM International Conference"],"references":["282985893_MoRule_Optimized_rule_placement_for_mobile_users_in_SDN-enabled_access_networks","268810261_An_Adaptable_Rule_Placement_for_Software-Defined_Networks","266660319_Optimizing_Rules_Placement_in_OpenFlow_Networks_Trading_Routing_for_Better_Efficiency","262213884_Optimizing_the_One_big_switch_abstraction_in_software-defined_networks","241277832_VCRIB_Virtualized_rule_management_in_the_cloud","221164223_Scalable_flow-based_networking_with_DIFANE","3335315_ClassBench_A_Packet_Classification_Benchmark","306160450_ClassBench_a_packet_classification_benchmarks","232616403_FIREMAN_A_toolkit_for_firewall_modeling_and_analysis","220428845_Rethinking_Enterprise_Network_Control"]}