{"id":"310829525_Motion_Planning_for_6-D_Manipulation_with_Aerial_Towed-cable_Systems","abstract":"Performing aerial 6-dimensional manipulation using flying robots is a challenging problem, to which only little work has been devoted. This paper proposes a motion planning approach for the reliable 6-dimensional quasi-static manipulation with an aerial towed-cable system. The novelty of this approach lies in the use of a cost-based motion-planning algorithm together with some results deriving from the static analysis of cable-driven manipulators. Based on the so-called wrench-feasibility constraints applied to the cable tensions, as well as thrust constraints applied to the flying robots, we formally characterize the set of feasible configurations of the system. Besides, the expression of these constraints leads to a criterion to evaluate the quality of a configuration. This allows us to define a cost function over the configuration space, which we exploit to compute good-quality paths using the T-RRT algorithm. As part of our approach, we also propose an aerial towed-cable system that we name the FlyCrane. It consists of a platform attached to three flying robots using six fixed-length cables. We validate the proposed approach on two simulated 6-D quasi-static manipulation problems involving such a system, and show the benefit of taking the cost function into account for such motion planning tasks.","authors":["Montserrat Manubens","Didier Devaurs","Lluís Ros","Juan Cortés"],"meta":["June 2013","DOI:10.15607/RSS.2013.IX.028","Conference: Robotics: Science and Systems 2013"],"references":["278707452_Navigating_the_Wrench-Feasible_C-Space_of_Cable-Driven_Hexapods","224142978_Sampling-Based_Path_Planning_on_Configuration-Space_Costmaps","310830377_Cooperative_manipulation_and_transportation_with_aerial_robots","245427138_The_configuration_of_a_cable_towed_in_a_circular_path","243134611_Rapidly-Exploring_Random_Trees_Progress_and_Prospects","241143012_Advantages_of_the_Modified_Euler_Angles_in_the_Design_and_Control_of_PKMs","225116237_Optimal_terrain-following_for_towed-aerial-cable_sensors","225023974_Autonomous_Transportation_and_Deployment_with_Aerial_Robots_for_Search_and_Rescue_Missions","224639459_Mars_Science_Laboratory_entry_descent_and_landing_system","221344572_Cooperative_Manipulation_and_Transportation_with_Aerial_Robots"]}