{"id":"310823803_A_Review_of_Technology_Standards_and_Patent_Portfolios_for_Enabling_Cyber-Physical_Systems_in_Advanced_Manufacturing","abstract":"Cyber-physical systems (CPS) are a collection of transformative technologies for managing interconnected physical and computational capabilities. Recent developments in technology are increasing the availability and affordability of sensors, data acquisition systems, and computer networks. The competitive nature of industry requires manufacturers to implement new methodologies. CPS is a broad area of engineering which supports applications across industries, such as manufacturing, healthcare, electric power grids, agriculture, and transportation. In particular, CPS is the core technology enabling the transition from Industry 3.0 to Industry 4.0 (I 4.0) and is transforming global advanced manufacturing. This paper provides a consolidated review of the latest CPS literature, a complete review of international standards, and a complete analysis of patent portfolios related to the 5C's CPS architecture model by Lee et al. The critical evaluation of international standards and the intellectual property contained in CPS patents is unaddressed by the previous research and will benefit both academic scholars and industry practitioners. The analysis provides a basis for predicting research and development future trends and helps policy makers manage technology changes that will result from CPS in I 4.0. This paper covers the emerging I 4.0 standards from the International Organization for Standardization, the International Electrotechnical Commission, and China's Guobiao standards followed by a patent analysis covering global patents issued in the U.S., Europe, China, and the World Intellectual Property Organization.","authors":["Amy J. C. Trappey","Charles Trappey","Usharani Hareesh Govindarajan","John Sun"],"meta":["January 2016IEEE Access 4:7356-7382","DOI:10.1109/ACCESS.2016.2619360"],"references":["306235252_Role_of_Ontologies_for_CPS_Implementation_in_Manufacturing","304290569_The_fourth_ICT-based_industrial_revolution_Industry_40_-_HMI_and_the_case_of_CAECAD_innovation_with_EPLAN_P8","320603151_Smart_architecture-bots_and_industry_40_principles_for_architecture","319181822_Industrie_40_-_Manufacturing_Work_of_the_Future","313427529_Software-defined_environment_for_reconfigurable_manufacturing_systems","313241980_Cyber-physical_security_of_a_smart_grid_infrastructure","311996823_Cyber-Physical_Systems_and_Human_Action","308871213_Agile_Factory_-_An_Example_of_an_Industry_40_Manufacturing_Process","308734597_Probabilistic_Event_Processing_with_Negation_Operators_in_Cyber_Physical_Systems","304378363_Weaving_machine_as_cyber-physical_production_system_Multi-objective_self-optimization_of_the_weaving_process"]}