{"id":"310817670_A_Process_Genre_Approach_to_Teaching_Report_Writing_to_Arab_EFL_Computer_Science_Students","abstract":"p>In the teaching and learning of EFL writing, the Process Genre Approach (PGA), an integration of the process approach and the genre approach, has recently received much attention worldwide. This approach, however, has not been given enough focus in the Arab EFL context. The purpose of this paper is twofold: to report an implementation of a process genre approach in teaching a report writing course; and to explore views of the Arab EFL students attending that course. The study employs two instruments for data collection: observation, for describing the implementation of the PGA; and a questionnaire specifically designed for eliciting students’ views. Participants are 17 students who attended a report writing course in a computer science department at a university in Yemen. A description of the implementation of the approach is presented in five main areas: preparation of form; preparation of genre; planning, drafting and revising; feedback; and teacher roles and scaffolding. The findings revealed positive views of computer science EFL students on using the process genre approach in teaching report writing. The study concluded with relevant implications and recommendations for Arab EFL writing teaching and research.</p","authors":["Hussein Taha Assaggaf"],"meta":["November 2016International Journal of English Linguistics 6(6):8","DOI:10.5539/ijel.v6n6p8","Project: A process genre approach implementation on EFL Arab writing student"],"references":["323278067_Process-genre_approach_product_approach_and_students'_self-esteem_in_teaching_writing","306250807_L2_WRITING_IN_AN_ESP_CONTEXT_INVESTIGATING_THE_CURRENT_PRACTICES_AND_NEEDS_AT_A_TERTIARY_INSTITUTION_IN_YEMEN","306217790_Investigating_Teaching_and_Learning_Practices_of_Second_Language_ESP_Writing_at_Tertiary_Level_in_Yemen","303184187_The_Effects_of_Portfolio_Use_in_Teaching_Report_Writing_EFL_Students'_Perspective","297663639_Developing_Research_Paper_Writing_Programs_for_EFLESL_Undergraduate_Students_Using_Process_Genre_Approach","344493918_Second_Language_Writing","309309013_Teaching_Korean_University_writing_class_Balancing_the_process_and_the_genre_approach","294698623_Teaching_writing_in_Chinese_universities_Finding_an_eclectic_approach","288525740_Research_design_Qualitative_quantitative_and_mixed_methods_approaches","286008229_Teaching_and_researching_writing_second_edition"]}