{"id":"310830934_Gamification_Elements_for_Learning_Applications","abstract":"Gamification technique is getting popular to be implemented in learning or training application. It is referred to the use of game elements or game thinking in a non-game context in order to increase engagement between students and learning application. Since there are many elements of games that are identified from previous works, this study focuses on game elements from Gamification technique that positively affect learning when applied to a learning application. Therefore, the objectives of this research are to identify game elements that can be gamified in a learning application; and to verify those elements by multiple users (gamers, students, and experts). Suitable game elements are identified through literature reviews. Two approaches are used to verify these elements; interview experts and administer a survey to gamers and students. The finding of this study suggests the use of a group of game elements with three aims, (1) increase the level of fun and entertainment; (2) motivate students to challenge each other; and (3) improve gaming and learning skills. In a further study, these elements will be implemented in a learning application and its effectiveness shall be tested.","authors":["Firas Layth Khaleel","Noraidah Sahari Ashaari","Tengku Siti Meriam Tengku Wook Tengku Wook","Amirah Ismail"],"meta":["December 2016International Journal on Advanced Science Engineering and Information Technology 6, no. 6, 2016.(6)","DOI:10.18517/ijaseit.6.6.1379","Project: Right now I'm going to finalise the effectiveness of gamification on student learning..."],"references":["311859411_Recruitment_and_Job_Search_Application","304639660_The_Architecture_of_Dynamic_Gamification_Elements_Based_Learning_Content","304627725_The_study_of_gamification_application_architecture_for_programming_language_course","304627718_User-enjoyable_learning_environment_based_on_Gamification_elements","317953571_Qualitative_inquiry_research_design_Choosing_among_five_approaches","307956262_Incorporating_customization_and_personalization_into_game-based_learning_A_cognitive_style_perspective","307944648_Effectiveness_of_Game_Jam-based_iterative_program_for_game_production_in_Japan","301508534_Design_Considerations_for_a_Serious_Game_for_Children_after_Hematopoietic_Stem_Cell_Transplantation","299589757_Augmenting_Playspaces_to_Enhance_the_Game_Experience_A_Tag_Game_Case_Study","298795919_Expect_the_Unexpected_Simulation_Games_as_a_Teaching_Strategy"]}