{"id":"310819762_Big_data_preprocessing_methods_and_prospects","abstract":"The massive growth in the scale of data has been observed in recent years being a key factor of the Big Data scenario. Big Data can be defined as high volume, velocity and variety of data that require a new high-performance processing. Addressing big data is a challenging and time-demanding task that requires a large computational infrastructure to ensure successful data processing and analysis. The presence of data preprocessing methods for data mining in big data is reviewed in this paper. The definition, characteristics, and categorization of data preprocessing approaches in big data are introduced. The connection between big data and data preprocessing throughout all families of methods and big data technologies are also examined, including a review of the state-of-the-art. In addition, research challenges are discussed, with focus on developments on different big data framework, such as Hadoop, Spark and Flink and the encouragement in devoting substantial research efforts in some families of data preprocessing methods and applications on new big data learning paradigms.","authors":["Salvador García","Sergio Ramírez-Gallego","Julián Luengo","José Manuel Benítez"],"meta":["November 2016Big Data Analytics 1(1)","DOI:10.1186/s41044-016-0014-0"],"references":["322276906_Adaptive_Control_Processes_A_Guided_Tour","321523475_Data_Mining","319393723_Fast_algorithms_for_mining_association_rules","314755797_Statistical_Analysis_with_Missing_Data","313342502_Discretization_methods","312775005_MapReduce_Simplified_data_processing_on_large_clusters","312455488_Resilient_distributed_datasets_A_fault-tolerant_abstraction_for_in-memory_cluster_computing","308834632_Distributed_Entropy_Minimization_Discretizer_for_Big_Data_Analysis_under_Apache_Spark","308812086_Analysis_of_Data_Preprocessing_Increasing_the_Oversampling_Ratio_for_Extremely_Imbalanced_Big_Data_Classification","305771652_Evolutionary_Undersampling_for_Extremely_Imbalanced_Big_Data_Classification_under_Apache_Spark"]}