{"id":"310953010_On_preparing_ground_states_of_gapped_Hamiltonians_An_efficient_Quantum_Lov'asz_Local_Lemma","abstract":"A frustration-free local Hamiltonian has the property that its ground state minimises the energy of all local terms simultaneously. In general, even deciding whether a Hamiltonian is frustration-free is a hard task, as it is closely related to the QMA1-complete quantum satisfiability problem (QSAT) -- the quantum analogue of SAT, which is the archetypal NP-complete problem in classical computer science. This connection shows that the frustration-free property is not only relevant to physics but also to computer science. The Quantum Lov\\'asz Local Lemma (QLLL) provides a sufficient condition for frustration-freeness. A natural question is whether there is an efficient way to prepare a frustration-free state under the conditions of the QLLL. Previous results showed that the answer is positive if all local terms commute. In this work we improve on the previous constructive results by designing an algorithm that works efficiently for non-commuting terms as well, assuming that the system is \"uniformly\" gapped, by which we mean that the system and all its subsystems have an inverse polynomial energy gap. Also, our analysis works under the most general condition for the QLLL, known as Shearer's bound. Similarly to the previous results, our algorithm has the charming feature that it uses only local measurement operations corresponding to the local Hamiltonian terms.","authors":["András Gilyén","Or Sattath"],"meta":["November 2016"],"references":["282270527_When_must_a_local_Hamiltonian_be_frustration_free","321125301_Computational_complexity_of_graph_polynomials","312238051_Commutativity_in_the_Algorithmic_Lovasz_Local_Lemma","307822524_An_Algorithmic_Proof_of_the_Lovasz_Local_Lemma_via_Resampling_Oracles","297791265_Rapid_Adiabatic_Preparation_of_Injective_Projected_Entangled_Pair_States_and_Gibbs_States","291787199_Fault-tolerant_quantum_computation_by_anyons","286396770_Undecidability_of_the_spectral_gap","284678532_Essai_sur_la_geometrie_a_n_dimensions","275967437_Matrix_Analysis_and_Applied_Linear_Algebra","275967213_Matrix_Analysis_and_Applied_Linear_Algebra_Book_and_Solutions_Manual"]}