{"id":"311067084_Quantum_Machine_Learning","abstract":"Recent progress implies that a crossover between machine learning and quantum information processing benefits both fields. Traditional machine learning has dramatically improved the benchmarking and control of experimental quantum computing systems, including adaptive quantum phase estimation and designing quantum computing gates. On the other hand, quantum mechanics offers tantalizing prospects to enhance machine learning, ranging from reduced computational complexity to improved generalization performance. The most notable examples include quantum enhanced algorithms for principal component analysis, quantum support vector machines, and quantum Boltzmann machines. Progress has been rapid, fostered by demonstrations of midsized quantum optimizers which are predicted to soon outperform their classical counterparts. Further, we are witnessing the emergence of a physical theory pinpointing the fundamental and natural limitations of learning. Here we survey the cutting edge of this merger and list several open problems.","authors":["Jacob Biamonte","Peter Wittek","Nicola Pancotti","Patrick Rebentrost"],"meta":["November 2016Nature 549(7671)","DOI:10.1038/nature23474"],"references":["316908137_Inductive_Supervised_Quantum_Learning","316283438_Quantum_Linear_System_Algorithm_for_Dense_Matrices","312923313_Concrete_Resource_Analysis_of_the_Quantum_Linear_System_Algorithm_used_to_Compute_the_Electromagnetic_Scattering_Cross_Section_of_a_2D_Target","312521292_Basic_protocols_in_quantum_reinforcement_learning_with_superconducting_circuits","312091312_Towards_quantum_supremacy_enhancing_quantum_control_by_bootstrapping_a_quantum_processor","355912410_Hamiltonian_simulation_with_optimal_sample_complexity","344991185_4_Quantum_Computing","321448298_Implementing_a_distance-based_classifier_with_a_quantum_interference_circuit","316017714_Quantum_gate_learning_in_qubit_networks_Toffoli_gate_without_time-dependent_control","312759829_A_Survey_of_Quantum_Learning_Theory"]}