{"id":"311067034_Guarded_Cubical_Type_Theory","abstract":"This paper improves the treatment of equality in guarded dependent type theory (GDTT), by combining it with cubical type theory (CTT). GDTT is an extensional type theory with guarded recursive types, which are useful for building models of program logics, and for programming and reasoning with coinductive types. We wish to implement GDTT with decidable type checking, while still supporting non-trivial equality proofs that reason about the extensions of guarded recursive constructions. CTT is a variation of Martin-L\\\"of type theory in which the identity type is replaced by abstract paths between terms. CTT provides a computational interpretation of functional extensionality, enjoys canonicity for the natural numbers type, and is conjectured to support decidable type-checking. Our new type theory, guarded cubical type theory (GCTT), provides a computational interpretation of extensionality for guarded recursive types. This further expands the foundations of CTT as a basis for formalisation in mathematics and computer science. We present examples to demonstrate the expressivity of our type theory, all of which have been checked using a prototype type-checker implementation. We show that CTT can be given semantics in presheaves on the product of the cube category and a small category with an initial object. We then show that the category of presheaves on the product of the cube category and omega provides semantics for GCTT.","authors":["Lars Birkedal","Aleš Bizjak","Ranald Clouston","Hans Bugge Grathwohl"],"meta":["August 2019Journal of Automated Reasoning 63(3)","DOI:10.1007/s10817-018-9471-7"],"references":["305322316_Canonicity_for_Cubical_Type_Theory","349905301_The_simplicial_model_of_Univalent_Foundations_after_Voevodsky","319394110_An_Intuitionistic_Theory_of_Types_Predicative_Part","316801430_Graduate_Texts_in_Mathematics","313090046_An_intuitionistic_theory_of_types_predicative_part","312721265_A_Formalized_Proof_of_Strong_Normalization_for_Guarded_Recursive_Types","309738720_Cubical_Type_Theory_a_constructive_interpretation_of_the_univalence_axiom","309608814_Axioms_for_Modelling_Cubical_Type_Theory_in_a_Topos","309091785_Guarded_Dependent_Type_Theory_with_Coinductive_Types","304641443_The_Guarded_Lambda-Calculus_Programming_and_Reasoning_with_Guarded_Recursion_for_Coinductive_Types"]}