{"id":"311065573_Using_Mobile_Technologies_in_University_Education","abstract":"We are trying to point out new methods of education by means of mobile technologies and smart devices. The results of questionnaire exploration at the participating universities were analyzed from the point of view of student used mobile technologies, where we compared the mode of using mobile technologies among universities in Hungary and Slovakia. We are thinking about study field of Information science, Natural Science, Arts and Social sciences. We think about types of mobile devices according to type of operation system supplied by the vendor. Based on cluster analysis and principal component analysis (PCA), we evaluate correlations among particular components of using mobile technologies by students in order to improve knowledge in education. We consider the mobile technologies as information channels, which brings knowledge to students. The aim of our research is evaluation of particular data and finding rules between components of using mobile technology by students and mapping the performance. And more, our aim is to give recommendations for appropriate combination of information channels mostly used by students of participated universities, running fields of study and mobile technologies used by students. In our paper we talk about Interactive Voting through Mobile Device as recent and interesting way of using mobile technologies.","authors":["Tibor Szabo","Rastislav Zitný","Pšenáková Ildikó","Zoltán Illés"],"meta":["November 2016","DOI:10.1109/ICETA.2016.7802042","Conference: ICETA 2016 (14th International Conference on Emerging eLearning Technologies and Applications)","Project: E-Lection"],"references":["300698596_Birth_of_Mobile_Academy","42798542_Will_mobile_learning_change_language_learning","304118565_CONCEPT_OF_SUPPORTING_UNIVERSITY_EDUCATION_BY_USING_STUDENTS'_PERSONAL_DEVICES","259143623_Mobile_Computing_Devices_in_Higher_Education_Student_Perspectives_on_Learning_with_Cellphones_Smartphones_Social_Media"]}