{"id":"311066968_Dynamic_Choreographies_Theory_And_Implementation","abstract":"Programming distributed applications free from communication deadlocks and race conditions is complex. Preserving these properties when applications are updated at runtime is even harder. We present a choreographic approach for programming updatable, distributed applications. We define a choreography language, called Dynamic Interaction-Oriented Choreography (AIOC), that allows the programmer to specify, from a global viewpoint, which parts of the application can be updated. At runtime, these parts may be replaced by new AIOC fragments from outside the application. AIOC programs are compiled, generating code for each participant in a process-level language called Dynamic Process-Oriented Choreographies (APOC). We prove that APOC distributed applications generated from AIOC specifications are deadlock free and race free and that these properties hold also after any runtime update. We instantiate the theoretical model above into a programming framework called Adaptable Interaction-Oriented Choreographies in Jolie (AIOCJ) that comprises an integrated development environment, a compiler from an extension of AIOCs to distributed Jolie programs, and a runtime environment to support their execution.","authors":["Mila Dalla Preda","Maurizio Gabbrielli","Saverio Giallorenzo","Ivan Lanese"],"meta":["November 2016Logical Methods in Computer Science 13(2)","DOI:10.23638/LMCS-13(2:1)2017"],"references":["278763302_Towards_Global_and_Local_Types_for_Adaptation","336057902_Realizability_of_Choreographies_Using_Process_Algebra_Encodings","314795082_An_aspect-oriented_approach_to_dynamic_adaptation","312752099_Structured_Communication-Centered_Programming_for_Web_Services","304425747_Global_Escape_in_Multiparty_Sessions","303789186_Multiparty_asynchronous_session_types","301239740_Foundations_of_Session_Types_and_Behavioural_Contracts","290106149_Dynamic_Software_Update_for_Message_Passing_Programs","288931052_On-the-Fly_Adaptation_of_Dynamic_Service-Based_Systems_Incrementality_Reduction_and_Reuse","278801304_Service-Oriented_Programming_with_Jolie"]}