{"id":"311096107_Metacognition_of_attention_during_tactile_discrimination","abstract":"The ability to monitor the success of cognitive processing is referred to as metacognition. Studies of metacognition typically probe post-decision judgments of confidence, showing that we can report on the success of wide range of cognitive processes. Much less is known about our ability to monitor and report on the degree of top-down attention, an ability of paramount importance in tasks requiring sustained attention. However, it has been repeatedly shown that the degree and locus of top-down attention modulates alpha (8-14Hz) power in sensory cortices. In this study we investigated whether self-reported ratings of attention are reflected by sensory alpha power, independent from confidence and task difficulty. Subjects performed a stair-cased tactile discrimination task requiring sustained somatosensory attention. Each discrimination response was followed by a rating of their attention at the moment of stimulation, or their confidence in the discrimination response. MEG was used to estimate trial-by-trial alpha power preceding stimulation. Staircasing of task-difficulty successfully equalized performance between conditions. Both attention and confidence ratings reflected subsequent discrimination performance. Task difficulty specifically influenced confidence ratings. As expected, specifically attention ratings, but not confidence ratings, correlated negatively with contralateral somatosensory alpha power preceding tactile stimuli. Taken together, these results demonstrate that the degree of attention can be subjectively experienced and reported accurately, independent from task difficulty and knowledge about task performance.","authors":["Stephen Whitmarsh","Robert Oostenveld","Rita Almeida","Daniel Lundqvist"],"meta":["November 2016NeuroImage 147","DOI:10.1016/j.neuroimage.2016.11.070","Project: Open-source real-time sonification of EEG for scientific and artistic experimentation and live performances"],"references":["309725867_LmerTest_Tests_in_linear_mixed_effects_models","299131540_Alpha_suppression_and_connectivity_modulations_in_left_temporal_and_parietal_cortices_index_partial_awareness_of_words","282155706_Oops_scratch_that_Monitoring_one's_own_errors_during_mental_calculation","318393770_R_A_Language_and_Environment_for_Statistical_Computing","311101795_The_criteria_of_confidence","311101696_Superconducting_materials_research_status_and_progress_of_application_in_ships","306168442_Implementing_a_class_of_permutation_tests_the_coin_package","285783876_EEG_alpha_oscillations_The_inhibition-timing_hypothesis","283902333_Venous_Thromboembolism_Prophylaxis_in_Obese_Medical_Patients_a_Retrospective_Cohort_Study","282771909_Confidence_as_Bayesian_Probability_From_Neural_Origins_to_Behavior"]}