{"id":"311087619_Secluded_Connectivity_Problems","abstract":"Consider a setting where possibly sensitive information sent over a path in a network is visible to every neighbor of the path, i.e., every neighbor of some node on the path, thus including the nodes on the path itself. The exposure of a path P can be measured as the number of nodes adjacent to it, denoted by N[P]. A path is said to be secluded if its exposure is small. A similar measure can be applied to other connected subgraphs, such as Steiner trees connecting a given set of terminals. Such subgraphs may be relevant due to considerations of privacy, security or revenue maximization. This paper considers problems related to minimum exposure connectivity structures such as paths and Steiner trees. It is shown that on unweighted undirected n-node graphs, the problem of finding the minimum exposure path connecting a given pair of vertices is strongly inapproximable, i.e., hard to approximate within a factor of \\(O(2^{\\log ^{1-\\epsilon }n})\\) for any \\(\\epsilon >0\\) (under an appropriate complexity assumption), but is approximable with ratio \\(\\sqrt{\\Delta }+3\\), where \\(\\Delta \\) is the maximum degree in the graph. One of our main results concerns the class of bounded-degree graphs, which is shown to exhibit the following interesting dichotomy. On the one hand, the minimum exposure path problem is NP-hard on node-weighted or directed bounded-degree graphs (even when the maximum degree is 4). On the other hand, we present a polynomial algorithm (based on a nontrivial dynamic program) for the problem on unweighted undirected bounded-degree graphs. Likewise, the problem is shown to be polynomial also for the class of (weighted or unweighted) bounded-treewidth graphs. Turning to the more general problem of finding a minimum exposure Steiner tree connecting a given set of k terminals, the picture becomes more involved. In undirected unweighted graphs with unbounded degree, we present an approximation algorithm with ratio \\(\\min \\{\\Delta , n/k, \\sqrt{2n},O(\\log k \\cdot (k+\\sqrt{\\Delta }))\\}\\). On unweighted undirected bounded-degree graphs, the problem is still polynomial when the number of terminals is fixed, but if the number of terminals is arbitrary, then the problem becomes NP-hard again.","authors":["Shiri Chechik","Matthew P. Johnson","Merav Parter","David Peleg"],"meta":["November 2016Algorithmica","DOI:10.1007/s00453-016-0222-z"],"references":["267075644_Approximation_and_Hardness_Results_for_Label_Cut_and_Related_Problems","264905604_Secluded_Path_via_Shortest_Path","226834589_Approximation_and_hardness_results_for_label_cut_and_related_problems","284039089_Reducibility_among_combinatorial_problems","277473416_A_Linear-Time_Algorithm_for_Finding_Tree-Decompositions_of_Small_Treewidth","263693771_On_the_Minimum_Label_Spanning_Tree_Problem","262171669_The_Labeled_perfect_matching_in_bipartite_graphs","248321322_Vertex_Cover_Might_be_Hard_to_Approximate_to_within_2","243787873_Compexity_of_Computer_Computations","232005540_New_visibility-based_path-planning_approach_for_covert_robotic_navigation","225342694_Knowledge-Based_Probability_Maps_for_Covert_Pathfinding","221628550_Strong_barrier_coverage_of_wireless_sensor_networks","222821610_Approximation_Algorithms_for_the_Label-Cover_MAX_and_Red-Blue_Set_Cover_Problems","222420405_On_the_hardness_of_approximating_label-cover","222115289_Seymour_PD_Graph_minors_II_Algorithmic_aspects_of_tree-width_J_Algorithms_73_309-322"]}