{"id":"311164131_Sentido_de_coherencia_e_inteligencia_emocional_efecto_en_la_ansiedad_social_de_estudiantes_universitarios","abstract":"SENSE OF COHERENCE AND EMOTIONAL INTELLIGENCE: EFFECT ON SOCIAL ANXIETY OF COLLEGE STUDENTSThe aim of the study was to describe a sample of college students two key variables in health behaviors of individuals, such as the Antonovsky Sense of Coherence (SOC) (1971), and Perceived Emotional Intelligence (IEP) Mayer and Salovey (1990). In the sample of students possible cases of social phobia (FS) that may exist and trends to anxiety and social avoidance are analyzed. With these data, it aims to investigate the possible relationship between the SOC and the Social Phobia, and between it and the IEP. Outcomes among patients with Social Phobia and cases that did not, obtaining significant differences in mean SOC IEP and, these being lower in cases of FS were compared.Keywords: Emotional Intelligence, Sense of Coherence, Social Anxiety.Resumen.El objetivo del estudio ha sido describir en una muestra de estudiantes universitarios dos variables fundamentales en las conductas de salud de las personas, como son, el Sentido de Coherencia de Antonovsky (SOC) (1971), y la Inteligencia Emocional Percibida (IEP) de Mayer y Salovey (1990). En la muestra de estudiantes se analizan los posibles casos de Fobia Social (FS) que puedan existir y las tendencias a la ansiedad y evitación social. Con estos datos, se pretende indagar en la relación que pueda existir entre el SOC y la Fobia Social, y entre ésta y la IEP. Se compararon los resultados entre los casos con Fobia Social y los casos que no la tenían, obteniendo diferencias significativas en las medias de IEP y SOC, siendo éstas inferiores en los casos de FS.Palabras Clave: Inteligencia Emocional, Sentido de Coherencia, Ansiedad Social.","authors":["Ana Isabel Burguillos Peña"],"meta":["November 2016International Journal of Developmental and Educational Psychology Revista INFAD de psicología 4(1):295","DOI:10.17060/ijodaep.2014.n1.v4.615"],"references":[]}