{"id":"311107473_GRID_COMPUTING_RESEARCH_IN_GLOBAL_PUBLICATIONS_A_SCIENTOMETRIC_STUDY","abstract":"The paper presents an analysis of 8950 global publication trends on grid computing using Web of Science database for the period 2006-2015. The highest number of publications 1,043 (16.75%) was published in 2015 and the average number of publications published per year was 895. Annual growth rate is decreased from 88.47 in 2007 to 13.19 in 2015. The relative growth rates (RGR) has decreased from 2007 (0.63) to 2015 (0.12) in the span of 10 years. The doubling time (DT) has gradually increased from 1.10 in 2007 to 5.78 in 2015. Authors from USA have contributed maximum number of publications compared to the other countries and India stood 9 th rank in terms of productivity in this period. The most prolific author is Buyya, R who contributed 50 publications followed by Yang C T with 27publications. Chinese Academy of Science, China is the most productive institution with 179 (2%) publications followed by National Centre for Atmospheric Research, USA with 104 (1.16%) publications and Centre National de la Recherché Scientifique, France with 87 (0.97%) publications. The scientific literature on grid computing is spread over 1778 different source journals.","authors":["R. Santha Kumar"],"meta":["October 2016"],"references":["311107208_ANIMATION_A_SCIENTOMETRIC_ANALYSIS_OF_GLOBAL_PUBLICATIONS_OUTPUT_IN_WEB_OF_SCIENCE_2006-2015","307871977_Publications_Trends_in_Atomic_Physics_A_Global_Perspective","301636893_Research_Trends_in_Medical_Physics_A_Global_Perspective","301636875_Publications_Trends_in_Nuclear_Physics_A_Global_Perspective","289461028_Mapping_of_Mobile_Technology_Publications_A_Scientometric_Approach","282178654_A_scientometric_analysis_of_mobile_technology_publications","281751181_Scientometric_Analysis_of_Global_Publication_Output_in_Mobile_Technology","281506826_Solar_cell_research_in_India_A_scientometric_profile","280048892_World_Cataract_Research_A_Scientometric_Analysis_of_Publications_Output_during_2002-11"]}