{"id":"311225126_50th_Anniversary_Invited_Article-Future_Research_Directions_in_Stochastic_Vehicle_Routing","abstract":"Stochastic vehicle routing, which deals with routing problems in which some of the key problem parameters are not known with certainty, has been an active, but fairly small research area for almost 50 years. However, over the past 15 years we have witnessed a steady increase in the number of papers targeting stochastic versions of the vehicle routing problem (VRP). This increase may be explained by the larger amount of data available to better analyze and understand various stochastic phenomena at hand, coupled with methodological advances that have yielded solution tools capable of handling some of the computational challenges involved in such problems. In this paper, we first briefly sketch the state-of-The-Art in stochastic vehicle routing by examining the main classes of stochastic VRPs (problems with stochastic demands, with stochastic customers, and with stochastic travel or service times), the modeling paradigms that have been used to formulate them, and existing exact and approximate solution methods that have been proposed to tackle them. We then identify and discuss two groups of critical issues and challenges that need to be addressed to advance research in this area. These revolve around the expression of stochastic phenomena and the development of new recourse strategies. Based on this discussion, we conclude the paper by proposing a number of promising research directions.","authors":["Michel Gendreau","Ola Jabali","Walter Rei"],"meta":["November 2016Transportation Science 50(4):1163-1173","DOI:10.1287/trsc.2016.0709"],"references":["257697616_A_multi-space_sampling_heuristic_for_the_vehicle_routing_problem_with_stochastic_demands","251355158_A_generalized_variable_neighborhood_search_heuristic_for_the_capacitated_vehicle_routing_problem_with_stochastic_service_times","276258141_A_hybrid_metaheuristic_for_the_vehicle_routing_problem_with_stochastic_demand_and_duration_constraints","270384074_A_Robust_optimization_approach_for_the_Vehicle_Routing_problem_with_uncertain_travel_cost","242916552_New_optimality_cuts_for_a_single-vehicle_stochastic_routing_problem","230163725_A_note_on_determining_operating_strategies_for_probabilistic_vehicle_routing"]}