{"id":"311235115_Social_media_mediated_interaction_with_peers_experts_and_anonymous_authors_Conversation_partner_and_message_framing_effects_on_risk_perception_and_sense-making_of_organic_food","abstract":"With the increased popularity of organic food production, new information about the risks attached to\nfood products has become available. Consumers need to make sense of this information, interpret the\ninformation in terms of risks and benefits, and consequently choose whether to buy these products or\nnot. In this study, we examined how social media mediated interaction with another person impacts risk\nperception and sense-making regarding eating organic food. Specifically, we investigated how risk perception\nand sense-making are influenced by the specific message frame, the identity of the conversation\npartner, the perceived similarity and expertise of this partner, and the initial attitude of individuals. An\nonline interaction experiment, including a simulated chat in which we manipulated the message frame\n(gains vs losses vs uncertainty) and the conversation partner (expert vs peer vs anonymous) was conducted\nusing a representative sample of Dutch internet users (n = 310). Results showed that chatting with\npartners who were perceived to be expert was associated with lower levels of risk perception, while chatting\nwith partners who were perceived to be similar was associated with higher levels of information\nneed, intention to take notice, and search for and share information. Results also showed that initial attitude\nhad a strong effect. The more positive consumers were about eating organic food, the lower their\nrisk perception and the higher their need for information, intention to take notice of, search for and share\ninformation following the chat. Implications for authorities communicating on food (risks) are discussed.","authors":["Femke Hilverda","Margot Kuttschreuter","Ellen Giebels"],"meta":["September 2016Food Quality and Preference 56:107-118","DOI:10.1016/j.foodqual.2016.09.003","Project: Social media influences on the risk perception and attitude towards organic products."],"references":["281341039_On_the_Persuasiveness_of_Similar_Others_The_Role_of_Mentalizing_and_the_Feeling_of_Certainty","272424350_Travellers'_acceptance_of_consumer-generated_media_An_integrated_model_of_technology_acceptance_and_source_credibility_theories","311469777_Beyond_pleasure_and_pain","287848484_Using_Online_Panels_in_Psychological_Research","286874512_Applying_and_resisting_peer_influence","272933711_Sensemaking_in_Organizations","272479438_Consumers'_avoidance_of_information_on_red_meat_risks_information_exposure_effects_on_attitudes_and_perceived_knowledge","265252993_Consumers'_perceptions_of_organic_food_attributes_and_cognitive_and_affective_attitudes_as_determinants_of_their_purchase_intentions_toward_organic_food","265213658_Social_modeling_of_eating_A_review_of_when_and_why_social_influence_affects_food_intake_and_choice","264086885_Beyond_information_seeking_Consumers'_online_deliberation_about_the_risks_and_benefits_of_red_meat"]}