{"id":"311211925_Smart_Data_Pricing_The_Value_of_Shared_Data_Plans","abstract":"This paper studies a monopoly telecom operator's decision on the adoption of shared data plans. A shared data plan allows sharing data quota among multiple devices or users, while conventional single device data plans only allow the use of a single device. We develop analytical models and compare a simple shared data plan (i.e., bundling pricing) to single device data plans (i.e., partitioned pricing). We aim to identify key factors that drive the optimal pricing policies under the two pricing plans and the value of data shared plans. We first consider a base model with independent consumer valuations (usages) of different devices. We find a threshold on the unit usage cost below which the shared data plan yields more profits than single device data plans. The optimal price for the shared data plan is less than the sum of the single device data plans. The disparity of the devices' mean usages reduces the relative value of the shared data plan against the single device data plans. We also show that shared data plans increases the social welfare and consumer surplus when it yields a higher profit.We then examine the effects of complementarity and substitution between consumer valuations of the devices on the value of data shared plans. Two commonly used approaches to modeling the complementarity and substitution in the literature are considered: utility scaling and correlation. We examine how the utility scaling factor and correlation affect the value of shared data plans, respectively. We find that a higher degree of complementarity (or a lower degree of substitution) may not necessarily increase the value of shared data plan, which is counter to our common intuition that shared data plans are more attractive for complementary products. We provide the rationale and managerial insights. We also examine the value of bundling under a quadratic usage cost function.","authors":["Yue Jin","Zhan Pang"],"meta":["December 2016Service Science 8(4):386-405","DOI:10.1287/serv.2016.0133"],"references":[]}