{"id":"311299445_The_Hat_Game_and_covering_codes","abstract":"The Hat Game (Ebert's Hat Problem) got much attention in the beginning of this century; not in the last place by it's connections to coding theory and computer science. There were publications in The New York Times, Die Zeit and abcNews. Exact solutions with two colors are only known in the symmetric case (equal probabilities for the two players) when N=2^k-1 (using Hamming codes), N=2^k (extended Hamming codes) and up to N=9 (using bounds on covering codes of radius 1), where N is the number of players. How the probabilities and strategies behave when the two colors are not equally likely (asymmetric case), is an open problem. Where the symmetric case is hard, both mathematically and from the point of view of computational complexity, we may expect the asymmetric case to be harder and perhaps beyond the capabilities of contemporary mathematics and computer science. However there is a surprising answer to the open problem: elementary mathematics in combination with adequate computer programs suffices to do the job and the new approach gives also new insights in the classical symmetric case. Where the standard theory in the symmetric case works with Hamming codes and covering sets of radius 1, the new approach deals with adequate sets of radius N-1. Our main results in this paper are: a simple and effective way to analyze N-person two color hat problems, and: a dramatically decrease of computational complexity.","authors":["Theo van Uem"],"meta":["December 2016"],"references":["267082536_On_the_hat_problem_its_variations_and_their_applications","266962513_A_more_colorful_hat_problem","225170929_A_Puzzle_to_Challenge_Genetic_Programming","292062184_Hat_tricks","265775421_The_mathematics_of_coordinated_inference_A_study_of_generalized_hat_problems","244447261_Why_mathematicians_now_care_about_their_hat_color","243774041_The_Second_Scientific_American_Book_of_Mathematical_Puzzles_and_Diversions","239577049_The_Scientific_American_Book_of_Mathematical_Puzzles_and_Diversions","224723614_On_hats_and_other_covers","35514243_Applications_of_recursive_operators_to_randomness_and_complexity","2588188_On_the_Autoreducibility_of_Random_Sequences"]}