{"id":"311374442_Design_and_Simulation_of_a_Smart_Home_managed_by_an_Intelligent_Self-Adaptive_System","abstract":"Home automation and control systems as basic elements of smart cities have played a key role in the development of our homes environments. They have a wide range of applications in many fields at home such as security and monitoring, healthcare, energy, and entertainment applications. The improvement of humans' living standards make people keep trying to delegate many of their needs to a home automation system. Such a system has been built with capabilities of predicting what the user intends to do in smart home environment. However, there are many issues that need more investigation and solutions, such as: 1) many researches adopt a specific application without integrating different varieties of applications in one environment, 2) there is no study tries to show the real effect or even evaluates the implementation of predicted actions that have been established via homes intelligent gateway, 3) there is an interoperability issue due to using different kinds of home applications that have different protocols for message context. In this proposal, we will describe a new approach of an intelligent self-adaptive system that can precisely monitor a stakeholder behaviors and analyze his/her actions trying to anticipate a stakeholder behavior in the future. In addition, we will evaluate the real effect of a predicted actions after implementing them by an intelligent gateway in a simulated home environment. The principle behind a prediction process is presented by analyzing a sequence of user's interaction events with heterogeneous, and distributed nodes in the environment using an intelligent gateway. Predicting next stakeholder action can be process using certain analytical algorithms. The main novelties in the proposed approach are threefold: I) Developing a learning technique which is embedded in an intelligent gateway to build a model of users' behavior and interactions to balance the needs of multiple users within a smart home environment. II) Presents a novel visualization model for a home area network (HAN) based on a degree of centrality criteria, that helps an enterprise companies like Amazon, Google, Microsoft, and Xively to understand the most important services of their customers, III) The proposed system shows a high level concept of how we can design an intelligent self-adaptive system in home environment that has the capability to provide stakeholder with local services, and to support a use of IoT paradigm concurrently.","authors":["Basman M. Hasan Alhafidh","William Allen"],"meta":["August 2016","Project: Project BUTLER"],"references":["281981929_Smart_Home_Communication_Technologies_and_Applications_Wireless_Protocol_Assessment_for_Home_Area_Network_Resources","257392405_State_of_the_art_of_smart_homes","319562471_Advances_in_Wireless_Sensor_Networks_The_8th_China_Conference_CWSN_2014_Xi'an_China_October_31--November_2_2014_Revised_Selected_Papers","289110741_Hardware_simulation_of_pattern_matching_and_reinforcement_learning_to_predict_the_user_next_action_of_smart_home_device_usage","270793539_Smart_Homes_Design_Implementation_and_Issues","267454881_The_Internet_of_Things_vision_Key_features_applications_and_open_issues","261317481_An_IoT-based_appliance_control_system_for_smart_homes","239765253_The_new_intelligent_home_control_system_based_on_the_dynamic_and_intelligent_gateway","220938557_A_Status_Monitoring_System_DesignImplementation_for_Home_Appliances_Controlled_by_Home_Server","200040509_Operating_System_Concepts"]}