{"id":"311360322_An_empirical_study_of_on-line_models_for_relational_data_streams","abstract":"To date, Inductive Logic Programming (ILP) systems have largely assumed that all data needed for learning have been provided at the onset of model construction. Increasingly, for application areas like telecommunications, astronomy, text processing, financial markets and biology, machine-generated data are being generated continuously and on a vast scale. We see at least four kinds of problems that this presents for ILP: (1) it may not be possible to store all of the data, even in secondary memory; (2) even if it were possible to store the data, it may be impractical to construct an acceptable model using partitioning techniques that repeatedly perform expensive coverage or subsumption-tests on the data; (3) models constructed at some point may become less effective, or even invalid, as more data become available (exemplified by the “drift” problem when identifying concepts); and (4) the representation of the data instances may need to change as more data become available (a kind of “language drift” problem). In this paper, we investigate the adoption of a stream-based on-line learning approach to relational data. Specifically, we examine the representation of relational data in both an infinite-attribute setting, and in the usual fixed-attribute setting, and develop implementations that use ILP engines in combination with on-line model-constructors. The behaviour of each program is investigated using a set of controlled experiments, and performance in practical settings is demonstrated by constructing complete theories for some of the largest biochemical datasets examined by ILP systems to date, including one with a million examples; to the best of our knowledge, the first time this has been empirically demonstrated with ILP on a real-world data set.","authors":["Ashwin Srinivasan","Michael Bain"],"meta":["February 2017Machine Learning 106(2)","DOI:10.1007/s10994-016-5596-2"],"references":["250302474_Dynamic_Feature_Space_and_Incremental_Feature_Selection_for_the_Classiflcation_of_Textual_Data_Streams","246666403_Learning_Concepts_by_Performing_Experiments","344619178_Smart_Machines_IBM's_Watson_and_the_Era_of_Cognitive_Computing","324394074_A_Handbook_of_Small_Data_Sets","267147759_Knowledge_Discovery_from_Data_Streams_Data_Mining_and_Knowledge_Discovery","265807665_Topic_Models_with_Relational_Features_for_Drug_Design","265776025_What_Kinds_of_Relational_Features_Are_Useful_for_Statistical_Learning","256121772_Theories_for_Mutagenicity_A_Study_in_First-Order_and_Feature-Based_Induction","246696291_Linear_discriminant_and_support_vector_classifiers","244474892_Online_Learning_and_Stochastic_Approximations","238582946_Machine_learning_an_Artificial_Intelligence_approach_Volume_2","229124762_Data_Streams_Models_and_Algorithms","242424350_Propositionalization_Approaches_to_Relational_Data_Mining","234794791_Correspondence_between_ALGOL_60_and_Church's_Lambda-notation_Part_I","228977084_Dynamic_feature_generation_for_relational_learning"]}