{"id":"311360155_Sleeping_Beauties_and_their_princes_in_innovation_studies","abstract":"A Sleeping Beauty (SB) is a publication that goes unnoticed for a long time, and then, almost suddenly, is awakened by a ‘prince’ (PR), attracting from there on a lot of attention in terms of citations. Although there are some studies on the SB and the PR phenomena in the sciences, barely any research on this topic has been conducted in the social sciences, let alone in innovation studies. Based on 52,373 articles extracted from the Web of Science and using a new method that, comparatively with extant methods, selects SBs with the highest scientific impact, we found that, similarly to the sciences, SBs are rare in the field of innovation (<0.02%). In contrast with the sciences, the depth of sleep is relatively small, ranging from 7 to 17 years. All the 8 SBs found, and the (37) corresponding princes, were published in highly renowned journals (e.g., Harvard Business Review, Journal of Management Studies, Organization Studies, Rand Journal of Economics, Research Policy). The explanations for the delayed recognition are associated with innovative methods, scientific resistance, and theoretical-relatedness. The role of highly influential authors and self-awakening mechanisms were critical triggers for bringing SBs into scientific notoriety.","authors":["Aurora Amélia Castro Teixeira","Pedro Cosme Costa Vieira","Ana Patrícia Abreu"],"meta":["December 2016Scientometrics 110(2)","DOI:10.1007/s11192-016-2186-9"],"references":["294576921_A_vector_for_measuring_obsolescence_of_scientific_articles","292947642_A_Bibliometric_Framework_for_Identifying_Princes_Who_Wake_up_the_Sleeping_Beauty_in_Challenge-Type_Scientific_Discoveries","291387528_Defining_service_innovation_A_review_and_synthesis","343787046_Value_co-production_intellectual_origins_and_implications_for_practice_and_research","313673056_An_integrated_dynamic_performance_measurement_system_for_improving_manufacturing_competitiveness","298724041_Assessing_evaluation_procedures_for_individual_researchers_The_case_of_the_Italian_National_Scientific_Qualification","298043780_The_Balanced_Scorecard_measures_that_drive_performance","292386344_Automated_Research_Impact_Assessment_A_New_Bibliometrics_Approach","286159793_Identifying_princes_of_Sleeping_Beauty_-_Knowledge_mapping_in_discovering_princes","284884007_Premature_discovery_or_delayed_recognition_-_Why"]}