{"id":"311334114_Introducing_computational_thinking_through_hands-on_projects_using_R_with_applications_to_calculus_probability_and_data_analysis","abstract":"The goal of this paper is to promote computational thinking among mathematics, engineering, science and technology students, through hands-on computer experiments. These activities have the potential to empower students to learn, create and invent with technology, and they engage computational thinking through simulations, visualizations and data analysis. We present nine computer experiments and suggest a few more, with applications to calculus, probability and data analysis, which engage computational thinking through simulations, visualizations and data analysis. We are using the free (open-source) statistical programming language R. Our goal is to give a taste of what R offers rather than to present a comprehensive tutorial on the R language. In our experience, these kinds of interactive computer activities can be easily integrated into a smart classroom. Furthermore, these activities do tend to keep students motivated and actively engaged in the process of learning, problem solving and developing a better intuition for understanding complex mathematical concepts.","authors":["Nadia Benakli","Boyan S Kostadinov","Ashwin Satyanarayana","Satyanand Singh"],"meta":["December 2016International Journal of Mathematical Education 48(3):1-35","DOI:10.1080/0020739X.2016.1254296"],"references":["306070907_Limiting_Forms_of_Iterated_Circular_Convolutions_of_Planar_Polygons","345654935_Using_R_for_Numerical_Analysis_in_Science_and_Engineering","344493672_Irresistible_Integrals_Symbolics_Analysis_and_Experiments_in_the_Evaluation_of_Integrals","288198031_Markov_Chain_Monte_Carlo_Methods","281131977_Stochastic_diffusion_processes_on_Cartesian_meshes","273295137_Effectively_using_multiple_technologies","268164005_Inside_interesting_integrals_with_and_introduction_to_contour_integration_A_collection_of_sneaky_tricks_sly_substitutions_and_numerous_other_stupendously_clever_awesomely_wicked_and_devilishly_seducti","263577808_Simulation_Insights_Using_R"]}