{"id":"311342434_Neurexin_regulates_nighttime_sleep_by_modulating_synaptic_transmission","abstract":"Neurexins are cell adhesion molecules involved in synaptic formation and synaptic transmission. Mutations in neurexin genes are linked to autism spectrum disorders (ASDs), which are frequently associated with sleep problems. However, the role of neurexin-mediated synaptic transmission in sleep regulation is unclear. Here, we show that lack of the Drosophila α-neurexin homolog significantly reduces the quantity and quality of nighttime sleep and impairs sleep homeostasis. We report that neurexin expression in Drosophila mushroom body (MB) αβ neurons is essential for nighttime sleep. We demonstrate that reduced nighttime sleep in neurexin mutants is due to impaired αβ neuronal output, and show that neurexin functionally couples calcium channels (Cac) to regulate synaptic transmission. Finally, we determine that αβ surface (αβs) neurons release both acetylcholine and short neuropeptide F (sNPF), whereas αβ core (αβc) neurons release sNPF to promote nighttime sleep. Our findings reveal that neurexin regulates nighttime sleep by mediating the synaptic transmission of αβ neurons. This study elucidates the role of synaptic transmission in sleep regulation, and might offer insights into the mechanism of sleep disturbances in patients with autism disorders.","authors":["Huawei Tong","Qian Li","Zi Chao Zhang","Yi Li"],"meta":["December 2016Scientific Reports 6(1):38246","DOI:10.1038/srep38246"],"references":["318967824_Mushroom_body_output_neurons_encode_valence_and_guide_memory-based_action_selection_in_Drosophila","286539591_Ca-a1T_a_fly_T-type_Ca2_channel_negatively_modulates_sleep","280391666_Neurexin-1_regulates_sleep_and_synaptic_plasticity_in_Drosophila_melanogaster","276065361_The_Neurexin-NSF_interaction_regulates_short-term_synaptic_depression","260373545_Neuronal_Machinery_of_Sleep_Homeostasis_in_Drosophila","316326475_Sleep_Behaviors_and_Sleep_Quality_in_Children_with_Autism_Spectrum_Disorders","314514440_In_Vivo_Calcium_Imaging_of_Brain_Activity_in_Drosophila_by_Transgenic_Cameleon_Expression","305791335_Mushroom_body_output_neurons_encode_the_valence_and_guide_memory-based_action_selection_in_Drosophila","303994226_Sleep_behaviors_and_sleep_quality_in_children_with_Autism_Spectrum_Disorders","282816221_Propagation_of_Homeostatic_Sleep_Signals_by_Segregated_Synaptic_Microcircuits_of_the_Drosophila_Mushroom_Body"]}