{"id":"311458019_Comparison_of_Tire_Footprint_Measurement_Techniques","abstract":"With all wheeled vehicles, the tire contact patch is the only connection between the vehicle and the road. All the forces, except for aerodynamic forces, that are acting on the vehicle are generated in the tire contact patch. The size, shape and the pressure distribution of the contact patch are important to the performance, ride qualities and handling characteristics of a vehicle. Tire footprint studies are essential in understanding tire force generation and tire wear mechanisms. It is thus important to accurately determine the tire contact patch size and dimensions. This paper discusses various methods for measuring the static tire contact patch dimensions. A set of tests are conducted on various tires and at different inflation pressures. These tests are used to discuss the suitability of the methods depending on the type, size, load and contact surface of the tire. A list of advantages and disadvantages for each method is generated and discussed. The aim of this paper is not to study the tire footprints but to discuss the various testing methods. Insight into the different methods can help to select the suitable method for future tire contact studies.\nCopyright © 2016 by ASME Country-Specific Mortality and Growth Failure in Infancy and Yound Children and Association With Material Stature\nUse interactive graphics and maps to view and sort country-specific infant and early dhildhood mortality and growth failure data and their association with maternal","authors":["Schalk Els","M. J. Stallmann","Theunis Botha","A. G. Guthrie"],"meta":["August 2016","DOI:10.1115/DETC2016-59944","Conference: ASME 2016 International Design Engineering Technical Conferences and Computers and Information in Engineering Conference"],"references":["283152816_STATE-OF-THE-ART_AND_FUTURE_DEVELOPMENTS_IN_INTEGRATED_CHASSIS_CONTROL_FOR_GROUND_VEHICLES","227293508_Applications_of_digital-image-correlation_techniques_to_experimental_mechanics","44849060_Analysis_of_Tire_Contact_Parameters_Using_Visual_Processing","346062683_Lucas-Kanade_20_Years_On_A_Unifying_Framework","321550311_The_Physics_of_Tire_Traction_Theory_and_Experiment","288440074_Effects_of_traffic_with_a_tractor_and_a_wheel_loader_on_two_ploughed_moist_soils","279148977_National_Highway_Traffic_Safety_Administration_NHTSA","275057952_SURF_Speeded_up_robust_features","272832957_Dynamic_Tire_Pressure_Control_System_-_Analysis_of_the_effect_to_longitudinal_vehicle_dynamics_and_fuel_consumption","263508015_Parameterization_and_modelling_of_large_off-road_tyres_for_ride_analyses_Part_2_-_Parameterization_and_validation_of_tyre_models","27350614_A_Semi-Empirical_Three-Dimensional_Model_of_the_Pneumatic_Tyre_Rolling_over_Arbitrarily_Uneven_Road_Surfaces","3581588_An_optimization_toolbox_for_MATLAB"]}