{"id":"311489150_Retention_of_Flow_Evaluating_a_Computer_Science_Education_Week_Activity","abstract":"High profile computer science education events such as the Hour of Code can reach millions of students but without proper evaluation it is not clear what motivational and educational consequences the participation has. If, for instance, participants' levels of motivation towards the end of an hour long activity are significantly fading, then their perception of programming to be \"hard and boring\" may actually get reinforced. By simply measuring how far participants progressed with their projects we have been able to collect retention data from thousands of participants in a way that allows us to interpret these data in terms of not only cognitive but also technical and practical activity challenges. Inflection points overlaying a negative exponential retention distribution serve as indicators of these challenges with potential impact on Flow. Retention of Flow is an evaluation approach to analyze computer science education activities, including interactive tutorials and online programming environments, with respect to cognitive as well as affective challenges.","authors":["Alexander Repenning","Ashok Basawapatna","Dorit Assaf","Carmine Maiello"],"meta":["February 2016","DOI:10.1145/2839509.2844597","Conference: the 47th ACM Technical Symposium"],"references":["304825202_Piloting_Computer_Science_Education_Week_in_Mexico","280841929_Closing_The_Cyberlearning_Loop_Enabling_Teachers_To_Formatively_Assess_Student_Programming_Projects","301429317_Should_your_8-year-old_learn_coding","289637867_Launching_Swiss_Computer_Science_Education_Week","284886595_The_girl_game_company_Engaging_latina_girls_in_information_technology","282739167_Autonomously_Generating_Hints_by_Inferring_Problem_Solving_Policies","279710078_Women_in_science_Why_so_few","276456039_Scalable_Game_Design","273351430_Hour_of_code_-_A_record_year_for_computer_science","262399549_Computational_thinking_in_educational_activities_An_evaluation_of_the_educational_game_Light-Bot"]}