{"id":"311482691_The_debates_of_the_European_Parliament_as_Linked_Open_Data","abstract":"The European Parliament represents the citizens of the member states of the European Union (EU). The accounts of its meetings and related documents are open data, promoting transparency and accountability, and are used as source data by researchers. However, the official portal of these documents provides limited search facilities. This paper presents LinkedEP, a Linked Open Data translation of the verbatim reports of the plenary meetings of the European Parliament. These data are integrated with a database of political affiliations of the Members of Parliament, and enriched with detected topics from the EU's topic hierarchy and links to four other Linked Open Datasets. The results of this work are available through a SPARQL endpoint and a user interface with extensive browse and search facilities. It is now possible to combine in one query the time and topic of the debate, the spoken words - in any available translation - and information about the speaker uttering these, such as affiliations to countries, parties and committees. This paper discusses the design and creation of the vocabulary, data and links, as well as known use of the data.","authors":["Astrid van Aggelen","Laura Hollink","Max Kemman","Martijn Kleppe"],"meta":["December 2016Semantic Web 8(2):271-281","DOI:10.3233/SW-160227"],"references":["304915598_JRC-Names_Multilingual_entity_name_variants_and_titles_as_Linked_Data","284200058_Quality_assessment_for_Linked_Data_A_Survey","280520892_Impact_Analysis_of_OCR_Quality_on_Research_Tasks_in_Digital_Archives","280113400_Five_Stars_of_Linked_Data_Vocabulary_Use","262370471_Langidpy_An_off-the-shelf_language_identification_tool","256846257_JRC_EuroVoc_Indexer_JEX_-_A_freely_available_multi-label_categorisation_tool","237544415_Forum_SectionAn_Automated_Database_of_the_European_Parliament","1959900_The_JRC-Acquis_A_multilingual_aligned_parallel_corpus_with_20_languages","231889439_Position_Taking_in_European_Parliament_Speeches","229307103_Design_and_use_of_the_Simple_Event_Model_SEM","228978416_Exemelification_of_parliamentary_debates","228379274_EuroParl_A_parallel_corpus_for_statistical_machine_translation"]}