{"id":"311444133_EmuStack_An_OpenStack-Based_DTN_Network_Emulation_Platform_Extended_Version","abstract":"With the advancement of computing and network virtualization technology, the networking research community shows great interest in network emulation. Compared with network simulation, network emulation can provide more relevant and comprehensive details. In this paper, EmuStack, a large-scale real-time emulation platform for Delay Tolerant Network (DTN), is proposed. EmuStack aims at empowering network emulation to become as simple as network simulation. Based on OpenStack, distributed synchronous emulation modules are developed to enable EmuStack to implement synchronous and dynamic, precise, and real-time network emulation. Meanwhile, the lightweight approach of using Docker container technology and network namespaces allows EmuStack to support a (up to hundreds of nodes) large-scale topology with only several physical nodes. In addition, EmuStack integrates the Linux Traffic Control (TC) tools with OpenStack for managing and emulating the virtual link characteristics which include variable bandwidth, delay, loss, jitter, reordering, and duplication. Finally, experiences with our initial implementation suggest the ability to run and debug experimental network protocol in real time. EmuStack environment would bring qualitative change in network research works.","authors":["Haifeng Li","Zhou Huachun","Hongke Zhang","Bohao Feng"],"meta":["January 2016Mobile Information Systems 2016(3):1-15","DOI:10.1155/2016/6540207"],"references":["277908836_Design_Challenges_in_Contact_Plans_for_Disruption-Tolerant_Satellite_Networks","261266481_Performance_Evaluation_of_Container-Based_Virtualization_for_High_Performance_Computing_Environments","261072745_Network_emulation_testbed_for_DTN_applications_and_protocols","308038946_EmuStack_An_OpenStack-Based_DTN_Network_Emulation_Platform","288889096_Promoting_efficient_communications_for_high-speed_railway_using_smart_collaborative_networking","286561844_Social_cooperation_for_information-centric_multimedia_streaming_in_highway_VANETs","266378987_SPICE_Testbed_A_DTN_Testbed_for_Satellite_and_Space_Communications","264981529_A_survey_on_congestion_control_for_delay_and_disruption_tolerant_networks","262808241_An_Optimization-Based_Scheme_for_Efficient_Virtual_Machine_Placement","261432014_Application_of_Contact_Graph_Routing_to_LEO_satellite_DTN_communications"]}