{"id":"311483056_Reasoning_Biases_Non-Monotonic_Logics_and_Belief_Revision","abstract":"A range of formal models of human reasoning have been proposed in a number of fields such as philosophy, logic, artificial intelligence, computer science, psychology, cognitive science, etc.: various logics (epistemic logics; non-monotonic logics), probabilistic systems (most notably, but not exclusively, Bayesian probability theory), belief revision systems, neural networks, among others. Now, it seems reasonable to require that formal models of human reasoning be (minimally) empirically adequate if they are to be viewed as models of the phenomena in question. How are formal models of human reasoning typically put to empirical test? One way to do so is to isolate a number of key principles of the system, and design experiments to gauge the extent to which participants do or do not follow them in reasoning tasks. Another way is to take relevant existing results and check whether a particular formal model predicts these results. The present investigation provides an illustration of the second kind of empirical testing by comparing two formal models for reasoning – namely the non-monotonic logic known as preferential logic; and a particular version of belief revision theories, screened belief revision – against the reasoning phenomenon known as belief bias in the psychology of reasoning literature: human reasoners typically seek to maintain the beliefs they already hold, and conversely to reject contradicting incoming information. The conclusion of our analysis will be that screened belief revision is more empirically adequate with respect to belief bias than preferential logic and non-monotonic logics in general, as what participants seem to be doing is above all a form of belief management on the basis of background knowledge. The upshot is thus that, while it may offer valuable insights into the nature of human reasoning, preferential logic (and non-monotonic logics in general) is ultimately inadequate as a formal model of the phenomena in question.","authors":["Catarina Dutilh Novaes","Herman Veluwenkamp"],"meta":["December 2016Theoria 83(1)","DOI:10.1111/theo.12108"],"references":["286784975_The_logical_response_to_a_noisy_world","280685490_Confirmation_Bias_A_Ubiquitous_Phenomenon_in_Many_Guises","274557949_Irreflexivity_and_Aristotle's_Syllogismos","329651243_Human_Reasoning_and_Cognitive_Science","286270780_Judgment_Under_Uncertainty_Heuristics_and_Biases","285827880_Thinking_Fast_and_Slow","277213701_Defeasible_Reasoning","275452855_A_Dialogical_Account_of_Deductive_Reasoning_as_a_Case_Study_for_how_Culture_Shapes_Cognition","262935718_Screened_revision","254428847_The_Fundamental_Computational_Biases_of_Human_Cognition_Heuristics_That_Sometimes_Impair_Decision_Making_and_Problem_Solving"]}