{"id":"311489225_Identification_of_Web_Spam_through_Clustering_of_Website_Structures","abstract":"Spam websites are domains whose owners are not interested in using them as gates for their activities but they are parked to be sold in the secondary market of web domains. To transform the costs of the annual registration fees in an opportunity of revenues, spam websites most often host a large amount of ads in the hope that someone who lands on the site by chance clicks on some ads. Since parking has become a widespread activity, a large number of specialized companies have come out and made parking a straightforward task that simply requires to set the domain's name servers appropriately.\nAlthough parking is a legal activity, spam websites have a deep negative impact on the information quality of the web and can significantly deteriorate the performances of most web mining tools. For example these websites can influence search engines results or introduce an extra burden for crawling systems. In addition, spam websites represent a cost for ad bidders that are obliged to pay for impressions or clicks that have a negligible probability to produce revenues.\nIn this paper, we experimentally show that spam websites hosted by the same service provider tend to have similar look-and-feel. Exploiting this structural similarity we face the problem of the automatic identification of spam websites. In addition, we use the outcome of the classification for compiling the list of the name servers used by spam websites so that they can be discarded before the first connection just after the first DNS query. A dump of our dataset (including web pages and meta information) and the corresponding manual classification is freely available upon request.","authors":["Filippo Geraci"],"meta":["May 2015","DOI:10.1145/2740908.2742127","Conference: the 24th International Conference"],"references":["262411801_How_much_money_do_spammers_make_from_your_website","227716402_Clustering_to_Maximize_the_Ratio_of_Split_to_Diameter","220999592_A_scalable_algorithm_for_high-quality_clustering_of_Web_snippets","220593837_Tracking_Web_spam_with_HTML_style_similarities","220271841_Characterizing_Web_Spam_Using_Content_and_HTTP_Session_Analysis","220039148_The_BIZ_Top-Level_Domain_Ten_Years_Later","200110736_Know_your_Neighbors_Web_Spam_Detection_using_the_Web_Topology","200110713_A_reference_collection_for_web_spam","292692829_Wunsch_A_general_method_applicable_to_the_search_for_similarities_in_the_amino_acid_sequence_of_two_proteins","266653347_Effects_of_Spam_Removal_on_Search_Engine_Efficiency_and_Effectiveness_ABSTRACT","262277148_Russian_web_spam_evolution_Yandex_experience","222648582_Learning_to_construct_knowledge_bases_from_the_World_Wide_Web","222473678_Clustering_to_minimize_the_maximum_intercluster_distance","220593798_4_Ads-Portal_Domains_Identification_and_Measurements","17749606_A_General_Method_Applicable_to_Search_for_Similarities_in_Amino_Acid_Sequence_of_2_Proteins","4772044_Estimating_the_Number_of_Clusters_in_a_Data_Set_Via_the_Gap_Statistic"]}