{"id":"311408260_On_the_sensitivity_of_distributed_acoustic_sensing","abstract":"In distributed acoustic sensing (DAS) an optical fiber is transformed into an array of thousands of “virtual microphones.” Most current DAS methodologies are based on coherent interference of Rayleigh backscattered light and thus are prone to signal fading. Hence, the sensitivities of the “microphones” fluctuate randomly along the fiber. Therefore, specifying the sensitivity of DAS without considering its random nature is incomplete and of limited value. In this Letter, the statistical properties of DAS SNR and DAS sensitivity are studied in detail for the first time, to the best of our knowledge. It is shown that the mean dynamic DAS SNR is proportional to the SNR obtained in a single measurement of the fiber’s “static” backscatter profile and, in turn, to the energy of the interrogation pulse. Finally, the minimum input signal, which produces a specified mean DAS SNR, is proposed as a new figure of merit for the characterization of system performances and for comparison between the sensitivities of different DAS modalities.","authors":["Haniel Gabai","Avishay Eyal"],"meta":["December 2016Optics Letters 41(24):5648","DOI:10.1364/OL.41.005648"],"references":["281240913_Fundamentals_of_Optical_Fiber_Sensing_Schemes_Based_on_Coherent_Optical_Time_Domain_Reflectometry_Signal_Model_Under_Static_Fiber_Conditions","261068662_OFDR_with_double_interrogation_for_dynamic_quasi-distributed_sensing","3243277_Optimization_of_SNR_improvement_in_the_noncoherent_OTDR_based_on_simplex_codes","308549192_Real_time_dynamic_strain_monitoring_of_optical_links_using_the_backreflection_of_live_PSK_data","291011400_High_resolution_DAS_via_sinusoidal_frequency_scan_OFDR_SFS-OFDR","243776017_Understanding_Digital_Signal_Processing","224177490_Distributed_Vibration_Sensor_Based_on_Coherent_Detection_of_Phase-OTDR","3242994_Distributed_Fiber-Optic_Intrusion_Sensor_System","3241315_Review_of_Long_Wavelength_Single-Mode_Optical_Fiber_Reflectometry_Techniques"]}