{"id":"311458920_Estimating_Local_Commuting_Patterns_From_Geolocated_Twitter_Data","abstract":"The emergence of large stores of transactional data generated by increasing use of digital devices presents a huge opportunity for policymakers to improve their knowledge of the local environment and thus make more informed and better decisions. A research frontier is hence emerging which involves exploring the type of measures that can be drawn from data stores such as mobile phone logs, Internet searches and contributions to social media platforms, and the extent to which these measures are accurate reflections of the wider population. This paper contributes to this research frontier, by exploring the extent to which local commuting patterns can be estimated from data drawn from Twitter. It makes three contributions in particular. First, it shows that simple heuristics drawn from geolocated Twitter data offer a good proxy for local commuting patterns; one which outperforms the major existing method for estimating these patterns (the radiation model). Second, it investigates sources of error in the proxy measure, showing that the model performs better on short trips with higher volumes of commuters; it also looks at demographic biases but finds that, surprisingly, measurements are not significantly affected by the fact that the demographic makeup of Twitter users differs significantly from the population as a whole. Finally, it looks at potential ways of going beyond simple heuristics by incorporating temporal information into models.","authors":["Graham McNeill","Jonathan Bright","Scott A. Hale"],"meta":["December 2016EPJ Data Science 6(1)","DOI:10.1140/epjds/s13688-017-0120-x"],"references":["308557858_The_Lightweight_Smart_City_and_Biases_in_Repurposed_Big_Data","304070616_Wikipedia_traffic_data_and_electoral_prediction_towards_theoretically_informed_models","291229251_Predicting_human_mobility_through_the_assimilation_of_social_media_traces_into_mobility_models","288520753_Life_in_the_network_The_coming_age_of_computational_social_science","283544656_Who_Tweets_with_Their_Location_Understanding_the_Relationship_between_Demographic_Characteristics_and_the_Use_of_Geoservices_and_Geotagging_on_Twitter","312911596_A_method_of_establishing_groups_of_equal_amplitude_in_plant_sociology_based_on_similarity_of_species_and_its_application_to_analyses_of_the_vegetation_on_Danish_commons","303215322_Population_bias_in_geotagged_tweets","289018090_A_Tale_of_Cities_Urban_Biases_in_Volunteered_Geographic_Information","288970909_Method_of_establishing_groups_of_equal_amplitude_in_plant_sociology_based_on_similarity_of_species_content_and_its_application_to_analyses_of_the_vegetation_on_Danish_Commons","280822238_Using_Digital_Footprints_for_a_City-Scale_Traffic_Simulation"]}