{"id":"311430860_A_Qualitative_Approach_to_Assessing_Technological_Pedagogical_Content_Knowledge","abstract":"Because technological pedagogical content knowledge is becoming an increasingly important construct in the field of teacher education, there is a need for assessment mechanisms that capture teachers' development of this portion of the knowledge base for teaching. The paper describes a proposal drawing on qualitative data produced during lesson study cycles to assess teachers' development of technological pedagogical content knowledge. The specific qualitative data sources include teachers' written lesson plans, university faculty members' reviews of lessons, transcripts and videos of implemented lessons, and recordings and transcripts of debriefing sessions about implemented lessons. Using these data sources, inferences about teachers' technological pedagogical content knowledge are drawn and validated. An example of the implementation of this lesson study technological pedagogical content knowledge (LS-TPACK) assessment model is provided. The example includes inferences drawn about high school teachers' technological pedagogical content knowledge in the context of two lesson study cycles that involved teaching systems of equations with graphing calculators. Reflections on the strengths and weaknesses of the LS-TPACK model are included from a qualitative perspective, as well as from a psychometric perspective.","authors":["Randall E. Groth","Donald Spickler","Jennifer A. Bergner","Michael J. Bardzell"],"meta":["January 2009"],"references":["346982379_Analyzing_Online_Discourse_to_Assess_Students'_Thinking","317953505_Situated_learning_Legitimate_peripheral_participation","317953501_The_teaching_gap_best_ideas_from_the_world's_teachers_for_improving_education_in_the_classroom","291640107_Applying_Japanese_Lesson_Study_Principles_to_an_Upper-level_Undergraduate_Statistics_Course","288862100_Research_on_technology_in_mathematics_education_A_perspective_of_constructs","274999251_Lesson_Study_Comes_of_Age_in_North_America","273053243_The_Handbook_of_Survey_Research","272178178_Unpacking_Pedagogical_Content_Knowledge_Conceptualizing_and_Measuring_Teachers'_Topic-Specific_Knowledge_of_Students","271347361_Explicating_the_Teacher's_Perspective_from_the_Researchers'_Perspectives_Generating_Accounts_of_Mathematics_Teachers'_Practice","269509413_Reviews_That_Teach"]}