{"id":"311458496_Do_We_Really_Need_to_Catch_Them_All_A_New_User-Guided_Social_Media_Crawling_Method","abstract":"With the growing use of popular social media services like Facebook and Twitter it is hard to collect all content from the networks without access to the core infrastructure or paying for it. Thus, if all content cannot be collected one must consider which data are of most importance. In this work we present a novel User-guided Social Media Crawling method (USMC) that is able to collect data from social media, utilizing the wisdom of the crowd to decide the order in which user generated content should be collected, to cover as many user interactions as possible. USMC is validated by crawling 160 Facebook public pages, containing 368 million users and 1.3 billion interactions, and it is compared with two other crawling methods. The results show that it is possible to cover approximately 75% of the interactions on a Facebook page by sampling just 20% of its posts, and at the same time reduce the crawling time by 53%. What is more, the social network constructed from the 20% sample has more than 75% of the users and edges compared to the social network created from all posts, and has very similar degree distribution.","authors":["Fredrik Erlandsson","Piotr Bródka","Martin Boldt","Henric Johnson"],"meta":["December 2016Entropy 19(12)","DOI:10.3390/e19120686"],"references":["307712370_Predicting_Community_Evolution_in_Social_Networks","306096271_Sampling_algorithms_for_weighted_networks","301695805_Finding_Influential_Users_in_Social_Media_Using_Association_Rule_Learning","301444762_Predicting_Community_Evolution_in_Social_Networks","284182705_Crawling_Online_Social_Networks","270906505_Sampling_Online_Social_Networks_via_Heterogeneous_Statistics","313604258_Finding_high-quality_content_in_social_media","281748678_Sampling_from_large_graphs","264916913_Probability_Statistics_for_Engineers_Scientists","262204592_Beyond_Social_Graphs_User_Interactions_in_Online_Social_Networks_and_their_Implications"]}