{"id":"311467513_High-resolution_mapping_of_global_surface_water_and_its_long-term_changes","abstract":"The location and persistence of surface water (inland and coastal) is both affected by climate and human activity and affects climate, biological diversity and human wellbeing. Global data sets documenting surface water location and seasonality have been produced from inventories and national descriptions, statistical extrapolation of regional data and satellite imagery, but measuring long-term changes at high resolution remains a challenge. Here, using three million Landsat satellite images, we quantify changes in global surface water over the past 32 years at 30-metre resolution. We record the months and years when water was present, where occurrence changed and what form changes took in terms of seasonality and persistence. Between 1984 and 2015 permanent surface water has disappeared from an area of almost 90,000 square kilometres, roughly equivalent to that of Lake Superior, though new permanent bodies of surface water covering 184,000 square kilometres have formed elsewhere. All continental regions show a net increase in permanent water, except Oceania, which has a fractional (one per cent) net loss. Much of the increase is from reservoir filling, although climate change is also implicated. Loss is more geographically concentrated than gain. Over 70 per cent of global net permanent water loss occurred in the Middle East and Central Asia, linked to drought and human actions including river diversion or damming and unregulated withdrawal. Losses in Australia and the USA linked to long-term droughts are also evident. This globally consistent, validated data set shows that impacts of climate change and climate oscillations on surface water occurrence can be measured and that evidence can be gathered to show how surface water is altered by human activities. We anticipate that this freely available data will improve the modelling of surface forcing, provide evidence of state and change in wetland ecotones (the transition areas between biomes), and inform water-management decision-making.","authors":["J.-F. Pekel","Andrew Cottam","Noel Gorelick","Alan Belward"],"meta":["December 2016Nature 540(7633)","DOI:10.1038/nature20584"],"references":["301909970_The_future_Aral_Sea_hope_and_despair","296480317_Outburst_Flooding_of_the_Moraine-Dammed_Zhuonai_Lake_on_Tibetan_Plateau_Causes_and_Impacts","285045373_Water_Observations_from_Space_Mapping_Surface_Water_from_25_Years_of_Landsat_Imagery_Across_Australia","313742463_Environmental_Challenges_in_Trans-Boundary_Waters_Case_StudyHamoon_Hirmand_Wetland_Iran_and_Afghanistan","308802060_httpieeexploreieeeorgstampstampjsparnumber7458890","299372495_Surface_Water_Extent_Dynamics_from_Three_Decades_of_Seasonally_Continuous_Landsat_Time_Series_at_Subcontinental_Scale_in_a_Semi-Arid_Region","292675283_Large_contribution_to_inland_water_CO2_and_CH4_emissions_from_very_small_ponds","285590797_The_global_Landsat_archive_Status_consolidation_and_direction","284755912_Optical_Properties_and_Remote_Sensing_of_Multicomponental_Water_Bodies","284095377_Development_of_a_global_90m_water_body_map_using_multi-temporal_Landsat_images","276835905_A_global_high-resolution_30-m_inland_water_body_dataset_for_2000_First_results_of_a_topographic-spectral_classification_algorithm","274382185_State_of_the_World's_Wetlands_and_Their_Services_to_People_A_Compilation_of_Recent_Analyses","280627673_Global_threats_to_human_water_security_and_river_biodiversity","279994490_Historical_record_of_Landsat_global_coverage_Mission_operations_NSLRSDA_and_international_cooperator_stations","271515441_Results_of_the_Global_WaterPack_A_novel_product_to_assess_inland_water_body_dynamics_on_a_daily_basis"]}