{"id":"311457196_Combining_and_Projecting_Flow_Models_for_the_Precedence_Constrained_Asymmetric_Traveling_Salesman_Problem","abstract":"There are many ways of modeling the Asymmetric Traveling Salesman Problem (ATSP) and the related Precedence Constrained ATSP (PCATSP). In this paper we present new formulations for the two problems that result from combining precedence variable based formulations with network flow based formulations. As suggested in Gouveia and Pesneau (2006), the former class of formulations allows the integration of linear ordering constraints. The motivating formulation for this work is a complicated and \" ugly \" formulation that results from the separation of generalized subtour elimination constraints presented in Gouveia and Pesneau (2006). This so-called \" ugly \" formulation exhibits, however, one interesting feature, namely the \" disjoint sub-paths \" property that is further explored to create more complicated formulations that combine two (or more) disjoint path network flow based formulations which have a stronger linear programming relaxation bound. Several sets of projected inequalities, in the space of the arc and precedence variables, and in the spirit of many inequalities presented in Gouveia and Pesneau (2006), are obtained by projecting these network flow based formulations. Computational results are given for the PCATSP to evaluate the quality of the new models and inequalities.","authors":["Luis Gouveia","Pierre Pesneau","Mario Ruthmair","Daniel Araujo Santos"],"meta":["May 2018Networks 71(4):451-465","DOI:10.1002/net.21765","Project: Optimization and Analysis of Large-Scale Networks"],"references":["276136925_Load-dependent_and_precedence-based_models_for_pickup_and_delivery_problems","247778890_Multivalued_Decision_Diagrams_for_Sequencing_Problems","307955917_Zur_allgemeinen_kurventheorie","307941348_A_Set_Covering_Approach_for_the_Double_Traveling_Salesman_Problem_with_Multiple_Stacks","284677188_Integer_programming_formulations_of_the_traveling_salesman_problem","284515176_Two_terminal_Steiner_tree_polyhedra","283354799_Stronger_Multi-Commodity_Flow_Formulations_of_the_Capacitated_Sequential_Ordering_Problem","279560363_CUTTING_PLANE_ALGORITHM_FOR_THE_LINEAR_ORDERING_PROBLEM","268615830_On_a_Time-Dependent_Formulation_and_an_Updated_Classification_of_ATSP_Formulations","244959753_A_New_Formulation_for_the_Travelling_Salesman_Problem"]}