{"id":"311492717_Quantifying_brain_microstructure_with_diffusion_MRI_Theory_and_parameter_estimation","abstract":"We review, systematize and discuss models of diffusion in neuronal tissue, by putting them into an overarching physical context of coarse-graining over an increasing diffusion length scale. From this perspective, we view research on quantifying brain microstructure as occurring along the three major avenues. The first avenue focusses on the transient, or time-dependent, effects in diffusion. These effects signify the gradual coarse-graining of tissue structure, which occurs qualitatively differently in different brain tissue compartments. We show that studying the transient effects has the potential to quantify the relevant length scales for neuronal tissue, such as the packing correlation length for neuronal fibers, the degree of neuronal beading, and compartment sizes. The second avenue corresponds to the long-time limit, when the observed signal can be approximated as a sum of multiple non-exchanging anisotropic Gaussian components. Here the challenge lies in parameter estimation and in resolving its hidden degeneracies. The third avenue employs multiple diffusion encoding techniques, able to access information not contained in the conventional diffusion propagator. We conclude with our outlook on the future research directions which can open exciting possibilities for developing markers of pathology and development based on methods of studying mesoscopic transport in disordered systems.","authors":["Dmitry Novikov","Sune Nørhøj Jespersen","Valerij Kiselev","Els Fieremans"],"meta":["December 2016NMR in Biomedicine 32(4)","DOI:10.1002/nbm.3998","Project: Tissue microstructure from MRI"],"references":["321339230_Design_and_Validation_of_Diffusion_MRI_Models_of_White_Matter","321080580_Time-Dependent_Diffusion_MRI_in_Cancer_Tissue_Modeling_and_Applications","320986931_The_absence_of_restricted_water_pool_in_brain_white_matter","346355165_Scaling_and_Renormalization_in_Statistical_Physics","325972110_Double_Diffusion_Encoding_vs_Single_Diffusion_Encoding_in_Parameter_Estimation_of_Biophysical_Models_in_Diffusion-Weighted_MRI","321474874_Imaging_brain_microstructure_with_diffusion_MRI_Practicality_and_applications","321448939_Observation_of_structural_universality_in_disordered_systems_using_bulk_diffusion_measurement","320885547_Fast_Na_K_pump_driven_steady-state_transcytolemmal_water_exchange_in_neuronal_tissue_A_study_of_rat_brain_cortical_cultures_Active_Transcytolemmal_Water_Exchange_in_Neuronal_Tissue","320579437_Histological_validation_of_diffusion_MRI_fiber_orientation_distributions_and_dispersion","319926903_TE_dependent_Diffusion_Imaging_TEdDI_distinguishes_between_compartmental_T_2_relaxation_times"]}