{"id":"311491429_Privacy_Mediators_Helping_IoT_Cross_the_Chasm","abstract":"Unease over data privacy will retard consumer acceptance of IoT deployments. The primary source of discomfort is a lack of user control over raw data that is streamed directly from sensors to the cloud. This is a direct consequence of the over-centralization of today's cloud-based IoT hub designs. We propose a solution that interposes a locally-controlled software component called a privacy mediator on every raw sensor stream. Each mediator is in the same administrative domain as the sensors whose data is being collected, and dynamically enforces the current privacy policies of the owners of the sensors or mobile users within the domain. This solution necessitates a logical point of presence for mediators within the administrative boundaries of each organization. Such points of presence are provided by cloudlets, which are small locally-administered data centers at the edge of the Internet that can support code mobility. The use of cloudlet-based mediators aligns well with natural personal and organizational boundaries of trust and responsibility.","authors":["Nigel Davies","Nina Taft","Mahadev Satyanarayanan","Sarah Clinch"],"meta":["February 2016","DOI:10.1145/2873587.2873600","Conference: the 17th International Workshop"],"references":["291422212_Collecting_Shared_Experiences_through_Lifelogging_Lessons_Learned","276139817_Edge_Analytics_in_the_Internet_of_Things","273836228_An_Open_Ecosystem_for_Mobile-Cloud_Convergence","273186151_Security_and_Privacy_Implications_of_Pervasive_Memory_Augmentation","272397881_Enabling_the_Internet_of_Things","270902059_Your_Location_has_been_Shared_5398_Times_A_Field_Study_on_Mobile_App_Privacy_Nudging","309201112_The_case_for_VM-based_cloudlets_in_mobile_computing","307594817_Internet_of_Things_Privacy_and_security_in_a_connected_world","262396294_BuildingDepot_20_An_Integrated_Management_System_for_Building_Analysis_and_Control","262164649_Scalable_crowd-sourcing_of_video_from_mobile_devices"]}