{"id":"311573669_Optimized_Execution_of_Business_Processes_on_Blockchain","abstract":"Blockchain technology enables the execution of collaborative business processes involving untrusted parties without requiring a central authority. Specifically, a process model comprising tasks performed by multiple parties can be coordinated via smart contracts operating on the blockchain. The consensus mechanism governing the blockchain thereby guarantees that the process model is followed by each party. However, the cost required for blockchain use is highly dependent on the volume of data recorded and the frequency of data updates by smart contracts. This paper proposes an optimized method for executing business processes on top of commodity blockchain technology. Our optimization targets three areas specifically: initialization cost for process instances, task execution cost by means of a space-optimized data structure, and improved runtime components for maximized throughput. The method is empirically compared to a previously proposed baseline by replaying execution logs and measuring resource consumption and throughput.","authors":["Luciano García-Bañuelos","Alexander Ponomarev","Marlon Dumas","Ingo Weber"],"meta":["September 2017","DOI:10.1007/978-3-319-65000-5_8","Conference: BPM'17: International Conference on Business Process ManagementAt: Barcelona, Spain"],"references":["312694996_Automated_Discovery_of_Structured_Process_Models_Discover_Structured_vs_Discover_and_Structure","312240979_From_Institutions_to_Code_Towards_Automated_Generation_of_Smart_Contracts","308351887_Towards_a_Shared_Ledger_Business_Collaboration_Language_Based_on_Data-Aware_Processes","303996559_Untrusted_Business_Process_Monitoring_and_Execution_Using_Blockchain","301693656_Automated_Discovery_of_Structured_Process_Models_Discover_Structured_vs_Discover_and_Structure","277034537_Creation_of_Smart-Contracting_Collaborations_for_Decentralized_Autonomous_Organizations","225913375_Fundamentals_of_Control_Flow_in_Workflows","285842809_Petri_Nets_Properties_Analysis_and_Applications","224101754_Business_artifacts_An_approach_to_operational_specification","221999293_Semantics_and_analysis_of_business_process_models_in_BPMN"]}