{"id":"311585430_L'enseignement_de_savoirs_informatiques_pour_debutants_du_second_cycle_de_la_scolarite_secondaire_scientifique_a_l'universite_en_France_une_etude_comparative","abstract":"Notre thèse de doctorat s'intéresse à l'enseignement et l'apprentissage de savoirs informatiques chez des débutants en France. Elle vise à comprendre comment des débutants mettent en oeuvre et construisent des savoirs informatiques. Nous avons utilisé une méthodologie qualitative de type ethnographique mobilisant des observations, des questionnaires, des entretiens semi-directifs et des analyses de textes officiels et de manuels. Nous avons aussi précédé par une approche comparative des pratiques des lycéens et des étudiants d'une part, et des enseignants, d'autre part. Les résultats montrent des pratiques contrastées, entretenues par des tensions dans le prescrit. Au lycée, en dehors de la spécialité ISN, où l'informatique est rattachée aux mathématiques, les pratiques semblent influencées par quatre facteurs : la motivation (liée aux représentations), la formation continue des enseignants, la jeunesse dans le métier et l'approche pédagogique utilisée. La pratique est focalisée sur l'approche logique de l'algorithmique avec un travail au papier-crayon : la programmation est limitée, et lorsqu'elle a lieu, c'est plus avec une calculatrice mais aussi rarement avec le langage Algobox. Chez les élèves, l'algorithmique est vue comme un nouveau domaine supplémentaire introduit en mathématiques mais différent des mathématiques et de l'informatique. Les très bons élèves en algorithmique sont en général bons en mathématiques. L'ISN accueille des élèves de tous les profils, mais avec des motivations différentes, allant de la découverte de l'informatique dans un contexte formel au refuge des autres spécialités : leurs pratiques sont contrastées. C'est avec l'ISN qu'ils découvrent l'informatique au travers des formes d'enseignement variées et des problèmes de plus en plus complexes. Les pratiques des enseignants restent influencées par leur formation d'origine, avec un manque de recul chez les non-spécialistes d'informatique. À l'Université, les pratiques des étudiants en programmation sont avancées par rapport à celles des lycéens, une avance liée à la complémentarité des modules qui sont dispensés par des spécialistes. Les programmes informatiques ainsi réalisés sont souvent sophistiqués et incorporent des éléments issus de différentes sources externes. Les notions mathématiques investies par les étudiants sont souvent modestes. Si les lycéens et les étudiants sont tous débutants en informatique, les différences de pratiques entre eux semblent liées aux compétences spécifiques des enseignants. Au-delà de la formation des enseignants, la motivation occupe une place fondamentale pour adhérer à cet enseignement/apprentissage et soutenir des pratiques enseignantes comme chez les apprenants.","authors":["Claver Nijimbere"],"meta":["June 2015"],"references":[]}