{"id":"311545070_althwrt_alhadyt_tdrys_albrmjt_wlm_alhaswb_llajyal_alsghyrt_The_Quiet_Revolution_Teaching_Programming_and_Computer_Science_to_Young_Children_In_Arabic","abstract":"It became clear that this era is characterized by rapid technological changes in almost every domain of our life. Due to the widespread use of various computer applications in all school levels, in workplaces and at home, the need for people with important skills for working with computer applications and people with capabilities to develop such applications is increasing.\nRecently, many researchers have increasingly realized that there is a need to start teaching the principles of computer science and programming in schools from an early age. Various articles point to the importance of taking up foundations of programming and computer science at the elementary school so the process empowers learners with the ability to develop essential skills, such as problem solving, algorithmic thinking and creativity. These skills are essential to any graduate in the concurrent technological world. \nThis article tries to deal with the question: Where are we in Arab schools from this demand? The purpose of this article is to consider this question and to offer recommendations on options related to the integration of the study of computer science and programming in the local Arab schools, particularly elementary and junior high schools.","authors":["Moanes H. Tibi","Khaled Asad"],"meta":["October 2016"],"references":["281494017_Improving_Collaborative_Skills_by_Computer_Science_Students_through_Structured_Discussion_Forums","234607830_Learning_Foreign_Language_through_an_Interactive_Multimedia_Program_An_Experimental_Study_on_the_Effects_of_the_Relevance_Component_of_the_ARCS_Model","220979410_Computer_Science_in_Elementary_and_Secondary_Schools","27470781_Learning_to_Program_Going_Pair-Shaped","266562898_Review_on_teaching_and_learning_of_computational_thinking_through_programming_What_is_next_for_K-12","257171388_Problem_solving_by_5-6_years_old_kindergarten_children_in_a_computer_programming_environment_A_case_study","255567653_The_Learning_Environment_of_the_21_ST_Century","240934190_Student_Strategies_for_Learning_Computer_Programming_Implications_for_Pedagogy_in_Informatics","234819136_Collaborative_programming_projects_in_an_advanced_CS_course","221538848_Developing_collaborative_skills_early_in_the_CS_curriculum_in_a_laboratory_environment"]}