{"id":"311528565_ECOALIM_A_Dataset_of_Environmental_Impacts_of_Feed_Ingredients_Used_in_French_Animal_Production","abstract":"Feeds contribute highly to environmental impacts of livestock products. Therefore, formulating low-impact feeds requires data on environmental impacts of feed ingredients with consistent perimeters and methodology for life cycle assessment (LCA). We created the ECOALIM dataset of life cycle inventories (LCIs) and associated impacts of feed ingredients used in animal production in France. It provides several perimeters for LCIs (field gate, storage agency gate, plant gate and harbour gate) with homogeneously collected data from French R&D institutes covering the 2005–2012 period. The dataset of environmental impacts is available as a Microsoft® Excel spreadsheet on the ECOALIM website and provides climate change, acidification, eutrophication, non-renewable and total cumulative energy demand, phosphorus demand, and land occupation. LCIs in the ECOALIM dataset are available in the AGRIBALYSE® database in SimaPro® software. The typology performed on the dataset classified the 149 average feed ingredients into categories of low impact (co-products of plant origin and minerals), high impact (feed-use amino acids, fats and vitamins) and intermediate impact (cereals, oilseeds, oil meals and protein crops). Therefore, the ECOALIM dataset can be used by feed manufacturers and LCA practitioners to investigate formulation of low-impact feeds. It also provides data for environmental evaluation of feeds and animal production systems. Included in AGRIBALYSE® database and SimaPro®, the ECOALIM dataset will benefit from their procedures for maintenance and regular updating. Future use can also include environmental labelling of commercial products from livestock production.","authors":["Aurélie Wilfart","Sandrine Espagnol","Sylvie Darracq Dauguet","Aurélie Tailleur"],"meta":["December 2016PLoS ONE 11(12):e0167343","DOI:10.1371/journal.pone.0167343","Project: Ecoalim"],"references":["310449694_Multi-objective_formulation_is_an_efficient_methodology_to_reduce_environmental_impacts_of_pig_feeds","299982902_How_to_Build_a_Standardized_Country-Specific_Environmental_Food_Database_for_Nutritional_Epidemiology_Studies","289509969_Tackling_climate_change_through_livestock_A_global_assessment_of_emissions_and_mitigation_opportunities","272131030_Overview_and_methodology_Data_quality_guideline_for_the_ecoinvent_database_version_3","271417365_A_vast_range_of_opportunities_for_feeding_the_world_in_2050_Trade-off_between_diet_N_contamination_and_international_trade","318393770_R_A_Language_and_Environment_for_Statistical_Computing","309522157_Effect_of_feeding_strategy_on_environmental_impacts_of_pig_fattening_in_different_contexts_of_production_evaluation_through_life_cycle_assessment","307534406_Life_Cycle_Inventories_of_Swiss_and_European_Agricultural_Systems_Data_v20_Ecoinvent_Report_No_15a","285726931_IPCC_guidelines_for_national_greenhouse_gas_inventories","280836767_Agri-Footprint_a_Life_Cycle_Inventory_database_covering_food_and_feed_production_and_processing"]}