{"id":"311556036_Tangible_User_Interfaces_for_Programming_and_Education_A_New_Field_for_Innovation_and_Entrepreneurship","abstract":"Purpose - This chapter examines the existing work on tangible user interfaces (TUIs) and focuses on tangible programming with the scope to enlighten the opportunities for innovation and entrepreneurship in this particular domain. Methodology/approach - In the first section, we start by presenting in short the history of TUIs and then focus on tangible programming presenting the different design approaches. Then we present the opportunities for innovation and guidelines for future products. In the second section, we review the entrepreneurial activities that combine educational toys and TUIs Findings - The main finding of this chapter is that although TUI design and research are still in its infancy and more design guidelines and research are required to further bridge the digital and the physical world, the first signs of entrepreneurship promise a bright future. Research limitations - Limitations arise from the fact that many companies keep many of their financial data confidential. Thus, it was impossible to include and validate all the information that we intended to present. Practical implications - Initially, this chapter motivates and challenges scientist to find novel innovative solutions in the field. Then, reveals the entrepreneurial opportunities and potential customers. Finally, shows the funding sources and how tangible products are offered in the market. Social implications - We propose a new kind of toys that might alter and expand science, technology, engineering, and mathematics (STEM) in education. Originality/value - This chapter appears to be unique in the sense that is the first that reports simultaneously on TUIs, entrepreneurship, and innovation.","authors":["T. Sapounidis","Ioannis Stamelos","Stavros N. Demetriadis"],"meta":["December 2016","DOI:10.1108/S2051-229520160000002016","In book: Innovation and Entrepreneurship in Education (pp.271-295)"],"references":["283962768_Tangible_Programming_Environment_Using_Paper_Cards_as_Command_Objects","269704129_Evaluating_children_performance_with_graphical_and_tangible_robot_programming_tools","261494536_Exploring_Children_Preferences_regarding_Tangible_and_Graphical_Tools_for_Introductory_Programming_Evaluating_the_PROTEAS_Kit","314824193_Real-time_3D_interaction_with_ActiveCube","314807712_Tangible_programming_elements_for_young_children","314801178_A_tangible_interface_for_controlling_robotic_toys","314720872_Using_developmental_theories_to_inform_the_design_of_technology_for_children","277374591_Lowering_the_barriers_to_programming","262401412_Dr_Wagon_A_'stretchable'_toolkit_for_tangible_computer_programming","258656545_Algorithmic_Bricks_A_Tangible_Robot_Programming_Tool_for_Elementary_School_Students"]}