{"id":"311525782_Multidisciplinary_Project_Based_Learning_Within_a_Collaborative_Framework_A_Case_Study_on_Urban_Drone_Conception","abstract":"Multidisciplinary project-based learning (PBL) allows multifaceted real-world problems to be resolved with solutions addressing scientific, technical, business, and social aspects. However, such a method can be very challenging in terms of project management (including planning, coordinating, and management of human, material and financial resources) and time-consuming, especially when involving several partners (academic and industrial partners). This paper provides firsthand experience of multidisciplinary PBL implemented in France in engineering education through a case study on urban drone conception. This research project has been proceeded within a collaborative framework in which 3 specialties (electrical energy systems, industrial computing, and mechanics and systems design) of a graduate school of engineering and a start-up company are jointly involved for the first time. This article discusses knowledge and skills that engineering students are expected to acquire at the end of the research project, and the methods of assessment. The designing, manufacturing, and experimental validation of the urban drone are described. The various steps in the project management, and the interactions with the students and partners (teachers and industrial partner) are particularly highlighted. Qualitative and quantitative data have been collected through questionnaires, student logbooks and reports. The results demonstrate that this experience is overwhelmingly positive since it empowers and enhances student learning.","authors":["Sebastien Jacques","Sébastien Bissey","Arnaud Martin"],"meta":["December 2016International Journal of Emerging Technologies in Learning (iJET) 11(12):36","DOI:10.3991/ijet.v11i12.5996"],"references":["283789508_The_System_Analysis_in_Language_Teaching_and_Learning_for_Technical_Students_in_Russia","267652630_A_Framework_for_Collaborative_Networked_Learning_in_Higher_Education_Design_Analysis","254304555_Formative_assessment_strategies_and_their_effect_on_student_performance_and_on_student_and_tutor_workload_The_results_of_research_projects_undertaken_in_preparation_for_greater_convergence_of_universi","251417046_AR-Drone_as_a_Platform_for_Robotic_Research_and_Education","321899003_The_assessment_of_learning_in_engineering_education_Practice_and_policy","301529307_Competency-based_learning_management_systems_Practices_using_remote_laboratories_to_improve_the_use_of_the_subjects_and_get_required_competences","301238645_Project_Based_Learning_in_Teaching_Communication_Skills_in_English_as_a_Foreign_Language_to_Engineering_Students","276400741_Engaging_Students_through_Blogs_Using_Blogs_to_Boost_a_Course_Experience","260085732_John_Dewey_and_Education_Outdoors_Making_Sense_of_the_'Educational_Situation'_through_more_than_a_Century_of_Progressive_Reforms","251624210_Declarations_for_sustainability_in_higher_education_Becoming_better_leaders_through_addressing_the_university_system"]}