{"id":"311585986_Spreadsheet_Guardian_An_Approach_for_Protecting_Semantic_Correctness_throughout_the_Evolution_of_Spreadsheets","abstract":"Spreadsheets are powerful tools that play a business‐critical role in many organizations. However, many bad decisions taken due to faulty spreadsheets show that these tools need serious quality assurance. Furthermore, while collaboration on spreadsheets for maintenance tasks is common, there has been almost no support for ensuring that the spreadsheets remain correct during this process.\nWe have developed an approach named Spreadsheet Guardian, which separates the specification of spreadsheet test rules from their execution. By automatically executing user‐defined test rules, our approach is able to detect semantic faults. It also protects all collaborating spreadsheet users from introducing faults during maintenance, even if only few end‐users specify test rules. To evaluate Spreadsheet Guardian, we implemented a representative testing technique as an add‐in for Microsoft Excel.\nWe evaluated the testing technique in 2 empirical evaluations with 29 end‐users and 42 computer science students. The results indicate that the technique is easy to learn and to apply. Furthermore, after finishing maintenance, participants with spreadsheets “protected” by the technique are more realistic about the correctness of their spreadsheets than participants who use only “classic,” noninteractive test rules on the basis of static analysis techniques. Hence, we believe that Spreadsheet Guardian can be of use for business‐critical spreadsheets.","authors":["Daniel Kulesz","Verena Ebert","Stefan Wagner"],"meta":["November 2016Journal of Software: Evolution and Process 30(sup1)","DOI:10.1002/smr.1934"],"references":["309461985_What_is_the_best_way_for_developers_to_learn_new_software_tools_An_empirical_comparison_between_a_text_and_a_video_tutorial","304552688_Enron's_Spreadsheets_and_Related_Emails_A_Dataset_and_Analysis","301234429_How_Effective_can_Spreadsheet_Anomalies_be_Detected_An_Empirical_Study","346469742_Kontrollierte_Experimente_in_der_Softwaretechnik","319394793_A_Small_Matter_of_Programming_Perspectives_on_End_User_Computing","317173547_Tools_of_the_Trade_A_Survey_of_Technologies_in_End-User_Development_Literature","315766422_What_Is_the_Best_Way_For_Developers_to_Learn_New_Software_Tools_An_Empirical_Comparison_Between_a_Text_and_a_Video_Tutorial","311415857_Data_For_Spreadsheet_Guardian","309915559_Finding_errors_in_the_Enron_spreadsheet_corpus","289853682_A_spreadsheet_cell-meaning_model_for_testing"]}