{"id":"311511130_Attendance_Management_System_Using_Barcode_Identification_on_Students'_Identity_Cards","abstract":"All academic institutions have certain criteria for students regarding their attendance in class and examinations. The importance of student attendance in class cannot be over emphasized, as a result of this, administrators and lecturers of various academic institutions are concerned with the attendance irregularities. In the process of admitting students into an examination hall in most Nigerian institutions, 70% of attendance must be met and also considered for grade computation, therefore there is a huge need for monitoring and recording students' attendance. This brings about the need to have a tool to control students' attendance. The existing model of manual attendance monitoring (using paper sheets and an old file system) is not efficient and it is also time consuming. These aforementioned shortcomings among others serve as justification for migrating from manual based to the proposed system. The system is based on barcode reader technology and the details of this system are presented in this paper. The system can be easily accessed by the lecturers and most importantly, the reports can be generated in real-time processing, thus, providing valuable information about the students.","authors":["Saheed Yakub","Moshood A. Hambali","Abdulmumeen A Adedeji","Ismaeel Aderibigbe Adeniji"],"meta":["December 2016","Project: Collaboration Research"],"references":["326501607_Shoewu_et_al-Embedded_Computer-Based_Lecture_Attendance_Management_System_Embedded_Embedded_Embedded_Embedded_Computer_Computer_Computer_Computer--Based_Lecture_Attendance_Based_Lecture_Attendance_Bas","290566484_Radio_Frequency_Identification_Classroom_Management_System","263657550_Any_Time_Any_Where-Remote_Monitoring_of_Attendance_System_based_on_RFID_using_GSM_Network","242098052_Development_of_Academic_Attendence_Monitoring_System_Using_Fingerprint_Identification","49617138_An_Efficient_Automatic_Attendance_System_using_Fingerprint_Verification_Technique","261457429_Web-based_student_attendance_system_using_RFID_technology","224694065_The_Design_of_Wireless_Fingerprint_Attendance_System","224445927_A_facial_presence_monitoring_system_for_information_security","224091916_RFID_based_attendance_system"]}