{"id":"311500851_Project_description_and_crowdfunding_success_an_exploratory_study","abstract":"Existing research on antecedent of funding success mainly focuses on basic project properties such as funding goal, duration, and project category. In this study, we view the process by which project owners raise funds from backers as a persuasion process through project descriptions. Guided by the unimodel theory of persuasion, this study identifies three exemplary antecedents (length, readability, and tone) from the content of project descriptions and two antecedents (past experience and past expertise) from the trustworthy cue of project descriptions. We then investigate their impacts on funding success. Using data collected from Kickstarter, a popular crowdfunding platform, we find that these antecedents are significantly associated with funding success. Empirical results show that the proposed model that incorporated these antecedents can achieve an accuracy of 73 % (70 % in F-measure). The result represents an improvement of roughly 14 percentage points over the baseline model based on informed guessing and 4 percentage points improvement over the mainstream model based on basic project properties (or 44 % improvement of mainstream’s performance over informed guessing). The proposed model also has superior true positive and true negative rates. We also investigate the timeliness of project data and find that old project data is gradually becoming less relevant and losing predictive power to newly created projects. Overall, this study provides evidence that antecedents identified from project descriptions have incremental predictive power and can help project owners evaluate and improve the likelihood of funding success.","authors":["Mi Jamie Zhou","Baozhou Lu","Weiguo Fan","G. Alan Wang"],"meta":["April 2018Information Systems Frontiers 20(2)","DOI:10.1007/s10796-016-9723-1"],"references":["315828262_Money_talks_A_predictive_model_on_crowdfunding_success_using_project_description","280288650_Predicting_Advertising_Success_Beyond_Traditional_Measures_New_Insights_from_Neurophysiological_Methods_and_Market_Response_Modeling","276412348_Evaluation_From_precision_recall_and_F-measure_to_ROC_informedness_markedness_correlation","270271600_The_Elaboration_Likelihood_Model_of_Persuasion","266655428_Show_me_the_money_An_analysis_of_project_updates_during_crowdfunding_campaigns","289483970_Dynamic_Strategies_for_Successful_Online_Crowdfunding","276375562_Analyzing_superstars'_power_using_support_vector_machines","274514081_An_Integrated_Text_Analytic_Framework_for_Product_Defect_Discovery","272303974_Playing_Both_Sides_of_the_Market_Success_and_Reciprocity_on_Crowdfunding_Platforms","270345135_How_images_and_color_in_business_plans_influence_venture_investment_screening_decisions"]}