{"id":"311512720_Efficient_Parallel_Multi-Objective_Optimization_for_Real-time_Systems_Software_Design_Exploration","abstract":"Real-time embedded systems may be composed of a large number of time constrained functions. During software architecture design, these functions must be assigned to tasks that will run the functions on the top of a real-time operating systems (RTOS). This is a challenging work due to the large number of valid candidate functions to tasks assignment solutions. Moreover, the impact of the assignment on the system performance criteria (often conflicting) should be taken into account in the architecture exploration. The automation of the design exploration by the use of metaheuristics such as multi-objective evolutionary algorithm (MOEA) is a suitable way to help the designers. MOEAs approximate near-optimal alternatives at a reasonable time when compared to an exact search method. However, for large-scale systems even a MOEA method is impractical due to the increased time required to solve a problem instance. To tackle this problem, we present in this article a parallel implementation of the Pareto Archived Evolution Strategy (PAES) algorithm used as a MOEA for the design exploration. The proposed parallelization method is based on the well-known Master-Slave paradigm. Additionally, it involves a new selection scheme in the PAES algorithm. Results of experimentations provide evidence that, on one hand, the parallel approach can considerably speed up the design exploration and the optimization processes. On the other hand, the proposed selection strategy improves the quality of obtained solutions as compared to the original PAES selection schema.","authors":["Rahma Bouaziz","Laurent Lemarchand","Frank Singhoff","Bechir Zalila"],"meta":["October 2016","DOI:10.1145/2990299.2990310","Conference: 27th International Symposium on Rapid System Prototyping (RSP) , October 6-7, 2016, Pittsburgh, PA, USA","Project: Project Cheddar,  a  tool for real-time scheduling analysis"],"references":["311175259_A_tutorial_on_tbe_performance_assessment_of_stochastic_multiobjective_optimizers","304294969_Architecture_Exploration_of_Real-Time_Systems_Based_on_Multi-objective_Optimization","221033229_Can_We_Increase_the_Usability_of_Real_Time_Scheduling_Theory_The_Cheddar_Project","220413997_Measuring_the_Performance_of_Schedulability_Tests","220358256_Comparison_of_parallel_multi-objective_approaches_to_protein_structure_prediction","216457345_An_evolutionary_multiobjective_optimization_approach_to_component-based_software_architecture_design","299969145_Automatic_selection_and_composition_of_model_transformations_alternatives_using_evolutionary_algorithms","279958067_Some_Single-_and_Multiobjective_Optimization_Techniques","226064331_Parallel_Evolutionary_Multiobjective_Optimization","216300449_Evolutionary_Algorithms_for_Solving_Multi-Objective_Problems_Second_Edition"]}