{"id":"311626002_Conceptualising_engagement_with_digital_behaviour_change_interventions_a_systematic_review_using_principles_from_critical_interpretive_synthesis","abstract":"“Engagement” with digital behaviour change interventions (DBCIs) is considered important for their effectiveness. Evaluating engagement is therefore a priority; however, a shared understanding of how to usefully conceptualise engagement is lacking. This review aimed to synthesise literature on engagement to identify key conceptualisations and to develop an integrative conceptual framework involving potential direct and indirect influences on engagement and relationships between engagement and intervention effectiveness. Four electronic databases (Ovid MEDLINE, PsycINFO, ISI Web of Knowledge, ScienceDirect) were searched in November 2015. We identified 117 articles that met the inclusion criteria: studies employing experimental or non-experimental designs with adult participants explicitly or implicitly referring to engagement with DBCIs, digital games or technology. Data were synthesised using principles from critical interpretive synthesis. Engagement with DBCIs is conceptualised in terms of both experiential and behavioural aspects. A conceptual framework is proposed in which engagement with a DBCI is influenced by the DBCI itself (content and delivery), the context (the setting in which the DBCI is used and the population using it) and the behaviour that the DBCI is targeting. The context and “mechanisms of action” may moderate the influence of the DBCI on engagement. Engagement, in turn, moderates the influence of the DBCI on those mechanisms of action. In the research literature, engagement with DBCIs has been conceptualised in terms of both experience and behaviour and sits within a complex system involving the DBCI, the context of use, the mechanisms of action of the DBCI and the target behaviour.\n\nElectronic supplementary material\nThe online version of this article (doi:10.1007/s13142-016-0453-1) contains supplementary material, which is available to authorized users.","authors":["Olga Perski","Ann Blandford","Robert West","Susan Michie"],"meta":["December 2016Translational Behavioral Medicine 7(2)","DOI:10.1007/s13142-016-0453-1","Project: Engagement with Digital Behaviour Change Interventions: Conceptualisation, Measurement and Promotion"],"references":["284890929_Research_methods_and_reporting_preferred_reporting_items_for_systematic_reviews_and_meta-analyses_the_PRISMA_statement","282039372_A_Systematic_Review_of_Digital_and_Computer-Based_Alcohol_Intervention_Programs_in_Primary_Care","281546793_Adherence_to_Technology-Mediated_Insomnia_Treatment_A_Meta-Analysis_Interviews_and_Focus_Groups","280938904_Five_approaches_to_measuring_engagement_Comparisons_by_video_game_characteristics","280492283_Computer_and_Internet_Interventions_to_Optimize_Listening_and_Learning_for_People_With_Hearing_Loss_Accessibility_Use_and_Adherence","299449265_Measurements_of_engagement_in_mobile_behavioural_interventions","298433884_Computer_self-efficacy_competitive_anxiety_and_flow_state_Escaping_from_firing_online_game","286068990_Design_factors_of_mobile_game_for_increasing_gamer's_flow_experience","283429417_Mobile_Phone-Based_Interventions_for_Smoking_Cessation","283262551_An_Introduction_to_Gamification_Adding_Game_Elements_for_Engagement"]}