{"id":"311650417_Crowdsourcing_and_Crowdtasking_in_Crisis_Management_Lessons_Learned_From_a_Field_Experiment_Simulating_a_Flooding_in_City_of_the_Hague","abstract":"The EU FP7 project DRIVER conducts a number of experiments that explore new approaches for addressing known deficiencies in crisis management. The “Interaction with Citizens” experiment campaign focuses on testing the usability and acceptance of various methods and tools that facilitate crisis communication via several channels. These include: informing, alerting, micro-tasking, incident information crowdsourcing from volunteers, and usage of this information to improve situational awareness. The results highlight that volunteer motivation in a serious game like scenario is important to simulate participation in crisis events. We also argue that the scenario complexity level needs to be simple enough to avoid difficulties in communication with non-professional participants in addition to external influences in a field experiment. In this paper, we present lessons learned from the final experiment of this campaign that investigated two-way communication solutions between crisis managers and citizens or unaffiliated volunteers in a simulated flooding scenario in the city of The Hague.","authors":["Adam Widera","Michael Middelhoff","Bernd Hellingrath","Daniel Auferbauer"],"meta":["December 2016","DOI:10.1109/ICT-DM.2016.7857212","Conference: International Conference on Information and Communication Technologies for Disaster ManagementAt: Vienna, Austria","Project: DRIVER"],"references":["325218403_Crowdtasking_Field_Study_on_a_Crowdsourcing_Solution_for_Practitioners_in_Crisis_Management","306158339_Combining_Real_and_Virtual_Volunteers_through_Social_Media","303462163_Interaction_with_Citizens_Experiments_From_Context-aware_Alerting_to_Crowdtasking","285602967_Moving_towards_crowd_tasking_for_disaster_mitigation","269693590_Crowdsourcing_Tools_for_Disaster_Management_A_Review_of_Platforms_and_Methods","226820209_GeoWeb_and_Crisis_Management_Issues_and_Perspectives_of_Volunteered_Geographic_Information_GeoJournal","295103066_Crowdtasking_-_A_New_Concept_for_Volunteer_Management_in_Disaster_Relief","265514120_Crisis_Crowdsourcing_Framework_Designing_Strategic_Configurations_of_Crowdsourcing_for_the_Emergency_Management_Domain","247933502_The_next_social_revolution","238077445_How_do_we_know_that_a_scenario_is_appropriate"]}