{"id":"311650048_Energy_efficiency_of_MAC_protocols_in_low_data_rate_wireless_multimedia_sensor_networks_A_comparative_study","abstract":"Some new application scenarios for Wireless Sensor Networks (WSNs) such as urban resilience, smart house/building, smart agriculture and animal farming, among others, can be enhanced by adding multimedia sensors able to capture and transmit small multimedia samples such as still images or audio files. In these applications, Wireless Multimedia Sensor Networks (WMSNs) usually share two conflicting design goals. On the one hand, the goal of maximizing the network lifetime by saving energy, and on the other, the ability to successfully deliver packets to the sink. In this paper, we investigate the suitability of several WSNs MAC protocols from different categories for low data rate WMSNs by analyzing the effect of some network parameters, such as the sampling rate and the density of multimedia sensors on the energy consumption of nodes. First, we develop a general multi-class traffic model that allows us to integrate different types of sensors with different sampling rates. Then, we model, evaluate and compare the energy consumption of MAC protocols numerically. We illustrate how the MAC protocols put some constraints on network parameters like the sampling rates, the number of nodes, the size of the multimedia sample and the density of multimedia nodes in order to make collisions negligible and avoid long queuing delays. Numerical results show that in asynchronous MAC protocols, the receiver-initiated MAC protocols (RI-MAC and PW-MAC) consume less energy than the sender-initiated ones (B-MAC and X-MAC). B-MAC outperforms X-MAC when the sampling rates of multimedia nodes is very low and the polling periods are short. PW-MAC shows the lowest energy consumption between the selected asynchronous MAC protocols and it can be used in the considered WMSNs with a wider range of sampling rates. Regarding synchronous MAC protocols, results also show that they are only suitable for the considered WMSNs when the data rates are very low. In that situation, TreeMAC is the one that offers the lowest energy consumption in comparison to L-MAC and T-MAC. Finally, we compare the energy consumption of MAC protocols in four selected application scenarios related to Smart Cities and environment monitoring.","authors":["Tarek Alskaif","Boris Bellalta","Manel Guerrero-Zapata","Jose M. Barcelo-Ordinas"],"meta":["March 2017Ad Hoc Networks 56:141-157","DOI:10.1016/j.adhoc.2016.12.005"],"references":["276070664_WSN-_and_IOT-Based_Smart_Homes_and_Their_Extension_to_Smart_Buildings","267201201_Receiver-Initiated_vs_Short-Preamble_Burst_MAC_Approaches_for_Multi-Channel_Wireless_Sensor_Networks","228674568_HBCI_Human-Building-Computer_Interaction","312451170_Elhanany_I_RL-MAC_A_QoS-Aware_Reinforcement_Learning_based_MAC_Protocol_for_Wireless_Sensor_Networks_Networking_Sensing_and_Control_2006","311785005_Advanced_FIB_Applications_in_Materials_Research_at_CanmetMATERIALS","309032447_RI-MAC_A_receiver-initiated_asynchronous_duty_cycle_MAC_protocol_for_dynamic_traffic_loads_in_wireless_sensor_networks","261231443_Real-time_multimedia_monitoring_in_large-scale_wireless_multimedia_sensor_networks_Research_challenges","260710169_The_Evaluation_of_MAC_Protocols_in_Wireless_Sensor_Networks_A_Survey","257674452_A_collaborative_node_management_scheme_for_energy-efficient_monitoring_in_wireless_multimedia_sensor_networks","251696275_QoS_for_wireless_sensor_networks_Enabling_service_differentiation_at_the_MAC_sub-layer_using_CoSenS"]}