{"id":"311611223_Secure_authentication_for_data_protection_in_cloud_computing_using_color_schemes","abstract":"Due increase in the usage of cloud based systems there is an increase in the amount of information on the cloud and as a result there is need for confidentiality. Most common method used for authentication is textual password. But these passwords are susceptible to shoulder surfing, dictionary attack, eavesdropping. Generally the passwords tend to follow patterns that are easier for attackers to guess. A literature survey shows that text-based password suffer this security problem. Pictographic passwords are provided as replacement to text based passwords. Pictographic passwords may prone to shoulder surfing. Pictographic passwords may suffer with the usability issue. This paper uses color code authentication which provides two step authentication to the user. Each time user logged in with generated one time password. This scheme is tested with different kinds of security attacks. User has to memorize only the sequence of three colors and three shades selected at the time of registration. This scheme is useful for secure authentication method for data protection on cloud.","authors":["Manish M. Potey","Chandrashekhar Dhote","Deepak Sharma"],"meta":["October 2016","DOI:10.1109/CSITSS.2016.7779398","Conference: 2016 International Conference on Computation System and Information Technology for Sustainable Solutions (CSITSS)"],"references":["228992539_Authentication_Schemes_for_Session_Passwords_Using_Color_and_Images","228596871_Are_Passfaces_More_Usable_Than_Passwords_A_Field_Trial_Investigation","221199752_A_Shoulder-Surfing_Resistant_Graphical_Password_Scheme_-_WIW","277793073_Authentication_Techniques_For_Engendering_Session_Passwords_Using_Colors_and_Texts","223526631_PassPoints_Design_and_longitudinal_evaluation_of_a_graphical_password_system","222678254_Is_a_picture_really_worth_a_thousand_words_Exploring_the_feasibility_of_graphical_authentication_systems","221260431_Graphical_Dictionaries_and_the_Memorable_Space_of_Graphical_Passwords","220944740_Design_and_evaluation_of_a_shoulder-surfing_resistant_graphical_password_scheme","2553717_Password_Security_A_Case_History","2385170_Hash_Visualization_in_User_Authentication","2243582_D_ej_a_Vu_A_User_Study_Using_Images_for_Authentication"]}