{"id":"311609095_System_Interaction_Patterns","abstract":"Interactions between systems are a necessity, a source of opportunity, and a source of difficulty and complication in building, implementing, and maintaining IT-reliant systems in organizations. This paper presents the new concept of \"system interaction patterns\", analogous to design patterns for software, but applicable to system interactions involving sociotechnical systems (where human participants perform some or all of the work) and/or totally automated systems (where machines perform all of the work). This idea emerged from ongoing research about developing a theory of system interactions that that spans social and technical disciplines ranging from organization and management science to computer science. That effort covers both intentional and unintentional interactions. It tries to encompass and integrate concepts such as interaction, interface, message, task interdependence, coordination, collaboration, modularity, coupling, and cohesion. This paper summarizes the need to develop a theory of system interactions and explains why the basic unit of analysis in that theory is an interaction between two work systems that are \"purposefully constructed activity systems.\" It identifies 19 system interaction patterns that are subdivided into 4 categories. It explains system interaction patterns in detail after noting that those patterns provide one of several ways to describe system interactions. Elements for describing a system interaction pattern include actor role, actor type, rights, responsibilities, cause or trigger, desired outcome, generic activities, interaction states, risk factors, byproducts, constraints, and evaluation. An outsourcing example illustrates a number of different system interaction patterns. The conclusion suggests potential applications and directions for further development.","authors":["Steven Alter"],"meta":["August 2016","DOI:10.1109/CBI.2016.11","Conference: 2016 IEEE 18th Conference on Business Informatics (CBI)"],"references":["262564046_Work_System_Theory_Overview_of_Core_Concepts_Extensions_and_Challenges_for_the_Future","232639551_The_Meaning_of_System_of_Systems","303007331_Loosely_Coupled_Systems_A_Reconceptualization","269518140_Beyond_the_organizational_'container'_Conceptualizing_21st_century_sociotechnical_work","258369646_Software_Architecture_Knowledge_Management","257158051_A_unified_description_language_for_human_to_automated_services","254078590_Reconceptualizing_Organizational_Routines_As_a_Source_of_Flexibility_and_Change","248493666_An_overview_of_social_engineering_malware_Trends_tactics_and_implications","242529843_A_language_perspective_on_the_design_of_cooperative_work","234804891_A_LanguageAction_Perspective_on_the_Design_of_Cooperative_Work"]}