{"id":"311695474_Modelling_of_multilayer_dielectric_filters_based_on_TiO2_SiO2_and_TiO2_MgF2_for_fluorescence_microscopy_imaging","abstract":"We report a design for creating multilayer dielectric optical filters based on TiO2 and SiO2/MgF2 alternating layers. We have selected Titanium dioxide (TiO2) for high refractive index (2.5), Silicon dioxide (SiO2) and Magnesium fluoride (MgF2) as a low refractive index layer (1.45 and 1.37) respectively. Miniaturized visible spectrometers are useful for quick and mobile characterization of biological samples. Such devices can be fabricated by using Fabry-Perot (FP) filters consisting of two highly reflecting mirrors with a central cavity in between. Distributed Bragg Reflectors (DBRs) consisting of alternating high and low refractive index material pairs are the most commonly used mirrors in FP filters, due to their high reflectivity. However, DBRs have high reflectivity for a selected range of wavelengths known as the stopband of the DBR. This range is usually much smaller than the sensitivity range of the spectrometer. Therefore, bandpass filters are required to restrict the wavelength outside the stopband of the FP DBRs. The proposed filter shows high quality with an average transmission of 97% within the passbands and the transmission outside the passband is around 3%. Special attention has been given to keep the thickness of the filters within the economic limits. It can be suggested that these filters are exceptionally promising for florescence imaging and narrow-band imaging endoscopy. © 2016, Institution of Russian Academy of Sciences. All rights reserved.","authors":["Ali Butt","S.A. Fomchenkov","Anayat Ullah","Mohsin Habib"],"meta":["January 2016Computer Optics 40(5):674-678","DOI:10.18287/2412-6179-2016-40-5-674-678","Project: Multilayer optical filters"],"references":["303072763_Simulation_of_Near_Infrared_Interference_Bandpass_Filters_for_Spectroscopic_Applications","225933472_Wide_bandpass_optical_filters_with_TiO2_and_Ta2O5","12387746_Fluorescence_Spectroscopy_of_Neoplastic_and_Non-Neoplastic_Tissues","289012946_Simulation_of_spectral_filters_used_in_hyperspectrometer_by_decomposition_on_vector_Bessel_modes","263290702_Noninvasive_two-photon_fluorescence_microscopy_imaging_of_mouse_retina_and_RPE_through_the_pupil_of_the_eye","258899842_Thin-Film_Optical_Filters","226266541_Modeling_Thin_Film_Multilayer_Broad-Band-Pass_Filters_in_Visible_Spectrum","225386776_Harnessing_the_guided-mode_resonance_to_design_nanooptical_transmission_spectral_filters","41714124_Complex_optical_filter_prepared_by_sputter_deposition","8008756_Two-photon_excitation_and_emission_spectra_of_the_green_fluorescent_protein_variants_ECFP_EGFP_and_EYFP"]}