{"id":"311670580_Big_Data_and_Data_Analytics_Research_From_Metaphors_to_Value_Space_for_Collective_Wisdom_in_Human_Decision_Making_and_Smart_Machines","abstract":"The Big Data and Data Analytics is a brand new paradigm, for the integration of Internet Technology in the human and machine context. For the first time in the history of the human mankind we are able to transforming raw data that are massively produced by humans and machines in to knowledge and wisdom capable of supporting smart decision making, innovative services, new business models, innovation, and entrepreneurship. For the Web Science research, this is a new methodological and technological spectrum of advanced methods, frameworks and functionalities never experienced in the past. At the same moment communities out of web science need to realize the potential of this new paradigm with the support of new sound business models and a critical shift in the perception of decision making. In this short visioning article, the authors are analyzing the main aspects of Big Data and Data Analytics Research and they provide their own metaphor for the next years. A number of research directions are outlined as well as a new roadmap towards the evolution of Big Data to Smart Decisions and Cognitive Computing. The authors do hope that the readers would like to react and to propose their own value propositions for the domain initiating a scientific dialogue beyond self-fulfilled expectations.","authors":["Miltiadis Lytras","Vijay v Raghavan","Ernesto Damiani"],"meta":["January 2017International journal on Semantic Web and information systems 13(1):1-10","DOI:10.4018/IJSWIS.2017010101","Project: Data Science Techniques and Applications"],"references":["286029790_Visual_knowledge_modeling_for_semantic_web_technologies_Models_and_ontologies","282622320_An_emerging_-_Social_and_emerging_computing_enabled_philosophical_paradigm_for_collaborative_learning_systems_Toward_high_effective_next_generation_learning_systems_for_the_knowledge_society"]}