{"id":"311617905_Construcao_de_Plataformas_Digitais_durante_o_Ensino_de_Engenharia_de_Software_um_Relato_de_Experiencia","abstract":"Teaching Software Engineering involves all the concepts of software production, exploring the different development processes and project management activities. During the teaching of this discipline, the main challenges are showing in practice the importance of the software engineering to the quality of the software produced, as well as keeping the students motivated. This paper reports the experience of adopting a theoretical and practical methodology for teaching of software engineering course from the Department of Computer Systems (ICMC/USP). The proposed methodology adopts the Capstone projects approach in which students developed digital platforms, in partnership with a startup. The methodology allowed the students to apply in practice the concepts regarding software engineering, realizing its importance and at the same time, creating real software products with high impact to the Brazilian society Resumo. O ensino de Engenharia de Software envolve todos os conceitos sobre construçconstruç˜construção de software, caracterizando os diferentes processos de desenvolvi-mento e as atividades de gestão de projetos. Durante o ensino dessa disciplina, os principais desafios são mostrar na prática o quanto que a Engenharia de Softwaré e importante para a qualidade do software produzido, como também manter os alunos motivados. Nesta direçdireç˜direção, este artigo relata a experiência em adotar uma metodologia teórico-prática durante o ensino da disciplina de Engenharia de Software para o curso de Engenharia de ComputaçComputaç˜Computação do Depar-tamento de Sistemas de ComputaçComputaç˜Computação do ICMC/USP. A metodologia proposta adota a abordagem Capstone projects na qual os alunos desenvolveram plata-formas digitais, com a parceria de uma startup. A metodologia permitiu que os alunos pudessem aplicar na prática os conceitos a respeito da Engenharia de Software, percebendo sua importância e, ao mesmo, tempo, gerando produtos de software reais e de impacto para a sociedade.","authors":["Simone Do Rocio Senger de Souza","Bruno H Oliveira","Filipe Grillo","Christian De Cico"],"meta":["September 2016","Conference: Fórum de Educação em Engenharia de Software (FEES 2016) - Simpósio Brasileiro de Engenharia de SoftwareVolume: 1"],"references":["341201763_Ambiente_integrado_como_apoio_ao_ensino_da_engenharia_de_software","288974090_The_agile_quality_culture_A_survey_on_agile_culture_and_software_quality","260649247_To_Game_or_Not_to_Game","301649394_Uma_Metodologia_para_o_Ensino_Teorico_e_Pratico_da_Engenharia_de_Software","242403407_Agile_Software_Development_With_Scrum","4009927_A_practical_approach_of_teaching_Software_Engineering","3943379_Foundation_software_engineering_practices_for_capstone_projects_and_beyond"]}