{"id":"311655427_Combined_aerial_and_terrestrial_images_for_complete_3D_documentation_of_Singosari_Temple_based_on_Structure_from_Motion_algorithm","abstract":"Singosaritemple is one of cultural heritage building in East Java, Indonesia which was built in 1300s and restorated in 1934-1937. Because of its history and importance, complete documentation of this temple is required. Nowadays with the advent of low cost UAVs combining aerial photography with terrestrial photogrammetry gives more complete data for 3D documentation. This research aims to make complete 3D model of this landmark from aerial and terrestrial photographs with Structure from Motion algorithm. To establish correct scale, position, and orientation, the final 3D model was georeferenced with Ground Control Points in UTM 49S coordinate system. The result shows that all facades, floor, and upper structures can be modeled completely in 3D. In terms of 3D coordinate accuracy, the Root Mean Square Errors (RMSEs) are RMSEx=0,041 m; RMSEy=0,031 m; RMSEz=0,049 m which represent 0.071 m displacement in 3D space. In addition the mean difference of lenght measurements of the object is 0,057 m. With this accuracy, this method can be used to map the site up to 1:237 scale. Although the accuracy level is still in centimeters, the combined aerial and terrestrial photographs with Structure from Motion algorithm can provide complete and visually interesting 3D model.","authors":["Husnul Hidayat","Agung B. Cahyono"],"meta":["November 2016IOP Conference Series Earth and Environmental Science 47(1):012004","DOI:10.1088/1755-1315/47/1/012004"],"references":["259216284_Using_Unmanned_Aerial_Vehicles_UAV_for_High-Resolution_Reconstruction_of_Topography_The_Structure_from_Motion_Approach_on_Coastal_Environments","228742204_A_3D_Model_of_Castle_Landenberg_CH_from_Combined_Photogrammetric_Processing_of_Terrestrial_and_UAV-based_Images","274677332_Comparison_of_laser_scanning_photogrammetry_and_SFM-MVS_pipeline_applied_in_structures_and_artificial_surfaces","256843452_'Structure-from-Motion'_photogrammetry_A_low-cost_effective_tool_for_geoscience_applications","236605301_Method_for_photogrammetric_surveying_of_archaeological_sites_with_light_aerial_platforms"]}