{"id":"311610986_Organizational_Agility_Key_Factors_for_Dynamic_Business_Process_Management","abstract":"For several years, Business Process Management (BPM) is recognized as a holistic management approach that promotes business effectiveness and efficiency. Increasingly, corporates find themselves, operating in business environments filled with unpredictable, complex and continuous change. Driven by these dynamic competitive conditions, they look for a dynamic management of their business processes to maintain their processes performance. To be competitive, companies have to respond quickly and nimbly to changing environment. One domain that has dominated the thinking of most managers from few years is organizational agility. It is considered as inescapable feature of today's forward-looking corporates. About 90% of executives surveyed by the Economist Intelligence Unit believe that organizational agility is critical for business success. Many researchers tried to define and characterize organizational agility according to their context and domain application. The first aim of this paper is to tighten and explicate a conceptualization of organizational agility that clarifies what it is and how it can be reached by proposing a framework that leads to improve organizational agility. The second aim of the current research is to suggest ideas on how to make business processes agile and what are the practices of organizational agility that can be transferred to BPM.","authors":["Wafa Triaa","Lilia Gzara","Herve Verjus"],"meta":["August 2016","DOI:10.1109/CBI.2016.16","Conference: 2016 IEEE 18th Conference on Business Informatics (CBI)"],"references":["289616104_Competing_through_organizational_agility","278006905_Understanding_Organizational_Agility_A_Work-Design_Perspective","263325506_The_development_and_partial_testing_of_the_psychometric_properties_of_a_measurement_scale_of_organizational_agility","327398178_Business_Process_Management_Systems_Strategy_and_Implementation","308857580_A_Framework_for_Embedding_Analytics_in_a_Business_Process","300757781_Dynamic_Capabilities","272958477_A_survey_on_the_level_of_Information_Technology_Acceptance_and_proposition_of_a_Comprehensive_model_The_Case_of_Nir_Pars_Company","265043205_Impact_of_Agile_Software_Development_on_Quality_within_Information_Technology_Organizations","264583485_The_Management_of_Manufacturing_Flexibility","248656667_Agile_project_management_with_SCRUM"]}