{"id":"311754620_Touch-based_admittance_control_of_a_robotic_arm_using_neural_learning_of_an_artificial_skin","abstract":"Touch perception is an important sense to model in humanoid robots to interact physically and socially with humans. We present a neural controller that can adapt the compliance of the robot arm in four directions using as input the tactile information from an artificial skin and as output the estimated torque for admittance control-loop reference. This adaption is done in a self-organized fashion with a neural system that learns first the topology of the tactile map when we touch it and associates a torque vector to move the arm in the corresponding direction. The artificial skin is based on a large area piezoresistive tactile device (ungridded) that changes its electrical properties in the presence of the contact. Our results show the self-calibration of a robotic arm (2 degrees of freedom) controlled in the four directions and derived combination vectors, by the soft touch on all the tactile surface, even when the torque is not detectable (force applied near the joint). The neural system associates each tactile receptive field with one direction and the correct force. We show that the tactile-motor learning gives better interactive experiments than the admittance control of the robotic arm only. Our method can be used in the future for humanoid adaptive interaction with a human partner.","authors":["Ganna Pugach","Artem A. Melnyk","Olga Tolochko","Alexandre Pitti"],"meta":["October 2016","DOI:10.1109/IROS.2016.7759519","Conference: 2016 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS)","Project: tactile sensors and artificial skin"],"references":["283245727_Neural_learning_of_the_topographic_tactile_sensory_information_of_an_artificial_skin_through_a_self-organizing_map","282148813_Learning_Torque_Control_in_Presence_of_Contacts_using_Tactile_Sensing_from_Robot_Skin","280945413_Learning_peripersonal_space_representation_through_artificial_skin_for_avoidance_and_reaching_with_whole_body_surface","280044866_Learning_Inverse_Dynamics_Models_with_Contacts","313161692_Adaptive_Switching_Circuits","312313711_Synergy_of_Tactile_and_Force_Sensing_for_Grasping_and_Safe_Human_Robot_interaction","278086253_Tactile_Interactions_with_a_Humanoid_Robot_Novel_Play_Scenario_Implementations_with_Children_with_Autism","273522997_Can_Real-Time_Adaptive_Human-Robot_Motor_Coordination_Improve_Humans'_Overall_Perception_of_a_Robot","267844037_Tactile_Sensing_for_Safe_Physical_Human-Robot_Interaction","265542253_Exploiting_the_gain-modulation_mechanism_in_parieto-motor_neurons_Application_to_visuomotor_transformations_and_embodied_simulation"]}