{"id":"311792799_Syntactic_versus_conceptual_lesson_plans_Towards_improving_middle_school_computer_science_curricula","abstract":"The advent of computers in our society has created the significant profession of computer programming, which is offered as a major in many colleges and universities. Accordingly, there has been much research on what is the most effective way to teach computer programming to college students and other adults. Two common methods include conceptual, where people are taught according to the principles behind programming concepts, and syntactic, where people are taught based on the rules or grammar of the programming language. Much research suggest that syntactic teaching leads to better learning in adults than does conceptual teaching. Nowadays, we find that even children are learning computer programming. Therefore, it is of interest to investigate whether a conceptual or syntactic teaching approach works better with younger learners. In the present project, 37 middle scholars were taught basic Java programming through either conceptual or syntactic instruction. The topics covered were for and while loops. Results showed that students taught using the syntactic method scored higher on a programming post-test than those taught using the conceptual methods. Further research would shed light on whether these results hold for other programming concepts or whether a hybrid approach may produce even stronger learning.","authors":["Shaan Bhandarkar","John Leddo","Siddharth Lakkoju","Surya Somayyajula"],"meta":["December 2016","DOI:10.1145/2160000/2157319"],"references":["235190346_Integrated_Knowledge_Elicitation_and_Representation_Framework","220091249_SyntacticSemantic_Interactions_in_Programmer_Behavior_A_Model_and_Experimental_Results","43980369_A_Conceptual_Framework_for_Analyzing_Students'_Knowledge_of_Programming","2551403_Teaching_Objects-first_In_Introductory_Computer_Science","254006887_What_do_students_learn_about_programming_from_game_music_video_and_storytelling_projects","247767835_The_Architecture_Of_Cognition","222216806_Modeling_and_coaching_of_relevant_metacognitive_strategies_for_enhancing_university_students'_learning","200085837_Learning_and_Teaching_Programming_A_Review_and_Discussion"]}