{"id":"311769868_Semi-device-independent_framework_based_on_natural_physical_assumptions","abstract":"The semi-device-independent approach provides a framework for prepare-and-measure quantum protocols using devices whose behavior must not be characterized nor trusted, except for a single assumption on the dimension of the Hilbert space characterizing the quantum carriers. Here, we propose instead to constrain the quantum carriers through a bound on the mean value of a well-chosen observable. This modified assumption is physically better motivated than a dimension bound and closer to the description of actual experiments. In particular, we consider quantum optical schemes where the source emits quantum states described in an infinite-dimensional Fock space and model our assumption as an upper bound on the average photon number in the emitted states. We characterize the set of correlations that may be exhibited in the simplest possible scenario compatible with our new framework, based on two energy-constrained state preparations and a two-outcome measurement. Interestingly, we uncover the existence of quantum correlations exceeding the set of classical correlations that can be produced by devices behaving in a purely pre-determined fashion (possibly including shared randomness). This feature suggests immediate applications to certified randomness generation. Along this line, we analyze the achievable correlations in several prepare-and-measure optical schemes with a mean photon number constraint and demonstrate that they allow for the generation of certified randomness. Our simplest optical scheme works by the on-off keying of an attenuated laser source followed by photocounting. It opens the path to more sophisticated energy-constrained semi-device-independent quantum cryptography protocols, such as quantum key distribution.","authors":["Thomas Van Himbeeck","Erik Woodhead","N. J. Cerf","Raul Garcia-Patron"],"meta":["December 2016Quantum 1","DOI:10.22331/q-2017-11-18-33"],"references":["311769932_High-rate_semi-device-independent_quantum_random_number_generators_based_on_unambiguous_state_discrimination","309607100_Device-independent_randomness_generation_from_several_Bell_estimators","277333600_Device-Independent_Tests_of_Entropy","273067167_Generating_the_Local_Oscillator_Locally_in_Continuous-Variable_Quantum_Key_Distribution_Based_on_Coherent_Detection","266798528_Self-Testing_Quantum_Random_Number_Generator","305006987_Simple_and_Tight_Device-Independent_Security_Proofs","280033897_Secrecy_in_Prepare-and-Measure_Clauser-Horne-Shimony-Holt_Tests_with_a_Qubit_Bound","269117043_Bounding_the_Set_of_Finite_Dimensional_Quantum_Correlations","261914888_Certifying_the_Dimension_of_Classical_and_Quantum_Systems_in_a_Prepare-and-Measure_Scenario_with_Independent_Devices","260022695_Robust_protocols_for_securely_expanding_randomness_and_distributing_keys_using_untrusted_quantum_devices"]}