{"id":"311774649_Maximizing_gender_equality_in_STEM_by_minimizing_course_choice_options_Effects_of_obligatory_coursework_in_math_on_gender_differences_in_STEM","abstract":"Math achievement, math self-concept, and vocational interests are critical predictors of STEM careers and are closely linked to high school coursework. Young women are less likely to choose advanced math courses in high school, and encouraging young women to enroll in advanced math courses may therefore bring more women into STEM careers. We looked at a German statewide educational reform that required all students to take advanced math courses and examined differential effects of the reform on young men and women’s math achievement, math self-concept, vocational interests, and field of study at university. We compared data from 4,730 students before the reform and 4,715 students after the reform. We specified multiple regression models and tested main effects of gender and cohort as well as the effect of the Cohort × Gender interaction on all outcomes. All outcomes showed clear gender differences favoring young men before the reform. However, the reform was associated with different effects for young men and women: Whereas gender differences in math achievement were smaller after the reform, differences between young men and women in math self-concept and realistic and investigative vocational interests were larger after the reform than before. Gender differences in the field of study at university did not differ between before and after the reform. Results suggest that reducing course choice options in high school does not automatically increase gender equality in STEM fields.","authors":["Nicolas Hübner","Eike Wille","Jenna Cambria","Kerstin Oschatz"],"meta":["March 2017Journal of Educational Psychology 109(7):993-1009","DOI:10.1037/edu0000183"],"references":["292091130_On_the_Unnecessary_Ubiquity_of_Hierarchical_Linear_Modeling","313428146_The_Effect_Size_Index_d_Statistical_Power_Analysis_for_the_Behavioral_Sciences","303030831_Evidence_for_a_positive_relation_between_interest_and_achievement_Examining_between-person_and_within-person_variation_in_five_domains","302972832_Construct_Meaning_in_Multilevel_Settings","302412362_Upgrading_High_School_Mathematics_Instruction_Improving_Learning_Opportunities_for_Low-Achieving_Low-Income_Youth","302403246_Learning_from_Experience_Lessons_from_Policy_Implementation","293091950_Do_teenagers_want_to_become_scientists_a_comparison_of_gender_differences_in_attitudes_toward_science_career_expectations_and_academic_skill_across_29_countries","293091515_Predicting_career_aspirations_and_university_majors_from_academic_ability_and_self-concept_A_longitudinal_application_of_the_internal-external_frame_of_reference_model","289963477_Interest_as_a_predictor_of_academic_achievement_A_meta-analysis_of_research","289517458_State_of_the_Art_of_Time_Effectiveness"]}