{"id":"311784373_Gene_expression_based_cancer_classification","abstract":"Cancer classification based on molecular level investigation has gained the interest of researches as it provides a systematic, accurate and objective diagnosis for different cancer types. Several recent researches have been studying the problem of cancer classification using data mining methods, machine learning algorithms and statistical methods to reach an efficient analysis for gene expression profiles.\nStudying the characteristics of thousands of genes simultaneously offered a deep insight into cancer classification problem. It introduced an abundant amount of data ready to be explored. It has also been applied in a wide range of applications such as drug discovery, cancer prediction and diagnosis which is a very important issue for cancer treatment. Besides, it helps in understanding the function of genes and the interaction between genes in normal and abnormal conditions. That is done by monitoring the behavior of genes -gene expression data- under different conditions.\nIn this paper, an effective ensemble approach is proposed. Ensemble classifiers increase not only the performance of the classification, but also the confidence of the results. The motivations beyond using ensemble classifiers are that the results are less dependent on peculiarities of a single training set and because the ensemble system outperforms the performance of the best base classifier in the ensemble.","authors":["Sara Tarek","Reda El-Khoribi","Mahmoud Ahmed ismail Shoman"],"meta":["December 2016Egyptian Informatics Journal 18(3)","DOI:10.1016/j.eij.2016.12.001"],"references":["234795338_Simulation_Modeling_of_Secure_Wireless_Sensor_Networks","228861739_Machine_Learning_Benchmarks_and_Random_Forest_Regression","228746091_Performance_of_Error_Estimators_for_Classification","220484930_Supervised_Feature_Selection_via_Dependence_Estimation","24356070_Is_Bagging_Effective_in_the_Classification_of_Small-Sample_Genomic_and_Proteomic_Data","12938746_Alon_U_Barkai_N_Notterman_DA_Gish_K_Ybarra_S_Mack_D_Levine_AJBroad_patterns_of_gene_expression_revealed_by_clustering_analysis_of_tumor_and_normal_colon_tissues_probed_by_oligonucleotide_arrays_Proc_N","311672812_Is_cross-validation_valid_for_small-sample_microarray_classification","258111454_Feature_Selection_and_Ensemble_Methods_for_Bioinformatics_Algorithmic_Classification_and_Implementations","245589343_Broad_patterns_of_gene_expression_revealed_by_clustering_analysis_of_tumor_and_normal_colon_tissues","220344030_Gene_Selection_for_Cancer_Classification_Using_Support_Vector_Machines"]}