{"id":"311760739_Are_the_expected_benefits_of_requirements_reuse_hampered_by_distance_An_experiment","abstract":"Background: \nSoftware development processes are often performed by distributed teams which may be separated by great distances. Global software development (GSD) has undergone a significant growth in recent years. The challenges concerning GSD are especially relevant to requirements engineering (RE). Stakeholders need to share a common ground, but there are many difficulties as regards the potentially variable interpretation of the requirements in different contexts. We posit that the application of requirements reuse techniques could alleviate this problem through the diminution of the number of requirements open to misinterpretation.\n\nResults: \nThis paper presents a reuse-based approach with which to address RE in GSD, with special emphasis on specification techniques, namely parameterised requirements and traceability relationships. An experiment was carried out with the participation of 29 university students enrolled on a Computer Science and Engineering course. Two main scenarios that represented co-localisation and distribution in software development were portrayed by participants from Spain and Morocco. The global teams achieved a slightly better performance than the co-located teams as regards effectiveness, which could be a result of the worse productivity of the global teams in comparison to the co-located teams. Subjective perceptions were generally more positive in the case of the distributed teams (difficulty, speed and understanding), with the exception of quality.\n\nConclusions: \nA theoretical model has been proposed as an evaluation framework with which to analyse, from the point of view of the factor of distance, the effect of requirements specification techniques on a set of performance and perception-based variables. The experiment utilised a new internationalisation requirements catalogue. None of the differences found between co-located and distributed teams were significant according to the outcome of our statistical tests. The well-known benefits of requirements reuse in traditional co-located projects could, therefore, also be expected in GSD projects.","authors":["Juan Manuel Carrillo de Gea","Joaquín Nicolás Ros","José Luis Fernández-Alemán","Ambrosio Toval"],"meta":["December 2016SpringerPlus 5(1)","DOI:10.1186/s40064-016-3782-0"],"references":["289526490_Reusing_Functional_Software_Requirements_in_Small-sized_Software_Enterprises_A_Model_oriented_to_the_Catalog_of_Requirements","287002917_Eight_key_issues_for_an_effective_reuse-based_requirements_process","319394831_Questionnaire_Design_Interviewing_and_Attitude_Measurement","317577513_Automatic_Detection_of_Nocuous_Ambiguities_in_Natural_Language_Requirements","316800454_The_Kluwer_International_Series_in_Software_Engineering","297736127_Co-located_and_distributed_natural-language_requirements_specification_Traditional_versus_reuse-based_techniques","285813809_An_Empirical_Study_of_Speed_and_Communication_in_Gloabally-Distributed_Software_Development","282477079_Effects_of_Using_Requirements_Catalogs_on_Effectiveness_and_Productivity_of_Requirements_Specification_in_a_Software_Project_Management_Course","281672193_Can_method_data_dependencies_support_the_assessment_of_traceability_between_requirements_and_source_code","271923389_Reuse_of_requirements_reduced_time_to_market_at_one_industrial_shop_a_case_study"]}