{"id":"311711876_Evolution_in_the_number_of_authors_of_computer_science_publications","abstract":"This article analyses the evolution in the number of authors of scientific publications in computer science (CS). This analysis is based on a framework that structures CS into 17 constituent areas, proposed by Wainer et al. (Commun ACM 56(8):67–63, 2013), so that indicators can be calculated for each one in order to make comparisons. We collected and mined over 200,000 article references from 81 conferences and journals in the considered CS areas, spanning a 60-year period (1954–2014). The main insights of this article are that all CS areas witness an increase in the average number of authors, in every decade, with just one slight exception. We ordered the article references by number of authors, in ascending chronological order and grouped them into decades. For each CS area, we provide a perspective of how many groups (1-author papers, 2-author papers and so on) must be considered to reach certain proportions of the total for that CS area, e.g., the 90th and 95th percentiles. Different CS areas require different number of groups to reach those percentiles. For all 17 CS areas, an analysis of the point in time in which publications with n + 1 authors overtake the publications with n authors is presented. Finally, we analyse the average number of authors and their rate of increase.","authors":["João M. Fernandes","Miguel P. Monteiro"],"meta":["December 2016Scientometrics 110(2):1-11","DOI:10.1007/s11192-016-2214-9"],"references":["284563030_Highly-cited_papers_in_software_engineering_The_top-100","271630732_Authorship_trends_in_software_engineering","262369291_How_Productivity_and_Impact_Differ_Across_Computer_Science_Subareas","220613240_Invited_Report_Assessing_the_Research_and_Education_Quality_of_the_Top_Brazilian_Computer_Science_Graduate_Programs","262215491_Computer_science_research_More_production_less_productivity","234386072_Some_Trends_in_American_Astronomical_Publications","220538657_DBLP_-_Some_lessons_learned","220435195_Collaboration_in_Computer_Science_A_Network_Science_Approach","220432690_An_exploratory_study_of_Malaysian_publication_productivity_in_computer_science_and_information_technology","220427167_Gender_and_Computing_Conference_Papers"]}