{"id":"311739432_A_neuro-based_method_for_detecting_context-dependent_erroneous_robot_action","abstract":"Validating appropriateness and naturalness of human-robot interaction (HRI) is commonly performed by taking subjective measures from human interaction partners, e.g. questionnaire ratings. Although these measures can be of high value for robot designers, they are very sensitive and can be inaccurate and/or biased. In this paper we propose and validate a neuro-based method for objectively validating robot behavior in HRI. We propose to detect from the electronencephalo-gram (EEG) of a human interaction partner, the perception of inappropriate / unexpected / erroneous robot behavior. To validate this method, we conducted an EEG experiment with a simplified HRI protocol in which a humanoid robot displayed context-dependent erroneous behavior from time to time. The EEG data taken from 13 participants revealed biologically plausible error-related potentials (ErrP) whose spatio-temporal distributions match well with related neuroscientific research. We further demonstrate that perceived erroneous robot action can reliably be modeled and detected from human EEG signals with classification accuracies on avg. 69.7±9.1%. These findings confirm principal feasibility of the proposed method and suggest that EEG-based ErrP detection can be used for quantitative evaluation and thus improvement of robot behavior.","authors":["Stefan K. Ehrlich","Gordon Cheng"],"meta":["November 2016","DOI:10.1109/HUMANOIDS.2016.7803318","Conference: IEEE-RAS International Conference on Humanoid Robots 2016","Projects: NeuroEngineering/NeuroroboticsNeuro-adaptive human-robot interaction using error-related potentials"],"references":["312854561_EEGLAB_an_open_source_toolbox_for_analysis_of_single-trial_EEG_dynamics","299538643_Classifying_Response_Correctness_across_Different_Task_Sets_A_Machine_Learning_Approach","281640392_Teaching_brain-machine_interfaces_as_an_alternative_paradigm_to_neuroprosthetics_control","281616925_When_to_engage_in_interaction_-_And_how_EEG-based_enhancement_of_robot's_ability_to_sense_social_signals_in_HRI","273278100_Error-related_potentials_during_continuous_feedback_Using_EEG_to_detect_errors_of_different_type_and_severity","259560244_Neurophysiology_of_Performance_Monitoring_and_Adaptive_Behavior","256821939_Regularised_Discriminant_Analysis","254286896_Regularized_Discriminant_Analysis","225227590_On_the_use_of_interaction_error_potentials_for_adaptive_brain_computer_interfaces","222707022_ERP_components_on_reaction_errors_and_their_functional_significance_A_tutorial"]}