{"id":"311707026_Evaluating_CBR_Similarity_Functions_for_BAM_Switching_in_Networks_with_Dynamic_Traffic_Profile","abstract":"In an increasingly complex scenario for network management, a solution that allows configuration in more autonomous way with less intervention of the network manager is expected. This paper presents an evaluation of similarity functions that are necessary in the context of using a learning strategy for finding solutions. The learning approach considered is based on Case-Based Reasoning (CBR) and is applied to a network scenario where different Bandwidth Allocation Models (BAMs) behaviors are used and must be eventually switched looking for the best possible network operation. In this context, it is required to identify and configure an adequate similarity function that will be used in the learning process to recover similar solutions previously considered. This paper introduces the similarity functions, explains the relevant aspects of the learning process in which the similarity function plays a role and, finally, presents a proof of concept for a specific similarity function adopted. Results show that the similarity function was capable to get similar results from the existing use case database. As such, the use of similarity functions with CBR technique has proved to be potentially satisfactory for supporting BAM switching decisions mostly driven by the dynamics of input traffic profile.","authors":["Eliseu M Oliveira","Rafael Freitas Reale","Joberto S B Martins"],"meta":["January 2017","Conference: 5th International Workshop on ADVANCEs in ICT Infrastructure and ServicesAt: Évry University - Paris - France","Project: RePAF- A Dynamic and Autonomic Resource Allocation Framework for MPLS, Elastic Optical Networks (EON), Network Function Virtualization (NFV) and IoT"],"references":["261451978_Routing_in_DS-TE_Networks_with_an_Opportunistic_Bandwidth_Allocation_Model","225070522_Case-Based_Reasoning_Foundational_Issues_Methodological_Variations_and_System_Approaches","221430530_AllocTC-sharing_A_new_bandwidth_allocation_model_for_DS-TE_networks","4334135_A_Sense_and_React_Plane_Structured_Autonomic_Model_Suitable_for_Quality_of_Service_QoS_Management","247437757_Russian_Dolls_Bandwidth_Constraints_Model_for_Diff-Serv-aware_MPLS_Traffic_Engineering","242481356_Maximum_Allocation_Bandwidth_Constraints_Model_for_Diffserv-aware_MPLS_Traffic_Engineering","242473610_Requirements_for_Support_of_Differentiated_Services-aware_MPLS_Traffic_Engineering","228681090_Highly_interactive_distributed_visualization"]}