{"id":"311729097_Planning_and_organisation_of_teachers'_Continuous_Professional_Development_in_schools_in_England","abstract":"This article focuses on the planning and organisation of teachers’ continuous professional development as part of the nationally representative Schools and Continuing Professional Development in England – State of the Nation research study (SoNS), commissioned by the Training and Development Agency for Schools (TDA). Thematic analysis of data developed from the literature review, qualitative research, and survey strands of the SoN study led to the identification of four issues related to the planning and organisation of CPD in schools in England: (1) there is a lack of strategic planning of CPD provision to balance effectively between individual and organisational learning needs and national policy priorities; (2) organisational choices made in schools about roles and responsibilities do not always support or help to develop effective CPD planning and provision; (3) little progress has been made in the promotion of the New Professionalism in schools through developing closer alignment between Professional Standards, Performance Management and CPD; (4) school systems and processes for evaluating the effectiveness of CPD provision tend to be developed without reference to planned outcomes, specific criteria or value for money judgements. The article concludes with a number of recommendations for policy and practice.","authors":["David Pedder","V Darleen Opfer"],"meta":["December 2011Curriculum Journal 22(4):611-612","DOI:10.1080/09585176.2011.630818","Project: Schools and CPD State of the Nation Study"],"references":["254251835_'Schools_and_Continuing_Professional_Development_in_England_-_State_of_the_Nation'_research_study_Policy_context_aims_and_design","240530678_Organizational_conditions_that_foster_successful_classroom_promotion_of_Learning_How_to_Learn","240530676_How_teachers_value_and_practise_professional_learning","233643931_Organisational_learning_approaches_to_school_leadership_and_management_Teachers'_values_and_perceptions_of_practice","233162719_The_lost_promise_of_teacher_professional_development_in_England","47365020_The_state_of_the_nation_in_CPD_A_literature_review","292852250_School_inspection_and_self-evaluation_Working_with_the_new_relationship","292804413_The_intelligent_school_second_edition","268332341_The_Fifth_Discipline_The_Art_Practice_of_The_Learning_Organization","220041976_Organisational_Learning_A_Theory_of_Action_Perspective"]}