{"id":"311739804_Model_and_Event_Log_Reductions_to_Boost_the_Computation_of_Alignments","abstract":"The alignment of observed and modeled behavior is a piv-otal issue in process mining because it opens the door for assessing the quality of a process model, as well as the usage of the model as a precise predictor for the execution of a process. This paper presents a novel technique for reduction of a process model based on the notion of indication, by which, the occurrence of an event in the model reveals the occurrence of some other events, hence relegating the later set as less important information when model and log alignment is computed. Once indications relations are computed in the model, both model and log can be reduced accordingly, and then fed to the state of the art approaches for computing alignments. Finally, the (macro)-alignment derived is expanded in these parts containning high-level events that represent a set of indicated events, by using an efficient algorithm taken from bioinformatics that guarantees optimality in the local parts of the alignment. The implementation of the presented techniques shows a significant reduction both in computation time and in memory usage, the latter being a significant barrier to apply the alignment technology on large instances.","authors":["Farbod Taymouri","Josep Carmona"],"meta":["December 2016","Conference: SIMPDA","Project: COMMAS"],"references":["307909469_A_Recursive_Paradigm_for_Aligning_Observed_Behavior_of_Large_Structured_Process_Models","303860550_Merging_Alignments_for_Decomposed_Replay","262077044_Measuring_precision_of_modeled_behavior","228751020_Simplified_Computation_and_Generalization_of_the_Refined_Process_Structure_Tree","225167327_The_Refined_Process_Structure_Tree","220923545_Simplified_Computation_and_Generalization_of_the_Refined_Process_Structure_Tree","344487291_Building_Occurrence_Nets_from_Reveals_Relations","262214396_Prime_subprogram_parsing_of_a_program","262017357_Single-Entry_Single-Exit_Decomposed_Conformance_Checking","224303523_Unfold_and_Cover_Qualitative_Diagnosability_for_Petri_Nets"]}