{"id":"311789836_New_Discrete_Time_2D_Chaotic_Maps","abstract":"Chaotic behavior is a term that is attributed to dynamical systems whose solutions are highly sensitive to initial conditions. This means that small perturbations in the initial conditions can lead to completely different trajectories in the solution space. These types of chaotic dynamical systems arise in various natural or artificial systems in biology, meteorology, economics, electrical circuits, engineering, computer science and more. Of these innumerable chaotic systems, perhaps the most interesting are those that exhibit attracting behavior. By that, the authors refer to systems whose trajectories converge with time to a set of values, called an attractor. This can be a single point, a curve or a manifold. The attractor is called strange if it is a set with fractal structure. Such systems can be both continuous and discrete. This paper reports on some new chaotic discrete time two dimensional maps that are derived from simple modifications to the well-known Hénon, Lozi, Sine-sine and Tinkerbell maps. Numerical simulations are carried out for different parameter values and initial conditions and it is shown that the mappings either diverge to infinity or converge to attractors of many different shapes.","authors":["Lazaros Moysis","Ahmad Taher Azar"],"meta":["January 2017International Journal of System Dynamics Applications 6(1):77-104","DOI:10.4018/IJSDA.2017010105"],"references":["304676717_A_New_Hybrid_Synchronization_Type_Between_Arbitrary_Hyperchaotic_Maps","314643047_Adaptive_and_Evolutionary_Systems","305279144_A_new_type_of_hybrid_synchronization_between_arbitrary_hyperchaotic_maps","303519472_A_New_Fractional_Hybrid_Chaos_Synchronization","303432572_Takagi-Sugeno_Fuzzy_Logic_Controller_for_Liu-Chen_Four-Scroll_Chaotic_System","301547028_Fuzzy_Adaptive_Synchronization_of_Uncertain_Fractional-Order_Chaotic_Systems","301336121_Adaptive_Backstepping_Control_and_Synchronization_of_a_Novel_3-D_Jerk_System_with_an_Exponential_Nonlinearity","301336120_Qualitative_Study_and_Adaptive_Control_of_a_Novel_4-D_Hyperchaotic_System_with_Three_Quadratic_Nonlinearities","301336119_Dynamic_Analysis_Adaptive_Feedback_Control_and_Synchronization_of_An_Eight-Term_3-D_Novel_Chaotic_System_with_Three_Quadratic_Nonlinearities","301335963_Fuzzy_Control-Based_Function_Synchronization_of_Unknown_Chaotic_Systems_with_Dead-Zone_Input"]}