{"id":"311736915_Fast_Matrix_Multiplication_and_Symbolic_Computation","abstract":"The complexity of matrix multiplication (hereafter MM) has been intensively studied since 1969, when Strassen surprisingly decreased the exponent 3 in the cubic cost of the straightforward classical MM to log 2 (7) $\\approx$ 2.8074. Applications to some fundamental problems of Linear Algebra and Computer Science have been immediately recognized, but the researchers in Computer Algebra keep discovering more and more applications even today, with no sign of slowdown. We survey the unfinished history of decreasing the exponent towards its information lower bound 2, recall some important techniques discovered in this process and linked to other fields of computing, reveal sample surprising applications to fast computation of the inner products of two vectors and summation of integers, and discuss the curse of recursion, which separates the progress in fast MM into its most acclaimed and purely theoretical part and into valuable acceleration of MM of feasible sizes. Then, in the second part of our paper, we cover fast MM in realistic symbolic computations and discuss applications and implementation of fast exact matrix multiplication. We first review how most of exact linear algebra can be reduced to matrix multiplication over small finite fields. Then we highlight the differences in the design of approximate and exact implementations of fast MM, taking into account nowadays processor and memory hierarchies. In the concluding section we comment on current perspectives of the study of fast MM.","authors":["Jean-Guillaume Dumas","Victor Pan"],"meta":["December 2016"],"references":["315365781_Strassen's_Algorithm_Reloaded","303448683_On_cap_sets_and_the_group-theoretic_approach_to_matrix_multiplication","300576269_Fast_Matrix_Multiplication","312463973_Duality_applied_to_the_complexity_of_matrix_multiplication_and_other_bilinear_form","311474037_Solving_structured_linear_systems_of_large_displacement_rank","305455818_Fast_Computation_of_Shifted_Popov_Forms_of_Polynomial_Matrices_via_Systems_of_Modular_Polynomial_Equations","305455671_Computing_with_Quasiseparable_Matrices","305455670_Faster_LLL-type_Reduction_of_Lattice_Bases","305455601_Algorithms_for_Simultaneous_Pade_Approximations","305275849_On_the_arithmetic_complexity_of_Strassen-like_matrix_multiplications"]}