{"id":"311825391_Toward_a_Rational_and_Mechanistic_Account_of_Mental_Effort","abstract":"In spite of its familiar phenomenology, the mechanistic basis for mental effort remains poorly understood. Although most researchers agree that mental effort is aversive and stems from limitations in our capacity to exercise cognitive control, it is unclear what gives rise to those limitations and why they result in an experience of control as costly. The presence of these control costs also raises further questions regarding how best to allocate mental effort to minimize those costs and maximize the attendant benefits. This review explores recent advances in computational modeling and empirical research aimed at addressing these questions at the level of psychological process and neural mechanism, examining both the limitations to mental effort exertion and how we manage those limited cognitive resources. We conclude by identifying remaining challenges for theoretical accounts of mental effort as well as possible applications of the available findings to understanding the causes of and potential solutions for apparent failures to exert the mental effort required of us.","authors":["Amitai Shenhav","Sebastian Musslick","Falk Lieder","Wouter Kool"],"meta":["January 2017Annual Review of Neuroscience 40(1)","DOI:10.1146/annurev-neuro-072116-031526","Projects: Expected Value of Cognitive ControlCognitive Control Costs"],"references":["327979382_A_Multilab_Preregistered_Replication_of_the_Ego-Depletion_Effect","312125287_A_Computational_Model_of_Control_Allocation_based_on_the_Expected_Value_of_Control","311623903_Monitoring_Demands_for_Executive_Control_Shared_Functions_between_Human_and_Nonhuman_Primates","345843924_Speed_of_information_processing_and_population_differences","339630594_The_waste_disposal_problem_of_effortful_control","325671755_Conflict_monitoring_and_cognitive_control","321198647_Cognitive_and_emotional_influences_in_anterior_cingulate_cortex","320273894_Cascade_of_neural_processing_orchestrates_cognitive_control_in_human_frontal_cortex","313723562_Learning_to_use_working_memory_in_partially_observable_environments_through_dopaminergic_reinforcement","312449300_Processing_resources_in_attention"]}