{"id":"311807405_Enhancing_existing_e-learning_systems_by_single_and_group_recommendations","abstract":"The personalised recommendations are used routinely in today's e-learning systems especially in computer science and engineering domains. Students' personal characteristics that influence learning styles and collaboration, well accepted in education domain are generally omitted in the domain of recommendation. We propose a methodology for enhancing existing e-learning systems with personalised recommendations for learning groups (including groups formations based on the learning styles). For the evaluation we investigate computer science and engineering students' learning styles and distribution of personality characteristics in order to better understand their behaviour and needs in such a system. As an example usage of the proposed methodology we present an extension of existing e-learning system in the domain of programming by considering learning styles and group collaboration. As the result of proposed methodology, students reached statistically significant improvement of their knowledge level when learning in groups using proposed recommendation approach and groups formation (considering students' learning styles).","authors":["Michal Kompan","Maria Bielikova"],"meta":["December 2016International Journal of Continuing Engineering Education and Life-Long Learning 26(4):386-404","DOI:10.1504/IJCEELL.2016.080980"],"references":["312470401_Learningteaching_styles_in_engineering_education","309120076_Learning_and_teaching_styles_in_engineering_education_Engr","293098567_Using_learning_styles_to_enhance_an_e-learning_system","285826919_An_approach_to_adaptive_e-learning_hypermedia_system_based_on_learning_styles_AEHS-LS_Implementation_and_evaluation","345933020_A_Contribution_To_Validation_Of_Score_Meaning_For_Felder_Soloman's_Index_Of_Learning_Styles","320827615_Reflections_on_educational_technology_research_and_development","307791911_AHA_The_adaptive_hypermedia_architecture","288442152_Am_I_Extravert_or_Introvert_Considering_the_Personality_Effect_Toward_e-Learning_System","286535385_Effective_Trust-aware_E-learning_Recommender_System_based_on_Learning_Styles_and_Knowledge_Levels","286002312_Group_Problem_Solving"]}