{"id":"311879391_How_gamification_motivates_An_experimental_study_of_the_effects_of_specific_game_design_elements_on_psychological_need_satisfaction","abstract":"The main aim of gamification, i.e. the implementation of game design elements in real-world contexts for non-gaming purposes, is to foster human motivation and performance in regard to a given activity. Previous research, although not entirely conclusive, generally supports the hypothesis underlying this aim. However, previous studies have often treated gamification as a generic construct, neglecting the fact that there are many different game design elements which can result in very diverse applications. Based on a self-determination theory framework, we present the results of a randomized controlled study that used an online simulation environment. We deliberately varied different configurations of game design elements, and analysed them in regard to their effect on the fulfilment of basic psychological needs. Our results show that badges, leaderboards, and performance graphs positively affect competence need satisfaction, as well as perceived task meaningfulness, while avatars, meaningful stories, and teammates affect experiences of social relatedness. Perceived decision freedom, however, could not be affected as intended. We interpret these findings as general support for our main hypothesis that gamification is not effective per se, but that specific game design elements have specific psychological effects. Consequences for further research, in particular the importance of treatment checks, are discussed.","authors":["Michael Sailer","Jan Ulrich Hense","Sarah Mayr","Heinz Mandl"],"meta":["April 2017Computers in Human Behavior 69:371-380","DOI:10.1016/j.chb.2016.12.033"],"references":["304380407_Gamification_State_of_the_art_definition_and_utilization","303863429_Learning_in_or_with_games_Quality_criteria_for_digital_learning_games_from_the_perspectives_of_learning_emotion_and_motivation_theory","303018696_Gamification_Toward_a_definition","291853292_Learning_in_or_with_Games","316807278_Intrinsic_Motivation_and_Self-Determination_in_Human_Behavior","311885294_Towards_an_integration_of_communication_and_simulation","304925760_Communication_and_Simulation_From_Two_Fields_to_One_Theme","303169056_An_overview_of_self-determination_theory_An_organismic_dialectical_perspective","301212086_A_RECIPE_for_Meaningful_Gamification","287563281_Motivation_Personality_and_Development_Within_Embedded_Social_Contexts_An_Overview_of_Self-Determination_Theory"]}