{"id":"311863296_A_computational_framework_for_ptychographic_reconstructions","abstract":"Ptychography is now a well-established X-ray microscopy tool for synchrotron end-stations equipped with a scanning stage and a pixelated detector. Ptychographic phasing algorithms use information from coherent diffraction to deliver quantitative images of the specimen at a resolution higher than the scanning resolution. These algorithms have traditionally been implemented in software on a per-instrument basis in various degrees of user-friendliness and sophistication. Here, we present Ptypy, a ptychography software written with the intention to serve as a framework across the diverse sets of available instruments and usage cases. A distinctive feature of the software is its formalism, which provides a convenient abstraction of the physical model, thus allowing for concise algorithmic implementations and portability across set-up geometries. We give an overview of the supported usage cases, explain the abstraction layer and design principles, and provide a step-by-step guide describing how an algorithm may be realized in a concise and readable manner. The software capabilities are illustrated with reconstructions from visible light and X-ray data.","authors":["Björn Enders","P. Thibault"],"meta":["December 2016Proceedings of The Royal Society A Mathematical Physical and Engineering Sciences 472(2196):20160640","DOI:10.1098/rspa.2016.0640"],"references":["301854662_SHARP_a_distributed_GPU-based_ptychographic_solver","277915906_Strain_in_a_silicon-on-insulator_nanostructure_revealed_by_3D_x-ray_Bragg_ptychography","275951823_X-ray_nanotomography_using_near-field_ptychography","272755052_Continuous_motion_scan_ptychography_Characterization_for_increased_speed_in_coherent_X-ray_imaging","271516493_X-Ray_Near-Field_Ptychography_for_Optically_Thick_Specimens","269872317_On-the-fly_scans_for_X-ray_ptychography","265416301_Chemical_composition_mapping_with_nanometre_resolution_by_soft_X-ray_microscopy","263122521_Semi-transparent_central_stop_in_high-resolution_X-ray_ptychography_using_Kirkpatrick-Baez_focusing","272187570_Simultaneous_cryo_X-ray_ptychographic_and_fluorescence_microscopy_of_green_algae","269775952_Parallel_ptychographic_reconstruction"]}