{"id":"311822897_Empowering_Students_to_Create_Better_Virtual_Reality_Applications_A_Longitudinal_Study_of_a_VR_Capstone_Course","abstract":"In this paper we present our experiences of teaching an annually organized virtual reality (VR) capstone course. We review three iterations of the course, during which a total of 45 students completed the course and 16 VR applications were implemented. Our comparative analysis describes the students' evaluation of the course, the applications created by them, and their development experiences. The results suggest that our gradual improvements on the course and the utilized software paid off, as the latest of the compared course iterations produced the best feedback and the highest quality VR applications. Our learning assessment analysis reveals that our course is effective in teaching VR application development and having students meet their personal learning goals. We also bring forward our RUIS toolkit that was used in the course with success, and present evidence on how better software toolkits can affect the development experience and allow students to create more impressive applications. Finally we share the lessons learned during five years of teaching the course, introducing several practical considerations for VR course organizers regarding pedagogics, software, and hardware.","authors":["Tuukka M. Takala","Lauri Malmi","Roberto Pugliese","Tapio Takala"],"meta":["November 2016Informatics in Education 15(2):287-317","DOI:10.15388/infedu.2016.15"],"references":["320337173_Design-Based_Research_in_Science_Education_One_Step_Towards_Methodology","303110530_Design-Based_Research_in_Science_Education_One_Step_Towards_Methodology","271762614_RUIS_-_A_toolkit_for_developing_virtual_reality_applications_with_spatial_interaction","305688123_Teaching_for_Quality_Learning_at_University","290774835_A_survey_of_final_project_courses_in_game_programs_Considerations_for_teaching_capstone","275484793_When_worlds_collide","274232395_The_Capstone_Course_A_Rite_of_Passage","264594690_Virtual_Reality_Technology","262392269_Selected_Papers_from_the_SIGGRAPH_Asia_Education_Program_An_educational_framework_for_creating_VR_application_through_groupwork","262352881_Teaching_virtual_reality"]}