{"id":"311847299_Simulated_performance_of_TCP_SCTP_DCCP_and_UDP_protocols_over_4G_network","abstract":"Forth Generation (4G) network support for wide geographical locations proves its use as a more advanced wireless technology. The Long-Term Evolution (LTE) is a 4G mobile communications standard set by International Communication Union (ITU), specifically ITU Radio communication Sector (ITU-R). At the moment, video traffic and telecommunications grow under the expansion of LTE, which is considered as the actual motivating access technology of 4G network. Throughout the deployment of LTE, various transport protocols are advised and broadly experimented, for instance, TCP, SCTP, DCCP and UDP that may execute differently on 4G networks subject to the network scenarios and parameter settings. Even though the deployment of LTE is swiftly enhanced, there is a lack of performance evaluation of its protocols. Hence, a widespread scrutiny is required for the evaluation of the operation of numerous protocols for high-end applications such as multimedia. Adopting these applications with flexible quality of service constraints with improved usage of resources is a challenging task. In this paper, the output results of different transport protocols for multimedia streaming applications, e.g., video, through extensive simulations are analyzed. The performance of an MPEG-4 video streaming is evaluated using NS-3. The performance metrics used are delay, jitter, throughput, and packet loss. These metrics are evaluated at the base station via TCP, SCTP, DCCP and UDP protocols over the 4G-LTE technology. The obtained results show that the DCCP performs the best in throughput improvement with the minimization of delay and jitter as compared to UDP, TCP, and SCTP.","authors":["Raaid Alubady","Shahrudin Awang Nor","Wisam Abduladeem Kamil"],"meta":["June 2017Procedia Computer Science 111:2-7","DOI:10.1016/j.procs.2017.06.002"],"references":["308496863_5G_A_digital_society","289433427_Research_Article_Performance_Evaluation_of_TCP_UDP_and_DCCP_Traffic_Over_4G_Network","279515976_Performance_Analysis_of_Reactive_and_Proactive_Routing_Protocols_in_MANET","261121814_Video_capacity_and_QoE_enhancements_over_LTE","261085865_Performance_analysis_of_TCP_and_UDP-based_applications_in_a_IEEE_80216_deployed_network","280991481_Realistic_Network_Traffic_Profile_Generation_Theory_and_Practice","254037239_Performance_evaluation_of_TCP_and_UDP_during_LTE_handover","252283594_Analysis_of_UDP_TCP_and_Voice_Performance_in_IEEE_80211b_Multihop_Networks","242461847_Rfc_768_user_datagram_protocol_usc","238325228_STD7_Transmission_control_protocol"]}