{"id":"311821084_Ocrelizumab_versus_Interferon_Beta-1a_in_Relapsing_Multiple_Sclerosis","abstract":"Background\nB cells influence the pathogenesis of multiple sclerosis. Ocrelizumab is a humanized monoclonal antibody that selectively depletes CD20+ B cells.\n\nMethods\nIn two identical phase 3 trials, we randomly assigned 821 and 835 patients with relapsing multiple sclerosis to receive intravenous ocrelizumab at a dose of 600 mg every 24 weeks or subcutaneous interferon beta-1a at a dose of 44 μg three times weekly for 96 weeks. The primary end point was the annualized relapse rate.\n\nResults\nThe annualized relapse rate was lower with ocrelizumab than with interferon beta-1a in trial 1 (0.16 vs. 0.29; 46% lower rate with ocrelizumab; P<0.001) and in trial 2 (0.16 vs. 0.29; 47% lower rate; P<0.001). In prespecified pooled analyses, the percentage of patients with disability progression confirmed at 12 weeks was significantly lower with ocrelizumab than with interferon beta-1a (9.1% vs. 13.6%; hazard ratio, 0.60; 95% confidence interval [CI], 0.45 to 0.81; P<0.001), as was the percentage of patients with disability progression confirmed at 24 weeks (6.9% vs. 10.5%; hazard ratio, 0.60; 95% CI, 0.43 to 0.84; P=0.003). The mean number of gadolinium-enhancing lesions per T1-weighted magnetic resonance scan was 0.02 with ocrelizumab versus 0.29 with interferon beta-1a in trial 1 (94% lower number of lesions with ocrelizumab, P<0.001) and 0.02 versus 0.42 in trial 2 (95% lower number of lesions, P<0.001). The change in the Multiple Sclerosis Functional Composite score (a composite measure of walking speed, upper-limb movements, and cognition; for this z score, negative values indicate worsening and positive values indicate improvement) significantly favored ocrelizumab over interferon beta-1a in trial 2 (0.28 vs. 0.17, P=0.004) but not in trial 1 (0.21 vs. 0.17, P=0.33). Infusion-related reactions occurred in 34.3% of the patients treated with ocrelizumab. Serious infection occurred in 1.3% of the patients treated with ocrelizumab and in 2.9% of those treated with interferon beta-1a. Neoplasms occurred in 0.5% of the patients treated with ocrelizumab and in 0.2% of those treated with interferon beta-1a.\n\nConclusions\nAmong patients with relapsing multiple sclerosis, ocrelizumab was associated with lower rates of disease activity and progression than interferon beta-1a over a period of 96 weeks. Larger and longer studies of the safety of ocrelizumab are required. (Funded by F. Hoffmann–La Roche; OPERA I and II ClinicalTrials.gov numbers, NCT01247324 and NCT01412333, respectively.)","authors":["Stephen L Hauser","Amit Bar-Or","Giancarlo Comi","Gavin Giovannoni"],"meta":["December 2016New England Journal of Medicine 376(3)","DOI:10.1056/NEJMoa1601277","Project: Ocrelizumab in MS"],"references":["311867355_Ocrelizumab_versus_Placebo_in_Primary_Progressive_Multiple_Sclerosis","305691038_Long-term_evolution_of_multiple_sclerosis_disability_in_the_treatment_era","283794016_The_potential_role_for_ocrelizumab_in_the_treatment_of_multiple_sclerosis_Current_evidence_and_future_prospects","283634545_Proinflammatory_GM-CSF-producing_B_cells_in_multiple_sclerosis_and_B_cell_depletion_therapy","300852924_World_Medical_Association_Declaration_of_Helsinki_Ethical_Principles_for_Medical_Research_Involving_Human_Subjects","297583234_Disease-modifying_therapies_and_infectious_risks_in_multiple_sclerosis","278217937_Rituximab_in_relapsing-remitting_multiple_sclerosis_-_Reply","278169344_New_natural_History_of_Interferon_beta-treated_relapsing_Multiple_Sclerosis","277519200_Use_of_the_Multiple_Sclerosis_Functional_Composite_as_an_Outcome_Measure_in_a_Phase_3_Clinical_Trial","273338259_Prevention_and_Management_of_Infusion-Associated_Reactions_in_the_Comparison_of_Alemtuzumab_and_Rebif_R_Efficacy_in_Multiple_Sclerosis_CARE-MS_Program"]}