{"id":"311850390_Evaluacion_de_Metodologia_flipped_classroom_primera_experiencia","abstract":"Introducción. Flipped Classroom (FC) es una metodología de enseñanza aprendizaje que invierte las actividades que tradicionalmente se realizan en clases, con las actividades que los estudiantes realizan fuera del aula y en las cuales se aplican las Tecnologías de la Información y Comunicación.Objetivo: implementar y evaluar la metodología Flipped Classroom en una unidad de la asignatura de Hematología Clínica de la carrera Tecnología Médica, Universidad Santo Tomás Santiago de Chile.Metodología. A través de un estudio exploratorio descriptivo, en un enfoque cuantitativo se evaluó la satisfacción de los estudiantes con respecto a la metodología FC, y el impacto de la metodología en los resultados de aprendizaje de los estudiantes. La muestra de este estudio estuvo constituida por 28 estudiantes matriculados en la asignatura de Hematología Clínica el año 2015.Resultados. Según la encuesta aplicada, el 65% de los estudiantes prefieren FC en vez de las clases tradicionales y el 60% dice que aprende más cuando se utiliza FC. En la calificación de los resultados de aprendizaje abordados con esta metodología se observó un aumento de 5% de las calificaciones comparados con los estudiantes del año anterior. Sin embargo la comparación global de notas no es estadísticamente significativa (p>0,5), pero se observa una diferencia estadísticamente significativa (p<0,5), cuando se compara el número de estudiantes que obtienen más o menos de nota 4,0 en la prueba.Discusión. Los estudiantes de este estudio evidencian alto grado de satisfacción de la metodología FC, aunque se observa un grupo de estudiantes que califica neutralmente la metodología.En el análisis de los resultados de aprendizaje evaluados en este estudio se observa que mejora el rendimiento académico de la mayoría de estudiantes.Conclusión. La metodología Flipped classroom es evaluada satisfactoriamente por los estudiantes y podría mejorar el rendimiento académico de los estudiantes.","authors":["Angelica Opazo","José Miguel Acuña Bastias","María Priscila Rojas Polanco"],"meta":["November 2016Innoeduca International Journal of Technology and Educational Innovation 2(2):90","DOI:10.20548/innoeduca.2016.v2i2.2030"],"references":["282535909_Flipping_the_Classroom_in_a_Large_Chemistry_Class-research_University_Environment","277947804_An_Innovative_Flipped_Class_Intervention_to_Improve_Dose_Calculation_Skills_of_Phase_I_Medical_Students_A_Preliminary_Study","277270519_El_nuevo_alumno_y_el_desafio_de_la_meritocracia_analisis_del_cambio_cultural_en_la_educacion_superior_chilena","275346359_No_differences_in_grades_or_level_of_satisfaction_in_a_flipped_classroom_for_neuroanatomy","268788232_Evaluation_of_the_flipped_classroom_approach_in_a_veterinary_professional_skills_course","233121264_Kolb's_Experiential_Learning_Theory_and_Its_Application_in_Geography_in_Higher_Education","345924291_Flipping_The_Classroom_To_Explore_Active_Learning_In_A_Large_Undergraduate_Course","308525552_Millennial_students_and_the_flipped_classroom","298104704_How_flipping_the_classroom_can_improve_the_traditional_lecture_The_Chronicle_of_Higher_Education","277877704_Introduction_to_Flipping_the_College_Classroom","276159992_It's_not_About_seat_time_Blending_Fipping_and_Efficiency_in_Active_Learning_Classrooms","272844584_Flipping_the_classroom_to_teach_population_health_Increasing_the_relevance","272753099_The_use_of_flipped_classrooms_in_higher_education_A_scoping_review","268690715_WISE-MD_usage_among_millennial_medical_students","266253006_Enhancing_Student_Engagement_Using_the_Flipped_Classroom"]}