{"id":"311850780_Interdisciplinaridade_no_contexto_da_Ciencia_da_Informacao_correntes_e_questionamentos_Interdisciplinarity_in_the_context_of_Information_Science_currents_and_questions","abstract":"O artigo investiga a interdisciplinaridade no contexto da Ciência da Informação(CI), seus conceitos e particularidades a partir de revisão de literatura. Objetiva elucidar a discussão a respeito da temática e das abordagens que têm sido empregadas nos estudos e, também, propor um conceito embrionário para a interdisciplinaridade. Analisa os primeiros estudos realizados por Lena Vania Pinheiro e os confronta comas investigações mais recentes. Conclui que a CI, a Biblioteconomia e a Ciência da Computação exercem um diálogo interdisciplinar, isto é, essas áreas interagem e criam conhecimento ou aperfeiçoam o já existente, sendo útil e reconhecido pelas três áreas envolvidas.\nAbstract: This article investigates interdisciplinarity in the context of Information Science (CI), its concepts and characteristics from a literature review. It aims to elucidate the discussion of the theme and the approaches that have been used in studies; it also proposesan embryonic concept for interdisciplinarity. It analyzes the first studies by Lena Vania Pinheiro and confronts them with the latest researches. Thestudy concludes that the CI, Library science and Computer science perform an interdisciplinary dialogue, that is, these areas interact and create knowledge or improve the existing, being useful and recognized by all the involved areas. Keywords: Interdisciplinarity. Information Science. Complexity Theory.","authors":["João Arlindo dos Santos Neto","Juliana Cardoso dos Santos","Paulo Sérgio Teles","Marta Valentim"],"meta":["December 2016Em Questão 23(1):9","DOI:10.19132/1808-5245231.9-35"],"references":["307785938_Teoria_da_Complexidade_e_as_multiplas_abordagens_para_compreender_a_realidade_social","302983806_A_interdisciplinaridade_na_Ciencia_da_Informacao_pela_perspectiva_da_analise_de_citacoes","274672416_A_Ciencia_da_Informacao_e_sua_consolidacao_em_face_da_interdisciplinaridade","238770904_Tracados_e_limites_da_ciencia_da_informacao","287727006_Ciencia_da_Informacao_ciencia_e_revolucao_cientificabreve_historico_e_reflexoes","220229130_Information_Science_The_Study_of_Postmodern_Knowledge_Usage"]}