{"id":"311850385_Algumas_consideracoes_sobre_os_repositorios_digitais_de_dados_de_pesquisa","abstract":"Introdução: A pesquisa científica contemporânea no seu compromisso por buscar novos conhecimentos e novas descobertas produz e utiliza intensivamente dados digitais de pesquisa. Nesse contexto de mudanças, os dados deixam de ser simples subprodutos das atividades de pesquisa e se tornam recursos informacionais de primeira grandeza, caracterizando um novo paradigma científico pautado pelo compartilhamento, amplo acesso e reuso de dados. Objetivo: Identificar o papel dos repositórios digitais de dados nos novos cenários de pesquisa científica e apresentar um panorama das suas principais características, categorias, benefícios, funções e infraestruturas.Metodologia: Analisa a literatura da área e os principais sistemas que dão sustentação a infraestruturas de acesso e gestão de dados de pesquisa.Resultados: O presente ensaio demonstra que para os dados e coleções de dados de pesquisa transmitam conhecimento no tempo e no espaço e sejam reusados é necessária a implantação de uma infraestrutura tecnológica e gerencial, permanente e sustentável, que permita que eles sejam cuidados ao longo de todo o seu ciclo de vida. No centro dessa infraestrutura estão os repositórios digitais de dados de pesquisa, que são sistemas voltados para apoiar a seleção, catalogação, arquivamento, acesso e compartilhamento de dados de pesquisa.Conclusão: Pela sua importância como recurso informacional, os repositórios de dados se tornam rapidamente parte essencial das infraestruturas de pesquisa em escala global, tornando visível e aberta para toda a sociedade uma parcela importante da atividade de pesquisa. Nessa direção, se tornam um desafio relevante para a Ciência da Informação e para a Biblioteconomia.","authors":["Luís Fernando Sayão","Luana Sales"],"meta":["December 2016Informação & Informação 21(2):90","DOI:10.5433/1981-8920.2016v21n2p90"],"references":["304780954_Online_Research_Data_Repositories_the_What_When_Why_and_How","286455028_Guia_de_gestao_de_dados_de_pesquisa_para_bibliotecarios_e_pesquisadores","277234378_Modelos_de_coste_para_la_preservacion_de_los_datos_cientificos_en_la_e-ciencia","265852039_Schema_for_the_description_of_research_data_repositories","258504791_Making_Research_Data_Repositories_Visible_The_re3dataorg_Registry","330356945_Open_archival_information_system_OAIS_reference_model"]}