{"id":"311926149_Compositional_Synthesis_of_Finite_State_Abstractions","abstract":"Controller synthesis techniques for continuous systems with respect to temporal logic specifications typically use an intermediate finite-state symbolic abstraction of the system model. Constructing this abstraction for the entire system is computationally expensive, and does not exploit natural decompositions of many systems into interacting components. We describe a methodology for compositional symbolic abstraction to help scale controller synthesis for temporal logic to larger systems. We introduce a new relation, called disturbance bisimulation, as the basis for compositional symbolic abstractions. Disturbance bisimulation strengthens the typically used $\\varepsilon$-approximate alternating bisimulation relation. Using this relation we prove two main theorems. The first, called simultaneous approximation, shows how one can construct finite-state abstractions compositionally for each component, so that the abstractions are simultaneously disturbance bisimilar to their continuous counterparts. The second, called composition of approximation, shows an approximate bisimulation relationship between compositions of the finite symbolic models and the composition of the original network, when a small-gain condition is satisfied. Our results are non-trivial because each component's dynamics is influenced by the states of other interacting components, whose values are only approximately known. We discuss how we get a compositional controller synthesis methodology for networks of such systems against local temporal specifications as a by-product of our construction.","authors":["Rupak Majumdar","Kaushik Mallik","Anne-Kathrin Schmuck"],"meta":["December 2016IEEE Transactions on Automatic Control 64(6)","DOI:10.1109/TAC.2018.2869740"],"references":["305857505_Compositional_Abstraction_for_Networks_of_Control_Systems_A_Dissipativity_Approach","304410881_Construction_of_approximations_of_stochastic_control_systems_A_compositional_approach","301282045_SCOTS_A_Tool_for_the_Synthesis_of_Symbolic_Controllers","300414387_On_compositional_symbolic_controller_synthesis_inspired_by_small-gain_theorems","297916739_Alternating_refinement_relations","294108766_Symbolic_Models_for_Networks_of_Control_Systems","286491139_Correct-by-Construction_Adaptive_Cruise_Control_Two_Approaches","283109140_Compositional_construction_of_approximate_abstractions","282937076_First_steps_toward_formal_controller_synthesis_for_bipedal_robots","269293797_Symbolic_models_for_networks_of_discrete-time_nonlinear_control_systems"]}