{"id":"311920071_Improved_Energy-Aware_Routing_Algorithm_in_Software-Defined_Networks","abstract":"The growing energy consumption of communication networks has attracted the attention of the networking researchers in the last decade. In this context, SDN allows a flexible programmability, suitable for the power-consumption optimization problem. In this paper we present an energy-aware routing approach which minimizes the number of links used to satisfy a given traffic demand. Different from previous works, we optimize energy consumption in OpenFlow networks with in-band control traffic. To this end, we start formulating an optimization model that considers routing requirements for control and data plane communications. To reduce the complexity of our model in large-scale topologies, a heuristic algorithm is developed as well. Although it is not widely researched, except for quantitative and heuristic results, we also derive a simple and efficient algorithm for the best controller placement in terms of energy saving. Simulation results confirm that the proposed solution enables the achievement of significant energy savings.","authors":["Adriana Fernández-Fernández","Cristina Cervelló-Pastor","Leonardo Ochoa-Aday"],"meta":["November 2016","DOI:10.1109/LCN.2016.41","Conference: IEEE 41st Conference on Local Computer Networks (LCN'16)At: Dubai, United Arab Emirates (UAE)"],"references":["286561864_Energy-Aware_routing_algorithms_in_Software-Defined_Networks","278630034_Optimizing_Rule_Placement_in_Software-Defined_Networks_for_Energy-aware_Routing","262805723_Software-Defined_Networking_A_Comprehensive_Survey","260438995_Trends_in_worldwide_ICT_electricity_consumption_from_2007_to_2012","254464083_The_Controller_Placement_Problem","221164120_Greening_of_the_Internet","220195143_OpenFlow_Enabling_innovation_in_campus_networks","42093414_Minimizing_Routing_Energy_Consumption_From_Theoretical_to_Practical_Results","282551506_Saving_Energy_in_Partially_Deployed_Software_Defined_Networks","227628108_SNDlib_10-Survivable_Network_Design_Library"]}