{"id":"311936984_Load_Frequency_Control_for_Hydropower_Plants_using_PID_Controller","abstract":"Many development republics began to get rid of conventional energy and towards to use renewable energy like hydropower system, solar cells and wind turbines as soon as possible. Load Frequency Control (LFC) problem is coming to be the main topics for mentioning schemes due to not corresponding between main power system inputs such as change load demand and change in speed turbine settings. This paper illustrates a self-tuning control of hydropower system that suggested and confirmed under Automatic Generation Control (AGC) in power scheme. The suggested power system involves one single area. The suggested self-tuning control system is employed in performing the automatic generation control for load frequency control request and compared it with conventional control structure. The power system dynamic modeling has regularly built in several essential parameters which have a significant influence According to frequency limitation. The main problem with all controllers is an exaggerated reaction to minor errors, producing the system to oscillate. The output response results for hydropower system obviously proved the benefit of using maximum load demand by tuning PID controller. Whereas, tuning PID controller has got properly more rapid output response and minimal overshoot.","authors":["Ali Thaeer Hammid","Mojgan Hojabri","Mohd Herwan Sulaiman","Ahmed N Abdalla"],"meta":["January 2016Journal of Telecommunication 8(10):47-51","Projects: Optimization and Control of Hydro Generation Scheduling using Hybrid Firefly Algorithm and Particle Swarm Optimization Techniqueshassan farhan rashag"],"references":["327802244_Performance_Evaluation_of_an_Isolated_Small_Hydro_Power_Plant_Using_Conventional_Controllers","303398414_Developing_Sustainable_Infrastructure_for_Small_Hydro_Power_Plants_through_Clean_Development_Mechanisms_in_Colombia","300417955_Robust_load_frequency_control_in_multi-area_power_system_An_LMI_approach","269307687_High_Frequency_MVLV_transformer_modelling_for_Power_Line_Communication_applications","305339401_Relay_Control_Design_for_Robust_Stabilization_in_a_Finite-Time","301829231_Research_of_Hydro-Turbine_Governor_Supplementary_Control_Strategy_for_Islanding_AC_Grid_at_Sending_Terminal_of_HVDC_System","296624463_Utilizing_Electric_Vehicles_for_LFC_in_Restructured_Power_Systems_Using_Fractional_Order_Controller","289857760_Optimal_solutions_of_load_frequency_control_problem_using_oppositional_krill_herd_algorithm","289450539_QFT_fractional_order_controller_for_non-minimum_phase_hydro_power_plant","261463331_Analysis_of_power_system_frequency_responses_with_hydro_turbines_incorporating_load_shedding"]}