{"id":"311989034_UM_SISTEMA_DE_TRANSCRICAO_PARA_LINGUA_DE_SINAIS_BRASILEIRA_O_CASO_DE_UM_AVATAR","abstract":"A língua de sinais brasileira (libras) é uma língua visuoespacial reconhecida como segunda língua oficial do Brasil. Existem vários estudos que mostram que as línguas de sinais são línguas naturais. Contudo, diferentemente das línguas orais, que podem ser representadas, por exemplo, pelo sistema alfabético, a libras não possui um sistema de transcrição amplamente aceito. Muitos autores adotam o sistema de glosas, por causa da facilidade de leitura proporcionada, visto que são palavras de uma língua oral usadas para representar um sinal de forma aproximada. Este trabalho tem como objetivo propor uma sistematização da transcrição por glosas e mostrar sua importância para pesquisas linguísticas e de engenharia. Esse estudo é relevante tanto para o estudo da língua em si, como também na construção de avatares voltados para uma tradução automática. Neste trabalho também é avaliada a relação entre glosas em ASL e libras de forma explícita, apontando simplificações benéficas. Além disso, estabelece-se uma distinção entre transcrições largas e estreitas de glosas, exemplificando sua representação com um agente virtual sinalizador.","authors":["Francisco Aulisio dos Santos Paiva","José Mario De Martino","Plinio Barbosa","Ângelo Benetti"],"meta":["December 2016Revista do GEL 13(3):12","DOI:10.21165/gel.v13i3.1440"],"references":["321289820_Descricao_das_linguas_sinalizadas_A_questao_da_transcricao_dos_dados","255711243_Degree_Modification_and_Intensification_in_American_Sign_Language_Adjectives","333378549_Interaction_of_Morphology_and_Syntax_in_American_Sign_Language","306090926_Legal_Ramifications_of_an_Incorrect_Analysis_of_Tense_in_ASL","275557967_Phonological_Deletion_in_American_Sign_Language","267258983_Grammar_Gesture_and_Meaning_in_American_Sign_Language","266049277_A_INCLUSAO_ESCOLAR_DE_ALUNOS_SURDOS_O_QUE_DIZEM_ALUNOS_PROFESSORES_E_INTERPRETES_SOBRE_ESTA_EXPERIENCIA","247516487_Sign_Language_The_Study_of_Deaf_People_and_Their_Language","245272680_American_Sign_Language_A_Teacher''s_Resource_Text_on_Grammar_and_Culture","245092854_A_Survey_and_Critique_of_American_Sign_Language_Natural_Language_Generation_and_Machine_Translation"]}