{"id":"311917141_The_Impact_of_the_Pattern-Growth_Ordering_on_the_Performances_of_Pattern_Growth-Based_Sequential_Pattern_Mining_Algorithms","abstract":"Sequential Pattern Mining is an efficient technique for discovering recurring structures or patterns from very large datasetwidely addressed by the data mining community, with a very large field of applications, such as cross-marketing, DNA analysis, web log analysis,user behavior, sensor data, etc. The sequence pattern mining aims at extractinga set of attributes, shared across time among a large number of objects in a given database. Previous studies have developed two major classes of sequential pattern mining methods, namely, the candidate generation-and-test approach based on either vertical or horizontal data formats represented respectively by GSP and SPADE, and the pattern-growth approach represented by FreeSpan and PrefixSpan.In this paper, we are interested in the study of the impact of the pattern-growthordering on the performances of pattern growth-based sequential pattern mining algorithms.To this end, we introduce a class of pattern-growth orderings, called linear orderings, for which patterns are grown by making grow either the currentpattern prefix or the current pattern suffix from the same position at eachgrowth-step.We study the problem of pruning and partitioning the search space followinglinear orderings. Experimentations show that the order in which patternsgrow has a significant influence on the performances.","authors":["Edith Belise Kenmogne"],"meta":["December 2016Computer and Information Science 10(1):23","DOI:10.5539/cis.v10n1p23"],"references":["296685965_Fast_algorithms_for_mining_high-utility_itemsets_with_various_discount_strategies","289367292_Efficient_Algorithms_for_Mining_High-Utility_Itemsets_in_Uncertain_Databases","226418296_The_PSP_approach_for_mining_sequential_patterns","225266300_Zaki_MJ_SPADE_An_efficient_algorithm_for_mining_frequent_sequences_Machine_Learning_421_31-60","221614059_Sequence_Mining_in_Categorical_Domains_Incorporating_Constraints","308599135_Efficient_Mining_of_High-Utility_Itemsets_Using_Multiple_Minimum_Utility_Thresholds","301338511_An_efficient_algorithm_to_mine_high_average-utility_itemsets","246648893_LAPIN_Effective_Sequential_Pattern_Mining_Algorithms_by_Last_Position_Induction","220966044_PrefixSpan_Mining_Sequential_Patterns_by_Prefix-Projected_Growth","220788279_LAPIN_Effective_Sequential_Pattern_Mining_Algorithms_by_Last_Position_Induction_for_Dense_Databases"]}