{"id":"311944245_Implementing_the_flipped_classroom_an_exploration_of_study_behaviour_and_student_performance","abstract":"The flipped classroom is becoming more popular as a means to support student learning in higher education by requiring students to prepare before lectures and actively engaging students during lectures. While some research has been conducted into student performance in the flipped classroom, students’ study behaviour throughout a flipped course has not been investigated. This study explored students’ study behaviour throughout a flipped and a regular course by means of bi-weekly diaries. Furthermore, student references to their learning regulation were explored in course evaluations. Results from the diaries showed that students’ study behaviour in the flipped course did not appear to be very different from that of students in a regular course. Furthermore, study behaviour did not appear strongly related to student performance in both the flipped and the regular course. Exploration of student references to their learning regulation in the course evaluations showed that some students experienced the flipped course design as intended to support their learning process. Other students, however, demonstrated resistance to changing their study behaviour even though changing study behaviour is expected in order to benefit from the flipped classroom. Further research on the relationship between students’ learning regulation and actual study behaviour and course results is necessary to understand when and why implementing the flipped classroom is successful. Recommendations that may help more effective flipped classroom implementation include considering the prior history between students and instructor(s), the broader curriculum context, and frequent expectation communication especially with large numbers of students and non-mandatory lecture attendance.","authors":["Anja J. Boevé","Rob Meijer","Roel J. Bosker","Jorien Vugteveen"],"meta":["December 2017Higher Education 74(6)","DOI:10.1007/s10734-016-0104-y"],"references":["312862857_The_Meanings_of_Student_Engagement_Implications_for_Policies_and_Practices","282418566_Reducing_Underreports_of_Behaviors_in_Retrospective_Surveys_The_Effects_of_Three_Different_Strategies","274252491_The_Flipped_Classroom_Improved_Medical_Student_Performance_and_Satisfaction_in_a_Pre-clinical_Physiology_Course","271688880_Effort_and_Reward_The_Assumption_That_College_Grades_are_Affected_by_Quantity_of_Study","265051052_Motivation_and_cognitive_load_in_the_flipped_classroom_definition_rationale_and_a_call_for_research","262267588_Active_Learning_Increases_Student_Performance_in_Science_Engineering_and_Mathematics","260712268_Comparing_the_Effectiveness_of_an_Inverted_Classroom_to_a_Traditional_Classroom_in_an_Upper-Division_Engineering_Course","260435160_Panel_Attrition_Separating_Stayers_Fast_Attriters_Gradual_Attriters_and_Lurkers","324281612_Applied_Regression_Analysis","261695753_A_Measure_of_College_Student_Course_Engagement"]}