{"id":"311974182_PMBOK_y_PRINCE_2_similitudes_y_diferencias","abstract":"Existen diferentes estándares enfocados a la gestión de proyectos. Ejemplo de estos estándares lo constituyen la guía PMBOK y el método PRINCE2. En el presente trabajo se realizó un análisis comparativo de la guía PMBOK respecto al método estructurado PRINCE2, basado en la evaluación de diferentes fuentes bibliográficas. Durante el desarrollo de la investigación fueron analizados diferentes elementos teóricos de cada uno, tales como: el origen, la evolución, la estructura y su aplicación, lo que permite identificar similitudes y diferencias entre estos. El resultado de la investigación arroja que estos estándares no se consideran excluyentes y que pueden coexistir en un mismo proyecto. PRINCE2 determina qué, cómo, cuándo y por quiénes se ejecutarán las actividades, utilizando un lenguaje común de fácil asimilación y PMBOK constituye una guía de referencia internacional que incorpora una amplia gama de conocimientos sobre la gestión de proyectos.PMBOK and PRINCE 2, similarities and differencesABSTRACTThere are different standards focused on project management. Examples of these standards are the PMBOK Guide and PRINCE2 method. In this paper it is made a comparative analysis of the PMBOK Guide in relation to PRINCE2 structured method, based on the assessment of different literature sources. During the course of the investigation different theoretical elements of both PMBOK and PRINCE2 were analyzed, such as the origin, evolution, structure and application, allowing the identification of similarities and differences between them. The result of this research reveals that these standards are not considered mutually exclusive and that can coexist on the same project. PRINCE2 determines what, how, when and by whom the activities will be implemented using a common language easily assimilated and PMBOK is an international reference guide that incorporates a wide range of knowledge about project management.PMBOK e PRINCE2, semelhanças e diferençasRESUMO Existem diferentes padrões focados em gerenciamento de projetos. Exemplos destas normas constituem Guia PMBOK e do método PRINCE2. Neste trabalho foi realizada uma análise comparativa das orientações PMBOK PRINCE2 na abordagem estruturada, com base na avaliação de diferentes fontes bibliográficas. Durante o curso da investigação foram analisados diferentes elementos teóricos de cada um, tai como a origem, evolução, estrutura e aplicação, o que lhe permite identificar semelhanças e diferenças entre eles. O resultado da investigação mostra que essas normas não são considerados mutuamente exclusivos e podem coexistir no mesmo projeto. PRINCE2 determina o que, como, quando e por quem as actividades serão implementadas através de uma linguagem comum de fácil assimilação e PMBOK é um guia de referência internacional que incorpora uma ampla gama de conhecimentos sobre gerenciamento de projetos.","authors":["Kenia Fernández Parra","Ariannys Garrido Saroza","Yosvani Ramirez","Isamira Perdomo Bello"],"meta":["January 2016Revista Científica 3(23):111","DOI:10.14483/udistrital.jour.RC.2015.23.a9"],"references":[]}