{"id":"311922930_What_is_frugal_innovation_Three_defining_criteria","abstract":"Recently, the innovation management literature has witnessed a rising interest in the so-called frugal innovation. The term was initially discussed in the context of emerging markets, giving non-affluent customers opportunities to consume affordable products and services suited to their needs. However, the meaning of frugal innovation is fuzzy. Further, the increasing appearance of frugal innovation in developed markets challenges earlier definitions that often characterised frugal innovation particularly in the context of emerging markets. So far, it has not been clear what differentiates frugal innovation from other innovation types. Thus, we need criteria that make it possible to determine what frugal innovation is and what is not. In order to determine a clear definition, we choose a multimethod approach, conduct a literature review, and interview 45 managers from companies and researchers from different research institutes. On the basis of the results, we define three criteria for frugal innovation: substantial cost reduction, concentration on core functionalities, and optimised performance level. We contribute to the literature by refining the meaning of frugal innovation. We also enable organisations to better deal with the challenge of developing frugal innovation in both emerging and developed markets.","authors":["Timo Weyrauch","Cornelius Herstatt"],"meta":["December 2016","DOI:10.1186/s40669-016-0005-y"],"references":["303682963_Frugal_Innovation_The_key_to_penetrating_emerging_markets","299352819_Reverse_innovation_-_how_it_works","339591526_A_Perspective_on_Frugality_in_Growing_Economies_Triggering_a_Virtuous_Cycle_between_Consumption_Propensity_and_Growth","326311497_A_Pattern-Based_Approach_to_the_Development_of_Frugal_Innovations","316796878_Frugal_Innovation_in_Healthcare","316159927_Aiming_Big_with_Small_Cars","306156547_Frugal_engineering_an_emerging_innovation_paradigm","299265221_Understanding_the_Post-Recession_Consumer","293203779_Innovation's_Holy_Grail","290938167_Frugal_innovation_A_new_business_paradigm"]}