{"id":"311910208_Blended_learning_effectiveness_the_relationship_between_student_characteristics_design_features_and_outcomes","abstract":"This paper investigates the effectiveness of a blended learning environment through analyzing the relationship between student characteristics/background, design features and learning outcomes. It is aimed at determining the significant predictors of blended learning effectiveness taking student characteristics/background and design features as independent variables and learning outcomes as dependent variables. A survey was administered to 238 respondents to gather data on student characteristics/background, design features and learning outcomes. The final semester evaluation results were used as a measure for performance as an outcome. We applied the online self regulatory learning questionnaire for data on learner self regulation, the intrinsic motivation inventory for data on intrinsic motivation and other self-developed instruments for measuring the other constructs. Multiple regression analysis results showed that blended learning design features (technology quality, online tools and face-to-face support) and student characteristics (attitudes and self-regulation) predicted student satisfaction as an outcome. The results indicate that some of the student characteristics/backgrounds and design features are significant predictors for student learning outcomes in blended learning.","authors":["Kintu Mugenyi Justice","Chang Zhu"],"meta":["February 2017","DOI:10.1186/s41239-017-0043-4"],"references":["324197336_Effect_of_Moodle_on_learning_An_Oman_perception","305766781_Student_Characteristics_and_Learning_Outcomes_in_a_Blended_Learning_Environment_Intervention_in_a_Ugandan_University","287632256_Effect_of_blended_learning_environment_model_on_high_school_students'_academic_achievement","283930876_Impact_of_learning_strategies_and_motivation_on_performance_A_study_in_Web-based_instruction","280048303_Influence_of_Computer_Literacy_on_Postgraduates'_Use_of_E-Resources_in_Nigerian_University_Libraries","279556336_Learner_and_Instructional_Factors_Influencing_Learning_Outcomes_within_a_Blended_Learning_Environment","291782785_Student_distress_in_web-based_distance_education","290127533_A_review_of_motivational_and_emotional_strategies_to_reduce_drop_out_in_webbased_distance_education","287630140_Adopting_a_Blended_Learning_Approach_Challenges_Encountered_and_Lessons_Learned_in_an_Action_Research_Study","277984338_Using_Constructionist_Principals_In_Designing_And_Integrating_Online_Collaborative_Interactions"]}