{"id":"311916796_A_Review_of_Scaling_Agile_Methods_in_Large_Software_Development","abstract":"Agile methods such as Dynamic Systems Development Method (DSDM), Extreme Programming (XP), SCRUM, Agile Modeling (AM) and Crystal Clear enable small teams to execute assigned task at their best. However, larger organizations aim at incorporating more Agile methods owing to the fact that its application is prevalently tailored for small teams. The scope in which large firms are interested will extend the original Agile methods to include larger teams, coordination, communication among teams and customers as well as oversight. Determining particular software method is always challenging for software companies especially when considering start-up, small to medium or large enterprises. Most of large organizations develop large-scale projects by teams of teams or teams of teams of teams. Therefore, most recognized Agile methods or first-generation methods such as XP and SCRUM need to be modified before they are employed in large organizations; which is not an easy task. Accomplishing said task would necessitate large organizations to pick and select from the scaling Agile methods in accommodating a single vision for large and multiple teams. Deciding the right choice requires wholesome understanding of the method including its strengths and weaknesses as well as when and how it makes sense. Therefore, the main aim of this paper is to review the existing literature of the utilized scaling Agile methods by defining, discussing and comparing them. In-depth reviews on the literature were performed to juxtapose the methods in impartial manner. In addition, the content analysis was used to analyse the resultant data. The result indicated that the DAD, LeSS, LeSS huge, SAFe, Spotify, Nexus and RAGE are the adopted scaling Agile methods at large organizations. They seem to be similar but there are discrepancies among them that take the form of team size, training and certification, methods and practices adopted, technical practices required and organizational type.","authors":["Mashal Alqudah","Rozilawati Razali"],"meta":["December 2016International Journal on Advanced Science Engineering and Information Technology 6(6):828","DOI:10.18517/ijaseit.6.6.1374"],"references":["307802325_A_Maturity_Model_for_Scaling_Agile_Development","306350490_Issues_and_Challenges_of_Cost_Management_in_Agile_Software_Development_Projects","303847552_Challenges_and_Success_Factors_for_Large-Scale_Agile_Transformations_A_Systematic_Literature_Review","320640024_Is_there_a_single_method_for_the_internet_of_things","316070089_Popular_agile_methods_in_software_development_Review_and_analysis","308868963_Inter-team_coordination_in_large-scale_agile_development_A_test_of_organizational_discontinuity_theory","300131437_The_Disciplined_Agile_Process_Decision_Framework","297654479_Artefacts_and_Agile_Method_Tailoring_in_Large-Scale_Offshore_Software_Development_Programmes","295548208_Scaled_Agile_Framework_Presentation_and_real_world_example","289401521_Scaling_agile_development"]}