{"id":"311905402_Comparing_the_perceptual_contributions_of_cochlear-scaled_entropy_and_speech_level","abstract":"Cochlear-scaled entropy (CSE) has been suggested to be a reliable predictor of speech intelligibility. Previous studies showed that speech segments with high root-mean-square (RMS) levels (H-levels) contained primarily vowels, which carry important information for speech recognition. The present work compared the contributions of high-CSE (H-entropy) and H-level segments to speech intelligibility. The natural speech was edited to generate two types of noise-replaced stimuli, which preserved the same percentages of largest CSE segments and highest RMS-level segments, and played to normal-hearing listeners in a recognition experiment. Experimental results showed that the nature of the noise-replaced stimulus, H-entropy and H-level, made a small difference in intelligibility performance. CSEs and RMS levels showed a moderately high correlation (r = 0.79), suggesting that many speech segments may have both large CSEs and high RMS levels, which might account partially for the small intelligibility difference between the two types of stimuli. In addition, the vowel duration proportion differed between H-entropy and H-level segments of the same length, suggesting that vowels play different roles in contributing to the intelligibility of H-entropy and H-level stimuli.","authors":["Yilai Shu","Xiao-xing Feng","Fei Chen"],"meta":["December 2016The Journal of the Acoustical Society of America 140(6):EL517-EL521","DOI:10.1121/1.4971879","Project: Speech perception"],"references":["255713774_Assessing_the_perceptual_contributions_of_vowels_and_consonants_to_Mandarin_sentence_intelligibility","230860158_Cochlea-scaled_entropy_predicts_intelligibility_of_Mandarin_Chinese_sentences","224911969_Contributions_of_cochlea-scaled_entropy_and_consonant-vowel_boundaries_to_prediction_of_speech_intelligibility_in_noise","47531211_Cochlea-scaled_spectral_entropy_predicts_rate-invariant_intelligibility_of_temporally_distorted_sentences","44691308_Cochlea-scaled_entropy_not_consonants_vowels_or_time_best_predicts_speech_intelligibility","26702924_Perceptual_contributions_of_the_consonant-vowel_boundary_to_sentence_intelligibility","7842209_Coherence_and_the_speech_intelligibility_index","6334696_Development_of_the_Mandarin_Hearing_in_Noise_Test_MHINT","308148498_Coherence_and_the_Speech_Intelligibility_Index","16046505_The_deterioration_of_hearing_with_age_Frequency_selectivity_the_critical_ratio_the_audiogram_and_speech_threshold"]}