{"id":"312041857_Randomized_Embeddings_with_Slack_and_High-Dimensional_Approximate_Nearest_Neighbor","abstract":"Approximate nearest neighbor search (&epsi;-ANN) in high dimensions has been mainly addressed by Locality Sensitive Hashing (LSH), which has complexity with polynomial dependence in dimension, sublinear query time, but subquadratic space requirement. We introduce a new “low-quality” embedding for metric spaces requiring that, for some query, there exists an approximate nearest neighbor among the pre-images of its k> 1 approximate nearest neighbors in the target space. In Euclidean spaces, we employ random projections to a dimension inversely proportional to k.\nOur approach extends to the decision problem with witness of checking whether there exists an approximate near neighbor; this also implies a solution for &epsi;-ANN. After dimension reduction, we store points in a uniform grid of side length &epsi; /&sqrt; d′, where d′ is the reduced dimension. Given a query, we explore cells intersecting the unit ball around the query. This data structure requires linear space and query time in O(d nρ), ρ &approx; 1-&epsi;²i>/log(1&epsi;), where n denotes input cardinality and d space dimension. Bounds are improved for doubling subsets via r-nets.\nWe present our implementation for &epsi;-ANN in C++ and experiments for d≤ 960, n≤ 10⁶, using synthetic and real datasets, which confirm the theoretical analysis and, typically, yield better practical performance. We compare to FALCONN, the state-of-the-art implementation of multi-probe LSH: our prototype software is essentially comparable in terms of preprocessing, query time, and storage usage.","authors":["Evangelos Anagnostopoulos","Ioannis Z Emiris","Ioannis Psarros"],"meta":["January 2017ACM Transactions on Algorithms 14(2)","DOI:10.1145/3178540"],"references":["301840852_Extensions_of_Lipschitz_mappings_into_a_Hilbert_space","301835187_Approximate_Polytope_Membership_Queries","319770399_Approximate_nearest_neighbors_towards_removing_the_curse_of_dimensionality","314830303_Finding_nearest_neighbors_in_growth-restricted_metrics","312084761_Optimal_Hashing-based_Time-Space_Trade-offs_for_Approximate_Near_Neighbors","312077213_High-dimensional_approximate_r_-nets","309719165_Fast_construction_of_nets_in_low_dimensional_metrics_and_their_applications","300621759_Smooth_Tradeoffs_between_Insert_and_Query_Complexity_in_Nearest_Neighbor_Search","288663320_Randomly-oriented_k-d_trees_adapt_to_intrinsic_dimension","286302047_Approximate_nearest_neighbor_search_for_ell_p-spaces_2_p_infty_via_embeddings"]}