{"id":"312098053_End-user_abstractions_for_meta-control_Reifying_the_reflectogram","abstract":"Reflective facilities in OO languages are used both for implementing language extensions (such as AOP frameworks) and for supporting new programming tools and methodologies (such as object-centric debugging and message-based profiling). Yet controlling the runtime behavior of these reflective facilities introduces several challenges, such as computational overhead, the possibility of meta-recursion and an unclean separation of concerns between base and meta-level. In this paper we present five dimensions of meta-level control from related literature that try to remedy these problems. These dimensions are namely: temporal and spatial control, placement control, level control and identity control. We then discuss how these dimensions interact with language semantics in class-based OO languages in terms of: scoping, inheritance and first-class entities. We argue that the reification of the descriptive notion of reflectogram can unify the control of meta-level execution in all these five dimensions while expressing properly the underlying language semantics. We present an extended model for the reification of the reflectogram based on our additional analysis and validate our approach through a new prototype implementation that relies on byte-code instrumentation. Finally, we illustrate our approach through a case study on runtime tracing.","authors":["Nikolaos Papoulias","Marcus Denker","Stéphane Ducasse","Luc Fabresse"],"meta":["January 2017Science of Computer Programming 140(4)","DOI:10.1016/j.scico.2016.12.002"],"references":["311490344_Reifying_the_reflectogram_towards_explicit_control_for_implicit_reflection","280792638_Remote_Debugging_and_Reflection_in_Resource_Constrained_Devices","271143323_Context-oriented_Programming","262203925_Method_Slots_Supporting_Methods_Events_and_Advices_by_a_Single_Language_Construct","259118235_Execution_Levels_for_Aspect-Oriented_Programming_Design_Semantics_Implementations_and_Applications","249315034_ContextJ_Context-oriented_programming_for_Java","247374149_Reflection_and_Semantics_in_a_Procedural_Programming_Language","242546223_Issues_in_computational_reflection","242438352_The_art_of_the_metaobject_protocol","242357184_IguanaJ_Towards_a_dynamic_and_efficient_reflective_architecture_for_Java"]}