{"id":"312016169_The_X-bar_control_chart_with_restriction_of_the_capability_indices","abstract":"Purpose\n\nThe purpose of this paper is to find the configuration of the number (m) and size (n) of the sample in Phase I that would make it possible to detect the out-of-control (OOC) state of the process with the smallest number of samples and ensure a capability index (Cpk) that would meet the customer’s requirements.\n\nDesign/methodology/approach\n\nThe suggested approach addresses this problem using simulation techniques and design of experiments (DOE). The simulation techniques made it possible to reproduce the normal operating conditions of the process. The DOE was used to construct a predictive model for control chart performance and thus to determine combinations of m and n in Phase I that would meet the capability objectives of the process. A numerical example and a simulation study were conducted to illustrate the proposed method.\n\nFindings\n\nUsing simulation techniques and DOE, the authors can find the number (m) and size (n) of the sample in Phase I that would make it possible to detect the OOC state of the process with the smallest number of samples and ensure a Cpk that would meet the customer’s requirements.\n\nOriginality/value\n\nIn the real situations of many companies, choosing the numbers and sizes of samples (m and n) in Phases I and II is a crucial decision in relation to implementing a control chart. The paper shows that the simulation method and use of linear regression are effective alternatives because they are better known and more easily applied in industrial settings. Therefore, the need for alternatives to the X control chart comes into play.","authors":["Pedro Carlos Oprime","Glauco Henrique de Sousa Mendes"],"meta":["January 2017International Journal of Quality & Reliability Management 34(1):38-52","DOI:10.1108/IJQRM-08-2014-0103"],"references":["291660054_Effect_of_the_Amount_of_Phase_I_Data_on_the_Phase_II_Performance_of_S-2_and_S_Control_Charts","285535293_Control_Charts_for_Joint_Monitoring_of_Mean_and_Variance_An_Overview","264491004_A_Distribution-free_Control_Chart_for_the_Joint_Monitoring_of_Location_and_Scale","323347263_Conditional_Double_Sampling","314768515_Introduction_to_Statistical_Quality_Control","314310246_Introduction_to_Statistical_Quality_Control","305916162_The_design_of_a_new_repetitive_sampling_control_chart_based_on_process_capability_index","281956173_Comparison_of_the_Xo_Chart_and_the_t_Chart_When_the_Parameters_are_Estimated","278821552_Design_of_the_c_and_np_Charts_when_the_Parameters_are_Estimated","274565976_The_Difficulty_in_Designing_Shewhart_X-bar_and_X_Control_Charts_with_Estimated_Parameters"]}