{"id":"312081414_Toward_a_Social_Psychophysics_of_Face_Communication","abstract":"As a highly social species, humans are equipped with a powerful tool for social\ncommunication—the face. Although seemingly simple, the human face can\nelicit multiple social perceptions due to the rich variations of its movements,\nmorphology, and complexion. Consequently, identifying precisely what face\ninformation elicits different social perceptions is a complex empirical challenge\nthat has largely remained beyond the reach of traditional methods.\nIn the past decade, the emerging field of social psychophysics has developed\nnew methods to address this challenge, with the potential to transfer\npsychophysical laws of social perception to the digital economy via avatars\nand social robots. At this exciting juncture, it is timely to review these new\nmethodological developments. In this article, we introduce and review the\nfoundational methodological developments of social psychophysics, present\nwork done in the past decade that has advanced understanding of the face\nas a tool for social communication, and discuss the major challenges that lie\nahead.","authors":["Rachael E Jack","Philippe G Schyns"],"meta":["January 2017Annual Review of Psychology 68(1):269-297","DOI:10.1146/annurev-psych-010416-044242"],"references":["303505033_Contextual_sensitivity_in_scientific_reproducibility","301300038_Four_Not_Six_Revealing_Culturally_Common_Facial_Expressions_of_Emotion","285782525_Tracing_the_Flow_of_Perceptual_Features_in_an_Algorithmic_Brain_Network","282651407_Illumination_effects_in_face_recognition","282047847_The_Voice_Conveys_Emotion_in_Ten_Globalized_Cultures_and_One_Remote_Village_in_Bhutan","322116573_Pigmentocracies_Ethnicity_Race_and_Color_in_Latin_America","308045193_The_Psychology_of_Close_Relationships_Fourteen_Core_Principles","298954662_Smile_Through_Your_Fear_and_Sadness","290254789_Emotion_Expression_The_Evolutionary_Heritage_in_the_Human_Voice","288059140_Anthropometric_Analysis_of_the_Face"]}