{"id":"312043417_A_Multivariate_Approach_for_Patient-Specific_EEG_Seizure_Detection_Using_Empirical_Wavelet_Transform","abstract":"Objective: This paper investigates the multivariate oscillatory nature of electroencephalogram (EEG) signals in\nadaptive frequency scales for epileptic seizure detection. \n\nMethods:\nThe empirical wavelet transform (EWT) has been explored for the multivariate signals in order to determine the joint instantaneous amplitudes and frequencies in signal adaptive frequency scales. The proposed multivariate extension of EWT has been studied on multivariate multi-component synthetic signal, as well as on multivariate EEG signals of CHB-MIT scalp EEG database. In a moving window based analysis, two\nseconds long multivariate EEG signal epochs containing five automatically selected channels have been decomposed and three features have been extracted from each one second part of the two second long joint instantaneous amplitudes of multivariate EEG signals. The extracted features from each oscillatory level\nhave been processed using a proposed feature processing step and joint features have been computed in order to achieve better discrimination of seizure and seizure-free EEG signal epochs.\n\nResults: The proposed detection method has been evaluated over 177 hours of EEG records using six well known classifiers. We have achieved average sensitivity, specificity and accuracy values as 97.91% and 99.57% and 99.41% respectively, using ten-fold cross-validation method, which are significantly higher than the existing state of art methods studied on this database. \n\nConclusion: Efficient detection of epileptic seizure is possible when seizure events appear for long duration in hours long EEG recordings. Significance: The proposed method develops time-frequency plane for multivariate signals and builds patient specific models for EEG seizure detection.","authors":["Abhijit Bhattacharyya","Ram Bilas Pachori"],"meta":["January 2017IEEE transactions on bio-medical engineering PP(99)","DOI:10.1109/TBME.2017.2650259","Project: PhD work"],"references":["309358470_A_novel_approach_for_automated_detection_of_focal_EEG_signals_using_empirical_wavelet_transform","298787743_Automated_Diagnosis_of_Glaucoma_Using_Empirical_Wavelet_Transform_and_Correntropy_Features_Extracted_From_Fundus_Images","287806341_Analysis_of_High-Dimensional_Phase_Space_via_Poincare_Section_for_Patient-Specific_Seizure_Detection","316807099_Wavelets_in_Neuroscience","314153492_Gait_Rhythm_Fluctuation_Analysis_for_Neurodegenerative_Diseases_by_Empirical_Mode_Decomposition","313423537_The_empirical_mode_decomposition_and_the_Hilbert_spectrum_for_nonlinear_and_non-stationary_time_series_analysis","301346768_On_discriminative_vs_generative_classifiers_A_comparison_of_logistic_regression_and_naive_bayes","288906520_Random_forests","280537290_Methods_of_automated_absence_seizure_detection_interference_by_stimulation_and_possibilities_for_prediction_in_genetic_absence_models","280353766_Selective_Time-Frequency_Reassignment_Based_on_Synchrosqueezing"]}