{"id":"312036564_Security_Enhancement_Architectural_Model_for_IMS_based_Networks","abstract":"Objectives: The IP Multimedia Subsystem (IMS) is an architectural framework for delivering protocol-based services that enables an easy deployment of new rich multimedia services mixing voice and data. In fact, the IMS is vulnerable to several malicious uses that can be conducted by its users. We propose in this paper, a security enhancement architectural model to monitor the system and build a rapid and normal functioning retrieval after failing. Methods/Statistical Analysis: The weakness of the IMS network topology structure makes it a target for both normal cellular threats and IP-related threats. We propose a model that consists of dividing a complex set of end-of-end (IMS-based) network security related features into separate architectural components, layers and tiers in order to divide the system and to be more precise in the problems' detection phase. Findings: Using the proposed approach, an effective evaluation study is investigated. The simulated network adopting our model showed an excellent behavior. The quality metric measuring call quality showed some excellent results. In other words, the adoption of the proposed model does not affect the normal frame delays, packet arrival durations and packet loss rates. The results showed how our proposed model is lightweight and effective in handling security issues. Application/Improvements: This paper fulfills a huge need of handling security using an effective lightweight architectural model adopting the proposed approach. Our methodology ensures designing a secure, flexible and easily monitored network with a rapid location of the affected areas and effective security supervision.","authors":["Ilyas Ed-daoui","Tomader Mazri","Nabil Hmina"],"meta":["December 2016Indian Journal of Science and Technology 9(46)","DOI:10.17485/ijst/2016/v9i46/107348","Project: The Enhancement of Security and Reliability Aspects of IMS-based Networks"],"references":["279263961_Lightweight_Security_Solutions_for_LTELTE-A_Networks","277469807_Critical_security_review_and_study_of_DDoS_attacks_on_LTE_mobile_network","273134418_IP_multimedia_subsystem_Security_evaluation","3199715_The_IMS_service_platform_A_solution_for_next-generation_network_operators_to_be_more_than_bit_pipes","42804230_Model-based_Vulnerability_Analysis_of_IMS_Network","4080154_SCIDIVE_A_stateful_and_cross_protocol_intrusion_detection_architecture_for_voice-over-IP_Environments"]}