{"id":"312076778_Implementing_an_Entrustable_Professional_Activities_Framework_in_Undergraduate_Medical_Education_Early_Lessons_From_the_AAMC_Core_Entrustable_Professional_Activities_for_Entering_Residency_Pilot","abstract":"In 2014, the Association of American Medical Colleges (AAMC) published a list of 13 Core Entrustable Professional Activities for Entering Residency (Core EPAs) that medical school graduates might be expected to perform, without direct supervision, on the first day of residency. Soon after, the AAMC commissioned a five-year pilot with 10 medical schools across the United States, seeking to implement the Core EPA framework to improve the transition from undergraduate to graduate medical education.\nIn this article, the pilot team presents the organizational structure and early results of collaborative efforts to provide guidance to other institutions planning to implement the Core EPA framework. They describe the aims, timeline, and organization of the pilot as well as findings to date regarding the concepts of entrustment, assessment, curriculum development, and faculty development. On the basis of their experiences over the first two years of the pilot, the authors offer a set of guiding principles for institutions intending to implement the Core EPA framework. They also discuss the impact of the pilot, its limitations, and next steps, as well as how the pilot team is engaging the broader medical education community. They encourage ongoing communication across institutions to capitalize on the expertise of educators to tackle challenges related to the implementation of this novel approach and to generate common national standards for entrustment. The Core EPA pilot aims to better prepare medical school graduates for their professional duties at the beginning of residency with the ultimate goal of improving patient care.","authors":["Kimberly Lomis","Jonathan Amiel","Michael S Ryan","Karin Esposito"],"meta":["June 2017Academic medicine: journal of the Association of American Medical Colleges 92(6):1","DOI:10.1097/ACM.0000000000001543","Project: Core EPAs"],"references":["285584910_Entrustment_Decision_Making_in_Clinical_Training","280042663_Curriculum_development_for_the_workplace_using_Entrustable_Professional_Activities_EPAs_AMEE_Guide_No_99","313563596_Nuts_And_bolts_of_entrustable_professional_activities","301537525_Toward_Defining_the_Foundation_of_the_MD_Degree_Core_Entrustable_Professional_Activities_for_Entering_Residency","297724914_The_Gap_Between_Current_and_Ideal_Approaches_to_the_Core_EPAs_A_Mixed_Methods_Study_of_Recent_Medical_School_Graduates","281138025_Mastery_Learning_With_Deliberate_Practice_in_Medical_Education","273631533_The_Case_for_Use_of_Entrustable_Professional_Activities_in_Undergraduate_Medical_Education","268578667_12_Tips_for_programmatic_assessment","263293714_Entrustable_Professional_Activities_and_Curricular_Milestones_for_Fellowship_Training_in_Pulmonary_and_Critical_Care_Medicine_Executive_Summary_from_the_Multi-Society_Working_Group","262817138_An_Entrustable_Professional_Activity_EPA_for_Handoffs_as_a_Model_for_EPA_Assessment_Development"]}