{"id":"312015882_Linked_Open_Vocabularies_LOV_A_gateway_to_reusable_semantic_vocabularies_on_the_Web","abstract":"One of the major barriers to the deployment of Linked Data is the difficulty that data publishers have in determining which vocabularies to use to describe the semantics of data. This systematic report describes Linked Open Vocabularies (LOV), a high-quality catalogue of reusable vocabularies for the description of data on the Web. The LOV initiative gathers and makes visible indicators such as the interconnections between vocabularies and each vocabulary's version history, along with past and current editor (individual or organization). The report details the various components of the system along with some innovations, such as the introduction of a property-level boost in the vocabulary search scoring that takes into account the property's type (e.g., dc:comment) associated with a matching literal value. By providing an extensive range of data access methods (full-text search, SPARQL endpoint, API, data dump or UI), the project aims at facilitating the reuse of well-documented vocabularies in the Linked Data ecosystem. The adoption of LOV by many applications and methods shows the importance of such a set of vocabularies and related features for ontology design and the publication of data on the Web.","authors":["Pierre-Yves Vandenbussche","Ghislain Auguste Atemezing","María Poveda-Villalón","Bernard Vatant"],"meta":["January 2017Semantic Web 8(3):437-452","DOI:10.3233/SW-160213"],"references":["311822054_The_ProtegeLOV_Plugin_Ontology_Access_and_Reuse_for_Everyone","281801533_Deploying_Linked_Open_Vocabulary_LOV_to_Enhance_Library_Linked_Data","280113400_Five_Stars_of_Linked_Data_Vocabulary_Use","269390892_LIVE_a_Tool_for_Checking_Licenses_Compatibility_between_Vocabularies_and_Data","268335916_Towards_Licenses_Compatibility_and_Composition_in_the_Web_of_Data","264458610_Ontology_Search_An_Empirical_Evaluation","312447704_Linked_data_-_design","290767285_Adoption_of_the_Linked_Data_Best_Practices_in_Different_Topical_Domains","289513018_Linked_USDL_A_Vocabulary_for_Web-Scale_Service_Trading","286959268_YASGUI_Not_just_another_SPARQL_client"]}