{"id":"31208039_Dangerization_and_the_End_of_Deviance_The_Institutional_Environment","abstract":"After Durkheim and after Foucault the idea of deviance from the community's norms has been the central principle for explaining definitions of crime and justification of punishment. Deviance has become a backwards definition of normality, and culture effectively bans unacceptable behaviour. Deviance is a form of dysfunction, punishment is part of the return route to rationality. In Foucault's conception punishment is not retributive or retaliatory, but the cultural reconstruction of the subject. Though the most modern critique of society does not go beyond Foucault, the processes of late modernity have made this whole approach invalid. The boundary between normal and deviant has largely been erased. Deviance can no longer be treated as marginalized behaviour of marginalized persons. And yet, something recognized as ‘crime’ is a live issue, crime endangers the citizens and risk of crime takes centre stage, objectified along with other risks. The scale of necessary rethinking of the relation of crime to society can only be sketched in this article. Risk, not crime, has become the central culture register of social interaction. Connecting later modernity and risk opens new spaces for sociological theory. Media and politicians insist on the advent of a newly dangerous, uncertain world, associated with environmental problems and to technologies which produce them, chemical, nuclear and biotechnical. The analysis is always from inside the culture, the risks are objectified, risk itself is not regarded as a socio-cultural product. The engineer's specialized professional perception of risk as an object-to-object category is now being replaced by a society-to-object notion. The critique brought by cultural theory is that risk, like crime, is essentially a society-to-society product. The idea of ‘dangerization’ is useful to introduce the idea that sensibility to threat is built by cultural means. By a circular process of amplification the consciousness of a dangerous society enhances that of a dangerous material world. Risk is a projection to the present through the future. Without a hypothesized future, risk cannot be established. But according to cultural theory such a hypothesis of the future can never be a ‘neutral prediction’. It sees such predictions as attempts to manage collective patterns of fear which follow lines of social stratification. The liberal vision of equality before the law is neutralized by assigning dangerousness to specific social identities. Belonging to a particular social group establishes or excludes the sense of threat and disarms or arms segregating avoidance strategies. Society is more deeply divided than ever on principles of security-seeking. The probability of victimization is at the centre of segregation. Systems, strategies and tactics based on suspicion, backed by probability, produce rearrangements of population on the basis of secure and non-secure areas. Means and times of transport are chosen on the same basis, and there is no later modern space without consciousness of dangerousness. The argument here must turn to the changes in the social bond which have followed from changes in the technology of communication. It helps the case to present a view of society as a system of permissions to access. The turnstile, the credit card and the password can be taken to represent a process which has put all access on to an automated basis. The need to build up relations of trust is reduced, almost eliminated. Either the card giving access to money or information is technically valid, or it is not. Social control is taken out of interpersonal interaction and handed over to an automated basis. No more need for negotiation of personal ties, no need for polished social skills, no need to demonstrate ethical probity, the new social divisions are defined by having or not having the right mechanical means of identification at each level. Automated access replaces personal trust. The effect is to further weaken neighbourhood ties where co-residents do not need to relate to one another at all and atomization of kinship units is complete. In the dangerized society ethical evaluation is irrelevant, or at best deflected on to safety concerns. What can deviance theory do? Deviating from what? Where are the norms? The response to anomie is a danger-aware culture, where all the other classifications have gone and all that is left in the way of structure is in automated systems: instead of social distinction, the much cruder indicators: gender and age give signals of dangerous identities. Deviance can still be defined by exclusion from card-holding. Crime can be divided into fear-provoking and non fear-provoking. Social institutions denuded of moral responsibility are mere distribution systems. The ethics of consumerism take command. The evaluation of objects and persons focuses on safety, and the producer's responsibility for selling safe products is the criterion for good government.","authors":["Michalis Lianos"],"meta":["March 2000British Journal of Criminology 40(2)","DOI:10.1093/bjc/40.2.261"],"references":["324662094_From_the_Panopticon_to_Disney_World_The_Development_of_Discipline","312408018_Studying_the_political_economy_of_media_and_information","340120037_Merton_versus_Hirschi_Who_Is_Faithful_to_Durkheim's_Heritage","329687880_Actuarial_Justice_The_Emerging_New_Criminal_Law","324284522_The_Coming_of_Post-Industrial_Society_A_Venture_in_Social_Forecasting","323321406_Purity_and_Danger_An_Analysis_of_Concepts_of_Pollution_and_Taboo","284619507_A_24-year_follow-up_of_men_from_vulnerable_backgrounds","281562288_Discipline_and_Punish_The_Birth_of_Prison","273086535_The_Prison_and_the_Factory_Origins_of_the_Penitentiary_System","270016197_Risk_and_Culture_An_Essay_on_the_Selection_of_Technological_and_Environmental_Dangers"]}