{"id":"312043284_Proposed_Conceptual_Framework_of_Dengue_Active_Surveillance_System_DASS_in_Malaysia","abstract":"This paper introduces Dengue Active Surveillance System (DASS) framework for an early warning system of the outbreak. Dengue and dengue hemorrhagic fever are emerging as major public health problems in most Asian countries such as Malaysia. Effective prevention and control programs will depend on improved surveillance. A new approach to active surveillance outlined with emphasis on the inter-epidemic period. The objective is to develop an early warning surveillance system (framework) that can predict epidemic dengue to improve current passive surveillance system available in Malaysia. Basically, the framework introduced data harvesting process from multiple sources as input, data pre-processing using data aggregator and filtering engine, storing large data in repository, analytic engine for analysis and processing the large data, and presentation of the information to the users. The data harvested from two major sources such as weather or flood information, and social media such as build development and dengue symptom using system API, SOAP and others. The data aggregator will aggregate the data from three different types of data such as structured, semi-structured and unstructured data to be stored into the semi-structured database such as MongoDB and NoSQL. The data parse to the filtering engine for filtering and cleaning the data sources using suitable keywords prior to store it in the large data repository. After that, the large data will be processed and analyzed using algorithm or mathematical calculation to determine the expected dengue cases. Then, the processed information will be presented to the users in a form of web or mobile application and other method, for example, short message service (SMS). Finally, the system accuracy will be evaluated based on the comparison study with the traditional passive system.","authors":["Mohd Khalit Othman","Mohd Shahrul Nizam Mohd Danuri"],"meta":["May 2016","DOI:10.1109/ICICTM.2016.7890783","Conference: International Conference on Information & Communication Technology MalaysiaAt: UniKL Kuala Lumpur","Project: Dengue Active Surveillance System (DASS)"],"references":["274095304_Dengue_disease_outbreak_definitions_are_implicitly_variable","263585177_Insecticide_susceptibility_and_dengue_vector_status_of_wild_Stegomyia_albopicta_in_a_strategically_important_area_of_Assam_India","261226107_Big_Data_Issues_and_Challenges_Moving_Forward","259272881_Assessing_the_Risk_of_Dengue_Fever_Based_On_the_Epidemiological_Environmental_and_Entomological_Variables","245586264_Perubahan_Cuaca_Dan_Penyakit_Denggi_Kajian_Kes_Di_Daerah_Seremban_Negeri_Sembilan_Malaysia","239543354_Using_Service-Oriented_Architecture_and_Component-Based_Development_to_Build_Web_Service_Applications","236948161_Trends_of_dengue_infections_in_Malaysia_2000-2010","319394404_Designing_the_user_interface_strategies_for_effective_human-computer_interaction","288244740_Spatial_mapping_of_dengue_incidence_A_case_study_in_Hulu_Langat_District_Selangor_Malaysia","248504034_Designing_the_User_Interface_4th_Ed"]}