{"id":"312009642_Semantic_Similarity_in_the_Gene_Ontology","abstract":"Gene Ontology-based semantic similarity (SS) allows the comparison of GO terms or entities annotated with GO terms, by leveraging on the ontology structure and properties and on annotation corpora. In the last decade the number and diversity of SS measures based on GO has grown considerably, and their application ranges from functional coherence evaluation, protein interaction prediction, and disease gene prioritization.\nUnderstanding how SS measures work, what issues can affect their performance and how they compare to each other in different evaluation settings is crucial to gain a comprehensive view of this area and choose the most appropriate approaches for a given application.\nIn this chapter, we provide a guide to understanding and selecting SS measures for biomedical researchers. We present a straightforward categorization of SS measures and describe the main strategies they employ. We discuss the intrinsic and external issues that affect their performance, and how these can be addressed. We summarize comparative assessment studies, highlighting the top measures in different settings, and compare different implementation strategies and their use. Finally, we discuss some of the extant challenges and opportunities, namely the increased semantic complexity of GO and the need for fast and efficient computation, pointing the way towards the future generation of SS measures.","authors":["Catia Pesquita"],"meta":["November 2017Methods in molecular biology (Clifton, N.J.) 1446:161-173","DOI:10.1007/978-1-4939-3743-1_12"],"references":["301847861_Primer_on_the_Gene_Ontology","285668548_Gene_ontology_Tool_for_the_unification_of_biology","264972121_The_impact_of_incomplete_knowledge_on_the_evaluation_of_protein_function_prediction_A_structured-output_learning_perspective","261034600_GOssTo_A_stand-alone_application_and_a_web_tool_for_calculating_semantic_similarities_on_the_Gene_Ontology","260945583_Using_Entropy_Estimates_for_DAG-Based_Ontologies","257839866_Annotation_extension_through_protein_family_annotation_coherence_metrics","313136314_Metrics_for_GO_based_protein_semantic_similarity_A_systematic_evalua_tion","289645491_Use_of_OWL_within_the_Gene_Ontology","270290306_Semantic_similarity_measurement_between_gene_ontology_terms_based_on_exclusively_inherited_shared_information","259161526_A_framework_for_unifying_ontology-based_semantic_similarity_measures_A_study_in_the_biomedical_domain"]}