{"id":"312036354_The_Development_of_Reusable_Luggage_Tag_with_the_Internet_of_Things_for_Mobile_Tracking_and_Environmental_Sustainability","abstract":"With more than two billion passengers worldwide travelling by air each year, vast amounts of lost luggage and disposable paper adhesive luggage tags are pushing the aviation industry to improve luggage tracking and reduce the one-off adhesive luggage paper tags. This paper reviews the current application of Radio Frequency Identification (RFID) in the luggage handling system and proposes the Internet of Things’ (IoT) development of the reusable luggage tag to facilitate aviation luggage handling, the tracking process and environmental conservation. A framework of IoT and its RFID components for the proposed reusable tag are presented. An integrated cyber-physical system, including a database management system and mobile app, for the reusable luggage tag is developed. Future studies will enhance the methodology of integrating the retail system, luggage tag, airport check-in counter, luggage handling system, aircraft, and the destination airport through the use of the tag, readers, antenna, and mobile devices.","authors":["Eugene Wong","Collin Wong"],"meta":["December 2016Sustainability 9(1):58","DOI:10.3390/su9010058"],"references":["308438709_Design_and_Optimization_of_Luggage_Tracking_System_on_Airport","281034120_Mining_Risk_Factors_in_RFID_Baggage_Tracking_Data","276117373_Application_of_RFID_Technology_for_Logistics_on_Internet_of_Things","271560564_Research_on_Key_Technology_and_Applications_for_Internet_of_Things","261351611_An_Interactive_RFID-based_Bracelet_for_Airport_Luggage_Tracking_System","259186800_Application_of_RFID_in_Aviation_Industry_An_Exploratory_Review","301800522_Towards_smart_wearable_real-time_airport_luggage_tracking","295830172_An_Efficient_RFID-based_Tracking_System_for_Airport_Luggage","265346251_A_Preliminary_Study_to_Increase_Baggage_Tracking_by_using_a_RFID_Solution","260414240_Internet_of_Things"]}