{"id":"312023090_Academics'_Awareness_Towards_Mobile_Learning_in_Oman","abstract":"Mobile Learning (M-Learning) witnessed a booming evolution contributed to the evolvement of learning within the higher educational settings. M-Learning enhances the collaboration between the educators and their students on anytime anywhere settings. Attitudes towards the utilization of M-Learning help the decision makers in building the required infrastructure. Our literature review indicated that there are very few studies that address the issue of educators’ awareness towards M-Learning which is a very significant factor for the success of smart education. In this study, a questionnaire survey has been administrated at Al Buraimi University College, Oman in order to examine the educators’ awareness and attitudes towards the utilization of M-Learning. Findings revealed that female instructors were more positive than males towards the utilization of M-Learning. Moreover, results revealed that academics who indicated that mobile technology is an effective tool in education were highly optimistic towards the utilization of M-Learning than those who were not. Nevertheless, results were not pointed any significant differences with regard to the academics’ perceptions towards the utilization of M-Learning in relation to age and academic qualifications factors, showing that M-learning can be embraced by all academics irrespective of the age and qualifications factors.","authors":["Mostafa Al-Emran","Khaled Shaalan"],"meta":["January 2017IJCDS Journal 6(1):45-50","DOI:10.12785/ijcds/060105"],"references":["334812582_Mobile_learning_perceptions_of_the_prospective_teachers_TUrkish_Republic_Of_Northern_Cyprus_sampling","309426869_The_Impact_of_Google_Apps_at_Work_Higher_Educational_Perspective","301410944_Comparative_Analysis_of_Freemium_Policies_and_Procedure_between_Major_Mobile_Platforms","281791410_Comparative_Analysis_of_Freemium_Policies_and_Procedure_between_Major_Mobile_Platforms","345803161_Mobilizing_Digital_Museums_with_3D_Photography","288243181_Effects_of_smartphone-based_learning_properties_on_user_satisfaction_and_recommendation_intention","285549555_Investigating_attitudes_towards_the_use_of_mobile_learning_in_higher_education","284969392_Bridging_formal_and_informal_learning_A_mobile_learning_attitude_scale_for_higher_education","282286769_Learners_and_Educators_Attitudes_Towards_Mobile_Learning_in_Higher_Education_State_of_the_Art","281807659_Cross-platform_Mobile_Applications_with_Web_Technologies"]}