{"id":"312021067_HDR_Modeling_the_Individual_Within_the_Group_an_Interdisciplinary_Approach_to_Collaborative_Knowledge_Construction","abstract":"Constructing knowledge with others is fundamental for all human activity, and many disciplines have sought to understand how the individual, other people, and the context, all influence collaborative knowledge construction, be it individual or group knowledge. The goal of this Habilitation à Diriger des Recherches is to present an analytical model of the relations of the individual to the group in situations of collaborative knowledge construction. The model is inspired by the work of Levinson (2005) who proposes variables that mediate between kinds of systems (e.g. linguistic, interactional, social) that are interlocked in various ways. After describing my personal trajectory and acknowledging those who have been influential in this work, I review the literature with five goals in mind. \nFirst, I examine the interests and dangers of integrating work across disciplinary boundaries and I make a case in favor of interdisciplinarity. Second, I perform a cross disciplinary analysis of the individual versus the group in learning contexts. Here, I select studies that represent the four major paradigms used to study learning: behaviorist, cognitivist, sociocognitivist, and sociocultural and I analyze how those paradigms shape the assumptions researchers make about their object of study. I also illustrate the tensions that exist regarding how different approaches conceptualize the place of the individual in relation to the group, on what timescale and whether these tensions are fruitful or on the contrary, contribute to hindering scientific progress. Third, I introduce the notion of methodological determinism and argue against it, showing that theoretical assumptions are not embedded in methods and that researchers have agency in choosing those they wish to adhere to, thus avoiding possible incoherence when combining research methods from different fields. Fourth, I review how different research fields attribute explanatory value and I examine three ways to bridge across levels of analysis that relate the individual to the group. In the analytical model I propose, I opt for both bridging by explaining different aspects of a phenomenon and bridging through intermediate variables. Fifth, I compare methods of investigation for connecting levels of analysis through a discussion of causality and generalization that has implications for interdisciplinary work.\nThese five goals give the background needed to perform the analysis of a selection of my own interdisciplinary collaborative work that give rise to my analytical model, called “Multi-grain” knowledge building where “Multi-grain” stands for a MULTi-theoretical and Interdisciplinary model of the GRoup And Individual. The collaborative work I chose to analyze was carried out within educational sciences and language sciences, and more specifically in physics didactics, educational psychology, pedagogical debate, argumentation, interactional linguistics, and psycholinguistics. \nMulti-grain knowledge building allows researchers to connect cognitive, linguistic, interactional, and social systems through the use of intermediate variables that are composed of facets of human interaction. Mutually influential facets allow us to view complex behavior as a system of interrelated systems (Levinson, 2005). Multi-grain knowledge building gives a framework that allows systems within different disciplines to “speak” to each other and defines the space in which explanatory models can be proposed about the different forms of knowledge co-construction. In each of the models issued from my collborative work that served to develop the Multi-grain knowledge building model, the intermediate variable is one whose nature changes over time in a way that is comparable to conceptual change : 1) the semiotic bundle can illustrate conceptual change in physics for both individuals and groups, 2) the procedural explanation can illustrate changing competence (both cognitive and interactional-pragmatic) as children’s language develops, 3) overall emotional framing of a debate can illustrate the group’s argumentative complexity and degree of dialogism, as it is constructed over time while also illustrating individual competencies concerning emotional positioning of argumentative claim and 4) level of collaboration can illustrate the trajectory of a participant as she becomes a more active member of a community of practice. \nMulti-grain knowledge building makes evident that some of the knowledge we co-construct in human interaction is a focus of explicit teaching while other knowledge is (more or less) naturally acquired as a function of the contexts in which we find ourselves. Learning physics is definitely a target of explicit teaching, but the pragmatic competencies involved in managing interaction while giving finalized procedural explanations has never been a teacher’s preoccupation. Nor has any teacher written pedagogical tasks that help students to construct the emotional positioning of an argumentative claim. And achieving a level of collaborative relationship in a community of practice has never been the focus of training. The distinction between competencies that are taught and those that are naturally acquired raises questions about how societies select knowledge to be taught in a formal manner.\nPerspectives for future work include understanding more deeply the multidirectional causality between the different facets of interaction within my current collaborative work. Second, I will also use my work in scientometrics to increase the scope of the Multi-grain model of knowledge construction and to pinpoint new areas where Multi-grain knowledge building can help in decompartmentalizing the research in education, opening it up to other disciplinary perspectives.","authors":["Kristine Lund"],"meta":["July 2016","DOI:10.13140/RG.2.2.26845.61923","Thesis for: L'Habilitation à Diriger des Recherches","Project: Modeling the Individual Within the Group: an Interdisciplinary Approach to Collaborative Knowledge Construction"],"references":["327474157_Who_says_what's_correct_and_how_do_you_say_it_Multimodal_management_of_oral_peer-assessment_in_a_grammar_boardgame_in_a_foreign_language_classroom","352073275_Les_sciences_cognitives_ne_sont_pas_des_sciences_humainesCognitive_sciences_are_not_social_sciences_Une_reponse_a_Vers_un_naturalisme_social_de_Laurence_Kaufman_et_Laurent_Cordonier","339127122_Individualisme_methodologique_et_cognitivisme","334062672_The_Cultural_Origins_of_Human_Cognition","331252099_Logique_naturelle_et_communication","330933658_Interaction_and_collaboration_in_scientific_communities_and_an_attempt_to_foster_newcomer_integration","330933651_Kooperationsnetzwerke_in_der_Wissenschaft_und_die_Integration_von_Doktoranden_in_eine_Scientific_Community","329653912_Discovering_Complexity_Decomposition_and_Localization_as_Strategies_in_Scientific_Research","324337273_Language_in_Relation_to_a_Unified_Theory_of_the_Structure_of_Human_Behavior","324308514_Plans_and_Situated_Actions_The_Problem_of_Human-Machine_Communication","324306533_An_Introduction_to_Functional_Grammar","321603869_Arguing_to_Learn_Confronting_Cognitions_in_Computer-Supported_Collaborative_Learning_Environments","321300499_The_Cambridge_handbook_of_the_learning_sciences_second_edition","319538620_Finding_a_Middle_Ground_Wars_Never_Settle_Anything","319538523_Les_dangers_de_la_theorisation_avant_analyse_trois_cas_d'etude_portant_sur_l'argumentation_et_la_cognition"]}