{"id":"312067495_Efficient_multi-scale_3D_CNN_with_fully_connected_CRF_for_accurate_brain_lesion_segmentation","abstract":"We propose a dual pathway, 11-layers deep, three-dimensional Convolutional Neural Network for the challenging task of brain lesion segmentation. The devised architecture is the result of an in-depth analysis of the limitations of current networks proposed for similar applications. To overcome the computational burden of processing 3D medical scans, we have devised an efficient and effective dense training scheme which joins the processing of adjacent image patches into one pass through the network while automatically adapting to the inherent class imbalance present in the data. Further, we analyze the development of deeper, thus more discriminative 3D CNNs. In order to incorporate both local and larger contextual information, we employ a dual pathway architecture that processes the input images at multiple scales simultaneously. For post-processing of the network's soft segmentation, we use a 3D fully connected Conditional Random Field which effectively removes false positives. Our pipeline is extensively evaluated on three challenging tasks of lesion segmentation in multi-channel MRI patient data with traumatic brain injuries, brain tumours, and ischemic stroke. We improve on the state-of-the-art for all three applications, with top ranking performance on the public benchmarks BRATS 2015 and ISLES 2015. Our method is computationally efficient, which allows its adoption in a variety of research and clinical settings. The source code of our implementation is made publicly available.","authors":["Konstantinos Kamnitsas","Christian Ledig","Virginia F J Newcombe","JP Simpson"],"meta":["January 2017","DOI:10.17863/CAM.6936","Project: Anaesthesia and Intensive Care"],"references":["311435412_Robust_whole-brain_segmentation_Application_to_traumatic_brain_injury","319770272_Delving_Deep_into_Rectifiers_Surpassing_Human-Level_Performance_on_ImageNet_Classification","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","319770168_Fully_Convolutional_Networks_for_Semantic_Segmentation","312429903_Understanding_the_difficulty_of_training_deep_feed_forward_neural_networks","309456849_Segmentation_of_brain_tumor_tissues_with_convolutional_neural_networks","309456686_Brain_tumor_segmentation_with_deep_neural_networks","309394682_Multiscale_3d_convolutional_neural_networks_for_lesion_segmentation_in_brain_MRI","309029767_Deep_Convolutional_Neural_Networks_for_the_Segmentation_of_Gliomas_in_Multi-sequence_MRI","308845624_Deep_neural_networks_for_anatomical_brain_segmentation"]}