{"id":"312113959_Innovative_engineering_education_in_the_cooperative_VR_environment","abstract":"In the scope of the article, there is the presentation of the cyber-higher educational environment feasible by the technical innovations appearing rapidly and the investigation of the methods which can be applied successfully in the educational scene of the future. My goal was to create an educational scene suiting to the digital life of the CE generation students-called Z generation and alpha generation in the traditional generation theories, but clearly called CE and the CCE generation in the CogInfoCom theory — presently studying in the higher education of engineering and meeting the students requirements set against the learning environment. The educational method presented in the article and the research aiming at defining the strategy suit to the science of CogInfoCom supplementing it with an additional pedagogical aspect. The study shows an example for presenting the realization of how we can teach the future technologies to the the future engineers with the help of the present and modern technologies by applying innovative educational methods so that the the human and the ICT merges during work in the coopertative VR scene suiting mostly to the CE genetations digital life while the development of the future technologies is happenning. The cooperative VR learning environment presented in the article ensures an efficient educational scene for the higher education of engineering due to its project-based educational opportunity and at the same time it allows the education of the disruptive technologies appearing more and more extensively, even immediately after the appearance of the technology.","authors":["Ildikó Horváth"],"meta":["October 2016","DOI:10.1109/CogInfoCom.2016.7804576","Conference: 2016 7th IEEE International Conference on Cognitive Infocommunications (CogInfoCom)"],"references":["257422615_Definition_and_Synergies_of_Cognitive_Infocommunications","239546895_Learning_with_Media","224259080_VirCA_as_Virtual_Intelligent_Space_for_RT-Middleware","304297023_Empirical_findings_in_cognitive_entity_management_A_challenge_in_the_digital_era","304296831_The_cognitive_entity_generation_Emergent_properties_in_social_cognition","287596085_Cognitive_Infocommunications_CogInfoCom","265024841_Design_programming_and_orchestration_of_heterogeneous_manufacturing_systems_through_VR-powered_remote_collaboration","257422714_VirCA_NET_A_Collaborative_Use_Case_Scenario_on_Factory_Layout_Planning","242685519_Review_of_educational_research"]}