{"id":"312143643_European_legal_taxonomy_syllabus_A_multi-lingual_multi-level_ontology_framework_to_untangle_the_web_of_European_legal_terminology","abstract":"This paper describes a new concept of legal ontology together with an ontology development tool, called the European Legal Taxonomy Syllabus (ELTS). The tool is used to model the legal terminology created by the Uniform Terminology project on EU consumer protection law as an ontology. ELTS is not a formal ontology in the standard sense, i.e., an axiomatic ontology formalized, for instance, in description logic. Rather, it is a lightweight ontology, i.e. a knowledge base storing low-level legal concepts, connected via low-level semantic relations, and related to linguistic patterns that denote legal concepts in several languages spoken in the European Union (EU). In other words, ELTS is a multi-lingual and multi-jurisdictional terminological vocabulary enriched with concepts denoted by vocabulary entries, with semantic relations between different concepts. The choice of such an architecture is based on past studies in comparative law and is motivated by the need to reveal the differences between national systems within the EU. Past literature in comparative law highlights that axiomatic ontologies freeze legal knowledge in an unreal steadiness, i.e., they render it disconnected from legal practice. Much more flexibility is needed to make the knowledge base acceptable to legal practitioners. ELTS was developed together with legal practitioners on the basis of the comparative view of European law. The ontology framework is designed to help professionals study the meaning of national and European legal terms and how they inter-relate in the transposition of European Directives into national laws. The structure and user interface of ELTS is suitable for building multi-lingual, multi-jurisdictional legal ontologies in a bottom-up and collaborative manner, starting from the description of legal terms by legal experts. It also takes into account the interpretation of norms, the dynamic character of norms and the contextual character of legal concepts in that they are linked to their legal sources (legislation, case law and doctrine).","authors":["Gianmaria Ajani","Guido Boella","Luigi Di Caro","Livio Robaldo"],"meta":["January 2017Applied Ontology 11(4):1-51","DOI:10.3233/AO-170174"],"references":["331249044_Non-Compliance_with_EU_Directives_in_the_Member_States_Opposition_through_the_Backdoor","331199513_Non-Compliance_with_EU_Directives_in_the_Member_States_Opposition_through_the_Backdoor","316049340_Combining_InputOutput_Logic_and_Reification_for_Representing_Real-World_Obligations","304622324_Eunomos_a_legal_document_and_knowledge_management_system_for_the_Web_to_provide_relevant_reliable_and_up-to-date_information_on_the_law","325370885_Concepts_Core_Readings","320300370_Lightweight_Ontologies","320181808_The_Construction_of_Social_Reality","319393968_The_Logical_Form_of_Action_Sentences","313620522_Ontologies_Principles_methods_and_applications","300403178_Linking_legal_open_data"]}