{"id":"312100418_Land_cover_change_detection_using_GIS_and_remote_sensing_techniques_A_spatio-temporal_study_on_Tanguar_Haor_Sunamganj_Bangladesh","abstract":"Tanguar Haor is one of the two listed Ramsar Site of this country which contains a rich amount of biodiversity as well as a highly productive ecosystem. But the valuable landscape undergoes a radical change in its form over the decades. This study uses past and recent satellite data to evaluate the typical landscape change over the decades. Both pre-classification and post classification change detection approach was used to assess the change result from 1980 to 2010. In pre-classification approach CVA, NDVI and NDWI analysis were implemented to assess the change scenario. Maximum likelihood supervised classification technique was performed to create the signature class of significant land cover category (deep water, shallow water, vegetation, and settlement). After ensuring satisfactory accuracy value for each classified image a detail post classification change detection analysis was executed. Image differencing, statistical change detection techniques (transition probability matrix), change dynamics analysis was also operated to evaluate the statistics of past change relative to present. This study illustrated that, about 40% land cover of the total study area has been converted over 30years period. Forested and high land vegetation’s are disappearing rapidly, deep water bodies consist of large lakes are becoming the rare feature of the study area. Widespread development of settlement and dominant shallow water feature are converting the natural wetland a permanent low lying agricultural land.","authors":["Md. Inzamul Haque","Rony Basak"],"meta":["January 2017Egyptian Journal of Remote Sensing and Space Science 20(2):251-263","DOI:10.1016/j.ejrs.2016.12.003","Project:  Detection and Prediction of Land Cover Change Using GIS and Remote Sensing Techniques: A Spatio-Temporal Study on Tanguar Haor, Sunamganj, Bangladesh"],"references":["228718174_Comparative_performance_of_a_modified_change_vector_analysis_in_forest_change_detection","287717026_Classification_and_evolution_of_the_mangroves_of_India","283466347_Global_and_regional_burden_of_disease_and_risk_factors_systematic_analysis_of_population_health_data","278713101_Remote_Sensing_Digital_Image_Analysis","278706039_Remote_Sensing_Digital_Image_Analysis","261559088_Remote_Sensing_Imagery_for_Natural_Resource_Monitoring_A_Guide_for_First-Time_Users","248977497_Land_useland_cover_changes_in_the_coastal_zone_of_Ban_Don_Bay_Thailand_using_Landsat_5_TM_data","248977024_The_Use_of_Normalized_Difference_Water_Index_NDWI_in_the_Delineation_of_Open_Water_Features","247843806_The_Worldwide_Extent_of_Land-Use_Change","229677967_Land-use_change_and_urbanization_of_Adana_Turkey"]}