{"id":"312182813_The_Challenges_of_Online_Learning_Supporting_and_Engaging_the_Isolated_Learner","abstract":"p class=\"JLDAbstract\">Higher education providers are becoming increasingly aware of the diversity of their current and potential learners and are moving to provide a range of options for their engagement. The increasingly flexible delivery modes available for university students provide multiple pathways and opportunities for those seeking further education. In changing between and across modes, a one-size-fits-all approach is often used. That is, internal content is converted into a form deemed suitable for an external delivery. However, there is a significant problem with the one-size-fits-all approach for external students who feel or experience isolation. When compared to their internal counterparts, these students often face a number of barriers to their full participation in coursework units. These barriers may not be experienced by those engaging in these same units via face-to-face or blended enrolment modes and therefore present another type of learner to consider in the planning and implementation of learning activities online. The barriers to participation appear particularly evident in groupwork activities. The online environment also presents challenges for many academic staff who increasingly require higher levels of technological competency and proficiency on top of their regular academic workload. Drawing on reflections of several years of facilitating student learning online, this paper provides one lecturer’s perspective and critical commentary on some of the challenges faced by external students and the implications of an increasingly online delivery framework for practice.</p","authors":["Jenna K Gillett-Swan"],"meta":["January 2017Journal of Learning Design 10(1):20","DOI:10.5204/jld.v9i3.293"],"references":["307907064_How_Faculty_Learn_To_Teach_Online_What_Administrators_Need_to_Know","288841328_Digital_andragogy_A_richer_blend_of_initial_teacher_education_in_the_21st_century","283106098_Contributing_to_a_graduate-centred_understanding_of_work_readiness_An_exploratory_study_of_Australian_undergraduate_students'_perceptions_of_their_employability","276516858_Learning_Innovation_A_Framework_for_Transformation","275589401_Self-regulated_learning_strategies_academic_achievement_in_online_higher_education_learning_environments_A_systematic_review","348867555_Learning_in_Groups_A_Handbook_for_Face-to-Face_and_Online_Environments","325109279_Examining_Teachers'_Role_In_Using_Virtual_Learning_Environment_To_Support_Conventional_Education_In_Icelandic_Schools","292796578_The_myth_about_online_course_development","284244416_Digital_natives_come_of_age_the_reality_of_today's_early_career_teachers_using_mobile_devices_to_teach_mathematics","279618745_Synchronous_Learning_Experiences_Distance_and_Residential_Learners'_Perspectives_in_a_Blended_Graduate_Course"]}