{"id":"312144762_Severe_obesity_emotions_and_eating_habits_A_case-control_study","abstract":"Background: \nObesity has a multifaceted etiology that involves genetic, biological and behavioral factors, body growth, eating habits, energy expenditure and the function of adipose tissue. The present study aimed to expand upon knowledge about the relationships among obesity, emotions and eating habits in severely obese individuals using a case-control method.\n\nMethods: \nThe subject group consisted of 112 individuals (81 females and 31 males) receiving a permanent disability pension primarily for obesity. The control subjects were randomly selected from the same area and were receiving a disability pension for a different primary illness. The controls were matched with the subjects by the place of residence, sex, age, the time since the pension was granted and occupation. Psychiatric interviews were conducted on all participants. The results were analyzed using the chi-squared test (χ(2)-test) and the percent distribution. The subject and control groups were compared using the t-test for paired variables. Conditional logistic regression analysis was also conducted.\n\nResults: \nThe emotional state of eating was significantly associated with quarrels and feelings of loneliness. The subjects suffered from night eating syndrome, which was associated with an increased risk of early retirement. Binge eating syndrome was observed more frequently in the study group. The subjects reported feeling increased hunger compared with the controls. A significant percentage of the subjects had a body mass index of ≥ 40. No differences in eating habits were observed between the groups.\n\nConclusion: \nThis study provides information on the relationship between emotions and eating habits in obesity, which is a rarely studied topic. We believe that our study provides a novel and necessary overview of the associations among severe obesity, emotions and eating habits.","authors":["H. Marja T. Koski","Hannu Naukkarinen"],"meta":["December 2017BMC Obesity 4(1)","DOI:10.1186/s40608-016-0138-9"],"references":["290040561_Differentiating_among_internality_powerful_others_and_chance","256085735_Effect_of_BMI_and_Binge_Eating_on_Food_Reward_and_Energy_Intake_Further_Evidence_for_a_Binge_Eating_Subtype_of_Obesity","234698130_An_Examination_of_Food_Addiction_in_a_Racially_Diverse_Sample_of_Obese_Patients_with_Binge_Eating_Disorder_in_Primary_Care_Settings","287616752_Comprehensive_Textbook_of_Psychiatry_Vols_1_and_2","276202101_Seasonal_Affective_Disorders","270234560_Generalised_Linear_Models_in_Epidemiological_Research_Case-Control_Studies","236113129_Social_anxiety_and_disordered_overeating_An_association_among_overweight_and_obese_individuals","236090393_Stigmatizing_Attitudes_Differ_Across_Mental_Health_Disorders_A_Comparison_of_Stigma_Across_Eating_Disorders_Obesity_and_Major_Depressive_Disorder","236065050_Obesity_is_associated_with_white_matter_atrophy_A_combined_diffusion_tensor_imaging_and_voxel-based_morphometric_study","234696607_Food-related_impulsivity_in_obesity_and_Binge_Eating_Disorder_-_a_systematic_review"]}