{"id":"312147615_A_critical_review_of_flipped_classroom_challenges_in_K-12_education_Possible_solutions_and_recommendations_for_future_research","abstract":"An increasing number of teachers are using flipped classroom approach in their teaching. This instructional approach combines video-based learning outside the classroom and interactive group learning activities inside the classroom. The purpose of the present review is to provide an overview of flipped classroom studies in K-12 education. Particularly, we put emphasis on revealing and addressing the potential challenges of flipped classroom approach. Fifteen journal publications of K-12 flipped classrooms were analyzed in terms of their flipped learning activities, student achievement, student attitude, and challenges encountered. The results suggested that a variety of pre-class (e.g., online exercises) and in-class (e.g., brief review, individual practices) activities were provided in addition to instructional videos and small-group activities respectively. The use of flipped classroom approach in K-12 education yielded a neutral or positive impact on student achievement when compared to traditional classroom. Mixed results of student attitude toward flipped classroom approach were discovered. Challenges of implementing flipped classrooms were identified and categorized into student-related challenges, faculty challenges, and operational challenges. Based on the suggestions of previous studies together with relevant empirical supports, we propose a rudimentary flipped classroom model and a set of 10 guidelines to address these challenges. Finally, several recommendations of future research are provided.","authors":["Chung Kwan Lo","Khe Foon Hew"],"meta":["December 2017Research and Practice in Technology Enhanced Learning 12(4):1-22","DOI:10.1186/s41039-016-0044-2"],"references":["308161394_Preferred_Reporting_Items_for_Systematic_Reviews_and_Meta-Analyses_the_PRISMA_statement","303317737_Flipped_Classroom_Research_and_Trends_from_Different_Fields_of_Study","344538008_The_Flipped_Classroom_A_Survey_of_the_Research","315337089_Extending_the_flipped_classroom_model_Developing_second_language_writing_skills_through_student-created_digital_videos","313375967_Reprint-Preferred_Reporting_Items_for_Systematic_Reviews_and_Meta-Analyses_The_PRISMA_Statement","312438478_Remixing_chemistry_class_Two_Colorado_teachers_make_vodcasts_of_their_lectures_to_free_up_class_time_for_hands-on_activities","309687010_The_Effects_of_the_Flipped_Model_of_Instruction_on_Student_Engagement_and_Performance_in_the_Secondary_Mathematics_Classroom","304861043_Cambridge_Handbook_of_Multimedia_Learning_Second_Edition","303097275_A_self-regulated_flipped_classroom_approach_to_improving_students'_learning_performance_in_a_mathematics_course","302066134_Impacts_of_Flipped_Classroom_in_High_School_Health_Education"]}