{"id":"312159869_PROJECT-BASED_LEARNING_IN_HIGHER_EDUCATION_NEW_SKILLS_SET_FOR_CONSUMER_STUDIES_TEACHER_EDUCATION","abstract":"The changing expectations demanded of life and work in the 21st century require that employees, including teachers, be properly prepared for situations that may arise in this day and age. This is especially true for teachers of Consumer Studies, who have to develop an expanding range of knowledge and skills in order to facilitate teaching-learning effectively in their subject. Project-based learning has been implemented in Consumer Studies and other disciplines as a teaching-learning strategy to develop 21st century career skills in students, but has not yet been reported on in relation to the preparation of pre-service Consumer Studies teachers. A qualitative case study was undertaken to determine how the implementation of project-based learning as a teaching-learning strategy would affect and contribute to the development of preferred skills in pre-service Consumer Studies teachers. The findings show that project-based learning could make various positive and constructive contributions to the preparation of pre-service teachers for their careers, and could include the development of a number of preferred skills. Further research could be conducted regarding the implementation of project-based learning to develop specific skills or attributes (other than those mentioned in this study) in teachers.","authors":["Adri Du Toit","Marietjie Havenga","Marthie Van der Walt"],"meta":["October 2016Journal for New Generation Sciences 14(3)"],"references":["280244821_Implementation_of_project-based_learning_in_pre-service_Consumer_Studies_teacher_preparation_to_promote_self-directed_learning","280244815_Lost_entrepreneurship_opportunities_the_crisis_in_Consumer_Studies_education","280244568_Pedagogical_guidance_for_South-African_Consumer_Studies_education","271300101_'n_Ondersoek_na_metakognisie_in_wiskunde-_leer_in_die_senior_fase","347784348_Management_of_Change_Implementation_of_Problem-Based_and_Project-Based_Learning_in_Engineering","336087894_History_of_Problem-Based_and_Project-Based_Learning","319893405_Project-based_learning_in_higher_education_Exploring_programming_students_development_towards_self-directedness","300277830_Connecting_Student_Learning_at_University_with_Professional_Practice_Using_Rich_Media_in_Practice-Based_Curricula","294315490_Essential_skills_for_new_teachers","279941252_Seven_essentials_for_project-based_learning"]}