{"id":"312144674_A_Survey_on_Pre-Processing_in_Image_Matting","abstract":"Pre-processing is an important step in digital image matting, which aims to classify more accurate foreground and background pixels from the unknown region of the input three-region mask (Trimap). This step has no relation with the well-known matting equation and only compares color differences between the current unknown pixel and those known pixels. These newly classified pure pixels are then fed to the matting process as samples to improve the quality of the final matte. However, in the research field of image matting, the importance of pre-processing step is still blurry. Moreover, there are no corresponding review articles for this step, and the quantitative comparison of Trimap and alpha mattes after this step still remains unsolved. In this paper, the necessity and the importance of pre-processing step in image matting are firstly discussed in details. Next, current pre-processing methods are introduced by using the following two categories: static thresholding methods and dynamic thresholding methods. Analyses and experimental results show that static thresholding methods, especially the most popular iterative method, can make accurate pixel classifications in those general Trimaps with relatively fewer unknown pixels. However, in a much larger Trimap, there methods are limited by the conservative color and spatial thresholds. In contrast, dynamic thresholding methods can make much aggressive classifications on much difficult cases, but still strongly suffer from noises and false classifications. In addition, the sharp boundary detector is further discussed as a prior of pure pixels. Finally, summaries and a more effective approach are presented for pre-processing compared with the existing methods.","authors":["Guilin Yao"],"meta":["January 2017Journal of Computer Science and Technology 32(1):122-138","DOI:10.1007/s11390-017-1709-z"],"references":["283776364_Superpixel_fats_for_fast_foreground_extraction","265469097_Sparse_Codes_as_Alpha_Matte","300412715_Image_Matting_with_KL-Divergence_Based_Sparse_Sampling","277672019_GrabCut","269942644_High-Accuracy_and_Quick_Matting_Based_on_Sample-Pair_Refinement_and_Local_Optimization","269328846_Improving_Sampling_Criterion_for_Alpha_Matting","268240994_Automatic_Matting_of_Identification_Photos","263057316_Improved_global-sampling_matting_using_sequential_pair-selection_strategy","261395424_Learning_based_alpha_matting_using_support_vector_regression","261236487_Image_Matting_with_Local_and_Nonlocal_Smooth_Priors"]}