{"id":"312145624_Evaluating_real-life_performance_of_the_state-of-the-art_in_facial_expression_recognition_using_a_novel_YouTube-based_datasets","abstract":"Facial expression recognition (FER) is one of the most active areas of research in computer science, due to its importance in a large number of application domains. Over the years, a great number of FER systems have been implemented, each surpassing the other in terms of classification accuracy. However, one major weakness found in the previous studies is that they have all used standard datasets for their evaluations and comparisons. Though this serves well given the needs of a fair comparison with existing systems, it is argued that this does not go in hand with the fact that these systems are built with a hope of eventually being used in the real-world. It is because these datasets assume a predefined camera setup, consist of mostly posed expressions collected in a controlled setting, using fixed background and static ambient settings, and having low variations in the face size and camera angles, which is not the case in a dynamic real-world. The contributions of this work are two-fold: firstly, using numerous online resources and also our own setup, we have collected a rich FER dataset keeping in mind the above mentioned problems. Secondly, we have chosen eleven state-of-the-art FER systems, implemented them and performed a rigorous evaluation of these systems using our dataset. The results confirm our hypothesis that even the most accurate existing FER systems are not ready to face the challenges of a dynamic real-world. We hope that our dataset would become a benchmark to assess the real-life performance of future FER systems.","authors":["Muhammad Hameed Siddiqi","Maqbool Ali","Mohamed E. Eldib","Asfandyar Khan"],"meta":["January 2018Multimedia Tools and Applications 77(1)","DOI:10.1007/s11042-016-4321-2"],"references":["307835183_Wavelet_based_approach_for_facial_expression_recognition","276851935_Robust_Facial_Expression_Classification_Using_Shape_and_Appearance_Features","274091796_Multi-Layer_Sparse_Representation_for_Weighted_LBP-Patches_Based_Facial_Expression_Recognition","273124867_Automatic_Facial_Expression_Recognition_Using_Features_of_Salient_Facial_Patches","273003972_Human_Facial_Expression_Recognition_Using_Stepwise_Linear_Discriminant_Analysis_and_Hidden_Conditional_Random_Fields","318692986_Wavelet_based_approach_for_facial_expression_recognition","284280530_Facial_Expression_Analysis_using_Active_Shape_Model","281940473_Extraction_of_curvelet_based_RLBP_features_for_representation_of_facial_expression","272001746_The_Indian_Face_Database","268061790_Local_Directional_Pattern_Variance_LDPv_A_Robust_Feature_Descriptor_for_Facial_Expression_Recognition"]}