{"id":"312199826_Zimbabwean_female_participation_in_physics_The_use_of_drawings_in_documenting_students'_images_of_scientists","abstract":"p>The study investigated the Zimbabwean Advanced Level female adolescent students’ images of a scientist and the influence of female students perceived images on their participation in the subject. Three high schools that were offering physics at A’ level in the Midlands Province were targeted. Four female students eighteen years and above: three doing mathematics and physics and one doing physics without mathematics were purposively chosen. The data generating instruments were classroom observation and drawing. Findings show that two out of four female students drew stereotypical image of a male scientist and listed Eurocentric names of male scientists The other two female students, gave African names to the scientists that they drew and this may suggest that scientists are not only Eurocentric but can also be Afrocentric. Their diagrams might denote a positive physics perception which may have resulted in the construction of a positive identity formation regarding physics. The positive physics identity in turn may indicate that the female participants were more attuned to continue studying physics. However, the female students did not seem to perceive scientists as ordinary people but as famous inventive people they encountered in their science text books.\n\n</p","authors":["Anna Gudyanga"],"meta":["January 2017Review of Social Sciences 2(1)","DOI:10.18533/rss.v2i1.74"],"references":["346799086_The_Hermeneutics_of_Transcript_Analysis","347562009_Visual_Data_Understanding_and_Applying_Visual_Data_to_Research_in_Education","345850812_The_Truth_that_Never_Hurts","344664530_Physical_Optics_Principles_and_Practices","336101309_East_Coast_rural_horizons_Young_learners_draw_their_futures","336095456_An_introduction_to_Putting_People_in_the_Picture_Visual_Methodologies_for_Social_Changes","336091441_Changing_our_eyes_Seeing_hope","321555238_Picturing_Research_Drawing_as_Visual_Methodology","319393603_Communities_of_Practice_Learning_Meaning_and_Identity","317953571_Qualitative_inquiry_research_design_Choosing_among_five_approaches"]}