{"id":"312120578_A_New_Efficient_Hybrid_String_Matching_Algorithm_to_Solve_the_Exact_String_Matching_Problem","abstract":"The string matching algorithms are considered one of the most studied in the computer science field because the fundamental role they play in many different applications such as information retrieval, editors, security applications, firewall, and biological applications. This study aims to introduce a new hybrid algorithm based on two well-known algorithms, namely, the modified Horspool and SSABS hybrid algorithms. Two factors used to analyze the proposed algorithm which is the total number of character comparisons and total number of attempts. The ABSBMH algorithm which is the name chosen for the proposed hybrid algorithm was tested on different types of standard datatype. The ABSBMH algorithm shows less number of character comparisons when compared to the results of other algorithms, while show almost no big different in the results of number of attempts this is due to the proposed hybrid algorithm preprocessing phase based on SSABS algorithm which is the same preprocessing phase of the Quick Search algorithm, so for all these reasons the results of the ABSBMH and other algorithms in terms of total number of attempts have been shown a small different, this is because it use different pattern lengths which are selected randomly from the databases. The experiential results expose that performance of the hybrid algorithm influenced by the type of the dataset used, the DNA sequence shows the worst result, while the English text datatype show the best results in terms of total number of character comparisons.","authors":["Sinan Sameer Mahmood Al-Dabbagh","Nawaf Hazim"],"meta":["January 2017British Journal of Mathematics & Computer Science 20(2)","DOI:10.9734/BJMCS/2017/30497"],"references":["309277340_Parallel_Quick_Search_Algorithm_for_the_Exact_String_Matching_Problem_Using_OpenMP","296196535_Exact_pattern_matching_Adapting_the_Boyer-Moore_algorithm_for_DNA_searches","271302919_Quick-Skip_Search_Hybrid_Algorithm_for_the_Exact_String_Matching_Problem","245026033_On_String_Matching_with_Mismatches","304781378_Efficient_Algorithms_for_the_Order_Preserving_Pattern_Matching_Problem","278399218_Tuning_the_Boyer-Moore-Horspool_string_searching_algorithm","275248705_Comparison_criteria_between_matching_algorithms_texts_application_on_horspool's_and_brute_force_algorithms","269272975_Maximum-shift_string_matching_algorithms","262296502_The_Exact_Online_String_Matching_Problem_A_Review_of_the_Most_Recent_Results","257145131_Efficient_string-matching_allowing_for_non-overlapping_inversions"]}