{"id":"312172848_Impact_of_a_New_Teaching_and_Learning_Approach_in_an_Introductory_Programming_Course","abstract":"High failure and dropout rates are reported in introductory programming (IP) courses in different studies despite extensive research attempting to address the issue. In this study, we introduced an ADRI (Approach, Deployment, Result, Improvement) approach in the teaching and learning process of an IP course to improve learning and success rates. All three entities of the didactic triangle (student, instructor, and content) were involved in the research to better understand and execute the proposed approach. The IP course materials were redesigned based on the ADRI approach, and an editor was developed to promote the new approach and encourage students to complete the various stages required in the approach. Two surveys were conducted, and final exam grades over four semesters were compared with determine the impact of including the ADRI approach in the course. We concluded that the ADRI approach provides a positive impact on outcomes that the students achieved during the course. It engages students in practicing their programming skills and provides a new presentation style for examples and exercises which discourages students from taking programming shortcuts. It not only helps to reduce the failure and, significantly, the dropout rates from the IP course but also impacts positively on all students who passed the IP course.","authors":["Sohail Iqbal Malik","Jo Coldwell-Neilson"],"meta":["January 2017Journal of Educational Computing Research","DOI:10.1177/0735633116685852"],"references":["295902185_A_model_for_teaching_an_introductory_programming_course_using_ADRI","273188579_Teaching_Introductory_Programming_A_Quantitative_Evaluation_of_Different_Approaches","272910901_A_Self_Review_and_External_Review_Model_for_Teaching_and_Assessing_Novice_Programmers","314816021_Formative_evaluation_scheme_for_a_web-based_course_design","300484111_Supporting_Diverse_Novice_Programming_Cohorts_through_Flexible_and_Incremental_Visual_Constructivist_Pathways","290731875_The_Reform_of_Programming_Teaching_Based_on_Constructivism","282928408_Examining_Interest_and_Grades_in_Computer_Science_1_A_Study_of_Pedagogy_and_Achievement_Goals","273188817_Smartphones_Studio-Based_Learning_and_Scaffolding","262312461_A_content_analysis_of_programming_examples_in_high_school_computer_textbooks_in_Taiwan","242608727_Log_on_education_teaching_the_nintendo_generation_to_program"]}