{"id":"312178100_Big_Scholarly_Data_A_Survey","abstract":"With the rapid growth of digital publishing, harvesting, managing, and analyzing scholarly information have become increasingly challenging. The term Big Scholarly Data is coined for the rapidly growing scholarly data, which contains information including millions of authors, papers, citations, figures, tables, as well as scholarly networks and digital libraries. Nowadays, various scholarly data can be easily accessed and powerful data analysis technologies are being developed, which enable us to look into science itself with a new angle. In this paper, we examine the background and state of the art of big scholarly data. We first introduce the background of scholarly data management and relevant technologies. Secondly, we review data analysis methods, such as statistical analysis, social network analysis, and content analysis for dealing with big scholarly data. Finally, we look into representative research issues in this area, including scientific impact evaluation, academic recommendation, and expert finding. For each issue, the background, main challenges, and latest research are covered. These discussions aim to provide a general overview and big picture to scholars interested in this emerging area. This survey paper concludes with a discussion of open issues and promising future directions.","authors":["Feng Xia","Wei Wang","Teshome Megersa Bekele","Huan Liu"],"meta":["January 2017","DOI:10.1109/TBDATA.2016.2641460"],"references":["312633639_CocaRank_A_Collaboration_Caliber-based_Method_for_Finding_Academic_Rising_Stars","312387451_Big_data_Survey_technologies_opportunities_and_challenges","307948584_Identifying_Anomalous_Citations_for_Objective_Evaluation_of_Scholarly_Article_Impact","314374610_Tri-Rank_An_Authority_Ranking_Framework_in_Heterogeneous_Academic_Networks_by_Mutual_Reinforce","313383979_Dynamic_topic_models","312970191_Scientific_collaboration_networks","312596137_Big_data_The_next_frontier_for_innovation_competition_and_productivity","312227426_Open_data_and_open_code_for_big_science_studies","309178056_Altmetrics_Value_all_research_products","309177955_Altmetrics_Value_all_research_products"]}