{"id":"312258446_Software_Product_Lines_Modeling","abstract":"Complex software systems always exist for a long time, sometimes changing, and this leads to a variety of versions of such a system. In additional complex software systems usually have different (sometimes a lot) configurations due to different hardware and software environments, where they are intended to operate, or due to different user types with specific requirements. So, a complex software system can be regarded more correctly as a software system family or a software product line. Taking software families in consideration helps to increase reuse of their components and other software development artifacts. In difference with earlier works on software reuse, mostly focused on code or design reuse, software system family development tries to expand reuse on all kinds of development artifacts and activities, including documentation, verification, operation support, deployment, etc. One of the software system family development activities is modeling of family variability. This paper considers modern methods and approaches to such modeling, especially focusing on modeling of operating systems families variability. The research, which results are presented in this paper, is supported by RFBR.","authors":["K.M. Lavrischeva","Alexander K. Petrenko"],"meta":["January 2016Proceedings of the Institute for System Programming of RAS 28(6):49-64","DOI:10.15514/ISPRAS-2016-28(6)-4"],"references":["307870265_Verification_and_analysis_of_variable_operating_systems","273447150_An_Overview_on_Analysis_Tools_for_Software_Product_Lines","269853958_A_Classification_and_Survey_of_Analysis_Strategies_for_Software_Product_Lines","262310810_Scalable_analysis_of_variable_software","261045422_A_Study_of_Variability_Models_and_Languages_in_the_Systems_Software_Domain","299355740_A_Quantitative_Analysis_of_Variability_Warnings_in_Linux","278651415_A_Web_Services_Variability_Description_Language_WSVL_for_Business_Users_Oriented_Service_Customization","265347432_Variability_in_Software_Product_Lines","261276549_Scalable_product_line_configuration_A_straw_to_break_the_camel's_back","261192668_Strategies_for_product-line_verification_Case_studies_and_experiments"]}