{"id":"312284694_How_is_visual_salience_computed_in_the_brain_Insights_from_behaviour_neurobiology_and_modeling","abstract":"Inherent in visual scene analysis is a bottleneck associated with the need to sequentially sample locations with foveating eye movements. The concept of a ‘saliency map’ topographically encoding stimulus conspicuity over the visual scene has proven to be an efficient predictor of eye movements. Our work reviews insights into the neurobiological implementation of visual salience computation. We start by summarizing the role that different visual brain areas play in salience computation, whether at the level of feature analysis for bottom-up salience or at the level of goal-directed priority maps for output behaviour. We then delve into how a subcortical structure, the superior colliculus (SC), participates in salience computation. The SC represents a visual saliency map via a centre-surround inhibition mechanism in the superficial layers, which feeds into priority selection mechanisms in the deeper layers, thereby affecting saccadic and microsaccadic eye movements. Lateral interactions in the local SC circuit are particularly important for controlling active populations of neurons. This, in turn, might help explain long-range effects, such as those of peripheral cues on tiny microsaccades. Finally, we show how a combination of in vitro neurophysiology and large-scale computational modelling is able to clarify how salience computation is implemented in the local circuit of the SC.\nThis article is part of the themed issue ‘Auditory and visual scene analysis’.","authors":["Richard Veale","Ziad M. Hafed","Masatoshi Yoshida"],"meta":["February 2017Philosophical Transactions of The Royal Society B Biological Sciences 372(1714):20160113","DOI:10.1098/rstb.2016.0113"],"references":["312525072_Is_predictability_salient_A_study_of_attentional_capture_by_auditory_patterns","312035783_Modelling_auditory_attention","301675454_Neural_activities_in_V1_create_the_bottom-up_saliency_map_of_natural_scenes","297654140_A_Microsaccadic_Account_of_Attentional_Capture_and_Inhibition_of_Return_in_Posner_Cueing","285543975_Vision_Perception_and_Attention_through_the_Lens_of_Microsaccades_Mechanisms_and_Implications","282946840_Applying_Differential_Evolution_MCMC_to_Parameterize_Large-scale_Spiking_Neural_Simulations","312251544_The_singular_nature_of_auditory_and_visual_scene_analysis_in_autism","304541640_A_saliency_map_in_primary_visual_cortex","303917036_Sharper_Stronger_Faster_Upper_Visual_Field_Representation_in_Primate_Superior_Colliculus","302889884_Subcortical_connections_of_area_V4_in_the_macaque"]}