{"id":"312255844_A_Internet_das_Coisas_aplicada_ao_conceito_de_eficiencia_energetica_uma_analise_quantitativo-qualitativa_do_estado_da_arte_da_literatura","abstract":"Introdução: A Internet das Coisas corresponde a um novo paradigma, que imputa aos objetos a capacidade de disponibilizar informações a respeito de seu funcionamento e ao ambiente no qual tais objetos estão inseridos, caracterizando-se como abrangentes e diversificados os universos de prováveis aplicações a ela relacionadas. Em uma época em que se evidenciam ações e discussões dedicadas à sustentabilidade e ao meio ambiente, este artigo objetiva apurar o estado atual das pesquisas envolvendo a Internet das Coisas associado ao conceito de “eficiência energética”. Método: Tendo como referência a base de dados Scopus procedeu-se uma revisão sistemática da literatura, acompanhada de uma análise quantitativo-qualitativa. Foram aferidas informações no período compreendido entre os anos de 2001 a 2016, além da análise das cinquenta publicações com maiores citações. Resultados: Constatou-se a existência de 895 documentos relacionados aos assuntos pesquisados. Contudo, poucos (foram identificados sete documentos) discorrem sobre a efetiva aplicação da Internet das Coisas à “eficiência energética”. Conclusão: Além de se determinar o estado da arte das pesquisas a nível mundial dos temas propostos, foi possível ratificar os conceitos a eles associados, bem como identificar as publicações mais relevantes, para que possam servir de referência e ponto de partida a outros trabalhos do gênero.","authors":["Arildo Antônio Sônego","Roderval Marcelino","Vilson Gruber"],"meta":["January 2017AtoZ novas práticas em informação e conhecimento 5(2):80","DOI:10.5380/atoz.v5i2.47860"],"references":["286937786_Context-Aware_Energy_Efficiency_Management_for_Smart_Buildings","282352769_Da_necessidade_de_principios_de_Arquitetura_da_Informacao_para_a_Internet_das_Coisas","262343612_A_Novel_Deployment_Scheme_for_Green_Internet_of_Things","257601412_The_web_of_things_A_survey","254038162_How_low_energy_is_Bluetooth_low_energy_Comparative_measurements_with_ZigBee802154","262056537_Internet_of_Things_and_BOM-Based_Life_Cycle_Assessment_of_Energy-Saving_and_Emission-Reduction_of_Products","261045191_A_survey_on_the_ietf_protocol_suite_for_the_internet_of_things_Standards_challenges_and_opportunities","260671121_A_Survey_on_Distributed_Topology_Control_Techniques_for_Extending_the_Lifetime_of_Battery_Powered_Wireless_Sensor_Networks","257391708_Recommender_systems_survey","251809453_An_improved_concept_for_a_higher-order_mode_IOT"]}