{"id":"312298939_Stan_A_Probabilistic_Programming_Language","abstract":"Stan is a probabilistic programming language for specifying statistical models. A Stan program imperatively defines a log probability function over parameters conditioned on specified data and constants. As of version 2.14.0, Stan provides full Bayesian inference for continuous-variable models through Markov chain Monte Carlo methods such as the No-U-Turn sampler, an adaptive form of Hamiltonian Monte Carlo sampling. Penalized maximum likelihood estimates are calculated using optimization methods such as the limited memory Broyden-Fletcher-Goldfarb-Shanno algorithm. Stan is also a platform for computing log densities and their gradients and Hessians, which can be used in alternative algorithms such as variational Bayes, expectation propagation, and marginal inference using approximate integration. To this end, Stan is set up so that the densities, gradients, and Hessians, along with intermediate quantities of the algorithm such as acceptance probabilities, are easily accessible. Stan can be called from the command line using the cmdstan package, through R using the rstan package, and through Python using the pystan package. All three interfaces support sampling and optimization-based inference with diagnostics and posterior analysis. rstan and pystan also provide access to log probabilities, gradients, Hessians, parameter transforms, and specialized plotting.","authors":["Bob Carpenter","Andrew Gelman","Matthew D. Hoffman","Daniel Lee"],"meta":["January 2017Journal of Statistical Software 76(1)","DOI:10.18637/jss.v076.i01","Project: Probabilistic Programming and Bayesian Inference"],"references":["282181562_The_Stan_Math_Library_Reverse-Mode_Automatic_Differentiation_in_C","328717002_The_BUGS_Book_A_Practical_Introduction_to_Bayesian_Analysis","322276901_The_boost_C_libraries","319394324_A_successful_Git_branching_model","315497598_Pro_Git","289407026_Identifying_the_Optimal_Integration_Time_in_Hamiltonian_Monte_Carlo","281274030_Stan_Modeling_Language_User's_Guide_and_Reference_Manual","281273874_Bayesian_Data_Analysis_3rd_Ed","274015857_Team_RDCR_A_Language_And_Environment_For_Statistical_Computing_R_Foundation_for_Statistical_Computing_Vienna_Austria","271512970_Slice_sampling_with_discussion"]}