{"id":"312269602_Bio-Inspired_Optimization_Algorithms_for_Automatic_Estimation_of_Multiple_Subspace_Dimensions_in_a_Tensor-Wavelet_Denoising_Algorithm","abstract":"This paper focuses on the denoising of multidimensional data by a tensor subspace-based method. In a seminal work, multiway Wiener filtering was developed to minimize the mean square error between an expected signal tensor and the estimated tensor. It was then placed in a wavelet packet framework, with the pending issue of a reliable method for the estimation of multiple signal subspace dimensions for multiple coefficients of the wavelet packet transform. For the first time in this paper, we aim at estimating the signal subspace dimensions for all modes of wavelet packet coefficients by minimizing the least squares criterion with the best possible optimization strategy. In the paper, the interest of a genetic algorithm and particle swarm optimization for this purpose are compared. Also, the computational load is reduced as follows: the best subspace dimension values are estimated on subsampled data, and the original data is denoised with values of signal subspace dimension which are scaled by subsampling factors. The results obtained are compared on multispectral images regarding signal-to-noise ratio and perceptual image quality for various noise levels: the proposed method outperforms the existing ones for various multispectral images, containing different numbers of bands. An application to plant leaf fluorescence image denoising is included.","authors":["Abir Zidi","Julien Marot","Salah Bourennane","Klaus Spinnler"],"meta":["December 2016Journal of Remote Sensing Technology 4(1):90-114","DOI:10.18005/JRST0401008"],"references":["318720288_Multimodal_Score-Level_Fusion_Using_Hybrid_GA-PSO_for_Multibiometric_System","298897488_Comparison_of_multiple_watermarking_techniques_using_genetic_algorithms","312771295_Image_quality_assessment_From_error_visibility_to_structural_similarity","312448996_Particle_swarm_optimizationC","304370520_Multispectral_Fluorescence_Imaging_During_Robot-assisted_Laparoscopic_Sentinel_Node_Biopsy_A_First_Step_Towards_a_Fluorescence-based_Anatomic_Roadmap","293017671_Incorporating_Priors_for_Medical_Image_Segmentation_Using_a_Genetic_Algorithm","293017625_A_hybrid_particle_swarm_optimization_for_feature_subset_selection_by_integrating_a_novel_local_search_strategy","286813497_A_Task_Scheduling_Algorithm_Based_on_Genetic_Algorithm_and_Ant_Colony_Optimization_in_Cloud_Computing","286682449_Particle_System-A_Technique_Modeling_a_Class_of_Fuzzy_Objects","285369151_Reconstruction_of_3D_surface_maps_from_anterior_segment_optical_coherence_tomography_images_using_graph_theory_and_genetic_algorithms"]}