{"id":"312243758_Ethical_Perception_of_Information_Technologies_at_Computer_Science_Faculties","abstract":"In recent years Information Technologies (IT) are increasingly becoming an integral part of the everyday activities of all strata of human society. Their role is undeniable, primarily in the sphere of education and professionalism, as well as in providing benefits for the whole human society. But anyway, it should not leave aside the possibility of misuse of Information Technologies by individuals, which can grow from improper behavior up to cybercrime. In fact, the human society faces new challenges and with crisis in perception and in particular conditioned by the rapid development of computer science and information technologies.In this context, based on the fact that education represents a fundamental component of ethical education of the Information Technologies users, a case study was carried out by Research Centre of the Computer Science Faculty at AAB University in Kosovo. The primary purpose of the research has been finding the real situation regarding the ethical perceptions of students, as a massive category of Information Technologies user’s and resulting conclusions for further cooperation in support of ethical use of Information Technologies. Keywords: Information Technologies; Ethics; Education; Computer Science;","authors":["Blerta Prevalla"],"meta":["December 2016Global Journal of Information Technology Emerging Technologies 6(2):129","DOI:10.18844/gjit.v6i2.886"],"references":["284209270_Information_Technology_Model_of_Education","273934087_Ethical_Use_of_Information_Technology_in_High_Education","264869053_Rethinking_education_in_the_age_of_technology_the_digital_revolution_and_the_schools","299598757_Social_ethical_and_legal_issues","292500562_Ethics_and_Information_Technology_Editorial","292252743_The_Ethics_of_Information_Technology_and_Business","235223156_The_Cambridge_Handbook_of_Information_and_Computer_Ethics","227271971_A_Gift_of_Fire_Social_Legal_and_Ethical_Issues_in_Computing_Sara_Baase"]}