{"id":"312297985_A_Novel_Fuzzy_Encryption_Technique_Based_on_Multiple_Right_Translated_AES_Gray_S-Boxes_and_Phase_Embedding","abstract":"This paper presents a novel image encryption technique based on multiple right translated AES Gray S-boxes (RTSs) and phase embedding technique. First of all, a secret image is diffused with a fuzzily selected RTS. The fuzzy selection of RTS is variable and depends upon pixels of the secret image. Then two random masks are used to enhance confusion in the spatial and frequency domains of the diffused secret image. These random masks are generated by applying two different RTSs on a host image. The decryption process of the proposed cryptosystem needs the host image for generation of masks. It is therefore, necessary, to secure the host image from unauthorized users. This task is achieved by diffusing the host image with another RTS and embedding the diffused secret image into the phase terms of the diffused host image. The cryptographic strength of the proposed security system is measured by implementing it on several images and applying rigorous analyses. Performance comparison of the proposed security technique with some of the state-of-the-art security systems, including S-box cryptosystem and steganocryptosystems, is also performed. Results and comparison show that the newly developed cryptosystem is more secure.","authors":["Naveed Azam"],"meta":["January 2017Security and Communication Networks 2017(3):1-9","DOI:10.1155/2017/5790189"],"references":["275656313_Enhanced_Stegano-Cryptographic_Model_for_Secure_Electronic_Voting","273917470_S-Boxes_Based_on_Affine_Mapping_and_Orbit_of_Power_Function","270916374_A_Non-adaptive_Partial_Encryption_of_Grayscale_Images_Based_on_Chaos","265556562_Right_translated_AES_gray_S-boxes","263056144_Speed_Image_Encryption_Scheme_using_Dynamic_Galois_Field_GFP_Matrices","260894862_Combining_steganography_and_biometric_cryptosystems_for_secure_mutual_authentication_and_key_exchange","271295305_Secure_Image_Hiding_Algorithm_using_Cryptography_and_Steganography","271275059_Novel_image_encryption_algorithm_based_on_cycle_shift_and_chaotic_system","261377797_Image_Encryption_Based_on_Fuzzy_Synchronization_of_Chaos_Systems","260701876_Optical_color_image_encryption_based_on_computer_generated_hologram_and_chaotic_theory"]}