{"id":"312338417_A_distributed_architecture_for_real-time_evacuation_guidance_in_large_smart_buildings","abstract":"In this paper, we consider the route coordination problem in emergency evacuation of large smart buildings. The building evacuation time is crucial in saving lives in emergency situations caused by imminent natural or man-made threats and disasters. Conventional approaches to evacuation route coordination are static and predefined. They rely on evacuation plans present only at a limited number of building locations and possibly a trained evacuation personnel to resolve unexpected contingencies. Smart buildings today are equipped with sensory infrastructure that can be used for an autonomous situation-aware evacuation guidance optimized in real time. A system providing such a guidance can help in avoiding additional evacuation casualties due to the flaws of the conventional evacuation approaches. Such a system should be robust and scalable to dynamically adapt to the number of evacuees and the size and safety conditions of a building. In this respect, we propose a distributed route recommender architecture for situation-aware evacuation guidance in smart buildings and describe its key modules in detail. We give an example of its functioning dynamics on a use case.","authors":["Marin Lujak","Holger Billhardt","Jürgen Dunkel","Alberto Fernández"],"meta":["January 2017Computer Science and Information Systems 14(1):257-282","DOI:10.2298/CSIS161014002L","Project: Social Modelling of Ambient Intelligence for Large Premises"],"references":["321412391_Comparative_analysis_of_indoor_positioning_systems_based_on_communications_supported_by_smartphones","308072152_Crowd_Behaviour_during_High-Stress_Evacuations_in_an_Immersive_Virtual_Environment","301820987_On_Avoiding_Panic_by_Pedestrian_Route_Recommendation_in_Smart_Spaces","284365315_Distributed_coordination_of_emergency_medical_service_for_angioplasty_patients","321615948_Big_Data_and_Internet_of_Things_A_Roadmap_for_Smart_Environments","312751953_Agreement_Technologies_A_Computing_Perspective","305293340_Comparative_Analysis_of_Indoor_Positioning_Systems_for_Smartphones","304480299_Situation_Awareness_for_Push-Based_Recommendations_in_Mobile_Devices","292769181_Egress_design_solutions-_a_guide_to_evacuation_and_crowd_management_planning","287877411_Design_of_the_recommendation_module_for_context_aware_VOD_museum_guide_android_app"]}