{"id":"312316157_Individual_camera_device_identification_from_JPEG_images","abstract":"The goal of this paper is to investigate the problem of source camera device identification for natural images in JPEG format. We propose an improved signal-dependent noise model describing the statistical distribution of pixels from a JPEG image. The noise model relies on the heteroscedastic noise parameters that relate the variance of pixels' noise with the expectation considered as unique fingerprints. It is also shown in the present paper that non-linear response of pixels can be captured by characterizing the linear relation because those heteroscedastic parameters are used to identify source camera device. The identification problem is cast within the framework of hypothesis testing theory. In an ideal context, where all model parameters are perfectly known, the likelihood ratio test (LRT) is presented and its performance is theoretically established. The statistical performance of LRT serves as an upper bound of the detection power. In a practical identification, when the nuisance parameters are unknown, two generalized LRTs based on estimation of those parameters are established. Numerical results on simulated data and real natural images highlight the relevance of our proposed approach. While those results show a first positive proof of concept of the method, it still requires to be extended for a relevant comparison with PRNU-based approaches that benefit from years of experiences.","authors":["Tong Qiao","Florent Retraint","Rémi Cogranne","Thanh Hai Thai"],"meta":["March 2017Signal Processing Image Communication 52:74-86","DOI:10.1016/j.image.2016.12.011"],"references":["289990721_An_Analysis_and_Implementation_of_the_BM3D_Image_Denoising_Method","284015321_Camera_model_identification_based_on_the_generalized_noise_model_in_natural_images","274406753_Generalized_signal-dependent_noise_model_and_parameter_estimation_for_natural_images","262995659_Estimation_of_Lens_Distortion_Correction_from_Single_Images","308911753_Forensic_Camera_Model_Identification","302608361_Sensor_fingerprint_matching_in_large_image_and_video_databases","297863421_Digital_Image_Forensics_There_is_More_to_a_Picture_than_Meets_the_Eye","282907049_Modeling_and_Extending_the_Ensemble_Classifier_for_Steganalysis_of_Digital_Images_Using_Hypothesis_Testing_Theory","277496116_Information_Forensics_An_Overview_of_the_First_Decade","261443551_Statistical_Model_of_Quantized_DCT_Coefficients_Application_in_the_Steganalysis_of_Jsteg_Algorithm"]}