{"id":"312325575_Bidirectional_people_counting_system_in_video_surveillance","abstract":"In video surveillance to count the number of people walking through a corridor or door people counting is used. Counting persons passing through supervised area is important issue of this domain. System of people counting is important for security application (such as in the situation of an evacuation, it is vital to know how many people are present inside the surveillance area at any given time), pedestrian traffic management, tourists flow estimation. The counter requires two steps: detection of people and tracking to count people directionally. Detection is based on finding people through application of HOG descriptor and trajectories of people are generated through application of Kalman channel. Finally counting system modifies in and out count based on direction of trajectories generated by kalman filter. Different indoor video sequences are taken from surveillance camera and results obtained with the accuracy ranging from 91% to 100%. Accuracies of result depends on number of people crossing the counting zone simultaneously, occlusions, intensity variation in video sequence etc.","authors":["Satish D. Pore","Bashirahamad Fardin Momin"],"meta":["May 2016","DOI:10.1109/RTEICT.2016.7807919","Conference: 2016 IEEE International Conference on Recent Trends in Electronics, Information & Communication Technology (RTEICT)"],"references":["224744954_DCT_based_segmentation_applied_to_a_scalable_zenithal_people_counter","3813345_Adaptive_Background_Mixture_Models_for_Real-Time_Tracking","303017137_An_Introduction_to_the_Kalman_Filter","224195290_Real-Time_Counting_Method_for_a_Crowd_of_Moving_People","224164552_A_people_counting_system_based_on_head-shoulder_detection_and_tracking_in_surveillance_video","222877260_A_system_for_counting_people_in_video_images_using_neural_networks_to_identify_the_background_scene","3898322_Automatic_congestion_detection_system_for_underground_platforms","3192711_Real-Time_Tracking_of_the_Human_Body"]}