{"id":"312348418_Physical_controllability_of_complex_networks","abstract":"A challenging problem in network science is to control complex networks. In existing frameworks of structural or exact controllability, the ability to steer a complex network toward any desired state is measured by the minimum number of required driver nodes. However, if we implement actual control by imposing input signals on the minimum set of driver nodes, an unexpected phenomenon arises: due to computational or experimental error there is a great probability that convergence to the final state cannot be achieved. In fact, the associated control cost can become unbearably large, effectively preventing actual control from being realized physically. The difficulty is particularly severe when the network is deemed controllable with a small number of drivers. Here we develop a physical controllability framework based on the probability of achieving actual control. Using a recently identified fundamental chain structure underlying the control energy, we offer strategies to turn physically uncontrollable networks into physically controllable ones by imposing slightly augmented set of input signals on properly chosen nodes. Our findings indicate that, although full control can be theoretically guaranteed by the prevailing structural controllability theory, it is necessary to balance the number of driver nodes and control cost to achieve physical control.","authors":["Lezhi Wang","Yu-Zhong Chen","Wen-Xu Wang","Ying-Cheng Lai"],"meta":["January 2017Scientific Reports 7(1):40198","DOI:10.1038/srep40198"],"references":["303545357_Structure-based_control_of_complex_networks_with_nonlinear_dynamics","301568608_Energy_scaling_and_reduction_in_controlling_complex_networks","282181478_A_geometrical_approach_to_control_and_controllability_of_nonlinear_dynamical_networks","273873301_Controlling_complex_non-linear_dynamical_networks","273284667_Observability_and_Controllability_of_Nonlinear_Networks_The_Role_of_Symmetry","273158283_Spectrum_of_Controlling_and_Observing_Complex_Networks","268646538_Controllability_and_Observability_Conditions_of_Linear_Autonomous_Systems","313766196_Controllability_of_multi-agent_systems_from_a_graph-theoretic_perspective","313581179_Mathematical_description_of_linear_dynamical_systems","307906376_Control_principles_of_complex_systems"]}