{"id":"312376129_On_the_Initial_Access_Design_in_Millimeter_Wave_Cellular_Networks","abstract":"Initial access is the process whereby a mobile user connects to the cellular network since it is switched on, wherein cell search (CS) over the downlink and random access (RA) on the uplink are the two major steps. The highly directional communication in millimeter wave (mmWave) cellular networks requires the user and the base station (BS) to find and agree upon a suitable beamforming (BF) direction from a large angular search space during initial access. By leveraging stochastic geometry, the initial access delay and user-perceived downlink throughput (UPT) are analytically derived and numerically evaluated for four initial access protocols. For the baseline exhaustive search option, our results show that the optimal BS beamwidth in terms of initial access delay is deceasing as blockage becomes more severe, while the optimal BS beamwidth for UPT does not vary too much with respect to blockage conditions. Three other initial access protocols that require less overhead than the baseline option are also investigated, and we find the best trade-off between initial access delay and UPT can be achieved when BS transmits omni-directionally and user applies beam sweeping during cell search.","authors":["Yingzhe Li","Jeffrey G. Andrews","Francois Baccelli","Thomas D. Novlan"],"meta":["December 2016","DOI:10.1109/GLOCOMW.2016.7848981","Conference: IEEE GLOBECOM Workshop on Emerging Technologies for 5G Wireless Cellular NetworksAt: Washington, DC","Project: Wireless Stochastic Geometry"],"references":["284476514_Directional_Initial_Access_for_Millimeter_Wave_Cellular_Systems","283762513_Initial_beamforming_for_mmWave_communications","273041455_Millimeter_Wave_Cellular_Networks_A_MAC_Layer_Perspective","264122992_Tractable_Model_for_Rate_in_Self-Backhauled_Millimeter_Wave_Cellular_Networks","262301982_What_will_5G_be","260534087_A_Tractable_Approach_to_Coverage_and_Rate_in_Cellular_Networks","260393207_Coverage_and_Rate_Analysis_for_Millimeter_Wave_Cellular_Networks","224585427_Stochastic_Geometry_and_Random_Graphs_for_the_Analysis_and_Design_of_Wireless_Networks","273645784_Millimeter_Wave_Mobile_Communications_for_5G_Cellular_It_Will_Work","273395753_Random_Access_in_Millimeter-Wave_Beamforming_Cellular_Networks_Issues_and_Approaches","261341510_Coverage_and_capacity_in_mmWave_cellular_systems","230750731_Part_11_Wireless_LAN_medium_access_control_MAC_and_physical_layer_PHY_Specifications"]}