{"id":"312391810_Mapas_conceituais_no_ensino_de_fisica_como_estrategia_de_avaliacao","abstract":"Considerando as várias dificuldades dos alunos de Ensino Fundamental em aprender conceitos de físicos, nota-se a necessidade de elaborar novas estratégias de ensino visando minimizar tais dificuldades e, ao mesmo tempo, despertando interesse do aluno para o estudo de Física. Como proposto por Joseph Novak, o mapa conceitual é uma ferramenta utilizada como recurso para alcançar a aprendizagem significativa, contribuindo à construção hierárquica dos conceitos a partir dos conhecimentos prévios dos alunos. Por isso, o presente trabalho foi realizado para abordar a utilização de mapas conceituais como instrumento de avaliação durante o processo de ensino e aprendizagem sobre conceitos de ondas, som e luz. Os mapas conceituais foram elaborados e aplicados aos alunos de uma turma do 9° ano de uma escola pública da cidade de Marabá (Pará). A análise foi baseada em critérios, como segue: conceitos sobre o conteúdo, hierarquização, relações entre os conceitos e clareza durante a leitura do mapa conceitual. A partir dessa análise, observou-se inicialmente que os alunos apresentam grandes dificuldades, e elas diminuem à medida que os mapas conceituais são refeitos. Os resultados deste trabalho permitiram constatar, também, que a ferramenta de mapa conceitual pode ser usada como estratégia de avaliação, bem como observar as limitações e as potencialidades que os alunos apresentam sobre a aprendizagem dos conceitos propostos. Além disso, conclui-se que os mapas possibilitam melhor aprendizagem e valorizam os conhecimentos pré-existentes dos alunos.","authors":["Marinaldo Vilar","Vanessa Carolina Cunha Célio","Sandra Cristina Oliveira Nogueira","Aline Ferreira Martins"],"meta":["January 2017Scientia Plena 13(01)","DOI:10.14808/sci.plena.2017.012723"],"references":["266075202_Atividades_Experimentais_de_Baixo_Custo_como_Estrategia_de_Construcao_da_Autonomia_de_Professores_de_Fisica_Uma_Experiencia_em_Formacao_Continuada","226322869_Results_and_Implications_of_a_12-Year_Longitudinal_Study_of_Science_Concept_Learning","45363297_A_teoria_subjacente_aos_mapas_conceituais_e_como_elabora-los_e_usa-los","28320499_Mapas_conceituais_e_diagramas_V_ferramentas_para_o_ensino_a_aprendizagem_e_a_avaliacao_no_ensino_tecnico","3050623_Concept_maps_for_engineering_education_A_cognitively_motivated_tool_supporting_varied_assessment_functions","242412088_Educational_Psychology_A_Cognitive_View"]}