{"id":"312308437_Evaluative_Language_Beyond_Bags_of_Words_Linguistic_Insights_and_Computational_Applications","abstract":"The study of evaluation, affect, and subjectivity is a multidisciplinary enterprise, including sociology, psychology, economics, linguistics, and computer science. A number of excellent computational linguistics and linguistic surveys of the field exist. Most surveys, however, do not bring the two disciplines together to show how methods from linguistics can benefit computational sentiment analysis systems. In this survey, we show how incorporating linguistic insights, discourse information, and other contextual phenomena, in combination with the statistical exploitation of data, can result in an improvement over approaches that take advantage of only one of these perspectives. We first provide a comprehensive introduction to evaluative language from both a linguistic and computational perspective.We then argue that the standard computational definition of the concept of evaluative language neglects the dynamic nature of evaluation, in which the interpretation of a given evaluation depends on linguistic and extralinguistic contextual factors. We thus propose a dynamic definition that incorporates update functions. The update functions allow for different contextual aspects to be incorporated into the calculation of sentiment for evaluative words or expressions, and can be applied at all levels of discourse. We explore each level and highlight which linguistic aspects contribute to accurate extraction of sentiment. We end the review by outlining what we believe the future directions of sentiment analysis are, and the role that discourse and contextual information need to play.","authors":["Farah Benamara","Maite Taboada","Yannick Mathieu"],"meta":["December 2016Computational Linguistics 43(1):1-103","DOI:10.1162/COLI_a_00278","Project: Evaluative language"],"references":["325193763_Who_cares_about_sarcastic_tweets_Investigating_the_impact_of_sarcasm_on_sentiment_analysis","315460930_Annotating_discourse_relations_in_spoken_language_A_comparison_of_the_PDTB_and_CCR_frameworks","346826397_The_Fall_of_the_Faculty_The_Rise_of_the_All-Administrative_University_and_Why_It_MattersThe_Rise_of_the_All-Administrative_University_and_Why_It_Matters","339204247_Suggestion_Mining_Detecting_Suggestions_for_Improvement_in_Users'_Comments","337158801_Evaluation_in_Discourse_a_Corpus-Based_Study","329979336_Good_Great_Excellent_Global_Inference_of_Semantic_Intensities","324626520_The_Measurement_of_Meaning","321513173_Introduction_to_Montague_Semantics","320408094_grammaire_du_sens_et_de_l'expression","318494453_Metaphors_We_Live_By"]}