{"id":"312372750_Homework_and_academic_achievement_A_meta-analytic_review_of_research","abstract":"The main purpose of this study was to determine the effect of homework assignments on students' academic achievement. This meta-analysis sought an answer to the research question: \"What kind of effect does homework assignment have on students' academic achievement levels?\" In this research, meta-analysis was adopted to determine the effect of homework assignments on students' academic achievement. The effect sizes of the studies included in the meta-analysis were compared with regard to their methodological characteristics (research design, sample size, and publication bias) and substantive characteristics (course type, grade level, duration of implementation, instructional level, socioeconomic status, and setting). At the end of the research, it was revealed that homework assignments had a small effect size (d = 0.229) on students' academic achievement levels. Lastly, it was seen that there was not a significant difference with regard to the effect sizes of the studies with respect to all variables, except the course type variable in the research.\n\nhttp://www.iier.org.au/iier27/bas.pdf","authors":["Gökhan Baş","Cihad Şentürk","Fatih Mehmet Cigerci"],"meta":["January 2017Issues in Educational Research 27(1):31-50"],"references":["298716348_Effects_of_annotations_and_homework_on_learning_achievement_An_empirical_study_of_scratch_programming_pedagogy","313717817_Statistical_power_analysis_for_the_behavioral","296860834_Homework","290531970_Homework_motivation_and_academic_achievement_in_a_college_genetics_course","284531959_Statistical_Methods_for_Meta-Analysis","280686877_Meanings_of_Homework_and_Implications_for_Practice","275714193_Statistical_Power_Analysis","273053300_Meta-Analysis_Quantitative_Methods_for_Research_Synthesis","271813607_Family_Involvement_with_Children's_Homework_An_Intervention_in_the_Middle_Grades","269005141_An_Introduction_to_Meta-Analysis"]}