{"id":"312328006_ApoSOD1_lacking_dismutase_activity_neuroprotects_motor_neurons_exposed_to_beta-methylamino-L-alanine_through_the_Ca2AktERK12_prosurvival_pathway","abstract":"Amyotrophic lateral sclerosis (ALS) is a severe human adult-onset neurodegenerative disease affecting lower and upper motor neurons. In >20% of cases, the familial form of ALS is caused by mutations in the gene encoding Cu,Zn-superoxide dismutase (SOD1). Interestingly, administration of wild-type SOD1 to SOD1(G93A) transgenic rats ameliorates motor symptoms through an unknown mechanism. Here we investigated whether the neuroprotective effects of SOD1 are due to the Ca(2+)-dependent activation of such prosurvival signaling pathway and not to its catalytic activity. To this aim, we also examined the mechanism of neuroprotective action of ApoSOD1, the metal-depleted state of SOD1 that lacks dismutase activity, in differentiated motor neuron-like NSC-34 cells and in primary motor neurons exposed to the cycad neurotoxin beta-methylamino-L-alanine (L-BMAA). Preincubation of ApoSOD1 and SOD1, but not of human recombinant SOD1(G93A), prevented cell death in motor neurons exposed to L-BMAA. Moreover, ApoSOD1 elicited ERK1/2 and Akt phosphorylation in motor neurons through an early increase of intracellular Ca(2+) concentration ([Ca(2+)]i). Accordingly, inhibition of ERK1/2 by siMEK1 and PD98059 counteracted ApoSOD1- and SOD1-induced neuroprotection. Similarly, transfection of the dominant-negative form of Akt in NSC-34 motor neurons and treatment with the selective PI3K inhibitor LY294002 prevented ApoSOD1- and SOD1-mediated neuroprotective effects in L-BMAA-treated motor neurons. Furthermore, ApoSOD1 and SOD1 prevented the expression of the two markers of L-BMAA-induced ER stress GRP78 and caspase-12. Collectively, our data indicate that ApoSOD1, which is devoid of any catalytic dismutase activity, exerts a neuroprotective effect through an early activation of Ca(2+)/Akt/ERK1/2 pro-survival pathway that, in turn, prevents ER stress in a neurotoxic model of ALS.Cell Death and Differentiation advance online publication, 13 January 2017; doi:10.1038/cdd.2016.154.","authors":["Tiziana Petrozziello","Agnese Secondo","Valentina Tedeschi","Alba Esposito"],"meta":["January 2017Cell Death and Differentiation 24(3)","DOI:10.1038/cdd.2016.154"],"references":["313766077_A_new_generation_of_Ca2_indicators_with_greatly_improved_fluorescence_properties","308676069_A_Phosphomimetic_Mutation_Stabilizes_SOD1_and_Rescues_Cell_Viability_in_the_Context_of_an_ALS-Associated_Mutation","288837308_Nonnative_SOD1_trimer_is_toxic_to_motor_neurons_in_a_model_of_amyotrophic_lateral_sclerosis","284651675_A_new_generation_of_calcium_indicators_with_greatly_improved_fluorescence_properties","313532046_A_rapid_and_sensitive_method_for_the_quantification_of_microgram_quantities_of_protein_utilizing_the_principle_of_protein-dye_binding","313445253_Epidemiology_of_ALS","312621320_A_rapid_and_sensitive_method_for_the_quantitation_of_microgram_quantities_of_protein_utilizing_the_principle_of_microgram_quantities_of_protein_utilizing_the_principle_of_protein_dye_binding","306268239_The_multifaceted_role_of_metalloproteinases_in_physiological_and_pathological_conditions_in_embryonic_and_adult_brains","288686581_Combined_Isothermal_Titration_and_Differential_Scanning_Calorimetry_Define_3-State_Thermodynamics_of_fALS-Associated_Mutant_Apo_SOD1_Dimers_and_Increased_Population_of_Folded_Monomer","284445689_Amyotrophic_Lateral_Sclerosis"]}