{"id":"312374863_Secure_Lossy_Source_Coding_for_Some_Classes_of_Helper_and_Gray-Wyner_Models","abstract":"In this work, we investigate two source coding models, a \\emph{Helper} problem and a \\emph{Gray-Wyner} problem, under equivocation constraints. Specifically, in the Helper problem, an encoder communicates with a legitimate receiver through noise-free rate-limited public and private links; and an external passive eavesdropper intercepts every information that is sent on the public link. We study two classes of this model: i) when a pair of arbitrarily correlated discrete memoryless sources is to be encoded such that one component has to be recovered lossily at the legitimate receiver while the equivocation about both components at the eavesdropper must be maintained no smaller than some prescribed level; and ii) when the legitimate receiver reproduces both components, one of which, that is recovered losslessly, has to be concealed from the eavesdropper to some equivocation level. For both classes problems, we establish single-letter characterizations of optimal rate-distortion-equivocation tradeoffs in the discrete memoryless case. Next, we extend our results to the case of two legitimate receivers, i.e., Gray-Wyner network with equivocation constraints. Here, two legitimate receivers are connected to the encoder each through a dedicated error-free private link as well as a common error-free public link; and an external passive eavesdropper overhears on the public link. We study two classes of this model that are extensions of the aforementioned instances of Helper problems to the case of two receivers. For each of the two classes, we establish a single-letter characterization of the optimal rate-distortion-equivocation region. Throughout the paper, the analysis sheds light on the role of the private links, and we illustrate the results by computing them for some binary examples. Also, we make some meaningful connections, e.g., with problems of secret-sharing and encryption.","authors":["Meryem Benammar","Abdellatif Zaidi"],"meta":["January 2017"],"references":["301867546_Lossless_Compression_with_Security_Constraints","268550377_Common_information_is_far_less_than_mutual_information","256606489_Secure_degrees_of_freedom_of_MIMO_X-channels_with_output_feedback_and_delayed_CSIT","247933016_Bounds_on_the_Capacity_of_the_Relay_Channel_With_Noncausal_State_at_the_Source","307657920_An_MMSE_Approach_to_the_Secrecy_Capacity_of_the_MIMO_Gaussian_Wiretap_Channel","303320311_Secure_Source_Coding_With_a_Public_Helper","278208372_The_Gaussian_Multiple_Access_Wire-Tap_Channel_vol_54_5747_2008","271452420_Secure_successive_refinement_with_degraded_side_information","260891716_Information_Theoretic_Security","244989999_On_Secure_Source_Coding_with_Side_Information_at_the_Encoder"]}