{"id":"312312226_A_distance_learning_curriculum_on_pervasive_computing","abstract":"Engineering of pervasive computing (PerComp) systems is a new scientific field and from an educational perspective needs to draw from a large number of knowledge domains. The appearance of related courses in computer science curricula has a decade history, but the growth of interest has led in recent years to the design of more advanced PerComp educational programmes. In this paper, we present our experiences in organising, managing and teaching a PerComp curriculum at a postgraduate level since 2010 using distance learning methodologies in the Hellenic Open University. We discuss the distinct characteristics and related challenges of distance education and how these characteristics affected programme organisation, educational material structuring, laboratory courses delivering and student assessment. We report our main findings and conclusions extracted by an online survey filled by students enrolled in the programme, discuss the lessons learned and also provide a number of suggestions for further develo...","authors":["Achilles Kameas","Damianos Gavalas","Christos Goumopoulos","Petros Nicopolitidis"],"meta":["January 2017International Journal of Continuing Engineering Education and Life-Long Learning 27(1/2):122","DOI:10.1504/IJCEELL.2017.10001975"],"references":["262830135_Getting_real_the_authenticity_of_remote_labs_and_simulations_for_science_learning","331918018_Blended_learning","313730983_The_computer_for_the_21st_century","309790806_APLe_Agents_for_Personalized_Learning_in_Distance_Learning","308828947_Bridging_the_Gap_between_Virtual_and_Physical_Classrooms_to_Enhance_Distance_Learning_Experience","294282181_An_Interactive_and_Personalized_Cloud-Based_Virtual_Learning_System_to_Teach_Computer_Science","283689246_Combining_Agents_and_Ontologies_for_Building_an_Intelligent_Tutoring_System","260747151_Delivering_an_Engineering_Laboratory_Course_Using_the_Internet_the_Post_Office_and_a_Campus_Visit","257574683_Embedded_creativity_Teaching_design_thinking_via_distance_education","257129267_The_Computer_for_the_21st_Century"]}