{"id":"312377049_Towards_a_Software_Defined_Reference_Architecture_for_Smart_City_Ecosystems","abstract":"With the convergence of information and telecommunication technologies, the vision of the ‘Smart City’ is fast becoming a reality. City governments in a growing number of countries are capitalizing on these advances to ease the lives of their citizens and to increase efficiency and sustainability. In this position paper, we outline our vision for the creation of a reference architecture for Smart City projects, which could serve as the design language for creating smart cities blueprints. Such a blueprint would cater for diverse stakeholders, devices, platforms, and technologies. We argue that a new approach for designing such ultra large and ultra-heterogeneous ecosystems is needed. Hence, we propose a reference architecture inspired by several efforts in software engineering such as SOA. The proposed reference architecture would serve as a blueprint and starting point that contains architectural building blocks, best practices, and patterns; instead of starting from scratch. We present an initial meta-model with multiple views and highlight intra and inter views relationships. We survey the state of the art, outline our research approach, and suggest a research agenda for the smart city software community at large.","authors":["Mohammad Abu Matar"],"meta":["September 2016","Conference: The IEEE Second International Smart Cities Conference (ISC2 2016), Trento, Italy"],"references":["294736337_A_Taxonomy_of_Context-Aware_Software_Variability_Approaches","268508224_A_Conceptual_Enterprise_Architecture_Framework_for_Smart_Cities_-_A_Survey_Based_Approach","263892896_A_framework_for_context-aware_self-adaptive_mobile_applications_SPL","262263409_Exploring_Architectural_and_Organizational_Features_in_Smart_Cities","261860927_Smart_cities_software_architectures_A_survey","260711678_Smart_Cities_Guest_editors'_introduction","236881804_An_Automated_Framework_for_Variability_Management_of_Service-Oriented_Software_Product_Lines","283073636_Towards_Smart_Systems_of_Systems","260670309_Architectural_Implications_of_Smart_City_Business_Models_An_Evolutionary_Perspective","247951171_The_Practice_and_Promise_of_the_Model_Driven_Architecture"]}