{"id":"312478673_Evaluating_the_Effect_of_Program_Visualization_on_Student_Motivation","abstract":"An increase in student motivation is often cited as an expected effect of software visualization, but, as far as the authors are aware, no controlled experiments have yet demonstrated this. This paper therefore presents a controlled evaluation of this effect, conducted within the framework of self-determination theory. Students were tasked with removing redundant recursion in a multiple recursive algorithm. The experimental group (N = 19) used the SRec program visualization system, while the control group (N = 17) could use any programming tool in which they were proficient, such as BlueJ or Eclipse. The increase in motivation was measured by the difference between student scores in pre- and post-tests of their motivation. Statistically significant increases were observed for the two more determined forms of motivation, intrinsic motivation (p = 0.01), and extrinsic motivation via identified regulation (p = 0.03). Student feedback about their subjective acceptance of SRec reinforced these results. These findings give experimental support to expectations for software visualization in terms of motivation. Several paths for future work are identified, in particular, the need for more experiments under various conditions to achieve deeper understanding of the motivational effect of program visualization.","authors":["J. Ángel Velázquez-Iturbide","Isidoro Hernán-Losada","Maximiliano Paredes"],"meta":["January 2017IEEE Transactions on Education PP(99):1-8","DOI:10.1109/TE.2017.2648781"],"references":["305081692_Systematic_Development_of_Dynamic_Programming_Algorithms_Assisted_by_Interactive_Visualization","259998484_A_Review_of_Generic_Program_Visualization_Systems_for_Introductory_Programming_Education","303959495_InterViews_Learning_the_Craft_of_Qualitative_Research_Interviewing","291075096_Self-determined_motivation_and_students'_physical_activity_during_structured_physical_education_lessons_and_free_choice_periods","289963904_Intrinsic_and_extrinsic_motivations_Classic_definitions_and_new_directions","289963001_Intrinsic_and_Extrinsic_Motivations_Classic_Definition_and_New_Directions","272160038_Learning_and_Awareness","266445525_Data_structures_algorithms_and_applications_in_C","254007375_Detecting_and_understanding_students'_misconceptions_related_to_algorithms_and_data_structures","247442902_Introduction_To_Algorithms"]}