{"id":"312491934_Smartphones_usage_in_the_classrooms_Learning_aid_or_interference","abstract":"Many educational institutions, especially higher education institutions, are considering to embrace smartphones as part of learning aids in classes as most students (in many cases all students) not only own them but also are also attached to them. The main question is whether embracing smartphones in classroom teaching enhances the learning or perhaps an interference. This paper presents the finding of our study on embracing smartphone in classroom teaching. The study was carried out through a survey and interview/discussion with a focus group of students. We found that they use their smartphones to access teaching materials or supporting information, which are normally accessible through the Internet. Students use smartphones as learning aids due many reasons such as they provide convenience, portability, comprehensive learning experiences, multi sources and multitasks, and environmentally friendly. They also use smartphones to interact with teachers outside classes and using smartphones to manage their group assignments. However, integrating smartphones in a classroom-teaching environment is a challenging task. Lecturers may need to incorporate smartphones in teaching and learning to create attractive teaching and optimum interaction with students in classes while mitigating or at least minimising distractions that can be created. Some of the challenges are distraction, dependency, lacking hands on skills, and the reduce quality of face-to-face interaction. To avoid any disturbances in using smartphones within a classroom environment, proper rules of using smartphones in class should be established before teaching, and students need to abide to these rules.","authors":["Muhammad Anshari","Mohammad Nabil Almunawar","Masitah Shahrill","Danang Kuncoro Wicaksono"],"meta":["November 2017Education and Information Technologies 22(6)","DOI:10.1007/s10639-017-9572-7"],"references":["315505989_Implementing_a_Social_Knowledge_Creation_Environment","305920596_Intimacy_and_Smartphone_Multitasking--A_New_Oxymoron","305365729_Intertwining_Digital_Technology_and_Literacy_Methods_Courses","299476600_Smartphone_Use_and_Perceptions_among_Medical_Students_and_Practicing_Physicians","312277945_Multitasking_Among_College_Students_Are_Freshmen_More_Distracted","307572986_Exploring_the_Causes_of_Smartphone_Dependency_and_Purchasing_Behavior","306379781_Developing_online_learning_resources_Big_data_social_networks_and_cloud_computing_to_support_pervasive_knowledge","305688123_Teaching_for_Quality_Learning_at_University","301941818_Staying_Connected_Computer-Mediated_and_Face-to-Face_Communication_in_College_Students'_Dating_Relationships","301227476_The_influence_of_vicarious_experience_provided_through_mobile_technology_on_self-efficacy_when_learning_new_tasks"]}