{"id":"312481696_Soul_in_the_world_symbolic_culture_as_the_medium_for_psyche","abstract":"en Whilst the loss of a sense of living connection with the material world is mainly associated with the scientific revolution in seventeenth century Europe, it can be traced back to Plato's introduction of a hierarchy between soul and body. Jung's attempted solution to this – esse in anima – is ingenious but maintains the Cartesian split by which the aliveness of the world is reduced to a projection of psychic forces (the archetypes). An alternative approach is proposed, rooted in the Aristotelean emphasis on practical activity that sees the soul as a function of our way of being in the world. Human cognition is extended and distributed by our social and material engagement with the world, especially via collective representations whose symbolic character is constitutive of the reality of the world in which we live. Despite the dominance of ‘scientific Cartesian’ representations in the modern Western world, there remain numerous instances of participation mystique that cannot be captured by the Cartesian notion of projection. These indicate an opening to ways of being in the world that may lead us out of the impasse of the Cartesian matrix.\n\nTranslations of abstract\nfr Alors que la perte du sentiment d'un lien vivant avec le monde matériel est associée principalement à la révolution scientifique de l'Europe du XVII siècle, on peut la rattacher à l'introduction par Platon d'une hiérarchie entre l'âme et le corps. La solution que Jung a proposée à cela – esse in anima – est ingénieuse mais elle maintient le clivage cartésien par lequel l'aspect vivant du monde est réduit à une projection de forces psychiques (les archétypes). Une alternative est ici proposée, qui prend sa source dans l'insistance aristotélicienne sur l'activité pratique qui envisage l'âme comme une fonction de notre manière d'être dans le monde. La connaissance humaine est élargie et diffusée par notre implication sociale et matérielle avec le monde, particulièrement par le biais de représentations collectives dont le caractère symbolique est constitutif de la réalité du monde dans lequel nous vivons. Malgré la dominance de représentations « cartésiennes scientifiques » dans le monde occidental moderne, demeurent de nombreuses situations de participation mystique dont la notion cartésienne de projection ne peut rendre compte. Elles indiquent une ouverture vers des manières d'être dans le monde qui peuvent nous guider pour sortir de l'impasse de la matrice cartésienne.\n\nAbstract\nde Gleichwohl der Verlust des Sinnes für eine lebendige Beziehung zur materiellen Welt hauptsächlich mit der wissenschaftlichen Revolution des siebzehnten Jahrhunderts in Europa assoziiert wird, kann dieser bis zu Platos Einführung einer Hierarchie zwischen Körper und Geist zurückverfolgt werden. Jungs Lösungsversuch hierfür – esse in anima – ist geschickt, hält aber den cartesianischen Dualismus aufrecht, der die Lebendigkeit der Welt auf eine Projektion seelischer Kräfte (die Archetypen) reduziert. Eine alternative Herangehensweise bietet sich an, gegründet auf der aristotelischen Betonung der praktischen Tätigkeit, die die Seele als eine Funktion unserer Art in der Welt zu sein auffaßt.\nMenschliche Erkenntnis wird durch unser soziales und materielles Engagement mit der Welt erweitert und verbreitet, besonders über kollektive Repräsentationen, deren symbolischer Charakter für die Realität der Welt in der wir leben konstitutiv ist. Trotz der Dominanz von ‘cartesianisch wissenschaftlichen’ Repräsentationen in der modernen westlichen Welt verbleibt eine Vielzahl an Fällen von participation mystique, die nicht vom cartesianischen Begriff der Projektion erfaßt werden. Diese markieren eine Öffnung zu Möglichkeiten des In‐der‐Welt‐Seiens, die uns aus der Sackgasse der cartesianischen Matrix herausführen können.\n\nAbstract\nit Sebbene la perdita del senso di connessione con il mondo materiale sia prevalentemente associata alla rivoluzione scientifica europea del XVII secolo, può essere rintracciata già nell'introduzione di Platone ad una gerarchia tra anima e corpo. Il tentativo di Jung di risolvere il dilemma dell'essere nell'anima è ingegnoso ma mantiene la scissione cartesiana secondo cui la vita nel mondo è ridotta alla proiezione di forze psichiche (gli archetipi). Un approccio alternativo, qui proposto, è fondato sull'enfasi aristotelica sulla attività pratica che vede l'anima come funzione del nostro modo di essere nel mondo. Il pensiero umano si estende e circola anche attraverso il nostro rapporto materiale con il mondo in cui viviamo. Malgrado il dominio delle rappresentazioni scientifiche “cartesiane” nel moderno mondo occidentale, permangono numerosi esempi di participation mystique che non possono essere spiegate dalla nozione cartesiana di proiezione. Questo suggerisce una apertura a modi di essere nel mondo che possono condurci fuori dall'impasse della matrice cartesiana.\n\nAbstract\nru Hecмoтpя нa тo, чтo утpaтa живoтвopящeй cвязи c мaтepиaльным миpoм в ocнoвнoм accoцииpуeтcя c нaучнoй peвoлюциeй XVII вeкa, этa жe тeмa мoжeт быть пpocлeжeнa дo Плaтoнoвcкoгo ввeдeния иepapxии мeжду душoй и тeлoм. Пpeдпpинятaя Юнгoм пoпыткa paзpeшeния этoй дилeммы – ecce in anima – гeниaльнa, нo coxpaняeт кapтeзиaнcкoe pacщeплeниe, в peзультaтe кoтopoгo oдушeвлeннocть миpa cвeдeнa к пpoeкциям пcиxичecкиx cил (apxeтипoв). Пpeдлaгaeтcя aльтepнaтивный этoму пoдxoд, вocxoдящий к apиcтoтeлeвcкoму aкцeнту нa пpaктичecкую aктивнocть, видящую в душe функцию нaшeгo cпocoбa бытия в миpe. Чeлoвeчecкoe пoзнaниe pacпpocтpaняeтcя и pacпpeдeляeтcя c пoмoщью нaшeй coциaльнoй и мaтepиaльнoй вoвлeчeннocти в миp, ocoбeннo пocpeдcтвoм кoллeктивныx peпpeзeнтaций, чeй cимвoличecкий xapaктep cтaнoвитcя oбpaзующим фaктopoм тoй peaльнocти, в кoтopoй мы живeм. Hecмoтpя нa дoминиpoвaниe «нaучныx кapтeзиaнcкиx» peпpeзeнтaций в coвpeмeннoм зaпaднoм миpe, вce жe ocтaютcя eщe мнoгoчиcлeнныe мгнoвeния «миcтичecкoгo coучacтия» (participation mystique), нe пoддaющиecя пocтижeнию c пoмoщью кapтeзиaнcкoгo пoнятия пpoeкции. Этo укaзывaeт нa oткpытиe тaкиx cпocoбoв cущecтвoвaния в миpe, кoтopыe мoгут вывecти нac из тупикa кapтeзиaнcкoй мaтpицы.\n\nAbstract\nes Mientras que la pérdida de la sensación de conexión vital con el mundo material está fundamentalmente asociada a la revolución científica del siglo diecisiete en Europa, la misma podría rastrearse hasta Platón en su introducción a una jerarquía entre alma y cuerpo. El intento de solución de Jung a este – esse in anima – es ingenioso, pero conserva la disociación cartesiana por la cual lo vital del mundo es reducido a una proyección de las fuerzas psíquicas (los arquetipos). Se propone una aproximación alternativa enraizada en el énfasis Aristotélico en la actividad práctica que ve al alma como una función de nuestro modo de estar en el mundo. La cognición humana se extiende y distribuye a partir de nuestro intercambio social y material con el mundo, especialmente vía las representaciones colectivas cuyo carácter simbólico es constitutivo de la realidad del mundo en el cual vivimos. A pesar de la dominancia de las representaciones “científico Cartesianas” en el mundo Occidental moderno, permanecen numerosas instancias de participation mystique que no pueden ser capturadas por la noción Cartesiana de la proyección. Esto indica una apertura a modos de estar en el mundo que nos puede conducir más allá del impase de la matriz Cartesiana.\n\nAbstract\nzh 世界中的灵魂:作为心灵中介的象征性的文化十七世纪欧洲发生了科学革命,与此同时,我们也丧失了与物质世界之间鲜活的连接感,这一革命可以追溯到柏拉图提出心灵与身体层级的思想。荣格尝试为此提出一个存在于阿尼玛中解决的途径,这一途径是独特的,但仍维持了笛卡尔的分裂,在这一分裂中,世界的生命力被简化为心灵力量(原型)的投射。另一个替代性的取向被假定是根植于亚里士多德学派所强调的实用的活动,它把灵魂看作是一种让我们存在于世界的功能。人类的认知得以扩展和散播有赖于我们在社会和物质层面与世界进行的接洽,特别是通过集体化的表征来实现这种的接洽,这些表征的象征性的特点显示了我们所处世界的真实本质。尽管“科学的笛卡尔主义”在现代西方世界盛行,仍然存在着一些神秘参与的事例不能够被笛卡尔的投射观点所捕捉。这暗示着我们仍然有机会得到多种存在于世界的方式,这些不同的存在方式可以带领我们走出笛卡尔矩阵的僵局。","authors":["Warren Colman"],"meta":["February 2017The Journal of analytical psychology 62(1):32-49","DOI:10.1111/1468-5922.12278"],"references":["220414933_Hegel_and_the_Extended_Mind","348948644_Act_and_Image_The_Emergence_of_Symbolic_Imagination","345550369_Psychological_Commentary_on_the_Tibetan_Book_of_the_Great_Liberation_1","330328462_How_Things_Shape_the_Mind_A_Theory_of_Material_Engagement","329925984_Origins_of_Human_Communication","318585534_Psychological_Types","298417858_The_Extended_Mind","287548995_Shamans_and_analysts_New_insights_on_the_wounded_healer","281055910_A_revolution_of_the_mind_Some_implications_of_George_Hogenson's_'The_Baldwin_Effect_A_neglected_influence_on_CG_Jung's_evolutionary_thinking'_2001","276001897_Making_the_Human_Mind","274356980_The_Interpretation_of_Cultures_Selected_Essays","270302894_The_Symbolic_Species_The_Co-Evolution_of_Language_and_the_Brain","269505198_The_Construction_of_Social_Reality","263573070_Animism_fetishism_and_objectivism_as_strategies_for_knowing_or_not_knowing_the_world","262486909_Mind_in_Life_Biology_Phenomenology_and_the_Sciences_of_Mind","262158274_The_extended_mind-_extended","243779614_The_Spell_of_the_Sensuous_Perception_and_Language_in_a_More-Than-Human_World","233489033_Routledge_Encyclopedia_of_Philosophy","229068136_Cognition_in_The_Wild","51612422_Synchronicity_and_the_meaning-making_psyche","47037780_The_Red_Book_Liber_Novus","40853522_The_Origins_of_Human_Communication","5875281_Jung_and_Levy-Bruhl"]}