{"id":"312407974_Coherency_Maximizing_Exploration_in_the_Supermarket","abstract":"In uncertain environments, effective decision makers balance exploiting options that are currently preferred against exploring alternative options that may prove superior. For example, a honeybee foraging for nectar must decide whether to continue exploiting the current patch or move to a new location. When the relative reward of options changes over time, humans explore in a normatively correct fashion, exploring more often when they are uncertain about the relative value of competing options. However, rewards in these laboratory studies were objective (for example, monetary payoff), whereas many real-world decision environments involve subjective evaluations of reward (for example, satisfaction with food choice). In such cases, rather than choices following preferences, preferences may follow choices with subjective reward (that is, value) to maximize coherency between preferences and behaviour 12,13 . If so, increasing coherency would lessen the tendency to explore while uncertainty increases, contrary to previous findings. To evaluate this possibility, we examined the exploratory choices of more than 280,000 anonymized individuals in supermarkets over several years. Consumers’ patterns of exploratory choice ran counter to normative models for objective rewards — the longer the exploitation streak for a product, the less likely people were to explore an alternative. Furthermore, customers preferred coupons to explore alternative products when they had recently started an exploitation streak. These findings suggest interventions to promote healthy lifestyle choices.","authors":["Peter S. Riefer","Rosie Prior","Nicholas Blair","Giles Pavey"],"meta":["January 2017Nature Human Behaviour 1(1):0017","DOI:10.1038/s41562-016-0017"],"references":["281719623_Unfazed_by_Both_the_Bull_and_Bear_Strategic_Exploration_in_Dynamic_Environments","269467302_Exploration_versus_exploitation_in_space_mind_and_society","257919825_Choice_Blindness_and_Preference_Change_You_Will_Like_This_Paper_Better_If_You_Believe_You_Chose_to_Read_It","295570792_Prefrontal_and_striatal_dopaminergic_genes_predict_individual_differences_in_exploration_and_exploitation_vol_12_pg_1062_2009","281549433_How_actions_create-not_just_reveal-preferences","279608755_Recent_Research_on_Selective_Exposure_to_Information","277089269_A_Frontal_Dopamine_System_for_Reflective_Exploratory_Behavior","275363289_Uncertainty_and_Exploration_in_a_Restless_Bandit_Problem","261070020_Physiological_and_behavioral_signatures_of_reflective_exploratory_choice","256929617_The_Influence_of_Depression_Symptoms_on_Exploratory_Decision-Making"]}