{"id":"312432926_Sentence_Length_and_NP_Complexity_of_General_and_Medical_Written_Academic_and_Media_Texts_An_Analysis_Using_a_Trained_Syntactic_Parser","abstract":"The main objective of this work is to perform a comparative analysis of sentence and main noun phrases complexity in two different types of discourses, written media and academic prose, using a trained syntactic parser (Stanford PCFG Parser). For this purpose, we have selected three written sources: a general media corpus, a medical media subcorpus and a medical academic prose subcorpus. From a total of more than 160000 sentences, we have carefully selected as the study sample a total of 300, which have been morphologically and syntactically annotated.\nInfluenced by other studies related to syntax and statistics, our hypothesis is that NPs from academic prose and written media will contain four or more words, and those belonging to academic prose will be larger than the latter. The NPs studied are those that perform the main functions of the clause: subject, object (direct and indirect), attribute and time expressions. The results show a confirmation of our hypothesis. The academic subcorpus has the longest sentences and more complex NPs than the other texts. On the other hand, written media corpora achieve smaller NPs but their results are quite similar.","authors":["Carlos Herrero-Zorita","Antonio Moreno Sandoval"],"meta":["November 2016","DOI:10.29007/gr8r","Conference: VIII International Conference on Corpus Linguistics, CILC2016At: Málaga, SpainVolume: EPiC Series in Language and Linguistics, Volume 1"],"references":["267448269_Better_tags_give_better_trees_-or_do_they","266477864_Design_and_Annotation_of_MultiMedica_-_A_Multilingual_Text_Corpus_of_the_Biomedical_Domain","2921800_In_Accurate_Unlexicalized_Parsing","2882045_Developing_a_Syntactic_Annotation_Scheme_and_Tools_for_a_Spanish_Treebank","287549101_Noun_phrase_complexity_in_English","222558973_Using_small_random_samples_for_the_manual_evaluation_of_statistical_association_measures","2530760_The_Longman_Grammar_of_Spoken_and_Written_English"]}