{"id":"312491056_Analise_do_Desempenho_de_Algoritmos_Classicos_de_Busca_de_Caminho_em_Ambiente_de_Navegacao","abstract":"The literature shows a wide variety of pathfinding algorithms for navigation environments. These algorithms are widely used in games, robotics, GPS and many other applications. This paper aims to analyze how the classics algorithms Breadth-First Search, Search with Uniform Cost, A * and Weighted A * behave in an environment with various costs. It presents an analysis of the objectives of minimizing the path cost and amount of expanded nodes. Resumo. A literatura apresenta uma grande variedade de algoritmos de busca de caminho em ambientes de navegaçnavegaç˜navegação. Esses algoritmos são amplamente utilizados em jogos, robôs, GPS e diversas outras aplicaçaplicaç˜aplicações. Este trabalho visa analisar como os algoritmos clássicos Busca Cega em Largura, Busca com Custo Uniforme, A * e Weighted A * desempenham em um cenário com diversos custos. Apresenta-se uma análise nos objetivos de minimizaçminimizaç˜minimização do custo do caminho e de quantidade de nós expandidos. 1. IntroduçIntroduç˜Introdução O problema de encontrar o menor caminho em um ambienté e recorrente em diversas aplicaçaplicaç˜aplicações e problemas cotidianos, por exemplo, a menor rota até o destino que deve ser encontrada por um GPS, um robô que deve procurar um caminho para sair de um labirinto e um personagem em um jogo que deve se aproximar de um inimigo. As abordagens clássicas como Busca Cega em Largura e Busca com Custo Uni-forme são bem conhecidas para busca em grafos. A ideiá e expandir os nós dá arvore de decisão com base em algum critério. No caso da Busca Cega em Largura os nós são explorados seguindo o conceito de FIFO (First In First Out), ou seja, os primei-ros nós a chegarem são os primeiros a serem explorados. A Busca com Custo Uni-formé e uma variaçvariaç˜variação que considera o custo acumulado durante a expansões dos nós, de maneira a dar preferência para os nós com menor custo até então. O algoritmo A * [P. E. Hart and Raphael 1968] ´ e similar a Busca com Custo Uniforme, porém se diferen-cia pelo uso de uma heurística que poda a ´ arvore de expansão. Quatro décadas depois do surgimento do A * , os algoritmos sofreram diversos avanços e frequentemente são apresentadas novas abordagens. [Algfoor et al. 2015] apre-senta uma revisão sobre o estado da arte dos algoritmos de busca e demonstram que há uma grande variedade de abordagens. Cada abordagem costuma lidar com um caso específico do problema, como espaços de busca tridimensionais, ambientes dinâmicos, variadas topologias de terreno, ponto destino em movimento, tempo limitado de pro-cessamento e espaços de busca complexos. Esses tratamentos de casos geralmente são otimizaçotimizaç˜otimizações do A * que aproveitam características em particular do cenário.","authors":["Rafael Castro","Rafael Stubs Parpinelli"],"meta":["May 2016","Conference: Computer on the beach"],"references":["275222135_A_Comprehensive_Study_on_Pathfinding_Techniques_for_Robotics_and_Video_Games","272161464_Artificial_Intelligence_A_Modern_Approach_Second_Edition","244486343_Artificial_Intelligence_for_Games","239597684_First_results_on_the_effect_of_error_on_heuristic_search","238799612_A_Formal_Basis_for_the_Heuristic_Determination_of_Minimum_Cost_Paths","221619552_ARA_Anytime_A_with_Provable_Bounds_on_Sub-Optimality"]}