{"id":"312496360_Detailed_hydrodynamic_characterization_of_harmonically_excited_falling-film_flows_A_combined_experimental_and_computational_study","abstract":"We present results from the simultaneous application of planar laser-induced fluorescence (PLIF), particle image velocimetry (PIV) and particle tracking velocimetry (PTV), complemented by direct numerical simulations, aimed at the detailed hydrodynamic characterization of harmonically excited liquid-film flows falling under the action of gravity. The experimental campaign comprises four different aqueous-glycerol solutions corresponding to four Kapitza numbers (Ka = 14, 85, 350, 1800), spanning the Reynolds number range Re = 2.3–320, and with forcing frequencies f w = 7 and 10 Hz. PLIF was employed to generate spatiotemporally resolved film-height measurements, and PIV and PTV to generate two-dimensional velocity-vector maps of the flow field underneath the wavy film interface. The latter allows for instantaneous, highly localized velocity-profile, bulk-velocity, and flow-rate data to be retrieved, based on which the effect of local film topology on the flow field underneath the waves is studied in detail. Temporal sequences of instantaneous and local film height and bulk velocity are generated and combined into bulk flow-rate time series. The time-mean flow rates are then decomposed into steady and unsteady components, the former represented by the product of the mean film height and mean bulk velocity and the latter by the covariance of the film-height and bulk-velocity fluctuations. The steady terms are found to vary linearly with the flow Re, with the best-fit gradients approximated closely by the kinematic viscosities of the three examined liquids. The unsteady terms, typically amounting to 5%–10% of the mean and peaking at approximately 20%, are found to scale linearly with the film-height variance. And, interestingly, the instantaneous flow rate is found to vary linearly with the instantaneous film height. Both experimental and numerical flow-rate data are closely approximated by a simple analytical relationship with only minor deviations. This relationship includes terms such as the wave speed c and mean flow rate Q, which can be obtained by relatively simple and inexpensive methods, thus allowing for spatiotemporally resolved flow-rate predictions to be made without requiring explicit knowledge of the full flow-field information underneath the wavy interface.","authors":["Alexandros Charogiannis","Fabian Denner","Berend van Wachem","Serafim Kalliadasis"],"meta":["January 2017Physical Review Fluids 2(1):014002","DOI:10.1103/PhysRevFluids.2.014002","Project: Harnessing unsteady phase-change heat exchange in high-performance concentrated solar power systems"],"references":["321614380_Particle_Image_Velocimetry_A_Practical_Guide","310433784_Artificial_viscosity_model_to_mitigate_numerical_artefacts_at_fluid_interfaces_with_surface_tension","283355604_An_experimental_study_of_spatiotemporally_resolved_heat_transfer_in_thin_liquid-film_flows_falling_over_an_inclined_heated_foil","279460435_A_simultaneous_planar_laser-induced_fluorescence_particle_image_velocimetry_and_particle_tracking_velocimetry_technique_for_the_investigation_of_thin_liquid-film_flows","271635882_Characteristics_of_horizontal_liquid-liquid_flows_in_a_circular_pipe_using_simultaneous_high-speed_laser-induced_fluorescence_and_particle_velocimetry","313427726_Dia_Oberflachenkondensation_des_wasserdampfes","299279122_Self-similarity_of_solitary_waves_on_inertia-dominated_falling_liquid_films","284757967_Wave_flow_of_thin_layers_of_a_viscous_fluid_i_the_free_flow","280995260_Die_OberflachenKondensation_des_Wasserdamfes","276930158_Coherent_Structures_in_Nonlocal_Dispersive_Active-Dissipative_Systems"]}