{"id":"312465778_A_systematic_review_on_mobile_learning_in_higher_education_The_African_perspective","abstract":"The spread and popularity of mobile devices has led to their increased application in higher education. While studies have reviewed mobile learning initiatives in different contexts, none has explored this subject in Africa. This systematic review collates and compares studies published between 2010 and 2016 on mobile learning in higher education in the African context to explore the application, impact and challenges of mobile technologysupported learning. Findings show that mobile learning within higher education institutions in Africa increased student and lecturer collaboration and, provide dinstant communication, increased student participation and engagement, facilitating authentic learning and reflective practice, as well as fostering learning communities. A change in the lecturers' approaches to teaching also occurred. The findings also indicate significant challenges in integrating mobile learning in higher education institutions within Africa: poor technological infrastructure, lack of access to modern mobile devices, lack of mobile learning pedagogical skills among lecturers, poor attitudes among students and lecturers, and incompatibility of mobile devices with the university online management systems. Policies to guide the implementation of mobile learning were also lacking. Large-scale studies assessing the effectiveness of mobile learning within African higher education institutions are lacking and existing studies lacked a theoretical framework. The review highlights enabling conditions for successful integration of mobile learning in African institutions addressing access, training, curriculum design, support and technical requirements. The absence of studies reporting on existing mobile learning projects reflects the limited penetration of this technology and associated pedagogies and a need to strengthen research in this emerging field.","authors":["Rogers Kaliisa","Michelle Yvette Picard"],"meta":["January 2017"],"references":["295400457_Rethinking_pedagogy_for_a_digital_age_designing_for_21st_Century_Learning","290479461_The_Use_of_Mobile_Learning_in_Science_A_Systematic_Review","307981818_Qualitative_research_for_education_An_introduction_to_theories_and_methods","305197317_Adopting_Mobile_Technology_in_the_Higher_Education_Classroom","300142815_Difficulties_Experienced_by_Students_Using_Mobile_Devices_to_Access_E-Learning","299428131_Doing_quantitative_research_in_education_with_SPSS_2nd_edition","298788133_A_Practical_Introduction_to_In-Depth_Interviewing","298205786_Online_Support_Service_via_Mobile_Technology_-_a_Pilot_Study_at_a_Higher_Education_Institution_in_South_Africa","296410300_A_survey_of_personal_digital_assistants_PDAs_use_in_a_middle_school_environment_Perceptions_of_teachers_parents_and_students","293192501_Integrating_self-paced_mobile_learning_into_language_instruction_impact_on_reading_comprehension_and_learner_satisfaction"]}