{"id":"312408658_Participacion_de_las_mujeres_en_la_carrera_de_Ingenieria_Informatica_de_la_Universidad_Nacional_y_su_desempeno_en_los_cursos_de_programacion","abstract":"It is well documented worldwide the low presence of women in informatics careers, and this phenomenon seems to have grown in recent years. This article describes the current situation in the Information Systems career in the School of Informatics at the National University of Costa Rica (UNA). The problem of low female participation is analyzed in two dimensions: recruitment and retention. To study recruitment, we have analyzed the institutional indices of application and admission. To study retention, we have analyzed student achievement in the programming area, because it is considered a central area in the curriculum and an area of difficulty for students. The analysis is performed using data obtained from the UNA Registration Department in a period of 8 years, from 2007 to 2014. The findings support the worldwide results about the underrepresentation of women in the career. Permanency patterns are similar for both sex, and women tend to be more effective in graduating. Additionally, the first two courses of programming seem to represent difficulties for all students, but women tend to have lower performance. In general, the study aims to be a starting point to propose educational actions to improve the rates of representation and permanence of women in the career, while increasing the number of graduates in the area; an issue that is of institutional, national and international interest.","authors":["Sonia Mora","Mayela Coto","Johnny Villalobos"],"meta":["December 2016Revista Electrónica Educare 21(1):1","DOI:10.15359/ree.21-1.12"],"references":["274819744_Changes_in_CS_students'_attitudes_towards_CS_over_time","250144949_Gender_Differences_in_Types_of_Assignments_Preferred_Implications_for_Computer_Science_Instruction","311474095_Once_she_makes_it_she_is_there_gender_differences_in_computer_science_study","311473376_Unlocking_the_clubhouse_women_in_computing","311471798_Wanted_CS1_students_no_experience_required","291578456_Women_catch_up","275483505_Undergraduate_women_in_computer_science","268001177_A_Study_of_Factors_Promoting_Success_in_Computer_Science","261300360_Gender_gap_in_computer_science_programs_from_Costa_Rican_Public_universities_Are_Women_Really_Becoming_Extinct","242352388_Gender_differences_in_computer_science_education"]}