{"id":"312491932_Computadores_explicaveis","abstract":"Resumo: Não é óbvio que a imagem de um sistema computacional deva ser o código que o anima, a máquina que lhe dá corpo, alguma composição híbrida dos dois, ou nenhuma dessas coisas. Sabe-se, entretanto, que um computador, um aplicativo, um sistema, todos esses objetos vivem entre nós – e em nós – pelos enunciados que os envelopam. O ensino da computação acabará por ter que haver-se com a impossibilidade de subordinar esses enunciados a uma ordem discursiva qualquer, e ainda assim continuar a produzí-los, ou testemunhá-los se dizerem, sempre como língua menor de uma língua maior indeterminada. Tudo isso, sabendo que essa é uma disposição sobre a qual não se pode realmente estar em paz, nunca, mas sobre a qual se pode criar uma vida em que a oposição entre tecnologia e afeto possa ser, enfim, desmascarada. Palavras-chave: Ensino de Computação. Linguagens Formais. Ordem do Discurso. Abstract: It is not obvious that the image of a computational system should be the code that animates it, or the machine that gives it a body, some hybrid composition of those two things, or neither. What we know, however, is that a computer, an application, a system, all these objects live amongst us – and in us – through the statements that envelope them. The teaching of computer science will eventually have to deal with the impossibility of subordinating these statements to any discursive order whatsoever, and still continue to produce them, or witness their utterances, always as a minor language of an undetermined major language. All this, knowing that that is a disposition with which one cannot ever be really at peace, but upon which it is possible to create a life where the opposition between technology and affection may finally be unmasked.","authors":["Maria Lúcia Batista","André Souza Lemos"],"meta":["December 2016","Project: A Ciência da Computação no Contexto da Educação Tecnológica"],"references":["248430930_Where_mathematics_comes_from"]}