{"id":"312482697_Static_analysis_of_Taverna_workflows_to_predict_provenance_patterns","abstract":"Workflows have found adoption in scientific domains particularly due to their automation and provenance features. Using workflows scientists can repeat analyses with different input parameters and later use provenance to access and compare results based on these respective parameters. A common assumption is that by designing an analysis as a workflow we get parameter-to-result traceability for free by using workflow provenance. This assumption holds for cases of coarse-grained traceability where an entire workflow is subjected to repetition and all workflow parameters contribute to all results. However, this assumption is not guaranteed to hold for cases requiring finer grained traceability: where a workflow is configured with collections of parameters and analyses within a workflow are repeated with combinations of parameters from collections. In this paper we identify two dimensions that affect fine-grained traceability: (1) Factorial Design, which is the level of granularity in modelling parameters/data in workflows and in provenance that is supported by a workflow system; and (2) the practice of scientists in successfully encoding Factorial Design into workflows. Taverna is a workflow system that provides extensive features for factorial design. However it also supports a free approach to workflow design which means that scientists may create workflows which could break traceability in provenance when they run. Using a real-world Taverna workflow we show how broken traceability manifests in provenance, rendering it ineffective for accessing workflow outputs derived from particular input parameters. In order to prevent broken traceability from occurring we describe a rule-based static analysis technique which operates over workflow descriptions and anticipates patterns in provenance. Our rules exploit the well-defined execution behaviour in the Taverna system. In order to understand Factorial Design support in workflow systems in general, we provide a comparative survey. We conclude that other workflow systems also provide constructs for Factorial Design, and, similar to Taverna, they too are prone to broken traceability.","authors":["Pinar Alper","Khalid Belhajjame","Carole A. Goble"],"meta":["January 2017Future Generation Computer Systems 75","DOI:10.1016/j.future.2017.01.004"],"references":["272200261_Using_a_suite_of_ontologies_for_preserving_workflow-centric_research_objects","262209903_A_PROV_Encoding_for_Provenance_Analysis_Using_Deductive_Rules","226544513_Automatic_Annotation_of_Web_Services_Based_on_Workflow_Definitions","225249435_Taverna_Reloaded","224107169_Wings_Intelligent_Workflow-Based_Design_of_Computational_Experiments","221502404_Project_Histories_Managing_Data_Provenance_Across_Collection-Oriented_Scientific_Workflow_Runs","221212794_VisTrails_Visualization_meets_data_management","221103690_Fine-grained_and_efficient_lineage_querying_of_collection-based_workflow_provenance","220919098_Provenance_Collection_Support_in_the_Kepler_Scientific_Workflow_System","220337578_The_Application_of_Petri_Nets_to_Workflow_Management","51476349_Data_Sharing_by_Scientists_Practices_and_Perceptions","7593684_Galaxy_A_platform_for_interactive_large-scale_genome_analysis","312487696_Static_compiler_analysis_for_workflow_provenance","300478214_Looking_Inside_the_Black-Box_Capturing_Data_Provenance_Using_Dynamic_Instrumentation","300478122_Computing_Location-Based_Lineage_from_Workflow_Specifications_to_Optimize_Provenance_Queries","259510682_Implementing_interoperable_provenance_in_biomedical_research","222521896_The_Open_Provenance_Model_core_specification_v11","222473133_Advances_in_the_dataflow_computational_model","220406132_Analysing_scientific_workflows_with_Computational_Tree_Logic","220104475_Scientific_workflow_management_and_the_KEPLER_system"]}