{"id":"312479848_El_desempeno_docente_y_el_uso_de_recursos_informaticos_en_la_institucion_educativa_n_7050_Nicanor_Rivera_Caceres","abstract":"El estudio analiza la relacion entre el desempeno docente y el uso de recursos informaticos en el trabajo pedagogico, desde la perspectiva de los estudiantes dentro de la Institucion Educativa No 7050 “Nicanor Rivera Caceres”, Barranco, por lo que busca difundir los resultados obtenidos. Tuvo un enfoque cuantitativo y diseno no experimental, transversal correlacional. Se ejecuto con una muestra censal que incluyo a 88 estudiantes de tercero a quinto grado de educacion secundaria. El instrumento utilizado fue el cuestionario, que midio la percepcion de los estudiantes respecto al desempeno docente en el aula y el uso de los recursos informaticos. En el contraste de hipotesis se utilizo el coeficiente de correlacion rho de Spearman debido a que se utilizo la escala Likert en el instrumento elaborado para la recopilacion de datos. El contraste de hipotesis general demostro que entre el desempeno docente en el aula y el uso de los recursos informaticos existe una relacion positiva alta (r = .784**) muy significativa (p = .000), lo que brinda suficiente evidencia para sustentar las hipotesis planteadas. Palabras Clave: Desempeno docente, programacion curricular, materiales didacticos, instrumentos de evaluacion, recursos informaticos.","authors":["Danitza Miriam Gutiérrez Cadenas"],"meta":["July 2016HAMUT AY 3(1):46","DOI:10.21503/hamu.v3i1.999"],"references":["315936037_Modelo_de_accion_docente_para_el_desarrollo_de_practicas_pedagogicas_con_medios_informaticos_y_telematicos_en_el_contexto_aula","28298316_Criterios_de_diseno_y_evaluacion_de_situaciones_didacticas_basadas_en_el_uso_de_medios_informaticos_para_el_estudio_de_las_matematicas","28231427_Criterios_de_diseno_y_evaluacion_de_situaciones_didacticas_basadas_en_el_uso_de_medios_informaticos_para_el_estudio_de_las_matematicas","303310292_Didactica_para_profesores_de_a_pie_propuestas_para_comprender_y_mejorar_la_practica","266497260_LA_UTILIZACION_DE_MEDIOS_Y_RECURSOS_DIDACTICOS_EN_EL_AULA","227431563_La_informatica_educativa_como_medio_de_ensenanza","44503197_Evaluacion_del_desempeno_docente_fundamentos_modelos_e_instrumentos_Ignacio_Abdon_Montenegro_Aldana"]}