{"id":"312426004_Finding_the_most_efficient_paths_between_two_vertices_in_a_knapsack-item_weighted_graph","abstract":"There have been several combinations of the knapsack problem and the shortest paths on weighted graph problems in different researches. The combination is often used to describe the choices made during the knapsack problem stages using dynamic programming methods, by using the knapsack graph. But these researches consider only two aspects of weight and value for an item/vertex. The objective of this paper is to address a different kind of problem in which we are taking into consideration three properties: item weight, item value and edge weight (that connects two items, but its weight is not depended on its vertices). The problem presented here is finding the most efficient path between two vertices of this specific kind of graph, in three aspects- minimal edge wise, maximum knapsack value wise, and a combination of maximal efficiency of both properties. This is done through an object oriented method, in which every path of the graph, between two chosen vertices, has comparable attributes, that gives us the ability to prefer a certain path from another. An algorithm for finding these optimal paths is presented here, along with specific explanations on its decision stages, and several examples for it. The results were achieved an exact paradigm for the integrated problem, taking into consideration any desired aspect, and achieving optimal choices per each attribute.","authors":["Nadav Voloch"],"meta":["December 2016International Journal of Advanced Computer Research 7(28):15-22","DOI:10.19101/IJACR.2017.728003"],"references":["220780045_Highway_Dimension_Shortest_Paths_and_Provably_Efficient_Algorithms","220669044_Using_Decomposition_Techniques_and_Constraint_Programming_for_Solving_the_Two-Dimensional_Bin-Packing_Problem","220639675_The_Knapsack_Problem_with_Conflict_Graphs","47843190_Algorithms_and_Data_Structures_The_Basic_Toolbox","36416657_A_Hike_Through_the_Forest_The_Knapsack_Problem_in_Graph_Theory","311521586_Highway_Dimension_and_Provably_Efficient_Shortest_Path_Algorithms","287661427_On_the_Partition_of_Numbers","266364201_Parallel_algorithms_for_knapsack_type_problems","265425391_Maximal_Flow_Through_a_Network","255683028_Discrete-Variable_Extremum_Problems","244415648_A_Dual_Algorithm_for_the_Restricted_Shortest_Path_Problem","242562037_A_Note_on_Two_Problems_in_Connexion_with_Graphs","222648938_A_Hybrid_Algorithm_for_the_Unbounded_Knapsack_Problem","220669453_A_Minimal_Algorithm_for_the_Bounded_Knapsack_Problem","45137419_Subsidies_Knapsack_Auctions_and_Dantzig's_Greedy_Heuristic"]}