{"id":"312570564_Deriving_Appropriate_Composite_Pavement_Foundation_Stiffness_Based_on_Mechanistic_Approach","abstract":"Mechanistic methods of determining pavement structural design parameters have recently proven to be highly effective and succinct in achieving a high degree of precision. The popularity to adopt these methods rises ever more with the advancements in computer science. This paper is among the series of publications that have been introducing appropriate mechanistic methodologies of determining vital pavement structural design parameters. The structural roles and contribution of subgrades and composite pavement foundations are virtually never mechanistically analysed and/or effectively performance evaluated in both qualitative and quantitative terms and/or; are hardly reported or comprehensively discussed in literature. In the case of pavements, the native subgrade forms the primary foundation, whilst the improved subgrade can be referred to as the secondary foundation and the subbase as the upper/capping layer of the foundation. In this paper, the term pavement structural foundation is defined as the composite of the multi-layers bearing the upper pavement courses (base, binder and wearing) depending on the pavement structural configuration design. Given the importance of the foundation as has been demonstrated in most case study analyses of premature failures of pavement structures, this paper presents a methodology of mechanistically determining the composite pavement foundation's layer stiffness that actively assumes a most integral structural role within the pavement structure.","authors":["John Ngaya Mukabi"],"meta":["January 2017"],"references":["311937044_Method_of_Mechanistically_Determining_Foundation_Structural_Thickness","311936864_Mechanistic_Approach_for_Determining_Structural_Subgrade_Thickness","309212130_THE_PROPOSED_TACH-MDS_-_REVOLUTIONARY_PB-VE_TECHNOLOGIES_AND_METHODS_OF_DESIGN_FOR_PAVEMENTS_AND_ANCILLARY_GEO-STRUCTURES","309176301_Fundamental_Theory_of_the_ReCap_Technique_and_its'_Application_in_the_Construction_of_Pavement_Structures_within_Problematic_SoilsFundamental_Theory_of_the_ReCap_Technique_and_its'_Application_in_the_","267701887_DEVELOPMENT_OF_RESILIENT_MODULUS_PREDICTION_MODELS_FOR_BASE_AND_SUBGRADE_PAVEMENT_LAYERS_FROM_IN_SITU_DEVICES_TEST_RESULTS"]}