{"id":"312512944_Recent_advances_in_planar_optics_From_plasmonic_to_dielectric_metasurfaces","abstract":"This article reviews recent progress leading to the realization of planar optical components made of a single layer of phase shifting nanostructures. After introducing the principles of planar optics and discussing earlier works on subwavelength diffractive optics, we introduce a classification of metasurfaces based on their different phase mechanisms and profiles and a comparison between plasmonic and dielectric metasurfaces. We place particular emphasis on the recent developments on electric and magnetic field control of light with dielectric nanostructures and highlight the physical mechanisms and designs required for efficient all-dielectric metasurfaces. Practical devices of general interest such as metalenses, beam deflectors, holograms, and polarizing interfaces are discussed, including high-performance metalenses at visible wavelengths. Successful strategies to achieve achromatic response at selected wavelengths and near unity transmission/reflection efficiency are discussed. Dielectric metasurfaces and dispersion management at interfaces open up technology opportunities for applications including wavefront control, lightweight imaging systems, displays, electronic consumer products, and conformable and wearable optics.","authors":["Patrice Genevet","Federico Capasso","Francesco Aieta","Reza Khorasaninejad"],"meta":["January 2017Optica 4(1):139","DOI:10.1364/OPTICA.4.000139"],"references":["309169423_Wave-Front_Transformation_with_Gradient_Metasurfaces","307920099_Broadband_high-efficiency_dielectric_metasurfaces_for_the_visible_spectrum","306031497_Controlling_Electromagnetic_Fields_at_Boundaries_of_Arbitrary_Geometries","305744719_High_efficiency_near_diffraction-limited_mid-infrared_flat_lenses_based_on_metasurface_reflectarrays","303097661_Broadband_and_chiral_binary_dielectric_meta-holograms","303091617_Traditional_and_emerging_materials_for_optical_metasurfaces","301900997_Metasurfaces_From_microwaves_to_visible","346107132_Generalized_theory_of_interference_and_its_applications","309438319_Polarization-Insensitive_Metalenses_at_Visible_Wavelengths","303779506_Metalenses_at_visible_wavelengths_Diffraction-limited_focusing_and_subwavelength_resolution_imaging"]}