{"id":"312510669_Combining_Convolutional_and_Recurrent_Neural_Networks_for_Human_Skin_Detection","abstract":"Skin detection from images, typically used as a preprocessing step, has a wide range of applications such as dermatology diagnostics, human computer interaction designs and so on. It is a challenging problem due to many factors such as variation in pigment melanin, uneven illumination and differences in ethnicity geographics. Besides, age and gender introduce additional difficulties to the detection process. It is hard to determine whether a single pixel is skin or non-skin without considering the context. An efficient traditional hand-engineered skin color detection algorithm requires extensive work by domain experts. Recently, deep learning algorithms, especially convolutional neural networks (CNNs), have achieved great success in pixel-wise labelling tasks. However, CNN-based architectures are not sufficient for modeling the relationship between pixels and their neighbors. In this letter, we integrate recurrent neural networks (RNNs) layers into the fully convolutional neural networks (FCNs), and develop an end-to-end network for human skin detection. In particular, FCN layers capture generic local features while RNN layers model the semantic contextual dependencies in images. Experimental results on the COMPAQ and ECU skin datasets validate the effectiveness of the proposed approach, where RNN layers enhance the discriminative power of skin detection in complex background situations.","authors":["Haiqiang Zuo","Heng Fan","Erik Blasch","Haibin Ling"],"meta":["January 2017Signal Processing Letters, IEEE PP(99):1-1","DOI:10.1109/LSP.2017.2654803"],"references":["305186785_Multi-Level_Contextual_RNNs_With_Attention_Model_for_Scene_Labeling","304409176_Conditional_Random_Fields_as_Recurrent_Neural_Networks","319770420_Semantic_Image_Segmentation_with_Deep_Convolutional_Nets_and_Fully_Connected_CRFs","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","319770168_Fully_Convolutional_Networks_for_Semantic_Segmentation","315615486_Overlay_of_thermal_and_visual_medical_images_using_skin_detection_and_image_registration","311757142_ReSeg_A_Recurrent_Neural_Network-Based_Model_for_Semantic_Segmentation","308858604_Scene_labeling_with_LSTM_recurrent_neural_networks","308813785_Deep_visual-semantic_alignments_for_generating_image_descriptions","304417592_MatConvNet_convolutional_neural_networks_for_MATLAB"]}