{"id":"312513112_DarwinSPL_an_integrated_tool_suite_for_modeling_evolving_context-aware_software_product_lines","abstract":"Software Product Lines (SPLs) are an approach for large-scale reuse for software families by means of variabilities and commonalities. We consider three dimensions of variability representing sources of software systems to behave differently: configuration as spatial variability, dependence on surroundings as contextual variability and evolution as temporal variability. The three dimensions of variability strongly correlate: Contextual variability changes the set of possible configurations in spatial variability. Temporal variability captures changes of spatial and contextual variability over the course of time. However, currently, there is no tool support for integrated modeling of these three dimensions of variability. In this paper, we present DarwinSPL, a tool suite supporting integrated definition of spatial, contextual and temporal variability. With DarwinSPL, spatial variability is modeled as feature models with constraints. Additionally, we are able to capture the current context and its impact on functionality of the SPL. Moreover, by providing support for temporal variability, DarwinSPL supports performing arbitrary evolutionary changes to spatial and contextual variability and tracking of previous evolution and planning future evolution of SPLs. We show the feasibility of DarwinSPL by performing a case study adapted from our industrial partner in the automotive domain.","authors":["Michael Nieke","Gil Engel","Christoph Seidl"],"meta":["February 2017","DOI:10.1145/3023956.3023962","Conference: the Eleventh International Workshop"],"references":["226664976_Automated_Reasoning_on_Feature_Models","221108758_Abstract_Delta_Modeling","216168401_FEATUREHOUSE_Language-independent_automated_software_composition","215588323_Feature-Oriented_Domain_Analysis_FODA_feasibility_study","4376998_Using_Feature_Diagrams_with_Context_Variability_to_Model_Multiple_Product_Lines_for_Software_Supply_Chains","311489734_Guaranteeing_Configuration_Validity_in_Evolving_Software_Product_Lines","311484989_Context_Aware_Reconfiguration_in_Software_Product_Lines","262359176_Software_engineering_Part_II","221223481_Towards_feature-driven_planning_of_product-line_evolution","220693462_Software_Product_Line_Engineering_Foundations_Principles_and_Techniques","215697422_Feature_Models_Grammars_and_Propositional_Formulas","2995854_Programs_life_cycles_and_laws_of_software_evolution"]}