{"id":"312510072_Meet_us_on_the_phone_Mobile_phone_programs_for_adolescent_sexual_and_reproductive_health_in_low-to-middle_income_countries","abstract":"Introduction: \nmHealth as a technical area has seen increasing interest and promise from both developed and developing countries. While published research from higher income countries on mHealth solutions for adolescent sexual and reproductive health (SRH) is growing, there is much less documentation of SRH mHealth interventions for youth living in resource-poor settings. We conducted a global landscape analysis to answer the following research question: How are programs using mHealth interventions to improve adolescent SRH in low to middle income countries (LMICs)?\n\nMethods: \nTo obtain the latest information about mHealth programs targeting youth SRH, a global call for project resources was issued in 2014. Information about approximately 25 projects from LMICs was submitted. These projects were reviewed to confirm that mobile phones were utilized as a key communication media for the program, that youth ages 10-24 were a prime target audience, and that the program used mobile phone features beyond one-on-one phone calls between youth and health professionals.\n\nResults: \nA total of 17 projects met our inclusion criteria. Most of these projects were based in Africa (67%), followed by Eurasia (26%) and Latin America (13%). The majority of projects used mHealth as a health promotion tool (82%) to facilitate knowledge sharing and behavior change to improve youth SRH. Other projects (18%) used mHealth as a way to link users to essential SRH services, including family planning counseling and services, medical abortion and post-abortion care, and HIV care and treatment. There was little variation in delivery methods for SRH content, as two-thirds of the projects (70%) relied on text messaging to transmit SRH information to youth. Several projects have been adapted and scaled to other countries.\n\nDiscussion: \nFindings suggest that mHealth interventions are becoming a more common method to connect youth to SRH information and services in LMICs, and evidence is emerging that mobile phones are an effective way to reach young people and to achieve knowledge and behavior change. More understanding is needed about the challenges of data privacy and phone access, especially among younger adolescents, and the role that mHealth solutions for adolescent SRH should play in health programming for young people.","authors":["Nicole B. Ippoliti","Kelly L L'Engle"],"meta":["January 2017Reproductive Health 14(1)","DOI:10.1186/s12978-016-0276-z"],"references":["306550337_Mobile_Phone_Interventions_for_Adolescent_Sexual_and_Reproductive_Health_A_Systematic_Review","282045601_Youth_Technology_and_HIV_Recent_Advances_and_Future_Directions","280869620_AdolescentYouth_Reproductive_Mobile_Access_and_Delivery_Initiative_for_Love_and_Life_Outcomes_ARMADILLO_Study_formative_protocol_for_mHealth_platform_development_and_piloting","273149863_Mobile_phone_SMS_messages_can_enhance_healthy_behaviour_A_meta-analysis_of_randomised_controlled_trials","265518400_Understanding_the_Role_of_mHealth_and_Other_Media_Interventions_for_Behavior_Change_to_Enhance_Child_Survival_and_Development_in_Low-_and_Middle-Income_Countries_An_Evidence_Review","265390981_Mobile_phones_to_support_adherence_to_antiretroviral_therapy_What_would_it_cost_the_Indian_National_AIDS_Control_Programme","260370384_Systematic_review_on_what_works_what_does_not_work_and_why_of_implementation_of_mobile_health_mHealth_projects_in_Africa","305381755_A_Randomized_Controlled_Trial_of_the_Impact_of_a_Family_Planning_mHealth_Service_on_Knowledge_and_Use_of_Contraception","273784002_Mobile_Text_Messaging_for_Health_A_Systematic_Review_of_Reviews","261840846_Mobile_phone_messages_to_provide_support_to_women_during_the_home_phase_of_medical_abortion_in_South_Africa_A_randomised_controlled_trial"]}