{"id":"312543592_Accounting_for_Life-History_Strategies_and_Timescales_in_Marine_Restoration","abstract":"Understanding the drivers of restoration success is a central issue for marine conservation. Here, we explore the role of life-history strategies of sessile marine species in shaping restoration outcomes and their associated timescales. A transplantation experiment for the extremely slow-growing and threatened octocoral Corallium rubrum was highly successful over a relatively short term due to high survival and reproductive potential of the transplanted colonies. However, demographic projections predict that from 30 to 40 years may be required for fully functional C. rubrum populations to develop. More broadly, a comprehensive meta-analysis revealed a negative correlation between survival after transplanting and growth rates among sessile species. As a result, simulated dynamics for a range of marine sessile invertebrates predict that minimum recovery times are positively associated with survival rates. These results demonstrate a tradeoff between initial transplantation efforts and the speed of recovery. Transplantation of slow-growing species will tend to require lower initial effort due to higher survival after transplanting, but the period required to fully recover habitat complexity will tend be far longer. This study highlights the important role of life history as a driver of marine restoration outcomes and shows how demographic knowledge and modeling tools can help managers to anticipate the dynamics and timescales of restored populations. This article is protected by copyright. All rights reserved","authors":["Ignasi Montero Serra","Joaquim Garrabou","Daniel F. Doak","Laura Figuerola"],"meta":["February 2017Conservation Letters 11(2)","DOI:10.1111/conl.12341"],"references":["304830566_The_cost_and_feasibility_of_marine_coastal_restoration","303531850_The_cost_and_feasibility_of_marine_coastal_restoration","299418947_The_Coral_Trait_Database_a_curated_database_of_trait_information_for_coral_species_from_the_global_oceans","284296751_The_exploitation_and_conservation_of_precious_corals","280931295_Advances_in_restoration_ecology_Rising_to_the_challenges_of_the_coming_decades","279611820_Coral_Reef_Restoration","271593385_Optimal_Conservation_Outcomes_Require_Both_Restoration_and_Protection","268762166_Global_disparity_in_the_ecological_benefits_of_reducing_carbon_emissions_for_coral_reefs","334134232_The_Exploitation_and_Conservation_of_Precious_Corals","312262505_Integral_Projection_Models_for_Species_with_Complex_Demography"]}