{"id":"312563970_Sindrome_de_burnout_en_aspirantes_a_la_carrera_de_medicina","abstract":"Resumen\n\nIntroducción\nEl síndrome de burnout estudiantil es un fenómeno psicosocial producto de la exposición crónica a estresores propios del proceso formativo y en los aspirantes a la carrera de medicina confluyen factores desencadenantes como la exigencia académica y la competencia por ser seleccionado.\n\nObjetivo\nDeterminar la presencia de burnout en aspirantes a la carrera de médico cirujano de una facultad de medicina particular de la ciudad de México.\n\nMétodo\nEstudio prospectivo, transversal y analítico, realizado en 344 estudiantes de los grupo I y grupo II de los cursos propedéuticos de 2014. El instrumento utilizado fue la Escala Unidimensional de Burnout Estudiantil y una encuesta sociodemográfica. El grado de burnout se determinó según el baremo propuesto por Barraza. Los datos fueron analizados con el paquete estadístico SPSS Statistics 23.\n\nResultados\nSe detectó la presencia de burnout leve en ambos grupos de aspirantes. Los estudiantes del grupo GII presentaron mayor nivel de burnout. Este grupo se caracterizó por una mayor matrícula y menor edad. No hubo correlación entre burnout y el sexo, así como con el tiempo de traslado.\n\nConclusiones\nEl estudio muestra la presencia de un nivel leve del síndrome de burnout en aspirantes a la carrera de medicina. El incremento en la matrícula y, por lo tanto, del grado de competencia por ingresar en la carrera puede ser un factor que favorezca el desarrollo de burnout.","authors":["Alejandro Domínguez","María Velasco Jiménez","María Meneses","Gilberto Guzman Valdivia Gomez"],"meta":["January 2017Investigación en Educación Médica 6(24)","DOI:10.1016/j.riem.2016.11.007"],"references":["307810633_Resilience_and_disaster_risk_reduction_an_etymological_journey","304362814_The_Dark_Side_of_Resilience_and_Burnout_A_Moderation-Mediation_Model","297629590_Burnout_en_medicos_internos_de_pregrado_del_Hospital_General_de_Mexico_Dr_Eduardo_Liceaga","271138145_Burnout_en_estudiantes_de_pregrado_de_medicina_y_su_relacion_con_variables_de_personalidad","265471677_Sindrome_de_burnout_en_poblacion_mexicana_Una_revision_sistematica","297305809_Burnout_in_undergraduate_medical_students_and_its_relationship_with_personality_variables","296686899_Burnout_and_Alcohol_AbuseDependence_Among_US_Medical_Students","280794524_Staff_burnout_syndrome_in_alternative_institutions","266231718_Sindrome_de_Burnout_en_estudiantes_de_pregrado_de_la_Universidad_de_Narino","262743610_Estudio_unidimensional_del_sindrome_de_burnout_en_estudiantes_de_medicina_de_Holguin"]}