{"id":"312545479_The_Impact_of_Using_Edmodo_on_Saudi_University_EFL_Students'_Motivation_and_Teacher-Student_Communication","abstract":"Edmodo is a free educational networking site that provides a secure online learning platformfor both teachers and students. The current research explored the impact that Edmodo has onstudents' engagement in EFL learning as well as their motivation towards learning thatlanguage. The research was conducted on 255 female students at Princess Nourah bintAbdulrahman University, Saudi Arabia. The participants were involved in daily interactionswith their peers as well as their teachers via Edmodo features and applications, e.g. posingquestions, submitting assignments, discussions, and teachers' feedback. The present paperposed two research questions: 1. What is the impact of the educational networking siteEdmodo on students' motivation? 2. What is the impact of the educational networking siteEdmodo on teacher-student's communication? In order to explore the possible answers, a40-item questionnaire was administered to the participants. The first 21 items weredesignated to explore students' motivation for learning EFL through Edmodo, while theremaining items explored students' beliefs about the impact that Edmodo has on theircommunication with their teachers. All items were answered using a 4-point Likertscale ranging from strongly agree to strongly disagree. The results indicated statisticallysignificant motivation towards language learning due to the use of Edmodo. It also showedthat the teacher-student's interaction is highly significant via Edmodo. Furthermore, studentsmainly preferred quizzes and assignments on Edmodo when they are designed effectively. Theresults of this study may encourage teachers to integrate educational networks to create effective online learning classes for their students.","authors":["Shatha Turki Alshawi","Faisal Abdullah Alhomoud"],"meta":["December 2016International Journal of Education 8(4):105","DOI:10.5296/ije.v8i4.10501"],"references":["318792893_Online_Social_Networking_as_a_Tool_to_Enhance_Learning_in_the_Mauritian_Education_System","267935416_The_Use_of_Alternative_Social_Networking_Sites_in_Higher_Educational_Settings_A_Case_Study_of_the_E-Learning_Benefits_of_Ning_in_Education","259823204_Social_Network_Sites_Definition_History_and_Scholarship","239611005_Helping_to_Make_Online_Learning_Less_Isolating","224148680_LMS_and_Web_20_tools_for_e-learning_University_of_Deustos_experience_taking_advantage_of_both","222551735_Facebook_R_and_academic_performance","221144106_Information_revelation_and_internet_privacy_concerns_on_social_network_sites_A_case_study_of_facebook","220438020_Social_Network_Sites_Definition_History_and_Scholarship","47343225_Facilitating_new_forms_of_discourse_for_learning_and_teaching_Harnessing_the_power_of_Web_20_practices","304346109_The_use_of_social_networking_in_education_Challenges_and_opportunities","291368414_It_just_keeps_getting_better","268785608_Social_Network_System_in_Classroom_Antecedents_of_EdmodoC_Adoption","267846004_Use_of_Social_Networks_as_an_Education_Tool","233483026_Faceworking_Exploring_Students'_Education-Related_Use_of_Facebook","231958433_Motivation_in_Second_and_Foreign_Language_Learning","225269894_Coefficient_Alpha_and_Internal_Structure_of_Tests","220438166_Old_Communication_New_Literacies_Social_Network_Sites_as_Social_Learning_Resources"]}