{"id":"312514664_Yo_variability_JHipster_a_playground_for_web-apps_analyses","abstract":"Though variability is everywhere, there has always been a shortage of publicly available cases for assessing variability-aware tools and techniques as well as supports for teaching variability-related concepts. Historical software product lines contains industrial secrets their owners do not want to disclose to a wide audience. The open source community contributed to large-scale cases such as Eclipse, Linux kernels, or web-based plugin systems (Drupal, WordPress). To assess accuracy of sampling and prediction approaches (bugs, performance), a case where all products can be enumerated is desirable. As configuration issues do not lie within only one place but are scattered across technologies and assets, a case exposing such diversity is an additional asset. To this end, we present in this paper our efforts in building an explicit product line on top of JHipster, an industrial open-source Web-app configurator that is both manageable in terms of configurations (≈ 163,000) and diverse in terms of technologies used. We present our efforts in building a variability-aware chain on top of JHipster's configurator and lessons learned using it as a teaching case at the University of Rennes. We also sketch the diversity of analyses that can be performed with our infrastructure as well as early issues found using it. Our long term goal is both to support students and researchers studying variability analysis and JHipster developers in the maintenance and evolution of their tools.","authors":["Axel Halin","Alexandre Nuttinck","Mathieu Acher","Xavier Devroey"],"meta":["February 2017","DOI:10.1145/3023956.3023963","Conference: the Eleventh International Workshop"],"references":["308735712_Multi-Objective_Test_Case_Prioritization_in_Highly_Configurable_Systems_A_Case_Study","303413628_FEVER_extracting_feature-oriented_changes_from_commits","316898349_IncLing_efficient_product-line_testing_using_incremental_pairwise_sampling","310820316_Partially_safe_evolution_of_software_product_lines","309365030_IncLing_efficient_product-line_testing_using_incremental_pairwise_sampling","308831194_Exploiting_the_enumeration_of_all_feature_model_configurations_a_new_perspective_with_distributed_computing","308815630_A_mathematical_model_of_performance-relevant_feature_interactions","304286494_Cost-Efficient_Sampling_for_Performance_Prediction_of_Configurable_Systems_T","303515314_A_complexity_tale_web_configurators","299911798_Delta-oriented_test_case_prioritization_for_integration_testing_of_software_product_lines"]}