{"id":"312517329_Deep_Learning_with_Dynamic_Spiking_Neurons_and_Fixed_Feedback_Weights","abstract":"Recent work in computer science has shown the power of deep learning driven by the backpropagation algorithm in networks of artificial neurons. But real neurons in the brain are different from most of these artificial ones in at least three crucial ways: they emit spikes rather than graded outputs, their inputs and outputs are related dynamically rather than by piecewise-smooth functions, and they have no known way to coordinate arrays of synapses in separate forward and feedback pathways so that they change simultaneously and identically, as they do in backpropagation. Given these differences, it is unlikely that current deep learning algorithms can operate in the brain, but we that show these problems can be solved by two simple devices: learning rules can approximate dynamic input-output relations with piecewise-smooth functions, and a variation on the feedback alignment algorithm can train deep networks without having to coordinate forward and feedback synapses. Our results also show that deep spiking networks learn much better if each neuron computes an intracellular teaching signal that reflects that cell's nonlinearity. With this mechanism, networks of spiking neurons show useful learning in synapses at least nine layers upstream from the output cells and perform well compared to other spiking networks in the literature on the MNIST digit recognition task.","authors":["Arash Samadi","Timothy P. Lillicrap","Douglas B Tweed"],"meta":["January 2017Neural Computation 29(10):1-25","DOI:10.1162/NECO_a_00929"],"references":["307795262_Unsupervised_Learning_of_Digit_Recognition_Using_Spike-Timing-Dependent_Plasticity","283446898_Fast-Classifying_High-Accuracy_Spiking_Deep_Networks_Through_Weight_and_Threshold_Balancing","350686737_Introduction_to_Neural_and_Cognitive_Modeling","350441996_Kernel_Adaptive_Filtering","330236262_Introduction_to_Neural_and_Cognitive_Modeling_3rd_Edition","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","289733708_Do_deep_nets_really_need_to_be_deep","286794765_Dropout_A_Simple_Way_to_Prevent_Neural_Networks_from_Overfitting","285367499_Kernel_Adaptive_Filtering_A_Comprehensive_Introduction","280707014_Unsupervised_learning_of_digit_recognition_using_spike-timing-dependent_plasticity"]}