{"id":"312516164_Web_Search_Query_Privacy_an_End-User_Perspective","abstract":"While search engines have become vital tools for searching information on the Internet, privacy issues remain a growing concern due to the technological abilities of search engines to retain user search logs. Although such capabilities might provide enhanced personalized search results, the confidentiality of user intent remains uncertain. Even with web search query obfuscation techniques, another challenge remains, namely, reusing the same obfuscation methods is problematic, given that search engines have enormous computation\nand storage resources for query disambiguation. A number of web search query privacy procedures involve the cooperation of the search engine, a nontrusted entity in such cases, making query obfuscation even more challenging. In this study, we provide a review on how search engines work in regards to web search queries and user intent. Secondly, this study reviews material in a manner accessible to those outside computer science with the intent to introduce knowledge of web search engines to enable non-computer scientists to approach web search query privacy innovatively. As a contribution, we identify and highlight areas open for further investigative and innovative research in regards to end-user personalized web search privacy—that is methods that can be executed on the user side without third party involvement such as, search engines. The goal is to motivate future web search obfuscation heuristics that give users control over their personal search privacy.","authors":["Kato Mivule"],"meta":["January 2017Journal of Information Security 08(01):56-74","DOI:10.4236/jis.2017.81005","Project: Permutation of Web Search Queries For Privacy"],"references":["297612406_On_the_Effectiveness_of_Obfuscation_Techniques_in_Online_Social_Networks","265284219_Using_Web_Snippets_and_Web_Query-logs_to_Measure_Implicit_Temporal_Intents_in_Queries","329736485_Information_discovery_on_electronic_health_records","313694289_Focused_Crawling_A_New_Approach_to_Topic-Specific_Web_Resource_Discovery","310997310_Query_Ambiguity_Identification_Based_on_User_Behavior_Information","301222514_Modern_Information_Retrieval","287100910_Private_Browsing_an_Inquiry_on_Usability_and_Privacy_Protection","282466563_Information_Retrieval_with_Verbose_Queries","273490702_Web_Query_Reformulation_via_Joint_Modeling_of_Latent_Topic_Dependency_and_Term_Context","265660320_A_Face_is_exposed_for_AOL_searcher_no_4417749"]}