{"id":"312655442_Bayesian_microsaccade_detection","abstract":"Microsaccades are high-velocity fixational eye movements, with special roles in perception and cognition. The default microsaccade detection method is to determine when the smoothed eye velocity exceeds a threshold. We have developed a new method, Bayesian microsaccade detection (BMD), which performs inference based on a simple statistical model of eye positions. In this model, a hidden state variable changes between drift and microsaccade states at random times. The eye position is a biased random walk with different velocity distributions for each state. BMD generates samples from the posterior probability distribution over the eye state time series given the eye position time series. Applied to simulated data, BMD recovers the “true” microsaccades with fewer errors than alternative algorithms, especially at high noise. Applied to EyeLink eye tracker data, BMD detects almost all the microsaccades detected by the default method, but also apparent microsaccades embedded in high noise—although these can also be interpreted as false positives. Next we apply the algorithms to data collected with a Dual Purkinje Image eye tracker, whose higher precision justifies defining the inferred microsaccades as ground truth. When we add artificial measurement noise, the inferences of all algorithms degrade; however, at noise levels comparable to EyeLink data, BMD recovers the “true” microsaccades with 54% fewer errors than the default algorithm. Though unsuitable for online detection, BMD has other advantages: It returns probabilities rather than binary judgments, and it can be straightforwardly adapted as the generative model is refined. We make our algorithm available as a software package.","authors":["Andra Mihali","Bas van Opheusden","Wei Ji Ma"],"meta":["January 2017Journal of Vision 17(1):13","DOI:10.1167/17.1.13"],"references":["287404783_Head-Eye_Coordination_at_a_Microscopic_Scale","272512376_A_Compact_Field_Guide_to_the_Study_of_Microsaccades_Challenges_and_Functions","316126590_Microsaccade_orientation_supports_attentional_enhancement_opposite_to_a_peripheral_cue","308873844_Bayesian_identification_of_fixations_saccades_and_smooth_pursuits","304146457_What's_new_in_Psychtoolbox-3","303017137_An_Introduction_to_the_Kalman_Filter","281891003_Dummy_eye_measurements_of_microsaccades_Testing_the_influence_of_system_noise_and_head_movements_on_microsaccade_detection_in_a_popular_video-based_eye_tracker","280940018_Pattern_Recognition_and_Machine_Learning","269283553_Why_have_microsaccades_become_larger_Investigating_eye_deformations_and_detection_algorithms","266831895_Handbook_of_mathematical_functions_with_formulas_graphs_and_mathematical_tables_Translated_from_the_English_by_V_A_Ditkin_and_L_N_Karmazinaya"]}