{"id":"312627166_Comparative_Analysis_of_Three_Classification_Algorithms_in_Predicting_Computer_Science_Students_Study_Duration","abstract":"This paper aims to present a predictive model for computer science students' study duration at Faculty of Computer Science Universitas Klabat. The predictive model was developed based on students' performance (grades) in the first two semesters. Classification techniques from Data mining were applied to develop the models: Naïve Bayes, decision tree and Support Vector Machine. Comparative analysis is conducted on the three selected algorithms to find the best classification model. Moreover, this research also aims to find out the most influential subjects' grades on study duration. Courses, gender, and grades (general, basic, and major grades) serve as the independent parameters that would predict the dependent parameter i.e. study duration, which comprises of three categories: Less, Equal, and Greater. The resulting models of the three algorithms show no significant difference between Naïve Bayes and decision tree performances, while SVM has the lowest performance. Basic subjects grades found to be the most influence parameter to the students' study duration, followed by general subjects' grades, gender, and major subjects' grades parameters.","authors":["Debby Sondakh","Stenly Richard Pungus"],"meta":["January 2017"],"references":["354451374_Educational_Data_Mining_Predicting_student's_performance_using_clustering","306106744_A_Data_Mining_System_for_Predicting_University_Students'_Graduation_Grades_Using_ID3_Decision_Tree_Algorithm","272368108_Data_Mining_in_Higher_Education_University_Student_Dropout_Case_Study","269475545_Predicting_Student_Performance_by_Using_Data_Mining_Methods_for_Classification","224952248_Machine_Learning_in_Automated_Text_Categorization","220708516_Use_Data_Mining_to_Improve_Student_Retention_in_Higher_Education_-_A_Case_Study","51989865_Mining_Educational_Data_to_Analyze_Students'_Performance","325881707_Predicting_student_performance_using_data_mining_techniques","303206384_Data_Mining_Concepts_and_Techniques","290586097_Algorithms_for_text_categorization_A_comparative_study"]}