{"id":"312619755_Ujian_Online_Mahasiswa_Ilmu_Komputer_Berbasis_Smartphone","abstract":"Information technology influence higher education in various aspects, including education sector. This article discusses how smartphones facilitate online examination in computer science and information systems students. The research objective to be achieved by the researchers through the research, are as follows: 1) Utilizing smartphone as a media test online exam, 2) How to make use of social technologies in online test, and 3) Identify the features or facilities that could be used for the implementation of an online exam. Observations was conducted with 87 early year students as respondents. Author develop the online questions by using google forms, and facebook to disseminate online examination questions. Research findings show that Android are dominantly gadgets used by students for their online examination. Smartphone based online exam help students concentration in online exam. Social information technology like facebook and google forms have rich features in supporting online examination for computer science students. The use of smartphones, google forms, and facebook can create an atmosphere of exams modern, efficient, and environmentally friendly.","authors":["Leon Abdillah"],"meta":["December 2016","Project: IT-based Higher Education Environment"],"references":["283161903_How_Do_Students_Use_Their_Mobile_Devices_to_Support_Learning_A_Case_Study_from_an_Australian_Regional_University","274085628_Mobile_learning_anytime_anywhere_What_are_our_students_doing","271704336_Device_Analyzer_Understanding_Smartphone_Usage","266319669_Indonesian's_presidential_social_media_campaigns","263163628_Social_media_as_political_party_campaign_in_Indonesia","260269150_Managing_information_and_knowledge_sharing_cultures_in_higher_educations_institutions","259288207_The_utilization_of_social_networking_as_promotion_media_Case_study_Handicraft_business_in_Palembang","257692884_Blending_Synchronous_Face-to-face_and_Computer-Supported_Cooperative_Learning_in_a_Hybrid_Doctoral_Seminar","236672940_Students_learning_center_strategy_based_on_e-learning_and_blogs","259143623_Mobile_Computing_Devices_in_Higher_Education_Student_Perspectives_on_Learning_with_Cellphones_Smartphones_Social_Media"]}