{"id":"312671713_Learner_modeling_for_adaptive_scaffolding_in_a_Computational_Thinking-based_science_learning_environment","abstract":"Learner modeling has been used in computer-based learning environments to model learners’ domain knowledge, cognitive skills, and interests, and customize their experiences in the environment based on this information. In this paper, we develop a learner modeling and adaptive scaffolding framework for Computational Thinking using Simulation and Modeling (CTSiM)—an open ended learning environment that supports synergistic learning of science and Computational Thinking (CT) for middle school students. In CTSiM, students have the freedom to choose and coordinate use of the different tools provided in the environment, as they build and test their models. However, the open-ended nature of the environment makes it hard to interpret the intent of students’ actions, and to provide useful feedback and hints that improves student understanding and helps them achieve their learning goals. To address this challenge, we define an extended learner modeling scheme that uses (1) a hierarchical task model for the CTSiM environment, (2) a set of strategies that support effective learning and model building, and (3) effectiveness and coherence measures that help us evaluate student’s proficiency in the different tasks and strategies. We use this scheme to dynamically scaffold learners when they are deficient in performing their tasks, or they demonstrate suboptimal use of strategies. We demonstrate the effectiveness of our approach in a classroom study where one group of 6th grade students received scaffolding and the other did not. We found that students who received scaffolding built more accurate models, used modeling strategies effectively, adopted more useful modeling behaviors, showed a better understanding of important science and CT concepts, and transferred their modeling skills better to new scenarios.","authors":["Satabdi Basu","Gautam Biswas","John Siler Kinnebrew"],"meta":["March 2017User Modeling and User-Adapted Interaction 26(1)","DOI:10.1007/s11257-017-9187-0"],"references":["311986834_Enhancing_learning_outcomes_through_self-regulated_learning_support_with_an_Open_Learner_Model","310764759_Elo-based_learner_modeling_for_the_adaptive_practice_of_facts","303463820_Identifying_middle_school_students'_challenges_in_computational_thinking-based_science_learning","297700831_Using_Multiple_Representations_to_simultaneously_learn_Computational_Thinking_and_Middle_School_Science","329957109_Measuring_What_Matters_Most_Choice-Based_Assessments_for_the_Digital_Age","313572819_Some_Principles_of_Intelligent_Tutoring","313067667_Can_help_seeking_be_tutored_Searching_for_the_secret_sauce_of_metacognitive_tutoring","311870284_Repair_Theory_A_Generative_Theory_of_Bugs_in_Procedural_Skills","289060915_Investigating_student_generated_computational_models_of_science","288873858_Integrating_Model-Driven_and_Data-Driven_Techniques_for_Analyzing_Learning_Behaviors_in_Open-Ended_Learning_Environments"]}