{"id":"312677042_Context_Aware_and_Adaptive_Systems","abstract":"Context aware software systems and adaptive software systems sense changes in their environments, and respond by changing their behaviour and/or structure appropriately. The perspective of these two approaches, however, tends to differ. Context aware systems focus on modelling and reasoning about the relevant environmental context often with aid of formal ontologies. The system, however, can only respond to an anticipated change of configuration setting or a change of application mode. Adaptive systems in contrast focus on how the system responds to an unanticipated environmental change. However, adaptive systems typically lack sophisticated models of context. This chapter analyses the differences and similarities between context-aware and adaptive systems. It then describes an approach and framework called ROAD that supports the development of context-aware applications whose structure and behavior can be altered at runtime. ROAD provides mechanisms to acquire and record context information and provision a central store of ‘facts’ which are evaluated in rules. These rules mediate operational messages or trigger adaptations to the structure of the application.","authors":["Alan W. Colman","Mahmoud Hussein","Jun Han","Malinda Kapuruge"],"meta":["December 2014","DOI:10.1007/978-1-4939-1887-4_5","In book: Context in Computing (pp.63-82)"],"references":["262240202_SCIMS_A_Social_Context_Information_Management_System_for_Socially-Aware_Applications","261481919_Enabling_Runtime_Evolution_of_Context-Aware_Adaptive_Services","257200732_A_Context-Aware_Access_Control_Framework_for_Software_Services","254040600_A_systematic_survey_on_the_design_of_self-adaptive_software_systems_using_control_engineering_approaches","248248784_Use_of_Ontologies_in_Pervasive_Computing_Environments","289206086_Service_Orchestration_as_Organization_Building_Multi-Tenant_Service_Applications_in_the_Cloud","277514137_Self-adaptive_software","262396607_Enabling_Ad-hoc_Business_Process_Adaptations_through_Event-Driven_Task_Decoupling","262316986_ROAD4SaaS_scalable_business_service-based_saas_applications","261059269_Sharing_with_a_Difference_Realizing_Service-Based_SaaS_Applications_with_Runtime_Sharing_and_Variation_in_Dynamic_Software_Product_Lines"]}