{"id":"312630705_Blurring_time_and_place_in_higher_education_with_bring_your_own_device_applications_a_literature_review","abstract":"The use of mobile devices is increasing rapidly in society, and student device ownership is becoming more or less ubiquitous in many parts of the world. This might be an under-utilised resource that could benefit the educational practices of institutions of higher education. This review examines 91 journal articles from 28 countries published in the years of 2009–2015 with regards to the applications of Bring Your Own Device (BYOD) in higher education to take inventory of how it is applied where blurring of boundaries of time and place can be observed, and to observe problems or obstacles regarding these applications. Research interests do not seem to shift, as much as they are becoming more diverse. The five applications that were identified in 2009 were in discussion during all of the examined years, whereas the total number of applications in discussion increased to 12 in 2015. A methodological concern with regard to trend analysis is that more than half of the articles lack a stated year of data collection. As this can differ greatly from the year of publication, any trend analysis will be burdened with uncertainty. That said, a pattern that emerges is a shift away from distribution of content towards social networking applications. Much less focus has been placed on obstacles and problems in later years, but some areas that have been addressed are usability problems due to small screens and keyboards, with costs of devices and data plans making ownership unfeasible for certain activity types or groups of students.","authors":["Marcus Sundgren"],"meta":["November 2017Education and Information Technologies 22(6)","DOI:10.1007/s10639-017-9576-3","Project: Licentiate thesis"],"references":["297731085_Breaking_the_boundaries_of_space_and_time_A_review_of_applications_of_bring-your-own-device_in_higher_education","286153360_Mobile_learning_Structures_agency_practices","285910804_Incorporating_microblogging_tweeting_in_higher_education_Lessons_learnt_in_a_knowledge_management_course","285752667_Converged_social_media_Identity_management_and_engagement_on_Facebook_Mobile_and_blogs","284717218_Exploring_Opportunistic_Use_of_Mobile_Devices_for_Studying_in_Higher_Education","318585593_E-learning_in_the_21st_century_A_community_of_inquiry_framework_for_research_and_practice_third_edition","313134968_What_is_mobile_learning","299196893_Mobile_Learning_The_Next_Generation","291388610_Pocket_learning_A_new_mobile_learning_approach_for_distance_learners","285748254_Using_podcasting_to_facilitate_student_learning_A_constructivist_perspective"]}