{"id":"312633891_Foundations_of_JSON_Schema","abstract":"JSON -- the most popular data format for sending API requests and responses -- is still lacking a standardized schema or meta-data definition that allows the developers to specify the structure of JSON documents. JSON Schema is an attempt to provide a general purpose schema language for JSON, but it is still work in progress, and the formal specification has not yet been agreed upon. Why this could be a problem becomes evident when examining the behaviour of numerous tools for validating JSON documents against this initial schema proposal: although they agree on most general cases, when presented with the greyer areas of the specification they tend to differ significantly. In this paper we provide the first formal definition of syntax and semantics for JSON Schema and use it to show that implementing this layer on top of JSON is feasible in practice. This is done both by analysing the theoretical aspects of the validation problem and by showing how to set up and validate a JSON Schema for Wikidata, the central storage for Wikimedia.","authors":["Felipe Pezoa","Juan L. Reutter","Fernando Suarez","Martin Ugarte"],"meta":["April 2016","DOI:10.1145/2872427.2883029","Conference: the 25th International Conference"],"references":["234790000_Expressiveness_and_complexity_of_XML_Schema","220346825_Logics_for_Unranked_Trees_An_Overview","321518398_Elements_of_Finite_Model_Theory","307174777_Tree_Automata_Techniques_and_Applications","280081029_Wikidata_A_Free_Collaborative_Knowledgebase","259671337_JSON-LD_10_-_A_JSON-based_Serialization_for_Linked_Data","247442902_Introduction_To_Algorithms","234805553_The_monotone_and_planar_circuit_value_problems_are_log_space_complete_for_P","222447584_The_monadic_second-order_logic_of_graphs_I_Recognizable_sets_of_finite_graphs","220692549_Introduction_to_Algorithms_3_ed","220689604_Introduction_to_automata_theory_languages_and_computation_-_international_edition_2_ed","200034262_Introduction_to_Automata_Theory_Languages_and_Computation"]}