{"id":"312721287_Scientific_Lenses_to_Support_Multiple_Views_over_Linked_Chemistry_Data","abstract":"When are two entries about a small molecule in different datasets the same? If they have the same drug name, chemical structure, or some other criteria? The choice depends upon the application to which the data will be put. However, existing Linked Data approaches provide a single global view over the data with no way of varying the notion of equivalence to be applied.\nIn this paper, we present an approach to enable applications to choose the equivalence criteria to apply between datasets. Thus, supporting multiple dynamic views over the Linked Data. For chemical data, we show that multiple sets of links can be automatically generated according to different equivalence criteria and published with semantic descriptions capturing their context and interpretation. This approach has been applied within a large scale public-private data integration platform for drug discovery. To cater for different use cases, the platform allows the application of different lenses which vary the equivalence rules to be applied based on the context and interpretation of the links.","authors":["Colin Batchelor","Christian Y. A. Brenninkmeijer","Christine Chichester","Mark Davies"],"meta":["October 2014","DOI:10.1007/978-3-319-11964-9_7","Conference: International Semantic Web Conference","Project: Open PHACTS"],"references":["278797702_Results_of_the_Ontology_Alignment_Evaluation_Initiative_2013","261755538_On_InChI_and_evaluating_the_quality_of_cross-reference_links","326333171_Api-Centric_Linked_Data_Integration_The_Open_Phacts_Discovery_Platform_Case_Study","319395258_Describing_Linked_Datasets_with_the_VoID_Vocabulary","290222934_Including_co-referent_URIs_in_a_SPARQL_query","287712513_The_IUPAC_international_chemical_identifier_InChI","285182343_The_Future_of_Data_Integration","278001681_Describing_Linked_Datasets","261440552_API-centric_Linked_data_integration_The_open_PHACTS_discovery_platform_case_study","260324688_Ontology_Matching_State_of_the_Art_and_Future_Challenges"]}