{"id":"312702768_Meta-Evolution_Style_for_Software_Architecture_Evolution","abstract":"Changes over time are commonplace and inevitable for any software system if it is to remain effective. Since the system changes fairly frequently, it is essential that its architecture is restructured to keep abreast of these changes. Recently the term ’evolution style’ has emerged in some studies as a technique for modeling potential architecture evolution scenarios in a particular domain that can provide reusable knowledge that encapsulates the best practices in this domain. Analysis and comparison of these alternatives assists architects in planning and thinking about architecture evolution. Our approach endeavors to unify the solutions and standardize the modeling concepts in order to develop evolution styles library that exploits the best methods and elements in the existing approaches. To this end, the main contribution of this paper is a Meta-Evolution Style (MES) for software architecture evolution, which promotes mapping and comparing of evolution styles, as well as it will help in approaching issues like reuse and interchange elements among evolution styles.","authors":["Adel Hassan","Mourad Oussalah"],"meta":["January 2016","DOI:10.1007/978-3-662-49192-8_39","Conference: International Conference on Current Trends in Theory and Practice of Informatics"],"references":["260342580_Classification_and_comparison_of_architecture_evolution_reuse_knowledge_-_A_systematic_review","234824865_Metamodeling_for_Method_Engineering","233810960_Evolution_styles_Using_architectural_knowledge_as_an_evolution_driver","221553843_Evolution_styles_to_the_rescue_of_architectural_evolution_knowledge","29608882_Software_Architecture_Evolution","309201748_Evolution_styles_to_the_rescue_of_architectural_evolution_knowledge","290934092_Software_Architecture_2","278815405_SAEVa_Model_to_Face_Evolution_Problem_in_Software_Architecture","277698118_Software_Architecture_2","228954067_Evolution_Styles_foundations_and_models_for_software_architecture_evolution","225106306_Laws_of_software_evolution_revisited","42804514_Managing_Software_Architectural_Evolution_at_Multiple_Levels_of_Abstraction"]}