{"id":"312719122_Unconditionally_Secure_Quantum_Bit_Commitment_Protocol_Based_on_Incomplete_Information","abstract":"This paper is reversing the current belief on Quantum Bit Commitment. Several papers have claimed and given a formal proof that quantum bit commitment is impossible. Nevertheless, the hypotheses of the formal mathematical model are too restrictive and do not exhaustively reflect the original definition of the problem. They share the same unnecessary restriction that the responsibility of hiding information and committing to a bit value is attributed to the same communicating partner. The protocol described here fully abides to the original description of the bit commitment problem.The two communicating partners share responsibilities, one partner is mostly responsible for hiding information and the other one for committing to the bit value. The security of the protocol derives from quantum properties such as the unclonability of unknown states, the indistinguishability of non-orthogonal states and also from randomly discarding and permuting qubits. The protocol is safe from classical attacks and quantum attacks using entanglement. The level of security can be made arbitrarily large by using more qubits. This result opens the door for a whole set of cryptographic applications using bit commitment as a building block: remote coin tossing, zero-knowledge proofs and secure two-party computation.","authors":["Naya Nagy","Marius Nagy"],"meta":["December 2014","DOI:10.1007/978-3-319-13749-0_12","Conference: International Conference on Theory and Practice of Natural Computing"],"references":["240029764_What_is_going_on_with_Quantum_Bit_Commitment","239939662_Experimental_Bit_Commitment_Based_on_Quantum_Communication_and_Special_Relativity","233999839_Experimental_implementation_of_bit_commitment_in_the_noisy-storage_model","228109483_WITHDRAWN_Quantum_cryptography_Public_key_distribution_and_coin_tossing","221499660_A_Quantum_Bit_Commitment_Scheme_Provably_Unbreakable_by_both_Parties","221355058_Quantum_Bit_Commitment_and_Coin_Tossing_Protocols","221348646_Quantum_Oblivious_Mutual_Identification","220556114_25_years_of_quantum_cryptography","3593544_A_quantum_bit_commitment_scheme_provably_unbreakable_by_bothparties","2620245_Is_Quantum_Bit_Commitment_Really_Possible","2201608_Unconditionally_Secure_Quantum_Bit_Commitment_is_Impossible","2202534_Permanently_Secure_Quantum_Bit_Commitment_from_a_Temporary_Computation_Bound"]}