{"id":"312892538_Estudio_Exploratorio_sobre_la_Formacion_Investigativa_de_los_Estudiantes_de_Licenciatura_en_Ciencia_de_la_Computacion","abstract":"de Cuba, Cuba. CP 90900 RESUMEN El artículo analiza los resultados obtenidos en un estudio diagnóstico sobre la formación investigativa de los estudiantes de la carrera de Licenciatura en Ciencia de la Computación, de la Universidad de Oriente. La investigación, de carácter exploratorio, utilizó métodos cuantitativos y cualitativos para determinar las principales dificultades relacionadas con el comportamiento de dicha formación. Los resultados indican que existen insuficiencias que tienen su base en la forma deficiente en que se desarrolla la dinámica del proceso formativo en asignaturas de la carrera, revelando oportunidades para una intervención pedagógica en dicha dinámica. PALABRAS CLAVE: diagnóstico, ciencia de la computación, formación investigativa. ABSTRACT The article analyzes the results obtained in a diagnosis study on the investigative formation of the students of the career of Licentiate in Computation Science, in Oriente University. The investigation, of exploratory character, combines quantitative and qualitative methods, to determine the main difficulties related with the behavior of this formation. The obtained results indicate that there are inadequacies based in the faulty form in that the dynamics of the formative process is developed in subjects of the career, that facilitate opportunities for a pedagogic intervention in this dynamics. KEY WORDS: diagnosis, computation science, investigative formation. INTRODUCCIÓN Las nuevas condiciones tecnológicas de la «sociedad informacional» imprimen una nueva dinámica a la organización social, la que se inspira en la transformación de la información en conocimiento y de este último en innovación, como condición indispensable para transformar la realidad. Bajo estas condiciones cobra especial relevancia la Ciencia de la Computación, que abarca el estudio de las bases teóricas de la información y la computación, encaminada a la solución de disímiles problemas informativo-computacionales que emergen del quehacer social, científico y técnico. Esta ciencia permite automatizar sistemas en todas las esferas de actuación de la sociedad e intervenir de manera activa y pro-activa en importantes sistemas computacionales (Lissabet, 2011). A nivel internacional la Ciencia de la Computación se reconoce como una ciencia independiente, en pleno desarrollo y con áreas de problemas propios, la que tiene un amplio rango de aplicabilidad a la solución de problemas de carácter complejo e interdisciplinario en diversos dominios de actuación (Denning, 2000; Baeza, 2001; Arana, 2005). La relevancia actual de esta ciencia ha llevado a que exista la necesidad de formar en la misma profesionales competentes, surgiendo así la carrera de Ciencia de la Computación en numerosos países, con la aspiración de que estos profesionales sean capaces de resolver problemas «informativo-computacionales» que surgen","authors":["Ekaterine M Fergusson Ramirez","Alonso Berenguer Isabel","Alexander Gorina Sánchez"],"meta":["January 2014","Project: Formación investigativa en carreras de las ciencias computacionales"],"references":["312894290_UN_SISTEMA_DE_PROCEDIMIENTOS_METODOLOGICOS_PARA_PERFECCIONAR_EL_PROCESAMIENTO_DE_LA_INFORMACION_EN_LAS_INVESTIGACIONES_SOCIALES_A_SYSTEM_OF_METHODOLOGICAL_PROCEDURES_TO_IMPROVE_THE_PROCESSING_OF_INFOR","312894166_MODELO_DE_LA_DINAMICA_FORMATIVA_DEL_PROCESAMIENTO_DE_LA_INFORMACION_EN_LAS_INVESTIGACIONES_SOCIALES_MODEL_OF_THE_FORMATIVE_DYNAMIC_OF_THE_INFORMATION_PROCESSING_IN_SOCIAL_RESEARCHES","311426090_DINAMICA_DEL_PROCESAMIENTO_DE_LA_INFORMACION_EN_LAS_INVESTIGACIONES_SOCIALES","262442184_La_investigacion_formativa_y_la_formacion_para_la_investigacion_en_el_pregrado","242091484_Disenemos_Todo_de_Nuevo_Reflexiones_sobre_la_Computacion_y_su_Ensenanza","28224830_Determinacion_de_la_maxima_varianza_para_el_calculo_del_factor_de_imprecision_sobre_la_escala_de_medida_y_extension_a_direntes_tipos_de_muestreo","26476106_La_educacion_cientifico-tecnologica_desde_los_estudios_de_la_ciencia_tecnologia_sociedad_e_innovacion","227431202_LA_CULTURA_INFORMATICA_DEL_PROFESOR_DE_COMPUTACION_EN_CUBA"]}