{"id":"312872355_Conceptualizing_Big_Social_Data","abstract":"The popularity of social media and computer-mediated communication has resulted in high-volume and highly semantic data about digital social interactions. This constantly accumulating data has been termed as Big Social Data or Social Big Data, and various visions about how to utilize that have been presented. However, as relatively new concepts, there are no solid and commonly agreed definitions of them. We argue that the emerging research field around these concepts would benefit from understanding about the very substance of the concept and the different viewpoints to it. With our review of earlier research, we highlight various perspectives to this multi-disciplinary field and point out conceptual gaps, the diversity of perspectives and lack of consensus in what Big Social Data means. Based on detailed analysis of related work and earlier conceptualizations, we propose a synthesized definition of the term, as well as outline the types of data that Big Social Data covers. With this, we aim to foster future research activities around this intriguing, yet untapped type of Big Data.","authors":["Ekaterina Olshannikova","Thomas Olsson","Jukka Huhtamäki","Hannu Kärkkäinen"],"meta":["January 2017Journal of Big Data 4(1)","DOI:10.1186/s40537-017-0063-x","Project: #weakties"],"references":["334805317_A_Survey_on_Sentiment_Analysis_and_Visualization","348836096_Big_Digital_Humanities_Imagining_a_Meeting_Place_for_the_Humanities_and_the_Digital","327767127_Social_big_data_mining","326070765_Conclusion_Computational_social_science_Toward_a_collaborative_future","325514102_Digital_Citizenship_The_Internet_Society_and_Participation","316799393_Big_Data","315896605_The_esthetics_of_hidden_things","312596137_Big_data_The_next_frontier_for_innovation_competition_and_productivity","311489358_A_Cross-media_Sentiment_Analytics_Platform_For_Microblog","308129085_Politics_of_prediction_Security_and_the_timespace_of_governmentality_in_the_age_of_big_data"]}