{"id":"312808507_Present_Status_and_Challenges_Ahead_for_Engineering_Education_Global_and_National_Perspectives","abstract":"The present status and the challenges and opportunities ahead for engineering education, both at the national level and at the global level, are explored in this paper. There are many distinctive and unique characteristics of the new millennium which place new demands on the engineers we produce. We are living and working in a world that is characterized by volatility, uncertainty, complexity, and ambiguity, requiring innovative strategies for educating our engineers. The emerging accreditation systems and processes and the Washington Accord Graduate Attributes provide guidelines for producing global engineers ensuring global mobility. Nationally, we have several policy pronouncements over the years, which serve as drivers of change. The recent global university rankings have attracted worldwide attention of the academic leaders and other stakeholders and are serving to determine university policies and practices. We have to create research-intensive institutions in our country if we have to figure among the top of these lists. Some of the issues of concern are discussed. Professional ethics and human values are important for engineers in the practice of the profession and need to be inculcated through both curricular and extracurricular means. As for the agenda ahead, the destination is reasonably clear, and there are several national policies and reports which serve as the road map, but several hurdles and challenges have to be overcome in order for us to bridge the gap between the potential we possess and its actual attainment.","authors":["R. Natarajan"],"meta":["September 2015","DOI:10.1007/978-81-322-1931-6_5","In book: Proceedings of the International Conference on Transformations in Engineering Education (pp.29-39)"],"references":["274379817_Rankings_and_the_Reshaping_of_Higher_Education_The_Battle_for_World-Class_Excellence","308851738_The_current_status_of_engineering_education_in_India"]}