{"id":"312892346_Dynamic_Scheduling_of_Flexible_Manufacturing_System_Using_Scatter_Search_Algorithm","abstract":"Flexible manufacturing system (FMS) scheduling is one of the most trusted and complicated task in machine scheduling. It is strongly Non polynomial complete combinatorial problem. FMS is agile and flexible which is well suited for simultaneous production of a wide variety of product mix in low volumes. Meta-heuristic approaches such as genetic algorithm, simulated annealing etc. are widely applied for the static scheduling problems. Now-a-day's manufacturing systems operate in dynamic environments where usually inevitable unpredictable real-time events may cause a change in the planed previously feasible schedule and may turn infeasible when it is released to the shop floor. In this paper, a meta-heuristic approach called Scatter-Search (SS) is applied for scheduling optimization of flexible manufacturing systems by considering the objective, i.e., minimizing the makespan with the machine breakdown. It provides a wide exploration of the search space through intensification and diversification and also with unifying principle for joining solutions and they exploit adaptive memory principle to avoid generating or incorporating duplicate solutions at various stages of the problem. The comparative study of this approach is presented with static scheduling.","authors":["Maalinii Krishnan","Karthikeyan Thangavelu","T R Chinnusamy","A. Murugesan"],"meta":["November 2008"],"references":["257336310_Integrated_scheduling_of_flexible_manufacturing_system_using_evolutionary_algorithms","227270347_Sequencing_and_scheduling_of_job_and_tool_in_a_flexible_manufacturing_system_using_ant_colony_optimization_algorithm","257337045_Scheduling_flexible_job_shop_problem_subject_to_machine_breakdown_with_route_changing_and_right-shift_strategies","238595307_Setup-oriented_dispatching_rules_-_A_survey","226945205_Evaluation_of_scatter-search_approach_for_scheduling_optimization_of_flexible_manufacturing_systems","226395147_Dynamic_scheduling_of_flexible_manufacturing_system_using_heuristic_approach","225781594_Performance_evaluation_of_the_scatter_search_method_for_permutation_flowshop_sequencing_problems"]}