{"id":"312894162_LOGICA_ALGORITMICA_PARA_LA_RESOLUCION_DE_PROBLEMAS_DE_PROGRAMACION_COMPUTACIONAL_UNA_PROPUESTA_DIDACTICA","abstract":"RESUMEN El carácter eminentemente social, cultural y tecnológico del proceso de resolución de problemas de programación computacional, junto a la complejidad y dificultades detectadas en su enseñanza, han contribuido a despertar la preocupación por el estudio de los procesos de comunicación, transmisión y comprensión de la Programación y a interesar a una amplia comunidad científica en correspondencia con el creciente desarrollo que ésta alcanza en la actualidad. Razón por la cual este trabajo tiene como objetivo que se develen, desde el punto de vista didáctico, los ejes integradores de una lógica algorítmica que sea contentiva de la solución a la contradicción que se revela en el proceso formativo entre la modelación matemática y su sistematización algorítmica, para potenciar un desempeño eficiente de los profesionales de la Ciencia de la Computación y de la Ingeniería Informática. En esta dirección se fundamenta una nueva propuesta didáctica consistente en una lógica algorítmica, en la que se precisan y explican aquellos procesos esenciales que deben de llevarse a cabo en la resolución de problemas de programación computacional. Desde la fundamentación teórica realizada, se concluye que estos procesos constituyen momentos didácticos necesarios para resolver coherentemente la contradicción antes señalada. \nPALABRAS CLAVE: Lógica algorítmica, programación computacional, resolución de problemas","authors":["Antonio Salgado Castillo","Alonso Berenguer Isabel","Alexander Gorina Sánchez","Yaritza Tardo Fernández"],"meta":["January 2013","Projects: 10.\t“Didáctica de la conversación en el aula de español como lengua extranjera en la Educación Superior”Perfeccionamiento de la enseñanza-aprendizaje de la algoritmización computacional"],"references":["320386743_La_resolucion_de_problemas_matematicos_Una_alternativa_didactica_centrada_en_la_representacion","268003435_Utilisation_des_NTICs_pour_l'apprentissage_et_l'autoevaluation_de_l'algorithmique","242271658_A_study_of_the_efficiency_of_an_alternative_programming_paradigm_to_teach_the_basics_of_programming","237356535_Utilizacion_de_Mapas_Conceptuales_en_la_ensenanza_de_la_programacion","228518567_Ensenanza_de_la_programacion","26484895_Programming_disciplines_and_methods_adopted_at_Liverpool_Hope_University","267376745_La_solucion_de_problemas","253291973_APLICACION_DE_MAPAS_CONCEPTUALES_HIPERMEDIALES_EN_LA_VISUALIZACION_DE_PROGRAMAS","238067320_Asignaturas_Introductorias_a_la_Programacion_Una_Discusion_acerca_de_sus_Objetivos_y_Contenidos_Programaticos","39147256_Como_plantear_y_resolver_problemas"]}