{"id":"312804051_Soft_Multi-organ_Shape_Models_via_Generalized_PCA_A_General_Framework","abstract":"This paper addresses the efficient statistical modeling of multi-organ structures, one of the most challenging scenarios in the medical imaging field due to the frequently limited availability of data. Unlike typical approaches where organs are considered either as single objects or as part of predefined groups, we introduce a more general and natural approach in which all the organs are inter-related inspired by the rhizome theory. Combining canonical correlation analysis with a generalized version of principal component analysis, we propose a new general and flexible framework for multi-organ shape modeling to efficiently characterize the individual organ variability and the relationships between different organs. This new framework called SOMOS can be easily parameterized to mimic a wide variety of alternative statistical shape modeling approaches, including the classic point distribution model, and its more recent multi-resolution variants. The significant superiority of SOMOS over alternative approaches was successfully verified for two different multi-organ databases: six subcortical structures of the brain, and seven abdominal organs. Finally, the organ-prediction capability of the model also significantly outperformed a partial least squared regression-based approach.","authors":["Juan Cerrolaza","Ronald M Summers","Marius George Linguraru"],"meta":["October 2016Lecture Notes in Computer Science","DOI:10.1007/978-3-319-46726-9_26","Conference: International Conference on Medical Image Computing and Computer-Assisted Intervention"],"references":["237070902_Automated_Abdominal_Multi-Organ_Segmentation_With_Subject-Specific_Atlas_Generation","279736935_Abdominal_multi-organ_segmentation_from_CT_images_using_conditional_shape-location_and_unsupervised_intensity_priors","275059365_Automatic_Multi-Resolution_Shape_Modeling_of_Multi-Organ_Structures","269469651_Theory_and_Applications_of_Correspondence_Analysis","268462724_Active_Shape_Model_Search_Using_Local_Grey-Level_Models_A_Quantitative_Evaluation","257485030_Active_Shape_Models-Their_Training_and_Application","220184620_Multiresolution_Analysis_for_Surfaces_of_Arbitrary_Topological_Type","6149659_Hierarchical_statistical_shape_analysis_and_prediction_of_sub-cortical_brain_structures"]}