{"id":"312869217_Cohort_Query_Processing","abstract":"Modern Internet applications such as websites and mobile games produce a\nlarge amount of activity data representing information associated with user\nactions such as login or online purchases. Cohort analysis, originated from\nSocial Science, is a powerful data exploration technique for ?finding unusual\nuser behavior trends in large activity datasets using the concept of cohort.\nThis paper presents the design and implementation of database support for\ncohort analysis. We introduce an extended relational data model for\nrepresenting a collection of activity data as an activity relation, and define\na set of cohort operators on the activity relations, for composing cohort\nqueries. To evaluate a cohort query, we present three schemes: a SQL based\napproach which translates a cohort query into a set of SQL statements for\nexecution, a materialized view approach which materializes birth activity\ntuples to speed up SQL execution, and a new cohort query evaluation scheme\nspecially designed for cohort query processing. We implement the first two\nschemes on MySQL and MonetDB respectively and develop a prototype of our own\ncohort query engine, COHANA, for the third scheme. An extensive experimental\nevaluation shows that the performance of the proposed cohort query evaluation\nscheme is up to three orders of magnitude faster than the performance of the\ntwo SQL based schemes.","authors":["Dawei Jiang","Qingchao Cai","Gang Chen","H. V. Jagadish"],"meta":["September 2016Proceedings of the VLDB Endowment 10(1):1-12","DOI:10.14778/3015270.3015271"],"references":["230609833_Processing_a_Trillion_Cells_per_Mouse_Click","221310546_C-store_a_column-oriented_DBMS","220473573_Optimizing_database_architecture_for_the_new_bottleneck_Memory_access","45338800_MonetDBX100_Hyper-Pipelining_Query_Execution","287531053_WideTable_An_accelerator_for_analytical_data_processing","262285025_BitWeaving_Fast_scans_for_main_memory_data_processing","257769429_A_multi-faced_measurement_study_on_a_large_private_BitTorrent_community","221311126_Incremental_Maintenance_of_Externally_Materialized_Views","221214136_Integrating_compression_and_execution_in_column-oriented_database_systems","220966946_Data_Cube_A_Relational_Aggregation_Operator_Generalizing_Group-By_Cross-Tab_and_Sub-Total"]}