{"id":"312931238_A_Green_Ant-Based_method_for_Path_Planning_of_Unmanned_Ground_Vehicles","abstract":"Planning of optimal/shortest path is required for proper operation of unmanned ground vehicles (UGVs). Although most of the existing approaches provide proper path planning strategy, they cannot guarantee reduction of consumed energy by UGVs which is provided via onboard battery with constraint power. Hence, in this paper, a new ant-based path planning approach that considers UGV energy consumption in its planning strategy is proposed. This method is called Green Ant (G-Ant) and integrates ant-based algorithm with power/energy consumption prediction model to reach its main goal which is providing collision-free shortest path with low power consumption. G-Ant is evaluated and validated via simulation tools. Its performance is compared with ant colony optimization (ACO), Genetic Algorithm (GA) and Particle Swarm Optimization (PSO) approaches. Various scenarios were simulated to evaluate G-Ant performance in terms of UGV travel time, travel length, computational time by taking into account different number of iterations, different number of obstacle, and different population size. The obtained results show that the G-Ant outperforms the existing methods in terms of travel length and number of iteration.","authors":["Mohammad Reza Jabbarpour","Houman Zarrabi","Jason J. Jung","Pankoo Kim"],"meta":["January 2017IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2017.2656999"],"references":["280228953_A_New_Breed_of_Robots_that_Drive_Themselves","324311202_Introduction_to_Statistical_Quality_Control","314768515_Introduction_to_Statistical_Quality_Control","312596057_Generalized_best-first_search_strategies_and_the_optimality_of_A","301476409_Robotic_motion_planning_in_unknown_dynamic_environments_Existing_approaches_and_challenges","295404524_Acceptance_Testing_and_Energy-based_Mission_Reliability_in_Unmanned_Ground_Vehicles","287335728_Cascaded_Optimization_of_Aircraft_Trajectories_for_Persistent_Data_Ferrying","286734249_Local_path_planning_in_a_complex_environment_for_self-driving_car","279367981_Robot_Motion_Planning","278712567_Lecture_Notes_in_Computer_Science"]}