{"id":"312928958_The_Vision_of_Industrie_40_in_the_Making-a_Case_of_Future_Told_Tamed_and_Traded","abstract":"Since industrial trade fair Hannover Messe 2011, the term “Industrie 4.0” has ignited a vision of a new Industrial Revolution and has been inspiring a lively, ongoing debate among the German public about the future of work, and hence society, ever since. The discourse around this vision of the future eventually spread to other countries, with public awareness reaching a temporary peak in 2016 when the World Economic Forum’s meeting in Davos was held with the motto “Mastering the Fourth Industrial Revolution.” How is it possible for a vision originally established by three German engineers to unfold and bear fruit at a global level in such a short period of time? This article begins with a summary of the key ideas that are discussed under the label Industrie 4.0. The main purpose, based on an in-depth discourse analysis, is to debunk the myth about the origin of this powerful vision and to trace the narrative back to the global economic crisis in 2009 and thus to the real actors, central discourse patterns, and hidden intentions of this vision of a new Industrial Revolution. In conclusion, the discourse analysis reveals that this is not a case of visioneering but one of a future told, tamed, and traded.","authors":["Sabine Pfeiffer"],"meta":["April 2017NanoEthics 11(1)","DOI:10.1007/s11569-016-0280-3"],"references":["317582352_Industrie_40_-_volkswirtschaftliches_Potenzial_fur_Deutschland","301828032_Robots_Industry_40_and_Humans_or_Why_Assembly_Work_Is_More_than_Routine_Work","345824823_The_Visioneers_How_a_Group_of_Elite_Scientists_Pursued_Space_Colonies_Nanotechnologies_and_a_Limitless_Future","325001650_10_Sociomateriality_Challenging_the_Separation_of_Technology_Work_and_Organization","324863511_Digital_Labour_and_the_Use-value_of_Human_Work_On_the_Importance_of_Labouring_Capacity_for_understanding_Digital_Capitalism","312006625_Industrie_40_-_Anstoss_Vision_Vorgehen","310606019_Visioneering_assessment_On_the_construction_of_tunnel_visions_for_technovisionary_research_and_policy","300661198_Industrie_40_-_Anstoss_Vision_Vorgehen","297824657_The_Capitalist's_Dilemma","293107329_The_evolution_of_Intel's_copy_EXACTLY_technology_transfer_method"]}