{"id":"312966232_Open-Source_Automated_Mapping_Four-Point_Probe","abstract":"Scientists have begun using self-replicating rapid prototyper (RepRap) 3-D printers to manufacture open source digital designs of scientific equipment. This approach is refined here to develop a novel instrument capable of performing automated large-area four-point probe measurements. The designs for conversion of a RepRap 3-D printer to a 2-D open source four-point probe (OS4PP) measurement device are detailed for the mechanical and electrical systems. Free and open source software and firmware are developed to operate the tool. The OS4PP was validated against a wide range of discrete resistors and indium tin oxide (ITO) samples of different thicknesses both pre- and post-annealing. The OS4PP was then compared to two commercial proprietary systems. Results of resistors from 10 to 1 MΩ show errors of less than 1% for the OS4PP. The 3-D mapping of sheet resistance of ITO samples successfully demonstrated the automated capability to measure non-uniformities in large-area samples. The results indicate that all measured values are within the same order of magnitude when compared to two proprietary measurement systems. In conclusion, the OS4PP system, which costs less than 70% of manual proprietary systems, is comparable electrically while offering automated 100 micron positional accuracy for measuring sheet resistance over larger areas.","authors":["Handy Chandra","Spencer W. Allen","Shane W. Oberloier","Nupur Bihari"],"meta":["January 2017Materials 10(2):110","DOI:10.3390/ma10020110","Projects: The Do-It-Yourself approach and open source solutions applied to all fields of our life (even for research purposes)3D Printers for Development"],"references":["307442756_Free_and_Open-Source_Automated_3-D_Microscope","305634257_Physical_Characterization_and_Pre-assessment_of_Recycled_High-Density_Polyethylene_as_3D_Printing_Material","304090739_A_Review_of_Solar_Photovoltaic_Levelized_Cost_of_Electricity","304090736_Exchanging_Ohmic_Losses_in_Metamaterial_Absorbers_with_Useful_Optical_Absorption_for_Photovoltaics","298328652_Open-source_hardware_for_medical_devices","309213783_Plasmonic_enhancement_of_amorphous_silicon_solar_photovoltaic_cells_with_hexagonal_silver_arrays_made_with_nanosphere_lithography","299734832_The_Current_State_of_Open_Source_Hardware_The_Need_for_an_Open_Source_Development_Platform","299369937_On_the_interplay_of_interface_morphology_and_microstructure_of_high-efficiency_microcrystalline_silicon_solar_cells","298763248_Advanced_light_management_based_on_periodic_textures_for_CuInGaSe2_thin-film_solar_cells","293827864_A_new_method_of_preparing_highly_conductive_ultra-thin_indium_tin_oxide_for_plasmonic-enhanced_thin_film_solar_photovoltaic_devices"]}