{"id":"312908724_On_the_Capacity_of_Cloud_Radio_Access_Networks_with_Oblivious_Relaying","abstract":"We study the transmission over a network in which users send information to a remote destination through relay nodes that are connected to the destination via finite-capacity error-free links, i.e., a cloud radio access network. The relays are constrained to operate without knowledge of the users' codebooks, i.e., they perform oblivious processing - The destination, or central processor, however, is informed about the users' codebooks. We establish a single-letter characterization of the capacity region of this model for a class of discrete memoryless channels in which the outputs at the relay nodes are independent given the users' inputs. We show that both relaying \\`a-la Cover-El Gamal, i.e., compress-and-forward with joint decompression and decoding, and \"noisy network coding\", are optimal. The proof of the converse part establishes, and utilizes, connections with the Chief Executive Officer (CEO) source coding problem under logarithmic loss distortion measure. Extensions to general discrete memoryless channels are also investigated. In this case, we establish inner and outer bounds on the capacity region. For memoryless Gaussian channels within the studied class of channels, we characterize the capacity under Gaussian channel inputs.","authors":["Inaki Estella Aguerri","Abdellatif Zaidi","Giuseppe Caire","Shlomo Shamai"],"meta":["January 2017"],"references":["334584918_Distributed_Variational_Representation_Learning","320055251_Distributed_Information_Bottleneck_Method_for_Discrete_and_Gaussian_Sources","306114602_An_uplink-downlink_duality_for_cloud_radio_access_network","301843142_Lossy_Compression_for_Compute-and-Forward_in_Limited_Backhaul_Uplink_Multicell_Processing","284316758_Information_bottleneck_for_Gaussian_variables","281959068_Community_detection_in_networks_based_on_information_bottleneck_clustering","273158458_Fronthaul-Constrained_Cloud_Radio_Access_Networks_Insights_and_Challenges","259844890_On_Discrete_Alphabets_for_the_Two-user_Gaussian_Interference_Channel_with_One_Receiver_Lacking_Knowledge_of_the_Interfering_Codebook","319362950_On_the_capacity_of_cloud_radio_access_networks","306376413_On_the_Optimal_Fronthaul_Compression_and_Decoding_Strategies_for_Uplink_Cloud_Radio_Access_Networks"]}