{"id":"312967891_Cross-curricular_approaches_in_Inquiry-based_Science_Teaching","abstract":"One of the most important goals of science education is to develop understanding of natural systems. It is impossible to comprehensively understand the functioning of natural systems only by knowledge of one subject (physics, chemistry, biology, etc.). Therefore the application of the cross-curricular approach in teaching of science subjects is required. Besides the scientific knowledge the understanding of science research methods is important, too. This can be obtained with the use of inquiry-based activities in science lessons that provide possibilities to show students how science works. The aim of this paper is to introduce the strategy for the use of cross-curricular approaches in inquiry-based activities in science education that was implemented within the Chain Reaction project. The project targeted 14- to 16-year-old students who in groups investigated an interdisciplinary research problem and then presented their findings and experiences at national or international events. Cosmic Web Site represents an example of the activity that encourages students to learn various topics of physics as well as to use their knowledge and skills obtained at computer science lessons. The feedback from the teachers involved in Chain Reaction that was gained with the help of evaluation questionnaires indicates a positive impact of the used approach to the development of students’ skills and motivation to learn science subjects.","authors":["Miriam Spodniaková Pfefferová","Stanislav Holec","Janka Raganová","Martin Hruška"],"meta":["December 2016International Journal of Information and Communication Technologies in Education 5(3)","DOI:10.1515/ijicte-2016-0011","Project: Chain Reaction"],"references":["286601763_Cross-Curricular_Teaching_and_Learning_in_the_Secondary_School","277159366_Inquiry-based_learning_the_nature_of_science_and_computer_technology_New_possibilities_in_science_education","252287684_Embracing_the_essence_of_inquiry_New_roles_for_science_teachers"]}