{"id":"312907998_Large_Scale_Novel_Object_Discovery_in_3D","abstract":"We present a method for discovering objects in 3D point clouds from sensors like Microsoft Kinect. We utilize supervoxels generated directly from the point cloud data and design a Siamese network building on a recently proposed 3D convolutional neural network architecture. At training, we assume the availability of the some known objects---these are used to train a non-linear embedding of supervoxels using the Siamese network, by optimizing the criteria that supervoxels which fall on the same object should be closer than those which fall on different objects, in the embedding space. We do not assume the objects during test to be known, and perform clustering, in the embedding space learned, of supervoxels to effectively perform novel object discovery. We validate the method with quantitative results showing that it can discover numerous unseen objects while being trained on only a few dense 3D models. We also show convincing qualitative results of object discovery in point cloud data when the test objects, either specific instances or even their categories, were never seen during training.","authors":["Siddharth Srivastava","Gaurav Sharma","Brejesh Lall"],"meta":["January 2017"],"references":["311609698_Discriminative_Multi-modal_Feature_Fusion_for_RGBD_Indoor_Scene_Recognition","310820881_Sound-Event_Classification_Using_Robust_Texture_Features_for_Robot_Hearing","309776317_PointNet_A_3D_Convolutional_Neural_Network_for_real-time_object_class_recognition","314100361_Indoor_Segmentation_and_Support_Inference_from_RGBD_Images","311755213_RGBD_Datasets_Past_Present_and_Future","311610802_Unsupervised_Learning_of_Discriminative_Attributes_and_Visual_Representations","311610359_Deep_Sliding_Shapes_for_Amodal_3D_Object_Detection_in_RGB-D_Images","309875544_Discriminative_Multi-Instance_Multi-Task_Learning_for_3D_Action_Recognition","308862251_Multimodal_deep_learning_for_robust_RGB-D_object_recognition","308861868_3D_ShapeNets_A_deep_representation_for_volumetric_shapes"]}