{"id":"31298537_Report_on_the_New_Oxford_English_Dictionary_User_Survey","abstract":"As part of their plan to computerize the Oxford English Dictionary, the Oxford University Press and the University of Waterloo undertook a user survey. The objective of the survey was to establish how respondents now use the Dictionary, to determine the principal facilities that users will require of an electronic version of the OEDand to provoke thoughtful responses about applications for the New OED. The survey was, in many respects, a necessary preliminary to all subsequent phases of the project.\nThis report summarizes the principal results of the survey. It includes the questionnaire itself, a tabulation of the individual responses, an analysis of current and predicted patterns of use implied by the responses, and a statistical characterization of suggested applications for the New OED. Anticipated use appears to vary according to user characteristics (including occupation, location, and native language), whether the dictionary is used for research, and on current patterns of use. The findings must remain tentative until more data on actual use are available. Because of the potential diversity, however, database design and marketing should for the time being emphasize flexibility.\n[The proposed ‘electronic version of the OED’ should not be confused with the Oxford English Dictionary on CD-ROM available now, which is based on ‘the original twelve volume edition, but without its supplement’ (G. Kaye, IJL 2/1 Spring 1989: 85). -Ed.]","authors":["Timothy Benbow","Peter Carrington","Gayle Johannesen","Frank W. Tompa"],"meta":["September 1990International Journal of Lexicography 3(3)","DOI:10.1093/ijl/3.3.155"],"references":["271423835_Promised_Incentives_in_Media_Research_A_Look_at_Data_Quality_Sample_Representativeness_and_Response_Rate","269503186_Analyzing_QualitativeCategorical_Data","263964236_Wish_M_Multidimensional_Scaling","24061253_Multidimensional_Scaling_I_Theory_and_Method"]}