{"id":"313038173_Geometry_Teaching_via_Origami_The_Views_of_Secondary_Mathematics_Teacher_Trainees","abstract":"Geometry Teaching Via Origami: The Views of Secondary Mathematics Teacher Trainees\n\nGür, H., Kobak Demir, M.\n\nConsidering the performances of the students in the TIMSS and PISA examinations, it is seen that they cannot solve the problems, do not animate the objects they can not ask geometry questions in three dimensions and can not understand them. For this reason, origami lessons should be put into teacher training programs.\nSecondary teacher trainees were examined in this study according to the their’ views about using origami activities in mathematics courses. This qualitative study was carried out with 18 secondary mathematics teacher trainees. Data were gathered by semi-structured interview and 3D tangible materials. The research questions were “How is origami used in geometry teaching?”; “What concepts do you reach for mathematics and geometry?”; “What grade levels can be associated with which gains?”; “Does it affect your learning? Are you discussing paper folds in your group?”; “What does making a origami project mean to you?”; “Should studies about origami be done in schools?”; “How do you relate the Van Hiele geometry levels?”; “How are origami activities used in chemistry, physics, mathematics and engineering?”. Findings revealed that prospective teacher candidates can associate large quantities of mathematical and geometric concepts with some achievements and that they have a constructive view on origami activities. However, it was seen that the teacher candidates did not associate with the geometric levels of Van Hiele. They reached the idea of two dimensions and three dimensions easily and without confusion. They made different 3D objects from a square paper. Visualization is the result of helping meaning. Moreover, it was observed that they had difficulty in some long-step shapes. In addition, all of the participants in the study have reached the point that the origami is entertaining and never thought it could be so enjoyable.\nKey words: Origami, mathematics education, geometry teaching, 2D objects, 3D objects.","authors":["Hülya Gür","KobakDemir M."],"meta":["January 2017","Conference: XII. ECSBS International Association of Social Science Research (IASSR)– Catania, Sicily January 25-28, 2017At: Catania, Sicily","Project: The Production of three-dimensional complex objects based on mathematical       functions by using Fused Deposition Modelling Method"],"references":[]}