{"id":"313088163_Physically_based_rendering_From_theory_to_implementation_Third_edition","abstract":"Physically Based Rendering: From Theory to Implementation, Third Edition, describes both the mathematical theory behind a modern photorealistic rendering system and its practical implementation. Through a method known as 'literate programming', the authors combine human-readable documentation and source code into a single reference that is specifically designed to aid comprehension. The result is a stunning achievement in graphics education. Through the ideas and software in this book, users will learn to design and employ a fully-featured rendering system for creating stunning imagery. This completely updated and revised edition includes new coverage on ray-tracing hair and curves primitives, numerical precision issues with ray tracing, LBVHs, realistic camera models, the measurement equation, and much more. It is a must-have, full color resource on physically-based rendering. Presents up-to-date revisions of the seminal reference on rendering, including new sections on bidirectional path tracing, numerical robustness issues in ray tracing, realistic camera models, and subsurface scattering. Provides the source code for a complete rendering system allowing readers to get up and running fast. Includes a unique indexing feature, literate programming, that lists the locations of each function, variable, and method on the page where they are first described. Serves as an essential resource on physically-based rendering.","authors":["M. Pharr","W. Jakob","G. Humphreys"],"meta":["November 2016"],"references":["234831483_Modeling_Motion_Blur_in_Computer-generated_Images","2456492_Metropolis_Light_Transport_for_Participating_Media","328717191_Production_Volume_Rendering_Design_and_Implementation","262175020_Forms_Vectors_And_Transforms","239061142_Ray_Tracing_and_Irregularities_of_Distribution","234831231_Lighting_controls_for_synthetic_images","234794066_3D_graphics_and_the_wave_theory","234171744_On_the_equilibrium_of_the_Sun's_atmosphere","216813656_Improving_Noise","44285174_Efficient_isotropic_BRDF_measurement","36713434_Ray_Tracing_Parametric_Patches","2424520_Backward_Ray_Tracing"]}