{"id":"313065405_ECRIRE_EN_LANGUES_SPECIALISEES_METHODES_ET_OUTILS_DU_TRAITEMENT_AUTOMATIQUE_DES_LANGUES_AU_SERVICE_DE_L'AUTONOMIE_DES_REDACTEURS","abstract":"Ce mémoire est consacré à la présentation de divers travaux entrepris dans l’objectif de concevoir des outils d'aide à la rédaction des textes en langues spécialisées. Il y est question de l’importance de la modélisation linguistique, des contraintes liées à l’automatisation des certaines tâches, du rôle de l’expert et de la prise en compte des utilisateurs finaux. Le rôle prépondérant est donné au lexique et à son contextualisation, une thématique, qui, je pense, fait consensus parmi les chercheurs travaillant sur la rédaction en langues spécialisées. J’y présente quatre logiciels qui sont conçus pour donner à un auteur d'un texte spécialisé plus d’autonomie dans la rédaction. Certains de ces logiciels s’adressent directement aux rédacteurs (Compagnon LiSe et SARS, Système d’Aide à la Rédaction Scientifique). D’autres constituent des aides indirectes, soit à l’enseignement et à l’apprentissage du vocabulaire spécialisé du niveau académique, soit à la constitution des lexiques pour la rédaction en langues contrôlées (Station Sensunique). Ces logiciels tentent timidement de répondre à un véritable besoin sociétal, à savoir la nécessité de produire des textes techniques de qualité, par les rédacteurs qui ne sont pas toujours des professionnels de la rédaction. La spécificité de ces rédacteurs occasionnels – qu’il s’agisse de rédaction technique ou scientifique - impose de véritables contraintes sur la conception des outils d’aide à la rédaction, résultant des injonctions apparemment contradictoires : d’une part, d’un besoin des outils simples, mais précis, et d’autre part, de la complexité de l’information à transmettre.","authors":["Izabella Thomas"],"meta":["December 2016","DOI:10.13140/RG.2.2.27803.05920","Thesis for: HDR (Habilitation à Diriger les Recherches)"],"references":["313170906_Word_association_norms_mutual_information_and_lexicography","304771734_Generation_d'exercices_d'apprentissage_de_langue_de_specialite_par_l'exploration_du_corpus","304425749_Autour_du_lexique_et_de_la_phraseologie_des_ecrits_scientifiques","301465376_LELIE_analyse_et_prevention_des_risques_a_travers_l'aide_a_la_redaction_de_documents_techniques","344809641_L'utilisation_de_plateformes_en_ligne_dans_l'enseignement_apprentissage_de_l'Espagnol_pour_Objectifs_Specifiques","339592916_The_Newspaper_Word_List_A_Specialised_Vocabulary_for_Reading_Newspapers","337383960_Comprehension_et_utilisation_de_textes_proceduraux_l'effet_de_l'ordre_de_mention_des_informations","314925591_Identification_automatique_du_lexique_scientifique_transdisciplinaire","296337845_Frequency_counts_word_lists_and_materials_preparation_A_new_approach","292301341_Sub-technical_vocabulary_and_the_ESP_teacher_An_analysis_of_some_rhetorical_items_in_medical_journal_articles"]}