{"id":"313081656_Percepciones_de_estudiantes_del_Grado_de_Maestro_sobre_el_proceso_y_resultados_de_la_ensenanza_semipresencial_-Blended_Learning-_Student_Teachers'_perceptions_towards_the_process_and_outcomes_of_Blend","abstract":"Resumen La formación semipresencial o Blended Learning está adquiriendo una relevancia fundamental en contextos universitarios que utilizan estos y otros entornos como alternativas destinadas a desarrollar las clases fuera de las fronteras del aula. A través del presente trabajo de investigación se han tratado de identificar las percepciones de un grupo de estudiantes del Grado de Maestro en Educación Primaria respecto a la formación a través del sistema de formación Blended Learning. Las valoraciones se han centrado en dos asignaturas del segundo semestre. El estudio contó con 234 participantes pertenecientes a distintas menciones o especialidades. Para la toma de datos se construyó un formulario online para ser rellenado por los estudiantes. El instrumento ha demostrado presentar elevados niveles de fiabilidad así como adecuada utilidad para predecir la satisfacción. Se han realizado análisis descriptivos y se han empleado pruebas no paramétricas (Chi cuadrado) con variables categóricas, así como paramétricas (Análisis de Varianza y Análisis de regresión) para variables continuas. Los resultados indican que, si bien factores como el género o la asignatura que se cursa no parecen afectar diferencialmente a la satisfacción con la experiencia de blended learning, variables como la mención que se cursa sí parecen incidir en la acogida de esta metodología. \n\nPalabras clave: tecnologías de la información y la comunicación, tecnologías del aprendizaje, educación superior, metodología de docencia, plataforma virtual. \n\nAbstract \n\nBlended learning is becoming key in university contexts that use these and other learning environments as alternatives to develop courses outside the boundaries of the classroom. The current research aims to identify the perceptions of a group of Primary Education student teachers on training using Blended Learning. Data were gathered on two subjects taken during the second semester. A total of 234 participants from different specialties were included. For data collection, an online form to be filled in by students was developed. The measure has been found to have high levels of reliability and usefulness in predicting satisfaction. Descriptive analyzes were performed, and nonparametric tests (Chi square) with categorical variables, as well as parametric tests (analysis of variance and regression analysis) for continuous variables were utilized. The results suggest that although factors such as gender or subject do not seem to differentially affect satisfaction with blended learning, other variables, such as the specialty being studied, may be affecting the acceptance of this methodology.\n\nKeywords: information and communications technology, learning technologies, higher education, teaching methodology, virtual platform.","authors":["Raimundo Castaño-Calle","Cristina Jenaro","Noelia Flores"],"meta":["January 2017","DOI:10.6018/red/52/2","Project: ICT usage"],"references":["282288624_Using_blended_learning_in_developing_student_teachers_teaching_skills","277272519_Evaluacion_de_un_programa_blended-learning_para_el_desarrollo_de_la_competencia_trabajar_en_equipo","273641078_The_impact_of_text_versus_video_communication_on_instructor_feedback_in_blended_courses","272129382_Impact_of_Satisfaction_Personality_and_Learning_Style_on_Educational_Outcomes_in_a_Blended_Learning_Environment","270902585_Pre-service_teachers'_performance_from_teachers'_perspective_and_vice_versa_Behaviors_attitudes_and_other_associated_variables","268513531_Systematic_design_of_blended_PBL_Exploring_the_design_experiences_and_support_needs_of_PBL_novices_in_an_online_environment","309106130_Hybrid_teaching_seeks_to_end_the_divide_between_traditional_and_online_instruction","273013958_I_Should_Have_Known_This_Was_Coming","271990946_Hitting_the_nail_on_the_head_The_importance_of_specific_staff_development_for_effective_blended_learning","267696133_K-12_teachers'_perceptions_of_and_their_satisfaction_with_interaction_type_in_blended_learning_environments"]}