{"id":"313108680_The_phraseological_dimension_in_interlanguage_complexity_research","abstract":"This article reports on the first results of a large-scale research programme that aims to define and circumscribe the construct of phraseological complexity and to theoretically and empirically demonstrate its relevance for second language theory. Within this broad agenda, the study has two main objectives. First, it investigates to what extent measures of phraseological complexity can be used to describe L2 performance at different proficiency levels. Second, it compares measures of phraseological complexity with traditional measures of syntactic and lexical complexity. Variety and sophistication are postulated to be the first two dimensions of phraseological complexity, which is approached via relational co-occurrences, i.e. co-occurring words that appear in a specific structural or syntactic relation (e.g. adjective + noun, adverbial modifier + verb, verb + direct object).\nPhraseological diversity is operationalized as root type-token ratio computed for each syntactic relation. Two methods are tested to approach phraseological sophistication. First, sophisticated word combinations are defined as academic collocations that appear in the Academic Collocation List (Ackermann & Chen, 2013). Second, it is approximated with the average pointwise mutual information score as this measures has been shown to bring out word combinations made up of closely associated medium to low-frequency (i.e. advanced or sophisticated) words. \nThe study reveals that unlike traditional measures of syntactic and lexical complexity, measures of phraseological sophistication can be used to describe L2 performance at the B2, C1 and C2 levels of the CEFR, thus suggesting that essential aspects of language development from upper-intermediate to very advanced proficiency level may be situated in the phraseological dimension.","authors":["Magali Paquot"],"meta":["March 2017Second language Research 35(1)","DOI:10.1177/0267658317694221"],"references":["316044526_The_role_of_morphological_complexity_in_predicting_the_learnability_of_an_additional_language_The_case_of_La_additional_language_Dutch","315502485_Morphological_complexity_in_written_L2_texts","313170906_Word_association_norms_mutual_information_and_lexicography","346671439_Formulaic_Language_and_the_Lexicon","346670803_Assessing_Vocabulary","346643636_Corpora_in_Applied_Linguistics","322809400_Phraseological_Competence_A_Missing_Component_in_University_Entrance_Language_Tests_Insights_From_a_Study_of_EFL_Learners'_Use_of_Statistical_Collocations","309748543_The_development_of_morphological_complexity_A_cross-linguistic_study_of_L2_French_and_English","309256797_Lexical_Analysis_Norms_and_Exploitations","308710528_Compressing_learner_language_An_information-theoretic_measure_of_complexity_in_SLA_production_data"]}