{"id":"313113638_Strong_motions_observed_by_K-NET_and_KiK-net_during_the_2016_Kumamoto_earthquake_sequence","abstract":"The nationwide strong-motion seismograph network of K-NET and KiK-net in Japan successfully recorded the strong ground motions of the 2016 Kumamoto earthquake sequence, which show the several notable characteristics. For the first large earthquake with a JMA magnitude of 6.5 (21:26, April 14, 2016, JST), the large strong motions are concentrated near the epicenter and the strong-motion attenuations are well predicted by the empirical relation for crustal earthquakes with a moment magnitude of 6.1. For the largest earthquake of the sequence with a JMA magnitude of 7.3 (01:25, April 16, 2016, JST), the large peak ground accelerations and velocities extend from the epicentral area to the northeast direction. The attenuation feature of peak ground accelerations generally follows the empirical relation, whereas that for velocities deviates from the empirical relation for stations with the epicentral distance of greater than 200 km, which can be attributed to the large Love wave having a dominant period around 10 s. The large accelerations were observed at stations even in Oita region, more than 70 km northeast from the epicenter. They are attributed to the local induced earthquake in Oita region, whose moment magnitude is estimated to be 5.5 by matching the amplitudes of the corresponding phases with the empirical attenuation relation. The real-time strong-motion observation has a potential for contributing to the mitigation of the ongoing earthquake disasters. We test a methodology to forecast the regions to be exposed to the large shaking in real time, which has been developed based on the fact that the neighboring stations are already shaken, for the largest event of the Kumamoto earthquakes, and demonstrate that it is simple but effective to quickly make warning. We also shows that the interpolation of the strong motions in real time is feasible, which will be utilized for the real-time forecast of ground motions based on the observed shakings.Graphical abstractLarge acceleration because of the station located close to the fault for M6.5 and M7.3 events (KMMH16)Large acceleration due to the local earthquake induced by M7.3 event (OIT009 and OITH11)","authors":["Wataru Suzuki","Shin Aoi","Takashi Kunugi","Hisahiko Kubo"],"meta":["December 2017Earth Planets and Space 69(1)","DOI:10.1186/s40623-017-0604-8"],"references":["319098977_Source_location_and_mechanism_analysis_of_an_earthquake_triggered_by_the_2016_Kumamoto_southwestern_Japan_earthquake","311157833_Near-fault_deformation_and_Dc_during_the_2016_Mw71_Kumamoto_earthquake","309400778_Source_rupture_processes_of_the_2016_Kumamoto_Japan_earthquakes_estimated_from_strong-motion_waveforms","301974995_Engineering_Earthquake_Early_Warning_via_Regional_Networks","313117308_Strong-Motion_Observation_in_Japan","313010549_New_attenuation_relationships_for_peak_ground_acceleration_and_velocity_considering_effects_of_fault_type_and_site_condition","289702363_A_New_Ground_Motion_Prediction_Equation_for_Japan_Applicable_up_to_M9_Mega-Earthquake","279972414_Dynamic_Triggering","276422099_Numerical_Shake_Prediction_for_Earthquake_Early_Warning_Data_Assimilation_Real-Time_Shake_Mapping_and_Simulation_of_Wave_Propagation","276213620_An_Improved_Approximating_Filter_for_Real-Time_Calculation_of_Seismic_Intensity"]}