{"id":"313126052_A_methodology_for_determining_an_effective_subset_of_heuristics_in_selection_hyper-heuristics","abstract":"We address the important step of determining an effective subset of heuristics in selection hyper-heuristics. Little attention has been devoted to this in the literature, and the decision is left at the discretion of the investigator. The performance of a hyper-heuristic depends on the quality and size of the heuristic pool. Using more than one heuristic is generally advantageous, however, an unnecessary large pool can decrease the performance of adaptive approaches. Our goal is to bring methodological rigour to this step. The proposed methodology uses non-parametric statistics and fitness landscape measurements from an available set of heuristics and benchmark instances, in order to produce a compact subset of effective heuristics for the underlying problem. We also propose a new iterated local search hyper-heuristic using multi-armed bandits coupled with a change detection mechanism. The methodology is tested on two real-world optimisation problems: course timetabling and vehicle routing. The proposed hyper-heuristic with a compact heuristic pool, outperforms state-of-the-art hyper-heuristics and competes with problem-specific methods in course timetabling, even producing new best-known solutions in 5 out of the 24 studied instances.","authors":["Jorge Alberto Soria-Alcaraz","Gabriela Ochoa","Marco Sotelo-Figueroa","Edmund K. Burke"],"meta":["January 2017European Journal of Operational Research 260(3)","DOI:10.1016/j.ejor.2017.01.042"],"references":["267202931_A_Survey_on_the_Vehicle_Routing_Problem_and_Its_Variants","264216541_Evolvability_Metrics_in_Adaptive_Operator_Selection","263288706_A_Dynamic_Multiarmed_Bandit-Gene_Expression_Programming_Hyper-Heuristic_for_Combinatorial_Optimization_Problems","313142405_Academic_timetabling_design_using_hyper-heuristics","287505218_Iterated_local_search_using_an_add_and_delete_hyper-heuristic_for_university_course_timetabling","284571822_Automated_algorithm_configuration_and_parameter_tuning","274705544_A_survey_of_approaches_for_university_course_timetabling_problem","266750017_Analysing_the_effects_of_solution_space_connectivity_with_an_effective_metaheuristic_for_the_course_timetabling_problem","264822840_Higuchi_fractal_dimension_as_a_measure_of_analgesia","264685033_A_Review_of_Hyper-Heuristics_for_Educational_Timetabling"]}