{"id":"313225179_Spatiotemporal_Data_from_Mobile_Phones_for_Personal_Mobility_Assessment_Best_Practice_for_Decision_Making","abstract":"Purpose — In this chapter, we will review several alternative methods of collecting data from mobile phones for human mobility analysis. We propose considering cellular network location data as a useful complementary source for human mobility research and provide case studies to illustrate the advantages and disadvantages of each method.\n\nMethodology/approach — We briefly describe cellular phone network architecture and the location data it can provide, and discuss two types of data collection: active and passive localization. Active localization is something like a personal travel diary. It provides a tool for recording positioning data on a survey sample over a long period of time. Passive localization, on the other hand, is based on phone network data that are automatically recorded for technical or billing purposes. It offers the advantage of access to very large user populations for mobility flow analysis of a broad area.\n\nFindings — We review several alternative methods of collecting data from mobile phone for human mobility analysis to show that cellular network data, although limited in terms of location precision and recording frequency, offer two major advantages for studying human mobility. First, very large user samples – covering broad geographical areas – can be followed over a long period of time. Second, this type of data allows researchers to choose a specific data collection methodology (active or passive), depending on the objectives of their study. The big mobile phone localization datasets have provided a new impulse for the interdisciplinary research in human mobility.\n\nOriginality/value of chapter — We propose considering cellular network location data as a useful complementary source for transportation research and provide case studies to illustrate the advantages and disadvantages of each proposed method. Mobile phones have become a kind of “personal sensor” offering an ever-increasing amount of location data on mobile phone users over long time periods. These data can thus provide a framework for a comprehensive and longitudinal study of temporal dynamics, and can be used to capture ephemeral events and fluctuations in day-to-day mobility behavior offering powerful tools to transportation research, urban planning, or even real-time city monitoring.","authors":["Zbigniew Smoreda","Ana-Maria Olteanu Raimond","Thomas Couronné"],"meta":["January 2013","DOI:10.1108/9781781902882-041","In book: Transport Survey Methods: Best Practice for Decision Making (pp.745-768)"],"references":["266886783_Utilising_Mobile_Phone_Billing_Records_for_Travel_Mode_Discovery","245559967_Elimination_of_the_Travel_Diary_Experiment_to_Derive_Trip_Purpose_from_Global_Positioning_System_Travel_Data","242481718_Processing_Raw_Data_from_Global_Positioning_Systems_Without_Additional_Information","313203504_Reality_mining_Sensing_complex_social_systems","301958661_The_mobile_data_challenge_Big_data_for_mobile_computing_research","285712579_Moving_beyond_observed_outcomes_Integrating_global_positioning_systems_and_interactive_computer-based_travel_behavior_surveys","258600564_Are_we_in_our_travel_decisions_self-determined","254609554_Smart_card_data_use_in_public_transit_A_literature_review","252819638_Processing_GPS_Raw_Data_Without_Additional_Information","234129498_Smart_card_data_in_public_transit_A_review"]}