{"id":"313243636_Comparison_of_dissimilarity_measures_for_cluster_analysis_of_X-ray_diffraction_data_from_combinatorial_libraries","abstract":"Machine learning techniques have proven invaluable to manage the ever growing volume of materials research data produced as developments continue in high-throughput materials simulation, fabrication, and characterization. In particular, machine learning techniques have been demonstrated for their utility in rapidly and automatically identifying potential composition-phase maps from structural data characterization of composition spread libraries, enabling rapid materials fabrication-structure-property analysis and functional materials discovery. A key issue in development of an automated phase-diagram determination method is the choice of dissimilarity measure, or kernel function. The desired measure reduces the impact of confounding structural data issues on analysis performance. The issues include peak height changes and peak shifting due to lattice constant change as a function of composition. In this work, we investigate the choice of dissimilarity measure in X-ray diffraction-based structure analysis and the choice of measure's performance impact on automatic composition-phase map determination. Nine dissimilarity measures are investigated for their impact in analyzing X-ray diffraction patterns for a Fe-Co-Ni ternary alloy composition spread. The cosine, Pearson correlation coefficient, and Jensen-Shannon divergence measures are shown to provide the best performance in the presence of peak height change and peak shifting (due to lattice constant change) when the magnitude of peak shifting is unknown. With prior knowledge of the maximum peak shifting, dynamic time warping in a normalized constrained mode provides the best performance. This work also serves to demonstrate a strategy for rapid analysis of a large number of X-ray diffraction patterns in general beyond data from combinatorial libraries.","authors":["Yuma Iwasaki","A. Gilad Kusne","I. Takeuchi"],"meta":["December 2017","DOI:10.1038/s41524-017-0006-2"],"references":["303556002_Perspective_Composition-structure-property_mapping_in_high-throughput_experiments_Turning_data_into_knowledge","282871107_High-throughput_determination_of_structural_phase_diagram_and_constituent_phases_using_GRENDEL","268988571_Pattern_Decomposition_with_Complex_Combinatorial_Constraints_Application_to_Materials_Discovery","265647682_On-the-fly_machine-learning_for_high-throughput_experiments_Search_for_rare-earth-free_permanent_magnets","259404846_Combinatorial_Synthesis_and_Evaluation_of_Functional_Inorganic_Materials_Using_Thin-Film_Techniques","258013361_Data_mining_for_materials_Computational_experiments_with_AB_compounds","311909515_Finding_Nature's_Missing_Ternary_Oxide_Compounds_Using_Machine_Learning_and_Density_Functional_Theory","267064516_Structure_of_Materials_An_Introduction_to_Crystallography_Diffraction_and_Symmetry","263948879_Assessment_and_Validation_of_Machine_Learning_Methods_for_Predicting_Molecular_Atomization_Energies","262982827_Combinatorial_screening_for_new_materials_in_unconstrained_composition_space_with_machine_learning"]}