{"id":"313289970_A_multiple-link_mutually_reinforced_journal-ranking_model_to_measure_the_prestige_of_journals","abstract":"Important journals usually guide the research and development directions in academic circles. Therefore, it is necessary to find the important journals among a number of academic journals. This study presents a model named the multiple-link, mutually reinforced journal-ranking (MLMRJR) model based on the PageRank and the Hyperlink-Induced Topics Search algorithms that considers not only the quantity and quality of citations in intra-networks, but also the mutual reinforcement in inter-networks. First, the multiple links between four intra-networks and three inter-networks of paper, author, and journal are involved simultaneously. Second, a time factor is added to the paper citation network as the weight of the edges to solve the rank bias problem of the PageRank algorithm. Third, the author citation network and the co-authorship network are considered simultaneously. The results of a case study showed that the proposed MLMRJR model can obtain a reasonable journal ranking based on Spearman’s and Kendall’s ranking correlation coefficient and ROC curve analysis. This study provides a systematic view of such field from the perspective of measuring the prestige of journals, which can help researchers decide where to view publications and publish their papers, and help journal editors and organizations evaluate the quality of other journals and focus on the strengths of their own journals.","authors":["Dejian Yu","Ruby W. Wang","Shuai Zhang","Wenyu Zhang"],"meta":["April 2017Scientometrics 111(1):1-22","DOI:10.1007/s11192-017-2262-9"],"references":["312633639_CocaRank_A_Collaboration_Caliber-based_Method_for_Finding_Academic_Rising_Stars","283553852_Ranking_the_research_productivity_of_business_and_management_institutions_in_Asia-Pacific_region_empirical_research_in_leading_ABS_journals","281447680_Author_ranking_based_on_personalized_PageRank","314374610_Tri-Rank_An_Authority_Ranking_Framework_in_Heterogeneous_Academic_Networks_by_Mutual_Reinforce","298723894_Evaluating_paper_and_author_ranking_algorithms_using_impact_and_contribution_awards","287419288_Ranking_scientific_publications_with_similarity-preferential_mechanism","284246588_On_the_stability_of_citation-based_journal_rankings","282527694_Interpolated_sub-impact_factor_SIF_sequences_for_journal_rankings","282432113_Data-driven_journal_meta-ranking_in_business_and_management","280972031_Exploiting_heterogeneous_scientific_literature_networks_to_combat_ranking_bias_Evidence_from_the_computational_linguistics_area"]}