{"id":"313269307_Towards_a_standard_Part_of_Speech_tagset_for_the_Arabic_language","abstract":"Part of Speech (PoS) tagging is still not very well investigated with respect to the Arabic language. Determining the PoS tags of a word in a particular context is difficult, primarily because there is no use of diacritics in most of contemporary texts. Consequently, the same word may be spelled in different ways. Further, detecting the difference between Arabic derivatives represents a very challenging issue for the majority of PoS taggers. Hence, the task of tagging the correct PoS tags requires advanced processing and the use of considerable resources. This study aims to design detailed hierarchical levels of the Arabic tagset categories and their relationships. These hierarchical levels allow easier expansion when required and produce more accurate and precise results. They are based on a comparative study and important references in Arabic grammar; they are also validated by experts in this field. In addition, the proposed tagset is implemented in a PoS tagger and tested via various experiments. We believe that our study makes a significant contribution to the literature because this work is an advancement in the direction of achieving a standard, rich, and comprehensive tagset for Arabic.","authors":["Imad Zeroual","Abdelhak Lakhouaja","Rachid Belahbib"],"meta":["February 2017Journal of King Saud University - Computer and Information Sciences 29(2)","DOI:10.1016/j.jksuci.2017.01.006","Project: Morphological, Syntactic, and Semantic Processing"],"references":["322956319_Multi-lingual_sentiment_analysis_of_financial_news_streams","303836091_MADAMIRA_A_Fast_Comprehensive_Tool_for_Morphological_Analysis_and_Disambiguation_of_Arabic","303834442_AlKhalil_Morpho_Sys_2_A_robust_Arabic_morpho-syntactic_analyzer","294736192_A_new_Quranic_Corpus_rich_in_morphosyntactical_information","283116290_A_hybrid_Arabic_POS_tagging_for_simple_and_compound_morphosyntactic_tags","276199245_Hybrid_Part-Of-Speech_Tagger_for_Non-Vocalized_Arabic_Text","271451888_Developing_an_Arabic_treebank","269033717_Automatic_tagging_of_Arabic_text","321613332_Natural_Language_Processing_of_Semitic_Languages","299584925_Adapting_a_Decision_Tree_Based_Tagger_for_Arabic"]}