{"id":"313213213_On_Representing_Coalitional_Games_with_Externalities","abstract":"We consider the issue of representing coalitional games in multiagent systems with externalities (i.e., in systems where the performance of one coalition may be affected by other co-existing coalitions). In addition to the conventional partition function game representation (PFG), we propose a number of new representations based on a new notion of externalities. In contrast to conventional game theory, our new concept is not related to the process by which the coalitions are formed, but rather to the effect that each coalition may have on the entire system and vice versa. We show that the new representations are fully expressive and, for many classes of games, more concise than the conventional PFG. Building upon these new representations, we propose a number of approaches to solve the coalition structure generation problem in systems with externalities. We show that, if externalities are characterised by various degrees of regularity, the new representations allow us to adapt coalition structure generation algorithms that were originally designed for domains with no externalities, so that they can be used when externalities are present. Finally, building upon [16] and [9], we present a unified method to solve the coalition structure generation problem in any system, with or without externalities, provided sufficient information is available.","authors":["Tomasz Michalak","Talal Rahwan","Jacek Sroka","Andrew Dowell"],"meta":["July 2009","Conference: 10th ACM Conference on Electronic Commerce (EC'09)"],"references":["259743335_An_Anytime_Algorithm_for_Optimal_Coalition_Structure_Generation","221605001_A_Compact_Representation_Scheme_for_Coalitional_Games_in_Open_Anonymous_Environments","221603411_Coalition_Structure_Generation_Dynamic_Programming_Meets_Anytime_Optimisation","221454478_An_improved_dynamic_programming_algorithm_for_coalition_structure_generation","241862097_Dynamic_Modeling_of_Monetary_and_Fiscal_Cooperation_Among_Nations","239667611_On_the_Complexity_of_Cooperative_Solution_Concepts","229771293_N-person_Games_in_Partition_Function_Form","222836601_Exogenous_coalition_formation_in_the_e-marketplace_based_on_geographical_proximity","222304300_Methods_for_Task_Allocation_via_Agent_Coalition_Formation","221602947_Computing_Shapley_Values_Manipulating_Value_Division_Schemes_and_Checking_Core_Membership_in_Multi-Issue_Domains"]}