{"id":"313252268_Universal_web_accessibility_and_the_challenge_to_integrate_informal_Arabic_users_a_case_study","abstract":"Most Arabs can read text written in Modern Standard Arabic (MSA). However, to easily express themselves, they may find it easier to switch to informal (colloquial) Arabic. The web is open for anyone to express him/herself freely, and people are expressing themselves through many social media platforms, such as blogs and forums increasingly in their native colloquies. Search engines are very good at handling queries in MSA, though not as good if the query is written in colloquial Arabic. Two issues will be addressed in this paper. First, many younger generation Arabs find it hard to write in MSA, which means that many results are missed due to improperly posted queries; and second, a query written in MSA will not retrieve documents written in colloquial Arabic. Thus, with the goal of universal accessibility of the web to all Arabic users, we need a successful mechanism that translates the query back and forth between MSA and the variety of colloquies spread throughout the Arab countries. As a case study, we investigate one of the local dialects in Saudi Arabia, a leading country in social media usage much of which is in colloquial language. We present a web information retrieval system for Arabic that addresses this concern. To test the proposed method, we compiled a corpus of over fourteen hundred documents and measured the performance of our system using 50 sample queries achieving an average recall and precision of 93.4 and 83.6%, respectively.","authors":["Aqil Azmi","Eman A. Aljafari"],"meta":["March 2018Universal Access in the Information Society 17(7)","DOI:10.1007/s10209-017-0522-3"],"references":["277424016_Arabic_Natural_Language_Processing","350630561_Saudi_Arabian_Dialects","344526290_Najdi_Arabic_Central_Arabian","334801286_GLOBALISATION_AND_E-ARABIC_THE_EMERGENCE_OF_A_NEW_LANGUAGE_AT_THE_LITERAL_AND_FIGURATIVE_LEVELS","313036839_A_morphological_analyzer_for_egyptian_arabic","308161218_Introduction_to_information_retrieval_chapt","303546809_Word_sense_disambiguation_and_information_retrieval","282004698_Handbook_for_Arabic_language_teaching_professionals_in_the_21st_century","274216016_Arabic_Information_Retrieval","272553518_Two_Pre-Islamic_Arabic_Inscriptions_Revised_Jabal_Ramm_and_Umm_Al-Jimal","267967976_A_Web_Application_for_Dialectal_Arabic_Text_Annotation","260693961_Automatic_Stochastic_Arabic_Spelling_Correction_With_Emphasis_on_Space_Insertions_and_Deletions","259453069_A_survey_of_automatic_Arabic_diacritization_techniques","270153180_Saudi_Arabian_Dialects","270150386_Najdi_Arabic_Central_Arabian"]}