{"id":"313214997_O_primeiro_passo_na_trajetoria_da_elaboracao_de_um_curso_de_EAP_para_pos-graduandos_em_Ciencia_da_Computacao_analise_de_necessidades","abstract":"The present paper presents the beginning of a needs analysis (JORDAN, 1997) process taken with Computer Science graduate students from a public university in the state of São Paulo. The first phase aimed at raising the view of the students regarding their own skills and needs related to the use of English in the academic setting, in order to verify the real need of an English for Academic Purposes (EAP) course for this group, as well as the possible content of the course. To do so, a questionnaire was applied to them in order to raise information about the present situation, target situation and lacks (FLOWERDEW; PEACOCK, 2001a, 2001b), along with the learning strategies and learners´ goals (RAMOS; LIMA-LOPES; GAZOTTI-VALLIM, 2004). Data analysis showed that, although the students consider themselves to have high proficiency in writing, which contradicts great part of the literature (SWALES, 1990; DUSZAK, 1995; MOTTA-ROTH, 1999; DUDLEY-EVANS, 2001) that indicates a gap in the learners´ written academic production both in the mother tongue and in the foreign language, they see the need of an EAP course focused on the writing production of specific genres. Thus, it is possible to assure that the students fit the profile to attend an EAP course, since they recognize the need of improving their abilities to write research articles and abstracts.","authors":["Bruna Gabriela Augusto Marçal Vieira","Solange Aranha"],"meta":["December 2015Entretextos 15(2):139","DOI:10.5433/1519-5392.2015v15n2p139","Project: Gêneros textuais no âmbito universitário"],"references":["291830955_Research_perspectives_on_English_for_Academic_Purposes","277035714_A_IMPORTANCIA_DO_CONCEITO_DE_GENEROS_DISCURSIVOS_NO_ENSINO_DE_REDACAO_ACADEMICA","240448232_A_needs_analysis_approach_to_ESP_syllabus_design_in_Greek_tertiary_education_A_descriptive_account_of_students'_needs","345908335_Genre_and_Second_Language_Writing","344473057_Task-Based_Language_Teaching","285868466_A_framework_of_course_development_processes","270150410_Genre_Analysis_English_in_Academic_and_Research_Settings","269854502_English_for_Academic_Purposes_A_Guide_and_Resource_Book_for_Teachers","235342143_Genre_analysis_English_in_academic_and_research_Settings","235330379_Syllabus_Revision_a_needs_analysis_study"]}