{"id":"313394718_From_Bayesian_to_Crowdsourced_Bayesian_Auctions","abstract":"A strong assumption in Bayesian mechanism design is that the distributions of the players' private types are common knowledge to the designer and the players--the common prior assumption. An important problem that has received a lot of attention in both economics and computer science is to repeatedly weaken this assumption in game theory--the \"Wilson's Doctrine\". In this work we consider, for the first time in the literature, multi-item auctions where the knowledge about the players' value distributions is scattered among the players and the seller. Each one of them privately knows some or none of the value distributions, no constraint is imposed on who knows which distributions, and the seller does not know who knows what. In such an unstructured information setting, we design mechanisms for unit-demand and additive auctions, whose expected revenue approximates that of the optimal Bayesian mechanisms by \"crowdsourcing\" the players' and the seller's knowledge. Our mechanisms are 2-step dominant-strategy truthful and the revenue increases gracefully with the amount of knowledge the players have. In particular, the revenue starts from a constant fraction of the revenue of the best known dominant-strategy truthful Bayesian mechanisms, and approaches 100 percent of the later when the amount of knowledge increases. Our results greatly improve the literature on the relationship between the amount of knowledge in the system and what mechanism design can achieve. In some sense, our results show that the common prior assumption is without much loss of generality in Bayesian auctions if one is willing to give up a fraction of the revenue.","authors":["Jing Chen","Bo Li","Yingkai Li"],"meta":["February 2017"],"references":["317640614_Simple_mechanisms_for_subadditive_buyers_via_duality","315424966_Informational_Robustness_and_Solution_Concepts","315390737_Informational_Robustness_and_Solution_Concepts","313100149_Optimal_auction_design","312538489_Revenue_maximization_with_a_single_sample","311568929_Putting_Peer_Prediction_Under_the_Microeconomicscope_and_Making_Truth-Telling_Focal","309199797_Robust_Contracting_with_Additive_Noise","305524796_Mechanism_Design_for_Subadditive_Agents_via_an_Ex_Ante_Relaxation","303933719_A_Duality_Based_Unified_Approach_to_Bayesian_Mechanism_Design","303901619_The_sample_complexity_of_auctions_with_side_information"]}