{"id":"313394721_Manyopt_An_Extensible_Tool_for_Mixed_Non-Linear_Optimization_Through_SMT_Solving","abstract":"Optimization of Mixed-Integer Non-Linear Programming (MINLP) supports important decisions in applications such as Chemical Process Engineering. But current solvers have limited ability for deductive reasoning or the use of domain-specific theories, and the management of integrality constraints does not yet exploit automated reasoning tools such as SMT solvers. This seems to limit both scalability and reach of such tools in practice. We therefore present a tool, ManyOpt, for MINLP optimization that enables experimentation with reduction techniques which transform a MINLP problem to feasibility checking realized by an SMT solver. ManyOpt is similar to the SAT solver ManySAT in that it runs a specified number of such reduction techniques in parallel to get the strongest result on a given MINLP problem. The tool is implemented in layers, which we may see as features and where reduction techniques are feature vectors. Some of these features are inspired by known MINLP techniques whereas others are novel and specific to SMT. Our experimental results on standard benchmarks demonstrate the benefits of this approach. The tool supports a variety of SMT solvers and is easily extensible with new features, courtesy of its layered structure. For example, logical formulas for deductive reasoning are easily added to constrain further the optimization of a MINLP problem of interest.","authors":["Andrea Callia D'Iddio","Michael Huth"],"meta":["February 2017"],"references":["267272188_Optimization_Modulo_Theories_with_Linear_Rational_Costs","262938005_ANTIGONE_Algorithms_for_ContinuousInteger_Global_Optimization_of_Nonlinear_Equations","321595571_Decision_Procedures_An_Algorithmic_Point_of_View","310036014_Confidence_Analysis_for_Nuclear_Arms_Control_SMT_Abstractions_of_Bayesian_Belief_Networks","302552868_Nonlinear_and_Mixed-Integer_Optimization_Fundamentals_and_Applications","268862865_Decision_procedures_An_algorithmic_point_of_view_With_foreword_by_Randal_E_Bryant","262274229_dReal_An_SMT_Solver_for_Nonlinear_Theories_over_the_Reals","262205737_Studies_of_the_Behavior_of_Recursion_for_the_Pooling_Problem","262174224_Symbolic_Optimization_with_SMT_Solvers","260213562_Using_diversification_communication_and_parallelism_to_solve_mixed-integer_linear_programs"]}