{"id":"313347294_Analysis_of_craquelure_patterns_for_content-based_retrieval","abstract":"The advent of multimedia technology has offered a new dimension in computerised applications. Art-based applications are among those which have and will continue to benefit from this advancement. Content-based image retrieval (CBIR) and analysis is attracting attention from museums and art institutions. One of the image-based requirements from museums is to automatically classify craquelure (cracks) in paintings for the purpose of aiding damage assessment using non-destructive monitoring and testing. Craquelure in paintings can be an important element in judging authenticity, use of material as well as environmental and physical impact, which these can contribute to different craquelure patterns. Mass screening of craquelure patterns will help to establish a better platform for conservators to identify cause of damage and a content-based approach is seen as an appropriate path. This thesis covers the issues of crack enhancement and detection, using a mathematical morphology technique, namely the top-hat operator and also a grid-based automatic thresholding. Craquelure representation aids the processes of craquelure pattern analysis in which the Freeman chain-code is used as a basis for converting the image-based representation into a hierarchically structured numerical form. This hierarchical representation offers several advantages in the sense that detected craquelure patterns can be pruned, according to a certain rule for eliminating suspected noise and insignificant structures. Information can be retrieved in a flexible way, given multi-level access into structural detail. A grouping technique determines ‘objects-of-interest’ and structured craquelure patterns, named crack-networks are grouped using proximity and characteristic rules. Craquelure patterns are generalised by utilising conservative approximations based on the minimum bounding rectangle (MBR) and rotated minimum bounding rectangle (RMBR). Meaningful features based on orientation histograms and structural statistics are extracted to distinguish between craquelure patterns. The resultant features are used as inputs for a three-stage average distance k-nearest neighbour (k-NN) classifier with fuzzy outputs where the goal is to produce class memberships. A prototype architecture of a craquelure retrieval system is also discussed.","authors":["Fazly Salleh Abas"],"meta":["August 2004"],"references":[]}