{"id":"313363209_A_Logic-Based_Representation_for_Coalitional_Games_with_Externalities","abstract":"We consider the issue of representing coalitional games in multiagent systems that exhibit externalities from coalition formation, i.e., systems in which the gain from forming a coalition may be affected by the formation of other co-existing coalitions. Although externalities play a key role in many real-life situations, very little attention has been given to this issue in the multi-agent system literature, especially with regard to the computational aspects involved. To this end, we propose a new representation which, in the spirit of Ieong and Shoham [9], is based on Boolean expressions. The idea behind our representation is to construct much richer expressions that allow for capturing externalities induced upon coalitions. We show that the new representation is fully expressive, at least as concise as the conventional partition function game representation and, for many games, exponentially more concise. We evaluate the efficiency of our new representation by considering the problem of computing the Extended and Generalized Shapley value, a powerful extension of the conventional Shapley value to games with externalities. We show that by using our new representation, the Extended and Generalized Shapley value, which has not been studied in the computer science literature to date, can be computed in time linear in the size of the input.","authors":["Tomasz Michalak","Dorota Marciniak","Marcin Szamotulski","Talal Rahwan"],"meta":["May 2010","Conference: Autonomous Agents And MultiAgent Systems (AAMAS 2010)"],"references":["313362795_Coalition_Structure_Generation_in_Multi-Agent_Systems_With_Positive_and_Negative_Externalities","313213213_On_Representing_Coalitional_Games_with_Externalities","261665092_The_Shapley_value_for_partition_function_form_games","319834331_The_Complexity_of_Boolean_Functions","284289939_A_Value_for_n-Person_Games","267107279_The_Shapley_Value_Essays_in_Honor_of_Lloyd_S_Shapley","243771046_Cooperative_Games_on_Combinatorial_Structures","239667611_On_the_Complexity_of_Cooperative_Solution_Concepts","239021157_Game_Theory_in_the_Social_Sciences","229771293_N-person_Games_in_Partition_Function_Form"]}