{"id":"313478837_SF-sketch_A_Fast_Accurate_and_Memory_Efficient_Data_Structure_to_Store_Frequencies_of_Data_Items","abstract":"A sketch is a probabilistic data structure that is\nused to record frequencies of items in a multi-set. Various types\nof sketches have been proposed in literature and applied in a\nvariety of fields, such as data stream processing, natural language\nprocessing, distributed data sets etc. While several variants of\nsketches have been proposed in the past, existing sketches still\nhave a significant room for improvement in terms of accuracy.\nIn this paper, we propose a new sketch, called Slim-Fat (SF)\nsketch, which has a much smaller memory footprint for query\nwhile supporting insertions and deletions. The key idea behind\nour proposed SF-sketch is to maintain two separate sketches:\na small sketch called Slim-subsketch and a large sketch called\nFat-subsketch. The Slim-subsketch enables fast and accurate\nquerying. The Fat-subsketch is used to assist the insertion and\ndeletion from Slim-subsketch. We implemented and evaluated\nSF-sketch along with several prior sketches and compared them\nside by side. Our experimental results show that SF-sketch\noutperforms the most commonly used CM-sketch by up to 14.8\ntimes in terms of accuracy.","authors":["Tong Yang","Lingtong Liu","Yibo Yan","Muhammad Shahzad"],"meta":["April 2017","DOI:10.1109/ICDE.2017.50","Conference: 2017 IEEE International Conference on Data Engineering (ICDE 2017)"],"references":["313478917_SF-sketch_A_Two-stage_Sketch_for_Data_Streams","312462335_SF-sketch_slim-fat-sketch_with_GPU_assistance","284282852_A_Shifting_Bloom_Filter_Framework_for_Set_Queries","272521715_Count-Min-Log_sketch_Approximately_counting_with_approximate_counters","266660068_Guarantee_IP_Lookup_Performance_with_FIB_Explosion","242607190_Advanced_Statistical_Approaches_for_Network_Anomaly_Detection_3_hours_tutorial","282844288_A_Shifting_Bloom_Filter_Framework_for_Set_Queries","267831464_Probabilistic_Counting_as_an_Extension_to_Randomized_Count_Storage","224137151_Tracking_Long_Duration_Flows_in_Network_Traffic","222823543_An_improved_data_stream_summary_The_Count-Min_Sketch_and_its_applications"]}