{"id":"313436880_Adaptive_Modeling_of_Urban_Dynamics_with_Mobile_Phone_Database","abstract":"Thecommunicationnetworks(mobilephonenetworks,socialmediaplatforms)producedigital traces from their usages. This type of information help to understand and analyze the human mobility in very accurate way. By these analyzes over cities, it can give powerful data on daily citizen activities, urban planners have in that way, relevant indications for decision making on design and development. As well as, the Call detail Records (CDRs) provides valuable spatiotemporal data at the level of citywide or even nationwide. The CDRs could be analyzed to extract the life patterns and individuals mobility in an observed urban area and during ephemeral events. Whereas, their analysis gives conceptual views about human density and mobility patterns.In this study, the mobile phone traces concern an ephemeral event called Armada in Rouen city. However,importantdensitiesofindividualsareanalyzedandarerepresentedtoextractthe life patterns by classifying the most active regions during observed period in this urban area. Then, the collective mobility patterns are investigated in aggregated urban mobility patterns via extracting the universal mobility law (power-law distribution). This investigation explores the characteristics of human mobility patterns, and model them mathematically depending on substantial parameters, that are the inter-event time, traveled distances (displacements), and the radius of gyration.The main purpose of this study is to determine the general pattern law of the population. And, its contribution is the resulting outcomes, which are revealed and visualized in both static and dynamic perspectives. They can be capitalized as guidelines to explore the urban pulse and life patterns. The numerical simulation results endorse the previousinvestigations. Hence, they found that the real system patterns almost follow an exponential distribution. Additionally, the experiments classiﬁed the mobility patterns into major classes as general, work, and off days.","authors":["Suhad Faisal"],"meta":["November 2016"],"references":["311518864_Adaptive_Modeling_of_Urban_Dynamics_during_Armada_Event_using_CDRs","308834581_Microscopic_Pedestrian_Flow_Characteristics_Development_of_an_Image_Processing_Data_Collection_and_Simulation_Model","304801532_Adaptive_Modeling_of_Urban_Dynamics_During_Ephemeral_Event_via_Mobile_Phone_Traces","304197527_Decision_Making_and_Emergency_Communication_System_in_Rescue_Simulation_for_People_with_Disabilities","297734297_Modelling_Dynamic_Patterns_Using_Mobile_Data","296640138_Visualization_of_People_Attraction_from_Mobile_Phone_Trace_Database_A_Case_study_on_Armada_2008_in_French_City_of_Rouen","295731813_Human_Trajectories_Characteristics","294107106_Human_Mobility_Patterns_Modelling_using_CDRs","317215239_Statistical_Analysis_Techniques_in_Particle_Physics_Fits_Density_Estimation_and_Supervised_Learning","311518697_Modeling_of_City_Pulse_using_Radius_of_Gyration_via_Mobile_Data","284094819_Automated_clustering_of_trajectory_data_using_a_particle_swarm_optimization","288810073_Modeling_urban_mobility_for_e-governance_with_low_energy_complexity","287948059_Modelling_pedestrian_behaviour_under_emergency_conditions_-_State-of-the-art_and_future_directions","284018716_Microeconomic_model_of_residential_location_incorporating_life_cycle_and_social_expectations","282173092_Enabling_pervasive_applications_by_understanding_individual_and_community_behaviors"]}