{"id":"313416819_Investigating_Public_Facility_Characteristics_from_a_Spatial_Interaction_Perspective_A_Case_Study_of_Beijing_Hospitals_Using_Taxi_Data","abstract":"Services provided by public facilities are essential to people's lives and are closely associated with human mobility. Traditionally, public facility access characteristics, such as accessibility, equity issues and service areas, are investigated mainly based on static data (census data, travel surveys and particular records, such as medical records). Currently, the advent of big data offers an unprecedented opportunity to obtain large-scale human mobility data, which can be used to study the characteristics of public facilities from the spatial interaction perspective. Intuitively, spatial interaction characteristics and service areas of different types and sizes of public facilities are different, but how different remains an open question, so we, in turn, examine this question. Based on spatial interaction, we classify public facilities and explore the differences in facilities. In the research, based on spatial interaction extracted from taxi data, we introduce an unsupervised classification method to classify 78 hospitals in 6 districts of Beijing, and the results better reflect the type of hospital. The findings are of great significance for optimizing the spatial configuration of medical facilities or other types of public facilities, allocating public resources reasonably and relieving traffic pressure.","authors":["Xiaoqing Kong","Yu Liu","Yuxia Wang","Daoqin Tong"],"meta":["February 2017International Journal of Geo-Information 6(2):38","DOI:10.3390/ijgi6020038"],"references":["276132113_Social_Sensing_A_New_Approach_to_Understanding_Our_Socioeconomic_Environments","273518230_Inferring_trip_purposes_and_uncovering_travel_patterns_from_taxi_trajectory_data","259920111_Uncovering_Patterns_of_Inter-Urban_Trip_and_Spatial_Interaction_from_Social_Media_Check-In_Data","290790686_Spatial_accessibility_of_public_service_and_measurement_methods","282530942_Incorporating_spatial_interaction_patterns_in_classifying_and_understanding_urban_land_use","277917628_Evaluating_and_Re-Demarcating_the_Hospital_Service_Areas_in_Florida","262526887_An_integrated_framework_to_evaluate_the_equity_of_urban_public_facilities_using_spatial_multi-criteria_analysis","262295682_An_Analysis_of_Beijing_HFMD_Patients_Mobility_Pattern_during_Seeking_Treatment","251543297_Exploring_an_integrated_method_for_measuring_the_relative_spatial_equity_in_public_facilities_in_the_context_of_urban_parks","243764385_A_Computer_Movie_Simulating_Urban_Growth_in_the_Detroit_Region"]}