{"id":"313471198_A_Plea_for_Non-naturalism_as_Constructionism","abstract":"Contemporary science seems to be caught in a strange predicament. On the one hand, it holds a firm and reasonable commitment to a healthy naturalistic methodology, according to which explanations of natural phenomena should never overstep the limits of the natural itself. On the other hand, contemporary science is also inextricably and now inevitably dependent on ever more complex technologies, especially Information and Communication Technologies, which it exploits as well as fosters. Yet such technologies are increasingly “artificialising” or “denaturalising” the world, human experiences and interactions, as well as what qualifies as real. So the search for the ultimate explanation of the natural seems to rely upon, and promote, the development of the artificial, seen here as an instantiation of the non-natural. In this article, I would like to try and find a way out of this apparently strange predicament. I shall argue that the naturalisation of our knowledge of the world is either philosophically trivial (naturalism as anti-supernaturalism and anti-preternaturalism), or mistaken (naturalism as anti-constructionism). First, I shall distinguish between different kinds of naturalism. Second, I shall remind the reader that the kinds of naturalism that are justified today need to be protected and supported pragmatically, but they are no longer very interesting conceptually. We know how to win the argument. We just have to keep winning it. Whereas the kind of naturalism that is still interesting today is now in need of revision in order to remain acceptable. Such a kind of naturalism may be revised on the basis of a realistic philosophy of information, according to which knowing is a constructive activity, through which we do not merely represent the phenomena we investigate passively, but create more or less correct informational models (semantic artefacts) of them, proactively and interactively. I shall conclude that the natural is in itself artefactual (a semantic construction), and that the information revolution is disclosing a tension not between the natural and the non-natural, but a deeper one between a user’s and a producer’s interpretation of knowledge. The outcome is a philosophical view of knowledge and science in the information age that may be called constructionist and a revival of philosophy as a classic, foundationalist enterprise.","authors":["Luciano Floridi"],"meta":["June 2017Minds and Machines 27(2)","DOI:10.1007/s11023-017-9422-9"],"references":["309169530_What_a_maker's_knowledge_could_be","278703030_Perception_and_Testimony_as_Data_Providers","270356906_Saving_the_Phenomena","347495258_Scepticism_and_the_Foundation_of_Epistemology_A_Study_in_the_Metalogical_Fallacies","333883553_Mind_and_World","332475550_Ontological_Relativity_and_Other_Essays","325752137_The_Method_of_Levels_of_Abstraction","288359770_Experience_and_the_World's_Own_Language_A_Critique_of_John_McDowell's_Empiricism","283253501_Understanding_Naturalism","274907876_The_Significance_of_Philosophical_Scepticism"]}