{"id":"313476858_A_Survey_of_Sequential_Pattern_Mining","abstract":"Discovering unexpected and useful patterns in databases is a fundamental\ndata mining task. In recent years, a trend in data mining has been to design algorithms\nfor discovering patterns in sequential data. One of the most popular data mining tasks on\nsequences is sequential pattern mining. It consists of discovering interesting subsequences\nin a set of sequences, where the interestingness of a subsequence can be measured in\nterms of various criteria such as its occurrence frequency, length, and profit. Sequential\npattern mining has many real-life applications since data is encoded as sequences in\nmany fields such as bioinformatics, e-learning, market basket analysis, text analysis, and\nwebpage click-stream analysis. This paper surveys recent studies on sequential pattern\nmining and its applications. The goal is to provide both an introduction to sequential\npattern mining, and a survey of recent advances and research opportunities. The paper\nis divided into four main parts. First, the task of sequential pattern mining is defined and\nits applications are reviewed. Key concepts and terminology are introduced. Moreover,\nmain approaches and strategies to solve sequential pattern mining problems are presented.\nLimitations of traditional sequential pattern mining approaches are also highlighted, and\npopular variations of the task of sequential pattern mining are presented. The paper\nalso presents research opportunities and the relationship to other popular pattern mining\nproblems. Lastly, the paper also discusses open-source implementations of sequential\npattern mining algorithms","authors":["Philippe Fournier Viger","Chun-Wei Jerry Lin","Uday Kiran Rage","Yun Sing Koh"],"meta":["February 2017","Projects: Finding Rare Association Rule MiningMining Utility Itemsets in SpatioTemporal Databasessequence mining, times series mining"],"references":["312735769_ERMiner_Sequential_Rule_Mining_Using_Equivalence_Classes","311316945_MHHUSP_An_integrated_algorithm_for_mining_and_Hiding_High_Utility_Sequential_Patterns","309011118_Spatial_Sequential_Pattern_Mining_for_Seismic_Data","307587257_The_SPMF_Open-Source_Data_Mining_Library_Version_2","304480099_PHM_Mining_Periodic_High-Utility_Itemsets","323511553_Mining_sequential_patterns_from_probabilistic_databases","319393506_Mining_Sequential_Patterns_Generalizations_and_Performance_Improvements","316628059_Closed_multidimensional_sequential_pattern_mining","314795231_Multi-dimensional_sequential_pattern_mining","303206384_Data_Mining_Concepts_and_Techniques"]}