{"id":"313456074_Detecting_fraud_corruption_and_collusion_in_international_development_contracts_The_design_of_a_proof-of-concept_automated_system","abstract":"International development banks provide low-interest loans to developing countries in an effort to stimulate social and economic development. These loans support key infrastructure projects including the building of roads, schools, and hospitals. However, despite the best efforts of development banks, these loan funds are often lost to fraud, corruption, and collusion. In an effort to sanction and deter this wrongdoing and to ensure proper use of funds, development banks conduct extensive, costly investigations that can take over a year to complete. This paper describes a proof-of-concept of a fully automated fraud, corruption, and collusion classification system for identifying risk in international development contracts. We developed this system in conjunction with the World Bank Group — the largest international development bank — to improve the time and cost efficiency of their investigation process. Using historical monetary award data and past investigation outcomes, our classifier assigns a “risk score” to World Bank contracts. This risk score is designed to enable World Bank investigators to identify the contracts most likely to lead to a substantiated investigation. If implemented, our automated system is predicted to successfully identify fraud, corruption, and collusion in 70% of cases.","authors":["Emily Grace","Ankit Rai","Elissa Redmiles","Rayid Ghani"],"meta":["December 2016","DOI:10.1109/BigData.2016.7840752","Conference: 2016 IEEE International Conference on Big Data (Big Data)"],"references":["249994826_Data_Mining_Application_for_Cyber_Credit-Card_Fraud_Detection_System","225586212_Transaction_aggregation_as_a_strategy_for_credit_card_fraud_detection","51969319_Scikit-learn_Machine_Learning_in_Python","2256438_Toward_Scalable_Learning_with_Non-uniform_Class_and_Cost_Distributions_A_Case_Study_in_Credit_Card_Fraud_Detection","287091707_Multilateral_development_banks_Overview_and_issues_for_congress","238698741_Participatory_Design_Principles_and_Practices"]}