{"id":"313484707_Detection_and_Localization_of_Robotic_Tools_in_Robot-Assisted_Surgery_Videos_Using_Deep_Neural_Networks_for_Region_Proposal_and_Detection","abstract":"Video understanding of robot-assisted surgery (RAS) videos is an active research area. Modeling the gestures and skill level of surgeons presents an interesting problem. The insights drawn may be applied in effective skill acquisition, objective skill assessment, real-time feedback, and human-robot collaborative surgeries. We propose a solution to the tool detection and localization open problem in RAS video understanding, using a strictly computer vision approach and the recent advances of deep learning. We propose an architecture using multimodal convolutional neural networks for fast detection and localization of tools in RAS videos. To our knowledge, this approach will be the first to incorporate deep neural networks for tool detection and localization in RAS videos. Our architecture applies a Region Proposal Network (RPN), and a multimodal two stream convolutional network for object detection, to jointly predict objectness and localization on a fusion of image and temporal motion cues. Our results with an Average Precision (AP) of 91% and a mean computation time of 0:1 seconds per test frame detection indicate that our study is superior to conventionally used methods for medical imaging while also emphasizing the benefits of using RPN for precision and efficiency. We also introduce a new dataset, ATLAS Dione, for RAS video understanding. Our dataset provides video data of ten surgeons from Roswell Park Cancer Institute (RPCI) (Buffalo, NY) performing six different surgical tasks on the daVinci Surgical System (dVSSR ) with annotations of robotic tools per frame.","authors":["Duygu Sarikaya","Jason J. Corso","Khurshid A Guru"],"meta":["February 2017IEEE Transactions on Medical Imaging PP(99):1-1","DOI:10.1109/TMI.2017.2665671"],"references":["301848383_EndoNet_A_Deep_Architecture_for_Recognition_Tasks_on_Laparoscopic_Videos","323290155_Surgical_performance_assessment","319770820_Histograms_of_Oriented_Gradients_for_Human_Detection","319770430_Rich_feature_hierarchies_for_accurate_object_detection_and_semantic_segmentation","319770284_Edge_Boxes_Locating_Object_Proposals_from_Edges","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","319769911_Faster_R-CNN_Towards_Real-Time_Object_Detection_with_Region_Proposal_Networks","313527089_Distinctive_image_features_from_scale-invariant_key_points","310752533_Visualizing_and_understanding_convolutional_networks","308167545_Marker-less_articulated_surgical_tool_detection"]}