{"id":"313451485_Predicting_taxi_demand_at_high_spatial_resolution_Approaching_the_limit_of_predictability","abstract":"In big cities, taxi service is imbalanced. In some areas, passengers wait too long for a taxi, while in others, many taxis roam without passengers. Knowledge of where a taxi will become available can help us solve the taxi demand imbalance problem. In this paper, we employ a holistic approach to predict taxi demand at high spatial resolution. We showcase our techniques using two real-world data sets, yellow cabs and Uber trips in New York City, and perform an evaluation over 9,940 building blocks in Manhattan. Our approach consists of two key steps. First, we use entropy and the temporal correlation of human mobility to measure the demand uncertainty at the building block level. Second, to identify which predictive algorithm can approach the theoretical maximum predictability, we implement and compare three predictors: the Markov predictor (a probability-based predictive algorithm), the Lempel-Ziv-Welch predictor (a sequence-based predictive algorithm), and the Neural Network predictor (a predictive algorithm that uses machine learning). The results show that predictability varies by building block and, on average, the theoretical maximum predictability can be as high as 83%. The performance of the predictors also vary: the Neural Network predictor provides better accuracy for blocks with low predictability, and the Markov predictor provides better accuracy for blocks with high predictability. In blocks with high maximum predictability, the Markov predictor is able to predict the taxi demand with an 89% accuracy, 11% better than the Neural Network predictor, while requiring only 0.03% computation time. These findings indicate that the maximum predictability can be a good metric for selecting prediction algorithms.","authors":["Kai Zhao","Denis Khryashchev","Juliana Freire","Claudio Silva"],"meta":["December 2016","DOI:10.1109/BigData.2016.7840676","Conference: 2016 IEEE International Conference on Big Data (Big Data)"],"references":["301857650_Automatic_City_Region_Analysis_for_Urban_Routing","301840343_Data-Driven_Robust_Taxi_Dispatch_under_Demand_Uncertainties","320704212_Data-Driven_Robust_Taxi_Dispatch_Under_Demand_Uncertainties","314237638_R-trees_a_dynamic_index_structure_for_spatial_searching","311159311_Understanding_Mobile_Traffic_Patterns_of_Large_Scale_Cellular_Towers_in_Urban_Environment","308729939_Inferring_Unmet_Demand_from_Taxi_Probe_Data","304298486_Automatic_City_Region_Analysis_for_Urban_Routing","279812859_ChangiNOW_a_mobile_application_for_efficient_taxi_allocation_at_airports","278647805_Taxi_Demand_Forecasting_Based_on_Taxi_Probe_Data_by_Neural_Network","275218893_Measuring_Variability_of_Mobility_Patterns_from_Multiday_Smart-card_Data"]}