{"id":"313423477_The_Effectiveness_of_Immersive_Multimedia_Learning_with_Peer_Support_on_English_Speaking_and_Reading_Aloud","abstract":"This study investigated the impacts of the immersive multimedia learning strategy with peer support on production skills in reading and speaking. Moreover, the effects of it on performance were investigated by student achievement. The quasi-experimental design with post-test was employed for the study. 80 first-year university students enrolled in English as a foreign language course were selected for this study. Data were analysed using one-way ANOVA. The findings showed that the immersive multimedia learning with peer support group reported significantly better performance in all measures of oral production for reading and speaking. Analyses obtained by achievement showed that the high achievement students in the immersive multimedia learning with peer support group reported significantly better performance in all measures of oral production only for speaking while the low achievement students in the immersive multimedia learning with peer supported group reported significantly better performance in all measures of oral production for reading and speaking. These findings showed that the immersive multimedia technique with peer support reduced the use of code-switching strategies among the students and enabled them to develop oral production skills in English approaching the patterns of native speakers especially among low achievement students.","authors":["Asnawi Muslem","Merza Abbas"],"meta":["January 2017International Journal of Instruction 10(1):203-218","DOI:10.12973/iji.2017.10113a"],"references":["304276680_Using_a_Multimedia-Based_Program_for_Developing_Student_Teachers'_EFL_Speaking_Fluency_Skills","274934273_The_Effects_of_Multimedia_Task-Based_Language_Teaching_on_EFL_Learners'_Oral_L2_Production","255638397_Immersion_Education_for_the_Millennium_What_We_Have_Learned_from_30_Years_of_Research_on_Second_Language_Immersion","250185536_Language_Moves_The_Place_of_Foreign_Languages_in_Classroom_Teaching_and_Learning","231893432_Toward_a_lexical_processing_model_for_the_study_of_second_language_vocabulary_acquisition","279573933_Blended_learning_using_video-based_blogs_Public_speaking_for_English_as_a_second_language_students","274810024_Speaking_From_Intention_to_Articulation","249024745_Peer_Teaching_and_Learning_Co-constructing_Language_in_a_Dual_Language_First_Grade","241682656_Fluency_and_anxiety_in_self-access_speaking_tasks_The_influence_of_environment","231886205_CALLing_for_Help_Researching_Language_Learning_Strategies_Using_Help_Facilities_in_a_Web-Based_Multimedia_Program"]}