{"id":"313448667_Big_Data_in_Smart_Farming_-_A_review","abstract":"Smart Farming is a development that emphasizes the use of information and communication technology in the cyber-physical farm management cycle. New technologies such as the Internet of Things and Cloud Computing are expected to leverage this development and introduce more robots and artificial intelligence in farming. This is encompassed by the phenomenon of Big Data, massive volumes of data with a wide variety that can be captured, analysed and used for decision-making. This review aims to gain insight into the state-of-the-art of Big Data applications in Smart Farming and identify the related socio-economic challenges to be addressed. Following a structured approach, a conceptual framework for analysis was developed that can also be used for future studies on this topic. The review shows that the scope of Big Data applications in Smart Farming goes beyond primary production; it is influencing the entire food supply chain. Big data are being used to provide predictive insights in farming operations, drive real-time operational decisions, and redesign business processes for game-changing business models. Several authors therefore suggest that Big Data will cause major shifts in roles and power relations among different players in current food supply chain networks. The landscape of stakeholders exhibits an interesting game between powerful tech companies, venture capitalists and often small start-ups and new entrants. At the same time there are several public institutions that publish open data, under the condition that the privacy of persons must be guaranteed. The future of Smart Farming may unravel in a continuum of two extreme scenarios: 1) closed, proprietary systems in which the farmer is part of a highly integrated food supply chain or 2) open, collaborative systems in which the farmer and every other stakeholder in the chain network is flexible in choosing business partners as well for the technology as for the food production side. The further development of data and application infrastructures (platforms and standards) and their institutional embedment will play a crucial role in the battle between these scenarios. From a socio-economic perspective, the authors propose to give research priority to organizational issues concerning governance issues and suitable business models for data sharing in different supply chain scenarios.","authors":["Sjaak Wolfert","Lan Ge","Cor Verdouw","M.J. Bogaardt"],"meta":["May 2017Agricultural Systems 153:69-80","DOI:10.1016/j.agsy.2017.01.023"],"references":["348135215_An_integrated_framework_for_wireless_sensor_network_management","306028698_Systemic_perspectives_on_scaling_agricultural_innovations_A_review","304900564_Internet_of_Food_and_Farm_2020","299379163_A_formal_definition_of_Big_Data_based_on_its_essential_features","313472605_Design_of_PI_controller_with_double-loop_structure_for_a_turboshaft","313472547_The_research_and_application_prospect_of_big_data_in_smart_agriculture_J","310826982_RFID_Deployment_and_Use_in_the_Dairy_Value_Chain_Applications_Current_Issues_and_Future_Research_Directions","309405300_HortiCube_A_Platform_for_Transparent_Trusted_Data_Sharing_in_the_Food_Supply_Chain","306154155_How_Smart_Connected_Products_are_Transforming_Companies","293234483_Big_data_analysis_medical_agriculture_in_the_environmental_field"]}