{"id":"313508386_Interprofessional_Medical-Legal_Education_of_Medical_Students_Assessing_the_Benefits_for_Addressing_Social_Determinants_of_Health","abstract":"Problem: \nScreening tools exist to help identify patient issues related to social determinants of health (SDH), but solutions to many of these problems remain elusive to health care providers as they require legal solutions. Interprofessional medical-legal education is essential to optimizing health care delivery.\n\nApproach: \nIn 2011, the authors implemented a four-session didactic interprofessional curriculum on medical-legal practice for third-year medical students at Morehouse School of Medicine. This program, also attended by law students, focused on interprofessional collaboration to address client/patient SDH issues and health-harming legal needs. In 2011-2014, the medical students participated in pre- and postintervention surveys designed to determine their awareness of SDH's impact on health as well as their attitudes toward screening for SDH issues and incorporating resources, including a legal resource, to address them. Mean ratings were compared between pre- and postintervention respondent cohorts using independent-sample t tests.\n\nOutcomes: \nOf the 222 medical students who participated in the program, 102 (46%) completed the preintervention survey and 100 (45%) completed the postintervention survey. Postintervention survey results indicated that students self-reported an increased likelihood to screen patients for SDH issues and an increased likelihood to refer patients to a legal resource (P < .001).\n\nNext steps: \nIncorporating interprofessional medical-legal education into undergraduate medical education may result in an increased likelihood to screen patients for SDH and to refer patients with legal needs to a legal resource. In the future, an additional evaluation to assess the curriculum's long-term impact will be administered prior to graduation.","authors":["Robert Pettignano","Lisa R Bliss","Susan Mclaren","Sylvia B Caley"],"meta":["February 2017Academic medicine: journal of the Association of American Medical Colleges 92(9)","DOI:10.1097/ACM.0000000000001581"],"references":["258064607_Effects_of_childhood_poverty_and_chronic_stress_on_emotion_regulatory_brain_function_in_adulthood","233938176_Relations_Between_Housing_Characteristics_and_the_Well-Being_of_Low-Income_Children_and_Adolescents","41422079_Socioeconomic_Disparities_in_Health_in_the_United_States_What_the_Patterns_Tell_Us","7802244_Subsidized_Housing_and_Children's_Nutritional_Status_Data_From_a_Multisite_Surveillance_Study"]}