{"id":"313540863_A_Precision_Medicine_Initiative_for_Alzheimer's_disease_the_road_ahead_to_biomarker-guided_integrative_disease_modeling","abstract":"After intense scientific exploration and more than a decade of failed trials, Alzheimer’s disease (AD) remains a fatal global epidemic. A traditional research and drug development paradigm continues to target heterogeneous late-stage clinically phenotyped patients with single 'magic bullet' drugs. Here, we propose that it is time for a paradigm shift towards the implementation of precision medicine (PM) for enhanced risk screening, detection, treatment, and prevention of AD. The overarching structure of how PM for AD can be achieved will be provided through the convergence of breakthrough technological advances, including big data science, systems biology, genomic sequencing, blood-based biomarkers, integrated disease modeling and P4 medicine. It is hypothesized that deconstructing AD into multiple genetic and biological subsets existing within this heterogeneous target population will provide an effective PM strategy for treating individual patients with the specific agent(s) that are likely to work best based on the specific individual biological make-up.\nThe Alzheimer’s Precision Medicine Initiative (APMI) is an international collaboration of leading interdisciplinary clinicians and scientists devoted towards the implementation of PM in Neurology, Psychiatry and Neuroscience. It is hypothesized that successful realization of PM in AD and other neurodegenerative diseases will result in breakthrough therapies, such as in oncology, with optimized safety profiles, better responder rates and treatment responses, particularly through biomarker-guided early preclinical disease-stage clinical trials.","authors":["Harald J Hampel","Sid E O'Bryant","Stanley Durrleman","Erfan Younesi"],"meta":["February 2017Climacteric 20(2):1-12","DOI:10.1080/13697137.2017.1287866","Project: The Future of Diagnosis, Detection, Dissection and Therapy of Alzheimer's Disease through Precision Medicine, Systems Theory, Big Data Science and Integrated Disease Modeling"],"references":["318759592_Association_of_blood_lipids_with_Alzheimer's_disease_A_comprehensive_lipidomics_analysis","309900495_Informatic_deconvolution_of_biased_GPCR_signaling_mechanisms_from_in_vivo_pharmacological_experimentation","309482648_PRECISION_MEDICINE_-_The_Golden_Gate_for_Detection_Treatment_and_Prevention_of_Alzheimer's_Disease","309366268_Clinical_heterogeneity_in_familial_Alzheimer's_disease","306119792_Association_of_blood_lipids_with_Alzheimer's_Disease_a_comprehensive_lipidomics_analysis","334761935_TREM2_variants_in_Alzheimer's_disease","321588282_The_Paradox_of_Research_on_Dementia-Alzheimer's_Disease","310628388_Blood-based_biomarkers_in_Alzheimer_disease_Current_state_of_the_science_and_a_novel_collaborative_paradigm_for_advancing_from_discovery_to_clinic","308202863_Neuroproteomic_tools_for_battling_Alzheimer's_disease","306157516_Initial_sequencing_and_analysis_of_the_human_genome"]}