{"id":"313584061_3D_Scattering_Transforms_for_Disease_Classification_in_Neuroimaging","abstract":"Classifying neurodegenerative brain diseases in MRI aims at correctly assigning discrete labels to MRI scans. Such labels usually refer to a diagnostic decision a learner infers based on what it has learned from a training sample of MRI scans. Classification from MRI voxels separately typically does not provide independent evidence towards or against a class; the information relevant for classification is only present in the form of complicated multivariate patterns (or “features”). Deep learning solves this problem by learning a sequence of non-linear transformations that result in feature representations that are better suited to classification. Such learned features have been shown to drastically outperform hand-engineered features in computer vision and audio analysis domains. However, applying the deep learning approach to the task of MRI classification is extremely challenging, because it requires a very large amount of data which is currently not available. We propose to instead use a three dimensional scattering transform, which resembles a deep convolutional neural network but has no learnable parameters. Furthermore, the scattering transform linearizes diffeomorphisms (due to e.g. residual anatomical variability in MRI scans), making the different disease states more easily separable using a linear classifier. In experiments on brain morphometry in Alzheimer’s disease, and on white matter microstructural damage in HIV, scattering representations are shown to be highly effective for the task of disease classification. For instance, in semi-supervised learning of progressive versus stable MCI, we reach an accuracy of 82.7%. We also present a visualization method to highlight areas that provide evidence for or against a certain class, both on an individual and group level.","authors":["Tameem Adel","Taco Cohen","Matthan Caan","Max Welling"],"meta":["February 2017NeuroImage: Clinical 14(C)","DOI:10.1016/j.nicl.2017.02.004"],"references":["301879329_Deep_Networks_with_Stochastic_Depth","284576917_Glove_Global_Vectors_for_Word_Representation","281599259_Scattering_Representations_for_Recognition","279310175_Attention-Based_Models_for_Speech_Recognition","279161552_Precuneus_and_Cingulate_Cortex_Atrophy_and_Hypometabolism_in_Patients_with_Alzheimer's_Disease_and_Mild_Cognitive_Impairment_MRI_and_18_F-FDG_PET_Quantitative_Analysis_Using_FreeSurfer","319770414_Identity_Mappings_in_Deep_Residual_Networks","300151231_Deep_learning_with_non-medical_training_used_for_chest_pathology_identification","299342860_Single_Subject_Prediction_of_Brain_Disorders_in_Neuroimaging_Promises_and_Pitfalls","290650431_Word_embeddings_for_speech_recognition","284076343_White_matter_structure_alterations_in_HIV-1-infected_men_with_sustained_suppression_of_viraemia_on_treatment"]}