{"id":"313591161_Revisiting_Software_Engineering_in_the_Social_Era","abstract":"This paper discusses the possible changes that software engineering will have to go through in response to the challenges and issues associated with social media. Indeed, people have never been so connected like nowadays by forming spontaneous relations with others (even strangers) and engaging in ad-hoc interactions. The Web is the backbone of this new social era – an open, global, ubiquitous, and pervasive platform for today's society and world - suggesting that “everything” can socialize or be socialized. This paper also analyzes the evolution of software engineering as a discipline, points out the characteristics of social systems, and finally presents how these characteristics could affect software engineering's models and practices. It is expected that social systems' characteristics will make software engineering evolve one more time to tackle and address the social era's challenges and issues, respectively.","authors":["Vanilson Burégio","Ejub Kajan","Mohamed Sellami","Noura Faci"],"meta":["October 2016International Journal of Systems and Service-Oriented Engineering 6(4):36-46","DOI:10.4018/IJSSOE.2016100103","Project: Theory and Practice of Social Enterprises"],"references":["276175116_Using_popular_social_network_sites_to_support_requirements_elicitation_prioritization_and_negotiation","272385846_An_Architecture_and_Guiding_Framework_for_the_Social_Enterprise","264199280_Toward_Connected_Shared_Experiences","263856125_When_Things_Matter_A_Data-Centric_View_of_the_Internet_of_Things","263499441_The_process_and_structure_of_user_participation_A_BPM_system_implementation_case_study","308344201_A_Survey_of_the_Use_of_Crowdsourcing_in_Software_Engineering","288855909_Crowdsourcing_in_Software_Engineering_Models_Motivations_and_Challenges","274422508_Commerce_e-commerce_and_m-commerce","273185801_What_Next_Advances_in_Software-Driven_Industries","272822906_Towards_an_Open_Architecture_Model_for_Web_and_Mobile_Software_Characteristics_and_Validity_Properties"]}