{"id":"313519670_Unveiling_Eilenberg-type_Correspondences_Birkhoff's_Theorem_for_finite_Algebras_Duality","abstract":"The purpose of the present paper is to show that: Eilenberg-type correspondences = Birkhoff's theorem for (finite) algebras + duality. We consider algebras for a monad T on a category D and we study (pseudo)varieties of T-algebras. Pseudovarieties of algebras are also known in the literature as varieties of finite algebras. Two well-known theorems that characterize varieties and pseudovarieties of algebras play an important role here: Birkhoff's theorem and Birkhoff's theorem for finite algebras, the latter also known as Reiterman's theorem. We prove, under mild assumptions, a categorical version of Birkhoff's theorem for (finite) algebras to establish a one-to-one correspondence between (pseudo)varieties of T-algebras and (pseudo)equational T-theories. Now, if C is a category that is dual to D and B is the comonad on C that is the dual of T, we get a one-to-one correspondence between (pseudo)equational T-theories and their dual, (pseudo)coequational B-theories. Particular instances of (pseudo)coequational B-theories have been already studied in language theory under the name of \"varieties of languages\" to establish Eilenberg-type correspondences. All in all, we get a one-to-one correspondence between (pseudo)varieties of T-algebras and (pseudo)coequational B-theories, which will be shown to be exactly the nature of Eilenberg-type correspondences.","authors":["Julian Salamanca"],"meta":["February 2017"],"references":["301844365_One_Eilenberg_Theorem_to_Rule_Them_All","271218746_Varieties_of_Languages_in_a_Category","281836759_The_dual_equivalence_of_equations_and_coequations_for_automata","268533165_Syntactic_semiring_of_a_language_Extended_abstract","267482811_Generalized_Eilenberg_Theorem_I_Local_Varieties_of_Languages","266750506_Varieties_and_finite_closure_conditions","266520591_Category_Theory","265354140_Categories_for_the_working_mathematician_2nd_ed","262256066_An_Eilenberg_theorem_for_-languages","256269813_P-varieties_-_a_signature_independent_characterization_of_varieties_of_ordered_algebras"]}