{"id":"313592355_Emergence_of_Home_Manufacturing_in_the_Developed_World_Return_on_Investment_for_Open-Source_3-D_Printers","abstract":"Through reduced 3-D printer cost, increased usability, and greater material selection, additive manufacturing has transitioned from business manufacturing to the average prosumer. This study serves as a representative model for the potential future of 3-D printing in the average American household by employing a printer operator who was relatively unfamiliar with 3-D printing and the 3-D design files of common items normally purchased by the average consumer. Twenty-six items were printed in thermoplastic and a cost analysis was performed through comparison to comparable, commercially available products at a low and high price range. When compared to the low-cost items, investment in a 3-D printer represented a return of investment of over 100% in five years. The simple payback time for the high-cost comparison was less than 6 months, and produced a 986% return. Thus, fully-assembled commercial open source 3-D printers can be highly profitable investments for American consumers. Finally, as a preliminary gauge of the effect that widespread prosumer use of 3-D printing might have on the economy, savings were calculated based on the items’ download rates from open repositories. Results indicate that printing these selected items have already saved prosumers over $4 million by substituting for purchases.","authors":["Emily E. Petersen","Joshua M Pearce"],"meta":["February 2017","DOI:10.3390/technologies5010007","Project: The Do-It-Yourself approach and open source solutions applied to all fields of our life (even for research purposes)"],"references":["309903317_Distributed_manufacturing_with_3-D_printing_a_case_study_of_recreational_vehicle_solar_photovoltaic_mounting_systems","291375376_Global_value_chains_from_a_3D_printing_perspective","284028741_Open-source_self-replicating_3-D_printer_factory_for_small-business_manufacturing","281361072_Return_on_investment_for_open_source_scientific_hardware_development","279951905_3D_printer_selection_A_decision-making_evaluation_and_ranking_model","279171782_One_Discount_Rate_Fits_All_The_Regressive_Effects_of_DOE's_Energy_Efficiency_Rule","302203148_Individual_discount_rates_and_the_purchase_and_utilization_of_energy-using_durables","291293162_3D_printing_and_humanity's_first_imperfect_replicator","289283920_Economies_of_scale_concentration_and_the_condition_of_entry_in_twenty_manufacturing_industries","281562891_How_to_Make_Almost_Anything_The_Digital_Fabrication_Revolution"]}