{"id":"313585055_Game_Development_for_Computer_Science_Education","abstract":"Games can be a valuable tool for enriching computer science education, since they can facilitate a number of conditions that promote learning: student motivation, active learning, adaptivity, collaboration, and simulation. Additionally, they provide the instructor the ability to collect learning metrics with relative ease. As part of 21st Annual Conference on Innovation and Technology in Computer Science Education (ITiCSE 2016), the Game Development for Computer Science Education working group convened to examine the current role games play in computer science (CS) education, including where and how they fit into CS education. Based on reviews of literature, academic research, professional practice, and a comprehensive list of games for computing education, we present this working group report. This report provides a summary of existing digital games designed to enrich computing education, an index of where these games may fit into a teaching paradigm using the ACM/IEEE Computer Science Curricula 2013 [13], and a guide to developing digital games designed to teach knowledge, skills, and attitudes related to computer science.","authors":["Chris Johnson","Zhiping Xiao","Ming Zhang","Monica McGill"],"meta":["July 2016","DOI:10.1145/3024906.3024908","Conference: the 2016 ITiCSE Working Group Reports","Projects: If Memory Serves: A game to teach pointersComputing EducationGames for Computer Science Education"],"references":["345982547_The_Art_of_Game_Design_A_Book_of_Lenses_Second_Edition","329649071_Communities_of_Play_Emergent_Cultures_in_Multiplayer_Games_and_Virtual_Worlds","317953663_Self-Efficacy_Toward_a_Unifying_Theory_of_Behavioral_Change","317953561_Mind_in_society_The_development_of_higher_psychological_processes","314567142_Flow_The_Psychology_of_Optimal_Experience","313196550_Assessment_and_classroom_learning_Assessment_in_education_Principles","313074236_Towards_a_psychology_of_optimal_experience","312984568_Perceived_usefulness_perceived_ease_and_user_acceptance_of_information_technology","310513642_Dimensionalizing_Cultures_The_Hofstede_Model_in_Context","304671895_The_Game_Definition_Game_A_Review"]}