{"id":"313690993_Understanding_knowledge_areas_in_curriculum_through_text_mining_from_course_materials","abstract":"Curriculum analysis is attracting widespread interest in educational field. There are two main approaches: (i) human-based and (ii) text-based assessments. Although an evaluation by teachers and learners are widely used, it is inconvenient and time-consuming. Also, the results absolutely rely on individual attitude. The text-based approach aims to directly evaluate the course syllabus; however, there is only a course description in the syllabus, so this cannot really express the actual course contents. In this paper, we present an automatic text-based curriculum analysis that straightforwardly assesses entire course materials. Our approach employs a well-known text-mining technique that extracts keywords using TF-IDF. The analysis is based on keywords from the course materials matching to the keywords from online documents, which is similar to the domain expert. Moreover, a new measurement is proposed to quantify associations between course materials and online documents using amounts of matching keywords. The experiment was conducted on materials of three subjects collected from five top universities mapping to the latest Computer Engineering Curricular Guideline (CE2016). The results illustrate significant relations among courses from different universities and CE2016. To further analyze the courses, each of them are visualized using radar charts.","authors":["Kornraphop Kawintiranon","Peerapon Vateekul","Atiwong Suchato","Proadpran Punyabukkana"],"meta":["December 2016","DOI:10.1109/TALE.2016.7851788","Conference: 2016 IEEE International Conference on Teaching, Assessment, and Learning for Engineering (TALE)"],"references":["307537898_Course_Content_Analysis_An_Initiative_Step_toward_Learning_Object_Recommendation_Systems_for_MOOC_Learners","283348079_Curriculum_Analysis_of_CS_Departments_Based_on_CS2013_by_Simplified_Supervised_LDA","257714749_Machine_Learning-based_Syllabus_Classification_toward_Automatic_Organization_of_Issue-oriented_Interdisciplinary_Curricula","316600283_Data_Mining_Concepts_and_Techniques","301476356_CE2016_Updated_computer_engineering_curriculum_guidelines","301408089_Toward_a_modern_curriculum_for_computer_engineering","295259681_Mapping_analysis_of_CS2013_by_supervised_LDA_and_isomap","278306769_Spearman_Rank_Correlation_Coefficient","270878396_Automatic_Keyphrase_Extraction_A_Survey_of_the_State_of_the_Art","258991781_A_Comparison_of_the_Core_Aspects_of_the_ACMIEEE_Computer_Science_Curriculum_2013_Strawman_Report_with_the_Specified_Core_of_CC2001_and_CS2008_Review"]}