{"id":"313799976_Towards_Empowering_Hearing_Impaired_Students'_Skills_in_Computing_and_Technology","abstract":"Studies have shown that deaf and hearing-impaired students have many difficulties in learning applied disciplines such as Medicine, Engineering, and Computer Programming. This study aims to investigate the readiness of deaf students to pursue higher education in applied sciences, more specifically in computer science. This involves investigating their capabilities in computer skills and applications. Computer programming is an integral component in the technological field that can facilitate the development of further scientific advances. Devising a manner of teaching the deaf and hearing-impaired population will give them an opportunity to contribute to the technology sector. This would allow these students to join the scientific world when otherwise; they are generally unable to participate because of the limitations they encounter. The study showed that deaf students in Jeddah are eager to continue their higher education and that a large percentage of these students are keen on studying computer science, particularly if they are provided with the right tools.","authors":["Nihal Esam","Areej Abbas","Paul John Krause"],"meta":["January 2017International Journal of Advanced Computer Science and Applications 8(1)","DOI:10.14569/IJACSA.2017.080116"],"references":["290139264_Towards_Communication_and_Information_Access_for_Deaf_People","281056633_Thinking_Styles_and_University_Self-Efficacy_Among_Deaf_Hard-of-Hearing_and_Hearing_Students","267410465_Arabic_Sign_Language_ArSL_Recognition_System_Using_HMM","265218047_The_Management_of_Hearing_Impaired_Saudi_Children_An_Epidemiological_Survey","262595709_Deaf_students_in_higher_education_Reflections_on_inclusion","255621509_Providing_Learning_Support_for_dDeaf_and_Hearing_Impaired_Students_Undertaking_Fieldwork_and_Related_Activities","348861513_The_Resilience_of_Language_What_Gesture_Creation_in_Deaf_Children_Can_Tell_Us_About_How_All_Children_Learn_Language","288452041_Show_of_hands_A_natural_history_of_sign_language","279656334_A_Multimedia_System_for_Learning_Arabic_Sign_Language_Tawasoul","258110590_A_Proposed_Web_Based_Framework_E-Learning_and_Dictionary_System_for_Deaf_Arab_Students"]}