{"id":"313743399_A_Survey_on_Successors_of_LEACH_Protocol","abstract":"Even after 16 years of existence, Low Energy Adaptive Clustering Hierarchy (LEACH) protocol is still gaining the attention of the research community working in the area of Wireless Sensor Network (WSN). This itself shows the importance of this protocol. Researchers have come up with various and diverse modifications of the LEACH protocol. Successors of LEACH protocol are now available from single hop to multi-hop scenarios. Extensive work has already been done related to LEACH and it is a good idea for a new research in the field of WSN to go through LEACH and its variants over the years. This paper surveys the variants of LEACH routing protocols proposed so far and discusses the enhancement and working of them. This survey classifies all the protocols in two sections namely single hop communication and multi-hop communication based on data transmission from the cluster head to the base station. A comparitive analysis using nine different parameters like energy efficiency, overhead, scalability complexity etc. has been provided in a chronological fashion. The article also discusses the strong and weak points of each and every variants of LEACH. Finally the paper concludes with suggestions on future research domains in the area of WSN.","authors":["Sunil Kumar Singh","Prabhat Kumar","Jyoti Prakash Singh"],"meta":["February 2017IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2017.2666082","Project: Energy Efficient WSN"],"references":["305035047_Improvement_on_LEACH_protocol_of_a_wide-area_wireless_sensor_network","304289962_Enhanced_modified_LEACH_EMODLEACH_protocol_for_WSN","313636700_Directed_diffusion_for_wireless_sensor_networking","313150859_Energyefficient_communication_protocol_for_wireless_microsensor_networks","312108843_Energy-efficient_communication_protocol_for_wireless_microsensor_networks","310831015_Rumor_routing_algorthim_for_sensor_networks","308498813_Enhancing_multihop_routing_protocols_in_wireless_sensor_networks_using_LEACH-1R","306312072_Enhancements_of_LEACH_Algorithm_for_Wireless_Networks_A_Review","305728527_Improvement_for_LEACH_Algorithm_in_Wireless_Sensor_Network","305304688_Energy_efficient_spectrum_aware_clustering_for_cognitive_sensor_networks_CogLEACH-C"]}