{"id":"313787603_A_Review_of_Wearable_Technologies_for_Elderly_Care_that_Can_Accurately_Track_Indoor_Position_Recognize_Physical_Activities_and_Monitor_Vital_Signs_in_Real_Time","abstract":"Rapid growth of the aged population has caused an immense increase in the demand for healthcare services. Generally, the elderly are more prone to health problems compared to other age groups. With effective monitoring and alarm systems, the adverse effects of unpredictable events such as sudden illnesses, falls, and so on can be ameliorated to some extent. Recently, advances in wearable and sensor technologies have improved the prospects of these service systems for assisting elderly people. In this article, we review state-of-the-art wearable technologies that can be used for elderly care. These technologies are categorized into three types: indoor positioning, activity recognition and real time vital sign monitoring. Positioning is the process of accurate localization and is particularly important for elderly people so that they can be found in a timely manner. Activity recognition not only helps ensure that sudden events (e.g., falls) will raise alarms but also functions as a feasible way to guide people’s activities so that they avoid dangerous behaviors. Since most elderly people suffer from age-related problems, some vital signs that can be monitored comfortably and continuously via existing techniques are also summarized. Finally, we discussed a series of considerations and future trends with regard to the construction of “smart clothing” system.","authors":["Zhihua Wang","Zhaochu Yang","Tao Dong"],"meta":["February 2017Sensors 17(2):341","DOI:10.3390/s17020341"],"references":["305695923_Scalable_Daily_Human_Behavioral_Pattern_Mining_from_Multivariate_Temporal_Data","303499651_RGB-D-based_Action_Recognition_Datasets_A_Survey","303256749_Ultra_Wideband_Indoor_Positioning_Technologies_Analysis_and_Recent_Advances","299401740_A_Comparative_Study_on_Human_Activity_Recognition_Using_Inertial_Sensors_in_a_Smartphone","320967002_A_Mental_Patient_Positioning_Management_System_in_Hospital_Based_on_ZigBee","308500128_Bio-magnetic_sensor_circuit_design_based_on_giant_magneto-impedance_effect","303931237_Deep_Convolutional_Neural_Networks_for_Human_Activity_Recognition_with_Smartphone_Sensors","303890632_Smartphone_Inertial_Sensor_Based_Indoor_Localization_and_Tracking_with_iBeacon_Corrections","301583577_From_smart_to_deep_Robust_activity_recognition_on_smartwatches_using_deep_learning","294257666_Monitoring_of_Vital_Signs_with_Flexible_and_Wearable_Medical_Devices"]}