{"id":"313784102_Anser_EMT_The_first_open-source_electromagnetic_tracking_platform_for_image-guided_interventions","abstract":"Purpose: \nElectromagnetic tracking is the gold standard for instrument tracking and navigation in the clinical setting without line of sight. Whilst clinical platforms exist for interventional bronchoscopy and neurosurgical navigation, the limited flexibility and high costs of electromagnetic tracking (EMT) systems for research investigations mitigate against a better understanding of the technology's characterisation and limitations. The Anser project provides an open-source implementation for EMT with particular application to image-guided interventions.\n\nMethods: \nThis work provides implementation schematics for our previously reported EMT system which relies on low-cost acquisition and demodulation techniques using both National Instruments and Arduino hardware alongside MATLAB support code. The system performance is objectively compared to other commercial tracking platforms using the Hummel assessment protocol.\n\nResults: \nPositional accuracy of 1.14?mm and angular rotation accuracy of [Formula: see text] are reported. Like other EMT platforms, Anser is susceptible to tracking errors due to eddy current and ferromagnetic distortion. The system is compatible with commercially available EMT sensors as well as the Open Network Interface for image-guided therapy (OpenIGTLink) for easy communication with visualisation and medical imaging toolkits such as MITK and 3D Slicer.\n\nConclusions: \nBy providing an open-source platform for research investigations, we believe that novel and collaborative approaches can overcome the limitations of current EMT technology.","authors":["Herman Alexander Jaeger","Alfred Michael Franz","Kilian O 'donoghue","Alexander Seitel"],"meta":["March 2017International Journal of Computer Assisted Radiology and Surgery 12(3)","DOI:10.1007/s11548-017-1568-7","Projects: Open Source Software for Computer Assisted InterventionsAssessment of Electromagnetic Tracking in Clinical EnvironmentsElectromagnetic tracking and navigation"],"references":["299380416_Navigational_Bronchoscopy_for_Early_Lung_Cancer_A_Road_to_Therapy","278621593_International_Commission_on_Non-Ionizing_Radiation_Protection_ICNIRP_Guidelines_for_Limiting_Exposure_to_Electric_Fields_Induced_by_Movement_of_the_Human_Body_in_a_Static_Magnetic_Field_and_by_Time-Va","274872737_Catheter_Position_Tracking_System_Using_Planar_Magnetics_and_Closed_Loop_Current_Control","274095102_Planar_Magnetic_Shielding_for_Use_With_Electromagnetic_Tracking_Systems","273160901_Low_Cost_Super-Nyquist_Asynchronous_Demodulation_for_Use_in_EM_Tracking_Systems","270658480_Evaluation_of_a_novel_tracking_system_in_a_breathing_lung_model","262228180_Electromagnetic_Tracking_in_Medicine-A_Review_of_Technology_Validation_and_Applications","303738981_On-demand_calibration_and_evaluation_for_electromagnetically_tracked_laparoscope_in_augmented_reality_visualization","265392169_Electromagnetic_tracking_in_surgical_and_interventional_environments_usability_study","242872141_3-D_Magnetic_Tracking_of_a_Single_Subminiature_Coil_with_a_Large_2-D_Array_of_Uniaxial_Transmitters"]}