{"id":"313783018_Assessing_Human_Activity_in_Elderly_People_Using_Non-Intrusive_Load_Monitoring","abstract":"The ageing of the population, and their increasing wish of living independently, are motivating the development of welfare and healthcare models. Existing approaches based on the direct heath-monitoring using body sensor networks (BSN) are precise and accurate. Nonetheless, their intrusiveness causes non-acceptance. New approaches seek the indirect monitoring through monitoring activities of daily living (ADLs), which proves to be a suitable solution. ADL monitoring systems use many heterogeneous sensors, are less intrusive, and are less expensive than BSN, however, the deployment and maintenance of wireless sensor networks (WSN) prevent them from a widespread acceptance. In this work, a novel technique to monitor the human activity, based on non-intrusive load monitoring (NILM), is presented. The proposal uses only smart meter data, which leads to minimum intrusiveness and a potential massive deployment at minimal cost. This could be the key to develop sustainable healthcare models for smart homes, capable of complying with the elderly people’ demands. This study also uses the Dempster-Shafer theory to provide a daily score of normality with regard to the regular behavior. This approach has been evaluated using real datasets and, additionally, a benchmarking against a Gaussian mixture model approach is presented.","authors":["José M. Alcalá","Jesús Ureña","Álvaro Hernández","David Gualda"],"meta":["February 2017Sensors 17(2):351","DOI:10.3390/s17020351"],"references":["309609816_Flexible_Graphene_Electrodes_for_Prolonged_Dynamic_ECG_Monitoring","305824465_Physical_Behavior_in_Older_Persons_during_Daily_Life_Insights_from_Instrumented_Shoes","305673970_Detecting_Health_and_Behavior_Change_by_Analyzing_Smart_Home_Sensor_Data","303834184_A_Survey_on_Wireless_Body_Area_Networks_for_eHealthcare_Systems_in_Residential_Environments","297608743_Monitoring_Activities_of_Daily_Living_in_Smart_Homes_Understanding_human_behavior","308872176_Activity_supervision_tool_using_Non-Intrusive_Load_Monitoring_Systems","308871724_Real_time_composite_user_activity_modelling_using_hybrid_approach_for_recognition","308818031_Activity_Recognition_Based_on_Streaming_Sensor_Data_for_Assisted_Living_in_Smart_Homes","299449679_Detecting_Anomalies_in_Activities_of_Daily_Living_of_Elderly_Residents_via_Energy_Disaggregation_and_Cox_Processes","282419274_Modeling_Patterns_of_Activities_using_Activity_Curves"]}