{"id":"313774220_Proposed_MABC-SDAIR_algorithm_for_sense-based_distributed_Arabic_information_retrieval","abstract":"Information Retrieval (IR) is the field of computer science that deals with the storage, searching, and retrieving of the documents that satisfy the user need. Distributed Arabic Information Retrieval (DAIR) is a model enables a user to access many searchable Arabic documents reside in different locations. DAIR is more complex than the centralized Arabic IR (AIR) because it requires addressing two significant additional problems that are the resource selection and the results merging. The Arabic language is a rich in multiple meanings (senses) in a lot of words and the tasking to find the appropriate meaning is a key demand in most of the AIR applications. This paper aims to improve the efficiency of the DAIR systems through using an algorithm belong to the swarm intelligence called Artificial Bee Colony (ABC) algorithm and to improve the result quality through using the query expansion. The MABC-SDAIR algorithm is the search approach used in this work. It aims to search the most relevant documents while at the same time it searches the best synonyms for the query expansion process. The experimental results exhibit the performance superiority of the proposed system over the traditional DAIR system that has a non-expanded query.","authors":["Alia Karim","Abdul wahab Hassan","Mustafa Jasim Hadi"],"meta":["March 2017"],"references":["311557301_Sense-Based_Information_Retrieval_Using_Artificial_Bee_Colony_Approach","307993178_Mining_Documents_and_Sentiments_in_Cross-lingual_Context","281856153_A_Comparative_Study_on_Arabic_Stemmers","271964572_Mining_Documents_and_Sentiments_in_Cross-lingual_Context","267921679_Semantic_Query_Expansion_for_Arabic_Information_Retrieval","266857829_A_new_fuzzy_logic_based_ranking_function_for_efficient_Information_Retrieval_system","265274594_AUTOMATIC_QUERY_EXPANSION_FOR_ARABIC_TEXT_RETRIEVAL_BASED_ON_ASSOCIATION_AND_SIMILARITY_THESAURUS","314807922_Approaches_to_collection_selection_and_results_merging_for_distributed_information_retrieval","287967393_Integrating_Social_Profile_to_improve_the_Source_Selection_and_the_Result_Merging_Process_in_Distributed_Information_Retrieval","255638348_An_Idea_Based_on_Honey_Bee_Swarm_for_Numerical_Optimization_Technical_Report_-_TR06"]}