{"id":"313768789_The_Impact_of_Time_Management_on_the_Students'_Academic_Achievements","abstract":"The aim of the current research was to determine the relationship between the time management skills and academic achievement of the students. Time management is very important and it may actually affect individual's overall performance and achievements. However, all of these are related by how individuals manage their time to suit their daily living or to make it flow steadily with their routines. Conducive settings and environment will surely promote positive outcomes to the students, besides having good lectures given by their teachers. Nevertheless, students' time management can be considered as one of the aspect that can move a student to be a good student. A good time management is vital for students to shine. However, some of the students do not have a good time management skills that has negatively affect their life and their academics. The usage of time by students in higher education institutions is related to their daily routines and activities. Students' time management can also affect stress level of students as they need to cope with their tasks and their personal achievements. In this regard, the data was collected from the students of Qurtuba University of Science and Technology to analyze that how effectively they are managing their time for achieving their academic standards.","authors":["Shazia Nasrullah_Phd","Muhammad Saqib Khan"],"meta":["January 2015"],"references":["341580416_A1-THE_RELATIONSHIP_OF_TIME_MANAGEMENT_TO_ACADEMIC_PERFORMANCE_OF_MASTER_LEVEL_STUDENTS274754-255974","326522371_RELATIONSHIP_BETWEEN_THE_TIME_MANAGEMENT_BEHAVIOR_AND_ACADEMIC_SUCCESS","280247078_The_Role_of_Study_Skills_in_Academic_Achievement_of_Students_A_Closer_Focus_on_Gender","258190728_Time_Management_Paradoxes_and_Patterns","232573913_Effects_of_Time-Management_Practices_on_College_Grades","314537998_Study_of_Impact_of_Time_Management_on_Academic_Performance_of_College_Students","296909402_Put_time_on_your_side","275689922_Statistics_for_Management","275677304_Marketing_Research_Text_and_Cases","275621396_The_Practice_of_Social_Research"]}