{"id":"313744503_Academically_Adrift_Limited_Learning_on_College_Campuses","abstract":"In spite of soaring tuition costs, more and more students go to college every year. A bachelor’s degree is now required for entry into a growing number of professions. And some parents begin planning for the expense of sending their kids to college when they’re born. Almost everyone strives to go, but almost no one asks the fundamental question posed by Academically Adrift: are undergraduates really learning anything once they get there?\n\nFor a large proportion of students, Richard Arum and Josipa Roksa’s answer to that question is a definitive no. Their extensive research draws on survey responses, transcript data, and, for the first time, the state-of-the-art Collegiate Learning Assessment, a standardized test administered to students in their first semester and then again at the end of their second year. According to their analysis of more than 2,300 undergraduates at twenty-four institutions, 45 percent of these students demonstrate no significant improvement in a range of skills—including critical thinking, complex reasoning, and writing—during their first two years of college. As troubling as their findings are, Arum and Roksa argue that for many faculty and administrators they will come as no surprise—instead, they are the expected result of a student body distracted by socializing or working and an institutional culture that puts undergraduate learning close to the bottom of the priority list.\n\nAcademically Adrift holds sobering lessons for students, faculty, administrators, policy makers, and parents—all of whom are implicated in promoting or at least ignoring contemporary campus culture. Higher education faces crises on a number of fronts, but Arum and Roksa’s report that colleges are failing at their most basic mission will demand the attention of us all.","authors":["Richard Arum","Josipa Roksa"],"meta":["January 2011","Publisher: University of Chicago PressISBN: 9780226028576","Project: Facilitating student learning and reducing inequality"],"references":[]}