{"id":"313737083_Incremental_Deployment_and_Throughput_Maximization_Routing_for_a_Hybrid_SDN","abstract":"To explore the advantages of software defined network (SDN), while preserving the legacy networking systems, a natural deployment strategy is to deploy a hybrid SDN incrementally to improve the network performance. In this paper, we address two technical challenges: an incremental deployment strategy and a throughput-maximization routing, for deploying a hybrid network incrementally. For incremental deployment, we propose a heuristic algorithm for deploying a hybrid SDN under the budget constraint, and prove the approximate factor of 1 - 1/e. For throughput-maximization routing, we apply a depth-first-search method and a randomized rounding mechanism to solve the multi-commodity h-splittable flow routing problem in a hybrid SDN, where h ≥ 1. We also prove that our method has approximation ratio O(1\\log N), where N is the number of links in a hybrid SDN. We then show, by both analysis and simulations, that our algorithms can obtain significant performance gains and perform better than the theoretical worst-case bound. For example, our incremental deployment scheme helps to enhance the throughout about 40% compared with the previous deployment scheme by deploying a small number of SDN devices, and the proposed routing algorithm can improve the throughput about 31% compared with ECMP in hybrid networks.","authors":["Hongli Xu","Xiang-Yang Li","Liusheng Huang","Hou Deng"],"meta":["February 2017IEEE/ACM Transactions on Networking PP(99):1-15","DOI:10.1109/TNET.2017.2657643"],"references":["283229506_Achieving_near-optimal_traffic_engineering_in_hybrid_Software_Defined_Networks","273633511_Panopticon_Reaping_the_Benefits_of_Incremental_SDN_Deployment_in_Enterprise_Networks","312294554_Real-time_update_with_joint_optimization_of_route_selection_and_update_scheduling_for_SDNs","310794007_On_the_controller_placement_for_designing_a_distributed_SDN_control_layer","308812908_On_the_co-existence_of_distributed_and_centralized_routing_control-planes","308525443_Onix_A_distributed_control_platform_for_large-scale_production_networks","305296485_Incremental_SDN_deployment_in_enterprise_networks","286680520_Traffic_engineering_in_SDNOSPF_hybrid_network","286561766_OpenDaylight_Towards_a_Model-Driven_SDN_Controller_architecture","285897917_B4_Experience_with_a_globally-deployed_software_defined_WAN"]}