{"id":"313780429_Indagacion_en_la_relacion_entre_aprendizaje_-_tecnologias_digitales","abstract":"The presence of digital technologies in various areas of people’s daily lives is undeniable, particularly their high penetration in a number of educational settings. A more in-depth analysis of the opportunities offered by digital technologies is relevant in this context, using as an element of analysis the different theoretical approaches associated with the learning process. This article offers points of reference and examples of initiatives and technologies that embody opportunities to be incorporated into educational contexts, and their relationship with the different theories of learning that lie behind the educational process is taken into account. There is a systematic review of the main theoretical models associated with learning and their link to the development of digital technologies from the middle of the last century. The results of the analysis show a range of current technological alternatives that should be selected according to the context and the type of learning activities to be implemented.","authors":["Leonardo Rodrigo López Neira"],"meta":["February 2017Educación y Educadores 20(1):89-105","DOI:10.5294/edu.2017.20.1.5","Project: Online interactive game to reinforce classroom interaction strategies for pedagogy students"],"references":["304049716_Learning_in_Education","279867852_A_Survey_of_Augmented_Reality_Technologies_Applications_and_Limitations","313711412_On_Qualitative_Differences_in_Learning_II_Outcome_as_a_Function_of_Learner's_Conception_of_Task","304232743_El_constructo_Enfoques_de_Aprendizaje_un_analisis_bibliometrico_de_las_publicaciones_en_espanol_en_los_ultimos_20_anos","291248594_Skill_in_learning_and_organising_knowledge","287736369_On_the_structure_of_teachers'_awareness","285755803_Mobile_Technology_in_Educational_Services","285709346_Learning_conceptions_and_outcomes","285255236_'Approaches_to_Learning'","283738413_Conceptions_of_teaching_and_implications_for_learning"]}