{"id":"313770062_Graphical_password_Prevent_shoulder-surfing_attack_using_digraph_substitution_rules","abstract":"Graphical passwords use easily seen images that attracts human attention. It is an easy task for the shoulder-surfer to obtain the account's password since the password attempt is not masked. This flaw makes most of the graphi-cal password scheme vulnerable to shoulder-surfer attackers. Many schemes proposed have shown flaws such as requiring the user to spend too much time on complex mental activities to derive the correct image to click on. Others schemes do not conceal the images in the challenge set during authenti-cation which allows direct shoulder-surfing. These two major drawbacks make graphical password schemes very vulnerable to shoulder-surfer attackers. In this paper, a new scheme to hide and conceal the mechanism or activity required to derive the password-images generation is proposed. This activity is simple enough to reduce login time while the images clicked seem to be random and can only be obtained by the complete knowledge of the registered password along with the activity rules. This combination makes it tougher for a shoulder-surfer to identify the user's actual password. From the user study results, it shows that the average login process for the proposed method is really fast as it was successfully performed by the participants in less than half a minute. Moreover, the proposed method is able to resist shoulder-surfing attacks although the adversaries have the knowledge of how the proposed method works.","authors":["Yee Lip","Yee Lip Por","Chin Soon Ku","Amanul Islam"],"meta":["January 2017Frontiers of Computer Science (electronic) 11(1)","DOI:10.1007/s11704-016-5472-z","Project: Systematic Mapping Study of Tools to Identify Emotions and Personality Traits"],"references":["286816797_An_enhanced_mechanism_for_image_steganography_using_sequential_colour_cycle_Algorithm","266583345_Issues_Threats_and_Future_Trend_for_GSP","266005342_Frequency_of_Occurrence_Analysis_Attack_and_Its_Countermeasure","256991692_UniSpaCh_A_text-based_data_hiding_method_using_Unicode_space_characters","255661573_StegCure_An_Amalgamation_of_Different_Steganographic_Methods_in_GIF_Image","254478407_MultiGrid_Background_Pass-Go","233842028_Shoulder_Surfing_Resistance_Using_PENUP_Event_And_Neighboring_Connectivity_Manipulation","276319755_An_anonymous_and_efficient_remote_biometrics_user_authentication_scheme_in_a_multi_server_environment","276019571_A_survey_on_the_use_of_graphical_passwords_in_security","228871799_Graphical_Passwords_Learning_from_the_First_Twelve_Years"]}