{"id":"313872845_Bringing_Robotics_to_Formal_Education_The_Thymio_Open-Source_Hardware_Robot","abstract":"Mobile robots are valuable tools for education because of both the enthusiasm they raise and the multidisciplinary nature of robotics technology. Mobile robots give access to a wide range of fields, such as complex mechanics, sensors, wireless transmission, mathematics, and computer science. However, despite their potential as educational tools, robots are still not as widespread in schools as they could be. In this article, we identify five key reasons: lack of diversity, high cost, noninclusive design, lack of educational material, and lack of stability over time. Then, we describe our answers to these problems, as we implemented them in the Thymio project: a mature mass-produced open-hardware robot, at a low price, with a multiage and gender-neutral feature set, and with a design promoting creativity, facilitating learning, and providing a wide range of interaction possibilities from built-in behaviors to text programming, passing through different visual programming environments. We highlight some neglected key issues that differentiate open-source hardware from open-source software, for instance the legal uncertainty of designing open hardware using professional computer-aided design (CAD) tools and the difficulty to distribute the development. Our solution to these being to increase the awareness of CAD editors to open-source hardware and to provide a two-layer development model for hardware.","authors":["Francesco Mondada","Michael Bonani","Fanny Riedo","Manon Briod"],"meta":["February 2017IEEE Robotics & Automation Magazine PP(99):1-1","DOI:10.1109/MRA.2016.2636372","Project: thymio education robot"],"references":["303027305_Pedagogical_Uses_of_Thymio_II_How_Do_Teachers_Perceive_Educational_Robots_in_Formal_Education","283680366_When_Children_Teach_a_Robot_to_Write_An_Autonomous_Teachable_Humanoid_Which_Uses_Simulated_Handwriting","272091261_A_Robot-Partner_for_Preschool_Children_Learning_English_using_Socio-Cognitive_Conflict","261312530_Thymio_II_a_robot_that_grows_wiser_with_children","312720879_A_Sociological_Contribution_to_Understanding_the_Use_of_Robots_in_Schools_The_Thymio_Robot","303138182_ROS_An_open-source_Robot_Operating_System","300481296_Enhancing_Robot_Programming_with_Visual_Feedback_and_Augmented_Reality","283457703_Thymio_a_holistic_approach_to_designing_accessible_educational_robots","282952991_AERobot_An_affordable_one-robot-per-student_system_for_early_robotics_education","266656929_Teaching_a_core_CS_concept_through_robotics"]}