{"id":"313816819_Enabling_smart_data_selection_based_on_data_completeness_measures_a_quality-aware_approach","abstract":"Geographic information system (GIS) users rely heavily on the versatile operations of GIS software and the abundant variety of geospatial data from different resources to satisfy their application requirements. However, the convenient use of GIS software has resulted in users easily ignoring the threat of data misuse because of the lack of understanding of data quality. Here we argue that data quality considerations must be coherently assimilated into the GIS operation design to visually present helpful information and ensure the accuracy of data for decision making. Data completeness is selected in this paper to demonstrate how the use of data quality information opens a new dimension to the design of future GIS software. We propose a new model for the representation, analysis, and visualization of data completeness information. With the brand new quantitative measures and informative visual approach, understanding of the data completeness of the illustrated contents in the map interface is enhanced, and inappropriate dataset selection can be effectively prevented. Thus, this paper presents an innovative, integrated and geospatial concept of future GIS operation design, where users are constantly aware of the continuously changing status of data quality based on formalized and quantitative data quality theories.","authors":["Jung-hong Hong","Min-Lang Huang"],"meta":["February 2017International Journal of Geographical Information Science","DOI:10.1080/13658816.2017.1290251"],"references":["279763707_An_Integrated_GIS-Expert_System_Framework_for_Live_Hazard_Monitoring_and_Detection","262008247_Big_Data_and_Human_Geography_Opportunities_Challenges_and_Risks","256817474_Multidimensional_Management_of_Geospatial_Data_Quality_Information_for_its_Dynamic_Use_Within_GIS","256716925_Geo-Information_Tools_for_Participatory_Spatial_Planning_Fulfilling_the_Criteria_for_'Good'_Governance","253972014_How_to_Improve_Geospatial_Data_Usability_From_Metadata_to_Quality-Aware_GIS_Community","251305239_Towards_Quality-Aware_GIS_Operation-based_retrieval_of_spatial_data_quality_information","312902736_Attribute_accuracy","307567298_Map_Makers_are_Human_Comments_on_the_Subjective_in_Maps","275593769_Geography_and_the_future_of_big_data_big_data_and_the_future_of_geography","260635692_Standards-Based_Middleware_and_Tools_for_Coastal_Sensor_Web_Applications"]}