{"id":"313898724_A_Minimal_Rare_Substructures-Based_Model_for_Graph_Database_Indexing","abstract":"Systems such as proteins, chemical compounds, and the Internet are stored as graph structures in graph databases. A basic, common problem in graph related applications is to find graph data that contains a query. It is not possible to scan the whole data in graph databases since subgraph isomorphism testing is an NP-complete problem. In recent years, some effective graphs indexes have been proposed to first obtain a candidate answer set and then performing verification on each candidate by checking subgraph isomorphism. However, candidate verification is still inevitable and expensive when the size of the candidate answer set is large. In this paper, we propose a new Structural Graph Indexing, called GIRAS, based on RAre subGraphs (RGs) as the basic indexing feature. The idea is to have a single characteristic that can uniquely identify a graph in a database. Few substructures are ideal candidates since they are rare graphs, which means they occurs in only a small number of graphs in the database. Thus, in confronting a query using these indexes, the size of the candidate answer set is close to that of the exact answer set, and the number of subgraph isomorphism tests is small. Therefore, the time of the candidate verification step is reduced to a minimum.","authors":["Mehdi Azaouzi","Lotfi Ben Romdhane"],"meta":["February 2017Advances in Intelligent Systems and Computing 557:250-259","DOI:10.1007/978-3-319-53480-0_25","Conference: International Conference on Intelligent Systems Design and Applications"],"references":["283189571_Performance_and_scalability_of_indexed_subgraph_query_processing_methods","273082158_A_survey_on_Indexing_Techniques_for_Big_Data_Taxonomy_and_Performance_Evaluation","221310199_Graph_Indexing_Tree_Delta_Graph","265788947_Efficient_processing_of_keyword_queries_over_graph_databases_for_finding_effective_answers","265730758_Graph_indexing_for_large_networks_A_neighborhood_tree-based_approach","264498285_Efficient_search_in_graph_databases_using_cross_filtering","257457830_Efficient_processing_of_graph_similarity_queries_with_edit_distance_constraints","257457511_Lindex_A_lattice-based_index_for_graph_databases","254863114_Towards_Efficient_Authenticated_Subgraph_Query_Service_in_Outsourced_Graph_Databases","221591101_The_Complexity_of_Theorem-Proving_Procedures"]}