{"id":"313800419_Public_Sentiments_Analysis_Based_on_Fuzzy_Logic_for_Text","abstract":"Sentiment analysis from microblog platform has received an increasing interest from web mining community in recent years. Current sentiment analysis methods are mainly based on the hypothesis that each word expresses only one sentiment. However, human sentiment are prototyped and fuzzy-confined as declared in social psychology, which is conflicting with the hypothesis. This is one of the barriers that impede the computation of complex public sentiment of web events in microblog. Therefore, how to find a reasonable computational model, combining learning technology and human sentiment cognition theory, is a novel idea in event sentiment analysis of microblog. In this paper, a new sentiment computation approach, which is defined as public sentiments discriminator (PSD), considering both fuzzy logic and sentiment complexity, is proposed. Unlike traditional machine learning methods, PSD is based on the rational hypothesis that sentiments are correlated with each other. A three-level computing structure, sentiment-term level, microblog level and public sentiment level, is employed. Experiments show that the proposed approach, PSD, can achieve similar accuracy and F1-measure but more cognitive results when compared with traditional well-known machine learning methods. These experimental studies have confirmed that PSD can generate an interpretable result with no restriction among sentiments.","authors":["Xinzhi Wang","Hui Zhang","Zheng Xu"],"meta":["December 2016International Journal of Software Engineering and Knowledge Engineering 26(09n10):1341-1360","DOI:10.1142/S0218194016400076"],"references":["272491605_Lexical-Syntactical_Patterns_for_Subjectivity_Analysis_of_Social_Issues","257676536_Building_emotional_dictionary_for_sentiment_analysis_of_online_news","221654582_Mining_and_summarizing_customer_reviews","220534598_Yahoo_for_Amazon_Sentiment_Extraction_from_Small_Talk_on_the_Web","200044311_Mining_product_reputations_on_the_Web","300008209_An_Integrated_Method_for_Micro-blog_Subjective_Sentence_Identification_Based_on_Three-Way_Decisions_and_Naive_Bayes","271179488_Combining_Domain-Specific_Sentiment_Lexicon_with_Hownet_for_Chinese_Sentiment_Analysis","259992045_Automatic_construction_of_domain-specific_sentiment_lexicon_based_on_constrained_label_propagation","200773081_A_Vector_Space_Model_for_Automatic_Indexing","200044329_Recognizing_Contextual_Polarity_in_Phrase-Level_Sentiment_Analysis"]}