{"id":"313838075_Assessment_of_Health_Information_Technology_Knowledge_Attitude_and_Practice_among_Healthcare_Activists_in_Tehran_Hospitals","abstract":"Background: To encourage students and professionals to use health information technology (HIT), an awareness of their perceptions of various aspects of using this facility is essential. The current study aimed to assess HIT knowledge, attitude, and practice among health care professionals and students in teaching hospitals in Iran. Methods: This case study survey was conducted on 250 staffs of 5 teaching hospitals assigned into three subgroups of medical doctors (n = 70), medical students (n = 46), and health record staff (n = 134) in Tehran, Iran in 2016. To assess the subject's knowledge, attitude, and practice of health information technology, a pretested self-administered questionnaire was given to participants consisted of three sections of \" baseline general characteristics \" , \" knowledge categories \" , and \" attitude and practice \" categories. Results: A total of 28.1% responders had a good level of knowledge towards computer science, while poor level of knowledge was revealed in 38.6%. Also, 40.4% had good attitude and practice habits, whereas 25.4% exhibited poor attitude and practice. Good knowledge was found in 15.6%, 35.0%, and 32.3% and poor knowledge was also observed in 46.9%, 25.0%, and 38.7% of doctors, students, and staff, respectively (p = 0.309). Regarding attitude and practice habits, 31.2% of doctors, 50.0% of students, and 42.0% of staff had good attitude and practice habits, while poor attitude and practice habits was revealed in 25.4%, 31.2%, and 5.0%, respectively (p = 0.168). Overall, the level of knowledge was positively associated with the score of attitude and practice (r = 0.853, p < 0.001) so higher knowledge level was related to higher score of attitude and practice. Conclusion: knowledge and practice of HIT among doctors, students and staff were low. Our university can establish a comprehensive program to improve their knowledge and information to application and practice of HIT.","authors":["Farahnaz Sadoughi","Morteza Hemmat","Ali Valinejadi","Ali Mohammadi"],"meta":["January 2017"],"references":["268151599_User_Acceptance_of_Health_Information_Technology_HIT_in_Developing_Countries_A_Conceptual_Model","264810279_Role_of_Information_Communication_Technology_in_Higher_Education_Learners_Perspective_in_Rural_Medical_Schools","236652306_Telehealth_and_Telenursing_Perception_and_Knowledge_Among_University_Students_of_Nursing_in_Poland","236066306_Knowledge_and_utilization_of_computer_among_health_workers_in_Addis_Ababa_hospitals_Ethiopia_Computer_literacy_in_the_health_sector","321549183_Monitoring_Technologies_in_Acute_Care_Environments_A_Comprehensive_Guide_to_Patient_Monitoring_Technology","263662773_Acceptance_and_use_of_electronic_medical_records_An_exploratory_study_of_hospital_physicians'_salient_beliefs_about_HIT_systems","242091432_Virtual_students'_perceptions_of_e-learning_in_Iran","238342274_The_Goals_of_Educations_in_the_Information_Era","221751105_Use_of_information_and_communication_technology_among_dental_students_and_registrars_at_the_faculty_of_dental_sciences_University_of_Lagos","49622568_Knowledge_of_Computer_Among_Healthcare_Professionals_of_India_A_Key_Toward_e-Health"]}