{"id":"313830633_Skyline_Preference_Query_Based_on_Massive_and_Incomplete_Dataset","abstract":"Personalized recommendation and the processing of real-time data exemplify the processing of massive data which in the field of Internet-of-Things received a great extent of attention in recent literature. The incompleteness of massive data in the IoT is widespread. Obtaining personalized information from the incomplete data set is still puzzled by searching efficient and accurate methods at present. Skyline query is a widely used data processing method, especially in the field of multi-objective decision analysis and data visualization. To eliminate the negative effects on massive data processing in IoT, a novel skyline preference query strategy based on massive and the incomplete data set is proposed in this paper. This strategy simply separates divides massive and incomplete data set into two parts according to dimension importance and executes skyline query respectively. The strategy mainly resolves the problem of extracting personalized information from massive and incomplete data set and improves the efficiency of skyline query on massive and incomplete data set. Firstly, this paper presents a skyline preference query strategy based on strict clustering and implements it on dimensions that have higher importance. Secondly, a skyline preference query strategy based on loose clustering is implemented on dimensions that have lower importance. Finally, integrating local skyline query results, this paper calculates global skyline query results by using information entropy theory. The efficiency and effectiveness of SPQ algorithm have been evaluated in terms of response time and result set size through the comparative experiments with ISkyline algorithm and SIDS algorithm. A large number of simulation results show that the efficiency of SPQ algorithm is higher than that of other common methods.","authors":["Yan Wang","Zhan Shi","Junlu Wang","Lingfeng Sun"],"meta":["February 2017IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2016.2639558"],"references":["305217415_Internet_of_Things_A_Review_of_Surveys_Based_on_Context_Aware_Intelligent_Services","299498845_Geometry-Based_Distributed_Spatial_Skyline_Queries_in_Wireless_Sensor_Networks","293012077_Enhanced_Distributed_Dynamic_Skyline_Query_for_Wireless_Sensor_Networks","220473845_Understanding_the_meaning_of_a_shifted_sky_A_general_framework_on_extending_skyline_query","318779167_Cyber-Physical_Systems_Foundations_Principles_and_Applications","312867543_Erratum_to_Industrial_Internet_of_Things","288349661_Continuous_dynamic_skyline_queries_over_data_stream","283101024_Geometry-Based_Spatial_Skyline_Query_in_Wireless_Sensor_Network","282635126_Efficient_Subspace_Skyline_Query_based_on_User_Preference_using_MapReduce","275876755_Efficient_Skyline_Query_Processing_of_Massive_Data_Based_on_Map-Reduce","262410295_Parallel_computation_of_skyline_and_reverse_skyline_queries_using_mapreduce","261860819_Finding_skylines_for_incomplete_data","251043499_RFID_Data_Interpolation_Algorithm_Based_on_Dynamic_Probabilistic_Path-Event_Model_RFID_Data_Interpolation_Algorithm_Based_on_Dynamic_Probabilistic_Path-Event_Model","33428725_Skyline_Query_Processing","4331061_Skyline_Query_Processing_for_Incomplete_Data","3892911_The_Skyline_Operator","2374777_The_Skyline_Operator"]}