{"id":"313808874_An_anomaly_detection_in_smart_cities_modeled_as_wireless_sensor_network","abstract":"Smart city is an important application of the recent technology — Internet of Things (IoT). IoT enables wide range of physical objects and environments to be monitored in fine detail by using low cost, low power sensing and communication technologies. While there has been growing interest in the IoT for smart cities, there have been few systematic studies that can demonstrate weather practical insights can be extracted from the real time IoT data using advanced data analytics techniques such as anomaly detection. We carried out a case study of smart environment based on real time data collected by the city of Aarhus, Denmark. We analyzed and find the levels of different air pollution elements to detect the unhealthy or anomalous locations based on Air Quality Index (AQI). Machine learning framework namely neural network, Neuro-fuzzy method and Support Vector Machines for both binary and multi class problems has been used for anomalous location detection form pollution database. Simulation results using MATLAB show that Machine learning techniques are reliable in terms of accuracy and calculation time for smart environment.","authors":["Raj Jain","Dr. Hitesh Shah"],"meta":["October 2016","DOI:10.1109/ICONSIP.2016.7857445","Conference: 2016 International Conference on Signal and Information Processing (IConSIP)"],"references":["271430517_An_electronic_nose_for_detection_pollutant_odorant_and_olfaction_classification_using_neural_network","270953555_Comparative_Analysis_of_K-Means_and_Fuzzy_C-Means_Algorithms","261453512_Anomaly_Detection_in_Wireless_Sensor_Networks_Using_S-Transform_in_Combination_with_SVM","260540297_Internet_of_Things_for_Smart_Cities","260433589_Anomaly_Detection_in_Wireless_Sensor_Networks_in_a_Non-Stationary_Environment","224229684_Anomaly_Detection_in_Environmental_Monitoring_Networks_Application_Notes","220565847_Anomaly_Detection_A_Survey","313607497_Comparative_analysis_of_K-means_and_fuzzy_C-means_algorithms_IJACSA","269303154_Smart_car_parking_Temporal_clustering_and_anomaly_detection_in_urban_car_parking","261093025_Support_Vector_Machines_Based_on_K_Nearest_Neighbor_Algorithm_for_Outlier_Detection_in_WSNs","224374237_Classification_of_fingerprint_images_into_individual_classes_using_Neural_Networks"]}