{"id":"313844293_Programa_en_codigo_abierto_para_el_analisis_bidimensional_de_estabilidad_de_taludes_por_el_metodo_de_equilibrio_limite_--_Open_code_program_for_the_bidimensional_analysis_of_slopes'_stability_by_the_e","abstract":"El artículo realiza una recopilación sobre los desarrollos pasados en la programación computacional referente al análisis de estabilidad de taludes aplicada a la geotecnia. Luego, el artículo presenta el programa desarrollado por los autores, que posibilita resolver problemas de estabilidad de taludes por el método de equilibrio lı́mite mediante las soluciones de Fellenius y de Bishop usando Python3(R).\nEl programa consiste de 22 funciones procedimentales independientes, que como conjunto forma un sistema anidado que posibilita correr el programa completo; todo esto ayudado por una interfaz gráfica de usuario que se corre desde la terminal. Los resultados se presentan de forma gráfica. Finalmente, el artı́culo coloca algunos ejemplos y validaciones. Se puede concluir que el programa es en principio académico porque no presenta la solución general; pero debido a que es un código abierto se puede usar en futuras implementaciones inclusive\nlas generales.\n--- This article makes a recopilation about the past developments in computer programming in regard to the analysis of slope stability applied to geotechnics. After that, the article presents the computer\nprogram developed by the authors which allows to solve slope stability problems under the method of limit equilibrium with the solutions propossed by Fellenius and Bishop using Python3(R). The program consist of 22 procedural independent functions, which as a set form a nested system which allow to run the complete analysis; all of these helped by a graphical user interfase run from the terminal. Results are presented graphically. Finally, this article presents some examples and validations. We can conclude that the program is in\nprinciple for academic uses because it does not solve the genral solution; but because it is an open source code it can be used for future implementations inclusive the general ones.","authors":["Ludger Suarez-Burgoa","Exneyder A. Montoya-Araque"],"meta":["December 2016Revista de la Facultad de Ciencias 5(2):88-104","DOI:10.15446/rev.fac.cienc.v5n2.59914","Project: Geomathematics and Computer Programming"],"references":["311705668_Circular_Slope_Stability_PyProgram_pyCSS_Programa_en_Python_para_el_analisis_de_estabilidad_de_taludes_en_2D_metodos_de_Fellenius_y_de_Bishop","276078531_Taylor's_Slope_Stability_Charts_Revisited","270626861_Slope_Stability_Analysis_Using_Slice-Wise_Factor_of_Safety","248878317_Discrete_Element_Method_for_Slope_Stability_Analysis","345254676_Slope_Stability_Analysis_and_Stabilization_New_Methods_and_Insight_Second_Edition","284262210_Stability_of_earth_slopes","247759350_The_Analysis_of_The_Stability_of_General_Slip_Surfaces","245409997_The_Use_Of_An_Electronic_Computer_For_Slope_Stability_Analysis","245409339_Stability_Coefficients_for_Earth_Slopes","239410747_The_Use_of_the_Slip_Circle_in_the_Stability_Analysis_of_Slopes"]}