{"id":"313866209_Network_Intelligence_Based_on_Network_State_Information_for_Connected_Vehicles_Utilizing_Fog_Computing","abstract":"This paper proposes a method to take advantage of fog computing and SDN in the connected vehicle environment, where communication channels are unstable and the topology changes frequently. A controller knows the current state of the network by maintaining the most recent network topology. Of all the information collected by the controller in the mobile environment, node mobility information is particularly important. Thus, we divide nodes into three classes according to their mobility types and use their related attributes to efficiently manage the mobile connections. Our approach utilizes mobility information to reduce control message overhead by adjusting the period of beacon messages and to support efficient failure recovery. One is to recover the connection failures using only mobility information, and the other is to suggest a real-time scheduling algorithm to recover the services for the vehicles that lost connection in the case of a fog server failure. A real-time scheduling method is first described and then evaluated. The results show that our scheme is effective in the connected vehicle environment. We then demonstrate the reduction of control overhead and the connection recovery by using a network simulator. The simulation results show that control message overhead and failure recovery time are decreased by approximately 55% and 5%, respectively.","authors":["Seongjin Park","Younghwan Yoo"],"meta":["February 2017Mobile Information Systems 2017:1-9","DOI:10.1155/2017/7479267"],"references":["305705710_Mobility-aware_real-time_scheduling_for_low-power_wireless_networks","300490582_A_Survey_of_Fog_Computing_Concepts_Applications_and_Issues","295861311_Mininet-WiFi_Emulating_software-defined_wireless_networks","283671944_Software_defined_mobile_networks_Concept_survey_and_research_directions","283466671_Software_defined_networking-based_vehicular_Adhoc_Network_with_Fog_Computing","262805723_Software-Defined_Networking_A_Comprehensive_Survey","262301982_What_will_5G_be","295832539_Vehicular_Fog_Computing_A_Viewpoint_of_Vehicles_As_the_Infrastructures","279160652_Cooperative_Data_Scheduling_in_Hybrid_Vehicular_Ad_Hoc_Networks_VANET_as_a_Software_Defined_Network","272027182_Fog_Computing_Focusing_on_Mobile_Users_at_the_Edge"]}