{"id":"313832991_Seismic_Imaging_of_the_Sun's_Far_Hemisphere_and_its_Applications_in_Space-Weather_Forecasting_Seismic_Imaging_of_the_Sun's_Far_Side","abstract":"The interior of the Sun is filled acoustic waves with periods of about five minutes. These waves, called “p-modes,” are understood to be excited by convection in a thin layer beneath the Sun's surface. The p-modes cause seismic ripples, which we call “the solar oscillations.” Helioseismic observatories use Doppler observations to map these oscillations, both spatially and temporally. The p-modes propagate freely throughout the solar interior, reverberating between the near and far hemispheres. They also interact strongly with active regions at the surfaces of both hemispheres, carrying the signatures of said interactions with them. Computational analysis of the solar oscillations mapped in the Sun's near hemisphere, applying basic principles of wave optics to model the implied p-modes propagating through the solar interior, gives us seismic maps of large active regions in the Sun's far hemisphere. These seismic maps are useful for space-weather forecasting. For the past decade, NASA's twin STEREO spacecraft have given us full coverage of the Sun's far hemisphere in electromagnetic (EUV) radiation from the far side of Earth's orbit about the Sun. We are now approaching a decade during which the STEREO spacecraft will lose their far-side vantage. There will occur significant periods from thence during which electromagnetic coverage of the Sun's far hemisphere will be incomplete or nil. Solar seismology will make it possible to continue our monitor of large active regions in the Sun's far hemisphere for the needs of space-weather forecasters during these otherwise blind periods.","authors":["Charles Lindsey","Douglas Braun"],"meta":["February 2017Space Weather 15(6)","DOI:10.1002/2016SW001547"],"references":["280969793_Solar_Energetic_Particle_Access_to_Distant_Longitudes_via_Turbulent_Field-Line_Meandering","278702109_25_MeV_Proton_Events_Observed_by_the_High_Energy_Telescopes_on_the_STEREO_A_and_B_Spacecraft_andor_at_Earth_During_the_First_Seven_Years_of_the_STEREO_Mission","265296576_The_Longitudinal_Dependence_of_Heavy-ion_Composition_in_the_2013_April_11_Solar_Energetic_Particle_Event","258257622_Seismic_Holography_of_Solar_Activity","256413755_Modeling_the_Corona_and_Solar_Wind_using_ADAPT_Maps_that_Include_Far-Side_Observations","290159575_Basic_principles_of_solar_acoustic_holography","263931479_Testing_the_Reliability_of_Predictions_of_Far-Side_Active_Regions_from_Helioseismology_Using_STEREO_Far-Side_Observations_of_Solar_Activity","260779149_Acoustic_Imaging_of_Solar_Active_Regions","257664730_Comparison_of_Far-Side_STEREO_Observations_of_Solar_Activity_and_Active_Region_Predictions_from_GONG","256497171_Observations_of_Solar_Energetic_Particles_from_3He-rich_Events_over_a_Wide_Range_of_Heliographic_Longitude"]}