{"id":"313844513_On_time_scales_and_quasi-stationary_distributions_for_multitype_birth-and-death_processes","abstract":"We consider a class of birth-and-death processes describing a population made of sub-populations of $d$ different types which interact with one another. These processes are parametrized by a scaling parameter $K$ giving the order of magnitude of the total size of the population. We consider a situation where the process stabilizes during a very long time around a transient equilibrium close to the fixed point of a naturally associated dynamical system, before going almost surely to extinction. We extend most of the results of our previous paper (see arXiv:1406.1742) which was about the case $d=1$, that is, the monotype situation. We emphasize that we follow here a completely different route than the one followed in \\cite{ccm} which was in particular based on constructing a self-adjoint operator on a suitable $\\ell^2$-space out of the generator of the process. This contruction turns out to fail in higher dimension, as we explain below. In the present work, we rely upon an abstract result proved by Champagnat and Villemonais giving conditions under which one has exponential convergence of the process, conditioned on nonextinction, to the quasi-stationary distribution. In our situation, we obtain the precise dependence on $K$ of the involved constants. As a consequence, we get an estimate of the mean time to extinction in the quasi-stationary distribution. We also quantify how close the law of the process is either to the Dirac measure at the origin or to the quasi-stationary distribution, for times much larger than $\\log K$ and much smaller than the mean time to extinction, which grows exponentially with $K$. An important part of our work consists in a fine pathwise analysis of the process, with a precise dependence on $K$. In particular we use a Lyapunov function.","authors":["Jean-René Chazottes","P. Collet","S. Méléard"],"meta":["February 2017Annales de l Institut Henri Poincaré Probabilités et Statistiques 55(4)","DOI:10.1214/18-AIHP948"],"references":["262937234_Sharp_asymptotics_for_the_quasi-stationary_distribution_of_birth-and-death_processes","324631722_Markov_Processes_Characterization_and_Convergence","311430619_WKB_theory_of_large_deviations_in_stochastic_populations","287390410_Metastable_states_quasi-stationary_distributions_and_soft_measures","277333821_Estimates_on_the_amplitude_of_the_first_Dirichlet_eigenvector_in_discrete_frameworks","267386004_Modeles_aleatoires_en_Ecologie_et_Evolution","265716425_Spectral_Theory_and_Differential_Operators","265638962_Quasi-stationary_distributions_Markov_chains_diffusions_and_dynamical_systems","265245271_Functional_Analysis_and_Semi-Groups","262974699_On_quantitative_convergence_to_quasi-stationarity"]}