{"id":"313805677_FIVE_High-level_components_for_developing_collaborative_and_interactive_virtual_environments","abstract":"This paper presents #FIVE (Framework for Interactive Virtual Environments), a framework for the development of interactive and collaborative virtual environments. #FIVE has been developed to answer the need for an easier and a faster conception and development of virtual reality applications. It has been designed with a constant focus on re-usability with as few hypothesis as possible on the final application in which it could be used. Whatever the chosen implementation for the Virtual Environment (VE), #FIVE : (1) provides a toolkit that eases the declaration of possible actions and behaviours of objects in the VE, (2) provides a toolkit that facilitates the setting and the management of collaborative interactions in a VE, (3) is compliant with distribution of the VE on different setups and (4) proposes guidelines to efficiently create a collabo-rative and interactive VE. It is composed of several modules, among them, two core modules : the relation engine and the collabora-tive interaction engine. On the one hand, the relation engine manages the relations between the objects of the environment. On the other hand, the collaborative interaction engine manages how users can collaboratively control objects. The modules that compose the #FIVE framework can be used either independently or simultaneously , depending on the requirements of the application. They can also communicate and work with other modules thanks to an API. For instance, a scenario engine can be plugged to any or both of the #FIVE modules if the application is scenario-based. #FIVE is a work in progress, new core modules will later be proposed. Nevertheless , it has already been used in some VR applications by several persons in our lab. The feedbacks we obtained are rather positive and we intent to further develop #FIVE with additional functional-ities, notably by extending it to the control of avatars whether they are controlled by a user or by the system.","authors":["Rozenn Bouville Berthelot","Valérie Gouranton","Thomas Boggini","Florian Nouviale"],"meta":["March 2015","DOI:10.1109/SEARIS.2015.7854099","Conference: 2015 IEEE 8th Workshop on Software Engineering and Architectures for Realtime Interactive Systems (SEARIS)"],"references":["281697490_Short_Paper_SEVEN_a_Sensor_Effector_Based_Scenarios_Model_for_Driving_Collaborative_Virtual_Environment","233894482_ARTiFICe_-_Augmented_Reality_Framework_for_Distributed_Collaboration","225488396_FlowVR_A_Middleware_for_Large_Scale_Virtual_Reality_Applications","221608066_Making_sense_of_virtual_environments_Action_representation_grounding_and_common_sense","314829169_VRPN_a_device-independent_network-transparent_VR_peripheral_system","287828829_Reality_built_for_two_a_virtual_reality_tool","277297774_VR_Juggler_A_Virtual_Platform_for_Virtual_Reality_Application_Development","260419563_When_Model_Driven_Engineering_meets_Virtual_Reality_Feedback_from_Application_to_the_Collaviz_Framework","234794547_Teitel_Reality_Built_for_Two_A_Virtual_Reality_Tool","228573207_Some_useful_abstractions_for_re-usable_virtual_environment_platforms"]}