{"id":"313815223_Revealing_hidden_text_in_rolled_and_folded_papyri","abstract":"Ancient Egyptian papyri are often folded, rolled up or kept as small packages, sometimes even sealed. Physically unrolling or unfolding these packages might severely damage them. We demonstrate a way to get access to the hidden script without physical unfolding by employing computed tomography and mathematical algorithms for virtual unrolling and unfolding. Our algorithmic approaches are combined with manual interaction. This provides the necessary flexibility to enable the unfolding of even complicated and partly damaged papyrus packages. In addition, it allows us to cope with challenges posed by the structure of ancient papyrus, which is rather irregular, compared to other writing substrates like metallic foils or parchment. Unfolding of packages is done in two stages. In the first stage, we virtually invert the physical folding process step by step until the partially unfolded package is topologically equivalent to a scroll or a papyrus sheet folded only along one fold line. To minimize distortions at this stage, we apply the method of moving least squares. In the second stage, the papyrus is flattened, which requires the definition of a medial surface. We have applied our software framework to several papyri. In this work, we present the results of applying our approaches to mockup papyri that were either rolled or folded along perpendicular fold lines. In the case of the folded papyrus, our approach represents the first attempt to address the unfolding of such complicated folds.","authors":["Daniel Baum","Norbert Lindow","Hans-Christian Hege","Verena Lepper"],"meta":["February 2017Applied Physics A 123(3)","DOI:10.1007/s00339-017-0808-6"],"references":["308481928_From_damage_to_discovery_via_virtual_unwrapping_Reading_the_scroll_from_En-Gedi","286491038_Revealing_text_in_a_complexly_rolled_silver_scroll_from_Jerash_with_computed_tomography_and_advanced_imaging_software","271333714_Revealing_letters_in_rolled_Herculaneum_papyri_by_X-ray_phase-contrast_imaging","262245488_Apocalypto_Revealing_the_unreadable","220183739_Least_Squares_Conformal_Maps_for_Automatic_Texture_Atlas_Generation","262233069_Virtual_unrolling_and_information_recovery_from_scanned_scrolled_historical_documents","220184559_Image_deformation_using_Moving_Least_Squares","4156263_Conformal_deskewing_of_non-planar_documents","3906153_Document_restoration_using_3D_shape_a_general_deskewing_algorithm_for_arbitrarily_warped_documents","2552051_Document_Restoration_Using_3D_Shape_A_General_Deskewing_Algorithm_for_Arbitrarily_Warped_Documents"]}