{"id":"313953511_Monitoring_Citrus_Soil_Moisture_and_Nutrients_Using_an_IoT_Based_System","abstract":"Chongqing mountain citrus orchard is one of the main origins of Chinese citrus. Its planting terrain is complex and soil parent material is diverse. Currently, the citrus fertilization, irrigation and other management processes still have great blindness. They usually use the same pattern and the same formula rather than considering the orchard terrain features, soil differences, species characteristics and the state of tree growth. With the help of the ZigBee technology, artificial intelligence and decision support technology, this paper has developed the research on the application technology of agricultural Internet of Things for real-time monitoring of citrus soil moisture and nutrients as well as the research on the integration of fertilization and irrigation decision support system. Some achievements were obtained including single-point multi-layer citrus soil temperature and humidity detection wireless sensor nodes and citrus precision fertilization and irrigation management decision support system. They were applied in citrus base in the Three Gorges Reservoir Area. The results showed that the system could help the grower to scientifically fertilize or irrigate, improve the precision operation level of citrus production, reduce the labor cost and reduce the pollution caused by chemical fertilizer.","authors":["Xueyan Zhang","Jianwu Zhang","Lin Li","Yuzhu Zhang"],"meta":["February 2017Sensors 17(3):447","DOI:10.3390/s17030447"],"references":["312164156_Internet_of_Things_in_agriculture","308727850_A_Real-Time_Web_of_Things_Framework_with_Customizable_Openness_Considering_Legacy_Devices","305627379_Developing_Ubiquitous_Sensor_Network_Platform_Using_Internet_of_Things_Application_in_Precision_Agriculture","309401533_Study_on_wireless_data_transmission_system_based_on_GPRS_and_ARM","304295676_Intelligent_Agriculture_Greenhouse_Environment_Monitoring_System_Based_on_IOT_Technology","261860024_Agricultural_Production_System_Based_on_IoT","258550730_Application_of_the_Internet_of_Things","226663966_Dynamic_Source_Routing_in_Ad_Hoc_Wireless_Networks","226232395_Internet_of_Things","224175759_Future_internet_The_Internet_of_Things"]}