{"id":"313919093_COMPOSITIONAL_GAME_THEORY","abstract":"This paper aims to significantly impact the way we conceive of, reason about, and construct software for economic game theory. We achieve this by building an new and original model of economic games based upon the computer science idea of composition-ality: concretely we i) give a number of operators for building up complex and irregular games from smaller and simpler games; and ii) show how the equilibria of these complex games can be defined recursively from the equilibria of their simpler components. We apply compositional reasoning to sophisticated games where agents must reason about how their actions effect future games and how those future games effect the utility they receive. This requires further originality in that we augment the usual lexicon of games with a new concept of coutility. This notion — dual to utility — arises because, in order for games to accept utility, this utility must be generated by other games. A third source of originality is the representation of our games as string diagrams so as to give a clear visual interface to manipulate them. Our fourth, and final, source of originality is a categorical formalisation of these intuitive string diagrams which guarantees our model is mathematically rigourous.","authors":["Neil Ghani","Julian Hedges","Viktor Winschel","Philipp Zahn"],"meta":["February 2017"],"references":["277723134_Higher-Order_Game_Theory","253064718_Sequential_games_and_optimal_strategies","232253028_Coalgebraic_Analysis_of_Subgame-perfect_Equilibria_in_Infinite_Games_without_Discounting","314828229_A_new_notation_for_arrows","273092046_A_Coalgebraic_Framework_for_Games_in_Economics","266982862_Interacting_Bialgebras_Are_Frobenius","266436752_Categories_for_the_working_mathematician_4th_corrected_printing","263980586_From_classical_to_epistemic_game_theory","262974391_Monad_Transformers_for_Backtracking_Search","235339896_Lambek_vs_Lambek_Functorial_Vector_Space_Semantics_and_String_Diagrams_for_Lambek_Calculus"]}