{"id":"313910414_Lexicon-enhanced_sentiment_analysis_framework_using_rule-based_classification_scheme","abstract":"With the rapid increase in social networks and blogs, the social media services are increasingly being used by online communities to share their views and experiences about a particular product, policy and event. Due to economic importance of these reviews, there is growing trend of writing user reviews to promote a product. Nowadays, users prefer online blogs and review sites to purchase products. Therefore, user reviews are considered as an important source of information in Sentiment Analysis (SA) applications for decision making. In this work, we exploit the wealth of user reviews, available through the online forums, to analyze the semantic orientation of words by categorizing them into +ive and -ive classes to identify and classify emoticons, modifiers, general-purpose and domain-specific words expressed in the public’s feedback about the products. However, the un-supervised learning approach employed in previous studies is becoming less efficient due to data sparseness, low accuracy due to non-consideration of emoticons, modifiers, and presence of domain specific words, as they may result in inaccurate classification of users’ reviews. Lexicon-enhanced sentiment analysis based on Rule-based classification scheme is an alternative approach for improving sentiment classification of users’ reviews in online communities. In addition to the sentiment terms used in general purpose sentiment analysis, we integrate emoticons, modifiers and domain specific terms to analyze the reviews posted in online communities. To test the effectiveness of the proposed method, we considered users reviews in three domains. The results obtained from different experiments demonstrate that the proposed method overcomes limitations of previous methods and the performance of the sentiment analysis is improved after considering emoticons, modifiers, negations, and domain specific terms when compared to baseline methods.","authors":["Dr. Muhammad Zubair Asghar","Aurangzeb Khan","Shakeel Ahmad","Maria Qasim"],"meta":["February 2017PLoS ONE e0171649(12(2)):1-22","DOI:10.1371/journal.pone.0171649"],"references":["312119180_Pretata_Predicting_TATA_binding_proteins_with_novel_features_and_dimensionality_reduction_strategy","305483497_SentiHealth_creating_health-related_sentiment_lexicon_using_hybrid_approach","305473707_Leveraging_Cross-Domain_Social_Media_Analytics_to_Understand_TV_Topics_Popularity","301216588_Using_Neural_Word_Embeddings_to_Model_User_Behavior_and_Detect_User_Segments","339502749_Opinion_Mining_and_Sentiment_Analysis","308964537_A_Unified_Framework_for_Creating_Domain_Dependent_Polarity_Lexicons_from_User_Generated_Reviews","307632886_A_Part-Of-Speech_Term_Weighting_Scheme_for_Biomedical_Information_Retrieval","304069459_Sentiment_Analysis_Mining_Opinions_Sentiments_and_Emotions_Bing_Liu_University_of_Illinois_at_Chicago_Cambridge_University_Press_2015_ISBN_9781107017894","303919263_Sentiment_classification_of_movie_reviews_by_supervised_machine_learning_approaches","298799608_Affective_Computing_and_Sentiment_Analysis"]}