{"id":"313903670_Interorganisational_social_capital_and_innovation_a_multiple_case_study_in_wine_producers_networks_in_Serra_Gaucha","abstract":"The social capital issue is related, in the organisational context, to the creation of competitive advantages for companies, starting with the assumption that economic variables are not adequate for social development and building a sustainable environment. In addition, the social capital has become a competitive resource, since it can enhance the individual and collective capacity based on collaborative practices. Also, it may become a source of improvement or maintenance of the competitiveness in member organisations in networks. At the same time, the significance of the innovation process for organisational competitiveness is a well known fact, while the same does not occur independently and is influenced by several factors. In this sense, this study is aimed primarily at checking whether the social capital and competitiveness factors have an impact on the innovation of companies linked to networks. Therefore, making use of self-administered questionnaires as data-collection technique, a descriptive and quantitative study was conducted. To analyse the results, analysis of variance and linear regression were used. The main results illustrate the differences between sources of information for innovation in these networks. In addition, the study results confirm that social capital has influence on the dimensions for the improvement of competitiveness and these dimensions, in turn, influence some types of innovation.","authors":["Kadigia Faccin","Denise Genari","Janaina Macke"],"meta":["January 2017RAI revista de administração e inovação 14(1):52-66","DOI:10.1016/j.rai.2016.12.002"],"references":["312446739_Desenvolvimento_local_empreendedorismo_e_capital_social_O_caso_de_terra_roxa_no_estado_do_parana","305875192_CAPITAL_SOCIAL_RECURSO_FACILITADOR_DA_INOVACAO_NA_GESTAO","324994990_It's_the_Connections_The_Network_Perspective_in_Interorganizational_Research","315362227_COLLABORATION_NETWORKS_STRUCTURAL_HOLES_AND_INNOVATION_A_LONGITUDINAL_STUDY","312918756_Social_Capital_in_the_Creation_of_Human_Capital","312446608_Sociedade_Civil_Capital_Social_e_Desenvolvimento_Economico","312416127_Collective_competence_and_social_capital_analysis_in_collaborative_networks_Journal_of_Systemics","306199970_Building_a_Network_Theory_of_Social_Capital","306157082_Social_Capital_in_the_Creation_of_Human_Capital_American","303854826_J_Social_capital_intellectual_capital_and_the_organizational_advantage"]}