{"id":"313902038_Design_process_and_tools_for_dynamic_neuromechanical_models_and_robot_controllers","abstract":"We present a serial design process with associated tools to select parameter values for a posture and locomotion controller for simulation of a robot. The controller is constructed from dynamic neuron and synapse models and simulated with the open-source neuromechanical simulator AnimatLab 2. Each joint has a central pattern generator (CPG), whose neurons possess persistent sodium channels. The CPG rhythmically inhibits motor neurons that control the servomotor's velocity. Sensory information coordinates the joints in the leg into a cohesive stepping motion. The parameter value design process is intended to run on a desktop computer, and has three steps. First, our tool FEEDBACKDESIGN uses classical control methods to find neural and synaptic parameter values that stably and robustly control servomotor output. This method is fast, testing over 100 parameter value variations per minute. Next, our tool CPGDESIGN generates bifurcation diagrams and phase response curves for the CPG model. This reveals neural and synaptic parameter values that produce robust oscillation cycles, whose phase can be rapidly entrained to sensory feedback. It also designs the synaptic conductance of inter-joint pathways. Finally, to understand sensitivity to parameters and how descending commands affect a leg's stepping motion, our tool SIMSCAN runs batches of neuromechanical simulations with specified parameter values, which is useful for searching the parameter space of a complicated simulation. These design tools are demonstrated on a simulation of a robot, but may be applied to neuromechanical animal models or physical robots as well.","authors":["Nicholas S. Szczecinski","Alexander Hunt","Roger D. Quinn"],"meta":["February 2017Biological Cybernetics 111(1)","DOI:10.1007/s00422-017-0711-4","Project: Synthetic Nervous Systems for adaptive robotic locomotion"],"references":["283435492_Central-Complex_Control_of_Movement_in_the_Freely_Walking_Cockroach","282132158_Introducing_MantisBot_Hexapod_Robot_Controlled_by_a_High-Fidelity_Real-Time_Neural_Simulation","281644405_A_biologically_based_neural_system_coordinates_the_joints_and_legs_of_a_tetrapod","321561757_Neuromechanical_Modeling_of_Posture_and_Locomotion","321526419_Neural_Basis_of_Elementary_Behavior_in_Stick_Insects","302255116_Mechanosensory_Signal_Processing_Impact_on_and_Modulation_by_Pattern-Generating_Networks_Exemplified_in_Locust_Flight_and_Walking","289539553_A_Neuromechanical_Model_of_Spinal_Control_of_Locomotion","280218996_Force_feedback_reinforces_muscle_synergies_in_insect_legs","279458099_Controlling_legs_for_locomotion_-_Insights_from_robotics_and_neurobiology","278042209_Task-dependent_Modification_of_Leg_Motor_Neuron_Synaptic_Input_Underlying_Changes_in_Walking_Direction_and_Walking_Speed"]}