{"id":"314092739_Biometric_Systems_Private_by_Design_Reasoning_about_privacy_properties_of_biometric_system_architectures","abstract":"This work aims to show the applicability, and how, of privacy by design approach to biometric systems and the benefit of using formal methods to this end. Starting from a general framework that has been introduced at STM in 2014, that enables to define privacy architectures and to formally reason about their properties, we explain how it can be adapted to biometrics. The choice of particular techniques and the role of the components (central server, secure module, biometric terminal, smart card, etc.) in the architecture have a strong impact on the privacy guarantees provided by a biometric system. In the literature, some architectures have already been analysed in some way. However, the existing proposals were made on a case by case basis, which makes it difficult to compare them and to provide a rationale for the choice of specific options. In this paper, we describe, on different architectures with various levels of protection, how a general framework for the definition of privacy architectures can be used to specify the design options of a biometric systems and to reason about them in a formal way.","authors":["Julien Bringer","Herve Chabanne","Daniel Le Metayer","Roch Lescuyer"],"meta":["February 2017Transactions on Data Privacy 11(2)"],"references":["269819463_On_the_Leakage_of_Information_in_Biometric_Authentication","296676923_Privacy_by_Design_in_Practice_Reasoning_about_Privacy_Properties_of_Biometric_System_Architectures","281159566_Trust_Driven_Strategies_for_Privacy_by_Design_Long_Version","270905778_Privacy_by_Design_On_the_Conformance_Between_Protocols_and_Architectures","264623841_Privacy_Architectures_Reasoning_About_Data_Minimisation_and_Integrity","262321509_Privacy_by_Design_a_Formal_Framework_for_the_Analysis_of_Architectural_Choices","262237459_ZQL_a_compiler_for_privacy-preserving_data_processing","261387192_Fully_homomorphic_faces","261072673_Security_and_Privacy_by_Declarative_Design","259542700_BioPSTM_A_formal_model_for_privacy_security_and_trust_in_template-protecting_biometric_authentication"]}