{"id":"314010808_The_Kalker_book_of_tables_for_non-Hertzian_contact_of_wheel_and_rail","abstract":"A new regularisation of non-elliptical contact patches has been introduced, which enables building the look-up table called by us the Kalker book of tables for non-Hertzian contact (KBTNH), which is a fast creep force generator that can be used by multibody dynamics system simulation programs. The non-elliptical contact patch is regularised by a simple double-elliptical contact region (SDEC). The SDEC region is especially suitable for regularisation of contact patches obtained with approximate non-Hertzian methods for solving the normal contact problem of wheel and rail. The new regularisation is suitable for wheels and rails with any profiles, including worn profiles.\nThe paper describes the new procedure of regularisation of the non-elliptical contact patch, the structure of the Kalker book of tables, and parameterisation of the independent variables of the tables and creep forces.\nA moderate volume Kalker book of tables for SDEC region suitable for simulation of modern running gears has been computed in co-simulation of Matlab and program CONTACT.\nTo access the creep forces of the Kalker book of tables, the linear interpolation has been applied.\nThe creep forces obtained from KBTNH have been compared to those obtained by program CONTACT and FASTSIM algorithm. FASTSIM has been applied on both the contact ellipse and the SDEC contact patch. The comparison shows that KBTNH is in good agreement with CONTACT for a wide range of creepage condition and shapes of the contact patch, whereas the use of FASTSIM on the elliptical patch and SDEC may lead to significant deviations from the reference CONTACT solutions.\nThe computational cost of calling creep forces from KBTNH has been estimated by comparing CPU time of FASTSIM and KBTNH. The KBTNH is 7.8–51 times faster than FASTSIM working on 36–256 discretisation elements, respectively.\nIn the example of application, the KBTNH has been applied for curving simulations and results compared with those obtained with the creep force generator employing the elliptical regularisation. The results significantly differ, especially in predicted creepages, because the elliptical regularisation neglects generation of the longitudinal creep force by spin creepage.","authors":["Jerzy Piotrowski","Binbin Liu","Stefano Bruni"],"meta":["February 2017Vehicle System Dynamics 55(6):1-27","DOI:10.1080/00423114.2017.1291980"],"references":["282976398_An_alternative_to_FASTSIM_for_tangential_solution_of_the_wheel-rail_contact","277139013_Influence_of_wheel-rail_contact_modelling_on_vehicle_dynamic_simulation","266961249_A_novel_method_to_model_wheel-rail_normal_contact_in_vehicle_dynamics_simulation","245308998_A_simplified_model_of_wheelrail_contact_mechanics_for_non-Hertzian_problems_and_its_application_in_rail_vehicle_dynamic_simulations","233056701_Determination_of_the_wheel_rail_contact_patch_in_semi-Hertzian_conditions","233037756_Assessing_the_accuracy_of_different_simplified_frictional_rolling_contact_algorithms","316799307_Three-Dimensional_Elastic_Bodies_in_Rolling_Contact","304058672_A_non-Hertzian_method_for_solving_wheel-rail_normal_contact_problem_taking_into_account_the_effect_of_yaw","288533645_Book_of_tables_for_the_Hertzian_creep-force_law","265373647_The_Effect_of_Spin_Upon_the_Rolling_Motion_of_an_Elastic_Sphere_on_a_Plane","253868585_The_steady-state_tangential_contact_problem_for_a_falling_drop_type_of_contact_area_on_corrugated_rail_by_simplified_theory_of_rolling_contact","245523607_The_Influence_of_Elastic_Deformation_upon_the_Motion_of_a_Ball_Rolling_between_Two_Surfaces","245308692_The_Elastic_Cross-Influence_between_Two_Quasi-Hertzian_Contact_Zones","232911061_A_Fast_Algorithm_for_the_Simplified_Theory_of_Rolling_Contact"]}