{"id":"314092106_Deep_Learning_for_Design_and_Retrieval_of_Nano-photonic_Structures","abstract":"Our visual perception of our surroundings is ultimately limited by the diffraction limit, which stipulates that optical information smaller than roughly half the illumination wavelength is not retrievable. Over the past decades, many breakthroughs have led to unprecedented imaging capabilities beyond the diffraction limit, with applications in biology and nanotechnology. Over the past decades, many breakthroughs have led to unprecedented imaging capabilities beyond the diffraction-limit, with applications in biology and nanotechnology. In this context, nano-photonics has revolutionized the field of optics in recent years by enabling the manipulation of light-matter interaction with subwavelength structures. However, despite the many advances in this field, its impact and penetration in our daily life has been hindered by a convoluted and iterative process, cycling through modeling, nanofabrication and nano-characterization. The fundamental reason is the fact that not only the prediction of the optical response is very time consuming and requires solving Maxwell's equations with dedicated numerical packages. But, more significantly, the inverse problem, i.e. designing a nanostructure with an on-demand optical response, is currently a prohibitive task even with the most advanced numerical tools due to the high non-linearity of the problem. Here, we harness the power of Deep Learning, a new path in modern machine learning, and show its ability to predict the geometry of nanostructures based solely on their far-field response. This approach also addresses in a direct way the currently inaccessible inverse problem breaking the ground for on-demand design of optical response with applications such as sensing, imaging and also for and also for plasmon's mediated cancer thermotherapy.","authors":["Itzik Malkiel","Achiya Nagler","Michael Mrejen","Uri Arieli"],"meta":["February 2017"],"references":["298429887_Deep_Learning_in_Label-free_Cell_Classification","293044782_Plasmon_spectroscopy_Theoretical_and_numerical_calculations_and_optimization_techniques","282362208_An_ultrathin_invisibility_skin_cloak_for_visible_light","280327240_Computational_imaging_Machine_learning_for_3D_microscopy","319770387_Deep_Sparse_Rectifier_Neural_Networks","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","313915291_Introduction","287335367_Introduction","286403857_Inverse_Design_of_Metal_Nanoparticles'_Morphology","284039049_Recursive_deep_models_for_semantic_compositionality_over_a_sentiment_treebank"]}