{"id":"314092546_From_Complex_Event_Processing_to_Simple_Event_Processing","abstract":"Many problems in Computer Science can be framed as the computation of queries over sequences, or \"streams\" of data units called events. The field of Complex Event Processing (CEP) relates to the techniques and tools developed to efficiently process these queries. However, most CEP systems developed so far have concentrated on relatively narrow types of queries, which consist of sliding windows, aggregation functions, and simple sequential patterns computed over events that have a fixed tuple structure. Many of them boast throughput, but in counterpart, they are difficult to setup and cumbersome to extend with user-defined elements. This paper describes a variety of use cases taken from real-world scenarios that present features seldom considered in classical CEP problems. It also provides a broad review of current solutions, that includes tools and techniques going beyond typical surveys on CEP. From a critical analysis of these solutions, design principles for a new type of event stream processing system are exposed. The paper proposes a simple, generic and extensible framework for the processing of event streams of diverse types; it describes in detail a stream processing engine, called BeepBeep, that implements these principles. BeepBeep's modular architecture, which borrows concepts from many other systems, is complemented with an extensible query language, called eSQL. The end result is an open, versatile, and reasonably efficient query engine that can be used in situations that go beyond the capabilities of existing systems.","authors":["Sylvain Hallé"],"meta":["February 2017","Project: BeepBeep 3 Event Stream Query Engine"],"references":["340514944_Java-MaC_A_Run-time_Assurance_Approach_for_Java_Programs","313096464_RIoTBench_A_Real-time_IoT_Benchmark_for_Distributed_Stream_Processing_Platforms","310613994_Apache_spark_A_unified_engine_for_big_data_processing","308894106_Execution_Trace_Analysis_Using_LTL-FO","308365310_When_RV_Meets_CEP","321541304_Runtime_Verification_16th_International_Conference_RV_2016_Madrid_Spain_September_23-30_2016_Proceedings","314165266_Automated_Bug_Finding_in_Video_Games_A_Case_Study_for_Runtime_Monitoring","313575536_Rete_A_fast_algorithm_for_the_many_patternmany_object_pattern_match_problem","312596129_Process_Mining_Data_Science_in_Action","308987412_A_Toolkit_for_Streaming_Process_Data_Analysis"]}