{"id":"314092422_A_Universal_Ordinary_Differential_Equation","abstract":"An astonishing fact was established by Lee A. Rubel in 81: there exists a fixed non-trivial fourth-order polynomial differential algebraic equation (DAE) such that for any continuous function $\\phi$ on the reals, and for any positive continuous function $\\epsilon(t)$, it has a $\\mathcal{C}^\\infty$ solution with $|y(t)-\\phi(t)|<\\epsilon(t)$ for all $t$. Rubel provided an explicit example of such a polynomial DAE. More examples have later been proposed by other authors. However, while these results may seem very surprising, their proofs are quite frustrating for a computability theorist. First, the constructed DAE have no unique solutions for a given initial data. This is very different from usual notions of universality since there is no unambiguous notion of evolution for a given initial data. Second, the proofs usually rely on solutions that are piecewise defined and sometimes non-constructive. Third, the proofs of these results can be interpreted more as the fact that polynomial algebraic differential equations is a too loose a model compared to classical ordinary differential equations. In particular, one may challenge whether the result is really a universality result. The question whether one can require the solution that approximates $\\phi$ to be the unique solution for a given initial data is a well known open problem [Rub81] (page 2), [boshernitzan1986universal] (Conjecture 6.2). In this article, we solve it and show that Rubel's statement holds for polynomial ordinary differential equations (ODEs), and since polynomial ODEs have a unique solution given an initial data, this positively answers Rubel's open problem. More precisely, we show that there exists a \\textbf{fixed} polynomial ODE such that for any $\\phi$ and $\\epsilon$ there exists some initial condition that yields a solution that is $\\epsilon$-close to $\\phi$ at all times.","authors":["Olivier Bournez","Amaury Pouly"],"meta":["February 2017"],"references":["301873714_On_the_Functions_Generated_by_the_General_Purpose_Analog_Computer","309551157_Construction_of_a_universal_ordinary_differential_equation_Cinfty_of_order_3","284286931_Memoire_sur_les_series_divergentes","248730029_Universal_Formulae_and_Universal_Differential_Equations","247837574_The_differential_analyzer_a_new_machine_for_solving_differential_equations","247589929_Some_results_on_analytic_and_meromorphic_solutions_of_algebraic_differential_equations","243086798_A_Simple_Example_for_a_Theorem_of_Vijayaraghavan","222561733_Analog_computers_and_recursive_functions_over_the_reals","222432260_Computability_with_polynomial_differential_equations","222406117_Polynomial_differential_equations_compute_all_real_computable_functions_on_computable_compact_intervals"]}