{"id":"314027311_Raypath_Separation_With_a_High-Resolution_Algorithm_in_a_Shallow-Water_Waveguide","abstract":"One intriguing property that is exploited by ocean acoustic tomography (OAT) is that acoustic signals travel in a multipath. As the first step of OAT, each raypath should be identified with a particular travel time. However, the set of multipath rays generated by an emitted signal is correlated or coherent, as they are produced by reflection and or by refraction in propagation. In this paper, a high-resolution method called smoothing multiple signal classification active large band (MUSICAL) is presented in the context of shallow-water OAT for separating coherent or fully correlated raypaths in the direction-of-arrival temporal domain. The method is a combination of the MUSICAL and spatial-frequency smoothing processing. Furthermore, the performance of smoothing-MUSICAL is illustrated by experiments based on both synthetic data and real data. This algorithm largely improves separation performances and presents fewer artifacts compared with conventional beamforming. In particular, experimental results show that smoothing-MUSICAL is more robust than beamforming facing a noisy environment with moderate signal-to-noise ratio.","authors":["Longyu Jiang","Philippe Roux","Jerome Mars"],"meta":["February 2017IEEE Journal of Oceanic Engineering PP(99):1-12","DOI:10.1109/JOE.2017.2660778","Projects: Array processing based on high-order statisticsOcean acoustic tomography in shallow water"],"references":["248791466_High_spatial_resolution_in_vertical_slice_ocean_acoustic_tomography","228931279_A_nonreciprocal_implementation_of_time_reversal_in_the_ocean","259060651_Ocean_Acoustic_Tomography","243526208_Travel-time_sensitivity_kernels_in_ocean_acoustic_tomography","243525451_Turning_point_filters_Analysis_of_sound_propagation_on_a_gyre-scale","239504095_Detection_Estimation_and_Modulation_Theory_Part_IV_Optimum_Array_Processing","235267581_Optimum_Array_Processing_--_Part_IV_of_Detection_Estimation_and_Modulation_Therory","235017344_Application_of_Advanced_Signal_Processing_Techniques_to_Angle_of_Arrival_Estimation_in_ATC_Navigation_and_Surveillance_Systems","234787133_Array_Signal_Processing_Concepts_and_Techniques","232637881_High_resolution_spatio-temporal_analysis_by_an_active_array"]}