{"id":"314081377_Role_and_review_of_educational_robotic_platforms_in_preparing_engineers_for_industry","abstract":"Recent advances in robotics, specifically in the industrial sector, have highlighted the need to have sophisticated educational and training platforms. The cross-disciplinary nature of robotics demands industrial engineers to acquire knowledge and practical exposure of engineering, computer science and mathematical modelling. Scientists and engineers have succeeded in developing state-of-the-art academic and vocational frameworks to catch up with these advancements. This paper presents a systematic, up-to-date survey of manipulator-based frameworks with a focus on teaching and training of kinematics, dynamics and controls. Here, both virtual tools and platforms employing a real robotic arm are reviewed. These two classes of the framework are discussed to bring forth their benefits and constraints. The study also comments on the contribution of IT to aiding educational robotics. It is an attempt to provide a result-oriented review for both classes. It has been presented in a comparative manner so as to readily assist the readers to choose a robotic simulator/real platform as per their requirements. It is expected that the results of this research will be directly valuable to industrial engineers, vocational trainers, researchers, procurement officials, courses instructors and hobbyists.","authors":["Syed Ali Ajwad","Nida Asim","Muhammad Raza Ul Islam","Jamshed Iqbal"],"meta":["February 2017Maejo International Journal of Science and Technology 11(1):17-34"],"references":["287198642_Disturbance-Observer-Based_Robust_Control_of_a_Serial-link_Robotic_Manipulator_Using_SMC_and_PBC_Techniques","280645964_Towards_Sophisticated_Control_of_Robotic_Manipulators_An_Experimental_Study_on_a_Pseudo-Industrial_Arm","280645704_A_helping_hand_A_lightweight_flexible_under-actuated_exoskeleton_hand_with_a_wide_range_of_potential_applications_from_medicine_to_entertainment","280644441_Design_requirements_of_a_hand_exoskeleton_robotic_device","280644096_Robotized_Task_Time_Scheduling_and_Optimization_Based_on_Genetic_Algorithms_for_non_Redundant_Industrial_Manipulators","280643267_Hardware_Realization_and_PID_Control_of_Multi-Degree_of_Freedom_Articulated_Robotic_Arm","280643216_A_multi-robot_educational_and_research_framework","280643148_Recent_Advances_and_Applications_of_Tethered_Robotic_Systems","312815891_RVS_A_Robot_Visualization_Software_Package","289358255_Surface_estimation_of_a_pedestrian_walk_for_outdoor_use_of_power_wheelchair_based_robot"]}