{"id":"314034927_A_Hidden_Markov_Model_for_Automatic_Transliteration_of_Romanized_Tunisian_Dialect","abstract":"The Tunisian dialect is the naturally spoken language in Tunisia and unlike the MSA (Modern Standard Arabic), it is an informal and non-written Arabic language variant. However, with the growing use of ICT and especially the internet, a written form of Tunisian dialect is emerging: the electronic Tunisian dialect (ETD). Originally used in the SMS with mobile phones, the ETD is becoming increasingly present on the web through social networks. It may be written in both Arabic and Latin Alphabet.\nIn this work, we address the problem of the automatic transliteration of Romanized ETD into Arabic writing. The difficulty of this task lies in the ambiguity that characterizes most of the used Latin characters that can match several possible Arabic transcriptions.\nIn the proposed approach, we consider this issue as a problem of sequential labeling, where a single Arabic character should be assigned to each Latin character composing an ETD word to transliterate, and we propose to implement a solution based on a first-order Hidden Markov Model. The results of our experimentation are presented and discussed.","authors":["Jihene Younes","Emna Souissi","Achour Hadhémi"],"meta":["April 2016","Conference: 2nd International Conference on Arabic Computational Linguistics, Co-located with 17th International Conference on Intelligent Text Processing and Computational Linguistics 2016","Projects: Automatic Processing of the Tunisian Dialect on the Social WebRessource construction of Tunisian Dialect"],"references":["301404868_Automatic_Transliteration_of_Romanized_Dialectal_Arabic","292931819_Utilisation_de_la_translitteration_arabe_pour_l'amelioration_de_l'alignement_de_mots_a_partir_de_corpus_paralleles_francais-arabe","271376127_Improving_Rule-Based_Method_for_Arabic_POS_Tagging_Using_HMM_Technique","236006335_YADAC_Yet_Another_Dialectal_Arabic_Corpus","230668392_A_Morphological_Analyzer_for_Egyptian_Arabic","227240769_On_Arabic_Transliteration","340815508_A_quantitative_view_of_Tunisian_dialect_electronic_writing","312829586_Arabic_Transliteration_of_Romanized_Tunisian_Dialect_Text_A_Preliminary_Investigation","300254033_Constructing_Linguistic_Resources_for_the_Tunisian_Dialect_Using_Textual_User-Generated_Contents_on_the_Social_Web","270877694_Romanized_Arabic_Transliteration","241185775_Arabic_Dialect_Identification","237316297_Typology_of_motion_event_in_Tunisian_Arabic"]}