{"id":"314093717_On_the_Origin_of_Deep_Learning","abstract":"This paper is a review of the evolutionary history of deep learning models. It covers from the genesis of neural networks when associationism modeling of the brain is studied, to the models that dominate the last decade of research in deep learning like convolutional neural networks, deep belief networks, and recurrent neural networks, and extends to popular recent models like variational autoencoder and generative adversarial nets. In addition to a review of these models, this paper primarily focuses on the precedents of the models above, examining how the initial ideas are assembled to construct the early models and how these preliminary models are developed into their current forms. Many of these evolutionary paths last more than half a century and have a diversity of directions. For example, CNN is built on prior knowledge of biological vision system; DBN is evolved from a trade-off of modeling power and computation complexity of graphical models and many nowadays models are neural counterparts of ancient linear models. This paper reviews these evolutionary paths and offers a concise thought flow of how these models are developed, and aims to provide a thorough background for deep learning. More importantly, along with the path, this paper summarizes the gist behind these milestones and proposes many directions to guide the future research of deep learning.","authors":["Haohan Wang","Bhiksha Raj"],"meta":["February 2017"],"references":["319770430_Rich_feature_hierarchies_for_accurate_object_detection_and_semantic_segmentation","319770414_Identity_Mappings_in_Deep_Residual_Networks","319770355_Generative_Adversarial_Nets","319770291_Very_Deep_Convolutional_Networks_for_Large-Scale_Image_Recognition","319770239_Identifying_and_attacking_the_saddle_point_problem_in_high-dimensional_non-convex_optimization","319770229_Auto-Encoding_Variational_Bayes","319770104_Deep_Learning_Requires_Rethinking_Generalization","319569656_Select-additive_learning_Improving_generalization_in_multimodal_sentiment_analysis","319333594_Using_the_general_linear_mixed_model_to_analyse_unbalanced_repeated_measures_and_longitudinal_data","317194083_Wide_Residual_Networks"]}