{"id":"314092558_Benefits_of_Cache_Assignment_on_Degraded_Broadcast_Channels","abstract":"Degraded K-user broadcast channels (BC) are studied when receivers are facilitated with cache memories. Lower and upper bounds are derived on the capacity-memory tradeoff, i.e., on the largest rate of reliable communication over the BC as a function of the receivers' cache sizes, and the bounds are shown to match for some special cases. The lower bounds are achieved by two new coding schemes that benefit from non-uniform cache assignment. Lower and upper bounds are also established on the global capacity-memory tradeoff, i.e., on the largest capacity-memory tradeoff that can be attained by optimizing the receivers' cache sizes subject to a total cache memory budget. The bounds coincide when the total cache memory budget is sufficiently small or sufficiently large, characterized in terms of the BC statistics. For small cache memories, it is optimal to assign all the cache memory to the weakest receiver. In this regime, the global capacity-memory tradeoff grows as the total cache memory budget divided by the number of files in the system. In other words, a perfect global caching gain is achievable in this regime and the performance corresponds to a system where all cache contents in the network are available to all receivers. For large cache memories, it is optimal to assign a positive cache memory to every receiver such that the weaker receivers are assigned larger cache memories compared to the stronger receivers. In this regime, the growth rate of the global capacity-memory tradeoff is further divided by the number of users, which corresponds to a local caching gain. Numerical indicate suggest that a uniform cache-assignment of the total cache memory is suboptimal in all regimes unless the BC is completely symmetric. For erasure BCs, this claim is proved analytically in the regime of small cache-sizes.","authors":["Shirin Saeedi Bidokhti","Michele Wigger","Aylin Yener"],"meta":["February 2017"],"references":["309402951_A_Rate-Distortion_Approach_to_Caching","319366728_Wireless_coded_caching_A_topological_perspective","319366579_The_exact_rate-memory_tradeoff_for_caching_with_uncoded_prefetching","317031907_Improved_Lower_Bounds_for_Coded_Caching","315853925_A_new_converse_bound_for_coded_caching","314028965_Fundamental_Limits_of_Cache-Aided_Wireless_BC_Interplay_of_Coded-Caching_and_CSIT_Feedback","313692847_Fundamental_Limits_of_Cache-Aided_Wireless_BC_Interplay_of_Coded-Caching_and_CSIT_Feedback","313450756_Edge-Facilitated_Wireless_Distributed_Computing","309498959_Complete_interference_mitigation_through_receiver-caching_in_Wyner's_networks","309333047_An_upper_bound_on_the_capacity-memory_tradeoff_of_degraded_broadcast_channels"]}