{"id":"314036007_Implementasi_Metode_Profile_matching_untuk_Penentuan_Penerimaan_Usulan_Penelitian_Internal_Dosen_STMIK_El_Rahma","abstract":"Abstrack – Lecturer is one of the essential components in a system in higher education. Universities are obliged conducts research and community service, in addition to implementing education as mandated by Law No. 20 of 2003 on National Education System Article 20. STMIK El Rahma through research institutions and community service (LPPM) held for faculty research. Management, appraisal and financing fully implemented professionally and proportionately. This research is to design a decision support system application on the merits of internal faculty research proposals using profile matching method. Assessment and calculation of the value gap based on five criteria: abstract, introduction, literature review, research methods and suitability of the research budget and schedule. research results show that the method of matching profiles can be implemented in a decision support system to assess the feasibility of the proposed research proposal accurately, professionally and proportionately based on predetermined evaluation criteria. Abstrak – Dosen adalah salah satu komponen esensial dalam suatu sistem pendidikan di perguruan tinggi. Perguruan tinggi berkewajiban menyelenggarakan penelitian dan pengabdian kepada masyarakat, disamping melaksanakan pendidikan sebagaimana diamanahkan oleh Undang-undang Nomor 20 Tahun 2003 tentang Sistem Pendidikan Nasional Pasal 20. STMIK El Rahma melalui lembaga penelitian dan pengabdian masyarakat (LPPM) menyelenggarakan penelitian bagi dosen. Pengelolaan, penilaian dan pendanaan sepenuhnya dilaksanakan secara profesional dan proporsional. Penelitian ini merancang sebuah aplikasi sistem pendukung keputusan penentuan kelayakan proposal penelitian internal dosen menggunakan metode profile matching. Penilaian dan perhitungan nilai gap berdasarkan lima kriteria yaitu abstrak, pendahuluan, tinjauan pustaka, metode penelitian dan kesesuaian anggaran dan jadwal penelitian. hasil penelitian menunjukan bahwa metode profil matching dapat diimplementasi dalam sebuah sistem pendukung keputusan untuk melakukan penilaian kelayakan proposal usulan penelitian dengan akurat, profesional dan proporsional berdasarkan kriteria penilaian. Kata Kunci: SPK, profile matching, penelitian internal","authors":["Edi Faizal","Manajemen Informatika","Stmik El","Rahma Yogyakarta"],"meta":["January 2014"],"references":["31663591_Software_Engineering_A_Practitioner's_Approach_RJ_Pressman"]}