{"id":"314084149_Congestion_Detection_and_Alleviation_in_Multihop_Wireless_Sensor_Networks","abstract":"Multiple traffic flows in a dense environment of a mono-sink wireless sensor network (WSN) experience congestion that leads to excessive energy consumption and severe packet loss. To address this problem, a Congestion Detection and Alleviation (CDA) mechanism has been proposed. CDA exploits the features and the characteristics of the sensor nodes and the wireless links between them to detect and alleviate node- and link-level congestion. Node-level congestion is detected by examining the buffer utilisation and the interval between the consecutive data packets. However, link-level congestion is detected through a novel procedure by determining link utilisation using back-off stage of Carrier Sense Multiple Access with Collision Avoidance (CSMA/CA). CDA alleviates congestion reactively by either rerouting the data traffic to a new less congested, more energy-efficient route or bypassing the affected node/link through ripple-based search. The simulation analysis performed in ns-2.35 evaluates CDA with Congestion Avoidance through Fairness (CAF) and with No Congestion Control (NOCC) protocols. The analysis shows that CDA improves packet delivery ratio by 33% as compared to CAF and 54% as compared to NOCC. CDA also shows an improvement in throughput by 16% as compared to CAF and 36% as compared to NOCC. Additionally, it reduces End-To-End delay by 17% as compared to CAF and 38% as compared to NOCC.","authors":["Omer Chughtai","Nasreen Badruddin","Muhammad Maaz Rehan","Abid Khan"],"meta":["February 2017Wireless Communications and Mobile Computing 2017:1-13","DOI:10.1155/2017/9243019"],"references":["308724740_Congestion-aware_and_traffic_load_balancing_scheme_for_routing_in_WSNs","291384262_Congestion_detection_technique_for_multipath_routing_and_load_balancing_in_WSN","272420011_Distributed_On-Demand_Multi-Optional_Routing_Protocol_in_Multi-hop_Wireless_Networks","272420001_A_Congestion-aware_and_Energy_efficient_Traffic_Load_Balancing_Scheme_for_Routing_in_WSNs","271429954_Reliability-constrained_routing_for_traffic_load_balancing_in_Wireless_Sensor_Networks","348125883_Concepts_Applications_Experimentation_and_Analysis_of_Wireless_Sensor_Networks","314835049_CODA_congestion_detection_and_avoidance_in_sensor_networks","274320692_Congestion_control_mechanisms_in_wireless_sensor_networks_A_survey","260712198_Mobile_Ad_Hoc_Networking_Milestones_Challenges_and_New_Research_Directions","243775695_Introduction_to_Wireless_and_Mobile_Systems"]}