{"id":"314189028_Looking_into_houses_analysis_of_LBK_ceramic_technological_change_on_a_household_level","abstract":"Excavations on the Neolithic site of Balatonszárszó-Kis-erdei-dűlő, located in western Hungary in central Transdanubia, on the southern shore of Lake Balaton, revealed several thousand features. On the basis of material culture and architectural features, the settlement can be assigned to the Central European Linearbandkeramik culture (LBK; ca. 5,350–5,000/4,900 cal. BC). Apart from pits, traces of 48 houses were discovered. At least 14 other sets of features could also be interpreted as houses, mainly through the presence of characteristic elongated pits.\n\nIn the first model of the site’s development, five pottery style groups were distinguished on the basis of stylistic elements such as shape and decoration. These style groups show a spatial pattern within the settlement. Their major characteristics are easy to correlate with traditional typochronological units of the LBK in the western Carpathian Basin. Although chronological relevance can be attributed to the groups, certain typological and stylistic attributes had a long duration and appear in different style groups.\nFor the purposes of this study, eight houses and their associated features were selected. The ceramics from these features are characteristic of each style group. The aim was to examine the technology of ceramics, in particular choices in raw materials and intentionally added tempers, as well as building techniques.\n\nDuring a previous analysis of ceramics from the settlement, 461 sherds were chosen for macroscopic analysis, from which 131 samples were selected for further petrographic thin section analysis. Of these samples, 99 come from the eight houses and pits examined in this study. These features produced a total of 9,161 sherds. As part of the analysis of vessel building techniques, all the available material from the examined houses was assessed, out of which 109 vessels could be attributed to a forming method. Ceramic petrographic results show that there is a clear change in ceramic technology at household level. The earliest houses of the site show little variability in choices of raw materials and tempers, while houses of Style groups 2–5 show increased choice in raw materials and purposefully added tempers. As far as vessel fashioning is concerned, an opposite trend can be observed. Style group 1 ceramics show considerable variety in technical practices, with at least three forming methods, while ceramics in Style groups 2–3 and 5 are characterized by only one or two forming methods. Thus it seems that variability in building methods slightly decreased towards the end of the settlement.\n\nCeramic technological changes could be identified on a household level, providing an insight into settlement dynamics. These patterns in the use of raw materials/tempers and building methods may be related to the fact that producers came from different learning networks and had different conceptions of how to build a culturally appropriate vessel. The strength of analysing ceramic technologies on a household level is that we are able to model where ceramic technological changes first appeared within a given settlement and we\ncan assess the nature of these changes. In turn, these patterns can be correlated with typochronology and the analysis of other types of material culture from the part of the site where the changes appeared. In this way we can improve our understanding of settlement dynamics and social changes.","authors":["Attila Kreiter","Tibor Marton","Louise Gomart","Krisztián Oross"],"meta":["March 2017","In book: Matières à Penser. Raw materials Acquisition and Processing in Early Neolithic Pottery Productions. Proceedings of the Workshop of Namur (Belgium) 29 and 30 May 2015. (pp.111-132)Edition: Séances de la Société préhistorique française 11Publisher: Société préhistorique françaiseEditors: Laurence Burnez--Lanotte"],"references":["278034591_''Say_let_it_be_spared_from_eyes_for_a_ware_cannot_survive_eyes''_Personification_of_pots_among_Oromo_of_Wallagga_Ethiopia","317143951_Entangled_traditions_Lengyel_and_Tisza_ceramic_technology_in_a_Late_Neolithic_settlement_in_northern_Hungary","303264595_Thoughts_and_adjustments_in_the_potter's_backyard","295304286_Artefacts_as_categories_a_study_of_ceramic_variability_in_central_India","292524530_Methods_of_pottery_manufacture_in_the_Kavango_region_of_Namibia_two_case_studies","292458735_Wheel_throwing_technique_and_craft_specialization","287643100_Social_and_technical_identity_in_a_clay_crystal_ball_En_The_Archaeology_of_Social_Boundaries_editado_por_M_Stark_pp","285979235_The_sociology_of_pottery_Questions_and_hypotheses_arising_from_contemporary_Mexican_work","277017942_Standardization_of_Ceramic_Assemblages_Transmission_Mechanisms_and_Diffusion_of_Morpho-Functional_Traits_across_Social_Boundaries","276508779_Expressing_Difference_Inequality_and_House-based_Potting_in_a_First-millennium_ad_Community_Burkina_Faso_West_Africa"]}