{"id":"314188769_MIDGAR_interoperabilidad_de_objetos_en_el_marco_de_Internet_de_las_Cosas_mediante_el_uso_de_Ingenieria_Dirigida_por_Modelos","abstract":"In the last years has appeared a revolution in the world of objects thanks to Smart Objects, sensors, and actuators, and the integration of these ones with the Internet of Things. This has given the opportunity of leveraging the whole collected information by the sensors and using this information in the Cloud (Cloud Computing), making there the required computation, and using the Cloud to interconnect the objects between themselves. The classic and indefatigable example about this case is the smart fridge, which will call our smartphone when we are in the supermarket to notify us about what we have to buy. Or even, if we move forward in the future, our own servant robot will do this type of labour, while it talks with its friends, who will be, no more no less, the remainder of the smart electrical appliances that will live in our house.\nHowever, the Internet of Things is a field still barely exploited, very recent, and which needs a lot of investigation. It is necessary to connect the own objects to allow interacting automatically amongst themselves at the same time that these interconnections will be easily definable by any type of person. These interconnections can facilitate the daily life of different fields. It can improve our life at home, in the so-called Smart Homes; it can make better the cities livability creating in this way Smart Cities; it can protect the culture and heritage of towns creating Smart Towns; it can improve the security, the productivity, and the labour conditions in the industry through the Industrial Internet of Things, also named as Industry 4.0; finally, it can enhance our communication with The Earth to be able to understand it better through the Smart Earth. These improvements are obtained through the interconnections of different Smart Objects, sensors, and actuators.\nTo facilitate this task and obtain an abstraction which allows to any type of user create these interconnections, and at the same time that avoid the classic and so known problems of the Software Crisis, it has been decided to use Model-Driven Engineering, in order to be able to create Domain-Specific Languages. These Domain-Specific Languages will allow offering an abstraction that moves the creation of the necessary software of the objects that are in the Internet of Things closer to the users, as well as its maintenance.\nTo interconnect these objects there are different methods: The objects can be interconnected between themselves through a public cloud, using different private or own clouds, or as it occurs in some researches, using Online Social Networks as the point of interconnection amongst objects and between objects and people.\nNotwithstanding, not everything in the Internet of Things is based on the objects, although the objects are closely connected. An important point in the Internet of Things is the security, exactly the cryptology, above everything after the last problems and leaks that have appeared in the last years. This remembers us how important is the privacy in our lives and how dangerous is the Internet, and therefore the Internet of Things, for our life. This is why the investigation in security is necessary to be able to create a secure Internet of Things.\nAnother point that appears is the level of intelligence of these objects, because they may not have intelligence or have Artificial Intelligence to do different types of actions, as can be to take decisions using Fuzzy Logic, learning with Machine Learning, distinguish objects applying Computer Vision, or understand people language through Natural Language Processing. Each of these things can allow to the objects have more or less intelligence, or even allows creating or improving the robots, which field is known as Robotics.\nThe problem of all this, as it has been happening in recent years and it has been incrementing with the appearance of the Internet of Things, is the huge quantity of data necessary to be processed, being many times required in real time. This implies that it is essential the use of Big Data tools to be able to keep an adequate flow and constant of data processing to be able to offer a proper service in an Internet of Things platform and their connected objects.\nAll of the above is part of the problems and the possible solutions to the existing problems in the Internet of Things, being explained respectively in the ‘Bloque III’ and ‘Bloque IV’ of this doctoral dissertation. Thus, it has been contemplated a series of objectives that are itemised in the hypothesis of this doctoral dissertation with the purpose of facilitating their verification. This has led to create different prototypes that have allowed obtaining results and conclusions that verify the objectives of this doctoral dissertation and, as a whole, the hypothesis, as this is presented in the final conclusions.\nClearly, in this doctoral dissertation is impossible to resolve every problem of the Internet of Things world. Besides, from this doctoral dissertation appear other new ways to continue this research that are presented as future work to continue the research path.","authors":["Cristian González García"],"meta":["February 2017","DOI:10.13140/RG.2.2.26332.59529","Thesis for: Doctor of PhilosophyAdvisor: Juan Manuel Cueva Lovelle, B. Cristina Pelayo García-Bustelo","Project: Handbook of Research on Industrial Informatics and the Internet of Things"],"references":[]}