{"id":"314128243_Ontological_distinctions_between_hardware_and_software","abstract":"There are a wide range of positions regarding the ontological nature of computer hardware and software. Moor [The British Journal for the Philosophy of Science 29 (1978), 213-222] argues that there is no significant ontological distinction between the two; Suber [The Journal of Speculative Philosophy 2 (1988), 89-119] argues that computer hardware is a kind of software; Colburn [The Monist (1999), 3-19] defines software as a special kind of entity he calls \"concrete abstraction\", and Turner [Minds and Machines 21 (2011), 135-152] classifies software as a specification. In this paper, I examine the positions of each philosopher, and based on this examination, define ontological categories that account for computer hardware and software. As a result, clear distinctions emerge between computer hardware and software: A software program is a specification that consists of one or more programming language instructions and whose concretization is embodied by an artifact that is designed so that a physical machine may read the concretized instructions, whereas hardware is an artifact whose functions are realized in processes that directly or indirectly bring about the result of some calculation.","authors":["William D. Duncan"],"meta":["February 2017Applied Ontology 12(1):1-28","DOI:10.3233/AO-170175"],"references":["269946996_Artifacts_Art_Works_and_Agency","266850546_Towards_an_Ontology_of_Software_a_Requirements_Engineering_Perspective","264429627_The_Software_Ontology_SWO_A_resource_for_reproducibility_in_biomedical_data_analysis_curation_and_digital_preservation","263019222_Software_is_an_Abstract_Artifact","329140038_Software_Engineering_Foundations_A_Software_Science_Perspective","316806956_Technical_Functions","287353180_Programming_Languages_as_Mathematical_Theories","279339285_Wings_Spoons_Pills_and_Quills_A_Pluralist_Theory_of_Function","274225349_A_Perspective_of_the_Software_Engineering","267123287_Computer_System_Architecture"]}