{"id":"314113092_Operationalization_of_the_Blending_and_the_Levels_of_Abstraction_Theories_with_the_Timed_Observations_Theory","abstract":"Providing a meaning to observations coming from humans (interviews) or machines (data sets) is a necessity to build adequate analysis and efficient models that can be used to take a decision in a given domain. Fauconnier and Turner demonstrates in 1998 the cognitive power of their Blending Theory where the blending of multiple conceptual networks is presented as a general-purpose, fundamental, indispensable cognitive operation to this aim. On the other hand, Floridi proposed in 2008 a theory of levels of abstraction as a fundamental epistemo-logical method of conceptual analysis that can also be used to this aim. Both theories complete together but both lack of mathematical foundations to build an operational data and knowledge modeling method that helps and guides the Analysts and the Modeling Engineers. In this theoretical paper, we introduce the mathematical framework, based on the Timed Observations Theory, designed to build a method of abstraction merging together the Blending Theory and the Levels of Abstraction Theory. Up to our knowledge, this is the first mathematical theory allowing the operationalization of the Blending Theory and the Levels of Abstraction Theory. All over the paper, the mathematical framework is illustrated on an oral exchange between three persons observing a vehicle. We show that this framework allows to build a rational meaning of this exchange under the form of a superposition of three abstraction levels.","authors":["Marc Le Goc","Fabien Vilar"],"meta":["February 2017","DOI:10.5220/0006111103640373","Conference: 9th International Conference on Agents and Artificial Intelligence (ICAART 2017), Porto, Portugal, 24-26 February, 2017At: Porto, PortugalVolume: 2","Project: The Tom4A method (Timed Observations Method for Abstraction)"],"references":["335070326_Learning_Bayesian_Networks_From_Timed_Observations","303997703_Notion_d'observation_pour_le_diagnostic_des_processus_dynamiques_Application_a_Sachem_et_a_la_decouverte_de_connaissances_temporelles","291824270_Emergence_of_Regularities_in_the_Stochastic_Behavior_of_Human","264006075_Reducing_the_Gap_between_Experts'_Knowledge_and_Data_The_TOM4D_Methodology","235705607_Knowledge_Engineering_and_Management_-_The_CommonKADS_Methodology","220636854_The_Method_of_Levels_of_Abstraction","325752137_The_Method_of_Levels_of_Abstraction","265354140_Categories_for_the_working_mathematician_2nd_ed","243678271_Model-based_Diagnosis_and_Prediction_of_Behaviour","220626074_Levels_of_abstraction_and_the_Turing_test_Kybernetes_393_423-440"]}