{"id":"314118866_Why_being_dialogical_must_come_before_being_logical_the_need_for_a_hermeneutical-dialogical_approach_to_robotic_activities","abstract":"Currently, our official rationality is still of a Cartesian kind; we are still embedded in a mechanistic order that takes it that separate, countable entities (spatial forms), related logically to each other, are the only ‘things’ that matter to us—an order clearly suited to advances in robotics. Unfortunately, it is an order that renders invisible ‘relational things’, non-objective things that exist in time, in the transitions from one state of affairs to another, things that ‘point’ toward possibilities in the future, which mean something to us. I have called such things, hermeneutical–dialogical ‘things’ as they gradually emerge in our back-and-forth, step-by-step relations to the others and otherneses in our surroundings; they consist in the ‘promissory’ things sustaining our trust in each other and in our authorities, in our social organizations and social institutions, and in our culture. Clearly, we need to understand better, not only what robots can, and cannot do, but also the long-term ethical and political implications of inserting robotic activities into our everyday ways of relating ourselves to our surroundings if we are to avoid the dystopian futures envisaged by some. Descartes’ aim of “making ourselves, as it were, masters and possessors of nature,” forgets our larger task of our making ourselves into human beings—of doing together in dialog what we cannot do apart.","authors":["John Shotter"],"meta":["March 2019AI & SOCIETY 34(1)","DOI:10.1007/s00146-017-0697-4"],"references":["278396983_From_'after_the_fact'_objective_analyses_to_immediate_'before_the_fact'_living_meanings","344896617_Plans_and_the_structure_of_behavior","324318795_Speech_Genres_and_Other_Late_Essays","324291990_Speech_Genres_and_Other_Late_Essays","321753800_Toward_a_Philosophy_of_the_Act","318494435_Philosophical_Investigations","317845523_The_Idea_of_a_Social_Science","315182973_Toward_a_Philosophy_of_the_Act","302213803_Why_computers_must_have_bodies_in_order_to_be_intelligent","289710796_Excerpts_from_the_principles_of_psychology","272160066_Cognition_and_Reality","271523899_The_Future_of_Employment_How_Susceptible_Are_Jobs_to_Computerisation","271226696_Undisciplining_Social_Science_Wittgenstein_and_the_Art_of_Creating_Situated_Practices_of_Social_Inquiry","271215975_Marxism_and_the_Philosophy_of_Language","271112082_Speech_Genres_Other_Late_Essays"]}