{"id":"314164153_SLAM_-A_highly_efficient_and_temporally_scalable_incremental_SLAM_framework","abstract":"The most common way to deal with the uncertainty present in noisy sensorial perception and action is to model the problem with a probabilistic framework. Maximum likelihood estimation is a well-known estimation method used in many robotic and computer vision applications. Under Gaussian assumption, the maximum likelihood estimation converts to a nonlinear least squares problem. Efficient solutions to nonlinear least squares exist and they are based on iteratively solving sparse linear systems until convergence. In general, the existing solutions provide only an estimation of the mean state vector, the resulting covariance being computationally too expensive to recover. Nevertheless, in many simultaneous localization and mapping (SLAM) applications, knowing only the mean vector is not enough. Data association, obtaining reduced state representations, active decisions and next best view are only a few of the applications that require fast state covariance recovery. Furthermore, computer vision and robotic applications are in general performed online. In this case, the state is updated and recomputed every step and its size is continuously growing, therefore, the estimation process may become highly computationally demanding.","authors":["Viorela Ila","Lukas Polok","Marek Solony","Pavel Svoboda"],"meta":["February 2017The International Journal of Robotics Research 36(3):027836491769111","DOI:10.1177/0278364917691110"],"references":["306000554_Incremental_Block_Cholesky_Factorization_for_Nonlinear_Least_Squares_in_Robotics","282687199_Fast_covariance_recovery_in_incremental_nonlinear_least_square_solvers","262239188_Cache_efficient_implementation_for_block_matrix_operations","261415963_Efficient_implementation_for_block_matrix_operations_for_nonlinear_least_squares_problems_in_robotic_applications","286725094_Conservative_edge_sparsification_for_graph_SLAM_node_removal","273396226_Generic_node_removal_for_factor-graph_SLAM","262881736_Associating_Uncertainty_With_Three-Dimensional_Poses_for_Use_in_Estimation_Problems","262321825_Covariance_Propagation_and_Next_Best_View_Planning_for_3D_Reconstruction","261435361_Generic_factor-based_node_marginalization_and_edge_sparsification_for_pose-graph_SLAM","261391594_Temporally_Scalable_Visual_SLAM_using_a_Reduced_Pose_Graph"]}