{"id":"314165535_Facial_Expression_Recognition_Utilizing_Local_Direction-Based_Robust_Features_and_Deep_Belief_Network","abstract":"Emotional health plays very vital role to improve people's quality of lives, especially for the elderly. Negative emotional states can lead to social or mental health problems. To cope with emotional health problems caused by negative emotions in daily life, we propose efficient facial expression recognition system to contribute in emotional healthcare system. Thus, facial expressions play a key role in our daily communications, and recent years have witnessed a great amount of research works for reliable facial expressions recognition (FER) systems. Hence, facial expression analysis from video data is considered to be a very challenging task in the research areas of computer vision, image processing, and pattern recognition. The accuracy of a FER system is pretty much reliant on the extraction of robust features. In this work, a novel feature extraction method is proposed to extract prominent features from the human face. For person independent expression recognition, depth video data is used as input to the system where in each frame, pixel intensities are distributed based on the distances to the camera. A novel robust feature extraction process is applied in this work which is named as Local Directional Position Pattern (LDPP). In LDPP, after extracting local directional strengths for each pixel such as applied in typical Local Directional Pattern (LDP), top directional strength positions are considered in binary along with their strength sign bits. Considering top directional strength positions with strength signs in LDPP can differentiate edge pixels with bright as well as dark regions on their opposite sides by generating different patterns whereas typical LDP only considers directions representing the top strengths irrespective of their signs as well as position orders (i.e., directions with top strengths represent 1 and rest of them 0), which can generate the same patterns in this regard sometimes. Hence, LDP fails to distinguish edge pixels with opposite bright and dark regions in some cases which can be overcome by LDPP. Furthermore, the LDPP features are extended by Principal Component Analysis (PCA) and Generalized Discriminant Analysis (GDA) to make them more robust for better face feature representation in expression. The proposed features are finally applied with Deep Belief Network (DBN) for expression training and recognition.","authors":["Md. Zia Uddin","Mohammad Mehedi Hassan","Ahmad Almogren","Atif Alamri"],"meta":["March 2017IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2017.2676238"],"references":["305416960_GroRec_A_Group-Centric_Intelligent_Recommender_System_Integrating_Social_Mobile_and_Big_Data_Technologies","319770515_Facial_Action_Coding_System_FACS_A_technique_for_the_measurement_of_facial_action","312890805_Combining_RGB_and_ToF_cameras_for_real-time_3D_hand_gesture_interaction","309496412_Application_of_vision_information_to_planning_trajectories_of_Adept_Six-300_robot","304549984_Learning_higher-order_structures_in_natural_images","301912846_Cognitive_Architectures_for_social_human-robot_interaction","300417101_Facial_expression_recognition_using_depth_information_and_spatiotemporal_features","291553368_A_multimedia_healthcare_data_sharing_approach_through_cloud-based_body_area_network","290509714_IDoctor_Personalized_and_professionalized_medical_recommendations_based_on_hybrid_matrix_factorization","288989718_Robust_3D_Action_Recognition_with_Random_Occupancy_Patterns"]}