{"id":"314157271_SINUESSA_UN_APPRODO_SOMMERSO_DI_EPOCA_ROMANA_Archeologia_geomorfologia_costiera_strategie_sostenibili_di_valorizzazione","abstract":"Prefazione\n\nMicla Pennetta, Alfredo Trocciola\n\nLa presente monografia su Sinuessa è volta ad una valorizzazione del patrimonio culturale presente lungo le coste della nostra penisola. In attuazione dell’art. 9 della Costituzione, la Repubblica italiana tutela e valorizza il patrimonio culturale al fine di preservare la memoria della comunità nazionale e del suo territorio oltre a promuovere lo sviluppo della cultura. Conoscere significa innescare processi di salvaguardia, tutela, fruizione e valorizzazione; la conoscenza assume un ruolo rilevante ed innovativo rivolto alla sostenibilità e alla efficacia degli interventi. Il patrimonio culturale del nostro territorio può divenire, soprattutto in questo periodo di crisi globale, una forza trainante dell’economia in grado di attivare risorse finanziarie finalizzate anche alla riqualificazione culturale ed ambientale di una regione.\nLa presenza di tracciati viari e di opere marittime di epoca romana, ancora visibili lungo l’area costiera del territorio di Sessa Aurunca (Caserta), ha indotto a svolgere ricerche di geomorfologia costiera anche nell’area sommersa a partire dal 1994. Dopo una lunga pausa, le indagini hanno ripreso con un forte impulso a partire dal maggio 2012 conseguendo notevoli progressi e modificando anche sostanzialmente i dati fino ad allora acquisiti e riportati nella letteratura scientifica dedicata.\nL’attività di ricerca è stata stimolata dalla presenza di un asse viario di epoca romana, basolato in calcare, perpendicolare alla linea di riva (E-W), che termina bruscamente, obliterandosi sotto la sabbia, in prossimità del cordone dunare costiero (nei pressi del complesso residenziale di Baia Azzurra). \nNell’area sommersa prospiciente è stato rilevato un manufatto squadrato sconnesso lungo la stessa direttrice oltre a resti archeologici da ascrivere a manufatti e ad infrastrutture portuali verosimilmente collegati alle pertinenze costiere ed alle attività della colonia verso mare. L’asse viario a terra, costituisce una diramazione verso la costa dell’antica via Appia costruita a partire dal 312 a.C. dal console Appio Claudio e che metteva in comunicazione la colonia di Minturnae (porto fluviale del Mediterraneo nel Lazio meridionale) con Roma e con i centri dell’Italia meridionale. La fondazione della colonia latina di Suessa Aurunca (313 a.C.) nei pressi del vulcano di Roccamonfina e la creazione delle due piccole colonie romane di Minturnae e Sinuessa nel 296 a.C. (dopo le scorrerie dei Sanniti nell’agro falerno) costituirono le tappe fondamentali del processo per il controllo politico e militare del territorio originariamente aurunco (313 a.C. distruzione della Pentapoli Aurunca), (Pagano, 1974, Coarelli, 1993, Crimaco 1993, Gasperetti, 1993, Bellini, 2007). Minturnae e Sinuessa sono due colonie gemelle; quest’ultima è ubicata nell’attuale stretta fascia costiera tra le ultime propaggini nord-occidentali del Monte Massico ed il Mar Tirreno.\nAmbedue erano piccolissimi presidi o fortezze costiere che avevano il compito di controllare sia il territorio che la costa; in particolare la prima a controllare la foce del Lirs (attuale Fiume Garigliano) e la seconda a controllare l’accesso costiero alla Piana Campana (ager Campanus). \nIntorno al 174 a.C. Sinuessa diverrà una grande città grazie alla produzione e commercio di vino in tutto il Mediterraneo oltre che un ricercato luogo di vacanze per la presenza di impianti termali. \nLe Aquae Sinuessanae, con testimonianze tuttora evidenti, sono acque sulfuree i cui impianti erano presenti nella fascia costiera tra le pendici del Monte Cicoli ed il mare. La storia della città sembra interrompersi intorno al III secolo d.C. insieme alle sue strutture portuali (Crimaco, 1993).\nAlla profondità di 7,0 m e alla distanza dalla costa di circa 650 m è stato rilevato un banco roccioso di natura ignimbritica, messo in posto 39.000 anni dal presente, in un periodo in cui l’attuale area marina era emersa. Verso il margine settentrionale del banco, è stata rilevata un’area depressa, profonda circa 3 m, caratterizzata dalla presenza di 24 elementi di forma cubica, di 3 m x 3 m di lato, in conglomerato cementizio (opus cementicium). Al top dei blocchi sono stati rilevati fori semicircolari, da adibire al sollevamento, al trasporto e all’accostamento; sono denominati pilae e sono tipici di opere marittime romane come descritto da Vitruvio in De Architectura (sin dal I sec. a.C.). Il loro impiego era largamente diffuso sulle coste flegree per la costruzione dei moli e banchine, come rilevato nei vicini insediamenti di Baia e di Portus Julius. La presenza di paleospiagge e di morfologie accessorie alla stessa profondità della sommità pianeggiante del banco tufaceo induce a ritenere che questo fosse emerso e frequentato dall’uomo in epoca romana anche per attività connesse alla portualità. \nGli studi svolti hanno contribuito alla comprensione delle possibili cause della sommersione dell’approdo di Sinuessa, valutando l’ampiezza della variazione relativa del livello del mare per cause glacio-idro-isostatiche pari a circa 1 m ed a cause tettoniche e di subsidenza pari complessivamente a circa 6,5/7 m. Il rilevamento di manufatti sommersi, attestati sul banco tufaceo poi subsidente, risalenti all’epoca romana, consente di collocare la linea di riva di epoca romana (circa 2000 anni dal presente) a circa 1 km verso il largo. È stata individuata anche una linea di riva più antica, verosimilmente ascrivibile al periodo greco-romano, ad una distanza dalla costa attuale pari a circa 1300 m.\nI vari capitoli che si succedono sottolineano le collaborazioni instaurate dall’ENEA con il Dipartimento di Scienze della Terra, dell’Ambiente e delle Risorse (DiSTAR) dell’Università degli Studi di Napoli Federico II, con le Soprintendenze archeologiche della Campania, con l’INGV (Istituto Nazionale di Geofisica e Vulcanologia), con le amministrazioni comunali di Sessa Aurunca e di Mondragone (Caserta), con l’Autorità di Bacino dei fiumi Liri-Garigliano e Volturno ed alcune associazioni legate al settore dei beni culturali (Marenostrum di Archeoclub d’Italia). L’insieme degli studi e delle ricerche avranno tra gli obiettivi di realizzare un Parco geoarcheologico da finalizzare alla conservazione e valorizzazione del patrimonio culturale sommerso, in linea con la Convenzione dell’UNESCO sulla protezione del patrimonio culturale subacqueo adottata a Parigi il 2 novembre 2001 e ratificata in Italia il 23 ottobre 2009.","authors":["Micla Pennetta","Alfredo Trocciola"],"meta":["February 2017","Edition: 2017Publisher: ENEA Agenzia nazionale per le nuove tecnologie, l'energia e lo sviluppo economico sostenibileEditor: Micla Pennetta e Alfredo TrocciolaISBN: ISBN: 978-88-8286-340-1","Projects: Geomorphological features of the archaeological marine area of Sinuessa in CampaniaVertical ground movements of emerged and submerged coastland of Campania through surveys of geomorphological and geoarchaeological elements"],"references":["312998797_Tyrrhenian_basin_and_Apenninic_arcs_Kinematic_relations_since_late_Tortonian_times","303836543_Studio_delle_caratteristiche_morfoevolutive_quaternarie_della_piana_del_Garigliano","340524081_L'area_aurunca_nel_quadro_dell'Italia_centromeridionale_Testimonianze_archeologiche_di_eta_arcaica","312420713_Solid_State_Physics","309076356_Archaeological_Evidence_for_Eustatic_Sea_Level_Change_and_Earth_Movements_in_the_Western_Mediterranean_During_the_Last_2000_Years","308058989_Vulcanologia_e_petrologia_dei_Campi_Flegrei","307906820_Effects_of_anthropogenic_activities_in_a_Mediterranean_coastland_the_case_study_of_the_Falerno-Domitio_littoral_in_Campania_Tyrrhenian_Sea_southern_Italy","307888537_The_heat-island_over_Naples","307149726_Struttura_marginale_tirrenica_dell'Appennino_campano_reinterpretazione_di_dati_di_antiche_ricerche_di_idrocarburi","305970447_University_of_Rome_Carbon-14_Dates_XII","303524677_Geomorphological_features_of_the_archaeological_marine_area_of_Sinuessa_in_Campania_southern_Italy","301198131_Morpho-sedimentary_features_and_sediment_transport_model_of_the_submerged_beach_of_the_'Pineta_della_foce_del_Garigliano'_SCI_Site_Caserta_southern_Italy","303836299_I_rapporti_tra_la_piattaforma_carbonatica_campa-_no-lucana_e_la_piattaforma_abruzzese-campana_al_Monte_Massico_Caseria","303748413_Vulcanologia_e_petrologia_dei_Campi_Flegrei","291843331_Sea-level_changes_in_Mediterranean"]}