{"id":"314107982_Deploying_a_quantum_annealing_processor_to_detect_tree_cover_in_aerial_imagery_of_California","abstract":"Quantum annealing is an experimental and potentially breakthrough computational technology for handling hard optimization problems, including problems of computer vision. We present a case study in training a production-scale classifier of tree cover in remote sensing imagery, using early-generation quantum annealing hardware built by D-wave Systems, Inc. Beginning within a known boosting framework, we train decision stumps on texture features and vegetation indices extracted from four-band, one-meter-resolution aerial imagery from the state of California. We then impose a regulated quadratic training objective to select an optimal voting subset from among these stumps. The votes of the subset define the classifier. For optimization, the logical variables in the objective function map to quantum bits in the hardware device, while quadratic couplings encode as the strength of physical interactions between the quantum bits. Hardware design limits the number of couplings between these basic physical entities to five or six. To account for this limitation in mapping large problems to the hardware architecture, we propose a truncation and rescaling of the training objective through a trainable metaparameter. The boosting process on our basic 108- and 508-variable problems, thus constituted, returns classifiers that incorporate a diverse range of color- and texture-based metrics and discriminate tree cover with accuracies as high as 92% in validation and 90% on a test scene encompassing the open space preserves and dense suburban build of Mill Valley, CA.","authors":["Edward Boyda","Saikat Basu","Sangram Ganguly","Andrew Michaelis"],"meta":["February 2017PLoS ONE 12(2):e0172505","DOI:10.1371/journal.pone.0172505"],"references":["311491838_DeepSat_a_learning_framework_for_satellite_imagery","302341151_Textural_Features_for_Image_Classification","301842734_Simulated_Quantum_Annealing_with_Two_All-to-All_Connectivity_Schemes","286301759_What_is_the_Computational_Value_of_Finite_Range_Tunneling","315485989_Solving_the_Optimal_Trading_Trajectory_Problem_Using_a_Quantum_Annealer","312621023_Filters_Wrappers_and_a_boosting-based_hybrid_for_feature_selection","310911776_A_case_study_in_programming_a_quantum_annealer_for_hard_operational_planning_problems","307887417_Simulated-quantum-annealing_comparison_between_all-to-all_connectivity_schemes","305449727_Multiple_query_optimization_on_the_D-Wave_2X_adiabatic_quantum_computer","292793744_Random_walks_for_image_segmentation"]}