{"id":"314114538_Openness_and_Praxis_Exploring_the_Use_of_Open_Educational_Practices_in_Higher_Education","abstract":"Open educational practices (OEP) is a broad descriptor of practices that include the creation, use and reuse of open educational resources (OER) as well as open pedagogies and open sharing of teaching practices. As compared with OER, there has been little empirical research on individual educators' use of OEP for teaching in higher education. This research study addresses that gap, exploring the digital and pedagogical strategies of a diverse group of university educators, focusing on whether, why and how they use OEP for teaching. The study was conducted at one Irish university; semi-structured interviews were carried out with educators across multiple disciplines. Only a minority of educators used OEP. Using constructivist grounded theory, a model of the concept 'Using OEP for teaching' was constructed showing four dimensions shared by open educators: balancing privacy and openness, developing digital literacies, valuing social learning, and challenging traditional teaching role expectations. The use of OEP by educators is complex, personal and contextual; it is also continuously negotiated. These findings suggest that research-informed policies and collaborative and critical approaches to openness are required to support staff, students and learning in an increasingly complex higher education environment.","authors":["Catherine Cronin"],"meta":["August 2017International Review of Research in Open and Distance Learning 18(5)","DOI:10.19173/irrodl.v18i5.3096","Project: Openness and praxis: Exploring the use of OEP in higher education"],"references":["309527232_Institutional_Culture_and_OER_Policy_How_Structure_Culture_and_Agency_Mediate_OER_Policy_Potential_in_South_African_Universities","305407397_Disconnective_Practice_in_Heterotopic_Spaces_for_Networked_and_Connected_Learning","285361994_From_OER_to_OEP_Shifting_Practitioner_Perspectives_and_Practices_with_Innovative_Learning_Experience_Design","331738199_The_Discovery_of_Grounded_Theory_Strategies_for_Qualitative_Research","319463292_Open_educational_resources_A_review_of_the_literature","312359728_The_core_category_of_grounded_theory_Making_constant_comparisons","307836755_Open_educational_resources_staff_attitudes_and_awareness","287301859_Structure_Agency_and_the_Internal_Conversation","287264420_Tribes_and_Territories_in_the_21st_Century_Rethinking_the_significance_of_disciplines_in_higher_education","284878707_The_Digital_Scholar_How_Technology_Is_Transforming_Scholarly_Practice"]}