{"id":"314132145_Automated_Stock_Trading_-_Developing_the_Serious_Game_FSTG_to_Teach_the_Topic_of_Finite_State_Machines","abstract":"A new methodology to teach about the topic of Finite State Machines is presented in this paper. For this purpose, nine learning objectives which are classified into the three categories Basics of Finite State Machines, parallels between Finite State Machines and stock trading, and the application of Finite State Machines were developed and implemented into a Serious Game solution. This paper covers the third category about the application of Finite State Machines and its use to create Artificial Intelligence. The learning objectives were determined by using the widely-known Taxonomy of Bloom and integrated into the Serious Game The Finite State Trading Game (FSTG). In this turn-based trading game, the user aims to beat a Non-Player Character by skillfully trading shares while the user faces increasing complexity throughout the game. For the evaluation of the Serious Game approach a pre-test and post-test setting was performed with students of a local upper vocational school class at the Technical University of Munich. The results of the following analysis demonstrated significant progress in terms of the students’ knowledge about Finite State Machines for every tested statement.","authors":["Matthias Christoph Utesch","Andreas Hauer","Robert Heininger","Helmut Krcmar"],"meta":["February 2017","DOI:10.3991/ijep.v7i1.6524"],"references":["308831601_The_evolution_of_e-learning_platforms_from_content_to_activity_based_learning_The_case_of_LearnWU","296966447_Schulerakademie_Serious_Gaming_mit_ERPsim_zur_Forderung_der_Studierfahigkeit","237065878_Becoming_a_Self-Regulated_Learner_An_Overview","312020146_An_IT-Based_Learning_Approach_About_Finite_State_Machines_Using_the_Example_of_Stock_Trading","308731131_Five_years_of_the_Pupils'_Academy_of_Serious_Gaming_Enhancing_the_ability_to_study","301349134_Strengthening_Study_Skills_by_using_ERPsim_as_a_new_Tool_within_the_Pupils'_Academy_of_Serious_Gaming","297124943_The_PupilsAcademy_of_Serious_Gaming_Strengthening_Study_Skills_with_ERPsim","242400296_A_Revision_of_Bloom's_Taxonomy_An_Overview","220722254_Information_Hiding_in_Finite_State_Machine","200086112_A_Technique_for_Measurement_of_Attitudes"]}