{"id":"314160993_NetSpam_A_Network-Based_Spam_Detection_Framework_for_Reviews_in_Online_Social_Media","abstract":"Nowadays, a big part of people rely on available content in social media in their decisions (e.g. reviews and feedback on a topic or product). The possibility that anybody can leave a review provide a golden opportunity for spammers to write spam reviews about products and services for different interests. Identifying these spammers and the spam content is a hot topic of research and although a considerable number of studies have been done recently toward this end, but so far the methodologies put forth still barely detect spam reviews, and none of them show the importance of each extracted feature type. In this study, we propose a novel framework, named NetSpam, which utilizes spam features for modeling review datasets as heterogeneous information networks to map spam detection procedure into a classification problem in such networks. Using the importance of spam features help us to obtain better results in terms of different metrics experimented on real-world review datasets from Yelp and Amazon websites. The results show that NetSpam outperforms the existing methods and among four categories of features; including review-behavioral, user-behavioral, reviewlinguistic, user-linguistic, the first type of features performs better than the other categories.","authors":["Saeedreza Shehnepoor","Mostafa Salehi","Reza Farahbakhsh","Noel Crespi"],"meta":["March 2017IEEE Transactions on Information Forensics and Security PP(99):1-1","DOI:10.1109/TIFS.2017.2675361"],"references":["305398834_Credible_Review_Detection_with_Limited_Information_Using_Consistency_Features","303499094_Fake_Review_Detection_From_a_Product_Review_Using_Modified_Method_of_Iterative_Computation_Framework","303145761_Trust-aware_review_spam_detection","282617118_Survey_of_review_spam_detection_using_machine_learning_techniques","281230131_Combating_Product_Review_Spam_Campaigns_via_Multiple_Heterogeneous_Pairwise_Features","310793105_Towards_detecting_anomalous_user_behavior_in_online_social_networks","303274917_Spotting_fake_reviews_via_collective_positive-unlabeled_learning","299970764_Collective_Opinion_Spam_Detection","288582292_What_yelp_fake_review_filter_might_be_doing","286850025_Exploiting_burstiness_in_reviews_for_review_spammer_detection"]}