{"id":"314115451_The_computational_landscape_of_general_physical_theories","abstract":"The emergence of quantum computers has challenged long-held beliefs about what is efficiently computable given our current physical theories. However, going back to the work of Abrams and Lloyd, changing one aspect of quantum theory can result in yet more dramatic increases in computational power, as well as violations of fundamental physical principles. Here we focus on efficient computation within a framework of general physical theories that make good operational sense. In prior work, Lee and Barrett showed that in any theory satisfying the principle of tomographic locality (roughly, local measurements suffice for tomography of multipartite states) the complexity bound on efficient computation is AWPP. This bound holds independently of whether the principle of causality (roughly, no signalling from the future) is satisfied. In this work we show that this bound is tight: there exists a theory satisfying both the principles of tomographic locality and causality which can efficiently decide everything in AWPP, and in particular can simulate any efficient quantum computation. Thus the class AWPP has a natural physical interpretation: it is precisely the class of problems that can be solved efficiently in tomographically-local theories. This theory is built upon a model of computing involving Turing machines with quasi-probabilities, to wit, machines with transition weights that can be negative but sum to unity over all branches. In analogy with the study of non-local quantum correlations, this leads us to question what physical principles recover the power of quantum computing. Along this line, we give some computational complexity evidence that quantum computation does not achieve the bound of AWPP.","authors":["Jonathan Barrett","Niel de Beaudrap","Matty J. Hoban","Ciaran Lee"],"meta":["February 2017npj Quantum Information 5(1)","DOI:10.1038/s41534-019-0156-9"],"references":["317824548_Towards_Device-Independent_Information_Processing_on_General_Quantum_Networks","312945220_A_no-go_theorem_for_theories_that_decohere_to_quantum_mechanics","312149338_Quantum_Teleportation_and_Grover's_Algorithm_Without_the_Wavefunction","311761902_Probabilistic_theories_with_purification_phys","309113655_Deriving_Grover's_lower_bound_from_simple_physical_principles","304191738_The_Information_Content_of_Systems_in_General_Physical_Theories","303770581_Bounds_on_the_power_of_proofs_and_advice_in_general_physical_theories","297893288_Generalised_phase_kick-back_The_structure_of_computational_algorithms_from_physical_principles","282906300_Higher-Order_Interference_in_Extensions_of_Quantum_Theory","309796552_Quantum_teleportation_and_Grover's_algorithm_without_the_wavefunction"]}