{"id":"314162366_A_Member_Saved_Is_a_Member_Earned_The_Recruitment-Retention_Trade-Off_and_Organizational_Strategies_for_Membership_Growth","abstract":"A long line of research documents the essential role of social networks in mediating the recruitment and retention of members in organizations. But organizations also comprise a primary context where people form social ties. We investigate how the network structure an organization creates among its members influences its ability to grow and reproduce. In particular, we propose that two dimensions of organizational strategy influence affiliation dynamics: (1) the extent to which an organization induces social interaction among its members (social encapsulation), and (2) the time and energy that an organization demands of its members (time and energy demand). We examine membership dynamics in an ecology where competitor organizations deploying varied strategies vie for the same pool of members. Results show a curvilinear relationship between membership growth and the rate of social encapsulation. Furthermore, we find that time and energy demand mediates the effect of social encapsulation by shaping its members’ opportunities for maintaining external affiliations. Different opportunity structures result in different levels of network turnover, thus either reinforcing or dissolving intra-organizational ties. For most types of organizations, attaining sustained growth requires a balance between open networks (for recruitment) and network closure (for retention).","authors":["Yongren Shi","Fedor A. Dokshin","Michael Genkin","Matthew E. Brashears"],"meta":["February 2017American Sociological Review 82(1):000312241769361","DOI:10.1177/0003122417693616"],"references":["342458036_Commitment_and_Community_Communes_and_Utopias_in_Sociological_Perspective","330691646_Getting_a_Job_A_Study_of_Contacts_and_Careers","324341430_Exit_Voice_and_Loyalty_Responses_to_Decline_in_Firms_Organizations_and_States","324107839_The_structure_of_online_activism","313434217_Structural_Inertia_and_Organization_Change","305310916_The_Organizational_Roots_of_Political_Activism_Field_Experiments_on_Creating_a_Relational_Context","288435337_Grassroots_for_Hire_Public_Affairs_Consultants_in_American_Democracy","288371433_Unanticipated_Gains_Origins_of_Network_Inequality_in_Everyday_Life","284520572_Competition_and_Commitment_in_Voluntary_Memberships_The_Paradox_of_Persistence_and_Participation","284208424_Conflict_The_Web_of_Group_Affiliations"]}