{"id":"314153319_Sequences_of_purchases_in_credit_card_data_reveal_life_styles_in_urban_populations","abstract":"Zipf-like distributions characterize a wide set of phenomena in physics, biology, economics and social sciences. In human activities, Zipf-laws describe for example the frequency of words appearance in a text or the purchases types in shopping patterns. In the latter, the uneven distribution of transaction types is bound with the temporal sequences of purchases of individual choices. In this work, we define a new framework using a text compression technique on the sequences of credit card purchases to detect ubiquitous patterns of collective behavior. Clustering the consumers by their similarity in purchases sequences, we detect five consumer groups. Remarkably, post checking, individuals in each group are also similar in their age, total expenditure, gender, and the diversity of their social and mobility networks extracted by their mobile phone records. By properly deconstructing transaction data with Zipf-like distributions, this method uncovers sets of significant sequences that reveal insights on collective human behavior.","authors":["Riccardo Di Clemente","Miguel Angel Luengo-Oroz","Matias Travizano","Sharon Xu"],"meta":["August 2018Nature Communications 9(3330)","DOI:10.1038/s41467-018-05690-8"],"references":["316558459_Big_Data_and_the_Well-Being_of_Women_and_Girls_Applications_on_the_Social_Scientific_Frontier","311762129_Powerlaw_A_python_package_for_analysis_of_heavy-tailed_distributions","307439022_The_TimeGeo_modeling_framework_for_urban_mobility_without_travel_surveys","298420569_Understanding_congested_travel_in_urban_areas","288520753_Life_in_the_network_The_coming_age_of_computational_social_science","321959162_Social_Bridges_in_Urban_Purchase_Behavior","309656577_Scraped_Data_and_Sticky_Prices","308823868_Urban_association_rules_Uncovering_linked_trips_for_shopping_behavior","301222420_Relevance_weighting_of_search_terms","288945826_Divergence_measures_based_on_the_Shannon_entropy"]}