{"id":"314102988_Guidelines_for_Management_of_Incidental_Pulmonary_Nodules_Detected_on_CT_Images_From_the_Fleischner_Society_2017","abstract":"The Fleischner Society Guidelines for management of solid nodules were published in 2005, and separate guidelines for subsolid nodules were issued in 2013. Since then, new information has become available; therefore, the guidelines have been revised to reflect current thinking on nodule management. The revised guidelines incorporate several substantive changes that reflect current thinking on the management of small nodules. The minimum threshold size for routine follow-up has been increased, and recommended follow-up intervals are now given as a range rather than as a precise time period to give radiologists, clinicians, and patients greater discretion to accommodate individual risk factors and preferences. The guidelines for solid and subsolid nodules have been combined in one simplified table, and specific recommendations have been included for multiple nodules. These guidelines represent the consensus of the Fleischner Society, and as such, they incorporate the opinions of a multidisciplinary international group of thoracic radiologists, pulmonologists, surgeons, pathologists, and other specialists. Changes from the previous guidelines issued by the Fleischner Society are based on new data and accumulated experience. (©) RSNA, 2017 Online supplemental material is available for this article.","authors":["Heber Macmahon","David P Naidich","Jin Mo Goo","Kyung Soo Lee"],"meta":["February 2017Radiology 284(1):161659","DOI:10.1148/radiol.2017161659","Project: Guidelines for Management of Incidental Pulmonary Nodules Detected on CT Images: From the Fleischner Society 2017"],"references":["279727020_Longitudinal_evolution_of_incidentally_detected_solitary_pure_ground-glass_nodules_on_CT_relation_to_clinical_metrics","313178942_Reduced_lung-cancer_mortality_with_low-dose_computed_tomographic_screening","305412222_ACR_CT_Accreditation_Program_and_the_Lung_Cancer_Screening_Program_Designation","290183302_Cancer_Statistics_2016","285851187_Cancer_Statistics_2013","285314861_Grading_strength_of_recommendations_and_quality_of_evidence_in_clinical_guidelines_report_from_an_American_Collof_Chest_Physicians_Task_Force","283544853_Growth_of_pure_ground-glass_lung_nodule_detected_at_computed_tomography","282046119_Persistent_pulmonary_subsolid_nodules_with_solid_portions_of_5_mm_or_smaller_Their_natural_course_and_predictors_of_interval_growth","280496567_Recent_Trends_in_the_Identification_of_Incidental_Pulmonary_Nodules","279808038_Persistent_Pure_Ground-Glass_Nodules_Larger_Than_5_mm_Differentiation_of_Invasive_Pulmonary_Adenocarcinomas_From_Preinvasive_Lesions_or_Minimally_Invasive_Adenocarcinomas_Using_Texture_Analysis"]}