{"id":"314237986_A_Layered_Architecture_for_Erasure-Coded_Consistent_Distributed_Storage","abstract":"Motivated by emerging applications to the edge computing paradigm, we introduce a two-layer erasure-coded fault-tolerant distributed storage system offering atomic access for read and write operations. In edge computing, clients interact with an edge-layer of servers that is geographically near; the edge-layer in turn interacts with a back-end layer of servers. The edge-layer provides low latency access and temporary storage for client operations, and uses the back-end layer for persistent storage. Our algorithm, termed Layered Data Storage (LDS) algorithm, offers several features suitable for edge-computing systems, works under asynchronous message-passing environments, supports multiple readers and writers, and can tolerate $f_1 < n_1/2$ and $f_2 < n_2/3$ crash failures in the two layers having $n_1$ and $n_2$ servers, respectively. We use a class of erasure codes known as regenerating codes for storage of data in the back-end layer. The choice of regenerating codes, instead of popular choices like Reed-Solomon codes, not only optimizes the cost of back-end storage, but also helps in optimizing communication cost of read operations, when the value needs to be recreated all the way from the back-end. The two-layer architecture permits a modular implementation of atomicity and erasure-code protocols; the implementation of erasure-codes is mostly limited to interaction between the two layers. We prove liveness and atomicity of LDS, and also compute performance costs associated with read and write operations. Further, in a multi-object system running $N$ independent instances of LDS, where only a small fraction of the objects undergo concurrent accesses at any point during the execution, the overall storage cost is dominated by that of persistent storage in the back-end layer, and is given by $\\Theta(N)$.","authors":["Kishori M Konwar","Prakash Narayana Moorthy","Nancy Lynch","Muriel Médard"],"meta":["March 2017","Project: Wireless network coding."],"references":["305525325_Storage-Optimized_Data-Atomic_Algorithms_for_Handling_Erasures_and_Errors_in_Distributed_Storage_Systems","303342746_RADON_Repairable_Atomic_Data_Object_in_Networks","264005552_A_Coded_Shared_Atomic_Memory_Algorithm_for_Message_Passing_Architectures","313562977_Sharing_memory_robustly_in_message_passing_systems","313420977_The_Internet_of_Things_How_the_Next_Evolution_of_the_Internet_is_Changing_Everything","305660786_Information-Theoretic_Lower_Bounds_on_the_Storage_Cost_of_Shared_Memory_Emulation","305660699_Space_Bounds_for_Reliable_Storage_Fundamental_Limits_of_Coding","303890546_Edge_Computing_Vision_and_Challenges","260302636_Optimal_Exact-Regenerating_Codes_for_Distributed_Storage_at_the_MSR_and_MBR_Points_via_a_Product-Matrix_Construction","259860916_Polynomial_Codes_Over_Certain_Finite_Fields"]}