{"id":"314206508_Quantifying_the_effect_of_editor-author_relations_on_manuscript_handling_times","abstract":"In this article we study to what extent the academic peer review process is influenced by social relations between the authors of a manuscript and the editor handling the manuscript. Taking the open access journal PlosOne as a case study, our analysis is based on a data set of more than 100,000 articles published between 2007 and 2015. Using available data on handling editor, submission and acceptance time of manuscripts, we study the question whether co-authorship relations between authors and the handling editor affect the manuscript handling time, i.e. the time taken between the submission and acceptance of a manuscript. Our analysis reveals (1) that editors handle papers co-authored by previous collaborators significantly more often than expected at random, and (2) that such prior co-author relations are significantly related to faster manuscript handling. Addressing the question whether these shorter manuscript handling times can be explained by the quality of publications, we study the number of citations and downloads which accepted papers eventually accumulate. Moreover, we consider the influence of additional (social) factors, such as the editor’s experience, the topical similarity between authors and editors, as well as reciprocal citation relations between authors and editors. Our findings show that, even when correcting for other factors like time, experience, and performance, prior co-authorship relations have a large and significant influence on manuscript handling times, speeding up the editorial decision on average by 19 days.","authors":["Emre Sarigöl","David Garcia","Ingo Scholtes","Frank Schweitzer"],"meta":["July 2017Scientometrics 113(4):1-23","DOI:10.1007/s11192-017-2309-y"],"references":["300084368_The_correlation_between_editorial_delay_and_the_ratio_of_highly_cited_papers_in_Nature_Science_and_Physical_Review_Letters","297724411_Editor_citation_An_alleged_instance_of_social-professional_desirability","270055026_Measuring_the_effectiveness_of_scientific_gatekeeping","260439659_Predicting_Scientific_Success_Based_on_Coauthorship_Networks","324621965_Social_Stratification_in_Science","292685859_The_Gatekeepers_of_Science_Some_Factors_Affecting_the_Selection_of_Articles_for_Scientific_Journals","277647975_Editorial_delay_and_its_relation_to_subsequent_citations_The_journals_Nature_Science_and_Cell","277567904_The_author-editor_game","268879584_Publishing_The_peer-review_scam","266021468_Social_Stratification_in_Science"]}