{"id":"314286024_ECG_based_Atrial_Fibrillation_detection_using_Sequency_Ordered_Complex_Hadamard_Transform_and_Hybrid_Firefly_Algorithm","abstract":"Electrocardiogram (ECG), a non-invasive diagnostic technique, used for detecting cardiac arrhythmia.\nFrom last decade industry dealing with biomedical instrumentation and research, demanding an\nadvancement in its ability to distinguish different cardiac arrhythmia. Atrial Fibrillation (AF) is an irregular\nrhythm of the human heart. During AF, the atrial moments are quicker than the normal rate. As blood\nis not completely ejected out of atria, chances for the formation of blood clots in atrium. These abnormalities\nin the heart can be identified by the changes in the morphology of the ECG. The first step in the\ndetection of AF is preprocessing of ECG, which removes noise using filters. Feature extraction is the next\nkey process in this research. Recent feature extraction methods, such as Auto Regressive (AR) modeling,\nMagnitude Squared Coherence (MSC) and Wavelet Coherence (WTC) using standard database (MIT-BIH),\nyielded a lot of features. Many of these features might be insignificant containing some redundant and\nnon-discriminatory features that introduce computational burden and loss of performance. This paper\npresents fast Conjugate Symmetric Sequency Ordered Complex Hadamard Transform (CS-SCHT) for\nextracting relevant features from the ECG signal. The sparse matrix factorization method is used for\ndeveloping fast and efficient CS-SCHT algorithm and its computational performance is examined and\ncompared to that of the HT and NCHT. The applications of the CS-SCHT in the ECG-based AF detection\nis also discussed. These fast CS-SCHT features are optimized using Hybrid Firefly and Particle Swarm\nOptimization (FFPSO) to increase the performance of the classifier","authors":["Padmavathi Kora","Ambika Annavarapu","Priyanka Yadlapalli","Kalva Sri Rama Krishna"],"meta":["March 2017Engineering Science and Technology an International Journal 20(3)","DOI:10.1016/j.jestch.2017.02.002","Project: journal"],"references":["300001324_Firefly_algorithm_for_congestion_management_in_deregulated_environment","289992844_Optimizing_real_power_loss_and_voltage_stability_limit_of_a_large_transmission_network_using_firefly_algorithm","288567366_Hybrid_Firefly_and_Particle_Swarm_Optimization_algorithm_for_the_detection_of_Bundle_Branch_Block","275463750_Myocardial_infarction_detection_using_magnitude_squared_coherence_and_Support_Vector_Machine","275463733_Detection_of_Atrial_Fibrillation_using_Autoregressive_modeling","306204663_PhysioBank_PhysioToolkit_and_PhysioNet_Components_of_a_new_research_resource_for_complex_physiologic_signals","285843652_NEW_METHOD_FOR_DETECTING_ATRIAL_FIBRILLATION_USING_R-R_INTERVALS","275335009_Detection_of_Atrial_Fibrillation_using_Continuous_Wavelet_transform_and_Wavelet_Coherence","266626258_Clinical_Outcome_and_Postoperative_CT_Measurements_of_Microendoscopic_Decompression_for_Lumbar_Spinal_Stenosis","266567377_Automatic_Atrial_Fibrillation_Detection_Using_Autoregressive_Modeling"]}