{"id":"314206728_Assessing_peer_review_by_gauging_the_fate_of_rejected_manuscripts_the_case_of_the_Journal_of_Artificial_Societies_and_Social_Simulation","abstract":"This paper investigates the fate of manuscripts that were rejected from JASSS-The Journal of Artificial Societies and Social Simulation, the flagship journal of social simulation. We tracked 456 manuscripts that were rejected from 1997 to 2011 and traced their subsequent publication as journal articles, conference papers or working papers. We compared the impact factor of the publishing journal and the citations of those manuscripts that were eventually published against the yearly impact factor of JASSS and the number of citations achieved by the JASSS mean and top cited articles. Only 10% of the rejected manuscripts were eventually published in a journal that was indexed in the Web of Science, although most of the rejected manuscripts were published elsewhere. Being exposed to more than one round of reviews before rejection, having received a more detailed reviewer report and being subjected to higher inter-reviewer disagreement were all associated with the number of citations received when the manuscript was eventually published. This indicates that peer review could contribute to increasing the quality even of rejected manuscripts.","authors":["Niccolò Casnici","Francisco Grimaldo","Nigel Gilbert","Pierpaolo Dondio"],"meta":["August 2017Scientometrics 113(4):1-14","DOI:10.1007/s11192-017-2241-1"],"references":["301331417_Attitudes_of_referees_in_a_multidisciplinary_journal_An_empirical_analysis","283976332_How_peer-review_constrains_cognition_On_the_frontline_in_the_knowledge_sector","277711118_Emerging_trends_in_peer_review-a_survey","270055026_Measuring_the_effectiveness_of_scientific_gatekeeping","266620799_Internationalization_of_peer_reviewed_and_non-peer_reviewed_book_publications_in_the_Social_Sciences_and_Humanities","293645594_The_waiting_game","292677769_Priority_criteria_in_peer_review_of_scientific_articles","276101344_Toward_a_Bill_of_Rights_for_Manuscript_Submitters","276077857_From_Manuscript_Evaluation_to_Article_Valuation_The_Changing_Technologies_of_Journal_Peer_Review","272197290_Fate_of_Manuscripts_Rejected_From_the_Red_Journal"]}