{"id":"314254135_Using_visuo-kinetic_virtual_reality_to_induce_illusory_spinal_movement_the_MoOVi_Illusion","abstract":"Background\nIllusions that alter perception of the body provide novel opportunities to target brain-based contributions to problems such as persistent pain. One example of this, mirror therapy, uses vision to augment perceived movement of a painful limb to treat pain. Since mirrors can’t be used to induce augmented neck or other spinal movement, we aimed to test whether such an illusion could be achieved using virtual reality, in advance of testing its potential therapeutic benefit. We hypothesised that perceived head rotation would depend on visually suggested movement.\n\nMethod\nIn a within-subjects repeated measures experiment, 24 healthy volunteers performed neck movements to 50 o of rotation, while a virtual reality system delivered corresponding visual feedback that was offset by a factor of 50%–200%—the Motor Offset Visual Illusion (MoOVi)—thus simulating more or less movement than that actually occurring. At 50 o of real-world head rotation, participants pointed in the direction that they perceived they were facing. The discrepancy between actual and perceived direction was measured and compared between conditions. The impact of including multisensory (auditory and visual) feedback, the presence of a virtual body reference, and the use of 360 o immersive virtual reality with and without three-dimensional properties, was also investigated.\n\nResults\nPerception of head movement was dependent on visual-kinaesthetic feedback ( p = 0.001, partial eta squared = 0.17). That is, altered visual feedback caused a kinaesthetic drift in the direction of the visually suggested movement. The magnitude of the drift was not moderated by secondary variables such as the addition of illusory auditory feedback, the presence of a virtual body reference, or three-dimensionality of the scene.\n\nDiscussion\nVirtual reality can be used to augment perceived movement and body position, such that one can perform a small movement, yet perceive a large one. The MoOVi technique tested here has clear potential for assessment and therapy of people with spinal pain.","authors":["Daniel Simon Harvie","Ross T. Smith","Estin V. Hunter","Miles G. Davis"],"meta":["February 2017PeerJ 5(2):e3023","DOI:10.7717/peerj.3023"],"references":["312367157_Pain_A_Statistical_Account","287420139_Neural_representations_and_the_cortical_body_matrix_Implications_for_sports_medicine_and_future_directions","283212735_The_Effects_of_Visuomotor_Calibration_to_the_Perceived_Space_and_Body_through_Embodiment_in_Immersive_Virtual_Reality","281203520_Principles_of_neural_ensemble_physiology_underlying_the_operation_of_brain--machine_interfaces","323424582_Statistical_power_analysis_for_the_behavioral_sciences","306088684_Chronic_pain_and_distorted_body_image_Implications_for_multisensory_feedback_interventions","302073801_Haptic_Retargeting_Video_Showcase_Dynamic_Repurposing_of_Passive_Haptics_for_Enhanced_Virtual_Reality_Experience","301724023_An_initial_exploration_of_a_multi-sensory_design_space_Tactile_support_for_walking_in_immersive_virtual_environments","284275768_The_effect_of_bodily_illusions_on_clinical_pain","282277362_Neck_Pain_and_Proprioception_Revisited_Using_the_Proprioception_Incongruence_Detection_Test"]}