{"id":"314247012_The_effects_of_gamification-based_teaching_practices_on_student_achievement_and_students'_attitudes_toward_lessons","abstract":"Gamification is defined as the use of game design in non-game contents. Gamification of educational processes can be described as the successful integration of the gamification framework into the curriculum in order to improve students' motivation, academic achievement, and attitudes toward lessons. In this regard, the present study aims to determine the effects of gamification-based teaching practices on student achievement and their attitudes toward lesson. Investigating the effects of gamification on instructional processes and educational outcomes is expected to contribute to the relevant literature as it is a relatively new mechanism. The study is designed with quantitative research methodology and a true experimental design using pretest–posttest experimental and control groups. The study's participants included 97 sophomores from the Department of Elementary Mathematics Education of a state university in southern Turkey in 2014–2015. The experimental group comprised 49 students compared to 48 students in the control group. According to the research results, gamification-based teaching practices have a positive impact upon student achievement and students' attitudes toward lessons.","authors":["Ibrahim Yildirim"],"meta":["February 2017The Internet and Higher Education 33","DOI:10.1016/j.iheduc.2017.02.002","Project: Gamification"],"references":["275537374_How_Gamification_Applies_for_Educational_Purpose_Specially_with_College_Algebra","256194365_Gamifying_Learning_Experiences_Practical_Implications_and_Outcomes","230854710_From_Game_Design_Elements_to_Gamefulness_Defining_Gamification","303245633_Using_Productivity_Games_to_Prevent_Defects","289581762_Developing_an_attitude_scale_for_mathematics_education_courses_via_fuzzy_statistics","270823073_Gamification_in_assessment_Do_points_affect_test_performance","260605745_An_empirical_study_comparing_gamification_and_social_networking_on_e-learning","249037534_Statistical_Significance_and_Effect_Size_in_Education_Research_Two_Sides_of_a_Coin","222423950_Successful_implementation_of_user-centered_game_based_learning_in_higher_education_An_example_from_civil_engineering","222398993_Digital_game-based_learning_Towards_an_experiential_gaming_model"]}