{"id":"314238511_On_Parameterized_Complexity_of_Group_Activity_Selection_Problems_on_Social_Networks","abstract":"In Group Activity Selection Problem (GASP), players form coalitions to participate in activities and have preferences over pairs of the form (activity, group size). Recently, Igarashi et al. have initiated the study of group activity selection problems on social networks (gGASP): a group of players can engage in the same activity if the members of the group form a connected subset of the underlying communication structure. Igarashi et al. have primarily focused on Nash stable outcomes, and showed that many associated algorithmic questions are computationally hard even for very simple networks. In this paper we study the parameterized complexity of gGASP with respect to the number of activities as well as with respect to the number of players, for several solution concepts such as Nash stability, individual stability and core stability. The first parameter we consider in the number of activities. For this parameter, we propose an FPT algorithm for Nash stability for the case where the social network is acyclic and obtain a W[1]-hardness result for cliques (i.e., for classic GASP); similar results hold for individual stability. In contrast, finding a core stable outcome is hard even if the number of activities is bounded by a small constant, both for classic GASP and when the social network is a star. Another parameter we study is the number of players. While all solution concepts we consider become polynomial-time computable when this parameter is bounded by a constant, we prove W[1]-hardness results for cliques (i.e., for classic GASP).","authors":["Ayumi Igarashi","Robert Bredereck","Edith Elkind"],"meta":["March 2017"],"references":["301857431_Hedonic_Games_with_Graph-restricted_Communication","260003471_Group_Activity_Selection_Problem","312709311_Coalitional_Games_on_Sparse_Social_Networks","300540901_Group_Activity_Selection_from_Ordinal_Preferences","288039891_Characteristic_function_games_with_restricted_agent_interactions_Core-stability_and_coalition_structures","228057735_Computers_And_Intractability_A_Guide_to_the_Theory_of_NP-Completeness","228057698_Color-Coding","24104365_On_Group_Stability_in_Hierarchies_and_Networks","5202061_Graphs_and_Cooperation_in_Games","4767361_NP-Completeness_in_Hedonic_Games"]}