{"id":"314230852_Efficient_Design_for_Satellite_Mission-_Aware_Multilevel_Queue_scheduler","abstract":"Recently, many task-scheduling policies were introduced to enhance the system performance by adding more awareness to the scheduler. Complex cyber-physical systems’ software; such as satellite flight-control software (SFCSW); has various physical parameters to control. It is required to add the awareness demand to the selected scheduler. Control parameters (CP), which include power consumption, temperature rising, etc., are given directly from the mission requirements. In this Research, we introduce a mission-aware scheduler called “Satellite Mission-aware Multilevel Queue” (SMAMLQ) scheduler. The proposed scheduler classifies incoming tasks, using K-means clustering algorithm, into four groups. Incoming tasks are classified to data exchange tasks, control application tasks, soft real-time tasks and background tasks. Each class; as a queue of tasks; represents one of the four types SFCSW’s tasks. Tasks’ priority inside the queue is identified according to the task CP deadline, which the task belongs to as a mission dependent parameter. Utilization of each queue is Calculated to be used as the acceptance criteria for any incoming sporadic or periodic task. The\nproposed scheduler was implemented and tested with promising results compared to traditional MLQ used with SFCSW. The proposed SMAMLQ contributes with the following aspects: Using the CP as a mission-aware scheduling parameter, relaxing the hard real-time constraints, applying mission requirements directly to different task properties, and Adding agility to long-term mission satellites.","authors":["Mohamed Elsedfy","Dr. Wael Murtada","Ezz Farouk","Mahmoud Gad- Allah"],"meta":["January 2017International Journal of Computer Science and Information Security, 15(1):10","Projects: PhD thesisPh.D. Thesis"],"references":["275042703_On-board_Data_Handling_for_Ambitious_Nanosatellite_Missions_using_Automotive-grade_Lockstep_Microcontrollers","273952360_The_Past_Present_and_Future_of_Cyber-Physical_Systems_A_Focus_on_Models","267382237_Improved_Multilevel_Feedback_Queue_Scheduling_Using_Dynamic_Time_Quantum_and_Its_Performance_Analysis","312489696_On_task_schedulability_in_real-time_control_systems","290791487_Energy-Aware_Scheduling_for_Real-Time_Systems","286965364_Toward_Automatic_Synthesis_of_Schedulable_Real-Time_Controllers","286582525_A_simulator_based_performance_analysis_of_multilevel_feedback_queue_scheduling","282470907_The_Choice_of_Metrics_for_Clustering_Algorithms","262211771_Mission-Aware_Cyber-Physical_Optimization_on_a_Tabletop_Satellite","260504348_Real-Time_Middleware_for_Networked_Control_Systems_and_Application_to_an_Unstable_System","249645533_A_Comparative_Study_of_CPU_Scheduling_Algorithms","252068441_New_Trends_in_Real_Time_Operating_Systems","228793799_Generalizing_the_-Windows_clustering_algorithm_in_metric_spaces","228588475_Feedback_scheduler_for_real-time_controller_tasks","222532839_Establishing_timing_requirements_for_control_loops_in_real-time_systems"]}