{"id":"314257965_Image_Analysis_for_MRI_Based_Brain_Tumor_Detection_and_Feature_Extraction_Using_Biologically_Inspired_BWT_and_SVM","abstract":"The segmentation, detection, and extraction of infected tumor area from magnetic resonance (MR) images are a primary concern but a tedious and time taking task performed by radiologists or clinical experts, and their accuracy depends on their experience only. So, the use of computer aided technology becomes very necessary to overcome these limitations. In this study, to improve the performance and reduce the complexity involves in the medical image segmentation process, we have investigated Berkeley wavelet transformation (BWT) based brain tumor segmentation. Furthermore, to improve the accuracy and quality rate of the support vector machine (SVM) based classifier, relevant features are extracted from each segmented tissue. The experimental results of proposed technique have been evaluated and validated for performance and quality analysis on magnetic resonance brain images, based on accuracy, sensitivity, specificity, and dice similarity index coefficient. The experimental results achieved 96.51% accuracy, 94.2% specificity, and 97.72% sensitivity, demonstrating the effectiveness of the proposed technique for identifying normal and abnormal tissues from brain MR images. The experimental results also obtained an average of 0.82 dice similarity index coefficient, which indicates better overlap between the automated (machines) extracted tumor region with manually extracted tumor region by radiologists. The simulation results prove the significance in terms of quality parameters and accuracy in comparison to state-of-the-art techniques.","authors":["Nilesh Bhaskarrao Bahadure","Arun K. Ray","H.Pal Thethi"],"meta":["March 2017International Journal of Biomedical Imaging 2017(1):1-12","DOI:10.1155/2017/9749108"],"references":["316165319_Skull_stripping_magnetic_resonance_images_brain_images_region_growing_versus_mathematical_morphology","305333346_Digital_Image_Watermarking_Using_Arnold_Scrambling_and_Berkeley_Wavelet_Transform","302341151_Textural_Features_for_Image_Classification","286151151_Morphology_Based_Enhancement_and_Skull_Stripping_of_MRI_Brain_Images","285925522_Determination_of_Gray_Matter_GM_and_White_Matter_WM_Volume_in_Brain_Magnetic_Resonance_Images_MRI","281765886_Combining_Tissue_Segmentation_and_Neural_Network_for_Brain_Tumor_Detection","279164639_Automated_Feature_Extraction_in_Brain_Tumor_by_Magnetic_Resonance_Imaging_Using_Gaussian_Mixture_Models","308854861_Detection_of_brain_tumor_in_MRI_images_using_combination_of_fuzzy_c-means_and_SVM","287578808_Brain_tumor_classification_based_on_clustered_discrete_cosine_transform_in_compressed_domain","287325645_Extreme_learning_machine_for_classification_of_brain_tumor_in_3D_MR_images"]}