{"id":"314257183_Perceptions_of_the_Social_Relevance_of_Science_Exploring_the_Implications_for_Gendered_Patterns_in_Expectations_of_Majoring_in_STEM_Fields","abstract":"Despite efforts to increase participation in science, technology, engineering and math fields (STEM), the role of students' perceptions of the social relevance of science in guiding their expectations to major in STEM remains largely unexplored. Though science education scholars predict that perceptions of social relevance likely matter equally for boys and girls, gender scholars suggest that these perceptions should matter more for girls than boys. Using longitudinal data from a large, urban, low-income, and predominantly minority-serving district, this study examines the potentially gendered role of perceptions of social relevance in ninth graders' expectations to major in STEM. Further, it examines these dynamics with respect to expectations to major in any STEM field as well as expectations to major in specific STEM fields. Findings largely support the perspective of gender scholars; perceptions of the social relevance of science positively and significantly predict female, but not male, students' intentions to major in STEM (vs. non-STEM fields). Subsequent analyses that look at intentions to major in specific STEM fields reveal a similar pattern, such that perceptions of relevance positively predict female students' intentions to major in the biological sciences, the physical sciences, and engineering, while male students' intentions are not similarly impacted. By contrast, positive perceptions of the relevance of science predict a modest increase in interest in computer science for both boys and girls.","authors":["Sarah Blanchard","Catherine Riegle-Crumb"],"meta":["February 2017","DOI:10.3390/socsci6010019"],"references":["314160830_STEM_crisis_or_STEM_surplus_Yes_and_yes","305471791_My_science_class_and_expected_career_choices-a_structural_equation_model_of_determinants_involving_Abu_Dhabi_high_school_students","281345525_Motivational_Beliefs_Values_and_Goals","275430984_Feeling_the_Threat","275352417_Feeling_the_Threat_Stereotype_Threat_as_a_Contextual_Barrier_to_Women's_Science_Career_Choice_Intentions","273789179_Science_capital_A_conceptual_methodological_and_empirical_argument_for_extending_bourdieusian_notions_of_capital_beyond_the_arts_SCIENCE_CAPITAL","345316892_Is_American_Science_in_Decline","309021383_Why_are_some_STEM_fields_more_gender_balanced_than_others","294287681_Perpetuating_Separate_and_Unequal_Worlds_of_Educational_Opportunity_Through_District_Lines_School_Segregation_by_Race_and_Poverty","276527386_STEM_Education"]}