{"id":"314206633_Therapeutic_indications_and_other_use-case-driven_updates_in_the_drug_ontology_Anti-malarials_anti-hypertensives_opioid_analgesics_and_a_large_term_request","abstract":"Background\nThe Drug Ontology (DrOn) is an OWL2-based representation of drug products and their ingredients, mechanisms of action, strengths, and dose forms. We originally created DrOn for use cases in comparative effectiveness research, primarily to identify historically complete sets of United States National Drug Codes (NDCs) that represent packaged drug products, by the ingredient(s), mechanism(s) of action, and so on contained in those products. Although we had designed DrOn from the outset to carefully distinguish those entities that have a therapeutic indication from those entities that have a molecular mechanism of action, we had not previously represented in DrOn any particular therapeutic indication.\n\nResults\nIn this work, we add therapeutic indications for three research use cases: resistant hypertension, malaria, and opioid abuse research. We also added mechanisms of action for opioid analgesics and added 108 classes representing drug products in response to a large term request from the Program for Resistance, Immunology, Surveillance and Modeling of Malaria in Uganda (PRISM) project. The net result is a new version of DrOn, current to May 2016, that represents three major therapeutic classes of drugs and six new mechanisms of action.\n\nConclusions\nA therapeutic indication of a drug product is represented as a therapeutic function in DrOn. Adverse effects of drug products, as well as other therapeutic uses for which the drug product was not designed are dispositions. Our work provides a framework for representing additional therapeutic indications, adverse effects, and uses of drug products beyond their design. Our work also validated our past modeling decisions for specific types of mechanisms of action, namely effects mediated via receptor and/or enzyme binding. DrOn is available at: http://purl.obolibrary.org/obo/dron.owl. A smaller version without NDCs is available at: http://purl.obolibrary.org/obo/dron/dron-lite.owl","authors":["William R Hogan","Josh Hanna","Amanda Hicks","Samira Amirova"],"meta":["March 2017Journal of Biomedical Semantics 8(1)","DOI:10.1186/s13326-017-0121-5","Project: Development of DrOn (The Drug Ontology)"],"references":["304340796_Functions_in_Basic_Formal_Ontology","295869507_An_accurate_and_precise_representation_of_drug_ingredients","287088267_Towards_a_Consistent_and_Scientifically_Accurate_Drug_Ontology","281815340_Observational_Health_Data_Sciences_and_Informatics_OHDSI_Opportunities_for_Observational_Researchers","281509996_Desiderata_for_computable_representations_of_electronic_health_records-driven_phenotype_algorithms","281050542_Towards_a_foundational_representation_of_potential_drug-drug_interaction_knowledge","263785629_OAE_The_Ontology_of_Adverse_Events","262267575_Launching_PCORnet_a_national_patient-centered_clinical_research_network","259351082_Building_a_drug_ontology_based_on_RxNorm_and_other_sources","288384478_Gene_Ontology_Consortium_going_forward"]}