{"id":"314299671_Friend_or_Foe_Flipped_Classroom_for_Undergraduate_Electrocardiogram_Learning_A_Randomized_Controlled_Study","abstract":"Background\nInterpreting an electrocardiogram (ECG) is not only one of the most important parts of clinical diagnostics but also one of the most difficult topics to teach and learn. In order to enable medical students to master ECG interpretation skills in a limited teaching period, the flipped teaching method has been recommended by previous research to improve teaching effect on undergraduate ECG learning. MethodsA randomized controlled trial for ECG learning was conducted, involving 181 junior-year medical undergraduates using a flipped classroom as an experimental intervention, compared with Lecture-Based Learning (LBL) as a control group. All participants took an examination one week after the intervention by analysing 20 ECGs from actual clinical cases and submitting their ECG reports. A self-administered questionnaire was also used to evaluate the students’ attitudes, total learning time, and conditions under each teaching method. ResultsThe students in the experimental group scored significantly higher than the control group (8.72 ± 1.01 vs 8.03 ± 1.01, t = 4.549, P = 0.000) on ECG interpretation. The vast majority of the students in the flipped classroom group held positive attitudes toward the flipped classroom method and also supported LBL. There was no significant difference (4.07 ± 0.96 vs 4.16 ± 0.89, Z = − 0.948, P = 0.343) between the groups. Prior to class, the students in the flipped class group devoted significantly more time than those in the control group (42.33 ± 22.19 vs 30.55 ± 10.15, t = 4.586, P = 0.000), whereas after class, the time spent by the two groups were not significantly different (56.50 ± 46.80 vs 54.62 ± 31.77, t = 0.317, P = 0.752). Conclusion\nFlipped classroom teaching can improve medical students’ interest in learning and their self-learning abilities. It is an effective teaching model that needs to be further studied and promoted.","authors":["Zeng jun Rui","Xiang Lian-rui","Yue Rong-zheng","Zeng Jing"],"meta":["March 2017BMC Medical Education 17(1)","DOI:10.1186/s12909-017-0881-8"],"references":["301234576_Student_Performance_in_a_Pharmacotherapy_Oncology_Module_Before_and_After_Flipping_the_Classroom","282186138_Increased_Preclass_Preparation_Underlies_Student_Outcome_Improvement_in_the_Flipped_Classroom","279727089_Perception_of_MBBS_students_to_Flipped_class_roomapproach_in_neuroanatomy_module","279301902_Flipped-Class_Pedagogy_Enhances_Student_Metacognition_and_Collaborative-Learning_Strategies_in_Higher_Education_But_Effect_Does_Not_Persist","321544976_Graphics-sequenced_interpretation_of_ECG","303170761_The_classroom_flip_Using_Web_course_management_tools_to_become_the_guide_on_the_side","293026052_Positive_outcomes_increase_over_time_with_the_implementation_of_a_semiflipped_teaching_model","281068467_Flipping_Content_to_Improve_Student_Exam_Performance_in_a_Pharmacogenomics_Course","278049303_Flipped_Classroom_Versus_Traditional_Textbook_Instruction_Assessing_Accuracy_and_Mental_Effort_at_Different_Levels_of_Mathematical_Complexity","277779741_Flipped_classroom_as_a_strategy_to_enhance_active_learning"]}