{"id":"314251610_Denoising_of_sparse_images_in_impulsive_disturbance_environment","abstract":"The paper presents a method for denoising and reconstruction of sparse images based on a gradient-descent algorithm. It is assumed that the original (non-noisy) image is sparse in the two-dimensional Discrete Cosine Transform (2D-DCT) domain. It is also assumed that a number of image pixels is corrupted by a salt and pepper noise. In addition, we assume that there are pixels corrupted by a noise of any value. In this paper we introduce a method to find the positions of the corrupted pixels when the noise is not of the salt and pepper form. The proposed algorithm for noisy pixels detection and reconstruction works blindly. It does not require the knowledge about the positions of corrupted pixels. The only assumption is that the image is sparse and that the noise degrades this property. The advantage of this reconstruction algorithm is that we do not change the uncorrupted pixels in the process of the reconstruction, unlike common reconstruction methods. Corrupted pixels are detected and removed iteratively using the gradient of sparsity measure as a criterion for detection. After the corrupted pixels are detected and removed, the gradient algorithm is employed to reconstruct the image. The algorithm is tested on both grayscale and color images. Additionally, the case when both salt and pepper noise and a random noise, within the pixel values range, are combined is considered. The proposed method can be used without explicitly imposing the image sparsity in a strict sense. Quality of the reconstructed image is measured for different sparsity and noise levels using the structural similarity index, the mean absolute error, mean-square error and peak signal-to-noise ratio and compared to the traditional median filter and recent algorithms, one based on the total-variations reconstruction and a two-stage adaptive algorithm.","authors":["Isidora Stanković","Irena Orovic","Milos Dakovic","Srdjan Stankovic"],"meta":["March 2018Multimedia Tools and Applications 77(4)","DOI:10.1007/s11042-017-4502-7","Project: New ICT Compressive sensing based trends applied to: multimedia, biomedicine and communications"],"references":["307701598_Removing_Impulse_Bursts_from_Images_by_Training-Based_Filtering","303810853_Image_Reconstruction_from_a_Reduced_Set_of_Pixels_using_a_Simplified_Gradient_Algorithm","303179494_Reconstruction_of_Sparse_Signals_in_Impulsive_Disturbance_Environments","298909531_BM3D_filter_in_salt-and-pepper_noise_removal","313508668_Compressive_sensing","312771295_Image_quality_assessment_From_error_visibility_to_structural_similarity","310461609_Multimedia_Signals_and_Systems","303389765_Iterative_Denoising_of_Sparse_Images","301797032_A_simple_primal-dual_method_for_total_variation_image_restoration","285107452_Compressive_sensing","283794198_Digital_Signal_Processing_with_Selected_Topics","275066514_Salt_and_Pepper_Noise_Removal_with_Noise_Detection_and_a_Patch-Based_Sparse_Representation","269634058_Robust_Uncertainty_Principles_Exact_Signal_Frequency_Information","262528236_Adaptive_Variable_Step_Algorithm_for_Missing_Samples_Recovery_in_Sparse_Signals","261918772_An_automated_signal_reconstruction_method_based_on_analysis_of_compressive_sensed_signals_in_noisy_environment"]}