{"id":"314229393_Neuronal_control_of_fixation_and_fixational_eye_movements","abstract":"Ocular fixation is a dynamic process that is actively controlled by many of the same brain structures involved in the control of eye movements, including the superior colliculus, cerebellum and reticular formation. In this article, we review several aspects of this active control. First, the decision to move the eyes not only depends on target-related signals from the peripheral visual field, but also on signals from the currently fixated target at the fovea, and involves mechanisms that are shared between saccades and smooth pursuit. Second, eye position during fixation is actively controlled and depends on bilateral activity in the superior colliculi and medio-posterior cerebellum; disruption of activity in these circuits causes systematic deviations in eye position during both fixation and smooth pursuit eye movements. Third, the eyes are not completely still during fixation but make continuous miniature movements, including ocular drift and microsaccades, which are controlled by the same neuronal mechanisms that generate larger saccades. Finally, fixational eye movements have large effects on visual perception. Ocular drift transforms the visual input in ways that increase spatial acuity; microsaccades not only improve vision by relocating the fovea but also cause momentary changes in vision analogous to those caused by larger saccades.\nThis article is part of the themed issue ‘Movement suppression: brain mechanisms for stopping and stillness’.","authors":["Richard J. Krauzlis","Laurent Goffart","Ziad M. Hafed"],"meta":["April 2017Philosophical Transactions of The Royal Society B Biological Sciences 372(1718):20160205","DOI:10.1098/rstb.2016.0205"],"references":["321991321_Common_Inhibitory_Mechanism_for_Saccades_and_Smooth-Pursuit_Eye_Movements","314229475_Unchanging_visions_The_effects_and_limitations_of_ocular_stillness","306052047_A_Causal_Role_for_the_Cortical_Frontal_Eye_Fields_in_Microsaccade_Deployment","297654140_A_Microsaccadic_Account_of_Attentional_Capture_and_Inhibition_of_Return_in_Posner_Cueing","285543975_Vision_Perception_and_Attention_through_the_Lens_of_Microsaccades_Mechanisms_and_Implications","314095697_Cortical_control_and_performance_monitoring_of_interrupting_and_redirecting_movements","314082471_Movement_suppression_brain_mechanisms_for_stopping_and_stillness","285350812_The_behavioural_and_neurophysiological_modulation_of_microsaccades_in_monkeys","281110251_A_parsimonious_computational_model_of_visual_target_position_encoding_in_the_superior_colliculus","280218956_Neuronal_Response_Gain_Enhancement_prior_to_Microsaccades"]}