{"id":"314296105_Measuring_Student_Learning_in_Introductory_Block-Based_Programming_Examining_Misconceptions_of_Loops_Variables_and_Boolean_Logic","abstract":"Programming in block-based environments is a key element of introductory computer science (CS) curricula in K-12 settings. Past research conducted in the context of text-based programming points to several challenges related to novice learners' understanding of foundational programming constructs such as variables, loops, and expressions. This research aims to develop assessment items for measuring student understanding in introductory CS classrooms in middle school using a principled approach for assessment design. This paper describes the design of assessments items that were piloted with 100 6th, 7th, 8th graders who had completed an introductory programming course using Scratch. The results and follow-up cognitive thinkalouds indicate that students are generally unfamiliar with the use of variables, and harbor misconceptions about them. They also have trouble with other aspects of introductory programming such as how loops work, and how the Boolean operators work. These findings point to the need for pedagogy that combines popular constructionist activities with those that target conceptual learning, along with better professional development to support teachers' conceptual learning of these foundational constructs.","authors":["Shuchi Grover","Satabdi Basu"],"meta":["March 2017","DOI:10.1145/3017680.3017723","Conference: the 2017 ACM SIGCSE Technical Symposium"],"references":["297721040_Computer_science_CS_in_the_compulsory_education_curriculum_Implications_for_future_research","281792891_Sowing_the_Seeds_A_Landscape_Study_on_Assessment_in_Secondary_Computer_Science_Education","276852167_Designing_for_deeper_learning_in_a_blended_computer_science_course_for_middle_school_students","270606116_Programming_by_choice","266657117_Assessing_computational_learning_in_K-12","247504784_Focus_Article_On_the_Structure_of_Educational_Assessments","286046474_A_Future_for_Computing_Education_Research","255567335_The_Propositional_Logic_Test_as_a_Diagnostic_Tool_for_Misconceptions_About_Logical_Operations","254004865_Beyond_curriculum_The_exploring_computer_science_program","242504995_The_concept_of_variable_in_programming_Its_meaning_and_use_in_problem-solving_by_novice_programmers"]}