{"id":"314213262_A_Taxonomy_of_Blockchain-Based_Systems_for_Architecture_Design","abstract":"Blockchain is an emerging technology for decentralised and transactional data sharing across a large network of untrusted participants. It enables new forms of distributed software architectures, where agreement on shared states can be established without trusting a central integration point. A major difficulty for architects designing applications based on blockchain is that the technology has many configurations and variants. Since blockchains are at an early stage, there is little product data or reliable technology evaluation available to compare different blockchains. In this paper, we propose how to classify and compare blockchains and blockchain-based systems to assist with the design and assessment of their impact on software architectures. Our taxonomy captures major architectural characteristics of blockchains and the impact of their principal design decisions. This taxonomy is intended to help with important architectural considerations about the performance and quality attributes of blockchain-based systems.","authors":["Xiwei Xu","Ingo Weber","Mark Staples","Liming Zhu"],"meta":["April 2017","DOI:10.1109/ICSA.2017.33","Conference: ICSA'17: IEEE International Conference on Software Architecture","Projects: Architecting with BlockchainBlockchain from Software Architecture Perspective"],"references":["309451429_On_the_Security_and_Performance_of_Proof_of_Work_Blockchains","305525271_The_Blockchain_as_a_Software_Connector","303996559_Untrusted_Business_Process_Monitoring_and_Execution_Using_Blockchain","303337249_The_Blockchain_Anomaly","282692004_Bitcoin-NG_A_Scalable_Blockchain_Protocol","301762992_The_Quest_for_Scalable_Blockchain_Fabric_Proof-of-Work_vs_BFT_Replication","300472381_Blindcoin_Blinded_Accountable_Mixes_for_Bitcoin","296684539_Bitcoin_and_Beyond_A_Technical_Survey_on_Decentralized_Digital_Currencies","286747227_Permacoin_Repurposing_Bitcoin_Work_for_Data_Preservation","286243801_Cryptocurrencies_smart_contracts_and_artificial_intelligence"]}