{"id":"314288067_Performance_and_Challenges_of_Service-Oriented_Architecture_for_Wireless_Sensor_Networks","abstract":"Wireless Sensor Networks (WSNs) have become essential components for a variety of environmental, surveillance, military, traffic control, and healthcare applications. These applications face critical challenges such as communication, security, power consumption, data aggregation, heterogeneities of sensor hardware, and Quality of Service (QoS) issues. Service-Oriented Architecture (SOA) is a software architecture that can be integrated with WSN applications to address those challenges. The SOA middleware bridges the gap between the high-level requirements of different applications and the hardware constraints of WSNs. This survey explores state-of-the-art approaches based on SOA and Service-Oriented Middleware (SOM) architecture that provide solutions for WSN challenges. The categories of this paper are based on approaches of SOA with and without middleware for WSNs. Additionally, features of SOA and middleware architectures for WSNs are compared to achieve more robust and efficient network performance. Design issues of SOA middleware for WSNs and its characteristics are also highlighted. The paper concludes with future research directions in SOM architecture to meet all requirements of emerging application of WSNs.","authors":["Remah Alshinina","Khaled Elleithy"],"meta":["April 2017Sensors 2017(17 536):536-575","DOI:10.3390/s17030536"],"references":["298786254_Service_Oriented_Architecture_for_Wireless_Sensor_Networks_in_Agriculture","290582380_SOA_and_Wireless_Mobile_Networks_in_the_Tactical_Domain_Results_from_Experiments","287458201_Flexible_Service_Oriented_Network_Architecture_for_Wireless_Sensor_Networks","314447347_LiteOS_based_Extended_Service_Oriented_Architecture_for_Wireless_Sensor_Networks","308809089_SOA_and_Wireless_Mobile_Networks_in_the_tactical_domain_Results_from_experiments","303815926_A_partnership-based_approach_to_improve_QoS_on_Federated_Computing_Infrastructures","303393363_MidSHM_A_Flexible_Middleware_for_SHM_Application_Based_on_Service-Oriented_Architecture","303179351_Migration_of_SOAP-based_services_to_RESTful_services","301409649_Wireless_sensor_networks_and_SOA_development_for_optimal_control_of_legacy_power_grid","290555748_Towards_a_Service_Oriented_Architecture_for_Wireless_Sensor_Networks_in_Industrial_Applications"]}