{"id":"314293221_Using_Upper-Elementary_Student_Performance_to_Understand_Conceptual_Sequencing_in_a_Blocks-based_Curriculum","abstract":"As more elementary schools commit to integrating computer science instruction into their curricula, they seek guidance on what concepts are appropriate for students at different grade levels. Currently, little is known about how best to sequence computer science learning across elementary grades. In this paper, we present an analysis of 123 students' (age 9-12, grades 4-6) activities in a curriculum implemented in a visual block-based programming language. The goal of this work is to better understand the developmental appropriateness of foundational computer science ideas. All 4th, 5th, and 6th grade students in a single school completed the first module of a curriculum during the same school year with the same instructor. We analyzed each task students attempted and found that for simple concepts, there was little difference in performance between grade levels. However, differences were found for more complex topics, such as whether they completed initialization tasks and the way in which they solved 2-d navigation tasks. A closer look revealed that students understood the basic concepts, but were challenged by deeper applications of the basic concepts and influenced by non-computer science skills. This work serves as an empirically grounded investigation of elementary computer science learning and contributes to our understanding of computer science learning trajectories and concept sequencing in the late elementary grades.","authors":["Diana Franklin","Gabriela Skifstad","Reiny Rolock","Isha Mehrotra"],"meta":["March 2017","DOI:10.1145/3017680.3017760","Conference: the 2017 ACM SIGCSE Technical Symposium","Project: DEPICT: Developing Elementary (learning) Progressions to Integrate Computational Thinking"],"references":["304205427_User-Centered_Design_in_Block-Based_Programming_Developmental_Pedagogical_Considerations_for_Children","296847071_Initialization_in_Scratch_Seeking_Knowledge_Transfer","275274983_Floors_and_Flexibility_Designing_a_Programming_Environment_for_4th-6th_Grade_Classrooms","270606116_Programming_by_choice","258932009_Learning_of_Geometric_Concepts_in_a_Logo_Environment","343754767_Learning_of_Geometric_Concepts_in_a_Logo_Environment","279197778_Using_SOLO_to_Classify_the_Programming_Responses_of_Primary_Grade_Students","262404862_Modeling_the_learning_progressions_of_computational_thinking_of_primary_grade_students","262253499_Designing_ScratchJr_support_for_early_childhood_learning_through_computer_programming","242513310_Software_Design_as_a_Learning_Environment"]}