{"id":"314384794_Analise_dos_CAsos_de_sifilis_CongenitA_em_sobrAl_CeAra_Contribuicoes_pArA_AssistenCiA_pre-nAtAl","abstract":"A sifilis e uma doenca infecciosa cronica, causada pela bacteria Treponema pallidum e adquirida atraves do contato sexual. A transmissao vertical da gestante infectada nao tratada ou tratada inadequadamente ocorre com frequencia, resultando na sifilis congenita. Objetivo: este estudo teve oobjetivo de analisar o perfil dos nove casos de sifilis congenita de Sobral, Ceara, ocorridos em 2010. Metodos: trata-se de uma pesquisa documental, do tipo exploratorio-descritiva. Os dados foram coletados a partir dos prontuarios dos casos e do Sistema de Informacao de Agravos de Notificacao. Para conhecera tendencia da doenca no municipio, primeiramente se resgatou a incidencia de sifilis congenita em Sobral, de 2007 a 2010. Posteriormente os dados foramestratificados em variaveis e apresentados na forma de graficos e tabelas. Resultados: das nove gestantes, sete eram solteiras, seis eram usuarias de alcoole/ou outras drogas e, de acordo com o registro da ocupacao, tres eram profissionais do sexo. Em relacao ao numero de consultas realizadas no pre-natal,seis realizaram o total recomendado, porem constatou-se que o intervalo entre as consultas era inadequado a idade gestacional. Todas as maes foram inadequadamente tratadas e, no momento da pesquisa, somente uma crianca se encontrava com o seguimento realizado de forma adequada ao protocolo do Ministerio da Saude. Conclusao: conclui-se que as maes das criancas que adquiriram sifilis congenita possuem baixo nivel social e comportamento de risco que as colocam em vulnerabilidade para contrair doencas sexualmente transmissiveis. Constatou-se tambem que houve deficiencias na assistencia a saude em todos os casos, contribuindo para a incidencia dos casos.(AU) The syphilis is a chronic infectious disease, caused by the bacteria Treponema pallidum and acquired through the sexual contact. The vertical transmission, of the pregnant woman not infected treated or treated inadequately, it happens frequently, resulting in the congenital syphilis. Objective: Thisstudy had the objective of analyzing the profile of the nine cases of congenital syphilis of Sobral, Ceara, happened in 2010. Methods: It is a documental research, of the exploratory-descriptive type. The data were collected starting from the handbooks of the cases and of the System of Information of Offences of Notification. To know the tendency of the disease in the municipal district, firstly the incidence of congenital syphilis was rescued in Sobral, from 2007 to2010. Later the data were stratified in variables and presented in the form of graphs and tables. Results: Of the nine pregnant women, seven were single, six were users of alcohol e/ou other drugs and, in agreement with the registration of the occupation, three were professional of the sex. In relation to the number of consultations accomplished in the prenatal, six accomplished the recommended total, however it was verified that the distribution of those consultationswas inadequate to the age gestational. All the mothers were inadequately treated and, in the moment of the research, only a child met with the following accomplished appropriately to the protocol of ministry of Health. Conclusion: The explanation to the pregnant women about the gravity of the disease, the transmission way, the consequences for the concept and the need of treating the partner are fundamental points for the prevention of the congenital syphilis.(AU)","authors":["Karina Mesquita"],"meta":["January 2012Jornal Brasileiro de Doenças Sexualmente Transmissíveis 24(1):20-27","DOI:10.5533/2177-8264-201224107"],"references":["250040596_Comercializando_fantasias_A_representacao_social_da_prostituicao_dilemas_da_profissao_e_a_construcao_da_cidadania","14840257_The_Definition_of_Acute_Perinatal_Asphyxia","308057415_Metodos_e_tecnicas_de_pesquisa_social","242192603_SIFILIS_CONGENITA_COMO_FATOR_DE_ASSISTENCIA_PRE-NATAL_NO_MUNICIPIO_DE_CAMPO_GRANDE_-_MS_CONGENITAL_SYPHILIS_AS_PRENATAL_ASSISTANCE_FACTOR_IN_CAMPO_GRANDE_-_MS"]}