{"id":"314488326_Duration_and_quality_of_the_peer_review_process_the_author's_perspective","abstract":"To gain insight into the duration and quality of the scientific peer review process, we analyzed data from 3500 review experiences submitted by authors to the SciRev.sc website. Aspects studied are duration of the first review round, total review duration, immediate rejection time, the number, quality, and difficulty of referee reports, the time it takes authors to revise and resubmit their manuscript, and overall quality of the experience. We find clear differences in these aspects between scientific fields, with Medicine, Public health, and Natural sciences showing the shortest durations and Mathematics and Computer sciences, Social sciences, Economics and Business, and Humanities the longest. One-third of journals take more than 2 weeks for an immediate (desk) rejection and one sixth even more than 4 weeks. This suggests that besides the time reviewers take, inefficient editorial processes also play an important role. As might be expected, shorter peer review processes and those of accepted papers are rated more positively by authors. More surprising is that peer review processes in the fields linked to long processes are rated highest and those in the fields linked to short processes lowest. Hence authors’ satisfaction is apparently influenced by their expectations regarding what is common in their field. Qualitative information provided by the authors indicates that editors can enhance author satisfaction by taking an independent position vis-à-vis reviewers and by communicating well with authors.","authors":["Janine Huisman","Jeroen Smits"],"meta":["March 2017Scientometrics 113(3)","DOI:10.1007/s11192-017-2310-5"],"references":["269761902_Peer_review_Still_king_in_the_digital_age","259636464_A_New_Method_and_Metric_to_Evaluate_the_Peer_Review_Process_of_Scholarly_Journals","259165321_The_publishing_delay_in_scholarly_peer-reviewed_journals","332886550_Rejections_and_the_Importance_of_First_Response_Times","314787923_Regression_with_Dummy_Variables","306006623_The_Peer-review_Process_The_Good_the_Bad_the_Ugly_and_the_Extraordinary","290476697_Why_the_referees'_reports_I_receive_as_an_editor_are_so_much_better_than_the_reports_I_receive_as_an_author","271651885_Evolving_Standards_for_Academic_Publishing_A_q-r_Theory","264675659_The_Peer-review_Process_The_Good_the_Bad_the_Ugly_and_the_Extraordinary","259201049_Modelling_the_effects_of_subjective_and_objective_decision_making_in_scientific_peer_review"]}