{"id":"314498016_This_content_has_been_downloaded_from_IOPscience_Please_scroll_down_to_see_the_full_text_Properties_of_Concrete_partially_replaced_with_Coconut_Shell_as_Coarse_aggregate_and_Steel_fibres_in_addition_t","abstract":"Cement is a binder material with various composition of Concrete but instantly it posses low tensile strength. The study deals with mechanical properties of that optimized fiber in comparison with conventional and coconut shell concrete.The accumulation of fibers arbitrarily dispersed in the composition increases the resistance to cracking, deflection and other serviceability conditions substantially. The steel fiber in extra is one of the revision in coconut shell concrete and the outcome of steel fiber in coconut shell concrete was to investigate and compare with the conventional concrete. For the given range of steel fibe from 0.5 to 2.0% , 12 beams and 36 cylindrical specimens were cast and tested to find the mechanical properties like flexural strength, split tensile, impact resistance and the modulus of elasticity of both conventional and coconut shell concrete has been studied and the test consequences are compared with the control concrete and coconut shell concrete for M25 Grade. It is fulfilled that, the steel fibers used in this venture has shown significant development in all the properties of conventional and coconut shell concrete while compared to controlled conventional and coconut shell concrete like, Flexural strength by 6.67 % for 1.0 % of steel fiber in conventional concrete and by 5.87 % for 1.5 % of steel fiber in coconut shell concrete.","authors":["Kalyan Chakravarthy"],"meta":["February 2017IOP Conference Series Materials Science and Engineering 183(012028):1-12","DOI:10.1088/1757"],"references":["257099368_Recycling_of_Waste_Coconut_Shells_as_Substitute_for_Aggregates_in_Mix_Proportioning_of_Concrete_Hollow_Blocks","257388866_Long_term_study_on_compressive_and_bond_strength_of_coconut_shell_aggregate_concrete","232405466_Mechanical_properties_of_high-strength_steel_fiber-reinforced_concrete","226248567_The_mechanical_properties_of_polypropylene_fiber_reinforced_concrete","223719043_Characteristics_of_high-performance_steel_fiber-reinforced_concrete_subject_to_high_velocity_impact","223712461_Mechanical_properties_of_hybrid_fiber-reinforced_concrete_at_low_fiber_volume_fraction","223564548_Mechanical_properties_of_high_strength_concrete_reinforced_with_metallic_and_non-metallic_fibres"]}