{"id":"314433386_Knowledge_Acquisition_A_Complex_Networks_Approach","abstract":"Complex networks have been found to provide a good representation of knowledge. In this context, the discovery process can be modeled in terms of a dynamic process such as agents moving in a knowledge space. Recent studies proposed more realistic dynamics which can be influenced by the visibility of the agents, or by their memory. However, rather than dealing with these two concepts separately, in this study we propose a multi-agent random walk model for knowledge acquisition that integrates both these aspects. More specifically, we employed the true self avoiding walk modified to incorporate a type of stochastic flight. Such flights depend on fields of visibility emanating from the various agents, in an attempt to model the influence between researchers. The proposed framework has been illustrated considering a set of network models and two real-world networks, one generated from Wikipedia (articles from biology and mathematics) and another from the Web of Science comprising only the area of complex networks. The results were analyzed globally and by regions. In the global analysis, we found that most of the dynamics parameters do not affect significantly the discovery process. Yet, the local analysis revealed a substantial difference in performance, depending on the local topology. In particular, dynamics taking place at the core of the networks tended to enhance knowledge acquisition. The choice of the parameters controlling the dynamics were found to have little impact on the performance for the considered knowledge networks, even at the local scale.","authors":["Henrique Ferraz de Arruda","Filipi Nascimento Silva","Luciano da F. Costa","Diego R. Amancio"],"meta":["September 2017Information Sciences 421","DOI:10.1016/j.ins.2017.08.091","Projects: Connectivity, Dynamics, ComplexityStatistical MethodsDynamic SystemsPattern Recognition and Data MiningModeling and the Scientific MethodComplexityComplex SystemsLinking Information Sciences and Complex NetworksMultiscale and Hierarchical MethodsRelating topology and dynamics in complex networks and systemsModeling and SimulationScientometricsComplex NetworksStudy of languages in space and time using complex networks"],"references":["279633367_Modeling_crowdsourcing_as_collective_problem_solving","275164141_Concept_networks_in_learning_Finding_key_concepts_in_learners'_representations_of_the_interlinked_structure_of_scientific_knowledge","262813340_Experimental_Evidence_of_Massive-Scale_Emotional_Contagion_Through_Social_Networks","257692194_Quantifying_the_interdisciplinarity_of_scientific_journals_and_fields","257663079_Using_complex_networks_concepts_to_assess_approaches_for_citations_in_scientific_papers","324427800_The_Fractal_Geometry_of_Nature","278733665_Using_network_science_and_text_analytics_to_produce_surveys_in_a_scientific_topic","272083611_The_Spontaneous_Emergence_of_Conventions_An_Experimental_Study_of_Cultural_Evolution","264928887_Classification_Parameter_Estimation_and_State_Estimation_An_Engineering_Approach_Using_MATLAB","258310498_Identifying_the_borders_of_mathematical_knowledge"]}