{"id":"314406624_A_Critical_Theory_of_Technology","abstract":"Introduction This chapter summarizes the main ideas of critical theory of technology and shows how it relates to its two sources, Frankfurt School Critical Theory and early work in Science and Technology Studies (STS). 1 Critical theory of technology is concerned with the threat to human agency posed by the technocratic system that dominates modern societies. Two early trends in STS, various versions of social constructivism and Actor-Network Theory (ANT), addressed this threat implicitly, through challenging positivist and determinist ideologies that left little place for democratic control of technology. Critical theory of technology agrees with STS that technology is neither value neutral nor universal while proposing an explicit theory of democratic interventions into technology. As STS has responded in recent years to the emergence of public participation in determining technology policy, it has moved closer to the concerns of critical theory of technology (Chilvers and Kearnes 2016). Critical theory of technology is still distinguished from most contributions to STS by its emphasis on certain themes derived from the Frankfurt School, especially the critique of rationality in modern culture. It thus puts STS in communication with traditions of social critique often overlooked. In this respect it is not so much an alternative to STS as an invitation to open STS to a wider range of philosophical and social theories of modernity. The first sections of this chapter will map the relation between critical theory of technology and some of the major scholars and methodological innovations of STS. Next, the essay explains relevant reservations concerning the concept of symmetry which historically is a central concern of STS scholarship. The succeeding sections explain the principal concepts and methods of critical theory of technology and discuss its political implications. The concluding sections will show how the theory interprets an interesting STS case study.","authors":["Andrew Feenberg"],"meta":["February 2017Thesis Eleven 138(1):635-663","DOI:10.1177/0725513616689388"],"references":["327023309_Produccion_y_Uso_Social_de_Conocimientos_Estudios_de_Sociologia_de_la_Ciencia_y_la_Tecnologia_en_America_Latina","334551270_A_Tale_of_Two_Chemists","329650243_Alternative_Pathways_in_Science_and_Industry_Activism_Innovation_and_the_Environment_in_an_Era_of_Globalizaztion","329644999_Between_Philosophy_and_Social_Science_Selected_Early_Writings","327223730_Technosystem_The_Social_Life_of_Reason","321243623_Building_Musical_Culture_in_Nineteenth-Century_Amsterdam","312939109_The_Third_Wave_of_Science_Studies_Studies_of_Expertise_and_Experience","305389454_Institutional_Ecology_'Translations'_and_Boundary_Objects_Amateurs_and_Professionals_in_Berkeley's_Museum_of_Vertebrate_Zoology","303197669_Value_sensitive_design_and_information_systems","302590927_Innis_in_the_Concertgebouw_Media_and_Musical_Culture_in_Nineteenth-Century_Amsterdam","298698814_Critical_theory_of_technology","296706069_Questioning_Technology","287243373_The_mantra_of_efficiency_From_waterwheel_to_social_control","287235922_Rationality_and_ritual_Participation_and_exclusion_in_nuclear_decision-making","284519004_In_and_about_the_World_Philosophical_Studies_of_Science_and_Technology"]}