{"id":"314467428_An_Analysis_of_Generic_Features_of_Acknowledgments_in_Academic_Writing_Native_Speakers_of_English_vs_Non-Native_Iranian","abstract":"The literature on the generic structure of acknowledgment has revealed that, beyond the role it plays in academic gift giving and self-presentation, the textualization of gratitude reveals the effect of disciplinary, sociocultural and contextual variations on shaping this genre (Hyland, 2003; Giannoni, 2002; Yang, 2012). However, there is relatively scant research on the ways that acknowledgements in different genres are characterized by their distinctive communicative purposes. To fill this gap, this study analyzes through two phases the acknowledgment sections of various genres (20 MA & 20 PhD theses, 20 textbooks, and 20 research articles) written by native speakers of English (n=40) and Iranian (n=40) in applied linguistics. The results of move analysis phase which insights was from Swales’ (1990) model, showed that genre of acknowledgment was constituted of a main “Thanking” move framed by two optional “Reflecting” and “Announcing” moves in theses, two optional “Framing” and “Announcing” moves in textbooks, and one optional “Framing” move in research articles. Despite observing the “Thanking move” in acknowledgment sections of all genres, cross-generic differences were also found in the type and frequency of constituent steps used to realize this move and other optional moves. These differences indicate how the contextual, cultural, and institutional forces influence the production and reception of academic genres.","authors":["Davud Kuhi","Shirin Rezaei"],"meta":["January 2014International Journal of English Linguistics 4(1)","DOI:10.5539/ijel.v4n1p19"],"references":["315112527_The_Life_of_Genre_the_Life_in_the_Classroom","310604618_The_discourse_structure_of_and_sociopolitical_strictures_on_TV_commercials","281506450_Critical_Discourse_Analysis","273513340_Generic_patterns_and_socio-cultural_resources_in_acknowledgements_accompanying_Arabic_PhD_dissertations","273145978_Comparison_of_Gratitude_across_Context_Variations_A_Generic_Analysis_of_Dissertation_Acknowledgements_Written_by_Taiwanese_Authors_in_EFL_and_ESL_Contexts","324306533_An_Introduction_to_Functional_Grammar","313026515_Second_language_learning_theories_Second_edition","292704693_Investigating_conflict_between_the_critical_nature_of_transformative_language_teacher_development_and_student_teachers'_traditional_background","273110436_The_Genre_Function","270152371_An_Introduction_to_Functional_Grammar"]}