{"id":"314433388_Online_Human-Bot_Interactions_Detection_Estimation_and_Characterization","abstract":"Increasing evidence suggests that a growing amount of social media content is generated by autonomous entities known as social bots. In this work we present a framework to detect such entities on Twitter. We leverage more than a thousand features extracted from public data and meta-data about users: friends, tweet content and sentiment, network patterns, and activity time series. We benchmark the classification framework by using a publicly available dataset of Twitter bots. This training data is enriched by a manually annotated collection of active Twitter users that include both humans and bots of varying sophistication. Our models yield high accuracy and agreement with each other and can detect bots of different nature. Our estimates suggest that between 9% and 15% of active Twitter accounts are bots. Characterizing ties among accounts, we observe that simple bots tend to interact with bots that exhibit more human-like behaviors. Analysis of content flows reveals retweet and mention strategies adopted by bots to interact with different target groups. Using clustering analysis, we characterize several subclasses of accounts, including spammers, self promoters, and accounts that post content from connected applications.","authors":["Onur Varol","Emilio Ferrara","Clayton Allen Davis","Filippo Menczer"],"meta":["March 2017","Project: Social Bots"],"references":["308021003_Identifying_Correlated_Bots_in_Twitter","293225378_BotOrNot_A_System_to_Evaluate_Social_Bots","281666638_The_advantage_of_short_paper_titles","281376990_Social_Turing_Tests_Crowdsourcing_Sybil_Detection","312622694_Walking_in_facebook_A_case_study_of_unbiased_sampling_of_osns","312194562_The_Star_Wars'_botnet_with_350k_Twitter_bots","309745190_Social_bots_distort_the_2016_US_Presidential_election_online_discussion","303362931_Information_dissemination_in_heterogeneous-intent_networks","301819535_Predicting_Online_Extremism_Content_Adopters_and_Interaction_Reciprocity","282072720_Botivist_Calling_Volunteers_to_Action_Using_Online_Bots"]}