{"id":"314567250_Fast_Parallel_Sorting_Algorithms_on_GPUs","abstract":"This paper presents a comparative analysis of the three widely used parallel sorting algorithms: Odd-Even sort, Rank sort and Bitonic sort in terms of sorting rate, sorting time and speed-up on CPU and different GPU architectures. Alongside we have implemented novel parallel algorithm: min-max butterfly network, for finding minimum and maximum in large data sets. All algorithms have been implemented exploiting data parallelism model, for achieving high performance, as available on multi-core GPUs using the OpenCL specification. Our results depicts minimum speed-up19x of bitonic sort against odd-even sorting technique for small queue sizes on CPU and maximum of 2300x speed-up for very large queue sizes on Nvidia Quadro 6000 GPU architecture. Our implementation of full-butterfly network sorting results in relatively better performance than all of the three sorting techniques: bitonic, odd-even and rank sort. For min-max butterfly network, our findings report high speed-up of Nvidia quadro 6000 GPU for high data set size reaching 2^24 with much lower sorting time","authors":["Bilal Jan"],"meta":["November 2012International Journal of Distributed and Parallel systems 3(6):107-118","DOI:10.5121/ijdps.2012.3609"],"references":["262370281_GPU-Abisort_Optimal_Parallel_Sorting_on_Stream_Architectures","221202189_GPU_clusters_for_high-performance_computing","220955499_Using_common_graphics_hardware_for_multi-agent_traffic_simulation_with_CUDA","220951290_Designing_efficient_sorting_algorithms_for_manycore_GPUs","313645165_Scan_primitives_for_GPU_computing","242608512_Introduction_to_Parallel_Algorithms_and_Architectures_Arrays_Trees_Hypercubes","227314828_Considering_GPGPU_for_HPC_Centers_Is_It_Worth_the_Effort","224229763_A_quantitative_performance_analysis_model_for_GPU_architectures","224140614_Parallel_computing_with_CUDA","224130594_The_GPU_computing_era","220639794_GPU-Quicksort_A_practical_Quicksort_algorithm_for_graphics_processors","220309913_Multicore_CPUs_for_the_masses"]}