{"id":"314652092_Second_Language_Writing_Publications_in_Web_of_Science_A_Bibliometric_Analysis","abstract":"There are several indicators that distinguish an academic discipline, including journals, conferences, and graduate programs. One of them is the presence of academic publications in well-regarded citation indices such as Web of Science (WoS). This study explored the bibliometric characteristics of publications on “second language writing” (SLW) covered in the Social Sciences Citation Index and the Arts & Humanities Citation Index of WoS. We found that, while the first appeared in 1992 with a steady increase in recent years, there were a total of 266 SLW publications, mostly in the linguistics research area (92%), in the WoS between 1900 and 2013. The publications included articles, book reviews, and bibliographies written by 1.64 authors per publication, suggesting a low level of collaborations among SLW scholars. They cited 31.44 publications and received citations from 5.90 publications on average. An average SLW title had 2.49 different words and a total of 10.85 words, with an abstract of about five sentences and about six keywords and diverse topics including second language writing, writing, academic writing, error correction, and plagiarism. Our findings will be of value to second language writing scholars, graduate students, and practitioners for examining the status of their field.","authors":["Beril Tezeller Arik","Engin Arik"],"meta":["March 2017Publications 5(1):4","DOI:10.3390/publications5010004"],"references":["299397922_World_Englishes_from_a_Citation_Index_Perspective","297725014_A_bibliometric_analysis_of_linguistics_in_web_of_science","297724720_Sign_language_research_in_web_of_science","275335177_The_Leiden_Manifesto_for_research_metrics","321748762_Contrastive_Rhetoric_Cross-Cultural_Aspects_of_Second-Language_Writing","302561944_Towards_an_understanding_of_the_distinct_nature_of_L2_writing_The_ESL_research_and_its_implications","270304489_Contrastive_Rhetoric_Cross-Cultural_Aspects_of_Second-Language_Writing","270150588_Second_Language_Writing_Research_Insights_for_the_Classroom","270150410_Genre_Analysis_English_in_Academic_and_Research_Settings","264615527_Visualizing_social_connections_in_the_humanities_Beyond_bibliometrics"]}