{"id":"314657529_Optimization_of_heterogeneous_Bin_packing_using_adaptive_genetic_algorithm","abstract":"This research is concentrates on a very interesting work, the bin packing using hybrid genetic approach. The optimal and feasible packing of goods for transportation and distribution to various locations by satisfying the practical constraints are the key points in this project work. As the number of boxes for packing can not be predicted in advance and the boxes may not be of same category always. It also involves many practical constraints that are why the optimal packing makes much importance to the industries. This work presents a combinational of heuristic Genetic Algorithm (HGA) for solving Three Dimensional (3D) Single container arbitrary sized rectangular prismatic bin packing optimization problem by considering most of the practical constraints facing in logistic industries. This goal was achieved in this research by optimizing the empty volume inside the container using genetic approach. Feasible packing pattern was achieved by satisfying various practical constraints like box orientation, stack priority, container stability, weight constraint, overlapping constraint, shipment placement constraint. 3D bin packing problem consists of 'n' number of boxes being to be packed in to a container of standard dimension in such a way to maximize the volume utilization and in-turn profit. Furthermore, Boxes to be packed may be of arbitrary sizes. The user input data are the number of bins, its size, shape, weight, and constraints if any along with standard container dimension. This user input were stored in the database and encoded to string (chromosomes) format which were normally acceptable by GA. GA operators were allowed to act over these encoded strings for finding the best solution.","authors":["R Sridhar","Dr.M. Chandrasekaran","C Sriramya","Tom Page"],"meta":["March 2017IOP Conference Series Materials Science and Engineering 183(1):012026","DOI:10.1088/1757-899X/183/1/012026"],"references":["2353632_The_Three-Dimensional_Bin_Packing_Problem","227639590_A_Genetic_Algorithm_for_Solving_the_Container_Loading_Problem","223079635_Hybrid_genetic_algorithm_for_the_container_loading_problem","222558664_Heuristic_for_the_container_loading_problem","222434546_Using_tree_search_bounds_to_enhance_a_genetic_algorithm_approach_to_two_rectangle_packing_problems","222299168_Tree_dimensional_packing_of_items_with_limited_load_bearing_strength","221603939_A_New_Algorithm_for_Optimal_Bin_Packing","220815366_An_Improved_Algorithm_for_Optimal_Bin_Packing","30870312_Genetic_Algorithm_in_Search_Optimization_and_Machine_Learning","2544582_Application_of_Genetic_Algorithms_to_Packing_Problems_-_A_Review"]}