{"id":"314749194_Quality_Issues_of_Online_Distance_Learning","abstract":"Despite a rapid development of online tertiary education, it is clear that educators and students encounter certain barriers that affect the overall quality of distance learning. This paper aims to present the results of the survey conducted at the Ural State University of Economics and Ural Federal University (Yekaterinburg, Russia) on student-focused quality indicators: interaction and collaboration; instructional design and delivery; student assessment; student support services. Over 800 degree students (n = 830) involved in distance learning programs responded to a 26-question on-line survey to identify the areas that the university administrators, staff, and technicians can improve upon to ensure high quality of online distance education delivery. We found that although degree students overall positively evaluate their distance learning experiences; they face some learning challenges especially in regard to effective teaching practices and communication patterns. The findings support the prediction that the faculty plays crucial role in knowledge construction and can be of use for all tertiary sector stakeholders in exploring solutions to maximize the ICT potential in distance tertiary education.","authors":["Markova Tatiana","I.G. Glazkova","E. Zaborova"],"meta":["February 2017Procedia - Social and Behavioral Sciences 237:685-691","DOI:10.1016/j.sbspro.2017.02.043"],"references":["268812071_The_Search_for_Meaningful_e-Learning_at_Canadian_Universities_A_Multi-Institutional_Research_Study","234627278_Distance_Education_in_the_Digital_Age_Common_Misconceptions_and_Challenging_Tasks","285651933_Comparing_the_Effectiveness_of_Classroom_and_Online_Learning_Teaching_Research_Methods","274526750_Evaluating_the_Effectiveness_of_Distance_Learning_A_Comparison_Using_Meta-Analysis","265288633_On-Line_Course_Effectiveness_An_Analysis_of_Student_Interactions_and_Perceptions_of_Learning","257496492_Blended_learning_A_dangerous_idea","255646189_Distance_Learning_Promises_Problems_and_Possibilities","237063306_Conditions_Under_Which_Assessment_Supports_Students'_Learning","233008849_Factors_influencing_faculty_satisfaction_with_online_teaching_and_learning_in_higher_education","227629666_Evaluating_the_Effectiveness_of_Distance_Learning_A_Comparison_Using_Meta-Analysis"]}