{"id":"314797927_DNA_Origami_and_Unknotted_A-trails_in_Torus_Graphs","abstract":"Motivated by the problem of determining unknotted routes for the scaffolding strand in DNA origami self-assembly, we examine existence and knottedness of A-trails in graphs embedded on the torus. We show that any A-trail in a checkerboard-colorable torus graph is unknotted and characterize the existence of A-trails in checkerboard-colorable torus graphs in terms of pairs of quasitrees in associated embeddings. Surface meshes are frequent targets for DNA nanostructure self-assembly, and so we study both triangular and rectangular torus grids. We show that, aside from one exceptional family, a triangular torus grid contains an A-trail if and only if it has an odd number of vertices, and that such an A-trail is necessarily unknotted. On the other hand, while every rectangular torus grid contains an unknotted A-trail, we also show that any torus knot can be realized as an A-trail in some rectangular grid. Lastly, we use a gluing operation to construct infinite families of triangular and rectangular grids containing unknotted A-trails on surfaces of arbitrary genus. We also give infinite families of triangular grids containing no unknotted A-trail on surfaces of arbitrary nonzero genus.","authors":["Ada Morse","William Adkisson","Jessica Greene","David Perry"],"meta":["March 2017Journal of Knot Theory and Its Ramifications 29(5761)","DOI:10.1142/S0218216520500418"],"references":["291801654_Folding_DNA_to_create_nanoscale_shapes_and_patterns","260809073_Polyhedra_self-assembled_from_DNA_tripods_and_characterized_with_3D_DNA-PAINT","316807729_Graduate_Texts_in_Mathematics","313531899_A_conjecture_in_topological_graph_theory","309215424_Design_tools_for_reporter_strands_and_DNA_origami_scaffold_strands","280389197_DNA_rendering_of_polyhedral_meshes_at_the_nanoscale","269004451_Eulerian_lines_in_finite_4-valent_graphs_and_their_transformations","266956292_An_introduction_to_knot_theory","248831601_Construction_and_enumeration_of_regular_maps_on_the_torus","243134699_Orthogonal_A-Trails_of_4Regular_Graphs_Embedded_in_Surfaces_of_Low_Genus"]}