{"id":"314714629_Analysis_of_the_use_of_ICT_through_Music_Interactive_Games_as_Educational_Strategy","abstract":"Information and communication technologies have been quickly introduced in all professional and leisure environments. Nonetheless, this process has been slower in educational spheres. ICT contribute and will contribute even further to the renewal of teaching by bringing innovation and creativity. For this reason, we have conducted an investigation in order to ascertain whether through a methodology based on the use of new technologies (ICT) musical knowledge and consequently academic performance of a group of students from 3rd year can be improved. To achieve this goal, two groups of students were selected: one was experimental, who received encouragement (22 learners) and the other group that was controlled (24 students), who worked in Music classroom in a traditional way. The results show that musical learning through the use of ICT improved in 100% of the parameters analysed. For this reason, it is concluded that it is essential that teachers must seek new teaching methods and strategies to achieve a greater effectiveness of their action as a teacher, and these techniques should be undoubtedly closely linked with the introduction of ICT in the classroom.","authors":["Rocío Chao-Fernández","Sara Román-García","Aurelio Chao Fernandez"],"meta":["February 2017Procedia - Social and Behavioral Sciences 237:576-580","DOI:10.1016/j.sbspro.2017.02.109"],"references":["344826331_Experiencias_Educativas_en_las_Aulas_del_siglo_XXI","282389827_Beneficios_de_la_musica_en_conductas_disruptivas_en_la_adolescencia","279510494_Pedagogic_approaches_to_using_technology_for_learning_literature_review","276481901_Music_Therapy_in_Adolescent_Disruptive_Behaviour","261724341_De_lo_solido_a_lo_liquido_las_nuevas_alfabetizaciones_ante_los_cambios_culturales_de_la_Web_20","235771131_Tecnologias_emergentes_pedagogias_emergentes","307804084_De_lo_solido_a_lo_liquido_Las_nuevas_alfabetizaciones_ante_los_cambios_culturales_de_la_Web_20_From_Solid_to_Liquid_New_Literacies_to_the_Cultural_Changes_of_Web_20","32932140_El_Proyecto_de_Investigacion_Introduccion_a_la_Metodologia_Cientifica","28222653_Las_nuevas_tecnologias_y_la_expresion_musical_otros_lenguajes_en_la_educacion"]}