{"id":"314756215_Collaborative_MOOC_content_design_and_automatic_assessment_based_on_ODALA_approach","abstract":"Since the fall of 2011, the Massive Open Online Course (MOOC) phenomenon is still being qualified as the most attractive and discussed subject by educational communities and public. In the literature, there are many researches about this recent e-learning generation that vary as the goals vary from raising pedagogical issues to economics ones. Several case studies state that MOOCs are challenging the use of technologies to enhance learning; others think that MOOCs can induce to disruptive in education and educational institutions. In this paper, we propose an instructional design for a kind of MOOC platforms where mainly the use of disciplines specifications and automated evaluation of MOOC learners are possible to settle the source of these problems. Our proposition is based on ODALA (Ontology-Driven Auto-evaluation Learning Approach) principles and on the disciplines' knowledge capitalization using a meta-model represented as domain ontology for disciplines modeling inspired by this approach.","authors":["Nacera Hammid","Haddadi Lynda","Farida Bouarab-Dahmani"],"meta":["April 2017Journal of Information Technology Research 10(2):19-39","DOI:10.4018/JITR.2017040102","Project: Capitalisation des connaissances  de contenu des MOOCs basée ontologies  pour renforcer l'évaluation automatisée"],"references":["284716166_Extending_MOOC_ecosystems_using_web_services_and_software_architectures","275822965_What_Drives_a_Successful_MOOC_An_Empirical_Examination_of_Criteria_to_Assure_Design_Quality_of_MOOCs","275771115_The_MOOC_as_Distributed_Intelligence_Dimensions_of_a_Framework_Evaluation_of_MOOCs","275271507_Le_concept_de_iMOOC_pour_une_ouverture_maitrisee","271516787_Why_do_Institutions_Offer_MOOCs","307625028_Semantic_Wikis_as_Platforms_for_Teaching_and_Learning_Support_in_Higher_Education","296797288_Information_Resources_Management_Global_Challenges","295258490_Metadata_modelling_disciplines_for_e-learning_by_doing_systems","284626319_Massive_open_online_courses_Innovation_in_education","273315909_MOOCs_and_their_impact_on_academics"]}