{"id":"314840066_JOG_DIAGNOSTICS_TYROSINEMIYA_TYPE_1_IN_CHILDREN_AND_EVALUATE_THE_EFFECTIVENESS_OF_SPECIFIC_THERAPY","abstract":"Introduction: tyrosinemia type I — is a rare genetic disease that leads to cirrhosis of the liver, liver failure, and tubulopathy. In this connection, great importance is early diagnosis and timely initiation of pathogenetic treatment of the disease.\nGoal. Based on multivariate statistical analysis of clinical diagnostic indicators and their changes over time to develop an algorithm stepwise diagnosis of hereditary tyrosinemia type I in children and to evaluate the effectiveness of pathogenetic therapy. The scope and methods. The study included 17 children (8 boys and 9 girls) with tyrosinemia type I: 5 patients (29.4%) with type IA and 12 patients (70.6%) with the IB type. All children received pathogenetic therapy of NTBC . Conducted the study of history and the life of the patients of the disease, we evaluated the clinical and laboratory data at the onset of the disease and on the background of a six-month course of pathogenetic therapy.\nResults. Using multivariate statistical analysis revealed clinical and laboratory criteria for diagnosis of tyrosinemia type 1 in young children, followed by incremental compilation disease diagnostic algorithm. The estimation of the severity of liver dysfunction before and 6 months after initiation of specific therapy, which has proven its improvement.","authors":["G. V. Volynets","Gevorkyan A. K.","Bushueva T. V.","Artem Nikitin"],"meta":["January 2017","Project: DIAGNOSIS AND TREATMENT OF LIVER DISEASES IN CHILDREN"],"references":["265129094_Early_effect_of_NTBC_on_renal_tubular_dysfunction_in_Hereditary_Tyrosinemia_type_1","14724833_Hereditary_tyrosinemia_Type_I_Self-induced_correction_of_the_fumarylacetoacetase_defect","285263000_Hereditary_tyrosinemia_type_I_A_new_clinical_classification_with_difference_in_prognosis_on_dietary_treatment","230656151_Effect_of_nitisinone_NTBC_treatment_on_the_clinical_course_of_hepatorenal_tyrosinemia_in_Quebec","20598764_Tyrosinaemia_Type_I_Orthotopic_Liver_Transplantation_as_the_Only_Definitive_Answer_to_a_Metabolic_as_well_as_an_Oncological_Problem","15272486_Hereditary_Tyrosinemia_Type_I_A_New_Clinical_Classification_with_Difference_in_Prognosis_on_Dietary_Treatment","14426847_Diagnosis_and_management_of_Tyrosinemia_type_1","7074207_Nitisinone_in_the_Treatment_of_Hereditary_Tyrosinaemia_Type_1","5636445_NTBC_treatment_in_tyrosinaemia_type_I_Long-term_outcome_in_French_patients"]}