{"id":"314868101_Lifecycle_Management_in_the_Smart_City_Context_Smart_Parking_Use-Case","abstract":"Lifecycle management enables enterprises to manage their products, services and product-service bundles. IoT and CPS have made products and services smarter by closing the loop of data across different phases of lifecycle. Similarly, CPS and IoT empower cities with real-time data streams from heterogeneous objects. Yet, cities are smarter and more powerful when relevant data can be exchanged between different systems across different domains. From engineering perspective, smart city can be seen as a System of Systems composed of interrelated/interdependent smart systems and objects. To better integrate people, processes, and systems in the smart city ecosystem, this paper discusses the use of Lifecycle Management in the smart city context. Considering the differences between ordinary and smart service systems, this paper seeks better understanding of lifecycle aspects in the smart city context. For better understanding, some of the discussed lifecycle aspects are demonstrated in a smart parking use-case.","authors":["Ahmed Hefnawy","Taha Elhariri","Abdelaziz Bouras","Chantal Cherifi"],"meta":["January 2016","DOI:10.1007/978-3-319-54660-5_56","Conference: IFIP International Conference on Product Lifecycle Management"],"references":["302132641_Modeling_and_simulation_framework_for_systems_engineering","292078398_IoT_for_Smart_City_Services_Lifecycle_Approach","283438924_Lifecycle_Based_Modeling_of_Smart_City_Ecosystem","283438766_Integration_of_Smart_City_and_Lifecycle_Concepts_for_Enhanced_Large-Scale_Event_Management","276457481_Big_Data_in_product_lifecycle_management","276298923_Customer-oriented_Framework_for_Product-service_Systems","316800565_Decision_Engineering","315125088_Product_Lifecycle_Management","309087818_A_PLM_components_monitoring_framework_for_SMEs_based_on_a_PLM_maturity_model_and_FAHP_methodology","301574032_Servicization_of_Product_Lifecycle_Management_Towards_Service_Lifecycle_Management"]}