{"id":"314868777_A_Novel_Hybrid_Protocol_of_Checkpointing_and_Rollback_Recovery_for_Flat_MANETs","abstract":"With the advent of new technologies in the area of wireless systems\nand communications, modern distributed systems are subject to new\nconstraints. Indeed, there is an increasing need to develop ad hoc distributed applications. However, the latter are now subject to new type of failures with more frequency. Therefore, fault tolerance is a crucial property to guarantee in this context and particularly for MANETs which are considered in this paper.\nWe propose for this effect, a new hybrid checkpointing and rollback recovery protocols for flat MANETs, called two phases algorithm of checkpointing for adhoc networks (2PACA) networks. This protocol operates in the background of the distributed application and allows the latter to recover from a failure and to resume its processing. We advocate the use of our protocol in the context of flat MANETs and evaluate its performances by reporting some exhaustive simulation results performed on NS2 platform.","authors":["Haroun BENKAOUHA","N. Badache","A. Abdelli","Lynda Mokdad"],"meta":["January 2017International Journal of Autonomous and Adaptive Communications Systems 10(1):114","DOI:10.1504/IJAACS.2017.082745","Project: Méthodes formelles et de simulation pour la vérification des réseaux mobiles"],"references":["261378574_2PACA_Two_phases_algorithm_of_checkpointing_for_Ad_hoc_mobile_networks","235762354_A_Distributed_Domino-effect_free_Recovery_Algorithm","234790489_System_Structure_for_Software_Fault_Tolerance","232639458_A_low-overhead_recovery_technique_using_quasi-synchronous_checkpointing","232621943_Checkpointing_and_Its_Applications","289177965_Message_efficient_global_snapshot_recording_using_a_self_stabilizing_spanning_tree_in_a_MANET","274171534_Eventually_Strong_Failure_Detector_with_Unknown_Membership","270956471_Distributed_Systems_Principles_and_Paradigms","263979790_A_minimum-process_coordinated_checkpointing_protocol_for_mobile_computing_systems","236002478_Autonomous_and_Scalable_Failure_Detection_in_Distributed_Systems"]}