{"id":"314915819_Um_olhar_sobre_a_origem_da_ciencia_da_informacao_indicios_embrionarios_para_sua_caracterizacao_identitaria","abstract":"Discute sobre fundamentos sociais, científicos e cotidianos que deram vazão para o advento da Ciência da Informação, visando conceber suas características identitárias. A condição problematológica do presente trabalho pode ser sintetizada a partir da seguinte pergunta: Quais os fatores diretos e/ou indiretos que deram vazão para o surgimento da Ciência da Informação? Quais as influências desses fatores para a construção e caracterização da identidade da Ciência da Informação? Tem como objetivo discutir sobre os diversos fenômenos sociais, acadêmicos e científicos que direta e/ou indiretamente promoveram origem a Ciência da Informação. Metodologicamente, o artigo apresenta uma pesquisa exploratória no contexto da investigação histórica por meio de uma revisão bibliográfica. Conclui que diversos fatores auxiliaram na origem e construção da Ciência da Informação mostrando a sua característica de ciência pós-moderna, sendo possível observar diversas características identitárias a partir dos elementos que deram vazão a origem da Ciência da Informação, tais como: identidade histórica (relação entre Biblioteconomia e Ciência da Informação); identidade de projeto (a Documentação de Otlet e La Fontaine); identidade partilhada (contribuição dos EUA e do continente europeu para criação da Ciência da Informação) e identidade institucional (criação de associações em Ciência da Informação).","authors":["Jonathas Luiz Carvalho Silva","Gustavo Henrique de Araújo Freire"],"meta":["April 2012Encontros Bibli Revista Eletrônica de Biblioteconomia e Ciência da Informação 17(33)","DOI:10.5007/1518-2924.2012v17n33p1"],"references":["250988068_Correntes_teoricas_da_ciencia_da_informacao","240973632_Ciencia_da_informacao_tematica_historias_e_fundamentos","240971908_Problemas_causados_por_Gutenberg_a_explosao_da_informacao_nos_primordios_da_Europa_moderna","220434198_The_Origins_of_Information_Science_and_the_International_Institute_of_BibliographyInternational_Federation_for_Information_and_Documentation_FID","200694394_A_abordagem_teorica_de_A_I_Mikhailov_sobre_o_termo_informacao_cientifica","40816864_Surgimento_e_consolidacao_da_Documentacao_subsidios_para_compreensao_da_historia_da_Ciencia_da_Informacao_no_Brasil","220433553_Mooers'_Law_In_and_out_of_context","220229130_Information_Science_The_Study_of_Postmodern_Knowledge_Usage","220195671_The_sociological_turn_in_information_science","40885815_Grupos_de_Pesquisa_em_Ciencia_da_Informacao_no_Brasil"]}