{"id":"314970974_On_avoided_words_absent_words_and_their_application_to_biological_sequence_analysis","abstract":"Background The deviation of the observed frequency of a word w from its expected frequency in a given sequence x is used to determine whether or not the word is avoided. This concept is particularly useful in DNA linguistic analysis. The value of the deviation of w, denoted by \\(\\textit{dev}(w)\\), effectively characterises the extent of a word by its edge contrast in the context in which it occurs. A word w of length \\(k>2\\) is a \\(\\rho \\)-avoided word in x if \\(\\textit{dev}(w) \\le \\rho \\), for a given threshold \\(\\rho < 0\\). Notice that such a word may be completely absent from x. Hence, computing all such words naïvely can be a very time-consuming procedure, in particular for large k. Results In this article, we propose an \\(\\mathcal {O}(n)\\)-time and \\(\\mathcal {O}(n)\\)-space algorithm to compute all \\(\\rho \\)-avoided words of length k in a given sequence of length n over a fixed-sized alphabet. We also present a time-optimal \\(\\mathcal {O}(\\sigma n)\\)-time algorithm to compute all \\(\\rho \\)-avoided words (of any length) in a sequence of length n over an integer alphabet of size \\(\\sigma \\). In addition, we provide a tight asymptotic upper bound for the number of \\(\\rho \\)-avoided words over an integer alphabet and the expected length of the longest one. We make available an implementation of our algorithm. Experimental results, using both real and synthetic data, show the efficiency and applicability of our implementation in biological sequence analysis. Conclusions\nThe systematic search for avoided words is particularly useful for biological sequence analysis. We present a linear-time and linear-space algorithm for the computation of avoided words of length k in a given sequence x. We suggest a modification to this algorithm so that it computes all avoided words of x, irrespective of their length, within the same time complexity. We also present combinatorial results with regards to avoided words and absent words.","authors":["Yannis Almirantis","Panagiotis Charalampopoulos","Jia Gao","Costas Iliopoulos"],"meta":["March 2017Algorithms for Molecular Biology 12(1):5","DOI:10.1186/s13015-017-0094-z"],"references":["325937469_Alignment-free_sequence_comparison_using_absent_words","315018166_Optimal_Computation_of_Avoided_Words","315005583_Analysis_and_Classification_of_Constrained_DNA_Elements_with_N-gram_Graphs_and_Genomic_Signatures","315005484_From_Theory_to_Practice_Plug_and_Play_with_Succinct_Data_Structures","315005200_Parallelising_the_Computation_of_Minimal_Absent_Words","314988710_Linear-Time_Sequence_Comparison_Using_Minimal_Absent_Words_Applications","314988709_Space-Efficient_Detection_of_Unusual_Words","314931929_Linear-Time_Sequence_Comparison_Using_Minimal_Absent_Words_Applications","312726818_Parallelising_the_Computation_of_Minimal_Absent_Words","301818307_Optimal_Computation_of_Avoided_Words"]}