{"id":"315060244_AVC_Selecting_discriminative_features_on_basis_of_AUC_by_maximizing_variable_complementarity","abstract":"Background\nThe Receiver Operator Characteristic (ROC) curve is well-known in evaluating classification performance in biomedical field. Owing to its superiority in dealing with imbalanced and cost-sensitive data, the ROC curve has been exploited as a popular metric to evaluate and find out disease-related genes (features). The existing ROC-based feature selection approaches are simple and effective in evaluating individual features. However, these approaches may fail to find real target feature subset due to their lack of effective means to reduce the redundancy between features, which is essential in machine learning. ResultsIn this paper, we propose to assess feature complementarity by a trick of measuring the distances between the misclassified instances and their nearest misses on the dimensions of pairwise features. If a misclassified instance and its nearest miss on one feature dimension are far apart on another feature dimension, the two features are regarded as complementary to each other. Subsequently, we propose a novel filter feature selection approach on the basis of the ROC analysis. The new approach employs an efficient heuristic search strategy to select optimal features with highest complementarities. The experimental results on a broad range of microarray data sets validate that the classifiers built on the feature subset selected by our approach can get the minimal balanced error rate with a small amount of significant features. Conclusions\nCompared with other ROC-based feature selection approaches, our new approach can select fewer features and effectively improve the classification performance.","authors":["Lei Sun","Jun Wang","Jinmao Wei"],"meta":["March 2017BMC Bioinformatics 18(S3)","DOI:10.1186/s12859-017-1468-4"],"references":["301856754_Feature_Selection_A_Data_Perspective","262772521_Fuzzy_Preference_Based_Feature_Selection_and_Semisupervised_SVM_for_Cancer_Classification","259525845_An_Improved_Minimum_Redundancy_Maximum_Relevance_Approach_for_Feature_Selection_in_Gene_Expression_Data","226043864_Tree_Induction_for_Probability-Based_Ranking","225420814_Volume_under_the_ROC_Surface_for_Multi-class_Problems","282622587_Towards_scalable_fuzzy-rough_feature_selection","262566601_Data_Mining_Practical_Machine_Learning_Tools_and_Techniques_Third_Edition","245589343_Broad_patterns_of_gene_expression_revealed_by_clustering_analysis_of_tumor_and_normal_colon_tissues","224541268_Learning_from_Imbalanced_Data","224263838_On_Similarity_Preserving_Feature_Selection"]}