{"id":"315096608_Complexity_of_Infimal_Observable_Superlanguages","abstract":"The infimal prefix-closed, controllable and observable superlanguage plays an essential role in the relationship between controllability, observability and co-observability -- the central notions of supervisory control theory. Existing algorithms for its computation are exponential and it is not known whether a polynomial algorithm exists. In this paper, we study the state complexity of this language. State complexity of a language is the number of states of the minimal DFA for the language. For a language of state complexity $n$, we show that the upper-bound state complexity on the infimal prefix-closed and observable superlanguage is $2^n + 1$ and that this bound is asymptotically tight. It proves that there is no algorithm computing a DFA of the infimal prefix-closed and observable superlanguage in polynomial time. Our construction further shows that such a DFA can be computed in time $O(2^n)$. The construction involves NFAs and a computation of the supremal prefix-closed sublanguage. We study the computation of the supremal prefix-closed sublanguage and show that there is no polynomial-time algorithm that computes an NFA of the supremal prefix-closed sublanguage of a language given as an NFA even if the language is unary.","authors":["Tomáš Masopust"],"meta":["March 2017IEEE Transactions on Automatic Control PP(99)","DOI:10.1109/TAC.2017.2720424","Project: Complexity in supervisory control"],"references":["316461786_Computation_of_controllable_and_coobservable_sublanguages_in_decentralized_supervisory_control_via_communication","315096605_Complexity_of_Verifying_Nonblockingness_in_Modular_Supervisory_Control","286512874_On_the_Computation_of_Controllable_and_Coobservable_Sublanguages_in_Decentralized_Supervisory_Control","280445715_The_On-Line_Encyclopedia_of_Integer_Sequences","280228423_On_a_Distributed_Computation_of_Supervisors_in_Modular_Supervisory_Control","239482725_Control_of_discrete_event_system","230807016_On_a_structural_property_in_the_state_complexity_of_projected_regular_languages","247442902_Introduction_To_Algorithms","245253342_Algorithmic_Number_Theory_Volume_I_Efficient_Algorithms","239047207_Algebraic_and_Automata_Theoretic_Properties_of_Formal_Languages"]}