{"id":"315060101_Gendered_Expectations_Examining_How_Peers_Shape_Female_Students'_Intent_to_Pursue_STEM_Fields","abstract":"Building on prior psychological and sociological research on the power of local environments to shape gendered outcomes in STEM fields, this study focuses on the critical stage of adolescence to explore the potential negative impact of exposure to exclusionary messages from peers within girls' science classrooms, as well as the positive potential impact of inclusionary messages. Specifically, utilizing longitudinal data from a diverse sample of adolescent youth, analyses examine how the presence of biased male peers, as well as confident female peers, shape girls' subsequent intentions to pursue different STEM fields, focusing specifically on intentions to pursue the male-dominated fields of computer science and engineering, as well as more gender equitable fields. Results reveal that exposure to a higher percentage of 8th grade male peers in the classroom who endorsed explicit gender/STEM stereotypes significantly and negatively predicted girls' later intentions to pursue a computer science/engineering (CS/E) major. Yet results also reveal that exposure to a higher percentage of confident female peers in the science classroom positively predicted such intentions. These results were specific to CS/E majors, suggesting that peers are an important source of messages regarding whether or not girls should pursue non-traditional STEM fields. This study calls attention to the importance of examining both positive and negative sources of influence within the local contexts where young people live and learn. Limitations and directions for future research are also discussed.","authors":["Catherine Riegle-Crumb","Karisma Morton"],"meta":["March 2017Frontiers in Psychology 8","DOI:10.3389/fpsyg.2017.00329"],"references":["281345525_Motivational_Beliefs_Values_and_Goals","274644414_Female_peers_in_small_work_groups_enhance_women's_motivation_verbal_participation_and_career_aspirations_in_engineering","309021383_Why_are_some_STEM_fields_more_gender_balanced_than_others","306264689_Women_Wrestlers'_Gender_Role_Negotiation_and_Doing_Gender","294287681_Perpetuating_Separate_and_Unequal_Worlds_of_Educational_Opportunity_Through_District_Lines_School_Segregation_by_Race_and_Poverty","289963838_Schools_as_developmental_contexts_during_adolescence","276527386_STEM_Education","272562434_Gender_and_Values","261776717_The_Gender_Revolution_Uneven_and_Stalled","261528396_Young_Adolescents'_Perceptions_of_Teachers'_and_Peers'_Goals_as_Predictors_of_Social_and_Academic_Goal_Pursuit"]}