{"id":"315045187_A_Survey_on_Software-Defined_Wireless_Sensor_Networks_Challenges_and_Design_Requirements","abstract":"Software defined networking (SDN) brings about innovation, simplicity in network management, and configuration in network computing. Traditional networks often lack the flexibility to bring into effect instant changes because of the rigidity of the network and also the over dependence on proprietary services. SDN decouples the control plane from the data plane, thus moving the control logic from the node to a central controller. A wireless sensor network (WSN) is a great platform for low-rate wireless personal area networks with little resources and short communication ranges. However, as the scale of WSN expands, it faces several challenges, such as network management and heterogeneous-node networks. The SDN approach to WSNs seeks to alleviate most of the challenges and ultimately foster efficiency and sustainability in WSNs. The fusion of these two models gives rise to a new paradigm: Software defined wireless sensor networks (SDWSN). The SDWSN model is also envisioned to play a critical role in the looming Internet of Things paradigm. This paper presents a comprehensive review of the SDWSN literature. Moreover, it delves into some of the challenges facing this paradigm, as well as the major SDWSN design requirements that need to be considered to address these challenges.","authors":["Hlabishi Kobo","Adnan M. Abu-Mahfouz","Gerhard P. Hancke"],"meta":["February 2017IEEE Access 5(2):1872 - 1899","DOI:10.1109/ACCESS.2017.2666200","Projects: Smart NetworksSoftware-Defined Wireless Sensor Networks"],"references":["312560251_A_key_distribution_scheme_using_elliptic_curve_cryptography_in_wireless_sensor_networks","326127843_Survey_on_software_defined_network","316857231_B4_experience_with_a_globally-deployed_software_defined_wan","312247902_Towards_an_IoT-based_system_for_Smart_City","311251688_A_survey_Comparative_study_of_applications_attacks_security_and_privacy_in_VANETs","310670788_Ad-hoc_on-demand_distance_vector_AODV_routing","310624470_A_new_approach_towards_IoT_by_using_health_care-IoT_and_food_distribution_IoT","310055033_Security_in_software_defined_networks_A_survey","309201797_A_software_defined_networking_architecture_for_the_internet-of-things","308846358_SDN-WISE_Design_prototyping_and_experimentation_of_a_stateful_SDN_solution_for_WIreless_SEnsor_networks"]}