{"id":"315046299_Automatic_Speech_Recognition_Predicts_Speech_Intelligibility_and_Comprehension_for_Listeners_With_Simulated_Age-Related_Hearing_Loss","abstract":"Purpose. The purpose of this article is to assess speech processing for listeners with simulated age-related hearing loss (ARHL) and to investigate whether the observed performance can be replicated using an automatic speech recognition (ASR) system. The long-term goal of this research is to develop a system that will assist audiologists/hearing-aid dispensers in the fine-tuning of hearing aids.\n\nMethod. Sixty young participants with normal hearing listened to speech materials mimicking the perceptual consequences of ARHL at different levels of severity. Two intelligibility tests (repetition of words and sentences) and 1 comprehension test (responding to oral commands by moving virtual objects) were administered. Several language models were developed and used by the ASR system in order to fit human performances.\n\nResults. Strong significant positive correlations were observed between human and ASR scores, with coefficients up to .99. However, the spectral smearing used to simulate losses in frequency selectivity caused larger declines in ASR performance than in human performance.\n\nConclusion. Both intelligibility and comprehension scores for listeners with simulated ARHL are highly correlated with the performances of an ASR-based system. In the future, it needs to be determined if the ASR system is similarly successful in predicting speech processing in noise and by older people with ARHL.","authors":["Lionel Fontan","Isabelle Ferrané","Jérôme Farinas","Julien Pinquier"],"meta":["August 2017Journal of Speech Language and Hearing Research 60(9):2394–2405","DOI:10.1044/2017_JSLHR-S-16-0269","Project: CarlW — Using automatic speech recognition for the fine-tuning of hearing aids"],"references":["307452773_On_The_Unimportance_of_Working_Memory_in_Speech-in-Noise_Processing_for_Listeners_with_Normal_Hearing_Thresholds","303898473_Using_Phonologically_Weighted_Levenshtein_Distances_for_the_Prediction_of_Microscopic_Intelligibility","301320931_Investigating_the_Role_of_Working_Memory_in_Speech-in-noise_Identification_for_Listeners_with_Normal_Hearing","281584618_Automatic_intelligibility_measures_applied_to_speech_signals_simulating_age-related_hearing_loss","281177025_Predicting_disordered_speech_comprehensibility_from_Goodness_of_Pronunciation_scores","279549988_Comprendre_et_agir_les_tests_pragmatiques_de_comprehension_de_la_parole_et_EloKanz","278642365_De_la_mesure_de_l'intelligibilite_a_l'evaluation_de_la_comprehension_de_la_parole_pathologique_en_situation_de_communication_-_From_intelligibility_measures_to_the_assessment_of_disordered_speech_comp","298064910_PREVALENCE_OF_HEARING-LOSS_IN_OLDER_ADULTS_-_THE_EPIDEMIOLOGY_OF_HEARING-LOSS_STUDY","285258660_Intelligibility_in_World_Englishes","281663607_Cochlear_Hearing_Loss_Physiological_Psychological_and_Technical_Issues_Second_Edition"]}