{"id":"315098777_Towards_Moral_Autonomous_Systems","abstract":"Both the ethics of autonomous systems and the problems of their technical implementation have by now been studied in some detail. Less attention has been given to the areas in which these two separate concerns meet. This paper, written by both philosophers and engineers of autonomous systems, addresses a number of issues in machine ethics that are located at precisely the intersection between ethics and engineering. We first discuss different approaches towards the conceptual design of autonomous systems and their implications on the ethics implementation in such systems. Then we examine problematic areas regarding the specification and verification of ethical behavior in autonomous systems, particularly with a view towards the requirements of future legislation. We discuss transparency and accountability issues that will be crucial for any future wide deployment of autonomous systems in society. Finally we consider the, often overlooked, possibility of intentional misuse of AI systems and the possible dangers arising out of deliberately unethical design, implementation, and use of autonomous robots.","authors":["Vicky Charisi","Louise Abigail Dennis","Robert Lieck","Andreas Matthias"],"meta":["March 2017","Projects: Ethical robotsVerifiable Autonomy"],"references":["309424933_Artificial_Intelligence_Safety_and_Cybersecurity_a_Timeline_of_AI_Failures","303859214_The_Dark_Side_of_Ethical_Robots","302893100_Unethical_Research_How_to_Create_a_Malevolent_Artificial_Intelligence","345141639_Artificial_Superintelligence_A_Futuristic_Approach","330273574_Rediscovering_Empathy_Agency_Folk_Psychology_and_the_Human_Sciences","312396855_Transparency_and_the_open_society_Practical_lessons_for_effective_policy","310330521_Engineering_Moral_Agents_--_from_Human_Morality_to_Artificial_Morality_Dagstuhl_Seminar_16222","309210344_Ensuring_Ethical_Behavior_from_Autonomous_Systems","304548505_EU_regulations_on_algorithmic_decision-making_and_a_right_to_explanation","302921145_Logic_programming_for_modeling_morality"]}