{"id":"315025785_Workspace_and_Joint_Space_Analysis_of_the_3-RPS_Parallel_Robot","abstract":"The Accurate calculation of the workspace and joint space for 3 RPS parallel robotic manipulator is a highly addressed research work across the world. Researchers have proposed a variety of methods to calculate these parameters. In the present context a cylindrical algebraic decomposition based method is proposed to model the workspace and joint space. It is a well know feature that this robot admits two operation modes. We are able to find out the set in the joint space with a constant number of solutions for the direct kinematic problem and the locus of the cusp points for the both operation mode. The characteristic surfaces are also computed to define the uniqueness domains in the workspace. A simple 3-RPS parallel with similar base and mobile platform is used to illustrate this method.\nCopyright © 2014 by ASME Country-Specific Mortality and Growth Failure in Infancy and Yound Children and Association With Material Stature\nUse interactive graphics and maps to view and sort country-specific infant and early dhildhood mortality and growth failure data and their association with maternal","authors":["Damien Charles Chablat","Ranjan Jha","Fabrice Rouillier","G. Moroz"],"meta":["August 2014","DOI:10.1115/DETC2014-34593","Conference: ASME 2014 International Design Engineering Technical Conferences and Computers and Information in Engineering Conference","Project: Workspace, Singularities, Joint space analysis for parallel robots, Hybrid sensing techniques"],"references":["238415519_An_Interval_Analysis_Based_Study_for_the_Design_and_the_Comparison_of_3DOF_Parallel_Kinematic_Machines","226282601_Transitions_between_Multiple_Solutions_of_the_Direct_Kinematic_Problem","224836724_Cusp_Points_in_the_Parameter_Space_of_Degenerate_3-RPR_Planar_ParallelManipulators","324312842_Ideals_Varieties_and_Algorithms","289364250_The_kinematics_algorithm_of_3RPS_mechanism_with_compound_sphere_joint","287265153_Design_for_optimal_performance_of_3-RPS_parallel_manipulator_using_evolutionary_algorithms","256934736_On_the_determination_of_cusp_points_of_3-RPR_parallel_manipulators","249625878_Quantifier_Elimination_for_Real_Closed_Fields_by_Cylindrical_Algebraic_Decomposition","248730639_A_study_of_manipulator_inverse_kinematic_solutions_with_application_to_trajectory_planning_and_workspace_determination","237298234_New_approach_to_orientation_workspace_analysis_of_6-DOF_parallel_manipulators"]}