{"id":"315096041_Simple_mechanical_cues_could_explain_adipose_tissue_morphology","abstract":"The mechanisms by which organs acquire their functional structure and realize its maintenance (or homeostasis) over time are still largely unknown. In this paper, we investigate this question on adipose tissue. Adipose tissue can represent 20 to 50% of the body weight. Its investigation is key to overcome a large array of metabolic disorders that heavily strike populations worldwide. Adipose tissue consists of lobular clusters of adipocytes surrounded by an organized collagen fiber network. By supplying substrates needed for adipogenesis, vasculature was believed to induce the regroupment of adipocytes near capillary extremities. This paper shows that the emergence of these structures could be explained by simple mechanical interactions between the adipocytes and the collagen fibers. Our assumption is that the fiber network resists the pressure induced by the growing adipocytes and forces them to regroup into clusters. Reciprocally, cell clusters force the fibers to merge into a well-organized network. We validate this hypothesis by means of a two-dimensional Individual Based Model (IBM) of interacting adipocytes and extra-cellular-matrix fiber elements. The model produces structures that compare quantitatively well to the experimental observations. Our model seems to indicate that cell clusters could spontaneously emerge as a result of simple mechanical interactions between cells and fibers and surprisingly, vasculature is not directly needed for these structures to emerge.","authors":["Diane Peurichard","Fanny Delebecque","Lorsignol Anne","Corinne Barreau"],"meta":["March 2017Journal of Theoretical Biology 429","DOI:10.1016/j.jtbi.2017.06.030"],"references":["277023547_Continuum_model_for_linked_fibers_with_alignment_interactions","261032354_Adipocyte_Stiffness_Increases_with_Accumulation_of_Lipid_Droplets","257410376_A_Particle_Interaction_Model_for_the_Simulation_of_Biological_Cross-Linked_Fiber_Networks_Inspired_From_flocking_Theory","236978546_The_Role_of_Paracrine_and_Autocrine_Signaling_in_the_Early_Phase_of_Adipogenic_Differentiation_of_Adipose-derived_Stem_Cells","309465328_Macroscopic_Model_for_Cross-Linked_Fibers_with_Alignment_Interactions_Existence_Theory_and_Numerical_Simulations","261015509_Stress--dependent_finite_growth_in_soft_elastic_tissues","260760749_Human_adipocyte_function_is_impacted_by_mechanical_cues","255975137_Fibrosis_and_Adipose_Tissue_Dysfunction","239944362_Adipose_Tissue_Angiogenesis_Impact_on_Obesity_and_Type-2_Diabetes","237110193_Studies_in_Linear_and_Nonlinear_Programing"]}