{"id":"315044938_Poisson_noise_removal_of_images_on_graphs_using_tight_wavelet_frames","abstract":"After many years of study, the subject of image denoising on the at domain is well developed. However, many practical problems arising from different areas, such as computer vision, computer graphics, geometric modeling and medical imaging, involve images on the irregular domain sets such as graphs. In this paper, we consider Poisson and mixed Poisson-Gaussian noise removal of images on graphs. Based on the statistical characteristic of the observed noisy images, we propose a wavelet frame based variational model to restore images on graphs. The model contains a weighted L2 fidelity term and an L1-regularized term which makes additional use of the tight wavelet frame transform on graphs in order to preserve key features such as textures and edges of images. We then apply the popular alternating direction method of multipliers (ADMM) to solve the model. Finally, we provide supporting numerical experiments on graphs and compare with other denoising methods. The results on some image denoising tasks indicate the effectiveness of our method.","authors":["Cong Wang","Jianbin Yang"],"meta":["October 2018The Visual Computer 34(10):1357-1369","DOI:10.1007/s00371-017-1418-1","Project: Fundamental Research Funds for the Central Universities (2015年江苏省普通高校学术学位研究生创新计划项目，依托中央高校基本科研业务费)"],"references":["315044609_A_wavelet_frame_approach_for_removal_of_mixed_Gaussian_and_impulse_noise_on_surfaces","286623289_A_Dirichlet_Energy_Criterion_for_Graph-Based_Image_Segmentation","282604236_Sparse_Representation_on_Graphs_by_Tight_Wavelet_Frames_and_Applications","276337736_Variational_Mesh_Denoising_Using_Total_Variation_and_Piecewise_Constant_Function_Space","275836404_Segmentation_and_Restoration_of_Images_on_Surfaces_by_Parametric_Active_Contours_with_Topology_Changes","273604200_Image_Restoration_with_Mixed_or_Unknown_Noises","292741720_The_split_Bregman_algorithm_for_L1_regularized_problems","282584241_An_analysis_of_wavelet_frame_based_scattered_data_reconstruction","281154253_A_reweighted_l2_method_for_image_restoration_with_Poisson_and_mixed_Poisson-Gaussian_noise","280851471_Polygon_Mesh_Processing"]}