{"id":"315116414_Using_Human_Brain_Activity_to_Guide_Machine_Learning","abstract":"Machine learning is a field of computer science that builds algorithms that learn. In many cases, machine learning algorithms are used to recreate a human ability like adding a caption to a photo, driving a car, or playing a game. While the human brain has long served as a source of inspiration for machine learning, little effort has been made to directly use data collected from working brains as a guide for machine learning algorithms. Here we demonstrate a new paradigm of \"neurally-weighted\" machine learning, which takes fMRI measurements of human brain activity from subjects viewing images, and infuses these data into the training process of an object recognition learning algorithm to make it more consistent with the human brain. After training, these neurally-weighted classifiers are able to classify images without requiring any additional neural data. We show that our neural-weighting approach can lead to large performance gains when used with traditional machine vision features, as well as to significant improvements with already high-performing convolutional neural network features. The effectiveness of this approach points to a path forward for a new class of hybrid machine learning algorithms which take both inspiration and direct constraints from neuronal data.","authors":["Ruth C. Fong","Walter J. Scheirer","David Charles Cox"],"meta":["March 2018Scientific Reports 8(1)","DOI:10.1038/s41598-018-23618-6"],"references":["326332457_Active_Learning_with_Statistical_Models","320968038_Deep_Learning_Human_Mind_for_Automated_Visual_Classification","319770820_Histograms_of_Oriented_Gradients_for_Human_Detection","319770416_DRAW_A_Recurrent_Neural_Network_For_Image_Generation","319770396_VLFeat_An_Open_and_Portable_Library_of_Computer_Vision_Algorithms","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","319770171_Acquiring_Visual_Classifiers_from_Human_Imagination","314405793_Active_learning_for_large_multi-class_problems","312538118_Support-vector_networks","311611265_Do_Computational_Models_Differ_Systematically_from_Human_Object_Perception"]}