{"id":"315116242_Gaussian_process_regression_for_forecasting_battery_state_of_health","abstract":"Accurately predicting the future capacity and remaining useful life of batteries is necessary to ensure reliable system operation and to minimise maintenance costs. The complex nature of battery degradation has meant that mechanistic modelling of capacity fade has thus far remained intractable; however, with the advent of cloud-connected devices, data from cells in various applications is becoming increasingly available, and the feasibility of data-driven methods for battery prognostics is increasing. Here we propose Gaussian process (GP) regression for forecasting battery state of health, and highlight various advantages of GPs over other data-driven and mechanistic approaches. GPs are a type of Bayesian non-parametric method, and hence can model complex systems whilst handling uncertainty in a principled manner. Prior information can be exploited by GPs in a variety of ways: explicit mean functions can be used if the functional form of the underlying degradation model is available, and multiple-output GPs can effectively exploit correlations between data from different cells. We demonstrate the predictive capability of GPs for short-term and long-term (remaining useful life) forecasting on a selection of capacity vs. cycle datasets from lithium-ion cells.","authors":["Robert Richardson","Michael A. Osborne","David Howey"],"meta":["March 2017Journal of Power Sources 357","DOI:10.1016/j.jpowsour.2017.05.004"],"references":["311577607_Degradation_diagnostics_for_lithium_ion_cells","271773361_Critical_review_of_on-board_capacity_estimation_techniques_for_lithium-ion_batteries_in_electric_and_hybrid_electric_vehicles","267046539_Modular_converter_system_for_low-cost_off-grid_energy_storage_using_second_life_Li-ion_batteries","303717268_Calculation_of_the_state_of_safety_SOS_for_lithium_ion_batteries","303384310_Automatic_model_construction_with_Gaussian_processes","303269133_Gaussian_Processes_for_Machine_Learning","283023461_A_novel_multistage_Support_Vector_Machine_based_approach_for_Li_ion_battery_remaining_useful_life_estimation","282477171_Battery_Health_Prognosis_for_Electric_Vehicles_Using_Sample_Entropy_and_Sparse_Bayesian_Predictive_Modeling","275466619_A_new_prognostics_method_for_state_of_health_estimation_of_lithium-ion_batteries_based_on_a_mixture_of_Gaussian_process_models_and_particle_filter","267375494_Bayesian_Gaussian_Processes_for_Sequential_Prediction_Optimisation_and_Quadrature"]}