{"id":"315328118_Digital_twin-driven_product_design_manufacturing_and_service_with_big_data","abstract":"Nowadays, along with the application of new-generation information technologies in industry and manufacturing, the big data-driven manufacturing era is coming. However, although various big data in the entire product lifecycle, including product design, manufacturing, and service, can be obtained, it can be found that the current research on product lifecycle data mainly focuses on physical products rather than virtual models. Besides, due to the lack of convergence between product physical and virtual space, the data in product lifecycle is isolated, fragmented, and stagnant, which is useless for manufacturing enterprises. These problems lead to low level of efficiency, intelligence, sustainability in product design, manufacturing, and service phases. However, physical product data, virtual product data, and connected data that tie physical and virtual product are needed to support product design, manufacturing, and service. Therefore, how to generate and use converged cyber-physical data to better serve product lifecycle, so as to drive product design, manufacturing, and service to be more efficient, smart, and sustainable, is emphasized and investigated based on our previous study on big data in product lifecycle management. In this paper, a new method for product design, manufacturing, and service driven by digital twin is proposed. The detailed application methods and frameworks of digital twin-driven product design, manufacturing, and service are investigated. Furthermore, three cases are given to illustrate the future applications of digital twin in the three phases of a product respectively.","authors":["Fei Tao","Jiangfeng Cheng","Qinglin Qi","Meng Zhang"],"meta":["February 2018The International Journal of Advanced Manufacturing Technology 94(4)","DOI:10.1007/s00170-017-0233-1","Project: NSFC: Service-oriented manufacturing"],"references":["315965400_Digital_twin_workshop_a_new_paradigm_for_future_workshop","313686847_A_Cooperative_Co-Evolutionary_Algorithm_for_Large-Scale_Process_Planning_With_Energy_Consideration","308569332_A_Simulation-Based_Architecture_for_Smart_Cyber-Physical_Systems","321523458_Product_Lifecycle_Management_Volume_2","315125088_Product_Lifecycle_Management","314595829_Computationally_Efficient_Analysis_of_SMA_Sensory_Particles_Embedded_in_Complex_Aerostructures_Using_a_Substructure_Approach","307860371_SDMSim_A_manufacturing_service_supply-demand_matching_simulator_under_cloud_environment","305167612_Big-data-driven_operational_analysis_and_decision-making_methodology_in_intelligent_workshop","303900830_Digital_Twin-The_Simulation_Aspect","303692030_A_hybrid_group_leader_algorithm_for_green_material_selection_with_energy_consideration_in_product_design","287431426_On_the_Effects_of_Modeling_As-Manufactured_Geometry_Toward_Digital_Twin","276457481_Big_Data_in_product_lifecycle_management","275211047_Digital_Twin_Manufacturing_Excellence_through_Virtual_Factory_Replication","270742269_Internet_of_Things_in_Industries_A_Survey","284254869_Pricing_Policies_for_New_Products"]}