{"id":"315301387_From_LTE_to_5G_for_Connected_Mobility","abstract":"Long Term Evolution, the fourth generation of mobile communication technology, has been commercially deployed for about five years. Even though it is continuously updated through new releases, and with LTE Advanced Pro Release 13 being the latest one, the development of the fifth generation has been initiated. In this article, we measure how current LTE network implementations perform in comparison with the initial LTE requirements. The target is to identify certain key performance indicators that have suboptimal implementations and therefore lend themselves to careful consideration when designing and standardizing next generation wireless technology. Specifically, we analyze user and control plane latency, handover execution time, and coverage, which are critical parameters for connected mobility use cases such as road vehicle safety and efficiency. We study the latency, handover execution time, and coverage of four operational LTE networks based on 19,000 km of drive tests covering a mixture of rural, suburban, and urban environments. The measurements have been collected using commercial radio network scanners and measurement smartphones. Even though LTE has low air interface delays, the measurements reveal that core network delays compromise the overall round-trip time design requirement. LTE's breakbefore- make handover implementation causes a data interruption at each handover of 40 ms at the median level. While this is in compliance with the LTE requirements, and lower values are certainly possible, it is also clear that break-before-make will not be sufficient for connected mobility use cases such as road vehicle safety. Furthermore, the measurements reveal that LTE can provide coverage for 99 percent of the outdoor and road users, but the LTE-M or NarrowBand-IoT upgrades, as of LTE Release 13, are required in combination with other measures to allow for additional penetration losses, such as those experienced in underground parking lots. Based on the observed discrepancies between measured and standardized LTE performance, in terms of latency, handover execution time, and coverage, we conclude the article with a discussion of techniques that need careful consideration for connected mobility in fifth generation mobile communication technology.","authors":["Mads Lauridsen","Lucas Chavarria Gimenez","Ignacio Rodriguez Larrad","Troels B. Sorensen"],"meta":["March 2017IEEE Communications Magazine 55(3):156-162","DOI:10.1109/MCOM.2017.1600778CM"],"references":["316104208_Achieving_low-latency_communication_in_future_wireless_networks_the_5G_NORMA_approach","260654677_Looking_at_LTE_in_Practice_A_Performance_Analysis_of_the_LTE_System_Based_on_Field_Test_Results","245022279_A_comparison_between_one-way_delays_in_operating_HSPA_and_LTE_networks","315472921_A_Simple_Statistical_Signal_Loss_Model_for_Deep_Underground_Garage","315472110_Coverage_and_Capacity_Analysis_of_LTE-M_and_NB-IoT_in_a_Rural_Area","308397599_LTE_for_UMTS_Evolution_to_LTE-Advanced_Second_Edition","300413452_Signal_Quality_Outage_Analysis_for_Ultra-Reliable_Communications_in_Cellular_Networks"]}