{"id":"315348744_Three-dimensional_DEM_investigation_of_critical_state_and_dilatancy_behaviors_of_granular_materials","abstract":"The critical state is significant to the mechanical behaviors of granular materials and the foundation of the constitutive relations. Using the discrete element method (DEM), the mechanical behaviors of granular materials can be investigated on both the macroscopic and microscopic levels. A series of DEM simulations under true triaxial conditions have been performed to explore the critical state and dilatancy behavior of granular materials, which show the qualitatively similar macroscopic responses as the experimental results. The critical void ratio and stress ratio under different stress paths are presented. A unique critical state line (CSL) is shown to indicate that the intermediate principal stress ratio does not influence the CSL. Within the framework of the unique critical state, the stress–dilatancy relation of DEM simulations is found to fulfill the state-dependent dilatancy equations. As a microscopic parameter to evaluate the static determinacy of the granular system, the redundancy ratio is defined and investigated. The results show that the critical state is very close to the statically determinate state. Other particle-level indexes, including the distribution of the contact forces and the anisotropies, are carefully investigated to analyze the microstructural evolution and the underlying mechanism. The microscopic analysis shows that both the contact orientations and contact forces influence the mechanical behaviors of granular materials.","authors":["Wei Zhou","Jiaying Liu","Gang Ma","Xiaolin Chang"],"meta":["June 2017Acta Geotechnica 12(3):527-540","DOI:10.1007/s11440-017-0530-8"],"references":["302484501_Onset_of_structural_evolution_in_granular_materials_as_a_redundancy_problem","302483803_Macroscopic_and_microscopic_behaviors_of_granular_materials_under_proportional_strain_path_a_DEM_study_Macro-_and_Microscopic_Behaviors_under_Proportional_Strain_Path","298905632_Critical_state_behaviors_of_a_coarse_granular_soil_under_generalized_stress_conditions","295198775_A_hybrid_approach_for_modeling_of_breakable_granular_materials_using_combined_finite-discrete_element_method","343347960_Mechanics_of_Granular_Materials_An_Introduction","325146168_State-dependent_dilatancy_in_critical-state_constitutive_modelling_of_sand","283907553_DEM_investigation_on_the_effect_of_sample_preparation_on_the_shear_behavior_of_granular_soil","283697200_Finite_strain_elastoplasticity_considering_the_Eshelby_stress_for_materials_undergoing_plastic_volume_change","281017907_Macro-micro_responses_of_crushable_granular_materials_in_simulated_true_triaxial_tests","280765586_LIGGGHTS-open_source_discrete_element_simulations_of_granular_materials_based_on_LAMMPS"]}