{"id":"315382092_Implicit_Regularization_for_Reconstructing_3D_Building_Rooftop_Models_Using_Airborne_LiDAR_Data","abstract":"With rapid urbanization, highly accurate and semantically rich virtualization of building\nassets in 3D become more critical for supporting various applications, including urban planning,\nemergency response and location-based services. Many research efforts have been conducted\nto automatically reconstruct building models at city-scale from remotely sensed data. However,\ndeveloping a fully-automated photogrammetric computer vision system enabling the massive\ngeneration of highly accurate building models still remains a challenging task. One the most\nchallenging task for 3D building model reconstruction is to regularize the noises introduced in\nthe boundary of building object retrieved from a raw data with lack of knowledge on its true shape.\nThis paper proposes a data-driven modeling approach to reconstruct 3D rooftop models at city-scale\nfrom airborne laser scanning (ALS) data. The focus of the proposed method is to implicitly derive the\nshape regularity of 3D building rooftops from given noisy information of building boundary in a\nprogressive manner. This study covers a full chain of 3D building modeling from low level processing\nto realistic 3D building rooftop modeling. In the element clustering step, building-labeled point\nclouds are clustered into homogeneous groups by applying height similarity and plane similarity.\nBased on segmented clusters, linear modeling cues including outer boundaries, intersection lines,\nand step lines are extracted. Topology elements among the modeling cues are recovered by the\nBinary Space Partitioning (BSP) technique. The regularity of the building rooftop model is achieved\nby an implicit regularization process in the framework of Minimum Description Length (MDL)\ncombined with Hypothesize and Test (HAT). The parameters governing the MDL optimization are\nautomatically estimated based on Min-Max optimization and Entropy-based weighting method. The\nperformance of the proposed method is tested over the International Society for Photogrammetry\nand Remote Sensing (ISPRS) benchmark datasets. The results show that the proposed method can\nrobustly produce accurate regularized 3D building rooftop models.","authors":["Jaewook Jung","Yoonseok Jwa","Gunho Sohn"],"meta":["March 2017Sensors 17(621)","DOI:10.3390/s17030621"],"references":["314751936_Sub-Surface_Growing_and_Boundary_Generalization_for_3D_Building_Reconstruction","313618366_A_survey_of_urban_reconstruction","307531598_REVISITING_INTRINSIC_CURVES_FOR_EFFICIENT_DENSE_STEREO_MATCHING","283459878_Automatic_powerline_scene_classification_and_reconstruction_using_airborne_LiDAR_data","276022056_Primitive-based_building_reconstruction_by_integration_of_LiDAR_data_and_optical_imagery","276019990_An_automated_method_for_3d_roof_outline_generation_and_regularization_in_airborne_laser_scanner_data","274677252_An_implicit_regularization_for_3D_building_rooftop_modelling_using_airbourne_LIDAR_data","274309937_Building_Extraction_from_Airborne_Laser_Scanning_Data_An_Analysis_of_the_State_of_the_Art","303134320_Algorithms_for_the_reduction_of_the_number_of_points_required_to_represent_a_digitized_line_or_its_caricature","279833479_Automatic_Recognition_and_3D_Reconstruction_of_Buildings_through_Computer_Vision_and_Digital_Photogrammetry","262454332_Cycle_graph_analysis_for_3D_roof_structure_modelling_Concepts_and_performance","263599628_3D_building_modeling_using_images_and_LiDAR_a_review","262841757_A_global_optimization_approach_to_roof_segmentation_from_airborne_lidar_point_clouds","261599703_Context-based_automatic_reconstruction_and_texturing_of_3D_urban_terrain_for_quick-response_tasks","261336869_25D_Building_Modeling_by_Discovering_Global_Regularities"]}