{"id":"315327887_Geometric_Refinement_of_ALS-Data_Derived_Building_Models_Using_Monoscopic_Aerial_Images","abstract":"Airborne laser scanning (ALS) has proven to be a strong basis for 3D building reconstruction. While ALS data allows for a highly automated processing workflow, a major drawback is often in the point spacing. As a consequence, the precision of roof plane and ridge line parameters is usually significantly better than the precision of gutter lines. To cope with this problem, the paper presents an approach for geometric refinement of building models reconstructed from ALS data using monoscopic aerial images. The core idea of the proposed modeling method is to obtain refined roof edges by intersecting roof planes accurately and reliably extracted from 3D point clouds with viewing planes assigned with building edges detected in a high resolution aerial image. In order to minimize ambiguities that may arise during the integration of modeling cues, the ALS data is used as the master providing initial information about building shape and topology. We evaluate the performance of our algorithm by comparing the results of 3D reconstruction executed using only laser scanning data and reconstruction enhanced by image information. The assessment performed within a framework of the International Society for Photogrammetry and Remote Sensing (ISPRS) benchmark shows an increase in the final quality indicator up to 8.7%.","authors":["Małgorzata Jarząbek-Rychard","Hans-Gerd Maas"],"meta":["March 2017Remote Sensing 9(3):282","DOI:10.3390/rs9030282"],"references":["307786223_SEQUENTIAL_MODELLING_OF_BUILDING_ROOFTOPS_BY_INTEGRATING_AIRBORNE_LIDAR_DATA_AND_OPTICAL_IMAGERY_PRELIMINARY_RESULTS","274677147_Automated_modeling_of_3d_building_roofs_using_image_and_LIDAR_data","274656418_3D_Building_Roof_Modeling_by_Optimizing_Primitive's_Parameters_Using_Constraints_from_LiDAR_Data_and_Aerial_Imagery","266458698_Model-based_automatic_3D_building_model_generation_by_integrating_LiDAR_and_aerial_images","260248503_Fitting_of_parametric_building_models_to_oblique_aerial_images","301717904_3D_building_reconstruction_from_ALS_data_using_unambiguous_decomposition_into_elementary_structures","292739269_The_DGPF-test_on_digital_airborne_camera_evaluation-overview_and_test_design","271538853_Flexible_building_primitives_for_3D_building_modeling","270558846_Fusion_of_Lidar_and_Imagery_for_Reliable_Building_Extraction","261599703_Context-based_automatic_reconstruction_and_texturing_of_3D_urban_terrain_for_quick-response_tasks"]}