{"id":"315318856_Cyber_physical_systems_for_predictive_production_systems","abstract":"As disruptive technologies like Industry 4.0 and Internet of Things advance at a breakneck speed, modern manufacturing is ready to embrace the systematic deployment of predictive production systems. The predictive production system is an intelligent manufacturing system where networked assets are equipped with self-awareness to predict, root cause, and reconfigure faulty events automatically. Cyber physical systems are one of the core enabling technologies within which information from all the related perspectives are analyzed and interconnected between physical factory floor and the cyber computational space. It intertwines with smart analytics to comprehend invisible issues for rapid decision making. In this paper, a systematic approach is proposed on how cyber physical systems can be applied to predictive production systems to inject resilience and interoperability so that the productivity of manufacturing can be optimized.","authors":["Jay Lee","Chao Jin","Behrad Bagheri"],"meta":["March 2017Production Engineering 11(1)","DOI:10.1007/s11740-017-0729-4","Project: Cybermanufacturing: fleet-sourced cyber manufacturing applications for improved transparency and resilience of manufacturing assets and systems"],"references":["284691383_A_comprehensive_framework_of_factory-to-factory_dynamic_fleet-level_prognostics_and_operation_management_for_geographically_distributed_assets","277940337_A_Unified_Framework_and_Platform_for_Designing_of_Cloud-Based_Machine_Health_Monitoring_and_Manufacturing_Systems","277918242_A_Cyber_Physical_Interface_for_Automation_Systems-Methodology_and_Examples","276937205_Decision_support_systems_for_effective_maintenance_operations","276145281_Smart_Factory_Systems","269709304_A_Cyber-Physical_Systems_architecture_for_Industry_40-based_manufacturing_systems","262880066_Recent_advances_and_trends_in_predictive_manufacturing_systems_in_big_data_environment","318494191_RESTful_Web_Services","284034181_Cyber-physical_systems","282627430_Robust_Cyber-Physical_Systems_Concept_models_and_implementation"]}