{"id":"315369547_Use_of_a_Novel_Artificial_Intelligence_Platform_on_Mobile_Devices_to_Assess_Dosing_Compliance_in_a_Phase_2_Clinical_Trial_in_Subjects_With_Schizophrenia","abstract":"Background\nAccurately monitoring and collecting drug adherence data can allow for better understanding and interpretation of the outcomes of clinical trials. Most clinical trials use a combination of pill counts and self-reported data to measure drug adherence, despite the drawbacks of relying on these types of indirect measures. It is assumed that doses are taken, but the exact timing of these events is often incomplete and imprecise.\n\nObjective\nThe objective of this pilot study was to evaluate the use of a novel artificial intelligence (AI) platform (AiCure) on mobile devices for measuring medication adherence, compared with modified directly observed therapy (mDOT) in a substudy of a Phase 2 trial of the α7 nicotinic receptor agonist (ABT-126) in subjects with schizophrenia.\n\nMethods\nAI platform generated adherence measures were compared with adherence inferred from drug concentration measurements.\n\nResults\nThe mean cumulative pharmacokinetic adherence over 24 weeks was 89.7% (standard deviation [SD] 24.92) for subjects receiving ABT-126 who were monitored using the AI platform, compared with 71.9% (SD 39.81) for subjects receiving ABT-126 who were monitored by mDOT. The difference was 17.9% (95% CI -2 to 37.7; P=.08).\n\nConclusions\nUsing drug levels, this substudy demonstrates the potential of AI platforms to increase adherence, rapidly detect nonadherence, and predict future nonadherence. Subjects monitored using the AI platform demonstrated a percentage change in adherence of 25% over the mDOT group. Subjects were able to use the technology successfully for up to 6 months in an ambulatory setting with early termination rates that are comparable to subjects outside of the substudy.\n\nTrial Registration\nClinicalTrials.gov NCT01655680 https://clinicaltrials.gov/ct2/show/NCT01655680?term=NCT01655680","authors":["Earle E Bain","Laura Shafner","David Walling","Ahmed A Othman"],"meta":["February 2017JMIR mhealth and uhealth 5(2):e18","DOI:10.2196/mhealth.7030"],"references":["285749184_Mitigating_the_Effects_of_Nonadherence_in_Clinical_Trials","282038599_Effectiveness_of_Electronic_Reminders_to_Improve_Medication_Adherence_in_Tuberculosis_Patients_A_Cluster-Randomised_Trial","272074713_Tenofovir-Based_Preexposure_Prophylaxis_for_HIV_Infection_Among_African_Women","307886790_Pharmacology_supports_on-demand_PrEP","284671060_Patient_compliance_as_an_explanatory_variable_in_four_selected_cardiovascular_studies","283466122_Do_you_want_chips_with_that","280868993_Medication_Nonadherence_Professional_Subjects_and_Apparent_Placebo_Responders_Overlapping_Challenges_for_Medications_Development","279904212_Compliance_assessment_in_clinical_trials_The_MEMS_device","271237608_A_Comparison_Study_of_Multiple_Measures_of_Adherence_to_HIV_Protease_Inhibitors","266026794_Electronic_Medication_Packaging_Devices_and_Medication_Adherence_A_Systematic_Review"]}