{"id":"315319115_The_implications_of_the_new_sulphur_limits_on_the_European_Ro-Ro_sector","abstract":"In an effort to reduce the environmental impacts of maritime transportation, the International Maritime Organization (IMO) designated special Sulphur Emission Control Areas (SECAs) where ships are required to use low-sulphur fuel. In January 2015, the sulphur limit within SECAs was lowered to 0.1%, which can only be achieved if vessels are using pricier ultra-low sulphur fuel, or invest in abatement technologies. The increased operating costs borne by Ro-Ro operators in SECAs due to the stricter limits can result in the shutting down of some routes and a redistribution of cargo flows with land-based alternatives. The exact repercussions of the new sulphur limits are difficult to identify in the wake of significant recent reductions of the fuel prices for both low-sulphur and heavy fuel oil. This paper presents a modal split model that estimates modal shifts vis-a-vis competing maritime and land-based modes available to shippers. This allows examining the implications of the recent low prices to modal choice, and the influence a potential increase in fuel prices may have. The model is applied to seven routes affected by the regulation based on data from a leading European Ro-Ro operator. Sensitivity analyses on market share data, cargo values, freight rates, and haulers rates are conducted. Emissions inventories are constructed to assess the environmental efficacy of the SECA regulation. The novelty of the proposed model lies in the examination of the ex-post implications of shutting down a service and the redistribution of transport. Recommendations to mitigate and reverse the negative side-effects of such environmental legislation are proposed.","authors":["Thalis Zis","Harilaos N Psaraftis"],"meta":["May 2017Transportation Research Part D Transport and Environment 52:185-201","DOI:10.1016/j.trd.2017.03.010","Project: RoRo SECA"],"references":["305820948_Payback_Period_for_Emissions_Abatement_Alternatives_Role_of_Regulation_and_Fuel_Prices","282484510_Environmental_Balance_of_Shipping_Emissions_Reduction_Strategies","255890936_Second_IMO_Greenhouse_Gas_Study_2009","329933867_Modelling_transport","322297291_Short_sea_shipping_in_Europe_Issues_policies_and_challenges","292019739_Greenhouse_gas_emissions","282176923_On_two_speed_optimization_problems_for_ships_that_sail_in_and_out_of_emission_control_areas","260013683_The_costs_and_benefits_of_sulphur_reduction_measures_Sulphur_scrubbers_versus_marine_gas_oil","260010697_The_possible_designation_of_the_Mediterranean_Sea_as_a_SECA_A_case_study","259784570_Emission_control_areas_and_their_impact_on_maritime_transport"]}