{"id":"315381994_Continuous_Integration_Delivery_and_Deployment_A_Systematic_Review_on_Approaches_Tools_Challenges_and_Practices","abstract":"Context: Continuous practices, i.e., continuous integration, delivery, and deployment, are the software development industry practices that enable organizations to frequently and reliably release new features and products. With the increasing interest in and literature on continuous practices, it is important to systematically review and synthesize the approaches, tools, challenges, and practices reported for adopting and implementing continuous practices. Objective: This research aimed at systematically reviewing the state of the art of continuous practices to classify approaches and tools, identify challenges and practices in this regard, and identify the gaps for future research. Method: We used systematic literature review (SLR) method for reviewing the peer-reviewed papers on continuous practices published between 2004 and 1st June 2016. We applied thematic analysis method for analysing the data extracted from reviewing 69 papers selected using predefined criteria. Results: We have identified thirty approaches and associated tools, which facilitate the implementation of continuous practices in the following ways: (1) \"reducing build and test time in continuous integration (CI)\"; (2) \"increasing visibility and awareness on build and test results in CI\"; (3) \"supporting (semi-) automated continuous testing\"; (4) \"detecting violations, flaws and faults in CI\"; (5) \"addressing security and scalability issues in deployment pipeline\", and (6) \"improving dependability and reliability of deployment process\". We have also determined a list of critical factors such as \"testing (effort and time)\", \"team awareness and transparency\", \"good design principles\", \"customer\", \"highly skilled and motivated team\", \"application domain\", and \"appropriate infrastructure\" that should be carefully considered when introducing continuous practices in a given organization.","authors":["Mojtaba Shahin","Muhammad Ali Babar","Liming Zhu"],"meta":["March 2017IEEE Access PP(99)","DOI:10.1109/ACCESS.2017.2685629"],"references":["309010718_Problems_Causes_and_Solutions_When_Adopting_Continuous_Delivery-A_Systematic_Literature_Review","308824382_Securing_a_Deployment_Pipeline","303994629_A_Systematic_Review_of_Knowledge_Sharing_Challenges_and_Practices_in_Global_Software_Development","303847552_Challenges_and_Success_Factors_for_Large-Scale_Agile_Transformations_A_Systematic_Literature_Review","303131534_Climbing_the_stairway_to_heaven_-_A_mulitiple-case_study_exploring_barriers_in_the_transition_from_agile_development_towards_continuous_deployment_of_software","302924724_Guidelines_for_performing_Systematic_Literature_Reviews_in_Software_Engineering","312949814_Modern_release_engineering_in_a_nutshell_why_researchers_should_care","308811242_Continuous_Delivery_with_Jenkins_Jenkins_Solutions_to_Implement_Continuous_Delivery","308631259_Supporting_Continuous_Integration_by_Code-Churn_Based_Test_Selection","303480810_Modern_Release_Engineering_in_a_Nutshell_--_Why_Researchers_Should_Care"]}