{"id":"315493700_Coleta_de_Dados_em_Redes_Sociais_privacidade_de_dados_pessoais_no_acesso_via_Application_Programming_Interface","abstract":"The development of social networks is a topic of study for several areas, and with the increased use of the Internet in professional and leisure activities, online social networks have emerged: services with the goal of providing an interface between individuals. Some of these networks have millions of users, who agree and give their consente to the Terms of Use. The Terms of Use of these services contain the delimitation of the processes of data collection by external agents, creating a cascading effect of user identification and can enhance activities which are detrimental to user privacy. This study looks to verify if the systematic data collection processes for documents which contain characteristics of the Application Programming Interfaces (APIs) data collection and the Terms of Use can help in identifying activities potentially harmful to user privacy (referenced) and reveal prerequisites of knowledge about the technology involved in this process, concepts prior to identifying characteristics and professional areas involved in understanding the technology of the API and the Terms of Use. The objective is to propose an analysis based data model on personal privacy data issues, from the identification of the characteristics of the collection of data from the referenced API to assisting in identifying potential actions and activities which are detrimental to privacy obtained through the data collection process. The research universe is limited to the services available on the Internet that use APIs as interoperability interfaces of their content and the sample was defined in three APIs: from Facebook, Twitter and LinkedIn. The methodology adopted was exploratory analysis, in qualitative form, with combined methods based on the exploitation of the technical characteristics of APIs and the reading of available documents, being segmented by the perspectives: professional areas involved, collection technology and knowledge prerequisites. To conduct this study, three cycles are proposed: first, with the identification of the characteristics of the structure of data collection and the functionalities presented by the APIs; second, propose a model of the data from the collection of the characteristics of existing structures (Direct Model); and third, a model of Second Order, with specific information about referenced data privacy for the analysis of data privacy aspects to share with third parties. In the end, present a list of criteria for the monitoring and evaluation of the information of referenced documents and the Terms of Use of social networks, as a way of identifying possible relationships between the absence of data. In the considerations, we maintain the idea that this environment is complex and obfuscated to those referenced, but the data model and the instruments developed can help to minimize the complexity of referenced documents about the interoperability of datasets to external agents and understanding the Terms of Use.\n\nO desenvolvimento das redes sociais é tema de estudos de várias áreas do conhecimento, e com o aumento do uso da Internet em atividades profissionais e de entretenimento, surgiram as redes sociais online: serviços com o intuito de proporcionar uma interface de relacionamento entre indivíduos. Algumas destas redes possuem milhões de usuários, que consentiram acordo aos Termos de Uso. Os Termos de Uso destes serviços contém a delimitação dos processos de coleta de dados por agentes externos, criando um efeito em cascata de identificação do usuário, e pode potencializar atividades prejudiciais à privacidade. O estudo procura verificar se processos sistematizados de coleta de dados sobre documentos que contém características das interfaces de coleta das Application Programming Interfaces (APIs), e os Termos de Uso podem auxiliar a identificação de atividades potencialmente prejudiciais à privacidade dos usuários (referenciados) e revelar pré-requisitos de conhecimentos sobre as tecnologias envolvidas neste processo, conceitos prévios à identificação das características, e áreas profissionais envolvidas no entendimento das informações sobre tecnologias voltadas às APIs e condições dos Termos de Uso. O objetivo é propor um modelo de dados orientado a análise sobre questões de privacidade de dados pessoais, a partir da identificação das características da coleta de dados de referenciados via API, para auxiliar na identificação de potenciais ações e atividades prejudiciais à privacidade, realizadas na coleta de dados. O universo de pesquisa está delimitado aos serviços disponíveis na Internet que utilizam APIs como interfaces de interoperabilidade de seus conteúdos, e a amostra foi definida em três APIs: do Facebook, do Twitter e do LinkedIn. A metodologia adotada é a análise exploratória, de caráter qualitativo, com métodos combinados a partir da exploração das características técnicas das APIs e da leitura dos documentos disponíveis, sendo segmentada pelas perspectivas: Áreas Profissionais envolvidas, Tecnologias de Coleta e Pré-requisitos de Conhecimento. Para realização, propõe-se três ciclos: o primeiro, com a identificação das características das estruturas de coletas de dados e das funcionalidades apresentadas pelas APIs; o segundo ciclo propõe uma modelagem de dados, a partir da coleta das características das estruturas existentes (Modelagem Direta), e; o terceiro ciclo, uma Modelagem de Segunda Ordem, com informações específicas sobre a privacidade de dados de referenciados para a análise de aspectos de privacidade de dados compartilhados a terceiros. Ao final, apresenta uma lista de critérios para o acompanhamento e a avaliação das informações dos documentos de referência e Termos de Uso das redes sociais, como forma de identificar possíveis relações entre a ausência de dados. Nas considerações, sustentamos que este ambiente é complexo e ofuscado aos referenciados, porém o modelo de dados e os instrumentos elaborados podem auxiliar a minimizar a complexidade dos documentos de referência sobre a interoperabilidade de conjuntos de dados a agentes externos e no entendimento dos Termos de Uso.\n\nEl desarrollo de las redes sociales es tema de estudio de varias áreas del conocimiento, y con el aumento del uso de la Internet en actividades profesionales y de entretenimiento, surgieron las redes sociales en línea: servicios con el fin de proporcionar una interface de relacionamiento entre individuos. Algunas de estas redes poseen millones de usuarios, los cuales dieron su consentimiento al acuerdo de los Términos de Uso. Los Términos de estos servicios engloban la delimitación de los procesos de colecta de datos por agentes externos, creando un efecto en cascada de identificación del usuario, y puede potencializar actividades perjudiciales para la privacidad. El estudio pretende verificar si procesos sistematizados de colecta de datos sobre documentos que contienen características de las interfaces de colecta de las Application Programming Interfaces (APIs), y los Términos de Uso, pueden auxiliar en la identificación de actividades potencialmente perjudiciales para la privacidad de los usuarios (referenciados) y revelar prerrequisitos de conocimientos sobre las tecnologías involucradas en este proceso, conceptos previos a la identificación de las características, y áreas profesionales que participan en el entendimiento de las informaciones sobre tecnologías direccionadas a las APIs y condiciones de los Términos e Uso. El objetivo es proponer un modelo de datos orientado al análisis sobre cuestiones de privacidad de datos personales, a partir de la identificación de las características de la colecta de datos referenciados vía API, para auxiliar en la identificación de potenciales acciones y actividades perjudiciales para la privacidad, realizadas en la colecta de datos. El universo de pesquisa está delimitado a los servicios disponibles en la Internet que utilizan APIs como interfaces de interoperabilidad de sus contenidos, y la muestra fue definida en tres APIs: de Facebook, de Twitter y de LinkedIn. La metodología adoptada es un análisis exploratorio, de carácter cualitativo, con métodos combinados a partir de la exploración de las características técnicas de las APIs y de la lectura de los documentos disponibles, siendo segmentada por las perspectivas: Áreas Profesionales involucradas, Tecnologías de Colecta y Prerrequisitos de Conocimiento. Para la realización, se proponen tres ciclos: i. con la identificación de las características de las estructuras de colectas de datos y de las funcionalidades presentadas por las APIs; ii. ciclo, propone un modelaje de datos, a partir de la colecta de las características de las estructuras existentes (Modelaje Directo), y; iii. ciclo, un Modelaje de Segundo Orden, con informaciones específicas sobre la privacidad de los datos de referenciados para el análisis de aspectos de privacidad de datos compartidos con terceros. Finalmente, presenta una lista de criterios para el acompañamiento y la evaluación de las informaciones de los documentos de referencia y Términos de Uso de las redes sociales, como forma de identificar posibles relaciones entre la ausencia de datos. En las consideraciones, sustentamos que este ambiente es complejo y confuso para los referenciados, no obstante el modelo de datos y los instrumentos elaborados pueden contribuir a minimizar la complejidad de los documentos de referencia sobre la interoperabilidad de conjuntos de datos a agentes externos y en el entendimiento de los Términos de Uso.","authors":["Fernando de Assis Rodrigues"],"meta":["March 2017","Thesis for: PhDAdvisor: Ricardo César Gonçalves Sant'Ana","Project: Collection of data from social networks: privacy of personal data through access of the Application Programming Interface"],"references":[]}