{"id":"315454705_Discovering_Relaxed_Sound_Workflow_Nets_using_Integer_Linear_Programming","abstract":"Process mining is concerned with the analysis, understanding and improvement of business processes. Process discovery, i.e. discovering a process model based on an event log, is considered the most challenging process mining task. State-of-the-art process discovery algorithms only discover local control-flow patterns and are unable to discover complex, non-local patterns. Region theory based techniques, i.e. an established class of process discovery techniques, do allow for discovering such patterns. However, applying region theory directly results in complex, over-fitting models, which is less desirable. Moreover, region theory does not cope with guarantees provided by state-of-the-art process discovery algorithms, both w.r.t. structural and behavioural properties of the discovered process models. In this paper we present an ILP-based process discovery approach, based on region theory, that guarantees to discover relaxed sound workflow nets. Moreover, we devise a filtering algorithm, based on the internal working of the ILP-formulation, that is able to cope with the presence of infrequent behaviour. We have extensively evaluated the technique using different event logs with different levels of exceptional behaviour. Our experiments show that the presented approach allow us to leverage the inherent shortcomings of existing region-based approaches. The techniques presented are implemented and readily available in the HybridILPMiner package in the open-source process mining tool-kits ProM and RapidProM.","authors":["Sebastiaan van Zelst","B. F. van Dongen","Wil Van der Aalst","H. M. W. Verbeek"],"meta":["May 2018Computing 100(4)","DOI:10.1007/s00607-017-0582-5"],"references":["344474026_Process_Discovery_using_Integer_Linear_Programming","314837918_RapidProM_Mine_Your_Processes_and_Not_Just_Your_Data","311819456_Sepsis_Cases_-_Event_Log","309081021_Filtering_out_Infrequent_Behavior_from_Process_Event_Logs","333864868_Synthesis_of_Petri_nets_from_finite_partial_languages","321517339_Texts_in_Theoretical_Computer_Science_An_EATCS_Series","319359358_Wiley-Interscience_Series_in_Discrete_Mathematics_and_Optimization","312596129_Process_Mining_Data_Science_in_Action","311366619_A_genetic_algorithm_for_discovering_process_trees","310825099_Conformance_Checking_and_Diagnosis_in_Process_Mining"]}