{"id":"315454960_Towards_a_Quantum_World_Wide_Web","abstract":"We elaborate a quantum model for corpora of written documents, like the pages forming the World Wide Web. To that end, we are guided by how physicists constructed quantum theory for microscopic entities, which unlike classical objects cannot be fully represented in our spatial theater. We suggest that a similar construction needs to be carried out by linguists and computational scientists, to capture the full meaning content of collections of documental entities. More precisely, we show how to associate a quantum-like 'entity of meaning' to a 'language entity formed by printed documents', considering the latter as the collection of traces that are left by the former, in specific results of search actions that we describe as measurements. In other words, we offer a perspective where a collection of documents, like the Web, is described as the space of manifestation of a more complex entity - the QWeb - which is the object of our modeling, drawing its inspiration from previous studies on operational-realistic approaches to quantum physics and quantum modeling of human cognition and decision-making. We emphasize that a consistent QWeb model needs to account for the observed correlations between words appearing in printed documents, e.g., co-occurrences, as the latter would depend on the 'meaning connections' existing between the concepts that are associated with these words. In that respect, we show that both 'context and interference (quantum) effects' are required to explain the probabilities calculated by counting the relative number of documents containing certain words and co-ocurrrences of words.","authors":["Diederik Aerts","Jonito Aerts Arguelles","Lester Beltran","Lyneth Beltran"],"meta":["March 2017Theoretical Computer Science 752","DOI:10.1016/j.tcs.2018.03.019","Project: Identifying quantum structures in cognition and decision-making under uncertainty"],"references":["313022555_Testing_Quantum_Models_of_Conjunction_Fallacy_on_the_World_Wide_Web","271855660_Open_System_Categorical_Quantum_Semantics_in_Natural_Language_Processing","270515274_Do_Spins_Have_Directions","262520396_The_quantum_mechanics_and_conceptuality_matter_histories_semantics_and_space-time","260910548_Quantum_Theory_and_Human_Perception_of_the_Macro-World","315740289_The_Information_Retrieval_Series","303802749_Indexing_by_Latent_Semantic_Analysis","301983811_Semantic_Composition_Inspired_by_Quantum_Measurement","288890386_On_the_Foundations_of_the_Brussels_Operational-Realistic_Approach_to_Cognition","285942923_Quantum_Models_of_Cognition_and_Decision"]}