{"id":"315493976_Accurate_and_efficient_SPH_open_boundary_conditions_for_real_3-D_engineering_problems","abstract":"The treatment of open boundary conditions in SPH is an active area of study among SPH researchers and falls within one of the four SPHERIC Grand Challenges. The work of several authors in the literature provides a number of choices to model open boundaries in both WCSPH and ISPH [1–4]. A recent work by Tafuni et al. [5] shows a preliminary CPU implementation of an open boundary formulation based on the use of buffer layers adjacent to the fluid domain. Buffer particles are used to enforce certain conditions in presence of fluid inlets and outlets. Particularly, the physical information of buffer particles is either assigned a priori or extrapolated from the fluid domain using a first order consistent procedure. This algorithm is implemented in the open-source SPH parallel code DualSPHysics. In this work, several new aspects are added to the original formulation in [5] with the aim of extending its use to real-life engineering applications. The new algorithm allows to simulate a variety of flow conditions, including variable depth, velocity profiles, and pressure profiles. Moreover, the code is capable of simulating multiple inlets and outlets in a single simulation and a GPU version has been devised to simulate large-scale 3-D problems. Finally, the structure of the buffer areas facilitates the treatment of backflow: when particles in an outflow buffer reverse their motion towards the domain interior they are converted to fluid particles, while the buffer is filled with new outflow particles. Thus the buffer area is now capable of dual inlet/outlet behavior. Several 3-D test cases are presented to corroborate the effectiveness and efficiency of the newly implemented algorithm for simulations of real engineering problems. Among these, the results from a study case of a NASA submarine designed to navigate the liquid hydrocarbon seas of Saturn's largest moon, Titan, are shown for a range of operating conditions, including ascending, surfacing, and descending phases. Figure 1 – (a) Free-surface elevation for the Phase 1 submarine at Fr = 0.53 and (b) Cross-sectional plots of waterline at midship and stern.","authors":["Angelo Tafuni","José M. Domínguez","Renato Vacondio","Alejandro J. C. Crespo"],"meta":["June 2017","Conference: 12th International SPHERIC WorkshopAt: Ourense, Spain","Project: Smoothed Particle Hydrodynamics"],"references":["303466851_Open_boundary_conditions_for_large-scale_SPH_simulations","292679552_SPH-DCDEM_model_for_arbitrary_geometries_in_free_surface_solid-fluid_flows","260973424_Incompressible_smoothed_particle_hydrodynamics_SPH_with_reduced_temporal_noise_and_generalised_Fickian_smoothing_applied_to_body-water_slam_and_efficient_wave-body_interaction","308999884_Unsteady_open_boundaries_for_SPH_using_semi-analytical_conditions_and_Riemann_solver_in_2D","284352964_Numerical_investigation_of_wave_elevation_and_bottom_pressure_generated_by_a_planing_hull_in_finite-depth_water","268526628_Non-linear_hydrodynamics_of_thin_laminae_undergoing_large_harmonic_oscillations_in_a_viscous_fluid","267131269_Boundary_conditions_generated_by_dynamic_particles_in_SPH_methods","267041447_DualSPHysics_Open-source_parallel_CFD_solver_based_on_Smoothed_Particle_Hydrodynamics_SPH","260784173_SPH_Modeling_of_Shallow_Flow_with_Open_Boundaries_for_Practical_Flood_Simulation","256918087_Variable_resolution_for_SPH_A_dynamic_particle_coalescing_and_splitting_scheme"]}