{"id":"315416239_Low_Power_Low_Latency_Floorplan-aware_Path_Synthesis_in_Application-Specific_Network-on-Chip_Design","abstract":"In Application-Specific Networks-on-Chip (ASNoCs), both positions of the routers and the route for each communication trace of the application can be adjusted to suit the requirements. For an application, input to the current work is a gridded floorplan having fixed positions of cores and routers in it. Maximum physical link length between two routers has been taken as a constraint. For each edge in the application core graph, the proposed method selects a particular path amongst all possible paths, between two grid points. A set of paths is constructed, corresponding to each edge in the core graph, to minimize either the average packet latency or the total router power consumption of the network. The work also inserts junction routers at intersection of two paths. Secondary routers or repeaters are inserted on a long link, to sustain a pre-specified maximum link length constraint. Alternative paths between routers requiring communication have been generated using a heuristic algorithm. From this, the path synthesis problem has been formulated using a set of linear equations. A Discrete Particle Swarm Optimization (DPSO) based solution has also been proposed for the problem. The path synthesis methodology has been tested with benchmark applications and compared with the shortest path based greedy approaches used by the other ASNoC synthesis methods. The results show a significant improvement in average packet latency and throughput. A power calculator has been developed that computes router power consumption as a function of traffic-load on the router and its number of input and output ports. With the help of the proposed power calculator, a power-aware path synthesis has been accomplished. Synthesized networks have been compared with the networks generated using the shortest path based methods. The proposed method consumes significantly less dynamic power compared to such greedy methods.","authors":["Priyajit Mukherjee","Santanu Chattopadhyay"],"meta":["March 2017Integration the VLSI Journal 58","DOI:10.1016/j.vlsi.2017.02.010"],"references":["224319372_Application_Specific_Routing_Algorithms_for_Networks_on_Chip","307801093_Lagrangian_relaxation_based_topology_synthesis_for_Application-Specific_Network-on-Chips","273664282_Floorplanning_and_Topology_Synthesis_for_Application-Specific_Network-on-Chips","272392239_Area-performance_trade-off_in_floorplan_generation_of_Application-Specific_Network-on-Chip_with_soft_cores","265789473_Deterministic_Synthesis_of_Hybrid_Application-Specific_Network-on-Chip_Topologies","260655540_CusNoC_Fast_full-chip_custom_NoC_generation","260584696_Application-specific_topology_generation_algorithms_for_network-on-chip_design","256417151_Rectilinear_paths_among_rectilinear_obstacles","225515199_Floorplan-aware_application-specific_network-on-chip_topology_synthesis_using_genetic_algorithm_technique","224379970_Design_of_Network-on-Chip_Architectures_With_a_Genetic_Algorithm-Based_Technique","221635225_Linear_programming_based_techniques_for_synthesis_of_network-on-chip_architectures","3337760_Low-power_repeaters_driving_RC_and_RLC_interconnects_with_delay_and_bandwidth_constraints","3224542_A_global_wiring_paradigm_for_deep_submicron_design","2985832_The_Future_of_Wires"]}