{"id":"315427522_Translating_Statistics_to_Make_Decisions","abstract":"Examine and solve the common misconceptions and fallacies that non-statisticians bring to their interpretation of statistical results. Explore the many pitfalls that non-statisticians—and also statisticians who present statistical reports to non-statisticians—must avoid if statistical results are to be correctly used for evidence-based business decision making.\nVictoria Cox, senior statistician at the United Kingdom’s Defence Science and Technology Laboratory (Dstl), distills the lessons of her long experience presenting the actionable results of complex statistical studies to users of widely varying statistical sophistication across many disciplines: from scientists, engineers, analysts, and information technologists to executives, military personnel, project managers, and officials across UK government departments, industry, academia, and international partners.\nThe author shows how faulty statistical reasoning often undermines the utility of statistical results even among those with advanced technical training. Translating Statistics into Better Decisions teaches statistically naive readers enough about statistical questions, methods, models, assumptions, and statements that they will be able to extract the practical message from statistical reports and better constrain what conclusions cannot be made from the results. To non-statisticians with some statistical training, this book offers brush-ups, reminders, and tips for the proper use of statistics and solutions to common errors. To fellow statisticians, the author demonstrates how to present statistical output to non-statisticians to ensure that the statistical results are correctly understood and properly applied to real-world tasks and decisions. The book avoids algebra and proofs, but it does supply code written in R for those readers who are motivated to work out examples.\nPointing along the way to instructive examples of statistics gone awry, Translating Statistics into Better Decisions walks readers through the typical course of a statistical study, progressing from the experimental design stage through the data collection process, exploratory data analysis, descriptive statistics, uncertainty, hypothesis testing, statistical modelling and multivariate methods, to graphs suitable for final presentation. The steady focus throughout the book is on how to turn the mathematical artefacts and specialist jargon that are second nature to statisticians into plain English for corporate customers and stakeholders. The final chapter neatly summarizes the book’s lessons and insights for accurately communicating statistical reports to the non-statisticians who commission and act on them.\nReaders will\n• Recognize and avoid common errors and misconceptions that cause statistical studies to be misinterpreted and misused by non-statisticians in organizational settings\n• Gain a practical understanding of the methods, processes, capabilities, and caveats of statistical studies to improve the application of statistical data to business decisions\n• See how to code statistical solutions in R","authors":["Victoria Cox"],"meta":["January 2017","DOI:10.1007/978-1-4842-2256-0","ISBN: 978-1-4842-2255-3"],"references":[]}