{"id":"315473156_The_strength_of_co-authorship_ties_through_different_topological_properties","abstract":"Social networks are complex structures that describe individuals (graph nodes) connected in any social context (graph edges). Different metrics can be applied to those networks and their properties in order to understand behavior and even predict the future. One of such properties is tie strength, which allows to identify prominent individuals, analyze how relationships play different roles, predict links, and so on. Here, we specifically address the problem of measuring tie strength in co-authorship social networks (nodes are researchers and edges represent their co-authored publications). We start by presenting four cases that emphasize the problems of current metrics. Then, we propose a new metric for tie strength, called tieness, that is simple to calculate and better differentiates the degrees of strength. Accompanied with a nominal scale, tieness also provides better results when compared to the existing metrics. Our analyses consider three real social networks built from publications collected from digital libraries on Computer Science, Medicine, and Physics. Finally, we also make all datasets publicly available.","authors":["Michele A. Brandão","Mirella M Moro"],"meta":["December 2017Journal of the Brazilian Computer Society 23(1)","DOI:10.1186/s13173-017-0055-x"],"references":["284162881_RECAST_Telling_apart_social_and_random_relationships_in_dynamic_networks","312639213_Predicting_the_Link_Strength_of_Newborn_Links","312622696_Using_transactional_information_to_predict_link_strength_in_online_social_networks","308276367_The_Strength_of_the_Work_Ties","303773434_Pick_the_right_team_and_make_a_blockbuster_a_social_analysis_through_movie_history","303026590_The_Strength_of_Varying_Tie_Strength_Comment_on_Aral_and_Van_Alstyne_1","300562952_Analyzing_the_Strength_of_Co-authorship_Ties_with_Neighborhood_Overlap","287261888_Community-based_endogamy_as_an_influence_indicator","285762244_Kendall_rank_correlation","280922323_You_Never_Call_You_Never_Write_Call_and_SMS_Logs_Do_Not_Always_Indicate_Tie_Strength"]}