{"id":"315495799_Black-Box_Data-efficient_Policy_Search_for_Robotics","abstract":"The most data-efficient algorithms for reinforcement learning (RL) in robotics are based on uncertain dynamical models: after each episode, they first learn a dynamical model of the robot, then they use an optimization algorithm to find a policy that maximizes the expected return given the model and its uncertainties. It is often believed that this optimization can be tractable only if analytical, gradient-based algorithms are used; however, these algorithms require using specific families of reward functions and policies, which greatly limits the flexibility of the overall approach. In this paper, we introduce a novel model-based RL algorithm, called Black-DROPS (Black-box Data-efficient RObot Policy Search) that: (1) does not impose any constraint on the reward function or the policy (they are treated as black-boxes), (2) is as data-efficient as the state-of-the-art algorithm for data-efficient RL in robotics, and (3) is as fast (or faster) than analytical approaches when several cores are available. The key idea is to replace the gradient-based optimization algorithm with a parallel, black-box algorithm that takes into account the model uncertainties. We demonstrate the performance of our new algorithm on two standard control benchmark problems (in simulation) and a low-cost robotic manipulator (with a real robot).","authors":["Konstantinos Chatzilygeroudis","Roberto Rama","Rituraj Kaushik","Dorian Goepp"],"meta":["September 2017","DOI:10.1109/IROS.2017.8202137","Conference: IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS)At: Vancouver, Canada","Projects: ResibotsResiBots"],"references":["310672123_Limbo_A_Fast_and_Flexible_Library_for_Bayesian_Optimization","309630047_Inverted_autonomous_helicopter_flight_via_reinforcement_learning","309131574_Reset-free_Trial-and-Error_Learning_for_Data-Efficient_Robot_Damage_Recovery","285979522_Model-based_contextual_policy_search_for_data-efficient_generalization_of_robot_skills","280438171_Bayesian_Optimization_for_Learning_Gaits_under_Uncertainty","320288294_Model_predictive_control","313505421_Completely_derandomized_self-adaptation_in_evolution_strategies","312832056_Patchwork_Kriging_for_Large-scale_Gaussian_Process_Regression","303269133_Gaussian_Processes_for_Machine_Learning","293084971_Learning_neural_network_policies_with_guided_policy_search_under_unknown_dynamics"]}