{"id":"315464571_Adaptive_Routing_and_Recharging_Policies_for_Electric_Vehicles","abstract":"Planning a trip with an electric vehicle requires consideration of both battery dynamics and the availability of charging infrastructure. Recharging costs for an electric vehicle, which increase as the battery’s charge level increases, are fundamentally different than refueling costs for conventional vehicles, which do not depend on the amount of fuel already in the tank. Furthermore, the viability of any route requiring recharging is sensitive to the availability of charging stations along the way. In this paper, we study the problem of finding an optimal adaptive routing and recharging policy for an electric vehicle in a network. Each node in the network represents a charging station and has an associated probability of being available at any point in time or occupied by another vehicle. We develop efficient algorithms for finding an optimal a priori routing and recharging policy and then present solution approaches to an adaptive problem that build on a priori policy. We present two heuristic methods for finding adaptive policies—one with adaptive recharging decisions only and another with both adaptive routing and recharging decisions. We then further enhance our solution approaches to a special case of the grid network. We conduct numerical experiments to demonstrate the empirical performance of our solutions and provide insights to our findings.\nThe online appendix is available at https://doi.org/10.1287/trsc.2016.0724.","authors":["Timothy M. Sweda","Irina S. Dolinskaya","Diego Klabjan"],"meta":["March 2017Transportation Science 51(4)","DOI:10.1287/trsc.2016.0724"],"references":["333042207_Pro-active_dynamic_vehicle_routing_Real-time_control_and_request-forecasting_approaches_to_improve_customer_service","286561738_The_charging-scheduling_problem_for_electric_vehicle_networks","281146180_Dynamic_Vehicle_Routing_Problems_Three_Decades_and_Counting","259548080_Decision_Support_System_of_Truck_Routing_and_Refueling_A_Dual-Objective_Approach","244442064_Shortest_Paths_in_Probabilistic_Graphs"]}