{"id":"315497997_A_modeling_framework_for_the_establishment_and_spread_of_invasive_species_in_heterogeneous_environments","abstract":"Natural and human-induced events are continuously altering the structure of our landscapes and as a result impacting the spatial relationships between individual landscape elements and the species living in the area. Yet, only recently has the influence of the surrounding landscape on invasive species spread started to be considered. The scientific community increasingly recognizes the need for broader modeling framework that focuses on cross-study comparisons at different spatiotemporal scales. Using two illustrative examples, we introduce a general modeling framework that allows for a systematic investigation of the effect of habitat change on invasive species establishment and spread. The essential parts of the framework are (i) a mechanistic spatially explicit model (a modular dispersal framework—MDIG) that allows population dynamics and dispersal to be modeled in a geographical information system (GIS), (ii) a landscape generator that allows replicated landscape patterns with partially controllable spatial properties to be generated, and (iii) landscape metrics that depict the essential aspects of landscape with which dispersal and demographic processes interact. The modeling framework provides functionality for a wide variety of applications ranging from predictions of the spatiotemporal spread of real species and comparison of potential management strategies, to theoretical investigation of the effect of habitat change on population dynamics. Such a framework allows to quantify how small-grain landscape characteristics, such as habitat size and habitat connectivity, interact with life-history traits to determine the dynamics of invasive species spread in fragmented landscape. As such, it will give deeper insights into species traits and landscape features that lead to establishment and spread success and may be key to preventing new incursions and the development of efficient monitoring, surveillance, control or eradication programs.","authors":["Audrey Lustig","Sue Worner","Joel Pitt","Crile Doscher"],"meta":["February 2017Ecology and Evolution 00(10):1-11","DOI:10.1002/ece3.2915"],"references":["330812002_Complex_systems_analysis_of_invasive_species_in_heterogeneous_environments","293043681_The_economic_benefit_of_time-varying_surveillance_effort_for_invasive_species_management","287964765_Mechanistic_species_distribution_modelling_as_a_link_between_physiology_and_conservation","334426243_Predicting_the_Establishment_of_Exotic_Pests_in_Relation_to_Climate","313707165_Handbook_of_computations_for_biological_statistics_of_fish_populations","312108188_Allee_Effects_Invasion_Pinning_and_Species'_Borders","286705254_Potential_impact_of_the_Argentine_ant_Linepithema_humile_in_New_Zealand_and_options_for_its_control","285002276_Random_dispersal_in_theoretical_populations","284657417_On_the_dynamics_of_exploited_fish_populations_Fishery_Investigations_Ministry_of_Agriculture_Fishery_and_Food_Great_Britain","276414021_Towards_more_predictable_and_consistent_landscape_metrics_across_spatial_scales","275590008_Landscape_ecology_and_biogeography_Rethinking_landscape_metrics_in_a_post-FRAGSTATS_landscape","272784733_Assessing_species_vulnerability_to_climate_change","270356319_The_Use_and_Misuse_of_Neutral_Landscape_Models_in_Ecology","269421352_Gypsy_Moth_Invasion_in_North_America_A_Quantitative_Analysis","268821182_Modelling_range_dynamics_under_global_change_Which_framework_and_why"]}