{"id":"315491838_Current_Developments_in_Machine_Learning_Techniques_in_Biological_Data_Mining","abstract":"This supplement is intended to focus on the use of machine learning techniques to generate meaningful information on biological data.\nThis supplement under Bioinformatics and Biology Insights aims to provide scientists and researchers working in this rapid and evolving fi eld with online, open-access articles authored by leading international experts in this field. Advances in the field of biology have generated massive opportunities to allow the implementation of modern computational and statistical techniques. Machine learning methods in particular, a subfield of computer science, have evolved as an indispensable tool applied to a wide spectrum of bioinformatics applications. Thus, it is broadly used to investigate the underlying mechanisms leading to a speci c disease, as well as the biomarker discovery process.\nWith a growth in this specific area of science comes the need to access up-to-date, high-quality scholarly articles that will leverage the knowledge of scientists and researchers in the various applications of machine learning techniques in mining biological data","authors":["Gerard Dumancas","Indra Adrianto","Ghalib A Bello","Mikhail G Dozmorov"],"meta":["March 2017Bioinformatics and Biology Insights 11:1-4","DOI:10.1177/1177932216687545"],"references":["283570477_Development_and_Application_of_a_Genetic_Algorithm_for_Variable_Optimization_and_Predictive_Modeling_of_Five-Year_Mortality_Using_Questionnaire_Data","283237475_Machine_Learning_Methods_for_Predicting_HLA-Peptide_Binding_Activity","283115665_B-Cell_and_Monocyte_Contribution_to_Systemic_Lupus_Erythematosus_Identified_by_Cell-Type-Specific_Differential_Expression_Analysis_in_RNA-Seq_Data","280560909_Development_and_Validation_of_a_Clinical_Risk-Assessment_Tool_Predictive_of_All-Cause_Mortality","6234069_Machine_Learning_and_Its_Applications_to_Biology","267004513_Foundations_of_Machine_Learning"]}