{"id":"315590231_Los_fundamentos_del_progreso_informatico_en_la_Union_Europea_The_foundations_of_computer_progress_in_the_European_Union","abstract":"Resumen:\nLa importancia del progreso informático en el vigente contexto globalizado,\nnos lleva a interrogarnos por los fundamentos de su regulación\ny ordenación en la Unión Europea, y en especial en su Derecho originario.\nA estos efectos comenzamos por una aproximación a la idea\nde progreso en relación con el proceso de integración europea, para\npasar luego a analizar ya la noción de progreso tecnológico (en cuanto que\nmarco en el que se incluye el más específico progreso informático) y su\nconfiguración a nivel de Naciones Unidas como derecho humano, a\nmodo de parámetro desde el que posteriormente estudiar luego: primero,\nlos fundamentos del progreso informático en el Derecho originario\nde la Unión Europea; y segundo, cómo se desarrollan dichos fundamentos\no bases en el Derecho derivado europeo y en la actividad de la\nUnión. Para terminar, concluiremos con unas consideraciones críticas\nal respecto de la percepción jurídica y política que del progreso informático\nsubyace en el proceso de integración europea, y sobre si tales\npostulados responden, adecuadamente o no, al contexto tecnológico e\ninformatizado en que vivimos.\n\nAbstract:\nComputer science progress inquires on the basis of its regulation in\nthe European Union, for all the Constitutive Treaties. This paper\nbegins with an approximation to the idea of progress in the European\nintegration. It continues with the problem of technological progress\nin the documents of United Nations. These steps help to analyze the\nregulation of computer science progress in the Constitutive Treaties\nof the European Union and its development in the Secondary Law. Finally\nI finish with some remarks on the political and law ideas latent\non the European Union and their coherence with the contemporary\ntechnological context.","authors":["Juan Francisco Sánchez Barrilao"],"meta":["March 2017Revista de Derecho Político 1(98):335","DOI:10.5944/rdp.98.2017.18658"],"references":["40939919_La_Sociedad_del_riesgo_hacia_una_nueva_modernidad"]}