{"id":"315503457_A_Nanotechnology-Ready_Computing_Scheme_based_on_a_Weakly_Coupled_Oscillator_Network","abstract":"With conventional transistor technologies reaching their limits, alternative computing schemes based on novel technologies are currently gaining considerable interest. Notably, promising computing approaches have proposed to leverage the complex dynamics emerging in networks of coupled oscillators based on nanotechnologies. The physical implementation of such architectures remains a true challenge, however, as most proposed ideas are not robust to nanotechnology devices’ non-idealities. In this work, we propose and investigate the implementation of an oscillator-based architecture, which can be used to carry out pattern recognition tasks, and which is tailored to the specificities of nanotechnologies. This scheme relies on a weak coupling between oscillators, and does not require a fine tuning of the coupling values. After evaluating its reliability under the severe constraints associated to nanotechnologies, we explore the scalability of such an architecture, suggesting its potential to realize pattern recognition tasks using limited resources. We show that it is robust to issues like noise, variability and oscillator non-linearity. Defining network optimization design rules, we show that nano-oscillator networks could be used for efficient cognitive processing.","authors":["Damir Vodenicarevic","Nicolas Locatelli","Flavio Abreu Araujo","Julie Grollier"],"meta":["March 2017Scientific Reports 7(1):44772","DOI:10.1038/srep44772","Project: bioSPINspired"],"references":["317970910_Mutual_synchronization_of_spin_torque_nano-oscillators_through_a_long-range_and_tunable_electrical_coupling_scheme","321512671_Applied_Mathematical_Sciences","318488966_Electrically_coupled_MEMS_oscillators","310543239_Long-range_mutual_synchronization_of_spin_Hall_nano-oscillators","309773154_Synchronization_Detection_in_Networks_of_Coupled_Oscillators_for_Pattern_Recognition","308085512_Computing_with_dynamical_systems_in_the_post-CMOS_era","307518052_Transistors_could_stop_shrinking_in_2021","304470615_Spintronic_Nanodevices_for_Bioinspired_Computing","303300776_The_Frustration_effect_on_the_explosive_synchronization","301258201_Computing_with_coupled_Spin_Torque_Nano_Oscillators"]}