{"id":"315540371_Model_of_a_Context-Aware_Middleware_for_Mobile_Workers","abstract":"With the development of Internet of things and Web of things, computing becomes more pervasive, invisible and present everywhere. In fact, in our environment, we are surrounded by multiple devices that deliver (web) services which meet the needs of the users. However, the mobility of these devices as the users has important repercussions that challenge software design of these applications because the variability of the environment cannot be anticipated at the design time. Thus, it will be interesting to dynamically discover the environment and adapt the application during its execution to the new contextual conditions. We therefore, propose a model of a context-aware middleware that can address this issue through a monitoring service which is capable of reasoning and observation channels capable of calculating the context during the runtime. The monitoring service evaluates the pre-defined X-Query predicates in the context manager and uses Prolog to deduce the services needed to respond back. An independent observation channel for each different predicate is then dynamically generated by the monitoring service depending on the current state of the environment. Each channel sends its result directly to the context manager which consequently calculates the context based on all the predicates’ results while preserving the reactivity of the self-adaptive system.","authors":["Esraa Moustafa","Gaëtan Rey","Stephane Lavirotte","Jean-Yves Tigli"],"meta":["January 2017Journal of Computer and Communications 05(04):29-43","DOI:10.4236/jcc.2017.54003","Project: Mutli-contextual models and concerns for context aware programming"],"references":["308549005_Towards_Future_Situation-Awareness_A_Conceptual_Middleware_Framework_for_Opportunistic_Situation_Identification","306017953_Development_of_Middleware_Architecture_to_Realize_Context-Aware_Service_in_Smart_Home_Environment","281115547_Context_Aware_Middleware_Architectures_Survey_and_Challenges","277579628_A_policy-based_middleware_for_context-aware_pervasive_computing","234060116_CA4IOT_Context_Awareness_for_Internet_of_Things","228808970_Context-Aware_Queries_Using_Query_by_Browsing_and_Chiromancer","221646842_An_Evaluation_of_Query_Languages_for_Context-Aware_Computing","257918991_The_Computer_for_the_21st_Century","247542832_Skills_Rules_and_Knowledge_Signals_Signs_and_Symbols_and_Other_Distinctions_in_Human_Performance_Models","237062595_A_Heterogeneous_Middleware_Architecture_for_Wireless_Sensor_Network"]}