{"id":"315576383_Decision_Mathematics_as_preparation_for_undergraduate_Computer_Science","abstract":"In England and Wales, students commonly take what are called Advanced ‘A’ level examinations in their final two years of secondary school. Good passes in these examinations are required to be accepted onto university degree courses. 123 Computer Science students from 24 different UK universities participated in an online survey about their perceptions and experiences of A-level Mathematics and A-level Further Mathematics as preparation for the mathematical component of their degree. The majority reported that decision mathematics\nunits that they had studied as part of either qualification had been good preparation for their degree. Additionally, those who had taken the Further Mathematics qualification were positive about their experience and its utility as preparation for undergraduate Computer Science. A-levels in Mathematics and Further\nMathematics in England and Wales are currently undergoing significant reform. One of the major changes will see the removal of Decision Mathematics as an optional topic in A-level Mathematics, meaning that students who wish to study it must take Further Mathematics – a much less commonly studied subject. Consequently, this research might encourage admissions tutors to reconsider their admissions requirements for undergraduate Computer Science.","authors":["Ellie Darlington","Jessica Bowyer"],"meta":["April 2017International Journal of Modern Education and Computer Science 9(4):1-11","DOI:10.5815/ijmecs.2017.04.01","Project: The Mathematics Needs of Higher Education"],"references":["292628911_The_Mathematics_Needs_of_Higher_Education","284633651_Students'_perceptions_of_A-level_Further_Mathematics_as_preparation_for_undergraduate_Mathematics","277007718_Mathematics_and_Computing","259669422_The_Roles_of_Mathematics_in_Computer_Science","324467332_Computer_Science_Mathematics_and_the_Undergraduate_Curricula_in_Both","273646233_Interdisciplinary_Teaching_of_Computing_to_Mathematics_Students_Programming_and_Discrete_Mathematics","268001177_A_Study_of_Factors_Promoting_Success_in_Computer_Science","238727712_Computer_Science_Mathematics_and_the_Undergraduate_Curricula_in_Both","234801643_Introductory_computer_programming_gender_major_discrete_mathematics_and_calculus","234801254_Case_studies_in_admissions_to_and_early_performance_in_computer_science_degrees"]}