{"id":"315532303_Efficient_Geometric_Pruning_Strategies_for_Continuous_Skyline_Queries","abstract":"The skyline query processing problem has been well studied for many years. The literature on skyline algorithms so far mainly considers static query points on static attributes. With the popular usage of mobile devices along with the increasing number of mobile applications and users, continuous skyline query processing on both static and dynamic attributes has become more pressing. Existing efforts on supporting moving query points assume that the query point moves with only one direction and constant speed. In this paper, we propose continuous skyline computation over an incremental motion model. The query point moves incrementally in discrete time steps with no restrictions and predictability. Geometric properties over incremental motion denoted by a kinetic data structure are utilized to prune the portion of data points not included in final skyline query results. Various geometric strategies are asymptotically proposed to prune the querying dataset, and event-driven mechanisms are adopted to process continuous skyline queries. Extensive experiments under different data sets and parameters demonstrate that the proposed method is robust and more efficient than multiple snapshots of I/O optimal branch-and-bound skyline (BBS) skyline queries.","authors":["Jiping Zheng","Jialiang Chen","Haixiang Wang"],"meta":["March 2017International Journal of Geo-Information 6(3):91","DOI:10.3390/ijgi6030091"],"references":["271585164_Efficient_caching_for_constrained_skyline_queries","259483485_On_Decentralized_Estimation_With_Active_Queries","235926809_Mobile_Sensor_Networks_Based_on_Autonomous_Platforms_for_Homeland_Security","314819465_An_optimal_and_progressive_algorithm_for_skyline_queries","280113634_Content-Based_Recommendation_Systems","273394187_Caching_Support_for_Skyline_Query_Processing_with_Partially_Ordered_Domains","266654942_Efficient_algorithms_for_spatial_skyline_query_with_uncertainty","262314718_Skyline_Queries_Front_and_Back","260324594_Range-Based_Skyline_Queries_in_Mobile_Environments","259739004_A_safe_zone_based_approach_for_monitoring_moving_skyline_queries"]}