{"id":"315582822_A_new_approach_to_characterize_epileptic_seizures_using_analytic_time-frequency_flexible_wavelet_transform_and_fractal_dimension","abstract":"The identification of seizure activities in non-stationary electroencephalography (EEG) is a challenging task. The seizure detection by human inspection of EEG signals is prone to errors, inaccurate as well as time-consuming. Several attempts have been made to develop automatic systems so as to assist neurophysiologists in identifying epileptic seizures accurately. The proposed study brings forth a novel automatic approach to detect epileptic seizures using analytic time-frequency flexible wavelet transform (ATFFWT) and fractal dimension (FD). The ATFFWT has inherent attractive features such as, shift-invariance property, tunable oscillatory attribute and flexible time-frequency covering favorable for the analysis of non-stationary and transient signals. We have used ATFFWT to decompose EEG signals into the desired subbands. Following the ATFFWT decomposition, we calculate FD for each subband. Finally, FDs of all subbands have been fed to the least-squares support vector machine (LS-SVM) classifier. The 10-fold cross validation has been used to obtain stable and reliable performance and to avoid the over fitting of the model. In this study, we investigate various different classification problems (CPs) pertaining to different classes of EEG signals, including the following popular CPs: (i) ictal versus normal (ii) ictal versus inter-ictal (iii) ictal versus non-ictal. The proposed model is found to be outperforming all existing models in terms of classification sensitivity (CSE) as it achieves perfect 100% sensitivity for seven CPs investigated by us. The prominent attribute of the proposed system is that though the model employs only one set of discriminating features (FD) for all CPs, it yields promising classification accuracy. Since, the proposed model attains the perfect classification performance it appears that a system is in place to assist clinicians to diagnose seizures accurately in less time. Further, the proposed system seems useful and attractive, especially, in the rural areas of developing countries where there is a shortage of experienced clinicians and expensive machines like functional magnetic resonance imaging (fMRI).","authors":["Manish Sharma","Ram Bilas Pachori","U Rajendra Acharya"],"meta":["March 2017Pattern Recognition Letters","DOI:10.1016/j.patrec.2017.03.023","Project: Design of optimal filter banks for biomedical signal analysis"],"references":["311702769_A_parametrization_technique_to_design_joint_time-frequency_optimized_discrete-time_biorthogonal_wavelet_bases","311425718_Time-frequency_localized_three-band_biorthogonal_wavelet_filter_bank_using_semidefinite_relaxation_and_nonlinear_least_squares_with_epileptic_seizure_EEG_signal_classification","310846257_An_automatic_detection_of_focal_EEG_signals_using_new_class_of_time-frequency_localized_orthogonal_wavelet_filter_banks","310625876_Optimal_duration-bandwidth_localized_antisymmetric_biorthogonal_wavelet_filters","309358470_A_novel_approach_for_automated_detection_of_focal_EEG_signals_using_empirical_wavelet_transform","294880298_Design_of_Time-Frequency_Optimal_Three-Band_Wavelet_Filter_Banks_with_Unit_Sobolev_Regularity_Using_Frequency_Domain_Sampling","287574853_Design_of_two-channel_linear_phase_biorthogonal_wavelet_filter_banks_via_convex_optimization","287331336_Design_of_Time-Frequency_Localized_Filter_Banks_Transforming_Non-convex_Problem_into_Convex_Via_Semidefinite_Relaxation_Technique","315591831_Design_of_Two-Channel_Linear_Phase_Biorthogonal_Wavelet_Filter_Banks_Via_Convex_Optimization","296621008_A_novel_robust_diagnostic_model_to_detect_seizures_in_electroencephalography"]}