{"id":"315504690_Mood_and_learning_in_navigation-based_serious_games","abstract":"Games are played for entertainment and have the ability to stimulate a variety of moods during gameplay, including happiness. Serious or applied games are created and used to serve a purpose rather than purely for entertainment. The relationship between mood and task efficiency has been investigated in psychology with contrasting results, and it also appears that there is a relationship between mood and learning. Players' mood and learning efficiency as a consequence of playing two serious games involving navigation in a virtual environment as the main action of gameplay, but with different learning objectives, have been investigated. The first game trained players to perform a religious ritual, while the second taught the route to a real world destination. The pre- and post-gameplay mood of 52 players were noted. It was found that both serious games helped the players develop a pleasant overall mood and significantly increased the self-reported happiness score in the post-questionnaire. It was also found that players who felt happier spent more time learning and that women performed better when they were happier. Also, younger learners tend to obtain a higher learning performance score than other age categories.","authors":["N. Nazrina M. Nazry","Daniela M. Romano"],"meta":["March 2017Computers in Human Behavior 73","DOI:10.1016/j.chb.2017.03.040","Projects: Human Informatics - UCLHIProcedural Learning in Virtual Environments and Serious Games."],"references":["249674724_Emotional_Intelligence_and_Emotion_Work_Examining_Constructs_From_an_Interdisciplinary_Framework","236329245_Healthy_Gaming_-_Video_Game_Design_to_promote_Health","235701029_Experiential_Learning_Experience_As_The_Source_Of_Learning_And_Development","232606730_The_effects_of_maps_on_navigation_and_search_strategies_in_very-large-scale_virtual_environments","298840623_The_effects_of_maps_on_navigation_and_search_strategies_in_very-large-scale_virtual_environments","292770369_Literature_review_in_games_and_learning","251710670_The_role_of_psychology_in_understanding_the_impact_of_computer_games","240280881_A_Review_of_Humor_for_Computer_Games_Play_Laugh_and_More","235775013_Action_Video_Games_Make_Dyslexic_Children_Read_Better","231383795_Mood_Management_Through_Communication_Choices"]}