{"id":"315682539_Generic_calculation_of_two-body_partial_decay_widths_at_the_full_one-loop_level","abstract":"We describe a fully generic implementation of two-body partial decay widths at the full one-loop level in the SARAH and SPheno framework compatible with most supported models. It incorporates fermionic decays to a fermion and a scalar or a gauge boson as well as scalar decays into two fermions, two gauge bosons, two scalars or a scalar and a gauge boson. We present the relevant generic expressions for virtual and real corrections. Whereas wave-function corrections are determined from on-shell conditions, the parameters of the underlying model are by default renormalised in a \n\nDR\n¯\n\n(or \n\nMS\n¯\n\n) scheme. However, the user can also define model-specific counter-terms. As an example we discuss the renormalisation of the electric charge in the Thomson limit for top-quark decays in the standard model. One-loop-induced decays are also supported. The framework additionally allows the addition of mass and mixing corrections induced at higher orders for the involved external states. We explain our procedure to cancel infrared divergences for such cases, which is achieved through an infrared counter-term taking into account corrected Goldstone boson vertices. We compare our results for sfermion, gluino and Higgs decays in the minimal supersymmetric standard model (MSSM) against the public codes SFOLD, FVSFOLD and HFOLD and explain observed differences. Radiatively induced gluino and neutralino decays are compared against the original implementation in SPheno in the MSSM. We exactly reproduce the results of the code CNNDecays for decays of neutralinos and charginos in R-parity violating models. The new version SARAH 4.11.0 by default includes the calculation of two-body decay widths at the full one-loop level. Current limitations for certain model classes are described.","authors":["Mark D. Goodsell","Stefan Liebler","Florian Staub"],"meta":["March 2017European Physical Journal C 77(11)","DOI:10.1140/epjc/s10052-017-5259-x"],"references":["305995068_Phenomenological_MSSM_in_light_of_new_13_TeV_LHC_data","305857502_One-loop_corrections_to_the_Higgs_self-couplings_in_the_singlet_extension","304273391_Charged_Higgs_Boson_Production_at_ee-_Colliders_in_the_Complex_MSSM_A_Full_One-Loop_Analysis","303270849_Gauge-independent_Renormalization_of_the_2-Higgs-Doublet_Model","301877497_The_Higgs_mass_in_the_CP_violating_MSSM_NMSSM_and_beyond","295854527_Precision_tools_and_models_to_narrow_in_on_the_750_GeV_diphoton_resonance","308457730_Avoiding_the_Goldstone_Boson_Catastrophe_in_general_renormalisable_field_theories_at_two_loops","301847082_One-loop_renormalisation_of_the_NMSSM_in_SloopS_1_the_neutralino-chargino_and_sfermion_sectors","285633653_J_High_Energy_Phys","284787954_Heavy_to_light_Higgs_boson_decays_at_NLO_in_the_Singlet_Extension_of_the_Standard_Model"]}