{"id":"315629716_Social-based_energy-aware_multicasting_in_delay_tolerant_networks","abstract":"In a post-disaster environment, traditional network infrastructure is mostly unavailable due to incidental destruction and damages. In such scenarios, delay/disruption tolerant networking may be considered as an alternative approach to meet the quintessential communication needs between the victims, field workers and centralized authority. In such applications, multicast communication is imperative because rescue and relief messages may often need to be shared among many volunteers. In this paper, we address the problem of relay selection for multicasting single and multiple data items in DTNs considering the application in disaster management. Both the single-data and multiple-data multicast problems are formulated as bi-objective optimization problems under the constraints of target delivery time, buffer space and residual energy levels of relay nodes. Both the problems are shown to be NP-hard. Hence, we propose two heuristic relay selection schemes exploiting social properties in DTNs. Theoretical analysis is performed for energy consumption and exhaustive simulation is carried out to evaluate performance of our proposed schemes in ONE simulator considering real-life data in post-disaster scenarios. Results show that our schemes are energy-saving thereby ensure longer network lifetime compared to other prominent schemes.","authors":["Animesh Roy","Soumit Bose","Acharya Tamaghna","Sipra Dasbit"],"meta":["March 2017Journal of Network and Computer Applications 87:169-184","DOI:10.1016/j.jnca.2017.03.020"],"references":["299217886_Best-effort_Delivery_of_Emergency_Messages_in_Post-disaster_Scenario_with_Content-based_Filtering_and_Priority-enhanced_PRoPHET_over_DTN","264046075_ONSIDE_Socially-Aware_and_Interest_Based_Dissemination_in_Opportunistic_Networks","259440903_Socially-Aware_Networking_A_Survey","220411203_Probabilistic_routing_in_intermittently_connected_networks","284077235_Data_Routing_Strategies_in_Opportunistic_Mobile_Social_Networks_Taxonomy_and_Open_Challenges","282984883_Energy-Aware_Social-Based_Multicast_in_Delay-Tolerant_Networks","282546291_Sociality-Aided_New_Adaptive_Infection_Recovery_Schemes_for_Multicast_DTNs","260521301_A_Survey_of_Social-Aware_Routing_Protocols_in_Delay_Tolerant_Networks_Applications_Taxonomy_and_Design-Related_Issues","233903521_Evaluating_Opportunistic_Networks_in_Disaster_Scenarios","220379733_A_dynamic_multicast_tree_based_routing_scheme_without_replication_in_delay_tolerant_networks","45930881_The_multiobjective_multidimensional_knapsack_problem_A_survey_and_a_new_approach"]}