{"id":"315696312_Experience-based_Optimization_A_Coevolutionary_Approach","abstract":"This paper studies improving solvers based on their past solving experiences, and focuses on improving solvers by offline training. Specifically, the key issues of offline training methods are discussed, and research belonging to this category but from different areas are reviewed in a unified framework. Existing training methods generally adopt a two-stage strategy in which selecting the training instances and training instances are treated in two independent phases. This paper proposes a new training method, dubbed LiangYi, which addresses these two issues simultaneously. LiangYi includes a training module for a population-based solver and an instance sampling module for updating the training instances. The idea behind LiangYi is to promote the population-based solver by training it (with the training module) to improve its performance on those instances (discovered by the sampling module) on which it performs badly, while keeping the good performances obtained by it on previous instances. An instantiation of LiangYi on the Travelling Salesman Problem is also proposed. Empirical results on a huge testing set containing 10000 instances showed LiangYi could train solvers that perform significantly better than the solvers trained by other state-of-the-art training method. Moreover, empirical investigation of the behaviours of LiangYi confirmed it was able to continuously improve the solver through training.","authors":["Shengcai Liu","Ke Tang","Xin Yao"],"meta":["March 2017"],"references":["299673540_Boosting_Sequential_Solver_Portfolios_Knowledge_Sharing_and_Accuracy_Prediction","267456524_Population-based_Algorithm_Portfolios_with_automated_constituent_algorithms_selection","262186384_Algorithm_Portfolios_Based_on_Cost-Sensitive_Hierarchical_Clustering","262145373_claspfolio_2_Advances_in_Algorithm_Selection_for_Answer_Set_Programming","303439434_Automatic_Construction_of_Parallel_Portfolios_via_Algorithm_Configuration","293191629_Negatively_Correlated_Search","284571822_Automated_algorithm_configuration_and_parameter_tuning","283092895_AutoFolio_An_Automatically_Configured_Algorithm_Selector","276453221_Generating_New_Test_Instances_by_Evolving_in_Instance_Space","276255524_Memetic_search_with_interdomain_learning_A_realization_between_CVRP_and_CARP"]}