{"id":"315667137_Fairness_in_Criminal_Justice_Risk_Assessments_The_State_of_the_Art","abstract":"Objectives\nDiscussions of fairness in criminal justice risk assessments typically lack conceptual precision. Rhetoric too often substitutes for careful analysis. In this article, we seek to clarify the trade-offs between different kinds of fairness and between fairness and accuracy.\n\nMethods\nWe draw on the existing literatures in criminology, computer science, and statistics to provide an integrated examination of fairness and accuracy in criminal justice risk assessments. We also provide an empirical illustration using data from arraignments.\n\nResults\nWe show that there are at least six kinds of fairness, some of which are incompatible with one another and with accuracy.\n\nConclusions\nExcept in trivial cases, it is impossible to maximize accuracy and fairness at the same time and impossible simultaneously to satisfy all kinds of fairness. In practice, a major complication is different base rates across different legally protected groups. There is a need to consider challenging trade-offs. These lessons apply to applications well beyond criminology where assessments of risk can be used by decision makers. Examples include mortgage lending, employment, college admissions, child welfare, and medical diagnoses.","authors":["Richard A. Berk","Hoda Heidari","Shahin Jabbari","Michael Kearns"],"meta":["March 2017Sociological Methods & Research 50(6)","DOI:10.1177/0049124118782533"],"references":["329687880_Actuarial_Justice_The_Emerging_New_Criminal_Law","329651018_An_Introduction_to_Computational_Learning_Theory","324525300_Criminal_justice_forecasts_of_risk_A_machine_learning_approach","324258821_Human_Decisions_and_Machine_Predictions","323983704_Big_Data's_Disparate_Impact","323627230_A_Reductions_Approach_to_Fair_Classification","321620008_Statistical_Learning_from_a_Regression_Perspective","321514799_Criminal_Justice_Forecasts_of_Risk","321330090_Models_as_Approximations_-_A_Conspiracy_of_Random_Regressors_and_Model_Deviations_Against_Classical_Inference_in_Regression","321095801_Preventing_Fairness_Gerrymandering_Auditing_and_Learning_for_Subgroup_Fairness"]}