{"id":"315613676_Deep_Learning-Based_Crack_Damage_Detection_Using_Convolutional_Neural_Networks","abstract":"A number of image processing techniques (IPTs) have been implemented for detecting civil infrastructure defects to partially replace human-conducted on-site inspections. These IPTs are primarily used to manipulate images to extract defect features, such as cracks in concrete and steel surfaces. However, the extensively varying real-world situations (e.g., lighting and shadow changes) can lead to challenges to the wide adoption of IPTs. To overcome these challenges, this article proposes a vision-based method using a deep architecture of con-volutional neural networks (CNNs) for detecting concrete cracks without calculating the defect features. As CNNs are capable of learning image features automatically , the proposed method works without the conjugation of IPTs for extracting features. The designed CNN is trained on 40 K images of 256 × 256 pixel resolutions and, consequently, records with about 98% accuracy. The trained CNN is combined with a sliding window technique to scan any image size larger than 256 × 256 pixel resolutions. The robustness and adaptability of the proposed approach are tested on 55 images of 5,888 × 3,584 pixel resolutions taken from a different structure which is not used for training and validation processes under various conditions (e.g., strong light spot, shadows , and very thin cracks). Comparative studies are conducted to examine the performance of the proposed CNN using traditional Canny and Sobel edge detection methods. The results show that the proposed method shows","authors":["Young-Jin Cha","Wooram Choi","Oral Buyukozturk"],"meta":["March 2017Computer-Aided Civil and Infrastructure Engineering 32(5):361-378","DOI:10.1111/mice.12263","Projects: Deep learning based SHMDeveloping an Advanced Hybrid System of Structural Health Monitoring"],"references":["312890367_'Edge_detection_techniques_An_overview'","295084545_Identification_of_Beam_Cracks_by_Solution_of_an_Inverse_Problem","320405193_Inteligent_Crack_Detecting_Algorithm_on_the_Concrete_Crack_Image_Using_Neural_Network","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","319770174_Practical_recommendations_for_gradient-based_training_of_deep_architectures","310460793_Output-Only_Computer_Vision_Based_Damage_Detection_Using_Phase-Based_Optical_Flow_and_Unscented_Kalman_Filters","305717178_Vision-based_detection_of_loosened_bolts_using_the_Hough_transform_and_support_vector_machines","304417592_MatConvNet_convolutional_neural_networks_for_MATLAB","286794765_Dropout_A_Simple_Way_to_Prevent_Neural_Networks_from_Overfitting","279246813_Road_Extraction_Using_SVM_and_Image_Segmentation"]}