{"id":"315692147_Sharing_deep_generative_representation_for_perceived_image_reconstruction_from_human_brain_activity","abstract":"Decoding human brain activities via functional magnetic resonance imaging (fMRI) has gained increasing attention in recent years. While encouraging results have been reported in brain states classification tasks, reconstructing the details of human visual experience still remains difficult. Two main challenges that hinder the development of effective models are the perplexing fMRI measurement noise and the high dimensionality of limited data instances. Existing methods generally suffer from one or both of these issues and yield dissatisfactory results. In this paper, we tackle this problem by casting the reconstruction of visual stimulus as the Bayesian inference of missing view in a multiview latent variable model. Sharing a common latent representation, our joint generative model of external stimulus and brain response is not only \" deep \" in extracting nonlinear features from visual images, but also powerful in capturing correlations among voxel activities of fMRI recordings. The nonlinearity and deep structure endow our model with strong representation ability, while the correlations of voxel activities are critical for suppressing noise and improving prediction. We devise an efficient variational Bayesian method to infer the latent variables and the model parameters. To further improve the reconstruction accuracy, the latent representations of testing instances are enforced to be close to that of their neighbours from the training set via posterior regularization. Experiments on three fMRI recording datasets demonstrate that our approach can more accurately reconstruct visual stimuli.","authors":["Changde Du","Changying Du","Huiguang He"],"meta":["March 2017","DOI:10.1109/IJCNN.2017.7965968","Conference: International Joint Conference on Neural Networks (IJCNN 2017)"],"references":["321859458_Hierarchical_Convolutional_Neural_Networks_for_EEG-Based_Emotion_Recognition","305276751_Brain_Decoding-Classification_of_Hand_Written_Digits_from_fMRI_Data_Employing_Bayesian_Networks","303908185_Comparison_of_deep_neural_networks_to_spatio-temporal_cortical_dynamics_of_human_visual_object_recognition_reveals_hierarchical_correspondence","316926791_Emotions_Recognition_Using_EEG_Signals_A_Survey","316921719_Spatial-Temporal_Recurrent_Neural_Network_for_Emotion_Recognition","312771295_Image_quality_assessment_From_error_visibility_to_structural_similarity","311609396_Deep_Metric_Learning_via_Lifted_Structured_Feature_Embedding","308048640_Thirteen_ways_to_look_at_the_correlation_coefficient","306186676_Neural_Encoding_and_Decoding_with_Deep_Learning_for_Dynamic_Natural_Vision","303743787_Reconstructing_Perceived_and_Retrieved_Faces_from_Activity_Patterns_in_Lateral_Parietal_Cortex"]}