{"id":"315693110_A_Two-Phase_Stock_Trading_System_based_on_Pattern_Matching_and_Automatic_Rule_Induction","abstract":"In the context of a dynamic trading environment, the ultimate goal of the financial forecasting system is to optimize a specific trading objective. This paper proposes a two-phase (extraction and filtering) stock trading system that aims at maximizing the rates of returns. Extraction of stocks is performed by searching specific time-series patterns described by a combination of values of technical indicators. In the filtering phase, several rules are applied to the extracted sets of stocks to select stocks to be actually traded. The filtering rules are automatically induced from past data. From a large database of daily stock prices, the values of technical indicators are calculated. They are used to make the extraction patterns, and the distributions of the discretization intervals of the values are calculated for both positive and negative data sets. We assumed that the values in the intervals of distinctive distribution may contribute to the prediction of future trend of stocks, so the rules for filtering stocks are automatically induced from the data in those intervals. We show the rates of returns when using our trading system outperform the market average. These results mean rule induction method using distributional differences is useful.","authors":["Jong-Woo Lee","Yu-Seop Kim","Sung-Dong Kim","Jae-Won Lee"],"meta":["June 2003The KIPS Transactions PartB 10B(3):257-264","DOI:10.3745/KIPSTB.2003.10B.3.257"],"references":["228771755_Pattern_discovery_from_stock_time_series_using_self-organizing_maps","228769299_Noisy_Time_Series_Prediction_using_Recurrent_Neural_Networks_and_Grammatical_Inference","221653518_Event_Detection_from_Time_Series_Data","2817232_Rule_Inference_for_Financial_Prediction_using_Recurrent_Neural_Networks","239667305_Neural_Networks_In_the_Capital_Markets","3710326_High_frequency_time_series_analysis_and_prediction_using_Markov_models","2605857_Optimisation_of_Trading_Strategies_using_Parameterised_Decision_Rules","2586453_Volatility_Trading_via_Temporal_Pattern_Recognition_in_Quantized_Financial_Time_Series"]}