{"id":"315766818_Detection_and_Resolution_of_Rumours_in_Social_Media_A_Survey","abstract":"Despite the increasing use of social media platforms for information and news gathering, its unmoderated nature often leads to the emergence and spread of rumours, i.e. pieces of information that are unverified at the time of posting. At the same time, the openness of social media platforms provides opportunities to study how users share and discuss rumours, and to explore how natural language processing and data mining techniques may be used to find ways of determining their veracity. In this survey we introduce and discuss two types of rumours that circulate on social media; long-standing rumours that circulate for long periods of time, and newly-emerging rumours spawned during fast-paced events such as breaking news, where reports are released piecemeal and often with an unverified status in their early stages. We provide an overview of research into social media rumours with the ultimate goal of developing a rumour classification system that consists of four components: rumour detection, rumour tracking, rumour stance classification and rumour veracity classification. We delve into the approaches presented in the scientific literature for the development of each of these four components. We summarise the efforts and achievements so far towards the development of rumour classification systems and conclude with suggestions for avenues for future research in social media mining for detection and resolution of rumours.","authors":["Arkaitz Zubiaga","Ahmet Aker","Kalina Bontcheva","Maria Liakata"],"meta":["February 2018ACM Computing Surveys 51(2)","DOI:10.1145/3161603","Project: Pheme: Computing Veracity – the Fourth Challenge of Big Data"],"references":["322794598_SemEval-2017_Task_8_RumourEval_Determining_rumour_veracity_and_support_for_rumours","322794230_NileTMRG_at_SemEval-2017_Task_8_Determining_Rumour_and_Veracity_Support_for_Rumours_on_Twitter","321493090_Simple_Open_Stance_Classification_for_Rumour_Analysis","322794232_DFKI-DKT_at_SemEval-2017_Task_8_Rumour_Detection_and_Classification_using_Cascading_Heuristics","322794229_ECNU_at_SemEval-2017_Task_8_Rumour_Evaluation_Using_Effective_Features_and_Supervised_Ensemble_Models","322793814_IITP_at_SemEval-2017_Task_8_A_Supervised_Approach_for_Rumour_Evaluation","322793680_IKM_at_SemEval-2017_Task_8_Convolutional_Neural_Networks_for_stance_detection_and_rumor_verification","322793675_Turing_at_SemEval-2017_Task_8_Sequential_Approach_to_Rumour_Stance_Classification_with_Branch-LSTM","322793498_Mama_Edha_at_SemEval-2017_Task_8_Stance_Classification_with_CNN_and_Rules","320250010_An_efficient_randomized_algorithm_for_rumor_blocking_in_online_social_networks"]}