{"id":"315787513_Classification_of_Lunge_Biomechanics_with_Multiple_and_Individual_Inertial_Measurement_Units","abstract":"Lunges are a common, compound lower-limb resistance exercise. If completed with aberrant technique, the increased stress on the joints used may increase risk of injury. This study sought to first investigate the ability of inertial measurement units (IMUs), when used in isolation and combination, to (a) classify acceptable and aberrant lunge technique (b) classify exact deviations in lunge technique. We then sought to investigate the most important features and establish the minimum number of top-ranked features and decision trees that are needed to maintain maximal system classification efficacy. Eighty volunteers performed the lunge with acceptable form and 11 deviations. Five IMUs positioned on the lumbar spine, thighs and shanks recorded these movements. Time and frequency domain features were extracted from the IMU data and used to train and test a variety of classifiers. A single IMU system achieved 83% accuracy, 62% sensitivity and 90% specificity in binary classification and a five IMU system achieved 90% accuracy, 80% sensitivity and 92% specificity. A five IMU set-up can also detect specific deviations with 70% accuracy. System efficiency was improved and classification quality was maintained when using only 20% of the top-ranked features for training and testing classifiers.","authors":["Martin O'Reilly","Darragh Whelan","Eamonn Delahunt","Tomas E Ward"],"meta":["April 2017Sports Biomechanics 16(3)","DOI:10.1080/14763141.2017.1314544","Project: Development & Evaluation of Wearable Sensor Based Exercise Biofeedback Systems"],"references":["308545760_Evaluating_squat_performance_with_a_single_inertial_measurement_unit","304020995_Evaluating_Performance_of_the_Lunge_Exercise_with_Multiple_and_Individual_Inertial_Measurement_Units","301452510_Evaluating_Performance_of_the_Single_Leg_Squat_Exercise_with_a_Single_Inertial_Measurement_Unit","283090976_A_Real-Time_Human_Action_Recognition_System_Using_Depth_and_Inertial_Sensor_Fusion","280112308_Measurement_and_Estimation_of_3D_Orientation_using_Magnetic_and_Inertial_Sensors","268877030_Rehabilitation_exercise_assessment_using_inertial_sensors_A_cross-sectional_analytical_study","288906520_Random_forests","282731812_Recognizing_the_Intensity_of_Strength_Training_Exercises_with_Wearable_Sensors","275354755_Forward_lunge_knee_biomechanics_before_and_after_partial_meniscectomy","272524534_Reliability_and_minimal_detectable_change_of_the_weight-bearing_lunge_test_A_systematic_review"]}