{"id":"315798234_A_Hybrid_Technique_for_Annotating_Book_Tables","abstract":"Table extraction is usually complemented with the table annotation to find the hidden semantics in a particular\npiece of document or a book. These hidden semantics are determined by identifying a type for each column, finding the relationships between the columns, if any, and the entities in each cell. Though used for the small documents and web-pages, these approaches have not been extended to the table extraction and annotation in the book tables. This paper focuses on detecting, locating and annotating entities in book tables. More specifically it contributes algorithms for identifying and locating the tables in books and annotating the table entities by using the online knowledge source DBpedia Spotlight. The missing entities from the DBpedia Spotlight are then annotated using Google Snippets. It was found that the combined results give higher accuracy and superior performance over the use of DBpedia alone. The approach is a complementary one to the existing table annotation approaches as it enables us to discover and annotate entities that are not present in the catalogue. We have tested our scheme on Computer Science books and got promising results in terms of accuracy and performance.","authors":["Asima Latif","Shah Khusro","Irfan Ullah","Nasir Ahmad"],"meta":["April 2017International Arab Journal of Information Technology 15(4):777-783","Projects: ICT AccessibilityInformation Service EngineeringPDF book annotation"],"references":["262315026_Entity_Discovery_and_Annotation_in_Tables","230771812_Automatic_Document_Structure_Analysis_of_Structured_PDF_Files","228450516_Generating_Linked_Data_by_inferring_the_semantics_of_tables","225153001_Design_of_an_end-to-end_method_to_extract_information_from_tables","295559427_An_Integrated_Approach_for_Measuring_Semantic_Similarity_between_Words_and_Sentences_using_Web_Search_Engine","280851709_Des_donnees_tabulaires_a_RDF_l'extraction_de_donnees_de_Google_Fusion_Tables","269992855_On_methods_and_tools_of_table_detection_extraction_and_annotation_in_PDF_documents","255563889_Towards_a_Probabilistic_Taxonomy_of_Many_Concepts","230771253_Automatic_Document_Structure_Analysis_of_Structured_PDF_Files","225162599_Towards_a_theory_of_tables"]}