{"id":"315758541_Unicorn_data_scientist_the_rarest_of_breeds","abstract":"Purpose\nMany organizations are seeking unicorn data scientists, that rarest of breeds that can do it all. They are said to be experts in many traditionally distinct disciplines, including mathematics, statistics, computer science, artificial intelligence, and more. The purpose of this paper is to describe authors’ pursuit of these elusive mythical creatures.\n\nDesign/methodology/approach\nQualitative data were collected through semi-structured interviews with managers/directors from nine Australian state and federal government agencies with relatively mature data science functions.\n\nFindings\nAlthough the authors failed to find evidence of unicorn data scientists, they are pleased to report on six key roles that are considered to be required for an effective data science team. Primary and secondary skills for each of the roles are identified and the resulting framework is then used to illustratively evaluate three data science Master-level degrees offered by Australian universities.\n\nResearch limitations/implications\nGiven that the findings presented in this paper have been based on a study with large government agencies with relatively mature data science functions, they may not be directly transferable to less mature, smaller, and less well-resourced agencies and firms.\n\nOriginality/value\nThe skills framework provides a theoretical contribution that may be applied in practice to evaluate and improve the composition of data science teams and related training programs.","authors":["Sasa Baskarada","Andy Koronios"],"meta":["April 2017Program Electronic Library and Information Systems 51(1):65-74","DOI:10.1108/PROG-07-2016-0053"],"references":["333752364_What_Is_Data_Science","320742467_Strategies_for_maximizing_organizational_absorptive_capacity","289738131_Dynamics_of_the_importance_of_ISIT_skills","282261615_Roles_and_responsibilities_Libraries_librarians_and_data","280805635_Qualitative_Case_Study_Guidelines","352347467_The_Data_Science_Education_Dilemma","313721126_A_study_of_digital_curator_competences_A_survey_of_experts","310481829_The_constant_comparative_method_of_qualitative_analysis","284679162_Business_Intelligence_and_Analytics_From_Big_Data_to_Big_Impact","280745390_The_Constant_Comparative_Method_of_Qualitative_Analysis"]}