{"id":"315794293_Tipologia_do_trabalhador_do_conhecimento_papeis_e_processos","abstract":"Resumo Fundamentado em um Modelo de Tipologia do Papel do Trabalhador do Conhecimento, este artigo apresenta resultados da avaliação de papéis e processos típicos para uma população brasileira com características aproximadas, deste estudo na Europa. Participaram 42 pesquisadores atuantes em centros de ensino e institutos de pesquisas brasileiros na área de biotecnologia e de ciência da computação. A investigação exploratória e descritiva utilizou-se da ferramenta open source Lime Survey. Foram analisados dados primários, com uso de metodologia quantitativa. 67% respondentes identificaram com o papel de Recuperador, diferindo do resultado obtido por Reinhardt et al. (2011), que apontou o papel de Aprendiz. Em relação ao processo, Aquisição, com média 4,12 de respostas (na Escala Likert), obteve a concordância dos respondentes como o principal processo típico de conhecimento realizado pelos respondentes, seguido pelo processo de Formalização. Os participantes da pesquisa concordam que os cinco processos típicos do conhecimento estão presentes na maioria dos papéis dos trabalhadores do conhecimento, tendo destaque o papel do Compartilhador como o mais relevante nos processos de formalização, compartilhamento e aplicação do conhecimento. Ponderando a limitação do estudo e a motivação para ampliar a amostragem da pesquisa, o resultado reforça a boa aderência da tipologia e destaca o uso desse instrumento benéfico a gestão dos recursos humanos ao 1 A pesquisa em relato é um recorte da dissertação intitulada O papel do trabalhador do conhecimento: um estudo em centros de ensino e instituto de pesquisa brasileiros, desenvolvida no âmbito do Programa de Pós-graduação em Administração da Pontifícia Universidade Católica de São Paulo (PUC/SP), elaborada pela primeira autora, sob orientação da segunda autora, com a colaboração dos demais autores.","authors":["Valeria Macedo","Neusa Santos","Belmiro Do Nascimento João","Andre Saito"],"meta":["February 2017Pesquisa Brasileira em Ciência da Informação e Biblioteconomia 7(ISSN 2236-417X):94-108","DOI:10.22478/ufpb.1981-0695.2017v12n2.36764","Project: O papel do trabalhador do conhecimento: um estudo em centros de ensino e laboratórios de pesquisa brasileiros"],"references":["303042595_Harvard_Business_Review","248078273_Thinking_for_A_Living_How_to_Get_Better_Performance_and_Results_from_Knowledge_Workers","229099904_Working_Knowledge_How_Organizations_Manage_What_They_Know","228392305_Knowledge_integrator_nodes_in_teams_or_networks_in_multinational_enterprises","220363282_Implementing_process-oriented_knowledge_management_strategies","220363097_The_Concept_of_Knowledge_Work_Revisited","264397863_Questions_About_Questions_Investigating_How_Knowledge_Workers_Ask_and_Answer_Questions","238678654_The_Work_of_Nations_Preparing_Ourselves_For_21st_Century_Capitalism","220363292_A_typology_of_knowledge_management_Strategic_groups_and_role_behavior_in_organizations","216353111_The_Knowledge_Creating_Company_How_Japanese_Companies_Create_The_Dynamics_Of_Innovation"]}