{"id":"315737187_ProMoBox_A_Framework_for_Generating_Domain-Specific_Property_Languages","abstract":"Specifying and verifying properties of the modelled system has been mostly neglected by domain-specific modelling (DSM) approaches. At best, this is only partially supported by translating models to formal representations on which properties are specified and evaluated based on logic-based formalisms, such as linear temporal logic. This contradicts the DSM philosophy as domain experts are usually not familiar with the logics space. To overcome this shortcoming, we propose to shift property specification and verification tasks up to the domain-specific level. The ProMoBox framework consists of (i) generic languages for modelling properties and representing verification results, (ii) a fully automated method to specialize and integrate these generic languages to a given DSM language, and (iii) a verification backbone based model checking directly plug-able to DSM environments. In its current state, ProMoBox offers the designer modelling support for defining temporal properties, and for visualizing verification results, all based on a given DSM language. We report results of applying ProMoBox to a case study of an elevator controller.","authors":["Bart Meyers","Romuald Deshayes","Levi Lucio","Eugene Syriani"],"meta":["September 2014","DOI:10.1007/978-3-319-11245-9_1","Conference: International Conference on Software Language Engineering"],"references":["279257647_Temporal_Constraint_Support_for_OCL","273118715_A_Classification_of_Model_Checking-Based_Verification_Approaches_for_Software_Models","273118644_OCL_meets_CTL_Towards_CTL-extended_OCL_model_checking","269269106_A_Design_Pattern_to_Build_Executable_DSMLs_and_associated_VV_tools","268373649_A_Multi-Paradigm_Foundation_for_Model_Transformation_Language_Engineering","262344904_Leveraging_Formal_Verification_Tools_for_DSML_Users_A_Process_Modeling_Case_Study","288009753_Analyzing_rule-based_behavioral_semantics_of_visual_modeling_languages_with_maude","269251842_Towards_domain-specific_property_languages_The_ProMoBox_approach","262324948_Specification_Patterns_for_Properties_over_Reachable_States_of_Graph_Grammars","262206599_Towards_Scenario-Based_Testing_of_UML_Diagrams"]}