{"id":"315782576_Tunable-Q_wavelet_transform_based_multiscale_entropy_measure_for_automated_classification_of_epileptic_EEG_signals","abstract":"This paper analyzes the underlying complexity and non-linearity of electroencephalogram (EEG) signals by computing a novel multi-scale entropy measure for the classification of seizure, seizure-free and normal EEG signals. The quality factor (Q) based multi-scale entropy measure is proposed to compute the entropy of the EEG signal in different frequency-bands of interest. The Q -based entropy (QEn) is computed by decomposing the signal with the tunable-Q wavelet transform (TQWT) into the number of sub-bands and estimating K-nearest neighbor (K-NN) entropies from various sub-bands cumulatively. The optimal selection of Q and the redundancy parameter (R) of TQWT showed better robustness for entropy computation in the presence of high- and low-frequency components. The extracted features are fed to the support vector machine (SVM) classifier with the wrapper-based feature selection method. The proposed method has achieved accuracy of 100% in classifying normal (eyes-open and eyes-closed) and seizure EEG signals, 99.5% in classifying seizure-free EEG signals (from the hippocampal formation of the opposite hemisphere of the brain) from seizure EEG signals and 98% in classifying seizure-free EEG signals (from the epileptogenic zone) from seizure EEG signals, respectively, using the SVM classifier. We have also achieved classification accuracies of 99% and 98.6% in classifying seizure versus non-seizure EEG signals and the individual three classes, namely normal, seizure-free and seizure EEG signals, respectively. The performance measure of the proposed multi-scale entropy has been found to be comparable with the existing state of the art epileptic EEG signals classification methods studied using the same database.","authors":["Abhijit Bhattacharyya","Ram Bilas Pachori","Abhay Upadhyay","U Rajendra Acharya"],"meta":["April 2017Applied Sciences 7(4)","DOI:10.3390/app7040385","Projects: PhD workPhD work"],"references":["313915323_Tunable-Q_Wavelet_Transform_Based_Multivariate_Sub-Band_Fuzzy_Entropy_with_Application_to_Focal_EEG_Signal_Analysis","313791529_Use_of_Accumulated_Entropies_for_Automated_Detection_of_Congestive_Heart_Failure_in_Flexible_Analytic_Wavelet_Transform_Framework_Based_on_Short-Term_HRV_Signals","312043417_A_Multivariate_Approach_for_Patient-Specific_EEG_Seizure_Detection_Using_Empirical_Wavelet_Transform","311425718_Time-frequency_localized_three-band_biorthogonal_wavelet_filter_bank_using_semidefinite_relaxation_and_nonlinear_least_squares_with_epileptic_seizure_EEG_signal_classification","309358470_A_novel_approach_for_automated_detection_of_focal_EEG_signals_using_empirical_wavelet_transform","312933026_Detection_of_epileptic_seizure_using_Kraskov_entropy_applied_on_tunable-Q_wavelet_transform_of_EEG_signals","312538118_Support-vector_networks","307930404_Epileptic_seizure_detection_in_EEG_signals_using_tunable-Q_factor_wavelet_transform_and_bootstrap_aggregating","304659583_Automated_Diagnosis_of_Epilepsy_Using_Key-Point-Based_Local_Binary_Pattern_of_EEG_Signals","304019856_An_efficient_automated_technique_for_CAD_diagnosis_using_flexible_analytic_wavelet_transform_and_entropy_features_extracted_from_HRV_signals"]}