{"id":"315796191_Geometry_of_Factored_Nuclear_Norm_Regularization","abstract":"This work investigates the geometry of a nonconvex reformulation of minimizing a general convex loss function $f(X)$ regularized by the matrix nuclear norm $\\|X\\|_*$. Nuclear-norm regularized matrix inverse problems are at the heart of many applications in machine learning, signal processing, and control. The statistical performance of nuclear norm regularization has been studied extensively in literature using convex analysis techniques. Despite its optimal performance, the resulting optimization has high computational complexity when solved using standard or even tailored fast convex solvers. To develop faster and more scalable algorithms, we follow the proposal of Burer-Monteiro to factor the matrix variable $X$ into the product of two smaller rectangular matrices $X=UV^T$ and also replace the nuclear norm $\\|X\\|_*$ with $(\\|U\\|_F^2+\\|V\\|_F^2)/2$. In spite of the nonconvexity of the factored formulation, we prove that when the convex loss function $f(X)$ is $(2r,4r)$-restricted well-conditioned, each critical point of the factored problem either corresponds to the optimal solution $X^\\star$ of the original convex optimization or is a strict saddle point where the Hessian matrix has a strictly negative eigenvalue. Such a geometric structure of the factored formulation allows many local search algorithms to converge to the global optimum with random initializations.","authors":["Qiuwei Li","Zhihui Zhu","Gongguo Tang"],"meta":["April 2017","Project: Nonconvex Optimization"],"references":["314237471_The_Global_Optimization_Geometry_of_Nonsymmetric_Matrix_Factorization_and_Sensing","314092593_Global_Optimality_in_Low-rank_Matrix_Optimization","309797581_The_Nonconvex_Geometry_of_Low-Rank_Matrix_Optimizations_with_General_Objective_Functions","308026340_Non-square_matrix_sensing_without_spurious_local_minima_via_the_Burer-Monteiro_approach","301846557_Gradient_Descent_Converges_to_Minimizers","315764942_No_Spurious_Local_Minima_in_Nonconvex_Low_Rank_Problems_A_Unified_Geometric_Analysis","314182204_How_to_Escape_Saddle_Points_Efficiently","311969299_Symmetry_Saddle_Points_and_Global_Geometry_of_Nonconvex_Matrix_Factorization","303488476_Global_Optimality_of_Local_Search_for_Low_Rank_Matrix_Recovery","303488473_Matrix_Completion_has_No_Spurious_Local_Minimum"]}