{"id":"315740189_MOOCs_to_university_a_consumer_goal_and_marketing_perspective","abstract":"n this paper we apply consumer goal theories to an educational context by examining how completion of a MOOC (Massive Open Online Course) may motivate enrolment in a university course. We contend that individuals who finish a MOOC are more likely to establish a new goal intention for university than those who do not finish. This new goal intention is likely to be prompted by the individual’s satisfaction with their MOOC experience as well as a sense of discontent in not having fulfilled their broader educational goals. For those who do set a new goal for university study, we contend that the institute hosting the MOOC is likely to form part of the consideration set used by individuals to narrow down their choice of tertiary provider. Moreover, we argue that this same host institute is likely to be chosen from the consideration set where the MOOC experience is a satisfying one and where a strong link can be established between the pedagogical and delivery approaches used in both the MOOC and university settings. This research has implications for how tertiary institutes create and use MOOCs, and offers insights into how providers can more effectively market higher education courses to those progressing through a MOOC pathway.","authors":["Jason Howarth","Lester W Johnson","Lesley White","Steven D'Alessandro"],"meta":["April 2017Journal of Marketing for HIGHER EDUCATION 27(April):1-15","DOI:10.1080/08841241.2017.1306603","Project: Massive online courses and the marketing of higher education"],"references":["290475072_HarvardX_and_MITx_Two_Years_of_Open_Online_Courses_Fall_2012-Summer_2014","286690038_Making_Sense_of_MOOCs_Musings_in_a_Maze_of_Myth_Paradox_and_Possibility","285804289_Learner_motivation_for_MOOC_registration_and_the_role_of_MOOCs_as_a_university_'taster'","284835368_Converting_freemium_customers_from_free_to_premium-the_role_of_the_perceived_premium_fit_in_the_case_of_music_as_a_service","283388098_Mindset_theory_of_action_phases","329447176_Goal_Setting_and_Goal_Striving_in_Consumer_Behavior","308165324_Content_or_platform_Why_do_students_complete_MOOCs","285635147_Competence_and_control_beliefs_Distinguishing_the_means_and_ends","284345799_Integrating_MOOC_into_traditional_higher_education_The_emerging_MOOC_30_era","283240106_MOOCs_and_Universities_Competitors_or_Partners"]}