{"id":"315758553_Approaches_to_and_the_management_of_the_audit_process_in_the_food_industry","abstract":"Purpose\n\nThe purpose of this paper is to identify the purpose of food safety auditing, effectiveness in maintaining and improving standards of food safety and ways to improve the process.\n\nDesign/methodology/approach\n\nUsing a grounded approach semi-structured interviews were held with actors with experience of food safety auditing. The aims and objectives being to obtain their viewpoints drawn from their experience.\n\nFindings\n\nThe purpose of food safety audits should be regarded as one of continuous improvement rather than a single snapshot or policing exercise. Audits in terms of cost can be excessive because of the often high number and frequency of them. Costs can be reduced and food safety standards maintained if the number and frequency of audits is determined by the level of hazard and risk that a product or a process presents. Effectiveness of audits can also be improved if they are unannounced to make businesses ?audit ready? at all times. It is also contended that unannounced audits are not applicable in all circumstances as they can increase costs by the need to maintain a group of personnel that are always available for audits.\n\nResearch limitations/implications\n\nThe research is limited by the scope and number of topics that were addressed in relation to the main subject.\n\nOriginality/value\n\nThe research value points to a need to review and better manage the audit process by risk assessing the number, frequency and type of audit a food business is subject to without lowering standards.","authors":["Richard Bradford-Knox"],"meta":["April 2017British Food Journal 119(4):759-770","DOI:10.1108/BFJ-10-2016-0484","Project: Approaches to Food Safety Management and Compliance"],"references":["290457638_Safe_and_Local_Supplier_Approval_-_A_case_study_of_the_third_party_supplier_approval_scheme_for_micro_and_small_food_businesses","286007418_Oversight_in_private_food_safety_auditing_Addressing_auditor_conflict_of_interest","256056921_Managing_the_Social_Amplification_of_Risk_A_Simulation_of_Interacting_Actors","251623124_Implementation_of_food_safety_management_systems_in_the_UK","263336259_Risk_Regulation_and_Compliance_Food_Safety_in_the_UK","257398900_Audits_and_inspections_are_never_enough_A_critique_to_enhance_food_Safety","242350356_Effective_management_of_food_safety_and_quality","236686647_Collaboration_at_Work_An_Integrative_Multilevel_Conceptualization","235298045_Assessing_compliance_with_food_safety_legislation_in_small_businesses"]}