{"id":"315739212_Cuckoo_search_algorithm_for_solving_economic_power_dispatch_problem_with_consideration_of_facts_devices","abstract":"The essential objective of an Optimal Power Flow (OPF) algorithm is to find steady state operation point which minimizes cost of generators, losses etc. while maintaining an acceptable system performance in terms of limits on generators real and reactive powers and line flow limits. Traditionally, classical optimization methods were used to effectively solve OPF. But more recently due to incorporation of FACTS devices, OPF have become complex and unfortunately these methods are not able to find an efficient solution. Recently, with the development of computer science and technology, evolutionary algorithms are used to solve optimal power flow (OPF) with FACTS devices. In this paper, research work has been carried out with an objective to applied Cuckoo Search (CS) algorithm for both power flow optimal and optimal power flow incorporating FACTS devices. To validate the performance of this algorithm, IEEE 09-bus 3-generators test case system has been used. Several optimization runs have been approved out on different cases of problem complexity with consideration of FACTS Devices (SVC and STATCOM). The results demonstrate that the proposed algorithm is an effective and practical method for the optimal power flow incorporating FACTS controllers.","authors":["Larouci Benyekhlef","Lahouaria Benasla","Abderrahim Belmadani","Rahli Mostefa"],"meta":["January 2017UPB Scientific Bulletin, Series C: Electrical Engineering 79(1)","Projects: L’optimisation énergétique d’un réseau électrique par l’intégration d’une ressource renouvelable : Cas d’étude : ADE - Adrar.Optimal management of power system with incorporation of FACTS devices"],"references":["342534265_A_Comparitive_Study_of_Economic_Load_Dispatch_Problems_Using_Classical_method_and_Artificial_Intelligence_Method","278160473_Optimal_location_of_STATCOM_using_chemical_reaction_optimization_for_reactive_power_dispatch_problem","260331759_Modified_Bat_Algorithm","234023509_An_approach_to_continuous_optimization_by_the_Intelligent_Water_Drops_algorithm","47648825_Optimal_Power_Flow_for_Large-Scale_Power_System_with_Shunt_FACTS_using_Efficient_Parallel_GA","45918028_Engineering_Optimisation_by_Cuckoo_Search","237010341_Swarm_Intelligence_and_Bio-Inspired_Computation_Theory_and_Applications","229618298_Power_flow_studies_of_a_large_practical_power_network_with_embedded_FACTS_devices_using_improved_optimal_multiplier_Newton-Raphson_method","223694785_Power_flow_modelcalculation_for_power_systems_with_multiple_FACTS_controllers","220217377_ACROA_Artificial_Chemical_Reaction_Optimization_Algorithm_for_global_optimization"]}