{"id":"315858648_The_Effects_of_Search_Task_Determinability_on_Search_Behavior","abstract":"Among the many task characteristics that influence search behaviors and outcomes, task complexity has received considerable attention. One view of task complexity is through the lens of a priori determinability—a measure of how much the searcher knows about the task outcomes, information requirements, and processes involved. In this paper, we explore a novel manipulation of a priori determinability in the context of comparative search tasks, which require comparing items (or alternatives) along different dimensions. Our manipulation involved explicitly including the items to be compared and/or the dimension by which to compare items in the search task description. We report on two user studies that investigate the effects of our manipulation on searchers’ pre-task perceptions, search behaviors and post-task outcomes. Our results found that specifying the items had an effect on searchers’ pre-task perceptions, but not their search behaviors and outcomes, and that specifying the dimension had no effect on perceptions, but made the task more difficult by possibly introducing uncertainty into the search process.","authors":["Rob Capra","Jaime Arguello","Yinglong Zhang"],"meta":["April 2017Lecture Notes in Computer Science","DOI:10.1007/978-3-319-56608-5_9","Conference: European Conference on Information Retrieval"],"references":["243768060_Task_Complexity_A_Review_and_Analysis","301377482_Development_and_Evaluation_of_Search_Tasks_for_IIR_Experiments_using_a_Cognitive_Complexity_Framework","300031387_Differences_in_the_Use_of_Search_Assistance_for_Tasks_of_Varying_Complexity","285736830_Task-based_information_searching_and_retrieval","285518205_Predicting_Search_Task_Difficulty","280184851_Untangling_search_task_complexity_and_difficulty_in_the_context_of_interactive_information_retrieval_studies","275167818_Task_Complexity_Affects_Information_Seeking_and_Use","245104165_A_Taxonomy_for_Learning_Teaching_and_Assessing_A_revision_of_Bloom''s_Taxonomy_of_Educational_Objec","239500146_Design_and_Analysis_A_Researcher''s_Handbook","222396847_Using_the_taxonomy_of_cognitive_learning_to_model_online_searching"]}