{"id":"315814318_Applicability_of_open-source_web_mapping_libraries_for_building_massive_Web_GIS_clients","abstract":"The increasing capabilities of web browsers and the growing spread of JavaScript have an impact on the development of web-based GIS systems. While in traditional Web GIS applications the client-side component is only responsible for creating representation models, modern geographically enabled JavaScript libraries have extended capabilities, making them capable of doing extensive tasks, like complex geographical analyses. This paper identifies the most capable libraries for being the basis of a Web GIS client (Cesium, Leaflet, NASA Web World Wind, OpenLayers 2, and OpenLayers 3) and compares them. The libraries are compared by their GIS feature coverage and some quality metrics. OpenLayers 3 is identified for being the most capable library by supporting nearly 60% of the examined GIS features, its small size, and moderate learning curve. For comparing the learning curves of JavaScript libraries, a new metric named Approximate Learning Curve for JavaScript is proposed, which is based on other software metrics.","authors":["Gábor Farkas"],"meta":["July 2017Journal of Geographical Systems 19(4)","DOI:10.1007/s10109-017-0248-z"],"references":["296049993_Comparison_of_Web_Mapping_Libraries_for_Building_WebGIS_Clients","283196853_The_possibilities_of_using_chosen_JQuery_JavaScript_components_in_creating_interactive_maps","272013351_Current_Trends_in_Formats_and_coordinate_Transformations_of_Geospatial_Data_-_Based_on_MyGeoData_Converter","271078599_A_Process_for_Keeping_Pace_with_Evolving_Web_Mapping_Technologies","319871583_Constraint_Databases_Spatial","307955152_Constraint_Databases_Spatial","290187454_Geographical_Information_Systems_-_Applications_to_Soils","279868125_An_overview_and_definition_of_GIS","274757862_Technique_of_Javascript_Code_Obfuscation_Based_on_Control_Flow_Tansformations","271528890_Refactoring_Improving_the_Design_of_Existing_Code"]}