{"id":"315822865_All_planetesimals_born_near_the_Kuiper_Belt_formed_as_binaries","abstract":"The cold classical Kuiper belt objects have low inclinations and eccentricities1,2 and are the only Kuiper belt population suspected to have formed in situ3. Compared with the dynamically excited populations, which exhibit a broad range of colours and a low binary fraction of ∼10%4 cold classical Kuiper belt objects typically have red optical colours5 with ∼30% of the population found in binary pairs6; the origin of these differences remains unclear7,8. We report the detection of a population of blue-coloured, tenuously bound binaries residing among the cold classical Kuiper belt objects. Here we show that widely separated binaries could have survived push-out into the cold classical region during the early phases of Neptune’s migration9. The blue binaries may be contaminants, originating at ∼38 au, and could provide a unique probe of the formative conditions in a region now nearly devoid of objects. The idea that the blue objects, which are predominantly binary, are the products of push-out requires that the planetesimals formed entirely as multiples. Plausible formation routes include planetesimal formation via pebble accretion10 and subsequent binary production through dynamic friction11 and binary formation during the collapse of a cloud of solids12.","authors":["Wesley C. Fraser","Michele T. Bannister","Rosemary E. Pike","Michael Marsset"],"meta":["April 2017Nature Astronomy 1(4):0088","DOI:10.1038/s41550-017-0088"],"references":["287157327_Dynamical_and_collisional_evolution_of_Kuiper_belt_binaries","283762101_The_Outer_Solar_System_Origins_Survey_I_Design_and_First-Quarter_Discoveries","278969533_Jumping_Neptune_Can_Explain_the_Kuiper_Belt_Kernel","272423222_Reanalyzing_the_visible_colors_of_Centaurs_and_KBOs_What_is_there_and_what_we_might_be_missing","301879427_TRIPPy_Trailed_Image_Photometry_in_Python","301872612_Neptune's_Orbital_Migration_Was_Grainy_Not_Smooth","292193151_The_Eleventh_and_Twelfth_Data_Releases_of_the_Sloan_Digital_Sky_Survey_Final_Data_from_SDSS-III","282691758_Forming_the_Cold_Classical_Kuiper_Belt_in_a_light_Disk","278478234_MegaCam_the_new_Canada-France-Hawaii_Telescope_wide-field_imaging_camera","272845697_The_Hubble_Wide_Field_Camera_3_Test_of_Surfaces_in_the_Outer_Solar_System_Spectral_Variation_on_Kuiper_Belt_Objects"]}