{"id":"315889937_Garbled_Quantum_Computation","abstract":"The universal blind quantum computation protocol (UBQC) enables an almost classical client to delegate a quantum computation to an untrusted quantum server (in the form of a garbled quantum circuit) while the security for the client is unconditional. In this contribution, we explore the possibility of extending the verifiable UBQC, to achieve further functionalities following the analogous research for classical circuits (Yao 1986). First, exploring the asymmetric nature of UBQC (the client preparing only single qubits, while the server runs the entire quantum computation), we present a “Yao”-type protocol for secure two-party quantum computation. Similar to the classical setting, our quantum Yao protocol is secure against a specious (quantum honest-but-curious) garbler, but in our case, against a (fully) malicious evaluator. Unlike the previous work on quantum two-party computation of Dupuis et al., 2010, we do not require any online-quantum communication between the garbler and the evaluator and, thus, no extra cryptographic primitive. This feature will allow us to construct a simple universal one-time compiler for any quantum computation using one-time memory, in a similar way to the classical work of Goldwasser et al., 2008, while more efficiently than the previous work of Broadbent et al., 2013.","authors":["Elham Kashefi","Petros Wallden"],"meta":["April 2017Cryptography 1(1):6","DOI:10.3390/cryptography1010006"],"references":["302750457_One-time_programs","301879111_Quantum_homomorphic_encryption_for_polynomial-size_circuits","288060142_Rigidity_of_quantum_steering_and_one-sided_device-independent_verifiable_quantum_computation","283279679_Optimised_resource_construction_for_verifiable_quantum_computation","283117937_Quantum_Cryptography_Beyond_Quantum_Key_Distribution","314837821_The_Quantum_Cut-and-Choose_Technique_and_Quantum_Two-Party_Computation","305472505_Quantum_Homomorphic_Encryption_for_Polynomial-Sized_Circuits","304589485_Blind_Multiparty_Quantum_Computing","301880644_Blind_quantum_computing_with_two_almost_identical_states","301847843_On_Quantum_Obfuscation"]}