{"id":"315823440_The_Theory_of_Committees_and_Elections","abstract":"I The Theory of Committees and Elections.- I. A Committee and Motions.- II. Independent Valuation.- III. Can a Motion be Represented by the same Symbol on Different Schedules?.- IV. A Committee using a Simple Majority: Single-peaked Preference Curves.- V. A Committee using a Simple Majority: other Shapes of Preference Curves.- 1. Curves either single-peaked or single-peaked with a plateau on top.- 2. Other classes of curves.- VI. A Committee using a Simple Majority: any Shapes of Preference Curves, Number of Motions Finite.- VII. Cyclical Majorities.- VIII. When the Ordinary Committee Procedure is in use the Members' Scales of Valuation may be Incomplete.- IX. Which Candidate ought to be Elected?.- X. Examination of some Methods of Election in Single-member Constituencies.- XI. Proportional Representation.- XII. The Decisions of a Committee using a Special Majority.- 1. When the members' preference curves are single-peaked.- 2. When the members' preference curves are subject to no restriction.- XIII. The Elasticity of Committee Decisions with an Altering Size of Majority.- 1. When the members' preference curves are single-peaked.- 2. When the members' preference curves are subject to no restriction.- XIV. The Elasticity of Committee Decisions with Alterations in the Members' Preference Schedules.- 1. When the members' preference curves are single-peaked.- 2. When the members' preference curves are subject to no restriction.- XV. The Converse Problem: the Group of Schedules to Correspond to a Given Voting Matrix.- XVI. A Committee using a Simple Majority: Complementary Motions.- XVII. International Agreements, Sovereignty and the Cabinet.- II History of the Mathematical Theory of Committees and Elections (Excluding Proportional Representation).- XVIII. Borda, Condorcet and Laplace.- 1. Jean-Charles de Borda (1733-1799).- 2. Marie Jean Antoine Nicolas Caritat, Marquis de Condorcet (1743-1794).- 3. Pierre-Simon, Marquis de Laplace (1749-1827).- 4. Conclusions.- XIX. E. J. Nanson and Francis Galton.- XX. The Circumstances in which Rev. C. L. Dodgson (Lewis Carroll) wrote his Three Pamphlets.- Appendix. Text of Dodgson's Three Pamphlets and of 'The Cyclostyled Sheet'.- A Discussion of the Various Methods of Procedure in Conducting Elections (1873).- Suggestions as to the Best Method of Taking Votes, Where More than Two Issues are to be Voted on (1874).- A Method of Taking Votes on More than Two Issues (1876) 'The Cyclostyled Sheet' (7 Dec. 1877).- Notes on Dodgson's Third Pamphlet 'A Method...' (1876).","authors":["Duncan Black"],"meta":["January 1986","DOI:10.1007/978-94-009-4225-7","ISBN: 978-94-010-8375-1"],"references":[]}