{"id":"315813453_New_Concepts_of_Fuzzy_Labeling_Graphs","abstract":"Theoretical concepts of graphs are highly utilized by computer science applications. Especially in research areas of computer science such as data mining, image segmentation, clustering, image capturing and networking. Fuzzy labeling models yield more precision, flexibility, and compatibility to the system compared to the classical and fuzzy models. They have many applications in physics, chemistry, computer science, and other branches of mathematics. The property of the distance in a graph is one of the favorite problems in mathematics. Distances in fuzzy labeling graphs have interesting applications. One such application is to uniquely locate the position of a vertex in a network using distances. Hence, in this paper, we discuss four distances which are a metric in fuzzy labeling graphs, namely w-distance \\(d_w\\), strong geodesic distance \\(d_{ sg}\\), strongest strong distance \\(d_{ ss}\\) and \\(\\delta \\)-distance. They are all different metrics in fuzzy labeling graphs. When strength of connectedness between every pair of vertices u and v in G equals the membership value of the edge (u, v), G becomes self-centered with respect to the metrics \\(d_w\\), \\(d_{ sg}\\), and \\(d_{ ss}\\). Also, it is proved that every connected fuzzy labeling graph is ss-self centered as well as self centered. Finally, we give some applications of distance in the fuzzy labeling graphs.","authors":["Hossein Rashmanlou","Rajabali Borzooei"],"meta":["December 2017International Journal of Applied and Computational Mathematics 3(Suppl 1)","DOI:10.1007/s40819-017-0348-y","Project: Fuzzy Social Networks"],"references":["301851029_Irregular_Bipolar_Fuzzy_Graphs","289951972_A_Study_on_Fuzzy_Labeling_Graphs","285580973_New_Concepts_of_Vague_Graphs","323080364_m-polar_fuzzy_graphs_and_m-polar_fuzzy_line_graphs","298729380_An_algorithm_for_computing_certain_metrics_in_intuitionistic_fuzzy_graphs","291831832_Degree_and_total_degree_of_edges_in_Bipolar_Fuzzy_Graphs_With_Application","291629985_Semi_Global_Domination_Sets_in_Vague_Graphs_with_Application","291608143_Regularity_of_Vague_Graphs","289549941_Metric_aspects_of_N_-graphs","285264036_Fuzzy_Graphs_Fuzzy_Sets_and_their_Applications","281399313_Degree_of_vertices_in_vague_graphs","281336888_Domination_in_vague_graphs_and_its_applications","280067009_Complete_interval-valued_fuzzy_graphs","279447919_A_study_on_bipolar_fuzzy_graphs","282765879_More_Results_on_Vague_Graphs"]}