{"id":"315835538_Optimizing_Adiabatic_Quantum_Program_Compilation_using_a_Graph-Theoretic_Framework","abstract":"Adiabatic quantum computing has evolved in recent years from a theoretical field into an immensely practical area, a change partially sparked by D-Wave System's quantum annealing hardware. These multimillion-dollar quantum annealers offer the potential to solve optimization problems millions of times faster than classical heuristics, prompting researchers at Google, NASA and Lockheed Martin to study how these computers can be applied to complex real-world problems such as NASA rover missions. Unfortunately, compiling (embedding) an optimization problem into the annealing hardware is itself a difficult optimization problem and a major bottleneck currently preventing widespread adoption. Additionally, while finding a single embedding is difficult, no generalized method is known for tuning embeddings to use minimal hardware resources. To address these barriers, we introduce a graph-theoretic framework for developing structured embedding algorithms. Using this framework, we introduce a biclique virtual hardware layer to provide a simplified interface to the physical hardware. Additionally, we exploit bipartite structure in quantum programs using odd cycle transversal (OCT) decompositions. By coupling an OCT-based embedding algorithm with new, generalized reduction methods, we develop a new baseline for embedding a wide range of optimization problems into fault-free D-Wave annealing hardware. To encourage the reuse and extension of these techniques, we provide an implementation of the framework and embedding algorithms.","authors":["Timothy Goodrich","Blair D. Sullivan","Travis Humble"],"meta":["April 2018Quantum Information Processing 17(5)","DOI:10.1007/s11128-018-1863-4"],"references":["312492362_Quantum_Annealing_amid_Local_Ruggedness_and_Global_Frustration","311842097_Identifying_the_minor_set_cover_of_dense_connected_bipartite_graphs_via_random_matching_edge_sets","304858061_Performance_Models_for_Split-execution_Computing_Systems","286301759_What_is_the_Computational_Value_of_Finite_Range_Tunneling","283986574_High-Performance_Computing_with_Quantum_Processing_Units","310911776_A_case_study_in_programming_a_quantum_annealer_for_hard_operational_planning_problems","305871716_Performance_Models_for_Split-Execution_Computing_Systems","291265768_Extremal_Graph_Theory","287680005_Subexponential_parameterized_ODD_CYCLE_TRANSVERSAL_on_planar_graphs","284674055_On_the_Evolution_of_Random_Graphs","280221097_Fast_clique_minor_generation_in_Chimera_qubit_connectivity_graphs","263856036_A_case_study_in_programming_a_quantum_annealer_for_hard_operational_planning_problems","273798010_Graph_Theory","269268166_Ollivier-Ricci_curvature_and_fast_approximation_to_tree-width_in_embeddability_of_QUBO_problems","265435677_Graph_minors_XIII_The_disjoint_paths_problem"]}