{"id":"315871857_Fairness_Beyond_Disparate_Treatment_Disparate_Impact_Learning_Classification_without_Disparate_Mistreatment","abstract":"Automated data-driven decision making systems are increasingly being used to assist, or even replace humans in many settings. These systems function by learning from historical decisions, often taken by humans. In order to maximize the utility of these systems (or, classifiers), their training involves minimizing the errors (or, misclassifications) over the given historical data. However, it is quite possible that the optimally trained classifier makes decisions for people belonging to different social groups with different misclassification rates (e.g., misclassification rates for females are higher than for males), thereby placing these groups at an unfair disadvantage. To account for and avoid such unfairness, in this paper, we introduce a new notion of unfairness, disparate mistreatment, which is defined in terms of misclassification rates. We then propose intuitive measures of disparate mistreatment for decision boundary-based classifiers, which can be easily incorporated into their formulation as convex-concave constraints. Experiments on synthetic as well as real world datasets show that our methodology is effective at avoiding disparate mistreatment, often at a small cost in terms of accuracy.","authors":["Muhammad Bilal Zafar","Isabel Valera","Manuel Gomez Rodriguez","Krishna P. Gummadi"],"meta":["April 2017","DOI:10.1145/3038912.3052660","Conference: the 26th International Conference"],"references":["308327297_Inherent_Trade-Offs_in_the_Fair_Determination_of_Risk_Scores","306032039_False_Positives_False_Negatives_and_False_Analyses_A_Rejoinder_to_Machine_Bias_There's_Software_Used_Across_the_Country_to_Predict_Future_Criminals_And_it's_Biased_Against_Blacks","301876107_Disciplined_Convex-Concave_Programming","323983704_Big_Data's_Disparate_Impact","315040087_Precinct_or_Prejudice_Understanding_Racial_Disparities_in_New_York_City's_Stop-and-Frisk_Policy","314153531_Fair_prediction_with_disparate_impact_A_study_of_bias_in_recidivism_prediction_instruments","312263253_Disciplined_convex-concave_programming","309402975_Fair_Prediction_with_Disparate_Impact_A_Study_of_Bias_in_Recidivism_Prediction_Instruments","308980568_Equality_of_Opportunity_in_Supervised_Learning","304476559_Satisfying_Real-world_Goals_with_Dataset_Constraints"]}