{"id":"315838176_RORPO_A_morphological_framework_for_curvilinear_structure_analysis_Application_to_the_filtering_and_segmentation_of_blood_vessels","abstract":"The analysis of curvilinear structures in 3D images is a complex and challenging task. Curvilinear structures are thin, easily corrupted by noise, and can have a complex geometry. Despite the numerous applications in material science, remote sensing and medical imaging, and the large number of dedicated methods developed the last few years, the detection of such structures remains a difficult problem. In this work, we provide an analysis of curvilinear structures. We first propose a new framework called RORPO to characterize such structures via two features: an intensity feature, which preserves the intensity of curvilinear structures while decreasing the intensity of other structures; and a directional feature, providing at each point the direction of the curvilinear structure. RORPO, unlike state-of-the art methods, is a non-local and non-linear framework that is better adapted to the intrinsic anisotropy of curvilinear structures. RORPO is based on recent advances in Mathematical Morphology: the path operators. We provide a full description of the structural and algorithmic details of RORPO, and we also conduct a quantitative comparative study of our features with three popular curvilinear structure analysis filters: the Frangi Vesselness, the Optimally Oriented Flux, and the Hybrid Diffusion with Continuous Switch. Besides the straightforward filtering applications, both RORPO features can be used as priors to characterize curvilinear structures. We propose a regularization term for variational segmentation which embeds these features. Classical regularization terms are not adapted to curvilinear structures, and usually lead to the loss of most of the low contrasted ones. Based on the RORPO features, we propose to only regularize curvilinear structures along their main axis. This directional regularization better preserves curvilinear structures but also reconnects some of the parts of these structures that may have been disconnected by noise. We present results of the segmentation of retinal images with the Chan et al. model either with the classical total variation or with our directional regularization term. This confirms that our regularization term is better suited for images with curvilinear structures.","authors":["Odyssée Merveille"],"meta":["November 2016"],"references":[]}