{"id":"315882114_Citation_function_polarity_and_influence_classification","abstract":"Current methods for assessing the impact of authors and scientific media employ tools such as H-Index, Co-Citation and PageRank. These tools are primarily based on citation counting, which considers all citations to be equal. This type of methods can produce perverse incentives to publish controversial or incomplete papers, as mixed or negative reviews often generate larger citation counts and better indexes, regardless of whether the citations were critical or exerted minimal influence on the citing document. Passing citations that are employed to establish background, which do not have a real impact on the citing paper, are common in scientific literature. However, these citations have equal weight in impact evaluations. Notable researchers have emphasized the need to correct this situation by developing estimation methods that consider the different roles of quotations in citing papers. To accomplish this type of evaluation, a context citation analysis should be applied to determine the nature of the citations. We propose that citations should be categorized using four dimensions – FUNCTION, POLARITY, ASPECTS and INFLUENCE – as these dimensions provide adequate information that can be employed toward the generation of a qualitative method to measure the impact of a given publication in a citing paper. In this paper, we used interchangeably the words influence and impact. We present a method for obtaining this information using our proposed classification scheme and manually annotated corpus, which is marked with meaningful keywords and labels to help identify the characteristics or properties that constitute what we call ASPECTS. We develop a classification scheme which considers purpose definition shared by previous works. Our contribution is to abstract purpose classes from several other schemes and divide a complex structure in more manageable parts, to attain a simple system that combines low granularity dimensions but nevertheless produces a fine-grained classification. For annotators, the classification process is simple because in a first step, the coders distinguish only four primary classes, and in a second pass, they add the information contained in ASPECTS keyword and labels to obtain the more specific functions. This way, we gain a high granularity labeling that gives enough information about the citations to characterize and classify them, and we achieve this detailed coding with a straightforward process where the level of human error could be minimized.","authors":["Myriam Hernandez Alvarez","José Manuel Gómez","Patricio Martinez-Barco"],"meta":["April 2017Natural Language Engineering 23(4):1-28","DOI:10.1017/S1351324916000346"],"references":["290219000_Predicting_the_impact_of_scientific_concepts_using_full-text_features","282109036_Survey_about_Citation_Content_Analysis_Tasks_Techniques_and_Resources","282107600_Esquema_de_anotacion_para_categorizacion_de_citas_en_bibliografia_cientifica","312538118_Support-vector_networks","307631671_The_pagerank_citation_ranking_Bringing_order_to_the_web","290535380_Contrasting_and_corroborating_citations_in_journal_articles","290231979_Towards_fine-grained_citation_function_classification","275371833_Reliability_in_Content_Analysis_Some_Common_Misconceptions_and_Recommendations","270877532_Towards_a_Generic_and_Flexible_Citation_Classifier_Based_on_a_Faceted_Classification_Scheme","270150410_Genre_Analysis_English_in_Academic_and_Research_Settings"]}