{"id":"315807637_Pest_Detection_and_Recognition_in_Rice_Crop_Using_SVM_in_Approach_of_Bag-Of-Words","abstract":"In Odisha Rice is synonymous with food; agriculture in Odisha to a considerable extent means growing Rice. Rice covers 69 % of cultivated area and is the major crop covering about 63% of total area under food grains. It is the staple food of almost entire population of Odisha; therefore the state economy is directly affected by the improvement in production and productivity in the State. In Agriculture in Odisha is aimed towards the increase of productivity and food quality at reduced expenditure and with increase profit. The technique of image processing is extensible applied to agriculture science and it has great prospective especially in the plant protection field, which alternatively leads to pest control. This paper offers a technique to classify pest of Rice crop using SVM classifier though the bag-of-word approach. Images of five classes of pest of Rice crop were collected from Google images and images provided in Manual for Rice Pest Surveillance provided by, Indian Council of Agricultural research.SVM classifier detects the pest and the classification of the pest based on the features with an accuracy of 97.5%.","authors":["Prabira kumar Sethy","Chinmaya Bhoi","Nalini Kanta Barpanda","Shwetapadma Panda"],"meta":["April 2017","Conference: ICCSP 2017At: MELMARUVATHUR TAMIL NADU"],"references":["275155897_Pest_Detection_and_Control_Techniques_Using_Wireless_Sensor_Network_A_Review","271297009_Image_Classification_of_Paddy_Field_Insect_Pests_Using_Gradient-Based_Features","255483247_Automatic_plant_pest_detection_recognition_using_k-means_clustering_algorithm_correspondence_filters","314539823_Detection_and_Classification_of_Pests_in_Greenhouse_Using_Image_Processing","285634765_Detection_and_classification_of_pests_in_greenhouse_using_image_processing","285089885_Automatic_identification_of_whiteflies_aphids_and_thrips_in_greenhouse_based_on_image_analysis"]}