{"id":"315886590_Underwater_Robot_Task_Planning_Using_Multi-Objective_Meta-Heuristics","abstract":"Robotics deployed in the underwater medium are subject to stringent operational conditions that impose a high degree of criticality on the allocation of resources and the schedule of operations in mission planning. In this context the so-called cost of a mission must be considered as an additional criterion when designing optimal task schedules within the mission at hand. Such a cost can be conceived as the impact of the mission on the robotic resources themselves, which range from the consumption of battery to other negative effects such as mechanic erosion. This manuscript focuses on this issue by devising three heuristic solvers aimed at efficiently scheduling tasks in robotic swarms, which collaborate together to accomplish a mission, and by presenting experimental results obtained over realistic scenarios in the underwater environment. The heuristic techniques resort to a Random-Keys encoding strategy to represent the allocation of robots to tasks and the relative execution order of such tasks within the schedule of certain robots. The obtained results reveal interesting differences in terms of Pareto optimality and spread between the algorithms considered in the benchmark, which are insightful for the selection of a proper task scheduler in real underwater campaigns.","authors":["Itziar Landa-Torres","Diana Manjarres","Sonia Bilbao","Javier Del Ser"],"meta":["April 2017Sensors 17(4):762","DOI:10.3390/s17040762","Projects: SWARMsSWARMS"],"references":["308953674_Ant_Colony_Optimization","302520199_Tabu_search_effective_strategies_for_hard_problems_in_analytics_and_computational_science","317219370_A_fast_elitist_non-dominated_sorting_genetic_algorithm_for_multi-objective_optimization_NSGA-II","312601257_Classifier_Systems_and_Genetic_Algorithms","309762005_A_fast_elitist_non-dominated_sorting_genetic_algorithm_for_multi-objective_Optimization_NSGA-II","308848846_Multi-robot_task_scheduling_and_routing_using_neuro-fuzzy_control","308734919_Multi-agent_approach_for_task_allocation_and_scheduling_in_cooperative_heterogeneous_multi-robot_team_Simulation_results","306114130_NSGA-II_for_slab_selecting_and_reheating_furnace_scheduling_in_hot_rolling_production","300469964_Maximizing_Availability_and_Minimizing_Markesan_for_Task_Scheduling_in_Grid_Computing_Using_NSGA_II","299405923_A_hybrid_multi-objective_evolutionary_algorithm_based_on_NSGA-II_for_practical_scheduling_with_release_times_in_steel_plants"]}