{"id":"315800030_El_contexto_elemento_de_analisis_para_ensenar_The_context_an_element_of_analysis_for_teaching","abstract":"Este documento presenta un estudio analítico sobre el contexto como un elemento valioso al momento de pensar la actividad docente.\nEl acto de aula demanda la puesta en marcha de dinámicas que no deben estar aisladas del entorno en que ella se desarrolla. Se presenta aquí un análisis a una asignatura del Programa de Ingeniería de Sistemas de\nLa Universidad de La Guajira, Modelos, en la que se describe qué aspectos son valiosos para el análisis del entorno que rodea el abordaje de la asignatura. Se muestra desde referentes conceptuales como el análisis\ndel contexto puede significar un elemento diferenciador para el diseño de la enseñanza.\nEl análisis que se hace está asociado a la ubicación de la asignatura en el plan curricular, políticas y entorno institucional, la estructura administrativa docente y la misma práctica docente, los que son presentados desde la especificidad de elementos que se circunscribieron a ellos. Las conclusiones que se derivaron del estudio, validan el pensamiento de Masjuan, Elias, y Troiano, sobre la importancia que se le debe otorgar\nal contexto como elemento a tener en cuenta para el desarrollo de la práctica docente. Las recomendaciones que se incluyen, que se pretende se conviertan en una apuesta para la comunidad docente, están soportados desde\nel pensamiento freireano de la Pedagogía de la Autonomía.\n\nPalabras claves: contexto, ambiente de enseñanza, respeto, aprender\nThis paper presents an analytical study on the context as a valuable element when thinking about teaching. The act of classroom demands the implementation of dynamics that should not be isolated\nfrom the environment in which it develops. The analysis to the subject Models of\nthe Computer Science Program of Universidad of La Guajira, describes the valuable aspects for the analysis of the environemnt surrounding the way the subject is managed. It is shown from the analysis concerning conceptual context can mean a differentiating element for design teaching. The analysis provided is associated with\nthe location of the subject in the curriculum, policies and institutional environment, the teaching management structure, and the very teaching practice, which are presented from the specificity of items that were limited to them. The conclusions drawn from the study validate Masjuan thinking, Elias, and Troiano, about the importance that must\nbe given to the context as an element to be considered for the development of teaching practice. The recommendations included intended to become a bet for the teaching community, are supported from the Freirean Thinking Pedagogy of Autonomy.\n\nKeywords: context, learning environment, respect, learn.","authors":["Marlin Aarón"],"meta":["April 2017","Project: Sistematización de mi práctica pedagógica"],"references":["266460544_PEDAGOGIA_DE_LA_AUTONOMIA"]}