{"id":"315897674_Entrepreneurial_intention_among_engineering_students_The_role_of_entrepreneurship_education","abstract":"Partly due to the current crisis and its high unemployment rates, the labor market increasingly requires multidisciplinary engineers with additional skills to their own. Engineering education therefore faces new challenges and these include equipping engineers with greater entrepreneurship. Although entrepreneurship education has consequently been integrated into the new engineering degrees, is this enough to boost entrepreneurship among engineers and on what does their level of entrepreneurship depend?\nThis research work aims to analyze the impact of entrepreneurial motivations on entrepreneurial intentions among future engineers and identify the role than entrepreneurship education plays in the development of the engineers’ entrepreneurship. The results indicate that the need for independence is the key factor in the entrepreneurial intent of future engineers and confirm the positive contribution that entrepreneurship education has on their entrepreneurial intentions. Finally, recommendations are offered which could help the various agents involved increase the effectiveness of actions aimed at promoting firm creation in this area.","authors":["Virginia Barba-Sánchez","Carlos Atienza-Sahuquillo"],"meta":["January 2018European Research on Management and Business Economics 24(1):53-61","DOI:10.1016/j.iedeen.2017.04.001","Projects: Entrepreneurship EducationThe development of Entrepreneneurship at School"],"references":["315113978_Entrepreneurial_motivation_and_self-employment_evidence_from_expectancy_theory","282173285_Self-employment_and_subjective_well-being_A_multi-country_analysis","330634325_Assessing_the_Impact_of_Entrepreneurship_Education_Programmes_A_New_Methodology","317953663_Self-Efficacy_Toward_a_Unifying_Theory_of_Behavioral_Change","314889672_Does_Self-Employment_Reduce_Unemployment","312967656_Implementing_entrepreneurial_ideas_The_case_for_intentions","310842441_Social_dimensions_of_entrepreneurship","289066201_Introduction_to_Mediation_Moderation_and_Conditional_Process_Analysis_A_Regression-Based_Approach","282269425_Empherical_study_on_the_relationship_between_entrepreneurial_mindset_and_the_factors_affecting_intrapreneurship_A_study_in_Indian_context","280177961_Attitudes_towards_entrepreneurship_education_a_comparative_analysis"]}