{"id":"315956790_COMUNICACAO_INFORMACAO_E_COMPUTACAO_experiencias_interdisciplinares_no_ensino_pesquisa_e_extensao","abstract":"RESUMO Este capítulo refl ete sobre a prática pedagógica na relação de Comunicação, Informação e Computação, a partir da perspectiva de experimentação interdisciplinar no ensino, pesquisa e extensão, na Universidade de Brasília, desde o segundo semestre de 2015 e envolve professores e estudantes dos três campos do conhecimento. Esta pesquisa aplicada é a base e foi orientada para o desenvolvimento em três espaços e temas diferentes: o Centro de Documentação da Faculdade de Comunicação (FAC) da Universidade de Brasília, na organização e manutenção do acervo fruto da produção de conhecimento na instituição; o projeto de extensão na periferia de Brasília nas cidades de Paranoá, Itapoã, para formar pessoas para o uso de dispositivos móveis na comunicação e informação; no trabalho de acompanhamento de alunos na disciplina Jornalismo em Ambientes Digitais, para a apresentação de propostas de produção, e workfl ow na redação do jornal-laboratório digital da FAC. Nesse sentido, são abordados os temas relacionados com as questões de mediação e intermediação da comunicação na pós-modernidade, a necessidade de relações transdisciplinares para lidar com a complexidade desse novo cenário de vida e que implica a busca de denominadores comuns de conceitos entre os três campos. Também há necessidade de compreensão da websemântica como parte do processo de produção coletiva e colaborativa do conhecimento em ambientes digitais que se constroem por meio da linguagem algorítmica. Palavras-chave: Transdisciplinaridade. Ciência da Computação. Comunicação. Ciência da Informação. Linguagem algorítmica. Websemântica.","authors":["Marcia Marques","Benedito Medeiros Neto"],"meta":["March 2017","Project: 1- SEMANTIC WEB THE WORKING COMMUNICATION CONTENT"],"references":["286013145_Ciencia_y_Sociedad_Ganhos_e_obstaculos_na_formacao_de_tutores_universitarios_e_lideres_comunitarios_para_mediadores_no_Paranoa_e_ItapoaDFBrasil","282649552_Handbook_of_Research_on_Comparative_Approaches_to_the_Digital_Age_Revolution_in_Europe_and_the_Americas","281861978_Rede_Social_de_Tutores_de_Comunidade_Em_Estado_De_Vulnerabilidade_Social_Nos_Aspectos_De_Comunicacao_E_Tecnologia_Da_Informacao","269780058_What_is_the_future_of_mobile_learning_in_education","221705718_BECKER_Maria_Lucia_Inclusao_digital_e_cidadania_as_possibilidades_e_as_ilusoes_da_solucao_tecnologica","44416140_Por_uma_outra_globalizacao_de_pensamemto_unico_a_consciencia_universal_Milton_Santos"]}