{"id":"315958339_From_static_to_temporal_network_theory_Applications_to_functional_brain_connectivity","abstract":"Network neuroscience has become an established paradigm to tackle questions related to the functional and structural connectome of the brain. Recently, interest has been growing in examining the temporal dynamics of the brain’s network activity. Although different approaches to capturing fluctuations in brain connectivity have been proposed, there have been few attempts to quantify these fluctuations using temporal network theory. This theory is an extension of network theory that has been successfully applied to the modeling of dynamic processes in economics, social sciences, and engineering article but it has not been adopted to a great extent within network neuroscience. The objective of this article is twofold: (i) to present a detailed description of the central tenets of temporal network theory and describe its measures, and; (ii) to apply these measures to a resting-state fMRI dataset to illustrate their utility. Furthermore, we discuss the interpretation of temporal network theory in the context of the dynamic functional brain connectome. All the temporal network measures and plotting functions described in this article are freely available as the Python package Teneto. Temporal network theory is a subfield of network theory that has had limited application to date within network neuroscience. The aims of this work are to introduce temporal network theory, define the metrics relevant to the context of network neuroscience, and illustrate their potential by analyzing a resting-state fMRI dataset. We found both between-subjects and between-task differences that illustrate the potential for these tools to be applied in a wider context. Our tools for analyzing temporal networks have been released in a Python package called Teneto.","authors":["William Hedley Thompson","Per Brantefors","Peter Fransson"],"meta":["April 2017Network Neuroscience 1(2):1-56","DOI:10.1162/NETN_a_00011","Project: Teneto: temporal network tools for quantifying dynamic functional connectivity "],"references":["344636802_Top-down_beta_enhances_bottom-up_gamma","311718801_Bursty_properties_revealed_in_large-scale_brain_networks_with_a_point-based_method_for_dynamic_functional_connectivity","308899886_A_Guide_to_Temporal_Networks","304641283_Individual_Differences_in_Dynamic_Functional_Brain_Connectivity_Across_the_Human_Lifespan","302779143_Functional_resting-state_fMRI_connectivity_correlates_with_serum_levels_of_the_S100B_protein_in_the_acute_phase_of_traumatic_brain_injury","296573157_On_Stabilizing_the_Variance_of_Dynamic_Functional_Brain_Connectivity_Time_Series","345814882_Top-Down_Beta_Oscillatory_Signaling_Conveys_Behavioral_Context_to_Primary_Visual_Cortex","307600676_On_the_stability_of_BOLD_fMRI_correlations","304541637_Rhythms_of_the_Brain","292345626_Metastability_and_Coherence_Extending_the_Communication_through_Coherence_Hypothesis_Using_A_Whole-Brain_Computational_Perspective"]}