{"id":"315929128_Modeling_and_Density_Estimation_of_an_Urban_Freeway_Network_Based_on_Dynamic_Graph_Hybrid_Automata","abstract":"In this paper, in order to describe complex network systems, we firstly propose a general modeling framework by combining a dynamic graph with hybrid automata and thus name it Dynamic Graph Hybrid Automata (DGHA). Then we apply this framework to model traffic flow over an urban freeway network by embedding the Cell Transmission Model (CTM) into the DGHA. With a modeling procedure, we adopt a dual digraph of road network structure to describe the road topology, use linear hybrid automata to describe multi-modes of dynamic densities in road segments and transform the nonlinear expressions of the transmitted traffic flow between two road segments into piecewise linear functions in terms of multi-mode switchings. This modeling procedure is modularized and rule-based, and thus is easily-extensible with the help of a combination algorithm for the dynamics of traffic flow. It can describe the dynamics of traffic flow over an urban freeway network with arbitrary topology structures and sizes. Next we analyze mode types and number in the model of the whole freeway network, and deduce a Piecewise Affine Linear System (PWALS) model. Furthermore, based on the PWALS model, a multi-mode switched state observer is designed to estimate the traffic densities of the freeway network, where a set of observer gain matrices are computed by using the Lyapunov function approach. As an example, we utilize the PWALS model and the corresponding switched state observer to traffic flow over Beijing third ring road. In order to clearly interpret the principle of the proposed method and avoid computational complexity, we adopt a simplified version of Beijing third ring road. Practical application for a large-scale road network will be implemented by decentralized modeling approach and distributed observer designing in the future research.","authors":["Yangzhou Chen","Yuqi Guo","Ying Wang"],"meta":["March 2017Sensors 17(4):716","DOI:10.3390/s17040716"],"references":["308856642_Dynamic_Graph_Hybrid_Automata_A_Modeling_Method_for_Traffic_Network","285599036_A_Dynamic_Network_Modeling-Based_Approach_for_Traffic_Observability_Problem","276382022_Feedback-Coordinated_Ramp_Control_of_Consecutive_On-Ramps_Using_Distributed_Modeling_and_Godunov-Based_Satisfiable_Allocation","313756272_Real-time_estimation_of_vehicle-count_within_signalized_links","313568658_The_cell_transmission_model_Part_II_Network_traffic","313219920_The_theory_of_hybrid_automata","304294474_Modeling_freeway_network_by_using_dynamic_graph_hybrid_automata_and_estimating_its_states_by_designing_state_observer","293341698_An_optimal_control_method_for_hybrid_systems_based_on_Q-learning_for_an_intersection_traffic_signal_control","285680823_The_cell_transmission_model_A_dynamic_representation_of_highway_traffic_consistent_with_the_hydrodynamic_theory","279904542_Modeling_and_reachability_analysis_for_single_intersection_based_on_rectangular_hybrid_automata"]}