{"id":"315913147_Measuring_discrimination_in_algorithmic_decision_making","abstract":"Society is increasingly relying on data-driven predictive models for automated decision making. This is not by design, but due to the nature and noisiness of observational data, such models may systematically disadvantage people belonging to certain categories or groups, instead of relying solely on individual merits. This may happen even if the computing process is fair and well-intentioned. Discrimination-aware data mining studies of how to make predictive models free from discrimination, when the historical data, on which they are built, may be biased, incomplete, or even contain past discriminatory decisions. Discrimination-aware data mining is an emerging research discipline, and there is no firm consensus yet of how to measure the performance of algorithms. The goal of this survey is to review various discrimination measures that have been used, analytically and computationally analyze their performance, and highlight implications of using one or another measure. We also describe measures from other disciplines, which have not been used for measuring discrimination, but potentially could be suitable for this purpose. This survey is primarily intended for researchers in data mining and machine learning as a step towards producing a unifying view of performance criteria when developing new algorithms for non-discriminatory predictive modeling. In addition, practitioners and policy makers could use this study when diagnosing potential discrimination by predictive models.","authors":["Indre Zliobaite"],"meta":["July 2017Data Mining and Knowledge Discovery 31(2):1-30","DOI:10.1007/s10618-017-0506-1"],"references":["329829847_Deep_One-Class_Classification","321596991_Discrimination_and_Privacy_in_the_Information_Society_Data_Mining_and_Profiling_in_Large_Databases","308327297_Inherent_Trade-Offs_in_the_Fair_Determination_of_Risk_Scores","306228544_Situation_Testing-Based_Discrimination_Discovery_A_Causal_Inference_Approach","325748511_Inherent_Trade-Offs_in_Algorithmic_Fairness","323983704_Big_Data's_Disparate_Impact","319442102_The_theory_of_discrimination","316511612_Prediction_with_Model-based_Neutrality","313702965_Statistical_aspects_of_the_analysis_of_data_from_retrospective_studies_of_disease","308980568_Equality_of_Opportunity_in_Supervised_Learning"]}