{"id":"315984278_Perfil_do_Trabalhador_do_Conhecimento_na_Percepcao_do_Genero","abstract":"Baseado no estudo da tipologia de papéis do trabalhador do conhecimento de Reinhardt et al (2011), este artigo aborda ações realizadas por estes profissionais, por papel e gênero, durante as suas rotinas nas organizações intensivas. Partici- param da pesquisa 44 pesquisadores e docentes atuantes em centros de ensino e institutos de pesquisas brasileiros na área de biotecnologia e de ciência da computação. A coleta de dados foi realizada com questionário on-line e a análise de dados, empregou-se método quantitativo. Os resultados demonstraram que o papel mais importante para ambos os gêneros, masculino e feminino, foi o de Recuperador, com 31 respostas (74%); seguido pelo Networker, com 24 res- postas (57%). Todavia, ao analisar o segundo papel mais importante por gênero obteve-se resultado distinto. Ao aplicar o teste paramétrico, test t para amostras independentes identificou-se que a variável Tipo de Profissional para os papéis Compartilhador e Solucionador resultaram do test t, respectivamente, 0,0287 e 0,0395; e para a variável Uso de Aplicativo, o papel de Linker resultou 0,04 no test t. Os resultados inferiores ao valor limiar de 0,05 demonstram que a hipótese nula foi rejeitada e há indícios de diferenças de gêneros nos papéis dos trabalha- dores do conhecimento. Considerando a limitação do estudo, compreender o perfil do trabalhador do conhecimento e suas diferenças na dinâmica de trabalho, desde a criação e até os processos da gestão do conhecimento beneficiam as organizações que buscam se adaptar continuamente as novas formas de trabalho, impactar a produtividade e promover vantagem competitiva no mercado.","authors":["Valeria Macedo","Neusa Santos","Belmiro Do Nascimento João","André Taue Saito"],"meta":["April 2017Revista de Administração FACES Journal 16(1):106-121","DOI:10.21714/1984-6975FACES2017V16N1ART3899","Project: O papel do trabalhador do conhecimento: um estudo em centros de ensino e laboratórios de pesquisa brasileiros"],"references":["248078273_Thinking_for_A_Living_How_to_Get_Better_Performance_and_Results_from_Knowledge_Workers","229099904_Working_Knowledge_How_Organizations_Manage_What_They_Know","220363097_The_Concept_of_Knowledge_Work_Revisited","271523899_The_Future_of_Employment_How_Susceptible_Are_Jobs_to_Computerisation","238678654_The_Work_of_Nations_Preparing_Ourselves_For_21st_Century_Capitalism","220363292_A_typology_of_knowledge_management_Strategic_groups_and_role_behavior_in_organizations","40931226_Mintzberg_on_Management_Inside_Our_Strange_World_of_Organizations","23545878_Dimensions_of_Occupational_Changes_in_Canada's_Knowledge_Economy_1971-1996","5218140_An_Introduction_to_the_Economy_of_the_Knowledge_Society"]}