{"id":"315954393_M-Commerce_and_Mobile_Apps_Opportunities_for_SMEs_in_Developing_Countries","abstract":"From Uber to Airbnb mobile apps are changing the ways business is done and opening numerous new avenues for business and creating new markets. Technology has made asset sharing a reality, leading to efficient utilization of resources at costs much lower than were thought possible. Markets are becoming more interconnected and communication is vitally ingrained in our business transactions. The current research paper is a review of current concepts in M-commerce and Mobile Applications. In the paper M-commerce is defined as a part of e-commerce. The conclusion suggests that M-commerce depends significantly on e-commerce technologies. Technology adoption is becoming more affordable as well as a necessity to survive in today’s ultra-competitive business environment. Only brick and mortar or businesses without presence on the internet would be at a big disadvantage and may even close down sooner than later. Flexibility characteristic of SME business makes it easier to make a decision on a large scale, such as new technology adoption, modifying or even revamping an existing business process to meet market demands and avail existing or potential opportunities. M-Commerce, therefore, holds great benefits for SMEs to grow their revenues greatly by being available at the fingertips of millions of potential buyers around the world.","authors":["Asadullah Khaskheli","Yun Jun","Miraz Ahmed Ph.D"],"meta":["January 2017","DOI:10.18775/jibrm.1849-8558.2015.22.3003","Project: a review"],"references":["311618124_Exploring_the_success_and_barriers_to_SME_access_to_finance_and_its_potential_role_in_achieving_growth_Enterprise_Research_Centre_Research_Paper_No53","309579600_Antecedents_of_mobile_app_usage_among_smartphone_users","306032019_Supply_Chain_Finance_and_SMEs_Evidence_from_International_Factoring_Data","299399980_E-commerce_adoption_by_SMEs_in_developing_countries_evidence_from_Indonesia","297600692_Relative_Advantage_and_Competitive_Pressure_towards_Implementation_of_E-commerce_Overview_of_Small_and_Medium_Enterprises_SMEs","344907708_Present_and_Future_of_Mobile_Commerce","312160473_Acceptance_of_Smartphone-Based_Mobile_Shopping_Mobile_Benefits_Customer_Characteristics_Perceived_Risks_and_the_Impact_of_Application_Context","311421598_Barriers_and_Drivers_to_Future_Bank_Adoption_of_Mobile_Banking_A_Stakeholder_Perspective","309300250_SMEs_banks_and_the_spatial_differentiation_of_access_to_finance","305816656_Smartphone_habit_and_behavior_in_Brunei_Personalization_gender_and_generation_gap"]}