{"id":"315950692_It_Is_Not_My_Place_Psychological_Standing_and_Men's_Voice_and_Participation_in_Gender-Parity_Initiatives","abstract":"Attempts to improve gender parity at workplaces are more effective when organizations mobilize their entire workforce, including men, to participate (i.e., speak up with ideas, volunteer, or serve as champions) in gender-parity initiatives. Yet, frequently, men are hesitant to participate in such initiatives. We explicate one reason for such hesitation on the part of men and suggest ways organizations can address this challenge. Using four studies (correlational as well as experimental), we demonstrate that men experience lower psychological standing (i.e., a subjective judgment of legitimacy to perform an action) with respect to gender-parity initiatives that leads them to participate less in such initiatives. We explain how psychological standing provides a complementary explanation to the current narrative in the literature suggesting that men’s poor participation results from sexist or discriminatory attitudes toward gender parity. We also establish that psychological standing influences participation over and above efficacy, instrumentality, and psychological safety and highlight how organizations can increase men’s participation by providing them with psychological standing when soliciting their participation in gender-parity initiatives. We discuss the implications of our findings for the literatures on gender parity, change management, and employee voice and participation.","authors":["Elad Sherf","Subrahmaniam Tangirala","Katy Weber"],"meta":["April 2017Organization Science 28(2)","DOI:10.1287/orsc.2017.1118"],"references":["281336383_Attitudes_Toward_Women's_Work_and_Family_Roles_in_the_United_States_1976-2013","237259590_Best_Practices_or_Best_Guesses_Assessing_the_Efficacy_of_Corporate_Affirmative_Action_and_Diversity_Policies","227375460_Speaking_Up_in_the_Operating_Room_How_Team_Leaders_Promote_Learning_in_Interdisciplinary_Action_Teams","259539307_A_meta-analytic_comparison_of_self-reported_and_other-reported_organizational_citizenship_behavior","211391808_Program_Commitment_A_Multi-Study_Longitudinal_Field_Investigation_of_Its_Impact_and_Antecedents","50906564_The_Personal_Sense_of_Power"]}