{"id":"315950794_HALC_High_throughput_algorithm_for_long_read_error_correction","abstract":"Background\nThe third generation PacBio SMRT long reads can effectively address the read length issue of the second generation sequencing technology, but contain approximately 15% sequencing errors. Several error correction algorithms have been designed to efficiently reduce the error rate to 1%, but they discard large amounts of uncorrected bases and thus lead to low throughput. This loss of bases could limit the completeness of downstream assemblies and the accuracy of analysis. ResultsHere, we introduce HALC, a high throughput algorithm for long read error correction. HALC aligns the long reads to short read contigs from the same species with a relatively low identity requirement so that a long read region can be aligned to at least one contig region, including its true genome region’s repeats in the contigs sufficiently similar to it (similar repeat based alignment approach). It then constructs a contig graph and, for each long read, references the other long reads’ alignments to find the most accurate alignment and correct it with the aligned contig regions (long read support based validation approach). Even though some long read regions without the true genome regions in the contigs are corrected with their repeats, this approach makes it possible to further refine these long read regions with the initial insufficient short reads and correct the uncorrected regions in between. In our performance tests on E. coli, A. thaliana and Maylandia zebra data sets, HALC was able to obtain 6.7-41.1% higher throughput than the existing algorithms while maintaining comparable accuracy. The HALC corrected long reads can thus result in 11.4-60.7% longer assembled contigs than the existing algorithms. Conclusions\nThe HALC software can be downloaded for free from this site: https://github.com/lanl001/halc.","authors":["Ergude Bao","Lingxiao Lan"],"meta":["April 2017BMC Bioinformatics 18(1)","DOI:10.1186/s12859-017-1610-3"],"references":["345851507_Third-generation_sequencing_and_the_future_of_genomics","344854848_Error_correction_and_assembly_complexity_of_single_molecule_sequencing_reads","304036022_SOAPdenovo2_an_empirically_improved_memory-efficient_short-read_de_novo_assembler","301876053_Accurate_selfcorrection_of_errors_in_long_reads_using_de_Bruijn_graphs","301827317_Jabba_Hybrid_error_correction_for_long_sequencing_reads","295899991_The_paralog-to-contig_assignment_problem_High_quality_gene_models_from_fragmented_assemblies","283544243_PacBio_Sequencing_and_Its_Applications","282127853_An_improved_genome_reference_for_the_African_cichlid_Metriaclima_zebra","310582563_CoLoRMap_Correcting_Long_Reads_by_Mapping_short_reads","285468883_Real-Time_DNA_Sequencing_from_Single_Polymerase_Molecules"]}