{"id":"315963268_An_ensemble_of_visual_features_for_Gaussians_of_local_descriptors_and_non-binary_coding_for_texture_descriptors","abstract":"This paper presents an improved version of a recent state-of-the-art texture descriptor called Gaussians of Local Descriptors (GOLD), which is based on a multivariate Gaussian that models the local feature distribution that describes the original image. The full rank covariance matrix, which lies on a Riemannian manifold, is projected on the tangent Euclidean space and concatenated to the mean vector for representing a given image. In this paper, we test the following features for describing the original image: scale-invariant feature transform (SIFT), histogram of gradients (HOG), and weber's law descriptor (WLD). To improve the baseline version of GOLD, we describe the covariance matrix using a set of visual features that are fed into a set of Support Vector Machines (SVMs). The SVMs are combined by sum rule. The scores obtained by an SVM trained using the original GOLD approach and the SVMs trained with visual features are then combined by sum rule. Experiments show that our proposed variant outperforms the original GOLD approach. The superior performance of the proposed system is validated across a large set of datasets. Particularly interesting is the performance obtained in two widely used person re-identification datasets, CAVIAR4REID and IAS, where the proposed GOLD variant is coupled with a state-of-the-art ensemble to obtain an improvement of performance on these two datasets. Moreover, we performed further tests that combine GOLD with non-binary features (local ternary/quinary patterns) and deep transfer learning. The fusion among SVMs trained with deep features and the SVMs trained using the ternary/quinary coding ensemble is demonstrated to obtain a very high performance across datasets. The MATLAB code for the ensemble of classifiers and for the extraction of the features will be publicly available1 to other researchers for future comparisons.","authors":["Loris Nanni","Michelangelo Paci","Sheryl Brahnam","Stefano Ghidoni"],"meta":["October 2017Expert Systems with Applications 82:27-39","DOI:10.1016/j.eswa.2017.03.065","Project: Machine Learning"],"references":["310658827_How_could_a_subcellular_image_or_a_painting_by_Van_Gogh_be_similar_to_a_great_white_shark_or_to_a_pizza","308862338_Median_robust_extended_local_binary_pattern_for_texture_classification","273331733_Ensemble_of_Different_Approaches_for_a_Reliable_Person_Re-identification_System","272040931_Painting-91_A_large_scale_database_for_computational_painting_categorization","292205531_Median_Robust_Extended_Local_Binary_Pattern_for_Texture_Classification","281327990_Enhanced_Local_Texture_Feature_Sets_for_Face_Recognition_Under_Difficult_Lighting_Conditions","273340741_An_adaptive_hybrid_pattern_for_noise-robust_texture_analysis","273206720_GOLD_Gaussians_of_Local_Descriptors_for_Image_Representation","261103972_HEp-2_cell_classification_using_rotation_invariant_co-occurrence_among_local_binary_patterns","257014897_Noise_tolerant_local_binary_pattern_operator_for_efficient_texture_analysis","251234833_Centromere_and_cytoplasmic_staining_pattern_recognition_A_local_approach","239522831_Non-Binary_Coding_for_Texture_Descriptors_in_Sub-Cellular_and_Stem_Cell_Image_Classification","236156561_Miniature_illustrations_retrieval_and_innovative_interaction_for_digital_illuminated_manuscripts","251590524_Video-based_smoke_detection_with_histogram_sequence_of_LBP_and_LBPV_pyramids","245617187_Material_perception_What_can_you_see_in_a_brief_glance"]}