{"id":"315919303_Interactive_Digital_Signage_architecture_to_improve_user_interaction_on_tourism_information_services","abstract":"Utilization of Digital Signage (DS) in the tourism sector should be used as medium to provide information of interest for tourists. In Indonesia, many places of supporting tourism such as shops, restaurants and entertainment using DS as medium of information and communication to their customers. Usually DS using multimedia content such as video, images and text displayed on the screens are repeatedly. In addition, DS can be used as a medium of interaction that effective and attractive for increasing visitor attraction. In this study, we proposed an interactive digital signage system architecture for tourism. We proposed a new signage system terminal and method of presenting content using gamification techniques. To see the effect of proposed architecture to improve user interaction, we validated gamification method on DS system, to attention of users by calculating Pearson's correlation coefficient. The results showed, there was 61% increase in the user's attention to DS screen, before and after using gamifiation. In the future, the system can be integrated with push notification method on user's phone, to invite more visitor come to DS screen for making a crowd.","authors":["Zulhamdi Koto","Yoanes Bandung"],"meta":["November 2016","DOI:10.1109/ISESD.2016.7886752","Conference: 2016 International Symposium on Electronics and Smart Devices (ISESD)"],"references":["260719612_Smart_Signage_A_Draggable_Cyber-Physical_BroadcastMulticast_Media_System","229067278_Interactive_Digital_Signage_-_An_Innovative_Service_and_Its_Future_Strategies","308861167_Healthcare_Digital_Signage_Using_Gamification_Method","301411666_Gamification_framework_model_based_on_social_engagement_in_e-learning_20","281910916_Push_Type_Digital_Signage_System_that_Displays_Personalized_Information","273946893_For_the_Win_How_Game_Thinking_can_Revolutionize_your_Business","261083240_Application_of_digital_signage_for_tourism_information_and_communication_system","244486522_Total_Engagement_Using_Games_and_Virtual_Worlds_to_Change_the_Way_People_Work_and_Businesses_Compete","221015942_ReflectiveSigns_Digital_Signs_That_Adapt_to_Audience_Attention"]}