{"id":"315922311_Noise_Removal_and_Filtering_Techniques_used_in_Medical_Images","abstract":"Noise removal techniques have become an essential practice in medical imaging application for the study of anatomical structure and image processing of MRI medical images. To report these issues many de-noising algorithm has been developed like Weiner filter, Gaussian filter, median filter etc. In this research work is done with only three of the above filters which are already mentioned were successfully used in medical imaging. The most commonly affected noises in medical MRI image are Salt and Pepper, Speckle, Gaussian and Poisson noise. The medical images taken for comparison include MRI images, in gray scale and RGB. The performances of these algorithms are examined for various noise types which are salt-and-pepper, Poisson, speckle, blurred and Gaussian Noise. The evaluation of these algorithms is done by the measures of the image file size, histogram and clarity scale of the images. The median filter performs better for removing salt-and-pepper noise and Poisson Noise for images in gray scale, and Weiner filter performs better for removing Speckle and Gaussian Noise and Gaussian filter for the Blurred Noise as suggested in the experimental results.","authors":["Nalin Kumar","M Nachamai"],"meta":["March 2017","DOI:10.13005/ojcst/10.01.14"],"references":["233862395_Noise_Removal_in_Magnetic_Resonance_Images_usingHybrid_KSL_Filtering_Technique","325151903_Survey_of_Adaptive_scheme_for_QoS_in_Wireless_Sensor_Networks","323240962_AN_ECO-FRIENDLY_GREEN_ROUTE_FOR_THE_SYNTHESIS_OF_AMIDE_FROM_CARBOXYLIC_ACIDS_EMPLOYING_MONTMORILLONITE_AS_A_CATALYST","319466376_Designing_of_a_Fractal_Annular_Array_Antenna_with_use_of_Power_Divider","319125291_A_Review_Paper_on_Performance_Analysis_of_Various_HPVT_PVT_Modules_under_Different_Indian_Climatic_Conditions","312095303_Translation_Registration_Algorithm_for_Multi_-_source_Time_Series_Data_Based_on_the_Sliding_Window","285043783_High_Density_Salt_and_Pepper_Noise_Removal_in_Images_Using_Adapted_Decision_Based_Unsymmetrical_Trimmed_Mean_Filter_Cascaded_with_Gaussian_filter","274202418_A_Comparative_Study_on_Approaches_to_Speckle_Noise_Reduction_in_Images"]}