{"id":"315929200_Spatial_Data_Sharing_A_Pilot_Study_of_French_SDIs","abstract":"Since the appearance of Spatial Data Infrastructure several years ago, there has been a tremendous increase in spatial data available on the Internet. This situation raises several research issues, in terms of identifying the content actually accessible via this medium and its impact on governance and local authority management. Our study proposes a mixed methodology applied to 45 French institutional infrastructures, to compare the objectives stated by their promoters, their content, and the actual services provided. The methodology, based on an analysis of interviews with Spatial Data Infrastructure (SDI) coordinators and their answers to questionnaires, as well as a study of their websites and an exploration of over 160,000 metadata in their metadata catalogues, produced varied results concerning data accessibility, stakeholder networks, the interoperability of tools, and informational equality in different regions. Despite the proactive stance of SDI promoters, only 15.7% of data are open-access. Their interoperability remains restricted to specific types of actors and themes. Although geocollaboration organised by SDIs is very active, it only concerns the public sector. These disparities also concern their informational dimension, as some regions have considerable resources at their disposal, but others do not.","authors":["Matthieu Noucher","Françoise Gourmelon","Pierre Gautreau","Jade Georis-Creuseveau"],"meta":["March 2017International Journal of Geo-Information 6(4):99","DOI:10.3390/ijgi6040099"],"references":["306259635_Sharing_Platforms_in_Digital_Geographic_Information_and_Spatial_Justice_Everything_it_Promises","303506098_A_modelling_framework_for_the_study_of_Spatial_Data_Infrastructures_applied_to_coastal_management_and_planning","288363789_Exploring_the_geographic_information_universe_The_role_of_search_technologies","273486017_Normalized_evaluation_of_the_performance_capacity_and_availability_of_catalogue_services_a_pilot_study_based_on_INfrastruture_for_SPatial_InfoRmation_in_Europe_INSPIRE","267867447_Towards_critical_data_studies_Charting_and_unpacking_data_assemblages_and_their_work","300778338_A_Review_of_SDI_Literature_Searching_for_Signs_of_Inverse_Infrastructures","284078073_Real-time_collaborative_GIS_A_technological_review","281884809_Fundamentals_of_Spatial_Data_Quality","259453247_Geo-Social_Model_A_Conceptual_Framework_for_Real-time_Geocollaboration","248533675_On_the_Governance_of_Information_Introducing_a_New_Concept_of_Governance_to_Support_the_Management_of_Information"]}