{"id":"315965068_Natural_Scales_in_Geographical_Patterns","abstract":"Human mobility is known to be distributed across several orders of magnitude of physical distances, which makes it generally difficult to endogenously find or define typical and meaningful scales. Relevant analyses, from movements to geographical partitions, seem to be relative to some ad-hoc scale, or no scale at all. Relying on geotagged data collected from photo-sharing social media, we apply community detection to movement networks constrained by increasing percentiles of the distance distribution. Using a simple parameter-free discontinuity detection algorithm, we discover clear phase transitions in the community partition space. The detection of these phases constitutes the first objective method of characterising endogenous, natural scales of human movement. Our study covers nine regions, ranging from cities to countries of various sizes and a transnational area. For all regions, the number of natural scales is remarkably low (2 or 3). Further, our results hint at scale-related behaviours rather than scale-related users. The partitions of the natural scales allow us to draw discrete multi-scale geographical boundaries, potentially capable of providing key insights in fields such as epidemiology or cultural contagion where the introduction of spatial boundaries is pivotal.","authors":["Telmo Menezes","Camille Roth"],"meta":["April 2017Scientific Reports 7(1):45823","DOI:10.1038/srep45823","Project: Natural Scales in Geographical Patterns"],"references":["315782427_Natural_Scales_in_Geographical_Patterns","314891750_Statistical_Laws_Governing_Fluctuations_in_Word_Use_from_Word_Birth_to_Word_Death","309074506_Regions_and_borders_of_mobile_telephony_in_Belgium_and_in_the_Brussels_metropolitan_zone","303951429_How_to_Study_the_City_on_Instagram","291229251_Predicting_human_mobility_through_the_assimilation_of_social_media_traces_into_mobility_models","287250314_Predicting_links_in_ego-networks_using_temporal_information","281678568_Geographies_of_an_Online_Social_Network","264271097_A_comparison_of_Foursquare_and_Instagram_to_the_study_of_city_dynamics_and_urban_social_behavior","303832512_Scaling_identity_connects_human_mobility_and_social_interactions","299413714_Touristic_site_attractiveness_seen_through_Twitter"]}