{"id":"315999839_Creer_le_deja-la_un_paradoxe_fecond_pour_penser_l'activite_scripturale_et_scientifique_de_l'auteur_de_memoire_de_master_MEEF","abstract":"The students who plan to work in teaching professions have to write a thesis of Master’s degree, which is both scientific, as for the theoretical frame and the data analysis, and professional as for the object of search. The theoretical frame of this thesis, that is its abstract base, consists of statements which have their source at other authors, and as such participates of a particular shape of already-there in the writing. But besides, the studied corpus which can gather discussions recorded in class, actors’ words, also represents another shape of already-there, which must be taken care of within the thesis. Thus, the writing of this thesis convenes several levels of already-there, which make so many various speeches that writers should textualize. With references to 14 theses of MEEF Master’s degree, this paper suggests dealing more particularly with the following issues: Which use is made of the already-there? How to characterize the new in the use of the already-there? What’s the new made of in the thought of an author who is a researcher apprentice? Which linguistic markers enable to assert that the proper thought of an author has been developing, when this author quotes and reformulates others? • To what extent does the adjustment of linguistic materials “make/create a text”, in other words where does textualization begin? Can we assert that the document which is produced doesn’t sometimes “make text”, and consists only in a juxtaposition of statements? This analysis shows that these 14 theses, which were developed from comparable conceptual frameworks and analyzed the same data, are however made up of very different texts, simultaneously to conceptual, scriptural and scientific plans.","authors":["Catherine Delarue-Breton"],"meta":["February 2017Pratiques","DOI:10.4000/pratiques.3403"],"references":["309256520_Introduction_From_second_language_pedagogy_to_the_pedagogy_of_'plurilingualism'_a_possible_paradigm_shiftDe_la_didactique_des_langues_a_la_didactique_du_plurilinguisme_un_changement_de_paradigme_possi","274950223_Creativite_auctorisation_et_dialogisme_le_memoire_de_master_MEEF_miroir_de_l'experience_psychique","272437299_Pourquoi_et_comment_cela_change_Standardisation_et_variation_dans_le_champ_des_discours_scientifiques","270035382_Fonctions_structuration_et_evolution_des_croyances_et_connaissances_des_enseignants","269815588_Positions_positionnements_et_postures_de_l'enonciateur","282913485_Psychologie_de_la_creativite"]}