{"id":"315974626_ENTREPRENEURIAL_EDUCATION_IN_ENGINEERING_CURRICULA_AT_THE_UNIVERSITY_OF_TORONTO","abstract":"The importance and implications of entrepreneurial education in engineering curricula have been well-documented, leading to its rapid growth in many Canadian Engineering schools in recent years. For undergraduate students, this education promotes interdisciplinary and diverse thought with awareness of the political, financial and social environments that inevitably influence their careers and possible business initiatives on the local and/or global stage. For graduate students developing leading-edge technologies, this education encourages the much needed commercialization of innovations in Canada. However, entrepreneurial education is often outsourced to business schools which emphasize theory over pragmatic real-world approaches. This paper describes a latter approach: an entrepreneurial program designed for engineering students at the University of Toronto (UofT). Specifically, we report on the curriculum of courses offered and taught by practicing entrepreneurs who lecture in the context of their own experiences. The result is a program focused less on theoretical work and more on the opportunities and obstacles likely to be encountered in an entrepreneurial career. Our program has evolved over more than 20 years. It has been a great success with students, in terms of their satisfaction as well as in their business formation and value/wealth creation after graduation. This has consequently led to its popularity; we currently serve 180-200 students each year out of the many who apply. With such demand exceeding our capacity, plans for expansion are underway and expected to run smoothly as the program is purposely designed in modules to make the courses easy to “clone”, and for new instructors to be trained quickly. Moreover, we see potential for other faculties at the UofT and other universities to adopt and modify our model to suit their future needs.","authors":["A. Tran","Joseph C. Paradi"],"meta":["August 2011Proceedings of the Canadian Engineering Education Association (CEEA)","DOI:10.24908/pceea.v0i0.3665"],"references":["256620228_Experiments_in_entrepreneurship_education_Successes_and_failures","223589228_Measuring_Progress_in_Entrepreneurship_Education","322240298_Encouraging_technology-based_ventures_Entrepreneurship_education_and_engineering_graduates","247752775_Exploring_Student_Interest_in_Entrepreneurship_Courses","233551812_Entrepreneurship_Education_and_Engineering_Students_Career_Path_and_Business_Performance"]}