{"id":"316069659_Towards_Semantics-Aware_Recommender_System_A_LOD-Based_Approach","abstract":"Recommender systems have contributed to the success of personalized websites as they can automatically and efficiently select items or services adapted to the user's interest from huge datasets. However, these systems suffer of issues related to small number of evaluations; cold start system and data sparsity. Several approaches have been explored to find solutions to related issues. The advent of the Linked Open Data (LOD) initiative has spawned a wide range of open knowledge bases freely accessible on the Web. They provide a valuable source of information that can improve conventional recommender systems, if properly exploited. In this paper, we aim to demonstrate that adding semantic information from LOD enhance the effectiveness of traditional collaborative filtering. To evaluate the accuracy of the semantic approach, experiments on standard benchmark dataset was conducted. The obtained results indicate that the accuracy and quality of the recommendation are improved compared with existing approaches.","authors":["Asmaa Fridi","Sidi Mohamed Benslimane"],"meta":["February 2017International Journal of Modern Education and Computer Science 9(2):55-61","DOI:10.5815/ijmecs.2017.02.07","Project: Contribution of social computing in Service Oriented Computing"],"references":["300646445_Recommender_Systems_and_Linked_Open_Data","300030827_Using_Linked_Open_Data_in_Recommender_Systems","280580282_Enhancing_Recommender_Systems_Using_Linked_Open_Data-Based_Semantic_Analysis_of_Items","272371332_Towards_Improving_Recommender_System_A_Social_Trust-Aware_Approach","271553748_Semantically-based_recommendation_by_using_semantic_clusters_of_users'_viewing_history","270220131_Towards_context-sensitive_collaborative_media_recommender_system","261844321_Top-N_recommendations_from_implicit_feedback_leveraging_linked_Open_Data","261284593_A_multi-criteria_hybrid_citation_recommendation_system_based_on_linked_data","299709476_Using_Semantic_Technology_to_Improve_Recommender_Systems_Based_on_Slope_One","292262674_Some_methods_for_classification_and_analysis_of_multivariate_observations"]}