{"id":"316021898_Mining_Energy_Consumption_Behavior_Patterns_for_Households_in_Smart_Grid","abstract":"Inarguably, buying-in consumer confidence through respecting their energy consumption behavior and preferences in various energy programs is imperative but also demanding. Household energy consumption patterns, which provide great insight into consumers energy consumption behavioral traits, can be learned by understanding user activities along with appliances used and their time of use. Such information can be retrieved from the context-rich smart meters big data. However, the main challenge is how to extract complex interdependencies among multiple appliances operating concurrently, and identify appliances responsible for major energy consumption. Furthermore, due to the continuous generation of energy consumption data, over a period of time, appliance associations can change. Therefore, they need to be captured regularly and continuously. In this paper, we propose an unsupervised progressive incremental data mining mechanism applied to smart meters energy consumption data through frequent pattern mining to overcome these challenges. This can establish a foundation for efficient energy demand management while ameliorating end-user participation. The details and the results of evaluation of the proposed mechanism using real smart meters dataset are also presented in this paper.","authors":["Shailendra Singh","Abdulsalam Yassine"],"meta":["April 2017IEEE Transactions on Emerging Topics in Computing PP(99):1-1","DOI:10.1109/TETC.2017.2692098"],"references":["289510173_Optimal_State_Estimation_for_Boolean_Dynamical_Systems_using_a_Boolean_Kalman_Smoother","284922872_Smart_home_energy_management_system","282876620_Mining_Sequential_Patterns_of_Event_Streams_in_a_Smart_Home_Application","312449512_Mining_Frequent_Patterns_without_Candidate_Generation","308881348_Maximum-Likelihood_Adaptive_Filter_for_Partially-Observed_Boolean_Dynamical_Systems","308864281_Big_data_analytics_for_demand_response_Clustering_over_space_and_time","308845669_Incrementally_Mining_Usage_Correlations_among_Appliances_in_Smart_Homes","308605364_Sequential_pattern_mining_A_study_to_understand_daily_activity_patterns_for_load_forecasting_enhancement","300708785_Mining_Correlation_Patterns_among_Appliances_in_Smart_Home_Environment","288177281_Mining_Frequent_Patterns_Associations_and_Correlations"]}