{"id":"316075594_Optimal_strategies_for_weighted_ray_search","abstract":"Searching for a hidden target is an important algorithmic paradigm with numerous applications. We introduce and study the general setting in which a number of targets, each with a certain weight, are hidden in a star-like environment that consists of $m$ infinite, concurrent rays, with a common origin. A mobile searcher, initially located at the origin, explores this environment in order to locate a set of targets whose aggregate weight is at least a given value $W$. The cost of the search strategy is defined as the total distance traversed by the searcher, and its performance is evaluated by the worst-case ratio of the cost incurred by the searcher over the cost of an on optimal, offline strategy with (some) access to the instance. This setting is a broad generalization of well-studied problems in search theory; namely, it generalizes the setting in which only a single target is sought, as well as the case in which all targets have unit weights. We consider two models depending on the amount of information allowed to the offline algorithm. In the first model, which is the canonical model in search theory, the offline algorithm has complete information. Here, we propose and analyze a strategy that attains optimal performance, using a parameterized approach. In the second model, the offline algorithm has only partial information on the problem instance (i.e., the target locations). Here, we present a strategy of asymptotically optimal performance that is logarithmically related to $m$. This is in stark contrast to the full information model in which a linear dependency is unavoidable.","authors":["Spyros Angelopoulos","Konstantinos Panagiotou"],"meta":["April 2017"],"references":["304145482_Multi-processor_Search_and_Scheduling_Problems_with_Setup_Cost","242912284_Minimax_Solutions_for_Linear_Search_Problems","226998384_The_K-Server_Dual_and_Loose_Competitiveness_for_Paging","30529942_The_Theory_of_Search_Games_and_Rendezvous","312966388_Infinite_linear_programming_and_online_searching_with_turn_cost","285320254_Online_searching","275064283_An_Optimal_Search","270913229_Searching_on_a_line_A_complete_characterization_of_the_optimal_solution","257285777_Searching_in_the_Plane","255785859_Mining_Coal_or_Finding_Terrorists_The_Expanding_Search_Paradigm","239229873_The_ultimate_strategy_to_search_on_m_rays_Theor","226007633_Son_of_the_Linear_Search_Problem","225757698_Yet_More_on_the_Linear_Search_Problem","225600691_A_General_Search_Game","225363679_On_the_Linear_Search_Problem","225176531_A_Lower_Bound_for_Randomized_Searching_on_mRays","225133363_Hyperbolic_Dovetailing","223711333_The_ultimate_strategy_to_search_on_rays","223444724_Optimal_Constructions_of_Hybrid_Algorithms","223322950_On-line_parallel_heuristics_processor_scheduling_and_robot_searching_under_the_competitive_framework","222678896_Online_Searching_with_Turn_Cost","221543750_Input-Thrifty_Extrema_Testing","220770245_The_Oil_Searching_Problem","220390463_Algorithms_for_Distributional_and_Adversarial_Pipelined_Filter_Ordering_Problems","220247476_Searching_in_the_Plane"]}