{"id":"316028427_Building_Melodic_Feature_Knowledge_of_Gamelan_Music_Using_Apriori_Based_on_Functions_in_Sequence_AFiS_Algorithm","abstract":"Gamelan is a traditional music ensemble from Java, Indonesia, whose melody has characteristics that make the melodic sound of gamelan music easy to recognize. This research aims at building melodic feature knowledge of gamelan music in terms of note sequences rules. The algorithm called AFiS (Apriori based on Functions in Sequence) was also introduced to produce rules by mining the frequent value of note sequences. The basic idea of the AFiS algorithm is to define functions in a sequence, and then to chain the functions based on its position order to identify the support value for each function. The implementation of AFiS algorithm is aimed to define rules of gamelan music melodic feature in terms of ideal note sequences for composition. The evaluation of the accuracy of the note sequences rules is conducted by developing a recommendation system using rules defined in this research. The program is expected to answer correctly to some notes randomly deleted from the sequences. The result shows that the accuracy of the knowledge, and that the note sequences rules of gamelan music based on the correct answer is up to 86.5%. Another evaluation is to find whether the different answers given by the program are accepted as alternative notes to the original notes. This evaluation involved 4 human experts to describe their acceptance of the alternative notes based on the different answers. The result shows that the different notes in 4 of 5 gendings are accepted by the experts as alternative notes.","authors":["Khafiizh Hastuti","Azhari Azhari","Aina Musdholifah","Rahayu Supanggah"],"meta":["December 2016International Review on Computers and Software (IRECOS) 11(12):1127","DOI:10.15866/irecos.v11i12.10841","Project: Gamelan Music Representation"],"references":["310443891_A_Joyful_Ode_to_Automatic_Orchestration","306097687_Peekquence_Visual_Analytics_for_Event_Sequence_Data","289763738_A_New_Composition_Algorithm_for_Automatic_Generation_of_Thematic_Music_from_the_Existing_Music_Pieces","284355172_Composing_with_Kulitta","261853177_Grammar-based_automated_music_composition_in_Haskell","304291878_Generating_music_from_natural_language_text","304290678_Algorithmic_music_composition_for_computer_games_based_on_L-system","282265367_A_survey_of_sequence_patterns_in_data_mining_techniques","263964240_Composing_Music_with_Computers","263963883_Algorithmic_Composition_Paradigms_of_Automated_Music_Generation","249881773_A_Grammar_of_the_Musical_Genre_Srepegan","234777366_Experimental_Music_Composition_with_an_Electronic_Computer","220565989_A_Taxonomy_of_Sequential_Pattern_Mining_Algorithms","3575170_Bach_in_a_box_the_evolution_of_four_part_Baroque_harmony_using_the_genetic_algorithm","2825075_Metarule-Guided_Mining_of_Multi-Dimensional_Association_Rules_Using_Data_Cubes"]}