{"id":"316027349_Deep_CNNs_With_Spatially_Weighted_Pooling_for_Fine-Grained_Car_Recognition","abstract":"Fine-grained car recognition aims to recognize the category information of a car, such as car make, car model, or even the year of manufacture. A number of recent studies have shown that a deep convolutional neural network (DCNN) trained on a large-scale data set can achieve impressive results at a range of generic object classification tasks. In this paper, we propose a spatially weighted pooling (SWP) strategy, which considerably improves the robustness and effectiveness of the feature representation of most dominant DCNNs. More specifically, the SWP is a novel pooling layer, which contains a predefined number of spatially weighted masks or pooling channels. The SWP pools the extracted features of DCNNs with the guidance of its learnt masks, which measures the importance of the spatial units in terms of discriminative power. As the existing methods that apply uniform grid pooling on the convolutional feature maps of DCNNs, the proposed method can extract the convolutional features and generate the pooling channels from a single DCNN. Thus minimal modification is needed in terms of implementation. Moreover, the parameters of the SWP layer can be learned in the end-to-end training process of the DCNN. By applying our method to several fine-grained car recognition data sets, we demonstrate that the proposed method can achieve better performance than recent approaches in the literature. We advance the state-of-the-art results by improving the accuracy from 92.6% to 93.1% on the Stanford Cars-196 data set and 91.2% to 97.6% on the recent CompCars data set. We have also tested the proposed method on two additional large-scale data sets with impressive results observed.","authors":["Qichang Hu","Huibing Wang","Teng Li","Chunhua Shen"],"meta":["April 2017IEEE Transactions on Intelligent Transportation Systems PP(99):1-10","DOI:10.1109/TITS.2017.2679114"],"references":["319770242_Mid-level_Deep_Pattern_Mining","308872089_A_Large-Scale_Car_Dataset_for_Fine-Grained_Categorization_and_Verification","319770430_Rich_feature_hierarchies_for_accurate_object_detection_and_semantic_segmentation","319769911_Faster_R-CNN_Towards_Real-Time_Object_Detection_with_Region_Proposal_Networks","311610261_BoxCars_3D_Boxes_as_CNN_Input_for_Improved_Fine-Grained_Vehicle_Recognition","311609041_Deep_Residual_Learning_for_Image_Recognition","308850491_Exploiting_effects_of_parts_in_fine-grained_categorization_of_vehicles","308841432_The_treasure_beneath_convolutional_layers_Cross-convolutional-layer_pooling_for_image_classification","308826195_Mid-level_deep_pattern_mining","308813183_Fine-grained_recognition_without_part_annotations"]}