{"id":"316000931_Streaming_Audio_Using_MPEG-7_Audio_Spectrum_Envelope_to_Enable_Self-similarity_within_Polyphonic_Audio","abstract":"One method overlooked to date, which can work alongside existing audio compression schemes, is that which takes account of the semantics and natural repetition of music through meta-data tagging. Similarity detection within polyphonic audio has presented problematic challenges within the field of Music Information Retrieval. This paper presents a method (SoFI) for improving the quality of stored audio being broadcast over any wireless medium through meta-data which has a number of market applications all with market value. Our system works at the content level thus rendering it applicable in existing streaming services. Using the MPEG-7 Audio Spectrum Envelope (ASE) gives features for extraction and combined with k-means clustering enables self-similarity to be performed within polyphonic audio. SoFI uses string matching to identify similarity between large sections of clustered audio. Objective evaluations of SoFI give positive results which show that SoFI is shown to detect high levels of similarity on varying lengths of time within an audio file. In a scale between 0 and 1 with 0 the best, a clear correlation between similarly identified sections of 0.2491 shows successful identification.","authors":["Jonathan Doherty","Kevin Curran","Paul Mc Kevitt"],"meta":["March 2017TELKOMNIKA (Telecommunication Computing Electronics and Control) 15(1):190","DOI:10.12928/telkomnika.v15i1.4581"],"references":["220723563_CubyHum_A_Fully_Operational_Query_by_Humming_System","19813760_Measurement_of_pitch_by_subharmonic_summation","3338317_Tutorial_on_MPEGaudio_compression","2568117_Media_Segmentation_using_Self-Similarity_Decomposition","2432255_An_Interface_for_Melody_Input","279421961_Efficient_Fault_Tolerant_Search_Techniques_for_Full-Text_Audio_Retrieval","220723536_A_Polyphonic_Music_Retrieval_System_Using_N-Grams","200688647_The_Directory_of_Tunes_and_Musical_Themes","3338406_Content-Based_Classification_Search_and_Retrieval_of_Audio"]}