{"id":"316108241_Real-Time_Vision-Based_Road_Sign_Recognition_Using_an_Artificial_Neural_Network","abstract":"Road sign recognition is a driver support function that can be used to notify and warn the driver by showing the restrictions that may be effective on the current stretch of road. Examples for such regulations are ‘traffic light ahead’ or ‘pedestrian crossing’ indications. The present investigation targets the recognition of Malaysian road and traffic signs in real-time. Real-time video is taken by a digital camera from a moving vehicle and real world road signs are then extracted using vision-only information. The system is based on two stages, one performs the detection and another one is for recognition. In the first stage, a hybrid color segmentation algorithm has been developed and tested. In the second stage, an introduced robust custom feature extraction method is used for the first time in a road sign recognition approach. Finally, a multilayer artificial neural network (ANN) has been created to recognize and interpret various road signs. It is robust because it has been tested on both standard and non-standard road signs with significant recognition accuracy. This proposed system achieved an average of 99.90% accuracy with 99.90% of sensitivity, 99.90% of specificity, 99.90% of f-measure, and 0.001 of false positive rate (FPR) with 0.3 s computational time. This low FPR can increase the system stability and dependability in real-time applications.","authors":["Kh Tohidul Islam","Ram Gopal Raj"],"meta":["March 2017Sensors 17(4):853","DOI:10.3390/s17040853","Project: University of Malaya Research Grant (UMRG)—RP026A-14AET"],"references":["306305796_Road_Lane_Detection_by_Discriminating_Dashed_and_Solid_Road_Lanes_Using_a_Visible_Light_Camera_Sensor","297591961_A_Novel_Neural_Network_Based_Method_Developed_for_Digit_Recognition_Applied_to_Automatic_Speed_Sign_Recognition","309612828_Algorithm_derivation_and_its_embedded_system_realization_of_speed_limit_detection_for_multiple_countries","309082171_Pushing_the_Speed_Limit_Towards_High-Accuracy_US_Traffic_Sign_Recognition_with_Convolutional_Neural_Networks","308845477_Malaysia_traffic_sign_recognition_with_convolutional_neural_network","308843549_Design_and_implementation_of_an_intelligent_vehicle_system_for_autonomous_valet_parking_service","304413873_Bangladeshi_road_sign_detection_based_on_YCbCr_color_model_and_DtBs_vector","300573744_Design_of_Real-Time_Transition_from_Driving_Assistance_to_Automation_Function_Bayesian_Artificial_Intelligence_Approach","286812264_Road-Sign_Text_Recognition_Architecture_for_Intelligent_Transportation_Systems","286650742_Cloud_Based_Self_Driving_Cars"]}