{"id":"316111439_emMAW_Computing_Minimal_Absent_Words_in_External_Memory","abstract":"Motivation: \nThe biological significance of minimal absent words has been investigated in genomes of organisms from all domains of life. For instance, three minimal absent words of the human genome were found in Ebola virus genomes (Silva et al., Bioinf., 2015). There exists an O(n)-time and O(n)-space algorithm for computing all minimal absent words of a sequence of length n on a fixed-sized alphabet based on suffix arrays (Barton et al., BMC Bioinf., 2014). A standard implementation of this algorithm, when applied to a large sequence of length n, requires more than 20n bytes of RAM. Such memory requirements are a significant hurdle to the computation of minimal absent words in large data sets.\n\nResults: \nWe present emMAW, the first external-memory algorithm for computing minimal absent words. A free open-source implementation of our algorithm is made available. This allows for computation of minimal absent words on far bigger data sets than was previously possible. Our implementation requires less than 3 hours on a standard workstation to process the full human genome when as little as 1 GB of RAM is made available. We stress that our implementation, despite making use of external memory, is fast; indeed, even on relatively smaller data sets when enough RAM is available to hold all necessary data structures, it is less than two times slower than state-of-the-art internal-memory implementations.\n\nAvailability: \nhttps://github.com/solonas13/maw (Free software under the terms of the GNU GPL).\n\nContact: \nalice.heliou@lix.polytechnique.fr , solon.pissis@kcl.ac.uk.\n\nSupplementary information: \nSupplementary data are available at Bioinformatics online.","authors":["Alice Heliou","Solon P Pissis","Simon J Puglisi"],"meta":["April 2017Bioinformatics 33(17)","DOI:10.1093/bioinformatics/btx209"],"references":["314970974_On_avoided_words_absent_words_and_their_application_to_biological_sequence_analysis","274511540_Three_minimal_sequences_found_in_Ebola_virus_genomes_and_absent_from_human_DNA","263390182_Linear-time_Computation_of_Minimal_Absent_Words_Using_Suffix_Array","236985430_Algorithms_and_Data_Structures_for_External_Memory","220110473_Automata_and_Forbidden_Words","280697047_External_memory_algorithms_and_data_structures_deaimg_with_massive_data","228526199_Words_and_forbidden_factors_1","222586049_Forbidden_Words_in_Symbolic_Dynamics"]}