{"id":"316123152_The_development_and_assessment_of_problem_solving_in_21st-century_schools","abstract":"The skills considered most essential in our modern societies are often called 21st-century skills. Problem solving is clearly one of them. Students will be expected to work in novel environments, face problems they have never seen and apply domain-general reasoning skills that are not tied to specific contents. Computerised dynamic problem solving can be used to create just such an interactive problem situation in order to assess these skills. It may therefore form the basis for a type of assessment which helps answer the question of how well schools are preparing their students for an unknown future. This chapter shows how education systems may benefit from such an assessment. It reviews educational methods that have aimed at developing students' higher-order thinking skills and indicates how experiences with these approaches can be used to improve problem solving, from direct teaching, through content-based methods, to innovative classroom processes. It outlines the evolution of large-scale assessment programmes, shows how assessing problem solving adds value and, finally, identifies some directions for further research.","authors":["Benő Csapó","Joachim Funke"],"meta":["April 2017","DOI:10.1787/9789264273955-3-en","In book: The nature of problem solving: Using research to inspire 21st Century Learning (pp.19-32)Chapter: The development and assessment of problem solving in 21st-century schoolsPublisher: Paris: OECD PublishingEditors: Benő Csapó, Joachim Funke"],"references":["317953371_How_We_Think_A_Theory_of_Goal-Oriented_Decision_Making_and_its_Educational_Applications","304664527_The_process_of_solving_complex_problems","301822420_Creative_Thinking_and_Problem_Solving_with_Depictive_and_Descriptive_Representations","287206086_A_Study_on_the_Training_of_Complex_Problem_Solving_Competence","284274473_Canadian_and_United_States_Students'_Performances_on_the_OECD's_PISA_2012_Problem_Solving_Assessment","273637820_Is_Education_Associated_With_Improvements_in_General_Cognitive_Ability_or_in_Specific_Skills","265381824_Improving_thinking_through_the_content_of_teaching","348865345_Can_We_Teach_Intelligence_A_Comprehensive_Evaluation_of_Feuerstein's_Instrumental_Enrichment_Programme","321611025_Assessment_and_Teaching_of_21st_Century_Skills_Methods_and_Approach","279634111_A_Field_Experimental_Study_of_Analytical_Problem_Solving_Competence_-_Investigating_Effects_of_Training_and_Transfer"]}