{"id":"316116116_Generalized_Recovery_From_Node_Failure_in_Virtual_Network_Embedding","abstract":"Network virtualization (NV) has evolved as a key enabling technology for offering the next generation network services. Recently, it is being rolled out in data center networks as a means to provide bandwidth guarantees to cloud applications. With increasing deployments of virtual networks (VNs) in commercial-grade networks with commodity hardware, VNs need to tackle failures in the underlying substrate network. In this paper, we study the problem of recovering a batch of VNs affected by a substrate node failure. The combinatorial possibilities of alternate embeddings of the failed virtual nodes and links of the VNs make the task of finding the most efficient recovery both non-trivial and intractable. Furthermore, any recovery approach ideally should not cause any service disruption for the unaffected parts of the VNs. We take into account these issues to design a generalized recovery approach that can achieve customized objectives such as fair treatment on the failed VNs, partial treatment based on priority, and so on. We provide Integer Linear Programming (ILP) formulations for two variants of our recovery scheme, namely, fair recovery model and prioritybased recovery model. We also propose a fast and scalable heuristic algorithm to tackle the computational complexity of the ILP solution. Evaluation results demonstrate that our heuristic performs close to the optimal solution and outperforms the stateof- the-art algorithm.","authors":["Nashid Shahriar","Reaz Ahmed","Shihabur Rahman Chowdhury","Aimal Khan"],"meta":["April 2017IEEE Transactions on Network and Service Management PP(99):1-1","DOI:10.1109/TNSM.2017.2693404","Project: Transport SDN Virtualization"],"references":["312123239_ReViNE_Reallocation_of_Virtual_Network_Embedding_to_Eliminate_Substrate_Bottlenecks","310820833_Surviving_Multiple_Failures_in_Multicast_Virtual_Networks_With_Virtual_Machines_Migration","306378094_ReNoVatE_Recovery_from_Node_Failure_in_Virtual_Network_Embedding","303695606_Dedicated_Protection_for_Survivable_Virtual_Network_Embedding","303464066_Optimal_Polynomial_Time_Algorithm_for_Restoring_Multicast_Cloud_Services","303376007_Surviving_Link_Failures_in_Multicast_VN_Embedded_Applications","301716078_Multi-Path_Link_Embedding_for_Survivability_in_Virtual_Networks","312535209_On_the_single-source_unsplittable_flow_problem","310593260_Restoration_Methods_for_Cloud_Multicast_Virtual_Networks","306217986_Volley_Automated_data_placement_for_geo-distributed_cloud_services"]}