{"id":"316167781_A_GitHub_Garage_for_a_Digital_Humanities_Course","abstract":"In August 2015, Pitt-Greensburg digital humanities instructors implemented the DHClass-Hub, a GitHub repository designed to familiarize students with GitHub through daily usage. This GitHub environment functions like a cooperative garage where students are both the clients and the mechanics. In the repository space they share code from assignments and projects that they need help with debugging, so that they and their fellow students and instructors can inspect, advise on, and repair it together. Although the DHClass-Hub was established primarily to help students gain confidence with GitHub in order to improve their management of their own semester projects, the repository unexpectedly became the locus of a flipped learning experience, where the liveliest learning activity of the coding courses occurs in dialogues initiated by students. The DHClass-Hub is openly available to the public, maintained continuously over semesters, and shared by two courses, making its archive of open and closed Issues an increasingly beneficial searchable resource over time for the students and for the wider GitHub community. The repository’s development was the initiative of a student who became a teaching assistant in the course and wrote its accompanying tutorial on accessing GitHub at the command line. The authors find that the most important benefit to using GitHub is not to support the short-term priorities of a semester-long course, but, rather, to encourage sustainable and well-documented digital development, both of student projects and the course itself.","authors":["Elisa Beshero-Bondar","Rebecca J. Parker"],"meta":["April 2017","DOI:10.1007/978-3-319-54226-3_15","In book: New Directions for Computing Education (pp.259-276)"],"references":["334185643_Programming_with_Humanists_Reflections_on_Raising_an_Army_of_Hacker-Scholars_in_the_Digital_Humanities","305067442_Using_GitHub_in_the_classroom_-_a_collaborative_learning_experience","300918133_Beyond_the_Flipped_Classroom"]}