{"id":"316185239_Assessing_the_Determinants_of_Cloud_Computing_Services_for_Utilizing_Health_Information_Systems_A_Case_Study","abstract":"Health information systems refer to the utilization of IT-related systems to capture, store, manage, or transmit information related to the health of individuals or the activities within the health sector. Utilizing cloud services in the healthcare sector is a flexible solution to improve the performance of an organization as it can provide numerous features such as self-service, ubiquitous network access, resource pooling, rapid elasticity, and pay-per-use pattern. A preliminary study was conducted in the Iraqi public healthcare sector to obtain preliminary data acquisition about the current situation of IT and to determine the key factors associated with the utilization of cloud computing to foster current health information systems. During the study, a total of 30 technicians and physicians from four hospitals in Iraq were invited for interview in which the researcher directed questions in a semi-structured form. The findings of the investigation concluded the key determinant factors; these include factors related to the environmental structure such as software, hardware, cost, network, and training. Other factors that were found related to the system such as compatibility, complexity, data security, and privacy. These two aspects were found to influence personal factors related to the behavioural control and confirmation to utilize cloud computing services in this sector.","authors":["Ahmed Meri","Mohammad Khatim Hasan"],"meta":["March 2017International Journal on Advanced Science Engineering and Information Technology 7(2):503-510","DOI:10.18517/ijaseit.7.2.1814","Project: Modelling a Cloud Computing Utilization for Health Information Systems"],"references":["339653576_Evaluation_of_Organizational_Readiness_in_Information_Systems_Adoption_A_Case_Study","337927365_E-business_and_cloud_computing_awareness_for_Malaysian_SMEs_A_recommendation_from_academic_and_industry_perspectives","327656057_The_Impact_of_Percieved_Usefulness_Ease_of_Use_and_Trust_on_Managers'_Acceptance_of_e-Commerce_Services_in_Small_and_Medium-Sized_Enterprises_SMEs_in_Palestine","312421095_An_Empirical_Study_of_Information_Security_Management_Success_Factors","291957164_A_Review_on_IT_Outsourcing_Approach_and_a_Proposed_IT_Outsourcing_Model_for_Malaysian_SMEs_in_e-Business_Adoption","286398353_Measuring_organizational_readiness_in_information_systems_adoption","282796616_Enabling_Better_Interoperability_for_HealthCare_Lessons_in_Developing_a_Standards_Based_Application_Programing_Interface_for_Electronic_Medical_Record_Systems","349901590_Writing_Interview_Protocols_and_Conducting_Interviews_Tips_for_Students_New_to_the_Field_of_Qualitative_Research","310748938_Qualitative_research_practice_A_guide_for_social_science_students_and_researchers","288960072_The_organizational_critical_success_factors_for_adopting_cloud_computing_in_SMEs"]}