{"id":"316177005_Comparison_and_Computational_Performance_of_Tsunami-HySEA_and_MOST_Models_for_LANTEX_2013_Scenario_Impact_Assessment_on_Puerto_Rico_Coasts","abstract":"Tsunami-HySEA model is used to simulate the Caribbean LANTEX 2013 scenario (LANTEX is the acronym for Large AtlaNtic Tsunami Exercise, which is carried out annually). The numerical simulation of the propagation and inundation phases is performed with a single integrated model but using different mesh resolutions and nested meshes. Special emphasis is placed on assessing the most exposed coastal areas at Puerto Rico affected by this event. Some comparisons with the MOST tsunami model available at the University of Puerto Rico (UPR) are made. Both models compare well for propagating tsunami waves in open sea, producing very similar results. In near-shore shallow waters, Tsunami-HySEA should be compared with the inundation version of MOST, since the propagation version is limited to deeper waters. For inundation, larger differences between model results are observed. Nevertheless, the most striking difference resides in computational time; Tsunami-HySEA is coded using the advantages of GPU architecture, and can produce a 4 h simulation in a 60 arc-sec resolution grid for the whole Caribbean Sea in less than 4 min with a single GPU and as fast as 11 s with 32 GPUs. When details about the inundation must be simulated, a 1 arc-sec (approximately 30 m) inundation resolution mesh covering all of Puerto Rico, an island with dimensions of 160 km east–west and 56 km north–south, is used, and a three-level nested meshes technique implemented. In this case approximately 8 ¾ h of wall clock time is needed for a 2-h simulation in a single GPU (versus more than 2 days for the MOST inundation, running three different parts of the island—West, Center, East—at the same time due to memory limitations in MOST). When domain decomposition techniques are finally implemented by breaking up the computational domain into sub-domains and assigning a GPU to each sub-domain (multi-GPU Tsunami-HySEA version), we show that the wall clock time significantly decreases, allowing high-resolution inundation modeling in very short computational times, reducing, for example, if eight GPUs are used, the wall clock time to around 1 ½ h. Besides, these computational times are obtained at a modest hardware cost compared with present tsunami models.","authors":["Jorge Macías","Aurelio Mercado","José Manuel González Vida","Sergio Ortega"],"meta":["September 2016","DOI:10.1007/978-3-319-55480-8_16","In book: Global Tsunami Science: Past and Future, Volume I (pp.3973-3997)","Project: Development of efficient hydrodynamic and morphodynamic simulators for risk assessment and forecasting (SIMURISK)"],"references":["309858543_NTHMP_Benchmarking_of_Tsunami-HySEA_model_for_propagation_and_inundation_The_2011_NTHMP_Model_Benchmarking_Workshop","277757438_Tsunami-HySEA_A_GPU-based_model_for_Tsunami_Early_Warning_Systems","272787621_HySEA_model_verification_for_Tohoku_2011_Tsunami_Application_for_mitigation_tsunami_assessment","265250059_The_Lituya_Bay_landslide-generated_mega-tsunami_Numerical_simulation_and_sensitivity_analysis","265161214_Non-linear_Shallow_Water_Models_for_coastal_run-up_simulations","258783538_Non-linear_Shallow_Water_Models_for_coastal_run-up_simulations","228575044_Efficient_shallow_water_simulations_on_GPUs_Implementation_visualization_verification_and_validation","228563132_Numerical_treatment_of_wetdry_fronts_in_shallow_flows_with_a_modified_Roe_scheme","225941116_Simulation_and_visualization_of_the_Saint-Venant_system_using_GPUs","280020417_Surface_Deformation_due_to_Shear_and_Tensile_Faults_in_a_Half_Space","266439966_Real-Time_Tsunami_Simulation_on_Multi-node_GPU_Cluster","258967229_The_Al-Borani_landslide_and_associated_tsunami_A_modelling_approach","256918818_Efficient_GPU_implementation_of_a_two_waves_TVD-WAF_method_for_the_two-dimensional_one_layer_shallow_water_system_on_structured_meshes","249970565_Numerical_Modeling_of_Tidal_Wave_Runup","238619755_USER_MANUAL_FOR_COMCOT_VERSION_17_FIRST_DRAFT","229060552_GPU_Acceleration_of_Tsunami_Propagation_Model","222525976_On_a_well-balanced_high-order_finite_volume_scheme_for_shallow_water_equations_with_topography_and_dry_areas","222299698_Well-balanced_finite_volume_schemes_for_2D_non-homogeneous_hyperbolic_systems_Application_to_the_dam_break_of_Aznalcollar","220095837_The_numerical_treatment_of_wetdry_fronts_in_shallow_flows_Application_to_one-layer_and_two-layer_systems","215701001_A_GPU-Based_Simulation_of_Tsunami_Propagation_and_Inundation","45902892_The_VOLNA_code_for_the_numerical_modeling_of_tsunami_waves_Generation_propagation_and_inundation"]}