{"id":"316188597_BYOD_or_not_A_comparison_of_two_assessment_strategies_for_student_learning","abstract":"This study investigated the effects of the BYOD (bring your own device) approach on student language learning. In the research scenario, junior high school students brought their Android-based smart phones to class in order to engage in language evaluation activities, where an application (app) called Socrative was used as a learning assessment tool. A quasi-experimental pre-test and post-test control group design was used to answer the research question. 46 eighth-grade students from two classes at a public junior high school in Taiwan participated in the four-week educational experiment. Student participants received 6 quizzes as a formative evaluation during the experiment. A learning achievement test (summative evaluation) was developed to measure the students' understanding of English vocabulary and grammar. One month after the completion of the summative evaluation, the same achievement test (delayed summative evaluation) with different item numbers was administered to assess the long-term transfer of learning in the students. A self-report questionnaire and an informal interview were used to ascertain the students' learning experiences. The formative evaluation results showed that students in the traditional instruction class outperformed those in the BYOD instruction class because several BYOD students were not familiar with the BYOD approach. Although the BYOD and the traditional instruction approaches yielded similar summative evaluation and delayed summative evaluation results, the BYOD approach demonstrated a valuable benefit on the students' long-term transfer of learning. Students in the BYOD instruction class exhibited a steady growth on learning outcomes and subsequently scored higher on the learning retention segment of the study. In addition, the BYOD teaching practice advanced the students' second language learning experiences, particularly regarding learning motivation and interest. The results of the study suggested that schools and teachers should explore creative ways to integrate traditional and BYOD approaches.","authors":["Pao-Nan Chou","Chi-Cheng Chang","Ching-Hsin Lin"],"meta":["April 2017Computers in Human Behavior 74","DOI:10.1016/j.chb.2017.04.024"],"references":["283849723_Prezi_versus_PowerPoint_The_effects_of_varied_digital_presentation_tools_on_students'_learning_performance","273331277_Mobile_phones_in_the_classroom_Preservice_teachers_answer_the_call","269407880_The_wear_out_effect_of_a_game-based_student_response_system","262235801_Contract-Based_Blame_Assignment_by_Trace_Analysis","304861449_e-Learning_and_the_Science_of_Instruction_Fourth_Edition","287566918_The_Innovative_Use_of_Personal_Smart_Devices_by_Students_to_Support_their_Learning","285914267_Use_of_cell_phones_in_classroom_teaching_boon_or_bane","284613034_Mobile_Learning_Definition_Uses_and_Challenges","279637329_Emerging_technologies_Mobile_apps_for_language_learning","269777673_Use_of_clickers_vs_mobile_devices_for_classroom_polling"]}