{"id":"316115180_Burstiness_and_tie_activation_strategies_in_time-varying_social_networks","abstract":"The recent developments in the field of social networks shifted the focus from static to dynamical representations, calling for new methods for their analysis and modelling. Observations in real social systems identified two main mechanisms that play a primary role in networks’ evolution and influence ongoing spreading processes: the strategies individuals adopt when selecting between new or old social ties, and the bursty nature of the social activity setting the pace of these choices. We introduce a time-varying network model accounting both for ties selection and burstiness and we analytically study its phase diagram. The interplay of the two effects is non trivial and, interestingly, the effects of burstiness might be suppressed in regimes where individuals exhibit a strong preference towards previously activated ties. The results are tested against numerical simulations and compared with two empirical datasets with very good agreement. Consequently, the framework provides a principled method to classify the temporal features of real networks, and thus yields new insights to elucidate the effects of social dynamics on spreading processes.","authors":["Enrico Ubaldi","Alessandro Vezzani","Márton Karsai","Nicola Perra"],"meta":["April 2017Scientific Reports 7(1):46225","DOI:10.1038/srep46225"],"references":["309814116_Asymptotic_theory_of_time-varying_social_networks_with_heterogeneous_activity_and_tie_allocation","301728601_Spectral_centrality_measures_in_temporal_networks","301233136_Diffusion_of_scientific_credits_and_the_ranking_of_scientists","277603308_From_calls_to_communities_a_model_for_time_varying_social_networks","276211378_Attention_on_Weak_Ties_in_Social_and_Communication_Networks","274730583_From_seconds_to_months_multi-scale_dynamics_of_mobile_telephone_calls","303818468_The_strength_of_weak_ties_A_network_theory_revisited'","285610713_Social_PhenomenaFrom_Data_Analysis_to_Models","280773148_Modern_temporal_network_theory_A_colloquium","275255063_Epidemic_process_on_activity-driven_modular_networks"]}