{"id":"316184617_Oracles_and_Query_Lower_Bounds_in_Generalised_Probabilistic_Theories","abstract":"We investigate the connection between interference and computational power within the operationally defined framework of generalised probabilistic theories. To compare the computational abilities of different theories within this framework we show that any theory satisfying four natural physical principles possess a well-defined oracle model. Indeed, we prove a subroutine theorem for oracles in such theories which is a necessary condition for the oracle model to be well-defined. The four principles are: causality (roughly, no signalling from the future), purification (each mixed state arises as the marginal of a pure state of a larger system), strong symmetry (existence of a rich set of nontrivial reversible transformations), and informationally consistent composition (roughly: the information capacity of a composite system is the sum of the capacities of its constituent subsystems). Sorkin has defined a hierarchy of conceivable interference behaviours, where the order in the hierarchy corresponds to the number of paths that have an irreducible interaction in a multi-slit experiment. Given our oracle model, we show that if a classical computer requires at least n queries to solve a learning problem, because fewer queries provide no information about the solution, then the corresponding \"no-information\" lower bound in theories lying at the kth level of Sorkin's hierarchy is \n\n⌈\n\nn\n/\nk\n\n⌉\n\n. This lower bound leaves open the possibility that quantum oracles are less powerful than general probabilistic oracles, although it is not known whether the lower bound is achievable in general. Hence searches for higher-order interference are not only foundationally motivated, but constitute a search for a computational resource that might have power beyond that offered by quantum computation.","authors":["Ciaran Lee","John Selby","Howard Barnum"],"meta":["August 2018Foundations of Physics 48(3)","DOI:10.1007/s10701-018-0198-4"],"references":["314115451_The_computational_landscape_of_general_physical_theories","313279827_Obtaining_tight_bounds_on_higher-order_interferences_with_a_5-path_interferometer","312945220_A_no-go_theorem_for_theories_that_decohere_to_quantum_mechanics","311761902_Probabilistic_theories_with_purification_phys","309113655_Deriving_Grover's_lower_bound_from_simple_physical_principles","325892638_Picturing_quantum_processes_A_first_course_in_quantum_theory_and_diagrammatic_reasoning","320488839_The_Information_Content_of_Systems_in_General_Physical_Theories","310819542_The_Space_Just_Above_BQP","307752380_Conservation_of_information_and_the_foundations_of_quantum_mechanics","307541032_Quantum_Protocols_within_Spekkens'_Toy_Model"]}