{"id":"316178299_Competitive_analysis_of_bi-directional_non-preemptive_conversion","abstract":"In an online conversion problem a player is converting one asset into another, e.g. dollars to yen, based on a finite sequence of unknown future conversion rates. When a new rate is announced the player must decide how many dollars (yen) to convert to yen (dollars) according to this rate. Conversion is over when the last rate has appeared. The objective is to maximize terminal wealth after conversion. In uni-directional conversion dollars are converted to yen and in bi-directional conversion not only dollars to yen but also yen to dollars may be converted. If all current wealth has to be converted at one rate we call the problem non-preemptive; if parts of the current wealth can be converted at one rate we call it preemptive. We assume that lower and upper bounds on conversion rates are given. Uni-directional preemptive and non-preemptive and bi-directional preemptive conversion is investigated in El Yaniv et al. (Proceeding 33rd annual symposium on foundations of computer science, pp 327–333, 1992, Algorithmica 30:101–139, 2001). Their results for bi-directional preemptive conversion are improved by Dannoura and Sakurai (Inf Process Lett 66:27–33, 1998). The suggested improvement is conjectured not to be optimal for bi-directional preemptive conversion. There are no results for optimal bi-directional non-preemptive conversion. We investigate the problem of bi-directional non-preemptive online conversion. We present lower bounds, upper bounds and an optimal algorithm to solve the problem. Moreover, we prove that the algorithm of Dannoura and Sakurai 1998 is not optimal for bi-directional preemptive conversion.","authors":["Günter Schmidt"],"meta":["November 2017Journal of Combinatorial Optimization 34(2)","DOI:10.1007/s10878-017-0131-3"],"references":["225453208_Optimal_Search_and_One-Way_Trading_Online_Algorithms","225264214_Optimal_Algorithms_for_k-Search_with_Application_in_Option_Pricing","297472914_Optimal_buy-and-hold_strategies_for_financial_markets_with_bounded_daily_returns","263762030_An_improvement_on_El-Yaniv-Fiat-Karp-Turpin's_money-making_bi-directional_trading_strategy","221335288_Optimal_Algorithms_for_the_Online_Time_Series_Search_Problem","220223579_Online_Search_with_Time-Varying_Price_Bounds","220154901_Optimal_algorithms_for_the_online_time_series_search_problem","220112575_An_Improvement_on_El-Yaniv-Fiat-Karp-Turpin's_Money-Making_Bi-Directional_Trading_Strategy","220110803_Online_algorithms_for_the_general_k-search_problem","220088954_Optimal_algorithms_for_online_time_series_search_and_one-way_trading_with_interrelated_prices","3513533_Competitive_analysis_of_financial_games"]}