{"id":"316184399_Aspects_of_word_and_sentence_processing_during_reading_Arabic_evidence_from_eye_movements","abstract":"Arabic is a Semitic language that remains relatively understudied compared to Indo-European languages. In a number of experiments, we investigated aspects of reading in Arabic by tracking readers’ eye movements during reading. Eye tracking is a sensitive and non-invasive methodology to study reading that provides a highly detailed account of the time course of processing linguistic stimuli. Indeed, a huge body of evidence supports the suggestion that readers’ eye movements are tightly linked to the mental processes they engage in during reading. Arabic features a number of unique linguistic and typographical characteristics. These include the potential use of diacritical marks to indicate how a word is pronounced, and also the clear preference of readers for using font types that preserve a natural variability in printed letter sizes. In our research we documented for the first time in Arabic the influence on eye movements of word-level variables such as number of letters, spatial extent, initial bigram characteristics, and the presence or absence of Arabic diacritical marks. Our results replicated and expanded upon the existing literature that uses eye movements to study linguistic processing. Specifically, our findings further clarified how each of these word aspects influence the eye guidance system, as well as the extent, and time course of this influence. We also investigated aspects of Arabic sentence processing where we documented the influences on specific words and on global sentence processing of readers’ grammatical parsing preferences, expectations for certain diacritization patterns, as well as sentence structure and diacritization mode. We consider the investigations presented here to be a step towards widening the evidence base on which our understanding of reading, in universal terms, is founded.","authors":["Ehab W. Hermena"],"meta":["April 2016"],"references":[]}