{"id":"316236431_ggplot2","abstract":"This new edition to the classic book by ggplot2 creator Hadley Wickham highlights compatibility with knitr and RStudio. ggplot2 is a data visualization package for R that helps users create data graphics, including those that are multi-layered, with ease. With ggplot2, it's easy to:\n\n• produce handsome, publication-quality plots with automatic legends created from the plot specification\n\n• superimpose multiple layers (points, lines, maps, tiles, box plots) from different data sources with automatically adjusted common scales\n\n• add customizable smoothers that use powerful modeling capabilities of R, such as loess, linear models, generalized additive models, and robust regression\n\n• save any ggplot2 plot (or part thereof) for later modification or reuse\n\n• create custom themes that capture in-house or journal style requirements and that can easily be applied to multiple plots\n\n• approach a graph from a visual perspective, thinking about how each component of the data is represented on the final plot\n\nThis book will be useful to everyone who has struggled with displaying data in an informative and attractive way. Some basic knowledge of R is necessary (e.g., importing data into R). ggplot2 is a mini-language specifically tailored for producing graphics, and you'll learn everything you need in the book. After reading this book you'll be able to produce graphics customized precisely for your problems, and you'll find it easy to get graphics out of your head and on to the screen or page. New to this edition:<\n• Brings the book up-to-date with ggplot2 1.0, including major updates to the theme system\n\n• New scales, stats and geoms added throughout\n\n• Additional practice exercises\n\n• A revised introduction that focuses on ggplot() instead of qplot()\n\n• Updated chapters on data and modeling using tidyr, dplyr and broom","authors":["Hadley Wickham"],"meta":["January 2016","DOI:10.1007/978-3-319-24277-4","ISBN: 978-3-319-24275-0"],"references":[]}