{"id":"316240064_Internet-of-Things_Based_Smart_Cities_Recent_Advances_and_Challenges","abstract":"The Internet of Things is a novel cutting edge technology that proffers to connect a plethora of digital devices endowed with several sensing, actuation, and computing capabilities with the Internet, thus offering manifold new services in the context of a smart city. The appealing IoT services and big data analytics are enabling smart city initiatives all over the world. These services are transforming cities by improving infrastructure and transportation systems, reducing traffic congestion, providing waste management, and improving the quality of human life. In this article, we devise a taxonomy to best bring forth a generic overview of the IoT paradigm for smart cities, integrated ICT, network types, possible opportunities and major requirements. Moreover, an overview of the up-to-date efforts from standard bodies is presented. Later, we give an overview of existing open source IoT platforms for realizing smart city applications followed by several exemplary case studies. In addition, we summarize the latest synergies and initiatives worldwide taken to promote IoT in the context of smart cities. Finally, we highlight several challenges in order to give future research directions.","authors":["Yasir Mehmood","Farhan Ahmad","Ibrar Yaqoob","Asma Adnane"],"meta":["September 2017IEEE Communications Magazine 55(9)","DOI:10.1109/MCOM.2017.1600514"],"references":["283236612_Integration_of_Cloud_computing_and_Internet_of_Things_A_survey","270107935_Security_privacy_and_trust_in_Internet_of_Things_The_road_ahead","268191223_A_Generic_IoT_Architecture_for_Smart_Cities","262150778_An_Information_Framework_for_Creating_a_Smart_City_Through_Internet_of_Things","260670439_Bootstrapping_Smart_Cities_through_a_Self-Sustainable_Model_Based_on_Big_Data_Flows","260540297_Internet_of_Things_for_Smart_Cities","257878049_Combining_Cloud_and_sensors_in_a_smart_city_environment","303352814_Random_Access_Preamble_Design_and_Detection_for_3GPP_Narrowband_IoT_Systems","286562267_Narrowband_LTE-M_System_for_M2M_Communication","228095891_Internet_of_Things_IoT_A_Vision_Architectural_Elements_and_FutureDirections"]}