{"id":"316220619_Balancing_Speed_and_Coverage_by_Sequential_Seeding_in_Complex_Networks","abstract":"Information spreading in complex networks is often modeled as diffusing information with certain probability from nodes that possess it to their neighbors that do not. Information cascades are triggered when the activation of a set of initial nodes – seeds – results in diffusion to large number of nodes. Here, several novel approaches for seed initiation that replace the commonly used activation of all seeds at once with a sequence of initiation stages are introduced. Sequential strategies at later stages avoid seeding highly ranked nodes that are already activated by diffusion active between stages. The gain arises when a saved seed is allocated to a node difficult to reach via diffusion. Sequential seeding and a single stage approach are compared using various seed ranking methods and diffusion parameters on real complex networks. The experimental results indicate that, regardless of the seed ranking method used, sequential seeding strategies deliver better coverage than single stage seeding in about 90% of cases. Longer seeding sequences tend to activate more nodes but they also extend the duration of diffusion. Various variants of sequential seeding resolve the trade-off between the coverage and speed of diffusion differently.","authors":["Jarosław Jankowski","Piotr Bródka","Przemysław Kazienko","Boleslaw K. Szymanski"],"meta":["December 2017Scientific Reports 7(1)","DOI:10.1038/s41598-017-00937-8"],"references":["310823831_Scalable_Methods_for_Adaptively_Seeding_a_Social_Network","304555048_Scalable_Methods_for_Adaptively_Seeding_a_Social_Network","301856181_Identifying_a_set_of_influential_spreaders_in_complex_networks","291821968_Success_Factors_in_Product_Seeding_The_Role_of_Homophily","287483617_A_Novel_Top-k_Strategy_for_Influence_Maximization_in_Complex_Networks_with_Community_Structure","283872657_Dynamic_influence_maximization_under_increasing_returns_to_scale","316800398_Springer_Series_in_Statistics","314714144_Sequential_Analysis_Tests_and_Confidence_Intervals","305720251_A_New_Product_Growth_Model_for_Consumer_Durables","295524747_Erratum_Demand_and_Supply_Dynamics_for_Sequentially_Released_Products_in_International_Markets_The_Case_of_Motion_Pictures_Marketing_Science_Summer_2003_223_329-354"]}