{"id":"316259928_An_Access_Control_Model_for_Resource_Sharing_Based_on_the_Role-Based_Access_Control_Intended_for_Multi-Domain_Manufacturing_Internet_of_Things","abstract":"Manufacturing Internet of Things (MIoT) represents the manufacturing oriented to Internet of Things (IoT) with two important characteristics, resource sharing and process collaboration. Access control in resource sharing is very important for MIoT operation safety. This paper presents an access control model for resource sharing based on the Role-Based Access Control (RBAC) intended for multi-domain MIoT. In multi-domain systems, in order to response on the assigning request for permission for the certain role from the certain user, an authority action sequence named the authorization route is employed to determine an appropriate authorization state. In this paper, the best authorization route with the least spread of permissions is defined as an optimal authorization route. We employed an intelligent planning theory to model the authorization route problem and to develop a solution algorithm called PGAO*, which can support external evaluation of both single-goal-role authorization routes and multi-goal-role authorization routes. In addition, some simple policies for solving of authorization route problem are presented. The proposed access control model provides a quick and efficient authorization decision support for administrators in collaborative domain and ensures a secure access in resource sharing in MIoT.","authors":["Qiang Liu","Hao Zhang","Jiafu Wan","Xin Chen"],"meta":["April 2017IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2017.2693380"],"references":["309884609_Heterogeneous_ad_hoc_networks_Architectures_advances_and_challenges","302919495_Software-Defined_Industrial_Internet_of_Things_in_the_Context_of_Industry_40","271681772_Security_of_the_Internet_of_Things_Perspectives_and_challenges","313193607_Role_based_access_control_models","310830648_A_model_for_role_administration_using_organization_structure","309658859_Revisiting_unknown_RFID_tag_identification_in_large-scale_internet_of_things","303872301_An_Efficient_Tree-Based_Self-Organizing_Protocol_for_Internet_of_Things","289504267_Towards_Smart_Factory_for_Industry_40_A_Self-organized_Multi-agent_System_with_Big_Data_Based_Feedback_and_Coordination","289499731_A_Greedy_Model_with_Small_World_for_Improving_the_Robustness_of_Heterogeneous_Internet_of_Things","274039718_Cyber-Physical_Systems_for_Optimal_Energy_Management_Scheme_of_Autonomous_Electric_Vehicle"]}