{"id":"316258896_Understanding_mobile_banking_individual_performance_The_DeLone_McLean_model_and_the_moderating_effects_of_individual_culture","abstract":"Purpose: The purpose of this paper is to investigate the effects of Hall’s cultural dimension on the mobile banking (m-banking) individual performance in the m-banking post-adoption stage. Design/methodology/approach: This paper proposes using the DeLone and McLean IS success model moderated by Hall’s cross-cultural dimensions of high-low context and monochronic-polychronic time perception to evaluate the m-banking individual performance in the post-adoption stage. Findings: The results reveal that usage and user satisfaction are important precedents of individual performance, and it also reveals the importance of the moderating effects of monochronic inclination between the usage and user satisfaction to individual performance. The system, information, and service quality affect user’s satisfaction positively. Originality/value: While the majority of earlier research focuses on potential adopters, this study seeks to understand the significance of cultural effects on the m-banking individual performance in the post-adoption stage, as these are important to explain use and attract potential adopters of m-banking.","authors":["Carlos Tam","Tiago Oliveira"],"meta":["June 2017Internet Research 27(3)","DOI:10.1108/IntR-05-2016-0117"],"references":["311766005_The_Partial_Least_Squares_Approach_to_Structural_Equation_Modeling","325671485_Accounting_for_common_method_variance_in_cross-sectional_research_designs","323424582_Statistical_power_analysis_for_the_behavioral_sciences","322780924_Factors_Influencing_the_Adoption_of_Internet_Banking","314361720_Toward_a_Theory-Based_Measurement_of_Culture","313604424_Evaluating_Structural_Equation_Models_with_Unobservable_Variables_and_Measurement_Error","313599252_Factors_influencing_the_adoption_of_Internet_banking","312984568_Perceived_usefulness_perceived_ease_and_user_acceptance_of_information_technology","311642936_Individual_well-being_and_performance_at_work_A_conceptual_and_theoretical_overview","311573689_A_Primer_on_Partial_Least_Squares_Structural_Equation_Modeling_PLS-SEM"]}