{"id":"316235117_Ruling_out_Higher-Order_Interference_from_Purity_Principles","abstract":"As first noted by Rafael Sorkin, there is a limit to quantum interference. The interference pattern formed in a multi-slit experiment is a function of the interference patterns formed between pairs of slits; there are no genuinely new features resulting from considering three slits instead of two. Sorkin has introduced a hierarchy of mathematically conceivable higher-order interference behaviours, where classical theory lies at the first level of this hierarchy and quantum theory theory at the second. Informally, the order in this hierarchy corresponds to the number of slits on which the interference pattern has an irreducible dependence. Many authors have wondered why quantum interference is limited to the second level of this hierarchy. Does the existence of higher-order interference violate some natural physical principle that we believe should be fundamental? In the current work we show that natural physical principles can be found which limit interference behaviour to second-order, or \"quantum-like\", interference, but that do not restrict us to the entire quantum formalism. We work within the operational framework of generalised probabilistic theories, and prove that any theory satisfying Causality, Purity Preservation, Pure Sharpness, and Purification---four principles that formalise the fundamental character of purity in nature---exhibits at most second-order interference. Hence these theories are, at least conceptually, very \"close\" to quantum theory. Along the way we show that systems in such theories correspond to Euclidean Jordan Algebras. Hence, they are self-dual and, moreover, multi-slit experiments in such theories are described by pure projectors.","authors":["Howard Barnum","Ciaran Lee","Carlo Maria Scandolo","John Selby"],"meta":["April 2017Entropy 19(6)","DOI:10.3390/e19060253"],"references":["314115451_The_computational_landscape_of_general_physical_theories","313279827_Obtaining_tight_bounds_on_higher-order_interferences_with_a_5-path_interferometer","312945220_A_no-go_theorem_for_theories_that_decohere_to_quantum_mechanics","312908211_Leaks_Quantum_Classical_Intermediate_and_More","311761902_Probabilistic_theories_with_purification_phys","310610463_On_the_ongoing_experiments_looking_for_higher-order_interference_What_are_they_really_testing","309113655_Deriving_Grover's_lower_bound_from_simple_physical_principles","325892638_Picturing_quantum_processes_A_first_course_in_quantum_theory_and_diagrammatic_reasoning","320488839_The_Information_Content_of_Systems_in_General_Physical_Theories","311925989_Experimental_Test_of_Born's_Rule_by_Inspecting_Third-Order_Quantum_Interference_on_a_Single_Spin_in_Solids"]}