{"id":"316244066_3D_fully_convolutional_networks_for_subcortical_segmentation_in_MRI_A_large-scale_study","abstract":"This study investigates a 3D and fully convolutional neural network (CNN) for subcortical brain structure segmentation in MRI. 3D CNN architectures have been generally avoided due to their computational and memory requirements during inference. We address the problem via small kernels, allowing deeper architectures. We further model both local and global context by embedding intermediate-layer outputs in the final prediction, which encourages consistency between features extracted at different scales and embeds fine-grained information directly in the segmentation process. Our model is efficiently trained end-to-end on a graphics processing unit (GPU), in a single stage, exploiting the dense inference capabilities of fully CNNs. We performed comprehensive experiments over two publicly available datasets. First, we demonstrate a state-of-the-art performance on the ISBR dataset. Then, we report a large-scale multi-site evaluation over 1112 unregistered subject datasets acquired from 17 different sites (ABIDE dataset), with ages ranging from 7 to 64 years, showing that our method is robust to various acquisition protocols, demographics and clinical factors. Our method yielded segmenta-tions that are highly consistent with a standard atlas-based approach, while running in a fraction of the time needed by atlas-based methods and avoiding registration/normalization steps. This makes it convenient for massive multi-site neuroanatomical imaging studies. To the best of our knowledge, our work is the first to study subcortical structure segmentation on such large-scale and heterogeneous data.","authors":["Jose Dolz","Christian Desrosiers","Ismail Ben Ayed"],"meta":["April 2017NeuroImage 170","DOI:10.1016/j.neuroimage.2017.04.039"],"references":["312067495_Efficient_multi-scale_3D_CNN_with_fully_connected_CRF_for_accurate_brain_lesion_segmentation","305196650_Going_deeper_with_convolutions","319770272_Delving_Deep_into_Rectifiers_Surpassing_Human-Level_Performance_on_ImageNet_Classification","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","311609141_Semantic_Image_Segmentation_with_Task-Specific_Edge_Detection_Using_CNNs_and_a_Discriminatively_Trained_Domain_Transform","309456686_Brain_tumor_segmentation_with_deep_neural_networks","308845624_Deep_neural_networks_for_anatomical_brain_segmentation","308808582_Hypercolumns_for_object_segmentation_and_fine-grained_localization","304339354_Multi-scale_structured_CNN_with_label_consistency_for_brain_MR_image_segmentation","303095486_Consistent_cortical_reconstruction_and_multi-atlas_brain_segmentation"]}