{"id":"316230057_A_Survey_of_Dictionary_Learning_Algorithms_for_Face_Recognition","abstract":"During the past several years, as one of the most successful applications of sparse coding and dictionary learning, dictionary based face recognition has received significant attention. Although some surveys of sparse coding and dictionary learning have been reported, there is no specialized survey concerning dictionary learning algorithms for face recognition. This paper provides a survey of dictionary learning algorithms for face recognition. To provide a comprehensive overview, we not only categorize existing dictionary learning algorithms for face recognition but also present details of each category. Since the number of atoms has an important impact on classification performance, we also review the algorithms for selecting the number of atoms. Specifically, we select six typical dictionary learning algorithms with different numbers of atoms to perform experiments on face databases. In summary, this survey provides a broad view of dictionary learning algorithms for face recognition and advances study in this field. It is very useful for readers to understand the profiles of this subject and to grasp the theoretical rationales and potentials as well as their applicability to different cases of face recognition.","authors":["Yong xu","Zhengming Li","Jian Yang","David Zhang"],"meta":["April 2017IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2017.2695239"],"references":["304187221_Adaptive_Spatial-Spectral_Dictionary_Learning_for_Hyperspectral_Image_Restoration","289166741_Adaptive_Spatial-Spectral_Dictionary_Learning_for_Hyperspectral_Image_Denoising","312758823_Support_Vector_Guided_Dictionary_Learning","309107783_Analysis-synthesis_dictionary_learning_for_universality-particularity_representation_based_classification","294723097_Learning_Kernel_Extended_Dictionary_for_Face_Recognition","293043435_Multi-spectral_Low-rank_Structured_Dictionary_Learning_for_Face_Recognition","292700760_Sparse_representation_and_learning_in_visual_recognition_theory_and_applications","288122906_Robust_non-negative_dictionary_learning","288058135_A_Locality-Constrained_and_Label_Embedding_Dictionary_Learning_Algorithm_for_Image_Classification","282763654_Locality_preserving_discriminative_dictionary_learning"]}