{"id":"316283446_Certification_of_Compact_Low-Stretch_Routing_Schemes","abstract":"On the one hand, the correctness of routing protocols in networks is an issue of utmost importance for guaranteeing the delivery of messages from any source to any target. On the other hand, a large collection of routing schemes have been proposed during the last two decades, with the objective of transmitting messages along short routes, while keeping the routing tables small. Regrettably, all these schemes share the property that an adversary may modify the content of the routing tables with the objective of, e.g., blocking the delivery of messages between some pairs of nodes, without being detected by any node. In this paper, we present a simple certification mechanism which enables the nodes to locally detect any alteration of their routing tables. In particular, we show how to locally verify the stretch-3 routing scheme by Thorup and Zwick [SPAA 2001] by adding certificates of $\\widetilde{O}(\\sqrt{n})$ bits at each node in $n$-node networks, that is, by keeping the memory size of the same order of magnitude as the original routing tables. We also propose a new name-independent routing scheme using routing tables of size $\\widetilde{O}(\\sqrt{n})$ bits. This new routing scheme can be locally verified using certificates on $\\widetilde{O}(\\sqrt{n})$ bits. Its stretch is3 if using handshaking, and 5 otherwise.","authors":["Alkida Balliu","Pierre Fraigniaud"],"meta":["April 2017The Computer Journal 62(5)","DOI:10.1093/comjnl/bxy089"],"references":["225113225_Proof_labeling_schemes","221257290_On_Space-Stretch_Trade-Offs_Upper_Bounds","220431797_Trade-off_between_space_and_efficiency_for_routing_tables","310789849_Local_checkability_no_strings_attached_Acyclicity_reachability_loop_free_updates_in_SDNs","303970232_Survey_of_Distributed_Decision","262372119_Compact_routing_schemes_with_improved_stretch","262322356_Towards_a_Complexity_Theory_for_Local_Distributed_Computing","225139964_A_Space_Lower_Bound_for_Routing_in_Trees","221591676_Some_Complexity_Questions_Related_to_Distributive_Computing_Preliminary_Report","220459495_Labelling_and_Implicit_Routing_in_Networks"]}