{"id":"316284122_An_Approach_to_Image_Segmentation_using_K-means_Clustering_Algorithm","abstract":"This paper presents a new approach for image segmentation by applying k-means algorithm. In image segmentation, clustering algorithms are very popular as they are intuitive and are also easy to implement. The K-means clustering algorithm is one of the most widely used algorithm in the literature, and many authors successfully compare their new proposal with the results achieved by the k-Means. This paper proposes a color-based segmentation method that uses K-means clustering technique. The k-means algorithm is an iterative technique used to partition an image into k clusters. The standard K-Means algorithm produces accurate segmentation results only when applied to images defined by homogenous regions with respect to texture and color since no local constraints are applied to impose spatial continuity. At first, the pixels are clustered based on their color and spatial features, where the clustering process is accomplished. Then the clustered blocks are merged to a specific number of regions. This approach thus provides a feasible new solution for image segmentation which may be helpful in image retrieval. The experimental results clarify the effectiveness of our approach to improve the segmentation quality in aspects of precision and computational time. The simulation results demonstrate that the proposed algorithm is promising.","authors":["Ms Chinki","Chandhok Mrs","Soni A Chaturvedi","Aleefia Khurshid"],"meta":["January 2012"],"references":["221276037_Unsupervised_Image_Segmentation_Using_a_Hierarchical_Clustering_Selection_Process","44244491_Optimization_Fusion_Approach_For_Image_Segmentation_Using_K-Means_Algorithm","6773293_Fusion_of_Hidden_Markov_Random_Field_Models_and_Its_Bayesian_Estimation","324400278_Clustering_Algorithms","309715704_Least_squares_quantization_in_PCM","292745655_Region_competition_Unifying_snakes_Region_growing_and_bayes'MDL_for_multiband_image_segmentation","233950933_On_the_Statistical-Analysis_of_Dirty_Pictures","232627133_An_Efficient_K-Means_Clustering_Algorithm_Analysis_and_Implementation","220049031_Normalized_Cuts_and_Image_Segmentation","4072453_A_spatial_constrained_K-means_approach_to_image_segmentation"]}