{"id":"316277672_Livestock_monitoring_using_RFID_with_R_tree_indexing","abstract":"RFID is an emerging innovation and has viable connection to animal tracking. A sensor system which utilizes remote innovation is proposed for checking the livestock. Using RFID Livestock can be monitored efficiently against missing animals and new animals can be included in stock and the vaccination procedures can be monitored in a regular basis. This paper contributes and delineates the other method for farm environment monitoring. RFID tagged animals are associated with a reader in a defined range. The amount of RFID information in such a situation is vast. This scenario calls for more calculation and time that are expected to take out profitable data from RFID livestock management system. Consequently, this analysis concentrates on the indexing of the colossal measure of RFID query processing. Here, “R⁺ tree indexing technique” is put into use to incite the RFID information recovery from the RFID information stockroom. This method comprises of root node, intermediate and leaf node. Every leaf node is shaped as Minimum Bounding Rectangle (MBR) that incorporates information article and its values. Additionally, leaf node stores the Minimum Bounding Rectangle (MBR) and doesn't store the genuine RFID information object. Implementation results show that R⁺ tree indexing method produces high indexing throughput and less query processing time.","authors":["Maria Anu","R. Aroul Canessane"],"meta":["January 2017"],"references":["262628230_Dairy_cow_monitoring_by_RFID","223460657_A_complete_farm_management_system_based_on_animal_identification_using_RFID_technology","221266237_Spatio-Temporal_Indexing_for_Large_Multimedia_Applications","2395927_Novel_Approaches_to_the_Indexing_of_Moving_Object_Trajectories","313535261_MV3R-tree_A_spatio-temporal_access_method_for_timestamp_and_interval_queries","260524429_Smart_RFID_Antenna_System_for_Indoor_Tracking_and_Behavior_Analysis_of_Small_Animals_in_Colony_Cages","239545688_R-treesa_dynamic_index_for_spatial_searching","224680022_The_Local_Position_Measurement_System_LPM_used_for_Cow_Tracking"]}