{"id":"316309944_Genome-Wide_Abolishment_of_Mobile_Genetic_Elements_Using_Genome_Shuffling_and_CRISPRCas-Assisted_MAGE_Allows_the_Efficient_Stabilization_of_a_Bacterial_Chassis","abstract":"The ideal bacterial chassis provides a simplified, stable and predictable host environment for synthetic biological circuits. Mutability and evolution can, however, compromise stability, leading to deterioration of artificial genetic constructs. By eliminating certain sources of instability, these undesired genetic changes can be mitigated. Specifically, deletion of prophages and insertion sequences, non-essential constituents of bacterial genomes, has been shown to be beneficial in cellular and genetic stabilization. Here, we sought to establish a rapid methodology to improve the stability of microbial hosts. The novel workflow involves genome shuffling between a mobile genetic element-free strain and the target cell, and subsequent rounds of CRISPR/Cas-assisted MAGE on multiplex targets. The power and speed of the procedure was demonstrated on E. coli BL21(DE3), a host routinely used for plasmid-based heterologous protein expression. All 9 prophages and 50 insertion elements were efficiently deleted or inactivated. Together with additional targeted manipulations (e.g., inactivation of error-prone DNA-polymerases), the changes resulted in an improved bacterial host with a hybrid (harboring segments of K-12 DNA), 9%-downsized and clean genome. The combined capacity of phage-mediated generalized transduction and CRISPR/Cas-selected MAGE offers a way for rapid, large scale editing of bacterial genomes.","authors":["Kinga Umenhoffer","Gabor Draskovits","Akos Nyerges","Ildikó Karcagi"],"meta":["April 2017ACS Synthetic Biology 6(8)","DOI:10.1021/acssynbio.6b00378"],"references":["294896178_A_highly_precise_and_portable_genome_engineering_method_allows_comparison_of_mutational_effects_across_bacterial_species","291554651_CRMAGE_CRISPR_Optimized_MAGE_Recombineering","277947867_Insertion_Sequence_IS26_Reorganizes_Plasmids_in_Clinically_Isolated_Multidrug-Resistant_Bacteria_by_Replicative_Transposition","274834644_MODEST_A_web-based_design_tool_for_oligonucleotide-mediated_genome_engineering_and_recombineering","265557575_Large_Chromosomal_Rearrangements_during_a_Long-Term_Evolution_Experiment_with_Escherichia_coli","263288770_Iron_Triggers_So_Prophage_Induction_and_Release_of_Extracellular_DNA_in_Shewanella_oneidensis_MR-1_Biofilms","290598547_Indispensability_of_Horizontally_Transferred_Genes_and_Its_Impact_on_Bacterial_Genome_Streamlining","282816062_Genome-wide_inactivation_of_porcine_endogenous_retroviruses_PERVS","273871235_DNA_vaccines_free_from_mobile_DNA","265344809_Rapid_editing_and_evolution_of_bacterial_genomes_using_libraries_of_synthetic_DNA"]}