{"id":"316358770_Meta-analytic_comparison_of_trial-_versus_questionnaire-based_vividness_reportability_across_behavioral_cognitive_and_neural_measurements_of_imagery","abstract":"Vividness is an aspect of consciousness related to mental imagery and prospective episodic memory. Despite being harshly criticized in the past for failing to demonstrate robust correlations with behavioral measures, currently this construct is attracting a resurgent interest in cognitive neuroscience. Therefore, an updated examination of the validity of this construct is timely. A corpus of peer-reviewed literature was analyzed through meta-analysis, which compared the two main formats used to measure vividness [trial-by-trial vividness ratings (VR) and the Vividness of Visual Imagery Questionnaire (VVIQ)]. These two formats were compared in relation to all available behavioral/cognitive (BC) and neuroscience (NS) measures in Phase 1 (3542 statistical observations representing 393 journal articles); and then in relation to all available BC, EEG and fMRI literature in Phase 2 (3624 observations representing 402 articles). Both Phases observed significantly larger effect size estimates (ESEs) for VR than VVIQ, and larger ESEs for NS than BC measures. ESEs for EEG and fMRI were not significantly different in Phase 2, but were greater than BC ESEs. These data suggest VR are a more reliable self-report measure than VVIQ, and may reflect a more direct route of reportability than the latter. Furthermore, both VR and VVIQ are more strongly associated with the neural, than the cognitive and behavioural correlates of imagery. If one establishes neuroscience measures as the criterion variable, then self-reports of vividness show higher construct validity than behavioural/cognitive measures of imagery. We discuss how the present findings contribute to current issues on measurement of reportability; and how this study advances our understanding of vividness as a phenomenological characteristic of imagery, and other forms of conscious experience which do not necessarily involve imagery.","authors":["Matthew S. Runge","Mike W-L Cheung","Amedeo D'Angiulli"],"meta":["April 2017Neuroscience of Consciousness 3(1)","DOI:10.1093/nc/nix006"],"references":["315809020_Consciousness_mental_imagery_and_action","303551101_Integrated_information_theory_From_consciousness_to_its_physical_substrate","341439115_Protocol_Analysis_Verbal_Reports_as_Data","329951941_The_Primacy_of_the_Subjective_Foundations_for_a_Unified_Theory_of_Mind_and_Language","318494264_Protocol_Analysis_Verbal_Reports_as_Data","313373744_The_Ancient_Origins_of_Consciousness_How_the_Brain_Created_Experience","312202699_Vividness_of_Visual_Imagery_Depends_on_the_Neural_Overlap_with_Perception_in_Visual_Areas","299874946_How_can_we_measure_awareness_An_overview_of_current_methods","297291486_Memory's_echo_Vivid_remembering_reactivates_sensory-specific_cortex_vol_97_pg_11125_2000","290493416_Using_visual_imagery_as_a_mnemonic_for_verbal_associative_learning"]}