{"id":"316348009_A_Fast_K-prototypes_Algorithm_Using_Partial_Distance_Computation","abstract":"The k-means is one of the most popular and widely used clustering algorithm; however, it is limited to numerical data only. The k-prototypes algorithm is an algorithm famous for dealing with both numerical and categorical data. However, there have been no studies to accelerate it. In this paper, we propose a new, fast k-prototypes algorithm that provides the same answers as those of the original k-prototypes algorithm. The proposed algorithm avoids distance computations using partial distance computation. Our k-prototypes algorithm finds minimum distance without distance computations of all attributes between an object and a cluster center, which allows it to reduce time complexity. A partial distance computation uses a fact that a value of the maximum difference between two categorical attributes is 1 during distance computations. If data objects have m categorical attributes, the maximum difference of categorical attributes between an object and a cluster center is m. Our algorithm first computes distance with numerical attributes only. If a difference of the minimum distance and the second smallest with numerical attributes is higher than m, we can find the minimum distance between an object and a cluster center without distance computations of categorical attributes. The experimental results show that the computational performance of the proposed k-prototypes algorithm is superior to the original k-prototypes algorithm in our dataset.","authors":["Byoungwook Kim"],"meta":["April 2017Symmetry 9(4):58","DOI:10.3390/sym9040058"],"references":["220906984_Making_k-means_Even_Faster","220343586_NP-hardness_of_Euclidean_sum-of-squares_clustering","2480121_Using_the_Triangle_Inequality_to_Accelerate_K-Means","232627133_An_Efficient_K-Means_Clustering_Algorithm_Analysis_and_Implementation","224839970_Some_Methods_for_Classification_and_Analysis_of_MultiVariate_Observations","224506324_Random_Projection_Trees_for_Vector_Quantization","220272021_Accelerating_Exact","4000717_Fast_search_algorithm_for_vector_quantization_and_pattern_matching","3342586_Rotated_partial_distance_search_for_faster_vector_quantization_encoding"]}