{"id":"316446592_Computational_Thinking_in_Teacher_Education","abstract":"Computational thinking (CT) has been offered as a cross-disciplinary set of mental skills that are drawn from the discipline of computer science. Existing literature supports the inclusion of CT within the K-12 curriculum, within multiple subjects, and from primary grades upward. The use of computers as a context for CT skills is often possible, yet care must be taken to ensure that CT is not conflated with programming or instructional technology, in general. Research had suggested that instructing preservice teachers in the use of CT can help them develop a more accurate and nuanced understandings of how it can be applied to the classroom. This chapter reports results from a study about preservice teachers’ conceptions of CT and how it can be implemented within their classrooms. Results suggested that preservice teachers with no previous exposure to CT have a surface level understanding of computational thinking. Participants largely defined CT in terms of problem-solving, logical thinking, and other types of thinking and often requiring the use of computers. The chapter offers implications for teacher educators to embed computational thinking in preservice education courses through educational technology as well as content specific methods courses.","authors":["Aman Yadav","Sarah Gretter","Jon Good","Tamika McLean"],"meta":["April 2017","DOI:10.1007/978-3-319-52691-1_13","In book: Emerging Research, Practice, and Policy on Computational Thinking (pp.205-220)"],"references":["304001335_Computational_Thinking_and_Media_Information_Literacy_An_Integrated_Approach_to_Teaching_Twenty-First_Century_Skills","303668799_Computational_Thinking_for_All_Pedagogical_Approaches_to_Embedding_21st_Century_Problem_Solving_in_K-12_Classrooms","296696274_The_Influence_of_Problem_Solving_Abilities_on_Students'_Performance_on_Different_Assessment_Tasks_in_Introductory_Programming","282861505_Developing_Mathematical_Thinking_with_Scratch_An_Experiment_with_6th_Grade_Students","303970637_Seven_Trends_The_Transformation_of_the_Teaching_Force","301463453_Relationships_computational_thinking_pedagogy_of_programming_and_Bloom's_Taxonomy","290506345_CS4HS","283504240_Grounding_Computational_Thinking_Skill_Acquisition_Through_Contextualized_Instruction","282748526_Integrating_computational_thinking_across_the_K-8_curriculum","282642970_From_computational_thinking_to_computational_making"]}