{"id":"316467581_Individual_Differences_in_Sensory_Substitution","abstract":"Sensory substitution devices were developed in the context of perceptual rehabilitation and they aim at compensating one or several functions of a deficient sensory modality by converting stimuli that are normally accessed through this deficient sensory modality into stimuli accessible by another sensory modality. For instance, they can convert visual information into sounds or tactile stimuli. In this article, we review those studies that investigated the individual differences at the behavioural, neural, and phenomenological levels when using a sensory substitution device. We highlight how taking into account individual differences has consequences for the optimization and learning of sensory substitution devices. We also discuss the extent to which these studies allow a better understanding of the experience with sensory substitution devices, and in particular how the resulting experience is not akin to a single sensory modality. Rather, it should be conceived as a multisensory experience, involving both perceptual and cognitive processes, and emerging on each user’s pre-existing sensory and cognitive capacities.","authors":["Gabriel Arnold","Jacques Pesnot-Lerousseau","Malika Auvray"],"meta":["April 2017Multisensory Research 30(6)","DOI:10.1163/22134808-00002561"],"references":["346675285_A_History_of_the_Mind","306245029_Designing_sensory-substitution_devices_Principles_pitfalls_and_potential","301573436_Sensory_Substitution_The_Spatial_Updating_of_Auditory_Scenes_Mimics_the_Spatial_Updating_of_Visual_Scenes","299891243_A_Crossmodal_Perspective_on_Sensory_Substitution","299783471_Navigation_assistance_for_blind_pedestrians_guidelines_for_the_design_of_devices_and_implications_for_spatial_cognition","299396320_Aging_and_Sensory_Substitution_in_a_Virtual_Navigation_Task","297594721_Differentiated_Audio-Tactile_Correspondences_in_Sighted_and_Blind_Individuals","288019823_Taking_someone_else's_spatial_perspective_Natural_stance_or_effortful_decentring","287308475_Why_Red_Doesn't_Sound_Like_A_Bell_Understanding_the_feel_of_consciousness","287236453_The_Multisensory_driver_Implications_for_ergonomic_car_interface_design"]}