{"id":"316431082_A_Novel_Cluster_Center_Fast_Determination_Clustering_Algorithm","abstract":"As one of the most important techniques in data mining, cluster analysis has attracted more and more attentions in this big data era. Most clustering algorithms have encountered with challenges including cluster centers determination difficulty, low clustering accuracy, uneven clustering efficiency of different data sets and sensible parameter dependence. Aiming at clustering center determination difficulty and parameter dependence, a novel cluster center fast determination clustering algorithm was proposed in this paper. It is supposed that clustering centers are those data points with higher density and larger distance from other data points of higher density. Normal distribution curves are designed to fit the density distribution curve of density distance product. And the singular points outside the confidence interval by setting the confidence interval are proved to be clustering centers by theory analysis and simulations. Finally, according to these clustering centers, a time scan clustering is designed for the rest of the points by density to complete the clustering. Density radius is a sensible parameter in calculating density for each data point, mountain climbing algorithm is thus used to realize self-adaptive density radius. Abundant typical benchmark data sets are testified to evaluate the performance of the brought up algorithms compared with other clustering algorithms in both aspects of clustering quality and time complexity.","authors":["Chen Jinyin","Lin Xiang","Zheng Haibing","Bao Xintong"],"meta":["April 2017Applied Soft Computing 57","DOI:10.1016/j.asoc.2017.04.031"],"references":["304576825_A_Semiparametric_Method_for_Clustering_Mixed_Data","286837017_Research_on_density-based_clustering_algorithm_for_mixed_data_with_determine_cluster_centers_automatically","282270656_Clustering_Data_of_Mixed_Categorical_and_Numerical_Type_With_Unsupervised_Feature_Learning","324286003_Finding_Groups_in_Data_An_Introduction_to_Cluster_Analysis","316600283_Data_Mining_Concepts_and_Techniques","304711764_K-Harmonic_means_type_clustering_algorithm_for_mixed_datasets","299593427_Clustering_of_Mixed_Data_by_Integrating_Fuzzy_Probabilistic_and_Collaborative_Clustering_Framework","294657177_Research_on_a_clustering_algorithm_in_clustering_MANET","290763780_A_Weighted_Fuzzy_Clustering_Algorithm_Based_on_Density","269520441_Hybrid_data_labeling_algorithm_for_clustering_large_mixed_type_data"]}