{"id":"316487947_Problems_Affecting_Successful_Implementation_of_Blended_Learning_in_Higher_Education_-_the_Teacher_Perspective","abstract":"An increased use of blended learning environments in higher education has been an emerging trend in the 21st century. Sometimes the definition of blended learning has been so broad that it makes it hard to find any learning environment in higher education that would not be included. Many research studies have been reporting the pros and cons of blended learning from the university perspective and the learner perspective. There are less studies on the teacher view of blended learning environments. This study had the aim to explore, analyse and discuss teachers' perceived problems and barriers to a successful implementation of blended learning at university level.\nThe used research strategy was a qualitative cross-sectional study where data has been collected with semi-structured interviews. Six teachers that all are subject matter experts and instructional designers for courses on computer science were interviewed. In a computer assisted thematic analysis found codes and keywords was grouped together to create themes.\nFour themes or problematic areas were found, and that they combined could give an explanation to what teachers experience as problems when implementing blended learning environments. First theme is documentation and support, where teachers find the scarcity of documentation in their virtual learning environment a problem for implementing extension modules. Second theme is introduction and training, where teachers find it problematic that they rarely get a proper introduction or further training on the use of tools and modules. Third theme is the time aspect, teachers suffer from the lack of time to implement blended learning thoroughly in their courses. Last found theme is didactics, where teachers do not feel that they have the required knowledge or skills to apply the appropriate instructional design for blended learning environments.","authors":["Peter Mozelius","Claes Rydell"],"meta":["March 2017","DOI:10.1515/ijicte"],"references":["317025797_Principles_of_Course_Redesign_A_Model_for_Blended_Learning","309713877_An_Empirical_Evaluation_of_Critical_Factors_Influencing_Learner_Satisfaction_in_Blended_Learning_A_Pilot_Study","309202102_Education_for_All_in_Sri_Lanka_-_ICT4D_Hubs_for_Region-wide_Dissemination_of_Blended_Learning","306254884_Instructor_support_services_An_inevitable_critical_success_factor_in_blended_learning_in_higher_education_in_Tanzania","296621483_Social_presence_-_connecting_pre-service_teachers_as_learners_using_a_blended_learning_model","286439617_Blended_learning_in_higher_education_Three_different_design_approaches","312016113_Factors_for_successful_e-learning_does_age_matter","304802407_Developing_a_blended_learning_approach_for_the_effective_teaching_of_electronic_circuit_analysis","290609802_Blended_Learning_A_Flipped_Classroom_Experiment","277753519_Stories_Models_and_Examples_from_the_Upcoming_Handbook_of_Blended_Learning_Global_Perspectives_Local_Designs_Part_2"]}