{"id":"316451550_On_Improving_Research_Methodology_Course_at_Blekinge_Institute_of_Technology","abstract":"The Research Methodology in Software Engineering and Computer Science (RM) is a compulsory course that must be studied by graduate students at Blekinge Institute of Technology (BTH) prior to undertaking their theses work. The course is focused on teaching research methods and techniques for data collection and analysis in the fields of Computer Science and Software Engineering. It is intended that the course should help students in practically applying appropriate research methods in different courses (in addition to the RM course) including their Master's theses. However, it is believed that there exist deficiencies in the course due to which the course implementation (learning and assessment activities) as well as the performance of different participants (students, teachers, and evaluators) are affected negatively. In this article our aim is to investigate potential deficiencies in the RM course at BTH in order to provide a concrete evidence on the deficiencies faced by students, evaluators, and teachers in the course. Additionally, we suggest recommendations for resolving the identified deficiencies. Our findings gathered through semi-structured interviews with students, teachers, and evaluators in the course are presented in this article. By identifying a total of twenty one deficiencies from different perspectives, we found that there exist critical deficiencies at different levels within the course. Furthermore, in order to overcome the identified deficiencies, we suggest seven recommendations that may be implemented at different levels within the course and the study program. Our suggested recommendations, if implemented, will help in resolving deficiencies in the course, which may lead to achieving an improved teaching and learning in the RM course at BTH.","authors":["Shoaib Bakhtyar","Ahmad Nauman Ghazi"],"meta":["April 2017"],"references":["224266207_Recommended_Steps_for_Thematic_Synthesis_in_Software_Engineering","220277640_Hst_M_Guidelines_for_Conducting_and_Reporting_Case_Study_Research_in_Software_Engineering_Empirical_Software_Engineering_14_131-164","243769802_Those_Who_Understand_Knowledge_Growth_in_Teaching","200827826_Experimentation_In_Software_Engineering_An_Introduction","44838532_Teaching_for_Quality_Learning_At_University_What_the_Student_Does"]}