{"id":"316471370_Some_Like_it_Hoax_Automated_Fake_News_Detection_in_Social_Networks","abstract":"In recent years, the reliability of information on the Internet has emerged as a crucial issue of modern society. Social network sites (SNSs) have revolutionized the way in which information is spread by allowing users to freely share content. As a consequence, SNSs are also increasingly used as vectors for the diffusion of misinformation and hoaxes. The amount of disseminated information and the rapidity of its diffusion make it practically impossible to assess reliability in a timely manner, highlighting the need for automatic hoax detection systems. As a contribution towards this objective, we show that Facebook posts can be classified with high accuracy as hoaxes or non-hoaxes on the basis of the users who \"liked\" them. We present two classification techniques, one based on logistic regression, the other on a novel adaptation of boolean crowdsourcing algorithms. On a dataset consisting of 15,500 Facebook posts and 909,236 users, we obtain classification accuracies exceeding 99% even when the training set contains less than 1% of the posts. We further show that our techniques are robust: they work even when we restrict our attention to the users who like both hoax and non-hoax posts. These results suggest that mapping the diffusion pattern of information can be a useful component of automatic hoax detection systems.","authors":["Eugenio Tacchini","Gabriele Ballarin","Marco L. Della Vedova","Stefano Moret"],"meta":["September 2017","Conference: SoGood 2017 - Second Workshop on Data Science for Social GoodAt: Skopje, MacedoniaVolume: 1960","Project: Some like it hoax - Automated Fake News Detection in Social Networks"],"references":["299943097_Disinformation_on_the_Web_Impact_Characteristics_and_Detection_of_Wikipedia_Hoaxes","289263634_The_spreading_of_misinformation_online","267562828_Iterative_Learning_for_Reliable_Crowdsourcing_Systems","264558865_Science_vs_Conspiracy_Collective_Narratives_in_the_Age_of_Misinformation","311491352_Assessment_of_Tweet_Credibility_with_LDA_Features","271497598_Distance-based_hoax_detection_system","267948674_Scam_Detection_in_Twitter","267200150_Variational_Inference_for_Crowdsourcing","249664810_E-Mail_System_for_Automatic_Hoax_Recognition","243464841_Optimising_anti-spam_filters_with_evolutionary_algorithms"]}