{"id":"316442186_An_empirical_study_on_the_influence_of_context_in_computing_thresholds_for_Chidamber_and_Kemerer_metrics","abstract":"Software metrics have a fundamental role in the process of software quality management. However, in most cases, they are only used to quantify attributes, not supporting decision-making during the software life cycle. To support decision-making, it is necessary to give them by defining thresholds. In the literature, several approaches have been proposed with this purpose. On the other hand, most of them do not consider context factors such as the domain. Given this, in this paper, we evaluate if context factors influence the definition of thresholds for software metrics. Our work is restricted to Chidamber and Kemerer metrics, due to availability of data. We conducted an empirical study composed of two quasi-experiments. Each quasi-experiment uses an approach presented in the literature to define thresholds for software metrics, with the defined thresholds as the dependent variable. As the factor, we used a variable with two possible treatments: to consider the context or not. To define context, we used factors presented in the literature. As the objects of study, we used the source code of fifteen Java-based open-source projects. For measurement purposes, we used the six original Chidamber and Kemerer metrics. For both quasi-experiments, the accuracy of the definition of thresholds improved by considering the context. Therefore, we concluded that context factors influence the definition of the threshold for Chidamber and Kemerer metrics, which is an indicator that it influences other software metrics.","authors":["Leonardo C. Santos","Renata Mendonça Saraiva Perkusich","Mirko Perkusich","Hyggo Oliveira de Almeida"],"meta":["July 2017","DOI:10.18293/SEKE2017-044","Conference: The 29th International Conference on Software Engineering & Knowledge Engineering, SEKE 2017At: Pittsburgh, USA","Project: Intelligent Software Engineering Group (ISE/VIRTUS)"],"references":["308833538_Software_metric_selection_methods_A_review","271659680_Which_process_metrics_can_significantly_improve_defect_prediction_models_An_empirical_study","270649376_Deriving_metrics_thresholds_using_log_transformation","264809914_RTTool_A_Tool_for_Extracting_Relative_Thresholds_for_Source_Code_Metrics","261416911_How_Does_Context_Affect_the_Distribution_of_Software_Maintainability_Metrics","259081954_Extracting_Relative_Thresholds_for_Source_Code_Metrics","256078967_A_study_of_the_effectiveness_of_two_threshold_definition_techniques","305296096_Towards_a_Metrics_Suite_for_Object_Oriented_Design","245778500_Constructing_Confidence_Sets_Using_Rank_Statistics","243533875_Object_oriented_design_quality_metrics_an_analysis_of_dependencies"]}