{"id":"316471074_Automatic_Content-aware_Projection_for_360deg_Videos","abstract":"To watch 360{\\deg} videos on normal 2D displays, we need to project the selected part of the 360{\\deg} image onto the 2D display plane. In this paper, we propose a fully-automated framework for generating content-aware 2D normal-view perspective videos from 360{\\deg} videos. Especially, we focus on the projection step preserving important image contents and reducing image distortion. Basically, our projection method is based on Pannini projection model. At first, the salient contents such as linear structures and salient regions in the image are preserved by optimizing the single Panini projection model. Then, the multiple Panini projection models at salient regions are interpolated to suppress image distortion globally. Finally, the temporal consistency for image projection is enforced for producing temporally stable normal-view videos. Our proposed projection method does not require any user-interaction and is much faster than previous content-preserving methods. It can be applied to not only images but also videos taking the temporal consistency of projection into account. Experiments on various 360{\\deg} videos show the superiority of the proposed projection method quantitatively and qualitatively.","authors":["Yeong Won Kim","Dae-Yong Jo","Chang-Ryeol Lee","Hyeok-Jae Choi"],"meta":["April 2017"],"references":["279348491_LSD_A_line_segment_detector","221364530_Saliency_Detection_A_Spectral_Residual_Approach","4193973_Squaring_the_Circle_in_Panoramas","319770284_Edge_Boxes_Locating_Object_Proposals_from_Edges","312331748_Correction_of_geometric_perceptual_distortions_in_pictures","262360976_Rectangling_Stereographic_Projection_for_Wide-Angle_Image_Visualization","262254762_DeepFlow_Large_Displacement_Optical_Flow_with_Deep_Matching","221750789_Measuring_the_Objectness_of_Image_Windows","220795340_Pannini_A_New_Projection_for_RenderingWide_Angle_Perspective_Images","220184203_Optimizing_Content-Preserving_Projections_for_Wide-Angle_Images"]}