{"id":"316467393_Cost_Reduction_in_Location_Management_Using_Reporting_Cell_Planning_and_Particle_Swarm_Optimization","abstract":"This paper introduces a critical and intricate location management issue that combines both location inquiry or location update and location search or paging in cellular computational environment. It is required to develop the algorithm that could entangle the issue which yet simple to implement and solve a wide range of complex problems incorporated in the cellular network. It is essential to optimize the network to locate a mobile terminal in a cellular computing environment with an optimal location area is an NP-complete problem. In recent years to solve this location management issue many metaheuristic algorithms have been developed which are capable of searching in larger search space efficiently and effectively. This paper proposes binary particle swarm optimization (BPSO) using optimal reporting cell planning technique with the objective of reducing location management cost that incurred during the tracking procedure in locating the user in a cellular network. To evaluate the system performance of the BPSO, the simulation results depict as the technique is simple, computationally effective among other evolutionary algorithms and prove to be better when compared to the existing conventional binary genetic algorithm. The extensive simulations are performed in different existing data networks of various network sizes and also to prove the efficacy as well as robustness of the algorithm the proposed BPSO algorithm is validated in real data network and demonstrate the performance in terms of cost parameters like cost per call arrival, paging cost and total cost etc.","authors":["S. R. Parija","Prasanna Sahu","Sudhansu Sekhar Singh"],"meta":["September 2017Wireless Personal Communications 96(4)","DOI:10.1007/s11277-017-4259-3"],"references":["282687871_Evolutionary_algorithm_for_cost_reduction_in_cellular_network","273219461_Solving_the_reporting_cells_problem_by_using_a_parallel_team_of_evolutionary_algorithms","256090639_Swarm_Intelligent_Approaches_for_Location_Area_Planning","224370527_Applying_Differential_Evolution_to_the_Reporting_Cells_problem","296424410_Location_management_in_mobile_network_A_survey","289920195_Non-dominated_Sorting_and_a_Novel_Formulation_in_the_Reporting_Cells_Planning","282256569_Particle_swarm_optimization_for_location_mobility_management","260796298_A_Tabu_Search_Multi-Criteria_Decision_Model_for_Facility_Location_Planning","227145461_Querying_locations_in_wireless_environments","221196741_Soft_Computing_Approach_for_Location_Management_Problem_in_Wireless_Mobile_Environment","220866905_New_Research_in_Nature_Inspired_Algorithms_for_Mobility_Management_in_GSM_Networks","50346158_A_review_on_various_network_results_for_Reporting_Cell_planning_in_genetic_algorithm_technique","3903911_Particle_swarm_optimization_Development_applications_and_resources","220801651_Solving_the_Reporting_Cells_Problem_Using_a_Scatter_Search_Based_Algorithm","220098585_A_modified_hopfield_network_for_mobility_management"]}