{"id":"316499229_Neighbor_Inconsistent_Pair_Selection_for_Attribute_Reduction_By_Rough_Set_Approach","abstract":"Rough set theory, as one of the most useful soft computing methods dealing with vague and uncertain information, has been successfully applied to many fields, and one of its main applications is to perform attribute reduction. Although many heuristic attribute reduction algorithms have been proposed within the framework of the rough set theory, these methods are still computationally time-consuming. In order to overcome this deficit, we propose in this paper two quick feature selection algorithms based on the neighbor inconsistent pair, which can reduce the time consumed in finding a reduct. At first, we propose several concepts regarding simplified decision table(U ′ ) and neighbor inconsistent pairs. Based on neighbor inconsitent pairs, we constructe two new attribute significance measures. Furthermore, we put forward two new attribute reduction algorithms based on quick neighbor inconsistent pairs. The key characteristic of the presented algorithms is that they only need to calculate U ′ =R once under the process of selecting the best attribute from attribute sets: C−R, while most existing algorithms need to calculate partition of U ′ for |C−R| times. In addition, the proposed algorithms need only to deal with the equivalent classes in U ′ =R that contain at least one neighbor inconsistent pair, while most existing algorithms need to consider all objects in U ′ . The experimental results show that the proposed algorithms are feasible and efficient.","authors":["Jianhua Dai","Qinghua Hu","Hu Hu","Debiao Huang"],"meta":["April 2017IEEE Transactions on Fuzzy Systems PP(99):1-1","DOI:10.1109/TFUZZ.2017.2698420"],"references":["311963892_Attribute_Selection_for_Partially_Labeled_Categorical_Data_By_Rough_Set_Approach","303779009_A_Fitting_Model_for_Feature_Selection_With_Fuzzy_Rough_Sets","301241180_Discrete_particle_swarm_optimization_approach_for_cost_sensitive_attribute_reduction","320006844_Soft_sets_and_soft_rough_sets","314250698_Rough_Information_Set_and_Its_Applications_in_Decision_Making","313091629_Improvement_of_Discernibility_Matrix_r_the_Computation_of_a_core","309854340_Feature_subset_selection_based_on_fuzzy_neighborhood_rough_sets","306894600_Feature_subset_selection_based_on_fuzzy_neighborhood_rough_sets","285798984_A_quick_attribute_reduction_algorithm_with_complexity_of_maxOCU_OC2UC","284122464_Neighborhood_based_decision-theoretic_rough_set_models"]}