{"id":"316470876_1970s_and_'Patient_0'_HIV-1_genomes_illuminate_early_HIVAIDS_history_in_North_America","abstract":"The emergence of HIV-1 group M subtype B in North American men who have sex with men was a key turning point in the HIV/AIDS pandemic. Phylogenetic studies have suggested cryptic subtype B circulation in the United States (US) throughout the 1970s$^{1,2}$ and an even older presence in the Caribbean$^{2}$. However, these temporal and geographical inferences, based upon partial HIV-1 genomes that postdate the recognition of AIDS in 1981, remain contentious$^{3,4}$ and the earliest movements of the virus within the US are unknown. We serologically screened >2,000 1970s serum samples and developed a highly sensitive approach for recovering viral RNA from degraded archival samples. Here, we report eight coding-complete genomes from US serum samples from 1978–1979—eight of the nine oldest HIV-1 group M genomes to date. This early, full-genome ‘snapshot’ reveals that the US HIV-1 epidemic exhibited extensive genetic diversity in the 1970s but also provides strong evidence for its emergence from a pre-existing Caribbean epidemic. Bayesian phylogenetic analyses estimate the jump to the US at around 1970 and place the ancestral US virus in New York City with 0.99 posterior probability support, strongly suggesting this was the crucial hub of early US HIV/AIDS diversification. Logistic growth coalescent models reveal epidemic doubling times of 0.86 and 1.12 years for the US and Caribbean, respectively, suggesting rapid early expansion in each location$^{3}$. Comparisons with more recent data reveal many of these insights to be unattainable without archival, full-genome sequences. We also recovered the HIV-1 genome from the individual known as ‘Patient 0’ (ref.5) and found neither biological nor historical evidence that he was the primary case in the US or for subtype B as a whole. We discuss the genesis and persistence of this belief in the light of these evolutionary insights.","authors":["Michael Worobey","Thomas D. Watts","Richard A. McKay","Marc A. Suchard"],"meta":["October 2016","DOI:10.17863/CAM.6154"],"references":["261723248_Epidemics_and_History_Ecological_Perspectives_and_Social_Responses","20150541_Social_networks_and_the_spread_of_infectious_diseases_The_AIDS_example","324351174_The_Making_of_a_Social_Disease_Tuberculosis_in_Nineteenth-Century_France","318060651_Cluster_of_Cases_of_the_Acquired_Immune_Deficiency_Syndrome_Patients_Linked_by_Sexual_Contact","279414773_How_to_Have_Promiscuity_in_an_Epidemic","273550158_The_Making_of_a_Social_Disease_Tuberculosis_in_Nineteenth-Century_France","270828405_Typhoid_Mary_Captive_to_the_Public's_Health","269523056_Silent_Travelers_Germs_Genes_and_the_Immigrant_Menace","261920895_Patient_Zero_The_Absence_of_a_Patient's_View_of_the_Early_North_American_AIDS_Epidemic","241821963_Litigating_for_Lesbian_and_Gay_Rights_A_Legal_History","37720670_Contagious_Cultures_Carriers_and_the_Outbreak_Narrative","36888731_Homosexualities_a_Study_Of_Diversity_Among_Men_And_Women","21712449_Mortality_Trends_in_a_Cohort_of_Homosexual_Men_in_New_York_City_1978-1988","16588588_Cluster_of_cases_of_the_acquired_immune_deficiency_syndrome_Patients_linked_by_sexual_contact","13821147_Conjuring_medical_science_the_1986_referendum_on_AIDSHIV_policy_in_California","11693239_AIDS_and_the_Coercive_Power_of_the_State","5842920_When_HIV_spread_afar"]}