{"id":"316550400_Students_perception_on_the_usage_of_PowerPoint_in_learning_calculus","abstract":"Mathematics is a core subject in most of the science and technology courses and in some social sciences programs. However, the low achievement of students in the subject especially in topics such as Differentiation and Integration is always an issue. Many factors contribute to the low performance such as motivation, environment, method of learning, academic background and others. The purpose of this paper is to determine the perception of learning mathematics using PowerPoint on Integration concepts at the undergraduate level with respect to mathematics anxiety, learning enjoyment, mobility and learning satisfaction. The main content of the PowerPoint presentation focused on the integration method with historical elements as an added value. The study was conducted on 48 students randomly selected from students in computer and applied sciences program as experimental group. Questionnaires were distributed to students to explore their learning experiences. Another 51 students who were taught using the traditional chalkboard method were used as the control group. Both groups were given a test on Integration. The statistical methods used were descriptive statistics and independent sample t-test between the experimental and the control group. The finding showed that most students perceived positively to the PowerPoint presentations with respect to mobility and learning satisfaction. The experimental group performed better than the control group.","authors":["Zarith Sofiah Othman","Nor Habibah Tarmuji","Zulkifli Ab Ghani Hilmi"],"meta":["April 2017AIP Conference Proceedings 1830(1):050005","DOI:10.1063/1.4980942","Conference: THE 4TH INTERNATIONAL CONFERENCE ON MATHEMATICAL SCIENCES: Mathematical Sciences: Championing the Way in a Problem Based and Data Driven Society"],"references":["257617270_Students'_perceptions_of_the_learning_environment_and_attitudes_in_game-based_mathematics_classrooms","254864016_Emotions_Self-Regulated_Learning_and_Achievement_in_Mathematics_A_Growth_Curve_Analysis","239582496_A_Mathematics_Education_Research_Journal","271347346_A_Meta-Analysis_of_the_Relationship_between_Anxiety_toward_Mathematics_and_Achievement_in_Mathematics","254789319_Research_Methods_for_Business_A_Skill_Building_Approach_5th_Edition"]}