{"id":"316534935_Enjeux_et_outils_du_traitement_raisonne_contre_les_strongles_gastro-intestinaux_chez_les_bovins_et_les_petits_ruminants","abstract":"Chez les ruminants élevés au pâturage, les strongles gastro-intestinaux (SGI) peuvent induire des pertes de production, voire des atteintes cliniques chez les animaux non immuns. Le contrôle de l’infestation repose essentiellement sur les traitements anthelminthiques (AH) administrés fréquemment sans évaluation préalable de la réalité du risque parasitaire. Cette synthèse vise tout d’abord à exposer les principaux risques associés à ce recours insuffisamment raisonné aux AH : apparition de populations de parasites résistants aux AH, écotoxicité pour la microfaune prairiale dégradant les fèces, et installation retardée de l’immunité anti-strongles (notamment chez les bovins). Les stratégies de traitement ciblé-sélectif devraient permettre de maîtriser ces risques tout en prévenant les atteintes cliniques et sécurisant les performances des animaux. Il s’agit de rationaliser les traitements AH en ciblant les troupeaux ou les lots et les périodes à risque, et en sélectionnant les individus les plus parasités ou « souffrant » le plus du parasitisme. Cette synthèse vise donc ensuite à décrire les outils et les indicateurs étudiés pour mettre en œuvre de telles stratégies chez les ruminants. Il s’agit d’indicateurs zootechniques (gain moyen quotidien, parité, niveau de production…), cliniques (FAMACHA©, index de diarrhée…), parasitologiques (coproscopie, niveau d’anticorps anti-SGI…), ou d’indicateurs de conduite (modalité de pâturage), et aussi d’outils informatiques (modélisation du recyclage parasitaire). Leur fiabilité et leur opérationnalité sont variables. La mise en place de telles stratégies nécessitera de dépasser les freins à l’acceptation de ces nouvelles pratiques tant au niveau des éleveurs que des vétérinaires prescripteurs. Cet usage raisonné des AH assurerait une meilleure durabilité du contrôle de l’infestation par les SGI.","authors":["Nadine Ravinet","Christophe Chartier","Hervé Hoste","Maurice Mahieu"],"meta":["January 2017INRA Productions Animales 30(1)","DOI:10.20870/productions-animales.2017.30.1.2233"],"references":["291947343_Unexpected_Decrease_in_Milk_Production_after_Fenbendazole_Treatment_of_Dairy_Cows_during_Early_Grazing_Season","282764801_Anthelmintic_resistance_to_ivermectin_and_moxidectin_in_gastrointestinal_nematodes_of_cattle_in_Europe","341817965_Methode_simplifiee_de_mesure_de_la_concentration_en_pepsinogene_dans_le_serum","341817628_Parasitisme_helminthique_en_elevage_biologique_ovin_realites_et_moyens_de_controle","341753799_Nouvelles_approches_du_controle_des_strongyloses_gastro-intestinales","340722860_Alternatives_aux_traitements_anthelminthiques_en_elevage_biologique_des_ruminants","312577601_Evaluation_de_la_faisabilite_d'un_traitement_cible_selectif_contre_les_strongles_gastro-intestinaux_chez_les_genisses_laitieres_de_premiere_saison_de_paturage_base_sur_la_combinaison_d'indicateurs_lie","301829309_Explaining_variability_in_first_grazing_season_heifer_growth_combining_individually_measured_parasitological_and_clinical_indicators_with_exposure_to_gastrointestinal_nematode_infection_based_on_grazi","292374980_Technique_allegee_de_prelevements_d'herbe_et_de_numeration_pour_juger_de_l'infestation_des_paturages_de_bovins_par_les_larves_de_nematodes_parasites","286633445_La_therapeutique_anthelminthique_chez_les_caprins"]}