{"id":"316573352_Defining_project_efficiency_effectiveness_and_efficacy","abstract":"Abstract:\nPurpose\nThis paper studies how the concepts of efficiency, effectiveness and efficacy are used in project management literature. The concepts relate to the degree of success or failure of projects and the degree to which the results are achieved. The purpose of this paper is to review the use of the concepts of efficiency, efficacy and effectiveness in project management literature and among practitioners.\n\nDesign/methodology/approach\nThe study is based on an extensive literature review, initially from the International Journal of Managing Projects in Business. The first phase involved searching the words ‘efficiency’, ‘effectiveness’ and ‘efficacy’ in all articles of the journal, then quantifying the results. This was followed by a qualitative search of the same articles with the aim of understanding how the terms ‘project efficiency’, ‘project efficacy’ and ‘project effectiveness’ are used. A further intensive literature review was then conducted in other literatures in the field of project management, including, but not limited to, International Journal of Project Management and Project Management Journal. Finally, we complemented the review by including theories from deep searches of Google Scholar and Google Books using the parameters ‘project efficiency’, ‘project effectiveness’ and ‘project efficacy’ and checked how the three concepts are used in other fields.\n\nFindings\nThis research reveals there is wide diversity in interpretations of the three concepts among research scholars and practitioners, which makes it challenging to apply these three concepts appropriately and clearly. As a consequence, we propose a model for describing these concepts.\n\nResearch limitations/implications\nThis research is based on an academic and non-academic literature review. It identifies a number of inconsistencies in existing literature regarding the three concepts.\n\nPractical implications\nThis review enriches understanding of project management. Clarifying the understanding of project efficiency, project effectiveness and project efficacy will help and support organisational improvement. A clear and aligned view of these concepts can also be a basis for measurements based on possible developed indicators.\n\nOriginality/value\nThis paper highlights the gap in the literature concerning the practical use and interpretation of the concepts ‘project efficiency’, ‘project effectiveness’ and ‘project efficacy’.","authors":["Youcef J-T. Zidane","Nils O.E. Olsson"],"meta":["June 2017International Journal of Managing Projects in Business 10(3)","DOI:10.1108/IJMPB-10-2016-0085","Project: SpeedUp"],"references":["308727415_PESTOL_-_Framework_for_Project_Evaluation_on_Strategic_Tactical_and_Operational_Levels","307630360_Project_management_self-efficacy_as_a_predictor_of_project_performance_Constructing_and_validating_a_domain-specific_scale","307611028_Making_projects_critical_15_years_on_a_retrospective_reflection_2001-2016","303291968_Success_factors_and_criteria_in_the_management_of_international_development_projects_Evidence_from_projects_funded_by_the_European_Union_in_Ethiopia","303291874_Capacity_development_through_international_projects_a_complex_adaptive_systems_perspective","307613480_Rethinking_researching_project_management_Understanding_the_reality_of_project_management_careers","303291974_The_logic_of_projects_and_the_ideal_of_community_development_Social_good_participation_and_the_ethics_of_knowing","303291964_An_empirical_examination_of_the_relationship_between_adult_attention_deficit_and_the_operational_effectiveness_of_project_managers","303291786_Critical_success_factors_for_international_development_projects_in_Maldives_Project_teams'_perspective","299355980_Using_RBM_approach_in_managing_projects_beyond_the_development_sector"]}