{"id":"316505303_Experimental_Two-dimensional_Quantum_Walk_on_a_Photonic_Chip","abstract":"Quantum walks, in virtue of the coherent superposition and quantum interference, possess the exponential superiority over its classical counterpart in applications of quantum searching and quantum simulation. A straitforward physical implementation involving merely photonic source, linear evolution network and detection make it very appealing, in light of the stringent requirements of universal quantum computing. The quantum enhanced power is highly related to the state space of quantum walks, which can be expanded by enlarging the dimension of evolution network and/or photon number. Increasing photon number is considerably challenging due to probabilistic generation of single photons and multiplicative loss. Here we demonstrate a two-dimensional continuous-time quantum walk by using the external geometry of photonic waveguide arrays, rather than inner the degree of freedom of photons. Using femtosecond laser direct writing, we construct a large-scale three-dimensional structure which forms a two-dimensional lattice with up to 49X49 nodes on a photonic chip. We demonstrate the quantum transport properties via observing the ballistic evolution pattern and the variance profile, which agree well with simulation results for quantum walks. We further reveal the transient nature of the walk from our implementation, suggesting a higher dimension. An architecture that allows free evolvement in all directions and large scale, combing with defect and disorder control, may bring up powerful and versatile quantum walk machines for classically intractable problems.","authors":["Hao Tang","Xiao-Feng Lin","Zhen Feng","Jing-Yuan Chen"],"meta":["April 2017Science Advances 4(5)","DOI:10.1126/sciadv.aat3174"],"references":["304340305_Invisibility_Cloak_Printed_on_a_Photonic_Chip","303743520_Fast_escape_of_a_quantum_walker_from_an_integrated_photonic_maze","283564535_Localized_State_in_a_Two-Dimensional_Quantum_Walk_on_a_Disordered_Lattice","275364403_Enhancing_quantum_transport_in_a_photonic_network_using_controllable_decoherence","265209779_The_quest_for_a_Quantum_Neural_Network","265052179_Impact_of_Loss_on_the_Wave_Dynamics_in_Photonic_Waveguide_Lattices","262489003_Transport_properties_of_continuous-time_quantum_walks_on_Sierpinski_fractals","303744224_Non-classical_photon_correlation_in_a_two-dimensional_photonic_lattice","278925254_Quantum_random_walks","268038079_PyCTQW_A_continuous-time_quantum_walk_simulator_on_distributed_memory_computers"]}