{"id":"316553533_Coalition_Formation_Game_for_Joint_Power_Control_and_Fair_Channel_Allocation_in_Device-to-Device_Communications_Underlaying_Cellular_Networks","abstract":"This paper jointly considers the channel allocation and power control problems for device-to-device (D2D) communications underlaying cellular networks, in order to mitigate the co-channel interference and improve the system performance. The problem is formulated as a coalition formation game in which each cellular user forms a coalition with multiple D2D pairs (D2DPs), then these users can share the same communication channel. We analyze a merge-and-split process that is usually used for finding the optimal coalition structure. Among the stability notions of a coalition formation game, e.g., D_{hp}-stability and a stronger D_c-stability, we present the conditions for which this merge-and-split process converges to the D_c-stable structure, then that structure corresponds to the optimal solution. Since those conditions are shown not to hold in most practical scenarios of users' position distribution, that idealized algorithm is not applicable. We propose a merge-and-split based algorithm that can be applied to practical systems. However, the simulation results show that this algorithm can not guarantee the fairness among the performance of D2DPs. We propose a scheduling mechanism that allows the game to control this unfairness. The analytical results are verified by a number of simulations with different users' position scenarios. The simulation results also show that the proposed approach can control the unfairness while providing significant improvements in system performance.","authors":["Minh-Thuyen Thi","Thong Huynh","Amr Radwan","won-Joo Hwang"],"meta":["September 2017Wireless Personal Communications 96(1):1173-1191","DOI:10.1007/s11277-017-4230-3"],"references":["292858835_Game_Theory_Applications_in_Network_Design","290458176_Wireless_device-to-device_communications_and_networks","280917068_Overlapping_coalition_formation_games-based_resource_allocation_for_device-to-device_communication_in_LTE-A_network","278768710_Game_Theory_and_Learning_for_Wireless_Networks_Fundamentals_and_Applications","277575069_A_Bayesian_Overlapping_Coalition_Formation_Game_for_Device-to-Device_Spectrum_Sharing_in_Cellular_Networks","273391397_Pricing-Based_Interference_Coordination_for_D2D_Communications_in_Cellular_Networks","267132783_Game_Theory_in_Wireless_and_Communication_Networks_Theory_Models_and_Applications","264625434_Coalition_Formation_Game_for_Green_Resource_Management_in_D2D_Communications","264591551_Energy-Efficient_Resource_Sharing_for_Mobile_Device-to-Device_Multimedia_Communications","263813382_Coalitional_Games_for_Resource_Allocation_in_the_Device-to-Device_Uplink_Underlaying_Cellular_Networks"]}