{"id":"316501626_Semantically_Enhanced_Medical_Information_Retrieval_System_A_Tensor_Factorization_Based_Approach","abstract":"Medical information retrieval plays an increasingly important role to help physicians and domain experts to better access medical related knowledge and information, and support decision making. Integrating the medical knowledge bases has the potential to improve the information retrieval performance through incorporating medical domain knowledge for relevance assessment. However, this is not a trivial task because of the challenges to effectively utilize the domain knowledge in the medical knowledge bases. In this paper, we proposed a novel medical information retrieval system with a two-stage query expansion strategy, which is able to effectively model and incorporate the latent semantic associations to improve the performance. This system consists of two parts. First, we applied a heuristic approach to enhance the widely used pseudo relevance feedback method for more effective query expansion, through iteratively expanding the queries to boost the similarity score between queries and documents. Second, to improve the retrieval performance with structured knowledge bases, we presented a latent semantic relevance model based on tensor factorization to identify semantic association patterns under sparse settings. These identified patterns are then used as inference paths to trigger knowledge-based query expansion in medical information retrieval. Experiments with the TREC CDS 2014 dataset (a) showed that the performance of the proposed system is significantly better than the baseline system and the systems reported in TREC CDS 2014 conference, and is comparable with state-of-the-art systems; (b) demonstrated the capability of tensor-based semantic enrichment methods for medical information retrieval tasks.","authors":["Haolin Wang","Qingpeng Zhang","Jiahu Yuan"],"meta":["April 2017IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2017.2698142"],"references":["307883833_Optimization_Method_for_Weighting_Explicit_and_Latent_Concepts_in_Clinical_Decision_Support_Queries","301840318_Tensor_Methods_and_Recommender_Systems","313618510_Using_knowledge-based_relatedness_for_information_retrieval","310823736_Graph-Based_Multi-Modality_Learning_for_Clinical_Decision_Support","309428319_Semantic_Similarity_between_Ontologies_at_Different_Scales","291425241_Is_Concept_Mapping_Useful_for_Biomedical_Information_Retrieval","291295837_Reasoning_with_neural_tensor_networks_for_knowledge_base_completion","288492487_Exploiting_Inference_from_Semantic_Annotations_for_Information_Retrieval","288250868_A_Review_of_Relational_Machine_Learning_for_Knowledge_Graphs","285350681_Clinical_Decision-Support_Systems"]}