{"id":"316551140_Transdisziplinare_Mobilitatsforschung_unter_Verwendung_von_Reallaboren_Integration_von_Stakeholderbedurfnissen_und_-anforderungen_in_die_Entwicklung_von_Systemen_bedarfsorientiert_und_vollautomatisier","abstract":"Bedarfsorientierte Quartiersbussysteme stehen zunehmend im Fokus der Mobilitätsforschung, insbesondere auch im intermodalen Kontext. Sie folgen dem Trend, Verkehrsmittel nur zu nutzen anstatt sie auch zu besitzen und verknüpfen Vorteile des öffentlichen Personennahverkehrs (ÖPNV) mit Vorteilen des (motorisierten) Individualverkehrs ((M)IV), während sie Nachteile beider Fortbewegungs-arten vermeiden. Im Projekt Reallabor Schorndorf – Zukunftswei-sender ÖV: Bürgerorientierte Optimierung der Leistungsfähigkeit, Effizienz und Attraktivität im Nahverkehr (BOOLEAN) wird ein be-darfsorientiertes Quartiersbussystem entwickelt und umgesetzt. Quartiersbussysteme erfolgreich zu entwickeln und umzusetzen, bedeutet komplexe sozio-ökonomische und sozio-technische Systeme – Quartiersbussysteme – in bestehende Systeme – die aktuelle Realität – einzubetten. Dafür ist die Berücksichtigung, Integration und Harmonisierung von unterschiedlichen und teils gegensätzlichen Bedürfnissen und Anforderungen der unterschiedlichen beteiligten Stakeholder zwingend erforderlich. Stakeholder umfassen hier unter anderem Betreiber von Mobilitätsangeboten, Gemeinden und Nutzer. Zwei Herausforderungen sind dabei zu bewältigen: (1) Vorgehensweisen und Methoden einzelner Forschungsdisziplinen erfassen nur fachspezifische Aspekte der zu berücksichtigenden Bedürfnisse und Anforderungen. (2) Stakeholderverhalten, -bedürfnisse und \n-anforderungen in bestimmten Situationen können nicht zuverlässig vorhergesagt werden. Um diesen Herausforderungen zu begegnen, wird im Projekt Reallabor Schorndorf ein transdisziplinärer Ansatz unter Einbezug der Bürger (und anderer Akteure, wie der Stadt Schorndorf und Verkehrsunternehmen) einer gesamten Gemeinde als Reallabor verfolgt. Hierbei werden Perspektiven unterschiedlicher Disziplinen und Stakeholder in einem gemeinsamen Entwicklungsprozess, der unter realen Rahmenbedingungen stattfindet, integriert. Im vorliegenden Beitrag wird die Beantwortung der Frage fokussiert, inwieweit mit einem transdisziplinären Vorgehen unter Nutzung eines Reallabors Herausforderungen und letztendlich die beiden erwähnten zentralen Herausforderungen der Integration von Stakeholderbedürfnissen und -anforderungen in die Entwicklung bedarfsorientierter Quartiersbussysteme bewältigt werden können. Da vollautomatisiertes Fahren als vielversprechendes Entwicklungspotenzial von Systemen bedarfsorientiert fahrender Quartiersbusse gilt, wird dies als exemplarisches Beispiel näher beleuchtet.","authors":["Alexander Brandies","Alexandra König","Kathrin Viergutz","Eva Fraedrich"],"meta":["February 2017","Conference: AAET 2017: Automatisiertes & vernetztes FahrenAt: Brunswick, Germany","Project: Reallabor Schorndorf"],"references":["312528435_Need_and_requirement_analysis_and_integration_Balancing_method_and_methodology","304529775_Acceptance_of_Automated_Road_Transport_Systems_ARTS_an_adaptation_of_the_UTAUT_model","300136622_Implementierung_eines_selbstfahrenden_und_individuell_abrufbaren_Personentransportsystems","285828650_Transdisciplinary_case_studies_as_a_means_of_sustainability_learning_historical_framework_and_theory","284508707_Acceptance_of_Automated_Road_Transport_Systems_ARTS_An_adaptation_of_the_UTAUT_model","277983543_User_Acceptance_of_Information_Technology_Theories_and_Models","236209139_Collaboration_between_the_natural_social_and_human_sciences_in_Global_Change_Research","312216478_With_public_participation_to_a_stopless_and_timetableless_urban_quarter_bus_in_the_Real-world_lab_Schorndorf","274799723_Diffusion_of_Innovations","251210245_Umgang_mit_Informationen_und_Meinungsbildung_in_Projekten"]}