{"id":"316534244_Analysis_of_human_scream_and_its_impact_on_text-independent_speaker_verification","abstract":"Scream is defined as sustained, high-energy vocalizations that lack phonological structure. Lack of phonological structure is how scream is identified from other forms of loud vocalization, such as \"yell.\" This study investigates the acoustic aspects of screams and addresses those that are known to prevent standard speaker identification systems from recognizing the identity of screaming speakers. It is well established that speaker variability due to changes in vocal effort and Lombard effect contribute to degraded performance in automatic speech systems (i.e., speech recognition, speaker identification, diarization, etc.). However, previous research in the general area of speaker variability has concentrated on human speech production, whereas less is known about non-speech vocalizations. The UT-NonSpeech corpus is developed here to investigate speaker verification from scream samples. This study considers a detailed analysis in terms of fundamental frequency, spectral peak shift, frame energy distribution, and spectral tilt. It is shown that traditional speaker recognition based on the Gaussian mixture models-universal background model framework is unreliable when evaluated with screams.","authors":["John H. L. Hansen","Mahesh Kumar Nandwana","Navid Shokouhi"],"meta":["April 2017The Journal of the Acoustical Society of America 141(4):2957-2967","DOI:10.1121/1.4979337"],"references":["282940395_Speaker_Recognition_by_Machines_and_Humans_A_tutorial_review","267797993_Consonant_production_in_Greek_Lombard_speech_An_electropalatographic_study","267097194_Effect_of_long-term_ageing_on_i-vector_speaker_verification","313658169_Lombard_effect_compensation_for_robust_automatic_speech_recognition_in_noise","303674860_IEEE_Recommended_Practice_for_Speech_Quality_Measurements","289414964_Analysis_and_identification_of_human_scream_Implications_for_speaker_recognition","285976647_Comparison_of_Parametric_Representations_for_Monosyllabic_Word_Recognition_in_Continuously_Spoken_Sentences","285575257_Robust_unsupervised_detection_of_human_screams_in_noisy_acoustic_environments","272317524_Effects_of_noise_on_speech_production_Acoustic_and_perceptual_analyses","265414192_IEEE_Recommended_Pratice_for_Speech_Quality_Measurements"]}