{"id":"316594980_Handbook_of_Image_and_Video_Processing","abstract":"55% new material in the latest edition of this \"must-have? for students and practitioners of image & video processing!This Handbook is intended to serve as the basic reference point on image and video processing, in the field, in the research laboratory, and in the classroom. Each chapter has been written by carefully selected, distinguished experts specializing in that topic and carefully reviewed by the Editor, Al Bovik, ensuring that the greatest depth of understanding be communicated to the reader. Coverage includes introductory, intermediate and advanced topics and as such, this book serves equally well as classroom textbook as reference resource. - Provides practicing engineers and students with a highly accessible resource for learning and using image/video processing theory and algorithms - Includes a new chapter on image processing education, which should prove invaluable for those developing or modifying their curricula - Covers the various image and video processing standards that exist and are emerging, driving today's explosive industry - Offers an understanding of what images are, how they are modeled, and gives an introduction to how they are perceived - Introduces the necessary, practical background to allow engineering students to acquire and process their own digital image or video data - Culminates with a diverse set of applications chapters, covered in sufficient depth to serve as extensible models to the reader's own potential applications About the Editor... Al Bovik is the Cullen Trust for Higher Education Endowed Professor at The University of Texas at Austin, where he is the Director of the Laboratory for Image and Video Engineering (LIVE). He has published over 400 technical articles in the general area of image and video processing and holds two U.S. patents. Dr. Bovik was Distinguished Lecturer of the IEEE Signal Processing Society (2000), received the IEEE Signal Processing Society Meritorious Service Award (1998), the IEEE Third Millennium Medal (2000), and twice was a two-time Honorable Mention winner of the international Pattern Recognition Society Award. He is a Fellow of the IEEE, was Editor-in-Chief, of the IEEE Transactions on Image Processing (1996-2002), has served on and continues to serve on many other professional boards and panels, and was the Founding General Chairman of the IEEE International Conference on Image Processing which was held in Austin, Texas in 1994.","authors":["Alan Bovik"],"meta":["January 2005","DOI:10.1016/B978-0-12-119792-6.X5062-1"],"references":[]}