{"id":"316502780_Coauthorship_network_in_transportation_research","abstract":"The field of transportation research has been accelerating in the last decade. In this paper, we examine the structure of scientific collaboration in transportation research by building a coauthorship network using publication metadata from 22 transportation journals. In this network, a vertex represents a researcher and an edge represents the collaboration (coauthorship) between a pair of researchers. To build an accurate network, we propose and apply an efficient author name correction algorithm. The obtained network provides us with a tool to understand patterns of collaborations in transportation research. The results show an increasing trend of collaboration over the studied period (1990–2015), but different journals exhibit different patterns. We characterize the structural properties of this network and compute several centrality measures to quantify the performance/impact of researchers and their collaborations in the research community. This study could serve as a tool to qualitatively and quantitatively understand scientific collaborations in transportation research.","authors":["Lijun Sun","Iyad Rahwan"],"meta":["June 2017Transportation Research Part A Policy and Practice 100:135-151","DOI:10.1016/j.tra.2017.04.011"],"references":["313018559_Discovering_themes_and_trends_in_transportation_research_using_topic_modeling","301865836_Network_Structure_Self-Organization_and_the_Growth_of_International_Collaboration_in_Science","281425954_A_Scientometric_Analysis_of_Public_Transport_Research","280924121_Publishing_Transport_Research_Are_We_Learning_Much_of_Use","258168189_Citation_counts_in_transportation_research","229518195_Author_name_disambiguation_for_collaboration_network_analysis_and_visualization","335010115_The_demise_of_the_lone_author","317084030_The_PageRank_citation_ranking_Bringing_order_to_the_Web_Technical_report","232280309_Collaborations_The_Rise_of_Research_Networks","228253542_Co-Authorship_in_Management_and_Organizational_Studies_An_Empirical_and_Network_Analysis"]}