{"id":"316557352_Impact_of_Random_Mobility_Models_for_Reactive_Routing_Protocols_over_MANET","abstract":"Mobile Ad hoc Networks (MANETs) belong to Wireless Networks where the nodes communicate with each other in a multi-hop fashion without any centralized control. In these networks, the topology does not remain constant due to the mobility of nodes, interference, path loss and multipath propagation. So, it does not require an infrastructure to resume the network connectivity. This infrastructure less, resource constrained, with limited memory and computing capacity along with the dynamic topology of MANET, demands different network strategies to be implemented to accomplish the communication. Considering all these issues, routing performs a crucial role while computing the path from source to the destination. Further, Mobility modeling and control makes the topology of MANET more challenging which requires considerable human focus. To handle this scenario, different solutions have been presented by many potential researchers. This paper attempts to focus on the performance of two reactive routing protocols such as DSR and AODV routing protocols by considering different random mobility models by using NetSim Simulator viewing that applicability of the protocol can be enhanced. So, this paper measures some performances such as Throughput, End to End delay, Packet Delivery Ratio (PDR) and Routing Overhead of communication protocols to check the impact on the variable topology of MANET.","authors":["Padmalaya Nayak","Bhavani Vathasavai"],"meta":["January 2016International Journal of Simulation: Systems, Science & Technology 17(34):13.1-13.9","DOI:10.5013/IJSSST.a.17.34.13"],"references":["269305472_Overview_of_Proactive_Routing_Protocols_in_MANET","265571171_Performance_Comparison_of_DSDV_and_AODV_Routing_Protocols_in_MANETS","259528519_A_Review_and_Comparison_of_Reliable_Unicast_Routing_Protocols_For_Mobile_Ad_Hoc_Networks","239280842_Performance_Comparison_and_Analysis_of_Table_Driven_and_On-Demand_Routing_Protocols_for_Mobile_Ad-hoc_Networks","224207694_Multipath_routing_mechanism_with_load_balancing_in_ad_hoc_network","224121988_A_unified_analysis_of_routing_protocols_in_MANETs","310670788_Ad-hoc_on-demand_distance_vector_AODV_routing","261227103_A_review_of_QoS_routing_protocols_in_MANETs","224214546_QoSBeeManet_A_new_QoS_multipath_routing_protocol_for_mobile_ad-hoc_networks","216302200_Routing_protocols_in_ad_hoc_networks_A_survey"]}