{"id":"316692278_Interdisciplinary_Problem-Based_Learning_Practices_in_Higher_Education","abstract":"More and more students in higher education are enrolling on interdisciplinary programs. This phenomenon occurs since universities are breaking the boarders of a single subject area. At the university of Nicosia, the lecturer of two interdependent courses: MGT-372 Management of Innovation and Technology and MIS-151 Business Software Applications attempted to bring together students from different disciplines to explore the two topics. More specifically, through Interdisciplinary Problem-Based Learning (IPBL), the lecturer (author) aimed to eliminate the fragmentation and the learning of isolated skills and investigate students' motivation for learning and their level of active engagement through the use of technology (Google Apps). To address the above, the study employed a case study approach, collecting qualitative data through student focus groups, online/in-class observations, and lecturers' comments. The study showed that students seemed intrigued and satisfied working on interdisciplinary tasks, shared prior and newly researched knowledge, as well as acquired an integrated viewpoint and solution-focused strategies deriving from those disciplines.","authors":["Despo Ktoridou"],"meta":["January 2014","DOI:10.4018/978-1-4666-6375-6.ch010","In book: Cases on Research-Based Teaching Methods in Science Education (pp.243-263)"],"references":["260676721_Interdisciplinary_Curriculum_Development","225958578_Interdisciplinary_Learning_Process_and_Outcomes","224148686_Applying_an_inductive_method_to_a_new_multidiciplinary_management_of_innovation_technology_course_Evidence_from_the_University_of_Nicosia","261695001_Moving_toward_the_Integration_of_Professional_and_General_Education","242560724_The_Power_of_Problem-Based_Learning","231264752_A_Review_of_Laboratory_Instruction_Styles","229745776_Assessing_interdisciplinary_learning","215666056_InterViews_An_Introduction_to_Qualitative_Research_Interviewing","14991425_Foundations_of_Problem-Based_Learning_Some_Explanatory_Notes","11433570_Comparison_of_problem-and_lecture-based_pharmacology_teaching"]}