{"id":"316669380_A_Taxonomy_of_Event_Time_Representations","abstract":"Terms such as \"simulated time\", \"simulation time\", \"virtual time\", \"logical time\", and \"real time\" appear throughout the modeling and simulation literature as a means of describing the timing, ordering, and/or processing of events. Unfortunately, this vocabulary can become a source of confusion due to subtle inconsistencies in how the terms are interpreted. Here we review mathematical representations of event times, identify their formal relationships, and present a taxonomy to clarify the proper meanings of the most common notions of time in a simulation context. For example, the taxonomy indicates that while both scalar logical time and virtual time feature a property called causal consistency, virtual time differs in that it is formally consistent with simulated time. We also argue that while simulated time is a form of simulation time, the two terms should not be used interchangeably. A thorough look at the various event time representations suggests new research opportunities, such as the repurposing of distributed computing techniques for debugging both parallel and sequential discrete event simulations.","authors":["Rhys Goldstein","Azam Khan"],"meta":["April 2017","Conference: Symposium on Theory of Modeling and SimulationAt: Virginia Beach, VA, USA","Project: Systems Design and Simulation"],"references":["316858726_An_advanced_data_type_with_irrational_numbers_to_implement_time_in_DEVS_simulators","310794910_A_Quantum_of_Continuous_Simulated_Time","311474540_The_threshold_of_event_simultaneity","309264240_Semantics_of_multisampling_systems","305794650_Debugging_parallel_DEVS","305671945_System_Entity_Structure_Extension_to_Integrate_Abstraction_Hierarchy_and_Time_Granularity_into_DEVS_Modeling_and_Simulation","304932656_Debugging_distributed_systems","303011819_'Cause_I'm_strong_enough_Reasoning_about_consistency_choices_in_distributed_systems","281309461_Designing_DEVS_visual_interfaces_for_end-user_programmers","274483128_Don't_Settle_for_Eventual_Consistency"]}