{"id":"316649521_Chemotaxis_and_autochemotaxis_of_self-propelling_droplet_swimmers","abstract":"Chemotaxis and autochemotaxis play an important role in many essential biological processes. We present a self-propelling artificial swimmer system that exhibits chemotaxis as well as negative autochemotaxis. Oil droplets in an aqueous surfactant solution are driven by interfacial Marangoni flows induced by micellar solubilization of the oil phase. We demonstrate that chemotaxis along micellar surfactant gradients can guide these swimmers through a microfluidic maze. Similarly, a depletion of empty micelles in the wake of a droplet swimmer causes negative autochemotaxis and thereby trail avoidance. We studied autochemotaxis quantitatively in a microfluidic device of bifurcating channels: Branch choices of consecutive swimmers are anticorrelated, an effect decaying over time due to trail dispersion. We modeled this process by a simple one-dimensional diffusion process and stochastic Langevin dynamics. Our results are consistent with a linear surfactant gradient force and diffusion constants appropriate for micellar diffusion and provide a measure of autochemotactic feedback strength vs. stochastic forces. This assay is readily adaptable for quantitative studies of both artificial and biological autochemotactic systems.","authors":["Chenyu Jin","Carsten Krüger","Corinna C. Maass"],"meta":["May 2017Proceedings of the National Academy of Sciences 114(20):5089–5094","DOI:10.1073/pnas.1619783114"],"references":["308749780_Phototaxis_of_synthetic_microswimmers_in_optical_landscapes","281144722_Clustering_and_Pattern_Formation_in_Chemorepulsive_Active_Colloids","275588316_Effective_Dynamics_of_Microorganisms_That_Interact_with_Their_Own_Trail","263352266_Self-Propulsion_of_Pure_Water_Droplets_by_Spontaneous_Marangoni-Stress-Driven_Motion","313190264_Methods_of_solution_when_the_diffusion_coefficient_is_constant","305673756_Chemotaxis_and_Chemokinesis_of_Living_and_Non-living_Objects","302946993_Curling_Liquid_Crystal_Microswimmers_A_Cascade_of_Spontaneous_Symmetry_Breaking","287159247_Swimming_Droplets","280589136_Designing_Synthetic_Microcapsules_That_Undergo_Biomimetic_Communication_and_Autonomous_Motion","265610495_Dynamics_of_Chemotactic_Droplets_in_Salt_Concentration_Gradients"]}