{"id":"316614060_R-LWE_based_lightweight_privacy_preserving_scheme_for_Smart_Grid","abstract":"In most of the developing nations including India, we still have the traditional electricity grids meeting our daily supply energy and monitoring energy consumption per household once in a month. Due to limited monitoring capacity, the traditional electricity grids cannot forecast the exact demand side so that supply side of grid can be scaled accordingly. To forecast the customers demand more effectively, traditional grids are getting upgraded into Smart Grids. Smart Grid consists of various elements including Smart Appliances, Smart meters, Access points and Control Centers to form an advance network which can continuously monitor energy profiling information of the customers. Continuous monitoring of customers energy profiling and consumption is possible in the form of secured communication of message exchange between different elements of Smart Grid i.e. between Smart Appliances and Smart meters, smart meters and access points, access points gateways and control centers. Demand forecast prediction is key to Smart Grid, but customer privacy needs to be preserved. In this paper, we attempt to propose a lightweight privacy preservation scheme. Proposed scheme is based on lattice based public key cryptography using R-LWE to define the security. Analytical results indicate that the proposed scheme maintains message overhead with reduction in computation overhead.","authors":["Aarti Amod Agarkar","Himanshu Agrawal"],"meta":["December 2016","DOI:10.1109/CAST.2016.7915004","Conference: 2016 International Conference on Computing, Analytics and Security Trends (CAST)"],"references":["299396013_Elliptic_Curve_Cryptography-Based_Authentication_with_Identity_Protection_for_Smart_Grids","285311235_Privacy-Preserving_Smart_Metering_with_Authentication_in_a_Smart_Grid","283951581_PAS_An_Efficient_Privacy-Preserving_Multidimensional_Aggregation_Scheme_for_Smart_Grid","283042226_On_Lightweight_Authentication_for_Smart_Grid_Network","312443622_An_ElGamal-based_efficient_and_privacy-preserving_data_aggregation_scheme_for_smart_grid","301307143_A_Lightweight_Lattice-Based_Homomorphic_Privacy-Preserving_Data_Aggregation_Scheme_for_Smart_Grid","300717586_Efficient_Software_Implementation_of_Ring-LWE_Encryption","290737487_Compact_Ring-LWE_Cryptoprocessor","290258584_Man-in-the-Middle_Attack","283782263_An_ElGamal-based_efficient_and_privacy-preserving_data_aggregation_scheme_for_smart_grid"]}