{"id":"316630314_Multilevel_structural_equation_models_for_investigating_the_effects_of_computer-based_learning_in_math_classrooms_on_Science_Technology_Engineering_and_Math_STEM_major_selection_in_4-year_postsecondar","abstract":"Background/Context: Because of the growing concern over the decline of bachelor degree recipients in the disciplines of science, technology, engineering, and math (STEM) in the U.S., several studies have been devoted to identifying the factors that affect students' STEM major choices. A majority of these studies have focused on factors relevant to math and science. However, few studies have addressed the linkage between technology-or engineering-related factors and students' STEM major selection. Purpose: The purpose of this study was to investigate the extent to which 10th-grade students' engagement in computer-based learning activities in math classrooms has an effect on student STEM major selection in 4-year postsecondary institutions. After controlling for student-and school-level variables, this study explored the effects of computer-based learning activities in math classrooms on students' STEM major selections as mediated by either math self-efficacy or math performance. Research Design: The data from this study were collected from the Educational Longitudinal Study of 2002/2006 (ELS: 2002/2006) conducted by the National Center for Education Statistics of the Institute of Education Sciences in the U.S. Department of Education. ELS: 2002/2006 included a nationally representative sample of young adults who had enrolled in 4-year colleges or universities by 2006. Considering the hierarchical structure of the ELS: 2002/2006, in which students are nested within schools, I used multilevel structural equation modeling (ML-SEM) rather than traditional SEM. Findings: Students' engagement in computer-based learning activities in math classrooms had a positive effect on their STEM major selection as mediated by math self-efficacy. Specifically, student computer-based learning activities had a larger effect on students' STEM major selection than did individual-and lecture-based learning activities. In addition, at the school level, a marginal, but significant, relationship emerged between math teachers' motivation and students' math performance. Conclusions: This study provided evidence that it is important to incorporate computer-based learning activities into math classrooms at the secondary level. Moreover, at the school level, the significant effect of teacher motivation on students' math achievement scores suggests that motivating teachers is an important part of STEM education, particularly given the fact that teachers are responsible for designing and implementing progressive math curricula that are embedded in computer-based learning activities.","authors":["Ahlam Lee"],"meta":["January 2017"],"references":["289232028_Confirmatory_Factor_Analysis_Cfa_for_testing_validity_and_reliability_instrument_in_the_study_of_education","281345525_Motivational_Beliefs_Values_and_Goals","279558680_The_relationship_between_students'_exposure_to_technology_and_their_achievement_in_science_and_math","262487753_Teacher_Evaluation_Policy_and_Conflicting_Theories_of_Motivation","258182794_What_Forty_Years_of_Research_Says_About_the_Impact_of_Technology_on_Learning_A_Second-Order_Meta-Analysis_and_Validation_Study","317953663_Self-Efficacy_Toward_a_Unifying_Theory_of_Behavioral_Change","284337042_Resources_and_reality_the_participation_of_minorities_in_science_and_engineering_education","264950100_Full_Information_Estimation_in_the_Presence_of_Incomplete_Data","263064169_Effects_of_High_School_Course-Taking_and_Other_Variables_on_Choice_of_Science_and_Mathematics_College_Majors","259682886_Pre-College_Engineering_Studies_An_Investigation_of_the_Relationship_Between_Pre-college_Engineering_Studies_and_Student_Achievement_in_Science_and_Mathematics"]}