{"id":"316682119_Structural_and_thermal_analysis_of_rotor_disc_of_disc_brake","abstract":"Abstract: The disc brake is a device for slowing or stopping the rotation of a wheel. Repetitive braking of the vehicle leads\nto heat generation during each braking event. Transient Thermal and Structural Analysis of the Rotor Disc of Disk Brake is\naimed at evaluating the performance of disc brake rotor of a car under severe braking conditions and there by assist in disc\nrotor design and analysis. Disc brake model and analysis is done using ANSYS workbench 14.5. The main purpose of this\nstudy is to analysis the thermomechanical behavior of the dry contact of the brake disc during the braking phase. The\ncoupled thermal-structural analysis is used to determine the deformation and the Von Mises stress established in the disc for\nthe both solid and ventilated disc with two different materials to enhance performance of the rotor disc. A comparison\nbetween analytical and results obtained from FEM is done and all the values obtained from the analysis are less than their\nallowable values. Hence best suitable design, material and rotor disc is suggested based on the performance, strength and\nrigidity criteria.\n\nKeywords: Disc Flange, ANSYS Workbench, Structural, Thermal Analysis, Disc Brake","authors":["Suresh P M","Manjunath T V"],"meta":["December 2013"],"references":["279502071_Influence_Of_Wall_Axial_Heat_Conduction_On_The_Forced_Convection_Heat_Transfer_In_Rectangular_Channels","271972545_Aspects_Regarding_the_Disc_Brake's_Thermal_Stress_Simulation_by_Using_Infrared_Thermography","271306660_Design_Development_of_Lightweight_Disc_Brake_for_Regenerative_Braking_-_Finite_Element_Analysis","46029500_Investigation_of_Heat_Transfer_Phenomena_in_a_Ventilated_Disk_Brake_Rotor_with_Straight_Radial_Rounded_Vanes","348209486_Transient_Analysis_of_Disk_Brake_By_using_Ansys_Software","311845004_Thermal_Behavior_of_Dry_Contacts_in_the_Brake_Discs","276321469_COUPLED_STRUCTUAL_THERMAL_ANALYSIS_OF_DISC_BRAKE","266488014_THE_COMPARABLE_ANALYSIS_OF_TEMPERATURE_DISTRIBUTIONS_ASSESSMENT_IN_DISC_BRAKE_OBTAINED_USING_ANALYTICAL_METHOD_AND_FE_MODEL"]}