{"id":"316681173_Text_Documents_Plagiarism_Detection_using_Rabin-Karp_and_Jaro-Winkler_Distance_Algorithms","abstract":"Plagiarism is an act that is considered by the university as a fraud by taking someone ideas or writings without mentioning the references and claimed as his own. Plagiarism detection system is generally implement string matching algorithm in a text document to search for common words between documents. There are some algorithms used for string matching, two of them are Rabin-Karp and Jaro-Winkler Distance algorithms. Rabin-Karp algorithm is one of compatible algorithms to solve the problem of multiple string patterns, while, Jaro-Winkler Distance algorithm has advantages in terms of time. A plagiarism detection application is developed and tested on different types of documents, i.e. doc, docx, pdf and txt. From the experimental results, we obtained that both of these algorithms can be used to perform plagiarism detection of those documents, but in terms of their effectiveness, Rabin-Karp algorithm is much more effective and faster in the process of detecting the document with the size more than 1000 KB. © 2017 Institute of Advanced Engineering and Science. All rights reserved.","authors":["Brinardi Leonardo","Seng Hansun"],"meta":["February 2017Indonesian Journal of Electrical Engineering and Computer Science 5(2):462-471","DOI:10.11591/ijeecs.v5.i2.pp462-471"],"references":["294872088_Semantic_SimilarityRelatedness_for_Cross_Language_Plagiarism_Detection","287139909_Detailed_Analysis_of_Extrinsic_Plagiarism_Detection_System_Using_Machine_Learning_Approach_Naive_Bayes_and_SVM","220693416_Handbook_of_Exact_String_Matching_Algorithms","220555325_Computational_complexity_A_conceptual_perspective","316857373_Computer_programming_as_an_art","268293475_DETEKSI_PLAGIAT_DOKUMEN_MENGGUNAKAN_ALGORITMA_RABIN-KARP","266223219_Perbandingan_dan_Pengujian_Beberapa_Algoritma_Pencocokan_String","265663867_An_Algorithm_for_String_Searching_Based_on_Brute-Force_Algorithm","236396425_The_Complete_Guide_to_Referencing_and_Avoiding_Plagiarism","220888493_Document_Similarity_Analysis_for_a_Plagiarism_Detection_System"]}