{"id":"316656442_b-N-Methylamino-L-Alanine_Toxicity_in_PC12_Excitotoxicity_vs_Misincorporation","abstract":"The implication of β-N-methylamino-L-alanine (BMAA) in the development of neurodegenerative diseases worldwide has led to several investigations of the mechanism, or mechanisms, of toxicity of this cyanobacterially produced amino acid. The primary mechanism of toxicity that was identified is excitotoxicity, with a second possible mechanism, the misincorporation of BMAA into the primary protein structure and consequent cell damage, having been more recently reported. However, studies on excitotoxicity and misincorporation have been conducted independently and there are therefore no data available on the relative contribution of each of these mechanisms to the total toxicity of BMAA. The rat pheochromocytoma cell line PC12 is an ideal model for a study of this type, as glutamate receptor expression is modified by cell differentiation, which can be affected by exposure to nerve growth factor. In this study, the PC12 cell line was evaluated as a model to study BMAA toxicity via the two proposed mechanisms: excitotoxicity and protein misincorporation. BMAA and canavanine treatment of cultures of PC12 were evaluated for depolarization of the mitochondrial membrane. In canavanine-treated cultures, this was evident after 9 days of treatment and was attributed to the primary mechanism of canavanine toxicity, protein misincorporation. However, no membrane depolarization was observed for BMAA-treated cultures even after 21 days of continuous treatment at 500 μM. Short-term exposure to both BMAA and canavanine resulted in a slight increase in necrosis in undifferentiated cells that was prevented in canavanine-treated cultures by co-incubation with arginine, but not in BMAA-treated cultures by co-incubation with serine. A slight increase in apoptosis was observed in undifferentiated cells treated with either BMAA or glutamate, and ROS production increased in glutamate-treated cells. However, the excitotoxicity was less pronounced than reported in previous studies with neuronal cells. In contrast, apoptosis was greatly increased in both BMAA- and glutamate-treated cells after differentiation and resulting mGluR1 increase, indicating that excitotoxicity is the main, if not only, mechanism of toxicity in PC12.","authors":["Rianita van Onselen","Luanne Venables","Maryna Van de Venter","Timothy G Downing"],"meta":["January 2018Neurotoxicity Research 33(1):1-9","DOI:10.1007/s12640-017-9743-8"],"references":["262446159_Improved_sensitivity_using_liquid_chromatography_mass_spectrometry_LC-MS_for_detection_of_propyl_chloroformate_derivatised_946-N-methylamino-L-alanine_BMAA_in_cyanobacteria","257302573_The_Non-Protein_Amino_Acid_BMAA_Is_Misincorporated_into_Human_Proteins_in_Place_of_L-Serine_Causing_Protein_Misfolding_and_Aggregation","247840303_Metabotropic_Glutamate_Receptor_1_Mediates_the_Electrophysiological_and_Toxic_Actions_of_the_Cycad_Derivative_-N-Methylamino-L-Alanine_on_Substantia_Nigra_Pars_Compacta_DAergic_Neurons","235415534_Rsk2_Knockdown_in_PC12_Cells_Results_in_Sp1_Dependent_Increased_Expression_of_the_Gria2_Gene_Encoding_the_AMPA_Receptor_Subunit_GluR2","277894115_Bacteria_do_not_incorporate_b-N-methylamino-L-alanine_into_their_proteins","270480414_AMYOTROPHIC_LATERAL_SCLEROSIS","262786395_Environmental_modulation_of_microcystin_and_b-N-methylamino-L-alanine_as_a_function_of_nitrogen_availability","248553972_Establishment_of_noradrenergic_clonal_line_of_rat_adrenal_phaeochromocytoma_cells_which_respond_to_NGF","248216696_a-Amino-b-methylaminopropionic_acid_a_new_amino_acid_from_seeds_of_Cycas_circinalis","235410802_The_preparation_of_L-_and_D--alpha-amino-beta-methylamino_propionic_acids_and_the_identification_of_the_compound_isolated_from_Cycas_circinalis_as_the_L-isomer","221698580_Cyanobacterial_Neurotoxin_b-N-Methylamino-L-alanine_BMAA_in_Shark_Fins","230656291_Excitotoxic_potential_of_the_cyanotoxin_b-methyl-amino-L-alanine_BMAA_in_primary_human_neurons","223843118_b-N-Methylaminoalanine_BMAA_Metabolism_and_metabolic_effects_in_model_systems_and_in_neural_and_other_tissues_of_the_rat_in_vitro","222688035_Oxidative_glutamate_toxicity_involves_mitochondrial_dysfunction_and_perturbation_of_intracellular_Ca2_homeostasis","222129872_Adenovirus-mediated_expression_of_AMPA-type_glutamate_receptor_channels_in_PC12_cells"]}