{"id":"316617870_Stochastic_Block_Model_Reveals_the_Map_of_Citation_Patterns_and_Their_Evolution_in_Time","abstract":"In this study we map out the large-scale structure of citation networks of science journals and follow their evolution in time by using stochastic block models (SBMs). The SBM fitting procedures are principled methods that can be used to find hierarchical grouping of journals into blocks that show similar incoming and outgoing citations patterns. These methods work directly on the citation network without the need to construct auxiliary networks based on similarity of nodes. We fit the SBMs to the networks of journals we have constructed from the data set of around 630 million citations and find a variety of different types of blocks, such as clusters, bridges, sources, and sinks. In addition we use a recent generalization of SBMs to determine how much a manually curated classification of journals into subfields of science is related to the block structure of the journal network and how this relationship changes in time. The SBM method tries to find a network of blocks that is the best high-level representation of the network of journals, and we illustrate how these block networks (at various levels of resolution) can be used as maps of science.","authors":["Darko Hric","Kimmo Kaski","Mikko Kivelä"],"meta":["April 2017Journal of Informetrics 12(3)","DOI:10.1016/j.joi.2018.05.004"],"references":["305440413_The_Memory_of_Science_Inflation_Myopia_and_the_Knowledge_Network","301879506_Network_structure_metadata_and_the_prediction_of_missing_nodes","313607570_The_architecture_of_complex_weighted_networks","308713085_The_graph-tool_python_library","305780197_Community_detection_in_networks_A_user_guide","303605804_On_the_shortest_spanning_subtree_of_a_graph_and_the_traveling_salesman_problem","303153835_Cluster_analysis_in_marketing_research_Review_and_suggestions_for_application","291870921_Bibliographic_coupling_between_scientific_articles","290484945_Find_and_evaluating_community_structure_in_networks","285459024_Disentangling_bipartite_and_core-periphery_structure_in_financial_networks"]}