{"id":"316637976_Analyzing_Social_Media_Networks_With_NodeXL","abstract":"Businesses, entrepreneurs, individuals, and government agencies alike are looking to social network analysis (SNA) tools for insight into trends, connections, and fluctuations in social media. Microsoft's NodeXL is a free, open-source SNA plug-in for use with Excel. It provides instant graphical representation of relationships of complex networked data. But it goes further than other SNA tools -- NodeXL was developed by a multidisciplinary team of experts that bring together information studies, computer science, sociology, human-computer interaction, and over 20 years of visual analytic theory and information visualization into a simple tool anyone can use. This makes NodeXL of interest not only to end-users but also to researchers and students studying visual and network analytics and their application in the real world. In Analyzing Social Media Networks with NodeXL, members of the NodeXL development team up to provide readers with a thorough and practical guide for using the tool while also explaining the development behind each feature. Blending the theoretical with the practical, this book applies specific SNA instructions directly to NodeXL, but the theory behind the implementation can be applied to any SNA. To learn more about Analyzing Social Media Networks and NodeXL, visit the companion site at www.mkp.com/nodexl Walks readers through using NodeXL while explaining the theory and development behind each step, providing takeaways that can apply any SNA Demonstrates how visual analytics research can be applied to SNA tools for the mass market Presents readers with case studies using NodeXL on popular networks like email, Facebook, Twitter, and wikis.","authors":["Derek L. Hansen","B. Shneiderman","Marc A Smith"],"meta":["January 2011","DOI:10.1016/C2009-0-64028-9"],"references":["40622885_Public_Deliberation_as_the_Organizing_Principle_of_Political_Communication_Research","6715571_IPSep-CoLa_An_Incremental_Procedure_for_Separation_Constraint_Layout_of_Graphs","262164166_How_to_Draw_a_Directed_Graph","237967764_Socio-Communicational_Structure_among_Political_Actors_on_the_Web_in_South_Korea_The_Dynamics_of_Digital_Presence_in_Cyberspace","227851998_Aesthetics-based_Graph_Layout_for_Human_Consumption","227498326_The_Diffusion_of_a_Task_Recommendation_System_to_Facilitate_Contributions_to_an_Online_Community","224745189_Empirical_comparison_of_dynamic_query_sliders_and_brushing_histograms","220437960_Assessing_the_Structure_of_Communication_on_the_World_Wide_Web","23456193_Perceptual_Organization_in_User-Generated_Graph_Layouts","23312643_Web_Science_Emerges","3195527_Leveraging_cyberspace"]}