{"id":"316600283_Data_Mining_Concepts_and_Techniques","abstract":"This is the third edition of the premier professional reference on the subject of data mining, expanding and updating the previous market leading edition. This was the first (and is still the best and most popular) of its kind. Combines sound theory with truly practical applications to prepare students for real-world challenges in data mining. Like the first and second editions, Data Mining: Concepts and Techniques, 3rd Edition equips professionals with a sound understanding of data mining principles and teaches proven methods for knowledge discovery in large corporate databases. The first and second editions also established itself as the market leader for courses in data mining, data analytics, and knowledge discovery. Revisions incorporate input from instructors, changes in the field, and new and important topics such as data warehouse and data cube technology, mining stream data, mining social networks, and mining spatial, multimedia and other complex data. This book begins with a conceptual introduction followed by a comprehensive and state-of-the-art coverage of concepts and techniques. Each chapter is a stand-alone guide to a critical topic, presenting proven algorithms and sound implementations ready to be used directly or with strategic modification against live data. Wherever possible, the authors raise and answer questions of utility, feasibility, optimization, and scalability. relational data. -- A comprehensive, practical look at the concepts and techniques you need to get the most out of real business data. -- Updates that incorporate input from readers, changes in the field, and more material on statistics and machine learning, -- Scores of algorithms and implementation examples, all in easily understood pseudo-code and suitable for use in real-world, large-scale data mining projects. -- Complete classroom support for instructors as well as bonus content available at the companion website. A comprehensive and practical look at the concepts and techniques you need in the area of data mining and knowledge discovery.","authors":["Jiawei Han","Micheline Kamber","Jian Pei"],"meta":["January 2012","DOI:10.1016/C2009-0-61819-5"],"references":["221654593_Community_evolution_in_dynamic_multi-mode_networks","221653558_Mining_Periodic_Behaviors_for_Moving_Objects","220520128_A_note_on_Beyond_Market_Baskets_Generalizing_Association_Rules_to_Correlations","24169486_Boosting_the_Accuracy_of_Differentially-Private_Histograms_Through_Consistency","234810171_ISAX_Indexing_and_mining_terabyte_sized_time_series","221654673_Mining_advisor-advisee_relationships_from_research_publication_networks","221653435_Angle-based_outlier_detection_in_high-dimensional_data"]}