{"id":"316637163_An_Empirical_Study_on_the_Impact_of_an_IDE_Tool_Support_in_the_Pair_and_Solo_Programming","abstract":"The adoption of agile software development approaches has been widespread. One well-known agile approach is eXtreme Programming (XP), which encompasses twelve practices being pair programming one of them. Although various aspects of pair programming have been studied, we have not found, under a traditional setting of Pair Programming (PP), studies that examine the impact of using a tool support, such as an Integrated Development Environment (IDE) or a simple text editor. In an attempt to obtain a better understanding of the impact of using an IDE in this field, we present the results of a controlled experiment that expose the influence on quality, measured as the number of defects injected per hour, and cost, measured as the time necessary to complete a programming assignment, of pair and solo programming with and without the use of an IDE. For quality, our findings suggest that the use of an IDE results in significantly higher defect injection rates (for both pairs and solos) when the programming assignment is not very complicated. Nevertheless, defect injection rates seem to decrease when pairs work on more complicated programming assignments irrespective of the tool support that they use. For cost, the programming assignment significantly affects the time needed\nto complete the assignment. In relation to the programming type, pairs and solos performed in a similar way with regards to quality and cost.","authors":["Omar S. Gómez","Antonio A. Aguileta","Raúl Antonio Aguilar Vera","Juan Pablo Ucán Pech"],"meta":["May 2017IEEE Access 5(1):9175-9187","DOI:10.1109/ACCESS.2017.2701339","Project: Teaching Software Development"],"references":["269168865_Tipologia_de_Replicaciones_para_la_Sintesis_de_Experimentos_en_Ingenieria_del_Software","261599409_Understanding_Replication_of_Experiments_in_Software_Engineering_A_Classification","336585492_Evaluating_Tools_that_Support_Pair_Programming_in_a_Distributed_Engineering_Environment","323424582_Statistical_power_analysis_for_the_behavioral_sciences","314722187_Experimenting_with_pair_programming_in_the_classroom","290998155_ez_Easy_Analysis_and_Visualization_of_Factorial_Experiments","274002129_An_Empirical_Study_of_Agile_Software_Development_Methodologies_A_Sri_Lankan_PerspectiveAn_Empirical_Study_of_Agile_Software_Development_Methodologies_A_Sri_Lankan_Perspective","271820602_A_comparative_analysis_of_different_gender_pair_combinations_in_pair_programming","267432668_Statistical_Principles_for_the_Design_of_Experiments","261075451_Survey_on_agile_and_lean_usage_in_finnish_software_industry"]}