{"id":"316600734_Developing_a_New_e-Exam_Platform_to_Enhance_the_University_Academic_Examinations_the_Case_of_Lebanese_French_University","abstract":"Although the philosophy of education of many universities began shifted gradually towards using computers and information and communication technologies to establish effective education environment, the traditional style of examinations (that suffering from real problems related to the type of using paper and pen) is still used in these technological environments. The current e-Exam systems that have been used in modern education environment are still suffering from many problems, but in spite they solved some traditional exam problems, the authors highlighted these issues and developed a new e-Exam platform to provide a better quality exam in terms of saving cost, time, effort and cheating probability. The developed e-Exam was implemented upon client/server network architecture on three computer laboratories at the department of IT in LFU. This e-Exam is being used by 14 lecturers to make daily quizzes, midterm and final exams for 142 morning and evening students to replace most of the paper based examinations since October 2015. The developed e-Exam platform includes three main subsystems which are integrated and working together to generate e-Exam Packages and to deliver the e-Examinations. A special e-Exam Browser was implemented using C Sharp to establish the client/server model. A usability test of e-Exam platform and questionnaires for both lecturers and students were carried out to assess satisfaction and effectiveness. Finally, the empirical outcomes were achieved and mentioned in this paper. To the best of our knowledge based to review literature and our e-Exam adoption survey, the implemented platform represents the first official e-Exam platform in Kurdistan Region of Iraq.","authors":["Mazin S. Al-Hakeem","Mohammed Salim"],"meta":["May 2017International Journal of Modern Education and Computer Science 5(5):9-16","DOI:10.5815/ijmecs.2017.05.02"],"references":["300253377_Monitoring_Electronic_Exams","296695773_Implementation_of_Common_Secure_Framework_for_IoT_based_Arduino_Platform","286869830_e-Exams_with_student_owned_devices_Student_voices","273923804_ACCEPTABILITY_OF_COMPUTER_BASED_TESTING_CBT_MODE_FOR_UNDERGRADUATE_COURSES_IN_COMPUTER_SCIENCE","269585074_Challenges_when_introducing_electronic_exam","267793995_DESIGN_AND_IMPLEMENTATION_OF_A_SECURE_CLIENTSERVER_E-EXAMINATIONS_AND_EVALUATION_SYSTEM_FOR_COLLEGES_OF_SCIENCES_STUDENTS","267757881_Redefining_education_for_the_digital_age_a_snapshot_of_the_state_of_play_in_three_Queensland_schools","285576390_Student_experiences_on_taking_electronic_exams_at_the_University_of_Helsinki","271548463_What_security_for_electronic_exams","270542619_Development_of_an_internet-based_exam_system_for_mobile_environments_and_evaluation_of_its_usability"]}