{"id":"316706992_Trends_in_Transportation_Research_Exploring_Content_Analysis_in_Topics","abstract":"Proceedings of journal and conference papers are good sources of big textual data to examine research trends in various branches of science. The contents, usually unstructured in nature, require fast machine-learning algorithms to be deciphered. Exploratory analysis through text mining usually provides the descriptive nature of the contents but lacks quantification of the topics and their correlations. Topic models are algorithms designed to discover the main theme or trend in massive collections of unstructured documents. Through the use of a structural topic model, an extension of latent Dirichlet allocation, this study introduced distinct topic models on the basis of the relative frequencies of the words used in the abstracts of 15,357 TRB compendium papers. With data from 7 years (2008 through 2014) of TRB annual meeting compendium papers, the 20 most dominant topics emerged from a bag of 4 million words. The findings of this study contributed to the understanding of topical trends in the complex and ...","authors":["Subasish Das","Karen Dixon","Xiaoduan Sun","Anandi Dutta"],"meta":["January 2017Transportation Research Record Journal of the Transportation Research Board 2614(1):27-38","DOI:10.3141/2614-04","Project: Coauthor Network Project"],"references":["336919943_stm_An_R_Package_for_Structural_Topic_Models","287206479_A_Probabilistic_Model_for_Bursty_Topic_Discovery_in_Microblogs","283056372_Text_Mining_and_Topic_Modeling_on_Compendium_Papers_from_Transportation_Research_Board_Annual_Meetings","280092392_Leveraging_Social_Context_for_Modeling_Topic_Evolution","277131070_Incorporating_Probabilistic_Knowledge_into_Topic_Models","268037012_Exploiting_Domain_Knowledge_in_Aspect_Extraction","262396233_Leveraging_Multi-Domain_Prior_Knowledge_in_Topic_Models","301756848_Concept_over_Time_the_Combination_of_Probabilistic_Topic_Model_with_Wikipedia_Knowledge","277383777_Text_as_Data_The_Promise_and_Pitfalls_of_Automatic_Content_Analysis_Methods_for_Political_Texts","271436871_Topics_over_time"]}