{"id":"316773172_Do_open_online_projects_create_social_norms","abstract":"While most scholars emphasize the role of prosocial motivations of contributors in building open online communities, we show that mere users also adhere to their norms of behaviour to some extent. To this end we designed an original experimentation protocol. With the help of the French Wikimédia Foundation, we questioned a large sample (n = 13,000) of Wikipedia users (whether contributors or not). They were invited, after having expressing their feelings about Wikipédia, to play a Dictator Game. A large proportion of respondents, including those who were merely users, chose an equal split (66% of the sample). This surprising result suggests that they have adhered to a social norm of sharing. Investigating the determinants of this result, we prove that an involvement measured by usage (intensity and variety), as well as by attachment to, and time spent, on Wikipedia, is correlated with the choice of the 50/50 split in the dictator game (DG). Furthermore, the method of instrumental variables gives an indication that adherence to the social norm of sharing may be endogenously determined by involvement in the open online community. Our result highlights the importance of interactions with the institutional and technical frameworks of the community.","authors":["Godefroy Dang Nguyen","Sylvain Dejean","Nicolas Jullien"],"meta":["May 2017Journal of Institutional Economics 14(1):1-26","DOI:10.1017/S1744137417000182","Project: Voluntary contributions online"],"references":["304461687_Cooperation_in_a_Peer_Production_Economy_Experimental_Evidence_from_Wikipedia","315307196_Cooperation_in_a_Peer_Production_Economy_Experimental_Evidence_from_Wikipedia","314884371_Identifying_Social_Norms_using_Coordination_Games_Why_Does_Dictator_Game_Sharing_Vary","314431270_Ideological_Segregation_Among_Online_Collaborators_Evidence_from_Wikipedians","313129837_The_Strategy_of_Conflict","309760746_Institutional_Economics","309201330_Institutional_economics","306019444_Institutional_entrepreneurship_wikipedia_and_the_opportunity_of_the_commons","281537988_The_Evolution_of_Social_Norms","281453202_Economics_and_Identity"]}