{"id":"316709354_The_Role_of_Gender_in_Students'_Ratings_of_Teaching_Quality_in_Computer_Science_and_Environmental_Engineering","abstract":"Students' ratings of teaching quality on course units in a computer science program and an environmental engineering program at a large Swedish university were obtained using the Course Experience Questionnaire; 8888 sets of ratings were obtained from men and 4280 sets were obtained from women over ten academic years. These student ratings from the two programs showed certain differences; in particular, teachers tended to receive higher ratings in subjects that were less typical for their gender than in subjects that were more typical for their gender. There were differences in the ratings given to male and female teachers, differences in the ratings given by male and female students, and interactions between these two effects. There was no systematic trend for students to give different ratings to teachers of the same gender as themselves than to teachers of the other gender. Nevertheless, without exception, even the statistically significant effects were small in magnitude and unlikely to be of theoretical or practical importance. It is concluded that the causes of differences in the career progression of male and female teachers in engineering education need to be sought elsewhere.","authors":["Linda Price","Ingrid Svensson","Jonas Borell","John T. E. Richardson"],"meta":["May 2017IEEE Transactions on Education PP(99):1-7","DOI:10.1109/TE.2017.2696904"],"references":["258122968_Learning_Analytics_Ethical_Issues_and_Dilemmas","323424582_Statistical_power_analysis_for_the_behavioral_sciences","309965048_Gender_Biases_in_Student_Evaluations_of_Teaching","309628695_Measuring_and_Enhancing_the_Student_Experience","290923367_Gender_Differences_in_Human_Cognition","281980088_Hot_or_not_The_role_of_instructor_quality_and_gender_on_the_formation_of_positive_illusions_among_students_using_RateMyProfessorscom","272487622_Gender_Equity_in_Science_and_Engineering_Advancing_Change_in_Higher_Education","271790085_Student_Evaluations_of_Teachers_An_Examination_of_the_Effect_of_Sex_and_Field_of_Study","257665099_Why_they_leave_The_impact_of_stereotype_threat_on_the_attrition_of_women_and_minorities_from_science_math_and_engineering_majors","249172057_Sex_of_Student_and_Instructor_A_Study_of_Student_Bias"]}