{"id":"316736472_Hardware_demonstration_of_stochastic_p-bits_for_invertible_logic","abstract":"The common feature of nearly all logic and memory devices is that they make use of stable units to represent 0's and 1's. A completely different paradigm is based on three-terminal stochastic units which could be called \"p-bits\", where the output is a random telegraphic signal continuously fluctuating between 0 and 1 with a tunable mean. p-bits can be interconnected to receive weighted contributions from others in a network, and these weighted contributions can be chosen to not only solve problems of optimization and inference but also to implement precise Boolean functions in an inverted mode. This inverted operation of Boolean gates is particularly striking: They provide inputs consistent to a given output along with unique outputs to a given set of inputs. The existing demonstrations of accurate invertible logic are intriguing, but will these striking properties observed in computer simulations carry over to hardware implementations? This paper uses individual micro controllers to emulate p-bits, and we present results for a 4-bit ripple carry adder with 48 p-bits and a 4-bit multiplier with 46 p-bits working in inverted mode as a factorizer. Our results constitute a first step towards implementing p-bits with nano devices, like stochastic Magnetic Tunnel Junctions.","authors":["Ahmed Zeeshan Pervaiz","Anirudh Ghantasala","Kerem Camsari","Supriyo Datta"],"meta":["May 2017Scientific Reports 7(1)","DOI:10.1038/s41598-017-11011-8"],"references":["318592609_Stochastic_p_-Bits_for_Invertible_Logic","305779384_Intrinsic_optimization_using_stochastic_nanomagnets","313726720_Polynomial-time_solution_of_prime_factorization_and_NP-complete_problems_with_digital_memcomputing_machines","312570690_FPGA-based_Annealing_Processor_for_Ising_Model","310462450_Low_Barrier_Nanomagnets_as_P-bits_for_Spin_Logic","309916695_Computing_architecture_to_perform_approximated_simulated_annealing_for_Ising_models","309327526_VLSI_implementation_of_deep_neural_networks_using_integral_stochastic_computing","308590488_Analog-to-stochastic_converter_using_magnetic_tunnel_junction_devices_for_vision_chips","304824892_Size_and_voltage_dependence_of_effective_anisotropy_in_sub-100-nm_perpendicular_magnetic_tunnel_junctions","304470615_Spintronic_Nanodevices_for_Bioinspired_Computing"]}