{"id":"316701704_Enterprise_Resource_Planning_ERP_System_as_an_Innovative_Technology_in_Higher_Education_Context_in_Egypt","abstract":"The global adoption of ERP Systems in Higher Education Institutions (HEIs) has improved substantially over the past decade. Although this demand continues to grow, with HEIs now a chief target market for ERP vendors, a few studies have been published on the topic. This paper reports a sub-study of a larger research effort that leads to contribute to understanding the phenomenon of ERP adoption in Egyptian HEIs. The educational ERP of business activities in higher education goes through different modules. ERP in higher education should respond the real requirements of the education system. Enhancements or mere adaptations of legacy solutions, which stemmed from the experience in business practice, are not always successful. The current paper shows the contents of the ERP system that serve the education system successfully and describes the ERP system as an innovative technology for better higher education and hence invite Egyptian HEIs to adopt these systems. Enterprise Resource Planning systems have emerged as solutions oriented to effectively manage organization´s resources. They allowed the automation of its department's activities, making information accessible to users as needed, supporting more accurately their decision-making needs. Furthermore, the implementation of these systems has brought significant benefits to users and organizations.","authors":["Mohamed Soliman Mohamed Soliman","Noorliza Karia"],"meta":["November 2015","Project: ERP systems in Higher education (Pre-Implementation stage)"],"references":["341135734_One_ERP_system_for_twenty_five_universities_An_empirical_investigation_for_development_ERP_private_cloud_Kingdom_of_Saudi_Arabia_universities_case","325498877_ERP_Systems_in_the_Higher_Education_Sector_A_Descriptive_Case_Study","283954101_ERP_Systems_Functionalities_in_Higher_Education","277163171_Implications_of_Enterprise_Resource_Planning_Systems_for_Universities_An_Analysis_of_Benefits_and_Risks","273575189_Analysis_of_the_Critical_Success_Factors_for_Enterprise_Resource_Planning_Implementation_from_Stakeholders'_Perspective_A_Systematic_Review","264418854_The_Impact_of_E-Learning_on_Egyptian_Higher_Education_and_its_effect_on_Learner's_motivation_A_Case_Study","262402072_The_Romanian_universities_in_the_process_of_data_and_information_system_integration","280016921_Enterprise_resource_planning_survey_of_US_manufacturing_firms","275313301_Does_the_organizational_culture_act_as_a_moderator_in_Indian_enterprise_resource_planning_ERP_projects_An_empirical_study","264275239_The_Influence_of_Organizational_Trust_and_Organizational_Mindfulness_on_ERP_System_Usage"]}