{"id":"316702619_An_Integrative_Approach_to_Analyze_Eeg_Signals_and_Human_Brain_Dynamics_in_Different_Cognitive_States","abstract":"Electroencephalograph (EEG) data provide insight into the interconnections and relationships between various cognitive states and their corresponding brain dynamics, by demonstrating dynamic connections between brain regions at different frequency bands. While sensory input tends to stimulate neural activity in different frequency bands, peaceful states of being and self-induced meditation tend to produce activity in the mid-range (Alpha). These studies were conducted with the aim of: (a) testing different equipment in order to assess two (2) different EEG technologies together with their benefits and limitations and (b) having an initial impression of different brain states associated with different experimental modalities and tasks, by analyzing the spatial and temporal power spectrum and applying our movie making methodology to engage in qualitative exploration via the art of encephalography. This study complements our previous study of measuring multichannel EEG brain dynamics using MINDO48 equipment associated with three experimental modalities measured both in the laboratory and the natural environment. Together with Hilbert analysis, we conjecture, the results will provide us with the tools to engage in more complex brain dynamics and mental states, such as Meditation, Mathematical Audio Lectures, Music Induced Meditation, and Mental Arithmetic Exercises. This paper focuses on open eye and closed eye conditions, as well as meditation states in laboratory conditions. We assess similarities and differences between experimental modalities and their associated brain states as well as differences between the different tools for analysis and equipment.","authors":["Jeffery Jonathan Joshua Davis","Chin-Teng Lin","Grant Gillett","Robert Kozma"],"meta":["October 2017Journal of Artificial Intelligence and Soft Computing Research 7(4)","DOI:10.1515/jaiscr-2017-0020"],"references":["309773130_Spatio-temporal_EEG_pattern_extraction_using_high-density_scalp_arrays","286008112_Phase_cone_detection_optimization_in_EEG_data","282496070_The_Art_of_Encephalography_to_Understand_and_Discriminate_Higher_Cognitive_Functions_Visualizing_Big_Data_on_Brain_Imaging_Using_Brain_Dynamics_Movies","279826172_Revisiting_Brentano_on_Consciousness_Striking_Correlations_with_Electrocorticogram_Findings_about_the_Action-Perception_Cycle_and_the_Emergence_of_Knowledge_and_Meaning","272146777_Synchronized_Minima_in_ECoG_Power_at_Frequencies_Between_Beta-Gamma_Oscillations_Disclose_Cortical_Singularities_in_Cognition","271462897_Neurophysiological_evidence_of_the_cognitive_cycle_and_the_emergence_of_awareness","286595465_Sensitivity_analysis_of_Hilbert_transform_with_band-pass_FIR_filters_for_robust_brain_computer_interface","285948323_Imaging_brain_function_with_EEG_Advanced_temporal_and_spatial_analysis_of_electroencephalographic_signals","277003642_Spiking_neural_network_methodology_for_modelling_classification_and_understanding_of_EEG_spatio-temporal_data_measuring_cognitive_processes","261506659_Creation_of_knowledge_meaning_manifested_via_cortical_singularities_in_cognition_Towards_a_methodology_to_understand_intentionality_and_critical_behavior_in_neural_correlates_of_awareness"]}