{"id":"316736456_A_Survey_of_Shortest-Path_Algorithms","abstract":"A shortest-path algorithm finds a path containing the minimal cost between two vertices in a graph. A plethora of shortest-path algorithms is studied in the literature that span across multiple disciplines. This paper presents a survey of shortest-path algorithms based on a taxonomy that is introduced in the paper. One dimension of this taxonomy is the various flavors of the shortest-path problem. There is no one general algorithm that is capable of solving all variants of the shortest-path problem due to the space and time complexities associated with each algorithm. Other important dimensions of the taxonomy include whether the shortest-path algorithm operates over a static or a dynamic graph, whether the shortest-path algorithm produces exact or approximate answers, and whether the objective of the shortest-path algorithm is to achieve time-dependence or is to only be goal directed. This survey studies and classifies shortest-path algorithms according to the proposed taxonomy. The survey also presents the challenges and proposed solutions associated with each category in the taxonomy.","authors":["Amgad Madkour","Walid G. Aref","Faizan Ur Rehman","Abdur Rahman"],"meta":["May 2017"],"references":["313563586_A_faster_algorithm_for_the_all-pairs_shortest_path_problem_and_its_application","312980063_On_a_routing_problem","310822857_Algorithms_for_Hub_Label_Optimization","306123682_Reach-based_routing_A_new_approach_to_shortest_path_algorithms_optimized_for_road_networks","301706528_Maintaining_Shortest_Paths_Under_Deletions_in_Weighted_Directed_Graphs","299204876_Efficient_algorithms_for_shortest_path_queries_in_planar_digraphs","284504600_A_Subquadratic-Time_Algorithm_for_Decremental_Single-Source_Shortest_Paths","282709150_Improved_shortest_paths_on_the_word_RAM_27th_Colloquium_on_Automata_Languages_and_Programming","266941456_Dynamic_programming_Foundations_and_principles_2nd_ed","266226681_Improved_algorithm_for_all_pairs_shortest_paths"]}