{"id":"316716066_Semantic_Web_for_Cultural_Heritage_Valorisation","abstract":"Cultural heritage consists of heterogeneous resources: archaeological artefacts, monuments, sites, landscapes, paintings, photos, books and expressions of human creativity, often enjoyed in different forms: tangible, intangible or digital. Each resource is usually documented, conserved and managed by cultural institutes like museums, libraries or holders of archives. These institutes make available a detailed description of the objects as catalog records. In this context, the chapter proposes both a classification of cultural heritage data types and a process for cultural heritage valorisation through the well-known Linked Open Data paradigm. The classification and process have been defined in the context of a collaboration between the Semantic Technology Laboratory of the National Research Council (STLab) and the Italian Ministry of Cultural Heritage and Activities and Tourism (MIBACT) that the chapter describes, although we claim they are sufficiently general to be adopted in every cultural heritage scenario. In particular, the chapter introduces both a suite of ontology modules named Cultural-ON to model the principal elements identified in the cultural heritage data type classification, and the process we employed for data valorisation purposes. To this end, semantic technologies are exploited; that is, technologies that allow us to conceptualise and describe the meaning of data forming the cultural heritage and including such entities as places, institutions, cultural heritage events, availability, etc. These entities have special characteristics and are connected with each other in a profound way. The result is a knowledge base consisting of semantic interconnections with also other data available in the Web to be exploited according to different tasks and users preferences. By navigating the semantic relationships between the various objects of the knowledge base, new semantic paths can be revealed and utilised with the aim to develop innovative services and applications. The process is compliant with Linked Open Data and W3C Semantic Web best practices so that to enable a wider promotion of cultural heritage, and of sharing and reuse of cultural heritage data in the Web. The chapter concludes presenting a number of methodological principles and lessons learnt from the STLab/MIBACT collaboration that are applicable to any cultural heritage context and, in some cases, also to other domains.","authors":["Giorgia Lodi","Luigi Asprino","Andrea Giovanni Nuzzolese","Valentina Presutti"],"meta":["May 2017","DOI:10.1007/978-3-319-54499-1_1","In book: Data Analytics in Digital Humanities (pp.3-37)"],"references":["286405649_Amsterdam_Museum_Linked_Open_Data","262281475_Ontology_Testing_-_Methodology_and_Tool","259162856_SMARTMUSEUM_a_mobile_recommender_system_for_the_web_of_data","256797833_Tools_for_the_Automatic_Generation_of_Ontology_Documentation_A_Task-Based_Evaluation","227215903_Ontology_Design_Patterns","226486547_Semantic_Portals_for_Cultural_Heritage","221630944_Mobile_Cultural_Heritage_Guide_Location-Aware_Semantic_Search","221261024_Interactive_User_Modeling_for_Personalized_Access_to_Museum_Collections_The_Rijksmuseum_Case_Study","221144133_Crowdsourcing_in_the_cultural_heritage_domain_Opportunities_and_challenges","2653385_The_Role_of_Competency_Questions_in_Enterprise_Engineering","326432624_Semantic_Annotation_and_Search_of_Cultural-Heritage_Collections_The_Multimedian_E-Culture_Demonstrator","290763044_Europeana_Linked_Open_Data_-_dataeuropeanaeu","283781970_The_NeOn_Methodology_framework_Ascenario-based_methodology_for_ontologydevelopment","259548169_From_Tagging_to_Theorizing_Deepening_Engagement_with_Cultural_Heritage_through_Crowdsourcing","222575940_Semantic_annotation_and_search_of_cultural-heritage_collections_The_MultimediaN_E-Culture_demonstrator","221630818_Experimenting_with_eXtreme_Design","220605375_The_CIDOC_Conceptual_Reference_Module_An_Ontological_Approach_to_Semantic_Interoperability_of_Metadata","42387502_Achieving_Maturity_the_State_of_Practice_in_Ontology_Engineering_in_2009"]}