{"id":"316799527_Self-Sufficiency_of_an_Autonomous_Reconfigurable_Modular_Robotic_Organism","abstract":"In recent years, getting inspiration from simple but complex biological organisms, several advances have been seen in autonomous systems to mimic different behaviors that emerge from the interactions of a large group of simple individuals with each other and with the environment. Among several open issues a significantly important issue, not addressed so far, is the self-sufficiency, or in other words, the energetic autonomy of a modular robotic organism. This feature plays a pivotal role in maintaining a robotic organism's autonomy for a longer period of time. \nTo address the challenges of self-sufficiency, a novel dynamic power management system (PMS) with fault tolerant energy sharing is proposed, realized in the form of hardware and software, and tested. The innate fault tolerant feature of the proposed PMS ensures power sharing in an organism despite docked faulty robotic modules. Due to the unavailability of sufficient number of real robotic modules a simulation framework called Replicator Power Flow Simulator is devised for the implementation of application software layer power management components. The simulation framework was especially devised because at the time of writing this work no simulation tool was available that could be used to perform power sharing and fault tolerance experiments at an organism level. The simulation experiments showed that the proposed application software layer dynamic power sharing policies in combination with the distributed fault tolerance feature in addition to self-sufficiency are expected to enhance the robustness and stability of a real modular robotic organism under varying conditions. \nInspiriert von einfachen aber komplexen biologischen Organismen wurden in den letzten Jahren verschiedenste autonome Systeme entwickelt, welche die Verhaltensweisen einer grosen Gruppe einfacher Individuen nachahmen. Das zentrale und bis heute ungeloste Problem dieser Organismen ist deren autonome Energieversorgung.\nZur Sicherstellung der Energieversorgung eines aus mehreren Robotern zusammengesetzten Organismus wurde in dieser Arbeit ein neuartiges Power-Management-System (PMS) konzipiert, aufgebaut und an einzelnen Robotermodulen und einem Roboterorganismus getestet. Die Hardware eines bestehenden Roboters wurde um ein neues Konzept erweitert, das auch bei fehlerhaften Robotermodulen einen Energieaustausch sicherstellt und so zu einer erhohten Robustheit des PMS fuhren soll. Das entwickelte PMS wurde in modulare Roboter integriert und beispielhaft anhand eines Roboterorganismus getestet. In Ermangelung einer ausreichenden Anzahl von Robotermodulen wurde eine Simulationsumgebung entwickelt und die Software des PMS im Simulationsprogramm, anstatt im Roboter, implementiert. Dieses Simulationswerkzeug ist momentan das Einzige, das unter Berucksichtigung des Bewegungsmodells des Organismus den Energietransport im Roboterorganismus visuell darstellt und das Verhalten in verschiedenen Fehlerfallen simulieren kann. Die Simulationen und Messungen zeigen, dass das entwickelte PMS geeignet ist, die Energieversorgung von Roboterorganismen auch in Fehlerfallen sicherzustellen und so die Stabilitat und Robustheit zu erhohen.","authors":["Raja Humza Qadir"],"meta":["January 2015","DOI:10.1007/978-3-319-10289-4","ISBN: 978-3-319-10288-7"],"references":[]}