{"id":"316776587_Large-scale_3D_EM_modeling_with_a_Block_Low-Rank_multifrontal_direct_solver","abstract":"We put forward the idea of using a Block Low-Rank (BLR) multifrontal direct solver to efficiently solve the linear systems of equations arising from a finite-difference discretization of the frequency-domain Maxwell equations for 3D electromagnetic (EM) problems. The solver uses a low-rank representation for the off-diagonal blocks of the intermediate dense matrices arising in the multifrontal method to reduce the computational load. A numerical threshold, the so-called BLR threshold, controlling the accuracy of low-rank representations was optimized by balancing errors in the computed EM fields against savings in floating point operations (flops). Simulations were carried out over large-scale 3D resistivity models representing typical scenarios for marine controlled-source EM surveys, and in particular the SEG SEAM model which contains an irregular salt body. The flop count, size of factor matrices and elapsed run time for matrix factorization are reduced dramatically by using BLR representations and can go down to, respectively, 10, 30 and 40 per cent of their full-rank values for our largest system with N = 20.6 million unknowns. The reductions are almost independent of the number of MPI tasks and threads at least up to 90 × 10 = 900 cores. The BLR savings increase for larger systems, which reduces the factorization flop complexity from O(N^2) for the full-rank solver to O(N^m) with m = 1.4–1.6. The BLR savings are significantly larger for deep-water environments that exclude the highly resistive air layer from the computational domain. A study in a scenario where simulations are required at multiple source locations shows that the BLR solver can become competitive in comparison to iterative solvers as an engine for 3-D controlled-source electromagnetic Gauss–Newton inversion that requires forward modelling for a few thousand right-hand sides.","authors":["Daniel V. Shantsev","Piyoosh Jaysaval","Sebastien de la Kethulle de Ryhove","Patrick Amestoy"],"meta":["March 2017Geophysical Journal International 209:1558–1571","DOI:10.1093/gji/ggx106","Project: MUMPS solver"],"references":["310845395_Fast_3D_frequency-domain_full_waveform_inversion_with_a_parallel_Block_Low-Rank_multifrontal_direct_solver_application_to_OBC_data_from_the_North_Sea","308388169_Fully_anisotropic_3-D_EM_modelling_on_a_Lebedev_grid_with_a_multigrid_preconditioner","299470177_High-order_optimization_methods_for_large-scale_3D_CSEM_data_inversion","291420521_Evaluation_of_parallel_direct_sparse_linear_solvers_in_electromagnetic_geophysical_problems","283564162_Efficient_3-D_controlled-source_electromagnetic_modelling_using_an_exponential_finite-difference_method","271642990_Fast_multimodel_finite-difference_controlled-source_electromagnetic_simulations_based_on_a_Schur_complement_approach","319379186_On_the_Complexity_of_the_Block_Low-Rank_Multifrontal_Factorization","276942415_Remote_sensing_of_hydrocarbon_layers_by_seabed_logging_SBL_Results_from_a_cruise_offshore_Angola","274080849_Improving_Multifrontal_Methods_by_Means_of_Block_Low-Rank_Representations","270641562_Seam_update_Models_for_EM_and_gravity_simulations"]}