{"id":"316737181_Tissue_growth_pressure_drives_early_blood_flow_in_the_chicken_yolk_sac","abstract":"Background: \nUnderstanding how molecular and physical cues orchestrate vascular morphogenesis is a challenge for developmental biology. Only little attention has been paid to the impact of mechanical stress caused by tissue growth on early blood distribution. Here we study the peripheral accumulation of blood in the chicken embryonic yolk sac, which precedes sinus vein formation.\n\nResults: \nWe report that blood accumulation starts before heart-induced blood circulation. We hypothesized that the driving force for the primitive blood flow is a growth-induced gradient of tissue pressure in the yolk sac mesoderm. Therefore, we studied embryos in which heart development was arrested after 2 days of incubation, and found that yolk sac growth and blood peripheral accumulation still occurred. This suggests that tissue growth is sufficient to initiate the flow and the formation of the sinus vein, whereas heart contractions are not required. We designed a simple mathematical model which makes explicit the growth-induced pressure gradient and the subsequent blood accumulation, and show that growth can indeed account for the observed blood accumulation.\n\nConclusions: \nThis study shows that tissue growth pressure can drive early blood flow, and suggests that the mechanical environment, beyond hemodynamics, can contribute to vascular morphogenesis. Developmental Dynamics 246:573-584, 2017. © 2017 Wiley Periodicals, Inc.","authors":["Raphaël Clément","Benjamin Mauroy","Annemiek J M Cornelissen"],"meta":["May 2017Developmental Dynamics 246(8)","DOI:10.1002/dvdy.24516","Project: Evolution of the blood network"],"references":["312144548_Active_dynamics_of_tissue_shear_flow","265393828_Corrigendum_Vascular_development_and_hemodynamic_force_in_the_mouse_yolk_sac","263550554_Stretch-induced_Intussuceptive_and_Sprouting_Angiogenesis_in_the_Chick_Chorioallantoic_Membrane","260485282_Apical_constriction_drives_tissue-scale_hydrodynamic_ow_to_mediate_cell_elongation","259808617_An_archetypal_mechanism_for_branching_organogenesis","313499008_A_series_of_normal_stages_in_the_development_of_the_chick","312992779_Studies_on_the_origin_of_blood_vessels_and_of_red_blood_corpuscules_as_seen_in_the_living_blastoderm_of_chicks_during_the_second_day_of_incubation","312894771_A_series_of_normal_stages_in_the_development_of_lateral_motor_column_of_the_chick_embryo","271206241_Imagej","270248723_The_Avian_Embryo_Structural_and_Functional_Development"]}