{"id":"316779632_Citation_sentence_reuse_behavior_of_scientists_A_case_study_on_massive_bibliographic_text_dataset_of_computer_science","abstract":"Our current knowledge of scholarly plagiarism is largely based on the similarity between full text research articles. In this paper, we propose an innovative and novel conceptualization of scholarly plagiarism in the form of reuse of explicit citation sentences in scientific research articles. Note that while full-text plagiarism is an indicator of a gross-level behavior, copying of citation sentences is a more nuanced micro-scale phenomenon observed even for well-known researchers. The current work poses several interesting questions and attempts to answer them by empirically investigating a large bibliographic text dataset from computer science containing millions of lines of citation sentences. In particular, we report evidences of massive copying behavior. We also present several striking real examples throughout the paper to showcase widespread adoption of this undesirable practice. In contrast to the popular perception, we find that copying tendency increases as an author matures. The copying behavior is reported to exist in all fields of computer science; however, the theoretical fields indicate more copying than the applied fields.","authors":["Mayank Singh","Abhishek Niranjan","Divyansh Gupta","Nikhil Angad Bakshi"],"meta":["May 2017"],"references":["308412564_OCR_A_Robust_Framework_For_Information_Extraction_from_Scholarly_Articles","280933037_The_Role_Of_Citation_Context_In_Predicting_Long-Term_Citation_Profiles_An_Experimental_Study_Based_On_A_Massive_Bibliographic_Text_Dataset","227360540_Plagiarism_Bringing_Economics_and_Education_Together_With_a_Little_Help_from_IT","316928083_Copy_Detection_Mechanisms_for_Digital_Documents","270271383_Towards_a_Stratified_Learning_Approach_to_Predict_Future_Citation_Counts","270003942_How_many_scientific_papers_are_not_original","269339524_Patterns_of_Text_Reuse_in_a_Scientific_Corpus","254343195_Race_Work_The_Rise_of_Civil_Rights_in_the_Urban_West","249984337_A_Survey_on_Natural_Language_Text_Copy_Detection","234825122_Copy_detection_mechanisms_for_digital_documents"]}