{"id":"316782762_Strategies_for_improved_isopropanol-butanol_production_by_a_Clostridium_strain_from_glucose_and_hemicellulose_through_consolidated_bioprocessing","abstract":"Background\nHigh cost of traditional substrates and formation of by-products (such as acetone and ethanol) in acetone–butanol–ethanol (ABE) fermentation hindered the large-scale production of biobutanol. Here, we comprehensively characterized a newly isolated solventogenic and xylanolytic Clostridium species, which could produce butanol at a high ratio with elimination of ethanol and conversion of acetone to more value-added product, isopropanol. Ultimately, direct butanol production from hemicellulose was achieved with efficient expression of indigenous xylanase by the novel strain via consolidated bioprocessing.\n\nResults\nA novel wild-type Clostridium sp. strain NJP7 was isolated and characterized in this study, which was capable of fermenting monosaccharides, e.g., glucose into butanol via a fermentative acetone–isopropanol–butanol pathway. With enhancement of buffering capacity and alcohol dehydrogenase activities, butanol and isopropanol titer by Clostridium sp. strain NJP7 was improved to 12.21 and 1.92 g/L, respectively, and solvent productivity could be enhanced to 0.44 g/L/h. Furthermore, with in situ extraction with biodiesel, the amount of butanol and isopropanol was finally improved to 25.58 and 5.25 g/L in the fed-batch mode. Meanwhile, Clostridium sp. strain NJP7 shows capability of direct isopropanol–butanol production from hemicelluloses with expression of indigenous xylanase. 2.06 g/L of butanol and 0.54 g/L of isopropanol were finally achieved through the temperature-shift simultaneous saccharification and fermentation, representing the highest butanol production directly from hemicellulose.\n\nConclusion\nThe co-production of isopropanol with butanol by the newly isolated Clostridium sp. strain NJP7 would add on the economical values for butanol fermentation. Furthermore, the high isopropanol-butanol production with in situ extraction would also greatly enhance the economic feasibility for fermentative production of butanol–isopropanol in large scale. Meanwhile, its direct production of butanol–isopropanol from polysaccharides, hemicellulose through secretion of indigenous thermostable xylanase, shows great potential using lignocellulosic wastes for biofuel production.","authors":["Fengxue Xin","Tianpeng Chen","Yujia Jiang","Dong Weiliang"],"meta":["May 2017Biotechnology for Biofuels 10(1)","DOI:10.1186/s13068-017-0805-1","Projects: Metabolic EngineeringBiofuels"],"references":["309665850_Comprehensive_investigations_of_biobutanol_production_by_a_non-acetone_and_13-propanediol_generating_Clostridium_strain_from_glycerol_and_polysaccharides","284701616_MEGA3_Integrated_software_for_Molecular_Evolutionary_Genetics_Analysis_and_sequence_alignment","322103486_ABE_production_from_corn_A_recent_economic_evaluation_and_process_technology","317064072_Metabolic_Engineering_of_Clostridium_cellulolyticum_for_Production_of_Isobutanol_from_Cellulose","312950530_Use_of_Dinitrosalicylic_Acid_Reagent_for_Determination_of_Reducing_Sugar","286215327_The_Neighbor-Joining_Method_A_New_Method_for_Reconstructing_Phylogenetic_Trees","281852638_Metabolic_and_process_engineering_of_Clostridium_cellulovorans_for_biofuel_production_from_cellulose","281538388_The_Dissimilatory_Sulfate-_and_Sulfur-_Reducing_Bacteria_in_the_Prokaryotes_a_Handbook_on_the_Biology_of_Bacteria","280058441_Consolidated_bioprocessing_of_cellulose_to_isobutanol_using_Clostridium_thermocellum","269176374_Production_of_biofuels_and_biochemicals_by_in_vitro_synthetic_biosystems_OPPORTUNITIES_and_challenges"]}