{"id":"316788927_Scalp_EEG_Activity_During_Simple_and_Combined_Motor_Imageries_to_Control_a_Robotic_Arm","abstract":"In this article, we study how combined motor imageries can be detected to deliver more commands in a Brain-Computer Interface for controlling a robotic arm. Motor imageries are a major way to deliver commands in BCI. Nevertheless only a few systems use more than three motor imageries: right hand, left hand and feet. Combining them allow to get four additional commands. We present an electrophysiological study to show that i) simple motor imageries have mainly an electrical modulation over the cortical area related the body part involved in the imagined movement and that ii) combined motor imageries reflect a superposition of the electrical activity of simple motor imageries. A shrinkage linear discriminant analysis has been used to test as a first step how a resting state and seven motor imageries can be detected. 11 healthy subjects participated in the experiment for which an intuitive assignment has been done to associate motor imageries and movements of the robotic arm with 7 degrees of freedom.","authors":["Cecilia Lindig","Sébastien Rimbert","Oleksii Avilov","Laurent Bougrain"],"meta":["May 2017","DOI:10.1109/UKRCON.2017.8100502","Conference: 2017 IEEE First Ukraine Conference on Electrical and Computer Engineering"],"references":["221757644_An_EEG-based_brain_computer_interface_for_rehabilitation_and_restoration_of_hand_control_following_stroke_using_ipsilateral_cortical_physiology","51969319_Scikit-learn_Machine_Learning_in_Python","43401204_OpenViBE_An_Open-Source_Software_Platform_to_Design_Test_and_Use_Brain-Computer_Interfaces_in_Real_and_Virtual_Environments","293107576_Direct_brain-computer_communication","285833494_Event-related_EEG-MEG_synchronization_and_desynchronization_Basic_principles","256821939_Regularised_Discriminant_Analysis","254286896_Regularized_Discriminant_Analysis","203917760_Optimizing_spatial_filters_for_robust_EEG_single-trial_analysis","26827412_Motor_imagery_influences_the_execution_of_repetitive_finger_opposition_movements","14616719_Mental_Imagery_in_the_Motor_Context"]}