{"id":"316787559_Fog_of_Everything_Energy-Efficient_Networked_Computing_Architectures_Research_Challenges_and_a_Case_Study","abstract":"Fog Computing (FC) and Internet of Everything (IoE) are two emerging technological paradigms that, up to date, have been considered standing-alone. However, due to their complementary features, we expect that their integration can foster a number of computing and network-intensive pervasive applications under the incoming realm of the Future Internet. Motivated by this consideration, the goal of this position paper is fivefold. First, we review the technological attributes and platforms proposed in the current literature for the standing-alone FC and IoE paradigms. Second, by leveraging some use cases as illustrative examples, we point out that the integration of the FC and IoE paradigms may give rise to opportunities for new applications in the realms of the Internet of Energy, Smart City, Industry 4.0 and Big Data Streaming, while, at the same time, introducing new open issues. Third, we propose a novel technological paradigm, the Fog of Everything (FoE) paradigm, that integrates FC and IoE, and, then, we detail the main building blocks and services of the corresponding technological platform and protocol stack. Fourth, as a proof-of-concept, we present the simulated energy-delay performance of a small-scale FoE prototype, namely, the V-FoE prototype. Afterwards, we compare the obtained performance with the corresponding one of a benchmark technological platform, e.g., the V-D2D one. It exploits only Device-to-Device (D2D) links, in order to establish inter-thing \" ad hoc \" communication. Lastly, we point out the position of the proposed FoE paradigm over a spectrum of seemingly related recent research projects.","authors":["Enzo Baccarelli","Paola G Vinueza Naranjo","Mohammad Shojafar","Michele Scarpiniti"],"meta":["May 2017IEEE Access PP(99):2169-3536","DOI:10.1109/ACCESS.2017.2702013","Project: GAUChO: A Green Adaptive Fog Computing and Networking Architecture"],"references":["315665046_Rethinking_the_Internet_of_Things_-_A_Scalable_Approach","312061424_Mobile_Edge_Computing_Survey_and_Research_Outlook","310501247_A_fog_computing_based_smart_grid_model","308871837_Fog_Computing_Architecture_to_Enable_Consumer_Centric_Internet_of_Things_Services","308861149_Fog_Computing_Micro_Datacenter_Based_Dynamic_Resource_Estimation_and_Pricing_Model_for_IoT","308546367_The_IoT_hub_a_fog_node_for_seamless_management_of_heterogeneous_connected_smart_objects","306304122_Scalable_Fog_Computing_with_Service_Offloading_in_Bus_Networks","314259748_Smart_Sustainable_Cities_of_the_Future_An_Extensive_Interdisciplinary_Literature_Review","311665665_Q_Energy_and_delay-efficient_dynamic_queue_management_in_TCPIP_virtualized_data_centers","309201112_The_case_for_VM-based_cloudlets_in_mobile_computing"]}