{"id":"316844417_Centrality_Measures_for_Evacuation_Finding_Agile_Evacuation_Routes","abstract":"In this paper, we study the agility of evacuation routes in relation to dynamically changing unpredictable hazardous conditions in smart space networks. Infrastructure safety conditions may unpredictably change through time. Due to unpredictability, evacuees' safety can get jeopardized at any point of the evacuation route. Thus, it is not sufficient only to find the shortest evacuation routes considering present safety conditions and evacuation flow, but we should also consider other relevant characteristics that make the evacuation routes sufficiently safe through time. With this aim, we propose two new node importance metrics: evacuation betweenness centrality and evacuation centrality, both inspired by betweenness centrality. The first metric represents the fraction of k efficient evacuation routes between all origin-destination pairs different from the given node that pass through that node, while the second represents the importance of the given node for evacuation considering the availability of alternative efficient evacuation paths (routes) from that node towards safe exits. Moreover, given a set of evacuees' positions and safe exits, we find shortest agile evacuation routes, where by agile route we mean the ability to efficiently and safely reroute from intermediate nodes in case of unpredictable safety drops through maximizing the value of the evacuation centrality of the route's intermediate nodes. In addition, we propose an algorithm for that problem and discuss its capability to react to the changes in safety circumstances along recommended routes.","authors":["Marin Lujak","Stefano Giordani"],"meta":["December 2017Future Generation Computer Systems 83","DOI:10.1016/j.future.2017.05.014","Project: Social Modelling of Ambient Intelligence for Large Premises"],"references":["312338417_A_distributed_architecture_for_real-time_evacuation_guidance_in_large_smart_buildings","301820987_On_Avoiding_Panic_by_Pedestrian_Route_Recommendation_in_Smart_Spaces","273458544_Calibration_and_Evaluation_of_Link_Congestion_Functions_Applying_Intrinsic_Sensitivity_of_Link_Speed_as_a_Practical_Consideration_to_Heterogeneous_Facility_Types_Within_Urban_Network","267979739_Fair_route_guidance_Bridging_system_and_user_optimization","267979576_Route_Guidance_Bridging_System_and_User_Optimization_in_Traffic_Assignment","313359759_Evacuation_Modeling_and_Betweenness_Centrality","311959430_Congestion-aware_core_mapping_for_Network-on-Chip_based_systems_using_betweenness_centrality","309905002_A_critical_review_of_centrality_measures_in_social_networks","272956885_New_Object_Detection_Tracking_and_Recognition_Approaches_for_Video_Surveillance_Over_Camera_Network","261052481_Indoor_positioning_A_review_of_indoor_ultrasonic_positioning_systems"]}