{"id":"316896342_Potential_of_a_Northern_Population_of_Aedes_vexans_Diptera_Culicidae_to_Transmit_Zika_Virus","abstract":"Zika virus is an emerging arbovirus of humans in the western hemisphere. With its potential spread into new geographical areas, it is important to define the vector competence of native mosquito species. We tested the vector competency of Aedes vexans (Meigen) from the Lake Agassiz Plain of northwestern Minnesota and northeastern North Dakota. Aedes aegypti (L.) was used as a positive control for comparison. Mosquitoes were fed blood containing Zika virus and 2 wk later were tested for viral infection and dissemination. Aedes vexans (n = 60) were susceptible to midgut infection (28% infection rate) but displayed a fairly restrictive midgut escape barrier (3% dissemination rate). Cofed Ae. aegypti (n = 22) displayed significantly higher rates of midgut infection (61%) and dissemination (22%). To test virus transmission, mosquitoes were inoculated with virus and 16-17 d later, tested for their ability to transmit virus into fluid-filled capillary tubes. Unexpectedly, the transmission rate was significantly higher for Ae. vexans (34%, n = 47) than for Ae. aegypti (5%, n = 22). The overall transmission potential for Ae. vexans to transmit Zika virus was 1%. Because of its wide geographic distribution, often extreme abundance, and aggressive human biting activity, Ae. vexans could serve as a potential vector for Zika virus in northern latitudes where the conventional vectors, Ae. aegypti and Ae. albopictus Skuse, cannot survive. However, Zika virus is a primate virus and humans are the only amplifying host species in northern latitudes. To serve as a vector of Zika virus, Ae. vexans must feed repeatedly on humans. Defining the propensity of Ae. vexans to feed repeatedly on humans will be key to understanding its role as a potential vector of Zika virus.","authors":["Kyle Odonnell","Mckenzie A Bixby","Kelsey J Morin","David S Bradley"],"meta":["May 2017Journal of Medical Entomology 54(5)","DOI:10.1093/jme/tjx087"],"references":["313592261_Laboratory_strains_of_Aedes_aegypti_are_competent_to_Brazilian_Zika_virus","312665217_Experimental_transmission_of_Zika_virus_by_mosquitoes_from_central_Europe","312092317_Zika_Virus_Infection_as_a_Cause_of_Congenital_Brain_Abnormalities_and_Guillain-Barre_Syndrome_Systematic_Review","309456631_Vector_Competence_of_American_Mosquitoes_for_Three_Strains_of_Zika_Virus","308487589_Vector_Competence_of_French_Polynesian_Aedes_aegypti_and_Aedes_polynesiensis_for_Zika_Virus","308341956_Assessment_of_Local_Mosquito_Species_Incriminates_Aedes_aegypti_as_the_Potential_Vector_of_Zika_Virus_in_Australia","307934613_Experimental_investigation_of_the_susceptibility_of_Italian_Culex_pipiens_mosquitoes_to_Zika_virus_infection","312057472_Sexually_acquired_Zika_virus_A_systematic_review","312026648_Zika_Virus_Vector_Competency_of_Mosquitoes_Gulf_Coast_United_States","311964212_Morphological_studies_on_adult_mosquitoes_Diptera_Culicidae_and_first_report_of_the_potential_Zika_virus_vector_Aedes_Stegomyia_unilineatus_Theobald_1906_in_Iran"]}