{"id":"316860583_Enhancing_process_control_in_industry_40_scenarios_using_Cyber-Physical_systems","abstract":"One of the most interesting applications of Industry 4.0 paradigm is enhanced process control. Traditionally, process control solutions based on Cyber-Physical Systems (CPS) consider a top-down view where processes are represented as executable high-level descriptions. However, most times industrial processes follow a bottom-up model where processes are executed by low-level devices which are hard-programmed with the process to be executed. Thus, high-level components only may supervise the process execution as devices cannot modify dynamically their behavior. Therefore, in this paper we propose a vertical CPS-based solution (including a reference and a functional architecture) adequate to perform enhanced process control in Industry 4.0 scenarios with a bottom-up view. The proposed solution employs an event-driven service-based architecture where control is performed by means of finite state machines. Furthermore, an experimental validation is provided proving that in more than 97% of cases the proposed solution allows a stable and effective control. © 2016, Innovative Information Science and Technology Research Group. All rights reserved.","authors":["Borja Bordel Sánchez","Ramón Alcarria","Diego Sánchez de Rivera","Álvaro Sánchez-Picot"],"meta":["December 2016","Project: SEntiment analysis and EMOtion technoLogies for social empathic Agents in ambient intelligence (applications to manufacturing and CPS)"],"references":["291385881_Implementing_Smart_Factory_of_Industrie_40_An_Outlook","284710995_TF4SM_A_Framework_for_Developing_Traceability_Solutions_in_Small_Manufacturing_Companies","274830069_From_Machine-to-Machine_Communications_towards_Cyber-Physical_Systems","269709304_A_Cyber-Physical_Systems_architecture_for_Industry_40-based_manufacturing_systems","262337285_Review_of_Cyber-Physical_System_in_Healthcare","261987865_Cloud-Based_Industrial_Cyber-Physical_Systems","261960672_Resolving_coordination_challenges_in_distributed_mobile_service_executions","309638952_Physical_Processes_Control_in_Industry_40-Based_Systems_A_Focus_on_Cyber-Physical_Systems","296953256_OPC_unified_architecture_for_industrial_demand_response","266954538_Handbook_of_Pattern_Recognition_and_Computer_Vision"]}