{"id":"316857111_Forwarding_metamorphosis_fast_programmable_match-action_processing_in_hardware_for_SDN","abstract":"In Software Defined Networking (SDN) the control plane is physically separate from the forwarding plane. Control software programs the forwarding plane (e.g., switches and routers) using an open interface, such as OpenFlow. This paper aims to overcomes two limitations in current switching chips and the OpenFlow protocol: i) current hardware switches are quite rigid, allowing ``Match-Action'' processing on only a fixed set of fields, and ii) the OpenFlow specification only defines a limited repertoire of packet processing actions. We propose the RMT (reconfigurable match tables) model, a new RISC-inspired pipelined architecture for switching chips, and we identify the essential minimal set of action primitives to specify how headers are processed in hardware. RMT allows the forwarding plane to be changed in the field without modifying hardware. As in OpenFlow, the programmer can specify multiple match tables of arbitrary width and depth, subject only to an overall resource limit, with each table configurable for matching on arbitrary fields. However, RMT allows the programmer to modify all header fields much more comprehensively than in OpenFlow. Our paper describes the design of a 64 port by 10 Gb/s switch chip implementing the RMT model. Our concrete design demonstrates, contrary to concerns within the community, that flexible OpenFlow hardware switch implementations are feasible at almost no additional cost or power.","authors":["Pat Bosshart","Glen Gibb","Hun-Seok Kim","George Varghese"],"meta":["August 2013ACM SIGCOMM Computer Communication Review 43(4):99-110","DOI:10.1145/2534169.2486011","Conference: Proceedings of the ACM SIGCOMM 2013 conference on SIGCOMMVolume: 43"],"references":["235246924_Abstractions_for_Network_Update","225312509_Space_Efficient_Hash_Tables_With_Worst_Case_Constant_Access_Time","221325150_Efficient_IP-address_lookup_with_a_shared_forwarding_table_for_multiple_virtual_routers","221164661_Flexible_Lookup_Modules_for_Rapid_Deployment_of_New_Protocols_in_High-speed_Routers","220617775_More_Robust_Hashing_Cuckoo_Hashing_with_a_Stash","220195143_OpenFlow_Enabling_innovation_in_campus_networks","44795185_RouteBricks_Exploiting_Parallelism_to_Scale_Software_Routers","271452174_PacketShader","262312234_Forwarding_Metamorphosis_Fast_Programmable_Match-Action_Processing_in_Hardware_for_SDN","235246932_Rate_Control_Protocol_RCP_Congestion_control_to_make_flows_complete_quickly","225192927_Parallelism_versus_Memory_Allocation_in_Pipelined_Router_Forwarding_Engines","222796287_Cuckoo_Hashing","221164460_PacketShader_a_GPU-Accelerated_Software_Router","2566473_Efficient_Implementation_of_a_Statistics_Counter_Architecture"]}