{"id":"316848943_An_Overreaction_to_the_Broken_Machine_Learning_Abstraction_The_easeml_Vision","abstract":"After hours of teaching astrophysicists TensorFlow and then see them, nevertheless, continue to struggle in the most creative way possible, we asked, What is the point of all of these efforts?\nIt was a warm winter afternoon, Zurich was not gloomy at all; while Seattle was sunny as usual, and Beijing's air was crystally clear. One of the authors stormed out of a Marathon meeting with biologists, and our journey of overreaction begins. We ask, Can we build a system that gets domain experts completely out of the machine learning loop? Can this system have exactly the same interface as linear regression, the bare minimum requirement of a scientist?\nWe started trial-and-errors and discussions with domain experts, all of whom not only have a great sense of humor but also generously offered to be our \"guinea pigs.\" After months of exploration the architecture of our system, ease.ml, starts to get into shape---It is not as general as TensorFlow but not completely useless; in fact, many applications we are supporting can be built completely with ease.ml, and many others just need some syntax sugars. During development, we find that building ease.ml in the right way raises a series of technical challenges. In this paper, we describe our ease.ml vision, discuss each of these technical challenges, and map out our research agenda for the months and years to come.","authors":["Ce Zhang","Wentao Wu","Tian Li"],"meta":["May 2017","DOI:10.1145/3077257.3077265","Conference: the 2nd Workshop","Project: Machine Learning Systems"],"references":["319597755_MLog_towards_declarative_in-database_machine_learning","220431863_Deciding_equivalences_among_conjunctive_aggregate_queries","2799029_Rigorous_Learning_Curve_Bounds_from_Statistical_Mechanics","312712412_Generative_Adversarial_Networks_recover_features_in_astrophysical_images_of_galaxies_beyond_the_deconvolution_limit","300581358_Learning_Generalized_Linear_Models_Over_Normalized_Data","269935079_Adam_A_Method_for_Stochastic_Optimization","221620421_Learning_Curves_Asymptotic_Values_and_Rate_of_Convergence"]}