{"id":"316848633_ZipG_A_Memory-efficient_Graph_Store_for_Interactive_Queries","abstract":"We present ZipG, a distributed memory-efficient graph store for serving interactive graph queries. ZipG achieves memory efficiency by storing the input graph data using a compressed representation. What differentiates ZipG from other graph stores is its ability to execute a wide range of graph queries directly on this compressed representation. ZipG can thus execute a larger fraction of queries in main memory, achieving query interactivity. ZipG exposes a minimal API that is functionally rich enough to implement published functionalities from several industrial graph stores. We demonstrate this by implementing and evaluating graph queries from Facebook TAO, LinkBench, Graph Search and several other workloads on top of ZipG. On a single server with 244GB memory, ZipG executes tens of thousands of queries from these workloads for raw graph data over half a TB; this leads to an order of magnitude (sometimes as much as 23×) higher throughput than Neo4j and Titan. We get similar gains in distributed settings compared to Titan.","authors":["Anurag Khandelwal","Zongheng Yang","Evan Ye","Rachit Agarwal"],"meta":["May 2017","DOI:10.1145/3035918.3064012","Conference: the 2017 ACM International Conference","Project: Succinct"],"references":["300590463_The_LDBC_Social_Network_Benchmark","310824794_Scalable_Pattern_Matching_over_Compressed_Graphs_via_Dedensification","305263111_A_graphical_query_language_supporting_recursion","303918385_Graphx_Graph_processing_in_a_distributed_dataflow_framework","303896772_Generating_Flexible_Workloads_for_Graph_Databases","283556990_Smaller_and_Faster_Parallel_Processing_of_Compressed_Graphs_with_Ligra","282310530_Weaver_A_High-Performance_Transactional_Graph_Store_Based_on_Refinable_Timestamps","266653731_Querying_graph_databases","262322741_GraphChi_large-scale_graph_computation_on_just_a_PC","262271772_Distributed_Large-scale_Natural_Graph_Factorization"]}