{"id":"316817678_Lightweight_Data_Aggregation_Scheme_against_Internal_Attackers_in_Smart_Grid_Using_Elliptic_Curve_Cryptography","abstract":"Recent advances of Internet and microelectronics technologies have led to the concept of smart grid which has been a widespread concern for industry, governments, and academia. The openness of communications in the smart grid environment makes the system vulnerable to different types of attacks. The implementation of secure communication and the protection of consumers’ privacy have become challenging issues. The data aggregation scheme is an important technique for preserving consumers’ privacy because it can stop the leakage of a specific consumer’s data. To satisfy the security requirements of practical applications, a lot of data aggregation schemes were presented over the last several years. However, most of them suffer from security weaknesses or have poor performances. To reduce computation cost and achieve better security, we construct a lightweight data aggregation scheme against internal attackers in the smart grid environment using Elliptic Curve Cryptography (ECC). Security analysis of our proposed approach shows that it is provably secure and can provide confidentiality, authentication, and integrity. Performance analysis of the proposed scheme demonstrates that both computation and communication costs of the proposed scheme are much lower than the three previous schemes. As a result of these aforementioned benefits, the proposed lightweight data aggregation scheme is more practical for deployment in the smart grid environment.","authors":["Debiao He","Sherali Zeadally","Huaqun Wang","Qin Liu"],"meta":["May 2017Wireless Communications and Mobile Computing 2017:1-11","DOI:10.1155/2017/3194845"],"references":["324452142_NIST_Framework_and_Roadmap_for_Smart_Grid_Interoperability_Standards_Release_30","290427277_A_Key_Management_Scheme_for_Secure_Communications_of_Information_Centric_Advanced_Metering_Infrastructure_in_Smart_Grid","288179824_Authentication_and_Authorization_Scheme_for_Various_User-Roles_and_Devices_in_Smart_Grid","316072195_Elliptic_Curve_Cryptosystems","305719390_Toward_Efficient_Multi-Keyword_Fuzzy_Search_Over_Encrypted_Outsourced_Data_With_Accuracy_Improvement","303956198_Lightweight_Anonymous_Key_Distribution_Scheme_for_Smart_Grid_using_Elliptic_Curve_Cryptography","303783232_Evaluating_2-_DNF_Formulas_on_Ciphertexts","301599643_Anonymous_Authentication_for_Wireless_Body_Area_Networks_With_Provable_Security","286490513_Enabling_Personalized_Search_over_Encrypted_Outsourced_Data_with_Efficiency_Improvement","285481005_New_Publicly_Verifiable_Databases_with_Efficient_Updates"]}