{"id":"316851400_A_Survey_on_an_Energy-Efficient_and_Energy-Balanced_Routing_Protocol_for_Wireless_Sensor_Networks","abstract":"Wireless sensor networks (WSNs) form an important part of industrial application. There has been growing interest in the potential use of WSNs in applications such as environment monitoring, disaster management, health care monitoring, intelligence surveillance and defence reconnaissance. In these applications, the sensor nodes (SNs) are envisaged to be deployed in sizeable numbers in an outlying area, and it is quite difficult to replace these SNs after complete deployment in many scenarios. Therefore, as SNs are predominantly battery powered devices, the energy consumption of the nodes must be properly managed in order to prolong the network lifetime and functionality to a rational time. Different energy-efficient and energy-balanced routing protocols have been proposed in literature over the years. The energy-efficient routing protocols strive to increase the network lifetime by minimizing the energy consumption in each SN. On the other hand, the energy-balanced routing protocols protract the network lifetime by uniformly balancing the energy consumption among the nodes in the network. There have been various survey papers put forward by researchers to review the performance and classify the different energy-efficient routing protocols for WSNs. However, there seems to be no clear survey emphasizing the importance, concepts, and principles of load-balanced energy routing protocols for WSNs. In this paper, we provide a clear picture of both the energy-efficient and energy-balanced routing protocols for WSNs. More importantly, this paper presents an extensive survey of the different state-of-the-art energy-efficient and energy-balanced routing protocols. A taxonomy is introduced in this paper to classify the surveyed energy-efficient and energy-balanced routing protocols based on their proposed mode of communication towards the base station (BS). In addition, we classified these routing protocols based on the solution types or algorithms, and the input decision variables defined in the routing algorithm. The strengths and weaknesses of the choice of the decision variables used in the design of these energy-efficient and energy-balanced routing protocols are emphasised. Finally, we suggest possible research directions in order to optimize the energy consumption in sensor networks.","authors":["Olayinka O Ogundile","Attahiru S. Alfa"],"meta":["May 2017Sensors 17(5):1084","DOI:10.3390/s17051084"],"references":["312818310_Prolonging_the_lifetime_of_wireless_sensor_networks_via_unequal_clustering","319477641_EDAL_An_energy-efficient_delay-aware_and_lifetime-balancing_data_collection_protocol_for_heterogeneous_wireless_sensor_networks","315323033_P2S_A_Primary_and_Passer-By_Scheduling_Algorithm_for_On-Demand_Charging_Architecture_in_Wireless_Rechargeable_Sensor_Networks","308861545_Energy_Conservation_Clustering_in_Wireless_Sensor_Networks_for_Increased_Life_Time","306157371_A_survey_of_energy-efficient_hierarchical_cluster-based_routing_in_wireless_sensor_networks","306069685_GTCharge_A_Game_Theoretical_Collaborative_Charging_Scheme_for_Wireless_Rechargeable_Sensor_Networks","305304914_An_efficient_routing_algorithm_to_prolong_network_lifetime_in_wireless_sensor_networks","305297945_Optimized_congestion_aware_energy_efficient_traffic_load_balancing_scheme_for_routing_in_wireless_sensor_networks","304240145_Dynamic_cluster_head_election_protocol_for_mobile_wireless_sensor_networks","301917929_Load_balancing_based_energy_efficinet_routing_approach_for_heterogeneous_wireless_sensor_networks"]}