{"id":"316846875_A_Meta-Analytic_Review_of_Two_Modes_of_Learning_and_the_Description-Experience_Gap","abstract":"People can learn about the probabilistic consequences of their actions in two ways: One is by consulting descriptions of an action’s consequences and probabilities (e.g., reading up on a medication’s side effects). The other is by personally experiencing the probabilistic consequences of an action (e.g., beta testing software). In principle, people taking each route can reach analogous states of knowledge and consequently make analogous decisions. In the last dozen years, however, research has demonstrated systematic discrepancies between description- and experienced-based choices. This description‒experience gap has been attributed to factors including reliance on a small set of experience, the impact of recency, and different weighting of probability information in the two decision types. In this meta-analysis focusing on studies using the sampling paradigm of decisions from experience, we evaluated these and other determinants of the decision‒experience gap by reference to more than 70,000 choices made by more than 6,000 participants. We found, first, a robust description‒ experience gap but also a key moderator, namely, problem structure. Second, the largest determinant of the gap was reliance on small samples and the associated sampling error: free to terminate search, individuals explored too little to experience all possible outcomes. Third, the gap persisted when sampling error was basically eliminated, suggesting other determinants. Fourth, the occurrence of recency was contingent on decision makers’ autonomy to terminate search, consistent with the notion of optional stopping. Finally, we found indications of different probability weighting in decisions from experience versus decisions from description when the problem structure involved a risky and a safe option.","authors":["Dirk Wulff","Max Mergenthaler-Canseco","Ralph Hertwig"],"meta":["May 2017Psychological Bulletin 144(2)","DOI:10.1037/bul0000115","Project: Decisions from experience"],"references":["332570892_What_the_Future_Holds_and_When_A_Description-Experience_Gap_in_Intertemporal_Choice","324295996_Games_and_Decisions_Introduction_and_Critical_Survey","320510739_The_Influences_of_Described_and_Experienced_Information_on_Adolescent_Risky_Decision_Making","320457243_Reliance_on_small_samples_the_wavy_recency_effect_and_similarity-based_learning","315788610_Ambiguity_Attitudes","314487415_From_Anomalies_to_Forecasts_Toward_a_Descriptive_Model_of_Decisions_Under_Risk_Under_Ambiguity_and_From_Experience","313785759_Experienced_Probabilities_Increase_Understanding_of_Diagnostic_Test_Results_in_Younger_and_Older_Adults","313007433_Exposition_of_a_New_Theory_on_the_Measurement_of_Risk","309799520_Failures_of_explaining_away_and_screening_off_in_described_versus_experienced_causal_learning_scenarios","309345780_Description_and_experience_How_experimental_investors_learn_about_booms_and_busts_affects_their_financial_risk_taking"]}