{"id":"316891925_ASPECT_A_Survey_to_Assess_Student_Perspective_of_Engagement_in_an_Active-Learning_Classroom","abstract":"The primary measure used to determine relative effectiveness of in-class activities has been student performance on pre/posttests. However, in today’s active-learning classrooms, learning is a social activity, requiring students to interact and learn from their peers. To develop effective active-learning exercises that engage students, it is important to gain a more holistic view of the student experience in an active-learning classroom. We have taken a mixed-methods approach to iteratively develop and validate a 16-item survey to measure multiple facets of the student experience during active-learning exercises. The instrument, which we call Assessing Student Perspective of Engagement in Class Tool (ASPECT), was administered to a large introductory biology class, and student responses were subjected to exploratory factor analysis. The 16 items loaded onto three factors that cumulatively explained 52% of the variation in student response: 1) value of activity, 2) personal effort, and 3) instructor contribution. ASPECT provides a rapid, easily administered means to measure student perception of engagement in an active-learning classroom. Gaining a better understanding of students’ level of engagement will help inform instructor best practices and provide an additional measure for comprehensively assessing the impact of different active-learning strategies. © 2017 B. L. Wiggins, S. L. Eddy, et al. CBE-Life Sciences Education and 2017 The American Society for Cell Biology.","authors":["Benjamin L. Wiggins","Sarah Eddy","Leah Wener-Fligner","Karen Freisem"],"meta":["June 2017CBE life sciences education 16(2):ar32","DOI:10.1187/cbe.16-08-0244"],"references":["284175842_Beyond_the_Biology_A_Systematic_Investigation_of_Noncontent_Instructor_Talk_in_an_Introductory_Biology_Course","283242636_The_Laboratory_Course_Assessment_Survey_A_Tool_to_Measure_Three_Dimensions_of_Research-Course_Design","315856318_Barriers_and_Opportunities_for_2-year_and_4-year_STEM_Degrees","313168454_Developing_a_strong_program_of_construct_validation_A_test_anxiety_example","310750355_Expectancy-value_theory_of_achievement_motivation","307981795_Qualitative_Interviewing_The_Art_of_Hearing_Data","306499551_PORTAAL_A_classroom_observation_tool_assessing_evidence-based_teaching_practices_for_active_learning_in_large_science_technology_engineering_and_mathematics_classes","299148632_The_effect_of_active_learning_methods_on_student_retention_in_engineering_statistics","290077377_Alternative_approaches_to_assessing_student_engagement_rates","286983734_Assessment_and_active_learning_strategies_for_introductory_geology_courses"]}