{"id":"316881073_The_Interplay_Between_Students'_Usage_of_Pronouns_and_Community_Levels_in_Online_Courses","abstract":"This study examined the relationship between sense of community and pronoun usage in online courses that utilized computer mediated communication (CMC) to enable discussion. Using Rovai's (2002) Classroom Community Scale (CCS), we compared pronoun use in three High CCS courses to that in three Low CCS courses. Results revealed students in High CCS courses used proportionally more pronouns, made proportionally more self-references, and used a higher proportion of collective pronouns. Instructors from High CCS courses encouraged students to share personal perspectives, which appears to have promoted a greater sense of connectivity amongst learners. This behaviour explains the differences in pronoun usage and suggests that pronoun-based analytics may be a useful indicator of students' sense of community. Objectives As online learning increases in popularity, researchers are exploring how different types of metrics might indicate the degree of \" online community \" in courses that utilize asynchronous computer-mediated communication (CMC) as a discussion medium. One recent study suggests that frequent note writing, note reading, rereading, note revision, and linking are positive indicators of community (Phirangee, Demmans Epp, Hewitt, 2016). The style of student communication may also be important. Phirangee and Hewitt (2016) found that the use of emoticons, 'Like' buttons, and unconventional punctuation (e.g., repeated exclamation marks) are associated with a sense of stronger communal bonds. These studies suggest that students experience higher levels of community engagement when they are involved in frequent online exchanges and when smileys or other expressive social media tools are used to convey emotional content.","authors":["Carrie Demmans Epp","Krystle Phirangee","Jim Hewitt"],"meta":["April 2017","Conference: 2017 American Educational Research Association (AERA) Annual MeetingAt: San Antonio, TX, USA","Project: Investigating Students' Sense of Community (Social and Learning Support) in Online Courses"],"references":["305430761_Exploring_the_Relationships_between_Facilitation_Methods_Students'_Sense_of_Community_and_Their_Online_Behaviours","260123535_Understanding_Students'_Collaborative_Online_Interaction_Analysis_of_Discussion_Board_Postings","316475851_International_Review_of_Research_in_Open_and_Distance_Learning_Editorial","285759906_Loving_this_Dialogue_Expressing_Emotion_Through_the_Strategic_Manipulation_of_Limited_Non-Verbal_Cues_in_Online_Learning_Environments","273593067_Pronoun_Use_Reflects_Standings_in_Social_Hierarchies","270572743_Student_perceptions_of_peer_versus_instructor_facilitation_of_asynchronous_online_discussions_Further_findings_from_three_cases","265288633_On-Line_Course_Effectiveness_An_Analysis_of_Student_Interactions_and_Perceptions_of_Learning","255567518_A_Study_of_Factors_Influencing_Students'_Perceived_Learning_in_a_Web-Based_Course_Environment","251659651_Use_of_Linguistic_Qualifiers_and_Intensifiers_in_a_Computer_Conference","248913537_Assessing_social_presence_in_online_discussion_groups_A_replication_study"]}