{"id":"316857849_NoDB_efficient_query_execution_on_raw_data_files","abstract":"As data collections become larger and larger, users are faced with increasing bottlenecks in their data analysis. More data means more time to prepare and to load the data into the database before executing the desired queries. Many applications already avoid using database systems, for example, scientific data analysis and social networks, due to the complexity and the increased data-to-query time, that is, the time between getting the data and retrieving its first useful results. For many applications data collections keep growing fast, even on a daily basis, and this data deluge will only increase in the future, where it is expected to have much more data than what we can move or store, let alone analyze.\nWe here present the design and roadmap of a new paradigm in database systems, called NoDB, which do not require data loading while still maintaining the whole feature set of a modern database system. In particular, we show how to make raw data files a first-class citizen, fully integrated with the query engine. Through our design and lessons learned by implementing the NoDB philosophy over a modern Database Management Systems (DBMS), we discuss the fundamental limitations as well as the strong opportunities that such a research path brings. We identify performance bottlenecks specific for in situ processing, namely the repeated parsing and tokenizing overhead and the expensive data type conversion. To address these problems, we introduce an adaptive indexing mechanism that maintains positional information to provide efficient access to raw data files, together with a flexible caching structure. We conclude that NoDB systems are feasible to design and implement over modern DBMS, bringing an unprecedented positive effect in usability and performance.<!-- END_PAGE_1 --","authors":["Ioannis Alagiannis","Renata Borovica-Gajic","Miguel Branco","Stratos Idreos"],"meta":["November 2015Communications of the ACM 58(12):112-121","DOI:10.1145/2830508"],"references":["221310273_To_Tune_or_not_to_Tune_A_Lightweight_Physical_Design_Alerter","221309756_Don't_Scrap_It_Wrap_It_A_Wrapper_Architecture_for_Legacy_Data_Sources","221214563_Self-organizing_tuple_reconstruction_in_column-stores","221214251_Making_database_systems_usable","221214153_COLT_Continuous_on-line_tuning","295121981_CoPhy","280113553_dbTouch_Analytics_at_your_Fingertips","279881695_MAD_skills","274342770_Merging_what's_cracked_cracking_what's_merged","266656509_H2O_A_hands-free_adaptive_store"]}