{"id":"316858728_Ada's_Legacy_Cultures_of_Computing_from_the_Victorian_to_the_Digital_Age","abstract":"From the Preface\nAda's Legacy illustrates the depth and diversity of writers, thinkers, and makers who have been inspired by Ada Lovelace, the English mathematician and writer. The volume, which commemorates the bicentennial of Ada's birth in December 1815, celebrates Lovelace's many achievements as well as the impact of her life and work, which reverberated widely since the late 19th century. In the 21st century we have seen a resurgence in Lovelace scholarship, thanks to the growth of interdisciplinary thinking and the expanding influence of women in science, technology, engineering, and mathematics. Ada's Legacy is a unique contribution to this scholarship. Here, the editors present work on topics previously unknown to coexist in print: Ada's collaboration with Charles Babbage, the development of the Ada programming language, Ada's position in the Victorian and Steampunk literary genres, Ada's representation in and inspiration of contemporary art and comics, and Ada's continued relevance in discussions around gender and technology in the digital age. With the 200th anniversary of Ada Lovelace's birth on December 10, 2015, we believe that the timing is perfect to publish this collection. Because of its broad focus on subjects that reach far beyond the life and work of Ada herself, Ada's Legacy will appeal to readers who are curious about Ada's enduring importance in computing and the wider world.\nThe idea for this book originated from the first academic conference of its kind, Ada Lovelace: An Interdisciplinary Conference Celebrating her Achievements and Legacy, which took place at Stevens Institute of Technology (Hoboken, New Jersey) on October 18, 2013, under the auspices of the Institute's College of Arts and Letters. The time was definitely right to bring this conference to Stevens, which was until 1971 a male-only school. By 1982, Stevens became the first major institute in the United States to implement a personal computer requirement for its students. Around this time, a pioneering technology project resulted in the networking of the entire Stevens campus, creating one of the nation's first intranets. Additionally, the recent development of undergraduate programs in the College of Arts and Letters, including Gender Studies as well as Science and Technology Studies, which strongly anchors women in STEM, clearly made Stevens well positioned to host a conference celebrating Lovelace's achievements and legacy. The conference brought together international scholars from across the disciplines to coincide with the week celebrating Ada Lovelace Day. Tremendous interest circulated in advance of the conference, particularly among computing history specialists and 19th-century literary scholars, and it escalated immediately following the proceedings. Tom Misa, director of the Charles Babbage Institute and a featured speaker at the conference, numbered chiefly among those who caught this interest. He envisioned the possibility for a book project to develop concrete examination of ideas inspired by the proceedings. The conference organizer, Robin Hammerman, and Andrew Russell, director of the College of Arts and Letters Science and Technology Studies program, enthusiastically agreed to collaborate as editors for this interdisciplinary collection.\nMany of the papers published in this volume first were presented at the conference in October 2013. We are pleased to acknowledge the supporters of that conference: Dr. Lisa Dolling, former Dean of the College of Arts & Letters at Stevens Institute of Technology, and Dr. George Korfiatis, Provost of Stevens Institute of Technology.\nThe editors are grateful to Thomas J. Misa, Series Editor for ACM's History of Computing, for skillfully overseeing the development of this project from its inception to completion. We also are happy to thank Diane Cerra, Executive Editor at Morgan & Claypool Publishers, for her kind and capable attention to the production of this volume. And we are delighted that Sydney Padua graciously agreed to create original illustrations for Ada's Legacy.","authors":["Robin Hammerman","Andrew L. Russell"],"meta":["October 2015","DOI:10.1145/2809523.2809539"],"references":["316857931_History_of_programming_languages---II","316857006_ADA---the_project_the_DoD_high_order_language_working_group","265144649_The_Barriers_Facing_Women_in_the_Information_Technology_Profession_An_Exploratory_Investigation_of_Ahuja's_Model","247925275_Jean_E_Sammet_interview_March_28_April_4_April_11_and_April_18_2006"]}