{"id":"316856610_An_in-depth_study_of_LTE_effect_of_network_protocol_and_application_behavior_on_performance","abstract":"With lower latency and higher bandwidth than its predecessor 3G networks, the latest cellular technology 4G LTE has been attracting many new users. However, the interactions among applications, network transport protocol, and the radio layer still remain unexplored. In this work, we conduct an in-depth study of these interactions and their impact on performance, using a combination of active and passive measurements. We observed that LTE has significantly shorter state promotion delays and lower RTTs than those of 3G networks. We discovered various inefficiencies in TCP over LTE such as undesired slow start. We further developed a novel and lightweight passive bandwidth estimation technique for LTE networks. Using this tool, we discovered that many TCP connections significantly under-utilize the available bandwidth. On average, the actually used bandwidth is less than 50% of the available bandwidth. This causes data downloads to be longer, and incur additional energy overhead. We found that the under-utilization can be caused by both application behavior and TCP parameter setting. We found that 52.6% of all downlink TCP flows have been throttled by limited TCP receive window, and that data transfer patterns for some popular applications are both energy and network unfriendly. All these findings highlight the need to develop transport protocol mechanisms and applications that are more LTE-friendly.","authors":["Junxian Huang","Feng Qian","Yihua Guo","Yuanyuan Zhou"],"meta":["August 2013ACM SIGCOMM Computer Communication Review 43(4):363-374","DOI:10.1145/2534169.2486006","Conference: Proceedings of the ACM SIGCOMM 2013 conference on SIGCOMMVolume: 43"],"references":["254002853_Identifying_diverse_usage_behaviors_of_smartphone_apps","292252868_LTE_the_UMTS_long_term_evolution_from_theory_to_practice","262412492_Tackling_bufferbloat_in_3G4G_networks","262404822_Cell_vs_WiFi_on_the_performance_of_metro_area_mobile_connections","262285736_How_to_Reduce_Smartphone_Traffic_Volume_by_30","262241618_Can_you_GET_me_now_Estimating_the_time-to-first-byte_of_HTTP_transactions_with_passive_measurements","262176762_Network_performance_of_smart_mobile_handhelds_in_a_university_campus_WiFi_network","254462858_A_close_examination_of_performance_and_power_characteristics_of_4G_LTE_networks","254008749_Periodic_Transfers_in_Mobile_Applications_Network-wide_Origin_Impact_and_Optimization","254002836_Over_The_Top_Video_the_Gorilla_in_Cellular_Networks"]}