{"id":"316832500_Doing_business_with_the_poor_The_rules_and_impact_of_the_microfinance_institutions","abstract":"Of the total global population, at least 14.5% are living on less than $1.25 a day, 34% of the females in the least developed countries are unable to complete their primary education, and some 805 million are believed to be food insecure. To bring these numbers into accordance with the Millennium Development Goals, there are at least a dozen of different programmes operating around the world. Microcredit, being one of those programmes, is considered superior to the rest for being the only participatory approach and for being general enough to cater for a number of policy interventions. Microcredit or credit to the poor is provided under two very different mechanisms; the welfarist mechanism and the institutionalist mechanism. Each of these mechanisms has its advocates, as well as, its critics. The current paper empirically evaluates the two approaches in a systematic way. By using purposively collected data from the North West Pakistan and vigorous methodologies, we show that commercialization of microfinance institutions has indeed shifted the focus from either poverty reduction or women’s empowerment. Instead, the focus is now on more secure and profitable advances. Moreover, we also show that the welfarist approach in eradicating poverty and empowering women is superior to the now popular financial system approach.","authors":["Wajid Khan","Sun Shaorong","Ikram Ullah"],"meta":["January 2017Ekonomska Istraživanja / Economic Research 30(1):951-963","DOI:10.1080/1331677X.2017.1314790"],"references":["271714655_Measuring_pro-poor_sectoral_analysis_for_Pakistan_Trickle_down","348763029_Why_Doesn't_Microfinance_Work_The_Destructive_Rise_of_Local_Neoliberalism","304872911_On_Mission_Drift_in_Microfinance_Institutions","293246012_Finance_against_poverty_Volume_2","265425166_MICROFINANCE_AND_POVERTY_ALLEVIATION_LESSONS_FROM_INDONESIA'S_VILLAGE_BANKING_SYSTEM","247378529_Regression_Models_for_Categorical_Dependent_Variables_using_STATA","247378458_Regression_Models_for_Categorical_Dependent_Variables_Using_Stata","238249993_Informal_Finance_Some_Findings_from_Asia","234766427_Prediction_and_Statistical_Overkill_Revisited","229446102_The_Selection_of_Variables_in_Multiple_Regression_Analyses"]}