{"id":"316851661_POLITICAS_DE_ACESSO_ABERTO_PARA_TRABALHOS_CIENTIFICOS_INTERESSE_PUBLICO_E_DIREITOS_DE_AUTOR","abstract":"Resumo: O artigo pretende analisar algumas modalidades de políticas de Acesso Aberto praticadas em renomados centros de pesquisa e agências de fomento com vistas ao incremento da produção científica e à facilitação de consulta de material didático pela comunidade acadêmica e demais cidadãos. Sabemos que o regramento jurídico da propriedade intelectual não colabora com o acesso às publicações científicas. Algumas bases de dados e publicações acadêmicas têm preços proibitivos, mesmo que obtenham artigos de pesquisadores, trabalhos voluntários dos revisores e do corpo editorial sem custos. Além disso, quantidade expressiva dos investimentos em pesquisa tem como origem o Estado e as instituições de ensino. Desta forma, julgamos relevante consultar o modo pelo qual são regidas as políticas de divulgação do conhecimento, de acordo com informações contidas nas páginas oficiais de alguns renomados centros de pesquisa, situados em países ocidentais de diferentes tradições jurídicas. Do ponto de vista doutrinário, em nome da proteção dos direitos autorais, algumas vozes defendem o direito dos estudantes e pesquisadores, mesmo de instituições públicas, de postergar, ou mesmo recusar a divulgação de suas pesquisas nos repositórios das Universidades. Outros defendem que qualquer forma de imposição fere a liberdade acadêmica. Concluímos, após refletir sobre a natureza desses argumentos e ponderar sobre os conflitos entre direitos privados e interesses coletivos, que sem violar direitos de autor, pode sim haver políticas que incentivam, ou até obrigam, a depender do caso, o depósito de pesquisas em Acesso Aberto, em função dos direitos à cultura, educação, informação, publicidade, eficiência, promoção do desenvolvimento e inovação.","authors":["Eduardo Altomare Ariente"],"meta":["May 2017Revista Brasileira de Políticas Públicas 7(1)","DOI:10.5102/rbpp.v7i1.4328"],"references":["267750951_O_papel_da_dignidade_humana_em_meio_aos_desafios_do_acesso_aberto_e_do_acesso_universal_perante_o_direito_autoral","308774774_Disrupting_the_subscription_journals'_business_model_for_the_necessary_large-scale_transformation_to_open_access","283387772_Reproducao_Proibida_Financiamento_publico_e_direitos_de_copia_privados_Reproduction_forbidden_public_financing_and_private_copyrights","281229238_A_GARANTIA_DO_DIREITO_A_EDUCACAO_DE_CRIANCAS_E_ADOLESCENTES_NO_CONTEXTO_DAS_POLITICAS_PUBLICAS_BRASILEIRAS","281229106_As_Politicas_Publicas_de_Acesso_e_Difusao_da_Cultura_no_Brasil_e_o_Caso_do_Programa_Nacional_de_Apoio_a_Cultura","255854019_Copyright_and_the_Harvard_Open_Access_Mandate","200772762_The_Wealth_of_Networks","49303773_Pedagogia_del_Oprimido","40398554_Revista_da_Universidade_de_Sao_Paulo","29437059_Funcao_social_da_propriedade_intelectual_compartilhamento_de_arquivos_e_direitos_autorais_na_CF88"]}