{"id":"316851203_Do_Panorama_de_Exclusao_para_a_Construcao_de_uma_Sociedade_Inclusiva_A_Relevancia_do_Uso_das_Tecnologias_da_Informacao_e_Comunicacao_para_as_Pessoas_com_Deficiencia","abstract":"Discute o panorama de exclusão social vivenciado pelas pessoas com deficiência no Brasil e reflete sobre o papel das Tecnologias de Informação e Comunicação (TICs) no processo de inclusão social, contextualizando a evolução conceitual e histórica deste segmento. Demonstra a importância da Ciência da Informação e da Ciência da Computação atuarem em conjunto no processo de disseminação da informação e do conhecimento para a pessoa com deficiência. O objetivo central do trabalho é refletir sobre o panorama de exclusão da pessoa com deficiência na atual Sociedade da Informação e a relevância do uso das TICs como uma ferramenta de mudança no processo de inclusão social. A pesquisa é classificada quanto aos fins, sendo de nível exploratório, e quanto aos meios, sendo bibliográfica; quanto ao método de análise é dedutivo. Conclui que o Brasil dispõe de uma legislação que facilita o acesso à informação e a liberdade de expressão e que tais avanços contribuem para a construção de políticas públicas que diminuem o processo de desigualdade social. Contudo, há a urgência de serem implementadas e, as TICs, por meio de tecnologias assistidas, entre outras ferramentas, podem influenciar positivamente para a inclusão social das pessoas com deficiência na atual Sociedade da Informação.","authors":["Hellosman de Oliveira Silva","Fabiana Aparecida Lazzarin"],"meta":["May 2017Gestão Org 14(2special):303-311","DOI:10.21714/1679-18272016v14n1Esp2.p303-311"],"references":["320053893_Tecnologias_assistivas_e_deficiencia_algumas_consideracoes","269576050_Informacao_e_conhecimento_na_inovacao_e_no_desenvolvimento_local","26349975_A_acessibilidade_a_informacao_no_espaco_digital","26349878_A_metamorfose_do_aprender_na_sociedade_da_informacao","299289905_Informacao_e_desenvolvimento_conhecimento_inovacao_e_apropriacao_social","237223563_As_novas_tecnologias_da_comunicacao_e_informacao_diante_da_transversalidade_entre_natureza_e_cultura"]}