{"id":"316875004_Memetic_Search_for_Identifying_Critical_Nodes_in_Sparse_Graphs","abstract":"Critical node problems involve identifying a subset of critical nodes from an undirected graph whose removal results in optimizing a pre-defined measure over the residual graph. As useful models for a variety of practical applications, these problems are computational challenging. In this paper, we study the classic critical node problem (CNP) and introduce an effective memetic algorithm for solving CNP. The proposed algorithm combines a double backbone-based crossover operator (to generate promising offspring solutions), a component-based neighborhood search procedure (to find high-quality local optima) and a rank-based pool updating strategy (to guarantee a healthy population). Specially, the component-based neighborhood search integrates two key techniques, i.e., two-phase node exchange strategy and node weighting scheme. The double backbone-based crossover extends the idea of general backbone-based crossovers. Extensive evaluations on 42 synthetic and real-world benchmark instances show that the proposed algorithm discovers 21 new upper bounds and matches 18 previous best-known upper bounds. We also demonstrate the relevance of our algorithm for effectively solving a variant of the classic CNP, called the cardinality-constrained critical node problem. Finally, we investigate the usefulness of each key algorithmic component.","authors":["Yangming Zhou","Jin-Kao Hao","Fred Glover"],"meta":["October 2019IEEE Transactions on Cybernetics 49(10):3699-3712","DOI:10.1109/TCYB.2018.2848116"],"references":["314028504_Opposition-Based_Memetic_Search_for_the_Maximum_Diversity_Problem","309179810_Optimizing_Network_Attacks_by_Artificial_Bee_Colony","305568520_A_general_Evolutionary_Framework_for_different_classes_of_Critical_Node_Problems","301899345_Reinforcement_learning_based_local_search_for_grouping_problems_A_case_study_on_graph_coloring","299416769_Memetic_Search_for_the_Generalized_Quadratic_Multiple_Knapsack_Problem","294289263_Hybrid_constructive_heuristics_for_the_critical_node_problem","344828825_Exterior_Path_Relinking_for_Zero-One_Optimization","321613865_Handbook_of_Memetic_Algorithms","318375093_A_fast_heuristic_algorithm_for_the_critical_node_problem","306423131_System_vulnerability_assessment_and_critical_nodes_identification"]}