{"id":"316845210_Alphas_Betas_and_Incels_Theorizing_the_Masculinities_of_the_Manosphere","abstract":"Since the emergence of Web 2.0 and social media, a particularly toxic brand of antifeminism has become evident across a range of online networks and platforms. Despite multiple internal conflicts and contradictions, these diverse assemblages are generally united in their adherence to Red Pill “philosophy,” which purports to liberate men from a life of feminist delusion. This loose confederacy of interest groups, broadly known as the manosphere, has become the dominant arena for the communication of men’s rights in Western culture. This article identifies the key categories and features of the manosphere and subsequently seeks to theorize the masculinities that characterize this discursive space. The analysis reveals that, while there are some continuities with older variants of antifeminism, many of these new toxic assemblages appear to complicate the orthodox alignment of power and dominance with hegemonic masculinity by operationalizing tropes of victimhood, “beta masculinity,” and involuntary celibacy (incels). These new hybrid masculinities provoke important questions about the different functioning of male hegemony off- and online and indicate that the technological affordances of social media are especially well suited to the amplification of new articulations of aggrieved manhood.","authors":["Debbie Ging"],"meta":["May 2017Men and Masculinities 22(4):1097184X1770640","DOI:10.1177/1097184X17706401"],"references":["328252988_Misogyny_Online_A_Short_and_Brutish_History","303718794_Forks_in_the_Road_of_Men's_Gender_Politics_Men's_Rights_vs_Feminist_Allies","346125813_Affirmative_Reaction_New_Formations_of_White_Masculinity","345862397_Taking_It_Like_a_Man_White_Masculinity_Masochism_and_Contemporary_American_Culture","344122933_Affective_Publics_Sentiment_Technology_and_Politics","344077641_Hate_Crimes_in_Cyberspace","344072558_Affirmative_Reaction_New_Formations_of_White_Masculinity","311445837_Simply_more_than_swiping_left_A_critical_analysis_of_toxic_masculine_performances_on_Tinder_Nightmares","300085426_Evolution_Language_and_the_Battle_of_the_Sexes","300085322_Feminist_Encounters_with_Evolutionary_Psychology"]}