{"id":"316870952_Automatic_Video_Event_Detection_for_Imbalance_Data_Using_Enhanced_Ensemble_Deep_Learning","abstract":"With the explosion of multimedia data, semantic event detection from videos has become a demanding and challenging topic. In addition, when the data has a skewed data distribution, interesting event detection also needs to address the data imbalance problem. The recent proliferation of deep learning has made it an essential part of many Artificial Intelligence (AI) systems. Till now, various deep learning architectures have been proposed for numerous applications such as Natural Language Processing (NLP) and image processing. Nonetheless, it is still impracticable for a single model to work well for different applications. Hence, in this paper, a new ensemble deep learning framework is proposed which can be utilized in various scenarios and datasets. The proposed framework is able to handle the over-fitting issue as well as the information losses caused by single models. Moreover, it alleviates the imbalanced data problem in real-world multimedia data. The whole framework includes a suite of deep learning feature extractors integrated with an enhanced ensemble algorithm based on the performance metrics for the imbalanced data. The Support Vector Machine (SVM) classifier is utilized as the last layer of each deep learning component and also as the weak learners in the ensemble module. The framework is evaluated on two large-scale and imbalanced video datasets (namely, disaster and TRECVID). The extensive experimental results illustrate the advantage and effectiveness of the proposed framework. It also demonstrates that the proposed framework outperforms several well-known deep learning methods, as well as the conventional features integrated with different classifiers.","authors":["Samira Pouyanfar","Shu-Ching Chen"],"meta":["March 2017International Journal of Semantic Computing 11(01):85-109","DOI:10.1142/S1793351X17400050"],"references":["312567980_Semantic_Event_Detection_Using_Ensemble_Deep_Learning","311756279_Domain_Knowledge_Assisted_Data_Processing_for_Florida_Public_Hurricane_Loss_Model_Invited_Paper","311754068_Semantic_Concept_Detection_Using_Weighted_Discretization_Multiple_Correspondence_Analysis_for_Disaster_Information_Management","319770820_Histograms_of_Oriented_Gradients_for_Human_Detection","319770430_Rich_feature_hierarchies_for_accurate_object_detection_and_semantic_segmentation","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","316240097_Distinctive_Image_Features_from_Scale-Invariant_Keypoints","315089815_Innovative_Shot_Boundary_Detection_for_Video_Indexing","314921117_Ensemble_Learning_from_Imbalanced_Data_Set_for_Video_Event_Detection","311756687_A_Classifier_Ensemble_Framework_for_Multimedia_Big_Data_Classification"]}