{"id":"316821143_Stable_Architectures_for_Deep_Neural_Networks","abstract":"Deep neural networks have become invaluable tools for supervised machine learning, e.g., in classification of text or images. While offering superior flexibility to find and express complicated patterns in data, deep architectures are known to be challenging to design and train so that they generalize well to new data. An important issue are numerical instabilities in derivative-based learning algorithms commonly called exploding or vanishing gradients. In this paper we propose new forward propagation techniques inspired by systems of Ordinary Differential Equations (ODE) that overcome this challenge and lead to well-posed learning problems for arbitrarily deep networks. The backbone of our approach is interpreting deep learning as a parameter estimation problem of a nonlinear dynamical system. Given this formulation we analyze stability and well-posedness of deep learning and motivated by our findings develop new architectures. We relate the exploding and vanishing gradient phenomenon to the stability of the discrete ODE and present several strategies for stabilizing deep learning for very deep networks. While our new architectures restrict the solution space, several numerical experiments show their competitiveness to state-of-the-art networks.","authors":["Eldad Haber","Lars Ruthotto"],"meta":["May 2017Inverse Problems 34(1)","DOI:10.1088/1361-6420/aa9a90"],"references":["314256411_Learning_across_scales_-_A_multiscale_method_for_Convolution_Neural_Networks","303992986_Optimization_Methods_for_Large-Scale_Machine_Learning","316753002_A_Scaled_Conjugate_Gradient_Algorithm_for_Fast_Supervised_Learning","311609041_Deep_Residual_Learning_for_Image_Recognition","309110121_Rank-Defficient_and_Discrete_Ill-Posed_Problems","308277201_Identity_Mappings_in_Deep_Residual_Networks","291437504_Sub-Sampled_Newton_Methods_II_Local_Convergence_Rates","290163834_The_use_of_adjoint_systems_in_the_problem_of_differential_corrections_for_trajectories","281808534_Numerical_Computation_of_the_Gradient_and_the_Action_of_the_Hessian_for_Time-Dependent_PDE-Constrained_Optimization_Problems","278660085_Stochastic_Gradient_Descent_Tricks"]}