{"id":"316998572_HRTT_A_Hierarchical_Roof_Topology_Structure_for_Robust_Building_Roof_Reconstruction_from_Point_Clouds","abstract":"The identification and representation of building roof topology are basic, but important, issues for 3D building model reconstruction from point clouds. Always, the roof topology is expressed by the roof topology graph (RTG), which stores the plane–plane adjacencies as graph edges. As the decision of the graph edges is often based on local statistics between adjacent planes, topology errors can be easily produced because of noise, lack of data, and resulting errors in pre-processing steps. In this work, the hierarchical roof topology tree (HRTT) is proposed, instead of traditional RTG, to represent the topology relationships among different roof elements. Building primitives or child structures are taken as inside tree nodes; thus, the plane–model and model–model relations can be well described and further exploited. Integral constraints and extra verifying procedures can also be easily introduced to improve the topology quality. As for the basic plane-to-plane adjacencies, we no longer decide all connections at the same time, but rather we decide the robust ones preferentially. Those robust connections will separate the whole model into simpler components step-by-step and produce the basic semantic information for the identification of ambiguous ones. In this way, the effects from structures of minor importance or spurious ridges can be limited to the building locale, while the common features can be detected integrally. Experiments on various data show that the proposed method can obviously improve the topology quality and produce more precise results. Compared with the RTG-based method, two topology quality indices increase from 80.9% and 79.8% to 89.4% and 88.2% in the test area. The integral model quality indices at the pixel level and the plane level also achieve the precision of 90.3% and 84.7%, accordingly.","authors":["Bo Xu","Wanshou Jiang","Lelin Li"],"meta":["April 2017Remote Sensing 9(4):354","DOI:10.3390/rs9040354"],"references":["313618366_A_survey_of_urban_reconstruction","288040075_Investigation_on_the_Weighted_RANSAC_Approaches_for_Building_Roof_Plane_Segmentation_from_LiDAR_Point_Clouds","280548230_From_Laser_Scanning_to_Finite_Element_Analysis_of_Complex_Buildings_by_Using_a_Semi-Automatic_Procedure","276458701_LOD_Generation_for_Urban_Scenes","276019990_An_automated_method_for_3d_roof_outline_generation_and_regularization_in_airborne_laser_scanner_data","274677252_An_implicit_regularization_for_3D_building_rooftop_modelling_using_airbourne_LIDAR_data","274677245_A_LINE-BASED_3D_ROOF_MODEL_RECONSTRUCTION_ALGORITHM_TIN-MERGING_AND_RESHAPING_TMR","273396103_An_Automatic_and_Threshold-Free_Performance_Evaluation_System_for_Building_Extraction_Techniques_From_Airborne_LIDAR_Data","310789706_An_innovative_numerical_modeling_strategy_for_the_structural_analysis_of_historical_monumental_buildings","271538853_Flexible_building_primitives_for_3D_building_modeling"]}