{"id":"316901188_Understanding_Learners'_Motivation_and_Learning_Strategies_in_MOOCs","abstract":"p class=\"3\">MOOCs (Massive Open Online Courses) have changed the way in which OER (Open Educational Resources) are bundled by teachers and consumed by learners. MOOCs represent an evolution towards the production and offering of structured quality OER. Many institutions that were initially reluctant to providing OER have, however, joined the MOOC wave. Nevertheless, MOOCs detractors strongly criticize their high dropout rates. The dropout rate is a commonly accepted metric of success for traditional education, but it may not be as suitable when dealing with OER, in general, and with MOOCs, in particular, since learners’ motivations to take a course are very diverse, and certain self-regulated learning strategies are required to tackle the lack of personalized tutoring and keep pace in the course. This paper presents an empirical study on the motivation and learning strategies of MOOC learners. Six thousand three hundred and thirty-five learners from 160 countries answered a self-report 7-point Likert-type questionnaire based on the Motivated Strategies for Learning Questionnaire (MSLQ) as part of a MOOC titled Introduction to Programming with Java . Results indicate that learners were highly motivated and confident to do well in the course. Learning strategies, however, can be improved, especially regarding time management.</p","authors":["Carlos Alario-Hoyos","Iria Estévez-Ayres","Mar Pérez-Sanagustín","Carlos Delgado-Kloos"],"meta":["May 2017International Review of Research in Open and Distance Learning 18(3)","DOI:10.19173/irrodl.v18i3.2996"],"references":["318349754_Interactive_activities_the_key_to_learning_programming_with_MOOCs","309448804_Validation_of_the_self-regulated_online_learning_questionnaire","306373006_Developments_in_MOOC_Technologies_and_Participation_Since_2012_Changes_Since_The_Year_of_the_MOOC","302869857_Motivated_strategies_for_learning_and_their_association_with_academic_performance_of_a_diverse_group_of_1st-year_medical_students","316878060_Learning_strategies_as_a_mediator_for_motivation_and_a_sense_of_achievement_among_students_who_study_in_MOOCs","312911916_Models_of_self-regulated_learning_A_review","308957955_Self-regulated_learning_strategies_predict_learner_behavior_and_goal_attainment_in_Massive_Open_Online_Courses_In_press","308165324_Content_or_platform_Why_do_students_complete_MOOCs","306148872_Dropout_prediction_in_MOOCs_using_learner_activity_features","302981134_Self-Regulated_Learning_and_a_Sense_of_Achievement_in_MOOCs_Among_High_School_Science_and_Technology_Students"]}