{"id":"316914392_Super-Resolution_of_Point_Set_Surfaces_Using_Local_Similarities","abstract":"3D scanners provide a virtual representation of object surfaces at some given precision that depends on many factors such as the object material, the quality of the laser-ray or the resolution of the camera. This precision may even vary over the surface, depending for example on the distance to the scanner which results in uneven and unstructured point sets, with an uncertainty on the coordinates. To enhance the quality of the scanner output, one usually resorts to local surface interpolation between measured points. However, object surfaces often exhibit interesting statistical features such as repetitive geometric textures. Building on this property, we propose a new approach for surface super-resolution that detects repetitive patterns or self-similarities and exploits them to improve the scan resolution by aggregating scattered measures. In contrast with other surface super-resolution methods, our algorithm has two important advantages. First, when handling multiple scans, it does not rely on surface registration. Second, it is able to produce super-resolution from even a single scan. These features are made possible by a new local shape description able to capture differential properties of order above 2. By comparing those descriptors, similarities are detected and used to generate a high-resolution surface. Our results show a clear resolution gain over state-of-the-art interpolation methods.","authors":["Azzouz Hamdi-Cherif","Julie Digne","Raphaëlle Chaine"],"meta":["June 2017Computer Graphics Forum 37(5)","DOI:10.1111/cgf.13216","Project: PAPS: Patch Aware Processing of Surfaces"],"references":["262772475_Self-similarity_for_accurate_compression_of_point_sampled_surfaces","259150688_Non_Local_Point_Set_Surfaces","256231142_Similarity_Based_Filtering_of_Point_Clouds","313766531_Multi-level_partition_of_unity_implicits","312152791_Poisson_surface_reconstruction","284829635_Image_and_video_upscaling_from_local_self-examples","283699559_Revealing_and_Modifying_Non-Local_Variations_in_a_Single_Image","277039224_Image_super-resolution_via_sparse_representation","262772476_SimSelect_Similarity-based_selection_for_3D_surfaces","262226002_A_Statistical_Prediction_Model_Based_on_Sparse_Representations_for_Single_Image_Super-Resolution","224138603_Image_Super-Resolution_Via_Sparse_Representation","224135979_Super-Resolution_from_a_Single_Image","245928948_Digital_Images_and_Human_Vision","227916622_Feature_Preserving_Point_Set_Surfaces_based_on_Non-Linear_Kernel_Regression","227662843_Shape_Analysis_Using_the_Auto_Diffusion_Function"]}