{"id":"316998102_Hierarchical_organization_of_H_Eugene_Stanley_scientific_collaboration_community_in_weighted_network_representation","abstract":"By mapping the most advanced elements of the contemporary social interactions, the world scientific collaboration network develops an extremely involved and heterogeneous organization. Selected characteristics of this heterogeneity are here studied and identified by focusing on the scientific collaboration community of H.~Eugene Stanley - one of the most prolific world scholars at the present time. Based on the {\\it Web of Science} records as of March 28, 2016, several variants of networks are constructed. It is found that the Stanley $\\#1$ network - this in analogy to the Erd\\H{o}s $\\#$ - develops a largely consistent hierarchical organization and Stanley himself obeys rules of the same hierarchy. This however is seen exclusively in the weighted network representation. An existing relevant model indicates that, when such a weighted network is evolving, the spread of weight gets stimulation to multiplicative bursts over the neighbouring nodes which leads to a balanced growth of interconnections among them. While not exclusive to Stanley such a behaviour is not a rule, however. Networks of other outstanding scholars studied here more often develop a star-like form and the central hubs constitute outliers. This study is complemented by spectral analysis of the normalised Laplacian matrices derived from the weighted variants of the corresponding networks and, among others, it points to the efficiency of such a procedure for identifying the component communities and relations among them in complex weighted networks.","authors":["Stanislaw Drozdz","Andrzej Kulig","Jarosław Kwapień","Artur Niewiarowski"],"meta":["May 2017Journal of Informetrics 11(4)","DOI:10.1016/j.joi.2017.09.009"],"references":["301865836_Network_Structure_Self-Organization_and_the_Growth_of_International_Collaboration_in_Science","312940435_2001_Statistical_mechanics_of_complex_networksJ","292000844_Structure_of_growing_social_networks","283617410_Emergence_of_Scaling_in_Random_Networks","281263059_Evolution_of_the_social_network_of_scientific_collaboration","268553750_Graphs_and_Matrices","266018437_Famous_Trails_to_Paul_Erdos","261289430_Zipf-Mandelbrot-Pareto_model_for_co-authorship_popularity","259765186_Binary_Scientific_Star_Coauthors_Core_Size","257217562_Empirical_analysis_of_the_evolution_of_a_scientific_collaboration_network"]}