{"id":"316903499_Trends_in_Data_Locality_Abstractions_for_HPC_Systems","abstract":"The cost of data movement has always been an important concern in high performance computing (HPC) systems. It has now become the dominant factor in terms of both energy consumption and performance. Support for expression of data locality has been explored in the past, but those efforts have had only modest success in being adopted in HPC applications for various reasons. However, with the increasing complexity of the memory hierarchy and higher parallelism in emerging HPC systems, locality management has acquired a new urgency. Developers can no longer limit themselves to low-level solutions and ignore the potential for productivity and performance portability obtained by using locality abstractions. Fortunately, the trend emerging in recent literature on the topic alleviates many of the concerns that got in the way of their adoption by application developers. Data locality abstractions are available in the forms of libraries, data structures, languages and runtime systems; a common theme is increasing productivity without sacrificing performance. This paper examines these trends and identifies commonalities that can combine various locality concepts to develop a comprehensive approach to expressing and managing data locality on future large-scale high-performance computing systems.","authors":["Didem Unat","Anshu Dubey","Torsten Hoefler","John Shalf"],"meta":["May 2017IEEE Transactions on Parallel and Distributed Systems PP(99):1-1","DOI:10.1109/TPDS.2017.2703149"],"references":["308829044_Netloc_Towards_a_Comprehensive_View_of_the_HPC_System_Topology","293107994_Abstract_Machine_Models_and_Proxy_Architectures_for_Exascale_Computing","336980986_A_New_Vision_for_Coarray_Fortran","315366133_Perilla_Metadata-Based_Optimizations_of_an_Asynchronous_Runtime_for_Adaptive_Mesh_Refinement","312964073_Topology-Aware_Data_Aggregation_for_Intensive_IO_on_Large-Scale_Supercomputers","310821470_BoxLib_with_Tiling_An_Adaptive_Mesh_Refinement_Software_Framework","303972684_TiDA_High-Level_Programming_Abstractions_for_Data_Locality_Management","303901741_Polly-ACC_Transparent_compilation_to_heterogeneous_hardware","291064388_Scalable_molecular_dynamics_with_namd","284568228_Hierarchical_Computation_in_the_SPMD_Programming_Model"]}