{"id":"316945461_A_study_on_the_impact_of_non-operational_mechanisms_on_the_effectiveness_of_public_IT_governance","abstract":"This study proposes an analysis of non-operational mechanisms that can impact the effectiveness of information technology (IT) governance in the Brazilian public administration. A questionnaire was sent to IT managers and experienced professionals in the area of IT governance, who work in public organizations. Based on the collected data, we used the structural equations technique to verify the impact of the following mechanisms on the effectiveness of IT governance: top management support; performance of the IT steering committee; use of IT strategic planning; performance of the IT investment portfolio management. The study indicates that the first three mechanisms do not influence the perceived effectiveness of information technology governance in the Brazilian public sector. However, the performance of the IT investment portfolio management has a direct and positive consequence on effectiveness; also, as a mediating variable, it significantly affects the performance of the IT steering committee, increasing the effectiveness of Brazilian public IT governance. Through the achieved results and the analysis of these effects, this study aims to contribute theoretically to the literature on IT governance, as there are few studies that examine which mechanisms assist to establish this effectiveness in public organizations, and even less when it comes to the Brazilian public sector.","authors":["Leonel Cerqueira Santos","Carlos Denner dos Santos Jr."],"meta":["May 2017Revista de Administração 52(3)","DOI:10.1016/j.rausp.2017.05.005","Project: Empreendedorismo & Inovação"],"references":["312446173_Concurso_inovacao_na_gestao_publica_federal_Analise_de_uma_trajetoria_1996-2006","309454242_Estrategia_Competitiva_Dos_conceitos_a_Implementacao","304184535_Implementation_of_information_technology_IT_governance_through_IT_strategic_planning","314671408_The_Evolution_of_Federal_Information_Technology_Management_Literature","314457003_Structures_Processes_and_Relational_Mechanisms_for_IT_Governance","313695438_The_implementation_of_strategic_information_systems_planning_methodologies","313098750_Public_value_management_a_new_narrative_for_networked_governance","309254394_Psychometric_Theory","297893614_Framing_Information_Technology_Governance_in_the_Public_Sector_Opportunities_and_Challenges","289720417_The_Evolution_of_Federal_Information_Technology_Management_Literature_Does_IT_Finally_Matter"]}