{"id":"316991044_The_Impact_of_Gender_Stereotypes_on_the_Self-Concept_of_Female_Students_in_STEM_Subjects_with_an_Under-Representation_of_Females","abstract":"It's possible to assume that women who study STEM topics with a low proportion of females have successfully overcome barriers in school and the family, making them less prone to stereotypic views, and influences. The present study focuses on these kinds of factors and analyzes to which degree family factors, school-related factors, and individual stereotypes may influence a woman's academic self-concept. The following study presents a latent regression model which is based on a survey of 296 women from different German universities, all of whom are part of STEM programs of study that have <30% females. It was investigated to which degree individual stereotypes, support in school, and family support contribute to the self-concept in STEM. Gender stereotypes were negatively related to students' STEM-specific self-concept in the selected sample. This study also reveals negative family-related influences that lower a woman's self-concept. Positive predictors on the other hand included school aspects that are found in the students' favorite subjects at school. The results of the study provide important aspects for STEM education. Even though the students participating in the study presumably had good grades in STEM, stereotypes still corrupted their self-concept. One of the reasons for this might lie in stereotypes that attribute girls' achievements to diligence instead of talent. The results also point out that direct support, particularly by parents, can have a negative impact on female students' self-concept. Activities that are meant to support pupils directly may actually backfire and transport stereotypes instead. This stresses the need for indirect support during socialization, e.g., by providing opportunities for children to have positive experiences or by giving them the chance to meet role models that are enthusiastic about their STEM professions. These kinds of measures have the potential to spur students' interest in STEM subjects—something that in the present study proved to be especially beneficial for women's positive self-concept when studying STEM topics.","authors":["Bernhard Ertl","Silke Luttenberger","Manuela Paechter"],"meta":["May 2017Frontiers in Psychology 8","DOI:10.3389/fpsyg.2017.00703","Project: SESTEM"],"references":["324170206_Golem_und_Pygmalion_Scheitert_die_Chancengleichheit_von_Madchen_im_mathematisch-naturwissenschaftlich-technischen_Bereich_am_geschlechtsstereotypen_Denken_der_Eltern","306104447_Not_Feeling_Good_in_STEM_Effects_of_Stereotype_Activation_and_Anticipated_Affect_on_Women's_Career_Aspirations","303408715_Spurensuche_Entscheidungskriterien_fur_Natur-_bzw_Ingenieurwissenschaften_und_mogliche_Ursachen_fur_fruhe_Studienabbruche_von_Frauen_und_Mannern_an_TU9-Universitaten","294733732_Aspirations_and_Application_for_Graduate_Education_Gender_Differences_in_Low-Participation_STEM_Disciplines","289964052_Madchen_und_Mathematik","321604903_Motivation_und_Handeln","321389363_Bridging_the_gap_by_enhancing_the_fit_How_stereotypes_about_STEM_clash_with_stereotypes_about_girls","316659319_Springer-Lehrbuch","289963909_Entwicklung_schulischer_Interessen_als_Identitatsregulation","289963250_Entwicklung_schulischer_Interessen_als_Identitatsregulation"]}