{"id":"316903018_Email_Classification_Research_Trends_Review_and_Open_Issues","abstract":"Personal and business users prefer to use email as one of the crucial sources of communication. The usage and importance of emails continuously grow despite the prevalence of alternative means, such as electronic messages, mobile applications, and social networks. As the volume of business-critical emails continues to grow, the need to automate the management of emails increases for several reasons, such as spam email classification, phishing email classification, and multi-folder categorization, among others. This study comprehensively reviews articles on email classification published in 2006–2016 by exploiting the methodological decision analysis in five aspects, namely, email classification application areas, datasets used in each application area, feature space utilized in each application area, email classification techniques, and use of performance measures. A total of 98 articles (56 articles from Web of Science core collection databases and 42 articles from Scopus database) are selected. To achieve the objective of the study, a comprehensive review and analysis is conducted to explore the various areas where email classification was applied. Moreover, various public datasets, features sets, classification techniques, and performance measures are examined and used in each identified application area. This review identifies five application areas of email classification. The most widely used datasets, features sets, classification techniques, and performance measures are found in the identified application areas. The extensive use of these popular datasets, features sets, classification techniques, and performance measures is discussed and justified. The research directions, research challenges, and open issues in the field of email classification are also presented for future researchers.","authors":["Ghulam Mujtaba","Liyana Shuib","Ram Gopal Raj","Nahdia Majeed"],"meta":["May 2017IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2017.2702187"],"references":["338717612_Adaptive_Machine_Learning_Approach_for_Emotional_Email_Classification","308828918_An_empirical_study_on_email_classification_using_supervised_machine_learning_in_real_environments","322408275_Email_Category_Prediction","318815587_Automatic_e-mail_classification_using_dynamic_category_hierarchy_and_semantic_features","308852924_A_graph_model_based_author_attribution_technique_for_single-class_e-mail_classification","299424606_Detection_of_phishing_emails_using_data_mining_algorithms","292355210_Multi_stage_phishing_email_classification","289961197_Realization_of_Microsoft_OutlookR_Add-In_for_Language_Based_E-Mail_Folder_Classification","289304126_Headerless_quoteless_but_not_hopeless_Using_pairwise_email_classification_to_disentangle_email_threads","287561622_An_improved_of_spam_E-mail_classification_mechanism_using_K-means_clustering"]}