{"id":"316950623_Toward_Seamless_Multiview_Scene_Analysis_From_Satellite_to_Street_Level","abstract":"In this paper, we discuss and review how combined multiview imagery from satellite to street level can benefit scene analysis. Numerous works exist that merge information from remote sensing and images acquired from the ground for tasks such as object detection, robots guidance, or scene understanding. What makes the combination of overhead and street-level images challenging are the strongly varying viewpoints, the different scales of the images, their illuminations and sensor modality, and time of acquisition. Direct (dense) matching of images on a per-pixel basis is thus often impossible, and one has to resort to alternative strategies that will be discussed in this paper. For such purpose, we review recent works that attempt to combine images taken from the ground and overhead views for purposes like scene registration, reconstruction, or classification. After the theoretical review, we present three recent methods to showcase the interest and potential impact of such fusion on real applications (change detection, image orientation, and tree cataloging), whose logic can then be reused to extend the use of ground-based images in remote sensing and vice versa. Through this review, we advocate that cross fertilization between remote sensing, computer vision, and machine learning is very valuable to make the best of geographic data available from Earth observation sensors and ground imagery. Despite its challenges, we believe that integrating these complementary data sources will lead to major breakthroughs in Big GeoData. It will open new perspectives for this exciting and emerging field.","authors":["Sébastien Lefèvre","Devis Tuia","Jan Dirk Wegner","Timothée Produit"],"meta":["May 2017Proceedings of the IEEE PP(99):1-16","DOI:10.1109/JPROC.2017.2684300","Project: Multimodal machine learning for remote sensing information fusion"],"references":["309372787_Coupling_ground-level_panoramas_and_aerial_imagery_for_change_detection","347495878_Photogrammetry_Geometry_from_Images_and_Laser_Scans","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","319769911_Faster_R-CNN_Towards_Real-Time_Object_Detection_with_Region_Proposal_Networks","316448423_Efficient_volumetric_fusion_of_airborne_and_street-side_data_for_urban_reconstruction","316240097_Distinctive_Image_Features_from_Scale-Invariant_Keypoints","314727145_What_makes_Paris_look_like_Paris","308858605_On_the_location_dependence_of_convolutional_neural_network_features","308322075_Cataloging_Public_Objects_Using_Aerial_and_Street-Level_Images_-_Urban_Trees","308277891_Localizing_and_Orienting_Street_Views_Using_Overhead_Imagery"]}