{"id":"316986388_Probabilistic_Supervisory_Control_Theory_pSCT_Applied_to_Swarm_Robotics","abstract":"Swarm robotics studies large groups of robots that work together to accomplish common tasks. Much of the used source code is developed in an ad-hoc manner, meaning that the correctness of the controller is not always verifiable. In previous work, supervisory control theory (SCT) and associated design tools have been used to address this problem. Given a formal description of the swarm’s agents capabilities and their desired behaviour, the control source code can be automatically generated. However, regular SCT cannot model probabilistic controllers (supervisors). In this paper, we propose a probabilistic supervisory control theory (pSCT) framework. It applies prior work on probabilistic generators in a way that allows controllers to be decomposed into multiple local modular supervisors. Local modular supervisors take advantage of the modularity of formal specifications to reduce the size required to store the control logic. To validate the pSCT framework, we model a distributed swarm robotic version of the graph colouring problem and automatically generate the control source code for the Kilobot swarm robotics platform. We report the results of systematic experiments with swarms of 25 and 100 physical robots.","authors":["Yuri Kaszubowski Lopes","Stefan Markus Trenkwalder","André Bittencourt Leal","Tony J. Dodd"],"meta":["May 2017","Conference: 16th International Conference on Autonomous Agents and Multiagent Systems (AAMAS 2017)At: São Paulo, Brazil","Project: Supervisory Control of swarms of robots"],"references":["304049024_Flocking_in_Fixed_and_Switching_Networks","301306908_A_Method_for_PLC_Implementation_of_Supervisory_Control_of_Discrete_Event_Systems","296482676_Supervisory_control_theory_applied_to_swarm_robotics","277604571_AutoMoDe-Chocolate_automatic_design_of_control_software_for_robot_swarms","277557402_Nadzoru_A_Software_Tool_for_Supervisory_Control_of_Discrete_Event_Systems","259432069_Swarm_robotics_reviewed","257343873_Towards_temporal_verification_of_swarm_robotic_systems","304166013_A_Framework_for_Supervisory_Control_of_Probabilistic_Discrete_Event_Systems","261415805_Provably-correct_stochastic_motion_planning_with_safety_constraints","254040658_Kilobot_A_Low_Cost_Scalable_Robot_System_for_Collective_Behaviors"]}