{"id":"316923375_MITK_global_tractography","abstract":"Fiber tracking algorithms yield valuable information for neurosurgery as\nwell as automated diagnostic approaches. However, they have not yet\narrived in the daily clinical practice. In this paper we present an open\nsource integration of the global tractography algorithm proposed by\nReisert et.al.1 into the open source Medical Imaging Interaction Toolkit\n(MITK) developed and maintained by the Division of Medical and\nBiological Informatics at the German Cancer Research Center (DKFZ). The\nintegration of this algorithm into a standardized and open development\nenvironment like MITK enriches accessibility of tractography algorithms\nfor the science community and is an important step towards bringing\nneuronal tractography closer to a clinical application. The MITK\ndiffusion imaging application, downloadable from www.mitk.org, combines\nall the steps necessary for a successful tractography: preprocessing,\nreconstruction of the images, the actual tracking, live monitoring of\nintermediate results, postprocessing and visualization of the final\ntracking results. This paper presents typical tracking results and\ndemonstrates the steps for pre- and post-processing of the images.","authors":["Peter Neher","Bram Stieltjes","Marco Reisert","Ignaz Reicht"],"meta":["February 2012Proceedings of SPIE - The International Society for Optical Engineering","DOI:10.1117/12.911215","In book: SPIE medical imaging (pp.83144D-83144D)Publisher: International Society for Optics and Photonics","Project: dMRI@MIC-DKFZ"],"references":["236024421_MITK-DI_-_A_new_diffusion_imaging_component_for_MITK","224572510_ODF_reconstruction_in_Q-ball_imaging_with_solid_angle_consideration","49775555_Quantitative_evaluation_of_10_tractography_algorithms_on_a_realistic_diffusion_MR_phantom","46380431_Global_fiber_reconstruction_becomes_practical","23282126_Gibbs_tracking_A_novel_approach_for_the_reconstruction_of_neuronal_pathways","8163837_Q-ball_Imaging","7844530_The_Medical_Imaging_Interaction_Toolkit","6077718_Regularized_fast_and_robust_analytical_Q-Ball_imaging"]}