{"id":"316946058_Access_Point_Backhaul_Resource_Aggregation_as_a_Many-to-One_Matching_Game_in_Wireless_Local_Area_Networks","abstract":"This paper studies backhaul bandwidth aggregation in the context of a wireless local area network composed of two different types of access points: those with spare backhaul capacity (which we term providers) and those in shortage of it (beneficiaries); the aim is to transfer excess capacity from providers to beneficiaries. We model the system as a matching game with many-to-one setting wherein several providers can be matched to one beneficiary and adopt the so-called deferred acceptance algorithm to reach an optimal and stable solution. We consider two flavors, when the beneficiaries are limited in their resource demands and when they are not, and two scenarios, when resources are abundant and when they are scarce. Our results show that the many-to-one setting outperforms the one-to-one case in terms of overall throughput gain, resource usage, and individual beneficiaries satisfaction by up to 50%, whether resources are scarce or abundant. As of the limited versus nonlimited case, the former ensures more fair sharing of spectral resources and higher satisfaction percentage between beneficiaries.","authors":["Kawther Hassine","Mounir Frikha","Tijani Chahed"],"meta":["May 2017Wireless Communications and Mobile Computing 2017(1):1-11","DOI:10.1155/2017/3523868","Project: Optimizing AP backhaul resource allocation in WLANs"],"references":["270762394_Matching_Theory_for_Backhaul_Management_in_Small_Cell_Networks_with_mmWave_Capabilities","267395923_Matching_Theory_for_Future_Wireless_Networks_Fundamentals_and_Applications","323715811_College_Admissions_and_the_Stability_of_Marriage","323584997_Communication_in_the_Presence_of_Noise","311344193_College_Admission_and_the_Stability_of_Marriage","303513266_Greedy_Versus_Limited_Access_Point_Backhaul_Resource_Aggregation_in_Wireless_Local_Area_Networks","301475883_Proposal_for_access_point_backhaul_resource_aggregation_and_its_modeling_using_one-to-one_matching_game","284039089_Reducibility_among_combinatorial_problems","265426020_Algorithms_for_the_Assignment_and_Transportation_Problems","261452840_SmartAP_Practical_WLAN_backhaul_aggregation"]}