{"id":"316994943_Linear_discriminant_analysis_A_detailed_tutorial","abstract":"Linear Discriminant Analysis (LDA) is a very common technique for dimensionality reduction problems as a pre-processing step for machine learning and pattern classification applications. At the same time, it is usually used as a black box, but (sometimes) not well understood. The aim of this paper is to build a solid intuition for what is LDA, and how LDA works, thus enabling readers of all levels be able to get a better understanding of the LDA and to know how to apply this technique in different applications. The paper first gave the basic definitions and steps of how LDA technique works supported with visual explanations of these steps. Moreover, the two methods of computing the LDA space, i.e. class-dependent and class-independent methods, were explained in details. Then, in a step-by-step approach, two numerical examples are demonstrated to show how the LDA space can be calculated in case of the class-dependent and class-independent methods. Furthermore, two of the most common LDA problems (i.e. Small Sample Size (SSS) and non-linearity problems) were highlighted and illustrated, and state-of-the-art solutions to these problems were investigated and explained. Finally, a number of experiments was conducted with different datasets to (1) investigate the effect of the eigenvectors that used in the LDA space on the robustness of the extracted feature for the classification accuracy, and (2) to show when the SSS problem occurs and how it can be addressed.","authors":["Alaa Tharwat","Tarek Gaber","Abdelhameed Ibrahim","Aboul Ella Hassanien"],"meta":["May 2017Ai Communications 30(2):169-190,","DOI:10.3233/AIC-170729","Project: Tutorial papers"],"references":["317083802_Eigenfaces_vs_Fisherfaces_Recognition_Using_Class_Specific_Linear_Projection","309181190_A_BA-based_algorithm_for_parameter_optimization_of_Support_Vector_Machine","309165405_Principal_component_analysis_-_a_tutorial","314289435_Classification_of_Toxicity_Effects_of_Biotransformed_Hepatic_Drugs_using_Whale_Optimized_Support_Vector_Machines","313766392_When_does_non-negative_matrix_factorization_give_a_correct_decomposition_into_parts","310514248_Principles_of_Data_Mining","310434802_One-dimensional_vs_two-dimensional_based_features_Plant_identification_approach","309347446_Plants_Identification_Using_Feature_Fusion_Technique_and_Bagging_Classifier","309019439_Principal_component_analysis_-_a_tutorial","306202492_Fisher_discriminant_analysis_with_kernels"]}