{"id":"316938563_YouTube_Integration_in_Science_Classes_Understanding_Its_Roots_Ways_and_Selection_Criteria","abstract":"YouTube is among the popular platforms in social media in today’s digital age. Along with this popularity and the pressure to integrate ICT in the curriculum, the myriad of benefits afforded by YouTube for the improvement of science education encourage science teachers to utilize it in the teaching-learning process. This investigation was then effected to generate an understanding of science teachers’ means and motives in using YouTube in their respective classes. Following the principles of phenomenology, two themes vis-à-vis YouTube integration surfaced. “Spectatorial” pertains to the passive use in which science teachers’ participation is limited to viewing purposes. Anent, the sub-themes “Teacher’s resource: Learning purposes” and “Teaching resource: Teaching purposes” were derived. These two establish that teachers rely on YouTube respectively to clarify concepts in lessons they find challenging and to enhance their science instruction. Yet prior to usage especially inside the classroom, science teachers subject YouTube content to meticulous scrutiny with close consideration to factors related to psychological and pedagogical principles. This is to ensure appropriateness of the material. “Participatory” on the other hand concerns the role of teachers as cocreators of YouTube by means of uploading various science materials. These findings reveal how YouTube is utilized as well as underutilized in science education.","authors":["Rose Pecay"],"meta":["April 2017Qualitative Report 22(4):1015-1030","DOI:10.46743/2160-3715/2017.2684"],"references":["297766000_Social_media_for_learning_and_teaching_undergraduate_sciences_Good_practice_guidelines_from_intervention","297612072_A_Systems_View_of_Creativity_in_a_YouTube_World","290211885_Researching_and_evaluating_digital_storytelling_as_a_distance_education_tool_in_physics_instruction_An_application_with_pre-service_physics_teachers","280085006_Self-regulated_learning_and_social_media_-_a_'natural_alliance'_Evidence_on_students'_self-regulation_of_learning_social_media_use_and_student-teacher_relationship","317953571_Qualitative_inquiry_research_design_Choosing_among_five_approaches","298332323_Using_Blogs_To_Enhance_Student_Engagement_And_Learning_In_The_Health_Sciences","288270826_Bracketing_in_Phenomenology_Only_Undertaken_in_the_Data_Collection_and_Analysis_Process","285691953_The_Interview_Data_Collection_in_Descriptive_Phenomenological_Human_Scientific_Research","272128138_iTube_YouTube_WeTube_Social_Media_Videos_in_Chemistry_Education_and_Outreach","270219835_Enhancing_Students'_NOS_Views_and_Science_Knowledge_Using_Facebook-based_Scientific_News"]}