{"id":"316909090_Weaving_as_Binary_Art_and_the_Algebra_of_Patterns","abstract":"To refer to the Jacquard loom as a precursor of the computer is a common narrative in histories of computing beginning with Ada Lovelace comparing the punched card operated loom with the calculating engine designed by Charles Babbage: “We may say most aptly that the Analytical Engine weaves algebraical patterns just as the Jacquard-loom weaves flowers and leaves.” But this does not mean that Jacquard invented the algebra of patterns. He only constructed the first widely known and used mechanism replacing the drawboy by punched cards to feed pattern information into his mechanism. To control a weave means to decide whether a warp thread is to be picked up or not. Weaving has therefore been a binary art from its very beginning, applying operations of pattern algebra for millennia. Jacquard’s cards were the end of this story rather than its beginning, reducing the weaver to an operator who had to step on a single treadle repeatedly. This article argues that algebra is already involved in operating shafts or heddles on ordinary looms, that this algebra was applied tacitly until the first weaving notations were developed, and that these notations make the tacit algebra of patterns recognizable to non-weavers: inventors and engineers.","authors":["Ellen Harlizius-Klück"],"meta":["April 2017Textile The Journal of Cloth and Culture 15(2):176-197","DOI:10.1080/14759756.2017.1298239","Project: Weaving Codes - Coding Weaves"],"references":["238283008_On_Alan_Turing_and_the_Origins_of_Digital_Computers","235290574_Analog_digital_and_the_cybernetic_illusion","226971155_The_Arithmetic-Algebra_Connection_A_Historical-Pedagogical_Perspective","267665367_It_began_with_Babbage_The_genesis_of_computer_science","265306553_Das_geistige_Umfeld_der_Informationstechnik","249686279_The_Future_Looms_Weaving_Women_and_Cybernetics","245827843_CyberneticsKybernetik_the_Macy_Foundation_Conferences_1946-1953","239570606_The_Origins_of_Digital_Computers_Selected_Papers","233585463_Mistaken_Ancestry_The_Jacquard_and_the_Computer","221395961_Computer_prehistory_and_history_in_central_Europe","220689856_Jacquard's_web_-_how_a_hand-loom_led_to_the_birth_of_the_information_age","46544268_Inventive_Activity_in_the_British_Textile_Industry_1700-1800","40305683_Technologie_der_Handweberei_ein_Lehr-_und_Lernbehelf_fur_Webeschulen_gewerbliche_und_hohere_technische_Schulen_sowie_zum_Selbstunterrichte_fur_Webereibeflissene_I_Teil_Die_Schaftweberei"]}