{"id":"317038309_Multilevel_Multivariate_Meta-analysis_with_Application_to_Choice_Overload","abstract":"We introduce multilevel multivariate meta-analysis methodology designed to account for the complexity of contemporary psychological research data. Our methodology directly models the observations from a set of studies in a manner that accounts for the variation and covariation induced by the facts that observations differ in their dependent measures and moderators and are nested within, for example, papers, studies, groups of subjects, and study conditions. Our methodology is motivated by data from papers and studies of the choice overload hypothesis. It more fully accounts for the complexity of choice overload data relative to two prior meta-analyses and thus provides richer insight. In particular, it shows that choice overload varies substantially as a function of the six dependent measures and four moderators examined in the domain and that there are potentially interesting and theoretically important interactions among them. It also shows that the various dependent measures have differing levels of variation and that levels up to and including the highest (i.e., the fifth, or paper, level) are necessary to capture the variation and covariation induced by the nesting structure. Our results have substantial implications for future studies of choice overload.","authors":["Blakeley B McShane","Ulf Bockenholt"],"meta":["May 2017Psychometrika 83(6)","DOI:10.1007/s11336-017-9571-z"],"references":["312870153_Single_Paper_Meta-analysis_Benefits_for_Study_Summary_Theory-testing_and_Replicability","280117028_You_Cannot_Step_Into_the_Same_River_Twice_When_Power_Analyses_Are_Optimistic","272560353_The_Visual_Preference_Heuristic_The_Influence_of_Visual_versus_Verbal_Depiction_on_Assortment_Processing_Perceived_Variety_and_Choice_Overload","265170803_Choice_Overload_A_Conceptual_Review_and_Meta-Analysis","344485006_The_Adaptive_Decision_Maker","324352569_The_Adaptive_Decision_Maker","313759679_A_power_primer","308760403_Adjusting_for_Publication_Bias_in_Meta-Analysis","291786346_The_Paradox_of_Choice_Why_More_is_Less","271196714_New_Look_at_Statistical-Model_Identification"]}