{"id":"317031415_Short_Project-Based_Learning_with_MATLAB_Applications_to_Support_the_Learning_of_Video-Image_Processing","abstract":"University courses concerning Computer Vision and Image Processing are generally taught using a traditional methodology that is focused on the teacher rather than on the students. This approach is consequently not effective when teachers seek to attain cognitive objectives involving their students’ critical thinking. This manuscript covers the development, implementation and assessment of a short project-based engineering course with MATLAB applications Multimedia Engineering being taken by Bachelor’s degree students. The principal goal of all course lectures and hands-on laboratory activities was for the students to not only acquire image-specific technical skills but also a general knowledge of data analysis so as to locate phenomena in pixel regions of images and video frames. This would hopefully enable the students to develop skills regarding the implementation of the filters, operators, methods and techniques used for image processing and computer vision software libraries. Our teaching-learning process thus permits the accomplishment of knowledge assimilation, student motivation and skill development through the use of a continuous evaluation strategy to solve practical and real problems by means of short projects designed using MATLAB applications. Project-based learning is not new. This approach has been used in STEM learning in recent decades. But there are many types of projects. The aim of the current study is to analyse the efficacy of short projects as a learning tool when compared to long projects during which the students work with more independence. This work additionally presents the impact of different types of activities, and not only short projects, on students’ overall results in this subject. Moreover, a statistical study has allowed the author to suggest a link between the students’ success ratio and the type of content covered and activities completed on the course. The results described in this paper show that those students who took part in short projects made a significant improvement when compared to those who participated in long projects.","authors":["Pablo Gil"],"meta":["October 2017Journal of Science Education and Technology 26(5)","DOI:10.1007/s10956-017-9695-z"],"references":[]}