{"id":"317083797_Hamming_Embedding_and_Weak_Geometric_Consistency_for_Large_Scale_Image_Search","abstract":"This paper improves recent methods for large scale image search. State-of-the-art methods build on the bag-of-features image\nrepresentation. We, first, analyze bag-of-features in the framework of approximate nearest neighbor search. This shows the\nsub-optimality of such a representation for matching descriptors and leads us to derive a more precise representation based\non 1) Hamming embedding (HE) and 2) weak geometric consistency constraints (WGC). HE provides binary signatures that refine\nthe matching based on visual words. WGC filters matching descriptors that are not consistent in terms of angle and scale.\nHE and WGC are integrated within the inverted file and are efficiently exploited for all images, even in the case of very\nlarge datasets. Experiments performed on a dataset of one million of images show a significant improvement due to the binary\nsignature and the weak geometric consistency constraints, as well as their efficiency. Estimation of the full geometric transformation,\ni.e., a re-ranking step on a short list of images, is complementary to our weak geometric consistency constraints and allows\nto further improve the accuracy.","authors":["Hervé Jégou","Matthijs Douze","Cordelia Schmid"],"meta":["October 2008","DOI:10.1007/978-3-540-88682-2_24","SourceOAI","Conference: Proceedings of the 10th European Conference on Computer Vision: Part I"],"references":["319770310_City-Scale_Location_Recognition","313527089_Distinctive_image_features_from_scale-invariant_key_points","239443282_Robust_Scalable_Recognition_with_a_Vocabulary_Tree","224744237_Video_Google_A_Text_Retrieval_Approach_to_Object_Matching_in_Videos","224323294_Lost_in_Quantization_Improving_Particular_Object_Retrieval_in_Large_Scale_Image_Databases","222521233_Robust_Wide_Baseline_Stereo_from_Maximally_Stable_Extremal_Regions","221364404_Small_codes_and_large_image_databases_for_recognition","221364129_A_Binning_Scheme_for_Fast_Hard_Drive_Based_Image_Search","221361339_City-Scale_Location_Recognition","221361304_Object_retrieval_with_large_vocabularies_and_fast_spatial_matching"]}