{"id":"317070004_The_multi-port_berth_allocation_problem_with_speed_optimization_and_emission_considerations","abstract":"The container shipping industry faces many interrelated challenges and opportunities, as its role in the global trading system has become increasingly important over the last decades. On the one side, collaboration between port terminals and shipping liners can lead to costs savings and help achieve a sustainable supply chain, and on the other side, the optimization of operations and sailing times leads to reductions in bunker consumption and, thus, to fuel cost and air emissions reductions. To that effect, there is an increasing need to address the integration opportunities and environmental issues related to container shipping through optimization. This paper focuses on the well known Berth Allocation Problem (BAP), an optimization problem assigning berthing times and positions to vessels in container terminals. We introduce a novel mathematical formulation that extends the classical BAP to cover multiple ports in a shipping network under the assumption of strong cooperation between shipping lines and terminals. Speed is optimized on all sailing legs between ports, demonstrating the effect of speed optimization in reducing the total time of the operation, as well as total fuel consumption and emissions. Furthermore, the model implementation shows that an accurate speed discretization can result in far better economic and environmental results.","authors":["Giada Venturini","Cagatay Iris","Christos A Kontovas","Allan Larsen"],"meta":["July 2017Transportation Research Part D Transport and Environment 54:142-159","DOI:10.1016/j.trd.2017.05.002"],"references":["298771814_A_Survey_on_the_Ship_Loading_Problem","313455675_Green_approaches_at_sea_-_The_benefits_of_adjusting_speed_instead_of_anchoring","309541927_The_waterway_ship_scheduling_problem","303696390_Combinatorial_Approach_to_Exactly_Solving_Discrete_and_Hybrid_Berth_Allocation_Problem","302984964_Ocean_Container_Transport_in_Global_Supply_Chains_Overview_and_Research_Opportunities","299444883_Reducing_speed_and_fuel_transfer_of_the_Green_Flag_Incentive_Program_in_Kaohsiung_Port_Taiwan","292677959_The_fleet_deployment_problem_with_variable_vessel_sailing_speeds_and_port_handling_times","292355634_Slow_Steaming_in_Maritime_Transportation_Fundamentals_Trade-offs_and_Decision_Models","292355347_Competition_and_Co-operation_in_Maritime_Logistics_Operations","292354968_Container_Port_Competition_in_Europe"]}