{"id":"317014171_Body-worn_triaxial_accelerometer_coherence_and_reliability_related_to_static_posturography_in_unilateral_vestibular_failure_Impiego_degli_accelerometri_triassiali_nel_deficit_vestibolare_unilaterale_a","abstract":"Since changes in vestibular function may be one cause of disequilibrium, major advances in measuring postural control and sensory integration in vestibular impairments have been achieved by using posturography. However, in order to overcome problems related to this type of technology, body-worn accelerometers (ACC) have been proposed as a portable, low-cost alternative to posturography for measurements of postural sway in a friendly and ecologic environment. Due to the fact that no study to date has shown the experimental validity of ACC-based measures of body sway with respect to posturography for subjects with vestibular deficits, the aim of the present study was: i) to develop and validate a practical tool that can allow clinicians to measure postural sway derangements in an otoneurological setting by ACC, and ii) to provide reliable, sensitive and accurate automatic analysis of sway that could help in discriminating unilateral vestibular failure (UVF) patients. Thus, a group of 13 patients (seven females, 6 males; mean age 48.6 ± 6.4 years) affected for at least 6 months by UVF and 13 matched healthy subjects were instructed to maintain an upright position during a static forceplate-based posturography (FBP) acquisition while wearing a Movit ® sensor (by Captiks) with 3-D accelerometers mounted on the posterior trunk near the body centre of mass. Pearson product moment correlation demonstrated a high level of correspondence of four time-domain and three frequency-domain measures extracted by ACC and FBP testing; in addition, t-test demonstrated that two ACC-based time-and frequency-domain parameters were reliable measures in discriminating UVF subjects. These aspects, overall, should further highlight the attention of clinicians and researchers to this kind of sway recording technique in the field of otoneurological disorders by considering the possibility to enrich the amount of quantitative and qualitative information useful for discrimination, diagnosis and treatment of UVF. In conclusion, we believe the present ACC-based measurement of sway offers a patient-friendly, reliable, inexpensive and efficient alternative recording technique that is useful-together with clinical balance and mobility tests-in various circumstances, as well as in outcome studies involving diagnosis, follow-up and rehabilitation of UVF patients. KEY WORDS: Accelerometer • Unilateral vestibular failure • Static posturography • Video Head Impulse Test RIASSUNTO Poichè le alterazioni della funzione vestibolare possono essere causa di disequilibrio, i principali reperti sviluppati ad oggi per misurare il controllo posturale e l'integrazione sensoriale nel danno vestibolare sono stati ottenuti grazie alla posturografia. Tuttavia, al fine di superare i problemi legati a tale genere di tecnologia, sono stati proposti gli accelerometri indossabili (ACC) come un'alternativa portatile e a basso costo per la misurazione dell'oscillazione corporea in ambienti confortevoli. D'altro canto, nessuno studio ad oggi ha dimostrato la validità sperimentale delle misura-zioni ottenute con ACC-rispetto a quelle derivanti dalla posturografia-in soggetti affetti da deficit vestibolare. Pertanto, l'obiettivo del presente lavoro è stato quello di i) sviluppare e validare una strumentazione pratica che potesse consentire la misurazione dei disordini dell'oscillazione corporea nell'ambito della valutazione otoneurologica attraverso gli ACC e ii) fornire un'analisi delle oscillazioni affidabile ed automatica, che potesse implementare in modo sensibile ed accurato la possibile discriminazione di pazienti affetti da deficit vestibolare unilaterale (UVF). A tale scopo, un gruppo di 13 pazienti (sette femmine, 6 maschi; età media 48.6 ± 6.4 anni) affetti da UVF da almeno 6 mesi e un altro omogeneo di 13 soggetti sani sono stati invitati a mantenere la posizione eretta durante l'esecuzione della posturografia statica (FBP) mentre indossavano a livello lombare-vicino al centro di massa-un sensore Movit ® (by Captiks) costituito da accelerometri 3-D. La correlazione 'product-moment' secondo Pearson ha dimostrato un elevato livello di corrispondenza di quattro misure, estratte da ACC e da FBP, nel dominio del tempo e di tre in quello della frequenza. Inoltre il t-test ha evidenziato che due parametri nel dominio del tempo e due in quello della frequenza si sono dimostrati affidabili nel discriminare i soggetti affetti da UVF. Tali aspetti, nel loro complesso, dovrebbero focalizzare l'attenzione in ambito clinico e di ricerca su tale tecnica di registrazione, considerato l'arricchimento quantitativo e qualitativo di informazioni utili nella discriminazione, diagnosi e trattamento di pazienti affetti da UVF. In conclusione, noi riteniamo che la misurazione basata su ACC offra un'alternativa confortevole, affidabile, economica ed efficiente utile, assieme ai test clinici di equilibrio e mobilità, in molteplici circostanze così come negli studi implicati nella diagnosi, controllo e riabilitazione di pazienti affetti da UVF. PAROLE CHIAVE: Accelerometro • Deficit vestibolare unilaterale • Posturografia statica • Video test impulsivo del capo M. Alessandrini et al. 232","authors":["M Alessandrini","Alessandro Micarelli","Andrea Viziano","I Pavone"],"meta":["June 2017Acta otorhinolaryngologica Italica: organo ufficiale della Società italiana di otorinolaringologia e chirurgia cervico-facciale 37(3):231-236","DOI:10.14639/0392-100X-1334"],"references":["312613354_Vestibular_impairment_in_Multiple_Chemical_Sensitivity_Component_analysis_findings","261607159_A_quantitative_analysis_of_gait_patterns_in_vestibular_neuritis_patients_using_gyroscope_sensor_and_a_continuous_walking_protocol","233939593_Detection_of_isolated_covert_saccades_with_the_video_head_impulse_test_in_peripheral_vestibular_disorders","230721640_ISway_A_sensitive_valid_and_reliable_measure_of_postural_control","304029088_Wearable_Inertial_Sensors_for_Human_Movement_Analysis","270658445_Validation_of_an_accelerometer-based_fall_prediction_model","260023293_Validation_of_a_Body-Worn_Accelerometer_to_Measure_Activity_Patterns_in_Octogenarians"]}