{"id":"317003905_Triangular_intuitionistic_fuzzy_number_theory_for_driver-pedestrians_interactions_and_risk_exposure_modeling","abstract":"We travel every day as pedestrians on the road network, if only for a short time, in order to reach another means of transport. But this activity is not as risk-free as it should be. These accidents represent the product of an overall system combining the individual behaviors of pedestrians and drivers, transport activity, and the environmental system, under conditions that make these malfunctions both predictable and avoidable. This predictive skill is an essential step in ensuring the safety of pedestrians in road traffic. In this paper, we use intuitionistic fuzzy number theory in order to model the exposure of pedestrians to the accidents risks by new indicators. This approach aligns the behavioral psychology of pedestrians and drivers with intuitive methods based on the theory of fuzzy sets. A software solution is developed for this instance by reusing the models of pedestrian simulation developed in our previous works. The attempt in this article considers a novelty in partial aspect of risk modeling. The fuzzy intuitionistic theory has the flexibility to investigate hesitation and indecision. Some other behavioral and environmental factors must be taken into account in order to explore deeply the issue.","authors":["Meriem MANDAR","Lamia Karim","Azedine Boulmakoul","Ahmed Lbath"],"meta":["June 2017Procedia Computer Science 109","DOI:10.1016/j.procs.2017.05.309","Project: Système intelligent réactif abductif et raisonnement en logique intuitionniste floue pour l’analyse de la dangerosité de l’interaction conducteur-piéton : élaboration des nouvelles mesures d'exposition aux risques d'accidents"],"references":["308778045_Pedestrians'_fuzzy_intuitionistic_risk_exposure_model_foundation_and_first_development","297869916_Un_systeme_intelligent_temps_reel_base_sur_des_variables_temporelles_floues_gaussiennes_pour_la_generation_des_messages_d'alerte_concernant_la_dangerosite_de_la_conduite_face_aux_pietons_sur_route_et_","283805334_Attitudinal_ranking_and_correlated_aggregating_methods_for_multiple_attribute_group_decision_making_with_triangular_intuitionistic_fuzzy_Choquet_integral","267451555_Virtual_pedestrians'_risk_modeling","262772215_Operators_and_Comparisons_of_Hesitant_Fuzzy_Linguistic_Term_Sets","233785212_Fuzzy_Ant_Colony_Paradigm_for_Virtual_Pedestrian_Simulation","309457075_Intuitionistic_fuzzy_sets","305512431_Consistency_in_MCGDM_Problems_with_Intuitionistic_Fuzzy_Preference_Relations_Based_on_an_Exponential_Score_Function","257796342_An_Atanassov's_intuitionistic_fuzzy_multi-attribute_group_decision_making_method_based_on_entropy_and_similarity_measure","256992299_Intuitionistic_Fuzzy_Sets_Fuzzy_Sets_Syst"]}