{"id":"317048810_Irregular_migratory_flows_Towards_an_ICTs'_enabled_integrated_framework_for_resilient_urban_systems","abstract":"Purpose\nThe purpose of this study is to navigate the challenges irregular migratory flows generate for cities and urban systems. The migration and refugee crises that challenged Europe in 2015-2016 revealed that the developed world cities and urban areas are largely unprepared to address challenges that irregular migratory flows generate. This paper queries the smart and resilient cities’ debates, respectively, to highlight that migration-related challenges and opportunities have not been explicitly addressed in those deliberations. This creates a disconnect between what these debates promise and what cities/urban systems increasingly need to address on a daily basis. Subsequently, a way of bridging that disconnect is proposed and its policy-making implications discussed.\n\nDesign/methodology/approach\nTo suggest ways of navigating irregular migration-inflicted challenges cities/urban areas face, a nexus between the smart cities and resilient cities’ debates is established. By placing advanced sophisticated information and communication technologies (ICTs) at the heart of the analysis, a novel dynamic ICTs’ enabled integrated framework for resilient urban systems is developed. The framework’s dynamics is defined by two hierarchically interconnected levers, i.e. that of ICTs and that of policy-design and policy-making. Drawing from qualitative analysis and process tracing, the cross-section of policy design and policy-making geared towards the most efficient and ethically sensitive use of sophisticated ICTs is queried. Subsequently, options available to cities/urban systems are discussed.\n\nFindings\nThe ICTs’ enabled integrated framework for resilient urban systems integrates the effectiveness of migrants and refugees’ policy design and policy-making in human-centred thinking, planning and policy-design for resilient urban systems. It places resilient approaches in the spotlight of research and policy-making, naming them the most effective methods for promoting a humanistic smart cities and resilient urban systems vision. It highlights critical junctions that urban systems’ stakeholders must consider if the promise of emerging sophisticated ICTs is to be employed effectively for the entire society, including its most vulnerable members.\n\nResearch limitations/implications\nFirst, when designing ICTs’ enabled integrated resilient urban systems, the key stakeholders involved in the policy-design and policy-making process, including local, national and regional authorities, must employ a holistic view to the urban systems seen through the lens of hard and soft concerns as well as considerations expressed by the receiving and incoming populations. Second, the third-sector representatives, including non-governmental organizations (NGOs) and other actors, need to be seen as peers in integrated humanistic networks, thereby contributing critical, unbiased knowledge flows to infrastructures, which promote fair and inclusive participation of migrants and refugees in local economies.\n\nPractical implications\nThe ICTs’ enabled integrated framework for resilient urban systems promotes a humanistic smart cities’ and resilient urban systems’ vision. It suggests how to design and implement policies apt to meet the needs of both receiving and incoming populations along value chains specific to smart and resilient cities. It promotes emerging sophisticated ICTs as the subtle, yet key, enabler of data ecosystems and customized services capable of responding to critical societal needs of the receiving and the incoming populations. In addition, the framework suggests options, alternatives and strategies for urban systems’ stakeholders, including the authorities, businesses, NGOs, inhabitants and ICTs’ providers and vendors.\n\nOriginality/value\nThe value added of this paper is three-fold. At the conceptual level, by bringing together the smart cities and resilient cities debates, and incorporating sophisticated ICTs in the analysis, it makes a case for their usefulness for cities/urban areas in light of challenges these cities/urban areas confront each day. At the empirical level, this analysis maps the key challenges that cities and their stakeholders face in context of migratory flows and highlights their dual nature. At the policy-making level, this study makes a case for a sound set of policies and actions that boost effective use of ICTs beyond the smart technology hype.","authors":["Anna Visvizi","Colette Mazzucelli","Miltiadis Lytras"],"meta":["July 2017","DOI:10.1108/JSTPM-05-2017-0020"],"references":["317290293_Querying_the_Ethics_of_Data_Collection_as_a_Community_of_Research_and_Practice_The_Movement_toward_the_Liberalism_of_Fear_to_Protect_the_Vulnerable","308961054_The_next_wave_of_innovation-Review_of_smart_cities_intelligent_operation_systems","308947922_The_twin_migration_and_refugee_crises_in_Europe_examining_the_OECD's_contribution_to_the_debate","308181674_Secular_States_in_a_Security_Community_The_Migration-Terrorism_Nexus","301271847_Urban_Computing_and_Smart_Cities_Applications_for_the_Knowledge_Society","328882923_Smart_Urban_Solutions_for_Innovation_and_Sustainability_Emerging_Research_and_Opportunities","320149541_Chapter_8_Impacts_of_immigration_to_developing_countries","281748845_The_Net_Delusion_The_Dark_Side_of_Internet_Freedom"]}