{"id":"317086403_Fuel_Purpose_Hydrotreating_of_Free_Fatty_Acid_By-products_and_Heavy_Straight_Run_Gas_Oil","abstract":"The European Union (EU) has set a target in the 2009/28/EC directive, which aims that the share of biofuels in transportation has to be at least 10 energy % in 2020. However, only half of this target can be met by first generation biofuels (produced from sugars, oil crops, etc.). For this reason, the EU supports and encourages the development and application of advanced biofuels (0.5 energy % indicative target in 2015/1513/EC directive). So, the research and development of newer generation biofuels for Diesel engines are important, due to the high level gas oil consumption of the EU. Nowadays, the most widely used biocomponent of gas oils is biodiesel, which consists of a mixture of various fatty acid methyl esters (FAME) and has many disadvantages. The actual diesel fuel product standard of EU (EN 590:2013) limits the blending rate of biodiesel to 7.0 V/V % and the preEN 16734 limits biodiesel to 10.0 V/V% maximum. .\nBiodiesel could be replaced by bio gas oil, which is produced by catalytic hydrogenation of triglycerides and/or fatty acids from different origins (e.g. wastes, animal fats). Bio gas oil is a mixture of n- and iso-paraffins in gas oil boiling range and they are the most favourable energy source for running Diesel engines. The second generation bio gas oil is an excellent gas oil blending component and it is preferred by the car manufacturers, too. Consequently, the aim of our research work was to produce advanced biofuel, a gas oil blending component with bio gas oil content from waste feedstock.\nDuring our experiments we investigated the fuel purpose hydrogenation of waste free fatty acid by-products of vegetable oil processing (0 %, 3 %, 5 %, 10 %, 20 %) and heavy straight run gas oil mixtures on a commercial NiMo/Al2O3 catalyst. The effects of feed compositions and process parameters (temperature, pressure, liquid hourly space velocity (LHSV), hydrogen/feedstock ratio) on the quality and quantity of the main product were investigated. The applied process parameters were the following: P = 40 - 50 - 60 bar, T = 300 - 375 °C, LSHV = 1.0 - 2.0 h-1, hydrogen/feedstock ratio = 400 Nm3/m3.","authors":["Dániel Sági","András Holló","G. Varga","Jenő Hancsók"],"meta":["January 2016Chemical Engineering Transactions 52:883-888","DOI:10.3303/CET1652148"],"references":[]}