{"id":"317062237_Statistical_physics_of_human_cooperation","abstract":"Extensive cooperation among unrelated individuals is unique to humans, who often sacrifice personal benefits for the common good and work together to achieve what they are unable to execute alone. The evolutionary success of our species is indeed due, to a large degree, to our unparalleled other-regarding abilities. Yet, a comprehensive understanding of human cooperation remains a formidable challenge. Recent research in social science indicates that it is important to focus on the collective behavior that emerges as the result of the interactions among individuals, groups, and even societies. Non-equilibrium statistical physics, in particular Monte Carlo methods and the theory of collective behavior of interacting particles near phase transition points, has proven to be very valuable for understanding counterintuitive evolutionary outcomes. By studying models of human cooperation as classical spin models, a physicist can draw on familiar settings from statistical physics. However, unlike pairwise interactions among particles that typically govern solid-state physics systems, interactions among humans often involve group interactions, and they also involve a larger number of possible states even for the most simplified description of reality. The complexity of solutions therefore often surpasses that observed in physical systems. Here we review experimental and theoretical research that advances our understanding of human cooperation, focusing on spatial pattern formation, on the spatiotemporal dynamics of observed solutions, and on self-organization that may either promote or hinder socially favorable states.","authors":["Matjaz Perc","Jillian J Jordan","David G. Rand","Zhen Wang"],"meta":["May 2017Physics Reports 687","DOI:10.1016/j.physrep.2017.05.004"],"references":["325256573_Evolutionary_games_on_multilayer_networks_A_colloquium","315696283_Onymity_promotes_cooperation_in_social_dilemma_experiments","314115479_Role-separating_ordering_in_social_dilemmas_controlled_by_topological_frustration","346201365_WHY_DO_POPULATIONS_CYCLE_A_SYNTHESIS_OF_STATISTICAL_AND_MECHANISTIC_MODELING_APPROACHES","323983030_Profit_versus_Prejudice_Harnessing_Self-Interest_to_Reduce_In-Group_Bias","323138850_Scaling_laws_for_ising_models_near_T_c","322264209_Profit_Versus_Prejudice_Harnessing_Self-Interest_to_Reduce_In-Group_Bias","317998069_Third-Party_Punishment_as_a_Costly_Signal_of_High_Continuation_Probabilities_in_Repeated_Games","315845402_Third-party_punishment_as_a_costly_signal_of_high_continuation_probabilities_in_repeated_games","315334244_On_the_Determinants_of_Cooperation_in_Infinitely_Repeated_Games_A_Survey"]}