{"id":"317096537_Female_peer_mentors_early_in_college_increase_women's_positive_academic_experiences_and_retention_in_engineering","abstract":"Scientific and engineering innovation is vital for American competitiveness, quality of life, and national security. However, too few American students, especially women, pursue these fields. Although this problem has attracted enormous attention, rigorously tested interventions outside artificial laboratory settings are quite rare. To address this gap, we conducted a longitudinal field experiment investigating the effect of peer mentoring on women's experiences and retention in engineering during college transition, assessing its impact for 1 y while mentoring was active, and an additional 1 y after mentoring had ended. Incoming women engineering students (n = 150) were randomly assigned to female or male peer mentors or no mentors for 1 y. Their experiences were assessed multiple times during the intervention year and 1-y postintervention. Female (but not male) mentors protected women's belonging in engineering, self-efficacy, motivation, retention in engineering majors, and postcollege engineering aspirations. Counter to common assumptions, better engineering grades were not associated with more retention or career aspirations in engineering in the first year of college. Notably, increased belonging and self-efficacy were significantly associated with more retention and career aspirations. The benefits of peer mentoring endured long after the intervention had ended, inoculating women for the first 2 y of college-the window of greatest attrition from science, technology, engineering, and mathematics (STEM) majors. Thus, same-gender peer mentoring for a short period during developmental transition points promotes women's success and retention in engineering, yielding dividends over time.","authors":["Tara C. Dennehy","Nilanjana Dasgupta"],"meta":["May 2017Proceedings of the National Academy of Sciences 114(23)","DOI:10.1073/pnas.1613117114"],"references":["305786544_Masculinities_and_experimental_practices_in_physics_The_view_from_three_case_studies","305786406_Gender_discrimination_in_physics_and_astronomy_Graduate_student_experiences_of_sexism_and_gender_microaggressions","304169165_Solving_the_Equation_The_Variables_for_Women's_Success_in_Engineering_and_Computing","279977912_Girls_and_Women_in_Science_Technology_Engineering_and_Mathematics_STEMing_the_Tide_and_Broadening_Participation_in_STEM_Careers","274644414_Female_peers_in_small_work_groups_enhance_women's_motivation_verbal_participation_and_career_aspirations_in_engineering","346426723_Effectiveness_of_Mentoring_Programs_for_Youth_A_Meta-Analytic_Review","309331135_Fear_appeals_engagement_and_examination_performance_The_role_of_challenge_and_threat_appraisals","281679450_Stereotype_Threat","281453175_The_American_Freshman_National_Norms_Fall_2014","276831291_Engineering_Exchanges_Daily_Social_Identity_Threat_Predicts_Burnout_Among_Female_Engineers"]}