{"id":"317052324_Automatic_Optic_Disc_Abnormality_Detection_in_Fundus_Images_A_Deep_Learning_Approach","abstract":"Optic disc (OD) is a key structure in retinal images. It serves as an indicator to detect various diseases such as glaucoma and changes related to new vessel formation on the OD in diabetic retinopathy (DR) or retinal vein occlusion. OD is also essential to locate structures such as the macula and the main vascular arcade. Most existing methods for OD localization are rule-based, either exploiting the OD appearance proper- ties or the spatial relationship between the OD and the main vascular arcade. The detection of OD abnormalities has been performed through the detection of lesions such as hemorrhaeges or through measuring cup to disc ratio. Thus these methods result in complex and in exible im- age analysis algorithms limiting their applicability to large image sets obtained either in epidemiological studies or in screening for retinal or optic nerve diseases. In this paper, we propose an end-to-end supervised model for OD abnormality detection. The most informative features of the OD are learned directly from retinal images and are adapted to the dataset at hand. Our experimental results validated the effectiveness of this current approach and showed its potential application.","authors":["Hanan Saleh Alghamdi","Hongying Lilian Tang","Saad A. Waheeb","Tünde Petö"],"meta":["October 2016","DOI:10.17077/omia.1042","Conference: Ophthalmic Medical Image Analysis Third International Workshop"],"references":["295102911_Optic_Cup_Segmentation_Based_on_Extracting_Blood_Vessel_Kinks_and_Cup_Thresholding_Using_type-II_Fuzzy_Approach","284723118_Optic_Disc_and_Optic_Cup_Segmentation_Methodologies_for_Glaucoma_Image_Detection_A_Survey","277411157_Deep_Learning","331887758_Level_Set_Segmentation_of_Optic_Discs_from_Retinal_Images","308833212_Measurement_of_optical_cup-to-disc_ratio_in_fundus_images_for_glaucoma_screening","300345551_Boosting_Convolutional_Filters_with_Entropy_Sampling_for_Optic_Cup_and_Disc_Image_Segmentation_from_Fundus_Images","285796434_An_efficient_automated_system_for_glaucoma_detection_using_fundus_image","267960550_ImageNet_Classification_with_Deep_Convolutional_Neural_Networks","267734955_Novel_Accurate_and_Fast_Optic_Disc_Detection_in_Retinal_Images_With_Vessel_Distribution_and_Directional_Characteristics","263564119_DeepFace_Closing_the_Gap_to_Human-Level_Performance_in_Face_Verification"]}