{"id":"317013386_Exploring_Bebras_Tasks_Content_and_Performance_A_Multinational_Study","abstract":"Although there is no universal agreement that students should learn programming, many countries have reached a consensus on the need to expose K-12 students to Computational Thinking (CT). When, what and how to teach CT in schools are open questions and we attempt to address them by examining how well students around the world solved problems in recent Bebras challenges. We collected and analyzed performance data on Bebras tasks from 115,400 students in grades 3–12 in seven countries. Our study provides further insight into a range of questions addressed in smaller-scale inquiries, in particular about the possible impact of schools systems and gender on students' success rate. In addition to analyzing performance data of a large population, we have classified the considered tasks in terms of CT categories, which should account for the learning implications of the challenge. Algorithms and data representation dominate the challenge, accounting for 75–90% of the tasks, while other categories such as abstraction, parallelization and problem decomposition are sometimes represented by one or two questions at various age groups. This classification can be a starting point for using online Bebras tasks to support the effective learning of CT concepts in the classroom.","authors":["Cruz Izu","Claudio Mirolo","Amber Settle","Linda Mannila"],"meta":["April 2017Informatics in Education 16(1):39-59","DOI:10.15388/infedu.2017.03"],"references":["356355884_Predicting_the_Difficulty_Level_of_a_Bebras_Task","312222095_Introducing_computational_thinking_through_a_contest_on_informatics_Problem-solving_and_gender_issues","308499063_It's_Computational_Thinking_Bebras_Tasks_in_the_Curriculum","308497335_A_New_Informatics_Curriculum_for_Secondary_Education_in_The_Netherlands","308497334_How_to_Attract_the_Girls_Gender-Specific_Performance_and_Motivation_in_the_Bebras_Challenge","303943002_A_Framework_for_Computational_Thinking_Based_on_a_Systematic_Research_Review","324373353_Mindstorms_Children_Computers_and_Powerful_Ideas","315029890_Gendered_Selection_of_STEM_Subjects_for_Matriculation","311314199_A_review_of_models_for_introducing_computational_thinking_computer_science_and_computing_in_K-12_education","308497156_Analyzing_Conceptual_Content_of_International_Informatics_Curricula_for_Secondary_Education"]}