{"id":"317087807_Anatomically_Constrained_Neural_Networks_ACNN_Application_to_Cardiac_Image_Enhancement_and_Segmentation","abstract":"Incorporation of prior knowledge about organ shape and location is key to improve performance of image analysis approaches. In particular, priors can be useful in cases where images are corrupted and contain artefacts due to limitations in image acquisition. The highly constrained nature of anatomical objects can be well captured with learning based techniques. However, in most recent and promising techniques such as CNN based segmentation it is not obvious how to incorporate such prior knowledge. State-of-the-art methods operate as pixel-wise classifiers where the training objectives do not incorporate the structure and inter-dependencies of the output. To overcome this limitation, we propose a generic training strategy that incorporates anatomical prior knowledge into CNNs through a new regularisation model, which is trained end-to-end. The new framework encourages models to follow the global anatomical properties of the underlying anatomy (e.g. shape, label structure) via learned non-linear representations of the shape. We show that the proposed approach can be easily adapted to different analysis tasks (e.g. image enhancement, segmentation) and improve the prediction accuracy of the state-of-the-art models. The applicability of our approach is shown on multi-modal cardiac datasets and public benchmarks. Additionally, we demonstrate how the learned deep models of 3D shapes can be interpreted and used as biomarkers for classification of cardiac pathologies.","authors":["Ozan Oktay","Enzo Ferrante","Konstantinos Kamnitsas","Mattias Paul Heinrich"],"meta":["May 2017IEEE Transactions on Medical Imaging PP(99)","DOI:10.1109/TMI.2017.2743464","Project: Biomedical Image Segmentation"],"references":["314256462_Learning_and_Incorporating_Shape_Models_for_Semantic_Segmentation","313857891_A_Survey_on_Deep_Learning_in_Medical_Image_Analysis","312067495_Efficient_multi-scale_3D_CNN_with_fully_connected_CRF_for_accurate_brain_lesion_segmentation","311715357_Joint_Deep_Learning_of_Foreground_Background_and_Shape_for_Robust_Contextual_Segmentation","320968363_Photo-Realistic_Single_Image_Super-Resolution_Using_a_Generative_Adversarial_Network","313773442_Automatic_segmentation_of_the_right_ventricle_from_cardiac_MRI_using_a_learning-based_approach","313076136_Iterative_Multi-domain_Regularized_Deep_Learning_for_Anatomical_Structure_Detection_and_Segmentation_from_Ultrasound_Images","313072707_3D_U-Net_Learning_Dense_Volumetric_Segmentation_from_Sparse_Annotation","312771295_Image_quality_assessment_From_error_visibility_to_structural_similarity","311609405_Iterative_Instance_Segmentation"]}