{"id":"317012225_Identification_of_the_Emergent_Leaders_within_a_CSE_Professional_Development_Program","abstract":"The need for high quality, sustainable Computer Science Education (CSE) professional development (PD) at the grades K-12 level is essential to the success of the global CSE initiatives. This study investigates the use of Social Network Analysis (SNA) to identify emergent teacher leaders within a high quality CSE PD program. The CSE PD program was designed and implemented through collaboration between the computer science and teacher education units at a Midwestern metropolitan university in North America. A unique feature of this specific program is in the intentional development of a social network. This study discusses the importance of social networks, the development of social capital, and its impact on the sustainability of the goals of the CSE PD program. The role of emergent teacher leaders in the development of the social capital of the CSE PD cohort is investigated using SNA techniques. The cohort consisted of 16 in-service teachers in grades 6-12 representing seven districts and four distinct content areas. The instruments used involved a questionnaire and the results of a CSE PD program online course. The findings suggest a correlation between the emergent teacher leaders, the online course results, and the overall cohort social capital. Future uses of SNA within professional development programs are also discussed.","authors":["Tracie Reding","Brian Dorn","Neal Grandgenett","Harvey Siy"],"meta":["October 2016","DOI:10.1145/2978249.2978254","Conference: Proceedings of the 11th Workshop in Primary and Secondary Computing Education"],"references":["313513572_Network_measures_of_social_capital","301463409_Challenges_of_a_Computer_Science_Classroom_Initial_Perspectives_from_Teachers","317128320_An_Invitation_of_Reflexive_Sociology","312918756_Social_Capital_in_the_Creation_of_Human_Capital","289800758_Informal_Networks_The_Company","285955246_Social_Networks_and_Health_Models_Methods_and_Applications","280797032_The_ties_that_lead_A_social_network_approach_to_leadership","279593281_Social_Network_Theory_and_Analysis_A_Complementary_Lens_for_Inquiry","274799723_Diffusion_of_Innovations","272122569_How_teacher_leaders_influence_others_and_understand_their_leadership"]}