{"id":"317054365_DMFA-SR_Deeper_Membership_and_Friendship_Awareness_for_Social_Recommendation","abstract":"The existing social recommendation models mostly utilize various explicit user generated information. Although there exist a few researches adopting the implicit relationship between users for social recommendation, however, these researches did not consider the deeper social relationship, nor simultaneously take into account two or more deeper relationships between users from different angles. To this end, we propose a new deeper membership and friendship awareness for social recommendation. Specifically, we first calculate the deeper membership similarity between users utilizing the improved Jaccard Similarity Coefficient and the deeper friendship similarity between users using the proposed two-hop random walk algorithm (TH-RW). Second, the deeper membership similarity and the deeper friendship similarity are combined in a unified way to form a comprehensive deeper social relation similarity. Third, we adopt the matrix factorization method incorporating the deeper membership and the deeper friendship between users as a regularization term for social recommendation, and the corresponding comprehensive deeper social relationship similarity is regarded as the regularization parameter. Experiments on two real-world datasets demonstrate the superiority of the proposed recommendation model.","authors":["Lin Cui","Dechang Pi","Jing Zhang"],"meta":["May 2017IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2017.2704115"],"references":["319946166_Multiple_Structure-View_Learning_for_Graph_Classification","312654941_Positive_and_Unlabeled_Multi-Graph_Learning","310823634_Global_and_Local_Influence-based_Social_Recommendation","309689791_Social_Influence_Analysis_in_Social_Networking_Big_Data_Opportunities_and_Challenges","301222357_Toward_the_next_generation_of_recommender_systems_A_survey_of_the_state-of-the-art_and_possible_extensions","296951769_Social_recommender_systems","295699887_Matrix_factorization_techniques_for_recommender_systems","287854652_Social_recommender_system_tutorial","286963261_Exploiting_local_and_global_social_context_for_recommendation","282448788_SODE_Self-Adaptive_One-Dependence_Estimators_for_Classification"]}