{"id":"317020432_Gamified_Crowdsourcing_Conceptualization_Literature_Review_and_Future_Agenda","abstract":"Two parallel phenomena are gaining attention in human-computer interaction research: gamification and crowdsourcing. Because crowdsourcing's success depends on a mass of motivated crowdsourcees, crowdsourcing platforms have increasingly been imbued with motivational design features borrowed from games; a practice often called gamification. While the body of literature and knowledge of the phenomenon have begun to accumulate, we still lack a comprehensive and systematic understanding of conceptual foundations, knowledge of how gamification is used in crowdsourcing, and whether it is effective. We first provide a conceptual framework for gamified crowdsourcing systems in order to understand and conceptualize the key aspects of the phenomenon. The paper's main contributions are derived through a systematic literature review that investigates how gamification has been examined in different types of crowdsourcing in a variety of domains. This meticulous mapping, which focuses on all aspects in our framework, enables us to infer what kinds of gamification efforts are effective in different crowdsourcing approaches as well as to point to a number of research gaps and lay out future research directions for gamified crowdsourcing systems. Overall, the results indicate that gamification has been an effective approach for increasing crowdsourcing participation and the quality of the crowdsourced work; however, differences exist between different types of crowdsourcing: the research conducted in the context of crowdsourcing of homogenous tasks has most commonly used simple gamification implementations, such as points and leaderboards, whereas crowdsourcing implementations that seek diverse and creative contributions employ gamification with a richer set of mechanics.","authors":["Benedikt Morschheuser","Juho Hamari","Jonna Koivisto","Alexander Maedche"],"meta":["May 2017International Journal of Human-Computer Studies 106(26):43","DOI:10.1016/j.ijhcs.2017.04.005","Projects: Forest-human-machine interplay UNITEPeer-to-peer economies (sharing economy, crowdsourcing, crowdfunding)Crowd ScienceGamificationExamining and designing gamified crowdsourcing systems"],"references":["315473506_This_role_is_also_that_of_Science","312835097_A_Gamification_Framework_for_Volunteered_Geographic_Information","318494438_Flow_the_psychology_of_optimal_experience","317953663_Self-Efficacy_Toward_a_Unifying_Theory_of_Behavioral_Change","315334149_Tapping_the_Innovative_Business_Potential_of_Innovation_Contests","311492118_Expense_Control_A_Gamified_Semi-Automated_Crowd-Based_Approach_For_Receipt_Capturing","311492041_Product_X_An_Output-Agreement_Game_for_Product_Perceptual_Mapping","310501114_Designing_Cooperative_Gamification_Conceptualization_and_Prototypical_Implementation","309311435_What_constitutes_a_theoretical_contribution","309091784_Knowledge_Base_Refinement_with_Gamified_Crowdsourcing","308861569_Designing_a_gamification_mechanism_to_encourage_contributions_in_a_crowdsourcing_system","308857561_Toward_gamification_of_knowledge_base_construction","308815598_Current_Developments_in_Big_Data_and_Sustainability_Sciences_in_Mobile_Citizen_Science_Applications","308606668_The_sharing_economy_Why_people_participate_in_collaborative_consumption","308605825_Crowdsourcing_Code_and_Process_via_Code_Hunt"]}