{"id":"317057894_Integrative_clustering_of_multiple_genomic_data_types_using_a_joint_latent_variable_model_with_application_to_breast_and_lung_cancer_subtype_analysis","abstract":"Motivation: The molecular complexity of a tumor manifests itself at the genomic, epigenomic, transcriptomic and proteomic levels. Genomic profiling at these multiple levels should allow an integrated characterization of tumor etiology. However, there is a shortage of effective statistical and bioinformatic tools for truly integrative data analysis. The standard approach to integrative clustering is separate clustering followed by manual integration. A more statistically powerful approach would incorporate all data types simultaneously and generate a single integrated cluster assignment.\n\nMethods: We developed a joint latent variable model for integrative clustering. We call the resulting methodology iCluster. iCluster incorporates flexible modeling of the associations between different data types and the variance–covariance structure within data types in a single framework, while simultaneously reducing the dimensionality of the datasets. Likelihood-based inference is obtained through the Expectation–Maximization algorithm.\n\nResults: We demonstrate the iCluster algorithm using two examples of joint analysis of copy number and gene expression data, one from breast cancer and one from lung cancer. In both cases, we identified subtypes characterized by concordant DNA copy number changes and gene expression as well as unique profiles specific to one or the other in a completely automated fashion. In addition, the algorithm discovers potentially novel subtypes by combining weak yet consistent alteration patterns across data types.\n\nAvailability: R code to implement iCluster can be downloaded at http://www.mskcc.org/mskcc/html/85130.cfm\n\nContact: shenr@mskcc.org\n\nSupplementary information:Supplementary data are available at Bioinformatics online.","authors":["Ronglai Shen","Adam B. Olshen","Marc Ladanyi"],"meta":["January 2010Bioinformatics 26(2):292-293","DOI:10.1093/bioinformatics/btp659"],"references":[]}