{"id":"317011909_Skyline_Query_Processing_for_Incomplete_Data_in_Cloud_Environment","abstract":"Many research works have been conducted focusing on processing\nskyline queries on databases. Recently, some approaches have been\nproposed to address the issue of skyline queries for a partially complete database\nin which data item values might not be presented (missing). However,\nthese approaches are tailored for centralized database and accessed only\none table to identify the skylines. Nevertheless, in many contemporary database\napplications, this is might not be the case, particularly for a database\nwith incomplete data and many tables spread over various remote locations\nsuch as cloud environment. Applying skyline approaches designed for centralized\ndatabase directly on cloud databases is undesirable due to the prohibitive\ncost of transferring the amount of data from one datacenter to another\nduring skyline process. An approach is needed taking into consideration\nthe unique features of cloud environment when processing skyline queries\non a database with incomplete data. This paper proposes an approach\nthat evaluates skyline queries in a database with partially incomplete data\nover the cloud. The approach aims at reducing the number of pairwise comparisons\nthat needs to be conducted between data items and the amount of\ndata transferred in identifying skylines. Several experiments over synthetic\nand real datasets have been conducted to evaluate the performance of our\napproach. The result shows that our approach outperforms the previous approach\nin terms of a number of pairwise comparisons and amount of data\ntransferred.","authors":["Yonis Gulzar","Ali Amer Alwan","Norsaremah Salleh","Imad Alshaikhli"],"meta":["April 2017","Conference: Proceedings of the 6th International Conference on Computing & InformaticsAt: Kuala Lumpur, Malaysia","Project: An Efficient Model for Processing Skyline Queries in Incomplete and Uncertain Databases"],"references":["306048459_A_Framework_for_Evaluating_Skyline_Queries_over_Incomplete_Data","305080534_Processing_skyline_queries_in_incomplete_distributed_databases","294288292_An_Efficient_Approach_for_Processing_Skyline_Queries_in_Incomplete_Multidimensional_Database","274175108_Skyline_Sets_Queries_for_Incomplete_Data","272785531_On_Efficient_k-Skyband_Query_Processing_over_Incomplete_Data","221310231_Maximal_Vector_Computation_in_Large_Data_Sets","314819465_An_optimal_and_progressive_algorithm_for_skyline_queries","303746026_Efficient_Skyline_Query_over_Multiple_Relations","261860819_Finding_skylines_for_incomplete_data","259739231_Scalable_skyline_computation_using_a_balanced_pivot_selection_technique"]}