{"id":"317078129_LimTox_a_web_tool_for_applied_text_mining_of_adverse_event_and_toxicity_associations_of_compounds_drugs_and_genes","abstract":"A considerable effort has been devoted to retrieve systematically information for genes and proteins as well as relationships between them. Despite the importance of chemical compounds and drugs as a central bio-entity in pharmacological and biological research, only a limited number of freely available chemical text-mining/search engine technologies are currently accessible. Here we present LimTox (Literature Mining for Toxicology), a web-based online biomedical search tool with special focus on adverse hepatobiliary reactions. It integrates a range of text mining, named entity recognition and information extraction components. LimTox relies on machine-learning, rule-based, pattern-based and term lookup strategies. This system processes scientific abstracts, a set of full text articles and medical agency assessment reports. Although the main focus of LimTox is on adverse liver events, it enables also basic searches for other organ level toxicity associations (nephrotoxicity, cardiotoxicity, thyrotoxicity and phospholipidosis). This tool supports specialized search queries for: chemical compounds/drugs, genes (with additional emphasis on key enzymes in drug metabolism, namely P450 cytochromes-CYPs) and biochemical liver markers. The LimTox website is free and open to all users and there is no login requirement. LimTox can be accessed at: http://limtox.bioinfo.cnio.es.","authors":["Andres Cañada","Salvador Capella-Gutierrez","Obdulia Rabal","Julen Oyarzabal"],"meta":["May 2017Nucleic Acids Research 45(Web Server issue)","DOI:10.1093/nar/gkx462"],"references":["308391289_The_Comparative_Toxicogenomics_Database_Update_2017","307599581_Overview_of_the_interactive_task_in_BioCreative_V","259003441_A_CTD-Pfizer_collaboration_Manual_curation_of_88_000_scientific_articles_text_mined_for_drug-disease_and_drug-phenotype_interactions","243763293_SVMLight_Support_Vector_Machine","232224564_Ranking_relations_between_diseases_drugs_and_genes_for_a_curation_task","230532473_Text_Mining_for_Drugs_and_Chemical_Compounds_Methods_Tools_and_Applications","224890616_Literature_mining_for_the_biologist_from_information_retrieval_to_biological_discovery","224006479_ChemSpot_A_Hybrid_System_for_Chemical_Named_Entity_Recognition","256764760_Phosphodiesterase-5_PDE5_Inhibitors_In_the_Management_of_Erectile_Dysfunction","224850151_Development_of_a_Benchmark_Corpus_to_Support_the_Automatic_Extraction_of_Drug-related_Adverse_Effects_from_Medical_Case_Reports"]}