{"id":"317177239_A_SPARQL_Extension_for_Generating_RDF_from_Heterogeneous_Formats","abstract":"RDF aims at being the universal abstract data model for structured data on the Web. While there is effort to convert data in RDF, the vast majority of data available on the Web does not conform to RDF. Indeed, exposing data in RDF, either natively or through wrappers, can be very costly. Furthermore, in the emerging Web of Things, resource constraints of devices prevent from processing RDF graphs. Hence one cannot expect that all the data on the Web be available as RDF anytime soon. Several tools can generate RDF from non-RDF data, and transformation or mapping languages have been designed to offer more flexible solutions (GRDDL, XSPARQL, R2RML, RML, CSVW, etc.). In this paper, we introduce a new language, SPARQL-Generate, that generates RDF from: (i) a RDF Dataset, and (ii) a set of documents in arbitrary formats. As SPARQL-Generate is designed as an extension of SPARQL 1.1, it can provably: (i) be implemented on top on any existing SPARQL engine, and (ii) leverage the SPARQL extension mechanism to deal with an open set of formats. Furthermore, we show evidence that (iii) it can be easily learned by knowledge engineers that know SPARQL 1.1, and (iv) our first naive open source implementation performs better than the reference implementation of RML for big transformations.","authors":["Maxime Lefrançois","Antoine Zimmermann","Noorani Bakerally"],"meta":["May 2017Lecture Notes in Computer Science","DOI:10.1007/978-3-319-58068-5_3","Conference: European Semantic Web Conference"],"references":["266069132_On_the_Semantics_of_Heterogeneous_Querying_of_Relational_XML_and_RDF_Data_with_XSPARQL","309304754_Incorporating_Functions_in_Mappings_to_Facilitate_the_Uplift_of_CSV_Files_into_RDF","303098351_Supporting_Arbitrary_Custom_Datatypes_in_RDF_and_SPARQL","264274087_RML_A_Generic_Language_for_Integrated_RDF_Mappings_of_Heterogeneous_Data","220727231_A_comparison_of_RDB-to-RDF_mapping_languages","200034132_Gleaning_Resource_Descriptions_from_Dialects_of_Languages_GRDDL_W3C_Recommendation"]}