{"id":"317127450_Hail-Detection_Algorithm_for_the_GPM_Core_Satellite_Sensors","abstract":"By exploiting an abundant number of extreme storms observed simultaneously by the Global Precipitation Measurement (GPM) mission core satellite’s suite of sensors and by the ground-based S-band Next-Generation Radar (NEXRAD) network over the continental US, proxies for the identification of hail are developed based on the GPM core satellite observables. The full capabilities of the GPM observatory are tested by analyzing more than twenty observables and adopting the hydrometeor classification based on ground-based polarimetric measurements as truth. The proxies have been tested using the Critical Success Index (CSI) as a verification measure. The hail detection algorithm based on the mean Ku reflectivity in the mixed-phase layer performs the best, out of all considered proxies (CSI of 45%). Outside the Dual-frequency Precipitation Radar (DPR) swath, the Polarization Corrected Temperature at 18.7 GHz shows the greatest potential for hail detection among all GMI channels (CSI of 26% at a threshold value of 261 K). When dual variable proxies are considered, the combination involving the mixed-phase reflectivity values at both Ku and Ka-bands outperforms all the other proxies, with a CSI of 49%. The best-performing radar-radiometer algorithm is based on the mixed-phase reflectivity at Ku-band and on the brightness temperature (TB) at 10.7 GHz (CSI of 46%). When only radiometric data are available, the algorithm based on the TBs at 36.6 and 166 GHz is the most efficient, with a CSI of 27.5%.","authors":["Kamil Mroz","A. Battaglia","Timothy James Lang","DANIEL J. CECIL"],"meta":["May 2017Journal of Applied Meteorology and Climatology 56(7)","DOI:10.1175/JAMC-D-16-0368.1","Project: NCEO Radiation and Rainfall "],"references":["305414574_The_Python_ARM_Radar_Toolkit_Py-ART_a_Library_for_Working_with_Weather_Radar_Data_in_the_Python_Programming_Language","306922873_The_GPM_combined_algorithm","302970924_A_Simplex_Method_for_Function_Minimization","293012641_Polarimetric_Radar_Characteristics_of_Melting_Hail_Part_III_Validation_of_the_Algorithm_for_Hail_Size_Discrimination","292193655_On_extracting_brightness_temperature_maps_from_scanning_radiometer_data","284413738_Global_precipitation_measurement_precipitation_advances_in_measurement","277677958_The_CloudSat_mission_and_the_A-train_Bull_Am_Meteor_Soc","276924479_Signatures_of_Hydrometeor_Species_from_Airborne_Passive_Microwave_Data_for_Frequencies_10-183_GHz","275115772_A_prototype_hail_detection_algorithm_and_hail_climatology_developed_with_the_advanced_microwave_sounding_unit_AMSU","273656500_A_Robust_C-Band_Hydrometeor_Identification_Algorithm_and_Application_to_a_Long-Term_Polarimetric_Radar_Dataset"]}