{"id":"317151786_Now_I_know_how_The_learning_process_of_medication_administration_among_nursing_students_with_non-immersive_desktop_virtual_reality_simulation","abstract":"The purpose of this study was to create and explore an effective and accessible teaching method for the higher education of professionals requiring practical skills. We aimed to evaluate the effectiveness of our Pharmacology Inter-Leaved Learning Virtual Reality (PILL-VR) simulation when applied to nursing education, as a tool for learning medication administration procedures. A quasi-experimental pretest-intervention-posttest comparison group design was conducted based on quantitative analysis of questionnaires, video recordings and worksheets. Participants were nursing students who either learned medication administration processes with a PILL-VR simulation platform (experimental group; n = 82) or who learned with lecture-based curriculum (n = 47; comparison group). The results revealed significantly higher conceptual and procedural knowledge learning gains following activity with the PILL-VR simulation compared to studying via lecture-based curriculum. PILL-VR exposed the students to their own errors, allowing procedure rehearsal followed by constant feedback which is essential to skill acquisition. Although PILL-VR is based on a desktop system, it facilitated a strong sense of presence. A small positive correlation was found on questionnaire scores between the sense of presence, particularly the sense of control, and conceptual-procedural learning of medication administration. This indicates that by improving students' sense of control in the PILL-VR, the learning process can be improved. Hence, VR simulations may provide affordable and flexible access to practice necessary practical skills in higher education, which is crucial to developing students’ expertise.","authors":["Ilana Dubovi","Sharona T. Levy","Efrat Dagan"],"meta":["May 2017Computers & Education 113","DOI:10.1016/j.compedu.2017.05.009"],"references":["291425320_The_Preparation-Practice_Gap_An_Integrative_Literature_Review","285367562_The_NCSBN_National_Simulation_Study_A_Longitudinal_Randomized_Controlled_Study_Replacing_Clinical_Hours_with_Simulation_in_Prelicensure_Nursing_Education","283879412_A_Systematic_Review_of_the_Experience_of_Using_Second_Life_in_the_Education_of_Undergraduate_Nurses","306153296_How_much_time_do_nurses_have_for_patients_A_longitudinal_study_quantifying_hospital_nurses'_patterns_of_task_time_distribution_and_interactions_with_health_professionals","298795769_Impact_of_Virtual_Simulation_to_Teach_Concepts_of_Disaster_Triage","292692565_Creating_a_laboratory_that_simulates_the_critical_care_equipment","292134397_Emerging_Tools_Application_of_Virtual_Reality_in_Education","287507964_The_effects_of_3D_multi-user_virtual_environments_on_freshmen_university_students'_conceptual_and_spatial_learning_and_presence_in_departmental_orientation","286358305_Situated_Learning_in_Virtual_Worlds_and_Immersive_Simulations","281712709_Embracing_Errors_in_Simulation-Based_Training_The_Effect_of_Error_Training_on_Retention_and_Transfer_of_Central_Venous_Catheter_Skills"]}