{"id":"317133196_Infrastructure_and_distributed_learning_methodology_for_privacy-preserving_multi-centric_rapid_learning_health_care_euroCAT","abstract":"Machine learning applications for personalized medicine are highly dependent on access to sufficient data. For personalized radiation oncology, datasets representing the variation in the entire cancer patient population need to be acquired and used to learn prediction models. Ethical and legal boundaries to ensure data privacy hamper collaboration between research institutes. We hypothesize that data sharing is possible without identifiable patient data leaving the radiation clinics and that building machine learning applications on distributed datasets is feasible.\nWe developed and implemented an IT infrastructure in five radiation clinics across three countries (Belgium, Germany, and The Netherlands). We present here a proof-of-principle for future ‘big data’ infrastructures and distributed learning studies. Lung cancer patient data was collected in all five locations and stored in local databases. Exemplary support vector machine (SVM) models were learned using the Alternating Direction Method of Multipliers (ADMM) from the distributed databases to predict post-radiotherapy dyspnea grade ⩾2. The discriminative performance was assessed by the area under the curve (AUC) in a five-fold cross-validation (learning on four sites and validating on the fifth). The performance of the distributed learning algorithm was compared to centralized learning where datasets of all institutes are jointly analyzed.\nThe euroCAT infrastructure has been successfully implemented in five radiation clinics across three countries. SVM models can be learned on data distributed over all five clinics. Furthermore, the infrastructure provides a general framework to execute learning algorithms on distributed data. The ongoing expansion of the euroCAT network will facilitate machine learning in radiation oncology. The resulting access to larger datasets with sufficient variation will pave the way for generalizable prediction models and personalized medicine.","authors":["Timo M. Deist","Arthur Jochems","Johan van Soest","Georgi I. Nalbantov"],"meta":["June 2017Clinical and Translational Radiation Oncology 4(C):24-31","DOI:10.1016/j.ctro.2016.12.004","Project: Distributed learning in radiation oncology"],"references":["309546163_Distributed_learning_Developing_a_predictive_model_based_on_data_from_multiple_hospitals_without_data_leaving_the_hospital_-_A_real_life_proof_of_concept","287810613_Privacy-preserving_GWAS_analysis_on_federated_genomic_datasets","265854262_Rapid_Learning_in_Practice_A_Lung_Cancer_Survival_Decision_Support_System_in_Routine_Patient_Care_Data","256704265_Cardiac_comorbidity_is_an_independent_risk_factor_for_radiation-induced_lung_toxicity_in_lung_cancer_patients","305648219_Can_Observational_Data_Replace_Randomized_Trials","291341220_Randomized_Clinical_Trials_and_Observational_Studies_Is_There_a_Battle","279301249_Measuring_Computed_Tomography_Scanner_Variability_of_Radiomics_Features","262599472_Sparql_query_language_for_rdf","262579095_An_umbrella_protocol_for_standardized_data_collection_SDC_in_rectal_cancer_A_prospective_uniform_naming_and_procedure_convention_to_support_personalized_medicine","257135405_WebGLORE_a_web_service_for_Grid_LOgistic_REgression"]}