{"id":"317148728_Analyzing_Software_Evolution_and_Quality_by_Extracting_Asynchrony_Change_patterns","abstract":"Change patterns describe two or more files were often changed together during the development or the maintenance of software systems. Several studies have been presented to detect change patterns and to analyze their types and their impact on software quality. In this context, we introduced the Asynchrony change pattern to describes a set of files that always change together in the same change periods, regardless developers who maintained them. In this paper, we investigate the impact of Asynchrony change pattern on design and code smells such as anti-patterns and code clones. Concretely, we conduct an empirical study by detecting Asynchrony change patterns, anti-patterns and code clones occurrences on 22 versions of four software systems and analysing their fault-proneness. Results show that cloned files that follow the same Asynchrony change patterns have significantly increased fault-proneness with respect to other clones, and that anti-patterns following the same Asynchrony change pattern can be up to five times more risky in terms of fault-proneness as compared to other anti-patterns. Asynchrony change patterns thus seem to be strong indicators of fault-proneness for clones and anti-patterns.","authors":["Fehmi Jaafar","Angela Lozano","Yann-Gaël Guéhéneuc","Kim Mens"],"meta":["May 2017Journal of Systems and Software 131","DOI:10.1016/j.jss.2017.05.047","Project: Software Quality and Security"],"references":["308963226_Analysing_Anti-patterns_Static_Relationships_with_Design_Patterns","313596238_Effective_automatic_procedure_extraction","313595660_Practical_language-independent_detection_of_near-miss_clones","313068172_Using_multivariate_time_series_and_association_rules_to_detect_logical_change_coupling_An_empirical_study","312532894_Clone_detection_using_abstract_syntax_trees","305296096_Towards_a_Metrics_Suite_for_Object_Oriented_Design","303480799_Software-Clone_Rates_in_Open-Source_Programs_Written_in_C_or_C","285326994_Pattern_Matching_for_Clone_and_Concept_Detection","277578258_Development_nature_matters_An_empirical_study_of_code_clones_in_JavaScript_applications","274869757_Handbook_of_Parametric_and_Nonparametric_Statistical_Procedures"]}