{"id":"317177676_DotProject_Open-Source_Software_for_Project_Management_Education","abstract":"Teaching the usage of Project Management (PM) tools is an important part of Software Engineering education. In this context, instructors often adopt some professional PM tool, such as MS-Project, GanttProject or dotProject. However, as such tools lack instructional features, some studies propose the adoption of educational PM tools. Yet, even these tools may be insufficient, due to their limited content coverage, and/or not support the learning of prominent professional PM tools. Attempting to improve this situation, this paper presents the enhancement of a professional open-source PM tool – dotProject-for educational purposes. The enhancements include the completion of the support for project initiating and planning, and the reorganization of the tool's interface to assist its adoption in the classroom. Results from applying the enhanced tool in a series of case studies in PM courses, indicate that dotProject+ contributes to the students' learning and facilitates the teaching of the usage of a PM tool in alignment with the PMBOK.","authors":["Rafael Queiroz Gonçalves","Christiane Gresse von Wangenheim"],"meta":["May 2017","DOI:10.1109/ICSE-C.2017.128","Conference: 2017 IEEE/ACM 39th IEEE International Conference on Software Engineering CompanionAt: Buenos Aires/ArgentinaVolume: 1","Project: Instructional Unit for Teaching Project Management Tools"],"references":["279860978_How_to_Teach_the_Usage_of_Project_Management_Tools_in_Computer_Courses_A_Systematic_Literature_Review","273569026_Comparison_of_open_source_tools_for_project_management","259329419_Software_Project_Management_Tools_A_Brief_Comparative_View","224166340_Frequency_of_use_and_importance_of_software_tools_in_project_management_practice_in_Croatia","221610417_A_Comparison_of_Project_Management_Software_Tools_PMST","3076787_Why_software_projects_escalate_The_importance_of_project_management_constructs","254864326_PpcProject_An_educational_tool_for_software_project_management","200465328_Case_Study_Research_Design_Methods"]}