{"id":"317101064_Combinatorial_n-fold_Integer_Programming_and_Applications","abstract":"Integer Linear Programming is a famous NP-complete problem. Lenstra showed that in the case of small dimension, it can be solved in polynomial time. This algorithm became a ubiquitous tool, especially in the design of parameterized algorithms for NP-complete problems, where we wish to isolate the hardness of an instance to some parameter. However, it was discovered that in many cases using Lenstra's algorithm has two drawbacks. First, the dependence of the resulting algorithms is often doubly-exponential in the parameter, and second, an ILP formulation in small dimension can not easily express problems which involve many different costs. Inspired by the work of Hemmecke, Onn and Romanchuk [Math. Prog. 2013], we develop a single-exponential algorithm for so called combinatorial n-fold integer programs, which are remarkably similar to prior ILP formulations for various problems, but unlike them, also allow variable dimension. We then apply our algorithm to a few representative problems like Closest String, Swap Bribery, Weighted Set Multicover etc., and obtain exponential speedups in the dependence on the respective parameters, the input size, or both. Unlike Lenstra's algorithm, which is essentially a bounded search tree algorithm, our result uses the technique of augmenting steps. At its heart is a deep result stating that in combinatorial n-fold IPs an existence of an augmenting step implies an existence of a \"local\" augmenting step, which can be found using dynamic programming. Our results provide an important insight into many problems by showing that they exhibit this phenomenon, and highlights the importance of augmentation techniques.","authors":["Dusan Knop","Martin Koutecký","Matthias Mnich"],"meta":["May 2017","Conference: ESA (European Symposium on Algorithms)"],"references":["301839252_Scheduling_meets_n-fold_Integer_Programming","270883320_Multivariate_Algorithmics_for_NP-Hard_String_Problems","342373569_Voting_and_Bribing_in_Single-Exponential_Time","322320058_The_Complexity_Landscape_of_Decompositional_Parameters_for_ILP","315597033_Parameterized_complexity_of_distance_labeling_and_uniform_channel_assignment_problems","303753419_On_polynomial_kernels_for_sparse_integer_linear_programs","283471530_Parameterized_Integer_Quadratic_Programming_Variables_and_Coefficients","279310040_A_Structural_Approach_to_Kernels_for_ILPs_Treewidth_and_Total_Unimodularity","270515170_Huge_Unimodular_N-Fold_Programs","267663990_On_the_Efficiency_of_the_Hamming_C-Centerstring_Problems"]}