{"id":"317148869_User_studies_in_cartography_opportunities_for_empirical_research_on_interactive_maps_and_visualizations","abstract":"The possibility of digital interactivity requires us to reenvision the map reader as the map user, and to address the perceptual, cognitive, cultural, and practical considerations that influence the user’s experience with interactive maps and visualizations. In this article, we present an agenda for empirical research on this user and the interactive designs he or she employs. The research agenda is a result of a multi-stage discussion among international scholars facilitated by the International Cartographic Association that included an early round of position papers and two subsequent workshops to narrow into pressing themes and important research opportunities. The focus of our discussion is epistemological and reflects the wide interdisciplinary influences on user studies in cartography. The opportunities are presented as imperatives that cross basic research and user-centered design studies, and identify practical impediments to empirical research, emerging interdisciplinary recommendations to improve user studies, and key research needs specific to the study of interactive maps and visualizations.","authors":["Robert E. Roth","Arzu Coltekin","Luciene Stamato Delazari","Homero Fonseca Filho"],"meta":["May 2017International Journal of Cartography 3(1):1-29","DOI:10.1080/23729333.2017.1288534"],"references":["317017681_Envisioning_the_future_of_cartographic_research","316945513_Designing_across_map_use_contexts_a_research_agenda","345637498_Web_Cartography_Map_Design_for_Interactive_and_Mobile_Devices","344951188_Visualization_Analysis_and_Design","321610145_Scientific_Visualization_Techniques_and_Applications","319770721_Maps_of_Bounded_Rationality_Psychology_for_Behavioral_Economics","319394404_Designing_the_user_interface_strategies_for_effective_human-computer_interaction","319271239_An_introduction_and_guide_to_evaluation_of_visualization_techniques_through_user_studies","313553301_Context_matters_Evaluating_interaction_techniques_with_the_CIS_model","312456055_The_challenge_of_information_visualization_evaluation"]}