{"id":"317138668_Ordered_small_multiple_treemaps_for_visualizing_time-varying_hierarchical_pesticide_residue_data","abstract":"Small multiples can visually enforce comparisons of changes or differences among objects, revealing potential patterns by providing different views. According to the analyzing requirements in food safety fields and characteristics of pesticide residue detection data, in this paper, we propose a novel visualization approach to explore and analyze the time-varying hierarchical data, which is called ordered small multiple treemaps (OSMT). Inspired by the thought of querying an array by rows or columns, OSMT makes it possible to locate a specific node in the treemap layout by using a unique location 2-tuple and keep a relative stable order of nodes in the layout while we detecting temporal patterns. This algorithm enables the visual representation of the node values varying with time, preserving the hierarchical relationships among nodes in the meanwhile. Based on some interaction techniques (filtering, selecting, highlighting and zooming, etc.), OSMT can help users find some specific changes more easily and thus make corresponding decisions with more efficiency. Besides, we also propose a new metric called TVA (Ability of tracking time-varying data in treemap) with a purpose of evaluating different kinds of treemap layout algorithms from the aspect of the difficulty level for tracking time-varying nodes in the overall layout. Finally, our technique’s applicability is demonstrated on the pesticide residues detection results dataset in this study.","authors":["Yi Chen","Xiaomin Du","Xiaoru Yuan"],"meta":["June 2017The Visual Computer 33(2)","DOI:10.1007/s00371-017-1373-x"],"references":["318494290_Voronoi_Treemaps","307572649_Temporal_Data_Visualization_Technique_Based_on_Treemap","301935702_Chronicler_Interactive_Exploration_of_Source_Code_History","293086990_Treemap-Based_Visualization_Methods_for_Pesticide_Residues_Detection_Data","288653101_A_squarified_and_ordered_treemap_layout_algorithm","286157610_Performance_compare_and_optimization_of_rectangular_treemap_layout_algorithms","284084943_Divide_and_Conquer_treemaps_Visualizing_large_trees_with_various_shapes","282529080_Automatic_Selection_of_Partitioning_Variables_for_Small_Multiple_Displays","281766567_Treemap_visualization","281717044_Meta-model_of_Information_Visualization_Based_on_Treemap","270789791_Nmap_A_Novel_Neighborhood_Preservation_Space-filling_Algorithm","273495035_Sunburst_with_ordered_nodes_based_on_hierarchical_clustering_a_visual_analyzing_method_for_associated_hierarchical_pesticide_residue_data","271489071_IMap_A_stable_layout_for_navigating_large_image_collections_with_embedded_search","270006358_Discovering_temporal_changes_in_hierarchical_transportation_data_Visual_analytics_text_reporting_tools","269913934_TreeVersity"]}