{"id":"317164835_An_Empirical_Analysis_of_Approximation_Algorithms_for_the_Euclidean_Traveling_Salesman_Problem","abstract":"With applications to many disciplines, the traveling salesman problem (TSP) is a classical computer science optimization problem with applications to industrial engineering, theoretical computer science, bioinformatics, and several other disciplines. In recent years, there have been a plethora of novel approaches for approximate solutions ranging from simplistic greedy to cooperative distributed algorithms derived from artificial intelligence. In this paper, we perform an evaluation and analysis of cornerstone algorithms for the Euclidean TSP. We evaluate greedy, 2-opt, and genetic algorithms. We use several datasets as input for the algorithms including a small dataset, a mediumsized dataset representing cities in the United States, and a synthetic dataset consisting of 200 cities to test algorithm scalability. We discover that the greedy and 2-opt algorithms efficiently calculate solutions for smaller datasets. Genetic algorithm has the best performance for optimality for medium to large datasets, but generally have longer runtime. Our implementations is public available.","authors":["Yihui He","Ming Xiang"],"meta":["May 2017"],"references":["220616869_An_Analysis_of_Several_Heuristics_for_the_Traveling_Salesman_Problem","201976371_Genetic_Algorithms_for_the_Traveling_Salesman_Problem","304890422_Erratum_The_Traveling_Salesman_Problem_A_Guided_Tour_of_Combinatorial_Optimization","255612292_CONVERGENCE_OF_ADAPTIVE_MARKOV_CHAIN_Monte_Carlo_Algorithms","247449658_Schema_analysis_of_the_traveling_salesman_problem_using_genetic_algorithms","221704669_A_Method_for_Solving_Traveling-Salesman_Problems","220616451_On_the_Maximum_Scatter_Traveling_Salesperson_Problem","31593416_Genetic_Algorithms_for_Timetabling_and_Traveling_Salesman_Problems","3671933_Polynomial_time_approximation_schemes_for_Euclidean_TSP_and_othergeometric_problems","2404040_Improved_Large-Step_Markov_Chain_Variants_for_the_Symmetric_TSP"]}