{"id":"317220817_The_Palgrave_Handbook_of_Quantum_Models_in_Social_Science_Applications_and_Grand_Challenges","abstract":"It is not intuitive to accept that there exists a link between quantum physical systems and cognitive systems. However, recent research has shown that cognitive systems and collective (social) systems, including biology, exhibit uncertainty which can be successfully modelled with quantum probability. The use of such probability allows for the modelling of situations which typically violate the laws of classical probability. The Palgrave Handbook of Quantum Models in Social Science is is a unique volume that brings together contributions from leading experts on key topics in this new and emerging field. Completely self-contained, it begins with an introductory section which gathers all the fundamental notions required to be able to understand later chapters. The handbook then moves on to address some of the latest research and applications for quantum methods in social science disciplines, including economics, politics and psychology. It begins with the issue of how the quantum mechanical framework can be applied to economics. Chapters devoted to this topic range from how Fisher information can be argued to play a role in economics, to the foundations and application of quantum game theory. The handbook then progresses in considering how belief states can be updated with the theory of quantum measurements (and also with more general methods). The practical use of the Hilbert space (and Fock space) in decision theory is then introduced, and open quantum systems are also considered. The handbook also treats a model of neural oscillators that reproduces some of the features of quantum cognition. Other contributions delve into causal reasoning using quantum Bayes nets and the role of quantum probability in modelling so called affective evaluation. The handbook is rounded off with two chapters which discuss the grand challenges which lie ahead of us. How can the quantum formalism be justified in social science and is the traditional quantum formalism too restrictive? Finally, a question is posed: whether there is a necessary role for quantum mathematical models to go beyond physics. This book will bring the latest and most cutting edge research on quantum theory to social science disciplines. Students and researchers across the discipline, as well as those in the fields of physics and mathematics will welcome this important addition to the literature.","authors":["Emmanuel Haven","Andrei Khrennikov"],"meta":["January 2017","DOI:10.1057/978-1-137-49276-0","ISBN: 978-1-137-49275-3"],"references":[]}