{"id":"317229887_Multiplex_model_of_mental_lexicon_reveals_explosive_learning_in_humans","abstract":"Similarities among words affect language acquisition and processing in a multi-relational way barely accounted for in the literature. We propose a multiplex network representation of word similarities in a mental lexicon as a natural framework for investigating large-scale cognitive patterns. Our model accounts for semantic, taxonomic, and phonological interactions and identifies a cluster of words of higher frequency, easier to identify, memorise and learn and with more meanings than expected at random. This cluster emerges around age 7 yr through an explosive transition not reproduced by null models. We relate this phenomenon to polysemy, i.e. redundancy in word meanings. We show that the word cluster acts as a core for the lexicon, increasing both its navigability and robustness to degradation in cognitive impairments. Our findings provide quantitative confirmation of existing psycholinguistic conjectures about core structure in the mental lexicon and the importance of integrating multi-relational word-word interactions in suitable frameworks.","authors":["Massimo Stella","Nicole M. Beckage","Markus Brede","Manlio De Domenico"],"meta":["February 2018Scientific Reports 8(1)","DOI:10.1038/s41598-018-20730-5","Project: Cognitive Networks and Data Science approaches to understanding cognition"],"references":["313367257_Multilayer_modeling_and_analysis_of_human_brain_networks","311409123_LARGE-SCALE_NETWORK_REPRESENTATIONS_OF_SEMANTICS_IN_THE_MENTAL_LEXICON","311066503_The_polysemy_of_the_words_that_children_learn_over_time","308027308_Multiplex_lexical_networks_reveal_patterns_in_early_word_acquisition_in_children","307469293_The_physics_of_spreading_processes_in_multilayer_networks","345702449_The_Structure_and_Dynamics_of_Networks","313939750_Network_neuroscience","313364068_Networks_that_optimize_a_trade-off_between_efficiency_and_dynamical_resilience","313363317_Hierarchies_in_Dictionary_Denition_Space","311100307_A_Unified_Approach_to_Percolation_Processes_on_Multiplex_Networks"]}