{"id":"317212861_Feature_selection_based_on_graph_Laplacian_by_using_compounds_with_known_and_unknown_activities","abstract":"A semisupervised feature selection method based on graph Laplacian (S²FSGL) was proposed for quantitative structure-activity relationship (QSAR) models, which uses an ℓ2,1-norm and compounds with both known and unknown activities. In the proposed S²FSGL method, 2 graphs Gunsup and Gsup are constructed. It uses the label information of compounds with known activities and the local structure of compounds with known and unknown activities to select the most important descriptors. The weight matrix of graph Gunsup models the local structure of the compounds with known and unknown activities. The S²FSGL method uses the ℓ2,1-norm to consider the correlation between different descriptors when conducting descriptor selection. The performance of the proposed S²FSGL coupled with a kernel smoother model was evaluated using 2 QSAR data sets and compared with the performance of other feature selection methods. For the evaluation of the performance of QSAR models and selected descriptors, several different training and test sets were produced for each data set. The comparison between the statistical parameters of QSAR models built based on the semisupervised feature selection method and those obtained by other feature selection methods revealed the superiority of the proposed S²FSGL in selecting the most relevant descriptors. The results showed that the use of compounds with unknown activities beside compounds with known activities can be helpful in selecting the relevant descriptors of QSAR models.","authors":["Razieh Sheikhpour","Mehdi Agha Sarram","Sajjad Gharaghani","Mohammad Ali Zare Chahooki"],"meta":["May 2017Journal of Chemometrics 31(10)","DOI:10.1002/cem.2899"],"references":["284561053_Ensemble_constrained_Laplacian_score_for_efficient_and_robust_semi-supervised_feature_selection","282609641_Consistency_of_QSAR_models_Correct_split_of_training_and_test_sets_ranking_of_models_and_performance_parameters","280875405_Semi-Supervised_Learning_for_Quantitative_Structure-Activity_Modeling","313685462_Constraint_score_for_semi-supervised_feature_selection_in_ligand-and_receptor-based_QSAR_on_serinethreonine-protein_kinase_PLK3_inhibitors","313606750_Machine_learning_and_knowledge_discovery_in_databases","309882254_A_Survey_on_semi-supervised_feature_selection_methods","291185212_Be_aware_of_error_measures_Further_studies_on_validation_of_predictive_QSAR_models","282897732_Semi-supervised_feature_selection_based_on_local_discriminative_information","281417774_Semi-supervised_evaluation_of_constraint_scores_for_feature_selection","271637008_A_graph_Laplacian_based_approach_to_semi-supervised_feature_selection_for_regression_problems"]}