{"id":"317266548_Program_Outcomes_Assessment_Method_for_Multi-Academic_Accreditation_Bodies_Computer_Science_Program_as_a_Case_Study","abstract":"In educational community, assessment process focuses on learning, teaching and outcomes. It provides information for improving learning and teaching. Therefore, a well-established assessment process plays a vital role for improving program outcomes which, in turn, results in fulfilling program educational objectives. However, such a process entails setting well-defined courses learning objectives, program outcomes, and program educational objectives. In addition, an effective assessment method is needed for measuring the extent that program outcomes meet academic accreditation body criteria. This measurement is performed by mapping courses learning objectives with program educational objectives passing through program outcomes. Such mapping for just one academic accreditation body is a straightforward process and involves no complications. However, a coherent assessment method is required for multi academic accreditation bodies. The approach of mapping program outcomes across criteria of multi academic accreditation bodies is likely a promising key for addressing this issue. The proposed assessment method along with the assignments and practices used for evaluating students’ performance such as quizzes and exams, and the associated action plans and recommendations for improvements are crucial steps for the overall assessment process. Findings based on the results of samples taken from a number of students for some courses of computer science program show the flexibility and effectiveness of the proposed assessment method.","authors":["Hikmat A. M. Abdeljaber","Sultan Ahmad"],"meta":["May 2017International Journal of Emerging Technologies in Learning (iJET) 12(05):23","DOI:10.3991/ijet.v12i05.6410","Project: Development and Quality of Educational Programs for National and International Accreditation"],"references":["306226144_Language_assessment_course_Structure_delivery_and_learning_outcomes","277881612_Academic_Diversity_and_Assessment_Process_for_CS_Program_Accreditation","260762112_A_contribution_to_the_history_of_assessment_How_a_conversation_simulator_redeems_Socratic_method","259734801_Assessment_Might_Dictate_the_Curriculum_But_What_Dictates_Assessment","245889937_Designing_and_Teaching_Courses_to_Satisfy_the_ABET_Engineering_Criteria","332103532_Assessment_might_dictate_the_curriculum_but_what_dictates_assessment","290810272_Connecting_the_dots_in_assessment_From_course_student_learning_objectives_to_educational_program_outcomes_to_ABET_assessment","245291327_Program_Assessment_and_Evaluation_Using_Student_Grades_Obtained_on_Outcome-Related_Course_Learning_Objectives","241752603_Multi-Level_Assessment_of_Program_Outcomes_Assessing_a_Nontraditional_Study_Abroad_Program_in_the_Engineering_Disciplines","226071278_Assessment_Learning_and_Judgement_in_Higher_Education_A_Critical_Review"]}