{"id":"317221191_Algorithm_Animations_for_Teaching_and_Learning_the_Main_Ideas_of_Basic_Sortings","abstract":"Algorithms are hard to understand for novice computer science students because they dynamically modify values of elements of abstract data structures. Animations can help to understand algorithms, since they connect abstract concepts to real life objects and situations. In the past 30-35 years, there have been conducted many experiments in the field of usage of animations and visualizations in education, but they showed mixed results. In this paper, we review past research within the field and summarize recommendations regarding the graphic design and interactivity of the animations. In the second part of the paper, we present our interactive card sorting animations with conceptual views. The goal of these animations is to help students understand the main ideas and differences between basic sorting algorithms. In a pedagogical experiment related to these animations, 92 first-year computer science students of J. Selye University in Komarno (Slovakia) were asked to fill in a pre-test, experiment with the interactive animations, and fill in a post-test. The results showed that animations helped students to understand essential aspects of sorting algorithms. However, the participants were not able to understand the sorting algorithms in detail, so other types of animations are needed to teach algorithms in-depth.","authors":["Ladislav Végh","Veronika Stoffova"],"meta":["April 2017Informatics in Education 16(1):121-140","DOI:10.15388/infedu.2017.07"],"references":["282644522_Using_a_game-based_learning_model_as_a_new_teaching_strategy_for_computer_engineering","269821128_When_does_higher_degree_of_interaction_lead_to_higher_learning_in_visualizations_Exploring_the_role_of_'Interactivity_Enriching_Features'","247699111_Taxonomy_of_Educational_Objectives_The_Classification_of_Educational_Objectives","241162699_Learning_How_to_Program_through_Visualization_A_Pilot_Study_on_the_Bubble_Sort_Algorithm","238985095_Algorithm_animation_for_teaching_software_visualization","238750565_Designing_educationally_effective_algorithm_visualizations_embedding_analogies_and_animations_in_hypermedia","236841981_Toward_the_effective_use_of_educational_program_animations_The_roles_of_student's_engagement_and_topic_complexity","235465787_A_Taxonomy_for_Learning_Teaching_and_Assessing_A_Revision_of_Bloom's_Taxonomy_of_Educational_Objectives","234827343_The_effective_use_of_quicksort_visualizations_in_the_classroom","228792103_Modelling_and_Simulation_as_a_Recognizing_Method_in_Education"]}