{"id":"317232419_Gamification_a_systematic_review_of_design_frameworks","abstract":"Learner’s motivation difficulties are recognized as a problem in diverse educational scenarios, reaching up to university degrees. Among other techniques that are often applied by instructors to counteract this issue, those related to the use of gaming elements seem to very promising. In this context, considering the use of game-like properties in learning scenarios, known as gamification, has received increasing interest by academia in recent years. However, its application in higher education can be challenging, due to some unwanted effects caused by the lack of proven design methodologies have been detected. Choosing the adequate formal process for gamification design has become an important success requirement. This work presents a systematic review of the gamification design frameworks discussed in the literature, providing a useful resource to educational practitioners as well as gamification designers and researchers. A total of 2314 unique works are initially recorded, based on queries in databases, libraries, journals and search engines. After applying a systematic filtering process, a definitive list of 40 works is more closely analysed. Next to review over relevant literature, an assessment of the main features found in the discussed approaches is given, while also categorizing them according to their main application field and its suitability in higher educational environments.","authors":["Alberto Mora","Daniel Riera","Carina Soledad González González","Joan Arnedo-Moreno"],"meta":["December 2017Journal of Computing in Higher Education 29(1/2):1-33","DOI:10.1007/s12528-017-9150-4","Project: Gamification"],"references":["326311784_Level_Up_Your_Strategy_Towards_a_Descriptive_Framework_for_Meaningful_Enterprise_Gamification","329181478_A_gamification-based_framework_for_developing_learning_activities_of_computational_thinking","321255201_A_participatory_design_framework_for_the_gamification_of_rehabilitation_systems","318494438_Flow_the_psychology_of_optimal_experience","314452432_Towards_Meaningful_Engagement_Gamification_Designs_for_Gameful_Interaction_with_Information_Systems","313431284_Designing_evaluation_into_change_management_processes","301411666_Gamification_framework_model_based_on_social_engagement_in_e-learning_20","301212166_Gamification_in_the_Enterprise_Differences_from_Consumer_Market_Implications_and_a_Method_to_Manage_Them","300644427_Gamification_in_e-Learning_Systems_A_Conceptual_Model_to_Engage_Students_and_Its_Application_in_an_Adaptive_e-Learning_System","293478743_A_Gamification-Based_Framework_for_Developing_Learning_Activities_of_Computational_Thinking"]}