{"id":"317273972_Science_Possible_Selves_and_the_Desire_to_be_a_Scientist_Mindsets_Gender_Bias_and_Confidence_during_Early_Adolescence","abstract":"In the United States, gender gaps in science interest widen during the middle school years. Recent research on adults shows that gender gaps in some academic fields are associated with mindsets about ability and gender-science biases. In a sample of 529 students in a U.S. middle school, we assess how explicit boy-science bias, science confidence, science possible self (belief in being able to become a scientist), and desire to be a scientist vary by gender. Guided by theories and prior research, we use a series of multivariate logistic regression models to examine the relationships between mindsets about ability and these variables. We control for self-reported science grades, social capital, and race/ethnic minority status. Results show that seeing academic ability as innate (“fixed mindsets”) is associated with boy-science bias, and that younger girls have less boy-science bias than older girls. Fixed mindsets and boy-science bias are both negatively associated with a science possible self; science confidence is positively associated with a science possible self. In the final model, high science confident and having a science possible self are positively associated with a desire to be a scientist. Facilitating growth mindsets and countering boy-science bias in middle school may be fruitful interventions for widening participation in science careers.","authors":["Patricia Wonch Hill","Julia Mcquillan","Eli James Talbert","Amy N Spiegel"],"meta":["May 2017","DOI:10.3390/socsci6020055"],"references":["313781387_The_Potential_Scientist's_Dilemma_How_the_Masculine_Framing_of_Science_Shapes_Friendships_and_Science_Job_Aspirations","297719007_The_Times_They_Are_a-Changing_or_Are_They_Not_A_Comparison_of_Gender_Stereotypes_1983-2014","293825137_Males_Under-Estimate_Academic_Performance_of_Their_Female_Peers_in_Undergraduate_Biology_Classrooms","293045096_But_You_Don't_Look_Like_A_Scientist_Women_Scientists_with_Feminine_Appearance_are_Deemed_Less_Likely_to_be_Scientists","291353993_Male_Science_Female_Humanities_Both_Implicit_and_Explicit_Gender-Science_Stereotypes_Are_Heritable","286451282_Male_Science_Female_Humanities_Both_Implicit_and_Explicit_Gender-Science_Stereotypes_Are_Heritable","317085610_The_High_School_Environment_and_the_Gender_Gap_in_Science_and_Engineering","290898662_Gender_and_Gender_Role_Development_in_Adolescence","288351124_Benefits_of_activity_participation_The_roles_of_identity_affirmation_and_peer_group_norm_sharing","283434530_Science_Aspirations_and_Gender_Identity_Lessons_from_the_ASPIRES_Project"]}