{"id":"317213418_Modern_Optimization_Methods_in_Water_Resources_Planning_Engineering_and_Management","abstract":"Mathematical (analytical, numerical and optimization) models are employed in many disciplines including the water resources planning, engineering and management. These models can vary from a simple black-box model to a sophisticated distributed physics-based model. Recently, development and employment of modern optimization methods (MOMs) have become popular in the area of mathematical modeling. This paper overviews the MOMs based on the evolutionary search which were developed over mostly the last 30 years. These methods have wide application in practice from finance to engineering and this paper focuses mostly on the applications in the area of water resources planning, engineering and management. Although there are numerous optimization algorithms, the paper outlines the ones that have been widely employed especially in the last three decades; such as the Genetic Algorithm (GA), Ant Colony (AC), Differential Evolution (DE), Particle Swarm (PS), Harmony Search (HS), Genetic Programming (GP), and Gene Expression Programming (GEP). The paper briefly introduces theoretical background of each algorithm and its applications and discusses the merits and, if any, shortcomings. The wide spectrum of applications include, but not limited to, flood control and mitigation, reservoir operation, irrigation, flood routing, river training, flow velocity, rainfall-runoff processes, sediment transport, groundwater management, water quality, hydropower, dispersion, and aquifers.","authors":["Gokmen Tayfur"],"meta":["August 2017Water Resources Management 31(8):1-29","DOI:10.1007/s11269-017-1694-6"],"references":["303412228_A_Multi-Objective_Best_Compromise_Decision_Model_for_Real-Time_Flood_Mitigation_Operations_of_Multi-Reservoir_System","301215456_Optimization_of_Irrigation_Scheduling_Using_Soil_Water_Balance_and_Genetic_Algorithms","313706874_Adaptation_in_natural_and_artificial_systems","313636056_A_modified_particle_swarm_optimizer","312907789_Ant_system_Optimization_by_a_colony_of_cooperating_agents","312816335_Swarm_Intelligence","312153237_Differential_evolution","304704738_Application_of_harmony_search_algorithm_to_reservoir_operation_optimization","304425270_Differential_Evolution_-_A_Simple_and_Efficient_Heuristic_for_global_Optimization_over_Continuous_Spaces","301608866_A_hybrid_simulation-optimization_approach_for_solving_the_areal_groundwater_pollution_source_identification_problems"]}