{"id":"317254959_Automatic_Epileptic_Seizure_Detection_in_EEG_Signals_Using_Multi-Domain_Feature_Extraction_and_Nonlinear_Analysis","abstract":"Epileptic seizure detection is commonly implemented by expert clinicians with visual observation of electroencephalography (EEG) signals, which tends to be time consuming and sensitive to bias. The epileptic detection in most previous research suffers from low power and unsuitability for processing large datasets. Therefore, a computerized epileptic seizure detection method is highly required to eradicate the aforementioned problems, expedite epilepsy research and aid medical professionals. In this work, we propose an automatic epilepsy diagnosis framework based on the combination of multi-domain feature extraction and nonlinear analysis of EEG signals. Firstly, EEG signals are pre-processed by using the wavelet threshold method to remove the artifacts. We then extract representative features in the time domain, frequency domain, time-frequency domain and nonlinear analysis features based on the information theory. These features are further extracted in five frequency sub-bands based on the clinical interest, and the dimension of the original feature space is then reduced by using both a principal component analysis and an analysis of variance. Furthermore, the optimal combination of the extracted features is identified and evaluated via different classifiers for the epileptic seizure detection of EEG signals. Finally, the performance of the proposed method is investigated by using a public EEG database at the University Hospital Bonn, Germany. Experimental results demonstrate that the proposed epileptic seizure detection method can achieve a high average accuracy of 99.25%, indicating a powerful method in the detection and classification of epileptic seizures. The proposed seizure detection scheme is thus hoped to eliminate the burden of expert clinicians when they are processing a large number of data by visual observation and to speed-up the epilepsy diagnosis.","authors":["Lina Wang","Weining Xue","Yang Li","Meilin Luo"],"meta":["May 2017Entropy 19(6):222","DOI:10.3390/e19060222"],"references":["295688419_Wavelet_denoising_algorithm_to_refine_noisy_geoelectrical_data_for_versatile_inversion","274728281_Detection_of_epileptiform_activity_in_EEG_signals_based_on_time-frequency_and_non-linear_analysis","345817525_Discrete_Fourier_and_Wavelet_Transforms_An_Introduction_through_Linear_Algebra_with_Applications_to_Signal_Processing","313025164_Local_pattern_transformation_based_feature_extraction_techniques_for_classification_of_epileptic_EEG_signals","307930404_Epileptic_seizure_detection_in_EEG_signals_using_tunable-Q_factor_wavelet_transform_and_bootstrap_aggregating","303206384_Data_Mining_Concepts_and_Techniques","294112578_A_multiwavelet-based_time-varying_model_identification_approach_for_time-frequency_analysis_of_EEG_signals","293016536_Identification_of_time-varying_systems_for_time-dependent_transient_spectral_analysis_in_EEG_signals_using_multiscale_radial_basis_functions","281036233_Application_of_entropies_for_automated_diagnosis_of_epilepsy_using_EEG_signals_A_review","271539756_Hilbert_marginal_spectrum_analysis_for_automatic_seizure_detection_in_EEG_signals"]}