{"id":"317230543_Abnormality_Detection_and_Localization_in_Chest_X-Rays_using_Deep_Convolutional_Neural_Networks","abstract":"Chest X-Rays (CXRs) are widely used for diagnosing\nabnormalities in the heart and lung area. Automatically\ndetecting these abnormalities with high accuracy could\ngreatly enhance real-world diagnosis processes. Lack of\nstandard publicly available dataset and benchmark studies,\nhowever, makes it difficult to compare and establish the best\ndetection methods. To overcome these difficulties,\nwe have used the publicly available Indiana chest X-Ray\ndataset, JSRT dataset and Shenzhen Dataset and studied the\nperformance of known deep convolutional network (DCN)\narchitectures on different abnormalities. We employed heat\nmaps obtained from occlusion sensitivity as a measure of\nlocalization in the CXRs. We find that the same DCN architecture\ndoesn’t perform well across all abnormalities. Shallow\nfeatures or previous layers consistently provide higher\ndetection accuracy compared to deep features. We have\nalso found ensemble models to improve classification significantly\ncompared to the single model. Combining these insights,\nwe report the highest accuracy on chest X-Ray abnormality\ndetection on this dataset. We find that in the cardiomegaly\nclassification task, where the comparison could be made, the\ndeep learning method improves the accuracy by a staggering\n17 percentage point compared to rule-based methods.\nWe applied the techniques developed along the way to the problem of tuberculosis detection on a different dataset and\nachieved the highest accuracy on that task. Our localization\nexperiments using these trained classifiers show that for\nspatially spread out abnormalities like cardiomegaly and\npulmonary edema, the network can localize the abnormalities\nsuccessfully most of the time. One remarkable result of\nthe cardiomegaly localization is that the heart and its surrounding\nregion is most responsible for cardiomegaly detection,\nin contrast to the rule-based models where the ratio of\nheart and lung area is used as the measure. We believe that\nthrough deep learning based classification and localization,\nwe will discover many more interesting features in medical\nimage diagnosis that are not considered traditionally.","authors":["Mohammad Tariqul Islam","Md Abdul Aowal","Ahmed Tahseen Minhaz","Khalid Ashraf"],"meta":["May 2017","Project: Abnormality Detection and Localization in Chest X-rays"],"references":["316867991_Shallow_Networks_for_High-accuracy_Road_Object-detection","316740882_ChestX-Ray8_Hospital-Scale_Chest_X-Ray_Database_and_Benchmarks_on_Weakly-Supervised_Classification_and_Localization_of_Common_Thorax_Diseases","313857891_A_Survey_on_Deep_Learning_in_Medical_Image_Analysis","311610632_Learning_to_Read_Chest_X-Rays_Recurrent_Neural_Cascade_Model_for_Automated_Image_Annotation","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","319770006_Learning_Deep_Features_for_Discriminative_Localization","312890808_Dermatologist-level_classification_of_skin_cancer_with_deep_neural_networks","311609041_Deep_Residual_Learning_for_Image_Recognition","311164170_Development_and_Validation_of_a_Deep_Learning_Algorithm_for_Detection_of_Diabetic_Retinopathy_in_Retinal_Fundus_Photographs","310752533_Visualizing_and_understanding_convolutional_networks"]}