{"id":"317295662_Engineering_Students_Enhancing_Employability_Skills_through_PBL","abstract":"As a developing country, Malaysia faces challenging tasks to develop her economy just like many other countries. Nowadays, change involves many aspects like the economy from agriculture to manufacturing, technology from modern to more advanced ones; mindset from traditional to advanced and so on. Previous studies show that one of the major issues facing local graduates is the lack of employability skills. This problem concerns not only the government but undergraduates and institutions alike. From the pedagogical aspect, one of the more effective ways to improve this is through instructional delivery and in this case the use of Problem-based Learning (PBL). The need to adopt PBL should involved applied subjects undertaken by engineering students. Studies have shown that the use of PBL has been proven to make learning more attractive and effective. In this research, we studied the effectiveness of PBL towards enhancing employability skills among engineering undergraduates. This study adopted a combination of qualitative and quantitative approaches. Data was collected using documents analysis. Student samples comprised manufacturing engineering undergraduates from public institutions of higher learning in Malaysia. The results show that student's employability skills can be enhanced using PBL. In addition, students become more competitive towards making them more relevance with the needs of the industry with regard to employability skills. In conclusion, PBL is a very effective catalyst towards raising the employability skills among engineering undergraduates and should be adopted in all engineering education.","authors":["Hasyamuddin Othman","khairul azhar bin mat daud","Ewon U","Berhannudin Mohd"],"meta":["May 2017IOP Conference Series Materials Science and Engineering 203(1):012024","DOI:10.1088/1757-899X/203/1/012024","Project: PBL in Engineering Education"],"references":["313321145_STEM_High_School_Teachers'_Views_of_Implementing_PBL_An_Investigation_Using_Anecdote_Circles","308124933_The_Impact_of_Transdisciplinary_Threshold_Concepts_on_Student_Engagement_in_Problem-Based_Learning_A_Conceptual_Synthesis","307757465_Employability_Skills","285740902_Employability_skills_Malaysian_employers_perspectives","283716495_Blended_learning_and_PBL_An_interactional_ethnographic_approach_to_understanding_knowledge_construction_in-situ","277648127_A_Qualitative_Study_on_How_Health_Professional_Students_and_Their_PBL_Facilitators_Perceive_the_Use_of_Mobile_Devices_During_PBL","316509994_Collaborative_Learning_Students'_Perspectives_on_How_Learning_Happens","300332944_What_Is_Real_Using_Problem-Based_Learning_in_Virtual_Worlds","273328162_A_Blended_Professional_Development_Program_to_Help_a_Teacher_Learn_to_Provide_One-to-One_Scaffolding","271689158_Ties_That_Bind_A_Social_Network_Approach_to_Understanding_Student_Integration_and_Persistence"]}