{"id":"317352362_An_Overview_of_Digital_Video_Watermarking","abstract":"The illegal distribution of a digital movie is a common and significant threat to the film industry. With the advent of high-speed broadband Internet access, a pirated copy of a digital video can now be easily distributed to a global audience. A possible means of limiting this type of digital theft is digital video watermarking whereby additional information, called a watermark, is embedded in the host video. This watermark can be extracted at the decoder and used to determine whether the video content is watermarked. This paper presents a review of digital video watermarking techniques in which their applications, challenges and important properties are discussed, and categorizes them based on the domain in which they embed the watermark. It then provides an overview of a few emerging innovative solutions using watermarks. Protecting a 3D video by watermarking is an emerging area of research. The relevant 3D video watermarking techniques in the literature are classified based on the image-based representations of a 3D video in stereoscopic, depth-image-based rendering and multi-view video watermarking. We discuss each technique and then present a survey of the literature. Finally, we provide a summary of this study and propose some future research directions.","authors":["Md. Asikuzzaman","Mark R. Pickering"],"meta":["June 2017IEEE Transactions on Circuits and Systems for Video Technology PP(99):1-1","DOI:10.1109/TCSVT.2017.2712162"],"references":["312219564_Digital_multimedia_audio_forensics_past_present_and_future","330872826_Security_Issue_and_Collusion_Attacks_in_Video_Watermarking","313768974_Fast_robust_template_matching_for_affine_resistant_image_watermarking","313061242_A_theory_for_multiresolution_signal_decomposition_The_wavelet_representation","311483959_Audio_Watermarking_Using_Spikegram_and_a_Two-Dictionary_Approach","310812406_Robust_Audio_Watermarking_Algorithm_Based_on_Empirical_Mode_Decomposition","308824421_HEVC_video_authentication_using_data_embedding_technique","307947666_A_Robust_Multibit_Multiplicative_Watermark_Decoder_Using_Vector-Based_Hidden_Markov_Model_in_Wavelet_Domain","305675432_A_literature_survey_-_various_audio_watermarking_techniques_and_their_challenges","304959281_Robust_DT_CWT-based_DIBR_3D_Video_watermarking_using_chrominance_embedding"]}