{"id":"317381028_The_Weierstrassian_movement_patterns_of_snails","abstract":"Weierstrassian Lévy walks are the archetypical form of random\nwalk that do not satisfy the central limit theorem and are\ninstead characterized by scale invariance. They were originally\nregarded as a mathematical abstraction but subsequent\ntheoretical studies showed that they can, in principle, at\nleast, be generated by chaos. Recently, Weierstrassian Lévy\nwalks have been found to provide accurate representations\nof the movement patterns of mussels (Mytilus edulis) and\nmud snails (Hydrobia ulvae) recorded in the laboratory under\ncontrolled conditions. Here, we tested whether Weierstrassian\nLévy walks and chaos are present under natural conditions\nin intertidal limpets Patella vulgata and P. rustica, and found\nthat both characteristics are pervasive. We thereby show\nthat Weierstrassian Lévy walks may be fundamental to how\nmolluscs experience and interact with the world across a\nwide range of ecological contexts. We also show in an easily\naccessible way how chaos can produce a wide variety of\nWeierstrassian Lévy walk movement patterns. Our findings\nsupport the Lévy flight foraging hypothesis that posits that\nbecause Lévy walks can optimize search efficiencies, natural\nselection should have led to adaptations for Lévy walks.","authors":["Andy Reynolds","Giacomo Santini","Guido Chelazzi","Stefano Focardi"],"meta":["June 2017Royal Society Open Science 4(160941)","DOI:10.1098/rsos.160941"],"references":["305689467_Swarm_dynamics_may_give_rise_to_Levy_flights_OPEN","305657494_Signatures_of_a_globally_optimal_searching_strategy_in_the_three-_dimensional_foraging_flights_of_bumblebees_OPEN","299471239_Signatures_of_chaos_in_animal_search_patterns_OPEN","287728117_High_activity_and_Levy_searches_jellyfish_can_search_the_water_column_like_fish","282278236_Swarming_bacteria_migrate_by_Levy_Walk","278157650_Pelagic_seabird_flight_patterns_are_consistent_with_a_reliance_on_olfactory_maps_for_Oceanic_navigation","275359522_Female_major_histocompatibility_complex_type_affects_male_testosterone_levels_and_sperm_number_in_the_horse_Equus_caballus","312983149_Foraging_success_of_biological_Levy_flights_recorded_in_situ","296350220_Levy_walks_evolve_through_interaction_between_movement_and_environmental_complexity_Science_1551","279236921_Multimodel_Inference_understanding_AIC_and_BIC_in_Model_Selection"]}