{"id":"317345726_Tourbot-interactive_museum_tele-presence_through_robotic_avatars","abstract":"TOURBOT, the acronym of a project entitled “Interactive Museum Tele-presence Through Robotic Avatars”, represents an EU-IST funded activity aiming at developing alternative ways for interactive museum tele-presence [1]. In this paper we present the project framework, with emphasis on the project goals, approach and innovations, as well as the expected benefits and results. The overal goal of TOURBOT is the development of an interactive tour-guide robot able to provide individual access to museums’ exhibits and cultural heritage over the Internet. TOURBOT operates as the user’s avatar in the museum (i.e. as a remote “representative” of the user, able to carry out actions and transmit information), by accepting commands over the Web that direct it to move in its workspace and visit specific exhibits; besides, TOURBOT can also act as a flexible, on-site museum guide. More specifically, the TOURBOT objectives are: (1) to develop a robotic avatar with advanced navigation capabilities that will be able to move autonomously in the museum’s premises, (2) to implement appropriate Web interfaces to the robotic avatar that will realize distant-user’s telepresence, i.e. facilitate scene observation through the avatars eyes, (3) to facilitate personalized and realistic observation of the museum exhibits, and (4) to enable on-site, interactive museum tour-guides.","authors":["Panos E. Trahanias","Antonis A. Argyros","Dimitris P. Tsakiris","Armin B. Cremers"],"meta":["May 2000","Conference: International WWW Conference, Culture track"],"references":["280112016_Combining_central_and_peripheral_vision_for_reactive_robot_navigation","220474320_Visual_Recognition_of_Workspace_Landmarks_for_Topological_Navigation","2948705_Position_Estimation_for_Mobile_Robots_in_Dynamic_Environments","2925039_Web_Interfaces_for_Mobile_Robots_in_Public_Places","2593695_Extending_Visual_Servoing_Techniques_to_Nonholonomic_Mobile_Robots","234828242_High-end_interactive_media_in_the_museum","220547462_Experiences_With_An_Interactive_Museum_Tour-Guide_Robot"]}