{"id":"317342345_A_study_on_the_author_collaboration_network_in_big_data","abstract":"In order to obtain a deeper understanding of the collaboration status in the big data field, we investigated the author collaboration groups and the core author collaboration groups as well as the collaboration trends in big data by combining bibliometric analysis and social network analysis. A total of 4130 papers from 13,759 authors during the period of 2011–2015 was collected. The main results indicate that 3483 of the papers are coauthored (i.e., 84.33% of all papers) from 12,016 coauthors (i.e., 87.33% of all authors), which represent a reputable level of collaboration. On the other hand, 91.83% of all the identified coauthors have published only one paper so far, reflecting a poor level of maturity of such authors. Through social network analysis, we observed that the author collaboration network is composed of small author collaboration groups and also that the authors are mainly from the computer science & technology field. As an important contribution of our study, we further analyzed the author collaboration network, culminating in the generalization of four subnet modes, which were defined by some papers: ‘dual-core’, ‘complete’, ‘bridge’ and ‘sustainable development’. It was found that the dual-core mode stands for the stage that researchers have just begun to study big data. Beginning of big data research, the complete mode tends to joint research, both the dual-core and complete modes are mostly engaged in the same project, and the bridge mode and the sustainable development mode represent, respectively, the popular and valued directions in the big data field. The results of this study can be useful for researchers interested in finding suitable partners in the big data field. By tracking the core authors and the key author collaboration groups, one can learn about the current developments in the big data field as well as predict the development prospects of such a field. Therefore, we expect with the results of our study summarized in this paper to contribute to a faster development of the big data field.","authors":["Shi Jin","Yufang Peng","Marcelo Fantinato","Jing Chen"],"meta":["December 2017Information Systems Frontiers 19(3)","DOI:10.1007/s10796-017-9771-1"],"references":["313512808_Study_on_document_author's_distribution_regulation_-_A_review_of_15_years_research_articles_on_Lotka's_and_Price's_Laws_in_China","304374264_Centrality_in_social_networks_Conceptual_clarification","290621167_Social_network_analysis_a_powerful_strategy_also_for_the_information_sciences","282982909_Mutual_Verifiable_Provable_Data_Auditing_in_Public_Cloud_Storage","272390323_Detect_structural-connected_communities_based_on_BSCHEF_in_C-DBLP","270773543_HireSome-II_Towards_Privacy-Aware_Cross-Cloud_Service_Composition_for_Big_Data_Applications","269660146_Citation_Indexing-Its_Theory_and_Application_in_Science_Technology_and_Humanities","264527698_SaC-FRAPP_A_scalable_and_cost-effective_framework_for_privacy_preservation_over_big_data_on_cloud","261838934_A_spatiotemporal_compression_based_approach_for_efficient_big_data_processing_on_Cloud","261488587_An_Iterative_Hierarchical_Key_Exchange_Scheme_for_Secure_Scheduling_of_Big_Data_Applications_in_Cloud_Computing"]}