{"id":"317319273_Working_Memory_Requires_a_Combination_of_Transient_and_Attractor-Dominated_Dynamics_to_Process_Unreliably_Timed_Inputs","abstract":"Working memory stores and processes information received as a stream of continuously incoming stimuli. This requires accurate sequencing and it remains puzzling how this can be reliably achieved by the neuronal system as our perceptual inputs show a high degree of temporal variability. One hypothesis is that accurate timing is achieved by purely transient neuronal dynamics; by contrast a second hypothesis states that the underlying network dynamics are dominated by attractor states. In this study, we resolve this contradiction by theoretically investigating the performance of the system using stimuli with differently accurate timing. Interestingly, only the combination of attractor and transient dynamics enables the network to perform with a low error rate. Further analysis reveals that the transient dynamics of the system are used to process information, while the attractor states store it. The interaction between both types of dynamics yields experimentally testable predictions and we show that this way the system can reliably interact with a timing-unreliable Hebbian-network representing long-term memory. Thus, this study provides a potential solution to the long-standing problem of the basic neuronal dynamics underlying working memory.","authors":["Timo Nachstedt","Christian Tetzlaff"],"meta":["May 2017Scientific Reports 7(1)","DOI:10.1038/s41598-017-02471-z"],"references":["311321858_Reactivation_of_latent_working_memories_with_transcranial_magnetic_stimulation","303904113_Reservoir_Computing_Properties_of_Neural_Dynamics_in_Prefrontal_Cortex","289365598_Role_of_Prefrontal_Persistent_Activity_in_Working_Memory","314100251_Memory_for_familiar_and_unfamiliar_words_Evidence_for_a_long-term_memory_contribution_to_short-term_memory_span","301232961_Dynamical_principles_in_neuroscience","301216881_Is_cortical_connectivity_optimized_for_storing_information","296722399_Looking_back_and_looking_forward","292215395_Neural_networks_and_physical_systems_with_emergent_collective_computational_abilities","283617666_Neuronal_correlate_of_visual_associative_long-term_memory_in_the_primate_temporal_cortex","282653265_Neurocognitive_Architecture_of_Working_Memory"]}