{"id":"317394600_A_Measurement_Study_of_Oculus_360_Degree_Video_Streaming","abstract":"360 degree video is anew generation of video streaming technology that promises greater immersiveness than standard video streams. This level of immersiveness is similar to that produced by virtual reality devices -- users can control the field of view using head movements rather than needing to manipulate external devices. Although 360 degree video could revolutionize streaming technology, large scale adoption is hindered by a number of factors. 360 degree video streams have larger bandwidth requirements, require faster responsiveness to user inputs, and users may be more sensitive to lower quality streams.; AB@In this paper, we review standard approaches toward 360 degree video encoding and compare these to a new, as yet unpublished, approach by Oculus which we refer to as the offset cubic projection. Compared to the standard cubic encoding, the offset cube encodes a distorted version of the spherical surface, devoting more information (i.e., pixels) to the view in a chosen direction. We estimate that the offset cube representation can produce better or similar visual quality while using less than 50% pixels under reasonable assumptions about user behavior, resulting in 5.6% to 16.4% average savings in video bitrate. During 360 degree video streaming, Oculus uses a combination of quality level adaptation and view orientation adaptation. We estimate that this combination of streaming adaptation in two dimensions can cause over 57% extra segments to be downloaded compared to an ideal downloading strategy, wasting 20% of the total downloading bandwidth.","authors":["Chao Zhou","Zhenhua Li","Yao Liu"],"meta":["June 2017","DOI:10.1145/3083187.3083190","Conference: the 8th ACM"],"references":["316515925_Viewport-Adaptive_Navigable_360-Degree_Video_Delivery","308647414_Viewport-Adaptive_Navigable_360-Degree_Video_Delivery","220090060_Human_Factors_Issues_in_Virtual_Environments_A_Review_of_the_Literature","3327793_Image_Quality_Assessment_From_Error_Visibility_to_Structural_Similarity","308810173_Live_streaming_system_for_omnidirectional_video","308571053_Optimizing_360_video_delivery_over_cellular_networks","247131283_Image_Quality_Assessment_From_Error_Visibility_to_Structural_Similarity","220693569_Transformations_and_Projections_in_Computer_Graphics"]}