{"id":"317321000_Optimal_classifier_for_imbalanced_data_using_Matthews_Correlation_Coefficient_metric","abstract":"Data imbalance is frequently encountered in biomedical applications. Resampling techniques can be used in binary classification to tackle this issue. However such solutions are not desired when the number of samples in the small class is limited. Moreover the use of inadequate performance metrics, such as accuracy, lead to poor generalization results because the classifiers tend to predict the largest size class. One of the good approaches to deal with this issue is to optimize performance metrics that are designed to handle data imbalance. Matthews Correlation Coefficient (MCC) is widely used in Bioinformatics as a performance metric. We are interested in developing a new classifier based on the MCC metric to handle imbalanced data. We derive an optimal Bayes classifier for the MCC metric using an approach based on Frechet derivative. We show that the proposed algorithm has the nice theoretical property of consistency. Using simulated data, we verify the correctness of our optimality result by searching in the space of all possible binary classifiers. The proposed classifier is evaluated on 64 datasets from a wide range data imbalance. We compare both classification performance and CPU efficiency for three classifiers: 1) the proposed algorithm (MCC-classifier), the Bayes classifier with a default threshold (MCC-base) and imbalanced SVM (SVM-imba). The experimental evaluation shows that MCC-classifier has a close performance to SVM-imba while being simpler and more efficient.","authors":["S. Boughorbel","Fethi Jarray","Mohammed El-Anbari"],"meta":["June 2017PLoS ONE 12(6):e0177678","DOI:10.1371/journal.pone.0177678"],"references":["274779912_Optimal_Thresholding_of_Classifiers_to_Maximize_F1_Measure","265419832_nDNA-prot_Identification_of_DNA-binding_Proteins_Based_on_Unbalanced_Classification","258251560_Mapping_of_Mitochondrial_RNA-Protein_Interactions_by_Digital_RNase_Footprinting","291014529_Finding_the_Best_Classification_Threshold_in_Imbalanced_Classification","288616344_Consistent_binary_classification_with_generalized_performance_metrics","288613340_On_the_statistical_consistency_of_plug-in_classifiers_for_non-decomposable_performance_measures","288613160_On_the_statistical_consistency_of_algorithms_for_binary_classification_under_class_imbalance","273303916_imDC_An_ensemble_learning_method_for_imbalanced_classification_with_miRNA_data","265614594_Imbalanced_Learning_Foundations_Algorithms_and_Applications","258368623_Composite_Binary_Losses"]}