{"id":"317389544_Node_Attribute-enhanced_Community_Detection_in_Complex_Networks","abstract":"Community detection involves grouping the nodes of a network such that nodes in the same community are more densely connected to each other than to the rest of the network. Previous studies have focused mainly on identifying communities in networks using node connectivity. However, each node in a network may be associated with many attributes. Identifying communities in networks combining node attributes has become increasingly popular in recent years. Most existing methods operate on networks with attributes of binary, categorical, or numerical type only. In this study, we introduce kNN-enhance, a simple and flexible community detection approach that uses node attribute enhancement. This approach adds the k Nearest Neighbor (kNN) graph of node attributes to alleviate the sparsity and the noise effect of an original network, thereby strengthening the community structure in the network. We use two testing algorithms, kNN-nearest and kNN-Kmeans, to partition the newly generated, attribute-enhanced graph. Our analyses of synthetic and real world networks have shown that the proposed algorithms achieve better performance compared to existing state-of-the-art algorithms. Further, the algorithms are able to deal with networks containing different combinations of binary, categorical, or numerical attributes and could be easily extended to the analysis of massive networks.","authors":["Caiyan Jia","Yafang Li","Matthew Brandon Carson","Xiaoyang Wang"],"meta":["May 2017Scientific Reports 7(1)","DOI:10.1038/s41598-017-02751-8"],"references":["305779642_A_Comparative_Analysis_of_Community_Detection_Algorithms_on_Artificial_Networks","280973893_A_parameter-free_community_detection_method_based_on_centrality_and_dispersion_of_nodes_in_complex_networks","280104768_Structure_and_inference_in_annotated_networks","277633609_Generating_Attributed_Networks_with_Communities","307631671_The_pagerank_citation_ranking_Bringing_order_to_the_web","291974275_Mixture_models_and_exploratory_analysis_in_networks","290658262_Fast_kNN_Graph_Construction_with_Locality_Sensitive_Hashing","289706442_Network_structure_exploration_in_networks_with_node_attributes","289436295_PICS_Parameter-free_Identification_of_Cohesive_Subgroups_in_Large_Attributed_Graphs","271556379_Tree-Like_Structure_in_Large_Social_and_Information_Networks"]}