{"id":"317344248_Understanding_the_Inefficiency_of_Security-Constrained_Economic_Dispatch","abstract":"The security-constrained economic dispatch (SCED) problem tries to maintain the reliability of a power network by ensuring that a single failure does not lead to a global outage. The previous research has mainly investigated SCED by formulating the problem in different modalities, e.g. preventive or corrective, and devising efficient solutions for SCED. In this paper, we tackle a novel and important direction, and analyze the economic cost of incorporating security constraints in economic dispatch. Inspired by existing inefficiency metrics in game theory and computer science, we introduce notion of price of security as a metric that formally characterizes the economic inefficiency of security-constrained economic dispatch as compared to the original problem without security constraints. Then, we focus on the preventive approach in a simple topology comprising two buses and two lines, and investigate the impact of generation availability and demand distribution on the price of security. Moreover, we explicitly derive the worst-case input instance that leads to the maximum price of security. By extensive experimental study on two test-cases, we verify the analytical results and provide insights for characterizing the price of security in general networks.","authors":["Mohammad H. Hajiesmaili","Desmond W. H. Cai","Enrique Mallada"],"meta":["June 2017"],"references":["324216597_Optimal_load-side_control_for_frequency_regulation_in_smart_grids","322669222_Understanding_the_inefficiency_of_security-constrained_economic_dispatch","306117166_A_unified_framework_for_frequency_control_and_congestion_management","304410508_Distributed_optimization_decomposition_for_joint_economic_dispatch_and_frequency_regulation","281084315_Peak-Aware_Online_Economic_Dispatching_for_Microgrids","273392398_Computational_Study_of_Security_Constrained_Economic_Dispatch_With_Multi-Stage_Rescheduling","266856573_Optimal_Load-Side_Control_for_Frequency_Regulation_in_Smart_Grids","326127599_Peak-aware_online_economic_dispatching_for_microgrids","272969162_Power_generation_operation_and_control_-_2nd_Edition","260509524_A_Computational_Strategy_to_Solve_Preventive_Risk-Based_Security-Constrained_OPF"]}