{"id":"317300557_The_Metric_Tide_Report_of_the_Independent_Review_of_the_Role_of_Metrics_in_Research_Assessment_and_Management","abstract":"The Independent Review of the Role of Metrics in Research Assessment and Management was set up in April 2014 to investigate the current and potential future roles that quantitative indicators can play in the assessment and management of research. Its report, ‘The Metric Tide’, was published in July 2015 and is available below.\n\nThe review was chaired by James Wilsdon, professor of science and democracy at the University of Sussex, supported by an independent and multidisciplinary group of experts in scientometrics, research funding, research policy, publishing, university management and research administration. Through 15 months of consultation and evidence-gathering, the review looked in detail at the potential uses and limitations of research metrics and indicators, exploring the use of metrics within institutions and across disciplines.\n\nThe main findings of the review include the following: \n\nThere is considerable scepticism among researchers, universities, representative bodies and learned societies about the broader use of metrics in research assessment and management.\nPeer review, despite its flaws, continues to command widespread support as the primary basis for evaluating research outputs, proposals and individuals. However, a significant minority are enthusiastic about greater use of metrics, provided appropriate care is taken.\nCarefully selected indicators can complement decision-making, but a ‘variable geometry’ of expert judgement, quantitative indicators and qualitative measures that respect research diversity will be required.\nThere is legitimate concern that some indicators can be misused or ‘gamed’: journal impact factors, university rankings and citation counts being three prominent examples.\nThe data infrastructure that underpins the use of metrics and information about research remains fragmented, with insufficient interoperability between systems.\nAnalysis concluded that that no metric can currently provide a like-for-like replacement for REF peer review.\nIn assessing research outputs in the REF, it is not currently feasible to assess research outputs or impacts in the REF using quantitative indicators alone.\nIn assessing impact in the REF, it is not currently feasible to use quantitative indicators in place of narrative case studies. However, there is scope to enhance the use of data in assessing research environments. \nThe review identified 20 recommendations for further work and action by stakeholders across the UK research system. They propose action in the following areas: supporting the effective leadership, governance and management of research cultures; improving the data infrastructure that supports research information management; increasing the usefulness of existing data and information sources; using metrics in the next REF; and coordinating activity and building evidence.\n\nThese recommendations are underpinned by the notion of ‘responsible metrics’ as a way of framing appropriate uses of quantitative indicators in the governance, management and assessment of research. Responsible metrics can be understood in terms of the following dimensions: \n\nRobustness: basing metrics on the best possible data in terms of accuracy and scope\nHumility: recognising that quantitative evaluation should support – but not supplant – qualitative, expert assessment\nTransparency: keeping data collection and analytical processes open and transparent, so that those being evaluated can test and verify the results\nDiversity: accounting for variation by field, and using a range of indicators to reflect and support a plurality of research and researcher career paths across the system\nReflexivity: recognising and anticipating the systemic and potential effects of indicators, and updating them in response.\n\ntext from: http://www.hefce.ac.uk/pubs/rereports/year/2015/metrictide/","authors":["James Wilsdon","Liz Allen","Eleonora Belfiore","P. Campbell"],"meta":["July 2015","Project: Responsible metrics for higher education & research"],"references":["277978661_The_Resource_Identification_Initiative_A_Cultural_Shift_in_Publishing","277884668_Accounting_for_Impact_The_Journal_Impact_Factor_and_the_Making_of_Biomedical_Research_in_the_Netherlands","269633755_Comparing_Comparisons_On_Rankings_and_Accounting_in_Hospitals_and_Universities","267828675_Performance_Metrics_as_Formal_Structures_and_through_the_Lens_of_Social_Mechanisms_When_Do_They_Work_and_How_Do_They_Influence_Performance_Metrics_as_Formal_Structures_and_through_the_Lens_of_Social_M","260248701_'A_number_you_just_can't_get_away_from_Characteristics_of_Adoption_and_the_Social_Construction_of_Metric_Use_by_Researchers'","336761311_The_Evaluation_Society","309309468_Breaking_the_silence_The_hidden_injuries_of_neo-liberal_academia","269633741_To_intervene_or_not_to_intervene_is_that_the_question_On_the_role_of_scientometrics_in_research_evaluation_To_Intervene_or_Not_to_Intervene_Is_That_the_Question_On_the_Role_of_Scientometrics_in_Resear","260307048_Perverse_Audit_Culture_and_Accountability_of_the_Modern_Public_University","259979351_Living_with_the_H-Index_Metric_Assemblages_in_the_Contemporary_Academy","249672225_Audit_Culture_and_Illiberal_Governance_Universities_and_the_Politics_of_Accountability","249176686_Rankings_and_Reactivity_How_Public_Measures_Recreate_Social_Worlds","257663101_What_do_the_scientists_think_about_the_impact_factor","251503144_Performance-Based_University_Research_Funding_Systems","247717478_Stressing_Academe_The_Wear_and_Tear_of_the_New_Public_Management"]}