{"id":"317350195_A_Concurrent_Exploratory_Study_on_Sectoral_Engagement_Model_of_an_Altruistic_Corporate_Social_Responsibility_in_Bureau_of_Jail_Management_and_Penology","abstract":"This paper presents the Sectoral Engagement Model of an Altruistic Corporate Social Responsibility in Bureau of Jail Management and Penology. University of Makati-College of Computer Science is true to its vision to providing information technology education committed to the development and adequate utilization and applications of information technology serve as ground inspirations to offer training inside the Makati City Jail for their residences. This study was conducted for the purpose of determining the status of learning basic computer application and basic troubleshooting in the Bureau of Jail Management and Penology inmates which form part of the college Altruistic Corporate Social Responsibility using the Concurrent Exploratory Research Methodology. Significantly, the majority of the respondents have an applied hands-on and experienced lesson from the actual training in the basic troubleshooting part of the program. The CSR provided an equal opportunity to adapt to an industry-based learning that they can use outside the vicinity of BJMP as their possible way of starting a new life.","authors":["Alexander B Pahayahay","Nelson Asejo","Shirley M Pangan","Daniel Dasig Jr"],"meta":["April 2017","DOI:10.24088/IJBEA-2017-22003"],"references":["9042569_The_Nature_of_Human_Altruism","313162771_Putting_the_altruism_back_into_altruism_The_evolution_of_empathy","265200808_Outreach_and_Engagement_at_Tennessee_State_University","249707377_Functional_Literacy_Education_for_Jail_Inmates_An_Examination_of_the_Hillsborough_County_Jail_Education_Program","244958603_A_Meta-Analysis_of_Corrections-Based_Education_Vocation_and_Work_Programs_for_Adult_Offenders","240141620_Normative_Inuences_on_Altruism","235700625_Advance_Mixed_methods_Research_Designs","234627552_Adult_Correctional_Education_Programs_An_Update_on_Current_Status_Based_on_Recent_Studies","232786877_Reciprocal_altruism_in_Papio_Anubis","24117541_Prison-Based_Education_and_Re-Entry_into_the_Mainstream_Labor_Market"]}