{"id":"317326997_Segment-before-Detect_Vehicle_Detection_and_Classification_through_Semantic_Segmentation_of_Aerial_Images","abstract":"Like computer vision before, remote sensing has been radically changed by the introduction of deep learning and, more notably, Convolution Neural Networks. Land cover classification, object detection and scene understanding in aerial images rely more and more on deep networks to achieve new state-of-the-art results. Recent architectures such as Fully Convolutional Networks can even produce pixel level annotations for semantic mapping. In this work, we present a deep-learning based segment-before-detect method for segmentation and subsequent detection and classification of several varieties of wheeled vehicles in high resolution remote sensing images. This allows us to investigate object detection and classification on a complex dataset made up of visually similar classes, and to demonstrate the relevance of such a subclass modeling approach. Especially, we want to show that deep learning is also suitable for object-oriented analysis of Earth Observation data as effective object detection can be obtained as a byproduct of accurate semantic segmentation. First, we train a deep fully convolutional network on the ISPRS Potsdam and the NZAM/ONERA Christchurch datasets and show how the learnt semantic maps can be used to extract precise segmentation of vehicles. Then, we show that those maps are accurate enough to perform vehicle detection by simple connected component extraction. This allows us to study the repartition of vehicles in the city. Finally, we train a Convolutional Neural Network to perform vehicle classification on the VEDAI dataset, and transfer its knowledge to classify the individual vehicle instances that we detected.","authors":["Nicolas Audebert","Bertrand Le Saux","Sébastien Lefèvre"],"meta":["April 2017Remote Sensing 9(4)","DOI:10.3390/rs9040368"],"references":["314523089_Semantic_Segmentation_of_Earth_Observation_Data_Using_Multimodal_and_Multi-scale_Deep_Networks","311201659_Classification_With_an_Edge_Improving_Semantic_Image_Segmentation_with_Boundary_Detection","309775409_How_useful_is_region-based_classification_of_remote_sensing_images_in_a_deep_learning_framework","307530684_SEMANTIC_SEGMENTATION_OF_AERIAL_IMAGES_WITH_AN_ENSEMBLE_OF_CNNS","319770420_Semantic_Image_Segmentation_with_Deep_Convolutional_Nets_and_Fully_Connected_CRFs","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","311609041_Deep_Residual_Learning_for_Image_Recognition","309774599_Fully_convolutional_neural_networks_for_remote_sensing_image_classification","308847282_Effective_semantic_pixel_labelling_with_convolutional_networks_and_Conditional_Random_Fields","308496499_Deep_feature_representations_for_high-resolution_remote_sensing_scene_classification"]}