{"id":"317378754_Dynamic_metabolic_modeling_of_heterotrophic_and_mixotrophic_microalgal_growth_on_fermentative_wastes","abstract":"Microalgae are promising microorganisms for the production of numerous molecules of interest, such as pigments, proteins or triglycerides that can be turned into biofuels. Heterotrophic or mixotrophic growth on fermentative wastes represents an interesting approach to achieving higher biomass concentrations, while reducing cost and improving the environmental footprint. Fermentative wastes generally consist of a blend of diverse molecules and it is thus crucial to understand microalgal metabolism in such conditions, where switching between substrates might occur. Metabolic modeling has proven to be an efficient tool for understanding metabolism and guiding the optimization of biomass or target molecule production. Here, we focused on the metabolism of Chlorella sorokiniana growing heterotrophically and mixotrophically on acetate and butyrate. The metabolism was represented by 172 metabolic reactions. The DRUM modeling framework with a mildly relaxed quasi-steady-state assumption was used to account for the switching between substrates and the presence of light. Ten experiments were used to calibrate the model and eight experiments for the validation. The model efficiently predicted the experimental data, including the transient behavior during heterotrophic, autotrophic, mixotrophic and diauxic growth. It shows that an accurate model of metabolism can now be constructed, even in dynamic conditions, with the presence of several carbon substrates. It also opens new perspectives for the heterotrophic and mixotrophic use of microalgae, especially for biofuel production from wastes.","authors":["Caroline Baroukh","Violette Turon","Olivier Bernard"],"meta":["June 2017PLoS Computational Biology 13(6):e1005590","DOI:10.1371/journal.pcbi.1005590"],"references":["264553106_DRUM_A_New_Framework_for_Metabolic_Modeling_under_Non-Balanced_Growth_Application_to_the_Carbon_Metabolism_of_Unicellular_Microalgae","313421053_Advances_in_Biochemical_EngineeringBiotechnology","313067960_Int_J_Hydrogen_Energy","286290582_Curr_Opin_Biotechnol","284816400_Int_J_Hydrogen_Energy","282878184_Growth_of_Chlorella_sorokiniana_on_a_mixture_of_volatile_fatty_acids_The_effects_of_light_and_temperature","275413850_A_state_of_the_art_of_metabolic_networks_of_unicellular_microalgae_and_cyanobacteria_for_biofuel_production","274264352_Mathematical_modeling_of_unicellular_microalgae_and_cyanobacteria_metabolism_for_biofuel_production","268146832_Use_of_fermentative_metabolites_for_heterotrophic_microalgae_growth_Yields_and_kinetics","263852848_Comput_J_7_308_1965","226902313_Production_of_high-density_Chlorella_culture_grown_in_fermenters","41825869_What_is_ux_balance_analysis","256530335_The_role_of_chemical_engineering_in_biotechnology","234104040_Photoheterotrophic_growth_of_Chlorella_vulgaris_ESP6_on_organic_acids_from_dark_hydrogen_fermentation_effluents","221716130_Metabolic_modeling_of_Chlamydomonas_reinhardtii_Energy_requirements_for_photoautotrophic_growth_and_maintenance"]}