{"id":"317300051_Sinkhorn-AutoDiff_Tractable_Wasserstein_Learning_of_Generative_Models","abstract":"The ability to compare two degenerate probability distributions (i.e. two probability distributions supported on two distinct low-dimensional manifolds living in a much higher-dimensional space) is a crucial problem arising in the estimation of generative models for high-dimensional observations such as those arising in computer vision or natural language. It is known that optimal transport metrics can represent a cure for this problem, since they were specifically designed as an alternative to information divergences to handle such problematic scenarios. Unfortunately, training generative machines using OT raises formidable computational and statistical challenges, because of (i) the computational burden of evaluating OT losses, (ii) the instability and lack of smoothness of these losses, (iii) the difficulty to estimate robustly these losses and their gradients in high dimension. This paper presents the first tractable computational method to train large scale generative models using an optimal transport loss, and tackles both these issues by relying on two key ideas: (a) entropic smoothing, which turns the original OT loss into one that can be computed using Sinkhorn fixed point iterations; (b) algorithmic (automatic) differentiation of these iterations. These two approximations result in a robust and differentiable approximation of the OT loss with streamlined GPU execution. The resulting computational architecture complements nicely standard deep network generative models by a stack of extra layers implementing the loss function.","authors":["Aude Genevay","Gabriel Peyré","Marco Cuturi"],"meta":["June 2017"],"references":["317062399_From_optimal_transport_to_generative_modeling_the_VEGAN_cookbook","312521008_Inference_in_generative_models_using_the_Wasserstein_distance","288889700_Autoencoding_beyond_pixels_using_a_learned_similarity_metric","281947241_Domain_Adaptation_with_Regularized_Optimal_Transport","278733698_Learning_with_a_Wasserstein_Loss","230795276_Learning_Probability_Measures_with_respect_to_Optimal_Transport_Metrics","220132573_Barycenters_in_the_Wasserstein_Space","319770355_Generative_Adversarial_Nets","306146231_From_word_embeddings_to_document_distances","303655962_Stochastic_Optimization_for_Large-scale_Optimal_Transport","279968704_Wasserstein_Training_of_Boltzmann_Machines","269935079_Adam_A_Method_for_Stochastic_Optimization","259400035_Auto-Encoding_Variational_Bayes","258232282_On_the_empirical_estimation_of_integral_probability_metrics","257836724_Fast_Computation_of_Wasserstein_Barycenters","237053780_Sinkhorn_Distances_Lightspeed_Computation_of_Optimal_Transportation_Distances","220483863_A_Kernel_Method_for_the_Two-Sample_Problem","41781721_A_Kernel_Method_for_the_Two-Sample-Problem","38365974_A_Relationship_Between_Arbitrary_Positive_Matrices_and_Doubly_Stochastic_Matrices","23635500_On_minimum_Kantorovich_distance_estimators"]}