{"id":"317399341_InfoVAE_Information_Maximizing_Variational_Autoencoders","abstract":"It has been previously observed that variational autoencoders tend to ignore the latent code when combined with a decoding distribution that is too flexible. This undermines the purpose of unsupervised representation learning. We identify the reason for this short-coming in the regularization term used in the ELBO criterion to match the variational posterior to the latent prior distribution. We show that removing this regularization term leads to a model that can still discover meaningful latent features. Even though ancestral sampling is no longer tractable, sampling is possible using a Markov chain. Furthermore, we propose a class of training criteria that use alternative divergences for the regularization term, generalizing the standard ELBO which employs KL divergence. These models can discover meaningful latent features and allow for tractable ancestral sampling. In particular, we propose an alternative based on Maximum Mean Discrepancy (MMD) that is simple to implement, robust, and has similar or better performance in every quantitative and qualitative metric we experimented on.","authors":["Shengjia Zhao","Jiaming Song","Stefano Ermon"],"meta":["June 2017","Project: Learning Representations with Generative Models"],"references":["310329534_PixelVAE_A_Latent_Variable_Model_for_Natural_Images","319770221_Ladder_Variational_Autoencoders","319770134_Stochastic_Backpropagation_and_Approximate_Inference_in_Deep_Generative_Models","315765101_Improved_Training_of_Wasserstein_GANs","312550770_PixelCNN_Improving_the_PixelCNN_with_Discretized_Logistic_Mixture_Likelihood_and_Other_Modifications","306226170_Stein_Variational_Gradient_Descent_A_General_Purpose_Bayesian_Inference_Algorithm","304127977_Early_Visual_Concept_Learning_with_Unsupervised_Deep_Learning","303993361_Improving_Variational_Inference_with_Inverse_Autoregressive_Flow","303755314_f-GAN_Training_Generative_Neural_Samplers_using_Variational_Divergence_Minimization","301874314_Pixel_Recurrent_Neural_Networks"]}