{"id":"317388983_A_questionnaire_for_assessing_breastfeeding_intentions_and_practices_in_Nigeria_Validity_reliability_and_translation","abstract":"Background\nValidating a questionnaire/instrument (whether developed or adapted) before proceeding to the field for data collection is important. This article presents the modification of an Irish questionnaire for a Nigerian setting. The validation process and reliability testing of this questionnaire (which was used in assessing previous breastfeeding practices and breastfeeding intentions of pregnant women in English and Hausa languages) were also presented.\n\nMethod\nFive experts in the field of breastfeeding and infant feeding voluntarily and independently evaluated the instrument. The experts evaluated the various items of the questionnaire based on relevance, clarity, simplicity and ambiguity on a Likert scale of 4. The analysis was performed to determine the content validity index (CVI).Two language experts performed the translation and back-translation. Ten pregnant women completed questionnaires which were evaluated for internal consistency. Two other pregnant women completed the questionnaire twice at an interval of two weeks to test the reliability. SPSS version 21 was used to calculate the coefficient of reliability.\n\nResults\nThe content validity index was high (0.94 for relevance, clarity and ambiguity and 0.96 for simplicity). The analysis suggested that four of the seventy one items should be removed.\nCronbach’s Alpha was 0.81, while the reliability coefficient was 0.76. The emerged validated questionnaire was translated from English to Hausa, then, back-translated into English and compared for accuracy.\n\nConclusion\nThe final instrument is reliable and valid for data collection on breastfeeding in Nigeria among English and Hausa speakers. Therefore, the instrument is recommended for use in assessing breastfeeding intention and practices in Nigeria.\n\nElectronic supplementary material\nThe online version of this article (doi:10.1186/s12884-017-1366-9) contains supplementary material, which is available to authorized users.","authors":["Andy Emmanuel","Sheila Clow"],"meta":["June 2017BMC Pregnancy and Childbirth 17(179)","DOI:10.1186/s12884-017-1366-9"],"references":["277034169_Content_validity_and_its_estimation","261473819_Validity_and_Reliability_in_Social_Science_Research","23386936_Effect_of_WHO_Newborn_Care_Training_on_Neonatal_Mortality_by_Education","19522289_Determination_and_Quantification_Of_Content_Validity","6815851_The_Content_Validity_Index_Are_you_sure_you_know_what's_being_reported_Critique_and_recommendations"]}