{"id":"317405940_Stereo_Vision-Based_Tracking_of_Soft_Tissue_Motion_with_Application_to_Online_Ablation_Control_in_Laser_Microsurgery","abstract":"Recent research has revealed that image-based methods can enhance accuracy and safety in laser microsurgery. In this study, non-rigid tracking using surgical stereo imaging and its application to laser ablation is discussed. A recently developed motion estimation framework based on piecewise affine deformation modeling is extended by a mesh refinement step and considering texture information. This compensates for tracking inaccuracies potentially caused by inconsistent feature matches or drift. To facilitate online application of the method, computational load is reduced by concurrent processing and affine-invariant fusion of tracking and refinement results. The residual latency-dependent tracking error is further minimized by Kalman filter-based upsampling, considering a motion model in disparity space. Accuracy is assessed in laparoscopic, beating heart, and laryngeal sequences with challenging conditions, such as partial occlusions and significant deformation. Performance is compared with that of state-of-the-art methods. In addition, the online capability of the method is evaluated by tracking two motion patterns performed by a high-precision parallel-kinematic platform. Related experiments are discussed for tissue substitute and porcine soft tissue in order to compare performances in an ideal scenario and in a setup mimicking clinical conditions. Regarding the soft tissue trial, the tracking error can be significantly reduced from 0.72 mm to below 0.05 mm with mesh refinement. To demonstrate online laser path adaptation during ablation, the non-rigid tracking framework is integrated into a setup consisting of a surgical Er:YAG laser, a three-axis scanning unit, and a low-noise stereo camera. Regardless of the error source, such as laser-to-camera registration, camera calibration, image-based tracking, and scanning latency, the ablation root mean square error is kept below 0.21 mm when the sample moves according to the aforementioned patterns. Final experiments regarding motion-compensated laser ablation of structurally deforming tissue highlight the potential of the method for vision-guided laser surgery.","authors":["Andreas Schoob","Dennis Kundrat","Lüder Alexander Kahrs","Tobias Ortmaier"],"meta":["June 2017Medical Image Analysis 40","DOI:10.1016/j.media.2017.06.004"],"references":["305716814_Endoscopic_Laser_Surgery_Design_Modeling_and_Control","319770530_Non-parametric_local_transforms_for_computing_visual_correspondence","313074785_Robust_Real-Time_Dense_and_Deformable_3D_Organ_Tracking_in_Laparoscopic_Videos","313008162_Non-parametric_local_transform_for_computing_visual_correspondence","312913388_Variation_of_Box_Plots","308272679_Real-time_Target_Tracking_of_Soft_Tissues_in_3D_Ultrasound_Images_Based_on_Robust_Visual_Information_and_Mechanical_Simulation","304184923_A_comparative_study_of_transformation_models_for_the_sequential_mosaicing_of_long_retinal_sequences_of_slit-lamp_images_obtained_in_a_closed-loop_motion","303739488_Soft_tissue_motion_tracking_with_application_to_tablet-based_incision_planning_in_laser_surgery","288941138_Efficient_region_tracking_with_paramteric_models_of_geometry_and_illumination","284013448_Online_Tracking_and_Retargeting_with_Applications_to_Optical_Biopsy_in_Gastrointestinal_Endoscopic_Examinations"]}