{"id":"317415397_Optimal_decentralized_protocol_for_electric_vehicle_charging","abstract":"We propose a decentralized algorithm to optimally schedule electric vehicle (EV) charging. The algorithm exploits the elasticity of electric vehicle loads to fill the valleys in electric load profiles. We first formulate the EV charging scheduling problem as an optimal control problem, whose objective is to impose a generalized notion of valley-filling, and study properties of optimal charging profiles. We then give a decentralized algorithm to iteratively solve the optimal control problem. In each iteration, EVs update their charging profiles according to the control signal broadcast by the utility company, and the utility company alters the control signal to guide their updates. The algorithm converges to optimal charging profiles (that are as “flat” as they can possibly be) irrespective of the specifications (e.g., maximum charging rate and deadline) of EVs, even if EVs do not necessarily update their charging profiles in every iteration, and use potentially outdated control signal when they update. Moreover, the algorithm only requires each EV solving its local problem, hence its implementation requires low computation capability. We also extend the algorithm to track a given load profile and to real-time implementation.","authors":["Lingwen Gan","Ufuk Topcu","Steven Low"],"meta":["May 2013Power Systems, IEEE Transactions on 28:940-951","DOI:10.1109/TPWRS.2012.2210288"],"references":["224220548_Decentralized_Charging_Control_for_Large_Populations_of_Plug-in_Electric_Vehicles","224180167_Integration_of_Electric_Vehicles_in_the_Electric_Power_System","224145463_Impact_of_TOU_rates_on_distribution_load_shapes_in_smart_grid_with_PHEV_penetration","224407998_Coordinated_charging_of_multiple_plug-in_hybrid_electric_vehicles_in_residential_distribution_grids","224387555_Grid_of_the_future","224373169_Power_system_level_impacts_of_PHEVs","224204599_Coordinated_Charging_of_Plug-In_Hybrid_Electric_Vehicles_to_Minimize_Distribution_System_Losses","224118923_Analyzing_the_impacts_of_plug-in_electric_vehicles_on_distribution_networks_in_British_Columbia"]}