{"id":"317488035_Learning_Entity_and_Relation_Embeddings_for_Knowledge_Resolution","abstract":"Knowledge resolution is the task of clustering knowledge mentions, e.g., entity and relation mentions into several disjoint groups with each group representing a unique entity or relation. Such resolution is a central step in constructing high-quality knowledge graph from unstructured text. Previous research has tackled this problem by making use of various textual and structural features from a semantic dictionary or a knowledge graph. This may lead to poor performance on knowledge mentions with poor or not well-known contexts. In addition, it is also limited by the coverage of the semantic dictionary or knowledge graph. In this work, we propose ETransR, a method which automatically learns entity and relation feature representations in continuous vector spaces, in order to measure the semantic relatedness of knowledge mentions for knowledge resolution. Experimental results on two benchmark datasets show that our proposed method delivers significant improvements compared with the state-of-the-art baselines on the task of knowledge resolution.","authors":["Hailun Lin","Yong Liu","Weiping Wang","Yinliang Yue"],"meta":["December 2017Procedia Computer Science 108:345-354","DOI:10.1016/j.procs.2017.05.045"],"references":["319207032_Knowledge_Graph_Embedding_by_Translating_on_Hyperplanes","265594447_Multi-Relational_Latent_Semantic_Analysis","265594303_Typed_Tensor_Decomposition_of_Knowledge_Bases_for_Relation_Extraction","263609596_A_Semantic_Matching_Energy_Function_for_Learning_with_Multi-relational_Data","252068694_Factorizing_YAGO_Scalable_Machine_Learning_for_Linked_Data","319770263_Reasoning_With_Neural_Tensor_Networks_for_Knowledge_Base_Completion","291295837_Reasoning_with_neural_tensor_networks_for_knowledge_base_completion","279258225_Translating_Embeddings_for_Modeling_Multi-relational_Data","276465229_Crowdsourcing_algorithms_for_entity_resolution","266660245_Knowledge_vault_A_web-scale_approach_to_probabilistic_knowledge_fusion"]}