{"id":"317443548_Illuminant_estimation_in_multispectral_imaging","abstract":"With the advancement in sensor technology, the use of multispectral imaging is gaining wide popularity for computer vision applications. Multispectral imaging is used to achieve better discrimination between the radiance spectra, as compared to the color images. However, it is still sensitive to illumination changes. This study evaluates the potential evolution of illuminant estimation models from color to multispectral imaging. We first present a state of the art on computational color constancy and then extend a set of algorithms to use them in multispectral imaging. We investigate the influence of camera spectral sensitivities and the number of channels. Experiments are performed on simulations over hyperspectral data. The outcomes indicate that extension of computational color constancy algorithms from color to spectral gives promising results and may have the potential to lead towards efficient and stable representation across illuminants. However, this is highly dependent on spectral sensitivities and noise. We believe that the development of illuminant invariant multispectral imaging systems will be a key enabler for further use of this technology.","authors":["Haris Ahmad Khan","Jean Baptiste Thomas","Jon Yngve Hardeberg","Olivier Laligant"],"meta":["July 2017Journal of the Optical Society of America A 34(7):1085","DOI:10.1364/JOSAA.34.001085","Project: Multispectral constancy for illuminant invariant representation of multispectral images"],"references":["312527167_Energy_balance_in_Spectral_Filter_Array_camera_design","304617539_Spectral_Characterization_of_a_Prototype_SFA_Camera_for_Joint_Visible_and_NIR_Acquisition","304187571_The_Reproduction_Angular_Error_for_Evaluating_the_Performance_of_Illuminant_Estimation_Algorithms","312652665_Influence_of_adaptation_on_the_effects_produced_by_luminous_stimuli","312604690_A_spatial_processor_model_for_object_color_perception","308851390_Effective_learning-based_illuminant_estimation_using_simple_features","308849155_Color_constancy_using_CNNs","308671449_Illuminant_estimation_from_uncalibrated_multispectral_images","308277745_Deep_Specialized_Network_for_Illuminant_Estimation","306350102_Approaching_the_Computational_Color_Constancy_as_a_Classification_Problem_through_Deep_Learning"]}