{"id":"317417939_Robotics_course_-_A_challenge_for_computer_science_students","abstract":"Creating a good syllabus for any subject is challenging. This is even more so for the courses that are supported by hardware components, or the courses that evolve rapidly, as technology evolves. A course that encompasses both of the challenges is the course of Robotics. Even more so, this subject could be thought using different approaches, for different type of the audience that takes the course. For example, the subject could be thought to mechanical engineers, which are usually acquainted with hardware, or to software students, that usually lack the hardware knowledge. This paper elaborates on the evolution of creating the syllabus for the course Robotics thought in a Computer Science curriculum. The challenges that were successfully overcome, the increased student satisfaction and the creation of more difficult student projects in this course are given as a result of such an evolution of this particular Robotics course. The increased interest resulted in generating more Diploma Theses in the area of Robotics.","authors":["Vesna Kirandziska","Nevena Ackovska"],"meta":["April 2017","DOI:10.1109/EDUCON.2017.7942963","Conference: 2017 IEEE Global Engineering Education Conference (EDUCON)","Project: Hardware Education Challenges"],"references":["258792932_A_One-Year_Introductory_Robotics_Curriculum_for_Computer_Science_Upperclassmen","319369669_Teaching_Robotics_for_Computer_Science_Students","281274212_Positive_experience_of_the_project_gamification_in_the_microprocessors_and_Microcontrollers_course","265686100_OER_Approach_for_Specific_Student_Groups_in_Hardware-Based_Courses","260941291_Robotics_for_computer_scientists_what's_the_big_idea","260587516_The_Robotic_Decathlon_Project-Based_Learning_Labs_and_Curriculum_Design_for_an_Introductory_Robotics_Course","229708216_Teaching_fundamentals_of_robotics_to_computer_scientists","228453581_Seven_big_ideas_in_robotics_and_how_to_teach_them","221251072_Robotics_Across_the_Curriculum"]}