{"id":"317489055_Cataloging_GitHub_Repositories","abstract":"GitHub is one of the largest and most popular repository hosting service today, having about 14 million users and more than 54 million repositories as of March 2017. This makes it an excellent platform to find projects that developers are interested in exploring. GitHub showcases its most popular projects by cataloging them manually into categories such as DevOps tools, web application frameworks, and game engines. We propose that such cataloging should not be limited only to popular projects. We explore the possibility of developing such cataloging system by automatically extracting functionality descriptive text segments from readme files of GitHub repositories. These descriptions are then input to LDA-GA, a state-of-the-art topic modeling algorithm, to identify categories. Our preliminary experiments demonstrate that additional meaningful categories which complement existing GitHub categories can be inferred. Moreover, for inferred categories that match GitHub categories, our approach can identify additional projects belonging to them. Our experimental results establish a promising direction in realizing automatic cataloging system for GitHub.","authors":["Abhishek Sharma","Ferdian Thung","Pavneet Singh Kochhar","Agus Sulistya"],"meta":["June 2017","DOI:10.1145/3084226.3084287","Conference: the 21st International Conference"],"references":["307868217_What_Security_Questions_Do_Developers_Ask_A_Large-Scale_Study_of_Stack_Overflow_Posts","303513577_A_Large_Scale_Study_of_Multiple_Programming_Languages_and_Code_Quality","290123178_Assert_Use_in_GitHub_Projects","266656199_An_exploratory_study_of_the_pull-based_software_development_model","261355766_Network_Structure_of_Social_Coding_in_GitHub","257559885_What_are_developers_talking_about_An_analysis_of_topics_and_trends_in_Stack_Overflow","320070983_A_large-scale_study_of_programming_languages_and_code_quality_in_GitHub","308730067_What's_hot_in_software_engineering_Twitter_space","269634115_A_large_scale_study_of_programming_languages_and_code_quality_in_github","242637644_An_Algorithm_for_Suffix_Stripping"]}