{"id":"317426798_PointNet_Deep_Hierarchical_Feature_Learning_on_Point_Sets_in_a_Metric_Space","abstract":"Few prior works study deep learning on point sets. PointNet by Qi et al. is a pioneer in this direction. However, by design PointNet does not capture local structures induced by the metric space points live in, limiting its ability to recognize fine-grained patterns and generalizability to complex scenes. In this work, we introduce a hierarchical neural network that applies PointNet recursively on a nested partitioning of the input point set. By exploiting metric space distances, our network is able to learn local features with increasing contextual scales. With further observation that point sets are usually sampled with varying densities, which results in greatly decreased performance for networks trained on uniform densities, we propose novel set learning layers to adaptively combine features from multiple scales. Experiments show that our network called PointNet++ is able to learn deep point set features efficiently and robustly. In particular, results significantly better than state-of-the-art have been obtained on challenging benchmarks of 3D point clouds.","authors":["Charles Ruizhongtai Qi","Li Yi","Hao Su","Leonidas J. Guibas"],"meta":["June 2017"],"references":["318611896_O-CNN_Octree-based_Convolutional_Neural_Networks_for_3D_Shape_Analysis","311411614_PointNet_Deep_Learning_on_Point_Sets_for_3D_Classification_and_Segmentation","310823324_A_scalable_active_framework_for_region_annotation_in_3D_shape_collections","301818275_Volumetric_and_Multi-View_CNNs_for_Object_Classification_on_3D_Data","320971207_SyncSpecCNN_Synchronized_Spectral_CNN_for_3D_Shape_Segmentation","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","316912821_Deep_Learning_with_Geodesic_Moments_for_3D_Shape_Classification","311609041_Deep_Residual_Learning_for_Image_Recognition","309050537_Discrete_differential-geometry_operators_for_triangulated_2-manifolds","308861868_3D_ShapeNets_A_deep_representation_for_volumetric_shapes"]}