{"id":"317404649_A_hybridization_of_Genetic_Algorithms_and_Fuzzy_Logic_for_the_Single-Machine_Scheduling_with_Flexible_Maintenance_problem_under_Human_Resource_Constraints","abstract":"This work focuses on the problem of scheduling jobs on a single machine that requires flexible maintenance under human resource competence and availability constraints. To solve the problem we developed two fuzzy genetic algorithms that are based on respectively the sequential and total scheduling strategies. The one respecting the sequential strategy consists in two phases. In the first phase, the integrated production and maintenance schedules are generated. In the second one, the human resources are assigned to maintenance activities. The second algorithm respecting a total strategy consists in generating the integrated production and maintenance schedules that explicitly satisfy the human resource constraints. In regard to these two different strategies, we studied then two integrated fuzzy genetic algorithms that use the fuzzy logic framework to deal with the uncertain nature of both production and maintenance data. The proposed genetic algorithms have been implemented and applied to non-standard test problems which integrate production, maintenance and human resource data. The experimental results show that the consideration of human resource constraints and uncertainties allows to get more realistic and applicable solutions. Moreover, the comparison between the two proposed algorithms shows that the one based on the total strategy outperforms the one based on the sequential strategy regarding the objective functions’ optimization. However, this latter is better in terms of computational times.","authors":["Meriem Touat","Sabrina Bouzidi","Fatima Benbouzid-Si Tayeb","Belaid Benhamou"],"meta":["June 2017Applied Soft Computing 59","DOI:10.1016/j.asoc.2017.05.058"],"references":["272093624_Scheduling_with_machine_availability_An_integrated_approach","303872409_Event-Triggered_Control_for_Nonlinear_Systems_Under_Unreliable_Communication_Links","303320354_Adaptive_Fuzzy_Control_for_Nonstrict-Feedback_Systems_With_Input_Saturation_and_Output_Constraint","297545783_Scheduling_jobs_and_maintenance_activities_on_parallel_machines","284133138_A_deadlock_recovery_strategy_for_unified_automated_material_handling_systems_in_300mm_wafer_fabrications","283996103_Genetic_Algorithms_In_Search_Optimization_and_Machine_Learning","282292294_Considering_Human_Resource_Constraints_for_Real_Joint_Production_and_Maintenance_Schedules","277595347_Minimising_the_total_completion_time_in_a_single_machine_scheduling_problem_under_bimodal_flexible_periodic_availability_constraints","268998749_Introduction_a_la_theorie_des_sous-ensembles_flous_a_l'usage_des_ingenieurs_fuzzy_sets_theory_Tome_II_Applications_a_la_linguistique_a_la_logique_et_a_la_semantique","265990627_Introduction_a_la_theorie_des_sous-ensembles_flous_A_l'usage_des_ingenieurs_Tome_1_Elements_theoriques_de_base"]}