{"id":"317413451_RSAT_matrix-clustering_Dynamic_exploration_and_redundancy_reduction_of_transcription_factor_binding_motif_collections","abstract":"Transcription factor (TF) databases contain multitudes of binding motifs (TFBMs) from various sources, from which non-redundant collections are derived by manual curation. The advent of high-throughput methods stimulated the production of novel collections with increasing numbers of motifs. Meta-databases, built by merging these collections, contain redundant versions, because available tools are not suited to automatically identify and explore biologically relevant clusters among thousands of motifs. Motif discovery from genome-scale data sets (e.g. ChIP-seq) also produces redundant motifs, hampering the interpretation of results. We present matrix-clustering, a versatile tool that clusters similar TFBMs into multiple trees, and automatically creates non-redundant TFBM collections. A feature unique to matrix-clustering is its dynamic visualisation of aligned TFBMs, and its capability to simultaneously treat multiple collections from various sources. We demonstrate that matrix-clustering considerably simplifies the interpretation of combined results from multiple motif discovery tools, and highlights biologically relevant variations of similar motifs. We also ran a large-scale application to cluster ∼11 000 motifs from 24 entire databases, showing that matrix-clustering correctly groups motifs belonging to the same TF families, and drastically reduced motif redundancy. matrix-clustering is integrated within the RSAT suite (http://rsat.eu/), accessible through a user-friendly web interface or command-line for its integration in pipelines.","authors":["Jaime A Castro-Mondragon","Sébastien Jaeger","Denis Thieffry","Morgane Thomas-Chollier"],"meta":["June 2017Nucleic Acids Research 45(13)","DOI:10.1093/nar/gkx314"],"references":["308884725_Motif_clustering_with_implications_for_transcription_factor_interactions","298910179_A_roadmap_of_constitutive_NF-kB_activity_in_Hodgkin_lymphoma_Dominant_roles_of_p50_and_p52_revealed_by_genome-wide_analyses","284279562_HOCOMOCO_Expansion_and_enhancement_of_the_collection_of_transcription_factor_binding_sites_models","283639852_DNA-dependent_formation_of_transcription_factor_pairs_alters_their_binding_specificity","283502053_JASPAR_2016_A_major_expansion_and_update_of_the_open-access_database_of_transcription_factor_binding_profiles","281118035_Motif_clustering_with_implications_for_transcription_factor_interactions","280974421_Selective_influence_of_Sox2_on_POU_transcription_factor_binding_in_embryonic_and_neural_stem_cells","279300529_Varying_levels_of_complexity_in_transcription_factor_binding_motifs","307968505_Cistrome_and_Epicistrome_Features_Shape_the_Regulatory_DNA_Landscape","303380132_Cistrome_and_Epicistrome_Features_Shape_the_Regulatory_DNA_Landscape"]}