{"id":"317421409_Road_Traffic_Accidents_in_India_Issues_and_Challenges","abstract":"The main aim of this paper is to analyze the road accidents in India at national, state, and metropolitan city level. Analysis shows that the distribution of road accidental deaths and injuries in India varies according to age, gender, month and time. Age group 30-59 years is the most vulnerable population group, though males face higher level of fatalities and injuries than their female counterparts. Moreover, road accidents are relatively higher in extreme weather and during working hours. Analysis of road accident scenario at state and city level shows that there is a huge variation in fatality risk across states and cities. Fatality risk in 16 out of 35 states and union territories is higher than the all India average. Although, burden of road accidents in India is marginally lower in its metropolitan cities, almost 50% of the cities face higher fatality risk than their moffusil counterparts. In general, while in many developed and developing countries including China, road safety situation is generally improving, India faces a worsening situation. Without increased efforts and new initiatives, the total number of road traffic deaths in India is likely to cross the mark of 250,000 by the year 2025. There is thus an urgent need to recognize the worsening situation in road deaths and injuries and to take appropriate action.","authors":["Sanjay Kumar Singh"],"meta":["December 2017Transportation Research Procedia 25:4712-4723","DOI:10.1016/j.trpro.2017.05.484"],"references":["261729299_The_World_Bank's_Global_Road_Safety_Partnership","260468164_Road_Traffic_Crashes_The_Scourge_of_UP's_Cities","256055971_The_Neglected_Epidemic_Road_Traffic_Crashes_in_India","237554619_World_Report_on_Road_Traffic_Injury","10588545_A_New_Traffic_Safety_Vision_for_the_United_States","291293651_The_Effect_of_Drivers'_Speed_on_the_Frequency_of_Road_Accidents","265145748_The_influence_of_weather_conditions_on_road_safety","11661795_Reviews_of_evidence_regarding_interventions_to_increase_use_of_child_safety_seats"]}