{"id":"317423968_Human_resources_for_Big_Data_professions_A_systematic_classification_of_job_roles_and_required_skill_sets","abstract":"The rapid expansion of Big Data Analytics is forcing companies to rethink their Human Resource (HR) needs. However, at the same time, it is unclear which types of job roles and skills constitute this area. To this end, this study pursues to drive clarity across the heterogeneous nature of skills required in Big Data professions, by analyzing a large amount of real-world job posts published online. More precisely we: 1) identify four Big Data ‘job families’; 2) recognize nine homogeneous groups of Big Data skills (skill sets) that are being demanded by companies; 3) characterize each job family with the appropriate level of competence required within each Big Data skill set. We propose a novel, semi-automated, fully replicable, analytical methodology based on a combination of machine learning algorithms and expert judgement. Our analysis leverages a significant amount of online job posts, obtained through web scraping, to generate an intelligible classification of job roles and skill sets. The results can support business leaders and HR managers in establishing clear strategies for the acquisition and the development of the right skills needed to leverage Big Data at best. Moreover, the structured classification of job families and skill sets will help establish a common dictionary to be used by HR recruiters and education providers, so that supply and demand can more effectively meet in the job marketplace.","authors":["Andrea De Mauro","Marco Greco","Michele Grimaldi","Paavo Ritala"],"meta":["June 2017Information Processing and Management 54(5)","DOI:10.1016/j.ipm.2017.05.004"],"references":["329567113_Big_Data_Using_SMART_Big_Data_Analytics_and_Metrics_To_Make_Better_Decisions_and_Improve_Performance","310545568_Understanding_big_data_themes_from_scientific_biomedical_literature_through_topic_modeling","310475798_Non-founder_human_capital_and_the_long-run_growth_and_survival_of_high-tech_ventures","305109030_Beyond_Data_Scientists_a_Review_of_Big_Data_Skills_and_Job_Families","303581535_Perspectives_to_Definition_of_Big_Data_A_Mapping_Study_and_Discussion","328896374_The_Current_State_of_Business_Intelligence_in_Academia_The_Arrival_of_Big_Data","314167238_How_much_does_firm-specific_intellectual_capital_vary_Cross-industry_and_cross-national_comparison","313734689_How_much_does_firm-specific_intellectual_capital_vary_Cross-industry_and_cross-national_comparison","312596137_Big_data_The_next_frontier_for_innovation_competition_and_productivity","304535150_Big_data_The_management_revolution"]}