{"id":"317447415_Towards_a_Requirements_Specification_Multi-View_Framework_for_Self-Adaptive_Systems","abstract":"The analysis of self-adaptive systems (SAS) requirements involves addressing uncertainty from several sources. Despite advances in requirements for SAS, uncertainty remains an extremely difficult challenge. In this paper, we propose REFAS, a framework to model the requirements of self-adaptive software systems. Our aim with REFAS is to address and reduce uncertainty and to provide a language with sufficient power of expression to specify the different aspects of self-adaptive systems, relative to functional and non-functional requirements. The REFAS modeling language includes concepts closely related to these kind of requirements and their fulfillment, such as context variables, claims, and soft dependencies. Specifically, the papers contribution is twofold. First, REFAS supports different viewpoints and concerns related to requirements modeling, with key associations between them. Moreover, the modeler can define additional models and views by exploiting the REFAS meta-modeling capability, in order to capture additional aspects contributing to reduce uncertainty. Second, REFAS promotes in-depth analysis of all of the modeled concerns with aggregation and association capabilities, especially with context variables. Furthermore, we also define a process that enforces modeling requirements, considering different aspects of uncertainty. We demonstrate the applicability of REFAS by using the VariaMos software tool, which implements the REFAS meta-model, views, and process.","authors":["Juan C Muñoz-Fernández","Gabriel Tamura","Raúl Mazo","Camille Salinesi"],"meta":["August 2015","DOI:10.19153/cleiej.18.2.5","Project: A Generic and Extensible Requirements Engineering Framework for Self Adaptive Software Systems"],"references":["280656146_VariaMos_an_Extensible_Tool_for_Engineering_dynamic_Product_Lines","271418559_Experiences_with_open_overlays","265466879_Towards_a_Requirements_Specification_Multi-View_Framework_for_Self-Adaptive_Systems","261059645_From_awareness_requirements_to_adaptive_systems_A_control-theoretic_approach","259231285_Using_Constraint_Programming_to_Manage_Configurations_in_Self-Adaptive_Systems","250346303_An_Intelligent_and_Adaptable_Grid-based_Flood_Monitoring_and_Warning_System","292975460_Self-adaptation_with_End-User_Preferences_Using_Run-Time_Models_and_Constraint_Solving","268380680_Uncertainty_in_Self-Adaptive_Software_Systems","265780327_Non-Functional_Requirements_in_Software_Engineering","258839025_QoS_Contract_Preservation_through_Dynamic_Reconfiguration_A_Formal_Semantics_Approach"]}