{"id":"317487149_Experience-based_guidelines_for_effective_and_efficient_data_extraction_in_systematic_reviews_in_software_engineering","abstract":"To systematically collect evidence and to structure a given area in software engineering (SE), Systematic Literature Reviews (SLR) and Systematic Mapping (SM) studies have become common. Data extraction is one of the main phases (activities) when conducting an SM or an SLR, whose objective is to extract required data from the primary studies and to accurately record the information researchers need to answer the questions of the SM/SLR study. Based on experience in a large number of SM/SLR studies, we and many other researchers have found the data extraction in SLRs to be time consuming and error-prone, thus raising the real need for heuristics and guidelines for effective and efficient data extraction in these studies, especially to be learnt by junior and young researchers. As a 'guideline' paper, this paper contributes a synthesized list of challenges usually faced during SLRs' data extraction phase and the corresponding solutions (guidelines). For our synthesis, we consider two data sources: (1) the pool of 16 SLR studies in which the authors have been involved in, as well as (2) a review of challenges and guidelines in the existing literature. Our experience in utilizing the presented guidelines in the near past have helped our junior colleagues to conduct data extractions more effectively and efficiently.","authors":["Vahid Garousi","Michael Felderer"],"meta":["June 2017","DOI:10.1145/3084226.3084238","Conference: the 21st International Conference","Project: Systematic reviews in software engineering"],"references":["336389710_Systematic_Review_of_Statistical_Process_Control_An_Experience_Report","311586326_How_to_Read_Less_Better_Machine_Assisted_Reading_Methods_for_Systematic_Literature_Reviews","311582945_On_the_Pragmatic_Design_of_Literature_Studies_in_Software_Engineering_An_Experience-based_Guideline","302924724_Guidelines_for_performing_Systematic_Literature_Reviews_in_Software_Engineering","290318191_UML-Driven_Software_Performance_Engineering_A_Systematic_Mapping_and_Trend_Analysis","280510415_Model-Based_Security_Testing_A_Taxonomy_and_Systematic_Classification","336585489_Experiences_Conducting_Systematic_Reviews_from_Novices'_Perspective","336573400_Systematic_Mapping_Studies_in_Software_Engineering","316800454_The_Kluwer_International_Series_in_Software_Engineering","313390246_Basics_of_qualitative_research_Grounded_theory_procedures_and_techniques"]}