{"id":"317487357_Performance_Improvement_of_Stencil_Computations_for_Multi-core_Architectures_based_on_Machine_Learning","abstract":"Stencil computations are the basis to solve many problems related to Partial Differential Equations (PDEs). Obtaining the best performance with such numerical kernels is a major issue as many critical parameters (architectural features, compiler flags, memory policies, multithreading strategies) must be finely tuned. In this context, auto-tuning methods have been extensively used to improve the overall performance. However, the complexity of current architectures and the large number of optimizations to consider reduce the efficiency of this approach. This paper focuses on the use of Machine Learning to predict the performance of stencil kernels on multi-core architectures. Low-level hardware counters (e.g. cache-misses and TLB misses) on a limited number of executions are used to build our predictive model. We have considered two different kernels (7-point Jacobi and seismic wave modelling) to demonstrate the effectiveness of our approach. Our results show that performance can be predicted and that the best input configuration for stencil problems can be obtained by simulations of hardware counters and performance measurements.","authors":["Víctor Eduardo Martínez Abaunza","Fabrice Dupros","Márcio Castro","Philippe Olivier Alexandre. Navaux"],"meta":["December 2017Procedia Computer Science 108:305-314","DOI:10.1016/j.procs.2017.05.164"],"references":["309185766_Support_vector_regression_machines","304292023_Towards_Seismic_Wave_Modeling_on_Heterogeneous_Many-Core_Architectures_Using_Task-Based_Runtime_System","266856549_Multicore-Optimized_Wavefront_Diamond_Blocking_for_Optimizing_Stencil_Updates","261300844_BOAST_Bringing_Optimization_through_Automatic_Source-to-Source_Tranformations","312538118_Support-vector_networks","308857316_Communication-Avoiding_Seismic_Numerical_Kernels_on_Multicore_Processors","305335538_An_architecture_for_flexible_auto-tuning_The_Periscope_Tuning_Framework_20","302975280_Support_vector_regression_machines","280740670_Automatic_IO_scheduling_algorithm_selection_for_parallel_file_systems","262975198_Adaptive_thread_mapping_strategies_for_transactional_memory_applications"]}