{"id":"317513932_Propuesta_metodologica_para_la_direccion_del_trabajo_independiente_desde_Metodologia_de_la_Investigacion_y_Estadistica","abstract":"Background: the independent work is a form of organizing the cognitive activity; it is led by the professor to achieve a conscious content assimilation by the students, who should solve the tasks by themselves. Objective: to elaborate a methodological proposal for the management of the independent work through Researching Methodology and Statistics. Methods: a development research work was carried out in Holguín Medical Sciences University during the academic year 2014-2015. Theoretical methods were used: analysis-synthesis and historical-logical, and empiric ones: observation to classes through a guideline to determine the characteristics of the management of the independent work in its different dimensions. Results: it was evident the lack of a proper methodological conception in the management of the independent work process in its dimensions: planning, orientation, execution, control and assessment; the most affected dimension was planning and the ones with better results were control and assessment. A methodological proposal was elaborated which was analyzed by the specialists´ criteria. Conclusions: the methodological proposal is characterized by its systemic approach and its flexible character. The specialists considered it pertinent, effective and they recognized the necessity of its introduction and incidence in the quality of the teaching-learning process improvement in the university context.","authors":["Vivian Soto Santiesteban","Gilberto Felicó Herrera","Gemma Margarita","Julio Armando Sánchez Delgado"],"meta":["March 2017"],"references":["317518930_Dificultad_y_discriminacion_de_los_items_del_examen_de_Metodologia_de_la_Investigacion_y_Estadistica","317516980_El_trabajo_independiente_en_el_proceso_de_ensenanza-aprendizaje","45487705_Aprendizaje_centrado_en_el_trabajo_independiente","277024428_Sistema_de_tareas_docentes_para_el_trabajo_independiente_en_Medicina_Natural_y_Tradicional","273523879_El_trabajo_independiente_una_forma_de_reforzar_el_valor_responsabilidad_en_los_estudiantes_universitarios","260838897_Intervencion_pedagogica_para_la_direccion_del_trabajo_independiente_en_Morfofisiologia"]}