{"id":"317572376_Using_school_websites_for_home-school_communication_and_parental_involvement","abstract":"This paper reports a small-scale study on the websites of 12 K-9 schools from four municipalities in Sweden. The purpose of the study is to explore, describe, and compare what and how information relevant for parental use is presented by local schools on their websites, which reflect the schools’ perceptions, intentions and strategies of communicating and cooperating with families. Epstein’s six key components regarding parental involvement are used as a theoretical framework in order to examine and analyse the content of school website settings. To evaluate the website design features, the website evaluation metrics suggested by Parajuli are adapted and applied. The results indicate that information on school websites for parental use is generally limited. It seems that schools’ expectations for parental involvement in education are based mainly on the social aspects of student development, rather than on pedagogical issues. In general, the websites of independent schools are more attractive than most public schools’ websites in terms of information richness and freshness, variations and friendliness. There is a need to develop websites that are more accessible for parents with immigrant backgrounds and non-Swedish speakers.","authors":["Limin Gu"],"meta":["June 2017Nordic Journal of Studies in Educational Policy 3(2):1-11","DOI:10.1080/20020317.2017.1338498"],"references":["288968978_Educational_marketization_the_Swedish_way","273960587_The_Changing_Nature_of_Parent-Teacher_Communication_Mode_Selection_in_the_Smartphone_Era","308045020_Technology_and_school-home_communication","308009111_Parental_e-nvolvement_a_phenomenological_research_on_electronic_parental_involvement","303941497_Contrasting_School_Choice_Policies_and_Parental_Choices_in_Finnish_Case_Cities","288957532_Qualitative_content_analysis_Forum_Qualitative_Social_Research_Theories_Methods_Applications","277827664_Vardagskommunikation_skola_hem_delrapport_1_-_Foraldrars_uppfattningar_nulage_och_vision","264788205_Qualitative_Content_Analysis_in_Practice","258166634_Using_Technology_to_Increase_Parent_Involvement_in_Schools","257173161_Evaluating_the_importance_of_common_components_in_school-based_websites_Frequency_of_appearance_and_stakeholders'_judged_value"]}