{"id":"317579226_Adaptive_random_forests_for_evolving_data_stream_classification","abstract":"Random forests is currently one of the most used machine learning algorithms in the non-streaming (batch) setting. This preference is attributable to its high learning performance and low demands with respect to input preparation and hyper-parameter tuning. However, in the challenging context of evolving data streams, there is no random forests algorithm that can be considered state-of-the-art in comparison to bagging and boosting based algorithms. In this work, we present the adaptive random forest (ARF) algorithm for classification of evolving data streams. In contrast to previous attempts of replicating random forests for data stream learning, ARF includes an effective resampling method and adaptive operators that can cope with different types of concept drifts without complex optimizations for different data sets. We present experiments with a parallel implementation of ARF which has no degradation in terms of classification performance in comparison to a serial implementation, since trees and adaptive operators are independent from one another. Finally, we compare ARF with state-of-the-art algorithms in a traditional test-then-train evaluation and a novel delayed labelling evaluation, and show that ARF is accurate and uses a feasible amount of resources.","authors":["Heitor Murilo Gomes","Albert Bifet","Jesse Read","Jean Paul Barddal"],"meta":["October 2017Machine Learning 106(6):1-27","DOI:10.1007/s10994-017-5642-8","Project: MOA (Massive Online Analytics) Open Source Software"],"references":["299970682_Efficient_Online_Evaluation_of_Big_Data_Stream_Classifiers","282648103_An_ensemble_classification_approach_for_handling_spatio-temporal_drifts_in_partially_labeled_data_streams","281274483_SNCStream_a_social_network-based_data_stream_clustering_algorithm","327606791_Classification_And_Regression_Trees","313745907_Experiments_with_a_new_boosting_algorithm_machine_learning","313524724_Database_mining_A_performance_perspective","313501942_A_streaming_ensemble_algorithm_SEA_for_large-scale_classification","313061265_Clustering_data_streams","310606656_Classification_and_regression_trees","288906520_Random_forests"]}