{"id":"317520839_Principales_retos_para_la_implantacion_del_plan_de_estudio_D_en_la_carrera_de_Medicina","abstract":"Introduction: in order to accomplish metodological indications of de High Education Ministery, ir`s neccesary to develop the theoretical basis for the improvement of the medical curriculum according to the characteristics of the \"D\" plan. Objective: to identify the main objects of change that might be considered as challenges in improving the curriculum of the medical career. Methodology: application of empirical and theoretical methods to obtain, analyze and construe the available information on the changes to be made in the curriculum of this career that might be considered as challenges because of the probable difficulties in their implementation under the present Cuban conditions. Results: the main objects of changes identified in this paper were all the changes derived from working with three levels of curriculum and from the creation of the main integrating discipline (MID), the intra-discipline coordination among the programs of the MID subjects and the systemic functional relationships of this discipline with the rest of the disciplines in the curriculum, the curricular projection of the formation for all the functions of the professional to be graduated, the collective construction of the necessary and relevant strategies for this career and wider theoretical framework of formation for the scientific research. All the above-mentioned elements were considered real challenges because they require changes in some prevailing academic paradigms in this career and thus a priority attention. Conclusions: the improvement of the curricular design of medicine entails important challenges demanding wide committed participation of the faculty and of the managing academic staff as well as the re-activation of the interdisciplinary methodological work on the basis of integration of teaching, assistance and research oriented to the social relevance of medical formation.","authors":["Marta Pernas Gómez","Niurka Taureaux Díaz","Simón Sierra Figueredo","Juan Manuel Diego Cobelo"],"meta":["June 2014Revista Cubana de Educacion Medica Superior 28(2):335-346"],"references":["262707376_Calidad_del_proceso_de_ensenanza_del_analisis_de_situacion_de_salud_en_la_carrera_de_medicina","262620056_Primer_ciclo_formativo_de_Medicina_en_el_Policlinico_Julio_Antonio_Mella_de_Camaguey","8117270_What_every_teacher_needs_to_know_about_clinical_reasoning","266456405_EPIDEMIOLOGIA_CLINICA_O_EPIDEMIOLOGIA_PARA_CLINICOS","262781303_El_principio_rector_de_la_Educacion_Medica_cubana_Un_reconocimiento_a_la_doctrina_pedagogica_planteada_por_el_profesor_Fidel_Ilizastigui_Dupuy","262668017_Un_fundamento_didactico_para_la_practica_de_la_universalizacion_de_la_educacion_medica","262649915_Los_procesos_formativos_la_competencia_profesional_y_el_desempeno_laboral_en_el_Sistema_Nacional_de_Salud_de_Cuba","262622413_Satisfaccion_de_los_actores_del_proceso_ensenanza_aprendizaje_en_la_asignatura_Morfofisiologia_II","262551591_Histologia_I_y_Biologia_Celular_y_Molecular_como_antecedentes_del_proyecto_de_programa_de_Morfofisiologia_I","262447184_Fundamentos_conceptuales_y_metodologicos_para_una_ensenanza-aprendizaje_desarrolladora_de_la_disciplina_Morfofisiologia_Humana","260774238_Revision_de_los_libros_de_texto_para_la_ensenanza_de_la_Epidemiologia_en_las_carreras_de_Ciencias_Medicas","10632501_Diagnostic_reasoning_strategies_and_diagnostic_success","6598333_How_do_medical_teachers_address_the_problem_of_transfer"]}