{"id":"317526078_Applying_Differential_dynamic_logic_to_reconfigurable_biological_networks","abstract":"Qualitative and quantitative modeling frameworks are widely used for analysis of biological regulatory networks, the former giving a preliminary overview of the system’s global dynamics and the latter providing more detailed solutions. Another approach is to model biological regulatory networks as hybrid systems, i.e., systems which can display both continuous and discrete dynamic behaviors. Actually, the development of synthetic biology has shown that this is a suitable way to think about biological systems, which can often be constructed as networks with discrete controllers, and present hybrid behaviors. In this paper we discuss this approach as a special case of the reconfigurability paradigm, well studied in Computer Science (CS).\nIn CS there are well developed computational tools to reason about hybrid systems. We argue that it is worth applying such tools in a biological context. One interesting tool is differential dynamic logic (dL), which has recently been developed by Platzer and applied to many case-studies. In this paper we discuss some simple examples of biological regulatory networks to illustrate how dL can be used as an alternative, or also as a complement to methods already used.","authors":["Daniel Figueiredo","M. A. Martins","Madalena Chaves"],"meta":["June 2017Mathematical Biosciences 291","DOI:10.1016/j.mbs.2017.05.012","Project: Biomathematics"],"references":["262315133_Certifying_the_safe_design_of_a_virtual_fixture_control_algorithm_for_a_surgical_robot","230878267_A_reconfigurable_NANDNOR_genetic_logic_gate","329648496_Dynamic_Logic","303912882_Relating_Bisimulations_with_Attractors_in_Boolean_Network_Models","303439307_A_method_for_rigorous_design_of_reconfigurable_systems","301972004_dReach_d-Reachability_Analysis_for_Hybrid_Systems","287289543_Molecular_Logic-Based_Computation","261164156_Interactive_verification_of_cyber-physical_systems_Interfacing_Averest_and_KeYmaera","245026960_Hierarchy_of_models_From_qualitative_to_quantitative_analysis_of_circadian_rhythms_in_cyanobacteria","238183265_Temporal_Logic_Analysis_of_Gene_Networks_Under_parameter_uncertainty"]}