{"id":"317518686_Software_educativo_en_el_proceso_de_ensenanza-aprendizaje_de_la_asignatura_Etica_y_Bioetica","abstract":"Introducción: la enseñanza de la ética y bioética es una necesidad palpable, un problema no resuelto para la educación superior en todos sus centros y carreras, en los momentos actuales, puesto que el profesional egresado de las universidades médicas necesita abordar desde la reflexión ética el ámbito de la actividad profesional en la esfera de la salud donde se va a desarrollar, para así propiciar un acercamiento a los principios, normas y valores del quehacer salubrista en el contexto del proyecto socialista cubano. Objetivo: diseñar un medio de enseñanza, que contribuya al proceso de enseñanza_aprendizaje en la asignatura Ética y Bioética en la carrera de Licenciatura en Tecnología de la Salud, de la Filial Universitaria Municipal de Salud, Consolación del Sur. Material y método: el presente estudio se basó en un proyecto de innovación tecnológica, en el área de pregrado a partir de un enfoque investigativo integral teniendo como base metodológica el método dialéctico materialista. Por lo que se emplearon métodos teóricos, empíricos y estadísticos, dentro de los primeros, el histórico-lógico, sistémico-estructural y el análisis documental y en el segundo grupo encuestas, entrevistas y la observación. Resultados: se manifiesta en la carencia de medios de enseñanza apoyados por la tecnología educativa que satisfaga la asequibilidad en la asimilación de los contenidos y la motivación por el aprendizaje para contribuir al perfeccionamiento de la asignatura Ética y Bioética, insuficiente comprensión por parte de los estudiantes de la importancia de la asignatura para su actuación profesional, bajos niveles de motivación en la adquisición de habilidades en los estudiantes, elementos que atentan contra la efectividad y calidad del proceso de enseñanza aprendizaje de esta asignatura. Conclusiones: se diseñó un software educativo para el estudio de la asignatura Ética y Bioética, que permitirá a los estudiantes un aprendizaje activo, consciente y desarrollador, facilitando la adquisición de habilidades y conocimientos para el modo de actuación profesional. La consulta a los expertos confirmó la validez del Software Educativo para la asignatura Ética y Bioética, de la carrera Licenciatura en Tecnología de la Salud, y la viabilidad de su implementación en la Filial Universitaria Municipal de Salud, Consolación del Sur.","authors":["Yerelis Alfonso González","Salvador Sánchez García","Ariel Guerrero","Tania Cruz González"],"meta":["February 2015"],"references":["227431690_El_software_educativo_un_medio_de_ensenanza_eficiente","43531231_La_formacion_docente_universitaria_a_traves_de_las_TICs","262498361_La_etica_y_la_bioetica_en_el_pregrado_ponencia_introductoria_La_ensenanza_de_la_bioetica_en_el_pregrado_Reflexiones_sobre_un_problema_inconcluso","262482570_Medios_de_ensenanza","262480448_Las_nuevas_tecnologias_en_la_ensenanza_y_el_aprendizaje_de_la_Anatomia_Humana","262471908_Diseno_Curricular","262440220_El_plan_de_estudio_para_la_formacion_del_medico_general_basico_en_Cuba_Experiencias_de_su_aplicacion","262437942_Principios_estrategicos_de_la_educacion_en_Ciencias_de_la_salud_en_Cuba_II_la_pertinencia","237486568_La_calidad_en_el_desarrollo_profesional_avances_y_desafios"]}