{"id":"317553913_An_External_Archive-Guided_Multiobjective_Particle_Swarm_Optimization_Algorithm","abstract":"The selection of swarm leaders (i.e., the personal best and global best), is important in the design of a multiobjective particle swarm optimization (MOPSO) algorithm. Such leaders are expected to effectively guide the swarm to approach the true Pareto optimal front. In this paper, we present a novel external archive-guided MOPSO algorithm (AgMOPSO), where the leaders for velocity update are all selected from the external archive. In our algorithm, multiobjective optimization problems (MOPs) are transformed into a set of subproblems using a decomposition approach, and then each particle is assigned accordingly to optimize each subproblem. A novel archive-guided velocity update method is designed to guide the swarm for exploration, and the external archive is also evolved using an immune-based evolutionary strategy. These proposed approaches speed up the convergence of AgMOPSO. The experimental results fully demonstrate the superiority of our proposed AgMOPSO in solving most of the test problems adopted, in terms of two commonly used performance measures. Moreover, the effectiveness of our proposed archive-guided velocity update method and immune-based evolutionary strategy is also experimentally validated on more than 30 test MOPs.","authors":["Qingling Zhu","Qiuzhen Lin","Weineng Chen","Ka-Chun Wong"],"meta":["June 2017IEEE Transactions on Cybernetics PP(99):1-15","DOI:10.1109/TCYB.2017.2710133"],"references":["313749844_Particle_swarm_optimization","309056178_A_Survey_of_Multiobjective_Evolutionary_Algorithms_Based_on_Decomposition","308160985_Improving_PSO-based_multi-objective_optimization_using_crowding_mutation_and_6-dominance","305416805_Problem_Specific_MOEAD_for_Barrier_Coverage_with_Wireless_Sensors","291875728_Evolutionary_algorithm_based_on_ELECTRE_for_multiobjective_optimization_problems","288856014_A_Hybrid_Evolutionary_Immune_Algorithm_for_Multiobjective_Optimization_Problems","284719460_Pareto_or_Non-Pareto_Bi-Criterion_Evolution_in_Multi-Objective_Optimization","282622550_A_novel_multi-objective_particle_swarm_optimization_with_multiple_search_strategies","282544448_Adaptive_Cross-Generation_Differential_Evolution_Operators_for_Multi-objective_Optimization","281183288_Particle_Swarm_Optimization_With_Interswarm_Interactive_Learning_Strategy"]}