{"id":"317550248_From_chemical_metabolism_to_life_The_origin_of_the_genetic_coding_process","abstract":"Looking for origins is so much rooted in ideology that most studies reflect opinions that fail to explore the first realistic scenarios. To be sure, trying to understand the origins of life should be based on what we know of current chemistry in the solar system and beyond. There, amino acids and very small compounds such as carbon dioxide, dihydrogen or dinitrogen and their immediate derivatives are ubiquitous. Surface-based chemical metabolism using these basic chemicals is the most likely beginning in which amino acids, coenzymes and phosphate-based small carbon molecules were built up. Nucleotides, and of course RNAs, must have come to being much later. As a consequence, the key question to account for life is to understand how chemical metabolism that began with amino acids progressively shaped into a coding process involving RNAs. Here I explore the role of building up complementarity rules as the first information-based process that allowed for the genetic code to emerge, after RNAs were substituted to surfaces to carry over the basic metabolic pathways that drive the pursuit of life.","authors":["Antoine Danchin"],"meta":["June 2017Beilstein Journal of Organic Chemistry 13(1):1119-1135","DOI:10.3762/bjoc.13.111","Projects: The minimal function set for bacterial chassis in synthetic biologyThe logic of metabolism: from the origin of life to synthetic biology"],"references":["314195913_Remnants_of_an_Ancient_Metabolism_without_Phosphate","312391504_Transfer_RNAs_with_novel_cloverleaf_structures","311360016_Piecemeal_Buildup_of_the_Genetic_Code_Ribosomes_and_Genomes_from_Primordial_tRNA_Building_Blocks","309713501_Taming_Prebiotic_Chemistry_The_Role_of_Heterogeneous_and_Interfacial_Catalysis_in_the_Emergence_of_a_Prebiotic_CatalyticInformation_Polymer_System","347369899_Before_enzymes_and_templates_theory_of_surface_metabolism","322622477_Information_measures_effective_complexity_and_total_information","312055537_Bacterial_and_Eukaryotic_Replisome_Machines","311523536_Bacterial_aminoacyl_phospholipids_-_Biosynthesis_and_role_in_basic_cellular_processes_and_pathogenicity","310821779_What_determines_direction_of_asymmetry_Genes_environment_or_chance","310649494_A_prebiotically_plausible_synthesis_of_pyrimidine_b-ribonucleosides_and_their_phosphate_derivatives_involving_photoanomerization"]}