{"id":"317517643_La_disciplina_Informatica_Medica_en_el_Plan_D_de_la_carrera_de_medicina","abstract":"Medical Informatics discipline is part of the curriculum of medical career since scholar course 1995-1996. The discipline deals with basic contents of computer science, statistics and research methodology and has 120 hours. It is taught in two subjects located in the first two years of the curriculum. The experience in its teaching has revealed deficiencies affecting the research training of graduates, in the methodological aspect as well as in the use of statistics as a tool. To perform the new design of the discipline it was taken into account the experience in the teaching learning process during all those years, it was pick the criterion of the professors across the country, discussed in the workshops held in 2009- 2010 and 2013-2014 courses and also were considered the opinions of experts. The new design deals primarily with changes in the objectives of the subjects research methodology and biostatistics, a reconsideration of the amount of suitable courses in the discipline, as well as the location of the subjects in the curriculum. The redesign was performed as part of the new curriculum D of medicine in Cuba, also takes into account the close link between Medical Informatics discipline and the Strategy of Research and Information Technology in medicine career. The aim of this paper is to present the key features of the new program of medical informatics discipline that is inserted into the curriculum D medical career.","authors":["Nery de la C. González García","Eneida Petra Garriga Zarria","Yoadis Cuesta García","María Rosa Mas Camacho"],"meta":["June 2015"],"references":["317520839_Principales_retos_para_la_implantacion_del_plan_de_estudio_D_en_la_carrera_de_Medicina","262616542_Modelo_metodologico_para_el_diseno_y_aplicacion_de_las_estrategias_curriculares_en_Ciencias_Medicas","262556706_Reflexiones_acerca_del_perfeccionamiento_del_plan_de_estudio_de_la_Licenciatura_en_Enfermeria"]}