{"id":"317590719_Sur_la_canonicite_en_morphologie_perspective_empirique_formelle_et_computationnelle","abstract":"L’objectif principal de cette thèse est de proposer un modèle formel de la morphologie flexionnelle, nommé PARSLI (Paradigm Shape and Lexicon Interface) qui soit typologiquement fondé et qui permette de concevoir, d’implémenter et d’évaluer quantitativement des analyses formelles de systèmes flexionnels particuliers. Il repose pour cela sur les concepts de la typologie canonique (Corbett, 2003, 2007). Fondé sur une approche inférentielle-réalisationnelle de la morphologie (Stump, 2001), ce modèle permet notamment de formuler explicitement le rapport qu’entretient le lexique avec les caractéristiques morphologiques observables dans les paradigmes flexionnels des lexèmes et d’évaluer la part de régularité et d’irrégularité flexionnelle inhérente à la définition de chacun d’entre eux.PARSLI est implémenté dans un formalisme dédié, Alexinaparsli (Sagot & Walther, 2013), qui constitue une nouvelle version du formalisme lexical Alexina (Sagot, 2010), à l'origine conçu pour le traitment automatique des langues (TAL).PARSLI s’accompagne d’un éventail de mesures quantitatives. La première est une mesure de compacité reposant sur le concept de longueur de description minimale (Minimal Description Length ou MDL (Rissanen, 1984)) empruntée à la théorie de l’information (Walther & Sagot, 2011). Elle permet d’évaluer l’économie descriptive d’une description donnée et de la comparer quantitativement à des descriptions concurrentes. Dans la thèse, cette mesure sert à évaluer quantitativement la compacité de quatre descriptions implémentées concurrentes de la flexion verbale du français, de deux descriptions concurrentes de la flexion verbale du latin, ainsi que de deux descriptions implémentées du maltais.Le second ensemble de mesures est un ensemble de mesures de canonicité permettant de quantifier le degré de canonicité observable dans les paradigmes isolés ou les systèmes flexionnels complets d’une langue particulière décrite en PARSLI. Il s’agit ainsi d’un moyen de rendre quantifiable la notion qualitative de canonicité flexionnelle développé Corbett (2007). Dans la thèse, cet ensemble de mesures a été appliquée (en plus de la mesure de compacité) pour comparer deux descriptions du système verbal latin, dont l’une défend une approche dérivationnelle du passif latin tandis que l’autre suit l’analyse flexionnelle plus traditionnelle et a montré l’influence des choix descriptifs sur les caractéristiques typologiques (canoniques) des systèmes décrits.En parallèle, cette thèse aborde également, à partir de descriptions de systèmes flexionnels, les questions de la frontière entre la morphologie et les autres composantes de la langue, notamment par l’étude de données du maltais (interface morphologie flexionnelle/phonologie, du latin (interface morphologie flexionnelle/dérivationnelle) et du kurde sorani (interface morphologie flexionnelle/syntaxe).","authors":["Géraldine Walther"],"meta":["June 2013"],"references":[]}