{"id":"317519154_Factores_motivacionales_que_influyeron_en_estudiantes_de_primer_ano_para_elegir_la_carrera_de_Estomatologia","abstract":"Type of study: descriptive study in fresh more students of the Villa Clara Odontology Faculty in the academic year2011- 2012. Objective: to determine the motivational factors that influenced upon fresh more students to select the Odontology career. Universe: All the students registered in the central site. Sample: conglomerated and randomized sampling of 50% of the students of the groups. Method: a survey was applied to the students. Results: 50.9 % of the students are from Santa Clara, and 49% come from the pre- university, the rest entered through contest. 51.6% referred they had received orientation lectures in Santa Clara municipality and only one student participated in a special training and orientation group, the rest of the municipalities haven't received any orientation. The identified motivational factors that the students referred were the social recognition 22(41.5%) and the family or friendships 21(39.6) Conclusions: most of the students entered coming from the pre-university and the ones from Santa Clara municipality are predominant. It is stated the presence of motivational factors such as the social recognition and the affective influence, it is also stated the lack of orientation, vocational formation and in a greater extent the participation in special training and orientation groups.","authors":["Sara Fé de la Mella Quintero","Juan Miguel Mirabal Díaz","Julita Miosotis Contreras Pérez"],"meta":["December 2012"],"references":["317522500_El_consentimiento_informado_una_accion_imprescindible_en_la_investigacion_medic","262778828_Diagnostico_de_la_motivacion_hacia_el_estudio_en_jovenes_de_la_carrera_de_Estomatologia","262616274_Motivacion_y_rendimiento_docente_en_estudiantes_bolivianos_del_Nuevo_Programa_de_Formacion_de_Medicos","262596351_Motivacion_en_educandos_del_Programa_Nacional_en_Medicina_Integral_Comunitaria","262588187_Motivacion_inicial_por_la_Atencion_Primaria_de_Salud_en_los_estudiantes_de_Medicina","28076390_Modelos_explicativos_en_Psicologia_de_la_Motivacion"]}