{"id":"317634498_El_enfoque_flipped_learning_en_estudios_de_magisterio_percepcion_de_los_alumnos","abstract":"In this paper, we analyze the students' perception of a university teaching-learning strategy, with a flipped learning approach, in the development of the subject Orientación educativa y plan de acción tutorial del Grado de Educación Primaria. The 21st century skills proposed by Fullan (2013) and known as the six Cs (Character, Communication, Collaboration, Citizenship, Critical Thinking and Creativity) are used as a frame of reference. An experimental design of two groups, with a non-equivalent control group, has been used to analyze the students' perceptions of their learning in a conventional teaching environment and under a flipped environment based on m-learning. The differences found were statistically significant in all the analyzed dimensions, with favorable increases in the experimental methodology in all cases. The differences in Citizenship, Character, and Communication are of particular relevance. The analysis of the items reveals some difficulties in the functional literacy of students in the use of digital technology to improve their learning. Likewise, it is evident that the active methodologies improve, according to the perception of the students, the skills development, and learning. It is confirmed the hypothesis proposed in this study that the use of m-learning with a pedagogical approach centered on learning, with active methodologies, is a support that improves the development of the competences of the 21st century and, specifically, those described as the 6C's.","authors":["Deborah Martin R.","Javier Tourón"],"meta":["May 2017RIED Revista Iberoamericana de Educación a Distancia 20(2):187","DOI:10.5944/ried.20.2.17704"],"references":["304015182_Percepciones_de_los_estudiantes_universitarios_frente_al_aprendizaje_por_medio_de_dispositivos_moviles","299584978_Mobile_Learning_Nuevas_realidades_en_el_aula","281608666_Seamless_flipped_learning-_A_mobile_technologyenhanced_flipped_classroom_with_effective_learning_strategies","276106918_Estado_del_Mobile_Learning_en_Espana","274616086_Valoraciones_del_profesorado_del_area_de_Fresno_California_Central_sobre_la_influencia_de_la_tecnologia_movil_en_el_aprendizaje_de_sus_estudiantes","273286918_Effects_of_mobile_learning_time_on_students'_conception_of_collaboration_communication_complex_problem-solving_meta-cognitive_awareness_and_creativity","262017389_The_Experience_of_Three_Flipped_Classrooms_in_an_Urban_University_An_Exploration_of_Design_Principles","260596432_M-Learning_y_aprendizaje_informal_en_la_educacion_superior_mediante_dispositivos_moviles","270585208_Visible_Learning_for_Teachers_Maximising_Impact_on_Learning","262184318_Assessment_and_Teaching_of_21st_Century_Skills"]}