{"id":"317637818_Editorial_governance_and_journal_impact_A_study_of_management_and_business_journals","abstract":"In striving for academic relevance and recognition, editors exert a significant influence on a journal’s mission and content. We examine how characteristics of editors, in particular the diversity of editorial teams, are related to journal impact. Our sample comprises 2244 editors who were affiliated with 645 volumes of 138 business and management journals. Using multi-level modeling, we relate editorial team characteristics to journal impact as reflected in three widely used measures: Five-year Impact Factor, SCImago Journal Rank, and Google Scholar h5 index. Results show that multiple editorships and editors’ affiliation to institutions of high reputation are positively related to journal impact, while the length of editors’ terms is negatively associated with impact scores. Surprisingly, we find that diversity of editorial teams in terms of gender and nationality is largely unrelated to journal impact. Our study extends the scarce knowledge on editorial teams and their relevance to journal impact by integrating different strands of literature and studying several demographic factors simultaneously. Results indicate that the editorial team’s scientific achievement is more decisive than team diversity in terms of journal impact. The study has useful implications for the composition of editorial teams.","authors":["Jessica Petersen","Fabian Hattke","Rick Vogel"],"meta":["June 2017Scientometrics 112(3):1593-1614","DOI:10.1007/s11192-017-2434-7","Project: Performance Indicators in Academia"],"references":["308036901_Editorial_Boards_of_Scientific_Journals_as_a_Subject_of_Scientometric_Research_A_Literature_Review","301851588_Interlocking_editorship_A_network_analysis_of_the_links_between_economic_journals","325002130_The_Review_Process_and_the_Fates_of_Manuscripts_Submitted_to_AMJ","320986778_Quantitative_and_Qualitative_Rankings_of_Scholars","313429406_A_preliminary_test_of_Google_Scholar_as_a_source_for_citation_data_A_longitudinal_study_of_Nobel_Prize_winners","304726282_Editing_a_Top_Academic_Journal","304726206_Sustaining_Independent_Journals","304726204_Knowledge_Creation_and_the_Journal_Editor's_Role","304726199_Editing_a_Bridge_Journal","298852493_The_Matthew_Effect_in_Science"]}