{"id":"317690679_Geodemographic_biases_in_crowdsourced_knowledge_websites_Do_neighbours_fill_in_the_blanks","abstract":"Crowdsourced knowledge websites such as Wikipedia and OpenStreetMap are increasingly attracting a critical literature which has highlighted the fact that the contributor bases of these sites are often geodemographically biased: drawn from more affluent and better educated segments of the population. However, while bias in contributors is well known, we know less about whether this also results in a bias in outcomes on these websites: or whether the partial portion of the population which does make contributions also works to “fill in the blanks”, by adding knowledge about other less well-off neighbouring areas which have not attracted a contributor base. This article addresses the question of whether such “neighbourhood effects” exist in practice. It makes use of a novel dataset of alcohol license data in the UK to assess variation in the completeness of the volunteer geographic information site OpenStreetMap. The results support existing literature in showing that completeness is related to demographics: areas with higher levels of wealth and education typically exhibit higher levels of completeness. The article then makes a novel contribution by showing evidence of the existence of neighbourhood effects: poorer regions with more affluent neighbours typically having higher levels of completeness than poorer regions which are also surrounded by poorer neighbours. The results suggest that crowdsourced knowledge websites can aspire to a kind of completeness even whilst user bases remain partial and biased.","authors":["Jonathan Bright","Stefano De Sabbata","Sumin Lee"],"meta":["June 2018GeoJournal 83(6178)","DOI:10.1007/s10708-017-9778-7"],"references":["318870308_Characterizing_Volunteered_Geographic_Information_using_Fuzzy_Clustering","309154187_Characterizing_Volunteered_Geographic_Information_using_Fuzzy_Clustering","308557858_The_Lightweight_Smart_City_and_Biases_in_Repurposed_Big_Data","303708247_A_review_of_volunteered_geographic_information_quality_assessment_methods","301348489_Crowdsourcing_Citizen_Science_or_Volunteered_Geographic_Information_The_Current_State_of_Crowdsourced_Geographic_Information","324667733_Persisting_Effects_of_Internet_Skills_on_Online_Participation","322738844_Why_is_participation_inequality_important","320800753_European_handbook_of_crowdsourced_geographic_information","301977553_The_Impact_of_Society_on_Volunteered_Geographic_Information_The_Case_of_OpenStreetMap","300725523_Barriers_to_the_Localness_of_Volunteered_Geographic_Information"]}