{"id":"317638944_Theory_of_Planned_Behavior_Undergraduates'_Entrepreneurial_Motivation_and_Entrepreneurship_Career_Intention_at_a_Public_University","abstract":"Entrepreneurship intention for graduate students like many other job and work career options\ndepends on other considerations. Previous literature reviews revealed that more research\nworks are needed in examining the determinants of entrepreneurship intentions of students.\nDue to its importance and significant thrust to the economic development of a nation, research\nworks on entrepreneurial motivation and entrepreneurship intentions have continued to be the\nfocus in recent years. This study uses Theory of Planned Behaviour Model to determine the level\nof students’ entrepreneurial motivation and entrepreneurship intention at a public University\nand the relationship between these two factors. A total of 450 self-administered questionnaires\nwere distributed to the students of the various faculties, races and student seniority at a Public\nUniversity using the convenient and structured sampling method. A total of 413 duly completed\nquestionnaires that were returned were used in the analyses. The components of\nentrepreneurial motivation affecting career entrepreneurship intention are found to be\ncomprised of behavioral control, subjective norm, and attitude towards entrepreneurship. The\nlevel of behavioral control is very good; subjective norm and attitude towards entrepreneurship\nare both at good level. Subjective norm and attitude of self-employment are significantly related\nto both student immediate and future entrepreneurship intentions. However, behavioral control\nentrepreneurial motivation is found to be significantly related to student immediate career\nintention but not related to entrepreneurship career intention. Planned Behavior Model can be\nused as a tool to identify the would be entrepreneur and target them for entrepreneurial\ndevelopment. Youths who are really serious to start and own a business as would be\nentrepreneurs can be identified and targeted through this Model to be developed through\nentrepreneurship interventions initiatives.","authors":["Ng Kim-Soon","Abd Rahman Ahmad","Nurul Nadia Ibrahim"],"meta":["April 2016","DOI:10.5171/2016.792385"],"references":["308020275_An_Assessment_of_Entrepreneurship_Intention_Among_Sunyani_Polytechnic_Marketing_Students","287624579_Discriminate_Analyses_of_Motivators_and_Obstacles_on_Youth_Entrepreneurial_Intention","285982741_An_exploratory_study_of_entrepreneurial_attributes_among_Malaysian_university_students","281970801_Entrepreneurial_intent_A_twelve_country_evaluation_of_Ajzen's_model_on_planned_behavior","272790646_The_Theory_of_Planned_Behavior","321619593_Understanding_the_Entrepreneurial_Mind_Opening_the_Black_Box","316823281_Self-efficacy_the_exercise_of_control","287527954_Using_the_theory_of_planned_behavior_to_predict_nascent_entrepreneurship","285831994_Self-Efficacy_The_Exercise_of_Control","285106589_Self-determination_theory_and_the_facilitation_of_intrinsic_motivation_social_Schwartz_S_H_1977"]}