{"id":"317619632_Brain-shift_compensation_using_intraoperative_ultrasound_and_constraint-based_biomechanical_simulation","abstract":"Purpose: \nDuring brain tumor surgery, planning and guidance are based on preoperative images which do not account for brain-shift. However, this deformation is a major source of error in image-guided neurosurgery and affects the accuracy of the procedure. In this paper, we present a constraint-based biomechanical simulation method to compensate for craniotomy-induced brain-shift that integrates the deformations of the blood vessels and cortical surface, using a single intraoperative ultrasound acquisition.\n\nMethods: \nPrior to surgery, a patient-specific biomechanical model is built from preoperative images, accounting for the vascular tree in the tumor region and brain soft tissues. Intraoperatively, a navigated ultrasound acquisition is performed directly in contact with the organ. Doppler and B-mode images are recorded simultaneously, enabling the extraction of the blood vessels and probe footprint, respectively. A constraint-based simulation is then executed to register the pre- and intraoperative vascular trees as well as the cortical surface with the probe footprint. Finally, preoperative images are updated to provide the surgeon with images corresponding to the current brain shape for navigation.\n\nResults: \nThe robustness of our method is first assessed using sparse and noisy synthetic data. In addition, quantitative results for five clinical cases are provided, first using landmarks set on blood vessels, then based on anatomical structures delineated in medical images. The average distances between paired vessels landmarks ranged from 3.51 to 7.32 (in mm) before compensation. With our method, on average 67% of the brain-shift is corrected (range [1.26; 2.33]) against 57% using one of the closest existing works (range [1.71; 2.84]). Finally, our method is proven to be fully compatible with a surgical workflow in terms of execution times and user interactions.\n\nConclusion: \nIn this paper, a new constraint-based biomechanical simulation method is proposed to compensate for craniotomy-induced brain-shift. While being efficient to correct this deformation, the method is fully integrable in a clinical process.","authors":["Fanny Morin","Hadrien Courtecuisse","Ingerid Reinertsen","Florian Le Lann"],"meta":["June 2017Medical Image Analysis 40","DOI:10.1016/j.media.2017.06.003","Project: Correction of brain shift using ultrasound"],"references":["318033294_Biomechanical_Modeling_of_Brain_Soft_Tissues_for_Medical_Applications","306918007_Brain_Shift_in_Neuronavigation_of_brain_tumours_A_Review","305615876_Prior-Based_Coregistration_and_Cosegmentation","289676196_An_optimised_linear_mechanicalmodel_for_estimating_brain_shift_caused_by_meningioma_tumours","319950540_Serial_Intraoperative_Magnetic_Resonance_Imaging_of_Brain_Shift","313631518_Use_of_Cortical_Surface_Vessel_Registration_for_Image-guided_Neurosurgery","313080829_Enhanced_Probabilistic_Label_Fusion_by_Estimating_Label_Confidences_Through_Discriminative_Learning","308499172_Hierarchical_Multi-Atlas_Segmentation_Using_Label-Specific_Embeddings_Target-Specific_Templates_and_Patch_Refinement","301696284_Evaluation_of_model-based_deformation_correction_in_image-guided_liver_surgery_via_tracked_intraoperative_ultrasound","301307838_On_the_Appropriateness_of_Modelling_Brain_Parenchyma_as_a_Biphasic_Continuum"]}