{"id":"317635629_Will_productivity_growth_return_in_the_new_digital_era_An_analysis_of_the_potential_impact_on_productivity_of_the_fourth_industrial_revolution","abstract":"It is increasingly acknowledged that we are on the verge of the next technological revolution and the fourth industrial revolution, driven by the digitization and interconnection of all physical elements and infrastructure under the control of advanced intelligent systems. Therefore, there will be a new era of automation that should result in enhanced productivity. However, such productivity enhancements have been anticipated before, particularly during the third industrial revolution commonly known as the ‘information age’, and have failed to materialize. Were the productivity increases observed following the first and second industrial revolutions a one-time aberration that will not be repeated in the new digital age? In this paper, we attempt to address this question by a semi-quantitative analysis of the prior productivity jumps and their physical technological origins, and extend this analysis to the latent set of analogous digital technologies. Using this approach, we project that there will indeed be a second productivity jump in the United States that will occur in the 2028-2033 timeframe when the aggregate of the of constituent technologies reaches the tipping point at 51 percent penetration.","authors":["Iraj Saniee","Sanjay Kamat","Subra Prakash","Marcus Weldon"],"meta":["June 2017Bell Labs Technical Journal PP(99):1-1","DOI:10.15325/BLTJ.2017.2714819","Project: Network Economics"],"references":["327689849_The_Future_X_Network_A_Bell_Labs_Perspective","305356696_The_Rise_and_Fall_of_American_Growth_The_US_Standard_of_Living_since_the_Civil_War","260711519_Metcalfe's_Law_after_40_Years_of_Ethernet","248582480_The_Singularity_Is_Near","247406913_Review_in_New_York_Times_Book_Review","220041609_Motivation_and_Personality","46513433_Technological_Revolutions_and_Techno-economic_Paradigms"]}