{"id":"317601176_A_Study_of_Interactional_Metadiscourse_in_English_Abstracts_of_Chinese_Economics_Research_Articles","abstract":"This study adopts the revised interpersonal model of metadiscourse to discover whether and to what extent Chinese authors employ a varying amount of Interactional Metadiscourse (IM) in the past decade in English abstracts of economics Research Articles (RAs). The data was drawn from a prestigious economics journal in China to compose a corpus of 289 abstracts. The analysis indicates that Chinese authors harmonize with English counterparts by capitalizing on more hedges, while the amount of boosters unexpectedly maintains at a high level over time, both of which can be attributed to the interaction of Chinese deep-seated cultural leanings and Anglo-American cultural preferences. Consistent with our prediction, attitude markers exhibit no significant difference along the years given the initial parallel with English counterparts. However, there are significant differences of self-mentions in the past decade regardless of English rhetorical conventions, which may be attributed to economical influences in China. With regards to engagement features, they remain relatively underused with no marked difference within the period resulting from the genre-specific factor which confines their use.","authors":["Ping Liu","Xu Huang"],"meta":["June 2017Higher Education Studies 7(3):25","DOI:10.5539/hes.v7n3p25"],"references":["305323244_Interactions_in_L1_and_L2_undergraduate_student_writing_Interactional_metadiscourse_in_successful_and_less-successful_argumentative_essays","303690185_Change_of_Attitude_A_Diachronic_Study_of_Stance","286615473_Rhetorical_and_textual_organization_of_English_and_Arabic_PhD_dissertation_abstracts_in_linguistics","304602846_Historians_at_Work_Reporting_Frameworks_in_English_and_Italian_Book_Review_Articles","290990778_Author_identity_in_economics_and_linguistics_abstracts","286973348_Linking_adverbials_in_research_articles_across_eight_disciplines","275714090_Learning_considered_within_a_cultural_context_Confucian_and_Socratic_approaches","275615831_Language_and_Symbolic_Power","274713674_Disciplinary_and_paradigmatic_influences_on_interactional_metadiscourse_in_research_articles","273599013_The_use_of_interactional_metadiscourse_in_job_postings"]}