{"id":"317672290_Sheepskin_Effects_in_the_Returns_to_Higher_Education_New_Evidence_for_Malaysia","abstract":"The aim of this study is to distinguish between the returns to education from mere years of schooling as a reflection of their productive-enhancing contribution (human capital) and the returns to education from certificates of qualification which serve as signals of individual's ability (sheepskin effects). In order to do so, the present study relies on data from Household Income Survey (HIS) 2002–2012. Even though the overall result found the sheepskin effects serve as a higher signal of productivity compared to years of schooling in enabling individuals to seek higher returns in the labour market, the sheepskin effects from both diploma and university degrees are different between two phases: 2002–2007 and 2007–2012. The over-education and under-skilled situation respectively occur among degree and diploma holders in the Malaysian business services sector might be evidence that the sheepskin effects for both credentials are limited to provide higher signal to employers compared to university dropout between 2002 and 2007. However, the patterns of sheepskin effects between 2007 and 2012 are significantly different from 2002 and 2007. The present study discovered that the sheepskin effects brought some substantial earnings than years of schooling with the largest individual's sheepskin effects – associated with the degree and diploma qualifications. Due to the increasingly importance of academic certificate in determining the labour market earning, this study suggests the higher learning institutes to further strengthen their collaboration with employers and representatives of skilled workers from relevant industries in the quality assurance process and accreditation. This is to ensure that the skills needed in the labour market are incorporated in the university curriculum as these are effective in increasing graduate's employability. © Asian Academy of Management and Penerbit Universiti Sains Malaysia, 2017.","authors":["Norhanishah Mohamad yunus"],"meta":["January 2017Asian Academy of Management Journal 22(1):151-182","DOI:10.21315/aamj2017.22.1.7"],"references":["318205567_Education_and_Earnings_in_the_Malaysian_Information_Communication_and_Technology_Sector_The_Role_of_Certificates_of_Qualification","311254068_The_Effects_of_Over-Education_on_Returns_in_the_Graduate_Labour_Market","309241782_Do_Higher_Levels_of_Qualification_Lead_to_Higher_Returns_to_Education_Evidence_From_Malaysian_Education_Sector","272554743_Expansion_of_Higher_Education_and_Declining_Quality_of_Degrees","313302179_Job_Market_Signaling","313071948_Family_Investments_in_Human_Capital_Earnings_of_Women","312580546_FACTORS_AFFECTING_LABOUR_PRODUCTIVITY_SKILLED_LABOUR_AND_RETURNS_TO_EDUCATION_IN_MALAYSIA","287375989_What_About_Certificates_Evidence_on_the_Labor_Market_Returns_to_Nondegree_Community_College_Awards_in_Two_States","272720820_Investment_in_Human_Capital","267870615_The_Medium-Term_Labor_Market_Returns_to_Community_College_Awards_Evidence_From_North_Carolina"]}