{"id":"317613762_Permeability-driven_selection_in_a_semi-empirical_protocell_model_The_roots_of_prebiotic_systems_evolution","abstract":"The origin-of-life problem has been traditionally conceived as the chemical challenge to find the type of molecule and free-solution reaction dynamics that could have started Darwinian evolution. Different autocatalytic and ‘self-replicative’ molecular species have been extensively investigated, together with plausible synthetic pathways that might have led, abiotically, to such a minimalist scenario. However, in addition to molecular kinetics or molecular evolutionary dynamics, other physical and chemical constraints (like compartmentalization, differential diffusion, selective transport, osmotic forces, energetic couplings) could have been crucial for the cohesion, functional integration, and intrinsic stability/robustness of intermediate systems between chemistry and biology. These less acknowledged mechanisms of interaction and molecular control might have made the initial pathways to prebiotic systems evolution more intricate, but were surely essential for sustaining far-from-equilibrium chemical dynamics, given their functional relevance in all modern cells. Here we explore a protocellular scenario in which some of those additional constraints/mechanisms are addressed, demonstrating their ‘system-level’ implications. In particular, an experimental study on the permeability of prebiotic vesicle membranes composed of binary lipid mixtures allows us to construct a semi-empirical model where protocells are able to reproduce and undergo an evolutionary process based on their coupling with an internal chemistry that supports lipid synthesis.","authors":["Gabriel Piedrafita","Pierre-Alain Monnard","Fabio Mavelli","Kepa Ruiz-Mirazo"],"meta":["June 2017Scientific Reports 7(1)","DOI:10.1038/s41598-017-02799-6"],"references":["255750312_Prebiotically_relevant_mixed_fatty_acid_vesicles_support_anionic_solute_encapsulation_and_photochemically_catalyzed_trans-membrane_charge_transport","236929647_Competition_between_model_protocells_driven_by_an_encapsulated_catalyst","228116541_Viability_Conditions_for_a_Compartmentalized_Protometabolic_System_A_Semi-Empirical_Approach","225296584_ChemInform_Abstract_Pathways_for_the_Formation_and_Evolution_of_Peptides_in_Prebiotic_Environments","279065577_Self-reproducing_catalyst_drives_repeated_phospholipid_synthesis_and_membrane_growth","276850207_The_systems_perspective_at_the_crossroads_between_chemistry_and_biology","274088015_Common_origins_of_RNA_protein_and_lipid_precursors_in_a_cyanosulfidic_protometabolism","263053590_Emergent_properties_arising_from_the_assembly_of_amphiphiles_Artificial_vesicle_membranes_as_reaction_promoters_and_regulators","258202120_Prebiotic_System_Chemistry_New_Perspectives_for_the_Origins_of_Life","233901597_Theoretical_conditions_for_the_stationary_reproduction_of_model_protocells"]}