{"id":"317640555_Assessing_teacher_education_and_professional_development_needs_for_the_implementation_of_integrated_approaches_to_STEM_education","abstract":"Abstract\nBackground: Given the growing interest in, and relevance of, integrated approaches to STEM (science, technology,\nengineering, and mathematics) education, there is an urgent desire to understand the challenges and obstacles to\ndeveloping and implementing integrated STEM curricula and instruction. In this article, we present phase 1 of a\ntwo-phase needs assessment study to identify challenges and needs of promoting integrated approaches in STEM\neducation. Utilizing a key informant approach, 22 K-12 teachers and four administrators selected as potential leaders in STEM education in an unidentified state on the East Coast of the USA were interviewed. Participants were asked to identify challenges and perceived supports to conduct integrated STEM education. Questions were open-ended in order to inform a larger, state-wide questionnaire study in phase 2 to be reported subsequently and were qualitatively coded.\n\nResults: Several distinctive themes were identified as described by teacher participants when discussing challenges and obstacles of implementing integrated STEM education, as well as supports that would be most helpful in overcoming them. Participants also provided specific suggestions for teacher education needed to support integrated STEM education.\n\nConclusions: Preliminary findings suggest that many teachers are interested in integrated approaches to STEM, but do not believe they are well prepared to implement them. Teachers and administrators also suggest that adequate preparation in integrated STEM would entail a considerable rethinking and redesigning of pre-service courses and in-service workshops. Findings provide a starting point for better understanding teacher needs in integrated STEM and a springboard for further study.","authors":["David J Shernoff","Suparna Sinha","Denise Bressler","Lynda Ginsburg"],"meta":["June 2017International Journal of STEM Education 4(1):1 - 16","DOI:10.1186/s40594-017-0068-1"],"references":["316370139_Engineering_Design_The_Great_Integrator","315691970_Supporting_Integrated_STEM_in_the_Elementary_Classroom_A_Professional_Development_Approach_Centered_on_an_Engineering_Design_Challenge","310666622_The_eight_essential_elements_of_inclusive_STEM_high_schools","309398902_A_Proposed_Integrated_STEM_Framework_for_Contemporary_Teacher_Preparation","305418293_A_conceptual_framework_for_integrated_STEM_education","344539723_Examination_of_Integrated_STEM_Curricula_as_a_Means_Toward_Quality_K-12_Engineering_Education_Research_to_Practice","328296694_A_Conceptual_Framework_for_STEM_Integration_Into_Curriculum_Through_Career_and_Technical_Education","317953571_Qualitative_inquiry_research_design_Choosing_among_five_approaches","317953357_The_discovery_of_grounded_theory","309109591_STEM_integration_in_K-12_education_status_prospects_and_an_agenda_for_research"]}