{"id":"317660569_Invariance_Feedback_Entropy_of_Uncertain_Control_Systems","abstract":"We introduce a novel notion of invariance feedback entropy to quantify the state information that is required by any controller that enforces a given subset of the state space to be invariant. We establish a number of elementary properties, e.g. we provide conditions that ensure that the invariance feedback entropy is finite and show for the deterministic case that we recover the well-known notion of entropy for deterministic control systems. We prove the data rate theorem, which shows that the invariance entropy is a tight lower bound of the data rate of any coder-controller that achieves invariance in the closed loop. We analyze uncertain linear control systems and derive a universal lower bound of the invariance feedback entropy. The lower bound depends on the absolute value of the determinant of the system matrix and a ratio involving the volume of the invariant set and the set of uncertainties. Furthermore, we derive a lower bound of the data rate of any static, memoryless coder-controller. Both lower bounds are intimately related and for certain cases it is possible to bound the performance loss due to the restriction to static coder-controllers by 1 bit/time unit. We provide various examples throughout the paper to illustrate and discuss different definitions and results.","authors":["Matthias Rungger","Majid Zamani"],"meta":["June 2017IEEE Transactions on Automatic Control PP(99)","DOI:10.1109/TAC.2020.3038702"],"references":["316912517_Topological_feedback_entropy_for_nonlinear_stabilization","273447079_Feedback_Refinement_Relations_for_the_Synthesis_of_Symbolic_Controllers","324216815_Set-theoretic_methods_in_control","322671948_On_the_invariance_feedback_entropy_of_linear_perturbed_control_systems","316940462_Invariance_Feedback_Entropy_of_Nondeterministic_Control_Systems","300414066_Entropy_properties_of_deterministic_control_systems","284318634_A_connection_between_various_entropy_characterizations_of_dynamical_systems","278711359_Set-Valued_Analysis","267089163_Invariance_entropy_for_deterministic_control_systems_An_introduction","266013443_An_introduction_to_measure_theory"]}