{"id":"317602562_Metodologia_para_la_implementacion_de_estrategia_curricular_de_investigacion_e_informatica_en_la_carrera_de_medicina","abstract":"Introducción: en las estrategias curriculares se diseña un nuevo aspecto a la visión de las características del proceso de formación en la educación superior; sus objetivos están relacionados con determinados conocimientos, habilidades y modos de actuación profesional clave en la formación del estudiante, que no es posible lograr desde la óptica de una disciplina o asignatura, ni con planes de estudio integrados, sino que requieren la participación de las unidades curriculares de la carrera.\n\nObjetivo: diseñar la metodología para la implementación de la Estrategia Curricular de Investigación e Informática en la carrera de Medicina.\n\nMétodos: se realizó una investigación de desarrollo sobre el universo de todas las asignaturas de la carrera de Medicina de primero a quinto año y una muestra intencionada de 13 asignaturas. Se aplicaron métodos teóricos que posibilitó fundamentar y buscar solución al problema investigado y métodos empíricos para la obtención de información, se aplicaron cuestionarios a 116 profesores, diez especialistas y la observación a seis clases que permitió justificar la metodología propuesta.\n\nResultados: se diseñó en cuatro etapas con varias acciones y orientaciones metodológicas para su ejecución, propuestas de evaluación por los diferentes niveles de integración de la carrera de la metodología. Se concluyó que la estrategia curricular de Investigación e Informática no se aplica como está establecido en la carrera de Medicina.\n\nConclusiones: la metodología para implementar la Estrategia Curricular que se propone propicia la relación interdisciplinar de todas las asignaturas de la malla curricular con la Disciplina Informática Médica.\n\nPalabras clave: estrategia curricular, metodología, Investigación, interdisciplinariedad, informática.","authors":["María Emilia Rodríguez Neyra","María de los Ángeles Carrasco Feria"],"meta":["June 2017"],"references":["317513889_Papel_de_la_Informatica_Medica_en_el_desarrollo_de_las_formas_logicas_del_pensamiento","28207213_Alfabetizacion_informacional_cuestiones_basicas","317522068_El_metodo_cientifico_y_la_interdisciplinariedad_en_el_abordaje_del_Analisis_de_la_Situacion_de_Salud","262654708_Interdisciplinariedad_entre_la_Medicina_General_Integral_y_la_Informatica_Medica_relacionada_con_el_desarrollo_de_una_revision_bibliografica","262622463_Metodologia_y_aplicacion_de_las_estrategias_curriculares_en_la_asignatura_Rehabilitacion_protesica_de_la_carrera_de_Estomatologia","262465455_La_estrategia_investigativa_curricular_en_la_carrera_de_medicina","262447134_Impacto_de_las_tecnologias_de_la_informacion_y_las_comunicaciones_en_la_educacion_y_nuevos_paradigmas_del_enfoque_educativo"]}