{"id":"317604405_L'analyse_cognitive_la_psychologie_numerique_et_la_formation_des_enseignants_a_l'universite","abstract":"Résumé\nL’analyse cognitive est le fruit d’une réflexion utilisant, entre autres, les principes de la pensée informatique (mathématique, logique et algorithmique) pour repenser des connaissances et des techniques de plusieurs domaines de la psychologie cognitive, de la psychologie sociale, de la psychologie des émotions et de la psychologie de la communication en vue de la formation pédagogique des enseignants d’université. Avant de présenter l’analyse cognitive, je vais rappeler comment l’histoire du calcul depuis 5000 ans peut être vue comme une tentative (réussie) de comprendre, formaliser et automatiser le traitement humain de l’information, thème sur lequel se retrouvent l’informatique et la psychologie. Puis, je montrerai qu’un nouveau comportementalisme, basé sur le comportement numérique mais aussi sur les comportements classiques et sur les zones du cerveau, est en train d’émerger et qu’il produit des modèles psychologiques qui sont utilisés pour connaître les pensées et les intentions des personnes observées, pour mieux leur vendre des objets et pour prédire leurs actions par exemple ; une psychologie numérique émerge. Bien que chacun d’entre nous utilise son ordinateur portable et internet comme une extension de son esprit (lire « Petite Poucette » de Michel Serres), nous n’avons pas encore intégré explicitement la pensée informatique. Nous expliciterons donc quelques éléments de la pensée informatique et nous présenterons enfin l’analyse cognitive en soulignant comment elle utilise à la fois la pensée informatique et des connaissances de psychologie.","authors":["Alain Finkel"],"meta":["June 2017Pratiques Psychologiques 23(3)","DOI:10.1016/j.prps.2017.05.006","Project: Analyse cognitive"],"references":["305452114_Voice_analysis_as_an_objective_state_marker_in_bipolar_disorder","284161789_Le_numerique_au_service_de_la_personne_avec_autisme","281276761_Automated_analysis_of_free_speech_predicts_psychosis_onset_in_high-risk_youths","278771260_Utilisations_therapeutiques_des_interfaces_cerveau-ordinateur","274309848_Computational_Thinking","320182224_Idees_directrices_pour_une_phenomenologie","316723216_De_l'art_oratoire_en_milieu_universitaire_entre_psychanalyse_et_neurosciences_cognitives","306939383_The_magical_number_seven_plus_or_minus_two_Some_limits_on_our_capacity_to_process_information","301084216_Evaluation_des_resultats_des_therapies_comportementales_et_cognitives","276935481_L'entretien_d'explicitation_en_formation_initiale_et_en_formation_continue"]}