{"id":"317670255_Toward_online_education_for_fingerprint_recognition_A_proof-of-concept_web_platform","abstract":"Recent advances in information and communication technology (ICT) have pushed education systems into the online paradigm. Although fingerprint recognition has received considerable attention from researchers, the concept of creating online or distance education systems for fingerprint recognition systems is a valid problem that requires further investigation. This article addresses the problem and presents a web platform for online education of a fingerprint recognition system. This study focused on the technical design and implementation of the web platform solely as a proof of concept to illustrate the possibility of creating distance education for fingerprint recognition. The developed platform offers students a way to gain knowledge about the full range of fingerprint recognition system technology. The significance of using a web platform stems from the need to supplement students’ theoretical knowledge with practical hands-on experience with information security in general and with fingerprint recognition in particular. Demonstrations such as fingerprint image enhancement and fingerprint feature extraction are included in the current platform prototype. Plots of fingerprint recognition performance curves such as false match rate (FMR) and false non-match rate (FNMR) as functions of the matching threshold curve, the receiver operating characteristic (ROC) curve, and the detection error trade-off (DET) curve are plotted as part of the platform. From a technical viewpoint, the platform was successfully implemented; however, its educational impact needs further evaluation.","authors":["Ebenezer Okoh","Makame Hamza Makame","Ali Ismail Awad"],"meta":["June 2017Information Security Journal A Global Perspective","DOI:10.1080/19393555.2017.1329462"],"references":["222823428_Preprocessing_and_postprocessing_for_skeleton-based_fingerprint_minutiae_extraction","316274135_Introduction_to_Biometrics","264817700_Towards_a_novel_service_learning_platform_A_second_generation_learning_solution","258369042_Handbook_of_fingerprint_recognition_With_DVD","234025283_Fingerprint_Indexing_with_Bad_Quality_Areas","223684094_Advances_in_fingerprint_modeling","223257621_Shift_Happens_Online_Education_as_a_New_Paradigm_in_Learning","222507346_Adaptive_Flow_Orientation_Based_Feature_Extraction_in_Fingerprint_Images","222416905_A_Hybrid_Fingerprint_Matcher","220654726_Fingerprint_classification_A_review"]}