{"id":"317752394_BME_VIK_Annual_Research_Report_on_Electrical_Engineering_and_Computer_Science_2016","abstract":"PrefaceSince being established in 1949, the Faculty of Electrical Engineering and Informatics (VIK) BME has played a flagship role in the development of electronics, IT and computer science in Hungary. We are proud of combining engineering applications with sound scientific results, which is the assurance of high-level industrial collaboration leading to novel results and innovation. The various collaborations with our industrial partners has made it clear that the industry expects methods and results which make their industrial processes more effective and increase productivity and quality. Thus, participation in these collaborations give a competitive edge and ensure the continuous development of VIK. These factors have positioned our Faculty as a significant source of knowledge transfer and a treasured partner in various cooperation activities.The current paper gives a brief account of the results achieved at the Faculty of Electrical Engineering and Informatics in the year 2016 and, at the same time, tries to encompass the research activities conducted at different departments of the Faculty. We believe that this survey proves to be an informative summary about our scientific and technological contributions made in the year 2016.László Jakab (dean, BME VIK)János Levendovszky (vice-dean in charge of scientific affairs, BME VIK)","authors":["Hassan Charaf","G. Harsanyi","Andras Poppe","Sandor Imre"],"meta":["May 2017Periodica Polytechnica, Electrical Engineering 61(2):83-115","DOI:10.3311/PPee.11067"],"references":["328531343_The_Difference_Between_Leisure_and_Competitive_Squash","326958091_A_New_Data-flow_Graph_Model_Extended_for_Handling_Loops_and_Arrays_in_System-level_Synthesis","349624012_Multi-domain_modeling_of_power_LEDs_based_on_measured_isothermal_IVL_characteristics","340038115_Hacking_cars_in_the_style_of_Stuxnet","331224459_On_the_Packet_Delay_Characteristics_for_Serially-Connected_Links_using_Random_Linear_Network_Coding_with_and_without_Recoding","331224213_Performance_Prediction_of_Robust_Header_Compression_version_2_for_RTP_Audio_Streaming_Using_Linear_Regression","321703808_Multiplicative_Bases_and_an_Erdos_Problem","320648231_Regularizing_direct_parametric_reconstruction_for_dynamic_PET_with_the_method_of_sieves","319456785_Model-driven_multi-domain_IoT","319223300_A_new_type_of_conductor_car_for_high_voltage_live-line_maintenance"]}