{"id":"317727920_JSTrace_Fast_Reproducing_Web_Application_Errors","abstract":"JavaScript has become the most popular language for client-side web applications. Due to JavaScript's highly-dynamic and event-driven features, it is challenging to diagnose web application errors. Record-replay techniques are used to reproduce errors in web applications. After a long run, these techniques will record a long event trace that triggers an error. Although the error-related events are few, they are interleaved with other massive error-irrelevant events. It is time-consuming to diagnose errors with long event traces.\nIn this article, we present JSTrace, which effectively removes error-irrelevant events from the long event trace, and further facilitates error diagnosis. Based on fine-grained dependences of JavaScript and DOM instructions, we develop a novel dynamic slicing technique that can remove events irrelevant to the error. We further present rules to remove irrelevant events, which cannot be removed by dynamic slicing. In this process, many events and related instructions are removed without losing the error reproducing accuracy. Our evaluation on 13 real-world web application errors shows that the reduced event traces can faithfully reproduce errors with an average reduction rate of 97%. We further performed case studies on 4 real-world errors, and the result shows that JSTrace is useful to diagnose web application errors.","authors":["Jie Wang","Wensheng Dou","Chushu Gao","Jun Wei"],"meta":["June 2017Journal of Systems and Software 137","DOI:10.1016/j.jss.2017.06.038","Project: Web application analysis"],"references":["261464432_An_Empirical_Study_of_Client-Side_JavaScript_Bugs","254034813_AutoFLox_An_Automatic_Fault_Localizer_for_Client-Side_JavaScript","235952233_Extracting_client-side_web_application_code","224194844_DoDOM_Leveraging_DOM_Invariants_for_Web_20_Application_Robustness_Testing","221608976_Ripley_Automatically_securing_web_20_applications_through_replicated_execution","313580789_Program_slicing","286001186_Frontiers_of_the_Oceanic_Anoxic_Events_OAEs_terrestrial_deposits_and_development_of_source_rocks","278050672_Comparative_study_of_oxidation_and_interdiffusion_behavior_of_AIP_NiCrAlY_and_sputtered_nanocrystalline_coatings_on_a_nickel-based_single-crystal_superalloy","261314435_Efficient_and_change-resilient_test_automation_An_industrial_case_study","224248738_WaRR_A_tool_for_high-fidelity_web_application_record_and_replay"]}