{"id":"317719312_Multi-Target_Support_Vector_Regression_Via_Correlation_Regressor_Chains","abstract":"Multi-target regression is a challenging task that consists of creating predictive models for problems with multiple continuous target outputs. Despite the increasing attention on multi-label classification, there are fewer studies concerning multi-target (MT) regression. The current leading MT models are based on ensembles of regressor chains, where random, differently ordered chains of the target variables are created and used to build separate regression models, using the previous target predictions in the chain. The challenges of building MT models stem from trying to capture and exploit possible correlations among the target variables during training. This paper presents three multi-target support vector regression models. The first involves building independent, single-target Support Vector Regression (SVR) models for each output variable. The second builds an ensemble of random chains using the first method as a base model. The third calculates the targets’ correlations and forms a maximum correlation chain, which is used to build a single chained support vector regression model, improving the models’ prediction performance while reducing the computational complexity. The experimental study evaluates and compares the performance of the three approaches with seven other state-of-the-art multi-target regressors on 24 multi-target datasets. The experimental results are then analyzed using non-parametric statistical tests. The results show that the maximum correlation SVR approach improves the performance of using ensembles of random chains.","authors":["Gabriella Melki","Alberto Cano","Vojislav Kecman","Sebastian Ventura"],"meta":["November 2017Information Sciences 415-416:53-69","DOI:10.1016/j.ins.2017.06.017","Project: Data Mining with More Flexible Representations"],"references":["309527321_A_study_on_the_use_of_non-parametric_tests_for_analyzing_the_evolutionary_algorithms'_behaviour_a_case_study_on_the_CEC'2005_special_session_on_real_parameter_optimization","295242167_Multi-target_regression_via_input_space_expansion_treating_targets_as_inputs","282938718_LAIM_discretization_for_multi-label_data","313385761_Data_Mining_Practical_Machine_Learning_Tools_and_Techniques","311656371_Finding_the_Samples_near_the_Decision_Plane_for_Support_Vector_Learning","307881957_LIBSVM_A_library_for_support_vector_machines","304821782_A_novel_attribute_reduction_approach_for_multi-label_data_based_on_rough_set_theory","280915654_A_survey_on_multi-output_regression","279234652_A_Novel_Boosted-Neural_Network_Ensemble_for_Modeling_Multi-Target_Regression_Problems_Tier_1","276358502_Global_Nonlinear_Kernel_Prediction_for_Large_Data_Set_With_a_Particle_Swarm-Optimized_Interval_Support_Vector_Regression"]}