{"id":"317711703_Advanced_Steel_Microstructural_Classification_by_Deep_Learning_Methods","abstract":"The inner structure of a material is called microstructure. It stores the genesis of a material and determines all its physical and chemical properties. While microstructural characterization is widely spread and well known, the microstructural classification is mostly done manually by human experts, which gives rise to uncertainties due to subjectivity. Since the microstructure could be a combination of different phases or constituents with complex substructures its automatic classification is very challenging and only a few prior studies exist. Prior works focused on designed and engineered features by experts and classified microstructures separately from the feature extraction step. Recently, Deep Learning methods have shown strong performance in vision applications by learning the features from data together with the classification step. In this work, we propose a Deep Learning method for microstructural classification in the examples of certain microstructural constituents of low carbon steel. This novel method employs pixel-wise segmentation via Fully Convolutional Neural Network (FCNN) accompanied by a max-voting scheme. Our system achieves 93.94% classification accuracy, drastically outperforming the state-of-the-art method of 48.89% accuracy. Beyond the strong performance of our method, this line of research offers a more robust and first of all objective way for the difficult task of steel quality appreciation.","authors":["Seyedmajid Azimi","Dominik Britz","Michael Engstler","Mario Fritz"],"meta":["February 2018Scientific Reports 8(1)","DOI:10.1038/s41598-018-20037-5"],"references":["309185766_Support_vector_regression_machines","323817061_Advanced_microstructure_classification_by_data_mining_methods","320427919_A_Correlative_Approach_to_Capture_and_Quantify_Substructures_by_Means_of_Image_Registration","319770820_Histograms_of_Oriented_Gradients_for_Human_Detection","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","317025520_Identifying_and_quantifying_microstructures_in_low-alloyed_steels_A_correlative_approach","313351103_Weld_Microstructures","309469830_Reproducible_Surface_Contrasting_and_Orientation_Correlation_of_Low-Carbon_Steels_by_Time-Resolved_Beraha_Color_Etching","302975280_Support_vector_regression_machines","301921832_Fully_convolutional_networks_for_semantic_segmentation"]}