{"id":"317711705_Can_the_Journal_Impact_Factor_Be_Used_as_a_Criterion_for_the_Selection_of_Junior_Researchers_A_Large-Scale_Empirical_Study_Based_on_ResearcherID_Data","abstract":"Early in researchers' careers, it is difficult to assess how good their work is or how important or influential the scholars will eventually be. Hence, funding agencies, academic departments, and others often use the Journal Impact Factor (JIF) of where the authors have published to assess their work and provide resources and rewards for future work. The use of JIFs in this way has been heavily criticized, however. Using a large data set with many thousands of publication profiles of individual researchers, this study tests the ability of the JIF (in its normalized variant) to identify, at the beginning of their careers, those candidates who will be successful in the long run. Instead of bare JIFs and citation counts, the metrics used here are standardized according to Web of Science subject categories and publication years. The results of the study indicate that the JIF (in its normalized variant) is able to discriminate between researchers who published papers later on with a citation impact above or below average in a field and publication year - not only in the short term, but also in the long term. However, the low to medium effect sizes of the results also indicate that the JIF (in its normalized variant) should not be used as the sole criterion for identifying later success: other criteria, such as the novelty and significance of the specific research, academic distinctions, and the reputation of previous institutions, should also be considered.","authors":["Lutz Bornmann","Richard A Williams"],"meta":["June 2017Journal of Informetrics 11(3)","DOI:10.1016/j.joi.2017.06.001"],"references":["313867677_An_investigation_on_the_skewness_patterns_and_fractal_nature_of_research_productivity_distributions_at_field_and_discipline_level","309345930_Towards_field-adjusted_production_Estimating_research_productivity_from_a_zero-truncated_distribution","309000698_There_should_not_be_any_mystery_A_comment_on_sampling_issues_in_bibliometrics","308738969_How_Many_Is_Too_Many_On_the_Relationship_between_Research_Productivity_and_Impact","308152662_Professional_and_Citizen_Bibliometrics_Complementarities_and_ambivalences_in_the_development_and_use_of_indicators","307886036_Relative_Citation_Ratio_RCR_A_New_Metric_That_Uses_Citation_Rates_to_Measure_Influence_at_the_Article_Level","301760859_A_farewell_to_the_MNCS_and_like_size-independent_indicators","316692979_Statistics_in_Medicine","314283211_Use_of_the_journal_impact_factor_for_assessing_individual_articles_need_not_be_wrong","309280178_Sampling_issues_in_bibliometric_analysis_Response_to_discussants"]}