{"id":"317749455_Interactive_Modeling_and_Authoring_of_Climbing_Plants","abstract":"We present a novel system for the interactive modeling of developmental climbing plants with an emphasis on efficient control and plausible physics response. A plant is represented by a set of connected anisotropic particles that respond to the surrounding environment and to their inner state. Each particle stores biological and physical attributes that drive growth and plant adaptation to the environment such as light sensitivity, wind interaction, and physical obstacles. This representation allows for the efficient modeling of external effects that can be induced at any time without prior analysis of the plant structure. In our framework we exploit this representation to provide powerful editing capabilities that allow to edit a plant with respect to its structure and its environment while maintaining a biologically plausible appearance. Moreover, we couple plants with Lagrangian fluid dynamics and model advanced effects, such as the breaking and bending of branches. The user can thus interactively drag and prune branches or seed new plants in dynamically changing environments. Our system runs in real-time and supports up to 20 plant instances with 25k branches in parallel. The effectiveness of our approach is demonstrated through a number of interactive experiments, including modeling and animation of different species of climbing plants on complex support structures. © 2017 The Author(s) Computer Graphics Forum © 2017 The Eurographics Association and John Wiley & Sons Ltd. Published by John Wiley & Sons Ltd.","authors":["Torsten Hädrich","Bedrich Benes","Oliver Deussen","Sören Pirk"],"meta":["May 2017Computer Graphics Forum 36(2):49-61","DOI:10.1111/cgf.13106"],"references":["274479082_Unified_Particle_Physics_for_Real-Time_Applications","316804801_Tropical_Trees_and_Forests","305277296_Modeling_plant_life_in_computer_graphics","294828786_Proceedings_of_SIBGRAPI_2009_-_22nd_Brazilian_Symposium_on_Computer_Graphics_and_Image_Processing_Preface","289649926_A_Study_on_the_Animations_of_Swaying_and_Breaking_Trees_based_on_a_Particle-based_Simulation","283959043_A_Procedural_Approach_to_Modelling_Virtual_Climbing_Plants_With_Tendrils","279929837_Woodification_User-Controlled_Cambial_Growth_Modeling","274423243_Interactive_Authoring_of_Simulation-Ready_Plants","270699725_Capturing_and_Animating_the_Morphogenesis_of_Polygonal_Tree_Models","268745732_Windy_Trees_Computing_Stress_Response_for_Developmental_Tree_Models"]}