{"id":"317716582_Investigating_Exploratory_Search_Activities_based_on_the_Stratagem_Level_in_Digital_Libraries","abstract":"In this paper we present the results of a user study on exploratory search activities in a social science digital library. We conducted a user study with 32 participants with a social sciences background -- 16 postdoctoral researchers and 16 students -- who were asked to solve a task on searching related work to a given topic. The exploratory search task was performed in a 10-minutes time slot. The use of certain search activities is measured and compared to gaze data recorded with an eye tracking device. We use a novel tree graph representation to visualise the users' search patterns and introduce a way to combine multiple search session trees. The tree graph representation is capable to create one single tree for multiple users and to identify common search patterns. In addition, the information behaviour of students and postdoctoral researchers is being compared. The results show that search activities on the stratagem level are frequently utilised by both user groups. The most heavily used search activities were keyword search, followed by browsing through references and citations, and author searching. The eye tracking results showed an intense examination of documents metadata, especially on the level of citations and references. When comparing the group of students and postdoctoral researchers we found significant differences regarding gaze data on the area of the journal name of the seed document. In general, we found a tendency of the postdoctoral researchers to examine the metadata records more intensively with regards to dwell time and the number of fixations.","authors":["Zeljko Carevic","Maria Lusky","Wilko van Hoek","Philipp Mayr"],"meta":["September 2018International Journal on Digital Libraries 19(2-3)","DOI:10.1007/s00799-017-0226-6"],"references":["316236640_Designing_for_Expert_Information_Finding_Strategies","283959959_Is_exploratory_search_different_A_comparison_of_information_search_behavior_for_exploratory_and_lookup_tasks","276866050_Digital_Library_Research_in_Action_Supporting_Information_Retrieval_in_Sowiport","274012282_Extending_search_facilities_via_bibliometric-enhanced_stratagems","273961637_On_Interactive_Interfaces_for_Semi-Structured_Academic_Document_Seeking_and_Relevance_Decision_Making","339504529_Methods_for_Evaluating_Interactive_Information_Retrieval_Systems_with_Users","305997713_Survey_on_High-level_Search_Activities_Based_on_the_Stratagem_Level_in_Digital_Libraries","305081504_Extracting_Information_Seeking_Intentions_for_Web_Search_Sessions","286812038_Quantitative_Analysis_of_Search_Sessions_Enhanced_by_Gaze_Tracking_with_Dynamic_Areas_of_Interest","276925940_User_Activity_Patterns_During_Information_Search"]}