{"id":"317705132_Excess_reciprocity_distorts_reputation_in_online_social_networks","abstract":"The peer-to-peer (P2P) economy relies on establishing trust in distributed networked systems, where the reliability of a user is assessed through digital peer-review processes that aggregate ratings into reputation scores. Here we present evidence of a network effect which biases digital reputation, revealing that P2P networks display exceedingly high levels of reciprocity. In fact, these are much higher than those compatible with a null assumption that preserves the empirically observed level of agreement between all pairs of nodes, and rather close to the highest levels structurally compatible with the networks' reputation landscape. This indicates that the crowdsourcing process underpinning digital reputation can be significantly distorted by the attempt of users to mutually boost reputation, or to retaliate, through the exchange of ratings. We uncover that the least active users are predominantly responsible for such reciprocity-induced bias, and that this fact can be exploited to obtain more reliable reputation estimates. Our findings are robust across different P2P platforms, including both cases where ratings are used to vote on the content produced by users and to vote on user profiles.","authors":["Giacomo Livan","Fabio Caccioli","Tomaso Aste"],"meta":["June 2017Scientific Reports 7(1)","DOI:10.1038/s41598-017-03481-7","Project: Excess reciprocity distorts reputation in online social networks"],"references":["288873081_Social_Media_and_the_Transformation_of_Public_Space","284224173_How_Evolutionary_Dynamics_Affects_Network_Reciprocity_in_Prisoner's_Dilemma","269092728_Degree_correlations_in_signed_social_networks","324671523_A_First_Look_at_Online_Reputation_on_Airbnb_Where_Every_Stay_is_Above_Average","312692162_How_social_influence_can_undermine_the_wisdom_of_crowd_effect","312469012_Bias_and_reciprocity_in_online_reviews_Evidence_from_experiments_on_airbnb","300494013_Bias_and_Reciprocity_in_Online_Reviews","283815782_The_Economics_of_Reputation_and_Feedback_Systems_in_E-Commerce_Marketplaces","281672716_Crowdsourcing_for_Public_Policy_and_Government","272302080_The_Rise_of_the_Sharing_Economy_Estimating_the_Impact_of_Airbnb_on_the_Hotel_Industry"]}