{"id":"317751583_Parametric_Identification_of_the_Dynamics_of_Mobile_Robots_and_Its_Application_to_the_Tuning_of_Controllers_in_ROS","abstract":"This tutorial chapter explains the identification of dynamic parameters of the dynamic model of wheeled mobile robots. Those parameters depend on the mass and inertia parameters of the parts of the robot and even with the help of modern CAD systems it is difficult to determine them with a precision as the designed robot is not built with 100% accuracy; the actual materials have not exactly the same properties as modeled in the CAD system; there is cabling which density changes over time due to robot motion and many other problems due to differences between the CAD model and the real robot. To overcome these difficulties and still have a good representation of the dynamics of the robot, this work proposes the identification of the parameters of the model. After an introduction to the recursive least-squares identification method, it is shown that the dynamic model of a mobile robot is a cascade between its kinematic model, which considers velocities as inputs, and its dynamics, which considers torques as inputs and then that the dynamics can be written as a set of equations linearly parameterized in the unknown parameters, enabling the use of the recursive least-squares identification. Although the example is a differential-drive robot, the proposed method can be applied to any robot model that can be parameterized as the product of a vector of parameters and a vector of regressors. The proposed parameter identification method is implemented in a ROS package and can be used with actual robots or robots simulated in Gazebo. The package for the Indigo version of ROS is available at http://www.ece.ufrgs.br/twil/indigo-twil.tgz. The chapter concludes with a full example of identification and the presentation of the dynamic model of a mobile robot and its use for the design of a controller. The controller is based on three feedback loops. The first one linearizes the dynamics of the robot by using feedback linearization, the second one uses a set of PI controllers to control the dynamics of the robot, and the last one uses a non-linear controller to control the pose of the robot.","authors":["Lages Walter Fetter"],"meta":["May 2017Studies in Computational Intelligence","DOI:10.1007/978-3-319-54927-9_6","In book: Robot Operating System (ROS) (pp.191-229)"],"references":["51046423_Model_learning_for_robot_control_A_survey","3344464_Closed_loop_steering_of_unicycle_like_vehicles_via_Lyapunov_techniques","317415439_Modern_control_engineering","305245516_Implementation_of_Real-Time_Joint_Controllers","286571453_A_backstepping_non-linear_controller_for_a_mobile_robot_implemented_in_ROS","269264016_Mobile_Robot_Control_Using_a_Cloud_of_Particles","267184859_Stable_Adaptive_System","265680905_Stable_adaptive_systems_Reprint_of_the_1989_ed","262479582_An_experience_on_stable_control_of_mobile_robots","256651264_Numerical_Recipes_The_art_of_scientific_computing","246405689_Hyperstability_of_Control_System","245416514_Annaswamy_Stable_Adaptive_Systems","239665928_ODE_Open_dynamics_engine","234794391_Modern_Control_Engineering","228108311_Nonlinear_Control_Systems_II","224156208_The_Office_Marathon_Robust_Navigation_in_an_Indoor_Office_Environment","44346630_Computer-Controlled_Systems_Theory_and_Design","4122159_Design_and_use_paradigms_for_Gazebo_an_open-source_multi-robot_simulator","3298611_Structural_Properties_and_Classification_of_Kinematic_and_Dynamic_Models_of_Wheeled_Mobile_Robots","2352121_Smooth_Time-Invariant_Control_Of_Wheeled_Mobile_Robots"]}