{"id":"317703960_EHAUPM_Efficient_High_Average-Utility_Pattern_Mining_with_Tighter_Upper-Bounds","abstract":"High-utility itemset mining (HUIM) has become a popular data mining task, as it can reveal patterns having a high-utility, contrarily to frequent pattern mining (FIM), which focuses on discovering frequent patterns. High average-utility itemset mining (HAUIM) is a variation of HUIM that provides an alternative measure, called the average utility, to select patterns by considering both their utilities and lengths. In the last decades, several algorithms have been developed to mine high average-utility itemsets (HAUIs). But most of them consume large amounts of memory and have long execution times since they generally utilize the average-utility upper-bound (auub) model to overestimate the average-utilities of itemsets. To improve the performance of HAUIM, this paper proposes two novel tighter upper-bound models as alternative to the traditional auub model for mining HAUIs. The looser upper-bound model (lub) considers the remaining-maximum utility in transactions to reduce the upper-bound on the utilities of itemsets. The second upper-bound (rtub) model ignores irrelevant items in transactions to further tighten the upper-bound. Three pruning strategies are also designed to reduce the search space for mining HAUIs by a greater amount, compared to the state-of-the-art HAUI-Miner algorithm. Experiments conducted on several benchmark datasets show that the designed algorithm integrating the two novel upper-bound models outperforms the traditional HAUI-Miner algorithm in terms of runtime, memory usage, number of join operations, and scalability.","authors":["Chun-Wei Jerry Lin","Shifeng Ren","Philippe Fournier Viger","Tzung-Pei Hong"],"meta":["June 2017IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2017.2717438"],"references":["313476858_A_Survey_of_Sequential_Pattern_Mining","307587257_The_SPMF_Open-Source_Data_Mining_Library_Version_2","304480191_EFIM-Closed_Fast_and_Memory_Efficient_Discovery_of_Closed_High-Utility_Itemsets","300141470_EFIM_A_Highly_Efficient_Algorithm_for_High-Utility_Itemset_Mining","319393723_Fast_algorithms_for_mining_association_rules","308599135_Efficient_Mining_of_High-Utility_Itemsets_Using_Multiple_Minimum_Utility_Thresholds","304480278_Efficient_Mining_of_High_Average-Utility_Itemsets_with_Multiple_Minimum_Thresholds","301930535_A_New_Method_for_Mining_High_Average_Utility_Itemsets","301338511_An_efficient_algorithm_to_mine_high_average-utility_itemsets","300896060_Mining_High_Utility_Itemsets_in_Big_Data"]}