{"id":"317777374_The_Use_of_Cronbach's_Alpha_When_Developing_and_Reporting_Research_Instruments_in_Science_Education","abstract":"Cronbach’s alpha is a statistic commonly quoted by authors to demonstrate that tests and scales that have been constructed or adopted for research projects are fit for purpose. Cronbach’s alpha is regularly adopted in studies in science education: it was referred to in 69 different papers published in 4 leading science education journals in a single year (2015)—usually as a measure of reliability. This article explores how this statistic is used in reporting science education research and what it represents. Authors often cite alpha values with little commentary to explain why they feel this statistic is relevant and seldom interpret the result for readers beyond citing an arbitrary threshold for an acceptable value. Those authors who do offer readers qualitative descriptors interpreting alpha values adopt a diverse and seemingly arbitrary terminology. More seriously, illustrative examples from the science education literature demonstrate that alpha may be acceptable even when there are recognised problems with the scales concerned. Alpha is also sometimes inappropriately used to claim an instrument is unidimensional. It is argued that a high value of alpha offers limited evidence of the reliability of a research instrument, and that indeed a very high value may actually be undesirable when developing a test of scientific knowledge or understanding. Guidance is offered to authors reporting, and readers evaluating, studies that present Cronbach’s alpha statistic as evidence of instrument quality.","authors":["Keith Taber"],"meta":["December 2018Research in Science Education 48(1):1-24","DOI:10.1007/s11165-016-9602-2"],"references":["282219752_Relationships_between_High_School_Chemistry_Students'_Perceptions_of_a_Constructivist_Learning_Environment_and_their_STEM_Career_Expectations","281458326_Exploration_of_Korean_Students'_Scientific_Imagination_Using_the_Scientific_Imagination_Inventory","281003503_Global_Patterns_in_Students'_Views_of_Science_and_Interest_in_Science","279070955_Science_Teachers'_Views_and_Stereotypes_of_Religion_Scientists_and_Scientific_Research_A_call_for_scientist-science_teacher_partnerships_to_promote_inquiry-based_learning","278655672_Methodological_Issues_in_Science_Education_Research_A_Perspective_from_the_Philosophy_of_Science","316799068_Modelling_Learners_and_Learning_in_Science_Education","285384835_Knowledge_and_Attitudes_Towards_Biotechnology_of_Elementary_Education_Preservice_Teachers_The_first_Spanish_experience","281108881_Preservice_Teachers_Developing_Coherent_Inquiry_Investigations_in_Elementary_Astronomy","277974739_The_Learning_Benefits_of_Being_Willing_and_Able_to_Engage_in_Scientific_Argumentation","277973614_The_Effects_of_Prior-knowledge_and_Online_Learning_Approaches_on_Students'_Inquiry_and_Argumentation_Abilities"]}