{"id":"317731111_Choosing_and_generating_parameters_for_low_level_pairing_implementation_on_BN_curves","abstract":"Because pairings have many applications, many hardware and software pairing implementations can be found in the literature. However, the parameters generally used have been invalidated by the recent results on the discrete logarithm problem over pairing friendly elliptic curves (Kim and Barbulescu in CRYPTO 2016, volume 9814 of lecture notes in computer science, Springer, Berlin, pp 543–571, 2016). New parameters must be generated to insure enough security in pairing based protocols. More generally it could be useful to generate nice pairing parameters in many real-world applications (specific security level, resistance to specific attacks on a protocol, database of curves). The main purpose of this paper is to describe explicitly and exhaustively what should be done to generate the best possible parameters and to make the best choices depending on the implementation context (in terms of pairing algorithm, ways to build the tower field, \\(\\mathbb {F}_{p^{12}}\\) arithmetic, groups involved and their generators, system of coordinates). We focus on low level implementations, assuming that \\(\\mathbb {F}_p\\) additions have a significant cost compared to other \\(\\mathbb {F}_p\\) operations. However, our results are still valid if \\(\\mathbb {F}_p\\) additions can be neglected. We also explain why the best choice for the polynomials defining the tower field \\(\\mathbb {F}_{p^{12}}\\) is only dependent on the value of the BN parameter u mod small integers (like 12 for instance) as a nice application of old elementary arithmetic results. This should allow a faster generation of this parameter. Moreover, we use this opportunity to give some new slight improvements on \\(\\mathbb {F}_{p^{12}}\\) arithmetic (in a pairing context).","authors":["Sylvain Duquesne","Nadia El Mrabet","Safia Haloui","Franck Rondepierre"],"meta":["March 2018Applicable Algebra in Engineering Communication and Computing 29(1)","DOI:10.1007/s00200-017-0334-y","Project: SIMPATIC"],"references":["291099419_Efficient_Pairings_and_ECC_for_Embedded_Systems","283532918_Subgroup_Security_in_Pairing-Based_Cryptography","262287726_Speeding_Up_Ate_Pairing_Computation_in_Affine_Coordinates","318398771_Challenges_with_Assessing_the_Impact_of_NFS_Advances_on_the_Security_of_Pairing-Based_Cryptography","312628094_Efficient_algorithms_for_pairing-based_cryptosystems","305472588_Extended_Tower_Number_Field_Sieve_A_New_Complexity_for_the_Medium_Prime_Case","300407660_Memory-saving_computation_of_the_pairing_final_exponentiation_on_BN_curves","288952811_Identity-based_encryption_from_the_Weil_pairing_extended_abstract","284307866_A_New_Index_Calculus_Algorithm_with_Complexity_L14o1_in_Small_Characteristic","266860952_Faster_Hashing_to_mathbb_G_2"]}