{"id":"317751620_On_tree-preserving_constraints","abstract":"The study of tractable subclasses of constraint satisfaction problems is a central topic in constraint solving. Tree convex constraints are extensions of the well-known row convex constraints. Just like the latter, every path-consistent tree convex constraint network is globally consistent. However, it is NP-complete to decide whether a tree convex constraint network has solutions. This paper studies and compares three subclasses of tree convex constraints, which are called chain-, path-, and tree-preserving constraints respectively. The class of tree-preserving constraints strictly contains the subclasses of path-preserving and arc-consistent chain-preserving constraints. We prove that, when enforcing strong path-consistency on a tree-preserving constraint network, in each step, the network remains tree-preserving. This ensures the global consistency of consistent tree-preserving networks after enforcing strong path-consistency, and also guarantees the applicability of the partial path-consistency algorithms to tree-preserving constraint networks, which is usually much more efficient than the path-consistency algorithms for large sparse constraint networks. As an application, we show that the class of tree-preserving constraints is useful in solving the scene labelling problem.","authors":["Shufeng Kong","Sanjiang Li","Yongming li","Zhiguo Long"],"meta":["December 2017Annals of Mathematics and Artificial Intelligence 81(3-4):1-31","DOI:10.1007/s10472-017-9552-z"],"references":["280534345_On_Tree-Preserving_Constraints","277557390_On_Broken_Triangles","222630004_Constraints_consistency_and_closure","313882256_A_Deterministic_Distributed_Algorithm_for_Reasoning_with_Connected_Row-Convex_Constraints","286195972_Constraint_Processing","262290721_The_complexity_of_recognizing_polyhedral_scenes","256660085_Qualitative_constraint_satisfaction_problems_An_extended_framework_with_landmarks","242636505_Impossible_Objects_as_nonsense_sentences","223536598_Temporal_Constraint_Networks","222466159_From_local_to_global_consistency","221633061_Path_Consistency_by_Dual_Consistency","221604593_Conservative_Dual_Consistency","222444557_Consistency_in_Networks_of_Relations","222432695_Theoretical_Analysis_of_Singleton_Arc_Consistency_and_Its_Extensions","221605643_Tractable_Tree_Convex_Constraint_Networks"]}