{"id":"317783337_Evolutionary_Fuzzy_Rule-Based_Methods_for_Monotonic_Classification","abstract":"In data science applications, it is very often to require predictive models satisfying monotonicity with respect to the explanatory variables involved in the dataset. In ordinal classification or regression, this occurs when the output variable or class label should not decrease when input variables increase, or vice versa. This problem is commonly known as monotonic classification and most existing classification techniques are not able to manage this kind of constraints or they require first to monotonize the data. In the literature, the monotonicity has been considered in linguistic fuzzy models, fuzzy-inference methods and fuzzy rule-based control systems. However, to the best of our knowledge, there is no fuzzy rule-based system designed to produce monotonic fuzzy rule-based models for classification problems. In this paper, we propose to incorporate some mechanisms based on monotonicity indexes for addressing such problems in two popular and competitive evolutionary fuzzy systems algorithms for classification and regression tasks: FARC-HD and FSMOGFS $^{e}$ +TUN $^{e}$ . In addition, the proposals are able to handle any kind of classification dataset without the necessity of preprocessing. The quality of our approaches is analyzed using statistical analysis and comparing with well-known monotonic classifiers.","authors":["Jesus Alcala-Fdez","Rafael Alcala","Sergio Vázquez González","Yusuke NOJIMA"],"meta":["June 2017IEEE Transactions on Fuzzy Systems 25(6):1376-1390","DOI:10.1109/TFUZZ.2017.2718491"],"references":["293013478_Hyperrectangles_Selection_for_Monotonic_Classification_by_Using_Evolutionary_Algorithms","280245851_Ordinal_Regression_Methods_Survey_and_Experimental_Study","279556630_Do_we_Need_Hundreds_of_Classifiers_to_Solve_Real_World_Classification_Problems","297481405_A_2-tuple_fuzzy_linguistic_representation_model_for_computing_with_words","296850013_Data_Preprocessing_in_Data_Mining","286585729_A_new_monotonicity_index_for_fuzzy_rule-based_systems","284026466_Generating_fuzzy_rules_by_learning_from_examples","283472894_Monotonic_Random_Forest_with_an_Ensemble_Pruning_Mechanism_based_on_the_Degree_of_Monotonicity","282907140_Enhancing_Multiclass_Classification_in_FARC-HD_Fuzzy_Classifier_On_the_Synergy_Between_n-Dimensional_Overlap_Functions_and_Decomposition_Strategies","281089751_Fundamentals_of_Machine_Learning_for_Predictive_Data_Analytics_Algorithms_Worked_Examples_and_Case_Studies"]}