{"id":"317841623_The_Collegial_Phenomenon_The_Social_Mechanisms_of_Cooperation_among_Peers_in_a_Corporate_Law_Partnership","abstract":"Organizations performing non-routine, innovative, often knowledge- intensive tasks - for example professional partnerships - need a rather flat, collegial, and non - bureaucratic structure. This book examines cooperation among partners in a US corporate law firm and provides a grounded theory of collective action among rival peers, or collegiality. It is first network study of such a frim. Members (partners and associates) are portrayed as independent entrepreneurs who build social niches in their organization and cultivate status competition among themselves. This behaviour allows them to fulfil their commitment to an extremely constraining partnership agreement and generates informal social mechanisms (bounded solidarity, lateral control, oligarchic regualtion) that help a flat organization govern itself: maintain individual performance, even for tenured partners; capitalize knowledge and control quality; monitor and sanction opportunistic free-riding; solve the 'too many chefs' problem; balance the powers of rainmakers and schedulers; and integrate the firm in spite of many centrifugal forces.\n\nThese mechanisms and the solutions they provide are examined using a broadly-conceived structural approach combining theory-driven network analysis, ethnography of task forces performing knowledge-intensive work, and analysis of management and internal politics in the firm. Emmanuel Lazega presents a theory of the collegial organization which generalizes its results to all kinds of partnerships, larger multinational professional services firms, and collegial pockets in flattening bureaucracies alike.","authors":["Michel Grossetti","Emmanuel Lazega"],"meta":["January 2003Revue Française de Sociologie 44(1):186","DOI:10.2307/3323128"],"references":["302145887_A_Theory_of_Collegiality_and_its_Relevance_for_Understanding_Professions_and_knowledge-intensive_Organizations","352002752_The_Development_and_Application_of_Sociological_Neoinstitutionalism_2002","330691646_Getting_a_Job_A_Study_of_Contacts_and_Careers","328274219_Globalization_and_its_limits_The_Making_of_International_Regulation","316379353_Private_Interest_Government_Beyond_Market_and_State","291759130_Building_up_an_asset_management_industry_Forays_of_an_anglo-saxon_logic_into_the_French_business_system","287428124_Social_Movements_and_Networks_Relational_Approaches_to_Collective_Action","284389044_Exploration_and_Exploitation_in_Organizational_Learning","283407645_Managing_entrepreneurial_legal_services_The_transformation_of_small-firm_practice","282747852_Institutional_logics_and_the_historical_contingency_of_power_in_organizations_Executive_succession_in_the_higher_education_publishing_industry_1958-1990"]}