{"id":"317889528_Analysis_of_cable_structures_through_energy_minimization","abstract":"In structural mechanics, traditional analyses methods usually employ matrix operations for obtaining displacement and internal forces of the structure under the external effects, such as distributed loads, earthquake or wind excitations, and temperature changing inter alia. These matrices are derived from the well-known principle of mechanics called minimum potential energy. According to this principle, a system can be in the equilibrium state only in case when the total potential energy of system is minimum. A close examination of the expression of the well-known equilibrium condition for linear problems, P=KΔ, where P is the load vector, K is the stiffness matrix and Δ is the displacement vector, it is seen that, basically this principle searches the displacement set (or deformed shape) for a system that minimizes the total potential energy of it. Instead of using mathematical operations used in the conventional methods, with a different formulation, meta-heuristic algorithms can also be used for solving this minimization problem by defining total potential energy as objective function and displacements as design variables. Based on this idea the technique called Total Potential Optimization using Meta-heuristic Algorithms (TPO/MA) is proposed. The method has been successfully applied for linear and non-linear analyses of trusses and truss-like structures, and the results have shown that the approach is much more successful than conventional methods, especially for analyses of nonlinear systems. In this study, the application of TPO/MA, with Harmony Search as the selected meta-heuristic algorithm, to cables net system is presented. The results have shown that the method is robust, powerful and accurate.","authors":["Y. Cengiz Toklu","Gebrail Bekdas","Rasim Temur"],"meta":["June 2017Structural Engineering & Mechanics 62(6):749-758","DOI:10.12989/sem.2017.62.6.749","Project: Design and analysis of nonlinear structural systems"],"references":["307640169_Seismic_Passive_Control_of_Cable-Stayed_Bridges","287550911_Analysis_of_structures_by_total_potential_optimization_using_meta-heuristic_algorithms_TPOMA","271373885_Geometrically_Nonlinear_Analysis_of_Trusses_Using_Particle_Swarm_Optimization","268322997_THREE-DIMENSIONAL_ANALYSIS_OF_GEOGRID_REINFORCEMENT_USED_IN_PILE-SUPPORTED_EMBANKMENTS","313551295_On_the_non-linear_analysis_of_pre-tensioned_cable_net_structures","285063435_Theoretical_Analysis_of_Suspension_Roofs","285063364_Three-Dimensional_Suspension_Structures","284688398_Nonlinear_Analysis_of_Cable_and_Truss_Structures","279722530_Design_Analysis_of_Cable_Networks","266298106_Nonlinear_analysis_of_cable_systems_with_point_based_iterative_procedure"]}