{"id":"317825628_A_multi-resolution_HEALPix_data_structure_for_spherically_mapped_point_data","abstract":"Data describing entities with locations that are points on a sphere are described as spherically mapped. Several data structures designed for spherically mapped data have been developed. One of them, known as Hierarchical Equal Area iso-Latitude Pixelization (HEALPix), partitions the sphere into twelve diamond-shaped equal-area base cells and then recursively subdivides each cell into four diamond-shaped subcells, continuing to the desired level of resolution. Twelve quadtrees, one associated with each base cell, store the data records associated with that cell and its subcells.\nHEALPix has been used successfully for numerous applications, notably including cosmic microwave background data analysis. However, for applications involving sparse point data HEALPix has possible drawbacks, including inefficient memory utilization, overwriting of proximate points, and return of spurious points for certain queries.\nA multi-resolution variant of HEALPix specifically optimized for sparse point data was developed. The new data structure allows different areas of the sphere to be subdivided at different levels of resolution. It combines HEALPix positive features with the advantages of multi-resolution, including reduced memory requirements and improved query performance.\nAn implementation of the new Multi-Resolution HEALPix (MRH) data structure was tested using spherically mapped data from four different scientific applications (warhead fragmentation trajectories, weather station locations, galaxy locations, and synthetic locations). Four types of range queries were applied to each data structure for each dataset. Compared to HEALPix, MRH used two to four orders of magnitude less memory for the same data, and on average its queries executed 72% faster.","authors":["Robert W. Youngren","Mikel D. Petty"],"meta":["June 2017Heliyon 3(6):e00332","DOI:10.1016/j.heliyon.2017.e00332"],"references":["312303439_Automatic_Ground_Surface_Reconstruction_from_mobile_laser_systems_for_driving_simulation_engines","311162225_Fractal_Video_Coding_Using_Fast_Normalized_Covariance_Based_Similarity_Measure","276210891_Hierarchical_progressive_surveys_Multi-resolution_HEALPix_data_structures_for_astronomical_images_catalogues_and_3-dimensional_data_cubes","259897114_Spherical_Terrain_Rendering_using_the_hierarchical_HEALPix_grid","258385865_Aggregate_Queries_in_Wireless_Sensor_Networks","309561534_Multi-resolution_modeling_based_on_quotient_space_and_DEVS","283056678_Sampling_and_Variance_Analysis_for_Monte_Carlo_Integration_in_Spherical_Domain","271512871_Gauss--Legendre_Sky_Pixelization_GLESP_for_CMB_maps","264931499_Computational_Geometry_and_Computer_Graphics_in_C","262316697_Rendering_and_managing_spherical_data_with_sphere_quadtrees"]}