{"id":"317824548_Towards_Device-Independent_Information_Processing_on_General_Quantum_Networks","abstract":"The violation of certain Bell inequalities allows for device-independent information processing secure against non-signalling eavesdroppers. However, this only holds for the Bell network, in which two or more agents perform local measurements on a single shared source of entanglement. To overcome the practical constraint that entangled systems can only be transmitted over relatively short distances, large-scale multi-source networks---in which entanglement is swapped between intermediate nodes---have been employed. Yet, to use Bell inequality violation to establish secure device-independent protocols between distant agents in such multi-source networks, the outcomes of intermediate entanglement swapping measurements must be post-selected---impeding the rate at which security can be established. Moreover, having multiple intermediate nodes in the network opens the door for generalised eavesdropping attacks not seen in the Bell network. Do there exist analogues of Bell inequalities for such multi-source networks whose violation is a resource for device-independent information processing without the need for post-selection? Recently, polynomial inequalities on the correlations classically achievable in multi-source networks have been derived. In this paper, the violation of these polynomial inequalities will be shown to allow for device-independent information processing without the need to condition on intermediate agents' outcomes. Moreover, their violation can prevent generalised eavesdropper attacks.","authors":["Ciaran Lee","Matty J. Hoban"],"meta":["June 2017Physical Review Letters 120(2)","DOI:10.1103/PhysRevLett.120.020504"],"references":["316821089_Experimental_bilocality_violation_without_shared_reference_frames","316617642_Realistic_parameter_regimes_for_a_single_sequential_quantum_repeater","316489767_Fundamental_limits_of_repeaterless_quantum_communications","315956526_Causal_Inference_via_Algebraic_Geometry_Feasibility_Tests_for_Functional_Causal_Structures_with_Two_Binary_Observed_Variables","314092296_Maximal_violation_of_n-locality_inequalities_in_a_star-shaped_quantum_network","313796867_Multiplexed_entanglement_generation_over_quantum_networks_using_multi-qubit_nodes","313672426_Correlations_in_star_networks_From_Bell_inequalities_to_network_inequalities","313157464_Quantum_Correlations_between_Single_Telecom_Photons_and_a_Multimode_On-Demand_Solid-State_Quantum_Memory","329654602_Causation_Prediction_and_Search","318091190_Satellite-Based_Entanglement_Distribution_Over_1200_kilometers"]}