{"id":"317802639_Annotating_Medical_Image_Data","abstract":"This chapter describes the annotation of the medical image data that were used in the VISCERAL project. Annotation of regions in the 3D images is non-trivial, and tools need to be chosen to limit the manual work and have semi-automated annotation available. For this, several tools that were available free of charge or with limited costs were tested and compared. The GeoS tool was finally chosen for the annotation based on the detailed analysis, allowing for efficient and effective annotations. 3D slice was chosen for smaller structures with low contrast to complement the annotations. A detailed quality control was also installed, including an automatic tool that attributes organs to annotate and volumes to specific annotators, and then compares results. This allowed to judge the confidence in specific annotators and also to iteratively refine the annotation instructions to limit the subjectivity of the task as much as possible. For several structures, some subjectivity remains and this was measured via double annotations of the structure. This allows the judgement of the quality of automatic segmentations.","authors":["Katharina Grünberg","Oscar Jimenez-del-Toro","András Jakab","Georg Langs"],"meta":["May 2017","DOI:10.1007/978-3-319-49644-3_4","In book: Cloud-Based Benchmarking of Medical Image Analysis (pp.45-67)","Projects: VISCERALVisceral"],"references":["306123101_VISCERAL_Towards_large_data_in_medical_imaging-Challenges_and_directions","260058195_Bringing_the_Algorithms_to_the_Data_Cloud-Based_Benchmarking_for_Medical_Image_Analysis","258191431_VISCERAL_Towards_Large_Data_in_Medical_Imaging_-_Challenges_and_Directions","224756225_3D_slicer","221304156_GeoS_Geodesic_Image_Segmentation","303890490_Cloud-Based_Evaluation_of_Anatomical_Structure_Segmentation_and_Landmark_Detection_Algorithms_VISCERAL_Anatomy_Benchmarks","284400357_Measures_of_the_Amount_of_Ecologic_Association_Between_Species","261482140_MammoApplet_An_interactive_Java_applet_tool_for_manual_annotation_in_medical_imaging","261301652_Annio_A_Web-Based_Tool_for_Annotating_Medical_Images_with_Ontologies","238720710_Dice_LR_Measures_of_the_Amount_of_Ecologic_Association_Between_Species_Ecology_263_297-302"]}