{"id":"317851928_A_mobilidade_internacional_academica_caracteristicas_dos_percursos_de_pesquisadores_brasileiros","abstract":"Resumo Este artigo aborda o tema da internacionalização acadêmica, discutindo o movimento seguido por estudantes, professores e pesquisadores em direção a instituições universitárias e de pesquisa no exterior, com excepcional competência técnica e infraestrutura de qualidade para a formação pós-graduada e treinamento em pesquisa. São analisados os resultados de um estudo efetuado sobre bolsistas brasileiros da Capes e CNPq, em Ciência da Computação, Física/Astronomia e Economia, para a realização de doutorado pleno, doutorado sanduíche e pós-doutorado nos Estados Unidos, França e Grã-Bretanha, entre 1996 e 2007. Ressaltam-se as evidências de que o Brasil não sofre substantivas perdas de talentos científicos para o exterior, uma vez que o movimento predominante é de circulação, com o retorno ao país após a consecução das atividades propostas. A despeito de os destinos serem ambientes que favorecem o contato com formas diversas de produção do conhecimento, além de propiciarem a familiaridade com outros aspectos relacionados à prática de pesquisa, o local de atuação no Brasil, após o regresso, praticamente não difere em relação ao padrão nacional, compreendendo-se o das instituições propriamente acadêmicas.","authors":["Maria Luiza de Santana Lombas"],"meta":["January 2017Sociologias 19(44):308-333","DOI:10.1590/15174522-019004413"],"references":["319290940_Fuga_de_cerebros_movilidad_academica_y_redes_cientificas","259596527_What_drives_researchers_'careers_The_role_of_international_mobility_gender_and_family","242405649_Research_Issues_in_the_International_Migration_of_Highly_Skilled_Workers_A_Perspective_with_Data_from_the_United_States","237074186_Nacionalismo_vs_Internacionalismo_en_las_politicas_de_formacion_de_recursos_humanos_de_alto_niv","237073967_A_pos-graduacao_no_Brasil_novos_desafios_para_uma_politica_bem-_sucedida","232747220_A_diaspora_cientifica_brasileira_perspectivas_para_sua_articulacao_em_favor_da_ciencia_brasileira","292475576_English_-_The_'Latin'_of_globalization_Challenges_for_the_higher_education","253871598_Constraints_Into_Preferences_Gender_Status_and_Emerging_Career_Aspirations","246772775_Massification_Internationalization_and_globalization","236894838_The_New_Production_of_Knowledge_the_Dynamics_of_Science_and_Research_in_Contemporary_Societies"]}