{"id":"317848026_Effects_of_SubstanceDrug_Abuse_on_the_Academic_Achievement_of_Secondary_School_Students_in_Mkar_Metropolis_Gboko_Benue_State","abstract":"This study is cross-sectional descriptive survey which was carried out to find out the effect of substance/drug abuse on the academic achievement of secondary school students in Mkar metropolis, Mkar, Gboko, Benue State. A sample size of 220 secondary school students was selected using simple random sampling technique after the schools were purposively selected for the study. 220 questionnaires were distributed as method of data collection, collected back and analysed. Findings revealed that most students, 118 (53.6%) are between the age of 15 and 19 years. 203 (92.3%) of the respondents are Tiv. 98 (44.5%) were of the opinion that these abused substance/drugs are always available. Findings also revealed that 49 (22.3%) abuse Amphetamines like Tramol, Tramadol or Tradyl. 50 (22.7%). The research also shows that poor academic performance is one of the effects of this substance /drugs on the student. Other effects includes truancy and decreasing their ability to concentrate.70 (31.8%) of respondents believed instituting early detection programs in school will be a great preventive strategy or solution to reducing the rate of these substance/drug abuse. Recommendations were made which include Substance/Drug free clubs should be established in secondary schools, Counselling education should be introduced in secondary schools and it should involve parents/guardians, designing curricula on drug education, etc. Emphasis should be placed on health education as this will help families in planning the academic future of their children, the family and nation as a whole.","authors":["Emmanuel Okechukwu Chukwu","Valentine Terhemba Pius","Terna Mesuur Fiase","Haruna Habu"],"meta":["January 2017International Journal of Psychological and Brain Sciences 2(2 2):40-45","DOI:10.11648/j.ijpbs.20170202.12","Projects: Effects of Substance/Drug Abuse on the Academic  Achievement of Secondary School Students in Mkar  Metropolis, Gboko, Benue StateAwareness, Perception and Implementation of Focus Antenatal Care  (FANC) among Health Care Providers Working in Mother Care  Clinics and Hospitals in Benue State, Nigeria"],"references":["321201739_Effects_of_Drug_Abuse_on_Academic_Performance_of_Technology_Education_Students_in_Nigerian_Public_Universities","298332872_Sociological_Factors_To_Drug_Abuse_And_The_Effects_On_Secondary_School_Students_Academic_Performance_In_Ekiti_And_Ondo_States_Nigeria","279625334_Alcohol_use_in_a_sub-group_of_literate_Nigerians","227358110_The_Effects_of_Alcohol_Use_on_Academic_Achievement_in_High_School"]}