{"id":"317841640_Multi-phase_simultaneous_segmentation_of_tumor_in_lung_4D-CT_data_with_context_information","abstract":"Lung 4D computed tomography (4D-CT) plays an important role in high-precision radiotherapy because it characterizes respiratory motion, which is crucial for accurate target definition. However, the manual segmentation of a lung tumor is a heavy workload for doctors because of the large number of lung 4D-CT data slices. Meanwhile, tumor segmentation is still a notoriously challenging problem in computer-aided diagnosis. In this paper, we propose a new method based on an improved graph cut algorithm with context information constraint to find a convenient and robust approach of lung 4D-CT tumor segmentation. We combine all phases of the lung 4D-CT into a global graph, and construct a global energy function accordingly. The sub-graph is first constructed for each phase. A context cost term is enforced to achieve segmentation results in every phase by adding a context constraint between neighboring phases. A global energy function is finally constructed by combining all cost terms. The optimization is achieved by solving a max-flow/min-cut problem, which leads to simultaneous and robust segmentation of the tumor in all the lung 4D-CT phases. The effectiveness of our approach is validated through experiments on 10 different lung 4D-CT cases. The comparison with the graph cut without context constraint, the level set method and the graph cut with star shape prior demonstrates that the proposed method obtains more accurate and robust segmentation results.","authors":["Zhengwen Shen","Huafeng Wang","Weiwen Xi","Xiaogang Deng"],"meta":["June 2017PLoS ONE 12(6)","DOI:10.1371/journal.pone.0178411"],"references":["271219162_Automatic_Lung_Tumor_Segmentation_with_Leaks_Removal_in_Follow-up_CT_Studies","252688268_Lung_tumours_segmentation_on_CT_using_sparse_field_active_model","244898935_Graph_Cuts_and_Efficient_ND_Image_Segmentation","282877024_Random_Walk_and_Graph_Cut_for_Co-Segmentation_of_Lung_Tumor_on_PET-CT_Images","274706922_Globally_Optimal_Co-Segmentation_of_Three-dimensional_Pulmonary_1H_and_Hyperpolarized_3He_MRI_with_Spatial_Consistence_Prior","261043949_A_new_approach_to_model_based_active_contours_in_lung_tumor_segmentation_in_3D_CT_image_data","257601908_Prior_knowledge_enhanced_random_walk_for_lung_tumor_segmentation_from_low-contrast_CT_images","252482398_Interactive_Graph_Cuts_for_Optimal_Boundary_Region_Segmentation_of_Objects_in_N-D_Images","248383425_Joint_segmentation_of_anatomical_and_functional_images_applications_in_quantification_of_lesions_from_PET_PET-CT_MRI-PET_and_MRI-PET-CT_images","243773059_Efficient_Approximate_Energy_Minimization_via_Graph_Cuts"]}