{"id":"317827358_Balanced_Quantization_An_Effective_and_Efficient_Approach_to_Quantized_Neural_Networks","abstract":"Quantized Neural Networks (QNNs), which use low bitwidth numbers for representing parameters and performing computations, have been proposed to reduce the computation complexity, storage size and memory usage. In QNNs, parameters and activations are uniformly quantized, such that the multiplications and additions can be accelerated by bitwise operations. However, distributions of parameters in Neural Networks are often imbalanced, such that the uniform quantization determined from extremal values may under utilize available bitwidth. In this paper, we propose a novel quantization method that can ensure the balance of distributions of quantized values. Our method first recursively partitions the parameters by percentiles into balanced bins, and then applies uniform quantization. We also introduce computationally cheaper approximations of percentiles to reduce the computation overhead introduced. Overall, our method improves the prediction accuracies of QNNs without introducing extra computation during inference, has negligible impact on training speed, and is applicable to both Convolutional Neural Networks and Recurrent Neural Networks. Experiments on standard datasets including ImageNet and Penn Treebank confirm the effectiveness of our method. On ImageNet, the top-5 error rate of our 4-bit quantized GoogLeNet model is 12.7\\%, which is superior to the state-of-the-arts of QNNs.","authors":["Shuchang Zhou","Yuzhi Wang","He Wen","Qinyao He"],"meta":["June 2017Journal of Computer Science and Technology 32(4)","DOI:10.1007/s11390-017-1750-y"],"references":["319770465_Sequence_to_Sequence_Learning_with_Neural_Networks","319770430_Rich_feature_hierarchies_for_accurate_object_detection_and_semantic_segmentation","319770414_Identity_Mappings_in_Deep_Residual_Networks","319770367_Exploiting_Linear_Structure_Within_Convolutional_Networks_for_Efficient_Evaluation","319770334_Deep_Compression_Compressing_Deep_Neural_Networks_with_Pruning_Trained_Quantization_and_Huffman_Coding","319770184_Speech_Recognition_With_Deep_Recurrent_Neural_Networks","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","319770111_Improving_the_speed_of_neural_networks_on_CPUs","313218004_Color_image_quantization_for_frame_buffer_display","312727767_Going_deeper_with_convolutions"]}