{"id":"317821828_Explanation_in_Artificial_Intelligence_Insights_from_the_Social_Sciences","abstract":"There has been a recent resurgence in the area of explainable artificial intelligence as researchers and practitioners seek to provide more transparency to their algorithms. Much of this research is focused on explicitly explaining decisions or actions to a human observer, and it should not be controversial to say that, if these techniques are to succeed, the explanations they generate should have a structure that humans accept. However, it is fair to say that most work in explainable artificial intelligence uses only the researchers' intuition of what constitutes a `good' explanation. There exists vast and valuable bodies of research in philosophy, psychology, and cognitive science of how people define, generate, select, evaluate, and present explanations. This paper argues that the field of explainable artificial intelligence should build on this existing research, and reviews relevant papers from philosophy, cognitive psychology/science, and social psychology, which study these topics. It draws out some important findings, and discusses ways that these can be infused with work on explainable artificial intelligence.","authors":["Tim Miller"],"meta":["June 2017Artificial Intelligence 267","DOI:10.1016/j.artint.2018.07.007"],"references":["325528012_Combining_Planning_with_Gaze_for_Online_Human_Intention_Recognition","323561230_Human-level_explanatory_biases_for_person_re-identification","320462005_Eye-Tracking_Causality","318829787_The_Minds_of_Many_Opponent_Modeling_in_a_Stochastic_Game","317161416_Explaining_Explanation_Part_1_Theoretical_Foundations","329128843_Precis_of_from_bacteria_to_bach_and_back_The_evolution_of_minds","319393294_Logic_of_Scientific_Discovery","318829971_Plan_Explanations_as_Model_Reconciliation_Moving_Beyond_Explanation_as_Soliloquy","315788945_The_scope_of_formal_explanation","314579858_Argumentation-based_Normative_Practical_Reasoning"]}