{"id":"317873383_Assessing_Sustainability_of_Railway_Modernization_Projects_A_Case_Study_from_Romania","abstract":"Projects are important ‘instruments of change’ in realizing a more sustainable society. Sustainability in project management aims to integrate the concepts of sustainability into project management. In order to facilitate the consideration of sustainability aspects of projects, the SPM3 model provides a ‘snapshot’ on how the different variables of sustainability are considered in the management of a specific project.\nThis paper reports a case study into the consideration of sustainability in the project Modernization of KM614-Curtici Romanian Railway Network. The assessment showed that the project is primarily economically driven, but that environmental aspects are also proactively considered. The project focusses less on the social aspects.\nThe assessment also showed that the sustainability aspects of the project are mostly considered in relation to the project's deliverable. Less attention is given to the sustainability of the process. Regarding the level of consideration of sustainability, the participants of the study first of all indicate that a more proactive consideration of sustainability aspects is desired.\nThe participants also agreed that the assessment of the project with the SPM3 model provided a holistic analysis of the sustainability of the project that formed an essential step in the further development and improvement of the project.","authors":["Violeta Simionescu","A.J. Gilbert Silvius"],"meta":["December 2016Procedia Computer Science 100:458-465","DOI:10.1016/j.procs.2016.09.182"],"references":["291743973_Sustainability_integration_for_effective_project_management","265578425_The_Global_Competitiveness_Report_2000","347908965_Sustainability_in_Project_Management","309385015_Sustainable_development_and_urban_transportation_systems_planning_with_special_reference_to_Istanbul","291743827_How_Can_Sustainable_Development_Redefine_Project_Management_Processes","276212101_Using_project_management_as_a_way_to_sustainability_From_a_comprehensive_review_to_a_framework_definition","273698219_WHITE_PAPER_-_Roadmap_to_a_Single_European_Transport_Area_-_Towards_a_competitive_and_resource_efficient_transport_system","259138961_Single_European_Sky_and_Single_European_Railway_Area_A_System_Level_Analysis_of_Air_and_Rail_Transportation","225410058_Spatial_sustainability_and_the_tyranny_of_transport_A_causal_path_scenario_analysis","222552118_Efficiency_and_sustainability_indicators_for_passenger_and_commodities_transportation_systems_The_case_of_Siena_Italy"]}