{"id":"317818038_DERIVING_SKYLINE_POINTS_OVER_DYNAMIC_AND_INCOMPLETE_DATABASES","abstract":"The rapid growth of data is inevitable, and retrieving the best results that meet the user’s preferences is essential. To achieve this, skylines were introduced in which data items that are not dominated by the other data items in the database are retrieved as results (skylines). In most of the existing skyline approaches, the databases are assumed to be static and complete. However, in real world scenario, databases are not complete especially in multidimensional databases in which some dimensions may have missing values. The databases might also be dynamic in which new data items are inserted while existing data items are deleted or updated. Blindly performing pairwise comparisons on the whole data items after the changes are made is inappropriate as not all data items need to be compared in identifying the skylines. Thus, a novel skyline algorithm, DInSkyline, is proposed in this study which finds the most relevant data items in dynamic and incomplete databases. Several experiments have been conducted and the results show that DInSkyline outperforms the previous works by reducing the number of pairwise comparisons in the range of 52% to 73%.","authors":["Ghazaleh Babanejad","Hamidah Ibrahim","Nur Izura Udzir","Fatimah Si"],"meta":["April 2017","Conference: The 6th International Conference of Computing & InformaticsAt: Kuala Lumpur","Project: An Efficient Model for Processing Skyline Queries in Incomplete and Uncertain Databases"],"references":["271020482_Finding_Skyline_Points_over_Dynamic_Incomplete_Database","262300861_Estimating_Missing_Values_of_Skylines_in_Incomplete_database","221613248_SaLSa_Computing_the_skyline_without_scanning_the_whole_sky","221310231_Maximal_Vector_Computation_in_Large_Data_Sets","314819465_An_optimal_and_progressive_algorithm_for_skyline_queries","261860819_Finding_skylines_for_incomplete_data","221311261_Efficient_Processing_of_Top-k_Dominating_Queries_on_Multi-Dimensional_Data","221310438_Shooting_Stars_in_the_Sky_An_Online_Algorithm_for_Skyline_Queries","221310241_Efficient_Progressive_Skyline_Computation","221309985_Multi-objective_Query_Processing_for_Database_Systems"]}