{"id":"317802622_What_Do_Computer_Scientists_Tweet_Analyzing_the_Link-Sharing_Practice_on_Twitter","abstract":"Twitter communication has permeated every sphere of society. To highlight and share small pieces of information with possibly vast audiences or small circles of the interested has some value in almost any aspect of social life. But what is the value exactly for a scientific field? We perform a comprehensive study of computer scientists using Twitter and their tweeting behavior concerning the sharing of web links. Discerning the domains, hosts and individual web pages being tweeted and the differences between computer scientists and a Twitter sample enables us to look in depth at the Twitter-based information sharing practices of a scientific community. Additionally, we aim at providing a deeper understanding of the role and impact of altmetrics in computer science and give a glance at the publications mentioned on Twitter that are most relevant for the computer science community. Our results show a link sharing culture that concentrates more heavily on public and professional quality information than the Twitter sample does. The results also show a broad variety in linked sources and especially in linked publications with some publications clearly related to community-specific interests of computer scientists, while others with a strong relation to attention mechanisms in social media. This refers to the observation that Twitter is a hybrid form of social media between an information service and a social network service. Overall the computer scientists’ style of usage seems to be more on the information-oriented side and to some degree also on professional usage. Therefore, altmetrics are of considerable use in analyzing computer science.","authors":["Marco Schmitt","Robert Jäschke"],"meta":["June 2017PLoS ONE 12(6):e0179630","DOI:10.1371/journal.pone.0179630"],"references":["312772288_Who_Are_My_Audiences_A_Study_of_the_Evolution_of_Target_Audiences_in_Microblogs","306393937_The_Post-Embargo_Open_Access_Citation_Advantage_It_Exists_Probably_Its_Modest_Usually_and_the_Rich_Get_Richer_of_Course","294917288_Open_Access_Meets_Discoverability_Citations_to_Articles_Posted_to_Academiaedu","291992322_The_Tweets_They_are_A-Changin_evolution_of_twitter_users_and_behavior","316898285_Understanding_How_Twitter_is_Used_to_Spread_Scientific_Messages","313434749_Detection_of_User_Demographics_on_Social_Media_A_Review_of_Methods_and_Recommendations_for_Best_Practices","307902372_Comparing_the_pearson_and_spearman_correlation_coefficients_across_distributions_and_sample_sizes_A_tutorial_using_simulations_and_empirical_data","307822863_An_Overview_of_Microsoft_Academic_Service_MAS_and_Applications","303446289_Comparing_the_Pearson_and_Spearman_Correlation_Coefficients_Across_Distributions_and_Sample_Sizes_A_Tutorial_Using_Simulations_and_Empirical_Data","301417654_Information_Seeking_and_Responding_Networks_in_Physical_Gatherings"]}