{"id":"317937065_Fundamentos_de_la_investigacion_y_la_innovacion_educativa","abstract":"El objetivo principal de este manual es proporcionar a los estudiantes del área de educación (pedagogía, psicopedagogía, educación social y las distintas espe-cialidades de magisterio) una base de conocimientos que les permita diseñar y poner en marcha proyectos de investigación e innovación educativa. Es importante despertar en los profesionales de la educación un espíritu indagador y abierto a los cam-bios, ofreciéndoles los instrumentos necesarios para que sean capaces de diseñar proyectos y poner en marcha procesos de transformación y mejora de los centros educativos y las aulas. Se analizan diferentes diseños de investigación e in-novación, tanto de corte cuantitativo como cualita-tivo y aplicado, y se recogen una serie de metodolo-gías innovadoras de intervención en las aulas, como el aprendizaje basado en problemas o el fl ipped classroom. Todos los capítulos comienzan con un resumen y un listado de objetivos y concluyen planteando una serie de actividades, facilitando los procedimientos de análisis de información necesarios para saber si se han alcanzado los objetivos propuestos en cada proyecto.","authors":["Enrique Navarro Asencio","Eva Jiménez-García","Soledad Rappoport","Bianca Thoilliez Ruano"],"meta":["March 2017","Publisher: UNIR editorialEditor: Universidad Internacional de La RIojaISBN: 978-84-16602-55-1"],"references":["307766065_Com_aplicar_un_cluster_jerarquic_en_SPSS","299584811_Metodologias_Inductivas_El_desafio_de_ensenar_mediante_el_cuestionamiento_y_los_retos","286623776_La_investigacion_biografico-narrativa_en_educacion_Enfoque_y_metodologia","281098986_The_flipped_classroom_Como_convertir_la_escuela_en_un_espacio_de_aprendizaje","315176250_Metodologia_de_la_investigacion_social","304496314_Qualitative_research_and_evaluation_methods_London_Sage_Publications","289963712_Essentials_of_psychological_testing_4th_ed","288948072_Posturing_in_qualitative_enquiry","285728831_Introduccion_a_los_Metodos_Cualitativos_de_Investigacion","285013543_Criterios_de_credibilidad_en_la_investigacion_naturalista"]}