{"id":"317930590_The_Impact_of_Social_Curiosity_on_Information_Spreading_on_Networks","abstract":"Most information spreading models consider that all individuals are identical psychologically. They ignore, for instance, the curiosity level of people, which may indicate that they can be influenced to seek for information given their interest. For example, the game Pok\\'emon GO spread rapidly because of the aroused curiosity among users. This paper proposes an information propagation model considering the curiosity level of each individual, which is a dynamical parameter that evolves over time. We evaluate the efficiency of our model in contrast to traditional information propagation models, like SIR or IC, and perform analysis on different types of artificial and real-world networks, like Google+, Facebook, and the United States roads map. We present a mean-field approach that reproduces with a good accuracy the evolution of macroscopic quantities, such as the density of stiflers, for the system's behavior with the curiosity. We also obtain an analytical solution of the mean-field equations that allows to predicts a transition from a phase where the information remains confined to a small number of users to a phase where it spreads over a large fraction of the population. The results indicate that the curiosity increases the information spreading in all networks as compared with the spreading without curiosity, and that this increase is larger in spatial networks than in social networks. When the curiosity is taken into account, the maximum number of informed individuals is reached close to the transition point. Since curious people are more open to a new product, concepts, and ideas, this is an important factor to be considered in propagation modeling. Our results contribute to the understanding of the interplay between diffusion process and dynamical heterogeneous transmission in social networks.","authors":["Didier Augusto Vega-Oliveros","L. Berton","Federico Vazquez","Francisco A Rodrigues"],"meta":["June 2017","DOI:10.1145/3110025.3110039","Projects: Network science and applicationsRumor propagation on social networks"],"references":["337047185_Influence_maximization_by_rumor_spreading_on_correlated_networks_through_community_identification","313884051_Early_usage_of_Pokemon_Go_and_its_personality_correlates","311899572_Epidemic_processes_in_complex_networks","310810494_Detecting_misinformation_in_online_social_networks_before_it_is_too_late","308984241_Personality_Homophily_and_the_Local_Network_Characteristics_of_Facebook","308883692_Rumor_propagation_with_heterogeneous_transmission_in_social_networks","307680316_Frontiers_in_Applied_Dynamical_Systems_Reviews_and_Tutorials","283617653_Emergence_of_Scaling_in_Random_Networks","283617410_Emergence_of_Scaling_in_Random_Networks","283598027_Learning_to_discover_social_circles_in_ego_networks","283308052_Spreader_Selection_by_Community_to_Maximize_Information_Diffusion_in_Social_Networks","280100296_Influence_maximization_based_on_the_least_influential_spreaders","280566512_Networks_An_Introduction","264920260_Networks_An_Introduction","264708826_Epidemic_processes_in_complex_networks"]}