{"id":"317934321_A_Framework_for_Designing_the_Architectures_of_Deep_Convolutional_Neural_Networks","abstract":"Recent advances in Convolutional Neural Networks (CNNs) have obtained promising results in difficult deep learning tasks. However, the success of a CNN depends on finding an architecture to fit a given problem. A hand-crafted architecture is a challenging, time-consuming process that requires expert knowledge and effort, due to a large number of architectural design choices. In this article, we present an efficient framework that automatically designs a high-performing CNN architecture for a given problem. In this framework, we introduce a new optimization objective function that combines the error rate and the information learnt by a set of feature maps using deconvolutional networks (deconvnet). The new objective function allows the hyperparameters of the CNN architecture to be optimized in a way that enhances the performance by guiding the CNN through better visualization of learnt features via deconvnet. The actual optimization of the objective function is carried out via the Nelder-Mead Method (NMM). Further, our new objective function results in much faster convergence towards a better architecture. The proposed framework has the ability to explore a CNN architecture's numerous design choices in an efficient way and also allows effective, distributed execution and synchronization via web services. Empirically, we demonstrate that the CNN architecture designed with our approach outperforms several existing approaches in terms of its error rate. Our results are also competitive with state-of-the-art results on the MNIST dataset and perform reasonably against the state-of-the-art results on CIFAR-10 and CIFAR-100 datasets. Our approach has a significant role in increasing the depth, reducing the size of strides, and constraining some convolutional layers not followed by pooling layers in order to find a CNN architecture that produces a high recognition performance.","authors":["Saleh Albelwi","Ausif Mahmood"],"meta":["June 2017Entropy 19(6)","DOI:10.3390/e19060242"],"references":["314288067_Performance_and_Challenges_of_Service-Oriented_Architecture_for_Wireless_Sensor_Networks","340179374_Theano_A_CPU_and_GPU_Math_Compiler_in_Python","326109067_Hyperband_A_novel_bandit-based_approach_to_hyperparameter_optimization","319770360_Deeply-Supervised_Nets","319770291_Very_Deep_Convolutional_Networks_for_Large-Scale_Image_Recognition","319770264_Regularization_of_Neural_Networks_using_DropConnect","319770184_Speech_Recognition_With_Deep_Recurrent_Neural_Networks","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","318742463_Very_Deep_Convolutional_Networks_for_Text_Classification","314237511_Large-Scale_Evolution_of_Image_Classifiers"]}