{"id":"317967474_A_multihypothesis_set_approach_for_mobile_robot_localization_using_heterogeneous_measurements_provided_by_the_Internet_of_Things","abstract":"Mobile robot localization consists in estimation of robot pose by using real-time measurements. The Internet of Things (IoT) adds a new dimension to this process by enabling communications with smart objects at anytime and anywhere. Thus data used by localization process can come both from the robot on-board sensors and from environment objects, mobile or not, able to sense the robot. The paper considers localization problem as a nonlinear bounded-error estimation of the state vector whose components are the robot coordinates. The approach based on interval analysis is able to answer the constraints of IoT by easily taking account a heterogeneous set and a variable number of measurements. Bounded-error state estimation can be an alternative to other approaches, notably particle filtering which is sensible to non-consistent measures, large measure errors, and drift of robot evolution model. The theoretical formulation of the set-membership approach and the application to the estimation of the robot localization are addressed first. In order to meet more realistic conditions the way of reducing the effect of environment model inaccuracies, evolution model drift, outliers and disruptive events such as robot kidnapping is introduced. By integrating these additional treatments to the set-membership approach we propose a bounded-error estimator using multihypothesis tracking. Simulation results show the contribution of each step of the estimator. Real experiments focus on global localization and specific treatments for synchronizing measurements and processing outliers.","authors":["Etienne Colle","Simon Galerne"],"meta":["June 2017Robotics and Autonomous Systems 96","DOI:10.1016/j.robot.2017.05.016"],"references":["3299142_Set_membership_localization_of_mobile_robots_via_angle_measurements","281923243_Vehicle_Localization_from_Inaccurate_Telemetric_Data_A_Set-Inversion_Approach","264585676_Blanche-An_experiment_in_guidance_and_navigation_of_an_autonomous_mobile_Robot","261045738_AUV_Navigation_and_Localization_A_Review","257343606_Mobile_robot_localization_by_multiangulation_using_set_inversion","237715070_Limits_to_the_consistency_of_EKF-based_SLAM","223326684_Global_localization_for_mobile_robots_by_multiple_hypothesis_tracking","222559675_Robust_Monte_Carlo_Localization_for_Mobile_Robots","222552403_Robust_set_membership_state_estimation_Application_to_Underwater_Robotics","222266470_Set_inversion_via_interval_analysis_for_nonlinear_bounded-error_estimation","220122699_Real-time_Bounded-error_State_Estimation_for_Vehicle_Tracking"]}