{"id":"317930248_On_subtrees_of_the_representation_tree_in_rational_base_numeration_systems","abstract":"Every rational number p/q defines a rational base numeration system in which every integer has a unique finite representation, up to leading zeroes. This work is a contribution to the study of the set of the representations of integers. This prefix-closed subset of the free monoid is naturally represented as a highly non-regular tree. Its nodes are the integers, its edges bear labels taken in {0,1,...,p-1}, and its subtrees are all distinct. We associate with each subtree (or with its root n) three infinite words. The bottom word of n is the lexicographically smallest word that is the label of a branch of the subtree. The top word of n is defined similarly. The span-word of n is the digitwise difference between the latter and the former. First, we show that the set of all the span-words is accepted by an infinite automaton whose underlying graph is essentially the same as the tree itself. Second, we study the function that computes for all n the bottom word associated with n+1 from the one associated with n, and show that it is realised by an infinite sequential transducer whose underlying graph is once again essentially the same as the tree itself. An infinite word may be interpreted as an expansion in base p/q after the radix point, hence evaluated to a real number. If T is a subtree whose root is n, then the evaluations of the labels of the branches of T form an interval of $\\mathbb{R}$. The length of this interval is called the span of n and is equal to the evaluation of the span-word of n. The set of all spans is then a subset of R and we use the preceding construction to study its topological closure. We show that it is an interval when p is greater than or equal to 2q-1, and a Cantor set of measure zero otherwise.","authors":["Shigeki Akiyama","Victor Marsault","Jacques Sakarovitch"],"meta":["June 2017Discrete mathematics & theoretical computer science DMTCS 20(1)","Project: Rational base numeration systems"],"references":["317869142_Enumeration_et_numeration","301795829_The_signature_of_rational_languages","236955132_Auto-similarity_in_Rational_Base_Number_Systems","227310237_Numeration_Systems_on_a_Regular_Language","225408913_Powers_of_rationals_modulo_1_and_rational_base_number_systems","269024497_Infinite_Words_Automata_Semigroups_Logic_and_Games","265455313_Classical_Descriptive_Set_Theory","265436996_Algebraic_Combinatorics_on_Words","262486892_Fractal_Geometry_Mathematical_Foundations_and_Applications","238126147_An_unsolved_problem_on_the_powers_of_32","222562576_Abstract_numeration_systems","220695034_Elements_of_Automata_Theory"]}