{"id":"317957096_JOINT_LOAD_BALANCING_AND_INTERFERENCE_MITIGATION_IN_5G_HetNets","abstract":"We study the problem of joint load balancing (user association and user scheduling) and interference management (beamforming design and power allocation) in heterogeneous networks (HetNets) in which massive multiple-input multiple- output (MIMO) macro cell base station (BS) equipped with a large number of antennas, overlaid with wireless self-backhauled small cells (SCs) are assumed. Self-backhauled SC BSs with full- duplex communication employing regular antenna arrays serve both macro users and SC users by using the wireless backhaul from macro BS in the same frequency band. We formulate the joint load balancing and interference mitigation problem as a network utility maximization subject to wireless backhaul constraints. Subsequently, leveraging the framework of stochastic optimization, the problem is decoupled into dynamic scheduling of macro cell users, backhaul provisioning of SCs, and offloading macro cell users to SCs as a function of interference and backhaul links. Via numerical results, we show the performance gains of our proposed framework under the impact of SCs density, number of BS antennas, and transmit power levels at low and high frequency bands. It is shown that our proposed approach achieves a 5.6× gain in terms of cell-edge performance as compared to the closed-access baseline in ultra-dense networks with 350 SC BSs per km 2 .","authors":["Kien Vu","Mehdi Bennis","Sumudu Samarakoon","mérouane Debbah"],"meta":["June 2017IEEE Transactions on Wireless Communications 16(9):1-15","DOI:10.1109/TWC.2017.2718504","Project: 5Gto10G"],"references":["317032004_Ultra-Reliable_and_Low_Latency_Communication_in_mmWave-Enabled_Massive_MIMO_Networks","283575638_Cooperative_Interference_Mitigation_Algorithm_in_Heterogeneous_Networks","281487294_User_Association_in_5G_Networks_A_Survey_and_an_Outlook","280018811_SDPT3_-_a_MATLAB_software_package_for_semidefinite_programming_version_13","277939309_Achieving_Energy_Efficiency_Fairness_in_Multicell_MISO_Downlink","276428874_Large_System_Analysis_of_Cognitive_Radio_Network_via_Partially-Projected_Regularized_Zero-Forcing_Precoding","275054844_Optimal_Hierarchical_Radio_Resource_Management_for_HetNets_with_Flexible_Backhaul","264276569_Optimal_User-Cell_Association_for_Massive_MIMO_Wireless_Networks","308822561_Small_cell_in-band_wireless_backhaul_in_massive_Multiple-Input_Multiple-Output_systems","269311577_Millimeter_wave_cellular_channel_models_for_system_evaluation"]}