{"id":"317989100_Learning_to_Program_Choose_Your_Lecture_Seat_Carefully","abstract":"Much previous research has indicated that where a student sits in a university lecture theatre has a correlation with their final grade. Frequently those students that sit regularly in the front rows have been reported to achieve the highest grades. However most of the research restricted student seat movement, which is both unnatural and may have adversely influenced the research results. A previously reported unique unrestricted seat tracking investigation by the authors of this paper used a web and mobile software tracking application (PinPoint) to investigate student seating related performances in a 12 week Java programming university module. The PinPoint investigation concluded that the best assessment results were achieved by the students in the front rows and that assessment scores degraded the further students sat from the front. Additionally while the most engaged students were found to regularly sit at the front the same was not true for the most academically able or those with the greatest prior programming experience. This paper presents a further analysis of the PinPoint data, focusing on assessment performances within similar groups (academic ability, engagement and prior programming experiences) and additionally presents results of a temporal movement study and a qualitative analysis of the group and individual student seating decisions. It concludes that a comparison of student assessment performances within each of the peer groups, in every instance, found that the front row students outperformed their peers sitting further back. This strongly suggests that there is a benefit to sitting at the front regardless of academic ability, engagement or prior subject knowledge. It also points to other untested factors that may be positively influencing the front row performances.","authors":["Aidan Mcgowan","Philip Hanna","Des Greer","John Busch"],"meta":["June 2017","DOI:10.1145/3059009.3059020","Conference: the 2017 ACM Conference"],"references":["42637312_Classroom_geography_who_sit_where_in_the_traditional_classroom","352424006_Use_of_heart_rate_monitors_to_assess_student_engagement_in_lecture_72125","318697809_Learning_to_program_-_does_it_matter_where_you_sit_in_the_lecture_theatre","311450658_Location_location_location_Does_seat_location_affect_performance_in_large_classes","297197849_HEART-RATE_AND_OXYGEN-CONSUMPTION_DURING_MENTAL_CHALLENGE_AND_GRADED_ISOMETRIC-EXERCISE","288973461_10_SOME_AUTONOMIC-CENTRAL_NERVOUS_SYSTEM_INTERRELATIONSHIPS","285420630_Personality_and_Classroom_Seating","269756781_College_Classroom_Seating_Position_and_Changes_in_Achievement_Motivation_over_a_Semester","261777871_College_Classroom_Ecology","258132419_Classroom_Seating_Location_Student_Grades_and_Attitudes","254303524_Student_perception_in_classrooms","243715818_The_Surprising_Impact_of_Seat_Location_on_Student_Performance","238374411_What's_the_Use_of_Lectures","234765509_The_Effect_of_Seat_Location_on_Exam_Grades_and_Student_Perceptions_in_an_Introductory_Biology_Class","233030049_Proximity_and_Student_Density_as_Ecological_Variables_in_a_College_Classroom","232506299_Physical_and_Social_Distancing_in_Teacher-Pupil_Relationships","201381679_What's_the_Use_of_Lectures","19672898_Location_location_location","19149738_Heart_Rate_and_Oxygen_Consumption_during_Mental_Arithmetic_a_Video_Game_and_Graded_Exercise_Further_Evidence_of_Metabolically-Exaggerated_Cardiac_Adjustments","16065882_Recall_of_lecture_information_A_question_of_what_when_and_where"]}