{"id":"317990410_A_meta-heuristic_approach_supported_by_NSGA-II_for_the_design_and_plan_of_supply_chain_networks_considering_new_product_development","abstract":"There are many reasons for the growing interest in developing new product projects for any firm. The most embossed reason is surviving in a highly competitive industry which the customer tastes are changing rapidly. A well-managed supply chain network can provide the most profit for firms due to considering new product development. Along with profit, customer satisfaction and production of new products are goals which lead to a more efficient supply chain. As new products appear in the market, the old products could become obsolete, and then phased out. The most important parameter in a supply chain which considers new and developed products is the time that developed and new products are introduced and old products are phased out. With consideration of the factors noted above, this study proposes to design a tri-objective multi-echelon multi-product multi-period supply chain model, which incorporates product development and new product production and their effects on supply chain configuration. The supply chain under consideration is assumed to consist of suppliers, manufacturers, distributors and customer groups. In terms of overcoming NP-hardness of the proposed model and in order to solve the complicated problem, a non-dominated sorting genetic algorithm is employed. As there is no benchmark available in the literature, the non-dominated ranking genetic algorithm is developed to validate the results obtained and some test problems are provided to show the applicability of the proposed methodology and evaluate the performance of the algorithms.","authors":["Zahra Alizadeh Afrouzy","Mohammad Mahdi Paydar","Hadi Nasseri","Iraj Mahdavi"],"meta":["June 2017","DOI:10.1007/s40092-017-0209-7"],"references":["273403613_Multi-objective_process_planning_and_scheduling_using_controlled_elitist_non-dominated_sorting_genetic_algorithm","308128631_A_genetic_algorithm_for_supply_chain_configuration_with_new_product_development","303172903_Multiobjective_process_planning_and_scheduling_using_controlled_elitist_non-dominated_sorting_genetic_algorithm","303156218_Non-dominated_ranked_genetic_algorithm_for_solving_multi-objective_optimization_problems_NRGA","303083585_Multi_objective_optimization_using_nondominated_sorting_in_genetic_algorithms","289460312_Multi-objective_Optimisation_Using_Evolutionary_Algorithms_An_Introduction","283187302_Multi-objective_optimization_of_the_supply_chain_of_biofuels_from_residues_of_the_tequila_industry_in_Mexico","282886843_Robust_and_fuzzy_goal_programming_optimization_approaches_for_a_novel_multi-objective_hub_location-allocation_problem_A_supply_chain_overview","277915513_A_Comprehensive_fuzzy_multi-objective_multi-product_multi-site_aggregate_production_planning_decisions_in_a_supply_chain_under_uncertainty","273162031_An_improved_multi-choice_goal_programming_approach_for_supplier_selection_problems"]}