{"id":"317936413_OAuth-IoT_An_access_control_framework_for_the_Internet_of_Things_based_on_open_standards","abstract":"While the Internet of Things is breaking into the market, the controlled access to constrained resources still\nremains a blocking concern. Unfortunately, conventional solutions already accepted for both web and cloud applications cannot be directly used in this context. In fact, they generally require high computational and bandwidth capabilities (that are impossible to reach with constrained devices) and offer poor interoperability\nagainst standardized communication protocols for the Internet of Things. To solve this issue, this contribution presents a flexible authentication and authorization framework for the Internet of Things, namely OAuth-IoT. It leverages and properly harmonizes existing open-standards (including the OAuth 2.0 authorization\nframework, different token formats, and the protocol suite for the Internet of Things tailored by the Internet Engineering Task Force), while carefully taking into account the limited capabilities of constrained devices. Functionalities and benefits offered by OAuth-IoT are pragmatically shown by means of an experimental testbed, and further demonstrated with a very preliminary performance assessment.","authors":["Savio Sciancalepore","Giuseppe Piro","Daniele Caldarola","Gennaro Boggia"],"meta":["July 2017","DOI:10.1109/ISCC.2017.8024606","Conference: 22nd IEEE Symposium on Computers and Communications (ISCC) 2017At: Heraklion, Crete, Greece"],"references":["280068237_OpenMote_Open-Source_Prototyping_Platform_for_the_Industrial_IoT","273396590_IoT-OAS_An_OAuth-Based_Authorization_Service_Architecture_for_Secure_Services_in_IoT_Scenarios","273303094_Toward_a_Lightweight_Authentication_and_Authorization_Framework_for_Smart_Objects","272641092_Security_for_the_Internet_of_Things_A_Survey_of_Existing_Protocols_and_Open_Research_Issues","263128758_Securing_the_Internet_of_Things_A_Standardization_Perspective","233731542_Standardized_Protocol_Stack_For_The_Internet_Of_Important_Things","308821516_An_OAuth_based_authentication_mechanism_for_IoT_networks","277879030_AAA_Authorization_Framework","271325478_OpenWSN_A_Standards-Based_Low-Power_Wireless_Development_Environment"]}