{"id":"317972237_Social_justice_and_out-of-school_science_learning_Exploring_equity_in_science_television_science_clubs_and_maker_spaces","abstract":"We cannot take access to equitable out-of-school science learning for granted. Data compiled in 2012 show that between a fifth (22% in Brazil) and half (52% in China and the United States) of people in China, Japan, South Korea, India, Malaysia, the United States, the European Union, and Brazil visited zoos, aquaria, and science museums (National Science Foundation, 2012). But research suggests participation in out-of-school science learning is far from equitable and is marked by advantage, not least the social axes of age, social class, and ethnicity (Dawson, 2014a, 2014b; National Science Foundation, 2012; OECD, 2012). For instance, in the UK data suggest that the two-thirds of the population who took part in out-of-school science learning activities1 in the previous year were more affluent (upper and middle classes) and from the White ethnic majority (Ipsos MORI, 2014). If we believe that out-of-school science learning provides valuable educational, cultural, social and political opportunities, then we must take questions of equity seriously. Ideas from social justice can help us understand how equity issues are woven through out-of-school science learning practices. In this paper, I outline how social justice theories, in combination with the concepts of infrastructure access, literacies and community acceptance, can be used to think about equity in out-of-school science learning. I apply these ideas to out-of-school science learning via television, science clubs and maker spaces, looking at research as well as illustrative examples to see how equity challenges are being addressed in practice. I argue that out-of-school science learning practices can be understood on a spectrum from weak to strong models of social justice. Thinking about social justice as a spectrum helps us think through what equitable out-of-school science learning practices might involve, both to analyze existing practices and, importantly, to imagine new, more inclusive ones. Out-of-school science learning is a broad term, used to describe quite different activities, participants, aims, and practices. It can mean enjoying science festivals, watching science documentaries, pursing science-related hobbies as well as activities focused on engineering, mathematics, or technology (see, e.g., Bonney et al., 2009; Dingwall & Aldridge, 2006; Kaiser, Durant, Levenson, Wiehe, & Linett, 2013). In this paper, I focus primarily on the contrasting worlds of television and science clubs as out-of-school science learning contexts2. I use “science” as an umbrella term for science, technology, engineering, or mathematics related subjects. However, I add a caveat to how I use the term out-of-school. Because “out-of-school” invokes the idea of school, there can be a tendency to focus on youth as participants and activities that are for, by, or with youth. But of course adults may not consider their television watching an “out-of-school” activity. Thus, I note here that I keep both adults and youth in mind when writing about equity and out-of-school science learning.","authors":["Emily Dawson"],"meta":["July 2017Science Education 101(4):539-547","DOI:10.1002/sce.21288"],"references":["334836483_Science_on_Television_Audiences_Markets_and_Authority_Some_Conclusions","331207451_Implementing_Out-of-School_Time_STEM_Resources_Best_Practices_from_Public_Television","347796162_Science_in_the_Making_at_the_Margin_A_Multisited_Ethnography_of_Learning_and_Becoming_in_an_Afterschool_Program_a_Garden_and_a_Math_and_Science_Upward_Bound_Program","341664939_Science_as_Social_Knowledge_Values_and_Objectivity_in_Scientific_Inquiry","333886761_A_Theory_of_Justice","332832495_Unanswered_Questions_in_Audience_Research","329648187_Who's_Asking_Native_Science_Western_Science_and_Science_Education","329236880_Equity_in_informal_science_learning_a_practice-research_brief","317619949_Science_as_Social_Knowledge_Values_and_Objectivity_in_Scientific_Inquiry","314476496_Crafting_Code_Gender_Coding_and_Spatial_Hybridity_in_the_Events_of_Pyladies_Dublin"]}