{"id":"317952273_Arquitectura_de_informacion_para_un_negocio_de_comercio_electronico_en_Costa_Rica","abstract":"La magia del Internet ha hecho posible que muchas actividades de las que realizamos físicamente puedan romper la barrera del tiempo y el espacio, haciendo posible ofrecer ciertos servicios veinticuatro horas al día, siete días a la a semana, trescientos sesenta y cinco días al año. Este es el caso del comercio electrónico, representando hoy en día un canal muy importante de ventas y competitividad. A pesar de todas las ventajas que esto implica, cada día en Internet hay más sitios que ofrecen experiencias de navegación, búsqueda y contenido muy atractivas, que crean en los usuarios criterios cada vez más específicos para elegir si permanecen en un sitio web o lo abandonan. En este contexto se establece una verdadera competencia por captar la atención y el tiempo del usuario, para que conozca lo que se le ofrece antes de irse con la competencia. Por esta y otras razones, se creó el concepto de Arquitectura de Información (AI), la cual busca proporcionar el contenido estructurado y etiquetado de manera indicada, según el perfil de todos los posibles usuarios, en un contexto o negocio dado. Esto implica un gran reto, por lo que surge la necesidad de utilizar una metodología formal de AI para apoyar al negocio en la realización de sus objetivos. En este contexto, este trabajo tiene como objetivo principal: desarrollar una arquitectura de información para un sitio de comercio electrónico, como apoyo para alcanzar la visión de la empresa y satisfacer las necesidades de los clientes. Para lograr este objetivo se desarrolló todo el proceso de adopción y adaptación de una metodología de AI, que se compone de las fases de: investigación, estrategia, diseño, implementación y pruebas utilizando las tecnologías de “eye-tracking”, para la implementación de un sitio de comercio electrónico en Costa Rica. Este documento describe en detalle los pasos dados y resultados obtenidos para lograr desarrollar y aplicar exitosamente esta metodología.","authors":["Agustín Francesa-Alfaro"],"meta":["January 2014","DOI:10.13140/RG.2.2.27576.55045","Thesis for: MasterAdvisor: César Garita"],"references":["220693629_A_pattern_language_Towns_buildings_construction","200026029_Communicating_Design_Developing_Web_Site_Documentation_for_Design_and_Planning","44837374_Information_Architecture_for_the_World_Wide_Web"]}