{"id":"317936505_Password-Hashing_Status","abstract":"Computers are used in our everyday activities, with high volumes of users accessing provided services. One-factor authentication consisting of a username and a password is the common choice to authenticate users in the web. However, the poor password management practices are exploited by attackers that disclose the users’ credentials, harming both users and vendors. In most of these occasions the user data were stored in clear or were just processed by a cryptographic hash function. Password-hashing techniques are applied to fortify this user-related information. The standardized primitive is currently the PBKDF2 while other widely-used schemes include Bcrypt and Scrypt. The evolution of parallel computing enables several attacks in password-hash cracking. The international cryptographic community conducted the Password Hashing Competition (PHC) to identify new efficient and more secure password-hashing schemes, suitable for widespread adoption. PHC advanced our knowledge of password-hashing. Further analysis efforts revealed security weaknesses and novel schemes were designed afterwards. This paper provides a review of password-hashing schemes until the first quarter of 2017 and a relevant performance evaluation analysis on a common setting in terms of code size, memory consumption, and execution time.","authors":["George Hatzivasilis"],"meta":["June 2017Cryptography 1(10)","DOI:10.3390/cryptography1020010","Projects: nShieldnSHIELD"],"references":["316597629_Real-time_management_of_railway_CPS","316597501_SecRoute_End-to-End_Secure_Communications_for_Wireless_Ad-hoc_Networks","316078586_A_review_of_lightweight_block_ciphers","306293911_Lightweight_authenticated_encryption_for_embedded_on-chip_systems","303849832_Efficiently_Computing_Data-Independent_Memory-Hard_Functions","314502690_Towards_Practical_Attacks_on_Argon2i_and_Balloon_Hashing","309773971_Balloon_Hashing_A_Memory-Hard_Function_Providing_Provable_Protection_Against_Sequential_Attacks","301670687_On_the_Complexity_of_Scrypt_and_Proofs_of_Space_in_the_Parallel_Random_Oracle_Model","300571459_High_Parallel_Complexity_Graphs_and_Memory-Hard_Functions","300141162_On_Password_Guessing_with_GPUs_and_FPGAs"]}