{"id":"317978362_Local_thermal_energy_as_a_structural_indicator_in_glasses","abstract":"Identifying heterogeneous structures in glasses-such as localized soft spots-and understanding structure-dynamics relations in these systems remain major scientific challenges. Here, we derive an exact expression for the local thermal energy of interacting particles (the mean local potential energy change caused by thermal fluctuations) in glassy systems by a systematic low-temperature expansion. We show that the local thermal energy can attain anomalously large values, inversely related to the degree of softness of localized structures in a glass, determined by a coupling between internal stresses-an intrinsic signature of glassy frustration-anharmonicity and low-frequency vibrational modes. These anomalously large values follow a fat-tailed distribution, with a universal exponent related to the recently observed universal [Formula: see text] density of states of quasilocalized low-frequency vibrational modes. When the spatial thermal energy field-a \"softness field\"-is considered, this power law tail manifests itself by highly localized spots, which are significantly softer than their surroundings. These soft spots are shown to be susceptible to plastic rearrangements under external driving forces, having predictive powers that surpass those of the normal modes-based approach. These results offer a general, system/model-independent, physical/observable-based approach to identify structural properties of quiescent glasses and relate them to glassy dynamics.","authors":["Jacques Zylberg","Edan Lerner","Yohai Bar-Sinai","Eran Bouchbinder"],"meta":["June 2017Proceedings of the National Academy of Sciences 114(28):201704403","DOI:10.1073/pnas.1704403114"],"references":["315695950_Continuum_limit_of_the_vibrational_properties_of_amorphous_solids","309008909_Nonlinear_modes_disentangle_glassy_and_Goldstone_modes_in_structural_glasses","305388564_Connecting_Local_Yield_Stresses_with_Plastic_Activity_in_Amorphous_Solids","304534856_Simple_liquids'_quasiuniversality_and_the_hard-sphere_paradigm","279309961_A_structural_approach_to_relaxation_in_glassy_liquids","346695286_Glassy_Materials_and_Disordered_Solids_An_Introduction_to_Their_Statistical_Mechanics","305275299_Statistics_and_Properties_of_Low-Frequency_Vibrational_Modes_in_Structural_Glasses","303410873_Glassy_Materials_and_Disordered_Solids_An_Introduction_to_Their_Statistical_Mechanics","301875255_The_micromechanics_of_nonlinear_plastic_modes","292343109_Nonlinear_plastic_modes_in_disordered_solids"]}