{"id":"317972531_The_Logic_of_Design_as_a_Conceptual_Logic_of_Information","abstract":"In this article, I outline a logic of design of a system as a specific kind of conceptual logic of the design of the model of a system, that is, the blueprint that provides information about the system to be created. In section two, I introduce the method of levels of abstraction as a modelling tool borrowed from computer science. In section three, I use this method to clarify two main conceptual logics of information (i.e., modelling systems) inherited from modernity: Kant’s transcendental logic of conditions of possibility of a system, and Hegel’s dialectical logic of conditions of in/stability of a system. Both conceptual logics of information analyse structural properties of given systems. Strictly speaking, neither is a conceptual logic of information about (or modelling) the conditions of feasibility of a system, that is, neither is a logic of information as a logic of design. So, in section four, I outline this third conceptual logic of information and then interpret the conceptual logic of design as a logic of requirements, by introducing the relation of “sufficientisation”. In the conclusion, I argue that the logic of requirements is exactly what we need in order to make sense of, and buttress, a constructionist (poietic) approach to knowledge.","authors":["Luciano Floridi"],"meta":["September 2017Minds and Machines 27(2):1-25","DOI:10.1007/s11023-017-9438-1"],"references":["316080745_Why_Designing_Is_Not_Experimenting_Design_Methods_Epistemic_Praxis_and_Strategies_of_Knowledge_Acquisition_in_Architecture","314113092_Operationalization_of_the_Blending_and_the_Levels_of_Abstraction_Theories_with_the_Timed_Observations_Theory","313471198_A_Plea_for_Non-naturalism_as_Constructionism","347260507_Philosophical_Logic","346642943_The_Ethics_of_Information","345727428_Historical_Foundations_of_Informal_Logic","318881474_Camera_Lucida_Reflections_on_Photography","315871260_Understanding_Arguments_An_Introduction_to_Informal_Logic","315185781_Mimesis_The_Representation_of_Reality_in_Western_Literature","313612358_The_logic_of_design"]}