{"id":"318038905_Human_Persona","abstract":"In this paper, we try to provide a theory that explains human behaviour and thinking in their totality. We missed\nthe corporeal part when writing the theory about our new model for the human psyche: It was missing explaining that some things are physical, such as memories, involuntary organic movements, disease, etc. If we had developed a philosophical model for the soma, we would also miss the essence of the individual, what we have decided to call psyche. In order to explain how our hand could not stand the pressure and ended up releasing the link that then got lose and killed somebody, we need the philosophical explanation involving the soma. In order to explain why a person had a shared-ego moment, we need the philosophical explanation involving the psyche. In this way, it is missing creating a theory that unifies all in order to produce a set that can explain any situation that involves human behaviour and thinking. We are then calling the entity that collects all in one, which is needed for our better understanding, Human Persona. Persona because that reminds us of\nindividuality, unique characteristics that tell us that the individual we call John Smith, of id 143, is someone special. Human because we do talk about personality of animals, and we would like to make sure we create an impression of difference and superiority when referring to humans. The tools we here use are logical analysis, deductive reasoning, selection and collection of real-life evidence, etc.","authors":["Marcia Ricci Pinheiro"],"meta":["June 2017","DOI:10.5923/j.ap.20170102.01","Projects: Teach for FreedomHuman Psyche"],"references":["307936102_The_Sorites_x_Classical_Logic","302239624_FIRST_DECISIONS_NATURE_OF_THE_MODELLING_WORK","287206279_Words_for_Science","286931032_Concerning_the_Solution_to_the_Liar_Paradox","286930987_Concerning_the_Solution_to_the_Russell's_Paradox","286161870_A_New_Model_for_the_Human_Psyche","282624779_The_Unexpected_Hanging_Problem_and_a_Trivial_but_Unexpected_Solution","319276005_The_Sorites_x_Classical_Logic"]}