{"id":"318096420_Sentiment_Analysis_Using_Deep_Learning_Techniques_A_Review","abstract":"The World Wide Web such as social networks, forums, review sites and blogs generate enormous heaps of data in the form of users views, emotions, opinions and arguments about different social events, products, brands, and politics. Sentiments of users that are expressed on the web has great influence on the readers, product vendors and politicians. The unstructured form of data from the social media is needed to be analyzed and well-structured and for this purpose, sentiment analysis has recognized significant attention. Sentiment analysis is referred as text organization that is used to classify the expressed mind-set or feelings in different manners such as negative, positive, favorable, unfavorable, thumbs up, thumbs down, etc. The challenge for sentiment analysis is lack of sufficient labeled data in the field of Natural Language Processing (NLP). And to solve this issue, the sentiment analysis and deep learning techniques have been merged because deep learning models are effective due to their automatic learning capability. This Review Paper highlights latest studies regarding the implementation of deep learning models such as deep neural networks, convolutional neural networks and many more for solving different problems of sentiment analysis such as sentiment classification, cross lingual problems, textual and visual analysis and product review analysis, etc.","authors":["Qurat Tul","Mubashir Ali","Amna Riaz","Amna Noureen"],"meta":["January 2017International Journal of Advanced Computer Science and Applications 8(6)","DOI:10.14569/IJACSA.2017.080657"],"references":["305675500_Sentiment_classification_of_Hinglish_text","305675485_A_novel_deep_learning_architecture_for_sentiment_classification","315364132_Deep_Belief_Networks_with_Feature_Selection_for_Sentiment_Classification","311756054_Cross-Domain_Sentiment_Analysis_An_Empirical_Investigation","311711611_A_review_of_sentiment_analysis_techniques_for_opinionated_web_text","311490361_Joint_Visual-Textual_Sentiment_Analysis_with_Deep_Neural_Networks","310807858_Deep_learning_for_financial_sentiment_analysis_on_finance_news_providers","310624628_A_study_of_sentiment_analysis_using_deep_learning_techniques_on_Thai_Twitter_data","304549710_Research_on_Chinese_Micro-Blog_Sentiment_Analysis_Based_on_Deep_Learning","291044875_Twitter_Sentiment_Analysis_with_Deep_Convolutional_Neural_Networks"]}