{"id":"318092269_Context_Sensitive_Search_String_Composition_Algorithm_using_User_Intention_to_Handle_Ambiguous_Keywords","abstract":"p>Finding the required URL among the first few result pages of a search engine is still a challenging task. This may require number of reformulations of the search string thus adversely affecting user's search time. Query ambiguity and polysemy are major reasons for not obtaining relevant results in the top few result pages. Efficient query composition and data organization are necessary for getting effective results. Context of the information need and the user intent may improve the autocomplete feature of existing search engines. This research proposes a Funnel Mesh-5 algorithm (FM5) to construct a search string taking into account context of information need and user intention with three main steps 1) Predict user intention with user profiles and the past searches via weighted mesh structure 2) Resolve ambiguity and polysemy of search strings with context and user intention 3) Generate a personalized disambiguated search string by query expansion encompassing user intention and predicted query. Experimental results for the proposed approach and a comparison with direct use of search engine are presented. A comparison of FM5 algorithm with K Nearest Neighbor algorithm for user intention identification is also presented. The proposed system provides better precision for search results for ambiguous search strings with improved identification of the user intention. Results are presented for English language dataset as well as Marathi (an Indian language) dataset of ambiguous search strings.\n\n</p","authors":["Uma ga","Sarang Joshi"],"meta":["February 2017International Journal of Electrical and Computer Engineering 7(1):432-450","DOI:10.11591/ijece.v7i1.pp432-450"],"references":["307174918_Mining_association_rules_between_sets_of_items_in_large_databases","282162389_Activity_Inference_for_Constructing_User_Intention_Model","281436320_Learning_by_Example_Training_Users_with_High-quality_Query_Suggestions","281115689_Query_Suggestion_and_Data_Fusion_in_Contextual_Disambiguation","308960894_A_New_Profile_Learning_Model_for_Recommendation_System_based_on_Machine_Learning_Technique","300032537_Predicting_Search_Intent_Based_on_Pre-Search_Context","295073944_User_Intended_Context_Sensitive_Mining_Algorithm_for_Search_String_Composition","290244700_Learning_from_homologous_queries_and_semantically_related_terms_for_query_auto_completion","286769169_Time-sensitive_Personalized_Query_Auto-Completion","277007689_Natural_Language_Corpus_Data"]}