{"id":"318089527_ANALISIS_KESULITAN_YANG_DIHADAPI_OLEH_GURU_DAN_PESERTA_DIDIK_SEKOLAH_MENENGAH_PERTAMA_DALAM_IMPLEMENTASI_KURIKULUM_2013_PADA_MATA_PELAJARAN_MATEMATIKA_Studi_Kasus_Eks-Karesidenan_Madiun","abstract":"Penelitian ini bertujuan untuk mengetahui kesulitan yang dialami guru dan peserta didik Sekolah Menengah Pertama (SMP) dalam implementasi kurikulum 2013 pada mata pelajaran matematika dan faktor-faktor yang menyebabkan kesulitan tersebut, serta untuk mengetahui solusi dalam mengatasi kesulitan guru dan peserta didik dalam implementasi kurikulum 2013 pada mata pelajaran matematika. Penelitian ini termasuk penelitian kualitatif. Populasi dalam penelitian ini adalah semua guru dan peserta didik Sekolah Menengah Pertama di Karesidenan Madiun. Subyek penelitian dipilih dengan menggunakan teknik purposive sample. Dipilih tiga Kabupaten/Kota dalam wilayah Karesidenan Madiun. Sekolah yang menjadi sampel penelitian ini adalah dua SMP dari setiap Kabupaten/Kota yang dipilih, dengan kriteria bahwa sekolah yang akan dijadikan sampel telah melaksanakan Kurikulum 2013. Pengumpulan data dilakukan dengan metode angket, observasi dan wawancara. Teknik analisis data dilakukan dengan analisis data kualitatif, yaitu reduksi data, penyajian data dan penarikan kesimpulan. Hasil dari penelitian ini adalah kesulitan-kesulitan yang dihadapi guru dalam mengimplementasikan kurikulum 2013 pada matapelajaran matematika, antara lain: (1) guru kurang memahami tujuan Kurikulum 2013 dan pendekatan saintifik, (2) penggunaan bahasa dalam buku teks sulit dipahami dan kurang efektif dalam meningkatkan proses pembelajaran, (3) guru kurang mampu melaksanakan proses pembelajaran yang menuju keterampilan aplikatif, (4) guru kurang mampu melakukan proses pembelajaran yang membuat peserta didik menjadi ingin melakukan pengamatan dan eksperimen, (5) guru kurang mampu melakukan proses pembelajaran yang menumbuhkan kreatifitas peserta didik. Sedangkan kesulitan-kesulitan yang dihadapi peserta didik dalam mengimplementasikan kurikulum 2013 pada matapelajaran matematika, antara lain: (1) peserta didik mengalami kesulitan dalam memahami isi, contoh-contoh dan bahasa dalam buku teks, (2) peserta didik jarang dilatih melakukan pengamatan dan percobaan, (3) dalam proses pembelajaran berlangsung guru jarang menggunakan teknologi informasi dalam proses belajar mengajar. Adapun faktor-faktor yang menyebabkan kesulitan tersebut adalah (1) kurangnya pelatihan atau workshop tentang kurikulum 2013, (2) kurangnya sarana dan prasarana dalam pembelajaran disekolah, (3) kurangnya pemahaman terhadap kompetensi inti dan kompetensi dasar, (4) materi dan contoh soal yang disajikan dalam buku teks sulit dipahami oleh siswa, (5) guru masih menerapkan pembelajaran konvensional, sehingga kurang menggali kemampuan siswa, (6) guru kurang kreatif dalam menerapkan model dan metode pembelajaran, (7) kemampuan guru dalam pemanfaatan teknologi, informasi dan teknologi masih lemah. Solusi yang ditawarkan untuk mengatasi kesulitan tersebut adalah: (1) perlu diadakan pelatihan/workshop tentang kurikulum 2013, (2) guru harus lebih banyak belajar dan membaca tentang implementasi kurikulum 2013, (3) guru harus lebih kretif dalam menerapkan model/metode pembelajaran yang berpusat pada siswa, (4) kemampuan guru dalam bidang teknologi, informasi dan komunikasi harus ditingkatkan dengan mengikuti workshop/pelatihan.","authors":["Ika Krisdiana","Davi Apriandi","Reza Kusuma Setyansah"],"meta":["August 2014JIPM (Jurnal Ilmiah Pendidikan Matematika) 3(1)","DOI:10.25273/jipm.v3i1.492"],"references":[]}