{"id":"318055156_Fast_Hybrid_String_Matching_Algorithm_based_on_the_Quick-Skip_and_Tuned_Boyer-Moore_Algorithms","abstract":"The string matching problem is considered as one of the most interesting research areas in the computer science field because it can be applied in many essential different applications such as intrusion detection, search analysis, editors, internet search engines, information retrieval and computational biology. During the matching process two main factors are used to evaluate the performance of the string matching algorithm which are the total number of character comparisons and the total number of attempts. This study aims to produce an efficient hybrid exact string matching algorithm called Sinan Sameer Tuned Boyer Moore-Quick Skip Search (SSTBMQS) algorithm by blending the best features that were extracted from the two selected original algorithms which are Tuned Boyer-Moore and Quick-Skip Search. The SSTBMQS hybrid algorithm was tested on different benchmark datasets with different size and different pattern lengths. The sequential version of the proposed hybrid algorithm produces better results when compared with its original algorithms (TBM and Quick Skip Search) and when compared with Maximum-Shift hybrid algorithm which is considered as one of the most recent hybrid algorithm. The proposed hybrid algorithm has less number of attempts and less number of character comparisons.","authors":["Sinan Sameer Mahmood Al-Dabbagh","Nuraini bint Abdul Rashid","Mustafa Abdul Sahib Naser","Nawaf Hazim"],"meta":["July 2017International Journal of Advanced Computer Science and Applications 8(6):117-127","DOI:10.14569/IJACSA.2017.080615","Project: FAST HYBRID STRING MATCHING ALGORITHM  BASED ON THE QUICK-SKIP AND TUNED  BOYER-MOORE ALGORITHMS"],"references":["312120578_A_New_Efficient_Hybrid_String_Matching_Algorithm_to_Solve_the_Exact_String_Matching_Problem","309277340_Parallel_Quick_Search_Algorithm_for_the_Exact_String_Matching_Problem_Using_OpenMP","281863368_The_exact_string_matching_algorithms_efficiency_review","271302919_Quick-Skip_Search_Hybrid_Algorithm_for_the_Exact_String_Matching_Problem","234025323_On-line_string_matching_algorithms_Survey_and_experimental_results","289225157_Fast_exact_pattern_matching_algorithm","286883825_A_Fast_Hybrid_Algorithm_Approach_for_the_Exact_String_Matching_Problem_Via_Berry_Ravindran_and_Alpha_Skip_Search_Algorithms","269272975_Maximum-shift_string_matching_algorithms","242283307_A_Practical_Distributed_String_Matching_Algorithm_Architecture_and_Implementation","220982032_Faster_Filters_for_Approximate_String_Matching"]}