{"id":"318068143_Small_solar_system_bodies_as_granular_systems","abstract":"Asteroids and other Small Solar System Bodies (SSSBs) are currently of great scientific and even industrial interest. Asteroids exist as the permanent record of the formation of the Solar System and therefore hold many clues to its understanding as a whole, as well as insights into the formation of planetary bodies. Additionally, SSSBs are being investigated in the context of impact risks for the Earth, space situational awareness and their possible industrial exploitation (asteroid mining). In all these aspects, the knowledge of the geophysical characteristics of SSSB surface and internal structure are of great importance. Given their size, constitution, and the evidence that many SSSBs are not simple monoliths, these bodies should be studied and modelled as self-gravitating granular systems in general, or as granular systems in micro-gravity environments in particular contexts. As such, the study of the geophysical characteristics of SSSBs is a multi-disciplinary effort that lies at the crossroads between Granular Mechanics, Celestial Mechanics, Soil Mechanics, Aerospace Engineering and Computer Sciences.","authors":["D. Hestroffer","Adriano Campo Bagatin","Wolfgang Losert","Eric Opsomer"],"meta":["January 2017The European Physical Journal Conferences 140:14011","DOI:10.1051/epjconf/201714014011","Project: Microgravity Geology"],"references":["268794182_Clustering_and_segregation_in_driven_granular_fluids","268522356_Stress_and_Failure_Analysis_of_Rapidly_Rotating_Asteroid_29075_1950_DA","231120862_Simulating_Asteroid_Rubble_Piles_with_A_Self-gravitating_Soft-sphere_Distinct_Element_Method_Model","229071390_Monitoring_with_Lichens-Monitoring_Lichens","13825542_NEAR's_flyby_of_253_Mathilde_Images_of_a_C_asteroid","7042081_Touchdown_of_the_Hayabusa_Spacecraft_at_the_Muses_Sea_on_Itokawa","318837826_Asteroids_IV","311397125_Numerical_simulations_of_oscillation-driven_regolith_motion_Brazil-nut_effect","252183555_How_Many_Rubble_Piles_Are_in_the_Asteroid_Belt","222545989_Direct_Large-Scale_N-Body_Simulations_of_Planetesimal_Dynamics"]}