{"id":"318003528_Slave_to_the_Algorithm_Why_a_Right_to_Explanationn_is_Probably_Not_the_Remedy_You_are_Looking_for","abstract":"Algorithms, particularly machine learning (ML) algorithms, are increasingly important to individuals’ lives, but have caused a range of concerns revolving mainly around unfairness, discrimination and opacity. Transparency in the form of a “right to an explanation” has emerged as a compellingly attractive remedy since it intuitively promises to open the algorithmic “black box” to promote challenge, redress, and hopefully heightened accountability. Amidst the general furore over algorithmic bias we describe, any remedy in a storm has looked attractive. However, we argue that a right to an explanation in the EU General Data Protection Regulation (GDPR) is unlikely to present a complete remedy to algorithmic harms, particularly in some of the core “algorithmic war stories” that have shaped recent attitudes in this domain. Firstly, the law is restrictive, unclear, or even paradoxical concerning when any explanation-related right can be triggered. Secondly, even navigating this, the legal conception of explanations as “meaningful information about the logic of processing” may not be provided by the kind of ML “explanations” computer scientists have developed, partially in response. ML explanations are restricted both by the type of explanation sought, the dimensionality of the domain and the type of user seeking an explanation. However, “subject-centric\" explanations (SCEs) focussing on particular regions of a model around a query show promise for interactive exploration, as do explanation systems based on learning a model from outside rather than taking it apart (pedagogical versus decompositional explanations) in dodging developers' worries of intellectual property or trade secrets disclosure. Based on our analysis, we fear that the search for a “right to an explanation” in the GDPR may be at best distracting, and at worst nurture a new kind of “transparency fallacy.” But all is not lost. We argue that other parts of the GDPR related (i) to the right to erasure (\"right to be forgotten\") and the right to data portability; and (ii) to privacy by design, Data Protection Impact Assessments and certification and privacy seals, may have the seeds we can use to make algorithms more responsible, explicable, and human-centered.","authors":["Lilian Edwards","Michael Veale"],"meta":["December 2017SSRN Electronic Journal 16(1)","DOI:10.2139/ssrn.2972855"],"references":["301894892_First_I_like_it_then_I_hide_it_Folk_Theories_of_Social_Feeds","266655787_A_path_to_understanding_the_effects_of_algorithm_awareness","255180678_The_Personal_Container_or_Your_Life_in_Bits","333110036_Realising_the_Right_to_Data_Portability_for_the_Internet_of_Things","259673638_Protecting_Post-Mortem_Privacy_Reconsidering_the_Privacy_Interests_of_the_Deceased_in_a_Digital_World"]}