{"id":"318067642_Optimizing_one_million_variable_NK_landscapes_by_hybridizing_deterministic_recombination_and_local_search","abstract":"In gray-box optimization, the search algorithms have access to the variable interaction graph (VIG) of the optimization problem. For Mk Landscapes (and NK Landscapes) we can use the VIG to identify an improving solution in the Hamming neighborhood in constant time. In addition, using the VIG, deterministic Partition Crossover is able to explore an exponential number of solutions in a time that is linear in the size of the problem. Both methods have been used in isolation in previous search algorithms. We present two new gray-box algorithms that combine Partition Crossover with highly efficient local search. The best algorithms are able to locate the global optimum on Adjacent NK Landscape instances with one million variables. The algorithms are compared with a state-of-the-art algorithm for pseudo-Boolean optimization: Gray-Box Parameterless Population Pyramid. The results show that the best algorithm is always one combining Partition Crossover and highly efficient local search. But the results also illustrate that the best optimizer differs on Adjacent and Random NK Landscapes.","authors":["Francisco Chicano","Darrell Whitley","Gabriela Ochoa","Renato Tinós"],"meta":["July 2017","DOI:10.1145/3071178.3071285","Conference: the Genetic and Evolutionary Computation Conference"],"references":["300581103_Partition_Crossover_for_Pseudo-Boolean_Optimization","280223521_Tunnelling_Crossover_Networks","266656419_Efficient_identification_of_improving_moves_in_a_ball_for_pseudo-boolean_problems","260622021_The_computational_complexity_of_N-K_fitness_functions","241770226_Constant_time_steepest_descent_local_search_with_lookahead_for_NK-landscapes_and_MAX-kSAT","235709862_The_irace_Package_Iterated_Racing_for_Automatic_Algorithm_Configuration","220742414_Tunneling_between_optima_Partition_crossover_for_the_traveling_salesman_problem","301686117_Gray_box_optimization_for_Mk_landscapes_NK_landscapes_and_MAX-kSAT","300228036_Gray-Box_Optimization_using_the_Parameter-less_Population_Pyramid","34201459_Stochastic_Local_Search-Foundations_and_Applications"]}