{"id":"318010140_CoNLL-SIGMORPHON_2017_Shared_Task_Universal_Morphological_Reinflection_in_52_Languages","abstract":"The CoNLL-SIGMORPHON 2017 shared task on supervised morphological generation required systems to be trained and tested in each of 52 typologically diverse languages. In sub-task 1, submitted systems were asked to predict a specific inflected form of a given lemma. In sub-task 2, systems were given a lemma and some of its specific inflected forms, and asked to complete the inflectional paradigm by predicting all of the remaining inflected forms. Both sub-tasks included high, medium, and low-resource conditions. Sub-task 1 received 24 system submissions, while sub-task 2 received 3 system submissions. Following the success of neural sequence-to-sequence models in the SIGMORPHON 2016 shared task, all but one of the submissions included a neural component. The results show that high performance can be achieved with small training datasets, so long as models have appropriate inductive bias or make use of additional unlabeled data or synthetic data. However, different biasing and data augmentation resulted in disjoint sets of inflected forms being predicted correctly, suggesting that there is room for future improvement.","authors":["Ryan Cotterell","Christo Kirov","John Sylak-Glassman","Géraldine Walther"],"meta":["June 2017"],"references":["318741958_Data_Augmentation_for_Morphological_Reinflection","318741120_Experiments_on_Morphological_Reinflection_CoNLL-2017_Shared_Task","329978891_A_Graph-based_Lattice_Dependency_Parser_for_Joint_Morphological_Segmentation_and_Syntactic_Analysis","329973981_Modeling_Word_Forms_Using_Latent_Underlying_Morphs_and_Phonology","319770465_Sequence_to_Sequence_Learning_with_Neural_Networks","318741899_Seq2seq_for_Morphological_Reinflection_When_Deep_Learning_Fails","318741821_SU-RUG_at_the_CoNLL-SIGMORPHON_2017_shared_task_Morphological_Inflection_with_Attentional_Sequence-to-Sequence_Models","318741779_Neural_Graphical_Models_over_Strings_for_Principal_Parts_Morphological_Paradigm_Completion","318741121_If_you_can't_beat_them_join_them_the_University_of_Alberta_system_description","318741087_Training_Data_Augmentation_for_Low-Resource_Morphological_Inflection"]}