{"id":"318030916_Rational_Trust_Modeling","abstract":"Trust models are widely used in various computer science disciplines. The main purpose of a trust model is to continuously measure trustworthiness of a set of entities based on their behaviors. In this article, the novel notion of \"rational trust modeling\" is introduced by bridging trust management and game theory. Note that trust models/reputation systems have been used in game theory (e.g., repeated games) for a long time, however, game theory has not been utilized in the process of trust model construction; this is where the novelty of our approach comes from. In our proposed setting, the designer of a trust model assumes that the players who intend to utilize the model are rational/selfish, i.e., they decide to become trustworthy or untrustworthy based on the utility that they can gain. In other words, the players are incentivized (or penalized) by the model itself to act properly. The problem of trust management can be then approached by game theoretical analyses and solution concepts such as Nash equilibrium. Although rationality might be built-in in some existing trust models, we intend to formalize the notion of rational trust modeling from the designer's perspective. This approach will result in two fascinating outcomes. First of all, the designer of a trust model can incentivise trustworthiness in the first place by incorporating proper parameters into the trust function, which can be later utilized among selfish players in strategic trust-based interactions (e.g., e-commerce scenarios). Furthermore, using a rational trust model, we can prevent many well-known attacks on trust models. These two prominent properties also help us to predict behavior of the players in subsequent steps by game theoretical analyses.","authors":["Mehrdad Nojoumian"],"meta":["June 2017"],"references":["271646481_Trust_Influence_and_Reputation_Management_Based_on_Human_Reasoning","236612445_Robustness_of_Trust_Models_and_Combinations_for_Handling_Unfair_Ratings","314794655_Notions_of_reputation_in_multi-agents_systems_a_review","272382107_Indian_and_American_consumer_perceptions_of_cockpit_configuration_policy","260643645_An_incentive_mechanism_based_on_game_theory_for_trust_management","247393544_Reputation_Systems_Facilitation_trust_in_Internet_Interactions","242384947_Computational_Models_of_Trust_and_Reputation_Agents_Evolutionary_Games_and_Social_Networks","239060437_Reputation_Systems_Facilitating_Trust_in_Internet_Interactions","236612431_Detecting_Imprudence_of_'Reliable'_Sellers_in_Online_Auction_Sites","235759019_Combining_Trust_Modeling_and_Mechanism_Design_for_Promoting_Honesty_in_E-Marketplaces"]}