{"id":"318063654_Central_Focused_Convolutional_Neural_Networks_Developing_a_Data-driven_Model_for_Lung_Nodule_Segmentation","abstract":"Accurate lung nodule segmentation from computed tomography (CT) images is of great importance for image-driven lung cancer analysis. However, the heterogeneity of lung nodules and the presence of similar visual characteristics between nodules and their surroundings make it difficult for robust nodule segmentation. In this study, we propose a data-driven model, termed the Central Focused Convolutional Neural Networks (CF-CNN), to segment lung nodules from heterogeneous CT images. Our approach combines two key insights: 1) the proposed model captures a diverse set of nodule-sensitive features from both 3-D and 2-D CT images simultaneously; 2) when classifying an image voxel, the effects of its neighbor voxels can vary according to their spatial locations. We describe this phenomenon by proposing a novel central pooling layer retaining much information on voxel patch center, followed by a multi-scale patch learning strategy. Moreover, we design a weighted sampling to facilitate the model training, where training samples are selected according to their degree of segmentation difficulty. The proposed method has been extensively evaluated on the public LIDC dataset including 893 nodules and an independent dataset with 74 nodules from Guangdong General Hospital (GDGH). We showed that CF-CNN achieved superior segmentation performance with average dice scores of 82.15% and 80.02% for the two datasets respectively. Moreover, we compared our results with the inter-radiologists consistency on LIDC dataset, showing a difference in average dice score of only 1.98%.","authors":["Shuo Wang","Mu Zhou","Zaiyi Liu","Zhenyu Liu"],"meta":["June 2017Medical Image Analysis 40","DOI:10.1016/j.media.2017.06.014"],"references":["322784376_Corrigendum_Decoding_tumour_phenotype_by_noninvasive_imaging_using_a_quantitative_radiomics_approach","304226155_3D_U-Net_Learning_Dense_Volumetric_Segmentation_from_Sparse_Annotation","319770272_Delving_Deep_into_Rectifiers_Surpassing_Human-Level_Performance_on_ImageNet_Classification","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","319770168_Fully_Convolutional_Networks_for_Semantic_Segmentation","312100785_Cancer_Statistics_2017","309456686_Brain_tumor_segmentation_with_deep_neural_networks","307884838_Automated_tissue_segmentation_of_MR_brain_images_in_the_presence_of_white_matter_lesions","305193694_U-Net_Convolutional_Networks_for_Biomedical_Image_Segmentation","303711744_Response_to_Peter_Mantle_Comments_on_Mycobiota_and_Mycotoxins_in_Traditional_Medicinal_Seeds_from_China_Toxins_2015_7_3858-3875-Rigour_in_Attributing_Ochratoxin_A_Biosynthesis_within_the_Genus_Penicil"]}