{"id":"318019805_Mobile_application_development_process_A_practical_experience","abstract":"Nowadays there is an increasing interest in mobile application development. However, developers often disregard, or at least significantly adapt, existing software development processes to suit their purpose, given the existing specific constraints. Such adjustments can introduce variations and new trends in existing processes that in many occasions are not shared with the scientific community since there is no official documentation, thus justifying further research. In this paper, we present a study and characterization of current mobile application development processes based on a practical experience. We consider a set of real case studies to investigate the current development processes for mobile applications used by software development companies, as well as by independent developers. The result of the present study is the identification of mobile software development processes, namely agile approaches, and also of shortcomings in current methodologies applied in industry and academy, namely the lack of informed and experienced resources to develop mobile apps.","authors":["Lizeth Chandi","Catarina Silva","Danilo Martínez","Tatiana Gualotuña"],"meta":["June 2017","DOI:10.23919/CISTI.2017.7975825","Conference: CISTI'2017 - 12th Iberian Conference on Information Systems and Technologies"],"references":["313358537_Empirical_evaluation_of_the_effects_of_experience_on_code_quality_and_programmer_productivity_an_exploratory_study","269506170_Software_Development_Agile_vs_Traditional","266743674_An_Investigation_into_Mobile_Application_Development_Processes_Challenges_and_Best_Practices","220277828_Studying_Software_Engineers_Data_Collection_Techniques_for_Software_Field_Studies","317953724_Case_study_research_design_and_methods","266467892_Mobile_Application_Software_Engineering_Challenges_and_Research_Directions","4372633_Designing_an_agile_methodology_for_mobile_software_development_A_hybrid_method_engineering_approach"]}