{"id":"318110720_Experimental_Study_of_Multicast_and_Unicast_Video_Traffic_in_WAN_Links","abstract":"— In recent years there has been an exponential increase in the growth in multimedia applications, and in particular in video applications. Understanding the behavior of the video traffic and the requirements for the network helps network administrators to improve the traffic. In this work, a quantitative analysis is performed by experimentation, in order to evaluate the behavior and impact of video traffic on WAN networks. We propose a WAN test bed with fourth subescenarios that allows to inject unicast or multicast video traffic, compressed with several codecs. The generic topology used includes a computer running as a streaming server and up to 20 desktop computers (PCs) as clients connected at the ends of a network as if outside a WAN. This network WAN is formed by routers and switchs with different types of links interconnecting the same. For the operation between routers was configured the OSPF routing protocol v2. For the same routers are configured the routing multicast protocol PIM in dense mode. From capturing video traffic, we identified several interesting performance and Qo metrics, such as unicast and multicast throughput, delay, jitter, and Pareto distribution. We include detailed contributions on the impact produced by several factors, such as the codec used for the compression, and the use of unicast and multicast traffic when there are restrictions on the bandwidth, as in a corporate real WAN link of some few Mbps. The work oriented on the configurations to be taken into account for an adequate management of similar networks and an efficient use of the resources available, without compromising the performance and the expected QoS. Besides facilitates the comparison of the results with those obtained from analytical studies and modelling for different contexts.","authors":["Santiago Cristobal Pérez","Higinio Alberto Facchini","Luis Marrone","Fabian Hidalgo"],"meta":["October 2017IEEE Latin America Transactions 15(10)","DOI:10.1109/TLA.2017.8071226","Project: ANÁLISIS COMPARATIVO DE PRESTACIONES DE TRÁFICO DE VIDEO MULTICAST EN REDES HETEROGÉNEAS"],"references":["349760982_Comparative_Study_of_Compression_Techniques_for_Synthetic_Videos","277680474_Comparative_assessment_of_H265MPEG-HEVC_VP9_and_H264MPEG-AVC_encoders_for_low-delay_video_applications","275655408_An_Evaluation_of_QoS_for_intensive_video_traffic_over_80211e_WLANs","258651011_Performance_of_Video_Conferencing_using_Protocol_Independent_Multicast_Routing_with_Core_failure","229593576_An_experimental_study_of_multimedia_traffic_performance_in_mesh_networks","319063290_ESTADO_DEL_ARTE_DE_IPTV_Y_CONSIDERACIONES_TECNICAS_PARA_SU_MIGRACION_A_IPV6_EN_COLOMBIA","302969069_Experimental_Study_of_Unicast_and_Multicast_Video_Traffic_using_WAN_Test_Bed","264156516_A_QoS_evaluation_of_video_traffic_models_for_H264_AVC","236586219_A_survey_of_VBR_video_traffic_models","228969411_H264AVC_HDTV_video_codec_LSI"]}