{"id":"318122016_A_Tale_of_Two_Majors_Explaining_the_Gender_Gap_in_STEM_Employment_among_Computer_Science_and_Engineering_Degree_Holders","abstract":"We examine factors contributing to the gender gap in employment in science, technology, engineering, and math (STEM) among men and women with bachelor’s degrees in computer science and engineering, the two largest and most male-dominated STEM fields. Data come from the National Science Foundation’s (NSF) Scientists and Engineers Statistical Data System (SESTAT) from 1995 to 2008. Different factors are associated with persistence in STEM jobs among computer science and engineering degree holders. Conditional on receiving a degree in computer science, women are 14 percentage points less likely to work in STEM than their male counterparts. Controlling for demographic and family characteristics did little to change this gender gap. Women with degrees in engineering are approximately 8 percentage points less likely to work in STEM than men, although about half of this gap is explained by observed differences between men and women. We document a widening gender gap in STEM employment in computer science, but this gender gap narrows across college cohorts among those with degrees in engineering. Among recent computer science graduates, the gender gap in STEM employment for white, Hispanic, and black women relative to white men is even larger than for older graduates. Gender and race gaps in STEM employment for recent cohorts of engineering graduates are generally small, though younger Asian women and men no longer have an employment advantage relative to white men. Our results suggest that a one-size-fits-all approach to increasing women’s representation in the most male-dominated STEM fields may not work.","authors":["Sharon Sassler","Katherine Michelmore","Kristin Smith"],"meta":["July 2017","DOI:10.3390/socsci6030069"],"references":["318049277_Motherhood_and_the_Wages_of_Women_in_Professional_Occupations","318047794_The_Opt-Out_Continuation_Education_Work_and_Motherhood_from_1984_to_2012","314490888_Gender_Differences_in_the_Early_Employment_Outcomes_of_STEM_Doctorates","304169165_Solving_the_Equation_The_Variables_for_Women's_Success_in_Engineering_and_Computing","318049006_Explaining_the_Gender_Wage_Gap_in_STEM_Does_Field_Sex_Composition_Matter","318047890_The_Family_Gap_in_Pay_New_Evidence_for_1967_to_2013","316542143_Leaving_science_Occupational_exit_from_scientific_careers","311473376_Unlocking_the_clubhouse_women_in_computing","308832821_The_missing_women_in_STEM_Assessing_gender_differentials_in_the_factors_associated_with_transition_to_first_jobs","307446074_Long_Work_Hours_Part-Time_Work_and_Trends_in_the_Gender_Gap_in_Pay_the_Motherhood_Wage_Penalty_and_the_Fatherhood_Wage_Premium"]}