{"id":"318162758_Microsoft_Academic_is_one_year_old_the_Phoenix_is_ready_to_leave_the_nest","abstract":"We investigate the coverage of Microsoft Academic (MA) just over a year after its re-launch. First, we provide a detailed comparison for the first author’s record across the four major data sources: Google Scholar (GS), MA, Scopus and Web of Science (WoS) and show that for the most important academic publications, journal articles and books, GS and MA display very similar publication and citation coverage, leaving both Scopus and WoS far behind, especially in terms of citation counts. A second, large scale, comparison for 145 academics across the five main disciplinary areas confirms that citation coverage for GS and MA is quite similar for four of the five disciplines. MA citation coverage in the Humanities is still substantially lower than GS coverage, reflecting MA’s lower coverage of non-journal publications. However, we shouldn’t forget that MA coverage for the Humanities still dwarfs coverage for this discipline in Scopus and WoS. It would be desirable for other researchers to verify our findings with different samples before drawing a definitive conclusion about MA coverage. However, based on our current findings we suggest that, only one year after its re-launch, MA is rapidly become the data source of choice; it appears to be combining the comprehensive coverage across disciplines, displayed by GS, with the more structured approach to data presentation, typical of Scopus and WoS. The Phoenix seems to be ready to leave the nest, all set to start its life into an adulthood of research evaluation.","authors":["Anne-Wil Harzing","Satu Alakangas"],"meta":["June 2017Scientometrics","DOI:10.1007/s11192-017-2454-3","Project: Bibliometrics and the Social Sciences"],"references":["315105670_The_coverage_of_Microsoft_Academic_Analyzing_the_publication_output_of_a_university","310739030_Microsoft_Academic_is_the_phoenix_getting_wings","303856491_Microsoft_Academic_Search_a_Phoenix_arisen_from_the_ashes","284812572_Google_Scholar_Scopus_and_the_Web_of_Science_A_longitudinal_and_cross-disciplinary_comparison","259635955_hIa_An_individual_annual_h-index_to_accommodate_disciplinary_and_career_length_differences","257663140_A_preliminary_test_of_Google_Scholar_as_a_source_for_citation_data_A_longitudinal_study_of_Nobel_Prize_winners","313429406_A_preliminary_test_of_Google_Scholar_as_a_source_for_citation_data_A_longitudinal_study_of_Nobel_Prize_winners"]}