{"id":"318120029_RGIFE_A_ranked_guided_iterative_feature_elimination_heuristic_for_the_identification_of_biomarkers","abstract":"Background\nCurrent -omics technologies are able to sense the state of a biological sample in a very wide variety of ways. Given the high dimensionality that typically characterises these data, relevant knowledge is often hidden and hard to identify. Machine learning methods, and particularly feature selection algorithms, have proven very effective over the years at identifying small but relevant subsets of variables from a variety of application domains, including -omics data. Many methods exist with varying trade-off between the size of the identified variable subsets and the predictive power of such subsets. In this paper we focus on an heuristic for the identification of biomarkers called RGIFE: Rank Guided Iterative Feature Elimination. RGIFE is guided in its biomarker identification process by the information extracted from machine learning models and incorporates several mechanisms to ensure that it creates minimal and highly predictive features sets.\n\nResults\nWe compare RGIFE against five well-known feature selection algorithms using both synthetic and real (cancer-related transcriptomics) datasets. First, we assess the ability of the methods to identify relevant and highly predictive features. Then, using a prostate cancer dataset as a case study, we look at the biological relevance of the identified biomarkers.\n\nConclusions\nWe propose RGIFE, a heuristic for the inference of reduced panels of biomarkers that obtains similar predictive performance to widely adopted feature selection methods while selecting significantly fewer feature. Furthermore, focusing on the case study, we show the higher biological relevance of the biomarkers selected by our approach. The RGIFE source code is available at: http://ico2s.org/software/rgife.html.\n\nElectronic supplementary material\nThe online version of this article (doi:10.1186/s12859-017-1729-2) contains supplementary material, which is available to authorized users.","authors":["Nicola Lazzarini","Jaume Bacardit"],"meta":["June 2017BMC Bioinformatics 18(1)","DOI:10.1186/s12859-017-1729-2"],"references":["305386496_Scikit-Iearn_Machine_learning_in_python","274722505_Chimeric_Antigen_Receptor-Engineered_T_Cells_for_the_Treatment_of_Metastatic_Prostate_Cancer","272400189_GenePEN_Analysis_of_network_activity_alterations_in_complex_diseases_via_the_pairwise_elastic_net","271210603_A_machine_learning_heuristic_to_identify_biologically_relevant_and_minimal_biomarker_panels_from_omics_data","267043687_The_Comparative_Toxicogenomics_Database's_10th_Year_Anniversary_Update_2015","330356834_Spectral_Feature_Selection_for_Data_Mining","288906520_Random_forests","277473248_Online_Mendelian_Inheritance_in_Man_OMIM_a_knowledgebase_of_human_genes_and_genetic_disorders","264907682_Feature_extraction_Foundations_and_applications_Papers_from_NIPS_2003_workshop_on_feature_extraction_Whistler_BC_Canada_December_11-13_2003_With_CD-ROM","263509199_A_review_of_microarray_datasets_and_applied_feature_selection_methods"]}