{"id":"318169418_Slowed_Prosaccades_and_Increased_Antisaccade_Errors_As_a_Potential_Behavioral_Biomarker_of_Multiple_System_Atrophy","abstract":"Current clinical diagnostic tools are limited in their ability to accurately differentiate idiopathic Parkinson’s disease (PD) from multiple system atrophy (MSA) and other parkinsonian disorders early in the disease course, but eye movements may stand as objective and sensitive markers of disease differentiation and progression. To assess the use of eye movement performance for uniquely characterizing PD and MSA, subjects diagnosed with PD (N = 21), MSA (N = 11), and age-matched controls (C, N = 20) were tested on the prosaccade and antisaccade tasks using an infrared eye tracker. Twenty of these subjects were retested ~7 months later. Saccade latencies, error rates, and longitudinal changes in saccade latencies were measured. Both PD and MSA patients had greater antisaccade error rates than C subjects, but MSA patients exhibited longer prosaccade latencies than both PD and C patients. With repeated testing, antisaccade latencies improved over time, with benefits in C and PD but not MSA patients. In the prosaccade task, the normal latencies of the PD group show that basic sensorimotor oculomotor function remain intact in mid-stage PD, whereas the impaired latencies of the MSA group suggest additional degeneration earlier in the disease course. Changes in antisaccade latency appeared most sensitive to differences between MSA and PD across short time intervals. Therefore, in these mid-stage patients, increased antisaccade errors combined with slowed prosaccade latencies might serve as a useful marker for early differentiation between PD and MSA, and, antisaccade performance, a measure of MSA progression. Together, our findings suggest that eye movements are promising biomarkers for early differentiation and progression of parkinsonian disorders.","authors":["Sarah H. Brooks","Eliana M. Klier","Stuart Red","Neeti Mehta"],"meta":["June 2017Frontiers in Neurology 8","DOI:10.3389/fneur.2017.00261","Project: Longitudinal RBD biomarker project"],"references":["309541942_Distinguishing_spinocerebellar_ataxia_with_pure_cerebellar_manifestation_from_multiple_system_atrophy_MSA-C_through_saccade_profiles","290039893_On_your_mark_get_set_Brainstem_circuitry_underlying_saccadic_initiation","274140903_Pupil_size_reveals_preparatory_processes_in_the_generation_of_pro-_and_anti-saccades","288604661_Accuracy_of_clinical_diagnosis_of_idiopathic_Parkinson's_disease_A_clinico-pathological_study_of_100_cases","281636315_Is_multiple_system_atrophy_with_cerebellar_ataxia_MSA-C_like_spinocerebellar_ataxia_and_multiple_system_atrophy_with_parkinsonism_MSA-P_like_Parkinson's_disease_-_A_saccade_study_on_pathophysiology","262772138_Saccade_deficits_in_amnestic_mild_cognitive_impairment_resemble_mild_Alzheimer's_disease","257350440_Parkinsonian_Syndromes","234823802_Eye_movements_in_patients_with_neurodegenerative_disorders","232809945_A_perceptual_discrimination_task_results_in_greater_facilitation_of_voluntary_saccades_in_PD_Patients","230722518_Cognition_and_Eye_Movements_Assessment_of_Cerebral_Dysfunction"]}