{"id":"318185893_Exploring_time_factors_in_measuring_the_scientific_impact_of_scholars","abstract":"Taking advantage of the easy access to the rich and massive scholarly data, more and more researchers are focusing on the studies of analyzing and utilizing the scholarly big data. Among them, evaluating the scientific impact of scholars has significant importance. Measuring the scientific impact of scholars can not only provide basis for the applications of academic foundations and awards, but also shed light on the research directions for scholars. Currently, citation based methods and network based metrics are the most commonly used ways to evaluate the scientific impact. However, these approaches ignore several important facts, i.e. the dynamics of citations and the initial qualities of different articles. To alleviate the shortcomings of them, we propose a Time-aware Ranking algorithm (TRank) to evaluate the impact of scholars. Due to scholars’ sustainable supreme concerns of academic innovations, the TRank algorithm gives more credits to the newly published scholarly papers as well as their references according to the representative time functions. Our method also combines the merits of random walk algorithms and heterogeneous network topology, i.e. the mutual influences among different scholarly entities in heterogeneous academic networks. To validate the suitable time function for TRank algorithm and explore its performance, we construct the experiments on two real datasets: (1) Digitial Bibliography and Library Project, and (2) American Physical Society. The experimental results demonstrate that our algorithm outperforms other methods in selecting outstanding scholars and the evaluation results on the overall impact of scholars.","authors":["Jun Zhang","Zhaolong Ning","Xiaomei Bai","Xiangjie Kong"],"meta":["July 2017Scientometrics 112(2)","DOI:10.1007/s11192-017-2458-z","Project: Data-Driven Academic Collaboration Behaviors Analytics"],"references":["316262886_Scientific_collaboration_patterns_vary_with_scholars'_academic_ages","312178100_Big_Scholarly_Data_A_Survey","311337980_Bibliographic_Analysis_of_Nature_Based_on_Twitter_and_Facebook_Altmetrics_Data","307948584_Identifying_Anomalous_Citations_for_Objective_Evaluation_of_Scholarly_Article_Impact","301935668_TAPRank_A_Time-Aware_Author_Ranking_Method_in_Heterogeneous_Networks","289154927_Ranking_scientific_articles_by_exploiting_citations_authors_journals_and_time_information","314374610_Tri-Rank_An_Authority_Ranking_Framework_in_Heterogeneous_Academic_Networks_by_Mutual_Reinforce","307631671_The_pagerank_citation_ranking_Bringing_order_to_the_web","298723894_Evaluating_paper_and_author_ranking_algorithms_using_impact_and_contribution_awards","288933025_MuICE_Mutual_Influence_and_Citation_Exclusivity_Author_Rank"]}