{"id":"318189009_Semantic_relatedness_and_similarity_of_biomedical_terms_Examining_the_effects_of_recency_size_and_section_of_biomedical_publications_on_the_performance_of_word2vec","abstract":"Background\nUnderstanding semantic relatedness and similarity between biomedical terms has a great impact on a variety of applications such as biomedical information retrieval, information extraction, and recommender systems. The objective of this study is to examine word2vec’s ability in deriving semantic relatedness and similarity between biomedical terms from large publication data. Specifically, we focus on the effects of recency, size, and section of biomedical publication data on the performance of word2vec.\n\nMethods\nWe download abstracts of 18,777,129 articles from PubMed and 766,326 full-text articles from PubMed Central (PMC). The datasets are preprocessed and grouped into subsets by recency, size, and section. Word2vec models are trained on these subtests. Cosine similarities between biomedical terms obtained from the word2vec models are compared against reference standards. Performance of models trained on different subsets are compared to examine recency, size, and section effects.\n\nResults\nModels trained on recent datasets did not boost the performance. Models trained on larger datasets identified more pairs of biomedical terms than models trained on smaller datasets in relatedness task (from 368 at the 10% level to 494 at the 100% level) and similarity task (from 374 at the 10% level to 491 at the 100% level). The model trained on abstracts produced results that have higher correlations with the reference standards than the one trained on article bodies (i.e., 0.65 vs. 0.62 in the similarity task and 0.66 vs. 0.59 in the relatedness task). However, the latter identified more pairs of biomedical terms than the former (i.e., 344 vs. 498 in the similarity task and 339 vs. 503 in the relatedness task).\n\nConclusions\nIncreasing the size of dataset does not always enhance the performance. Increasing the size of datasets can result in the identification of more relations of biomedical terms even though it does not guarantee better precision. As summaries of research articles, compared with article bodies, abstracts excel in accuracy but lose in coverage of identifiable relations.","authors":["Yongjun Zhu","Erjia Yan","Fei Wang"],"meta":["July 2017BMC Medical Informatics and Decision Making 17(1)","DOI:10.1186/s12911-017-0498-1"],"references":["306099868_How_to_Train_good_Word_Embeddings_for_Biomedical_NLP","303380743_Identifying_Liver_Cancer_and_Its_Relations_with_Diseases_Drugs_and_Genes_A_Literature-Based_Approach","301449237_Evaluating_distributed_word_representations_for_capturing_semantics_of_biomedical_concepts","284576917_Glove_Global_Vectors_for_Word_Representation","319770439_Efficient_Estimation_of_Word_Representations_in_Vector_Space","308832363_An_Efficient_Method_for_Document_Categorization_Based_on_Word2vec_and_Latent_Semantic_Analysis","307955489_Distributed_representations_of_words_and_phrases_and_their_compositionality","306247934_Corpus_Domain_Effects_on_Distributional_Semantic_Modeling_of_Medical_Terms","304274192_Toward_Word_Embedding_for_Personalized_Information_Retrieval","286758692_A_Study_on_Sentiment_Computing_and_Classification_of_Sina_Weibo_with_Word2vec"]}