{"id":"318172642_An_alternative_approach_to_the_limits_of_predictability_in_human_mobility","abstract":"Next place prediction algorithms are invaluable tools, capable of increasing the efficiency of a wide variety of tasks, ranging from reducing the spreading of diseases to better resource management in areas such as urban planning. In this work we estimate upper and lower limits on the predictability of human mobility to help assess the performance of competing algorithms. We do this using GPS traces from 604 individuals participating in a multi year long experiment, The Copenhagen Networks study. Earlier works, focusing on the prediction of a participant’s whereabouts in the next time bin, have found very high upper limits (> 90 %). We show that these upper limits are highly dependent on the choice of a spatiotemporal scales and mostly reflect stationarity, i.e. the fact that people tend to not move during small changes in time. This leads us to propose an alternative approach, which aims to predict the next location, rather than the location in the next bin. Our approach is independent of the temporal scale and introduces a natural length scale. By removing the effects of stationarity we show that the predictability of the next location is significantly lower (71%) than the predictability of the location in the next bin.","authors":["Edin Lind Ikanovic","Anders Mollgaard"],"meta":["December 2017EPJ Data Science 6(1)","DOI:10.1140/epjds/s13688-017-0107-7"],"references":["304164217_An_analytical_framework_to_nowcast_well-being_using_mobile_phone_data","281590314_Returners_and_explorers_dichotomy_in_human_mobility","274730573_The_Effect_of_Recency_to_Human_Mobility","271855850_Coupling_Human_Mobility_and_Social_Ties","271482221_A_refined_limit_on_the_predictability_of_human_mobility","262319014_Are_call_detail_records_biased_for_sampling_human_mobility_ACM_SIGMOBILE_Mob_Comput_Commun_Rev","262251552_Predictability_of_individuals'_mobility_with_high-resolution_positioning_data","261921306_Measuring_Large-Scale_Social_Networks_with_High_Resolution","257647427_Approaching_the_Limit_of_Predictability_in_Human_Mobility","262723860_The_Impact_of_Spatial_Resolution_and_Representation_on_Human_Mobility_Predictability"]}