{"id":"318152781_Multi-Perspective_Modeling_of_Healthcare_Systems","abstract":"This paper presents a multi-perspective approach to Modeling and Simulation (M&S) of Healthcare Systems (HS) such that different perspectives are defined and integrated together. The interactions between the isolated perspectives are done through dynamic update of models output-to-parameter integration during concurrent simulations. Most often, simulation-based studies of HS in the literature focus on specific problem like allocation of resources, disease propagation, and population dynamics that are studied with constant parameters from their respective experimental frames throughout the simulation. The proposed idea provides a closer representation of the real situation and helps to capture the interactions between seemingly independent concerns - and the effects of such interactions - in simulation results. The article provides a DEVS (Discrete Event System Specification)-based formalization of the loose integration of the different perspectives, an Object-Oriented framework for its realization and a case study as illustration and proof of concept.","authors":["Ignace Djitog","Hamzat Olanrewaju Aliyu","Mamadou Kaba Traoré"],"meta":["June 2017International Journal of Privacy and Health Information Management 5(2):1-20","DOI:10.4018/IJPHIM.2017070101"],"references":["306323658_MARIA_An_agent_driven_simulation_for_a_web_based_serious_game_devoted_to_renew_education_processes_in_health_care","274697790_Towards_Multi-perspective_Modeling_with_BPMN","271482894_An_agent-based_simulation_of_a_Tuberculosis_epidemic_Understanding_the_timing_of_transmission","261122759_SimPHO_An_ontology_for_simulation_modeling_of_population_health","259460294_Simulation-based_Operation_Management_of_Outpatient_Departments_in_University_Hospitals","313601391_Verification_validation_and_accreditation_of_simulation_models","287929241_Methodology_and_modeling_environment_for_simulating_national_health_care","286834480_Improving_emergency_department_processes_using_Coloured_Petri_nets","261148793_Tutorial_on_the_simulation_of_healthcare_systems","257548775_Multi-perspective_modelling_of_complex_phenomena"]}