{"id":"318152978_Enterprise_data_breach_causes_challenges_prevention_and_future_directions_Enterprise_data_breach","abstract":"A data breach is the intentional or inadvertent exposure of confidential information to unauthorized parties. In the digital era, data has become one of the most critical components of an enterprise. Data leakage poses serious threats to organizations, including significant reputational damage and financial losses. As the volume of data is growing exponentially and data breaches are happening more frequently than ever before, detecting and preventing data loss has become one of the most pressing security concerns for enterprises. Despite a plethora of research efforts on safeguarding sensitive information from being leaked, it remains an active research problem. This review helps interested readers to learn about enterprise data leak threats, recent data leak incidents, various state-of-the-art prevention and detection techniques, new challenges, and promising solutions and exciting opportunities. For further resources related to this article, please visit the WIREs website.","authors":["Long Cheng","Fang Liu","Danfeng Daphne Yao"],"meta":["June 2017Wiley Interdisciplinary Reviews: Data Mining and Knowledge Discovery 7(C):e1211","DOI:10.1002/widm.1211"],"references":["305873212_A_Hybrid_Framework_for_Data_Loss_Prevention_and_Detection","288492341_Detecting_insider_threats_in_a_real_corporate_database_of_computer_usage_activity","324525371_A_survey_of_data_leakage_detection_and_prevention_solutions","312775005_MapReduce_Simplified_data_processing_on_large_clusters","312521224_Breaking_the_Target_An_Analysis_of_Target_Data_Breach_and_Lessons_Learned","310235569_Google's_Multilingual_Neural_Machine_Translation_System_Enabling_Zero-Shot_Translation","308831330_Detecting_Data_Semantic_A_Data_Leakage_Prevention_Approach","303948683_Security_Threats_Protecting_the_New_Cyberfrontier","291387283_A_Survey_on_Data_Leakage_Prevention_Systems","287231709_Data_Leak_Detection_as_a_Service"]}