{"id":"318180890_Various_Methods_of_Knowledge_Assessment_during_the_Training_of_IT_Specialists","abstract":"Nowadays requirements for training of qualified IT specialists constantly increase. These issues as well as possible solutions are discussed by both teachers and students on many seminars, forums and conferences. The paper studies different methods of students′ knowledge control and computer systems that are used at the Faculty of Computer Science and Information Technology of Riga Technical University and demonstrates results of computer based students’ knowledge control use. Since 2005, two experiments have been held at the Department of Software Engineering in order to evaluate the efficiency of e-course application. The aim of the study is to determine how the use of e-courses for the control of knowledge affects the quality of education during the course studies given that students do not perform all the control activities. The results have shown that the highest examination results are achieved by the students who have completed all the control activities. It proves the influence of use of e-courses for knowledge control on quality of education.","authors":["Larissa Zaitseva","Natalya Prokofyeva","Sabina Katalnikova"],"meta":["January 2017Applied Computer Systems 21(1)","DOI:10.1515/acss-2017-0011"],"references":["299536755_An_Enhanced_Automated_Test_Item_Creation_Based_on_Learners_Preferred_Concept_Space","290037508_Pedagogical_strategies_and_models_for_e-learning_courses_applying","274567973_Method_for_quality_evaluation_of_digital_learning_tools","317604184_METHODOLOGY_OF_GROUP_WORK_ORGANISATION_FOR_STUDENT_LEARNING_PERFORMANCE_IMPROVEMENT","313506741_Administration_of_knowledge_assessment_at_riga_technical_university","305081922_Using_Interactive_Exercise_in_Mobile_Devices_to_Support_Evidence-based_Teaching_and_Learning","281666574_A_Dynamic_System_to_Generate_Randomly_Relocated_Multiple_Choice_Questions_Using_Ready-made_Arrays","21220353_A_collaborative_teaching_model"]}