{"id":"318137822_Gamifying_informal_learning_activities_using_interactive_displays_an_empirical_investigation_of_students'_learning_and_engagement","abstract":"Interactive displays (IDs) are increasingly employed in informal learning environments, where they are seen as a medium for enhancing students’ creativity, and engagement. Due to the larger space they provide and thus the larger interaction area, they allow for group-work, working in parallel, co-creating artifacts or co-experiencing the interaction in a playful manner. In particular, gaming activities in IDs enhance students’ mental exercise and fantasy and promote students engagement through rewards and collaboration. However, despite the increased prevalence of interactive displays and gamification, we know very little about how designers and instructors can gamify their learning activities by taking advantage of the IDs. In this paper, a framework for developing gamified activities for interactive displays is presented. For the empirical evaluation, pre-post attitudinal surveys and cognitive tests along with photos and observations were recorded and used. The contribution of this article is twofold: 1) an adaptable framework for developing gamified activities on interactive displays (GAID), and 2) the results of a field study where students have been engaged with an interactive display application during an extracurricular activity. By incorporating GAID to a traditional informal learning activity, it is found that students’ knowledge acquisition, satisfaction, enjoyment and intention to participate on similar events in the future are significantly improved.","authors":["Ioannis Leftheriotis","Michail Giannakos","Letizia Jaccheri"],"meta":["May 2017Smart Learning Environments 4(1)","DOI:10.1186/s40561-017-0041-y"],"references":["305877126_Design_and_implement_chords_and_personal_windows_for_multi-user_collaboration_on_a_large_multi-touch_vertical_display","301444931_Interaction_Space_of_Chords_on_a_Vertical_Multi-touch_Screen","282567735_Exploring_Effects_of_Multi-Touch_Tabletop_on_Collaborative_Fraction_Learning_and_the_Relationship_of_Learning_Behavior_and_Interaction_with_Learning_Achievement","281267623_Concept_Model_For_Designing_Engaging_And_Motivating_Games_For_Learning_-_The_Smiley-Model","281062024_How_Space_and_Tool_Availability_Affect_User_Experience_and_Creativity_in_Interactive_Surfaces","313725771_Experimental_research_methods_Handbook_of_research_for_educational_communications_and_technology_A_project_of_the_association_for_educational_communications_and_technology","312454820_Designing_Gamification_in_the_Right_Way","301391870_A_playful_affordances_model_for_gameful_learning","301212086_A_RECIPE_for_Meaningful_Gamification","300882901_From_Game_Characteristics_to_Effective_Learning_Games"]}