{"id":"318170825_How_Future_Depends_on_Past_and_Rare_Events_in_Systems_of_Life","abstract":"The dependence on history of both present and future dynamics of life is a common intuition in biology and in humanities. Historicity will be understood in terms of changes of the space of possibilities (or of “phase space”) as well as by the role of diversity in life’s structural stability and of rare events in history formation. We hint to a rigorous analysis of “path dependence” in terms of invariants and invariance preserving transformations, as it may be found also in physics, while departing from the physico-mathematical analyses. The idea is that the (relative or historicized) invariant traces of the past under organismal or ecosystemic transformations contribute to the understanding (or the “theoretical determination”) of present and future states of affairs. This yields a peculiar form of unpredictability (or randomness) in biology, at the core of novelty formation: the changes of observables and pertinent parameters may depend also on past events. In particular, in relation to the properties of synchronic measurement in physics, the relevance of diachronic measurement in biology is highlighted. This analysis may a fortiori apply to cognitive and historical human dynamics, while allowing to investigate some general properties of historicity in biology.","authors":["Giuseppe Longo"],"meta":["September 2018Foundations of Science 23(6)","DOI:10.1007/s10699-017-9535-x","Project: special issue of Progress in Biophysics and Molecular Biology, 2016  “Principles for a theory of organisms”"],"references":["285385609_In_search_of_principles_for_a_Theory_of_Organisms","284798112_Classical_quantum_and_biological_randomness_as_relative_unpredictability","327765809_An_introduction_to_chaotic_dynamical_systems_Second_Edition","321519438_Jakob_von_Uexkull","320181769_Incomplete_nature_how_mind_emerged_from_matter","313174403_Exaptation_A_Missing_Term_in_the_Science_of_Form","312974393_Evolution_in_four_dimensions","312759665_Reductionism_Emergence_and_Levels_of_Reality","305189968_The_Remembered_Present_A_Biological_Theory_of_Consciousness","287247383_Reductionism_emergence_and_levels_of_reality_The_importance_of_being_borderline","283238266_What_We_Talk_About_When_We_Talk_About_Evolution","281626281_Comparing_Symmetries_in_Models_and_Simulations","281155120_Steps_to_a_science_of_biosemiotics","283995609_Self-Organization_in_Non-Equilibrium_Systems","278763537_The_Noether_theorems_Invariance_and_conservation_laws_in_the_twentieth_century"]}