{"id":"318277028_Efficient_Representation_of_Fully_Many-Body_Localized_Systems_Using_Tensor_Networks","abstract":"We propose a tensor network encoding the set of all eigenstates of a fully many-body localized system in one dimension. Our construction, conceptually based on the ansatz introduced in Phys. Rev.B94, 041116(R) (2016), is built from two layers of unitary matrices which act on blocks of ℓ contiguous sites.We argue that this yields an exponential reduction in computational time and memory requirement as compared to all previous approaches for finding a representation of the complete eigenspectrum of large many-body localized systems with a given accuracy. Concretely, we optimize the unitaries by minimizing the magnitude of the commutator of the approximate integrals of motion and the Hamiltonian, which can be done in a local fashion. This further reduces the computational complexity of the tensor networks arising in the minimization process compared to previous work.We test the accuracy of our method by comparing the approximate energy spectrum to exact diagonalization results for the random-field Heisenberg model on 16 sites. We find that the technique is highly accurate deep in the localized regime and maintains a surprising degree of accuracy in predicting certain local quantities even in the vicinity of the predicted dynamical phase transition. To demonstrate the power of our technique, we study a system of 72 sites, and we are able to see clear signatures of the phase transition. Our work opens a new avenue to study properties of the many-body localization transition in large systems.","authors":["Thorsten B. Wahl","Arijeet Pal","Steven H. Simon"],"meta":["May 2017Physical Review X 7(2)","DOI:10.1103/PhysRevX.7.021018"],"references":["305470994_Critical_Properties_of_the_Many-Body_Localization_Transition","283933366_Universal_Properties_of_Many-Body_Delocalization_Transitions","305983911_Stability_and_instability_towards_delocalization_in_MBL_systems","305683234_Fixed_Points_of_Wegner-Wilson_Flows_and_Many-Body_Localization","305314079_Many-body_localization_and_transition_by_density_matrix_renormalization_group_and_exact_diagonalization_studies","303367259_Universal_Power-Law_Entanglement_Spectrum_in_Many-Body_Localized_Phases","302894210_Diagonalization_and_Many-Body_Localization_for_a_Disordered_Quantum_Spin_Chain","301876902_Exploring_the_many-body_localization_transition_in_two_dimensions","301819534_Many-body_localization_beyond_eigenstates_in_all_dimensions","281576819_Finding_Matrix_Product_State_Representations_of_Highly_Excited_Eigenstates_of_Many-Body_Localized_Hamiltonians"]}