{"id":"318267548_Gendered_Perceptions_of_Cultural_and_Skill_Alignment_in_Technology_Companies","abstract":"Previous research documents how stereotypes discourage young women from choosing and attaining technology jobs. We build off this research and ask whether (and how) stereotypes continue to affect men and women once they enter the technology workforce. Using a novel survey of technical employees from seven Silicon Valley firms and new measures of what we call \"cultural\" and \"skill\" alignment, we show that men are more likely than women to believe they possess the stereotypical traits and skills of a successful tech employee. We find that cultural alignment is especially important: because women are less likely than men to believe they match the cultural image of successful tech workers, they are less likely to identify with the tech profession, less likely to report positive supervisor treatment, and more likely to consider switching career fields. This paper is the first to use unique and independent measures of cultural and skill alignment comparing employees' perceptions of themselves to their perceptions of an ideal successful worker. By allowing cultural and skill alignment to operate separately, we are able to determine which work outcomes are most strongly related to each form of alignment. Our results imply that if we can broaden the cultural image of a successful tech worker, women may be more likely to feel like they belong in technology environments, ultimately increasing their retention in tech jobs.","authors":["A.T. Wynn","S.J. Correll"],"meta":["May 2017","DOI:10.3390/socsci6020045"],"references":["311444491_Gender-Fluid_Geek_Girls_Negotiating_Inequality_Regimes_in_the_Tech_Industry","325671488_Chronic_and_temporarily_activated_causal_uncertainty_beliefs_and_stereotype_usage","313949512_It's_the_Conventional_Thought_That_Counts_How_Third-Order_Inference_Produces_Status_Advantage","299855389_A_Goal_Congruity_Model_of_Role_Entry_Engagement_and_Exit_Understanding_Communal_Goal_Processes_in_STEM_Gender_Gaps","286939636_The_glass_ceiling_in_the_United_States_and_sweden_Lessons_from_the_family-friendly_corner_of_the_world_1970_to_1990","286177402_Framed_By_Gender_How_Gender_Inequality_Persists_in_the_Modern_World","284328492_Why_women_can't_seem_to_break_the_invisible_barrier_that_blocks_them_from_the_top_jobs","274304287_When_White_Is_Just_Alright_How_Immigrants_Redefine_Achievement_and_Reconfigure_the_Ethnoracial_Hierarchy","273590506_Hiring_as_Cultural_Matching_The_Case_of_Elite_Professional_Service_Firms","273526466_Engineers_and_Engineeresses_Self-conceptions_and_the_Development_of_Gendered_Professional_Identities"]}