{"id":"318203036_State_of_the_Art_in_Edge_and_Trail_Bundling_Techniques","abstract":"Bundling techniques provide a visual simplification of a graph drawing or trail set, by spatially grouping similar graph edges or trails. This way, the structure of the visualization becomes simpler and thereby easier to comprehend in terms of assessing relations that are encoded by such paths, such as finding groups of strongly interrelated nodes in a graph, finding connections between spatial regions on a map linked by a number of vehicle trails, or discerning the motion structure of a set of objects by analyzing their paths. In this state of the art report, we aim to improve the understanding of graph and trail bundling via the following main contributions. First, we propose a data-based taxonomy that organizes bundling methods on the type of data they work on (graphs vs trails, which we refer to as paths). Based on a formal definition of path bundling, we propose a generic framework that describes the typical steps of all bundling algorithms in terms of high-level operations and show how existing method classes implement these steps. Next, we propose a description of tasks that bundling aims to address. Finally, we provide a wide set of example applications of bundling techniques and relate these to the above-mentioned taxonomies. Through these contributions, we aim to help both researchers and users to understand the bundling landscape as well as its technicalities.","authors":["Antoine Lhuillier","Christophe Hurter","Alexandru Cristian Telea"],"meta":["June 2017Computer Graphics Forum 36(3):619-645","DOI:10.1111/cgf.13213"],"references":["315705894_Staged_Analysis_From_Evocative_to_Comparative_Visualizations_of_Urban_Mobility","306049395_Towards_Unambiguous_Edge_Bundling_Investigating_Confluent_Drawings_for_Network_Visualization","306049229_Visualizing_the_Hidden_Activity_of_Artificial_Neural_Networks","306048939_Many-to-Many_Geographically-Embedded_Flow_Visualisation_An_Evaluation","344951188_Visualization_Analysis_and_Design","319868412_FFTEB_Edge_bundling_of_huge_graphs_by_the_Fast_Fourier_Transform","318055622_Explaining_Neighborhood_Preservation_for_Multidimensional_Projections","308855171_Texture-based_edge_bundling_A_web-based_approach_for_interactively_visualizing_large_graphs","305996880_Vector_Map_Constrained_Path_Bundling_in_3D_Environments","305397619_Data_Clustering_A_Review"]}