{"id":"318281665_Resenha_do_Livro_E-Infocomunicacao_-_In_PASSARELLI_B_SILVA_A_M_da_RAMOS_F_Org_E-Infocomunicacao_estrategias_e_aplicacoes_Sao_Paulo_Editora_Senac_2014","abstract":"PASSARELLI, Brasilina; RIBEIRO, Fernando; OLIVEIRA, Lídia; MEALHA, ÓSCAR. Identidade conceitual e cruzamentos disciplinares. In: PASSARELLI, B.; SILVA, A. M. da; RAMOS, F. (Org.). E-Infocomunicação: estratégias e aplicações. São Paulo: Editora Senac, 2014. p. 25-47. Esta resenha faz uma apresentação do livro \" e-Infocomunicação: estratégias e aplicações \" , organizado pelos professores Brasilina Passarelli, Armando Malheiro da Silva e Fernando Ramos, de modo que os leitores possam, de um lado, inserir os capítulos no contexto da obra, e, de outro, receber informações sobre a estrutura e o conteúdo do texto em questão dentro da obra, fruto do esforços de autores do Brasil e Portugal. O livro traz a público o conhecimento teórico e aplicado de dois grupos de pesquisa, português e brasileiro das ciências da informação e da comunicação, suas interseções e imersões no contexto da Ciência da Computação (aqui referências apenas como plataformas e meios digitais). Ele é direcionado para aqueles interessados em conhecer o impactos das tecnologias sobre as formas de expressão humana na sociedade contemporânea, bem como a informação como substantivo ou uma coisa como memória, ou a informação como verbo ou processo quando tudo migra para a rede ou nuvem (LOGAN, 2012), motivado pela presença irreversível das TICs (Tecnologias da Informação e Comunicação), ou seja, um novo habitat para estudantes, pesquisadores e pensadores aproximarem-se da necessária revisão epistemológica candente. A coletânea em si reúne textos de refl exões teórico-metodológicas sobre o tema da infocomunicação da equipe brasileira de pesquisa do Núcleo das Novas Tecnologias de Comunicação Aplicadas à Educação \" Escola do Futuro \" da Universidade de São Paulo, que, por mais de 25 anos, trilha o caminho da educação, mediada pelas TICs; e da equipe portuguesa do Centro de Estudos das Tecnologias e Ciências da Comunicação das Universidades do Porto e de Aveiro. Já no Prefácio, Marti ns (2014, p. 9-10) esclarece que a obra \" está organizada em duas partes, sendo que a primeira parte tem um caráter eminentemente teórico, compondo-se de três capítulos \" , que trazem novos paradigmas e fundamentam a obra. A segunda parte, Manifestações e Emergências, traz \" dez capítulos centrados nas plataformas digitais \" , que exploram o uso, achados e revelações das ciências da","authors":["Benedito Medeiros Neto","Neto Antonio Miranda"],"meta":["June 2017","Project: 2-LITERACY NEWS AND SOCIAL MEDIA"],"references":["279497628_A_Escola_do_Futuro_USP_na_construcao_da_cibercultur_no_Brasil_interfaces_impactos_reflexoes","267922181_Netnography_Doing_Ethnographic_Research_Online","263464495_Virtual_Ethnography"]}