{"id":"318227504_Ensemble-based_Community_Detection_in_Multilayer_Networks","abstract":"The problem of community detection in a multilayer network can effectively be addressed by aggregating the community structures separately generated for each network layer, in order to infer a consensus solution for the input network. To this purpose, clustering ensemble methods developed in the data clustering field are naturally of great support. Bringing these methods into a community detection framework would in principle represent a powerful and versatile approach to reach more stable and reliable community structures. Surprisingly, research on consensus community detection is still in its infancy. In this paper, we propose a novel modularity-driven ensemble-based approach to multilayer community detection. A key aspect is that it finds consensus community structures that not only capture prototypical community memberships of nodes, but also preserve the multilayer topology information and optimize the edge connectivity in the consensus via modularity analysis. Empirical evidence obtained on seven real-world multilayer networks sheds light on the effectiveness and efficiency of our proposed modularity-driven ensemble-based approach, which has shown to outperform state-of-the-art multilayer methods in terms of modularity, silhouette of community memberships, and redundancy assessment criteria, and also in terms of execution times.","authors":["Andrea Tagarelli","Alessia Amelio","Francesco Gullo"],"meta":["September 2017Data Mining and Knowledge Discovery 31(3)","DOI:10.1007/s10618-017-0528-8","Project: Social Network and Cluster-based Analysis and Mining"],"references":["303409489_Modularity_in_Complex_Multilayer_Networks_with_Multiple_Aspects_A_Static_Perspective","301957108_On_Clustering_on_Graphs_with_Multiple_Edge_Types","279968935_Community_Detection_in_Multiplex_Networks_using_Locally_Adaptive_Random_Walks","325742135_Multilayer_social_networks","313077909_Finding_consistent_clusters_in_data_partitions","293016200_Incremental_Density-Based_Ensemble_Clustering_over_Evolving_Data_Streams","289988562_Community_Detection_in_Multi-Layer_Graphs_A_Survey","283738615_Resolution_limit_in_community_detection","283686064_Incremental_Semi-Supervised_Clustering_Ensemble_for_High_Dimensional_Data_Clustering","282318087_Ensemble_Online_Clustering_through_Decentralized_Observations","277722480_Link-Prediction_Enhanced_Consensus_Clustering_for_Complex_Networks","276656464_Community_detection_in_multiplex_networks_A_seed-centric_approach","267623513_Community_Detection_in_Multidimensional_Networks","266799619_Multi-threaded_modularity_based_graph_clustering_using_the_multilevel_paradigm","266141424_A_Cooperative_Evolutionary_Approach_to_Learn_Communities_in_Multilayer_Networks"]}