{"id":"318213749_Solving_Solar-Wind_Power_Station_Location_Problem_Using_an_Extended_Weighted_Aggregated_Sum_Product_Assessment_WASPAS_Technique_with_Interval_Neutrosophic_Sets","abstract":"As one of the promising renewable energy resources, solar-wind energy has increasingly become a regional engine in leading the economy and raising competitiveness. Selecting a solar-wind power station location can contribute to efficient utilization of resource and instruct long-term development of socio-economy. Since the selection procedure consists of several location alternatives and many influential criteria factors, the selection can be recognized as a multiple criteria decision-making (MCDM) problem. To better express multiple uncertainty information during the selection procedure, fuzzy set theory is introduced to manage that issue. Interval neutrosophic sets (INSs), which are characterized by truth-membership, indeterminacy-membership and falsity-membership functions in the interval numbers (INs) form, are feasible in modeling more uncertainty of reality. In this paper, a newly extended weighted aggregated sum product assessment (WASPAS) technique, which involves novel three procedures, is utilized to handle MCDM issues under INSs environment. Some modifications are conducted in the extended method comparing with the classical WASPAS method. The most obvious improvement of the extended method relies on that it can generate more realistic criteria weight information by an objective and subjective integrated criteria weight determination method. A case study concerning solar-wind power station location selection is implemented to demonstrate the applicability and rationality of the proposed method in practice. Its validity and feasibility are further verified by a sensitivity analysis and a comparative analysis. These analyses effectively reveal that the extendedWASPAS technique can well match the reality and appropriately handle the solar-wind power station location selection problem.","authors":["Ru-xin Nie","Jianqiang Wang","H.-Y. Zhang"],"meta":["July 2017Symmetry 9(7):106","DOI:10.3390/sym9070106"],"references":["314274286_Garage_location_selection_for_residential_house_by_WASPAS-SVNS_method","324315898_Multicriteria_Methodology_for_Decision_Aiding","318948806_Interval_Neutrosophic_Fuzzy_Stochastic_Multi-Criteria_Decision-making_Methods_Based_on_MYCIN_Certainty_Factor_and_Prospect_Theory","318438281_2-tuple_linguistic_intuitionistic_preference_relation_and_its_application_in_sustainable_location_planning_voting_system","317526405_An_extended_outranking_approach_for_multi-criteria_decision-making_problems_with_linguistic_intuitionistic_fuzzy_numbers","317145852_A_Novel_Multi-criteria_Group_Decision-making_Approach_Using_Simplified_Neutrosophic_Information","316352705_Cross-entropy_measures_of_multi-valued_neutrosophic_sets_and_its_application_in_selecting_middle-level_manager","315828187_A_systematic_review_and_meta-Analysis_of_SWARA_and_WASPAS_methods_Theory_and_applications_with_recent_fuzzy_developments","314240728_Assessment_of_third-party_logistics_providers_using_a_CRITIC-WASPAS_approach_with_interval_type-2_fuzzy_sets","313453995_Site_selection_of_photovoltaic_power_plants_in_a_value_chain_based_on_grey_cumulative_prospect_theory_for_sustainability_A_case_study_in_Northwest_China"]}