{"id":"318255538_Theories_for_influencer_identification_in_complex_networks","abstract":"In social and biological systems, the structural heterogeneity of interaction networks gives rise to the emergence of a small set of influential nodes, or influencers, in a series of dynamical processes. Although much smaller than the entire network, these influencers were observed to be able to shape the collective dynamics of large populations in different contexts. As such, the successful identification of influencers should have profound implications in various real-world spreading dynamics such as viral marketing, epidemic outbreaks and cascading failure. In this chapter, we first summarize the centrality-based approach in finding single influencers in complex networks, and then discuss the more complicated problem of locating multiple influencers from a collective point of view. Progress rooted in collective influence theory, belief-propagation and computer science will be presented. Finally, we present some applications of influencer identification in diverse real-world systems, including online social platforms, scientific publication, brain networks and socioeconomic systems.","authors":["Sen Pei","Flaviano Morone","Hernán A. Makse"],"meta":["July 2017"],"references":["317098402_Inferring_Personal_Economic_Status_from_Social_Network_Location","315705537_Model_of_Brain_Activation_Predicts_the_Neural_Collective_Influence_Map_of_the_Brain","308062589_The_Dynamics_of_Viral_Marketing","303879305_Collective_Influence_of_Multiple_Spreaders_Evaluated_by_Tracing_Real_Information_Flow_in_Large-Scale_Social_Networks","303879108_Efficient_collective_influence_maximization_in_cascading_processes_with_first-order_transitions","304744011_Vital_nodes_identification_in_complex_networks","304374264_Centrality_in_social_networks_Conceptual_clarification","303448700_Leveraging_percolation_theory_to_single_out_influential_spreaders_in_networks","301879410_Immunization_and_Targeted_Destruction_of_Networks_using_Explosive_Percolation","301875261_Identifying_optimal_targets_of_network_attack_by_belief_propagation"]}