{"id":"318223621_Une_etude_didactique_des_praxeologies_de_la_representation_en_perspective_dans_la_geometrie_de_l'espace_en_France_et_au_Viet-Nam","abstract":"La représentation en perspective s'appuie sur plusieurs choix pour l'enseignement : mode de représentation, code d'écriture et de lecture pour combler la perte d'information dans le passage de trois dimensions à deux dimensions, approche pour enseigner le passage d'un objet géométrique de l'espace à un dessin. Notre étude questionne ces choix dans les deux systèmes éducatifs français et vietnamien et leurs effets sur l'apprentissage des élèves. En nous plaçant dans le cadre de la Théorie anthropologique du didactique, nous avons étudié les rapports institutionnel et personnel d'élèves français et vietnamien à l'objet « représentation en perspective ».Pour le premier (rapport institutionnel), nous avons caractérisé les modes de représentation et leurs approches mathématiques, puis nous avons élaboré les praxéologies de références relatives à l'objet « représentation en perspective ». Les technologies et théories de ces praxéologies s'appuient sur les règles de représentation du dessin en perspective (règles de conservation et de non conservation, règles de la troisième dimension, règles pour un dessin « bien informé ») que nous avons explicitées. Ensuite, nous avons utilisé ce modèle de référence pour l'analyse des programmes et des manuels ce qui nous a permis de mettre en évidence les points spécifiques de l'enseignement de la représentation en perspective en France et au Viêt-Nam. Enfin, nous avons formulé des hypothèses sur les règles implicites du contrat didactique, en tant que constituants des technologies des praxéologies personnelles de la représentation en perspective. Ces règles portent sur la troisième dimension et sont spécifiques à certains solides.Pour le deuxième (rapport personnel), nous avons fait passer aux élèves un questionnaire sur un type de tâches concernant la lecture d'un dessin. Ce questionnaire permet de mettre à l'épreuve les hypothèses précédentes et de mettre en lumière les praxéologies personnelles du passage d'un objet géométrique de l'espace à un dessin (technologie/théorie personnelle).","authors":["Tăng Minh Dũng"],"meta":["October 2014"],"references":["323142986_Representation_en_perspective_des_choix_de_l'institution_d'enseignement_de_la_geometrie_dans_l'espace_au_Viet-Nam","281328986_L'analyse_des_manuels_dans_l'approche_anthropologique","279258616_Utilisation_du_modele_praxeologique_de_reference_dans_un_EIAH","292702896_L'analyse_des_pratiques_enseignantes_en_theorie_anthropologique_du_didactique","278812556_Apport_des_recherches_comparatives_internationales_aux_recherches_en_didactique_des_mathematiques_Le_cas_de_la_France_et_du_Viet_Nam","265029804_ARGUMENTER_DEMONTRER_EXPLIQUER_CONTINUITE_OU_RUPTURE_COGNITIVE","237280370_ENSEIGNER_LA_GEOMETRIE_DANS_L'ESPACE","42090704_Le_graphisme_technique_son_histoire_et_son_enseignement"]}