{"id":"318223405_SHADHO_Massively_Scalable_Hardware-Aware_Distributed_Hyperparameter_Optimization","abstract":"Computer science is experiencing an AI renaissance, in which machine learning models are expediting important breakthroughs in academic research and commercial applications. Effective training of these models, however, is not trivial due in part to hyperparameters: user-configured values that parametrize learning models and control their ability to learn from data. Existing hyperparameter optimization methods are highly parallel but make no effort to balance the search across heterogeneous hardware or to prioritize searching high-impact spaces. In this paper, we introduce a framework for massively Scalable Hardware-Aware Distributed Hyperparameter Optimization (SHADHO). Our framework calculates the relative complexity of each search space and monitors performance on the learning task over all trials. These metrics are then used as heuristics to assign hyperparameters to distributed workers based on their hardware. We demonstrate that our framework scales to 1400 heterogeneous cores and that it achieves a factor of 1.6 speedup in the necessary time to find an optimal set of hyperparameters over a standard distributed hyperparameter optimization framework.","authors":["Jeffery Kinnison","Nathaniel Kremer-Herman","Douglas Thain","Walter Scheirer"],"meta":["July 2017","Project: Systems and Algorithmic Development for Hyperparameter Optimization"],"references":["319277370_Multi-level_queue_for_task_scheduling_in_heterogeneous_distributed_computing_system","317984194_Auto-WEKA_20_Automatic_model_selection_and_hyperparameter_optimization_in_WEKA","339440322_Hyperopt_A_Python_Library_for_Optimizing_the_Hyperparameters_of_Machine_Learning_Algorithms","319597666_An_Heuristic_for_Bag-of-Tasks_Scheduling_Problems_with_Resource_Demands_and_Budget_Constraints_to_Minimize_Makespan_on_Hybrid_Clouds","319164270_SMASH_One-Shot_Model_Architecture_Search_through_HyperNetworks","317691697_An_effective_heuristic_for_due-date-constrained_Bag-of-Tasks_scheduling_problem_for_total_cost_minimization_on_hybrid_clouds","312890808_Dermatologist-level_classification_of_skin_cancer_with_deep_neural_networks","312538118_Support-vector_networks","309738632_Neural_Architecture_Search_with_Reinforcement_Learning","305228885_Network_Trimming_A_Data-Driven_Neuron_Pruning_Approach_towards_Efficient_Deep_Architectures"]}