{"id":"318288705_Social_capital_motivations_and_knowledge_sharing_intention_in_health_Q_A_communities","abstract":"Purpose\n\nAlthough health question-and-answer (Q&A) communities have become popular in recent years, only a few communities have successfully retained and motivated their members to share knowledge. This research focuses on the ways by which social capital and motivation influence knowledge sharing intention from the perspectives of health professionals and normal users in health Q&A communities.\n\nDesign/methodology/approach\n\nThe developed theoretical model integrates individual motivation and social capital theories. On the basis of a sample comprising 363 members from health Q&A communities in China, we tested the hypotheses by using structural equation modeling.\n\nFindings\n\nThis study empirically finds that social capital positively affects intrinsic and extrinsic motivations, which then positively influence the intention of health professionals and normal users to share knowledge. Motivations of members fully mediate the effects of social capital on knowledge sharing intention. Specifically, intrinsic motivation influences knowledge sharing intention more for health professionals than for normal users, whereas extrinsic motivation influences knowledge sharing intention more for normal users than for health professionals.\n\nOriginality/value\n\nThis study explores the factors that affect the intentions of sharing knowledge in health Q&A communities by integrating social capital and motivation theories. Individual motivations can then bridge social capital and knowledge sharing intention. The effects of the intrinsic and extrinsic motivations of two user types were further examined and compared. These findings can extend our understanding of the underlying drivers of intention to share knowledge in the context of e-health.","authors":["Xing Zhang","Shan Liu","Xing Chen","Yeming Gong"],"meta":["July 2017Management Decision 55(1):00-00","DOI:10.1108/MD-10-2016-0739","Project: IT- Enabled Intelligent Manufacturing Strategy: Transformation,upgrading, and infrastructure"],"references":["317647173_Knowledge_sharing_motivations_in_online_health_communities_A_comparative_study_of_health_professionals_and_normal_users","317640993_Understanding_consumer_health_information-seeking_behavior_from_the_perspective_of_the_risk_perception_attitude_framework_and_social_support_in_mobile_social_media_websites","316823281_Self-efficacy_the_exercise_of_control","314831800_Interpersonal_trust_and_empathy_online_a_fragile_relationship","313604424_Evaluating_Structural_Equation_Models_with_Unobservable_Variables_and_Measurement_Error","313568457_Extrinsic_and_intrinsic_motivation_to_use_computer_in_the_workplace","312918756_Social_Capital_in_the_Creation_of_Human_Capital","312386835_Effects_of_process_and_outcome_controls_on_business_process_outsourcing_performance_Moderating_roles_of_vendor_and_client_capability_risks","309189086_How_crowdsourcing_risks_affect_performance_an_exploratory_model","309128762_An_empirical_investigation_of_information_sharing_behavior_on_social_commerce_sites"]}