{"id":"318266675_Continuous_Imputation_of_Missing_Values_in_Streams_of_Pattern-Determining_Time_Series","abstract":"Time series data is ubiquitous but often incomplete, e.g., due to sensor failures and transmission errors. Since many applications require complete data, missing values must be imputed before fur- ther data processing is possible. We propose Top-k Case Matching (TKCM) to impute missing values in streams of time series data. TKCM defines for each time series a set of reference time series and exploits similar historical situations in the reference time series for the imputation. A situa- tion is characterized by the anchor point of a pattern that consists of l consecutive measurements over the reference time series. A missing value in a time series s is derived from the values of s at the anchor points of the k most similar patterns. We show that TKCM imputes missing values consistently if the reference time series pattern-determine time series s, i.e., the pattern of length l at time tn is repeated at least k times in the reference time se- ries and the corresponding values of s at the anchor time points are similar to each other. In contrast to previous work, we support time series that are not linearly correlated but, e.g., phase shifted. TKCM is resilient to consecutively missing values, and the accu- racy of the imputed values does not decrease if blocks of values are missing. The results of an exhaustive experimental evaluation using real-world and synthetic data shows that we outperform the state-of-the-art solutions.","authors":["Kevin Wellenzohn","Michael Hanspeter Böhlen","Anton Dignös","Johann Gamper"],"meta":["March 2017","Conference: Proceedings of the 20th International Conference on Extending Database Technology, EDBT 2017"],"references":["300553205_Using_Lowly_Correlated_Time_Series_to_Recover_Missing_Values_in_Time_Series_A_Comparison_Between_SVD_and_CD","269306440_Memory-efficient_centroid_decomposition_for_long_time_series","266659948_A_case_study_in_optimizing_continuous_queries_using_the_Magic_Update_technique","257449476_Comparison_of_missing_value_imputation_methods_in_time_series_The_case_of_Turkish_meteorological_data","308263678_Dimensionality_reduction_for_fast_similarity_search_in_large_time_series_databases","306157547_Time_Series_Analysis_Forecasting_and_Control","289766940_Fast_Shapelets_A_Scalable_Algorithm_for_Discovering_Time_Series_Shapelets","286485682_Dimensionality_Reduction_and_Filtering_on_Time_Series_Sensor_Streams","278747653_REBOM_Recovery_of_blocks_of_missing_values_in_time_series","265443275_Multiple_Imputation_After_18_Years"]}