{"id":"318360449_Faculty_drivers_and_barriers_laying_the_groundwork_for_undergraduate_STEM_education_reform_in_academic_departments","abstract":"Background\nCalls to improve student learning and increase the number of science, technology, engineering, and math (STEM) college and university graduates assert the need for widespread adoption of evidence-based instructional practices in undergraduate STEM courses. For successful reforms to take hold and endure, it is likely that a significant shift in culture around teaching is needed. This study seeks to describe the initial response of faculty to an effort to shift teaching norms, with a long-term goal of altering the culture around teaching and learning in STEM. While the effort was envisioned and led at the institutional level, dialog about the proposed change and actions taken by faculty was emergent and supported within departments. ResultsFaculty identify a variety of barriers to proposed changes in teaching practice; however, faculty also identify a variety of drivers that might help the institution alter teaching and learning norms. Analysis of faculty responses reveals 18 categories of barriers and 15 categories of drivers in faculty responses. Many of the barrier and driver categories were present in each department’s responses; however, the distribution and frequency with which they appear reveals departmental differences that are important for moving forward with strategies to change teaching practice. Conclusions\nAddressing faculty’s barriers to change is essential, but identifying and leveraging faculty’s drivers for the change is potentially equally important in efforts to catalyze changes that are supported or constrained by the local context. Further, the collection of faculty perspectives opens a dialog around the current and future state of teaching, an important step in laying the groundwork for change. Departmental differences in barriers and drivers make clear the importance of “knowing” the local contexts so strategies adopted by departments can be appropriately tailored. Results are discussed in light of what kind of strategies might be employed to effect changes in STEM education.","authors":["Susan E. Shadle","Anthony W. Marker","Brittnee Earl"],"meta":["April 2017International Journal of STEM Education 4(1):8","DOI:10.1186/s40594-017-0062-7"],"references":["305773329_Situated_instructional_coaching_a_case_study_of_faculty_professional_development","296705160_The_Science_Education_Initiative_An_Experiment_in_Scaling_Up_Educational_Improvements_in_a_Research_University","293170063_How_to_use_the_nominal_group_and_Delphi_techniques","345107630_Learner-Centered_Teaching_and_the_Use_of_Technology","317164868_Applying_the_CACAO_change_model_to_promote_systemic_transformation_in_STEM","317164462_Institutional_transformation_in_STEM_Insights_from_change_research_and_the_Keck-PKAL_project","317163476_Key_elements_to_create_and_sustain_educational_innovation_at_a_research-intensive_university","317163194_Culture_policy_and_resources_Barriers_reported_by_faculty_implementing_course_reform","314716665_Stirring_the_Pot_Supporting_and_Challenging_General_Education_Science_Technology_Engineering_and_Mathematics_Faculty_to_Change_Teaching_and_Assessment_Practice","313017285_One_more_time_How_do_you_motivate_employees"]}