{"id":"318316262_Revealing_evolutions_in_dynamical_networks","abstract":"The description of large temporal graphs requires effective methods giving an appropriate mesoscopic partition. Many approaches exist today to detect communities in static graphs. However, many networks are intrinsically dynamical, and need a dynamic mesoscale description, as interpreting them as static networks would cause loss of important information. For example, dynamic processes such as the emergence of new scientific disciplines, their fusion, split or death need a mesoscopic description of the evolving network of scientific articles. There are two straightforward approaches to describe an evolving network using methods developed for static networks. The first finds the community structure of the aggregated network; however, this approach discards most temporal information, and may lead to inappropriate descriptions, as very different dynamic data can give rise to the identical static graphs. The opposite approach closely follows the evolutions and builds networks for successive time slices by selecting the relevant nodes and edges, the mesoscopic structure of each of these slices is found independently and the structures are connected to obtain a temporal description. By using an optimal structural description at each time slice, this method avoids the inertia of the aggregated approach. The inherent fuzziness of the communities leads to noise and artifacts. Here, we present an approach that distinguishes real trends and noise in the mesoscopic description of data using the continuity of social evolutions. To be follow the dynamics, we compute partitions for each time slice, but to avoid transients generated by noise, we modify the community description at time t using the structures found at times t-1 and t+1. We show the relevance of our method on the analysis of a scientific network showing the birth of a new subfield, wavelet analysis.","authors":["Matteo Morini","Patrick Flandrin","Eric Fleury","Tommaso Venturini"],"meta":["July 2017","Project: Temporal Networks"],"references":["311240756_Macrodynamics_of_Economics_A_Bibliometric_History","281896062_Modeling_sequences_and_temporal_networks_with_dynamic_community_structures","270824523_Revealing_latent_factors_of_temporal_networks_for_mesoscale_intervention_in_epidemic_spread","235621958_Phylomemetic_Patterns_in_Science_Evolution-The_Rise_and_Fall_of_Scientific_Fields","233397450_Sequential_detection_of_temporal_communities_by_estrangement_confinement","225035806_Etude_de_la_distribution_florale_dans_une_portion_des_Alpes_et_du_Jura","305780197_Community_detection_in_networks_A_user_guide","280773148_Modern_temporal_network_theory_A_colloquium","268452063_A_unified_view_of_generative_models_for_networks_models_methods_opportunities_and_challenges","227798507_Bibliograpic_Coupling_Between_Scientific_Papers"]}