{"id":"318359849_Gray-box_optimization_and_factorized_distribution_algorithms_where_two_worlds_collide","abstract":"The concept of gray-box optimization, in juxtaposition to black-box optimization, revolves about the idea of exploiting the problem structure to implement more efficient evolutionary algorithms (EAs). Work on factorized distribution algorithms (FDAs), whose factorizations are directly derived from the problem structure, has also contributed to show how exploiting the problem structure produces important gains in the efficiency of EAs. In this paper we analyze the general question of using problem structure in EAs focusing on confronting work done in gray-box optimization with related research accomplished in FDAs. This contrasted analysis helps us to identify, in current studies on the use problem structure in EAs, two distinct analytical characterizations of how these algorithms work. Moreover, we claim that these two characterizations collide and compete at the time of providing a coherent framework to investigate this type of algorithms. To illustrate this claim, we present a contrasted analysis of formalisms, questions, and results produced in FDAs and gray-box optimization. Common underlying principles in the two approaches, which are usually overlooked, are identified and discussed. Besides, an extensive review of previous research related to different uses of the problem structure in EAs is presented. The paper also elaborates on some of the questions that arise when extending the use of problem structure in EAs, such as the question of evolvability, high cardinality of the variables and large definition sets, constrained and multi-objective problems, etc. Finally, emergent approaches that exploit neural models to capture the problem structure are covered.","authors":["Roberto Santana"],"meta":["July 2017","Project: Analysis of evolutionary algorithms"],"references":["317524880_Local_Optima_Networks_of_the_Permutation_Flowshop_Scheduling_Problem_Makespan_vs_Total_Flow_Time","311769709_Neuro-symbolic_EDA-based_Optimisation_using_ILP-enhanced_DBNs","308865771_Structural_coherence_of_problem_and_algorithm_An_analysis_for_EDAs_on_all_2-bit_and_3-bit_problems","318295510_A_square_lattice_probability_model_for_optimising_the_Graph_Partitioning_Problem","317930333_Methods_for_Interpreting_and_Understanding_Deep_Neural_Networks","316956077_Detecting_Statistical_Interactions_from_Neural_Network_Weights","315514546_Deep_Learning_for_Explicitly_Modeling_Optimization_Landscapes","313705486_RM-MEDA_A_regularity_model_based_multiobjective_estimation_of_distribution_algorithm","311251115_Learning_and_exploiting_mixed_variable_dependencies_with_a_model-based_EA","308925682_Efficient_Hill_Climber_for_Multi-Objective_Pseudo-Boolean_Optimization"]}