{"id":"318359958_Community_Discovery_in_Dynamic_Networks_A_Survey","abstract":"Several research studies have shown that complex networks modeling real-world phenomena are characterized by striking properties: (i) they are organized according to community structure, and (ii) their structure evolves with time. Many researchers have worked on methods that can efficiently unveil substructures in complex networks, giving birth to the field of community discovery. A novel and fascinating problem started capturing researcher interest recently: the identification of evolving communities. Dynamic networks can be used to model the evolution of a system: nodes and edges are mutable, and their presence, or absence, deeply impacts the community structure that composes them.\nThis survey aims to present the distinctive features and challenges of dynamic community discovery and propose a classification of published approaches. As a “user manual,” this work organizes state-of-the-art methodologies into a taxonomy, based on their rationale, and their specific instantiation. Given a definition of network dynamics, desired community characteristics, and analytical needs, this survey will support researchers to identify the set of approaches that best fit their needs. The proposed classification could also help researchers choose in which direction to orient their future research.","authors":["Giulio Rossetti","Remy Cazabet"],"meta":["July 2017ACM Computing Surveys 51(2)","DOI:10.1145/3172867","Project: SoBigData"],"references":["331982905_Time-Varying_Graphs_and_Dynamic_Networks","331929461_International_Journal_of_Parallel_Emergent_and_Distributed_Systems_Time-varying_graphs_and_dynamic_networks_Time-varying_graphs_and_dynamic_networks","320344648_Stream_Graphs_and_Link_Streams_for_the_Modeling_of_Interactions_over_Time","318316262_Revealing_evolutions_in_dynamical_networks","318165883_Dynamic_Community_Detection","344125515_Defining_and_evaluating_network_communities_based_on_ground-truth","323239055_RDyn_Graph_benchmark_handling_community_dynamics","319333726_Algorithms_for_graph_partitioning_on_the_planted_partition_model","315543678_A_Novel_Approach_to_Evaluate_Community_Detection_Algorithms_on_Ground_Truth","311344563_Finding_community_structure_in_very_large_networks"]}