{"id":"318315908_Threshold_driven_contagion_on_weighted_networks","abstract":"Weighted networks capture the structure of complex systems where interaction strength is meaningful. This information is essential to a large number of processes, such as threshold dynamics, where link weights reflect the amount of influence that neighbours have in determining a node's behaviour. Despite describing numerous cascading phenomena, such as neural firing or social contagion, threshold models have never been explicitly addressed on weighted networks. We fill this gap by studying a dynamical threshold model over synthetic and real weighted networks with numerical and analytical tools. We show that the time of cascade emergence depends non-monotonously on weight heterogeneities, which accelerate or decelerate the dynamics, and lead to non-trivial parameter spaces for various networks and weight distributions. Our methodology applies to arbitrary binary state processes and link properties, and may prove instrumental in understanding the role of edge heterogeneities in various natural and social phenomena.","authors":["Samuel Unicomb","Gerardo Iñiguez","Márton Karsai"],"meta":["February 2018Scientific Reports 8(1)","DOI:10.1038/s41598-018-21261-9"],"references":["301856837_Local_cascades_induced_global_contagion_How_heterogeneous_thresholds_exogenous_effects_and_unconcerned_behaviour_govern_online_adoption_spreading","321246119_A_simple_model_of_global_cascades_on_random_networks","316799034_Weighted_Network_Analysis","313607570_The_architecture_of_complex_weighted_networks","311154173_The_spread_of_ideas_in_a_weighted_threshold_network","310441433_Resilience_to_contagion_in_financial_networks","307680316_Frontiers_in_Applied_Dynamical_Systems_Reviews_and_Tutorials","307472502_Clustering_determines_the_dynamics_of_complex_contagions_in_multiplex_networks","301243899_Social_contagions_on_weighted_networks","291208484_Neuronal_dynamics_From_single_neurons_to_networks_and_models_of_cognition"]}