{"id":"318355314_Epileptic_seizure_detection_in_EEGs_signals_based_on_the_weighted_visibility_graph_entropy","abstract":"Purpose: \nEpileptic seizure detection has been a complex task for both researchers and specialist in that the assessment of epilepsy is difficult because, electroencephalogram (EEG) signals are chaotic and non-stationary.\n\nMethod: \nThis paper proposes a new method based on weighted visibility graph entropy (WVGE) to identify seizure from EEG signals. Single channel EEG signals are mapped onto the WVGs and WVGEs are calculated from these WVGs. Then some features are extracted of WVGEs and given to classifiers to investigate the performance of these features to classify the brain signals into three groups of normal (healthy), seizure free (interictal) and during a seizure (ictal) groups. Four popular classifiers namely Support Vector Machine (SVM), K-Nearest Neighbor (KNN), Decision tree (DT) and, Naïve Bayes (NB) are used in this work.\n\nResult: \nExperimental results show that the proposed method can classify normal, ictal and interictal groups with a high accuracy of 97%.\n\nConclusions: \nThis high accuracy index, which is obtained using just three features, is higher than those obtained by several previous works in which more nonlinear features were employed. Also, our method is fast and easy and may be helpful in different applications of automatic seizure detection such as online epileptic seizure detection.","authors":["Zeynab Mohammadpoory","Mahda Nasrolahzadeh","Javad Haddadnia"],"meta":["July 2017Seizure 50","DOI:10.1016/j.seizure.2017.07.001","Project: Nonlinear Methods for Prediction of Epileptic Seizures"],"references":["308329605_Weighted_Visibility_Graph_With_Complex_Network_Features_in_the_Detection_of_Epilepsy","304536272_Automated_seizure_detection_systems_and_their_effectiveness_for_each_type_of_seizure","301232812_From_time_series_to_complex_networks_The_visibility_graph","260829228_Epileptogenic_Focus_Detection_in_Intracranial_EEG_based_on_Delay_Permutation_Entropy","257908725_Visibility_graph_analysis_of_geophysical_time_series_Potentials_and_possible_pitfalls","324294820_The_Estimation_of_Probabilities_An_Essay_on_Modern_Bayesian_Methods","314006043_Analyzing_Microarray_Gene_Expression_Data","271330790_The_Detection_of_Epileptic_Seizure_Signals_Based_on_Fuzzy_Entropy","266375743_Automated_diagnosis_of_epileptic_EEG_using_entropies","261204271_Analysing_epileptic_EEGs_with_a_visibility_graph_algorithm"]}