{"id":"318360169_Hippocampus_and_amygdala_radiomic_biomarkers_for_the_study_of_autism_spectrum_disorder","abstract":"Background: \nEmerging evidence suggests the presence of neuroanatomical abnormalities in subjects with autism spectrum disorder (ASD). Identifying anatomical correlates could thus prove useful for the automated diagnosis of ASD. Radiomic analyses based on MRI texture features have shown a great potential for characterizing differences occurring from tissue heterogeneity, and for identifying abnormalities related to these differences. However, only a limited number of studies have investigated the link between image texture and ASD. This paper proposes the study of texture features based on grey level co-occurrence matrix (GLCM) as a means for characterizing differences between ASD and development control (DC) subjects. Our study uses 64 T1-weighted MRI scans acquired from two groups of subjects: 28 typical age range subjects 4-15 years old (14 ASD and 14 DC, age-matched), and 36 non-typical age range subjects 10-24 years old (20 ASD and 16 DC). GLCM matrices are computed from manually labeled hippocampus and amygdala regions, and then encoded as texture features by applying 11 standard Haralick quantifier functions. Significance tests are performed to identify texture differences between ASD and DC subjects. An analysis using SVM and random forest classifiers is then carried out to find the most discriminative features, and use these features for classifying ASD from DC subjects.\n\nResults: \nPreliminary results show that all 11 features derived from the hippocampus (typical and non-typical age) and 4 features extracted from the amygdala (non-typical age) have significantly different distributions in ASD subjects compared to DC subjects, with a significance of p < 0.05 following Holm-Bonferroni correction. Features derived from hippocampal regions also demonstrate high discriminative power for differentiating between ASD and DC subjects, with classifier accuracy of 67.85%, sensitivity of 62.50%, specificity of 71.42%, and the area under the ROC curve (AUC) of 76.80% for age-matched subjects with typical age range.\n\nConclusions: \nResults demonstrate the potential of hippocampal texture features as a biomarker for the diagnosis and characterization of ASD.","authors":["Ahmad Chaddad","Christian Desrosiers","Lama Hassan","Camel Tanougast"],"meta":["July 2017BMC Neuroscience 18(S1)","DOI:10.1186/s12868-017-0373-0","Project: Radiomic analysis for medical imaging "],"references":["315781301_Multi-scale_radiomic_analysis_of_sub-cortical_regions_in_MRI_related_to_autism_gender_and_age","309416827_On_the_brain_structure_heterogeneity_of_autism_Parsing_out_acquisition_site_effects_with_significance-weighted_principal_component_analysis","309348559_Radiomic_analysis_of_multi-contrast_brain_MRI_for_the_prediction_of_survival_in_patients_with_glioblastoma_multiforme","308872216_Radiomics_texture_feature_extraction_for_characterizing_GBM_phenotypes_using_GLCM","304665476_Local_discriminative_characterization_of_MRI_for_Alzheimer's_disease","319151034_Association_between_the_probability_of_autism_spectrum_disorder_and_normative_sex-related_phenotypic_diversity_in_brain_structure","313745385_Association_Between_the_Probability_of_Autism_Spectrum_Disorder_and_Normative_Sex-Related_Phenotypic_Diversity_in_Brain_Structure","313575668_Statistical_and_structural_approaches_to_texture","306211627_Erratum_No_difference_in_hippocampus_volume_detected_on_magnetic_resonance_imaging_in_autistic_individuals_Journal_of_Autism_and_Developmental_Disorders_282_105-110","305811756_Texture_Estimation_for_Abnormal_Tissue_Segmentation_in_Brain_MRI"]}