{"id":"318316859_Instituto_John_Henry_Newman_Seminario_sobre_el_Holocausto_La_Ciencia_y_la_Ingenieria_frente_al_Holocausto","abstract":"Resumen.-En lo que respecta a la ciencia y la ingeniería, el Holocausto no fue una dramática y desafortunada coincidencia entre un régimen autoritario, una sociedad adormecida, un racismo larvado y una ciencia ciega. Todo lo contrario; fue la consecuencia de doscientos años de abandono paulatino de la ética en la investigación científica y de una ingeniería en la que se antepusieron los medios a los fines [1] I. INTRODUCCIÓN Aunque resulta difícil escribir acerca del Holocausto y las ciencias de la computación, debido a su muy incipiente desarrollo en aquellas fechas y a la imposibilidad de ser rigurosos al extrapolar lo que hoy sabemos a situaciones de antaño, es evidente que desde el año 1939 al 1945 se \" trató información \" aunque se hiciera de una forma muy diferente a como hoy conocemos y entendemos estos procesos, su alcance en el espacio y el tiempo y sus consecuencias. Sí puede realizarse, en cambio, una aproximación a la antropología subyacente entonces, y a una Administración y una sociedad en las que se utilizaron técnicas y procedimientos que hoy estarían plenamente sustentados por los modernos sistemas de información. Analizando entonces las bases del pensamiento técnico-científico de aquel tiempo, podremos extraer conclusiones acerca del papel que jugó la ciencia y la ingeniería en el Holocausto. II. ¿HA CAMBIADO ALGO? Utilizando este enfoque podremos llegar a tres conclusiones fundamentales: a) La ausencia de mecanismos morales o éticos que posibilitaron el Holocausto permanecen hoy en día con igual o mayor intensidad. b) La aplicación entonces de las técnicas que conocemos hoy, y con los medios actuales, habría dado lugar a una catástrofe de proporciones muy superiores a las que conocemos, si es que esto fuera posible. c) Cabe entonces preguntarse si no estaremos hoy inmersos en otro tipo de holocausto, silencioso y silenciado, en el que el objetivo no sea el exterminio de una raza o una religión, como entonces, sino la consecución de un orden social que se ajuste al modelo de sociedad perfecta donde lo \" imperfecto \" y lo \" indeseado \" no tenga cabida. III. INVARIANTES DE LA INGENIERÍA Para continuar con nuestro salto en el tiempo y llegar a las conclusiones antedichas, es preciso que primero caractericemos cuáles son las constantes o invariantes que asociamos a la ciencia y la tecnología. A. La tecnología es éticamente ciega Podemos observar, en primer lugar, los criterios de elección racionales de la tecnología. Estos criterios tienden a subordinar el pensamiento y la acción al pragmatismo de la economía y la efectividad. Es decir, la tecnología, con ayuda de la burocracia, es formal y éticamente ciega. Sólo los criterios de éxito, beneficio o fama y renombre son tenidos en cuenta [2]","authors":["Ignacio García-Juliá"],"meta":["May 2017"],"references":[]}