{"id":"318378473_A_journey_around_alpha_and_omega_to_estimate_internal_consistency_reliability","abstract":"Abstract: Based on recent psychometric developments, this paper presents\na conceptual and practical guide for estimating internal consistency reliability\nof measures obtained as item sum or mean. The internal consistency reliability\ncoefficient is presented as a by-product of the measurement model\nunderlying the item responses. A three-step procedure is proposed for its\nestimation, including descriptive data analysis, test of relevant measurement\nmodels, and computation of internal consistency coefficient and its\nconfidence interval. Provided formulas include: (a) Cronbach’s alpha and\nomega coefficients for unidimensional measures with quantitative item response\nscales, (b) coefficients ordinal omega, ordinal alpha and nonlinear\nreliability for unidimensional measures with dichotomic and ordinal items,\n(c) coefficients omega and omega hierarchical for essentially unidimensional\nscales presenting method effects. The procedure is generalized to\nweighted sum measures, multidimensional scales, complex designs with\nmultilevel and/or missing data and to scale development. Four illustrative\nnumerical examples are fully explained and the data and the R syntax are\nprovided.\nKey words: Reliability, internal consistency, coefficient alpha, coefficient\nomega, congeneric measures, tau-equivalent measures, confirmatory factor\nanalysis.","authors":["Carme Viladrich","Ariadna Angulo-Brunet","Eduardo doval"],"meta":["July 2017Anales de Psicologia 33(3):755-782","DOI:10.6018/analesps.33.3.268401","Project: SubscaleExplorer R package"],"references":["314301395_Goodness_of_Fit_in_Item_Factor_Analysis_Effect_of_the_Number_of_Response_Alternatives","313852796_Thanks_Coefficient_Alpha_We'll_Take_it_From_Here","305460201_Testing_the_Difference_Between_Reliability_Coefficients_Alpha_and_Omega","316944265_Program_FACTOR_at_10_Origins_development_and_future_directions","313769917_Cronbachs_a_Revelles_b_and_McDonalds_vH_Their_relationships_with_each_other_and_two_alternative_conceptualizations_of_reliability","312455832_R_A_Language_and_Environment_for_Statistical_Computing","309959836_Assessing_the_Sensitivity_of_Weighted_Least_Squares_Model_Fit_Indexes_to_Local_Dependence_in_Item_Response_Theory_Models","309254394_Psychometric_Theory","307978456_Exploratory_Bifactor_Analysis_The_Schmid-Leiman_Orthogonalization_and_Jennrich-Bentler_Analytic_Rotations","306123880_Specificity-Enhanced_Reliability_Coefficients"]}