{"id":"318324851_Marionette_Meshes_Modelling_free-form_architecture_with_planar_facets","abstract":"We introduce an intuitive method, called Marionette by the authors, for the modelling of free-form architecture with planar facets. The method takes inspiration from descriptive geometry and allows to design complex shapes with one projection and the control of elevation curves. The proposed framework achieves exact facet planarity in real-time, and considerably enriches previous geometrically-constrained methods for free-form architecture. A discussion on the design of quadrilateral meshes with a fixed horizontal projection is first proposed, and the method is then extended to various projections and patterns.\nThe method used is a discrete solution of a continuous problem. This relation between smooth and continuous problem is discussed and shows how to combine the marionette method with modelling tools for smooth surfaces, like NURBS or T-splines. The result is a versatile tool for shape modelling, suited to engineering problems related to free-form architecture.","authors":["Romain Mesnil","Cyril Douthe","Olivier Baverel","Bruno Léger"],"meta":["September 2017International Journal of Space Structures 32(2-3)","DOI:10.1177/0266351117738379","Project: Construction aware design of free form structures"],"references":["315750942_Structural_Morphology_and_Performance_of_Plated_Structures_with_Planar_Quadrilateral_Facets","314206068_Generalised_cyclidic_nets_for_shape_modelling_in_architecture","282461993_From_Folds_to_Structures_a_Review","281245808_Parametric_Self-supporting_Surfaces_via_Direct_Computation_of_Airy_Stress_Functions","281232731_Isogonal_moulding_surfaces_A_family_of_shapes_for_high_node_congruence_in_free-form_structures","273405864_Finding_the_Form_of_an_Irregular_Meshed_Steel_and_Glass_Shell_Based_on_Construction_Constraints","271837719_Interactive_Vault_Design","313402945_Simple_quad_domains_for_field_aligned_mesh_parametrization","285906939_Numerical_optimization","271528799_Architectural_Geometry"]}