{"id":"318304544_Teacher_and_student_views_on_educational_robotics_The_Pan-Hellenic_competition_case","abstract":"The present work is an observational study recording the teachers’ and students’ attitudes from the Pan-Hellenic Educational Robotics (ER) competition. The study investigates the benefits of students’ involvement with robotics regarding skills, motivation and learning. Additionally, it is researched whether ER should be introduced in the compulsory curricula. A qualitative methodology was used with teachers. Although the sample was relatively small, the results were quite homogeneous showing a very high level of engagement and motivation of teachers and students. A mainly quantitative methodology was used to gather data from students. The results show that there are numerous benefits for students: they seem to increase their collaboration, problem solving and creativity skills; understand STEM concepts in computer science and engineering, and gaining programming knowledge in particular. Also, most of the teachers and many of the students consider that ER should be part of the compulsory curriculum. Under certain conditions, ER could be an essential part of the school program, as it can bring together young people from all over the world to learn and develop important 21st century skills.","authors":["Anastasios Theodoropoulos","Angeliki Antoniou","George Lepouras"],"meta":["July 2017Application and Theory of Computer Technology 2(4):1","DOI:10.22496/atct.v2i4.94"],"references":["305197309_Advancing_the_E_in_K-12_STEM_Education","271658384_Students_teach_students_Alternative_teaching_in_Greek_secondary_education","317004115_Educational_Robotics_in_the_service_of_CSE_A_study_based_on_the_PanHellenic_competition","306479430_Einfuhrung_in_die_Test-_und_Fragebogenkonstruktion","300918238_Just_Enough_Programming_for_Eight-years_Olds_Abstract_Only","300918152_Brainstorming_How_to_Use_Lego_Mindstorms_EV3_in_the_Classroom_Abstract_Only","283172966_Evaluating_the_impact_of_educational_robotics_on_pupils'_technical-_and_social-skills_and_science_related_attitudes","280758090_Motivational_and_Self-Regulated_Learning_Components_of_Classroom_Academic_Performance","276555166_From_Scratch_to_Real_Programming","271992251_Impact_of_Robotics_and_Geospatial_Technology_Interventions_on_Youth_STEM_Learning_and_Attitudes"]}