{"id":"318301989_Overview_of_deep_learning_in_medical_imaging","abstract":"The use of machine learning (ML) has been increasing rapidly in the medical imaging field, including computer-aided diagnosis (CAD), radiomics, and medical image analysis. Recently, an ML area called deep learning emerged in the computer vision field and became very popular in many fields. It started from an event in late 2012, when a deep-learning approach based on a convolutional neural network (CNN) won an overwhelming victory in the best-known worldwide computer vision competition, ImageNet Classification. Since then, researchers in virtually all fields, including medical imaging, have started actively participating in the explosively growing field of deep learning. In this paper, the area of deep learning in medical imaging is overviewed, including (1) what was changed in machine learning before and after the introduction of deep learning, (2) what is the source of the power of deep learning, (3) two major deep-learning models: a massive-training artificial neural network (MTANN) and a convolutional neural network (CNN), (4) similarities and differences between the two models, and (5) their applications to medical imaging. This review shows that ML with feature input (or feature-based ML) was dominant before the introduction of deep learning, and that the major and essential difference between ML before and after deep learning is the learning of image data directly without object segmentation or feature extraction; thus, it is the source of the power of deep learning, although the depth of the model is an important attribute. The class of ML with image input (or image-based ML) including deep learning has a long history, but recently gained popularity due to the use of the new terminology, deep learning. There are two major models in this class of ML in medical imaging, MTANN and CNN, which have similarities as well as several differences. In our experience, MTANNs were substantially more efficient in their development, had a higher performance, and required a lesser number of training cases than did CNNs. “Deep learning”, or ML with image input, in medical imaging is an explosively growing, promising field. It is expected that ML with image input will be the mainstream area in the field of medical imaging in the next few decades.","authors":["Kenji Suzuki"],"meta":["July 2017Radiological Physics and Technology 10(7)","DOI:10.1007/s12194-017-0406-5"],"references":["316847176_Machine_Learning_Applications_in_Medical_Image_Analysis","311157810_Mass_detection_in_digital_breast_tomosynthesis_Deep_convolutional_neural_network_with_transfer_learning_from_mammography","321614822_Machine_Learning_in_Medical_Imaging_First_International_Workshop_MLMI_2010_Held_in_Conjunction_with_MICCAI_2010_Beijing_China_September_20_2010_Proceedings","321569494_Machine_Learning_in_Medical_Imaging_4th_International_Workshop_MLMI_2013_Held_in_Conjunction_with_MICCAI_2013_Nagoya_Japan_September_22_2013_Proceedings","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","312512813_Discriminating_Solitary_Cysts_from_Soft_Tissue_Lesions_in_Mammography_using_a_Pretrained_Deep_Convolutional_Neural_Network","310734100_A_Convolutional_Neural_Network_for_Automatic_Characterization_of_Plaque_Composition_in_Carotid_Ultrasound","310048565_Classification_of_teeth_in_cone-beam_CT_using_deep_convolutional_neural_network","309296053_Editorial_of_Special_Issue_Machine_Learning_in_Medical_Imaging","309004297_Comparing_Two_Classes_of_End-to-End_Machine-Learning_Models_in_Lung_Nodule_Detection_and_Classification_MTANNs_vs_CNNs"]}