{"id":"318316966_The_Core_Literature_of_the_Historians_of_Venice","abstract":"Over the past decades, the humanities have been accumulating a growing body of literature at an increasing pace. How does this impact their traditional organization into disciplines and fields of research therein? This article considers history, by examining a citation network among recent monographs on the history of Venice. The resulting network is almost connected, clusters of monographs are identifiable according to specific disciplinary areas (history, history of architecture, and history of arts) or periods of time (middle ages, early modern, and modern history), and a map of the recent trends in the field is sketched. Most notably a set of highly cited works emerges as the core literature of the historians of Venice. This core literature comprises a mix of primary sources, works of reference, and scholarly monographs and is important in keeping the field connected: monographs usually cite a combination of few core and a variety of less well-cited works. Core primary sources and works of reference never age, while core scholarly monographs are replaced at a very slow rate by new ones. The reliance of new publications on the core literature is slowly rising over time, as the field gets increasingly more varied.","authors":["Giovanni Colavizza"],"meta":["July 2017Frontiers in Digital Humanities 4(14)","DOI:10.3389/fdigh.2017.00014","Project: Linked Books"],"references":["314387302_The_references_of_references_a_method_to_enrich_humanities_library_catalogs_with_citation_data","303214441_Gephi_An_Open_Source_Software_for_Exploring_and_Manipulating_Networks","301528888_Beyond_Coverage_Toward_a_Bibliometrics_for_the_Humanities","288890222_Clustering_Scientific_Publications_Based_on_Citation_Relations_A_Systematic_Comparison_of_Different_Methods","313366372_Finding_and_evaluating_community_structure_in_networks_Phys","305780197_Community_detection_in_networks_A_user_guide","301733873_The_Search_for_Landmark_Works_in_English_Literary_Studies_A_Citation_Analysis","298808449_Atlas_of_Science_Visualizing_What_We_Know","288924581_Citation_patterns_in_the_history_of_technology","283738615_Resolution_limit_in_community_detection"]}