{"id":"318398877_Designtaenkning_som_didaktisk_metode_Laeringsdesign_for_teknologisk_forestillingskraft_og_handlekraft","abstract":"Det er et problem, at undervisere, lærerstuderende og elever ikke bliver mødt med tilstrækkelig inspiration, metoder og design til, hvorledes de kan anvende teknologier i undervisningen på måder der understøtter teknologisk forestillingskraft, handlekraft og kritisk-kreativ teknologisk dannelse. Dette forsøger denne artikel at adressere gennem at tilbyde forståelsesramme, struktur, procesmodel og konkret case-eksempel for hvorledes man kan arbejde med designtænkning som didaktisk metode til udformning læringsdesign for kritisk-kreativ teknologisk forestillingskraft og handlekraft. Artiklen kobler designtænkning og læringsdesign sammen til designtænkende læringsdesign for undervisere og læringsdesign for designtænkning for studerende og elever. Disse formater beskrives dernæst som åbne didaktisk-pædagogiske læringsdesign og centrale strukturer, elementer og faser fremstilles og beskrives. Pædagogisk tænkning for kritisk-kreativt medborgerskab inddrages til at underbygge modellens didaktisk-pædagogiske potentiale. Designtænkende læringsdesign for demokratisk dannelse præsenteres dernæst gennem en konkret case Future-Tech-Town Year 2060. I konklusionen udvides perspektivet til uddannelsesarbejde med læringsdesign der sigter mod kritisk-kreative fremtids-skabere med teknologier.","authors":["Rikke Berggreen Paaskesen","Rikke Toft Nørgård"],"meta":["November 2016Tidsskriftet Læring og Medier (LOM) 9(16)","DOI:10.7146/lom.v9i16.24201"],"references":["287507071_Participatory_Academic_Communities_A_transdisciplinary_perspective_on_participation_in_education_beyond_the_institution","281495128_Digital_Fabrication_and_'Making'_in_Education_The_The_Democratization_of_Invention","278305186_The_Art_Science_of_Learning_Design","341950644_Designing_Culture_The_Technological_Imagination_at_Work","319394294_Mindstorms","318494467_Explaining_Creativity_The_Science_of_Human_Innovation","303637283_Digital_literacy_Human_flourishing_and_collective_intelligence_in_a_knowledge_society","302210807_Facilitating_Creativity_in_the_Classroom_Professional_Development_for_K12_Teachers","271509126_The_Rise_of_the_Creative_Class_-_Revisited","271429289_Design_Research_Theoretical_and_Methodological_Issues"]}