{"id":"318356881_Holographic_Microscope_Slide_in_Spatio-Temporal_Imaging_Modality_for_Reliable_3D_Cell_Counting","abstract":"In the current trend of miniaturization and simplification of imaging flow cytometry, Lab-on-a-Chip (LoC) microfluidic devices represent an innovative and cost-effective solution. In this framework, we propose for the first time a novel platform based on the compactness of a Holographic Microscope Slide (HMS) in combination with the new computational features of Space-Time Digital Holography (STDH) that uses a 1D Linear Sensor Array (LSA) instead of a 2D CCD or CMOS cameras to respond to real diagnostics needs. In this LoC platform, computational methods, holography, and microfluidics are intertwined in order to provide an imaging system with a reduced amount of optical components and capable to achieve reliable cell counting even in absence of very accurate flow control. STDH exploits the sample motion into the microfluidic channel to obtain unlimited field-of-view along the flow direction, independently of the magnification factor. Furthermore, numerical refocusing typical of holographic modality allows for the visualization of the entire volume of the channel, thus avoiding loss of information due to the limited depth of focus of standard microscopes. Consequently, we believe this platform could open new perspectives for enhancing the throughput by 3D volumetric imaging.","authors":["Biagio Mandracchia","Vittorio Bianco","Zhe Wang","Martina Mugnano"],"meta":["July 2017Lab on a Chip 17(16)","DOI:10.1039/C7LC00414A","Project: Coherent Light Microscopy: Imaging and Quantitative Phase Analysis a cura di Pietro Ferraro,Adam Wax,Zeev Zalevsky"],"references":["301481409_Investigating_fibroblast_cells_under_safe_and_injurious_blue-light_exposure_by_holographic_microscopy","295900300_Nanomechanics_of_Suspended_Fibroblast_by_Point-like_Anchors_Reveals_Cytoskeleton_Formation","286625371_Forward_electrohydrodynamic_inkjet_printing_of_optical_microlenses_on_microfluidic_devices","270004424_Three-part_differential_of_unlabeled_leukocytes_with_a_compact_lens-free_imaging_flow_cytometer","263706392_A_light-sheet_microscope_compatible_with_mobile_devices_for_label-free_intracellular_imaging_and_biosensing","234492857_Principles_and_techniques_of_digital_holographic_microscopy","315830615_Endowing_a_plain_fluidic_chip_with_micro-optics_a_holographic_microscope_slide","284204758_Recent_advances_in_holographic_3D_particle_tracking","273957678_Optofluidic_holographic_microscopy_with_custom_Field_of_View_by_a_linear_array_detector","273187493_Diagnostic_Tools_for_Lab-on-Chip_Applications_Based_on_Coherent_Imaging_Microscopy","265138256_Flow-Scanning_Optical_Tomography"]}