{"id":"318362119_Prendre_en_compte_l'efficience_alimentaire_des_vaches_allaitantes_dans_les_recommandations_alimentaires_a_travers_la_quantification_de_leurs_depenses_non_productives","abstract":"La vache allaitante utilise près de 70% de l’énergie qu’elle ingère pour son besoin d’entretien. L’importance de cette dépense non productive détermine fortement son efficience d’utilisation de l’énergie. Les nouvelles recommandations alimentaires de l’INRA permettent de mieux quantifier cette dépense non productive afin d’en maîtriser les principaux facteurs de variation. Une base de données a été constituée en regroupant 30 expérimentations, présentant notamment des niveaux alimentaires contrastés (soit au final 101 traitements expérimentaux), menées en stations expérimentales avec des vaches allaitantes. L’Énergie des dépenses non productives (EDNP) exprimée en énergie nette (UFL) a été calculée pour chaque traitement comme la différence entre l’énergie nette ingérée et celles des besoins de lactation, de gestation, et des variations de la masse corporelle par estimation de sa composition chimique. La production de lait moyenne est de 8 kg/jour et prioritaire, quel que soit le niveau alimentaire subit. Estimée par sa composition chimique (respectivement 37 et 21% de lipides), la valeur énergétique de la variation de poids s’élève en moyenne à 2,4 UFL/kg pour les multipares et 1,8 UFL/kg pour les primipares. Les dépenses non productives peuvent s’estimer à partir d’une seule équation dont les variables sont le besoin d’entretien (Eentretien), les conditions d’activité (Iact), la variation de poids (ΔPV) et l’état initial au vêlage (NEC) : EDNP = (Eentretien x Iact) + (0,0073 x ΔPVc x NEC). Le terme interférant (ΔPVc x NEC) traduit les adaptations du métabolisme en situation nutritionnelle contraignante ou pléthorique. Cette quantification nouvelle de l’épargne énergétique associée à la baisse des apports (ou l’inverse) permettra aux éleveurs de mieux gérer l’alimentation de leurs vaches. Les variations de dépenses non productives et leurs nombreux facteurs de variation devront devenir la cible des recherches dans les années à venir.","authors":["Anne De La Torre","Jacques Agabriel"],"meta":["January 2017Productions Animales -Paris- Institut National de la Recherche Agronomique- 30(2):153-164","DOI:10.20870/productions-animales.2017.30.2.2241","Project: Evaluation of non productive functions in beef cows"],"references":["284067442_A_Sceptics_View_Kleiber's_Law_or_the_34_Rule_is_neither_a_Law_nor_a_Rule_but_Rather_an_Empirical_Approximation","333772312_Differenciation_croissance_et_developpement_cellulaire_du_tissu_musculaire","328157145_Production_laitiere_des_vaches_allaitantes_caracterisation_et_etude_des_principaux_facteurs_de_variation","292357799_Revision_du_systeme_des_unites_fourrageres_UF","290861931_Etude_comparative_du_mode_d'expression_du_niveau_d'alimentation_chez_les_ruminants","285464441_Influence_de_l'alimentation_sur_la_composition_du_lait_1_Taux_butyreux_Facteurs_generaux","284267450_Etat_corporel_des_vaches_allaitantes_Charolaises_Signification_utilisation_pratique_et_relations_avec_la_reproduction","284127403_Determination_et_utilisation_de_la_note_d'etat_d'engraissement_en_elevage_allaitant","284127397_Recommandations_alimentaires_pour_les_vaches_allaitantes","274264249_Changes_in_calculated_residual_energy_in_variable_nutritional_environments_An_indirect_approach_to_apprehend_suckling_beef_cows'_robustness"]}