{"id":"318343351_Hypergraph_partitioning_implementation_for_parallelizing_matrix-vector_multiplication_using_CUDA_GPU-based_parallel_computing","abstract":"Calculation of the matrix-vector multiplication in the real-world problems often involves large matrix with arbitrary size. Therefore, parallelization is needed to speed up the calculation process that usually takes a long time. Graph partitioning techniques that have been discussed in the previous studies cannot be used to complete the parallelized calculation of matrix-vector multiplication with arbitrary size. This is due to the assumption of graph partitioning techniques that can only solve the square and symmetric matrix. Hypergraph partitioning techniques will overcome the shortcomings of the graph partitioning technique. This paper addresses the efficient parallelization of matrix-vector multiplication through hypergraph partitioning techniques using CUDA GPU-based parallel computing. CUDA (compute unified device architecture) is a parallel computing platform and programming model that was created by NVIDIA and implemented by the GPU (graphics processing unit).","authors":["Murni","Alhadi Bustamam","Ernastuti Ernastuti","Tri Handhika"],"meta":["July 2017AIP Conference Proceedings 1862(1):030153","DOI:10.1063/1.4991257","Conference: INTERNATIONAL SYMPOSIUM ON CURRENT PROGRESS IN MATHEMATICS AND SCIENCES 2016 (ISCPMS 2016): Proceedings of the 2nd International Symposium on Current Progress in Mathematics and Sciences 2016","Project: PITTA UI 2016"],"references":["234830238_Cuda_by_Example_An_Introduction_to_General-Purpose_GPU_Programming","225233516_Graph_partitioning_and_parallel_solvers_Has_the_emperor_no_clothes","221149632_Decomposing_Irregularly_Sparse_Matrices_for_Parallel_Matrix-Vector_Multiplication","201976941_An_Efficient_Heuristic_Procedure_for_Partitioning_Graphs","3300380_Hypergraph-Partitioning_Based_Decomposition_for_Parallel_Sparse-Matrix_Vector_Multiplication","3042788_Simplicity_Versus_Accuracy_in_a_Model_of_Cache_Coherency_Overhead","3042336_Multiple-way_network_partitioning"]}