{"id":"318354838_The_role_of_behavioral_expectation_in_technology_acceptance_a_CEGEP_case_study","abstract":"It is widely recognized and accepted that behavioral intention is the key direct determinant of technology use and the majority of research continues to promote this practice. Yet the influence of behavioral intention (i.e., an individual’s conscious plan to use a technology) has been called into question more recently, as behavioral intention does not always lead to actual use or in some cases exerts little influence on use (Maruping et al. in J Assoc Inf Sci Technol, 2016. 10.1002/asi.23699; Venkatesh et al. in MIS Q 32(3):483–502, 2008). Maruping et al. (2016) suggested that behavioral expectation (i.e., an individual’s subjective probability to use a technology) deserves to be considered as a potential construct in the technology acceptance process. Alternative immediate antecedents to use have been largely ignored in the educational technology literature, and behavioral expectation presents an alternative to behavioral intention. We attempt to address this need by examining the determinants and effects of behavioral expectation in the context of Collège d’enseignement général et professionnel students’ acceptance of e-learning using a partial least squares approach. We do not find evidence sufficient to distinguish between behavioral intention and expectation in practice. We advance the alternative claim that technology acceptance models must take into consideration situative factors such as modality of beliefs. Given specific situational determiners, factors take on different salience and lead to qualitatively different kinds of beliefs varying in terms of necessity, certainty, and conditionality of belief. We argue that behavioral intention is moderated by contextual variables that influence the relationship between intention and use, and cannot be divided into internal and external factors as even internal factors are influenced by situational determinants. The situative perspective on technology acceptance provides an explanatory mechanism for the high variability in accounts reported in the technology acceptance literature as other situative factors influence the modality of antecedent beliefs and moderate the relationship between intention and use. We call for the study of the moderating effects of belief modalities on use relative to intention.","authors":["Tenzin Doleck","Paul Bazelais","David Lemay"],"meta":["December 2018Journal of Computing in Higher Education 30(2)","DOI:10.1007/s12528-017-9158-9"],"references":["315437737_Investigating_the_predictive_power_of_TAM_A_case_study_of_CEGEP_students'_intentions_to_use_online_learning_technologies","311766005_The_Partial_Least_Squares_Approach_to_Structural_Equation_Modeling","311644620_Structural_equation_modeling_and_regression_guidelines_for_research_practice","311001627_Examining_CEGEP_students'_acceptance_of_computer-based_learning_environments_A_test_of_two_models","308383334_Examining_the_antecedents_of_social_networking_sites_use_among_CEGEP_students","323424582_Statistical_power_analysis_for_the_behavioral_sciences","317061157_Passion_and_Concern_for_Privacy_as_Factors_Affecting_Snapchat_Use_A_Situated_Perspective_on_Technology_Acceptance","313604424_Evaluating_Structural_Equation_Models_with_Unobservable_Variables_and_Measurement_Error","313208577_A_Paradigm_for_Developing_Better_Measures_of_Marketing_Constructs","312984568_Perceived_usefulness_perceived_ease_and_user_acceptance_of_information_technology","298837574_Discourse_analysis_learning_and_social_practice_A_methodological_study","272790646_The_Theory_of_Planned_Behavior","303797324_Going_beyond_intention_Integrating_behavioral_expectation_into_the_unified_theory_of_acceptance_and_use_of_technology","280901098_Processes_of_Opinion_Change","280063056_Five-factor_model_personality_traits_as_predictors_of_perceived_and_actual_usage_of_technology"]}