{"id":"318352095_Optimizing_sentinel_surveillance_in_temporal_network_epidemiology","abstract":"To help health policy makers gain response time to mitigate infectious disease threats, it is essential to have an efficient epidemic surveillance. One common method of disease surveillance is to carefully select nodes (sentinels, or sensors) in the network to report outbreaks. One would like to choose sentinels so that they discover the outbreak as early as possible. The optimal choice of sentinels depends on the network structure. Studies have addressed this problem for static networks, but this is a first step study to explore designing surveillance systems for early detection on temporal networks. This paper is based on the idea that vaccination strategies can serve as a method to identify sentinels. The vaccination problem is a related question that is much more well studied for temporal networks. To assess the ability to detect epidemic outbreaks early, we calculate the time difference (lead time) between the surveillance set and whole population in reaching 1% prevalence. We find that the optimal selection of sentinels depends on both the network’s temporal structures and the infection probability of the disease. We find that, for a mild infectious disease (low infection probability) on a temporal network in relation to potential disease spreading (the Prostitution network), the strategy of selecting latest contacts of random individuals provide the most amount of lead time. And for a more uniform, synthetic network with community structure the strategy of selecting frequent contacts of random individuals provide the most amount of lead time.","authors":["Yuan Bai","Bo Yang","Lijuan Lin","Jose Luis Herrera"],"meta":["July 2017Scientific Reports 7(1)","DOI:10.1038/s41598-017-03868-6","Project: Computational Epidemiology"],"references":["311842246_Cost-efficient_vaccination_protocols_for_network_epidemiology","305345747_Disease_Surveillance_on_Complex_Social_Networks","293825232_Zika_Virus_Associated_with_Microcephaly","259355518_National_and_Local_Influenza_Surveillance_through_Twitter_An_Analysis_of_the_2012-2013_Influenza_Epidemic","321391804_Temporal_Networks","301415446_Location_based_surveillance_for_early_detection_of_contagious_outbreaks","290431474_Zika_Virus_in_the_Americas_-_Yet_Another_Arbovirus_Threat","280773148_Modern_temporal_network_theory_A_colloquium","278617118_France_-_Communicable_disease_surveillance_The_Sentinel_network","257069062_Controlling_Contagion_Processes_in_Activity_Driven_Networks"]}