{"id":"318383109_A_Survey_of_Clustering_Techniques_in_WSNs_and_Consideration_of_the_Challenges_of_Applying_Such_to_5G_IoT_Scenarios","abstract":"Wireless Sensor Network (WSN) systems are typically composed of thousands of sensors that are powered by limited energy resources. To extend the networks longevity, clustering techniques have been introduced to enhance energy efficiency. This paper presents a survey on clustering over the last two decades. Existing protocols are analysed from a Quality of Service (QoS) perspective including three common objectives, those of energy efficiency, reliable communication and latency awareness. This review reveals that QoS aware clustering demands more attention. Furthermore, there is a need to clarify how to improve Quality of user Experience (QoE) through clustering. Understanding the users’ requirements is critical in intelligent systems for the purpose of enabling the ability of supporting diverse scenarios. User awareness or user oriented design is one remaining challenging problem in clustering. In additional, this paper discusses the potential challenges of implementing clustering schemes to Internet of Things (IoT) systems in 5G networks. We indicate that clustering techniques enhanced with smart network selection solutions could highly benefit the QoS and QoE in IoT. As the current studies for WSNs are conducted either in homogeneous or low level heterogeneous networks, they are not ideal or even not able to function in highly dynamic IoT systems with a large range of user scenarios. Moreover, when 5G is finally realised, the problem will become more complex than that in traditional simplified WSNs. Several challenges related to applying clustering techniques to IoT in 5G environment are presented and discussed.","authors":["Lina Xu","Rem W Collier","Gregory O'Hare"],"meta":["July 2017IEEE Internet of Things Journal PP(99):1-1","DOI:10.1109/JIOT.2017.2726014","Project: Quality of User Experience Awareness in Future Network/5G for IoTs"],"references":["318219089_A_Smart_and_Balanced_Energy-Efficient_Multihop_Clustering_Algorithm_Smart-BEEM_for_MIMO_IoT_Systems_in_Future_Networks","314110991_An_SDN-Based_Architecture_for_Next-Generation_Wireless_Networks","311611131_Advanced_metering_infrastructure_backhaul_reliability_improvement_with_cognitive_radio","311488510_Enterprise_LTE_and_WiFi_Interworking_System_and_A_Proposed_Network_Selection_Solution","308826161_Smart_backhauling_subsystem_for_5G_heterogeneous_network","315647444_Bandwidth_Allocation_in_Heterogeneous_Networks_with_Wireless_Backhaul","314383757_Optimal_Backhaul_Resource_Management_in_Wireless-Optical_Converged_Networks","313671238_Adaptive_clustering_for_mobile_wireless_networks","307799925_The_road_to_5G_Providing_the_connectivity_fabric_for_everything","304367736_Fog_and_IoT_An_Overview_of_Research_Opportunities"]}