{"id":"318330560_Exploring_Web_Archives_Through_Temporal_Anchor_Texts","abstract":"Web archives have been instrumental in digital preservation of the Web and provide great opportunity for the study of the societal past and evolution. These Web archives are massive collections, typically in the order of terabytes and petabytes. Due to this, search and exploration of archives has been limited as full-text indexing is both resource and computationally expensive. We identify that for typical access methods to archives, which are navigational and temporal in nature, we do not always require indexing full-text. Instead, meaningful text surrogates like anchor texts already go a long way in providing meaningful solutions and can act as reasonable entry points to exploring Web archives.\nIn this paper, we present a new approach to searching Web archives based on temporal link graphs and corresponding anchor texts. Departing from traditional informational intents, we show how temporal anchor texts can be effective in answering queries beyond purely navigational intents, like finding the most central webpages of an entity in a given time period. We propose indexing methods and a temporal retrieval model based on anchor texts. Further, we discuss several interesting search results as well as one experiment in which we demonstrate how such results can be integrated in a data processing workflow to scale up to thousands of pages. In this analysis we were able to replicate results reported by an offline study, showing that restaurant prices indeed increased in Germany when the Euro was introduced as Europe's currency.","authors":["Helge Holzmann","Wolfgang Nejdl","Avishek Anand"],"meta":["June 2017","DOI:10.1145/3091478.3091500","Conference: the 2017 ACM"],"references":["314092199_A_Manifesto_for_Web_Science_10","311489799_History_by_Diversity_Helping_Historians_search_News_Archives","271728780_Survey_of_Temporal_Information_Retrieval_and_Related_Applications","258998122_Understanding_the_Information_Needs_of_Web_Archive_Users","258223185_A_Survey_of_Web_Archive_Search_Architectures","254464760_Index_maintenance_for_time-travel_text_search","221299305_The_Importance_of_Prior_Probabilities_for_Entry_Page_Search","221299003_The_importance_of_anchor_text_for_ad_hoc_search_revisited","220515682_Temporal_profiles_of_queries","220466848_A_Taxonomy_of_Web_Search","220466492_On_the_value_of_temporal_information_in_information_retrieval","2540010_The_Importance_of_Prior_Probabilities_for_Entry_Page_Search","2518877_Effective_Site_Finding_using_Link_Anchor_Information","312636537_Tempas_Temporal_Archive_Search_Based_on_Tags","305081568_On_the_Applicability_of_Delicious_for_Temporal_Search_on_Web_Archives","303901873_ArchiveSpark_Efficient_Web_Archive_Access_Extraction_and_Derivation","221397248_Lecture_Notes_in_Computer_Science","221301341_Temporal_index_sharding_for_space-time_efficiency_in_archive_search","221298974_Combining_document_representations_for_known-item_search","2865268_Combining_Document_Representations_for_Known-Item_Search"]}