{"id":"318487466_Biodiversity_at_risk_under_future_cropland_expansion_and_intensification","abstract":"Agriculture is the leading driver of biodiversity loss. However, its future impact on biodiversity remains unclear, especially because agricultural intensification is often neglected, and high path-dependency is assumed when forecasting agricultural development—although the past suggests that shock events leading to considerable agricultural change occur frequently. Here, we investigate the possible impacts on biodiversity of pathways of expansion and intensification. Our pathways are not built to reach equivalent production targets, and therefore they should not be directly compared; they instead highlight areas at risk of high biodiversity loss across the entire option space of possible agricultural change.﻿﻿ Based on an extensive database of biodiversity responses to agriculture, we find 30% of species richness and 31% of species abundances potentially lost because of agricultural expansion across the Amazon and Afrotropics. Only 21% of high-risk expansion areas in the Afrotropics overlap with protected areas (compared with 43% of the Neotropics). Areas at risk of biodiversity loss from intensification are found in India, Eastern Europe and the Afromontane region (7% species richness, 13% abundance loss). Many high-risk regions are not adequately covered by conservation prioritization schemes, and have low national conservation spending and high agricultural growth. Considering rising agricultural demand, we highlight areas where timely land-use planning may proactively mitigate biodiversity loss. The authors predict biodiversity loss under potential future agricultural change. Agricultural expansion threatens species richness and abundance worldwide (up to one-third in some areas), often with little overlap between protected areas and high-risk expansion areas.","authors":["Laura Kehoe","Alfredo Romero-Muñoz","Ester Polaina","Lyndon Estes"],"meta":["July 2017Nature Ecology & Evolution 1(8)","DOI:10.1038/s41559-017-0234-3"],"references":["312978497_The_Global_200_Priority_ecoregions_for_global_conservation","306080456_Reconciling_agriculture_carbon_and_biodiversity_in_a_savannah_transformation_frontier","306033806_Biodiversity_The_ravages_of_guns_nets_and_bulldozers","301534315_Exploring_the_biophysical_option_space_for_feeding_the_world_without_deforestation","301273307_Land-use_regime_shifts_An_analytical_framework_and_agenda_for_future_landuse_research","297256313_Biodiversity_scenarios_neglect_future_land-use_changes","294693751_The_Human_Footprint_and_the_Last_of_the_Wild","282288022_The_PREDICTS_database_a_global_database_of_how_local_terrestrial_biodiversity_responds_to_human_impacts","313167979_Hotspots_revisited_earths_biologically_richest_and_most_endangered_terrestrial_ecoregions","306430936_Coarse_climate_change_projections_for_species_living_in_a_fine-scaled_world","281723729_Putting_meaning_back_into_sustainable_intensification","280973135_The_pitfalls_of_ecological_forecasting","279715203_Transitions_in_European_land-management_regimes_between_1800_and_2010","279186338_Global_Patterns_of_agricultural_land-use_intensity_and_vertebrate_diversity","278672527_Closing_Yield_Gaps_How_Sustainable_Can_We_Be"]}