{"id":"318490111_A_fast_clustering_algorithm_for_high-dimensional_data","abstract":"The good features of subset are selected correctly, then, the entire set gives compatible results. For this purpose, feature subset selection is used in the highdimensional data. The proposed Fast Clustering Algorithm is used for selecting the subset of features. A Fast clustering algorithm renders efficiency and effectiveness to discover the subset of features. Fast clustering algorithm work can be done in two steps. The first step is to moving out irrelevant features from the dataset, the irrelevant features are removed by the features having the at value above the predefined threshold. And the second step is to eliminating the redundant features from the dataset, the redundant features is removed by constructing the Minimum Spanning Tree and separate the tree having the edge distance more than its neighbor to form the separate clusters, from the clusters features that are strongly associated with the target features are selected to form the subset of features. The Fast Clustering Algorithm is more efficient than the existing features subset selection algorithms RELIEF, FCBF, INTERACT, CFS, FOCUS.","authors":["R. Elankavi","Kalaiprasath .R","Udaya Kumar"],"meta":["May 2017International Journal of Civil Engineering and Technology 8(5):1220-1227"],"references":["268205127_A_feature_set_measure_based_on_Relief","254306218_An_Extension_on_Statistical_Comparisons_of_Classifiers_over_Multiple_Data_Sets_for_all_Pairwise_Comparisons","248591742_An_extensive_empirical_study_of_feature_selection_metrics_for_text_classification_J","312621023_Filters_Wrappers_and_a_boosting-based_hybrid_for_feature_selection","311450485_Fast_effective_rule_induction","299118730_Consistency_based_feature_selection","286939420_Feature_selection_in_high-dimensional_classification","263031832_Sum_of_Distance_based_Algorithm_for_Clustering_Web_Data","240378128_Oblivious_Decision_Trees_and_Abstract_Cases","235323874_Correlation-Based_Feature_Subset_Selection_for_Machine_Learning"]}