{"id":"318472896_Early_Accurate_Diagnosis_and_Early_Intervention_in_Cerebral_Palsy_Advances_in_Diagnosis_and_Treatment","abstract":"Importance\nCerebral palsy describes the most common physical disability in childhood and occurs in 1 in 500 live births. Historically, the diagnosis has been made between age 12 and 24 months but now can be made before 6 months’ corrected age.\n\nObjectives\nTo systematically review best available evidence for early, accurate diagnosis of cerebral palsy and to summarize best available evidence about cerebral palsy–specific early intervention that should follow early diagnosis to optimize neuroplasticity and function.\n\nEvidence Review\nThis study systematically searched the literature about early diagnosis of cerebral palsy in MEDLINE (1956-2016), EMBASE (1980-2016), CINAHL (1983-2016), and the Cochrane Library (1988-2016) and by hand searching. Search terms included cerebral palsy, diagnosis, detection, prediction, identification, predictive validity, accuracy, sensitivity, and specificity. The study included systematic reviews with or without meta-analyses, criteria of diagnostic accuracy, and evidence-based clinical guidelines. Findings are reported according to the PRISMA statement, and recommendations are reported according to the Appraisal of Guidelines, Research and Evaluation (AGREE) II instrument.\n\nFindings\nSix systematic reviews and 2 evidence-based clinical guidelines met inclusion criteria. All included articles had high methodological Quality Assessment of Diagnostic Accuracy Studies (QUADAS) ratings. In infants, clinical signs and symptoms of cerebral palsy emerge and evolve before age 2 years; therefore, a combination of standardized tools should be used to predict risk in conjunction with clinical history. Before 5 months’ corrected age, the most predictive tools for detecting risk are term-age magnetic resonance imaging (86%-89% sensitivity), the Prechtl Qualitative Assessment of General Movements (98% sensitivity), and the Hammersmith Infant Neurological Examination (90% sensitivity). After 5 months’ corrected age, the most predictive tools for detecting risk are magnetic resonance imaging (86%-89% sensitivity) (where safe and feasible), the Hammersmith Infant Neurological Examination (90% sensitivity), and the Developmental Assessment of Young Children (83% C index). Topography and severity of cerebral palsy are more difficult to ascertain in infancy, and magnetic resonance imaging and the Hammersmith Infant Neurological Examination may be helpful in assisting clinical decisions. In high-income countries, 2 in 3 individuals with cerebral palsy will walk, 3 in 4 will talk, and 1 in 2 will have normal intelligence.\n\nConclusions and Relevance\nEarly diagnosis begins with a medical history and involves using neuroimaging, standardized neurological, and standardized motor assessments that indicate congruent abnormal findings indicative of cerebral palsy. Clinicians should understand the importance of prompt referral to diagnostic-specific early intervention to optimize infant motor and cognitive plasticity, prevent secondary complications, and enhance caregiver well-being.","authors":["Iona Novak","Cathy Morgan","Lars Adde","James Blackman"],"meta":["July 2017JAMA Pediatrics 171(9)","DOI:10.1001/jamapediatrics.2017.1689","Projects: Early Diagnosis of Cerebral PalsySystematic approaches to High Risk Infant Follow-Up"],"references":["311168384_Speech_and_language_interventions_for_infants_aged_0_to_2_years_at_high_risk_for_cerebral_palsy_A_systematic_review","288059054_Parenting_Intervention_Combined_With_Acceptance_and_Commitment_Therapy_A_Trial_With_Families_of_Children_With_Cerebral_Palsy","282245051_Bangladesh_Cerebral_Palsy_Register_BCPR_A_pilot_study_to_develop_a_national_cerebral_palsy_CP_register_with_surveillance_of_children_for_CP","281210610_A_report_The_definition_and_classification_of_cerebral_palsy","281192222_Clinically_relevant_copy_number_variations_detected_in_cerebral_palsy","302393074_Single_blind_randomised_controlled_trial_of_GAME_Goals_-Activity_-_Motor_Enrichment_in_infants_at_high_risk_ofcerebral_palsy","299516979_Effectiveness_of_motor_interventions_in_infants_with_cerebral_palsy_A_systematic_review","290444176_Temporal_trends_in_cerebral_palsy_by_impairment_severity_and_birth_gestation","287256061_Corticospinal_tract_development_and_activity-dependent_plasticity","281489192_Decreasing_prevalence_in_cerebral_palsy_A_multi-site_European_population-based_study_1980_to_2003"]}