{"id":"318487093_Cloud_Computing_Technologies_in_Writing_Class_Factors_Influencing_Students'_Learning_Experience","abstract":"The proposed interactive online group within the cloud computing technologies as a main contribution of this paper provides easy and simple access to the cloud-based Software as a Service (SaaS) system and delivers effective educational tools for students and teacher on after-class group writing assignment activities. Therefore, this study addresses the implementation of the most commonly used cloud applications, Google Docs, in a higher education course. The learning environment integrated Google Docs that students are using to develop and deploy writing assignments in between classes has been subjected to learning experience assessment. Using the questionnaire as an instrument to study participants (n=28), the system has provided an effective learning environment in between classes for the students and the instructor to stay connected. Factors influencing students' learning experience based on cloud applications include frequency of interaction online and students' technology experience. Suggestions to cope with challenges regarding the use of them in higher education including the technical issues are also presented. Educators are therefore encouraged to embrace cloud computing technologies as they design the course curriculum in hoping to effectively enrich students' learning.","authors":["Jenny WANG"],"meta":["July 2017Turkish Online Journal of Distance Education 18(3):197-197","DOI:10.17718/tojde.328954"],"references":["330995429_INTERACTION_IN_ASYNCHRONOUS_WEB-_BASED_LEARNING_ENVIRONMENTS_STRATEGIES_SUPPORTED_BY_EDUCATIONAL_RESEARCH","311343866_Empowering_Mobile_Assisted_Social_E-Learning_Students'_Expectations_and_Perceptions","286692950_Collaboration_factors_and_quality_of_learning_experience_on_interactive_mobile_assisted_social_E-learning","286691833_Cloud_Collaboration_Cloud-based_Instruction_for_Business_Writing_Class","334556470_Cloud_computing_education","313573526_Is_it_Age_or_IT_First_Steps_Toward_Understanding_the_Net_Generation","292413782_Surviving_technology_A_study_of_student_use_of_computer-mediated_communication_to_support_technology_education","288953605_Strategies_in_learning_and_using_a_second_language","287718797_Building_Knowledge_Building_Communities_Consistency_Contact_and_Communication_in_the_Virtual_Classroom","285502190_Understanding_and_empowering_diverse_learners_in_ESL_classroom"]}