{"id":"318494447_The_Second_Self_Computers_and_the_Human_Spirit","abstract":"In The Second Self , Sherry Turkle looks at the computer not as a \"tool,\" but as part of our social and psychological lives; she looks beyond how we use computer games and spreadsheets to explore how the computer affects our awareness of ourselves, of one another, and of our relationship with the world. \"Technology,\" she writes, \"catalyzes changes not only in what we do but in how we think.\" First published in 1984, The Second Self is still essential reading as a primer in the psychology of computation. This twentieth anniversary edition allows us to reconsider two decades of computer culture--to (re)experience what was and is most novel in our new media culture and to view our own contemporary relationship with technology with fresh eyes. Turkle frames this classic work with a new introduction, a new epilogue, and extensive notes added to the original text.\n\nTurkle talks to children, college students, engineers, AI scientists, hackers, and personal computer owners--people confronting machines that seem to think and at the same time suggest a new way for us to think--about human thought, emotion, memory, and understanding. Her interviews reveal that we experience computers as being on the border between inanimate and animate, as both an extension of the self and part of the external world. Their special place betwixt and between traditional categories is part of what makes them compelling and evocative. (In the introduction to this edition, Turkle quotes a PDA user as saying, \"When my Palm crashed, it was like a death. I thought I had lost my mind.\") Why we think of the workings of a machine in psychological terms--how this happens, and what it means for all of us--is the ever more timely subject of The Second Self .","authors":["Sherry Turkle"],"meta":["September 2005","DOI:10.7551/mitpress/6115.001.0001","Edition: Twentieth AnniversaryPublisher: The MIT PressISBN: 0262701111"],"references":[]}