{"id":"318406357_Portable_and_Error-Free_DNA-Based_Data_Storage","abstract":"DNA-based data storage is an emerging nonvolatile memory technology of potentially unprecedented density, durability, and replication efficiency. The basic system implementation steps include synthesizing DNA strings that contain user information and subsequently retrieving them via high-throughput sequencing technologies. Existing architectures enable reading and writing but do not offer random-access and error-free data recovery from low-cost, portable devices, which is crucial for making the storage technology competitive with classical recorders. Here we show for the first time that a portable, random-access platform may be implemented in practice using nanopore sequencers. The novelty of our approach is to design an integrated processing pipeline that encodes data to avoid costly synthesis and sequencing errors, enables random access through addressing, and leverages efficient portable sequencing via new iterative alignment and deletion error-correcting codes. Our work represents the only known random access DNA-based data storage system that uses error-prone nanopore sequencers, while still producing error-free readouts with the highest reported information rate/density. As such, it represents a crucial step towards practical employment of DNA molecules as storage media.","authors":["S. M. Hossein Tabatabaei Yazdi","Ryan Gabrys","Olgica Milenkovic"],"meta":["July 2017Scientific Reports 7(1)","DOI:10.1038/s41598-017-05188-1"],"references":["345898227_DNA_Fountain_enables_a_robust_and_efficient_storage_architecture","301874012_Weakly_Mutually_Uncorrelated_Codes","276211156_A_Rewritable_Random-Access_DNA-Based_Storage_System","305820354_Coding_in_2D_Using_Intentional_Dispersity_to_Enhance_the_Information_Capacity_of_Sequence-Coded_Polymer_Barcodes","305806161_Coding_in_2D_Using_Intentional_Dispersity_to_Enhance_the_Information_Capacity_of_Sequence-Coded_Polymer_Barcodes","305745141_A_DNA-Based_Archival_Storage_System","303919223_A_DNA-Based_Archival_Storage_System","303905278_A_DNA-Based_Archival_Storage_System","303746023_Forward_Error_Correction_for_DNA_Data_Storage","299406656_Nucleic_acid_memory"]}