{"id":"318413213_A_multi-criteria_repairrecovery_framework_for_the_tail_assignment_problem_in_airlines","abstract":"Given a list of flights to be operated, the tail assignment problem aims at assigning each flight to a single airplane. When dealing with tail assignment problems, airline companies are willing to define assignments which minimize not only operation costs, but also robust solutions which are able to \"resist\" perturbations. Even with robust solutions, unexpected events can occur requiring to reconsider the plan under execution. This paper presents a general methodology for repair/recovery in tail assignment problems. When considering repair/recovery solutions for the initial plan under implementation, the decision maker may want to minimize operating costs, but also limit the changes with respect to the initial plan, minimize flights cancellations etc. Hence, we formulate the repair/recovery problem as a multiobjective integer linear programming problem minimizing specified functions for various repair criteria. The choice among the efficient solutions of this multiobjective program is supported by a multi-criteria model based on an additive value function elicited indirectly from past repair/recovery instances. The proposed repair framework applies to tail assignment, and is sufficiently generic to apply to any operations management problem formulated as a compact integer linear program.","authors":["Oumaima Khaled","Michel Minoux","Vincent Mousseau","Xavier Ceugniet"],"meta":["July 2017Journal of Air Transport Management 68","DOI:10.1016/j.jairtraman.2017.10.002"],"references":["317832669_A_compact_optimization_model_for_the_tail_assignment_problem","275623867_A_Lifted_Compact_Formulation_for_the_Daily_Aircraft_Maintenance_Routing_Problem","257822567_The_aircraft_rotation_problem","308601444_A_robust_mathematical_model_and_heuristic_algorithms_for_integrated_aircraft_routing_and_scheduling_with_consideration_of_fleet_assignment_problem","303432344_Multicriteria_Optimization","284662395_Multiple_Criteria_Decision_Analysis_State_of_the_Art_Surveys","272391714_Optimization_of_multi-fleet_aircraft_routing_considering_passenger_transiting_under_airline_disruption","266256557_Multiple_Criteria_Optimization_-_State_of_the_Art_Annotated_Bibliographic_Surveys","265956367_Multicriteria_methodology_for_decision_aiding_Transl_from_the_French_by_Mark_R_McCord","264753625_RL_Keeney_H_Raiffa_Decisions_with_multiple_objectives-preferences_and_value_tradeoffs"]}