{"id":"318434492_Dynamics_of_a_hybrid_morphing_wing_with_active_open_loop_vibrating_trailing_edge_by_Time-Resolved_PIV_and_force_measures","abstract":"A quantitative characterization of the effects obtained by high frequency–low amplitude trailing edge actuation is presented. Particle image velocimetry, pressure and aerodynamic forces measurements are carried out on a wing prototype equipped with shape memory alloys and trailing edge piezoelectric-actuators, allowing simultaneously high deformations (bending) in low frequency and higher-frequency vibrations. The effects of this hybrid morphing on the forces have been quantified and an optimal actuation range has been identified, able to increase lift and decrease drag. The present study focuses more specifically on the effects of the higher-frequency vibrations of the trailing edge region. This actuation allows manipulation of the wake turbulent structures. It has been shown that specific frequency and amplitude ranges achieved by the piezoelectric actuators are able to produce a breakdown of larger coherent eddies by means of upscale energy transfer from smaller-scale eddies in the near wake. It results a thinning of the shear layers and the wake’s width, associated to reduction of the form drag, as well as a reduction of predominant frequency peaks of the shear-layer instability. These effects have been shown by means of frequency domain analysis and Proper Orthogonal Decomposition.","authors":["Gurvan Jodin","Valentina Motta","Johannes Scheller","Eric Duhayon"],"meta":["July 2017Journal of Fluids and Structures","DOI:10.1016/j.jfluidstructs.2017.06.015","Project: Electroactive hybrid morphing, application to Airbus A320 wings."],"references":["305998667_Dimensionnement_d'une_maquette_pour_l'investigation_du_morphing_electroactif_hybride_en_soufflerie_subsonique","305451991_A_Combined_Smart-Materials_Approach_for_Next-Generation_Airfoils","290045938_Self-adaptive_morphing_wing_model_smart_actuated_and_controlled_by_using_a_multiloop_controller_based_on_a_laminar_flow_real_time_optimizer","309324307_Flight_Testing_of_FlexFloil_TM_Adaptive_Compliant_Trailing_Edge","303902274_Discrete_Time_Open-Loop_and_Closed-Loop_Flow_Control_Based_on_Van_der_Pol_Modeling","301336506_Toward_the_bi-modal_camber_morphing_of_large_aircraft_wing_flaps_the_CleanSky_experience","301244414_Distributed_Actuation_and_Control_of_a_Morphing_Wing_Trailing_Edge","284017680_Numerical_study_of_the_turbulent_transonic_interaction_and_transition_location_effect_involving_optimisation_around_a_supercritical_airfoil","282459631_Feedback_flow_control_of_a_low-Re_airfoil_by_flap_actuators","282307709_A_hybrid_morphing_NACA4412_airfoil_concept"]}