{"id":"318431827_Pyomo_-_Optimization_Modeling_in_Python","abstract":"This book provides a complete and comprehensive guide to Pyomo (Python Optimization Modeling Objects) for beginning and advanced modelers, including students at the undergraduate and graduate levels, academic researchers, and practitioners. Using many examples to illustrate the different techniques useful for formulating models, this text beautifully elucidates the breadth of modeling capabilities that are supported by Pyomo and its handling of complex real-world applications. This second edition provides an expanded presentation of Pyomo’s modeling capabilities, providing a broader description of the software that will enable the user to develop and optimize models. Introductory chapters have been revised to extend tutorials; chapters that discuss advanced features now include the new functionalities added to Pyomo since the first edition including generalized disjunctive programming, mathematical programming with equilibrium constraints, and bilevel programming.\nPyomo is an open source software package for formulating and solving large-scale optimization problems. The software extends the modeling approach supported by modern AML (Algebraic Modeling Language) tools. Pyomo is a flexible, extensible, and portable AML that is embedded in Python, a full-featured scripting language. Python is a powerful and dynamic programming language that has a very clear, readable syntax and intuitive object orientation. Pyomo includes Python classes for defining sparse sets, parameters, and variables, which can be used to formulate algebraic expressions that define objectives and constraints. Moreover, Pyomo can be used from a command-line interface and within Python's interactive command environment, which makes it easy to create Pyomo models, apply a variety of optimizers, and examine solutions.\nReview of the first edition:\nDocuments a simple, yet versatile tool for modeling and solving optimization problems. … The book, by Bill Hart, Carl Laird, Jean-Paul Watson, and David Woodruff, is essential to the usability of Pyomo, serving as the Pyomo documentation. … has contents for both an inexperienced user, and a computational operations research expert. … with examples of each of the concepts discussed.\n—Nedialko B. Dimitrov, INFORMS Journal on Computing, Vol. 24 (4), Fall 2012","authors":["William E. Hart","Carl D. Laird","Jean-Paul Watson","David L. Woodruff"],"meta":["January 2017","DOI:10.1007/978-3-319-58821-6","ISBN: 978-3-319-58819-3"],"references":[]}