{"id":"318469859_Complementary_Tools_for_Computational_Thinking_Assessment","abstract":"Computational thinking (CT) is emerging as a key set of problem-solving skills that must be developed by the new generations of digital learners. However, there is still a lack of consensus on a formal CT definition, on how CT should be integrated in educational settings, and specially on how CT can be properly assessed. The latter is an extremely relevant and urgent topic because without reliable and valid assessment tools, CT might lose its potential of making its way into educational curricula. In response, this paper is aimed at presenting the convergent validity of one of the major recent attempts to assess CT from a summative-aptitudinal perspective: the Computational Thinking Test (CTt). The convergent validity of the CTt is studied in middle school Spanish samples with respect to other two CT assessment tools, which are coming from different perspectives: the Bebras Tasks, built from a skill-transfer approach; and Dr. Scratch, an automated tool designed from a formative-iterative approach. Our results show statistically significant, positive and moderately intense, correlations between the CTt and a selected set of Bebras Tasks (r=0.52); and between the CTt and Dr. Scratch (predictive value r=0.44; concurrent value r=0.53). These results support the statement that CTt is partially convergent with Bebras Tasks and with Dr. Scratch. Finally, we discuss if these three tools are complementary and may be combined in middle school.","authors":["Marcos Román-González","Jesús Moreno-León","Gregorio Robles"],"meta":["July 2017","Conference: International Conference on Computational Thinking Education 2017At: Hong-Kong","Project: Full validation of the Computational Thinking Test (CTt)"],"references":["312039564_Developing_Computational_Thinking_in_Compulsory_Education_Implications_for_policy_and_practice","311507849_Does_computational_thinking_correlate_with_personality_the_non-cognitive_side_of_computational_thinking","303943002_A_Framework_for_Computational_Thinking_Based_on_a_Systematic_Research_Review","291411712_Informatics_Education_based_on_Solving_Attractive_Tasks_through_a_Contest","290391277_COMPUTATIONAL_THINKING_TEST_DESIGN_GUIDELINES_AND_CONTENT_VALIDATION","312253565_A_validity_and_reliability_study_of_the_Computational_Thinking_Scales_CTS","309916565_Ninja_code_village_for_scratch_Function_samplesfunction_analyser_and_automatic_assessment_of_computational_thinking_concepts","308654282_Which_cognitive_abilities_underlie_computational_thinking_Criterion_validity_of_the_Computational_Thinking_Test","299577207_Assessing_Problem-Solving_Process_At_Scale","298972479_Learning_Computer_Science_Concepts_with_Scratch"]}