{"id":"318487927_Predicting_multicellular_function_through_multi-layer_tissue_networks","abstract":"Motivation: \nUnderstanding functions of proteins in specific human tissues is essential for insights into disease diagnostics and therapeutics, yet prediction of tissue-specific cellular function remains a critical challenge for biomedicine.\n\nResults: \nHere, we present OhmNet , a hierarchy-aware unsupervised node feature learning approach for multi-layer networks. We build a multi-layer network, where each layer represents molecular interactions in a different human tissue. OhmNet then automatically learns a mapping of proteins, represented as nodes, to a neural embedding-based low-dimensional space of features. OhmNet encourages sharing of similar features among proteins with similar network neighborhoods and among proteins activated in similar tissues. The algorithm generalizes prior work, which generally ignores relationships between tissues, by modeling tissue organization with a rich multiscale tissue hierarchy. We use OhmNet to study multicellular function in a multi-layer protein interaction network of 107 human tissues. In 48 tissues with known tissue-specific cellular functions, OhmNet provides more accurate predictions of cellular function than alternative approaches, and also generates more accurate hypotheses about tissue-specific protein actions. We show that taking into account the tissue hierarchy leads to improved predictive power. Remarkably, we also demonstrate that it is possible to leverage the tissue hierarchy in order to effectively transfer cellular functions to a functionally uncharacterized tissue. Overall, OhmNet moves from flat networks to multiscale models able to predict a range of phenotypes spanning cellular subsystems.\n\nAvailability and implementation: \nSource code and datasets are available at http://snap.stanford.edu/ohmnet .\n\nContact: \njure@cs.stanford.edu.","authors":["Marinka Zitnik","Jure Leskovec"],"meta":["July 2017Bioinformatics 33(14)","DOI:10.1093/bioinformatics/btx252"],"references":["309229129_Tissue_Specificity_of_Human_Disease_Module","307469293_The_physics_of_spreading_processes_in_multilayer_networks","306096730_Extensive_Complementarity_between_Gene_Function_Prediction_Methods","295895047_Translation_of_Genotype_to_Phenotype_by_a_Hierarchy_of_Cell_Subsystems","319770439_Efficient_Estimation_of_Word_Representations_in_Vector_Space","310824980_Structural_Deep_Network_Embedding","308421631_A_global_genetic_interaction_network_maps_a_wiring_diagram_of_cellular_function","308388914_Tissue-specific_pathway_association_analysis_using_genome-wide_association_study_summaries","305997704_node2vec_Scalable_Feature_Learning_for_Networks","305988745_Network_biology_concepts_in_complex_disease_comorbidities"]}