{"id":"318448194_Classification_of_Fingerprint_Images_with_the_aid_of_Morphological_Operation_and_AGNN_Classifier","abstract":"The uniqueness, public recognition, firmness, and their least jeopardy of fingerprints made an extensively and proficiently utilized personal authentication metrics. Fingerprint technology is a biometric method that is used to recognize persons on the basis of their physical traits. These physical forms comprise of ridges and valleys prevailing on the surface of fingertips. Fingerprint images are direction-oriented pattern fashioned using ridges and valleys. The reputation of the fingerprint image regulates the durability of a fingerprint authentication scheme. For enhancing the restrictions of prevailing fingerprint image augmentation approaches we have proposed an effectual method to pact with various fingerprint images. The proposed methodology alienated into three modules. Primarily, the fingerprint image is endangered to denoising procedure where Wave atom transform is used. Once this procedure is accomplished the image augmentation is achieved for improving the classification rate. The morphological operation is used in our proposed technique in order to augment the image. The morphological operators such as dilation and area opening are used here for improvement. Finally the ordering of fingerprint image is done. Adaptive genetic neural network (AGNN) is used for classification of images efficiently.","authors":["Subba Reddy Borra","Jagadeeswar Reddy","Edara Reddy"],"meta":["July 2017Applied Computing and Informatics 14(2)","DOI:10.1016/j.aci.2017.07.001"],"references":["304189718_Some_challenges_in_forensic_fingerprint_classification_and_interpretation","317245137_Non-reference_image_quality_assessment_for_biometric_presentation_attack_detection","308851201_Fingerprint_Based_Gender_Classification_Using_DWT_Transform","308819780_A_comparative_study_on_the_swarm_intelligence_based_feature_selection_approaches_for_fake_and_real_fingerprint_classification","308010641_Robust_feature_extraction_and_salvage_schemes_for_finger_texturebased_biometrics","304190732_Human_authentication_with_finger_textures_based_on_image_feature_enhancement","277775657_Classification_of_Fingerprint_Images_Using_Neural_Networks_Technique","272415102_Detection_and_Rectification_of_Distorted_Fingerprints","271463864_Moment_based_wavelet_filter_design_for_fingerprint_classification","269630204_Enhanced_Ridge_Structure_for_Improving_Fingerprint_Image_Quality_Based_on_a_Wavelet_Domain"]}