{"id":"318460410_Sedentary_Behavior_Research_Network_SBRN_-_Terminology_Consensus_Project_process_and_outcome","abstract":"Background The prominence of sedentary behavior research in health science has grown rapidly. With this growth there is increasing urgency for clear, common and accepted terminology and definitions. Such standardization is difficult to achieve, especially across multi-disciplinary researchers, practitioners, and industries. The Sedentary Behavior Research Network (SBRN) undertook a Terminology Consensus Project to address this need. Method First, a literature review was completed to identify key terms in sedentary behavior research. These key terms were then reviewed and modified by a Steering Committee formed by SBRN. Next, SBRN members were invited to contribute to this project and interested participants reviewed and provided feedback on the proposed list of terms and draft definitions through an online survey. Finally, a conceptual model and consensus definitions (including caveats and examples for all age groups and functional abilities) were finalized based on the feedback received from the 87 SBRN member participants who responded to the original invitation and survey. Results Consensus definitions for the terms physical inactivity, stationary behavior, sedentary behavior, standing, screen time, non-screen-based sedentary time, sitting, reclining, lying, sedentary behavior pattern, as well as how the terms bouts, breaks, and interruptions should be used in this context are provided. Conclusion It is hoped that the definitions resulting from this comprehensive, transparent, and broad-based participatory process will result in standardized terminology that is widely supported and adopted, thereby advancing future research, interventions, policies, and practices related to sedentary behaviors.","authors":["MS Tremblay","Salomé Aubert","Joel D Barnes","TJ Saunders"],"meta":["June 2017International Journal of Behavioral Nutrition and Physical Activity 14(1)","Projects: Upstream TeamSBRN Terminology Consensus Project and Outcome"],"references":["307524264_Systematic_Review_of_Childhood_Sedentary_Behavior_Questionnaires_What_do_We_Know_and_What_is_Next","306125576_Sedentary_Behavior_and_Cardiovascular_Morbidity_and_Mortality_A_Science_Advisory_From_the_American_Heart_Association","305361645_The_SOS-framework_Systems_of_Sedentary_behaviours_an_international_transdisciplinary_consensus_framework_for_the_study_of_determinants_research_priorities_and_policy_on_sedentary_behaviour_across_the_","313196039_Physical_activity_and_sedentary_behaviours_in_youth_Issues_and_controversies","311481266_Challenging_the_Dual-Hinge_Approach_to_Intervening_on_Sedentary_Behavior","305718410_Does_physical_activity_attenuate_or_even_eliminate_the_detrimental_association_of_sitting_time_with_mortality_A_harmonised_meta-analysis_of_data_from_more_than_1_million_men_and_women","305485901_Heterogeneity_of_Muscle_Activity_during_Sedentary_Behavior","305074347_Energy_Expenditure_of_Common_Sedentary_Activities_in_Youth","305074275_Energy_Expenditure_of_Daily_Living_Activities_in_3-_to_6-Year-Old_Children","305074102_Energy_Cost_of_Activities_in_Preschool-Aged_Children"]}