{"id":"318412374_Multi-Version_Coding_-_An_Information-Theoretic_Perspective_of_Consistent_Distributed_Storage","abstract":"In applications of distributed storage systems to distributed computing and implementation of key-value stores, the following property, usually referred to as consistency in computer science and engineering, is an important requirement: as the data stored changes, the latest version of the data must be accessible to a client that connects to the storage system. Motivated by technological trends where key-value stores are increasingly implemented in highspeed memory, an information theoretic formulation called multi-version coding is introduced in the paper, in order to understand and minimize the memory footprint, or storage overhead, of consistent distributed storage. Multi-version coding is characterized by ν totally ordered versions of a message, and a storage system with n servers. At each server, values corresponding to an arbitrary subset of the ν versions are received and encoded. For any subset of c servers in the storage system, the value corresponding to the latest common version, or a later version as per the total ordering, among the c servers is required to be decodable. An achievable multi-version code construction via linear coding and a converse result that shows that the construction is asymptotically tight when ν|(c – 1), are provided. An implication of the converse is that there is an inevitable price, in terms of storage cost, to ensure consistency in distributed storage systems.","authors":["Zhiying Wang","Viveck Cadambe"],"meta":["July 2017IEEE Transactions on Information Theory PP(99):1-1","DOI:10.1109/TIT.2017.2725273"],"references":["319209909_Multi-version_Coding_for_Consistent_Distributed_Storage_of_Correlated_Data_Updates","314237986_A_Layered_Architecture_for_Erasure-Coded_Consistent_Distributed_Storage","305525325_Storage-Optimized_Data-Atomic_Algorithms_for_Handling_Erasures_and_Errors_in_Distributed_Storage_Systems","301896026_Communication_Cost_for_Updating_Linear_Functions_When_Message_Updates_are_Sparse_Connections_to_Maximally_Recoverable_Codes","321696733_Storage-Optimized_Data-Atomic_Algorithms_for_Handling_Erasures_and_Errors_in_Distributed_Storage_Systems","319889700_Efficient_and_Available_In-Memory_KV-Store_with_Hybrid_Erasure_Coding_and_Replication","313562977_Sharing_memory_robustly_in_message_passing_systems","309405634_Consistent_Distributed_Storage_of_Correlated_Data_Updates_Via_Multi-version_Coding","308672558_Content-type_coding","305660786_Information-Theoretic_Lower_Bounds_on_the_Storage_Cost_of_Shared_Memory_Emulation"]}