{"id":"318457365_Use_of_digital_game_based_learning_and_gamification_in_secondary_school_science_The_effect_on_student_engagement_learning_and_gender_difference","abstract":"This study aimed to identify the impact of a game based learning (GBL) application using computer technologies on student engagement in secondary school science classrooms. The literature reveals that conventional Science teaching techniques (teacher-centered lecture and teaching), which foster rote learning among students, are one of the major concerns in Pakistan Education system. This leads to student disengagement in science lessons eventually resulting in student absenteeism and dropouts from the schools. This study consisted of five stages: (1) examining the impact of Digital Game-Based Learning (DGBL) and gamification on engagement, learning and gender difference, and literature related to using DGBL models for instructional design; (2) planning learning activities and developing a GBL application based on a specific content in Science; (3) conducting an intervention with a sample of 72 participants of 8th grade (aged 12–15) in a low cost private school of Pakistan following quasi-experimental research framework; (4) observing behaviour and emotions of the participants during science lessons; (5) conducting pre and post tests to assess the learning outcomes of participants followed by focus groups discussion. Analysis from Friedman test, Mann-Whitney U test, and Wilcoxon Signed Rank test show that the GBL application has a positive influence on student engagement. However, GBL application was not equally effective for all students since girls outperformed boys in terms of engagement and learning outcomes. This study gives insights into the development of better educational games to promote student learning.","authors":["Amna Khan","Farzana Ahmad","Muhammad Muddassir Malik"],"meta":["November 2017Education and Information Technologies 22(11)","DOI:10.1007/s10639-017-9622-1"],"references":["317231294_AN_ANALYSIS_OF_GAMIFICATION_ELEMENTS_IN_ONLINE_LEARNING_TO_ENHANCE_LEARNING_ENGAGEMENT","315064358_Teacher_perceptions_of_the_value_of_game-based_learning_in_secondary_education","313257400_Determinants_of_Secondary_School_Teachers'_Job_Satisfaction_in_Tanzania","309588556_Towards_a_Game-Based_Learning_Instructional_Design_Model_Focusing_on_Integration","309050128_Engaging_Engineering_Students_with_Gamification","344273151_Effects_of_the_Digital_Game-Development_Approach_on_Elementary_School_Students'_Learning_Motivation_Problem_Solving_and_Learning_Achievement","335238650_Effective_Gamification_Design_A_Literature_Review","321531422_The_Effects_of_Framing_in_Gamification_A_Study_of_Failure","314502785_A_Qualitative_Meta-Analysis_of_Computer_Games_as_Learning_Tools","311488619_Work_and_Play_An_Experiment_in_Enterprise_Gamification"]}