{"id":"318486315_DESIGNED_FACEBOOK_CLASSROOM_INNOVATION_FOR_IMPROVING_TEACHING-LEARNING_PRACTICES_IN_COMPUTER_SCIENCE_SUBJECT","abstract":"ABSTRACT \nThis study assessed the effectiveness of the designed Facebook (FB) Classroom in improving teaching-learning practices in Computer Science (CS) subject as perceived by Grade 8 students at San Pablo City Science High School. Program Guidelines can be formulated to promote Facebook Classroom as an innovation. The study utilized a survey questionnaire and secondary data regarding the performance in Computer Science of the respondents. Frequency count, percent, mean, standard deviation, and Pearson r were used to analyze the data. The hypotheses were tested at 0.05 level of significance. The salient findings of the study reveal that the respondents agree that the designed FB Classroom, when used as learning materials for delivery is effective; “agree” that facilitating communication is relevant to their CS performance; “agree” that collaborative learning contributes improvement in performance; and “agree” that curriculum content and computer skills development designed Facebook Classroom can help them achieve higher performance in Computer Science. The Grade 8 students' attitude in learning CS lessons is “positive”, effectively suggesting that the use of FB Classroom motivates students bringing forth progress in their performance. There is a significant relationship between respondents’ performance in CS subject and the perceived effectiveness of the Designed FB Classroom particularly students’ attitude, interest and motivation in learning Computer Science lessons. \n\nKeywords: performance, strategy, teaching, learning, effectiveness","authors":["Eden Caceres Callo","Adora Baguna"],"meta":["June 2017International Journal of Advanced Research 5(6):2026-2038","DOI:10.21474/IJAR01/4637"],"references":["354777579_Assessment_of_Learner's_Motivation_In_Web_Based_E-Learning","286804472_Constructive_disruptions_for_effective_collaborative_learning_Navigating_the_affordances_of_social_media_for_meaningful_engagement","283855236_Students'_Attitudes_towards_Using_Social_Networking_in_Foreign_Language_Classes_A_Facebook_Example","283483846_Facebook's_Potential_for_Collaborative_e-Learning","266837758_Integrating_ICT_in_Traditional_Training_-_Reactions_of_Teachers_and_Pupils'_Involved_in_FISTE_Project_Activities","264840387_Five_Key_Ingredients_for_Improving_Student_Motivation","260794505_Students'_perceptions_of_using_FacebookR_as_an_interactive_learning_resource_at_university","292654761_e-Learning_Concepts_and_practice","267846004_Use_of_Social_Networks_as_an_Education_Tool","245686604_Collaborative_Learning_Techniques_A_Handbook_for_College_Faculty"]}