{"id":"318462433_CONTRIBUTION_OF_NEUTRON_CAPTURING_REACTIONS_IN_PRECISION_CALCULATIONS_OF_TOTAL_ENERGY_RELEASE_IN_NUCLEAR_REACTORS","abstract":"Nowadays most programs for calculation of nuclear reactors use models of energy release developed in the 70s. Since that time important changes have happened not only in computer science, but also in nuclear fuel: burnable absorbers and profiling of enrichment have been introduced.\n\nFrom the standpoint of total energy release, these changes could considerably influence on its capturing component, that is on energy released in reactions with neutron disappearance by means of reaction channels (n,γ), (n,α), (n,p), etc. This is why the estimation of capturing component is a pressing problem. Addressing this problem could contribute to precision of released energy models and enhance precision of spent fuel characteristics. It is important to perform correct modeling of fuel burnup, which influences on its other characteristics.\n\nThe method for calculation of capturing reactions contribution to total energy release along with results of calculation is presented in the paper. This method assumes the use of programs based on Monte-Carlo method (MCNP, MCU, TDMCC, SERPENT, etc.), because these programs enable to conduct the most accurate calculations and obtain very close to experimental results.\n\nThe model of equivalent cell for VVER-1000 was calculated in order to test the developed method. After that, two models of fuel assembly for VVER-1000 with gadolinium as burnable absorber and without it were calculated to obtain more precise results and to estimate the influence of capturing component to total energy depending on the type of fuel assembly. Two models of fast BN-600 reactor were also considered. All models were calculated without fuel burn-up, considering only fresh fuel.\n\nIn calculations of energy released in active core by means of capturing reactions, one should determine these reactions along with their energy yield. Suggested model of active core with designation of material types and their volumes allowed to calculate reaction rates and instant and delayed energy release. These data make possible to calculate capturing reactions’ energy release and its part in total energy.\n\nThese calculations for VVER reactors demonstrated that total energy release decreases slightly as fuel abundance increases. The part of capturing energy release depends on the type of fuel assembly. This part makes 3,2% for fuel assembly without gadolinium and 3,6% for fuel assemblies with gadolinium.\n\nTaking into account of capturing energy release enables to obtain more high precision in modeling nuclear reactor installations and in calculation spent fuel assemblies.","authors":["Rynat Bahdanovich"],"meta":["April 2017","Project: Method for total energy deposition calculation"],"references":[]}