{"id":"318443660_m_-DSU_A_Micro-Language_Based_Approach_to_Dynamic_Software_Updating","abstract":"Today software systems play a critical role in society's infrastructures and many are required to provide uninterrupted services in their constantly changing environments. As the problem domain and the operational context of such software changes, the software itself must be updated accordingly.In this paper we propose to support dynamic software updating through language semantic adaptation; this is done through use of micro-languages that confine the effect of the introduced change to specific application features. Micro-languages provide a logical layer over a programming language and associate an application feature with the portion of the programming language used to implement it. Thus, they permit to update the application feature by updating the underlying programming constructs without affecting the behaviour of the other application features.Such a linguistic approach provides the benefit of easy addition/removal of application features (with a special focus on non-functional features) to/from a running application by separating the implementation of the new feature from the original application, allowing for the application to remain unaware of any extensions. The feasibility of this approach is demonstrated with two studies; its benefits and drawbacks are also analysed.","authors":["Walter Cazzola","Ruzanna Chitchyan","Awais Rashid","Albert Shaqiri"],"meta":["July 2017Computer Languages Systems & Structures","DOI:10.1016/j.cl.2017.07.003","Projects: NeverlangLanguage Based SW Evolution"],"references":["315748773_Open_Programming_Language_Interpreters","277814446_Gradually_Learning_Programming_Supported_by_a_Growable_Programming_Language","314794609_Context-oriented_programming","311464731_Matriona_class_nesting_with_parameterization_in_SqueakSmalltalk","308584333_Engineering_Sustainability_Through_Language","306151604_Mix-in_Based_Inheritance_In_Proc_Of_of_the_Conference_on_Object-Oriented_Programming_Systems","305453266_Recording_Concerns_in_Source_Code_Using_Annotations","299367621_Dynamic_software_evolution_through_interpreter_adaptation","299367404_Modularity_and_optimization_in_synergy","281334201_Evaluating_And_Comparing_Language_Workbenches_Existing_Results_And_Benchmarks_For_The_Future"]}