{"id":"318412739_Pashto_spoken_digits_recognition_using_spectral_and_prosodic_based_feature_extraction","abstract":"Automatic spoken digit recognition is one of the important areas in speech recognition. Local language spoken digits recognition is the next stage in this technological advancement. This paper presents a new approach for Pashto digits recognition using spectral and prosodic based feature extraction. Very little or almost no work has been done in Pashto spoken digit recognition. Thats why no standard Pashto digit corpus was available online. A database of 150 native speakers from 0 (sefor) to 9 (naha) including 75 males and 75 females is developed. Creation of corpus is one of the main contributions of this work. To the best of authors knowledge support vector machine (SVM) is used for the first time in Pashto digits classification and compared with K-nearest neighbor (KNN) classifier. Out of 150, 110 speakers feature set are used for training purposes and the remaining 40 speakers feature set are used for testing. The results obtained from the proposed method are very satisfactory and achieved 91.5% over all accuracy.","authors":["Shibli Nisar","Ibrahim Shahzad","Muhammad Adnan Khan Adnan Khan","Muhammad Tariq"],"meta":["February 2017","DOI:10.1109/ICACI.2017.7974488","Conference: 2017 Ninth International Conference on Advanced Computational Intelligence (ICACI)At: Doha, QatarVolume: 9","Project: Smart Pashto Digit Recognition System (SPDRS)"],"references":["326171058_On_Machine_Learning_and_Programming_Languages","275475207_JNAS_Japanese_speech_corpus_for_large_vocabulary_continuous_speech_recognition_research","273167213_Database_development_and_automatic_speech_recognition_of_isolated_Pashto_spoken_digits_using_MFCC_and_K-NN","264817326_A_Hindi_speech_recognition_system_for_connected_words_using_HTK","312621023_Filters_Wrappers_and_a_boosting-based_hybrid_for_feature_selection","303576747_The_Design_of_a_Corpus_of_Contemporary_Arabic_CCA","288945826_Divergence_measures_based_on_the_Shannon_entropy","279168008_The_Duration_of_Telugu_Speech_Sounds_An_Acoustic_Study","268371009_Pattern_Recognition_An_overview","267250566_A_Tour_of_the_Jungle_of_Approximate_Dynamic_Programming"]}