{"id":"318488119_In-Order_Transition-based_Constituent_Parsing","abstract":"Both bottom-up and top-down strategies have been used for neural transition-based constituent parsing. The parsing strategies differ in terms of the order in which they recognize productions in the derivation tree, where bottom-up strategies and top-down strategies take post-order and pre-order traversal over trees, respectively. Bottom-up parsers benefit from rich features from readily built partial parses, but lack lookahead guidance in the parsing process; top-down parsers benefit from non-local guidance for local decisions, but rely on a strong encoder over the input to predict a constituent hierarchy before its construction.To mitigate both issues, we propose a novel parsing system based on in-order traversal over syntactic trees, designing a set of transition actions to find a compromise between bottom-up constituent information and top-down lookahead information. Based on stack-LSTM, our psycholinguistically motivated constituent parsing system achieves 91.8 F1 on WSJ benchmark. Furthermore, the system achieves 93.6 F1 with supervised reranking and 94.2 F1 with semi-supervised reranking, which are the best results on the WSJ benchmark.","authors":["Jiangming Liu","Yue Zhang"],"meta":["July 2017Transactions of the Association for Computational Linguistics 5(4)","DOI:10.1162/tacl_a_00070"],"references":["311990718_Bi-directional_Attention_with_Agreement_for_Dependency_Parsing","309741463_LSTM_Shift-Reduce_CCG_Parsing","305994941_Bi-directional_Attention_with_Agreement_for_Dependency_Parsing","305334466_Recurrent_Neural_Network_Grammars","312458259_A_fast_and_accurate_dependency_parser_using_neural_networks","311990447_Parsing_as_Language_Modeling","311990405_Span-Based_Constituency_Parsing_with_a_Structure-Label_System_and_Provably_Optimal_Dynamic_Oracles","311411432_Shift-Reduce_Constituent_Parsing_with_Neural_Lookahead_Features","310461812_What_Do_Recurrent_Neural_Network_Grammars_Learn_About_Syntax","309738531_Deep_Biaffine_Attention_for_Neural_Dependency_Parsing"]}