{"id":"318459137_Data_politics","abstract":"The commentary raises political questions about the ways in which data has been constituted as an object vested with certain powers, influence, and rationalities. We place the emergence and transformation of professional practices such as ‘data science’, ‘data journalism’, ‘data brokerage’, ‘data mining’, ‘data storage’, and ‘data analysis’ as part of the reconfiguration of a series of fields of power and knowledge in the public and private accumulation of data. Data politics asks questions about the ways in which data has become such an object of power and explores how to critically intervene in its deployment as an object of knowledge. It is concerned with the conditions of possibility of data that involve things (infrastructures of servers, devices, and cables), language (code, programming, and algorithms), and people (scientists, entrepreneurs, engineers, information technologists, designers) that together create new worlds. We define ‘data politics’ as both the articulation of political questions about these worlds and the ways in which they provoke subjects to govern themselves and others by making rights claims. We contend that without understanding these conditions of possibility – of worlds, subjects and rights – it would be difficult to intervene in or shape data politics if by that it is meant the transformation of data subjects into data citizens.","authors":["Evelyn Ruppert","Fatma Engin","Didier Bigo"],"meta":["December 2017Big Data & Society 4(2):205395171771774","DOI:10.1177/2053951717717749","Project: Peopling Europe: How data make a people (ARITHMUS) [team member]"],"references":["309906444_Big_Data_Urban_Governance_and_the_Ontological_Politics_of_Hyper-Individualism","308781322_Transcending_Methodological_Nationalism_through_a_Transversal_Method_On_the_Stakes_and_Challenges_of_Collaboration","346624651_The_Taming_of_Chance","312618841_Censuses_Identity_Formation_and_the_Struggle_for_Political_Power","286726792_The_transnational_field_of_computerised_exchange_of_information_in_police_matters_and_its_European_guilds","281562300_Excitable_Speech_A_Politics_of_the_Performative","281333760_Donna_Haraway_Simians_Cyborgs_and_Women_The_Reinvention_of_Nature","275656291_Being_Digital_Citizens","275615831_Language_and_Symbolic_Power","273250613_Simians_Cyborgs_and_Women_The_Reinvention_of_Nature"]}