{"id":"318587788_Supporting_Handoff_in_Asynchronous_Collaborative_Sensemaking_Using_Knowledge-Transfer_Graphs","abstract":"During asynchronous collaborative analysis, handoff of partial findings is challenging because externalizations produced by analysts may not adequately communicate their investigative process. To address this challenge, we developed techniques to automatically capture and help encode tacit aspects of the investigative process based on an analyst's interactions, and streamline explicit authoring of handoff annotations. We designed our techniques to mediate awareness of analysis coverage, support explicit communication of progress and uncertainty with annotation, and implicit communication through playback of investigation histories. To evaluate our techniques, we developed an interactive visual analysis system, KTGraph, that supports an asynchronous investigative document analysis task. We conducted a two-phase user study to characterize a set of handoff strategies and to compare investigative performance with and without our techniques. The results suggest that our techniques promote the use of more effective handoff strategies, help increase an awareness of prior investigative process and insights, as well as improve final investigative outcomes.","authors":["Jian Zhao","Michael Glueck","Petra Isenberg","Fanny Chevalier"],"meta":["August 2017IEEE Transactions on Visualization and Computer Graphics PP(99)","DOI:10.1109/TVCG.2017.2745279"],"references":["306005900_Annotation_Graphs_A_Graph-Based_Visualization_for_Meta-Analysis_of_Data_Based_on_User-Authored_Annotations","277146070_Analytic_Provenance_for_Sensemaking_A_Research_Agenda","270789955_Supporting_Communication_and_Coordination_in_Collaborative_Sensemaking","308468954_Psychology_of_intelligence_analysis","305922942_Visualizing_Dimension_Coverage_to_Support_Exploratory_Analysis","288199024_PolyChrome_A_Cross-Device_Framework_for_Collaborative_Web_Visualization","283598664_Overcoming_Limited_Collaboration_Channels_in_Distributed_Intelligence_Analysis_Visualization_Tools_and_Design_Seeds","281512437_Characterizing_Provenance_in_Visualization_and_Data_Analysis_An","272933711_Sensemaking_in_Organizations","269272614_User-centered_design_guidelines_for_collaborative_software_for_intelligence_analysis"]}