{"id":"318592969_FF-SA_Fragmentation-Free_Spatial_Allocation","abstract":"Given a grid G containing a set of orthogonal grid cells and a list L of choices on each grid cell (e.g., land use), the fragmentation-free spatial allocation (FF-SA) aims to find a tile-partition of G and choice assignment on each tile so that the overall benefit is maximized under a cost constraint as well as spatial geometric constraints (e.g., minimum tile area, shape). The spatial constraints are necessary to avoid fragmentation and maintain practicality of the spatial allocation result. The application domains include agricultural landscape design (a.k.a., Geodesign), urban land-use planning, building floor zoning, etc. The problem is computationally challenging as an APX-hard problem. Existing spatial allocation techniques either do not consider spatial constraints during space-tiling or are very limited in enumeration space. We propose a Hierarchical Fragmentation Elimination (HFE) algorithm to address the fragmentation issue and significantly increase the enumeration space of tiling schemes. The new algorithm was evaluated through a detailed case study on spatial allocation of agricultural lands in mid-western US, and the results showed improved solution quality compared to the existing work.","authors":["Yiqun Xie","Shashi Shekhar"],"meta":["July 2017","DOI:10.1007/978-3-319-64367-0_17","Conference: International Symposium on Spatial and Temporal Databases"],"references":["220660094_Robust_Real-Time_Face_Detection","220650422_Spatial_multi-objective_land_use_optimization_Extensions_to_the_non-dominated_sorting_genetic_algorithm-II","2626179_Improved_Approximation_Algorithms_for_Rectangle_Tiling_and_Packing_Extended_Abstract","304336759_Collaborative_Geodesign_to_advance_multifunctional_landscapes","279392688_The_Multiple-Choice_Knapsack_Problem","257690014_Optimal_land_use_allocation_of_urban_fringe_in_Guangzhou","247587945_Some_optimal_inapproximabiity_results","240382427_Scenarios_of_Central_European_land_fragmentation","223279746_Impacts_and_causes_of_land_fragmentation_and_lessons_learned_from_land_consolidation_in_South_Asia","221322266_On_Rectangular_Partitionings_in_Two_Dimensions_Algorithms_Complexity_and_Applications","220113547_Optimal_Packing_and_Covering_in_the_Plane_are_NP-Complete","45930881_The_multiobjective_multidimensional_knapsack_problem_A_survey_and_a_new_approach"]}