{"id":"318503574_Mixed-model_U-shaped_assembly_lines_Balancing_and_comparing_with_straight_lines_with_buffers_and_parallel_workstations","abstract":"In the paper a genetic algorithm approach is proposed to balance asynchronous mixed-model U-shaped lines with stochastic task times. U-shaped lines have become popular in recent years for their ability to outperform straight assembly lines in terms of line efficiency. The great majority of studies in the literature deal with paced synchronous U-shaped lines. Asynchronous lines can be more efficient than synchronous lines, but are more difficult to study, due to blocking and starvation phenomena caused by the variability of completion times: this makes it difficult to calculate the effective throughput. This variability, that in straight lines comes from the stochastic nature of task times and from the changing of models entering the line, is even higher in U-shaped lines, where an operator can work at two different models in the same cycle at the two sides of the line. For this reason, the genetic algorithm proposed is coupled to a parametric simulator for the evaluation of the objective function, which contains the simulated throughput. Two alternative chromosomal representations are tested on an ample set of instances from the literature. The best solutions are also compared with the best solutions known in the literature, on the same instances, for straight lines with buffers and parallel workstations. From the comparison it turns out that U-shaped lines are generally more efficient with respect to straight lines with buffers. This is because crossover work centers naturally act similarly to unitary buffers, providing two places in which two loads can be placed simultaneously. The superiority of U-shaped lines holds true as long as it is possible to take full advantage of the employment of crossover work centers. For particular types of instances, depending on the distribution of task times, this possibility decreases, so that straight lines with parallel workstations and buffers are preferable.","authors":["Lorenzo Tiacci"],"meta":["August 2017Journal of Manufacturing Systems 45","DOI:10.1016/j.jmsy.2017.07.005","Project: The Assembly Line Simulator Project"],"references":["285663369_An_interactive_fuzzy_programming_approach_for_bi-objective_Straight_and_U-shaped_assembly_line_balancing_problem","272511021_A_Branch_and_Bound_Method_for_the_Line_Balancing_Problem_in_U-Shaped_Assembly_Lines_with_Equipment_Requirements","271700763_Simultaneous_balancing_and_buffer_allocation_decisions_for_the_design_of_mixed-model_assembly_lines_with_parallel_workstations_and_stochastic_task_times","267626978_Modified_genetic_algorithm_for_simple_straight_and_U-shaped_assembly_line_balancing_with_fuzzy_processing_times","265641145_The_Assembly_Line_Simulator_Project_modeling_U-shaped_un-paced_mixed_model_assembly_lines","282756981_Optimal_balancing_of_U-shaped_assembly_lines","271622993_Balancing_and_sequencing_of_stochastic_mixed-model_assembly_U-lines_to_minimise_the_expectation_of_work_overload_time","267436950_Integrated_procedure_of_balancing_and_sequencing_for_mixed-model_assembly_lines_A_multi-objective_evolutionary_approach","266385157_Design_Analysis_of_Experiments","264476601_The_stochastic_U-Line_balancing_problem"]}