{"id":"318508279_Non-deterministic_matrices_theory_and_applications_to_algebraic_semantics","abstract":"We call multioperation any operation that return for even argument a set of values instead of a single value. Through multioperations we can define an algebraic structure equipped with at least one multioperation. This kind of structure is called multialgebra. The study of them began in 1934 with the publication of a paper of Marty. In the realm of Logic, multialgebras were considered by Avron and his collaborators under the name of non-deterministic matrices (or Nmatrices) and used as semantics tool for characterizing some logics which cannot be characterized by a single finite matrix. Carnielli and Coniglio introduced the semantics of swap structures for LFIs (Logics of Formal Inconsistency), which are Nmatrices defined over triples in a Boolean algebra, generalizing Avron’s semantics. In this thesis we will introduce a new method of algebraization of logics based on multialgebras and swap structures that is similar to classical algebraization method of Lindenbaum-Tarski, but more extensive because it can be applied to systems such that some operators are non-congruential. In particular, this method will be applied to a family of non-normal modal logics and to some LFIs that are not algebraizable by method as Blok and Pigozzi general theory. We also will obtain representation theorems for some LFIs and we will prove that, under out approach, the classes of swap structures for some axiomatic extensions of mbC are a subclass of the class of swap structures for the logic mbC.","authors":["Ana Claudia Golzio"],"meta":["March 2017","DOI:10.13140/RG.2.2.14708.86408","Thesis for: PhDAdvisor: Marcelo Esteban Coniglio","Project: Matrizes não-determinísticas: teoria e aplicações à semântica algébrica"],"references":["323958969_More_Modal_Semantics_Without_Possible_Worlds","315058315_Errata_and_Addenda_to_'Finite_non-deterministic_semantics_for_some_modal_systems'","309157641_Towards_an_hyperalgebraic_theory_of_non-algebraizable_logics","334069080_Many-Valued_Logics","324308493_Many-Valued_Logics","324300499_Foundations_of_Mathematical_Logic","313691347_Boolean_algebras_with_operators","298436879_Fuzzy_Algebraic_Hyperstructures","285184764_On_the_Algebra_of_Logic_A_Contribution_to_the_Philosophy_of_Notation","284151104_Recherches_sur_le_systeme_de_la_logique_intuitioniste","274638680_Finite_non-deterministic_semantics_for_some_modal_systems","268955379_Untersuchungen_uber_den_Aussagenkalkul","268900445_Sur_les_groupes_et_hypergroupes_attaches_a_une_fraction_rationnelle","268738700_Vorlesungen_uber_die_Algebra_der_Logik_Exakte_Logik_Band_I_2nd_ed","268733937_Subdirect_representations_of_relational_systems"]}