{"id":"318587852_Etayage_de_l'activite_de_conception_experimentale_par_un_EIAH_pour_apprendre_la_notion_de_metabolisme_cellulaire_en_terminale_scientifique_Specialite_CIA_-Ingenierie_de_la_Cognition_de_l'interaction_d","abstract":"L’objectif de la thèse est d’étayer l’activité de conception expérimentale avec l’utilisation d’un environnement informatique pour l’apprentissage humain (EIAH). La conception expérimentale correspond à une partie de la démarche d’investigation qui fait l’objet de nombreuses recherches, à la fois parce que cette activité favorise l’apprentissage mais aussi parce que c’est une tâche complexe à l’origine de difficultés identifiées.La situation que nous avons choisie est la mise en évidence de la fermentation alcoolique, thème abordé en classe de terminale scientifique de spécialité en sciences de la vie et de la terre. Les élèves doivent concevoir une expérience pour mettre en évidence ce métabolisme.La première étape de la thèse a consisté à effectuer une modélisation didactique des connaissances en jeu. Pour cela nous nous plaçons dans le cadre de la théorie anthropologique du didactique et plus précisément l’approche praxéologique (Bosch & Chevallard, 1999). Nous avons ainsi obtenu un premier résultat qui est la modélisation d’une praxéologie de référence à partir d’une analyse épistémologique des savoirs en jeu et des attentes institutionnelles.Afin d’aider les élèves dans cette activité à l’origine de difficultés, nous utilisons des supports d’étayage, portés par la plateforme informatique, LabBook. Cet EIAH structure des rapports expérimentaux, à l’aide de plusieurs outils (texte, tableur, dessin, protocole) mis à disposition des élèves. L’outil protocole « Copex », permet de pré structurer un protocole expérimental.La deuxième étape de la thèse a été de proposer un protocole pré structuré en étapes, actions et paramètres d’actions qui prend en charge les difficultés attendues, et de l’implémenter dans LabBook, en tenant compte des contraintes de l’EIAH.L’étape suivante a été de tester l’efficacité de la prise en charge de ces difficultés dans la situation proposée en classe. Pour cela nous avons ainsi réalisé deux expérimentations en classes de terminale scientifique dans trois lycées différents. Nous avons recueilli les productions des élèves ainsi que leur réponse à des questionnaires (pré- test et post-test).L’analyse des résultats a montré que l’activité proposée favorise les apprentissages des concepts en jeu, et fait évoluer les conceptions des élèves. Concernant la conception du protocole, la pré structuration proposée aide les élèves à produire des protocoles communicables et pertinents. A partir des praxéologies personnelles modélisées a priori nous avons mis en évidence la présence de praxéologies personnelles d’élèves. Les analyses effectuées ont permis de faire évoluer la situation proposée et de valider la proposition de pré structuration du protocole en étapes et en actions paramétrées. Enfin nous proposons des préconisations pour un diagnostic automatique des erreurs des élèves, dans le but de produire des rétroactions élaborées à partir du modèle praxéologique développé dans la thèse.","authors":["Catherine Bonnat"],"meta":["July 2017"],"references":["333737787_La_notion_de_variable_dans_le_modele_praxeologique","326467103_Une_reponse_a_la_prise_en_compte_de_l'apprenant_dans_la_TAD_la_praxeologie_personnelle","321723477_Nature_et_fonctionnement_des_activites_experimentales_dans_la_classe","320083168_LabBook_a_web_environment_for_active_science_learning","312911990_BGuILE_Strategic_and_conceptual_scaffolds_for_scientific_inquiry_in_biology_classrooms","286071540_Etayer_la_conception_experimentale_par_des_environnements_informatiques_etudes_en_genetique","281661224_Des_environnements_numeriques_pour_etayer_l'investigation_scientifique_et_la_conception_experimentale_de_copex-chimie_a_LabBook","320320449_An_analysis_of_labwork_tasks_used_in_science_teaching_at_upper_secondary_school_and_university_levels_in_several_European_countries","298837845_The_metaphor_of_scaffolding_Its_utility_for_the_field_of_learning_disabilities","292702896_L'analyse_des_pratiques_enseignantes_en_theorie_anthropologique_du_didactique","281329070_Student_using_SCY-_Lab_Studying_their_argumentation_in_physics","279258616_Utilisation_du_modele_praxeologique_de_reference_dans_un_EIAH","278728427_La_construction_de_protocole_de_chimie_a_l'aide_d'un_logiciel_aide_les_eleves_a_faire_des_liens_entre_leurs_connaissances","280818320_The_guided_discovery_principle_in_multimedia_learning","279256227_Demarches_d'investigation_analyse_de_pratiques_de_classe_au_college_en_mathematiques_physique-chimie_et_sciences_de_la_vie_et_de_la_Terre_impliquees_dans_un_travail_collectif"]}