{"id":"318575077_Comparison_of_Distances_for_Supervised_Segmentation_of_White_Matter_Tractography","abstract":"Tractograms are mathematical representations of the main paths of axons within the white matter of the brain, from diffusion MRI data. Such representations are in the form of polylines, called streamlines, and one streamline approximates the common path of tens of thousands of axons. The analysis of tractograms is a task of interest in multiple fields, like neurosurgery and neurology. A basic building block of many pipelines of analysis is the definition of a distance function between streamlines. Multiple distance functions have been proposed in the literature, and different authors use different distances, usually without a specific reason other than invoking the \"common practice\". To this end, in this work we want to test such common practices, in order to obtain factual reasons for choosing one distance over another. For these reasons, in this work we compare many streamline distance functions available in the literature. We focus on the common task of automatic bundle segmentation and we adopt the recent approach of supervised segmentation from expert-based examples. Using the HCP dataset, we compare several distances obtaining guidelines on the choice of which distance function one should use for supervised bundle segmentation.","authors":["Emanuele Olivetti","Giulia Bertò","Pietro Gori","Nusrat Sharmin"],"meta":["June 2017","DOI:10.1109/PRNI.2017.7981502","Conference: 2017 International Workshop on Pattern Recognition in Neuroimaging (PRNI)"],"references":["311423273_Alignment_of_Tractograms_As_Graph_Matching","300112839_Atlas_of_Human_Brain_Connections_all_tracts","300076754_Alignment_of_Tractograms_as_Linear_Assignment_Problem","281818333_An_Example-Based_Multi-Atlas_Approach_to_Automatic_Labeling_of_White_Matter_Tracts","262046848_DIPY_a_library_for_the_analysis_of_diffusion_MRI_data","305313300_Parsimonious_Approximation_of_Streamline_Trajectories_in_White_Matter_Fiber_Bundles","276542974_Robust_and_efficient_linear_registration_of_white-matter_fascicles_in_the_space_of_streamlines","262043634_The_WU-Minn_Human_Connectome_Project_an_overview","260127669_On_Describing_Human_White_Matter_Anatomy_The_White_Matter_Query_Language","256168710_The_Dissimilarity_Representation_for_Pattern_Recognition_Foundations_And_Applications_Machine_Perception_and_Artificial_Intelligence"]}