{"id":"318592609_Stochastic_p_-Bits_for_Invertible_Logic","abstract":"Conventional semiconductor-based logic and nanomagnet-based memory devices are built out of stable, deterministic units such as standard metal-oxide semiconductor transistors, or nanomagnets with energy barriers in excess of ≈40–60 kT. In this paper, we show that unstable, stochastic units, which we call “p-bits,” can be interconnected to create robust correlations that implement precise Boolean functions with impressive accuracy, comparable to standard digital circuits. At the same time, they are invertible, a unique property that is absent in standard digital circuits. When operated in the direct mode, the input is clamped, and the network provides the correct output. In the inverted mode, the output is clamped, and the network fluctuates among all possible inputs that are consistent with that output. First, we present a detailed implementation of an invertible gate to bring out the key role of a single three-terminal transistorlike building block to enable the construction of correlated p-bit networks. The results for this specific, CMOS-assisted nanomagnet-based hardware implementation agree well with those from a universal model for p-bits, showing that p-bits need not be magnet based: any three-terminal tunable random bit generator should be suitable. We present a general algorithm for designing a Boltzmann machine (BM) with a symmetric connection matrix [J] (Jij=Jji) that implements a given truth table with p-bits. The [J] matrices are relatively sparse with a few unique weights for convenient hardware implementation. We then show how BM full adders can be interconnected in a partially directed manner (Jij≠Jji) to implement large logic operations such as 32-bit binary addition. Hundreds of stochastic p-bits get precisely correlated such that the correct answer out of 233 (≈8×109) possibilities can be extracted by looking at the statistical mode or majority vote of a number of time samples. With perfect directivity (Jji=0) a small number of samples is enough, while for less directed connections more samples are needed, but even in the former case logical invertibility is largely preserved. This combination of digital accuracy and logical invertibility is enabled by the hybrid design that uses bidirectional BM units to construct circuits with partially directed interunit connections. We establish this key result with extensive examples including a 4-bit multiplier which in inverted mode functions as a factorizer.","authors":["Kerem Camsari","Rafatul Faria","Brian Sutton","Supriyo Datta"],"meta":["July 2017Physical Review X 7(3)","DOI:10.1103/PhysRevX.7.031014","Project: Spintronics Research"],"references":["305779384_Intrinsic_optimization_using_stochastic_nanomagnets","303750076_A_building_block_for_hardware_belief_networks","301879351_External_Field_Free_Spin_Hall_Effect_Device_for_Perpendicular_Magnetization_Reversal_Using_a_Composite_Structure_with_Biasing_Layer","317070642_Ising_computation_based_combinatorial_optimization_using_spin-Hall_effect_SHE_induced_stochastic_magnetization_reversal","313726720_Polynomial-time_solution_of_prime_factorization_and_NP-complete_problems_with_digital_memcomputing_machines","313455363_Experimental_demonstration_of_nanomagnet_networks_as_hardware_for_Ising_computing","308025865_Topological_Field_Theory_and_Computing_with_Instantons","304470615_Spintronic_Nanodevices_for_Bioinspired_Computing","303687330_Spin-orbit_torque_switching_without_an_external_field_using_interlayer_exchange_coupling","301481119_Large-scale_Ising_spin_network_based_on_degenerate_optical_parametric_oscillators"]}