{"id":"318505489_Flipped_classroom_Claves_para_su_puesta_en_practica","abstract":"Comienza este trabajo haciendo ver la necesidad de la incorporación de las tecnologías en la enseñanza; posteriormente se realiza una descripción básica de evidencias de la metodología tradicional; más adelante se describe qué son las clases invertidas y se indican fases y estrategias para su puesta en práctica. Se dedica un apartado a inconvenientes descritos en diferentes investigaciones y se abordan los beneficios que estudiantes y profesores puede alcanzar al hacer uso de este tipo de metodología.\n\nSe muestra con posterioridad resultados acerca de la aplicación práctica de las clases invertidas, como que los alumnos consideran que promueve la comprensión y aplicación de los conceptos clave, que los materiales les ayudan a preparar cada sesión de clase, aprender a su propio ritmo, preparar los exámenes y que mejoran su aprendizaje en general. Manifiestan su preferencia por las clases invertidas e indican el aumento de la eficacia/efectividad del tiempo de clase.\n\nSe concluye en la apreciación de beneficios significativos con la aplicación de las clases invertidas, desde permitir a los profesores identificar los conceptos que no comprenden sus estudiantes hasta dedicar tiempo en clase para el desarrollo de habilidades cognitivas de orden superior de los estudiantes.","authors":["José Sánchez Rodríguez","Julio Ruiz-Palmero","Elena Sánchez Vega"],"meta":["July 2017EDMETIC 6(2):336","DOI:10.21071/edmetic.v6i2.5832"],"references":["277834812_Humanizing_the_Classroom_by_Flipping_the_Homework_versus_Lecture_Equation","265175194_A_novel_integration_of_online_and_flipped_classroom_instructional_models_in_public_health_higher_education","263455740_Active_learning_through_student_film_A_case_study_of_cultural_geography","263323876_A_Reflective_Teaching_Challenge_to_Motivate_Educational_Innovation","344538008_The_Flipped_Classroom_A_Survey_of_the_Research","290605806_Flip_Your_Students'_Learning","286173841_Estudio_comparativo_de_cambios_metodologicos_y_percepcion_del_alumno_en_la_materia_de_Direccion_de_produccion_y_operaciones_para_la_adquisicion_de_competencias_en_el_proceso_de_adaptacion_al_EEES","276159992_It's_not_About_seat_time_Blending_Fipping_and_Efficiency_in_Active_Learning_Classrooms","271438489_A_busy_professor's_guide_to_sanely_flipping_your_classroom","264573968_Student_attitudes_toward_flipping_the_general_chemistry_classroom"]}