{"id":"318583966_Meaningless_comparisons_lead_to_false_optimism_in_medical_machine_learning","abstract":"A new trend in medicine is the use of algorithms to analyze big datasets, e.g. using everything your phone measures about you for diagnostics or monitoring. However, these algorithms are commonly compared against weak baselines, which may contribute to excessive optimism. To assess how well an algorithm works, scientists typically ask how well its output correlates with medically assigned scores. Here we perform a meta-analysis to quantify how the literature evaluates their algorithms for monitoring mental wellbeing. We find that the bulk of the literature ($\\sim$77%) uses meaningless comparisons that ignore patient baseline state. For example, having an algorithm that uses phone data to diagnose mood disorders would be useful. However, it is possible to over 80% of the variance of some mood measures in the population by simply guessing that each patient has their own average mood - the patient-specific baseline. Thus, an algorithm that just predicts that our mood is like it usually is can explain the majority of variance, but is, obviously, entirely useless. Comparing to the wrong (population) baseline has a massive effect on the perceived quality of algorithms and produces baseless optimism in the field. To solve this problem we propose \"user lift\" that reduces these systematic errors in the evaluation of personalized medical monitoring.","authors":["Orianna Demasi","Konrad Kording","Benjamin Recht"],"meta":["July 2017PLoS ONE 12(9)","DOI:10.1371/journal.pone.0184604"],"references":["313610493_Evaluation_From_precision_recall_and_fmeasure_to_roc_informedness_markedness_and_correlation","304424770_Voodoo_Machine_Learning_for_Clinical_Predictions","329475599_Regression_Shrinkage_and_Selection_Via_the_Lasso","322715583_Data_Mining_practical_machine_learning_tools_and_techniques","313385761_Data_Mining_Practical_Machine_Learning_Tools_and_Techniques","312432923_Regularization_and_Variable_Selection_via_the_Elastic_Nets","310818946_Trajectories_of_depression_unobtrusive_monitoring_of_depressive_states_by_means_of_smartphone_mobility_traces_analysis","308731691_Predicting_students'_happiness_from_physiology_phone_mobility_and_behavioral_data","305459152_Predicting_suicides_after_outpatient_mental_health_visits_in_the_Army_Study_to_Assess_Risk_and_Resilience_in_Servicemembers_Army_STARRS","304824205_Regression_Shrinkage_and_Selection_via_the_LASSO"]}