{"id":"318576322_Brief_Announcement_Rapid_Asynchronous_Plurality_Consensus","abstract":"We consider distributed plurality consensus on a complete graph of size n with k initial opinions in the following asynchronous communication model. Each node is equipped with a random Poisson clock with parameter lambda=1. Whenever a node's clock ticks, it samples some neighbors uniformly at random and adjusts its opinion according to the sample.\nDistributed plurality consensus has been deeply studied in the synchronous communication model. A prominent example is the so-called Two-Choices protocol, where in each round, every node chooses two neighbors uniformly at random, and if the two sampled opinions coincide, then that opinion is adopted. This protocol is very efficient when k=2. If k=O(nε) for some small epsilon, we show that it converges to the initial plurality opinion within O(k log n) rounds, w.h.p., as long as the initial difference between the largest and second largest opinion is Omega(sqrt(n log n)). On the negative side, we show that there are cases in which Omega(k) rounds are needed, w.h.p.\nTo beat this lower bound, we combine the Two-Choices protocol with push-pull broadcasting. We divide the process into several phases, where each phase consists of a two-choices round followed by several broadcasting rounds. Our main contribution is a non-trivial adaptation of this approach to the above asynchronous model. If the support of the most frequent opinion is at least (1+ε) times that of the second-most frequent one and k=O(Exp(log n / log log n)), then our protocol achieves the best possible run time of O(log n), w.h.p. Key to our adaptation is that we relax full synchronicity by allowing o(n) nodes to be poorly synchronized, and the well synchronized nodes are only required to be within a certain time difference from one another. We enforce this sufficient synchronicity by introducing a novel gadget into the protocol. Other parts of the adaptation are made to work using arguments and techniques based on a Pólya urn model.","authors":["Robert Elsässer","Tom Friedetzky","Dominik Kaaser","Frederik Mallmann-Trenn"],"meta":["July 2017","DOI:10.1145/3087801.3087860","Conference: the ACM Symposium"],"references":["3086918_Fast_Distributed_Algorithms_for_Computing_Separable_Functions","305674922_A_Polylogarithmic_Gossip_Algorithm_for_Plurality_Consensus","261988788_The_Power_of_Two_Choices_in_Distributed_Voting"]}