{"id":"318547084_Cooperative_Vision-Based_Object_Transportation_by_Two_Humanoid_Robots_in_a_Cluttered_Environment","abstract":"Although in recent years, there have been quite a few studies aimed at the navigation of robots in cluttered environments, few of these have addressed the problem of robots navigating while moving a large or heavy object. Such a functionality is especially useful when transporting objects of different shapes and weights without having to modify the robot hardware. In this work, we tackle the problem of making two humanoid robots navigate in a cluttered environment while transporting a very large object that simply could not be moved by a single robot. We present a complete navigation scheme, from the incremental construction of a map of the environment and the computation of collision-free trajectories to the design of the control to execute those trajectories. We present experiments made on real NAO robots, equipped with RGB-D sensors mounted on their heads, moving an object around obstacles. Our experiments show that a significantly large object can be transported without modifying the robot main hardware, and therefore that our scheme enhances the humanoid robots capacities in real-life situations.\nOur contributions are: (1) a low-dimension multi-robot motion planning algorithm that finds an obstacle-free trajectory, by using the constructed map of the environment as an input, (2) a framework that produces continuous and consistent odometry data, by fusing the visual and the robot odometry information, (3) a synchronization system that uses the projection of the robots based on their hands positions coupled with the visual feedback error computed from a frontal camera, (4) an efficient real-time whole-body control scheme that controls the motions of the closed-loop robot–object–robot system.","authors":["Antoine Rioux","Claudia Esteves","Jean-Bernard Hayet","Wael Suleiman"],"meta":["July 2017International Journal of Humanoid Robotics 14(03):1750018","DOI:10.1142/S0219843617500189","Project: Humanoid robot control and collaborative tasks"],"references":["312115207_External_force_observer_for_medium-sized_humanoid_robots","308861864_Humanoid_navigation_and_heavy_load_transportation_in_a_cluttered_environment","308851239_Cooperative_SLAM-based_object_transportation_by_two_humanoid_robots_in_a_cluttered_environment","286570999_Online_global_loop_closure_detection_for_large-scale_multi-session_graph-based_SLAM","279163237_Integral_Acceleration_Generation_for_Slip_Avoidance_in_a_Planar_Humanoid_Robot","274504328_Hierarchical_quadratic_programming_Fast_online_humanoid-robot_motion_generation","287021905_Symmetry_cooperative_object_transportation_by_multiple_humanoid_robots","263285307_A_Fast_Turning_Method_for_Biped_Robots_With_Foot_Slip_During_Single-Support_Phase","262322435_Human-Humanoid_Co-working_in_a_Joint_Table_Transportation","260145899_Robotics_Modelling_Planning_and_Control","242704824_A_Local_Collision_Avoidance_Method_for_Non-strictly_Convex_Objects","235004208_Real-Time_Navigation_in_3D_Environments_Based_on_Depth_Camera_Data","228616404_Pivoting_a_Large_Object_Whole-Body_Manipulation_by_a_Humanoid_Robot","257523133_OctoMap_An_efficient_probabilistic_3D_mapping_framework_based_on_octrees","243785622_Pyramidal_implementation_of_the_lucas_kanade_feature_tracker"]}