{"id":"318534651_A_Study_of_School_Size_among_Alabama's_Public_High_Schools","abstract":"The purpose of this study was to examine the relationship between the size of Alabama’s public high schools, selected school quality and financial indicators, and their students’ performance on standardized exams. When the socioeconomic level of the student bodies is held constant, the size of high schools in Alabama has relatively little relationship with 11th grade student (both regular and special education) performance on the reading and math portions of the AHSGE. High schools’ average daily attendance rates and pupil-to-computer (and computer with Internet connections) ratios do not vary in accordance with school size. Higher percentages of highly qualified teachers are found in Alabama’s largest high schools. There was very little difference in the percentage of teachers with a master’s degree or above across school size categories. Very little difference exists across size categories in regard to mean expenditures per pupil (range = $7,322 to $7,829). However, districts of the large high schools exert over twice the effort of those with small high schools (3.2 mills to 1.5 mills) and approximately 50 percent greater local effort than the districts of the medium-size high schools.","authors":["Ronald A. Lindahl","Sr. Patrick M. Cain"],"meta":["January 2012International Journal of Education Policy and Leadership 7(1)","DOI:10.22230/ijepl.2012v7n1a309"],"references":["287635728_Small-School_Reform_Through_the_Lens_of_Complexity_Theory_It's_Good_to_Think_With","269337014_Assessing_the_effect_of_small_school_size_on_mathematics_achievement_A_propensity_score_approach","251194630_Does_Connectedness_Matter_Evidence_From_a_Social_Network_Analysis_Within_a_Small-School_Reform","249913675_Is_Small_Really_Better_Testing_Some_Assumptions_about_High_School_Size","292506265_Contrasting_paths_to_small-school_reform_Results_of_a_5-year_evaluation_of_the_Bill_Melinda_Gates_Foundation's_national_high_schools_initiative","292255567_Choice_equity_and_the_schools-within-schools_reform","289873046_Negotiating_mandates_and_memory_Inside_a_small_schools_network_for_immigrant_youth","288789784_Thinking_Big_About_Getting_Small_An_Ideological_Genealogy_of_Small-School_Reform","276238726_Student_Voluntary_Participation_and_High_School_Size","265003411_Small_Schools_Large_Districts_Small-_School_Reform_and_New_York_City's_Students"]}