{"id":"318581179_Collaborative_Service_Selection_via_Ensemble_Learning_in_Mixed_Mobile_Network_Environments","abstract":"Mobile Service selection is an important but challenging problem in service and mobile computing. Quality of service (QoS) predication is a critical step in service selection in 5G network environments. The traditional methods, such as collaborative filtering (CF), suffer from a series of defects, such as failing to handle data sparsity. In mobile network environments, the abnormal QoS data are likely to result in inferior prediction accuracy. Unfortunately, these problems have not attracted enough attention, especially in a mixed mobile network environment with different network configurations, generations, or types. An ensemble learning method for predicting missing QoS in 5G network environments is proposed in this paper. There are two key principles: one is the newly proposed similarity computation method for identifying similar neighbors; the other is the extended ensemble learning model for discovering and filtering fake neighbors from the preliminary neighbors set. Moreover, three prediction models are also proposed, two individual models and one combination model. They are used for utilizing the user similar neighbors and servicing similar neighbors, respectively. Experimental results conducted in two real-world datasets show our approaches can produce superior prediction accuracy.","authors":["Yuyu Yin","Yueshen Xu","Wenting Xu","Min Gao"],"meta":["July 2017Entropy 19(7):358","DOI:10.3390/e19070358"],"references":["316941635_Time-Aware_Service_Ranking_Prediction_in_the_Internet_of_Things_Environment","295856772_Context-Aware_Web_Services_Recommendation_Based_on_User_Preference","308846397_Adaptive_density-based_spatial_clustering_of_applications_with_noise_DBSCAN_according_to_data","308671933_Location-Based_Web_Service_QoS_Prediction_via_Preference_Propagation_for_Improving_Cold_Start_Problem","308671143_QoS_Prediction_of_Web_Services_Based_on_Two-Phase_K-Means_Clustering","307573978_Time-Aware_and_Sparsity-Tolerant_QoS_Prediction_Based_on_Collaborative_Filtering","307573165_Asymmetric_Correlation_Regularized_Matrix_Factorization_for_Web_Service_Recommendation","304000500_QoS_Prediction_for_Web_Service_Recommendation_with_Network_Location-Aware_Neighbor_Selection","292744761_Machine_learning_improved_boosting_algorithms_using_confidence-rated_predictions","290753594_Personalized_Location-Aware_QoS_Prediction_for_Web_Services_Using_Probabilistic_Matrix_Factorization"]}