{"id":"318546310_What_Competencies_Should_Undergraduate_Engineering_Programs_Emphasize_A_Systematic_Review","abstract":"Under Washington Accord or ABET accreditation requirements, faculty must envision, collectively articulate, and prioritize the competencies that students should gain from their educational program to prepare for life and myriad career paths. When faculty create specifications for designing a curriculum, they need to answer questions, including “Among generic engineering competencies, what is the relative importance for professional practice across disciplines and work contexts?” A search identified the intersection of four concepts (competence, engineering, practice, and importance) in engineering and education databases (8,232 reports, 1990–2012). This review integrates a quantitative synthesis inspired by meta-analytic techniques (27 studies, 14,429 participants) and a qualitative thematic analysis (25 studies, 2,174 participants plus 36,100 job postings) to establish a comprehensive list of generic engineering competencies, their relative importance, and rich descriptions highlighting interrelationships. Engineers' technical work is inseparably intertwined with team-player collaboration. The most crucial skill is coordinating multiple competencies to accomplish a goal. Sixteen generic competencies important for engineering practice are defined. Compared with Washington Accord graduate attributes, the evidence-based competencies re-envision “teamwork” as coordinate efforts, split “life-long learning” into gather information and expand skills, broaden “ethics” to take responsibility, expand “design experiments” to measure accurately and separate it from interpret data, apply “contemporary issues” and “impacts” in define constraints, modify “manage projects” to devise process, and add important competencies (take initiative, think creatively, and make decisions). Definitions are refined for communicate effectively, design solutions, apply knowledge, apply skills, and solve problems. Problem solving is the core of engineering practice.","authors":["Honor J. Passow","Christian H Passow"],"meta":["July 2017Journal of Engineering Education 106(3):475-526","DOI:10.1002/jee.20171","Project: Practicing Engineers' Views on Competencies that are Important for their Work"],"references":["350306016_10_The_Senseless_Submergence_of_Difference_Engineers_Their_Work_and_Their_Careers","345936784_Understanding_The_Current_Work_And_Values_Of_Professional_Engineers_Implications_For_Engineering_Education","344544226_Identifying_Specific_Measurable_Skills_Perceived_As_Requisite_For_Graduating_Aerospace_Engineers","344530724_Industry_Expectations_From_New_Construction_Engineers_And_Managers_Curriculum_Improvement","344061925_Industry_Expectations_Of_New_Engineers_A_Survey_To_Assist_Curriculum_Designers","344061494_Abet_2000_What_Are_The_Most_Important_Criteria_To_The_Supervisors_Of_New_Engineering_Undergraduates","332672673_Making_it_all_work_The_engineering_graduate_of_the_future_a_UK_perspective","321619684_Rethinking_Engineering_Education_The_CDIO_Approach","299270025_What_is_professional_An_experiential_learning_theory_perspective_of_sales_engineer_competencies_in_the_semiconductor_industry","292395272_Leveraging_workforce_needs_to_inform_curricular_change_in_computing_education_for_engineering_The_cpace_project","289310493_Industry_Expectations_of_Mechanical_Engineering_Graduates_A_Case_Study_in_Chile","287949925_The_quality_of_design_within_the_built_environment","287056001_Not_all_the_same_A_look_at_early_career_engineers_employed_in_different_sub-occupations","279835779_Understanding_the_careers_of_the_alumni_of_the_MIT_Mechanical_Engineering_department","274565183_Meta-Analysis_in_Social_Research"]}