{"id":"318551766_A_random_forest_classifier_for_detecting_rare_variants_in_NGS_data_from_viral_populations","abstract":"We propose a random forest classifier for detecting rare variants from sequencing errors in Next Generation Sequencing (NGS) data from viral populations. The method utilizes counts of varying length of k-mers from the reads of a viral population to train a Random forest classifier, called MultiRes, that classifies k-mers as erroneous or rare variants. Our algorithm is rooted in concepts from signal processing and uses a frame-based representation of k-mers. Frames are sets of non-orthogonal basis functions that were traditionally used in signal processing for noise removal. We define discrete spatial signals for genomes and sequenced reads, and show that k-mers of a given size constitute a frame.\nWe evaluate MultiRes on simulated and real viral population datasets, which consist of many low frequency variants, and compare it to the error detection methods used in correction tools known in the literature. MultiRes has 4 to 500 times less false positives k-mer predictions compared to other methods, essential for accurate estimation of viral population diversity and their de-novo assembly. It has high recall of the true k-mers, comparable to other error correction methods. MultiRes also has greater than 95% recall for detecting single nucleotide polymorphisms (SNPs) and fewer false positive SNPs, while detecting higher number of rare variants compared to other variant calling methods for viral populations. The software is available freely from the GitHub link https://github.com/raunaq-m/MultiRes.","authors":["Raunaq Malhotra","Manjari Jha","Mary Poss","Raj Acharya"],"meta":["July 2017Computational and Structural Biotechnology Journal 15(C)","DOI:10.1016/j.csbj.2017.07.001"],"references":["327851139_A_universal_SNP_and_small-indel_variant_caller_using_deep_neural_networks","315178196_Identification_and_correction_of_systematic_error_in_high-throughput_sequence_data","296479552_ADEPT_a_dynamic_next_generation_sequencing_data_error-detection_program_with_trimming","270909597_Insight_into_biases_and_sequencing_errors_for_amplicon_sequencing_with_the_Illumina_MiSeq_platform","270291787_New_insight_into_HCV_E1E2_region_of_genotype_4a","263736737_KMC_2_Fast_and_resource-frugal_k-mer_counting","317741786_On_nonassociative_division_algebras","314324031_Identification_and_correction_of_systematic_error_in_high-throughput_sequence_data","278710148_A_Friendly_Guide_to_Wavelets","276067916_BFC_Correcting_Illumina_sequencing_errors"]}