{"id":"318691729_Distributed_Adaptive_Control_of_Networked_Cooperative_Mobile_Manipulators","abstract":"This paper deals with the networked control of loosely or tightly connected cooperative manipulators in charge of achieving a cooperative task that is specified by means of proper task-oriented variables depending on the full state of the system. Since the full state is not known to robots, a two-layer architecture is designed. At the first level, each arm controller runs a distributed observer that estimates the system state. At the second level, this estimation is adopted to compute the local control input as in the case that a central unit is available. In addition, since the dynamic parameters of the arms might not be perfectly known, the local control law is made adaptive in order to counteract this uncertainty. The designed solution is suitable not only for pure motion coordination tasks but can also be exploited in those cases where a closed kinematic chain is generated by multirobot object manipulation. In this situation, the objective is to both move the object and limit the internal stresses on it that, however, cannot be locally computed. To overcome this issue, the wrench exerted by each robot on the object is decomposed in an external component (contributing to the motion of the object) and in an internal component that is locally estimated and, then, regulated. The approach was validated by simulation with 6-DOF serial chain manipulators mounted on a mobile platform and performing cooperative tasks.","authors":["Alessandro Marino"],"meta":["July 2017Control Systems Technology, IEEE Transactions on PP(99):1-15","DOI:10.1109/TCST.2017.2720673"],"references":["303886309_Kinematic_multi-robot_manipulation_with_no_communication_using_force_feedback","291385881_Implementing_Smart_Factory_of_Industrie_40_An_Outlook","288455025_Cooperative_Manipulation_Exploiting_only_Implicit_Communication","275461447_Decentralized_time-varying_formation_control_for_multi-robot_systems","309629827_Applied_Nonlinear_Control","303886440_Decentralized_motion_control_for_cooperative_manipulation_with_a_team_of_networked_mobile_manipulators","303886124_Multi-constrained_joint_transportation_tasks_by_teams_of_autonomous_mobile_robots_using_a_dynamical_systems_approach","283189741_Design_of_a_decentralized_modular_architecture_for_flexible_and_extensible_production_systems","277027181_Distributed_finite-time_tracking_for_a_multi-agent_system_under_a_leader_with_bounded_unknown_acceleration","267189059_Graph_Theoretic_Methods_in_Multi-Agent_Networks"]}