{"id":"318608977_Governing_the_Complexity_of_Smart_Data_Cities_Setting_a_Research_Agenda","abstract":"This chapter develops a research agenda for big and open data in smart cities based on a thorough literature discussion of Actor Network Theory and the key concepts of urban governance and complexity. We argue that much of the smart city data discourse is highly modernist and restores an ideal of control and central steering that is thoroughly at odds with the complex multi-actor environment of smart cities. Against this background, we propose new research directions for the policy aspects of smart cities, asking in particular about the possible contradictory interests of city governments and the ICT sector on the one hand, and of city governments and hyperinformed citizens on the other; the data and analytic aspects of smart cities, raising the question of the quality and implicit values in big data, as well as the analytic challenges to collect, analyze and apply them, including the issue of data literacy for the citizenry of the smart city; the legal and social aspects of smart cities, which concern particularly issues of data ownership and privacy, and the new inequalities that may emerge as a result of smart city and big data developments; and the spatial aspects of smart cities, in particular the material and spatial repercussions of the movement to online, digital public and private services, and the reworking of spatial boundaries.","authors":["Jurian Edelenbos","Fadi Hirzalla","Liesbet van Zoonen","Jan van Dalen"],"meta":["July 2018","DOI:10.1007/978-3-319-58577-2_3","In book: Smart Technologies for Smart Governments (pp.35-54)","Project: Smart cities, people and governance"],"references":["326539234_Smart_about_Cities_-_Visualising_the_Challenge_for_21st_Century_Urbanism","312493884_Planning_strategies_in_an_age_of_active_citizenship_a_post-structuralist_agenda_for_self-organization_in_spatial_planning","303997591_The_Evolution_of_Community_Self-Organization_in_Interaction_With_Government_Institutions_Cross-Case_Insights_From_Three_Countries","315497736_Enacting_Electronic_Government_Success","304535150_Big_data_The_management_revolution","301173592_The_Origins_of_Complexity_Theory_in_Cities_and_Planning","301173591_Complexity_and_Complexity_Theories_Do_These_Concepts_Make_Sense","292499156_The_Oxford_Handbook_of_Governance","289452823_Issues_in_reconceptualizing_public_policy_from_the_perspective_of_complexity_theory","289263807_Spatial_planning_complexity_and_a_world_'out_of_equilibrium'_Outline_of_a_non-linear_approach_to_planning"]}