{"id":"318610378_Consistent_functional_cross_field_design_for_mesh_quadrangulation","abstract":"We propose a novel technique for computing consistent cross fields on a pair of triangle meshes given an input correspondence, which we use as guiding fields for approximately consistent quadrangulations. Unlike the majority of existing methods our approach does not assume that the meshes share the same connectivity or even have the same number of vertices, and furthermore does not place any restrictions on the topology (genus) of the shapes. Importantly, our method is robust with respect to small perturbations of the given correspondence, as it only relies on the transportation of real-valued functions and thus avoids the costly and error-prone estimation of the map differential. Key to this robustness is a novel formulation, which relies on the previously-proposed notion of power vectors, and we show how consistency can be enforced without pre-alignment of local basis frames, in which these power vectors are computed. We demonstrate that using the same formulation we can both compute a quadrangulation that would respect a given symmetry on the same shape or a map across a pair of shapes. We provide quantitative and qualitative comparison of our method with several baselines and show that it both provides more accurate results and allows to handle more general cases than existing techniques.","authors":["Omri Azencot","Etienne Corman","Mirela Ben-Chen","Maks Ovsjanikov"],"meta":["July 2017ACM Transactions on Graphics 36(4):1-13","DOI:10.1145/3072959.3073696"],"references":["278733364_Point-wise_Map_Recovery_and_Refinement_from_Functional_Correspondence","314727241_Functional_maps_a_flexible_representation_of_maps_between_shapes","311099445_Computing_and_processing_correspondences_with_functional_maps","311099404_Directional_field_synthesis_design_and_processing","306124384_Non-Rigid_Puzzles","283889582_Data-Driven_Interactive_Quadrangulation","282801203_Consistent_quadrangulation_for_shape_collections_via_feature_line_co-extraction","282414541_Seamless_Surface_Mappings","278721117_SCAPE","268634542_The_geometry_of_physics_An_introduction_2nd_ed"]}