{"id":"318699880_Spatio-temporal_profiling_of_public_transport_delays_based_on_large_scale_vehicle_positioning_data_from_GPS_in_Wroclaw","abstract":"In recent years many studies of urban mobility based on large data sets have been published: most of them based on crowdsourced GPS data or smart-card data. We present, what is to our knowledge the first, exploration of public transport delay data harvested from a large-scale, official public transport positioning system, provided by the Wroc{\\l}aw Municipality. We evaluate the characteristics of delays between stops in relation to direction, time and delay variance of 1648 stop pairs from 15 mln delay reports. We construct a normalized feature matrix of likelihood of a given delay change happening at a given hour on the edge between two stops. We then calculate distances between such matrices using earth mover's distance and cluster them using hierarchical agglomerative clustering with Ward's linkage method. We obtain four profiles of delay changes in Wroc{\\l}aw: edges without impact on delay, edges likely to cause delay, edges likely to decrease delay and edges likely to strongly decrease delay (ex. when a public transport vehicle is speeding). We analyze the spatial and mode of transport properties of each cluster and provide insights into reasons of delay change patterns in each of the detected profiles.","authors":["Piotr Szymański","Michał Żołnieruk","Piotr Oleszczyk","Igor Gisterek"],"meta":["July 2017IEEE Transactions on Intelligent Transportation Systems PP(99)","DOI:10.1109/tits.2018.2852845"],"references":["276245114_Improving_Mass_Transit_Operations_by_Using_AVL-Based_Systems_A_Survey","259258947_AllAboard_A_System_for_Exploring_Urban_Mobility_and_Optimizing_Public_Transport_Using_Cellphone_Data","308747177_Public_Transit_Planning_and_Operation_Modeling_Practice_and_Behavior","292262674_Some_methods_for_classification_and_analysis_of_multivariate_observations","280852490_Mining_Ticketing_Logs_for_Usage_Characterization_with_Nonnegative_Matrix_Factorization","260029479_Intelligent_Transport_Systems_The_propensity_for_environmental_and_economic_benefits","255565406_IEEE_INTELLIGENT_TRANSPORTATION_SYSTEMS_SOCIETY","247678064_Sur_la_division_des_corp_materiels_en_parties","245675017_Cluster_analysis_of_multivariate_data_eIciency_versus_interpretability_of_classi7cations","245307190_Using_GPS_Data_to_Gain_Insight_into_Public_Transport_Travel_Time_Variability"]}