{"id":"318683927_Strategies_for_coordinated_multirobot_exploration_with_recurrent_connectivity_constraints","abstract":"During several applications, such as search and rescue, robots must discover new information about the environment and, at the same time, share operational knowledge with a base station through an ad hoc network. In this paper, we design exploration strategies that allow robots to coordinate with teammates to form such a network in order to satisfy recurrent connectivity constraints—that is, data must be shared with the base station when making new observations at the assigned locations. Current approaches lack in flexibility due to the assumptions made about the communication model. Furthermore, they are sometimes inefficient because of the synchronous way they work: new plans are issued only once all robots have reached their goals. This paper introduces two novel asynchronous strategies that work with arbitrary communication models. In this paper, ‘asynchronous’ means that it is possible to issue new plans to subgroups of robots, when they are ready to receive them. First, we propose a single-stage strategy based on Integer Linear Programming for selecting and assigning robots to locations. Second, we design a two-stage strategy to improve computational efficiency, by separating the problem of locations’ selection from that of robot-location assignments. Extensive testing both in simulation and with real robots show that the proposed strategies provide good situation awareness at the base station while efficiently exploring the environment.","authors":["Jacopo Banfi","Alberto Quattrini Li","Ioannis M. Rekleitis","Francesco Amigoni"],"meta":["April 2018Autonomous Robots 42(4)","DOI:10.1007/s10514-017-9652-y"],"references":["277255608_Optimized_link_state_routing_protocol_OLSR","271416928_Multi-robot_simultaneous_localization_and_uncertainty_reduction_on_maps_MR-SLURM","323741060_Communication-Restricted_Exploration_for_Search_Teams","318689135_Multirobot_online_construction_of_communication_maps","303885995_Asynchronous_multirobot_exploration_under_recurrent_connectivity_constraints","303138182_ROS_An_open-source_Robot_Operating_System","300576189_Time_Preference_for_Information_in_Multi-agent_Exploration_with_Limited_Communication","288241082_Ear-based_exploration_on_hybrid_metrictopological_maps","271883904_The_effects_of_exploration_strategies_and_communication_models_on_the_performance_of_cooperative_exploration","268334678_Intractability_of_Optimal_Multi-Robot_Path_Planning_on_Planar_Graphs"]}