{"id":"318604459_EnTagRec_An_enhanced_tag_recommendation_system_for_software_information_sites","abstract":"Software engineers share experiences with modern technologies using software information sites, such as Stack Overflow. These sites allow developers to label posted content, referred to as software objects, with short descriptions, known as tags. Tags help to improve the organization of questions and simplify the browsing of questions for users. However, tags assigned to objects tend to be noisy and some objects are not well tagged. For instance, 14.7% of the questions that were posted in 2015 on Stack Overflow needed tag re-editing after the initial assignment. To improve the quality of tags in software information sites, we propose EnTagRec⁺⁺, which is an advanced version of our prior work EnTagRec. Different from EnTagRec, EnTagRec⁺⁺ does not only integrate the historical tag assignments to software objects, but also leverages the information of users, and an initial set of tags that a user may provide for tag recommendation. We evaluate its performance on five software information sites, Stack Overflow, Ask Ubuntu, Ask Different, Super User, and Freecode. We observe that even without considering an initial set of tags that a user provides, it achieves Recall@5 scores of 0.821, 0.822, 0.891, 0.818 and 0.651, and Recall@10 scores of 0.873, 0.886, 0.956, 0.887 and 0.761, on Stack Overflow, Ask Ubuntu, Ask Different, Super User, and Freecode, respectively. In terms of Recall@5 and Recall@10, averaging across the 5 datasets, it improves upon TagCombine, which is the prior state-of-the-art approach, by 29.3% and 14.5% respectively. Moreover, the performance of our approach is further boosted if users provide some initial tags that our approach can leverage to infer additional tags: when an initial set of tags is given, Recall@5 is improved by 10%.","authors":["Shaowei Wang","David Lo","Bogdan Vasilescu","Alexander Serebrenik"],"meta":["April 2018Empirical Software Engineering 23(10)","DOI:10.1007/s10664-017-9533-1","Project: SE knowledge sharing and management (e.g., Stack Overflow, Github)"],"references":["303513494_An_Empirical_Study_on_the_Usage_of_the_Swift_Programming_Language","277934677_Automatic_mapping_of_user_tags_to_Wikipedia_concepts_The_case_of_a_QA_website_-_StackOverflow","272794664_Exploring_the_Use_of_Labels_to_Categorize_Issues_in_Open-Source_Software_Projects","342810142_Bayesian_Data_Analysis","308672536_Tagging_in_Assisted_Tracing","303206384_Data_Mining_Concepts_and_Techniques","283132226_TagCombine_Recommending_Tags_to_Contents_in_Software_Information_Sites","271454998_Labeled_LDA","271076919_Bayesian_Data_Analysis","270585325_Effect_Sizes_for_Research_A_Broad_Practical_Approach"]}