{"id":"318657698_From_triadic_closure_to_conference_closure_the_role_of_academic_conferences_in_promoting_scientific_collaborations","abstract":"An academic conference is not only a venue for publishing papers but also a nursery room for new scientific encounters. While previous research has investigated scientific collaboration mechanisms based on the triadic closure and focal closure, in this paper, we propose a new collaboration mechanism named conference closure. Conference closure means that scholars involved in a common conference may collaborate with each other in the future. We analyze the extent to which scholars will meet new collaborators from both the individual and community levels by using 22 conferences in the field of data mining extracted from DBLP digital library. Our results demonstrate the existence of conference closure and this phenomenon is more remarkable in conferences with high field rating and large scale attendees. Scholars involved in multiple conferences will encounter more collaborators from the conferences. Another interesting finding is that although most conference attendees are junior scholars with few publications, senior scholars with fruitful publications may gain more collaborations during the conference. Meanwhile, the conference closure still holds if we control the productivity homophily. Our study will shed light on evaluating the impact of a conference from the social function perspective based on the index of conference closure.","authors":["Wei Wang","Xiaomei Bai","Feng Xia","Teshome Megersa Bekele"],"meta":["July 2017Scientometrics 113(1)","DOI:10.1007/s11192-017-2468-x","Project: Scholarly Big data"],"references":["316262886_Scientific_collaboration_patterns_vary_with_scholars'_academic_ages","312178100_Big_Scholarly_Data_A_Survey","311337980_Bibliographic_Analysis_of_Nature_Based_on_Twitter_and_Facebook_Altmetrics_Data","307948584_Identifying_Anomalous_Citations_for_Objective_Evaluation_of_Scholarly_Article_Impact","303902118_Can_Academic_Conferences_Promote_Research_Collaboration","292672300_Evolution_and_convergence_of_the_patterns_of_international_scientific_collaboration","313146335_Top_six_reasons_to_attend_a_conference","307822863_An_Overview_of_Microsoft_Academic_Service_MAS_and_Applications","304613204_Building_successful_collaborations","303206384_Data_Mining_Concepts_and_Techniques"]}