{"id":"318655029_Towards_a_unified_analysis_of_brain_maturation_and_aging_across_the_entire_lifespan_A_MRI_analysis","abstract":"There is no consensus in literature about lifespan brain maturation and senescence, mainly because previous lifespan studies have been performed on restricted age periods and/or with a limited number of scans, making results instable and their comparison very difficult. Moreover, the use of nonharmonized tools and different volumetric measurements lead to a great discrepancy in reported results. Thanks to the new paradigm of BigData sharing in neuroimaging and the last advances in image processing enabling to process baby as well as elderly scans with the same tool, new insights on brain maturation and aging can be obtained. This study presents brain volume trajectory over the entire lifespan using the largest age range to date (from few months of life to elderly) and one of the largest number of subjects (N = 2,944). First, we found that white matter trajectory based on absolute and normalized volumes follows an inverted U-shape with a maturation peak around middle life. Second, we found that from 1 to 8–10 y there is an absolute gray matter (GM) increase related to body growth followed by a GM decrease. However, when normalized volumes were considered, GM continuously decreases all along the life. Finally, we found that this observation holds for almost all the considered subcortical structures except for amygdala which is rather stable and hippocampus which exhibits an inverted U-shape with a longer maturation period. By revealing the entire brain trajectory picture, a consensus can be drawn since most of the previously discussed discrepancies can be explained. Hum Brain Mapp, 2017.","authors":["Pierrick Coupé","Gwenaelle Catheline","Enrique Lanuza","Jose Vicente Manjon"],"meta":["July 2017Human Brain Mapping 38(11)","DOI:10.1002/hbm.23743","Project: Lifespan trajectory"],"references":["305631058_Structural_brain_development_between_childhood_and_adulthood_Convergence_across_four_longitudinal_samples","282872928_Trajectories_of_cortical_thickness_maturation_in_normal_brain_development_-_The_importance_of_quality_control_procedures","282067349_volBrain_An_Online_MRI_Brain_Volumetry_System","316723116_Freesurfer_cortical_normative_data_for_adults_using_Desikan-Killiany-Tourville_and_ex_vivo_protocols","311790965_Contributions_of_the_amygdala_to_emotion_processing_from_animal_models_to_human_behavior","302555703_Normative_data_for_subcortical_regional_volumes_over_the_lifetime_of_the_adult_human_brain","297598569_Brain_development_during_adolescence_A_mixed-longitudinal_investigation_of_cortical_thickness_surface_area_and_volume","297139510_The_Human_Nervous_System","290221168_Through_Thick_and_Thin_a_Need_to_Reconcile_Contradictory_Results_on_Trajectories_in_Human_Cortical_Development","283260752_Regional_growth_and_atlasing_of_the_developing_human_brain"]}