{"id":"318642508_Pattern_of_Task_Interpretation_and_Self-Regulated_Learning_Strategies_of_High_School_Students_and_College_Freshmen_during_an_Engineering_Design_Project","abstract":"The objective of this exploratory study was to describe patterns in self-regulated learning (SRL) for both high school students and college freshmen while engaged in a design activity. The main research question guiding this study was: How did high school and first-year college students self-regulate their approaches to learning when engaged in an engineering design project? Specific focus was given by exploring how these two groups of students engaged in (1) task interpretation in relation to reported strategy use during the design process; and (2) task interpretation in relation to reported strategy use in project management.\n\nStudents at one high school in the state of Colorado and first year undergraduate engineering students at one public university in the state of Utah participated in this study. High school students worked in an Architectural and Robotics Design classes (n=27). College freshmen worked in a mechanical engineering solid modeling course (n =70). A survey instrument and Web-based design journal entries were administered at early and\nlater stages of the project to capture students’ SRL, including task interpretation (TI) and reported use\nof planning (PS), cognitive (CS), and monitoring/fix-up (MF) strategies. Descriptive statistics, nonparametric\nstatistics, and graphical views were used to analyze survey responses. Entries from students’ design journals were segmented and coded using an SRL model and interpreted to triangulate and complement survey data to achieve better insight about the employed strategies of these two groups.\n\nNot surprisingly, findings suggested that, for the most part, first-year college students scored higher than high school students on task interpretation and reported use of planning, cognitive, and monitoring/fix-up strategies. Journal entries also revealed that college freshmen were more thorough in identifying and describing design\nstrategies for their projects than were their high school student counterparts. Most importantly, differences in the quality of SRL were observed within each group, suggesting that students at both educational levels varied in their selfregulated performance. Further, while students in both groups had relatively good awareness of task demands, they were less aware of how to translate that task understanding into proper plans and plan execution across the design process and project management. This article discusses potential implications for design instruction for both groups of students.","authors":["Oenardi Lawanto","Deborah L Butler","Sylvie C. Cartier","Harry B. Santoso"],"meta":["January 2013The Journal of STEM Education: Innovations and Research 14(4):34-46"],"references":["277405265_Assessing_Academic_Self-Regulated_Learning_among_Filipino_College_Students_The_Factor_Structure_and_Item_Fit","275657360_Engineering_Design_Processes_A_Comparison_of_Students_and_Expert_Practitioners","255592812_Unifying_Assessment_of_Freshman_Design_Teams_With_Team_Project_Management","312927300_Metacognitive_aspects_of_problem_solving","289011008_General_Versus_Specific_Intellectual_Competencies","288276945_Task_interpretation_and_self-regulating_strategies_in_engineering_design_project_An_exploratory_study","286823154_Self-Regulated_Learning_strategies_of_grades_9-12_students_in_design_project_Viewed_from_performance_and_gender_perspectives","283358997_Investigating_self-regulated_learning_using_in-depth_case_studies","281608999_The_Influence_of_Learning_Motivation_and_Learning_Strategies_on_College_Achievement_Results_of_a_Longitudinal_Analysis","272177856_Engineering_Design_Processes_A_Comparison_of_Students_and_Expert_Practitioners"]}