{"id":"318671090_A_Sentiment-and-Semantics-Based_Approach_for_Emotion_Detection_in_Textual_Conversations","abstract":"Emotions are physiological states generated in humans in reaction to internal or external events. They are complex and studied across numerous fields including computer science. As humans, on reading \"Why don't you ever text me!\" we can either interpret it as a sad or angry emotion and the same ambiguity exists for machines. Lack of facial expressions and voice modulations make detecting emotions from text a challenging problem. However, as humans increasingly communicate using text messaging applications, and digital agents gain popularity in our society, it is essential that these digital agents are emotion aware, and respond accordingly. In this paper, we propose a novel approach to detect emotions like happy, sad or angry in textual conversations using an LSTM based Deep Learning model. Our approach consists of semi-automated techniques to gather training data for our model. We exploit advantages of semantic and sentiment based embeddings and propose a solution combining both. Our work is evaluated on real world conversations and significantly outperforms traditional Machine Learning baselines as well as other off-the-shelf Deep Learning models.","authors":["Umang Gupta","Ankush Chatterjee","Radhakrishnan Srikanth","Puneet Agrawal"],"meta":["July 2017"],"references":["319770183_Imagenet_classification_with_deep_convolutional_neural_networks","318741395_Bag_of_Tricks_for_Efficient_Text_Classification","316371398_Fine-Grained_Emotion_Detection_in_Contact_Center_Chat_Utterances","312538118_Support-vector_networks","307955489_Distributed_representations_of_words_and_phrases_and_their_compositionality","305334463_Exploring_Fine-Grained_Emotion_Detection_in_Tweets","304269424_Emulating_Human_Conversations_using_Convolutional_Neural_Network-based_IR","301404843_Emotion_Detection_from_text_A_Survey","298330893_Smartphone-Based_Conversational_Agents_and_Responses_to_Questions_About_Mental_Health_Interpersonal_Violence_and_Physical_Health","284740464_Emotion_Theory_search_and_experience"]}