{"id":"318674996_Examining_the_validity_of_the_technological_pedagogical_content_knowledge_TPACK_framework_for_preservice_chemistry_teachers","abstract":"While various quantitative measures for assessing teachers’ technological pedagogical content knowledge (TPACK) have developed rapidly, few studies to date have comprehensively validated the structure of TPACK through various criteria of validity especially for content specific areas. In this paper, we examined how the TPACK survey measure is aligned with the TPACK lesson plan measure and how they are related to the measure of epistemological beliefs about chemistry. The participants were 280 Chinese preservice chemistry teachers enrolled in a university in China. Both exploratory and confirmatory factory analyses were performed on the TPACK survey measure to help to establish validity, including considerations for convergent and discriminant validity. This was followed by the invariance test to examine factorial validity as related to gender. To establish the predictive validity of TPACK, the relationships among teachers’ epistemological beliefs, TPACK, and their capacity for planning technology-integrated lessons were also examined. Overall, the results showed that all four types of validity looked at in this study (i.e., convergent, discriminant, factorial, and predictive) were satisfactorily established. Implications for TPACK research and teacher education are also discussed.","authors":["Feng Deng","Ching Sing Chai","Hyo-Jeong So","Yangyi Qian"],"meta":["July 2017Australasian Journal of Educational Technology 33(3)","DOI:10.14742/ajet.3508"],"references":["310674315_Examining_pre-service_teachers'_design_capacities_for_web-_based_21st_century_new_culture_of_learning","290044779_A_Review_of_Technological_Pedagogical_Content_Knowledge","272121880_TPACK_Development_in_Teacher_Education","305083682_The_relationship_between_teachers'_beliefs_and_teachers'_practices","288254859_Multivariate_data_analysis_Prentice_Hall","287625658_Demographic_Factors_TPACK_Constructs_and_Teachers'_Perceptions_of_Constructivist-Oriented_TPACK","286656148_How_do_we_measure_TPACK_Let_me_count_the_ways","283833077_Exploring_the_factor_structure_of_the_constructs_of_technological_pedagogical_content_knowledge_TPACK","283809556_Validating_and_modelling_technological_pedagogical_content_knowledge_framework_among_Asian_preservice_teachers","279641075_Learning_about_problem_based_learning_Student_teachers_integrating_technology_pedagogy_and_content_knowledge"]}