{"id":"318611226_A_Computationally_Efficient_Reconfigurable_Constant_Multiplication_Architecture_Based_on_CSD_Decoded_Vertical-Horizontal_Common_Sub-Expression_Elimination_Algorithm","abstract":"This paper introduces a computationally efficient hardware architecture for reconfigurable multiple constant multiplication block, which functions according to the canonical signed digit (CSD)-based vertical and horizontal common sub-expression elimination (VHCSE) algorithm. In the proposed architecture, the CSD decoded coefficient along with 4-b common sub-expressions (CSs) in the vertical direction and 4- and 8-b CSs in the horizontal direction reduces the required number of full adder cells and the adder depths. This technique helps in reducing area consumption by decreasing the number of coefficient multiplier adders by 59% than that of the binary VHCSE (VHBCSE) algorithm. This technique helps in reducing the average switching activity of the adder blocks used in each coefficient multiplier block by 26.1%, 25.6%, and 21.3%, while compared with those of the 2- and 3-b binary CS elimination (BCSE) and VHBCSE algorithms, respectively. For different orders of filter, the proposed one delivers 57.5% and 61.9% improvement in area-power product (APP) on an average compared with the VHBCSE and mixed integer programming algorithms, respectively. Experimental results of differently specified finite impulse response (FIR) filters ranging from 10 to 100 taps and the coefficients of 8, 12, and 16 b show the improvements of 42.8%, 53.6%, and 37%, respectively, in the average gate count and 51.8%, 43.5%, and 36.7% less propagation delay than those of earlier canonical double-based number representation method. Moreover, in the metric made of APP divided by throughput, the proposed technique experiences 63.7% improvement on an average over that of faithfully rounded truncated multiple constant multiplication/accumulation technique of designing constant multiplier and demonstrates its suitability for implementing efficient reconfigurable FIR filter.","authors":["Indranil Hatai","Indrajit Chakrabarti","Swapna Banerjee"],"meta":["July 2017Circuits and Systems I: Regular Papers, IEEE Transactions on PP(99):1-11","DOI:10.1109/TCSI.2017.2719053"],"references":["275113857_An_Efficient_VLSI_Architecture_of_a_Reconfigurable_Pulse-Shaping_FIR_Interpolation","274263656_An_Efficient_Constant_Multiplier_Architecture_Based_on_Vertical-Horizontal_Binary_Common_Sub-expression_Elimination_Algorithm_for_Reconfigurable_FIR_Filter_Synthesis","273395226_Fine-Grained_Critical_Path_Analysis_and_Optimization_for_Area-Time_Efficient_Realization_of_Multiple_Constant_Multiplications","294109884_A_New_Paradigm_of_Common_Subexpression_Elimination_by_Unification_of_Addition_and_Subtraction","291953436_Hypergraph_Based_Minimum_Arborescence_Algorithm_for_the_Optimization_and_Reoptimization_of_Multiple_Constant_Multiplications","285630203_A_Computationally_Efficient_Reconfigurable_FIR_Filter_Architecture_Based_on_Coefficient_Occurrence_Probability","284738098_Design_of_low_complexity_programmable_FIR_filters_using_multiplexers_array_optimization","273179482_Novel_Design_Algorithm_for_Low_Complexity_Programmable_FIR_Filters_Based_on_Extended_Double_Base_Number_System","271481300_A_novel_DA-based_architecture_for_efficient_computation_of_inner-product_of_variable_vectors","271464092_A_polynomial-time_algorithm_for_the_design_of_multiplierless_linear-phase_FIR_filters_with_low_hardware_cost"]}