{"id":"318687478_Finding_patients_using_similarity_measures_in_a_rare_diseases-oriented_clinical_data_warehouse_Dr_Warehouse_and_the_needle_in_the_needle_stack","abstract":"Objective: \nIn the context of rare diseases, it may be helpful to detect patients with similar medical histories, diagnoses and outcomes from a large number of cases with automated methods. To reduce the time to find new cases, we developed a method to find similar patients given an index case leveraging data from the electronic health records.\n\nMaterials and methods: \nWe used the clinical data warehouse of a children academic hospital in Paris, France (Necker-Enfants Malades), containing about 400,000 patients. Our model was based on a vector space model (VSM) to compute the similarity distance between an index patient and all the patients of the data warehouse. The dimensions of the VSM were built upon Unified Medical Language System concepts extracted from clinical narratives stored in the clinical data warehouse. The VSM was enhanced using three parameters: a pertinence score (TF-IDF of the concepts), the polarity of the concept (negated / not negated) and the minimum number of concepts in common. We evaluated this model by displaying the most similar patients for five different rare diseases: Lowe Syndrome (LOWE), Dystrophic Epidermolysis Bullosa (DEB), Activated PI3K delta Syndrome (APDS), Rett Syndrome (RETT) and Dowling Meara (EBS-DM), from the clinical data warehouse representing 18, 103, 21, 84 and 7 patients respectively.\n\nResults: \nThe percentages of index patients returning at least one true positive similar patient in the Top30 similar patients were 94% for LOWE, 97% for DEB, 86% for APDS, 71% for EBS-DM and 99% for RETT. The mean number of patients with the exact same genetic diseases among the 30 returned patients was 51%.\n\nConclusion: \nThis tool offers new perspectives in a translational context to identify patients for genetic research. Moreover, when new molecular bases are discovered, our strategy will help to identify additional eligible patients for genetic screening.","authors":["Nicolas Garcelon","Antoine Neuraz","Vincent Benoit","Salomon Rémi"],"meta":["July 2017Journal of Biomedical Informatics 73","DOI:10.1016/j.jbi.2017.07.016","Project: Dr Warehouse"],"references":["305396016_Clinical_spectrum_and_features_of_activated_PI3-kinase_delta_syndrome_a_large_patient_cohort_study","283575619_Undiagnosed_Diseases_Network_International_UDNI_White_paper_for_global_actions_to_meet_patient_needs","277311537_Personalized_Mortality_Prediction_Driven_by_Electronic_Medical_Data_and_a_Patient_Similarity_Metric","272423149_How_essential_are_unstructured_clinical_narratives_and_information_fusion_to_clinical_trial_recruitment","319770439_Efficient_Estimation_of_Word_Representations_in_Vector_Space","318699301_The_hypotonic_infant_case_study_of_central_core_disease","316805807_Differential_Diagnosis_for_the_Dermatologist","309366932_Improving_a_full-text_search_engine_The_importance_of_negation_detection_and_family_history_context_to_identify_cases_in_a_biomedical_data_warehouse","301690162_A_statistical_interpretation_of_term_specificity_and_its_application_in_retrieval","288700987_Novel_classification_method_for_remote_sensing_images_based_on_information_entropy_discretization_algorithm_and_vector_space_model"]}