{"id":"318746791_Enhanced_Local_Density_Estimation_in_Internet_of_Vehicles","abstract":"The Internet of vehicles allows connecting vehicles to the Internet to make all data from vehicles available for applications aimed towards improving safety and comfort for passengers. Density is one of the most important sensed data to gather. This information is mainly obtained through periodic messages broadcast by the neighbouring vehicles. However, the availability of this information depends on the Internet. A low penetration rate of Internet of vehicles, or the loss of Internet connection, can significantly affect the accuracy of the sensed density. Moreover, the reception rate of the periodic messages seriously drops at short distances caused by the broadcast storm problem in high-density scenarios. To address this problem, using inter-vehicular communications, we propose a segment-based approach for enhancing the accuracy of the local density estimation. This approach provides a highly accurate estimation with low overhead over the maximum vehicles transmission range to all the vehicles. The proposed approach is extensively evaluated analytically and by simulation. Performance evaluation results show that our approach SLDE allows about 3% of mean error ratio with low overhead over the maximum transmission range.","authors":["Noureddine Haouari","Samira Moussaoui","Sidi-Mohammed Senouci","Abdelwahab Boualouache"],"meta":["July 2017IET Communications 11(15)","DOI:10.1049/iet-com.2017.0154","Projects: QoS in VANETSIoTCollect"],"references":["279517873_Node_Density_Estimation_in_VANETs_Using_Received_Signal_Power","273394866_An_Overview_of_Internet_of_Vehicles","261228872_Analysis_of_distributed_algorithms_for_density_estimation_in_VANETs_Poster","225006684_Degradation_of_Communication_Range_in_VANETs_Caused_by_Interference_20_-_Real-World_Experiment","224394976_Vehicle-to-Vehicle_Communication_Fair_Transmit_Power_Control_for_Safety-Critical_Information","224368372_Evaluation_of_a_Neighbor-based_Vehicle_Density_Estimation_Scheme","312487183_Local_density_estimation_for_VANETs","271560504_Traffic_congestion_detection_in_large-scale_scenarios_using_vehicle-to-vehicle_communications","238985629_Traffic_Flow_Theory-A_Monograph","238007440_Store-Carry-Forward_Message_Dissemination_in_Vehicular_Ad-Hoc_Networks_with_Local_Density_Estimation"]}