{"id":"318794652_Exploring_the_use_of_online_video_games_to_detect_personality_dichotomies","abstract":"Purpose\nPersonality trait detection is a problem that has been gaining much attention in the computer science field recently. By leveraging users’ personality knowledge software applications are able to adapt their behaviour accordingly. To detect personality traits automatically users must substantially interact with software applications to gather enough information that describe their behaviour. For addressing this limitation, the authors explore the use of online video games as an alternative approach to detect personality dichotomies. The paper aims to discuss these issues.\n\nDesign/methodology/approach\nThe authors analyse the use of several online video games that exhibit features related with Myers-Briggs sensitive-intuitive personality dichotomy. Then, the authors build a user profile that describes users’ behaviour when interacting with online video games. Finally, the authors identify users’ personality by analysing their profile with different classification algorithms.\n\nFindings\nThe results show that games that obtained better results in the personality dichotomy detection exhibit features that had better match with the sensitive-intuitive dichotomy preferences. Moreover, the results show that the classification algorithms should satisfactorily deal with unbalanced data sets, since it is natural that the frequencies of the dichotomies types are unbalanced. In addition, in the context of personality trait detection, online video games possess several advantages over other type of software applications. By using games, users do not need to have previous experience, since they learn how to play during gameplay. Furthermore, the information and time needed to predict the sensitive-intuitive dichotomy using games is little.\n\nOriginality/value\nThis study shows that online video games are a promising environment in which the users’ personality dichotomies can be detected.","authors":["Juan Feldman","Ariel Monteserin","Analía Amandi"],"meta":["July 2017Online Information Review 41(2):00-00","DOI:10.1108/OIR-11-2015-0361"],"references":["312470401_Learningteaching_styles_in_engineering_education","313385761_Data_Mining_Practical_Machine_Learning_Tools_and_Techniques","286456650_Play_to_Pay_Adolescent_Video_Game_Play_STEM_Choice","275714345_MBTI_Manual_A_Guide_to_the_Development_and_Use_of_the_Myers-Briggs_Type_Indicator","275103886_Dimensions_of_video_game_behavior_and_their_relationships_with_personality","274701612_Moral_positioning_in_video_games_and_its_relation_with_dispositional_traits_The_emergence_of_a_social_dimension","274694413_A_Critique_of_the_Myers-Briggs_Type_Indicator_and_its_Operationalization_of_Carl_Jung's_Psychological_Types","271927811_Digital_Games_in_Education","270345168_The_influence_of_video_games_on_executive_functions_in_college_students","269873109_Youth_Science_Identity_Science_Learning_and_Gaming_Experiences"]}