{"id":"318781000_Finding_the_Right_Cutting_Planes_for_the_TSP","abstract":"Given an instance of the Traveling Salesman Problem (TSP), a reasonable way to get a lower bound on the optimal answer is to solve a linear programming relaxation of an integer programming formulation of the problem. These linear programs typically have an exponential number of constraints, but in theory they can be solved efficiently with the ellipsoid method as long as we have an algorithm that can take a solution and either declare it feasible or find a violated constraint. In practice, it is often the case that many constraints are violated, which raises the question of how to choose among them so as to improve performance. For the simplest TSP formulation it is possible to efficiently find all the violated constraints, which gives us a good chance to try to answer this question empirically. Looking at random two dimensional Euclidean instances and the large instances from TSPLIB, we ran experiments to evaluate several strategies for picking among the violated constraints. We found some information about which constraints to prefer, which resulted in modest gains, but were unable to get large improvements in performance. Categories and Subject Descriptors: G.1.6 [Numerical Analysis]: Optimization—Integer programming; G.4 [Mathematical Software]: Efficiency; G.2.2 [Discrete Mathematics]: Graph Theory—Graph Algorithms.","authors":["M.S. Levine"],"meta":["December 2000Journal of Experimental Algorithmics 5","DOI:10.1145/351827.384248"],"references":["242703842_MultiTerminal_Network_Flows","2456242_A_New_Approach_to_the_Minimum_Cut_Problem","285323814_On_the_solution_of_traveling_salesman_problems_documenta_mathematica_journal_der_deutschen_mathematiker-vereinigung_vol_Extra_Volume_ICM_III","265453391_The_traveling_salesman_problem_Bibliography","240339890_The_Traveling_Salesman_Problem_and_Minimum_Spanning_Trees","228057559_Minimum_Cuts_in_Near-Linear_Time","223823596_Analyzing_the_Held-Karp_TSP_Bound_A_Monotonicity_Property_with_Application","220668826_TSPLIB_A_traveling_salesman_problem_library","200035312_The_traveling-salesman_problem_and_minimum_spanning_trees_Part_II"]}