{"id":"318717156_MINTE_semantically_integrating_RDF_graphs","abstract":"The nature of the RDF data model allows for numerous descriptions of the same entity. For example, different RDF vocabularies may be utilized to describe pharmacogenomic data, and the same drug or gene is represented by different RDF graphs in DBpedia or Drug-bank. To provide a unified representation of the same real-world entity, RDF graphs need to be semantically integrated. Semantic integration requires the management of knowledge encoded in RDF vocabularies to determine the relatedness of different RDF representations of the same entity, e.g., axiomatic definition of vocabulary properties or resource equivalences. We devise MINTE, an integration technique that relies on both: knowledge stated in RDF vocabularies and semantic similarity measures to merge semantically equivalent RDF graphs, i.e., graphs corresponding to the same real-world entity. MINTE follows a two-fold approach to solve the problem of integrating RDF graphs. In the first step, MINTE implements a 1--1 weighted perfect matching algorithm to identify semantically equivalent RDF entities in different graphs. Then, MINTE relies on different fusion policies to merge triples from these semantically equivalent RDF entities. We empirically evaluate the performance of MINTE on data from DBpedia, Wiki-data, and Drugbank. The experimental results suggest that MINTE is able to accurately integrate semantically equivalent RDF graphs.","authors":["Diego Collarana","Mikhail Galkin","Ignacio Traverso","Maria-Esther Vidal"],"meta":["June 2017","DOI:10.1145/3102254.3102280","Conference: the 7th International Conference","Projects: Knowledge Graph Management RecipesLiDaKrA"],"references":["301765490_FuhSen_A_Federated_Hybrid_Search_Engine_for_building_a_knowledge_graph_on-demand","278705249_Efficient_RDF_Interchange_ERI_Format_for_RDF_Data_Streams","313556736_Limes_-a_time-efficient_approach_for_large-scale_link_discovery_on_the_web_of_data","309227772_FuhSen_A_Federated_Hybrid_Search_Engine_for_Building_a_Knowledge_Graph_On-Demand_Short_Paper","309020135_GADES_A_Graph-based_Semantic_Similarity_Measure","303098349_Efficient_Graph-Based_Document_Similarity","280113744_UnifiedViews_An_ETL_Framework_for_Sustainable_RDF_Data_Processing","269034052_Description_logic_programs","269032076_Description_logic_programs","267570227_Linked_Data_Integration_with_Conflicts"]}