{"id":"318721159_Quantum_machine_learning_A_classical_perspective","abstract":"Recently, increased computational power and data availability, as well as algorithmic advances, have led machine learning techniques to impressive results in regression, classification, data-generation and reinforcement learning tasks. Despite these impressive results, the proximity to the physical limits of chip fabrication alongside the increasing size of datasets are motivating a growing number of researchers to explore the possibility of harnessing the power of quantum computation to speed-up classical machine learning algorithms. Here we review the literature in quantum machine learning and discuss perspectives for a mixed readership of classical machine learning and quantum computation experts. Particular emphasis will be placed on clarifying the limitations of quantum algorithms, how they compare with their best classical counterparts and why quantum resources are expected to provide advantages for learning problems. Learning in the presence of noise and certain computationally hard problems in machine learning are identified as promising directions for the field. Practical questions, like how to upload classical data into quantum form, will also be addressed.","authors":["Carlo Ciliberto","Mark Herbster","Alessandro Davide Ialongo","Massimiliano Pontil"],"meta":["July 2017Proceedings of The Royal Society A Mathematical Physical and Engineering Sciences 474(2209)","DOI:10.1098/rspa.2017.0551"],"references":["344126771_On_quantum_neural_computing","325314772_Quantum_machine_learning","322016273_Tomography_and_generative_training_with_quantum_Boltzmann_machines","321067379_Quantum_Speed-Ups_for_Solving_Semidefinite_Programs","321066451_Quantum_SDP-Solvers_Better_Upper_and_Lower_Bounds","320387423_Quantum_Mechanics","319770355_Generative_Adversarial_Nets","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","319529248_Exact_sampling_with_coupled_Markov_chains_and_applications_to_statistical_mechanics","317572179_Guest_Column_A_Survey_of_Quantum_Learning_Theory"]}