{"id":"318707529_Security_towards_the_Edge_Sticky_Policy_Enforcement_for_Networked_Smart_Objects","abstract":"One of the hottest topics in the Internet of Things (IoT) domain relates to the ability of enabling computation and storage at the edges of the network. This is becoming a key feature in order to ensure the ability of managing in a scalable way service requests with low response times. This means being able to acquire, store, and process IoT-generated data closer to the data producers and data consumers. In this scenario, also security and privacy solutions must be applied in a capillary way at the edges of the network. In particular, a control on access to data generated by IoT devices is necessary for guaranteeing proper levels of security and privacy as well as for preventing violation attempts, while allowing data owners to monitor and control their information. In this paper, a sticky policy approach is proposed as a strategy for efficiently managing the access to IoT resources within an existing distributed middleware architecture. As demonstrated in the experimental evaluation, sticky policies represent a promising and efficient technique to increase the robustness (in a security perspective) of the IoT system.","authors":["Sabrina Sicari","Alessandra Rizzardi","Daniele Miorandi","Alberto Coen-Porisini"],"meta":["July 2017Information Systems 71","DOI:10.1016/j.is.2017.07.006"],"references":["306421089_Security_policy_enforcement_for_networked_smart_objects","303816152_AUPS_An_Open_Source_AUthenticated_PublishSubscribe_system_for_the_Internet_of_Things","300490582_A_Survey_of_Fog_Computing_Concepts_Applications_and_Issues","295397698_A_secure_and_quality-aware_prototypical_architecture_for_the_Internet_of_Things","281777826_Networked_Smart_Objects_Moving_Data_Processing_Closer_to_the_Source","270722796_Securing_Personal_Health_Records_in_the_Cloud_by_Enforcing_Sticky_Policies","266888035_Smart_An_Open_Data_Set_and_Tools_for_Enabling_Research_in_Sustainable_Homes","326435743_A_Meta-Control_Architecture_for_Orchestrating_Policy_Enforcement_Across_Heterogeneous_Information_Sources","273635349_A_Sticky_Policy_Framework_for_Big_Data_Security","269033980_From_privacy_promises_to_privacy_management"]}