{"id":"318725191_Using_Raspberry_Pi_and_Wyliodrin_for_teaching_novice_programmers_in_Secondary_Education","abstract":"Although programming is, in general, a motivating topic, most of the students become discouraged as they perceive programming as a very difficult task. Learning to program is one of the challenges for novices. The reason is that it consists both of acquiring programming knowledge (syntax and semantics) and developing problem-solving skills. In this paper, we present an approach for teaching programming to secondary education students using the Raspberry-Pi and the visual programming environment of Wyliodrin. The main purpose of the proposed case study was to engage students, increasing their curiosity about single-board computers, and to convey a positive conception of the tiny computer and programming environment of Wyliodrin as a powerful and amusing learning tool for novice programmers. The positive learning results from this case study indicate that Raspberry-Pi and Wyliodrin can be used as tools by supporting knowledge construction and programming, learning through the design of meaningful authentic projects, learning by doing in both the virtual and physical world, facing cognitive conflicts and learning by reflection and collaboration.","authors":["Vasileios Orfanakis","Stamatios J Papadakis"],"meta":["April 2017","Conference: 5th Panhellenic Conference \"Inclusion and use of ICT in the educational process\"At: Athens, Greece","Project: Διδασκαλία του προγραμματισμού σε αρχάριους προγραμματιστές-μαθητές της Πρωτοβάθμιας και της Δευτεροβάθμιας Εκπαίδευσης"],"references":["326676517_Home_Automation_with_NFC_Raspberry_Pi","317134540_Combining_mobile_technologies_in_environmental_education_A_Greek_case_study","315066728_The_Combined_Use_of_Lego_Mindstorms_NXT_and_App_Inventor_for_Teaching_Novice_Programmers","313849509_Using_Scratch_and_App_Inventor_for_teaching_introductory_programming_in_secondary_education_A_case_study","313087810_Designing_and_creating_an_educational_app_rubric_for_preschool_teachers","311999422_A_Workshop_to_Promote_Arduino-Based_Robots_as_Wide_Spectrum_Learning_Support_Tools","311474810_Influence_of_the_familiarization_with_scratch_on_future_teachers'_opinions_and_attitudes_about_programming_and_ICT_in_education","311400253_Digital_Student_Conference_Platform_Implementation_The_case_study_of_the_Research_Project_course","315385706_Smart_Home_Automation_with_Linux_and_Raspberry_Pi","313860037_Beginning_Sensor_Networks_with_Arduino_and_Raspberry_Pi"]}