{"id":"318745937_Adjustability_of_a_discrete_particle_swarm_optimization_for_the_dynamic_TSP","abstract":"This paper presents a detailed study of the discrete particle swarm optimization algorithm (DPSO) applied to solve the dynamic traveling salesman problem which has many practical applications in planning, logistics and chip manufacturing. The dynamic version is especially important in practical applications in which new circumstances, e.g., a traffic jam or a machine failure, could force changes to the problem specification. The DPSO algorithm was enriched with a pheromone memory which is used to guide the search process similarly to the ant colony optimization algorithm. The paper extends our previous work on the DPSO algorithm in various ways. Firstly, the performance of the algorithm is thoroughly tested on a set of newly generated DTSP instances which differ in the number and the size of the changes. Secondly, the impact of the pheromone memory on the convergence of the DPSO is investigated and compared with the version without a pheromone memory. Moreover, the results are compared with two ant colony optimization algorithms, namely the \\(\\mathcal {MAX}\\)–\\(\\mathcal {MIN}\\) ant system (MMAS) and the population-based ant colony optimization (PACO). The results show that the DPSO is able to find high-quality solutions to the DTSP and its performance is competitive with the performance of the MMAS and the PACO algorithms. Moreover, the pheromone memory has a positive impact on the convergence of the algorithm, especially in the face of dynamic changes to the problem’s definition.","authors":["Łukasz Strąk","Rafał Skinderowicz","Urszula Boryczka"],"meta":["November 2018Soft Computing 22(5):1-16","DOI:10.1007/s00500-017-2738-9"],"references":["312027904_A_survey_of_swarm_intelligence_for_dynamic_optimization_Algorithms_and_applications","308733354_A_particle_swarm_optimization_for_the_dynamic_vehicle_routing_problem","300040436_Ant_Colony_Optimization_on_a_Budget_of_1000","291283973_Application_of_Particle_Swarm_Optimization_Algorithm_to_Dynamic_Vehicle_Routing_Problem","277284831_MAX-MIN_ant_system","318295335_Analysis_of_the_population-based_ant_colony_optimization_algorithm_for_the_TSP_and_the_QAP","313749844_Particle_swarm_optimization","282666685_Heterogeneous_DPSO_Algorithm_for_DTSP","281146180_Dynamic_Vehicle_Routing_Problems_Three_Decades_and_Counting","280314493_Diversification_and_Entropy_Improvement_on_the_DPSO_Algorithm_for_DTSP"]}