{"id":"318709654_Altmetric_Scores_Short-Term_Popularity_or_Long-Term_Scientific_Importance","abstract":"Purpose\nThe purpose of this paper is to report on a three-year case study of the extent with which altmetrics compare to traditional metrics in certain subject areas for selected departments at the University of Cincinnati, College of Medicine (COM).\n\nDesign/methodology/approach\nA three-year analysis of peer-reviewed papers and invited editorials from 2009 to 2013 written by tenure-track faculty from 20 COM departments was done to explore what subject areas received the highest altmetric scores. Research output was searched in PubMed; articles were quantified by subject area, times cited in Scopus, and its altmetric score over each of three successive years.\n\nFindings\nThe topics of the highest scored altmetric papers ( n = 40) sample focused on stroke, obesity, and diabetes for all three years. Analysis of high initial altmetric scores over the course of the three years shifted from a possible predictor of future impact in the second year to no indicator of long-term interest in the scientific community as the public interest waned over time.\n\nResearch limitations/implications\nThe authors used Scopus Times Cited and Altmetrics.com to gather data.\n\nOriginality/value\nInitially assessed a total of 3,678 unique publications and worked with the 40 highest altmetric scores in subsequent years. Data showed that subjects of interest to the public receive the highest altmetric scores and the topic areas did not change over the course of the study. These initially high altmetric scores do not indicate long-term interest by the scientific community.","authors":["Edith Starbuck","Sharon Purtee"],"meta":["July 2017Digital Library Perspectives 33(2):00-00","DOI:10.1108/DLP-01-2017-0005"],"references":["299563269_Altmetrics_Documenting_the_Story_of_Research","267456008_Do_altmetrics_point_to_the_broader_impact_of_research_An_overview_of_benefits_and_disadvantages_of_altmetrics","263545091_Validity_of_altmetrics_data_for_measuring_societal_impact_A_study_using_data_from_Altmetric_and_F1000Prime","251573958_New_perspectives_on_article-level_metrics_Developing_ways_to_assess_research_uptake_and_impact_online","313593689_Too_Many_Journals","266207355_Altmetrics_as_a_means_of_assessing_scholarly_output","259783194_Do_altmetrics_correlate_with_citations_Extensive_comparison_of_altmetric_indicators_with_citations_from_a_multidisciplinary_perspective"]}