{"id":"318792893_Online_Social_Networking_as_a_Tool_to_Enhance_Learning_in_the_Mauritian_Education_System","abstract":"Social networking sites enable individuals to connect to each other to form online communities. In the last decade, online social networking (OSN) has become a fashionable means of communication among Internet users, particularly the young generation. It is known that the majority of adolescents log on their OSN accounts daily and stay log on for a prolonged period of time. Thus, social networking sites represent a potential technology that can be exploited to enhance learning so as to help students in their education. In this paper, the outcome of a major survey carried out among the secondary level students in Mauritius is reported. It is seen that most students are already using OSN for non-formal learning with 39% of the respondents stating that they make use of OSN to discuss school work. It is also observed that OSN acts as a platform for these adolescents to communicate and collaborate on school related projects or assignments. Most students agreed on the fact that OSN can be beneficial for their studies. It is also found that a small percentage of teachers are using OSN as a tool to facilitate teaching and learning. Therefore, a few recommendations are made in this paper with respect to the integration of OSN in the Mauritian secondary education system.","authors":["Kavi K. Khedo","Sheik Mohammad Roushdat Ally Elaheebocus","Ally Elaheebocus","Asslinah Mocktoolah"],"meta":["July 2012"],"references":["310753652_Social_networking_for_language_education","279664508_Designing_for_Learning_Online_Social_Networks_as_a_Classroom_Environment","241674556_Do_social_networking_technologies_have_a_place_in_formal_learning_environments","235279268_Online_social_networks_and_learning","266456534_Social_networking_sites_Transparency_in_online_education","258651129_Privacy_Issues_in_Online_Social_Networks","245589648_Building_Social_Networks_via_Computer_Networks_Creating_and_Sustaining_Distributed_Learning_Communi","235319153_Facebook_as_a_classroom_management_solution"]}