{"id":"318780323_Rising_above_the_gathering_storm_revisited_Rapidly_approaching_category_5","abstract":"In the face of so many daunting near-term challenges, U.S. government and industry are letting the crucial strategic issues of U.S. competitiveness slip below the surface. Five years ago, the National Academies prepared Rising Above the Gathering Storm, a book that cautioned: \"Without a renewed effort to bolster the foundations of our competitiveness, we can expect to lose our privileged position.\" Since that time we find ourselves in a country where much has changed--and a great deal has not changed. So where does America stand relative to its position of five years ago when the Gathering Storm book was prepared? The unanimous view of the authors is that our nation's outlook has worsened. The present volume, Rising Above the Gathering Storm, Revisited, explores the tipping point America now faces. Addressing America's competitiveness challenge will require many years if not decades; however, the requisite federal funding of much of that effort is about to terminate. Rising Above the Gathering Storm, Revisited provides a snapshot of the work of the government and the private sector in the past five years, analyzing how the original recommendations have or have not been acted upon, what consequences this may have on future competitiveness, and priorities going forward. In addition, readers will find a series of thought- and discussion-provoking factoids--many of them alarming--about the state of science and innovation in America. Rising Above the Gathering Storm, Revisited is a wake-up call. To reverse the foreboding outlook will require a sustained commitment by both individual citizens and government officials--at all levels. This book, together with the original Gathering Storm volume, provides the roadmap to meet that goal. While this book is essential for policy makers, anyone concerned with the future of innovation, competitiveness, and the standard of living in the United States will find this book an ideal tool for engaging their government representatives, peers, and community about this momentous issue. © 2010 by the National Academy of Sciences. All rights reserved.","authors":["Members of the \"Rising Above the Gathering Storm\" Committee","National Academy of Sciences","National Academy of Engineering","Institute of Medicine"],"meta":["October 2010","DOI:10.17226/12999"],"references":[]}