{"id":"318729622_Digital_Forensic_Approaches_for_Amazon_Alexa_Ecosystem","abstract":"Internet of Things devices such as the Amazon Echo are undoubtedly great sources of potential digital evidence due to their ubiquitous use and their always on mode of operation, constituting a human life black box. The Amazon Echo in particular plays a centric role for the cloud based intelligent virtual assistant Alexa developed by Amazon Lab126. The Alexa enabled wireless smart speaker is the gateway for all voice commands submitted to Alexa. Moreover, the IVA interacts with a plethora of compatible IoT devices and third party applications that leverage cloud resources. Understanding the complex cloud ecosystem that allows ubiquitous use of Alexa is paramount on supporting digital investigations when need raises. This paper discusses methods for digital forensics pertaining to the IVA Alexa ecosystem. The primary contribution of this paper consists of a new efficient approach of combining cloud native forensics with client side forensics, to support practical digital investigations. Based on a deep understanding of the targeted ecosystem, we propose a proof of concept tool, CIFT, that supports identification, acquisition and analysis of both native artifacts from the cloud and client centric artifacts from local devices.","authors":["Hyunji Chung","Jungheum Park","Sangjin Lee"],"meta":["July 2017Digital Investigation 22","DOI:10.1016/j.diin.2017.06.010"],"references":["301873216_Forensic_Acquisition_of_Cloud_Drives","299476289_Forensic_analysis_of_cloud-native_artifacts","277076879_FAIoT_Towards_Building_a_Forensics_Aware_Eco_System_for_the_Internet_of_Things","259332114_Internet_of_Things_Forensics_Challenges_and_Approaches","308300537_API-Based_Forensic_Acquisition_of_Cloud_Drives","288660566_Digital_evidence_challenges_in_the_internet_of_things","271635523_Dropbox_analysis_Data_remnants_on_user_machines","259164874_Cloud_storage_forensics_OwnCloud_as_a_case_study","259164852_Amazon_Cloud_Drive_forensic_analysis","259142913_Google_Drive_Forensic_analysis_of_data_remnants"]}