{"id":"318706165_Input_and_Age-Dependent_Variation_in_Second_Language_Learning_A_Connectionist_Account","abstract":"Language learning requires linguistic input, but several studies have found that knowledge of second language (L2) rules does not seem to improve with more language exposure (e.g., Johnson & Newport, 1989). One reason for this is that previous studies did not factor out variation due to the different rules tested. To examine this issue, we reanalyzed grammaticality judgment scores in Flege, Yeni-Komshian, and Liu's (1999) study of L2 learners using rule-related predictors and found that, in addition to the overall drop in performance due to a sensitive period, L2 knowledge increased with years of input. Knowledge of different grammar rules was negatively associated with input frequency of those rules. To better understand these effects, we modeled the results using a connectionist model that was trained using Korean as a first language (L1) and then English as an L2. To explain the sensitive period in L2 learning, the model's learning rate was reduced in an age-related manner. By assigning different learning rates for syntax and lexical learning, we were able to model the difference between early and late L2 learners in input sensitivity. The model's learning mechanism allowed transfer between the L1 and L2, and this helped to explain the differences between different rules in the grammaticality judgment task. This work demonstrates that an L1 model of learning and processing can be adapted to provide an explicit account of how the input and the sensitive period interact in L2 learning.","authors":["Marius Janciauskas","Franklin Chang"],"meta":["July 2017Cognitive Science A Multidisciplinary Journal 42 Suppl 2(02)","DOI:10.1111/cogs.12519"],"references":["295853540_A_First_Language_The_Early_Stages","344039498_A_Neurolinguistic_Theory_of_Bilingualism","319394257_Syntax_An_International_Handbook_of_Contemporary_Research","317836341_Word_Frequency_and_Lexical_Diffusion","307633159_Early_language_acquisition_and_adult_language_ability_What_sign_language_reveals_about_the_critical_period_for_language","306202664_What_does_the_critical_period_really_mean","305045864_The_acquisition_of_social_speech_and_politeness_formulae","304541636_Biological_Foundations_of_Language","303546995_The_differential_role_of_phonological_and_distributional_cues_in_grammatical_categorisation","297707377_Construction_grammar_and_second_language_acquisition"]}