{"id":"318839581_Counterspaces_for_women_of_color_in_STEM_higher_education_Marginal_and_central_spaces_for_persistence_and_success_COUNTERSPACES_FOR_WOMEN_OF_COLOR_IN_STEM_EDUCATION","abstract":"Counterspaces in science, technology, engineering, and mathematics (STEM) are often considered “safe spaces” at the margins for groups outside the mainstream of STEM education. The prevailing culture and structural manifestations in STEM have traditionally privileged norms of success that favor competitive, individualistic, and solitary practices—norms associated with White male scientists. This privilege extends to structures that govern learning and mark progress in STEM education that have marginalized groups that do not reflect the gender, race, or ethnicity conventionally associated with STEM mainstream success, thus necessitating spaces in which the effects of marginalization may be countered. Women of color is one such marginalized group. This article explores the struggles of women of color that threaten their persistence in STEM education and how those struggles lead them to search out or create counterspaces. It also examines the ways that counterspaces operate for women of color in STEM higher education, particularly how they function as havens from isolation and microaggressions. Using a framework of Critical Race Theory (CRT) and intersectionality theory and drawing on interview data from 39 women of color about their STEM higher education experiences, we describe five ways in which counterspaces operate: in peer-to-peer relationships; mentoring relationships; national STEM diversity conferences; STEM and non-STEM campus student groups; and STEM departments. Whereas most research has discussed counterspaces as racially or ethnically homogeneous social groups of peers at the margins, our research found that counterspaces vary in terms of the race/ethnicity, gender, and power levels of participants. We found that counterspaces can be physical settings, as well as conceptual and ideological. Additionally, we identified counterspaces both at the margins and at the center of STEM departments. Thus, our research expands the existing understanding of the types and functions of counterspaces and broadens the definition of what locations can be and should be considered counterspaces. © 2017 Wiley Periodicals, Inc. J Res Sci Teach 9999:XX–XX, 2017","authors":["Maria Ong","Janet Smith","Lily T. Ko"],"meta":["August 2017Journal of Research in Science Teaching 55(7)","DOI:10.1002/tea.21417"],"references":["320353627_Qualitative_research_design_An_interactive_approach","319028301_Supporting_Students'_Intentions_to_Persist_in_STEM_Disciplines_The_Role_of_Living-Learning_Programs_among_other_Social-Cognitive_Factors","317961536_An_Intersectional_Analysis_of_Latin_College_Women's_Counter-stories_in_Mathematics","321275099_Research_design_qualitative_quantitative_and_mixed_methods_approaches","317953571_Qualitative_inquiry_research_design_Choosing_among_five_approaches","317953357_The_discovery_of_grounded_theory","317433838_Handbook_of_Qualitative_Research","313754108_Grounded_theory","313175548_Demarginalizing_the_intersection_of_race_and_sex_A_black_feminist_critique_of_antidiscrimination_doctrine_feminist_theory_and_antiracist_politics","313107551_Critical_race_counterstories_along_the_chicanachicano_educational_pipeline"]}