{"id":"318828791_Distribution_of_Citations_Received_by_Scientific_Papers_Published_in_the_Imaging_Literature_From_2001_to_2010_Decreasing_Inequality_and_Polarization","abstract":"Objective: \nThe objective of this study was to assess the distribution of citations received by scientific papers published in the imaging literature between 2001 and 2010.\n\nMaterials and methods: \nWe extracted the number of citations of all articles and reviews for 5 years after publication using the Scopus (Elsevier) citation database of imaging journals between 2001 and 2010. We quantitatively analyzed article and review citations from each journal and each year, including the number, proportion, and annual number of citations of the most- (≥ 20 citations) and least-cited (three or fewer citations) papers; ratio of most-cited to least-cited papers; 75/25 percentile citation ratio; 90/10 percentile citation ratio; Gini coefficient; and Kolkata index.\n\nResults: \nOur analysis of 124,331 articles and 13,575 reviews from 121 journals showed that the proportion of most-cited articles (from 19.6% to 27.1%) and reviews (from 19.1% to 37.2%) increased from 2001 to 2010, whereas the proportion of least-cited articles (from 32.3% to 23.0%) and reviews (from 31.9% to 15.8%) declined over the same period. The annual numbers of citations of most-cited articles and reviews both reached a peak in the fourth year after publication, whereas those of least-cited articles and reviews reached a peak in the second and fist years, respectively, after publication and thereafter decreased. The 75/25 percentile ratio for articles declined from 41.1 to 27.5 between 2001 and 2010. Over the same time, the 75/25 percentile ratio for reviews declined from 47.4 to 22.9. The 90/10 percentile ratio for articles declined from 1730.8 to 188.7; for reviews, the 90/10 percentile ratio declined from 5788.0 to 100.7. The Gini coefficient of articles and reviews also declined from 0.6116 to 0.5721 for articles and from 0.6507 to 0.5649 for reviews; the k index, from 0.7260 to 0.7088 for articles from 0.7409 to 0.7072 for reviews.\n\nConclusion: \nInequality and polarization of citations consistently decreased in the imaging literature from 2001 to 2010.","authors":["soo jeong Yoon","Dae Young Yoon","Hyung Jin Lee","Sora Baek"],"meta":["August 2017American Journal of Roentgenology 209(2):248-254","DOI:10.2214/AJR.16.17769"],"references":[]}