{"id":"3188210_Requirements-based_monitors_for_real-time_systems","abstract":"Before designing safety- or mission-critical real-time systems, a specification of the required behaviour of the system should be produced and reviewed by domain experts. After the system has been implemented, it should be thoroughly tested to ensure that it behaves correctly. This is best done using a monitor, a system that observes the behaviour of a target system and reports if that behaviour is consistent with the requirements. Such a monitor can be used both as an oracle during testing and as a supervisor during operation. Monitors should be based on the documented requirements of the system.\nIf the target system is required to monitor or control real-valued quantities, then the requirements, which are expressed in terms of the monitored and controlled quantities, will allow a range of behaviours to account for errors and imprecision in observation and control of these quantities. Even if the controlled variables are discrete valued, the requirements must specify the timing tolerance. Because of the limitations of the devices used by the monitor to observe the environmental quantities, there is unavoidable potential for false reports, both negative and positive.\nThis paper discusses design of monitors for real-time systems, and examines the conditions under which a monitor will produce false reports. We describe the conclusions that can be drawn when using a monitor to observe system behaviour.","authors":["Dennis Peters","David Parnas"],"meta":["March 2002IEEE Transactions on Software Engineering 28(2):146-158","DOI:10.1109/32.988496","SourceIEEE Xplore"],"references":["306203647_Monitoring_and_debugging_of_distributed_real-time_systems","271452787_Test_template_framework","268041056_Distributed_Real-Time_Systems_Monitoring_Visualization_Debugging_and_Analysis","242505686_Functional_documentation_for_computer_systems","242428025_ZUM'95_The_Z_Formal_Specification_Notation","242365685_Specifying_software_for_complex_systems_new_techniques_and_their_application","242358781_Software_requirements_for_the_a-_7e_aircraft","239059295_Z_A_Formal_Specification_Notation","234824752_Test_template_framework_a_specification-based_testing_case_study","234806402_Monitoring_and_Debugging_of_Distributed_Real-Time_Systems"]}