{"id":"318802230_Toward_online_node_classification_on_streaming_networks","abstract":"The proliferation of networked data in various disciplines motivates a surge of research interests on network or graph mining. Among them, node classification is a typical learning task that focuses on exploiting the node interactions to infer the missing labels of unlabeled nodes in the network. A vast majority of existing node classification algorithms overwhelmingly focus on static networks and they assume the whole network structure is readily available before performing learning algorithms. However, it is not the case in many real-world scenarios where new nodes and new links are continuously being added in the network. Considering the streaming nature of networks, we study how to perform online node classification on this kind of streaming networks (a.k.a. online learning on streaming networks). As the existence of noisy links may negatively affect the node classification performance, we first present an online network embedding algorithm to alleviate this problem by obtaining the embedding representation of new nodes on the fly. Then we feed the learned embedding representation into a novel online soft margin kernel learning algorithm to predict the node labels in a sequential manner. Theoretical analysis is presented to show the superiority of the proposed framework of online learning on streaming networks (OLSN). Extensive experiments on real-world networks further demonstrate the effectiveness and efficiency of the proposed OLSN framework.","authors":["Ling Jian","Jundong Li","Huan Liu"],"meta":["January 2018Data Mining and Knowledge Discovery 32(6)","DOI:10.1007/s10618-017-0533-y"],"references":["320883001_Attributed_Network_Embedding_for_Learning_in_a_Dynamic_Environment","317487925_Accelerated_Attributed_Network_Embedding","317487135_Toward_Personalized_Relational_Learning","317378218_Attributed_Network_Embedding_for_Learning_in_a_Dynamic_Environment","329652278_Learning_with_Kernels_Support_Vector_Machines_Regularization_Optimization_and_Beyond","313718076_Combining_content_and_link_for_classification_using_matrix_factorization","313263126_Label_Informed_Attributed_Network_Embedding","313180917_Link-based_classification","310825146_FASCINATE_Fast_Cross-Layer_Dependency_Inference_on_Multi-layered_Networks","310825029_Positive-Unlabeled_Learning_in_Streaming_Networks","303564998_Budget_Online_Learning_Algorithm_for_Least_Squares_SVM","310823583_Collective_Classification_via_Discriminative_Matrix_Factorization_on_Sparsely_Labeled_Networks","306061975_Robust_Unsupervised_Feature_Selection_on_Networked_Data","305997704_node2vec_Scalable_Feature_Learning_for_Networks","301417929_Unsupervised_Streaming_Feature_Selection_in_Social_Media"]}