{"id":"318899430_Learning_Accurate_Low-Bit_Deep_Neural_Networks_with_Stochastic_Quantization","abstract":"Low-bit deep neural networks (DNNs) become critical for embedded applications due to their low storage requirement and computing efficiency. However, they suffer much from the non-negligible accuracy drop. This paper proposes the stochastic quantization (SQ) algorithm for learning accurate low-bit DNNs. The motivation is due to the following observation. Existing training algorithms approximate the real-valued elements/filters with low-bit representation all together in each iteration. The quantization errors may be small for some elements/filters, while are remarkable for others, which lead to inappropriate gradient direction during training, and thus bring notable accuracy drop. Instead, SQ quantizes a portion of elements/filters to low-bit with a stochastic probability inversely proportional to the quantization error, while keeping the other portion unchanged with full-precision. The quantized and full-precision portions are updated with corresponding gradients separately in each iteration. The SQ ratio is gradually increased until the whole network is quantized. This procedure can greatly compensate the quantization error and thus yield better accuracy for low-bit DNNs. Experiments show that SQ can consistently and significantly improve the accuracy for different low-bit DNNs on various datasets and various network structures.","authors":["Yinpeng Dong","Renkun Ni","Jianguo Li","Yurong Chen"],"meta":["December 2019International Journal of Computer Vision 127(7553)","DOI:10.1007/s11263-019-01168-2","Project: Deep Learning based Visual Understanding"],"references":["332816448_Learning_Accurate_Low-Bit_Deep_Neural_Networks_with_Stochastic_Quantization","316513734_Loss-aware_Binarization_of_Deep_Networks","313645102_Incremental_Network_Quantization_Towards_Lossless_CNNs_with_Low-Precision_Weights","319770430_Rich_feature_hierarchies_for_accurate_object_detection_and_semantic_segmentation","319770420_Semantic_Image_Segmentation_with_Deep_Convolutional_Nets_and_Fully_Connected_CRFs","319770343_Predicting_Parameters_in_Deep_Learning","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","319769911_Faster_R-CNN_Towards_Real-Time_Object_Detection_with_Region_Proposal_Networks","317730239_Accelerating_Deep_Convolutional_Networks_using_low-precision_and_sparsity","311609041_Deep_Residual_Learning_for_Image_Recognition"]}