{"id":"318868791_Why_do_developers_use_trivial_packages_an_empirical_case_study_on_npm","abstract":"Code reuse is traditionally seen as good practice. Recent trends have pushed the concept of code reuse to an extreme, by using packages that implement simple and trivial tasks, which we call `trivial packages'. A recent incident where a trivial package led to the breakdown of some of the most popular web applications such as Facebook and Netflix made it imperative to question the growing use of trivial packages.\nTherefore, in this paper, we mine more than 230,000 npm packages and 38,000 JavaScript applications in order to study the prevalence of trivial packages. We found that trivial packages are common and are increasing in popularity, making up 16.8% of the studied npm packages. We performed a survey with 88 Node.js developers who use trivial packages to understand the reasons and drawbacks of their use. Our survey revealed that trivial packages are used because they are perceived to be well implemented and tested pieces of code. However, developers are concerned about maintaining and the risks of breakages due to the extra dependencies trivial packages introduce. To objectively verify the survey results, we empirically validate the most cited reason and drawback and find that, contrary to developers' beliefs, only 45.2% of trivial packages even have tests. However, trivial packages appear to be `deployment tested' and to have similar test, usage and community interest as non-trivial packages. On the other hand, we found that 11.5% of the studied trivial packages have more than 20 dependencies. Hence, developers should be careful about which trivial packages they decide to use.","authors":["Rabe Abdalkareem","Olivier Nourry","Sultan Wehaibi","Suhaib Mujahid"],"meta":["August 2017","DOI:10.1145/3106237.3106267","Conference: the 2017 11th Joint Meeting"],"references":["318332722_Examining_User_Complaints_of_Wearable_Apps_A_Case_Study_on_Android_Wear","315696391_Developer_Mistakes_in_Writing_Android_Manifests_An_Empirical_Study_of_Configuration_Errors","342183905_A_Coefficient_of_Agreement_for_Nominal_Scales","316180063_On_Code_Reuse_from_StackOverflow_An_Exploratory_Study_on_Android_Apps","314831912_Predicting_problems_caused_by_component_upgrades","312333741_An_Empirical_Comparison_of_Dependency_Issues_In_OSS_Packaging_Ecosystems","310821510_How_to_break_an_API_cost_negotiation_and_community_values_in_three_software_ecosystems","309614365_Discovering_bug_patterns_in_JavaScript","308761817_On_the_topology_of_package_dependency_networks_A_comparison_of_three_programming_language_ecosystems","303513482_Mining_Android_Apps_to_Recommend_Permissions"]}