{"id":"318806064_Design_Guidelines_and_Empirical_Case_Study_for_Scaling_Authentic_Inquiry-based_Science_Learning_via_Open_Online_Courses_and_Interactive_Biology_Cloud_Labs","abstract":"The Next Generation Science Standards (NGSS) and other national frameworks are calling for much more sophisticated approaches to STEM education, centered around the integration of complex experimentation (including real labs, not just simulations), data collection and analysis, modeling, and data-driven argumentation, i.e., students can behave like real scientists. How to implement such complex approaches in scalable ways is an unsolved challenge - both for presential and distance education. Here we report on the iterative design and large-scale deployment of an open online course with a “biology cloud experimentation lab” (using living cells) that engaged remote learners (> 300 students) in the scientific practices of experimentation, modeling and data analysis to investigate the phototaxis of a microorganism. We demonstrate (1) the robustness and scalability of the cloud lab technology (> 2,300 experiments run), (2) the design principles and synergistic integration of multiple UI and learning activities and suitable data formats to facilitate NGSS-aligned science activities, and (3) design features that leverages the natural variability of real biology experiments to instigate authentic inquiry. This platform and course content are now suited for large-scale adaptation in formal K-16 education; and we provide recommendations for inquiry-based science learning in general.","authors":["Zahid Hossain","Engin Bumbacher","Alison Brauneis","Monica Diaz"],"meta":["July 2017International Journal of Artificial Intelligence in Education 28(1)","DOI:10.1007/s40593-017-0150-3","Project: Cloud Biology Labs"],"references":["316940597_Authentic_Science_Inquiry_Learning_at_Scale_Enabled_by_an_Interactive_Biology_Cloud_Experimentation_Lab","311500560_Interactive_and_scalable_biology_cloud_experimentation_for_scientific_inquiry_and_education","299343605_Virtual_and_Remote_Labs_in_Education_a_Bibliometric_Analysis","289290348_The_State_of_MOOCs_from_2008_to_2014_A_Critical_Analysis_and_Future_Visions","309085201_America's_lab_report_Investigations_in_High_School_Science","288652291_Improving_learning_in_MOOCs_with_cognitive_science","285628426_Democratizing_education_Examining_access_and_usage_patterns_in_massive_open_online_course","284280795_Share_and_share_alike","284035345_Nonlinear_Dimensionality_Reduction_by_Locally_Linear_Embedding","273458328_Real-time_and_turn-based_biology_online_experimentation"]}