{"id":"318873108_Literature_Review_of_Crowd_Management_A_Hajj_Case_Study","abstract":"Pilgrimage is one of the five pillars of Islam, which is a duty every Muslim should perform once during his\nlifetime. Over than two millions Muslims from all the world gather in Makkah for one of the world's largest\npilgrimages. All those pilgrims are obligated to be accommodated at Hajj ritual sites, which are the Kaaba,\nMina, Arafat and Muzdalifah. With this huge number of pilgrims in the holy city, managing the crowd is a\ncomplicated task, especially in the geographical area for the movement of pilgrims, the fixed underlying\nroad-network infrastructure between the different worship places, the annually increasing number of\npilgrims and also the short duration of Hajj. As a result of this, huge crowd and difficulties in control have\nled to fatal accidents among the pilgrims. By the last decade, overcrowding management became a big\nchallenge for the Saudi Arabian authorities and Hajj organizers. Scientists have started research projects to\nprovide several methodologies for crowd monitoring and estimation of its density. In this work, we tried to\npresent a literature review about the Hajj in order to help scientists for future contribution and have lots\ninformation about this new field of research.","authors":["Jihen Fourati","Brahim Issaoui","Kamel Zidi"],"meta":["January 2017","DOI:10.5220/0006472103460351","Conference: 14th International Conference on Informatics in Control, Automation and Robotics","Project: Home Health Care Service"],"references":["279219992_An_Intelligent_Computational_Real-time_Virtual_Environment_Model_for_Efficient_Crowd_Management","238836908_A_Model_of_Driver_Behavior_at_High_Speed_Signalized_Intersections","236293372_A_Proposed_Computer-Based_System_Architecture_for_Crowd_Management_of_Pilgrims_using_Thermography","224169745_Hajj_crowd_simulation_based_on_intelligent_agent","220231376_Situated_Cellular_Agents_Approach_to_Crowd_Modeling_and_Simulation","265296732_Analytical_and_Computer_Modelling_of_Transportation_Systems_for_Traffic_Bottleneck_Resolution_A_Hajj_Case_Study","251615093_Applying_TRIZ_principles_in_crowd_management","242393279_The_causes_and_prevention_of_crowd_disasters","221647249_Behavior_Analysis_and_Dynamic_Crowd_Management_in_Video_Surveillance_System"]}