{"id":"318813787_Independent_Feedback_Vertex_Set_for_P_5-Free_Graphs","abstract":"The NP-complete problem Feedback Vertex Set is that of deciding whether or not it is possible, for a given integer $k\\geq 0$, to delete at most $k$ vertices from a given graph so that what remains is a forest. The variant in which the deleted vertices must form an independent set is called Independent Feedback Vertex Set and is also NP-complete. In fact, even deciding if an independent feedback vertex set exists is NP-complete and this problem is closely related to the $3$-Colouring problem, or equivalently, to the problem of deciding whether or not a graph has an independent odd cycle transversal, that is, an independent set of vertices whose deletion makes the graph bipartite. We initiate a systematic study of the complexity of Independent Feedback Vertex Set for $H$-free graphs. We prove that it is NP-complete if $H$ contains a claw or cycle. Tamura, Ito and Zhou proved that it is polynomial-time solvable for $P_4$-free graphs. We show that it remains polynomial-time solvable for $P_5$-free graphs. We prove analogous results for the Independent Odd Cycle Transversal problem, which asks whether or not a graph has an independent odd cycle transversal of size at most $k$ for a given integer $k\\geq 0$. Finally, in line with our underlying research aim, we compare the complexity of Independent Feedback Vertex Set for $H$-free graphs with the complexity of $3$-Colouring, Independent Odd Cycle Transversal and other related problems.","authors":["Marthe Bonamy","Konrad Kazimierz Dabrowski","Carl Feghali","Matthew Johnson"],"meta":["July 2017Algorithmica 81(2)","DOI:10.1007/s00453-018-0474-x"],"references":["318813958_Independent_Feedback_Vertex_Sets_for_Graphs_of_Bounded_Diameter","317932042_Minimum_Connected_Transversals_in_Graphs_New_Hardness_Results_and_Tractable_Cases_Using_the_Price_of_Connectivity","314094686_On_line_graphs_of_subcubic_triangle-free_graphs","280329742_Dominating_Induced_Matchings_for_P_8-free_Graphs_in_Polynomial_Time","317944770_Boundary_classes_for_graph_problems_involving_non-local_properties","317751674_Three-Coloring_and_List_Three-Coloring_of_Graphs_Without_Induced_Paths_on_Seven_Vertices","317614409_Finding_Dominating_Induced_Matchings_in_S_223-Free_Graphs_in_Polynomial_Time","285296502_Independent_Set_in_P_5_-Free_Graphs_in_Polynomial_Time","284758661_A_note_on_stable_sets_and_colorings_of_graphs","284039089_Reducibility_among_combinatorial_problems"]}