{"id":"318833924_Pre-computed_tsunami_inundation_database_and_forecast_simulation_in_Pelabuhan_Ratu_Indonesia","abstract":"We built a pre-computed tsunami inundation database in Pelabuhan Ratu, one of tsunami-prone areas on the southern coast of Java, Indonesia, which can be employed for a rapid estimation of tsunami inundation during an event. The pre-computed tsunami waveforms and inundations are from a total of 340 scenarios ranging from 7.5 to 9.2 in moment magnitude scale (Mw), including simple fault models of 208 thrust faults and 44 tsunami earthquakes on the plate interface, as well as 44 normal faults and 44 reverse faults in the outer-rise region. Using our tsunami inundation forecasting algorithm (NearTIF), we could rapidly estimate the tsunami inundation in Pelabuhan Ratu for three different hypothetical earthquakes. The first hypothetical earthquake is a megathrust earthquake type (Mw 9.0) offshore Sumatra which is about 600 km from Pelabuhan Ratu to represent a worst-case event in the far-field. The second hypothetical earthquake (Mw 8.5) is based on a slip deficit rate estimation from geodetic measurements and represents a most likely large event. The third hypothetical earthquake is a tsunami earthquake type (Mw 8.1) which often occurs south of Java. We compared the tsunami inundation maps produced by the NearTIF algorithm with results of direct forward inundation modeling for the hypothetical earthquakes. The tsunami inundation maps produced from both methods are similar for the three cases. However, the tsunami inundation map from the inundation database can be obtained in much shorter time (1 min) than the one from a forward inundation modeling (40 min). These indicate that the NearTIF algorithm based on pre-computed inundation database is reliable and useful for tsunami warning purposes. This study also demonstrates that the NearTIF algorithm can work well, though the earthquake source is located outside the area of fault model database because it uses a time shifting procedure for the best-fit scenario searching.","authors":["U. Setiyono","Aditya Riadi Gusman","Kenji Satake","Yushiro Fujii"],"meta":["August 2017Pure and Applied Geophysics 174(8)","DOI:10.1007/s00024-017-1633-8"],"references":["301893392_Near-field_tsunami_forecast_system_based_on_near_real-time_seismic_moment_tensor_estimation_in_the_regions_of_Indonesia_the_Philippines_and_Chile","289244790_Local_tsunami_warnings_Perspectives_from_recent_large_events","273508075_Parallel_Implementation_of_Dispersive_Tsunami_Wave_Modeling_with_a_Nesting_Algorithm_for_the_2011_Tohoku_Tsunami","345851588_Tsunami_Hazard_Mitigation_at_Palabuhanratu_Indonesia","299649737_Application_of_Array_Back-projection_to_Tsunami_Prediction_and_Early_Warning","285788513_Tsunami_of_the_Sumba_earthquake_of_August_19_1977","282953754_Earthquake_Hazard_Mitigation_and_Real-Time_Warnings_of_Tsunamis_and_Earthquakes","280020417_Surface_Deformation_due_to_Shear_and_Tensile_Faults_in_a_Half_Space","276507588_Large-scale_high-speed_tsunami_prediction_for_the_Great_Nankai_Trough_Earthquake_on_the_K_computer","271856226_Near-Field_Tsunami_Inundation_Forecast_Using_the_Parallel_TUNAMI-N2_Model_Application_to_the_2011_Tohoku-Oki_Earthquake_Combined_with_Source_Inversions"]}