{"id":"318820255_Algorithmic_regulation_A_critical_interrogation","abstract":"Innovations in networked digital communications technologies, including the rise of “Big Data,” ubiquitous computing, and cloud storage systems, may be giving rise to a new system of social ordering known as algorithmic regulation. Algorithmic regulation refers to decisionmaking systems that regulate a domain of activity in order to manage risk or alter behavior through continual computational generation of knowledge by systematically collecting data (in real time on a continuous basis) emitted directly from numerous dynamic components pertaining to the regulated environment in order to identify and, if necessary, automatically refine (or prompt refinement of) the system's operations to attain a pre-specified goal. This study provides a descriptive analysis of algorithmic regulation, classifying these decisionmaking systems as either reactive or pre-emptive, and offers a taxonomy that identifies eight different forms of algorithmic regulation based on their configuration at each of the three stages of the cybernetic process: notably, at the level of standard setting (adaptive vs. fixed behavioral standards), information-gathering and monitoring (historic data vs. predictions based on inferred data), and at the level of sanction and behavioral change (automatic execution vs. recommender systems). It maps the contours of several emerging debates surrounding algorithmic regulation, drawing upon insights from regulatory governance studies, legal critiques, surveillance studies, and critical data studies to highlight various concerns about the legitimacy of algorithmic regulation.","authors":["Karen Yeung"],"meta":["July 2017Regulation & Governance 12(6)","DOI:10.1111/rego.12158"],"references":["355826056_Intelligent_Monitoring_Assessing_the_ability_of_the_Care_Quality_Commission's_statistical_surveillance_tool_to_predict_quality_and_prioritise_NHS_hospital_inspections","346624964_The_Black_Box_Society_The_Secret_Algorithms_That_Control_Money_and_Information","346503490_The_Politics_of_Possibility_Risk_and_Security_Beyond_Probability","345972615_Due_Process_and_Fair_Procedures_A_Study_of_Administrative_Procedures","345970284_EU_Administrative_Law","329213984_10_Containing_the_Promise_of_Insurance_Adverse_Selection_and_Risk_Classification","318909599_Regulating_by_robot_Administrative_decision_making_in_the_Machine-learning_era","315361198_Learning_from_Regulatory_Disasters","314911875_Constructing_and_Contesting_Legitimacy_and_Accountability_in_Polycentric_Regulatory_Regimes","314573588_Design-Based_Regulation_and_Patient_Safety_A_Regulatory_Studies_Perspective"]}