{"id":"318855224_Analysis_of_Sci-Hub_downloads_of_computer_science_papers","abstract":"The scientific knowledge is disseminated by research papers. Most of the research literature is copyrighted by publishers and avail- able only through paywalls. Recently, some websites offer most of the recent content for free. One of them is the controversial website Sci-Hub that enables access to more than 47 million pirated research papers. In April 2016, Science Magazine published an article on Sci-Hub activity over the period of six months and publicly released the Sci-Hub’s server log data. The mentioned paper aggregates the view that relies on all downloads and for all fields of study, but these findings might be hiding interesting patterns within computer science. The mentioned Sci-Hub log data was used in this paper to analyse downloads of computer science papers based on DBLP’s list of computer science publications. The top downloads of computer science papers were analysed, together with the geographical location of Sci-Hub users, the most downloaded publishers, types of papers downloaded, and downloads of computer science papers per publication year. The results of this research can be used to improve legal access to the most relevant scientific repositories or journals for the computer science field.","authors":["Darko Androcec"],"meta":["January 2017","DOI:10.1515/ausi-2017-0006"],"references":["329125087_Pirating_European_Studies","317117356_Fast_and_Furious_at_Publishers_The_Motivations_behind_Crowdsourced_Research_Sharing","313256376_Fast_and_Furious_at_Publishers_The_Motivations_behind_Crowdsourced_Research_Sharing","303599895_In_dramatic_statement_European_leaders_call_for_'immediate'_open_access_to_all_scientific_papers_by_2020","301719843_Who's_downloading_pirated_papers_Everyone","301717796_Who's_downloading_pirated_papers_Everyone","301717793_My_love-hate_of_Sci-Hub","299570945_Scholarly_Sharing_via_Twitter_icanhazpdf_Requests_for_Health_Sciences_Literature","274141154_Bibliogifts_in_LibGen_A_study_of_a_text-sharing_platform_driven_by_biblioleaks_and_crowdsourcing","221580101_The_DBLP_Computer_Science_Bibliography_Evolution_Research_Issues_Perspectives"]}