{"id":"318815950_Systematic_analysis_of_DNA_crosslink_repair_pathways_during_development_and_aging_in_Caenorhabditis_elegans","abstract":"DNA interstrand crosslinks (ICLs) are generated by endogenous sources and chemotherapeutics, and pose a threat to genome stability and cell survival. Using Caenorhabditis elegans mutants, we identify DNA repair factors that protect against the geno-toxicity of ICLs generated by trioxsalen/ultraviolet A (TMP/UVA) during development and aging. Mutations in nucleotide excision repair (NER) components (e.g. XPA-1 and XPF-1) imparted extreme sensitivity to TMP/UVA relative to wild-type animals , manifested as developmental arrest, defects in adult tissue morphology and functionality, and shortened lifespan. Compensatory roles for global-genome (XPC-1) and transcription-coupled (CSB-1) NER in ICL sensing were exposed. The analysis also revealed contributions of homologous recom-bination (BRC-1/BRCA1), the MUS-81, EXO-1, SLX-1 and FAN-1 nucleases, and the DOG-1 (FANCJ) heli-case in ICL resolution, influenced by the replicative-status of the cell/tissue. No obvious or critical role in ICL repair was seen for non-homologous end-joining (cku-80) or base excision repair (nth-1, exo-3), the Fanconi-related proteins BRC-2 (BRCA2/FANCD1) and FCD-2 (FANCD2), the WRN-1 or HIM-6 (BLM) helicases, or the GEN-1 or MRT-1 (SNM1) nucle-ases. Our efforts uncover replication-dependent and-independent ICL repair networks, and establish nematodes as a model for investigating the repair and consequences of DNA crosslinks in metazoan development and in adult post-mitotic and proliferative germ cells.","authors":["David M Wilson III","Matthias Rieckher","Ashley B. Williams","Björn Schumacher"],"meta":["July 2017Nucleic Acids Research 45(16)","DOI:10.1093/nar/gkx660","Project: DNA damage response pathways in development and ageing."],"references":["306389571_Transcription-coupled_repair_an_update","299569345_Interplay_between_Fanconi_anemia_and_homologous_recombination_pathways_in_genome_integrity","295088525_Mechanisms_of_interstrand_DNA_crosslink_repair_and_human_disorders","278411536_The_ERCC1_and_ERCC4_XPF_genes_and_gene_products","303462094_XPA_A_key_scaffold_for_human_nucleotide_excision_repair","303030721_Involvement_of_Translesion_Synthesis_DNA_Polymerases_in_DNA_Interstrand_Crosslink_Repair","289584100_Systemic_DNA_damage_responses_in_aging_and_diseases","280794121_Repair_of_cisplatin-induced_DNA_interstrand_crosslinks_by_a_replication-independent_pathway_involving_transcription-coupled_repair_and_translesion_synthesis","276146922_Tissue_specific_response_to_DNA_damage_C_elegans_as_role_model","272358999_Orchestral_maneuvers_at_the_damaged_sites_in_nucleotide_excision_repair"]}