{"id":"318839733_Particle_Image_Velocimetry_Experiment_Analysis_Using_Large-Eddy_Simulation_Application_to_Plasma_Actuators","abstract":"This article presents an analysis of a planar particle image velocimetry experiment aiming at measuring the phase-averaged velocity fields of a synthetic jet generated by a plasma synthetic jet actuator. Three major sources of uncertainty related to this type of experiment are examined: the phase-averaging process, the estimation of the vertical position of the wall into which the actuator is inserted, and the position of the laser sheet plane. Furthermore, the present work investigates the errors related to the dynamics of the particles used for seeding this type of high-speed transient flow. As expected, uncertainties associated with the phase-averaging process and the estimation of the wall position may be directly estimated from the measurements. However, estimation of the uncertainties originating from the position of the laser sheet plane and the errors related to the particle dynamics require additional information. In the present work, an original methodology relying on a numerical model of the actuator is thus proposed. This model, based on a large-eddy simulation, is able to reproduce the main features of the jet observed in the experiments and is used to generate realistic synthetic particle images. The influence of the laser sheet position on the velocity uncertainties and the errors associated with the particle dynamics are then explored. Experimental and numerical findings are considered to conclude in a quantitative manner on the dominant sources of uncertainty for such experiments and on the errors induced by particle dynamics that should be expected.","authors":["F. Laurendeau","Olivier Léon","Francois Chedevergne","Jean-Mathieu Senoner"],"meta":["August 2017AIAA Journal 55(318):1-14","DOI:10.2514/1.J055687"],"references":["313793085_Effect_of_slotted_exit_orifice_on_performance_of_plasma_synthetic_jet_actuator","282200036_Experimental_and_numerical_response_of_a_high-Reynolds-number_M_06_jet_to_a_Plasma_Synthetic_Jet_actuator","280633262_Numerical_Modeling_of_Dispersed_Two-Phase_Flows","307884096_A_drag_coefficient_correlation","285599496_Equation_of_motion_for_a_small_rigid_sphere_in_a_nonuniform_flow","281734605_Particle_response_analysis_for_particle_image_velocimetry_in_supersonic_flows","280158950_Transient_ejection_phase_modeling_of_a_Plasma_Synthetic_Jet_actuator","277818590_Collaborative_framework_for_PIV_uncertainty_quantification_Comparative_assessment_of_methods","268564063_Experimental_Characterization_of_a_Supersonic_Flow_Control_Actuator","268557971_Plasma_Synthetic_Jet_for_Flow_Control"]}