{"id":"318829902_On_Automating_the_Doctrine_of_Double_Effect","abstract":"The doctrine of double effect (DDE) is a long-studied ethical principle that governs when actions that have both positive and negative effects are to be allowed. The goal in this paper is to automate DDE. We briefly present DDE, and use a first-order modal logic, the deontic cognitive event calculus, as our framework to formalize the doctrine. We present formalizations of increasingly stronger versions of the principle, including what is known as the doctrine of triple effect. We then use our framework to simulate successfully scenarios that have been used to test the presence of the principle in human subjects. Our framework can be used in two different modes. One can use it to build DDE-compliant autonomous systems from scratch, or one can use it to verify that a given AI system is DDE-complaint, by applying a DDE layer on an existing system or model. For the latter mode, the underlying AI system can be built using any architecture (planners, deep neural networks, bayesian networks, knowledge-representation systems, or a hybrid); as long as the system exposes a few parameters in its model, such verification is possible. The role of the DDE layer here is akin to a (dynamic or static) software verifier that examines existing software modules. Finally, we end by sketching initial work on how one can apply our DDE layer to the STRIPS-style planning model, and to a modified POMDP model. This is preliminary work to illustrate the feasibility of the second mode, and we hope that our initial sketches can be useful for other researchers in incorporating DDE in their own frameworks.","authors":["Naveen Sundar Govindarajulu","Selmer Bringsjord"],"meta":["August 2017","DOI:10.24963/ijcai.2017/658","Conference: Twenty-Sixth International Joint Conference on Artificial Intelligence"],"references":["256661523_Using_IsabelleHOL_to_Verify_First-Order_Relativity_Theory","319497913_Counterfactuals_Logic_Programming_and_Agent_Morality","300222699_Modelling_Moral_Reasoning_and_Ethical_Responsibility_with_Logic_Programming","292092820_Intricate_Ethics_Rights_Responsibilities_and_Permissible_Harm","285932600_Elements_of_Moral_Cognition_Rawls'_Linguistic_Analogy_and_the_Cognitive_Science_of_Moral_and_Legal_Judgment","273237160_Intensional_Logic_and_the_Metaphysics_of_Intentionality","272768450_Is_the_Principle_of_Double_Effect_Morally_Acceptable","243675729_Intensional_Logic_and_the_Metaphysics_of_Intentionality","238719836_The_Collected_Papers_of_Gerard_Gentzen","224088977_Verifying_equivalence_of_memories_using_a_first_order_logic_theorem_prover","216722059_Modeling_Rational_Agents_within_a_BDI-architecture","8685066_Get_out_of_jail_free_The_doctrine_of_double_effect_in_English_law"]}