{"id":"318868848_A_symbolic_justice_violations_transition_system_for_unrealizable_GR1_specifications","abstract":"One of the main challenges of reactive synthesis, an automated procedure to obtain a correct-by-construction reactive system, is to deal with unrealizable specifications. Existing approaches to deal with unrealizability, in the context of GR(1), an expressive assume-guarantee fragment of LTL that enables efficient synthesis, include the generation of concrete counter-strategies and the computation of an unrealizable core. Although correct, such approaches produce large and complicated counter-strategies, often containing thousands of states. This hinders their use by engineers.\nIn this work we present the Justice Violations Transition System (JVTS), a novel symbolic representation of counter-strategies for GR(1). The JVTS is much smaller and simpler than its corresponding concrete counter-strategy. Moreover, it is annotated with invariants that explain how the counter-strategy forces the system to violate the specification. We compute the JVTS symbolically, and thus more efficiently, without the expensive enumeration of concrete states. Finally, we provide the JVTS with an on-demand interactive concrete and symbolic play.\nWe implemented our work, validated its correctness, and evaluated it on 14 unrealizable specifications of autonomous Lego robots as well as on benchmarks from the literature. The evaluation shows not only that the JVTS is in most cases much smaller than the corresponding concrete counter-strategy, but also that its computation is faster.","authors":["Aviv Kuvent","Shahar Maoz","Jan Oliver Ringert"],"meta":["August 2017","DOI:10.1145/3106237.3106240","Conference: the 2017 11th Joint Meeting"],"references":["309614547_On_well-separation_of_GR1_specifications","308797136_Control_design_for_hybrid_systems_with_TuLiP_The_Temporal_Logic_Planning_toolbox","299909728_GR1_synthesis_for_LTL_specification_patterns","305252912_Slugs_Extensible_GR1_Synthesis","303886455_Reactive_high-level_behavior_synthesis_for_an_Atlas_humanoid_robot","287030856_Predicate_abstraction_for_reactive_synthesis","285607353_Assume-Guarantee_Scenarios_Semantics_and_Synthesis","262212194_Synthesizing_nonanomalous_event-based_controllers_for_liveness_goals","261120280_Counter_play-out_Executing_unrealizable_scenario-based_specifications","260634701_Explaining_Impossible_High-Level_Robot_Behaviors"]}