{"id":"318915444_Unsupervised_Feature_Selection_in_Signed_Social_Networks","abstract":"The rapid growth of social media services brings a large amount of high-dimensional social media data at an unprecedented rate. Feature selection is powerful to prepare high-dimensional data by finding a subset of relevant features. A vast majority of existing feature selection algorithms for social media data exclusively focus on positive interactions among linked instances such as friendships and user following relations. However, in many real-world social networks, instances may also be negatively interconnected. Recent work shows that negative links have an added value over positive links in advancing many learning tasks. In this paper, we study a novel problem of unsupervised feature selection in signed social networks and propose a novel framework SignedFS. In particular, we provide a principled way to model positive and negative links for user latent representation learning. Then we embed the user latent representations into feature selection when label information is not available. Also, we revisit the principle of homophily and balance theory in signed social networks and incorporate the signed graph regularization into the feature selection framework to capture the first-order and the second-order proximity among users in signed social networks. Experiments on two real-world signed social networks demonstrate the effectiveness of our proposed framework. Further experiments are conducted to understand the impacts of different components of SignedFS.","authors":["Kewei Cheng","Jundong Li","Huan Liu"],"meta":["August 2017","DOI:10.1145/3097983.3098106","Conference: the 23rd ACM SIGKDD International Conference"],"references":["318830302_Reconstruction-based_Unsupervised_Feature_Selection_An_Embedded_Approach","309738293_Challenges_of_Feature_Selection_for_Big_Data_Analytics","309193548_Unsupervised_Sentiment_Analysis_for_Social_Media_Images","284788086_A_Survey_of_Signed_Network_Mining_in_Social_Media","313453500_Toward_Time-Evolving_Feature_Selection_on_Dynamic_Networks","312634059_Recommendations_in_Signed_Social_Networks","310825146_FASCINATE_Fast_Cross-Layer_Dependency_Inference_on_Multi-layered_Networks","310823450_FeatureMiner_A_Tool_for_Interactive_Feature_Selection","306061975_Robust_Unsupervised_Feature_Selection_on_Networked_Data","301417929_Unsupervised_Streaming_Feature_Selection_in_Social_Media"]}