{"id":"318959509_Feature_selection_techniques_in_bioinformatics","abstract":"Machine learning methods are often used to classify objects described by hundreds of attributes; however, as the dimensionality of the data rises, the amount of data required to provide a reliable analysis grows exponentially. A popular approach to this problem of high-dimensional datasets is to search for a projection of the data onto a smaller number of variables (or features) which preserves the information as much as possible. Feature selection is an important step in data mining and is used in various subjects including genetics, medicine, and bioinformatics. In many bioinformatics problems the number of features is significantly larger than the number of samples (high feature to sample ratio datasets) and feature selection techniques have become an apparent need in many bioinformatics applications. This article provides the reader aware of the possibilities of feature selection, providing a basic taxonomy of feature selection techniques and discussing its uses in bioinformatics applications including sequence analysis, microarray analysis, discovering Statistically-Equivalent Feature Subsets in the R Package MXM, classification of pre-miRNAs and Mass spectra analysis.","authors":["Mohamad Reza Hosseini","Naser Nematbakhsh","Motahareh Nadimi"],"meta":["July 2017","Conference: کنفرانس ملی پژوهش های نوین در برق، کامپیوتر و مهندسی پزشکی"],"references":["303682994_Journal_of_Statistical_Software_Feature_Selection_with_the_R_Package_MXM_Discovering_Statistically-Equivalent_Feature_Subsets","291689871_Comparison_of_Feature_Selection_Techniques_in_Machine_Learning_for_Anatomical_Brain_MRI_in_Dementia","290153132_Learning_Bayesian_Networks_with_the_bnlearn_R_Package","279274803_A_Review_of_Feature_Selection_and_Feature_Extraction_Methods_Applied_on_Microarray_Data","263662705_Classification_and_feature_selection_techniques_in_data_mining","313706874_Adaptation_in_natural_and_artificial_systems","312455832_R_A_Language_and_Environment_for_Statistical_Computing","279795067_Use_of_proteomic_patterns_in_serum_to_identify_ovarian_cancer","261278344_A_review_of_the_stability_of_feature_selection_techniques_for_bioinformatics_data","259482895_A_survey_on_feature_selection_methods"]}