{"id":"318981945_A_numerical_method_for_junctions_in_networks_of_shallow-water_channels","abstract":"There is growing interest in developing mathematical models and appropriate numerical methods for problems involving networks formed by, essentially, one-dimensional (1D) domains joined by junctions. Examples include hyperbolic equations in networks of gas tubes, water channels and vessel networks for blood and lymph in the human circulatory system. A key point in designing numerical methods for such applications is the treatment of junctions, i.e. points at which two or more 1D domains converge and where the flow exhibits multidimensional behaviour. This paper focuses on the design of methods for networks of water channels. Our methods adopt the finite volume approach to make full use of the two-dimensional shallow water equations on the true physical domain, locally at junctions, while solving the usual one-dimensional shallow water equations away from the junctions. In addition to mass conservation, our methods enforce conservation of momentum at junctions; the latter seems to be the missing element in methods currently available. Apart from simplicity and robustness, the salient feature of the proposed methods is their ability to successfully deal with transcritical and supercritical flows at junctions, a property not enjoyed by existing published methodologies. Systematic assessment of the proposed methods for a variety of flow configurations is carried out. The methods are directly applicable to other systems, provided the multidimensional versions of the 1D equations are available.","authors":["Francesca Bellamoli","Lucas Omar Mueller","Eleuterio Toro"],"meta":["August 2017Applied Mathematics and Computation 337","DOI:10.1016/j.amc.2018.05.034"],"references":["275251619_Coupling_constants_and_the_generalized_Riemann_problem_for_isothermal_junction_flow","264248655_Hemodynamic_performance_of_the_Fontan_circulation_compared_with_a_normal_biventricular_circulation_a_computational_model_study","316710017_Treating_network_junctions_in_finite_volume_solution_of_transient_gas_flow_models","282419596_Brain_venous_haemodynamics_neurological_diseases_and_mathematical_modelling_A_review","279937683_Diffusion-Wave_Flood_Routing_in_Channel_Networks","279375035_Application_of_Relaxation_Scheme_to_Wave-Propagation_Simulation_in_Open-Channel_Networks","265175229_Enhanced_global_mathematical_model_for_studying_cerebral_venous_blood_flow","263984889_Coupling_traffic_flow_networks_to_pedestrian_motion","260250407_Flooding_in_urban_drainage_systems_Coupling_hyperbolic_conservation_laws_for_sewer_systems_and_surface_flow","259767649_A_global_multiscale_mathematical_model_for_the_human_circulation_with_emphasis_on_the_venous_system"]}