{"id":"318986275_MABO-TSCH_Multi-hop_And_Blacklist-based_Optimized_Time_Synchronized_Channel_Hopping","abstract":"Emerging Industrial Internet of Things applications, such as smart factories, require reliable communication and robustness against interference from colocated wireless systems. To address these challenges, frequency-hopping spread spectrum has been used by different protocols, including IEEE802.15.4-2015 TSCH. Frequency-hopping spread spectrum can be improved with the aid of blacklists to avoid bad frequencies. The quality of channels in most environments shows significant spatial-temporal variation, which limits the effectiveness of simple blacklisting schemes. In this article, we propose an enhanced blacklisting solution to improve the TSCH protocol. The proposed algorithms work in a distributed fashion, where each pair of receiver/transmitter nodes negotiates a local blacklist, based on the estimation of packet delivery ratio. We model the channel quality estimation as a multiarmed bandit problem and show that it is possible to create blacklists that provide results close to optimal without any separate learning phase. The proposed algorithms are implemented in OpenWSN and evaluated through simulations in 2 different scenarios with about 40 motes and experiments using an indoor testbed with 40 TelosB motes.","authors":["Pedro Henrique Gomes","Thomas Watteyne","Bhaskar Krishnamachari"],"meta":["August 2017Transactions on Emerging Telecommunications Technologies 29(1):e3223","DOI:10.1002/ett.3223","Project: Machine Learning"],"references":["275853183_Multi-Channel_Data_Collection_for_Throughput_Maximization_in_Wireless_Sensor_Networks","260367055_Algorithms_for_multi-armed_bandit_problems","224677468_Radio_Channel_Quality_in_Industrial_Wireless_Sensor_Networks","224186284_A_Comprehensive_Analysis_of_the_MAC_Unreliability_Problem_in_IEEE_802154_Wireless_Sensor_Networks","304287002_Enhanced_Time-Slotted_Channel_Hopping_in_WSNs_Using_Non-intrusive_Channel-Quality_Estimation","273394829_Distributed_Stochastic_Online_Learning_Policies_for_Opportunistic_Spectrum_Access","271325478_OpenWSN_A_Standards-Based_Low-Power_Wireless_Development_Environment","265971527_Adaptive_time_slotted_channel_hopping_for_wireless_sensor_networks","262206503_Radio_link_quality_estimation_in_wireless_sensor_networks_A_survey","241193519_Adaptive_channel_hopping_for_wireless_sensor_networks"]}