{"id":"318907533_A_Cognitive_Modeling_Approach_to_Strategy_Formation_in_Dynamic_Decision_Making","abstract":"Decision-making is a high-level cognitive process based on cognitive processes like perception, attention, and memory. Real-life situations require series of decisions to be made, with each decision depending on previous feedback from a potentially changing environment. To gain a better understanding of the underlying processes of dynamic decision-making, we applied the method of cognitive modeling on a complex rule-based category learning task. Here, participants first needed to identify the conjunction of two rules that defined a target category and later adapt to a reversal of feedback contingencies. We developed an ACT-R model for the core aspects of this dynamic decision-making task. An important aim of our model was that it provides a general account of how such tasks are solved and, with minor changes, is applicable to other stimulus materials. The model was implemented as a mixture of an exemplar-based and a rule-based approach which incorporates perceptual-motor and metacognitive aspects as well. The model solves the categorization task by first trying out one-feature strategies and then, as a result of repeated negative feedback, switching to two-feature strategies. Overall, this model solves the task in a similar way as participants do, including generally successful initial learning as well as reversal learning after the change of feedback contingencies. Moreover, the fact that not all participants were successful in the two learning phases is also reflected in the modeling data. However, we found a larger variance and a lower overall performance of the modeling data as compared to the human data which may relate to perceptual preferences or additional knowledge and rules applied by the participants. In a next step, these aspects could be implemented in the model for a better overall fit. In view of the large interindividual differences in decision performance between participants, additional information about the underlying cognitive processes from behavioral, psychobiological and neurophysiological data may help to optimize future applications of this model such that it can be transferred to other domains of comparable dynamic decision tasks.","authors":["Sabine Prezenski","André Brechmann","Susann Wolff","Nele Russwinkel"],"meta":["August 2017Frontiers in Psychology 8","DOI:10.3389/fpsyg.2017.01335"],"references":["310469236_Reversal_Learning_in_Humans_and_Gerbils_Dynamic_Control_Network_Facilitates_Learning","307392956_A_Proposed_Method_of_Matching_ACT-R_and_EEG-Data","306415714_Towards_a_General_Model_of_Repeated_App_Usage","288929460_Modeling_paradigms_in_ACT-R","275637268_Workload_of_Airport_Tower_Controllers_Empirical_Validation_of_a_Macro-cognitive_Model","273326224_Using_Data-Driven_Model-Brain_Mappings_to_Constrain_Formal_Models_of_Cognition","302892689_Decision_making_in_sport_A_cognitive_perspective","285613679_Using_the_ACT-R_cognitive_architecture_in_combination_with_fMRI_data","282482028_An_online_database_of_ACT-R_parameters_Towards_a_transparent_community-based_approach_to_model_development","279119534_Rule-_plus-exception_model_of_classification_learning"]}