{"id":"318926743_Rule-Based_and_Genetic_Algorithm_for_Automatic_Gamelan_Music_Composition","abstract":"This research aims to develop a system of automatic gamelan music composition. Gamelan is the traditional ensemble music of Java, Indonesia. The authors propose a model of automatic gamelan music composition which consists of knowledge, rules, and random generation. There are three types of knowledge, basic, construction, and melodic knowledge. The basic knowledge contains the general knowledge of gamelan music. The construction knowledge controls the components building a composition. The melodic knowledge controls quality of the sound. The knowledge is transformed into rules of notes arrangement used to produce the characteristic sound of gamelan music. Genetic algorithm is used to generate a composition. Gatra, the smallest unit in a composition that contains four beats (notes), is used as a variable to construct the genes of a chromosome. The fitness value is measured based on the weight of notes distribution, identical gatras and melodic features. The evaluation is conducted to measure the quality of sound of “ladrang laras slendro pathet manyura” composition created by the system. The evaluation is conducted based on Turing test which involves human experts to recognize the composition created by the system. The results show that the model of automatic gamelan music composition proposed in this research is effective. All the gamelan experts state that it is very difficult to find the differences between the composition created by the system when it is randomly arranged and other compositions created by humans. 4 out of 6 gamelan experts failed to recognize a composition created by the system.","authors":["Khafiizh Hastuti","Azhari Azhari","Aina Musdholifah","Rahayu Supanggah"],"meta":["June 2017International Review on Modelling and Simulations (IREMOS) 10(3):202","DOI:10.15866/iremos.v10i3.11479","Project: Gamelan Composer"],"references":["318695793_A_Method_for_Automatic_Gamelan_Music_Composition","228602423_Towards_a_framework_for_the_evaluation_of_machine_compositions","47394069_A_genetic_algorithm_for_composing_music","316028427_Building_Melodic_Feature_Knowledge_of_Gamelan_Music_Using_Apriori_Based_on_Functions_in_Sequence_AFiS_Algorithm","312389259_Bach_in_a_box_The_evolution_of_four_part_baroque_harmony_using_the_genetic_algorithm","263963883_Algorithmic_Composition_Paradigms_of_Automated_Music_Generation","262449799_A_genetic_algorithm_approach_to_improve_automated_music_composition","249881773_A_Grammar_of_the_Musical_Genre_Srepegan","234777366_Experimental_Music_Composition_with_an_Electronic_Computer","228939886_Why_a_laptop_orchestra","220740294_Genetic_algorithms_and_the_abc_music_notation_language_for_rock_music_composition"]}