{"id":"318919867_When_is_a_Network_a_Network_Multi-Order_Graphical_Model_Selection_in_Pathways_and_Temporal_Networks","abstract":"We introduce a framework for the modeling of sequential data capturing pathways of varying lengths observed in a network. Such data are important, e.g., when studying click streams in the Web, travel patterns in transportation systems, information cascades in social networks, biological pathways, or time-stamped social interactions. While it is common to apply graph analytics and network analysis to such data, recent works have shown that temporal correlations can invalidate the results of such methods. This raises a fundamental question: When is a network abstraction of sequential data justified?Addressing this open question, we propose a framework that combines Markov chains of multiple, higher orders into a multi-layer graphical model that captures temporal correlations in pathways at multiple length scales simultaneously. We develop a model selection technique to infer the optimal number of layers of such a model and show that it outperforms baseline Markov order detection techniques. An application to eight real-world data sets on pathways and temporal networks shows that it allows to infer graphical models that capture both topological and temporal characteristics of such data. Our work highlights fallacies of network abstractions and provides a principled answer to the open question when they are justified. Generalizing network representations to multi-order graphical models, it opens perspectives for new data mining and knowledge discovery algorithms.","authors":["Ingo Scholtes"],"meta":["August 2017","DOI:10.1145/3097983.3098145","Conference: the 23rd ACM SIGKDD International Conference"],"references":["277311838_RSC_Mining_and_Modeling_Temporal_Activity_in_Social_Media","266081742_Data_on_face-to-face_contacts_in_an_office_building_suggest_a_low-cost_vaccination_strategy_based_on_community_linkers","226528784_Good_versus_optimal_Why_network_analytic_methods_need_more_systematic_evaluation","225198879_Model-Based_Clustering_and_Visualization_of_Navigation_Patterns_on_a_Web_Site","38367041_Statistical_Inference_About_Markov_Chains","313184847_A_universal_algorithm_for_sequential_data_compression","312623777_Controllability_of_temporal_networks_An_analysis_using_higher-order_networks","280773148_Modern_temporal_network_theory_A_colloquium","241624113_Are_web_users_really_Markovian","237128705_A_Combinatorial_Problem","26692136_Revisiting_the_Foundations_of_Network_Analysis","3082787_Lempel_A_A_Universal_Algorithm_for_Sequential_Data_Compression_IEEE_Transactions_on_Information_Theory_233_337-343"]}