{"id":"318992902_Green_Communication_via_Cooperative_Protocols_using_Message-Passing_Decoder_over_AWGN_Channels","abstract":"In wireless networks, the cooperative diversity is an implicit form of space diversity commonly used when other conventional transmit diversity methods might not be practical. It was largely proved that cooperative transmission, where a source and a relay cooperate to communicate with a unique destination, is power-efﬁcient compared to the point-to-point transmission. However, the model considered when stating this conclusion is counting only the transmission power consumption. In this paper, we study the effect of taking into account not only the transmission power at each transmission node but also the processing power consumed in each reception node on the overall end-to-end performance. We formulate the optimization problem aiming to minimize the total power consumption in order to achieve a target performance constraint, where the total power consumption stands for the sum of the transmission power and the processing power consumed in the decoding (neglecting other forms of power consumption). Our analysis relies on the characterization of an information-theoretic bound on the decoding power of any modern code to achieve a speciﬁed bit error probability while operating at a certain gap from the capacity. As this bound is built on the sphere-packing analysis, the present study focuses on message-passing decoders. Using this theoretical framework, the improvement of well-known cooperative protocols over the original non-cooperative point-to-point system system is reinvestigated in terms of total power consumption. Thanks to this theoretical framework, a new classiﬁcation of the studied cooperative protocols is given revealing some surprizing conclusions. In particular, the selective decode-\nand-forward protocol is no more constantly prefered to its simpler alternative, i.e. the decode-and-forward protocol.","authors":["Haïfa Farès","Baptiste Vrigneau","Olivier Berder","Pascal Scalart"],"meta":["August 2017IET Communications 11(15)","DOI:10.1049/iet-com.2016.1188"],"references":["306376872_Energy-Efficient_Cooperative_Network_Coding_With_Joint_Relay_Scheduling_and_Power_Allocation","280104695_Millimeter-wave_Gbps_Broadband_Evolution_towards_5G_Fixed_Access_and_Backhaul","308847113_Green_communication_via_HARQ_protocols_using_message-passing_decoder_over_AWGN_channels","305982660_Three-terminal_communication_channels","299570417_Vehicular_Communication_for_5G_Cooperative_Small_Cell_Networks","285546973_Autonomous_Relaying_Scheme_With_Minimum_User_Power_Consumption_in_Cooperative_Multicast_Communications","269328142_Outage_and_energy_efficiency_tradeoff_for_multi-flow_cooperative_communication_systems","261463186_Adaptive_amplification_for_amplify-and-forward_dual-hop_cooperative_systems","261386629_When_and_how_should_decoding_power_be_considered_for_achieving_high_energy_efficiency","261205533_Amplify_and_forward_relaying_Channel_model_and_outage_behaviour"]}