{"id":"318974929_On_the_hail_detection_using_satellite_passive_microwave_radiometers_and_precipitation_radar","abstract":"In previous studies, remote sensing properties of hailstorms have been discussed using various spaceborne sensors. Relationships between hail occurrence and strong passive microwave brightness temperature depressions have been established. Using a 16-yr precipitation-feature database derived from the Tropical Rainfall Measuring Mission (TRMM) satellite, the performance of the TRMM Precipitation Radar and TRMM Microwave Imager is further investigated for hail detection. Detection criteria for hail larger than 19 mm are separately developed from Ku-band radar reflectivity and microwave brightness temperature properties of precipitation features that are collocated with surface hail reports over the southeastern and south-central United States. A threshold of 44 dBZ at -22°C is found to have the highest critical success index and Heidke skill score. The threshold of 230 K at 37 GHz yields the best scores among passive microwave properties. Using these two thresholds, global distributions of possible hail events are generated over 65°S-65°N using two years of observations from the Global Precipitation Measurement Core Observatory satellite. Differences in the derived hail geographical distributions are found between radar and passive microwave methods over tropical South America, the \"Maritime Continent,\" west-central Africa, Argentina, and South Africa. These discrepancies result from different vertical structures of the maximum radar reflectivity profiles over these regions relative to the southeastern and south-central United States, where the thresholds were established. Those differences generally led to overestimates in the tropics from the passive microwave methods, relative to the radar-based methods.","authors":["Xiang Ni","Chuntao Liu","Daniel J. Cecil","Qinghong Zhang"],"meta":["August 2017Journal of Applied Meteorology and Climatology 56(10)","DOI:10.1175/JAMC-D-17-0065.1"],"references":["317127450_Hail-Detection_Algorithm_for_the_GPM_Core_Satellite_Sensors","308941052_Properties_of_hail_storms_over_China_and_the_United_States_from_the_Tropical_Rainfall_Measuring_Mission_Hailstorm_Properties_From_TRMM","301251503_Global_distribution_of_deep_convection_reaching_tropopause_in_1_year_GPM_observations","288834011_The_Characteristics_of_United_States_Hail_Reports_1955-2014","283515409_Characterization_of_Mediterranean_hail-bearing_storms_using_an_operational_polarimetric_X-band_radar","271659347_A_new_physically_based_stochastic_event_catalog_for_hail_in_Europe","309366281_Climatology_of_destructive_hailstorms_in_Brazil","305892011_Satellite_remote_sensing_of_hailstorms_in_France","280056058_The_Global_Precipitation_Measurement_GPM_mission","275115772_A_prototype_hail_detection_algorithm_and_hail_climatology_developed_with_the_advanced_microwave_sounding_unit_AMSU"]}