{"id":"3189823_Applying_Formal_Methods_to_a_Certifiably_Secure_Software_System","abstract":"A major problem in verifying the security of code is that the code's large size makes it much too costly to verify in its entirety. This paper describes a novel and practical approach to verifying the security of code which substantially reduces the cost of verification. In this approach, a compact security model containing only information needed to reason about the security properties of interest is constructed and the security properties are represented formally in terms of the model. To reduce the cost of verification, the code to be verified is partitioned into three categories and only the first category, which is less than 10 percent of the code in our application, requires formal verification. The proof of the other two categories is relatively trivial. Our approach was developed to support a common criteria evaluation of the separation kernel of an embedded software system. This paper describes 1) our techniques and theory for verifying the kernel code and 2) the artifacts produced, that is, a top-level specification (TLS), a formal statement of the security property, a mechanized proof that the TLS satisfies the property, the partitioning of the code, and a demonstration that the code conforms to the TLS. This paper also presents the formal basis for the argument that the kernel code conforms to the TLS and consequently satisfies the security property.","authors":["Constance L. Heitmeyer","Myla Marguerite Archer","Elizabeth I. Leonard","John D. Mclean"],"meta":["February 2008IEEE Transactions on Software Engineering 34(1):82-98","DOI:10.1109/TSE.2007.70772","SourceIEEE Xplore"],"references":["299115965_Using_model_checking_to_generate_tests_from_requirements_specifications","262143831_Tools_for_constructing_requirements_specifications_The_SCR_toolset_at_the_age_of_ten","255570102_The_Common_Criteria_Formal_Methods_and_ACL2","312998514_Enforceable_security_policies","282602369_Automated_Consistency_Checking_of_Requirements_Specifications","262370840_Mechanical_proofs_about_computer_programs","262346176_Sound_methods_and_effective_tools_for_model-based_security_engineering_with_UML","258941625_Mechanical_Proofs_about_Computer_Programs_Discussion","255682324_Case_study_Multinet_Gateway_System","239536143_The_spark_approach_to_safety_and_security"]}