{"id":"318981939_Wasserstein_Dictionary_Learning_Optimal_Transport-Based_Unsupervised_Nonlinear_Dictionary_Learning","abstract":"This article introduces a new non-linear dictionary learning method for histograms in the probability simplex. The method leverages optimal transport theory, in the sense that our aim is to reconstruct histograms using so called displacement interpolations (a.k.a. Wasserstein barycenters) between dictionary atoms; such atoms are themselves synthetic histograms in the probability simplex. Our method simultaneously estimates such atoms, and, for each datapoint, the vector of weights that can optimally reconstruct it as an optimal transport barycenter of such atoms. Our method is computationally tractable thanks to the addition of an entropic regularization to the usual optimal transportation problem, leading to an approximation scheme that is efficient, parallel and simple to differentiate. Both atoms and weights are learned using a gradient-based descent method. Gradients are obtained by automatic differentiation of the generalized Sinkhorn iterations that yield barycenters with entropic smoothing. Because of its formulation relying on Wasserstein barycenters instead of the usual matrix product between dictionary and codes, our method allows for non-linear relationships between atoms and the reconstruction of input data. We illustrate its application in several different image processing settings.","authors":["Morgan A. Schmitz","Matthieu Heitz","Nicolas Bonneel","Fred Maurice Ngole Mboula"],"meta":["August 2017SIAM Journal on Imaging Sciences 11(1)","DOI:10.1137/17M1140431","Project: Wasserstein Dictionary Learning"],"references":["319277389_Optimal_transport-based_dictionary_learning_and_its_application_to_Euclid-like_Point_Spread_Function_representation","312928481_Fast_Discrete_Distribution_Clustering_Using_Wasserstein_Barycenter_With_Sparse_Support","312521008_Inference_in_generative_models_using_the_Wasserstein_distance","317300051_Sinkhorn-AutoDiff_Tractable_Wasserstein_Learning_of_Generative_Models","317190146_Near-linear_time_approximation_algorithms_for_optimal_transport_via_Sinkhorn_iteration","316588757_A_Wavelet_Tour_of_Signal_Processing","311925909_Quantum_Optimal_Transport_for_Tensor_Field_Processing","311611053_Equiangular_Kernel_Dictionary_Learning_with_Applications_to_Dynamic_Texture_Analysis","309317370_Stabilized_Sparse_Scaling_Algorithms_for_Entropy_Regularized_Transport_Problems","305471139_Scaling_Algorithms_for_Unbalanced_Transport_Problems"]}