{"id":"318946292_Name_Disambiguation_in_Anonymized_Graphs_using_Network_Embedding","abstract":"In real-world, our DNA is unique but many people share names. is phenomenon ooen causes erroneous aggregation of documents of multiple persons who are namesake of one another. Such mistakes deteriorate the performance of document retrieval, web search, and more seriously, cause improper aaribution of credit or blame in digital forensic. To resolve this issue, the name disam-biguation task is designed which aims to partition the documents associated with a name reference such that each partition contains documents pertaining to a unique real-life person. Existing solutions to this task substantially rely on feature engineering, such as biographical feature extraction, or construction of auxiliary features from Wikipedia. However, for many scenarios, such features may be costly to obtain or unavailable due to the risk of privacy violation. In this work, we propose a novel name disambiguation method. Our proposed method is non-intrusive of privacy because instead of using aaributes pertaining to a real-life person, our method leverages only relational data in the form of anonymized graphs. In the methodological aspect, the proposed method uses a novel representation learning model to embed each document in a low dimensional vector space where name disambiguation can be solved by a hierarchical agglomerative clustering algorithm. Our experimental results demonstrate that the proposed method is signiicantly beeer than the existing name disambiguation methods working in a similar seeing.","authors":["Baichuan Zhang","Mohammad Hasan"],"meta":["November 2017","DOI:10.1145/3132847.3132873","Conference: The 26th ACM International Conference on Information and Knowledge Management (CIKM 2017)At: Singapore","Project: Towards Name Disambiguation: Relational, Streaming, and Privacy-Preserving Text Data"],"references":["318737345_CANE_Context-Aware_Network_Embedding_for_Relation_Modeling","308891761_Linked_Document_Embedding_for_Classification","299970490_Heterogeneous_Network_Embedding_via_Deep_Architectures","313263703_Task-Guided_and_Path-Augmented_Heterogeneous_Network_Embedding_for_Author_Identification","311514677_Task-Guided_and_Path-Augmented_Heterogeneous_Network_Embedding_for_Author_Identification","307955489_Distributed_representations_of_words_and_phrases_and_their_compositionality","305997704_node2vec_Scalable_Feature_Learning_for_Networks","305470987_Bayesian_Non-Exhaustive_Classification_A_Case_Study_Online_Name_Disambiguation_using_Temporal_Record_Streams","305081481_Robust_and_Collective_Entity_Disambiguation_through_Semantic_Embeddings","304372680_Multi-centrality_graph_spectral_decompositions_and_their_application_to_cyber_intrusion_detection"]}