{"id":"318978582_Eyetracking_Metrics_in_Young_Onset_Alzheimer's_Disease_A_Window_into_Cognitive_Visual_Functions","abstract":"Young onset Alzheimer’s disease (YOAD) is defined as symptom onset before the age of 65 years and is particularly associated with phenotypic heterogeneity. Atypical presentations, such as the clinic-radiological visual syndrome posterior cortical atrophy (PCA), often lead to delays in accurate diagnosis. Eyetracking has been used to demonstrate basic oculomotor impairments in individuals with dementia. In the present study, we aim to explore the relationship between eyetracking metrics and standard tests of visual cognition in individuals with YOAD. Fifty-seven participants were included: 36 individuals with YOAD (n = 26 typical AD; n = 10 PCA) and 21 age-matched healthy controls. Participants completed three eyetracking experiments: fixation, pro-saccade, and smooth pursuit tasks. Summary metrics were used as outcome measures and their predictive value explored looking at correlations with visuoperceptual and visuospatial metrics. Significant correlations between eyetracking metrics and standard visual cognitive estimates are reported. A machine-learning approach using a classification method based on the smooth pursuit raw eyetracking data discriminates with approximately 95% accuracy patients and controls in cross-validation tests. Results suggest that the eyetracking paradigms of a relatively simple and specific nature provide measures not only reflecting basic oculomotor characteristics but also predicting higher order visuospatial and visuoperceptual impairments. Eyetracking measures can represent extremely useful markers during the diagnostic phase and may be exploited as potential outcome measures for clinical trials.","authors":["Ivanna Pavisic","Nicholas C. Firth","Samuel Parsons","David Martinez Rego"],"meta":["August 2017Frontiers in Neurology 8:377","DOI:10.3389/fneur.2017.00377"],"references":["314156190_Consensus_classification_of_posterior_cortical_atrophy","312318530_Application_of_Machine_Learning_in_Postural_Control_Kinematics_for_the_Diagnosis_of_Alzheimer's_Disease","310478720_Efficacy_and_safety_of_tau-aggregation_inhibitor_therapy_in_patients_with_mild_or_moderate_Alzheimer's_disease_a_randomised_controlled_double-blind_parallel-arm_phase_3_trial","306435005_Eye-tracking-based_assessment_of_cognitive_function_in_low-resource_settings","316991409_Mini-Mental_State_A_practical_method_for_grading_the_cognitive_state_of_patients_for_the_clinician","316736695_Alzheimer's_centennial_legacy_Origins_landmarks_and_the_current_status_of_knowledge_concerning_cognitive_aspects","312609767_Mini-mental_state-practical_method_for_grading_cognitive_state_of_patients_for_clinicians","311164395_The_oral_spelling_profile_of_Posterior_Cortical_Atrophy_and_the_nature_of_the_graphemic_representation","306201411_Alzheimer's_Disease_Facts_and_Figures","288262176_The_diagnosis_of_dementia_due_to_Alzheimer's_disease_Recommendations_from_the_National_Institute_on_Aging_and_the_Alzheimer's_Association_workgroup"]}