{"id":"318952989_The_Better_You_Feel_the_Better_You_Learn_Do_Warm_Colours_and_Rounded_Shapes_Enhance_Learning_Outcome_in_Multimedia_Learning","abstract":"The aim of the present study was to examine whether fostering positive activating affect during multimedia learning enhances learning outcome. University students were randomly assigned to either a multimedia learning environment designed to induce positive activating affect through the use of “warm” colours and rounded shapes ( n=61 ) or an affectively neutral environment that used achromatic colours and sharp edges ( n=50 ). Participants learned about the topic of functional neuroanatomy for 20 minutes and had to answer several questions for comprehension and transfer afterwards. Affective states as well as achievement goal orientations were investigated before and after the learning phase using questionnaires. The results show that participants in the affectively positive environment were superior in comprehension as well as transfer when initial affect was strong. Preexperimental positive affect was therefore a predictor of comprehension and a moderator for transfer. Goal orientations did not influence these effects. The findings support the idea that positive affect, induced through the design of the particular multimedia learning environment, can facilitate performance if initial affective states are taken into account.","authors":["Hannes Muenchow","Christoph Mengelkamp","Maria Bannert"],"meta":["August 2017Education Research International 2017(2):1-15","DOI:10.1155/2017/2148139"],"references":["309313629_Emotional_Design_in_Digital_Media_for_Learning","304716322_Instructional_technology_Promise_and_pitfalls","303266011_Concepts_and_structures_of_emotions","301739865_Facilitators_or_suppressors_Effects_of_experimentally_induced_emotions_on_multimedia_learning","297180486_EMOTIONAL_MOOD_STATES_AND_MEMORY_-_ELABORATIVE_ENCODING_SEMANTIC_PROCESSING_AND_COGNITIVE_EFFORT","289066201_Introduction_to_Mediation_Moderation_and_Conditional_Process_Analysis_A_Regression-Based_Approach","281527284_Emotions_and_Motivation_in_Learning_and_Performance","273792377_Emotional_Design_and_Positive_Emotions_in_Multimedia_Learning_An_Eyetracking_Study_on_the_Use_of_Anthropomorphisms","273097098_Practical_Statistics_For_Medical_Research","272079251_The_Role_of_Positive_Emotions_in_Positive_Psychology"]}