{"id":"318996731_Steady-State_Analysis_of_Delay_Interconnected_Positive_Systems_and_Its_Application_to_Formation_Control","abstract":"This study is concerned with the analysis and synthesis of delay interconnected positive systems. For delay-free cases, it has been shown very recently that the output of the interconnected positive system converges to a positive scalar multiple of a prescribed positive vector under mild conditions on positive subsystems and a non-negative interconnection matrix. This result is effectively used for formation control of multi-agent systems with positive dynamics. The goal of this study is to prove that this steady-state property is essentially preserved under any constant (and hence bounded) communication delay. In the context of formation control, this preservation indicates that the desired formation is achieved robustly against communication delays, even though the resulting formation is scaled depending on initial conditions for the state. To ensure the achievement of the steady-state property, the authors need to prove rigorously that the delay interconnected positive system has stable poles only except for a pole of degree one at the origin, even though it has infinitely many poles, in general. For the rigorous proof, we newly develop frequency-domain (s-domain) analysis for delay interconnected positive systems, which has not been studied for delay-free cases.","authors":["Yoshio Ebihara","Dimitri Peaucelle","Denis Arzelier"],"meta":["August 2017IET Control Theory and Applications 11(16)","DOI:10.1049/iet-cta.2017.0315"],"references":["312262391_New_results_on_the_solution_of_the_positive_consensus_problem","284726107_Stability_and_Performance_Analysis_for_Positive_Fractional-Order_Systems_With_Time-Varying_Delays","322670278_Dominant_pole_analysis_of_neutral-type_time_delay_positive_systems","320501178_Stability_Analysis_of_Neutral_Type_Time-Delay_Positive_Systems_with_Commensurate_Delays","315853052_Positive_Consensus_Problem_The_Case_of_Complete_Communication","315853008_Stability_Analysis_of_Neutral_Type_Time-Delay_Positive_Systems","313744983_Analysis_and_Synthesis_of_Interconnected_Positive_Systems","305906445_On_the_consensus_problem_with_positivity_constraints","302581064_On_the_Kalman-Yakubovich-Popov_Lemma_for_Positive_Systems","301436355_Efficient_Convergence_Rate_Analysis_of_Multi-Agent_Positive_Systems_Under_Formation_Control"]}