{"id":"318923217_SCADA_network_forensics_of_the_PCCC_protocol","abstract":"Most SCADA devices have few built-in self-defence mechanisms, and tend to implicitly trust communications received over the network. Therefore, monitoring and forensic analysis of network traffic is a critical prerequisite for building an effective defense around SCADA units. In this work, we provide a comprehensive forensic analysis of network traffic generated by the PCCC(Programmable Controller Communication Commands) protocol and present a prototype tool capable of extracting both updates to programmable logic and crucial configuration information. The results of our analysis show that more than 30 files are transferred to/from the PLC when downloading/uploading a ladder logic program using RSLogix programming software including configuration and data files. Interestingly, when RSLogix compiles a ladder-logic program, it does not create any low-level representation of a ladder-logic file. However, the low-level ladder logic is present and can be extracted from the network traffic log using our prototype tool. The tool extracts SMTP configuration from the network log and parses it to obtain email addresses, username and password. The network log contains password in plain text.","authors":["Saranyan Senthivel","Irfan Ahmed","Vassil Roussev"],"meta":["August 2017Digital Investigation 22:S57-S65","DOI:10.1016/j.diin.2017.06.012","Projects: SCADA Security - Analysis on Network Traffic for enhancing the securityIndustrial Control System Security and Forensics"],"references":["313884668_Accurate_Modeling_of_the_Siemens_S7_SCADA_Protocol_for_Intrusion_Detection_and_Digital_Forensics","298728032_The_Cybersecurity_Landscape_in_Industrial_Control_Systems","251339227_A_Taxonomy_of_Attacks_on_the_DNP3_Protocol","234138890_SCADA_Systems_Challenges_for_Forensic_Investigators","349520038_Special_Publication_800-82_SECOND_PUBLIC_DRAFT_Guide_to_Industrial_Control_Systems_ICS_Security_Supervisory_Control_and_Data_Acquisition_SCADA_systems_Distributed_Control_Systems_DCS_and_other_control","336585870_The_SCADA_Threat_Landscape","327527699_Cybersecurity_for_industrial_control_systems_SCADA_DCS_PLC_HMI_and_SIS","280196535_Polar_Bears_A_Complete_Guide_to_their_Biology_and_Behavior201362Text_by_Andrew_E_Derocher_photographs_by_Wayne_Lynch_Polar_Bears_A_Complete_Guide_to_their_Biology_and_Behavior_Baltimore_MD_The_Johns_H","257687897_A_general_strategy_for_differential_forensic_analysis","245478702_Attack_taxonomies_for_the_Modbus_protocols"]}