{"id":"319003279_Unsupervised_Video_Summarization_with_Adversarial_LSTM_Networks","abstract":"This paper addresses the problem of unsupervised video summarization, formulated as selecting a sparse subset of video frames that optimally represent the input video. Our key idea is to learn a deep summarizer network to minimize distance between training videos and a distribution of their summarizations, in an unsupervised way. Such a summarizer can then be applied on a new video for estimating its optimal summarization. For learning, we specify a novel generative adversarial framework, consisting of the summarizer and discriminator. The summarizer is the au-toencoder long short-term memory network (LSTM) aimed at, first, selecting video frames, and then decoding the obtained summarization for reconstructing the input video. The discriminator is another LSTM aimed at distinguishing between the original video and its reconstruction from the summarizer. The summarizer LSTM is cast as an adversary of the discriminator, i.e., trained so as to maximally confuse the discriminator. This learning is also regularized for sparsity. Evaluation on four benchmark datasets, consisting of videos showing diverse events in first-and third-person views, demonstrates our competitive performance in comparison to fully supervised state-of-the-art approaches.","authors":["Behrooz Mahasseni","Michael Lam","Sinisa Todorovic"],"meta":["July 2017","DOI:10.1109/CVPR.2017.318","Conference: Conference on Computer Vision and Pattern Recognition (CVPR)At: Honolulu, HI"],"references":["308820302_EgoSampling_Fast-forward_and_stereo_for_egocentric_videos","308744455_Contextual_RNN-GANs_for_Abstract_Reasoning_Diagram_Generation","319770355_Generative_Adversarial_Nets","319770234_Deep_multi-scale_video_prediction_beyond_mean_square_error","319770224_Energy-based_Generative_Adversarial_Network","319770144_Unsupervised_Representation_Learning_with_Deep_Convolutional_Generative_Adversarial_Networks","311450796_Quasi_real-time_summarization_for_consumer_videos","308861592_TVSum_Summarizing_web_videos_using_titles","308854408_Video_summarization_by_learning_submodular_mixtures_of_objectives","308189212_Video_Summarization_with_Long_Short-Term_Memory"]}