{"id":"319067033_Going_deeper_in_the_automated_identification_of_Herbarium_specimens","abstract":"Background\nHundreds of herbarium collections have accumulated a valuable heritage and knowledge of plants over several centuries. Recent initiatives started ambitious preservation plans to digitize this information and make it available to botanists and the general public through web portals. However, thousands of sheets are still unidentified at the species level while numerous sheets should be reviewed and updated following more recent taxonomic knowledge. These annotations and revisions require an unrealistic amount of work for botanists to carry out in a reasonable time. Computer vision and machine learning approaches applied to herbarium sheets are promising but are still not well studied compared to automated species identification from leaf scans or pictures of plants in the field.\n\nResults\nIn this work, we propose to study and evaluate the accuracy with which herbarium images can be potentially exploited for species identification with deep learning technology. In addition, we propose to study if the combination of herbarium sheets with photos of plants in the field is relevant in terms of accuracy, and finally, we explore if herbarium images from one region that has one specific flora can be used to do transfer learning to another region with other species; for example, on a region under-represented in terms of collected data.\n\nConclusions\nThis is, to our knowledge, the first study that uses deep learning to analyze a big dataset with thousands of species from herbaria. Results show the potential of Deep Learning on herbarium species identification, particularly by training and testing across different datasets from different herbaria. This could potentially lead to the creation of a semi, or even fully automated system to help taxonomists and experts with their annotation, classification, and revision works.","authors":["Jose Carranza-Rojas","Hervé Goëau","Pierre Bonnet","Erick Mata-Montero"],"meta":["December 2017BMC Evolutionary Biology 17(1)","DOI:10.1186/s12862-017-1014-z"],"references":["317300762_Impact_of_e-publication_changes_in_the_International_Code_of_Nomenclature_for_algae_fungi_and_plants_Melbourne_Code_2012_-_Did_we_need_to_run_for_our_lives","316766868_AnnoSys-implementation_of_a_generic_annotation_system_for_schema-based_data_using_the_example_of_biodiversity_collection_data","315383275_AnnoSys_-_Implementation_of_a_generic_annotation_system_for_schema-based_data_using_the_example_of_biodiversity_collection_data","312147459_Plant_Species_Identification_Using_Computer_Vision_Techniques_A_Systematic_Literature_Review","310475347_Computer_vision_applied_to_herbarium_specimens_of_German_trees_Testing_the_future_utility_of_the_millions_of_herbarium_specimen_images_for_automated_identification","309032391_Plant_identification_in_an_open-world_LifeCLEF_2016","308855148_Crowdsourcing_Biodiversity_Monitoring_How_Sharing_your_Photo_Stream_can_Sustain_our_Planet","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","308809003_Deep-plant_Plant_identification_with_convolutional_neural_networks","308729303_A_texture_and_curvature_bimodal_leaf_recognition_model_for_identification_of_Costa_Rican_plant_species"]}