{"id":"319057004_Location_Name_Extraction_from_Targeted_Text_Streams_using_Gazetteer-based_Statistical_Language_Models","abstract":"Extracting location names from informal and unstructured social media data requires the identification of referent boundaries and partitioning compound names. Variability, particularly systematic variability in location names (Carroll, 1983), challenges the identification task. Some of this variability can be anticipated as operations within a statistical language model, in this case drawn from gazetteers such as OpenStreetMap (OSM), Geonames, and DBpedia. This permits evaluation of an observed n-gram in Twitter targeted text as a legitimate location name variant from the same location-context. Using n-gram statistics and location-related dictionaries, our Location Name Extraction tool (LNEx) handles abbreviations and automatically filters and augments the location names in gazetteers (handling name contractions and auxiliary contents) to help detect the boundaries of multi-word location names and thereby delimit them in texts.\n\nWe evaluated our approach on 4,500 event-specific tweets from three targeted streams to compare the performance of LNEx against that of ten state-of-the-art taggers that rely on standard semantic, syntactic and/or orthographic features. LNEx improved the average F-Score by 33-179%, outperforming all taggers. Further, LNEx is capable of stream processing.","authors":["Hussein Al-Olimat","Krishnaprasad Thirunarayan","Valerie L. Shalin","Amit Sheth"],"meta":["August 2018","Conference: The 27th International Conference on Computational Linguistics (COLING 2018)At: Santa Fe, NM","Project: Hazards SEES: Social and Physical Sensing Enabled Decision Support for Disaster Management and Response"],"references":["327932895_A_Practical_Incremental_Learning_Framework_For_Sparse_Entity_Extraction","321105913_Location_extraction_from_tweets","312636869_Joint_Recognition_and_Linking_of_Fine-Grained_Locations_from_Tweets","301427185_Annotating_Geographical_Entities_on_Microblog_Text","279201390_Location_Mention_Detection_in_Tweets_and_Microblogs","349566243_GATE_an_architecture_for_development_of_robust_HLT_applications","301427721_Pinpointing_Locational_Focus_in_Microblogs","288159364_TwitIE_An_open-source_information_extraction_pipeline_for_microblog_text","285956478_Extracting_Spatial_Information_From_Place_Descriptions","285397989_Automatic_Identification_of_Locative_Expressions_from_Social_Media_Text","278331746_Knowledge-driven_geospatial_location_resolution_for_phylogeographic_models_of_virus_migration","277007689_Natural_Language_Corpus_Data","270878859_On_Named_Entity_Recognition_in_Targeted_Twitter_Streams_in_Polish","269306186_Effective_location_identification_from_microblogs","267454088_Analysis_of_Named_Entity_Recognition_and_Linking_for_Tweets"]}