{"id":"319035703_Probabilistic_Neural_Network_with_Complex_Exponential_Activation_Functions_in_Image_Recognition_using_Deep_Learning_Framework","abstract":"If the training dataset is not very large, image recognition is usually implemented with the transfer learning methods. In these methods the features are extracted using a deep convolutional neural network, which was preliminarily trained with an external very-large dataset. In this paper we consider the nonparametric classification of extracted feature vectors with the probabilistic neural network (PNN). The number of neurons at the pattern layer of the PNN is equal to the database size, which causes the low recognition performance and high memory space complexity of this network. We propose to overcome these drawbacks by replacing the exponential activation function in the Gaussian Parzen kernel to the complex exponential functions in the Fej\\'er kernel. We demonstrate that in this case it is possible to implement the network with the number of neurons in the pattern layer proportional to the cubic root of the database size. Thus, the proposed modification of the PNN makes it possible to significantly decrease runtime and memory complexities without loosing its main advantages, namely, extremely fast training procedure and the convergence to the optimal Bayesian decision. An experimental study in visual object category classification and unconstrained face recognition with contemporary deep neural networks have shown, that our approach obtains very efficient and rather accurate decisions for the small training sample in comparison with the well-known classifiers.","authors":["Andrey V Savchenko"],"meta":["August 2017IEEE Transactions on Neural Networks and Learning Systems PP(99)","DOI:10.1109/TNNLS.2019.2908973"],"references":["305196650_Going_deeper_with_convolutions","329314647_Efficient_Statistical_Face_Recognition_Using_Trigonometric_Series_and_CNN_Features","319770820_Histograms_of_Oriented_Gradients_for_Human_Detection","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","316361422_Search_Techniques_in_Intelligent_Classification_Systems","316240097_Distinctive_Image_Features_from_Scale-Invariant_Keypoints","312538118_Support-vector_networks","308161218_Introduction_to_information_retrieval_chapt","307556329_Maximum-likelihood_approximate_nearest_neighbor_method_in_real-time_image_recognition","304702392_Pattern_Classification_with_the_Probabilistic_Neural_Networks_Based_on_Orthogonal_Series_Kernel"]}