{"id":"319069047_Topologically_Aware_Building_Rooftop_Reconstruction_From_Airborne_Laser_Scanning_Point_Clouds","abstract":"This paper presents a novel topologically-aware 2.5D\nbuilding modeling methodology from airborne laser scanning\n(ALS) point clouds. The building reconstruction process consists\nof three main steps: primitive clustering, boundary representation\nand geometric modeling. In primitive clustering, we propose\nan enhanced probability density clustering (PDC) algorithm\nto cluster the rooftop primitives by taking into account the\ntopological consistency among primitives. In the second step, we\nemploy a novel Voronoi subgraph based algorithm to seamlessly\ntrace the primitive boundaries. This algorithm guarantees the\nproduction of geometric models without crack defects among\nadjacent primitives. The primitive boundaries are further divided\ninto multiple linear segments, from which the key points are\ngenerated. These key points help to form a hybrid representation\nof the boundary by combining the projected points with part of\nthe original boundary points. The model representation by the\nhybrid key points is flexible and well captures the rooftop details\nto generate lightweight and highly regular building models.\nFinally, we assemble the primitive boundaries to form the\ntopologically correct entities which are regarded as the basic\nunits for primitive triangulation. The reconstructed models not\nonly have accurate geometry and correct topology but more\nimportantly have abundant semantics, by which five levels of\nbuilding models can be generated in real time. The proposed\nreconstruction method has been comprehensively evaluated on\nToronto data set in terms of model compactness, multilevel model\nrepresentation and geometric accuracy.","authors":["Chen Dong","Ruisheng Wang","Jiju Peethambaran"],"meta":["August 2017IEEE Transactions on Geoscience and Remote Sensing PP(99)","DOI:10.1109/TGRS.2017.2738439","Project: Detailed Modeling of Urban Scenes"],"references":["313618366_A_survey_of_urban_reconstruction","313447956_Valid_Space_Description_in_BIM_for_3D_Indoor_Navigation","308278130_Manhattan-World_Urban_Reconstruction_from_Point_Clouds","303868834_Animation_Strategies_for_Smooth_Transformations_Between_Discrete_LODs_of_3D_Building_Models","299541828_A_Survey_of_Surface_Reconstruction_from_Point_Clouds","291418148_A_Multilevel_Point-Cluster-Based_Discriminative_Feature_for_ALS_Point_Cloud_Classification","285656598_Urban_Building_Energy_Modeling_-_A_Review_of_a_Nascent_Field","317556828_A_Fast_Edge_Extraction_Method_for_Mobile_Lidar_Point_Clouds","311414868_A_hierarchical_methodology_for_urban_facade_parsing_from_TLS_point_clouds","308861136_Big_Data_for_Healthy_Cities_Using_Location-Aware_Technologies_Open_Data_and_3D_Urban_Models_to_Design_Healthier_Built_Environments"]}