{"id":"319035285_Method_to_evaluate_the_noise_of_3D_intra-oral_scanner","abstract":"In dentistry, 3D intra-oral scanners are gaining increasing popularity essentially for the production of dental prostheses.\nHowever, there is no normalized procedure to evaluate their basic performance and enable comparisons among intra-oral scanners. The noise value highlights the trueness of a 3D intra-oral scanner and its capacity to plan prosthesis with efficient clinical precision. The aim of the present study is to develop a reproducible methodology for determining the noise of an intra-oral scanner. To this aim, and as a reference, an ultra-flat and ultra-smooth alumina wafer is used as a blank test. The roughness is calculated using an AFM (atomic force microscope) and interferometric microscope measurements to validate this ultra-flat characteristic. Then, two intra-oral scanners (Carestream CS3500 and Trios 3Shape) are used. The wafer is imaged by the two intra-oral scanners with three different angles and two different directions, 10 times for each parameter, given a total of 50 3D-meshes per intra-oral scanner. RMS (root mean square), representing the noise, is evaluated and compared for each angle/direction and each intra-oral scanner, for the whole mesh, and then in a central ROI (region of interest). In this study, we obtained RMS values ranging between 5.29 and 12.58 micrometers. No statistically significant differences were found between the mean RMS of the two intra-oral scanners, but significant differences in angulation and orientations were found between different 3D intra-oral scanners. This study shows that the evaluation of RMS can be an indicator of the value of the noise, which can be easily assessed by applying the present methodology.","authors":["Alban Desoutter","Osama Yusuf Solieman","Gérard Subsol","Herve Tassery"],"meta":["August 2017PLoS ONE 12(8):e0182206","DOI:10.1371/journal.pone.0182206","Project: Evaluating intra-oral cameras"],"references":["305274768_Accuracy_of_five_intraoral_scanners_compared_to_indirect_digitalization","291520756_Accuracy_of_Digital_Impressions_and_Fitness_of_Single_Crowns_Based_on_Digital_Impressions","283717334_Effects_of_Computer-Aided_Manufacturing_Technology_on_Precision_of_Clinical_Metal-Free_Restorations","281907314_3D_Scanning_Imaging_and_Printing_in_Orthodontics","272519201_Quantitative_evaluation_of_common_errors_in_digital_impression_obtained_by_using_an_LED_blue_light_in-office_CADCAM_system","305663929_Influence_of_object_translucency_on_the_scanning_accuracy_of_a_powder-free_intraoral_scanner_A_laboratory_study","303158783_A_simple_method_of_increasing_the_adhesion_of_acrylic_filling_materials_to_enamel","301249801_Accuracy_and_precision_of_occlusal_contacts_of_stereolithographic_casts_mounted_by_digital_interocclusal_registrations","290440794_Understanding_dental_CADCAM_for_restorations_-_accuracy_from_a_mechanical_engineering_viewpoint","279367983_Vector_Quantization_and_Signal_Compression"]}