{"id":"319035484_Gradient-enhanced_kriging_for_high-dimensional_problems","abstract":"Surrogate models provide a low computational cost alternative to evaluating expensive functions. The construction of accurate surrogate models with large numbers of independent variables is currently prohibitive because it requires a large number of function evaluations. Gradient-enhanced kriging has the potential to reduce the number of function evaluations for the desired accuracy when efficient gradient computation, such as an adjoint method, is available. However, current gradient-enhanced kriging methods do not scale well with the number of sampling points due to the rapid growth in the size of the correlation matrix where new information is added for each sampling point in each direction of the design space. They do not scale well with the number of independent variables either due to the increase in the number of hyperparameters that needs to be estimated. To address this issue, we develop a new gradient-enhanced surrogate model approach that drastically reduced the number of hyperparameters through the use of the partial-least squares method that maintains accuracy. In addition, this method is able to control the size of the correlation matrix by adding only relevant points defined through the information provided by the partial-least squares method. To validate our method, we compare the global accuracy of the proposed method with conventional kriging surrogate models on two analytic functions with up to 100 dimensions, as well as engineering problems of varied complexity with up to 15 dimensions. We show that the proposed method requires fewer sampling points than conventional methods to obtain the desired accuracy, or provides more accuracy for a fixed budget of sampling points. In some cases, we get over 3 times more accurate models than a bench of surrogate models from the literature, and also over 3200 times faster than standard gradient-enhanced kriging models.","authors":["Mohamed Amine Bouhlel","Joaquim R. R. A. Martins"],"meta":["January 2019Engineering with Computers 35(1)","DOI:10.1007/s00366-018-0590-x"],"references":["322869310_Efficient_Global_Optimization_for_high-dimensional_constrained_problems_by_using_the_Kriging_models_combined_with_the_Partial_Least_Squares_method","311623102_Gradient_based_hyper-parameter_optimisation_for_well_conditioned_kriging_metamodels","305386496_Scikit-Iearn_Machine_learning_in_python","304571570_An_Improved_Approach_for_Estimating_the_Hyperparameters_of_the_Kriging_Model_for_High-Dimensional_Problems_through_the_Partial_Least_Squares_Method","303902935_Improvement_of_efficient_global_optimization_with_application_to_aircraft_wing_design","321509185_Design_and_Analysis_of_Simulation_Experiments","319770397_Bayesian_Reasoning_and_Machine_Learning","315280751_Efficient_Optimization_Design_Method_Using_Kriging_Model","314821153_Efficient_Optimization_Design_Method_Using_Kriging_Model","312604509_A_statistical_view_of_some_chemometrics_regression_tools_with_discussion"]}