{"id":"319088194_Oxford_Handbook_of_Technology_and_Music_Education","abstract":"Few aspects of daily existence are untouched by technology. Learning and teaching music are no exceptions and arguably have been impacted as much or more than other areas of life. Digital technologies have come to affect music learning and teaching in profound ways, influencing how we create, listen, share, consume, interact, and conceptualize musical practices and the musical experience. For a discipline as entrenched in tradition as music education, this has brought forth myriad views on what does and should constitute music learning and teaching.\n\nTo tease out and elucidate some of the salient problems, interests, and issues, The Oxford Handbook of Technology and Music Education critically situates technology in relation to music education from a variety of perspectives: historical; philosophical; socio-cultural; pedagogical; musical; economic; policy, organized around four broad themes: Emergence and Evolution; Locations and Contexts: Social and Cultural Issues; Experiencing, Expressing, Learning and Teaching; and Competence, Credentialing, and Professional Development. Chapters from a highly diverse group of junior and senior scholars provide analyses of technology and music education through intersections of gender, theoretical perspective, geographical distribution, and relationship to the field. The Oxford Handbook of Technology and Music Education's dedication to diversity and forward-facing discussion promotes contrasting perspectives and conversational voices rather than reinforce traditional narratives and prevailing discourses.","authors":["Roger Mantie","S. Alex Ruthmann"],"meta":["July 2017","DOI:10.1093/oxfordhb/9780199372133.001.0001","Publisher: Oxford University PressEditor: Roger Mantie, S. Alex RuthmannISBN: 9780199372133"],"references":["324840420_Music_and_Music_Education_in_People's_Lives_An_Oxford_handbook_of_music_education_Volume_1","314140809_The_Routledge_Companion_to_Music_Technology_and_Education"]}