{"id":"319051987_Multi-level_and_hybrid_modelling_approaches_for_systems_biology","abstract":"During the last decades, high-throughput techniques allowed for the extraction of a huge amount of data from biological systems, unveiling more of their underling complexity. Biological systems encompass a wide range of space and time scales, functioning according to flexible hierarchies of mechanisms making an intertwined and dynamic interplay of regulations. This becomes particularly evident in processes such as ontogenesis, where regulative assets change according to process context and timing, making structural phenotype and architectural complexities emerge from a single cell, through local interactions. The information collected from biological systems are naturally organized according to the functional levels composing the system itself. In systems biology, biological information often comes from overlapping but different scientific domains, each one having its own way of representing phenomena under study. That is, the different parts of the system to be modelled may be described with different formalisms. For a model to have improved accuracy and capability for making a good knowledge base, it is good to comprise different system levels, suitably handling the relative formalisms. Models which are both multi-level and hybrid satisfy both these requirements, making a very useful tool in computational systems biology. This paper reviews some of the main contributions in this field.","authors":["Roberta Bardini","Gianfranco Michele Maria Politano","Alfredo Benso","Stefano Di Carlo"],"meta":["August 2017Computational and Structural Biotechnology Journal 15(C)","DOI:10.1016/j.csbj.2017.07.005"],"references":["313470662_Multilevel_pharmacokinetics-driven_modeling_of_metabolomics_data","303905936_Toward_Community_Standards_and_Software_for_Whole-Cell_Modeling","303536659_Cross-validation_to_select_Bayesian_hierarchical_models_in_phylogenetics","294726687_More_effort_-_more_results_Recent_advances_in_integrative_'omics'_data_analysis","285630256_Hybrid_Modelling_in_Biology_A_Classification_Review","283546185_Multi-level_functional_genomics_data_integration_as_a_tool_for_understanding_physiology_A_network_perspective","317649484_The_Ontogeny_of_Information_Developmental_Systems_and_Evolution","312629240_Identifiability_of_model_parameters","309572529_Toward_community_standards_and_software_for_whole-cell_modeling","284046833_Bayesian_measures_of_model_complexity_and_fit_with_discussion"]}