{"id":"319021810_Publication_Bias_in_Special_Education_Meta-Analyses","abstract":"Publication bias involves the disproportionate representation of studies with large and significant effects in the published research. Among other problems, publication bias results in inflated omnibus effect sizes in meta-analyses, giving the impression that interventions have stronger effects than they actually do. Although evidence suggests that publication bias exists in other fields, research has not examined the issue in special education. In this study, we examined the inclusion of gray literature, testing for publication bias, the extent to which publication bias exists, the relation of including gray literature to the presence of publication bias, and differences in effect size magnitude for gray literature and published studies among 109 meta-analyses published in special education journals. We found the following: (a) 42% of meta-analyses included gray literature, (b) 33% examined publication bias, (c) meta-analyses not including gray literature were more likely to reflect publication bias, and (d) published studies had larger effect sizes than gray literature. We discuss implications and recommendations for research and practice.","authors":["Nicholas Gage","Bryan G. Cook","Brian Reichow"],"meta":["July 2017Exceptional Children 83(4):428-445","DOI:10.1177/0014402917691016","Project: Open science in special education and related fields"],"references":["275002659_A_Call_for_Examining_Replication_and_Bias_in_Special_Education_Research","303086224_A_survey_of_publication_practices_of_single-case_design_researchers_when_treatments_have_small_or_large_effects","290454109_Meta-Analytic_Procedures_for_Social_Science_Research","287475714_Face_Validity_of_Meta-Analyses_in_Emotional_or_Behavioral_Disorders","285151908_Grey_literature","283821166_Scientific_communication_and_literature_retrieval","282807044_Increasing_the_Credibility_of_Political_Science_Research_A_Proposal_for_Journal_Reforms","279404710_The_Funnel_Plot","277695855_Publication_Bias_in_Meta-Analysis","277630437_Estimating_the_Difference_Between_Published_and_Unpublished_Effect_Sizes_A_Meta-Review"]}