{"id":"319022695_Functional_and_Semantic_Roles_in_a_High-Level_Knowledge_Representation_Language","abstract":"We describe in this paper a formalization of the notion of “role” that involves a clear separation between two very different sorts of roles. Semantic roles, like student or customer, are seen as (pre-defined) transitory properties that can be associated with (usually animate) entities. From a formal point of view, they can be represented as standard concepts to be placed into a specific branch of a particular ontology; they formalize the static and classificatory aspects of the notion of role. Functional roles must be used, instead, to model those pervasive and dynamic situations corresponding to events, activities, circumstances etc. that are characterized by spatio-temporal references; see, e.g., “John is now acting as a student”. They denote the specific function with respect to the global meaning of an event/situation/activity... that is performed by the entities involved in this event/situation... and formalize the dynamic and relational aspects of the notion of role. A functional role of the subject/agent/actor/protagonist... type is used to associate “John” with the notion of student or customer (semantic roles) during a specific time interval. Formally, functional roles are expressed as primitive symbols like subject, object, source, beneficiary. Semantic and functional roles interact smoothly when they are used to deal with challenging knowledge representation problems like the so-called “counting problem”, or when we need to set-up powerful inference rules whose atoms can directly denote complex situations. In this paper, the differentiation between semantic and functional roles will be illustrated from an narrative knowledge representation language (NKRL) point of view. NKRL is a high-level conceptual tool used for the computer-usable representation and management of the inner meaning of syntactically complex and semantically rich multimedia information. But, as we will see, the importance of this distinction goes well beyond its usefulness in a specific NKRL context. In particular, the use of functional roles is of paramount importance for the set-up of those evolved n-ary forms of knowledge representation that allow us to get rid from the limitations in expressiveness proper to the standard (binary) solutions.","authors":["Gian Piero Zarri"],"meta":["April 2019Artificial Intelligence Review 51(6)","DOI:10.1007/s10462-017-9571-5"],"references":["289693838_Families_of_roles_A_new_theory_of_occurrent-dependent_roles","345392891_In-Depth_Understanding_A_Computer_Model_of_Integrated_Processing_for_Narrative_Comprehension","319395514_OWL_2_Web_Ontology_Language_Primer_Second_Edition","319394162_Programming_in_Prolog","319393968_The_Logical_Form_of_Action_Sentences","319393586_Defining_N-ary_Relations_on_the_Semantic_Web","312447704_Linked_data_-_design","301073191_Second-Order_Logic","289081083_WHAT'S_IN_A_LINK","285731130_Representing_general_relational_knowledge_in_ConceptNet_5","277650908_A_structured_and_in-depth_representation_of_the_semantic_content_of_elementary_and_complex_events","283525658_Preface_Computational_models_of_narrative","275933714_Scripts_Plans_Goals_and_Understanding_An_Inquiry_into_Human_Knowledge_Structures","270300115_The_Logic_of_Common_Nouns_An_Investigation_in_Quantified_Modal_Logic","267001342_Automatic_translation_of_languages"]}