{"id":"319087615_Development_of_android_application_for_computation_of_air_pollutant_index_and_water_quality_index","abstract":"Past few decades, human have experienced a revolution in the computer sciences, not only in terms of its ability but also in terms of its use. Advancement of smartphone technology had produced rapid yet incredible invention in many sectors such as construc education, health and many more. This paper will discuss about the development of the application that is used to calculate the API and WQI indices. application was named as My.Index Calculator. The application can 3.0 (Honeycomb) until the latest version of it (Lollipop). alternatives to the index calculation and data management. Now can calculate the index value at anytime and any addition, it is way easier and faster to calculate the index. Past few decades, human have experienced a revolution in the computer sciences, not only in terms of its ability but also in terms of its use. Advancement of smartphone technology had produced rapid yet incredible invention in many sectors such as construc education, health and many more. This paper will discuss about the development of the application that is used to calculate the API and WQI indices. WQI and API calculator application was named as My.Index Calculator. The application can run on Android version 3.0 (Honeycomb) until the latest version of it (Lollipop). The application provides better alternatives to the index calculation and data management. Now, the researchers and students can calculate the index value at anytime and anywhere with the help of the application. In addition, it is way easier and faster to calculate the index. ater quality index; air pollutant index; programming; android","authors":["Ismail Zainal Abidin","Fadzil Syed Abdullah","Azman Azid","Mohd khairul amri Kamarudin"],"meta":["August 2017Journal of Fundamental and Applied Sciences 9(2S):352-367","DOI:10.4314/jfas.v9i2s.24"],"references":["306177486_FarmManager_an_Android_application_for_the_management_of_small_farms","304253236_Artificial_neural_network_modeling_of_the_water_quality_index_for_Kinta_River_Malaysia_using_water_quality_variables_as_predictors","287730157_Analysis_of_the_British_Columbia_Water_Quality_Index_for_Watershed_Managers_a_Case_Study_of_Two_Small_Watersheds","285603739_Application_of_Excel-VBA_for_computation_of_water_quality_index_and_air_pollutant_index","270594792_Relationships_between_pollutant_discharge_and_water_quality_in_the_rivers_from_better_to_worse_water_quality","256938192_GeoTools_An_android_phone_application_in_geology","229987149_Developing_a_Standardized_Water_Quality_Index_for_Evaluating_Surface_Water_Quality1"]}