{"id":"319072715_An_Information_Theory_Calculator_for_Understanding_Information_and_Library_Science_Applications","abstract":"The study of information as proposed in information theory provides a useful tool for studying many aspects of information systems, libraries, and archives. How does a calculator that computes information-theoretic functions contribute to students learning database ideas such as the relationships between various attributes, or columns in a relational database? Understanding the relationships between variables in a professional discipline can be viewed as the core of the discipline, and these information measures are very important to the study of the organization of information. A web-based information-theoretic calculator is examined that enables students to easily and completely process various information-theoretic calculations that are useful in studying database relationships. Students were questioned after using the calculator on a homework assignment. The students' evaluations of this form of calculator were then examined, and lastly, recommendations about using information-theoretic calculators are suggested. Recommendations are made about the use of this form of calculator in a range of academic disciplines, from computer science and business, to library and information sciences. These recommendations apply to both the academy and professional practice applications in informational domains.","authors":["Robert M. Losee"],"meta":["August 2017Information (Switzerland) 8(3):98","DOI:10.3390/info8030098"],"references":["320637949_Information_and_Knowledge_Combining_Justification_Truth_and_Belief","315508967_Information_theory_for_information_science_Antecedents_philosophy_and_applications","281667442_Defining_the_Graduate_College_Experience_What_it_Should_versus_Does_Include","264947702_Information_From_Processes_About_the_Nature_of_Information_Creation_Use_and_Representation","263105247_Do_undergraduate_students_view_calculator_usage_as_a_proxy_for_learning_with_understanding","261528530_Analysis_and_Synthesis_of_Metadata_Goals_for_Scientific_Data","249797937_Does_Homework_Improve_Academic_Achievement_A_Synthesis_of_Research_1987-2003","246477094_Innumeracy_Mathematical_Illiteracy_and_Its_Consequences_JA_Paulos","221212681_On_the_Semantics_of_the_Relational_Data_Model","220422209_A_Simple_Guide_to_Five_Normal_Forms_in_Relational_Database_Theory"]}