{"id":"319154422_Ultra-High_Field_NMR_and_MRI-The_Role_of_Magnet_Technology_to_Increase_Sensitivity_and_Specificity","abstract":"Starting with post-war developments in nuclear magnetic resonance (NMR) a race for stronger and stronger magnetic fields has begun in the 1950s to overcome the inherently low sensitivity of this promising method. Further challenges were larger magnet bores to accommodate small animals and eventually humans. Initially, resistive electromagnets with small pole distances, or sample volumes, and field strengths up to 2.35 T (or 100 MHz 1H frequency) were used in applications in physics, chemistry, and material science. This was followed by stronger and more stable (Nb-Ti based) superconducting magnet technology typically implemented first for small-bore systems in analytical chemistry, biochemistry and structural biology, and eventually allowing larger\nhorizontal-bore magnets with diameters large enough to fit small laboratory animals.\nBy the end of the 1970s, first low-field resistive magnets big enough to accommodate humans were developed and superconducting whole-body systems followed. Currently, cutting-edge analytical NMR systems are available at proton frequencies up to 1 GHz (23.5 T) based on Nb3Sn at 1.9 K. A new 1.2 GHz system (28 T) at 1.9 K, operating in persistent mode but using a combination of low and high temperature multi-filament superconductors is to be released. Preclinical instruments range from small-bore animal systems with typically 600–800 MHz (14.1–18.8 T) up to 900 MHz (21 T) at 1.9 K. Human whole-body MRI systems currently operate up to 10.5 T.\nHybrid combined superconducting and resistive electromagnets with even higher field strength of 45 T dc and 100 T pulsed, are available for material research, of course with smaller free bore diameters. This rather costly development toward higher and higher field strength is a consequence of the inherently low and, thus, urgently needed sensitivity in all NMR experiments. This review particularly describes and compares the developments in superconducting magnet technology and, thus, sensitivity in three fields of research: analytical NMR, biomedical and preclinical research, and human MRI and MRS, highlighting important steps and innovations. In addition, we summarize our knowledge on safety issues. An outlook into even stronger magnetic fields using different superconducting materials and/or hybrid magnet designs is presented.","authors":["Ewald Moser","Elmar Laistler","Franz Schmitt","Georg Kontaxis"],"meta":["August 2017Frontiers in Physics 5:33","DOI:10.3389/fphy.2017.00033","Project: 7 Tesla MRI & MRS - a versatile prototype"],"references":["313989743_Superconducting_Magnets","309372845_Toward_imaging_the_body_at_105_tesla","293795540_Comparison_of_Routine_Brain_Imaging_at_3_T_and_7_T","331923287_Magnetic_Resonance_in_Medicine_-_The_Basic_Textbook_of_the_European_Magnetic_Resonance_Forum","319583154_Morris_Peter_Whole-Body_MRI_in_Nottingham_The_First_Steps","312989845_Superconducting_winding_for_electromagnets","306008342_Ultra-high_field_magnets_for_whole-body_MRI","303488824_3D_Print_of_Polymer_Bonded_Rare-Earth_Magnets_and_3D_Magnetic_Field_Scanning_With_an_End-User_3D_Printer","293479873_Applications_of_NMR_Spectroscopy_to_Systems_Biochemistry","286831940_Nuclear_Induction","283917162_History_of_NMR_well_logging","279729103_Facing_and_Overcoming_Sensitivity_Challenges_in_Biomolecular_NMR_Spectroscopy","283317383_SENSE_sensitivity_encoding_for_fast_mri","281392161_Applications_of_FT_spectroscopy_to_magnetic_resonance","276358605_The_technological_future_of_7_T_MRI_hardware_The_Technological_Future_of_7_Tesla_MRI_Hardware"]}