{"id":"319107604_The_Development_of_Ontology_from_Multiple_Databases","abstract":"The area of halal industry is the fastest growing global business across the world. The halal food industry is thus crucial for Muslims all over the world as it serves to ensure them that the food items they consume daily are syariah compliant. Currently, ontology has been widely used in computer sciences area such as web on the heterogeneous information processing, semantic web, and information retrieval. However, ontology has still not been used widely in the halal industry. Today, Muslim community still have problem to verify halal status for products in the market especially foods consisting of E number. This research tried to solve problem in validating the halal status from various halal sources. There are various chemical ontology from multilple databases found to help this ontology development. The E numbers in this chemical ontology are codes for chemicals that can be used as food additives. With this E numbers ontology, Muslim community could identify and verify the halal status effectively for halal products in the market.","authors":["Shahreen Kasim","nurul aswa Omar","Mohd Farhan Md Fudzee","Ts. Azizul Azhar Ramli"],"meta":["August 2017IOP Conference Series Materials Science and Engineering 226(1):012108","DOI:10.1088/1757-899X/226/1/012108"],"references":["250303870_Halal_Traceability_and_Halal_Tracking_Systems_in_Strengthening_Halal_Food_Supply_Chain_for_Food_Industry_in_Malaysia_A_Review","243772462_Ontology_Development_101_A_Guide_to_Creating_Your_First_Ontology","224041454_Ontology-based_semantic_similarity_A_new_feature-based_approach","221013843_A_process_for_building_domain_ontology_An_experience_in_developing_Solat_ontology","51176251_AO_An_Open_Annotation_Ontology_for_Science_on_the_Web","261248007_A_prototype_of_Halal_product_recognition_system","244437488_A_Translation_Approach_to_Portable_Ontology_Specifications","235720353_A_Translational_Approach_to_Portable_Ontologies","221305954_Development_and_Application_of_Knowledge_Engineering_Based_on_Ontology","49911101_Product_structure_ontology_to_support_semantic_search_in_manufacturing_requirements_management"]}