{"id":"319151530_StarCraft_II_A_New_Challenge_for_Reinforcement_Learning","abstract":"This paper introduces SC2LE (StarCraft II Learning Environment), a reinforcement learning environment based on the StarCraft II game. This domain poses a new grand challenge for reinforcement learning, representing a more difficult class of problems than considered in most prior work. It is a multi-agent problem with multiple players interacting; there is imperfect information due to a partially observed map; it has a large action space involving the selection and control of hundreds of units; it has a large state space that must be observed solely from raw input feature planes; and it has delayed credit assignment requiring long-term strategies over thousands of steps. We describe the observation, action, and reward specification for the StarCraft II domain and provide an open source Python-based interface for communicating with the game engine. In addition to the main game maps, we provide a suite of mini-games focusing on different elements of StarCraft II gameplay. For the main game maps, we also provide an accompanying dataset of game replay data from human expert players. We give initial baseline results for neural networks trained from this data to predict game outcomes and player actions. Finally, we present initial baseline results for canonical deep reinforcement learning agents applied to the StarCraft II domain. On the mini-games, these agents learn to achieve a level of play that is comparable to a novice player. However, when trained on the main game, these agents are unable to make significant progress. Thus, SC2LE offers a new and challenging environment for exploring deep reinforcement learning algorithms and architectures.","authors":["Oriol Vinyals","Timo Ewalds","Sergey Bartunov","Petko Georgiev"],"meta":["August 2017"],"references":["316072750_Learning_from_Demonstrations_for_Real_World_Reinforcement_Learning","316015522_Data-efficient_Deep_Reinforcement_Learning_for_Dexterous_Manipulation","313963375_ViZDoom_A_Doom-based_AI_research_platform_for_visual_reinforcement_learning","309738626_Playing_SNES_in_the_Retro_Learning_Environment","292074166_Mastering_the_game_of_Go_with_deep_neural_networks_and_tree_search","319770229_Auto-Encoding_Variational_Bayes","318392574_Learning_Macromanagement_in_StarCraft_from_Replays_using_Deep_Learning","318205435_ELF_An_Extensive_Lightweight_and_Flexible_Research_Platform_for_Real-time_Strategy_Games","301899315_Learning_Hand-Eye_Coordination_for_Robotic_Grasping_with_Deep_Learning_and_Large-Scale_Data_Collection","301648324_Benchmarking_Deep_Reinforcement_Learning_for_Continuous_Control"]}