{"id":"319183983_Lean_Six_Sigma_Yesterday_Today_and_Tomorrow","abstract":"Purpose – The purpose of this paper is to share the experiences and perspectives of three practitioners from two continents on the subject of Lean Six Sigma (LSS) from both academic and industrial viewpoints. The authors of the paper have each been working on the topic of LSS over the past 15 years and have contributed over 150 journal and conference papers to the topics of lean and Six Sigma.\n\nDesign/methodology/approach – The approach is to synthesize the practical experiences and research conducted by three authorities on the topic of LSS. In addition, relevant secondary data have also been used in the sections where and when appropriate.\n\nFindings – The authors initially present the history of LSS emphasizing the importance of integration of the two most effective process excellence methodologies over the past 30 years. The authors also report the current trends of LSS in organizations as well as the emerging future trends. They argue that LSS will continue to grow and evolve across the globe for several years.\n\nPractical implications – The paper is intended to be equally useful to both academics and practitioners who are interested on the topic of LSS. From a pure practical standpoint, the paper provides an overview of the past, present and future trends of LSS as a powerful business strategy and problem-solving methodology for all industrial sectors, irrespective of their size and nature. The documentation of the history and recent developments in LSS should be useful to researchers in academia.\n\nOriginality/value – In authors’ best knowledge, there are no recent journal articles which cover all the three of these aspects; the past, the present and the future of LSS. This paper presents the above three aspects in a unique manner and addresses the gap between the current state and future directions of LSS.\n\nKeywords - Six Sigma, Lean, Continuous improvement, Lean Six Sigma, Operational excellence, Process excellence","authors":["Jiju Antony","Ron Snee","Roger Hoerl"],"meta":["June 2017International Journal of Quality & Reliability Management 34(4):1073-1093","DOI:10.1108/IJQRM-03-2016-0035","Projects: Lean Six SigmaLean Six Sigma"],"references":["310425877_One_Size_Does_Not_Fit_All_Identifying_the_Right_Improvement_Methodology","310425784_Inquiry_on_Pedigree_Do_You_Know_the_Quality_and_Origin_of_Your_Data","307981402_Can_Lean_Six_Sigma_make_UK_public_sector_organisations_more_efficient_and_effective","290005471_Follow_the_fundamentals_Four_data_analysis_basics_will_help_you_do_big_data_projects_the_right_way","283047231_Integrating_Lean_and_Six_Sigma_-_A_Holistic_Approach","283017503_Digging_the_Holistic_Approach_Rethinking_Business_Improvement_to_Improve_the_Bottom_Line","282980890_Engineering_an_Advantage","299341271_Implementing_Lean_Six_Sigma_to_overcome_the_production_challenges_in_an_aerospace_company","289233655_Geared_toward_innovation","287949825_The_Checklist_Manifesto_How_to_Get_Things_Right"]}