{"id":"319186808_Exploring_Directional_Path-Consistency_for_Solving_Constraint_Networks","abstract":"Among the local consistency techniques used for solving constraint networks, path-consistency (PC) has received a great deal of attention. However, enforcing PC is computationally expensive and sometimes even unnecessary. Directional path-consistency (DPC) is a weaker notion of PC that considers a given variable ordering and can thus be enforced more efficiently than PC. This paper shows that DPC (the DPC enforcing algorithm of Dechter and Pearl) decides the constraint satisfaction problem (CSP) of a constraint language if it is complete and has the variable elimination property (VEP). However, we also show that no complete VEP constraint language can have a domain with more than 2 values. We then present a simple variant of the DPC algorithm, called DPC*, and show that the CSP of a constraint language can be decided by DPC* if it is closed under a majority operation. In fact, DPC* is sufficient for guaranteeing backtrack-free search for such constraint networks. Examples of majority-closed constraint classes include the classes of connected row-convex (CRC) constraints and tree-preserving constraints, which have found applications in various domains, such as scene labeling, temporal reasoning, geometric reasoning, and logical filtering. Our experimental evaluations show that DPC* significantly outperforms the state-of-the-art algorithms for solving majority-closed constraints.","authors":["Shufeng Kong","Sanjiang Li","Michael Sioutis"],"meta":["August 2017The Computer Journal 61(9)","DOI:10.1093/comjnl/bxx122"],"references":["317751620_On_tree-preserving_constraints","282544899_Tractability_in_Constraint_Satisfaction_Problems_A_Survey","280534345_On_Tree-Preserving_Constraints","324705394_Leveraging_Variable_Elimination_for_Efficiently_Reasoning_about_Qualitative_Constraints","310823580_Weak_consistency_notions_for_all_the_CSPs_of_bounded_width","301819263_Weaker_consistency_notions_for_all_the_CSPs_of_bounded_width","286195972_Constraint_Processing","285846829_The_collapse_of_the_bounded_width_hierarchy","262294715_Constraint_Satisfaction_Problems_Solvable_by_Local_Consistency_Methods","256660085_Qualitative_constraint_satisfaction_problems_An_extended_framework_with_landmarks"]}