{"id":"319127353_Why_did_Rikuzentakata_Have_a_High_Death_Toll_in_the_2011_Great_East_Japan_Earthquake_and_Tsunami_Disaster_Finding_the_Devastating_Disaster's_Root_Causes","abstract":"This paper aims to identify the root causes that exacerbated the loss of life from the 2011 Great East Japan Earthquake and Tsunami (GEJET) disaster in one of the local municipalities, Rikuzentakata. Finding root causes is crucial for learning from disasters; however, there has not been much investigation of the root causes with regard to the GEJET disaster. This paper seeks to investigate systematically the root causes of the loss of life by organizing the existing analytical frameworks, tools and approaches in order to clarify why Rikuzentakata experienced such a high death toll. The study’s research design includes a social background survey, an in-depth interview survey and an investigation of the disaster’s root causes. Through the research design, inappropriate regional development and urbanization, inadequate tsunami countermeasures in the area and misguided belief systems based on aged memories of the local people have been identified as root causes for the high death toll in Rikuzentakata. This study also provides four key points essential to building resilient communities: 1) education and training to consider local people’s misguided belief system using their own memories and excess reliance on infrastructure and warning systems; 2) land-use considerations regarding regional development and urbanization; 3) learning lessons from previous disaster risk-management efforts to confirm tsunami countermeasures in the area; and 4) countermeasures for the elderly to harmonize with an aging society.","authors":["Tadashi Nakasu","Yuichi Ono","Wiraporn Pothisiri"],"meta":["March 2018International Journal of Disaster Risk Reduction 27:21-36","DOI:10.1016/j.ijdrr.2017.08.001","Project: Research on Disaster Resilience in an Aging Society"],"references":["329961277_HUMAN_VULNERABILITY_INDEX_FOR_EVALUATING_TSUNAMI_EVACUATION_CAPABILITY_OF_COMMUNITIES_Eng_Version","317244479_Human_Vulnerability_Index_for_Evaluating_Tsunami_Evacuation_Capability_of_Communities_in_Japanese_Abstract_is_in_English","280389461_Tsunami_inundation_after_the_Great_East_Japan_Earthquake_and_mortality_of_affected_communities","261106744_Tsunami_Heights_along_the_Pacific_Coast_of_Northern_Honshu_Recorded_from_the_2011_Tohoku_and_Previous_Great_Earthquakes","257317631_Lessons_Learned_from_the_2011_Great_East_Japan_Tsunami_Performance_of_Tsunami_Countermeasures_Coastal_Buildings_and_Tsunami_Evacuation_in_Japan","324632431_BOOK_REVIEW_of_At_Risk_Natural_Hazards_People's_Vulnerability_and_Disasters","315810292_Forensic_Investigation_of_the_2011_Great_East_Japan_Earthquake_and_Tsunami_disaster_a_case_study_of_Rikuzentakata","313569981_Measuring_vulnerability_to_promote_disaster-resilient_societies_Conceptual_frameworks_and_definitions","233018805_Forensic_Disaster_Investigations_in_Depth_A_New_Case_Study_Model"]}