{"id":"319159683_The_circadian_profile_of_epilepsy_improves_seizure_forecasting","abstract":"Abstract\nIt is now established that epilepsy is characterized by periodic dynamics that increase seizure likelihood at certain times of day, and which are highly patient-specific. However, these dynamics are not typically incorporated into seizure prediction algorithms due to the difficulty of estimating patient-specific rhythms from relatively short-term or unreliable data sources. This work outlines a novel framework to develop and assess seizure forecasts, and demonstrates that the predictive power of forecasting models is improved by circadian information. The analyses used long-term, continuous electrocorticography from nine subjects, recorded for an average of 320 days each. We used a large amount of out-of-sample data (a total of 900 days for algorithm training, and 2879 days for testing), enabling the most extensive post hoc investigation into seizure forecasting. We compared the results of an electrocorticography-based logistic regression model, a circadian probability, and a combined electrocorticography and circadian model. For all subjects, clinically relevant seizure prediction results were significant, and the addition of circadian information (combined model) maximized performance across a range of outcome measures. These results represent a proof-of-concept for implementing a circadian forecasting framework, and provide insight into new approaches for improving seizure prediction algorithms. The circadian framework adds very little computational complexity to existing prediction algorithms, and can be implemented using current-generation implant devices, or even non-invasively via surface electrodes using a wearable application. The ability to improve seizure prediction algorithms through straightforward, patient-specific modifications provides promise for increased quality of life and improved safety for patients with epilepsy.","authors":["Philippa Jane Karoly","Hoameng Ung","David Bruce Grayden","Levin Kuhlmann"],"meta":["July 2017Brain 140(8):2169-2182","DOI:10.1093/brain/awx173","Project: Neurovista Study"],"references":["312660745_A_forward-looking_review_of_seizure_prediction","304404924_Circadian_regulation_of_human_cortical_excitability","303773560_Decoding_EEG_and_LFP_signals_using_deep_learning_heading_TrueNorth","299541188_Crowdsourcing_reproducible_seizure_forecasting_in_human_and_canine_epilepsy","330334643_Neural_Control_Engineering_The_Emerging_Intersection_between_Control_Theory_and_Neuroscience","327541364_Circadian_Regulation_of_Neural_Excitability_in_Temporal_Lobe_Epilepsy","319770184_Speech_Recognition_With_Deep_Recurrent_Neural_Networks","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","303599651_Clobazam_higher-evening_differential_dosing_as_an_add-on_therapy_in_refractory_epilepsy","303595070_Seizure_prediction_making_mileage_on_the_long_and_winding_road"]}