{"id":"319190709_Investigations_on_Genetic_Algorithm_Performances_in_a_Parallel_Machines_Scheduling_Environment","abstract":"In present manufacturing environment, the reentrant scheduling problem is one of the most important issues in the planning and operation of production systems. It has a large scope such as capacity distribution and inventory control. On the other hand, the markets are very competitive; it is a critical requirement of operational management to have effective management of resources (consumable and renewable) so as to achieve optimal production plan. This study considers a reentrant parallel machines scheduling problem with consumable resources. Each job consumes several components and must be processed more than once in a stage composed of identical parallel machines. The resources availability, jobs assignment and sequencing at each cycle and are considered and optimized simultaneously. On the basis of this representation, a MILP model is developed. Thus, that MILP model can be used for the problem in order to find the exact solution. Since, this problem is clearly NP-hard, and optimal solutions for large instances are highly intractable, a genetic algorithm is developed to obtain nearoptimal\nsolution. Then, an improvement phase based on different local search procedures are performed and examined to generate better solutions. The system performances are assessed in terms of measures\nsuch as the solution quality and the execution time. The effectiveness of the proposed metaheuristic is examined based on comparative study. The simulation results demonstrate that the presented algorithm is able to find an optimal solution for small-sized problems and can effectively find a near optimal solution for large-sized problems to minimize the makespan of the considered problem.","authors":["Fayçal Belkaid","Farouk Yalaoui","Zaki Sari"],"meta":["August 2017The Open Automation and Control Systems Journal 9(Suppl-1, M6):60-74","DOI:10.2174/1874444301709010060","Projects: Parallel Machine Scheduling ProblemSpecial Issue"],"references":["306157633_A_genetic_algorithm_for_the_parallel_machine_scheduling_problem_with_consumable_resources","279581021_A_hybridized_genetic_algorithm_to_solve_parallel_machine_scheduling_problems_with_sequence_dependent_setups","263371825_Operations_scheduling_with_multiple_resources_and_transportation_considerations","269266625_Scheduling_Supply_Chain_Node_with_fixed_Components_Arrivals_and_Two_Partially_Flexible_Deliveries","261311555_A_hybrid_genetic_algorithm_for_parallel_machine_scheduling_problem_with_consumable_resources","251694005_Parallel_machine_scheduling_problem_to_minimize_the_makespan_with_resource_dependent_processing_times","245280420_Scheduling_under_a_Nonrenewable_Resource_Constraint","242916392_An_analysis_of_heuristics_for_the_parallel-machine_flexible-resource_scheduling_problem","229357584_Scheduling_non-similar_groups_on_a_flow_line_Multiple_group_setups","223611062_Parallel_machine_scheduling_with_earliness_and_tardiness_penalties"]}