{"id":"319133380_Trends_and_Patterns_in_Massive_Open_Online_Courses_Review_and_Content_Analysis_of_Research_on_MOOCs_2008-2015","abstract":"To fully understand the phenomenon of massive open online courses (MOOCs), it is important to identify and map trends and patterns in research on MOOCs. This study does so by reviewing 362 empirical articles published in peer-reviewed journals from 2008 to2015. For the purpose of this study, content analysis and discourse analysis were employed to analyze the articles. Accordingly, the trend line showing the number of articles per year indicates that the extent of research on MOOCs is likely to increase inthe coming years. In terms of research areas, the findings reveal an imbalance and three research areas out of fifteen constitute more than half of all research on MOOCs. With regard to types of MOOCs, related literature is dominated by research on xMOOCs. The discourse in MOOC articles takes a mostly neutral standpoint, articles with a positive outlook outweigh those that are negative, and there is an increase in a more critical discourse. Theoretical or conceptual studies are preferred by researchers, although MOOC research generally does not benefit from being viewed through theoretical or conceptual lenses.","authors":["Aras Bozkurt","Ela Akgün Özbek","Olaf Zawacki-Richter"],"meta":["August 2017International Review of Research in Open and Distance Learning 18(5)","DOI:10.19173/irrodl.v18i5.3080"],"references":["306389644_Research_Trends_in_Massive_Open_Online_Course_MOOC_Theses_and_Dissertations_Surfing_the_Tsunami_Wave","292185780_Research_Trends_in_Turkish_Distance_Education_A_Content_Analysis_of_Dissertations_1986-2014","323776698_Moocs_Disruptive_Innovation_and_the_Future_of_Higher_Education","319335770_An_avalanche_is_coming_Higher_education_and_the_revolution_ahead","308167244_Retention_and_intention_in_massive_open_online_courses_In_depth","308162973_MOOC_mania","303215801_Online_educational_delivery_models_a_descriptive_view","292779771_'An_introduction_to_Systematic_Reviews'","290487601_Wrapping_a_MOOC_Student_perceptions_of_an_experiment_in_blended_learning","290487442_MOOCS_and_the_future_of_higher_education"]}