{"id":"319121764_A_Scalable_Multicore_Architecture_With_Heterogeneous_Memory_Structures_for_Dynamic_Neuromorphic_Asynchronous_Processors_DYNAPs","abstract":"Neuromorphic computing systems comprise net- works of neurons that use asynchronous events for both computation and communication. This type of representation offers several advantages in terms of bandwidth and power consumption in neuromorphic electronic systems. However, managing the traffic of asynchronous events in large scale systems is a daunting task, both in terms of circuit complexity and memory requirements. Here we present a novel routing methodology that employs both hierarchical and mesh routing strategies and combines heterogeneous memory structures for minimizing both memory requirements and latency, while maximizing programming flexibility to support a wide range of event-based neural network architectures, through parameter configuration. We validated the proposed scheme in a prototype multi-core neuromorphic processor chip that employs hybrid analog/digital circuits for emulating synapse and neuron dynamics together with asynchronous digital circuits for managing the address-event traffic. We present a theoretical analysis of the proposed connectivity scheme, describe the methods and circuits used to implement such scheme, and characterize the prototype chip. Finally, we demonstrate the use of the neuromorphic processor with a convolutional neural network for the real-time classification of visual symbols being flashed to a dynamic vision sensor (DVS) at high speed.","authors":["Saber Moradi","Ning Qiao","Fabio Stefanini","Giacomo Indiveri"],"meta":["August 2017IEEE Transactions on Biomedical Circuits and Systems PP(99)","DOI:10.1109/TBCAS.2017.2759700"],"references":["301837424_Convolutional_Networks_for_Fast_Energy-Efficient_Neuromorphic_Computing","287810855_Poker-DVS_and_MNIST-DVS_their_history_how_they_were_made_and_other_details","283446898_Fast-Classifying_High-Accuracy_Spiking_Deep_Networks_Through_Weight_and_Threshold_Balancing","281693463_Recurrent_neuronal_circuits_in_the_neocortex","279632983_Energy-Efficient_Neuromorphic_Classifiers","278048580_Memory_and_Information_Processing_in_Neuromorphic_Systems","312963076_Scaling_Mixed-Signal_Neuromorphic_Processors_to_28_nm_FD-SOI_Technologies","312502006_ReRAM-Based_Neuromorphic_Computing_From_Fundamentals_of_Nanoionic_Redox_Processes_to_Memristive_Device_Applications","305744478_Hierarchical_Address_Event_Routing_for_Reconfigurable_Large-Scale_Neuromorphic_Systems","305319464_HOTS_A_Hierarchy_of_Event-Based_Time-Surfaces_for_Pattern_Recognition"]}