{"id":"319115826_Achieving_privacy-preserving_big_data_aggregation_with_fault_tolerance_in_smart_grid","abstract":"In a smart grid, a huge amount of data is collected for various applications, such as load monitoring and demand response. These data are used for analyzing the power state and formulating the optimal dispatching strategy. However, these big energy data in terms of volume, velocity and variety raise concern over consumers’ privacy. For instance, in order to optimize energy utilization and support demand response, numerous smart meters are installed at a consumer's home to collect energy consumption data at a fine granularity, but these fine-grained data may contain information on the appliances and thus the consumer's behaviors at home. In this paper, we propose a privacy-preserving data aggregation scheme based on secret sharing with fault tolerance in a smart grid, which ensures that the control center obtains the integrated data without compromising privacy. Meanwhile, we also consider fault tolerance and resistance to differential attack during the data aggregation. Finally, we perform a security analysis and performance evaluation of our scheme in comparison with the other similar schemes. The analysis shows that our scheme can meet the security requirement, and it also shows better performance than other popular methods.","authors":["Zhitao Guan","Guanlin Si"],"meta":["August 2017Digital Communications and Networks 3(4)","DOI:10.1016/j.dcan.2017.08.005"],"references":["307601658_CLPP_Context-aware_Location_Privacy_Protection_for_Location-based_Social_Network","304401710_Pseudonym-based_privacy-preserving_scheme_for_data_collection_in_smart_grid","301716085_Protection_of_Big_Data_Privacy","283115496_Processing_Geo-Dispersed_Big_Data_in_an_Advanced_MapReduce_Framework","303830011_Big_Privacy_Challenges_and_Opportunities_of_Privacy_Study_in_the_Age_of_Big_Data","300408571_Privacy_preserving_smart_grid_Communications_by_verifiable_secret_key_sharing","286594784_A_big_data_aggregation_analysis_and_exploitation_integrated_platform_for_increasing_social_management_intelligence","282477325_Diverse_Grouping-Based_Aggregation_Protocol_With_Error_Detection_for_Smart_Grid_Communications","281145200_The_Privacy_Analysis_of_Battery_Control_Mechanisms_in_Demand_Response_Revealing_State_Approach_and_Rate_Distortion_Bounds","281082919_A_Li4Ti5O12TiO2CNT_CoreShell_Structure_for_rechargeable_Li_batteries"]}