{"id":"319191213_On_the_quest_for_currencies_of_science_Field_exchange_rates_for_citations_and_Mendeley_readership","abstract":"Purpose\nThe introduction of “altmetrics” as new tools to analyze scientific impact within the reward system of science has challenged the hegemony of citations as the predominant source for measuring scientific impact. Mendeley readership has been identified as one of the most important altmetric sources, with several features that are similar to citations. The purpose of this paper is to perform an in-depth analysis of the differences and similarities between the distributions of Mendeley readership and citations across fields.\n\nDesign/methodology/approach\nThe authors analyze two issues by using in each case a common analytical framework for both metrics: the shape of the distributions of readership and citations, and the field normalization problem generated by differences in citation and readership practices across fields. In the first issue the authors use the characteristic scores and scales method, and in the second the measurement framework introduced in Crespo et al. (2013).\n\nFindings\nThere are three main results. First, the citations and Mendeley readership distributions exhibit a strikingly similar degree of skewness in all fields. Second, the results on “exchange rates (ERs)” for Mendeley readership empirically supports the possibility of comparing readership counts across fields, as well as the field normalization of readership distributions using ERs as normalization factors. Third, field normalization using field mean readerships as normalization factors leads to comparably good results.\n\nOriginality/value\nThese findings open up challenging new questions, particularly regarding the possibility of obtaining conflicting results from field normalized citation and Mendeley readership indicators; this suggests the need for better determining the role of the two metrics in capturing scientific recognition.","authors":["Rodrigo Costas","Antonio Perianes-Rodriguez","Javier Ruiz-Castillo"],"meta":["August 2017Aslib Journal of Information Management 69(1):00-00","DOI:10.1108/AJIM-01-2017-0023"],"references":["310593569_A_comparison_of_the_Web_of_Science_and_publication-level_classification_systems_of_science","303983414_Normalization_of_Mendeley_reader_impact_on_the_reader-_and_paper-side_A_comparison_of_the_Mean_Discipline_Normalized_Reader_Score_MDNRS_with_the_Mean_Normalized_Reader_Score_MNRS_and_bare_reader_count","287512822_Normalization_of_Mendeley_reader_counts_for_impact_assessment","285363225_A_comparison_of_two_ways_of_evaluating_research_units_working_in_different_scientific_fields","283959639_University_citation_distributions","277912014_The_thematic_orientation_of_publications_mentioned_on_social_media_Large-scale_disciplinary_comparison_of_social_media_metrics_with_citations","315489823_Mendeley_readership_as_a_filtering_tool_to_identify_highly_cited_publications","303692349_Authorship_Patents_Citations_Acknowledgments_Tweets_Reader_Counts_and_the_Multifaceted_Reward_System_of_Science","285376612_The_Forms_of_Capital","282924761_National_research_impact_indicators_from_Mendeley_readers"]}