{"id":"319131538_Comprehension_First_Evaluating_a_Novel_Pedagogy_and_Tutoring_System_for_Program_Tracing_in_CS1","abstract":"What knowledge does learning programming require? Prior work has focused on theorizing program writing and problem solving skills. We examine program comprehension and propose a formal theory of program tracing knowledge based on control flow paths through an interpreter program's source code. Because novices cannot understand the interpreter's programming language notation, we transform it into causal relationships from code tokens to instructions to machine state changes. To teach this knowledge, we propose a comprehension-first pedagogy based on causal inference, by showing, explaining, and assessing each path by stepping through concrete examples within many example programs. To assess this pedagogy, we built PLTutor, a tutorial system with a fixed curriculum of example programs. We evaluate learning gains among self-selected CS1 students using a block randomized lab study comparing PLTutor with Codecademy, a writing tutorial. In our small study, we find some evidence of improved learning gains on the SCS1, with average learning gains of PLTutor 60% higher than Codecademy (gain of 3.89 vs. 2.42 out of 27 questions). These gains strongly predicted midterms (R²=.64) only for PLTutor participants, whose grades showed less variation and no failures.","authors":["Greg L. Nelson","Benjamin Xie","Andrew J. Ko"],"meta":["August 2017","DOI:10.1145/3105726.3106178","Conference: the 2017 ACM Conference"],"references":["310818888_Replication_Validation_and_Use_of_a_Language_Independent_CS1_Knowledge_Assessment","307090366_Learning_to_Program_Gender_Differences_and_Interactive_Effects_of_Students'_Motivation_Goals_and_Self-Efficacy_on_Performance","305081807_Learning_to_Program_is_Easy","344498134_Analysis_of_Pretest-Posttest_Designs","319540874_Generating_program_animators_from_programming_language_semantics","316712366_Teaching_Programming_with_Gamified_Semantics","314286208_Teaching_for_transfer_of_computer_program_comprehension_skill","310818887_The_Role_of_Self-Regulation_in_Programming_Problem_Solving_Process_and_Success","304417737_Further_evidence_of_a_relationship_between_explaining_tracing_and_writing_skills_in_introductory_programming","301935081_Programming_Problem_Solving_and_Self-Awareness_Effects_of_Explicit_Guidance"]}