{"id":"319132017_Students'_Emotional_Reactions_to_Programming_Projects_in_Introduction_to_Programming_Measurement_Approach_and_Influence_on_Learning_Outcomes","abstract":"Previous research has found that programming assignments can produce strong emotional reactions in introductory programming students. These emotional reactions often have to do with the frustration of dealing with difficulties and how hard it can be to overcome problems. Not only are these emotional reactions powerful in and of themselves, they have also been shown to induce students to make self-efficacy judgments, which can in turn cause adaptive or maladaptive behaviors, depending on the valence of the judgment. These results have been found in previous qualitative research in programming, however, to date no one has done a larger scale quantitative examination of emotional reactions in introductory programming students. Furthermore, no one has tried to connect these emotional reactions systematically to student learning outcomes. Therefore, this study reports on the pilot use of a basic emotional reactions survey with a large class of undergraduate introductory programming students. Preliminary results are presented on how these emotional reactions affect students' course outcomes over the short and longer term.","authors":["Alex Lishinski","Aman Yadav","R.J. Enbody"],"meta":["August 2017","DOI:10.1145/3105726.3106187","Conference: the 2017 ACM Conference"],"references":["307090366_Learning_to_Program_Gender_Differences_and_Interactive_Effects_of_Students'_Motivation_Goals_and_Self-Efficacy_on_Performance","300176856_Emotions_in_Problem_Solving","281378331_Mobile_Linear_Algebra_with_Sage","271429287_A_Manual_for_the_Use_of_the_Motivated_Strategies_for_Learning_Questionnaire_MSLQ","318393858_R_A_Language_and_Environment_for_Statistical_Computing","318393770_R_A_Language_and_Environment_for_Statistical_Computing","311463575_Challenges_to_computer_science_education_research","281345608_Ggplot2_Elegant_Graphics_for_Data_Analysis","276165263_The_ongoing_challenges_of_computer_science_education_research","268001177_A_Study_of_Factors_Promoting_Success_in_Computer_Science"]}