{"id":"319209909_Multi-version_Coding_for_Consistent_Distributed_Storage_of_Correlated_Data_Updates","abstract":"Motivated by applications of distributed storage systems to cloud-based key-value stores, the multi-version coding problem has been recently formulated to store frequently updated data in asynchronous distributed storage systems. Inspired by consistency requirements in distributed computing, the main goal in multi-version coding is to ensure that the latest possible version of the data is decodable, even if all the data updates have not reached all the servers in the system. In this paper, we study the storage cost of ensuring consistency for the case where the various versions of the data are correlated, in contrast to previous work where versions were treated as being independent. We provide multi-version code constructions that show that the storage cost can be significantly smaller than the previous constructions depending on the degree of correlation between the different versions of the data. Our constructions are based on update-efficient codes, Reed-Solomon code, random binning coding and BCH codes. Specifically, we consider the multi-version coding setting with $n$ servers and $\\nu$ versions, with a failure tolerance of $n-c$, where the $\\nu$ message versions form a Markov chain. The message version is distributed uniformly over all binary vectors of length $K$, and given a version, the subsequent version is uniformly distributed in a Hamming ball of radius $\\delta_K K$ centered around that given version. Previously derived achievable schemes have a per-server storage cost of at least $ \\frac{1}{2}\\frac{\\nu K}{c}-o(K)$ when $\\nu \\leq c$, whereas we propose a scheme that has a storage cost of $\\frac{K}{c} + \\frac{\\nu-1}{c}\\log Vol(\\delta_KK, K)$, where $Vol(r, K)$ is the volume of a ball of radius $r$ in the $K$ dimensional Hamming cube. Through a converse result, we show that our multi-version code constructions are nearly-optimal in certain correlation regimes.","authors":["Ramy E. Ali","Viveck Cadambe"],"meta":["August 2017"],"references":["318412374_Multi-Version_Coding_-_An_Information-Theoretic_Perspective_of_Consistent_Distributed_Storage","314237986_A_Layered_Architecture_for_Erasure-Coded_Consistent_Distributed_Storage","308321205_Correlation-Aware_Distributed_Caching_and_Coded_Delivery","301896026_Communication_Cost_for_Updating_Linear_Functions_When_Message_Updates_are_Sparse_Connections_to_Maximally_Recoverable_Codes","273832054_Compressed_Differential_Erasure_Codes_for_Efficient_Archival_of_Versioned_Data","273005528_File_Updates_Under_RandomArbitrary_Insertions_And_Deletions","315617373_Enhancing_Edge_Computing_with_Database_Replication","309405634_Consistent_Distributed_Storage_of_Correlated_Data_Updates_Via_Multi-version_Coding","304111080_Codes_correcteurs_derreurs","280113655_Cassandra_The_Definitive_Guide"]}