{"id":"319275431_The_shape_of_collaborations","abstract":"The structure of scientific collaborations has been the object of intense study both for its importance for innovation and scientific advancement, and as a model system for social group coordination and formation thanks to the availability of authorship data. Over the last years, complex networks approach to this problem have yielded important insights and shaped our understanding of scientific communities. In this paper we propose to complement the picture provided by network tools with that coming from using simplicial descriptions of publications and the corresponding topological methods. We show that it is natural to extend the concept of triadic closure to simplicial complexes and show the presence of strong simplicial closure. Focusing on the differences between scientific fields, we find that, while categories are characterized by different collaboration size distributions, the distributions of how many collaborations to which an author is able to participate is conserved across fields pointing to underlying attentional and temporal constraints. We then show that homological cycles, that can intuitively be thought as hole in the network fabric, are an important part of the underlying community linking structure.","authors":["Alice Patania","Giovanni Petri","Francesco Vaccarino"],"meta":["August 2017EPJ Data Science 6(1):18","DOI:10.1140/epjds/s13688-017-0114-8"],"references":["318093459_Topological_analysis_of_data","317230341_Construction_of_and_efficient_sampling_from_the_simplicial_configuration_model","301865836_Network_Structure_Self-Organization_and_the_Growth_of_International_Collaboration_in_Science","314237974_Weighted_Growing_Simplicial_Complexes","313697453_Pnas_community_structure_in_social_and_biological_networks_community_structure_in_social_and_biological_networks-_pnas","312970191_Scientific_collaboration_networks","311899572_Epidemic_processes_in_complex_networks","307906376_Control_principles_of_complex_systems","303562886_Topology_Big_Data_and_Optimization","301217640_Overlapping_Community_Detection_based_on_Network_Decomposition"]}