{"id":"319269747_Basic_Emotions_in_Human_Neuroscience_Neuroimaging_and_Beyond","abstract":"The existence of so-called ‘basic emotions’ and their defining attributes represents a long lasting and yet unsettled issue in psychology. Recently, neuroimaging evidence, especially related to the advent of neuroimaging meta-analytic methods, has revitalized this debate in the endeavor of systems and human neuroscience. The core theme focuses on the existence of unique neural bases that are specific and characteristic for each instance of basic emotion. Here we review this evidence, outlining contradictory findings, strengths and limits of different approaches. Constructionism dismisses the existence of dedicated neural structures for basic emotions, considering that the assumption of a one-to-one relationship between neural structures and their functions is central to basic emotion theories. While these critiques are useful to pinpoint current limitations of basic emotions theories, we argue that they do not always appear equally generative in fostering new testable accounts on how the brain relates to affective functions. We then consider evidence beyond PET and fMRI, including results concerning the relation between basic emotions and awareness and data from neuropsychology on patients with focal brain damage. Evidence from lesion studies are indeed particularly informative, as they are able to bring correlational evidence typical of neuroimaging studies to causation, thereby characterizing which brain structures are necessary for, rather than simply related to, basic emotion processing. These other studies shed light on attributes often ascribed to basic emotions, such as automaticity of perception, quick onset, and brief duration. Overall, we consider that evidence in favor of the neurobiological underpinnings of basic emotions outweighs dismissive approaches. In fact, the concept of basic emotions can still be fruitful, if updated to current neurobiological knowledge that overcomes traditional one-to-one localization of functions in the brain. In particular, we propose that the structure-function relationship between brain and emotions is better described in terms of pluripotentiality, which refers to the fact that one neural structure can fulfill multiple functions, depending on the functional network and pattern of co-activations displayed at any given moment.","authors":["Alessia Celeghin","Matteo Diano","Arianna Bagnis","Marco Viola"],"meta":["August 2017Frontiers in Psychology 08:1432","DOI:10.3389/fpsyg.2017.01432"],"references":["316633386_The_theory_of_constructed_emotion_an_active_inference_account_of_interoception_and_categorization","315695268_Dynamic_Changes_in_Amygdala_Psychophysiological_Connectivity_Reveal_Distinct_Neural_Networks_for_Facial_Expressions_of_Basic_Emotions","313774304_A_higher-order_theory_of_emotional_consciousness","312188755_Amygdala_Response_to_Emotional_Stimuli_without_Awareness_Facts_and_Interpretations","309590962_How_should_neuroscience_study_emotions_By_distinguishing_emotion_states_concepts_and_experiences","325671610_Emotion_drives_attention_Detecting_the_snake_in_the_grass","315742606_A_Network_Model_of_the_Emotional_Brain","313493106_Neuroscience_Needs_Behavior_Correcting_a_Reductionist_Bias","313358581_Emotion_Perception_from_Face_Voice_and_Touch_Comparisons_and_Convergence","311704116_Perceptual_integration_of_faces_and_voices_depends_on_the_interaction_of_emotional_content_and_spatial_frequency"]}