{"id":"319235279_Teaching_and_Learning_Computer_Programming_Using_Gamification_and_Observation_through_Action_Research","abstract":"This study was conducted to explore the effectiveness of teaching and learning programming using gamification approach. The research design used was an action research and a total of 225 students of Community College in Selangor, Malaysia has taken part in this study. All participants are divided into ten cycles of action research. Data collection has been done through structured observation and analysed using SWOT analysis techniques. The findings show that various weaknesses, strengths, opportunities and threats have been identified from reflection of teacher, students, educational expert as well as the researcher itself. Improvements have been made in every cycle and at the end of cycle shows that gamification is a good approach to teaching and learning computer programming as well as increasing student's achievement and motivation. This study has given the best impact on the field of computer programming education. However, the enhanced of this study should be done and the experimental design is suggested to be used for future studies. Introduction Computer programming is a significant education to everybody, but it always considered difficult. Among the main reasons is that most students are not able to solve the given programming problems and failed to master various different skills at one time such as syntax and semantic programming language (Hooshyar et al. 2015; Malik & Coldwell-Neilson 2017; Moshref Javadi et al. 2013). Creative problem solving skills, programming, computer hardware and applications form a concept that is also known as computational thinking (Park 2016). According to Wing (2008), when humans use logical thinking to solve complex problems by understanding the problem in small parts and using the Mathematical approach to solve it, they are using computational thinking that ultimately leads to the construction of computer applications. Wing also stated that computational thinking is scientific and capable of generating command-line algorithms to the computer to carry out tasks to solve problems. In addition, programming is a medium to computational thinking with application systems and hardware used in various fields (Voogt et al. 2015). In fact, computational thinking is closely linked to science, technology and society because of the logical, analytical, systematic and effective solution of problem solving that is needed all the","authors":["Noraini Talib","Siti Fatimah Mohd Yassin","M. Khalid M. Nasir"],"meta":["July 2017International Journal of Academic Research in Progressive Education and Development 6(3):1-11","DOI:10.6007/IJARPED/v6-i3/3045","Project: Programming with CPS"],"references":["327198883_Gamification_for_Health_and_WellbeingA_Systematic_Review_of_the_Literature","313020888_Gamification_and_serious_games_within_the_domain_of_domestic_energy_consumption_A_systematic_review","312172848_Impact_of_a_New_Teaching_and_Learning_Approach_in_an_Introductory_Programming_Course","282603860_Computational_thinking_in_compulsory_education_Towards_an_agenda_for_research_and_practice","282249412_Bringing_Computational_Thinking_to_STEM_Education","311361610_Learning_Basic_Programing_Skills_With_Educational_Games_A_Case_of_Primary_Schools_in_Slovenia","305628802_From_computational_thinking_to_computational_participation_in_K--12_education","298726799_Development_of_Computer_Education_Program_Using_LOGO_Programming_and_Fractals_Learning_for_enhancing_Creativity_Focus_on_Creative_Problem-Solving","282004825_Designing_Learning_From_Module_Outline_to_Effective_Teaching","276034614_Measuring_course_learning_outcomes"]}