{"id":"319287037_Teaching_Computational_Thinking_Using_Agile_Software_Engineering_Methods_A_Framework_for_Middle_Schools","abstract":"Computational Thinking (CT) has been recognized as one of the fundamental skills that all graduates should acquire. For this reason, motivational concerns need to be addressed at an early age of a child, and reaching students who do not consider themselves candidates for science, technology, engineering, and mathematics disciplines is important as well if the broadest audience possible is to be engaged. This article describes a framework for teaching and assessing CT in the context of K-12 education. The framework is based on Agile software engineering methods, which rely on a set of principles and practices that can be mapped to the activities of CT. The article presents as well the results of an experiment applying this framework in two sixth-grade classes, with 42 participants in total. The results show that Agile software engineering methods are effective at teaching CT in middle schools, after the addition of some tasks to allow students to explore, project, and experience the potential product before using the software tools at hand. Moreover, according to the teachers’ feedback, the students reached all the educational objectives of the topics involved in the multidisciplinary activities. This result can be taken as an indicator that it is possible to use computing as a medium for teaching other subjects, besides computer science.","authors":["Ilenia Fronza","Nabil El Ioini","Luis Corral"],"meta":["August 2017ACM Transactions on Computing Education 17(4):1-28","DOI:10.1145/3055258"],"references":["301642771_Time_to_re-load_Computational_Thinking_and_Computer_Science_in_Schools","301377094_Students_Want_to_Create_Apps","299397535_WHAT_ARE_THE_MAJOR_CURRICULUM_ISSUES_THE_USE_OF_MINDMAPPING_AS_A_BRAINSTORMING_EXERCISE","296148316_Comparing_Computational_Thinking_Development_Assessment_Scores_with_Software_Complexity_Metrics","286460595_Introduction_of_computational_thinking_in_a_hotel_management_school","281714025_Dr_Scratch_Automatic_Analysis_of_Scratch_Projects_to_Assess_and_Foster_Computational_Thinking","319393897_Taxonomy_of_educational_objectives_The_classification_of_educational_goals_Handbook_I_cognitive_domain","316858624_Computer_Science_Curricula_2013_Curriculum_Guidelines_for_Undergraduate_Degree_Programs_in_Computer_Science","298972479_Learning_Computer_Science_Concepts_with_Scratch","279355975_Experimentation_in_Software_Engineering"]}