{"id":"319276540_Phenetic_Comparison_of_Prokaryotic_Genomes_Using_k-mers","abstract":"Bacterial genomics studies are getting more extensive and complex, requiring new ways to envision analyses. Using the Ray Surveyor software, we demonstrate that comparison of genomes based on their k-mer content allows reconstruction of phenetic trees without the need of prior data curation, such as core genome alignment of a species. We validated the methodology using simulated genomes and previously published phylogenomic studies of Streptococcus pneumoniae and Pseudomonas aeruginosa. We also investigated the relationship of specific genetic determinants with bacterial population structures. By comparing clusters from the complete genomic content of a genome population with clusters from specific functional categories of genes, we can determine how the population structures are correlated. Indeed, the strain clustering based on a subset of k-mers allows determination of its similarity with the whole genome clusters. We also applied this methodology on 42 species of bacteria to determine the correlational significance of five important bacterial genomic characteristics. For example, intrinsic resistance is more important in P. aeruginosa than in S. pneumoniae, and the former has increased correlation of its population structure with antibiotic resistance genes. The global view of the pangenome of bacteria also demonstrated the taxa-dependent interaction of population structure with antibiotic resistance , bacteriophage, plasmid, and mobile element k-mer data sets.","authors":["Maxime Deraspe","Frédéric Raymond","Sébastien Boisvert","Alexander Culley"],"meta":["July 2017Molecular Biology and Evolution 34(10)","DOI:10.1093/molbev/msx200"],"references":["330684464_Antibacterial_gene_transfer_across_the_tree_of_life","317307828_Complete_Genome_of_a_Panresistant_Pseudomonas_aeruginosa_Strain_Isolated_from_a_Patient_with_Respiratory_Failure_in_a_Canadian_Community_Hospital","315059693_SILVA_RDP_Greengenes_NCBI_and_OTT_-_how_do_these_taxonomies_compare","312331922_Minimum_Information_about_a_Biosynthetic_Gene_cluster","309555904_Predictive_computational_phenotyping_and_biomarker_discovery_using_reference-free_genome_comparisons","309321807_Evaluating_the_mobility_potential_of_antibiotic_resistance_genes_in_environmental_resistomes_without_metagenomics","306269695_Reassessment_Of_Mendelian_Gene_Pathogenicity_Using_7855_Cardiomyopathy_Cases_And_60706_Reference_Samples","306246408_Gene_content_dissimilarity_for_subclassification_of_highly_similar_microbial_strains","314086324_MAFFT_multiple_sequence_alignment_software_version_7_improvements_in_performance_and_usability","312986441_The_Comparison_of_Dendrograms_by_Objective_Methods"]}