{"id":"319266639_A_Serendipitous_Mutation_Reveals_the_Severe_Virulence_Defect_of_a_Klebsiella_pneumoniae_fepB_Mutant","abstract":"Klebsiella pneumoniae is considered a significant public health threat because of the emergence of multidrug-resistant strains and the challenge associated with treating life-threatening infections. Capsule, siderophores, and adhesins have been implicated as virulence determinants of K. pneumoniae , yet we lack a clear understanding of how this pathogen causes disease. In a previous screen for virulence genes, we identified a potential new virulence locus and constructed a mutant ( smr ) with this locus deleted. In this study, we characterize the smr mutant and show that this mutation renders K. pneumoniae avirulent in a pneumonia model of infection. The smr mutant was expected to have a deletion of three genes, but subsequent genome sequencing indicated that a much larger deletion had occurred. Further analysis of the deleted region indicated that the virulence defect of the smr mutant could be attributed to the loss of FepB, a periplasmic protein required for import of the siderophore enterobactin. Interestingly, a Δ fepB mutant was more attenuated than a mutant unable to synthesize enterobactin, suggesting that additional processes are affected. As FepB is highly conserved among the members of the family Enterobacteriaceae , therapeutic targeting of FepB may be useful for the treatment of Klebsiella and other bacterial infections.\nIMPORTANCE In addition to having a reputation as the causative agent of several types of hospital-acquired infections, Klebsiella pneumoniae has gained widespread attention as a pathogen with a propensity for acquiring antibiotic resistance. It is capable of causing a range of infections, including urinary tract infections, pneumonia, and sepsis. Because of the rapid emergence of carbapenem resistance among Klebsiella strains, there is a dire need for a better understanding of virulence mechanisms and identification of new drug targets. Here, we identify the periplasmic transporter FepB as one such potential target.","authors":["Michelle Palacios","Christopher A. Broberg","Kimberly A. Walker","Virginia Miller"],"meta":["August 2017mSphere 2(4):e00341-17","DOI:10.1128/mSphere.00341-17"],"references":["309665793_Molecular_Epidemiology_of_Colonizing_and_Infecting_Isolates_of_Klebsiella_pneumoniae","309021881_Siderophore_Cephalosporin_Cefiderocol_Utilizes_Ferric_Iron_Transporter_Systems_for_Antibacterial_Activity_against_Pseudomonas_aeruginosa","309015874_Trojan_Horse_Antibiotics-A_Novel_Way_to_Circumvent_Gram-Negative_Bacterial_Resistance","293636999_H-NS_Nucleoid_Protein_Controls_Virulence_Features_of_Klebsiella_pneumoniae_by_Regulating_the_Expression_of_Type_3_Pili_and_the_Capsule_Polysaccharide","309799860_Siderophore_vaccine_conjugates_protect_against_uropathogenic_Escherichia_coli_urinary_tract_infection","306182494_Breaking_the_Spell_Combating_Multidrug_Resistant_'Superbugs'","306130880_An_unusual_crystal_structure_of_ferric-enterobactin_bound_FepB_suggests_novel_functions_of_FepB_in_microbial_iron_uptake","304009202_Klebsiella_pneumoniae_Going_on_the_Offense_with_a_Strong_Defense","301795897_Stability_of_novel_siderophore_cephalosporin_S-649266_to_clinically_relevant_carbapenemases","299341789_Epidemiology_and_Virulence_of_Klebsiella_pneumoniae"]}