{"id":"319272130_Easeml_Towards_Multi-tenant_Resource_Sharing_for_Machine_Learning_Workloads","abstract":"We present ease.ml, a declarative machine learning service platform we built to support more than ten research groups outside the computer science departments at ETH Zurich for their machine learning needs. With ease.ml, a user defines the high-level schema of a machine learning application and submits the task via a Web interface. The system automatically deals with the rest, such as model selection and data movement. In this paper, we describe the ease.ml architecture and focus on a novel technical problem introduced by ease.ml regarding resource allocation. We ask, as a \"service provider\" that manages a shared cluster of machines among all our users running machine learning workloads, what is the resource allocation strategy that maximizes the global satisfaction of all our users? Resource allocation is a critical yet subtle issue in this multi-tenant scenario, as we have to balance between efficiency and fairness. We first formalize the problem that we call multi-tenant model selection, aiming for minimizing the total regret of all users running automatic model selection tasks. We then develop a novel algorithm that combines multi-armed bandits with Bayesian optimization and prove a regret bound under the multi-tenant setting. Finally, we report our evaluation of ease.ml on synthetic data and on one service we are providing to our users, namely, image classification with deep neural networks. Our experimental evaluation results show that our proposed solution can be up to 9.8x faster in achieving the same global quality for all users as the two popular heuristics used by our users before ease.ml.","authors":["Tian Li","Jie Zhong","Ji Liu","Wentao Wu"],"meta":["August 2017Proceedings of the VLDB Endowment 11(5)","DOI:10.1145/3187009.3177737","Project: Machine Learning Systems"],"references":["318920618_Google_Vizier_A_Service_for_Black-Box_Optimization","317984194_Auto-WEKA_20_Automatic_model_selection_and_hyperparameter_optimization_in_WEKA","316849162_Interpreting_Black-Box_Classifiers_Using_Instance-Level_Visual_Explanations","316848943_An_Overreaction_to_the_Broken_Machine_Learning_Abstraction_The_easeml_Vision","310440907_ZipML_An_End-to-end_Bitwise_Framework_for_Dense_Generalized_Linear_Models","317072862_KeystoneML_Optimizing_Pipelines_for_Large-Scale_Advanced_Analytics","316848481_Flipper_A_Systematic_Approach_to_Debugging_Training_Sets","316848480_PALM_Machine_Learning_Explanations_For_Iterative_Debugging","312712412_Generative_Adversarial_Networks_recover_features_in_astrophysical_images_of_galaxies_beyond_the_deconvolution_limit","309620678_SystemML_declarative_machine_learning_on_spark"]}