{"id":"319279171_Recognition_of_feature_curves_on_3D_shapes_using_an_algebraic_approach_to_Hough_transforms","abstract":"Feature curves are largely adopted to highlight shape features, such as sharp lines, or to divide surfaces into meaningful segments, like convex or concave regions. Extracting these curves is not sufficient to convey prominent and meaningful information about a shape. We have first to separate the curves belonging to features from those caused by noise and then to select the lines, which describe non-trivial portions of a surface. The automatic detection of such features is crucial for the identification and/or annotation of relevant parts of a given shape. To do this, the Hough transform (HT) is a feature extraction technique widely used in image analysis, computer vision and digital image processing, while, for 3D shapes, the extraction of salient feature curves is still an open problem.Thanks to algebraic geometry concepts, the HT technique has been recently extended to include a vast class of algebraic curves, thus proving to be a competitive tool for yielding an explicit representation of the diverse feature lines equations. In the paper, for the first time we apply this novel extension of the HT technique to the realm of 3D shapes in order to identify and localize semantic features like patterns, decorations or anatomical details on 3D objects (both complete and fragments), even in the case of features partially damaged or incomplete. The method recognizes various features, possibly compound, and it selects the most suitable feature profiles among families of algebraic curves.","authors":["Maria Laura Torrente","Silvia Biasotti","Bianca Falcidieno"],"meta":["August 2017Pattern Recognition 73","DOI:10.1016/j.patcog.2017.08.008","Project: GRAVITATE"],"references":["305495810_Visualization_and_Extraction_of_Carvings_for_Heritage_Conservation","319770820_Histograms_of_Oriented_Gradients_for_Human_Detection","316655468_Perturbation_of_polynomials_and_applications_to_the_Hough_transform","316240097_Distinctive_Image_Features_from_Scale-Invariant_Keypoints","308846002_Approximate_3D_Partial_Symmetry_Detection_Using_Co-occurrence_Analysis","306125095_Mesh_Statistics_for_Robust_Curvature_Estimation","303597697_Adapting_Feature_Curve_Networks_to_a_Prescribed_Scale","295256647_A_Statistical_Approach_for_Extraction_of_Feature_Lines_from_Point_Clouds","292732187_Surface_partial_matching_application_to_archaeology","283496663_Recent_Trends_Applications_and_Perspectives_in_3D_Shape_Similarity_Assessment"]}