{"id":"319238692_Mobile_Data_Offloading_for_Green_Wireless_Networks","abstract":"The explosive growth in mobile data traffic has resulted in unprecedented energy consumption in cellular networks, and has also induced huge operational expenditure for mobile network operators. A promising solution to address this problem in 5G systems is to use complementary technologies, such as Wi-Fi, to offload the traffic originally targeted toward cellular networks. In this article, we discuss the recent advances in the technologies and economics of two types of mobile data offloading: operator-initiated offloading and user-initiated offloading. In operator- initiated offloading, the mobile operators offload cellular traffic to Wi-Fi networks, which may belong to the mobile operators, mobile operators' residential subscribers, and third party Wi-Fi owners. In user-initiated offloading, the users decide how to offload traffic with or without the mobile operators' coordination. We present a taxonomy of various data offloading models, discuss various technical and economic challenges, and summarize the algorithms and mechanisms that we design to address these challenges. Finally, we outline some open problems that require further investigation.","authors":["Haoran Yu","Man Hon Cheung","George Iosifidis","Lin Gao"],"meta":["August 2017IEEE Wireless Communications 24(4):31-37","DOI:10.1109/MWC.2017.1600323"],"references":["287853921_Power-Delay_Tradeoff_With_Predictive_Scheduling_in_Integrated_Cellular_and_Wi-Fi_Networks","262641258_Bargaining-Based_Mobile_Data_Offloading","262301982_What_will_5G_be","316329277_Security_in_Network_Coding","316320093_Wireless_Traffic_Steering_For_Green_Cellular_Networks","304919234_Deploying_carrier-grade_WiFi_offload_traffic_not_money","303778997_A_Mechanism_for_Mobile_Data_Offloading_to_Wireless_Mesh_Networks","291953688_Mobile_Data_Offloading_Through_Caching_in_Residential_80211_Wireless_Networks","273005388_DAWN_Delay-Aware_Wi-Fi_offloading_and_network_selection","270775547_A_Double-Auction_Mechanism_for_Mobile_Data-Offloading_Markets","269307716_Congestion-aware_network_selection_and_data_offloading","254462858_A_close_examination_of_performance_and_power_characteristics_of_4G_LTE_networks"]}