{"id":"319232643_Feature_selection_methodology_for_longitudinal_cone-beam_CT_radiomics","abstract":"Background: \nCone-beam CT (CBCT) scans are typically acquired daily for positioning verification of non-small cell lung cancer (NSCLC) patients. Quantitative information, derived using radiomics, can potentially contribute to (early) treatment adaptation. The aims of this study were to (1) describe and investigate a methodology for feature selection of a longitudinal radiomics approach (2) investigate which time-point during treatment is potentially useful for early treatment response assessment.\n\nMaterial and methods: \nFor 90 NSCLC patients CBCT scans of the first two fractions of treatment (considered as 'test-retest' scans) were analyzed, as well as weekly CBCT images. One hundred and sixteen radiomic features were extracted from the GTV of all scans and subsequently absolute and relative differences were calculated between weekly CBCT images and the CBCT of the first fraction. Test-retest scans were used to determine the smallest detectable change (C = 1.96 * SD) allowing for feature selection by choosing a minimum number of patients for which a feature should change more than 'C' to be considered as relevant. Analysis of which features change at which moment during treatment was used to investigate which time-point is potentially relevant to extract longitudinal radiomics information for early treatment response assessment.\n\nResults: \nA total of six absolute delta features changed for at least ten patients at week 2 of treatment and increased to 61 at week 3, 79 at week 4 and 85 at week 5. There was 93% overlap between features selected at week 3 and the other weeks.\n\nConclusions: \nThis study describes a feature selection methodology for longitudinal radiomics that is able to select reproducible delta radiomics features that are informative due to their change during treatment, which can potentially be used for treatment decisions concerning adaptive radiotherapy. Nonetheless, the prognostic value of the selected delta radiomic features should be investigated in future studies.","authors":["Janita Van Timmeren","Ralph T. H. Leijenaar","Wouter van Elmpt","Bart Reymen"],"meta":["August 2017Acta oncologica (Stockholm, Sweden) 56(11):1-7","DOI:10.1080/0284186X.2017.1350285"],"references":["316909463_Survival_prediction_of_non-small_cell_lung_cancer_patients_using_radiomics_analyses_of_cone-beam_CT_images","315922090_Delta-radiomics_features_for_the_prediction_of_patient_outcomes_in_non-small_cell_lung_cancer","315685874_Test-Retest_Data_for_Radiomics_Feature_Stability_Analysis_Generalizable_or_Study-Specific","299421541_Reproducibility_of_radiomics_for_deciphering_tumor_phenotype_with_imaging","287772957_Practical_Cone-Beam_Algorithm","282277981_Adaptive_radiotherapy_for_locally_advanced_non-small_cell_lung_cancer_can_we_predict_when_and_for_whom","312639643_Intrinsic_dependencies_of_CT_radiomic_features_on_voxel_size_and_number_of_gray_levels","306331514_The_Potential_of_Radiomic-Based_Phenotyping_in_Precision_Medicine_A_Review","300082648_Prognosis_and_predictors_of_site_of_first_metastasis_after_definitive_radiation_therapy_for_non-small_cell_lung_cancer","283766134_Can_radiomics_features_be_reproducibly_measured_from_CBCT_images_for_patients_with_non-small_cell_lung_cancer"]}