{"id":"319235738_Long-Short_Range_Context_Neural_Networks_for_Language_Modeling","abstract":"The goal of language modeling techniques is to capture the statistical and structural properties of natural languages from training corpora. This task typically involves the learning of short range dependencies, which generally model the syntactic properties of a language and/or long range dependencies, which are semantic in nature. We propose in this paper a new multi-span architecture, which separately models the short and long context information while it dynamically merges them to perform the language modeling task. This is done through a novel recurrent Long-Short Range Context (LSRC) network, which explicitly models the local (short) and global (long) context using two separate hidden states that evolve in time. This new architecture is an adaptation of the Long-Short Term Memory network (LSTM) to take into account the linguistic properties. Extensive experiments conducted on the Penn Treebank (PTB) and the Large Text Compression Benchmark (LTCB) corpus showed a significant reduction of the perplexity when compared to state-of-the-art language modeling techniques.","authors":["Youssef Oualil","Mittul Singh","Clayton Greenberg","Dietrich Klakow"],"meta":["November 2016","DOI:10.18653/v1/D16-1154","Conference: emnlp 2016"],"references":["283659606_The_Fixed-Size_Ordinally-Forgetting_Encoding_Method_for_Neural_Network_Language_Models","224246503_Extensions_of_recurrent_neural_network_language_model","221013094_A_Joint_Language_Model_With_Fine-grain_Syntactic_Tags","3333589_A_multispan_language_modeling_framework_for_large_vocabulary_speech_recognition","262346217_Measuring_the_influence_of_long_range_dependencies_with_neural_network_language_models","225818196_Neural_Probabilistic_Language_Models","220629805_Random_Forests_and_the_Data_Sparseness_Problem_in_Language_Modeling","3178307_Estimation_of_probabilities_from_sparse_data_for_the_language_model_component_of_a_speech_recognizer"]}