{"id":"319271551_A_Deep_Convolutional_Neural_Network_Model_to_Classify_Heartbeats","abstract":"The electrocardiogram (ECG) is a standard test used to monitor the activity of the heart. Many cardiac abnormalities will be manifested in the ECG including arrhythmia which is a general term that refers to an abnormal heart rhythm. The basis of arrhythmia diagnosis is the identification of normal versus abnormal individual heart beats, and their correct classification into different diagnoses, based on ECG morphology. Heartbeats can be sub-divided into five categories namely non-ectopic, supraventricular ectopic, ventricular ectopic, fusion, and unknown beats. It is challenging and time-consuming to distinguish these heartbeats on ECG as these signals are typically corrupted by noise. We developed a 9-layer deep convolutional neural network (CNN) to automatically identify 5 different categories of heartbeats in ECG signals. Our experiment was conducted in original and noise attenuated sets of ECG signals derived from a publicly available database. This set was artificially augmented to even out the number of instances the 5 classes of heartbeats and filtered to remove high-frequency noise. The CNN was trained using the augmented data and achieved an accuracy of 94.03% and 93.47% in the diagnostic classification of heartbeats in original and noise free ECGs, respectively. When the CNN was trained with highly imbalanced data (original dataset), the accuracy of the CNN reduced to 89.07%% and 89.3% in noisy and noise-free ECGs. When properly trained, the proposed CNN model can serve as a tool for screening of ECG to quickly identify different types and frequency of arrhythmic heartbeats.","authors":["U Rajendra Acharya","Shu Lih Oh","Yuki Hagiwara","Jen Hong Tan"],"meta":["August 2017Computers in Biology and Medicine 89","DOI:10.1016/j.compbiomed.2017.08.022"],"references":["317821702_Application_of_Deep_Convolutional_Neural_Network_for_Automated_Detection_of_Myocardial_Infarction_Using_ECG_Signals","315821873_Automated_Detection_of_Arrhythmias_Using_Different_Intervals_of_Tachycardia_ECG_Segments_with_Convolutional_Neural_Network","308916307_Automated_Characterization_and_Classification_of_Coronary_Artery_Disease_and_Myocardial_Infarction_by_Decomposition_of_ECG_Signals_A_Comparative_Study","305924292_ECG_Classification_Using_Wavelet_Packet_Entropy_and_Random_Forests","288060170_Recent_Advances_in_Convolutional_Neural_Networks","319770272_Delving_Deep_into_Rectifiers_Surpassing_Human-Level_Performance_on_ImageNet_Classification","316664323_Convolutional_neural_networks_for_time_series_classification","306204663_PhysioBank_PhysioToolkit_and_PhysioNet_Components_of_a_new_research_resource_for_complex_physiologic_signals","288931576_Deep_learning","285631741_Approximation_by_rational_functions"]}