{"id":"319246412_Numerical_Accuracy_of_Integral_Images_Computation_Algorithms","abstract":"In this paper we examine the issue of numerical accuracy of integral image com-\nputation algorithms. We analyze their five different floating-point variants both sequential\nand those well-suited for parallel realizations (e.g. graphics processing units, i.e. GPUs, im-\nplementations) in terms of their numerical accuracy. This experimental study shows that due\nto particular arrangements of successive arithmetical operations performed in the course of\nthe evaluation of integral images some parallel realizations of the analyzed algorithms can\nlead up to an almost five orders of magnitude relative numerical accuracy improvement over\ntheir classic sequential implementations. Such accuracy differences are then experimentally\nshowntobeofgreatsignificanceintermsofqualityoffinalresultsobtainedbyimageprocess-\ningmethodswhichutilizeintegralimages, whatispracticallydemonstratedontheexampleof\nthe image thresholding problem in which the calculation of integral images constitutes a part\nof the threshold calculation process. Based on the performed experimental study we conduct\na brief theoretical analysis of the observed behavior of the chosen five integral image com-\nputation algorithms and draw conclusions which can later be used in the formulation of\ngeneral guidelines for constructing their new, in particular parallel, realizations. In addition\nour study undoubtedly shows that not only can the parallel integral image computation algo-\nrithms be potentially significantly faster than their classic sequential variants but also they\nvastly outperform the latter in terms of numerical accuracy, what can be exploited in the\nfuture developement of high-quality, time-effective image processing methods.","authors":["Kamil Stokfiszewski","Dariusz Puchala"],"meta":["August 2017Image Processing, IET 12(1)","DOI:10.1049/iet-ipr.2017.0161"],"references":["287601328_Integral_Images_for_Block_Matching","220660094_Robust_Real-Time_Face_Detection","220494200_Adaptive_Thresholding_using_the_Integral_Image","220485031_A_New_Local_Adaptive_Thresholding_Technique_in_Binarization","47735229_Handbook_of_Floating-Point_Arithmetic","30995001_A_Linear_Time_Algorithm_for_Binary_Fingerprint_Image_Denoising_Using_Distance_Transform","3481082_Grey_level_reduction_for_segmentation_thresholding_and_binarisation_of_images_based_on_optimal_partitioning_on_an_interval","3046895_Analysis_of_Rounding_Methods_in_Floating-Point_Arithmetic","236221589_Intel_64_and_IA-32_Architectures_Software_Developer's_Manual","235453107_Parallel_Prefix_Computation","222646632_Pietikainen_M_Adaptive_Document_Image_Binarization_Pattern_Recognition_33_225-236","220694961_Introduction_to_Interval_Analysis","220688947_Accuracy_and_Stability_of_Numerical_Algorithms_SIAM_Philadelphia","220423320_Data_parallel_algorithms"]}