{"id":"319260872_The_Universal_Access_Handbook","abstract":"In recent years, the field of Universal Access has made significant progress in consolidating theoretical approaches, scientific methods and technologies, as well as in exploring new application domains. Increasingly, professionals in this rapidly maturing area require a comprehensive and multidisciplinary resource that addresses current principles, methods, and tools. Written by leading international authorities from academic, research, and industrial organizations and nonmarket institutions, The Universal Access Handbook covers the unfolding scientific, methodological, technological, and policy issues involved in the process of achieving universal access in the information society. In a collection of 61 chapters, the book discusses how to systematically apply universal design principles to information technologies. It explains the various dimensions of diversity in the technological platforms and contexts of use, including trends in mobile interaction and ambient intelligence environments. The implications of Universal Access on the development life cycle of interactive applications and services are unfolded, addressing user interface architectures and related components. Novel interaction methods and techniques for Universal Access are analyzed, and a variety of applications in diverse domains are discussed. The book reflects recent developments, consolidates present knowledge, and points towards new perspectives for the future. A quick glance through the contents demonstrates not only the breadth and depth of coverage but also the caliber of the contributions. An indispensible source of information for interdisciplinary and cross-thematic study, the book provides a baseline for further in-depth studies, as well as an important educational tool in an increasingly globalized research and development environment.","authors":["Constantine Stephanidis"],"meta":["January 2009","Publisher: Taylor & FrancisISBN: 978-0-8058-6280-5","Project: Human-Computer Interaction"],"references":[]}