{"id":"319263373_THE_ADLER-BELL-JACKIW_ANOMALY_AND_WEYL_FERMIONS_IN_A_CRYSTAL","abstract":"The Adler-BeU-Jackiw (ABJ) axial anomaly is derived from the physical point of view as the production of Weyl particles and it is used to show the absence of the net production of particles for lattice regularized chirally invariant theories with locality. An analogy or a simulation is pointed out between the Weyl fermion theory and gapless semiconductors where two energy bands have pointlike degeneracies. For such materials, in the presence of parallel electric and strong magnetic fields, there exists an effect similar to the ABJ anomaly that is the movement of the electrons in the energy-momentum space from the neighborhood of one degeneracy point to another one. The longitudinal magneto-conduction becomes extremely strong. l. It is the purpose of the present article to demonstrate a similarity between the fermion system of lattice gauge theories and the electron system of crystals. We then point out that there exists an effect analogous to the mechanism of the Adler-Bell-Jackiw (ABJ) axial anomaly [1 ] in solid state physics. We firstly derive the ABJ anomaly [2] in a physically intuitive way, which was also given independently by Lipatov, Ltischer, Peskin [3] and Susskind [4], in order to apply it to solid state physics. The mechanism of the ABJ anomaly is understood as the production of Weyl fermions in the presence of external electric and magnetic fields. Using this derivation # 1 we shall demonstrate that in any lattice theory of chirally invariant fermions with locality there is an equal number of production and annihilation of Weyl fermions. Thus there is no net production so that the axial charges are conserved. It is based on a theorem 1 Supported by a grant of the US department of energy under Contract No. DE-AC02-76ER03130.A011-Task. A. 4:1 The derivation was applied to the Wilson lattice fermions with a hopping term in order to investigate the anomaly in ref. [51-[6] proved by the present authors that in any lattice regularized version with locality there appears necessarily an equal number of right-handed (RH) and left-handed (LH) species of Weyl fermions. It should be stressed that this theorem does not hold for the non-local theories by Drell et al. ,2 The basic similarity between lattice fermions and electrons in crystals is that in both theories there is only the lattice translational invariance. Then the momentum is conserved modulo a multiple of the unit length of the reciprocal lattice so that the momentum space becomes a Brillouin zone which is topological-ly equivalent to the hypertorus S 1 × S 1 × S 1. The electrons of the crystal are described by a one-component (nonrelativistic) Schr6dinger equation, but the energy eigenvalues form bands. As explained in section 4 using a localized function we can write the electron theory as a multicomponent lattice fermion theory with a matrix hamiltonian. We will be interested in the situation where two energy bands of the electrons make contact at points in the energy-momentum dispersion law space which ,2 As for the anomaly on this model see ref. [8]. 0.031-9163/83/0000-0000/$ 03.00","authors":["H B Nielsen","Masao Ninomiya"],"meta":["November 1983Physics Letters B 130B(6):389-396","Projects: Lattice gauge theory and condensed matterLattice Fermion Theory and Quantum Field Theory"],"references":["36963819_Quantum_Theory_of_the_Solid_State","31997175_Narrow_gap_semiconductors"]}