{"id":"319305968_Privacy_Impact_Assessment","abstract":"Virtually all organisations collect, use, process and share personal data from their employees, customers and/or citizens. In doing so, they may be exposing themselves to risks, from threats and vulnerabilities, of that data being breached or compromised by negligent or wayward employees, hackers, the police, intelligence agencies or third-party service providers. A recent study by the Ponemon Institute found that 70 per cent of organisations surveyed had suffered a data breach in the previous year. Privacy impact assessment is a tool, a process, a methodology to identify, assess, mitigate or avoid privacy risks and, in collaboration with stakeholders, to identify solutions. Contributors to this book - privacy commissioners, academics, consultants, practitioners, industry representatives - are among the world’s leading PIA experts. They share their experience and offer their insights to the reader in the policy and practice of PIA in Australia, Canada, New Zealand, the United Kingdom, the United States and elsewhere. This book, the first such on privacy impact assessment, will be of interest to any organisation that collects or uses personal data and, in particular, to regulators, policy-makers, privacy professionals, including privacy, security and information officials, consultants, system architects, engineers and integrators, compliance lawyers and marketing professionals. In his Foreword, surveillance studies guru Gary Marx says, '‘This state-of-the-art book describes the most comprehensive tool yet available for policy-makers to evaluate new personal data information technologies before they are introduced.'’ This book could save your organisation many thousands or even millions of euros (or dollars) and the damage to your organisation’s reputation and to the trust of employees, customers or citizens if it suffers a data breach that could have been avoided if only it had performed a privacy impact assessment before deploying a new technology, product, service or other initiative involving personal data. © Springer Science+Business Media B.V. 2012, First softcover printing 2012.","authors":["David Wright","Paul De Hert"],"meta":["January 2012","DOI:10.1007/978-94-007-2543-0","ISBN: 978-94-007-5402-7"],"references":[]}