{"id":"319328130_An_Exploration_of_the_Role_of_Visual_Programming_Tools_in_the_Development_of_Young_Children's_Computational_Thinking","abstract":"Programming tools are being used in education to teach computer science to children as young as 5 years old. This research aims to explore young children's approaches to programming in two tools with contrasting programming interfaces, ScratchJr and Lightbot, and considers the impact of programming approaches on developing computational thinking. A study was conducted using two versions of a Lightbot-style game, either using a ScratchJr-like or Lightbot style programming interface. A test of non-verbal reasoning was used to perform a matched assignment of 40, 6 and 7-year-olds to the two conditions. Each child then played their version of the game for 30 minutes. The results showed that both groups had similar overall performance, but as expected, the children using the ScratchJr-like interface performed more program manipulation or 'tinkering'. The most interesting finding was that non-verbal reasoning was a predictor of program manipulation, but only for the ScratchJr-like condition. Children approached the ScratchJr-like program differently depending on prior ability. More research is required to establish how children use programming tools and how these approaches influence computational thinking.","authors":["Simon Rose","Jacob Habgood","Tim Jay"],"meta":["August 2017Electronic Journal of e-Learning 15(4):297-309","Projects: PhD StudentsDeveloping Children's Computational Thinking using Programming Games"],"references":["309916650_Computational_thinking_tools","308880760_What_Computational_Thinking_Is","305140678_A_K-6_Computational_Thinking_Curriculum_Framework_Implications_for_Teacher_Knowledge","303943002_A_Framework_for_Computational_Thinking_Based_on_a_Systematic_Research_Review","303668799_Computational_Thinking_for_All_Pedagogical_Approaches_to_Embedding_21st_Century_Problem_Solving_in_K-12_Classrooms","311314199_A_review_of_models_for_introducing_computational_thinking_computer_science_and_computing_in_K-12_education","303789723_Exploring_media_literacy_and_computational_thinking_A_game_maker_curriculum_study","298972479_Learning_Computer_Science_Concepts_with_Scratch","297719113_Visual_programming_languages_integrated_across_the_curriculum_in_elementary_school_A_two_year_case_study_using_Scratch_in_five_schools","286873961_The_TangibleK_robotics_program_Applied_computational_thinking_for_young_children"]}