{"id":"319391831_Instantons_in_Self-Organizing_Logic_Gates","abstract":"Self-organizing logic is a recently-suggested framework that allows the solution of Boolean truth tables \"in reverse,\" i.e., it is able to satisfy the logical proposition of gates regardless to which terminal(s) the truth value is assigned (\"terminal-agnostic logic\"). It can be realized if time non-locality (memory) is present. A practical realization of self-organizing logic gates (SOLGs) can be done by combining circuit elements with and without memory. By employing one such realization, we show, numerically, that SOLGs exploit elementary instantons to reach equilibrium points. Instantons are classical trajectories of the non-linear equations of motion describing SOLGs, that connect topologically distinct critical points in the phase space. By linear analysis at those points, we show that these instantons connect the initial state of the dynamics, with at least one unstable direction, directly to the final fixed point. Our work provides a physical understanding of, and can serve as an inspiration for, new models of bi-directional logic gates that are emerging as important tools in physics-inspired, unconventional computing.","authors":["Sean Rhett-Burke Bearden","Haik Manukian","Fabio Lorenzo Traversa","Massimiliano Di Ventra"],"meta":["August 2017Physical Review Applied 9(3)","DOI:10.1103/PhysRevApplied.9.034029","Project: Memcomputing"],"references":["320312900_Absence_of_periodic_orbits_in_digital_memcomputing_machines_with_solutions","318592609_Stochastic_p_-Bits_for_Invertible_Logic","287249984_Polynomial-time_solution_of_prime_factorization_and_NP-hard_problems_with_digital_memcomputing_machines","262071478_Universal_Memcomputing_Machines","318331532_Computational_paradigms_using_oscillatory_networks_based_on_state-transition_devices","316799409_Visual_Geometry_and_Topology","314361055_Absence_of_chaos_in_Digital_Memcomputing_Machines_with_solutions","313726720_Polynomial-time_solution_of_prime_factorization_and_NP-complete_problems_with_digital_memcomputing_machines","311612629_Memcomputing_Numerical_Inversion_With_Self-Organizing_Logic_Gates","308025865_Topological_Field_Theory_and_Computing_with_Instantons"]}