{"id":"319346284_Energy_and_activity_monitoring_over_wireless_sensor_networks","abstract":"Wireless sensor networks are one the most challenging fields in computer science and networking in particular with the exposition of Internet of things. The energy management is a crucial issue on wireless sensor network since it has a real influence on then network lifetime. Since such networks are used for many sensitive applications, they need to guarantee some quality of service requirements as continuous connectivity or continuous monitoring or balanced energy consumption over all the network nodes. In this paper, we suggest an algorithm which monitors the energy consumption of all nodes (in relation with their main activity: communication). We present an activity model of the network and evaluate how the remaining energy behaves. Our main objective is to predict (after a learning step) the energy consumption of all the nodes. Then, various techniques could be used to find a cure to such troubles (wake up sleeping neighbor nodes, increasing radio ranges of some neighbor nodes, etc). Simulations have shown interesting results, and large-scale evaluation has to be undertaken to confirm the early results. Copyright","authors":["Frédéric Blanchard","Hacène Fouchal","Michel Herbin"],"meta":["August 2017Concurrency and Computation Practice and Experience 29(4)","DOI:10.1002/cpe.4260"],"references":["279213363_Linking_Data_According_to_Their_Degree_of_Representativeness_DoR","258145390_MAC_Protocols_Used_by_Wireless_Sensor_Networks_and_a_General_Method_of_Performance_Evaluation","252157377_ALARM-NET_Wireless_Sensor_Networks_for_Assisted-Living_and_Residential_Monitoring","236172768_Classification_and_comparison_of_routing_protocols_in_wireless_sensor_networks","235987947_Impact_of_Routing_Protocols_on_Packet_Retransmission_over_Wireless_Networks","310670788_Ad-hoc_on-demand_distance_vector_AODV_routing","308827615_Centralized_energy_monitoring_over_wireless_sensor_networks","306311675_AN_ENERGY_EFFICIENT_FITNESS_BASED_ROUTING_PROTOCOL_IN_WIRELESS_SENSOR_NETWORKS","289427964_Slot_scheduling_for_wireless_sensor_networks","284602927_Ad_hoc_on-demand_distance_vector_AODV_routing"]}