{"id":"319325770_A_Framework_for_Using_Hypothesis-Driven_Approaches_to_Support_Data-Driven_Learning_Analytics_in_Measuring_Computational_Thinking_in_Block-Based_Programming_Environments","abstract":"Systematic endeavors to take computer science (CS) and computational thinking (CT) to scale in middle and high school classrooms are underway with curricula that emphasize the enactment of authentic CT skills, especially in the context of programming in block-based programming environments. There is, therefore, a growing need to measure students’ learning of CT in the context of programming and also support all learners through this process of learning computational problem solving. The goal of this research is to explore hypothesis-driven approaches that can be combined with data-driven ones to better interpret student actions and processes in log data captured from block-based programming environments with the goal of measuring and assessing students’ CT skills. Informed by past literature and based on our empirical work examining a dataset from the use of the Fairy Assessment in the Alice programming environment in middle schools, we present a framework that formalizes a process where a hypothesis-driven approach informed by Evidence-Centered Design effectively complements data-driven learning analytics in interpreting students’ programming process and assessing CT in block-based programming environments. We apply the framework to the design of Alice tasks for high school CS to be used for measuring CT during programming.","authors":["Shuchi Grover","Satabdi Basu","Marie Ann Bienkowski","Michael Eagle"],"meta":["August 2017ACM Transactions on Computing Education 17(3):1-25","DOI:10.1145/3105910"],"references":["318155591_Identifying_Productive_Inquiry_in_Virtual_Labs_Using_Sequence_Mining","317644528_Assessment_Design_Patterns_for_Computational_Thinking_Practices_in_Secondary_Computer_Science_A_First_Look","316628053_Educational_data_mining_and_learning_analytics","316442298_Assessing_Algorithmic_and_Computational_Thinking_in_K-12_Lessons_from_a_Middle_School_Classroom","312671713_Learner_modeling_for_adaptive_scaffolding_in_a_Computational_Thinking-based_science_learning_environment","311488296_Combining_Big_Data_and_Thick_Data_Analyses_for_Understanding_Youth_Learning_Trajectories_in_a_Summer_Coding_Camp","309917255_Skill_progression_in_MIT_app_inventor","301429274_Programming_in_the_wild_Patterns_of_Computational_Participation_in_the_Scratch_Online_Social_Networking_Forum","324373353_Mindstorms_Children_Computers_and_Powerful_Ideas","299577207_Assessing_Problem-Solving_Process_At_Scale"]}