{"id":"319370684_Productivity_trends_and_collaboration_patterns_A_diachronic_study_in_the_eating_disorders_field","abstract":"Objective\nThe present study seeks to extend previous bibliometric studies on eating disorders (EDs) by including a time-dependent analysis of the growth and evolution of multi-author collaborations and their correlation with ED publication trends from 1980 to 2014 (35 years).\n\nMethods\nUsing standardized practices, we searched Web of Science (WoS) Core Collection (WoSCC) (indexes: Science Citation Index-Expanded [SCIE], & Social Science Citation Index [SSCI]) and Scopus (areas: Health Sciences, Life Sciences, & Social Sciences and Humanities) to identify a large sample of articles related to EDs. We then submitted our sample of articles to bibliometric and graph theory analyses to identify co-authorship and social network patterns.\n\nResults\nWe present a large number of detailed findings, including a clear pattern of scientific growth measured as number of publications per five-year period or quinquennium (Q), a tremendous increase in the number of authors attracted by the ED subject, and a very high and steady growth in collaborative work.\n\nConclusions\nWe inferred that the noted publication growth was likely driven by the noted increase in the number of new authors per Q. Social network analyses suggested that collaborations within ED follow patters of interaction that are similar to well established and recognized disciplines, as indicated by the presence of a “giant cluster”, high cluster density, and the replication of the “small world” phenomenon—the principle that we are all linked by short chains of acquaintances.","authors":["Juan Carlos Valderrama-Zurián","Remedios Aguilar","Antonio Cepeda-Benito","David Melero-Fuentes"],"meta":["August 2017PLoS ONE 12(8):e0182760","DOI:10.1371/journal.pone.0182760","Projects: Research Evaluation and Bibliometricsbibliographic studies"],"references":["286637901_Evolution_of_Cooperation_Patterns_in_Psoriasis_Research_Co-Authorship_Network_Analysis_of_Papers_in_Medline_1942-2013","282048360_The_rise_of_eating_disorders_in_Asia_A_review","346117808_Comparison_of_DSM-III_and_DSM-III-R_bulimia_nervosa_classifications_for_psychopathology_and_other_eating_behaviors","313360018_Studies_in_Scientometrics_I_Transience_and_Continuance_in_Scientific_Authorship","312970191_Scientific_collaboration_networks","299164220_Collaboration_networks_in_science","285363657_The_first_cut_is_the_deepest_repeated_interactions_of_coauthorship_and_academic_productivity_in_Nobel_laurate_teams","281263059_Evolution_of_the_social_network_of_scientific_collaboration","278967837_A_systematic_analysis_of_duplicate_records_in_Scopus","274415382_Is_Anorexia_Nervosa_a_Culture-Bound_Syndrome"]}