{"id":"319322088_Stereotype_Threat_Among_Girls_Differences_by_Gender_Identity_and_Math_Education_Context","abstract":"Effects of stereotype threat on math performance have been well-documented among college women; however, the prevalence among adolescent girls is less well-known. Further, the moderating role of gender identity and effects of stereotype threat on high achieving girls in math is unknown. This study tested the effects of a stereotype threat condition (vs. control group) among middle school girls in standard and honors math classes and examined gender identity as a moderator. Students (N = 498) completed pre- and post-questionnaires and a math test as part of a stereotype threat experiment. Gender identity moderated effects of stereotype threat on math discounting, disengagement, attitudes, and performance, but whether gender identity was a protective or risk factor differed by math education context (honors math and standard math classes). Gender identity was protective for girls in honors math for attitudes, discounting, and disengagement but was a risk factor for math performance. Gender identity was a risk factor for disengagement and math attitudes among girls in standard math classes, but was a buffer for math performance. Results suggest the need to examine protective and risk properties of gender identity importance for adolescent girls and the need to examine stereotype threat within educational contexts. Stereotype threat can be reduced through interventions; thus, educators and practitioners can collaborate with social scientists to implement widespread interventions in K–12 schools.","authors":["Bettina Casad","Patricia Hale","Faye Linda Wachs"],"meta":["August 2017Psychology of Women Quarterly 41(4)","DOI:10.1177/0361684317711412","Project: K-16 Education"],"references":["291333561_Addressing_Stereotype_Threat_is_Critical_to_Diversity_and_Inclusion_in_Organizational_Psychology","289826564_But_I'm_Not_Good_at_Math_The_Changing_Salience_of_Mathematical_Self-Concept_in_Shaping_Women's_and_Men's_STEM_Aspirations","343754768_The_Nature_Effects_and_Relief_of_Mathematics_Anxiety","313143627_A_collective_self-esteem_scale_Self-evaluation_of_one's_social_identity","312411082_Disparities_in_STEM_employment_by_sex_race_and_Hispanic_origin","309050814_Gender_development","303065535_Harvesting_implicit_group_attitudes_and_beliefs_from_a_demonstration_website","288853950_Shifts_in_women's_quantitative_performance_in_response_to_implicit_sociocultural_identification","288139024_How_Do_Students'_Mastery_and_Performance_Goals_Relate_to_Math_Anxiety","286999343_Concerns_About_Generalizing_Stereotype_Threat_Research_Findings_to_Operational_High-stakes_Testing"]}