{"id":"319322356_Perspective_analysis_of_telecommunication_fraud_detection_using_data_stream_analytics_and_neural_network_classification_based_data_mining","abstract":"With the growing advancements in technology, the lives of the people have become easier and convenient, but at the same time it also mushrooms sophisticated practices through which the fraudsters can infiltrate an organization. Telecommunication industry, being one of the major sectors in the world, is also infiltrated by frauds. Telecommunication fraud is a combination of variety of illegal activities like unauthorized and illegitimate access, subscription identity theft and international revenue share fraud etc. Frauds have proven to be detrimental to the prosperity of a company and impacts customer relations and shareholders. This paper presents the implementation details for detecting telecommunication fraud using Data Stream Analytics and Neural Network classification based Data Mining. For detection using Data Stream Analytics, Event Hub and Stream Analytics components of Microsoft Azure have been used whereas for detection using Data Mining Neural Network Pattern Recognition tool as well as a self-coded algorithm in Matlab has been used. Based on the results, the accuracy of both the techniques have been compared and the situations for selection of a suitable technique based on the user requirements and the flow of data has been narrowed down. The findings can elucidate upon other cloud analytics systems and provide a basis for big data analytics and mining.","authors":["Vanita Jain"],"meta":["August 2017International Journal of Information Technology 9(3):1-8","DOI:10.1007/s41870-017-0036-5"],"references":["283212652_Real-Time_Big_Data_Analytics_Applications_and_Challenges","261389007_Data_stream_analytics_and_mining_in_the_cloud","228345401_Fraud_Detection_in_Telecommunications_History_and_Lessons_Learned","225181158_Outlier_Detection_Using_Replicator_Neural_Networks","220416221_Mining_Data_Streams_A_Review","46887451_A_Comprehensive_Survey_of_Data_Mining-based_Fraud_Detection_Research","2377656_Fraud_Detection_In_Communications_Networks_Using_Neural_And_Probabilistic_Methods","303205849_Detecting_telecommunication_fraud_using_NNs_through_data_mining","263121812_Brief_Application_Description_Visual_Data_Mining_Recognizing_Telephone_Calling_Fraud","222086021_A_data_mining_framework_for_detecting_subscription_fraud_in_telecommunication","221601259_eventHub_An_Event-Driven_Information_Hub_for_Mobile_Devices"]}