{"id":"319363721_Estudio_cienciometrico_de_la_actividad_cientifica_de_Cuba_en_las_Ciencias_Naturales_e_Ingenieria_y_Matematica-Ciencias_de_la_Computacion","abstract":"La cienciometría es un área disciplinar que permite evaluar la actividad científica de un país. En su haber se pueden definir políticas científicas a nivel gubernamental para determinar nuevas líneas de investigación. El objetivo de este estudio fue visualizar el desarrollo de la actividad científica cubana en las áreas del conocimiento de Matemática-Ciencias de la Computacióny Ciencias Naturales e Ingeniería. En Cuba se invirtió aproximadamente el 2.7 % del PIB en la actividad de I+D y el 63 % del PIB en la educación superior según datos del Banco Mundial. Como resultado de este trabajo se determinó que las temáticas de Ciencias Químicas, Ingenierías y Astronomía-Astrofísica son las más destacadas en cuanto a producción, consumoe impacto científico. Estos resultados se debieron en gran medida a los lazos de colaboración internacional, principalmente con países como España y México. Este estudio nos indica que Cuba, que es uno de los países en vías de desarrollo de la región, prioriza buena parte de sus ingresos económicos al desarrollo de las ciencias naturales.Scientometrics provides tools for evaluating scientific activity of a nation, thereby aiding policy makers in setting policies aimed at determining new lines of research. The aim of this study is gain a clearer picture of Cuban scientific activity in the areas of Mathematics, Computer Science, Natural Sciences and Engineering. Cuba invests approximately 2.7% of GDP inR&D and 63% of GDP in higher education according to the World Bank. Our study shows that subject areas of Chemistry, Engineering and Astronomy-Astrophysics are the most important in terms of scientific output, consumption and scientific impact. These results are due mostly to international cooperation, mainly with Spain and Mexico. This study indicates that Cuba, adeveloping countries of the region, prioritizes much of its GDP to the development of natural sciences.","authors":["Darlenis Vallejera","Rubén Sánchez Perdomo","Marinelsy Rosario Sierra","Yaniris Rodriguez-Sanchez"],"meta":["June 2017Investigación Bibliotecológica: Índice Acumulativo 31(72):113","DOI:10.22201/iibi.0187358xp.2017.72.57826","Project: Visibilidad de la actividad científica cubana en bases de datos internacionales"],"references":["260765673_Estudio_bibliometrico_de_la_citogenetica_humana_en_el_periodo_1999-2008","250929251_Intersectoral_relationships_scientific_output_and_national_policies_for_research_development_a_case_study_on_Cuba_2003-2007_Relaciones_intersectoriales_produccion_cientifica_y_politicas_nacionales_par","237027091_Produccion_cientifica_cubana_sobre_Dengue_en_el_contexto_internacional_Scopus_1981-2006","224930434_Produccion_Cientifica_Cubana_sobre_Nanociencias","220065935_Assessing_the_varying_level_of_impact_measurement_accuracy_as_a_function_of_the_citation_window_length","28808741_Identificacion_de_frentes_de_investigacion_sobre_esteroides_en_la_produccion_cientifica_cubana_en_Scopus_1996-2006","28243766_Produccion_cientifica_mundial_sobre_biodiesel","28237195_Indicadores_basados_en_analisis_de_citas_para_la_caracterizacion_de_las_neurociencias_cubanas","28237129_La_evaluacion_de_la_investigacion_cientifica_una_aproximacion_teorica_desde_la_Cienciometria","242741778_DIRECTRICES_DE_LA_OCDE_PARA_LA_OBTENCION_DE_INDICADORES_DE_CIENCIA_Y_TECNOLOGIA"]}