{"id":"319376674_Design_of_Distributed_Protograph_LDPC_Codes_for_Multi-Relay_Coded-Cooperative_Networks","abstract":"This paper studies the protograph low-density parity-check (LDPC) coded cooperation (CC) schemes for twohop multi-relay systems with L relays over Nakagami-m quasistatic fading (QSF) channels. We propose two CC schemes, namely scheme I and scheme II, with different maximum code rates to satisfy different transmission requirements. We further design a family of distributed rate-compatible root-protograph (RCRP) codes to achieve full diversity in CC-based multi-relay QSF channels. In particular, our RCRP codes with L + 1 subcodewords can realize full diversity in scheme I, and our RCRP codes with two sub-codewords can achieve full diversity in scheme II with a maximum-ratio combiner (MRC). In addition, we estimate the asymptotic word error rate (WER) and bit error rate (BER) of our RCRP codes using a generalized protograph extrinsic information transfer (PEXIT) algorithm, which is able to characterize the error performance of finite-length codewords accurately. Analysis and simulation show that our RCRP codes can achieve outage-limit-approaching performance in both multirelay CC architectures. This makes the RCRP coding framework extremely attractive for multi-relay cooperative communication applications with slow-varying fading.","authors":["Yi Fang","Soung Chang Liew","Taotao Wang"],"meta":["August 2017IEEE Transactions on Wireless Communications PP(99):1-1","DOI:10.1109/TWC.2017.2743699"],"references":["301852689_Bilayer_Protograph_Codes_for_Half-Duplex_Relay_Channels","294108489_5G-Enabled_Tactile_Internet","283716726_Self-Estimation_of_Path-Loss_Exponent_in_Wireless_Networks_and_Applications","283119473_Low-Density_Lattice_Coded_Relaying_With_Joint_Iterative_Decoding","282329891_Spatially-Coupled_LDPC_Coding_in_Cooperative_Wireless_Networks","279229412_A_Soft_Network_Coded_Multilevel_Forwarding_Scheme_for_Multiple_Access_Relay_Systems","277006492_A_Soft_Decode-Compress-Forward_Relaying_Scheme_for_Cooperative_Wireless_Networks","275243802_Rate-Compatible_Root-Protograph_LDPC_Codes_for_Quasi-Static_Fading_Relay_Channels","311396077_User_cooperation_diversity_part_i_System_description","277947718_A_Survey_on_Protograph_LDPC_Codes_and_Their_Applications"]}