{"id":"319349947_Non-deterministic_algebraization_of_logics_by_swap_structures","abstract":"Multialgebras (or hyperalgebras, or non-deterministic algebras) have been very much studied in Mathematics and in Computer Science. In 2016 Carnielli and Coniglio introduced a class of multialgebras called swap structures, as a semantic framework for dealing with several logics of formal inconsistency (or LFIs) which cannot be semantically characterized by a single finite matrix. In particular, these LFIs are not algebraizable by the standard tools of abstract algebraic logic. In this paper, the first steps towards a theory of non-deterministic algebraization of logics by swap structures are given. Specifically, a formal study of swap structures for LFIs is developed, by adapting concepts of universal algebra to multialgebras in a suitable way. A decomposition theorem similar to Birkhoff's representation theorem is obtained for each class of swap structures. Moreover, when applied to the 3-valued algebraizable logic J3 the usual class of algebraic models is recovered, and the swap structures semantics became twist-structures semantics (as introduced by Fidel-Vakarelov). This fact, together with the existence of a functor from the category of Boolean algebras to the category of swap structures for each LFI, which is closely connected with Kalman's functor, suggests that swap structures can be considered as non-deterministic twist structures, opening so interesting possibilities for dealing with non-algebraizable logics by means of multialgebraic semantics.","authors":["Marcelo E. Coniglio","Aldo Figallo Orellano","Ana Claudia Golzio"],"meta":["August 2017Logic Journal of IGPL 28(5)","DOI:10.1093/jigpal/jzy072","Project: Semantics of non-deterministic character"],"references":["318508279_Non-deterministic_matrices_theory_and_applications_to_algebraic_semantics","309157641_Towards_an_hyperalgebraic_theory_of_non-algebraizable_logics","301515897_Abstract_Algebraic_Logic_-_An_Introductory_Textbook","292970536_Non-deterministic_algebras_and_algebraization_of_logics","274474178_Modal_twist-structures_over_residuated_lattices","309158378_Paraconsistent_Logic_Consistency_Contradiction_and_Negation","302221325_Algebras_de_Nelson_Semi-Simples_Abstract","267661462_Applications_of_Hyperstructure_Theory","267067978_An_algebraic_study_of_a_propositional_system_of_Nelson","266514573_Sur_un_probleme_de_Jaskowski"]}