{"id":"319391426_An_ensemble_approach_to_multi-view_multi-instance_learning","abstract":"Multi-view learning combines data from multiple heterogeneous sources and employs their complementary information to build more accurate models. Multi-instance learning represents examples as labeled bags containing sets of instances. Data fusion of different multi-instance views cannot be simply concatenated into a single set of features due to their different cardinality and feature space. This paper proposes an ensemble approach that combines view learners and pursues consensus among the weighted class predictions to take advantage of the complementary information from multiple views. Importantly , the ensemble must deal with the different feature spaces coming from each of the views, while data for the bags may be partially represented in the views. The experimental study evaluates and compares the performance of the proposal with 20 traditional, ensemble-based, and multi-view algorithms on a set of 15 multi-instance datasets. Experimental results indicate the better performance of ensemble methods than single-classifiers, but especially the best results of the multi-view multi-instance approaches. Results are validated through multiple non-parametric statistical analysis.","authors":["Alberto Cano"],"meta":["November 2017Knowledge-Based Systems 136:46-57","DOI:10.1016/j.knosys.2017.08.022","Project: Data Mining with More Flexible Representations"],"references":["313484584_On_combining_classifiers","308343670_A_multi-view_model_for_visual_tracking_via_correlation_filters","305954583_An_ensemble-based_approach_for_multi-view_multi-label_classification","319403291_Multi-view_Laplacian_twin_support_vector_machines","317582331_Incremental_fuzzy_cluster_ensemble_learning_based_on_rough_set_theory","313677125_Multi-View_Multi-Instance_Learning_Based_on_Joint_Sparse_Representation_and_Multi-View_Dictionary_Learning","313325995_Ensemble_learning_for_data_stream_analysis_A_survey","311864343_Dynamic_Financial_Distress_Prediction_with_Concept_Drift_Based_on_Time_Weighting_Combined_with_Adaboost_Support_Vector_Machine_Ensemble","308922240_Supervised_aggregated_feature_learning_for_multiple_instance_classification","307612738_Diversified_dictionaries_for_multi-instance_learning"]}