{"id":"319301897_Grimes'_Fairy_Tales_A_1960s_Story_Generator","abstract":"We provide the first extensive account of an unknown story generator that was developed by linguist Joseph E. Grimes in the early 1960s. A pioneering system, it was the first to take a grammar-based approach and the first to operationalize Propp's famous model. This is the opening paper in a series that will aim to reformulate the prevailing history of story generation in light of new findings we have made pertaining to several forgotten early projects. Our study here has been made possible by personal communication with the system's creator, Grimes, and excavation of three obscure contemporaneous sources. While the accepted knowledge in our field is that the earliest story generator was Sheldon Klein's automatic novel writer, first reported in 1971, we show that Grimes's system and two others preceded it. In doing this, we reveal a new earliest known system. With this paper, and follow-ups to it that are in progress, we aim to provide a new account of the area of story generation that lends our community insight as to where it came from and where it should go next. We hope others will join us in this mission.","authors":["James Ryan"],"meta":["November 2017Lecture Notes in Computer Science","DOI:10.1007/978-3-319-71027-3_8","Conference: 10th International Conference on Interactive Digital StorytellingAt: Funchal, Madeira, Portugal"],"references":["319301965_Translation_of_La_Simulacion","300137911_Tracery_An_Author-Focused_Generative_Text_Tool","299401833_A_Survey_on_Story_Generation_Techniques_for_Authoring_Computational_Narratives","289890098_Propp's_morphology_of_the_folk_tale_as_a_grammar_for_generation","329655321_Introduction_The_Evolution_of_Interactive_Digital_Narrative_Theory","311870187_On_Throwing_Out_the_Baby_with_the_Bathwater_A_Reply_to_Black_and_Wilensky's_Evaluation_of_Story_Grammars","309476633_Narrative_Structures_in_IDN_Authoring_and_Analysis","289899222_Humanities_computing_as_digital_humanities","280905133_Une_machine_a_raconter_des_histoires_Propp_et_les_software_studies","274651211_Comparison_of_Themes_in_Folktales_by_the_General_Inquirer_System"]}