{"id":"319343360_Resource_Planning_for_the_Installation_of_Industrial_Product_Service_Systems","abstract":"In product-oriented Industrial Product Service Systems (IPSSs) the customers benefit from the combination of a product which offers some functionalities and a set of services. IPSS supports the provision of services which can be offered by the product manufacturer. The services can offer a wide range of functionalities that can range from ensuring the product’s original functionality to augmenting the original functionality of the product. The shifting of a company to IPSS poses many challenges such as the changing of the company’s business model. One of the most important challenges for the establishment of IPSS is the appropriate planning of the resources for production, deployment, and installation into the customers’ site. However, companies that provide IPSS solutions are lacking the proper tools for resources’ planning in a dynamic environment. In this work, a multi-criteria resource planning method and tool for optimizing the production, delivery, and installation of IPSS is presented. The proposed solution generates alternative IPSS’s production and installation plans and evaluates them on performance measures for production and installation such as time and cost. Moreover, through the integration of the planning tool with the IPSS design phase, information for generating the Bill of Process and Materials is presented. The planning tool has been designed using the Software-as-a-Service (SaaS) approach and has been applied and validated in a pilot case from the laser cutting industry.","authors":["Kosmas Alexopoulos","Spyros Koukas","Nikoletta Boli","Dimitris Mourtzis"],"meta":["August 2017IFIP Advances in Information and Communication Technology","DOI:10.1007/978-3-319-66926-7_24","Conference: IFIP International Conference on Advances in Production Management Systems","Project: ICP4Life (Horizon 2020)"],"references":["314271357_A_Lean_PSS_design_and_evaluation_framework_supported_by_KPI_monitoring_and_context_sensitivity_tools","314193426_An_Integrated_Collaborative_Platform_for_managing_Product-service_Across_their_Life_Cycle","303956464_PSS_Design_Considering_Feedback_from_the_Entire_Product-service_Lifecycle_and_Social_Media","281115948_Performance_Indicators_for_the_Evaluation_of_Product-Service_Systems_Design_A_Review","281066037_The_Customer_Knowledge_Management_Lifecycle_in_PSS_Value_Networks_Towards_Process_Characterization","270147252_Agile_Scheduling_and_Control_for_Industrial_Product-service_Systems","267957493_Resource_Planning_of_Industrial_Product-Service_Systems_IPS_by_a_Heuristic_Resource_Planning_Approach","322327544_Towards_a_new_collaborative_framework_supporting_the_design_process_of_industrial_Product_Service_Systems","321542375_Advances_on_Mechanics_Design_Engineering_and_Manufacturing_Proceedings_of_the_International_Joint_Conference_on_Mechanics_Design_Engineering_Advanced_Manufacturing_JCM_2016_14-16_September_2016_Catani","267857014_Hierarchical_Planning_for_Industrial_Product_Service_Systems"]}