{"id":"319342167_Performance_Comparison_of_Subjective_Quality_Assessment_Methods_for_4k_Video","abstract":"Many subjective quality assessment methods have been standardized. Experimenters can select a method from these methods in accordance with the aim of the planned subjective assessment experiment. It is often argued that the results of subjective quality assessment are affected by range effects that are caused by the quality distribution of the assessment videos. However, there are no studies on the double stimulus continuous quality-scale (DSCQS) and absolute category rating with hidden reference (ACR-HR) methods that investigate range effects in the high-quality range. Therefore, we conduct experiments using high-quality assessment videos (high-quality experiment) and low-to-high-quality assessment videos (low-to-high-quality experiment) and compare the DSCQS and ACR-HR methods in terms of accuracy, stability, and discrimination ability. Regarding accuracy, we find that the mean opinion scores of the DSCQS and ACR-HR methods were marginally affected by range effects, although almost all common processed video sequences showed no significant difference for the high- and low-to-high-quality experiments. Second, the DSCQS and ACR-HR methods were equally stable in the low-to-high-quality experiment, whereas the DSCQS method was more stable than the ACR-HR method in the high-quality experiment. Finally, the DSCQS method had higher discrimination ability than the ACR-HR method in the low-to-high-quality experiment, whereas both methods had almost the same discrimination ability for the high-quality experiment. We thus determined that the DSCQS method is better at minimizing the range effects than the ACR-HR method in the high-quality range.","authors":["Kimiko KAWASHIMA","Kazuhisa YAMAGISHI","Takanori HAYASHI"],"meta":["August 2017IEICE Transactions on Communications E101.B(3)","DOI:10.1587/transcom.2017EBP3123"],"references":["282582710_The_Accuracy_of_Subjects_In_A_Quality_Experiment_A_Theoretical_Subject_Model","260711732_On_Designing_Paired_Comparison_Experiments_for_Subjective_Multimedia_Quality_Assessment"]}