{"id":"319306613_QoS_Performance_of_Integrated_Hybrid_Optical_Network_in_Mobile_Fronthual_Networks","abstract":"Cloud Radio Access Network (C-RAN) has emerged as a promising solution to meet the ever-growing capacity demand and reduce the cost of mobile network components. In such network, the mobile operator's Remote Radio Head (RRH) and Base Band Unit (BBU) are often separated and the connection between them has very tight timing and latency requirements. To employ packet-based network for C-RAN fronthaul, the carried fronthaul traffic are needed to achieve the requirements of fronthaul streams. For this reason, the aim of this paper is focused on investigating and evaluating the feasibility of Integrated Hybrid Optical Network (IHON) networks for mobile fronthaul. TransPacket AS (www.transpacket.com) develops a fusion switching that efficiently serves both Guaranteed Service Transport (GST) traffic with absolute priority and packet switched Statistical Multiplexing (SM) best effort traffic. We verified how the leftover capacity of fusion node can be used to carry the low priority packets and how the GST traffic can have deterministic characteristics on a single wavelength by delaying it with Fixed Delay Line (FDL). For example, for L1GE SM =0.3 the added SM traffic increases the 10GE wavelength utilization up to 89% without any losses and with SM PLR=1E-03 up to 92% utilization. The simulated results and numerical analysis confirm that the PDV and PLR of GST traffic in Ethernet network meet the requirements of mobile fronthaul using CPRI. For Ethernet network, the number of nodes in the network limits the maximum separation distance between BBU and RRH (link length); for increasing the number of nodes, the link length decreases. Consequently, Radio over Ethernet (RoE) traffic should receive the priority and Quality of Service (QoS) HP can provide. On the other hand, Low Priority (LP) classes are not sensitive to QoS metrics and should be used for transporting time insensitive applications and services.","authors":["Dawit Hadush Hailu","Gebrehiwet Gebrekrstos Lema","S. Bjornstad"],"meta":["July 2017Indonesian Journal of Electrical Engineering and Computer Science 7(1):189-204","DOI:10.11591/ijeecs.v7.i1.pp189-204","Project: Mobile Fronthual networks"],"references":["282897918_Fronthaul_evolution_From_CPRI_to_Ethernet","266856491_Heterogeneous_Cloud_Radio_Access_Networks_A_New_Perspective_for_Enhancing_Spectral_and_Energy_Efficiencies","260334428_Optical_fiber_solution_for_mobile_fronthaul_to_achieve_Cloud_Radio_Access_Network","316934228_Optical_fiber_solution_for_mobile_fronthaul_to_achieve_cloud_radio_access_network","308854601_Mobile_fronthaul_over_latency-optimized_time_division_multiplexed_passive_optical_networks","288485112_Joint_wireless-optical_infrastructure_deployment_and_layout_planning_for_Cloud-Radio_Access_Networks","282390631_Performance_Evaluation_of_Mobile_Front-Haul_Employing_Ethernet-Based_TDM-PON_With_IQ_Data_Compression_Invited","261350077_Evolution_mobile_wireless_communication_and_LTE_networks","261057161_Colony-RAN_architecture_for_future_cellular_network","260547547_Integrated_PacketCircuit_Hybrid_Network_Field_Trial_With_Production_Traffic_Invited"]}