{"id":"319463716_Quantum_search_with_hybrid_adiabatic-quantum_walk_algorithms_and_realistic_noise","abstract":"Computing using a continuous-time evolution, based on the natural interaction Hamiltonian of the quantum computer hardware, is a promising route to building useful quantum computers in the near-term. Adiabatic quantum computing, quantum annealing, computation by continuous-time quantum walk, and special purpose quantum simulators all use this strategy. In this work, we carry out a detailed examination of adiabatic and quantum walk implementation of the quantum search algorithm, using the more physically realistic hypercube connectivity, rather than the complete graph, for our base Hamiltonian. We interpolate between adiabatic and quantum walk searching, obtaining a family of hybrid algorithms. We show that all of these hybrid algorithms provide the quadratic quantum speed up with optimal parameter settings, which we determine and discuss in detail. We incorporate the effects of multiple runs of the same algorithm, noise applied to the qubits, and two types of problem misspecification, determining the optimal hybrid algorithm for each case. Our results reveal a rich structure of how these different computational mechanisms operate and should be balanced in different scenarios. For large systems with low noise and good control, quantum walk is the best choice, while hybrid strategies can mitigate the effects of many shortcomings in hardware and problem misspecification.","authors":["James G. Morley","Nicholas Chancellor","Sougato Bose","Viv Kendon"],"meta":["September 2017","DOI:10.1103/PhysRevA.99.022339"],"references":["337610990_Finding_spin_glass_ground_states_using_quantum_walks","321416021_Quantum-Assisted_Learning_of_Hardware-Embedded_Probabilistic_Graphical_Models","318460817_Towards_Quantum_Simulation_with_Circular_Rydberg_Atoms","310235960_Adiabatic_Quantum_Computing","308066372_Fixed-Point_Adiabatic_Quantum_Search","332047111_Analog_errors_in_Ising_machines","322781740_Adiabatic_quantum_computation","317930050_High-fidelity_adiabatic_quantum_computation_using_the_intrinsic_Hamiltonian_of_a_spin_system_Application_to_the_experimental_factorization_of_291311","317566043_Near-optimal_quantum_circuit_for_Grover's_unstructured_search_using_a_transverse_field","312521093_Dynamics_of_the_quantum_search_and_quench-induced_first-order_phase_transitions"]}