{"id":"319467813_Predicting_functional_neuroanatomical_maps_from_fusing_brain_networks_with_genetic_information","abstract":"Functional neuroanatomical maps provide a mesoscale reference framework for studies from molecular to systems neuroscience and psychiatry. The underlying structure-function relationships are typically derived from functional manipulations or imaging approaches. Although highly informative, these are experimentally costly. The increasing amount of publicly available brain and genetic data offers a rich source that could be mined to address this problem computationally. Here, we developed an algorithm that fuses gene expression and connectivity data with functional genetic meta data and exploits cumulative effects to derive neuroanatomical maps related to multi-genic functions. We validated the approach by using public available mouse and human data. The generated neuroanatomical maps recapture known functional anatomical annotations from literature and functional MRI data. When applied to multi-genic meta data from mouse quantitative trait loci (QTL) studies and human neuropsychiatric databases, this method predicted known functional maps underlying behavioral or psychiatric traits. Taken together, genetically weighted connectivity analysis (GWCA) allows for high throughput functional exploration of brain anatomy in silico. It maps functional genetic associations onto brain circuitry for refining functional neuroanatomy, or identifying trait-associated brain circuitry, from genetic data.","authors":["Florian Ganglberger","Joanna Kaczanowska","Josef M. Penninger","Andreas Hess"],"meta":["September 2017NeuroImage 170","DOI:10.1016/j.neuroimage.2017.08.070","Project: Brain analytics"],"references":["307553759_Gene_transcription_profiles_associated_with_inter-modular_hubs_and_connection_distance_in_human_functional_magnetic_resonance_imaging_networks","305648007_Adolescence_is_associated_with_genomically_patterned_consolidation_of_the_hubs_of_the_human_brain_connectome","304806652_Systematic_and_integrative_analysis_of_large_gene_lists_using_DAVID_bioinformatics_resources","285824134_The_brain_reward_circuitry_in_mood_disorders","282039069_Retrosplenial_Cortex_and_Long-Term_Memory_Molecules_to_Behavior","280536141_Wiring_cost_and_topological_participation_of_the_mouse_brain_connectome","279921752_BRAIN_NETWORKS_Correlated_gene_expression_supports_synchronous_activity_in_brain_networks","277085208_Neuronal_circuits_for_fear_and_anxiety","324179141_Different_forms_of_synaptic_plasticity_in_somatosensory_and_motor_areas_of_the_neocortex","280448032_A_Magnetoencephalography_study_of_multi-modal_processing_of_pain_anticipation_in_primary_sensory_cortices"]}