{"id":"319451363_Sustainable_Practices_in_Technical_Education_A_Quality_Assurance_Framework","abstract":"The term sustainability means using methods, systems and materials to meet the needs of the present without compromising the future. Even with the prevalence of the term and its wide use across disciplines, there has been little effort to formulate a quality measurement framework in tertiary education based on the values and characteristics of sustainability. The framework that we present here is the Sustainability of Technical Education (SoTE), where sustainability is defined as the ability to continuously improve without reducing the capacity to endure. The SoTE consists of criteria, measures, indicators, and a set of aligned analytic rubrics that aid the calculation of different indicators including a one main indicator called the Sustainability Indicator. In this paper, we present the need for a focus on sustainability in higher education for continuous improvement and fiscal purposes, present the SoTE criteria and indicators, and present the results and analysis of a pilot study conducted at a private, non-profit university in the Gulf Cooperation Council (GCC) Region. The paper concludes with a discussion of the usefulness of the SoTE for continuous improvement and for collecting and providing evidence for quality assurance and accreditation organizations at programmatic and institutional levels.","authors":["Issam Damaj","Ashley Ater Kranov"],"meta":["September 2017International Journal of Engineering Education 33(5):1627","Project: The Sustainability of Technical Education: A Measurement Framework"],"references":["318590214_The_Sustainability_of_Technical_Education_A_Measurement_Framework","318590083_The_Sustainability_of_Technical_Education_Leadership_and_Governance","283521609_A_framework_for_measuring_the_sustainability_of_academic_programs_in_the_technical_fields_Initial_validity_study_findings","251998350_Sustainability_of_engineering_education_in_the_Gulf_Cooperation_Council_region","285796062_The_Role_of_Accreditation_in_Promoting_Quality_Assurance_of_Technical_Education","279187534_The_Good_Research_Guide_For_Small-Scale_Social_Research_Projects","267697942_Education_for_Sustainable_Development_An_International_Perspective","264224332_Quality_Assurance_in_Engineering_Education_A_Comparison_of_EC-2000_and_ISO-9000","251938056_Developing_a_Sustainable_Engineering_Education_in_the_Middle_East_and_North_Africa_Region","247507873_A_framework_for_measuring_quality_in_engineering_education"]}