{"id":"319482190_The_Benefits_of_Controlled_Experimentation_at_Scale","abstract":"Online controlled experiments (for example A/B tests) are increasingly being performed to guide product development and accelerate innovation in online software product companies. The benefits of controlled experiments have been shown in many cases with incremental product improvement as the objective. In this paper, we demonstrate that the value of controlled experimentation at scale extends beyond this recognized scenario. Based on an exhaustive and collaborative case study in a large software-intensive company with highly developed experimentation culture, we inductively derive the benefits of controlled experimentation. The contribution of our paper is twofold. First, we present a comprehensive list of benefits and illustrate our findings with five case examples of controlled experiments conducted at Microsoft. Second, we provide guidance on how to achieve each of the benefits. With our work, we aim to provide practitioners in the online domain with knowledge on how to use controlled experimentation to maximize the benefits on the portfolio, product and team level.","authors":["Aleksander Fabijan","Pavel Dmitriev","Helena Holmstrom Olsson","Jan Bosch"],"meta":["August 2017","DOI:10.1109/SEAA.2017.47","Conference: Euromicro Conference on Software Engineering and Advanced Applications SEAA2017At: Vienna, Austria","Project: Online Controlled Experimentation"],"references":["317006885_The_Evolution_of_Continuous_Experimentation_in_Software_Product_Development","313449492_Pitfalls_of_long-term_online_controlled_experiments","310206568_Online_Controlled_Experiments_and_AB_Tests","310047470_Developing_the_right_features_the_role_and_impact_of_customer_and_product_data_in_software_product_development","309222196_Time_to_Say_'Good_Bye'_Feature_Lifecycle","318920701_A_Dirty_Dozen_Twelve_Common_Metric_Interpretation_Pitfalls_in_Online_Controlled_Experiments","309469428_Measuring_Metrics","307089805_Software_Engineering_Needs_Agile_Experimentation_A_New_Practice_and_Supporting_Tool","303296481_The_bones_of_the_system_a_case_study_of_logging_and_telemetry_at_Microsoft","303099141_The_emerging_role_of_data_scientists_on_software_development_teams"]}