{"id":"319400013_An_exploratory_study_of_innovation_strategies_of_the_internet_of_things_SMEs_in_South_Korea","abstract":"Purpose\n\nThis study aims to suggest directions for innovation-driving paths for sustainable growth through an in-depth case analysis of a successful Internet of Things (IoT) in small- and medium-sized enterprise (SME) in South Korea. IoT is expected to play a significant role in the future industry 4.0 platform. Yet, little is known about how SMEs in the IoT industry (IoT-SMEs hereafter) pursue innovation in alignment with attributes inherent in the IoT.\n\nDesign/methodology/approach\n\nThis study addresses relatively unexplored key research questions on innovation strategies of IoT-SMEs. To do so, we employ an exploratory research methodology, along with an extensive review of the literature in the areas of the IoT, SMEs innovation and sustainable growth strategy. Specifically, we conduct intensive individual interviews to find IoT inherent innovation attributes and a case study to explore the process of linking these attributes to innovation-driving paths.\n\nFindings\n\nThe analysis results reveal that there exist disruptive and open innovation attributes in the IoT industry that enable IoT-SMEs to enhance their structure and process related capabilities, to create business models for products and services and to collaborate with external parties in marketing to enter the market. We excavate practical insights into driving innovation based on IoT attributes and suggest enabling paths for pursuing innovation and entering overseas markets for IoT-SMEs.\n\nOriginality/value\n\nThis study investigates an underexplored significant area of research on the relationship between IoT attributes and innovation paths. The findings provide profound theoretical and practical implications. To the best of the author’s knowledge, it is the first attempt to link disruptive and open IoT attributes to innovation paths of IoT-SMEs. The results provide directions for pursuing effective innovation in responding to the IoT market for sustainable growth.","authors":["Dong-Il Shin"],"meta":["August 2017Asia Pacific Journal of Innovation and Entrepreneurship 11(2):171-189","DOI:10.1108/APJIE-08-2017-025"],"references":["317151656_The_Impacts_of_Network_Relationships_on_SMEs'_Internationalization_Process","284105759_A_taxonomy_of_born-global_firms","275098447_Internationalisation_and_the_Smaller_Firm_A_Review_of_Contemporary_Empirical_Research","324899304_International_Entrepreneurship_The_Current_Status_of_the_Field_and_Future_Research_Agenda","313714656_'Strategic_Alliance_Structuring_A_Game_Theoretic_and_Transaction_Cost_Examination_of_Interfirm_Cooperation'","312889885_Successful_industrial_innovation_Critical_success_factors_for_the_1990s","293203779_Innovation's_Holy_Grail","292739108_A_multidimensional_study_of_the_key_determinants_of_effective_SME_marketing_activity_Part_1","276416808_Competitive_Advantage_in_SMEs_Organising_for_Innovation_and_Entrepreneurship","274502326_Effects_of_Age_at_Entry_Knowledge_Intensity_and_Imitability_on_International_Growth"]}