{"id":"319421476_Prevention_of_treatable_infectious_diseases_A_game-theoretic_approach","abstract":"We model outcomes of voluntary prevention using an imperfect vaccine, which confers protection only to a fraction of vaccinees for a limited duration. Our mathematical model combines a single-player game for the individual-level decision to get vaccinated, and a compartmental model for the epidemic dynamics. Mathematical analysis yields a characterization for the effective vaccination coverage, as a function of the relative cost of prevention versus treatment; note that cost may involve monetary as well as non-monetary aspects. Three behaviors are possible. First, the relative cost may be too high, so individuals do not get vaccinated. Second, the relative cost may be moderate, such that some individuals get vaccinated and voluntary vaccination alleviates the epidemic. In this case, the vaccination coverage grows steadily with decreasing relative cost of vaccination versus treatment. Unlike previous studies, we find a third case where relative cost is sufficiently low so epidemics may be averted through the use of prevention, even for an imperfect vaccine. However, we also found that disease elimination is only temporary-as no equilibrium exists for the individual strategy in this third case-and, with increasing perceived cost of vaccination versus treatment, the situation may be reversed toward the epidemic edge, where the effective reproductive number is 1. Thus, maintaining relative cost sufficiently low will be the main challenge to maintain disease elimination. Furthermore, our model offers insight on vaccine parameters, which are otherwise difficult to estimate. We apply our findings to the epidemiology of measles.","authors":["Sofia Jijon","Virginie Supervie","Romulus Breban"],"meta":["August 2017Vaccine 35(40)","DOI:10.1016/j.vaccine.2017.08.040","Project: Game theory and Epidemiology"],"references":["311777756_Behavioural_change_models_for_infectious_disease_transmission_A_systematic_review_2010-2015","308128985_The_State_of_Vaccine_Confidence_2016_Global_Insights_Through_a_67-Country_Survey","303769044_Acceptability_of_Parental_Financial_Incentives_and_Quasi-Mandatory_Interventions_for_Preschool_Vaccinations_Triangulation_of_Findings_from_Three_Linked_Studies","292189795_Verification_of_measles_elimination_in_Australia_Application_of_World_Health_Organization_regional_guidelines","280537968_Coupled_disease-behavior_dynamics_on_complex_networks_A_review","280033793_Optimal_Vaccination_Strategies_and_Rational_Behaviour_in_Seasonal_Epidemics","280030392_Comparative_Estimates_of_Crude_and_Effective_Coverage_of_Measles_Immunization_in_Low-Resource_Settings_Findings_from_Salud_Mesoamerica_2015","314118569_Measles_epidemic_in_Brazil_in_the_post-elimination_period_Coordinated_response_and_containment_strategies","285614599_Vaccines_Sixth_Edition","281363754_A_game_theoretic_approach_to_valuating_toxoplasmosis_vaccination_strategies"]}