{"id":"319447100_How_to_involve_inhabitants_in_urban_design_planning_by_using_digital_tools_An_overview_on_a_state_of_the_art_key_challenges_and_promising_approaches","abstract":"Different cases of public disagreement in different European countries have shown recently that perusing a thorough planning process is by no means a guarantee for a broad public acceptance of an envisioned urban project. Consequently, the employment of digital media and tools to enable participation of inhabitants in urban planning processes on a massive scale is a promising, but currently not comprehensively analyzed approach. Our research activities are intended to gain an overview on a state of the art of research on communication channels, methods and best practices as well as to identify key challenges and promising strategies and tools to overcome these challenges with specific regards to large numbers of users and digital supported approaches. The latter aspects comprise the investigation of phenomena like participant selection, framing effects and gamified approaches for digital-mediated participatory processes as well as native language processing techniques to examine opinions as well as ideas of relevance from massive public feedback. To examine, we performed literature reviews of several hundred research articles, investigated cases in Germany, France and the Netherlands by interviews and workshops with stakeholders and employed methods of prototyping to conceptualize, develop and assess some promising approaches such as sentiment analysis in detail.","authors":["Sander Münster","Christopher Georgi","Katrina Heijne","Kevin Klamert"],"meta":["December 2017Procedia Computer Science 112:2391-2405","DOI:10.1016/j.procs.2017.08.102","Projects: U_CODEUrban Collective Design Environment: A new tool for enabling expert planners to co-create and communicate with citizens in urban design — U_CODE"],"references":["318742974_Child's_Play_-_A_Literature-Based_Survey_on_Gamified_Tools_and_Methods_for_Fostering_Public_Participation_in_Urban_Planning","306482962_Forschungsmethoden_und_Evaluation_fur_Human-_und_Sozialwissenschaftler","304998020_Citizen-Centric_Urban_Planning_through_Extracting_Emotion_Information_from_Twitter_in_an_Interdisciplinary_Space-Time-Linguistics_Algorithm","303018696_Gamification_Toward_a_definition","300204780_Exploring_the_effects_of_game_elements_in_m-participation","340910664_The_A-Z_of_Social_Research_Jargon","326309600_Co-Creating_User_Stories_A_Tool_for_Making_Sense_of_Business_Opportunities","314755797_Statistical_Analysis_with_Missing_Data","313618321_A_ladder_of_citizen_participation","302409536_Stuttgart_21_im_Spiegel_von_Facebook-Aktivitaten_der_Befarworter_und_der_Gegner_des_Projektes"]}