{"id":"319417036_A_review_of_energy_simulation_tools_for_the_manufacturing_sector","abstract":"Manufacturing is a competitive global market and efforts to mitigate climate change are at the forefront of public perception. Current trends in manufacturing aim to reduce costs and increase sustainability without negatively affecting the yield of finished products, thus maintaining or improving profits. Effective use of energy within a manufacturing environment can help in this regard by lowering overhead costs. Significant benefit can be gained by utilising simulations in order to predict energy demand allowing companies to make effective retrofit decisions based on energy as well as other metrics such as resource use, throughput and overhead costs. Traditionally, Building Energy Modelling (BEM) and Manufacturing Process Simulation (MPS) have been used extensively in their respective fields but they remain separate and segregated which limits the simulation window used to identify energy improvements. This review details modelling approaches and the simulation tools that have been used, or are available, in an attempt to combine BEM and MPS, or elements from each, into a holistic approach. Such an approach would be able to simulate the interdependencies of multiple layers contained within a factory from production machines, process lines and Technical Building Services (TBS) to the building shell. Thus achieving a greater perspective for identifying energy improvement measures across the entire operating spectrum and multiple, if not all, manufacturing industries. In doing so the challenges associated with incorporating BEM in manufacturing simulation are highlighted as well as gaps within the research for exploitation through future research. This paper identified requirements for the development of a holistic energy simulation tool for use in a manufacturing facility, that is capable of simulating interdependencies between different building layers and systems, and a rapid method of 3D building geometry generation from site data or existing BIM in an appropriate format for energy simulations of existing factory buildings.","authors":["Tom Garwood","Ben Hughes","Michael Oates","Dominic O'Connor"],"meta":["January 2017Renewable and Sustainable Energy Reviews 81(1):895-911","DOI:10.1016/j.rser.2017.08.063","Project: Integrated-Energy Modelling for Energy Efficiency and Sustainability in the Automotive Sector"],"references":["305645743_A_Review_of_Sustainable_Machining_Engineering_Optimization_Process_Through_Triple_Bottom_Line","304997951_Cost_reduction_of_a_hybrid_energy_storage_system_considering_correlation_between_wind_and_PV_power","303735782_A_'Design_for_Energy_Minimization'_approach_to_reduce_energy_consumption_during_the_manufacturing_phase","290797585_Towards_integrated_energy_efficiency_assessment_of_production_machinery_auxiliary_processes_and_technical_building_services","308013207_Multi-level_simulation_in_manufacturing_companies_The_water-energy_nexus_case","307555596_Systematic_literature_review_of_decision_support_models_for_energy-efficient_production_planning","305678611_Energy_Consumption_Modeling_and_Analyses_In_Automotive_Manufacturing_Plant","303511487_A_hierarchical_framework_for_concurrent_assessment_of_energy_and_water_efficiency_in_manufacturing_systems","301344086_The_evolution_and_future_of_manufacturing_A_review","291553126_Smart_manufacturing_Past_research_present_findings_and_future_directions","283616245_Factory_eco-efficiency_modelling","290481207_Plant-Level_Electricity_Demand_Response_for_Combined_Manufacturing_System_and_HVAC_System","288857567_A_review_on_modeling_and_simulation_of_building_energy_systems","288653561_Microsoft_Excel","286763576_A_Simple_Energy_Usage_Toolkit_from_Manufacturing_Simulation_Data"]}