{"id":"319403947_Reservoir_Computing_Beyond_Memory-Nonlinearity_Trade-off","abstract":"Reservoir computing is a brain-inspired machine learning framework that employs a signal-driven dynamical system, in particular harnessing common-signal-induced synchronization which is a widely observed nonlinear phenomenon. Basic understanding of a working principle in reservoir computing can be expected to shed light on how information is stored and processed in nonlinear dynamical systems, potentially leading to progress in a broad range of nonlinear sciences. As a first step toward this goal, from the viewpoint of nonlinear physics and information theory, we study the memory-nonlinearity trade-off uncovered by Dambre et al. (2012). Focusing on a variational equation, we clarify a dynamical mechanism behind the trade-off, which illustrates why nonlinear dynamics degrades memory stored in dynamical system in general. Moreover, based on the trade-off, we propose a mixture reservoir endowed with both linear and nonlinear dynamics and show that it improves the performance of information processing. Interestingly, for some tasks, significant improvements are observed by adding a few linear dynamics to the nonlinear dynamical system. By employing the echo state network model, the effect of the mixture reservoir is numerically verified for a simple function approximation task and for more complex tasks.","authors":["Masanobu Inubushi","Kazuyuki Yoshimura"],"meta":["December 2017Scientific Reports 7(1)","DOI:10.1038/s41598-017-10257-6"],"references":["313463701_High-Speed_Photonic_Reservoir_Computing_Using_a_Time-Delay-Based_Architecture_Million_Words_per_Second_Classification","308709059_Exploring_transfer_function_nonlinearity_in_echo_state_networks","297590085_Fully_analogue_photonic_reservoir_computer","284514502_Minimum_complexity_echo_state_network","277412620_Information_processing_via_physical_soft_body","270906460_High_performance_photonic_reservoir_computer_based_on_a_coherently_driven_passive_cavity","270824608_Photonic_Delay_Systems_as_Machine_Learning_Implementations","261067692_Experimental_demonstration_of_reservoir_computing_on_a_silicon_photonics_chip","301845426_Harnessing_disordered_quantum_dynamics_for_machine_learning","280940018_Pattern_Recognition_and_Machine_Learning"]}