{"id":"319464601_ForEx_A_New_Framework_for_Knowledge_Discovery_from_Decision_Forests","abstract":"Decision trees are popularly used in a wide range of real world problems for both prediction and classification (logic) rules discovery. A decision forest is an ensemble of decision trees and it is often built for achieving better predictive performance compared to a single decision tree. Besides improving predictive performance, a decision forest can be seen as a pool of logic rules (rules) with great potential for knowledge discovery. However, a standard-sized decision forest usually generates a large number of rules that a user may not able to manage for effective knowledge analysis. In this paper, we propose a new, data set independent framework for extracting those rules that are comparatively more accurate, generalized and concise than others. We apply the proposed framework on rules generated by two different decision forest algorithms from some publicly available medical related data sets on dementia and heart disease. We then compare the quality of rules extracted by the proposed framework with rules generated from a single J48 decision tree and rules extracted by another recent method. The results reported in this paper demonstrate the effectiveness of the proposed framework.","authors":["Md Nasim Adnan","Md Zahidul Islam"],"meta":["September 2017Australasian Journal of Information Systems 21","DOI:10.3127/ajis.v21i0.1539","Project: Decision Tree"],"references":["318814623_Forest_PA_Constructing_a_Decision_Forest_by_Penalizing_Attributes_used_in_Previous_Trees","309395583_Knowledge_Discovery_from_a_Data_Set_on_Dementia_through_Decision_Forest","308802773_Improving_the_Random_Forest_Algorithm_by_Randomly_Varying_the_Size_of_the_Bootstrap_Samples_for_Low_Dimensional_Data_Sets","305156493_Optimizing_the_Number_of_Trees_in_a_Decision_Forest_to_Discover_a_Subforest_with_High_Ensemble_Accuracy_using_a_Genetic_Algorithm","301295119_One-Vs-All_Binarization_Technique_in_the_Context_of_Random_Forest","301257974_Forest_CERN_A_New_Decision_Forest_Building_Technique","300446142_Risk_Factors_and_Identifiers_for_Alzheimer's_Disease_A_Data_Mining_Analysis","283953881_Feature_Analysis_of_Coronary_Artery_Heart_Disease_Data_Sets","312609767_Mini-mental_state-practical_method_for_grading_cognitive_state_of_patients_for_clinicians","288906520_Random_forests"]}