{"id":"319415829_An_Ontological_Learning_Management_System","abstract":"The current learning systems typically lack the level of metacognitive awareness, self-directed learning, and time management skills. Most of the ontologically based learning management systems are in the proposed phase and those which are developed do not provide the necessary path guidance for proper learning. The systems available are not as adaptive from the viewpoint of the learner as required. Ontology engineering has become an important pillar for knowledge management and representation in recent years. The design, approach, and implementation of ontology in e-learning and m-learning systems have made them more effective. In this paper, we have proposed a system for the betterment of knowledge management and representation of associated data as compared to the previously available learning management systems. Here, we have presented the application and implementation of ontological engineering methodology in the Computer Science domain. For knowledge management, we have created a domain associated ontology which represents knowledge of a single domain. Subsequently, ontology has been created to manage a learner profile so that a learner may be aligned to a proper path of learning. The learner ontology will use the VARK learning model which classifies what kind of learning does the learner requires so that necessary resources could be provided.","authors":["Monika Rani","Kumar Vaibhav Srivastava","O. P. Vyas"],"meta":["August 2017"],"references":["286647412_Development_of_an_Ontology-Based_E-Learning_System","282504320_An_Ontology-based_Adaptive_Personalized_E-learning_System_Assisted_by_Software_Agents_on_Cloud_Storage","280977940_Performance_analysis_of_SPARQL_and_DL-Query_on_electromyography_ontology","320075166_A_Hybrid_Approach_using_Ontology_Similarity_and_Fuzzy_Logic_for_Semantic_Question_Answering","309666639_Ontology-based_e-assessment_for_accounting_Outcomes_of_a_pilot_study_and_future_prospects","289689581_CURONTO_A_Semantic_Model_of_the_Curriculum_for_Program_Assessment_and_Improvement","287588093_Telling_Tales_Over_Time_Calendars_Clocks_and_School_Effectiveness","284870453_Programmed_instruction_revisited","283838327_An_Argument_for_Clarity_What_are_Learning_Management_Systems_What_are_They_Not_and_What_Should_They_Become","282076618_CURONTO_A_Semantic_Model_of_the_Curriculum_for_Program_Assessment_and_Improvement"]}