{"id":"319420278_Analysing_Scholarly_Communication_Metadata_of_Computer_Science_Events","abstract":"Over the past 30 years we have observed the impact of the ubiquitous availability of the Internet, email, and web-based services on scholarly communication. The preparation of manuscripts as well as the organisation of conferences, from submission to peer review to publication, have become considerably easier and efficient. A key question now is what were the measurable effects on scholarly communication in computer science? Of particular interest are the following questions: Did the number of submissions to conferences increase? How did the selection processes change? Is there a proliferation of publications? We shed light on some of these questions by analysing comprehensive scholarly communication metadata from a large number of computer science conferences of the last 30 years. Our transferable analysis methodology is based on descriptive statistics analysis as well as exploratory data analysis and uses crowd-sourced, semantically represented scholarly communication metadata from OpenResearch.org.","authors":["Said Fathalla","Sahar Vahdati","Christoph Lange","Sören Auer"],"meta":["September 2017","DOI:10.1007/978-3-319-67008-9_27","Conference: International Conference on Theory and Practice of Digital Libraries"],"references":["305406290_OpenResearch_Collaborative_Management_of_Scholarly_Communication_Metadata","287184314_What_is_in_the_proceedings_Combining_publisher's_and_researcher's_perspectives","259332469_Exploring_Scholarly_Data_with_Rexplore","220923781_Demonstrating_the_Semantic_GrowBag_Automatically_Creating_Topic_Facets_for_FacetedDBLP","220416307_Affiliation_analysis_of_database_publications","48174211_Analysis_of_Computer_Science_Communities_Based_on_DBLP","309700661_OpenResearch_Collaborative_Management_of_Scholarly_Communication_Metadata","220924020_Toward_Alternative_Measures_for_Ranking_Venues_A_Case_of_Database_Research_Community","220416218_30_Years_of_PODS_in_facts_and_figures"]}