{"id":"319446437_An_evidential_influence-based_label_propagation_algorithm_for_distributed_community_detection_in_social_networks","abstract":"Community detection in social networks is a computationally challenging task that has attracted many researchers in the last decade. Most of approaches in the literature focus only on modeling structural properties, ignoring the social aspect in the relations between users. Additionally, they detect the communities, one after another, in a serial manner. However, the size of actual real-world social networks grows exponentially which makes such approaches inefficient. For this, several models tend to parallelize the community detection task. Unfortunately, social networks data often exhibits a high degree of dependency which renders the parallelization task more difficult. To overcome this difficulty, amongst the proposed distributed community detection methods, the label propagation algorithm (LPA) emerges as an effective detection method due to its time efficiency. Despite this advantage in computational time, the performance of LPA is affected by randomness in the algorithm. Indeed, LPA suffers from poor stability and occurrence of monster community. This paper introduces a new LPA algorithm for distributed community detection based on evidence theory which has shown a high efficiency in handling information. In our model, we will use the belief functions in the update of labels as well as in their propagation in order to improve the quality of the solutions computed by the standard LPA. The mass assignments and the plausibility, in our model, are computed based on the social influence for detecting the domain label of each node. Experimentation of our model on real-world and artificial LFR networks shows its efficiency compared to the state of the art algorithms.","authors":["Mehdi Azaouzi","Lotfi Ben Romdhane"],"meta":["December 2017Procedia Computer Science 112:407-416","DOI:10.1016/j.procs.2017.08.045","Project: Social Networks Analysis"],"references":["323988797_An_Efficient_Two-Phase_Model_for_Computing_Influential_Nodes_in_Social_Networks_Using_Social_Actions","309278187_Efficient_Community_Detection_Based_on_Label_Propagation_with_Belonging_Coefficient_and_Edge_Probability","307914652_Growing_Neural_Gas_as_a_Memory_Mechanism_of_a_Heuristic_to_Solve_a_Community_Detection_Problem_in_Networks","307913979_Community_Detection_by_Consensus_Genetic-based_Algorithm_for_Directed_Networks","307911535_CoMRing_A_Framework_for_Community_Detection_Based_on_Multi-relational_Querying_Exploration","313697453_Pnas_community_structure_in_social_and_biological_networks_community_structure_in_social_and_biological_networks-_pnas","307910295_Semi-supervised_Evidential_Label_Propagation_Algorithm_for_Graph_Data","303793977_A_social_community_detection_algorithm_based_on_parallel_grey_label_propagation","282482017_EK-NNclus_A_clustering_procedure_based_on_the_evidential_K-nearest_neighbor_rule","267570472_CK-LPA_Efficient_community_detection_algorithm_based_on_label_propagation_with_community_kernel"]}