{"id":"319472482_Elements_of_Gameful_Design_Emerging_from_User_Preferences","abstract":"Several studies have developed models to explain player preferences. These models have been developed for digital games; however, they have been frequently applied in gameful design (i.e., designing non-game applications with game elements) without empirical validation of their fit to this different context. It is not clear if users experience game elements embedded in applications similarly to how players experience them in games. Consequently, we still lack a conceptual framework of design elements built specifically for a gamification context. To fill this gap, we propose a classification of eight groups of gameful design elements produced from an exploratory factor analysis based on participants' self-reported preferences. We describe the characteristics of the users who are more likely to enjoy each group of design elements in terms of their gender , age, gamification user type, and personality traits. Our main contribution is providing an overview of which design elements work best for what demographic clusters and how we can apply this knowledge to design effective gameful systems.","authors":["Gustavo Fortes Tondello","Alberto Mora","Lennart Nacke"],"meta":["October 2017","DOI:10.1145/3116595.3116627","Conference: 2017 Annual Symposium on Computer-Human Interaction in Play - CHI PLAY '17At: Amsterdam - Netherlands","Project: Personalized Gamification"],"references":["317232419_Gamification_a_systematic_review_of_design_frameworks","316653774_Towards_Personality-driven_Persuasive_Health_Games_and_Gamified_Systems","309006949_Studying_student_differentiation_in_gamified_education_A_long-term_study","308165219_How_to_Gamify_A_Method_For_Designing_Gamification","308083575_The_Gamification_User_Types_Hexad_Scale","308073596_Virtual_worlds_Why_people_play","301931450_Personality-targeted_Gamification_A_Survey_Study_on_Personality_Traits_and_Motivational_Affordances","301779032_Player_Type_Models_-_Towards_Empirical_Validation","301450500_Redefining_Videogame_Reward_Types","315060795_From_Games_to_Gamification_A_Classification_of_Rewards_in_World_of_Warcraft_for_the_Design_of_Gamified_Systems"]}