{"id":"319439056_A_Multidisciplinary_Industrial_Robot_Approach_for_Teaching_Mechatronics-Related_Courses","abstract":"This paper presents a robot prototype for an undergraduate laboratory program designed to fulfill the criteria laid out by ABET. The main objective of the program is for students to learn some basic concepts of embedded systems and robotics, and apply them in practice. For that purpose, various practical laboratory exercises were prepared to teach different aspects of communications, control, mechatronics, and microcontrollers. The practicals are organized such that the students can systematically solve real-world problems. The most important feature of the presented program is that, it incorporates interdisciplinary knowledge, and inculcates technical and professional skills required in pursuing a successful career. Furthermore, students and instructors can modify the software and hardware units of the robot prototype as necessary, to explore more ideas and to apply the robot in other mechatronics-related courses. A digital electronics course taught at the Automation Department at Universidad Autónoma de Querétaro, Querétaro, Mexico, is presented as a case study in which the evaluation process was based on ABET criteria and the corresponding student outcomes. A student survey elicited students' observations of, and interest in, the learning process. The positive student feedback and student academic outcomes indicate that the inclusion of prototype had a significant impact on student academic outcomes.","authors":["Mariano Garduno-Aparicio","Juvenal Rodriguez","Gonzalo Macias-Bobadilla","Suresh Thenozhi"],"meta":["September 2017IEEE Transactions on Education PP(99):1-8","DOI:10.1109/TE.2017.2741446"],"references":["292849273_A_multidisciplinary_MOOC_on_creativity_innovation_and_change_Encouraging_experimentation_and_experiential_learning_on_a_grand_scale","258792942_A_Successful_Experience_of_ABET_Accreditation_of_an_Electrical_Engineering_Program","258656550_Low-Cost_Undergraduate_Control_Systems_Experiments_Using_Microcontroller-Based_Control_of_a_DC_Motor","321548632_Integrating_Advanced_Technology_into_Technology_Education","308824975_Autonomous_robot_An_intellectual_way_of_infusing_microcontroller_fundamentals_into_sophomore_students","289174966_Student_experiences_in_an_interdisciplinary_studio-based_design_course_The_role_of_peer_scaffolding","271546201_A_competition-based_approach_for_undergraduate_mechatronics_education_using_the_arduino_platform","261248041_Design_and_development_of_a_low-cost_embedded_system_laboratory_using_TI_MSP430F149","261156113_Design_and_development_of_a_low-cost_student_experiments_for_teaching_ARM_based_embedded_system_laboratory","258792939_Experiences_in_Developing_an_Experimental_Robotics_Course_Program_for_Undergraduate_Education"]}