{"id":"319499732_How_can_we_better_capture_food_away_from_Home_Lessons_from_India's_linking_person-level_meal_and_household-level_food_data","abstract":"Despite acknowledged shortcomings, household consumption and expenditure surveys (HCES) are increasingly being used to proxy food consumption because they are relatively more available and affordable than surveys using more precise dietary assessment methods. One of the most common, significant sources of HCES measurement error is their under-estimation of food away from home (FAFH). In 2011, India’s National Survey Sample Organization introduced revisions in its HCES questionnaire that included replacing “cooked meals”—the single item in the food consumption module designed to capture FAFH at the household level—with five more detailed and explicitly FAFH sub-categories. The survey also contained a section with seven, household member-specific questions about meal patterns during the reference period and included three sources of meals away from home (MAFH) that overlapped three of the new FAFH categories.\nBy providing a conceptual framework with which to organize and consider each household member’s meal pattern throughout the reference period, and breaking down the recalling (or estimating) process into household member-specific responses, we assume the MAFH approach makes the key respondent’s task less memory- and arithmetically-demanding, and thus more accurate than the FAFH household level approach. We use the MAFH estimates as a reference point, and approximate one portion of FAFH measurement error as the differences in MAFH and FAFH estimates. The MAFH estimates reveal marked heterogeneity in intra-household meal patterns, reflecting the complexity of the HCES’s key informant task of reporting household level data, and underscoring its importance as a source of measurement error.\nWe find the household level-based estimates of FAFH increase from just 60.4% of the individual-based estimates in the round prior to the questionnaire modifications to 96.7% after the changes. We conclude that the MFAH-FAFH linked approach substantially reduced FAFH measurement error in India. The approach has wider applicability in global efforts to improve HCES.","authors":["John L. Fiedler","Suryakant Yadav"],"meta":["September 2017Food Policy 72","DOI:10.1016/j.foodpol.2017.08.015"],"references":["275357066_Eating_out_is_different_from_eating_at_home_among_individuals_who_occasionally_eat_out_A_cross-sectional_study_among_middle-aged_adults_from_eleven_European_countries","274727961_Kappa_coefficient_a_popular_measure_of_rater_agreement","265179615_The_Sensitivity_of_Food_Security_in_India_to_Alternate_Estimation_Methods","286415826_More_than_1_billion_people_are_hungry_in_the_world","279597627_A_critical_look_at_some_propositions_on_consumption_and_poverty","271773435_Household_composition_income_and_food-away-from-home_expenditure_in_urban_China","270053131_Fuelling_Calorie_Intake_Decline_Household-Level_Evidence_from_Rural_India","264706994_The_Great_Indian_Calorie_Debate_Explaining_Rising_Undernourishment_during_India's_Rapid_Economic_Growth","262120321_Declining_Demand_for_Foodgrains_in_Rural_India_Causes_and_Implications","261890931_Food_and_Nutrition_in_India_Facts_and_Interpretations"]}