{"id":"319483403_Sentence-Level_Emotion_Detection_Framework_Using_Rule-Based_Classification","abstract":"Emotion detection and analysis aims at developing applications that can detect and analyse emotions expressed by the users in a given text. Such applications have received considerable attention from experts in computer science, psychology, communications and health care. Emotion-based sentiment analysis can be performed using supervised and unsupervised techniques. The existing studies using supervised and unsupervised emotion-based sentiment analysis are based on Ekman’s basic emotion model; have limited coverage of emotion-words, polarity shifters and negations; and lack emoticons and slang. The problems associated with existing approaches can be overcome by the development of an effective, sentence-level emotion-detection sentiment analysis system under a rule-based classification scheme with extended lexicon support and an enhanced model of emotion signals: emotion words, polarity shifters, negations, emoticons and slang. In this work, we propose a rule-based framework for emotion-based sentiment classification at the sentence level obtained from user reviews. The main contribution of this work is to integrate cognitive-based emotion theory (e.g. Ekman’s model) with sentiment analysis-based computational techniques (e.g. detection of emotion words, emoticons and slang) to detect and classify emotions from natural language text. The main focus is to improve the performance of state-of-the-art methods by including additional emotion-related signals, such as emotion words, emoticons, slang, polarity shifters and negations, to efficiently detect and classify emotions in user reviews. The improved results in terms of accuracy, precision, recall and F-measure demonstrate the superiority of the proposed method’s classification results compared with baseline methods. The framework is generalized and capable of classifying emotions in any domain.","authors":["Dr. Muhammad Zubair Asghar","Aurangzeb Khan","Afsana Bibi","Fazal Masud Kundi"],"meta":["December 2017Cognitive Computation 9(2):1-27","DOI:10.1007/s12559-017-9503-3"],"references":["313910414_Lexicon-enhanced_sentiment_analysis_framework_using_rule-based_classification_scheme","305483497_SentiHealth_creating_health-related_sentiment_lexicon_using_hybrid_approach","305473707_Leveraging_Cross-Domain_Social_Media_Analytics_to_Understand_TV_Topics_Popularity","301216588_Using_Neural_Word_Embeddings_to_Model_User_Behavior_and_Detect_User_Segments","339940261_SenticNet_4_a_semantic_resource_for_sentiment_analysis_based_on_conceptual_primitives","313456493_Convolutional_MKL_Based_Multimodal_Emotion_Recognition_and_Sentiment_Analysis","308964537_A_Unified_Framework_for_Creating_Domain_Dependent_Polarity_Lexicons_from_User_Generated_Reviews","303358273_Sentiment_Analysis_and_Social_Cognition_Engine_SEANCE_An_automatic_tool_for_sentiment_social_cognition_and_social-order_analysis","303293471_Contextual_Sentiment_Analysis_for_Social_Media_Genres","298799608_Affective_Computing_and_Sentiment_Analysis"]}