{"id":"319445854_Local-Consistency_Web_Services_Composition_Approach_Based_On_Harmony_Search","abstract":"Designing of the composite services raises many challenges, as the huge number of equivalent ones and the complexity of user’s requirements. Thus, in order to achieve user satisfaction and problem resolution, we have to choose among a set of functionally equivalent services. So, the composition can be regarded as a valued constraint satisfaction optimization problem, which involved a valuation of requirements attributes. Next, the skyline operator was applied to our search space. Skyline is an operator based on Pareto dominance, used to help in reducing the size of a search space for many applications such as web service composition. However, this technique has some drawbacks such as the important number of solutions which it couldn’t, usually, consider all users’ preferences or context. In this paper, we propose a new approach based on local consistency reinforcement methods (node and arc-consistency), to enhance the skyline approach and to reach the user needs. The idea is to keep only the highest service quality in the skyline set. Then, the Harmony Search algorithm adopted to catch an optimal or near-optimal composition. The efficiency of these algorithms is empirically studied, showing the capacity of our approach in reducing skyline size and keeping only the personalized services.","authors":["Hela Fekih","Mtibaa Sabri","Sadok Bouamama"],"meta":["December 2017Procedia Computer Science 112:1102-1111","DOI:10.1016/j.procs.2017.08.135","Project: MIND for ROC : distributed nature inspired  Metaheuristics  for Reasoning and optimization under constraints"],"references":["312962747_User-Centric_Web_Services_Composition_Approach_Based_on_Swarm_Intelligence","275877828_Multilevel_analysis_for_agent-based_service_composition","271129918_Ontology_Based_User-centric_Service_Environment_for_Context_Aware_IoT_Services","269309102_User-centric_service_environment_for_context_aware_service_mash-up","313627189_Valued_constraint_satisfaction_problems_hard_and_easy_problems","290437878_Context-aware_QoS_Prediction_for_Web_Service_Recommendation_and_Selection","286105663_A_support-based_algorithm_for_the_Bi-objective_pareto_constraint","261309321_A_Quantitative_and_Qualitative_Approach_for_NFP-Aware_Web_Service_Composition","261309307_Towards_an_Automata-Based_Semantic_Web_Services_Composition_Method_in_Context-Aware_Environment","258333818_Context-aware_Service_Composition_Framework_in_Web-enabled_Building_Automation_System"]}