{"id":"319470928_Adaptive_resource_provisioning_method_using_application-aware_machine_learning_based_on_job_history_in_heterogeneous_infrastructures","abstract":"With the remarkable growth in cloud computing, computing resources can be manipulated on-demand in most scientific fields. This enables scientists to strategically select their experimental environment. Since it is hard to offer cloud resources in accordance with application characteristics, efficient resource provisioning methods are needed. This paper proposes an adaptive resource provisioning method using an application-aware machine learning technique that is based on the job history in heterogeneous infrastructures. The proposed resource provisioning method is built on two main concepts. First, it provides application-aware resource provisioning through the profiling of scientific application in a heterogeneous computing infrastructure. A resource provisioning model uses the resource usage profiles of scientific applications and job history data in heterogeneous computing infrastructures. In addition to the multilayer perceptron machine learning method, an error back-propagation approach is applied to analyze job history to re-learn the error of the output value. Second, it offers an adaptive resource scaling that is invoked by the availability of resource changes. An adaptive resource management method results in an enhancement of the overall balance between the performance and utilization of a system. For the experiments with the two CPU-intensive applications according to the method, a heterogeneous infrastructure comprising clusters and cloud environments is used. Experimental results indicate that the use of the proposed method can gratify user requests (cost and execution time) regarding its application and enhance resource usage effectiveness.","authors":["Jieun Choi","Yoonhee Kim"],"meta":["December 2017Cluster Computing 20(12)","DOI:10.1007/s10586-017-1148-1"],"references":["286713560_A_Learning-based_Selection_for_Portfolio_Scheduling_of_Scientific_Applications_on_Heterogeneous_Computing_Systems","279169486_VM_auto-scaling_methods_for_high_throughput_computing_on_hybrid_infrastructure","265611546_A_Review_of_Auto-scaling_Techniques_for_Elastic_Applications_in_Cloud_Environments","263400243_Fuzzy_Logic-driven_Virtual_Machine_Resource_Evaluation_Method_for_Cloud_Provisioning_Service","321926665_Cloud_Computing_Security","308811028_A_Job_Dispatch_Optimization_Method_on_Cluster_and_Cloud_for_Large-Scale_High-Throughput_Computing_Service","285976422_Cloud_Computing_Security","277478268_Multi-criteria_and_satisfaction_oriented_scheduling_for_hybrid_distributed_computing_infrastructures","272990602_HTCaaSHigh_Throughput_Computing_as_a_Service_in_Supercomputing_Environment","269705338_Too_Big_to_Ignore","261092247_Autonomic_scaling_of_Cloud_Computing_resources_using_BN-based_prediction_models","229072395_SpeQuloS_A_QoS_Service_for_BoT_Applications_Using_Best_Effort_Distributed_Computing_Infrastructures","262560602_Cloud_Resource_Autoscaling_System_based_on_Hidden_Markov_Model_HMM","242563984_Introduction_to_Computational_Biology","225644006_Condor-G_A_Computation_Management_Agent_for_Multi-Institutional_Grids"]}