{"id":"319543736_A_Survey_of_Potential_Security_Issues_in_Existing_Wireless_Sensor_Network_Protocols","abstract":"Abstract:\nThe increasing pervasiveness of Wireless Sensor Networks (WSNs) in diverse application domains including critical infrastructure systems, sets an extremely high security bar in the design of WSN systems to exploit their full benefits, increasing trust while avoiding loss. Nevertheless, a combination of resource restrictions and the physical exposure of sensor devices inevitably cause such networks to be vulnerable to security threats, both external and internal. While several researchers have provided a set of open problems and challenges in WSN security and privacy, there is a gap in the systematic study of the security implications arising from the nature of existing communication protocols in WSNs. Therefore, we have carried out a deep-dive into the main security mechanisms and their effects on the most popular protocols and standards used in WSN deployments i.e. IEEE 802.15.4, B-MAC, 6LoWPAN, RPL, BCP, CTP, and CoAP, where potential security threats and existing countermeasures are discussed at each layer of WSN stack. This work culminates in a deeper analysis of network layer attacks deployed against the RPL routing protocol. We quantify the impact of individual attacks on the performance of a network using the Cooja network simulator. Finally, we discuss new research opportunities in network layer security and how to use Cooja as a benchmark for developing new defenses for WSN systems.","authors":["Ivana Tomić","Julie McCann"],"meta":["September 2017IEEE Internet of Things Journal PP(99)","DOI:10.1109/JIOT.2017.2749883","Project: PETRAS"],"references":["310661982_Simulation_of_Attacks_for_Security_in_Wireless_Sensor_Network","304187734_Securing_the_Backpressure_Algorithm_for_Wireless_Networks","315302131_A_Survey_on_Internet_of_Things_Architecture_Enabling_Technologies_Security_and_Privacy_and_Applications","314921119_Topology_Authentication_in_RPL","313755311_TinySec_A_link_layer_security_architecture_for_wireless_sensor_networks","313241980_Cyber-physical_security_of_a_smart_grid_infrastructure","299847819_Improvement_of_approach_to_detect_sinkhole_attacks_in_Wireless_Sensor_Networks","286307668_Kinesis_A_security_incident_response_and_prevention_system_for_wireless_sensor_networks","285429345_LESS_Lightweight_Establishment_of_Secure_Session_A_Cross-Layer_Approach_Using_CoAP_and_DTLS-PSK_Channel_Encryption","285421585_Enhancing_RPL_Resilience_Against_Routing_Layer_Insider_Attacks"]}