{"id":"319597814_Mison_a_fast_JSON_parser_for_data_analytics","abstract":"The growing popularity of the JSON format has fueled increased interest in loading and processing JSON data within analytical data processing systems. However, in many applications, JSON parsing dominates performance and cost. In this paper, we present a new JSON parser called Mison that is particularly tailored to this class of applications, by pushing down both projection and filter operators of analytical queries into the parser. To achieve these features, we propose to deviate from the traditional approach of building parsers using finite state machines (FSMs). Instead, we follow a two-level approach that enables the parser to jump directly to the correct position of a queried field without having to perform expensive tokenizing steps to find the field. At the upper level, Mison speculatively predicts the logical locations of queried fields based on previously seen patterns in a dataset. At the lower level, Mison builds structural indices on JSON data to map logical locations to physical locations. Unlike all existing FSM-based parsers, building structural indices converts control flow into data flow, thereby largely eliminating inherently unpredictable branches in the program and exploiting the parallelism available in modern processors. We experimentally evaluate Mison using representative real-world JSON datasets and the TPC-H benchmark, and show that Mison produces significant performance benefits over the best existing JSON parsers; in some cases, the performance improvement is over one order of magnitude.","authors":["Yinan Li","Nikos Katsipoulakis","Badrish Chandramouli","Jonathan Goldstein"],"meta":["June 2017Proceedings of the VLDB Endowment 10(10):1118-1129","DOI:10.14778/3115404.3115416"],"references":["293103599_Trill_A_high-performance_incremental_query_processor_for_diverse_analytics","276535565_Trill","313432480_XML_Prefiltering_as_a_String_Matching_Problem","312455488_Resilient_distributed_datasets_A_fault-tolerant_abstraction_for_in-memory_cluster_computing","304021415_Automatic_Generation_of_Normalized_Relational_Schemas_from_Nested_Key-Value_Data","290471147_Spark_SQL","283695984_Dremel","266656624_Stormtwitter","266656499_JSON_data_management-Supporting_schema-less_development_in_RDBMS","266656412_Parallel_in-situ_data_processing_with_speculative_loading"]}