{"id":"319535815_Applying_self-regulated_learning_microanalysis_to_study_musicians'_practice","abstract":"This article describes the development of a music practice microanalysis protocol that is based on the three-phase model of self-regulated learning (i.e., Forethought, Performance and Self-Reflection). Up until now, most studies on music practice have tended to focus on behavioural aspects. The expanded view presented here outlines a technique for mapping the types of behaviours (actions), cognition (thoughts), and affect (feelings) that can help focus musicians’ practice. To explain the technique, we describe the practice of two first year Bachelor of Music students studying at a prominent University music school who are compared at three time points across one semester as they prepare an étude for a performance exam. These case studies demonstrate two broadly contrasting self-regulated learning profiles of how microanalysis can be used to cue students to think about what they are doing and then reflect critically on the strategies they can use to improve their playing. As a technique, microanalysis can inform educational interventions aimed at breaking the cycle of habits that typify musical practice by encouraging musicians to become more behaviourally, metacognitively, and motivationally involved in their own learning.","authors":["Gary E. McPherson","Margaret S. Osborne","Paul Evans","Peter Miksza"],"meta":["August 2017Psychology of Music in press(2012)","DOI:10.1177/0305735617731614","Project: Optimising Musical Expertise "],"references":["286487521_Self-Regulation_of_Musical_Learning","284604049_Differences_in_self-regulatory_processes_among_students_studying_science_A_microanalytic_investigation","326568871_Connecting_Self-regulated_Learning_and_Performance_with_Instruction_Across_High_School_Content_Areas","326563848_Developing_Self-regulated_Musicians","323255270_Assessing_self-regulated_learning_using_microanalytic_methods","321874144_Applying_Self-Determination_and_Self-Regulation_Theories_for_Optimizing_Music_Performance","321873981_Self-regulated_learning_in_music_practice_and_performance","286037723_Motivating_Self-Regulated_Problem_Solvers","285831994_Self-Efficacy_The_Exercise_of_Control","285034411_Instrumental_performance_expertise_and_amount_of_practice_among_instrumental_students_in_a_conservatoire"]}