{"id":"319596811_Seeing_Like_the_Fed_Culture_Cognition_and_Framing_in_the_Failure_to_Anticipate_the_Financial_Crisis_of_2008","abstract":"One of the puzzles about the financial crisis of 2008 is why regulators, particularly the Federal Open Market Committee (FOMC), were so slow to recognize the impending collapse of the financial system and its broader consequences for the economy. We use theory from the literature on culture, cognition, and framing to explain this puzzle. Consistent with recent work on “positive asymmetry,” we show how the FOMC generally interpreted discomforting facts in a positive light, marginalizing and normalizing anomalous information. We argue that all frames limit what can be understood, but the content of frames matters for how facts are identified and explained. We provide evidence that the Federal Reserve’s primary frame for making sense of the economy was macroeconomic theory. The content of macroeconomics made it difficult for the FOMC to connect events into a narrative reflecting the links between foreclosures in the housing market, the financial instruments used to package the mortgages into securities, and the threats to the larger economy. We conclude with implications for the sociological literatures on framing and cognition and for decision-making in future crises.","authors":["Neil Fligstein","Jonah Stuart Brundage","Michael Schultz"],"meta":["September 2017American Sociological Review 82(3):000312241772824","DOI:10.1177/0003122417728240","Project: The Banks Did It: The Rise and Fall of the Mortgage Securitization Industry"],"references":["277436458_Financialization_and_US_Income_Inequality_1970-2008_1","345889010_Hidden_in_Plain_Sight_The_Social_Structure_of_Irrelevance","335040703_The_Evolution_of_Macro_Models_at_the_Federal_Reserve_Board","333970569_Capitalizing_on_Crisis_The_Political_Origins_of_the_Rise_of_Finance","323321286_The_Anatomy_of_the_Mortgage_Securitization_Crisis","308779678_The_dialogic_imagination_four_essays","303100964_Probabilistic_topic_models_Handb_Latent_Semant","285255379_Communicative_Imperatives_in_Central_Banks","279598071_The_State_of_Macroeconomics","278224741_Global_microstructures_The_virtual_societies_of_financial_markets"]}