{"id":"319534533_Properties_of_Kinetic_Transition_Networks_for_Atomic_Clusters_and_Glassy_Solids","abstract":"A database of minima and transition states corresponds to a network where the minima represent nodes and the transition states correspond to edges between the pairs of minima they connect via steepest-descent paths. Here we construct networks for small clusters bound by the Morse potential for a selection of physically relevant parameters, in two and three dimensions. The properties of these unweighted and undirected networks are analysed to examine two features: whether they are small-world, where the shortest path between nodes involves only a small number or edges; and whether they are scale-free, having a degree distribution that follows a power law. Small-world character is present, but statistical tests show that a power law is not a good fit, so the networks are not scale-free. These results for clusters are compared with the corresponding properties for the molecular and atomic structural glass formers ortho-terphenyl and binary Lennard-Jones. These glassy systems do not show small-world properties, suggesting that such behaviour is linked to the structure-seeking landscapes of the Morse clusters.","authors":["John William Roger Morgan","Dhagash Mehta","David J. Wales"],"meta":["September 2017Physical Chemistry Chemical Physics 19(37)","DOI:10.1039/C7CP03346J"],"references":["317376097_Energy_landscapes_for_machine_learning","305313042_Dynamics_of_a_Molecular_Glass_Former_Energy_Landscapes_for_Diffusion_in_Ortho-Terphenyl","304993934_Kinetic_Transition_Networks_for_the_Thomson_Problem_and_Smale's_Seventh_Problem","274041799_Effect_of_potential_energy_topography_on_dynamics_and_phase_behaviour_of_clusters","269178605_Energy_Landscapes_Folding_Mechanisms_and_Kinetics_of_RNA_Tetraloop_Hairpins","315570714_Energy_Landscapes_for_Machine_Learning","307555288_On_Measures_of_Location_and_Dispersion_and_Tests_of_Hypotheses_in_a_Pare_to_Population","292214672_Energy_Landscapes_From_Clusters_to_Biomolecules","283617410_Emergence_of_Scaling_in_Random_Networks","280566512_Networks_An_Introduction"]}