{"id":"319599843_A_novel_embryonics_electronic_cell_array_structure_based_on_functional_decomposition_and_circular_removal_self-repair_mechanism","abstract":"Along with the continuous development of aviation detection and deep sea exploration technology, electronic equipment will face with increasingly complicated and harsh natural environment. Traditional circuit fault-repair methods based on redundant fault-tolerant technology are easy to implement. However, it has excessive hardware consumption and dissatisfied environmental adjustment. For this reason, a novel structure of embryonics electronic cell array based on functional decomposition and circular removal self-repair mechanism is designed, which can implement digital circuit with fault self-repair capacity, so as to gain higher reliability with lesser hardware resource consumption. The general structure and all submodules of the designed embryonics electronic cell array are designed and simulated. A new circular removal self-repair mechanism technology is put forward based on characteristics of the designed embryonics electronic cell array. Through successful simulation of a typical digital circuit implemented with the designed embryonics electronic cell array and self-repair strategy, feasibility of the proposed theory is verified. From the perspective of array’s reliability and hardware resource consumption, a comparison between the designed embryonics electronic cell array and the traditional embryonics electronic cell array is completed by simulation. The comparison results show that the proposed embryonics electronic cell array and self-repair mechanism not only ensure higher reliability of functional circuit but also effectively reduce hardware resource consumption of functional circuit.","authors":["Tao Wang","Jinyan Cai","Yafeng Meng"],"meta":["September 2017Advances in Mechanical Engineering 9(9):168781401772008","DOI:10.1177/1687814017720080"],"references":["268212173_A_Novel_Embryonics_Electronic_Cell_Array_Structure","254003507_HoneyComb_An_Application-Driven_Online_Adaptive_Reconfigurable_Hardware_Architecture","290087023_eTissue_An_adaptive_reconfigurable_bio-inspired_hardware_architecture","290021736_Guidelines_to_fault-tolerant_strategy_selection_in_embryonics_hardware_based_on_reliability_analysis","289078441_Online_self-fault_diagnosis_and_fault_tolerant_method_for_three-dimensional_reconfigurable_array","268196252_Method_to_self-repairing_reconfiguration_strategy_selection_of_embryonic_cellular_array_on_reliability_analysis","261206678_Bus-Structure-Based_Embryonic_Bio-inspired_Hardware_Technology","260655910_A_Hierarchical_Self-Repairing_Architecture_for_Fast_Fault_Recovery_of_Digital_Systems_Inspired_From_Paralogous_Gene_Regulatory_Circuits","252020919_ETissue_A_bio-inspired_match-based_reconfigurable_hardware_architecture_supporting_hierarchical_self-healing_and_self-evolution","232624990_Prokaryotic_Bio-Inspired_System"]}