{"id":"319555447_Knowledge_diffusion_of_dynamical_network_in_terms_of_interaction_frequency","abstract":"In this paper, we present a knowledge diffusion (SKD) model for dynamic networks by taking into account the interaction frequency which always used to measure the social closeness. A set of agents, which are initially interconnected to form a random network, either exchange knowledge with their neighbors or move toward a new location through an edge-rewiring procedure. The activity of knowledge exchange between agents is determined by a knowledge transfer rule that the target node would preferentially select one neighbor node to transfer knowledge with probability p according to their interaction frequency instead of the knowledge distance, otherwise, the target node would build a new link with its second-order neighbor preferentially or select one node in the system randomly with probability 1 − p. The simulation results show that, comparing with the Null model defined by the random selection mechanism and the traditional knowledge diffusion (TKD) model driven by knowledge distance, the knowledge would spread more fast based on SKD driven by interaction frequency. In particular, the network structure of SKD would evolve as an assortative one, which is a fundamental feature of social networks. This work would be helpful for deeply understanding the coevolution of the knowledge diffusion and network structure.","authors":["Jian-Guo Liu","Qing Zhou","Qiang Guo","Zhen-Hua Yang"],"meta":["December 2017Scientific Reports 7(1)","DOI:10.1038/s41598-017-11057-8"],"references":["312410346_Social_activity-travel_dynamics_with_core_contacts_evidence_from_a_two-wave_personal_network_data","308390059_Modeling_Random_Forwarding_Actions_for_Information_Diffusion_over_Mobile_Social_Networks","282628990_The_influence_of_social_media_interactions_on_consumer-brand_relationships_A_three-country_study_of_brand_perceptions_and_marketing_behaviors","310812041_SISL_and_SIRL_Two_knowledge_dissemination_models_with_leader_nodes_on_cooperative_learning_networks","306088829_Social_influence_modeling_using_information_theory_in_mobile_social_networks","305488779_Dynamics_of_information_diffusion_and_its_applications_on_complex_networks","293800591_Diffusion_of_nanotechnology_knowledge_in_Turkey_and_its_network_structure","292345444_Identifying_the_main_paths_of_information_diffusion_in_online_social_networks","284017913_Evolutionary_knowledge_games_in_social_networks","282625286_Collaboration_reputation_for_trustworthy_Web_service_selection_in_social_networks"]}