{"id":"319583654_A_Secure_ECC-based_Privacy_Preserving_Data_Aggregation_Scheme_for_Smart_Grids","abstract":"Development of Smart Grid and deployment of smart meters in large scale has raised a lot of concerns regarding customers’ privacy. Consequently, several schemes have been proposed to overcome the above mentioned issue. These schemes mainly rely on data aggregation as a method of protecting users’ privacy from the grid operators. However, the main problem with most of these schemes is the fact that they require a large amount of processing power at the meter side. This, together with the fact that smart meters don't usually have a powerful processor, can cause the unavailability of smart meter data at the required time for operators of the grid, and at the same time prevents smart meters from performing their other duties, such as managing the home area network. In this paper, we propose an efficient privacy preserving data aggregation scheme, based on elliptic curves. In our scheme, each smart meter signs its encrypted data and sends it to the aggregator. After receiving the data, the aggregator verifies the incoming messages and aggregates them, without the need to decrypt the data received from each smart meter. The aggregator signs the aggregated messages and sends it to the operation center. At the end, the smart meters’ data are obtained and verified by the operation center. In addition to providing efficient computation cost, for the users, our protocol also satisfies the security requirements of smart grid data aggregation schemes. We provide security analysis of the proposed scheme as well as comparisons to show the efficiency of our scheme on computation and communication overheads.","authors":["Erfaneh Vahedi","Majid Bayat","M.R. Pakravan","Mohammad Reza Aref"],"meta":["September 2017Computer Networks 129","DOI:10.1016/j.comnet.2017.08.025"],"references":["260711226_Privacy-Enhanced_Data_Aggregation_Scheme_Against_Internal_Attackers_in_Smart_Grid","224710873_PDA_Privacy-Preserving_Data_Aggregation_in_Wireless_Sensor_Networks","221354138_Evaluating_2-DNF_Formulas_on_Ciphertexts","221348062_Public-Key_Cryptosystems_Based_on_Composite_Degree_Residuosity_Classes","221051965_Privacy-Friendly_Energy-Metering_via_Homomorphic_Encryption","282634973_Preserving_Privacy_and_Efficiency_in_Data_Communication_and_Aggregation_for_AMI_Network","260648150_A_Decentralized_Security_Framework_for_Data_Aggregation_and_Access_Control_in_Smart_Grids","258792218_Privacy-Preserving_Data_Aggregation_in_Smart_Metering_Systems_An_Overview","235648352_Insulin_inhibits_lipopolysaccharide-induced_nitric_oxide_synthase_expression_in_rat_primary_astrocytes","224189780_Secure_Information_Aggregation_for_Smart_Grids_Using_Homomorphic_Encryption","221224627_Attacking_elliptic_curve_cryptosystems_with_special-purpose_hardware"]}