{"id":"319501484_WRPN_Wide_Reduced-Precision_Networks","abstract":"For computer vision applications, prior works have shown the efficacy of reducing numeric precision of model parameters (network weights) in deep neural networks. Activation maps, however, occupy a large memory footprint during both the training and inference step when using mini-batches of inputs. One way to reduce this large memory footprint is to reduce the precision of activations. However, past works have shown that reducing the precision of activations hurts model accuracy. We study schemes to train networks from scratch using reduced-precision activations without hurting accuracy. We reduce the precision of activation maps (along with model parameters) and increase the number of filter maps in a layer, and find that this scheme matches or surpasses the accuracy of the baseline full-precision network. As a result, one can significantly improve the execution efficiency (e.g. reduce dynamic memory footprint, memory bandwidth and computational energy) and speed up the training and inference process with appropriate hardware support. We call our scheme WRPN - wide reduced-precision networks. We report results and show that WRPN scheme is better than previously reported accuracies on ILSVRC-12 dataset while being computationally less expensive compared to previously reported reduced-precision networks.","authors":["Asit Mishra","Eriko Nurvitadhi","Jeffrey J Cook","Debbie Marr"],"meta":["September 2017"],"references":["313645102_Incremental_Network_Quantization_Towards_Lossless_CNNs_with_Low-Precision_Weights","305196650_Going_deeper_with_convolutions","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","319770111_Improving_the_speed_of_neural_networks_on_CPUs","314092488_Low-Precision_Batch-Normalized_Activations","313264818_Can_FPGAs_Beat_GPUs_in_Accelerating_Next-Generation_Deep_Neural_Networks","311791725_FINN_A_Framework_for_Fast_Scalable_Binarized_Neural_Network_Inference","311430286_Trained_Ternary_Quantization","308832832_Accelerating_Deep_Convolutional_Networks_using_low-precision_and_sparsity","308277088_XNOR-Net_ImageNet_Classification_Using_Binary_Convolutional_Neural_Networks"]}