{"id":"319596994_Dynamic_Policies_in_Internet_of_Things_Enforcement_and_Synchronization","abstract":"Security and privacy represent critical issues for a wide adoption of IoT technologies both by industries and people in their every-day life. Besides, the complexity of an IoT system’s management resides in the presence of heterogeneous devices, which communicate by means of different protocols and provide information belonging to various application domains. Hence, adequate policies must be correctly distributed and applied to the information made available by the IoT network to secure the data themselves and to regulate the access to the managed resources over the whole IoT system. Policies mainly involve the access to resources and are usually established by system administrators in accordance with the rules of each specific domain. Since IoT concerns multiple application fields and often wide areas, a centralized solution which manages all the required policies would not be neither efficient nor scalable. Therefore, in this paper, a distributed middleware overlying the IoT network is proposed and integrated with a synchronization system for guaranteeing the correct distribution, update, and application of the policies across the entire IoT environment in real-time. Such a distribution and synchronization system has been developed within a policy enforcement framework. The presented solution has been validated by means of a simple yet real prototype; the analyzed metrics regard delay, overhead and robustness of the proposed enforcement and synchronization framework.","authors":["Sabrina Sicari","Alessandra Rizzardi","Daniele Miorandi","Alberto Coen-Porisini"],"meta":["September 2017IEEE Internet of Things Journal PP(99):1-1","DOI:10.1109/JIOT.2017.2749604"],"references":["323870808_REATO_REActing_TO_denial_of_service_attacks_in_the_Internet_of_Things","306421089_Security_policy_enforcement_for_networked_smart_objects","295397698_A_secure_and_quality-aware_prototypical_architecture_for_the_Internet_of_Things","281777826_Networked_Smart_Objects_Moving_Data_Processing_Closer_to_the_Source","277727179_Policy-Carrying_Data_A_Step_Towards_Transparent_Data_Sharing","271681772_Security_of_the_Internet_of_Things_Perspectives_and_challenges","270107935_Security_privacy_and_trust_in_Internet_of_Things_The_road_ahead","266850927_A_Security-and_Quality-aware_System_Architecture_for_Internet_of_Things","326435743_A_Meta-Control_Architecture_for_Orchestrating_Policy_Enforcement_Across_Heterogeneous_Information_Sources","306274709_A_NFP_model_for_internet_of_things_applications"]}