{"id":"319582690_Session-based_item_recommendation_in_e-commerce_on_short-term_intents_reminders_trends_and_discounts","abstract":"Many e-commerce sites present additional item recommendations to their visitors while they navigate the site, and ample evidence exists that such recommendations are valuable for both customers and providers. Academic research often focuses on the capability of recommender systems to help users discover items they presumably do not know yet and which match their long-term preference profiles. In reality, however, recommendations can be helpful for customers also for other reasons, for example, when they remind them of items they were recently interested in or when they point site visitors to items that are currently discounted. In this work, we first adopt a systematic statistical approach to analyze what makes recommendations effective in practice and then propose ways of operationalizing these insights into novel recommendation algorithms. Our data analysis is based on log data of a large e-commerce site. It shows that various factors should be considered in parallel when selecting items for recommendation, including their match with the customer’s shopping interests in the previous sessions, the general popularity of the items in the last few days, as well as information about discounts. Based on these analyses we propose a novel algorithm that combines a neighborhood-based scheme with a deep neural network to predict the relevance of items for a given shopping session.","authors":["Dietmar Jannach","Malte Ludewig","Lukas Lerche"],"meta":["December 2017User Modeling and User-Adapted Interaction 27(6)","DOI:10.1007/s11257-017-9194-1"],"references":["316857318_Factored_MDPs_for_Detecting_Topics_of_User_Sessions","312635816_Using_Shortlists_to_Support_Decision_Making_and_Improve_Recommender_System_Performance","301432391_I_like_to_explore_sometimes","332842200_Personalized_Pricing_and_Quality_Differentiation","319277513_When_Recurrent_Neural_Networks_meet_the_Neighborhood_for_Session-Based_Recommendation","317160564_Determining_characteristics_of_successful_recommendations_from_log_data_a_case_study","308161218_Introduction_to_information_retrieval_chapt","307572885_Recommendations_with_a_Purpose","305277306_On_the_Value_of_Reminders_within_E-Commerce_Recommendations","305082586_A_Dynamic_Recurrent_Model_for_Next_Basket_Recommendation"]}