{"id":"319522558_Sparse_coefficient-based_k-nearest_neighbor_classification","abstract":"K-nearest neighbor rule (KNN) and sparse representation (SR) are widely used algorithms in pattern classification. In this article, we propose two new nearest neighbor classification methods, in which the novel weighted voting methods are developed for making classification decisions on the basis of sparse coefficients in the SR. Since the sparse coefficients can well reflect the neighborhood structure of data, we mainly utilize them to design classifier in the proposed methods. One proposed method is called the coefficient-weighted k-nearest neighbor classifier (CWKNN), which adopts sparse coefficients to choose k nearest neighbors of a query sample and then uses the coefficients corresponding to the chosen neighbors as their weights for classification. Another new method is the residual-weighted knearest neighbor classifier (RWKNN). In the RWKNN, k nearest neighbors of a query sample are first determined by sparse coefficients, and then we design a novel residual-based weighted voting method for the KNN classification. The extensive experiments are carried out on many UCI and KEEL data sets, and the experimental results show that the proposed methods perform well. OAPA","authors":["Hongxing Ma","Jianping Gou","Xili Wang","Jia Ke"],"meta":["August 2017IEEE Access 5","DOI:10.1109/ACCESS.2017.2739807"],"references":["313958425_Improving_sparsity_of_coefficients_for_robust_sparse_and_collaborative_representation-based_image_classification","286892440_Improving_the_k-nearest_neighbour_ruleusing_geometrical_neighbourhoods_and_manifold-based_metrics","284710455_Feature_Selection_and_Predictors_of_Falls_with_Foot_Force_Sensors_Using_KNN-Based_Algorithms","311254792_Discriminative_sparsity_preserving_graph_embedding","308340072_A_new_k-harmonic_nearest_neighbor_classifier_based_on_the_multi-local_means","304824205_Regression_Shrinkage_and_Selection_via_the_LASSO","288855597_A_Proposal_for_Local_k_Values_for_k-Nearest_Neighbor_Rule","285431565_Sparse_Representation-Based_Nearest_Neighbor_Classifiers_for_Hyperspectral_Imagery","285104963_Top_10_algorithms_in_data_mining","284048721_For_Most_Large_Underdetermined_Systems_of_Linear_Equations_the_Minimal_L1-norm_Solution_is_also_the_Sparsest_Solution"]}