{"id":"319529366_Emerging_NVM_A_Survey_on_Architectural_Integration_and_Research_Challenges","abstract":"There has been a surge of interest in Non-Volatile Memory (NVM) in recent years. With many advantages, such as density and power consumption, NVM is carving out a place in the memory hierarchy and may eventually change our view of computer architecture. Many NVMs have emerged, such as Magnetoresistive random access memory (MRAM), Phase Change random access memory (PCM), Resistive random access memory (ReRAM), and Ferroelectric random access memory (FeRAM), each with its own peculiar properties and specific challenges. The scientific community has carried out a substantial amount of work on integrating those technologies in the memory hierarchy. As many companies are announcing the imminent mass production of NVMs, we think that it is time to have a step back and discuss the body of literature related to NVM integration. This paper surveys state-of-the-art work on integrating NVM into the memory hierarchy. Specially, we introduce the four types of NVM, namely, MRAM, PCM, ReRAM, and FeRAM, and investigate different ways of integrating them into the memory hierarchy from the horizontal or vertical perspectives. Here, horizontal integration means that the new memory is placed at the same level as an existing one, while vertical integration means that the new memory is interleaved between two existing levels. In addition, we describe challenges and opportunities with each NVM technique.","authors":["Jalil Boukhobza","Stéphane Rubini","Renhai Chen","Zili Shao"],"meta":["January 2018ACM Transactions on Design Automation of Electronic Systems 23(2)","DOI:10.1145/3131848"],"references":["318305540_Flash_Memory_Integration_Performance_and_Energy_Issues","314374958_An_efficient_STT-RAM_last_level_cache_architecture_for_GPUs","312459128_Memristor_-_The_missing_circuit_element","312288476_Bridging_the_IO_performance_gap_for_big_data_workloads_A_new_NVDIMM-based_approach","311464921_Use_ECP_not_ECC_for_hard_failures_in_resistive_memories","311344188_Data_manipulation_techniques_to_reduce_phase_change_memory_write_energy","310673355_Feasibility_exploration_of_nvm_based_i-cache_through_mshr_enhancements","310671868_Improving_read_performance_of_phase_change_memories_via_write_cancellation_and_write_pausing","309143111_LAP_Loop-Block_Aware_Inclusion_Properties_for_Energy-Efficient_Asymmetric_Last_Level_Caches","308867481_Amnesic_cache_management_for_non-volatile_memory"]}