{"id":"319562246_Analysing_the_Digital_Transformations_Territories_Frames_and_Uses","abstract":"While digital space is explained in itself by computer science, important questions for the humanities - such as how the Digital affects human behaviour, or how it impacts society and economy – are outside its scope. Different disciplines have provided answers, but there has been no integrated concept bridging these insights. This paper proposes a concept to explain the Digital by integrating insights from computer science, media studies, sociology and philosophy. The resulting framework suggests that the Digital consists of characteristic dynamics, spaces and mechanisms. After explaining the concept of Digital Machine, an ontological framework consisting of four main fields of analysis - Transformation, Territory, Frame and Use - is proposed. With Transformations and Territories, the processes of the Digital and its wider socio-political and economic dimensions are analysed. Within Frames, human action and interpretation happen. In the Uses of the Digital, consumption has become a form of production, and User’s uses can be analysed in the differential between the intents of a Digital Machine and the interpretations of its users. To conclude, Anders’ concept of Promethean slope is taken to explain the increasing problems of humans to distinguish the actions of algorithms from human action, and future implications of the evolution of the Digital are discussed. Finally, routes for digital innovation and recommendations for design practice are proposed.","authors":["Mario Gagliardi"],"meta":["July 2017Design Journal, The 20(sup1):S4197-S4212","DOI:10.1080/14606925.2017.1352919"],"references":["289839697_Young_Canadians_in_a_Wired_World_Phase_III_Experts_or_Amateurs_Gauging_Young_Canadians_Digital_Literacy_Skills","283109084_Facebook_friends_subjective_well-being_social_support_and_personality","283097087_Follow_me_and_like_my_beautiful_selfies_Singapore_teenage_girls'_engagement_in_self-presentation_and_peer_comparison_on_social_media","303990629_On_Machines","299028542_From_talking_and_listening_robots_to_intelligent_communicative_machines","268685691_Organisation_und_Management","262256710_Here's_my_cert_so_trust_me_maybe_Understanding_TLS_errors_on_the_web","261969272_You_Are_Not_a_Gadget","258847182_Internet_advertising_effectiveness","245782854_Content_analysis_of_visual_images","242530010_Software_Development_and_Reality_Construction","243776667_Die_Gesellschaft_Der_Gesellschaft","235674512_The_Practice_of_Everyday_Life","232986354_I_A_Churchman's_Guide_to_Marshall_McLuhan_1","228084763_The_Philosophy_of_Software_Code_and_Mediation_in_the_Digital_Age"]}