{"id":"319525771_Impact_of_Personality_on_Task_Selection_in_Crowdsourcing_Software_Development_A_Sorting_Approach","abstract":"Growing demand for software has attracted the attention of the software development industry. Crowdsourced software development (CSD) has provided a new method for the software industry to produce quality software based on an open-call format. Selecting an appropriate task to develop (developer-end) or evaluate (platform-end) is one of the primary problems in this type of open-call format. Receiving or assigning an improper task to an improper crowdsource (CS) developer does not only decrease the quality of the software deliverables, but also causes overburden on both the platform and the developers. To solve this problem, sorting the tasks based on the developers’ human characteristics may increase task relevancy for developers, which can accelerate efficiency and lessen complexity. Thus, this study has conducted an empirical experiment to measure the influence of personality on task selection based on the important characteristics of a task: money, time, and type. A total of 83 students from the University of Sindh (UOS) voluntarily participated in four different short-duration rounds of task development using the developed crowdsource platform. The personality types of the participants were measured based on the Myers-Briggs Type Indicator (MBTI). Additionally, a complex network technique called weighted degree centrality (WDC) was applied to identify the most suitable personality for task sorting based on money or complexity attractions (i.e., time or type). Based on the results, it can be observed that personality has a significant relationship with task selection. For instance, developers with intuitive (N) and feeling (F) personality traits are primarily focused on the time duration of a project.","authors":["Muhammad Zahid Tunio","Haiyong Luo","Wang Cong","Zhao Fang"],"meta":["September 2017IEEE Access 5(99)","DOI:10.1109/ACCESS.2017.2747660"],"references":["308940031_Acquiring_creative_requirements_from_the_crowd_Understanding_the_influences_of_individual_personality_and_creative_potential_in_Crowd_RE","303169125_A_capability_requirements_approach_for_predicting_worker_performance_in_crowdsourcing","300540615_Towards_Effective_Developer_Recommendation_in_Software_Crowdsourcing","313617892_Towards_task_recommendation_in_micro-task_markets","308826482_A_Vision_of_Crowd_Development","308361622_Developer_Recommendation_for_Crowdsourced_Software_Development_Tasks","308344201_A_Survey_of_the_Use_of_Crowdsourcing_in_Software_Engineering","303323751_Task_allocation_for_crowdsourcing_using_AI_planning","297684861_Project_Management_Software","296307849_A_Rule-Based_Model_for_Software_Development_Team_Composition_Team_Leader_Role_with_Personality_Types_and_Gender_Classification"]}