{"id":"319578153_Factors_Influencing_the_Understandability_of_Process_Models_A_Systematic_Literature_Review","abstract":"Context: Process models are key in facilitating communication in organizations and in designing process-aware information systems. Organizations are facing increasingly larger and more complex processes, which pose difficulties to the understandability of process models. The literature reports several factors that are considered to influence the understandability of process models. However, these studies typically focus on testing of a limited set of factors. A work that collects, abstracts and synthesizes an in-depth summary of the current literature will help in developing the research in this field. Objective: We conducted a systematic literature review (SLR) focusing on the empirical studies in the existing literature in order to better understand the state of the research on process model understandability, and identify the gaps and opportunities for future research. Method: We searched the studies between the years 1995 and 2015 in established electronic libraries. Out of 1066 publications retrieved initially, we selected 45 publications for thorough analysis. We identified, analyzed and categorized factors that are considered to influence the understandability of process models as studied in the literature using empirical methods. We also analyzed the indicators that are used to quantify process model understandability. Results: Our analysis identifies several gaps in the field, as well as issues of inconsistent findings regarding the effect of some factors, unbalanced emphasis on certain indicators, and methodological concerns. Conclusions: The existing research calls for comprehensive empirical studies to contribute to a better understanding of the factors of process model understandability. Our study is a comprehensive source for researchers working on the understandability of process models and related fields, and a useful guide for practitioners aiming to generate understandable process models.","authors":["Ahmet Dikici","Oktay Turetken","Onur Demirors"],"meta":["September 2017Information and Software Technology 93","DOI:10.1016/j.infsof.2017.09.001","Project: Business Process Models: Quality and Human Aspects"],"references":["319881495_The_State_of_Business_Process_Management_2016","312470401_Learningteaching_styles_in_engineering_education","311108037_The_Process_of_Process_Modeling","302924724_Guidelines_for_performing_Systematic_Literature_Reviews_in_Software_Engineering","300885901_Identifying_and_Quantifying_Visual_Layout_Features_of_Business_Process_Models","286565742_On_the_theoretical_foundations_of_research_into_the_understandability_of_business_process_models","321614141_Handbook_on_Business_Process_Management_1_Introduction_Methods_and_Information_Systems","313758286_Potential_pitfalls_of_process_modeling_Part_b","313555682_Evaluating_the_Effectiveness_of_Learning_Interventions_An_Information_Systems_Case_Study","312984568_Perceived_usefulness_perceived_ease_and_user_acceptance_of_information_technology"]}