{"id":"319562605_Self-paced_Convolutional_Neural_Network_for_Computer_Aided_Detection_in_Medical_Imaging_Analysis","abstract":"Tissue characterization has long been an important component of Computer Aided Diagnosis (CAD) systems for automatic lesion detection and further clinical planning. Motivated by the superior performance of deep learning methods on various computer vision problems, there has been increasing work applying deep learning to medical image analysis. However, the development of a robust and reliable deep learning model for computer-aided diagnosis is still highly challenging due to the combination of the high heterogeneity in the medical images and the relative lack of training samples. Specifically, annotation and labeling of the medical images is much more expensive and time-consuming than other applications and often involves manual labor from multiple domain experts. In this work, we propose a multi-stage, self-paced learning framework utilizing a convolutional neural network (CNN) to classify Computed Tomography (CT) image patches. The key contribution of this approach is that we augment the size of training samples by refining the unlabeled instances with a self-paced learning CNN. By implementing the framework on high performance computing servers including the NVIDIA DGX1 machine, we obtained the experimental result, showing that the self-pace boosted network consisntly outperformed the original network even with very scarce manual labels. The performance gain indicates that applications with limited training samples such as medical image analysis can benefit from using the proposed framework.","authors":["Xiang Li","Aoxiao Zhong","Ming Lin","Ning Guo"],"meta":["September 2017Lecture Notes in Computer Science","DOI:10.1007/978-3-319-67389-9_25","Conference: International Workshop on Machine Learning in Medical Imaging"],"references":["292996483_Deep_Convolutional_Neural_Networks_for_Computer-Aided_Detection_CNN_Architectures_Dataset_Characteristics_and_Transfer_Learning","279853657_Self-paced_Curriculum_Learning","273158007_Do_We_Need_More_Training_Data","264979485_Caffe_Convolutional_Architecture_for_Fast_Feature_Embedding","221344862_Curriculum_learning","50350394_Lung_Volumes_and_Emphysema_in_Smokers_with_Interstitial_Lung_Abnormalities","315187326_Deep_Learning_in_Medical_Image_Analysis","301732947_Guest_Editorial_Deep_Learning_in_Medical_Imaging_Overview_and_Future_Promise_of_an_Exciting_New_Technique","296476972_Lung_Pattern_Classification_for_Interstitial_Lung_Diseases_Using_a_Deep_Convolutional_Neural_Network","286794765_Dropout_A_Simple_Way_to_Prevent_Neural_Networks_from_Overfitting","279853486_Self-paced_Learning_with_Diversity","260432401_Mitosis_Detection_in_Breast_Cancer_Histology_Images_with_Deep_Neural_Networks","221620417_Self-Paced_Learning_for_Latent_Variable_Models"]}