{"id":"319500490_Quantitative_electron_backscatter_diffraction_EBSD_data_analyses_using_the_dictionary_indexing_DI_approach_Overcoming_indexing_difficulties_on_geological_materials","abstract":"Electron backscatter diffraction (EBSD) data yield plentiful information on microstructure and texture of natural as well as experimentally produced mineral and rock samples. For instance, the characterization of microstructures and textures by EBSD allows for the evaluation of phase equilibria. Furthermore, determination of the preferred orientations of crystals using EBSD yields constraints on deformation mechanisms and history of the minerals/rocks. The latter affects bulk-rock properites, for example, through the relation between lattice preferred orientation and electrical conductivity and seismic anisotropy. EBSD is also applied to advance our understanding of various phenomena such as seismic wave attenuation in the Earth deep interior and its relation to the presence of interfacial small degrees of melt fractions, or free fluid phases. In standard EBSD software solutions, the original EBSD patterns are rarely saved and indexing routines result in many artifacts, such as pseudo-symmetry or unindexed pixels at interfaces that may be misinterpreted as amorphous material, such as a melt. Here we report the first application of the dictionary indexing (DI) approach proposed by Chen et al. (2015), an alternative indexing routine, which we extended to be applicable to multiphase geologic materials. The DI method is independent of the EBSD system, and thus of the used detector/software. The DI routine generates simulated EBSD patterns for all possible crystal orientations, taking the sample composition and experimental setups into account. The resulting pattern database is called a dictionary. The experimental electron backscattering pattern (EBSP) images are indexed by comparing them to the dictionary using a dot-product algorithm. We evaluate the new DI method in comparison to standard routines and highlight advantages and disadvantages. To test and compare the DI's reliability and performance, we apply the routine to two scientifically challenging samples: (1) A nominally anhydrous (\"dry\") residual eclogite composed of garnet (cubic), clinopyroxene (monoclinic) and an amorphous melt, where the different degrees of hardness of the phases cause surface topology; and (2) a pure forsterite (olivine) polycrystalline sample produced by vacuum sintering. The acquired EBSD patterns are of low quality for the latter as a result of fast data acquisition to reduce the on-line machine time. We conclude that the new DI method is highly precise and surpasses the performance of previously available methods, while being computer time and computer memory consuming. We find that the DI method is free of pseudo-symmetry-related problems. Interpolation of data becomes obsolete and high reproducibility is obtained, which minimizes the operator impact on the final data set. The latter is often caused by applying several cleaning steps on EBSD maps with low indexing fraction. Finally, much higher scientific integrity is ensured by image collections as described above, which requires that all patterns are saved. This in turn allows later re-analyses if required. The DI routine will help to achieve more reliable information on interface properties of geological samples, including amorphous materials, and thus in the long run help to improve the accuracy of large-scale Earth mantle process models.","authors":["Katharina Marquardt (neé Hartmann)","M. De Graef","Saransh Singh","Hauke Marquardt"],"meta":["September 2017American Mineralogist 102(9):1843-1855","DOI:10.2138/am-2017-6062","Projects: Earthquake Research Institute's cooperative research program, 2016-B-05Dictionary based indexing of diffraction modalities"],"references":["301481576_Choice_of_scalar_measure_for_crystal_curvature_to_image_dislocation_substructure_in_terms_of_discrete_orientation_data"]}