{"id":"319534546_On_the_Stability_and_Instability_of_Finite_Dynamical_Systems_with_Prescribed_Interaction_Graphs","abstract":"The dynamical properties of finite dynamical systems (FDSs) have been investigated in the context of coding theoretic problems, such as network coding, and in the context of hat games, such as the guessing game and Winkler's hat game. The instability of an FDS is the minimum Hamming distance between a state and its image under the FDS, while the stability is the minimum of the reciprocal of the Hamming distance; they are both directly related to Winkler's hat game. In this paper, we study the value of the (in)stability of FDSs with prescribed interaction graphs. The first main contribution of this paper is the study of the maximum stability for interaction graphs with a loop on each vertex. We determine the maximum (in)stability for large enough alphabets and also prove some lower bounds for the Boolean alphabet. We also compare the maximum stability for arbitrary functions compared to monotone functions only. The second main contribution of the paper is the study of the average (in)stability of FDSs with a given interaction graph. We show that the average stability tends to zero with high alphabets, and we then investigate the average instability. In that study, we give bounds on the number of FDSs with positive instability (i.e fixed point free functions). We then conjecture that all non-acyclic graphs will have an average instability which does not tend to zero when the alphabet is large. We prove this conjecture for some classes of graphs, including cycles.","authors":["Maximilien Gadouleau"],"meta":["September 2017The Electronic Journal of Combinatorics 26(3)","DOI:10.37236/7296"],"references":["269721988_Reduction_and_Fixed_Points_of_Boolean_Networks_and_Linear_Network_Coding_Solvability","269417702_The_three-colour_hat_guessing_game_on_the_cycle_graphs","262273990_About_non-monotony_in_Boolean_automata_networks","251760619_Utilising_public_information_in_Network_Coding","242731015_Hat_problem_on_a_graph","47397023_Graph-Theoretical_Constructions_for_Graph_Entropy_and_Network_Coding_Based_Communications","301848264_Number_of_Fixed_Points_and_Disjoint_Cycles_in_Monotone_Boolean_Networks","283118087_Finite_Dynamical_Systems_Hat_Games_and_Coding_Theory","258345700_New_Constructions_and_Bounds_for_Winkler's_Hat_Game","220149133_Dynamics_of_Positive_Automata_Networks","220116549_Hat_Guessing_Games","47646355_An_Abstraction_Theory_for_Qualitative_Models_of_Biological_Systems","18578234_Boolean_formalization_of_genetic_control_circuits","17383444_Metabolic_Stability_and_Epigenisis_in_Randomly_Connected_Genetic_Nets"]}