{"id":"319569636_Predicting_Corporate_Financial_Failure_Using_Macroeconomic_Variables_and_Accounting_Data","abstract":"Recent studies of the prediction of corporate financial failure have taken into account many factors, mostly corresponding to financial ratios derived from firms’ annual accounts. Nevertheless, the current crisis and the consequent exponential increase in rates of insolvency have made it clear that the phenomenon of bankruptcy cannot be explained without reference to macroeconomic variables; thus, the overall condition of the economy, and not just the internal financial ratios of firms, must be addressed. In this paper, focusing on the Spanish construction sector from 1995 to 2011, we analyse selected econometric models for predicting bankruptcy, in which both macroeconomic variables and financial ratios are employed. In view of the large number of variables with these characteristics, which are frequently correlated with each other, and the consequent enormous number of models that would be obtained, we decided to focus on just five optimal econometric models for predicting the financial failure of firms, at 1, 2, 3, 4 and 5 years in advance, with a limited number of explanatory factors, to be selected by an automatic statistical procedure, guided solely by the data and based on a genetic algorithm. The empirical results obtained show that these econometric models are capable of achieving high rates of predictive success, both for in-sample and for out-of-sample predictions. In the latter case, failure and non-failure firms were classified with success rates of 98.5 and 82.5%, respectively, 1 year in advance. This predictive quality is maintained at 2, 3 and even 4 years in advance.","authors":["Eduardo Acosta-Gonzalez","Fernando Fernández-Rodríguez","Hicham Ganga"],"meta":["January 2019Computational Economics 53(2)","DOI:10.1007/s10614-017-9737-x"],"references":["307681748_Bankruptcy_Prediction_A_Survey_on_Evolution_Critiques_and_Solutions","299841437_Financial_Distress_Prediction_in_an_International_Context_A_Review_and_Empirical_Analysis_of_Altman's_Z-Score_Model","299361995_Predicting_Bankruptcy_in_Private_Firms_Towards_a_Stepwise_Regression_Procedure","346680680_Subset_Selection_in_Regression","331896557_On_the_Pricing_of_Corporate_Debt_The_Risk_Structure_of_Interest_Rates","324393834_Subset_Selection_in_Regression","314898069_Multi-Period_Corporate_Default_Prediction_with_Stochastic_Covariates","313706874_Adaptation_in_natural_and_artificial_systems","307464535_On_the_Pricing_of_Corporate_Debt_The_Risk_Structure_of_Interest_Rates","305114174_Validation_methodologies_for_default_risk_models","271225727_Performance_Evaluation_of_Bankruptcy_Prediction_Models_An_Orientation-Free_Super-Efficiency_DEA-based_Framework","284076079_Artificial_neural_networks_in_business_Two_decades_of_research","275646319_leaps_regression_subset_selection","268883496_The_Effects_and_Applicability_of_Financial_Media_Reports_on_Corporate_Default_Ratings","264235862_A_New_Methodology_for_Estimating_Internal_Credit_Risk_and_Bankruptcy_Prediction_under_Basel_II_Regime"]}