{"id":"319697895_Design_and_Analysis_of_Relay-Selection_Strategies_for_Two-Way_Relay_Network-Coded_DCSK_Systems","abstract":"This paper investigates a two-way two-relay network-coded differential-chaos-shift-keying (DCSK) system over multipath Rayleigh fading channels. First, a decode-and-forward protocol is considered, when the two relays first decode the two users' orthogonal transmitted signals and then forward their XORed version back to the users. Based on the equal-gain-combining method at the receiver of each user, the bit-error-rate (BER), achievable diversity order and throughput are analyzed. It is shown that, as compared to the conventional two-way one-relay network-coded DCSK system, the proposed system achieves lower BER, but reduces the throughput meanwhile. To improve the overall performance and avoid the throughput loss, a novel relay-selection criterion is developed based on the decision metrics used for conventional symbol detection, which can be implemented without requiring the channel state information (CSI). According to the criterion, three relay-selection strategies are suggested, namely the max-sum, max-product and max-min relay selections. Both analytical and simulated results show that the proposed relay-selection strategies significantly improve the BER and throughput of the two-way two-relay network-coded DCSK system and achieve higher diversity order. As a further insight, the superiority of the proposed relay-selection strategies is demonstrated in multi-relay scenarios. Overall, the proposed system stands out as a promising candidate for low-power and low-complexity short-range wireless-communication applications, such as wireless sensor networks (WSNs).","authors":["Guofa Cai","Yi Fang","Guojun Han","Jie Xu"],"meta":["September 2017IEEE Transactions on Vehicular Technology PP(99):1-1","DOI:10.1109/TVT.2017.2751754"],"references":["308494684_A_Square-Constellation-Based_M-ary_DCSK_Communication_System","306922463_Non-Coherent_Detection_and_Denoise-and-Forward_Two-Way_Relay_Networks","303311177_Performance_Analysis_of_Cooperative_Systems_With_Unreliable_Backhauls_and_Selection_Combining","303094055_Unified_Analysis_of_Diversity_Reception_in_the_Presence_of_Implusive_Noise","311396077_User_cooperation_diversity_part_i_System_description","308610687_Design_of_an_Adaptive_Multiresolution_M-ary_DCSK_System","304341404_Relay_Pre-Selection_for_Reducing_CSI_Transmission_in_Wireless_Sensor_Networks","301638843_SNR-based_selective_relaying_schemes_in_network-coded_two-way_relay_channels","299943175_SNR_Estimation_for_FM-DCSK_System_over_Multipath_Rayleigh_Fading_Channels","299472448_A_Survey_on_DCSK-based_Communication_Systems_and_Their_Application_to_UWB_Scenarios"]}