{"id":"319684883_Design_and_Performance_Assessment_of_Innovative_Eco-Efficient_Support_Structures_for_Additive_Manufacturing_by_Photopolymerization_Eco-Efficient_Supports_for_Additive_Manufacturing","abstract":"The continued expansion of additive manufacturing (AM) techniques, evolving from its initial role as a rapid prototyping method, toward effective resources for generating final products, is reshaping the production sector and its needs. The development of systematic methodologies for the generation of mechanically optimized support structures for AM processes is an important issue which impacts the eco-efficiency and quality of final parts. The shift from regular lattice support structures and complex support meshes, toward bioinspired support structures, using, for instance, tree-like and fractal geometries, may provide feasible solutions with optimal ratios between mechanical performance and quantity of material used. In a similar way as biomimetics has provided revolutionary solutions to fields including architecture, mechanical engineering, and civil engineering, it may well impact the field of solid freeform fabrication. The possibilities relate not just to aspects related to part geometries and final applications (as is already happening), but also in manufacturing challenges such as the problem of obtaining eco-efficient and reliable supports. In this article, we summarize a recently developed methodology, in the framework of the European Union (EU) “ToMax” Project, for the generation of bioinspired fractal or tree-like support structures and provide six application examples, starting with very simple geometries and generalizing the process for more complex parts. Eco-efficiency is assessed by a final comparative study using support structures generated with conventional software.","authors":["Andres Diaz Lantada","Adrián De Blas Romero","Álvaro Sánchez Isasi","Diego Garrido Bellido"],"meta":["September 2017Journal of Industrial Ecology 21(9-12)","DOI:10.1111/jiec.12660","Project: TOMAX EU Project, Horizon 2020 - Factories of the future (http://www.tomax-h2020.eu/)"],"references":["271090514_Comparing_Environmental_Impacts_of_Additive_Manufacturing_vs_Traditional_Machining_via_Life-Cycle_Assessment","265513545_Characterization_of_Effect_of_Support_Structures_in_Laser_Additive_Manufacturing_of_Stainless_Steel","257490453_Environmental_Impact_Reduction_in_Discrete_Manufacturing_Examples_for_Non-Conventional_Processes","256437245_Sustainable_manufacturing_Evaluation_and_modeling_of_environmental_impacts_in_additive_manufacturing","301242028_Carbon_emission_intensity_in_electricity_production_A_global_analysis","279540353_Energy_and_resource_efficiency_of_SLSSLM_processes","273496991_A_Comparison_of_Energy_Consumption_in_Bulk_Forming_Subtractive_and_Additive_Processes_Review_and_Case_Study","264549729_Clever_Support_Efficient_Support_Structure_Generation_for_Digital_Fabrication","264209522_Lithography-Based_Additive_Manufacturing_of_Cellular_Ceramic_Structures","257336913_A_new_approach_to_the_design_and_optimisation_of_support_structures_in_additive_manufacturing"]}