{"id":"319636631_Multiword_Expression_Processing_A_Survey","abstract":"Multiword expressions (MWEs) are a class of linguistic forms spanning conventional word boundaries that are both idiosyncratic and pervasive across different languages. The structure of linguistic processing that depends on the clear distinction between words and phrases has\nto be re-thought to accommodate MWEs. The issue of MWE handling is crucial for NLP applications, where it raises a number of challenges. The emergence of solutions in the absence of guiding principles motivates this survey, whose aim is not only to provide a focused review of MWE processing, but also to clarify the nature of interactions between MWE processing and downstream applications. We propose a conceptual framework within which challenges and research contributions can be positioned. It offers a shared understanding of what is meant by “MWE processing,” distinguishing the subtasks of MWE discovery and identification. It also elucidates the interactions between MWE processing and two use cases: Parsing and machine translation. Many of the approaches in the literature can be differentiated according to how MWE processing is timed with respect to underlying use cases. We discuss how such orchestration choices affect the scope of MWE-aware systems. For each of the two MWE processing subtasks and for each of the two use cases, we conclude on open issues and research perspectives.","authors":["Matthieu Constant","Gülşen Cebiroğlu Eryiğit","Johanna Monti","Lonneke Plas van Der"],"meta":["September 2017Computational Linguistics 43(4):1-92","DOI:10.1162/COLI_a_00302","Projects: COST PARSEMEMulti-word Units in Machine Translation and Translation Technology"],"references":["330811464_Exploring_Vector_Space_Models_to_Predict_the_Compositionality_of_German_Noun-Noun_Compounds","318739113_The_PARSEME_Shared_Task_on_Automatic_Identification_of_Verbal_Multiword_Expressions","313170906_Word_association_norms_mutual_information_and_lexicography","345219409_TED-MWE_a_bilingual_parallel_corpus_with_MWE_annotation","329977904_Discriminative_Lexical_Semantic_Segmentation_with_Gaps_Running_the_MWE_Gamut","328305158_Multiword_expressions","320633508_Putting_the_Horses_Before_the_Cart_Identifying_Multiword_Expressions_Before_Translation","319394380_Head-driven_phrase_structure_grammar","312458259_A_fast_and_accurate_dependency_parser_using_neural_networks","308646556_Google's_Neural_Machine_Translation_System_Bridging_the_Gap_between_Human_and_Machine_Translation"]}