{"id":"319605446_Network_Location-Aware_Service_Recommendation_with_Random_Walk_in_Cyber-Physical_Systems","abstract":"Cyber-physical systems (CPS) have received much attention from both academia and industry. An increasing number of functions in CPS are provided in the way of services, which gives rise to an urgent task, that is, how to recommend the suitable services in a huge number of available services in CPS. In traditional service recommendation, collaborative filtering (CF) has been studied in academia, and used in industry. However, there exist several defects that limit the application of CF-based methods in CPS. One is that under the case of high data sparsity, CF-based methods are likely to generate inaccurate prediction results. In this paper, we discover that mining the potential similarity relations among users or services in CPS is really helpful to improve the prediction accuracy. Besides, most of traditional CF-based methods are only capable of using the service invocation records, but ignore the context information, such as network location, which is a typical context in CPS. In this paper, we propose a novel service recommendation method for CPS, which utilizes network location as context information and contains three prediction models using random walking. We conduct sufficient experiments on two real-world datasets, and the results demonstrate the effectiveness of our proposed methods and verify that the network location is indeed useful in QoS prediction.","authors":["Yuyu Yin","Fangzheng Yu","Yueshen Xu","Lifeng Yu"],"meta":["September 2017Sensors 17(9):2059","DOI:10.3390/s17092059"],"references":["316941635_Time-Aware_Service_Ranking_Prediction_in_the_Internet_of_Things_Environment","308490598_Markov_Task_Network_A_Framework_for_Service_Composition_under_Uncertainty_in_Cyber-Physical_Systems","295856772_Context-Aware_Web_Services_Recommendation_Based_on_User_Preference","313318609_Research_Directions_for_Cyber_Physical_Systems_in_Wireless_and_Mobile_Healthcare","312482136_Review_on_cyber-physical_systems","308672489_QoS-Aware_Web_Service_Recommendation_Using_Collaborative_Filtering_with_PGraph","308671933_Location-Based_Web_Service_QoS_Prediction_via_Preference_Propagation_for_Improving_Cold_Start_Problem","308671143_QoS_Prediction_of_Web_Services_Based_on_Two-Phase_K-Means_Clustering","307631671_The_pagerank_citation_ranking_Bringing_order_to_the_web","307573165_Asymmetric_Correlation_Regularized_Matrix_Factorization_for_Web_Service_Recommendation"]}