{"id":"319622483_Navigability_of_temporal_networks_in_hyperbolic_space","abstract":"Information routing is one of the main tasks in many complex networks with a communication function. Maps produced by embedding the networks in hyperbolic space can assist this task enabling the implementation of efficient navigation strategies. However, only static maps have been considered so far, while navigation in more realistic situations, where the network structure may vary in time, remain largely unexplored. Here, we analyze the navigability of real networks by using greedy routing in hyperbolic space, where the nodes are subject to a stochastic activation-inactivation dynamics. We find that such dynamics enhances navigability with respect to the static case. Interestingly, there exists an optimal intermediate activation value, which ensures the best trade-off between the increase in the number of successful paths and a limited growth of their length. Contrary to expectations, the enhanced navigability is robust even when the most connected nodes inactivate with very high probability. Finally, our results indicate that some real networks are ultranavigable and remain highly navigable even if the network structure is extremely unsteady. These findings have important implications for the design and evaluation of efficient routing protocols that account for the temporal nature of real complex networks.","authors":["Elisenda Ortiz","Michele Starnini","M. Ángeles Serrano"],"meta":["November 2017Scientific Reports 7(1)","DOI:10.1038/s41598-017-15041-0","Project: Navigability of temporal networks in hyperbolic space"],"references":["345174099_From_static_to_temporal_network_theory_-_applications_to_functional_brain_connectivity","315958339_From_static_to_temporal_network_theory_Applications_to_functional_brain_connectivity","308273403_The_hidden_hyperbolic_geometry_of_international_trade_World_Trade_Atlas_1870-2013","303755260_Aging_and_percolation_dynamics_in_a_Non-Poissonian_temporal_network_model","300377694_Dynamic_information_routing_in_complex_networks","328248593_Burstiness_and_spreading_on_temporal_networks","312544727_The_geometric_nature_of_weights_in_real_complex_networks","304812412_Hidden_geometric_correlations_in_real_multiplex_networks","290714298_Navigation_in_a_small_world","280773491_Exploring_Temporal_Networks_with_Greedy_Walks","266913148_Regulation_of_burstiness_by_network-driven_activation","266086677_Causality-Driven_Slow-Down_and_Speed-Up_of_Diffusion_in_Non-Markovian_Temporal_Networks","265254836_Complex_network_theory_and_the_brain","264743115_Identifying_Modular_Flows_on_Multilayer_Networks_Reveals_Highly_Overlapping_Organization_in_Interconnected_Systems","264920260_Networks_An_Introduction"]}