{"id":"319683452_Multidimensional_encoding_of_brain_connectomes","abstract":"The ability to map brain networks in living individuals is fundamental in efforts to chart the relation between human behavior, health and disease. Advances in network neuroscience may benefit from developing new frameworks for mapping brain connectomes. We present a framework to encode structural brain connectomes and diffusion-weighted magnetic resonance (dMRI) data using multidimensional arrays. The framework integrates the relation between connectome nodes, edges, white matter fascicles and diffusion data. We demonstrate the utility of the framework for in vivo white matter mapping and anatomical computing by evaluating 1,490 connectomes, thirteen tractography methods, and three data sets. The framework dramatically reduces storage requirements for connectome evaluation methods, with up to 40x compression factors. Evaluation of multiple, diverse datasets demonstrates the importance of spatial resolution in dMRI. We measured large increases in connectome resolution as function of data spatial resolution (up to 52%). Moreover, we demonstrate that the framework allows performing anatomical manipulations on white matter tracts for statistical inference and to study the white matter geometrical organization. Finally, we provide open-source software implementing the method and data to reproduce the results.","authors":["Cesar F Caiafa","Franco Pestilli"],"meta":["December 2017Scientific Reports 7(1)","DOI:10.1038/s41598-017-09250-w","Project: Brain connectomes"],"references":["316632877_Connectome_imaging_for_mapping_human_brain_pathways","313747022_Early_brain_development_in_infants_at_high_risk_for_autism_spectrum_disorder","313712798_The_visual_white_matter_The_application_of_diffusion_MRI_and_fiber_tractography_to_vision_science","313489088_Machine_learning_based_compartment_models_with_permeability_for_white_matter_microstructure_imaging","311841709_Microstructure_Imaging_of_Crossing_MIX_White_Matter_Fibers_from_diffusion_MRI","318450083_Fiber_tractography_using_machine_learning","315947571_Quantifying_the_brain's_sheet_structure_with_normalized_convolution","314223864_Image_quality_transfer_and_applications_in_diffusion_MRI","313939750_Network_neuroscience","311449941_Resting-state_connectivity_biomarkers_define_neurophysiological_subtypes_of_depression"]}