{"id":"319641390_Histogram-Based_Color_Transfer_for_Image_Stitching","abstract":"Color inconsistency often exists between the images to be stitched and will reduce the visual quality of the stitching results. Color transfer plays an important role in image stitching. This kind of technique can produce corrected images which are color consistent. This paper presents a color transfer approach via histogram specification and global mapping. The proposed algorithm can make images share the same color style and obtain color consistency. There are four main steps in this algorithm. Firstly, overlapping regions between a reference image and a test image are obtained. Secondly, an exact histogram specification is conducted for the overlapping region in the test image using the histogram of the overlapping region in the reference image. Thirdly, a global mapping function is obtained by minimizing color differences with an iterative method. Lastly, the global mapping function is applied to the whole test image for producing a color-corrected image. Both the synthetic dataset and real dataset are tested. The experiments demonstrate that the proposed algorithm outperforms the compared methods both quantitatively and qualitatively.","authors":["Qi-Chong Tian","Laurent D. Cohen"],"meta":["September 2017Journal of Imaging 3(3):38","DOI:10.3390/jimaging3030038"],"references":["288836337_An_Objective_No-Reference_Measure_of_Illumination_Assessment","316240097_Distinctive_Image_Features_from_Scale-Invariant_Keypoints","313795074_From_Photon_to_Pixel_The_Digital_Camera_Handbook","312835449_A_Variational_Model_for_Color_Assignment","312771295_Image_quality_assessment_From_error_visibility_to_structural_similarity","312571351_Color_correction_in_image_stitching_using_histogram_specification_and_global_mapping","290740431_Adaptive_As-Natural-As-Possible_Image_Stitching","286594369_Color_Transfer_Using_Probabilistic_Moving_Least_Squares","280912864_Color_Mapping_A_Review_of_Recent_Methods_Extensions_and_Applications","269697300_Illumination_and_device_invariant_image_stitching"]}