{"id":"319649788_Optimal_paths_of_knapsack-set_vertices_on_a_weight-independent_graph","abstract":"Two problems that are often studied and researches in computer science algorithms are the knapsack problem and the shortest paths on weighted graphs problem. Their combination is often addressed by dynamic programming solutions for the knapsack problem, using shortest path problem, with the creation of a knapsack graph. But these researches consider only two aspects of weight and value for an item/vertex, and here we address a different kind of problem in which we are taking into consideration three properties: item weight, item value and edge weight (that connects two items, but its weight is not depended on its vertices). Every vertex in this specific graph is a set of knapsack items. This situation is viable for real-life circumstances, in which a path has a non-dependent attribute (physical distance, travel time, etc.), and there are different kinds of items to be picked in different locations on this path. The problem presented here is finding the most efficient path between two vertices (source and target), in three aspects-minimal edge wise, maximum knapsack value wise, and a combination of maximal efficiency for both properties. An algorithm for finding these optimal paths is presented here along with specific explanations on its decision stages, and several examples for it. .","authors":["Nadav Voloch"],"meta":["September 2017WSEAS Transactions on Computers 16(2017):163-171","Project: Optimal paths of knapsack-set vertices on a weight-independent graph"],"references":["228057696_Algorithm_for_Solution_of_a_Problem_of_Maximum_Flow_in_Networks_with_Power_Estimation","220780045_Highway_Dimension_Shortest_Paths_and_Provably_Efficient_Algorithms","312426004_Finding_the_most_efficient_paths_between_two_vertices_in_a_knapsack-item_weighted_graph","287661427_On_the_Partition_of_Numbers","256937542_Solving_0-1_knapsack_problems_based_on_amoeboid_organism_algorithm","255683028_Discrete-Variable_Extremum_Problems","242562037_A_Note_on_Two_Problems_in_Connexion_with_Graphs","228029283_A_Dual_Algorithm_for_the_Constrained_Shortest_Path_Problem","227129458_Shortest_path_algorithms_for_knapsack_type_problems","225070175_A_Note_on_Two_Problems_in_Connexion_With_Graphs"]}