{"id":"319683861_Deepgender_real-time_gender_classification_using_deep_learning_for_smartphones","abstract":"Face recognition, expression identification, age determination, racial binding and gender classification are common examples of image processing computerization. Gender classification is very straightforward for us like we can tell by the person’s hair, nose, eyes, mouth and skin whether that person is a male or female with a relatively high degree of confidence and accuracy; however, can we program a computer to perform just as well at gender classification? The very problem is the main focus of this research. The conventional sequence for recent real-time facial image processing consists of five steps: face detection, noise removal, face alignment, feature representation and classification. With the aim of human gender classification, face alignment and feature vector extraction stages have been re-examined keeping in view the application of the system on smartphones. Face alignment has been made by spotting out 83 facial landmarks and 3-D facial model with the purpose of applying affine transformation. Furthermore, ‘feature representation’ is prepared through proposed modification in multilayer deep neural network, and hence we name it Deepgender. This convolutional deep neural network consists of some locally connected hidden layers without common weights of kernels as previously followed in legacy layered architecture. This specific case study involves deep learning as four convolutional layers, three max-pool layers (for downsizing of unrelated data), two fully connected layers (connection of outcome to all inputs) and a single layer of ‘multinomial logistic regression.’ Training has been made using CAS-PEAL and FEI which contain 99,594 face images of 1040 people and 2800 face images of 200 individuals, respectively. These images are either in different poses or taken under uncontrolled conditions which are close to real-time input facial image for gender classification application. The proposed system ‘Deepgender’ has registered 98% accuracy by combined use of both databases with the specific preprocess procedure, i.e., exhibiting alignment before resizing. Experiments suggest that accuracy is nearly 100% with frontal and nonblurred facial images. State-of-the-art steps have been taken to overcome memory and battery constraints in mobiles.","authors":["Khurram Zeeshan Haider","Kaleem Razzaq Malik","Shehzad Khalid","Tabassam Nawaz"],"meta":["February 2019Journal of Real-Time Image Processing 16(11)","DOI:10.1007/s11554-017-0714-3"],"references":["319770183_Imagenet_classification_with_deep_convolutional_neural_networks","313316525_Dynamic_Clustering_and_Management_of_Mobile_Wireless_Sensor_Networks","312288652_DeepGender_Occlusion_and_Low_Resolution_Robust_Facial_Gender_Classification_via_Progressively_Trained_Convolutional_Neural_Networks_with_Attention","311756984_Gender_and_Smile_Classification_Using_Deep_Convolutional_Neural_Networks","310360407_Physical_activity_classification_using_body-worn_inertial_sensors_in_a_multi-sensor_setup","308861836_3D_model-based_continuous_emotion_recognition","308299971_Age_and_gender_classification_using_convolutional_neural_networks","301408141_Multi-feature_deep_learning_for_face_gender_recognition","290264922_Learning_to_align_from_scratch","287621377_An_Overview_of_Information_Extraction_from_Mobile_Wireless_Sensor_Networks","284282572_Accurate_and_efficient_shape_matching_approach_using_vocabularies_of_multi-feature_space_representations","286700361_Gender_Recognition_Using_Fusion_of_Spatial_and_Temporal_Features","286594438_Large-Scale_Video_Classification_with_Convolutional_Neural_Networks","285357722_Local_Deep_Neural_Networks_for_gender_recognition","284476399_Compression_of_Deep_Convolutional_Neural_Networks_for_Fast_and_Low_Power_Mobile_Applications"]}