{"id":"319645983_Number_Line_Estimation_Predicts_Mathematical_Skills_Difference_in_Grades_2_and_4","abstract":"Studies have shown that number line estimation is important for learning. However, it is yet unclear if number line estimation predicts different mathematical skills in different grades after controlling for age, non-verbal cognitive ability, attention, and working memory. The purpose of this study was to examine the role of number line estimation on two mathematical skills (calculation fluency and math problem-solving) in grade 2 and grade 4. One hundred and forty-eight children from Shanghai, China were assessed on measures of number line estimation, non-verbal cognitive ability (non-verbal matrices), working memory (N-back), attention (expressive attention), and mathematical skills (calculation fluency and math problem-solving). The results showed that in grade 2, number line estimation correlated significantly with calculation fluency (r = -0.27, p < 0.05) and math problem-solving (r = -0.52, p < 0.01). In grade 4, number line estimation correlated significantly with math problem-solving (r = -0.38, p < 0.01), but not with calculation fluency. Regression analyses indicated that in grade 2, number line estimation accounted for unique variance in math problem-solving (12.0%) and calculation fluency (4.0%) after controlling for the effects of age, non-verbal cognitive ability, attention, and working memory. In grade 4, number line estimation accounted for unique variance in math problem-solving (9.0%) but not in calculation fluency. These findings suggested that number line estimation had an important role in math problem-solving for both grades 2 and 4 children and in calculation fluency for grade 2 children. We concluded that number line estimation could be a useful indicator for teachers to identify and improve children’s mathematical skills.","authors":["Meixia Zhu","Dan Cai","Ada W S Leung"],"meta":["September 2017Frontiers in Psychology 8:1576","DOI:10.3389/fpsyg.2017.01576"],"references":["283449263_The_role_of_planning_in_different_mathematical_skills","283085448_Normative_data_on_the_N-back_task_for_children_and_young_adolescents","273910162_The_Contribution_of_Working_Memory_to_Children's_Mathematical_Word_Problem_Solving","273462006_The_Effect_of_Computer_Games_on_Speed_Attention_and_Consistency_of_Learning_Mathematics_among_Students","260151013_Children's_Number-Line_Estimation_Shows_Development_of_Measurement_Skills_Not_Number_Representations","258064628_Number_sense_in_infancy_predicts_mathematical_abilities_in_childhood","288159579_Split-Half_Reliability","281426002_Cognitive_Predictors_of_Calculations_and_Number_Line_Estimation_With_Whole_Numbers_and_Fractions_Among_At-Risk_Students","276195103_The_Number_Sense_How_the_Mind_Creates_Mathematics","265256228_The_development_of_structural_analogy_in_number-line_estimation"]}