{"id":"319604035_Collating_and_Analysing_State-of-the-Art_Hierarchical_Routing_Protocols_in_WSN_to_Increase_Network_Lifetime_and_Conserve_Energy","abstract":"The wireless sensor network has many sensor nodes that magnetized higher terms in recent years like high energy consumption and low the network lifespan. The aim of this paper is to conserve energy and increase network lifetime. The result is based on the comparison of the state of the art routing protocols e.g. Leach, Leach-Tlch, Teen, Apteen and Adaptive Threshold. The Leach is the base for all registered routing protocols and also the main reason of comparison with state-of-the-art protocols. Leach protocol has some drawbacks in it, Thus, the Teen and the Apteen surmounts the disadvantage faced by the Leach. However, to overcome the issues present in both the protocols, the Adaptive Threshold is integrated that produce some advanced terms for improvising the energy efficiency and the lifespan of WSNs. The primary objective of this paper is to compare and distribute the routing protocol whose consumption of energy decreases with the improvement in the network's lifetime. The proposed model describes the comparison made between the routing networks. The benefits of the model are to achieve the low energy consumption by the sensor nodes that increase the network's lifetime. Chart and tables evaluate the results.","authors":["Syed Bilal Hussain Shah","Yin Fuliang","Inam Ullah Khan"],"meta":["July 2017","DOI:10.1145/3102304.3102346","Conference: ICFNDS '17 Proceedings of the International Conference on Future Networks and Distributed SystemsAt: Cambridge, United KingdomVolume: Article No. 31"],"references":["316715500_An_efficient_cluster_designing_mechanism_for_Wireless_Sensor_Networks","315777812_OPEN_Optimized_Path_Planning_Algorithm_with_Energy_Efficiency_and_Extending_Network_-_Lifetime_in_WSN","284199474_Survey_on_Hierarchical_Cluster_Routing_Protocols_of_WSN","283816188_E-MCDA_Extended-Multilayer_Cluster_Designing_Algorithm_for_Network_Lifetime_Improvement_of_Homogenous_Wireless_Sensor_Networks","315125351_Hierarchical_secure_routing_protocol_based_on_level_in_wireless_sensor_network","311522269_Energy_Efficient_Cross_Layer_based_Adaptive_Threshold_Routing_Protocol_for_WSN","290797753_Threshold_based_Routing_Protocol_for_WSN_with_SleepAwake_Scheduling","284696386_Improvement_on_LEACH_Protocol_of_Wireless_Sensor_Network_VLEACH","284209373_A_Survey_Wireless_Sensor_Network_and_its_Routing_Protocol","284156386_Improved_TEEN_Routing_Protocol_with_Multi_Hop_and_Multi_Path_in_Wireless_Sensor_Networks"]}