{"id":"319642585_The_Diverse_Cohort_Selection_Problem_Multi-Armed_Bandits_with_Varied_Pulls","abstract":"How should a firm allocate its limited interviewing resources to select the optimal cohort of new employees from a large set of job applicants? How should that firm allocate cheap but noisy resume screenings and expensive but in-depth in-person interviews? We view this problem through the lens of combinatorial pure exploration (CPE) in the multi-armed bandit setting, where a central learning agent performs costly exploration of a set of arms before selecting a final subset with some combinatorial structure. We generalize a recent CPE algorithm to the setting where arm pulls can have different cost, but return different levels of information, and prove theoretical upper bounds for a general class of arm-pulling strategies in this new setting. We then apply our general algorithm to a real-world problem with combinatorial structure: incorporating diversity into university admissions. We take real data from admissions at one of the largest US-based computer science graduate programs and show that a simulation of our algorithm produced more diverse student cohorts at low cost to individual student quality, and does so by spending comparable budget to the current admissions process at that university.","authors":["Candice Schumann","Samsara Counts","Jeffrey S. Foster","John P. Dickerson"],"meta":["September 2017"],"references":["324173981_On_Top-k_Selection_in_Multi-Armed_Bandits_and_Hidden_Bipartite_Graphs","313451174_Will_I_Get_in_Modeling_the_Graduate_Admission_Process_for_American_Universities","303773489_Applications_of_supervised_learning_techniques_on_undergraduate_admissions_data","281854812_Combinatorial_pure_exploration_of_multi-armed_bandits","242914003_An_Analysis_of_Approximations_for_Maximizing_Submodular_Set_Functions-I","332457508_Linear_Submodular_Bandits_and_their_Application_to_Diversified_Retrieval","303449427_Fairness_in_Learning_Classic_and_Contextual_Bandits","262402662_Promoting_diversity_in_recommendation_by_entropy_regularizer","262157385_Latent_Dirichlet_Allocation","224836765_Regret_Analysis_of_Stochastic_and_Nonstochastic_Multi-armed_BanditProblems"]}