{"id":"319676697_PBL_in_Engineering_Education","abstract":"PBL in Engineering Education: International Perspectives on Curriculum Change presents diverse views on the implementation of PBL from across the globe. The purpose is to exemplify curriculum changes in engineering education. Drivers for change, implementation descriptions, challenges and future perspectives are addressed. Cases of PBL models are presented from Singapore, Malaysia, Tunisia, Portugal, Spain and the USA. These cases are stories of thriving success that can be an inspiration for those who aim to implement PBL and change their engineering education practices. In the examples presented, the change processes imply a transformation of vision and values of what learning should be, triggering a transition from traditional learning to PBL. In this sense, PBL is also a learning philosophy and different drivers, facing diverse challenges and involving different actors, trigger its implementation. This book gathers experiences, practices and models, through which is given a grasp of the complexity, multidimensional, systemic and dynamic nature of change processes. Anette Kolmos, director of Aalborg PBL Centre, leads off the book by presenting different strategies to curriculum change, addressing three main strategies of curriculum change, allowing the identification of three types of institutions depending on the type of strategy used. Following chapters describe each of the PBL cases based upon how they implement the seven components of PBL: (i) objectives and knowledge; (ii) types of problems, projects and lectures; (iii) progression, size and duration; (iv) students' learning; (v) academic staff and facilitation; (vi) space and organization; and (vii) assessment and evolution. The book concludes with a chapter summarizing all chapters and providing an holistic perspective of change processes.","authors":["Associate Professor Aida Guerra","Ronald Ulseth","Anette Kolmos"],"meta":["September 2017","DOI:10.1007/978-94-6300-905-8","ISBN: 978-94-6300-905-8"],"references":[]}