{"id":"319661913_Drone-Aided_Communication_as_a_Key_Enabler_for_5G_and_Resilient_Public_Safety_Networks","abstract":"Wireless networks comprising unmanned aerial ve- hicles can offer limited connectivity in a cost-effective manner to disaster-struck regions where terrestrial infrastructure might have been damaged. While these drones offer advantages such as rapid deployment to far-flung areas, their operations may be rendered ineffective by the absence of an adequate energy management strategy. This article considers the multi-faceted applications of these platforms and the challenges thereof, in the networks of the future. In addition to providing an overview of the work done by researchers in determining the features of the air-to- ground channel, the article explores the use of drones in fields as diverse as military surveillance and network-rehabilitation for disaster-struck areas. It also goes on to present a case-study which envisages a scenario in which drones operate alongside conventional wireless infrastructure, thereby allowing a greater number of users to establish a line-of-sight link for communica- tion. This study investigates a power allocation strategy for the microwave base station and the small base stations operating at 28 GHz frequency band. The self-adaptive power control strategy for drones is dependent on the maximum allowable interference threshold and minimum data rate requirements. This study highlights the importance of incorporating the drones in the multi-tier heterogeneous network to extend the network coverage and capacity.","authors":["Syed Ahsan Raza Naqvi","Syed Ali Hassan","Haris Pervaiz","Qiang Ni"],"meta":["January 2018IEEE Communications Magazine 56(1)","DOI:10.1109/MCOM.2017.1700451","Projects: 5G research at 5GICDARE: Distributed Autonomous and Resilient Emergency Management System5G/B5G/6G Networks"],"references":["313452201_Mobile_Internet_of_Things_Can_UAVs_Provide_an_Energy-Efficient_Mobile_Architecture","305907461_A_multi-resolution_approach_for_discovery_and_3-D_modeling_of_archaeological_sites_using_satellite_imagery_and_a_UAV-borne_camera","303840076_Efficient_Deployment_of_Multiple_Unmanned_Aerial_Vehicles_for_Optimal_Wireless_Coverage","294427334_Efficient_3-D_Placement_of_an_Aerial_Base_Station_in_Next_Generation_Cellular_Networks","281486941_Unmanned_Aerial_Vehicle_With_Underlaid_Device-to-Device_Communications_Performance_and_Tradeoffs","317800342_Full-Duplex_Communication_in_Cognitive_Radio_Networks_A_Survey","308811461_SkyEyes_adaptive_video_streaming_from_UAVs","305983845_Energy-Efficient_UAV_Communication_with_Trajectory_Optimization","301845840_Wireless_Communications_with_Unmanned_Aerial_Vehicles_Opportunities_and_Challenges","271141104_Integration_of_Cognitive_Radio_Technology_with_unmanned_aerial_vehicles_Issues_opportunities_and_future_research_challenges"]}