{"id":"319662377_Subexponentials_in_non-commutative_linear_logic","abstract":"Linear logical frameworks with subexponentials have been used for the specification of among other systems, proof systems, concurrent programming languages and linear authorization logics. In these frameworks, subexponentials can be configured to allow or not for the application of the contraction and weakening rules while the exchange rule can always be applied. This means that formulae in such frameworks can only be organized as sets and multisets of formulae not being possible to organize formulae as lists of formulae. This paper investigates the proof theory of linear logic proof systems in the non-commutative variant. These systems can disallow the application of exchange rule on some subexponentials. We investigate conditions for when cut-elimination is admissible in the presence of non-commutative subexponentials, investigating the interaction of the exchange rule with local and non-local contraction rules. We also obtain some new undecidability and decidability results on non-commutative linear logic with subexponentials.","authors":["Max Kanovich","Stepan Kuznetsov","Vivek Nigam","Andre Scedrov"],"meta":["September 2017Mathematical Structures in Computer Science 29(8)","DOI:10.1017/S0960129518000117"],"references":["318741469_Conjunctive_Categorial_Grammars","313480163_Grammar_logicised_relativisation","305995138_Reconciling_Lambek's_restriction_cut-elimination_and_substitution_in_the_presence_of_exponential_modalities","301880690_Undecidability_of_the_Lambek_calculus_with_a_relevant_modality","323707969_The_Mathematics_of_Sentence_Structure","319132381_Undecidability_of_the_Lambek_Calculus_with_Subexponential_and_Bracket_Modalities","313409612_The_Grail_Theorem_Prover_Type_Theory_for_Syntax_and_Semantics","309363906_On_translating_Lambek_grammars_with_one_division_into_context-free_grammars","305908919_Undecidability_of_the_Lambek_Calculus_with_a_Relevant_Modality","300132339_On_Lambek's_Restriction_in_the_Presence_of_Exponential_Modalities"]}