{"id":"319704283_Rearrangement_Scenarios_Guided_by_Chromatin_Structure","abstract":"Genome architecture can be drastically modified through a succession of large-scale rearrangements. In the quest to infer these rearrangement scenarios, it is often the case that the parsimony principal alone does not impose enough constraints. In this paper we make an initial effort towards computing scenarios that respect chromosome conformation, by using Hi-C data to guide our computations. We confirm the validity of a model – along with optimization problems Minimum Local Scenario and Minimum Local Parsimonious Scenario – developed in previous work that is based on a partition into equivalence classes of the adjacencies between syntenic blocks. To accomplish this we show that the quality of a clustering of the adjacencies based on Hi-C data is directly correlated to the quality of a rearrangement scenario that we compute between Drosophila melanogaster and Drosophila yakuba. We evaluate a simple greedy strategy to choose the next rearrangement based on Hi-C, and motivate the study of the solution space of Minimum Local Parsimonious Scenario.","authors":["Sylvain Pulicani","Pijus Simonaitis","Eric Rivals","Krister M. Swenson"],"meta":["September 2017","DOI:10.1007/978-3-319-67979-2_8","Conference: RECOMB International Workshop on Comparative Genomics"],"references":["324951902_Finding_local_genome_rearrangements","303295077_Models_and_algorithms_for_genome_rearrangement_with_positional_constraints","268450548_The_OMA_orthology_database_in_2015_Function_predictions_better_plant_support_synteny_view_and_other_improvements","263129694_Evaluating_synteny_for_improved_comparative_studies","236207336_Divergence_of_Mammalian_Higher_Order_Chromatin_Structure_Is_Associated_with_Developmental_Loci","221766911_Three-Dimensional_Folding_and_Functional_Organization_Principles_of_the_Drosophila_Genome","221313645_A_Unifying_View_of_Genome_Rearrangements","221103283_OrthoCluster_A_New_Tool_for_Mining_Synteny_Blocks_and_Applications_in_Comparative_Genomics","278916594_OrthoCluster","221839033_Spatial_Organization_of_the_Mouse_Genome_and_Its_Role_in_Recurrent_Chromosomal_Translocations"]}