{"id":"319770438_Long-Term_Recurrent_Convolutional_Networks_for_Visual_Recognition_and_Description","abstract":"Models based on deep convolutional networks have dominated recent image\ninterpretation tasks; we investigate whether models which are also recurrent,\nor \"temporally deep\", are effective for tasks involving sequences, visual and\notherwise. We develop a novel recurrent convolutional architecture suitable for\nlarge-scale visual learning which is end-to-end trainable, and demonstrate the\nvalue of these models on benchmark video recognition tasks, image description\nand retrieval problems, and video narration challenges. In contrast to current\nmodels which assume a fixed spatio-temporal receptive field or simple temporal\naveraging for sequential processing, recurrent convolutional models are \"doubly\ndeep\"' in that they can be compositional in spatial and temporal \"layers\". Such\nmodels may have advantages when target concepts are complex and/or training\ndata are limited. Learning long-term dependencies is possible when\nnonlinearities are incorporated into the network state updates. Long-term RNN\nmodels are appealing in that they directly can map variable-length inputs\n(e.g., video frames) to variable length outputs (e.g., natural language text)\nand can model complex temporal dynamics; yet they can be optimized with\nbackpropagation. Our recurrent long-term models are directly connected to\nmodern visual convnet models and can be jointly trained to simultaneously learn\ntemporal dynamics and convolutional perceptual representations. Our results\nshow such models have distinct advantages over state-of-the-art models for\nrecognition or generation which are separately defined and/or optimized.","authors":["Jeff Donahue","Lisa Anne Hendricks","Sergio Guadarrama","Marcus Rohrbach"],"meta":["November 2014IEEE Transactions on Pattern Analysis and Machine Intelligence PP(99)","DOI:10.1109/TPAMI.2016.2599174"],"references":["308809117_From_captions_to_visual_concepts_and_back","329977566_T_ree_T_alk_Composition_and_Compression_of_Trees_for_Image_Descriptions","319770465_Sequence_to_Sequence_Learning_with_Neural_Networks","319770291_Very_Deep_Convolutional_Networks_for_Large-Scale_Image_Recognition","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","313060232_Learning_Internal_Representations_by_Error_Propagation","310752533_Visualizing_and_understanding_convolutional_networks","308859819_Beyond_short_snippets_Deep_networks_for_video_classification","308813785_Deep_visual-semantic_alignments_for_generating_image_descriptions","308804607_CIDEr_Consensus-based_image_description_evaluation"]}