{"id":"319744812_Optimal_Scheduling_of_Energy_Hubs_in_the_Presence_of_Uncertainty-A_Review","abstract":"Energy Hub is an appropriate framework for modeling and optimal scheduling of multi-energy systems (MES). Energy hub provides the possibility of integrated management of various inputs, converters, storage systems, and outputs of multiple energy carrier systems. However, the optimal management problem in the energy hub is affected by various technical, economic, social and environmental parameters. Many of these parameters are inherently ambiguous and uncertain. Fluctuating nature of renewable energy sources (RES), energy prices in competitive and deregulated markets, the behavior of consumers, inherent variations in the surrounding environment, simplifications and approximations in modeling, linguistic terms of experts, etc. are just a few examples of uncertainties in the optimal management problem of energy hub. Ignoring such uncertainties in the process of modeling and optimization of energy hub leads to unrealistic models and inaccurate results. On the other hand adding these uncertainties leads to increased complexity of modeling and optimization. Therefore, to achieve a realistic model of MES in the form of energy hubs, identifying appropriate methods to address these uncertainties is essential. This paper reviews the different methods for the consideration of uncertainty in optimal scheduling of energy hubs. In this paper, different methods of modeling and optimization of energy hub are reviewed and classified and their strengths and weaknesses are discussed. A classification and review of the various methods that offered in the most recent research of MES in the field of uncertainty modeling are done to identify efficient methods for using in energy hub models.","authors":["Mohammad Mohammadi","Younes Noorollahi","Behnam Mohammadi-ivatloo","Hossein Yousefi"],"meta":["June 2017","DOI:10.22109/JEMT.2017.49432","Project: Energy Hub Design and Operation"],"references":["312024853_Information_Gap_Decision_Theory_Approach_to_Deal_with_Wind_Power_Uncertainty_in_Unit_Commitment","309046450_Decision_making_under_Z-information","316711871_Aggregation_of_Distributed_Energy_Resources_Under_the_Concept_of_Multi-Energy_Players_in_Local_Energy_System","316686337_Stochastic_optimization_of_energy_hub_operation_with_consideration_of_thermal_energy_market_and_demand_response","313697780_Linear_Programming_Under_Uncertainty","313463387_Optimal_Stochastic_Design_of_Wind_Integrated_Energy_Hub","313367732_Evaluating_the_Impacts_of_Resilience_Engineering_on_Health_SafetyEnvironment_and_Ergonomics_Factors","294579333_Optimal_planning_and_scheduling_of_energy_hub_in_presence_of_wind_storage_and_demand_response_under_uncertainty","294111958_Medium-term_energy_hub_management_subject_to_electricity_price_and_wind_uncertainty","293329759_Optimal_risk-constrained_participation_of_industrial_cogeneration_systems_in_the_day-ahead_energy_markets"]}