{"id":"319703493_Effects_of_Rewiring_Strategies_on_Information_Spreading_in_Complex_Dynamic_Networks","abstract":"Recent advances in networks and communication services have attracted much interest to understand information spreading in social networks. Consequently, numerous studies have been devoted to provide effective and accurate models for mimicking information spreading. However, knowledge on how to spread information faster and more widely remains a contentious issue. Yet, most existing works are based on static networks which limit the reality of dynamism of entities that participate in information spreading. Using the SIR epidemic model, this study explores and compares effects of two rewiring models (Fermi–Dirac and Linear functions) on information spreading in scale free and small world networks. Our results show that for all the rewiring strategies, the spreading influence replenishes with time but stabilizes in a steady state at later time-steps. This means that information spreading takes-off during the initial spreading steps, after which the spreading prevalence settles toward its equilibrium, with majority of the population having recovered and thus, no longer affecting the spreading. Meanwhile, rewiring strategy based on Fermi-Dirac distribution function in one way or another impedes the spreading process, however, the structure of the networks mimic the spreading, even with a low spreading rate. The worst case can be when the spreading rate is extremely small. The results emphasize that despite a big role of such networks in mimicking the spreading, the role of the parameters cannot be simply ignored. Apparently, the probability of giant degree neighbors being informed grows much faster with the rewiring strategy of linear function compared to that of Fermi-Dirac distribution function. Clearly, rewiring model based on linear function generates the fastest spreading across the networks. Therefore, if we are interested in speeding up the spreading process in stochastic modeling, linear function may play a pivotal role.","authors":["Abdulla F. Ally","Zhang Ning"],"meta":["September 2017Communications in Nonlinear Science and Numerical Simulation 57","DOI:10.1016/j.cnsns.2017.08.031"],"references":["265287877_How_populations_cohere_Five_rules_for_cooperation","232874573_Characterization_of_Complex_Networks_A_Survey_of_measurements","48200833_Effective_Mechanism_for_Social_Recommendation_of_News","45406255_Imitation_dynamics_of_vaccination_behaviour_on_social_networks","23135020_Epidemic_threshold_in_dynamic_contact_networks","12244402_Resilience_of_the_Internet_to_Random_Breakdowns","8464592_Universal_Behavior_in_a_Generalized_Model_of_Contagion","6981928_Epidemic_Dynamics_on_an_Adaptive_Network","1828565_Epidemic_outbreaks_in_complex_heterogeneous_networks","1770779_Statistical_physics_of_social_dynamics","305488779_Dynamics_of_information_diffusion_and_its_applications_on_complex_networks","259345679_The_Mathematics_of_Infectious_Diseases","254004067_Why_Rumors_Spread_So_Quickly_in_Social_Networks","229438168_Information_spreading_on_dynamic_social_networks","223437818_The_Impacts_of_Network_Topology_on_Disease_Spread","222411422_The_Structure_and_Function_of_Complex_Networks","222301486_What_evolutionary_game_theory_tells_us_about_multiagent_learning","41825499_1_Cooperative_Behavior_Cascades_in_Human_Social_Networks","38018317_Coevolutionary_games-A_mini_review","23420289_Stochastic_Evolutionary_Game_Dynamics","23287339_Robust_dynamic_classes_revealed_by_measuring_the_response_function_of_a_social_system","9341621_Epidemics_and_Rumours_49","6513465_Pairwise_comparison_and_selection_temperature_in_evolutionary_game_dynamics"]}