{"id":"319770123_Densely_Connected_Convolutional_Networks","abstract":"Recent work has shown that convolutional networks can be substantially deeper, more accurate and efficient to train if they contain shorter connections between layers close to the input and those close to the output. In this paper we embrace this observation and introduce the Dense Convolutional Network (DenseNet), where each layer is directly connected to every other layer in a feed-forward fashion. Whereas traditional convolutional networks with L layers have L connections, one between each layer and its subsequent layer (treating the input as layer 0), our network has L(L+1)/2 direct connections. For each layer, the feature maps of all preceding layers are treated as separate inputs whereas its own feature maps are passed on as inputs to all subsequent layers. Our proposed connectivity pattern has several compelling advantages: it alleviates the vanishing gradient problem and strengthens feature propagation; despite the increase in connections, it encourages feature reuse and leads to a substantial reduction of parameters; its models tend to generalize surprisingly well. We evaluate our proposed architecture on five highly competitive object recognition benchmark tasks. The DenseNet obtains significant improvements over the state-of-the-art on all five of them (e.g., yielding 3.74% test error on CIFAR-10, 19.25% on CIFAR-100 and 1.59% on SVHN).","authors":["Gao Huang","Zhuang Liu","Kilian Weinberger"],"meta":["August 2016","Project: Efficient Deep Learning"],"references":["308278012_Deep_Networks_with_Stochastic_Depth","319770414_Identity_Mappings_in_Deep_Residual_Networks","319770387_Deep_Sparse_Rectifier_Neural_Networks","319770216_Deconstructing_the_Ladder_Network_Architecture","319770191_FitNets_Hints_for_Thin_Deep_Nets","319770183_Imagenet_classification_with_deep_convolutional_neural_networks","311609041_Deep_Residual_Learning_for_Image_Recognition","309076254_Gradientbased_learning_applied_to_document_recognition","306281834_Rethinking_the_Inception_Architecture_for_Computer_Vision","306218037_Learning_multiple_layers_of_features_from_tiny_images"]}