{"id":"319715262_The_Generalization_of_Auditory_Accommodation_to_Altered_Spectral_Cues","abstract":"The capacity of healthy adult listeners to accommodate to altered spectral cues to the source locations of broadband sounds has now been well documented. In recent years we have demonstrated that the degree and speed of accommodation are improved by using an integrated sensory-motor training protocol under anechoic conditions. Here we demonstrate that the learning which underpins the localization performance gains during the accommodation process using anechoic broadband training stimuli generalize to environmentally relevant scenarios. As previously, alterations to monaural spectral cues were produced by fitting participants with custom-made outer ear molds, worn during waking hours. Following acute degradations in localization performance, participants then underwent daily sensory-motor training to improve localization accuracy using broadband noise stimuli over ten days. Participants not only demonstrated post-training improvements in localization accuracy for broadband noises presented in the same set of positions used during training, but also for stimuli presented in untrained locations, for monosyllabic speech sounds, and for stimuli presented in reverberant conditions. These findings shed further light on the neuroplastic capacity of healthy listeners, and represent the next step in the development of training programs for users of assistive listening devices which degrade localization acuity by distorting or bypassing monaural cues.","authors":["Christopher J. G. Watson","Simon Carlile","Heather Kelly","Kapilesh Balachandar"],"meta":["December 2017Scientific Reports 7(1)","DOI:10.1038/s41598-017-11981-9"],"references":["344006275_Spatial_Hearing_The_Psychophysics_of_Human_Sound_Localization","264985701_The_plastic_ear_and_perceptual_relearning_in_auditory_spatial_perception","264440259_Modeling_Sound-Source_Localization_in_Sagittal_Planes_for_Human_Listeners","263672810_A_review_on_auditory_space_adaptation_to_altered_head-related_cues","308627695_Spatial_Hearing_and_Hearing_Aids","284201353_Relearing_sound_localization_with_new_ears","272257418_Different_interaural_level_difference_processing_with_complex_sounds_and_pure_tones","265860353_Accommodating_to_new_ears_The_effects_of_sensory_and_sensory-motor_feedback","264635356_Immersive_audiomotor_game_play_enhances_neural_and_perceptual_salience_of_weak_signals_in_noise","259202156_Relearning_Auditory_Spectral_Cues_for_Locations_Inside_and_Outside_the_Visual_Field"]}