{"id":"319888710_The_min-cut_and_vertex_separator_problem","abstract":"We consider graph three-partitions with the objective of minimizing the number of edges between the first two partition sets while keeping the size of the third block small. We review most of the existing relaxations for this min-cut problem and focus on a new class of semidefinite relaxations, based on matrices of order \\(2n+1\\) which provide a good compromise between quality of the bound and computational effort to actually compute it. Here, n is the order of the graph. Our numerical results indicate that the new bounds are quite strong and can be computed for graphs of medium size (\\(n \\approx 300\\)) with reasonable effort of a few minutes of computation time. Further, we exploit those bounds to obtain bounds on the size of the vertex separators. A vertex separator is a subset of the vertex set of a graph whose removal splits the graph into two disconnected subsets. We also present an elegant way of convexifying non-convex quadratic problems by using semidefinite programming. This approach results with bounds that can be computed with any standard convex quadratic programming solver.","authors":["Franz Rendl","Renata Sotirov"],"meta":["January 2018Computational Optimization and Applications 69(2)","DOI:10.1007/s10589-017-9943-4"],"references":["283884832_Eigenvalue_quadratic_programming_and_semidefinite_programming_relaxations_for_a_cut_minimization_problem","267157456_A_Multilevel_Bilinear_Programming_Algorithm_For_the_Vertex_Separator_Problem","313080157_Semidefinite_programming_relaxations_for_the_graph_partitioning_problem","280745301_A_new_bound_for_the_Quadratic_Assignment_Problem_based_on_convex_quadratic_programming","279043538_Applications_of_a_Planar_Separator_Theorem","266522429_Quadratic_optimization_problems","265604009_Continuous_quadratic_programming_formulations_of_optimization_problems_on_graphs","263879876_MULTI-DIRECTIONAL_WIDTH-BOUNDED_GEOMETRIC_SEPARATOR_AND_PROTEIN_FOLDING","247589530_Some_Remarks_on_Quadratic_Programming_with_0-1_Variables","241298998_Generalized_Nested_Dissection"]}