{"id":"319893490_Exploring_the_importance_of_soft_and_hard_skills_as_perceived_by_IT_internship_students_and_industry_A_gap_analysis","abstract":"The research paper proposes a skills gap methodology that utilized the respondent experiences in the internship program to measure the importance of the Information Technology (IT) skills gap as perceived by IT students and the industry. The questionnaires were formulated based on previous studies, however, was slightly modified, validated and pilot tested to fit into the needs of the research. Respondents of this study were IT students enrolled in internship while industry respondents were the supervisors of the IT students in their respective company. Internship IT students were selected since they have a strong background on the needs of the company based on their internship experience. The findings revealed that teamwork and communication skills are very important soft skills to be possessed by IT graduates as perceived by the respondents. Further, results reveal that there was no significant difference in the perception of the respondents in terms of the importance of soft skills. However, this finding contradicts the results in the case of hard skills were in there was a big range of disagreement on the importance of hard skills. IT students perceived that hard skills were very important while industry perceived hard skills were somewhat important. It is recognized that soft skills are very important communication tool for a customer oriented industry and that it is essential to enhance the communication skills of IT students for their future employment. The study suggests that the university should target improvements of soft skills and specific personality development component in the curriculum.","authors":["Frederick Flores Patacsil","Christine Lourrine S. Tablatin"],"meta":["September 2017Journal of Technology and Science Education 7(3):347","DOI:10.3926/jotse.271","Project: exploring"],"references":["324056495_Tourism_and_Hospitality_Graduates_Competencies_Industry_Perceptions_and_Expectations_in_the_Malaysian_Perspectives","272790646_The_Theory_of_Planned_Behavior","267233609_A_Gap_Study_between_Employers'_Perception_and_Expectation_of_Engineering_Graduates_in_Malaysia","266656687_Investigating_the_skill_gap_between_graduating_students_and_industry_expectations","258126575_Executive_Perceptions_of_the_Top_10_Soft_Skills_Needed_in_Today's_Workplace","238111953_PERCEIVED_TECHNICAL_INFORMATION_TECHNOLOGY_SKILL_DEMANDS_VERSUS_ADVERTISED_SKILL_DEMANDS_AN_EMPIRICAL_STUDY","237439050_Graduates'_Employability_Skills","301793594_Employable_Skills_of_Information_Technology_Graduates_in_the_Philippines_Do_Industry_Practitioners_and_Educators_have_the_Same_View","259593120_Efficient_human_resource_deployment_technique_in_higher_education_A_standpoint_from_Malaysia","234637267_Evaluation_in_Practice_Identifying_Factors_for_Improving_Transfer_of_Training_in_Technical_Domains"]}