{"id":"319867396_Credit_Card_Fraud_Detection_A_Realistic_Modeling_and_a_Novel_Learning_Strategy","abstract":"Detecting frauds in credit card transactions is perhaps one of the best testbeds for computational intelligence algorithms. In fact, this problem involves a number of relevant challenges, namely: concept drift (customers' habits evolve and fraudsters change their strategies over time), class imbalance (genuine transactions far outnumber frauds), and verification latency (only a small set of transactions are timely checked by investigators). However, the vast majority of learning algorithms that have been proposed for fraud detection rely on assumptions that hardly hold in a real-world fraud-detection system (FDS). This lack of realism concerns two main aspects: 1) the way and timing with which supervised information is provided and 2) the measures used to assess fraud-detection performance. This paper has three major contributions. First, we propose, with the help of our industrial partner, a formalization of the fraud-detection problem that realistically describes the operating conditions of FDSs that everyday analyze massive streams of credit card transactions. We also illustrate the most appropriate performance measures to be used for fraud-detection purposes. Second, we design and assess a novel learning strategy that effectively addresses class imbalance, concept drift, and verification latency. Third, in our experiments, we demonstrate the impact of class unbalance and concept drift in a real-world data stream containing more than 75 million transactions, authorized over a time window of three years.","authors":["Andrea Dal Pozzolo","Giacomo Boracchi","Olivier Caelen","Cesare Alippi"],"meta":["September 2017IEEE Transactions on Neural Networks and Learning Systems PP(99):1-14","DOI:10.1109/TNNLS.2017.2736643","Projects: Fraud detection with machine learningScalable machine learning for big data analytics"],"references":["300414659_Detecting_Credit_Card_Fraud_Using_Periodic_Features","283349138_Calibrating_Probability_with_Undersampling_for_Unbalanced_Classification","282907128_Learning_in_Nonstationary_Environments_A_Survey","281461046_Credit_Card_Fraud_Detection_and_Concept-Drift_Adaptation_with_Delayed_Supervised_Information","281460906_When_is_Undersampling_Effective_in_Unbalanced_Classification_Tasks","328717271_Fraud_Analytics_Using_Descriptive_Predictive_and_Social_Network_Techniques_A_Guide_to_Data_Science_for_Fraud_Detection","313450101_Handling_delayed_labels_in_temporally_evolving_data_streams","291387757_Hierarchical_Change-Detection_Tests","288906520_Random_forests","278401392_Detecting_credit_card_fraud_by_Modified_Fisher_Discriminant_Analysis"]}