{"id":"319830783_A_Hybrid_Semantic_Approach_to_Building_Dynamic_Maps_of_Research_Communities","abstract":"In earlier papers we characterised the notion of diachronic\ntopic-based communities –i.e., communities of people who work on semantically related topics at the same time. These communities are important to enable topic-centred analyses of the dynamics of the research world. In this paper we present an innovative algorithm, called Research Communities Map Builder (RCMB), which is able to automatically link diachronic topic-based communities over subsequent time intervals to identify significant events. These include topic shifts within a research community; the appearance and fading of a community; communities splitting, merging, spawning other communities; and others. The output of our algorithm is a map of research communities, annotated with the detected events, which provides a concise visual representation of the dynamics of a research area. In contrast with existing approaches, RCMB enables a much more fine-grained understanding of the evolution of research communities, with respect to both the granularity of the events and the granularity of the topics. This improved understanding can, for example, inform the research strategies of funders and researchers alike. We illustrate our approach with two case studies, highlighting the main communities and events that characterized the World Wide Web and Semantic Web areas in the 2000 – 2010 decade.","authors":["Francesco Osborne","Giuseppe Scavo","Enrico Motta"],"meta":["November 2014","DOI:10.1007/978-3-319-13704-9_28","Conference: International Conference on Knowledge Engineering and Knowledge Management"],"references":["266056212_Mining_Semantic_Relations_between_Research_Areas","262725201_Identifying_Diachronic_Topic-Based_Research_Communities_by_Clustering_Shared_Research_Trajectories","259332469_Exploring_Scholarly_Data_with_Rexplore","257662605_Innovating_knowledge_communities","285874604_Functional_Cartography_of_Complex_Metabolic_Networks","256792000_FaBiO_and_CiTO_Ontologies_for_describing_bibliographic_resources_and_citations","248500866_A_social_network_perspective_of_tourism_research_collaborations","242599334_The_Nelder-Mead_Simplex_Procedure_for_Function_Minimization","241121325_Topics_in_dynamic_research_communities_An_exploratory_study_for_the_field_of_information_retrieval","241103037_Topic_oriented_community_detection_through_social_objects_and_link_analysis_in_social_networks"]}