{"id":"319867705_Two_Efficient_Hashing_Schemes_for_High-Dimensional_Furthest_Neighbor_Search","abstract":"The c-Approximate Furthest Neighbor (c-AFN) search is a fundamental problem in many applications. However, existing hashing schemes for c-AFN search are designed for internal memory. The old techniques for external memory, such as furthest point Voronoi diagram and the tree-based methods, are only suitable for the low-dimensional case. In this paper, we introduce a novel concept of Reverse Locality-Sensitive Hashing (RLSH) family which is directly designed for c-AFN search. Accordingly, we propose a new reverse query-aware LSH function, which is a random projection coupled with query-aware interval identification. Based on the reverse query-aware LSH functions, we introduce a novel Reverse Query-Aware LSH scheme named RQALSH for high-dimensional c-AFN search over external memory. Our theoretical studies show that RQALSH enjoys a guarantee on query quality. In addition, in order to further speed up RQALSH, we propose a heuristic variant named RQALSH* which applies a data-dependent objects selection to largely reduce the number of data objects. In the experiment, we compare with two state-of-the-art hashing schemes QDAFN and DrusillaSelect which have been adapted for external memory. Extensive experiments on four real datasets show that our proposed RQALSH and RQALSH* schemes significantly outperform these two methods.","authors":["Qiang Huang","Jianlin Feng","Qiong Fang","Wilfred Ng"],"meta":["September 2017IEEE Transactions on Knowledge and Data Engineering PP(99):1-1","DOI:10.1109/TKDE.2017.2752156"],"references":["317071106_Reverse_Query-Aware_Locality-Sensitive_Hashing_for_High-Dimensional_Furthest_Neighbor_Search","305355740_Query-Aware_locality-sensitive_hashing_for_approximate_nearest_neighbor_search","301840852_Extensions_of_Lipschitz_mappings_into_a_Hilbert_space","254006435_Locality-sensitive_hashing_scheme_based_on_dynamic_collision_counting","319770399_Approximate_nearest_neighbors_towards_removing_the_curse_of_dimensionality","312698954_Fast_Approximate_Furthest_Neighbors_with_Data-Dependent_Candidate_Selection","305630598_Approximate_Furthest_Neighbor_with_Application_to_Annulus_Query","303698820_Fast_approximate_furthest_neighbors_with_data-dependent_hashing","300341610_Approximate_Furthest_Neighbor_in_High_Dimensions","259389412_Computational_Geometry_Algorithms_And_Applications"]}