{"id":"319895051_Guided_Deep_Reinforcement_Learning_for_Swarm_Systems","abstract":"In this paper, we investigate how to learn to control a group of cooperative agents with limited sensing capabilities such as robot swarms. The agents have only very basic sensor capabilities, yet in a group they can accomplish sophisticated tasks, such as distributed assembly or search and rescue tasks. Learning a policy for a group of agents is difficult due to distributed partial observability of the state. Here, we follow a guided approach where a critic has central access to the global state during learning, which simplifies the policy evaluation problem from a reinforcement learning point of view. For example, we can get the positions of all robots of the swarm using a camera image of a scene. This camera image is only available to the critic and not to the control policies of the robots. We follow an actor-critic approach, where the actors base their decisions only on locally sensed information. In contrast, the critic is learned based on the true global state. Our algorithm uses deep reinforcement learning to approximate both the Q-function and the policy. The performance of the algorithm is evaluated on two tasks with simple simulated 2D agents: 1) finding and maintaining a certain distance to each others and 2) locating a target.","authors":["Maximilian Hüttenrauch","Adrian Šošić","Gerhard Neumann"],"meta":["January 2017","Conference: AAMAS 2017 Autonomous Robots and Multirobot Systems (ARMS) Workshop"],"references":["301874866_Inverse_Reinforcement_Learning_in_Swarm_Systems","287250486_Memory-based_control_with_recurrent_neural_networks","281670459_Continuous_control_with_deep_reinforcement_learning","220380903_Teamwork_in_Self-Organized_Robot_Colonies","283986738_Deep_Reinforcement_Learning_in_Parameterized_Action_Space","280329735_Deep_Recurrent_Q-Learning_for_Partially_Observable_MDPs","272837232_Human-level_control_through_deep_reinforcement_learning","262384545_Kilobot_A_low_cost_robot_with_scalable_operations_designed_for_collective_behaviors","224222974_Two_foraging_algorithms_for_robot_swarms_using_only_local_communication","222658235_Cooperative_Transport_By_Ants_and_Robots"]}