{"id":"319894466_Using_Google's_Aggregated_and_Anonymized_Trip_Data_to_Support_Freeway_Corridor_Management_Planning_in_San_Francisco_California","abstract":"With rising urban freeway congestion and limited funds available for highway expansion, it may be essential to manage traffic growth by using high-occupancy toll lanes and other travel demand management (TDM) measures. To prepare for and help guide freeway corridor management planning in the US-101 and I-280 corridors in San Francisco, California, information describing trip origins and destinations by time of day was desired. Observed roadway facility-specific origin–destination (O-D) flows can help researchers to understand spatial distribution of demand and impute willingness to pay, actions that are useful in evaluating various TDM strategies. This paper describes a new passively collected O-D data source—Google’s aggregated and anonymized trip (AAT) data—obtained under Google’s Better Cities program. Aggregate hourly flow matrices for 85 districts covering California’s nine-county Bay Area specific to four freeway segments in San Francisco were obtained. Because AAT data account for only a sample of travelers, Google provides relative flows rather than absolute counts. Linear regression models were estimated to relate relative flows in the AAT data set and observed traffic volumes from the California Department of Transportation’s Performance Measurement System. The models were applied to convert relative flows to trips and derive facility-specific, time-dependent O-D matrices. Comparison of these facility-specific O-D matrices to select link O-D matrices from a regional travel demand model show that there is a higher correlation in terms of productions at origin districts and attractions at destination districts than at the O-D flow level. Some opportunities and limitations of the new data source are discussed, along with recommendations for future research.","authors":["Bhargava Sana","Joe Castiglione","Drew Cooper","Daniel Tischler"],"meta":["January 2017Transportation Research Record Journal of the Transportation Research Board 2643(1):65-73","DOI:10.3141/2643-08"],"references":[]}