{"id":"319869218_Narrow_Band_Internet_of_Things","abstract":"In this paper, we review the background and state-of-theart of the Narrow-Band Internet of Things (NB-IoT). We first introduce NB-IoT general background, development history and standardization. Then, we present NB-IoT features through the review of current national and international studies on NB-IoT technology, where we focus on basic theories and key technologies, i.e., connection count analysis theory, delay analysis theory, coverage enhancement mechanism, ultralow power consumption technology and coupling relationship between signaling and data. Subsequently, we compare several performances of NB-IoT and other wireless and mobile communication technologies in aspects of latency, security, availability, data transmission rate, energy consumption, spectral efficiency and coverage area. Moreover, we analyze five intelligent applications of NB-IoT, including smart cities, smart buildings, intelligent environment monitoring, intelligent user services and smart metering. Lastly, we summarize security requirements of NB-IoT which need to be solved urgently. These discussions aim to provide a comprehensive overview of NB-IoT which can help readers to understand clearly the scientific problems and future research directions of NB-IoT.","authors":["Min Chen","Yiming Miao","Yixue Hao","Kai Hwang"],"meta":["September 2017IEEE Access PP(99):1-1","DOI:10.1109/ACCESS.2017.2751586"],"references":["313671838_Energy_Efficiency_Challenges_of_5G_Small_Cell_Networks","323460076_Data-Driven_Computing_and_Caching_in_5G_Networks_Architecture_and_Delay_Analysis","318999540_Motor_Anomaly_Detection_for_Unmanned_Aerial_Vehicles_Using_Reinforcement_Learning","318514035_Device_Clustering_Algorithm_Based_on_Multimodal_Data_Correlation_in_Cognitive_Internet_of_Things","318434710_A_Scalable_and_Quick-Response_Software_Defined_Vehicular_Network_Assisted_by_Mobile_Edge_Computing","318331754_Multi-tier_Fog_Computing_with_Large-scale_IoT_Data_Analytics_for_Smart_Cities","315870338_Trajectory_Recovery_From_Ash_User_Privacy_Is_NOT_Preserved_in_Aggregated_Mobility_Data","313671617_5G_Software_Defined_Vehicular_Networks","312567027_Who_Moved_My_Data_Privacy_Protection_in_Smartphones","311711510_Software_Defined_Networking_for_Flexible_and_Green_Energy_Internet"]}