{"id":"319867762_Efficient_high_utility_itemset_mining_using_buffered_utility-lists","abstract":"Discovering high utility itemsets in transaction databases is a key task for studying the behavior of customers. It consists of finding groups of items bought together that yield a high profit. Several algorithms have been proposed to mine high utility itemsets using various approaches and more or less complex data structures. Among existing algorithms, one-phase algorithms employing the utility-list structure have shown to be the most efficient. In recent years, the simplicity of the utility-list structure has led to the development of numerous utility-list based algorithms for various tasks related to utility mining. However, a major limitation of utility-list based algorithms is that creating and maintaining utility-lists are time consuming and can consume a huge amount of memory. The reasons are that numerous utility lists are built and that the utility-list intersection/join operation to construct a utility-list is costly. This paper addresses this issue by proposing an improved utility-list structure called utility-list buffer to reduce the memory consumption and speed up the join operation. This structure is integrated into a novel algorithm named ULB-Miner (Utility-List Buffer for high utility itemset Miner), which introduces several new ideas to more efficiently discover high utility itemsets. ULB-Miner uses the designed utility-list buffer structure to efficiently store and retrieve utility-lists, and reuse memory during the mining process. Moreover, the paper also introduces a linear time method for constructing utility-list segments in a utility-list buffer. An extensive experimental study on various datasets shows that the proposed algorithm relying on the novel utility-list buffer structure is highly efficient in terms of both execution time and memory consumption. The ULB-Miner algorithm is up to 10 times faster than the FHM and HUI-Miner algorithms and consumes up to 6 times less memory. Moreover, it performs well on both dense and sparse datasets.","authors":["Quang-Huy Duong","Philippe Fournier Viger","Heri Ramampiaro","Kjetil Nørvåg"],"meta":["July 2018Applied Intelligence 48(12)","DOI:10.1007/s10489-017-1057-2","Projects: Novel algorithms for sequence mining, sequence prediction and utility pattern miningMUSED - Multi-Source Event Detection"],"references":["324075037_CLS-Miner_efficient_and_effective_closed_high-utility_itemset_mining","312256893_An_efficient_algorithm_for_mining_top-k_on-shelf_high_utility_itemsets","311490335_FOSHU_faster_on-shelf_high_utility_itemset_mining_--_with_or_without_negative_unit_profit","305315320_FHM_Faster_High-Utility_Itemset_Mining_Using_Length_Upper-Bound_Reduction","304480099_PHM_Mining_Periodic_High-Utility_Itemsets","301551772_An_efficient_algorithm_for_mining_the_top-k_high_utility_itemsets_using_novel_threshold_raising_and_pruning_strategies","292208266_An_efficient_algorithm_for_mining_top-rank-k_frequent_patterns","315462023_An_Efficient_Algorithm_for_Mining_High_Utility_Patterns_from_Incremental_Databases_with_One_Database_Scan","308438006_MINING_HIGH_UTILITY_ITEMSET_USING_GRAPHICS_PROCESSOR","300415186_Top-k_high_utility_itemset_mining_based_on_utility-list_structures"]}