{"id":"319893243_Finding_Consensus_Strings_with_Small_Length_Difference_between_Input_and_Solution_Strings","abstract":"The Closest Substring Problem is to decide, for given strings s1, … , sk of length at most &ell; and numbers m and d, whether there is a length-m string s and length-m substrings s′i of si, such that s has a Hamming distance of at most d from each s′i. If we instead require the sum of all the Hamming distances between s and each s′i to be bounded by d, then it is called the Consensus Patterns Problem. We contribute to the parameterised complexity analysis of these classical NP-hard string problems by investigating the parameter (&ell; − m), i.e., the length difference between input and solution strings. For most combinations of (&ell; − m) and one of the classical parameters (m, &ell;, k, or d), we obtain fixed-parameter tractability. However, even for constant (&ell; − m) and constant alphabet size, both problems remain NP-hard. While this follows from known results with respect to the Closest Substring, we need a new reduction in the case of the Consensus Patterns. As a by-product of this reduction, we obtain an exact exponential-time algorithm for both problems, which is based on an alphabet reduction.","authors":["Markus L. Schmid"],"meta":["September 2017ACM Transactions on Computation Theory 9(3):1-18","DOI:10.1145/3110290"],"references":["270883320_Multivariate_Algorithmics_for_NP-Hard_String_Problems","1955920_On_The_Parameterized_Intractability_Of_Motif_Search_Problems","321620239_Parameterized_Complexity_Theory","302168666_Finding_Consensus_Strings_with_Small_Length_Difference_Between_Input_and_Solution_Strings","257650162_Computers_and_Intractability","227103434_On_Covering_Problems_of_Codes","222647980_On_the_complexity_of_finding_common_approximate_substrings","222569763_Machine-based_methods_in_parameterized_complexity_theory","220617250_Closest_Substring_Problems_with_Small_Distances","220224037_Fixed-parameter_algorithms_for_CLOSEST_STRING_and_related_problems"]}