{"id":"319893031_A_New_General-Purpose_Algorithm_for_Mixed-Integer_Bilevel_Linear_Programs","abstract":"Bilevel optimization problems are very challenging optimization models arising in many important practical contexts, including pricing mechanisms in the energy sector, airline and telecommunication industry, transportation networks, critical infrastructure defense, and machine learning. In this paper, we consider bilevel programs with continuous and discrete variables at both levels, with linear objectives and constraints (continuous upper level variables, if any, must not appear in the lower level problem). We propose a general-purpose branch-and-cut exact solution method based on several new classes of valid inequalities, which also exploits a very e ective bilevel-specific preprocessing procedure. An extensive computational study is presented to evaluate the performance of various solution methods on a common testbed of more than 800 instances from the literature and 60 randomly generated instances. Our new algorithm consistently outperforms (often by a large margin) alternative state-of-the-art methods from the literature, including methods exploiting problem-specific information for special instance classes. In particular, it solves to optimality more than 300 previously unsolved instances from the literature. To foster research on this challenging topic, our solver is made publicly available online.","authors":["Matteo Fischetti","Ivana Ljubic","Michele Monaci","Markus Sinnl"],"meta":["September 2017Operations Research 65(6)","DOI:10.1287/opre.2017.1650"],"references":["319861239_On_the_use_of_intersection_cuts_for_bilevel_optimization","303515066_Intersection_Cuts_for_Bilevel_Optimization","273188585_A_Numerical_Study_of_the_Logit_Network_Pricing_Problem","348616289_Multilevel_Approaches_for_the_Critical_Node_Problem","317835473_Graduate_Texts_in_Mathematics","312774427_Integer_Programming_Models","288086352_Global_solution_of_bilevel_mixed-integer_nonlinear_programs","287972780_Mixed-integer_Bilevel_Optimization_for_Capacity_Planning_with_Rational_Markets","277609909_Enhanced_exact_algorithms_for_discrete_bilevel_linear_problems","276317013_A_class_of_algorithms_for_mixed-integer_bilevel_min-max_optimization"]}