{"id":"319861239_On_the_use_of_intersection_cuts_for_bilevel_optimization","abstract":"We address a generic mixed-integer bilevel linear program (MIBLP), i.e., a bilevel optimization problem where all objective functions and constraints are linear, and some/all variables are required to take integer values. We first propose necessary modifications needed to turn a standard branch-and-bound MILP solver into an exact and finitely-convergent MIBLP solver, also addressing MIBLP unboundedness and infeasibility. As in other approaches from the literature, our scheme is finitely-convergent in case both the leader and the follower problems are pure integer. In addition, it is capable of dealing with continuous variables both in the leader and in follower problems—provided that the leader variables influencing follower’s decisions are integer and bounded. We then introduce new classes of linear inequalities to be embedded in this branch-and-bound framework, some of which are intersection cuts based on feasible-free convex sets. We present a computational study on various classes of benchmark instances available from the literature, in which we demonstrate that our approach outperforms alternative state-of-the-art MIBLP methods.","authors":["Matteo Fischetti","Ivana Ljubic","Michele Monaci","Markus Sinnl"],"meta":["September 2017Mathematical Programming 172(3)","DOI:10.1007/s10107-017-1189-5"],"references":["303515066_Intersection_Cuts_for_Bilevel_Optimization","301704349_Relaxations_and_discretizations_for_the_pooling_problem","267179036_Exploiting_Erraticism_in_Search","317835473_Graduate_Texts_in_Mathematics","312774427_Integer_Programming_Models","309192179_Outer-Product-Free_Sets_for_Polynomial_Optimization_and_Oracle-Based_Cuts","288086352_Global_solution_of_bilevel_mixed-integer_nonlinear_programs","281222191_Performance_Variability_in_Mixed-Integer_Programming","277609909_Enhanced_exact_algorithms_for_discrete_bilevel_linear_problems","275226343_Analysis_of_MILP_Techniques_for_the_Pooling_Problem"]}