{"id":"319855267_On_Generalized_Stam_Inequalities_and_Fisher-Renyi_Complexity_Measures","abstract":"Information-theoretic inequalities play a fundamental role in numerous scientific and technological areas as they generally express the impossibility to have a complete description of a system via a finite number of information measures. In particular, they gave rise to the design of various quantifiers (statistical complexity measures) of the internal complexity of a (quantum) system. In this paper, we introduce a three-parametric Fisher-R\\'enyi complexity, named $(p,\\beta,\\lambda)$-Fisher--R\\'enyi complexity. This complexity measure quantifies the combined balance of the spreading and the gradient contents of $\\rho$, and has the three main properties of a statistical complexity: the invariance under translation and scaling transformations, and a universal bounding from below. The latter is proved by generalizing the Stam inequality, which lowerbounds the product of the Shannon entropy power and the Fisher information of a probability density function. An extension of this inequality was already proposed by Bercher and Lutwak, a particular case of the general one, where the three parameters are linked, allowing to determine the sharp lower bound and the associated probability density with minimal complexity. Using the notion of differential-escort deformation, we are able to determine the sharp bound of the complexity measure even when the three parameters are decoupled (in a certain range). We determine as well the distribution that saturates the inequality: the $(p,\\beta,\\lambda)$-Gaussian distribution, which involves an inverse incomplete beta function. Finally, the complexity measure is calculated for various quantum-mechanical states of the harmonic and hydrogenic systems, which are the two main prototypes of physical systems subject to a central potential.","authors":["Steeve Zozor","David Puertas Centeno","Jesus S. Dehesa"],"meta":["September 2017Entropy 19(9):493","DOI:10.3390/e19090493"],"references":["320656993_Biparametric_complexities_and_the_generalized_Planck_radiation_law","319114988_Complexity_measures_and_uncertainty_relations_of_the_high-dimensional_harmonic_and_hydrogenic_systems","316617705_Rescaling_the_nonadditivity_parameter_in_Tsallis_thermostatistics","311987101_One-Parameter_Fisher-Renyi_Complexity_Notion_and_Hydrogenic_Applications","329531428_Statistical_inference_based_on_divergence_measures","319394494_Handbook_of_Mathematical_Functions_with_Formulas_Graphs_and_Mathematical_Tables","316439812_The_biparametric_Fisher-Renyi_complexity_measure_and_its_application_to_the_multidimensional_blackbody_radiation","309715704_Least_squares_quantization_in_PCM","303812087_One-parameter_class_of_uncertainty_relations_based_on_entropy_power","303151754_Least_squares_quantization"]}