{"id":"319868616_Videoaulas_em_primeira_pessoa_suas_caracteristicas_e_sua_contribuicao_para_a_EaD","abstract":"p class=\"textbox\" dir=\"ltr\">Desde o início da utilização das ferramentas de vídeo para a educação a distância, vários modelos surgiram de maneira a contribuir com a interação entre aluno e professor. Dentre eles se encontra um modelo de videoaula por meio da captura da tela do computador para ensino de funcionalidades computacionais, entre outros conteúdos. Por utilizar o recurso de câmera subjetiva, tem focalização em primeira pessoa e, assim como no cinema e videogames, proporciona ao aluno-espectador o efeito de imersão e agenciamento, aproximando-o do professor, de quem observa e reproduz as ações. Como ferramenta prática para a EaD mediada por tecnologia, a videoaula em primeira pessoa pode auxiliar no aprendizado dos alunos, no trabalho dos professores e na gestão das instituições.\n\nPalavras-chave: Videoaula, Primeira pessoa, Screencast.2 \n\nVideo Lessons in First Person: their Characteristics and their Contribution to Distance Education \n\nAbstract \nSince the beginning of the use of video tools for distance education, many models for the interaction between student and teacher have emerged. Among those, it is found the screencast model for teaching computer features and other content. By using the subjective camera view and first-person focus, like in the movies and video games, the student is provided with the immersion and agency effects, and is brought closer to the teacher whose actions can be observed and reproduced. As a practical tool for distance education mediated by technology first-person video lessons can help students in the learning process, the teachers’ work and the management of institutions.\n\nKeywords: Video Lessons, First person, Screencast.</p","authors":["Guilherme De Carvalho Pereira","Lidiane Maria Magalini"],"meta":["September 2017","DOI:10.18264/eadf.v7i2.475"],"references":["291053102_Kit_de_primeiros_socorros_um_guia_para_professores_que_repentinamente_passam_a_atuar_na_EaD","277062484_Aperfeicoando_os_modelos_de_EAD_existentes_na_formacao_de_professores","269957743_O_video_na_sala_de_aula","242688922_YOU_TUBE_uma_opcao_para_uso_do_video_na_EAD"]}