{"id":"319934614_Algorithmic_governance_Developing_a_research_agenda_through_the_power_of_collective_intelligence","abstract":"We are living in an algorithmic age where mathematics and computer science are coming together in powerful new ways to influence, shape and guide our behaviour and the governance of our societies. As these algorithmic governance structures proliferate, it is vital that we ensure their effectiveness and legitimacy. That is, we need to ensure that they are an effective means for achieving a legitimate policy goal that are also procedurally fair, open and unbiased. But how can we ensure that algorithmic governance structures are both? This article shares the results of a collective intelligence workshop that addressed exactly this question. The workshop brought together a multidisciplinary group of scholars to consider (a) barriers to legitimate and effective algorithmic governance and (b) the research methods needed to address the nature and impact of specific barriers. An interactive management workshop technique was used to harness the collective intelligence of this multidisciplinary group. This method enabled participants to produce a framework and research agenda for those who are concerned about algorithmic governance. We outline this research agenda below, providing a detailed map of key research themes, questions and methods that our workshop felt ought to be pursued. This builds upon existing work on research agendas for critical algorithm studies in a unique way through the method of collective intelligence.","authors":["John Danaher","Michael J Hogan","Chris Noone","Rónán Kennedy"],"meta":["December 2017Big Data & Society 4(2):205395171772655","DOI:10.1177/2053951717726554","Project: The Threat of Algocracy"],"references":["298898561_Core_entrepreneurial_competencies_and_their_interdependencies_insights_from_a_study_of_Irish_and_Iranian_entrepreneurs_university_students_and_academics","346624964_The_Black_Box_Society_The_Secret_Algorithms_That_Control_Money_and_Information","340333532_Determination_of_Hierarchical_Networks_of_Instructional_Units_Using_the_Interpretive_structural_Modeling_Method","332087075_The_Internet_of_Things","314502238_Thinking_Critically_About_and_Researching_Algorithms","314469713_Interview_on_the_Black_Box_Society","313742678_A_multistage_influence_model_of_barriers_to_group_problem_solving","307123128_Cybernetic_Revolutionaries_Technology_and_Politics_in_Allende's_Chile","306939383_The_magical_number_seven_plus_or_minus_two_Some_limits_on_our_capacity_to_process_information","304929258_3-D_Data_Management_Controlling_Data_Volume_Velocity_and_Variety"]}