{"id":"319928377_Nash_equilibrium_in_a_stochastic_model_of_two_competing_athletes","abstract":"We propose a toy model for a stochastic description of the competition between two athletes of unequal strength, whose average strength difference is represented by a parameter $d$. The athletes interact through the choice of their strategies $x,y\\in[0,1]$. These variables denote the amount of energy each invests in the competition, and determine the performance of each athlete. Each athlete picks his strategy based on his knowledge of his own and his competitor's performance distribution, and on his evaluation of the danger of exhaustion, which increases with the amount of invested energy. We formulate this problem as a zero-sum game. Mathematically it is in the class of \"discontinuous games\" for which a Nash equilibrium is not guaranteed in advance. We demonstrate by explicit construction that the problem has a mixed strategy Nash equilibrium $\\big( f(x),g(y) \\big)$ for arbitrary $0<d<1$. The probability distributions $f$ and $g$ appear to both be the sum of a continuous component and a Dirac delta peak. It is remarkable that this problem is analytically tractable. The Nash equilibrium provides both the weaker and the stronger athlete with the best strategy to optimize their chances to win.","authors":["Cecile Appert-Rolland","Hendrik-Jan Hilhorst","Amandine Aftalion"],"meta":["September 2017Journal of Statistical Mechanics Theory and Experiment 2018(5)","DOI:10.1088/1742-5468/aabc7e"],"references":["304581275_How_to_Run_100_Meters","296631563_How_to_identify_the_physiological_parameters_and_run_the_optimal_race","282864465_The_number_of_potential_winners_in_Bradley-Terry_model_in_random_environment","275836443_Nash_equilibrium_and_evolutionary_dynamics_in_semifinalists'_dilemma","272164813_Optimization_of_Running_Strategies_Based_on_Anaerobic_Energy_and_Variations_of_Velocity","261732152_Game_theory_in_models_of_pedestrian_room_evacuation","324457860_Optimal_Velocity_in_a_Race","320626998_Mixed-strategy_Nash_equilibrium_for_a_discontinuous_symmetric_N-player_game","265916232_Optimal_Velocity_in_a_Race","243489475_Exercise_in_probability_and_statistics_or_the_probability_of_winning_at_tennis"]}