{"id":"319974061_Influence_of_visual_rendering_on_the_acoustic_judgements_of_a_theater_auralization","abstract":"Auralizations have become more prevalent in architectural acoustics. Auralizations in listening tests are typically presented in a uni-modal fashion (audio only). However, in everyday-life one perceives complex multi-modal information. Multi-sensory research has shown that visuals can influence auditory perceptions, such as with the McGurk and ventriloquist effects. However, few studies have investigated the influence of visuals on room acoustic perception. Additionally, in the majority of previous studies, visual cues were represented by photographs either with or without visuals of the source. Previously, a virtual reality framework combining a visible animated source in a virtual room with auralizations was conceived enabling multi-modal assessments. The framework is based on BlenderVR scene graph and visual rendering with MaxMSP for the real-time audio rendering of 3rd order HOA room impulse responses (RIRs) in tracked binaural. CATT-Acoustic TUCT was used to generate the HOA RIRs. Using this framework, two listening tests were carried out: 1) a repeat of a prior audio-only test comparing auralizations with dynamic voice directivity to static orientation and 2) a test comparing dynamic voice auralizations with coherent or incoherent visuals with respect to seating position. Results indicate that judgements of several room acoustic attributes are influenced by the presence of visuals.","authors":["Bart Postma","Brian F G Katz"],"meta":["September 2017Proceedings of meetings on acoustics Acoustical Society of America 30(1):015008","DOI:10.1121/2.0000575","Conference: 173rd Meeting of Acoustical Society of America and 8th Forum Acusticum"],"references":["308097800_Augmented_auralization_Complementing_auralizations_with_immersive_virtual_reality_technologies","303540104_Dynamic_voice_directivity_in_room_acoustic_auralizations","281061615_BlenderVR_Open-source_Framework_for_Interactive_and_Immersive_VR","324352933_The_Ecological_Approach_to_Visual_Perception","314648684_Subjective_Evaluation_of_Dynamic_Voice_Directivity_for_Auralizations","311749967_Perceptive_and_objective_evaluation_of_calibrated_room_acoustic_simulation_auralizations","292460586_Hearing_lips_and_seeing_voices","282894528_Creation_and_calibration_method_of_acoustical_models_for_historic_virtual_reality_auralizations","273079301_Auditory_and_Visual_Contribution_to_Egocentric_Distance_and_Room_Size_Perception","246901566_Multiple_Comparisons_Among_Means"]}