{"id":"319947459_Inastemp_A_Novel_Intrinsics-as-Template_Library_for_Portable_SIMD-Vectorization","abstract":"The development of scientific applications requires highly optimized computational kernels to benefit from modern hardware. In recent years, vectorization has gained key importance in exploiting the processing capabilities of modern CPUs, whose evolution is characterized by increasing register-widths and core numbers, but stagnating clock frequencies. In particular, vectorization allows floating point operations to be performed at a higher rate than the processor’s frequency. However, compilers often fail to vectorize complex codes and pure assembly/intrinsic implementations often suffer from software engineering issues, such as readability and maintainability. Moreover, it is difficult for domain scientists to write optimized code without technical support. To address these issues, we propose Inastemp, a lightweight open-source C++ library. Inastemp offers a solution to develop hardware-independent computational kernels for the CPU. These kernels are portable across compilers and floating point precision and vectorized targeting SSE(3,4.1,4.2), AVX(2), AVX512, or ALTIVEC/VMX instructions. Inastemp provides advanced features, such as an if-else statement that vectorizes branches that cannot be removed. Our performance study shows that Inastemp has the same efficiency as pure intrinsic approaches on modern architectures. As side-results, this study provides micro benchmarks on the latest HPC architectures for three different computational kernels, emphasizing comparisons between scalar and intrinsic-based codes.","authors":["Bérenger Bramas"],"meta":["September 2017Scientific Programming 2017:1-18","DOI:10.1155/2017/5482468"],"references":["300467066_OpenVec_Portable_SIMD_Intrinsics","295253746_Extending_C_for_Explicit_Data-Parallel_Programming_via_SIMD_Vector_Types","272178514_Fast_Exponential_Computation_on_SIMD_Architectures","318911201_BOAST_A_metaprogramming_framework_to_produce_portable_and_efficient_computing_kernels_for_HPC_applications","308188807_Neat_SIMD_Elegant_vectorization_in_C_by_using_specialized_templates","290182539_Molecular_Dynamics_for_Exascale_Supercomputers","280752062_Time-Domain_BEM_for_the_Wave_Equation_Optimization_and_Hybrid_Parallelization","261960654_Sierra_a_SIMD_extension_for_C","261960344_Simple_portable_and_fast_SIMD_intrinsic_programming_generic_simd_library","247768243_The_Architecture_of_Pipelined_Computers"]}