{"id":"319966958_Automated_model_optimisation_using_the_Cylc_workflow_engine_Cyclops_v10","abstract":"Most geophysical models include a number of parameters that are not fully determined by theory, and can be ‘tuned’ to improve the model's agreement with available data. We might attempt to automate this tuning process in an objective way by employing an optimisation algorithm to find the set of parameters that minimises a cost function derived from comparing model outputs with measurements. A number of algorithms are available for solving optimisation problems, in various software programming languages, but interfacing such software to a complex geophysical model simulation, presents certain challenges. To tackle this problem, we have developed an optimisation suite (\"Cyclops\") based on the Cylc workflow engine (http://cylc.github.io/cylc/ and https://zenodo.org/badge/latestdoi/1836229) that implements a wide selection of optimisation algorithms from the NLopt python toolbox (Johnson, 2014). The Cyclops optimisation suite can be used to calibrate any modelling system that has itself been implemented as a (separate) Cylc model suite, provided it includes computation and output of the desired scalar cost function. A growing number of institutions are using Cylc to orchestrate complex distributed suites of interdependent cycling tasks within their operational forecast systems, and in such cases application of the optimisation suite is particularly straightforward.\n\nAs a test case, we applied the Cyclops to calibrate a global implementation of the Wavewatch III™ (v4.18) third generation spectral wave model, forced by ERA-Interim input fields. This was calibrated over a one-year period (1997), before applying the calibrated model to a full (1979–2016) wave hindcast. The chosen error metric was the spatial average of the root-mean-square error of hindcast significant wave height compared with collocated altimeter records. We describe the results of a calibration in which up to 19 parameters were optimised.","authors":["Richard Gorman","Hilary J. Oliver"],"meta":["September 2017Geoscientific Model Development Discussions","DOI:10.5194/gmd-2017-185"],"references":["315058424_Automated_parameter_tuning_applied_to_sea_ice_in_a_global_climate_model","308756881_Automatic_Model_Calibration_A_New_Way_to_Improve_Numerical_Weather_Forecasting","271827498_Automatic_Calibration_Tool_for_Hydrologic_Simulation_Program-FORTRAN_Using_a_Shuffled_Complex_Evolution_Algorithm","260984029_User_manual_and_system_documentation_of_WAVEWATCH_III_version_418","258662975_Objective_calibration_of_regional_climate_models","321554350_Advances_in_Optimization_and_Numerical_Analysis","309539289_Climate_scientists_open_up_their_black_boxes_to_scrutiny","305745267_The_Art_and_Science_of_Climate_Model_Tuning","302970924_A_Simplex_Method_for_Function_Minimization","285423814_Validation_of_wavewatch_iii_version_115_for_a_global_domain"]}