{"id":"319966954_Relating_Teacher_PCK_and_Teacher_Practice_Using_Classroom_Observation","abstract":"Science teachers’ pedagogical content knowledge (PCK) has been researched in many studies, yet little empirical evidence has been found to determine how this knowledge actually informs teachers’ actions in the classroom. To complement previous quantitative studies, there is a need for more qualitative studies to investigate the relationship between teacher knowledge (as formulated by the teacher) and classroom practice, especially in the context of an educational innovation. In this study we explored a possible way to investigate this relationship in an in-depth and systematic fashion. To this end, we conducted a case study with a chemistry teacher in the context of the implementation of a context-based science curriculum in The Netherlands. The teacher’s PCK was captured using the Content Representation form by Loughran, Mulhall, and Berry. We used an observation table to monitor classroom interactions in such a way that the observations could be related to specific elements of teachers’ PCK. Thus, we were able to give a detailed characterization of the correspondences and differences between the teacher’s personal PCK and classroom practice. Such an elaborate description turned out to be a useful basis for discussing mechanisms explaining the relationship between teachers’ knowledge and teachers’ actions.","authors":["Erik Barendsen","Ineke Henze"],"meta":["October 2019Research in Science Education 49(5)","DOI:10.1007/s11165-017-9637-z"],"references":["279399082_Teacher_Learning_Implications_of_New_Views_of_Cognition","324327090_Situations_in_Teaching","317953648_Naturalistic_inquiry","317953505_Situated_learning_Legitimate_peripheral_participation","313180409_Teachers'_thought_processes","311855669_Teachers'_beliefs_and_educational_research_Clearing_up_a_messy_construct","286265522_Re-examining_Pedagogical_Content_Knowledge_in_Science_Education","283095762_A_model_of_teacher_professional_knowledge_and_skill_including_PCK_Results_of_the_thinking_from_the_PCK_Summit","277530961_Pedagogical_Content_Knowing_An_Integrative_Model_for_Teacher_Preparation","273052884_Naturalistic_Inquiry"]}