{"id":"319947552_Influence_of_Personal_Preferences_on_Link_Dynamics_in_Social_Networks","abstract":"We study a unique network dataset including periodic surveys and electronic logs of dyadic contacts via smartphones. The participants were a sample of freshmen entering university in the Fall 2011. Their opinions on a variety of political and social issues and lists of activities on campus were regularly recorded at the beginning and end of each semester for the first three years of study. We identify a behavioral network defined by call and text data, and a cognitive network based on friendship nominations in ego-network surveys. Both networks are limited to study participants. Since a wide range of attributes on each node were collected in self-reports, we refer to these networks as attribute-rich networks. We study whether student preferences for certain attributes of friends can predict formation and dissolution of edges in both networks. We introduce a method for computing student preferences for different attributes which we use to predict link formation and dissolution. We then rank these attributes according to their importance for making predictions. We find that personal preferences, in particular political views, and preferences for common activities help predict link formation and dissolution in both the behavioral and cognitive networks.","authors":["Ashwin Bahulkar","Boleslaw K. Szymanski","Nitesh V Chawla","Omar Lizardo"],"meta":["September 2017Complexity 2017:1-12","DOI:10.1155/2017/4543563"],"references":["277965698_Why_Do_Liberals_Drink_Lattes","266654274_Link_prediction_in_human_mobility_networks","321300465_Handbook_of_theories_of_social_psychology","311154316_Co-evolution_of_two_networks_representing_different_social_relations_in_NetSense","310809968_Analysis_of_link_formation_persistence_and_dissolution_in_NetSense_data","284878236_Social_identity_theory","280686531_Decay_functions","266654066_Lessons_Learned_from_the_NetSense_Smartphone_Study","254078686_How_Cultural_Tastes_Shape_Personal_Networks","251590160_Shared_Contexts_and_Triadic_Closure_in_Core_Discussion_Networks"]}