{"id":"319969132_Bio-cellular_processes_modeling_on_silicon_substrate_receptor-ligand_binding_and_Michaelis_Menten_reaction","abstract":"There has been a growing interest and motivation in analog electronic circuit modeling of bio-cellular networks, which forms the basis of cellular functions of all living organisms. The complexity and size of such networks has made this task arduous, while opening up new opportunities as well. A number of modeling techniques, from mathematical models to computer simulations, have been used in this domain to aid the interpretation of such complex and sophisticated networks. This research article focuses on modeling of bio-cellular structures and processes on silicon substrate using transistors in analog domain. MOS transistor analogies for some very commonly found bio-cellular reactions namely receptor–ligand kinetics and Michaelis Menten kinetics have been presented, which are based on previously established ordinary differential equation representation models of these bio-cellular processes. It has been shown mathematically and through simulations that a number of bio-chemical entities in the kinetic processes map naturally to some electronic entities, and exploiting these similarities can drastically reduce the size of the corresponding silicon mimetics. The suggested circuits use lesser number of transistors than the existing approaches in this domain, while producing the same behavior satisfactorily. This can to some extent ease the development of larger networks with more complex interactions, hence mitigating the intricacy involved in cellular processes when viewed as a complete system and can contribute positively to multiple disciplines like genetics, bio-informatics, medical sciences, and even computer science and engineering.","authors":["Maria Waqas","Muhammad Khurram","s. M. Rezaul Hasan"],"meta":["November 2017Analog Integrated Circuits and Signal Processing 93(9):1-12","DOI:10.1007/s10470-017-1044-x"],"references":["268271084_Mathematical_Modelling_in_Systems_Biology_An_Introduction","260379477_Analog_synthetic_biology","282035283_Synthetic_Biology_A_Unifying_View_and_Review_Using_Analog_Circuits","281580060_A_synthetic_oscillatory_network_of_transcriptional_regulators","281170409_A_Cytomorphic_Chip_for_Quantitative_Modeling_of_Fundamental_Bio-Molecular_Circuits","260666321_Integrated_Circuit_Modeling_of_Biocellular_Post-Transcription_Gene_Mechanisms_Regulated_by_MicroRNA_and_Proteasome","243777759_A_quantitative_description_of_ion_currents_and_its_applications_to_conduction_and_excitation_in_nerve_membranes","241625312_Analog_transistor_models_of_bacterial_genetic_circuits","234778053_CMOS_VLSI_design_A_circuits_and_systems_perspective","229441713_Lehninger_principles_of_biochemistry_4th_ed_Nelson_D_and_Cox_M","224535567_Log-domain_circuit_models_of_chemical_reactions","51560036_An_Electronic_Analog_of_Synthetic_Genetic_Networks","48376766_Lehninger_Principles_of_Biochemistry","220625296_A_Novel_Mixed-Signal_Integrated_Circuit_Model_for_DNA-Protein_Regulatory_Genetic_Circuits_and_Genetic_State_Machines","41407069_Ligand_binding_assays_at_equilibrium_Validation_and_interpretation"]}