{"id":"319914801_Understanding_scientific_collaboration_Homophily_transitivity_and_preferential_attachment","abstract":"Scientific collaboration is essential in solving problems and breeding innovation. Coauthor network analysis has been utilized to study scholars' collaborations for a long time, but these studies have not simultaneously taken different collaboration features into consideration. In this paper, we present a systematic approach to analyze the differences in possibilities that two authors will cooperate as seen from the effects of homophily, transitivity, and preferential attachment. Exponential random graph models (ERGMs) are applied in this research. We find that different types of publications one author has written play diverse roles in his/her collaborations. An author's tendency to form new collaborations with her/his coauthors' collaborators is strong, where the more coauthors one author had before, the more new collaborators he/she will attract. We demonstrate that considering the authors' attributes and homophily effects as well as the transitivity and preferential attachment effects of the coauthorship network in which they are embedded helps us gain a comprehensive understanding of scientific collaboration.","authors":["Chenwei Zhang","Yi Bu","Ying Ding","Jian xu"],"meta":["September 2017Journal of the Association for Information Science and Technology 69(2)","DOI:10.1002/asi.23916"],"references":["316027392_A_Field_Experiment_on_Search_Costs_and_the_Formation_of_Scientific_Collaborations","280445835_Collaborating_with_People_Like_Me_Ethnic_Coauthorship_within_the_United_States","344822438_An_Introduction_to_Random_Graphs_Dependence_Graphs_and_p","326708219_Tracking_the_evolution_of_scientific_collaboration_networks","316807357_Research_Collaboration_and_Team_Science","312970191_Scientific_collaboration_networks","301233236_Clustering_and_preferential_attachment_in_growing_networks","298852493_The_Matthew_Effect_in_Science","281263059_Evolution_of_the_social_network_of_scientific_collaboration","277815637_The_Matthew_effect_in_science"]}