{"id":"319918857_Learning_analytics_in_higher_education_an_analysis_of_case_studies","abstract":"Purpose\n\nThe purpose of this paper is to present a systematic review of the mounting research work on learning analytics.\n\nDesign/methodology/approach\n\nThis study collects and summarizes information on the use of learning analytics. It identifies how learning analytics has been used in the higher education sector, and the expected benefits for higher education institutions. Empirical research and case studies on learning analytics were collected, and the details of the studies were categorized, including their objectives, approaches, and major outcomes.\n\nFindings\n\nThe results show the benefits of learning analytics, which help institutions to utilize available data effectively in decision making. Learning analytics can facilitate evaluation of the effectiveness of pedagogies and instructional designs for improvement, and help to monitor closely students’ learning and persistence, predict students’ performance, detect undesirable learning behaviours and emotional states, and identify students at risk, for taking prompt follow-up action and providing proper assistance to students. It can also provide students with insightful data about their learning characteristics and patterns, which can make their learning experiences more personal and engaging, and promote their reflection and improvement.\n\nOriginality/value\n\nDespite being increasingly adopted in higher education, the existing literature on learning analytics has focussed mainly on conventional face-to-face institutions, and has yet to adequately address the context of open and distance education. The findings of this study enable educational organizations and academics, especially those in open and distance institutions, to keep abreast of this emerging field and have a foundation for further exploration of this area.","authors":["Billy Tak-Ming Wong"],"meta":["May 2017Asian Association of Open Universities Journal 12(1):21-40","DOI:10.1108/AAOUJ-01-2017-0009"],"references":["312045421_How_do_we_start_State_and_Directions_of_Learning_Analytics_Adoption","308643396_Development_of_Open_Textbooks_Learning_Analytics_System","305175630_Using_Learning_Analytics_to_Identify_Medical_Student_Misconceptions_in_an_Online_Virtual_Patient_Environment","304157732_Learning_Analytics_Methods_Benefits_and_Challenges_in_Higher_Education_A_Systematic_Literature_Review","301591334_Reviewing_three_case-studies_of_learning_analytics_interventions_at_the_open_university_UK","301591270_Forecasting_student_achievement_in_MOOCs_with_natural_language_processing","301322387_Profiling_MOOC_Course_Returners_How_Does_Student_Behavior_Change_Between_Two_Course_Enrollments","311490180_Mining_autograding_data_in_computer_science_education","306925875_Academic_Performance_Prediction_Using_Chance_Discovery_from_Online_Discussion_Forums","301591325_Towards_triggering_higher-order_thinking_behaviors_in_MOOCs"]}