{"id":"319952803_Numerical_Solution_of_Monge-Kantorovich_Equations_via_a_Dynamic_Formulation","abstract":"We extend our previous work on a biologically inspired dynamic Monge–Kantorovich model (Facca et al. in SIAM J Appl Math 78:651–676, 2018) and propose it as an effective tool for the numerical solution of the \\(L^{1}\\)-PDE based optimal transportation model. We first introduce a new Lyapunov-candidate functional and show that its derivative along the solution trajectory is strictly negative. Moreover, we are able to show that this functional admits the optimal transport density as a unique minimizer, providing further support to the conjecture that our dynamic model is time-asymptotically equivalent to the Monge–Kantorovich equations governing \\(L^{1}\\) optimal transport. Remarkably, this newly proposed Lyapunov-candidate functional can be effectively used to calculate the Wasserstein-1 (or earth mover’s) distance between two measures. We numerically solve these equations via a simple approach based on standard forward Euler time stepping and linear Galerkin finite element. The accuracy and robustness of the proposed solver is verified on a number of test problems of mixed complexity also in comparison with other approaches proposed in the literature. Numerical results show that the proposed scheme is very efficient and accurate for the calculation the Wasserstein-1 distances.","authors":["Enrico Facca","Sara Daneri","Franco Cardin","Mario Putti"],"meta":["February 2020Journal of Scientific Computing 82(3)","DOI:10.1007/s10915-020-01170-8"],"references":["352558492_POT_Python_Optimal_Transport","333156443_Solving_Large-Scale_Optimization_Problems_with_a_Convergence_Rate_Independent_of_Grid_Size","322160565_Vector_and_Matrix_Optimal_Mass_Transport_Theory_Algorithm_and_Applications","320554856_Spectral_preconditioners_for_the_efficient_numerical_solution_of_a_continuous_branched_transport_model","319075485_A_Parallel_Method_for_Earth_Mover's_Distance","309317270_Towards_a_Stationary_Monge--Kantorovich_Dynamics_The_Physarum_Polycephalum_Experience","321595327_Numerical_Approximation_of_Partial_Differential_Equations","320909922_Adaptive_approximation_of_the_Monge-Kantorovich_problem_via_primal-dual_gap_estimates","277574162_Augmented_Lagrangian_Methods_for_Transport_Optimization_Mean_Field_Games_and_Degenerate_Elliptic_Equations","275482873_Earth_Mover's_Distances_on_Discrete_Surfaces"]}