{"id":"319986731_Elevated_Apoptosis_in_the_Liver_of_Dairy_Cows_with_Ketosis","abstract":"Background/aims: \nDairy cows with ketosis are characterized by oxidative stress and hepatic damage. The aim of this study was to investigate hepatic oxidative stress and the apoptotic status of ketotic cows, as well as the underlying apoptosis pathway.\n\nMethods: \nThe blood aspartate aminotransferase (AST), alanine aminotransferase (ALT), glutamate dehydrogenase (GLDH) and gamma-glutamyl transferase (GGT) activities and the haptoglobin (HP), serum amyloid A (SAA) and serum apoptotic cytokeratin 18 neo-epitope M30 (CK18 M30) concentrations were determined by commercially available kits and ELISA kits, respectively. Liver histology, TUNEL and Oil red O staining were performed in liver tissue samples. TG contents were measured using an enzymatic kit; Caspase 3 assays were carried out using the Caspase 3 activity assay kit; oxidation and antioxidant markers were measured using biochemical kits; apoptosis pathway were determined by qRT-PCR and western blot.\n\nResults: \nKetotic cows displayed hepatic fat accumulation. The hepatic malondialdehyde (MDA) content was significantly increased, but the activities of catalase (CAT), superoxide dismutase (SOD) and glutathione peroxidase (GSH-Px) were markedly decreased in ketotic cows compared with control cows, indicating that ketotic cows displayed severe oxidative stress. Significantly higher serum levels of the hepatic damage markers AST, ALT, GGT and GLDH were observed in ketotic cows than in control cows. The blood concentration of the apoptotic marker CK18 M30 and the number of TUNEL-positive cells in the liver of ketotic cows were 1.19- and 2.61-fold, respectively, higher than the values observed in control cows. Besides, Caspase 3 activity was significantly increased in the liver of ketosis cows. Importantly, the levels of phosphorylated c-Jun N-terminal kinase (JNK) and p38 mitogen-activated protein kinase (p38MAPK) were significantly increased but the level of phosphorylated extracellular signal-regulated kinase1/2 (ERK1/2) was markedly decreased, which further promoted tumor protein 53 (p53) expression and inhibited nuclear factor E2-related factor 2 (Nrf2) expression. The apoptosis-related molecules p21, MDM2, Caspase 3, Caspase 9 and Bax were expressed at significantly higher levels in ketotic cows than in healthy cows, whereas the anti-apoptosis molecule Bcl-2 was expressed at significantly lower levels.\n\nConclusions: \nBased on these results, ketotic cows display severe hepatic oxidative stress. The hepatic MAPK-p53-Nrf2 apoptotic pathway is over induced and partially mediated apoptotic damage in the liver.","authors":["Xiliang Du","Liang Chen","Dan Huang","Zhicheng Peng"],"meta":["September 2017Cellular Physiology and Biochemistry 43(2):568-578","DOI:10.1159/000480529"],"references":["312135655_Acetoacetate_Induces_Hepatocytes_Apoptosis_by_the_ROS-Mediated_MAPKs_Pathway_in_Ketotic_Cows","311505729_GSK-3beta_Inhibitor_Induces_Expression_of_Nrf2TrxR2_Signaling_Pathway_to_Protect_against_Renal_IschemiaReperfusion_Injury_in_Diabetic_Rats","310816914_Cinnamic_Acid_CINN_Induces_Apoptosis_and_Proliferation_in_Human_Nasopharyngeal_Carcinoma_Cells","310764140_Inhibition_of_Cartilage_Acidic_Protein_1_Reduces_Ultraviolet_B_Irradiation_Induced-Apoptosis_through_P38_Mitogen-Activated_Protein_Kinase_and_Jun_Amino-Terminal_Kinase_Pathways","309617931_Valproic_Acid_Promotes_Human_Glioma_U87_Cells_Apoptosis_and_Inhibits_Glycogen_Synthase_Kinase-3b_Through_ERKAkt_Signaling","306042247_Probiotic-derived_ferrichrome_inhibits_colon_cancer_progression_via_JNK-mediated_apoptosis","319149942_Erratum_Mitochondrial_metabolism_mediates_oxidative_stress_and_inflammation_in_fatty_liver_American_Society_for_Clinical_Investigation_2015_12512_4447-4462_DOI_101172JCI82204","309184998_b-Hydroxybutyrate_induces_bovine_hepatocyte_apoptosis_via_an_ROS-p38_signaling_pathway","305396465_Chronic_glucocorticoid_exposure_suppressed_the_differentiation_and_survival_of_embryonic_neural_stemprogenitor_cells_Possible_involvement_of_ERK_and_PI3KAkt_signaling_in_the_neuronal_differentiation","305273545_Andrographolide_protects_liver_cells_from_H2O2_induced_cell_death_by_upregulation_of_Nrf-2HO-1_mediated_via_Adenosine_A2a_receptor_signalling"]}