{"id":"319953599_A_blueprint_for_demonstrating_quantum_supremacy_with_superconducting_qubits","abstract":"Fundamental questions in chemistry and physics may never be answered due to the exponential complexity of the underlying quantum phenomena. A desire to overcome this challenge has sparked a new industry of quantum technologies with the promise that engineered quantum systems can address these hard problems. A key step towards demonstrating such a system will be performing a computation beyond the capabilities of any classical computer, achieving so-called quantum supremacy. Here, using 9 superconducting qubits, we demonstrate an immediate path towards quantum supremacy. By individually tuning the qubit parameters, we are able to generate thousands of unique Hamiltonian evolutions and probe the output probabilities. The measured probabilities obey a universal distribution, consistent with uniformly sampling the full Hilbert-space. As the number of qubits in the algorithm is varied, the system continues to explore the exponentially growing number of states. Combining these large datasets with techniques from machine learning allows us to construct a model which accurately predicts the measured probabilities. We demonstrate an application of these algorithms by systematically increasing the disorder and observing a transition from delocalized states to localized states. By extending these results to a system of 50 qubits, we hope to address scientific questions that are beyond the capabilities of any classical computer.","authors":["C. Neill","P. Roushan","K. Kechedzhi","Sergio Boixo"],"meta":["September 2017Science 360(6385)","DOI:10.1126/science.aao4309"],"references":["313642568_Quantum_Sampling_Problems_BosonSampling_and_Quantum_Supremacy","309663203_Rare_region_effects_and_dynamics_near_the_many-body_localization_transition","308913060_Achieving_quantum_supremacy_with_sparse_and_noisy_commuting_quantum_computations","305780465_Characterizing_Quantum_Supremacy_in_Near-Term_Devices","344588154_Quantum_Field_Theory_in_Strongly_Correlated_Electronic_Systems","320938282_05_petabyte_simulation_of_a_45-qubit_quantum_circuit","317240951_Dynamics_of_entanglement_and_transport_in_1D_systems_with_quenched_randomness","315799407_05_Petabyte_Simulation_of_a_45-Qubit_Quantum_Circuit","311737153_Complexity-Theoretic_Foundations_of_Quantum_Supremacy_Experiments","305683065_Periodically_Driving_a_Many-Body_Localized_Quantum_System"]}