{"id":"319923164_Analyzing_students_online_learning_behavior_in_blended_courses_using_Moodle","abstract":"Purpose\n\nThe purpose of this paper is to describe a proposal for a data-driven investigation aimed at determining whether students’ learning behavior can be extracted and visualized from action logs recorded by Moodle. The paper also tried to show whether there is a correlation between the activity level of students in online environments and their academic performance with respect to final grade.\n\nDesign/methodology/approach\n\nThe analysis was carried out using log data obtained from various courses dispensed in a university using a Moodle platform. The study also collected demographic profiles of students and compared them with their activity level in order to analyze how these attributes affect students’ level of activity in the online environment.\n\nFindings\n\nThis work has shown that data mining algorithm like vector space model can be used to aggregate the action logs of students and quantify it into a single numeric value that can be used to generate visualizations of students’ level of activity. The current investigation indicates that there is a lot of variability in terms of the correlation between these two variables.\n\nPractical implications\n\nThe value presented in the study can help instructors monitor course progression and enable them to rapidly identify which students are not performing well and adjust their pedagogical strategies accordingly.\n\nOriginality/value\n\nA plan to continue the work by developing a complete dashboard style interface that instructors can use is already underway. More data need to be collected and more advanced processing tools are necessary in order to obtain a better perspective on this issue.","authors":["Rosalina Estacio","Rodolfo Callanta Raga Jr"],"meta":["May 2017Asian Association of Open Universities Journal 12(1):52-68","DOI:10.1108/AAOUJ-01-2017-0016"],"references":["314237144_Mining_Login_Data_for_Actionable_Student_Insight","305621452_Designing_and_Implementing_of_Dynamic_Technique_for_Detecting_Learning_Style_Using_Literature_Based_Approach","303973847_Comparison_of_Probabilistic_Corpus_Based_method_and_Vector_Space_Model_for_Emotion_Recognition_from_Poems","297217478_Using_a_Course_Management_System_to_Improve_Classroom_Communication","296704201_Use_of_the_Moodle_Platform_to_Promote_an_Ongoing_Learning_When_Lecturing_General_Physics_in_the_Physics_Mathematics_and_Electronic_Engineering_Programmes_at_the_University_of_the_Basque_Country_UPVEHU","289591867_Identifying_Latent_Study_Habits_by_Mining_Learner_Behavior_Patterns_in_Massive_Open_Online_Courses","264500339_Predicting_Causes_of_Traffic_Road_Accidents_Using_Multi-_class_Support_Vector_Machines","262331386_Correlating_skill_and_improvement_in_2_MOOCs_with_a_student's_time_on_tasks","319770439_Efficient_Estimation_of_Word_Representations_in_Vector_Space","271498127_Online_exam_for_distance_educators_using_moodle"]}