{"id":"319910491_Taking_Advantage_of_Turkish_Characteristic_Features_to_Tackle_with_Authorship_Attribution_Problems_for_Turkish","abstract":"The rapid increase in the number of the electronic and online texts, such as electronic mails, online newspapers and magazines, blog posts and online forum messages has also accelerated the studies carried out on authorship attribution. Although the studies are not as abundant as in English language, there have been considerable studies on author identification in Turkish in the last fifteen years. This paper includes two parts; first part is a quick review of Turkish authorship attribution studies. The review is focused on the stylometric features that enable authors to be distinguished one from another. In the second part, we analyze the main characteristics of the Turkish language and depict our first experiments on Turkish corpora. In these lasts, we experiment different kind of n-gram and word structure, taking advantages of Turkish characteristic features by the frequent usage of gerunds in Turkish language, and use Support Vector Machines as learning algorithm.","authors":["Sirin Saygili","Tassadit Amghar","Bernard Levrat","Tankut Acarman"],"meta":["November 2016","Conference: The Eleventh International Multi-Conference on Computing in the Global Information TechnologyAt: Barcelona, Spain","Project: Turkish authorship attribution improvement"],"references":["284898072_Feature_Selection_for_Enhanced_Author_Identification_of_Turkish_Text","224952248_Machine_Learning_in_Automated_Text_Categorization","220776131_Author_Attribution_of_Turkish_Texts_by_Feature_Mining","312538118_Support-vector_networks","263083060_Turkish_and_its_Challenges_for_Natural_Language_Processing","224890646_Inference_and_Disputed_Authorship_The_Federalist","220468605_Stemming_and_N-gram_matching_for_term_conflation_in_Turkish_texts","220435062_A_Survey_of_Modern_Authorship_Attribution_Methods","46932831_A_Statistical_Method_for_Determining_Authorship","6104515_The_Characteristic_Curve_of_Composition"]}