{"id":"319980503_Bibri_Simon_Elias_Krogstie_John_2017_The_Core_Enabling_Technologies_of_Big_Data_Analytics_and_Context-Aware_Computing_for_Smart_Sustainable_Cities_A_Review_and_Synthesis","abstract":"Data sensing, information processing, and networking technologies are being fast embedded into the very fabric of the contemporary city to enable the use of innovative solutions to overcome the challenges of sustainability and urbanization. This has been boosted by the new digital transition in ICT. Driving such transition predominantly are big data analytics and context–aware computing and their increasing amalgamation within a number of urban domains, especially as their functionality involve more or less the same core enabling technologies, namely sensing devices, cloud computing infrastructures, data processing platforms, middleware architectures, and wireless networks. Topical studies tend to only pass reference to such technologies or to largely focus on one particular technology as part of big data and context–aware ecosystems in the realm of smart cities. Moreover, empirical research on the topic, with some exceptions, is generally limited to case studies without the use of any common conceptual frameworks. In addition, relatively little attention has been given to the integration of big data analytics and context–aware computing as advanced forms of ICT in the context of smart sustainable cities. This endeavor is a first attempt to address these two major strands of ICT of the new wave of computing in relation to the informational landscape of smart sustainable cities. Therefore, the purpose of this study is to review and synthesize the relevant literature with the objective of identifying and distilling the core enabling technologies of big data analytics and context–aware computing as ecosystems in relevance to smart sustainable cities, as well as to illustrate the key computational and analytical techniques and processes associated with the functioning of such ecosystems. In doing so, we develop, elucidate, and evaluate the most relevant frameworks pertaining to big data analytics and context–aware computing in the context of smart sustainable cities, bringing together research directed at a more conceptual, analytical, and overarching level to stimulate new ways of investigating their role in advancing urban sustainability. In terms of originality, a review and synthesis of the technical literature has not been undertaken to date in the urban literature, and in doing so, we provide a basis for urban researchers to draw on a set of conceptual frameworks in future research. The proposed frameworks, which can be replicated and tested in empirical research, will add additional depth and rigor to studies in the field. In addition to reviewing the important works, we highlight important applications as well as challenges and open issues. We argue that big data analytics and context–aware computing are prerequisite technologies for the functioning of smart sustainable cities of the future, as their effects reinforce one another as to their efforts for bringing a whole new dimension to the operating and organizing processes of urban life in terms of employing a wide variety of big data and context–aware applications for advancing sustainability.\n\nKeywords: Smart sustainable cities, urban sustainability, big data analytics, context–aware computing, sensors, models, data processing, cloud computing, middleware, big data and context–aware applications","authors":["Simon Elias Bibri","John Krogstie"],"meta":["November 2017Journal of Big Data 4(1)","DOI:10.1186/s40537-017-0091-6","Project: Sustainable Smart Cities"],"references":["345636384_Nano-_and_Micro-Electromechanical_Systems_Fundamentals_of_Nano-and_Microengineering","342411017_Smart_Sustainable_Cities_of_the_Future_The_Untapped_Potential_of_Big_Data_Analytics_and_Context-Aware_Computing_for_Advancing_Sustainability","324974277_Reinventing_Discovery_The_New_Era_of_Networked_Science","323386649_Sustainable_Urban_Forms_Time_to_Smarten_up_with_Big_Data_Analytics_and_Context-Aware_Computing_for_Sustainability","319394983_Artificial_Intelligence_A_Modern_Approach","319394978_Artificial_Intelligence_---_A_Modern_Approach","317000740_Towards_Cloud_Based_Smart_Cities_Data_Security_and_Privacy_Management","316549044_ICT_of_the_New_Wave_of_Computing_for_Sustainable_Urban_Forms_Their_Big_Data_and_Context-Aware_Augmented_Typologies_and_Design_Concepts","314259748_Smart_Sustainable_Cities_of_the_Future_An_Extensive_Interdisciplinary_Literature_Review","313203504_Reality_mining_Sensing_complex_social_systems"]}