{"id":"319971167_Identificacion_de_factores_que_permitan_potencializar_el_exito_de_proyectos_de_desarrollo_de_software","abstract":"Lograr el éxito en los proyectos de desarrollo de software es una tarea a la que día a día se están enfrentando las empresas productoras de software, estudios realizados por diferentes organizaciones demuestran que la tasa de éxito de los proyectos esta alrededor del 32%, y de proyectos fallidos alrededor del 24% [1], siendo la diferencia de estos una cifra relativamente baja lo que conlleva a que se deba evaluar el tema y se piense en tomar medidas; el éxito de los proyectos depende de la sincronización que se pueda tener entre diferentes factores como los humanos, los técnicos, los económicos, tiempo, alcance, entre otros. En este artículo se realiza un análisis de factores de proyectos exitosos y fallidos de una empresa de outsourcing de TI aplicando técnicas de minería de datos, con el fin de obtener patrones que permitan a la organización tomar decisiones y guiar los proyectos de software a la consecución del éxito.Para lograr tal objetivo la investigación se desarrolló siguiendo la metodología CRISP-DM, que es una metodología utilizada como referente para los proyectos de minería de datos. Finalmente se logró obtener un modelo de regresión logística que permitió determinar que los factores que inciden en el éxito de un proyecto están expresados por:Excelente definición de roles y responsabilidades para las actividades de desarrollo del proyecto, y el tamaño del equipo de proyecto; siendo estos los 2 únicos factores de los 27 estudiados capaces de explicar el éxito o fracaso de los proyectos.","authors":["Mauricio Gallego Gallego","Javier Hernández Cáceres"],"meta":["March 2015Scientia et Technica 20(1):70","DOI:10.22517/23447214.9241"],"references":["228975699_Critical_success_factors_for_software_projects_A_comparative_study","228349228_CMIN-herramienta_case_basada_en_CRISP-DM_para_el_soporte_de_proyectos_de_mineria_de_datos","223945028_Identification_of_factors_that_influence_defect_injection_and_detection_in_development_of_software_intensive_products","27299791_Introduccion_a_la_Mineria_de_Datos","277798405_Analisis_del_factor_estrategico_para_alcanzar_el_exito_de_un_proyecto_de_Gestion_del_Conocimiento_Aplicacion_al_sector_de_la_consultoria","233754771_Factores_de_exito_en_proyectos_de_desarrollo_de_software_analisis_de_la_industria_chilena_del_software","223109402_An_analysis_of_factors_affecting_software_reliability","222501164_Software_developer_perceptions_about_software_project_failure_A_case_study_Journal_of_Systems_and_Software_492-3_177-192","220092178_The_Rise_and_Fall_of_the_Chaos_Report_Figures","3152484_A_stochastic_model_of_fault_introduction_removal_during_software_development"]}