{"id":"319952718_Halving_the_cost_of_quantum_addition","abstract":"We improve the number of T gates needed to perform an n-bit adder from 8n + O(1) to 4n + O(1). We do so via a \"temporary logical-AND\" construction, which uses four T gates to store the logical-AND of two qubits into an ancilla and zero T gates to later erase the ancilla. Temporary logical-ANDs are a generally useful tool when optimizing T-counts. They can be applied to integer arithmetic, modular arithmetic, rotation synthesis, the quantum Fourier transform, Shor's algorithm, Grover oracles, and many other circuits. Because T gates dominate the cost of quantum computation based on the surface code, and temporary logical-ANDs are widely applicable, our constructions represent a significant reduction in projected costs of quantum computation. We also present an n-bit controlled adder circuit with T-count of 8n + O(1), a temporary adder that can be computed for the same cost as the normal adder but whose result can be kept until it is later uncomputed without using T gates, and discuss some other constructions whose T-count is improved by the temporary logical-AND.","authors":["Craig Gidney"],"meta":["September 2017Quantum 2","DOI:10.22331/q-2018-06-18-74"],"references":["328469422_Encoding_Electronic_Spectra_in_Quantum_Circuits_with_Linear_T_Complexity","319614139_A_Short_Introduction_to_Topological_Quantum_Computation","317650083_T-count_Optimized_Design_of_Quantum_Integer_Multiplication","313254175_Blueprint_for_a_microwave_trapped_ion_quantum_computer","282905686_Building_logical_qubits_in_a_superconducting_quantum_computing_system","261837868_Superconducting_quantum_circuits_at_the_surface_code_threshold_for_fault_tolerance","308646629_Application_of_a_Resource_Theory_for_Magic_States_to_Fault-Tolerant_Quantum_Computing","265564295_Quantum_Computation_and_Quantum_Information_10th_Anniversary_Edition","237284336_Topological_quantum_memoryaO","233947256_Novel_constructions_for_the_fault-tolerant_Toffoli_gate"]}