{"id":"319929034_Causal_Compatibility_Inequalities_Admitting_of_Quantum_Violations_in_the_Triangle_Structure","abstract":"It has long been recognized that certain quantum correlations are incompatible with particular assumption about classical causal structure. Given a causal structure of unknown classicality, the presence of such correlations certifies the non-classical nature of the causal structure in a device independent fashion. In structures where all parties share a common resource, these non-classical correlations are also known as non-local correlations. Any constraint satisfied by all correlations which are classically compatible with a given causal structure defines a causal compatibility criterion. Such criteria were recently derived for the Triangle structure (arXiv:1609.00672) in the form of polynomial inequalities, begging the question: do any of those inequalities admit violation by quantum correlations? Numerical investigation suggests not, and we further conjecture that the set of correlations admitted by the classical Triangle structure is equivalent to the set of correlations admitted by its quantum generalization whenever the three observable variables are binary. Our main contribution in this work, however, is the derivation of new causal compatibility inequalities for the Triangle structure which do admit quantum violation. This provides the first robust-to-noise witness of quantum correlations in the Triangle structure. We conclude by considering the possibility of quantum resources potentially qualitatively different from those known previously.","authors":["Thomas C. Fraser","Elie Wolfe"],"meta":["September 2017","DOI:10.1103/PhysRevA.98.022113"],"references":["318587447_The_inflation_technique_solves_completely_the_classical_inference_problem","307604237_The_Inflation_Technique_for_Causal_Inference_with_Latent_Variables","302575317_Non-Shannon_inequalities_in_the_entropy_vector_approach_to_causal_structures","323130140_On_the_Einstein_Podolsky_Rosen_paradox","319186970_The_Elegant_Joint_Quantum_Measurement_and_some_conjectures_about_N-locality_in_the_Triangle_and_other_Configurations","312760020_Nested_Markov_Properties_for_Acyclic_Directed_Mixed_Graphs","280821144_Polynomial-Time_Algorithms_for_Prime_Factorization_and_Discrete_Logarithms_on_a_Quantum_Computer","277098282_Jarlskog's_Parametrization_of_Unitary_Matrices_and_Qudit_Theory","275697437_Causality_Models_Reasoning_and_Inference","270763541_Margins_of_discrete_Bayesian_networks"]}