{"id":"320036887_Virtual_Plants_Need_Water_Too_Functional-Structural_Root_System_Models_in_the_Context_of_Drought_Tolerance_Breeding","abstract":"Developing a sustainable agricultural model is one of the great challenges of the coming years. The agricultural practices inherited from the Green Revolution of the 1960s show their limits today, and new paradigms need to be explored to counter rising issues such as the multiplication of climate-change related drought episodes. Two such new paradigms are the use of functional-structural plant models to complement and rationalize breeding approaches and a renewed focus on root systems as untapped sources of plant amelioration. Since the late 1980s, numerous functional and structural models of root systems were developed and used to investigate the properties of root systems in soil or lab-conditions. In this review, we focus on the conception and use of such root models in the broader context of research on root-driven drought tolerance, on the basis of root system architecture (RSA) phenotyping. Such models result from the integration of architectural, physiological and environmental data. Here, we consider the different phenotyping techniques allowing for root architectural and physiological study and their limits. We discuss how QTL and breeding studies support the manipulation of RSA as a way to improve drought resistance. We then go over the integration of the generated data within architectural models, how those architectural models can be coupled with functional hydraulic models, and how functional parameters can be measured to feed those models. We then consider the assessment and validation of those hydraulic models through confrontation of simulations to experimentations. Finally, we discuss the up and coming challenges facing root systems functional-structural modeling approaches in the context of breeding.","authors":["Adama Ndour","Vincent Vadez","Christophe Pradal","Mikaël Lucas"],"meta":["September 2017Frontiers in Plant Science 8:1577","DOI:10.3389/fpls.2017.01577"],"references":["314192848_Towards_quantitative_root_hydraulic_phenotyping_novel_mathematical_functions_to_calculate_plant-scale_hydraulic_parameters_from_root_system_functional_and_structural_traits","313226449_Reshaping_Plant_Biology_Qualitative_and_Quantitative_Descriptors_for_Plant_Morphology","303552719_Genome-Wide_Association_Study_for_Traits_Related_to_Plant_and_Grain_Morphology_and_Root_Architecture_in_Temperate_Rice_Accessions","300086217_Challenges_in_imaging_and_predictive_modeling_of_rhizosphere_processes","299472626_Genomics-assisted_breeding_in_fruit_trees","313761606_Soil_water_uptake_and_water_transport_through_root_systems","312479459_Scientific_workflows_for_computational_reproducibility_in_the_life_sciences_Status_challenges_and_opportunities","311893171_Overcoming_the_Law_of_the_Hidden_in_Cyberinfrastructures","304383292_InfraPhenoGrid_A_scientific_workflow_infrastructure_for_Plant_Phenomics_on_the_Grid","304330127_Pragmatic_hydraulic_theory_predicts_stomatal_responses_to_climatic_water_deficits"]}