{"id":"320032918_Performance_Bounds_for_Parameter_Estimation_under_Misspecified_Models_Fundamental_Findings_and_Applications","abstract":"Inferring information from a set of acquired data is the main objective of any signal processing (SP) method. In particular, the common problem of estimating the value of a vector of parameters from a set of noisy measurements is at the core of a plethora of scientific and technological advances in the last decades; for example, wireless communications, radar and sonar, biomedicine, image processing, and seismology, just to name a few. Developing an estimation algorithm often begins by assuming a statistical model for the measured data, i.e. a probability density function (pdf) which if correct, fully characterizes the behaviour of the collected data/measurements. Experience with real data, however, often exposes the limitations of any assumed data model since modelling errors at some level are always present. Consequently, the true data model and the model assumed to derive the estimation algorithm could differ. When this happens, the model is said to be mismatched or misspecified. Therefore, understanding the possible performance loss or regret that an estimation algorithm could experience under model misspecification is of crucial importance for any SP practitioner. Further, understanding the limits on the performance of any estimator subject to model misspecification is of practical interest. Motivated by the widespread and practical need to assess the performance of a mismatched estimator, the goal of this paper is to help to bring attention to the main theoretical findings on estimation theory, and in particular on lower bounds under model misspecification, that have been published in the statistical and econometrical literature in the last fifty years. Secondly, some applications are discussed to illustrate the broad range of areas and problems to which this framework extends, and consequently the numerous opportunities available for SP researchers.","authors":["Stefano Fortunati","Fulvio Gini","Maria V Greco","Christ D. Richmond"],"meta":["November 2017IEEE Signal Processing Magazine 34(6)","DOI:10.1109/MSP.2017.2738017"],"references":["312419547_On_Lower_Bounds_for_Non-Standard_Deterministic_Estimation","309474251_Matched_mismatched_and_robust_scatter_matrix_estimation_and_hypothesis_testing_in_complex_t-distributed_data","318658541_Slepian-Bangs-type_formulas_and_the_related_Misspecified_Cramer-Rao_Bounds_for_Complex_Elliptically_Symmetric_Distributions","312911773_Maximum_likelihood_estimation_of_misspecified_models","308087352_Bayesian_framework_and_radar_On_misspecified_bounds_and_radar-communication_cooperation","300414044_Methods_and_bounds_for_waveform_parameter_estimation_with_a_misspecified_model","299954931_On_the_Cramer-Rao_lower_bound_under_model_mismatch","299369083_The_Constrained_Misspecified_Cramer-Rao_Bound","292981484_The_Misspecified_Cramer-Rao_Bound_and_Its_Application_to_Scatter_Matrix_Estimation_in_Complex_Elliptically_Symmetric_Distributions","282982279_Prior_mismatch_in_Bayesian_direction_of_arrival_estimation_for_sparse_arrays"]}