{"id":"320091125_Multiscale_representation_of_simulated_time","abstract":"To better support multiscale modeling and simulation, we present a multiscale time representation consisting of data types, data structures, and algorithms that collectively support the recording of past events and scheduling of future events in a discrete event simulation. Our approach addresses the drawbacks of conventional time representations: limited range in the case of 32- or 64-bit fixed-point time values; problematic rounding errors in the case of floating-point numbers; and the lack of a universally acceptable precision level in the case of brute force approaches. The proposed representation provides both extensive range and fine resolution in the timing of events, yet it stores and manipulates the majority of event times as standard 64-bit numbers. When adopted for simulation purposes, the representation allows a domain expert to choose a precision level for his/her model. This time precision is honored by the simulator even when the model is integrated with other models of vastly different time scales. Making use of C++11 programming language features and the Discrete Event System Specification formalism, we implemented a simulator to test the time representation and inform a discussion on its implications for collaborative multiscale modeling efforts.","authors":["Rhys Goldstein","Azam Khan","Olivier Dalle","G. A. Wainer"],"meta":["September 2017SIMULATION: Transactions of The Society for Modeling and Simulation International 94(6):003754971772686","DOI:10.1177/0037549717726868","Project: Systems Design and Simulation"],"references":["316669380_A_Taxonomy_of_Event_Time_Representations","310794910_A_Quantum_of_Continuous_Simulated_Time","270163781_Asynchronous_coupling_of_hybrid_models_for_efficient_simulation_of_multiscale_systems","313005374_A_general_framework_for_time_granularity_and_its_application_to_temporal_reasoning","311474540_The_threshold_of_event_simultaneity","308536579_Semantics_of_multisampling_systems","305671945_System_Entity_Structure_Extension_to_Integrate_Abstraction_Hierarchy_and_Time_Granularity_into_DEVS_Modeling_and_Simulation","282743166_Anton_2_Raising_the_Bar_for_Performance_and_Programmability_in_a_Special-Purpose_Molecular_Dynamics_Supercomputer","269258494_A_data_type_for_discretized_time_representation_in_DEVS","268895559_The_Art_of_Molecular_Dynamics_Simulaton"]}