{"id":"320057944_OPEN_EDUCATIONAL_RESOURCES_UTILIZATION_I_N_TANZANIAN_HIGHER_LEARNING_INSTITUTIONS","abstract":"Tanzania has recently embarked on application of Information and Communication Technologies (ICT) in teaching and learning especially in Higher Learning Institutions (HLIs). Despite the observed countrywide ubiquitous use of internet, access to plenty of open educational resources (OER), several challenges on OER use are yet to be identified and clearly addressed. Necessary changes in the curriculum, teaching methods and institutional management procedures are required. While OER are designed as \" learner centred \" , \" teacher-centred \" method is predominant in Tanzania. Incompatibility between OER and the educational system may culminate into confusion among students, instructors and educators. The changing role of lecturers, tasked in forging parity between the OER and the situations in HLIs forms another challenge. The origin of OER used in Tanzanian HLIs probes on both their quality and utility. All these issues need to be addressed. This paper explores the teaching/learning system in the verge of vast utilization of the OER in Tanzania using meta-analysis that combines facts, data and findings from previous studies. It identifies the nature and character of teaching/learning process in Tanzanian HLIs, locates the OER use, uncovers challenges facing effective accommodation of OER; and highlights ing policy implication to Tanzania. The findings indicate high accessibility of OER to lecturers, students and educators in Tanzania, with the evident lack of national policies and guidelines on OER use. The education system is not in conformity with OER requirements in terms of both syllabi and pedagogy. Therefore major adjustments are recommended on the transformation of the educational system for countrywide sustainable OER utilization.","authors":["Michael John Haule"],"meta":["November 2015","Project: Education and Information Technology"],"references":["280231210_Growing_an_Institutional_Health_OER_Initiative_A_Case_Study_of_the_University_of_Ghana","235984502_Open_educational_resources_Opportunities_and_challenges","44075539_Models_for_Sustainable_Open_Educational_Resources","30502820_Open_Educational_Resources_-_Opportunities_and_Challenges_for_Higher_Education","28215644_Open_Educational_Resources_and_Practices","292766817_Open_educational_practices_and_resources","230793057_Giving_Knowledge_for_Free_The_Emergence_of_open_educational_resources"]}