{"id":"320049880_Similarity_Digest_Search_A_Survey_and_Comparative_Analysis_of_Strategies_to_Perform_Known_File_Filtering_Using_Approximate_Matching","abstract":"Digital forensics is a branch of Computer Science aiming at investigating and analyzing electronic devices in the search for crime evidence. There are several ways to perform this search. Known File Filter (KFF) is one of them, where a list of interest objects is used to reduce/separate data for analysis. Holding a database of hashes of such objects, the examiner performs lookups for matches against the target device. However, due to limitations over hash functions (inability to detect similar objects), new methods have been designed, called approximate matching. This sort of function has interesting characteristics for KFF investigations but suffers mainly from high costs when dealing with huge data sets, as the search is usually done by brute force. To mitigate this problem, strategies have been developed to better perform lookups. In this paper, we present the state of the art of similarity digest search strategies, along with a detailed comparison involving several aspects, as time complexity, memory requirement, and search precision. Our results show that none of the approaches address at least these main aspects. Finally, we discuss future directions and present requirements for a new strategy aiming to fulfill current limitations.","authors":["Vitor Hugo G Moia","Marco Aurelio Amaral Henriques"],"meta":["September 2017Security and Communication Networks 2017(5.2, article 1):1-17","DOI:10.1155/2017/1306802","Project: Sampling and similarity hashes on digital forensics field"],"references":["299411968_An_Efficient_Similarity_Digests_Database_Lookup_-_A_Logarithmic_Divide_Conquer_Approach","316849696_A_Comparison_of_Fuzzy_Hashes_Evaluation_Guidelines_and_Future_Suggestions","308773985_Bytewise_Approximate_Matching_The_Good_The_Bad_and_The_Unknown","299411899_Security_and_implementation_analysis_of_the_similarity_digest_sdhash","299411783_Approximate_Matching_Definition_and_Terminology","292985174_How_Cuckoo_Filter_Can_Improve_Existing_Approximate_Matching_Techniques","292550167_Using_Randomization_to_Attack_Similarity_Digests","289612164_Using_Approximate_Matching_to_Reduce_the_Volume_of_Digital_Data","287114136_Similarity_Hashing_Based_on_Levenshtein_Distances","286400311_Cuckoo_Filter"]}