{"id":"320074028_Tightening_Contention_Delays_While_Scheduling_Parallel_Applications_on_Multi-core_Architectures","abstract":"Multi-core systems are increasingly interesting candidates for executing parallel real-time applications, in avionic, space or automotive industries, as they provide both computing capabilities and power efficiency. However, ensuring that timing constraints are met on such platforms is challenging, because some hardware resources are shared between cores.\nAssuming worst-case contentions when analyzing the schedulability of applications may result in systems mistakenly declared unschedulable, although the worst-case level of contentions can never occur in practice. In this paper, we present two contention-aware scheduling strategies that produce a time-triggered schedule of the application’s tasks. Based on knowledge of the application’s structure, our scheduling strategies precisely estimate the effective contentions, in order to minimize the overall makespan of the schedule. An Integer Linear Programming (ILP) solution of the scheduling problem is presented, as well as a heuristic solution that generates schedules very close to ones of the ILP (5% longer on average), with a much lower time complexity. Our heuristic improves by 19% the overall makespan of the resulting schedules compared to a worst-case contention baseline.","authors":["Benjamin Rouxel","Steven Derrien","Isabelle Puaut"],"meta":["September 2017ACM Transactions on Embedded Computing Systems 16(5s):1-20","DOI:10.1145/3126496"],"references":["279233031_A_framework_for_memory_contention_analysis_in_multi-core_platforms","278632775_Bounding_Memory_Interference_Delay_in_COTS-based_Multi-Core_Systems","277313064_Mixed-criticality_scheduling_on_cluster-based_manycores_with_shared_communication_and_storage_resources","316950059_WCET-aware_parallelization_of_model-based_applications_for_multi-cores_The_ARGO_approach","310821149_Response_Time_Analysis_of_Synchronous_Data_Flow_Programs_on_a_Many-Core_Processor","308703558_Parallelism-Aware_Memory_Interference_Delay_Analysis_for_COTS_Multicore_Systems","301966698_Contention-Free_Execution_of_Automotive_Applications_on_a_Clustered_Many-Core_Platform","301453294_A_contention-sensitive_fine-grained_locking_protocol_for_multiprocessor_real-time_systems","288385530_Evaluation_of_resource_arbitration_methods_for_multi-core_real-time_systems","271828336_Linear_and_Nonlinear_Optimization_Second_Edition"]}