{"id":"320072170_Towards_Taming_Variability_Models_in_the_Wild","abstract":"Software Product Lines (SPLs) are families of related software systems that provide different combinations of features. Extensive research and application attest to the significant economical and technological benefits of employing SPL practices. Variability models represent the feature combinations and the properties of the software products of SPLs. Kconfig configuration files from open source projects have been proposed as large and realistic case studies for research on analysis of variability models. However, despite the extensive work on this subject, the seemingly direct approach of translating Kconfig to Binary Decision Diagrams (BDDs) — a representation that has shown significant advantages for complex analysis of variability models — has not been explored. To address this gap, we propose a simple translation scheme which we evaluate with five case studies. Our encouraging results indicate the feasibility of our approach and open up avenues for further research.","authors":["David Fernandez-Amoros","Ruben Heradio","Carlos Cerrada","Enrique Herrera-Viedma"],"meta":["September 2017","DOI:10.3233/978-1-61499-800-6-454","Conference: International Conference on Intelligent Software Methodologies, Tools, and Techniques","Project: Binary Decision Diagrams for Variability Models"],"references":["320071406_Binary_Decision_Diagram_Algorithms_to_Perform_Hard_Analysis_Operations_on_Variability_Models","269853958_A_Classification_and_Survey_of_Analysis_Strategies_for_Software_Product_Lines","267998470_Efficient_Reasoning_Techniques_for_Large_Scale_Feature_Models","265914137_Speeding_up_Derivative_Configuration_from_Product_Platforms","265339563_A_Scalable_Approach_to_Exact_Model_and_Commonality_Counting_for_Extended_Feature_Models","262310810_Scalable_analysis_of_variable_software","261045422_A_Study_of_Variability_Models_and_Languages_in_the_Systems_Software_Domain","308821030_Presence-Condition_Simplification_in_Highly_Configurable_Systems","296076295_Mastering_Variability_Challenges_in_Linux_and_Related_Highly-Configurable_System_Software","262245375_Usage_scenarios_for_feature_model_synthesis"]}