{"id":"320033090_Machine_Learning_for_Networking_Workflow_Advances_and_Opportunities","abstract":"Recently, machine learning has been used in every possible field to leverage its amazing power. For a long time, the net-working and distributed computing system is the key infrastructure to provide efficient computational resource for machine learning. Networking itself can also benefit from this promising technology. This article focuses on the application of Machine Learning techniques for Networking (MLN), which can not only help solve the intractable old network questions but also stimulate new network applications. In this article, we summarize the basic workflow to explain how to apply the machine learning technology in the networking domain. Then we provide a selective survey of the latest representative advances with explanations on their design principles and benefits. These advances are divided into several network design objectives and the detailed information of how they perform in each step of MLN workflow is presented. Finally, we shed light on the new opportunities on networking design and community building of this new inter-discipline. Our goal is to provide a broad research guideline on networking with machine learning to help and motivate researchers to develop innovative algorithms, standards and frameworks.","authors":["Mowei Wang","Yong Cui","Guanxin Wang","Shihan Xiao"],"meta":["September 2017IEEE Network PP(99)","DOI:10.1109/MNET.2017.1700200"],"references":["266147390_PCC_Re-architecting_Congestion_Control_for_Consistent_High_Performance","317252242_Routing_or_Computing_The_Paradigm_Shift_Towards_Intelligent_Computer_Network_Packet_Transmission_Based_on_Deep_Learning","317146927_State-of-the-Art_Deep_Learning_Evolving_Machine_Intelligence_Toward_Tomorrow's_Intelligent_Network_Traffic_Control_Systems","311782493_The_Deep_Learning_Vision_for_Heterogeneous_Network_Traffic_Control_Proposal_Challenges_and_Future_Perspective","311756035_Online_flow_size_prediction_for_improved_network_routing","311755300_Predicting_future_traffic_using_Hidden_Markov_Models","309640847_Resource_Management_with_Deep_Reinforcement_Learning","305782815_CS2P_Improving_Video_Bitrate_Selection_and_Adaptation_with_Data-Driven_Throughput_Prediction","275376847_Robust_Network_Traffic_Classification","262272018_TCP_ex_Machina_Computer-Generated_Congestion_Control","221164618_A_Knowledge_Plane_for_the_Internet"]}