{"id":"320033345_Low-Latency_Millimeter-Wave_Communications_Traffic_Dispersion_or_Network_Densification","abstract":"This paper investigates two strategies to reduce the communication delay in future wireless networks: traffic dispersion and network densification. A hybrid scheme that combines these two strategies is also considered. The probabilistic delay and effective capacity are used to evaluate performance. For probabilistic delay, the violation probability of delay, i.e., the probability that the delay exceeds a given tolerance level, is characterized in terms of upper bounds, which are derived by applying stochastic network calculus theory. In addition, to characterize the maximum affordable arrival traffic for mmWave systems, the effective capacity, i.e., the service capability with a given quality-of-service (QoS) requirement, is studied. The derived bounds on the probabilistic delay and effective capacity are validated through simulations. These numerical results show that, for a given average system gain, traffic dispersion, network densification, and the hybrid scheme exhibit different potentials to reduce the end-to-end communication delay. For instance, traffic dispersion outperforms network densification, given high average system gain and arrival rate, while it could be the worst option, otherwise. Furthermore, it is revealed that, increasing the number of independent paths and/or relay density is always beneficial, while the performance gain is related to the arrival rate and average system gain, jointly. Therefore, a proper transmission scheme should be selected to optimize the delay performance, according to the given conditions on arrival traffic and system service capability.","authors":["Guang Yang","Ming Xiao","H. Vincent Poor"],"meta":["September 2017IEEE Transactions on Communications PP(99)","DOI:10.1109/TCOMM.2018.2817199"],"references":["317032004_Ultra-Reliable_and_Low_Latency_Communication_in_mmWave-Enabled_Massive_MIMO_Networks","301845022_Achieving_Ultra-Low_Latency_in_5G_Millimeter_Wave_Cellular_Networks","283948606_Delay_Minimization_for_Data_Dissemination_in_Large-Scale_VANETs_with_Buses_and_Taxis","277929330_Wideband_Millimeter-Wave_Propagation_Measurements_and_Channel_Models_for_Future_Wireless_Communication_System_Design","316905101_Progressive_channel_estimation_for_ultra-low_latency_millimeter-wave_communications","316530792_Millimeter_Wave_Communications_for_Future_Mobile_Networks_Guest_Editorial_Part_I","316025329_5G_A_Tutorial_Overview_of_Standards_Trials_Challenges_Deployment_and_Practice","305780272_Delay_and_Backlog_Analysis_for_60_GHz_Wireless_Networks","297246094_STABILITY_QUEUE_LENGTH_AND_DELAY_OF_DETERMINISTIC_AND_STOCHASTIC_QUEUING-NETWORKS","285445910_Network-Layer_Performance_Analysis_of_Multihop_Fading_Channels"]}