{"id":"320059506_Theoretical_analysis_and_numerical_simulation_on_the_process_mechanism_of_two-roller_straightening","abstract":"The two-roller straightening process has an irreplaceable position in the finishing process of metal bars. In this paper, the deformation of bar is macroscopically recognized by analyzing the deformation path in the roller gap. Graphic method and mathematical induction are adopted to analyze the deformation process of the section of bar. The equation of residual curvature and the unified equation of residual curvature are established. It is proved that although the initial curvature of each section of bar is different, the difference of initial curvature is eliminated by the reciprocating bending, and the process mechanism of the two-roller straightening is revealed. The speed of curvature unification is determined mainly by the ratio of plastic modulus to elastic modulus. The greater the ratio of plastic modulus to elastic modulus is, the slower the speed of curvature uniformity is, and the more the bending time required. Then, the quantitative analysis model and finite element model of the two-roller straightening process are established by taking the three-section constant curvature roller gap model as an example. The stress, strain, and straightness are discussed, and the variation of the elastic area ratio, the residual curvature, and the residual deflection with the bending time is quantitatively analyzed. The results verify the process mechanism of the two-roller straightening, and the design principle of roller shape is given.","authors":["Yu Gaochao","Ruixue Zhai","Jun Zhao","Rui Ma"],"meta":["February 2018The International Journal of Advanced Manufacturing Technology 94(9):1-11","DOI:10.1007/s00170-017-1120-5"],"references":["309384225_Theoretical_analysis_and_experimental_investigations_on_the_symmetrical_three-roller_setting_round_process","306270065_Prediction_of_Maximum_Section_Flattening_of_Thin-walled_Circular_Steel_Tube_in_Continuous_Rotary_Straightening_Process","305486061_A_Simplified_Model_of_Maximum_Cross-section_Flattening_in_Continuous_Rotary_Straightening_Process_of_Thin-walled_Circular_Steel_Tubes","304715257_Curvature_and_Residual_Stress_Analysis_in_Rotational_Leveling_of_Bars","293801518_Novel_approach_to_computational_simulation_of_cross_roll_straightening_of_bars","293143349_FEM_Analysis_of_Tube_Straightener_Adopting_Implicit_Scheme","291848293_Numerical_simulation_and_application_for_process_parameters_of_two-roll_straightening","289967433_Analysis_of_interval_between_guides_during_two-roll_straightening_process","289584189_A_mechanical_model_of_symmetrical_three-roller_setting_round_process_The_static_bending_stage","276931936_Experimental_characterization_and_modelling_of_triaxial_residual_stresses_in_straightened_railway_rails"]}