{"id":"3200124_Multicast_Routing_in_Wireless_Mesh_Networks_Minimum_Cost_Trees_or_Shortest_Path_Trees","abstract":"There exist two fundamental approaches to multicast routing: shortest path trees (SPTs) and minimum cost trees (MCTs). The SPT algorithms minimize the distance (or cost) from the sender to each receiver, whereas the MCT algorithms minimize the overall cost of the multicast tree. Due to the very large scale and unknown topology of the Internet, computing MCTs for multicast routing in the Internet is a very complex problem. As a result, the SPT approach is the more commonly used method for multicast routing in the Internet, because it is easy to implement and gives minimum delay from the sender to each receiver, a property favored by many real-life applications. Unlike the Internet, a wireless mesh network (WMN) has a much smaller size, and its topology can be made known to all nodes in the network. This makes the MCT approach an equally viable candidate for multicast routing in WMNs. However, it is not clear how the two types of trees compare when used in WMNs. In this article we present a simulation-based performance comparison of SPTs and MCTs in WMNs, using performance metrics, such as packet delivery ratio, end-to-end delay, and traffic impacts on unicast flows in the same network.","authors":["Uyen Trang Nguyen","Jin Xu"],"meta":["December 2007IEEE Communications Magazine 45(11):72 - 77","DOI:10.1109/MCOM.2007.4378324","SourceIEEE Xplore","Project: Multicast routing in wireless mesh networks"],"references":["227056882_A_Fast_Algorithm_for_Steiner_Trees","226738451_An_116-approximation_algorithm_for_the_network_Steiner_problem","221505213_Approximating_Optimal_Multicast_Trees_in_Wireless_Multihop_Networks","267551650_Multicast_in_Wireless_Mesh_Networks","239539891_Multicasting_on_the_Internet_and_its_Applications","222813654_Wireless_Mesh_Networks_a_survey","220689025_Introduction_to_the_Theory_of_Computation","220555391_Introduction_to_the_Theory_of_Computation","202880414_Ad_Hoc_Wireless_Networks_Architecures_and_Protocols","3436092_Multichannel_Mesh_networks_Challenges_and_protocols"]}