{"id":"320077586_LE_GROUPE_DE_DISCUSSION_ET_LE_QUESTIONNAIRE_METHODES_DE_DIAGNOSTIC_DE_LA_SITUATION_D'ENSEIGNEMENT_D'INFORMATIQUE_AU_SECONDAIRE","abstract":"Contexte: Il apparait clairement qu’actuellement, l’informatique est la principale source de l’innovation scientifique et technologique. De ce fait, elle est maintenant reconnue comme discipline scolaire dans tous les systèmes éducatifs soucieux de former des individus aptes à vivre dans le contexte actuel. Elle s’avère même la discipline centrale fournissant les outils de maîtrise des technologies en perpétuel développement. Objectifs: Le but de cette enquête est d’évaluer la situation de l’enseignement de l’informatique dans les écoles. Méthodes: Pour cela, Nous avons utilisé deux méthodes d’analyse bien connues : Groupes de discussion et le Questionnaire crayon/papier. Résultats: Les résultats obtenus dans notre étude nous permettent de signaler l’importance de la refonte des programmes éducatifs informatiques assurant l’enseignement sur des bases éducatives et pédagogiques indispensables. Faut-il négliger les 75% des jeunes qui ne visitent les sites webs que pour le chatting ou bien pour se connecter au réseau social Facebook ? N’est-il pas opportun de profiter des 96% des jeunes apprenants qui possèdent des ordinateurs chez eux ? Ne faut-il pas renfoncer l’intégration de leurs acquis et de leurs compétences en informatique afin de développer leur créativité en la matière. Conclusions: Les résultats du questionnaire et Groupes de discussion sont similaires et complémentaires. Il devient clair que l'utilisation de la Groupes de discussion et le questionnaire sont des outils efficaces pour diagnostiquer les difficultés et obstacles des élèves du secondaire en Informatique. Donc, le groupe de discussion peut être utilisés non seulement pour identifier les problèmes des élèves avec des notions scientifiques en Informatique, mais aussi dans d'autres matières.\nMots-clés: Informatique, groupes de discussion, Questionnaire.","authors":["El Hassan El Hassouny","Fatiha Kaddari","Abdelrhani Elachqar","Barouaca Hassan B Hassan"],"meta":["November 2016"],"references":["326658436_LE_GROUPE_DE_DISCUSSION_LA_TECHNIQUE_DU_GROUPE_NOMINALE_ET_LE_QUESTIONNAIRE_METHODES_DE_DIAGNOSTIC_DES_OBSTACLES_EN_OPTIQUE_GEOMETRIQUE_AU_SECONDAIRE","326658382_NOUVELLE_METHODOLOGIE_BASEE_SUR_TROIS_TECHNIQUES_D'ANALYSE_POUR_LE_DIAGNOSTIC_DES_OBSTACLES_EN_MECANIQUE_AU_SECONDAIRE_GROUPE_DE_DISCUSSION_TECHNIQUE_DU_GROUPE_NOMINAL_ET_LE_QUESTIONNAIREE","220653473_Integrating_nominal_group_technique_and_joint_application_development_for_improved_systems_requirements_determination","38175408_Breaking_down_the_barriers_Using_focus_groups_to_research_small_and_medium-sized_enterprises","305389482_Focus_Groups_A_Practical_Guide_for_Applied_Research","270255174_Review_Long_Range_Forecasting--From_Crystal_Ball_to_Computer","247882220_The_focused_interview_A_manual_of_Problems_and_Procedures","223946642_Clinical_education_and_training_Using_the_nominal_group_technique_in_research_with_radiographers_to_identify_factors_affecting_quality_and_capacity","13082373_The_use_of_focus_group_methodology_-_With_selected_examples_from_sexual_health_research","7786450_The_focus_group_method_Insights_from_focus_group_interviews_on_sexual_health_with_adolescents"]}