{"id":"320085365_PET_Waste_Classification_Method_and_Plastic_Waste_DataBase_-_WaDaBa","abstract":"The main purpose of this work was creation of a plastic waste database of images of objects constituting the typical contents of municipal waste. This group of waste, by using methods of Computer Vision can be automatically selected on the sorting lines businesses for waste disposal. Digital images of items that will be received for processing should reflect the specific conditions of places where real objects have to be found. Thus, each thing is placed in this database should be presented in the course of several collections of images, taking into account different lighting conditions and different arrangement relative to the image recorder, and the different degree of deformation of these objects as a result of previous processes. Images created in the collection will be divided into groups based on the type of material from which individual objects were made. An second main aim of the article is to present the method of plastic waste selection based on histogram analysis. The method has to be fast so that it can be used in a waste sorting plant.","authors":["Janusz Bobulski","Jacek Piątkowski"],"meta":["January 2018","DOI:10.1007/978-3-319-68720-9_8","Conference: International Conference on Image Processing and Communications"],"references":["313890408_Multimodal_face_recognition_method_with_two-dimensional_hidden_Markov_model","308012924_Recycling_of_plastic_solid_waste_A_state_of_art_review_and_future_applications","305771011_Waste_and_Innovation","269280987_Municipal_solid_waste_composition_Sampling_methodology_statistical_analyses_and_case_study_evaluation","308387565_A_review_on_automated_sorting_of_source-separated_municipal_solid_waste_for_recycling","300336984_Combined_Imaging_System_for_Taking_Facial_Portraits_in_Visible_and_Thermal_Spectra","233485651_The_Good_the_Bad_and_the_Ugly_in_EU_Migration_Law_Is_the_European_Parliament_Becoming_Bad_and_Ugly_The_Adoption_of_Directive_200815_The_Returns_Directive"]}