{"id":"320050159_Super-Resolution_Community_Detection_for_Layer-Aggregated_Multilayer_Networks","abstract":"Applied network science often involves preprocessing network data before applying a network-analysis method, and there is typically a theoretical disconnect between these steps. For example, it is common to aggregate time-varying network data into windows prior to analysis, and the trade-offs of this preprocessing are not well understood. Focusing on the problem of detecting small communities in multilayer networks, we study the effects of layer aggregation by developing random-matrix theory for modularity matrices associated with layer-aggregated networks with N nodes and L layers, which are drawn from an ensemble of Erdős–Rényi networks with communities planted in subsets of layers. We study phase transitions in which eigenvectors localize onto communities (allowing their detection) and which occur for a given community provided its size surpasses a detectability limit K^{*}. When layers are aggregated via a summation, we obtain K^{*}∝O(sqrt[NL]/T), where T is the number of layers across which the community persists. Interestingly, if T is allowed to vary with L, then summation-based layer aggregation enhances small-community detection even if the community persists across a vanishing fraction of layers, provided that T/L decays more slowly than O(L^{-1/2}). Moreover, we find that thresholding the summation can, in some cases, cause K^{*} to decay exponentially, decreasing by orders of magnitude in a phenomenon we call super-resolution community detection. In other words, layer aggregation with thresholding is a nonlinear data filter enabling detection of communities that are otherwise too small to detect. Importantly, different thresholds generally enhance the detectability of communities having different properties, illustrating that community detection can be obscured if one analyzes network data using a single threshold.","authors":["Dane Taylor","Rajmonda Caceres","Peter J. Mucha"],"meta":["September 2017Physical Review X 7(3)","DOI:10.1103/PhysRevX.7.031056"],"references":["310610716_Scaling_Properties_of_Multilayer_Random_Networks","295688463_Inferring_causal_molecular_networks_empirical_assessment_through_a_community-based_effort","287213192_Effect_of_localization_on_the_stability_of_mutualistic_ecological_networks","284220014_Enhanced_Detectability_of_Community_Structure_in_Multilayer_Networks_through_Layer_Aggregation","282639189_Centrality_metrics_and_localization_in_core-periphery_networks","318668097_Multilayer_Spectral_Graph_Clustering_via_Convex_Layer_Aggregation_Theory_and_Algorithms","315515504_Measurement_errors_in_network_data","312875231_Anderson_Transition_for_Classical_Transport_in_Composite_Materials","306550789_Fundamental_structures_of_dynamic_social_networks","304812412_Hidden_geometric_correlations_in_real_multiplex_networks"]}