{"id":"320036121_ESPACIO_VIRTUAL_ICONOGRAFICO_DE_APRENDIZAJE_UBICUO_ORIENTADO_AL_DESARROLLO_DEL_PENSAMIENTO_LOGICO_EN_BACHILLERATO_GENERAL_UNIFICADO","abstract":"La investigación tiene como objetivo diseñar un curso virtual iconográfico orientado al fortalecimiento del pensamiento lógico en bachillerato general unificado para disminuir las dificultades que existen para lograr un nivel de abstracción y razonamiento. Las dificultades mencionadas se detectan en las bajas calificaciones de las pruebas estandarizadas que el gobierno Ecuatoriano plantea desde el año 2012. Además, de acuerdo a datos de la Secretaria de Educación Superior, Ciencia, Tecnología e Innovación (SENESCYT) se evidencia que el dominio en las destrezas de matemáticas no es satisfactorio. La metodología utilizada para la creación del curso virtual iconográfico es Presencia, Alcance, Capacitación, Interacción y E-learning (PACIE), que se convierte en un aliado de la educación virtual y la construcción de un aprendizaje constructivista, donde se une la tecnología con la pedagogía para dar lugar a nuevos espacios de trabajo que cuenten con recursos didácticos idóneos y de fácil acceso. La prueba piloto se realizó con estudiantes de Bachillerato de la Unidad Educativa Milton Reyes, y los resultados se validaron con los puntajes alcanzados al finalizar el trabajo. Finalmente, el curso virtual se basa en el empleo de imágenes que se convierten en mediadores del aprendizaje y en nexo con el contenido académico, creado en herramientas web 2.0, con características interactivas e intuitivas, que lo familiariza con el uso de la tecnología, la resolución de problemas y el desarrollo de habilidades numéricas, al ejecutar las","authors":["Patricio Medina","Mónica Cristina Cruz-Escobar","Walfredo González Hernández"],"meta":["June 2017","Project: Object learning develop process and Informatics Learning"],"references":["236163777_Tendencias_para_el_aprendizaje_digital_de_los_contenidos_cerrados_al_diseno_de_materiales_centrado_en_las_actividades_El_Proyecto_Dipro_20","49598577_La_utilizacion_conjunta_de_la_pizarra_digital_interactiva_y_el_sistema_de_participacion_senteo_una_experiencia_universitaria","28208896_Del_eLearning_al_Blended_Learning_nuevas_acciones_educativas","255567471_Designing_a_Virtual_Classroom","228888983_PERSPECTIVAS_DE_LA_TECNOLOGIA_EDUCATIVA","39383302_Desarrollo_de_competencias_matematicas_con_recursos_ludico-manipulativos_para_ninos_y_ninas_de_6_a_12_anos","37419951_Designing_Web-Based_Training"]}