{"id":"320059486_Walking_through_Architectural_Spaces_The_Impact_of_Interior_Forms_on_Human_Brain_Dynamics","abstract":"Neuroarchitecture uses neuroscientific tools to better understand architectural design and its impact on human perception and subjective experience. The form or shape of the built environment is fundamental to architectural design, but not many studies have shown the impact of different forms on the inhabitants’ emotions. This study investigated the neurophysiological correlates of different interior forms on the perceivers’ affective state and the accompanying brain activity. To understand the impact of naturalistic three-dimensional (3D) architectural forms, it is essential to perceive forms from different perspectives. We computed clusters of form features extracted from pictures of residential interiors and constructed exemplary 3D room models based on and representing different formal clusters. To investigate human brain activity during 3D perception of architectural spaces, we used a mobile brain/body imaging (MoBI) approach recording the electroencephalogram (EEG) of participants while they naturally walk through different interior forms in virtual reality (VR). The results revealed a strong impact of curvature geometries on activity in the anterior cingulate cortex (ACC). Theta band activity in ACC correlated with specific feature types (rs (14) = 0.525, p = 0.037) and geometry (rs (14) = −0.579, p = 0.019), providing evidence for a role of this structure in processing architectural features beyond their emotional impact. The posterior cingulate cortex and the occipital lobe were involved in the perception of different room perspectives during the stroll through the rooms. This study sheds new light on the use of mobile EEG and VR in architectural studies and provides the opportunity to study human brain dynamics in participants that actively explore and realistically experience architectural spaces.","authors":["Maryam Banaei","Javad Hatami","Abbas Yazdanfar","Klaus Gramann"],"meta":["September 2017Frontiers in Human Neuroscience 11:477","DOI:10.3389/fnhum.2017.00477","Projects: Mobile Brain/Body Imaging (MoBI) & the Berlin Mobile Brain/Body Imaging Lab (BeMoBIL)Neuroarchitecture"],"references":["318768326_Application_of_AI_methods_in_the_clustering_of_architecture_interior_forms","312854561_EEGLAB_an_open_source_toolbox_for_analysis_of_single-trial_EEG_dynamics","312407842_Neural_codes_of_seeing_architectural_styles","311806979_Affective_response_to_architecture_-_investigating_human_reaction_to_spaces_with_different_geometry","304536244_Mobile_BrainBody_Imaging_MoBI_of_Physical_Interaction_with_Dynamically_Moving_Objects","344585001_The_Architect's_Brain_Neuroscience_Creativity_and_Architecture","321198647_Cognitive_and_emotional_influences_in_anterior_cingulate_cortex","316869882_Buildings_Beauty_and_the_Brain_A_Neuroscience_of_Architectural_Experience","312896466_Controlling_the_false_discovery_rate_a_new_and_powerful_approach_to_multiple_testing","311693416_Interference_in_serial_verbal_reactions"]}