{"id":"320085168_Discriminative_Scale_Learning_DiScrn_Applications_to_Prostate_Cancer_Detection_from_MRI_and_Needle_Biopsies","abstract":"There has been recent substantial interest in extracting sub-visual features from medical images for improved disease characterization compared to what might be achievable via visual inspection alone. Features such as Haralick and Gabor can provide a multi-scale representation of the original image by extracting measurements across differently sized neighborhoods. While these multi-scale features are effective, on large-scale digital pathological images, the process of extracting these features is computationally expensive. Moreover for different problems, different scales and neighborhood sizes may be more or less important and thus a large number of features extracted might end up being redundant. In this paper, we present a Discriminative Scale learning (DiScrn) approach that attempts to automatically identify the distinctive scales at which features are able to best separate cancerous from non-cancerous regions on both radiologic and digital pathology tissue images. To evaluate the efficacy of our approach, our approach was employed to detect presence and extent of prostate cancer on a total of 60 MRI and digitized histopathology images. Compared to a multi-scale feature analysis approach invoking features across all scales, DiScrn achieved 66% computational efficiency while also achieving comparable or even better classifier performance.","authors":["Haibo Wang","Satish Viswanath","Anant Madabhushi"],"meta":["September 2017Scientific Reports 7(1)","DOI:10.1038/s41598-017-12569-z"],"references":["265473206_Supervised_Multi-View_Canonical_Correlation_Analysis_sMVCCA_Integrating_Histologic_and_Proteomic_Features_for_Predicting_Recurrent_Prostate_Cancer","262787471_Co-Occurring_Gland_Angularity_in_Localized_Subgraphs_Predicting_Biochemical_Recurrence_in_Intermediate-Risk_Prostate_Cancer_Patients","261482639_Discriminatively_weighted_multi-scale_Local_Binary_Patterns_Applications_in_prostate_cancer_diagnosis_on_T2W_MRI","313575668_Statistical_and_structural_approaches_to_texture","288906520_Random_forests","288658848_SLIC_superpixels_compared_to_state-of-the-art_superpixel_methods","288257551_Feature_selection_for_classification_A_review","279354845_Scale-Space_Theory_in_Computer_Vision","268733104_Speeded-up_robust_features_SURF","263294943_Novel_PCA-VIP_scheme_for_ranking_MRI_protocols_and_identifying_computer-extracted_MRI_measurements_associated_with_central_gland_and_peripheral_zone_prostate_tumors_Quantitative_MRI_Features_of_CG_and"]}