{"id":"320072960_Phogo_A_low_cost_free_and_maker_revisit_to_Logo","abstract":"Today it is almost impossible to spend a single day without depending on an information system, a computer or any other form of computation. Though the starting barrier is low, fundamental concepts are still required in order to manage the technicalities of the engineering environment and everyday computational systems. In 1967, Logo proposed to teach abstract programming concepts by providing a set of functions that had intuitive, visible effects over a robotic Turtle. LOGO was a success, but the robots quickly migrated into computer simulations. From LOGO, many followed. Scratch and Lego Mindstorm are some of the most notorious examples. Both introduced graphical block-based programming interfaces. We propose to bring back the powerful ideas behind LOGO by updating it with state of the art technologies. Phogo combines Python, Arduino and 3D printing into a low cost robot that is easy to build and control. The robot has a pen to draw shapes and can be commanded from a computer via a wireless link that is transparent to the students. The use of a physical robot can make programming more accessible for students with disabilities. The open and maker philosophies behind Phogo makes it more interesting as students will be able to access and study the electronic components. The textual programing language can be a long life companion for the students. In this work we discuss LOGO and other projects inspired by it, and we also share the methodology and design decisions behind Phogo, the results of its application in a workshop and the improvements we are currently developing.","authors":["Pablo Molins-Ruano","Carlos Gonzalez-Sacristan","Carlos Garcia-Saura"],"meta":["September 2017Computers in Human Behavior","DOI:10.1016/j.chb.2017.09.029","Project: Phogo: A low cost and maker platform for Computational Thinking"],"references":["321940359_TACCLE_3_O5_An_overview_of_the_most_relevant_literature_on_coding_and_computational_thinking_with_emphasis_on_the_relevant_issues_for_teachers","320111593_Using_Robots_as_Learning_Objects_for_Teaching_Computer_Science","315815605_Programming_education_strategies","312582878_Examining_the_Relationship_between_Socialization_and_Improved_Software_Development_Skills_in_the_Scratch_Code_Learning_Environment","304627526_Code_to_Learn_Where_Does_It_Belong_in_the_K-12_Curriculum","317422613_Enabling_Collaboration_in_Learning_Computer_Programing_Inclusive_of_Children_with_Vision_Impairments","310809036_A_brief_introduction_to_TACCLE_3_-_coding_European_project","302973215_Disruptive_Change_in_the_Taxi_Business_The_Case_of_Uber","298972479_Learning_Computer_Science_Concepts_with_Scratch","297719113_Visual_programming_languages_integrated_across_the_curriculum_in_elementary_school_A_two_year_case_study_using_Scratch_in_five_schools"]}