{"id":"320077725_L'ANALYSE_DES_PROGRAMMES_D'INFORMATIQUE_DANS_L'ENSEIGNEMENT_SECONDAIRE_AU_MAROC","abstract":"Contexte: L’informatique comme discipline scolaire, est un sujet médiatisé de façon récurrente depuis plus de vingt ans. En effet, tous les systèmes éducatifs du monde sont maintenant convaincus que les apprenants d’aujourd’hui, amenés à vivre dans une société hyper scientifique, hyper informée et hyper informatisée, doivent être dotés des savoirs et savoirs-faire en informatique. Objectifs: Cette recherche vise à analyser les programmes d’informatique dans l’enseignement secondaire au Maroc. Méthodes: Pour analyser les programmes d’informatique dans l’enseignement secondaire, nous avons consulté les orientations pédagogiques et les manuels scolaires d’informatique. Résultats: l’analyser les programmes d’informatique dans l’enseignement secondaire a montré qu’il y a ni continuité ni complémentarité assurées dans les contenus destinés à ces deux cycles. On peut dire qu’il y a absence de la progression pédagogique qui est un processus fondamental dans l’élaboration des contenus objet d’enseignement. Conclusions: Au terme de cette analyse, nous pouvons dire que même si les objectifs de l’informatique en tant que discipline scolaire sont ambitieux et à la hauteur des objectifs annoncés par d’autres systèmes éducatifs, l’état de la pratique sur le terrain suscite beaucoup de questions. Les questions qui nous semblent pressantes sont : les objectifs annoncés sont-ils atteints ? La discipline scolaire remplit-elle son rôle dans l’éducation numérique de l’élève marocain ? \nMots-clés: informatique, curricula, orientations pédagogiques.","authors":["El Hassan El Hassouny","Fatiha Kaddari","Abdelrhani Elachqar","Issam Habibi"],"meta":["September 2016"],"references":["276481963_Comparative_Study_of_the_IT_TeachingLearning_in_School_Contexts_Lebanese_and_Moroccan","36379340_Une_didactique_de_l'informatique","49277201_Informatique_Maroc_college-lycee_quatre_manuels_pour_la_nouvelle_discipline","36379339_Informatique_et_TIC_une_vraie_discipline"]}