{"id":"320190886_PATRIC_as_a_unique_resource_for_studying_antimicrobial_resistance","abstract":"The Pathosystems Resource Integration Center (PATRIC, www.patricbrc.org) is designed to provide researchers with the tools and services that they need to perform genomic and other 'omic' data analyses. In response to mounting concern over antimicrobial resistance (AMR), the PATRIC team has been developing new tools that help researchers understand AMR and its genetic determinants. To support comparative analyses, we have added AMR phenotype data to over 15 000 genomes in the PATRIC database, often assembling genomes from reads in public archives and collecting their associated AMR panel data from the literature to augment the collection. We have also been using this collection of AMR metadata to build machine learning-based classifiers that can predict the AMR phenotypes and the genomic regions associated with resistance for genomes being submitted to the annotation service. Likewise, we have undertaken a large AMR protein annotation effort by manually curating data from the literature and public repositories. This collection of 7370 AMR reference proteins, which contains many protein annotations (functional roles) that are unique to PATRIC and RAST, has been manually curated so that it projects stably across genomes. The collection currently projects to 1 610 744 proteins in the PATRIC database. Finally, the PATRIC Web site has been expanded to enable AMR-based custom page views so that researchers can easily explore AMR data and design experiments based on whole genomes or individual genes.","authors":["Dionysios Antonopoulos","Rida Assaf","Ramy K Aziz","Thomas Brettin"],"meta":["July 2017Briefings in Bioinformatics 20(4)","DOI:10.1093/bib/bbx083","Project: PATtyFams: Protein families for the microbial genomes in the PATRIC database"],"references":["316991283_Population_Genomic_Analysis_of_1777_Extended-Spectrum_Beta-Lactamase-Producing_Klebsiella_pneumoniae_Isolates_Houston_Texas_Unexpected_Abundance_of_Clonal_Group_307","312398548_Notes_from_the_Field_Pan-Resistant_New_Delhi_Metallo-Beta-Lactamase-Producing_Klebsiella_pneumoniae_-_Washoe_County_Nevada_2016","311094768_A_naturally_occurring_SNP_in_plasmid_pB1000_produces_a_reversible_increase_in_antibiotic_resistance","303978225_Antimicrobial_Resistance_Prediction_in_PATRIC_and_RAST","301311830_JBrowse_A_dynamic_web_platform_for_genome_visualization_and_analysis","311348668_GenBank","311348201_Improvements_to_PATRIC_the_all-bacterial_Bioinformatics_Database_and_Analysis_Resource_Center","305376726_GenBank","304858118_Machine_Learning_for_Antimicrobial_Resistance","303150826_Clinical_and_Laboratory_Standards_Institute_Performance_Standards_for_Antimicrobial_Susceptibility_Testing_Twenty-second_Informational_Supplement"]}