{"id":"320184187_The_emergence_of_a_field_a_network_analysis_of_research_on_peer_review","abstract":"This article provides a quantitative analysis of peer review as an emerging field of research by revealing patterns and connections between authors, fields and journals from 1950 to 2016. By collecting all available sources from Web of Science, we built a dataset that included approximately 23,000 indexed records and reconstructed collaboration and citation networks over time. This allowed us to trace the emergence and evolution of this field of research by identifying relevant authors, publications and journals and revealing important development stages. Results showed that while the term “peer review” itself was relatively unknown before 1970 (“referee” was more frequently used), publications on peer review significantly grew especially after 1990. We found that the field was marked by three development stages: (1) before 1982, in which most influential studies were made by social scientists; (2) from 1983 to 2002, in which research was dominated by biomedical journals, and (3) from 2003 to 2016, in which specialised journals on science studies, such as Scientometrics, gained momentum frequently publishing research on peer review and so becoming the most influential outlets. The evolution of citation networks revealed a body of 47 publications that form the main path of the field, i.e., cited sources in all the most influential publications. They could be viewed as the main corpus of knowledge for any newcomer in the field.","authors":["Vladimir Batagelj","Anuska Ferligoj","Flaminio Squazzoni"],"meta":["October 2017Scientometrics 113(3):1-30","DOI:10.1007/s11192-017-2522-8","Project: Bibliographic networks"],"references":["320194592_Untangling_academic_publishing_A_history_of_the_relationship_between_commercial_interests_academic_prestige_and_the_circulation_of_research","318091157_Publishing_Journals_could_share_peer-review_data","304536880_The_Complexity_of_Measuring_the_Impact_of_Books","301331417_Attitudes_of_referees_in_a_multidisciplinary_journal_An_empirical_analysis","318080973_Suitability_of_Google_Scholar_as_a_source_of_scientific_information_and_as_a_source_of_data_for_scientific_evaluation-Review_of_the_Literature","310917492_Exploratory_Social_Network_Analysis_with_Pajek_Structural_Analysis_in_the_Social_Sciences","308571603_Academic_Research_in_the_21st_Century_Maintaining_Scientific_Integrity_in_a_Climate_of_Perverse_Incentives_and_Hypercompetition","305350985_Understanding_Large_Temporal_Networks_and_Spatial_Networks_Exploration_Pattern_Searching_Visualization_and_Network_Evolution","281083300_Scientific_Misconduct","262236146_An_Integrated_Approach_for_Main_Path_Analysis_Development_of_the_Hirsch_Index_as_an_Example"]}