{"id":"320149413_TITER_predicting_translation_initiation_sites_by_deep_learning","abstract":"Motivation: Translation initiation is a key step in the regulation of gene expression. In addition to the annotated translation initiation sites (TISs), the translation process may also start at multiple alternative TISs (including both AUG and non-AUG codons), which makes it challenging to predict TISs and study the underlying regulatory mechanisms. Meanwhile, the advent of several high-throughput sequencing techniques for profiling initiating ribosomes at single-nucleotide resolution, e.g. GTI-seq and QTI-seq, provides abundant data for systematically studying the general principles of translation initiation and the development of computational method for TIS identification.\n\nMethods: We have developed a deep learning-based framework, named TITER, for accurately predicting TISs on a genome-wide scale based on QTI-seq data. TITER extracts the sequence features of translation initiation from the surrounding sequence contexts of TISs using a hybrid neural network and further integrates the prior preference of TIS codon composition into a unified prediction framework.\n\nResults: Extensive tests demonstrated that TITER can greatly outperform the state-of-the-art prediction methods in identifying TISs. In addition, TITER was able to identify important sequence signatures for individual types of TIS codons, including a Kozak-sequence-like motif for AUG start codon. Furthermore, the TITER prediction score can be related to the strength of translation initiation in various biological scenarios, including the repressive effect of the upstream open reading frames on gene expression and the mutational effects influencing translation initiation efficiency.\n\nAvailability and Implementation: TITER is available as an open-source software and can be downloaded from https://github.com/zhangsaithu/titer.\n\nContact: lzhang20@mail.tsinghua.edu.cn or zengjy321@tsinghua.edu.cn","authors":["Sai Zhang","Hailin Hu","Tao Jiang","Lei Zhang"],"meta":["July 2017Bioinformatics 33(14):i234-i242","DOI:10.1093/bioinformatics/btx247","Project: Translation dynamics"],"references":["309366961_PreTIS_A_Tool_to_Predict_Non-canonical_5'_UTR_Translational_Initiation_Sites_in_Human_and_Mouse","305386928_Maximum-margin_matrix_factorization","304459826_The_Ensembl_gene_annotation_system","304031458_Translational_control_by_5'-untranslated_regions_of_eukaryotic_mRNAs","303505151_Conservation_of_uORF_repressiveness_and_sequence_features_in_mouse_human_and_zebrafish","301335377_DanQ_A_hybrid_convolutional_and_recurrent_deep_neural_network_for_quantifying_the_function_of_DNA_sequences","325460242_ROSE_A_Deep_Learning_Based_Framework_for_Predicting_Ribosome_Stalling","319770174_Practical_recommendations_for_gradient-based_training_of_deep_architectures","309255788_UniProt_a_hub_for_protein_information","304781977_Algorithms_for_hyper-parameter_optimization"]}