{"id":"320173899_Dynamical_Scheduling_and_Robust_Control_in_Uncertain_Environments_with_Petri_Nets_for_DESs","abstract":"This paper is about the incremental computation of control sequences for discrete event systems in uncertain environments where uncontrollable events may occur. Timed Petri nets are used for this purpose. The aim is to drive the marking of the net from an initial value to a reference one, in minimal or near-minimal time, by avoiding forbidden markings, deadlocks, and dead branches. The approach is similar to model predictive control with a finite set of control actions. At each step only a small area of the reachability graph is explored: this leads to a reasonable computational complexity. The robustness of the resulting trajectory is also evaluated according to a risk probability. A sufficient condition is provided to compute robust trajectories. The proposed results are applicable to a large class of discrete event systems, in particular in the domains of flexible manufacturing. However, they are also applicable to other domains as communication, computer science, transportation, and traffic as long as the considered systems admit Petri Nets (PNs) models. They are suitable for dynamical deadlock-free scheduling and reconfiguration problems in uncertain environments.","authors":["Dimitri Lefebvre"],"meta":["October 2017Processes 5(4):54","DOI:10.3390/pr5040054"],"references":["304456827_Deadlock-free_scheduling_for_timed_Petri_net_models_combined_with_MPC_and_backtracking","300414091_Deadlock-free_scheduling_for_manufacturing_systems_based_on_timed_Petri_nets_and_model_predictive_control","297247930_A_PETRI-NET_BASED_APPROACH_TO_MODELING_AND_SCHEDULING_FOR_AN_FMS_AND_A_CASE-STUDY","296798639_Production_Scheduling","282402060_Approaching_Minimal_Time_Control_Sequences_for_Timed_Petri_Nets","279311814_Control_Design_for_Trajectory_Tracking_With_Untimed_Petri_Nets","269311191_A_New_Approach_to_Abstract_Reachability_State_Space_of_Time_Petri_Nets","265790209_Model_Predictive_Control","262963460_A_Heuristic_Search_Approach_Using_Approximate_Solutions_to_Petri_Net_State_Equations_for_Scheduling_Flexible_Manufacturing_Systems","262365011_Paper_Model_predictive_heuristic_control"]}