{"id":"320161158_Multi-criteria_decision_analysis_of_fiscal_policies_promoting_the_adoption_of_electric_vehicles","abstract":"In many countries, electric vehicles provide an opportunity to cut the demand for fossil fuels and GHG emissions. Thus, governments have implemented incentive policies to stimulate the adoption of EVs. In this study, by linking Multi-criteria decision analysis and an energy system model, an evaluation framework of fiscal policies for the adoption of electric vehicles is developed. Primarily, the energy system model for Iceland is applied to compare the impacts of five fiscal policy incentives with BAU until 2050, in terms of government revenue, consumer’s vehicle ownership cost, the GHG mitigation potential and energy security. Then, the policy scenarios are compared using the TOPSIS method. According to the estimated performance indexes for policy scenarios, Feebate+Tax scenario receives the highest rank. This ranking is consistent across different normalization norms and objective weights. In the Feebate+Tax scenario, a fee equivalent to 20% of conventional ICEV price is imposed on both petroleum ICEVs and HEVs, while an equivalent rebate value is provided to the purchase price of light-duty BEV and heavy-duty PHEV. In addition, an extra excise duty and a carbon tax are levied on petroleum fuels. The sensitivity of rankings with respect to the effects of different battery characteristics for EVs, is explored. Based on Pareto efficiency, the Feebate+Tax scenario was found to be the only non-dominated option across three objective weights. Thus, the recommendation of Feebate+Tax as the promising policy is unaffected by the variation in the range and cost of batteries.","authors":["Reza Fazeli","Brynhildur Davidsdottir","Ehsan Shafiei","Hlynur Stefansson"],"meta":["August 2017Energy Procedia 142:2511-2516","Project: Trajectories towards a sustainable energy future in Iceland"],"references":["280600215_Assessment_of_leading_electric_vehicle_promotion_activities_in_United_States_cities","322726642_Macroeconomic_effects_of_fiscal_incentives_to_promote_electric_vehicles_in_Iceland_Implications_for_government_and_consumer_costs","314008480_Analysis_of_CO2_emissions_and_techno-economic_feasibility_of_an_electric_commercial_vehicle","313420403_Designing_policy_incentives_for_cleaner_technologies_Lessons_from_California's_plug-in_electric_vehicle_rebate_program","295540073_Impact_of_the_electric_vehicles_on_the_air_pollution_from_a_highway","285044357_Analysis_of_supply-push_strategies_governing_the_transition_to_biofuel_vehicles_in_a_market-oriented_renewable_energy_system","281816183_Combined_Application_of_Multi-Criteria_Optimization_and_Life-Cycle_Sustainability_Assessment_for_Optimal_Distribution_of_Alternative_Passenger_Cars_in_US","277919532_Simulation_of_Alternative_Fuel_Markets_using_Integrated_System_Dynamics_Model_of_Energy_System","268210228_Multi-criteria_Evaluation_of_Alternative-Fuel_Vehicles_via_a_Hierarchical_Hesitant_Fuzzy_Linguistic_Model","265350533_Pareto_Efficiency_in_Robust_Optimization"]}