{"id":"320171052_Computer-based_technology_and_student_engagement_a_critical_review_of_the_literature","abstract":"Computer-based technology has infiltrated many aspects of life and industry, yet there is little understanding of how it can be used to promote student engagement, a concept receiving strong attention in higher education due to its association with a number of positive academic outcomes. The purpose of this article is to present a critical review of the literature from the past 5 years related to how web-conferencing software, blogs, wikis, social networking sites (Facebook and Twitter), and digital games influence student engagement. We prefaced the findings with a substantive overview of student engagement definitions and indicators, which revealed three types of engagement (behavioral, emotional, and cognitive) that informed how we classified articles. Our findings suggest that digital games provide the most far-reaching influence across different types of student engagement, followed by web-conferencing and Facebook. Findings regarding wikis, blogs, and Twitter are less conclusive and significantly limited in number of studies conducted within the past 5 years. Overall, the findings provide preliminary support that computer-based technology influences student engagement, however, additional research is needed to confirm and build on these findings. We conclude the article by providing a list of recommendations for practice, with the intent of increasing understanding of how computer-based technology may be purposefully implemented to achieve the greatest gains in student engagement.","authors":["Laura Schindler","Gary Burkholder","Osama A. Morad","Craig Marsh"],"meta":["December 2017","DOI:10.1186/s41239-017-0063-0"],"references":["341892707_An_Investigation_into_Student_Engagement_in_Higher_Education_Classrooms","339280472_The_Use_of_Twitter_in_Large_Lecture_Courses_Do_the_Students_See_a_Benefit","322342119_Student_Engagement_Literature_Review","313872357_Gamifying_education_what_is_known_what_is_believed_and_what_remains_uncertain_a_critical_review","312934097_Taking_social_media_to_a_university_classroom_teaching_and_learning_using_Twitter_and_blogs","344473116_The_flow_experience_and_its_significance_for_human_psychology","326184498_Experience_adoption_and_technology_Exploring_the_phenomenological_experiences_of_faculty_involved_in_online_teaching_at_one_school_of_public_health","316544940_Impact_of_Cohort_Bonds_on_Student_Satisfaction_and_Engagement","316082906_Perceived_Effectiveness_of_Web_Conferencing_Software_in_the_Digital_Environment_to_Deliver_a_Graduate_Course_in_Applied_Behavior_Analysis","313256260_Investment_and_return_Wiki_engagement_in_a_remedial_ESL_writing_course"]}