{"id":"320199834_Rotating-tool_diamond_turning_of_Fresnel_lenses_on_a_roller_mold_for_manufacturing_of_functional_optical_film","abstract":"In roll-to-roll (R2R) manufacturing of high-quality optical Fresnel lens films, a high-precision roller mold with fine surface finish is essential to precisely transfer the functional microstructures from the periphery roller surface onto the flexible substrate. Unfortunately, direct diamond turning of deep circular grooves on the periphery surface of a roller mold was thought to be infeasible. Hence, a novel 4-axis interactive tool-workpiece motion, rotating-tool diamond turning (RDT), was proposed as a solution to overcome this challenge. In this paper, R2R embossing of optical film patterned with both linear and radial Fresnel lens array using directly machined roller mold is firstly conducted. Multi-axis dynamics during the RDT process is thoroughly studied and essential factors are sourced and analysed, followed by a comprehensive study of these parameters in terms of cutting performance in the RDT setup. Then, a combination of optimized machining parameters is applied to directly machine both radial and linear Fresnel lens arrays on the same roller. Material shrinkage of resin during R2R process is considered in design of the lens feature on the mold, and tool path is generated considering the roller dimensions, lens specifications and the shrinkage compensation. The machined roller mold is then installed on an in-house developed R2R UV embossing system to conduct continuous manufacturing of optical Fresnel lens film at a large throughput. To evaluate the machining performance of RDT and replication performance of R2R embossing, lens profile and surface quality of both the machined roller mold and the embossed film have been studied with different orientations. Measurement results have shown that the profile accuracy and surface finish of machined linear Fresnel lenses have better performances than the radial lenses. Both linear and radial Fresnel lens features can be precisely replicated from the roller mold onto the film without significant differences at different orientations. Proper compensation for the shrinkage of resin in designing the machining pattern on roller has been proved to be necessary and important to achieve desired film quality for this R2R embossing process. This study on R2R embossing of radial Fresnel lens film has proven that RDT is a qualified and reliable machining process to enable high-throughput continuous manufacturing of high-quality Fresnel lens film.","authors":["XinQuan Zhang","Rui Huang","Kui Liu","Senthil Kumar Anantharajan"],"meta":["October 2017Precision Engineering 51","DOI:10.1016/j.precisioneng.2017.09.016","Projects: printed electronics, roll-to-roll processing (roll-to-roll coating, gravure printing, embossing)Rotating tool diamond turning"],"references":["316548916_Profile_evaluation_of_radial_Fresnel_lens_directly_machined_on_roller_molds_by_Rotating-tool_Diamond_Turning","271522880_Diamond_Turning","271332656_Roll-to-roll_embossing_of_optical_linear_Fresnel_lens_polymer_film_for_solar_concentration","281610035_A_Theoretical_and_Experimental_Investigation_of_Orthogonal_Slow_Tool_Servo_Machining_of_Wavy_Microstructured_Patterns_on_Precision_Rollers","279635554_Diamond_micro_engraving_of_gravure_roller_mould_for_roll-to-roll_printing_of_fine_line_electronics","276164296_Ultra-precision_machining_of_radial_Fresnel_lens_on_roller_moulds","275096948_Mechanics_of_Saw-Tooth_Chip_Formation_in_Metal_Cutting","272525748_Large_format_cylindrical_lens_films_formed_by_roll-to-roll_ultraviolet_embossing_and_applications_as_diffusion_films","270497726_Dynamic_characteristics_of_an_aerostatic_bearing_spindle_and_its_influence_on_surface_topography_in_ultra-precision_diamond_turning","263284795_Hot_embossing_holographic_images_in_BOPP_shrink_films_through_large-area_roll-to-roll_nanoimprint_lithography","259562110_Micro_hot_embossing_of_thermoplastic_polymers_A_review","257345509_Micro_cutting_of_V-shaped_cylindrical_grating_template_for_roller_nano-imprint","245172378_Investigation_of_the_direction_of_chip_motion_in_diamond_turning","227695211_Optical_Design_using_Fresnel_Lenses","26762601_Large-Area_Roll-to-Roll_and_Roll-to-Plate_Nanoimprint_Lithography_A_Step_toward_High-Throughput_Application_of_Continuous_Nanoimprinting"]}