{"id":"320171394_Research_Articles_in_Simplified_HTML_A_Web-first_format_for_HTML-based_scholarly_articles","abstract":"Purpose\nThis paper introduces the Research Articles in Simplified HTML (or RASH), which is a Web-first format for writing HTML-based scholarly papers; it is accompanied by the RASH Framework, a set of tools for interacting with RASH-based articles. The paper also presents an evaluation that involved authors and reviewers of RASH articles submitted to the SAVE-SD 2015 and SAVE-SD 2016 workshops.\n\nDesign\nRASH has been developed aiming to: be easy to learn and use; share scholarly documents (and embedded semantic annotations) through the Web; support its adoption within the existing publishing workflow.\n\nFindings\nThe evaluation study confirmed that RASH is ready to be adopted in workshops, conferences, and journals and can be quickly learnt by researchers who are familiar with HTML.\n\nResearch Limitations\nThe evaluation study also highlighted some issues in the adoption of RASH, and in general of HTML formats, especially by less technically savvy users. Moreover, additional tools are needed, e.g., for enabling additional conversions from/to existing formats such as OpenXML.\n\nPractical Implications\nRASH (and its Framework) is another step towards enabling the definition of formal representations of the meaning of the content of an article, facilitating its automatic discovery, enabling its linking to semantically related articles, providing access to data within the article in actionable form, and allowing integration of data between papers.\n\nSocial Implications\nRASH addresses the intrinsic needs related to the various users of a scholarly article: researchers (focussing on its content), readers (experiencing new ways for browsing it), citizen scientists (reusing available data formally defined within it through semantic annotations), publishers (using the advantages of new technologies as envisioned by the Semantic Publishing movement).\n\nValue\nRASH helps authors to focus on the organisation of their texts, supports them in the task of semantically enriching the content of articles, and leaves all the issues about validation, visualisation, conversion, and semantic data extraction to the various tools developed within its Framework.","authors":["Silvio Peroni","Francesco Osborne","Angelo Di Iorio","Andrea Giovanni Nuzzolese"],"meta":["October 2017PeerJ Computer Science 3(194):e132","DOI:10.7717/peerj-cs.132"],"references":["319394819_SUS_--_a_quick_and_dirty_usability_scale","318138046_Decentralised_Authoring_Annotations_and_Notifications_for_a_Read-Write_Web_with_dokieli","319439845_The_RASH_JavaScript_Editor_RAJE_A_Wordprocessor_for_Writing_Web-first_Scholarly_Articles","319394513_RELAX_NG_Specification","319394502_W3C_XML_Schema_Definition_Language_XSD_11_Part_1_Structures","319394206_HTML_40_Specification","318579188_Towards_accessible_graphs_in_HTML-based_scientific_articles","303842881_It_ROCS_The_RASH_Online_Conversion_Service","300575491_The_Semantic_Publishing_and_Referencing_Ontologies","295846318_The_Document_Components_Ontology_DoCO"]}