{"id":"320107501_The_Relationship_Between_Human_Resource_Management_Strategies_and_Competitive_Advantage","abstract":"This study aims to identify the role of human resources management strategies (selection strategy, motivation strategy, training and development strategy) to achieve competitive advantage in the state company for tire industry/Babylon. Based on the main hypothesis that (there are significant relationship between human resources management strategies and competitive advantage constructs). And for achieving aims of the study and testing hypotheses study adopted an empirical method and applied to a random sample (100) of managers and their assistants and heads of departments of the company. and data were collected by questionnaire, and field visits, personal interviews and some official documents to complete the study data. also, used a number of statistical tools for data analyzing and interpreting. The study found a set of conclusions and recommendations as follows:\nThe results showed that the company has increased the attention of importance of human resource management strategies and their role in achieving competitive advantage. Which refers to the vital role of those strategies towards improving the competitive position of the company as well. The results showed a significance positive correlation between human resource management strategies and competitive advantage that reflects a good indicator of company’s ability to achieve Outstanding performance through human resource. Finally, the study recommended to Increase and expand the concerning of \"human resources management strategies\" and make it a competitive strategy, and increase the competitiveness ability in regional and international market.","authors":["Mohanad Ali Kareem"],"meta":["August 2017"],"references":["324465367_Applied_Production_and_Operations_Management_3rd_Edition","269464043_Operations_Management_Processes_and_Supply_Chains","238395366_Human_Resource_Management_Theory_and_Practice","40940640_Managing_Human_Resources"]}