{"id":"320115234_Lightweight_Ciphers_and_Their_Side-Channel_Resilience","abstract":"Side-channel attacks represent a powerful category of attacks against cryptographic devices. Still, side-channel analysis for lightweight ciphers is much less investigated than for instance for AES. Although intuition may lead to the conclusion that lightweight ciphers are weaker in terms of side-channel resistance, that remains to be confirmed and quantified. In this paper, we consider various side-channel analysis metrics which should provide an insight on the resistance of lightweight ciphers against side-channel attacks. In particular, for the non-profiled scenario we use the theoretical confusion coefficient and empirical optimal distinguisher. Our study considers side-channel attacks on the first, the last, or both rounds simultaneously. Furthermore, we conduct a profiled side-channel analysis using various machine learning attacks to recover 4-bit and 8-bit intermediate states of the cipher. Our results show that the difference between AES and lightweight ciphers is smaller than one would expect, and even find scenarios in which lightweight ciphers may be more resistant. Interestingly, we observe that the studied 4-bit S-boxes have a different side-channel resilience, while the difference in the 8-bit ones is only theoretically present.","authors":["Annelie Heuser","Stjepan Picek","Sylvain Guilley","Nele Mentens"],"meta":["September 2017IEEE Transactions on Computers PP(99):1-1","DOI:10.1109/TC.2017.2757921"],"references":["318548961_Side-Channel_Analysis_of_Lightweight_Ciphers_Does_Lightweight_Equal_Easy","297725067_Improving_the_security_and_efficiency_of_block_ciphers_based_on_LS-designs","284246718_RECTANGLE_a_bit-slice_lightweight_block_cipher_suitable_for_multiple_platforms","262319479_Block_Ciphers_that_are_Easier_to_Mask_How_Far_Can_we_Go","262212701_Success_through_Confidence_Evaluating_the_Effectiveness_of_a_Side-Channel_Attack","220343395_Bayesian_Network_Classifiers","300138708_Midori_A_Block_Cipher_for_Low_Energy","227992567_Elements_of_Information_Theory","221291758_Piccolo_An_Ultra-Lightweight_Blockcipher","221291582_Electromagnetic_Analysis_Concrete_Results","220687895_The_Design_of_Rijndael_AES_-_The_Advanced_Encryption_Standard","220517722_Machine_learning_in_side-channel_analysis_A_first_study","2578573_Differential_Power_Analysis"]}