{"id":"320148775_Positive_and_Negative_Association_Rules_Mining_for_Mental_Health_Analysis_of_College_Students","abstract":"The psychological problems of college students have aroused general concerns. A lot of college students are plagued by all kinds of psychological health problems. Psychological health problems brought a lot of negative effects to them. The psychological assessment data and the basic information collected from 6500 freshmen are used to analyze association rules and characteristics of college students' psychological factors in this paper. The symptom self-rating scale (SCL-90) was compiled by L. R. Derogatis in 1975, which contains 90 items. The SCL-90 has been used in a wide range of psychiatric symptoms. The SCL-90 includes ten factors, such as somatization, obsessive-compulsive symptoms, interpersonal sensitivity, depression, anxiety, hostility, terror, paranoia, psychosis and other factors. The PNARC model is introduced in this paper to mine the positive and negative association rules from real SCL-90 data set of one Chinese college. The support-confidence framework and the correlation test method are obtained to delete the contradict association rules and get the positive and negative association rules for correctly analyzing the potential relationship of SCL-90 factors. Mined positive and negative association rules are also helpful to analyze and coach the mental health of college students.","authors":["Long Zhao","Feng Hao","Tiantian Xu","XiangJun Dong"],"meta":["August 2017Eurasia Journal of Mathematics, Science and Technology Education 13(8):5577-5587","DOI:10.12973/eurasia.2017.01011a"],"references":["284019443_Problem_Drinking_Gambling_and_Eating_Among_Undergraduate_University_Students_What_are_the_Links","273177255_Stress_and_mental_health_problems_in_1st_year_medical_students_A_survey_of_two_medical_colleges_in_Kanpur_India","261755281_The_effectiveness_of_Tai_Chi_on_the_physical_and_psychological_well-being_of_college_students_A_study_protocol_for_a_randomized_controlled_trial","309852510_Association_Rule_Mining_in_Developmental_Psychology","286106681_PHARM_-_Association_Rule_Mining_for_Predictive_Health","283237153_The_Investigation_of_Mental_Health_Problems_and_Social_Phobia_Status_of_College_Students","271918418_Attitudes_Toward_Health-Seeking_Behaviors_of_College_Students_in_Ukraine","269560258_Mining_Interesting_Association_Rules_of_Students_Suffering_Study_Anxieties_Using_SLP-Growth_Algorithm","251856138_Fast_Mining_Maximal_Frequent_Itemsets_Based_On_Sorted_FP-Tree","225099509_Mining_Both_Positive_and_Negative_Association_Rules_from_Frequent_and_Infrequent_Itemsets","221214987_Mining_Frequent_Patterns_Without_Candidate_Generation"]}