{"id":"320195365_The_Complete_Light-curve_Sample_of_Spectroscopically_Confirmed_Type_Ia_Supernovae_from_Pan-STARRS1_and_Cosmological_Constraints_from_The_Combined_Pantheon_Sample","abstract":"We present optical light curves, redshifts, and classifications for 361 spectroscopically confirmed Type Ia supernovae (SNeIa) discovered by the Pan-STARRS1 (PS1) Medium Deep Survey. We detail improvements to the PS1 SN photometry, astrometry and calibration that reduce the systematic uncertainties in the PS1 SN Ia distances. We combine the subset of 276 PS1 SN Ia ($0.03 < z < 0.65$) with distance estimates of SN Ia from SDSS, SNLS, various low-z and HST samples to form the largest combined sample of SN Ia consisting of a total of 1049 SN Ia ranging from $0.01 < z < 2.3$, which we call the 'Pantheon Sample'. Photometric calibration uncertainties have long dominated the systematic error budget of every major analysis of cosmological parameters with SNIa. We have reduced these calibration systematics to the point where they are similar in size to the other major sources of known systematic uncertainties: the nature of the intrinsic scatter of SNIa and modeling of selection effects. When combining Planck 2015 CMB measurements with the Pantheon SN sample, we find $\\Omega_m = 0.306 \\pm 0.012$ and $w = -1.031 \\pm 0.040$ for the wCDMmodel. When the SN and CMB constraints are combined with constraints from BAO and local H0 measurements, the analysis yields the most precise measurement of dark energy to date: $w_0 = -1.011 \\pm 0.087$ and $w_a = -0.215 \\pm 0.402$ for the w0waCDM model. Tension with a cosmological constant previously seen in an analysis of PS1 and low-z SNe has diminished after an increase of $2\\times$ in the statistics of the PS1 sample, improved calibration and photometry, and stricter light-curve quality cuts. We find the systematic uncertainties in our measurements of dark energy are almost as large as the statistical uncertainties, primarily due to limitations of modeling the low-redshift sample. This must be addressed for future progress in using SN Ia to measure dark energy.","authors":["D. M. Scolnic","David O. Jones","A. Rest","yen-chen Pan"],"meta":["October 2017The Astrophysical Journal 859(2)","DOI:10.3847/1538-4357/aab9bb","Project: Pan-STARRS"],"references":["320920408_The_Foundation_Supernova_Survey_Motivation_Design_Implementation_and_First_Data_Release","320195203_Measuring_Dark_Energy_Properties_with_Photometrically_Classified_Pan-STARRS_Supernovae_II_Cosmological_Parameters","317887310_The_Dependence_of_Type_Ia_Supernova_Luminosities_on_Their_Local_Environment","317820235_Apparent_cosmic_acceleration_from_Type_Ia_supernovae","320195458_Type_Ia_Supernova_Distances_at_z_15_from_the_Hubble_Space_Telescope_Multi-Cycle_Treasury_Programs_The_Early_Expansion_Rate","317915704_Measuring_the_Properties_of_Dark_Energy_with_Photometrically_Classified_Pan-STARRS_Supernovae_I_Systematic_Uncertainty_from_Core-collapse_Supernova_Contamination","317887523_A_blinded_determination_of_H_0_from_low-redshift_Type_Ia_supernovae_calibrated_by_Cepheid_variables","311222536_Testing_LCDM_at_the_lowest_redshifts_with_SN_Ia_and_galaxy_velocities","309797584_Search_for_Type_Ia_supernova_NUV-optical_subclasses","309483987_Is_the_expansion_of_the_universe_accelerating_All_signs_point_to_yes"]}