{"id":"320177251_Classical_boson_sampling_algorithms_with_superior_performance_to_near-term_experiments","abstract":"It is predicted that quantum computers will dramatically outperform their conventional counterparts. However, large-scale universal quantum computers are yet to be built. Boson sampling1 is a rudimentary quantum algorithm tailored to the platform of linear optics, which has sparked interest as a rapid way to demonstrate such quantum supremacy2,3,4,5,6. Photon statistics are governed by intractable matrix functions, which suggests that sampling from the distribution obtained by injecting photons into a linear optical network could be solved more quickly by a photonic experiment than by a classical computer. The apparently low resource requirements for large boson sampling experiments have raised expectations of a near-term demonstration of quantum supremacy by boson sampling7,8. Here we present classical boson sampling algorithms and theoretical analyses of prospects for scaling boson sampling experiments, showing that near-term quantum supremacy via boson sampling is unlikely. Our classical algorithm, based on Metropolised independence sampling, allowed the boson sampling problem to be solved for 30 photons with standard computing hardware. Compared to current experiments, a demonstration of quantum supremacy over a successful implementation of these classical methods on a supercomputer would require the number of photons and experimental components to increase by orders of magnitude, while tackling exponentially scaling photon loss.","authors":["Alex Neville","Chris Sparrow","Raphael Clifford","Eric Johnston"],"meta":["December 2017Nature Physics 13(12)","DOI:10.1038/nphys4270"],"references":["321303944_Direct_dialling_of_Haar_random_unitary_matrices","316612620_High-efficiency_multiphoton_boson_sampling","314182326_Architectures_for_Quantum_Simulation_Showing_a_Quantum_Speedup","313642568_Quantum_Sampling_Problems_BosonSampling_and_Quantum_Supremacy","311430833_Gaussian_Boson_Sampling","308964814_Towards_Quantum_Supremacy_with_Lossy_Scattershot_Boson_Sampling","308913060_Achieving_quantum_supremacy_with_sparse_and_noisy_commuting_quantum_computations","345224477_Combinatorial_Mathematics","317664205_Quantum_transport_simulations_in_a_programmable_nanophotonic_processor","316871029_Time-Bin-Encoded_Boson_Sampling_with_a_Single-Photon_Device","305780465_Characterizing_Quantum_Supremacy_in_Near-Term_Devices","304163583_Computing_Permanents_for_Boson_Sampling_on_Tianhe-2_Supercomputer","301836717_Chip-based_array_of_near-identical_pure_heralded_single-photon_sources","301837332_An_Optimal_Design_for_Universal_Multiport_Interferometers","296699386_Boson_Sampling_with_Single-Photon_Fock_States_from_a_Bright_Solid-State_Source"]}