{"id":"320163542_Shapley_Facility_Location_Games","abstract":"Facility location games have been a topic of major interest in economics, operations research and computer science, starting from the seminal work by Hotelling. Spatial facility location models have successfully predicted the outcome of competition in a variety of scenarios. In a typical facility location game, users/customers/voters are mapped to a metric space representing their preferences, and each player picks a point (facility) in that space. In most facility location games considered in the literature, users are assumed to act deterministically: given the facilities chosen by the players, users are attracted to their nearest facility. This paper introduces facility location games with probabilistic attraction, dubbed {\\em Shapley facility location games}, due to a surprising connection to the Shapley value. The specific attraction function we adopt in this model is aligned with the recent findings of the behavioral economics literature on choice prediction. Given this model, our first main result is that Shapley facility location games are potential games; hence, they possess pure Nash equilibrium. Moreover, the latter is true for any compact user space, any user distribution over that space, and any number of players. Note that this is in sharp contrast to Hotelling facility location games. In our second main result we show that under the assumption that players can compute an approximate best response, approximate equilibrium profiles can be learned efficiently by the players via dynamics. Our third main result is a bound on the Price of Anarchy of this class of games, as well as showing the bound is tight. Ultimately, we show that player payoffs coincide with their Shapley value in a coalition game, where coalition gains are the social welfare of the users.","authors":["Omer Ben-Porat","Moshe Tennenholtz"],"meta":["September 2017"],"references":["301377184_The_Probability_Ranking_Principle_is_Not_Optimal_in_Adversarial_Retrieval_Settings","230663805_Potential_Games","313992379_Location_Hotelling_Games_and_Applications","287012375_Worst-case_equilibria_in_Symposium_on_Theoretical_Aspects_of_Computer_Science","284289939_A_Value_for_n-Person_Games","268712358_Mechanism_Design_without_Money","258222947_Algorithmic_Game_Theory","246919923_Nash_equilibria_in_competitive_societies_with_applications_to_facility_location","241022189_Small_Feedback-based_Decisions_and_Their_Limited_Correspondence_to_Description-based_Decisions","227707441_A_choice_prediction_competition_Choices_from_experience_and_from_description"]}