{"id":"320119611_Engineering_Courses_on_Computational_Thinking_Through_Solving_Problems_in_Artificial_Intelligence","abstract":"Computational thinking sits at the core of every engineering and computing related discipline. It has increasingly emerged as its own subject in all levels of education. It is a powerful cornerstone for cognitive development, creative problem solving, algorithmic thinking and designs, and programming. How to effectively teach computational thinking skills poses real challenges and creates opportunities. Targeting entering computer science and engineering undergraduates, we resourcefully integrate elements from artificial intelligence (AI) into introductory computing courses. In addition to comprehension of the essence of computational thinking, practical exercises in AI enable inspirations of collaborative problem solving beyond abstraction, logical reasoning, critical and analytical thinking. Problems in machine intelligence systems intrinsically connect students to algorithmic oriented computing and essential mathematical foundations. Beyond knowledge representation, AI fosters a gentle introduction to data structures and algorithms. Focused on engaging mental tool, a computer is never a necessity. Neither coding nor programming is ever required. Instead, students enjoy constructivist classrooms designed to always be active, flexible, and highly dynamic. Learning to learn and reflecting on cognitive experiences, they rigorously construct knowledge from collectively solving exciting puzzles, competing in strategic games, and participating in intellectual discussions.","authors":["Piyanuch Silapachote","Ananta Srisuphab"],"meta":["September 2017","DOI:10.3991/ijep.v7i3.6951"],"references":["282603860_Computational_thinking_in_compulsory_education_Towards_an_agenda_for_research_and_practice","274309848_Computational_Thinking","266882704_Computer_Science_Unplugged_school_students_doing_real_computing_without_computers","247924673_Bringing_computational_thinking_to_K-12_what_is_Involved_and_what_is_the_role_of_the_computer_science_education_community","319394983_Artificial_Intelligence_A_Modern_Approach","274898633_Tools_of_the_Mind_The_Vygotskian_Approach_to_Early_Childhood_Education","271481979_Gaining_and_maintaining_student_attention_through_competitive_activities_in_cooperative_learning_A_well-received_experience_in_an_undergraduate_introductory_Artificial_Intelligence_course","258948784_How_to_Solve_It_A_New_Aspect_of_Mathematical_Method","243784375_Teaching_and_Learning_in_the_College_Classroom_A_Review_of_the_Research_Literature","238495459_Piaget's_Constructivism_Papert's_Constructionism_What's_the_difference"]}