{"id":"320196037_Quantum_optimization_using_variational_algorithms_on_near-term_quantum_devices","abstract":"Universal fault-tolerant quantum computers will require error-free execution of long sequences of quantum gate operations, which is expected to involve millions of physical qubits. Before the full power of such machines will be available, near-term quantum devices will provide several hundred qubits and limited error correction. Still, there is a realistic prospect to run useful algorithms within the limited circuit depth of such devices. Particularly promising are optimization algorithms that follow a hybrid approach: the aim is to steer a highly entangled state on a quantum system to a target state that minimizes a cost function via variation of some gate parameters. This variational approach can be used both for classical optimization problems as well as for problems in quantum chemistry. The challenge is to converge to the target state given the limited coherence time and connectivity of the qubits. In this context, the quantum volume as a metric to compare the power of near-term quantum devices is discussed. With focus on chemistry applications, a general description of variational algorithms is provided and the mapping from fermions to qubits is explained. Coupled-cluster and heuristic trial wave-functions are considered for efficiently finding molecular ground states. Furthermore, simple error-mitigation schemes are introduced that could improve the accuracy of determining ground-state energies. Advancing these techniques may lead to near-term demonstrations of useful quantum computation with systems containing several hundred qubits.","authors":["Nikolaj Moll","Panagiotis Kl. Barkoutsos","Lev S. Bishop","Jerry M. Chow"],"meta":["October 2017Quantum Science and Technology 3(3)","DOI:10.1088/2058-9565/aab822"],"references":["323927159_Low-Depth_Quantum_Simulation_of_Materials","323130113_Computation_of_Molecular_Spectra_on_a_Quantum_Processor_with_an_Error-Resilient_Algorithm","318981709_Analysis_of_parametrically_driven_exchange-type_iSWAP_and_two-photon_bSWAP_interactions_between_superconducting_qubits","318584445_Robust_determination_of_molecular_spectra_on_a_quantum_processor","321957608_Analysis_of_a_parametrically_driven_exchange-type_gate_and_a_two-photon_excitation_gate_between_superconducting_qubits","321660516_Resonantly_driven_CNOT_gate_for_electron_spins","319683740_Hardware-efficient_variational_quantum_eigensolver_for_small_molecules_and_quantum_magnets","317061959_Evidence_for_a_Limited_Quantum_Speedup_on_a_Quantum_Annealer","313097465_Tapering_off_qubits_to_simulate_fermionic_Hamiltonians","312908717_Operator_Locality_in_Quantum_Simulation_of_Fermionic_Models"]}