{"id":"320136915_Development_of_Information_Competency_in_Students_during_Training_in_Al-Farabi's_Geometric_Heritage_within_the_Framework_of_Supplementary_School_Education","abstract":"Information competency is one of the essential qualities of a person living in the information age. It includes skills in information handling in both educational domains and the outside world, as well as readiness and capability to use modern information and communication technologies when involved in various types of information activities. Building and developing information competency in students during teaching and upbringing is one of the primary goals of education. This article describes possible ways of developing it in students within the framework of supplementary education when studying the mathematical heritage of Al-Farabi, one of the greatest scientists of the early Middle Ages, whose fundamental studies made a significant contribution to development of world science. It has been proven that integrated extracurricular classes in geometry and information science are one of the most useful patterns of teaching the scientist's heritage within the framework of supplementary school education. The article highlights the main components of information competency for the most effective organisation of its development process, provides geometric construction problems from the scientist's mathematical heritage, tasks related to his biography and scientific activities, as well as up-to-date educational and information and communication technologies to facilitate the most effective development of information competency in students. © 2017 by Academic Publishing House Researcher s.r.o. All rights reserved.","authors":["E.Y. Bidaibekov","G. Kamalova","B. Bostanov","I. Salgozha"],"meta":["September 2017","DOI:10.13187/ejced.2017.3.479"],"references":["270448517_Dynamic_Geometry_Environments_as_a_Tool_for_Computer_Modeling_in_the_System_of_Modern_Mathematics_Education","235292971_Information_Competency_Instruction_in_a_Two-Year_College_One_Size_Does_Not_Fit_All","266470817_Personality_traits_gender_and_information_competency_among_college_students","254173457_Teaching_Information_Competency_as_a_Third_Language_A_New_Model_for_Library_Instruction","249669876_A_Proposed_Design_for_the_Business_Capstone_Course_with_Emphasis_on_Improving_Students'_Information_Competency"]}