{"id":"320127253_An_Intelligent_Security_Approach_using_Game_Theory_to_Detect_DoS_Attacks_in_IoT","abstract":"The Internet of Things (IoT) is a new concept in the world of Information and Communication Technology (ICT). The structure of this global network is highly interconnected and presents a new category of challenges from the security, trust, and privacy perspectives. The data transfer problems through the Denial-of-Service (DoS) attacks simply occur in this network and lead to service slow down or system crash. At the present time, traditional techniques are being widely used to confront the denial-of-service attacks in the Internet of Things and unfortunately, smart techniques have been less studied and exploited. In this research, a security solution on the basis of game theory is proposed to detect the denial-of-service attacks and prevent the problems in the services of the network of the Internet of Things. In order to scrutinize the performance of the suggested method in the network, this method was simulated using the NS2 simulator. The simulation results confirmed that the game-theory strategies in the proposed method outperformed the existing methods. Furthermore, in order to verify the acquired findings, a comparative evaluation was exhibited according to the three factors of operational throughput, latency, and energy consumption.","authors":["Farzaneh Yazdankhah","Ali Reza Honarvar"],"meta":["January 2017International Journal of Advanced Computer Science and Applications 8(9)","DOI:10.14569/IJACSA.2017.080944","Project: Security in IoT"],"references":["317824207_A_Load_Balancing_Algorithm_for_Resource_Allocation_in_Cloud_Computing","282656436_Increasing_QoS_in_SaaS_for_low_Internet_speed_connections_in_cloud","271833842_A_Review_of_the_Advances_in_Cyber_Security_Benchmark_Datasets_for_Evaluating_Data-Driven_Based_Intrusion_Detection_Systems","269687360_Security_and_privacy_in_the_Internet_of_Things_Current_status_and_open_issues","322712978_Dynamic_resource_allocation_using_combinatorial_methods_in_Cloud_A_case_study","316081579_A_Hybrid_Algorithm_for_Dynamic_Resource_Allocation_in_Cloud_Computing","263808304_Network_Security_-_A_Decision_and_Game-Theoretic_Approach","261853691_A_Game_Theoretical_Attack-Defense_Model_Oriented_to_Network_Security_Risk_Assessment","261041221_Game_theory_for_security_Key_algorithmic_principles_deployed_systems_lessons_learned","260088045_Increasing_QoS_in_SaaS_for_low_Internet_speed_connections_in_cloud"]}