{"id":"320191001_Cognitive_Presence_in_Virtual_Learning_Community_An_EFL_Case","abstract":"This study aimed to investigate the existence of cognitive presence as one of the elements of the Community of Inquiry framework in virtual centers for undergraduate students of science and technology. To achieve the purpose of this study, first a questionnaire was uniquely developed on the basis of the suggestions made in the literature reviewing the indicators of cognitive element. The questionnaire was then administered to undergraduate students (N = 107) who were studying a technical or a technological course in the Iran University of Science and Technology and Khajeh Nasir Toosi University of Technology. Analysis of the questionnaire data showed that (a) the Exploration and Resolution categories appeared more frequently than others in the virtual centers of this study and (b) the indicators of Divergence, Information Exchange, and Applying New Ideas were hierarchically frequent. In order to promote and sustain cognitive presence, this study recommends that virtual language educators incorporate the indicators of cognitive presence into the online learning environment. Résumé Cette étude visait à examiner l'existence de la présence cognitive comme l'un des éléments du cadre de référence sur le Community of Inquiry (CoI) dans les centres virtuels pour des étudiants de premier cycle en sciences et technologie. Tout d'abord, pour atteindre l'objectif de cette étude, un questionnaire a été particulièrement bien développé sur la base des propositions faites dans la littérature en examinant les indicateurs d'élément cognitif. Ensuite, le questionnaire a été administré aux étudiants de premier cycle (N = 107) qui étudiaient un cours technique ou technologique à l'Iran University of Science and Technology et à Khajeh Nasir Toosi University of Technology. L'analyse des données du questionnaire a montré que (a) considérant les catégories, l'Exploration et la Résolution sont apparues plus fréquemment que d'autres dans les centres virtuels de cette étude, et (b) les indicateurs de Divergence, d'Échange d'informations et d'Application de nouvelles idées ont été fréquentes hiérarchiquement. Afin de promouvoir et soutenir la présence cognitive, cette étude encourage les éducateurs en langage virtuel d'intégrer les indicateurs de la présence cognitive dans l'environnement d'apprentissage en ligne.","authors":["Mohammad Alavi","Mahboubeh Taghizadeh"],"meta":["January 2013"],"references":["287556984_E-Learning_in_the_21st_century_A_framework_for_research_and_practice_Second_edition","284930930_Online_education_Analysis_of_interaction_and_knowledge_building_patterns_among_foreign_language_teachers","284740159_Communities_of_Inquiry_in_Online_Learning","284701129_The_development_of_a_Community_of_Inquiry_over_time_in_an_online_course_Understanding_the_progression_and_integration_of_social_cognitive_and_teaching_presence","257496491_Toward_the_development_of_a_metacognition_construct_for_communities_of_inquiry","321904255_Learning_to_Teach_in_the_21st_Century","313554152_Learning_presence_as_a_moderator_in_the_community_of_inquiry_model","284699289_Learning_in_communities_of_inquiry_A_review_of_the_literature","279907795_Face-to-Face_Versus_Threaded_Discussions_The_Role_of_Time_and_Higher-Order_Thinking","277165986_Identifying_and_Measuring_Ill-Structured_Problem_Formulation_and_Resolution_in_Online_Asynchronous_Discussions"]}