{"id":"320125751_Quantitative_laser_scanning_confocal_autofluorescence_microscopy_of_normal_and_premalignant_colonic_tissues","abstract":"Background/purpose Laser-induced fluorescence (LIF) spectroscopy of tissues has been proposed as an adjunct to endoscopy for in vivo diagnosis of premalignant lesions. However, many questions remain regarding the specific origins and biochemical correlates of gastrointestinal tissue autofluorescence. We report the first study of quantitative ultraviolet LIF spectral microscopy in human colonic tissues using laser scanning confocal fluorescence microscopy. Methods Frozen sections (6μm thickness) of 15 normal colonic tissues and 8 tubular adenomas were prepared from fresh surgical resections. LIF microscopy was performed with an Olympus LSM-GB200UV confocal microscope (argon-ion laser excitation at 351-364 nm). Fluorescent light remitted from specimens was spectrally filtered using optical barrier filters prior to photomultiplier tube detection. Spatially localized quantitative microscopy in specimens was performed by calibration of the microscope sensitivity as a function of detector gain, confocal aperture size, image scan speed, and microscope spectral throughput. To identify histological components accurately, the same frozen sections slides used for microscopy were fixed and H&E stained following confocal imaging. Results Microscopic tissue fluorescence emission was quantified in terms of the intrinsic fluorescence coefficient β(λ.) (cm⁻¹), defined as fluorescence power per unit tissue volume per unit wavelength (centered at λ) divided by incident light irradiance. In the 530-610 nm spectral region, mucosal fluorescence was observed in normal epithelial cell boundaries (β∼10-4.2 cm⁻¹) and in lamina propria connective tissue (β∼10-4.2∼-4.4 cm⁻¹). Markedly increased fluorescence emission was observed in the cytoplasm of dysplastic cells with β∼10-4.1 cm⁻¹. Eosinophils (β ∼ 10⁻⁴ cm⁻¹) and other bright granular structures (β ranging up to 10⁻³ cm⁻¹) emitted brighter fluorescence than surrounding connective tissue. Conclusions Quantitative laser scanning confocal autofluorescence microscopy reveals significant differences in fluorescence emission between histological components of normal and premalignant colonic tissues. Quantitation of fluorescence emission is essential for designing spectroscopic diagnostic instrumentation including the optimization of algorithms to differentiate between normal, premalignant, and malignant tissues.","authors":["H.-W. Wang","J. Willis","Joseph Izatt","M.V. Sivak"],"meta":["January 1997Gastrointestinal Endoscopy 45(4):AB42"],"references":[]}