{"id":"320100622_Bibliometric_Analysis_of_the_Flow_of_Publications_by_Novosibirsk_State_University_in_Collaboration_with_the_RAS_Siberian_Branch","abstract":"Novosibirsk National Research State University is one of Russia’s most intensively developing higher education institutions, demonstrating the highest growth rates of publishing activity. This is largely due to the university’s participation in the Program of Improving the Competitiveness of Leading Russian Higher Education Establishments (Project 5–100) and is explained by the close scientific interaction with organizations\nof Siberian Branch of the Russian Academy of Sciences. Using a wide range of bibliometric indicators, the authors have analyzed publications by associates of Novosibirsk State University (NSU) from 2000 through 2015 (about 80% of all NSU publications since the foundation of the university in 1960). Leading scientific trends have been identified, the intensity of collaboration with research establishments of the Novosibirsk Scientific Center and foreign organizations has been elucidated, and the journals with the highest number of publications by NSU associates have been analyzed. The most frequently cited scientific areas have been identified and compared with the global distribution of citations by discipline. The share of highly cited publications and their influence on the university’s average citation rate have been determined.","authors":["Nikolai A. Mazov","Vadim N. Gureyev"],"meta":["October 2017Herald of the Russian Academy of Sciences 87(5):445-453","DOI:10.1134/S1019331617050057"],"references":["287829392_Novosibirsk_state_university_in_the_light_of_bibliometrics_as_exemplified_by_Geology_and_geophysics_department","266264970_Integracia_akademiceskoj_i_universitetskoj_nauki_na_primere_Sankt-Peterburga_socialnye_tehnologii","257911537_Basic_research_in_the_Novosibirsk_oblast'_Bibliometrical_analysis_for_2004-2009","308114674_Government_investments_and_the_publishing_activity_of_higher_educational_institutions_Bibliometric_analysis","305785350_Gosudarstvennye_investicii_i_publikacionnaa_aktivnost_vuzov_bibliometriceskij_analiz","271242018_Publikacionnaa_aktivnost_i_naucnoe_sotrudnicestvo_vuzov_i_RAN","269371394_Publication_activity_and_research_cooperation_between_higher_education_institutions_and_the_Russian_Academy_of_Sciences","257663031_Research_performance_and_collaboration_in_the_Novosibirsk_region"]}