{"id":"320146192_A_global_perspective_on_evolving_bioinformatics_and_data_science_training_needs","abstract":"Bioinformatics is now intrinsic to life science research, but the past decade has witnessed a continuing deficiency in this essential expertise. Basic data stewardship is still taught relatively rarely in life science education programmes, creating a chasm between theory and practice, and fuelling demand for bioinformatics training across all educational levels and career roles. Concerned by this, surveys have been conducted in recent years to monitor bioinformatics and computational training needs worldwide. This article briefly reviews the principal findings of a number of these studies. We see that there is still a strong appetite for short courses to improve expertise and confidence in data analysis and interpretation; strikingly, however, the most urgent appeal is for bioinformatics to be woven into the fabric of life science degree programmes. Satisfying the relentless training needs of current and future generations of life scientists will require a concerted response from stakeholders across the globe, who need to deliver sustainable solutions capable of both transforming education curricula and cultivating a new cadre of trainer scientists.","authors":["Teresa K Attwood","Sarah Blackford","Michelle D Brazas","Angela Davies"],"meta":["August 2017Briefings in Bioinformatics 20(2)","DOI:10.1093/bib/bbx100","Project: Bioinformatics"],"references":["326978454_A_global_perspective_on_bioinformatics_training_needs","320512078_Unmet_needs_for_analyzing_biological_big_data_A_survey_of_704_NSF_principal_investigators","307778408_Correction_GOBLET_The_Global_Organisation_for_Bioinformatics_Learning_Education_and_Training","274716405_GOBLET_The_Global_Organisation_for_Bioinformatics_Learning_Education_and_Training","268795222_Teaching_Bioinformatics_in_Concert","268789498_Computational_Thinking_in_Life_Science_Education","265418910_The_GOBLET_Training_Portal_A_Global_Repository_of_Bioinformatics_Training_Materials_Courses_and_Trainers","260610641_Bioinformatics_Curriculum_Guidelines_Toward_a_Definition_of_Core_Competencies","316055498_Training_Plug_gap_in_essential_bioinformatics_skills","274725704_Core_services_Reward_bioinformaticians"]}