{"id":"320101983_Computer_Science_Papers_in_Web_of_Science_A_Bibliometric_Analysis","abstract":"In this article we present a bibliometric study of 1.9 million computer science papers published from 1945 to 2014 and indexed in Web of Science. We analyze both the quantity and the impact of these publications according to document types, languages, disciplines, countries, institutions, and publication sources. The most frequent author keywords, cited references, and cited papers as well as the distribution of the number of references and citations per paper and of the age of cited references are also explored. Since conference proceedings play a tremendous role in this scientific field, we investigate the time and place of computer science conferences in terms of the most prolific months and locations. And, last but not least, the production of journal articles and conference papers over the whole time period and the level of collaboration in different computer science disciplines are inspected. One of the main results is the finding that “Artificial Intelligence” is the most productive subfield of computer science, but “Interdisciplinary Applications” has the highest relative impact.","authors":["Dalibor Fiala","Gabriel Tutoky"],"meta":["September 2017Publications 5(4)","DOI:10.3390/publications5040023","Project: Modern informetric methods for the evaluation of scientific research"],"references":["314652092_Second_Language_Writing_Publications_in_Web_of_Science_A_Bibliometric_Analysis","311711876_Evolution_in_the_number_of_authors_of_computer_science_publications","289587488_Publication_Boost_in_Web_of_Science_Journals_and_Its_Effect_on_Citation_Distributions","282003672_Computer_science_in_Eastern_Europe_1989-2014_A_bibliometric_study","275527716_Conferences_versus_journals_in_computer_science_Conferences_vs_Journals_in_Computer_Science","235254266_Computer_science_research_in_Malaysia_A_bibliometric_analysis","260110272_Citation_impact_analysis_of_top_ranked_computer_science_journals_and_their_rankings","258140631_The_development_of_computer_science_research_in_the_People's_Republic_of_China_2000-2009_A_bibliometric_study","225759827_Scientific_research_competitiveness_of_world_universities_in_computer_science","222518823_The_skewness_of_computer_science"]}