{"id":"320258448_A_INFORMATICA_COMO_INSTRUMENTO_NO_ENSINO_DE_BIOLOGIA_ESTUDO_DE_CASO_NA_CIDADE_DE_OURICURI-PE_COMPUTATION_AS_AN_INSTRUMENT_IN_THE_TEACHING_OF_BIOLOGY_CASE_STUDY_IN_THE_CITY_OF_OURICURI-PE","abstract":"Resumo: Uma forma de se obter uma melhoria na qualidade de vida dos cidadãos se dá através do conhecimento o qual pode envolver diversas áreas a exemplo de: ciência, educação, informática e línguas. O percurso principal é a procura da educação de qualidade, onde a forma de ensino aprendizagem seja a cada dia mais estimulada, seja com novas metodologias didáticas ou novos instrumentos que auxiliem tal tarefa. Este estudo teve como objetivo averiguar a noção da importância do uso da informática para o ensino de Ciências e Biologia na Cidade de Ouricuri-PE, na visão de docentes. Para levantamento de dados houve a aplicação de questionários pré-elaborados aos professores, com questões enfocando o ensino Ciências e Biologia frente às novas tecnologias computacionais. Os resultados apontam que é necessária a atualização nos métodos de ensino, principalmente nas áreas de ciências e biologia, devido as constantes mudanças, de modo a tornar mais acessível à aprendizagem, levando de uma forma geral ao entendimento de que a informática é uma ferramenta importante para viabilizar o detalhamento de disciplinas com tantas diferenciações e especificidades. Palavras-chave: Instrumentos. Ensino-aprendizagem. Informática. TICs. Abstract: One way to obtain an improvement in the quality of life of those who are possible, through knowledge of knowledge, can involve several areas and example of: science, education, computer science and languages. The main course and the search for quality education, where it is a form of learning teaching, increasingly stimulated, with all didactic methodologies or new tools and auxiliary tasks. This study aimed to investigate the notion of importance of how the use of information technology can subsidize the teaching of Science and Biology of the City of Ouricuri-PE, in the view of teachers. For data collection, the application of pre-elaborated questionnaires to teachers, with subjects focusing on the teaching of Science and Biology in relation to new computational technologies. The results point out that it is an update on teaching methods, especially in the field of science, since it is in search of changes, so that it is more accessible to the form of learning, leading in a general way to the understanding that informatics is a an important tool to enable the detailing of disciplines with so many differentiations and specificities.","authors":["José Weverton Almeida-Bezerra","Niwiarakelly da Silva Monte","Felicidade Caroline Rodrigues","Maria ivaneide Rocha"],"meta":["June 2017","Project: Educação"],"references":["318915584_Redes_sociais_de_internet_numa_escola_de_ensino_medio_entre_aprendizagens_mutuas_e_conhecimentos_escolares","289527518_O_uso_da_Internet_na_educacao_superior_de_graduacao_estudo_de_caso_de_uma_universidade_publica_brasileira","267827637_Bioinformatica_como_recurso_pedagogico_para_o_curso_de_Ciencias_Biologicas_na_Universidade_Estadual_do_Ceara_-_UECE_-_Fortaleza_Estado_do_Ceara","26374721_Familia_escola_e_midia_um_campo_com_novas_configuracoes","313498634_The_efficacy_of_computer-assisted-instruction_CAI_-_A_meta_analysis","305320902_O_Ensino_de_Ciencias_no_projeto_um_computador_por_aluno_em_escolas_publicas_de_Rondonia","270358484_UM_SURVEY_SOBRE_O_USO_DE_TECNOLOGIAS_NO_ENSINO","239030875_Computers_and_Learning_A_Review_of_Recent_Research","40838458_Interdisciplinaridade_no_ensino_medio_desafios_e_potencialidades"]}