{"id":"320213977_A_bit_of_both_science_and_economics_a_non-traditional_STEM_identity_narrative","abstract":"Black males, as one non-dominant population, remain underrepresented and less successful in science, technology, engineering, and mathematics (STEM). Researchers focused on non-dominant populations are advised against generalizations and to examine cultural intersections (i.e. race, ethnicity, gender, and more) and also to explore cases of success, in addition to cases of under-achievement and underrepresentation. This study has focused on one African American male, Randy, who expressed high-achieving STEM career goals in computer science and engineering. Furthermore, recognizing that culture and identity development underlie STEM engagement and persistence, this long-term case study focused on how Randy developed a STEM identity during the course of the study and the implications of that process for his STEM career exploration. Étienne Wenger’s (1999) communities-of-practice (CoP) was employed as a theoretical framework and, in doing so, (1) the informal STEM program in which Randy participated was characterized as a STEM-for-social-justice CoP and (2) Randy participated in ways that consistently utilized an “economics” lens from beyond the boundaries of the CoP. In doing so, Randy functioned as a broker within the CoP and developed a non-traditional STEM identity-in-practice which integrated STEM, “economics”, and community engagement. Randy’s STEM identity-in-practice is discussed in terms of the contextual factors that support scientific identity development (Hazari et al. in J Res Sci Teach 47:978–1003, 2010), the importance of recognizing and supporting the development of holistic and non-traditional STEM identities, especially for diverse populations in STEM, and the implications of this new understanding of Randy’s STEM identity for his long-term STEM career exploration.","authors":["Sheron Mark"],"meta":["December 2018Cultural Studies of Science Education 13(4)","DOI:10.1007/s11422-017-9832-2"],"references":["305800698_Valuing_difference_in_students'_culture_and_experience_in_school_science_lessons","280310869_Understanding_Black_Male_Mathematics_High_Achievers_from_the_Inside_Out_Internal_Risk_and_Protective_Factors_in_High_School","355207685_The_culture_of_power_and_science_education_Learning_from_Miguel","345519746_The_Souls_of_Black_Folk","320551188_Youth_participatory_action_research_A_pedagogy_of_transformational_resistance_for_critical_youth_studies","319393603_Communities_of_Practice_Learning_Meaning_and_Identity","288494706_Excerpts_from_Science_and_Engineering_Indicators_2000","286265523_STEM_road_map_A_framework_for_integrated_STEM_education","267416829_On_Defense_African_American_Males_Making_Sense_of_Racialized_Narratives_in_Mathematics_Education","267216485_Droppin'_Science_and_Dropping_Science_African_American_Males_and_Urban_Science_Education","260938437_Desiring_a_Career_in_STEM-Related_Fields_How_Middle_School_Girls_Articulate_and_Negotiate_Identities-In-Practice_in_Science","254088835_Questioning_a_White_Male_Advantage_in_STEM_Examining_Disparities_in_College_Major_by_Gender_and_RaceEthnicity","248018270_The_Souls_of_Black_Folk","241710032_Navigating_the_heteronormativity_of_engineering_The_experiences_of_lesbian_gay_and_bisexual_students","232522222_Social_Cognitive_Predictors_of_Academic_Interests_and_Goals_in_Engineering_Utility_for_Women_and_Students_at_Historically_Black_Universities"]}