{"id":"320280511_Developing_Emotional_Design_Emotions_as_Cognitive_Processes_and_their_Role_in_the_Design_of_Interactive_Technologies","abstract":"In the last 20 years, the debate on the role of emotions in the field of industrial design has grown exponentially. Emotional Design emerged as the effort to promote positive emotions or pleasure in users by means of design properties of products and services. Design based on emotions can affect overall user experience deeply, since emotions influence\ndecision making, affect attention, memory, and generate meaning. It is possible to identify two main approaches to applied emotional design. The first is based on the modification of object’s aesthetic appearance or interface, the latter focuses on promoting fluent and engaging interactions.\nThe objective of the present contribution is to extend the discourse on emotional design,\nhighlighting that technology designers can rely on other components beyond the above-mentioned aesthetic and engagement ones, in order to create innovative and effective devices. Indeed, emotions have further aspects that could be exploited by emotional designers. According to this perspective, new technologies can be considered and treated as opportunities to manipulate, enhance and trigger different discrete, and even complex emotional states. Moreover, emotions can “participate” to interaction (instead of being a mere byproduct of it), by providing inputs to digital technologies to modify or influence final outputs. This contribution explores opportunities provided by conceiving emotions as cognitive processes and active agents of interactions, in the field of emotional design.","authors":["Stefano Triberti","Alice Chirico","Gemma la Rocca","Giuseppe Riva"],"meta":["October 2017Frontiers in Psychology 8(1773)","DOI:10.3389/fpsyg.2017.01773","Projects: Transformative Experience DesignPositive Technology: Designing digital e-experiences for positive personal change"],"references":["316512480_Effectiveness_of_Immersive_Videos_in_Inducing_Awe_An_Experimental_Study","309770705_The_Potential_of_Virtual_Reality_for_the_Investigation_of_Awe","309313210_Transformative_Interactions_Designing_Positive_Technologies_to_Foster_Self-Transcendence_and_Meaning","306007130_The_Discrete_Emotions_Questionnaire_A_New_Tool_for_Measuring_State_Self-Reported_Emotions","350037635_Feelings_and_Consumer_Decision_Making_The_Appraisal-Tendency_Framework","344473116_The_flow_experience_and_its_significance_for_human_psychology","317160621_A_Mathematical_Model_Captures_the_Structure_of_Subjective_Affect","313557438_User-centered_design","306027667_The_quest_for_engaging_AmI_Patient_engagement_and_experience_design_tools_to_promote_effective_Assisted_Living","303979705_Customer_emotions_and_their_triggers_in_luxury_retail_Understanding_the_effects_of_customer_emotions_before_and_after_entering_a_luxury_shop"]}