{"id":"320279995_Multiresolution_Consensus_Clustering_in_Networks","abstract":"Networks often exhibit structure at disparate scales. We propose a method for identifying community structure at different scales based on multiresolution modularity and consensus clustering. Our contribution consists of two parts. First, we propose a strategy for sampling the entire range of possible resolutions for the multiresolution modularity quality function. Our approach is directly based on the properties of modularity and, in particular, provides a natural way of avoiding the need to increase the resolution parameter by several orders of magnitude to break a few remaining small communities, necessitating the introduction of ad-hoc limits to the resolution range with standard sampling approaches. Second, we propose a hierarchical consensus clustering procedure, based on a modified modularity, that allows one to construct a hierarchical consensus structure given a set of input partitions. While here we are interested in its application to partitions sampled using multiresolution modularity, this consensus clustering procedure can be applied to the output of any clustering algorithm. As such, we see many potential applications of the individual parts of our multiresolution consensus clustering procedure in addition to using the procedure itself to identify hierarchical structure in networks.","authors":["Lucas G. S. Jeub","Olaf Sporns","Santo Fortunato"],"meta":["February 2018Scientific Reports 8(1)","DOI:10.1038/s41598-018-21352-7"],"references":["345711067_The_Impact_of_Random_Models_on_Clustering_Similarity","317558422_Post-Processing_Partitions_to_Identify_Domains_of_Modularity_Optimization","310769939_The_many_facets_of_community_detection_in_complex_networks","307545285_Multi-scale_brain_networks","306376722_The_ground_truth_about_metadata_and_community_detection_in_networks","282126438_Modular_Brain_Networks","312620254_The_Impact_of_Random_Models_on_Clustering_Similarity","310741352_Equivalence_between_modularity_optimization_and_maximum_likelihood_methods_for_community_detection","305780197_Community_detection_in_networks_A_user_guide","283738615_Resolution_limit_in_community_detection"]}