{"id":"320296841_Characterizing_in-text_citations_in_scientific_articles_A_large-scale_analysis","abstract":"We report characteristics of in-text citations in over five million full text articles from two large databases - the PubMed Central Open Access subset and Elsevier journals - as functions of time, textual progression, and scientific field. The purpose of this study is to understand the characteristics of in-text citations in a detailed way prior to pursuing other studies focused on answering more substantive research questions. As such, we have analyzed in-text citations in several ways and report many findings here. Perhaps most significantly, we find that there are large field-level differences that are reflected in position within the text, citation interval (or reference age), and citation counts of references. In general, the fields of Biomedical and Health Sciences, Life and Earth Sciences, and Physical Sciences and Engineering have similar reference distributions, although they vary in their specifics. The two remaining fields, Mathematics and Computer Science and Social Science and Humanities, have different reference distributions from the other three fields and between themselves. We also show that in all fields the numbers of sentences, references, and in-text mentions per article have increased over time, and that there are field-level and temporal differences in the numbers of in-text mentions per reference. A final finding is that references mentioned only once tend to be much more highly cited than those mentioned multiple times.","authors":["Kevin Boyack","Nees Jan van Eck","Giovanni Colavizza","Ludo Waltman"],"meta":["February 2018Journal of Informetrics 12(1):59–73","DOI:10.1016/j.joi.2017.11.005"],"references":["297679372_Tracing_the_indirect_societal_impacts_of_biomedical_research_development_and_piloting_of_a_technique_based_on_citations","267728073_The_top_100_papers","260072813_Measuring_Academic_Influence_Not_All_Citations_Are_Equal","320134921_Understanding_multiply_mentioned_references","312802096_Functions_of_Uni-_and_Multi-citations_Implications_for_Weighted_Citation_Analysis","269222949_The_Invariant_Distribution_of_References_in_Scientific_Articles","261476659_Are_all_literature_citations_equally_important_Automatic_citation_strength_estimation_and_its_applications","257692378_The_distribution_of_references_across_texts_Some_implications_for_citation_analysis","256082232_Improving_the_accuracy_of_co-citation_clustering_using_full_text","256076230_Where_are_Citations_Located_in_the_Body_of_Scientific_Articles_A_Study_of_the_Distributions_of_Citation_Locations"]}