{"id":"320212633_New_Perspectives_of_Alzheimer_Disease_Diagnosis_-_the_Most_Popular_and_Future_Methods","abstract":"As lifespan tendency is increasing, age-related diseases are becoming a burden to the society and health care system. Mostly incurable, constitute a subject of researchers' work. In this review the insight into the problem of Alzheimer Disease (AD) diagnostics will be given. The unquestionable diagnosis is possible only during a post-mortem examination. AD is known as one of the forms of dementia and its differentiation from mild cognitive impairments has to be improved. Despite a great diagnostic progress during last decades, medicine still needs more accurate tools for an early detection of this incurable disease. It is hoped that this strategy will enable an administration of more aggressive therapy preventing AD development. Nowadays, pharmacotherapy is based mainly on symptomatic treatment which is not able to reverse pathological changes caused by the disease. Hence, more accurate identifying testing and monitoring methods are crucial to reveal new therapeutic targets. The most popular present techniques for detecting local brain functional changes use nuclear medicine imaging devices: Positron Emission Tomography (PET) and Single Photon Emission Computed Tomography (SPECT). Constant process of improving is not possible without new radiotracers. Magnetic Resonance Imaging (MRI) is a tool for an assessment of structural changes in brain tissue. However, providing satisfying results, these methods are not completely specific and accurate. As very promising hallmarks of AD enhancing high accuracy of testing, biomarkers -tau tangles and β-amyloid plaques- have been found. At the present time are being used only as an additional examination, one day may become a gold standard of AD diagnostics.","authors":["Katarzyna Dziubek","Kamila Czarnecka","Elzbieta Mikiciuk-Olasik","Paweł Szymański"],"meta":["October 2017Medicinal chemistry (Shāriqah (United Arab Emirates)) 14(1)","DOI:10.2174/1573406413666171002120847"],"references":[]}