{"id":"320265756_Effect_of_Sodium_Chloride_and_Incision_on_the_Chicken_Pepsin_Coagulant_Activity_Extracted_from_Proventriculus_Dried_Under_Partial_Vacuum","abstract":"Rennet covers only 30% of the world's cheese production because the availability of calf stomach becomes limited (FAO). This lack has suggested the search for animal, vegetable or microbial enzyme substitutes. Among the alternative animal enzymes, chicken pepsin. In order to study the chicken pepsin stability over time, chicken proventriculus, whole or incised into four parts or incised into slices, without or with salt addition distributed into six different lots, were dried under partial vacuum (47°C, 800 mbar). The effects of the incision or not, as well as the addition or not of salt, and storage time of dried proventriculus, on the coagulant activity of pepsin extracts (expressed in equivalents Rennet Units) were studied. The six lots pepsin residual activities determined immediately after drying operation expressed the relative yield in the fresh state before storage. They were between 50% for proventriculus cut into four parts without salt addition and 18% for proventriculus with salt addition.\nAfter 54 days of storage, the residual activity was relatively distinct for proventriculus cut into four parts without salt addition: 35.5% and for the proventriculus incised into slices with salt addition of 4.7%. Salt seemed to have caused a great loss of activity during salting. In addition, the incision effect combined to salt addition showed a remarkable loss of activity. During the storage period, the pepsin residual coagulant activity showed better stability of partially vacuum-dried proventriculus cut into four parts and unsalted.","authors":["Férial aziza Benyahia Krid","Faiza Adoui","Aissaoui Ouarda","Halima Boughellout"],"meta":["January 2017","DOI:10.4172/2329-888X.1000187"],"references":["244603042_Methods_for_processing_experimental_drying_kinetics_data","323825371_Preservatives_Traditional_Preservatives_-_Sodium_Chloride","305147548_Microbial_biotechnology_Principles_and_applications_third_edition","223892146_Microbial_succession_and_identification_of_Micrococcaceae_in_dried_beef_cecina_an_intermediate_moisture_meat_product","51778055_Technological_and_safety_properties_of_Lactobacillus_plantarum_strains_isolated_from_a_Tunisian_traditional_salted_meat","51776076_Characterization_and_technological_properties_of_Staphylococcus_xylosus_strains_isolated_from_a_Tunisian_salted_meat","38982170_Science_du_lait_principes_des_techniques_laitieres","12206181_A_survey_on_the_microbiological_changes_during_the_manufacture_of_dry-cured_lacn_a_Spanish_traditional_meat_product","6845885_Microbiological_characteristics_of_androlla_a_Spanish_traditional_pork_sausage"]}