{"id":"320294756_Object_detection_through_search_with_a_foveated_visual_system","abstract":"Humans and many other species sense visual information with varying spatial resolution across the visual field (foveated vision) and deploy eye movements to actively sample regions of interests in scenes. The advantage of such varying resolution architecture is a reduced computational, hence metabolic cost. But what are the performance costs of such processing strategy relative to a scheme that processes the visual field at high spatial resolution? Here we first focus on visual search and combine object detectors from computer vision with a recent model of peripheral pooling regions found at the V1 layer of the human visual system. We develop a foveated object detector that processes the entire scene with varying resolution, uses retino-specific object detection classifiers to guide eye movements, aligns its fovea with regions of interest in the input image and integrates observations across multiple fixations. We compared the foveated object detector against a non-foveated version of the same object detector which processes the entire image at with homogeneous high spatial resolution. We evaluated the accuracy of the foveated and non-foveated object detectors identifying 20 different objects classes in scenes from a standard computer vision data set (the PASCAL VOC 2007 dataset). We show that the foveated object detector can approximate the performance of the object detector with homogeneous high spatial resolution processing while bringing significant computational cost savings. Additionally, we assessed the impact of foveation on the computation of bottom-up saliency. An implementation of a simple foveated bottom-up saliency model with eye movements showed agreement in the selection of top salient regions of scenes with those selected by a non-foveated high resolution saliency model. Together, our results might help explain the evolution of foveated visual systems with eye movements as a solution that preserves perceptual performance in visual search while resulting in computational and metabolic savings to the brain.","authors":["Emre Akbas","Miguel P. Eckstein"],"meta":["October 2017PLoS Computational Biology 13(10):e1005743","DOI:10.1371/journal.pcbi.1005743"],"references":["317186542_Feedback_from_higher_to_lower_visual_areas_for_visual_recognition_may_be_weaker_in_the_periphery_Glimpses_from_the_perception_of_brief_dichoptic_stimuli","319770820_Histograms_of_Oriented_Gradients_for_Human_Detection","319770453_Discriminative_Decorrelation_for_Clustering_and_Classification","319770284_Edge_Boxes_Locating_Object_Proposals_from_Edges","319769911_Faster_R-CNN_Towards_Real-Time_Object_Detection_with_Region_Proposal_Networks","319600209_Humans_but_Not_Deep_Neural_Networks_Often_Miss_Giant_Targets_in_Scenes","318715909_Probabilistic_Computations_for_Attention_Eye_Movements_and_Search","316240097_Distinctive_Image_Features_from_Scale-Invariant_Keypoints","314971716_Beyond_Scene_Gist_Objects_Guide_Search_More_Than_Scene_Background","311610901_Reinforcement_Learning_for_Visual_Object_Detection","310752533_Visualizing_and_understanding_convolutional_networks","309325395_Capabilities_and_Limitations_of_Peripheral_Vision","304541640_A_saliency_map_in_primary_visual_cortex","287630991_Oculomotor_behaviour_in_vertebrates_and_invertebrates","285970633_Advances_in_Neural_Information_Processing_Systems"]}