{"id":"320241340_Robust_Unscented_Kalman_Filter_for_Power_System_Dynamic_State_Estimation_With_Unknown_Noise_Statistics","abstract":"Due to the communication channel noises, GPS synchronization process, changing environment temperature and different operating conditions of the system, the statistics of the system process and measurement noises may be unknown and they may not follow Gaussian distributions. As a result, the traditional Kalman filter-based dynamic state estimator (DSE) may provide strongly biased state estimates. To address these issues, this paper develops a robust Generalized Maximum-likelihood Unscented Kalman Filter (GM-UKF). The statistical linearization approach is presented to derive a compact batch-mode regression form by processing the predicted state vector and the received measurements simultaneously. This regression form enhances the data redundancy and allows us to detect bad PMU measurements and incorrect state predictions, and filter out unknown Gaussian and non-Gaussian noises through the generalized maximum likelihood (GM)-estimator. The latter minimizes a convex Huber function with weights calculated via the projection statistics (PS). Particularly, the PS is applied to a proposed 2-dimensional matrix that consists of temporally correlated innovation vectors and predicted states. Finally, the total influence function is used to derive the error covariance matrix of the GM-UKF state estimates, yielding the robust state prediction at the next time instant. Extensive simulations carried out on the IEEE 39-bus test system demonstrate the effectiveness and robustness of the proposed method.","authors":["Junbo Zhao","Lamine Mili"],"meta":["October 2017IEEE Transactions on Smart Grid PP(99)","DOI:10.1109/TSG.2017.2761452","Project: Development of Robust Dynamic State Estimator for Power System Monitoring and Control"],"references":["320237304_Assessing_Gaussian_Assumption_of_PMU_Measurement_Error_Using_Field_Data","312944531_Robust_Dynamic_State_Estimator_to_Outliers_and_Cyber_Attacks","309848750_A_Robust_Iterated_Extended_Kalman_Filter_for_Power_System_Dynamic_State_Estimation","309790315_A_Multi-Step_Adaptive_Interpolation_Approach_to_Mitigating_the_Impact_of_Nonlinearity_on_Dynamic_State_Estimation","329898719_Derivative-free_Kalman_filtering_based_Approaches_to_Dynamic_State_Estimation_for_Power_Systems_with_Unknown_Inputs","319056501_Power_System_Dynamic_State_Estimation_Considering_Measurement_Correlations","316115971_Derivative-Free_Kalman_Filtering_Based_Approaches_to_Dynamic_State_Estimation_for_Power_Systems_With_Unknown_Inputs","315903163_Dynamic_State_Estimation_with_Model_Uncertainties_Using_H-infinity_Extended_Kalman_Filter","308845527_Capturing_real-time_power_system_dynamics_Opportunities_and_challenges","308536305_Dynamic_State_Estimation_Based_Protection_Status_and_Promise"]}