{"id":"320339439_Column_planarity_and_partially-simultaneous_geometric_embedding","abstract":"We introduce the notion of column planarity of a subset R of the vertices of a graph G. Informally, we say that R is column planar in G if we can assign x-coordinates to the vertices in R such that any assignment of y-coordinates to them produces a partial embedding that can be completed to a plane straight-line drawing of G. Column planarity is both a relaxation and a strengthening of unlabeled level planarity. We prove near tight bounds for the maximum size of column planar subsets of trees: every tree on n vertices contains a column planar set of size at least 14n/17 and for any ɛ > 0 and any sufficiently large n, there exists an n-vertex tree in which every column planar subset has size at most (5/6 + ɛ)n. In addition, we show that every outerplanar graph has a column planar set of size at least n/2. We also consider a relaxation of simultaneous geometric embedding (SGE), which we call partially-simultaneous geometric embedding (PSGE). A PSGE of two graphs G1 and G2 allows some of their vertices to map to two different points in the plane. We show how to use column planar subsets to construct k-PSGEs, which are PSGEs in which at least k vertices are mapped to the same point for both graphs. In particular, we show that every two trees on n vertices admit an 11n/17-PSGE and every two outerplanar graphs admit an n/4-PSGE.","authors":["Luis Barba","William Evans","Michael Hoffmann","Vincent Kusters"],"meta":["January 2017Journal of Graph Algorithms and Applications 21(6):983-1002","DOI:10.7155/jgaa.00446"],"references":["305881262_Drawing_Planar_Graphs_with_Many_Collinear_Vertices","225722154_A_Polynomial_Bound_for_Untangling_Geometric_Planar_Graphs","220452561_Untangling_a_Planar_Graph","30508998_Simultaneous_Geometric_Graph_Embeddings","30508990_Matched_Drawings_of_Planar_Graphs","312206444_The_Utility_of_Untangling","291236740_Column_Planarity_and_Partial_Simultaneous_Geometric_Embedding","283811234_Planar_and_Quasi-Planar_Simultaneous_Geometric_Embedding","223862418_On_simultaneous_planar_graph_embeddings","222201205_Characterization_of_Unlabeled_Level_Planar_Trees"]}